[{"file": "1601.06934.tex", "nexttext": "\nwhere $H$ is the latent heat, $\\rho_L$ ($\\rho_V$) is the density of the liquid (gas) phase, $\\sigma$ is the\nsurface tension, and $g$ is the gravity acceleration. While this expression fits a number of experimental data\nsets, the underlying physics is questionable. Indeed, the vapor column morphology of boiling is quite rarely\nobserved while the BC exist for almost all morphologies of boiling, for pool boiling (i.e., natural convection\nboiling) or for flow boiling (i.e. boiling of the fluid flowing in a heated tube). Besides, many experimental\nresults, in particular those obtained in low-gravity \\cite{Straub}, cannot be fitted by Eq.~(\\ref{Zub}). Other\nphysical phenomena should then be responsible for the triggering of BC. A strong dependence of CHF on the\nwetting properties of the heater \\cite{Dhir} suggests a phenomenon at the contact line level.\n\n\nA vapor recoil mechanism for BC has already been proposed in \\cite{EuLet99,IJHMT01}. A fluid molecule leaving\nthe liquid interface causes a recoil force analogous to that created by the gas emitted by a rocket engine. It\npushes the interface towards the liquid side in the normal direction. An average vapor recoil force appears\nbecause the fluid necessarily expands while transforming from the liquid to the gas phase. The stronger the mass\nevaporation rate $\\eta$ (per time and interface area), the larger the vapor recoil force. One finds that the\nvapor recoil force per interface area is $P_r=\\eta^2(\\rho_V^{-1}-\\rho_L^{-1})$ \\cite{EuLet99}. The evaporation\nis particularly strong in the vicinity of the contact line of a bubble, inside the superheated layer of the\nliquid (Fig.~\\ref{brec}).\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=6cm]{b_rec}\n\\caption{Sketch illustrating how the vapor recoil initiates the bubble spreading. The amplitude and direction of\nthe vapor recoil force are shown by arrows.} \\label{brec}\n\\end{figure}\nThe resulting vapor recoil force can pull apart the bubble contact line and make it spread over the heater, thus\ncreating a nucleus for the vapor film. The results of the vapor recoil model are in qualitative agreement with\nthe observations by some of us \\cite{PRE01} and those by other groups \\cite{Kandlikar,Nishio}. The present\nLetter deals with its quantitative verification.\n\nConsider the fluid far from its critical point, where the system pressure $p\\ll p_c$ ($p_c$ is the critical\npressure). Instead of using pressure, it is more convenient to argue in terms of the saturation temperature $T$\nfrom which $p$ can be obtained readily. An estimation \\cite{EuLet99} shows that the heat flux necessary to\ncreate a vapor recoil force comparable to that of the surface tension corresponds to the experimental CHF order\nof magnitude. If the contributions of the vapor recoil and the surface tension $\\sigma$ are of the same order,\n\n", "itemtype": "equation", "pos": 3614, "prevtext": "\n\\title{Experimental evidence of the vapor recoil mechanism in the boiling crisis}\n\\author{V. S. Nikolayev}\\email[Web page: ]{http://www.pmmh.espci.fr/~vnikol}\n\\affiliation{ESEME, Service des Basses Temp\\'eratures, DRFMC/DSM/CEA-Grenoble,\\\\\n17 rue des Martyrs, 38054 Grenoble Cedex 9, France} \\affiliation{CEA-ESEME, ESPCI-PMMH-P6-P7, 10, rue Vauquelin,\n75231 Paris Cedex 5, France}\n\\author{D. Chatain}\\affiliation{ESEME, Service des Basses Temp\\'eratures, DRFMC/DSM/CEA-Grenoble,\\\\\n17 rue des Martyrs, 38054 Grenoble Cedex 9, France}\n\\author{Y. Garrabos}\n\\affiliation{CNRS-ESEME, Institut de Chimie de la Mati\\`{e}re Condens\\'{e}e de Bordeaux,\\\\\nUniversit\\'{e} de Bordeaux I, Avenue du Dr. Schweitzer, 33608 Pessac Cedex, France}\n\\author{D. Beysens}\n\\affiliation{ESEME, Service des Basses Temp\\'eratures, DRFMC/DSM/CEA-Grenoble,\\\\\n17 rue des Martyrs, 38054 Grenoble Cedex 9, France} \\affiliation{CEA-ESEME, ESPCI-PMMH, 10, rue Vauquelin, 75231\nParis Cedex 5, France}\n\\date{\\today} \\pacs{47.55.dp, 47.55.dd, 47.55.np, 68.35.Rh}\n\n\\begin{abstract}\nBoiling crisis experiments are carried out in the vicinity of the liquid-gas critical point of H$_2$. A magnetic\ngravity compensation set-up is used to enable nucleate boiling at near critical pressure. The measurements of\nthe critical heat flux that defines the threshold for the boiling crisis are carried out as a function of the\ndistance from the critical point. The obtained power law behavior and the boiling crisis dynamics agree with the\npredictions of the vapor recoil mechanism and disagree with the classical vapor column mechanism.\n\\end{abstract}\\maketitle\n\nBoiling is a highly efficient way to transfer heat. This is why it is widely used, in particular in high power\nindustrial heat exchangers, e.g. nuclear power plant steam generators. Boiling is often considered by the\nphysics community as a well understood phenomenon, at least qualitatively. It is true that boiling has been\nstudied extensively by experiment for common fluids and conventional regimes, for instance for water at\natmospheric pressure and moderate heat flux supplied to the fluid. However, the basic theory of boiling remains\n\\emph{terra incognita}, in particular, the phenomena very close to the heating surface, at a scale much smaller\nthan the vapor bubbles \\cite{Dhir}.\n\nThe efficiency of industrial heat exchangers increases with the heat flux. However, there is a limit called\nCritical Heat Flux (CHF). It corresponds to a transition from nucleate boiling (boiling in its usual sense) to\nfilm boiling where the heater is covered by a quasi-continuous vapor film and the evaporation occurs at the\ngas-liquid interface. Since the gas conducts heat much less than the liquid, the heat transfer efficiency drops\nsharply during this transition and the heater heats up, which may cause its damage if the power is not cut\nimmediately. This transition is called ``burnout\", ``departure from nucleate boiling\" or ``Boiling Crisis\" (BC).\n\nAmong several dozens of existing models of BC, the Zuber approach \\cite{Dhir,Theo} is the only one that can be\nconsidered as a theory, the others being mainly empirical. According to this model, vapor columns form at the\nnucleation sites on the heater. The vapor moves upwards while the liquid moves to the bottom of the column where\nevaporation occurs. This counter-flow motion induces the Kelvin-Helmholtz instability, which leads to the\ndestabilization of the whole system and to the creation of a vapor film on the heater. The transition occurs\nwhen the vapor velocity exceeds a threshold \\cite{Theo} resulting in the following CHF expression,\n\n", "index": 1, "text": "\\begin{equation}\\label{Zub}\n   q_{CHF}\\sim H[\\sigma g (\\rho_L-\\rho_V)\\rho_V^2]^{1/4},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"q_{CHF}\\sim H[\\sigma g(\\rho_{L}-\\rho_{V})\\rho_{V}^{2}]^{1/4},\" display=\"block\"><mrow><mrow><msub><mi>q</mi><mrow><mi>C</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>∼</mo><mrow><mi>H</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mi>σ</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ρ</mi><mi>L</mi></msub><mo>-</mo><msub><mi>ρ</mi><mi>V</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>ρ</mi><mi>V</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">]</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>4</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06934.tex", "nexttext": "\nwhere the capillary length $l_c=\\sqrt{\\sigma/g(\\rho_L-\\rho_V)}$ is the natural lengthscale. Eq.~(\\ref{rat})\nresults in a CHF expression identical to Zuber's expression (\\ref{Zub}) if the inequality $\\rho_L\\gg\\rho_V$ is\ntaken into account. Both models are then difficult to distinguish far from the critical temperature $T_c$.\n\nOn the contrary, their behaviors close to $T_c$ are quite different. A reasoning presented in \\cite{PRE01} led\nto the following vapor recoil model result\n\n", "itemtype": "equation", "pos": 6554, "prevtext": "\nwhere $H$ is the latent heat, $\\rho_L$ ($\\rho_V$) is the density of the liquid (gas) phase, $\\sigma$ is the\nsurface tension, and $g$ is the gravity acceleration. While this expression fits a number of experimental data\nsets, the underlying physics is questionable. Indeed, the vapor column morphology of boiling is quite rarely\nobserved while the BC exist for almost all morphologies of boiling, for pool boiling (i.e., natural convection\nboiling) or for flow boiling (i.e. boiling of the fluid flowing in a heated tube). Besides, many experimental\nresults, in particular those obtained in low-gravity \\cite{Straub}, cannot be fitted by Eq.~(\\ref{Zub}). Other\nphysical phenomena should then be responsible for the triggering of BC. A strong dependence of CHF on the\nwetting properties of the heater \\cite{Dhir} suggests a phenomenon at the contact line level.\n\n\nA vapor recoil mechanism for BC has already been proposed in \\cite{EuLet99,IJHMT01}. A fluid molecule leaving\nthe liquid interface causes a recoil force analogous to that created by the gas emitted by a rocket engine. It\npushes the interface towards the liquid side in the normal direction. An average vapor recoil force appears\nbecause the fluid necessarily expands while transforming from the liquid to the gas phase. The stronger the mass\nevaporation rate $\\eta$ (per time and interface area), the larger the vapor recoil force. One finds that the\nvapor recoil force per interface area is $P_r=\\eta^2(\\rho_V^{-1}-\\rho_L^{-1})$ \\cite{EuLet99}. The evaporation\nis particularly strong in the vicinity of the contact line of a bubble, inside the superheated layer of the\nliquid (Fig.~\\ref{brec}).\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=6cm]{b_rec}\n\\caption{Sketch illustrating how the vapor recoil initiates the bubble spreading. The amplitude and direction of\nthe vapor recoil force are shown by arrows.} \\label{brec}\n\\end{figure}\nThe resulting vapor recoil force can pull apart the bubble contact line and make it spread over the heater, thus\ncreating a nucleus for the vapor film. The results of the vapor recoil model are in qualitative agreement with\nthe observations by some of us \\cite{PRE01} and those by other groups \\cite{Kandlikar,Nishio}. The present\nLetter deals with its quantitative verification.\n\nConsider the fluid far from its critical point, where the system pressure $p\\ll p_c$ ($p_c$ is the critical\npressure). Instead of using pressure, it is more convenient to argue in terms of the saturation temperature $T$\nfrom which $p$ can be obtained readily. An estimation \\cite{EuLet99} shows that the heat flux necessary to\ncreate a vapor recoil force comparable to that of the surface tension corresponds to the experimental CHF order\nof magnitude. If the contributions of the vapor recoil and the surface tension $\\sigma$ are of the same order,\n\n", "index": 3, "text": "\\begin{equation}\\label{rat}\n    \\frac{P_rl_c}{\\sigma}\\sim\\frac{q_{CHF}^2l_c}{H^2\\sigma}\\left(\\frac{1}{\\rho_V}-\\frac{1}{\\rho_L}\\right)=\\mbox{const},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{P_{r}l_{c}}{\\sigma}\\sim\\frac{q_{CHF}^{2}l_{c}}{H^{2}\\sigma}\\left(\\frac{1%&#10;}{\\rho_{V}}-\\frac{1}{\\rho_{L}}\\right)=\\mbox{const},\" display=\"block\"><mrow><mrow><mfrac><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>⁢</mo><msub><mi>l</mi><mi>c</mi></msub></mrow><mi>σ</mi></mfrac><mo>∼</mo><mrow><mfrac><mrow><msubsup><mi>q</mi><mrow><mi>C</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>F</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>l</mi><mi>c</mi></msub></mrow><mrow><msup><mi>H</mi><mn>2</mn></msup><mo>⁢</mo><mi>σ</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mn>1</mn><msub><mi>ρ</mi><mi>V</mi></msub></mfrac><mo>-</mo><mfrac><mn>1</mn><msub><mi>ρ</mi><mi>L</mi></msub></mfrac></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mtext>const</mtext></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06934.tex", "nexttext": "\nwhere $\\beta=0.325$ and $\\nu=0.63$ are the universal critical exponents, $1+\\nu-3\\beta/2=1.14$. The Zuber\nexpression (\\ref{Zub}) also leads to a power law with exponent $5\\beta/4+\\nu/2=0.72$. This value can be obtained\nfrom the scaling relations $H\\sim\\rho_L-\\rho_V\\sim(T_c-T)^\\beta$ and $\\sigma\\sim(T_c-T)^{2\\nu}$.\n\nThe thermal diffusivity vanishes at $T_c$. The thermally controlled bubble dynamics is thus slower than at low\npressure (critical slowing down) and the CHF is much smaller. Optical distortions inevitable at low pressures\nbecause of violent fluid motion and strong temperature gradients \\cite{Kenning} are nonexistent at $T\\simeq T_c$\nwhere very detailed observations can thus be performed. However, the surface tension becomes very low and\ngravity flattens the gas-liquid interface. Reduced gravity conditions are thus necessary to preserve the\nexistence of bubbles, hence the nucleate boiling itself.\n\nThe cryogenic magnetic levitation installation at CEA-Grenoble \\cite{Cryo} was used to achieve a gravity\ncompensation. The accuracy is of 2\\% in the cylindrical fluid volume of 8~mm diameter and 5~mm thickness. The\nexperimental cell (Fig.~\\ref{cell})\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=\\columnwidth]{cell}\n\\caption{Sketch of the cylindrical transparent experimental cell.} \\label{cell}\n\\end{figure}\ncan be partially filled or pumped off \\emph{in situ} by using a capillary equipped with a cryogenic electric\nvalve. The latter remains closed during the experiment. The cell is filled with H$_2$ at critical density\n$\\rho_c$ so that the gas phase occupies a half of the cell independently of $T$ because of the symmetry of the\nco-existence curve with respect to $\\rho_c$, $(\\rho_L+\\rho_V)/2=\\rho_c$. During the evolution, the bubble mass\ncan vary while its volume does not change.\n\nThe best observations of BC \\cite{Theo,Kandlikar,Nishio,Van,Tor,Jamet} involved a transparent heater to detect\nand follow the heater dryout. Our cylindrical cell (Fig.~\\ref{cell}) has transparent sapphire end plates.\nSeveral thermistors are integrated into copper rings that have a good thermal contact with the plates. Both\nrings are connected thermally to a colder liquid helium bath with wires that serve as thermal resistances. The\nthermistors are used to inject the controlled heat power into one of the plates that serves as a heater and to\nmaintain the temperature of the other plate with 1~mK precision (in a stationary state) by a temperature\nregulation system. Sapphire is an excellent heat conductor in the cryogenic temperature range ($T_c=33$K for\nH$_2$). The lateral cell wall is made of stainless steel, with conductivity about $10^3$ times less than that of\nthe sapphire.\n\n\nBecause of the complete wetting conditions characteristic of near critical fluids \\cite{PRE01}, the wetting\nlayer always covers the cell at equilibrium. Due to this fact, a good thermal contact of the temperature\ncontrolled plate with the rest of the fluid is provided. The cell location with respect to the magnetic field is\nchosen in such a way that a residual magnetic force (which plays the role of an effective gravity) positions the\nbubble against the heating plate. This effective gravity field is directed to the cell center (\\cite{Cryo}, see\nalso the sketch in Fig.~\\ref{dry_spot}a below) so that the denser liquid phase is attracted to the cell center.\nUnfortunately, it is quite difficult to quantify the force acting on the bubble since there is no possibility to\nmap the magnetic field with a sufficient precision.\n\nThe surface tension prevents the liquid from gathering in the cell center by keeping the bubble convex, and the\nbubble image is circular far from $T_c$. Close to the critical point, the surface tension becomes too weak and\nthe liquid gathers in the center. Since the wetting layer remains at the cell walls, the bubble takes an unusual\ntorus shape, see Fig.~\\ref{dry_spot}. This occurs at $T=T_g\\approx 32.9$K. We call this geometry annular because\nof the observed bubble image.\n\nFor each experimental run, a thermal regulation reference temperature is chosen and defines $T$. By tuning the\nheater power, the cell is thermally equilibrated. Then heating is increased as needed and a stationary boiling\nstate is obtained after a transition period. The heater power $P$ and the heater temperature $T_h$ are then\nrecorded.\n\n$T_h$ has been measured also with the empty cell for different $T$ and heating powers $P_e$ and the dependence\n$P_e=P_e(T_h,T)$ was established. The amount of heat transferred across the cell walls of the filled cell can\nthus be determined by calculating this function for the values of both temperatures measured in the filled cell.\nThe heat flux $q$ carried by the fluid is obtained by dividing $P-P_e$ by the heater area. The dependence of $q$\n(calculated as explained above) on $T_h$ is called the boiling curve (Fig.~\\ref{boilcurve}).\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=6cm]{T32-32_5K}\n\\caption{Examples of the boiling curves for different pressures corresponding to two indicated values of $T$.\nThe boiling regimes are indicated (32K curve). The lines are guides for the eye.} \\label{boilcurve}\n\\end{figure}\n\nThe cell can be observed optically through the plates by using a light source, a CCD camera and two periscopes.\nFar from $T_c$, the bubble is circular (Fig.~\\ref{circular}).\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=\\columnwidth]{circular}\n\\caption{Heater drying dynamics at the CHF at $T=32.5$K visualized through the transparent heater (closest to\nthe observer). (a) Initial bubble position at equilibrium. (b) Bubble partially spread. (c) The heater is\ncompletely dried out. The section of the cell interior with a plane perpendicular to the image is sketched below\nthe corresponding photo. On the sketches, the vapor is white and the liquid is gray; the heater is at the\nbottom.} \\label{circular}\n\\end{figure}\nThe nucleation, growth and departure of small gas bubbles occur at the periphery of the heating plate where the\nliquid wetting layer is thicker. Since the large bubble occupies most of the plate image and its curved surface\nlooks dark, the small bubbles are almost invisible. Their presence can be detected by the trembling of the large\nbubble during their coalescence. A sudden disappearance of the trembling indicates the complete dryout of the\nliquid film (Fig.~\\ref{circular}c). The nucleation of the dry spot and the contact line motion is difficult to\nobserve in this geometry without special optical means \\cite{John}. At $T\\lesssim T_g$ the wetting layer\nthickens and the contact line becomes visible in motion but the optical contrast is low.\n\nAt the CHF the BC does not occur immediately after the temperature rise. The cell first attains a nearly\nstationary state where $T_h$ fluctuates slightly. One of the fluctuations then leads to a rapid drying of the\nmajor part of the heater. At the CHF, the liquid loses completely its contact with the heater which corresponds\nto film boiling. The transferred heat flux $q$ falls sharply (Fig.~\\ref{boilcurve}). Practically no fluid motion\nis observed any more even when the heating power is increased.\n\nThe optical contrast is much better in the annular regime ($T_g<T<T_c$) because the wetting layer is several\ntimes thicker. Its thickness can be judged from the maximum size of small bubbles that nucleate and grow inside\nit (Figs.~\\ref{dry_spot}a,b).\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=\\columnwidth]{dry_spot}\n\\caption{Heater drying dynamics slightly above the CHF at $T=32.95$K (in annular geometry, the large bubble has\na toroidal shape as described in the text). The bright areas on the photos are the dry spots. Similarly to\nFig.~\\ref{circular}, phase distributions for each photo are shown in the sketches. (a) Beginning of the dry spot\n(small white spot to the left) growth. (b) Intermediate stage. (c) Complete drying of the heater; the liquid\nphase has taken a shape of a hat seen from the top. Nucleated small bubbles are visible in (a-b). The direction\nand the relative magnitude of the effective gravity are shown by arrows in the sketch (a).} \\label{dry_spot}\n\\end{figure}\nSmall bubbles also form in the plate center, which is convenient for their observation. They grow and slide to\nthe plate periphery or depart from the plate under the action of the effective gravity, which pushes them in the\ndirection of the large bubble. They eventually coalesce with it.\n\nAt $q\\lesssim q_{CHF}$ dry spots under the small bubbles begin to appear and disappear intermittently when the\nbubbles depart from the heater. A bubble that appears in the hottest point (where the liquid layer is thinner,\npresumably due to the vapor recoil pressure) coalesces with the toroidal bubble and forms a dry spot which\nremains stationary. This bubble forms intermittently a ``bridge\" connecting the large bubble to the heater as\nsketched in Fig.~\\ref{dry_spot}a. At $q=q_{CHF}$ a large dry spot also appears (Fig.~\\ref{dry_spot}a) and keeps\ngrowing (Fig.~\\ref{dry_spot}b). The smaller dry spots under other bubbles keep appearing and disappearing but\ngrow larger. All the dry spots grow so large that they coalesce and, suddenly, the heater dries out completely\n(Fig.~\\ref{dry_spot}c). This picture is in full analogy with the observations by other groups\n\\cite{Nishio,Kandlikar} performed at much lower pressures. As expected, the BC slows down near $T_c$, and can\ntake as long as 1-2 min for the closest to $T_c$ runs.\n\nThe thickness of the wetting layer reflects the force that presses the bubble against the heater. When the layer\nis thicker (smaller force), a larger heat flux is needed to dry out the heater and the CHF is larger. This is\nwhat happens after a cell displacement with respect to the magnetic field or after a bubble topology change. The\n$q_{CHF}(T)$ dependence should thus be measured at the same (circular) bubble topology, i.e. at $T<T_g$.\n\nThe $q_{CHF}(T)$  dependence is shown in Fig.~\\ref{chf-t} and compared with the vapor recoil model prediction,\nEq.~(\\ref{tchf}).\n\\begin{figure}\n  \\begin{center}\n  \\includegraphics[width=6cm]{chf-t}\\\\\n  \\end{center}\n\\caption{The critical heat flux as a function of the distance to the critical point. The solid straight line is\nthe vapor recoil model prediction Eq.~(\\ref{tchf}).}\\label{chf-t}\n\\end{figure}\nA good agreement is found, which demonstrates the validity of the model. It is evident that the data cannot be\nfitted well with the Zuber equation (\\ref{Zub}) as the corresponding slope is nearly twice smaller.\n\nThe boiling crisis has been observed at high, nearly critical pressure and at low gravity. At these conditions\nthe BC is triggered by the growth of dry spots under individual vapor bubbles and is qualitatively analogous to\nthe BC at normal gravity and low pressures. The dry spot growth is followed by the bubble coalescence provoking\nheater dryout. At low pressures, the vapor recoil model gives a CHF expression similar to the classical Zuber\nformula. At high pressures, the two expressions, however, differ strongly. The measurements of the CHF depending\non the distance to the critical point demonstrate the validity of the vapor recoil model.\n\nThese results open the way to more precise numerical simulation that can now be based on a well identified\nphysical phenomenon. The CHF can then be predicted as a function of various system parameters such as pressure,\nmaterial properties, geometry, gravity level, etc.\n\n\\begin{acknowledgments}\nThis work is partially supported by CNES. We thank D.~Communal for his contribution to the thermal regulation\nsystem and P. Seyfert for his helpful comments.\n\\end{acknowledgments}\n\n\n\\begin{thebibliography}{99}\n\\bibitem{Dhir} V. K. Dhir, Annu. Rev. Fluid. Mech. \\textbf{30}, 365 (1998).\n\\bibitem{Theo} T. G. Theophanous, T. H. Dinh, J. P. Tu, \\& A. P. Dinh, Exp. Thermal Fluid Sci. \\textbf{26}, 793 (2002).\n\\bibitem{Straub} J. Straub, Adv. Heat Transfer \\textbf{35}, 57 (2001).\n\\bibitem{EuLet99} V. S. Nikolayev \\& D. A. Beysens, Europhys. Lett. \\textbf{47}, 345 (1999).\n\\bibitem{IJHMT01} V. S. Nikolayev, D. A. Beysens, G.-L. Lagier, \\& J.~Hegseth,  Int. J. Heat Mass Transfer \\textbf{44}, 3499 (2001).\n\\bibitem{PRE01} Y. Garrabos, C. Lecoutre-Chabot, J. Hegseth, V.~S.~Nikolayev, D. Beysens, \\& J.-P. Delville,  Phys. Rev. E \\textbf{64}, 051602 (2001).\n\\bibitem{Kandlikar} S. G. Kandlikar \\& M. E. Steinke, Int. J. Heat Mass Transfer {\\bf 45}, 3771 (2002).\n\\bibitem{Nishio} S. Nishio, H. Tanaka, Int. J. Heat Mass Transfer {\\bf 47}, 4559 (2004).\n\\bibitem{Kenning} D. B. R. Kenning, Int. J. Heat and Fluid Flow {\\bf 25}, 209 (2004).\n\\bibitem{Cryo} D. Chatain \\& V. S. Nikolayev, Cryogenics \\textbf{42}, 253 (2002); Wunenburger R., Chatain D., Garrabos Y., Beysens D., Phys. Rev. E 62, 469 (2000).\n\\bibitem{Van} H. J. van Ouwerkerk, Int. J. Heat Mass Transfer {\\bf 15}, 25 (1972).\n\\bibitem{Tor} K. Torikai, K. Suzuki \\& M. Yamaguchi, JSME Int. J. Series~II {\\bf 34}, 195 (1991).\n\\bibitem{Jamet} D. Jamet, O. Lebaigue, private communication (2006).\n\\bibitem{John} J. Hegseth, A. Oprisan, Y. Garrabos, V. S. Nikolayev, C.~Lecoutre-Chabot \\& D. Beysens, Phys. Rev. E \\textbf{72}, 031602 (2005).\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 7198, "prevtext": "\nwhere the capillary length $l_c=\\sqrt{\\sigma/g(\\rho_L-\\rho_V)}$ is the natural lengthscale. Eq.~(\\ref{rat})\nresults in a CHF expression identical to Zuber's expression (\\ref{Zub}) if the inequality $\\rho_L\\gg\\rho_V$ is\ntaken into account. Both models are then difficult to distinguish far from the critical temperature $T_c$.\n\nOn the contrary, their behaviors close to $T_c$ are quite different. A reasoning presented in \\cite{PRE01} led\nto the following vapor recoil model result\n\n", "index": 5, "text": "\\begin{equation}\\label{tchf}\n  q_{CHF}\\sim(T_c-T)^{1+\\nu-3\\beta/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"q_{CHF}\\sim(T_{c}-T)^{1+\\nu-3\\beta/2},\" display=\"block\"><mrow><mrow><msub><mi>q</mi><mrow><mi>C</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mrow><mn>1</mn><mo>+</mo><mi>ν</mi></mrow><mo>-</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mi>β</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}]