[{"file": "1601.03275.tex", "nexttext": "\nIn this expression, ${\\omega_\\mathrm{r}}$ and ${\\omega_\\mathrm{a}}$ are respectively the cavity and qubit frequencies, $\\chi={g^2}/{\\Delta}$ the dispersive coupling strength, $\\epsilon$ the drive amplitude, and ${\\omega_\\mathrm{d}}$ the drive frequency. This description is accurate for intra-cavity photon number $n\\ll~ n_\\mathrm{crit}={\\Delta^2}/{4g^2}$~\\cite{blais:2004a}. Although the resonator-induced phase gate is tolerant to large variations in qubit frequencies and coupling strengths~\\cite{SM}, to simplify the discussion we assume the qubits to be identical. \n\nHow the resonator-induced phase gate emerges from evolution under Eq.~\\eqref{eq:Hamil} can be made clearer by performing the time-dependent polaron-like transformation $D({\\hat{\\alpha}}')=\\exp({\\hat{\\alpha}}' {\\hat{a}^\\dag}-{{\\hat{{\\alpha}}}'^*} {\\hat{a}})$ with ${\\hat{\\alpha}}'(t)=\\alpha(t)-(\\chi/\\delta_{\\text{r}})({\\hat{\\sigma}_{\\mathrm{z}1}}+{\\hat{\\sigma}_{\\mathrm{z}2}})\\alpha(t)$ on ${\\hat{H}}$~\\cite{mahan:2000a,gambetta:2008a}. As shown in the Supplemental Material~\\cite{SM}, this leads to the effective Hamiltonian\n\\begin{eqnarray}\\label{eq:Heff}\n{\\hat{{H}}}_\\textnormal{eff} = \\tfrac{1}{2}\\left[{\\omega_\\mathrm{a}}+2\\chi {\\hat{{n}}}(t)\\right]({\\hat{\\sigma}_{\\mathrm{z}1}}+{\\hat{\\sigma}_{\\mathrm{z}2}})-\\frac{2\\chi^2|\\alpha|^2}{{\\delta_\\mathrm{r}}} {\\hat{\\sigma}_{\\mathrm{z}1}}{\\hat{\\sigma}_{\\mathrm{z}2}},\n\\end{eqnarray}\nwhere we have defined ${\\hat{{n}}}(t) = {\\hat{a}^\\dag\\hat{a}} + |\\alpha(t)|^2$, with the amplitude $\\alpha(t)$ satisfying $\\dot\\alpha=-i{\\delta_\\mathrm{r}}\\alpha-i{\\epsilon(t)}$ and the drive-cavity detuning ${\\delta_\\mathrm{r}} = {\\omega_\\mathrm{r}}-{\\omega_\\mathrm{d}}$. \nThe last term of Eq.~\\eqref{eq:Heff} represents the nonlinear, qubit-state-dependent phase induced by the driven cavity. To avoid qubit-field entanglement after the gate, the cavity drive is chosen such that the field starts and ends in its vacuum state. For simplicity, we consider the drive to have a Gaussian profile $\\epsilon(t) = \\epsilon_0e^{-{t^2}/{\\tau^2}}$ for times $-t_{\\text{g}}/2<t<t_{\\text{g}}/2$ with $t_{\\text{g}}=5\\tau$. As illustrated in Fig.~2(a), for ${\\delta_\\mathrm{r}}\\gg 1/\\tau$ the cavity field evolves adiabatically and $\\alpha(t)$ follows a closed path in phase space. With the cavity being only virtually populated, $\\alpha(t)$ returns to the origin after the pulse.  \nThe qubit-state dependent phase acquired during this evolution is determined by the area in phase-space enclosed by $\\alpha(t)$ and is specified by the pulse amplitude $\\epsilon_0$, duration $\\tau$, and detuning $\\delta_{\\text{r}}$~\\cite{ladd2011simple}. By appropriately choosing these parameters, the evolution under Eq.~\\eqref{eq:Heff} can correspond to the two-qubit unitary $U_{zz}=\\mathrm{Diag}(1,1,1,-1)$. \n\nAnother advantage of working with a large detuning ${\\delta_\\mathrm{r}}$ is that measurement-induced dephasing $\\gamma_\\phi$ of the qubits is small~\\cite{blais:2004a,measDeph}. On the other hand, the strength of the qubit-qubit interaction goes down with ${\\delta_\\mathrm{r}}$, which in turns leads to long gate times. As we now show, we solve the challenge of minimizing $\\gamma_\\phi$ and maintaining short gate times by using an input field that is a displaced squeezed field rather than a coherent state. The squeezed field is characterized by the squeeze parameter $r(\\omega)$ and angle $\\theta$, and, in practice, can be produced by a Josephson parametric amplifier (JPA)~\\cite{castellanos-beltran:2008a,eichler}. The frequency dependence of the squeeze parameter reflects the finite bandwidth of the JPA around the drive frequency ${\\omega_\\mathrm{d}}$.\n\nMeasurement-induced dephasing is caused by photon number fluctuations and, following Refs.~\\cite{blais:2004a,measDeph, carm}, can be expressed as\n\\begin{eqnarray}\\label{eq:deph}\n\\gamma_\\phi(t)=2\\chi^2\\int^t_0 \\left\\langle [{\\hat{{n}}}(t)-\\bar{n}(t)][{\\hat{{n}}}(t')-\\bar{n}(t'])\\right\\rangle dt'.\n\\end{eqnarray}\nAn approximate expression for this rate can be obtained in the limit of adiabatic evolution of the cavity where the fast dynamics can be neglected. In this situation, this rate is given by~\\cite{SM}\n\\begin{eqnarray}\\label{eq:ideal}\n\\begin{split}\n& \\gamma_{\\phi}(t) \n\\approx \\frac{4\\chi^2 \\kappa}{{\\delta_\\mathrm{r}}^2}\\\\\n&\\times\\left[N({\\omega_\\mathrm{r}}) + \\frac{|\\alpha(t)|^2}{2}\\left(e^{-2r({\\omega_\\mathrm{d}})}\\cos^2\\Phi+e^{2r({\\omega_\\mathrm{d}})}\\sin^2\\Phi\\right)\\right],\n\\end{split}\n\\end{eqnarray}\nwhere $\\kappa$ is the cavity decay rate and $\\Phi=\\theta-{\\text{arg}}[\\alpha(t)]$ is the angle of squeezing relative to the drive.\nWe have also introduced $N({\\omega_\\mathrm{r}})= \\sinh^2 r({\\omega_\\mathrm{r}})$, the thermal photon population associated with the squeezed input field. Crucially, this quantity is evaluated at the cavity frequency. This contribution to $\\gamma_\\phi$ can be made negligible by working at a detuning ${\\delta_\\mathrm{r}}$ that is larger than the typically small bandwidth of current JPAs~\\cite{castellanos-beltran:2008a,eichler}. Moreover, in the absence of squeezing ($r=0$), the second term of Eq.~\\eqref{eq:ideal} is the usual expression for measurement-induced dephasing in a coherent field~\\cite{measDeph}. While $N({\\omega_\\mathrm{r}})$ in the first term is evaluated at the cavity frequency, the squeeze parameter in the second term is rather evaluated at the drive frequency ${\\omega_\\mathrm{d}}$. For ${\\delta_\\mathrm{r}}\\gg (1/\\tau,\\,\\kappa)$, the cavity field closely follows $\\alpha(t)\\sim\\epsilon(t)/{\\delta_\\mathrm{r}}$ such that $\\Phi\\sim\\theta$ at all times. As a result, choosing the squeeze angle $\\theta = 0$ leads to an exponential reduction with increasing $r({\\omega_\\mathrm{d}})$ of the dephasing rate in the adiabatic limit. This confirms the intuition presented in Fig.~\\ref{figPhaseCartoon} that increasing the quantum fluctuations in the appropriate quadrature with respect to the field displacement leads to a reduction of qubit dephasing.  Minimizing photon shot-noise by number-squeezed radiation was also studied in the context of cavity spin squeezing in Ref.~\\cite{css}.\n\n\n\\begin{figure}\n\\includegraphics[width=0.9\\columnwidth]{PhaseSpaceAngle.pdf}\n\\caption{(color online) (a) Evolution in phase space of the cavity field $\\alpha(t)$ with ${\\delta_\\mathrm{r}}/2\\pi=320$ MHz, $\\kappa/{2\\pi}=10$ MHz, $\\tau=40$ ns, and $t_\\mathrm{g}=200$ ns. The colored dots represent the field at three different times and the corresponding lines represent the angles along which the quantum fluctuations should be reduced to minimize dephasing. (b) Time evolution of $\\mathrm{arg}[\\alpha]$. (c) Normalized dephasing rate evaluated at the three indicated times vs squeezing power for a fixed squeezing angle $\\theta=0$ and $r({\\omega_\\mathrm{r}})=0$. The normalization $\\gamma_\\phi^0$ corresponds to the situation without squeezing, i.e., $r=0$.}\n\\label{fig:angle}\n\\end{figure}\n\n\nWhile the above argument suggests an exponential decrease of the dephasing rate for arbitrarily large squeezing powers, in practice there exists an optimal $r({\\omega_\\mathrm{d}})$. In order to understand this, it is useful to consider again the  evolution of the cavity field in phase space. As illustrated in Fig.~\\ref{fig:angle}(a) and (b), for large detunings ${\\text{arg}}[\\alpha(t)]$ is small at all times, and choosing a constant $\\theta\\sim 0$ minimizes the dephasing rate. However, for large $r({\\omega_\\mathrm{d}})$, the anti-squeezed quadrature enhances dephasing at short times where ${\\text{arg}}[\\alpha(t)]$ fluctuates widely. This leads to an overall enhancement of $\\gamma_\\phi$. Figure~\\ref{fig:angle}(c) shows the dependence of the normalized instantaneous dephasing rate on $r({\\omega_\\mathrm{d}})$ with $\\theta=0$ at the three times indicated by the dots on Fig.~\\ref{fig:angle}(a). The existence of an optimal squeezing power is clearly apparent.\nThe finite bandwidth of the input squeezed state is another reason for the existence of such an optimal point. Indeed, for a fixed squeezing bandwidth $\\Gamma$, an increase in the squeezing power at ${\\omega_\\mathrm{d}}$ will also lead to an increase in thermal photons at ${\\omega_\\mathrm{r}}$ with $N({\\omega_\\mathrm{r}})=N({\\omega_\\mathrm{d}})/[(\\omega-{\\omega_\\mathrm{d}})^2+\\Gamma^2]$~\\cite{walls2007quantum}. This contributes to qubit dephasing via the first term of Eq.~\\eqref{eq:ideal}. \n\\begin{figure}\n\\includegraphics[width=0.9\\columnwidth]{ErrorVSsqueezing.pdf}\n\\caption{(color online) (a) Analytical (solid lines) and numerical (symbols) gate error rate as a function of squeezing power for $\\theta=0$ and three detunings ${{\\delta_\\mathrm{r}}}/{2\\pi}=160$ MHz (dark blue), $312$ MHz (blue) and $640$ MHz (red). The corresponding maximum drive amplitudes are $\\epsilon_0/2\\pi=278.5$ MHz, 795.8 MHz, and 2.31 GHz. The gate time is $t_\\mathrm{g}=200$ ns, cavity decay ${\\kappa}/{2\\pi}=10$ MHz, qubit-cavity coupling ${g}/{2\\pi}=160$ MHz, and detuning ${\\Delta}/{2\\pi}=3.2$ GHz corresponding to a dispersive coupling of ${\\chi}/{2\\pi}=8$ MHz and $n_\\textnormal{crit.}=100$. (b) Analytical (solid lines) and numerical (symbols) gate error rate as a function of squeezing angle $\\theta$ for a fixed squeezing power of 5.7 dB and detuning ${{\\delta_\\mathrm{r}}}/{2\\pi}=320$ MHz.}\n\\label{fig:error}\n\\end{figure}\n\n\nWe now turn to a more quantitative description of the improvement of gate fidelity that can be obtained from using squeezing. For this, we first compute the gate error $E= 1- {\\langle{{\\psi_{T}}}|} \\mathcal{E}({|{{\\psi_0}}\\rangle}{\\langle{{\\psi_0}}|}){|{{\\psi_{T}}}\\rangle}$ for the pure initial state ${|{{\\psi_0}}\\rangle}=\\frac{1}{2}({|{{00}}\\rangle}+{|{{01}}\\rangle}+{|{{10}}\\rangle}+{|{{11}}\\rangle})$ at $t=-t_\\mathrm{g}/2$. In this expression, ${|{{\\psi_{T}}}\\rangle}=U_{zz}{|{{\\psi_0}}\\rangle}$ is the desired target state and $\\mathcal{E}\\cdot$ is the quantum channel representing the system under evolution with the Hamiltonian of Eq.~\\eqref{eq:Hamil} in addition to the dephasing in the presence of a displaced squeezed drive. Following the notation from Ref.~\\cite{cross:2015a}, the action of the channel on the qubits' density matrix elements takes the form  $\\mathcal{E}({|{{ij}}\\rangle}{\\langle{{kl}}|})=e^{i\\mu_{ij,kl}-\\gamma_{ij,kl}}$, with $\\{{i,j,k,l}\\} \\in \\{0,1\\}$, and where $\\mu_{ij,kl}$ are qubit-state dependent phases and $\\gamma_{ij,kl}$ represents non-unitary evolution due to the dephasing rate $\\gamma_\\phi$. In addition to two-qubit phases, evolution under the Hamiltonian of Eq.~\\eqref{eq:Hamil} leads to single-qubit $z$ rotations. Since these rotations can be eliminated by an echo sequence, these are not considered in the error estimation~\\cite{cross:2015a}. \n\nA prescription to evaluate $\\mu_{ij,kl}$ and $\\gamma_{ij,kl}$, and therefore the error $E$, can be found in~\\cite{SM}. This corresponds to the full lines in Fig.~\\ref{fig:error}(a) that show the error as a function of squeezing strength for different detunings ${\\delta_\\mathrm{r}}$ and fixed $\\theta = 0$. The symbols in this figure are obtained by numerical integration of the cascaded master equation for the system described by the Hamiltonian Eq.~\\eqref{eq:Hamil} and driven by a degenerate parametric amplifier acting as a source of squeezed radiation~\\cite{carmichael:1993b,SM}. The numerical simulations of the cascaded master equation are carried out with an open source computational package~\\cite{johansson2012qutip,johansson2013qutip}. We have fixed $\\tau=40$ ns which corresponds to a gate time of $t_\\mathrm{g}=200$~ns. The drive parameters are chosen such that the cavity is empty at $t=t_\\mathrm{g}/2$ and a maximum of 6 photons are excited in the cavity, which corresponds to $n/n_\\mathrm{crit}=0.06$. The squeezing spectrum is centred at the drive frequency. Its linewidth $\\Gamma/2\\pi=32$ MHz is chosen to ensure that ${\\delta_\\mathrm{r}}\\gg\\Gamma$, which minimizes the thermal photon population at the cavity frequency. As expected from the discussion above, the error goes down with increasing detuning. More importantly, the error is reduced in the presence of a squeezing input field up to a optimal power, beyond which measurement-induced dephasing again contributes to the gate error. As the detuning decreases, there is greater variation in $\\mathrm{arg}[\\alpha]$, which results in a reduction of the optimal squeezing power. Figure~\\ref{fig:error}(b) shows the error as a function of the squeezing angle and confirms that the optimal choice is $\\theta=0$\n\nTable~\\ref{tab:fidelity} presents the average gate fidelity obtained from numerical simulations with ($F^\\textnormal{Sqz.}_\\textnormal{avg}$) and without ($F^0_\\textnormal{avg}$) squeezing for different detunings ${\\delta_\\mathrm{r}}$ and cavity linewidth $\\kappa$, but fixed gate time $t_\\mathrm{g}=200$~ns~\\cite{neil2, SM}. The parameters in the table are again chosen to limit the maximum number of photons in the cavity to $\\sim 6$. It is important to emphasize the wide range of values chosen for $\\kappa$ in this table. Note that in all cases the present approach leads to an increase in gate fidelity. Moreover, with squeezing powers close to what has already been realized experimentally~\\cite{eichler}, an order of magnitude improvement can be obtained. Working with large detunings, an infidelity of $\\sim 3.5\\times 10^{-5}$, for example, can be obtained in a cavity with $\\kappa/2\\pi=50$~KHz. Notably, this is two orders of magnitude bellow the fault-tolerance threshold of the surface code~\\cite{surfcode}. We also note that this approach can be combined with the improvement achieved by pulse shaping~\\cite{cross:2015a}. Finally, we note that our scheme is robust to impure squeezing at the input. Indeed, because the infidelity depends only on the squeezed quadrature of the input drive, a thermal squeezed drive, or losses before the cavity, are simply equivalent to a reduction in the squeezing strength~\\cite{SM}.\n\n\n\nIn summary, we have described a protocol to improve the fidelity of a two-qubit resonator-induced phase gate by over an order of magnitude. This improvement is based on which-path information erasure by using single-mode squeezing. The optimal squeezing strengths are close to what can already be achieved experimentally with superconducting quantum circuits. This scheme, based on tailoring the reservoir to dynamically protect a system during a logical operation, broadens the scope of quantum-bath engineering.\n\n{\\it Acknowledgements} - We thank Nicolas Didier and Arne~L.~Grimsmo for useful discussions. This work was supported by the Army Research Office under Grant W911NF-14-1-0078, INTRIQ and NSERC.\n\n\n\\begin{table}[t]\n \\begin{tabular}{|c|c|c|c|c|c|c|c|}\n \\hline\n $\\frac{{\\delta_\\mathrm{r}}}{2\\pi}$&$\\frac{\\kappa}{2\\pi}$ &$\\chi$ &   $\\epsilon_0$&$F^0_\\textnormal{avg}$ & $F^\\textnormal{Sqz.}_\\textnormal{avg}$& Squeezing\\\\   \n (MHz)& (MHz)& (MHz) & (GHz) & $\\%$& $\\%$& Power (dB)\\\\ \\hline  \n320& 10  &8   &  0.796 & 98.16 & 99.89  & 16  \\\\ \\hline\n640& 10   & 8   & 2.31  & 98.96  & 99.95   &19 \\\\ \\hline\n111.4 & 0.05  & 4.5   & 0.294  & 99.96  & 99.9965   &15.7 \\\\ \\hline\n\\end{tabular}\n\\caption{Average gate fidelity with and without squeezing ($F^\\textnormal{Sqz.}_\\textnormal{avg}$ and $F^0_\\textnormal{avg}$, respectively). The gate $U_{zz}$ is implemented in time $t_{\\text{g}}=200$ ns. \n}\n\\label{tab:fidelity}\n\\end{table}\n\n\\bibliography{twoqubit.bbl}{}\n\\clearpage\n\\includepdf[pages=1,scale=1]{twoqubit_SM}\n\\clearpage\n\\includepdf[pages=2,scale=1]{twoqubit_SM}\n\\clearpage\n\\includepdf[pages=3,scale=1]{twoqubit_SM}\n\\clearpage\n\\includepdf[pages=4,scale=1]{twoqubit_SM}\n\\clearpage\n\\includepdf[pages=5,scale=1]{twoqubit_SM}\n\n\n", "itemtype": "equation", "pos": 5917, "prevtext": "\n\n \\title{High-fidelity resonator-induced phase gate with single-mode squeezing}\n\n\\author{Shruti Puri}\n\\affiliation{D\\'{e}partment de Physique, Universit\\'{e} de Sherbrooke, Sherbrooke, Qu\\'{e}bec, Canada J1K 2R1}\n\\author{Alexandre Blais}\n\\affiliation{D\\'{e}partment de Physique, Universit\\'{e} de Sherbrooke, Sherbrooke, Qu\\'{e}bec, Canada J1K 2R1}\n\\affiliation{Canadian Institute for Advanced Research, Toronto, Canada}\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe propose to increase the fidelity of two-qubit resonator-induced phase gates in circuit QED by the use of narrowband single-mode squeezed drive. We show that there exists an optimal squeezing angle and strength that erases qubit `which-path' information leaking out of the cavity and thereby minimizes qubit dephasing during these gates. Our analytical results for the gate fidelity are in excellent agreement with numerical simulations of a cascaded master equation that takes into account the dynamics of the source of squeezed radiation. With realistic parameters, we find that it is possible to realize a controlled-phase gate with a gate time of 200 ns and average infidelity of $10^{-5}$. \n\\end{abstract}\n\n\\pacs{\n03.67.-a, 42.50.Pq, 42.50.Dv, 03.65.Vf\t\n}\n\n\\maketitle\n\n\n\n\nTaking advantage of pulse shaping techniques~\\cite{motzoi:2009a} and increasing coherence times~\\cite{paik:2011a}, single-qubit gate fidelity exceeding 99\\% has been demonstrated with superconducting qubits~\\cite{barends,chow:2012a}. Similar fidelities have been reported for two-qubit gates based on frequency tunable qubits~\\cite{barends}. Tuning the qubit transition frequency is, however, sometimes undesirable or difficult~\\cite{paik:2011a} and, for this reason, fixed-frequency two-qubit gates are being actively developed~\\cite{rigetti:2005a,blais:2007a,majer:2007a,rigetti:2010a,chow:2011a,chow:2013a,cross:2015a}. Unfortunately, the fidelity of these all-microwave gates~\\cite{corcoles:2015a} is still below that required for fault-tolerant quantum computation~\\cite{raussendorf:2007a}.\n\n\nA promising all-microwave gate is the resonator-induced phase gate~\\cite{cross:2015a}. This multi-qubit logical operation is based on the dispersive regime of circuit QED where the qubits are far detuned from a cavity mode~\\cite{haroche:2006a,blais:2004a}. As schematically illustrated in Fig.~\\ref{figPhaseCartoon}, adiabatically turning on and off an off-resonant drive, the cavity state evolves from its initial vacuum state by following a qubit-state-dependent closed loop in phase space. After this joint qubit-cavity evolution, the cavity returns to vacuum state and the qubits are left unentangled from the cavity but with an acquired a non-trivial phase. By adjusting the drive amplitude, frequency, and duration, an entangling phase gate can be realized~\\cite{cross:2015a}. This is analogous to the geometric phase gate already demonstrated with ion-trap qubits~\\cite{leibfried:2003a} and theoretically studied in the context of circuit QED, quantum dots in a cavity, and trapped ions~\\cite{blais:2007a,puri,wang,garcia-ripoll:2003a}.\n\n\nIn practice, the gate fidelity is limited by residual qubit-cavity entanglement and by photon loss. Indeed, during the adiabatic pulse, photons entangled with the qubit leave the cavity carrying `which-path' information about the two-qubit state, in turn causing dephasing. This can be partially avoided by driving the cavity many linewidths from its resonance frequency. In this situation, the cavity is only virtually populated and the qubit-photon entanglement is small~\\cite{blais:2007a,puri,wang,garcia-ripoll:2003a}. Unfortunately, this also leads to longer gate times, a problem that can be partially mitigated by using pulse shaping techniques~\\cite{cross:2015a}.\n\n\\begin{figure}\n\\centering\\includegraphics[width=0.85\\columnwidth]{PhaseSpaceCartoon.pdf}\n\\caption{(color online) Qubit-state-dependent evolution of the outgoing resonator field in phase space (solid lines) in the rotating frame of the drive. Quantum fluctuations corresponding to a coherent (dashed circles) and squeezed drive (filled ellipses) are represented at an extremum of the paths. By adjusting the squeezing angle, quantum fluctuations can help in erasing which-path information and thereby reduce qubit dephasing during the joint qubit-field evolution.}\n\\label{figPhaseCartoon}\n\\end{figure}\n\nHere we propose to use single-mode squeezing to address the challenge of implementing resonator-induced phase gates with a gate error below the fault-tolerance threshold and with short gate times. We show that an optimal, and experimentally realistic, choice of squeezing power and angle can dramatically improve the gate fidelity. The intuition behind this improvement is schematically illustrated in Fig.~\\ref{figPhaseCartoon}: enhancing fluctuations in the appropriate quadrature erases the which-path information while leaving the path area, and hence the accumulated phases, unchanged. This improvement in gate fidelity is the converse of the recent realization that single-mode squeezed light is generally detrimental to dispersive qubit measurement~\\cite{barzanjeh:2014a,didier:2015a}. Using squeezing powers close to that already experimentally achieved with superconducting circuits~\\cite{eichler}, we find average gate errors that are suppressed by an order of magnitude with respect to a coherent state input drive. In other words, we suggest to use quantum-bath engineering to protect the dynamics of a quantum system, going beyond the typical use of this approach, which is focussed on creating or stabilizing certain steady-states~\\cite{murch2012cavity,shankar2013autonomously,leghtas2015confining}.\n\n\n\n\n\n\nIn the dispersive regime where the qubit-cavity frequency detuning $\\Delta = {\\omega_\\mathrm{a}}-{\\omega_\\mathrm{r}}$ is large with respect to the coupling strength $g$, the system Hamiltonian in the presence of a cavity drive takes the form \n\n", "index": 1, "text": "\\begin{equation}\\label{eq:Hamil}\n\\begin{split}\n{\\hat{{H}}} \n&=\n{\\omega_\\mathrm{r}} {\\hat{a}^\\dag\\hat{a}}+\\frac{\\omega_\\textnormal{a}}{2}{\\hat{\\sigma}_{\\mathrm{z}1}}\n+\\frac{\\omega_\\textnormal{a}}{2}{\\hat{\\sigma}_{\\mathrm{z}2}}+\\chi({\\hat{\\sigma}_{\\mathrm{z}1}}+{\\hat{\\sigma}_{\\mathrm{z}2}}){\\hat{a}^\\dag\\hat{a}}\n\\\\&\n+ \\epsilon(t) ({\\hat{a}^\\dag} e^{-i{\\omega_\\mathrm{d}} t} + {\\mathrm{h.c.}}).\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle{\\hat{{H}}}&amp;\\displaystyle={\\omega_{\\mathrm{r}}}{\\hat%&#10;{a}^{\\dagger}\\hat{a}}+\\frac{\\omega_{\\textnormal{a}}}{2}{\\hat{\\sigma}_{\\mathrm{%&#10;z}1}}+\\frac{\\omega_{\\textnormal{a}}}{2}{\\hat{\\sigma}_{\\mathrm{z}2}}+\\chi({\\hat%&#10;{\\sigma}_{\\mathrm{z}1}}+{\\hat{\\sigma}_{\\mathrm{z}2}}){\\hat{a}^{\\dagger}\\hat{a}%&#10;}\\\\&#10;&amp;\\displaystyle+\\epsilon(t)({\\hat{a}^{\\dagger}}e^{-i{\\omega_{\\mathrm{d}}}t}+{%&#10;\\mathrm{h.c.}}).\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mrow><msub><mi>ω</mi><mi mathvariant=\"normal\">r</mi></msub><mo>⁢</mo><msup><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>+</mo><mrow><mfrac><msub><mi>ω</mi><mtext>a</mtext></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z1</mi></msub></mrow><mo>+</mo><mrow><mfrac><msub><mi>ω</mi><mtext>a</mtext></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z2</mi></msub></mrow><mo>+</mo><mrow><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z1</mi></msub><mo>+</mo><msub><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z2</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mo>+</mo><mi>ϵ</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><msup><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ω</mi><mi mathvariant=\"normal\">d</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo>+</mo><mi mathvariant=\"normal\">h</mi><mo>.</mo><mi mathvariant=\"normal\">c</mi><mo>.</mo><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}]