[{"file": "1601.01244.tex", "nexttext": "\n\n\\noindent where $\\epsilon_\\infty$ is the high-frequency dielectric constant, which takes into account the contribution of all oscillators at very high frequencies and $\\omega^2_{pi}$, $\\omega_{0i}^2$, $\\Gamma_i$ are, respectively, the plasma frequency, the transverse frequency and the linewidth (scattering rate) of the \\textit{i}-th Lorentz oscillator. The absorbance is then given by: A($\\omega$) = $\\omega$ $\\operatorname{Im}\\sqrt\\epsilon$.\n\n\\noindent For the fitting of the transient data, the Lorentz oscillators in our experimental range are allowed to change in order to reproduce the dynamical reflectivity. This procedure enables to extract the transient dielectric function $\\Delta\\epsilon(\\omega, \\tau)=\\Delta\\epsilon_1(\\omega, \\tau)+i\\Delta\\epsilon_2(\\omega, \\tau)$ and finally leads to the evaluation of the $\\Delta$A for the single-crystals.\n\n\\subsection{\\textit{Ab initio} calculations: Computational details}\n\nMany-body perturbation theory was employed to compute the band structure and the dielectric response of bulk \nanatase TiO$_2$. The GW and Bethe Salpeter Equation (BSE) calculations \\cite{ref:onida, ref:hedin1, ref:hedin2}, used for evaluating the electronic and optical properties respectively, were performed on-top of eigenvalues and eigenfunctions obtained from density functional theory (DFT). We used the planewave pseudopotential implementation of DFT as provided by the package Quantum Espresso. GW and BSE calculations were performed with two different implementations, the one in the BerkeleyGW package \\cite{ref:berkeley} and the one in Yambo \\cite{ref:yambo}.\n\nDFT calculations rely on the generalized gradient approximation as in the Perdew-Burke-Ernzerhof (PBE) scheme for the exchange-correlation functional. \nThe Ti norm-conserving pseudopotential includes semicore states 3\\textit{s} and 3\\textit{p}. \nWhile standard structural and electronic quantities are already converged at the DFT level of description \nwith an energy cutoff of 90 Ry, the energy cutoff has here been raised up to 160 Ry to properly include the high number of bands necessary to reach convergence for the many-body evaluated properties. Bulk anatase TiO$_2$ was modelled on a body-centred tetragonal lattice containing 2 Ti atoms and 4 O atoms (primitive cell) with lattice parameters (optimised at the PBE-DFT level) a = b = 3.79 \\AA~ and c = 9.66 \\AA. These optimized lattice constants are very close to the experimental values a = b = 3.78 \\AA~ and c = 9.51 \\AA. \n\nThe ground state electronic density is properly described with a coarse 4$\\times$4$\\times$4 k-point grid for sampling of the BZ. Finer grids are really needed to get a proper description of screening effects and many-body corrections at the GW and BSE levels of theory. GW calculations were performed by evaluating the quasiparticle corrections to DFT eigenvalues at the G$_0$W$_0$ one-shot level of theory \\cite{ref:onida}. The coarse 4$\\times$4$\\times$4 k-point grid sampling is sufficient for the description of the quasiparticle corrected band structure. The full converged calculations shown in the main text were obtained with BerkeleyGW. Below we also show that the results are code-independent by comparing the BerkeleyGW results with the ones obtained with the Yambo code from a non-converged case (as full convergence was not possible to achieve with the present implementation in Yambo).\n\nThe GW results were then interpolated into a finer grid of 16$\\times$16$\\times$16. For the solution of the BSE, we performed DFT calculations on a finer and randomly shifted grid, up to 16$\\times$16$\\times$16 k-points (4096 irreducible k-points), within BerkeleyGW.\n\nIn BerkeleyGW, for the computation of the polarizability and inverse dielectric matrices, we employed a total of 2474 conduction bands and G-vectors with kinetic energies up to 46 Ry, whereas the self-energy operator was computed using 2472 unoccupied bands and a G-vector cutoff energy of 46 Ry and 160 Ry for the screened and bare Coulomb matrices, respectively. For the solution of the BSE, the six lowest conduction bands and six topmost valence bands were included. All employed energy cutoffs, number of empty bands and number of k-points were carefully determined after exhaustive convergence tests, and are needed to have a fully converged absorption spectra. The excitonic Hamiltonian has been evaluated by including the resonant part, and also by adding the antiresonant term. Moreover, calculations of spin-polarized optical properties, done to highlight possible dark excitons due to triplet excitations, have been performed. No measurable differences among the three kinds of calculations have been obtained, therefore in this Article results including only the resonant part of the Hamiltonian are reported and discussed. Details on convergence for specific quantities of interest are reported in the following section.\n\nIn all calculations shown in the main text and in the SI, a phenomenological Lorentzian broadening with an energy width of 0.12 eV has been applied to mimic the experimental broadening of the absorption spectra.\n\n\\subsection{\\textit{Ab initio} calculations: Results}\n\nThe calculated GW direct bandgap at the $\\Gamma$ point is  4.07 eV, at Z is 4.13 eV, and the indirect bandgap (between $\\Gamma$ and a k-point close to X) is 3.61 eV (see Fig. \\ref{fig:BandStructure} below). These values have been converged up to 0.05 eV, and the two coincide, besides the use of a different plasmon pole models. The present fully converged mimimum GW quasiparticle correction amounts to 1.4 eV, that is slightly smaller than the value of 1.69 eV from Ref. \\cite{ref:chiodo} (the difference comes from the smaller number of bands and k-points used in that calculation due to computational limitations inherent to the Yambo code at the time). The careful convergence evaluation done in the present work, the use of two different implementations of the theory (see Fig. \\ref{fig:BSECalculations}), and the very good agreement of the value of the electronic gap at $\\Gamma$ between theoretical and experimental data, allow to assess the reliability of the above reported values for describing the electronic properties of anatase TiO$_2$.\n\nThe symmetry-line along $\\Gamma$-Z features nearly parallel dispersion curves for the conduction and valence band edges. Therefore, using the direct gap at $\\Gamma$ of 4.07 eV as reference to measure the bound character of the excitons is a very good approximation (the smallest gap along that direction is $\\sim$4 eV). The peculiar shape of electronic states along $\\Gamma$-Z is closely related to the optical properties of the material. Due to the band structure shape along the $\\Gamma$-Z high-symmetry direction, we notice that the k-point sampling is especially critical for the optical spectra quality, since the main excitons are built up from optical transitions with contributions from a small region of the BZ. This region displays a wormlike shape and is located exactly along the $\\Gamma$-Z direction. \n\nA number of $\\sim$ 500 k-points (obtained from the 12$\\times$12$\\times$12 grid in Yambo or from the randomly shifted 8$\\times$8$\\times$8 grid in BerkeleyGW) provides a spectrum that is still not in perfect agreement with the experimental data (despite the improvements with respect to the one published in Ref. \\cite{ref:chiodo}, which was calculated with a less refined grid of 8$\\times$8$\\times$8 unshifted points). The absorption edge is converged to few meV already with the above cited grid, while the peak maximum of exciton I is converged within 10 meV for a grid of 12$\\times$12$\\times$12. Most importantly, the main effect of the stringent convergence obtained here with respect to k-points and number of bands is given by the shape of exciton I (see Fig. \\ref{fig:BGWvsYambo}). This charge excitation, split in two small peaks at low convergence \\cite{ref:chiodo} (or a main peak with a shoulder), becomes a unique, uniform peak, similar to the experimental shape (dark red curve in Fig. \\ref{fig:BGWvsYambo}). The k-sampling needs such a fine grid, since the main optical transitions contributing to exciton I comes from the $\\Gamma$-Z line, with bands almost parallel and flat. The two-dimensional charge transfer exciton I for \\textbf{E} $\\perp$ c (at 3.76 eV) has indeed a major contribution from the transition from the top of VB to the bottom of CB at the middle point in the $\\Gamma$-Z line. To a lesser extent, significant contributions come from the k-points lying along the $\\Gamma$-Z line and close to it in every direction. The contribution increases gradually when approaching the aforementioned $\\Gamma$-Z middle point. Even when the GW electronic band gap of 3.96 eV at the middle point along the $\\Gamma$-Z line is used as a reference energy to calculate the exciton binding energy ($\\mathrm{E_B}$), the bound nature of exciton I is confirmed (with $\\mathrm{E_B}$ = 200 meV). A phenomenological Lorentzian broadening of 0.12 eV was then applied to reproduce the experimental spectra (see Fig. \\ref{fig:Eigenvalues} for comparison with BSE eigenvalues, showing that mainly one eigenvalue is contributing to the exciton peak I). The energy, shape and reciprocal space contributions for exciton II highlights its bulk-resonance character, most evident as its offset coincides with the RPA @ GW absorption rise. On the other hand, we found that the excitonic peak (exciton III) for \\textbf{E} $\\parallel$ c (at 4.28 eV) is of a more complex nature, with a mixed contribution of bound excitons and delocalized resonant transitions. The former have the dominant character and the contributing transitions are found throughout the BZ, while the main contribution for the latter is concentrated in few points close to the $\\Gamma$-Z line in the region around Z. The energy and shape of exciton III confirm the analysis of a mixed bulk resonance and localized character, as the continuum onset in RPA @ GW appears to undergo an intensity enhancement. The mixed bulk-localized nature makes it less straightforward to estimate its $\\mathrm{E_B}$. Assuming the RPA @ GW onset at 4.4 eV for \\textbf{E} $\\parallel$ c as the reference energy for evaluating $\\mathrm{E_B}$, we estimate $\\mathrm{E_B}$ $\\sim$ 150 meV.\n\nThe slight shift of exciton III peak maximum with respect to the experimental value (0.1 eV) has also been investigated in detail. Increasing the convergence on k-points and bands did not allow to obtain an as perfect matching as for exciton I. We could also exclude possible effects of anisotropic screening by increasing the local field effects parameters and by separating the screening along the in-plane and out-of-plane components, since this does not lead to significant changes in the spectrum. The peak maximum seems instead to be related, in a nonlinear manner, to the lattice constants. The a-axis lattice constant from \\textit{ab initio} optimization is in excellent agreement with experimental data (3.79 \\AA~\\textit{vs} 3.78 \\AA), while the c-axis lattice constant is slightly (1\\%) overestimated. The energy of the peak maximum shifts of 0.2 eV when the experimental or PBE optimized lattices are used; however, the PBE lattice constants give the best agreement with the experimental data for the exciton III position.  \n\nFinally, the presence of dark excitons in anatase TiO$_2$ at energies below the bright exciton I at 3.76 eV has been ruled out by our spin-resolved optical BSE calculations (the lowest exciton in anatase TiO$_2$ is a singlet and it is optically active).\n\n\\clearpage\n\\newpage \n\n\\begin{thebibliography}{100}\n\\setcounter{enumiv}{\\value{firstbib}}\n\n\\bibitem{ref:berger}\nH. Berger, H. Tang, L\\'evy, Growth and Raman spectroscopic characterization of TiO$_2$ anatase single crystals. \\textit{J. Cryst. Growth} \\textbf{130}, 108-112 (1993).\n\n\\bibitem{ref:mahshid}\nS. Mahshid, M. Askari, M. Sasani Ghamsari, Synthesis of TiO$_2$ nanoparticles by hydrolysis and peptization of titanium isopropoxide solution. \\textit{J. Mater. Process. Tech.} \\textbf{189}, 296-300 (2007).\n\n\\bibitem{ref:rittmann-frank}\nM. H. Rittmann-Frank \\textit{et al.}, Mapping of the photoinduced electron traps in TiO$_2$ by picosecond x-ray absorption spectroscopy. \\textit{Angew. Chem.} \\textbf{53}, 23, 5858-5862 (2014).\n\n\\bibitem{ref:pzhang}\nP. Zhang \\textit{et al.}, A precise method for visualizing dispersive features in image plots. \\textit{Rev. Sci. Instrum.} \\textbf{82}, 043712 (2011).\n\n\\bibitem{ref:aspnes}\nD. E. Aspnes, Approximate solution of ellipsometric equations for optically biaxial crystals. \\textit{J. Opt. Soc. Am.} \\textbf{70}, 1275-1277 (1980).\n\n\\bibitem{ref:humlicek}\nJ. Humli{\\v{c}}ek, C. Bernhard, Diffraction effects in infrared ellipsometry of conducting samples. \\textit{Thin Solid Films} \\textbf{455}, 177-182 (2004).\n\n\\bibitem{ref:kuzmenko}\nA. B. Kuzmenko, Guide to Reffit: Software to fit optical spectra (2004)\n$<$http://optics.unige. ch/alexey/reffit.html$>$.\n\n\\bibitem{ref:onida}\nG. Onida, L. Reining, A. Rubio, Electronic excitations: density-functional versus many-body Green's-function approaches. \\textit{Rev. Mod. Phys.} \\textbf{74}, 601 (2002). \n\n\\bibitem{ref:hedin1}\nL. Hedin, New Method for calculating the one-particle Green's function with application to the electron-gas problem. \\textit{Phys. Rev.} \\textbf{139}, A796 (1965).\n\n\\bibitem{ref:hedin2}\nL. Hedin, S. Lundqvist, \\textit{Solid State Physics}, (Academic Press, New York, 1969), Vol. 23, 1.\n\n\\bibitem{ref:yambo}\nA. Marini, C. Hogan, M. Gr\\\"uning, D. Varsano, Yambo: An \\textit{ab initio} tool for excited state calculations. \\textit{Comp. Phys. Comm.} \\textbf{180}, 1392 (2009).\n\n\\end{thebibliography}\n\n\n\n\\begin{figure}[h!]\n\\centering\n\\centering\n\\includegraphics[width=\\textwidth]{FIG_AFM.jpg}\n\\caption{\\textbf{(A - B)} Surface roughness characterization of the (010)-oriented polished surface of the reduced anatase TiO$_2$ single-crystal used for the spectroscopic ellipsometry measurement. The images are taken using Atomic Force Microscopy and the average surface roughness is estimated around 0.9 nm.}\n\\label{fig:Fig_AFM}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{FigS_Absorption.pdf}\n\\caption{Room temperature steady-state absorption spectrum of anatase \\ce{TiO2} NPs dispersed in aqueous solution.}\n\\label{fig:Absorption_NPs}\n\\end{center}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[h!]\n\\centering\n\\centering\n\\includegraphics[width=\\textwidth]{FigS1.pdf}\n\\caption{\\textbf{(A)} Fermi surface in the $\\mathrm{k_xk_y}$ plane (T = 20 K, $h\\nu$ = 85 eV) of an (001)-oriented single crystal of anatase TiO$_2$ with oxygen vacancies. The total carrier density is estimated to be 2 $\\times$ 10$^{20}$ cm$^{-3}$. An electron pocket is found at the $\\Gamma$ point of the BZ. Further details are given in Ref. \\cite{ref:moser}. (\\textbf{B}) ARPES data of the electronic structure at the top of the VB between $\\Gamma$ and X. The spectrum is referenced to the Fermi energy, which lies at the bottom of the CB at $\\Gamma$.}\n\\label{fig:FigS1}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[h!]\n\\centering\n\\centering\n\\includegraphics[width=\\textwidth]{FigS2.pdf}\n\\caption{(\\textbf{A-B}) Static reflectivity spectra of (010)-oriented anatase TiO$_2$ single-crystals at 100 K. The electric field is polarized along (\\textbf{A}) the a-axis and (\\textbf{B}) the c-axis of the crystals. The data derived from our SE measurements are depicted in violet for the transparent crystal and in blue for the black crystal, while the reflectivity measured in Ref.~\\cite{ref:hosaka} is reported in red lines. (\\textbf{C-D}) Normalized static absorption spectra of (010)-oriented anatase TiO$_2$ single-crystals at 300 K. The electric field is polarized along (\\textbf{C}) the a-axis and (\\textbf{D}) the c-axis. The data derived from our SE measurements are depicted in violet for the transparent crystal and in blue for the black crystal.}\n\\label{fig:FigS2}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=\\textwidth]{FigS3.pdf}\n\\caption{Complex dielectric function of the (010)-oriented anatase TiO$_2$ single-crystal at room temperature. The electric field is polarized along (\\textbf{A}) the a-axis and (\\textbf{B}) the c-axis. The real part, $\\epsilon_1(\\omega)$, is plotted in red, while the imaginary part, $\\epsilon_2(\\omega)$, in blue. The solid-line curves depict the data directly extracted from spectroscopic ellipsometry, while the dashed lines are calculated by KK analysis of reflectivity.}\n\\label{fig:Epsilon_KK}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=\\textwidth]{FigS4.pdf}\n\\caption{UV TR measurements on different classes of (001)-oriented anatase \\ce{TiO2} single crystals at RT: the signals measured from raw crystals are depicted in black, from Cu-doped crystals in red and from reduced crystals in violet. Both pump and probe polarizations lie along the a-axis and the pump energy is set at 4.1 eV. (\\textbf{A}) Transient spectrum at the fixed time delay of 6 ps. (\\textbf{B}) Normalized temporal traces at a fixed probe energy of 3.82 eV.}\n\\label{fig:FigS4}\n\\end{center}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=\\textwidth]{FigS5.png}\n\\caption{UV TR measurements on (010)-oriented anatase \\ce{TiO2} single-crystals at RT. (\\textbf{A-B}) Color-coded maps of $\\Delta$R/R measured upon photoexcitation at 4.4 eV. (\\textbf{C-D}) Transient spectra, obtained from a cut at 1 ps in the experimental conditions reported for (\\textbf{A}) and (\\textbf{B}) respectively.}\n\\label{fig:Composite_image_TransientReflectivity}\n\\end{center}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=0.6\\textwidth]{FigS6.png}\n\\caption{Color-coded map of $\\Delta$R/R from the (010)-oriented single-crystal measured at RT upon photoexcitation at 4.4 eV and with pump and probe beams polarized along the c-axis. The probe photon energy covers the spectral range 3.7 - 4.6 eV, which demonstrates the absence of emerging features at low energies.}\n\\label{fig:TransientReflectivity_caxis}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{BandStructure.pdf}\n\\caption{Complete GW electronic band structure of bulk anatase TiO$_2$. The zero of the energy is set at the minimum of the CB at the $\\Gamma$ point. The direct gap at $\\Gamma$ sets a reference for defining the bound character of the excitons (see the discussion in the main text). The inset shows the 3D BZ of anatase TiO$_2$.}\n\\label{fig:BandStructure}\n\\end{center}\n\\end{figure}\n\n\n\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=\\textwidth]{BSECalculations.pdf}\n\\caption{Comparison between the experimental SE data (blue curve) and BSE calculations, for light polarized along (\\textbf{A}) the a-axis (\\textbf{B}) the c-axis. Both BerkeleyGW (red curve) and Yambo (violet curve) data are evaluated using the highest convergence parameter values described in the text. For BerkeleyGW they correspond to the converged spectra (both for peaks shape and position); for Yambo these are the maxima computational feasible values, allowing to obtain a reasonable spectra convergence but showing a spurious shoulder above the main exciton peak in (\\textbf{A}) (as in previously published works). The fully-converged spectra (red surves) show a single peak in agreement with the experimental data. For light polarized along the a-axis the agreement between the two calculations is excellent.}\n\\label{fig:BSECalculations}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{BGWvsYambo.pdf}\n\\caption{Comparison between the calculated $\\epsilon_{2a}$ using BerkeleyGW and Yambo. The convergence of the spectrum for increasing k-points grid dimension is reported in a red-color scale for the BerkeleyGW data, while the best converged spectrum from Yambo is shown in black.}\n\\label{fig:BGWvsYambo}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{center}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Eigenvalues.pdf}\n\\caption{Black bars represent the square of the transition matrix elements of the velocity operator along the a-axis ($|$\\textbf{E$_a$} $\\cdot \\bra{0}$ \\textbf{v} $\\ket{S}|^2$), corresponding to exciton states S contributing to the peak I. This quantity is related to the oscillator strength $\\mathrm{f_S}$ by $\\mathrm{f_S}$ = (2 $|$ \\textbf{E}$_a$ $\\cdot$ $\\bra{0}$ \\textbf{v} $\\ket{S}|^2$)/$\\mathrm{E_S}$, where $\\mathrm{E_S}$ is the excitation energy corresponding to exciton state S \\cite{ref:berkeley}. Comparison with the experimental $\\epsilon_{2a}$ (blue curve) and the full-converged BerkeleyGW calculations with a phenomenological Lorentzian broadening of 0.12 eV (red curve).}\n\\label{fig:Eigenvalues}\n\\end{center}\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 57407, "prevtext": "\n\\doublespacing\n\n\n\n\\makeatletter\n\\patchcmd{\\@maketitle}{\\LARGE \\@title}{\\fontsize{18}{19.2}\\selectfont\\@title}{}{}\n\\makeatother\n\n\n\\title{Two-dimensional excitonic quasiparticles\\\\in a three-dimensional crystal: The case of anatase TiO$_2$}\n\n\n\n\\author[1, 2]{\\mbox{Edoardo Baldini}}\n\\author[3,4]{\\mbox{Letizia Chiodo}}\n\\author[5]{\\mbox{Adriel Dominguez}}\n\\author[6]{\\mbox{Maurizia Palummo}}\n\\author[7]{\\mbox{Simon Moser}}\n\\author[8]{\\mbox{Meghdad Yazdi}}\n\\author[1]{\\mbox{Gerald Aub\\\"{o}ck}}\n\\author[8]{\\mbox{Benjamin P. P. Mallett}}\n\\author[9]{\\mbox{Helmuth Berger}}\n\\author[9]{\\mbox{Arnaud Magrez}}\n\\author[8]{\\mbox{Christian Bernhard}}\n\\author[7]{\\mbox{Marco Grioni}}\n\\author[5, 10, 11]{\\mbox{Angel Rubio}}\n\\author[1]{\\mbox{Majed Chergui}\\vspace{1cm}}\n\n\n\\affil[1]{Laboratory of Ultrafast Spectroscopy, ISIC and LACUS, EPFL, CH-1015 Lausanne, Switzerland}\n\\affil[2]{Laboratory for Ultrafast Microscopy and Electron Scattering, ICMP and LACUS, EPFL, CH-1015 Lausanne, Switzerland}\n\\affil[3]{Unit of Nonlinear Physics and Mathematical Modeling, Department of Engineering, Universit\\`a Campus Bio-Medico di Roma, Via \\'Alvaro del Portillo 21, I-00128, Rome, Italy}\n\\affil[4]{Center for Life Nano Science, Sapienza, IIT, Viale Regina Elena 291, I-00161, Rome, Italy}\n\\affil[5]{Max Planck Institute for the Structure and Dynamics of Matter, Hamburg, Germany}\n\\affil[6]{Dipartimento di Fisica, Universit\\'a ``Tor Vergata'', Via della Ricerca Scientifica 1, 00133 Roma, Italy}\n\\affil[7]{Laboratory of Electron Spectroscopy, ICMP and LACUS, EPFL, CH-1015 Lausanne, Switzerland}\n\\affil[8]{Department of Physics, University of Fribourg, Chemin du Mus\\'ee 3, CH-1700 Fribourg, Switzerland}\n\\affil[9]{Laboratory of Physics of Complex Matter Physics, ICMP, EPFL, Lausanne, Switzerland}\n\\affil[10]{Fritz-Haber-Institut der Max-Planck-Gesellschaft, Faradayweg 4-6, D-14195, Berlin, Germany}\n\\affil[11]{Departamento F\\'isica de Materiales, Universidad del Pa\\'is Vasco, Av. Tolosa 72, E-20018, San Sebasti\\'an, Spain}\n\n\\date{\\vspace{-5ex}}\n\\maketitle \n\\newpage\n\n\\label{Introduction}\n\n\n\\textbf{Bound electronic excitations play a major role in the electrodynamics of insulators and are typically described by the concept of Wannier-Mott and Frenkel excitons~\\cite{ref:ueta}. The former represent hydrogenic electron-hole pairs delocalized over several unit cells of a crystal and they occur in materials with high dielectric constant; the latter correspond to a correlated electron-hole pair localized on a single lattice site and they mostly prevail in molecular solids. Between these two extremes, an intermediate type of excitons exists, typically referred to as charge-transfer excitons~\\cite{ref:knox, ref:collart, ref:ellis}. A prototypical system in which these rare quasiparticles have been theoretically predicted~\\cite{ref:chiodo} but never experimentally confirmed is the anatase polymorph of \\ce{TiO_2}, which is one of the most promising material for light-energy conversion applications. Here, we combine angle-resolved photoemission and optical spectroscopies, along with \\textit{ab initio} state-of-the-art theoretical calculations, to demonstrate that the direct optical gap of anatase TiO$_2$ is dominated by a charge-transfer exciton band rising over the continuum of indirect interband transitions. In particular, we find that the lowest exciton possesses a two-dimensional nature and is characterized by a giant binding energy of $\\sim$ 300 meV. The universality of these findings is proven in highly defective samples used in light-energy conversion applications, by interrogating these systems out-of-equilibrium via ultrafast two-dimensional UV spectroscopy.}\n\n\\newpage\n\nThe field of excitonics has gained increased attention in the last years, due to the unique properties that excitons manifest in the conversion and transport of energy. Key to these developments is the ability to exploit exciton physics in materials that are easily fabricated and widely available.\nAnatase TiO$_2$ belongs to the class of solids with superior functionalities for the conversion of light into other forms of energy~\\cite{ref:fujishima, ref:oregan, ref:pelizzetti}, but the nature of its fundamental optical excitations is still unclear and heavily debated. Despite the absence of strong electron-electron correlations, the main source of uncertainty remains the electronic structure and its relationship to the optical spectra. It is therefore pivotal to clarify the single- and two-particle excitation spectra of anatase TiO$_2$ and to establish the nature of the charge excitations produced upon photon absorption.\n\nAnatase TiO$_2$ crystallizes in a tetragonal unit cell, built on a network of corner- or edge-sharing TiO$_6$ octahedra (Fig. \\ref{fig:Fig1}A). The substantial difference between the lattice constants a = 3.78 \\AA ~and c = 9.51 \\AA ~results in a strong anisotropy of the electronic and optical properties. First significant steps towards the understanding of the electronic structure were achieved by experimental probes such as angle-resolved photoemission (ARPES)~\\cite{ref:emori, ref:moser} and optical spectroscopies~\\cite{ref:tang_urbach, ref:hosaka, ref:sekiya}. Recent ARPES studies revealed that the fundamental bandgap of anatase TiO$_2$ has an indirect character, since the valence band (VB) maximum lies close to the X point of the Brillouin Zone (BZ) and the conduction band (CB) minimum is at the $\\Gamma$ point~\\cite{ref:emori, ref:moser}; consequently, the lowest optical absorption edge can be described in terms of an Urbach tail caused by the phonon-induced localization of excitons~\\cite{ref:tang_urbach}. This Urbach tail displays two independent responses for light polarized perpendicular or parallel to the c-axis, as expected from the intrinsic structural anisotropy of the system. Less attention, however, has been paid to the detailed characterization of the optical response above the absorption threshold, where anisotropy effects become more pronounced~\\cite{ref:hosaka, ref:sekiya}. In particular, the role played by many-body correlations in the optical properties has remained elusive to experimental probes, leading to a lack of knowledge about the character of the elementary direct charge excitations in this material.\n\nOn the theory side, Density Functional Theory (DFT) with many-body perturbation-theory corrections provided a proper description of the material's dielectric function~\\cite{ref:chiodo, ref:lawler, ref:kang, ref:landmann}. The diagonalization of the Bethe-Salpeter Hamiltonian predicted several direct optical transitions at energies well below the direct electronic gap computed at the GW level. The existence of bound excitons in anatase TiO$_2$ is, however, still awaiting experimental verification, due to the difficulty of measuring the exciton binding energy ($\\mathrm{E_B}$). Indeed, conventional experimental methods like optical absorption~\\cite{ref:muth}, photoluminescence~\\cite{ref:sell, ref:rinaldi} and magneto-optics~\\cite{ref:maan} are not suitable for an indirect gap material, as the onset of direct band-to-band transitions cannot be identified; moreover, to derive $\\mathrm{E_B}$, these methods often rely on approximate models valid only for hydrogenic Wannier-Mott excitons~\\cite{ref:elliott}.\n\nHere, we address the importance of many-body correlations in anatase TiO$_2$ by a combination of ARPES and spectroscopic ellipsometry (SE), which allows us to clarify the values of the direct gap for both charged and neutral excitations. Their difference quantifies the interaction energy between the electron and hole generated by photon absorption. Importantly, we demonstrate the existence of strongly bound charge-transfer excitons in anatase TiO$_2$ and offer an accurate and rigorous estimate of $\\mathrm{E_B}$ for a direct exciton rising over the continuum of indirect interband transitions, free from assumptions on the nature of the excitonic species under study. The results are corroborated by many-body perturbation-theory, revealing the two-dimensional (2D) spatial distribution of the excitonic states on the (001) plane and the localized nature of the excitonic states for light polarized along the [001] direction. Finally, the stability of the localized bound excitonic states in samples of different character, ranging from single-crystals with varying degrees of defects to colloidal nanoparticles (NPs), is demonstrated by ultrafast 2D spectroscopy in the deep UV spectral range.\n\n\\label{ARPES}\nThe first ingredient to determine the exciton $\\mathrm{E_B}$ is an accurate evaluation of the direct electronic band gap of the material. To estimate the direct electronic bandgap at the $\\Gamma$ point via ARPES measurements, we inject excess electrons into the CB by inducing oxygen vacancies in an (001)-oriented single-crystal (see Ref. \\cite{ref:moser}). The new Fermi level at the CB minimum represents a solid reference energy to evaluate the gap with respect to the VB. Indeed, because of the weak electronic correlations, the electron doping provided via oxygen vacancies does not significantly renormalize the electronic structure of anatase TiO$_2$ \\cite{ref:moser}. Fig. \\ref{fig:Fig1}B shows the second derivative ARPES data of the valence states at 20 K between the $\\Gamma$ and X points of the three-dimensional (3D) BZ. The dashed blue line, highlighting the top of the VB, has been drawn as a guide to the eye. As expected, the onset of the VB occurs close to the X point, and precedes the rise at $\\Gamma$ by $\\sim$ 500 meV. The direct inspection of the band structure yields a first highly dispersing band close to the VB upper edges, whose maxima in the vicinity of the X and $\\Gamma$ points sit at -3.55 $\\pm$ 0.05 eV and -4.05 $\\pm$ 0.05 eV, respectively. Our primary interest here is the value of the direct gap at the $\\Gamma$ point, which can be estimated around 4.05 eV.\n\n\\label{Ellipsometry}\nFurther insight into the nature of the elementary excitations is obtained by SE, which is a very reliable technique for measuring the dielectric function $\\epsilon$($\\omega$) = $\\epsilon_1$($\\omega$) +i$\\epsilon_2$($\\omega$) of a material, allowing the determination of the steady-state absorption and reflectance spectra. Fig. \\ref{fig:Fig2}A-B show the imaginary part of the dielectric function, $\\epsilon_2$($\\omega$), measured at 20 K in a (010)-oriented single crystal, with light polarized perpendicular (\\textbf{E} $\\perp$ c) and parallel (\\textbf{E} $\\parallel$ c) to the c-axis, respectively. We also performed analogous measurements on the single-crystals with various concentrations of oxygen vacancies used in the ARPES experiments and observed no apparent shift in the energy position of the peaks (Fig. \\ref{fig:FigS2}C-D). In Fig. \\ref{fig:Fig2}A, the direct absorption is characterized by the presence of a sharp peak at 3.79 eV (I), preceded by a long Urbach tail at lower energies~\\cite{ref:tang_urbach}. A second, broader charge excitation (II) lies at 4.61 eV and extends up to 5 eV. The c-axis response (Fig. \\ref{fig:Fig2}B) is instead characterized by a feature peaking at 4.13 eV (III) with a shoulder at 5 eV. Remarkably, all these excitations are still clearly distinguished at room temperature (RT) (Fig. \\ref{fig:Epsilon_KK}A-B).\n\n\\label{Calculations}\nTo rationalize the experimental data, we calculated the anatase TiO$_2$ band structure at the GW level of theory (Fig. \\ref{fig:Fig1}C and Fig. \\ref{fig:BandStructure}). Grey diamonds in Fig. \\ref{fig:Fig1}C denote the values obtained within GW for VB and CB at the $\\Gamma$ and X points. These are also reported in Fig. \\ref{fig:Fig1}B for a direct comparison with experimental values from ARPES, showing excellent agreement not only in the overall band shape across the explored region of the BZ, but also for the values of the band gaps, the direct one at the $\\Gamma$ point ($\\mathrm{E_{dir}}$ = 4.07 eV), and the indirect one from $\\sim$ X to $\\Gamma$ ($\\mathrm{E_{ind}}$ = 3.61 eV). These fully converged GW values are consistently reproduced within different computational approaches (see Fig. \\ref{fig:BSECalculations}). The full calculations of the electronic band structure in Fig. \\ref{fig:Fig1}C also yield important information about the $\\Gamma$-Z direction, which is crucial for understanding the optical transitions of the material. The CB and VB dispersions between $\\Gamma$ and Z are approximately parallel, providing a large joint density of states for the occurrence of optical transitions. Here, we show that this peculiar dispersion leads to intense excitonic transitions in the optical absorption spectrum for both considered light polarizations.\n\nTo unravel the nature of the optical excitations, we calculated $\\epsilon_2$($\\omega$) with and without many-body electron-hole correlations. The optical spectra in the uncorrelated-particle picture are obtained within the random-phase approximation (RPA) on top of the GW quasiparticle description, while the absorption spectra are calculated by solving the Bethe-Salpeter Equation (BSE) as implemented in the BerkeleyGW code \\cite{ref:berkeley} (see SI for details of the calculations). The simulated spectra with (violet lines) and without (red lines) electron-hole correlations are shown in Fig. \\ref{fig:Fig2}A-B. By including many-body effects \\cite{ref:chiodo, ref:lawler, ref:kang, ref:landmann}, we obtained an excellent agreement with the high-resolution SE spectra, and we performed a detailed analysis of optical transitions in real and reciprocal space. In particular, for \\textbf{E} $\\perp$ c, the calculations clearly indicate an absorption maximum (exciton I) at 3.76 eV, well below the direct valence-to-conduction optical transition evaluated at the independent particles level. Such a feature is associated with an exciton band, with the contributing exciton transitions retaining a strongly bound character. The points of the BZ involved in these transitions are the ones along the $\\Gamma$-Z direction, \\textit{i.e.} the region where the parallelism of the CB and VB dispersions largely contributes to the enhancement of the oscillator strength (inset of Fig. \\ref{fig:Fig1}C, violet arrow). Due to the almost parallel band structure for CB and VB along the $\\Gamma$-Z direction, the electronic gap at the $\\Gamma$ point (coincident with the continuum absorption rise) can be used as a reference energy in the evaluation of $\\mathrm{E_B}$, leading to $\\mathrm{E_B}$ $\\sim$ 300 meV. The combination of ARPES and SE here allows us to confirm the bound exciton scenario for the excitation observed at 3.76 eV, and to provide the first experimental estimate of $\\mathrm{E_B}$ for anatase TiO$_2$. The energy, shape and reciprocal space contributions for exciton II highlight its bulk-resonance character, most evident as its offset coincides with the RPA @ GW absorption rise. For \\textbf{E} $\\parallel$ c, the strong absorption maximum in the computational spectrum at 4.28 eV is also in very good agreement with the SE results. The energy position and peak shape of exciton III indicate a mixing of localized and bulk-resonant contributions, as the continuum onset in RPA @ GW undergoes an intensity enhancement. The k-points contributing to this charge excitation are both localized along the $\\Gamma$-Z line and distributed in the whole BZ. The mixed nature of exciton III makes it less straightforward to estimate its $\\mathrm{E_B}$. Assuming the RPA @ GW onset at 4.4 eV for \\textbf{E} $\\parallel$ c as the reference energy for evaluating $\\mathrm{E_B}$ (marked as $\\mathrm{E_{dir}}$ in Fig. \\ref{fig:Fig2}B), we can estimate $\\mathrm{E_B}$ $\\sim$ 150 meV, which is well above the standard exciton binding energies observed in bulk semiconductors.\n\n\n\\label{Isosurfaces}\nThe large $\\mathrm{E_B}$ of the excitons in anatase TiO$_2$ leads us to a deeper investigation of the nature of such anomalously bound quasiparticles. A certain degree of spatial localization has to be expected for these neutral excitations. The character of excitons I and III can be inferred by the spatial distribution of the excitonic wavefunctions in a frozen lattice. In Fig. \\ref{fig:Fig3} the relevant excitonic wavefunctions are shown on an isosurface, representing the electronic configuration when the hole of the considered excitonic pair is localized on a specific site. The first bright exciton observed for \\textbf{E} $\\perp$ c (first BSE eigenvalue at 3.76 eV) extends two-dimensionally on the (001) plane with a radius of 15 \\AA, being almost confined to a single atomic plane along the c-axis (Fig. \\ref{fig:Fig3}A and \\ref{fig:Fig3}D). Fig. \\ref{fig:Fig3}B depicts the spatial distribution of the charge excitations associated with peak II of Fig. \\ref{fig:Fig2}A, showing significant contributions from extended bulk states. Hence, this peak is ascribed to a resonant excitation which does not evolve into a bound state. Its electron wavefunction appears completely delocalized over many lattice constants around the hole. Finally, in Fig. \\ref{fig:Fig3}C, the linear combination of excitonic wavefunctions (with eigenvalues in the range 4.15-4.35 eV for \\textbf{E} $\\parallel$ c) contributing to peak III leads to a highly localized exciton in all three directions, with an average radius of 20 \\AA.\n\nTypically, the character of an exciton (Wannier-Mott, Frenkel, or an intermediate one) is driven by the combined effects of the crystal geometry and the screening properties. Our analysis reveals that excitons in anatase TiO$_2$ can be regarded as peculiar quasiparticles with an intermediate character between the Frenkel and Wannier-Mott regimes, since the spatial extent is not restricted to a single unit cell nor is it fully delocalized in space. These excitons result from the interaction between an electron in Ti $3d_{xy}$ orbitals and a hole in O $2p$ orbitals and therefore are of the charge-transfer type. Since our \\textit{ab initio} calculations are performed within the frozen lattice approximation, we are neglecting possible phonon effects that play a crucial role in the experimental optical spectra. These arise both in the Urbach tail of the spectrum, dominated by phonon-assisted interband transitions, and in the lineshapes of the excitonic features, which retain a broad character even at 20 K. Indeed, it is extremely unlikely that such a large linewidth can be explained only via the residual exciton-defect scattering in a high-quality single-crystal. Therefore, we conclude that most of the linewidth is intrinsic and arises from a series of sidebands due to coupling to several modes of the phonon field~\\cite{ref:toyozawa}. As a consequence, such strong exciton-phonon coupling may lead to the formation of polaronic excitons. The presence of an intermediate-to-strong electron-phonon coupling in anatase TiO$_2$ has already been invoked to explain experimental results naturally pointing to the polaron concept~\\cite{ref:deskins, ref:divalentin}. Recent transport~\\cite{ref:jacimovic}, ARPES~\\cite{ref:moser} and Scanning Tunneling Microscopy~\\cite{ref:setvin} data detected signatures of large polaronic electrons in the CB of this material, while earlier threshold absorption~\\cite{ref:tang_urbach} and photoluminescence~\\cite{ref:tang_PL} data provided clear evidence for Toyozawa's theory of the Urbach tail and radiative recombination of self-trapped excitons~\\cite{ref:toyozawa}. \n\n\\label{Ultrafast}\nThe above description dealt with bulk single-crystals of anatase TiO$_2$, but in most applications~\\cite{ref:fujishima, ref:pelizzetti, ref:oregan}, highly-defective samples are used at RT and ambient pressure, \\textit{e.g.} NPs or mesoporous films. The possible extension of our findings in such samples would have a strong impact on the common understanding of charge interaction and energy transport in applications involving anatase TiO$_2$. However, one expects that the carriers released by defects and the local electric fields generated by charged impurities screen the Coulomb interaction in the exciton, leading to the cancellation of the binding forces. Moreover, strong exciton-defect and exciton-impurity scattering can also cause an extreme broadening of the exciton linewidth, hiding the characteristic exciton feature into the continuum of indirect interband excitations. These ideas are reinforced upon direct inspection of the equilibrium absorption spectrum of colloidal anatase TiO$_2$ NPs, which does not show any obvious signature of excitonic transitions (Fig. \\ref{fig:Absorption_NPs} and black curve in Fig. \\ref{fig:FigAbs}A)~\\cite{ref:serpone, ref:monticone}. In addition, this spectrum is strongly affected by the scattering of the incident light. One may therefore question the validity of the above conclusions to the actual systems used in applications. \n\nHere, instead, we demonstrate that the bound excitons existing in the bulk emerge with the same phenomenology in anatase TiO$_2$ NP at RT. A powerful approach to address the existence of excitonic transitions in colloidal anatase TiO$_2$ is to interrogate the system out-of-equilibrium via ultrafast 2D UV transient absorption spectroscopy~\\cite{ref:aubock}, since this technique subtracts the scattered light and provides a better contrast for resolving hidden features. Typically, the exciton lineshapes can be identified through the pump-induced transparency of the excitonic peak, which is referred to as ``exciton bleaching''. This nonlinear optical process is intrinsically related to a many-body phenomenon: its manifestation depends not only on the final-state interactions of electron and hole involved in the excitonic state but also on the interaction with all other particles in the material, that can contribute to screening or blocking the excitonic transition~\\cite{ref:haug}. The 2D UV experiment covers the spectral region of the excitonic resonances. Fig. \\ref{fig:FigAbs}A and \\ref{fig:FigAbs}B respectively show the transient absorption (normalized $\\Delta$A) of anatase TiO$_2$ NPs in aqueous solution and the transient reflectivity ($\\Delta$R/R) of anatase TiO$_2$ single-crystals (with varying degrees of oxygen vacancies), as a function of the probe photon energy, at a time delay of 1 ps and for different pump photon energies. All the transients exhibit a negative (bleach) signal, and display two prominent features at 3.88 eV and 4.35 eV. While the former excitation is present at all pump photon energies, the latter becomes more prominent for pump photon energies beyond 4.1 eV, \\textit{i.e.} in correspondence with the threshold for accessing the c-axis optical response. Both features have a relatively narrow width of 250 meV. \n\nTo assign them, we computed $\\Delta$A from the $\\Delta$R/R measured in anatase TiO$_2$ single-crystals (see details in the SI). Fig. \\ref{fig:FigAbs}B shows the derived $\\Delta$A along the a- and c-axis, for a 4.4 eV pump photon energy and a time delay of 1 ps. In these separate polarization channels, two negative features appear at 3.88 eV and 4.32 eV, similarly to the $\\Delta$A spectra of NPs. It appears that these energies match those of the first excitonic peaks in the equilibrium absorption spectrum along the a- and c-axis (note that the values of the absorption peaks slightly differ from the peaks in the dielectric function). Hence, this analysis leads us to disentangle the a-axis and c-axis contributions in the $\\Delta$A response of the NPs. Both excitons are found to appear in the latter due to the lack of anisotropy in the randomly oriented NPs in solution. Therefore, the excitonic features are also present in the equilibrium absorption spectrum of anatase TiO$_2$ NPs, but they are obscured by the strong light scattering.\n\n\n\nEstablishing unambiguously the existence of excitons in bulk single crystals of anatase TiO$_2$ and more importantly in NPs, provides novel perspectives on the optical response of this widely used material. In particular, the 2D wavefunction of the lowest charge-transfer exciton represents a fascinating aspect, because it does not occur in a quasi-2D material. In the last years, several 2D excitons were discovered in materials such as hexagonal boron nitride~\\cite{ref:galambosi} and transition metal dichalcogenides~\\cite{ref:qiu, ref:he, ref:ugeda}, which are layered 2D systems held together by Van der Waals forces to form a 3D lattice. The lack of strong interaction between the layers yields to a physical behaviour which reflects the predominantly 2D structure. The situation of anatase TiO$_2$ is radically different in that a genuine 3D material exhibits a 2D exciton wavefunction on a specific lattice plane.\n\nBesides the fundamental interest in this exotic species, the correct description of the equilibrium optical spectrum can improve the comprehension of the enhanced photocatalytic activity of anatase TiO$_2$ (001) surface compared to other facets: to this purpose, it is crucial to establish how molecules adsorbed to this surface react to specific charge excitations generated by tunable incident light. From the point of view of devices, the newly discovered bound excitons may provide a significant source of optical nonlinearity, paving the route for the development of electro-optical or all-optical switches in the UV. Also engineered nanostructures exposing a large percentage of (001) facets can be useful in guiding the energy at the nanoscale in a selective way~\\cite{ref:yang, ref:giorgi, ref:palummo}. Finally, due to the important contribution that phonons play in the exciton linewidth and lineshape, we expect that the optical properties of anatase TiO$_2$ can be effectively altered by tuning the exciton-phonon coupling, \\textit{e.g.} through the applications of mechanical strain or via dielectric screening. In this regard, new insights from many-body theory will be crucial for evaluating the transport of these excitonic species, their coupling to the vibrational degrees of freedom and their reaction to various external stimuli.\\\\\n\n\n\\noindent \\textbf{Acknowledgments:} We thank Prof. Fabrizio Carbone for the useful discussions and Dr. Luca Moreschini for the technical support. We acknowledge financial support from the Swiss NSF via the NCCR:MUST and the contracts No. 206021-157773 and 200020-153660, the European Research Council Advanced Grant DYNamo ERC-2010-AdG-267374, Spanish Grant FIS2013-46159-C3-1-P, Grupos Consolidados del Gobierno Vasco (IT578-13), COST Actions CM1204 (XLIC), MP1306 (EUSpec), and the Austrian Science Fund (FWF P25739-N27). \n\n\\newpage\n\n\\begin{thebibliography}{100}\n\n\\bibitem{ref:ueta}\nM. Ueta, \\textit{Excitonic Processes in Solids} (Springer-Verlag, Berlin, 1986).\n\n\\bibitem{ref:knox}\nS. Knox, \\textit{Theory of Excitons} (Academic Press, New York, 1963).\n\n\\bibitem{ref:collart}\nE. Collart \\textit{et al.}, Localized and delocalized excitons: Resonant inelastic x-ray scattering in La$_{2-x}$Sr$_x$NiO$_4$ and La$_{2-x}$Sr$_x$CuO$_4$. \\textit{Phys. Rev. Lett.} \\textbf{96}, 157004 (2006).\n\n\\bibitem{ref:ellis}\nD. S. Ellis \\textit{et al.}, Charge-transfer exciton in La$_2$CuO$_4$ probed with resonant inelastic x-ray scattering. \\textit{Phys. Rev. B} \\textbf{77}, 060501 (2008).\n\n\\bibitem{ref:chiodo}\nL. Chiodo \\textit{et al.}, Self-energy and excitonic effects in the electronic and optical properties\nof TiO$_2$ crystalline phases. \\textit{Phys. Rev. B} \\textbf{82}, 045207 (2010).\n\n\\bibitem{ref:fujishima}\nA. Fujishima, K. Honda, Electrochemical photolysis of water at a semiconductor electrode. \\textit{Nature} \\textbf{238}, 37-38 (1972).\n\n\\bibitem{ref:oregan}\nB. O'Regan, M. Gr\\\"atzel, A low-cost, high-efficiency solar cell based on dye-sensitized colloidal TiO$_2$ films. \\textit{Nature} \\textbf{353}, 737-740 (1991).\n\n\\bibitem{ref:pelizzetti}\nE. Pelizzetti, C. Minero, Mechanism of the photo-oxidative degradation of organic pollutants over TiO$_2$ particles. \\textit{Electroch. Acta} \\textbf{38}, 47-55 (1993).\n\n\\bibitem{ref:emori}\nM. Emori \\textit{et al.}, Electronic structure of epitaxial anatase TiO$_2$ films: Angle-resolved photoelectron spectroscopy study. \\textit{Phys. Rev. B} \\textbf{85}, 035129 (2012).\n\n\\bibitem{ref:moser}\nS. Moser \\textit{et al.}, Tunable polaronic conduction in anatase TiO$_2$. \\textit{Phys. Rev. Lett.} \\textbf{110}, 196403 (2013).\n\n\\bibitem{ref:tang_urbach}\nH. Tang, F. L\\'evy, H. Berger, P. E. Schmid, Urbach tail of anatase TiO$_2$. \\textit{Phys. Rev. B} \\textbf{52}, 11, 7771-7774 (1995).\n\n\\bibitem{ref:hosaka}\nN. Hosaka, T. Sekiya, C. Satoko, S. Kurita, Optical properties of single-crystal anatase TiO$_2$. \\textit{J. Phys. Soc. Jap.} \\textbf{66}, 3, 877-880 (1997).\n\n\\bibitem{ref:sekiya}\nT. Sekiya, M. Igarashi, S. Kurita, S. Takekawa, M. Fujisawa, Structure dependence of reflection spectra of TiO$_2$ single crystals. \\textit{J. of Elec. Spectr. and Rel. Phen.} \\textbf{92} 247-250 (1998).\n\n\\bibitem{ref:lawler}\nH. M. Lawler \\textit{et al.}, Optical to UV spectra and birefringence of SiO$_2$ and TiO$_2$: First-principles calculations with excitonic effects. \\textit{Phys. Rev. B} \\textbf{78}, 205108 (2008).\n\n\\bibitem{ref:kang}\nW. Kang, M. S. Hybertsen, Quasiparticle and optical properties of rutile and anatase TiO$_2$. \\textit{Phys. Rev. B} \\textbf{82}, 085203 (2010).\n\n\\bibitem{ref:landmann}\nM. Landmann, E. Rauls, W. G. Schmidt, The electronic structure and optical response of rutile, anatase and brookite TiO$_2$. \\textit{J. Phys. Condens. Matter} \\textbf{24}, 195503 (2012).\n\n\\bibitem{ref:muth}\nJ. F. Muth \\textit{et al.}, Absorption coefficient, energy gap, exciton binding energy, and recombination lifetime of GaN obtained from transmission measurements. \\textit{Appl. Phys. Lett.} \\textbf{71}, 18, 2572 (1997).\n\n\\bibitem{ref:sell}\nD. D. Sell, Resolved free-exciton transitions in the optical-absorption spectrum of GaAs. \\textit{Phys. Rev. B} \\textbf{6}, 10, 3750 (1972).\n\n\\bibitem{ref:rinaldi}\nR. Rinaldi \\textit{et al.}, Exciton binding energy in GaAs V-shaped quantum wires. \\textit{Phys. Rev. Lett.} \\textbf{73}, 21, 2899 (1994).\n\n\\bibitem{ref:maan}\nJ. C. Maan, G. Belle, A. Fasolino, M. Altarelli, K. Ploog, Magneto-optical determination of exciton binding energy in GaAs-Ga$_{1-x}$Al$_x$As quantum wells. \\textit{Phys. Rev. B} \\textbf{30}, 4, 2253 (1984).\n\n\\bibitem{ref:elliott}\nR. J. Elliott, Intensity of optical absorption by excitons. \\textit{Phys. Rev.} \\textbf{108}, 6, 1384 (1957).\n\n\\bibitem{ref:berkeley}\nJ. Deslippe \\textit{et al.}, BerkeleyGW: A Massively Parallel Computer Package for the Calculation of the Quasiparticle and Optical Properties of Materials and Nanostructures. \\textit{Comput. Phys. Commun.} \\textbf{183}, 1269 (2012).\n\n\\bibitem{ref:toyozawa}\nY. Toyozawa, \\textit{Optical Processes in Solids} (Cambridge Univ. Press, New York, 2003), chap. 10.\n\n\\bibitem{ref:deskins}\nN. A. Deskins, N. Dupuis, Electron transport via polaron hopping in bulk TiO$_2$: A density functional theory characterization. \\textit{Phys. Rev. B} \\textbf{75}, 195212 (2007).\n\n\\bibitem{ref:divalentin}\nC. Di Valentin, A. Selloni, Bulk and surface polarons in photoexcited anatase TiO$_2$. \\textit{J. Phys. Chem. Lett.} \\textbf{2}, 2223-2228 (2011).\n\n\\bibitem{ref:jacimovic}\nJ. Ja\\'cimovi\\'c \\textit{et al.}, Pressure dependence of the large-polaron transport in anatase TiO$_2$ single crystals. \\textit{Europhys. Lett.} \\textbf{99}, 57005 (2012).\n\n\\bibitem{ref:setvin}\nM. Setvin \\textit{et al.}, Direct view at excess electrons in TiO$_2$ rutile and anatase. \\textit{Phys. Rev. Lett.} \\textbf{113}, 086402 (2014).\n\n\\bibitem{ref:tang_PL}\nH. Tang, H. Berger, P. E. Schmid, F. L\\'evy, G. Burri, Photoluminescence in TiO$_2$ anatase single crystals. \\textit{Sol. Stat. Comm.} \\textbf{87}, 9, 847 (1993).\n\n\\bibitem{ref:serpone}\nN. Serpone, D. Lawless, R. Khairutdinov, Size effects on the photophysical properties of colloidal anatase TiO$_2$ particles: Size quantization or direct transitions in this indirect semiconductor? \\textit{J. Phys. Chem.} \\textbf{99}, 16646 (1995).\n\n\\bibitem{ref:monticone}\nS. Monticone, R. Tufeu, A. V. Kanaev, E. Scolan, C. Sanchez, Quantum size effect in TiO$_2$ nanoparticles: Does it exist? \\textit{Appl. Surf. Sci.} \\textbf{162}, 565 (2000).\n\n\\bibitem{ref:haug}\nH. Haug, S. Schmitt-Rink, Basic mechanisms of the optical nonlinearities of semiconductors near the band edge. \\textit{J. Opt. Soc. Am. B} \\textbf{2}, 7, 1135 (1985).\n\n\\bibitem{ref:aubock}\nG. Aub\\\"ock, C. Consani, F. van Mourik, M. Chergui, Ultrabroadband femtosecond two-dimensional ultraviolet transient absorption. \\textit{Opt. Lett.} \\textbf{12}, 2337 (2012).\n\n\\bibitem{ref:galambosi}\nS. Galambosi \\textit{et al.}, Anisotropic excitonic effects in the energy loss function of hexagonal boron nitride. \\textit{Phys. Rev. B} \\textbf{83}, 081413(R) (2011).\n\n\\bibitem{ref:qiu}\nD. Y. Qiu, F. H. da Jornada, S. G. Louie, Optical spectrum of MoS$_2$: Many-body effects and diversity of exciton states. \\textit{Phys. Rev. Lett.} \\textbf{111}, 216805 (2013).\n\n\\bibitem{ref:he}\nK. He \\textit{et al.}, Tightly bound excitons in monolayer WSe$_2$. \\textit{Phys. Rev. Lett.} \\textbf{113}, 026803 (2014).\n\n\\bibitem{ref:ugeda}\nM. M. Ugeda \\textit{et al.}, Giant bandgap renormalization and excitonic effects in a monolayer transition metal dichalcogenide semiconductor. \\textit{Nat. Mat.} \\textbf{13}, 1091-1095 (2014).\n\n\\bibitem{ref:yang}\nH. G. Yang \\textit{et al.}, Anatase TiO$_2$ single crystals with a large percentage of reactive facets. \\textit{Nature} \\textbf{453}, 638-642 (2008).\n\n\\bibitem{ref:giorgi}\nG. Giorgi, M. Palummo, L. Chiodo, K. Yamashita, Excitons at the (001) surface of anatase: Spatial behavior and optical signatures. \\textit{Phys. Rev. B} \\textbf{84}, 073404 (2011).\n\n\\bibitem{ref:palummo}\nM. Palummo, G. Giorgi, L. Chiodo, A. Rubio, K. Yamashita, The nature of radiative transitions in TiO$_2$-based nanosheets. \\textit{J. Phys. Chem. C} \\textbf{116}, 18495 (2012).\n\n\\setcounter{firstbib}{\\value{enumiv}}\n\n\\end{thebibliography}\n\n\n\\newpage\n\n\\begin{figure}[h!]\n\\includegraphics[width=\\textwidth]{Fig1.pdf}\n\\caption{\\label{fig:anatasegap} (\\textbf{A}) Crystallographic structure of anatase TiO$_2$ with highlighted TiO$_6$ polyhedra. Blue atoms represent titanium, red atoms represent oxygen. (\\textbf{B}) Second derivative ARPES data of the electronic structure at the top of the VB between $\\Gamma$ and X. Dashed blue lines are reported as a guide to the eye. Grey diamonds indicate the values obtained with the GW corrections. The spectrum is referenced to the Fermi energy, which lies at the bottom of the CB at $\\Gamma$. (\\textbf{C}) Electronic band structure of bulk anatase \\ce{TiO2} along the Z - $\\Gamma$ - X directions of the first BZ. The lines indicate the DFT calculations corrected by the GW values. Grey diamond dots indicate the values obtained with the GW corrections at the high symmetry points, while the values along the high symmetry directions are obtained by correcting with linearly interpolated values. The inset shows a schematic representation of the three-dimensional electronic structure between the $\\Gamma$ and Z points of the BZ, where the CB and VB dispersions are approximately parallel. The violet and black arrow highlight the region involved in the optical transitions which contribute to exciton I and III respectively. The gap at $\\Gamma$ is a good reference to highlight the bound nature of exciton I in Fig. \\ref{fig:Fig2}.}\n\\label{fig:Fig1}\n\\end{figure}\n\\newpage\n\n\n\\begin{figure}[h!]\n\\includegraphics[width=\\textwidth]{Fig2.pdf}\n\\caption{Imaginary part of the dielectric function at 20 K with the electric field polarized along (\\textbf{A}) the a-axis and (\\textbf{B}) the c-axis. The experimental data measured by spectroscopic ellipsometry are reported in blue, the calculated spectra in the \\mbox{RPA @ GW} scheme in red and the calculated spectra in the \\mbox{BSE @ GW} scheme in violet. The quasiparticle indirect gap $\\mathrm{E_{ind}}$ = 3.61 eV is indicated by a dashed grey vertical line; the direct gaps $\\mathrm{E_{dir}}$ = 4.07 eV (at the $\\Gamma$ point) for \\textbf{E} $\\perp$ c and $\\mathrm{E_{dir}}$ = 4.4 eV (coincident with the onset of the RPA @ GW) for \\textbf{E} $\\parallel$ c are indicated by dashed black vertical lines in Fig. (\\textbf{A}) and (\\textbf{B}) respectively.}\n\\label{fig:Fig2}\n\\end{figure}\n\n\\newpage\n\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=\\textwidth]{Fig3.jpg}\n\\caption{Isosurface representation for the wavefunction of the fundamental charge excitations in anatase TiO$_2$. (\\textbf{A}) Charge-transfer exciton I at 3.76 eV. (\\textbf{B}) Resonance II at 4.37 eV. (\\textbf{C}) Charge-transfer exciton III at 4.25 eV. (\\textbf{D}) Side-view of the charge-transfer exciton I at 3.76 eV.}\n\\label{fig:Fig3}\n\\end{figure}\n\\newpage\n\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=0.6\\textwidth]{Fig4.pdf}\n\\caption{(\\textbf{A}) Normalized transient absorption spectra of room-temperature colloidal solution of anatase \\ce{TiO2} NPs at a fixed time-delay of 1 ps and for different pump photon energies (indicated in the figure). Each trace is normalized with respect to the minimum of the main feature at 3.88 eV. For comparison, the black trace shows the inverted steady-state absorption spectrum. (\\textbf{B}) Transient absorption spectrum of room-temperature anatase \\ce{TiO2} single-crystals along the a- and c-axis at a fixed time delay of 1 ps. For this experiment, the pump photon energy is 4.4 eV.}\n\\label{fig:FigAbs}\n\\end{figure}\n\n\n\\label{Supplementary Information}\n\n\\newpage\n\\setcounter{figure}{0} \n\n\n\n\n\\section{Experimental methods}\n\n\\subsection{Single crystal growth and characterization}\n\\label{Methods_SingleCrystals}\n\nHigh-quality single-crystals of anatase TiO$_2$ were produced by a chemical transport method from anatase powder and NH$_4$Cl as transport agent, similar to the procedure described in Ref. \\cite{ref:berger}. In detail, 0.5 g of high-purity anatase powder were sealed in a 3 mm thick, 2 cm large and 20 cm long quartz ampoule together with 150 mg of NH$_4$Cl, previously dried at $60\\,^{\\circ}\\mathrm{C}$ under dynamic vacuum for one night, and 400 mbar of electronic grade HCl. The ampoules were placed in a horizontal tubular two-zone furnace and heated very slowly to $740\\,^{\\circ}\\mathrm{C}$ at the source, and $610\\,^{\\circ}\\mathrm{C}$ at the deposition zone. After two weeks, millimeter-sized crystals with a bi-pyramidal shape were collected and cut into rectangular bars (typically 0.8 $\\times$ 0.6 $\\times$ 0.15 $\\mathrm{mm^3}$). We characterized the raw anatase single-crystals through transport and Reflection High-Energy Electron Diffraction (RHEED) measurements, as in Ref. \\cite{ref:moser}. Copper-doped anatase TiO$_2$ single-crystals were obtained by annealing raw anatase single-crystals in O$_2$ at $700\\,^{\\circ}\\mathrm{C}$ for 6 days in the presence of Cu vapors. The reduced form of anatase TiO$_2$ was instead obtained by annealing the raw anatase TiO$_2$ crystals at $700\\,^{\\circ}\\mathrm{C}$ for 10 days under 950 mbar of CO. \n\nThe reduced anatase TiO$_2$ single-crystal was also polished along a (010)-oriented surface, in order to be used in the spectroscopic ellipsometry (SE) measurement. The surface roughness of this crystal was estimated via Atomic Force Microscopy (AFM). Fig. \\ref{fig:Fig_AFM}A-B shows two images taken under the AFM. The average surface roughness of the polished surface was found around 0.9 nm.\n\n\n\\subsection{Nanoparticles synthesis and characterization}\n\\label{Method_NPs}\n\n\\ce{TiO2} nanoparticles (NPs) were prepared by the sol-gel method~\\cite{ref:mahshid}. The synthesis was carried out in a glove box under argon atmosphere. We used titanium isopropoxide (Sigma Aldrich, 99.999$\\%$ purity) as precursor, which was mixed with 10 ml of 2-propanol. This mixture was added dropwise under vigorous stirring to cold acidic water ($2\\,^{\\circ}\\mathrm{C}$, 250 ml \\ce{H2O}, 18 M$\\Omega$, mixed with 80 ml glacial acetic acid, final pH 2). At the beginning the mixture looked turbid, but after stirring it in an ice bath for 12 hours, it became transparent as the amorphous NPs were formed. Half of the mixture was left stirring for days to stabilize the NPs. The other half was peptized at $80\\,^{\\circ}\\mathrm{C}$ for about 2 hours until the liquid turned into a transparent gel. The gel was autoclaved at $230\\,^{\\circ}\\mathrm{C}$ for 12 hours. During this process the previous amorphous sample became denser and underwent a phase transition, resulting in anatase TiO$_2$ NPs. After the autoclave the NPs have precipitated to the bottom of the container. They were separated from the supernatant and added to 100 ml acidic water (pH 2) to obtain a white colloidal solution with a final concentration of ca. 337 mM. In Ref. \\cite{ref:rittmann-frank}, we reported the details of the sample characterization by means of X-ray diffraction and transmission electron microscopy. These techniques enabled us to demonstrate the good quality of the anatase phase and the spherical shape (with an average diameter of approximately 25 nm) of the NPs.\n\nThe steady-state absorption spectrum of the colloidal solution of anatase TiO$_2$ was recorded at room temperature using a commercial UV-VIS-NIR spectrometer (Shimadzu, UV-3600). Before measuring the absorption spectrum of the sample, a reference spectrum of the pure solvent (acidic water, pH 2) was taken to check its transparency in the investigated spectral range. Fig. \\ref{fig:Absorption_NPs} shows the absorption spectrum of the colloidal solution in a range between 2.6 eV and 4.8 eV. This spectrum is comparable to the one reported in previous works~\\cite{ref:serpone, ref:monticone}.\n\n\n\\subsection{Angle-resolved photoemission spectroscopy}\n\\label{Methods_ARPES}\n\nThe Angle-Resolved Photoemission Spectroscopy (ARPES) measurements were performed at the Electronic Structure  Factory endstation on beamline 7.0.1 at the Advanced\nLight Source, Berkeley, USA. A raw anatase TiO$_2$ single-crystal was polished and cleaned in a buffered 5$\\%$ fluoridic acid solution before introducing it into the UHV system (\\textless $10^{-10}$ mbar). The crystal was annealed in 35 mbar of oxygen at $400\\,^{\\circ}\\mathrm{C}$ for 30 minutes before the ARPES experiments. \n\n\n\\subsection{Steady-state spectroscopic ellipsometry}\n\\label{Method_Ellipsometry}\n\nUsing SE, we measured the complex dielectric function of the sample, covering the spectral range from 1.5 eV to 5.5 eV. We used a Woollam VASE ellipsometer at the University of Fribourg, Switzerland. The sample was mounted in a helium flow cryostat, allowing measurements from room temperature down to 10 K. When at cryogenic temperatures, these latter measurements were performed at $<$10$^{-8}$ mbar to prevent measurable ice-condensation onto the sample. Anisotropy corrections were performed using standard numerical procedures~\\cite{ref:aspnes} and diffraction effects at low frequency were accounted for using the procedure developed by Humli{\\v{c}}ek \\textit{et al.}~\\cite{ref:humlicek}. The data have been further corrected to account for the surface roughness of the single-crystal, which was estimated around 0.9 nm by means of AFM.\n\n\\subsection{Ultrafast two-dimensional UV spectroscopy}\n\\label{Methods_Ultrafast}\n\nThe ultrafast optical experiments have been performed using a novel set-up of tunable UV pump and broadband UV probe, described in detail in~\\cite{ref:aubock}. A 20 kHz Ti:sapphire regenerative amplifier (KMLabs, Halcyon + Wyvern500), providing pulses at 1.55 eV, with typically 0.6 mJ energy and around 50 fs duration, pumps a noncollinear optical parametric amplifier (NOPA) (TOPAS white - Light Conversion) to generate sub-90 fs visible pulses (1.77 - 2.3 eV range). The typical output energy per pulse is 13 $\\mathrm{\\mu}$J. Around 60\\% of the output of the NOPA is used to generate the narrowband pump pulses. The visible beam, after passing through a chopper, operating at 10 kHz and phase-locked to the laser system, is focused onto a 2 mm thick BBO crystal for nonlinear frequency doubling. The pump photon energy is controlled by the rotation of the crystal around the ordinary axis and can be tuned in a spectral range up to $\\sim$ 0.9 eV ($\\sim 60$ nm) wide. The typical pump bandwidth is 0.02 eV (1.5 nm) and the maximum excitation energy is about 120 nJ. The pump power is recorded on a shot-to-shot basis by a calibrated photodiode for each pump photon energy, allowing for the normalization of the data for the pump power. The remaining NOPA output is used to generate the broadband UV probe pulses with $\\sim$ 1.3 eV ($\\sim$ 100 nm) bandwidth through an achromatic doubling scheme. Pump and probe pulses, which have the same polarization, are focused onto the sample, where they are spatially and temporally overlapped. The typical spot size of the pump and the probe are 100 $\\mathrm{\\mu}$m and 40 $\\mathrm{\\mu}$m FWHM respectively, resulting in a homogeneous illumination of the probed region. \n\nThis setup can be used either in transmission or in reflection configuration. The anatase \\ce{TiO2} single-crystals were studied by detecting their transient reflectivity ($\\Delta$R/R) upon photoexcitation, while the NPs were investigated by recording their transient absorption ($\\Delta$A). In the case of the measurements on the anatase TiO$_2$ single-crystals, the specimens were mounted on a rotating sample holder, in order to explore the $\\Delta$R/R response along the desired crystalline axis. The measurements were performed on the three different classes of samples (raw anatase, copper doped anatase and reduced anatase). The crystals were polished in order to obtain optical-grade surfaces. The portion of the probe beam reflected by the surface of the crystal has been detected and the time evolution of the difference in the UV probe reflection with and without the pump pulse reconstructed. All the experiments have been performed at room temperature. Concerning the measurements on the anatase NPs, the sample consisted of anatase TiO$_2$ NPs dispersed in an aqueous solution (20\\% acetic acid and 80\\% water) to avoid interparticle charge-transfer. The colloidal solution circulated into a 0.2 mm thick quartz flow-cell to prevent photo-damage and its concentration has been adjusted to provide an optical density of approximately 0.4. Alternatively, for limiting the issues of cross-phase modulation in the sample and achieving a better time resolution, the NPs solution could be made flowing in the form of 0.2 mm thick jet. The probe was measured after its transmission through the sample and its detection synchronized with the laser repetition rate. The difference of the probe absorption with and without the pump pulse has been measured at different time delays between the pump and the probe, thanks to a motorized delay line in the probe path.\n\nAfter the sample, the transmitted/reflected broadband probe beam is focused in a multi-mode optical fiber (100 $\\mathrm{\\mu}$m), which is coupled to the entrance slit of a 0.25 m imaging spectrograph (Chromex 250is). The beam is dispersed by a 150 gr/mm holographic grating and imaged onto a multichannel detector consisting of a 512 pixel CMOS linear sensor (Hamamatsu S11105, 12.5 $\\times$ 250 $\\mathrm{\\mu}$m pixel size) with up to 50 MHz pixel readout, so the maximum read-out rate per spectrum (almost 100 kHz) allows us to perform shot to-shot detection easily. The described experimental setup typically offers a time resolution of 150 fs, but can be improved to 80 fs with the adoption of a prism compressor on the pump pulses, at the expenses of a reduction of the probe bandwidth in the achromatic frequency doubling scheme.\n\n\n\n\\section{Additional experimental results}\n\\subsection{Angle Resolved Photoemission Spectroscopy}\n\nThe ARPES experiment has been performed on an (001)-oriented single-crystal at T = 20 K. The presence of oxygen vacancies leads the injection of electrons in the conduction band (CB), causing a shift of the Fermi level ($\\mathrm{E_F}$) to approximately 80 meV above the bottom of the CB at $\\Gamma$. Fig. \\ref{fig:FigS1}A is a constant energy map measured at the $\\mathrm{E_F}$ with a photon energy $h\\nu$ = 85 eV. The partially resolved circular contours at the center of the BZ correspond to a small electron pocket at the bottom of the CB. Further details on the characterization of this electron pocket are reported in Ref. \\cite{ref:moser}. Fig. \\ref{fig:FigS1}B shows the ARPES data of the valence states at 20 K between the $\\Gamma$ and X points of the three-dimensional BZ. The data have been measured with a photon energy $h\\nu$ = 128 eV. Fig. \\ref{fig:Fig1}B in the main text represents the second-derivative of these data along the energy direction. This method has been proven effective for resolving dispersive features in ARPES maps~\\cite{ref:pzhang}.\n\n\\subsection{Steady-state spectroscopic ellipsometry}\n\\label{Results_Ellipsometry}\n\nThe SE measurements have been performed on two classes of (010)-oriented single-crystals, namely reduced anatase (transparent crystal) and raw anatase (black crystal).\n\n\\noindent The reflectivity response derived from SE on the transparent (violet lines) and black (blue lines) single crystals is plotted in Fig. \\ref{fig:FigS2}A-B together with the data of Hosaka \\textit{et al.} (red lines)~\\cite{ref:hosaka}. The reflectivities for light polarized along the a- and c-axis of the crystals are shown in Fig. \\ref{fig:FigS2}A and \\ref{fig:FigS2}B, respectively. In order to establish a direct comparison with the normal-incidence reflectivity data of Hosaka \\textit{et al.}~\\cite{ref:hosaka}, all reported traces have been measured at 100 K. We observe the overall agreement of our results with the ones reported in literature, with slight shifts in the reflectivity peak energies. However, given the sharpness of the reflectivity lineshapes, we can also deduce that the quality of our transparent crystal is much higher than the one employed by Hosaka \\textit{et al.}~\\cite{ref:hosaka}. Indeed, the reflectivity spectrum of the latter is closer to the response measured on our black crystal, which has a large percentage of oxygen vacancies.\n\nFig. \\ref{fig:FigS2}C-D display the normalized absorption spectra of our anatase TiO$_2$ single-crystals at 300 K. The a- and c-axis responses are respectively shown in Fig. \\ref{fig:FigS2}C and \\ref{fig:FigS2}D. Here, our interest is to reveal the robustness of the excitonic peaks even at room temperature and to highlight the role played by the presence of oxygen vacancies in the black sample. Hence, for this purpose, the data have been normalized with respect to the lowest direct exciton peaks. We observe that in both the a- and c-axis absorption spectra the exciton peak energies are not renormalized by the presence of oxygen vacancies, while the linewidth becomes clearly broader in the black crystal. We associate this effect with the higher exciton-defect scattering, which reduces the lifetime of the excitonic species.\n\nFig. \\ref{fig:Epsilon_KK}A and \\ref{fig:Epsilon_KK}B display $\\epsilon_1(\\omega)$ and $\\epsilon_2(\\omega)$ calculated by applying the KK analysis on the reflectivity spectrum at room temperature. This technique represents a valuable test to evaluate the consistency with our original $\\epsilon_1(\\omega)$ and $\\epsilon_2(\\omega)$ values. We observe that the effect of the KK transformation on both the in-plane and out-of-plane $\\epsilon_2(\\omega)$ is to modify the lineshape and the intensity of the peaks and to change the spectral-weight in the Urbach tail. This behavior proves that the KK analysis, even performed on the broadest possible spectral range, is not a precise approach to treat the normal-incidence reflectivity data.\n\n\\subsection{Ultrafast transient-reflectivity of single crystals}\n\nThe femtosecond transient-reflectivity experiments have been performed on three different types of (001)-oriented single-crystals, namely raw anatase (black crystal), copper-doped anatase (red crystal) and reduced anatase (transparent crystal), and on a (010)-oriented raw anatase single-crystal. In the first experiment we monitored the $\\Delta$R/R signal in a broadband UV range (3.75 - 4.35 eV) for the three classes of (001)-oriented samples along the ab planes. Both pump and probe polarizations were set in a parallel configuration. An isotropic optical response is found when the (001)-oriented crystals are rotated about the c axis. The pump energy was set at 4.1 eV, in order to selectively perturb the spectral region above the first excitonic peak.\n\nFig. \\ref{fig:FigS4}A compares the transient spectrum obtained from the three specimens at a fixed time-delay of 6 ps. The $\\Delta$R/R spectrum is bipolar, showing an inversion point around 3.96 eV. The inflection that is present in the signal obtained from the Cu-doped sample around 4.1 eV is an artefact produced by the scattering of the pump beam. A similar response can be found for all the temporal delays between pump and probe up to 1 ns. The main difference is displayed by the intensity of the signal at long time delays, since it depends on the rate of the carrier recombination process. Fig \\ref{fig:FigS4}B shows three temporal traces up to 100 ps probed around 3.82 eV, in which this effect is most visible. The decay of the nonequilibrium signal in the black crystal is faster than the other responses, since the increased density of in-gap states facilitates charge carrier recombination across the bandgap. The detailed analysis of the kinetics will be subject of a future separate publication.\n\nA second set of experiments was subsequently performed on (001)- and (010)-oriented black single-crystals of anatase \\ce{TiO2}, in order to access the anisotropic dynamics along a- and c- axes. Fig. \\ref{fig:Composite_image_TransientReflectivity}A and \\ref{fig:Composite_image_TransientReflectivity}C display the transient-reflectivity maps of the in-plane and out-of-plane response of the (010)-oriented single-crystal, as a function of the probe energy and of the time delay between pump and probe. Although the kinetics have been registered up to 1 ns, the two maps are displayed up to 10 ps. The a-axis response was measured upon photoexcitation at 4.4 eV, with the broadband probe covering the range 3.7 eV - 4.65 eV. These results have also been reproduced by polarizing the beams along the [100] axis of the (001)-oriented samples. The higher-energy region of the spectrum does not evolve in time, remaining unaffected by the photoexcitation process. The c-axis response (Fig. \\ref{fig:Composite_image_TransientReflectivity}C) is obtained through the measurement of the (010)-oriented single-crystal with a pump and probe polarizations set along the c-axis. Also in this case the pump energy is at 4.4 eV, but the probed range is shifted to 4.05 eV - 4.8 eV. The transient spectrum of Fig. \\ref{fig:Composite_image_TransientReflectivity}D strongly differs from the in-plane one, consisting of a negative contribution set around 4.28 eV and a tail extending to 4.6 eV in the high-energy range.\n\n\\noindent A conclusive $\\Delta$R/R map with both pump (at 4.4 eV) and probe (between 3.7 and 4.6 eV) polarized along the c-axis of the (010)-oriented single-crystal is reported in Fig. \\ref{fig:TransientReflectivity_caxis}. This demonstrates the absence of c-axis spectral features at low energies and confirms the finding of the pump-probe experiment along the c-axis reported in Fig. \\ref{fig:Composite_image_TransientReflectivity}C. The difference in terms of intensity with respect to Fig. \\ref{fig:Composite_image_TransientReflectivity}C has to be attributed to the reduced pump intensity (of $\\sim$ 1/3) due to constraints in the generation of the broadband probe beam.\n\\newpage\n\n\\section{Theory and data analysis}\n\n\\subsection{Extracting $\\Delta$A from $\\Delta$R/R in single-crystals}\n\nIn our ultrafast measurements, we probed $\\Delta$R/R of anatase \\ce{TiO2} single-crystals and $\\Delta$A of a colloidal solution of NPs. Thus, it is useful to analyse the time-resolved dynamics of the single-crystals in terms of their transient-absorption, in order to establish a link with the data on NPs. However, while $\\Delta$A is directly proportional to $\\Delta\\epsilon_2$, $\\Delta$R/R has a non-trivial relationship with both $\\Delta\\epsilon_1$ and $\\Delta\\epsilon_2$ in the probed spectral range. Indeed, in the UV, the real and imaginary part of the dielectric constant have rather similar absolute values. For this reason, the optical reflectivity is equally sensitive to the reactive and the absorptive components of the dielectric function.\n\nHence, in order to calculate the pump-induced evolution  of the $\\Delta$A from the $\\Delta$R/R data, we proceed as follows. We model the static ellipsometry data using a set of Lorentz oscillators, we calculate the equilibrium reflectivity ($\\mathrm{R_{0}}$), and we fit the measured transient reflectance $\\mathrm{R_{exp}}$(t)/$\\mathrm{R_{exp}}$ with a differential model (R(t) - $\\mathrm{R_0}$)/$\\mathrm{R_{0}}$, where R(t) is a model for the perturbed reflectivity obtained by variation of the parameters used to fit the equilibrium data as a function of the pump-probe delay t. We adopted this approach to treat our $\\Delta$R/R data in order to avoid possible systematic errors that can be produced by the typical analysis through Kramers-Kronig transformations. The SE spectra were fitted using the RefFIT program \\cite{ref:kuzmenko}. The dielectric function is given by:\n\n", "index": 1, "text": "\\begin{equation}\n\\epsilon(\\omega) = \\epsilon_\\infty + \\sum_i\\frac{\\omega^2_{pi}}{\\omega^2_{0i}-\\omega^2-i\\Gamma_i\\omega}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\epsilon(\\omega)=\\epsilon_{\\infty}+\\sum_{i}\\frac{\\omega^{2}_{pi}}{\\omega^{2}_{%&#10;0i}-\\omega^{2}-i\\Gamma_{i}\\omega}\" display=\"block\"><mrow><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>ϵ</mi><mi mathvariant=\"normal\">∞</mi></msub><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mfrac><msubsup><mi>ω</mi><mrow><mi>p</mi><mo>⁢</mo><mi>i</mi></mrow><mn>2</mn></msubsup><mrow><msubsup><mi>ω</mi><mrow><mn>0</mn><mo>⁢</mo><mi>i</mi></mrow><mn>2</mn></msubsup><mo>-</mo><msup><mi>ω</mi><mn>2</mn></msup><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Γ</mi><mi>i</mi></msub><mo>⁢</mo><mi>ω</mi></mrow></mrow></mfrac></mrow></mrow></mrow></math>", "type": "latex"}]