[{"file": "1601.02113.tex", "nexttext": "\nThe leading-power logarithms determined by the coefficients $c_{n m}^{(-1)}$ are directly\nrelated to the infrared and collinear divergences of the amplitudes, and, as a consequence,\nthey can be resummed to all-orders in perturbation theory, using a technology which has\nbeen well understood for decades and is now routinely applied to increasing logarithmic \naccuracy. For massless gauge-theory scattering amplitudes, soft and collinear effects\nfactorise\\cite{Dixon:2008gr}, according to\n\n", "itemtype": "equation", "pos": 14167, "prevtext": "\n\n\\title{ \nTHE GROWING TOOLBOX OF PERTURBATIVE QCD}\n\n\\author{\nLorenzo Magnea        \\\\\n{\\em Dipartimento di Fisica, Universit\\`a di Torino, and INFN, Sezione di Torino} \\\\\n}\n\\maketitle\n\n\\baselineskip=11.6pt\n\n\\begin{abstract}\nAdvances in perturbative QCD techniques have been crucial for the successful \ninterpretation of the data collected in Run I of LHC, and for the discovery of the \nHiggs boson. I will very briefly highlight some recent additions to the QCD toolbox,\nand note how these new tools are likely to be essential for future precision physics,\nboth in Run II at the LHC, and in view of future hadron and lepton colliders\\footnote{Talk \ngiven at the Workshop ``LFC15: Physics Prospects for Linear and Other Future Colliders'',\nECT*, Trento, 7-11 September 2015.}.\n\\end{abstract}\n\n\\baselineskip=14pt\n\n\n\\section{Introduction}\n\nThe first run of the LHC was a resounding success, culminating in the Nobel-prize-winning\ndiscovery of the Higgs boson: a great achievement, although the discovery was to a large \nextent expected. Strikingly, on the other hand, the Standard Model of particle physics held \nup, and it is now tested and verified to an unexpected, even amazing degree of accuracy\nall the way up to the TeV energy scale: no evidence for new physics turned up in Run I. This \nseems to have heightened the expectations for Run II: indeed, the recent announcement by \nCMS and ATLAS of a small excess of events in the di-photon channel triggered the publication,\nin less than one week, of more than one hundred papers with tentative theoretical interpretations, \nwith the first papers appearing within minutes of the announcement. In a few months we will \nknow if this outburst of speculative activity will be justified by further data. The task of this \nWorkshop, however, is to look further ahead, to the next generation of machines which\nare currently being discussed and planned, and which will succeed or complement the \nLHC at the high-energy frontier.\n\nThe lesson that I would like to draw from the experience of the past years, leading up \nto the LHC operation and the data analyses of Run I, is that the role of precision Standard\nModel phenomenology has been crucial to develop a sufficient understanding of the\nimmensely complex processes underlying LHC collisions, and will remain crucial for\nour ability to adequately exploit any future high-energy collider\\cite{Forte:2015cia}. \n\nThe past ten to fifteen years have seen remarkable progress in our quantitative control \nof the three stages of hadron collisions. The parametrisation of initial states by means \nof parton distributions (PDFs) has undergone a radical overhaul, and we now have \nseveral independent and reliable sets of PDF's, with credible determinations of their \nuncertainties\\cite{Butterworth:2015oua}; our understanding of the hadron jets that \ncharacterise most collider final states has similarly evolved from qualitative to precisely \nquantitative, with the development of fast infrared-safe jet algorithms allowing for \nprecise predictions for complex jet configurations, including studies of the internal structure \nof the jets themselves\\cite{Adams:2015hiv}. Finally, our capabilities to compute the \nhard-scattering partonic cross sections at the heart of LHC collisions has progressed \nmuch beyond what might have been expected: NLO calculations of multi-particle final \nstates matched to parton showers are now the standard, and the extension of these \ntechniques to NNLO and beyond is well under way\\cite{Andersen:2014efa}.\n\nIt is easy to argue that the splendid results of LHC Run I would not have been possible \nwithout this vast body of work, stemming from many collaborations involving hundreds\nof phenomenologists. Similarly, exploiting future colliders, which will operate at even higher \nenergies, and likely require even higher precisions, will not be possible without a continued \neffort to refine our understanding of Standard Model processes.\n\nIn the limited space of this contribution, I will begin by emphasising the non-trivial role \nplayed by QCD predictions even at future lepton colliders; I will continue by giving\nsome examples of the QCD tools developed in the past few years to handle high-order\nperturbative calculations, and I will conclude by briefly summarising some recent \nprogress in the field of soft-gluon resummation, which may soon shed light on a new\nclass of all-order contributions to interesting hadronic cross sections.\n\n\n\\section{QCD at future (lepton) colliders}\n\nThere is clearly no need to make the case for the importance of perturbative QCD\nstudies at future hadron colliders, such as foreseen upgrades of the LHC, or the\nprospective 100 TeV collider\\cite{Arkani-Hamed:2015vfh}. On the other hand, \npreliminary physics assessment of proposed lepton colliders, such as TESLA, \nILC or CLIC, have often focused (quite understandably) on their new physics \npotential, leaving the Standard Model on the sidelines. On occasions, this \nemphasis can be misleading, and further analysis shows that a detailed \nhigh-precision Standard Model analysis is necessary in order to exploit \nthe full potential of the machine. Here are a few examples, focusing on \nQCD studies.\n\n\\subsection{Hadronic jets}\n\nLepton colliders are designed as precision machines, but, at high energies, many\nimportant final states will be characterised by a very high jet multiplicity. Such states\nare not easy to characterise accurately. As an example, consider $t \\bar{t} H$ \nproduction, with all particles decaying hadronically: this leads to an eight-jet final \nstate, with at least four $b$-quark jets. If coloured supersymmetric particles were \nto be discovered, they would easily lead to even more complex final states. At a \nhadron collider, one might sidestep the problem by focusing on (semi) leptonic\nfinal states, but given  the lower number of events to be expected for example at ILC,\nexploiting fully hadronic final states may prove necessary. Such high-multiplicity \nfinal states are likely to require the most advanced available QCD \ntechniques for jet identification, tagging and mass reconstruction. One may also \nnote that some of these techniques will need to be retuned (see for example \n\\cite{Boronat:2014hva}): boost invariance of the jet-finding algorithm will be less \nrelevant, and jet-substructure studies will have a more limited impact since heavy \nstates are unlikely to be heavily boosted.\n\n\\begin{figure}[htb]\n    \\begin{center}\n        {\\includegraphics[scale=0.12]{clic.jpg}}\\hspace{0.5cm}\n        \\caption{\\it A simulated event including the production of a $t \\bar{t}$ pair \n        at CLIC, with $\\sqrt{s} = 3$ TeV, and overlaid background from $\\gamma \\gamma \n        \\to$ hadrons, from\\cite{Linssen:2012hp}.}\n    \\label{clic}\n    \\end{center}\n\\end{figure}\n\n\\subsection{Underlying event}\n\nOne of the reasons why lepton colliders are (correctly) touted as `clean' precision\nmachines is the absence of the `underlying event', the complex low $p_T$ scattering\nof hadron remainders that surrounds the hard scattering at hadron colliders. It is however\nwell understood by now that at sufficiently high energy a very significant `underlying \nevent' develops at lepton colliders as well. Just as protons at high energy can be \nseen as made mostly of gluons, leptons acquire an increasingly dominant photon \ncomponent, which materialises as an underlying event through photon scattering,\nvia $\\gamma \\gamma \\to$ hadrons. Fig.~\\ref{clic}, taken from the CLIC Conceptual\nDesign Report\\cite{Linssen:2012hp} shows the simulation of a hard scattering event \nincluding the production of a $t \\bar{t}$ pair, at $\\sqrt{s} = 3$ TeV, with the hadron \nbackground generated by photon collisions. At this CM energy, the background \ndeposits 1.2 TeVs of energy per event in the detector, which will have to be subtracted\nusing refinements of recently developed tools such as jet areas\\cite{Cacciari:2015jwa}.\n\n\\subsection{Standard Model parameters}\n\nLepton colliders hold the promise to give the most precise determinations of key \nStandard Model parameters, for example $m_{\\rm top}$ and $\\alpha_s$. This was \ndiscussed elsewhere in this Workshop, it has recently been reviewed in detail\nin\\cite{Moch:2014tta,d'Enterria:2015toz}, and certainly cannot be discussed in \nthis very limited space. Once again, however, it is worth emphasising that these\ndeterminations must rely upon state-of-the-art, high-order, precision QCD \ncalculations. A case in point is the recently computed three-loop correction to\nthe near-threshold production of $t \\bar{t}$ pairs\\cite{Beneke:2015kwa}, which\nwill play a key role in the determination of $m_{\\rm top}$ with better than permil \nprecision through a threshold scan: only at this level, reached through a combination\nof effective field theory techniques with high-level tools for loop calculations, one\nobserves that the theoretical uncertainty comes under full control.\n\n\n\\section{Selected examples of new tools}\n\nRecent years have seen a remarkable degree of progress in our ability to compute\ngauge theory amplitudes and cross sections to very high perturbative orders. To \nsome extent, this was certainly triggered by the needs of LHC, but it is interesting\nto note that several of the new techniques that have been deployed are connected \nto purely theoretical developments originating from studies of $N = 4$ Super-Yang-Mills \n(SYM) theory and thus ultimately related to string theory. Altogether, the new developments \nare feeding a `NNLO revolution' which has already yielded a number of phenomenologically\nrelevant results for $2 \\to 2$ LHC processes. Some aspects of these recent developments \nare briefly touched upon below. \n\n\\subsection{High-order amplitudes and iterated integrals}\n\nThe development of unitarity-based methods to compute scattering amplitudes, \ntogether with several pioneering high-order calculations in $N= 4$ SYM, brought \nthe focus on the concept of `transcendental weight' of the functions arising in \nFeynman diagram calculations. We now know that a vast class of gauge-theory \nscattering amplitudes can be expressed in terms of generalised polylogarithms \nthat can be generated by means of iterated integrals, which in turn encode in \na simple way the singularity structure of the amplitude as a function of the \nMandelstam invariants. Understanding the class of functions that make up the\nresult for a scattering amplitude can often turn an extremely difficult analytic \nproblem into a relatively simple algebraic one, so these new mathematical tools\n(recently reviewed in\\cite{Duhr:2014woa}) have quickly found application in a \nnumber of phenomenological calculations. While the tools turn out to be especially\npowerful for a conformal theory like $N=4$ SYM, it has become clear that they \nhave direct applications also to QCD and electroweak amplitudes and cross \nsections. The breakthrough\\cite{Henn:2013pwa} was the realisation that the well-known\nmethod of differential equations for the computation of Feynman amplitudes could\nbe optimised to a truly remarkable degree by choosing (when possible) a basis of \nmaster integrals belonging to the class of iterated integrals mentioned above.\nThe method, reviewed in\\cite{Henn:2014qga}, is proving very powerful, and the \nlist of NNLO calculations that have become available in its wake is already much\ntoo long to be referenced here. More generally, it is remarkable that, after many\ndecades of intensive studies, perturbative quantum field theory can still surprise \nus, with the discovery of new and beautiful mathematical structures and entirely\nnovel viewpoints.\n\n\\subsection{NNLO subtraction}\n\nThe calculation of loop-level partonic cross section requires the cancellation of infrared\nand collinear divergences which appear separately in virtual corrections and when \nreal emission corrections are integrated over the phase space of undetected partons.\nThe problem has been well understood in principle for decades, but the construction \nof a sufficiently general and efficient algorithm to perform the cancellation at NNLO\nhas proved much harder than expected. Crucially for phenomenological applications,\nseveral practical solutions to this problem have now been proposed and are in different\nstages of being applied or tested\\cite{Currie:2012qxa,Czakon:2014oma,Bonciani:2015sha,\nDelDuca:2015zqa,Boughezal:2015dra}. As a matter of principle, the optimal `subtraction\nalgorithm' should have several attributes: complete generality across all IR-safe \nobservables with arbitrary numbers of final state partons, exact locality of the IR and\ncollinear counterterms, which should be computed analytically to optimize speed and\ntheoretical understanding, exact independence on external parameters introduced \nto `slice' away the singular regions of phase space, and overall computational efficiency.\nIn this sense, none of the existing methods qualifies as a `silver bullet' enjoying all \nthese properties. The methods however have proven sufficiently powerful to perform\npioneering and highly non-trivial NNLO calculations, such as the $t \\bar{t}$ \nproduction cross section\\cite{Czakon:2013goa} and the Higgs-plus-jet cross \nsection\\cite{Boughezal:2015dra}. Rapid further developments towards the automatisation\nof NNLO calculations, similarly to what has been done at NLO in recent years, are \nunder way.\n\n\\subsection{Threshold resummation beyond leading power}\n\nTo conclude this bird's eye overview with a theme where I have made a direct contribution,\nI will now briefly discuss the all-order summation of soft and collinear gluon effects, which\nis often necessary to extend the applicability of perturbative calculations to regions of phase\nspace where large logarithms of ratios of mass scales appear order by order in the coupling.\nSpecifically, I consider the common situation in which a partonic cross section has a \nthreshold for the production of some heavy state, for example a vector boson, a Higgs boson,\nor a heavy coloured final state such as a $t \\bar{t}$ pair. In these circumstances, the \ncross section $\\sigma(\\xi)$ depends logarithmically on the distance from threshold $\\xi$,\naccording to\n\n", "index": 1, "text": "\\begin{equation}\n  \\frac{d \\sigma}{d \\xi} \\, = \\, \\sum_{n = 0}^{\\infty} \\left( \\frac{\\alpha_s}{\\pi} \\right)^n \\, \n  \\sum_{m = 0}^{2 n - 1} \\left[ c_{n m}^{(-1)}\n  \\left( \\frac{\\log^m \\xi}{\\xi} \\right)_+ + c_n^{(\\delta)} \\, \\delta(\\xi) +\n  c_{nm}^{(0)} \\, \\log^m \\xi \\, + \\, \\ldots \\right] \\, .\n\\label{thresholddef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{d\\sigma}{d\\xi}\\,=\\,\\sum_{n=0}^{\\infty}\\left(\\frac{\\alpha_{s}}{\\pi}\\right%&#10;)^{n}\\,\\sum_{m=0}^{2n-1}\\left[c_{nm}^{(-1)}\\left(\\frac{\\log^{m}\\xi}{\\xi}\\right%&#10;)_{+}+c_{n}^{(\\delta)}\\,\\delta(\\xi)+c_{nm}^{(0)}\\,\\log^{m}\\xi\\,+\\,\\ldots\\right%&#10;]\\,.\" display=\"block\"><mrow><mrow><mpadded width=\"+1.7pt\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>σ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ξ</mi></mrow></mfrac></mpadded><mo rspace=\"4.2pt\">=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><msub><mi>α</mi><mi>s</mi></msub><mi>π</mi></mfrac><mo>)</mo></mrow><mi>n</mi></msup></mpadded><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>0</mn></mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow><mo>-</mo><mn>1</mn></mrow></munderover><mrow><mo>[</mo><mrow><mrow><msubsup><mi>c</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><msub><mrow><mo>(</mo><mfrac><mrow><msup><mi>log</mi><mi>m</mi></msup><mo>⁡</mo><mi>ξ</mi></mrow><mi>ξ</mi></mfrac><mo>)</mo></mrow><mo>+</mo></msub></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msubsup><mi>c</mi><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mi>δ</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mpadded><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ξ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msubsup><mi>c</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mpadded><mo>⁢</mo><mrow><msup><mi>log</mi><mi>m</mi></msup><mo>⁡</mo><mpadded width=\"+1.7pt\"><mi>ξ</mi></mpadded></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02113.tex", "nexttext": "\nwhere I wrote the particle momenta  as $p_i = Q \\beta_i$, with $Q$ a hard scale, the soft \nfunction ${\\cal S}_{n} (\\beta_i)$ parametrises soft-gluon effects, and the jet functions $J$ \nand ${\\cal J}$ contain collinear dynamics. Each function has a gauge invariant operator \ndefinition, for example for a quark\n\n", "itemtype": "equation", "pos": 14985, "prevtext": "\nThe leading-power logarithms determined by the coefficients $c_{n m}^{(-1)}$ are directly\nrelated to the infrared and collinear divergences of the amplitudes, and, as a consequence,\nthey can be resummed to all-orders in perturbation theory, using a technology which has\nbeen well understood for decades and is now routinely applied to increasing logarithmic \naccuracy. For massless gauge-theory scattering amplitudes, soft and collinear effects\nfactorise\\cite{Dixon:2008gr}, according to\n\n", "index": 3, "text": "\\begin{equation}\n  {\\cal A}_{n} (p_i) \\, = \\, \\prod_{i = 1}^n \\left[ \\frac{J_i (p_i)}{{\\cal J}_i (\\beta_i)} \\right] \n  \\cdot {\\cal S}_{n} (\\beta_i) \\cdot {\\cal H}_{n} (p_i) \\, ,\n\\label{factorised}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\cal A}_{n}(p_{i})\\,=\\,\\prod_{i=1}^{n}\\left[\\frac{J_{i}(p_{i})}{{\\cal J}_{i}(%&#10;\\beta_{i})}\\right]\\cdot{\\cal S}_{n}(\\beta_{i})\\cdot{\\cal H}_{n}(p_{i})\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒜</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\">=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><mrow><mrow><mrow><mrow><mo>[</mo><mfrac><mrow><msub><mi>J</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒥</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>β</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>]</mo></mrow><mo>⋅</mo><msub><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mi>n</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>β</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>n</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02113.tex", "nexttext": "\nwhere $\\Phi_n$ is a Wilson line factor and $n$ is an auxiliary `factorisation vector'. \nFor well-behaved IR-safe observables, the factorisation in Eq. (\\ref{factorised}) leads \nto resummation of leading-power threshold logarithms. At next-to-leading power (NLP), \nan increasing body of evidence has been suggesting that a similar organisation of the \nlogarithms determined by the coefficients $c_{n m}^{(0)}$ should be possible\\cite{Laenen:2008ux}. \nIn the soft sector, it is indeed possible to extend the soft exponentiation theorem beyond \nleading power\\cite{Laenen:2008gt,Laenen:2010uz}, but this proves insufficient\nto generate all NLP logarithms starting at two loops. The reason is the interference\nof collinear singularities with (next-to-) soft emissions, which prevents their complete \nfactorisation. This obstacle was first overcome by Del Duca\\cite{DelDuca:1990gz},\nand recently revisited and applied to electroweak annihilation cross sections\nin\\cite{Bonocore:2014wua,Bonocore:2015esa}. The result is a generalisation of \nthe leading-power factorisation in Eq. (\\ref{factorised}), which, in its simplest form, \nreads\n\n", "itemtype": "equation", "pos": 15507, "prevtext": "\nwhere I wrote the particle momenta  as $p_i = Q \\beta_i$, with $Q$ a hard scale, the soft \nfunction ${\\cal S}_{n} (\\beta_i)$ parametrises soft-gluon effects, and the jet functions $J$ \nand ${\\cal J}$ contain collinear dynamics. Each function has a gauge invariant operator \ndefinition, for example for a quark\n\n", "index": 5, "text": "\\begin{equation}\n  J (p, n) \\, u(p) \\, = \\, \\left\\langle 0 \\left| \\Phi_n (\\infty, 0)\n  \\psi(0) \\right| p \\right\\rangle \\, ,\n\\label{Jdef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"J(p,n)\\,u(p)\\,=\\,\\left\\langle 0\\left|\\Phi_{n}(\\infty,0)\\psi(0)\\right|p\\right%&#10;\\rangle\\,,\" display=\"block\"><mrow><mrow><mrow><mi>J</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><mi>n</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\">=</mo><mrow><mo>⟨</mo><mn>0</mn><mo fence=\"true\">|</mo><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">∞</mi><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo fence=\"true\">|</mo><mi>p</mi><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02113.tex", "nexttext": "\nwhere ${\\cal A}^\\mu$ is an amplitude including the radiation of an extra soft gluon,\n$G_{\\mu \\nu}$ is a kinematic projection, and $J_\\mu$ is a `radiative jet' function \ndefined by\n\n", "itemtype": "equation", "pos": 16788, "prevtext": "\nwhere $\\Phi_n$ is a Wilson line factor and $n$ is an auxiliary `factorisation vector'. \nFor well-behaved IR-safe observables, the factorisation in Eq. (\\ref{factorised}) leads \nto resummation of leading-power threshold logarithms. At next-to-leading power (NLP), \nan increasing body of evidence has been suggesting that a similar organisation of the \nlogarithms determined by the coefficients $c_{n m}^{(0)}$ should be possible\\cite{Laenen:2008ux}. \nIn the soft sector, it is indeed possible to extend the soft exponentiation theorem beyond \nleading power\\cite{Laenen:2008gt,Laenen:2010uz}, but this proves insufficient\nto generate all NLP logarithms starting at two loops. The reason is the interference\nof collinear singularities with (next-to-) soft emissions, which prevents their complete \nfactorisation. This obstacle was first overcome by Del Duca\\cite{DelDuca:1990gz},\nand recently revisited and applied to electroweak annihilation cross sections\nin\\cite{Bonocore:2014wua,Bonocore:2015esa}. The result is a generalisation of \nthe leading-power factorisation in Eq. (\\ref{factorised}), which, in its simplest form, \nreads\n\n", "index": 7, "text": "\\begin{equation}\n  {\\cal A}^\\mu (p_j, k) \\, = \\, \\sum_{i = 1}^2 \\left(q_i \\, \\frac{(2 p_i - k)^\\mu}{2 p_i \n  \\cdot k - k^2} + q_i \\, G^{\\nu\\mu}_i \\frac{\\partial}{\\partial p_i^\\nu} + G^{\\nu\\mu}_i \n  J_\\nu (p_i, k) \\right) {\\cal A} (p_i; p_j) \\, ,\n\\label{NEfactor3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{\\cal A}^{\\mu}(p_{j},k)\\,=\\,\\sum_{i=1}^{2}\\left(q_{i}\\,\\frac{(2p_{i}-k)^{\\mu}}%&#10;{2p_{i}\\cdot k-k^{2}}+q_{i}\\,G^{\\nu\\mu}_{i}\\frac{\\partial}{\\partial p_{i}^{\\nu%&#10;}}+G^{\\nu\\mu}_{i}J_{\\nu}(p_{i},k)\\right){\\cal A}(p_{i};p_{j})\\,,\" display=\"block\"><mrow><mrow><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">𝒜</mi><mi>μ</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>j</mi></msub><mo>,</mo><mi>k</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\">=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mn>2</mn></munderover><mrow><mrow><mo>(</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>q</mi><mi>i</mi></msub></mpadded><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>p</mi><mi>i</mi></msub></mrow><mo>-</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>μ</mi></msup><mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>p</mi><mi>i</mi></msub></mrow><mo>⋅</mo><mi>k</mi></mrow><mo>-</mo><msup><mi>k</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>q</mi><mi>i</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>G</mi><mi>i</mi><mrow><mi>ν</mi><mo>⁢</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><msubsup><mi>p</mi><mi>i</mi><mi>ν</mi></msubsup></mrow></mfrac></mrow><mo>+</mo><mrow><msubsup><mi>G</mi><mi>i</mi><mrow><mi>ν</mi><mo>⁢</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msub><mi>J</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo>,</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒜</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo>;</mo><msub><mi>p</mi><mi>j</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02113.tex", "nexttext": "\nwhere $j_\\mu$ is the current for the production of the extra soft gluon.\nUsing Eq. (\\ref{NEfactor3}), it is possible to exactly reproduce all NLP\nlogarithms at two loops for vector boson production cross sections, in\nterms of universal soft and collinear factors. This strongly suggests that \na complete resummation formalism for NLP logarithms is at hand, which\nwould then lead to a number of phenomenological applications to \nprecision calculations of QCD cross sections of relevance for LHC \nand future colliders. Work is in progress to proceed in this direction.\n\n\n\\section{Acknowledgements}\nWork supported by the Research Executive Agency (REA) of the European Union \nunder the Grant Agreement PITN-GA-2012-316704 (HIGGSTOOLS); by MIUR (Italy), \nunder contract 2010YJ2NYW$\\_$006, and by the University of Torino and the \nCompagnia di San Paolo under contract ORTO11TPXK.\n\n\n\\begin{thebibliography}{99}\n\n\\bibitem{Forte:2015cia}\n  For a more detailed discussion see: S.~Forte {\\it et al.},\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 75} (2015) 11,  554, {\\tt arXiv:1505.01279 [hep-ph]}.\n\n\\bibitem{Butterworth:2015oua}\n  See, for example: J.~Butterworth {\\it et al.},\n  \n  {\\tt arXiv:1510.03865 [hep-ph]}.\n\n\\bibitem{Adams:2015hiv}\n  See, for example: D.~Adams {\\it et al.},\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 75} (2015) 9,  409,  {\\tt arXiv:1504.00679 [hep-ph]}.\n\n\\bibitem{Andersen:2014efa}\n  J.~R.~Andersen {\\it et al.},\n  \n  {\\tt arXiv:1405.1067 [hep-ph]}.\n \n\\bibitem{Arkani-Hamed:2015vfh}\n  N.~Arkani-Hamed, T.~Han, M.~Mangano and L.~T.~Wang,\n  \n  {\\tt arXiv:1511.06495 [hep-ph]}.\n    \n\\bibitem{Boronat:2014hva}\n  M.~Boronat, J.~Fuster, I.~Garcia, E.~Ros and M.~Vos,\n  \n  Phys.\\ Lett.\\ B {\\bf 750} (2015) 95, {\\tt arXiv:1404.4294 [hep-ex]}.\n  \n\\bibitem{Linssen:2012hp}\n  L.~Linssen, A.~Miyamoto, M.~Stanitzki and H.~Weerts,\n  \n  {\\tt arXiv:1202.5940 [physics.ins-det]}.\n\n\\bibitem{Cacciari:2015jwa}\n  M.~Cacciari,\n  \n  Int.\\ J.\\ Mod.\\ Phys.\\ A {\\bf 30} (2015) 31,  1546001, {\\tt arXiv:1509.02272 [hep-ph]}.\n\n\\bibitem{Moch:2014tta}\n  S.~Moch {\\it et al.},\n  \n  {\\tt arXiv:1405.4781 [hep-ph]}.\n  \n\\bibitem{d'Enterria:2015toz}\n  D.~d'Enterria {\\it et al.},\n  \n  {\\tt arXiv:1512.05194 [hep-ph]}.\n  \n\\bibitem{Beneke:2015kwa}\n  M.~Beneke, Y.~Kiyo, P.~Marquard, A.~Penin, J.~Piclum and M.~Steinhauser,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115} (2015) 19,  192001, {\\tt arXiv:1506.06864 [hep-ph]}.\n\n\\bibitem{Duhr:2014woa}\n  C.~Duhr,\n  \n  {\\tt arXiv:1411.7538 [hep-ph]}.\n    \n\\bibitem{Henn:2013pwa}\n  J.~M.~Henn,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110} (2013) 251601, {\\tt arXiv:1304.1806 [hep-th]}.\n\n\\bibitem{Henn:2014qga}\n  J.~M.~Henn,\n  \n  J.\\ Phys.\\ A {\\bf 48} (2015) 153001, {\\tt arXiv:1412.2296 [hep-ph]}.\n  \n\\bibitem{Currie:2012qxa}\n  J.~Currie,\n  \n  {\\tt http://inspirehep.net/record/1323546/files/thesis.pdf}.\n\n\\bibitem{Czakon:2014oma}\n  M.~Czakon and D.~Heymes,\n  \n  Nucl.\\ Phys.\\ B {\\bf 890} (2014) 152, {\\tt arXiv:1408.2500 [hep-ph]}.\n\n\\bibitem{Bonciani:2015sha}\n  R.~Bonciani, S.~Catani, M.~Grazzini, H.~Sargsyan and A.~Torre,\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 75} (2015) 12,  581, {\\tt arXiv:1508.03585 [hep-ph]}.\n    \n\\bibitem{DelDuca:2015zqa}\n  V.~Del Duca, C.~Duhr, G.~Somogyi, F.~Tramontano and Z.~Tr\\'ocs\\'anyi,\n  \n  JHEP {\\bf 1504} (2015) 036, {\\tt arXiv:1501.07226 [hep-ph]}.\n  \n\\bibitem{Boughezal:2015dra}\n  R.~Boughezal, F.~Caola, K.~Melnikov, F.~Petriello and M.~Schulze,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115} (2015) 8,  082003, {\\tt arXiv:1504.07922 [hep-ph]}.\n\n\\bibitem{Czakon:2013goa}\n  M.~Czakon, P.~Fiedler and A.~Mitov,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110} (2013) 252004, {\\tt arXiv:1303.6254 [hep-ph]}.\n  \n\\bibitem{Dixon:2008gr}\n  L.~J.~Dixon, L.~Magnea and G.~F.~Sterman,\n  \n  JHEP {\\bf 0808} (2008) 022, {\\tt arXiv:0805.3515 [hep-ph]}.\n  \n\\bibitem{Laenen:2008ux}\n  E.~Laenen, L.~Magnea and G.~Stavenga,\n  \n  Phys.\\ Lett.\\ B {\\bf 669} (2008) 173, {\\tt arXiv:0807.4412 [hep-ph]}.\n\n\\bibitem{Laenen:2008gt}\n  E.~Laenen, G.~Stavenga and C.~D.~White,\n  \n  JHEP {\\bf 0903} (2009) 054, {\\tt arXiv:0811.2067 [hep-ph]}.\n  \n\\bibitem{Laenen:2010uz}\n  E.~Laenen, L.~Magnea, G.~Stavenga and C.~D.~White,\n  \n  JHEP {\\bf 1101} (2011) 141, {\\tt arXiv:1010.1860 [hep-ph]}.  \n\n\\bibitem{DelDuca:1990gz}\n  V.~Del Duca,\n  \n  Nucl.\\ Phys.\\ B {\\bf 345} (1990) 369.\n\n\\bibitem{Bonocore:2014wua}\n  D.~Bonocore, E.~Laenen, L.~Magnea, L.~Vernazza and C.~D.~White,\n  \n  Phys.\\ Lett.\\ B {\\bf 742} (2015) 375, {\\tt arXiv:1410.6406 [hep-ph]}.\n\n\\bibitem{Bonocore:2015esa}\n  D.~Bonocore, E.~Laenen, L.~Magnea, S.~Melville, L.~Vernazza and C.~D.~White,\n  \n  JHEP {\\bf 1506} (2015) 008,  {\\tt arXiv:1503.05156 [hep-ph]}.\n\n  \n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 17247, "prevtext": "\nwhere ${\\cal A}^\\mu$ is an amplitude including the radiation of an extra soft gluon,\n$G_{\\mu \\nu}$ is a kinematic projection, and $J_\\mu$ is a `radiative jet' function \ndefined by\n\n", "index": 9, "text": "\\begin{equation}\n  J_\\mu \\left( p, n, k \\right) u(p) \\, = \\, \n  \\int d^d y \\,\\, {\\rm e}^{ - {\\rm i} (p - k) \\cdot y} \\, \\left\\langle 0 \\left| \\,\n   \\, \\Phi_{n} (y, \\infty) \\, \\psi (y) \\, j_\\mu (0) \\, \\right| p \\right\\rangle \\, ,\n\\label{Jmudef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"J_{\\mu}\\left(p,n,k\\right)u(p)\\,=\\,\\int d^{d}y\\,\\,{\\rm e}^{-{\\rm i}(p-k)\\cdot y%&#10;}\\,\\left\\langle 0\\left|\\,\\,\\Phi_{n}(y,\\infty)\\,\\psi(y)\\,j_{\\mu}(0)\\,\\right|p%&#10;\\right\\rangle\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>J</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mi>p</mi><mo>,</mo><mi>n</mi><mo>,</mo><mi>k</mi><mo>)</mo></mrow><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\">=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mi>d</mi></msup><mo>⁢</mo><mpadded width=\"+3.4pt\"><mi>y</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>p</mi><mo>-</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>y</mi></mrow></mrow></msup></mpadded><mo>⁢</mo><mrow><mo>⟨</mo><mn>0</mn><mo fence=\"true\" rspace=\"5.9pt\">|</mo><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>y</mi><mo>,</mo><mi mathvariant=\"normal\">∞</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>y</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>j</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow><mo fence=\"true\">|</mo><mi>p</mi><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]