[{"file": "1601.03880.tex", "nexttext": "\nwith matrix elements $H_{k,k'}$ defined by Eq.\\ref{Eq:hkk}.\n\nTo describe the confinement in vertical direction within two layers we use the\nfollowing approximation\n{\\color{red}\\cite{chwiej1,fischer}}:\n\n", "itemtype": "equation", "pos": 8078, "prevtext": "\n\\title{An electron motion induced by magnetic field pulse in bi-layer quantum wire}\n\\author{T. Chwiej}\n\\email{chwiej@fis.agh.edu.pl}\n\\affiliation{AGH University of Science and Technology, al. A. Mickiewicza 30, 30-059 Cracow,\nPoland}\n\\begin{abstract}\n\\noindent\nWe consider theoretically the possibility of an electron acceleration in quantum wire by short\nmagnetic pulses lasted bewteen several to few tens of picoseconds.\nWe show that such possibility exists provided that, the electron is initially localized in part of\nnanowire that consists of two vertically aligned layers which are tunnel coupled.\nWhen a horizontally directed magnetic field, changeable in time, is also perpendicular to\nthe main axis of a wire, it generates a rotational electric field in it which pushes the upper and\nthe lower parts of the electron wavepacket in opposite directions. We have found however, that for\nan asymmetric vertical confinement, the majority part of charge density starts to move in the\ndirection of local electric field in its layer but it also drags the minority part in the same\ndirection what results in coherent motion of an entire wavepacket. We discuss the dynamics of this\nmotion in dependence on the time characteristics of the magnetic pulse.\n\\end{abstract}\n\\keywords{quantum wire, ballistic transport, magnetic field}\n\\pacs{72.25.Dc,73.21.Hb}\n\\maketitle\n\n\n\\section{Introduction}\n\nThe tunnel coupling between two quantum wires has a great impact on the single electron transport\nproperties.\\cite{eugster,bierwagen,lyo1,mourokh,fischer} If magnetic field penetrates such quantum\nsystem  it can modify the magnitude of a tunnel coupling but the extent of such modifications\ndepends on the magnetic field strentgh and mutual arrangement of magnetic field and the wire axis.\n\\cite{lyo3,fischer4} If magnetic field is parallel to the wire axis, it squezees the wavefunctions\nof magnetosubbands within each layer what results in lower value of a tunnel factor.\n\\cite{thomas,fischer4} \nOn the other hand, if it is set perpendicularily to wire axis and to the layers coupled laterally\nor vertically, it can hybridize the magnetosubbands between layers. This modifies, to a\nlarge extent, the energy dispersion relation E(k) since the pseudo-gaps are opened and the\nnegative dispersion realation appear in energy spectrum.\\cite{shi,lyo1} As we have shown in our last\npaper, hybridization which leads to formation of pseudogaps can be utilized for tuning the magnitude\nof spin polarization of wire's conductance provided that the wire has low density of\ndefects.\\cite{chwiej2}\n\nIn present paper we study the dynamics of an electron motion in a bi-layer quantum wire made of\nInGaAs/GaAs and GaAs/AlGaAs heterostructure which motion is induced by the magnetic pulse only.\nMagnetic acceleration or deceleration of an electron in such nanostructure can be conducted provided\nthat: i) the wave functions originated from different layers are mutually hybridized, and, ii) the\ntime duration of magnetic pulse is between a few and tens of picoseconds.\nAt present, such short magnetic pulses can be generated by using the Auston's photoconductive\nswitches \\cite{auston, spin_dynamics} or by the off-resonant magnetization of ferromagnetic thin\nfilms with the terahertz laser pulses.\\cite{offresonant}\nDue to the Maxwell law i.e. $\\partial\\vec{B}/\\partial t=-\\nabla\\times\\vec{E}$, if the time\nvarying magnetic field is directed perpendicularily to a wire's axis as well as to\nthe vertically aligned transport layers, it generates the rotational electric field which try to\npush two parts of the electron wavepacket being localized in both layers in the opposite directions.\nThe action of temporary rotational electric field on the electron wavepacket confined in vertical\nbi-layer nanowire is schematically depicted in Fig.\\ref{Fig:model}. We have investigated this\nmechanism of acceleration of an electron in nanostructure of this kind and have found that the\nassymetry introduced to the vertical confinement enables an entire electron wavepacket to move in a\nparticular direction but its further dynamics, i.e. after the pulse is finished, depends mainly on\nthe time length of magnetic pulse and on that, whether the magnetic field finally vanishes or its\nvalue remains non-zero but is fixed for further times.\nIn the latter case, which is an analog of switching the magnetic field on, the\nelectron motion in constant magnetic field is governed by the magnetic force which for longer\ntimes breaks the coherence between the upper and lower layers' parts of an electron wavepacket.\n\nPaper is organized as follows. In Sec.\\ref{Sec:model} we present numerical model of solving the\ntime-dependent Schr\\\"odinger equation for an electron confined in bi-layer nanowire, results of\nsimulations are presented and discussed in Sec.\\ref{Sec:res}. We end up considerations with\nconclusions given in Sec.\\ref{Sec:con}.\n\n\\section{Theoretical model}\n\\label{Sec:model}\n\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=70mm\n       \\rotatebox{0}{{ \\epsfbox[0 652 473 842] {pics/model.eps}}}\n        \\hfill}\n\\caption{(Color online) The cross-section of a model bi-layer nanowire considered in paper.\nThe electron motion in x direction within harmonic oscillator potential (blue line) is stimulated\nby rotational electric field to be induced by the time varying magnetic field which is pointed\nalong y direction, and, provided that both, \nupper and lower layers are tunnel coupled.}\n\\label{Fig:model}\n\\end{figure}\n\nWe start our considerations with the single electron Hamiltonian \n$\\widehat{H}=(\\widehat{\\pmb{p}}+e\\pmb{A})^2/2m^{*}+V_{c}(\\pmb{r})$. Throuout the\npaper we will use\nthe\ntime-dependent vector potential in non-symmetric form $\\pmb{A}(t)=[z B(t),0,0]$ which gives\nthe magnetic field piercing the layers horizontally $\\pmb{B}=[0,B(t),0]$ and being perpendicular to\nthe direction of an electron motion. We assume an electron can move along the\nwire axis in x direction\nwithin the harmonic oscillator potential ($V_{1}(x)=m^{*}\\omega^2 x^2/2$) and\ncan tunnel between two\nvertical layers which establish a double-well potential in z direction\n($V_{2}(z)$). Its motion in y direction is frozen to the ground\nstate,  and is neglected in further discussion. Sketch of a model confinement potential is shown\nin Fig.\\ref{Fig:model}. Based on these assumptions, and additionally assuming\nthat the confinement potential in x and z directions is separable that is\n$V_{c}(x,z)=V_{1}(x)+V_{2}(z)$, we make the problem simpler diagonalizing the part of Hamiltonian\ndependent on z variable only $\\widehat{h}_{z}=-(\\hbar^{2}/2m^{*})\\partial/\\partial z^{2}+V_{2}(z)$.\nFrom the set of its all eigenstates $f_{k}(z)$ we chose only two lowest eigenmodes to form the\nfunctions basis $\\{f_{1},f_{2}\\}$. The rest lie much higher on energy scale and therefore their\ncontributions to final solution are neglected.\nNext, calculating the matrix elements of Hamiltonian in this basis\n$\\widehat{H}_{k,k'}=\\langle f_{k}|\\widehat{H}|f_{k'}\\rangle$ we get:\n\\begin{eqnarray}\n \\nonumber\n\\widehat{H}_{k,k'}&=&\\left(\\widehat{T}_{x}+V_{1}(x)+E_{k}^{(z)}\\right) \\delta_{k,k'}\\\\\n&+&\\hbar\\omega_{c}Z^{(1)}_{k,k'}\\widehat{k}_{x}+\\frac{m^{*}\\omega^{2}_{c}}{2}Z^{(2)}_{k,k'}\n\\label{Eq:hkk}\n\\end{eqnarray}\nwhere $\\widehat{T}_{x}$ is kinetic operator for x direction, $E_{k}^{(z)}$ is a k-th eigenenergy\nof Hamiltonian $\\widehat{h}_{z}$, $\\omega_{c}=eB/m^{*}$ is the cyclotron frequency,\nmatrix elements  $Z_{k,k'}^{(1)}$ and $Z_{k,k'}^{(2)}$ are defined as $Z_{k,k'}^{(m)}=\\langle\nf_{k}|z^{m}|f_{k'}\\rangle$ and $\\widehat{k}_{x}=\\widehat{p}_{x}/\\hbar=-i\\partial/\\partial x$.\nHamiltonian given in Eq.\\ref{Eq:hkk} depends on time through the second and\nthe third terms in above equation which include $\\omega_{c}$ because  magnetic\nfield change its value during an evolution of quantum system.\nThis form of energy operator allows us to define the wave function of an\nelectron as a two-component\nobject $| \\Psi(x,t)\\rangle=\\sum_{k=1}^{2}\\psi_{k}(x,t)|f_{k}\\rangle$ for\nwhich the\neffective time-dependent\nSchr\\\"odinger equation has the following form:\n\n", "index": 1, "text": "\\begin{equation}\n i\\hbar\\frac{\\partial}{\\partial t}\n \\left[\n\\begin{array}{c}\n \\psi_{1}(x,t)\\\\\n \\psi_{2}(x,t)\\\\\n\\end{array}\n \\right]=\n \\left[\n\\begin{array}{cc}\nH_{11}&H_{12}\\\\\nH_{21}&H_{22}\n\\end{array}\n\\right]\n\\left[\n\\begin{array}{c}\n \\psi_{1}(x,t)\\\\\n \\psi_{2}(x,t)\\\\\n\\end{array}\n\\right]\n\\label{Eq:sch}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"i\\hbar\\frac{\\partial}{\\partial t}\\left[\\begin{array}[]{c}\\psi_{1}(x,t)\\\\&#10;\\psi_{2}(x,t)\\\\&#10;\\end{array}\\right]=\\left[\\begin{array}[]{cc}H_{11}&amp;H_{12}\\\\&#10;H_{21}&amp;H_{22}\\end{array}\\right]\\left[\\begin{array}[]{c}\\psi_{1}(x,t)\\\\&#10;\\psi_{2}(x,t)\\\\&#10;\\end{array}\\right]\" display=\"block\"><mrow><mrow><mi>i</mi><mo>⁢</mo><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>[</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>]</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>[</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>H</mi><mn>11</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>H</mi><mn>12</mn></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>H</mi><mn>21</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>H</mi><mn>22</mn></msub></mtd></mtr></mtable><mo>]</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03880.tex", "nexttext": "\nwhich is symmetric for $\\alpha=0$ and the upper layers becomes deeper than the lower one for\n$\\alpha>0$. The latter case is studied in detail in next section.\nThe shape of $V_{2}(z)$ has a great impact on the dynamics of an electron in quantum wire.\nFor $\\alpha=0$, basis wave functions $f_{1}(z)$  and $f_{2}(z)$ have defined parities. Then, the\nthird term in Eq.\\ref{Eq:hkk} disappears and only the second term mixes both\ncomponents $\\psi_{1}(x)$ and $\\psi_{2}(x)$ of an electron's  wave function\nthrough the off-diagonal elements $H_{12}$ and $H_{21}$ in Eq.\\ref{Eq:sch} as the first term is\npure diagonal. On the other hand, when $\\alpha>0$, the third term in Eq.\\ref{Eq:hkk} also gives\ncontribution to off-diagonal elements in Eq.\\ref{Eq:sch} and to the diagonal\nones as well.\nMixing of these components is crucial for inducing the motion of an electron by\nthe magnetic field pulse.\nIf there is no mixing during the time evolution, the\nelectron \npermanently occupy the lowest state that is $\\psi_{1}(x,t)$ whereas\noccupation of  $\\psi_{2}(x,t)$ has to be zero\ndue to the condiction $E_{1}^{(z)}<E_{2}^{(z)}$, otherwise, mixing of these\nelements should change the dynamics  of an electron\nin the wire.\nAccording to the definitions of the off-diagonal elements given by the second\nand third terms in\nEq.\\ref{Eq:hkk}, the mixing takes place only when $B\\ne 0$ that is during the\nmagnetic pulse ($\\partial B/\\partial t \\ne 0$) or for\nconstant magnetic field but provided that an electron moves within the wire.\n\nEven though, the last two terms in Eq.\\ref{Eq:hkk} can mix\nthe wave functions $\\psi_{1}(x)$ and $\\psi_{2}(x)$, only the second\nterm may force an electron to change its position. The proof is straightforward.\nFirst, consider the ground state of electron for $B=0$, its wave function\nat $t=0$ is given then by $\\Psi(x,t)=[\\psi_{1}(x,0),\\psi_{2}(x,0)]=[g_{0}(x),0]$, with $g_{0}(x)$\nbeing\nthe normalized square integrable function. If we now skip in Hamiltonian in Eq.\\ref{Eq:sch} the term\n$\\hbar\\omega_{c}Z_{k,k'}^{(1)}\\widehat{k}_{x}$ and replace the time derivative with\nthe forward first-order finite difference formula, we obtain in first time step an approximated\nexpressions for: i) $\\psi_{1}(x,\\Delta t)=(1-i\\Delta t\nm^{*}\\omega_{c}^{2}E_{1}/\\hbar)\\psi_{1}(x,0)$, where\n$E_{1}$ is the total energy of electron at $t=0$ and the contribution from \n$\\psi_{2}$ vanishes\nsince $\\psi_{2}(x,0)=0$, and, ii) $\\psi_{2}(x,\\Delta t)=-(i\\Delta t\nm^{*}\\omega_{c}^{2}Z_{21}^{(2)}/2)\\psi_{1}(x,0)$. In\nother words, part of $g_{0}(x)$  is moved from $\\psi_{1}$ to $\\psi_{2}$ and vice versa for further\ntime steps but the shape of $|\\Psi(x,t)|^{2}$ is retained in any further time instant. Simply, this\nHamiltonian term is a diamagnetic energy shift which is responsible for optimizing the wave function\nshape in z direction that is for its stronger localization in magnetic field. \nThe dynamics of an electron during the time of simulation is governed\nby the term $\\hbar\\omega_{c}Z_{k,k'}^{(1)}\\widehat{k}_{x}$ which includes the derivative over x\nvariable. \n\n\nWe simulate the motion of an electron in bi-layer nanowire stimulated by the\nmagnetic field pulse by finding the solution of time-dependent Schr\\\"odinger equation\n[Eq.\\ref{Eq:sch}] in subsequent time instants by means of 4-th order Runge-Kutta method with time\nstep $\\Delta t=10^{-4}\\textrm{ ps}$.\nFor this purpose we have performed a set of numerical simulations on regular mesh of nodes  in x\ndirection. We limit the length of quantum wire to 800 nm and impose smooth confining potential in\nthis direction as\nfor the quantum oscillator $V_{1}(x)=m^{*}\\omega_{0}^{2}x^2/2$ with oscillator strength\n$\\hbar\\omega_{0}=0.5\\textrm{ meV}$. This spatial constriction allows us to\nstudy of an electron motion for quite long times after the magnetic pulse is\nfinished what is particularily important if an influence of magnetic force\n($B_{y}=const$ ) on the coupling strength between the upper and lower parts of electron's\nwavepacket is taken into account.\nThe basis functions $\\{f_{1}(z),f_{2}(z)\\}$ were also found numerically with\nfinite difference method after discretization of Hamiltonian $\\widehat{h}_{z}$ on spatial mesh with\n200 nodes for z direction. The number of nodes in x direction was set to 400.\nAll simulations were precedeed by diagonalization of Hamiltonian appearing in Eq.\\ref{Eq:sch} to\nprepare the starting wavepacket for $t=0$ i.e. to find $\\Psi(x,t=0)=[\\psi_{1}(x,0),\\psi_{2}(x,0)]$.\n\nValue of parameter b  which defines the extent of\nvertical confinement in Eq.\\ref{Eq:vz} was equal 30 nm. The height of tunnel barrier between the\nupper and lower layers depends on magnitude of $V_{max}$. We set its\nvalue equal to 150 meV for which the energy splitting between the bounding ($f_{1}$) and\nthe antibounding ($f_{2}$) basis states equals $E_{21}^{(z)}=E_{2}^{(z)}-E_{1}^{(z)}=2\\textrm{\nmeV}$ for symmetric confinement ($\\alpha=0$). When\n$\\alpha$ becomes non-zero then $\\Delta E_{21}^{(z)}$ grows what eventually lowers the extent of\nmixing $\\psi_{1}$ and $\\psi_{2}$ components of an electron's wave function. This can not be however\nomitted since for $\\alpha=0$, the\nwavepackets localized in symmetric layers move in opposite directions [see Fig.\\ref{Fig:model}] and\nan electron wavepacket motion as a whole, in an arbitrarily chosen direction, can be obtain only for\n$\\alpha>0$ what will be shown below.\nIn paper we consider two cases, in first the electron is accelerated by single magnetic pulse, while\nin second, its motion is induced when the magnetic field is switched on/off.\n\n\\section{Results}\n\\label{Sec:res}\n\n\\subsection{Acceleration of an electron by a single magnetic pulse}\n\\label{Sec:imp}\nWe start presentation of our results  for a case the electron is\naccelerated by a single magnetic pulse defined as: $B(t)=B_{m}sin(\\pi t/t_{imp})\\cdot \\Theta(t)\\cdot\n\\Theta(t_{imp}-t)$, where $\\Theta(t)$ is the Heaviside step function, the amplitude of magnetic\nfield equals $B_{m}=5\\textrm{T}$ and the time duration of a pulse is changed within the range\n$t_{imp}=5-50\\textrm{ ps}$.\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=80mm\n       \\rotatebox{0}{{ \\epsfbox[0 305 569 842] {pics/1el_rox.eps}}}\n        \\hfill}\n\\caption{(Color online) Expectation value of electron position (left column) and the density (right\ncolumn) localized in the upper (red color) and in the lower layer (black color) during the time\nof simulation for $\\alpha=0$ (first row) and $\\alpha=0.005$ (second and third rows).\nInset in figures (a) and (e) shows zooms of oscillations of $\\bar{x}$ and $\\langle\n\\rho\\rangle$ remained after the magnetic pulse is ended.\nThe inset in (d) shows $C_{2}=\\langle\\psi_{2}|\\psi_{2} \\rangle $ that is an occupation of second\neigenstate for vertical quantization. Calculations were performed for parameters: $m^{*}=0.04$\n(InGaAs) and $\\Delta E_{21}^{z}=9.83\\textrm{\nmeV}$ (a) and $\\Delta E_{21}^{z}=9.9\\textrm{meV}$ in (b) and (c).}\n\\label{Fig:rox}\n\\end{figure}\n\\begin{figure*}[htbp!]\n\\hbox{\n\t\\epsfxsize=140mm\n       \\rotatebox{0}{{ \\epsfbox[0 448 595 842] {pics/1el_x.eps}}}\n        \\hfill}\n\\caption{(Color online) Dependence of the normalized expectation value of electron position\n($\\bar{x}$) in bi-layer quantum wire  on time length of magnetic pulse and on the time of\nsimulation.\nThe inclined dashed lines mark the right border of magnetic field pulse. The upper row displays\nthe results obtained for InGaAs and effective mass $m_{InGaAs}^{*}=0.04$ while the lower one for\nGaAs and effective mass $m_{GaAs}^{*}=0.067$. Parameter $\\alpha$ which is shown on top of each\nsubfigure represents an actual asymmetry in vertical confinement.\n}\n\\label{Fig:x}\n\\end{figure*}\nFigure \\ref{Fig:rox}(a) shows the time variations of the electron positions in\nthe upper and in the lower layers obtained according to Eqs. (\\ref{Eq:xex}) and (\\ref{Eq:xex2})\n[see description below] for symmetric bi-layer nanowire ($\\alpha=0$). The magnetic pulse\nstarts at $t=0$ and ends at $t=20\\textrm{ ps}$.\nWithin this time interval, the parts of electron wavepacket localized in upper and in lower layers\noscillate in x direction  but with opposite phases i.e. the upper part starts to move to\nthe right while the second one, localized in the lower layer, to the left, and then, both\nchange the directions of their motions three times due to reflections within the regions of high\nconfining potential.\nAfter the magnetic field eventually vanishes, these oscillations are strongly dumped but do not\ndisappear entirely. The inset in Fig.\\ref{Fig:rox}(a) shows that even though for $t>t_{imp}$ the\namplitude of these oscillations become very small but oscillations remain stable for longer times.\nThe beating\npattern shown in this inset come into existence due to the overlap of two\nkinds of oscilltions, one with period equal to $T_{1}=8.3\\textrm{ ps}$ and\nsecond with period $T_{2}=0.44\\textrm{ ps}$. To determine their origin we first calculated the\nexpectation value of electron position in upper layer according to formula $\\langle x\n\\rangle_{z>0}=\\langle \\Psi|x\\cdot \\Theta(z)|\\Psi\\rangle$. Exactly at the moment the magnetic pulse\nends ($B=0$), the electron wave function can\nbe expressed as $\\Psi(x,y,z,t=t_{imp})=\\sum_{k}\\psi_{k}(x,t_{imp})f_{k}(z)g_{0}(y)$. The part of\nwave\nfunction which is dependent on x variable was expanded within the base constituted by Hermite\npolynomials i.e. the quantum oscillator eigenstates $\\Phi_{\\mu}$:\n\\begin{eqnarray}\n\\nonumber\n\\Psi(x,y,z,t)&=&\\sum_{k}\\sum_{\\mu}d_{k,\\mu}\\Phi_{\\mu}(x)\\\\\n&&\\cdot f_{k}(z)g_{0}(y)e^{-i(E_{\\mu}^{x}+E_{k}^{z}+E_{0}^{y})t/ \\hbar}\n\\end{eqnarray}\nIn above equation, $d_{k,\\mu}$ are the linear combination coefficients,\n$\\Phi_{\\mu}(x)=C_{\\mu}H_{\\mu}(x)e^{-x^2}$ are the normalized Hermite polynomials\nwhile three arguments appearing in phase factor are the eigenenergies for quantized motion of\nelectron in x ($E_{\\mu}^{x}$), y ($E_{0}^{y}$) and z ($E_{k}^{z}$) directions.\nAccording to this definition, the position of electron in an upper layer (dependence\non $g_{0}(y)$ and $E_{0}^{y}$ disappear after integration over y variable) reads:\n\\begin{eqnarray}\n \\nonumber\n\\langle x \\rangle_{z>0}=\n\\sum_{k,m}\\sum_{\\mu,\\nu}&&\nd_{k,\\mu}^{*}d_{m,\\nu}\n\\langle \\Phi_{\\mu}|x|\\Phi_{\\nu}\\rangle\n\\langle f_{k}|\\Theta(z)|f_{m}\\rangle\\\\\n&&\\times e^{i\\Delta E_{\\mu,\\nu}^{x}t/\\hbar}\ne^{i\\Delta E_{k,m}^{z}t/\\hbar}\n\\label{Eq:xex}\n\\end{eqnarray}\nSince the amounts of probability density gathered in both layers may differ from unity we\nnormalized the expectation value of electron position in upper (or lower) layer:\n\n", "itemtype": "equation", "pos": 8596, "prevtext": "\nwith matrix elements $H_{k,k'}$ defined by Eq.\\ref{Eq:hkk}.\n\nTo describe the confinement in vertical direction within two layers we use the\nfollowing approximation\n{\\color{red}\\cite{chwiej1,fischer}}:\n\n", "index": 3, "text": "\\begin{equation}\nV_{2}(z)=V_{max}\\left\\{ sin\\left[(1+z/b)\\pi/2 \\right]+\\alpha sin\\left[ \\pi(1+z/b) \\right]\\right\\}\n\\label{Eq:vz}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"V_{2}(z)=V_{max}\\left\\{sin\\left[(1+z/b)\\pi/2\\right]+\\alpha sin\\left[\\pi(1+z/b)%&#10;\\right]\\right\\}\" display=\"block\"><mrow><mrow><msub><mi>V</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>⁢</mo><mrow><mo>{</mo><mrow><mrow><mi>s</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>z</mi><mo>/</mo><mi>b</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>π</mi></mrow><mo>/</mo><mn>2</mn></mrow><mo>]</mo></mrow></mrow><mo>+</mo><mrow><mi>α</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>z</mi><mo>/</mo><mi>b</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>}</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03880.tex", "nexttext": "\nThe matrix elements $\\langle \\Phi_{\\mu}|x|\\Phi_{\\nu}\\rangle$ have non-zero values only if\n$\\mu=\\nu\\pm\n1$ that is for $\\Delta E_{\\mu,\\nu}=\\pm \\hbar\\omega_{0}$ and the coupling of these non-diagonal terms\nare responsible for the appearance of oscillations with longer period $T_{1}=h/\\Delta E_{\\mu,\\mu\\pm\n1}=8.3\\textrm{ ps}$, provided that,  $\\Delta E_{km}^{z}$ vanishes for $k=m$ in Eq.\\ref{Eq:xex}.\nOtherwise, when conditions $k\\ne m$ and $\\mu=\\nu\\pm 1$ are fulfilled then the total phase factor\noscillates with period dependent on the sum of both energy differences i.e.\n$\\Delta E=\\Delta E_{21}^{z}+\\hbar\\omega_{0}=10.33\\textrm{ meV}$ what gives the period equal to\n$T_{2}=0.44\\textrm{ ps}$. However this value is very close to value $T_{2}^{'}=h/\\Delta\nE_{21}^{1}=0.42\\textrm{ ps}$ what means that the coupling between vertical layers [due to the terms\n$\\langle f_{k}|\\Theta(\\pm z)|f_{m}\\rangle$] is the main\nsource of high frequency oscillations visible in the inset in Fig.\\ref{Fig:rox}(a).\nEquation \\ref{Eq:xex} can be further employed for calculation of $\\langle\\rho\\rangle_{z>0}$ if \nthe terms $\\langle\\Phi_{\\mu}|x|\\Phi_{\\nu}\\rangle$ will be substituted by\n$\\langle\\Phi_{\\mu}|\\Phi_{\\nu}\\rangle=\\delta_{\\mu,\\nu}$. This substitution eliminates dependence of\ntotal phase on $\\Delta E_{\\mu,\\nu}^{x}=0$ but leaves it still dependent on $\\Delta E_{k,m}^{z}$\nvalue. However in Fig.\\ref{Fig:rox}(d) there are no oscillations at any time instant.\nFor $\\alpha=0$, the amounts of electron denisty confined in both layers are equal, simply due\nto the symmetry constriction imposed on the confining potential [see Fig.\\ref{Fig:rox}(d)].\n\nWhen $\\alpha>0$ and the confinement energy in lower layer becomes higher than the one in an upper\nlayer, then for $t=0$ the larger part of electron density is gathered in upper layer [see\nFigs.\\ref{Fig:rox}(e) and (f)]. Therefore, when magnetic field starts to grow, the majority of\nwavepacket move to right but this time the rest of wavepacket is also pulled into this direction. In\nFigs. \\ref{Fig:rox}(b) and \\ref{Fig:rox}(c) we see that both densities move synchronously and \nindependently on the time duration of magnetic pulse.  Due to an asymmetry that has been introduced\ninto the confining potential in vertical direction, the amounts of electron densities in both layers\nare smoothly changed when $\\partial B/\\partial t\\ne 0$ and for $t>t_{imp}$ become fixed [Figs.\n\\ref{Fig:rox}(e) and \\ref{Fig:rox}(f)] besides the small oscillations for frequency\n$\\omega_{2}^{'}=2\\pi/T_{2}^{'}$ visible in the inset in Fig.\\ref{Fig:rox}(e).\nThe length of magnetic pulse has great impact on the amplitude of the electron oscillation within\nquantum wire. For $t_{imp}=20\\textrm{ ps}$ the amplitude of expectation value of electron position\nin wire reaches even $\\bar{x}_{max}=100\\textrm{ nm}$ while for two times longer pulse the\namplitude of electron oscillations falls to value $\\bar{x}_{max}=2.3\\textrm{ nm}$. Despite the\ndifferent lengthes of these magnetic pulses, the period of oscillations  in both cases is the same\nand equals $T_{1}=8.3\\textrm{ ps}$ that is the dynamics of wavepacket is governed by the energy\nlevels structure of quantum harmonic oscillator established in x direction.\n\\newline\nAnalysis of the results showed in Fig.\\ref{Fig:rox}(a-c) allows us to make a statement that the\ncharacteristics of the electron motion induced by magnetic pulse in quantum bi-layer wire is\ndependent on at least two factors: i) the time length of a magnetic pulse, and, ii) the degree of\nasymmetry in vertical confinement provided that the amplitude of magnetic field is fixed.\nIn order to study the influence of these factors on dynamics of electron motion in the wire we\ncomputed the expectation value of the electron position as function of $t_{imp}$ length and on the\ntime of simulation. Results for effective mass $m^{*}=0.04$ (InGaAs) are presented in first row in\nFig.\\ref{Fig:x} for $\\alpha=0.005,\\ 0.01,\\ 0.02$. These $\\alpha's$ values give the energy\nsplittings between two lowest eigenstates in vertical direction equal to $\\Delta\nE_{21}^{z}=9.9\\textrm{ meV},\\ 10.1\\textrm{ meV} \\textrm{ and } 10.9\\textrm{ meV}$.\nFor comparison, second row in this figure displays the results for $m^{*}=0.067$ (GaAs) and for\nthe energy splittings $\\Delta E_{21}^{z}=2.3\\textrm{ meV }, 3.1\\textrm{ meV}\\textrm{ and }\n5.1\\textrm{ meV}$. \nIf an electron effective mass is small [first row in Fig.\\ref{Fig:x}] then the increase of a\nconfining potential assymetry brings two main effects. First, the amplitude of $\\bar{x}$ grows\n[compare the ranges of  color scales in Figs.\\ref{Fig:x}(a-c)] if value of $\\alpha$ is increased.\nFor example, for $\\alpha=0.005$ the amplitude of electron oscillations in x direction reaches\n$\\bar{x}_{max}=130\\textrm{ ps}$ while for $\\alpha=0.02$ it becomes two times larger.\nSecond, the time length of magnetic pulse which allows to obtain significant amplitudes\nsystematically decreases for larger $\\alpha's$ values. For $\\alpha=0.005$ the electron motion in\nquantum wire can not be induced by pulses longer than $42.1\\textrm{ ps}$ while for $\\alpha=0.02$ it\nis limited only to $17.6\\textrm{ ps}$. For longer pulses, oscillations are still possible but\nthey might have much smaller amplitudes.\n\nFor larger effective mass [second row in Fig.\\ref{Fig:x}] the upper limit for the time length of\nmagnetic pulse which still may induce large oscillations of electron position in bi-layer nanowire\nis lowered to several picoseconds but its sensitivity to potential asymmetry is not so high as\nin the previous case.\nNow, its value decreases from $14.8\\textrm{ps}$ to $12.7\\textrm{ ps}$ when the\nvalue of $\\alpha$ increases from $0.005$ to $0.02$.\nOn the other hand, the largest amplitude of electron oscillations  becomes less dependent on\npotential asymmetry for heavier particle, the change of $\\alpha's$ value\nfrom $0.005$ to $0.02$ increases the amplitude of $\\bar{x}$ from 210 nm to 250 nm that is in\na three times thinner range than for the smaller effective mass.\n\n\n\\subsection{Electron motion induced by switching  the magnetic field on/off}\n\\label{Sec:imp2}\n\nIn this section we present the results obtained for a pulse generated by switching the magnetic\nfield on/off which is modelled in our simulations by following formula:\n\\begin{eqnarray}\n\\nonumber\nB(t)&=&B_{m}sin(2\\pi t/t_{imp}+\\beta\\pi/2)\\cdot \\Theta(t)\\cdot \\Theta(t_{imp}-t)\\\\\n&+&\\gamma\\cdot B_{m}\\cdot \\Theta(t-t_{imp})\n\\label{Eq:imp2}\n\\end{eqnarray}\nwhere: $\\beta=0$ and $\\gamma=1$ stand for the magnetic field growing in time [$\\partial B/\\partial\nt>0$ for $t\\le t_{imp}$] from 0 to $B_{m}$ while $\\beta=1$ and $\\gamma=0$ for vanishing field\n[$\\partial B/\\partial t<0$ for $t\\le t_{imp}$] from $B_{m}$ to 0.\n\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=85mm\n       \\rotatebox{0}{{ \\epsfbox[0 449 595 842] {pics/turnon.eps}}}\n        \\hfill}\n\\caption{(Color online) Normalized expectation value of an electron position ($\\bar{x}$) in an upper\nlayer depending on the time interval the magnetic field is switched on [$\\partial B/\\partial t>0$\nfor $t<t_{imp}$] and the time of simulation. Other parameters are given on the top of each\nfigure.}\n\\label{Fig:on}\n\\end{figure}\n\n\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=80mm\n       \\rotatebox{0}{{ \\epsfbox[0 523 203 842] {pics/dud3.eps}}}\n        \\hfill}\n\\caption{(Color online) The time variations of the expectation value of electron position (a) and\nof the elctron density in the upper and in the lower layers (b) for $t_{imp}=5\\textrm{\nps}$ and for magnetic field being switched on. Black and red colours in (a) and (b) mark the results\nfor the upper and lower layers, respectively. $\\Delta \\rho_{c}$ shows the density flow direction\ncaused by the stronger localization in the upper layer, $\\Delta \\rho_{L}$ indicate the density flow\ndue to magnetic force while $\\Delta \\rho$ marks the density flow caused by its unbalanced\naccumulation in layers.}\n\\label{Fig:dud}\n\\end{figure}\n\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=70mm\n       \\rotatebox{0}{{ \\epsfbox[0 645 175 842] {pics/dud4.eps}}}\n        \\hfill}\n\\caption{(Color online) The time changes of expectation values of electron positions (a,c) and of\nthe denisties (b,d) in the upper and in the lower layers for $t_{imp}=5\\textrm{ ps}$ when magnetic\nfield is turned on. Black and red colors mark the results for an upper and for a lower  layer,\nrespectively. Values of $\\alpha$ and of the effective masses are given on top of first and second\nrow.}\n\\label{Fig:dud4}\n\\end{figure}\n\nResults for the first case, when magnetic field is turned on, are presented in  Fig.\\ref{Fig:on}.\nFor InGaAs bi-layer wire, the dynamics of an electron changes qualitatively and quantitatively much\nas the imbalance in the confining potential in the upper and in the lower layers raises [cf.\nFigs. \\ref{Fig:on}(a-c)]. For $\\alpha=0.005$ and $\\alpha=0.01$ the pattern of $\\bar{x}$ is very\nirregular for short pulses ($t<10\\textrm{ps}$) and becomes regular that is with distinct single\nperiod of oscillations for longer pulses. However, it does not concern the case with $\\alpha=0.02$\n[Fig.\\ref{Fig:on}(c)] for which we may single out one main period being the same for all values of\n$t_{imp}$. To explain the reasons of this irregularity we will analyze the changes in $\\bar{x}$ and\nin $\\langle \\rho \\rangle$ in both layers for $t_{imp}=5\\textrm{ ps}$, $\\alpha=0.005$ and\n$m^{*}=0.04$. Results are shown in Figs.\\ref{Fig:dud}(a) and(b).\n\nIn Fig.\\ref{Fig:dud}(a) we see that the time characterictics of $\\bar{x}$ for both parts of \nwavepacket is similar for $t<24.2\\textrm{ps}$ but thereafter their motions become decoupled even\nthough the denisty may still flow between the layers [Fig.\\ref{Fig:dud}(b)]. At $t=0$ the electron\nis at rest in the center of nanowire [Fig.\\ref{Fig:dud}(c)] and when the magnetic field starts\nraising the rotational electric field is generated  with opposite directions in upper and lower\nlayers. The upper layer confines a majority of electron\ndensity which begins to move to the right according to the electric field. Simultaneously, it pulls \nthe minority of density in this direction but against the x-component of\nelectric field in a lower layer. Even though the motion to the right implies the\nmagnetic force is directed downwards to the lower layer, in fact, density flows upwards since\nthe raising magnetic field enhances localization of density in deeper, the upper well, for\n$t<5\\textrm{ ps}$. Then the strength of magnetic field is fixed ($B=const$) and for time instant\n$t=6.1\\textrm{ ps}$ the wavepacket is stopped and after that turned back due to its reflection of\nthe high confinig potential on the right side [Fig.\\ref{Fig:dud}(d)]. In the next stage the\nelectron moves to the left, first being accelerated ($6.1\\textrm{ ps}<t<9.5\\textrm{ ps}$) and next\nwhen it passes the center of nanowire ($x=0$) being decelerated ($9.5\\textrm{ ps}<t<12.2\\textrm{\nps}$). Since the magnetic field is still applied to the system, the direction of magetic force is\nnow reversed [see Figs. \\ref{Fig:dud}(d) and \\ref{Fig:dud}(e)] what forces an additional part of\nelectron density to flow from lower to upper layer what we notice in Fig.\\ref{Fig:dud}(b). At time\ninstant $t=12.2\\textrm{ ps}$ the decelerated motion of electron is stopped on the left side of the\nnanowire and next the directions of electron wavepacket motion and of magnetic force are again\nreversed. For the right directed motion, the Lorenz force now easily shifts  the part of density\nfrom the upper to lower layer. Thus, the existence of magnetic force is crucial for the dynamics of\nthe electron motion in bi-layer nanosystem because when the electron oscillates between the left and\nright turning points, the density may flow bewteen layers but with vertical velocities what\neventually hinders the upper and lower parts of an electron wavepacket. For that reason \nthe electron motion is constantly slowing down on average and both parts of\nwavepacket, the upper and the lower ones, start to oscillate along x axis in asynchronous manner for\n$t>24.2\\textrm{ ps}$ [Fig.\\ref{Fig:dud}(a)].\n\nIf the vertical confinement becomes more asymmetric ($\\alpha=0.02$) or the effective mass is getting\nlarger ($m^{*}=0.067$) then an asynchronous motions of the upper and lower electron densities\nalso appear [see Figs. \\ref{Fig:dud4}(a) and \\ref{Fig:dud4}(c)]. In this case however, the\ndisproportion between the amounts of densities gathered in layers is significantly larger e.g.\n$\\langle\\rho\\rangle_{up}=0.7$ and $\\langle\\rho\\rangle_{lo}=0.3$ for $t=0$ for $m^{*}=0.04$ and\n$\\alpha=0.02$ [Fig.\\ref{Fig:dud4}(b)] and increases in time, what eventually has less impact on\nphase perturbation in $\\bar{x}$ oscillations in upper layer. The inset in Fig.\\ref{Fig:dud4}(a)\nshows that, the density flow  between layers for first few oscillations of $\\bar{x}$ \nlowers only the amplitude of oscillations but motions of the upper and lower densities remain\nsynchronous. But when the amplitude gets smaller for $t>100\\textrm{ ps}$, electron\nslows down what in consequence lowers the magnitude of magnetic force and for certain time period\ndumps the density flow between layers [compare the amplitudes of $\\langle \\rho\\rangle$ at left and\nright sides in Fig.\\ref{Fig:dud4}(b)]. After that, the coupling between upper and lower \ndenisties raises, both densities oscillate coherently what eventualy\nmakes the amplitude  of $\\bar{x}$ to grow. This periodic coupling and decoupling of both densities\nlead eventually to formation of beating pattern in $\\bar{x}(t)$ function if an electron is allowed\nto oscillate in nanowire for longer times [Fig.\\ref{Fig:dud4}(a)].\nSimilar beating pattern for  $\\bar{x}$ oscillations we also notice in\nFig.\\ref{Fig:dud4}(c) for larger effective mass of an electron i.e. for $m^{*}=0.067$.\nIn this case, only a small assymetry in a confining potential ($\\alpha=0.005$) is\nrequired to localize about $70\\%$ of total electron density in upper layer.\nUnlike the previous case, now the motions of both parts of electron wavepacket are decoupled for any\ntime instant because as we see in Fig.\\ref{Fig:dud4}(c), the oscillations of density in lower layer\nexhibit, to some extent, a chaotic behaviour. Besides the fact, the density may still flow between\nlayers [see Fig.\\ref{Fig:dud4}(d)], this chaotic motion of density in lower layer does not\nperturb the frequency of $\\bar{x}$ oscillations in upper layer but it influences their amplitude. \n\n\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=80mm\n       \\rotatebox{0}{{ \\epsfbox[0 115 571 842] {pics/turnof.eps}}}\n        \\hfill}\n\\caption{(Color online) (a,d) Dependence of $\\bar{x}$ on the time length of magnetic pulse\nand on the time of simulation for a case the magnetic field is switched off [$\\partial B/\\partial\nt<0$ for $t<t_{imp}$ and $B=0$ for $t>t_{imp}$]. (b,e) The time changes of densities gathered in\nupper layer (black color) and in lower layer (red color). (c,f) The normalized expectation value of\nelectron position in upper (black color) and in lower (red color) layers - they are the same. The\nresults showed in first and in second column were obtained for $\\alpha=0.005$ and $\\alpha=0.02$,\nrespectively.}\n\\label{Fig:off}\n\\end{figure}\n\n\nIn the last part of this section we  present the results of simulations performed for the pulse\nbeing formed when the magnetic field is switch off [$\\beta=1$ and $\\gamma=0$ in Eq.\\ref{Eq:imp2}].\nPresent case is different from that considered in Sec.\\ref{Sec:imp} since now, the electron\nwavepacket is prepared at $t=0$ for $B>0$ what means the densities confined in layers are\nmagnetically coupled at the beginning of simulation and their spatial localizations in vertical\ndirection are lowered when magnetic filed vanishes in time.\nResults for $m^{*}=0.04$ are presented in Fig.\\ref{Fig:off}.\nUnlike the preceding case with magnetic field growing in time and being fixed afterwards, here we\nhave $B=0$ for $t>t_{imp}$ what implies the lack of an electron density flow between layers then.\nSince the magnetic force is absent for $t>t_{imp}$, densities in both layers oscillate\ncoherently along the wire axis and the pattern of $\\bar{x}$ does not change in time of\nsimulation i.e. the period of oscillations is fixed [cf. Figs. \\ref{Fig:off}(a) and\n\\ref{Fig:off}(c)].\nThe degree of asymmetry in vertical confinement has large impact on sensitivity of the system on\na time length of magnetic pulse. For slightly asymmetric confinement ( $\\alpha=0.005$) the amplitude\nof $\\bar{x}$ in upper layer is slowly diminishing as $t_{imp}$ grows. For larger asymmetry\n($\\alpha=0.02$), the amplitude of $\\bar{x}$ gets smaller rapidly for $t_{imp}>12\\textrm{ ps}$. This\nqualitative difference in amplitude of oscillations of an electron position obviously\nstems from the different dynamics of the electron density in layers for\n$t<t_{imp}$ that is when the layers are magnetically  coupled through the\nnon-vanishing off-diagonal elements in Hamiltonian \\ref{Eq:sch}. \nWe will analyze this difference for $t_{imp}=12\\textrm{ ps}$ for which the time variations of\n$\\langle \\rho\\rangle$ and $\\bar{x}$ are shown in Figs. \\ref{Fig:off}(b,e) and \\ref{Fig:off}(c,f),\nrespectively.\nIn Fig.\\ref{Fig:off}(b) we notice that for $\\alpha=0.005$  about $80\\%$ of electron density is\nlocalized in upper layer at $t=0$. When the magnetic field is getting smaller, the electric\nfield generated in bi-layer wire pushes an upper, majority part of density to the left what drags\nthe lower one in this direction too. Both densities start to move coherently [see\nFig.\\ref{Fig:off}(c)]. However, since the magnetic field becomes\nweaker, the density is no longer strongly sqeezed in upper layer and it starts to flow to lower\nlayer what is additionally enhanced by the magnetic force which is directed downwards. At\n$t=7.4\\textrm{ ps}$, when the upper and lower densities are turned back, as large as $20\\%$ of\ntotal density has been transferred to the lower layer. After reversing the direction of \nvelocity of an electron, the lower part of\nwavepacket is now accelerated by electric field while the upper part is decelerated by it. For\nthis reason, the density still flows from an upper layer to  a lower one until it is almost equally\ndistributed [$\\langle\\rho\\rangle_{u}=0.51$ and $\\langle\\rho\\rangle_{l}=0.49$] for $t=9.5\\textrm{\nps}$ [see Fig.\\ref{Fig:off}(b)] what takes place just before the electron will pass the center of a\nwire [cf. Figs. \\ref{Fig:off}(b) and \\ref{Fig:off}(c) for $t=0$].\nIn next two picoseconds, the direction of density flow is reversed, and when the magnetic field is\nfinally turned off about $56\\%$ of total density is localized in upper layer and $44\\%$ in lower\none. \n\nIf distortion in vertical confinement is larger ($\\alpha=0.02$), even $90\\%$ of total density is\ngathered in upper layer at $t=0$ and it drops to about $78\\%$ immediately it reaches the left\nturning point what one may notice in Fig.\\ref{Fig:off}(e).\nWhen the velocity of  wavepacket is reversed, the majority part of denisty is strongly decelerated\nby an electric field what significantly diminishes the amplitude of oscillations of an electron\nposition along the wire's axis [Fig.\\ref{Fig:off}(f)].\nTherefore, we may conclude that for longer time intervals needed for switching the magnetic field\noff, the dynamics of the majority part of electron density for $\\alpha=0.02$ cannot adapt to the\ntime scale of the magnetic pulse what in consequence prevents the electron from gaining the large\nvalues of $\\bar{x}$ [see Fig.\\ref{Fig:off}(d) for $t_{imp}>12\\textrm{ ps}$].\n\n\\section{Conclusions}\n\\label{Sec:con}\n\nThe dynamics of an electron motion induced in quantum wire by a magnetic pulse was theoretically\nstudied by means of computer simulations. We have shown that such motion can be realized in a\nsemiconductor nanostructure which consist of two vertically stacked layers. If these layers are\ntunnel coupled then the wave functions associated with two lowest bounding and antibounding\neigenstates for direction being perpendicular to both, the wire's axis and layers, can be easily\nhybridized in magnetic field.\nIn such case, the rotational electric field generated due to the Maxwell law by\na non-zero time derivative of $\\vec{B}$ may accelerate the charge density localized in the upper\nand lower parts of bi-layer nanowire. For symmetric confinement in vertical direction, the upper and\nlower charge densities are forced to move always in opposite directions according to the local\ndirections of the electric field. However, it was proven that the electron wavepacket, as a whole,\ncan be accelerated in arbitrarily chosen direction if the confinement in\nupper and in lower layers becomes asymmetric. Then, the majority part of charge density localized in\none layer is pushed by the electric field and it simultaneously drags the minor part in the same\ndirection against the electric field generated in second layer. The dynamics of\nan electron wavepacket becomes thus dependent on effective mass of an electron, degree of\nasymmetry in the confining potential as well as on the\ntime characteristics of the magnetic pulse. It was found that generally only the\nshort time magnetic pulses with time duration of about several to maximally a few tens of\npicoseconds may significantly change the motion energy of an electron. Moreover, the coherent\nmotion of both the upper and lower parts of wavepacket in the same direction can be\nrealized only if the magnetic coupling between layers vanishes when the magnetic pulse is ended.\nThis takes place when a single magnetic pulse is applied to the system or\na magnetic field is switched off. In the opposite case, the magnetic force\nconstantly changes the amounts of densities confined within layers what destroys their coherent\nmotion in a nanowire.\n\nWe think that discussed here the effect of temporary change of electron's motion energy by\npicoseconds\nmagnetic pulses can successfully be applied to the nanostructures consisting of two\ntunnel coupled wires allowing e.g. to sample the dynamical properties of many-body\ninteractions\\cite{manybody} including the Wigner crystals.\\cite{wigner}\nMoreover, this effect can be also utilized in the nanostructures holding a two-dimensional electron\ngas within the single, wide quantum well established in growth direction\\cite{fischer4},\nallowing for studies of the dynamical properties of electron transport in QPC\\cite{qpc_tip,qpc2} or\ntemporary changes in the local potential landscape in conjunction with external biased\ngates.\\cite{qpc_tip}\n\n\n\n\\section*{Acknowledgements}\nThe work was financed by Polish Ministry of Science and Higher Education (MNiSW)\n\\section*{References}\n\\bibliography{lit3}\n\n", "itemtype": "equation", "pos": 19270, "prevtext": "\nwhich is symmetric for $\\alpha=0$ and the upper layers becomes deeper than the lower one for\n$\\alpha>0$. The latter case is studied in detail in next section.\nThe shape of $V_{2}(z)$ has a great impact on the dynamics of an electron in quantum wire.\nFor $\\alpha=0$, basis wave functions $f_{1}(z)$  and $f_{2}(z)$ have defined parities. Then, the\nthird term in Eq.\\ref{Eq:hkk} disappears and only the second term mixes both\ncomponents $\\psi_{1}(x)$ and $\\psi_{2}(x)$ of an electron's  wave function\nthrough the off-diagonal elements $H_{12}$ and $H_{21}$ in Eq.\\ref{Eq:sch} as the first term is\npure diagonal. On the other hand, when $\\alpha>0$, the third term in Eq.\\ref{Eq:hkk} also gives\ncontribution to off-diagonal elements in Eq.\\ref{Eq:sch} and to the diagonal\nones as well.\nMixing of these components is crucial for inducing the motion of an electron by\nthe magnetic field pulse.\nIf there is no mixing during the time evolution, the\nelectron \npermanently occupy the lowest state that is $\\psi_{1}(x,t)$ whereas\noccupation of  $\\psi_{2}(x,t)$ has to be zero\ndue to the condiction $E_{1}^{(z)}<E_{2}^{(z)}$, otherwise, mixing of these\nelements should change the dynamics  of an electron\nin the wire.\nAccording to the definitions of the off-diagonal elements given by the second\nand third terms in\nEq.\\ref{Eq:hkk}, the mixing takes place only when $B\\ne 0$ that is during the\nmagnetic pulse ($\\partial B/\\partial t \\ne 0$) or for\nconstant magnetic field but provided that an electron moves within the wire.\n\nEven though, the last two terms in Eq.\\ref{Eq:hkk} can mix\nthe wave functions $\\psi_{1}(x)$ and $\\psi_{2}(x)$, only the second\nterm may force an electron to change its position. The proof is straightforward.\nFirst, consider the ground state of electron for $B=0$, its wave function\nat $t=0$ is given then by $\\Psi(x,t)=[\\psi_{1}(x,0),\\psi_{2}(x,0)]=[g_{0}(x),0]$, with $g_{0}(x)$\nbeing\nthe normalized square integrable function. If we now skip in Hamiltonian in Eq.\\ref{Eq:sch} the term\n$\\hbar\\omega_{c}Z_{k,k'}^{(1)}\\widehat{k}_{x}$ and replace the time derivative with\nthe forward first-order finite difference formula, we obtain in first time step an approximated\nexpressions for: i) $\\psi_{1}(x,\\Delta t)=(1-i\\Delta t\nm^{*}\\omega_{c}^{2}E_{1}/\\hbar)\\psi_{1}(x,0)$, where\n$E_{1}$ is the total energy of electron at $t=0$ and the contribution from \n$\\psi_{2}$ vanishes\nsince $\\psi_{2}(x,0)=0$, and, ii) $\\psi_{2}(x,\\Delta t)=-(i\\Delta t\nm^{*}\\omega_{c}^{2}Z_{21}^{(2)}/2)\\psi_{1}(x,0)$. In\nother words, part of $g_{0}(x)$  is moved from $\\psi_{1}$ to $\\psi_{2}$ and vice versa for further\ntime steps but the shape of $|\\Psi(x,t)|^{2}$ is retained in any further time instant. Simply, this\nHamiltonian term is a diamagnetic energy shift which is responsible for optimizing the wave function\nshape in z direction that is for its stronger localization in magnetic field. \nThe dynamics of an electron during the time of simulation is governed\nby the term $\\hbar\\omega_{c}Z_{k,k'}^{(1)}\\widehat{k}_{x}$ which includes the derivative over x\nvariable. \n\n\nWe simulate the motion of an electron in bi-layer nanowire stimulated by the\nmagnetic field pulse by finding the solution of time-dependent Schr\\\"odinger equation\n[Eq.\\ref{Eq:sch}] in subsequent time instants by means of 4-th order Runge-Kutta method with time\nstep $\\Delta t=10^{-4}\\textrm{ ps}$.\nFor this purpose we have performed a set of numerical simulations on regular mesh of nodes  in x\ndirection. We limit the length of quantum wire to 800 nm and impose smooth confining potential in\nthis direction as\nfor the quantum oscillator $V_{1}(x)=m^{*}\\omega_{0}^{2}x^2/2$ with oscillator strength\n$\\hbar\\omega_{0}=0.5\\textrm{ meV}$. This spatial constriction allows us to\nstudy of an electron motion for quite long times after the magnetic pulse is\nfinished what is particularily important if an influence of magnetic force\n($B_{y}=const$ ) on the coupling strength between the upper and lower parts of electron's\nwavepacket is taken into account.\nThe basis functions $\\{f_{1}(z),f_{2}(z)\\}$ were also found numerically with\nfinite difference method after discretization of Hamiltonian $\\widehat{h}_{z}$ on spatial mesh with\n200 nodes for z direction. The number of nodes in x direction was set to 400.\nAll simulations were precedeed by diagonalization of Hamiltonian appearing in Eq.\\ref{Eq:sch} to\nprepare the starting wavepacket for $t=0$ i.e. to find $\\Psi(x,t=0)=[\\psi_{1}(x,0),\\psi_{2}(x,0)]$.\n\nValue of parameter b  which defines the extent of\nvertical confinement in Eq.\\ref{Eq:vz} was equal 30 nm. The height of tunnel barrier between the\nupper and lower layers depends on magnitude of $V_{max}$. We set its\nvalue equal to 150 meV for which the energy splitting between the bounding ($f_{1}$) and\nthe antibounding ($f_{2}$) basis states equals $E_{21}^{(z)}=E_{2}^{(z)}-E_{1}^{(z)}=2\\textrm{\nmeV}$ for symmetric confinement ($\\alpha=0$). When\n$\\alpha$ becomes non-zero then $\\Delta E_{21}^{(z)}$ grows what eventually lowers the extent of\nmixing $\\psi_{1}$ and $\\psi_{2}$ components of an electron's wave function. This can not be however\nomitted since for $\\alpha=0$, the\nwavepackets localized in symmetric layers move in opposite directions [see Fig.\\ref{Fig:model}] and\nan electron wavepacket motion as a whole, in an arbitrarily chosen direction, can be obtain only for\n$\\alpha>0$ what will be shown below.\nIn paper we consider two cases, in first the electron is accelerated by single magnetic pulse, while\nin second, its motion is induced when the magnetic field is switched on/off.\n\n\\section{Results}\n\\label{Sec:res}\n\n\\subsection{Acceleration of an electron by a single magnetic pulse}\n\\label{Sec:imp}\nWe start presentation of our results  for a case the electron is\naccelerated by a single magnetic pulse defined as: $B(t)=B_{m}sin(\\pi t/t_{imp})\\cdot \\Theta(t)\\cdot\n\\Theta(t_{imp}-t)$, where $\\Theta(t)$ is the Heaviside step function, the amplitude of magnetic\nfield equals $B_{m}=5\\textrm{T}$ and the time duration of a pulse is changed within the range\n$t_{imp}=5-50\\textrm{ ps}$.\n\\begin{figure}[htbp!]\n\\hbox{\n\t\\epsfxsize=80mm\n       \\rotatebox{0}{{ \\epsfbox[0 305 569 842] {pics/1el_rox.eps}}}\n        \\hfill}\n\\caption{(Color online) Expectation value of electron position (left column) and the density (right\ncolumn) localized in the upper (red color) and in the lower layer (black color) during the time\nof simulation for $\\alpha=0$ (first row) and $\\alpha=0.005$ (second and third rows).\nInset in figures (a) and (e) shows zooms of oscillations of $\\bar{x}$ and $\\langle\n\\rho\\rangle$ remained after the magnetic pulse is ended.\nThe inset in (d) shows $C_{2}=\\langle\\psi_{2}|\\psi_{2} \\rangle $ that is an occupation of second\neigenstate for vertical quantization. Calculations were performed for parameters: $m^{*}=0.04$\n(InGaAs) and $\\Delta E_{21}^{z}=9.83\\textrm{\nmeV}$ (a) and $\\Delta E_{21}^{z}=9.9\\textrm{meV}$ in (b) and (c).}\n\\label{Fig:rox}\n\\end{figure}\n\\begin{figure*}[htbp!]\n\\hbox{\n\t\\epsfxsize=140mm\n       \\rotatebox{0}{{ \\epsfbox[0 448 595 842] {pics/1el_x.eps}}}\n        \\hfill}\n\\caption{(Color online) Dependence of the normalized expectation value of electron position\n($\\bar{x}$) in bi-layer quantum wire  on time length of magnetic pulse and on the time of\nsimulation.\nThe inclined dashed lines mark the right border of magnetic field pulse. The upper row displays\nthe results obtained for InGaAs and effective mass $m_{InGaAs}^{*}=0.04$ while the lower one for\nGaAs and effective mass $m_{GaAs}^{*}=0.067$. Parameter $\\alpha$ which is shown on top of each\nsubfigure represents an actual asymmetry in vertical confinement.\n}\n\\label{Fig:x}\n\\end{figure*}\nFigure \\ref{Fig:rox}(a) shows the time variations of the electron positions in\nthe upper and in the lower layers obtained according to Eqs. (\\ref{Eq:xex}) and (\\ref{Eq:xex2})\n[see description below] for symmetric bi-layer nanowire ($\\alpha=0$). The magnetic pulse\nstarts at $t=0$ and ends at $t=20\\textrm{ ps}$.\nWithin this time interval, the parts of electron wavepacket localized in upper and in lower layers\noscillate in x direction  but with opposite phases i.e. the upper part starts to move to\nthe right while the second one, localized in the lower layer, to the left, and then, both\nchange the directions of their motions three times due to reflections within the regions of high\nconfining potential.\nAfter the magnetic field eventually vanishes, these oscillations are strongly dumped but do not\ndisappear entirely. The inset in Fig.\\ref{Fig:rox}(a) shows that even though for $t>t_{imp}$ the\namplitude of these oscillations become very small but oscillations remain stable for longer times.\nThe beating\npattern shown in this inset come into existence due to the overlap of two\nkinds of oscilltions, one with period equal to $T_{1}=8.3\\textrm{ ps}$ and\nsecond with period $T_{2}=0.44\\textrm{ ps}$. To determine their origin we first calculated the\nexpectation value of electron position in upper layer according to formula $\\langle x\n\\rangle_{z>0}=\\langle \\Psi|x\\cdot \\Theta(z)|\\Psi\\rangle$. Exactly at the moment the magnetic pulse\nends ($B=0$), the electron wave function can\nbe expressed as $\\Psi(x,y,z,t=t_{imp})=\\sum_{k}\\psi_{k}(x,t_{imp})f_{k}(z)g_{0}(y)$. The part of\nwave\nfunction which is dependent on x variable was expanded within the base constituted by Hermite\npolynomials i.e. the quantum oscillator eigenstates $\\Phi_{\\mu}$:\n\\begin{eqnarray}\n\\nonumber\n\\Psi(x,y,z,t)&=&\\sum_{k}\\sum_{\\mu}d_{k,\\mu}\\Phi_{\\mu}(x)\\\\\n&&\\cdot f_{k}(z)g_{0}(y)e^{-i(E_{\\mu}^{x}+E_{k}^{z}+E_{0}^{y})t/ \\hbar}\n\\end{eqnarray}\nIn above equation, $d_{k,\\mu}$ are the linear combination coefficients,\n$\\Phi_{\\mu}(x)=C_{\\mu}H_{\\mu}(x)e^{-x^2}$ are the normalized Hermite polynomials\nwhile three arguments appearing in phase factor are the eigenenergies for quantized motion of\nelectron in x ($E_{\\mu}^{x}$), y ($E_{0}^{y}$) and z ($E_{k}^{z}$) directions.\nAccording to this definition, the position of electron in an upper layer (dependence\non $g_{0}(y)$ and $E_{0}^{y}$ disappear after integration over y variable) reads:\n\\begin{eqnarray}\n \\nonumber\n\\langle x \\rangle_{z>0}=\n\\sum_{k,m}\\sum_{\\mu,\\nu}&&\nd_{k,\\mu}^{*}d_{m,\\nu}\n\\langle \\Phi_{\\mu}|x|\\Phi_{\\nu}\\rangle\n\\langle f_{k}|\\Theta(z)|f_{m}\\rangle\\\\\n&&\\times e^{i\\Delta E_{\\mu,\\nu}^{x}t/\\hbar}\ne^{i\\Delta E_{k,m}^{z}t/\\hbar}\n\\label{Eq:xex}\n\\end{eqnarray}\nSince the amounts of probability density gathered in both layers may differ from unity we\nnormalized the expectation value of electron position in upper (or lower) layer:\n\n", "index": 5, "text": "\\begin{equation}\n\\bar{x}_{z>0}=\\frac{\\langle x\\rangle_{z>0}}{\\langle\\Psi|\\Psi\\rangle_{z>0}}\n\\label{Eq:xex2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\bar{x}_{z&gt;0}=\\frac{\\langle x\\rangle_{z&gt;0}}{\\langle\\Psi|\\Psi\\rangle_{z&gt;0}}\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mi>z</mi><mo>&gt;</mo><mn>0</mn></mrow></msub><mo>=</mo><mfrac><msub><mrow><mo stretchy=\"false\">⟨</mo><mi>x</mi><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>z</mi><mo>&gt;</mo><mn>0</mn></mrow></msub><msub><mrow><mo stretchy=\"false\">⟨</mo><mi mathvariant=\"normal\">Ψ</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>z</mi><mo>&gt;</mo><mn>0</mn></mrow></msub></mfrac></mrow></math>", "type": "latex"}]