[{"file": "1601.04707.tex", "nexttext": "\n\nsuch that $\\int d^3 v \\tilde f({\\boldsymbol{\\rm v}}) =1$. Here $d \\Omega_{{\\boldsymbol{\\rm v}}}$ is an infinitesimal solid angle around the direction ${\\boldsymbol{\\rm v}}$.\n\nIn sections \\ref{sec:vel-Mod} and \\ref{sec:vel-comp} we present the velocity modulus\ndistribution, as well as the components of the velocity distribution of the selected\nsimulated haloes, and discuss how they can be described using fitting\nfunctions. Notice that in the analysis of direct detection data in section \\ref{sec:results}, \nwe use the velocity distributions extracted  directly from the\nsimulations instead of the best fit functions.\n\n\\subsection{Velocity modulus distribution}\n\\label{sec:vel-Mod}\n\nIn the left panels of figure~\\ref{fig:fv}, we show the local DM velocity modulus\ndistribution in the Galactic rest frame for two haloes in the {{\\sc eagle}\\xspace} HR (top panel)\nand {{\\sc apostle}\\xspace} IR (bottom panel) simulations that satisfy our selection criteria. From\nthe 12 MW-like {{\\sc eagle}\\xspace} HR haloes, in the top panel we only show the velocity modulus\ndistribution for the two haloes that have speed distributions closest to (halo E12; reduced\n$\\chi^2$ of 1.43) and farthest from (halo E3; reduced $\\chi^2$ of 23.4) the SHM Maxwellian\ndistribution (with peak speed of 230 km$/$s). The vertical error bars specify the\n$1\\sigma$ Poisson error on the data points, and the horizontal error bars specify the\nspeed bin size. The Maxwellian speed distribution (with peak speed of 230 km$/$s) is\nshown as solid black lines, and the best fit Maxwellian speed distributions are also\nshown as dashed coloured curves. \n\nOne potential issue with the vertical error bars on the data points is that they might be correlated. Therefore, we have checked that bootstrap-resampling the distributions leads to similar error estimators compared to simple Poisson statistics. Hence, we will use the $1\\sigma$ Poisson error on the data points for our analysis in the rest of the paper. Notice also that we have considered different speed bin sizes and found the optimal size to be 25 km/s. A smaller bin size would\nincrease the noise in the data points due to the small number of particles in each\nbin, while a larger bin size would smear out features in the speed distribution. \n\n\nIn the right panels of figure~\\ref{fig:fv} we show the velocity modulus distributions\nfor the same haloes shown in the left panels but in the corresponding DMO simulations.  Comparing the\nleft and right panels of the figure, it is clear that baryons have an important\neffect on the DM speed distribution at the Solar radius. Including baryons in the\nsimulation leads to a shift of the peak of the local DM speed distribution to higher\nspeeds. This happens because baryons are dissipative and hence deepen the gravitational potential of the\nGalaxy in the inner regions, resulting in more high velocity particles, thus\nshifting the peak of the DM speed distribution to larger values.\n\nFor comparison, in Appendix~\\ref{app:f(v)} we show the velocity modulus distributions\nfor our selected haloes in the {{\\sc eagle}\\xspace} HR simulation that have the smallest (halo E6) and\nlargest (halo E4) local DM density. It is clear from figure \\ref{fig:fvrho} that the speed distributions for the two haloes are similar, as expected, since the local DM density does not affect the DM speed distributions.\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR-DMO.pdf}\\\\\n   \\vspace{5pt}\\includegraphics[width=0.49\\textwidth]{figs/fvLGIR-BFMax.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvLGIR-DMO-BFMax.pdf}\n\\caption{\\label{fig:fv} DM velocity modulus distributions in the Galactic rest frame\n  (coloured data points with 1$\\sigma$ error bars) for two haloes in the {{\\sc eagle}\\xspace} HR\n  simulation which satisfy our selection criteria and have the speed distributions\n  closest (halo E12, shown in green) and farthest (halo E3, shown in magenta) from the SHM Maxwellian (top left), and two\n  haloes in the {{\\sc apostle}\\xspace} IR simulation satisfying our selection criteria (bottom\n  left). The right panels show the velocity modulus distributions for the same haloes\n  shown in the left panels but in a DMO simulation. The black solid line shows the\n  SHM Maxwellian speed distribution (with peak speed of 230 km$/$s), and the coloured\n  dashed lines show the best fit Maxwellian distribution for each halo (with matching\n  colours).}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{center}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_GenMax.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_GenMax.pdf}\\\\\n    \\vspace{2pt} \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_Mao.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_Mao.pdf}\\\\\n  \\vspace{2pt}  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_Lisanti.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_Lisanti.pdf}\n\\caption{\\label{fig:scatter} Left panels: Scatter plots showing the results of the\n  fits to the simulated DM velocity modulus distribution for the set of 12 ({{\\sc eagle}\\xspace}\n  HR) + 2 ({{\\sc apostle}\\xspace} IR) selected MW-like galaxies when adopting, as fitting function,\n  a generalized Maxwellian distribution (top panels), and the functions proposed in\n  Mao {\\it et al.}~\\cite{Mao:2012hf} (centre panels) and in Lisanti {\\it et\n    al.}~\\cite{Lisanti:2010qx} (bottom panels). The colour-bar corresponds to the\n  value of the reduced $\\chi^2$, $\\tilde{\\chi}^2 \\equiv \\chi^2/(N - dof)$ (where $dof\n  = 2$ for all three cases). Right panels: Same as left panels but for the\n  corresponding haloes in the DMO simulations.}\n\\end{center}\n\\end{figure}\n\n\nNote that the local Galactic escape speeds for some haloes in the {{\\sc eagle}\\xspace} HR\nsimulation are higher than the value of the MW escape speed at the Solar position\nfound recently by the RAVE survey, $v_{\\rm\n  esc}=533^{+54}_{-41}~$~km$/$s~\\cite{Piffl:2013mla}. Although the RAVE value of the escape speed is actually a lower limit on the true MW escape speed, it is the commonly adopted value. Also, the larger $v_{\\rm esc}$ values of the haloes in the {{\\sc eagle}\\xspace} HR simulation are due to the larger\n$M_{200}$ of those haloes compared to the MW. However, as discussed in section~\\ref{sec:selection}, this\ndoes not affect the predicted signals in direct detection experiments. The local\nGalactic escape speeds are in the range of 720 -- 1083 km$/$s (617 -- 646 km$/$s) for\nthe selected {{\\sc eagle}\\xspace} HR ({{\\sc apostle}\\xspace} IR) haloes. These escape speeds are computed for each simulated halo from the total mass enclosed in a sphere of radius 7 kpc, which is the inner radius of our defined\ntorus. Therefore, these escape speeds represent an upper limit on those expected at\nthe Solar circle.\n\n\n\\bigskip\n\nWe now discuss how well the DM velocity modulus distributions of the simulated MW\nanalogues can be fitted with various fitting functions that have been proposed in the\npast for the DM velocity distribution.  We adopt the following parameterizations of\nthe DM velocity modulus distribution:\n\n\\begin{itemize}\n\n\\item Generalized Maxwellian distribution:\n\n", "itemtype": "equation", "pos": 24899, "prevtext": "\n\\maketitle\n\n\n\\section{Introduction}\n\\label{sec:introduction}\n\nDark matter (DM) direct detection searches aim to measure the recoil energy of a\nnucleus in a low background detector induced by the scattering of Weakly Interacting\nMassive Particles (WIMPs), one of the most well-motivated classes of particle DM\ncandidates, from the dark halo of the Milky Way (MW). In the last few years, a number\nof direct detection experiments have reported hints for signals that could be\ninterpreted as signatures of DM interactions. Currently, only hints from the\nDAMA/LIBRA~\\cite{Bernabei:2013xsa} and CDMS-II~\\cite{Agnese:2013rvf} experiments\nremain. These hints, however, are in tension with the null results from many other\nexperiments, including LUX (Large Underground Xenon)~\\cite{Akerib:2013tjd} and\nSuperCDMS~\\cite{Agnese:2014aze}, which set the strongest exclusion limits on the\nspin-independent DM--nucleon cross section and WIMP mass plane at large ($> 6$~GeV)\nand small (3.5--6~GeV) WIMP masses, respectively.\n\nThere are large systematic uncertainties in the interpretation of the data from DM direct\ndetection experiments due to the uncertainties in the DM density and velocity distribution at the position\nof the Sun. Indeed, in order to show the preferred regions and exclusion limits in\nthe DM mass and scattering cross section plane, one needs to make assumptions about\nthe DM halo properties, namely the local DM density and DM velocity distribution. The\nsimplest and most commonly adopted DM halo model is the Standard Halo Model (SHM): it\nassumes an isothermal, spherical DM halo with an isotropic Maxwell-Botzmann DM\nvelocity distribution. In this model, the local DM density is usually assumed to be\n0.3 GeV$/{\\rm cm}^3$; the local velocity distribution in the Galactic rest frame is\nassumed to be a Maxwellian with a most probable (peak) speed equal to the local circular speed $v_c$ (usually assumed to be\n220 km$/$s), a three-dimensional velocity dispersion of $\\sqrt{3/2}~v_c$, and truncated at the\nescape speed of 544 km/s from the Galaxy. Throughout this paper, when referring to\nthe SHM Maxwellian, we consider the Maxwellian distribution with a most probable speed of 230\nkm$/$s in order to be consistent with the local circular speed assumed in deriving\nthe observed MW rotation curves~\\cite{Iocco:2015xga} (see section~\\ref{sec:selection}\nfor more details).\n\n\nThe local DM density enters as a normalisation factor in the event rate in direct\ndetection experiments, whilst the DM velocity distribution enters in the event rate\nin a more complicated way (see eq.~\\eqref{rate}). In particular, different direct\ndetection experiments with different energy thresholds and target nuclei\nprobe different DM speed ranges, and thus their dependence on the DM velocity\ndistribution varies. To overcome the astrophysical uncertainties in the\ninterpretation of direct detection results, methods to compare the results of\ndifferent experiments in a halo-independent way have been developed and applied to\ndirect detection data~\\cite{Fox:2010bz, Fox:2010bu, McCabe:2011sr, Frandsen:2011gi,\n  Gondolo:2012rs, HerreroGarcia:2012fu, Frandsen:2013cna, DelNobile:2013cta,\n  BHSZ:2013, DelNobile:2013cva, DelNobile:2013gba, Feldstein:2014gza, Fox:2014kua,\n  Cherry:2014wia, Feldstein:2014ufa, Bozorgnia:2014gsa, Anderson:2015xaa,\n  Blennow:2015gta, Ferrer:2015bta, Gelmini:2015voa}. Such\nmethods are based on comparing different experiments in the space of the minimum DM\nspeed, $v_{\\rm min}$, required for a DM particle to deposit a recoil energy $E_R$ in\nthe detector, and thus can only be applied to compare experiments which are sensitive\nto the same range of $v_{\\rm min}$.\n\n\nHigh resolution numerical simulations of galaxy formation can provide information on\nthe properties of the DM halo. Velocity distributions extracted from high resolution\nDM-only (DMO) simulations deviate substantially from a Maxwellian distribution, with\nfewer particles at the peak and an excess of particles at large\nspeeds~\\cite{Vogelsberger:2008qb, Kuhlen:2009vh}. DMO simulations can achieve high\nresolution, but have significant systematic uncertainties since they neglect the effect of the baryonic\ncomponents during the galaxy formation process. Recently, realistic cosmological\nsimulations including baryons have become possible thanks to advances in physical\nmodeling, as well as better understanding and treatment of numerical issues.\n\nThe hydrodynamic simulation performed by Ling {\\it et al.}~\\cite{Ling:2009eh}\npredicts a DM speed distribution which deviates significantly from the Maxwellian,\nand instead gives an excellent fit to a Tsallis~\\cite{Tsallis:1987eu} distribution. In\nthis simulation, the local DM density is found to be 0.37 -- 0.39 GeV$/$cm$^3$.  The\nEris hydrodynamic simulation~\\cite{Kuhlen:2013tra} finds a speed distribution that\nis not a perfect Maxwellian, with an excess of particles at speeds less than 350 km$/$s compared to the SHM Maxwellian \nand fewer particles at higher speeds. The speed distribution is instead well fit by the fitting function\nproposed by Mao {\\it et al.}~\\cite{Mao:2012hf}. The NIHAO (Numerical Investigation of\na Hundred Astrophysical Objects) simulations~\\cite{Butsky:2015pya} find a DM speed\ndistribution which is very different from the Maxwellian, being more symmetric around\nthe peak velocity and falling rapidly at large velocities, thus agreeing with the\nresults of the Eris simulation. All these hydrodynamic simulations help build an understanding of the processes that can shape and modify the local dark matter density and velocity distribution. However, to make more precise quantitative predictions it is necessary that all these effects are modeled in such a way that the main galaxy population properties are broadly reproduced. This ensures, for instance, that appropriate amounts of feedback are applied and that the corresponding impact of feedback on dark matter is reasonably realistic.\n\nIn this work, we study the implications of simulated MW-like galaxies within the\n{{\\sc eagle}\\xspace} (``Evolution and Assembly of GaLaxies and their Environments\")~\\cite{Schaye:2015,Crain:2015} and {{\\sc apostle}\\xspace}~\\cite{Sawala:2015,Fattahi:2015} projects for DM direct detection. The {{\\sc eagle}\\xspace}\nproject is a suite of hydrodynamic simulations that are calibrated to reproduce the\nobserved distribution of stellar masses and sizes of low-redshift galaxies as well as\nthe relation between the stellar mass and black hole mass of galaxies; in this respect they are unique amongst simulations of galaxy formation. In a companion\npaper, we have studied the implications of the {{\\sc eagle}\\xspace} and the related {{\\sc apostle}\\xspace} simulations for DM indirect\ndetection~\\cite{Calore:2015oya}. We first consider a selection of MW-like galaxies\nwithin haloes with virial mass in the range $\\mathcal{O}(10^{12} - 10^{13}) \\,\n{{\\rm M}_\\odot}$. We then impose a set of selection criteria crucial for accurately predicting\nthe local DM density and velocity distribution. Namely, we require that the haloes\nsatisfy observational constraints on the MW rotation curve~\\cite{Iocco:2015xga}, and\nhave stellar masses within the observed MW stellar mass range. We then extract the\nlocal DM density and velocity distribution for the selected haloes, and use them to\nanalyse current data from direct detection experiments.\n\nThe paper is outlined as follows. In section \\ref{sec:simulation} we present the set\nof {{\\sc eagle}\\xspace} and {{\\sc apostle}\\xspace} cosmological hydrodynamic simulations used in this work. In section\n\\ref{sec:selection} we discuss in detail the selection criteria used for choosing MW\nanalogues, and how each criterion is relevant for determining the local DM\ndistribution. In sections \\ref{sec:veldist} and \\ref{sec:DMdensity} we present the\nlocal DM velocity distribution and DM density extracted from the simulations. In\nsection \\ref{sec:signals} we introduce the formalism for computing the predicted\nsignals in DM direct detection experiments. In section \\ref{sec:results} we perform\nan analysis of current direct detection data and discuss how the allowed regions and\nexclusion limits set by different experiments in the DM mass and scattering cross\nsection plane changes when the DM distribution of simulated haloes is used. Finally,\nin section \\ref{sec:summary} we summarize the conclusions of this work. In\nAppendices~\\ref{app:criteria}, \\ref{app:f(v)}, and \\ref{app:fits}, we provide\nadditional material relevant for this work.\n\n\n\n\\section{Simulations}\n\\label{sec:simulation}\n\n\nThe simulations used in this study comprise parts of the {{\\sc eagle}\\xspace}~\\cite{Schaye:2015,Crain:2015}\nand {{\\sc apostle}\\xspace}~\\cite{Sawala:2015,Fattahi:2015} projects, both of which we describe below.\n\nThe {{\\sc eagle}\\xspace} project combines a state-of-the-art hydrodynamical SPH implementation\nnicknamed {\\sc anarchy} \\cite{DallaVecchia:2015,Schaller:2015b} -- built on top of an\noptimized version of the {\\sc gadget} SPH code, last described by \\cite{Springel:2005} -- and a detailed\nsubgrid model of galaxy formation that features metal-line cooling,\nphoto-reionization, star formation, and feedback from star formation and active\ngalactic nuclei~\\cite{Wiersma:2008cs, Wiersma:2009wf, Schaye:2007ss, Vecchia:2012wu, Rosas-Guevara:2013yma}. The subgrid model is regulated by a number of parameters, which are\ncalibrated to give a good fit to the $z=0.1$ galaxy stellar mass function and to the observed \nrelation between galaxy stellar mass and size for disc galaxies. From the suite of {{\\sc eagle}\\xspace} simulations we\nselect candidate MW analogues in the high resolution (25~Mpc)$^3$ box (initial gas\nparticle mass $2.26\\times10^{5}~{{\\rm M}_\\odot}$), which adopts the Planck cosmological\nparameters \\citep{Planck:2014} ($\\Omega_{m}=0.307$, $\\Omega_{\\Lambda}=0.693$,\n$\\Omega_{b}=0.0482$, $h=0.678$, $\\sigma_{8}=0.83$, and $n_{s}=0.961$) and the {{\\sc eagle}\\xspace}\nmodel parameters re-calibrated for high resolution (see ref.~\\cite{Schaye:2015} for a\ndiscussion of model parameter calibration). Throughout the paper, we refer to this\nsimulation as {{\\sc eagle}\\xspace} HR. Notice that in other {{\\sc eagle}\\xspace} papers, this simulation is referred to as Recal-L025N0752.\n\nAs we will discuss in section~\\ref{sec:selection}, the initial set of {{\\sc eagle}\\xspace} HR haloes with the virial mass in the range $\\mathcal{O}(10^{12} - 10^{13}) \\, {{\\rm M}_\\odot}$ consists of 61 objects. To increase our initial number of haloes, we also consider haloes within the {{\\sc apostle}\\xspace} project. The {{\\sc apostle}\\xspace} project applies the {{\\sc eagle}\\xspace} model in a series of zoomed\n simulations of Local Group-analogue systems. Each Local Group volume contains two\n haloes of mass $\\sim10^{12}~{{\\rm M}_\\odot}$, each of which hosts a potential MW galaxy\n analogue. We picked our candidate galaxies from the 12 intermediate resolution, comparable in resolution to {{\\sc eagle}\\xspace} HR, \n volumes as presented in ref.~\\cite{Sawala:2015}. We refer to these simulations\n collectively as {{\\sc apostle}\\xspace} IR. These simulations were run with the same code as\n {{\\sc eagle}\\xspace}, used the {{\\sc eagle}\\xspace} reference parameters as calibrated for the {{\\sc eagle}\\xspace}\n intermediate resolution simulations, and were run with the WMAP7 cosmological\n parameters ($\\Omega_{m}=0.272$, $\\Omega_{\\Lambda}=0.728$, $\\Omega_{b}=0.0455$,\n $h=0.704$, $\\sigma_{8}=0.81$, and $n_{s}=0.967$); the initial gas particle mass is\n $1.2\\times10^{5}~{{\\rm M}_\\odot}$.\n \n\nFor both {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR, companion simulations were run with all of the\nmatter content treated as collisionless, and in this work we compare the results of\nthese DMO runs with those that use the full hydrodynamical treatment.\n\n Notice that we have not performed resolution tests for the simulations used in this work. Lower resolution simulations compared to {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR cannot be used to test for numerical convergence  because there would be insufficient particles to probe the DM distribution in the Solar neighbourhood. Re-calibrated higher resolution simulations are not available either. The caveat is that without such a test, it remains to be demonstrated that the conclusions of this work are robust with respect to the numerical resolution.\n\n\n\\section{Selection of Milky Way-like galaxies}\n\\label{sec:selection}\n\nIn ref.~\\cite{Calore:2015oya} we identified simulated galaxies that are ``good\" MW\nanalogues according to the following three criteria: (i) their rotation curves\nprovide good fits to the recent compilation of observed MW rotation curve from\nref.~\\cite{Iocco:2015xga}, (ii) their stellar masses are within the $3\\sigma$\nobserved stellar mass range of the MW, $4.5 \\times10^{10}<M_{*}/{{\\rm M}_\\odot}<8.3\n\\times10^{10}$~\\cite{McMillan:2011wd}, and (iii) they contain a substantial stellar\ndisc component. The details of our selection procedure are presented in\nref.~\\cite{Calore:2015oya}. Note that in deriving the measured MW rotation curves\nfrom ref.~\\cite{Iocco:2015xga}, we assume as fiducial values a local circular\nspeed of $v_c = 230$ km/s, a local galactocentric distance of $R_0 = 8$ kpc, and\nthe component of the Solar peculiar velocity in the direction of the Galactic\nrotation of $V_{\\odot} = 12.24$ km/s~\\cite{Schoenrich:2010}.\n\n\nWe first consider all central galaxies in haloes with\n$5\\times10^{11}<M_{200}/{{\\rm M}_\\odot}<2\\times10^{13}$, where $M_{200}$ is the mass enclosed\nwithin the sphere centered on the galaxy's potential minimum, that contains a mean density 200 times the critical density. These\ninitial sets of galaxies comprise 61 and 24 objects for the {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR\nsimulations respectively, and the largest $M_{200}$ in these sets is $1.4 \\times\n10^{13} {{\\rm M}_\\odot}$. The final sets of galaxies that satisfy the three mentioned selection criteria consist of 2 objects for each project at our chose resolution. \n\nGiven the limited statistics once the selection criteria have been applied, we discuss\nbelow how each selection criterion affects the implications for direct detection, in\nparticular the two main astrophysical inputs for computing direct detection rates,\nand examine whether it is possible to relax one or more of the criteria.\n\nThe local DM density and velocity distribution of the simulated haloes are important\nparameters for direct DM detection. Among the three initial\ncriteria for identifying MW analogues, criteria (i) and (ii) are important because\nthey directly affect the local circular speed, $v_c$, at the Solar radius, and\nhence the peak of the local DM speed distribution in the Galactic reference frame. In\nparticular, the fit to the observed MW rotation curve constrains $v_c$. Also, as can\nbe seen from figure \\ref{fig:vc}, the stellar mass, $M_{*}$, is strongly correlated\nwith $v_c$ at 8 kpc, while the correlation of $M_{200}$ with $v_c$ is weaker. The Pearson's correlation coefficient between $v_c$ and $M_{*}$ is 0.94, while it is 0.68 between $v_c$ and $M_{200}$.\n\n\n\nThe reason is that $v_c$ at the Solar circle depends on the total mass in stars,\ngas and DM enclosed within the sphere of radius 8 kpc.  The enclosed stellar\nmass within the Solar circle is a large fraction of the total stellar mass, (0.5\n-- 0.9)$M_{*}$ depending on the simulated halo in the {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR\nrun, since the enclosed stellar mass does not increase significantly with\ngalactocentric distance beyond the Solar circle. On the other hand, the enclosed\nDM mass increases significantly with galactocentric distance, and the total mass\nenclosed within 8 kpc is only (0.01 -- 0.1)$M_{200}$. Over the small halo mass\nrange probed, we find little correlation between the DM mass enclosed within a\nsphere of radius 8 kpc and $M_{200}$. The scatter in galaxy stellar mass at a\nfixed halo mass dominates the variation in $v_c$.  A stronger correlation between\n$v_c$ and $M_{*}$ compared to the correlation with $M_{200}$ is hence found.\n\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/vcMstar.pdf}\n  \\includegraphics[width=0.48\\textwidth]{figs/vcM200.pdf}\n\\caption{\\label{fig:vc} The correlation of the local circular speed at $R_0=8$~kpc \nwith the total stellar mass, $M_{*}$ (left panel) and the virial mass,\n  $M_{200}$ (right panel) for all the haloes with $5\\times10^{11}<M_{200}/{{\\rm M}_\\odot} \\leq\n  1.4 \\times10^{13}$ in the {{\\sc eagle}\\xspace} HR simulation.}\n\\end{center}\n\\end{figure}\n\nOn the other hand, having a substantial stellar disc component, as specified by criterion\n(iii), for the simulated galaxies does not have an important effect on the local DM\ndensity and speed distributions. In particular, haloes which satisfy criteria (i) and\n(ii) but are spheroidal have DM velocity distributions similar to those with a\ndisc. The local DM density range for all haloes satisfying criteria (i) and (ii) is\nslightly increased compared to the range for haloes satisfying all three criteria\n(see appendix~\\ref{app:criteria}). This is due to the addition of more haloes to our\nsample, but without a significant trend in a specific direction. Thus, we believe\nthat the predictions for direct detection searches remain unchanged for galaxies that\ndo not have a substantial disc component.\n\nAnalogously to ref.~\\cite{Calore:2015oya}, we define a\nsecond set of MW-like galaxies  for each project at our chosen resolution, which satisfy only criteria (i) and (ii). This set\nconsists of 12 galaxies in the {{\\sc eagle}\\xspace} HR, and 2 galaxies in the {{\\sc apostle}\\xspace} IR\nsimulations.\nNote that only 2 galaxies in the {{\\sc apostle}\\xspace} IR run have a stellar mass compatible with\nthe observed range of MW stellar mass, and both of these galaxies also have a\ndominant stellar disc component. Therefore, it is not possible to increase the number\nof MW analogues in the {{\\sc apostle}\\xspace} IR run by relaxing the criterion on the stellar\ndisc. In table~\\ref{tab:criteria} we list the parameters of the MW-like galaxies\nsatisfying criteria (i) and (ii). In the main sections of this paper we only consider\nthe set of galaxies which satisfy these two criteria. For completeness and\ncomparison, we list the results for the two galaxies in the {{\\sc eagle}\\xspace} HR simulation (E9 and E11 in table~\\ref{tab:criteria})\nwhich satisfy all three criteria in Appendix \\ref{app:criteria}.\n\n\\begin{table}[t!]\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|}\n      \\hline\n        Halo Name  & $M_{*}   [ \\times 10^{10} \\, {{\\rm M}_\\odot}]$ & $M_{200} [ \\times 10^{12} \\,  {{\\rm M}_\\odot}]$  &  D/T & $\\chi^2/(N-1)$ \\\\\n       \\hline\n       E1 & 5.88 & 14.26 & 0.18 & 105.54 \\\\\n       E2 & 7.12 & 9.48 &  0.33 & 324.31 \\\\\n       E3 & 5.77 & 5.16 &  0.35 & 190.97 \\\\\n       E4 & 5.14 & 3.24 &  0.18 & 44.70 \\\\\n       E5 & 5.18 & 5.57 &  0.14 & 160.27 \\\\\n       E6 & 5.05 & 5.42 &  0.10 & 266.83 \\\\\n       E7 & 7.02 & 4.32 &  0.25 & 160.58 \\\\\n       E8 & 4.65 & 4.06 &  0.13 & 55.07 \\\\\n       E9 & 5.31 & 3.50 & 0.45 & 74.55 \\\\\n       E10 & 4.85 & 3.30 &  0.36 & 59.65 \\\\\n       E11 & 5.48 &  2.76 & 0.46 & 220.96 \\\\\n       E12 & 4.87 & 2.99 &  0.25 & 45.45 \\\\\n       \\hline\n       A1 & 4.88 & 1.64 &  0.70 & 221.27  \\\\\n       A2 & 4.48 & 2.15 &  0.50 & 51.04 \\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Total stellar mass, halo mass, disc-to-total mass ratio $D/T$ (defined in eq.~(3.4) of ref.~\\cite{Calore:2015oya}), and\n      reduced $\\chi^2$ for the fit to the rotation curve data (for $R > 2.5$~kpc) of\n      the MW-like galaxies that satisfy our selection criteria (i) and (ii) in the\n      {{\\sc eagle}\\xspace} HR (haloes E1 to E12) and {{\\sc apostle}\\xspace} IR (haloes A1 and A2) runs.}\n    \\label{tab:criteria}\n  \\end{table}\n  \n \nIn computing the goodness of fit to the observed MW rotation curves from\nref.~\\cite{Iocco:2015xga}, we have considered measurements for galactocentric\ndistances $R>2.5$~kpc, since at smaller radii the gravitational potential of the Galactic bulge can break the assumption of circular orbits for the tracers in ref.~\\cite{Iocco:2015xga}. The reduced $\\chi^2$ for the fit to the rotation curve data is in the range 44.70 -- 324.31\n(51.04 --221.27), for the {{\\sc eagle}\\xspace} HR ({{\\sc apostle}\\xspace} IR) simulation. Since we are interested in the local DM distribution, we would\nlike to check how the goodness of fit changes if a smaller range of $R$ is\nconsidered. In particular, we consider four additional ranges of $R$ for the fit: $R\n> 5$~kpc, $R > 7$~kpc, $5~{\\rm kpc} <R < 11$~kpc, and $7~{\\rm kpc}< R < 9$~kpc. For\nall these cases, the goodness of fit is only marginally better for most haloes with\n$M_{*}$ within the observed MW stellar mass range in the {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR\nsimulations, and the overall range of the reduced $\\chi^2$ is slightly smaller. For\nthe {{\\sc eagle}\\xspace} HR ({{\\sc apostle}\\xspace} IR) simulation, the reduced $\\chi^2$ range is 22.28 -- 290.36\n(44.6 --213.24), 17.20 -- 182.91 (41.40 --134.16), 24.29 -- 317.92 (48.92 -- 233.42),\nand 23.71 -- 268.92 (59.86 -- 196.92) when taking measurements at $R > 5$~kpc, $R >\n7$~kpc, $5~{\\rm kpc} <R < 11$~kpc, and $7~{\\rm kpc}< R < 9$~kpc, respectively. The\nreason for this small reduction in the reduced $\\chi^2$ values is that the measured\nMW rotation curves have very small error bars at small galactocentric distances, $R\n<5$~kpc, and therefore the fit gets worse when including the measurements at\n$2.5~{\\rm kpc}<R<5$~kpc.\n\nAs discussed in ref.~\\cite{Calore:2015oya}, the halo masses of our selected simulated\ngalaxies are higher than the MW halo mass expected from abundance matching arguments\n(e.g.~$M_{200,\\rm MW} = 1.2^{+0.7}_ {-0.4} \\times 10^{12} \\,\n{{\\rm M}_\\odot}$~\\cite{Busha:2010sg}) probably due to the slightly too efficient feedback in\nthe {{\\sc eagle}\\xspace} HR simulated haloes of this mass range \\cite{Schaye:2015, Crain:2015}. We have checked\nthat the large halo masses and the mismatch between stellar mass and halo mass do not\naffect the recoil rate and other relevant quantities in direct DM detection\nexperiments. Note that the higher halo mass results in a higher DM escape speed from\nthe Galaxy, and hence a higher velocity tail of the DM velocity\ndistribution. However, the halo integral (see section~\\ref{sec:haloint}), which\nencodes the astrophysical dependence of the recoil rate, is very similar for haloes\nwhich have the highest and smallest halo masses but with stellar masses within the\n$3\\sigma$ observed MW stellar mass range.\n\n\n\n\n\n\\section{Dark matter velocity distribution}\n\\label{sec:veldist}\n\nThe event rates in a direct detection experiment depend strongly  on the DM velocity\ndistribution at the position of the Sun. In this section we discuss the DM velocity\ndistribution in the Galactic rest frame for the {{\\sc eagle}\\xspace} HR and {{\\sc apostle}\\xspace} IR simulated\nhaloes which satisfy criteria (i) and (ii) as defined in\nsection~\\ref{sec:selection}.\n\n\nTo find the DM velocity distribution at the Solar circle ($R_0=8$~kpc), we consider a torus with a square cross section \nwhich is aligned with the stellar disk, and has an inner and outer radius of 7 kpc\nand 9 kpc from the Galactic centre respectively, and a height extending from -1 kpc\nto 1 kpc with respect the the Galactic plane. This region contains a total of 1821\n-- 3201 (2160 -- 3024) particles depending on the halo in the {{\\sc eagle}\\xspace} HR ({{\\sc apostle}\\xspace} IR)\nsimulation. Notice that due to the limited resolution of the simulation, we are not\nsensitive to the local variation of the DM velocity distribution within the\ntorus. Hence we take the average velocity distribution of DM particles in the full\ntorus, instead of computing it at the azimuthal position of the Sun at 8 kpc in the torus. \n\nWe define a reference frame in the plane of the galaxy to describe the velocity\nvector of the simulation particles. In this reference system, the origin is at the\nGalactic centre, the $z$-axis is perpendicular to the stellar disk, $r$ is in the\nradial direction, and $\\theta$ is in the tangential direction. In the case of the DMO simulations, we orientate the torus in the same direction as in the hydrodynamic case. We can then calculate\nthe velocity distribution for the vertical ($v_z$), radial ($v_r$), and azimuthal\n($v_\\theta$) components of the DM in addition to the velocity modulus\ndistribution. This distribution, as well as the three components of the velocity\ndistribution, are individually normalised to unity, such that $\\int dv f(|{\\boldsymbol{\\rm v}}|) =\n1$ and $\\int dv_i f(v_i) = 1$ for $i = z, r, \\theta$. Note that the velocity modulus\ndistribution, $f(|{\\boldsymbol{\\rm v}}|)$, normalised in this way is related to the velocity\ndistribution, $\\tilde f({\\boldsymbol{\\rm v}})$, by,\n\n\n", "index": 1, "text": "\\begin{equation}\nf(|{\\boldsymbol{\\rm v}}|) = v^2 \\int d \\Omega_{{\\boldsymbol{\\rm v}}} \\tilde f({\\boldsymbol{\\rm v}}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"f(|{\\boldsymbol{\\rm v}}|)=v^{2}\\int d\\Omega_{{\\boldsymbol{\\rm v}}}\\tilde{f}({%&#10;\\boldsymbol{\\rm v}}),\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msup><mi>v</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mo>𝑑</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>𝐯</mi></msub></mrow><mo>⁢</mo><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwith free parameters $v_0$ and $\\alpha$. The case of a standard Maxwellian\ndistribution is represented by $\\alpha = 1$. We also test the goodness of fit for a\nstandard Maxwellian to the simulated velocity modulus distributions (see\ntables~\\ref{tab:fvfit} and~\\ref{tab:fvfitDMO} in Appendix~\\ref{app:fits}).\n\n\\item The velocity modulus distribution proposed by Mao {\\it et al.}~\\cite{Mao:2012hf}:\n\n", "itemtype": "equation", "pos": 32321, "prevtext": "\n\nsuch that $\\int d^3 v \\tilde f({\\boldsymbol{\\rm v}}) =1$. Here $d \\Omega_{{\\boldsymbol{\\rm v}}}$ is an infinitesimal solid angle around the direction ${\\boldsymbol{\\rm v}}$.\n\nIn sections \\ref{sec:vel-Mod} and \\ref{sec:vel-comp} we present the velocity modulus\ndistribution, as well as the components of the velocity distribution of the selected\nsimulated haloes, and discuss how they can be described using fitting\nfunctions. Notice that in the analysis of direct detection data in section \\ref{sec:results}, \nwe use the velocity distributions extracted  directly from the\nsimulations instead of the best fit functions.\n\n\\subsection{Velocity modulus distribution}\n\\label{sec:vel-Mod}\n\nIn the left panels of figure~\\ref{fig:fv}, we show the local DM velocity modulus\ndistribution in the Galactic rest frame for two haloes in the {{\\sc eagle}\\xspace} HR (top panel)\nand {{\\sc apostle}\\xspace} IR (bottom panel) simulations that satisfy our selection criteria. From\nthe 12 MW-like {{\\sc eagle}\\xspace} HR haloes, in the top panel we only show the velocity modulus\ndistribution for the two haloes that have speed distributions closest to (halo E12; reduced\n$\\chi^2$ of 1.43) and farthest from (halo E3; reduced $\\chi^2$ of 23.4) the SHM Maxwellian\ndistribution (with peak speed of 230 km$/$s). The vertical error bars specify the\n$1\\sigma$ Poisson error on the data points, and the horizontal error bars specify the\nspeed bin size. The Maxwellian speed distribution (with peak speed of 230 km$/$s) is\nshown as solid black lines, and the best fit Maxwellian speed distributions are also\nshown as dashed coloured curves. \n\nOne potential issue with the vertical error bars on the data points is that they might be correlated. Therefore, we have checked that bootstrap-resampling the distributions leads to similar error estimators compared to simple Poisson statistics. Hence, we will use the $1\\sigma$ Poisson error on the data points for our analysis in the rest of the paper. Notice also that we have considered different speed bin sizes and found the optimal size to be 25 km/s. A smaller bin size would\nincrease the noise in the data points due to the small number of particles in each\nbin, while a larger bin size would smear out features in the speed distribution. \n\n\nIn the right panels of figure~\\ref{fig:fv} we show the velocity modulus distributions\nfor the same haloes shown in the left panels but in the corresponding DMO simulations.  Comparing the\nleft and right panels of the figure, it is clear that baryons have an important\neffect on the DM speed distribution at the Solar radius. Including baryons in the\nsimulation leads to a shift of the peak of the local DM speed distribution to higher\nspeeds. This happens because baryons are dissipative and hence deepen the gravitational potential of the\nGalaxy in the inner regions, resulting in more high velocity particles, thus\nshifting the peak of the DM speed distribution to larger values.\n\nFor comparison, in Appendix~\\ref{app:f(v)} we show the velocity modulus distributions\nfor our selected haloes in the {{\\sc eagle}\\xspace} HR simulation that have the smallest (halo E6) and\nlargest (halo E4) local DM density. It is clear from figure \\ref{fig:fvrho} that the speed distributions for the two haloes are similar, as expected, since the local DM density does not affect the DM speed distributions.\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR-DMO.pdf}\\\\\n   \\vspace{5pt}\\includegraphics[width=0.49\\textwidth]{figs/fvLGIR-BFMax.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvLGIR-DMO-BFMax.pdf}\n\\caption{\\label{fig:fv} DM velocity modulus distributions in the Galactic rest frame\n  (coloured data points with 1$\\sigma$ error bars) for two haloes in the {{\\sc eagle}\\xspace} HR\n  simulation which satisfy our selection criteria and have the speed distributions\n  closest (halo E12, shown in green) and farthest (halo E3, shown in magenta) from the SHM Maxwellian (top left), and two\n  haloes in the {{\\sc apostle}\\xspace} IR simulation satisfying our selection criteria (bottom\n  left). The right panels show the velocity modulus distributions for the same haloes\n  shown in the left panels but in a DMO simulation. The black solid line shows the\n  SHM Maxwellian speed distribution (with peak speed of 230 km$/$s), and the coloured\n  dashed lines show the best fit Maxwellian distribution for each halo (with matching\n  colours).}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{center}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_GenMax.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_GenMax.pdf}\\\\\n    \\vspace{2pt} \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_Mao.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_Mao.pdf}\\\\\n  \\vspace{2pt}  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fv_all_Lisanti.pdf}\n  \\includegraphics[width=0.45\\textwidth]{figs/scatter_fvDMO_all_Lisanti.pdf}\n\\caption{\\label{fig:scatter} Left panels: Scatter plots showing the results of the\n  fits to the simulated DM velocity modulus distribution for the set of 12 ({{\\sc eagle}\\xspace}\n  HR) + 2 ({{\\sc apostle}\\xspace} IR) selected MW-like galaxies when adopting, as fitting function,\n  a generalized Maxwellian distribution (top panels), and the functions proposed in\n  Mao {\\it et al.}~\\cite{Mao:2012hf} (centre panels) and in Lisanti {\\it et\n    al.}~\\cite{Lisanti:2010qx} (bottom panels). The colour-bar corresponds to the\n  value of the reduced $\\chi^2$, $\\tilde{\\chi}^2 \\equiv \\chi^2/(N - dof)$ (where $dof\n  = 2$ for all three cases). Right panels: Same as left panels but for the\n  corresponding haloes in the DMO simulations.}\n\\end{center}\n\\end{figure}\n\n\nNote that the local Galactic escape speeds for some haloes in the {{\\sc eagle}\\xspace} HR\nsimulation are higher than the value of the MW escape speed at the Solar position\nfound recently by the RAVE survey, $v_{\\rm\n  esc}=533^{+54}_{-41}~$~km$/$s~\\cite{Piffl:2013mla}. Although the RAVE value of the escape speed is actually a lower limit on the true MW escape speed, it is the commonly adopted value. Also, the larger $v_{\\rm esc}$ values of the haloes in the {{\\sc eagle}\\xspace} HR simulation are due to the larger\n$M_{200}$ of those haloes compared to the MW. However, as discussed in section~\\ref{sec:selection}, this\ndoes not affect the predicted signals in direct detection experiments. The local\nGalactic escape speeds are in the range of 720 -- 1083 km$/$s (617 -- 646 km$/$s) for\nthe selected {{\\sc eagle}\\xspace} HR ({{\\sc apostle}\\xspace} IR) haloes. These escape speeds are computed for each simulated halo from the total mass enclosed in a sphere of radius 7 kpc, which is the inner radius of our defined\ntorus. Therefore, these escape speeds represent an upper limit on those expected at\nthe Solar circle.\n\n\n\\bigskip\n\nWe now discuss how well the DM velocity modulus distributions of the simulated MW\nanalogues can be fitted with various fitting functions that have been proposed in the\npast for the DM velocity distribution.  We adopt the following parameterizations of\nthe DM velocity modulus distribution:\n\n\\begin{itemize}\n\n\\item Generalized Maxwellian distribution:\n\n", "index": 3, "text": "\\begin{equation} \\label{eq:genMax}\nf(|{\\boldsymbol{\\rm v}}|) \\propto  |{\\boldsymbol{\\rm v}}|^2  \\exp[ -( |{\\boldsymbol{\\rm v}}| / v_0 )^{2 \\alpha} ] \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"f(|{\\boldsymbol{\\rm v}}|)\\propto|{\\boldsymbol{\\rm v}}|^{2}\\exp[-(|{\\boldsymbol%&#10;{\\rm v}}|/v_{0})^{2\\alpha}]\\,,\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mo>/</mo><msub><mi>v</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>α</mi></mrow></msup></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwith free parameters $v_0$ and $p$.\n\n\\item The velocity modulus distribution proposed by Lisanti {\\it et al.}~\\cite{Lisanti:2010qx}:\n\n", "itemtype": "equation", "pos": 32887, "prevtext": "\nwith free parameters $v_0$ and $\\alpha$. The case of a standard Maxwellian\ndistribution is represented by $\\alpha = 1$. We also test the goodness of fit for a\nstandard Maxwellian to the simulated velocity modulus distributions (see\ntables~\\ref{tab:fvfit} and~\\ref{tab:fvfitDMO} in Appendix~\\ref{app:fits}).\n\n\\item The velocity modulus distribution proposed by Mao {\\it et al.}~\\cite{Mao:2012hf}:\n\n", "index": 5, "text": "\\begin{equation} \\label{eq:Mao}\nf(|{\\boldsymbol{\\rm v}}|) \\propto |{\\boldsymbol{\\rm v}}|^2  \\exp[ - |{\\boldsymbol{\\rm v}}| / v_0 ]  ( v_{\\rm esc}^2 -  |{\\boldsymbol{\\rm v}}|^2)^p ~\\Theta (v_{\\rm esc} -  |{\\boldsymbol{\\rm v}}| )\\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"f(|{\\boldsymbol{\\rm v}}|)\\propto|{\\boldsymbol{\\rm v}}|^{2}\\exp[-|{\\boldsymbol{%&#10;\\rm v}}|/v_{0}](v_{\\rm esc}^{2}-|{\\boldsymbol{\\rm v}}|^{2})^{p}~{}\\Theta(v_{%&#10;\\rm esc}-|{\\boldsymbol{\\rm v}}|)\\,,\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mo>/</mo><msub><mi>v</mi><mn>0</mn></msub></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>v</mi><mi>esc</mi><mn>2</mn></msubsup><mo>-</mo><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mi>p</mi></msup></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>v</mi><mi>esc</mi></msub><mo>-</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwith free parameters $v_0$ and $k$.\n\n\\end{itemize}\n\nThe normalisation of all the fitting functions is such that the 1D integral in\nvelocity space of $f(|{\\boldsymbol{\\rm v}}|)$ is equal to 1 (integrated from 0 to $v_{\\rm esc}$ ).\n\nWe perform the fit to the velocity modulus distributions of the simulated haloes with\nthe above fitting functions, by minimising the $\\chi^2$ function:\n\n", "itemtype": "equation", "pos": 33268, "prevtext": "\nwith free parameters $v_0$ and $p$.\n\n\\item The velocity modulus distribution proposed by Lisanti {\\it et al.}~\\cite{Lisanti:2010qx}:\n\n", "index": 7, "text": "\\begin{equation} \\label{eq:Lisanti}\nf(|{\\boldsymbol{\\rm v}}|) \\propto |{\\boldsymbol{\\rm v}}|^2  \\exp[ ( v_{\\rm esc}^2 -  |{\\boldsymbol{\\rm v}}|^2) / (k \\, v_0^2) - 1 ]^k  ~\\Theta (v_{\\rm esc} -  |{\\boldsymbol{\\rm v}}| )\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"f(|{\\boldsymbol{\\rm v}}|)\\propto|{\\boldsymbol{\\rm v}}|^{2}\\exp[(v_{\\rm esc}^{2%&#10;}-|{\\boldsymbol{\\rm v}}|^{2})/(k\\,v_{0}^{2})-1]^{k}~{}\\Theta(v_{\\rm esc}-|{%&#10;\\boldsymbol{\\rm v}}|)\\,,\" display=\"block\"><mrow><mi>f</mi><mrow><mo stretchy=\"false\">(</mo><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mo stretchy=\"false\">|</mo><mi>𝐯</mi><msup><mo stretchy=\"false\">|</mo><mn>2</mn></msup><mi>exp</mi><mpadded width=\"+3.3pt\"><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>v</mi><mi>esc</mi><mn>2</mn></msubsup><mo>-</mo><mo stretchy=\"false\">|</mo><mi>𝐯</mi><msup><mo stretchy=\"false\">|</mo><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mpadded width=\"+1.7pt\"><mi>k</mi></mpadded><msubsup><mi>v</mi><mn>0</mn><mn>2</mn></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><mn>1</mn><mo stretchy=\"false\">]</mo></mrow><mi>k</mi></msup></mpadded><mi mathvariant=\"normal\">Θ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>esc</mi></msub><mo>-</mo><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwhere $y_i$ is value of the velocity modulus distribution at the velocity $v_i$,\n$\\sigma_i$ is the corresponding 1$\\sigma$ Poisson error, $N$ is the number of data\npoints in the speed distribution (determined by the number of bins in speed which is 24 -- 32 \ndepending on the halo in the hydrodynamic simulations), and ${\\boldsymbol{\\rm p}}$ are the free parameters determined by the minimisation\nprocedure.  The local Galactic escape speed, $v_{\\rm esc}$, is a fixed parameter and as explained\nabove it is determined for each simulated halo from the total mass enclosed in a\nsphere of radius 7 kpc, thus representing an upper limit on the escape speed at the Solar circle.\n\n\nAs can be seen from tables \\ref{tab:fvfit} and \\ref{tab:fvfitDMO} in Appendix~\\ref{app:fits}, the Maxwellian\ndistribution with a free peak ($\\alpha=1$ in eq.~\\eqref{eq:genMax}) provides a better fit to most haloes in the hydrodynamic simulations compared to their DMO counterparts.\nHowever,  the other fitting functions which have one extra free parameter in general provide a slightly better fit to haloes in both the hydrodynamic and DMO simulations.  In particular, the Mao {\\it et al.} function~\\cite{Mao:2012hf}\nprovides the best fit for almost all haloes (except a few) for both the hydrodynamic and DMO cases. \n \n\n\nIn figure~\\ref{fig:scatter}, we show the distribution of the best-fit parameters and\ncompare the goodness of fit of the three fitting functions presented in\neqs.~\\eqref{eq:genMax}, \\eqref{eq:Mao}, and \\eqref{eq:Lisanti} for both\nhydrodynamic (left panels) and DMO simulations (right panels). In each panel the\nresults are shown for the 12 {{\\sc eagle}\\xspace} HR and 2 {{\\sc apostle}\\xspace} IR MW-like haloes. The function\nproposed by Mao {\\it et al.}~\\cite{Mao:2012hf} (centre panels) fits both the\nhydrodynamic and DMO simulated haloes slightly better than the other fitting\nfunctions. There is no clear distinction in the goodness\nof fit values for DMO and hydrodynamic haloes. However, lower values for both the\nparameters $p$ and $v_0$ are preferred by the DMO haloes, while the fit to the\nhydrodynamic counterparts spans a wider range in the parameter space.\n\n\n\n\n\nThe generalized Maxwellian distribution (top panels) provides a better fit to the DMO\nsimulated haloes compared to the hydrodynamic haloes.\nThis is due to the fact that the local DM speed distributions of the DMO haloes are in general more symmetric around the peak than those obtained from the hydrodynamic haloes. Hence a generalized Maxwellian distribution can parametrize the  speed distribution of the DMO haloes rather well. However, the DM speed distributions of the hydrodynamic haloes have more asymmetry in the high speed tail, and this is better described by the Mao {\\it et al.}~\\cite{Mao:2012hf} fitting function. While DMO haloes prefer\nlow $\\alpha$ values (0.5 -- 1) and low $v_0$ (100 -- 220 km/s), most of the\nhydrodynamic haloes instead have larger best-fit parameters, $\\alpha$ in the range\n0.8 -- 1.2 and $v_0 >$ 190 km/s.\nAnalogous results are obtained when using the function proposed by Lisanti {\\it et\n  al.}~\\cite{Lisanti:2010qx} (bottom panels).  For completeness, we list the best\nfit parameters and reduced $\\chi^2$ values for all fitting functions  in\nAppendix~\\ref{app:fits}.\n\nAs we will discuss in section \\ref{sec:haloint}, the relevant quantity for predicting the event rates \nin direct detection experiments is the so-called ``halo integral\", which is the DM velocity distribution in the detector \nrest frame divided by the velocity and integrated over the DM velocity range relevant for direct detection. \nSince the halo integral is an integrated quantity, the local features and small fluctuations in the DM velocity distribution \ndo not affect the halo integral strongly. However, large fluctuations and the position of the peak of the velocity modulus distribution are especially relevant \nfor the halo integral. In particular, a larger peak speed of the velocity modulus distribution translates into a higher velocity tail of the halo integral.\nIn section \\ref{sec:haloint}, we will discuss how the halo integral for the best fit Maxwellian velocity distribution for each halo compares to the halo integral \ncomputed directly from the simulation for our selected haloes.\n\n\n\n\\subsection{Velocity distribution components}\n\\label{sec:vel-comp}\n\nWe next show the vertical, radial, and azimuthal components of the DM velocity\ndistribution in the Galactic rest frame.  Figures~\\ref{fig:fv-comp-EAGLE-HR} and\n\\ref{fig:fv-comp-APOSTLE-IR}  show the DM velocity distribution components for the\nsame two haloes shown in figure~\\ref{fig:fv} in the {{\\sc eagle}\\xspace} HR (haloes E3 and E12) and {{\\sc apostle}\\xspace} IR (haloes A1 and A2)\nhydrodynamic (left panels) and DMO (right panels) simulations, respectively.\n\n\nIt is clear from the three panels of figures~\\ref{fig:fv-comp-EAGLE-HR} and\n\\ref{fig:fv-comp-APOSTLE-IR} that the three components of the DM velocity distribution\nare not similar, and that there is a clear velocity anisotropy at the Solar\ncircle. In particular, the radial speed distribution is broader than the vertical and tangential distributions in the hydrodynamic case. Another prominent feature visible in the bottom left panel of\nfigure~\\ref{fig:fv-comp-EAGLE-HR}, is that the azimuthal component of the velocity\ndistribution for halo E12 (shown in green) is skewed towards positive $v_\\theta$,\nindicating a significant rotation of the DM particles along the Galactic disc. Note\nthat such a feature is not visible for the same halo in the DMO simulation (bottom\nright panel of figure~\\ref{fig:fv-comp-EAGLE-HR}). To quantify the features in the\ncomponents of the DM velocity distribution for all the MW analogues, we fit them with\nthe following fitting functions:\n\n\n\\begin{itemize} \n\n\\item A Gaussian function:\n\n", "itemtype": "equation", "pos": 33890, "prevtext": "\nwith free parameters $v_0$ and $k$.\n\n\\end{itemize}\n\nThe normalisation of all the fitting functions is such that the 1D integral in\nvelocity space of $f(|{\\boldsymbol{\\rm v}}|)$ is equal to 1 (integrated from 0 to $v_{\\rm esc}$ ).\n\nWe perform the fit to the velocity modulus distributions of the simulated haloes with\nthe above fitting functions, by minimising the $\\chi^2$ function:\n\n", "index": 9, "text": "\\begin{equation}\n\\chi^2({\\boldsymbol{\\rm p}}) \\equiv \\sum_i^N \\frac{(y_i - f(v_i, {\\boldsymbol{\\rm p}}))^2}{\\sigma_i^2} \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}({\\boldsymbol{\\rm p}})\\equiv\\sum_{i}^{N}\\frac{(y_{i}-f(v_{i},{%&#10;\\boldsymbol{\\rm p}}))^{2}}{\\sigma_{i}^{2}}\\,,\" display=\"block\"><mrow><mrow><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><mi>N</mi></munderover><mpadded width=\"+1.7pt\"><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>y</mi><mi>i</mi></msub><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>i</mi></msub><mo>,</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msubsup><mi>σ</mi><mi>i</mi><mn>2</mn></msubsup></mfrac></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwith free parameters $v_0$ and $\\mu$.\n\n\\item A generalized Gaussian function:\n\n", "itemtype": "equation", "pos": 39867, "prevtext": "\nwhere $y_i$ is value of the velocity modulus distribution at the velocity $v_i$,\n$\\sigma_i$ is the corresponding 1$\\sigma$ Poisson error, $N$ is the number of data\npoints in the speed distribution (determined by the number of bins in speed which is 24 -- 32 \ndepending on the halo in the hydrodynamic simulations), and ${\\boldsymbol{\\rm p}}$ are the free parameters determined by the minimisation\nprocedure.  The local Galactic escape speed, $v_{\\rm esc}$, is a fixed parameter and as explained\nabove it is determined for each simulated halo from the total mass enclosed in a\nsphere of radius 7 kpc, thus representing an upper limit on the escape speed at the Solar circle.\n\n\nAs can be seen from tables \\ref{tab:fvfit} and \\ref{tab:fvfitDMO} in Appendix~\\ref{app:fits}, the Maxwellian\ndistribution with a free peak ($\\alpha=1$ in eq.~\\eqref{eq:genMax}) provides a better fit to most haloes in the hydrodynamic simulations compared to their DMO counterparts.\nHowever,  the other fitting functions which have one extra free parameter in general provide a slightly better fit to haloes in both the hydrodynamic and DMO simulations.  In particular, the Mao {\\it et al.} function~\\cite{Mao:2012hf}\nprovides the best fit for almost all haloes (except a few) for both the hydrodynamic and DMO cases. \n \n\n\nIn figure~\\ref{fig:scatter}, we show the distribution of the best-fit parameters and\ncompare the goodness of fit of the three fitting functions presented in\neqs.~\\eqref{eq:genMax}, \\eqref{eq:Mao}, and \\eqref{eq:Lisanti} for both\nhydrodynamic (left panels) and DMO simulations (right panels). In each panel the\nresults are shown for the 12 {{\\sc eagle}\\xspace} HR and 2 {{\\sc apostle}\\xspace} IR MW-like haloes. The function\nproposed by Mao {\\it et al.}~\\cite{Mao:2012hf} (centre panels) fits both the\nhydrodynamic and DMO simulated haloes slightly better than the other fitting\nfunctions. There is no clear distinction in the goodness\nof fit values for DMO and hydrodynamic haloes. However, lower values for both the\nparameters $p$ and $v_0$ are preferred by the DMO haloes, while the fit to the\nhydrodynamic counterparts spans a wider range in the parameter space.\n\n\n\n\n\nThe generalized Maxwellian distribution (top panels) provides a better fit to the DMO\nsimulated haloes compared to the hydrodynamic haloes.\nThis is due to the fact that the local DM speed distributions of the DMO haloes are in general more symmetric around the peak than those obtained from the hydrodynamic haloes. Hence a generalized Maxwellian distribution can parametrize the  speed distribution of the DMO haloes rather well. However, the DM speed distributions of the hydrodynamic haloes have more asymmetry in the high speed tail, and this is better described by the Mao {\\it et al.}~\\cite{Mao:2012hf} fitting function. While DMO haloes prefer\nlow $\\alpha$ values (0.5 -- 1) and low $v_0$ (100 -- 220 km/s), most of the\nhydrodynamic haloes instead have larger best-fit parameters, $\\alpha$ in the range\n0.8 -- 1.2 and $v_0 >$ 190 km/s.\nAnalogous results are obtained when using the function proposed by Lisanti {\\it et\n  al.}~\\cite{Lisanti:2010qx} (bottom panels).  For completeness, we list the best\nfit parameters and reduced $\\chi^2$ values for all fitting functions  in\nAppendix~\\ref{app:fits}.\n\nAs we will discuss in section \\ref{sec:haloint}, the relevant quantity for predicting the event rates \nin direct detection experiments is the so-called ``halo integral\", which is the DM velocity distribution in the detector \nrest frame divided by the velocity and integrated over the DM velocity range relevant for direct detection. \nSince the halo integral is an integrated quantity, the local features and small fluctuations in the DM velocity distribution \ndo not affect the halo integral strongly. However, large fluctuations and the position of the peak of the velocity modulus distribution are especially relevant \nfor the halo integral. In particular, a larger peak speed of the velocity modulus distribution translates into a higher velocity tail of the halo integral.\nIn section \\ref{sec:haloint}, we will discuss how the halo integral for the best fit Maxwellian velocity distribution for each halo compares to the halo integral \ncomputed directly from the simulation for our selected haloes.\n\n\n\n\\subsection{Velocity distribution components}\n\\label{sec:vel-comp}\n\nWe next show the vertical, radial, and azimuthal components of the DM velocity\ndistribution in the Galactic rest frame.  Figures~\\ref{fig:fv-comp-EAGLE-HR} and\n\\ref{fig:fv-comp-APOSTLE-IR}  show the DM velocity distribution components for the\nsame two haloes shown in figure~\\ref{fig:fv} in the {{\\sc eagle}\\xspace} HR (haloes E3 and E12) and {{\\sc apostle}\\xspace} IR (haloes A1 and A2)\nhydrodynamic (left panels) and DMO (right panels) simulations, respectively.\n\n\nIt is clear from the three panels of figures~\\ref{fig:fv-comp-EAGLE-HR} and\n\\ref{fig:fv-comp-APOSTLE-IR} that the three components of the DM velocity distribution\nare not similar, and that there is a clear velocity anisotropy at the Solar\ncircle. In particular, the radial speed distribution is broader than the vertical and tangential distributions in the hydrodynamic case. Another prominent feature visible in the bottom left panel of\nfigure~\\ref{fig:fv-comp-EAGLE-HR}, is that the azimuthal component of the velocity\ndistribution for halo E12 (shown in green) is skewed towards positive $v_\\theta$,\nindicating a significant rotation of the DM particles along the Galactic disc. Note\nthat such a feature is not visible for the same halo in the DMO simulation (bottom\nright panel of figure~\\ref{fig:fv-comp-EAGLE-HR}). To quantify the features in the\ncomponents of the DM velocity distribution for all the MW analogues, we fit them with\nthe following fitting functions:\n\n\n\\begin{itemize} \n\n\\item A Gaussian function:\n\n", "index": 11, "text": "\\begin{equation}\nf(v_i) = \\frac{1}{\\sqrt{\\pi} v_0 } \\exp \\left[-(v_i - \\mu)^2/v_0^2 \\right] \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"f(v_{i})=\\frac{1}{\\sqrt{\\pi}v_{0}}\\exp\\left[-(v_{i}-\\mu)^{2}/v_{0}^{2}\\right]\\,,\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><msqrt><mi>π</mi></msqrt><mo>⁢</mo><msub><mi>v</mi><mn>0</mn></msub></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>v</mi><mi>i</mi></msub><mo>-</mo><mi>μ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><msubsup><mi>v</mi><mn>0</mn><mn>2</mn></msubsup></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwith free parameters $v_0$, $\\mu$, and $\\alpha$. \n\n\\end{itemize}\n\nThe functions are normalised such that the 1D integral in velocity space is equal to\nunity (integrated from -$\\infty$ to +$\\infty$).\n \nAdditionally, we fit the azimuthal component of the DM velocity distribution with a\ndouble Gaussian function: \n", "itemtype": "equation", "pos": 40058, "prevtext": "\nwith free parameters $v_0$ and $\\mu$.\n\n\\item A generalized Gaussian function:\n\n", "index": 13, "text": "\\begin{equation}\nf(v_i) = \\frac{1}{2 v_0 \\Gamma(1 + 1/(2 \\alpha))} \\exp \\left[ -\\left((v_i - \\mu)^2/v_0^2 \\right)^\\alpha \\right] \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"f(v_{i})=\\frac{1}{2v_{0}\\Gamma(1+1/(2\\alpha))}\\exp\\left[-\\left((v_{i}-\\mu)^{2}%&#10;/v_{0}^{2}\\right)^{\\alpha}\\right]\\,,\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><msub><mi>v</mi><mn>0</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>1</mn><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><msup><mrow><mo>(</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>v</mi><mi>i</mi></msub><mo>-</mo><mi>μ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><msubsup><mi>v</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo>)</mo></mrow><mi>α</mi></msup></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": " with free parameters\n$c_1, v_1, \\mu_1, v_2$, and $\\mu_2$; $c_2$ is instead constrained by requiring\n$f(v_\\theta)$ to be normalised to 1, $c_1 + c_2 = 1$.\n\nIn Appendix~\\ref{app:fits}, tables~\\ref{tab:fvfit_vr} and~\\ref{tab:fvfit_vz} we quote\nthe best-fit parameters for the Gaussian and generalized Gaussian fits to the radial\nand vertical velocity components for the selected MW-like haloes in the {{\\sc eagle}\\xspace} HR and\n{{\\sc apostle}\\xspace} IR hydrodynamic simulations.  In tables~\\ref{tab:fvfit_vtheta}\nand~\\ref{tab:fvfit_vtheta_double}, we present the best-fit parameters for the\nGaussian, generalized Gaussian and double Gaussian fits for the azimuthal component\nof the DM velocity distribution.  As for the distribution of the radial velocity\ncomponent, $v_r$, the fit indicates that the distribution is well described by a\ngeneralized Gaussian with $\\alpha \\approx 1$ (close to the Gaussian function) and a mean\nradial velocity that is always smaller than $\\approx 13$ km/s (and for most of the\nhaloes constrained between -5 km/s and +5 km/s).  Analogous are the conclusions for\nthe distribution of the vertical velocity component, $v_z$, which is generally peaked\nat values around $\\mu = 0$ km/s.  In the DMO counterparts of our selected haloes, both the radial and vertical velocity\ncomponent distributions peak around zero as well.  The distribution of the azimuthal velocity component,\n$v_\\theta$, is instead well fitted in most cases by either a Gaussian or a\ngeneralized Gaussian with an $\\alpha$ parameter generally smaller than 1 (but\nlarger than 0.6). The mean azimuthal\nspeed is typically higher in the case of the hydrodynamic simulation than the mean radial and vertical speeds. In particular, 4 haloes in\nthe {{\\sc eagle}\\xspace} HR simulation (E4, E7, E10, E12) and 1 in the {{\\sc apostle}\\xspace} IR simulation (A1) have a significant\nnon-zero mean azimuthal speed ($|\\mu|>20$~km/s). From these five haloes, 4 have\npositive mean speeds, while one halo is counter-rotating. When\nfitting the azimuthal velocity component with a generalized Gaussian, the same five\nhaloes show evidence of rotation ($|\\mu| > 3 \\sigma_\\mu$). \n\nTo evaluate if baryonic processes are responsible for the net rotation of the DM particles in the \ntangential direction in the torus, \nwe compare the azimuthal component of the velocity distribution for haloes in the hydrodynamic\nsimulations with their counterparts in the DMO simulations. For the four \nhaloes with positive mean azimuthal speeds with evidence of rotation in the hydrodynamic\nsimulations, we find\nthat their DMO counterparts do not show evidence of rotation at a comparable mean azimuthal speed.\nIn particular, for these four haloes, the mean of the best fit generalized Gaussian for the \nazimuthal velocity component in the hydrodynamic case is larger than the corresponding mean in the\nDMO case, \n$\\mu_{\\rm hydro} > \\mu_{\\rm DMO} + 3 \\sigma_{\\mu_{\\rm DMO}}$.\n\n\n\\begin{figure}[h]\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR-DMO.pdf}\\\\\n    \\vspace{5pt} \\includegraphics[width=0.49\\textwidth]{figs/fvrHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvrHR-DMO.pdf}\\\\\n  \\vspace{5pt}  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR-DMO.pdf}\n\\caption{\\label{fig:fv-comp-EAGLE-HR} Left panels: The vertical (top panel), radial\n  (middle panel), and azimuthal (bottom panel) components of the local DM velocity\n  distribution in the Galactic rest frame (data points with 1$\\sigma$ error bars) for\n  the two MW-like haloes in the {{\\sc eagle}\\xspace} HR simulation which have the closest (halo E12, shown in green)\n  and farthest (halo E3, shown in magenta) velocity modulus distribution compared to the SHM\n  Maxwellian. The best fit Gaussian and generalized Gaussian distributions are also\n  plotted as solid and dashed coloured lines, respectively. Right panels: Same as\n  left panels but for the corresponding DMO simulation.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzAPOSTLE-DMO.pdf}\\\\\n    \\vspace{5pt} \\includegraphics[width=0.49\\textwidth]{figs/fvrAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvrAPOSTLE-DMO.pdf}\\\\\n  \\vspace{5pt}  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaAPOSTLE-DMO.pdf}\n\\caption{\\label{fig:fv-comp-APOSTLE-IR} Same as figure~\\ref{fig:fv-comp-EAGLE-HR} but\n  for haloes A1 and A2 in the {{\\sc apostle}\\xspace} IR simulation.}\n\\end{center}\n\\end{figure}\n\n\n \nThe asymmetry in the azimuthal component of the DM velocity distribution and the\npositive mean tangential speed observed for some haloes in the hydrodynamic simulations \ncould be pointing to the\nexistence of a ``dark disc''. The dark disc forms when the stars and gas in the\nGalactic disc drag merging satellite galaxies towards the Galactic plane. These\nsatellites are then disrupted by tidal forces and their accreted material forms thick\nstellar and DM discs~\\cite{Read:2008fh}. Previous hydrodynamic simulations by Read\n{\\it et al.}~\\cite{Read:2009iv} have found that the density of the dark disc can be\n0.25 -- 1.5 times the halo density at $R_0=8$~kpc, and the rotation lag of the\ndark disc component is 0 -- 150 km$/$s compared to the stellar disc. Purcell {\\it et\n  al.}~\\cite{Purcell:2009yp} found instead that the contribution of accreted DM material\nto the disc at the Solar position is less than $\\approx 20\\%$ of the host halo density,\nand the fraction of DM particles rotating with a lag velocity less than 50 km$/$s\ncompared to the stellar disc is enhanced by less than $\\approx 30\\%$  compared to the\nSHM. The hydrodynamic simulation performed by Ling {\\it et al.}~\\cite{Ling:2009eh}\nshows instead a dark disc component co-rotating with the Galactic disc which\ncontributes $\\approx 25 \\%$ of the total local DM density, and has a mean lag\nvelocity of $\\approx 75$ km$/$s compared to the stellar disc. For the Eris hydrodynamic\nsimulation~\\cite{Kuhlen:2013tra} the dark disc contributes 9.1\\% of the\nDM density in the disc. Ref.~\\cite{Kuhlen:2013tra} quantifies the dark disc by computing the amount of\nmaterial in the disc accreted from satellites with positive azimuthal velocities, co-rotating with the stellar disc.\n\nWe stress here that a large simulation sample may be necessary to draw robust conclusions regarding the dark disc, since large halo-to-halo scatter in the results is very likely. The conclusions may also be sensitive to stochastic effects and to the \ntreatment of baryonic physics and so large samples, ideally drawn from \nsimulations with different plausible baryonic physics, are needed to reach \na definitive conclusion regarding the relevance of dark discs.\n\nThe implications of the dark disc for direct detection signals has been explored\nbefore~\\cite{Read:2009iv, Bruch:2008rx, Purcell:2009yp, Ling:2009eh,\n  Kuhlen:2013tra}. Depending on the density of the dark disc, the event rates in\ndirect detection experiments could be enhanced, especially in the low recoil energy\nrange. The annual modulation signal and its phase could also be altered. In\nparticular, depending on the lag velocity of the DM particles in the disc compared to\nthe stellar particles, the phase of the annual modulation could be shifted. However, most\nprevious simulations have shown that the increase in the local DM density due\nto the dark disc is relatively small~\\cite{Purcell:2009yp, Ling:2009eh,\n  Kuhlen:2013tra} and therefore that direct detection signals do not change significantly\ndue to the presence of a dark disc.\n\n\nTo assess whether a dark disc component might exist for any of our MW analogues, we\nextract the azimuthal velocity distribution of the star particles in the torus for\neach halo. We then fit the azimuthal components of both the DM and\nstellar velocity distributions with a double Gaussian. Our aim is to search for galaxies in which there is a  DM component rotating as fast as the stars. Among the four haloes in our sample which show evidence of rotation with significant positive mean azimuthal speed, only two haloes (E7 and E12) have a\nrotating DM component in the disc with mean velocity comparable (within 50 km$/$s) to that of the\nstars. The azimuthal component of the DM velocity distribution for the same two haloes in the DMO simulation is symmetric\naround zero. Notice that both the E7 and E12 galaxies don't have a prominent stellar disc, as defined in ref.~\\cite{Calore:2015oya}.\n\n\n\n\nThe two panels of figure~\\ref{fig:fv-comp-EAGLE-HR-DD} show the azimuthal components\nof the local DM (shown as black data points and $1\\sigma$ error bars) and stellar\n(orange data points and $1\\sigma$ error bars) velocity distributions for two MW-like\nhaloes (E12 and E7) in the {{\\sc eagle}\\xspace} HR simulation with comparable mean azimuthal velocities for the\nDM and stellar distributions. The left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}\ncorresponds to the same halo (E12) as shown in the bottom left panel of\nfigure~\\ref{fig:fv-comp-EAGLE-HR}. The black and orange solid lines show the best fit\ndouble Gaussian distribution to the DM and stellar azimuthal velocity distributions,\nrespectively. We can see from the left panel that there are two kinematically distinct structures in the azimuthal component of the stellar velocity distribution in the torus centered at 8 kpc. The structure with a negative mean azimuthal speed contains most of the mass and is also present in a torus centered at 5 kpc as well as a torus centered at 10 kpc. While the structure with a positive mean azimuthal speed which contains less mass is not present at radii smaller than the Solar position, and may be due to the accretion of a massive satellite into the disc region. Hence, this structure is likely a ``ring\" of stars, the relic of a ``ring\" of gas that accretes late in the formation of the galaxy. Such features are not infrequent in simulations of galaxy formation (see e.g.~\\cite{Algorry:2013xga}).\n\n\nIn the left (right) panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}, when fitting with a double Gaussian\ndistribution, the mean azimuthal velocity for the second Gaussian (with higher $\\mu$)\nis 136 km$/$s (88 km$/$s) for the DM distribution, and 171 km$/$s (81 km$/$s) for the\nstellar distribution. Thus, the differences in the second peak of the double Gaussian\nbetween the DM and stellar distributions are 35 km$/$s and 7 km$/$s, in the left and\nright panels, respectively. The fraction of the rotating component of the double\nGaussian DM distribution with the larger mean velocity is 32\\% and 43\\% in the left\nand right panels, respectively.\n\nIn summary, from a total of 14 MW-like haloes in our sample, evidence for a significant positive mean azimuthal speed, which is comparable\nfor DM and stars in the torus, exists only for two haloes, and this may hint at the existence of a co-rotating dark disc in those two haloes. Although the mechanism that has been proposed to produce a dark disc may be causing the features discussed for these two haloes, to draw such a conclusion one would need to follow the accretion history of massive satellites into the disc region, and this is beyond the scope of this paper. One instead can conclude that even in the case that the dark disc is responsible for such features, this is a relatively rare occurrence in our halo sample, occurring only in two out of 14 haloes. \nNotice also that the selection of our MW-like halo sample is unbiased with respect to the formation of a dark disc. \n\n\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR19-DMstars.pdf}\n    \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR8-DMstars.pdf}\n\\caption{\\label{fig:fv-comp-EAGLE-HR-DD} Azimuthal components of the local DM (black\n  data points with 1$\\sigma$ error bars) and stellar (orange data points with\n  1$\\sigma$ error bars) velocity distribution in the Galactic rest frame for the two\n  MW-like haloes in the {{\\sc eagle}\\xspace} HR simulation which have comparable peaks at positive\n  azimuthal speeds $v_\\theta$. Left panel: halo E12; right panel: halo E7. The best fit double Gaussian distributions to the DM\n  and stellar distributions are also plotted as solid black and orange lines,\n  respectively.}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\\section{Local dark matter density and halo shape}\n\\label{sec:DMdensity}\n\nThe fiducial value of the local DM density in the SHM is 0.3\nGeV$/$cm$^3$. By considering a large range of halo profiles and by constraining the mass\nmodel of the MW using global dynamical data sets, local DM densities in the range of\n(0.2 -- 0.6) GeV$/$cm$^3$ are obtained~\\cite{Catena:2009mf, Weber:2009pt,\n  McMillan:2011wd, Iocco:2011jz, Nesti:2013uwa, Sofue:2015xpa, Pato:2015dua}. Local estimates of\nthe DM density~\\cite{Salucci:2010qr, Smith:2011fs, Bovy:2012tw, Garbari:2012ff,\n  Zhang:2012rsb, Bovy:2013raa} are consistent with the global estimates, although\nthey have larger uncertainties.\n\nHere we extract the local DM density using the torus discussed in\nsection~\\ref{sec:veldist}. The average local DM density in the torus is $0.42 -\n0.73$~GeV$/$cm$^3$ for the 12 haloes in the {{\\sc eagle}\\xspace} HR simulation, and $0.41 -\n0.54$~GeV$/$cm$^3$ for the two haloes in the {{\\sc apostle}\\xspace} IR simulation. When splitting \nthe torus into smaller angular regions (8 regions for {{\\sc eagle}\\xspace} HR, and 16 regions for {{\\sc apostle}\\xspace} IR), we find that\nthe average DM density varies on average by $32\\%$ along the torus, a variation\nsmaller than the halo-to-halo scatter. Notice that the values we find for the local\nDM density are in agreement with the global and local estimates discussed above.\n\n\nTo determine if there is an enhancement of the local DM density in the Galactic disc\ncompared to the halo, we compare the average value of the local DM density in the\ntorus with the average value in a spherical shell at $7 < R < 9$~kpc. The average DM\ndensity in the shell is in the range $0.41 - 0.66$ GeV/cm$^3$ for the MW-like haloes\nin the {{\\sc eagle}\\xspace} HR simulation, and is 0.42 GeV/cm$^3$ for the two {{\\sc apostle}\\xspace} IR MW\nanalogues. From the 14 MW analogues in both simulations (12 in {{\\sc eagle}\\xspace} HR $+$ 2 in\n{{\\sc apostle}\\xspace} IR), the local DM density is higher by 2 -- 27\\% for 10 haloes compared to\nthe shell averaged value, while the enhancement is greater than 10\\% for five haloes, \nand greater than 20\\% for only two haloes. To evaluate if baryonic physics is responsible for this\nenhancement, we compare the average local DM density in an identical torus and  shell \nfor the same haloes in the DMO simulations. We find that two of the DMO counterparts (haloes E1 and E11)\nshow a similar increase of the DM density in the torus compared to the shell, which can be\ndue to the halo itself not being a perfect sphere. \n\nThe increase in the local DM density in the disc for some haloes could be due to\nthe DM halo contraction as a result of dissipational baryonic processes in the\nhydrodynamic simulations (See \\cite{Schaller:2015a} for a measure of dark halo\ncontraction in the {{\\sc eagle}\\xspace} galaxy formation model). Note that for the two haloes\ndiscussed in section \\ref{sec:vel-comp} which have a DM component co-rotating\nwith the stellar disc with a mean azimuthal speed comparable to that of the\nstars, the local DM density in the Galactic disc is 27\\% higher for halo E12\n(shown in the left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}) and 9\\% lower\nfor halo E7 (shown in the right panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD})\ncompared to the shell averaged value.\n\n\n\nTo further understand the effect of baryonic physics on the local DM density, we can\nstudy the shape of the inner ($<8$~kpc)  DM halo.\nWe first calculate the inertia tensor of the DM\nparticles within two different radii (5~kpc and 8~kpc). The resulting inertia tensor\nthen describes an ellipsoid with three axes of length $a\\ge b\\ge c$: these lengths\n provide information about the shape of the matter\ndistribution. We also repeat this process for the DMO counterparts to our {{\\sc eagle}\\xspace} HR\ngalaxy sample.\n\nWe first calculate the sphericity, $s=c/a$. If the matter\ndistribution is a perfect sphere, all three axes will have the same length, so $c=a$\nand thus sphericity $s=1$; a value of $s<1$ describes an increasing deviation from\nsphericity in our sample. We find for our galaxy sample that the sphericities at\n5~kpc cluster in the range $s=[0.85,0.95]$ and are typically lower by less than 10\\%\nat 8~kpc, thus haloes have a larger deviation from a sphere at larger radii. In both cases, however,\ndue to dissipational baryonic processes the DM sphericity is systematically higher in the hydrodynamic simulations\nthan is the case for the DMO runs, in which the range in $s$ is $[0.75,0.85]$. This\nresult is in agreement with earlier detailed simulations\n\\cite{Dubinski:1994,Bryan:2013} and reproduces what was found in higher resolution\nsimulations of the {{\\sc apostle}\\xspace} series \\cite{Schaller:2015c}.\n\nWhere there is a deviation from sphericity, this can be described using\nthe triaxiality parameter, $T$, which is defined as\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwith free parameters $v_0$, $\\mu$, and $\\alpha$. \n\n\\end{itemize}\n\nThe functions are normalised such that the 1D integral in velocity space is equal to\nunity (integrated from -$\\infty$ to +$\\infty$).\n \nAdditionally, we fit the azimuthal component of the DM velocity distribution with a\ndouble Gaussian function: \n", "index": 15, "text": "\\begin{equation} f(v_\\theta) = c_1 f_{\\rm 1, Gauss}(v_\\theta; v_1,\n\\mu_1) + c_2 f_{\\rm 2, Gauss}(v_\\theta; v_2, \\mu_2) \\, , \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"f(v_{\\theta})=c_{1}f_{\\rm 1,Gauss}(v_{\\theta};v_{1},\\mu_{1})+c_{2}f_{\\rm 2,%&#10;Gauss}(v_{\\theta};v_{2},\\mu_{2})\\,,\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>θ</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>c</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>f</mi><mrow><mn>1</mn><mo>,</mo><mi>Gauss</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>θ</mi></msub><mo>;</mo><msub><mi>v</mi><mn>1</mn></msub><mo>,</mo><msub><mi>μ</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>c</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>f</mi><mrow><mn>2</mn><mo>,</mo><mi>Gauss</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>θ</mi></msub><mo>;</mo><msub><mi>v</mi><mn>2</mn></msub><mo>,</mo><msub><mi>μ</mi><mn>2</mn></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nFor very oblate systems, $a\\approx b \\gg c$ and thus $T \\approx 0$, whereas for the opposite,\nprolate case $a\\gg b\\approx c$ and $T \\approx 1$. We find that there is little correlation in\nour galaxy sample between the values of $T$ at 5~kpc and 8~kpc, with both varying in\nthe range $[0.02,0.8]$. However, it should be noted that because these inner haloes\nare very close to spherical ($s=[0.81,0.96]$), the deviation towards either prolate or oblate\ndistributions is very small. By contrast, the DMO counterparts almost all have a\npreference for inner haloes that are prolate rather than oblate, with $T=[0.4,0.9]$\nat both radii for all of our candidates. We therefore conclude that spherical\nsymmetry is a very good approximation for our galaxy halo centres with little\ndependence on radius, and that this marks an important difference from DMO studies.\n\nFor halo E12 (shown in the left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}), which\nhas a local DM density in the torus enhanced by 27\\% compared to the shell averaged\nvalue, the triaxiality parameter $T=0.02$ at 8 kpc, which implies an\noblate halo, as expected. \n\n\n\n\n\n\n\\section{Direct detection signals}\n\\label{sec:signals}\n\n\\subsection{Event rates}\n\nWe consider a DM particle $\\chi$ scattering elastically off a nucleus with atomic mass\nnumber $A$ and atomic number $Z$, and depositing the nuclear recoil energy $E_R$ in\nthe detector. The differential rate (events per unit energy, per unit detector mass, per unit time) is given by\n\n\n", "itemtype": "equation", "pos": 57991, "prevtext": " with free parameters\n$c_1, v_1, \\mu_1, v_2$, and $\\mu_2$; $c_2$ is instead constrained by requiring\n$f(v_\\theta)$ to be normalised to 1, $c_1 + c_2 = 1$.\n\nIn Appendix~\\ref{app:fits}, tables~\\ref{tab:fvfit_vr} and~\\ref{tab:fvfit_vz} we quote\nthe best-fit parameters for the Gaussian and generalized Gaussian fits to the radial\nand vertical velocity components for the selected MW-like haloes in the {{\\sc eagle}\\xspace} HR and\n{{\\sc apostle}\\xspace} IR hydrodynamic simulations.  In tables~\\ref{tab:fvfit_vtheta}\nand~\\ref{tab:fvfit_vtheta_double}, we present the best-fit parameters for the\nGaussian, generalized Gaussian and double Gaussian fits for the azimuthal component\nof the DM velocity distribution.  As for the distribution of the radial velocity\ncomponent, $v_r$, the fit indicates that the distribution is well described by a\ngeneralized Gaussian with $\\alpha \\approx 1$ (close to the Gaussian function) and a mean\nradial velocity that is always smaller than $\\approx 13$ km/s (and for most of the\nhaloes constrained between -5 km/s and +5 km/s).  Analogous are the conclusions for\nthe distribution of the vertical velocity component, $v_z$, which is generally peaked\nat values around $\\mu = 0$ km/s.  In the DMO counterparts of our selected haloes, both the radial and vertical velocity\ncomponent distributions peak around zero as well.  The distribution of the azimuthal velocity component,\n$v_\\theta$, is instead well fitted in most cases by either a Gaussian or a\ngeneralized Gaussian with an $\\alpha$ parameter generally smaller than 1 (but\nlarger than 0.6). The mean azimuthal\nspeed is typically higher in the case of the hydrodynamic simulation than the mean radial and vertical speeds. In particular, 4 haloes in\nthe {{\\sc eagle}\\xspace} HR simulation (E4, E7, E10, E12) and 1 in the {{\\sc apostle}\\xspace} IR simulation (A1) have a significant\nnon-zero mean azimuthal speed ($|\\mu|>20$~km/s). From these five haloes, 4 have\npositive mean speeds, while one halo is counter-rotating. When\nfitting the azimuthal velocity component with a generalized Gaussian, the same five\nhaloes show evidence of rotation ($|\\mu| > 3 \\sigma_\\mu$). \n\nTo evaluate if baryonic processes are responsible for the net rotation of the DM particles in the \ntangential direction in the torus, \nwe compare the azimuthal component of the velocity distribution for haloes in the hydrodynamic\nsimulations with their counterparts in the DMO simulations. For the four \nhaloes with positive mean azimuthal speeds with evidence of rotation in the hydrodynamic\nsimulations, we find\nthat their DMO counterparts do not show evidence of rotation at a comparable mean azimuthal speed.\nIn particular, for these four haloes, the mean of the best fit generalized Gaussian for the \nazimuthal velocity component in the hydrodynamic case is larger than the corresponding mean in the\nDMO case, \n$\\mu_{\\rm hydro} > \\mu_{\\rm DMO} + 3 \\sigma_{\\mu_{\\rm DMO}}$.\n\n\n\\begin{figure}[h]\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR-DMO.pdf}\\\\\n    \\vspace{5pt} \\includegraphics[width=0.49\\textwidth]{figs/fvrHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvrHR-DMO.pdf}\\\\\n  \\vspace{5pt}  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR-DMO.pdf}\n\\caption{\\label{fig:fv-comp-EAGLE-HR} Left panels: The vertical (top panel), radial\n  (middle panel), and azimuthal (bottom panel) components of the local DM velocity\n  distribution in the Galactic rest frame (data points with 1$\\sigma$ error bars) for\n  the two MW-like haloes in the {{\\sc eagle}\\xspace} HR simulation which have the closest (halo E12, shown in green)\n  and farthest (halo E3, shown in magenta) velocity modulus distribution compared to the SHM\n  Maxwellian. The best fit Gaussian and generalized Gaussian distributions are also\n  plotted as solid and dashed coloured lines, respectively. Right panels: Same as\n  left panels but for the corresponding DMO simulation.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzAPOSTLE-DMO.pdf}\\\\\n    \\vspace{5pt} \\includegraphics[width=0.49\\textwidth]{figs/fvrAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvrAPOSTLE-DMO.pdf}\\\\\n  \\vspace{5pt}  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaAPOSTLE.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaAPOSTLE-DMO.pdf}\n\\caption{\\label{fig:fv-comp-APOSTLE-IR} Same as figure~\\ref{fig:fv-comp-EAGLE-HR} but\n  for haloes A1 and A2 in the {{\\sc apostle}\\xspace} IR simulation.}\n\\end{center}\n\\end{figure}\n\n\n \nThe asymmetry in the azimuthal component of the DM velocity distribution and the\npositive mean tangential speed observed for some haloes in the hydrodynamic simulations \ncould be pointing to the\nexistence of a ``dark disc''. The dark disc forms when the stars and gas in the\nGalactic disc drag merging satellite galaxies towards the Galactic plane. These\nsatellites are then disrupted by tidal forces and their accreted material forms thick\nstellar and DM discs~\\cite{Read:2008fh}. Previous hydrodynamic simulations by Read\n{\\it et al.}~\\cite{Read:2009iv} have found that the density of the dark disc can be\n0.25 -- 1.5 times the halo density at $R_0=8$~kpc, and the rotation lag of the\ndark disc component is 0 -- 150 km$/$s compared to the stellar disc. Purcell {\\it et\n  al.}~\\cite{Purcell:2009yp} found instead that the contribution of accreted DM material\nto the disc at the Solar position is less than $\\approx 20\\%$ of the host halo density,\nand the fraction of DM particles rotating with a lag velocity less than 50 km$/$s\ncompared to the stellar disc is enhanced by less than $\\approx 30\\%$  compared to the\nSHM. The hydrodynamic simulation performed by Ling {\\it et al.}~\\cite{Ling:2009eh}\nshows instead a dark disc component co-rotating with the Galactic disc which\ncontributes $\\approx 25 \\%$ of the total local DM density, and has a mean lag\nvelocity of $\\approx 75$ km$/$s compared to the stellar disc. For the Eris hydrodynamic\nsimulation~\\cite{Kuhlen:2013tra} the dark disc contributes 9.1\\% of the\nDM density in the disc. Ref.~\\cite{Kuhlen:2013tra} quantifies the dark disc by computing the amount of\nmaterial in the disc accreted from satellites with positive azimuthal velocities, co-rotating with the stellar disc.\n\nWe stress here that a large simulation sample may be necessary to draw robust conclusions regarding the dark disc, since large halo-to-halo scatter in the results is very likely. The conclusions may also be sensitive to stochastic effects and to the \ntreatment of baryonic physics and so large samples, ideally drawn from \nsimulations with different plausible baryonic physics, are needed to reach \na definitive conclusion regarding the relevance of dark discs.\n\nThe implications of the dark disc for direct detection signals has been explored\nbefore~\\cite{Read:2009iv, Bruch:2008rx, Purcell:2009yp, Ling:2009eh,\n  Kuhlen:2013tra}. Depending on the density of the dark disc, the event rates in\ndirect detection experiments could be enhanced, especially in the low recoil energy\nrange. The annual modulation signal and its phase could also be altered. In\nparticular, depending on the lag velocity of the DM particles in the disc compared to\nthe stellar particles, the phase of the annual modulation could be shifted. However, most\nprevious simulations have shown that the increase in the local DM density due\nto the dark disc is relatively small~\\cite{Purcell:2009yp, Ling:2009eh,\n  Kuhlen:2013tra} and therefore that direct detection signals do not change significantly\ndue to the presence of a dark disc.\n\n\nTo assess whether a dark disc component might exist for any of our MW analogues, we\nextract the azimuthal velocity distribution of the star particles in the torus for\neach halo. We then fit the azimuthal components of both the DM and\nstellar velocity distributions with a double Gaussian. Our aim is to search for galaxies in which there is a  DM component rotating as fast as the stars. Among the four haloes in our sample which show evidence of rotation with significant positive mean azimuthal speed, only two haloes (E7 and E12) have a\nrotating DM component in the disc with mean velocity comparable (within 50 km$/$s) to that of the\nstars. The azimuthal component of the DM velocity distribution for the same two haloes in the DMO simulation is symmetric\naround zero. Notice that both the E7 and E12 galaxies don't have a prominent stellar disc, as defined in ref.~\\cite{Calore:2015oya}.\n\n\n\n\nThe two panels of figure~\\ref{fig:fv-comp-EAGLE-HR-DD} show the azimuthal components\nof the local DM (shown as black data points and $1\\sigma$ error bars) and stellar\n(orange data points and $1\\sigma$ error bars) velocity distributions for two MW-like\nhaloes (E12 and E7) in the {{\\sc eagle}\\xspace} HR simulation with comparable mean azimuthal velocities for the\nDM and stellar distributions. The left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}\ncorresponds to the same halo (E12) as shown in the bottom left panel of\nfigure~\\ref{fig:fv-comp-EAGLE-HR}. The black and orange solid lines show the best fit\ndouble Gaussian distribution to the DM and stellar azimuthal velocity distributions,\nrespectively. We can see from the left panel that there are two kinematically distinct structures in the azimuthal component of the stellar velocity distribution in the torus centered at 8 kpc. The structure with a negative mean azimuthal speed contains most of the mass and is also present in a torus centered at 5 kpc as well as a torus centered at 10 kpc. While the structure with a positive mean azimuthal speed which contains less mass is not present at radii smaller than the Solar position, and may be due to the accretion of a massive satellite into the disc region. Hence, this structure is likely a ``ring\" of stars, the relic of a ``ring\" of gas that accretes late in the formation of the galaxy. Such features are not infrequent in simulations of galaxy formation (see e.g.~\\cite{Algorry:2013xga}).\n\n\nIn the left (right) panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}, when fitting with a double Gaussian\ndistribution, the mean azimuthal velocity for the second Gaussian (with higher $\\mu$)\nis 136 km$/$s (88 km$/$s) for the DM distribution, and 171 km$/$s (81 km$/$s) for the\nstellar distribution. Thus, the differences in the second peak of the double Gaussian\nbetween the DM and stellar distributions are 35 km$/$s and 7 km$/$s, in the left and\nright panels, respectively. The fraction of the rotating component of the double\nGaussian DM distribution with the larger mean velocity is 32\\% and 43\\% in the left\nand right panels, respectively.\n\nIn summary, from a total of 14 MW-like haloes in our sample, evidence for a significant positive mean azimuthal speed, which is comparable\nfor DM and stars in the torus, exists only for two haloes, and this may hint at the existence of a co-rotating dark disc in those two haloes. Although the mechanism that has been proposed to produce a dark disc may be causing the features discussed for these two haloes, to draw such a conclusion one would need to follow the accretion history of massive satellites into the disc region, and this is beyond the scope of this paper. One instead can conclude that even in the case that the dark disc is responsible for such features, this is a relatively rare occurrence in our halo sample, occurring only in two out of 14 haloes. \nNotice also that the selection of our MW-like halo sample is unbiased with respect to the formation of a dark disc. \n\n\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR19-DMstars.pdf}\n    \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR8-DMstars.pdf}\n\\caption{\\label{fig:fv-comp-EAGLE-HR-DD} Azimuthal components of the local DM (black\n  data points with 1$\\sigma$ error bars) and stellar (orange data points with\n  1$\\sigma$ error bars) velocity distribution in the Galactic rest frame for the two\n  MW-like haloes in the {{\\sc eagle}\\xspace} HR simulation which have comparable peaks at positive\n  azimuthal speeds $v_\\theta$. Left panel: halo E12; right panel: halo E7. The best fit double Gaussian distributions to the DM\n  and stellar distributions are also plotted as solid black and orange lines,\n  respectively.}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\\section{Local dark matter density and halo shape}\n\\label{sec:DMdensity}\n\nThe fiducial value of the local DM density in the SHM is 0.3\nGeV$/$cm$^3$. By considering a large range of halo profiles and by constraining the mass\nmodel of the MW using global dynamical data sets, local DM densities in the range of\n(0.2 -- 0.6) GeV$/$cm$^3$ are obtained~\\cite{Catena:2009mf, Weber:2009pt,\n  McMillan:2011wd, Iocco:2011jz, Nesti:2013uwa, Sofue:2015xpa, Pato:2015dua}. Local estimates of\nthe DM density~\\cite{Salucci:2010qr, Smith:2011fs, Bovy:2012tw, Garbari:2012ff,\n  Zhang:2012rsb, Bovy:2013raa} are consistent with the global estimates, although\nthey have larger uncertainties.\n\nHere we extract the local DM density using the torus discussed in\nsection~\\ref{sec:veldist}. The average local DM density in the torus is $0.42 -\n0.73$~GeV$/$cm$^3$ for the 12 haloes in the {{\\sc eagle}\\xspace} HR simulation, and $0.41 -\n0.54$~GeV$/$cm$^3$ for the two haloes in the {{\\sc apostle}\\xspace} IR simulation. When splitting \nthe torus into smaller angular regions (8 regions for {{\\sc eagle}\\xspace} HR, and 16 regions for {{\\sc apostle}\\xspace} IR), we find that\nthe average DM density varies on average by $32\\%$ along the torus, a variation\nsmaller than the halo-to-halo scatter. Notice that the values we find for the local\nDM density are in agreement with the global and local estimates discussed above.\n\n\nTo determine if there is an enhancement of the local DM density in the Galactic disc\ncompared to the halo, we compare the average value of the local DM density in the\ntorus with the average value in a spherical shell at $7 < R < 9$~kpc. The average DM\ndensity in the shell is in the range $0.41 - 0.66$ GeV/cm$^3$ for the MW-like haloes\nin the {{\\sc eagle}\\xspace} HR simulation, and is 0.42 GeV/cm$^3$ for the two {{\\sc apostle}\\xspace} IR MW\nanalogues. From the 14 MW analogues in both simulations (12 in {{\\sc eagle}\\xspace} HR $+$ 2 in\n{{\\sc apostle}\\xspace} IR), the local DM density is higher by 2 -- 27\\% for 10 haloes compared to\nthe shell averaged value, while the enhancement is greater than 10\\% for five haloes, \nand greater than 20\\% for only two haloes. To evaluate if baryonic physics is responsible for this\nenhancement, we compare the average local DM density in an identical torus and  shell \nfor the same haloes in the DMO simulations. We find that two of the DMO counterparts (haloes E1 and E11)\nshow a similar increase of the DM density in the torus compared to the shell, which can be\ndue to the halo itself not being a perfect sphere. \n\nThe increase in the local DM density in the disc for some haloes could be due to\nthe DM halo contraction as a result of dissipational baryonic processes in the\nhydrodynamic simulations (See \\cite{Schaller:2015a} for a measure of dark halo\ncontraction in the {{\\sc eagle}\\xspace} galaxy formation model). Note that for the two haloes\ndiscussed in section \\ref{sec:vel-comp} which have a DM component co-rotating\nwith the stellar disc with a mean azimuthal speed comparable to that of the\nstars, the local DM density in the Galactic disc is 27\\% higher for halo E12\n(shown in the left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}) and 9\\% lower\nfor halo E7 (shown in the right panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD})\ncompared to the shell averaged value.\n\n\n\nTo further understand the effect of baryonic physics on the local DM density, we can\nstudy the shape of the inner ($<8$~kpc)  DM halo.\nWe first calculate the inertia tensor of the DM\nparticles within two different radii (5~kpc and 8~kpc). The resulting inertia tensor\nthen describes an ellipsoid with three axes of length $a\\ge b\\ge c$: these lengths\n provide information about the shape of the matter\ndistribution. We also repeat this process for the DMO counterparts to our {{\\sc eagle}\\xspace} HR\ngalaxy sample.\n\nWe first calculate the sphericity, $s=c/a$. If the matter\ndistribution is a perfect sphere, all three axes will have the same length, so $c=a$\nand thus sphericity $s=1$; a value of $s<1$ describes an increasing deviation from\nsphericity in our sample. We find for our galaxy sample that the sphericities at\n5~kpc cluster in the range $s=[0.85,0.95]$ and are typically lower by less than 10\\%\nat 8~kpc, thus haloes have a larger deviation from a sphere at larger radii. In both cases, however,\ndue to dissipational baryonic processes the DM sphericity is systematically higher in the hydrodynamic simulations\nthan is the case for the DMO runs, in which the range in $s$ is $[0.75,0.85]$. This\nresult is in agreement with earlier detailed simulations\n\\cite{Dubinski:1994,Bryan:2013} and reproduces what was found in higher resolution\nsimulations of the {{\\sc apostle}\\xspace} series \\cite{Schaller:2015c}.\n\nWhere there is a deviation from sphericity, this can be described using\nthe triaxiality parameter, $T$, which is defined as\n\n\n", "index": 17, "text": "\\begin{equation}\n\tT = \\frac{a^2-b^2}{a^2-c^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"T=\\frac{a^{2}-b^{2}}{a^{2}-c^{2}}.\" display=\"block\"><mrow><mrow><mi>T</mi><mo>=</mo><mfrac><mrow><msup><mi>a</mi><mn>2</mn></msup><mo>-</mo><msup><mi>b</mi><mn>2</mn></msup></mrow><mrow><msup><mi>a</mi><mn>2</mn></msup><mo>-</mo><msup><mi>c</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nHere $\\rho_\\chi$ is the local DM density, $m_\\chi$ and $m_A$ are the DM and nucleus\nmasses, $\\sigma_A$ is the DM--nucleus scattering cross section and ${\\boldsymbol{\\rm v}}$ is the\n3-vector relative velocity between DM and the nucleus, while $v\\equiv\n|{\\boldsymbol{\\rm {v}}}|$. $\\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t)$ is the DM velocity distribution in the\ndetector rest frame normalised to unity, such that $\\int d^3 v \\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t) =1$. For the case of elastic scattering, the\nminimum speed $v_{\\rm min}$ required for a DM particle to deposit a recoil energy\n$E_R$ in the detector is given by \n", "itemtype": "equation", "pos": 59549, "prevtext": "\n\nFor very oblate systems, $a\\approx b \\gg c$ and thus $T \\approx 0$, whereas for the opposite,\nprolate case $a\\gg b\\approx c$ and $T \\approx 1$. We find that there is little correlation in\nour galaxy sample between the values of $T$ at 5~kpc and 8~kpc, with both varying in\nthe range $[0.02,0.8]$. However, it should be noted that because these inner haloes\nare very close to spherical ($s=[0.81,0.96]$), the deviation towards either prolate or oblate\ndistributions is very small. By contrast, the DMO counterparts almost all have a\npreference for inner haloes that are prolate rather than oblate, with $T=[0.4,0.9]$\nat both radii for all of our candidates. We therefore conclude that spherical\nsymmetry is a very good approximation for our galaxy halo centres with little\ndependence on radius, and that this marks an important difference from DMO studies.\n\nFor halo E12 (shown in the left panel of figure~\\ref{fig:fv-comp-EAGLE-HR-DD}), which\nhas a local DM density in the torus enhanced by 27\\% compared to the shell averaged\nvalue, the triaxiality parameter $T=0.02$ at 8 kpc, which implies an\noblate halo, as expected. \n\n\n\n\n\n\n\\section{Direct detection signals}\n\\label{sec:signals}\n\n\\subsection{Event rates}\n\nWe consider a DM particle $\\chi$ scattering elastically off a nucleus with atomic mass\nnumber $A$ and atomic number $Z$, and depositing the nuclear recoil energy $E_R$ in\nthe detector. The differential rate (events per unit energy, per unit detector mass, per unit time) is given by\n\n\n", "index": 19, "text": "\\begin{equation} \\label{rate}\n\\frac{d R}{d E_R} = \\frac{\\rho_\\chi}{m_\\chi} \\frac{1}{m_A}\\int_{v>v_{\\rm min}}d^3 v \\frac{d\\sigma_A}{d{E_R}} v \\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\frac{dR}{dE_{R}}=\\frac{\\rho_{\\chi}}{m_{\\chi}}\\frac{1}{m_{A}}\\int_{v&gt;v_{\\rm min%&#10;}}d^{3}v\\frac{d\\sigma_{A}}{d{E_{R}}}v\\tilde{f}_{\\rm det}({\\boldsymbol{\\rm v}},%&#10;t).\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>R</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac><mo>=</mo><mrow><mfrac><msub><mi>ρ</mi><mi>χ</mi></msub><msub><mi>m</mi><mi>χ</mi></msub></mfrac><mo>⁢</mo><mfrac><mn>1</mn><msub><mi>m</mi><mi>A</mi></msub></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>v</mi><mo>&gt;</mo><msub><mi>v</mi><mi>min</mi></msub></mrow></msub><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>v</mi><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>A</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac><mo>⁢</mo><mi>v</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">~</mo></mover><mi>det</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\nwhere $\\mu_{\\chi A}=m_\\chi m_A/(m_\\chi + m_A)$ is the reduced mass of the DM and nucleus.\n\nThe differential cross section is in general a sum of spin-independent and\nspin-dependent contributions.  Here we only consider the case of spin-independent\nscattering and assume equal couplings of DM to protons and neutrons.\nIn this case the differential cross section is\n\n\n", "itemtype": "equation", "pos": 60382, "prevtext": "\n\nHere $\\rho_\\chi$ is the local DM density, $m_\\chi$ and $m_A$ are the DM and nucleus\nmasses, $\\sigma_A$ is the DM--nucleus scattering cross section and ${\\boldsymbol{\\rm v}}$ is the\n3-vector relative velocity between DM and the nucleus, while $v\\equiv\n|{\\boldsymbol{\\rm {v}}}|$. $\\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t)$ is the DM velocity distribution in the\ndetector rest frame normalised to unity, such that $\\int d^3 v \\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t) =1$. For the case of elastic scattering, the\nminimum speed $v_{\\rm min}$ required for a DM particle to deposit a recoil energy\n$E_R$ in the detector is given by \n", "index": 21, "text": "\\begin{equation} v_{\\rm min}=\\sqrt{\\frac{m_A E_R}{2 {\\mu_{\\chi\n        A}^2}}},\n\\label{eq:vm}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"v_{\\rm min}=\\sqrt{\\frac{m_{A}E_{R}}{2{\\mu_{\\chi A}^{2}}}},\" display=\"block\"><mrow><mrow><msub><mi>v</mi><mi>min</mi></msub><mo>=</mo><msqrt><mfrac><mrow><msub><mi>m</mi><mi>A</mi></msub><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>μ</mi><mrow><mi>χ</mi><mo>⁢</mo><mi>A</mi></mrow><mn>2</mn></msubsup></mrow></mfrac></msqrt></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nwhere $\\sigma_{\\rm SI}$ is the spin-independent DM--nucleon scattering cross section,\n$\\mu_{\\chi p}$ is the reduced mass of the DM--nucleon system, and $F(E_R)$ is a\nform factor for which we use the expression from Helm~\\cite{Helm:1956zz}.\n\n\n\nThe DM velocity distribution is usually given in the Galactic rest frame, and to\ncalculate the event rate in Eq.~\\eqref{eq:Reta}, one has to transform the velocity\ndistribution from the Galactic rest frame to the rest frame of the detector, by\n\n\n", "itemtype": "equation", "pos": 60856, "prevtext": "\nwhere $\\mu_{\\chi A}=m_\\chi m_A/(m_\\chi + m_A)$ is the reduced mass of the DM and nucleus.\n\nThe differential cross section is in general a sum of spin-independent and\nspin-dependent contributions.  Here we only consider the case of spin-independent\nscattering and assume equal couplings of DM to protons and neutrons.\nIn this case the differential cross section is\n\n\n", "index": 23, "text": "\\begin{align}\n  \\frac{d\\sigma_A}{dE_R} = \\frac{m_A A^2}{2\\mu_{\\chi p}^2 v^2} {\\sigma_{\\rm SI}} F^2(E_R) \\,, \n  \\label{eq:dsigmadE}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{d\\sigma_{A}}{dE_{R}}=\\frac{m_{A}A^{2}}{2\\mu_{\\chi p}^{2}v^{%&#10;2}}{\\sigma_{\\rm SI}}F^{2}(E_{R})\\,,\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>A</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac></mstyle><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>m</mi><mi>A</mi></msub><mo>⁢</mo><msup><mi>A</mi><mn>2</mn></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>μ</mi><mrow><mi>χ</mi><mo>⁢</mo><mi>p</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>v</mi><mn>2</mn></msup></mrow></mfrac></mstyle><mo>⁢</mo><msub><mi>σ</mi><mi>SI</mi></msub><mo>⁢</mo><msup><mi>F</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>R</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nwhere ${\\boldsymbol{\\rm {v}}}_e(t)$ is the velocity of the Earth with respect to the Sun, and\n${\\boldsymbol{\\rm v}}_s = {\\boldsymbol{\\rm v}}_c + {\\boldsymbol{\\rm v}}_{\\rm pec}$ is the velocity of the Sun in the Galactic rest frame.\nHere ${\\boldsymbol{\\rm v}}_c$ is the Sun's circular velocity (or Local Standard of Rest (LSR) velocity), and ${\\boldsymbol{\\rm v}}_{\\rm pec} \\approx (11.10,\n12.24, 7.25)$~km/s~\\cite{Schoenrich:2009bx} is the peculiar velocity of the Sun with respect to\nthe LSR. For each simulated halo, we set ${\\boldsymbol{\\rm v}}_c = (0, v_\\star, 0)$, where\n$v_\\star$ is the local circular speed for that halo, rather than\nusing the fiducial value of $(0, 230, 0)$~km/s for the Sun's circular velocity. The\nvelocities are given in Galactic coordinates where the $x$-axis points towards the\nGalactic centre, the $y$-axis points in the direction of the Galactic rotation, and\nthe $z$-axis points to the North Galactic pole.\n\nThe velocity of the Earth with respect to the Sun, ${\\boldsymbol{\\rm {v}}}_e(t)$, causes the time\ndependence of the differential event rate, and can be written as\n\\cite{Gelmini:2000dm}\n\n\n", "itemtype": "equation", "pos": 61488, "prevtext": "\n\nwhere $\\sigma_{\\rm SI}$ is the spin-independent DM--nucleon scattering cross section,\n$\\mu_{\\chi p}$ is the reduced mass of the DM--nucleon system, and $F(E_R)$ is a\nform factor for which we use the expression from Helm~\\cite{Helm:1956zz}.\n\n\n\nThe DM velocity distribution is usually given in the Galactic rest frame, and to\ncalculate the event rate in Eq.~\\eqref{eq:Reta}, one has to transform the velocity\ndistribution from the Galactic rest frame to the rest frame of the detector, by\n\n\n", "index": 25, "text": "\\begin{equation}\n\\tilde f_{\\rm det} ({\\boldsymbol{\\rm v}}, t) = \\tilde f_{\\rm gal} ({\\boldsymbol{\\rm v}} + {\\boldsymbol{\\rm v}}_s + {\\boldsymbol{\\rm v}}_e (t)),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\tilde{f}_{\\rm det}({\\boldsymbol{\\rm v}},t)=\\tilde{f}_{\\rm gal}({\\boldsymbol{%&#10;\\rm v}}+{\\boldsymbol{\\rm v}}_{s}+{\\boldsymbol{\\rm v}}_{e}(t)),\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">~</mo></mover><mi>det</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">~</mo></mover><mi>gal</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐯</mi><mo>+</mo><msub><mi>𝐯</mi><mi>s</mi></msub><mo>+</mo><mrow><msub><mi>𝐯</mi><mi>e</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nassuming a circular orbit. Here $v_e=29.8$ km/s is the orbital speed of the Earth,\nand $\\lambda(t)=2\\pi(t-0.218)$ with $t$ in units of 1 year and $t=0$ on January\n1st. The orthogonal unit vectors ${\\boldsymbol{\\rm e}}_1$ and ${\\boldsymbol{\\rm e}}_2$ span the plane of the\nEarth's orbit, and are given by, ${\\boldsymbol{\\rm e}}_1 = (-0.0670,0.4927,-0.8676)$ and ${\\boldsymbol{\\rm e}}_2 =(-0.9931,-0.1170,0.01032)$ in Galactic coordinates.  For simplicity, we neglect\nthe small eccentricity of the Earth's orbit since Eq.~\\eqref{eq:ve} provides an\nexcellent approximation to describe the annual modulation signal~\\cite{Green:2003yh}.\n\n\n\n\n\n\n\\subsection{Halo integral}\n\\label{sec:haloint}\n\nThe astrophysical uncertainties in the event rate originate from the uncertainties in\nthe DM velocity distribution and density at the position of the Sun. Let us define\nthe halo integral as\n\n\n", "itemtype": "equation", "pos": 62792, "prevtext": "\n\nwhere ${\\boldsymbol{\\rm {v}}}_e(t)$ is the velocity of the Earth with respect to the Sun, and\n${\\boldsymbol{\\rm v}}_s = {\\boldsymbol{\\rm v}}_c + {\\boldsymbol{\\rm v}}_{\\rm pec}$ is the velocity of the Sun in the Galactic rest frame.\nHere ${\\boldsymbol{\\rm v}}_c$ is the Sun's circular velocity (or Local Standard of Rest (LSR) velocity), and ${\\boldsymbol{\\rm v}}_{\\rm pec} \\approx (11.10,\n12.24, 7.25)$~km/s~\\cite{Schoenrich:2009bx} is the peculiar velocity of the Sun with respect to\nthe LSR. For each simulated halo, we set ${\\boldsymbol{\\rm v}}_c = (0, v_\\star, 0)$, where\n$v_\\star$ is the local circular speed for that halo, rather than\nusing the fiducial value of $(0, 230, 0)$~km/s for the Sun's circular velocity. The\nvelocities are given in Galactic coordinates where the $x$-axis points towards the\nGalactic centre, the $y$-axis points in the direction of the Galactic rotation, and\nthe $z$-axis points to the North Galactic pole.\n\nThe velocity of the Earth with respect to the Sun, ${\\boldsymbol{\\rm {v}}}_e(t)$, causes the time\ndependence of the differential event rate, and can be written as\n\\cite{Gelmini:2000dm}\n\n\n", "index": 27, "text": "\\begin{equation}\\label{eq:ve}\n{\\boldsymbol{\\rm {v}}}_e(t) = v_e [{\\boldsymbol{\\rm {e}}}_1 \\sin\\lambda(t) - {\\boldsymbol{\\rm {e}}}_2\\cos\\lambda(t) ] \\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"{\\boldsymbol{\\rm{v}}}_{e}(t)=v_{e}[{\\boldsymbol{\\rm{e}}}_{1}\\sin\\lambda(t)-{%&#10;\\boldsymbol{\\rm{e}}}_{2}\\cos\\lambda(t)]\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>𝐯</mi><mi>e</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>v</mi><mi>e</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><msub><mi>𝐞</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>λ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>𝐞</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>λ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nThen from Eqs.~\\ref{rate} and \\ref{eq:dsigmadE}, the differential event rate can be written as\n\n\n", "itemtype": "equation", "pos": 63837, "prevtext": "\n\nassuming a circular orbit. Here $v_e=29.8$ km/s is the orbital speed of the Earth,\nand $\\lambda(t)=2\\pi(t-0.218)$ with $t$ in units of 1 year and $t=0$ on January\n1st. The orthogonal unit vectors ${\\boldsymbol{\\rm e}}_1$ and ${\\boldsymbol{\\rm e}}_2$ span the plane of the\nEarth's orbit, and are given by, ${\\boldsymbol{\\rm e}}_1 = (-0.0670,0.4927,-0.8676)$ and ${\\boldsymbol{\\rm e}}_2 =(-0.9931,-0.1170,0.01032)$ in Galactic coordinates.  For simplicity, we neglect\nthe small eccentricity of the Earth's orbit since Eq.~\\eqref{eq:ve} provides an\nexcellent approximation to describe the annual modulation signal~\\cite{Green:2003yh}.\n\n\n\n\n\n\n\\subsection{Halo integral}\n\\label{sec:haloint}\n\nThe astrophysical uncertainties in the event rate originate from the uncertainties in\nthe DM velocity distribution and density at the position of the Sun. Let us define\nthe halo integral as\n\n\n", "index": 29, "text": "\\begin{equation}\\label{eq:eta} \n\\eta(v_{\\rm min}, t) \\equiv \\int_{v > v_{\\rm mim}} d^3 v \\frac{\\tilde f_{\\rm det}({\\boldsymbol{\\rm v}}, t)}{v} \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\eta(v_{\\rm min},t)\\equiv\\int_{v&gt;v_{\\rm mim}}d^{3}v\\frac{\\tilde{f}_{\\rm det}({%&#10;\\boldsymbol{\\rm v}},t)}{v}\\,.\" display=\"block\"><mrow><mrow><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>min</mi></msub><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>v</mi><mo>&gt;</mo><msub><mi>v</mi><mi>mim</mi></msub></mrow></msub><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>v</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">~</mo></mover><mi>det</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>v</mi></mfrac></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nThe halo integral $\\eta (v_{\\rm min}, t)$, together with the local DM density\n$\\rho_\\chi$, encapsulates the astrophysics dependence of the event rate.\n\n\nThe top left panel of figure~\\ref{fig:eta} shows the time averaged halo integral\nas a function of the minimum velocity, $v_{\\rm min}$, for the two haloes with speed\ndistributions that are the closest to (halo E12), and the farthest from (halo E3), the SHM Maxwellian\n(specified with a solid black line) in the set of {{\\sc eagle}\\xspace} HR MW-like galaxies. The\nbottom left panel of the same figure shows the time averaged halo integral for\nthe two {{\\sc apostle}\\xspace} IR MW-like haloes. The right panels show the halo integral for the\nsame haloes in the left panels but in a DMO simulation. The coloured solid lines\nspecify the halo integral computed from the mean value of the velocity distribution,\nwhile the shaded band is obtained by adding and subtracting one standard deviation to\nthe mean velocity distribution. The halo integrals obtained from the best fit Maxwellian velocity \nmodulus distributions (eq.~\\eqref{eq:genMax} with $\\alpha=1$) are shown by dashed coloured lines with matching colours for each halo.\n \n \n \n \\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog-DMO.pdf}\\\\\n \\vspace{5pt}\\includegraphics[width=0.49\\textwidth]{figs/etaLGIRLog.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/etaLGIRLog-DMO.pdf}\n\\caption{\\label{fig:eta} Time averaged halo integrals (solid coloured lines) for the\n  the two haloes closest (halo E12 shown in green) and farthest (halo E3 shown in magenta) from the SHM Maxwellian in\n  the {{\\sc eagle}\\xspace} HR simulation (top left), and the two haloes (blue and red lines) in the\n  {{\\sc apostle}\\xspace} IR simulation (bottom left). The solid coloured lines and the shaded bands\n  correspond to the halo integrals obtained from the mean velocity distribution and\n  the velocity distribution at $\\pm 1\\sigma$ from the mean, respectively. The solid black line\n  specifies the halo integral for the SHM Maxwellian (with peak speed of 230 km/s), and \n  the dashed coloured lines specify the halo integral obtained from the best fit \n  Maxwellian velocity modulus distribution for each halo (with matching colours). The right\n  panels show the halo integrals for the same haloes in the corresponding left panel\n  but in a DMO simulation.}\n\\end{center}\n\\end{figure}\n\n\n\nFrom the left panels of figure~\\ref{fig:eta}, one can see that the halo-to-halo\nscatter in the halo integral is significant. There are MW-like haloes which have halo\nintegrals similar to the SHM Maxwellian, but there also exists MW\nanalogues with halo integrals that deviate from the SHM Maxwellian significantly at\nhigher minimum velocities. The effect is more evident for the {{\\sc eagle}\\xspace} HR sample, for\nwhich we have more haloes. Comparing to the DMO case, where the halo-to-halo\nscatter is less pronounced, one can conclude that baryons affect\nthe velocity distribution strongly at $R_0=8$~kpc, typically resulting in a shift\nof the tails of the halo integral to higher velocities with respect to the DMO case.\n\nThe difference between the halo integral of the simulated haloes in the hydrodynamic case and the SHM Maxwellian, which is more pronounced at relatively large $v_{\\rm min}$, is mainly due to the different \npeak speed of the DM velocity distribution of the simulated haloes compared to the 230 km$/$s assumed for the SHM Maxwellian. Indeed, \nthe halo integral for the best fit Maxwellian velocity distribution falls within the $1\\sigma$ \nuncertainty band of the halo integrals for all but two MW-like haloes in the hydrodynamic simulation. For those two haloes, there is only\na slight deviation between the halo integral for the best fit Maxwellian and the simulated halo at large $v_{\\rm min}$. \nThe range of the best fit $v_0$ parameter for the Maxwellian distribution is 223 -- 289 km$/$s in the hydrodynamic case, as can be seen in table \n\\ref{tab:fvfit} in Appendix~\\ref{app:fits}. \n\nOn the other hand, the shape of the DM velocity modulus distributions for the haloes in the DMO simulations are not well captured by the Maxwellian distribution with a free peak. For most haloes in the DMO case, there are large deficits at the peak, and an excess of particles at low and very high velocities compared to the best fit Maxwellian speed distribution. These large differences result in halo integrals of the simulated haloes which are quite different from the best fit Maxwellian halo integrals, as can be seen from the right panels of figure ~\\ref{fig:eta}. \n\n\n\n\n\\section{Results}\n\\label{sec:results}\n\nWe discuss below the details of the analysis of direct detection data using directly the local\nDM density and velocity distribution of the selected MW analogues. Our aim is to\ninvestigate how the allowed regions and exclusion limits set by different direct\ndetection experiments in the plane of DM mass and spin-independent cross section\nchange for our selected haloes compared to the SHM, and if the compatibility between\nthe hints for a DM signal and null-results improves.\n\n\n\n\\subsection{Data from direct detection experiments}\n\\label{sec:data}\n\nIn this section we discuss our analysis of the data from multiple direct detection\nexperiments. In particular, we consider the positive signals from\nDAMA/LIBRA~\\cite{Bernabei:2013xsa} (DAMA for short) and the silicon detectors in\nCDMS-II~\\cite{Agnese:2013rvf} (CDMS-Si for short), as well as the the null-results\nfrom the LUX~\\cite{Akerib:2013tjd} and SuperCDMS~\\cite{Agnese:2014aze} experiments.\n\n\n\n\\bigskip\n\n{\\bf DAMA}: The DAMA experiment observed an annual modulation signal at the\n9.3$\\sigma$ level over 14 annual cycles. We use the data on the annual modulation\namplitude given in figure~8 of ref.~\\cite{Bernabei:2013xsa} for the total cumulative\nexposure of 1.33 ton yr of DAMA/LIBRA-phase1 and DAMA/NaI. In our analysis, we\nconsider 12 bins in the signal region between 2 keVee and 8 keVee, above which the\ndata is consistent with zero modulation. For the quenching factors of Na and I, we\nuse $q_{\\rm Na}=0.3$ and $q_{\\rm I}=0.09$, respectively, as measured by the DAMA\ncollaboration~\\cite{Bernabei:1996vj}.\n\n\nOur analysis of the DAMA data is similar to the analyses in~\\cite{Fairbairn:2008gz,\n  Kopp:2009qt, Kopp:2011yr}. In particular, we construct a $\\chi^2$ function to fit\nthe DAMA data,\n\n\n", "itemtype": "equation", "pos": 64096, "prevtext": "\n\nThen from Eqs.~\\ref{rate} and \\ref{eq:dsigmadE}, the differential event rate can be written as\n\n\n", "index": 31, "text": "\\begin{equation}\\label{eq:Reta}\n\\frac{d R}{d E_R} = \\frac{\\rho_\\chi A^2 \\sigma_{\\rm SI}}{2 m_\\chi \\mu_{\\chi p}^2} \\, F^2(E_R) \\, \\eta(v_{\\rm min}, t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\frac{dR}{dE_{R}}=\\frac{\\rho_{\\chi}A^{2}\\sigma_{\\rm SI}}{2m_{\\chi}\\mu_{\\chi p}%&#10;^{2}}\\,F^{2}(E_{R})\\,\\eta(v_{\\rm min},t).\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>R</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>ρ</mi><mi>χ</mi></msub><mo>⁢</mo><msup><mi>A</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>σ</mi><mi>SI</mi></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>m</mi><mi>χ</mi></msub><mo>⁢</mo><msubsup><mi>μ</mi><mrow><mi>χ</mi><mo>⁢</mo><mi>p</mi></mrow><mn>2</mn></msubsup></mrow></mfrac></mpadded><mo>⁢</mo><msup><mi>F</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>R</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>min</mi></msub><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04707.tex", "nexttext": "\n\nwhere the sum is over the 12 energy bins, $A_i^{\\rm pred}$ is the predicted annual\nmodulation amplitude, while $A_i^{\\rm obs}$ and $\\sigma_i$ are the experimental data\npoints and their errors, respectively, from figure~8 of\nref.~\\cite{Bernabei:2013xsa}. To find the best fit, we minimize Eq.~(\\ref{eq:\n  DAMAchisq}) with respect to the DM mass $m_\\chi$, and spin-independent DM--nucleon\ncross section $\\sigma_{\\rm SI}$. The allowed regions in the $m_\\chi - \\sigma_{\\rm SI}\n$ plane at a given CL are obtained from contours of $\\chi^2\n(m_\\chi, \\sigma_{\\rm SI}) =\\chi^2_{\\rm min} + \\Delta \\chi^2 ({\\rm CL})$, where\n$\\Delta \\chi^2 ({\\rm CL})$ is evaluated for 2 degrees of freedom (dof), e.g., $\\Delta\n\\chi^2 (99.73 \\%) = 11.8$ and $\\Delta \\chi^2 (90\\%) = 4.6$.\n\n\n\\bigskip\n\n{\\bf CDMS-Si}: Three DM candidate events with recoil energies of 8.2, 9.5, and 12.3\nkeV were observed in the 140.2 kg day of data taken with the Si detectors of the\nCDMS-II experiment~\\cite{Agnese:2013rvf}. The total estimated background was 0.62\nevents in the recoil energy range of $[7,100]$ keV. Our analysis of the CDMS-Si data\nis analogous to the one presented in refs.~\\cite{Bozorgnia:2013pua,\n  Bozorgnia:2014gsa}. To include the background, we rescale the individual background\nspectra from ref.~\\cite{McCarthy}, such that 0.41, 0.13, and 0.08 events are expected\nfrom surface events, neutrons, and $^{206}$Pb, respectively. We assume an energy\nresolution of 0.3 keV and use the detector acceptance from\nref.~\\cite{Agnese:2013rvf}.\n\n\\bigskip\n\n{\\bf LUX}: The LUX experiment has presented the analysis of 85.3 live-days of\ndata~\\cite{Akerib:2013tjd}, which is consistent with the background-only\nhypothesis. Assuming the SHM, the LUX result is in strong tension with positive hints\nfrom DAMA and CDMS-Si. We use the maximum gap method~\\cite{Yellin:2002xd} to set\nexclusion limits, since with the available information we cannot reproduce the\nlikelihood analysis performed by the LUX collaboration.  We consider the region below\nthe mean of the Gaussian fit to the nuclear recoil calibration events (red solid\ncurve in figure~4 of \\cite{Akerib:2013tjd}) as signal region, and assume an\nacceptance of 0.5. Figure~4 of \\cite{Akerib:2013tjd} shows that one event at 3.1\nphotoelectrons falls on the red solid curve. Hence, in this analysis we assume zero\nevents make the cut. To find the relation between S1 and nuclear recoil energy $E_R$,\nwe use figure~4 of \\cite{Akerib:2013tjd} and find the value of S1 at the intersection\nof the mean nuclear recoil curve and each recoil energy contour. For the efficiency\nas a function of recoil energy, we interpolate the black points in figure~9 of\n\\cite{Akerib:2013tjd} for events with a corrected S1 between 2 and 30 photoelectrons\nand a S2 signal larger than 200 photoelectrons. We multiply the efficiency from\nfigure~9 of \\cite{Akerib:2013tjd} by 0.5 to find the total efficiency, and set it\nequal to zero below $E_R=3$ keV. Assuming the SHM with the Maxwellian velocity\ndistribution and parameters chosen as in \\cite{Akerib:2013tjd}, the 90\\% CL exclusion\nlimit we find agrees well with the limit set by the LUX collaboration.\n\n\\bigskip\n\n{\\bf SuperCDMS}: Eleven events in the recoil energy range of [1.6, 10] keV have been\nobserved by the SuperCDMS collaboration with an exposure of 577 kg day of data taken\nwith their Ge detectors~\\cite{Agnese:2014aze}. The collaboration sets a 90\\% CL on\nthe spin-independent DM--nucleon cross section of $1.2 \\times 10^{-42}$~cm$^2$ at a\nDM mass of 8 GeV. We employ the maximum gap method to set an upper limit on the cross\nsection.  We use the red curve in figure~1 of \\cite{Agnese:2014aze} for the detection\nefficiency as a function of recoil energy, and assume an energy resolution of 0.2\nkeV.\n\n\n\n\\subsection{DM parameter space}\n\nIn this section, we present our results for the exclusion limits and allowed regions\nin the DM mass and interaction cross section plane set by each direct detection\nexperiment discussed in section \\ref{sec:data} when assuming the DM distribution of\nthe simulated MW-like galaxies. Notice that we use directly the local DM density and velocity\ndistributions extracted from the simulations to perform the analysis of direct detection data.\n\n\nTo illustrate the effect of baryons on the interpretation of direct DM detection\nresults, we consider four benchmark haloes in the {{\\sc eagle}\\xspace} HR hydrodynamic simulation\nwhich satisfy our selection criteria: two haloes with the smallest (halo E6) and largest (halo E4) local\nDM densities, and two haloes with speed distributions closest (halo E12) and farthest (halo E3) from the SHM\nMaxwellian. The exclusion limits and allowed regions in the $m_\\chi$--$\\sigma_{\\rm SI}$ plane \nobtained assuming the DM distribution of these benchmark haloes encompass the range of results obtained assuming the DM distribution of all our MW-like analogues. For the {{\\sc apostle}\\xspace} IR simulation, we present the results for the two haloes\nwhich satisfy our selection criteria (haloes A1 and A2).\n\n\nThe top panels of figure~\\ref{fig:ExcLim-EagleHR-h1h2} show the allowed regions from\nthe DAMA and CDMS-Si experiments and exclusion limits from the LUX and SuperCDMS\nexperiments in the plane of DM mass and spin-independent cross section for these four\n{{\\sc eagle}\\xspace} HR benchmark haloes. In the left panel, the results are shown for the two\nhaloes with smallest (E6) and largest (E4) $\\rho_\\chi$, whereas in the right panel the results\nare shown for the two haloes with speed distributions closest (E12) and farthest (E3) from the\nSHM Maxwellian. The bottom panel shows the results for the same two haloes in the top\nright panel (E3 and E12), but setting the local DM density to 0.3 GeV$/$cm$^3$ for both\nhaloes, in order to isolate the effect induced by the deviation of the velocity\ndistribution from the SHM Maxwellian distribution.\n\n\nFor comparison, the allowed regions and exclusion limits assuming the SHM Maxwellian\n(with peak speed of 230 km$/$s) velocity distribution and a local DM density of 0.3\nGeV$/$cm$^3$ are shown in black. The shaded band in the exclusion limits and the\ntwo allowed regions of the same colour are obtained from the upper and lower\n1$\\sigma$ limits of the halo integrals.\n\nOne can see from figure~\\ref{fig:ExcLim-EagleHR-h1h2} that the general vertical shift of the\npreferred regions and exclusion limits with respect to the SHM at all DM masses is due to the\nvariation in the local DM density, whereas the shift at low DM masses is due to the\nhigh velocity tail of the DM distribution. For the halo with speed distribution farthest from the \nSHM Maxwellian (E3) and assuming a local DM density of 0.3 GeV$/$cm$^3$, the allowed regions \nand exclusion limits at low DM masses ($m_\\chi \\leq 10$~GeV) shift by a maximum of $\\sim 2$ GeV towards smaller DM masses (bottom panel of figure~\\ref{fig:ExcLim-EagleHR-h1h2}). When considering the local DM density extracted from simulations for each halo, \nall the regions and exclusion limits shift vertically at most by a factor of $\\sim 2 - 3$ in the scattering cross section compared to the SHM (see left panel of figure~\\ref{fig:ExcLim-EagleHR-h1h2}). This vertical shift is due to the different local DM densities of the simulated haloes compared to the SHM, which enters as a normalisation factor in the predicted recoil rate in direct detection experiments. \n\n\nIt is also clear from figure~\\ref{fig:ExcLim-EagleHR-h1h2} that the halo-to-halo\nscatter is larger than the 1$\\sigma$ uncertainty for each halo. Notice also that in general the\npreferred regions and exclusion limits all shift in the same direction, and thus the\ncompatibility between the results of different experiments is not improved for any\nof the simulated haloes.\n\nThe left panel of figure~\\ref{fig:ExcLim-LGIR} is the same as the top left panel of\nfigure~\\ref{fig:ExcLim-EagleHR-h1h2}, but for the two {{\\sc apostle}\\xspace} IR haloes (A1 and A2). The right\npanel shows the results for the same two haloes in the left panel but assuming a\nfixed local DM density of 0.3 GeV$/$cm$^3$ for both haloes. The same features\ndiscussed for the {{\\sc eagle}\\xspace} HR haloes are also visible for the {{\\sc apostle}\\xspace} IR haloes in\nfigure~\\ref{fig:ExcLim-LGIR}.\n\n\n\n\n\\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-EagleHR-h1.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-EagleHR-h2.pdf}\\\\\n    \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-EagleHR-h2-rhoMax.pdf}\n\\caption{\\label{fig:ExcLim-EagleHR-h1h2} Exclusion limits from LUX and SuperCDMS (at\n  90\\% CL) and preferred regions from DAMA (at 90\\% CL and 3$\\sigma$) and CDMS-Si (at\n  68\\% and 90\\% CL) in the spin-independent DM--nucleon cross section and DM mass\n  plane for two haloes in the {{\\sc eagle}\\xspace} HR run with the smallest (halo E6 shown in colour) and\n  largest (halo E4 shown in gray) $\\rho_{\\chi}$ (top left panel), and two haloes with\n  velocity distributions closest to (halo E12 shown in colour) and farthest from (halo E3 shown in gray) the\n  SHM Maxwellian (top right panel). The bottom panel shows the results for the same\n  two haloes in the top right panel (E3 and E12) but assuming $\\rho_\\chi=0.3$~GeV$/$cm$^3$ for the\n  two haloes instead of using the $\\rho_\\chi$ for each halo from the simulations. The shaded bands in the exclusion limits and the\ntwo adjacent allowed regions of the same colour are obtained from the upper and lower\n1$\\sigma$ limits of the halo integral for each halo. The\n  black exclusion limits and allowed regions correspond to the SHM Maxwellian. The\n  local $\\rho_{\\chi}$ is 0.42 and 0.73 GeV$/$cm$^3$ for the two haloes in the top\n  left panel, and it is 0.68 and 0.71 GeV$/$cm$^3$ for the two haloes in the top\n  right and bottom panels.\n}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-LGIR-Both.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-LGIR-rhoMax.pdf}\n\\caption{\\label{fig:ExcLim-LGIR} Same as figure~\\ref{fig:ExcLim-EagleHR-h1h2} but for\n  the two selected haloes (A1 and A2) in the {{\\sc apostle}\\xspace} IR simulation. Left panel: Using the\n  $\\rho_\\chi$ for each halo (0.41 and 0.54 GeV$/$cm$^3$) from the simulations. Right\n  panel: Assuming $\\rho_\\chi=0.3$~GeV$/$cm$^3$ for both haloes.}\n\\end{center}\n\\end{figure}\n\n\n\n \n\\section{Conclusions}\n\\label{sec:summary}\n\nIn this work we have studied the predictions of the set of cosmological,\nhydrodynamic simulations of the {{\\sc eagle}\\xspace}~\\cite{Schaye:2015,Crain:2015} and\n{{\\sc apostle}\\xspace}~\\cite{Sawala:2015,Fattahi:2015} projects for DM direct\ndetection. Considering first all simulated haloes in the mass range $\\mathcal{O}(10^{12} - 10^{13}) \\, {{\\rm M}_\\odot}$, we applied two selection criteria for\nchoosing galaxies that are MW-like: (i) the rotation curve of the simulated\ngalaxy provides a good fit to the recent compilation of observed MW rotation\ncurves from ref.~\\cite{Iocco:2015xga}, and (ii) the stellar mass of the simulated\ngalaxy is within the $3\\sigma$ observed stellar mass range of the MW, $4.5\n\\times10^{10}<M_{*}/{{\\rm M}_\\odot}<8.3 \\times10^{10}$~\\cite{McMillan:2011wd}. We have\nshown that these two selection criteria are especially relevant for accurate\npredictions of the local DM density and velocity distribution, which are important\nquantities for investigating the implications for DM direct detection searches.\n\nFor our selected MW analogues (12 {{\\sc eagle}\\xspace} HR and 2 {{\\sc apostle}\\xspace} IR), we extracted the\nDM distributions and used them directly to perform an analysis of current dark\nmatter direct detection experiment data. In particular, we studied the\nimplications of the simulated MW-like haloes for direct detection considering\nthe allowed regions from DAMA~\\cite{Bernabei:2013xsa} and\nCDMS-Si~\\cite{Agnese:2013rvf} and exclusion limits from\nLUX~\\cite{Akerib:2013tjd} and SuperCDMS~\\cite{Agnese:2014aze} assuming\nspin-independent elastic scattering. We summarize our main findings below:\n\n\n\\begin{itemize}\n\n\\item Including baryons in the hydrodynamic simulation results in a shift of the\n  local DM velocity distributions to larger velocities compared to the DMO\n  simulations. This results in a shift in the tails of the halo integral\n  (eq.~\\eqref{eq:eta}) to higher velocities in the hydrodynamic compared to the\n  DMO simulations.\n  \n\\item The halo integrals obtained from the best fit Maxwellian velocity distribution for each halo fall\nwithin the $1\\sigma$ uncertainty band of the halo integrals obtained directly from the simulated velocity distributions for all but two\n  MW-like haloes in the hydrodynamic simulations. The range of the best fit peak speed for the Maxwellian velocity distribution is 223 -- 289 km$/$s.\n  The deviation in the best fit peak speed values from the SHM Maxwellian results in a shift of the halo integral tail at large velocities.   \n\n\n\\item Anisotropy in the DM velocity distribution is present at the Solar\n  circle. In particular, four haloes in our sample show evidence of rotation\n  with significant positive mean azimuthal speed ($\\mu > 20$~km$/$s), but only two of them have comparable mean\n  azimuthal speeds for DM and star particles. This may be hinting towards the existence of a dark disc for two out of 14 MW analogues.\n \n\\item The average local DM density in a torus aligned with the stellar disc and\n  at $7~{\\rm kpc}<R<9$~kpc and $|z|<1$~kpc is 0.41 -- 0.73 GeV$/$cm$^3$ for our\n  halo sample. Most haloes in our sample show an enhancement of the local DM\n  density in the torus compared to the spherical shell at the Solar circle\n  (with $7~{\\rm kpc}<R<9$~kpc). In particular, the local DM density in the torus\n  is enhanced by more than 10\\% for five haloes, and by more than 20\\% for\n  two haloes compared to the shell-averaged value.  Haloes in the hydrodynamic\n  simulation are in general more spherical compared to the DMO case. However, they are not\n  perfect spheres, and  are typically slightly more oblate compared to their DMO counterparts.\n \n  \n\\item The variation in the local DM density from halo-to-halo causes the largest\n  shift in the exclusion limits and allowed regions set by different direct\n  detection experiments in the plane of DM mass and scattering cross section\n  compared to the SHM. Future data from space observatories such as Gaia can in\n  principle set stringent constraints on the value of the local DM density, and\n  such constraints could be used in future numerical simulations.\n  \n\\item The shift in the tail of the halo integral to higher minimum velocities compared to\n  the SHM Maxwellian for some haloes results in a shift of a few GeV at low DM\n  masses in the allowed regions and exclusion limits.\n\n\\item The overall shift in all regions and exclusion limits due to the different\n  local DM distribution of the MW-like haloes compared to the SHM, occurs in the\n  same direction and compatibility between different experiments is not  improved.\n\n\n\\end{itemize}\n\nWe have therefore shown that, when baryons are included in the {{\\sc eagle}\\xspace} and {{\\sc apostle}\\xspace} high resolution hydrodynamic simulations in such a way that the main galaxy population properties are broadly reproduced, a Maxwellian velocity distribution with a most probable speed larger than the standard value assumed in the SHM describes well the local DM velocity distribution of simulated MW analogues. The local DM density obtained from the simulations is in agreement with global and local estimates.\n\n\n\\subsection*{Acknowledgements}\n\nWe thank Christopher McCabe and Cristoph Weniger for useful discussions on the results of this work. We especially thank Fabio Iocco and Miguel Pato for providing the extensive compilation of rotation curve \nmeasurements used in this paper. G.B. (P.I.) and N.B.~acknowledge support from the European Research Council\nthrough the ERC starting grant WIMPs Kairos. The research of F.C. is part of the VIDI research programme ``Probing the Genesis of Dark Matter\", which is financed by the Netherlands Organisation for Scientific Research (NWO). This work is part of the\nD-ITP consortium, a program of the NWO that is funded by the Dutch Ministry of Education, Culture and Science (OCW). This work was supported by the Science and Technology Facilities Council (grant\nnumber ST/F001166/1); European Research Council (grant numbers GA 267291 ``Cosmiway''\nand GA 278594 ``GasAroundGalaxies'') and by the Interuniversity Attraction Poles\nProgramme initiated by the Belgian Science Policy Office (AP P7/08 CHARM).  R.A.C.~is\na Royal Society Research Fellow.\\\\\nThis work used the DiRAC Data Centric system at Durham University, operated by\nthe Institute for Computational Cosmology on behalf of the STFC DiRAC HPC\nFacility (\\url{www.dirac.ac.uk}). This equipment was funded by BIS National\nE-infrastructure capital grant ST/K00042X/1, STFC capital grant ST/H008519/1,\nand STFC DiRAC Operations grant ST/K003267/1 and Durham University. DiRAC is\npart of the National E-Infrastructure.  We acknowledge PRACE for awarding us\naccess to the Curie machine based in France at TGCC, CEA,\nBruy\\`eres-le-Ch\\^atel. \nThis work makes use of PyMinuit\\footnote{\\url{http://code.google.com/p/pyminuit}}. \n\n\n\n\n\n\n\\clearpage\n\n\\appendix\n\n\\section{Alternative selection of Milky Way analogues}\n\\label{app:criteria}\n\nIn this appendix we present the velocity distributions and halo integrals for the two\nhaloes in the {{\\sc eagle}\\xspace} HR simulation that satisfy all three selection criteria\ndiscussed in section~\\ref{sec:selection}. These two haloes contain a substantial disc\ncomponent, in addition to satisfying criteria (i) and (ii).\n\nIn figure~\\ref{fig:fv-EAGLE-HR-all}, we show the local DM velocity modulus\ndistribution in the Galactic rest frame for the two haloes (E9 and E11) satisfying criteria (i),\n(ii), and (iii) in the {{\\sc eagle}\\xspace} HR hydrodynamic simulation (left panel) and DMO\nsimulation (right panel). The SHM Maxwellian with peak speed of 230 km$/$s (solid black line), as well as the best\nfit Maxwellian distributions (dashed coloured lines) are also shown for\ncomparison. The velocity distributions are not well fit by the SHM Maxwellian and\nare instead best fitted by the empirical fitting function of Mao {\\it et\n  al.}~\\cite{Mao:2012hf} (eq.~\\eqref{eq:Mao}). The best fit parameters in\neq.~\\eqref{eq:Mao} are $v_0=250$~km$/$s and $p=3.1$ with a reduced $\\chi^2$ of 1.6\nfor the best fit halo (E11), and $v_0=394$~km$/$s, and $p=4.8$ with a reduced $\\chi^2$ of\n2.6 for the other halo (E9). By comparing the two panels of \nfigure~\\ref{fig:fv-EAGLE-HR-all}, one observes that the peak of the\ndistributions in the DMO simulation is shifted to smaller velocities compared to the\nhydrodynamic case.\n\nFigure~\\ref{fig:fv-comp-EAGLE-HR-all} shows the components of the DM velocity\ndistribution for the same two haloes in the hydrodynamic (left panels) and DMO (right\npanels) simulations. The best fit Gaussian and generalized Gaussian distributions are\nalso shown as solid and dashed coloured lines, respectively. The generalized Gaussian\ndistribution gives the best fit to the radial and vertical components of the DM\nvelocity distribution, while the double Gaussian gives a slightly better fit to the\nazimuthal velocity distribution (for a few haloes there is evidence for overfitting\nmeaning that there is too much freedom in the fitting function). The two haloes do\nnot have a significant non-zero mean azimuthal speed and hence there is no evidence\nfor a dark disc component.\n\nThe average DM density in the torus located at the Solar position is 0.44 -- 0.65\nGeV$/$cm$^3$ for the hydrodynamic case and 0.27 -- 0.53 GeV$/$cm$^3$ for the DMO\ncase.  While the average DM density in a shell centred at 8 kpc is 0.45 -- 0.63\nGeV$/$cm$^3$ for the hydrodynamic case, comparable to the DM density in the torus.\n\n\nIn figure~\\ref{fig:eta-EAGLE-HR-all} we show the time-averaged halo integrals\n(Eq.~\\ref{eq:eta}) as a function $v_{\\rm min}$ for the two haloes in the hydrodynamic\n(left panel) and DMO (right panel) simulations. The halo integrals computed from the\nmean value of the velocity distribution are shown by solid coloured lines, while the\nshaded bands are obtained by adding and subtracting $1\\sigma$ to the mean velocity\ndistribution. The halo integral for the SHM Maxwellian and the \nbest fit Maxwellian  are shown by solid black, and dashed \ncoloured lines for each halo (with matching colours), respectively. \nOne can see from the left panel that the dashed lines fall within the $1 \\sigma$ uncertainty band of the\nhalo integrals for both haloes in the hydrodynamic simulation. In the DMO simulation however, \nthe halo integrals deviate from the best fit Maxwellian at higher minimum velocities.\n\n\n\nFinally, in figure~\\ref{fig:ExcLim-EagleHR-all}, we use the DM distribution for the\ntwo haloes to analyse the data from direct detection experiments. The left panel of\nfigure~\\ref{fig:ExcLim-EagleHR-all} shows the allowed regions from DAMA and CDMS-Si\nand exclusion limits from LUX and SuperCDMS in the DM mass and spin-independent cross\nsection plane for the two haloes. In the right panel, we show the results for the\nsame two haloes in the left panel but assuming the value of 0.3 GeV$/$cm$^3$ for the\nlocal DM density of both haloes. The conclusions remain the same as before. Namely,\nwhen fixing the local DM density to the value assumed in the SHM, the shift in the\nexclusion limits at large DM masses disappears. The high velocity tail of the DM\ndistribution is responsible for the shift in the preferred regions and exclusion\nlimits at low DM masses. While the general shift with respect to the SHM at all\nmasses is due to the variation in the local DM density.\n\n\\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR-all.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHR-DMO-all.pdf}\\\\\n\\caption{\\label{fig:fv-EAGLE-HR-all} Same as figure~\\ref{fig:fv}, but for the two\n  haloes in the {{\\sc eagle}\\xspace} HR simulation (E9 shown in green and E11 shown in magenta) which satisfy all three selection criteria\n  discussed in section~\\ref{sec:selection}.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR-all.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvzHR-DMO-all.pdf}\\\\\n    \\vspace{5pt} \\includegraphics[width=0.49\\textwidth]{figs/fvrHR-all.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvrHR-DMO-all.pdf}\\\\\n  \\vspace{5pt}  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR-all.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvthetaHR-DMO-all.pdf}\n\\caption{\\label{fig:fv-comp-EAGLE-HR-all} Same as figure~\\ref{fig:fv-comp-EAGLE-HR},\n  but for the two haloes in the {{\\sc eagle}\\xspace} HR simulation which satisfy all three\n  selection criteria discussed in section~\\ref{sec:selection}.}\n\\end{center}\n\\end{figure}\n\n \\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog-all.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog-DMO-all.pdf}\\\\\n\\caption{\\label{fig:eta-EAGLE-HR-all} Same as figure~\\ref{fig:eta}, but for the two\n  haloes in the {{\\sc eagle}\\xspace} HR simulation which satisfy all three selection criteria\n  discussed in section~\\ref{sec:selection}.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-EagleHR-Both.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/ExcLim-EagleHR-rhoMax.pdf}\n\\caption{\\label{fig:ExcLim-EagleHR-all} Same as figure~\\ref{fig:ExcLim-LGIR} but for\n  the two haloes in the {{\\sc eagle}\\xspace} HR simulation which satisfy all three criteria.}\n\\end{center}\n\\end{figure}\n\n\n\n\\section{Dark matter velocity distribution}\n\\label{app:f(v)}\n\nIn figure~\\ref{fig:fvrho} we show the DM velocity modulus distributions in the\nGalactic rest frame for the haloes in the {{\\sc eagle}\\xspace} HR hydrodynamic simulation which\nsatisfy our selection criteria (i) and (ii) and have the smallest (halo E6) and largest (halo E4) local\nDM density in our halo sample, 0.42 and 0.73 GeV$/$cm$^3$, respectively. The local DM\ndensities in the torus for the same haloes in the DMO simulation are 0.49 and 0.46 GeV$/$cm$^3$,\nrespectively. The left panel of figure~\\ref{fig:fvrho} corresponds to the\nhydrodynamic case, while the right panel shows the results for the DMO case. The SHM\nMaxwellian (solid black line) and the best fit Maxwellians (dashed coloured lines)\nare also plotted for comparison.\n\n\n\\begin{figure}\n\\begin{center}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHRrho.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/fvEagleHRrho-DMO.pdf}\\\\\n\\caption{\\label{fig:fvrho} Same as figure~\\ref{fig:fv}, but for the two haloes in the\n  {{\\sc eagle}\\xspace} HR simulation with smallest (halo E6) and largest (halo E4) local DM density in the hydrodynamic\n  case (left panel), and their DMO counterparts (right panel).}\n\\end{center}\n\\end{figure}\n\n\n\n\\section{Best fit parameters for velocity distributions}\n\\label{app:fits}\n\n\nIn tables~\\ref{tab:fvfit} and~\\ref{tab:fvfitDMO} we quote the best fit parameters for\nthree fitting functions, eq.~\\eqref{eq:genMax} (with free parameter $\\alpha$, and\n$\\alpha=1$), eq.~\\eqref{eq:Mao}, and eq.~\\eqref{eq:Lisanti}, presented in\nsection~\\ref{sec:vel-Mod} to fit the DM velocity modulus distribution of the\nhydrodynamic and DMO haloes, respectively.\n\n\n\\begin{sidewaystable}\n\n    \\centering\n       \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n        \\hline\n      & \\multicolumn{2}{|c|}{Maxwellian} & \\multicolumn{3}{|c|}{Generalized Maxw.} & \\multicolumn{3}{|c|}{Mao {\\it et al.}} & \\multicolumn{3}{|c|}{Lisanti {\\it et al.}} \\\\\n      \\hline\n        Halo Name &  $v_0 \\,  [\\rm km/s]$ &  $\\tilde{\\chi}^2$ & $v_0 \\,  [\\rm km/s]$ & $\\alpha$ &  $\\tilde{\\chi}^2$ & $v_0 \\,  [\\rm km/s]$ & $p$  & $\\tilde{\\chi}^2$& $v_0 \\,  [\\rm km/s]$ & $k$  &  $\\tilde{\\chi}^2$ \\\\\n       \\hline\n      E1 & 287.73 & 3.77 & 189.56 & 0.68 & 1.05 & 154.48 & 3.18 & 1.03 & 287.73 & 0.03 & 3.90 \\\\\nE2 & 266.01 & 2.68 & 227.12 & 0.85 & 2.14 & 206.14 & 4.98 & 2.00 & 266.01 & 0.02 & 2.77 \\\\\nE3 & 288.64 & 1.47 & 294.02 & 1.02 & 1.51 & 267.35 & 3.76 & 0.82 & 296.49 & 1.86 & 1.26 \\\\\nE4 & 258.53 & 3.81 & 284.30 & 1.12 & 3.35 & 317.74 & 4.21 & 2.51 & 282.08 & 2.65 & 2.70 \\\\\nE5 & 249.99 & 4.39 & 277.30 & 1.13 & 4.10 & 408.10 & 5.79 & 2.81 & 321.47 & 4.80 & 3.39 \\\\\nE6 & 266.97 & 3.52 & 227.81 & 0.85 & 3.24 & 198.93 & 3.54 & 2.98 & 266.97 & 0.02 & 3.65 \\\\\nE7 & 270.84 & 3.67 & 254.67 & 0.93 & 3.68 & 240.96 & 3.69 & 3.87 & 270.96 & 0.77 & 3.81 \\\\\nE8 & 258.23 & 2.86 & 217.95 & 0.84 & 2.10 & 166.91 & 2.69 & 1.61 & 258.30 & 0.63 & 2.97 \\\\\nE9 & 248.81 & 4.19 & 288.70 & 1.20 & 3.73 & 393.63 & 4.82 & 2.58 & 342.49 & 4.36 & 3.05 \\\\\nE10 & 261.78 & 2.49 & 274.11 & 1.06 & 2.51 & 281.33 & 3.41 & 1.17 & 282.77 & 2.21 & 1.92 \\\\\nE11 & 262.27 & 2.77 & 279.94 & 1.08 & 2.67 & 250.06 & 3.14 & 1.57 & 276.42 & 1.87 & 2.10 \\\\\nE12 & 231.90 & 1.43 & 252.25 & 1.11 & 0.99 & 467.84 & 5.69 & 1.53 & 245.72 & 2.67 & 1.02 \\\\\n       \\hline\n       A1 & 222.93 & 3.74 & 212.25 & 0.95 & 3.73 & 186.32 & 3.29 & 2.02 & 224.89 & 0.54 & 3.40 \\\\\nA2 & 234.35 & 10.35 & 213.58 & 0.91 & 10.50 & 136.41 & 1.07 & 3.52 & 243.23 & 0.64 & 8.25 \\\\\n        \\hline\n    \\end{tabular}\n    \\caption{Best-fit parameters for the velocity modulus distribution of the selected galaxies in \n      the {{\\sc eagle}\\xspace} HR (E1 to E12) and {{\\sc apostle}\\xspace} IR (A1 and A2) simulations, adopting the three different\n      fitting functions explained in the main text (eqs.~\\eqref{eq:genMax}, \\eqref{eq:Mao}, \\eqref{eq:Lisanti}) and, additionally, a standard\n      Maxwellian distribution ($\\alpha$ fixed to 1 in eq.~\\eqref{eq:genMax}). Besides the best-fit parameters,\n      we quote the reduced $\\chi^2$, $\\tilde{\\chi}^2 \\equiv \\chi^2/(N - dof)$, where\n      $dof = 2$ for the three fitting functions and $dof = 1$ for the standard\n      Maxwellian. }\n    \\label{tab:fvfit}\n \n  \\end{sidewaystable}\n\n  \n \\begin{sidewaystable}\n\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n     \\hline\n      & \\multicolumn{2}{|c|}{Maxwellian} & \\multicolumn{3}{|c|}{Generalized Maxw.} & \\multicolumn{3}{|c|}{Mao {\\it et al.}} & \\multicolumn{3}{|c|}{Lisanti {\\it et al.}} \\\\\n      \\hline\n        Halo Name &  $v_0 \\,  [\\rm km/s]$ &  $\\tilde{\\chi}^2$ & $v_0 \\,  [\\rm km/s]$ & $\\alpha$ &  $\\tilde{\\chi}^2$ & $v_0 \\,  [\\rm km/s]$ & $p$  & $\\tilde{\\chi}^2$& $v_0 \\,  [\\rm km/s]$ & $k$  &  $\\tilde{\\chi}^2$ \\\\\n       \\hline\n      E1 DMO & 256.70 & 10.01 & 111.77 & 0.53 & 1.67 & 102.54 & 0.72 & 1.71 & 256.70 & 0.10 & 10.34 \\\\\nE2 DMO & 225.25 & 4.51 & 130.74 & 0.63 & 1.39 & 108.62 & 3.27 & 1.23 & 225.25 & 0.82 & 4.66 \\\\\nE3 DMO & 269.90 & 4.70 & 136.30 & 0.58 & 1.03 & 118.62 & 1.09 & 0.89 & 269.89 & 0.07 & 4.87 \\\\\nE4 DMO & 258.08 & 2.95 & 214.39 & 0.83 & 2.37 & 163.45 & 2.58 & 1.13 & 259.07 & 1.06 & 3.04 \\\\\nE5 DMO & 255.68 & 2.64 & 257.69 & 1.01 & 2.75 & 317.89 & 5.21 & 2.08 & 286.05 & 3.68 & 2.59 \\\\\nE6 DMO & 261.30 & 6.02 & 161.41 & 0.65 & 2.31 & 123.45 & 1.20 & 2.47 & 261.27 & 0.02 & 6.22 \\\\\nE7 DMO & 242.97 & 8.95 & 137.28 & 0.62 & 3.26 & 110.09 & 1.43 & 2.50 & 242.96 & 0.02 & 9.27 \\\\\nE8 DMO & 252.84 & 6.54 & 139.17 & 0.61 & 1.52 & 112.50 & 0.91 & 1.45 & 252.81 & 0.02 & 6.77 \\\\\nE9 DMO & 252.01 & 2.21 & 192.51 & 0.77 & 1.57 & 152.16 & 2.35 & 1.16 & 251.99 & 0.02 & 2.31 \\\\\nE10 DMO & 258.78 & 5.06 & 182.65 & 0.74 & 3.99 & 147.44 & 2.00 & 2.83 & 258.72 & 0.01 & 5.26 \\\\\nE11 DMO & 247.62 & 3.98 & 183.95 & 0.76 & 2.20 & 139.50 & 2.08 & 1.23 & 247.60 & 0.02 & 4.15 \\\\\nE12 DMO & 229.90 & 1.61 & 200.62 & 0.87 & 1.33 & 163.08 & 3.35 & 0.65 & 230.09 & 0.90 & 1.68 \\\\\n       \\hline\n      A1 DMO & 193.01 & 7.12 & 135.37 & 0.72 & 3.12 & 98.90 & 1.23 & 1.42 & 192.94 & 0.51 & 7.18 \\\\\nA2 DMO & 221.86 & 3.50 & 168.10 & 0.77 & 2.16 & 116.88 & 1.12 & 0.94 & 221.78 & 0.66 & 3.57 \\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Same as table~\\ref{tab:fvfit} for the corresponding DMO simulations.}\n    \\label{tab:fvfitDMO}\n\n  \\end{sidewaystable}\n\n\n\nIn tables~\\ref{tab:fvfit_vr} and~\\ref{tab:fvfit_vz} we present the best-fit\nparameters for the fit with Gaussian and generalized Gaussian functions to the radial\nand vertical velocity components for the selected MW-like haloes in the hydrodynamic\nsimulations.  In tables~\\ref{tab:fvfit_vtheta} and~\\ref{tab:fvfit_vtheta_double}, we\npresent the results of the fits with Gaussian, generalized Gaussian and double\nGaussian functions for the azimuthal component of the DM velocity distribution. The\nresults are discussed in section~\\ref{sec:vel-comp}.\n\n\\begin{sidewaystable}\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n     \\hline\n      & \\multicolumn{4}{|c|}{Gaussian} & \\multicolumn{5}{|c|}{Generalized Gaussian} \\\\\n      \\hline\n      Halo Name & $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$ & $\\sigma_\\mu \\,  [\\rm km/s]$ &$\\chi^2$ &  $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$   & $\\sigma_\\mu \\,  [\\rm km/s]$  & $\\alpha$ & $\\chi^2$  \\\\\n       \\hline\n     E1  & 291.24 & 1.60 & 4.66 & 1.41 & 280.09 & 2.02 & 4.81 & 0.88 & 1.38\\\\\nE2 & 282.12 & -5.32 & 4.47 & 1.15 & 288.89 & -5.39 & 4.39 & 1.08 & 1.15\\\\\nE3 & 319.49 & 1.89 & 5.02 & 1.58 & 340.66 & 2.13 & 4.57 & 1.35 & 1.31\\\\\nE4 & 304.65 & 5.39 & 4.44 & 1.91 & 328.51 & 4.51 & 3.93 & 1.44 & 1.39\\\\\nE5 & 295.21 & -6.11 & 4.57 & 0.83 & 307.12 & -5.96 & 4.36 & 1.17 & 0.73\\\\\nE6 & 282.13 & -7.24 & 5.21 & 0.96 & 289.14 & -7.11 & 5.10 & 1.09 & 0.97\\\\\nE7 & 276.18 & 6.20 & 4.51 & 1.14 & 287.58 & 6.27 & 4.35 & 1.14 & 1.09\\\\\nE8 & 274.78 & 1.23 & 4.35 & 1.44 & 293.53 & -1.08 & 4.14 & 1.26 & 1.15\\\\\nE9 & 278.69 & -13.06 & 4.99 & 1.15 & 299.24 & -10.96 & 4.59 & 1.32 & 0.83\\\\\nE10 & 298.25 & 12.26 & 4.89 & 0.87 & 312.75 & 12.11 & 4.56 & 1.23 & 0.71\\\\\nE11 & 296.73 & 0.24 & 4.48 & 1.50 & 308.95 & 0.32 & 4.26 & 1.18 & 1.41\\\\\nE12 & 235.80 & 1.76 & 3.09 & 1.44 & 257.97 & 1.25 & 2.98 & 1.26 & 0.83\\\\\n       \\hline\n      A1   & 235.69 & -1.35 & 2.49 & 1.29 & 243.91 & -0.88 & 2.48 & 1.08 & 1.22\\\\\nA2 & 273.70 & -1.21 & 3.52 & 1.07 & 286.41 & -1.08 & 3.41 & 1.15 & 0.95\\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Best-fit parameters for the distribution of the radial\n      velocity component, $v_r$, of the selected galaxies in the {{\\sc eagle}\\xspace} HR (haloes E1 to E12) and\n      {{\\sc apostle}\\xspace} IR (haloes A1 and A2) hydrodynamic simulations, adopting a Gaussian and a generalized\n      Gaussian function. Besides the best-fit parameters, we quote the reduced\n      $\\chi^2$, $\\tilde{\\chi}^2 \\equiv \\chi^2/(N - dof)$, where $dof = 2$ for the\n      Gaussian function and $dof = 3$ for the generalized Gaussian.}\n    \\label{tab:fvfit_vr}\n\\end{sidewaystable}\n  \n\\begin{sidewaystable}\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n         \\hline\n      & \\multicolumn{4}{|c|}{Gaussian} & \\multicolumn{5}{|c|}{Generalized Gaussian} \\\\\n      \\hline\n        Halo Name & $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$  & $\\sigma_\\mu \\,  [\\rm km/s]$  &$\\chi^2$ &  $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$  & $\\sigma_\\mu \\,  [\\rm km/s]$  & $\\alpha$ & $\\chi^2$  \\\\\n       \\hline\n     E1  & 262.08 & -1.52 & 3.98 & 1.03 & 243.43 & -1.02 & 4.11 & 0.83 & 0.84\\\\\nE2 & 237.27 & -2.98 & 3.50 & 1.41 & 198.65 & -2.74 & 3.60 & 0.70 & 0.54\\\\\nE3 & 261.94 & -4.63 & 3.66 & 1.96 & 220.15 & -5.47 & 3.81 & 0.69 & 0.96\\\\\nE4 & 219.83 & 1.13 & 2.81 & 0.92 & 205.46 & 1.82 & 2.86 & 0.87 & 0.69\\\\\nE5 & 236.11 & 0.57 & 3.31 & 1.66 & 204.89 & -0.38 & 3.39 & 0.75 & 1.00\\\\\nE6 & 259.93 & 5.05 & 4.63 & 0.90 & 243.11 & 4.08 & 4.78 & 0.85 & 0.80\\\\\nE7 & 283.42 & -11.74 & 4.69 & 1.62 & 245.79 & -11.82 & 4.97 & 0.71 & 1.07\\\\\nE8 & 239.72 & 0.39 & 3.57 & 0.71 & 229.54 & 0.59 & 3.64 & 0.90 & 0.64\\\\\nE9 & 234.25 & 8.29 & 3.89 & 1.23 & 206.72 & 8.08 & 3.98 & 0.77 & 0.85\\\\\nE10 & 237.75 & 0.05 & 3.53 & 0.78 & 228.90 & -0.06 & 3.57 & 0.92 & 0.75\\\\\nE11 & 243.00 & 0.13 & 3.35 & 1.12 & 231.29 & 0.22 & 3.40 & 0.89 & 1.04\\\\\nE12 & 197.79 & 2.68 & 2.52 & 1.91 & 173.20 & 2.94 & 2.54 & 0.77 & 1.14\\\\\n       \\hline\n      A1   & 210.32 & -3.68 & 2.17 & 1.88 & 186.41 & -3.31 & 2.21 & 0.79 & 0.81 \\\\\nA2 & 222.02 & 4.87 & 2.64 & 2.68 & 183.71 & 6.04 & 2.64 & 0.72 & 1.21 \\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Same as table~\\ref{tab:fvfit_vr} for the distribution of the vertical velocity component, $v_z$.}\n    \\label{tab:fvfit_vz}\n\\end{sidewaystable}\n  \n\\begin{sidewaystable}\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n           \\hline\n      & \\multicolumn{4}{|c|}{Gaussian} & \\multicolumn{5}{|c|}{Generalized Gaussian} \\\\\n      \\hline\n        Halo Name & $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$   & $\\sigma_\\mu \\,  [\\rm km/s]$ &$\\chi^2$ &  $v_0 \\,  [\\rm km/s]$ &  $\\mu \\,  [\\rm km/s]$   & $\\sigma_\\mu \\,  [\\rm km/s]$ & $\\alpha$ & $\\chi^2$  \\\\\n       \\hline\n     E1  & 277.18 & 2.82 & 4.31 & 1.30 & 250.03 & 1.31 & 4.52 & 0.77 & 0.96\\\\\nE2 & 257.62 & -4.63 & 3.94 & 1.39 & 244.29 & -3.11 & 4.12 & 0.88 & 1.33\\\\\nE3 & 276.68 & 7.02 & 3.98 & 1.18 & 259.37 & 6.55 & 4.10 & 0.84 & 1.05\\\\\nE4 & 265.46 & -20.43 & 3.59 & 1.21 & 266.29 & -20.44 & 3.58 & 1.01 & 1.25\\\\\nE5 & 247.12 & 8.42 & 3.52 & 1.46 & 219.77 & 6.90 & 3.62 & 0.78 & 1.08\\\\\nE6 & 247.07 & 3.50 & 4.30 & 1.22 & 215.85 & 3.74 & 4.36 & 0.76 & 0.88\\\\\nE7 & 241.74 & 39.93 & 3.86 & 2.09 & 222.41 & 41.61 & 4.03 & 0.81 & 1.84\\\\\nE8 & 235.53 & 13.86 & 3.47 & 2.55 & 180.26 & 12.03 & 3.43 & 0.61 & 0.88\\\\\nE9 & 251.95 & 10.92 & 4.27 & 1.70 & 217.46 & 12.36 & 4.59 & 0.73 & 1.19\\\\\nE10 & 266.72 & 23.90 & 4.13 & 1.39 & 248.16 & 24.18 & 4.31 & 0.82 & 1.20\\\\\nE11 & 263.07 & 2.29 & 3.74 & 1.67 & 236.30 & 1.72 & 3.87 & 0.78 & 1.31\\\\\nE12 & 230.57 & 64.55 & 3.13 & 2.63 & 218.91 & 66.16 & 3.28 & 0.87 & 2.54\\\\\n       \\hline\n      A1  & 207.47 & 38.15 & 2.19 & 2.67 & 186.13 & 37.84 & 2.22 & 0.81 & 1.82\\\\\nA2 & 212.30 & -3.95 & 2.55 & 3.09 & 182.27 & -0.88 & 2.61 & 0.75 & 2.02 \\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Same as table~\\ref{tab:fvfit_vr} for the distribution of the azimuthal velocity component, $v_\\theta$.}\n    \\label{tab:fvfit_vtheta}\n\\end{sidewaystable}\n  \n\\begin{sidewaystable}\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|}\n      \\hline\n        Halo Name & $c_1$ & $v_1 \\,  [\\rm km/s]$ &  $\\mu_1 \\,  [\\rm km/s]$   & $\\sigma_{\\mu_1} \\,  [\\rm km/s]$ & $c_2$ &  $v_2 \\,  [\\rm km/s]$ &  $\\mu_2 \\,  [\\rm km/s]$  & $\\sigma_{\\mu_2} \\,  [\\rm km/s]$  & $\\chi^2_{\\rm double \\, Gauss}$  \\\\\n       \\hline\n      E1 & 0.13 & 111.28 & -21.95 & 14.40 & 0.87 & 303.24 & 6.99 & 5.99 & 0.87 \\\\\nE2 & 0.88 & 275.08 & -14.91 & 6.77 & 0.12 & 112.76 & 54.91 & 15.24 & 1.01 \\\\\nE3 & 0.95 & 287.09 & 7.63 & 4.41 & 0.05 & 62.73 & -6.72 & 13.79 & 0.90 \\\\\nE4 & 0.99 & 262.54 & -21.85 & 3.58 & 0.01 & 13.20 & 420.94 & 2.95 & 1.08 \\\\\nE5 & 0.09 & 71.29 & -10.48 & 9.70 & 0.91 & 261.96 & 11.39 & 4.25 & 0.85 \\\\\nE6 & 0.09 & 70.39 & -4.38 & 11.62 & 0.91 & 262.29 & 5.23 & 5.11 & 0.81 \\\\\nE7 & 0.57 & 295.43 & -10.19 & 22.52 & 0.43 & 165.06 & 88.48 & 12.74 & 0.87 \\\\ \nE8 & 0.63 & 311.89 & 8.13 & 8.25 & 0.37 & 132.95 & 17.15 & 6.56 & 0.97 \\\\\nE9 & 0.81 & 284.78 & 9.11 & 6.46 & 0.19 & 116.02 & 17.27 & 11.53 & 1.14 \\\\\nE10 & 0.30 & 177.56 & 12.35 & 17.25 & 0.70 & 316.24 & 30.77 & 10.29 & 1.24 \\\\\nE11 & 0.92 & 277.68 & 1.79 & 4.68 & 0.08 & 76.26 & 2.45 & 20.46 & 1.32 \\\\\nE12 & 0.68 & 254.78 & 26.62 & 15.07 & 0.32 & 139.89 & 135.57 & 11.56 & 0.88 \\\\\n       \\hline\n       A1   & 0.53 & 252.62 & 7.61 & 10.75 & 0.47 & 153.16 & 63.98 & 5.84 & 1.00 \\\\\nA2 & 0.74 & 242.65 & -16.23 & 4.62 & 0.26 & 112.55 & 28.11 & 6.90 & 1.44\\\\\n      \\hline\n    \\end{tabular}\n    \\caption{Best-fit parameters for the distribution of the azimuthal\n      velocity component, $v_\\theta$, of the selected galaxies in the {{\\sc eagle}\\xspace} HR (E1 to E12) and\n      {{\\sc apostle}\\xspace} IR (A1 and A2) hydrodynamic simulations, adopting a double Gaussian, see text for\n      more details.}\n    \\label{tab:fvfit_vtheta_double}\n\\end{sidewaystable}\n\n\n\n\n\n\n\n\\bibliographystyle{JHEP}\n\\bibliography{./refs}\n\n\n", "itemtype": "equation", "pos": 70719, "prevtext": "\n\nThe halo integral $\\eta (v_{\\rm min}, t)$, together with the local DM density\n$\\rho_\\chi$, encapsulates the astrophysics dependence of the event rate.\n\n\nThe top left panel of figure~\\ref{fig:eta} shows the time averaged halo integral\nas a function of the minimum velocity, $v_{\\rm min}$, for the two haloes with speed\ndistributions that are the closest to (halo E12), and the farthest from (halo E3), the SHM Maxwellian\n(specified with a solid black line) in the set of {{\\sc eagle}\\xspace} HR MW-like galaxies. The\nbottom left panel of the same figure shows the time averaged halo integral for\nthe two {{\\sc apostle}\\xspace} IR MW-like haloes. The right panels show the halo integral for the\nsame haloes in the left panels but in a DMO simulation. The coloured solid lines\nspecify the halo integral computed from the mean value of the velocity distribution,\nwhile the shaded band is obtained by adding and subtracting one standard deviation to\nthe mean velocity distribution. The halo integrals obtained from the best fit Maxwellian velocity \nmodulus distributions (eq.~\\eqref{eq:genMax} with $\\alpha=1$) are shown by dashed coloured lines with matching colours for each halo.\n \n \n \n \\begin{figure}\n\\begin{center}\n \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/etaEagleHRLog-DMO.pdf}\\\\\n \\vspace{5pt}\\includegraphics[width=0.49\\textwidth]{figs/etaLGIRLog.pdf}\n  \\includegraphics[width=0.49\\textwidth]{figs/etaLGIRLog-DMO.pdf}\n\\caption{\\label{fig:eta} Time averaged halo integrals (solid coloured lines) for the\n  the two haloes closest (halo E12 shown in green) and farthest (halo E3 shown in magenta) from the SHM Maxwellian in\n  the {{\\sc eagle}\\xspace} HR simulation (top left), and the two haloes (blue and red lines) in the\n  {{\\sc apostle}\\xspace} IR simulation (bottom left). The solid coloured lines and the shaded bands\n  correspond to the halo integrals obtained from the mean velocity distribution and\n  the velocity distribution at $\\pm 1\\sigma$ from the mean, respectively. The solid black line\n  specifies the halo integral for the SHM Maxwellian (with peak speed of 230 km/s), and \n  the dashed coloured lines specify the halo integral obtained from the best fit \n  Maxwellian velocity modulus distribution for each halo (with matching colours). The right\n  panels show the halo integrals for the same haloes in the corresponding left panel\n  but in a DMO simulation.}\n\\end{center}\n\\end{figure}\n\n\n\nFrom the left panels of figure~\\ref{fig:eta}, one can see that the halo-to-halo\nscatter in the halo integral is significant. There are MW-like haloes which have halo\nintegrals similar to the SHM Maxwellian, but there also exists MW\nanalogues with halo integrals that deviate from the SHM Maxwellian significantly at\nhigher minimum velocities. The effect is more evident for the {{\\sc eagle}\\xspace} HR sample, for\nwhich we have more haloes. Comparing to the DMO case, where the halo-to-halo\nscatter is less pronounced, one can conclude that baryons affect\nthe velocity distribution strongly at $R_0=8$~kpc, typically resulting in a shift\nof the tails of the halo integral to higher velocities with respect to the DMO case.\n\nThe difference between the halo integral of the simulated haloes in the hydrodynamic case and the SHM Maxwellian, which is more pronounced at relatively large $v_{\\rm min}$, is mainly due to the different \npeak speed of the DM velocity distribution of the simulated haloes compared to the 230 km$/$s assumed for the SHM Maxwellian. Indeed, \nthe halo integral for the best fit Maxwellian velocity distribution falls within the $1\\sigma$ \nuncertainty band of the halo integrals for all but two MW-like haloes in the hydrodynamic simulation. For those two haloes, there is only\na slight deviation between the halo integral for the best fit Maxwellian and the simulated halo at large $v_{\\rm min}$. \nThe range of the best fit $v_0$ parameter for the Maxwellian distribution is 223 -- 289 km$/$s in the hydrodynamic case, as can be seen in table \n\\ref{tab:fvfit} in Appendix~\\ref{app:fits}. \n\nOn the other hand, the shape of the DM velocity modulus distributions for the haloes in the DMO simulations are not well captured by the Maxwellian distribution with a free peak. For most haloes in the DMO case, there are large deficits at the peak, and an excess of particles at low and very high velocities compared to the best fit Maxwellian speed distribution. These large differences result in halo integrals of the simulated haloes which are quite different from the best fit Maxwellian halo integrals, as can be seen from the right panels of figure ~\\ref{fig:eta}. \n\n\n\n\n\\section{Results}\n\\label{sec:results}\n\nWe discuss below the details of the analysis of direct detection data using directly the local\nDM density and velocity distribution of the selected MW analogues. Our aim is to\ninvestigate how the allowed regions and exclusion limits set by different direct\ndetection experiments in the plane of DM mass and spin-independent cross section\nchange for our selected haloes compared to the SHM, and if the compatibility between\nthe hints for a DM signal and null-results improves.\n\n\n\n\\subsection{Data from direct detection experiments}\n\\label{sec:data}\n\nIn this section we discuss our analysis of the data from multiple direct detection\nexperiments. In particular, we consider the positive signals from\nDAMA/LIBRA~\\cite{Bernabei:2013xsa} (DAMA for short) and the silicon detectors in\nCDMS-II~\\cite{Agnese:2013rvf} (CDMS-Si for short), as well as the the null-results\nfrom the LUX~\\cite{Akerib:2013tjd} and SuperCDMS~\\cite{Agnese:2014aze} experiments.\n\n\n\n\\bigskip\n\n{\\bf DAMA}: The DAMA experiment observed an annual modulation signal at the\n9.3$\\sigma$ level over 14 annual cycles. We use the data on the annual modulation\namplitude given in figure~8 of ref.~\\cite{Bernabei:2013xsa} for the total cumulative\nexposure of 1.33 ton yr of DAMA/LIBRA-phase1 and DAMA/NaI. In our analysis, we\nconsider 12 bins in the signal region between 2 keVee and 8 keVee, above which the\ndata is consistent with zero modulation. For the quenching factors of Na and I, we\nuse $q_{\\rm Na}=0.3$ and $q_{\\rm I}=0.09$, respectively, as measured by the DAMA\ncollaboration~\\cite{Bernabei:1996vj}.\n\n\nOur analysis of the DAMA data is similar to the analyses in~\\cite{Fairbairn:2008gz,\n  Kopp:2009qt, Kopp:2011yr}. In particular, we construct a $\\chi^2$ function to fit\nthe DAMA data,\n\n\n", "index": 33, "text": "\\begin{equation}\n\\chi^2_{\\rm DAMA} (m_\\chi, \\sigma_{\\rm SI}) = \\sum_{i=1}^{i=12} \\left(\\frac{A_i^{\\rm pred} (m_\\chi, \\sigma_{\\rm SI}) - A_i^{\\rm obs}}{\\sigma_i} \\right)^2,\n\\label{eq: DAMAchisq}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}_{\\rm DAMA}(m_{\\chi},\\sigma_{\\rm SI})=\\sum_{i=1}^{i=12}\\left(\\frac{A_{%&#10;i}^{\\rm pred}(m_{\\chi},\\sigma_{\\rm SI})-A_{i}^{\\rm obs}}{\\sigma_{i}}\\right)^{2},\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>χ</mi><mi>DAMA</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>m</mi><mi>χ</mi></msub><mo>,</mo><msub><mi>σ</mi><mi>SI</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mrow><mi>i</mi><mo>=</mo><mn>12</mn></mrow></munderover><msup><mrow><mo>(</mo><mfrac><mrow><mrow><msubsup><mi>A</mi><mi>i</mi><mi>pred</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>m</mi><mi>χ</mi></msub><mo>,</mo><msub><mi>σ</mi><mi>SI</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msubsup><mi>A</mi><mi>i</mi><mi>obs</mi></msubsup></mrow><msub><mi>σ</mi><mi>i</mi></msub></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]