[{"file": "1601.04525.tex", "nexttext": "\nwhere $N_d$ represents the total number of bins, $v_g$ the gas velocity, and $f$ takes into account the contributions of species other than protons and it is assumed to be equal to 0.5 \\citep{Hollenbach1979}. The term $L_i$ is defined as\n\n", "itemtype": "equation", "pos": 13039, "prevtext": "\n\n\n\n\n\n\n\\title{The formation of the primitive star SDSS J102915+172927:\\\\ does the grain distribution matter?}\n\n\\author{S. Bovino\\altaffilmark{1}, T. Grassi\\altaffilmark{2}, D. R. G. Schleicher\\altaffilmark{3}, and R. Banerjee\\altaffilmark{1}}\n\\affil{$^1$Hamburger Sternwarte, Universit\\\"at Hamburg, Gojenbergsweg 112, 21029 Hamburg, Germany}\n\\affil{$^2$Centre for Star and Planet Formation, Niels Bohr Institute \\& Natural History Museum of Denmark, University of Copenhagen, \\O ster Voldgade 5-7, DK-1350 Copenhagen, Denmark}\n\\affil{$^3$Departamento de Astronom\\'ia, Facultad Ciencias F\\'isicas y Matem\\'aticas, Universidad de Concepci\\'on, Av. Esteban Iturra s/n Barrio Universitario, Casilla 160, Concepci\\'on, Chile}\n\\email{stefano.bovino@uni-hamburg.de}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\nUnderstanding how the extremely metal poor star SDSS-J102915+172927 was formed is of fundamental importance to probe the chemical and physical conditions of primordial stars, and contributes to improve our knowledge on the transition between the first and the second generation of stars in the Universe.\nIn this Letter, we perform three-dimensional cosmological hydrodynamical high-resolution simulations of dust-enriched halos during the early stages of the collapse process including an accurate treatment of the dust physics. We employ the astrochemistry package {\\textsc{krome} } coupled with the hydrodynamical code \\textsc{enzo} assuming grain size distributions produced by the explosion of core-collapse supernovae of 20 and 35 M$_\\odot$ primordial stars exposed to reverse shocks, which are suitable to reproduce the chemical pattern of the SDSS-J102915+172927 star. We compare these simulations to runs with a grain composition typical for the Milky Way. We find that the total dust mass from Population III supernovae is the most important factor which drives the thermal evolution and the dynamical properties of the halos, and that the composition, the dust optical properties, and the size-range have only minor effects on the results. \n\\end{abstract}\n\n\\keywords{stars: low-mass --- stars: formation --- methods: numerical --- hydrodynamics}\n\n\\section{Introduction}\nThe discovery of the extremely metal poor star SDSS J102915+172927 \\citep{Caffau2011} has opened the possibility to indirectly probe the conditions of primordial clouds and to explore the environments which have led to the transition between the first (Pop III) and the second generation (Pop II) of stars. The so called ``Caffau star\" is in fact characterized by an extremely low metallicity of 4.5$\\times$10$^{-5}$ $Z_\\odot$, supposedly formed from a minihalo enriched with dust and metals by the explosion of a massive primordial star \\citep{Klessen2012,Schneider2012}. From its observed abundances it has been inferred that the supernova progenitor should have masses of \\mbox{20-40} M$_\\odot$ and a dust content released in the surrounding medium of  0.01-0.4 M$_\\odot$ \\citep{Schneider2012}. However, the mechanism that likely led to the formation of the Caffau star is far from being well-understood, because the interplay between different processes makes the problem rather intricate, both physically as well as numerically. Compared to the formation of Pop III stars, where the chemistry is simple, for the second generation of stars the presence of dust, metals, and feedback adds complexity which results in a high computational cost and large uncertainties. Recently, \\citet{Smith2015} performed cosmological simulations of a collapsing minihalo enriched by dust and metals obtained from the outcome of a supernova (SN) explosion of a 30 M$_\\odot$ Pop III star. \nThe outcome of the SN produced a uniform metallicity of $\\sim$2$\\times$10$^{-5} Z_\\odot$, and the collapse led to vigorous fragmentation  and a turbulent density structure. However, the dust model employed is rather approximate as they are not considering any grain size distribution and assume an average size\\footnote{The size is not clearly reported in their work, but can be inferred from \\citet{Hollenbach1989}.} of 10$^{-6}$ cm. In addition, the amount of dust and the composition resemble the present-day ISM properties re-scaled by the metallicity, which is known to have a high depletion efficiency\\footnote{The condensation or depletion factor represents the mass of metals locked into dust, and it is usually defined as $f_\\mathrm{dep}~=~M_\\mathrm{d}/(M_\\mathrm{d}+M_\\mathrm{met})$.}, i.e. a significant amount of metals is locked into dust \\citep{Pollack1994}.\nOn the contrary, realistic Pop III core-collapse SNe models reported over the last decade \\citep{Todini2001,Nozawa2007,Schneider2006,Schneider2012,\nMarassi2015} show very different grain size distributions and compositions, and much lower depletion efficiencies. \nIn previous studies, \\citet{Dopcke2011,Dopcke2013} \n\nstarting from an idealized setup, employed a dust model similar to \\citet{Smith2015} and explored different metallicities obtaining, through a sink particle algorithm, the mass distribution of the resulting protostellar clumps, which showed a transition from a flat to a peaky distribution with increasing metallicity. \nSo far these are the first and the only works where the dust cooling has been included during the gravitational collapse of a minihalo, but a comparison between the two studies is difficult as the initial conditions and the numerical code employed are very different.\n\n\nIn a recently submitted paper, \\citet{Chiaki2016} employed a comprehensive chemical model coupled with a proper treatment of the dust grains, in particular including the grain growth, H$_2$ formation on dust, and a grain size distribution coming from a Pop III SN model of a 30 M$_\\odot$ progenitor, as reported by \\citet{Nozawa2007}. \n\nThey performed simulations of collapsing halos starting both from idealized conditions as well as from a cosmological initial setup obtained by the outcome of the \\citet{Hirano2014} simulations suite. The fragmentation process has been studied assuming an adiabatic collapse for densities above 10$^{16}$ cm$^{-3}$ and they concluded that the fragmentation is strongly related to the metallicity of the gas, but also influenced by the collapse time-scale. \n\nEven if this study is very detailed and includes a proper model for the dust grains, there are two important questions which have not been addressed: what is the effect of the grain size distribution and of different dust compositions on the thermal evolution and the dynamical properties of the collapsing halo? How does the dust mass yield affect the fragmentation? In this work we provide a quantitative study of the effect of different grain size distributions/compositions on the dynamics of collapsing minihalos enriched by dust for the case of SDSS J102915+172927, starting  from cosmological initial conditions and allowing for a high dynamical resolution.\n\nIn the following sections we introduce the different grain size distributions employed in this work, and give the details of our numerical setup. Then we discuss the main results and draw our conclusions.\n\n\n\\section{Numerical methods}\\label{sect:distributionscoupling}\n\\subsection{Chemistry and microphysics}\nChemistry, microphysics, and dust-related processes are treated via the  {\\textsc{krome} } package\\footnote{www.kromepackage.org} \\citep{Grassi2014}, which is well suited to accurately and efficiently model the chemistry and microphysics in hydrodynamical simulations. The package has been coupled with different hydrodynamical codes (e.g. \\textsc{enzo}, \\textsc{ramses}, \\textsc{flash}, and \\textsc{gasoline}) and employed to study a variety of astrophysical problems, with a wide range of physical and chemical conditions \\citep{Bovino2014,Prieto2015,Katz2015,Schleicher2015}, including the formation of supermassive black holes \\citep{Latif2014MNRAS,Latif2015} and simulations of star-forming filaments \\citep{Seifried2015}.\nIn addition, {\\textsc{krome} } was shown to be numerically very stable and suitable for studies of the high-density environments \\citep{Bovino2013}.\n\nIn this work, we employ a state-of-the-art primordial network, together with the main cooling/heating processes needed to model the collapse of a metal-free minihalo. Specifically, we include: atomic cooling  and Compton cooling from the cosmic microwave background as adopted from \\citet{cen92}, H$_2$ roto-vibrational cooling updated to \\citet{Glover2015}, dust cooling as in \\citet{Hollenbach1979}, and collisionally induced emission cooling, which is important at high densities \\citep{Grassi2014}. Chemical heating and cooling produced by the formation/destruction of molecular hydrogen is also considered, these include the energy released by the formation of H$_2$ on dust \\citep{Hollenbach1979}, that we compute employing the size-dependent rates reported by \\citet{Cazaux2009}. The choice to not include any metals is dictated by the fact that at this low metallicity the fine-structure metal cooling is negligible as we are well below the critical metallicity ($Z = 10^{-3.5} Z_\\odot$) postulated by \\citet{Bromm2001}, and recently confirmed with high-resolution numerical simulations \\citep{Bovino2014}.\n\n\n\\subsection{Grain size distributions}\\label{sec:distributions}\nWe explore the effect of the grain size distribution following two different approaches. First, we employ the distribution and dust composition as expected from the outcome of core-collapse SNe explosion \\citep{Limongi2012}, which is reprocessed by a nucleation model \\citep{Schneider2012, Chiaki2014}. The SN models have been selected to reproduce the average elemental abundances of the primitive star SDSS J102915+172927. These models include six different grain species, namely amorphous carbon (AC), alumina (Al$_2$O$_3$), magnetite (Fe$_3$O$_4$), enstatite (MgSiO$_3$), forsterite (Mg$_2$SiO$_4$) and silica (SiO$_2$), with a distribution similar to the one reported in Fig. 2 of \\citet{Chiaki2014}, and take into account also the passage of a reverse shock which can destroy the initial distribution produced by the SN model. We consider here the case of a 35~M$_\\odot$ progenitor star (run4) where the distribution is affected by a weak reverse shock (labelled rev1 in Table \\ref{tab:runs}) with a depletion factor $f_\\mathrm{dep} = 0.0082$, and a case where the progenitor is a primordial star of 20 M$_\\odot$ (run3) exposed to a stronger reverse shock (rev2 in Table \\ref{tab:runs}), with a higher depletion factor, $f_\\mathrm{dep} = 0.015$. \\citet{Schneider2012} postulated that to have fragmentation $f_\\mathrm{dep}$ should be larger than 0.01. This threshold has been obtained from simple one-zone models that may not capture the full 3D dynamics and should thus be considered with caution, as also discussed in \\citet{Safranek2014MNRAS}. \nWith these two distributions we are able to explore values around the threshold suggested by \\citet{Schneider2012} and see under which conditions it has a substantial impact on the density structure. It is important to underline that these distributions consider uniformly mixed ejecta, which is in line with the results recently reported by \\citet{Smith2015}.  \n\nA second series of runs is performed including a typical power-law size distribution ($dn/da\\propto a^{-\\alpha}$), with exponent $\\alpha$ = -3.5 \\citep{Mathis1977}, where we assume a mix of carbonaceous and silicates that resembles the Milky Way typical composition, with $a_\\mathrm{min}$~=~5$\\times$10$^{-7}$ and \\mbox{$a_\\mathrm{max}$ = 10$^{-5}$}~cm. In this case, we have to re-scale the solar dust-to-gas ratio by the star's metallicity $Z = 4.5\\times 10^{-5} Z_\\odot$. The depletion factor for a Milky Way-like  grain size distribution is 0.49, as provided by \\citet{Pollack1994} and also reported by \\citet{Schneider2012MNRAS}.\n\n\\begin{center}\n\\begin{figure*}\n\\includegraphics[scale=0.43]{fig1_1.eps}\n\\includegraphics[scale=0.43]{fig1_2.eps}\n\\caption{Averaged density profiles for the thermal evolution of the two halos, and for different grain size distributions. See text for details.}\\label{fig:figure2}\n\\end{figure*}\n\\end{center}\n\nFinally, we also run  a case (run5) where we adopt the 35 M$_\\odot$ model, but increase the depletion factor from 0.0082 to 0.49, i.e. assuming the same depletion factor as for the power-law case, to disentangle the effect of the dust mass, composition, and distribution on the dynamics.\n\nThe dust physics is employed in {\\textsc{krome} } via look-up tables obtained by the procedure discussed in \\citet{Grassi2016}, which are only functions of the total density $n_\\mathrm{tot}$ and the gas temperature $T$. We assume 20 bins in size per each grain type, which ensure a very good convergence on the results\\footnote{Note that an acceptable convergence is already reached for 10 bins.}. The cooling and the H$_2$ formation on dust are in fact strongly affected by the number of bins, and assuming for instance one average size bin can lead to errors (see \\citealt{Grassi2016}).  The total dust cooling  is defined as\n\n\n", "index": 1, "text": "\\begin{equation}\\label{eqn:total_cooling_bin}\n \\Lambda_{dust} = 2 f v_g n_{tot} \\pi \\sum_{i=1}^{N_d} L_i\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Lambda_{dust}=2fv_{g}n_{tot}\\pi\\sum_{i=1}^{N_{d}}L_{i}\\,,\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mi>d</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>f</mi><mo>⁢</mo><msub><mi>v</mi><mi>g</mi></msub><mo>⁢</mo><msub><mi>n</mi><mrow><mi>t</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>d</mi></msub></munderover><mpadded width=\"+1.7pt\"><msub><mi>L</mi><mi>i</mi></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04525.tex", "nexttext": "\nwhere $k_B$ is the Boltzmann constant, $T$ the gas temperature, $n_{d,i}$, $a_i$, and $T_{d,i}$, are the dust number density, the grain size, and the dust temperature in the {$i$th } bin, respectively. \nThe dust temperature is obtained by solving the following thermal balance equation\n\n\n", "itemtype": "equation", "pos": 13400, "prevtext": "\nwhere $N_d$ represents the total number of bins, $v_g$ the gas velocity, and $f$ takes into account the contributions of species other than protons and it is assumed to be equal to 0.5 \\citep{Hollenbach1979}. The term $L_i$ is defined as\n\n", "index": 3, "text": "\\begin{equation}\\label{eqn:partial_cooling}\n L_i = a_i^2 n_{d,i} k_B\\left[T-T_{d,i}\\right]\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"L_{i}=a_{i}^{2}n_{d,i}k_{B}\\left[T-T_{d,i}\\right]\\,,\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mi>i</mi></msub><mo>=</mo><mrow><msubsup><mi>a</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>n</mi><mrow><mi>d</mi><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><mi>T</mi><mo>-</mo><msub><mi>T</mi><mrow><mi>d</mi><mo>,</mo><mi>i</mi></mrow></msub></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04525.tex", "nexttext": "\nwith $\\Gamma_{em}$, and $\\Gamma_{abs}$ being the radiation emitted and absorbed by a dust grain, and $\\beta_{e}$ the escape probability (\\citealt{Omukai2000}) defined as\n\n", "itemtype": "equation", "pos": 13796, "prevtext": "\nwhere $k_B$ is the Boltzmann constant, $T$ the gas temperature, $n_{d,i}$, $a_i$, and $T_{d,i}$, are the dust number density, the grain size, and the dust temperature in the {$i$th } bin, respectively. \nThe dust temperature is obtained by solving the following thermal balance equation\n\n\n", "index": 5, "text": "\\begin{equation}\n \\beta_e\\,(\\Gamma_{em}-\\Gamma_{abs}) =  \\Lambda_{dust}\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\beta_{e}\\,(\\Gamma_{em}-\\Gamma_{abs})=\\Lambda_{dust}\\,,\" display=\"block\"><mrow><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>β</mi><mi>e</mi></msub></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>a</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mi>d</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04525.tex", "nexttext": "\n\n\\noindent The gas opacity ($\\tau_g$) is taken from \\citet{Mayer2005}, while the optical constants for every individual dust species ($\\tau_d$) are obtained from the refractive indexes reported by the Jena Database\\footnote{\\url{astro.uni-jena.de/Laboratory/OCDB}}. For the carbonaceous and silicates employed in the power-law distribution, the optical constants are from Bruce Draine's website\\footnote{\\url{astro.princeton.edu/~draine/dust/dust.diel.html}}.  The bulk densities are adopted from \\citet{Nozawa2006}.\n\nThese tables do not introduce any approximation other than the discretization into bins, and provide very high efficiency when employed in 3D calculations. In addition, the tables could include an arbitrary number of bins and dust types without additional computational time, and then provide a very powerful method to realistically model the formation of extremely metal-poor stars or in general dust-enhanced media.  \n\n\\begin{table}\n\t\\caption{Specifications of the runs presented in this work. The type of distribution, the depletion factor $f_\\mathrm{dep}$, and the type of reverse shock which destroy the initial dust distribution are  reported. The up- and the down-arrows indicate values above and below the critical $f_\\mathrm{dep}$, respectively. For additional details see the text.}\n\t\\begin{center}\n\t\t\\begin{tabular}{lllccc}\n\t\t\t\\hline\n\t\t\t\\hline\n\t\t\t$\\#$ & type &  $f_\\mathrm{dep}$ & & $dn/da$ & shock   \\\\ \n\t\t\t\\hline\n\t\t\t\\hline\n\t\t\trun1 & no-dust  & 0 & - & -  \\\\ \n\t\t\trun2 & power-law & 0.49 & $\\uparrow$ & $\\alpha = -3.5$ & -\\\\\n\t\t\trun3 & 20 M$_\\odot$  & 0.015 & $\\uparrow$ & SN model & rev2$^{\\star}$\\\\\n\t\t\trun4 & 35 M$_\\odot$ & 0.0082 & $\\downarrow$& SN model & rev1$^{\\star}$\\\\\n\t\t\trun5 & 35 M$_\\odot$ & 0.49 & $\\uparrow$ & SN model & rev1$^{\\star}$\\\\\n\t\t        \\hline\n\t\t        \\hline\n\t\t\\end{tabular}\\\\\n\t\t\\vspace{0.1cm}\n\t\t$^{\\star}$ see \\citet{Chiaki2014} for details.\n\t\t\\end{center}\n\t\\label{tab:runs}\n\\end{table}\n\n\\section{Simulation setup}\nWe follow the collapse of two minihalos of 10$^6$~M$_\\odot$ and 7$\\times$10$^5$ M$_\\odot$ starting from cosmological initial conditions as reported in \\citet{Bovino2014}, by employing the hydrodynamical code \\textsc{enzo} \\citep{ENZO2014}. \nWe select the most massive minihalo in a box of 300 kpc h$^{-1}$ and re-run our simulation with the box centered onto the selected minihalo adding two additional nested grids for an effective resolution of 512$^3$. \nFrom $z=99$ to $z=22$ we evolve the halos to reach a central temperature of $\\sim$10$^3$~K at a density of 10$^{-23}$~g~cm$^{-3}$ and then enable the dust machinery. Radiative and mechanical feedback from the previous generation of stars is neglected here. We allow 29 levels of refinement, which yield a resolution at a sub-AU level in comoving units, and resolve the Jeans length by 64 cells.\nOur refinement strategy is based on over-density, Jeans length and particle mass and is applied during the simulations to ensure that all physical processes are well resolved and the Truelove criterion \\citep{Truelove1997,Federrath11} is fulfilled. \nA summary of our runs is reported in Table \\ref{tab:runs}. \n\n\\begin{figure}\n\\includegraphics[scale=0.35]{fig2.eps}\n\\caption{Density projections along the x-axis at a scale of 200 AU for the ten different runs and the two halos employed in the simulations, as indicated in the plot.}\\label{fig:figure3}\n\\end{figure}\n\n\n\\section{Results}\nIn Fig. \\ref{fig:figure2} we report the averaged thermal evolution for the ten runs performed for the two halos. In both cases the general trend is very similar, and clearly shows the effect of dust on the thermodynamics. Depending on the employed grain size distribution, we see a weaker or stronger cooling: the runs with low mass dust yield (run3, and run4) start to cool at densities above 10$^{-12}$ g cm$^{-3}$ and reach a minimum temperature of 600~K and 800~K for Halo 1, and 500 K and 700 K for Halo~2. This is in agreement with previous one-zone studies (e.g. \\citealt{Schneider2012}). When we increase the amount of dust the cooling is much stronger and the effect is already visible at densities of 10$^{-18}$~g~cm$^{-3}$. The minimum temperature reached both in run2 and run5 is around 200~K and could lead to the formation of clumps with mass \\mbox{$<$ 0.1 M$_\\odot$}. The same dust content ($f_\\mathrm{dep}$ = 0.49) provides similar results regardless of the choice of the distribution. In fact, assuming a power-law distribution or a more accurate distribution coming from a SN model (run2 with a progenitor of 35 M$_\\odot$) produces differences of the order of \\mbox{$\\sim$50-100~K}. \n\nTo better understand how these differences are reflected in the dynamical evolution, we show in Fig.~\\ref{fig:figure3} the density projections along the x-axis for the different runs and the two considered halos, taken at a peak density of 3$\\times$10$^{-10}$ g cm$^{-3}$. The density structure appears very similar in the two halos: when considering the cases with $f_\\mathrm{dep}$ below (run2) or close (run4) to the threshold proposed by \\citet{Schneider2012}, the collapse proceeds almost monolithically with a turbulent bulky structure which is similar to the primordial case (run1). This slightly depends on the selected halo:  for example for run4, Halo 2 shows a more compact structure compared to Halo 1 which seems more turbulent. When we analyse the cases with a high depletion factor, i.e. $f_\\mathrm{dep} = 0.49$, the gas evolves in a more fragmented  and filamentary structure, reflecting the stronger cooling. \n\n\\begin{center}\n\\begin{figure*}\n\\includegraphics[scale=1.1]{fig3_1.eps}\n\\includegraphics[scale=1.1]{fig3_2.eps}\n\\caption{Dust grain distributions employed in this work. Left panel: SN distributions with $f_\\mathrm{dep} = 0.0082$ for different dust species, and the standard power-law distributions for C and Si. Right panel: the same SN distributions where $f_\\mathrm{dep}$ has been increased to match the dust mass typical of the power-law distribution, i.e. $f_\\mathrm{dep} = 0.49$. Note that the y-scales are different.}\\label{fig:figure1}\n\\end{figure*}\n\\end{center}\n\nWe report in Fig. \\ref{fig:figure1} the grain size distributions employed in this work to better understand how these affect the density structure and the thermal evolution. On the left panel we clearly see that the power-law case has a higher mass content ($f_\\mathrm{dep} = 0.49$ compared to the distribution obtained from SN model) and spans a smaller size-range. The distribution produced by SN models flattens at smaller radii as an effect of the reverse shock and extends down to very small sizes, of the order of 10$^{-8}$ cm. From simple considerations we know that the dust cooling goes as the inverse of the grain size, $\\Lambda_\\mathrm{dust} \\propto a^{-1}$, and this means that smaller grains provide more cooling. \nDespite this, the comparison between run2 and run4 suggests that the amount of dust has a larger impact on the thermal evolution than its size distribution (Fig.~\\ref{fig:figure2}).\n\nMoreover, the standard galactic power-law distribution employed in run2 has a remarkable effect on the density structure compared to the SN model distribution which extends to smaller radii but has very low dust content.\n\n\n\n\nThis can be better disentangled when we look at the case with an increased dust mass for the SN model distribution (run5), right panel of Fig. \\ref{fig:figure1}. By increasing the dust content $f_\\mathrm{dep}$ from 0.0082 to 0.49 we are able to understand the real effect of the composition/distribution on the thermal evolution and density structure. When comparing the two cases with the same dust content but different distribution and composition (run2 and run5), i.e. different optical properties and size ranges (Fig. \\ref{fig:figure1}), we obtain very similar results (see thermal evolution in Fig. \\ref{fig:figure2}) and, in particular, similar filamentary density structures (Fig. \\ref{fig:figure3}). This crucial result suggests that the grain composition and the shape of the size distribution \\textit{do not strongly impact on the evolution of the collapsing halo and its density structure, as much as the mass yield does}. The latter turns out to be the key physical quantity to understand how the primitive star SDSS J102915+172927 was formed. \n\n\\section{Conclusions and final remarks}\nIn this Letter we present 3D hydrodynamical calculations of two collapsing minihalos enriched by dust, starting from cosmological initial conditions. We employ the chemistry package {\\textsc{krome} } \\citep{Grassi2014} coupled with the hydrodynamical code \\textsc{enzo} including (to our knowledge) the most accurate and detailed grain size distributions and dust physics in this kind of simulations. Two different types of grain distributions have been included: i) a standard power-law with composition and dust content similar to our galaxy, i.e. a mix of carbonaceous and silicates, and ii) a more realistic distribution for high-redshift environments. The latter comes from a SN core-collapse model which properly includes all the processes needed to follow the formation and the evolution of different types of grain \\citep{Schneider2012}. This consists of a sum of log-normal distributions modified by the presence of reverse shocks which flattens the distribution at smaller radii. The two cases allow us to explore different dust compositions and distributions, and assess the effect of the dust physics on the dynamics of the collapsing minihalos. In addition, we explore one case where the outcome of the SN models has been modified by increasing the dust mass yield, and compare this with the results obtained by employing the standard power-law distribution. We found that the dust mass yield, expressed in terms of the depletion factor $f_\\mathrm{dep}$, is the key quantity which has a strong impact on the dynamical and thermal evolution of the minihalos.\n\nIn fact, when we impose the same dust mass (i.e. $f_\\mathrm{dep} = 0.49$) for the standard power-law distribution and the one coming from SN models, these show similar results and dynamical properties.\n\nThe composition and the size-range are not producing any remarkable difference, as similarly reported by the one-zone models by \\citet{Ji2014}.\nIn addition, our results suggest that a threshold in dust mass exists, as proposed by \\citet{Schneider2012}, but we also found that this is affected by the dynamical evolution of the individual halos and requires additional investigation via 3D hydrodynamical simulations. \n\nA quantitative and detailed comparison with previous 3D calculations \\citep{Dopcke2011,Dopcke2013,Smith2015} is difficult to pursue as they employed different dust models and different initial setups.  \\citet{Dopcke2013} reported temperatures between 200-500 K for metallicities of \\mbox{10$^{-4}$~-~10$^{-5}$ $Z_\\odot$}, in line with our results for the power-law distribution, but assuming an average grain size and different optical properties. In \\citet{Smith2015} the final temperature reached is slightly higher but the density structure shows similar features as the findings discussed in this work. We further note, that using the realistic depletion factor from the SN models makes a strong difference for the thermodynamics and the dynamical behaviour. We found that the low amount of dust in run3 and run4 is below the threshold for which dust cooling becomes relevant.\n\nThe formation of dust in SN ejecta included here comes from classical nucleation theory, but other models as the chemical kinetic approach \\citep{Cherchneff2009,Biscaro2014} may lead to different results. The differences between the two approaches have been discussed in \\citet{Marassi2015}. The grain growth process can furthermore affect the dust mass yield threshold. As discussed by \\citet{Chiaki2014}, even a low dust mass yield could produce an effective dust cooling as grains can grow by sticking from the gas phase during the collapse. Recently, a potential mechanism has been proposed to allow the formation of low-mass stars even for dust abundances below the global fragmentation threshold. \\citet{Hopkins2015} introduced the so called ``promoted star formation\" mechanism, which can be activated even in minihalos where the total metallicity is low, but a locally high dust mass could exist due to fluctuations induced by the dust dynamics. This model assumes that the dust distribution and composition in the early Universe is the same as the one observed for our galaxy. \n\nFinally, \\citet{Peters2012} explored the effect of varying the adiabatic index ($\\Gamma$) on the thermodynamics of a collapsing halo by employing an effective equation of state and including magnetic fields. They observed filamentary structure when $\\Gamma < 1$, i.e. in the presence of strong cooling, which agrees with the results reported here. \n\nTo conclude, the results presented in this work provide a relevant step forward to understand the main dust uncertainties and the parameters influencing the dynamical evolution of low-metallicity collapsing halos. \n\n\n\\acknowledgments\nSB, DRGS, and RB thank for funding through the DFG priority program `The Physics of the Interstellar Medium' (projects BO 4113/1-2, SCHL 1964/1-2, and BA 3706/3-2). TG acknowledges the Centre for Star and Planet Formation funded by the Danish National Research Foundation. The plots of this paper have been obtained by using the $\\mathrm{YT}$ tool \\citep{Turk2011a}. The simulations have been performed on the German HLRN cluster under the project nip00035.\n\n\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Biscaro} \\& {Cherchneff}(2014)}]{Biscaro2014}\n{Biscaro}, C., \\& {Cherchneff}, I. 2014, \\aap, 564, A25\n\n\\bibitem[{{Bovino} {et~al.}(2013){Bovino}, {Grassi}, {Latif}, \\&\n  {Schleicher}}]{Bovino2013}\n{Bovino}, S., {Grassi}, T., {Latif}, M.~A., \\& {Schleicher}, D.~R.~G. 2013,\n  \\mnras, 434, L36\n\n\\bibitem[{{Bovino} {et~al.}(2014){Bovino}, {Grassi}, {Schleicher}, \\&\n  {Latif}}]{Bovino2014}\n{Bovino}, S., {Grassi}, T., {Schleicher}, D.~R.~G., \\& {Latif}, M.~A. 2014,\n  \\apjl, 790, L35\n\n\\bibitem[{{Bromm} {et~al.}(2001){Bromm}, {Ferrara}, {Coppi}, \\&\n  {Larson}}]{Bromm2001}\n{Bromm}, V., {Ferrara}, A., {Coppi}, P.~S., \\& {Larson}, R.~B. 2001, \\mnras,\n  328, 969\n\n\\bibitem[{{Bryan} {et~al.}(2014){Bryan}, {Norman}, {O'Shea}, {Abel}, {Wise},\n  {Turk}, {Reynolds}, {Collins}, {Wang}, {Skillman}, {Smith}, {Harkness},\n  {Bordner}, {Kim}, {Kuhlen}, {Xu}, {Goldbaum}, {Hummels}, {Kritsuk}, {Tasker},\n  {Skory}, {Simpson}, {Hahn}, {Oishi}, {So}, {Zhao}, {Cen}, {Li}, \\& {The Enzo\n  Collaboration}}]{ENZO2014}\n{Bryan}, G.~L., {Norman}, M.~L., {O'Shea}, B.~W., {et~al.} 2014, \\apjs, 211, 19\n\n\\bibitem[{{Caffau} {et~al.}(2011){Caffau}, {Bonifacio}, {Fran{\\c c}ois},\n  {Sbordone}, {Monaco}, {Spite}, {Spite}, {Ludwig}, {Cayrel}, {Zaggia},\n  {Hammer}, {Randich}, {Molaro}, \\& {Hill}}]{Caffau2011}\n{Caffau}, E., {Bonifacio}, P., {Fran{\\c c}ois}, P., {et~al.} 2011, \\nat, 477,\n  67\n\n\\bibitem[{{Cazaux} \\& {Spaans}(2009)}]{Cazaux2009}\n{Cazaux}, S., \\& {Spaans}, M. 2009, \\aap, 496, 365\n\n\\bibitem[{{Cen}(1992)}]{cen92}\n{Cen}, R. 1992, ApJS, 78, 341\n\n\\bibitem[{{Cherchneff} \\& {Dwek}(2009)}]{Cherchneff2009}\n{Cherchneff}, I., \\& {Dwek}, E. 2009, \\apj, 703, 642\n\n\\bibitem[{{Chiaki} {et~al.}(2014){Chiaki}, {Schneider}, {Nozawa}, {Omukai},\n  {Limongi}, {Yoshida}, \\& {Chieffi}}]{Chiaki2014}\n{Chiaki}, G., {Schneider}, R., {Nozawa}, T., {et~al.} 2014, \\mnras, 439, 3121\n\n\\bibitem[{{Chiaki} {et~al.}(2016){Chiaki}, {Yoshida}, \\& {Hirano}}]{Chiaki2016}\n{Chiaki}, G., {Yoshida}, N., \\& {Hirano}, S. 2016, ArXiv e-prints: 1601.00280,\n  arXiv:1601.00280\n\n\\bibitem[{{Dopcke} {et~al.}(2011){Dopcke}, {Glover}, {Clark}, \\&\n  {Klessen}}]{Dopcke2011}\n{Dopcke}, G., {Glover}, S.~C.~O., {Clark}, P.~C., \\& {Klessen}, R.~S. 2011,\n  \\apjl, 729, L3\n\n\\bibitem[{{Dopcke} {et~al.}(2013){Dopcke}, {Glover}, {Clark}, \\&\n  {Klessen}}]{Dopcke2013}\n---. 2013, \\apj, 766, 103\n\n\\bibitem[{{Federrath} {et~al.}(2011){Federrath}, {Sur}, {Schleicher},\n  {Banerjee}, \\& {Klessen}}]{Federrath11}\n{Federrath}, C., {Sur}, S., {Schleicher}, D.~R.~G., {Banerjee}, R., \\&\n  {Klessen}, R.~S. 2011, ApJ, 731, 62\n\n\\bibitem[{{Glover}(2015)}]{Glover2015}\n{Glover}, S.~C.~O. 2015, \\mnras, 451, 2082\n\n\\bibitem[{{Grassi} {et~al.}(2016){Grassi}, {Bovino}, {Haugb{\\o}lle}, \\&\n  {Schleicher}}]{Grassi2016}\n{Grassi}, T., {Bovino}, S., {Haugb{\\o}lle}, T., \\& {Schleicher}, D.~R.~G. 2016,\n  \\mnras, in preparation\n\n\\bibitem[{{Grassi} {et~al.}(2014){Grassi}, {Bovino}, {Schleicher}, {Prieto},\n  {Seifried}, {Simoncini}, \\& {Gianturco}}]{Grassi2014}\n{Grassi}, T., {Bovino}, S., {Schleicher}, D.~R.~G., {et~al.} 2014, \\mnras, 439,\n  2386\n\n\\bibitem[{{Hirano} {et~al.}(2014){Hirano}, {Hosokawa}, {Yoshida}, {Umeda},\n  {Omukai}, {Chiaki}, \\& {Yorke}}]{Hirano2014}\n{Hirano}, S., {Hosokawa}, T., {Yoshida}, N., {et~al.} 2014, \\apj, 781, 60\n\n\\bibitem[{{Hollenbach} \\& {McKee}(1979)}]{Hollenbach1979}\n{Hollenbach}, D., \\& {McKee}, C.~F. 1979, \\apjs, 41, 555\n\n\\bibitem[{{Hollenbach} \\& {McKee}(1989)}]{Hollenbach1989}\n---. 1989, \\apj, 342, 306\n\n\\bibitem[{{Hopkins} \\& {Conroy}(2015)}]{Hopkins2015}\n{Hopkins}, P.~F., \\& {Conroy}, C. 2015, ArXiv e-prints: 1512.03834,\n  arXiv:1512.03834\n\n\\bibitem[{{Ji} {et~al.}(2014){Ji}, {Frebel}, \\& {Bromm}}]{Ji2014}\n{Ji}, A.~P., {Frebel}, A., \\& {Bromm}, V. 2014, \\apj, 782, 95\n\n\\bibitem[{{Katz} {et~al.}(2015){Katz}, {Sijacki}, \\& {Haehnelt}}]{Katz2015}\n{Katz}, H., {Sijacki}, D., \\& {Haehnelt}, M.~G. 2015, \\mnras, 451, 2352\n\n\\bibitem[{{Klessen} {et~al.}(2012){Klessen}, {Glover}, \\&\n  {Clark}}]{Klessen2012}\n{Klessen}, R.~S., {Glover}, S.~C.~O., \\& {Clark}, P.~C. 2012, \\mnras, 421, 3217\n\n\\bibitem[{{Latif} {et~al.}(2014){Latif}, {Bovino}, {Van Borm}, {Grassi},\n  {Schleicher}, \\& {Spaans}}]{Latif2014MNRAS}\n{Latif}, M.~A., {Bovino}, S., {Van Borm}, C., {et~al.} 2014, \\mnras, 443, 1979\n\n\\bibitem[{{Latif} {et~al.}(2015){Latif}, {Omukai}, {Habouzit}, {Schleicher}, \\&\n  {Volonteri}}]{Latif2015}\n{Latif}, M.~A., {Omukai}, K., {Habouzit}, M., {Schleicher}, D.~R.~G., \\&\n  {Volonteri}, M. 2015, arXiv:1509.07034\n\n\\bibitem[{{Limongi} \\& {Chieffi}(2012)}]{Limongi2012}\n{Limongi}, M., \\& {Chieffi}, A. 2012, \\apjs, 199, 38\n\n\\bibitem[{{Marassi} {et~al.}(2015){Marassi}, {Schneider}, {Limongi}, {Chieffi},\n  {Bocchio}, \\& {Bianchi}}]{Marassi2015}\n{Marassi}, S., {Schneider}, R., {Limongi}, M., {et~al.} 2015, \\mnras, 454, 4250\n\n\\bibitem[{{Mathis} {et~al.}(1977){Mathis}, {Rumpl}, \\&\n  {Nordsieck}}]{Mathis1977}\n{Mathis}, J.~S., {Rumpl}, W., \\& {Nordsieck}, K.~H. 1977, \\apj, 217, 425\n\n\\bibitem[{{Mayer} \\& {Duschl}(2005)}]{Mayer2005}\n{Mayer}, M., \\& {Duschl}, W.~J. 2005, \\mnras, 358, 614\n\n\\bibitem[{{Nozawa} {et~al.}(2006){Nozawa}, {Kozasa}, \\& {Habe}}]{Nozawa2006}\n{Nozawa}, T., {Kozasa}, T., \\& {Habe}, A. 2006, \\apj, 648, 435\n\n\\bibitem[{{Nozawa} {et~al.}(2007){Nozawa}, {Kozasa}, {Habe}, {Dwek}, {Umeda},\n  {Tominaga}, {Maeda}, \\& {Nomoto}}]{Nozawa2007}\n{Nozawa}, T., {Kozasa}, T., {Habe}, A., {et~al.} 2007, \\apj, 666, 955\n\n\\bibitem[{{Omukai}(2000)}]{Omukai2000}\n{Omukai}, K. 2000, ApJ, 534, 809\n\n\\bibitem[{{Peters} {et~al.}(2012){Peters}, {Schleicher}, {Klessen}, {Banerjee},\n  {Federrath}, {Smith}, \\& {Sur}}]{Peters2012}\n{Peters}, T., {Schleicher}, D.~R.~G., {Klessen}, R.~S., {et~al.} 2012, \\apjl,\n  760, L28\n\n\\bibitem[{{Pollack} {et~al.}(1994){Pollack}, {Hollenbach}, {Beckwith},\n  {Simonelli}, {Roush}, \\& {Fong}}]{Pollack1994}\n{Pollack}, J.~B., {Hollenbach}, D., {Beckwith}, S., {et~al.} 1994, \\apj, 421,\n  615\n\n\\bibitem[{{Prieto} {et~al.}(2015){Prieto}, {Jimenez}, {Haiman}, \\&\n  {Gonz{\\'a}lez}}]{Prieto2015}\n{Prieto}, J., {Jimenez}, R., {Haiman}, Z., \\& {Gonz{\\'a}lez}, R.~E. 2015,\n  \\mnras, 452, 784\n\n\\bibitem[{{Safranek-Shrader} {et~al.}(2014){Safranek-Shrader},\n  {Milosavljevi{\\'c}}, \\& {Bromm}}]{Safranek2014MNRAS}\n{Safranek-Shrader}, C., {Milosavljevi{\\'c}}, M., \\& {Bromm}, V. 2014, \\mnras,\n  440, L76\n\n\\bibitem[{{Schleicher} {et~al.}(2016){Schleicher}, {Bovino}, {Latif},\n  {Ferrara}, \\& {Grassi}}]{Schleicher2015}\n{Schleicher}, D.~R.~G., {Bovino}, S., {Latif}, M.~A., {Ferrara}, A., \\&\n  {Grassi}, T. 2016, \\aap, 585, A11\n\n\\bibitem[{{Schneider} {et~al.}(2012{\\natexlab{a}}){Schneider}, {Omukai},\n  {Bianchi}, \\& {Valiante}}]{Schneider2012MNRAS}\n{Schneider}, R., {Omukai}, K., {Bianchi}, S., \\& {Valiante}, R.\n  2012{\\natexlab{a}}, \\mnras, 419, 1566\n\n\\bibitem[{{Schneider} {et~al.}(2006){Schneider}, {Omukai}, {Inoue}, \\&\n  {Ferrara}}]{Schneider2006}\n{Schneider}, R., {Omukai}, K., {Inoue}, A.~K., \\& {Ferrara}, A. 2006, \\mnras,\n  369, 1437\n\n\\bibitem[{{Schneider} {et~al.}(2012{\\natexlab{b}}){Schneider}, {Omukai},\n  {Limongi}, {Ferrara}, {Salvaterra}, {Chieffi}, \\& {Bianchi}}]{Schneider2012}\n{Schneider}, R., {Omukai}, K., {Limongi}, M., {et~al.} 2012{\\natexlab{b}},\n  \\mnras, 423, L60\n\n\\bibitem[{{Seifried} \\& {Walch}(2015)}]{Seifried2015}\n{Seifried}, D., \\& {Walch}, S. 2015, arXiv:1510.06544\n\n\\bibitem[{{Smith} {et~al.}(2015){Smith}, {Wise}, {O'Shea}, {Norman}, \\&\n  {Khochfar}}]{Smith2015}\n{Smith}, B.~D., {Wise}, J.~H., {O'Shea}, B.~W., {Norman}, M.~L., \\& {Khochfar},\n  S. 2015, \\mnras, 452, 2822\n\n\\bibitem[{{Todini} \\& {Ferrara}(2001)}]{Todini2001}\n{Todini}, P., \\& {Ferrara}, A. 2001, \\mnras, 325, 726\n\n\\bibitem[{{Truelove} {et~al.}(1997){Truelove}, {Klein}, {McKee}, {Holliman},\n  {Howell}, \\& {Greenough}}]{Truelove1997}\n{Truelove}, J.~K., {Klein}, R.~I., {McKee}, C.~F., {et~al.} 1997, ApJL, 489,\n  L179\n\n\\bibitem[{{Turk} {et~al.}(2011){Turk}, {Smith}, {Oishi}, {Skory}, {Skillman},\n  {Abel}, \\& {Norman}}]{Turk2011a}\n{Turk}, M.~J., {Smith}, B.~D., {Oishi}, J.~S., {et~al.} 2011, ApJS, 192, 9\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 14056, "prevtext": "\nwith $\\Gamma_{em}$, and $\\Gamma_{abs}$ being the radiation emitted and absorbed by a dust grain, and $\\beta_{e}$ the escape probability (\\citealt{Omukai2000}) defined as\n\n", "index": 7, "text": "\\begin{equation}\n \\beta_e = \\min\\left[1, \\,(\\tau_g+\\tau_d)^{-2}\\right]\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\beta_{e}=\\min\\left[1,\\,(\\tau_{g}+\\tau_{d})^{-2}\\right]\\,.\" display=\"block\"><mrow><mrow><msub><mi>β</mi><mi>e</mi></msub><mo>=</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo>[</mo><mn>1</mn><mo rspace=\"4.2pt\">,</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>τ</mi><mi>g</mi></msub><mo>+</mo><msub><mi>τ</mi><mi>d</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]