[{"file": "1601.07506.tex", "nexttext": "\nwhere the constant interaction \\cite{Beenakker_constant_interaction_QD_1991} energy $E_N = -eV_gN+\\frac{U}{2}N(N-1)$ is used. $V_g$ is the voltage on the plunger gate and $U$ is the Coulomb charging energy. The remaining terms are: \n\n", "itemtype": "equation", "pos": 15356, "prevtext": "\n\\label{mbs_readout}\n\n\\title{Readout of Majorana parity states using a quantum dot}\n\n\\author{Darryl Hoving}\n\\affiliation{Institute for Quantum Computing, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\affiliation{Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\author{Kaveh Gharavi}\n\\affiliation{Institute for Quantum Computing, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\affiliation{Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\author{Jonathan Baugh}\n\\email{baugh@uwaterloo.ca}\n\\affiliation{Institute for Quantum Computing, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\affiliation{Department of Physics and Astronomy, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\\affiliation{Department of Chemistry, University of Waterloo, Waterloo, Ontario N2L 3G1, Canada}\n\n\\date{\\today}\n\\pacs{73.63.Kv, 73.63.Nm, 74.45.+c, 74.78.Na, 85.35.-p}\n\\begin{abstract}\nWe propose and theoretically study a scheme for projectively reading out the parity state of a pair of Majorana bound states (MBS) using a tunnel coupled quantum dot. The dot is coupled to one end of the topological wire but isolated from any reservoir, and is capacitively coupled to a charge sensor for measurement. The combined parity of the MBS-dot system is conserved and charge transfer between the MBS and dot only occurs through resonant tunnelling. Resonance is controlled by the dot potential through a local gate and by the MBS splitting due to the overlap of the MBS pair wavefunctions. The latter splitting can be tuned from zero (topologically protected regime) to a finite value by bringing the spatially separated MBS together via a set of keyboard gates.  Simulations show that the oscillatory nature of the MBS splitting is not a fundamental obstacle to readout, but requires nanoscale precision in the control of the MBS spatial position. With experimentally realistic parameters and fast (sub-ns) control of the dot gate voltage, we find that parity readout fidelities $>99\\%$ are possible if the MBS position is controllable within $\\sim 1$ nm. Use of the scheme to measure the MBS splitting versus separation would present a clear signature of the MBS. We show how the scheme can be extended to distinguish valid parity measurements from invalid ones due to calibration errors.  \n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\\label{sec:intro}\nThe elementary excitations of one-dimensional topological superconductors are Majorana Bound States (MBS), equal to their own anti-particles. This was first discovered by Kitaev \\cite{kitaev}, and has spurred enormous interest \\cite{beenakker_search_for_mf, alicea_new_directions, leijnse_felnsberg_review, tewari_review, DasSarma_Nayak_review_2015, MF_from_ferromagnets_2014, MF_from_ferromagnets_2015, MBS_evolution_of_dos_2015, flensberg_alicea_arxiv_review_2015} from the condensed matter community in the fundamental properties of this novel phase of matter, as well as its potential applications in topological quantum computation (TQC) \\cite{nayak_review, Wu_new_braiding, Ivanov_non_abelian}. One recipe for MBS involves a semiconducting nanowire with a strong spin-orbit coupling, with induced superconductivity due to proximity with an s-wave superconductor. With the application of an external magnetic field of appropriate direction and magnitude, a pair of MBS appear at the ends of the nanowire as edge modes \\cite{lutchynPRL2010_theory,sauPRL2010_theory,sauZBA10,oregPRL2010_theory}. As the MBS are zero energy modes, the ground-state is 2-fold degenerate. Several reports have been made on experimental evidence \\cite{Mourik25052012, Das2012_1, RokhinsonObs2012, DengLundObs12, finkUrbanaObs13, MarcusObs2013} for the existence of this type of MBS, although a complete picture of the physics of systems hosting MBS, including conclusive evidence of the topological nature of the observed ground states, remains out of reach as of yet.\n\nFor the purposes of TQC, the degenerate MBS edge modes can be labelled $|0\\rangle, |1\\rangle$ in the computational basis, according to the \\emph{parity} of the many-body ground state, with $|0\\rangle \\, (|1\\rangle)$ referring to an even (odd) number of electrons. A so-called topological gap protects these states from the environment, providing an intrinsic, hardware-level protection against decoherence \\cite{Alicea2011}. A \\emph{logical} Majorana qubit is defined as the joint state of two MBS pairs within a particular parity manifold \\cite{bravyi_review}. We shall focus on a single MBS pair here, as readout of a logical qubit can be constructed from pair readouts. A bit-flip operation $|0\\rangle \\leftrightarrow |1\\rangle$ can be performed by utilizing the unusual MBS property of non-Abelian anyonic statistics. This involves braiding (physically exchanging the positions of) the two particles. The details of braiding operations were explored in ref. \\cite{Alicea2011}, where it was also shown that these operations, as implemented in a network of quantum wires, benefit from topological error protection. However, in order to obtain a universal set of operations, one needs to supplement braiding with a set of quantum gates that are not topologically protected \\cite{bravyi_review, bravyi_kitaev_clifford_gates, nayak_ising_anyons}. Several proposals exist for achieving universality, such as bringing the MBS close together to break topological protection and applying phase gates \\cite{Alicea2011, bravyi_review}, or coupling MBS with conventional qubits \\cite{fluxQubitReadout10, FlensPRL, flensberg_spin}.\n\nOther challenges facing the realization of TQC are state initialization and readout of the MBS parity states. Following the methodology of the $\\nu = 5/2$ fractional quantum Hall system\\cite{read_green_FQHE, Freedman_FQHE}, a creation/annihilation approach was suggested by Alicea et al. \\cite{Alicea2011}, wherein a pair of MBS are `pulled' from the vacuum of the underlying quantum field, braided to perform computation, and then fused together or `annihilated' to create either vacuum or a finite energy quasiparticle (i.e. a Dirac fermion), depending on the parity state of the MBS. This method requires the detection of the extra quasiparticle, e.g. by measurement of the Josephson current of a junction hosting the MBS to detect the presence or absence of the extra finite energy quasiparticle as the fusion operation is being performed. More recently, other proposals have been put forward relying on quantum dots coupled to MBS to detect the presence \\cite{qdDetection11} and lifetime \\cite{flensberg_lifetime} of topological order, and state transfer between Majorana and charge qubits \\cite{FlensPRL, topo_qbus} or spin \\cite{flensberg_spin} qubits. Note that during fusion or other readout methods the MBS are necessarily taken out of the topologically protected regime. \n\nIn this paper we propose a scheme for readout (or initialization) of the parity state of an MBS pair by tunnel coupling one of the MBS to an isolated quantum dot and using a parity-to-charge conversion mechanism. The minimal setup involves a pair of MBS, a quantum dot (QD) uncoupled to any reservoirs, and a charge sensor to measure the charge state of the QD. As there are no reservoirs present, the joint parity state of the QD + MBS system is conserved. The essence of the readout/initialization procedure is to break topological error protection and remove the ground-state degeneracy. By reducing the spatial separation of the two MBS, the overlap of the MBS wavefunctions grow, resulting in an energy splitting between the $|0\\rangle$ and $|1\\rangle$ states. This splitting is oscillatory and has an exponential envelope versus the MBS separation \\cite{kitaev, splitting_smoking_gun_12}. The QD level is tuned so that a charge transition is on resonance with a target MBS energy splitting, allowing MBS $\\rightarrow$ QD charge transport to occur for one parity state but not the other. Finally, the charge state of the QD is projectively read out using the charge sensor.\n\nWe use numerical simulations with realistic system parameters to show that this setup can be used to map out the energy splitting between the $|0\\rangle$ and $|1\\rangle$ states versus the spatial separation of the MBS pair (or as a function of chemical potential or external magnetic field). It is shown that readout can be performed on a fast timescale of $< 10$ nanoseconds with a high theoretical fidelity of $> 99\\%$. These attributes can be further improved, but at a cost in the precision of voltage and timing controls. The readout procedure does not rely on coherent quantum state transfer between the MBS and the QD, and is therefore not affected by dephasing.\n\nThe manuscript is organized as follows: In section \\ref{sec:model} we present a model for the MBS pair coupled on one end to a quantum dot. In section \\ref{sec:splitting} we discuss how this setup can be used to experimentally determine the energy splitting between the MBS parity states as a function of their separation. The readout and initialization of MBS parity is described and numerically studied in section \\ref{sec:readout}, and concluding remarks are presented in section \\ref{sec:conclusions}.\n\n\\section{Model}\n\\label{sec:model}\nFigure \\ref{fig:schematic}a schematically illustrates the proposed setup for the initialization/readout scheme of the MBS parity state. A semiconducting nanowire with a strong Rashba-type spin-orbit coupling \\cite{Nadj-Perge_Rashba_InSb_2012} is contacted by a bulk s-wave superconductor, resulting in proximity induced superconductivity in the nanowire. The application of an axial magnetic field $\\vec{B} = B \\hat{x}$ of appropriate magnitude results in a phase transition to the topological regime \\cite{lutchynPRL2010_theory}, with a pair of MBS emerging at the edges of the topological region. Using an array of keyboard gates located near one end of the nanowire, the chemical potential in the nanowire can be manipulated to move the edge of the topological region \\cite{aliceaPRB2010_theory, Alicea2011}, thus tuning the separation between the two MBS from an initial value $L_i$ to a final value $L_f$. The MBS at the other end of the nanowire is tunnel coupled to an isolated quantum dot (QD) defined inside the nanowire. The energy level of the QD is controlled by the plunger gate voltage $V_g$, and the strength of the tunnel coupling by $V_t$. In particular, $V_g$ can be tuned such that the energy required to change the electron number on the dot matches the energy splitting of the MBS, i.e. the resonant tunneling condition. A nearby charge sensor, e.g. a single-electron transistor (SET) or quantum point contact, couples capacitively to the QD. A measurement of the sensor current results in a projective measurement of the QD charge state on a measurement timescale $t_m$, typically a few microseconds or longer \\cite{andrea_spin_qubit_2014, marcus_rfqpc}. Readout of the QD charge state is the last stage of the MBS parity readout procedure, and $t_m$ is assumed to be much longer than the timescale for QD $\\leftrightarrow$ MBS resonant tunneling, so the back-action from the charge sensor on the tunneling process is assumed to be negligible.\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.6cm]{fig1}\n\t\\caption{a) Schematic of the proposed device. A bulk s-wave superconductor is in close proximity to a semiconducting nanowire, inducing superconductivity in the nanowire. With the application of an axial (along $\\hat{x}$) magnetic field, a pair of MBS appear at the ends of the topological region. An array of keyboard gates can be used to move MBS 1, tuning the MBS spatial separation from $L_i$ to $L_f$. MBS 2 is tunnel coupled to an isolated quantum dot (QD), with a tunneling strength $\\lambda$ controlled by the gate voltage $V_t$. The chemical potential of the QD can be tuned using the plunger gate voltage $V_g$. A charge sensor reads out the charge state of the QD, shown here as a SET with current $I_{SET}$. b) Schematic of the energy levels of the QD. $U$ is the charging energy, and the charge state is indicated on the left by number of electrons on the QD. Integer $N$ is arbitrarily chosen to be even. Spin states are indicated on the right, with spin singlets (doublets) occurring for even (odd) charge states. A Zeeman splitting $\\delta$ is induced between the spin-1/2 states by the external magnetic field. c) The qualitative behaviour of MBS energy splitting $\\epsilon$ versus the separation $L$ is oscillatory with an exponential envelope. \n\t  \\label{fig:schematic}}\n\\end{figure}\n\nThe two MBS are described by normalized second-quantized operators $\\gamma$, which follow the Majorana fermion rules $\\gamma_i = \\gamma_i^\\dagger$ and $\\gamma_i ^2 = 1$ for $i = 1 , 2$. From these, we define a non-local Dirac fermion, with annihilation/creation operators $f = (\\gamma_1 + i \\gamma_2)/2$, $f^\\dagger = (\\gamma_1 - i \\gamma_2)/2$. The MBS parity state is encoded as a single fermionic mode $|m\\rangle$, where $m \\in \\{0,1\\}$ is the occupation number of the non-local Dirac fermion.\n\nA charge state with $N$ electrons on the QD, $|N\\rangle$, is associated with electrostatic energy $E_N$. For even $N$, electrons are paired and form the spin singlet state $|S\\rangle$; for odd $N$ the excess electron gives an overall spin-up  $\\left| \\uparrow \\right\\rangle$ or spin-down $\\left| \\downarrow \\right\\rangle $ state. A Zeeman splitting is induced for odd $N$ by the applied magnetic field $\\vec{B}$. Figure \\ref{fig:schematic}b shows the QD energy level diagram.\n\nWithout loss of generality, let the QD ground state consist of an even number of electrons $n$. The minimal model of the system consists of three fermionic modes: one each for spin-up and spin-down excitation on the QD and one for the MBS parity state. The charge on the QD is restricted to $n$, $n+1$, or $n+2$ electrons, which is made possible with a suitable choice for the gate voltage $V_g$. The $n \\leftrightarrow n+1$ charge transition of the dot is later brought into resonance with the MBS, and used for parity readout. Charge transitions to the $n-1, n+2$ states, however, are not resonant because of energy separations on the order of the Coulomb charging energy, a few meV. This justifies excluding the $n-1$ state from the model. The $n+2$ state corresponds to both spin modes on the QD being occupied and is therefore included in the model, but its occupation probability remains negligibly small. This minimal model describes the system with an eight-dimensional Hilbert space, which is sufficient to capture the relevant dynamics while also being small enough for efficient numerical simulation.\n\nThe basis states are represented by $|N,\\sigma,m\\rangle$ where, $N \\in \\{n,n+1,n+2\\}$, $\\sigma \\in \\{S,\\uparrow,\\downarrow\\}$, $m \\in \\{0,1\\}$. However, it must be kept in mind that only the spin singlet is allowed for $N = n, n+2$, while for $n+1$ the singlet is disallowed.\n\n\nThe Hamiltonian is composed of four terms: $\\mathcal{H} = \\mathcal{H}_q + \\mathcal{H}_s + \\mathcal{H}_m + \\mathcal{H}_t$, where the first three terms are diagonal and represent the dot charge, dot spin, and MBS energies, and $\\mathcal{H}_t$ represents the tunnel coupling between the QD and MBS. The dot charge term is\n\n", "index": 1, "text": "$$\\mathcal{H}_q|N\\rangle = E_N|N\\rangle ,$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{H}_{q}|N\\rangle=E_{N}|N\\rangle,\" display=\"block\"><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>q</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>N</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>E</mi><mi>N</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>N</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\nwhere $\\delta = g \\mu_B B$ is the Zeeman energy of the dot spin, $\\epsilon$ is the MBS energy splitting (which depends on the MBS separation $L$), $\\lambda$ is the strength of the dot-MBS tunnel coupling, $d_{\\sigma} (d_{\\sigma}^{\\dagger})$ annihilates (creates) an electron with spin $\\sigma$ on the dot, and $f, f^\\dagger$ describe the non-local fermion defined previously. Spin rotations induced by the nanowire spin-orbit coupling during the tunnelling process are neglected. A spin-dependent tunnelling constant \\cite{flensberg_spin} is used, $\\lambda_{\\uparrow} = \\lambda$ and $\\lambda_{\\downarrow} = -i\\lambda$, due to the fact that the MBS spin is polarized along $\\pm\\hat{y}$ while the dot spin is along $\\pm\\hat{x}$. A matrix representation of the $d_\\sigma, f$ operators is given in the Supplemental Material.\n\nThe MBS splitting $\\epsilon$ is proportional the overlap of the MBS wavefunctions \\cite{kitaev, splitting_smoking_gun_12}, which are localized at the edges of the topological region. The wavefunctions decay exponentially inside the topological region, with a characteristic length $\\xi$ on the order of the phase coherence length inside the nanowire. For $L \\gg \\xi$, the parity states are sufficiently degenerate for topological protection of the system. As $L$ is shortened, the splitting oscillates within an exponentially increasing envelope, as described in ref. \\cite{splitting_smoking_gun_12}. This is illustrated qualitatively in Figure \\ref{fig:schematic}c. In the regime $L \\gtrsim \\xi$, ref. \\cite{splitting_smoking_gun_12} gives the splitting as a function of $L$ as:\n\n", "itemtype": "equation", "pos": 15633, "prevtext": "\nwhere the constant interaction \\cite{Beenakker_constant_interaction_QD_1991} energy $E_N = -eV_gN+\\frac{U}{2}N(N-1)$ is used. $V_g$ is the voltage on the plunger gate and $U$ is the Coulomb charging energy. The remaining terms are: \n\n", "index": 3, "text": "\\begin{align}\n\\mathcal{H}_s &= \\frac{\\delta}{2} (\\ket{\\uparrow}\\bra{\\uparrow} - \\ket{\\downarrow}\\bra{\\downarrow} ), \\nonumber \\\\\n\\mathcal{H}_m &= \\frac{\\epsilon}{2} (f^{\\dagger}f - \\frac{1}{2}), \\nonumber \\\\\n\\mathcal{H}_{t} &= [\\lambda (d_{\\uparrow} - d^{\\dagger}_{\\uparrow}) - i\\lambda (d_{\\downarrow} + d^{\\dagger}_{\\downarrow}) ] (f^{\\dagger} + f), \\nonumber \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{s}\" display=\"inline\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>s</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{\\delta}{2}(\\ket{\\uparrow}\\bra{\\uparrow}-\\ket{\\downarrow}%&#10;\\bra{\\downarrow}),\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>δ</mi><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↑</mo><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mo>↑</mo><mo fence=\"true\" stretchy=\"false\">|</mo></mrow></mrow><mo>-</mo><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mo>↓</mo><mo fence=\"true\" stretchy=\"false\">|</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{m}\" display=\"inline\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>m</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{\\epsilon}{2}(f^{\\dagger}f-\\frac{1}{2}),\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>ϵ</mi><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>f</mi><mo>†</mo></msup><mo>⁢</mo><mi>f</mi></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{t}\" display=\"inline\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>t</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=[\\lambda(d_{\\uparrow}-d^{\\dagger}_{\\uparrow})-i\\lambda(d_{%&#10;\\downarrow}+d^{\\dagger}_{\\downarrow})](f^{\\dagger}+f),\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>d</mi><mo>↑</mo></msub><mo>-</mo><msubsup><mi>d</mi><mo>↑</mo><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>λ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>d</mi><mo>↓</mo></msub><mo>+</mo><msubsup><mi>d</mi><mo>↓</mo><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>f</mi><mo>†</mo></msup><mo>+</mo><mi>f</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\nwhere $\\tilde{k}_F$ is the effective Fermi wave-vector of the MBS wavefuctions inside the nanowire, and $m^*$ is the effective electron mass. We show in the next section how a series of experiments can be used to map out $\\epsilon(L)$. Precise knowledge of this function is required for the MBS parity readout scheme described in section \\ref{sec:readout}.\n\n\\section{MBS energy splitting}\n\\label{sec:splitting}\nIn section \\ref{sec:subsec_fixed_L}, we describe how to measure the MBS splitting $\\epsilon$ at fixed $L$ using resonant tunnelling with the QD. In section \\ref{sec:subsec_varied_L}, $L$ is varied to show how the function $\\epsilon(L)$ is mapped out. Throughout the paper, we have used the following parameters relevant to experiments on InSb nanowires. The effective mass is $m^* = 0.014 m_e$ ($m_e$ is the electron mass). A Land\\'{e} $g$-factor of $50$ is used for both the topological wire and the quantum dot, and the quantum dot charging energy is $U = 5$ meV. An effective superconducting gap of $\\Delta = 0.5$ meV opens in the regions of the nanowire proximate to the superconductor. An external axial magnetic field $\\vec{B} = B \\hat{x}$ of magnitude $B = 0.75$ T induces topological order in the superconducting section of the nanowire, where a chemical potential $\\mu = 2$ meV is assumed. The thermal energy $kT$ is assumed to be much smaller than the superconducting gap, $kT \\ll \\Delta$, and also the topological gap $kT \\ll |\\delta - \\sqrt {\\mu^2 + \\Delta^2}|$. Under these conditions, the low energy states of the topological superconductor (i.e. the MBS) are well separated from all higher energy states, including the bulk superconducting states. The MBS are therefore isolated from the superconducting `lead'. As the quantum dot in our scheme is also isolated from any metallic leads, we can safely assume that temperature plays no role in the tunnelling, which occurs between two isolated two-level systems. \n\n\\subsection{Fixed MBS separation}\n\\label{sec:subsec_fixed_L}\nWe fix the MBS pair separation so that the energy splitting $\\epsilon$ at a value $\\epsilon^*$ smaller than the (proximity) superconducting gap $\\Delta$, hence the MBS do not couple to the continuum of quasi-particle states. The $|1\\rangle , |0\\rangle$ MBS parity states are then at energies $+\\epsilon^{*} / 2, -\\epsilon^{*}/2$ respectively. The gate voltage $V_g$ is tuned so that the number of electrons on the QD is $n$, as measured by the charge sensor. \n\nFirst, consider an initial MBS parity state $|1\\rangle$, so the initial state of the system is $|\\psi_i\\rangle = |n, S, 1\\rangle$. The process $|n, S, 1\\rangle \\leftrightarrow |n+1, \\sigma, 0\\rangle$ is resonant when $\\epsilon^*$ equals the energy cost $\\Delta E_{n,\\sigma}$ of the $|n,S\\rangle \\rightarrow |n+1, \\sigma \\rangle$ transition of the dot, with $\\sigma = \\uparrow$ or $\\downarrow$. From the constant interaction model, we have $\\Delta E_{n,\\sigma} = -eV_g + nU \\pm \\delta/2$, where the Zeeman energy $\\delta = g \\mu_B B$ enters with a plus (minus) sign for $\\sigma = \\uparrow (\\downarrow)$. Determining $\\epsilon^*$ is based on finding the resonant gate voltage $V^*$. The value for the resonant gate voltage depends on the initial MBS parity state; starting with the lower energy state $|0\\rangle$, the two available processes $|n, S, 0\\rangle \\leftrightarrow |n+1, \\sigma, 1\\rangle$ and $|n, S, 0\\rangle \\leftrightarrow |n-1, \\sigma, 1\\rangle$ are both \\emph{off-resonance} at the $V^*$ given above. The first of the two processes is resonant at $V_g =  V^{*} + 2 \\epsilon^*/e$ and the latter at $V_g = V^* + \\delta/e - U/e$. This allows the MBS-dot setup to distinguish between the two MBS parity states. First, we focus on finding $\\epsilon^*$.\n\nA procedure for determining $\\epsilon^*$ is depicted in figure \\ref{fig:optimize}, and is comprised of three steps: (i) The system starts in the state $|\\psi_i \\rangle$ with $V_g$ tuned to an initial value $V_0$, and $V_t$ at a large negative value so that tunnelling between the MBS and QD is suppressed. At $t=0$, the tunnel coupling is turned on to a value $\\lambda = h \\times 100\\; \\mathrm{MHz}$ by tuning $V_t$. Then, at $t = 2$ ns, $V_g$ is rapidly ramped up to a trial value $V^\\mathrm{trial}$, such that $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$ at all times $t$, i.e. the state evolution is fast and non-adiabatic. This point is further discussed below. (ii) $V_g$ is held constant for the duration $T^\\mathrm{trial}$, then (iii) rapidly ramped down to its initial value. The tunnel coupling is then turned off at $t = 7$ ns. Figure \\ref{fig:optimize}a shows $V_g$ versus time, with ($V^\\mathrm{trial}, T^\\mathrm{trial}$) = ($V^*, T^*$), the values which produce resonant MBS-dot charge transfer for the chosen system parameters. The corresponding probability for charge transfer is shown in figure \\ref{fig:optimize}b. Note there are two possible values for $V^*$ due to Zeeman splitting on the QD, labelled $V^{*}_\\sigma$ for $\\sigma = \\uparrow, \\downarrow$. Here, the spin-down state of the QD is used.\\\\\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.6cm]{fig2}\n\t\\caption{Procedure for determining $\\epsilon$ for a fixed $L$: gate voltage $V_g$, and calculated probability of having $n+1$ electrons on the quantum dot, $\\Pi_\\mathrm{n+1}$, versus time. Panels a, b show the case in which the MBS and dot are brought into perfect resonance for the optimal charge transfer time.  a) $V_g$ is raised from the initial value $V_0$ to the resonance value $V^* = 20\\, \\mu$V, and held there for the optimal duration $T^* = 2.5$ ns, before being returned to $V_0$. The sequence is broken into three steps (i-iii). b) The corresponding probability $\\Pi_{n+1}$ goes from zero to $> 99\\% $. Panels c, d show three cases involving miscallibration of $V^*$ and $T^*$. c) Voltage sequences with $V^\\mathrm{trial} = V^* +2\\, \\mu$V and $T = T^* - 1$ ns (curve `\\textbf{\\textit{a}}'), $T^{\\mathrm{trial}} = T^*$ and $V^\\mathrm{trial} = V^* -1\\, \\mu$V (curve `\\textbf{\\textit{b}}'), $V^\\mathrm{trial} = V^*$ and $T^{\\mathrm{trial}} = T^* +1$ ns (curve `\\textbf{\\textit{c}}'). d) Probabilities $\\Pi_{n+1}$ corresponding to the sequences in panel c. In all panels, the vertical dashed lines show the optimal duration $T^*$ for resonant charge transfer. The following parameters are used: $\\lambda/h = 100$ MHz,  $L = 1.12\\, \\mu$m, $\\mu = 2$ meV, $B=0.75$ T. These correspond to $\\epsilon^* = 20 ~\\mu$eV.\n\t  \\label{fig:optimize}}\n\\end{figure}\n\n\\emph{Diabatic sweep of $V_g$ and Rabi oscillations} -- Let us explore the resonant state transfer process (figure \\ref{fig:optimize}a) in more detail. Starting at $V_0$, $V_g$ is rapidly swept to $V^{*}_\\downarrow$ such that $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$. At this gate voltage, the states $|n,S,1\\rangle$ and $|n+1, \\downarrow, 0\\rangle$ anti-cross due to the tunnel coupling $\\lambda$. The eigenstates of the system are $|\\pm\\rangle = (\\sqrt{2})^{-1} (|n,S,1\\rangle \\pm |n+1,\\downarrow,0\\rangle)$. However, since $V_g$ was swept diabatically, the system stays in its initial state $|\\psi_i \\rangle = |n,S,1 \\rangle = (\\sqrt{2})^{-1}(|+\\rangle + |-\\rangle)$. A Rabi oscillation occurs in the $\\left\\lbrace |+\\rangle, |-\\rangle \\right\\rbrace$ subspace, and after time $T^*$ the state of the system is $(\\sqrt{2})^{-1}(|+\\rangle - |-\\rangle) =$ $|n+1,\\downarrow,0\\rangle$, up to an unimportant global phase. The system stays in this state after a rapid sweep of $V_g$ away from the anti-crossing point. Figure \\ref{fig:optimize}b shows the simulated outcome of this process, obtained by numerically solving the time-dependent Schr{\\\"o}dinger equation (TDSE) to find $|\\psi (t)\\rangle$, the system state at time $t$. The quantity of interest is the probability of finding the dot in the $n+1$ charge state (with either spin), $\\Pi_\\mathrm{n+1}  (t) = \\sum _{\\sigma = \\uparrow, \\downarrow} |\\langle n+1, \\sigma, 0 |\\psi (t)\\rangle|^2$. It can be seen that $\\Pi_\\mathrm{n+1}$ goes from zero to $> 99 \\%$.\n\nBy comparison, panels c,d of figure \\ref{fig:optimize} pertain to the case of off-resonance charge transfer. For the same value of the initial gate voltage $V_0$ as in panel a, panel c shows $V_g$ versus time when $V^\\mathrm{trial} = V^* +2\\; \\mu$V and $T = T^* - 1$ ns (curve `\\textbf{\\textit{a}}'), $T^{\\mathrm{trial}} = T^*$ and $V^\\mathrm{trial} = V^* -1\\; \\mu$V (curve `\\textbf{\\textit{b}}'), $V^\\mathrm{trial} = V^*$ and $T^{\\mathrm{trial}} = T^* +1$ ns (curve `\\textbf{\\textit{c}}'). The corresponding $\\Pi_{\\mathrm{n+1}}$ values are shown in figure \\ref{fig:optimize}d, and indicate significant decreases compared to figure \\ref{fig:optimize}b. The results indicate that the precision required for external control of voltage and time should be at the $100$ nV and $100$ ps levels, respectively, to ensure a transfer probability close to 1. Both requirements can in principle be satisfied with current technologies.\n\nA small ripple oscillation can be seen in figures \\ref{fig:optimize}b and \\ref{fig:optimize}d. This is due to a finite off-resonant dot-MBS coupling when the initial voltage $V_0$ is not very far from the resonant voltage $V^*$. In figures \\ref{fig:optimize}b and \\ref{fig:optimize}d, the $V^*-V_0$ is only $20\\; \\mu$V. In section \\ref{sec:readout}, we use a much larger value $\\sim 1.3\\; \\mathrm{mV}$ for this difference that effectively suppresses this ripple.\\\\\n\n\\emph{Measurement of $\\epsilon^*$} -- To determine $V^*$ and $T^*$, one would repeat the sequence (i-iii) many times for each set of trial input parameters, each time measuring the charge state of the dot using the SET after step (iii). The frequency of the $|n+1\\rangle$ outcomes yields an estimate of $\\Pi_{n+1}$. The parameter space $(V,T)$ is then surveyed to find the resonant tunnelling time $T^* = h/\\lambda$ and gate voltages $V^{*}_\\uparrow, V^{*}_\\downarrow$. Choosing the resonance with the spin-down state of the QD, the MBS splitting is given by\n\n", "itemtype": "equation", "pos": 17610, "prevtext": "\nwhere $\\delta = g \\mu_B B$ is the Zeeman energy of the dot spin, $\\epsilon$ is the MBS energy splitting (which depends on the MBS separation $L$), $\\lambda$ is the strength of the dot-MBS tunnel coupling, $d_{\\sigma} (d_{\\sigma}^{\\dagger})$ annihilates (creates) an electron with spin $\\sigma$ on the dot, and $f, f^\\dagger$ describe the non-local fermion defined previously. Spin rotations induced by the nanowire spin-orbit coupling during the tunnelling process are neglected. A spin-dependent tunnelling constant \\cite{flensberg_spin} is used, $\\lambda_{\\uparrow} = \\lambda$ and $\\lambda_{\\downarrow} = -i\\lambda$, due to the fact that the MBS spin is polarized along $\\pm\\hat{y}$ while the dot spin is along $\\pm\\hat{x}$. A matrix representation of the $d_\\sigma, f$ operators is given in the Supplemental Material.\n\nThe MBS splitting $\\epsilon$ is proportional the overlap of the MBS wavefunctions \\cite{kitaev, splitting_smoking_gun_12}, which are localized at the edges of the topological region. The wavefunctions decay exponentially inside the topological region, with a characteristic length $\\xi$ on the order of the phase coherence length inside the nanowire. For $L \\gg \\xi$, the parity states are sufficiently degenerate for topological protection of the system. As $L$ is shortened, the splitting oscillates within an exponentially increasing envelope, as described in ref. \\cite{splitting_smoking_gun_12}. This is illustrated qualitatively in Figure \\ref{fig:schematic}c. In the regime $L \\gtrsim \\xi$, ref. \\cite{splitting_smoking_gun_12} gives the splitting as a function of $L$ as:\n\n", "index": 5, "text": "\\begin{equation}\\label{eq:epsilon_L}\n\\epsilon (L) \\approx \\hbar^2 \\tilde{k}_F \\frac{e^{-2L/\\xi}}{m^* \\xi} \\cos{\\tilde{k}_F L},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\epsilon(L)\\approx\\hbar^{2}\\tilde{k}_{F}\\frac{e^{-2L/\\xi}}{m^{*}\\xi}\\cos{%&#10;\\tilde{k}_{F}L},\" display=\"block\"><mrow><mrow><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><msup><mi mathvariant=\"normal\">ℏ</mi><mn>2</mn></msup><mo>⁢</mo><msub><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">~</mo></mover><mi>F</mi></msub><mo>⁢</mo><mfrac><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>L</mi></mrow><mo>/</mo><mi>ξ</mi></mrow></mrow></msup><mrow><msup><mi>m</mi><mo>*</mo></msup><mo>⁢</mo><mi>ξ</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><msub><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">~</mo></mover><mi>F</mi></msub><mo>⁢</mo><mi>L</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\n\\emph{Mixture of parity states} -- The calibration procedure as described here assumes the ability to reliably prepare the MBS in a particular parity state. Suppose, instead, that one can only prepare the MBS in a statistical mixture $\\rho = p|0\\rangle\\langle0|+(1-p)|1\\rangle\\langle1|$. Then, due to the sharp dependence of transition probability on $V_g$, the procedure would still be effective at measuring $\\epsilon^*$. We noted that if $V^*$ corresponds to the resonant gate voltage for the higher (lower) energy parity state then the other state will be resonant at $V_g = V^* + 2\\epsilon/e$ ($V_g = V^* - 2\\epsilon/e$). Thus, one would observe two peaks in $\\Pi_{n+1} (t)$ of height $p$ and $1-p$, separated by $2\\epsilon^*$ along the $V_g$-axis (plus an additional pair separated from the first by $\\delta/e$ for transitions to the other dot spin state).\n\n\\subsection{Energy splitting versus MBS separation}\n\\label{sec:subsec_varied_L}\nThe procedure outlined in the previous section may be repeated for a variety of $L$ values using the keyboard gates, thereby allowing the experimenter to map out the oscillatory function $\\epsilon(L)$. In the Supplemental Material, we estimate the typical spatial period of the oscillations of $\\epsilon$ to be $\\sim 30 \\; \\mathrm{nm}$. Therefore, reliably varying $\\epsilon$ with a precision $\\sim 100\\; \\mathrm{neV}$ requires tuning $L$ (e.g. using keyboard gates) with a precision at the $\\sim$ 1 nm level. \n\nEmpirical measurement of the function $\\epsilon(L)$ is itself desirable, as it is a direct test of the validity of Eq. \\eqref{eq:epsilon_L} and would be strong evidence for the non-local nature of the MBS wavefunctions and the presence of topological order. The search over the $(V,T)$ parameter space at each $L$ point can be sped up by noting that $T^*$ depends only on the tunnel coupling strength $\\lambda$ (Supplementary Material), which can be assumed constant, reducing the optimization to a one dimensional search for $V^*$ once $T^*$ is known. \n \nAlong with the dependence of $\\epsilon$ on MBS separation, the dependence of $\\epsilon$ on other physical parameters such as the strength of the Zeeman field and the chemical potential may be mapped out. Although only the $L$-dependence is required for our proposed read out scheme, the model for the MBS system described in ref. \\cite{splitting_smoking_gun_12} may be empirically tested with respect to several independent variables. Below, we describe how knowledge of the function $\\epsilon(L)$ may be used for readout of the MBS parity state.\n\n\n\n\\section{Parity readout}\n\\label{sec:readout}\n\n\n\n\n\\emph{Initial state} -- The keyboard gates separate the two MBS by $L_i = 5\\, \\mu$m where the two parity states are degenerate, given the parameters we've chosen. From data collected by the calibration procedure in section \\ref{sec:subsec_varied_L}, a target readout length $L_f$ for the topological wire is chosen. At $L_f$, the MBS splitting $\\epsilon(L_f)$ is such that $\\epsilon(L_f) > \\epsilon(L)$ for all $L > L_f$, so $L_f$ corresponds to a local peak of the function $\\epsilon(L)$. For the numerical calculation of the TDSE, we choose $L_f = 0.775\\, \\mu$m, resulting in $\\epsilon(L_f) = 49\\, \\mu$eV. The optimal gate voltage $V^{*}_\\downarrow$ at $L_f$ for resonance with the spin-down dot state is assumed to be known, based on the calibration procedure above. Since $L_f$ corresponds to a peak in $\\epsilon (L)$, resonance with the dot does not occur for $L > L_f$. The dot is initially in the $|n,S\\rangle$ state, where we have arbitrarily chosen $n = 20$. The gate voltage $V_g$ is initially held at a value $V_0 = (1/e)U(n-1/2)$, halfway between the $(n+1)\\leftrightarrow n$ and $n\\leftrightarrow(n-1)$ charge degeneracy points of the QD, so $V^{*}_\\downarrow - V_0 =(1/e)( U/2 - \\delta/2 - \\epsilon) \\simeq 1.3$ mV. To restrict the dot to the $\\{ |n\\rangle$, $|n+1\\rangle \\}$ charge states, it is necessary that $V_g$ is kept within the range $(n-1)U + \\epsilon + \\delta/2 < eV_g \\leq eV^{*}_\\downarrow = nU -\\epsilon - \\delta/2$ at all times. \\\\\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.6cm]{fig3}\n\t\\caption{Readout procedure (stages i-iii) of the MBS parity state as described in the text. The MBS is initially in the $|1\\rangle$ parity state. a) The MBS separation $L$ (blue/dark grey) and the corresponding MBS splitting $\\epsilon (L)$ (black) as predicted from Eq. \\ref{eq:epsilon_L}. b) The gate voltage $V_g$ (blue/dark grey) and the calculated probability of adding a charge to the dot, $\\Pi_{n+1}$, versus time (black). As $V_g$ is tuned to the resonant voltage, the probability of finding $n+1$ electrons on the dot rises from zero to a value greater than 0.9999. Conversely, if MBS initial state is $|0\\rangle$, the maximum $\\Pi_{n+1}$ obtained is 0.004 (not shown). A charge readout of the dot then constitutes a readout of the MBS parity state. A tunnelling strength  $\\lambda/h = 100$ MHz is used in the numerical calculations.\n\t  \\label{fig:readout}}\n\\end{figure}\n\n\\emph {MBS Parity readout procedure} -- With the system in its initial configuration, there are three stages of the read out, labelled (i), (ii), and (iii) in Fig. \\ref{fig:readout}. In Fig. \\ref{fig:readout}a, the MBS separation $L$, and the energy splitting $\\epsilon (L)$ are shown as a function of time. Fig. \\ref{fig:readout}b shows the gate voltage $V_g$, and the simulated probability $\\Pi_\\mathrm{n+1}  (t) = \\sum _{\\sigma = \\uparrow, \\downarrow} |\\langle n+1, \\sigma, 0 |\\psi (t)\\rangle|^2$, with the MBS initially in the $|1\\rangle$ parity state. Considering each stage in turn:\n\nStage (i):\nThe keyboard gates move the left MBS towards the tunnel coupled end so that the MBS separation is reduced from $L_i = 5\\, \\mathrm{\\mu m}$ to $L_f = 0.775\\, \\mathrm{\\mu m}$. This is performed uniformly over a duration of 10 ns in our calculation. The adiabaticity condition  $|\\Delta - \\epsilon|^2 \\gg \\hbar |d \\epsilon / d t|$ is satisfied at all times, so the probability of coupling to the continuum of quasi-particle states above and below $\\Delta$ is negligible. Note that this step could be carried out more slowly if necessary. The parity eigenstates are \\emph{preserved} under this transformation, as their levels cross but do not couple. At the end of this stage, $V_g$ controlling the dot potential is rapidly switched from $V_0$ to $V^{*}_\\downarrow$. As discussed in section \\ref{sec:subsec_fixed_L}, this transition is \\emph{diabatic}, with $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$. In our calculation the voltage ramping time is 1 ns.\n\nStage (ii):\nThe control parameters are held fixed for the optimal tunneling time $T^*$, which is $2.5$ ns in the case simulated here. With the MBS initially in the $|1\\rangle$ state, the $|n,S,1\\rangle \\leftrightarrow$ $|n+1,\\downarrow,0\\rangle$ transition is on resonance, and an electron will tunnel from the topological wire to the dot with transition probability very close to one (Fig. \\ref{fig:readout}b). \n\nIf, however, the MBS was initially in the $|0\\rangle$ state, changing the parity state will \\emph{cost} (rather than supply) an energy $\\epsilon(L_f)$. The corresponding process, $|n, S, 0\\rangle \\leftrightarrow |n+1, \\downarrow, 1\\rangle$, is off resonance -- its resonant gate voltage is $V_g =  V^{*}_\\downarrow + 2 \\epsilon/e$. For the $|0\\rangle$ parity state then, the procedure illustrated in Fig. \\ref{fig:readout} would result in an electron transfer probability very close to zero.\n\nStage (iii):\nThe reverse of stage (i), the gate voltage is rapidly ramped back to $V_0$ and the keyboard gates are used to move the left MBS back to its initial position. With the initial system configuration restored, a charge measurement of the dot is performed via the charge sensor. A measurement of $n+1$ indicates with high probability that the initial MBS state was $|1\\rangle$ while a measurement of $n$ indicates with high probability that the initial MBS state was $|0\\rangle$. Hence, the final charge measurement amounts to a projective measurement on the MBS in the parity basis. \n\nNote that resonance with either spin state on the dot may be selected with the appropriate choice of the resonant gate voltage: $V^{*}_\\downarrow$ for spin-down, or $V^{*}_\\uparrow = V^{*}_\\downarrow + \\delta/e$ for spin-up.  Here, the the spin-down state was chosen so that only a single pair of states, $|n,S,1\\rangle$ and $|n+1,\\downarrow,0\\rangle$, are resonant at any point during the three stages. If instead the spin-up state is selected so that $|n,S,1\\rangle$ and $|n+1,\\uparrow,0\\rangle$ are resonant during stage (ii), there will be brief periods of resonance between $|n,S,1\\rangle$ and $|n+1,\\downarrow,0\\rangle$ during stages (i) and (iii), which generally lowers the fidelity of readout. \n\n\\emph{Fidelity of readout} -- Using the parameters given previously and with $\\epsilon(L_f) = 49\\; \\mu$eV, the numerically obtained probability of finding $n+1$ electrons on the dot after stage (iii) is greater than $0.9996$ with the MBS initially in $|1\\rangle$. The probability of finding $n$ electrons is greater than $0.9999$ with the MBS initially in $|0\\rangle$. The readout scheme therefore allows the two MBS states to be distinguished with a visibility up to 0.9996, defined simply as the smaller of the two probabilities above. The term `readout fidelity' is used interchangeably with this visibility in this paper. The residual error here is dominated by the finite voltage ramping time: a faster ramp would increase the visibility. However, so far we haven't considered practical limitations on control precision (this is discussed below), so the preceding fidelity results are idealized.  \\\\\n\n\\emph {Bias in parity readout due to miscalibration} -- Throughout the readout operation (stages i-iii), it was assumed that the calibration of $\\epsilon(L)$ performed in section \\ref{sec:subsec_varied_L} is valid. Drift or noise in the applied voltage or pulse timing will cause miscalibration errors and bias the charge measurement outcome in favour of $n$ over $n+1$ (see figure \\ref{fig:optimize}), i.e. a bias towards detecting $|0\\rangle$ over $|1 \\rangle$ for the MBS parity. However, a straightforward modification of our scheme allows for distinguishing a calibration error from a genuine $|0\\rangle$ outcome. This is done by appending a second readout operation involving transport to the $n-1$ charge state of the QD.\n\nStarting with $V_g$ at $V_0 = (1/e)U(n-1/2)$, i.e. halfway between the $(n+1)\\leftrightarrow n$ and $n\\leftrightarrow (n-1)$ charge degeneracy points of the QD, two parity-to-charge conversions are attempted: First, $|n, S, 1 \\rangle \\rightarrow |n+1, \\downarrow, 0\\rangle$, by using the resonance at gate voltage $V^{*}_\\downarrow = V_0 + (1/e) ( U/2 -\\delta/2 -\\epsilon )$ as described previously. Subsequently, the $|n, S, 0 \\rangle \\rightarrow |n-1, \\downarrow, 1\\rangle$ transition is made resonant at $V_g = V_0 + (1/e) ( -U/2 +\\delta/2 +\\epsilon ) $. A charge readout of the QD distinguishes the following outcomes: $n+1$ electrons indicates with high probability that the initial MBS state was $|1\\rangle$, while $n-1$ indicates $|0\\rangle$. The outcome $n$ indicates no resonance for either process (i.e. a calibration error), thus providing an \\emph{in situ} test for the validity of the parity readout procedure.\\\\\n\n\\emph {Sensitivity to precision of control} -- For the parameters chosen in our simulations, the MBS separation $L$ must be controlled within approximately 1 nm in order to maintain an accuracy $> 99\\%$ in distinguishing the parity outcomes. A similar success rate can be achieved with a range of parameters, so these numbers may be considered typical. Indeed, the tolerance can be improved by about a factor of three by choosing parameters at the edge of the topological phase region that correspond to about three times longer period for the MBS energy oscillations -- however such a case is far less typical. Alternatively, the effect of tunnel broadening may be exploited to reduce the sharpness of the resonance condition and increase robustness. For concreteness, we solved the TDSE again with tunnel coupling strength of 1 GHz, which allowed a tolerance of $\\pm 4$ nm in the keyboard gate precision while still maintaining a readout fidelity of $\\sim 97\\%$, at the cost of reducing $T^*$ by a factor of 10. By comparison, the 100 MHz tunnel coupling with a $4$ nm error yields a significantly lower visibility of $\\sim 3 \\%$. There is thus a tradeoff between the required precision of spatial control of the MBS separation versus the timing precision of gate voltage control. \\\\\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nWe demonstrated the theoretical basis for a protocol to read out the parity of an MBS pair in a topological superconductor. The MBS pair is brought from a well-separated (topologically protected) state to a spatially overlapping (unprotected) state in which there is a finite energy splitting; one MBS is then resonantly coupled with an isolated quantum dot. The MBS parity state is projectively measured by a charge measurement acting on the quantum dot, and we showed that this can be accomplished in principle with high readout fidelity. This can easily be extended to the readout of a logical qubit based on two MBS pairs. This protocol could be advantageous compared to anyon fusion across a Josephson junction, as it is straightforward to measure the charge on a quantum dot after performing parity-to-charge conversion.\n\nAs an intermediate step, we discussed a calibration procedure one would use to map out the MBS splitting versus separation, $\\epsilon(L)$. The result of such an experiment is predicted in ref. \\cite{splitting_smoking_gun_12} and confirmation of this would be strong evidence for the presence of topological order and MBS. Hence, apart from its potential use in quantum information processing, the proposed experiment would be a valuable probe for topological physics in a condensed matter system. As with any projective measurement, the protocol can also be used to prepare the MBS into a desired parity eigenstate. The key for both readout and state preparation is that parity eigenstates are preserved under adiabatic motion of the MBS separation. \\\\\n\n\n\\begin{acknowledgements}\n\nWe thank K. Flensberg for helpful discussions. D. H. thanks M. Mosca for guidance and discussions. This work was supported by the Natural Sciences and Engineering Research Council of Canada and the Ontario Ministry for Research and Innovation.\n\n\\end{acknowledgements}\n\n\\begin{thebibliography}{10}\n\n\\bibitem{kitaev}\nA.~Y. Kitaev,\n\\newblock Physics-Uspekhi {\\bf 44}, 131 (2001).\n\n\\bibitem{beenakker_search_for_mf}\nC.~Beenakker,\n\\newblock Annual Review of Condensed Matter Physics {\\bf 4}, 113 (2013).\n\n\\bibitem{alicea_new_directions}\nJ.~Alicea,\n\\newblock Reports on Progress in Physics {\\bf 75}, 076501 (2012).\n\n\\bibitem{leijnse_felnsberg_review}\nM.~Leijnse and K.~Flensberg,\n\\newblock Semiconductor Science and Technology {\\bf 27}, 124003 (2012).\n\n\\bibitem{tewari_review}\nT.~D. Stanescu and S.~Tewari,\n\\newblock Journal of Physics: Condensed Matter {\\bf 25}, 233201 (2013).\n\n\\bibitem{DasSarma_Nayak_review_2015}\nS.~{Das Sarma}, M.~Freedman, and C.~Nayak,\n\\newblock Npj Quantum Information {\\bf 1}, 15001 EP (2015),\n\\newblock Review Article.\n\n\\bibitem{MF_from_ferromagnets_2014}\nJ.~Li, H.~Chen, I.~K. Drozdov, A.~Yazdani, B.~A. Bernevig, and A.~H. MacDonald,\n\\newblock Phys. Rev. B {\\bf 90}, 235433 (2014).\n\n\\bibitem{MF_from_ferromagnets_2015}\nH.-Y. Hui, P.~M.~R. Brydon, J.~D. Sau, S.~Tewari, and S.~D. Sarma,\n\\newblock Scientific Reports {\\bf 5}, 8880 EP (2015),\n\\newblock Article.\n\n\\bibitem{MBS_evolution_of_dos_2015}\nT.~Kawakami and X.~Hu,\n\\newblock Phys. Rev. Lett. {\\bf 115}, 177001 (2015).\n\n\\bibitem{flensberg_alicea_arxiv_review_2015}\nD.~{Aasen}, M.~{Hell}, R.~V. {Mishmash}, A.~{Higginbotham}, J.~{Danon},\n  M.~{Leijnse}, T.~S. {Jespersen}, J.~A. {Folk}, C.~M. {Marcus},\n  K.~{Flensberg}, and J.~{Alicea},\n\\newblock ArXiv e-prints  (2015), 1511.05153.\n\n\\bibitem{nayak_review}\nC.~Nayak, S.~H. Simon, A.~Stern, M.~Freedman, and S.~{Das Sarma},\n\\newblock Rev. Mod. Phys. {\\bf 80}, 1083 (2008).\n\n\\bibitem{Wu_new_braiding}\nL.-H. Wu, Q.-F. Liang, and X.~Hu,\n\\newblock Science and Technology of Advanced Materials {\\bf 15}, 064402 (2014).\n\n\\bibitem{Ivanov_non_abelian}\nD.~A. Ivanov,\n\\newblock Phys. Rev. Lett. {\\bf 86}, 268 (2001).\n\n\\bibitem{lutchynPRL2010_theory}\nR.~M. Lutchyn, J.~D. Sau, and S.~{Das Sarma},\n\\newblock Phys. Rev. Lett. {\\bf 105}, 077001 (2010).\n\n\\bibitem{sauPRL2010_theory}\nJ.~D. Sau, R.~M. Lutchyn, S.~Tewari, and S.~{Das Sarma},\n\\newblock Phys. Rev. Lett. {\\bf 104}, 040502 (2010).\n\n\\bibitem{sauZBA10}\nJ.~D. Sau, S.~Tewari, R.~M. Lutchyn, T.~D. Stanescu, and S.~{Das Sarma},\n\\newblock Phys. Rev. B {\\bf 82}, 214509 (2010).\n\n\\bibitem{oregPRL2010_theory}\nY.~Oreg, G.~Refael, and F.~von Oppen,\n\\newblock Phys. Rev. Lett. {\\bf 105}, 177002 (2010).\n\n\\bibitem{Mourik25052012}\nV.~Mourik, K.~Zuo, S.~M. Frolov, S.~R. Plissard, E.~P. A.~M. Bakkers, and L.~P.\n  Kouwenhoven,\n\\newblock Science {\\bf 336}, 1003 (2012).\n\n\\bibitem{Das2012_1}\nA.~Das, Y.~Ronen, Y.~Most, Y.~Oreg, M.~Heiblum, and H.~Shtrikman,\n\\newblock Nat Phys {\\bf 8}, 887 (2012).\n\n\\bibitem{RokhinsonObs2012}\nL.~P. Rokhinson, X.~Liu, and J.~K. Furdyna,\n\\newblock Nat Phys {\\bf 8}, 795 (2012).\n\n\\bibitem{DengLundObs12}\nM.~T. Deng, C.~L. Yu, G.~Y. Huang, M.~Larsson, P.~Caroff, and H.~Q. Xu,\n\\newblock Nano Letters  (2012).\n\n\\bibitem{finkUrbanaObs13}\nA.~D.~K. Finck, D.~J. {Van Harlingen}, P.~K. Mohseni, K.~Jung, and X.~Li,\n\\newblock Phys. Rev. Lett. {\\bf 110}, 126406 (2013).\n\n\\bibitem{MarcusObs2013}\nH.~O.~H. Churchill, V.~Fatemi, K.~Grove-Rasmussen, M.~T. Deng, P.~Caroff, H.~Q.\n  Xu, and C.~M. Marcus,\n\\newblock Phys. Rev. B {\\bf 87}, 241401 (2013).\n\n\\bibitem{Alicea2011}\nJ.~Alicea, Y.~Oreg, G.~Refael, F.~von Oppen, and M.~P.~A. Fisher,\n\\newblock Nat Phys {\\bf 7}, 412 (2011).\n\n\\bibitem{bravyi_review}\nS.~Bravyi,\n\\newblock Phys. Rev. A {\\bf 73}, 042313 (2006).\n\n\\bibitem{bravyi_kitaev_clifford_gates}\nS.~Bravyi and A.~Kitaev,\n\\newblock Phys. Rev. A {\\bf 71}, 022316 (2005).\n\n\\bibitem{nayak_ising_anyons}\nP.~Bonderson, D.~J. Clarke, C.~Nayak, and K.~Shtengel,\n\\newblock Phys. Rev. Lett. {\\bf 104}, 180505 (2010).\n\n\\bibitem{fluxQubitReadout10}\nF.~Hassler, A.~R. Akhmerov, C.-Y. Hou, and C.~W.~J. Beenakker,\n\\newblock New Journal of Physics {\\bf 12}, 125002 (2010).\n\n\\bibitem{FlensPRL}\nK.~Flensberg,\n\\newblock Phys. Rev. Lett. {\\bf 106}, 090503 (2011).\n\n\\bibitem{flensberg_spin}\nM.~Leijnse and K.~Flensberg,\n\\newblock Phys. Rev. Lett. {\\bf 107}, 210502 (2011).\n\n\\bibitem{read_green_FQHE}\nN.~Read and D.~Green,\n\\newblock Phys. Rev. B {\\bf 61}, 10267 (2000).\n\n\\bibitem{Freedman_FQHE}\nM.~Freedman, C.~Nayak, and K.~Walker,\n\\newblock Phys. Rev. B {\\bf 73}, 245307 (2006).\n\n\\bibitem{qdDetection11}\nD.~E. Liu and H.~U. Baranger,\n\\newblock Phys. Rev. B {\\bf 84}, 201308 (2011).\n\n\\bibitem{flensberg_lifetime}\nM.~Leijnse and K.~Flensberg,\n\\newblock Phys. Rev. B {\\bf 84}, 140501 (2011).\n\n\\bibitem{topo_qbus}\nP.~Bonderson and R.~M. Lutchyn,\n\\newblock Phys. Rev. Lett. {\\bf 106}, 130505 (2011).\n\n\\bibitem{splitting_smoking_gun_12}\nS.~{Das Sarma}, J.~D. Sau, and T.~D. Stanescu,\n\\newblock Phys. Rev. B {\\bf 86}, 220506 (2012).\n\n\\bibitem{Nadj-Perge_Rashba_InSb_2012}\nS.~Nadj-Perge, V.~S. Pribiag, J.~W.~G. van~den Berg, K.~Zuo, S.~R. Plissard,\n  E.~P. A.~M. Bakkers, S.~M. Frolov, and L.~P. Kouwenhoven,\n\\newblock Phys. Rev. Lett. {\\bf 108}, 166801 (2012).\n\n\\bibitem{aliceaPRB2010_theory}\nJ.~Alicea,\n\\newblock Phys. Rev. B {\\bf 81}, 125318 (2010).\n\n\\bibitem{andrea_spin_qubit_2014}\nVeldhorstM., H.~C. C., Y.~H., L.~W., d.~RondeB., D.~P., M.~T., H.~E., I.~M.,\n  MorelloA., and D.~S.,\n\\newblock Nat Nano {\\bf 9}, 981 (2014),\n\\newblock Letter.\n\n\\bibitem{marcus_rfqpc}\nD.~J. Reilly, C.~M. Marcus, M.~P. Hanson, and A.~C. Gossard,\n\\newblock Applied Physics Letters {\\bf 91} (2007).\n\n\\bibitem{Beenakker_constant_interaction_QD_1991}\nC.~W.~J. Beenakker,\n\\newblock Phys. Rev. B {\\bf 44}, 1646 (1991).\n\n\\end{thebibliography}\n\n\\pagebreak\n\n\\ \n\n\\pagebreak\n\n\\section*{Supplemental Information}\n\n\n\\subsection{Matrix representations}\n\nRecall that the system state is represented by $|N,\\sigma,m\\rangle$ where, $N \\in \\{n,n+1,n+2\\}$, $\\sigma \\in \\{S,\\uparrow,\\downarrow\\}$, $m \\in \\{0,1\\}$. It must be kept in mind that some combinations of $(N, \\sigma, m)$ do not correspond to physically allowed states. It is therefore convenient to represent the state of the QD in terms of its fermionic modes as a Fock state: $|s_\\uparrow, s_\\downarrow\\rangle$, where $s_\\uparrow, s_\\downarrow \\in \\{0,1\\}$. Connecting the two representations, we observe that $|n,S\\rangle = |0,0\\rangle$,  $|n+1,\\uparrow\\rangle = |1,0\\rangle$,  $|n+1,\\downarrow\\rangle = |0,1\\rangle$, and  $|n+2,S\\rangle = |1,1\\rangle$. The total Fock state, including the mode corresponding to the MBS parity state, is given by including a third fermionic mode labelled by $m$. The matrix representation of operators on the combined MBS-dot system are then constructed via the standard formalism of second quantization. \n\nIn general, for \\emph{n} fermionic modes, the creation and annihilation operators of the \\emph{n}th mode, $a^\\dagger_n$ and $a_n$, obey the anti-commutation relation $\\{a_n, a^\\dagger_n\\} = \\mathbb{I}$. For a single mode, we choose:\n\n", "itemtype": "equation", "pos": 27673, "prevtext": "\nwhere $\\tilde{k}_F$ is the effective Fermi wave-vector of the MBS wavefuctions inside the nanowire, and $m^*$ is the effective electron mass. We show in the next section how a series of experiments can be used to map out $\\epsilon(L)$. Precise knowledge of this function is required for the MBS parity readout scheme described in section \\ref{sec:readout}.\n\n\\section{MBS energy splitting}\n\\label{sec:splitting}\nIn section \\ref{sec:subsec_fixed_L}, we describe how to measure the MBS splitting $\\epsilon$ at fixed $L$ using resonant tunnelling with the QD. In section \\ref{sec:subsec_varied_L}, $L$ is varied to show how the function $\\epsilon(L)$ is mapped out. Throughout the paper, we have used the following parameters relevant to experiments on InSb nanowires. The effective mass is $m^* = 0.014 m_e$ ($m_e$ is the electron mass). A Land\\'{e} $g$-factor of $50$ is used for both the topological wire and the quantum dot, and the quantum dot charging energy is $U = 5$ meV. An effective superconducting gap of $\\Delta = 0.5$ meV opens in the regions of the nanowire proximate to the superconductor. An external axial magnetic field $\\vec{B} = B \\hat{x}$ of magnitude $B = 0.75$ T induces topological order in the superconducting section of the nanowire, where a chemical potential $\\mu = 2$ meV is assumed. The thermal energy $kT$ is assumed to be much smaller than the superconducting gap, $kT \\ll \\Delta$, and also the topological gap $kT \\ll |\\delta - \\sqrt {\\mu^2 + \\Delta^2}|$. Under these conditions, the low energy states of the topological superconductor (i.e. the MBS) are well separated from all higher energy states, including the bulk superconducting states. The MBS are therefore isolated from the superconducting `lead'. As the quantum dot in our scheme is also isolated from any metallic leads, we can safely assume that temperature plays no role in the tunnelling, which occurs between two isolated two-level systems. \n\n\\subsection{Fixed MBS separation}\n\\label{sec:subsec_fixed_L}\nWe fix the MBS pair separation so that the energy splitting $\\epsilon$ at a value $\\epsilon^*$ smaller than the (proximity) superconducting gap $\\Delta$, hence the MBS do not couple to the continuum of quasi-particle states. The $|1\\rangle , |0\\rangle$ MBS parity states are then at energies $+\\epsilon^{*} / 2, -\\epsilon^{*}/2$ respectively. The gate voltage $V_g$ is tuned so that the number of electrons on the QD is $n$, as measured by the charge sensor. \n\nFirst, consider an initial MBS parity state $|1\\rangle$, so the initial state of the system is $|\\psi_i\\rangle = |n, S, 1\\rangle$. The process $|n, S, 1\\rangle \\leftrightarrow |n+1, \\sigma, 0\\rangle$ is resonant when $\\epsilon^*$ equals the energy cost $\\Delta E_{n,\\sigma}$ of the $|n,S\\rangle \\rightarrow |n+1, \\sigma \\rangle$ transition of the dot, with $\\sigma = \\uparrow$ or $\\downarrow$. From the constant interaction model, we have $\\Delta E_{n,\\sigma} = -eV_g + nU \\pm \\delta/2$, where the Zeeman energy $\\delta = g \\mu_B B$ enters with a plus (minus) sign for $\\sigma = \\uparrow (\\downarrow)$. Determining $\\epsilon^*$ is based on finding the resonant gate voltage $V^*$. The value for the resonant gate voltage depends on the initial MBS parity state; starting with the lower energy state $|0\\rangle$, the two available processes $|n, S, 0\\rangle \\leftrightarrow |n+1, \\sigma, 1\\rangle$ and $|n, S, 0\\rangle \\leftrightarrow |n-1, \\sigma, 1\\rangle$ are both \\emph{off-resonance} at the $V^*$ given above. The first of the two processes is resonant at $V_g =  V^{*} + 2 \\epsilon^*/e$ and the latter at $V_g = V^* + \\delta/e - U/e$. This allows the MBS-dot setup to distinguish between the two MBS parity states. First, we focus on finding $\\epsilon^*$.\n\nA procedure for determining $\\epsilon^*$ is depicted in figure \\ref{fig:optimize}, and is comprised of three steps: (i) The system starts in the state $|\\psi_i \\rangle$ with $V_g$ tuned to an initial value $V_0$, and $V_t$ at a large negative value so that tunnelling between the MBS and QD is suppressed. At $t=0$, the tunnel coupling is turned on to a value $\\lambda = h \\times 100\\; \\mathrm{MHz}$ by tuning $V_t$. Then, at $t = 2$ ns, $V_g$ is rapidly ramped up to a trial value $V^\\mathrm{trial}$, such that $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$ at all times $t$, i.e. the state evolution is fast and non-adiabatic. This point is further discussed below. (ii) $V_g$ is held constant for the duration $T^\\mathrm{trial}$, then (iii) rapidly ramped down to its initial value. The tunnel coupling is then turned off at $t = 7$ ns. Figure \\ref{fig:optimize}a shows $V_g$ versus time, with ($V^\\mathrm{trial}, T^\\mathrm{trial}$) = ($V^*, T^*$), the values which produce resonant MBS-dot charge transfer for the chosen system parameters. The corresponding probability for charge transfer is shown in figure \\ref{fig:optimize}b. Note there are two possible values for $V^*$ due to Zeeman splitting on the QD, labelled $V^{*}_\\sigma$ for $\\sigma = \\uparrow, \\downarrow$. Here, the spin-down state of the QD is used.\\\\\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.6cm]{fig2}\n\t\\caption{Procedure for determining $\\epsilon$ for a fixed $L$: gate voltage $V_g$, and calculated probability of having $n+1$ electrons on the quantum dot, $\\Pi_\\mathrm{n+1}$, versus time. Panels a, b show the case in which the MBS and dot are brought into perfect resonance for the optimal charge transfer time.  a) $V_g$ is raised from the initial value $V_0$ to the resonance value $V^* = 20\\, \\mu$V, and held there for the optimal duration $T^* = 2.5$ ns, before being returned to $V_0$. The sequence is broken into three steps (i-iii). b) The corresponding probability $\\Pi_{n+1}$ goes from zero to $> 99\\% $. Panels c, d show three cases involving miscallibration of $V^*$ and $T^*$. c) Voltage sequences with $V^\\mathrm{trial} = V^* +2\\, \\mu$V and $T = T^* - 1$ ns (curve `\\textbf{\\textit{a}}'), $T^{\\mathrm{trial}} = T^*$ and $V^\\mathrm{trial} = V^* -1\\, \\mu$V (curve `\\textbf{\\textit{b}}'), $V^\\mathrm{trial} = V^*$ and $T^{\\mathrm{trial}} = T^* +1$ ns (curve `\\textbf{\\textit{c}}'). d) Probabilities $\\Pi_{n+1}$ corresponding to the sequences in panel c. In all panels, the vertical dashed lines show the optimal duration $T^*$ for resonant charge transfer. The following parameters are used: $\\lambda/h = 100$ MHz,  $L = 1.12\\, \\mu$m, $\\mu = 2$ meV, $B=0.75$ T. These correspond to $\\epsilon^* = 20 ~\\mu$eV.\n\t  \\label{fig:optimize}}\n\\end{figure}\n\n\\emph{Diabatic sweep of $V_g$ and Rabi oscillations} -- Let us explore the resonant state transfer process (figure \\ref{fig:optimize}a) in more detail. Starting at $V_0$, $V_g$ is rapidly swept to $V^{*}_\\downarrow$ such that $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$. At this gate voltage, the states $|n,S,1\\rangle$ and $|n+1, \\downarrow, 0\\rangle$ anti-cross due to the tunnel coupling $\\lambda$. The eigenstates of the system are $|\\pm\\rangle = (\\sqrt{2})^{-1} (|n,S,1\\rangle \\pm |n+1,\\downarrow,0\\rangle)$. However, since $V_g$ was swept diabatically, the system stays in its initial state $|\\psi_i \\rangle = |n,S,1 \\rangle = (\\sqrt{2})^{-1}(|+\\rangle + |-\\rangle)$. A Rabi oscillation occurs in the $\\left\\lbrace |+\\rangle, |-\\rangle \\right\\rbrace$ subspace, and after time $T^*$ the state of the system is $(\\sqrt{2})^{-1}(|+\\rangle - |-\\rangle) =$ $|n+1,\\downarrow,0\\rangle$, up to an unimportant global phase. The system stays in this state after a rapid sweep of $V_g$ away from the anti-crossing point. Figure \\ref{fig:optimize}b shows the simulated outcome of this process, obtained by numerically solving the time-dependent Schr{\\\"o}dinger equation (TDSE) to find $|\\psi (t)\\rangle$, the system state at time $t$. The quantity of interest is the probability of finding the dot in the $n+1$ charge state (with either spin), $\\Pi_\\mathrm{n+1}  (t) = \\sum _{\\sigma = \\uparrow, \\downarrow} |\\langle n+1, \\sigma, 0 |\\psi (t)\\rangle|^2$. It can be seen that $\\Pi_\\mathrm{n+1}$ goes from zero to $> 99 \\%$.\n\nBy comparison, panels c,d of figure \\ref{fig:optimize} pertain to the case of off-resonance charge transfer. For the same value of the initial gate voltage $V_0$ as in panel a, panel c shows $V_g$ versus time when $V^\\mathrm{trial} = V^* +2\\; \\mu$V and $T = T^* - 1$ ns (curve `\\textbf{\\textit{a}}'), $T^{\\mathrm{trial}} = T^*$ and $V^\\mathrm{trial} = V^* -1\\; \\mu$V (curve `\\textbf{\\textit{b}}'), $V^\\mathrm{trial} = V^*$ and $T^{\\mathrm{trial}} = T^* +1$ ns (curve `\\textbf{\\textit{c}}'). The corresponding $\\Pi_{\\mathrm{n+1}}$ values are shown in figure \\ref{fig:optimize}d, and indicate significant decreases compared to figure \\ref{fig:optimize}b. The results indicate that the precision required for external control of voltage and time should be at the $100$ nV and $100$ ps levels, respectively, to ensure a transfer probability close to 1. Both requirements can in principle be satisfied with current technologies.\n\nA small ripple oscillation can be seen in figures \\ref{fig:optimize}b and \\ref{fig:optimize}d. This is due to a finite off-resonant dot-MBS coupling when the initial voltage $V_0$ is not very far from the resonant voltage $V^*$. In figures \\ref{fig:optimize}b and \\ref{fig:optimize}d, the $V^*-V_0$ is only $20\\; \\mu$V. In section \\ref{sec:readout}, we use a much larger value $\\sim 1.3\\; \\mathrm{mV}$ for this difference that effectively suppresses this ripple.\\\\\n\n\\emph{Measurement of $\\epsilon^*$} -- To determine $V^*$ and $T^*$, one would repeat the sequence (i-iii) many times for each set of trial input parameters, each time measuring the charge state of the dot using the SET after step (iii). The frequency of the $|n+1\\rangle$ outcomes yields an estimate of $\\Pi_{n+1}$. The parameter space $(V,T)$ is then surveyed to find the resonant tunnelling time $T^* = h/\\lambda$ and gate voltages $V^{*}_\\uparrow, V^{*}_\\downarrow$. Choosing the resonance with the spin-down state of the QD, the MBS splitting is given by\n\n", "index": 7, "text": "\\begin{equation*}\n\\epsilon^* = -eV^{*}_\\downarrow + nU - \\delta/2.\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\epsilon^{*}=-eV^{*}_{\\downarrow}+nU-\\delta/2.\" display=\"block\"><mrow><mrow><msup><mi>ϵ</mi><mo>*</mo></msup><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><mi>e</mi><mo>⁢</mo><msubsup><mi>V</mi><mo>↓</mo><mo>*</mo></msubsup></mrow></mrow><mo>+</mo><mrow><mi>n</mi><mo>⁢</mo><mi>U</mi></mrow></mrow><mo>-</mo><mrow><mi>δ</mi><mo>/</mo><mn>2</mn></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\nand represent the associated Fock states as\n\n\n", "itemtype": "equation", "pos": 49095, "prevtext": "\n\n\\emph{Mixture of parity states} -- The calibration procedure as described here assumes the ability to reliably prepare the MBS in a particular parity state. Suppose, instead, that one can only prepare the MBS in a statistical mixture $\\rho = p|0\\rangle\\langle0|+(1-p)|1\\rangle\\langle1|$. Then, due to the sharp dependence of transition probability on $V_g$, the procedure would still be effective at measuring $\\epsilon^*$. We noted that if $V^*$ corresponds to the resonant gate voltage for the higher (lower) energy parity state then the other state will be resonant at $V_g = V^* + 2\\epsilon/e$ ($V_g = V^* - 2\\epsilon/e$). Thus, one would observe two peaks in $\\Pi_{n+1} (t)$ of height $p$ and $1-p$, separated by $2\\epsilon^*$ along the $V_g$-axis (plus an additional pair separated from the first by $\\delta/e$ for transitions to the other dot spin state).\n\n\\subsection{Energy splitting versus MBS separation}\n\\label{sec:subsec_varied_L}\nThe procedure outlined in the previous section may be repeated for a variety of $L$ values using the keyboard gates, thereby allowing the experimenter to map out the oscillatory function $\\epsilon(L)$. In the Supplemental Material, we estimate the typical spatial period of the oscillations of $\\epsilon$ to be $\\sim 30 \\; \\mathrm{nm}$. Therefore, reliably varying $\\epsilon$ with a precision $\\sim 100\\; \\mathrm{neV}$ requires tuning $L$ (e.g. using keyboard gates) with a precision at the $\\sim$ 1 nm level. \n\nEmpirical measurement of the function $\\epsilon(L)$ is itself desirable, as it is a direct test of the validity of Eq. \\eqref{eq:epsilon_L} and would be strong evidence for the non-local nature of the MBS wavefunctions and the presence of topological order. The search over the $(V,T)$ parameter space at each $L$ point can be sped up by noting that $T^*$ depends only on the tunnel coupling strength $\\lambda$ (Supplementary Material), which can be assumed constant, reducing the optimization to a one dimensional search for $V^*$ once $T^*$ is known. \n \nAlong with the dependence of $\\epsilon$ on MBS separation, the dependence of $\\epsilon$ on other physical parameters such as the strength of the Zeeman field and the chemical potential may be mapped out. Although only the $L$-dependence is required for our proposed read out scheme, the model for the MBS system described in ref. \\cite{splitting_smoking_gun_12} may be empirically tested with respect to several independent variables. Below, we describe how knowledge of the function $\\epsilon(L)$ may be used for readout of the MBS parity state.\n\n\n\n\\section{Parity readout}\n\\label{sec:readout}\n\n\n\n\n\\emph{Initial state} -- The keyboard gates separate the two MBS by $L_i = 5\\, \\mu$m where the two parity states are degenerate, given the parameters we've chosen. From data collected by the calibration procedure in section \\ref{sec:subsec_varied_L}, a target readout length $L_f$ for the topological wire is chosen. At $L_f$, the MBS splitting $\\epsilon(L_f)$ is such that $\\epsilon(L_f) > \\epsilon(L)$ for all $L > L_f$, so $L_f$ corresponds to a local peak of the function $\\epsilon(L)$. For the numerical calculation of the TDSE, we choose $L_f = 0.775\\, \\mu$m, resulting in $\\epsilon(L_f) = 49\\, \\mu$eV. The optimal gate voltage $V^{*}_\\downarrow$ at $L_f$ for resonance with the spin-down dot state is assumed to be known, based on the calibration procedure above. Since $L_f$ corresponds to a peak in $\\epsilon (L)$, resonance with the dot does not occur for $L > L_f$. The dot is initially in the $|n,S\\rangle$ state, where we have arbitrarily chosen $n = 20$. The gate voltage $V_g$ is initially held at a value $V_0 = (1/e)U(n-1/2)$, halfway between the $(n+1)\\leftrightarrow n$ and $n\\leftrightarrow(n-1)$ charge degeneracy points of the QD, so $V^{*}_\\downarrow - V_0 =(1/e)( U/2 - \\delta/2 - \\epsilon) \\simeq 1.3$ mV. To restrict the dot to the $\\{ |n\\rangle$, $|n+1\\rangle \\}$ charge states, it is necessary that $V_g$ is kept within the range $(n-1)U + \\epsilon + \\delta/2 < eV_g \\leq eV^{*}_\\downarrow = nU -\\epsilon - \\delta/2$ at all times. \\\\\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.6cm]{fig3}\n\t\\caption{Readout procedure (stages i-iii) of the MBS parity state as described in the text. The MBS is initially in the $|1\\rangle$ parity state. a) The MBS separation $L$ (blue/dark grey) and the corresponding MBS splitting $\\epsilon (L)$ (black) as predicted from Eq. \\ref{eq:epsilon_L}. b) The gate voltage $V_g$ (blue/dark grey) and the calculated probability of adding a charge to the dot, $\\Pi_{n+1}$, versus time (black). As $V_g$ is tuned to the resonant voltage, the probability of finding $n+1$ electrons on the dot rises from zero to a value greater than 0.9999. Conversely, if MBS initial state is $|0\\rangle$, the maximum $\\Pi_{n+1}$ obtained is 0.004 (not shown). A charge readout of the dot then constitutes a readout of the MBS parity state. A tunnelling strength  $\\lambda/h = 100$ MHz is used in the numerical calculations.\n\t  \\label{fig:readout}}\n\\end{figure}\n\n\\emph {MBS Parity readout procedure} -- With the system in its initial configuration, there are three stages of the read out, labelled (i), (ii), and (iii) in Fig. \\ref{fig:readout}. In Fig. \\ref{fig:readout}a, the MBS separation $L$, and the energy splitting $\\epsilon (L)$ are shown as a function of time. Fig. \\ref{fig:readout}b shows the gate voltage $V_g$, and the simulated probability $\\Pi_\\mathrm{n+1}  (t) = \\sum _{\\sigma = \\uparrow, \\downarrow} |\\langle n+1, \\sigma, 0 |\\psi (t)\\rangle|^2$, with the MBS initially in the $|1\\rangle$ parity state. Considering each stage in turn:\n\nStage (i):\nThe keyboard gates move the left MBS towards the tunnel coupled end so that the MBS separation is reduced from $L_i = 5\\, \\mathrm{\\mu m}$ to $L_f = 0.775\\, \\mathrm{\\mu m}$. This is performed uniformly over a duration of 10 ns in our calculation. The adiabaticity condition  $|\\Delta - \\epsilon|^2 \\gg \\hbar |d \\epsilon / d t|$ is satisfied at all times, so the probability of coupling to the continuum of quasi-particle states above and below $\\Delta$ is negligible. Note that this step could be carried out more slowly if necessary. The parity eigenstates are \\emph{preserved} under this transformation, as their levels cross but do not couple. At the end of this stage, $V_g$ controlling the dot potential is rapidly switched from $V_0$ to $V^{*}_\\downarrow$. As discussed in section \\ref{sec:subsec_fixed_L}, this transition is \\emph{diabatic}, with $\\lambda^2 \\ll \\hbar e |d (V_g)/dt|$. In our calculation the voltage ramping time is 1 ns.\n\nStage (ii):\nThe control parameters are held fixed for the optimal tunneling time $T^*$, which is $2.5$ ns in the case simulated here. With the MBS initially in the $|1\\rangle$ state, the $|n,S,1\\rangle \\leftrightarrow$ $|n+1,\\downarrow,0\\rangle$ transition is on resonance, and an electron will tunnel from the topological wire to the dot with transition probability very close to one (Fig. \\ref{fig:readout}b). \n\nIf, however, the MBS was initially in the $|0\\rangle$ state, changing the parity state will \\emph{cost} (rather than supply) an energy $\\epsilon(L_f)$. The corresponding process, $|n, S, 0\\rangle \\leftrightarrow |n+1, \\downarrow, 1\\rangle$, is off resonance -- its resonant gate voltage is $V_g =  V^{*}_\\downarrow + 2 \\epsilon/e$. For the $|0\\rangle$ parity state then, the procedure illustrated in Fig. \\ref{fig:readout} would result in an electron transfer probability very close to zero.\n\nStage (iii):\nThe reverse of stage (i), the gate voltage is rapidly ramped back to $V_0$ and the keyboard gates are used to move the left MBS back to its initial position. With the initial system configuration restored, a charge measurement of the dot is performed via the charge sensor. A measurement of $n+1$ indicates with high probability that the initial MBS state was $|1\\rangle$ while a measurement of $n$ indicates with high probability that the initial MBS state was $|0\\rangle$. Hence, the final charge measurement amounts to a projective measurement on the MBS in the parity basis. \n\nNote that resonance with either spin state on the dot may be selected with the appropriate choice of the resonant gate voltage: $V^{*}_\\downarrow$ for spin-down, or $V^{*}_\\uparrow = V^{*}_\\downarrow + \\delta/e$ for spin-up.  Here, the the spin-down state was chosen so that only a single pair of states, $|n,S,1\\rangle$ and $|n+1,\\downarrow,0\\rangle$, are resonant at any point during the three stages. If instead the spin-up state is selected so that $|n,S,1\\rangle$ and $|n+1,\\uparrow,0\\rangle$ are resonant during stage (ii), there will be brief periods of resonance between $|n,S,1\\rangle$ and $|n+1,\\downarrow,0\\rangle$ during stages (i) and (iii), which generally lowers the fidelity of readout. \n\n\\emph{Fidelity of readout} -- Using the parameters given previously and with $\\epsilon(L_f) = 49\\; \\mu$eV, the numerically obtained probability of finding $n+1$ electrons on the dot after stage (iii) is greater than $0.9996$ with the MBS initially in $|1\\rangle$. The probability of finding $n$ electrons is greater than $0.9999$ with the MBS initially in $|0\\rangle$. The readout scheme therefore allows the two MBS states to be distinguished with a visibility up to 0.9996, defined simply as the smaller of the two probabilities above. The term `readout fidelity' is used interchangeably with this visibility in this paper. The residual error here is dominated by the finite voltage ramping time: a faster ramp would increase the visibility. However, so far we haven't considered practical limitations on control precision (this is discussed below), so the preceding fidelity results are idealized.  \\\\\n\n\\emph {Bias in parity readout due to miscalibration} -- Throughout the readout operation (stages i-iii), it was assumed that the calibration of $\\epsilon(L)$ performed in section \\ref{sec:subsec_varied_L} is valid. Drift or noise in the applied voltage or pulse timing will cause miscalibration errors and bias the charge measurement outcome in favour of $n$ over $n+1$ (see figure \\ref{fig:optimize}), i.e. a bias towards detecting $|0\\rangle$ over $|1 \\rangle$ for the MBS parity. However, a straightforward modification of our scheme allows for distinguishing a calibration error from a genuine $|0\\rangle$ outcome. This is done by appending a second readout operation involving transport to the $n-1$ charge state of the QD.\n\nStarting with $V_g$ at $V_0 = (1/e)U(n-1/2)$, i.e. halfway between the $(n+1)\\leftrightarrow n$ and $n\\leftrightarrow (n-1)$ charge degeneracy points of the QD, two parity-to-charge conversions are attempted: First, $|n, S, 1 \\rangle \\rightarrow |n+1, \\downarrow, 0\\rangle$, by using the resonance at gate voltage $V^{*}_\\downarrow = V_0 + (1/e) ( U/2 -\\delta/2 -\\epsilon )$ as described previously. Subsequently, the $|n, S, 0 \\rangle \\rightarrow |n-1, \\downarrow, 1\\rangle$ transition is made resonant at $V_g = V_0 + (1/e) ( -U/2 +\\delta/2 +\\epsilon ) $. A charge readout of the QD distinguishes the following outcomes: $n+1$ electrons indicates with high probability that the initial MBS state was $|1\\rangle$, while $n-1$ indicates $|0\\rangle$. The outcome $n$ indicates no resonance for either process (i.e. a calibration error), thus providing an \\emph{in situ} test for the validity of the parity readout procedure.\\\\\n\n\\emph {Sensitivity to precision of control} -- For the parameters chosen in our simulations, the MBS separation $L$ must be controlled within approximately 1 nm in order to maintain an accuracy $> 99\\%$ in distinguishing the parity outcomes. A similar success rate can be achieved with a range of parameters, so these numbers may be considered typical. Indeed, the tolerance can be improved by about a factor of three by choosing parameters at the edge of the topological phase region that correspond to about three times longer period for the MBS energy oscillations -- however such a case is far less typical. Alternatively, the effect of tunnel broadening may be exploited to reduce the sharpness of the resonance condition and increase robustness. For concreteness, we solved the TDSE again with tunnel coupling strength of 1 GHz, which allowed a tolerance of $\\pm 4$ nm in the keyboard gate precision while still maintaining a readout fidelity of $\\sim 97\\%$, at the cost of reducing $T^*$ by a factor of 10. By comparison, the 100 MHz tunnel coupling with a $4$ nm error yields a significantly lower visibility of $\\sim 3 \\%$. There is thus a tradeoff between the required precision of spatial control of the MBS separation versus the timing precision of gate voltage control. \\\\\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nWe demonstrated the theoretical basis for a protocol to read out the parity of an MBS pair in a topological superconductor. The MBS pair is brought from a well-separated (topologically protected) state to a spatially overlapping (unprotected) state in which there is a finite energy splitting; one MBS is then resonantly coupled with an isolated quantum dot. The MBS parity state is projectively measured by a charge measurement acting on the quantum dot, and we showed that this can be accomplished in principle with high readout fidelity. This can easily be extended to the readout of a logical qubit based on two MBS pairs. This protocol could be advantageous compared to anyon fusion across a Josephson junction, as it is straightforward to measure the charge on a quantum dot after performing parity-to-charge conversion.\n\nAs an intermediate step, we discussed a calibration procedure one would use to map out the MBS splitting versus separation, $\\epsilon(L)$. The result of such an experiment is predicted in ref. \\cite{splitting_smoking_gun_12} and confirmation of this would be strong evidence for the presence of topological order and MBS. Hence, apart from its potential use in quantum information processing, the proposed experiment would be a valuable probe for topological physics in a condensed matter system. As with any projective measurement, the protocol can also be used to prepare the MBS into a desired parity eigenstate. The key for both readout and state preparation is that parity eigenstates are preserved under adiabatic motion of the MBS separation. \\\\\n\n\n\\begin{acknowledgements}\n\nWe thank K. Flensberg for helpful discussions. D. H. thanks M. Mosca for guidance and discussions. This work was supported by the Natural Sciences and Engineering Research Council of Canada and the Ontario Ministry for Research and Innovation.\n\n\\end{acknowledgements}\n\n\\begin{thebibliography}{10}\n\n\\bibitem{kitaev}\nA.~Y. Kitaev,\n\\newblock Physics-Uspekhi {\\bf 44}, 131 (2001).\n\n\\bibitem{beenakker_search_for_mf}\nC.~Beenakker,\n\\newblock Annual Review of Condensed Matter Physics {\\bf 4}, 113 (2013).\n\n\\bibitem{alicea_new_directions}\nJ.~Alicea,\n\\newblock Reports on Progress in Physics {\\bf 75}, 076501 (2012).\n\n\\bibitem{leijnse_felnsberg_review}\nM.~Leijnse and K.~Flensberg,\n\\newblock Semiconductor Science and Technology {\\bf 27}, 124003 (2012).\n\n\\bibitem{tewari_review}\nT.~D. Stanescu and S.~Tewari,\n\\newblock Journal of Physics: Condensed Matter {\\bf 25}, 233201 (2013).\n\n\\bibitem{DasSarma_Nayak_review_2015}\nS.~{Das Sarma}, M.~Freedman, and C.~Nayak,\n\\newblock Npj Quantum Information {\\bf 1}, 15001 EP (2015),\n\\newblock Review Article.\n\n\\bibitem{MF_from_ferromagnets_2014}\nJ.~Li, H.~Chen, I.~K. Drozdov, A.~Yazdani, B.~A. Bernevig, and A.~H. MacDonald,\n\\newblock Phys. Rev. B {\\bf 90}, 235433 (2014).\n\n\\bibitem{MF_from_ferromagnets_2015}\nH.-Y. Hui, P.~M.~R. Brydon, J.~D. Sau, S.~Tewari, and S.~D. Sarma,\n\\newblock Scientific Reports {\\bf 5}, 8880 EP (2015),\n\\newblock Article.\n\n\\bibitem{MBS_evolution_of_dos_2015}\nT.~Kawakami and X.~Hu,\n\\newblock Phys. Rev. Lett. {\\bf 115}, 177001 (2015).\n\n\\bibitem{flensberg_alicea_arxiv_review_2015}\nD.~{Aasen}, M.~{Hell}, R.~V. {Mishmash}, A.~{Higginbotham}, J.~{Danon},\n  M.~{Leijnse}, T.~S. {Jespersen}, J.~A. {Folk}, C.~M. {Marcus},\n  K.~{Flensberg}, and J.~{Alicea},\n\\newblock ArXiv e-prints  (2015), 1511.05153.\n\n\\bibitem{nayak_review}\nC.~Nayak, S.~H. Simon, A.~Stern, M.~Freedman, and S.~{Das Sarma},\n\\newblock Rev. Mod. Phys. {\\bf 80}, 1083 (2008).\n\n\\bibitem{Wu_new_braiding}\nL.-H. Wu, Q.-F. Liang, and X.~Hu,\n\\newblock Science and Technology of Advanced Materials {\\bf 15}, 064402 (2014).\n\n\\bibitem{Ivanov_non_abelian}\nD.~A. Ivanov,\n\\newblock Phys. Rev. Lett. {\\bf 86}, 268 (2001).\n\n\\bibitem{lutchynPRL2010_theory}\nR.~M. Lutchyn, J.~D. Sau, and S.~{Das Sarma},\n\\newblock Phys. Rev. Lett. {\\bf 105}, 077001 (2010).\n\n\\bibitem{sauPRL2010_theory}\nJ.~D. Sau, R.~M. Lutchyn, S.~Tewari, and S.~{Das Sarma},\n\\newblock Phys. Rev. Lett. {\\bf 104}, 040502 (2010).\n\n\\bibitem{sauZBA10}\nJ.~D. Sau, S.~Tewari, R.~M. Lutchyn, T.~D. Stanescu, and S.~{Das Sarma},\n\\newblock Phys. Rev. B {\\bf 82}, 214509 (2010).\n\n\\bibitem{oregPRL2010_theory}\nY.~Oreg, G.~Refael, and F.~von Oppen,\n\\newblock Phys. Rev. Lett. {\\bf 105}, 177002 (2010).\n\n\\bibitem{Mourik25052012}\nV.~Mourik, K.~Zuo, S.~M. Frolov, S.~R. Plissard, E.~P. A.~M. Bakkers, and L.~P.\n  Kouwenhoven,\n\\newblock Science {\\bf 336}, 1003 (2012).\n\n\\bibitem{Das2012_1}\nA.~Das, Y.~Ronen, Y.~Most, Y.~Oreg, M.~Heiblum, and H.~Shtrikman,\n\\newblock Nat Phys {\\bf 8}, 887 (2012).\n\n\\bibitem{RokhinsonObs2012}\nL.~P. Rokhinson, X.~Liu, and J.~K. Furdyna,\n\\newblock Nat Phys {\\bf 8}, 795 (2012).\n\n\\bibitem{DengLundObs12}\nM.~T. Deng, C.~L. Yu, G.~Y. Huang, M.~Larsson, P.~Caroff, and H.~Q. Xu,\n\\newblock Nano Letters  (2012).\n\n\\bibitem{finkUrbanaObs13}\nA.~D.~K. Finck, D.~J. {Van Harlingen}, P.~K. Mohseni, K.~Jung, and X.~Li,\n\\newblock Phys. Rev. Lett. {\\bf 110}, 126406 (2013).\n\n\\bibitem{MarcusObs2013}\nH.~O.~H. Churchill, V.~Fatemi, K.~Grove-Rasmussen, M.~T. Deng, P.~Caroff, H.~Q.\n  Xu, and C.~M. Marcus,\n\\newblock Phys. Rev. B {\\bf 87}, 241401 (2013).\n\n\\bibitem{Alicea2011}\nJ.~Alicea, Y.~Oreg, G.~Refael, F.~von Oppen, and M.~P.~A. Fisher,\n\\newblock Nat Phys {\\bf 7}, 412 (2011).\n\n\\bibitem{bravyi_review}\nS.~Bravyi,\n\\newblock Phys. Rev. A {\\bf 73}, 042313 (2006).\n\n\\bibitem{bravyi_kitaev_clifford_gates}\nS.~Bravyi and A.~Kitaev,\n\\newblock Phys. Rev. A {\\bf 71}, 022316 (2005).\n\n\\bibitem{nayak_ising_anyons}\nP.~Bonderson, D.~J. Clarke, C.~Nayak, and K.~Shtengel,\n\\newblock Phys. Rev. Lett. {\\bf 104}, 180505 (2010).\n\n\\bibitem{fluxQubitReadout10}\nF.~Hassler, A.~R. Akhmerov, C.-Y. Hou, and C.~W.~J. Beenakker,\n\\newblock New Journal of Physics {\\bf 12}, 125002 (2010).\n\n\\bibitem{FlensPRL}\nK.~Flensberg,\n\\newblock Phys. Rev. Lett. {\\bf 106}, 090503 (2011).\n\n\\bibitem{flensberg_spin}\nM.~Leijnse and K.~Flensberg,\n\\newblock Phys. Rev. Lett. {\\bf 107}, 210502 (2011).\n\n\\bibitem{read_green_FQHE}\nN.~Read and D.~Green,\n\\newblock Phys. Rev. B {\\bf 61}, 10267 (2000).\n\n\\bibitem{Freedman_FQHE}\nM.~Freedman, C.~Nayak, and K.~Walker,\n\\newblock Phys. Rev. B {\\bf 73}, 245307 (2006).\n\n\\bibitem{qdDetection11}\nD.~E. Liu and H.~U. Baranger,\n\\newblock Phys. Rev. B {\\bf 84}, 201308 (2011).\n\n\\bibitem{flensberg_lifetime}\nM.~Leijnse and K.~Flensberg,\n\\newblock Phys. Rev. B {\\bf 84}, 140501 (2011).\n\n\\bibitem{topo_qbus}\nP.~Bonderson and R.~M. Lutchyn,\n\\newblock Phys. Rev. Lett. {\\bf 106}, 130505 (2011).\n\n\\bibitem{splitting_smoking_gun_12}\nS.~{Das Sarma}, J.~D. Sau, and T.~D. Stanescu,\n\\newblock Phys. Rev. B {\\bf 86}, 220506 (2012).\n\n\\bibitem{Nadj-Perge_Rashba_InSb_2012}\nS.~Nadj-Perge, V.~S. Pribiag, J.~W.~G. van~den Berg, K.~Zuo, S.~R. Plissard,\n  E.~P. A.~M. Bakkers, S.~M. Frolov, and L.~P. Kouwenhoven,\n\\newblock Phys. Rev. Lett. {\\bf 108}, 166801 (2012).\n\n\\bibitem{aliceaPRB2010_theory}\nJ.~Alicea,\n\\newblock Phys. Rev. B {\\bf 81}, 125318 (2010).\n\n\\bibitem{andrea_spin_qubit_2014}\nVeldhorstM., H.~C. C., Y.~H., L.~W., d.~RondeB., D.~P., M.~T., H.~E., I.~M.,\n  MorelloA., and D.~S.,\n\\newblock Nat Nano {\\bf 9}, 981 (2014),\n\\newblock Letter.\n\n\\bibitem{marcus_rfqpc}\nD.~J. Reilly, C.~M. Marcus, M.~P. Hanson, and A.~C. Gossard,\n\\newblock Applied Physics Letters {\\bf 91} (2007).\n\n\\bibitem{Beenakker_constant_interaction_QD_1991}\nC.~W.~J. Beenakker,\n\\newblock Phys. Rev. B {\\bf 44}, 1646 (1991).\n\n\\end{thebibliography}\n\n\\pagebreak\n\n\\ \n\n\\pagebreak\n\n\\section*{Supplemental Information}\n\n\n\\subsection{Matrix representations}\n\nRecall that the system state is represented by $|N,\\sigma,m\\rangle$ where, $N \\in \\{n,n+1,n+2\\}$, $\\sigma \\in \\{S,\\uparrow,\\downarrow\\}$, $m \\in \\{0,1\\}$. It must be kept in mind that some combinations of $(N, \\sigma, m)$ do not correspond to physically allowed states. It is therefore convenient to represent the state of the QD in terms of its fermionic modes as a Fock state: $|s_\\uparrow, s_\\downarrow\\rangle$, where $s_\\uparrow, s_\\downarrow \\in \\{0,1\\}$. Connecting the two representations, we observe that $|n,S\\rangle = |0,0\\rangle$,  $|n+1,\\uparrow\\rangle = |1,0\\rangle$,  $|n+1,\\downarrow\\rangle = |0,1\\rangle$, and  $|n+2,S\\rangle = |1,1\\rangle$. The total Fock state, including the mode corresponding to the MBS parity state, is given by including a third fermionic mode labelled by $m$. The matrix representation of operators on the combined MBS-dot system are then constructed via the standard formalism of second quantization. \n\nIn general, for \\emph{n} fermionic modes, the creation and annihilation operators of the \\emph{n}th mode, $a^\\dagger_n$ and $a_n$, obey the anti-commutation relation $\\{a_n, a^\\dagger_n\\} = \\mathbb{I}$. For a single mode, we choose:\n\n", "index": 9, "text": "\\begin{equation}\na =\n\\begin{pmatrix}\n0 & 0 \\\\\n1 & 0\n\\end{pmatrix},\n\\quad\na^\\dagger =\n\\begin{pmatrix}\n0 & 1 \\\\\n0 & 0\n\\end{pmatrix},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"a=\\begin{pmatrix}0&amp;0\\\\&#10;1&amp;0\\end{pmatrix},\\quad a^{\\dagger}=\\begin{pmatrix}0&amp;1\\\\&#10;0&amp;0\\end{pmatrix},\" display=\"block\"><mrow><mrow><mrow><mi>a</mi><mo>=</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>1</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msup><mi>a</mi><mo>†</mo></msup><mo>=</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\nThe creation and annihilation operators for different modes anti-commute: $\\{a_n, a^\\dagger_m\\} = \\{a_n, a_m\\} = \\{a^\\dagger_n, a^\\dagger_m\\}  = 0$, for $ n \\neq m$. For our model consisting of three fermionic modes, the single mode operators are extended in the usual way to the full eight-dimensional Hilbert space in keeping with these relations:\n\n", "itemtype": "equation", "pos": 49286, "prevtext": "\nand represent the associated Fock states as\n\n\n", "index": 11, "text": "\\begin{equation}\n|0\\rangle =\n\\begin{pmatrix}\n0 \\\\\n1\n\\end{pmatrix},\n\\quad\n|1\\rangle =\n\\begin{pmatrix}\n1 \\\\\n0\n\\end{pmatrix}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"|0\\rangle=\\begin{pmatrix}0\\\\&#10;1\\end{pmatrix},\\quad|1\\rangle=\\begin{pmatrix}1\\\\&#10;0\\end{pmatrix}.\" display=\"block\"><mrow><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>1</mn><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\nwhere $\\sigma_z$ is the Pauli z-matrix, and similarly for the creation operators. The Fock states on the full Hilbert space are likewise constructed as tensor products of $|0\\rangle$ and $|1\\rangle$.\n\n\nWe shift $\\mathcal{H}_q$ by $-E_n \\mathbb{I}$ so that its ground state has zero energy. Thus, letting $E'_n = 0$, $E'_{n+1} = -eV_g + UN$, and $E'_{n+2} = -2eV_g + U(2N+1)$, we have the following expressions for the terms in the Hamiltonian:\n\n\n\n", "itemtype": "equation", "pos": 49775, "prevtext": "\n\nThe creation and annihilation operators for different modes anti-commute: $\\{a_n, a^\\dagger_m\\} = \\{a_n, a_m\\} = \\{a^\\dagger_n, a^\\dagger_m\\}  = 0$, for $ n \\neq m$. For our model consisting of three fermionic modes, the single mode operators are extended in the usual way to the full eight-dimensional Hilbert space in keeping with these relations:\n\n", "index": 13, "text": "\\begin{align}\nd_\\uparrow &= a \\otimes \\sigma_z \\otimes \\sigma_z , \\\\\nd_\\downarrow &= \\mathbb{I} \\otimes a \\otimes \\sigma_z , \\\\\nf &= \\mathbb{I} \\otimes \\mathbb{I} \\otimes a ,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle d_{\\uparrow}\" display=\"inline\"><msub><mi>d</mi><mo>↑</mo></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=a\\otimes\\sigma_{z}\\otimes\\sigma_{z},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>a</mi><mo>⊗</mo><msub><mi>σ</mi><mi>z</mi></msub><mo>⊗</mo><msub><mi>σ</mi><mi>z</mi></msub></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle d_{\\downarrow}\" display=\"inline\"><msub><mi>d</mi><mo>↓</mo></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\mathbb{I}\\otimes a\\otimes\\sigma_{z},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>𝕀</mi><mo>⊗</mo><mi>a</mi><mo>⊗</mo><msub><mi>σ</mi><mi>z</mi></msub></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle f\" display=\"inline\"><mi>f</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\mathbb{I}\\otimes\\mathbb{I}\\otimes a,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>𝕀</mi><mo>⊗</mo><mi>𝕀</mi><mo>⊗</mo><mi>a</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\n\n\n", "itemtype": "equation", "pos": 50408, "prevtext": "\nwhere $\\sigma_z$ is the Pauli z-matrix, and similarly for the creation operators. The Fock states on the full Hilbert space are likewise constructed as tensor products of $|0\\rangle$ and $|1\\rangle$.\n\n\nWe shift $\\mathcal{H}_q$ by $-E_n \\mathbb{I}$ so that its ground state has zero energy. Thus, letting $E'_n = 0$, $E'_{n+1} = -eV_g + UN$, and $E'_{n+2} = -2eV_g + U(2N+1)$, we have the following expressions for the terms in the Hamiltonian:\n\n\n\n", "index": 15, "text": "\\begin{align}\n\\mathcal{H}_q =\n\\text{diag} ( &\nE'_{n+2},\nE'_{n+2},\nE'_{n+1},\nE'_{n+1}, \\nonumber \\\\\n\\, &\nE'_{n+1},\nE'_{n+1},\nE'_{n},\nE'_{n}\n),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{q}=\\text{diag}(\" display=\"inline\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>q</mi></msub><mo>=</mo><mtext>diag</mtext><mo stretchy=\"false\">(</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle E^{\\prime}_{n+2},E^{\\prime}_{n+2},E^{\\prime}_{n+1},E^{\\prime}_{n%&#10;+1},\" display=\"inline\"><mrow><mrow><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>2</mn></mrow><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>2</mn></mrow><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo>′</mo></msubsup></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle E^{\\prime}_{n+1},E^{\\prime}_{n+1},E^{\\prime}_{n},E^{\\prime}_{n}),\" display=\"inline\"><mrow><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mi>n</mi><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>E</mi><mi>n</mi><mo>′</mo></msubsup><mo stretchy=\"false\">)</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 50564, "prevtext": "\n\n\n\n", "index": 17, "text": "\\begin{align}\n\\mathcal{H}_s = \\text{diag}( & \n0,0,\\delta/2,\\delta/2, \\nonumber \\\\\n\\, & -\\delta/2,-\\delta/2,0,0),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{s}=\\text{diag}(\" display=\"inline\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>s</mi></msub><mo>=</mo><mtext>diag</mtext><mo stretchy=\"false\">(</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle 0,0,\\delta/2,\\delta/2,\" display=\"inline\"><mrow><mrow><mn>0</mn><mo>,</mo><mn>0</mn><mo>,</mo><mrow><mi>δ</mi><mo>/</mo><mn>2</mn></mrow><mo>,</mo><mrow><mi>δ</mi><mo>/</mo><mn>2</mn></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle-\\delta/2,-\\delta/2,0,0),\" display=\"inline\"><mrow><mo>-</mo><mi>δ</mi><mo>/</mo><mn>2</mn><mo>,</mo><mo>-</mo><mi>δ</mi><mo>/</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 50690, "prevtext": "\n\n\n", "index": 19, "text": "\\begin{align}\n\\mathcal{H}_m = \\text{diag}( &\n\\epsilon/2,-\\epsilon/2,\\epsilon/2,-\\epsilon/2, \\nonumber \\\\\n\\, & \\epsilon/2,-\\epsilon/2,\\epsilon/2,-\\epsilon/2),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{H}_{m}=\\text{diag}(\" display=\"inline\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>m</mi></msub><mo>=</mo><mtext>diag</mtext><mo stretchy=\"false\">(</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\epsilon/2,-\\epsilon/2,\\epsilon/2,-\\epsilon/2,\" display=\"inline\"><mrow><mrow><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn></mrow><mo>,</mo><mrow><mo>-</mo><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn></mrow></mrow><mo>,</mo><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn></mrow><mo>,</mo><mrow><mo>-</mo><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\epsilon/2,-\\epsilon/2,\\epsilon/2,-\\epsilon/2),\" display=\"inline\"><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn><mo>,</mo><mo>-</mo><mi>ϵ</mi><mo>/</mo><mn>2</mn><mo>,</mo><mi>ϵ</mi><mo>/</mo><mn>2</mn><mo>,</mo><mo>-</mo><mi>ϵ</mi><mo>/</mo><mn>2</mn><mo stretchy=\"false\">)</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\nUsing these matrix representations of the states and operators, the time dependent Schr{\\\"o}dinger equation was solved numerically using the QuTiP module \\cite{qutip} for Python 2.7.\n\n\\subsection{Splitting of MBS parity states}\n\nFor our numerical analysis, a theoretical expression for the MBS splitting $\\epsilon$ as a function of the nanowire length $L$ is taken from ref. \\cite{splitting_smoking_gun_12_supp}:\n\n\n", "itemtype": "equation", "pos": 50861, "prevtext": "\n\n\n", "index": 21, "text": "\\begin{equation}\n\\mathcal{H}_t = \\lambda\n\\begin{pmatrix}\n0 & 0 & 0 & -i & 0 & -1 & 0 & 0\\\\0 & 0 & i & 0 & 1 & 0 & 0 & 0\\\\0 & -i & 0 & 0 & 0 & 0 & 0 & 1\\\\i & 0 & 0 & 0 & 0 & 0 & -1 & 0\\\\0 & 1 & 0 & 0 & 0 & 0 & 0 & -i\\\\-1 & 0 & 0 & 0 & 0 & 0 & i & 0\\\\\n0 & 0 & 0 & -1 & 0 & -i & 0 & 0\\\\0 & 0 & 1 & 0 & i & 0 & 0 & 0\n\\end{pmatrix}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{H}_{t}=\\lambda\\begin{pmatrix}0&amp;0&amp;0&amp;-i&amp;0&amp;-1&amp;0&amp;0\\\\&#10;0&amp;0&amp;i&amp;0&amp;1&amp;0&amp;0&amp;0\\\\&#10;0&amp;-i&amp;0&amp;0&amp;0&amp;0&amp;0&amp;1\\\\&#10;i&amp;0&amp;0&amp;0&amp;0&amp;0&amp;-1&amp;0\\\\&#10;0&amp;1&amp;0&amp;0&amp;0&amp;0&amp;0&amp;-i\\\\&#10;-1&amp;0&amp;0&amp;0&amp;0&amp;0&amp;i&amp;0\\\\&#10;0&amp;0&amp;0&amp;-1&amp;0&amp;-i&amp;0&amp;0\\\\&#10;0&amp;0&amp;1&amp;0&amp;i&amp;0&amp;0&amp;0\\end{pmatrix}.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>t</mi></msub><mo>=</mo><mrow><mi>λ</mi><mo>⁢</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mi>i</mi></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mn>1</mn></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mi>i</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mi>i</mi></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mi>i</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mn>1</mn></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mi>i</mi></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mo>-</mo><mn>1</mn></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mi>i</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mn>1</mn></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mi>i</mi></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mi>i</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\nFor InSb, we have $g \\approx 50$, (Land\\'{e} g-factor), $m^* = 0.014m_e$ (effective electron mass)  and a spin-orbit length $L_{SO} = 200$ nm. Additionally, the Zeeman field for inducing the topological regime is $B = 0.75$ T with a superconducting gap of $\\Delta = 0.5$ meV and a chemical potential of $\\mu = 2$ meV. With these parameters, we have an effective coherence length $\\xi = 1.71~\\mu$m and an effective Fermi wavevector $\\tilde{k}_{F}=4.05 \\times 10^{7}~\\text{m}^{-1}$. The energy splitting according to Eq. \\ref{eq:epsilon_L_supp} is shown in Figure \\ref{fig:splitting}.\n\nWe observe that the spatial period of the oscillations is roughly 30 nm and that for a final nanowire length of $L_f = 0.775 ~\\mu$m, the splitting reaches a local maximum of about $50 ~\\mu$eV. \n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.5cm]{fig4}\n\t\\caption{ Energy splitting of the MBS parity states as a function of the topological wire length $L$ for the parameters given in section B. The parity readout simulated in section IV of the main text used the value indicated by a circle, with $L_f=0.775 \\mu$m, corresponding to a splitting $\\epsilon = 49 \\mu$eV. \n\t  \\label{fig:splitting}}\n\\end{figure}\n\n\n\\subsection{Period of resonant tunnelling oscillations}\n\n\nAs part of the calibration procedure described above, we state that the optimal resonant tunnelling time $T^*$ depends only on the tunnel coupling strength $\\lambda$. To prove this, we observe that in the range of $V_g$ considered, the MBS-dot system is effectively restricted to the 2D subspace of the full Hilbert space spanned by $\\{|n,S,1\\rangle, |n+1, \\downarrow, 0\\rangle\\}$. This effective Hamiltonian restricted to this subspace (and, as above, shifted so $\\mathcal{H}_q |n\\rangle = 0$) is:\n\n\n", "itemtype": "equation", "pos": 51619, "prevtext": "\n\nUsing these matrix representations of the states and operators, the time dependent Schr{\\\"o}dinger equation was solved numerically using the QuTiP module \\cite{qutip} for Python 2.7.\n\n\\subsection{Splitting of MBS parity states}\n\nFor our numerical analysis, a theoretical expression for the MBS splitting $\\epsilon$ as a function of the nanowire length $L$ is taken from ref. \\cite{splitting_smoking_gun_12_supp}:\n\n\n", "index": 23, "text": "\\begin{equation}\\label{eq:epsilon_L_supp}\n\\epsilon (L) \\approx \\hbar^2 \\tilde{k}_{F} \\frac{e^{-2L/\\xi}}{m^* \\xi} \\cos\\left({\\tilde{k}_{F} L}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\epsilon(L)\\approx\\hbar^{2}\\tilde{k}_{F}\\frac{e^{-2L/\\xi}}{m^{*}\\xi}\\cos\\left(%&#10;{\\tilde{k}_{F}L}\\right).\" display=\"block\"><mrow><mrow><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><msup><mi mathvariant=\"normal\">ℏ</mi><mn>2</mn></msup><mo>⁢</mo><msub><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">~</mo></mover><mi>F</mi></msub><mo>⁢</mo><mfrac><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>L</mi></mrow><mo>/</mo><mi>ξ</mi></mrow></mrow></msup><mrow><msup><mi>m</mi><mo>*</mo></msup><mo>⁢</mo><mi>ξ</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><msub><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">~</mo></mover><mi>F</mi></msub><mo>⁢</mo><mi>L</mi></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\nThe eigenvalues of this matrix are:\n\n\n\n", "itemtype": "equation", "pos": 53544, "prevtext": "\n\nFor InSb, we have $g \\approx 50$, (Land\\'{e} g-factor), $m^* = 0.014m_e$ (effective electron mass)  and a spin-orbit length $L_{SO} = 200$ nm. Additionally, the Zeeman field for inducing the topological regime is $B = 0.75$ T with a superconducting gap of $\\Delta = 0.5$ meV and a chemical potential of $\\mu = 2$ meV. With these parameters, we have an effective coherence length $\\xi = 1.71~\\mu$m and an effective Fermi wavevector $\\tilde{k}_{F}=4.05 \\times 10^{7}~\\text{m}^{-1}$. The energy splitting according to Eq. \\ref{eq:epsilon_L_supp} is shown in Figure \\ref{fig:splitting}.\n\nWe observe that the spatial period of the oscillations is roughly 30 nm and that for a final nanowire length of $L_f = 0.775 ~\\mu$m, the splitting reaches a local maximum of about $50 ~\\mu$eV. \n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=8.5cm]{fig4}\n\t\\caption{ Energy splitting of the MBS parity states as a function of the topological wire length $L$ for the parameters given in section B. The parity readout simulated in section IV of the main text used the value indicated by a circle, with $L_f=0.775 \\mu$m, corresponding to a splitting $\\epsilon = 49 \\mu$eV. \n\t  \\label{fig:splitting}}\n\\end{figure}\n\n\n\\subsection{Period of resonant tunnelling oscillations}\n\n\nAs part of the calibration procedure described above, we state that the optimal resonant tunnelling time $T^*$ depends only on the tunnel coupling strength $\\lambda$. To prove this, we observe that in the range of $V_g$ considered, the MBS-dot system is effectively restricted to the 2D subspace of the full Hilbert space spanned by $\\{|n,S,1\\rangle, |n+1, \\downarrow, 0\\rangle\\}$. This effective Hamiltonian restricted to this subspace (and, as above, shifted so $\\mathcal{H}_q |n\\rangle = 0$) is:\n\n\n", "index": 25, "text": "\\begin{equation} \\mathcal{H}_{eff} = \n\\begin{pmatrix}\n\\epsilon/2 & -i\\lambda \\\\ i\\lambda & -eV_g + UN - \\frac{\\delta}{2} - \\frac{\\epsilon}{2}\n\\end{pmatrix}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{H}_{eff}=\\begin{pmatrix}\\epsilon/2&amp;-i\\lambda\\\\&#10;i\\lambda&amp;-eV_{g}+UN-\\frac{\\delta}{2}-\\frac{\\epsilon}{2}\\end{pmatrix}.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mi>ϵ</mi><mo>/</mo><mn>2</mn></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>λ</mi></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi>i</mi><mo>⁢</mo><mi>λ</mi></mrow></mtd><mtd columnalign=\"center\"><mrow><mrow><mrow><mo>-</mo><mrow><mi>e</mi><mo>⁢</mo><msub><mi>V</mi><mi>g</mi></msub></mrow></mrow><mo>+</mo><mrow><mi>U</mi><mo>⁢</mo><mi>N</mi></mrow></mrow><mo>-</mo><mstyle displaystyle=\"false\"><mfrac><mi>δ</mi><mn>2</mn></mfrac></mstyle><mo>-</mo><mstyle displaystyle=\"false\"><mfrac><mi>ϵ</mi><mn>2</mn></mfrac></mstyle></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\n\n\nThe angular frequency for relative phase rotations of the stationary states is therefore \n\n", "itemtype": "equation", "pos": 53755, "prevtext": "\n\nThe eigenvalues of this matrix are:\n\n\n\n", "index": 27, "text": "\\begin{align}\n E_{\\pm} = \\frac{1}{2} & \\left( -eV_g + UN - \\frac{\\delta}{2} \\right. \\nonumber \\\\\n \\, & \\; \\pm \\left. \\sqrt{\\left(-eV_g + UN - \\frac{\\delta}{2} - \\epsilon\\right)^2 + 4\\lambda^2} )\\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle E_{\\pm}=\\frac{1}{2}\" display=\"inline\"><mrow><msub><mi>E</mi><mo>±</mo></msub><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\left(-eV_{g}+UN-\\frac{\\delta}{2}\\right.\" display=\"inline\"><mrow><mo>(</mo><mo>-</mo><mi>e</mi><msub><mi>V</mi><mi>g</mi></msub><mo>+</mo><mi>U</mi><mi>N</mi><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mi>δ</mi><mn>2</mn></mfrac></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\;\\pm\\left.\\sqrt{\\left(-eV_{g}+UN-\\frac{\\delta}{2}-\\epsilon\\right%&#10;)^{2}+4\\lambda^{2}})\\right).\" display=\"inline\"><mrow><mrow><mi mathvariant=\"normal\"> </mi><mo>±</mo><msqrt><mrow><msup><mrow><mo>(</mo><mrow><mrow><mrow><mo>-</mo><mrow><mi>e</mi><mo>⁢</mo><msub><mi>V</mi><mi>g</mi></msub></mrow></mrow><mo>+</mo><mrow><mi>U</mi><mo>⁢</mo><mi>N</mi></mrow></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mi>δ</mi><mn>2</mn></mfrac></mstyle><mo>-</mo><mi>ϵ</mi></mrow><mo>)</mo></mrow><mn>2</mn></msup><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>λ</mi><mn>2</mn></msup></mrow></mrow></msqrt><mo stretchy=\"false\">)</mo></mrow><mo>)</mo><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07506.tex", "nexttext": "\n\nwhich, on resonance between the dot and MBS, reduces to $\\omega = 2\\lambda/\\hbar$. With respect to this subspace, switching $V_g$ between its initial and final values is a diabatic process: as $V_g$ is swept from $V_0$ to $V^*$, the system remains in $|n,S,1\\rangle$. On resonance, $\\omega$ is the frequency of Rabi oscillations between $|n,S,1\\rangle$ and $|n+1, \\downarrow, 0\\rangle$. The optimal transition time, $T^* = \\frac{1}{4\\pi \\omega}$, depends only on $\\lambda$.\n\n\\begin{thebibliography}{1}\n\n\\bibitem{qutip}\nJ.~Johansson, P.~Nation, and F.~Nori,\n\\newblock Computer Physics Communications {\\bf 184}, 1234 (2013).\n\n\\bibitem{splitting_smoking_gun_12_supp}\nS.~{Das Sarma}, J.~D. Sau, and T.~D. Stanescu,\n\\newblock Phys. Rev. B {\\bf 86}, 220506 (2012).\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 54063, "prevtext": "\n\n\n\nThe angular frequency for relative phase rotations of the stationary states is therefore \n\n", "index": 29, "text": "\\begin{equation}\n\\omega = \\frac{E_+ - E_-}{\\hbar} = \\frac{\\sqrt{\\left(-eV_g + UN - \\frac{\\delta}{2} - \\epsilon\\right)^2 + 4\\lambda^2}}{\\hbar},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\omega=\\frac{E_{+}-E_{-}}{\\hbar}=\\frac{\\sqrt{\\left(-eV_{g}+UN-\\frac{\\delta}{2}%&#10;-\\epsilon\\right)^{2}+4\\lambda^{2}}}{\\hbar},\" display=\"block\"><mrow><mrow><mi>ω</mi><mo>=</mo><mfrac><mrow><msub><mi>E</mi><mo>+</mo></msub><mo>-</mo><msub><mi>E</mi><mo>-</mo></msub></mrow><mi mathvariant=\"normal\">ℏ</mi></mfrac><mo>=</mo><mfrac><msqrt><mrow><msup><mrow><mo>(</mo><mrow><mrow><mrow><mo>-</mo><mrow><mi>e</mi><mo>⁢</mo><msub><mi>V</mi><mi>g</mi></msub></mrow></mrow><mo>+</mo><mrow><mi>U</mi><mo>⁢</mo><mi>N</mi></mrow></mrow><mo>-</mo><mfrac><mi>δ</mi><mn>2</mn></mfrac><mo>-</mo><mi>ϵ</mi></mrow><mo>)</mo></mrow><mn>2</mn></msup><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>λ</mi><mn>2</mn></msup></mrow></mrow></msqrt><mi mathvariant=\"normal\">ℏ</mi></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]