[{"file": "1601.02770.tex", "nexttext": "\n where $\\alpha=1+ 6.98 (1-H_{0_F})/a$, $\\beta=0.4/a$ (with $a$  the tube diameter in microns) and $\\mathrm{logit}(x)=\\ln[x/(1-x)]$. $H_0$ is the volumetric hematocrit in the parent feeding branch, while $H_1$ is the hematocrit in a child branch. $H_{0_F}$ is the feeding hematocrit in a reservoir that would be located right before the narrow feeding vessel. Due to the F\\aa hr\\ae us effect, $H_{0_F}$ is larger than $H_0$ and a relationship between both quantities is also given in \\cite{pries90}: \n \n", "itemtype": "equation", "pos": 15557, "prevtext": "\n\n\n\\title{\n    Inversion of hematocrit partition at microfluidic bifurcations\n}\n\\author{\n    Zaiyi Shen,$^1$ Gwennou Coupier,$^1$ Badr Kaoui,$^{2,3}$ Beno\\^{i}t Polack,$^{4,5}$ \\\\Jens Harting,$^{6,7}$ Chaouqi Misbah,$^1$ Thomas Podgorski$^1$$^\\ast$\n}\n\\date{\\today}\n\n\n\n\\maketitle\n\\begin{description}\n    \\item[affiliations:]\n$^1$ Laboratoire Interdisciplinaire de Physique (LIPhy) UMR5588 CNRS-Universit\\'e Grenoble Alpes, Grenoble F-38041, France ; \n$^2$ CNRS-Sorbonne University, Universit\\'e de Technologie de Compi\\`egne, UMR7338 Biomechanics and Bioengineering, 60203 Compi\\`egne, France;\n$^3$ TP1, University of Bayreuth, D-95447 Bayreuth, Germany; \n$^4$ Laboratoire d'H\\'ematologie, CHU, Grenoble, France; \n$^5$TIMC-IMAG/TheREx, CNRS UMR5525, Universit\\'e Grenoble Alpes, Grenoble, France; \n$^6$ Department of Applied Physics, Eindhoven University of Technology, P.O. Box 513, 5600MB Eindhoven, The Netherlands; \n$^7$ Faculty of Science and Technology, Mesa+ Institute, University of Twente, 7500 AE Enschede, The Netherlands\n    \\item[abbreviated title:]\n        Inversion of hematocrit partition\n    \\item[corresponding author:]\n        Thomas Podgorski,\n        e-mail: thomas.podgorski@ujf-grenoble.fr\n\\end{description}\n\n\n\n\n\\begin{abstract}\nPartitioning of red blood cells (RBCs) at the level of bifurcations in the microcirculatory system affects many physiological functions yet  it remains poorly understood. We address this problem by using T-shaped microfluidic bifurcations as a model. Our computer simulations and \\textit{in vitro} experiments reveal that the hematocrit ($\\phi_0$) partition depends strongly on RBC deformability, as long as $\\phi_0 <20$\\% (within the normal range in microcirculation), and can even lead to complete deprivation of RBCs in a child branch. Furthermore, we discover a deviation from the Zweifach-Fung effect which states that the child branch with lower flow rate recruits less RBCs than the higher flow rate child branch. At small enough $\\phi_0$, we get the inverse scenario, and the hematocrit in the lower flow rate child branch is even higher than in the parent vessel. We explain this result  by an intricate up-stream RBC organization and we highlight the extreme dependence of RBC transport on geometrical and cell mechanical properties. These parameters can lead to unexpected behaviors with consequences on the microcirculatory function and oxygen delivery in healthy and pathological conditions.\n \n\\end{abstract}\n\n\\textbf{keywords:} microcirculation; blood; red blood cell; microfluidics; lattice Boltzmann method\n\n\n\n\\section{Introduction}\n\\label{sec:introduction}\n\nBlood flows through a complex network of the circulatory system -- from large arteries to very tiny capillaries -- in order to ensure oxygen delivery and to remove metabolic waste. This task is mainly carried out by red blood cells (RBCs) that are remarkably deformable, in healthy conditions, and therefore able to squeeze into tiny capillaries. A change in rheological and flow properties of the blood is often associated with hematological diseases or disorders \\citep{fedosov11} (e.g. sickle-cell anemia, malaria, polycythemia \nvera). Understanding blood flow and its dependence on the mechanical properties of its constituents may improve and lead to new applications in biomedical technology, for example in blood substitutes development and transfusion techniques.\n\nA major open problem in blood circulation is to understand the perfusion in the vasculature networks, especially in the microvasculature where RBCs accomplish their vital functions. For example, an improper hematocrit distribution is observed in heart microcirculation with consequences such as occlusion zones (within many patients with apparently healthy coronary arteries). These abnormal traffic zones cause a lack of oxygen supply to tissues that leads to cardiac ischemic disease \\citep{cokkinos06}.\nThe precise origin of this dysfunction is still a matter of debate. The principal mechanism that dictates blood heterogeneity in the microvascular networks is the hematocrit partition at the level of bifurcations. RBCs do not behave as passive tracers. Their shape flexibility and dynamics have a decisive role because their size is comparable to that of blood capillaries. A well known phenomenon in microcirculation is the Zweifach-Fung effect \\citep{dellimore83,fenton85,guibert10,pries89}: If we consider a bifurcation (as in Figure \\ref{figillus}), the child branch with the lower flow rate is depleted in RBCs as compared to the parent vessel, while the other, higher flow rate child branch is enriched. That is, if in the parent vessel the total volumetric flow rate is $Q_0$ and the RBC volumetric flux is $N_0$, and in the child branch with the lower flow rate this flow rate is $Q_1$ and the RBC flux $N_1$, then $N_1/N_0<Q_1/Q_0$. When the flow rate is sufficiently small, the hematocrit in the child branch  can even drop down to zero, while it reaches high values in the other branch. Obviously, this phenomenon has physiological consequences as it alters the transport of oxygen and other essential metabolites, and may even trigger pathological disorders (e.g. occlusions in high hematocrit regions where the viscosity is higher and cell adhesion is favored).\n\nPrevious studies have investigated the impact of the confinement \\citep{barber08,chien85,doyeux11,fenton85}, the bifurcation geometry \\citep{audet87,hyakutake15,roberts03,roberts06,woolfenden11}, the hematocrit \\citep{ditchfield96,fenton85,roberts03,yin13}, and the RBCs deformability \\citep{barber08,li12,xiong12,yin13} and aggregation  \\citep{sherwood14,yin13}. Most of these parameters influence RBCs distribution in the feeding flow, which is believed to dictates the partition at the bifurcation \\citep{doyeux11,fenton85,li12,yin13}. The Zweifach-Fung effect results from the existence of a cell free layer (CFL) close to the walls, which is only occupied by plasma. The feeding flow is divided by a separating streamline into two parts, one feeding the low flow rate branch and the other feeding the high flow rate branch. Due to the CFL, the RBC fraction entering the low flow rate branch is smaller compared to the original RBC fraction in the total feeding flow. \nThe depletion in the low flow rate branch is accompanied by enrichment in the high flow rate branch. In addition to the CFL as the main cause of the Zweifach-Fung effect, it has been argued that there is a relatively small counteracting effect where cells entering the bifurcation tend to be displaced towards the low flow rate branch compared to fluid streamlines (a fact that slightly reduces the Zweifach-Fung effect) \\citep{barber08,doyeux11,li12,ollila13}, but this question is still  debated \\citep{hyakutake15,xiong12}.\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=6.75in]{fig1}\n\n \\caption{Snapshots of the RBCs partition, in both experiments and simulations, when the hematocrit of the feeding flow is around $\\phi _0 =$10\\%. The length ratio between the two child branches is set to 3. A, B: Low viscosity contrast (experiments with $\\lambda$=0.85 and simulation with $\\lambda$=1). C, D: High viscosity contrast  (experiments with $\\lambda$=10.3 and simulation with $\\lambda$=10).\\label{figillus}}\n\n\\end{center}\n\\end{figure}\n\n\n\n\n\nThe existence of a CFL is a consequence of the lateral migration of RBCs towards the vessel center. This migration is a result of the wall-induced lift force due to hydrodynamic interactions \\citep{callens08,cantat99,grandchamp13}, that depends on the nature of RBC dynamics (like tank-treading or tumbling \\citep{abkarian07,dupire12}). \nThe final distribution of RBCs in a confined straight vessel is not only due to the lift force, but it is also influenced by other factors: (i) The curved velocity profile of the Poiseuille flow \\citep{coupier08,farutin14,katanov15,shi12}, and (ii) The cell-cell hydrodynamic interactions \\citep{grandchamp13,hariprasad14,katanov15,kruger14,mcwhirter09}.\n\nIn the present work, we study the hematocrit partition at bifurcations using two-dimensional lattice Boltzmann simulations, whose outcomes are validated and supported by microfluidic experiments. We show that RBCs deformability  strongly impacts partition as long as the hematocrit is below $20\\%$ (within the normal range in microcirculation). RBC deformability is governed by several parameters such as membrane stiffness (shear, dilatation and bending elastic moduli), swelling degree, membrane viscosity and the viscosity contrast between the hemoglobin and the suspending fluid. Here we choose to tune the deformability through the latter parameter, the viscosity contrast, that controls the RBC  dynamics (tank-treading, tumbling or swinging)  then all the migration mechanisms at the origin of the CFL. On the other hand, and more importantly, this study reveals that hematocrit partition can be completely reversed, that is the low flow rate child branch can be enriched in RBCs compared to the parent vessel. This newly reported effect is an outcome of a subtle RBCs structuration in the microcirculatory system. This highlights the importance of the notion of RBCs spatio-temporal organization as the main non-negligible ingredient  to further understand blood perfusion in the microvasculature.\n\n\n\\section{Materials and methods}\n\\label{sec:methods}\n\n\\subsection*{Design of the microfluidic bifurcations} \nIn both simulations and experiments, we use T-shaped bifurcations such as shown in Fig.\\ref{figillus}: A parent channel divides into two child branches with the same width, but with different lengths $L_1$ and $L_2$ ($L_1>L_2$). The ratio of the flow rates in branches 1 and 2 is then given by $Q_1/Q_2=(\\eta_2 L_2)/(\\eta_1 L_1)$, where $\\eta_1$ and $\\eta_2$ are the apparent viscosities of the suspension in branches 1 and 2, respectively. For dilute suspensions, where the viscosity is close to that of the suspending fluid, we simply have $Q_1/Q_2=L_2/L_1$. In simulations, we set the width of the channels to $W=20 \\mu$m and we vary $L_1/L_2$ from 1.43 to 3. In experiments, we have $L_1/L_2=3$, $W=20\\mu$m and the height of the channel $h$ is 8 $\\mu$m. The length of the parent vessel was chosen as long as possible to allow for the development of a stationary distribution of RBCs across the channel in the feeding flow (5 mm in experiments and 1.5 mm in simulations). Microfluidic channels were produced by standard soft lithography techniques, with molded PDMS bonded to glass. The RBC suspensions were perfused by a syringe pump (KDS Legato 180) and imaging was performed by a video camera (Imaging Source DMK 31AF03) mounted on an inverted microscope with motorized stage (Olympus IX71) and a blue filter ($434 \\pm 25$ nm) corresponding to an absorption peak of hemoglobin.\n\n\\subsection*{Blood preparation}\nBlood samples were provided by the Etablissement Fran\\c{c}ais du Sang (EFS Rh\\^{o}ne-Alpes) from healthy donors. \nRBCs were isolated by centrifugation after being washed twice in phosphate buffer saline (PBS) supplemented by 0.1 \\% bovine serum albumin (BSA). \nTo prevent sedimentation of RBCs in channels, the RBCs were re-suspended in density matching PBS and BSA solutions in a mixture of water and iodixanol (Optiprep from Axis-Shield). \nThis iso-dense solution was used either alone (1.94 mPa.s at 20 $^{\\circ}$C) or after adding 5\\% dextran of molecular weight $2\\times10^6$ (viscosity 23.4 mPa.s at 20 $^{\\circ}$C). \nThe viscosity of the internal hemoglobin solution of healthy RBCs is around 20 mPa.s at 20 $^{\\circ}$C \\citep{kelemen01}. \nThis provides two values of the viscosity contrast $\\lambda$, namely  10.3 and 0.85. The first value corresponds to the blood at 20 $^{\\circ}$C, while the physiological value at body temperature is around 5-6 \\citep{cokelet68}. \n\nNote that we chose to vary the viscosity contrast $\\lambda$ as one way to tune deformability, and therefore the\ndynamics of lift and hydrodynamic interactions of cells. Stiffening cells using diamide or glutaraldehyde was another possibility. However, from the experimental viewpoint, working with hardened cells  at high\nvolume fractions in such a confined environment is quite difficult due to jamming. It would have been nearly impossible to\ninject a suspension of very stiff cells at hematocrits larger than\n10\\%. Also, the dynamics of glutaraldehyde hardened cells is pure tumbling,\nwhich corresponds to very high values of the viscosity ratio $\\lambda$.\nWe do not expect the dynamics (and therefore phase separation) to\nchange much at values of $\\lambda$ greater than 10 and we found more\ninteresting to increase deformability by decreasing $\\lambda$ rather\nthan trying to investigate less deformable cells (with the\nexperimental difficulties mentioned above).\n\n\\subsection*{Hematocrit measurements} \nLocal hematocrit measurements were made by comparing suspension flow images to a reference image without RBC, under identical illumination, and using the Beer-Lambert law of absorption. \nThe absorption coefficient was determined by a calibration with images at low hematocrit, where a direct measurement can be made by counting individual cells. Hematocrit in branch $i$ will be denoted $H_i$.\nIn experiments, $h$ is small enough ($8 \\mu$m) so that the flow is quasi two-dimensional. To allow a qualitative comparison with 2D numerical simulations, an area hematocrit $\\phi_i$ was also derived by multiplying the number of cells per unit area by the average cross-sectional area of RBCs ($S=$19.8 $\\mu$m$^{2}$). $H_i$ and $\\phi_i$ are therefore linked by the relationship $H_i=\\phi_i v/(S h)$, where $v=90$ $\\mu$m$^{3}$ is the average volume of one cell.\n\n \\subsection*{Simulation method} \nIn simulations, we use lattice Boltzmann method (LBM) to compute the fluid flow \\citep{kaoui11,zhang07}. \nEach RBC is modeled by 60 nodes interconnected by a potential that allows bending, as well as a stretching modulus that penalizes distance variations between two adjacent nodes. \nThis achieves the RBC membrane incompressibility \\citep{tsubota06}. \nIn other words, we set the spring constant to values as large as possible in order to keep the ratio between the membrane perimeter and area constant. \nWe define the reduced area as $4{\\pi}A/p^2$ (with p is the perimeter and A the enclosed area), which we set to 0.7 to produce a RBCs with a biconcave shape. \nWe use the immersed boundary method (IBM) to couple the fluid flow and RBC deformation \\citep{kaoui11,peskin02,zhang07}. \nFor comparison with experiments, we set the viscosity contrast to $\\lambda=1$ and $\\lambda=10$.\n\n\\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=3.25in]{fig2}\n\n \\caption{The relative hematocrit in the low flow rate branch as a function of the hematocrit in the parent vessel. The length ratio between the branches  $L_1/L_2$ is set to 3. A: Simulations with $\\lambda$=1 and $\\lambda$=10. B: Comparison between experiments ($\\lambda$=0.85 and $\\lambda$=10.3) and the empirical law of Pries \\textit{et al.} \\citep{pries90}  (solid line), for the same cross-sectional area. The non-monotonous evolution of the relative hematocrit at low $H_0$ and high $\\lambda$ is related to the inversion of the Zweifach-Fung effect, on which we comment later on (see Fig.  \\ref{fig-antiZFexp}).\\label{figphi1phi0}}\n\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\\section{Results}\n\\label{sec:results}\n\n\n\nAs a guideline, we shall refer to the empirical law of Pries \\textit{et al.} taken from refs \\citep{pries89,pries90} that gives the hematocrit partition at a bifurcation: \n \n", "index": 1, "text": "\\begin{equation}\n\\mathrm{logit}\\big(\\frac{H_1Q_1}{H_0 Q_0 }\\big)=\\alpha \\mathrm{logit}\\big(\\frac{Q_1/Q_0-\\beta}{1-2 \\beta}\\big),\\label{eqpart}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{logit}\\big{(}\\frac{H_{1}Q_{1}}{H_{0}Q_{0}}\\big{)}=\\alpha\\mathrm{logit}%&#10;\\big{(}\\frac{Q_{1}/Q_{0}-\\beta}{1-2\\beta}\\big{)},\" display=\"block\"><mrow><mrow><mrow><mi>logit</mi><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mfrac><mrow><msub><mi>H</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>Q</mi><mn>1</mn></msub></mrow><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>Q</mi><mn>0</mn></msub></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><mi>logit</mi><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mfrac><mrow><mrow><msub><mi>Q</mi><mn>1</mn></msub><mo>/</mo><msub><mi>Q</mi><mn>0</mn></msub></mrow><mo>-</mo><mi>β</mi></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>β</mi></mrow></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02770.tex", "nexttext": "\nNote that the partition law (Eq. \\ref{eqpart}) has been validated through \\textit{in-vivo} experiments with rats (thus at body temperature), with narrow capillaries (of diameters $a$ lower than 30 microns), but with feeding hematocrits higher than 20\\%. \n\nAs we shall compare predictions for 3D hematocrits in a cylindrical tube with either 2D simulations or experiments in a rectangular channel, we should avoid any direct quantitative comparisons, but rather use Pries \\textit{et al.} predictions as a guideline to identify where new behavior is exhibited. For comparison with simulations, we set $a=W$, where $W$ is the channel width, and we shall  consider only the  hematocrit ratios. For the experiments in rectangular channels, we set $a$ to adjust the cross-sectional areas: $\\pi a^2/4=Wh$. \n\n\n\n\n\\subsection*{The role of interactions}\n\nWe analyze in details how RBC deformability affects the hematocrit partition at the bifurcations. \nFigure \\ref{figillus} illustrates the Zweifach-Fung effect, observed in both experiments and simulations, at a feeding area hematocrit of 10\\%. \nIn both cases, less RBCs enter the low flow rate branch (the long branch) simply due to the flow rates differences between the two child branches. \nHowever, the asymmetry is significantly pronounced at low viscosity contrast $\\lambda$ (when the suspending fluid is more viscous than the hemoglobin). \nTo quantify the partition asymmetry, we measure the relative hematocrit $\\phi_1/\\phi_0$ (or, equivalently,  $H_1/H_0$), in the low flow rate branch, while we vary the hematocrit in the parent branch (Fig. \\ref{figphi1phi0}A).  Either in the simulations (Fig. \\ref{figphi1phi0}A) or in the experiments (Fig. \\ref{figphi1phi0}B), we see less RBCs in the low flow rate branch than in the parent one ($\\phi_1/\\phi_0<1$), when the inlet hematocrits ($\\phi_0$ or $H_0$) lies between $5\\%$ and $45\\%$,  which is precisely a manifestation of the  Zweifach-Fung effect.\nWhen the viscosity contrast is low, we observe a significantly strong reduction of hematocrit in the low flow rate branch, both in experiments and simulations, at moderate inlet hematocrit. This interesting observation suggests that the RBCs mechanical properties can strongly impact the hematocrit partition \\textit{in-vivo} since the normal hematocrit is usually less than $20\\%$ (typically between 10 and 20 $\\%$ \\citep{Fung13}) in microcirculation.\n\nHowever, when the hematocrit is high enough,  the viscosity contrast plays a minor role. This is clear in simulations (for $\\phi_0$ larger than 25\\%, Fig.  \\ref{figphi1phi0}1). Similarly, in the experiments, above $H_0=20\\%$, data for both $\\lambda$ converge to the Pries \\textit{et al.} prediction. The insensitivity to the viscosity contrast beyond a critical hematocrit ($\\phi_0\\simeq 25\\%$) is a robust phenomenon that is independent of the length ratio between the branches (i.e. roughly the bulk flow rate ratio), as illustrated on Figure \\ref{figdepL1L2}).\n\n\n\n\n\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=6.25in]{fig3}\n\n\\caption{Simulations: the relative hematocrit in low flow rate branch $\\phi_1/\\phi_0$ as a function of the hematocrit in the parent vessel $\\phi_0$, for several branches length ratios $L_1/L_2$ and viscosity contrasts $\\lambda$.  At low enough $\\phi_0$, the asymmetry between the two daughter branches is strongly enhanced as the viscosity contrast $\\lambda$ is decreased, while the partitioning becomes independent on $\\lambda$ for hematocrits above 20$\\%$. \\label{figdepL1L2}}\n\n\\end{center}\n\\end{figure}\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=6.25in]{fig4}\n\n \\caption{A: CFL thickness as a function of the hematocrit in the parent vessel, for $\\lambda$=1 and $\\lambda$=10, in simulations. Insets : Snapshots showing the suspension at the bifurcation. We define the CFL as a layer where the integrated concentration profile  is below $5\\%$ \\citep{kumar14}. B: Snapshots from experiments, for $\\lambda$=0.85 and 10.3, and hematocrits $\\phi_0=$10, 20 and 30\\%. Every snapshot is a superimposition of 10 successive images in order to highlight the CFL in the parent vessel. C: The stationary volume fraction density functions in the parent vessel obtained from simulations.\\label{figprofiles}}\n\n\\end{center}\n\\end{figure}\n\n\n\nIt is appealing to suggest that the dependency of the hematocrit partition upon the feeding hematocrit is the result of the up-stream organization of RBCs in the parent vessel due to hydrodynamic interactions. \nAt low hematocrit flows, the cell-cell interaction is weak and the organization of RBCs, within the vessel, depends mainly on the dynamics of each RBCs, thus on $\\lambda$.\nThe RBCs aggregate at the center of the vessel due to the wall-induced lift force, that increases with decreasing $\\lambda$ and increasing RBCs deformability \\citep{grandchamp13}. \nThis means that suspensions of RBCs with high viscosity contrasts have wider distributions (smaller CFL) in the channel as compared to suspensions having lower viscosity contrast.\nAs a consequence, the asymmetry in the partition is expected to increase when the viscosity contrast decreases, as shown in Figure \\ref{figdepL1L2}. \nTo support this argument, the CFL thickness in the parent vessel and the configuration of RBCs before the bifurcation are reported in Figure \\ref{figprofiles}A,B.\nWe can clearly see that RBCs distribution at high viscosity contrast ($\\lambda$=10 in simulations and $\\lambda$=10.3 in experiments) is wider than that at low viscosity contrast ($\\lambda$=1 in simulations and $\\lambda$=0.85 in experiments) when the feeding hematocrit is low ($\\phi_0<$20\\%, see also Figure \\ref{figprofiles}C-I, II). \n\n\nHowever, when the hematocrit increases, the contribution of the hydrodynamic interactions among RBCs becomes stronger and stronger. This causes a broadening of the distribution that acts against the lift force. \nConsequently, the partition between the two branches becomes more symmetric (that is $\\phi_1/\\phi_0$ becomes close to 1). Interestingly, those broad distributions are quasi independent of the viscosity contrast (see  Figure \\ref{figprofiles}A and C-III, IV). Consequently, $\\phi_1/\\phi_0$ does not depend on $\\lambda$ either (see Figure \\ref{figdepL1L2}). \n\nThus the distribution is independent of the strength of the interactions between cells and between cells and walls, but it is mainly caused by geometrical constraints. \nIn other words, interaction between cells and the lift forces both depend on $\\lambda$, and this result indicates that they depend more or less on $\\lambda$ in the same way. The $\\lambda$ contributions cancel out once a critical feeding hematocrit is reached. \nNoteworthy, beyond this critical hematocrit the separating ratio $\\phi_1/\\phi_0$  quasi plateaus which enforces the idea that in this regime, the feeding flow can be considered as a three-layer fluid (fluid-cell-fluid).\nThe width of each layer will depend neither on the strength of interaction (which is related to deformability) nor on the volume fraction.\n\n\n\n\n\n \\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=3.25in]{fig5}\n\n \\caption{The profiles of the hematocrit distribution and the corresponding snapshots of RBCs distribution in the parent vessel. The feeding hematocrits are 5\\% and 40\\%, for two different values of $\\lambda$. \\label{fig5-40}}\n\n\\end{center}\n\\end{figure}\n\n\n\n\n\\subsection*{The low hematocrit limit: Inversion of the Zweifach-Fung effect}\n\nNow we focus on the low hematocrit case, for which the partition depends strongly on the detail of the interactions and on the volume fraction. Moreover a peculiar effect arises due to the prevalence of the discrete nature of blood at that scale. \nFor all hematocrits, the distribution of RBCs is not homogeneous, but rather exhibits two lateral peaks (Figure \\ref{figprofiles}). \nThis become more pronounced at low hematocrit ($\\phi_0\\lesssim 5 \\%$), where a two-file distribution of RBCs is observed, as shown in Figure \\ref{fig5-40}. \nFor $\\lambda$=10, there is almost no cell flowing in the central part of the vessel, even though the wall-lift force tends to center them. \nThe structure adopted by the suspension can be viewed as a juxtaposition of layers with high and low hematocrits. \nFor example, as shown in Figure \\ref{fig5-40} (top panel with $\\lambda=10$) the central part is depleted in RBCs, but it is escorted by two enriched layers, which themselves are surrounded by two depleted layers at the periphery (close to the channel walls). \nThis 5-layer configuration (fluid-cell-fluid-cell-fluid) has an extremely interesting impact on the partition.\nThis can be highlighted by measuring $\\phi_1/\\phi_0$ as a function of the bulk flow rate ratio $Q_1/Q_0$ between a child branch and the parent vessel, for fixed $\\phi_0$ (Figure \\ref{fig-antiZF}). \n\n\nIf we focus first on the results for high $\\phi_0$ ($\\phi_0\\simeq 40\\%$), we find again the insensitivity to $\\lambda$. \nAs $Q_1/Q_0$ is increased from 0 to 0.5, the low flow rate branch 1 recruits first the CFL and then the cells.\nThis implies that $\\phi_1$ starts at 0 and increases until reaching $\\phi_0$ when the situation is symmetric ($Q_1=Q_2=Q_0/2$). \nOur results agree with  a previous 2D simulation obtained for $\\phi_0\\simeq32\\%$ \\citep{yin13} as well as with the empirical law of Pries and coworkers \\citep{pries90}.\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n \\includegraphics[width=3.25in]{fig6}\n\n\\caption{The relative hematocrit in one child branch as a function of the bulk flow ratio. Solid lines correspond to the empirical law proposed in ref \\citep{pries90}, for $a=W$. For simulations, the relative hematocrit is $\\phi_1/\\phi_0$. For Pries law, it is given by $H_1/H_0$. A: high hematocrit ($\\phi_0=H_0=40\\%$). B: low hematocrit ($\\phi_0=H_0=5\\%$).\\label{fig-antiZF}}\n\\end{center}\n\\end{figure}\n\n\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\n \\includegraphics[width=6.25in]{fig7}\n\n \\caption{Experiments: the hematocrit in the low flow rate branch $H_1$ as a function of the hematocrit in the parent vessel $H_0$. A: Low $\\lambda$ ; B: High $\\lambda$. The length ratio between the branches is set to 3. The width $W$ of the inlet channel is set to 10, 20 and 30 $\\mu$m. The corresponding empirical laws of Pries \\textit{et al.}\\citep{pries90} are also shown. The dotted line (the one with highest slope) corresponds to equal partition ($H_1=H_0$). For $W=20$ $\\mu$m, the data are the continuation of the data already reported in Figure \\ref{figphi1phi0}.C: Snapshots for each width $W$ and two concentrations $H_0=0.6\\%$ and 4.5\\%. Every snapshot is the superimposition of 10 successive images in order  to highlight the structure of the suspension in the parent vessel\\label{fig-antiZFexp}}\n\\end{center}\n\\end{figure}\n\n\n\nAn unexpected phenomenon is observed at low enough hematocrit, for $\\phi_0=5\\%$ and at high viscosity contrast $\\lambda=10$,\nin contrast to the high hematocrit regime (see Figure \\ref{fig-antiZF} B, $\\lambda=10$).\nAt low $Q_1/Q_0$, the peripheral CFL in the parent vessel is recruited by the branch 1 so $\\phi_1$ starts at 0 and increases when $Q_1$ increases. \nAround $Q_1/Q_0=0.3$, $\\phi_1$ becomes larger than $\\phi_0$.\nThis means the hematocrit is increased in the low flow rate branch, which is the reverse behavior of the Zweifach-Fung effect. \nThe five-layer structure mentioned above is the key ingredient for understanding this unexpected behavior: \nIn the intermediate range $0.3<Q_1/Q_0<0.5$, the low flow rate branch recruits the lateral CFL layer plus the adjacent RBC-rich layer among the five layers. \nBy contrast, the high flow rate branch recruits the CFL layer close to the opposite wall plus its adjacent  RBC-rich layer (exactly as the low flow rate branch) as well as the central (and depleted) layer. \nThus, while both branches recruit approximately the same amount of cells per unit time, those are more dilute in the high flow rate branch, which receives more fluid, while in the classical Zweifach-Fung effect, the high flow rate branch is the one that receives more cells. For $\\lambda=1$ (see Figure \\ref{fig-antiZF}B with $\\lambda=1$), the two-peak structure is not as marked as in the case of $\\lambda=10$, so the reverse Zweifach-Fung effect is not as strong. \nThe subtle role played by the suspension structuring at low hematocrit is also supported by our experiments, where the interplay between the diffusion and the wall-lift force is controlled by varying the width $W$ of the inlet channel (see Figure \\ref{fig-antiZFexp}). \nWhen $W$ is low ($W$ = 10 $\\mu$m), the hematocrit in the low flow rate branch is much lower than expected from Pries \\textit{et al.} predictions (which were not validated on this confinement range).\nThis is caused by the CFL effect that becomes very strong. \nAs in the simulations, for $Q_1/Q_0=0.25$, this effect is more pronounced at low $\\lambda$, that corresponds to a more important wall lift force. \nThe 5-layer structure is clearly observed also in the experiments for $H_0<5\\%$, $W=20$ or 30 $\\mu$m and at low $\\lambda$ (Figure \\ref{fig-antiZFexp}C), but not at high $\\lambda$, while it was more strongly marked at high $\\lambda$ in the simulations. \nThis indicates that this peculiar structure is very dependent on the mechanical properties of the cells and also on the degree of confinement. \nNevertheless, a robust feature is valid in both simulations and experiments: When the two-file structure of RBCs takes place, a clear inversion of the blood partition at the bifurcation is observed. In the experiments, this corresponds to Figure \\ref{fig-antiZFexp}A, where some points lie above the equal partition line when $H_0<2\\%$.\n\nThere are also situations in which one of the two branches can be even completely devoid of RBCs (Figure \\ref{fig-antiZFexp}C). A corresponding prolonged lack of RBCs perfusion to real blood vessels causes dysfunction and possibly ischemia disease. \nBecause RBC mechanical properties are affected by aging and pathologies, these can induce abnormal partitions of the hematocrit in the vascular network. \n\n\\section{Discussion and conclusions} \n\\label{sec:discussion}\n\n\nAs a result of the interplay between the Zweifach-Fung effect and the F\\aa hr\\ae us effect the hematocrit in microcirculation can reach values as low as 10-20\\% compared to the average hematocrit in human body (45\\%).\nAt such a low hematocrit, our simulations and \\textit{in vitro} microfluidic experiments have revealed that RBCs partition at the level of bifurcations depends strongly on the viscosity contrast between the viscosities of the RBC hemoglobin and the suspending fluid.\nIn the extreme hemodilution, our results exhibit a newly reported phenomenon: The low flow rate branch may receive higher hematocrit than the high flow rate branch in opposition to the known Zweifach-Fung effect. This phenomenon is observed under moderate confinement and is the result of a peculiar structuring of the cell suspension. Under stronger confinement, other strong discrepancy with Pries \\textit{et al.} empirical law  was highlighted, with  a strong asymmetry in the partitioning (enhanced Zweifach-Fung effect). Our findings suggest that the viscosity contrast must be taken into consideration and carefully analyzed in order to have a firm understanding of RBC distribution in microcirculation.  This physiological parameter increases with aging as well as with some pathologies.\n\nThe results of our present work provide a valuable background needed to pinpoint the various RBCs properties that govern hematocrit partition, and thus oxygen delivery in the microcirculation in general. \n\n\n\n \n\\section*{Acknowledgment}\nZ. S. thanks Vassanti Audemar for experimental advice and assistance. Z. S., G. C., C. M. and T. P. acknowledge financial support from CNES (Centre National d'Etudes Spatiales) and ESA (European Space Agency). The DyFCom team of LIPhy (Z. S., G. C., C. M. and T. P.) is member of Labex TEC21 (Investissements d'Avenir-Grant Agreement ANR-11-LABX-0030), Structure F\\'ed\\'erative de Recherche iDYSCO (CNRS), F\\'ed\\'eration Galileo Galilei de Grenoble (FR3345 CNRS-UJF-Grenoble INP-IRSTEA) and Groupement de Recherche MECABIO (GDR3570 CNRS).\n\n\\begin{thebibliography}{41}\n\\providecommand{\\natexlab}[1]{#1}\n\\providecommand{\\url}[1]{\\texttt{#1}}\n\\expandafter\\ifx\\csname urlstyle\\endcsname\\relax\n  \\providecommand{\\doi}[1]{doi: #1}\\else\n  \\providecommand{\\doi}{doi: \\begingroup \\urlstyle{rm}\\Url}\\fi\n\n\\bibitem[Abkarian et~al.(2007)Abkarian, Faivre, and Viallat]{abkarian07}\nM.~Abkarian, M.~Faivre, and A.~Viallat.\n\\newblock Swinging of red blood cells under shear flow.\n\\newblock \\emph{Phys. Rev. Lett.}, 98:\\penalty0 188302, 2007.\n\n\\bibitem[Audet and Olbricht(1987)]{audet87}\nD.~M. Audet and W.~L. Olbricht.\n\\newblock The motion of model cells at capillary bifurcations.\n\\newblock \\emph{Microvasc. Res.}, 33:\\penalty0 377--396, 1987.\n\n\\bibitem[Barber et~al.(2008)Barber, Alberding, Restrepo, and Secomb]{barber08}\nJ.~O. Barber, J.~P. Alberding, J.~M. Restrepo, and T.~W. Secomb.\n\\newblock Simulated two-dimensional red blood cell motion, deformation, and\n  partitioning in microvessel bifurcations.\n\\newblock \\emph{Ann. Biomech. Eng.}, 36:\\penalty0 1690--1698, 2008.\n\n\\bibitem[Callens et~al.(2008)Callens, Minetti, Coupier, Mader, Dubois, Misbah,\n  and Podgorski]{callens08}\nN.~Callens, C.~Minetti, G.~Coupier, M.~Mader, F.~Dubois, C.~Misbah, and\n  T.~Podgorski.\n\\newblock Hydrodynamic lift of vesicles under shear flow in microgravity.\n\\newblock \\emph{Europhys. Lett.}, 83:\\penalty0 24002, 2008.\n\n\\bibitem[Cantat and Misbah(1999)]{cantat99}\nI.~Cantat and C.~Misbah.\n\\newblock Lift force and dynamical unbinding of adhering vesicles under shear\n  flow.\n\\newblock \\emph{Phys. Rev. Lett.}, 83:\\penalty0 880--883, 1999.\n\n\\bibitem[Chien et~al.(1985)Chien, Tvetenstrand, Epstein, and\n  {Schmid-Schonbein}]{chien85}\nS.~Chien, C.~D. Tvetenstrand, M.~A. Epstein, and G.~W. {Schmid-Schonbein}.\n\\newblock Model studies on distributions of blood cells at microvascular\n  bifurcations.\n\\newblock \\emph{Am. J. Physiol. Heart Circ. Physiol.}, 248:\\penalty0\n  H568--H576, 1985.\n\n\\bibitem[Cokelet and Meiselman(1968)]{cokelet68}\nG.~R. Cokelet and H.~J. Meiselman.\n\\newblock Rheological comparison of hemoglobin solutions and erythrocyte\n  suspensions.\n\\newblock \\emph{Science}, 162:\\penalty0 275--377, 1968.\n\n\\bibitem[Cokkinos et~al.(2006)Cokkinos, Pantos, Heusch, and\n  Taegtmeyer]{cokkinos06}\nD.~V. Cokkinos, C.~Pantos, G.~Heusch, and H.~Taegtmeyer.\n\\newblock \\emph{Myocardial ischemia: from mechanisms to therapeutic\n  potentials}, volume~21.\n\\newblock Springer Science \\& Business Media, 2006.\n\n\\bibitem[Coupier et~al.(2008)Coupier, Kaoui, Podgorski, and Misbah]{coupier08}\nG.~Coupier, B.~Kaoui, T.~Podgorski, and C.~Misbah.\n\\newblock Noninertial lateral migration of vesicles in bounded {P}oiseuille\n  flow.\n\\newblock \\emph{Phys. Fluids}, 20:\\penalty0 111702, 2008.\n\n\\bibitem[Dellimore et~al.(1983)Dellimore, Dunlop, and Canham]{dellimore83}\nJ.~W. Dellimore, M.~J. Dunlop, and P.~B. Canham.\n\\newblock Ratio of cells and plasma in blood flowing past branches in small\n  plastic channels.\n\\newblock \\emph{Am. J. Physiol. Heart Circ. Physiol.}, 244:\\penalty0\n  H635--H643, 1983.\n\n\\bibitem[Ditchfield and Olbricht(1996)]{ditchfield96}\nR.~Ditchfield and W.~L. Olbricht.\n\\newblock Effects of particle concentration on the partitioning of suspensions\n  at small divergent bifurcations.\n\\newblock \\emph{J. Biomech. Eng.}, 118:\\penalty0 287--294, 1996.\n\n\\bibitem[Doyeux et~al.(2011)Doyeux, Podgorski, Peponas, Ismail, and\n  Coupier]{doyeux11}\nV.~Doyeux, T.~Podgorski, S.~Peponas, M.~Ismail, and G.~Coupier.\n\\newblock Spheres in the vicinity of a bifurcation: elucidating the\n  {Zweifach-Fung} effect.\n\\newblock \\emph{J. Fluid Mech.}, 674:\\penalty0 359, 2011.\n\n\\bibitem[Dupire et~al.(2012)Dupire, Socol, and Viallat]{dupire12}\nJ.~Dupire, M.~Socol, and A.~Viallat.\n\\newblock Full dynamics of a red blood cell in shear flow.\n\\newblock \\emph{Proceedings of the National Academy of Sciences}, 109\\penalty0\n  (51):\\penalty0 20808--20813, 2012.\n\n\\bibitem[Farutin and Misbah(2014)]{farutin14}\nA.~Farutin and C.~Misbah.\n\\newblock Symmetry breaking and cross-streamline migration of three-dimensional\n  vesicles in an axial poiseuille flow.\n\\newblock \\emph{Physical Review E}, 89\\penalty0 (4):\\penalty0 042709, 2014.\n\n\\bibitem[Fedosov et~al.(2011)Fedosov, Caswell, Suresh, and\n  Karniadakis]{fedosov11}\nD.~Fedosov, B.~Caswell, S.~Suresh, and G.~Karniadakis.\n\\newblock Quantifying the biophysical characteristics of\n  plasmodium-falciparum-parasitized red blood cells in microcirculation.\n\\newblock \\emph{Proceedings of the National Academy of Sciences}, 108\\penalty0\n  (1):\\penalty0 35--39, 2011.\n\n\\bibitem[Fenton et~al.(1985)Fenton, Carr, and Cokelet]{fenton85}\nB.~M. Fenton, R.~T. Carr, and G.~R. Cokelet.\n\\newblock Nonuniform red cell distribution in 20 to 100 $\\mu$m bifurcations.\n\\newblock \\emph{Microvasc. Res.}, 29:\\penalty0 103--126, 1985.\n\n\\bibitem[Fung(2013)]{Fung13}\nY.-C. Fung.\n\\newblock \\emph{Biomechanics: circulation}.\n\\newblock Springer Science \\& Business Media, 2013.\n\n\\bibitem[Grandchamp et~al.(2013)Grandchamp, Coupier, Srivastav, Minetti, and\n  Podgorski]{grandchamp13}\nX.~Grandchamp, G.~Coupier, A.~Srivastav, C.~Minetti, and T.~Podgorski.\n\\newblock Lift and down-gradient shear-induced diffusion in red blood cell\n  suspensions.\n\\newblock \\emph{Phys. Rev. Lett.}, 110:\\penalty0 108101, 2013.\n\n\\bibitem[Guibert et~al.({2010})Guibert, Fonta, and Plouraboue]{guibert10}\nR.~Guibert, C.~Fonta, and F.~Plouraboue.\n\\newblock {A New Approach to Model Confined Suspensions Flows in Complex\n  Networks: Application to Blood Flow}.\n\\newblock \\emph{{Transport Porous Med.}}, {83}:\\penalty0 {171--194}, {2010}.\n\n\\bibitem[Hariprasad and Secomb(2014)]{hariprasad14}\nD.~S. Hariprasad and T.~W. Secomb.\n\\newblock Two-dimensional simulation of red blood cell motion near a wall under\n  a lateral force.\n\\newblock \\emph{Phys. Rev. E}, 90:\\penalty0 053014, 2014.\n\n\\bibitem[Hyakutake and Nagai(2015)]{hyakutake15}\nT.~Hyakutake and S.~Nagai.\n\\newblock Numerical simulation of red blood cell distributions in\n  three-dimensional microvascular bifurcations.\n\\newblock \\emph{Microvasc. Res.}, 97:\\penalty0 115 -- 123, 2015.\n\\newblock ISSN 0026-2862.\n\n\\bibitem[Kaoui et~al.(2011)Kaoui, Harting, and Misbah]{kaoui11}\nB.~Kaoui, J.~Harting, and C.~Misbah.\n\\newblock Two-dimensional vesicle dynamics under shear flow: Effect of\n  confinement.\n\\newblock \\emph{Physical Review E}, 83\\penalty0 (6):\\penalty0 066319, 2011.\n\n\\bibitem[Katanov et~al.(2015)Katanov, Gompper, and Fedosov]{katanov15}\nD.~Katanov, G.~Gompper, and D.~A. Fedosov.\n\\newblock Microvascular blood flow resistance: Role of red blood cell migration\n  and dispersion.\n\\newblock \\emph{Microvascular research}, 99:\\penalty0 57--66, 2015.\n\n\\bibitem[Kelemen et~al.(2001)Kelemen, Chien, and Artmann]{kelemen01}\nC.~Kelemen, S.~Chien, and G.~Artmann.\n\\newblock Temperature transition of human hemoglobin at body temperature:\n  effects of calcium.\n\\newblock \\emph{Biophysical journal}, 80\\penalty0 (6):\\penalty0 2622--2630,\n  2001.\n\n\\bibitem[Kr{\\\"u}ger et~al.(2014)Kr{\\\"u}ger, Kaoui, and Harting]{kruger14}\nT.~Kr{\\\"u}ger, B.~Kaoui, and J.~Harting.\n\\newblock Interplay of inertia and deformability on rheological properties of a\n  suspension of capsules.\n\\newblock \\emph{Journal of Fluid Mechanics}, 751:\\penalty0 725--745, 2014.\n\n\\bibitem[Kumar et~al.(2014)Kumar, Henr\\'{\\i}quez~Rivera, and Graham]{kumar14}\nA.~Kumar, R.~G. Henr\\'{\\i}quez~Rivera, and M.~D. Graham.\n\\newblock Flow-induced segregation in confined multicomponent suspensions:\n  effects of particle size and rigidity.\n\\newblock \\emph{J. Fluid Mech.}, 738:\\penalty0 423--462, 1 2014.\n\\newblock ISSN 1469-7645.\n\n\\bibitem[Li et~al.(2012)Li, Popel, and Karniadakis]{li12}\nX.~Li, A.~S. Popel, and G.~E. Karniadakis.\n\\newblock Blood-plasma separation in y-shaped bifurcating microfluidic\n  channels: a dissipative particle dynamics simulation study.\n\\newblock \\emph{Phys. Biol.}, 9:\\penalty0 026010, 2012.\n\n\\bibitem[McWhirter et~al.(2009)McWhirter, Noguchi, and Gompper]{mcwhirter09}\nJ.~L. McWhirter, H.~Noguchi, and G.~Gompper.\n\\newblock Flow-induced clustering and alignment of vesicles and red blood cells\n  in microcapillaries.\n\\newblock \\emph{Proceedings of the National Academy of Sciences}, 106\\penalty0\n  (15):\\penalty0 6039--6043, 2009.\n\n\\bibitem[Ollila et~al.(2013)Ollila, Denniston, and Ala-Nissila]{ollila13}\nS.~T. Ollila, C.~Denniston, and T.~Ala-Nissila.\n\\newblock One- and two-particle dynamics in microfluidic t-junctions.\n\\newblock \\emph{Phys. Rev. E}, 87:\\penalty0 050302, 2013.\n\n\\bibitem[Peskin(2002)]{peskin02}\nC.~S. Peskin.\n\\newblock The immersed boundary method.\n\\newblock \\emph{Acta numerica}, 11:\\penalty0 479--517, 2002.\n\n\\bibitem[Pries et~al.(1989)Pries, Ley, Claassen, and Gaethgens]{pries89}\nA.~R. Pries, K.~Ley, M.~Claassen, and P.~Gaethgens.\n\\newblock Red cell distribution at microvascular bifurcations.\n\\newblock \\emph{Microvasc. Res.}, 38:\\penalty0 81--101, 1989.\n\n\\bibitem[Pries et~al.(1990)Pries, Secomb, Gaehtgens, and Gross]{pries90}\nA.~R. Pries, T.~W. Secomb, P.~Gaehtgens, and J.~F. Gross.\n\\newblock Blood flow in microvascular networks. experiments and simulation.\n\\newblock \\emph{Circ. Res.}, 67\\penalty0 (4):\\penalty0 826--34, 1990.\n\\newblock \\doi{10.1161/01.RES.67.4.826}.\n\n\\bibitem[Roberts and Olbricht(2003)]{roberts03}\nB.~W. Roberts and W.~L. Olbricht.\n\\newblock Flow-induced particulate separations.\n\\newblock \\emph{AIChE J.}, 49:\\penalty0 2842--2849, 2003.\n\n\\bibitem[Roberts and Olbricht(2006)]{roberts06}\nB.~W. Roberts and W.~L. Olbricht.\n\\newblock The distribution of freely suspended particles at microfluidic\n  bifurcations.\n\\newblock \\emph{AIChE J.}, 52:\\penalty0 199--206, 2006.\n\n\\bibitem[Sherwood et~al.(2012)Sherwood, Kaliviotis, Dusting, and\n  Balabani]{sherwood14}\nJ.~M. Sherwood, E.~Kaliviotis, J.~Dusting, and S.~Balabani.\n\\newblock Hematocrit, viscosity and velocity distributions of aggregating and\n  non-aggregating blood in bifurcating microchannel.\n\\newblock \\emph{Biomicrofluidics}, 6:\\penalty0 024119, 2012.\n\n\\bibitem[Shi et~al.(2012)Shi, Pan, and Glowinski]{shi12}\nL.~Shi, T.-W. Pan, and R.~Glowinski.\n\\newblock Numerical simulation of lateral migration of red blood cells in\n  poiseuille flows.\n\\newblock \\emph{Int. J. Numer. Methods Fluids}, 68\\penalty0 (11):\\penalty0\n  1393--1408, 2012.\n\n\\bibitem[Tsubota et~al.(2006)Tsubota, Wada, and Yamaguchi]{tsubota06}\nK.~Tsubota, S.~Wada, and T.~Yamaguchi.\n\\newblock Particle method for computer simulation of red blood cell motion in\n  blood flow.\n\\newblock \\emph{Computer methods and programs in biomedicine}, 83\\penalty0\n  (2):\\penalty0 139--146, 2006.\n\n\\bibitem[Woolfenden and Blyth(2011)]{woolfenden11}\nH.~C. Woolfenden and M.~G. Blyth.\n\\newblock Motion of a two-dimensional elastic capsule in a branching channel\n  flow.\n\\newblock \\emph{J. Fluid Mech.}, 669:\\penalty0 3--31, 2 2011.\n\n\\bibitem[Xiong and Zhang(2012)]{xiong12}\nW.~Xiong and J.~Zhang.\n\\newblock Two-dimensional lattice boltzmann study of red blood cell motion\n  through microvascular bifurcation: cell deformability and suspending\n  viscosity effects.\n\\newblock \\emph{Biomech. Model. Mechanobiol.}, 11:\\penalty0 575--583, 2012.\n\n\\bibitem[Yin et~al.(2013)Yin, Thomas, and J.Zhang]{yin13}\nX.~Yin, T.~Thomas, and J.Zhang.\n\\newblock Multiple red blood cell flows through microvascular bifurcations:\n  Cell free layer, cell trajectory, and hematocrit separation.\n\\newblock \\emph{Microvasc. Res.}, 89:\\penalty0 47 -- 56, 2013.\n\n\\bibitem[Zhang et~al.(2007)Zhang, Johnson, and Popel]{zhang07}\nJ.~Zhang, P.~C. Johnson, and A.~S. Popel.\n\\newblock An immersed boundary lattice boltzmann approach to simulate\n  deformable liquid capsules and its application to microscopic blood flows.\n\\newblock \\emph{Physical biology}, 4\\penalty0 (4):\\penalty0 285, 2007.\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 16217, "prevtext": "\n where $\\alpha=1+ 6.98 (1-H_{0_F})/a$, $\\beta=0.4/a$ (with $a$  the tube diameter in microns) and $\\mathrm{logit}(x)=\\ln[x/(1-x)]$. $H_0$ is the volumetric hematocrit in the parent feeding branch, while $H_1$ is the hematocrit in a child branch. $H_{0_F}$ is the feeding hematocrit in a reservoir that would be located right before the narrow feeding vessel. Due to the F\\aa hr\\ae us effect, $H_{0_F}$ is larger than $H_0$ and a relationship between both quantities is also given in \\cite{pries90}: \n \n", "index": 3, "text": "\\begin{equation}\n H_0/H_{0_F}=H_{0_F}+(1-H_{0_F})(1+1.7 e^{-0.415 a}-0.6 e^{-0.011 a}).\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"H_{0}/H_{0_{F}}=H_{0_{F}}+(1-H_{0_{F}})(1+1.7e^{-0.415a}-0.6e^{-0.011a}).\" display=\"block\"><mrow><mrow><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>/</mo><msub><mi>H</mi><msub><mn>0</mn><mi>F</mi></msub></msub></mrow><mo>=</mo><mrow><msub><mi>H</mi><msub><mn>0</mn><mi>F</mi></msub></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>H</mi><msub><mn>0</mn><mi>F</mi></msub></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>1</mn><mo>+</mo><mrow><mn>1.7</mn><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mn>0.415</mn><mo>⁢</mo><mi>a</mi></mrow></mrow></msup></mrow></mrow><mo>-</mo><mrow><mn>0.6</mn><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mn>0.011</mn><mo>⁢</mo><mi>a</mi></mrow></mrow></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]