[{"file": "1601.01489.tex", "nexttext": "\nwhere $n_\\mathrm{e}$ is the electron density in ${\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$,\n$B_\\parallel$ is the component of the magnetic field along the line of\nsight in $\\mu$G and the integral is over length $L$ in kpc. In\nPKS\\,1246-410 the plausible explanations for high RM are the optical\nline-emitting filaments crossing in front of the radio lobes and\nfilamentary soft X-ray emitting gas \\citep{Taylor07} or local\ninteractions with the synchrotron-emitting plasma \\citep{RudnickBlundell03}.\n\nSeveral of the high RM locations, both in the positive and negative\ndirections, are coincident with filaments of soft X-ray emission. The\ntube of high negative RM south and east of the nucleus (RM6) is\ncoincident with a soft X-ray filament, although the filament does not\nrun along the full length of the tube but passes into a neighbouring\nregion of high positive RM. There is, however, not an exact\ncorrespondence between the soft X-ray emission and regions of high RM,\nperhaps due to surface effects in the skin of the radio source \\citep{RudnickBlundell03},\nor because of absorption of X-rays by the dust lane\n  (see Section \\ref{sect:optical}). Where the X-ray emission is\nbrightest, along the ridge south and west of the nucleus, the\npolarisation cannot be measured.\n\nThe lack of RM measurements in regions coincident with the soft X-ray\nemission and dust lane may be due to depolarisation of the\nsource. Depolarisation is consistent with the gas surrounding the\nfilaments being cooler and denser and more highly magnetised. The\nfields could help support the filaments, as in the Perseus cluster\n\\citep{Fabian08}. Depolarisation is also supported by the isolated\nknots of high RM signal inside regions where the polarisation cannot\nbe measured (e.g. RM1 and RM5). If the regions containing large RMs\nare dominated by line-emitting gas with their associated soft X-ray\nfilaments, and magnetic support is important as in Perseus,\nthe high RMs are likely more sensitive to the magnetic field\nin the filaments than those in the bulk of the ICM.\n\n\\begin{figure*}\n  \\includegraphics[width=0.32\\textwidth]{fig20_1_small.pdf}\n  \\includegraphics[width=0.32\\textwidth]{fig20_2_small.pdf}\n  \\includegraphics[width=0.32\\textwidth]{fig20_3_small.pdf}\n  \\caption{Normalisation per unit area for\n    components with temperatures of 0.5, 1 and 2 keV. A model was\n    fitted with 0.5, 1, 2 and 4 keV components with $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$\n    metallicity, using $S/N=20$ bins, minimising the C-statistic of\n    the fit. The units are log$_{10}$ cm$^{-5}$ arcsec$^{-2}$.}\n  \\label{fig:norm_T_maps}\n\\end{figure*}\n\n\\section{Inner multiphase structure}\n\\label{sect:thermprof}\n\\subsection{Multiple temperature components}\n\nExamining the thermodynamic state of the central region of the cluster\nis important for understanding the balance between heating and cooling\nand on what physical scales that is occurring. A useful technique for visualising\nthe location of X-ray material at different temperatures is to fit a\nmodel made up of several fixed temperature components, allowing the\nnormalisation of each component to vary\n\\citep{FabianPer06}. Fig.~\\ref{fig:norm_T_maps} shows the spatial\ndistribution of the three coldest components in a model made up of\n0.5, 1, 2 and 4 keV temperatures. The 0.5~keV material lies along the\nregions of soft X-ray emission and has a similar morphology to the\ndust and H$\\alpha$ emission (Fig.~\\ref{fig:optresid}) and is offset\nfrom the nucleus. The 1~keV gas traces the central ridge of\nbright X-ray emission, the hook and the plume. The material closest to\n2 keV appears associated with the rims of the inner cavities, the\nplume and the `inner edge' (Fig.~\\ref{fig:rgb}).\n\n\n\\begin{figure*}\n  \\includegraphics[width=\\textwidth]{fig21_small.pdf}\n  \\caption{Comparison between the temperature (in\n    keV) using a single-component model (left) and a two-component\n    model (centre and right) using $S/N=40$ bins, allowing the\n    metallicity to vary (assuming both components have the same\n    metallicity) and minimising the C-statistic. Values for the\n    two-component model are only shown when the improvement in\n    C-statistic has 1 per cent probability of chance occurrence\n    (determined from fits of realisations of single component\n    models).}\n  \\label{fig:maps_2T}\n\\end{figure*}\n\nThe core of the cluster has phases with different temperatures which\nare coincident in position. We examined these temperatures using a\ntwo-component variable temperature model. Fig.~\\ref{fig:maps_2T}\ncompares a single-component map against the lower and upper\ntemperatures of a two-temperature model, when the temperatures of the\nmodel can be constrained. Further details and results are given in\nAppendix \\ref{sect:thermprofscentre}. The results show that the two\ncomponents are required over the plume region \\citep[as found\npreviously in][]{SandersCent02} and in the opposite direction towards\ncavity E (Fig.~\\ref{fig:centre_spec_maps}). The lower temperature\ncomponent drops from 1.5~keV at the end of the plume to $\\sim 0.7$ keV\nin the regions associated with the filaments and the coldest material\nfrom the fixed component analysis (Fig.~\\ref{fig:norm_T_maps}). The\nupper component has a fairly flat 2 keV temperature distribution over\nmuch of the inner region. Its temperature, however, increases to 3 keV\nat the end of the plume and drops to 1.3 keV in a few locations where\nthe coolest component is lowest.\n\n\\subsection{Powerlaw spectral fits}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig22_small.pdf}\n  \\caption{Powerlaw, two or single component fits to bins with\n    $S/N=100$. (Top panel) Radial temperature profiles. Powerlaw upper\n    and lower temperatures are shown if the upper can be determined to\n    better than 1 keV and the index to at least 1. Two component\n    results are shown if the temperatures can be determined to at\n    least 20 per cent and the minimum temperature is $>0.4$ keV. The\n    single component results are shown if neither of these criteria\n    are passed. Larger markers are shown for the powerlaw or\n    two-component results depending on which has the lower C-statistic\n    value. (Bottom panel) The powerlaw index parameter when\n    appropriate.}\n  \\label{fig:T_index}\n\\end{figure}\n\nIn order to see whether a continuous temperature distribution is more\nrealistic, we fitted a powerlaw-temperature-distribution model, which\nassumes that the gas has a range in temperature between\n$T_\\mathrm{upper}$ and $T_\\mathrm{lower}$. The model is constructed\nusing $N$ logarithmically-spaced temperature components (here 16),\nwhere the relative normalisation of one component at temperature $T$\nis given by $(T/T_\\mathrm{lower})^\\Gamma$. Each component is assumed\nto have the same metallicity. This powerlaw model has the same number\nof free parameters as a two-component model, as the free normalisation\nis substituted for the powerlaw index.\n\nA comparison between the temperature values obtained with the\ntwo-component model and the powerlaw upper and lower temperatures is\nshown in Fig.~\\ref{fig:T_index}. Well constrained temperatures and powerlaw indices\nfor the two-component and powerlaw fits are mostly found in the central region.  The obtained\ntemperature range is wider when a powerlaw temperature distribution is\nassumed. As the two-temperature and powerlaw models are distinct, we\ncannot compare them with an F-test. However, the powerlaw model\nproduces better fits in the central regions compared to the\ntwo-component model. In addition, the powerlaw index increases from\nnegative values (where low temperatures dominate) to positive values\n(where high temperatures dominate) as a function of radius.\n\n\\subsection{Accounting for projection effects}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.95\\columnwidth]{fig23_small.pdf}\n  \\caption{Deprojected profiles for the eastern (E)\n    and western halves (W) of the cluster. Shown are the results for\n    single- and two-component models (where the errors on the\n    temperatures are less than 20 per cent). See Appendix\n    \\ref{append:deprojcentre} for details. We plot the results from\n    projected two-temperature fits for comparison (Appendix\n    \\ref{sect:thermprofscentre}; plotting every 4th point). Powerlaw\n    fits to the pressure and density profiles, and the estimated free\n    fall time, are shown.}\n  \\label{fig:deproj_EW}\n\\end{figure}\n\nSome of the multiple components may be due to projected spectra of\nmaterial along the line of sight. We therefore construct profiles from\ndeprojected spectra in east and west sectors\n(Fig.~\\ref{fig:deproj_EW}). The eastern side of the\n  cluster centre is strongly affected by the plume which we do not\n  remove.  The maximum difference in temperature between the eastern\nand western sides is around 30 per cent. Excluding the cavities, the\ndensity can differ by 40 per cent. In pressure there is generally\nlittle difference between the two sides, except at the locations of\nthe cavities (between 2.4 and 4.3 kpc radius). The single-component\nmetallicity values show a large discrepancy between the east and west,\nalthough when two temperature components are used, this difference\nbecomes much smaller.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig24_small.pdf}\n  \\caption{Comparison of powerlaw, single and two-component model\n    deprojected spectral fits.  Panels are the temperature (top),\n    metallicity (2nd), power law index (3rd) and fit $\\chi^2$\n    (bottom). The projected two-component results are also shown,\n    plotting only every 4th point.}\n  \\label{fig:deproj_plaw}\n\\end{figure}\n\nWe can also fit the powerlaw distribution model to the deprojected\ndata. The results of these fits (Fig.~\\ref{fig:deproj_plaw}) show a\nsimilar trend to the projected results, where the powerlaw temperature\nrange is wider than the two temperatures of the two-component\nfits. The index cannot be constrained very well, but scatters around a\nvalue of 0. If we examine the best fitting metallicity for the\nsingle-component, two-component and powerlaw deprojected fits and the\ntwo-component projected fits, then we find that there is reasonable\nagreement for all these models except for the single-component\ndeprojected results, which show a stronger drop in metallicity in the\ncentral regions. However, all the results show a central metallicity\ndrop. In the figure we also plot the $\\chi^2$ of the best fit to the\ndeprojected spectra for each of the models. The two-component and\npowerlaw models fit the data better in the central regions, but there\nis little difference in the fit quality between these two models\nthere. In the projected fits, the powerlaw model appeared to fit the\ndata better than the two-component model in the central regions, but\nit is unclear whether this is due to projection effects or data\nquality.\n\n\\subsection{Discussion}\nThere is projected emission down to $\\sim 0.9{\\rm\\thinspace keV}$ with a\nsingle-component model or $0.7{\\rm\\thinspace keV}$ with two components. This is\nroughly consistent with the \\emph{XMM}-RGS results\n\\citep{SandersRGS08} which show Fe~\\textsc{xvii} emission, with\nmaterial down at $0.3-0.45{\\rm\\thinspace keV}$. The difference may be due to\nprojection effects, the limited spectral resolution of ACIS and the\nassumption of $1.2\\times 10^{21} {\\hbox{${\\rm\\thinspace cm}^{-2}\\,$}}$ absorbing Hydrogen column\ndensity in this analysis. There is dust associated with the filaments\nwhich could contain additional absorbing material. We also note that\nwe always assume that the thermal components have the same\nmetallicity, which may not be the case.\n\nThe coolest X-ray filaments lie closest to the core of the cluster at\nthe location of the dust filaments, albeit with an offset\n(Fig.~\\ref{fig:optresid} and Fig.~\\ref{fig:vcentre}). The X-ray gas is\nclearly multiphase in the centre of the cluster and more than one\nthermal component is required to fit the spectra\n(e.g. Fig.~\\ref{fig:deproj_plaw}). The multiphaseness is not due to\nprojection effects caused by the cluster temperature gradient and is\nseen in deprojected spectra (Fig.~\\ref{fig:deproj_EW}). Introducing a\ntwo-component model into the spectral model (Fig.~\\ref{fig:T_radius})\nshows that there is a 0.8 to 2 keV temperature range over most of the\ninner 6 kpc, rather than the more smoothly varying profile as seen in\nthe one-component model. Note that two components are only required in\nthe plume beyond this radius.  The two-component model decreases the\nminimum temperature found in the region, but the change is not\ndramatic (likely due to the fine spatial binning used here).  As there\nis a similar range in temperatures seen using a two-component compared\nto a single-component model within the inner 10 kpc, this suggests\nthat the multiphase filamentary structures we observe on the sky are\nreplicated along the line of sight in this region.\n\nDespite the lack of a much wider range in temperatures, we do observe\nslightly cooler gas down to $0.7{\\rm\\thinspace keV}$ in the core when using two\ntemperature models.  The multi-temperature structure is associated with\nthe filaments and plume and appear suddenly within a radius of\n10~kpc. There is in addition evidence for a wider range of\ntemperatures when fitting models with a powerlaw temperature\ndistribution (Fig.~\\ref{fig:T_index}). Powerlaw models provide\nincreasingly good fits to the data compared to two component models\ngoing to smaller radii. The index of the powerlaw also significantly\ndecreases at a smaller radius, indicating there is relatively more gas\nat lower temperatures.  The minimum temperature in the powerlaw\ndistribution tends to drop down to $\\sim 0.5{\\rm\\thinspace keV}$, close to the\n\\emph{XMM} results.  Similar powerlaw distribution fits are also\nsupported when projection effects are removed\n(Fig.~\\ref{fig:deproj_plaw}), although no improvement in the spectral\nfit over a two-component model is seen in this case.  The\ntwo-temperature models give a range in temperature of a factor of\n$\\sim 2$ in the core, which increases to $\\sim 4$ with powerlaw\nmodels. The multi-component maps of the cluster core similarly give a\nrange of $\\sim 4$ in the core of the cluster\n(Fig.~\\ref{fig:norm_T_maps}).\n\nThe minimum temperature of the single-component, two-component and\npowerlaw models decreases roughly with radius, although the coldest\nX-ray gas is offset from the nucleus and X-ray centroid\n(Fig.~\\ref{fig:vcentre}).  We note that the X-ray filaments in\nCentaurus are coolest, densest and better defined closer towards the\nnucleus (e.g. Figs. \\ref{fig:rgb} and \\ref{fig:vcentre},\n\\ref{fig:norm_T_maps}).  Dust filaments appear to extend down to the\nradio nucleus, however (Fig.~\\ref{fig:optresid}). If the shell at the\ncentre of the cluster is a shock, they must survive it. Given the\nstructure on small scales, it is difficult to define the centre and\naccount for projection.\n\nInstead of the cool filaments being pulled out from the central galaxy\nby rising bubbles, it has been suggested that cold blobs could\ncondense out of the ICM when the ratio of the cooling to the free-fall\ntime scale drops too low \\citep{Gaspari12, McCourt13, Li15}. We can\nestimate free-fall timescale for the cluster from the X-ray data. At a\nradius $r$ the free-fall timescale is given by $t_\\mathrm{ff} =\n(2r/g)^{1/2}$. The gravitational acceleration, $g$, if the cluster is\nin hydrostatic equilibrium is given by $g = -(1/\\rho)\n\\mathrm{d}P/\\mathrm{d}r$, where $P$ is the total pressure and $\\rho$\nis the mass density. The electron pressure in the cluster is\napproximated by a powerlaw model (Fig.~\\ref{fig:deproj_EW}),\n$P_\\mathrm{e} = 0.150(r/\\mathrm{kpc})^{-0.51} {\\hbox{$\\keV{\\rm\\thinspace cm}^{-3}\\,$}}$, while the\nelectron density is approximated by $n_\\mathrm{e} =\n0.168(r/\\mathrm{kpc})^{-0.83} {\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$. Therefore the gravitational\nacceleration in the centre of the cluster is $\\sim 1.4\\times 10^{-7}\n(r/\\mathrm{kpc})^{-0.68} {\\hbox{${\\rm\\thinspace cm}\\s^{-2}\\,$}}$. The implied free-fall time closely\ntracks a 10th of the cooling time (Fig.~\\ref{fig:deproj_EW}). It is\nnot obvious from the data for this model why there should be\nmultiphase gas within a certain radius given that there is not a large\nvariation in the ratio of cooling and free-fall times.\n\nWe note that the only multiphase gas present beyond 6 kpc radius is in\nthe plume and other related cool structures\n(Fig.~\\ref{fig:maps_2T}). There is low frequency radio emission\nassociated with the plume, showing it is likely material which has\nbeen dragged out by a rising cavity. There are no cool blobs of\nmaterial outside the plume region beyond 6 kpc radius which would\nindicate general condensation at larger radius where the cooling time\nis 10 times the free-fall time.\n\n\\section{Central abundance drop}\n\\label{sect:elemabund}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig25_small.pdf}\n  \\caption{Elemental abundances (in Solar units) to the east and west\n    of the cluster core, obtained by fitting two-component or powerlaw\n    distribution \\textsc{vapec} models to deprojected\n    spectra. Analysis details are given in Appendix\n    \\ref{sect:abunddetails}.}\n  \\label{fig:elemental_profile}\n\\end{figure}\n\nPrevious work has shown a central drop in abundance in the cluster\n\\citep{SandersCent02,Panagoulia13}. Here we examine this on small\nspatial scales using these new deeper data.  The deprojected\nmetallicity profiles of different elements to the east and west of the\ncluster core are shown in\nFig.~\\ref{fig:elemental_profile}. We note, however,\n  that this analysis assumes that the phases in each radial bin have\n  the same metallicity, which may not be a valid assumption. CCD-quality data are\n  not good enough to test this assumption. To the eastern side of the\ncluster the metallicities appear to exhibit more bin-to-bin variation\nthan the west. This is also seen in metallicity profiles with finer\nbins (Fig.~\\ref{fig:deproj_EW}). This could be real, however it may be\ndue to incorrect modelling of the complex thermal structure in the\nplume or it may be because the assumption of spherical symmetry when\ndeprojecting is invalid.\n\nThe profiles are consistent with central reductions in many of the\nprobed elemental abundances (Fe, Si, S, Mg and O). In the other\nmetals, it is unclear whether the profiles are flat or declining, due\nto large measurement uncertainties or differences between the two\nmodelling approaches. We note that several of the elemental lines are\nnot clearly separated in these CCD spectra (e.g. Ni and Ne lines are\nclose to the strong Fe-L lines) and therefore they cannot be\nmeasured unambiguously. Furthermore, the O abundance is affected by\nthe choice of the absorbing column density.\n\nWe therefore confirm the central drop in metallicity in the cluster.\n\\cite{Panagoulia13} suggests that the metals are locked into dust in\nthe centre of the cluster, they are moved to larger\n  radius by feedback processes, the grains are destroyed (e.g. by\n  sputtering) and the metals returned to the hot phase. Such a\n  scenario could also explain the metallicity blobs and flat inner\n  metallicity profile (Section\n  \\ref{sect:Zstructure}). Fig.~\\ref{fig:elemental_profile} is\nconsistent with this picture, confirming that Fe, Si and S abundances\ndrop in the centre to around a third of their peak value.\nFurthermore, we also find evidence for Mg and O depletion, although\nthese metallicities have some modelling uncertainties. These are all\nmetals which can form part of dust. Unfortunately, the quality of the\ndata are insufficient to measure the central Ar abundance, which is\nunlikely be depleted by dust formation. With the aid of detailed\nmodels of dust composition it may be possible in the future to test\nthe dust deposition model in Centaurus using those elements which we\ncan measure.\n\nUpcoming X-ray observatories such as \\emph{Athena}\n\\citep{NandraAthena13} will make extremely precise measurements of the\ntemperature distribution and metallicity in the core of Centaurus and\nthose other clusters \\citep{Panagoulia15} which show central drops in\nmetallicity. \\emph{Athena} will also be able to\n  measure the metallicity of different phases independently.\n\n\\section{Conclusions}\n\\label{sect:conclusions}\nWe analysed deep new \\emph{Chandra} observations of the Centaurus\ncluster, examining the larger-scale structure, metallicity\ndistribution, cold fronts and region around the nucleus. The main\nconclusions of our paper are as follows:\n\n\\begin{enumerate}\n\\item Gradient filtering using the Gaussian gradient\n    magnitude filter is able to robustly reveal previously\n    hard-to-discern structures in X-ray images of galaxy clusters.\n\\item The correlation on larger scales of the metals with SB and\n  inverse correlation with temperature implies that the asymmetry in\n  the cluster is dominated by sloshing motions.\n\\item Enriched dusty material, uplifted by AGN activity\n    would simultaneously explain the low inner metallicities, the flat\n    inner metallicity profile in the core and the existence of 5-10\n    kpc high metallicity blobs on the western side of the cluster.\n\\item We find 7 kpc `notches' around the edge of the western cold\n  front which may be KHIs. There are strong point-to-point changes in\n  the sharpness of the cold front on $10^\\circ$ scales. In some\n  sectors the width of the edge less than or equal to the electron\n  mean free path.\n\\item We identify a 1.9-kpc-radius shell around the nucleus. This\n  could be a shock generated by an AGN outburst $\\lesssim 3.5$~Myr\n  ago. A shock may also explain why the coldest X-ray gas is offset\n  from the nucleus, though this could also be due to sloshing motions\n  in the cluster. A significant fraction of energy in bubbles has already\n  passed into ICM in the form of a higher pressure region.\n\\item Around the western cavity and to the north is a weak shock seen\n  in temperature, density and pressure. To the western side the\n  implied Mach numbers are between 1.1 and 1.4, while they are higher\n  to the north (1.6 to 2.2).\n\\item There are $\\sim 9$ depressions in X-ray SB\n  around the core of the cluster, some of which may be associated with\n  radio emission. The shock and multiple bubbles suggests that the\n  nucleus is rapidly active on $5-10$~Myr timescales.\n\\item We confirm the existence of a quasi-periodic set of SB variations,\n  which we previously claimed could be sound waves. The spacing of the\n  peaks of $\\sim 5$~kpc would imply a period of 6~Myr, if they are\n  sound waves, which is similar to the ages of the shock and\n  bubble. Alternatively, they could be generated by\n    the sloshing, consisting of projected KHIs and their associated\n    turbulence, or amplified magnetic field regions.\n\\item Around the nucleus there is filamentary multiphase X-ray gas. As\n  found previously it is spatially correlated with material at lower\n  temperatures. Fitting data with powerlaw temperature distributions\n  gives better fits in the centre, implying a continuous temperature\n  distribution over a factor of $\\sim 4$ in temperature.\n\\end{enumerate}\n\n\\section*{Acknowledgements}\nWe thank the referee E.~Roediger for helpful suggestions which\nimproved this paper. ACF, HRR and SAW acknowledge support from the ERC\nAdvanced Grant FEEDBACK. Support for this work was provided by the\nNational Aeronautics and Space Administration through Chandra Award\nNumbers G01-12156X, GO2-13149X and GO4-15121X issued by the Chandra\nX-ray Observatory Center, which is operated by the Smithsonian\nAstrophysical Observatory for and on behalf of the National\nAeronautics Space Administration under contract NAS8-03060.  The\nscientific results reported in this article are based on observations\nmade by the Chandra X-ray Observatory and data obtained from the\nChandra Data Archive.  Based on observations made with the NASA/ESA\nHubble Space Telescope, and obtained from the Hubble Legacy Archive,\nwhich is a collaboration between the Space Telescope Science Institute\n(STScI/NASA), the Space Telescope European Coordinating Facility\n(ST-ECF/ESA) and the Canadian Astronomy Data Centre (CADC/NRC/CSA).The\nNational Radio Astronomy Observatory is a facility of the National\nScience Foundation operated under cooperative agreement by Associated\nUniversities, Inc.\n\n\\bibliographystyle{mnras}\n\\bibliography{refs}\n\n\\appendix\n\\section{Data analysis}\n\\label{sect:dataanalysis}\n\n\\subsection{Initial processing}\n\n\\begin{table}\n  \\centering\n  \\caption{\\emph{Chandra} observation identifiers (OBSIDs) analysed.\n    Listed are the observation date, the full exposure time and\n    the exposure after cleaning.}\n  \\begin{tabular}{llrr}\n    OBSID  & Date       & Full (ks) & Cleaned (ks) \\\\ \\hline\n    504    & 2000-05-22 & 31.8  & 26.0 \\\\\n    505    & 2000-06-08 & 10.0  & 10.0 \\\\\n    4190   & 2003-04-18 & 34.3  & 34.1 \\\\\n    4191   & 2003-04-18 & 34.0  & 33.8 \\\\\n    4954   & 2004-04-01 & 89.1  & 85.4 \\\\\n    4955   & 2004-04-02 & 44.7  & 43.1 \\\\\n    5310   & 2004-04-04 & 49.3  & 48.7 \\\\\n    16223  & 2014-05-26 & 179.0 & 176.2 \\\\\n    16224  & 2014-04-09 & 42.3  & 41.2 \\\\\n    16225  & 2014-04-26 & 30.1  & 29.7 \\\\\n    16534  & 2014-06-05 & 55.4  & 55.0 \\\\\n    16607  & 2014-04-12 & 45.7  & 44.6 \\\\\n    16608  & 2014-04-07 & 34.1  & 33.3 \\\\\n    16609  & 2014-05-04 & 82.3  & 81.7 \\\\\n    16610  & 2014-04-27 & 17.3  & 17.1 \\\\ \\hline\n    Total  &            & 779.3 & 760.0 \\\\\n  \\end{tabular}\n  \\label{tab:obsid}\n\\end{table}\n\nThe \\emph{Chandra} Advanced CCD Imaging Spectrometer (ACIS-S)\nobservations listed in Table \\ref{tab:obsid} are examined in this\npaper. Dataset 504 was first presented in \\cite{SandersCent02} and\nobservations 5310, 4954 and 4955 were first examined in\n\\cite{Fabian05}.\nThe datasets were reprocessed with \\textsc{ciao} version 4.6\n\\citep{Fruscione06}. Bad time periods were identified by examining the\nlight curve on the ACIS-S1 CCD with 200s bins, clipping bins which\ndeviated from the standard deviation by more than $2.5\\sigma$,\nassuming Poisson errors. We excluded data from ACIS CCDs other than 6,\n7 and 8 from our observations.  For each input dataset we created\nbackground datasets using standard blank-sky background files. For\neach CCD and observation, we took the appropriate background event\nfile and removed events which occurred in bad pixels of their\nrespective observation. The backgrounds were then reprojected to match\nthe observation coordinates and attitude and their exposure times were\nchanged to match the foreground count rate in the 9-12 keV band. In\norder to make total foreground and total background spectra, it was\nnecessary to make the ratio of each background to the total background\nexposure time be the same as the ratio of the respective foreground to\nthe total foreground exposure. To do this, we reduced the exposure\ntime keywords of background event files where this was not the case,\ndiscarding random X-ray events in order to preserve the count rate.\nBefore analysis, the foreground and background event files were\nreprojected to the coordinate system of the 16223 observation.\n\nUnless otherwise specified, spectra were fit between 0.5 and 7 keV in\n\\textsc{xspec} \\citep{ArnaudXspec} 12.8.2 using an \\textsc{apec} 2.0.2\nthermal model \\citep{SmithApec01}.  We assume the relative solar\nabundances of \\cite{AndersGrevesse89}. Note that the \\textsc{apec}\nmodel fitted here was not the standard one, but was recomputed to have\ntemperature steps of 0.01 dex, rather than 0.1 dex, as the steps were\notherwise visible in radial plots of the temperature.  Galactic\nabsorption was modelled using a \\textsc{phabs} model\n\\citep{BalucinskaChurchPhabs92}, with an equivalent hydrogen column of\n$1.2\\times10^{21} {\\hbox{${\\rm\\thinspace cm}^{-2}\\,$}}$, the average of the central region if the\ncolumn is allowed to be free (note that this is not a good choice for\nthe region of the edge-on disc galaxy which contains absorbing\nmaterial, leading to incorrect results there). All deprojected\nprofiles were calculated by fitting spectra deprojected using the\n\\textsc{dsdeproj} method \\citep{SandersPer07,Russell08}.\n\nExposure maps were created using \\textsc{mkexpmap}, assuming a 3.6~keV\nspectrum with $0.7{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$ metallicity and Galactic absorption. When\ncreating images of the larger regions, we masked the edges of the CCDs\nbefore adding to remove residuals.\n\n\\subsection{Large scale spectral mapping procedure}\n\\label{sect:specmapping}\nWe used the Contour Binning algorithm \\citep{SandersBin06} to select\nregions with a minimum signal to noise ratio threshold ($S/N$). The\nalgorithm chooses bins which follow contours of SB, usually on an\nadaptively smoothed image. Bins are grown pixel by pixel until the\nthreshold is reached. A geometric constraint factor, $C$, is also applied,\nwhere a pixel is not added if its radius from the bin centroid\nis more than $C$ times the radius of a circle with the\nsame area as the bin. This constraint prevents bins becoming too\nelongated.\n\nWe examined spectra with a $S/N=100$ (i.e. $10^4$ counts for regions\nwhere the background is not significant). The input smoothed image was\nan adaptively smoothed image, created using a kernel with a minimum\nsignal to noise ratio of 60 in the 0.5 to 7 keV band. A geometric\nconstraint of $C=2$ was used in the binning. We masked out point\nsources in the X-ray image (see Section \\ref{sect:images}).\n\nFor each of the bins, each of the CCDs and each of the datasets we\nextracted foreground and background spectra and created response and\nancillary response files. We added the foreground spectra from the\nobservations for each of the bins for each CCD. The background spectra\nwere similarly summed. Spectra were grouped\nto have at least 8 counts per spectral bin.  The response and ancillary responses\nwere spatially weighted by the number of counts in the 0.5 to 7 keV\nband. For each bin and each CCD we averaged the responses, weighting\nby the number of counts in the respective foreground spectrum. The\nspectra and responses for the different CCDs were not added to avoid\ncombining data with distinct responses.\n\nWhen fitting we minimised the C-stat fit statistic.  If a bin had\nspectra from more than one CCD, they were fit simultaneously with\nadditional free parameters to account for the difference in\nnormalisation due to geometry and detector differences.\n\nThere are regions, particularly close to the nucleus, where two\ntemperature components are necessary to fit the spectra. At the\ntemperatures seen in Centaurus, two-component modelling is usually\nrequired if a single component is too narrow to fit the Fe-L complex,\nindicating that there are comparable emitting components along the\nline of sight which differ significantly in temperature. We discuss\nthis in more detail in Section \\ref{sect:thermprof} and also examine\nmodels with more components. We therefore also fit the spectra with a\nmodel with two temperature components in each bin, assuming that they\nboth have the same metallicity (it is not possible to fit for the\nmetallicities of the components separately).\n\nIt is not clear what criteria should be used to decide between single-\nor two-component models. We investigated using the F-test and\nexamining the size of the error bars on the best-fitting\ntemperatures. These criteria appeared to either select two components\nfor a number of outer regions, many with unrealistic temperatures, or\ndid not select the two-component models in all appropriate locations\nin the centre, leading to a large scatter in the metallicity. The best\ncriterion appeared to be to select two components for those regions\nwhere there was a reduction in C-stat better than 5 per cent. The\nresulting combined single- and two-component metallicity map appears\nsimilar to the two-component map, except for the level of scatter in\nregions where only one component was required.\n\n\\subsection{Western cold front edge}\n\\label{sect:frontfit}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.9\\columnwidth]{fig26_small.pdf}\n  \\caption{Regions used for examining the western cold front, shown on\n    an unsharp-masked image. 27 sectors were used for SB\n    extraction. Two sets of annular sectors to the north-west and\n    south-west were used to examine the spectra. The cross marks the\n    radio nucleus of the cluster. The box marks the centre of the\n    annuli used, which is the same as used in\n    Fig.~\\ref{fig:cfront_remap}.}\n  \\label{fig:cfrontw_reg}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=\\columnwidth]{fig27_small.pdf}\n  \\caption{Deprojected thermodynamic profiles across the western cold\n    front in the north-west and south-west directions\n    (Fig.~\\ref{fig:cfrontw_reg}). Plotted are the temperature,\n    metallicity, electron density, electron pressure, electron entropy\n    and mean radiative cooling time. The vertical line marks the cold\n    front radius. The outer three bins are not shown due to edge\n    effects giving oscillating values.}\n  \\label{fig:cfront_spectra}\n\\end{figure}\n\nWe examined deprojected spectra across the western cold front in two\ndifferent sectors (Fig.~\\ref{fig:cfrontw_reg}), where the edge is\nclearest towards the north- and south-west, obtaining the profiles in\nFig.~\\ref{fig:cfront_spectra}. There are jumps in temperature and\ndensity (in opposite directions) by 20 per cent at the edge, leading\nto a continuous pressure distribution, confirming that the feature is\na cold front. The entropy reduces by 25--30 per cent in the inward\ndirection. Despite the clear correlations between the edges and\nmetallicity (Fig.~\\ref{fig:subav_prof}), we do not see the change in\nmetallicity at the edge in the deprojected profiles.\n\nTo examine the SB profiles in detail around the edge,\nexposure-corrected background-subtracted profiles were extracted\nin the 0.5 to 4 keV band, with 0.492-arcsec binning between\nradii of 1.7 and 4.5 arcmin (Fig.~\\ref{fig:cfrontw_reg}). This band is\nlargely sensitive to the density (varying the temperature from 2.5 to\n3 keV leads to a 10 per cent variation in count rate).\n\nWe took an emissivity model in which there are two powerlaws which\njump at a particular radius. The radius of the jump, the jump ratio\n(the emissivity ratio outside divided by that inside), the powerlaw\nindices and the overall model normalisation are free parameters.  We\nallowed for broadening of the edge by interpolating between the two\npowerlaw models using the integral of a Gaussian with a variable\n$\\sigma$. This emissivity profile was projected on the sky assuming\nspherical symmetry, integrating the emissivity profile between 1 and 7\narcmin radius in 0.246~arcsec (half pixel) steps. The model was then\nconvolved with the PSF in the radial direction at the edge for each\nsector. The PSF was calculated using \\textsc{saotrace} 2.0.4 and\n\\textsc{marx} 5.1.0 assuming a 3~keV spectrum with $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$\nmetallicity. The model was then resampled to have the same binning as\nthe data.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8\\columnwidth]{fig28_small.pdf}\n  \\caption{SB profiles in the 0.5 to 4 keV band across\n    the western cold front in 27 $10^\\circ$ sectors (depicted in\n    Fig.~\\ref{fig:cfrontw_reg}) from the north-east (top-left) through\n    west to the south-east (bottom-right) in 0.984 arcsec bins. The\n    0.492-arcsec-binned profiles were fitted within 40 kpc by a model\n    in which the emissivity is a powerlaw which jumps to a second\n    powerlaw at some radius, with the edge broadened by a\n    Gaussian. The solid area shows the $1\\sigma$ model uncertainties.}\n  \\label{fig:cfront_profiles}\n\\end{figure}\n\nWe applied this model to the data and examined the allowed range of\nparameter values using the \\textsc{emcee} \\citep{ForemanMackey12}\nMarkov Chain Monte Carlo (MCMC) \\textsc{emcee} code, which uses an\naffine-invariant sampler \\citep{Goodman10}.  We force the jump radius\nto lie between 1.9 and 3 arcmin, the powerlaw indices to lie between\n$-4$ and $0.5$, the jump ratio to lie between 0.01 and 2 (smaller\nvalues are larger jumps) and the Gaussian $\\sigma$ to be between 0.001\nand 1 arcmin (the log value of $\\sigma$ was varied in the MCMC). In\nthe MCMC analysis we used $\\chi^2$ likelihoods, 400 walkers, a burn in\nperiod of 1000 and a chain length of 1000.  The data were fit only\ninside a radius of 40 kpc, as in several sectors, particularly to the\nnorth, there is a SB break at this radius. We also investigated models\nwhich also included this break, fitting the data out to 57 kpc\nradius. The results from this more complex model are in reasonable\nagreement to those those presented here. In our analysis we found that\nthe outer powerlaw index was affected by the outer integration\nradius. Reducing the outer radius to 6 arcmin decreases the index by\n0.2--0.5.  The median models and the surrounding $1\\sigma$ percentiles\nare shown as shaded regions in Fig.\\ref{fig:cfront_profiles}. The\nparameters from the fits are plotted in\nFig.~\\ref{fig:cfront_fit_params}. We also did the analysis with twice\nthe number of sectors, finding consistent results. The radius results\nare plotted in Fig.~\\ref{fig:cfront_fit_params}, showing that the\nvariation in radius seen in the 27 bin results is real.\n\n\\subsection{Metallicity fluctuations}\n\\label{sect:zfluctdetails}\nSpectra from regions X and Y (Fig.~\\ref{fig:highZ}) were extracted and\nfit with single and two-component \\textsc{vapec} thermal models\n(connecting the metallicity between the two components). Some of the\nemission in the regions could come from projected cluster emission. To\nattempt to account for this we extracted a background spectrum from an\nadjacent part of the cluster outside the bright western region. We fit\nthe spectra using this background and secondly using a standard\nblank-sky background spectrum, between 0.5 and 8 keV. As the\ntwo-component model temperatures were not always well\nconstrained, we conducted a MCMC analysis to better explore the\nallowed parameter space using \\textsc{xspec\\_emcee}\n(\\url{https://github.com/jeremysanders/xspec\\_emcee}), applying 400\nwalkers, a burn-in period of 1000 and a chain length of 1000\niterations. The temperature values were assumed to lie between 0.15\nand 20~keV. We allowed the O, Ne, Mg, Si, S, Ar, Ca, Fe and Ni\nmetallicities to be free and fixed others to Solar values. The error\nbar shows the $1\\sigma$ percentiles from the chain, while the point\nshows the median.\n\n\\subsection{Central spectral maps}\n\\label{sect:speccentredetails}\nWe constructed detailed thermodynamic maps of the central region\n(Fig.~\\ref{fig:centre_spec_maps}) using $S/N=20$ spatial bins\n(i.e. 400 counts where the background is not significant). The mapping\nwas based on an adaptively smoothed image using a kernel with a\nminimum signal to noise ratio of 30 and applying a geometric\nconstraint of $C=3$, only examining a central $4.2 \\times 4.2$ arcmin\n($54\\times 54$ kpc) box. We extracted spectra from\nthe background observations using this box. These background spectra for\neach observation were also added, first artificially lowering the\nexposure of background spectra (discarding events and reducing\nexposure time correspondingly) so that the ratio of each background to\nthe total was the same as the respective foreground observation to\ntotal. We used a central response and ancillary response matrix for\nall regions examined. We note that the \\textsc{xspec} normalisation is\nproportional to the emission measure and defined in \\textsc{xspec} to\nbe $10^{-14} \\int n_\\mathrm{e} n_\\mathrm{H} \\mathrm{d}V / (4\\pi\nD_A^2[1+z]^2)$, where the cluster lies at a redshift $z$ and angular\ndiameter distance of $D_A$~cm, the electron and hydrogen densities are\n$n_\\mathrm{e}$ and $n_\\mathrm{H} {\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$, respectively and are\nintegrated over a volume $V{\\hbox{${\\rm\\thinspace cm}^3\\,$}}$.\n\nNote that the assumption of constant absorbing column density\nwhere there are dust lanes in the centre of NGC 4696 where this\nassumption is likely to be invalid. The metallicity was fixed to\n$1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$, an average value for the central region excluding where\nmulti-component models are preferred. Fixing the metallicity allows us\nto fit single temperature models to the data where multi-temperature\nmodels may be required (see Section \\ref{sect:thermprof}), obtaining\naverage projected temperatures and normalisations which are not biased\nby unrealistic best fitting metallicities.\n\n\\subsection{Inner cavity profiles}\n\\label{sect:innercavity}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig29_small.pdf}\n  \\caption{Regions examined to measure the ICM properties around the\n    western inner cavity (W) and for comparison to the north (N) and\n    south (S). The radio nucleus is marked with a `$\\times$'. The\n    centre of the sectors is marked by a `+'. The X-ray image is\n    unsharp-masked, subtracting 0.5 of the 0.5 to 7 keV image\n    smoothed by 7.9 arcsec from the image smoothed by 1 arcsec.}\n  \\label{fig:cavity_reg}\n\\end{figure}\n\nWe extracted deprojected spectra in annuli from a sector outwards from\nthe western inner cavity (labelled B in\nFig.~\\ref{fig:centre_spec_maps}). To better match the morphology of\nthe inner region, we chose a centre which is that of a circle which\ncircumscribes the outer edges of the two inner cavities (A and B). For\ncomparison we also examine sectors to the north and south, avoiding\nthe plume to the east.  Fig.~\\ref{fig:cavity_reg} shows the regions\nanalysed. The spectra were fitted with single component models, with\nthe metallicity fixed to $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$.\n\n\\subsection{Deprojected central spectra}\n\\label{append:deprojcentre}\nThe spectra were extracted from $180^\\circ$ east and west sectors or\ncomplete annuli, excluding point sources. The centre used\nwas the X-ray centroid of the central region, as in Appendix\n\\ref{sect:thermprofscentre}.  We fit both single- and two-component\n\\textsc{apec} models to the deprojected spectra (minimising the\n$\\chi^2$). To fully explore the parameter space we ran a MCMC analysis\non each deprojected spectrum. The two-component results are only shown\nin Fig.~\\ref{fig:deproj_EW} if both temperatures can be constrained to\n20 per cent. From the MCMC chains containing normalisation,\ntemperature and metallicity, the density, entropy, pressure and mean\nradiative cooling time were computed. To compute the two-component\nresults the assumption that the components are in pressure equilibrium\nwas made. In the plot, we also compare projected thermodynamic data\npoints from Fig. \\ref{fig:therm_r_X}.\n\n\\subsection{Elemental abundances}\n\\label{sect:abunddetails}\nThe metallicity profiles were obtained by fitting deprojected spectra,\nextracted from $180^\\circ$ sectors to the east and west.  To increase\nthe signal to noise, the radial bins used here are twice as wide in\nthe centre as in Fig.~\\ref{fig:deproj_EW}. To properly account for the\ncomplex temperature distribution we used two-component and powerlaw\n\\textsc{vapec} models. In our analysis Fe, Si, S, Mg, Ni, O, Ne, Ar\nand Ca abundances were allowed to vary. C, N and Al metallicities were\ntied to Fe. The same metallicities were assumed in all thermal\ncomponents in a radial bin. Input spectra were fit between 0.5 and 7\nkeV, minimising the $\\chi^2$ statistic. Metallicities were allowed to\nvary between 0 and $8{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$ and temperatures were allowed to vary\nbetween between 0.1 and 20 keV. The $1\\sigma$ error bars shown were\ncalculated by varying the parameter until the minimum $\\chi^2$\nincreased by 1.0. A MCMC analysis produced very similar results,\nthough we show the results from the simple analysis here.\n\n\\section{Central thermal structure}\n\\label{sect:thermprofscentre}\nWe constructed profiles of the temperature (Fig. \\ref{fig:T_radius})\nfrom maps with $S/N=40$ inside 10.5 kpc radius and $S/N=100$ at larger\nradii (the radius was measured from the X-ray centroid, marked in\nFig.~\\ref{fig:vcentre}, at 192.204 and Dec -41.3125, not from the\nradio nucleus).  One aspect which is different to the procedure used in\nSection \\ref{sect:maps}, is that in the\ntwo-component plot the temperatures of the two-component fit are only\nshown if they can be constrained to better than 20 per cent, otherwise\nthe single component result is shown.  The single component fits show\nthat the temperatures in the centre split into hotter (at high angles)\nand colder (at low angles) branches, where the colder branch is the\ncool central plume.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig30_small.pdf}\n  \\caption{Radial profile of the temperatures in bins with a signal to\n    noise ratio of 40 (inside the radius of $\\sim 20$~kpc marked by\n    the dotted line) or 100 (outside that radius). The points are\n    coloured according to their angle (angles are measured from the\n    west, with positive values northwards). The radius is measured\n    from the central radio source. The top panel shows a single\n    component fit to the spectra. The bottom panel shows the two\n    temperatures for a two-component fit, if the temperatures of the\n    two components can be constrained to better than 20 per cent,\n    otherwise the single-component fit results are shown. Error bars\n    are shown only for every 10th point.}\n  \\label{fig:T_radius}\n\\end{figure}\n\nAlthough we are fitting projected spectra from regions on the sky, we\ncan compute projected versions of the other thermodynamic properties\nusing geometric assumptions. Here we assume that the line of sight\ndepth of a region is the radius of the region.  This assumption, which\nwe test below, allows the normalisation to be converted to a projected\nelectron density, $n_\\mathrm{e,proj}$. The electron pressure is\ncomputed as $P_\\mathrm{e,proj} = n_\\mathrm{e,proj} \\mathrm{k}T$, where\n$\\mathrm{k}T$ is the temperature in keV. The entropy is\n$K_\\mathrm{e,proj} = n_\\mathrm{e,proj}^{-2/3} \\mathrm{k}T$. We also\ncalculate a mean radiative cooling time $t_\\mathrm{cool,proj}$ by\ndividing the enthalpy of a unit cube of gas in the cluster, $H$, by\nits emissivity calculated using an \\textsc{apec} model. The enthalpy\nis $H=(5/2)\\: \\mathrm{k}T n_\\mathrm{e,proj}\\: (1+1/X_\\mathrm{e/H})$,\nwhere $X_\\mathrm{e/H} \\sim 1.2$ is the ratio of the number of\nelectrons to Hydrogen nuclei in a fully ionised plasma.\n\nFor the two-component fits, we assume that both components come from\nthe same volume but they are in pressure equilibrium with each\nother. In this case, the electron density for component 1, in\n${\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$, is given by\n\n", "itemtype": "equation", "pos": 70172, "prevtext": "\n\n\\title[A very deep view of the Centaurus cluster]\n{A very deep \\emph{Chandra} view of metals, sloshing and feedback in\n  the Centaurus cluster of galaxies}\n\n\\author\n[J.~S. Sanders et al.]\n{\n  \\begin{minipage}[b]{\\linewidth}\n    \\begin{flushleft}\n      J.~S.~Sanders$^1$,\n      A.~C.~Fabian$^2$,\n      G.~B.~Taylor$^3$,\n      H.~R.~Russell$^2$,\n      K.~M.~Blundell$^4$,\n      R.~E.~A.~Canning$^{5,6}$,\n      J.~Hlavacek-Larrondo$^{7,5,6}$,\n      S.~A.~Walker$^2$\n      and C.~K.~Grimes$^3$\n    \\end{flushleft}\n  \\end{minipage}\n  \\\\\n  $^1$ Max-Planck-Institut fÃ¼r extraterrestrische Physik,\n  Giessenbachstrasse 1, 85748 Garching, Germany\\\\\n  $^2$ Institute of Astronomy, Madingley Road, Cambridge CB3 0FT\\\\\n  $^3$ Department of Physics and Astronomy, University of New Mexico, Albuquerque, NM 87131, USA\\\\\n  $^4$ University of Oxford, Astrophysics, Keble Road, Oxford OX1 3RH\\\\\n  $^5$ Kavli Institute for Particle Astrophysics and Cosmology, Stanford University, 452 Lomita Mall, Stanford, CA 94305, USA\\\\\n  $^6$ Department of Physics, Stanford University, 382 Via Pueblo Mall, Stanford, CA 94305, USA\\\\\n  $^7$ DÃ©partement de Physique, UniversitÃ© de MontrÃ©al, C.P. 6128, Succ. Centre-Ville, Montreal, Quebec H3C 3J7, Canada\\\\\n\\\n}\n\\maketitle\n\n\\begin{abstract}\n  We examine deep \\emph{Chandra} X-ray observations\n  of the Centaurus cluster of galaxies, Abell 3526. Applying a\n  gradient magnitude filter reveals a wealth of structure, from\n  filamentary soft emission on 100pc (0.5 arcsec) scales close to the\n  nucleus to features 10s of kpc in size at larger radii. The cluster\n  contains multiple high-metallicity regions with sharp\n  edges. Relative to an azimuthal average, the deviations of\n  metallicity and surface brightness are correlated, and the\n  temperature is inversely correlated, as expected if the larger scale\n  asymmetries in the cluster are dominated by sloshing motions. Around\n  the western cold front are a series of $\\sim 7$~kpc `notches',\n  suggestive of Kelvin-Helmholtz instabilities. The cold front width varies from\n  4 kpc down to close to the electron mean free path. Inside the front\n  are multiple metallicity blobs on scales of 5--10~kpc, which could\n  have been uplifted by AGN activity, also explaining the central\n  metallicity drop and flat inner metallicity profile. Close to the\n  nucleus are multiple shocks, including a 1.9-kpc-radius inner\n  shell-like structure and a weak 1.1--1.4 Mach number shock around\n  the central cavities. Within a 10~kpc radius are 9 depressions in\n  surface brightness, several of which appear to be associated with\n  radio emission. The shocks and cavities imply that the nucleus has\n  been repeatedly active on $5-10$~Myr timescales, indicating a tight\n  balance between heating and cooling. We confirm the presence of a\n  series of linear quasi-periodic structures. If they are sound waves,\n  the $\\sim 5$~kpc spacing implies a period of 6~Myr, similar to the\n  ages of the shocks and cavities. Alternatively, these structures may\n  be Kelvin-Helmholtz instabilities, their associated turbulence or\n  amplified magnetic field layers.\n\\end{abstract}\n\n\\begin{keywords}\n  galaxies: clusters: individual: Abell 3526 --- X-rays:\n  galaxies: clusters\n\\end{keywords}\n\n\\section{Introduction}\nThe Centaurus cluster, Abell 3526, is one of the X-ray brightest and\nnearest galaxy clusters in the sky, with a flux of $2.7 \\times\n10^{-10} {\\hbox{${\\rm\\thinspace erg}{\\rm\\thinspace cm}^{-2}{\\rm\\thinspace s}^{-1}\\,$}}$ in the 0.1 to 2.4 keV band, corresponding to a\nbolometric luminosity of $1.1\\times 10^{44} {\\hbox{${\\rm\\thinspace erg}{\\rm\\thinspace s}^{-1}\\,$}}$\n\\citep{Reiprich02}. The cluster has two sub-components, a main cluster\nCen~30, with a redshift of 0.0104 and a subcluster, Cen~45, 15 arcmin\n($\\sim 200$ kpc) to the east with a velocity $1500 {\\hbox{${\\rm\\thinspace km}{\\rm\\thinspace s}^{-1}\\,$}}$ higher\n\\citep{LuceyCurrieDickens86a}.\n\nThe first \\emph{Chandra} observations \\citep{SandersCent02} of the\ncluster revealed a plume-like soft X-ray structure extending from the\nnucleus and multiphase X-ray material on small spatial scales. Deeper\n\\emph{Chandra} observations \\citep{Fabian05} showed that the central\nregion contains multiple inner cavities, where the radio plasma\ndisplaces the X-ray emitting material \\citep{Taylor02}. The plume was\nresolved into wispy filaments of soft, cool, X-ray emitting gas. The data\nalso showed two semicircular edges in surface brightness (SB) to the\neast and west, where the temperature also changes, likely to be cold\nfronts \\citep{MarkevitchCFShock07},  discontinuities\n  where the temperature and density change but the gas is in pressure\n  equilibrium. Comparison with simulations indicates that the gas is\n  sloshing about in the potential well.\n\n\\emph{XMM-Newton} Reflection Grating Spectrometer (RGS) observations\n\\citep{SandersRGS08} of the cluster core revealed a spectrum with\nemission from Fe \\textsc{xvii} to \\textsc{xxiv}, but not\nO~\\textsc{vii}, showing there is X-ray emitting material down to\ntemperatures between 0.3 to 0.45 keV. Above 2 keV the spectra are\nconsistent with $40{\\hbox{${\\hbox{$\\rm\\thinspace M_{\\odot}$}}{\\rm\\thinspace yr}^{-1}\\,$}}$ of radiative cooling, but at 1 keV this\nreduces to $4{\\hbox{${\\hbox{$\\rm\\thinspace M_{\\odot}$}}{\\rm\\thinspace yr}^{-1}\\,$}}$ and less than $0.8 {\\hbox{${\\hbox{$\\rm\\thinspace M_{\\odot}$}}{\\rm\\thinspace yr}^{-1}\\,$}}$ appears to be\ncooling below 0.4 keV. From the outskirts to the centre, the\ntemperature of the intracluster medium (ICM) decreases by a factor of\n$\\sim 10$. The mean radiative cooling time of the ICM drops to $\\sim\n10^7$~yr in the centre.\n\nThe soft X-ray emission in the core of the cluster is correlated with\natomic and molecular material at much lower temperatures. The central\ngalaxy, NGC 4696, contains a dust lane \\citep{Shobbrook63} and has\nbright filamentary central H$\\alpha$ emission \\citep{Fabian82}, both\nof which have similar morphologies \\citep{Sparks89}. These components\nare themselves correlated with the cool X-ray emitting filaments\n\\citep{Crawford05}, and appear to be drawn up by buoyant bubbles\nrising in the ICM \\citep{Crawford05}. This model is supported by deep\nintegral-field spectroscopy \\citep{CanningIFU11}, who find no evidence\nfor fast shock excitation and whose spectra support the particle\nheating excitation model of \\cite{Ferland09}.\n\nUsing \\emph{Spitzer}, \\cite{Johnstone07} found evidence for\npure-rotational lines from molecular hydrogen, indicating an\nexcitation temperature of $300-400$~K. The flux in the 0-0 S(1)\nmolecular hydrogen line correlates well with the strength of the\noptical lines. Molecular material cooler than $400$~K dominates the\nmass of the outer filaments. With \\emph{Herschel}, \\cite{Mittal11}\nfound two of the strongest cooling lines in the\ninterstellar medium, [C\\,\\textsc{ii}] and [O\\,\\textsc{i}]. The\n[C\\,\\textsc{ii}] emission has a similar morphology and velocity\nstructure compared to the H$\\alpha$ emission, suggesting that the soft\nX-rays, optical lines and far-infrared have the same energy source. In\naddition \\emph{Herschel} found $1.6 \\times 10^{6} {\\hbox{$\\rm\\thinspace M_{\\odot}$}}$ of dust at\n19~K, although the FIR luminosity suggests a low $0.13{\\hbox{${\\hbox{$\\rm\\thinspace M_{\\odot}$}}{\\rm\\thinspace yr}^{-1}\\,$}}$ star\nformation rate.\n\n\\cite{Canning10611} detected optical coronal emission from $10^6$ K\ngas in the core of the cluster. The lowest temperature probe\n[Fe\\,\\textsc{x}] $\\lambda 6374$ is twice as bright as\nexpected. \\cite{Chatzikos15} suggest that the coronal spectrum is not\nindicative of cooling material, but instead comes from a conductive or\nmixing interface between the X-ray plume and optical filaments.\n\nThe \\emph{Chandra} observations confirmed that the cluster has a high\n($1.5-2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$) metallicity flat core with a sharp edge, previously\nseen using \\emph{ROSAT} and \\emph{ASCA} data \\citep{AllenFabian94,\n  Fukazawa94, Ikebe99,Allen01}. The boxy metallicity profile requires\na large effective diffusion coefficient which drops very rapidly with\nradius \\citep{Graham06}. The metallicity ratios in the core of the\ncluster are roughly consistent with solar values\n\\citep{SandersEnrich06}, indicating enrichment by both Type Ia and II\nsupernovae, although O and Mg are $\\sim 40$ per cent less abundant\n\\citep{Sakuma11}. The metallicity profile and ratios show that the\ncentre of the cluster appears to have not suffered major disruption\nover the past 8 Gyr or longer.\n\nIn the centre of the cluster there is a drop in the observed\nmetallicity \\citep{SandersCent02}, which appears not to be caused by\nresonance scattering \\citep{SandersReson06} or inadequate spectral\nmodelling \\citep{Fabian05}. The decrement is consistent with the\ndeposition of metals onto grains which are incorporated into dusty\nfilaments \\citep{Panagoulia15}.\n\nThe Cen\\,45 subcluster has a temperature excess surrounding it,\ninterpreted as having been heated by its interaction with Cen\\,30\n\\citep{Churazov99}. This excess was confirmed using \\emph{XMM} and can\nbe explained by a simple shock heating model \\citep{WalkerCen13}. A\npressure jump is also seen in the direction of the merger and the\nmerging subcluster appears to have retained its metals. No bulk\nvelocities greater than $1400 {\\hbox{${\\rm\\thinspace km}{\\rm\\thinspace s}^{-1}\\,$}}$ in the ICM were detected in the\ncluster \\citep{Ota07}.\n\nThe extended component of the central radio source in the cluster,\nPKS\\,1246--410, appears to be interacting with and displacing the ICM\n\\citep{Taylor02,RudnickBlundell03}, most obviously seen by the\npresence of two central cavities in the ICM. The most extended radio\nemission appears to go beyond to regions of low thermal pressure,\nindicating there may be further X-ray cavities there\n\\citep{Crawford05}. The optical nucleus is\n  double \\citep{Laine03}. The radio nucleus is associated with compact\n  low-luminosity X-ray emission, but is offset from the\n  X-ray-brightest region of the cluster \\citep{Taylor06}. If the\nnucleus were accreting at the Bondi rate, it would overproduce by 3.5\norders of magnitude its observed X-ray radiative luminosity.\nVery long baseline interferometry (VLBI) observations show\na broad one-sided jet \\citep{Taylor06}. The cluster shows Faraday\nrotation measures, indicating magnetic fields of 25 $\\mu$G on 1~kpc scales.\nThe thermal pressure appears dominant over the magnetic\npressure. The line-emitting gas, soft X-ray material, regions with an\nexcess of rotation-measure and depolarised regions appear to be\nspatially correlated \\citep{RudnickBlundell03,Taylor07}.\n\n\\cite{SandersSound08} found X-ray SB ripples in\nseveral directions within the inner 40 kpc, postulating that they are\nsound waves in the ICM generated by the activity of the central\nnucleus, similar to those found in Perseus \\citep{FabianPer06} and\nAbell 2052 \\citep{Blanton11}. Such sound waves could transport energy\nfrom the nucleus to provide the distributed heating required to\nprevent the excepted high cooling rates.\n\n\n\nIn this paper we present new results from 760 ks of\n  \\emph{Chandra} observations, including 480 ks of new data. We assume\n  the galaxy cluster lies at a redshift of 0.0104\n  \\citep{LuceyCurrieDickens86a}. Using $H_0=70 {\\hbox{${\\hbox{${\\rm\\thinspace km}{\\rm\\thinspace s}^{-1}\\,$}}{\\rm\\thinspace Mpc}^{-1}$}}$, 1 arcsec on\n  the sky corresponds to 0.213 kpc. Images are aligned with north to\n  the top and east to the left. For details of the data reduction, see\n  Appendix \\ref{sect:dataanalysis}. We discuss the larger scale\n  structure in Section \\ref{sect:larger}, including in detail sloshing\n  gas in the potential well (\\S\\ref{sect:sloshing}), the western cold\n  front (\\S\\ref{sect:cfront}), the linear structures inside the cold\n  front (\\S\\ref{sect:sbstructure}) and the high metallicity blobs\n  (\\S\\ref{sect:Zstructure}). In Section \\ref{sect:central} we examine\n  the inner region around the nucleus in detail, including the inner\n  shock (\\S\\ref{sect:innershock}), the interaction of the radio source\n  and X-ray plasma (\\S\\ref{sect:radio_icm}), the cavities\n  (\\S\\ref{sect:cavities}), the shock surrounding the cavities\n  (\\S\\ref{sect:centcavity}), the association between soft X-rays and\n  dust (\\S\\ref{sect:optical}), the origin of the plume\n  (\\S\\ref{sect:plumeorigin}) and the rotation measures and magnetic\n  fields (\\S\\ref{sect:rm}). We discuss the inner multiphase structure\n  in Section \\ref{sect:thermprof} (also Appendix\n  \\ref{sect:thermprofscentre}), the central abundance drop in Section\n  \\ref{sect:elemabund} and conclude in Section\n  \\ref{sect:conclusions}.\n\n\n\\section{Larger scale structure}\n\\label{sect:larger}\n\\subsection{X-ray images}\n\\label{sect:images}\n\n\\begin{figure*}\n  \\includegraphics[width=0.83\\textwidth]{fig01_1_small.pdf}\n  \\includegraphics[width=0.83\\textwidth]{fig01_2_small.pdf}\n  \\caption{(Top panel) X-ray image of the central $130 \\times 100$~kpc\n    of the cluster. The 0.5 to 7 keV image is background-subtracted\n    and exposure-corrected.  To the south-east can\n      be seen the X-ray shadow of a disc galaxy. The colour bar shows\n    the SB, scaled to show the central number of counts per 0.492\n    arcsec pixel. (Bottom panel) The same region after applying GGM\n    gradient filters with different scales and summing with radial\n    scaling. Note that the scale is not consistent\n      across the image and does not accurately reflect the magnitude\n      of jumps. It emphasises the regions with largest SB gradients\n      after point source removal.}\n  \\label{fig:centre}\n\\end{figure*}\n\n\\begin{figure*}\n  \\includegraphics[width=\\textwidth]{fig02_small.pdf}\n  \\caption{GGM gradient-filtered images using scales\n    from 1 to 32 pixels (1 pixel is 0.492 arcsec). The white bar has a\n    length of 20 kpc ($\\sim 94$ arcsec). Labelled features are\n    referred to in the text.}\n  \\label{fig:filtscale}\n\\end{figure*}\n\nFig.~\\ref{fig:centre} (top panel) is an X-ray image of the central\n$130\\times 100$~kpc of the cluster. There are $8.1 \\times 10^6$ counts\nin the dataset inside a 5 arcmin radius.  Prominent in the image is the\ncentral feedback region associated with NGC 4696, which we examine in\ndepth in Section \\ref{sect:central}. There are SB edges, previously\nidentified as cold fronts \\citep{SandersCent02,Fabian05}, 1.5 arcmin\nto the east and 3.3 arcmin to the west. We examine the western cold\nfront in detail in Section \\ref{sect:cfront}. The depression 3.3\narcmin to the south-east is due to an edge-on disc galaxy,\nESO\\,322-93, in the main Cen~30 cluster which absorbs some soft\ncluster X-ray emission \\citep{Fabian05}.\n\nTo better examine the features in the image we applied a gradient\nfilter to highlight sharp and flat regions.\n  Gradient filtering has previously been used to examine cluster\n  simulations \\citep{Roediger13}. The Gaussian gradient magnitude\n(GGM) filter is similar to the Sobel filter, calculating the magnitude\nof the image gradient assuming Gaussian derivatives. By varying the\nGaussian width, $\\sigma$, the filter is sensitive to gradients on\ndifferent scales. GGM filtering has the advantage of being a simple\nconvolution applied to the data and is unlikely to introduce\nartifacts.\n\nWe applied the GGM filter from \\textsc{scipy}\n(\\url{http://www.scipy.org/}) to the exposure-corrected\nbackground-subtracted image using $\\sigma=1$, 2, 4, 8, 16 and 32 detector\npixels, yielding the images shown in Fig.~\\ref{fig:filtscale}. Regions\nwith large gradients, such as edges, are lighter, while flatter SB\nareas are darker. Point sources were first removed from the input\nimage to avoid their contamination of larger structures. They\nwere initially identified using \\textsc{wavdetect} but manually edited\nto exclude false detections when it became confused by the bright central\nX-ray structures. The values of pixels in the removed source regions were\nreplaced by random selections of those in the 1-pixel-wide areas\nimmediately surrounding each point source.\n\nThe ability of the filter to detect features is a\n  function of the SB in the region of interest and the magnitude of\n  the gradient. In the cluster outskirts where the number of counts\n  per pixel is low the small length scale filters cannot detect\n  gradients unless they are very large. This is the case with normal\n  X-ray images, where the detectability of structures depends on their size,\n  SB and contrast with their surroundings.\n  The noise in the images, however, is seen as\n  azimuthal structures. As the largest SB gradient in a cluster is\n  radial, Poisson fluctuations in the X-ray image will amplify or\n  weaken this radial signal. Therefore noise in the gradient image lies\n  perpendicular to the gradient in the original image.\n\nTo show the gradients on different scales in a single image\n(Fig.~\\ref{fig:centre} bottom panel), we added the GGM-filtered images\nwith radial scaling factors. These radial scalings were applied to\nincrease the contribution of small scales to the centre (measured from\nthe central radio nucleus) and reduce the contribution of large scales\nthere. We experimented with scaling factors, finding linear summations\nof the different filtered images do not introduce features which are\nnot present in the individual filtered images. We note that the image\ndoes not accurately show the relative magnitude of features but\ninstead highlights those features which are there. The image shows a\nnumber of edges and flat structures around the nucleus and inside the\nwestern cold front (see Section \\ref{sect:sbstructure}). Further\ndiscussion of gradient filtering and its application to other X-ray\ncluster datasets will be made in a forthcoming paper.\n\n\\subsection{Temperature and metallicity maps}\n\\label{sect:maps}\n\\begin{figure*}\n  \\includegraphics[width=0.77\\textwidth]{fig03_1_small.pdf}\n  \\includegraphics[width=0.77\\textwidth]{fig03_2_small.pdf}\n  \\caption{Temperature and metallicity maps of the cluster using\n    regions with $S/N=100$. The temperature map shows the\n    single-component temperature. The metallicity map shows the results from\n    single- or two-component fits, depending on which is\n    preferred. Grey regions indicate excluded point sources.\n    Uncertainties in the temperatures vary from 0.6 per cent in the\n    centre to 2 per cent to the east of the western edge and 3.5 per\n    cent at large radius. Metallicity uncertainties are typically from\n    $0.05-0.10{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$, excluding the very centre.}\n  \\label{fig:wide_T_Z}\n\\end{figure*}\n\nFig.~\\ref{fig:wide_T_Z} shows maps of the temperature and metallicity,\nobtained by spectral fitting (Appendix \\ref{sect:specmapping}).  The\ncool central plume and cooler regions inside the western and eastern\nSB edges can be clearly seen. From the core is another plume-like\ncooler structure extending north-westwards towards the western\nedge. Outside the edges the temperature is relatively flat, although\nthere may be a cooler region towards the north-east.\n\nThe metallicity map contains a great deal of structure. There is a\npreviously reported high metallicity region inside the western cold front edge,\nwhere the ICM is cooler \\citep{SandersCent02,Fabian05}. The abundance\ndistribution, however, is not steadily rising, but is rather flat with\nfluctuations. There are strong variations in metallicity (see Section\n\\ref{sect:Zstructure}) with a characteristic length scale of around 20\narcsec ($\\sim 5{\\rm\\thinspace kpc}$; see Section \\ref{sect:zfluctdetails}). On the\neastern side of the cluster, outside the eastern SB edge\n(Fig.~\\ref{fig:centre}), is another region of higher metallicity gas\nwith a tail-like appearance.\n\n\\subsection{Sloshing}\n\\label{sect:sloshing}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.87\\columnwidth]{fig04_1_small.pdf}\n  \\includegraphics[width=0.87\\columnwidth]{fig04_2_small.pdf}\n  \\includegraphics[width=0.87\\columnwidth]{fig04_3_small.pdf}\n  \\caption{Fractional difference from the average at\n    each radius for X-ray 0.5 to 7 keV SB, temperature and\n    metallicity. The X-ray image was smoothed by a 2 arcsec\n    Gaussian. The temperature and metallicity maps used the same data\n    as presented in Fig.~\\ref{fig:wide_T_Z}. Arrows mark edges\n    (discussed in text). Also shown is the direction of the merging\n    Cen\\,45 subcluster.}\n  \\label{fig:subav}\n\\end{figure}\n\nWe compare the SB deviations in the cluster to the metallicity and\ntemperature in Fig.~\\ref{fig:subav}. There is a low-density,\nhigh-temperature material on the opposite side of the core to the\nhigh-density, low-temperature material behind the western cold\nfront. This material appears to sweep from the south through the east\nand towards the north.  The plot shows striking correlations between\nSB, temperature and density deviations. The western cold front is\nlabelled E2. There are also two edges in metallicity and SB in the\nopposite direction towards the eastern side of the cluster (marked E1\nand E3), closer to the Cen 45 subcluster. In addition there is a\nfurther edge outside the western cold front, going from the westernmost point of the cold front and\nextending towards the north, with more metal rich gas inside\nit (E4). Further to the north is the high metallicity region already\nnoted by \\cite{WalkerCen13}. There are hints that there is a SB edge\nto the north of this feature, with lower metallicity outside it\n(E5). The SB enhancement towards the north-west of Fig.~\\ref{fig:subav} may\nbe the structure found by \\cite{Churazov99} (see their figure 3),\nsuggested to be stripped gas from NGC\\,4696B.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=\\columnwidth]{fig05_small.pdf}\n  \\caption{SB, temperature and metallicity fractional\n    residual profiles in an east-west direction (west is positive)\n    across the centre of the cluster with three northerly offsets\n    ($-10.5$, $0$ and $10.5$~kpc), computed from\n    Fig.~\\ref{fig:subav}. The width of each strip is $8.4$~kpc. The\n    horizontal axis has a square-root scaling. Note that the\n    temperature profiles have been scaled by a factor of 2.}\n  \\label{fig:subav_prof}\n\\end{figure}\n\nIn Fig.~\\ref{fig:subav_prof} are shown three rectangular profiles\nacross the cluster in an east-west direction. One passes through the\nnucleus, while one is north of it and the other south. In some regions\nthere is excellent correlation (between SB and metallicity) or\nanti-correlation (of SB or metallicity with temperature) between the\nvariables, but this is not always the case. For example, in the\ncentral region, the bright, cool, plume is relatively low in\nmetallicity. There is also a fairly strong east-west SB gradient,\nwhich makes the fluctuations difficult to see.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig06_small.pdf}\n  \\caption{Radial metallicity profile of the map in\n    Fig.~\\ref{fig:wide_T_Z} split into $90^\\circ$ sectors. The number\n    of components used in the fits is indicated by open or closed\n    symbols. Horizontal error bars show the radial range of each bin.}\n  \\label{fig:Z_prof}\n\\end{figure}\n\nFig.~\\ref{fig:Z_prof} shows radial profiles in metallicity in four\nquadrants to the north, south, east and west. Despite small-scale\nvariation, the overall metallicity profile inside the western edge\n(roughly 40 kpc radius) is remarkably flat. In addition there remains\na central drop in metallicity, which we discuss further in Section\n\\ref{sect:elemabund}. In the eastern sector, there is a much smaller\nregion of flat metallicity towards the cluster core. However, the\ntail-like structure has a flat metallicity profile which drops outward\nof 60--70 kpc.\n\nThe spatial correlation between SB and metallicity\n  enhancement, and anti-correlation with temperature is a typical\n  signature of sloshing and has been found in simulations as well as\n  other observations (e.g. Virgo, \\citealt{Roediger11}; A\\,496,\n  \\citealt{Roediger12}; Perseus, \\citealt{Simionescu12}; A\\,2029\n  \\citealt{PaternoMahler13}).  Similarly, sloshing in the cluster can\n  distort and induce asymmetries in the distribution of metals about\n  the central galaxy.\n\nThe gravitational perturbation by the merger of the Cen\\,45 subcluster\nmay have started these sloshing motions. This is suggested by the\nalignment of the larger scale SB deviations along the axis of the\nmerger (Fig.~\\ref{fig:subav}).  After the\n  interaction by the perturbing system, cold fronts move outwards with\n  time \\citep[e.g.][]{Ascasibar06}.  The A\\,496 system,\n  which has a similar temperature to Centaurus, was simulated by\n  \\cite{Roediger12}, who found that the radial evolution of the cold\n  front mainly depends on the cluster potential.  The radii of the\n  eastern and western inner Centaurus cold fronts (19 and 42 kpc,\n  respectively) are similar to the fronts in their `distant' run after\n  1 Gyr (see their fig. 7).  The circular symmetry of the features\n  suggest that the sloshing gas motions are close to being\n  perpendicular to the line of sight, as pointed out by\n  \\cite{Ascasibar06}. In this case, the perturbing system is not\n  moving in the plane of the sky. It is not possible to tell whether\n  Cen 45 is the perturber based on its position, velocity and the time\n  since the interaction. Indeed, Cen 45 may not be on its first pass\n  through the system and could be gravitationally bound.\n\n\\subsection{Western cold front}\n\\label{sect:cfront}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig07_1_small.pdf}\n  \\includegraphics[width=\\columnwidth]{fig07_2_small.pdf}\n  \\caption{(Top panel) Unsharp-masked 0.5 to 7 keV image. This is the\n    fractional difference between Gaussian-smoothed images with\n    $\\sigma=2.0$ and $15.7$ arcsec, after masking out point\n    sources. `$\\times$' marks the central nucleus (see Section\n    \\ref{sect:central}). (Bottom panel) GGM-filtered image of the same\n    region, using $\\sigma=7.9$ arcsec, taken from\n    Fig.~\\ref{fig:filtscale}. The labelled features are described in\n    Section \\ref{sect:sbstructure}.}\n  \\label{fig:unsharp}\n\\end{figure}\n\nThe western cold front in Centaurus is one of the clearest and nearest\nexamples known in a cluster, spanning nearly $180^\\circ$. The pressure\nacross the edge is continuous, confirming it is a cold front (Appendix\n\\ref{sect:frontfit}).  Fig.~\\ref{fig:unsharp} (top panel) shows an\nunsharp-masked image of the centre and cold front region, highlighting\nthe SB fluctuations around the front and within the central\nregion. The edge is not perfectly smooth; the south-western side\nappears to be where it is sharpest and directly west it appears\nbroader.  To the north and south of the cold front there is a rapid\ntransition from a sharp edge to a weak or non-existent edge. However,\nsome circular structure may continue on in the north-east and\nsouth-east directions. There appear to be a number of `notches' into\nthe edge on length scales of $\\sim 7{\\rm\\thinspace kpc}$. The notches along the edge\ncan also be seen in a gradient filtered X-ray image\n(Fig.~\\ref{fig:unsharp} bottom panel). We discuss the SB features\ninside the front in Section \\ref{sect:sbstructure}.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig08_small.pdf}\n  \\caption{Unsharp-masked image of the cluster remapped to have radius\n    and angle axes, with a centre chosen to make the western cold\n    front lie at constant radius.  Horizontally it spans $360^\\circ$\n    from east (left), through north, then west (centre), then back to\n    east (right). Radius runs vertically from 2 (bottom) to 68 kpc\n    (top). The 0.5 to 7 keV input image was rebinned into 0.1~kpc\n    by $0.25^\\circ$ pixels. Unsharp masking was then applied,\n    using the fractional difference between maps smoothed by 4 and 32\n    pixels.}\n  \\label{fig:cfront_remap}\n\\end{figure}\n\nThe deviations from a circular cold front can be clearly seen if the\nimage of the cluster is remapped to radial and azimuthal coordinates\n(Fig.~\\ref{fig:cfront_remap}). The notches appear as wave-like\nirregularities on the straight edge. The edge is best represented by a\ncircle with a centre at RA $192.18325$ and Dec $-41.31048$ (marked by\nthe sectors in Fig.~\\ref{fig:unsharp}), 11~kpc to the west of the\nnucleus.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig09_small.pdf}\n  \\caption{Fit parameters for the profiles of the 27 sectors around\n    the western cold front from the north-east ($-130^\\circ$) to\n    south-east ($130^\\circ$). These are the median and $1\\sigma$\n    percentiles obtained from the analysis (Appendix\n    \\ref{sect:frontfit}). Shown are the radius of the jump, the ratio\n    in emissivity outside to inside (the jump ratio), its width\n    ($\\sigma$) and the powerlaw indices of the emissivity inside and\n    outside. For the radius we also show the results\n    using twice the number of sectors.}\n  \\label{fig:cfront_fit_params}\n\\end{figure}\n\nTo quantify the variation and width of the edge around the front we\nfit models to SB profiles extracted in 27 independent $10^\\circ$ sectors spanning\n$270^\\circ$, covering the $180^\\circ$ towards the west where the front\nis visible and $45^\\circ$ beyond this in either direction. This\nanalysis is similar to that presented in \\cite{Werner15}. We fit a\nbroken powerlaw with a broadened edge model to the profiles (see\nAppendix \\ref{sect:frontfit}).  Fig.~\\ref{fig:cfront_fit_params} shows\nfor each sector the radius of the front, the jump magnitude, the width\nand the powerlaw indices to either side of the edge.\n\nBetween the north and south, where the edge is well defined, the jump\nradius is fairly constant at 31~kpc, with sector-to-sector variations\nof about 1~kpc, likely due to the notches around the edge.\nImmediately west, the front is at its broadest at 4~kpc, but it\nis much narrower to the north-west and south-west. In some\nlocations the edge appears narrower than 1~kpc. Where the front is\nnarrowest towards the south-west, for example in the sectors between\n$60-80^\\circ$, the $1\\sigma$ upper limits on the edge width are $\\sim\n0.3$~kpc (accounting for the PSF at the edge in\n  these sectors).  If there are no magnetic fields, in the north-west\ndirection the density and temperature imply values for the collisional electron\nmean free path of $0.18$ and $0.36$~kpc (0.8 and 1.7 arcsec), interior\nand exterior to the front, respectively. In the south-west these\nincrease to $0.30$ and $0.48$~kpc (1.4 and 2.3 arcsec),\nrespectively. Where the front is narrowest to the south-east, our\nupper limits are similar to the electron mean free path.\n\nThe emissivity of the ICM decreases outwards over most of the front to\naround 60 per cent of the interior value, implying that the density\ndecreases by around 20 per cent, which is in agreement with spectral\nmeasurements (Appendix \\ref{sect:frontfit}). However, immediately to\nthe west the fits prefer an 80 per cent SB decrease. In the same\nregion the powerlaw index of the model outside the jump is flatter and\nthe edge is wider.  It is clear from the unsharp-masked and filtered\nimages in Fig.~\\ref{fig:unsharp} that the edge is much less distinct\nimmediately to the west at the most extreme part of the front. There\nmay also be a SB edge which extends from the westernmost point of the\nfront to the north-west. This can be seen where SB edge E4 apparently\nconnects to the cold front E2 (Fig.~\\ref{fig:subav}). This feature can\nalso be seen as the enhancement in the remapped cluster image\n(Fig.~\\ref{fig:cfront_remap}) from the centre of the front extending\nupwards (to larger radius) and leftwards (north-west).\n\nOutside the $180^\\circ$ sector where the edge is obvious, the SB fits\nimply that there is some sort of jump or break in SB in the radial\nrange examined. The allowed jump radii vary considerably, however, and\nare unlikely to correspond to the same physical features in the\nprofiles.\n\nThe notches along the edge of the western cold front\n(Figs. \\ref{fig:unsharp} and \\ref{fig:cfront_remap}) are consistent\nwith Kelvin-Helmholtz instabilities (KHIs) of length scales of $\\sim\n7$~kpc along the edge. KHIs in clusters were first\n  seen in simulations \\citep{Roediger11,ZuHone11}. A kink, which may\nbe a large KHI, has been observed in Abell~496\n\\citep{Roediger12}. Similar notches of length of a few kpc have also\nbeen seen in the cold front in the Virgo cluster\n\\citep{Werner15}. These notches likely make the radius of the cold\nfront appear to vary by $\\sim 1$ kpc\n(Fig.~\\ref{fig:cfront_fit_params}) between the north and south.\nComparison with simulations of cold fronts including varying levels of\nviscosity or magnetic fields suggests levels of viscosity of around 10\nper cent of the Spitzer value are consistent with the data\n\\citep{Roediger13,ZuHone15}. Larger amounts of viscosity smooth out\nall instabilities, while instabilities grow very large with no\nviscosity or magnetic fields.\n\n\\subsection{Linear structures inside the front}\n\\label{sect:sbstructure}\nUsing shorter observations we previously detected ripple-like SB\nfluctuations using Fourier high pass filtering\n\\citep{SandersSound08}. These quasi-periodic fluctuations were also\nseen in SB profiles in three sectors (along the north-east, south-west\nand north-west directions) We interpreted these features as sound\nwaves generated by AGN activity.\n\nExamining the unsharp-masked image (Fig.~\\ref{fig:unsharp} top panel)\nthere are a number of SB fluctuations with a similar\n$\\sim 5-10 {\\rm\\thinspace kpc}$ length scale to the previously found\nfluctuations. They are also similar in size to the notches along the\ncold front (Section \\ref{sect:cfront}). However, they do not appear to\nhave a periodic structure.  Creating SB profiles using\nthe same sectors as in \\cite{SandersSound08}, obtains consistent\nSB profiles and residuals to $\\beta$ model fits,\nshowing that the fluctuations are robust.\n\nUsing a GGM filter on the data instead of unsharp-masking\n(Fig.~\\ref{fig:unsharp} bottom panel) finds a number of quasi-linear\nfeatures (labelled L1--L5). These straight edges have corresponding\nfeatures in the unsharp-masked image, but the GGM filter appears to be\na much more powerful tool for detecting and connecting these edges in\nSB. All of the labelled structures in Fig.~\\ref{fig:unsharp} (bottom\npanel) can be seen as SB edges in the raw data when examined\nclosely. The structures are also apparent in the multiple-scale\nGGM-filtered image (Fig.~\\ref{fig:centre} bottom panel).\n\nWe tested that these features are significant by similarly filtering a\nPoisson realisation of a heavily-smoothed cluster image, finding that\nthe noise was at lower levels. In addition, all the labelled features\ncan be seen by closely inspecting the raw images. L1--L4 are\napproximately parallel to each other. L1 and L4 (and perhaps L2 and\nL3) also appear to bend with a sharp angle close to the edge of the\ncold front. The image also highlights some flat SB\nregions (F1--F6). The bay (discussed in Section \\ref{sect:central})\nappears as two flat regions surrounded by steep gradients. There are\nalso flat regions closer to the edge of the front (F1 and F4--F6). To\nthe north is an extension of the cluster emission extends\nnorthwards (X1).\n\nSeveral of the identified linear features L1-L6 appear to have an\napproximately regular separation of $\\sim 5$~kpc. L1--L3 seem to have\na sharp bend near the cold front, suggestive of waves reflecting off a\nboundary. The temperature on the outside of the cold front is a factor\nof $\\sim 1.4$ greater than inside. Therefore the critical angle for\ntotal internal reflection at the cold front is $58^\\circ$. If the\nfeatures are sound waves, then they lie above this critical angle, and\nso it is possible that the bends at the cold-front edge are caused by\ntotal internal reflection of sound waves. Alternatively, variations in\nsound speed could cause the fronts to bend if the wave passes through\na sharp temperature gradient at an angle.\n\nThe 5~kpc spacing corresponds to 6~Myr timescale at the sound speed at\n2.5~keV temperature. This timescale is similar to the age of the inner\nshock and cavities. It is therefore plausible that the structures\ncould be generated by AGN activity. The quasi-periodic nature of the\nfeatures argues against the features being turbulence generated by the\nAGN. We analyse these fluctuations quantitatively in \\cite{Walker15}\nand examine whether they could contribute significantly to AGN\nfeedback heating.\n\nAlternatively, the structures may be unrelated to\n  the AGN but instead caused by sloshing. The sloshing simulations of\n  \\cite{Roediger13}, in particular their fig.~8, shows features\n  similar in appearance. KHIs on the curved 3D surface of the cold\n  front can be seen as projected features inside the cold front\n  edge. The interaction of KHIs at the cold front, combined with the\n  slow outwards motion of the cold front can also give rise to turbulence\n  inside or underneath the cold front, which also adds fine\n  structure. Linear features were also found by \\cite{Werner15} inside\n  the M\\,87 cold front. They suggested that these could instead be\n  generated by the amplification of magnetic field layers by sloshing,\n  as found in the simulations of \\cite{ZuHone11} and \\cite{ZuHone15}.\n\n\\subsection{Metallicity blobs}\n\\label{sect:Zstructure}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig10_small.pdf}\n  \\caption{Comparison of the metallicity in adjacent\n    high (X) and low (Y) metallicity regions, fitting (a) 1 and (b) 2\n    component(s), blank-sky background, and (c) 1 and (d) 2\n    component(s), cluster background (see Appendix\n    \\ref{sect:zfluctdetails}). The inset metallicity map was created\n    from $S/N=40$ regions.}\n  \\label{fig:highZ}\n\\end{figure}\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=0.8\\textwidth]{fig11_1.jpg} \\vspace{5mm} \\\\\n  \\includegraphics[width=0.6\\textwidth]{fig11_2_small.pdf}\n  \\caption{(Top panel) RGB image of the cluster centre. The bands\n    0.5--1, 1--1.5 and 1.5--7 keV are shown as red, green and blue,\n    respectively. Images were extracted using bins of 0.5 detector\n    pixels (0.246 arcsec) and smoothed by a Gaussian of width 0.492\n    arcsec. The image measures 2.8 by 2.3 arcmin (35 by 29\n    kpc). (Bottom panel) Partially unsharp-masked 0.5-7 keV greyscale\n    image showing labelled features, constructed by taking the X-ray\n    data in 0.246 arcsec pixels and smoothing by a Gaussian of width 1\n    pixel and subtracting the 0.5 times the image smoothed by 64\n    pixels.}\n  \\label{fig:rgb}\n\\end{figure*}\n\n\nThere are fluctuations in metallicity interior to the western cold\nfront on $\\sim 5-10$~kpc scales (Fig.~\\ref{fig:wide_T_Z}). These\nfeatures are robust against changes to the binning scheme. We compared\ntwo neighbouring regions offset from the nucleus with high (X) and low\n(Y) metallicity (Fig.~\\ref{fig:highZ}) to confirm that these\nstructures are significant.  Fitting the spectra separately, we\nobtained the metallicities using one and two temperature component\nfits, and for two different background spectra.\n\nThe Si and Fe abundances are greater in region 1 for every model. The\nFe metallicity is 30 per cent greater in region 1 using a blank-sky\nbackground, increasing to 55 per cent if a cluster background is\nused. It should be noted that if a blank-sky background is used, the\nFe metallicity calculated from the Fe-K lines is consistent ($\\sim 1\n{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$) between X and Y. However, a cluster background makes the Fe-K\nline strength consistent with the increase in metallicity seen in the\nFe-L lines. The cluster background is likely more realistic, as we\nknow that there is projected cluster emission. Within the\nuncertainties, the enhancements in the other elements are\nconsistent with the Fe increase.  There is no preference for increased\namounts of Type Ia or Type II supernova products in the high\nmetallicity region.\n\nWe estimated the effects of projection by\n  considering an $8^3 {\\rm\\thinspace kpc}^3$ enhancement in metallicity at 25 kpc\n  radius, using the profiles across the SW front (Appendix\n  \\ref{sect:frontfit}). For regions of this size, the measured\n  enhancement is likely suppressed by a factor of $\\sim 4$. Therefore\n  this blob has $\\sim 5$ times the metallicity of the nearby low\n  metallicity material, assuming that the simple model of an enhanced\n  cubic blob is correct. Region X would contain an enhancement of\n  around $10^6 {\\hbox{$\\rm\\thinspace M_{\\odot}$}}$ of Fe over region Y.\n\n  The flatness of the western metallicity profile and\n  sharpness of the cold front edge implies high effective central\n  diffusion rates which rapidly drop with radius\n  \\citep{Graham06,Walker14}.  The existence of the compact high\n  metallicity regions argues that diffusion by stochastic gas motions\n  is low.  In contrast, sloshing of gas in the potential well does not\n  lead to broadening of the distribution \\citep{Roediger12}, but\n  results in asymmetric and distorted distributions. If the AGN\n  bubbles drag dusty clouds of high metallicity gas produced by\n  stellar mass loss from the core of NGC\\,4696 to larger radius, this\n  will naturally flatten out the central peak and give the observed\n  effective diffusion coefficient which rapidly declines with radius\n  \\citep{Panagoulia13}. In addition, this intriguingly raises the\n  possibility that the high metallicity regions are metal-rich\n  materials uplifted from the galactic centre by AGN bubbles.  High\n  metallicity blobs on similar scales have appeared in other clusters\n  which have good quality data (e.g. Perseus, \\citealt{SandersPer07}\n  and Abell 2204, \\citealt{SandersA220409}) and could be produced by\n  a similar process.\n\n  If the material was injected into a much smaller region and has\n  expanded to size $L$ over a timescale $t$, the diffusion coefficient\n  is $D \\sim L^2/(24t)$ in three dimensions. Using the sloshing\n  timescale (1 Gyr; Section \\ref{sect:sloshing}) and a size of 8 kpc,\n  this translates into a diffusion coefficient $D \\sim 10^{27} {\\rm\\thinspace cm}^{2}\n  {\\rm\\thinspace s}^{-1}$. If the cavity age (e.g. 10~Myr; Section\n  \\ref{sect:central}) is a more appropriate timescale because the\n  blobs are uplifted by the AGN, then the diffusion coefficient would\n  be two orders of magnitude greater.\n\n\\section{Nuclear region}\n\\label{sect:central}\n\\subsection{Images and spectral maps}\n\nFig.~\\ref{fig:rgb} (top panel) shows an RGB image of the central $\\sim\n30$~kpc of the cluster around the central radio source. Cool\nstructures in the cluster appear as red in this scheme. In\nFig.~\\ref{fig:rgb} (bottom panel) is a labelled image of the same\nregion, with partial unsharp-masking.  Obvious is the soft cool\nplume-like structure extending to the north-east\n\\citep{SandersCent02}. In these new, deeper, observations it can be\nseen that the plume is made up of at least three separate\nfilaments. There are the two strong central cavities in the X-ray\neither side of the nucleus which are filled with high-frequency (GHz)\nradio emitting plasma \\citep{Taylor02}. Connecting the plume to the\nnucleus is a SB edge, labelled the inner edge. Between this edge and\nthe plume appears to be a SB depression. The plume appears to extend\nthrough the edge, ending a few kpc beyond that. The inner edge may\nrepresent the edge of an egg-shaped region of enhanced SB. To the\nsouth-east of the core is another cool filament with a hook-like\nshape. There is a SB edge to the south-west, with an unusual negative\ncurvature. We name it the bay, as it looks similar to the bay seen in\nthe core of the Perseus cluster \\citep{FabianPer06}. Similar\nstructures are also seen in Abell 1795 and Abell 2390\n\\citep{Walker14}.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.85\\columnwidth]{fig12_small.pdf}\n  \\caption{Detail of the central regions in three energy bands and\n    comparison temperature map. X-ray images were created with 0.246\n    arcsec binning with 1 pixel Gaussian smoothing. A 2.4 arcsec\n    radius circle marks the radio nucleus and `+' shows the X-ray\n    centroid.}\n  \\label{fig:vcentre}\n\\end{figure}\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=0.43\\textwidth]{fig13_1_small.pdf}\n  \\includegraphics[width=0.43\\textwidth]{fig13_2_small.pdf} \\\\\n  \\includegraphics[width=0.43\\textwidth]{fig13_3_small.pdf}\n  \\includegraphics[width=0.43\\textwidth]{fig13_4_small.pdf} \\\\\n  \\includegraphics[width=0.43\\textwidth]{fig13_5_small.pdf}\n  \\includegraphics[width=0.43\\textwidth]{fig13_6_small.pdf}\n  \\caption{Central spectral maps (left) and fractional deviations from\n    spherical symmetry (right). Analysis details are given in Appendix\n    \\ref{sect:speccentredetails}. On the left side are the (top left\n    panel) temperature in keV, (centre left panel) normalisation (in\n    log$_{10}$ cm$^{-5}$ arcsec$^{-2}$) and (bottom left panel)\n    pseudo-pressure (in log$_{10}$ keV cm$^{-5/2}$ arcsec$^{-1}$). On\n    the right side are the fractional deviations from the average at\n    each radius of the respective left map.  Maps have been smoothed\n    by a Gaussian of 0.492 arcsec, excluded point sources are shown as\n    circles or ellipses and the central radio source is marked by\n    crosses.}\n  \\label{fig:centre_spec_maps}\n\\end{figure*}\n\nThe large number of counts available in this dataset allow us to make\ndetailed X-ray images of the very central regions in different energy\nbands (Fig.~\\ref{fig:vcentre}). The 0.5--1 keV band is sensitive to\ncool ($\\sim 1$~keV) gas, while the 1.5--7 keV band is sensitive to\nhotter material. The radio nucleus, as noted by \\cite{Taylor06}, is\noffset to the north-east of a ridge of bright, soft X-ray\nemission. The nucleus also does not lie in the geometric centre of the\ntwo inner cavities. Also shown in Fig.~\\ref{fig:vcentre} is a\nprojected X-ray temperature map of the same region (taken from\nFig.~\\ref{fig:centre_spec_maps}). The lowest temperature material is\nstrongly correlated with the soft emission, although there is not a\ncomplete correspondence.\n\nMaps of the central temperature, \\textsc{xspec} normalisation per unit\narea and pseudo-pressure are shown in Fig.~\\ref{fig:centre_spec_maps}.\nThe normalisation per unit area scales with the density squared and\nthe line-of-sight depth. The pseudo-pressure is the temperature\nmultiplied by the normalisation per unit area, scaling as the\nprojected thermal pressure times the line-of-sight depth. On the left\nside are the projected quantities. On the right are shown the\nfractional deviations from spherical symmetry.\n\nThe temperature map shows that the soft-X-ray-emitting structures,\nincluding the plume, seen in the X-ray images, are indeed cooler gas.\nThe overall temperature decreases towards the core of the cluster. The\ntemperature deviation map shows deviations in projected temperature\nare around 30 per cent. The map shows an extension of cool material in\nroughly the opposite direction to the plume from the nucleus. The\nnormalisation map shows the dense plume structure and the dense shells\naround the two inner cavities. Examining the non-spherical structure,\nthere are a number of depressions visible in the residuals, which we\nassign the letters A--H. The pressure maps show the thermal pressure\nis lower inside the two central cavities and also towards the end of\nthe plume and towards the south-west, in roughly the opposite\ndirection.\n\n\\subsection{Shock around nucleus}\n\\label{sect:innershock}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig14_small.pdf}\n  \\caption{A 1.9-kpc-radius shell-like structure\n    (marked by arrows) seen around the nucleus. The 1 to 7 keV image\n    was binned in 0.246 arcsec pixels, smoothing by a 1 pixel\n    Gaussian. The radio nucleus position is marked by a circle of\n    radius 1.8 arcsec.}\n  \\label{fig:centreshell}\n\\end{figure}\n\nThere is a shell-like enhancement which surrounds the central nucleus\n(Fig.~\\ref{fig:centreshell}), not clear in the previous images.  This\nshell appears to split into two separate fine edges to the south-east,\nseparated by 3 arcsec (0.6 kpc). The north part of the shell can be\nseen in the RGB image (Fig.~\\ref{fig:rgb}) as a blue rim to the north\nof the red central emission. The shell has a radius of 9 arcsec (1.9\nkpc). The nucleus is offset 3 arcsec (0.6 kpc) to the south-east from\nthe geometric centre of the shell, in the direction of the splitting\nof the edge.\n\nIts morphology suggests that it may be a shock generated by an\noutburst of the central nucleus. This is consistent with the X-ray\nemission from the feature being hard. However, we do not see an\nobvious SB enhancement within the shock, but just its\nedge, which may be due to the complex density and temperature\nstructure at the core of the cluster. The shock appears to be\noverlapping the central cavities. If the cavities and shock were\nspatially coincident, it is unclear into what the shock is shocking. A\npossible explanation is that the cavities are offset along the line of\nsight from each other and the shock lies between the two and around\nthe nucleus.\n\nWe do not know the speed of the shock, but given the sound speed for\nmaterial at 1.1~keV, an upper limit for its age would be $\\sim\n3.5$~Myr. The outer parts of central bubbles beyond the shock are at a\nmaximum projected radius of around 5.5 kpc, which would imply that\nthey are only a few times older than the shock, unless projected radii\nare much larger than intrinsic distances, which their morphology\nsuggests is not the case. Estimates for the ages of the inner bubbles\nin Centaurus range from $6-22$~Myr \\citep{Rafferty06}. This implies\nthat there are repeated outbursts from the nucleus in Centaurus on\ntimescales of $3-19$~Myr.\n\nA shock would explain why the X-ray-coolest gas is not the closest to\nthe nucleus, although this could alternatively be explained by\nsloshing.  If there was a non-symmetric temperature distribution\naround the nucleus before the shock was launched, the varying sound\nspeed might explain why the nucleus is not at the shell\ncentre. Indeed, the colder material seen to the west might have\nreduced the shock radius in this direction. This colder material,\nhowever, may only lie close to the nucleus in projection and could be\noutside the shock region. The very central high-frequency radio\nemission appears to be bounded by the shell edges to the north and\nsouth (Section \\ref{sect:radio_icm}).\n\n\\subsection{Interaction of radio source and ICM}\n\\label{sect:radio_icm}\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\textwidth]{fig15_small.pdf}\n  \\caption{High frequency radio and X-ray\n    comparison. (a) 9 GHz image with 8 logarithmic cyan contours at\n    levels from $4\\times 10^{-5}$ to 0.0607 Jy~beam$^{-1}$, with\n    resolution $1.15\\times 0.31$ arcsec. (b) 9 GHz image applying GGM\n    filter ($\\sigma=0.08$ arcsec). (c) 0.5 to 1 keV X-ray image. Also\n    show are two 5 GHz contours from \\protect\\cite{Taylor02} at 0.1\n    and 0.4 mJy~beam$^{-1}$ (magenta). (d) GGM-filtered 0.5 to 1 keV\n    image, summing the GGM-filtered images with $\\sigma=0.246$ and\n    0.492 arcsec. Arrows mark regions of high rotation measure. (e) 1\n    to 7 keV X-ray image. (f) GGM-filtered 1 to 1.5 keV image\n    ($\\sigma=0.492$ arcsec).}\n  \\label{fig:radio_xray}\n\\end{figure*}\n\nThe central radio source PKS\\,1246-410 was observed in 2013 and 2014\nusing the Karl G. Jansky Very Large Array (VLA) in the A and B\nconfigurations between 8 and 10 GHz, with a total of 8.2 hours of time\non source. Analysis details and first results are presented in\n\\cite{Grimes14}. The intensity map is shown in\nFig.~\\ref{fig:radio_xray} (a). There are a number of edges in the\nradio image, which we highlight by applying a GGM filter (b). The\nfiltered image suggests that the inner part of the source is extended\nalong the north-south direction, changing to the east-west on larger\nscales. The bright nucleus is also extended in the north-south\ndirection, in agreement with the jet on smaller scales in VLBI\nobservations \\citep{Taylor06}.\n\nWe compare the radio emission at 9 and 5 GHz with the soft X-rays (c),\nexamining the central region using a GGM-filtered soft X-ray image\n(d).  It can be seen that the edges in the soft X-ray emission (as\ntraced by the GGM-filtered image) extend along the direction of the\nradio source or around its edges. This is consistent with the skin\neffects surrounding the radio source identified in the rotation measure analysis of\n\\cite{RudnickBlundell03}. Examining the harder X-ray emission (e) we\nsee that the rims of the X-ray cavity match the extent of the radio\nsource. In addition, edges in the inner part of the radio source\nclosely follow the edge of the shell-like structure, as seen in a\nGGM-filtered harder image (f). The edges in the radio source can\nclearly be seen in the GGM-filtered image (b).\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=0.9\\columnwidth]{fig16_1_small.pdf}\n  \\includegraphics[width=0.9\\columnwidth]{fig16_2_small.pdf}\n  \\caption{Lower frequency radio and X-ray/pressure comparison. (Left\n    panel) 0.5 to 7 keV X-ray fractional residuals from radial\n    average, showing 1.565 GHz (inner cyan) and 330 MHz (outer red)\n    contours. (Right panel) Pressure azimuthal fractional residuals\n    using $S/N=40$ binning. There are six logarithmic 1.565 GHz\n    contours between 0.2 and 360 mJy~beam$^{-1}$ and four logarithmic\n    330 MHz contours between 10 and 100 mJy~beam$^{-1}$.}\n  \\label{fig:radiolower}\n\\end{figure*}\n\nAt lower frequencies the radio emission is connected to features in\nthe X-ray image and pressure map (Fig.~\\ref{fig:radiolower};\n\\citealt{Taylor02}). At 1.6~GHz, in addition to emission in the\ncentral cavities, there are extensions to the north and south. In the\nsouth the emission appears to bifurcate into extensions R3 and\nR4. Region R4 is coincident with an area of lower pseudo-pressure and\na depression in the X-ray image (labelled E in\nFig.~\\ref{fig:centre_spec_maps}). To the north there is an extension\nin the radio source, R2, along the direction of the plume in a region\nlower in pseudo-pressure. At 330 MHz frequencies, measured using the\nVLA, R2 extends into the lower pressure region R1 and R4 continues\nsouth along a lower pressure channel to R5. There also exists a spur\nof emission into a lower pressure region R6.\n\nThe radio emission switches from a north-south direction on jet\nscales, to east-west in the inner cavities to north-south again on\nlarger scales. The radio source and X-ray emission are connected from\nsub-kpc scales to several tens of kpc. In the very inner region the\nhigh frequency radio emission shows edges coincident with the inner\nshell, or shock.  In the inner 2~kpc there are edges in the soft X-ray\nemission which clearly trace along the direction of the radio source,\nincluding an edge running along its midpoint and a sharp edge\nimmediately to the south of the inner radio source, south of which is\na bright ridge of X-ray emission.\n\n\\subsection{Cavities}\n\\label{sect:cavities}\nThere are a number of SB depressions in the core of the cluster, most\neasily seen labelled in the residual normalisation map\n(Fig.~\\ref{fig:centre_spec_maps}) and the GGM-filtered image\n(Fig.~\\ref{fig:centre}). A and B are the central cavities coincident\nwith radio emission. C is the depression between the nucleus and\nplume, marked by the `inner edge' in Fig.~\\ref{fig:rgb}. D is the\ndepression bounded by the `bay' structure. E is also associated with a\ndepression in the thermal pressure, and lies near the `hook' structure\n(which itself seems to surround another cavity, I). F, G, and H are\nfurther depressions. All of these features could be generated by AGN\noutbursts, with a large fraction showing some evidence for radio\nemission (Figs. \\ref{fig:radio_xray} and \\ref{fig:radiolower}). These\ninclude the central cavities (A and B), the cavity towards the plume\ndirection (C), the cavity in the opposite direction (E) and its\nneighbouring cavity (H). There is also 330 MHz emission at the\nlocation of the bay cavity (D). The gradient filtered image on larger\nscales (Fig.~\\ref{fig:unsharp} lower panel) shows an SB edge across\nthe bay (it is split into F2 and F3) and there may be further flat SB\nareas in which could be yet-older cavities (F1 and F4-F6).\n\nA large fraction of the volume in the inner 20 kpc\nradius, or even further, may be filled by cavities and their ageing\nelectron populations.  There are other clusters, such as M\\,87\n\\citep{FormanM8707} and 2A\\,0335+0986 \\citep{Sanders2A033509} which\nshow large number of possible cavities in their core. In Centaurus,\nthe pressure map, however, does not show reductions in thermal\npressure at the location of all these cavities, though there are\ndecrements in thermal pressure for A, B, C, E and I. It is possible\nthat displaced thermal gas may mask pressure changes. It is also the\ncase that in other clusters not all extended radio emission is\nassociated with cavities. For example, in Perseus the minihalo\nemission is correlated with the X-ray substructure \\citep{Fabian11}.\n\n\\subsection{Shock surrounding inner cavities}\n\\label{sect:centcavity}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=\\columnwidth]{fig17_small.pdf}\n  \\caption{Deprojected temperature, density and pressure profiles\n    across the western inner cavity and two neighbouring sectors (see\n    Appendix \\ref{sect:innercavity}). The cavity outer edge radius is\n    shown by a vertical dashed line. The straight lines are two fits\n    to the western points from 6--9 and 7.5--9~kpc.}\n  \\label{fig:cavity_prof}\n\\end{figure}\n\nThere are pressure and temperature enhancements outside the inner\ncavities towards the north and west\n(Fig.~\\ref{fig:centre_spec_maps}). These could be due to shock heating\nof the region due to the formation of the cavities. To examine this in\nmore detail we made deprojected temperature, density and pressure\nprofiles (Fig.~\\ref{fig:cavity_prof}) across the western inner cavity\n(the eastern cavity is too close to the plume), and in two comparison\nregions to the north and south. We note that there\n  are potential problems with deprojecting spectra in a region with a\n  complex structure, although the results are qualitatively consistent\n  with the projected maps.  The cavity is clearly seen in the density\nprofile (the 7th radial bin), where only an upper limit can be\nobtained.\n\nImmediately outside the cavity the temperature is relatively low (1.2\nkeV), but jumps up by 40 per cent in the next bin to 1.7 keV. It then\nstays flat over $\\sim 3$ kpc, then rises from 8 to 13 kpc, then\nflattens again. In comparison, the northern profile appears to have\nthe same 1.7 keV temperature plateau from 4.2 to 12 kpc radius, but is\neven hotter ($\\sim 2$ keV) inside that at the radius of the cavity. To\nthe south there is a much more gradual rise in temperature with\nradius. These trends can be seen in the deviation maps of the central\nregion (Fig.~\\ref{fig:centre_spec_maps}).  Outside the cavity is a\n1.7-kpc-thick high-density rim. The profile and images show a similar\nthicker region in the northern sector. Beyond the cavity rim in the\nwestern sector, the density drops by 15 per cent at 9 kpc radius where\nthe sector overlaps with the bay region.  The southern density profile\ndoes not show the obvious jumps in density beyond 2.6 kpc radius. As\nthere are jumps in both temperature and density, there are\ncorresponding increases in pressure, with the largest pressure\nincrease to the north.\n\nThe magnitude of the jumps in temperature, density and pressure are\nuncertain because we do not know the underlying profiles. We show fits\nto two sets of points (6--9 kpc and 7.5--9 kpc) in\nFig.~\\ref{fig:cavity_prof} to indicate the allowed range.  The data\nare not fit beyond 9 kpc because of the density jump, likely\nassociated with the bay region. To the west, comparing the peak value\nwith the fit, the range in temperature jump is 13 to 24 per cent\n(although there is a 40 per cent jump in temperature from the bin\nimmediately outside the cavity to the next bin), the density jumps by\n18 to 27 per cent and the pressure by 32 to 45 per cent. In the\nnorthern sector the jumps appear larger. The northern pressure jump is\nlikely between 60 and 130 per cent, while the temperature increases by\n40 to 100 per cent and the density jump is uncertain.\n\nThe most likely explanation for these high density, temperature and\npressure rims is that they are caused by a weak shock generated by the\nmechanical action of an outburst of the central AGN on the ICM. Such\nshocks are seen in other clusters and groups (e.g. Perseus,\n\\citealt{FabianPer03}; M87, \\citealt{FormanM8707}; NGC 5813,\n\\citealt{Randall15}). Assuming a $\\gamma=5/3$ gas and using the\nRankineâ\u0080\u0093Hugoniot jump conditions \\citep{LandauLifshitz}, the range of\ndensity and temperature jump values to the west would imply a Mach\nnumber for the shock between 1.1 and 1.2, while the temperature jump\nratio implies a value between 1.2 and 1.4. The northern jump in\ntemperature, however, implies a much stronger shock between 1.6 and\n2.2. The values are rather uncertain, however, due to the unknown\nunshocked profiles. The discrepancies between the north and west may\nbe due to the rising cavity entraining cool material which is being\nmixed into the surrounding ICM to the west, reducing the temperature\nincrease. It is unclear how this could affect the density in this\ndirection, however.\n\nWe can estimate the energy that the shock has dissipated in the ICM\n(as in the Perseus cluster, \\citealt{Graham08Per}). Taking the hard\nX-ray band image, the western cavity is an ellipse with axes with\nradii 1.8 and 2.4~kpc and the hard rim has radii 3.3 and\n4.2~kpc. Assuming an electron pressure enhancement in the shock of\n$0.02{\\hbox{$\\keV{\\rm\\thinspace cm}^{-3}\\,$}}$ and that the shock lies completely around the western\ncavity, the energy dissipated by the shock is $4\\times 10^{56} {\\rm\\thinspace erg}$\n(using equation 19 in \\citealt{Graham08Per}). This compares to the\nadiabatic energy to expand the cavity $PV = 2 \\times 10^{56} {\\rm\\thinspace erg}$, if\nthe electron pressure for the cavity of $0.07{\\hbox{$\\keV{\\rm\\thinspace cm}^{-3}\\,$}}$. Therefore the\nshock energy is around half the energy available\n($4PV$). The heating power of the shock, using the\nshock width divided by its speed as a timescale, is $6 \\times 10^{42}\n{\\hbox{${\\rm\\thinspace erg}{\\rm\\thinspace s}^{-1}\\,$}}$. This is around 75 per cent greater than the heating power\ninferred per cavity \\citep{Rafferty06}.\n\n\\subsection{Dust and X-ray association}\n\\label{sect:optical}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig18_small.pdf}\n  \\caption{Central dust lanes and \n    soft X-ray comparison. (Top panel) Fractional residuals of image to a\n    symmetric elliptical model fitted to an \\emph{HST} F435W image of\n    NGC 4696 from Hubble legacy dataset\n    HST\\_9427\\_06\\_ACS\\_WFC\\_F435W. (Bottom panel) Unsharp-masked\n    0.5-1 keV image. The arrows are in the same location in each\n    image. `$\\times$' marks the radio nucleus, while `+' indicates the\n    optical model centroid.}\n  \\label{fig:optresid}\n\\end{figure}\n\nIn Fig.~\\ref{fig:optresid} we compare the optical morphology of the\ndust lanes in NGC 4696 with the soft X-ray filaments. To remove the\nsmooth stellar component, we constructed an elliptical model. Given a\ncentre, ellipticity and rotation angle, the average at each elliptical\nradius was computed. This profile was then converted to a 2D\nimage. The model image was fit to the data, adjusting the model\nparameters. Regions containing obvious dust features and bright\nsources were masked from the data and model during fitting. The ratios\nof this model to the data are shown in the top\npanel.\n\nAlthough the morphology of the dust follows the\n  soft X-ray emission, there is an offset between the regions with the\n  brightest X-ray emission and the dust. We checked point source\n  positions to verify that the astrometry was corrected. The\n  morphological agreement indicates the dust and soft X-rays have a\n  common origin. Either there is a real offset between the components,\n  or there is additional bright X-ray emitting material obscured by\n  dust and associated material. If the dust material is blocking\n  significant X-ray emission it must lie in front of the X-ray\n  emitting material or is well mixed with it. We examined the X-ray\n  spectra of a region between the two rightmost arrows, along the dust\n  lane and a comparison region to the east along the bright X-ray\n  rim. Fitting two-temperature-component models to the spectra did not\n  show any evidence for increased column density in the dust region,\n  either when fixing the temperatures to be the same in the two\n  regions or not. Most of the difference in flux between the regions\n  appears to be around $0.9{\\rm\\thinspace keV}$ energy, which argues against\n  absorption which would primarily affect low energies.\n  This would suggest that the soft X-rays and dust are\n  offset, although partial covering models may account for the lack of\n  obvious soft X-ray absorption.\n\n\\subsection{Plume origin}\n\\label{sect:plumeorigin}\nThe reversing SB and temperature structure in the cluster\n(Fig.~\\ref{fig:subav}) suggests that the plume is part of the sloshing\nmorphology of the cluster. Arguing against this origin is that the\nplume appears to be made up of filamentary multiphase gas, connected\nto the cluster core (Fig.~\\ref{fig:rgb}). The southern part of the\nplume is associated with cold material in other wavebands\n(e.g. Fig.~\\ref{fig:optresid} and \\citealt{Crawford05}). The\nspatial coincidence of the radio structure with the plume\n(Fig.~\\ref{fig:radiolower}) implies that the feature is due to a ghost\nradio cavity which has risen in that direction, dragging out cold\nmaterial behind it \\citep{Crawford05}.\n\nIf the plume was generated by a rising bubble, which bubble is\nresponsible? Around four-fifths of the way along the plume is a SB\nedge (marked as Inner Edge in Fig.~\\ref{fig:rgb}) which appears to\ncross the plume and perhaps connects to the east-most filament. This\nedge is made up of a lower temperature material, appearing to bound a\ncocoon-like structure (see the temperature and normalisation ratio\nmaps in Fig.~\\ref{fig:centre_spec_maps} and the 1 keV map in\nFig.~\\ref{fig:norm_T_maps}). Inside this edge is a depression\n(labelled C in Fig.~\\ref{fig:centre_spec_maps}), where the majority of\nthe extended radio emission to the north lies\n(Fig.~\\ref{fig:radiolower}). This could be the responsible bubble,\nalthough this does not explain why the plume extends beyond the edge\ntowards the north-east, where it rapidly ends. There is no evidence\nfor any other cavities or radio emission beyond the plume. It could be\nthat the plume is not on the plane of the sky, but has a large\ncomponent along the line of sight.\n\nThe similarity of the plume and the sloshing morphology could be due\nto its shape being affected by the motions in the ICM caused by the\nsloshing, giving the bend at its south. ICM motions\nmay have also helped displace the bubble to the north, helping to drag out\ncolder material behind it. This may also explain why there is no\nsimilar plume to the south. However, cavity E, which is associated\nwith low frequency radio emission, is in the opposite direction from\nthe plume and is a plausible counterpart, albeit without the\nassociated plume structure. Sloshing or displacement of material by\nbuoyant bubbles may be the origin of the offset of the coldest X-ray\nmaterial from the nucleus (Fig.~\\ref{fig:vcentre}). The coolest X-ray\nemitting material is coincident with the central dust lane\n(Fig.~\\ref{fig:optresid}), which is offset from the X-ray, optical and\nradio nuclei.\n\nThe location of the bay (D) in the hot spiral-shaped region diagonally\non the opposite side of the cool spiral-shaped plume\n(Fig.~\\ref{fig:centre_spec_maps}), suggests that it may be generated\nby the sloshing motion. The edges of the bay, however, curve in the\nopposite direction to the hot inward spiral. The bay also does not\nspiral north and inward as the temperature does, but there is an edge\nin SB and density to the north (Figs. \\ref{fig:centre} and\n\\ref{fig:centre_spec_maps}). Low-frequency radio emission is also\nassociated with the bay region (Fig.~\\ref{fig:radiolower}). Therefore\nit is likely that the bay is an AGN-generated cavity and is not\ngenerated by gas sloshing in the potential well.\n\n\\subsection{Rotation measure and magnetic fields}\n\\label{sect:rm}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=\\columnwidth]{fig19_small.pdf}\n  \\caption{RM image, with radio (top), soft X-ray\n    edges (centre) and optical (bottom) contours. The map has\n    $1.06\\times 0.26$ arcsec resolution and a scale in\n    rad~m$^{-2}$. The arrows mark five regions with RMs\n    $<-1500$~rad~m$^{-2}$. The RM varies between $-3500$ and\n    $3500$~rad\\,m$^{-2}$, with a mean of $-391$~rad\\,m$^{-2}$ and a\n    full width half maximum of $668$~rad\\,m$^{-2}$. Regions where the\n    polarisation angle uncertainty exceeds $35^\\circ$ are\n    excluded. The X-ray contours come from an unsharp-masked 0.5-1 keV\n    image and the optical show the dust lane\n    (Fig.~\\ref{fig:optresid}).}\n  \\label{fig:RM}\n\\end{figure}\n\nFig.~\\ref{fig:RM} shows the 9~GHz Rotation Measure (RM) map, plotting\ncontours from the intensity (top panel), soft X-rays edges (centre\npanel) and optical dust lane (bottom panel).  Five regions with high\nRMs (more negative than $-1500$~rad\\,m$^{-2}$) are identified by\narrows (also shown in Fig.~\\ref{fig:radio_xray}). These include the\nnucleus (RM3), a 850-pc-long tube-like structure which extends\nsouth-east from the nucleus (RM6) and a large gradient in RM across\nthe western half of the source (RM2).  The regions of high RM (marked\nby the arrows) correspond to where the X-ray emission is bright,\nthough there is not an exact one-to-one correspondence between RM and\nsoft X-ray emission.\n\nWe also compare the RM map with contours showing the dust lane in the\ncentre of NGC 4696. The region in which the radio polarisation can be\nmeasured is anti-coincident with the strongest dust absorption\nregions. However, several of the regions with high RMs (RM1, RM4, RM5\nand RM6) coincide with locations of dust absorption.\n\nThe RM shows a number of regions with large negative\n($<-1500$~rad\\,m$^{-2}$) values. The value of the RM is given by\n\n", "index": 1, "text": "\\begin{equation}\n\\mathrm{RM} = 812 \\int_0^L n_\\mathrm{e} \\: B_\\parallel \\: \\mathrm{d}l \\:\n\\mathrm{rad} \\: \\mathrm{m}^{-2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{RM}=812\\int_{0}^{L}n_{\\mathrm{e}}\\&gt;B_{\\parallel}\\&gt;\\mathrm{d}l\\&gt;\\mathrm%&#10;{rad}\\&gt;\\mathrm{m}^{-2},\" display=\"block\"><mrow><mrow><mi>RM</mi><mo>=</mo><mrow><mn>812</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>L</mi></msubsup><mrow><mpadded width=\"+2.2pt\"><msub><mi>n</mi><mi mathvariant=\"normal\">e</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+2.2pt\"><msub><mi>B</mi><mo>∥</mo></msub></mpadded><mo>⁢</mo><mrow><mo>d</mo><mpadded width=\"+2.2pt\"><mi>l</mi></mpadded></mrow><mo>⁢</mo><mpadded width=\"+2.2pt\"><mi>rad</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">m</mi><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01489.tex", "nexttext": "\nwhere $N_1$ and $N_2$ are the \\textsc{xspec} normalisations of the two\ncomponents, respectively, $T_1$ and $T_2$ are the respective\ntemperatures, $V$ is the assumed volume (radius times area of bin on\nthe sky, in ${\\hbox{${\\rm\\thinspace cm}^3\\,$}}$) and $D_A$ is the angular diameter of the source\nin cm and $z$ its redshift. Monte Carlo realisations of the input data\nare used to derive the error bars in the computed quantities.\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\textwidth]{fig31_small.pdf}\n  \\caption{Radial plots of the projected electron density, electron\n    entropy, electron pressure and mean radiative cooling time. The\n    results are shown for two thermal components (with the number of\n    components selected as in Fig. \\ref{fig:T_radius}. Error bars are\n    shown only for every 10th point. Points are coloured according to\n    temperature. Note that for the pressure profile the assumption of\n    pressure equilibrium forces the two-component results to have the\n    same pressure.}\n  \\label{fig:therm_r_X}\n\\end{figure*}\n\nIn Fig.~\\ref{fig:therm_r_X} we examine the radial thermodynamic\nquantities computed from the two-component fits (showing the\ntwo-component result if both temperatures can be constrained,\notherwise the single-component result). These plots show that there\nare distinct low-temperature branches in terms of density, cooling\ntime and entropy, seen most easily in terms of cooling time. This\nmaterial has high density, short cooling times and low entropy.  This\ncomponent appears to only be strong inside 12 kpc radius. If the\ntwo-component error threshold is increased, then additional points on\nthese tracks are seen at larger radius, but not in great numbers.\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\textwidth]{fig32_small.pdf}\n  \\caption{Plots of the two-component projected electron density,\n    electron entropy, pressure and mean radiative cooling time as a\n    function of temperature. Error bars are only shown for every 10th\n    value. Points are coloured according to radius.}\n  \\label{fig:therm_T_X}\n\\end{figure*}\n\nThese two branches are also seen in a plot of the temperature against\ndensity or pressure (Fig.~\\ref{fig:therm_T_X}). However, if the\ncooling time or entropy is plotted against the temperature, there\nappears to be a continuous distribution, although there may be a lack\nof values with temperatures around 1.3 keV.\n\nWhen these projected values are compared to deprojected spectra\n(Fig.~\\ref{fig:deproj_EW}) we find reasonable agreement in some\nquantities, while others are offset.  Projection effects appear to\nonly weakly affect the temperature in Centaurus. Both the high- and\nlow-temperature components are apparent in the deprojected results\nover the same radial range. The radius-as-depth assumption appears to\nover-predict the densities by a factor of 60 per cent at larger radius\nand 100 per cent in the centre. There is a similar over-estimation of\nthe pressure and under-estimation of the cooling time and entropy.\n\n\n", "itemtype": "equation", "pos": 116869, "prevtext": "\nwhere $n_\\mathrm{e}$ is the electron density in ${\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$,\n$B_\\parallel$ is the component of the magnetic field along the line of\nsight in $\\mu$G and the integral is over length $L$ in kpc. In\nPKS\\,1246-410 the plausible explanations for high RM are the optical\nline-emitting filaments crossing in front of the radio lobes and\nfilamentary soft X-ray emitting gas \\citep{Taylor07} or local\ninteractions with the synchrotron-emitting plasma \\citep{RudnickBlundell03}.\n\nSeveral of the high RM locations, both in the positive and negative\ndirections, are coincident with filaments of soft X-ray emission. The\ntube of high negative RM south and east of the nucleus (RM6) is\ncoincident with a soft X-ray filament, although the filament does not\nrun along the full length of the tube but passes into a neighbouring\nregion of high positive RM. There is, however, not an exact\ncorrespondence between the soft X-ray emission and regions of high RM,\nperhaps due to surface effects in the skin of the radio source \\citep{RudnickBlundell03},\nor because of absorption of X-rays by the dust lane\n  (see Section \\ref{sect:optical}). Where the X-ray emission is\nbrightest, along the ridge south and west of the nucleus, the\npolarisation cannot be measured.\n\nThe lack of RM measurements in regions coincident with the soft X-ray\nemission and dust lane may be due to depolarisation of the\nsource. Depolarisation is consistent with the gas surrounding the\nfilaments being cooler and denser and more highly magnetised. The\nfields could help support the filaments, as in the Perseus cluster\n\\citep{Fabian08}. Depolarisation is also supported by the isolated\nknots of high RM signal inside regions where the polarisation cannot\nbe measured (e.g. RM1 and RM5). If the regions containing large RMs\nare dominated by line-emitting gas with their associated soft X-ray\nfilaments, and magnetic support is important as in Perseus,\nthe high RMs are likely more sensitive to the magnetic field\nin the filaments than those in the bulk of the ICM.\n\n\\begin{figure*}\n  \\includegraphics[width=0.32\\textwidth]{fig20_1_small.pdf}\n  \\includegraphics[width=0.32\\textwidth]{fig20_2_small.pdf}\n  \\includegraphics[width=0.32\\textwidth]{fig20_3_small.pdf}\n  \\caption{Normalisation per unit area for\n    components with temperatures of 0.5, 1 and 2 keV. A model was\n    fitted with 0.5, 1, 2 and 4 keV components with $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$\n    metallicity, using $S/N=20$ bins, minimising the C-statistic of\n    the fit. The units are log$_{10}$ cm$^{-5}$ arcsec$^{-2}$.}\n  \\label{fig:norm_T_maps}\n\\end{figure*}\n\n\\section{Inner multiphase structure}\n\\label{sect:thermprof}\n\\subsection{Multiple temperature components}\n\nExamining the thermodynamic state of the central region of the cluster\nis important for understanding the balance between heating and cooling\nand on what physical scales that is occurring. A useful technique for visualising\nthe location of X-ray material at different temperatures is to fit a\nmodel made up of several fixed temperature components, allowing the\nnormalisation of each component to vary\n\\citep{FabianPer06}. Fig.~\\ref{fig:norm_T_maps} shows the spatial\ndistribution of the three coldest components in a model made up of\n0.5, 1, 2 and 4 keV temperatures. The 0.5~keV material lies along the\nregions of soft X-ray emission and has a similar morphology to the\ndust and H$\\alpha$ emission (Fig.~\\ref{fig:optresid}) and is offset\nfrom the nucleus. The 1~keV gas traces the central ridge of\nbright X-ray emission, the hook and the plume. The material closest to\n2 keV appears associated with the rims of the inner cavities, the\nplume and the `inner edge' (Fig.~\\ref{fig:rgb}).\n\n\n\\begin{figure*}\n  \\includegraphics[width=\\textwidth]{fig21_small.pdf}\n  \\caption{Comparison between the temperature (in\n    keV) using a single-component model (left) and a two-component\n    model (centre and right) using $S/N=40$ bins, allowing the\n    metallicity to vary (assuming both components have the same\n    metallicity) and minimising the C-statistic. Values for the\n    two-component model are only shown when the improvement in\n    C-statistic has 1 per cent probability of chance occurrence\n    (determined from fits of realisations of single component\n    models).}\n  \\label{fig:maps_2T}\n\\end{figure*}\n\nThe core of the cluster has phases with different temperatures which\nare coincident in position. We examined these temperatures using a\ntwo-component variable temperature model. Fig.~\\ref{fig:maps_2T}\ncompares a single-component map against the lower and upper\ntemperatures of a two-temperature model, when the temperatures of the\nmodel can be constrained. Further details and results are given in\nAppendix \\ref{sect:thermprofscentre}. The results show that the two\ncomponents are required over the plume region \\citep[as found\npreviously in][]{SandersCent02} and in the opposite direction towards\ncavity E (Fig.~\\ref{fig:centre_spec_maps}). The lower temperature\ncomponent drops from 1.5~keV at the end of the plume to $\\sim 0.7$ keV\nin the regions associated with the filaments and the coldest material\nfrom the fixed component analysis (Fig.~\\ref{fig:norm_T_maps}). The\nupper component has a fairly flat 2 keV temperature distribution over\nmuch of the inner region. Its temperature, however, increases to 3 keV\nat the end of the plume and drops to 1.3 keV in a few locations where\nthe coolest component is lowest.\n\n\\subsection{Powerlaw spectral fits}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig22_small.pdf}\n  \\caption{Powerlaw, two or single component fits to bins with\n    $S/N=100$. (Top panel) Radial temperature profiles. Powerlaw upper\n    and lower temperatures are shown if the upper can be determined to\n    better than 1 keV and the index to at least 1. Two component\n    results are shown if the temperatures can be determined to at\n    least 20 per cent and the minimum temperature is $>0.4$ keV. The\n    single component results are shown if neither of these criteria\n    are passed. Larger markers are shown for the powerlaw or\n    two-component results depending on which has the lower C-statistic\n    value. (Bottom panel) The powerlaw index parameter when\n    appropriate.}\n  \\label{fig:T_index}\n\\end{figure}\n\nIn order to see whether a continuous temperature distribution is more\nrealistic, we fitted a powerlaw-temperature-distribution model, which\nassumes that the gas has a range in temperature between\n$T_\\mathrm{upper}$ and $T_\\mathrm{lower}$. The model is constructed\nusing $N$ logarithmically-spaced temperature components (here 16),\nwhere the relative normalisation of one component at temperature $T$\nis given by $(T/T_\\mathrm{lower})^\\Gamma$. Each component is assumed\nto have the same metallicity. This powerlaw model has the same number\nof free parameters as a two-component model, as the free normalisation\nis substituted for the powerlaw index.\n\nA comparison between the temperature values obtained with the\ntwo-component model and the powerlaw upper and lower temperatures is\nshown in Fig.~\\ref{fig:T_index}. Well constrained temperatures and powerlaw indices\nfor the two-component and powerlaw fits are mostly found in the central region.  The obtained\ntemperature range is wider when a powerlaw temperature distribution is\nassumed. As the two-temperature and powerlaw models are distinct, we\ncannot compare them with an F-test. However, the powerlaw model\nproduces better fits in the central regions compared to the\ntwo-component model. In addition, the powerlaw index increases from\nnegative values (where low temperatures dominate) to positive values\n(where high temperatures dominate) as a function of radius.\n\n\\subsection{Accounting for projection effects}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.95\\columnwidth]{fig23_small.pdf}\n  \\caption{Deprojected profiles for the eastern (E)\n    and western halves (W) of the cluster. Shown are the results for\n    single- and two-component models (where the errors on the\n    temperatures are less than 20 per cent). See Appendix\n    \\ref{append:deprojcentre} for details. We plot the results from\n    projected two-temperature fits for comparison (Appendix\n    \\ref{sect:thermprofscentre}; plotting every 4th point). Powerlaw\n    fits to the pressure and density profiles, and the estimated free\n    fall time, are shown.}\n  \\label{fig:deproj_EW}\n\\end{figure}\n\nSome of the multiple components may be due to projected spectra of\nmaterial along the line of sight. We therefore construct profiles from\ndeprojected spectra in east and west sectors\n(Fig.~\\ref{fig:deproj_EW}). The eastern side of the\n  cluster centre is strongly affected by the plume which we do not\n  remove.  The maximum difference in temperature between the eastern\nand western sides is around 30 per cent. Excluding the cavities, the\ndensity can differ by 40 per cent. In pressure there is generally\nlittle difference between the two sides, except at the locations of\nthe cavities (between 2.4 and 4.3 kpc radius). The single-component\nmetallicity values show a large discrepancy between the east and west,\nalthough when two temperature components are used, this difference\nbecomes much smaller.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig24_small.pdf}\n  \\caption{Comparison of powerlaw, single and two-component model\n    deprojected spectral fits.  Panels are the temperature (top),\n    metallicity (2nd), power law index (3rd) and fit $\\chi^2$\n    (bottom). The projected two-component results are also shown,\n    plotting only every 4th point.}\n  \\label{fig:deproj_plaw}\n\\end{figure}\n\nWe can also fit the powerlaw distribution model to the deprojected\ndata. The results of these fits (Fig.~\\ref{fig:deproj_plaw}) show a\nsimilar trend to the projected results, where the powerlaw temperature\nrange is wider than the two temperatures of the two-component\nfits. The index cannot be constrained very well, but scatters around a\nvalue of 0. If we examine the best fitting metallicity for the\nsingle-component, two-component and powerlaw deprojected fits and the\ntwo-component projected fits, then we find that there is reasonable\nagreement for all these models except for the single-component\ndeprojected results, which show a stronger drop in metallicity in the\ncentral regions. However, all the results show a central metallicity\ndrop. In the figure we also plot the $\\chi^2$ of the best fit to the\ndeprojected spectra for each of the models. The two-component and\npowerlaw models fit the data better in the central regions, but there\nis little difference in the fit quality between these two models\nthere. In the projected fits, the powerlaw model appeared to fit the\ndata better than the two-component model in the central regions, but\nit is unclear whether this is due to projection effects or data\nquality.\n\n\\subsection{Discussion}\nThere is projected emission down to $\\sim 0.9{\\rm\\thinspace keV}$ with a\nsingle-component model or $0.7{\\rm\\thinspace keV}$ with two components. This is\nroughly consistent with the \\emph{XMM}-RGS results\n\\citep{SandersRGS08} which show Fe~\\textsc{xvii} emission, with\nmaterial down at $0.3-0.45{\\rm\\thinspace keV}$. The difference may be due to\nprojection effects, the limited spectral resolution of ACIS and the\nassumption of $1.2\\times 10^{21} {\\hbox{${\\rm\\thinspace cm}^{-2}\\,$}}$ absorbing Hydrogen column\ndensity in this analysis. There is dust associated with the filaments\nwhich could contain additional absorbing material. We also note that\nwe always assume that the thermal components have the same\nmetallicity, which may not be the case.\n\nThe coolest X-ray filaments lie closest to the core of the cluster at\nthe location of the dust filaments, albeit with an offset\n(Fig.~\\ref{fig:optresid} and Fig.~\\ref{fig:vcentre}). The X-ray gas is\nclearly multiphase in the centre of the cluster and more than one\nthermal component is required to fit the spectra\n(e.g. Fig.~\\ref{fig:deproj_plaw}). The multiphaseness is not due to\nprojection effects caused by the cluster temperature gradient and is\nseen in deprojected spectra (Fig.~\\ref{fig:deproj_EW}). Introducing a\ntwo-component model into the spectral model (Fig.~\\ref{fig:T_radius})\nshows that there is a 0.8 to 2 keV temperature range over most of the\ninner 6 kpc, rather than the more smoothly varying profile as seen in\nthe one-component model. Note that two components are only required in\nthe plume beyond this radius.  The two-component model decreases the\nminimum temperature found in the region, but the change is not\ndramatic (likely due to the fine spatial binning used here).  As there\nis a similar range in temperatures seen using a two-component compared\nto a single-component model within the inner 10 kpc, this suggests\nthat the multiphase filamentary structures we observe on the sky are\nreplicated along the line of sight in this region.\n\nDespite the lack of a much wider range in temperatures, we do observe\nslightly cooler gas down to $0.7{\\rm\\thinspace keV}$ in the core when using two\ntemperature models.  The multi-temperature structure is associated with\nthe filaments and plume and appear suddenly within a radius of\n10~kpc. There is in addition evidence for a wider range of\ntemperatures when fitting models with a powerlaw temperature\ndistribution (Fig.~\\ref{fig:T_index}). Powerlaw models provide\nincreasingly good fits to the data compared to two component models\ngoing to smaller radii. The index of the powerlaw also significantly\ndecreases at a smaller radius, indicating there is relatively more gas\nat lower temperatures.  The minimum temperature in the powerlaw\ndistribution tends to drop down to $\\sim 0.5{\\rm\\thinspace keV}$, close to the\n\\emph{XMM} results.  Similar powerlaw distribution fits are also\nsupported when projection effects are removed\n(Fig.~\\ref{fig:deproj_plaw}), although no improvement in the spectral\nfit over a two-component model is seen in this case.  The\ntwo-temperature models give a range in temperature of a factor of\n$\\sim 2$ in the core, which increases to $\\sim 4$ with powerlaw\nmodels. The multi-component maps of the cluster core similarly give a\nrange of $\\sim 4$ in the core of the cluster\n(Fig.~\\ref{fig:norm_T_maps}).\n\nThe minimum temperature of the single-component, two-component and\npowerlaw models decreases roughly with radius, although the coldest\nX-ray gas is offset from the nucleus and X-ray centroid\n(Fig.~\\ref{fig:vcentre}).  We note that the X-ray filaments in\nCentaurus are coolest, densest and better defined closer towards the\nnucleus (e.g. Figs. \\ref{fig:rgb} and \\ref{fig:vcentre},\n\\ref{fig:norm_T_maps}).  Dust filaments appear to extend down to the\nradio nucleus, however (Fig.~\\ref{fig:optresid}). If the shell at the\ncentre of the cluster is a shock, they must survive it. Given the\nstructure on small scales, it is difficult to define the centre and\naccount for projection.\n\nInstead of the cool filaments being pulled out from the central galaxy\nby rising bubbles, it has been suggested that cold blobs could\ncondense out of the ICM when the ratio of the cooling to the free-fall\ntime scale drops too low \\citep{Gaspari12, McCourt13, Li15}. We can\nestimate free-fall timescale for the cluster from the X-ray data. At a\nradius $r$ the free-fall timescale is given by $t_\\mathrm{ff} =\n(2r/g)^{1/2}$. The gravitational acceleration, $g$, if the cluster is\nin hydrostatic equilibrium is given by $g = -(1/\\rho)\n\\mathrm{d}P/\\mathrm{d}r$, where $P$ is the total pressure and $\\rho$\nis the mass density. The electron pressure in the cluster is\napproximated by a powerlaw model (Fig.~\\ref{fig:deproj_EW}),\n$P_\\mathrm{e} = 0.150(r/\\mathrm{kpc})^{-0.51} {\\hbox{$\\keV{\\rm\\thinspace cm}^{-3}\\,$}}$, while the\nelectron density is approximated by $n_\\mathrm{e} =\n0.168(r/\\mathrm{kpc})^{-0.83} {\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$. Therefore the gravitational\nacceleration in the centre of the cluster is $\\sim 1.4\\times 10^{-7}\n(r/\\mathrm{kpc})^{-0.68} {\\hbox{${\\rm\\thinspace cm}\\s^{-2}\\,$}}$. The implied free-fall time closely\ntracks a 10th of the cooling time (Fig.~\\ref{fig:deproj_EW}). It is\nnot obvious from the data for this model why there should be\nmultiphase gas within a certain radius given that there is not a large\nvariation in the ratio of cooling and free-fall times.\n\nWe note that the only multiphase gas present beyond 6 kpc radius is in\nthe plume and other related cool structures\n(Fig.~\\ref{fig:maps_2T}). There is low frequency radio emission\nassociated with the plume, showing it is likely material which has\nbeen dragged out by a rising cavity. There are no cool blobs of\nmaterial outside the plume region beyond 6 kpc radius which would\nindicate general condensation at larger radius where the cooling time\nis 10 times the free-fall time.\n\n\\section{Central abundance drop}\n\\label{sect:elemabund}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig25_small.pdf}\n  \\caption{Elemental abundances (in Solar units) to the east and west\n    of the cluster core, obtained by fitting two-component or powerlaw\n    distribution \\textsc{vapec} models to deprojected\n    spectra. Analysis details are given in Appendix\n    \\ref{sect:abunddetails}.}\n  \\label{fig:elemental_profile}\n\\end{figure}\n\nPrevious work has shown a central drop in abundance in the cluster\n\\citep{SandersCent02,Panagoulia13}. Here we examine this on small\nspatial scales using these new deeper data.  The deprojected\nmetallicity profiles of different elements to the east and west of the\ncluster core are shown in\nFig.~\\ref{fig:elemental_profile}. We note, however,\n  that this analysis assumes that the phases in each radial bin have\n  the same metallicity, which may not be a valid assumption. CCD-quality data are\n  not good enough to test this assumption. To the eastern side of the\ncluster the metallicities appear to exhibit more bin-to-bin variation\nthan the west. This is also seen in metallicity profiles with finer\nbins (Fig.~\\ref{fig:deproj_EW}). This could be real, however it may be\ndue to incorrect modelling of the complex thermal structure in the\nplume or it may be because the assumption of spherical symmetry when\ndeprojecting is invalid.\n\nThe profiles are consistent with central reductions in many of the\nprobed elemental abundances (Fe, Si, S, Mg and O). In the other\nmetals, it is unclear whether the profiles are flat or declining, due\nto large measurement uncertainties or differences between the two\nmodelling approaches. We note that several of the elemental lines are\nnot clearly separated in these CCD spectra (e.g. Ni and Ne lines are\nclose to the strong Fe-L lines) and therefore they cannot be\nmeasured unambiguously. Furthermore, the O abundance is affected by\nthe choice of the absorbing column density.\n\nWe therefore confirm the central drop in metallicity in the cluster.\n\\cite{Panagoulia13} suggests that the metals are locked into dust in\nthe centre of the cluster, they are moved to larger\n  radius by feedback processes, the grains are destroyed (e.g. by\n  sputtering) and the metals returned to the hot phase. Such a\n  scenario could also explain the metallicity blobs and flat inner\n  metallicity profile (Section\n  \\ref{sect:Zstructure}). Fig.~\\ref{fig:elemental_profile} is\nconsistent with this picture, confirming that Fe, Si and S abundances\ndrop in the centre to around a third of their peak value.\nFurthermore, we also find evidence for Mg and O depletion, although\nthese metallicities have some modelling uncertainties. These are all\nmetals which can form part of dust. Unfortunately, the quality of the\ndata are insufficient to measure the central Ar abundance, which is\nunlikely be depleted by dust formation. With the aid of detailed\nmodels of dust composition it may be possible in the future to test\nthe dust deposition model in Centaurus using those elements which we\ncan measure.\n\nUpcoming X-ray observatories such as \\emph{Athena}\n\\citep{NandraAthena13} will make extremely precise measurements of the\ntemperature distribution and metallicity in the core of Centaurus and\nthose other clusters \\citep{Panagoulia15} which show central drops in\nmetallicity. \\emph{Athena} will also be able to\n  measure the metallicity of different phases independently.\n\n\\section{Conclusions}\n\\label{sect:conclusions}\nWe analysed deep new \\emph{Chandra} observations of the Centaurus\ncluster, examining the larger-scale structure, metallicity\ndistribution, cold fronts and region around the nucleus. The main\nconclusions of our paper are as follows:\n\n\\begin{enumerate}\n\\item Gradient filtering using the Gaussian gradient\n    magnitude filter is able to robustly reveal previously\n    hard-to-discern structures in X-ray images of galaxy clusters.\n\\item The correlation on larger scales of the metals with SB and\n  inverse correlation with temperature implies that the asymmetry in\n  the cluster is dominated by sloshing motions.\n\\item Enriched dusty material, uplifted by AGN activity\n    would simultaneously explain the low inner metallicities, the flat\n    inner metallicity profile in the core and the existence of 5-10\n    kpc high metallicity blobs on the western side of the cluster.\n\\item We find 7 kpc `notches' around the edge of the western cold\n  front which may be KHIs. There are strong point-to-point changes in\n  the sharpness of the cold front on $10^\\circ$ scales. In some\n  sectors the width of the edge less than or equal to the electron\n  mean free path.\n\\item We identify a 1.9-kpc-radius shell around the nucleus. This\n  could be a shock generated by an AGN outburst $\\lesssim 3.5$~Myr\n  ago. A shock may also explain why the coldest X-ray gas is offset\n  from the nucleus, though this could also be due to sloshing motions\n  in the cluster. A significant fraction of energy in bubbles has already\n  passed into ICM in the form of a higher pressure region.\n\\item Around the western cavity and to the north is a weak shock seen\n  in temperature, density and pressure. To the western side the\n  implied Mach numbers are between 1.1 and 1.4, while they are higher\n  to the north (1.6 to 2.2).\n\\item There are $\\sim 9$ depressions in X-ray SB\n  around the core of the cluster, some of which may be associated with\n  radio emission. The shock and multiple bubbles suggests that the\n  nucleus is rapidly active on $5-10$~Myr timescales.\n\\item We confirm the existence of a quasi-periodic set of SB variations,\n  which we previously claimed could be sound waves. The spacing of the\n  peaks of $\\sim 5$~kpc would imply a period of 6~Myr, if they are\n  sound waves, which is similar to the ages of the shock and\n  bubble. Alternatively, they could be generated by\n    the sloshing, consisting of projected KHIs and their associated\n    turbulence, or amplified magnetic field regions.\n\\item Around the nucleus there is filamentary multiphase X-ray gas. As\n  found previously it is spatially correlated with material at lower\n  temperatures. Fitting data with powerlaw temperature distributions\n  gives better fits in the centre, implying a continuous temperature\n  distribution over a factor of $\\sim 4$ in temperature.\n\\end{enumerate}\n\n\\section*{Acknowledgements}\nWe thank the referee E.~Roediger for helpful suggestions which\nimproved this paper. ACF, HRR and SAW acknowledge support from the ERC\nAdvanced Grant FEEDBACK. Support for this work was provided by the\nNational Aeronautics and Space Administration through Chandra Award\nNumbers G01-12156X, GO2-13149X and GO4-15121X issued by the Chandra\nX-ray Observatory Center, which is operated by the Smithsonian\nAstrophysical Observatory for and on behalf of the National\nAeronautics Space Administration under contract NAS8-03060.  The\nscientific results reported in this article are based on observations\nmade by the Chandra X-ray Observatory and data obtained from the\nChandra Data Archive.  Based on observations made with the NASA/ESA\nHubble Space Telescope, and obtained from the Hubble Legacy Archive,\nwhich is a collaboration between the Space Telescope Science Institute\n(STScI/NASA), the Space Telescope European Coordinating Facility\n(ST-ECF/ESA) and the Canadian Astronomy Data Centre (CADC/NRC/CSA).The\nNational Radio Astronomy Observatory is a facility of the National\nScience Foundation operated under cooperative agreement by Associated\nUniversities, Inc.\n\n\\bibliographystyle{mnras}\n\\bibliography{refs}\n\n\\appendix\n\\section{Data analysis}\n\\label{sect:dataanalysis}\n\n\\subsection{Initial processing}\n\n\\begin{table}\n  \\centering\n  \\caption{\\emph{Chandra} observation identifiers (OBSIDs) analysed.\n    Listed are the observation date, the full exposure time and\n    the exposure after cleaning.}\n  \\begin{tabular}{llrr}\n    OBSID  & Date       & Full (ks) & Cleaned (ks) \\\\ \\hline\n    504    & 2000-05-22 & 31.8  & 26.0 \\\\\n    505    & 2000-06-08 & 10.0  & 10.0 \\\\\n    4190   & 2003-04-18 & 34.3  & 34.1 \\\\\n    4191   & 2003-04-18 & 34.0  & 33.8 \\\\\n    4954   & 2004-04-01 & 89.1  & 85.4 \\\\\n    4955   & 2004-04-02 & 44.7  & 43.1 \\\\\n    5310   & 2004-04-04 & 49.3  & 48.7 \\\\\n    16223  & 2014-05-26 & 179.0 & 176.2 \\\\\n    16224  & 2014-04-09 & 42.3  & 41.2 \\\\\n    16225  & 2014-04-26 & 30.1  & 29.7 \\\\\n    16534  & 2014-06-05 & 55.4  & 55.0 \\\\\n    16607  & 2014-04-12 & 45.7  & 44.6 \\\\\n    16608  & 2014-04-07 & 34.1  & 33.3 \\\\\n    16609  & 2014-05-04 & 82.3  & 81.7 \\\\\n    16610  & 2014-04-27 & 17.3  & 17.1 \\\\ \\hline\n    Total  &            & 779.3 & 760.0 \\\\\n  \\end{tabular}\n  \\label{tab:obsid}\n\\end{table}\n\nThe \\emph{Chandra} Advanced CCD Imaging Spectrometer (ACIS-S)\nobservations listed in Table \\ref{tab:obsid} are examined in this\npaper. Dataset 504 was first presented in \\cite{SandersCent02} and\nobservations 5310, 4954 and 4955 were first examined in\n\\cite{Fabian05}.\nThe datasets were reprocessed with \\textsc{ciao} version 4.6\n\\citep{Fruscione06}. Bad time periods were identified by examining the\nlight curve on the ACIS-S1 CCD with 200s bins, clipping bins which\ndeviated from the standard deviation by more than $2.5\\sigma$,\nassuming Poisson errors. We excluded data from ACIS CCDs other than 6,\n7 and 8 from our observations.  For each input dataset we created\nbackground datasets using standard blank-sky background files. For\neach CCD and observation, we took the appropriate background event\nfile and removed events which occurred in bad pixels of their\nrespective observation. The backgrounds were then reprojected to match\nthe observation coordinates and attitude and their exposure times were\nchanged to match the foreground count rate in the 9-12 keV band. In\norder to make total foreground and total background spectra, it was\nnecessary to make the ratio of each background to the total background\nexposure time be the same as the ratio of the respective foreground to\nthe total foreground exposure. To do this, we reduced the exposure\ntime keywords of background event files where this was not the case,\ndiscarding random X-ray events in order to preserve the count rate.\nBefore analysis, the foreground and background event files were\nreprojected to the coordinate system of the 16223 observation.\n\nUnless otherwise specified, spectra were fit between 0.5 and 7 keV in\n\\textsc{xspec} \\citep{ArnaudXspec} 12.8.2 using an \\textsc{apec} 2.0.2\nthermal model \\citep{SmithApec01}.  We assume the relative solar\nabundances of \\cite{AndersGrevesse89}. Note that the \\textsc{apec}\nmodel fitted here was not the standard one, but was recomputed to have\ntemperature steps of 0.01 dex, rather than 0.1 dex, as the steps were\notherwise visible in radial plots of the temperature.  Galactic\nabsorption was modelled using a \\textsc{phabs} model\n\\citep{BalucinskaChurchPhabs92}, with an equivalent hydrogen column of\n$1.2\\times10^{21} {\\hbox{${\\rm\\thinspace cm}^{-2}\\,$}}$, the average of the central region if the\ncolumn is allowed to be free (note that this is not a good choice for\nthe region of the edge-on disc galaxy which contains absorbing\nmaterial, leading to incorrect results there). All deprojected\nprofiles were calculated by fitting spectra deprojected using the\n\\textsc{dsdeproj} method \\citep{SandersPer07,Russell08}.\n\nExposure maps were created using \\textsc{mkexpmap}, assuming a 3.6~keV\nspectrum with $0.7{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$ metallicity and Galactic absorption. When\ncreating images of the larger regions, we masked the edges of the CCDs\nbefore adding to remove residuals.\n\n\\subsection{Large scale spectral mapping procedure}\n\\label{sect:specmapping}\nWe used the Contour Binning algorithm \\citep{SandersBin06} to select\nregions with a minimum signal to noise ratio threshold ($S/N$). The\nalgorithm chooses bins which follow contours of SB, usually on an\nadaptively smoothed image. Bins are grown pixel by pixel until the\nthreshold is reached. A geometric constraint factor, $C$, is also applied,\nwhere a pixel is not added if its radius from the bin centroid\nis more than $C$ times the radius of a circle with the\nsame area as the bin. This constraint prevents bins becoming too\nelongated.\n\nWe examined spectra with a $S/N=100$ (i.e. $10^4$ counts for regions\nwhere the background is not significant). The input smoothed image was\nan adaptively smoothed image, created using a kernel with a minimum\nsignal to noise ratio of 60 in the 0.5 to 7 keV band. A geometric\nconstraint of $C=2$ was used in the binning. We masked out point\nsources in the X-ray image (see Section \\ref{sect:images}).\n\nFor each of the bins, each of the CCDs and each of the datasets we\nextracted foreground and background spectra and created response and\nancillary response files. We added the foreground spectra from the\nobservations for each of the bins for each CCD. The background spectra\nwere similarly summed. Spectra were grouped\nto have at least 8 counts per spectral bin.  The response and ancillary responses\nwere spatially weighted by the number of counts in the 0.5 to 7 keV\nband. For each bin and each CCD we averaged the responses, weighting\nby the number of counts in the respective foreground spectrum. The\nspectra and responses for the different CCDs were not added to avoid\ncombining data with distinct responses.\n\nWhen fitting we minimised the C-stat fit statistic.  If a bin had\nspectra from more than one CCD, they were fit simultaneously with\nadditional free parameters to account for the difference in\nnormalisation due to geometry and detector differences.\n\nThere are regions, particularly close to the nucleus, where two\ntemperature components are necessary to fit the spectra. At the\ntemperatures seen in Centaurus, two-component modelling is usually\nrequired if a single component is too narrow to fit the Fe-L complex,\nindicating that there are comparable emitting components along the\nline of sight which differ significantly in temperature. We discuss\nthis in more detail in Section \\ref{sect:thermprof} and also examine\nmodels with more components. We therefore also fit the spectra with a\nmodel with two temperature components in each bin, assuming that they\nboth have the same metallicity (it is not possible to fit for the\nmetallicities of the components separately).\n\nIt is not clear what criteria should be used to decide between single-\nor two-component models. We investigated using the F-test and\nexamining the size of the error bars on the best-fitting\ntemperatures. These criteria appeared to either select two components\nfor a number of outer regions, many with unrealistic temperatures, or\ndid not select the two-component models in all appropriate locations\nin the centre, leading to a large scatter in the metallicity. The best\ncriterion appeared to be to select two components for those regions\nwhere there was a reduction in C-stat better than 5 per cent. The\nresulting combined single- and two-component metallicity map appears\nsimilar to the two-component map, except for the level of scatter in\nregions where only one component was required.\n\n\\subsection{Western cold front edge}\n\\label{sect:frontfit}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.9\\columnwidth]{fig26_small.pdf}\n  \\caption{Regions used for examining the western cold front, shown on\n    an unsharp-masked image. 27 sectors were used for SB\n    extraction. Two sets of annular sectors to the north-west and\n    south-west were used to examine the spectra. The cross marks the\n    radio nucleus of the cluster. The box marks the centre of the\n    annuli used, which is the same as used in\n    Fig.~\\ref{fig:cfront_remap}.}\n  \\label{fig:cfrontw_reg}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=\\columnwidth]{fig27_small.pdf}\n  \\caption{Deprojected thermodynamic profiles across the western cold\n    front in the north-west and south-west directions\n    (Fig.~\\ref{fig:cfrontw_reg}). Plotted are the temperature,\n    metallicity, electron density, electron pressure, electron entropy\n    and mean radiative cooling time. The vertical line marks the cold\n    front radius. The outer three bins are not shown due to edge\n    effects giving oscillating values.}\n  \\label{fig:cfront_spectra}\n\\end{figure}\n\nWe examined deprojected spectra across the western cold front in two\ndifferent sectors (Fig.~\\ref{fig:cfrontw_reg}), where the edge is\nclearest towards the north- and south-west, obtaining the profiles in\nFig.~\\ref{fig:cfront_spectra}. There are jumps in temperature and\ndensity (in opposite directions) by 20 per cent at the edge, leading\nto a continuous pressure distribution, confirming that the feature is\na cold front. The entropy reduces by 25--30 per cent in the inward\ndirection. Despite the clear correlations between the edges and\nmetallicity (Fig.~\\ref{fig:subav_prof}), we do not see the change in\nmetallicity at the edge in the deprojected profiles.\n\nTo examine the SB profiles in detail around the edge,\nexposure-corrected background-subtracted profiles were extracted\nin the 0.5 to 4 keV band, with 0.492-arcsec binning between\nradii of 1.7 and 4.5 arcmin (Fig.~\\ref{fig:cfrontw_reg}). This band is\nlargely sensitive to the density (varying the temperature from 2.5 to\n3 keV leads to a 10 per cent variation in count rate).\n\nWe took an emissivity model in which there are two powerlaws which\njump at a particular radius. The radius of the jump, the jump ratio\n(the emissivity ratio outside divided by that inside), the powerlaw\nindices and the overall model normalisation are free parameters.  We\nallowed for broadening of the edge by interpolating between the two\npowerlaw models using the integral of a Gaussian with a variable\n$\\sigma$. This emissivity profile was projected on the sky assuming\nspherical symmetry, integrating the emissivity profile between 1 and 7\narcmin radius in 0.246~arcsec (half pixel) steps. The model was then\nconvolved with the PSF in the radial direction at the edge for each\nsector. The PSF was calculated using \\textsc{saotrace} 2.0.4 and\n\\textsc{marx} 5.1.0 assuming a 3~keV spectrum with $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$\nmetallicity. The model was then resampled to have the same binning as\nthe data.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8\\columnwidth]{fig28_small.pdf}\n  \\caption{SB profiles in the 0.5 to 4 keV band across\n    the western cold front in 27 $10^\\circ$ sectors (depicted in\n    Fig.~\\ref{fig:cfrontw_reg}) from the north-east (top-left) through\n    west to the south-east (bottom-right) in 0.984 arcsec bins. The\n    0.492-arcsec-binned profiles were fitted within 40 kpc by a model\n    in which the emissivity is a powerlaw which jumps to a second\n    powerlaw at some radius, with the edge broadened by a\n    Gaussian. The solid area shows the $1\\sigma$ model uncertainties.}\n  \\label{fig:cfront_profiles}\n\\end{figure}\n\nWe applied this model to the data and examined the allowed range of\nparameter values using the \\textsc{emcee} \\citep{ForemanMackey12}\nMarkov Chain Monte Carlo (MCMC) \\textsc{emcee} code, which uses an\naffine-invariant sampler \\citep{Goodman10}.  We force the jump radius\nto lie between 1.9 and 3 arcmin, the powerlaw indices to lie between\n$-4$ and $0.5$, the jump ratio to lie between 0.01 and 2 (smaller\nvalues are larger jumps) and the Gaussian $\\sigma$ to be between 0.001\nand 1 arcmin (the log value of $\\sigma$ was varied in the MCMC). In\nthe MCMC analysis we used $\\chi^2$ likelihoods, 400 walkers, a burn in\nperiod of 1000 and a chain length of 1000.  The data were fit only\ninside a radius of 40 kpc, as in several sectors, particularly to the\nnorth, there is a SB break at this radius. We also investigated models\nwhich also included this break, fitting the data out to 57 kpc\nradius. The results from this more complex model are in reasonable\nagreement to those those presented here. In our analysis we found that\nthe outer powerlaw index was affected by the outer integration\nradius. Reducing the outer radius to 6 arcmin decreases the index by\n0.2--0.5.  The median models and the surrounding $1\\sigma$ percentiles\nare shown as shaded regions in Fig.\\ref{fig:cfront_profiles}. The\nparameters from the fits are plotted in\nFig.~\\ref{fig:cfront_fit_params}. We also did the analysis with twice\nthe number of sectors, finding consistent results. The radius results\nare plotted in Fig.~\\ref{fig:cfront_fit_params}, showing that the\nvariation in radius seen in the 27 bin results is real.\n\n\\subsection{Metallicity fluctuations}\n\\label{sect:zfluctdetails}\nSpectra from regions X and Y (Fig.~\\ref{fig:highZ}) were extracted and\nfit with single and two-component \\textsc{vapec} thermal models\n(connecting the metallicity between the two components). Some of the\nemission in the regions could come from projected cluster emission. To\nattempt to account for this we extracted a background spectrum from an\nadjacent part of the cluster outside the bright western region. We fit\nthe spectra using this background and secondly using a standard\nblank-sky background spectrum, between 0.5 and 8 keV. As the\ntwo-component model temperatures were not always well\nconstrained, we conducted a MCMC analysis to better explore the\nallowed parameter space using \\textsc{xspec\\_emcee}\n(\\url{https://github.com/jeremysanders/xspec\\_emcee}), applying 400\nwalkers, a burn-in period of 1000 and a chain length of 1000\niterations. The temperature values were assumed to lie between 0.15\nand 20~keV. We allowed the O, Ne, Mg, Si, S, Ar, Ca, Fe and Ni\nmetallicities to be free and fixed others to Solar values. The error\nbar shows the $1\\sigma$ percentiles from the chain, while the point\nshows the median.\n\n\\subsection{Central spectral maps}\n\\label{sect:speccentredetails}\nWe constructed detailed thermodynamic maps of the central region\n(Fig.~\\ref{fig:centre_spec_maps}) using $S/N=20$ spatial bins\n(i.e. 400 counts where the background is not significant). The mapping\nwas based on an adaptively smoothed image using a kernel with a\nminimum signal to noise ratio of 30 and applying a geometric\nconstraint of $C=3$, only examining a central $4.2 \\times 4.2$ arcmin\n($54\\times 54$ kpc) box. We extracted spectra from\nthe background observations using this box. These background spectra for\neach observation were also added, first artificially lowering the\nexposure of background spectra (discarding events and reducing\nexposure time correspondingly) so that the ratio of each background to\nthe total was the same as the respective foreground observation to\ntotal. We used a central response and ancillary response matrix for\nall regions examined. We note that the \\textsc{xspec} normalisation is\nproportional to the emission measure and defined in \\textsc{xspec} to\nbe $10^{-14} \\int n_\\mathrm{e} n_\\mathrm{H} \\mathrm{d}V / (4\\pi\nD_A^2[1+z]^2)$, where the cluster lies at a redshift $z$ and angular\ndiameter distance of $D_A$~cm, the electron and hydrogen densities are\n$n_\\mathrm{e}$ and $n_\\mathrm{H} {\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$, respectively and are\nintegrated over a volume $V{\\hbox{${\\rm\\thinspace cm}^3\\,$}}$.\n\nNote that the assumption of constant absorbing column density\nwhere there are dust lanes in the centre of NGC 4696 where this\nassumption is likely to be invalid. The metallicity was fixed to\n$1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$, an average value for the central region excluding where\nmulti-component models are preferred. Fixing the metallicity allows us\nto fit single temperature models to the data where multi-temperature\nmodels may be required (see Section \\ref{sect:thermprof}), obtaining\naverage projected temperatures and normalisations which are not biased\nby unrealistic best fitting metallicities.\n\n\\subsection{Inner cavity profiles}\n\\label{sect:innercavity}\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig29_small.pdf}\n  \\caption{Regions examined to measure the ICM properties around the\n    western inner cavity (W) and for comparison to the north (N) and\n    south (S). The radio nucleus is marked with a `$\\times$'. The\n    centre of the sectors is marked by a `+'. The X-ray image is\n    unsharp-masked, subtracting 0.5 of the 0.5 to 7 keV image\n    smoothed by 7.9 arcsec from the image smoothed by 1 arcsec.}\n  \\label{fig:cavity_reg}\n\\end{figure}\n\nWe extracted deprojected spectra in annuli from a sector outwards from\nthe western inner cavity (labelled B in\nFig.~\\ref{fig:centre_spec_maps}). To better match the morphology of\nthe inner region, we chose a centre which is that of a circle which\ncircumscribes the outer edges of the two inner cavities (A and B). For\ncomparison we also examine sectors to the north and south, avoiding\nthe plume to the east.  Fig.~\\ref{fig:cavity_reg} shows the regions\nanalysed. The spectra were fitted with single component models, with\nthe metallicity fixed to $1.2{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$.\n\n\\subsection{Deprojected central spectra}\n\\label{append:deprojcentre}\nThe spectra were extracted from $180^\\circ$ east and west sectors or\ncomplete annuli, excluding point sources. The centre used\nwas the X-ray centroid of the central region, as in Appendix\n\\ref{sect:thermprofscentre}.  We fit both single- and two-component\n\\textsc{apec} models to the deprojected spectra (minimising the\n$\\chi^2$). To fully explore the parameter space we ran a MCMC analysis\non each deprojected spectrum. The two-component results are only shown\nin Fig.~\\ref{fig:deproj_EW} if both temperatures can be constrained to\n20 per cent. From the MCMC chains containing normalisation,\ntemperature and metallicity, the density, entropy, pressure and mean\nradiative cooling time were computed. To compute the two-component\nresults the assumption that the components are in pressure equilibrium\nwas made. In the plot, we also compare projected thermodynamic data\npoints from Fig. \\ref{fig:therm_r_X}.\n\n\\subsection{Elemental abundances}\n\\label{sect:abunddetails}\nThe metallicity profiles were obtained by fitting deprojected spectra,\nextracted from $180^\\circ$ sectors to the east and west.  To increase\nthe signal to noise, the radial bins used here are twice as wide in\nthe centre as in Fig.~\\ref{fig:deproj_EW}. To properly account for the\ncomplex temperature distribution we used two-component and powerlaw\n\\textsc{vapec} models. In our analysis Fe, Si, S, Mg, Ni, O, Ne, Ar\nand Ca abundances were allowed to vary. C, N and Al metallicities were\ntied to Fe. The same metallicities were assumed in all thermal\ncomponents in a radial bin. Input spectra were fit between 0.5 and 7\nkeV, minimising the $\\chi^2$ statistic. Metallicities were allowed to\nvary between 0 and $8{\\hbox{$\\thinspace \\mathrm{Z}_{\\odot}$}}$ and temperatures were allowed to vary\nbetween between 0.1 and 20 keV. The $1\\sigma$ error bars shown were\ncalculated by varying the parameter until the minimum $\\chi^2$\nincreased by 1.0. A MCMC analysis produced very similar results,\nthough we show the results from the simple analysis here.\n\n\\section{Central thermal structure}\n\\label{sect:thermprofscentre}\nWe constructed profiles of the temperature (Fig. \\ref{fig:T_radius})\nfrom maps with $S/N=40$ inside 10.5 kpc radius and $S/N=100$ at larger\nradii (the radius was measured from the X-ray centroid, marked in\nFig.~\\ref{fig:vcentre}, at 192.204 and Dec -41.3125, not from the\nradio nucleus).  One aspect which is different to the procedure used in\nSection \\ref{sect:maps}, is that in the\ntwo-component plot the temperatures of the two-component fit are only\nshown if they can be constrained to better than 20 per cent, otherwise\nthe single component result is shown.  The single component fits show\nthat the temperatures in the centre split into hotter (at high angles)\nand colder (at low angles) branches, where the colder branch is the\ncool central plume.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{fig30_small.pdf}\n  \\caption{Radial profile of the temperatures in bins with a signal to\n    noise ratio of 40 (inside the radius of $\\sim 20$~kpc marked by\n    the dotted line) or 100 (outside that radius). The points are\n    coloured according to their angle (angles are measured from the\n    west, with positive values northwards). The radius is measured\n    from the central radio source. The top panel shows a single\n    component fit to the spectra. The bottom panel shows the two\n    temperatures for a two-component fit, if the temperatures of the\n    two components can be constrained to better than 20 per cent,\n    otherwise the single-component fit results are shown. Error bars\n    are shown only for every 10th point.}\n  \\label{fig:T_radius}\n\\end{figure}\n\nAlthough we are fitting projected spectra from regions on the sky, we\ncan compute projected versions of the other thermodynamic properties\nusing geometric assumptions. Here we assume that the line of sight\ndepth of a region is the radius of the region.  This assumption, which\nwe test below, allows the normalisation to be converted to a projected\nelectron density, $n_\\mathrm{e,proj}$. The electron pressure is\ncomputed as $P_\\mathrm{e,proj} = n_\\mathrm{e,proj} \\mathrm{k}T$, where\n$\\mathrm{k}T$ is the temperature in keV. The entropy is\n$K_\\mathrm{e,proj} = n_\\mathrm{e,proj}^{-2/3} \\mathrm{k}T$. We also\ncalculate a mean radiative cooling time $t_\\mathrm{cool,proj}$ by\ndividing the enthalpy of a unit cube of gas in the cluster, $H$, by\nits emissivity calculated using an \\textsc{apec} model. The enthalpy\nis $H=(5/2)\\: \\mathrm{k}T n_\\mathrm{e,proj}\\: (1+1/X_\\mathrm{e/H})$,\nwhere $X_\\mathrm{e/H} \\sim 1.2$ is the ratio of the number of\nelectrons to Hydrogen nuclei in a fully ionised plasma.\n\nFor the two-component fits, we assume that both components come from\nthe same volume but they are in pressure equilibrium with each\nother. In this case, the electron density for component 1, in\n${\\hbox{${\\rm\\thinspace cm}^{-3}\\,$}}$, is given by\n\n", "index": 3, "text": "\\begin{equation}\n  n_\\mathrm{e,proj,1} = \\left(\n    \\left[ N_1 + N_2 \\frac{T_2^2}{T_1^2} \\right]\n    \\frac{4\\pi D_A^2[1+z]^2}{10^{-14} \\: V} X_\\mathrm{e/H}\n  \\right) ^{1/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"n_{\\mathrm{e,proj,1}}=\\left(\\left[N_{1}+N_{2}\\frac{T_{2}^{2}}{T_{1}^{2}}\\right%&#10;]\\frac{4\\pi D_{A}^{2}[1+z]^{2}}{10^{-14}\\&gt;V}X_{\\mathrm{e/H}}\\right)^{1/2},\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mrow><mi mathvariant=\"normal\">e</mi><mo>,</mo><mi>proj</mi><mo>,</mo><mn>1</mn></mrow></msub><mo>=</mo><msup><mrow><mo>(</mo><mrow><mrow><mo>[</mo><mrow><msub><mi>N</mi><mn>1</mn></msub><mo>+</mo><mrow><msub><mi>N</mi><mn>2</mn></msub><mo>⁢</mo><mfrac><msubsup><mi>T</mi><mn>2</mn><mn>2</mn></msubsup><msubsup><mi>T</mi><mn>1</mn><mn>2</mn></msubsup></mfrac></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>D</mi><mi>A</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup></mrow><mrow><mpadded width=\"+2.2pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>14</mn></mrow></msup></mpadded><mo>⁢</mo><mi>V</mi></mrow></mfrac><mo>⁢</mo><msub><mi>X</mi><mrow><mi mathvariant=\"normal\">e</mi><mo>/</mo><mi mathvariant=\"normal\">H</mi></mrow></msub></mrow><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}]