[{"file": "1601.01193.tex", "nexttext": "\nIf the function is defined at the semi-integer points $x_n=(n-1/2)h$, the derivative is computed using the\n\n", "itemtype": "equation", "pos": 9778, "prevtext": "\n \n\n\n\n\\title{Variational Data Assimilation for Optimizing\nBoundary Conditions in Ocean Models  }\n\\author{ Christine Kazantsev\\thanks{\n Universite Grenoble Alpes, Laboratoire Jean Kuntzmann,  Grenoble, France },\n Eugene Kazantsev\\thanks{INRIA, Laboratoire Jean Kuntzmann, Grenoble, France   },\nMikhail A. Tolstykh\\thanks{Institute of Numerical Mathematics, Russian Academy of Sciences and \nHydrometeorological Research Center of the Russian Federation, Moscow, Russia}\n}\n\\date{}\n\n\\maketitle \n\n\n\\begin{abstract}\nThe review describes the development of ideas Gury Ivanovich Marchuk in the field of variational data assimilation for ocean models applied in particular in coupled models for long-range weather forecasts. Particular attention is paid to the optimization of boundary conditions on rigid boundaries. As idealized and realistic model configurations are considered. It is shown that the optimization allows us to determine the most sensitive model operators and bring the model solution closer to the assimilated data. \n\\end{abstract}\n\n{\\bf Keywords:} Variational data assimilation, boundary conditions, ocean model, long-range weather forecasting\n\n{\\bf DOI:} 10.3103/S1068373915060047\n\n\\section{Introduction}\n\nWe met G.I. Marchuk in 1990; at that time one of us started working in the Institute of Numerical Mathematics of Academy of Sciences of the USSR, another one was a postgraduate student in that institute, and\nthe third one was on probation in the institute after the thesis defense. By that time G.I. Marchuk had left the\npost of the President of Academy of Sciences of the USSR and had an opportunity to pay more attention to\nthe activities of the institute. We were amazed how quickly he could gain an understanding of a paper or a\nreport even if they touched a subject being new for him.\n\nG.I. Marchuk freely shared his experience of a researcher and human. For example, one of his recommendations was to change the research subject every few years. He made this himself: the scope of his scientific interest ranged from the modeling of nuclear reactors to immunology. The results of his studies in\neach area formed a book. His monographs included only new information that had never been published\nbefore. Each monograph is a book of new ideas, explanations, and computations.\n\nOne of the lectures by G.I. Marchuk in Institute Elie Cartan in Nancy dealt with the theory of optimum\ncontrol, adjoint operators, and theory of perturbations. He worked a lot on the methods of the solution of inverse problems, especially of complex ones for nonlinear systems of equations. In the middle of the 1970s\nin [1, 44] he formulated the theory of perturbations for solving such problems and 20 years later [2, 4] told\nhow this theory was developed by him and his followers.\n\nThe followers of G.I. Marchuk used the theory of perturbations for initializing atmospheric models by\nsolving the problem of optimum combination of the data obtained from the model and from observations\n[5, 6, 45]. Soon after that, based on the papers by G.I. Marchuk and his friend J.-L. Lions on the optimum\ncontrol [37], French scientists also used adjoint equations for working out the variational algorithms of assimilation of meteorological data and for optimizing the initial conditions of atmospheric models [31, 33].\n\n\nBy the late 1980s--early 1990s, many research teams including both mathematicians and geophysicists\nwere involved into the development of new methods of data assimilation and solution of inverse problems\n[3, 18, 38, 46, 47] as well as into the use of these methods in the models of the ocean and atmosphere [13,36, 49, 56]. This resulted in considerable increase in the reliability of the weather forecast [23]. In the second half of the 1990s, the European Center for Medium-Range Forecasting (ECMWF), Met Office, Meteo\nFrance, and many other centers started the operational use of the practical implementation of the theory and\nmethods of data assimilation.\n\n\nThe models of the atmosphere with the fixed sea surface temperature and sea ice concentration have\nbeen commonly used for the short- and medium-range numerical weather prediction. In the world the probabilistic long-range weather forecasting mainly use the coupled models of the atmosphere, ocean, sea ice,\nand active soil layer [15]. For example, in ECMWF and Met Office, the NEMO ocean model is used jointly\nwith the corresponding models of the atmosphere (http://www.nemo-ocean.eu/) [54]. This model is described in detail in [43] and is widely used by the European community, in particular, in the coupled models\nintended for the long-range weather forecasting.\nRecent studies have demonstrated that the use of coupled models is essential for the medium-range and\neven short-range forecasting at high latitudes [50]. This is also associated with the role of polynyas in the\nformation of mesoscale polar cyclones. Currently the leading centers, ECMWF and Met Office, are planning to carry out the operational implementation of the coupled model for the medium-range forecasting.\n\nDue to the limited number of observations in the ocean, the ocean models were traditionally tested only\nfor the simulation of certain integral characteristics. The use of the oceanâ\u0080\u0093atmosphere coupled models for\nthe weather forecasting dictates the heightened (as compared to the climate models) requirements to the accuracy of the simulation of the fields of sea surface temperature and sea ice concentration. Therefore, the\ndevelopment of the system of observational data assimilation for the optimization of conditions on rigid\nboundaries for the ocean models considered in the present paper is also an important issue for the systems\nof numerical weather prediction, especially because the coupled oceanâ\u0080\u0093atmosphere model intended for the\nlong-range weather forecasting is developed in Russia [7].\n\n\nIt should be noted that the assimilation of observational data was first of all aimed at the optimization of\nthe initial conditions of models. As demonstrated in [39], the solution of the nonlinear model is extremely\nsensitive to initial data and the small error in their estimate may increase exponentially. This fact attracted\nattention to studying the resistance of the solutions of geophysical models to inaccuracies in initial conditions and defined the follwing main objective of data assimilation: the three- and four-dimensional analysis\nof the fields of meteorological and oceanic data in order to agree them with the model and use subsequently\nas initial data for the model.\n\nCertainly, it is doubtless that the solution of the nonlinear model is highly sensitive to initial conditions.\nHowever, one can suppose the same or even higher sensitivity of the solution to the other parameters of the\nmodel such as the diffusion coefficient, underlying surface approximation, the parameterization of subgrid\nprocesses, the description of near-continent areas in the ocean models, and other internal parameters of the\nmodel. In fact, the strong dependence of model currents on boundary conditions was noted in [8, 57], on\nbottom topography approximation, in [17, 22, 41], on diffusion coefficients, in [11], and on fundamental\nparameterizations such as the Boussinesq approximation and hydrostatics, in [40]. The sensitivity of the\nshallow water model to different parameters is analyzed in [30]. The theoretical and practical features of the\nuse of adjoint equations for assessing the parameters of geophysical models are discussed in [48]; however,\nthe comparatively small number of papers deal with data assimilation for the purpose of specifying or\noptimizing the model parameters that differ from initial conditions. Several attempts can be cited of the use\nof variational methods for optimizing bottom topography [25, 42] and for controlling the open boundary\nconditions of regional ocean models [52, 53, 55]; however, the number of such papers is much smaller than\nthat of the papers dealing with the optimization of the modelâ\u0080\u0099s initial conditions.\n\n\\section{ Assimilating data to bring together a model and its boundary conditions. }\n\nLet us dwell in more detail on the variational data assimilation in order to coordinate the model with its\nboundary conditions on rigid boundaries. Special attention is paid to the situations with pronounced boundary layers because in this case the strongest dependence of the model solution on the approximation of\nboundary conditions is observed.\n\nThe optimization of boundary conditions using adjoint equations has already been used for simple systems. For example, the optimum control of conditions is described in [12, 19] for the linear heat equation, in\n[34, 35], for the Burgers equation, and in [32], for the nonlinear balance equation. In [26] it was proposed to\ncontrol the discretization at the boundary points of the differential operator that uses them. The proposal\nfollowed from the result [35] demonstrating that the approximation of nontrivial boundary conditions\nshould follow several rules in order to provide the needed order of approximation and the remainder. Indeed, the information about boundary conditions comes to the model through the specific discretization of\noperators near the boundary. Control over this discretization allows one, on the one hand, to control the\nconditions and, on the other hand, to control their approximation to the model grid.\n\nLet us suppose that the derivative operator at the staggered grid for the function and its derivative is defined at $x > 0$ and the certain boundary condition is formulated at the point $x = 0$. Then, if the function is defined at the integer points $x_n=nh$  ($n$ is an integer number), let us use the following formula for computing\nthe value of the derivative near the boundary:\n\n\n\n", "index": 1, "text": "\\begin{equation}\n\\biggl({\\fr{ \\textstyle \\partial {u}}{ \\textstyle \\partial {x}}}\\biggr)_{x=h/2}= {\\frac{ \\textstyle { \\alpha_0+\\alpha_1 u(0)+\\alpha_2 u(h) }}{ \\textstyle {h}}}\n\\label{s0}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\biggl{(}{\\fr{\\textstyle\\partial{u}}{\\textstyle\\partial{x}}}\\biggr{)}_{x=h/2}=%&#10;{\\frac{\\textstyle{\\alpha_{0}+\\alpha_{1}u(0)+\\alpha_{2}u(h)}}{\\textstyle{h}}}\" display=\"block\"><mrow><msub><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\fr</mtext></merror><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>u</mi></mrow><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mi>x</mi><mo>=</mo><mrow><mi>h</mi><mo>/</mo><mn>2</mn></mrow></mrow></msub><mo>=</mo><mfrac><mrow><msub><mi>α</mi><mn>0</mn></msub><mo>+</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mi>h</mi></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01193.tex", "nexttext": "\n\nAs clear, any boundary conditions including the inhomogeneous ones can be taken into account by\nselecting the corresponding set of coefficients  $\\alpha$. For example, the condition $u(0)=A$ will be taken into\naccount and approximated with the second order of accuracy by selecting $\\alpha_0=-A,\\; \\alpha_1=0,\\; \\alpha_2=1$ in\nformula  {(\\ref{{s0}})} and  $\\alpha_0=-2A,\\; \\alpha_1=2,\\; \\alpha_2=0$ in formula {(\\ref{{s1}})}.\n\nIn view of the fact that the grid with staggered points is used, the problem solution requires interpolation\nfrom integer to semi-integer points and vice versa. Interpolations at the boundary points should also take\naccount of boundary conditions; therefore, their discretization is carried out in a similar way by constructing the linear combinations of function values with coefficients $\\alpha$ (that certainly differ from those used for\nthe discretization of derivatives).\n\nThus, the discrete approximation of derivatives and interpolation at the boundary points \nis presented in\nthe form of the linear combinations of the function values with coefficients $\\alpha$. On varying these coefficients\nin the process of data assimilation, the cost function is minimized and the optimized values of these coefficients are found.\n\n\n\nAll coefficients  $\\alpha$ are considered as independent variables. The specific set is used for each model parameter and each operator even if boundary conditions are identical because the approximation of identical\nconditions to the grid may differ. Moreover, different sets of  $\\alpha$ are used at the different points of the\nboundary of two- or three-dimensional domain and the additional degrees of freedom are given for the\nspatial approximation of the boundary.\n\nPapers [26, 29] analyzed the optimization of coefficients  $\\alpha$ in the process of the assimilation of the exact\nsolutions of the one-dimensional wave equation and linear shallow water model; the following conclusions\nwere made.\n\n\\begin{itemize}\n\\item The data assimilation used for controlling the operator discretization at the boundary points enables\none to compensate the errors of the numerical scheme and bring the numerical solution much closer to the\ndata having decreased the cost function by three or four orders; \n\\item The adjoint equation and adjoint model turn out to be by 2â\u0080\u00933 times longer than the adjoint model for\noptimizing the initial conditions. This is manifested in the number of the code lines and in the computer\ntime needed for its computation and determines the heightened interest to the use of the procedures of the\nautomatic differentiation of the initial model code. It should be noted that at the differentiation of the complete models of the atmosphere or ocean, the obtained code of the adjoint model is to be optimized, especially in order to reduce its requirements to the main storage. An example of such optimization using the\nTAPENADE differentiator [21] is given in [28]; there the storage requirements were lowered by 25 times.\n\\item  The control of operator discretization may lead to the non-uniqueness of the result and to the existence of the nonzero core and does not allow its use for identifying boundary conditions as parameters in\nthe general case.\n\\item Such control may result in the failure of physical hypotheses made in the process of the model construction. For example, in the case of the one-dimensional wave equation, the initial geometry of domains\nin the shallow water model was changed not quite soundly in order to compensate the errors of the numerical scheme inside the domain.\n\\end{itemize}\n\nThus, the control of operator discretization at the boundary points can indicate a simple way of bringing\nthe model solution closer to the data. However, such control needs the additional analysis of the results\nfrom the point of view of uniqueness and physical acceptability of obtained approximations.\n\n\nIn [27, 28], the optimization of coefficients a was carried out for the NEMO (Nucleus for European\nModelling of the Ocean) European ocean model [43]. The core of this model is equations for two\ncomponents of velocity, for temperature and salinity, and for sea surface height. The use of the hydrostatic\napproximation causes the fact that the vertical velocity is a diagnostic variable.\n\n\nLet us start the experiments with the NEMO model with the simplified configuration: the rectangular\nparallelepiped with the size of $30{^\\circ}$  along the longitude, $20{^\\circ}$ along the latitude, and 4195 m along the vertical\n(depth). The horizontal resolution of the grid is  $0.25{^\\circ}$. As to the vertical, all the depth is divided into four\nlayers of equal thickness. Thus, the grid consists of $120{\\times} 80{\\times} 4$  points for every model variable. The model\nis discretized at the three-dimensional analog of the Arakawa C-grid [9].\n\nThe wind friction stress is applied to the sea surface and is defined by the formula:\n\n", "itemtype": "equation", "pos": 10088, "prevtext": "\nIf the function is defined at the semi-integer points $x_n=(n-1/2)h$, the derivative is computed using the\n\n", "index": 3, "text": "\\begin{equation}\n\\biggl({\\fr{ \\textstyle \\partial {u}}{ \\textstyle \\partial {x}}}\\biggr)_{x=0}= {\\frac{ \\textstyle { \\alpha_0+\\alpha_1 u(h/2)+\\alpha_2 u(3h/2) }}{ \\textstyle {h}}}\n\\label{s1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\biggl{(}{\\fr{\\textstyle\\partial{u}}{\\textstyle\\partial{x}}}\\biggr{)}_{x=0}={%&#10;\\frac{\\textstyle{\\alpha_{0}+\\alpha_{1}u(h/2)+\\alpha_{2}u(3h/2)}}{\\textstyle{h}}}\" display=\"block\"><mrow><msub><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\fr</mtext></merror><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>u</mi></mrow><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mi>x</mi><mo>=</mo><mn>0</mn></mrow></msub><mo>=</mo><mfrac><mrow><msub><mi>α</mi><mn>0</mn></msub><mo>+</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>h</mi><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mi>h</mi></mrow><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mi>h</mi></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01193.tex", "nexttext": "\nThe conditions of impermeability and slipping are used on the lateral boundaries:\n\n", "itemtype": "equation", "pos": 15218, "prevtext": "\n\nAs clear, any boundary conditions including the inhomogeneous ones can be taken into account by\nselecting the corresponding set of coefficients  $\\alpha$. For example, the condition $u(0)=A$ will be taken into\naccount and approximated with the second order of accuracy by selecting $\\alpha_0=-A,\\; \\alpha_1=0,\\; \\alpha_2=1$ in\nformula  {(\\ref{{s0}})} and  $\\alpha_0=-2A,\\; \\alpha_1=2,\\; \\alpha_2=0$ in formula {(\\ref{{s1}})}.\n\nIn view of the fact that the grid with staggered points is used, the problem solution requires interpolation\nfrom integer to semi-integer points and vice versa. Interpolations at the boundary points should also take\naccount of boundary conditions; therefore, their discretization is carried out in a similar way by constructing the linear combinations of function values with coefficients $\\alpha$ (that certainly differ from those used for\nthe discretization of derivatives).\n\nThus, the discrete approximation of derivatives and interpolation at the boundary points \nis presented in\nthe form of the linear combinations of the function values with coefficients $\\alpha$. On varying these coefficients\nin the process of data assimilation, the cost function is minimized and the optimized values of these coefficients are found.\n\n\n\nAll coefficients  $\\alpha$ are considered as independent variables. The specific set is used for each model parameter and each operator even if boundary conditions are identical because the approximation of identical\nconditions to the grid may differ. Moreover, different sets of  $\\alpha$ are used at the different points of the\nboundary of two- or three-dimensional domain and the additional degrees of freedom are given for the\nspatial approximation of the boundary.\n\nPapers [26, 29] analyzed the optimization of coefficients  $\\alpha$ in the process of the assimilation of the exact\nsolutions of the one-dimensional wave equation and linear shallow water model; the following conclusions\nwere made.\n\n\\begin{itemize}\n\\item The data assimilation used for controlling the operator discretization at the boundary points enables\none to compensate the errors of the numerical scheme and bring the numerical solution much closer to the\ndata having decreased the cost function by three or four orders; \n\\item The adjoint equation and adjoint model turn out to be by 2â\u0080\u00933 times longer than the adjoint model for\noptimizing the initial conditions. This is manifested in the number of the code lines and in the computer\ntime needed for its computation and determines the heightened interest to the use of the procedures of the\nautomatic differentiation of the initial model code. It should be noted that at the differentiation of the complete models of the atmosphere or ocean, the obtained code of the adjoint model is to be optimized, especially in order to reduce its requirements to the main storage. An example of such optimization using the\nTAPENADE differentiator [21] is given in [28]; there the storage requirements were lowered by 25 times.\n\\item  The control of operator discretization may lead to the non-uniqueness of the result and to the existence of the nonzero core and does not allow its use for identifying boundary conditions as parameters in\nthe general case.\n\\item Such control may result in the failure of physical hypotheses made in the process of the model construction. For example, in the case of the one-dimensional wave equation, the initial geometry of domains\nin the shallow water model was changed not quite soundly in order to compensate the errors of the numerical scheme inside the domain.\n\\end{itemize}\n\nThus, the control of operator discretization at the boundary points can indicate a simple way of bringing\nthe model solution closer to the data. However, such control needs the additional analysis of the results\nfrom the point of view of uniqueness and physical acceptability of obtained approximations.\n\n\nIn [27, 28], the optimization of coefficients a was carried out for the NEMO (Nucleus for European\nModelling of the Ocean) European ocean model [43]. The core of this model is equations for two\ncomponents of velocity, for temperature and salinity, and for sea surface height. The use of the hydrostatic\napproximation causes the fact that the vertical velocity is a diagnostic variable.\n\n\nLet us start the experiments with the NEMO model with the simplified configuration: the rectangular\nparallelepiped with the size of $30{^\\circ}$  along the longitude, $20{^\\circ}$ along the latitude, and 4195 m along the vertical\n(depth). The horizontal resolution of the grid is  $0.25{^\\circ}$. As to the vertical, all the depth is divided into four\nlayers of equal thickness. Thus, the grid consists of $120{\\times} 80{\\times} 4$  points for every model variable. The model\nis discretized at the three-dimensional analog of the Arakawa C-grid [9].\n\nThe wind friction stress is applied to the sea surface and is defined by the formula:\n\n", "index": 5, "text": "$$\n\\tau_\\phi=0, \\quad \\tau_\\lambda=-0.1{\\frac{ \\textstyle {N}}{ \\textstyle {m^2}}}{\\times} {\\frac{ \\textstyle {\\cos(\\pi(\\phi-24{^\\circ}))}}{ \\textstyle {44{^\\circ}-24{^\\circ}}}}, \\label{forc}\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\tau_{\\phi}=0,\\quad\\tau_{\\lambda}=-0.1{\\frac{\\textstyle{N}}{\\textstyle{m^{2}}}%&#10;}{\\times}{\\frac{\\textstyle{\\cos(\\pi(\\phi-24{{}^{\\circ}}))}}{\\textstyle{44{{}^{%&#10;\\circ}}-24{{}^{\\circ}}}}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>τ</mi><mi>ϕ</mi></msub><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msub><mi>τ</mi><mi>λ</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><mrow><mn>0.1</mn><mo>⁢</mo><mfrac><mi>N</mi><msup><mi>m</mi><mn>2</mn></msup></mfrac></mrow><mo>×</mo><mfrac><mrow><mi>cos</mi><mrow><mo stretchy=\"false\">(</mo><mi>π</mi><mrow><mo stretchy=\"false\">(</mo><mi>ϕ</mi><mo>-</mo><mn>24</mn><mmultiscripts><mo stretchy=\"false\">)</mo><mprescripts/><none/><mo>∘</mo></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>44</mn><mmultiscripts><mo>-</mo><mprescripts/><none/><mo>∘</mo></mmultiscripts><mn>24</mn><msup><mi/><mo>∘</mo></msup></mrow></mfrac></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01193.tex", "nexttext": "\n(where $\\vec{U}=(u,v)$ is the vector of horizontal velocity and $\\vec n, \\vec{\\tau} $ are the normal and tangent to the domain\nboundary.\n\n\nThis academic configuration is of special interest for studying the effects of boundary conditions and\ntheir approximation on the model solution in the presence of strongly pronounced boundary layers. The\nnon-triviality of the approximation of boundary conditions is clearly manifested in the experiment when the\ngrid is not parallel to the parallelepiped walls. In this case, especially in the presence of boundary layers, the\nwhole solution turns out to be strongly depending on how the domain boundaries are approximated by the\ngrid. This problem has been actively investigated in recent 15 years (for example, [8, 16, 20]); however, no\nrecommendation have been made so far on the approximation of such boundaries for finding the reasonable\nsolution in the general case.\n\nThis problem is rather important in oceanography because the continental margins most often do not coincide with the grid of finite-difference models that hampers their correct approximation, especially in the\npresence of boundary layers and jet streams such as the Gulfstream and Kuroshio. Certainly, this problem\ncan be solved by rejecting finite differences and by using the methods that are more adapted to the complex\ngeometry (for example, finite elements [14] or finite volumes [51]). However, the use of finite differences\ncurrently prevails due to their simplicity and speed.\n\nLet us gain from the simplicity of the described rectangular configuration for the experiments with the\noptimum control of operator discretization at the boundary points. If the grid is parallel to the lateral boundaries, these boundaries turn to be approximated by straight lines. If the grid is rotated by $45^\\circ$, the lateral\nboundaries are approximated by a â\u0080\u009cstaircaseâ\u0080\u009d that results in the not quite correct formulation of boundary\nconditions, in particular, of slipping conditions. We know that the physical boundary is a straight line.\nHence, according to the slipping conditions, the nonzero tangential velocity can be observed on the boundary because only the normal component must be zeroed due to the impermeability condition. However, the\nâ\u0080\u009cstaircaseâ\u0080\u009d approximation results in the fact that the impermeability condition is applied to the velocity.\nThe slipping is taken into account only by zeroing the relative vorticity at the boundary points.\n\nAfter the model have been integrated during 5 years at the grid being parallel to the lateral boundaries\nuntil the statistically stable state is reached, the field of currents is obtained with the strongly pronounced\nboundary layer close to the western and northern boundaries and with the poorly pronounced wave activity.\nLet us consider the obtained solution standard. The sea surface height for this solution is demonstrated in { Fig.\\ref{{sg-ref}}}A. \n\nNow let us rotate the grid by $45^\\circ$  and again integrate the model for 5 years with the same diffusion, forcing, and boundary conditions strictly following the approximations embedded into the NEMO ocean\nmodel. The topography of the surface of this solution is presented in Fig. 1B. This solution differs from the\nstandard one. Due to the â\u0080\u009cstaircaseâ\u0080\u009d approximation of the boundary, the boundary current in the north is reduced by more than twice that has already been noted several times [8, 16].\n\n\n\\begin{figure}[h]\n  \\begin{center}\n  \\begin{minipage}[l]{0.48\\textwidth}\n   A. \\\\ \n  \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-ref.eps}}\n  \\end{minipage} \n  \\begin{minipage}[r]{0.48\\textwidth} \n      \\hfill B. \n  \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-clas.eps}}\n  \\end{minipage}  \n  \\end{center} \n  \\begin{center}\n  C.\\\\\n  \\begin{minipage}[l]{0.48\\textwidth}\n \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-opt.eps}}\n   \\end{minipage} \n  \\end{center} \n  \\caption{The sea surface height in the solution of model equations  at the parallel grid (A), at the grid rotated by $45^\\circ$ (B), and at\nthe rotated grid with the optimized discretization  (C). }\n    \\label{sg-ref}\n\\end{figure}\n\nLet us assimilate the standard solution interpolated to the rotated grid in the experiment on data assimilation and operator discretization control at the boundary points. The assimilation window $T=50$ days\nturns out to be sufficient to provide the stability of obtained discretizations. In all derivatives and interpolations of the model for three coordinates at all boundary points, let us replace the classic discretization formulae by  (1) and (2) containing the controlled coefficients  $\\alpha$. The series of experiments on the\nstandard solution assimilation revealed that the model solution at the rotated grid is sensitive only to the\ndiscretization of derivatives in the vorticity operator. All other interpolations, the first and second\nderivatives of the model did not practically change the initial coefficients  $\\alpha$ whereas the computation of\nvorticity at the boundary points was carried out using other formulae: instead of the usual approximations\nof derivatives with  $\\alpha= \\pm 1$, we get the values $\\alpha= \\pm 1.4, \\pm 0.6$ at the nearest point to the boundary. For\nexample, the vorticity close to the western boundary is computed as\n\n\n\n", "itemtype": "equation", "pos": 15495, "prevtext": "\nThe conditions of impermeability and slipping are used on the lateral boundaries:\n\n", "index": 7, "text": "$$\n\\vec{U}\\cdot\\vec n=0,\\quad {\\fr{ \\textstyle \\partial {\\vec{U}\\cdot\\vec{\\tau}}}{ \\textstyle \\partial {\\vec{n}}}}=0,\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\vec{U}\\cdot\\vec{n}=0,\\quad{\\fr{\\textstyle\\partial{\\vec{U}\\cdot\\vec{\\tau}}}{%&#10;\\textstyle\\partial{\\vec{n}}}}=0,\" display=\"block\"><mrow><mrow><mrow><mrow><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">→</mo></mover><mo>⋅</mo><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">→</mo></mover></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\fr</mtext></merror><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mrow><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">→</mo></mover><mo>⋅</mo><mover accent=\"true\"><mi>τ</mi><mo stretchy=\"false\">→</mo></mover></mrow></mrow><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">→</mo></mover></mrow></mrow><mo>=</mo><mn>0</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01193.tex", "nexttext": "\nIn other words, the optimization requires the supplementation of the usual approximation of derivatives $\\delta_x\\left[v\\right]= {\\frac{ \\textstyle { v_{i} - v_{i-1}}}{ \\textstyle {h}}}$ with the projection of velocity to the tangent to the boundary divided by $R$\n\n", "itemtype": "equation", "pos": 20977, "prevtext": "\n(where $\\vec{U}=(u,v)$ is the vector of horizontal velocity and $\\vec n, \\vec{\\tau} $ are the normal and tangent to the domain\nboundary.\n\n\nThis academic configuration is of special interest for studying the effects of boundary conditions and\ntheir approximation on the model solution in the presence of strongly pronounced boundary layers. The\nnon-triviality of the approximation of boundary conditions is clearly manifested in the experiment when the\ngrid is not parallel to the parallelepiped walls. In this case, especially in the presence of boundary layers, the\nwhole solution turns out to be strongly depending on how the domain boundaries are approximated by the\ngrid. This problem has been actively investigated in recent 15 years (for example, [8, 16, 20]); however, no\nrecommendation have been made so far on the approximation of such boundaries for finding the reasonable\nsolution in the general case.\n\nThis problem is rather important in oceanography because the continental margins most often do not coincide with the grid of finite-difference models that hampers their correct approximation, especially in the\npresence of boundary layers and jet streams such as the Gulfstream and Kuroshio. Certainly, this problem\ncan be solved by rejecting finite differences and by using the methods that are more adapted to the complex\ngeometry (for example, finite elements [14] or finite volumes [51]). However, the use of finite differences\ncurrently prevails due to their simplicity and speed.\n\nLet us gain from the simplicity of the described rectangular configuration for the experiments with the\noptimum control of operator discretization at the boundary points. If the grid is parallel to the lateral boundaries, these boundaries turn to be approximated by straight lines. If the grid is rotated by $45^\\circ$, the lateral\nboundaries are approximated by a â\u0080\u009cstaircaseâ\u0080\u009d that results in the not quite correct formulation of boundary\nconditions, in particular, of slipping conditions. We know that the physical boundary is a straight line.\nHence, according to the slipping conditions, the nonzero tangential velocity can be observed on the boundary because only the normal component must be zeroed due to the impermeability condition. However, the\nâ\u0080\u009cstaircaseâ\u0080\u009d approximation results in the fact that the impermeability condition is applied to the velocity.\nThe slipping is taken into account only by zeroing the relative vorticity at the boundary points.\n\nAfter the model have been integrated during 5 years at the grid being parallel to the lateral boundaries\nuntil the statistically stable state is reached, the field of currents is obtained with the strongly pronounced\nboundary layer close to the western and northern boundaries and with the poorly pronounced wave activity.\nLet us consider the obtained solution standard. The sea surface height for this solution is demonstrated in { Fig.\\ref{{sg-ref}}}A. \n\nNow let us rotate the grid by $45^\\circ$  and again integrate the model for 5 years with the same diffusion, forcing, and boundary conditions strictly following the approximations embedded into the NEMO ocean\nmodel. The topography of the surface of this solution is presented in Fig. 1B. This solution differs from the\nstandard one. Due to the â\u0080\u009cstaircaseâ\u0080\u009d approximation of the boundary, the boundary current in the north is reduced by more than twice that has already been noted several times [8, 16].\n\n\n\\begin{figure}[h]\n  \\begin{center}\n  \\begin{minipage}[l]{0.48\\textwidth}\n   A. \\\\ \n  \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-ref.eps}}\n  \\end{minipage} \n  \\begin{minipage}[r]{0.48\\textwidth} \n      \\hfill B. \n  \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-clas.eps}}\n  \\end{minipage}  \n  \\end{center} \n  \\begin{center}\n  C.\\\\\n  \\begin{minipage}[l]{0.48\\textwidth}\n \\centerline{\\includegraphics[angle=0,width=0.99\\textwidth]{singgyre-opt.eps}}\n   \\end{minipage} \n  \\end{center} \n  \\caption{The sea surface height in the solution of model equations  at the parallel grid (A), at the grid rotated by $45^\\circ$ (B), and at\nthe rotated grid with the optimized discretization  (C). }\n    \\label{sg-ref}\n\\end{figure}\n\nLet us assimilate the standard solution interpolated to the rotated grid in the experiment on data assimilation and operator discretization control at the boundary points. The assimilation window $T=50$ days\nturns out to be sufficient to provide the stability of obtained discretizations. In all derivatives and interpolations of the model for three coordinates at all boundary points, let us replace the classic discretization formulae by  (1) and (2) containing the controlled coefficients  $\\alpha$. The series of experiments on the\nstandard solution assimilation revealed that the model solution at the rotated grid is sensitive only to the\ndiscretization of derivatives in the vorticity operator. All other interpolations, the first and second\nderivatives of the model did not practically change the initial coefficients  $\\alpha$ whereas the computation of\nvorticity at the boundary points was carried out using other formulae: instead of the usual approximations\nof derivatives with  $\\alpha= \\pm 1$, we get the values $\\alpha= \\pm 1.4, \\pm 0.6$ at the nearest point to the boundary. For\nexample, the vorticity close to the western boundary is computed as\n\n\n\n", "index": 9, "text": "$$\n\\biggl({\\fr{ \\textstyle \\partial {v}}{ \\textstyle \\partial {x}}}-{\\fr{ \\textstyle \\partial {u}}{ \\textstyle \\partial {y}}}\\biggr)_{i,j}= {\\frac{ \\textstyle { 0.6 v_{i,j-1} -1.4 v_{i-1,j-1}}}{ \\textstyle {h}}}-{\\frac{ \\textstyle { 1.4 u_{i,j} -0.6 u_{i,j-1}}}{ \\textstyle {h}}}.\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\biggl{(}{\\fr{\\textstyle\\partial{v}}{\\textstyle\\partial{x}}}-{\\fr{\\textstyle%&#10;\\partial{u}}{\\textstyle\\partial{y}}}\\biggr{)}_{i,j}={\\frac{\\textstyle{0.6v_{i,%&#10;j-1}-1.4v_{i-1,j-1}}}{\\textstyle{h}}}-{\\frac{\\textstyle{1.4u_{i,j}-0.6u_{i,j-1%&#10;}}}{\\textstyle{h}}}.\" display=\"block\"><mrow><mrow><msub><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\fr</mtext></merror><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>v</mi></mrow><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mrow><mo>-</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\fr</mtext></merror><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>u</mi></mrow><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>y</mi></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><mrow><mn>0.6</mn><mo>⁢</mo><msub><mi>v</mi><mrow><mi>i</mi><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow><mo>-</mo><mrow><mn>1.4</mn><mo>⁢</mo><msub><mi>v</mi><mrow><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow><mi>h</mi></mfrac><mo>-</mo><mfrac><mrow><mrow><mn>1.4</mn><mo>⁢</mo><msub><mi>u</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub></mrow><mo>-</mo><mrow><mn>0.6</mn><mo>⁢</mo><msub><mi>u</mi><mrow><mi>i</mi><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow><mi>h</mi></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01193.tex", "nexttext": "\nwhere $R=-{\\frac{ \\textstyle {h}}{ \\textstyle {0.8 \\sqrt{2}}}}$. \n\nTo get the meaning of this additive, let us advert to papers [10, 57] that demonstrate that the formulation\nof boundary slipping conditions on the curvilinear boundary requires such additive. The parameter $R$ has a\nmeaning of the local radius of curvature of the boundary.\n\nHaving discretized the derivatives in the equation for vorticity at the boundary points following (3), we\nget the solution for the height of the sea surface whose topography is demonstrated in Fig. 1C. As clear, it is\nquite similar to the sea surface height of the standard solution in Fig. 1A; this enables a conclusion that the\neffects of â\u0080\u009cstaircaseâ\u0080\u009d approximation of the boundary are compensated. The optimized boundary turns out to\nbe not a straight line as it could be expected but a certain curve with the constant negative radius of curvature close to $-h/ \\sqrt{2}$. Moreover, as demonstrated in [27], in the case of the inclined grid the formulation of\nslipping conditions on the straight physical boundary of the domain may result in the instability in the approximation of the Coriolis parameter.\n\nData assimilation for the more realistic situation was carried out in [28].This paper uses the ORCA-2\nconfiguration of the NEMO model that was worked out for simulating the World Ocean at the grid with the\nhorizontal resolution of  $2^\\circ$  and with 31 vertical layers. In spite of the low resolution, this configuration is\nwidely used for studying the ocean dynamics.\n\nIn this experiment the observational data from ECMWF databases received from Jason-1 and Envisat\nsatellites were assimilated. Besides, the profiles of temperature and salinity from the ENACT/ENSEMBLES data bank were assimilated as well. The measurements of the sea surface height contain about\n112000 values obtained on January 1â\u0080\u009320, 2006. The profiles of temperature and salinity are represented by\nthe data of 200000 measurements during the same period.\n\n\nAs well as in the previous experiment, let us first of all determine the operators whose discretization\naffects the model solution most of all. It is revealed that the discretization of zonal and meridional operators\naffects the results almost in no way. In the experiment that allows controlling only the discretizations of\nhorizontal operators, the cost function does not virtually decrease (less than 1\\%) and there is almost no defference between model solutions with the optimized and classic discretizations. This fact is easily explained\nby the low horizontal resolution of the model. The two-degree grid of ORCA-2 configuration needs the\nhigh horizontal dissipation whose coefficient is equal to  $40000{\\frac{ \\textstyle {\\mbox{m}^2}}{ \\textstyle {\\mbox{s}}}}$ in the extratropical zone. Such significant smoothing quickly levels potential boundary effects. The modification of the boundary in the previous\nexperiment led to the change in the model solution under other conditions: the higher resolution and lower\nhorizontal dissipation ($200{\\frac{ \\textstyle {\\mbox{m}^2}}{ \\textstyle {\\mbox{s}}}}$).\n\n\nThe maximum influence on the model solution is exerted by the boundary conditions in the operator of\nvertical dissipation. This is true for the ocean bottom only. Their optimization modifies considerably the\nfields of velocity, temperature, and salinity not only in the bottom layer but also on the sea surface that is\nproved by the sea surface height in the North Atlantic (Fig. 2).\n\nTo obtain this result, we integrated the ORCA-2 configuration of the NEMO model from January 1 to\n30, 2006 using the initial data and the external forcing obtained from the observational data for that period.\nThe sea surface height at the end of integration is presented in Fig. 2A. After that the assimilation of\naltimetric data and profiles of temperature and salinity for 20 days (January 1 to 20) was carried out and the\noptimized coefficients $\\alpha$ were found which define the discretization of operators ${\\fr{ \\textstyle \\partial {}}{ \\textstyle \\partial {z}}}A^z{\\fr{ \\textstyle \\partial {u}}{ \\textstyle \\partial {z}}} $ Ð¸ ${\\fr{ \\textstyle \\partial {}}{ \\textstyle \\partial {z}}}A^z{\\fr{ \\textstyle \\partial {v}}{ \\textstyle \\partial {z}}}$ at bottom points. Using these coefficients, the model was integrated for 30 days once again and the solution\nwas found corresponding to the sea surface height demonstrated in Fig. 2B.\n\n\n\\begin{figure}[h]\n  \\begin{center}\n    \\begin{minipage}[l]{0.48\\textwidth}\n   A. \\\\\n   \\vspace{-2mm}\n  \\centerline{\\includegraphics[angle=-90,width=0.99\\textwidth]{opi-atl.eps}}\n  \\end{minipage} \n  \\begin{minipage}[r]{0.48\\textwidth} \n      \\hfill B. \n  \\centerline{\\includegraphics[angle=-90,width=0.95\\textwidth]{opz-atl3.eps}}\n  \\end{minipage} \n\n  \\end{center}   \n    \\caption{  The sea surface height in the North Atlantic on January 30, 2006 computed using  the classical (A) and optimized (B) \ndiscretization of operators of vertical diffusion at bottom points.}\n\\label{opiz}\n\\end{figure}\n\nThe basic feature of the ocean circulation in the North Atlantic is a formation of a narrow and long jet\nstream, the Gulf Stream. Certainly, the Gulf Stream is present in the satellite altimetry whose data are assimilated by the model. Therefore, the jet stream becomes more pronounced in the model solution after\ndata assimilation: the velocity (being proportional to the meridional gradient of sea surface height) and the\nlength of the Gulf Stream increase. However, it is difficult to explain why the modification of boundary\nconditions for the zonal and meridional velocities in the certain areas of the bottom is the most efficient for\nintensifying the surface jet stream.\n\n\\section{Conclusions}\n\nThus, it is clear that boundary conditions on rigid boundaries are also important in realistic ocean models. The use of the variational assimilation of data for their optimization can be useful in spite of the high\ncost of this procedure. As mentioned, data assimilation defines the model operators being the most sensitive\nto boundary conditions as well as identifies the geographic regions where such sensitivity is most pronounced. We automatically provide the stability of the obtained discretization by choosing the rather durable assimilation window. Its conservative properties can also be provided by adding the corresponding\nmember to the cost function as demonstrated in [24]. However, it is often needed to comprehend the obtained results from the point of view of the correspondence to the accepted physical imperatives and hypotheses. The understanding of the physical sense of optimized coefficients for realistic models can also be\nhampered.\n\nIn conclusion it should be noted that the present review covers only the small part of the research areas\ndeveloped by the followers of G.I. Marchuk. During his outstanding scientific life, G.I. Marchuk laid a\nstrong foundation for studies in different fields of science and technology. Besides, he created a strong scientific school. Nowadays his grateful followers, â\u0080\u009cscientific grandchildren and great-grandchildren,â\u0080\u009d develop his ideas and continue the studies which he initiated in different fields of science, in different countries, and for different applications.\n\nHis work lives on and is continued in scientific papers, models, and technologies; it opens up new vistas\nfor the mankind. His memory is kept with care by all who had the luck to know him personally and to work\nwith him.\n\n\\begin{thebibliography}{10}\n\\bibitem{1} G. I. Marchuk, â\u0080\u009cBasic and Adjoint Equations of the Dynamics of Atmosphere and Ocean,â\u0080\u009d Meteorol. Gidrol., No. 2\n(1974) [in Russian].\n\n\\bibitem{2} G. I. Marchuk, Adjoint Equations and Complex System Analysis (Nauka, Moscow, 1992) [in Russian].\n\n\\bibitem{3} G. I. Marchuk and V. I. Agoshkov, â\u0080\u009cAdjoint Equations in Nonlinear Problems and Their Applications,â\u0080\u009d in Functional and Numerical Methods of Mathematical Physics (Naukova Dumka, Kiev, 1988) [in Russian].\n\\bibitem{4} G. I. Marchuk, V. I. Agoshkov, and V. P. Shutyaev, Adjoint Equations and Methods of Perturbations in the Nonlinear Problems of Mathematical Physics (Nauka, Moscow, 1993) [in Russian].\n\\bibitem{5} V. V. Penenko and N. N. Obraztsov, â\u0080\u009cA Variational Initialization Method for the Fields of the Meteorological\nElements,â\u0080\u009d Meteorol. Gidrol., No. 11 (1976) [Sov. Meteorol. Hydrol., No. 11 (1976)].\n\\bibitem{6} V. V. Penenko and N. N. Obraztsov, â\u0080\u009cA Variational-difference Method for the Objective Analysis of\nMeteorological-element Fields,â\u0080\u009d Meteorol. Gidrol., No. 6 (1978) [Sov. Meteorol. Hydrol., No. 6 (1978)].\n\\bibitem{7} M. A. Tolstykh, N. A. Dianskii, A. V. Gusev, and D. B. Kiktev, â\u0080\u009cSimulation of Seasonal Anomalies of Atmospheric Circulation Using Coupled Atmosphereâ\u0080\u0093Ocean Model,â\u0080\u009d Izv. Akad. Nauk, Fiz. Atmos. Okeana, No. 2, 50\n(2014) [Izv., Atmos. Oceanic Phys., No. 2, 50 (2014)].\n\\bibitem{8} A. Adcroft and D. Marshall, â\u0080\u009cHow Slippery are Piecewise-constant Coastlines in Numerical Ocean Models?â\u0080\u009d,\nTellus A, 50 (1998).\n\\bibitem{9} A. Arakawa and V. Lamb, â\u0080\u009cComputational Design of the Basic Dynamical Processes of the UCLA General Circulation Model,â\u0080\u009d Methods in Computational Physics, 17 (1977).\n\\bibitem{10} E. Blayo, â\u0080\u009cA Regional Quasigeostrophic Circulation Model of the Western North Atlantic: A Modelâ\u0080\u0093Data Comparison,â\u0080\u009d J. Mar. Syst., No. 6, 5 (1994).\n\\bibitem{11} F. Bryan, â\u0080\u009cParameter Sensitivity of Primitive Equation Ocean General Circulation Models,â\u0080\u009d J. Phys. Ocean., 17\n(1987).\n\\bibitem{12} H. T. Chen, S. Y. Lin, H. R. Wang, and L. C. Fang, â\u0080\u009cEstimation of Two-sided Boundary Conditions for\nTwo-dimensional Inverse Heat Conduction Problems,â\u0080\u009d Int. J. Heat Mass Transfer, 45 (2002).\n\\bibitem{13} P. Courtier and O. Talagrand, â\u0080\u009cVariational Assimilation of Meteorological Observations with the Adjoint\nVorticity Equation,â\u0080\u009d Quart. J. Roy. Meteorol. Soc., 113 (1987).\n\\bibitem{14} S. Danilov, G. Kivman, and J. Schroter, â\u0080\u009cA Finite-element Ocean Model: Principles and Evaluation,â\u0080\u009d Ocean\nModelling, No. 2, 6 (2004).\n\\bibitem{15} F. J. Doblas-Reyes, J. Garcia-Serrano, F. Lienert, et al., â\u0080\u009cSeasonal Climate Predictability and Forecasting: Status\nand Prospects,â\u0080\u009d Wiley Int. Rev.: Climate Change, 4 (2013).\n\\bibitem{16} F. Dupont, D. Straub, and C. Lin, â\u0080\u009cInfluence of a Step-like Coastline on the Basin Scale Vorticity Budget of\nMid-latitude Gyre Models,â\u0080\u009d Tellus A, No. 3, 55 (2003).\n\\bibitem{17} M. Eby and G. Holloway, â\u0080\u009cSensitivity of a Large-scale Ocean Model to a Parameterization of Topographic Series,â\u0080\u009d J. Phys. Oceanogr., 24 (1994).\n\\bibitem{18} M. Ghil and P. Malanotte-Rizzoli, â\u0080\u009cData Assimilation in Meteorology and Oceanography,â\u0080\u009d Adv. Geophys., 33\n(1991).\n\\bibitem{19} S. Gillijns and B. De Moor, â\u0080\u009cJoint State and Boundary Condition Estimation in Linear Data Assimilation Using\nBasis Function Expansion,â\u0080\u009d in Proceedings of the 26th IASTED International Conference on Modelling, Identification, and Control, Ed. by L. Bruzzone (ACTA Press, Canada, Innsbruck, Austria, 2007).\n\\bibitem{20} S. D. Griffiths, â\u0080\u009cKelvin Wave Propagation along Straight Boundaries in C-grid Finite-difference Models,â\u0080\u009d J. Comp.\nPhys., 255 (2013).\n\\bibitem{21} L. Hascoet and V. Pascual, TAPENADE 2.1 Userâ\u0080\u0099s Guide: Technical Report: 0300/INRIA (2004), http://www.inria.fr/rrrt/rt-0300.html.\n\\bibitem{22} W. R. Holland, â\u0080\u009cBaroclinic and Topographic Influences on the Transport in Western Boundary Currents,â\u0080\u009d\nGeophys. Fluid Dynamics, 4 (1973).\n\\bibitem{23} E. Kalnay, M. Kanamitsu, and W. E. Baker, â\u0080\u009cGlobal Numerical Weather Prediction at the National Meteorological Center,â\u0080\u009d Bull. Amer. Meteorol. Soc., 71 (1990).\n\\bibitem{24} E. Kazantsev, â\u0080\u009cBoundary Conditions Control for a Shallow-water Model,â\u0080\u009d Int. J. Numer. Meth. Fluids, No. 5, 68\n(2012).\n\\bibitem{25} E. Kazantsev, â\u0080\u009cIdentification of Optimal Topography by Variational Data Assimilation,â\u0080\u009d J. Phys. Math., 1 (2009).\n\\bibitem{26} E. Kazantsev, â\u0080\u009cIdentification of Optimal Boundary Approximation by Variational Data Assimilation,â\u0080\u009d J. Comp.\nPhys., No. 2, 229 (2010).\n\\bibitem{27} E. Kazantsev, â\u0080\u009cOptimized Boundary Conditions at Staircase-shaped Coastlines,â\u0080\u009d Ocean Dynamics, No. 1, 65\n(2015).\n\\bibitem{28} E. Kazantsev, â\u0080\u009cOptimal Boundary Conditions for ORCA-2 Model,â\u0080\u009d Ocean Dynamics, No. 8, 63 (2013).\n\\bibitem{29} E. Kazantsev, â\u0080\u009cOptimal Boundary Discretization by Variational Data Assimilation,â\u0080\u009d Int. J. Numer. Meth. Fluids,\nNo. 10, 65 (2011).\n\\bibitem{30} E. Kazantsev, â\u0080\u009cSensitivity of a Shallow-water Model to Parameters,â\u0080\u009d Nonlinear Analysis. Series B. Real World\nApplications, No. 3, 13 (2012).\n\\bibitem{31} F.-X. Le Dimet, â\u0080\u009cA General Formalism of Variational Analysis,â\u0080\u009d Normann, CIMMS Report, Rep.: OK 73091\n(1982).\n\n\\bibitem{32} F.-X. Le Dimet and M. Ouberdous, â\u0080\u009cRetrieval of Balanced Fields: An Optimal Control Method,â\u0080\u009d Tellus A, No. 5,\n45 (1993).\n\\bibitem{33} F.-X. Le Dimet and O. Talagrand, â\u0080\u009cVariational Algorithm for Analysis and Assimilation of Meteorological\nObservations. Theoretical Aspects,â\u0080\u009d Tellus A, 38 (1986).\n\\bibitem{34} J. M. Lellouche, J. L. Devenon, and I. Dekeyser, â\u0080\u009cBoundary Control on Burgers Equation. A Numerical\nApproach,â\u0080\u009d Comput. Math. Appl., 28 (1994).\n\\bibitem{35} Y. Leredde, J. M. Lellouche, J. L. Devenon, and I. Dekeyser, â\u0080\u009cOn Initial, Boundary Conditions and Viscosity\nCoefficient Control for Burgersâ\u0080\u0099 Equation,â\u0080\u009d Int. J. Numer. Meth. Fluids, No. 1, 28 (1998).\n\\bibitem{36} J. Lewis and J. Derber, â\u0080\u009cThe Use of Adjoint Equations to Solve a Variational Adjustment Problem with Advective\nConstraints,â\u0080\u009d Tellus A, 37 (1985).\n\n\\bibitem{37} J.-L. Lions, Controle Optimal de SystÃ¨mes Gouvernes par des Equations aux Derivees Partielles (Dunod, 1968).\n\n\\bibitem{38} J.-L. Lions, Controllabilite Exacte Perturbations et Stabilisation de Systemes Distribues (Masson, Paris, 1988).\n\\bibitem{39} E. N. Lorenz, â\u0080\u009cDeterministic Nonperiodic Flow,â\u0080\u009d J. Atmos. Sci., 20 (1963).\n\\bibitem{40} M. Losch, A. Adcroft, and J.-M. Campin, â\u0080\u009cHow Sensitive are Coarse General Circulation Models to Fundamental\nApproximations in the Equations of Motion?â\u0080\u009d, J. Phys. Oceanogr., No. 1, 34 (2004).\n\\bibitem{41} M. Losch and P. Heimbach, â\u0080\u009cAdjoint Sensitivity of an Ocean General Circulation Model to Bottom Topography,â\u0080\u009d\nJ. Phys. Oceanogr., No. 2, 37 (2007).\n\\bibitem{42} M. Losch and C. Wunsch, â\u0080\u009cBottom Topography as a Control Variable in an Ocean Model,â\u0080\u009d J. Atmos. Ocean.\nTechnology, 20 (2003).\n\\bibitem{43} G. Madec et al., NEMO Ocean Engine. Rep.: 27. Note du Pole de Modelisation de lâ\u0080\u0099Institut Pierre Simon Laplace\n(2012).\n\\bibitem{44} G. I. Marchuk, â\u0080\u009cFormulation of Theory of Perturbations for Complicated Models,â\u0080\u009d Appl. Math. Optimization, 2\n(1975).\n\\bibitem{45} G. I. Marchuk and V. V. Penenko, â\u0080\u009cApplication of Optimization Methods to the Problem of Mathematical Simulation of Atmospheric Processes and Enviornment,â\u0080\u009d in Lecture Notes in Control and Information Sciences, Vol. 18:\nModelling and Optimization of Complex System, Ed. by G. Marchuk (Springer, Berlin, Heidelberg, 1979).\n\\bibitem{46} G. I. Marchuk and V. P. Shutyaev, â\u0080\u009cIteration Methods for Solving a Data Assimilation Problem,â\u0080\u009d Russ. J. Numer.\nAnal. and Math. Modelling, 9 (1994).\n\\bibitem{47} G. I. Marchuk and V. B. Zalesny, â\u0080\u009cA Numerical Technique for Geophysical Data Assimilation Problem Using\nPontryaginâ\u0080\u0099s Principle and Splitting-up Method,â\u0080\u009d Russ. J. Numer. Anal. and Math. Modelling, 8 (1993).\n\\bibitem{48} I. M. Navon, â\u0080\u009cPractical and Theoretical Aspects of Adjoint Parameter Estimation and Identifiability in Meteorology and Oceanography,â\u0080\u009d Dynamics Atmos. Ocean., 27 (1997).\n\\bibitem{49} I. M. Navon, X. Zou, J. Derber, and J. Sela, â\u0080\u009cVariational Data Assimilation with an Adiabatic Version of the\nNMC Spectral Model,â\u0080\u009d Mon. Wea. Rev., 120 (1992).\n\\bibitem{50} P. Pellerin, H. Ritchie, F. J. Saucier, et al., â\u0080\u009cImpact of a Two-way Coupling between an Atmospheric and an\nOcean-ice Model over the Gulf of St. Lawrence,â\u0080\u009d Mon. Wea. Rev., 132 (2004).\n\\bibitem{51} T. Ringler, M. Petersen, R. L. Higdonc, et al., â\u0080\u009cA Multi-resolution Approach to Global Ocean Modeling,â\u0080\u009d Ocean\nModelling, 69 (2013).\n\\bibitem{52} I. Shulman, â\u0080\u009cLocal Data Assimilation in Specification of Open Boundary Conditions,â\u0080\u009d J. Atmos. Ocean. Technology, 14 (1997).\n\\bibitem{53} I. Shulman, J. K. Lewis, A. F. Blumberg, and B. N. Kim, â\u0080\u009cOptimized Boundary Conditions and Data Assimilation\nwith Application to the M2 Tide in the Yellow Sea,â\u0080\u009d J. Atmos. Ocean. Technology, No. 4, 15 (1998).\n\\bibitem{54} T. N. Stockdale, D. L. T. Anderson, M. A. Balmaseda, et al., â\u0080\u009cECMWF Seasonal Forecast System 3 and Its\nPrediction of Sea Surface Temperature,â\u0080\u009d Climate Dynamics, 37 (2011).\n\\bibitem{55} V. Tailandier, V. Echevin, L. Mortier, and J.-L. Devenon, â\u0080\u009cControlling Boundary Conditions with a Fourdimensional Variational Data-assimilation Method in a Non-stratified Open Coastal Model,â\u0080\u009d Ocean Dynamics,\nNo. 2, 54 (2004).\n\\bibitem{56} J.-N. Thepaut and P. Courtier, â\u0080\u009cFour-dimensional Variational Data Assimilation Using the Adjoint of a Multilevel\nPrimitive-equation Model,â\u0080\u009d Quart. J. Roy. Meteorol. Soc., 117 (1991).\n\\bibitem{57} J. Verron and E. Blayo, â\u0080\u009cThe No-slip Condition and Separation of Western Boundary Currents,â\u0080\u009d J. Phys.\nOceanogr., No. 9, 26 (1996).\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 21526, "prevtext": "\nIn other words, the optimization requires the supplementation of the usual approximation of derivatives $\\delta_x\\left[v\\right]= {\\frac{ \\textstyle { v_{i} - v_{i-1}}}{ \\textstyle {h}}}$ with the projection of velocity to the tangent to the boundary divided by $R$\n\n", "index": 11, "text": "\\begin{equation}\n\\biggl({{\\frac{ \\textstyle { \\textstyle \\partial {v}}}{ \\textstyle { \\textstyle \\partial {x}}}}}-{{\\frac{ \\textstyle { \\textstyle \\partial {u}}}{ \\textstyle { \\textstyle \\partial {y}}}}}\\biggr)_{i,j}=\\delta_x\\left[v\\right]-\\delta_y\\left[u\\right] - {\\frac{ \\textstyle {0.8}}{ \\textstyle {h}}}(\\overline{u}+\\overline{v})=\\delta_x\\left[v\\right]-\\delta_y\\left[u\\right]+{\\frac{ \\textstyle { \\vec{U}\\cdot\\vec{\\tau}}}{ \\textstyle {R}}},\n\\label{modf}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\biggl{(}{{\\frac{\\textstyle{\\textstyle\\partial{v}}}{\\textstyle{\\textstyle%&#10;\\partial{x}}}}}-{{\\frac{\\textstyle{\\textstyle\\partial{u}}}{\\textstyle{%&#10;\\textstyle\\partial{y}}}}}\\biggr{)}_{i,j}=\\delta_{x}\\left[v\\right]-\\delta_{y}%&#10;\\left[u\\right]-{\\frac{\\textstyle{0.8}}{\\textstyle{h}}}(\\overline{u}+\\overline{%&#10;v})=\\delta_{x}\\left[v\\right]-\\delta_{y}\\left[u\\right]+{\\frac{\\textstyle{\\vec{U%&#10;}\\cdot\\vec{\\tau}}}{\\textstyle{R}}},\" display=\"block\"><mrow><mrow><msub><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>v</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mfrac><mo>-</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>u</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>y</mi></mrow></mfrac></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mrow><msub><mi>δ</mi><mi>x</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mi>v</mi><mo>]</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>δ</mi><mi>y</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mi>u</mi><mo>]</mo></mrow></mrow><mo>-</mo><mrow><mfrac><mn>0.8</mn><mi>h</mi></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>u</mi><mo>¯</mo></mover><mo>+</mo><mover accent=\"true\"><mi>v</mi><mo>¯</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>δ</mi><mi>x</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mi>v</mi><mo>]</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>δ</mi><mi>y</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mi>u</mi><mo>]</mo></mrow></mrow></mrow><mo>+</mo><mfrac><mrow><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">→</mo></mover><mo>⋅</mo><mover accent=\"true\"><mi>τ</mi><mo stretchy=\"false\">→</mo></mover></mrow><mi>R</mi></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]