[{"file": "1601.03621.tex", "nexttext": "\n\\end{widetext}\n\n\n\n\nThe values of the MEL at large field for the $\\Delta g$ mechanism, from Eq.~(\\ref{eq:MELeq}), are shown  in Fig.~\\ref{fig1}(e) for $k_D = 0$ and for various values of $G_T/G_S$ and $k_T/k_S$. The situation for exciplex recombination corresponds to $k_T/k_S\\ll 1$, which will allow magnetic field effects as large as 100\\% if $G_T/G_S\\approx 1$, and produces a {\\it positive} MEL. For exciton recombination $k_T/k_S\\sim 1$, which produces a much smaller magnetic field effect, as seen in Fig.~\\ref{fig1}(e). The sign of the MEL for the $\\Delta g$ mechanism differs considerably from MEL caused by the hyperfine mechanism, for which a {\\it negative} MEL is expected\\cite{Kersten2011}. The values of the MEL at large field for the hyperfine interaction are shown in Fig.~\\ref{fig1}(f) for $G_T/G_S=1$ and $G_T/G_S= 0.25$, and two values of the hyperfine field. A decrease in the $\\Delta_{ST}$ will produce a larger magnitude MEL in the experimentally-relevant regime of $k_T/k_S\\ll 1$, whether the mechanism is the $\\Delta g$ mechanism or the hyperfine mechanism.\n\nAs the exciplex formation rate is directly related to the current through a device, the assumption of a constant formation rate corresponds to assuming a constant-current experimental condition for evaluating the effects of a magnetic field. Under conditions where the resistance changes substantially in the presence of a magnetic field this assumption must be examined anew, and thus the MEL measured under constant voltage conditions (MEL$|_V$), for which the current and resistance changes substantially, will differ from the MEL measured under constant current conditions (MEL$|_I$).\n\nOur theory directly yields a magnetoluminescence response from the $\\Delta g$ and hyperfine mechanisms, but, at first sight, does not address the magnetoconductance (MC). As shall be presented below, however, a sizeable magnetoconductance that is smaller but roughly comparable in magnitude (up to a factor of 2-3) is always measured alongside the MEL response. It was  recognized in the early days of OMAR research that the exciton mechanism for MEL (which in this aspect behaves similarly to our exciplex mechanism for MEL) immediately produces a concomitant MC response\\cite{Bergeson2008}. In short, the electron and hole densities are large close to their respective injecting electrode. If the electron-hole recombination is efficient (and {\\it mutatis mutandis} for inefficient recombination) there will be little spatial overlap of the two densities in the center of the device. This is because electrons and hole will immediately recombine in any part of the device where the two densities overlap. Therefore the majority of the device is electrically charged, limiting the conductance by the so-called space-charge limited current law. Any magnetic-field dependent recombination rate (as in our exciplex mechanism) will change the width of the portion of the device where the two densities overlap and space-charge cancellation occurs, thus producing a change in the conductance. Thus we assume the same functional dependence on magnetic field for the MC as for the MEL for this exciplex theory.\n\n\\section{Device Composition and Fabrication} \\label{sec:devicefabrication}\n\nOur TADF devices, schematically shown in Fig.~\\ref{fig2ab}(a), are thin film devices with several layers deposited sequentially onto a glass slide with patterned indium-tin-oxide (ITO) electrodes. We use a materials combination for the primary layer that is known to produce a large  internal electroluminescence quantum efficiency $\\eta$ due to TADF\\cite{Goushi2012}:  4,4,4-tris[3-\nmethylphenyl(phenyl)amino]triphenylamine (m-MTDATA) as donors and tris-[3-(3-pyridyl)mesityl]borane (3TPYMB) as acceptors. \nThe m-MTDATA  ($>99\\%$ pure) was purchased from Sigma-Aldrich and two batches with different purities of 3TPYMB ($>99.2\\%$ pure, used for data in Figs.~\\ref{fig6}-\\ref{fig4b} and $>99.8\\%$ pure, used in all other figures) were purchased from Lumtec (Luminescence Technology Corp.). The materials were used as received.\n\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig2.pdf}\n\\caption{\\label{fig2ab}\n\\sloppy\n\\noindent\n {Exciplex device structure and emission spectrum.}\n({a}) Schematic device structure showing the two measurement modes used. The solid circuit is for a constant voltage measurement, whereas the dashed circuit is for a constant current.\n({b}) Electroluminescence spectrum for our device (red dashed line), compared with exciplex emission (solid black line) and exciton emission spectra (solid blue and green lines) taken from the literature.\\cite{Goushi2012} This shows that exciplexes are responsible for EL in our devices.\n}\n\\end{figure}\n\n After careful cleaning of the ITO/glass substrate in solvents, followed by plasma treatment, the organic layers were fabricated by thermal evaporation under high vacuum  at $10^{-7}$ mbar.\nIn our devices {the} primary layer consists of co-evaporated m-MTDATA:3TPYMB with a mass fraction of x\\% 3TPYMB. All our figures are for x=75\\% unless otherwise stated, as this resulted in the largest magnetoelectroluminescence.\n A cathode layer consisting of calcium (covered by a protective layer of aluminum to increase air-stability) was deposited by thermal evaporation in most devices, but e-beam evaporation was used for some devices. The active device area was about $0.6\\times0.6$ mm$^{2}$.\n\n The structure of the devices that gave the largest effects was ITO/m-MTDATA (15 nm)/25 wt\\%-m-MTDATA: 3TPYMB (180nm)/3TPYMB (15 nm)/Ca (30 nm)/Al (60 nm). During the co-evaporation of the 25 wt\\%-m-MTDATA:3TPYMB, m-MTDATA was deposited at a rate of 0.1~nm/s and 3TPYMB at 0.3~nm/s.\nFig.~\\ref{fig2ab}(b) shows the spectrum of the electroluminescence from these layers, compared with emission from excitons in either of the two constituents, and confirms that exciplexes indeed form in our devices\\cite{Goushi2012}.\n\n\nThe control  devices, with organic luminescent or resistive layers  of Poly[2-methoxy-5-(2-ethylhexyloxy)-1,4-phenylenevinylene] (MEH-PPV, see Fig.~\\ref{fig3aa}(a)) or Tris(8-hydroxyquinolinato)aluminium (Alq$_3$, see Fig.~\\ref{fig3aa}(b)), consist of a thin film of the organic semiconductor sandwiched between a top and bottom electrode. The indium tin oxide (ITO, 100 nm) coated glass substrates were obtained from Delta Technologies. The substrates were cleaned in an ultrasonic bath using acetone, methanol and isopropanol followed by oxygen plasma cleaning. The conducting polymer poly(3,4-ethylenedioxythiophene)-poly(styrenesulfonate) (PEDOT), purchased from Ossila Ltd., was spin coated at 4000 revolutions per minute (rpm) on top of the ITO to provide an efficient hole injecting electrode. All other manufacturing steps were carried out in a nitrogen glove box. The MEH-PPV (used as purchased from Sigma Aldrich) films were spin-coated from a toluene solution with concentration 5 mg/mL. The Alq$_3$ (used as purchased from Sigma Aldrich) films were thermally evaporated in high vacuum onto the PEDOT covered substrate. The organic semiconductor layer thickness was $\\approx$ 150 nm. The cathode layer consisting of calcium and aluminum was deposited by thermal evaporation or e-beam evaporation at a base pressure of $10^{-7}$ mbar on top of the organic semiconductor layer. The active device area was roughly $0.6\\times0.6$ mm$^{2}$.\n\n\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig3.pdf}\n\\caption{\\label{fig3aa}\n{Molecular structures of  MEH-PPV (a) and Alq$_3$ (b) that have been used in control experiments. Typical magnetconductance (red) and magnetoelectroluminescence (blue) in  MEH-PPV (c) and  Alq$_3$ (d) control devices that are dominated by exciton emission. The dashed black lines represent fits to the non-Lorentzian lineshape (see text)}\n}\n\\end{figure}\n\n\n\n\nMFE measurements were performed with the device mounted inside a closed-cycle He cryostat placed between two poles of an electromagnet.  All data shown in this article were measured at room temperature, unless specified otherwise. The devices were driven at either a constant voltage V or a constant current I using a Keithley 2400 Source Meter. The particular current and voltage bias levels were chosen in pairs such that they corresponded to similar driving conditions. The electroluminescence intensity was measured using a photomultiplier tube which was shielded from the magnetic field during sweeps. For the optimal device conditioning procedure (see section~\\ref{sec:deviceconditioning}), the devices were driven around a current density of 30 mA/cm$^{2}$ for 40 mins. Several MC/MEL traces were taken during the conditioning process to monitor the conditioning effectiveness and to find the optimal conditioning point.\n\nThe MFE can be detected either by measuring $I$ as a function of $B$, or, alternatively  by measuring the electroluminescence (EL) as a function of $B$. These two measurements are performed simultaneously  [see Fig.~\\ref{fig2ab}(a)] when either the applied device voltage is kept constant (measuring a change $\\Delta I(B)$ and $\\Delta EL(B)$), or when the device current is kept constant (measuring a change in applied voltage $\\Delta V(B)$ and $\\Delta EL(B)$ ). The MFE, $\\Delta x/x$, in all these quantities is defined as $[x(B)-x(0)]/x(0)$.\n\n\nFigure~\\ref{fig3aa} shows the magnetic field effects in MEH-PPV and Alq$_3$ devices.  These results will serve as a reference point for the discussion of the new types of MFE observed in the TADF devices. MEH-PPV and Alq$_3$ were chosen because their MFEs have been extensively characterized in the OMAR literature\\cite{Kalinowski2003,Mermer:2005:PRB} and device conditioning was first reported for MEH-PPV devices\\cite{Niedermeier:2008:PRB}.  For typical MFEs the dependence of conductivity (or luminescence) on magnetic field is commonly  either Lorentzian, $\\Delta I(B)/I \\propto B^2/(B^2+B_0^2)$, or follows a specific non-Lorentzian form, $\\Delta I(B)/I \\propto B^2/(|B|+B_0)^2$, for the change in the current $I$ where $B_0 \\approx 5$ mT\\cite{Mermer:2005:PRB}. We find that the data  in Fig.~\\ref{fig3aa} can be accurately fitted by the non-Lorentzian expression. \n\n\\section{Magnetic Field Effects in Unconditioned Exciplex Devices}\\label{unconditioned}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig4.pdf}\n\\caption{\\label{fig3a}\n\\sloppy\n\\noindent\n(a) Magnetoconductance (MC) and (b) magnetoelectroluminescence (MEL) before device conditioning for three representative constant voltages. (c)~Magnetovoltage and (d) magnetoelectroluminescence before device conditioning for three representative constant currents.\nThe same color is used throughout the figure to designate measurements with a comparable current-density. Thick dashed lines are non-Lorentzian (as defined in text) fits to the largest displayed curve in each panel.}\n\\end{figure}\n\n\n\nFigure~\\ref{fig3a} shows measurements of MFE in as-prepared (unconditioned) devices for both constant voltage and constant current measurements. Figure~\\ref{fig3a}(a) and~(b) shows that these devices exhibit sizable magnetoconductance and magnetoluminescence effects of up to 30\\% and 60\\%, respectively, for constant voltage measurements, whereas the effects for constant current measurements are smaller.\nThe data in Fig.~\\ref{fig3a} is well-fit by the non-Lorentzian expression, as Fig.~\\ref{fig3aa} was.\nThe large (60\\%) positive MEL is the largest reported in organic semiconductors and remarkably, is completely at odds with the hyperfine mechanism where MEL $\\sim$ $-$50\\% is predicted for exciplexes (where $k_S > k_T$).\n\n\nHowever, our observations are consistent with the $\\Delta g$ mechanism operating; the dominance of the $\\Delta g$ mechansim is not surprising for MEL and MC in TADF materials because (1) the $g$-factors for two polaron spins ($\\bm{S}_1$ and $\\bm{S}_2$) on different adjacent molecules ($g_1$ and $g_2$) are expected to vary much more than for identical molecules and (2) McConnell's rule\\cite{McConnell1958} states that $B_{0HF} \\approx (2-3mT)/\\sqrt{N}$ in molecules with $N$ hydrogen atoms. Whereas our molecules in Fig.~\\ref{fig1}(a) do not contain many more hydrogens than other molecular organic semiconductors where hyperfine spin-mixing is dominant, the rapid dissociation and association of the exciplex effectively further delocalizes the polarons and reduces the hyperfine interaction.\\cite{Dodin2013}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig5.pdf}\n\\caption{\\label{figMELMC}\n\\sloppy\nMagnetic field effect on electroluminescence efficiency $\\eta$ in the pristine device for three representative constant voltages. The curves shown here are for the same device and experimental data set as in Fig.~\\ref{fig3a} (a) and (b).\n}\n\\end{figure}\n\nThe data shown in Fig.~\\ref{fig3a} are fit to Eq.~(\\ref{eq:MELeq}). During this fit $k_S$ and $\\Delta g$ are kept constant. $k_S$ has been determined to be $3\\times 10^6$~s$^{-1}$ for a similar combination of materials\\cite{Goushi2012}. In other organic materials, $\\Delta g$  has been found to be on the order of $10^{-3}-10^{-4}$.\\cite{Graeff2005, Yu2012} We fix $\\Delta g=10^{-4}$, corresponding to the low end of that spectrum.  The crucial fitting parameters are $k_D$ and $G_T/G_S$. $k_D \\sim 10^4$~s$^{-1}$, whereas $k_T$ is considerably smaller than $k_D$ and can therefore be assumed zero. Assuming that $G_T=G_S$ at high temperature, the value $G_T/G_S=0.19$ we find from our fit corresponds to an activation energy of $42$~meV, consistent with the TADF behavior.\n\n\nThe maximum change in the electroluminescence with an applied field, relative to the zero-field electroluminescence, measured for a constant voltage (MEL$|_V$) is 0.62, whereas when measured for a constant current (MEL$|_I$) is 0.19. The magnetic-field width of the curves at constant voltage and constant current are very similar, corresponding to 10.8~mT at constant voltage and 10~mT at constant current.\n\n\n\n\nThe observation that the MEL effect is considerably larger than the MC effect implies that an applied magnetic field leads to an enhancement in the device's electroluminescence efficiency. The electroluminescence power efficiency, defined as the light output power divided by the electrical input power, is proportional to $EL(B)/I(B)$ at constant voltage, and whereas the EL increases by up to 60\\%, only 30\\% more current is drawn from the voltage source. Because both quantities, $EL(B)$ and $I(B)$, are measured simultaneously in our experiments, we can readily plot the MFE on  internal electroluminescence quantum efficiency $\\eta$ vs. $B$ (see Fig.~\\ref{figMELMC}). Our devices are designed for studies of the MFE  and are not high performance OLEDs, therefore a comparison of the external quantum efficiency of our devices to those of highly optimized OLEDs reported in the literature would not be meaningful. The same material combination used here, however, has been utilized in highly efficient OLEDs\\cite{Goushi2012}. \n\nTADF relies on a ``reverse intersystem crossing'' as its underlying mechanism, which in turn is just an umbrella term for spin-dependent singlet-triplet mixing interactions. We have therefore uncovered that the $\\Delta g$-mechanism studied here makes a significant (and possibly dominant) contribution to this ``reverse intersystem crossing\". Two interesting future research directions therefore become apparent: (i) the use of external $B$-fields to enhance the efficiency of TADF and ultimately exciplex OLEDs and (ii) the use of MFE spectroscopy to study the nature of the spin-dependent processes that are responsible for the ``reverse intersystem crossing''. \n\n\n\n\\section{MFE Enhancement by Device Conditioning} \\label{sec:deviceconditioning}\n\n\n\n\nThe effects seen in Fig.~\\ref{fig3a} are amongst the largest reported in the OMAR literature so far, but Fig.~\\ref{fig3b}{(a) and~(b)} show that the effects, measured in the same device, increase spectacularly to over 500\\% MC and 1000\\% MEL, after so-called ``device conditioning''  was performed. The effect of electrical conditioning of (excitonic) OMAR devices was  reported by Niedermeier et al.\\cite{Niedermeier:2008:PRB}, who found that the MC can be increased from $\\approx$ 1\\% to $\\approx$ 15\\%~{in MEH-PPV devices}. Our conditioning procedure is similar to theirs, and consists of operating the device over a period of time at a relatively high current density. We note for later discussion that the increase in the constant voltage MFE is much larger than the increase in the constant current MFE, although even the constant-current MFE increase is over a factor of 2.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig6.pdf}\n\\caption{\\label{fig3b}\n\\sloppy\n\\noindent\n(a) Magnetoconductance and (b) magnetoelectroluminescence after device conditioning for three representative constant voltages. (c)~Magnetovoltage and (d) magnetoelectroluminescence after device conditioning for three representative constant currents.\nThe same color is used throughout the figure to designate measurements with a comparable current-density. Thick dashed lines are non-Lorentzian (as defined in text) fits to the largest displayed curve in each panel.\n}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig7.pdf}\n\\caption{\\label{fig4a}\n\\sloppy\n\\noindent\n\\rm{({a}) and ({b}) Temperature dependence of magnetic-field-effects in optimally conditioned device. Dashed lines are non-Lorentzian (as defined in text) fits. ({c}) and (d) Arrhenius plot of the saturation magnetic field effect extracted from the data in (a) and ({b}), respectively. Solid lines are fits to an activated Boltzmann law indicating the range of data points used in the fit, whereas the dashed lines are extrapolations to lower temperatures. ({e}) Dependence of the saturation magnetoconductance ($\\Delta I/I$) and magnetoluminescence ($\\Delta EL/EL$) versus the thickness of the co-evaporated layer, whereas ({f}) plots the same quantities versus the composition of the co-evaporated layer.}\n}\n\\end{figure}\n\nWe now present a detailed description of the measurements made in the conditioned device that exhibits the largest MFE. These values were reproduced in several devices.\nFig.~\\ref{fig4a} shows MFE results as a function of various additional experimental parameters and device fabrication specifications, including temperature (Fig.~\\ref{fig4a}(a)-(d)), thickness (Fig.~\\ref{fig4a}(e)) and composition (Fig.~\\ref{fig4a}(f)). The devices shown in this figure follow the same design as the device used in the previous figure but were fabricated from a different batch of materials {(see  section~\\ref{sec:devicefabrication})}. The effects we report are not due to  local shorts or pinholes in the device, as even the optimally conditioned device reported here is stable and operates at a noise level equal or better to that of the unconditioned device (see videos in Supplementary Information\\cite{SupMat}). Fig.~\\ref{fig4a}(a) and~(b) shows that an even more dramatic increase in MC and MEL upon conditioning has been achieved in this device. $B_0$ increases to up to $\\approx 50$ mT upon conditioning. This is much larger than the expected hyperfine strength, $B_{0hf}$, in our materials (also compare with Fig.~\\ref{fig3aa}).\n\n\n\n\nOnly those triplet exciplexes activated to near the singlet level (dashed lines, $T^{\\ast}$, in Fig.~\\ref{fig1}(c)) can be involved in the conversion to singlets. Hence, $G_T < G_S$ in general except at the highest temperatures when the two are equal. From this argument we expect the MFEs to increase with a rise in temperature (due to the increase in $G_T$), in agreement with experiment (Fig.~\\ref{fig4a}(a) and~(b)). At very low temperatures the experimental data does not follow a simple Boltzmann law, but at temperatures above 200 K it agrees with a Boltzmann dependence with an activation energy $\\Delta_{ST} \\approx$ 60 - 80 meV (Fig.~\\ref{fig4a}(c) and~(d)). This compares favorably with literature values\\cite{Goushi2012} obtained from spectroscopic studies covering a similar temperature range as our Boltzmann fit.\nFig.~\\ref{fig4a}(g) shows that the magnitude of the effect increases with increasing device thickness, and Fig.~\\ref{fig4a}(h) shows that the effect is maximal for $x=0.75$ in the mixed layer. Adachi~{\\it et al.} found that $x=0.75$ leads to devices with maximum TADF efficiency.\\cite{adachi2012delayed}\n\n\\subsection{Relationship between constant-current MC and constant-voltage MC}\n\\label{section2}\n\n\n Fig.~\\ref{fig1}(e) shows that the maximum predicted constant-current MEL is 100\\% which is consistent with our constant current measurements, which do not surpass 40\\% [see Fig.~\\ref{fig3b}(d)]. Experimentally, the largest MFEs are observed in the constant-voltage mode, where the effects easily surpass 100\\%. This is possible because the material combination in conjunction with the specified conditioning procedure yields highly nonlinear I-V and EL-V curves.\n\nConverting between the constant voltage and current modes of MC ($\\Delta I/I$ and $\\Delta V/V$, respectively) can be carried out once the I-V relationship is determined. We write the I-V characteristics for magnetic field off and on as\n\n", "itemtype": "equation", "pos": 15856, "prevtext": "\n\n\n\\title{Immense magnetic response of exciplex light emission due to correlated spin-charge dynamics}\n\n\n\\author{Yifei Wang}\n\\thanks{These authors contributed equally to this work}\n\\author{Kevser Sahin-Tiras$^*$, Nicholas J. Harmon, Markus Wohlgenannt, Michael E. Flatt\\'e}\\email{michael\\_flatte@mailaps.org}\n\\affiliation{Department of Physics and Astronomy and Optical Science and Technology Center, University of Iowa, Iowa City, Iowa 52242, USA}\n\n\n\n\n\n\\begin{abstract}\n As carriers slowly move through a disordered energy landscape\n in organic semiconductors, tiny spatial variations in spin dynamics relieve spin blocking at transport bottlenecks\n or in the electron-hole recombination process   that produces light.  Large room-temperature magnetic-field effects (MFE) ensue in the conductivity and luminescence.\nSources of variable spin dynamics  generate much larger MFE if their spatial structure is correlated on the nanoscale with the energetic sites governing conductivity or luminescence such as in co-evaporated organic blends within which the electron resides on one molecule and the hole on the other (an exciplex). Here we show that exciplex recombination in  blends exhibiting thermally-activated delayed fluorescence (TADF) produces MFE in excess of 60\\% at room temperature. In addition, effects greater than 4000\\% can be achieved by tuning the device's current-voltage response curve by device conditioning. These immense MFEs are both the largest reported values for their device type at room temperature. \n Our theory traces this MFE and its unusual temperature dependence to changes in spin mixing between triplet exciplexes and light-emitting singlet exciplexes. In contrast, spin mixing of excitons is energetically suppressed, and thus spin mixing produces comparatively weaker MFE in materials emitting light from excitons by affecting the precursor pairs. \nDemonstration of immense MFE in common organic blends provides a flexible and inexpensive pathway towards magnetic functionality and field sensitivity in current organic devices without patterning the constituent materials on the nanoscale.  Magnetic fields increase the power efficiency of unconditioned devices by 30\\% at room temperature, also showing that magnetic fields may increase the efficiency of the TADF process.\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\nOrganic light-emitting diodes (OLEDs)\\cite{Friend:1999:Nature} based on organic semiconductors are used extensively in flat-panel displays and other lighting, due to their mechanical flexibility and low-cost fabrication. In most OLEDs\n\nelectrons and holes are injected into the device and, upon encountering one another, form a loosely bound state (a polaron-pair) and finally a tightly-bound exciton. Because both the electron and hole carry spin-1/2, these bound states can be spin singlets (total spin 0), or triplets (total spin 1), and they usually form in a 1:3 ratio based on spin degeneracy. Most organic semiconductors are fluorescent materials with an internal electroluminescence quantum efficiency $\\eta$ limited to $\\eta \\approx$ 25\\%  because  only singlet excitons lead to significant electroluminescence\\cite{Rothberg1996}. Recently, triplet-to-singlet up-conversion in thermally-activated delayed fluorescence (TADF) blends has  increased $\\eta$ well above 25\\% \\cite{Goushi2012,Uoyama2012}. TADF requires the exchange splitting between the singlet and triplet states, $\\Delta_{ST}$, to be smaller than or comparable to the thermal energy ($\\approx$ 25 meV at room temperature).\nAs $\\Delta_{ST}$ in excitons is usually orders of magnitude larger, intermolecular excitations or so-called exciplexes,\nwhich have much smaller $\\Delta_{ST}$, are a common choice to achieve TADF.\nIn parallel to these improvements in OLED emission efficiency, recent investigations have identified large magnetic-field sensitive spin effects on the electroluminescence in organic semiconductors \\cite{Kalinowski2003,Mermer:2005:PRB,Prigodin:2006:SynthMet,Desai:2007:PRBphotocurrent,Hu:2007:NatMat,Wang:2012:PRX,Macia2014,Crooker2014,Zhang:2015:NatPhys}. Organic semiconductors also possess an intrinsic magnetoresistive effect, termed organic magnetoresistance (OMAR) which in  magnetic fields, $B$, of just a few mT, is\n$\\approx$ 20\\% at room temperature in a large variety of organic semiconductors\\cite{Mermer:2005:PRB,Prigodin:2006:SynthMet}, and is often accompanied by magnetoelectroluminescence (MEL)\\cite{Kalinowski2003,Mermer:2005:PRB}.\n\nA small $\\Delta_{ST}$ suggests that the spin dynamics of recombination in TADF blends could be dramatically modified by a small magnetic field, producing a very large OMAR effect and improving the efficiency of OLEDs.\n\n\n Here we  show an immense ($>50$\\%) magnetic field effect occurs to both the resistance and the electroluminescence in an organic  blend  already known to possess a large internal quantum efficiency due to TADF. The dramatic enhancement of this magnetic field effect is due to the properties of the singlet-triplet exchange splitting, $\\Delta_{ST}$, which also explains the temperature dependence of the magnetic field effects. The devices were fabricated using typical micron-scale fabrication processes, and do not require any nanoscale structuring of the constituent molecules. Thus this approach appears broadly applicable to a wide variety of organic devices which incorporate TADF blends without complex fabrication. We  experimentally demonstrate in our devices a 30\\% increase in the power efficiency of light emission at room temperature due to the application of a magnetic field, compared to the efficiency of the same device at zero field.\n\nA theory that includes the effects of the singlet-triplet level structure associated with TADF is developed and the immense effects due to interaction of these exciplexes with hyperfine fields and $g$ factor variations  are calculated.  The effects of hyperfine fields and $g$ factor variations oppose each other, so by the demonstrated increased emission with magnetic field we identify $g$ factor variations ({\\it i.e.}, the $\\Delta g$ mechanism \\cite{Wang:2008:PRL, DevirWolfman2014}) as the dominant mechanism of the effect. \n\n We further demonstrate the ability to ``condition'' the organic devices to the point where the change in luminescence or resistance exceeds an order of magnitude, with the largest changes in excess of 4000\\%. Conditioning leads to a decrease in the $\\Delta_{ST}$, which enhances the MFE at constant current, and also an undesirable increase in the device resistance. We thus clarify the connection between magnetic-field effects in current and those in voltage, demonstrating that those effects seen in constant voltage can be amplified through various conditioning procedures, whereas those in constant current are less responsive. The size of these magnetic field effects, $>50$\\%\\ even in unconditioned devices, are the largest reported to date at room temperature.\n\n\\section{Theory}\n\n\n\\begin{figure*}\n\\includegraphics[width=\\linewidth]{Fig1.pdf}\n\\caption{\\label{fig1}\n\\sloppy\n{Exciplexes,  $\\Delta g$ mechanism and hyperfine mechanism for magnetic field effects. \\rm{(a) Schematic of the exciplex with m-MTDATA as the donor and 3TPYMB as the acceptor. The electron (hole) wave function is schematically represented by the orange (grey) oval and are overlaid upon the respective chemical structures. (b) $\\Delta g$ spin mixing between the electron and hole spins (shown to be orthogonal to the applied field $\\bm{B}$) which are initiated at time $t_0$ in the $|T_0\\rangle$ spin configuration. In the top panel, where there is no difference in $g$-factors, the spins remain in their initial configuration. In the lower panel, with non-zero $\\Delta g$, the spinor picks up singlet ($|S\\rangle$) character over time $t_1$. (c) As in (b), but hyperfine spin mixing between electron and hole spins. In this case, spin mixing occurs between all four spin states. (d) Energy diagram of exciplex showing the exchange splitting, $\\Delta_{ST}$, between the singlet and triplet levels. For efficient TADF, $\\Delta_{ST}$ should be similar in magnitude to the thermal energy $k_B T$. The much quicker singlet recombination (with rate $k_S$) is depicted by the thicker arrow compared to triplet recombination (with rate $k_T$) and luminescence is assumed only for the singlet recombination. Spin-mixing occurs due to the $\\Delta g$ mechanism (i.e. transitions between $S$ and the activated $T_0$ level of $T^{\\ast}$) and the hyperfine mechanism (i.e. transitions between $S$ and all activated triplet levels of $T^{\\ast}$). (e) Theoretical calculations for the MEL$=\\Delta EL/EL$ at large field with the $\\Delta g$-mechanism ($B_{0hf} = 0$).\n(f) Theoretical calculations for the MEL$=\\Delta EL/EL$ from hyperfine spin mixing at large field ($\\Delta g = 0$). Increasing either $G_T/G_S$ or $B_{0hf}$ causes the MEL to be more negative for exciplex recombination values. Orange lines are $G_T/G_S = 0.25$ and black lines are $G_T/G_S = 1$ . For (e) and (f), $k_D$ is the exciplex dissociation rate, and $G_S$ is the singlet exciplex generation rate, whereas $G_T$ is the generation rate for thermally activated triplet exciplexes (see text for additional details).\n}}\n}\n\\end{figure*}\n\n\nIn this section the effects of magnetic fields on spatially-separated entities, such as the electrons and holes composing exciplexes, are contrasted with the effects of magnetic fields on excitons in organic semiconductors, and a theory is developed to describe exciplex magnetic-field effects.\nMagnetic field effects  in organic semiconductors occur when spin-carrying (paramagnetic) entities, such as electrons, holes, or triplet excitons react with each other in spin-selective ways to form charge-neutral excitons\\cite{Kalinowski2003}, doubly-charged bipolarons \\cite{Bobbert:2007:PRL}, trap-coupled carriers\\cite{Harmon2014}, or ``trions\" \\cite{Janssen:2013:NC}. The spin-selective recombination can be influenced by local or global fields, or any other process that produces a magnetic-field-dependent reaction rate. When the reaction involves  exciplexes then  the electrons and holes are located on two distinct molecules, as shown in Fig.~\\ref{fig1}(a). In order to enhance the possibilities of exciplex formation these two types of molecules are commonly evaporated together (co-evaporated). For exciplexes the behavior of the electron and hole  spins can differ considerably, as these electronic excitations reside on different molecules.\n\n\nSpatially inhomogenous (quasi)magnetic fields also lead to spin-mixing\\cite{Wang:2008:PRL,Wang:2012:PRX,Macia2014, DevirWolfman2014}, including {\\it the $\\Delta$B mechanism}, which arises in situations where there a large magnetic field gradients present, leading to a locally varying spin-precession frequency\\cite{Wang:2012:PRX,Macia2014}, and {\\it the $\\Delta$g mechanism} [see Fig.~\\ref{fig1}(b)], which is very similar but the variation of the precession frequency is due to different proportionalities of the spin precession to the magnetic field (Land\\'e $g$ factor) on neighboring molecules as illustrated in Fig.~\\ref{fig1}(b). The $g$ factor  differs from the free electron value because of material-dependent interactions including spin-orbit coupling. The $\\Delta$g mechanism has recently been identified as the dominant MFE in several organic and hybrid perovskite systems.\\cite{Wang:2008:PRL,Zhang:2015:NatPhys,DevirWolfman2014}\n\nAnother major source of spin dynamics is {\\it the hyperfine mechanism} [see Fig.~\\ref{fig1}(c)]. Every molecule, denoted by $i$, possesses a local hyperfine field, $\\bm{B}_{hf,i}$, on the order of mT, due mainly to the magnetic moment of hydrogen nuclei about which the paramagnetic spin will precess. The hyperfine field direction varies randomly from site to site and therefore causes spin-mixing in paramagnetic pairs on neighboring molecules. A spatially uniform externally applied field exceeding the hyperfine strength suppresses this spin mixing and therefore changes the reaction rate between the entities, which can have an amplified effect on transport in the percolative regime\\cite{Harmon:2012:PRL}.\n\nTADF exciplex devices are a promising material system for constructing organic semiconductor devices with immense magnetic field effects. In essence, a limit on the magnetic field effect achievable via the so-called exciton mechanism is eliminated in TADF exciplex materials. In the exciton mechanism\\cite{Kalinowski2003,Prigodin:2006:SynthMet}, electrons and holes located on neighboring molecules form a polaron pair, and spin mixing through the mechanisms above is permitted. The next step in the evolution of polaron pairs is the spin-conserving formation of an exciton (in which both carriers inhabit the same molecule).  Once the excitons form, because of the large $\\Delta_{ST}$, further spin mixing is not energetically allowed. Although the rates for singlet and triplet exciton formation rates are different, i.e. $k_S \\neq k_T$,  both channels are spin-allowed exothermic transitions. In contrast,  for TADF exciplex materials in which $\\Delta_{ST}$ is of the order of the thermal energy, as shown in Fig.~\\ref{fig1}(d),  singlet-triplet transitions readily occur upon thermal activation and exciplexes play the role of polaron pairs described in the exciton mechanism above. In these materials singlet exciplexes can decay radiatively directly to the singlet ground state, whereas triplet exciplexes cannot unless a spin-flip occurs (i.e. phosphorescence). Therefore  the situation is that the singlet channel is spin allowed, whereas the triplet channel is spin ``forbidden\". Thus, $k_S \\gg k_T$, and a very large MFE should be possible, for both the $\\Delta g$ and hyperfine mechanisms.\n\n\n\nThe theoretical effects of $\\Delta g$ ($\\equiv g_1 - g_2$) and hyperfine interactions on the spin dynamics and resulting MEL and MC for TADF blends can be calculated from the stochastic Liouville equation for the two-spin density matrix, $\\rho$:\\cite{Haberkorn1976}\n\\begin{eqnarray}\\label{eq:SLE}\n\\frac{\\partial \\rho}{\\partial t} &=&  - \\frac{i}{\\hbar} [H_0 + H_{\\Delta g} + H_{hf} + H_{hf, \\Delta g},  \\rho] {}\\nonumber\\\\\n&&{} -\\frac{1}{2} \\{  k_S P_S + k_T P_T, \\rho \\} - k_D \\rho + G,\n\\end{eqnarray}\nwhere the Hamiltonians are\n\\begin{eqnarray}\n&&H_0 = \\frac{g_1+g_2}{2} \\mu_B B \\hat{z} \\cdot (\\bm{S}_1 + \\bm{S}_2), \\ \\ \\ H_{\\Delta g} = \\frac{\\Delta g}{2} \\mu_B B \\hat{z} \\cdot (\\bm{S}_1 - \\bm{S}_2 ),\\nonumber\\\\\n && {}H_{hf} = \\frac{g_1+g_2}{2} \\mu_B (\\bm{B}_{hf,1}\\cdot \\bm{S}_1 + \\bm{B}_{hf,2} \\cdot \\bm{S}_2 ),\\nonumber\\\\\n && {}H_{hf, \\Delta g} = \\frac{\\Delta g}{2} \\mu_B (\\bm{B}_{hf,1}\\cdot \\bm{S}_1 - \\bm{B}_{hf,2} \\cdot \\bm{S}_2 ),\n\\end{eqnarray}\n$P_S$ and $P_T = P_{T,0} + P_{T,+} + P_{T,-}$ are the singlet and (total) triplet projection operators, and the curly braces denote the anticommutator. The two hyperfine fields are drawn from a Gaussian distribution with width $B_{0hf}$. $G$ is a diagonal matrix with elements $G_S$ and $G_{T,+}=G_{T,0}=G_{T,-}=G_T$ for the generation of singlet and triplet exciplexes, respectively. We assume that all three triplet spin eigenstates have the same generation rate. We also assume that the rate of exciplex formation is unchanged by the presence of the magnetic field, and thus $G_S$ and $G_T$ are constant. Dissociation of the exciplex is also included in the theory with a rate $k_D$.\nWe consider a steady-state condition and solve for the steady state density matrix. EL is estimated from the singlet fraction of exciplexes as EL $= k_S X_S = k_S Tr[P_S \\rho]$.\n\nIn general, solutions to Equation (\\ref{eq:SLE}) must proceed numerically. However, in the limit of negligible hyperfine fields, solutions for the $\\Delta g$ induced MEL can be expressed analytically.\nIn this case we find\n\\begin{widetext}\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:MELeq}\nMEL = \\left[\\frac{G_T (k_D + k_S) - G_S (k_D+k_T)}{G_S(2 k_D + k_S + k_T)}\\right] \\frac{(\\Delta g \\mu_B B/\\hbar)^2}{{(k_D + k_T) (k_D + k_S)}+(\\Delta g \\mu_B B/\\hbar)^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"MEL=\\left[\\frac{G_{T}(k_{D}+k_{S})-G_{S}(k_{D}+k_{T})}{G_{S}(2k_{D}+k_{S}+k_{T%&#10;})}\\right]\\frac{(\\Delta g\\mu_{B}B/\\hbar)^{2}}{{(k_{D}+k_{T})(k_{D}+k_{S})}+(%&#10;\\Delta g\\mu_{B}B/\\hbar)^{2}}.\" display=\"block\"><mrow><mrow><mrow><mi>M</mi><mo>⁢</mo><mi>E</mi><mo>⁢</mo><mi>L</mi></mrow><mo>=</mo><mrow><mrow><mo>[</mo><mfrac><mrow><mrow><msub><mi>G</mi><mi>T</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>D</mi></msub><mo>+</mo><msub><mi>k</mi><mi>S</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>G</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>D</mi></msub><mo>+</mo><msub><mi>k</mi><mi>T</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mi>G</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>k</mi><mi>D</mi></msub></mrow><mo>+</mo><msub><mi>k</mi><mi>S</mi></msub><mo>+</mo><msub><mi>k</mi><mi>T</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>]</mo></mrow><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><msub><mi>μ</mi><mi>B</mi></msub><mo>⁢</mo><mi>B</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">ℏ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>D</mi></msub><mo>+</mo><msub><mi>k</mi><mi>T</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>D</mi></msub><mo>+</mo><msub><mi>k</mi><mi>S</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><msub><mi>μ</mi><mi>B</mi></msub><mo>⁢</mo><mi>B</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">ℏ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03621.tex", "nexttext": "\nand by the definition of MC, we write:\n\n", "itemtype": "equation", "pos": 37250, "prevtext": "\n\\end{widetext}\n\n\n\n\nThe values of the MEL at large field for the $\\Delta g$ mechanism, from Eq.~(\\ref{eq:MELeq}), are shown  in Fig.~\\ref{fig1}(e) for $k_D = 0$ and for various values of $G_T/G_S$ and $k_T/k_S$. The situation for exciplex recombination corresponds to $k_T/k_S\\ll 1$, which will allow magnetic field effects as large as 100\\% if $G_T/G_S\\approx 1$, and produces a {\\it positive} MEL. For exciton recombination $k_T/k_S\\sim 1$, which produces a much smaller magnetic field effect, as seen in Fig.~\\ref{fig1}(e). The sign of the MEL for the $\\Delta g$ mechanism differs considerably from MEL caused by the hyperfine mechanism, for which a {\\it negative} MEL is expected\\cite{Kersten2011}. The values of the MEL at large field for the hyperfine interaction are shown in Fig.~\\ref{fig1}(f) for $G_T/G_S=1$ and $G_T/G_S= 0.25$, and two values of the hyperfine field. A decrease in the $\\Delta_{ST}$ will produce a larger magnitude MEL in the experimentally-relevant regime of $k_T/k_S\\ll 1$, whether the mechanism is the $\\Delta g$ mechanism or the hyperfine mechanism.\n\nAs the exciplex formation rate is directly related to the current through a device, the assumption of a constant formation rate corresponds to assuming a constant-current experimental condition for evaluating the effects of a magnetic field. Under conditions where the resistance changes substantially in the presence of a magnetic field this assumption must be examined anew, and thus the MEL measured under constant voltage conditions (MEL$|_V$), for which the current and resistance changes substantially, will differ from the MEL measured under constant current conditions (MEL$|_I$).\n\nOur theory directly yields a magnetoluminescence response from the $\\Delta g$ and hyperfine mechanisms, but, at first sight, does not address the magnetoconductance (MC). As shall be presented below, however, a sizeable magnetoconductance that is smaller but roughly comparable in magnitude (up to a factor of 2-3) is always measured alongside the MEL response. It was  recognized in the early days of OMAR research that the exciton mechanism for MEL (which in this aspect behaves similarly to our exciplex mechanism for MEL) immediately produces a concomitant MC response\\cite{Bergeson2008}. In short, the electron and hole densities are large close to their respective injecting electrode. If the electron-hole recombination is efficient (and {\\it mutatis mutandis} for inefficient recombination) there will be little spatial overlap of the two densities in the center of the device. This is because electrons and hole will immediately recombine in any part of the device where the two densities overlap. Therefore the majority of the device is electrically charged, limiting the conductance by the so-called space-charge limited current law. Any magnetic-field dependent recombination rate (as in our exciplex mechanism) will change the width of the portion of the device where the two densities overlap and space-charge cancellation occurs, thus producing a change in the conductance. Thus we assume the same functional dependence on magnetic field for the MC as for the MEL for this exciplex theory.\n\n\\section{Device Composition and Fabrication} \\label{sec:devicefabrication}\n\nOur TADF devices, schematically shown in Fig.~\\ref{fig2ab}(a), are thin film devices with several layers deposited sequentially onto a glass slide with patterned indium-tin-oxide (ITO) electrodes. We use a materials combination for the primary layer that is known to produce a large  internal electroluminescence quantum efficiency $\\eta$ due to TADF\\cite{Goushi2012}:  4,4,4-tris[3-\nmethylphenyl(phenyl)amino]triphenylamine (m-MTDATA) as donors and tris-[3-(3-pyridyl)mesityl]borane (3TPYMB) as acceptors. \nThe m-MTDATA  ($>99\\%$ pure) was purchased from Sigma-Aldrich and two batches with different purities of 3TPYMB ($>99.2\\%$ pure, used for data in Figs.~\\ref{fig6}-\\ref{fig4b} and $>99.8\\%$ pure, used in all other figures) were purchased from Lumtec (Luminescence Technology Corp.). The materials were used as received.\n\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig2.pdf}\n\\caption{\\label{fig2ab}\n\\sloppy\n\\noindent\n {Exciplex device structure and emission spectrum.}\n({a}) Schematic device structure showing the two measurement modes used. The solid circuit is for a constant voltage measurement, whereas the dashed circuit is for a constant current.\n({b}) Electroluminescence spectrum for our device (red dashed line), compared with exciplex emission (solid black line) and exciton emission spectra (solid blue and green lines) taken from the literature.\\cite{Goushi2012} This shows that exciplexes are responsible for EL in our devices.\n}\n\\end{figure}\n\n After careful cleaning of the ITO/glass substrate in solvents, followed by plasma treatment, the organic layers were fabricated by thermal evaporation under high vacuum  at $10^{-7}$ mbar.\nIn our devices {the} primary layer consists of co-evaporated m-MTDATA:3TPYMB with a mass fraction of x\\% 3TPYMB. All our figures are for x=75\\% unless otherwise stated, as this resulted in the largest magnetoelectroluminescence.\n A cathode layer consisting of calcium (covered by a protective layer of aluminum to increase air-stability) was deposited by thermal evaporation in most devices, but e-beam evaporation was used for some devices. The active device area was about $0.6\\times0.6$ mm$^{2}$.\n\n The structure of the devices that gave the largest effects was ITO/m-MTDATA (15 nm)/25 wt\\%-m-MTDATA: 3TPYMB (180nm)/3TPYMB (15 nm)/Ca (30 nm)/Al (60 nm). During the co-evaporation of the 25 wt\\%-m-MTDATA:3TPYMB, m-MTDATA was deposited at a rate of 0.1~nm/s and 3TPYMB at 0.3~nm/s.\nFig.~\\ref{fig2ab}(b) shows the spectrum of the electroluminescence from these layers, compared with emission from excitons in either of the two constituents, and confirms that exciplexes indeed form in our devices\\cite{Goushi2012}.\n\n\nThe control  devices, with organic luminescent or resistive layers  of Poly[2-methoxy-5-(2-ethylhexyloxy)-1,4-phenylenevinylene] (MEH-PPV, see Fig.~\\ref{fig3aa}(a)) or Tris(8-hydroxyquinolinato)aluminium (Alq$_3$, see Fig.~\\ref{fig3aa}(b)), consist of a thin film of the organic semiconductor sandwiched between a top and bottom electrode. The indium tin oxide (ITO, 100 nm) coated glass substrates were obtained from Delta Technologies. The substrates were cleaned in an ultrasonic bath using acetone, methanol and isopropanol followed by oxygen plasma cleaning. The conducting polymer poly(3,4-ethylenedioxythiophene)-poly(styrenesulfonate) (PEDOT), purchased from Ossila Ltd., was spin coated at 4000 revolutions per minute (rpm) on top of the ITO to provide an efficient hole injecting electrode. All other manufacturing steps were carried out in a nitrogen glove box. The MEH-PPV (used as purchased from Sigma Aldrich) films were spin-coated from a toluene solution with concentration 5 mg/mL. The Alq$_3$ (used as purchased from Sigma Aldrich) films were thermally evaporated in high vacuum onto the PEDOT covered substrate. The organic semiconductor layer thickness was $\\approx$ 150 nm. The cathode layer consisting of calcium and aluminum was deposited by thermal evaporation or e-beam evaporation at a base pressure of $10^{-7}$ mbar on top of the organic semiconductor layer. The active device area was roughly $0.6\\times0.6$ mm$^{2}$.\n\n\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig3.pdf}\n\\caption{\\label{fig3aa}\n{Molecular structures of  MEH-PPV (a) and Alq$_3$ (b) that have been used in control experiments. Typical magnetconductance (red) and magnetoelectroluminescence (blue) in  MEH-PPV (c) and  Alq$_3$ (d) control devices that are dominated by exciton emission. The dashed black lines represent fits to the non-Lorentzian lineshape (see text)}\n}\n\\end{figure}\n\n\n\n\nMFE measurements were performed with the device mounted inside a closed-cycle He cryostat placed between two poles of an electromagnet.  All data shown in this article were measured at room temperature, unless specified otherwise. The devices were driven at either a constant voltage V or a constant current I using a Keithley 2400 Source Meter. The particular current and voltage bias levels were chosen in pairs such that they corresponded to similar driving conditions. The electroluminescence intensity was measured using a photomultiplier tube which was shielded from the magnetic field during sweeps. For the optimal device conditioning procedure (see section~\\ref{sec:deviceconditioning}), the devices were driven around a current density of 30 mA/cm$^{2}$ for 40 mins. Several MC/MEL traces were taken during the conditioning process to monitor the conditioning effectiveness and to find the optimal conditioning point.\n\nThe MFE can be detected either by measuring $I$ as a function of $B$, or, alternatively  by measuring the electroluminescence (EL) as a function of $B$. These two measurements are performed simultaneously  [see Fig.~\\ref{fig2ab}(a)] when either the applied device voltage is kept constant (measuring a change $\\Delta I(B)$ and $\\Delta EL(B)$), or when the device current is kept constant (measuring a change in applied voltage $\\Delta V(B)$ and $\\Delta EL(B)$ ). The MFE, $\\Delta x/x$, in all these quantities is defined as $[x(B)-x(0)]/x(0)$.\n\n\nFigure~\\ref{fig3aa} shows the magnetic field effects in MEH-PPV and Alq$_3$ devices.  These results will serve as a reference point for the discussion of the new types of MFE observed in the TADF devices. MEH-PPV and Alq$_3$ were chosen because their MFEs have been extensively characterized in the OMAR literature\\cite{Kalinowski2003,Mermer:2005:PRB} and device conditioning was first reported for MEH-PPV devices\\cite{Niedermeier:2008:PRB}.  For typical MFEs the dependence of conductivity (or luminescence) on magnetic field is commonly  either Lorentzian, $\\Delta I(B)/I \\propto B^2/(B^2+B_0^2)$, or follows a specific non-Lorentzian form, $\\Delta I(B)/I \\propto B^2/(|B|+B_0)^2$, for the change in the current $I$ where $B_0 \\approx 5$ mT\\cite{Mermer:2005:PRB}. We find that the data  in Fig.~\\ref{fig3aa} can be accurately fitted by the non-Lorentzian expression. \n\n\\section{Magnetic Field Effects in Unconditioned Exciplex Devices}\\label{unconditioned}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig4.pdf}\n\\caption{\\label{fig3a}\n\\sloppy\n\\noindent\n(a) Magnetoconductance (MC) and (b) magnetoelectroluminescence (MEL) before device conditioning for three representative constant voltages. (c)~Magnetovoltage and (d) magnetoelectroluminescence before device conditioning for three representative constant currents.\nThe same color is used throughout the figure to designate measurements with a comparable current-density. Thick dashed lines are non-Lorentzian (as defined in text) fits to the largest displayed curve in each panel.}\n\\end{figure}\n\n\n\nFigure~\\ref{fig3a} shows measurements of MFE in as-prepared (unconditioned) devices for both constant voltage and constant current measurements. Figure~\\ref{fig3a}(a) and~(b) shows that these devices exhibit sizable magnetoconductance and magnetoluminescence effects of up to 30\\% and 60\\%, respectively, for constant voltage measurements, whereas the effects for constant current measurements are smaller.\nThe data in Fig.~\\ref{fig3a} is well-fit by the non-Lorentzian expression, as Fig.~\\ref{fig3aa} was.\nThe large (60\\%) positive MEL is the largest reported in organic semiconductors and remarkably, is completely at odds with the hyperfine mechanism where MEL $\\sim$ $-$50\\% is predicted for exciplexes (where $k_S > k_T$).\n\n\nHowever, our observations are consistent with the $\\Delta g$ mechanism operating; the dominance of the $\\Delta g$ mechansim is not surprising for MEL and MC in TADF materials because (1) the $g$-factors for two polaron spins ($\\bm{S}_1$ and $\\bm{S}_2$) on different adjacent molecules ($g_1$ and $g_2$) are expected to vary much more than for identical molecules and (2) McConnell's rule\\cite{McConnell1958} states that $B_{0HF} \\approx (2-3mT)/\\sqrt{N}$ in molecules with $N$ hydrogen atoms. Whereas our molecules in Fig.~\\ref{fig1}(a) do not contain many more hydrogens than other molecular organic semiconductors where hyperfine spin-mixing is dominant, the rapid dissociation and association of the exciplex effectively further delocalizes the polarons and reduces the hyperfine interaction.\\cite{Dodin2013}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig5.pdf}\n\\caption{\\label{figMELMC}\n\\sloppy\nMagnetic field effect on electroluminescence efficiency $\\eta$ in the pristine device for three representative constant voltages. The curves shown here are for the same device and experimental data set as in Fig.~\\ref{fig3a} (a) and (b).\n}\n\\end{figure}\n\nThe data shown in Fig.~\\ref{fig3a} are fit to Eq.~(\\ref{eq:MELeq}). During this fit $k_S$ and $\\Delta g$ are kept constant. $k_S$ has been determined to be $3\\times 10^6$~s$^{-1}$ for a similar combination of materials\\cite{Goushi2012}. In other organic materials, $\\Delta g$  has been found to be on the order of $10^{-3}-10^{-4}$.\\cite{Graeff2005, Yu2012} We fix $\\Delta g=10^{-4}$, corresponding to the low end of that spectrum.  The crucial fitting parameters are $k_D$ and $G_T/G_S$. $k_D \\sim 10^4$~s$^{-1}$, whereas $k_T$ is considerably smaller than $k_D$ and can therefore be assumed zero. Assuming that $G_T=G_S$ at high temperature, the value $G_T/G_S=0.19$ we find from our fit corresponds to an activation energy of $42$~meV, consistent with the TADF behavior.\n\n\nThe maximum change in the electroluminescence with an applied field, relative to the zero-field electroluminescence, measured for a constant voltage (MEL$|_V$) is 0.62, whereas when measured for a constant current (MEL$|_I$) is 0.19. The magnetic-field width of the curves at constant voltage and constant current are very similar, corresponding to 10.8~mT at constant voltage and 10~mT at constant current.\n\n\n\n\nThe observation that the MEL effect is considerably larger than the MC effect implies that an applied magnetic field leads to an enhancement in the device's electroluminescence efficiency. The electroluminescence power efficiency, defined as the light output power divided by the electrical input power, is proportional to $EL(B)/I(B)$ at constant voltage, and whereas the EL increases by up to 60\\%, only 30\\% more current is drawn from the voltage source. Because both quantities, $EL(B)$ and $I(B)$, are measured simultaneously in our experiments, we can readily plot the MFE on  internal electroluminescence quantum efficiency $\\eta$ vs. $B$ (see Fig.~\\ref{figMELMC}). Our devices are designed for studies of the MFE  and are not high performance OLEDs, therefore a comparison of the external quantum efficiency of our devices to those of highly optimized OLEDs reported in the literature would not be meaningful. The same material combination used here, however, has been utilized in highly efficient OLEDs\\cite{Goushi2012}. \n\nTADF relies on a ``reverse intersystem crossing'' as its underlying mechanism, which in turn is just an umbrella term for spin-dependent singlet-triplet mixing interactions. We have therefore uncovered that the $\\Delta g$-mechanism studied here makes a significant (and possibly dominant) contribution to this ``reverse intersystem crossing\". Two interesting future research directions therefore become apparent: (i) the use of external $B$-fields to enhance the efficiency of TADF and ultimately exciplex OLEDs and (ii) the use of MFE spectroscopy to study the nature of the spin-dependent processes that are responsible for the ``reverse intersystem crossing''. \n\n\n\n\\section{MFE Enhancement by Device Conditioning} \\label{sec:deviceconditioning}\n\n\n\n\nThe effects seen in Fig.~\\ref{fig3a} are amongst the largest reported in the OMAR literature so far, but Fig.~\\ref{fig3b}{(a) and~(b)} show that the effects, measured in the same device, increase spectacularly to over 500\\% MC and 1000\\% MEL, after so-called ``device conditioning''  was performed. The effect of electrical conditioning of (excitonic) OMAR devices was  reported by Niedermeier et al.\\cite{Niedermeier:2008:PRB}, who found that the MC can be increased from $\\approx$ 1\\% to $\\approx$ 15\\%~{in MEH-PPV devices}. Our conditioning procedure is similar to theirs, and consists of operating the device over a period of time at a relatively high current density. We note for later discussion that the increase in the constant voltage MFE is much larger than the increase in the constant current MFE, although even the constant-current MFE increase is over a factor of 2.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig6.pdf}\n\\caption{\\label{fig3b}\n\\sloppy\n\\noindent\n(a) Magnetoconductance and (b) magnetoelectroluminescence after device conditioning for three representative constant voltages. (c)~Magnetovoltage and (d) magnetoelectroluminescence after device conditioning for three representative constant currents.\nThe same color is used throughout the figure to designate measurements with a comparable current-density. Thick dashed lines are non-Lorentzian (as defined in text) fits to the largest displayed curve in each panel.\n}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig7.pdf}\n\\caption{\\label{fig4a}\n\\sloppy\n\\noindent\n\\rm{({a}) and ({b}) Temperature dependence of magnetic-field-effects in optimally conditioned device. Dashed lines are non-Lorentzian (as defined in text) fits. ({c}) and (d) Arrhenius plot of the saturation magnetic field effect extracted from the data in (a) and ({b}), respectively. Solid lines are fits to an activated Boltzmann law indicating the range of data points used in the fit, whereas the dashed lines are extrapolations to lower temperatures. ({e}) Dependence of the saturation magnetoconductance ($\\Delta I/I$) and magnetoluminescence ($\\Delta EL/EL$) versus the thickness of the co-evaporated layer, whereas ({f}) plots the same quantities versus the composition of the co-evaporated layer.}\n}\n\\end{figure}\n\nWe now present a detailed description of the measurements made in the conditioned device that exhibits the largest MFE. These values were reproduced in several devices.\nFig.~\\ref{fig4a} shows MFE results as a function of various additional experimental parameters and device fabrication specifications, including temperature (Fig.~\\ref{fig4a}(a)-(d)), thickness (Fig.~\\ref{fig4a}(e)) and composition (Fig.~\\ref{fig4a}(f)). The devices shown in this figure follow the same design as the device used in the previous figure but were fabricated from a different batch of materials {(see  section~\\ref{sec:devicefabrication})}. The effects we report are not due to  local shorts or pinholes in the device, as even the optimally conditioned device reported here is stable and operates at a noise level equal or better to that of the unconditioned device (see videos in Supplementary Information\\cite{SupMat}). Fig.~\\ref{fig4a}(a) and~(b) shows that an even more dramatic increase in MC and MEL upon conditioning has been achieved in this device. $B_0$ increases to up to $\\approx 50$ mT upon conditioning. This is much larger than the expected hyperfine strength, $B_{0hf}$, in our materials (also compare with Fig.~\\ref{fig3aa}).\n\n\n\n\nOnly those triplet exciplexes activated to near the singlet level (dashed lines, $T^{\\ast}$, in Fig.~\\ref{fig1}(c)) can be involved in the conversion to singlets. Hence, $G_T < G_S$ in general except at the highest temperatures when the two are equal. From this argument we expect the MFEs to increase with a rise in temperature (due to the increase in $G_T$), in agreement with experiment (Fig.~\\ref{fig4a}(a) and~(b)). At very low temperatures the experimental data does not follow a simple Boltzmann law, but at temperatures above 200 K it agrees with a Boltzmann dependence with an activation energy $\\Delta_{ST} \\approx$ 60 - 80 meV (Fig.~\\ref{fig4a}(c) and~(d)). This compares favorably with literature values\\cite{Goushi2012} obtained from spectroscopic studies covering a similar temperature range as our Boltzmann fit.\nFig.~\\ref{fig4a}(g) shows that the magnitude of the effect increases with increasing device thickness, and Fig.~\\ref{fig4a}(h) shows that the effect is maximal for $x=0.75$ in the mixed layer. Adachi~{\\it et al.} found that $x=0.75$ leads to devices with maximum TADF efficiency.\\cite{adachi2012delayed}\n\n\\subsection{Relationship between constant-current MC and constant-voltage MC}\n\\label{section2}\n\n\n Fig.~\\ref{fig1}(e) shows that the maximum predicted constant-current MEL is 100\\% which is consistent with our constant current measurements, which do not surpass 40\\% [see Fig.~\\ref{fig3b}(d)]. Experimentally, the largest MFEs are observed in the constant-voltage mode, where the effects easily surpass 100\\%. This is possible because the material combination in conjunction with the specified conditioning procedure yields highly nonlinear I-V and EL-V curves.\n\nConverting between the constant voltage and current modes of MC ($\\Delta I/I$ and $\\Delta V/V$, respectively) can be carried out once the I-V relationship is determined. We write the I-V characteristics for magnetic field off and on as\n\n", "index": 3, "text": "\\begin{equation}\nI_0 = V^{\\alpha},\\qquad I_B = (V-\\Delta V )^{\\alpha}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"I_{0}=V^{\\alpha},\\qquad I_{B}=(V-\\Delta V)^{\\alpha}\" display=\"block\"><mrow><mrow><msub><mi>I</mi><mn>0</mn></msub><mo>=</mo><msup><mi>V</mi><mi>α</mi></msup></mrow><mo rspace=\"22.5pt\">,</mo><mrow><msub><mi>I</mi><mi>B</mi></msub><mo>=</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>V</mi><mo>-</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>V</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mi>α</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03621.tex", "nexttext": "\nwhich is an exact expression.\nBy the binomial series expansion, we obtain leading order terms\n\n", "itemtype": "equation", "pos": 37374, "prevtext": "\nand by the definition of MC, we write:\n\n", "index": 5, "text": "\\begin{equation} \\label{equ:constantItoVconversion}\nMC = \\frac{I_B - I_0}{I_0} =  \\Big(1-\\frac{\\Delta V}{V}\\Big)^{\\alpha}-1\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"MC=\\frac{I_{B}-I_{0}}{I_{0}}=\\Big{(}1-\\frac{\\Delta V}{V}\\Big{)}^{\\alpha}-1\" display=\"block\"><mrow><mrow><mi>M</mi><mo>⁢</mo><mi>C</mi></mrow><mo>=</mo><mfrac><mrow><msub><mi>I</mi><mi>B</mi></msub><mo>-</mo><msub><mi>I</mi><mn>0</mn></msub></mrow><msub><mi>I</mi><mn>0</mn></msub></mfrac><mo>=</mo><mrow><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>V</mi></mrow><mi>V</mi></mfrac></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mi>α</mi></msup><mo>-</mo><mn>1</mn></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03621.tex", "nexttext": "\n\nThe exponent of the nonlinearity, $\\alpha$, has been associated with trap-limited transport when the trap energies follow an exponential density of states.\\cite{Mark1962} The reader should note that the MC at constant voltage increases linearly (to first order) with $\\alpha$. Therefore, any process that increases $\\alpha$ will likely increase the observed MC. This ``$\\alpha$-enhancement\" allows MFE at constant voltage to significantly exceed the 100\\% maximum predicted by our theory for the constant-current effect.\n\n\n\n\n\\subsection{Effect of electrical conditioning on $IV$ and $EL-V$ characteristics}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig8.pdf}\n\\caption{\\label{fig5}\nCurrent-voltage ({a}) and electroluminescence-voltage ({b}) curves for different stages of device conditioning (protocols of the conditioning are specified as labels to the curves of  ({a}); other panels use same color coding).  Dashed (solid) lines are measurements at $B = 0$ ($0.3$) T.\nConstant voltage ({c}), ({d}) and constant current ({e}), ({f}) magnetic-field-effect measurements for varying device conditioning.}\n\\end{figure}\n\nWe now examine the effect of electrical conditioning on the current-voltage (I-V) and electro-luminescence-voltage (EL-V) characteristics of the device.\nFigure~\\ref{fig5} shows that $\\alpha$ increases with device conditioning. Figure~\\ref{fig5}(a) shows the I-V characteristics of the pristine device (``0 min\") and the same device after several device conditioning operations (the current levels and conditioning times are assigned). Each conditioning step is performed on the device that was already conditioned by the cumulative prior steps. Data curves measured with an applied B-field of 0.3 T are shown as solid lines, and the zero-field characteristics are shown as dashed lines. The figure shows that the I-V curves shift to higher voltages, with an onset voltage of about 5 V and 25 V for the pristine and maximally conditioned device, respectively (further device conditioning would lead to a rapid device degradation and ultimately device failure). Both the I-V and EL-V traces are approximately given by a power law with exponent $\\alpha$.  At the same time it is observed that the dependence of $I$ on $V$ becomes increasingly non-linear ($I \\propto V^\\alpha$) with the exponent $\\alpha$ increasing from approximately 6.5 to 30. Comparing the solid and dashed lines, we find that phenomenologically the effect of the applied magnetic field is a parallel-shift of the I-V traces by a negative amount $\\Delta V$. Similar behavior characterizes the EL-V traces shown in Fig.~\\ref{fig5}(b).\n\n\n\n\n\n\\begin{table*}[]\n\\centering\n\\caption{Effect of various device conditioning procedures on a square device $0.6$~mm on a side (see Section~\\ref{sec:devicefabrication} for details). The row number of the table signifies increasing conditioning times and /or currents. Specifically ``Before Device Conditioning\" is for zero conditioning time, ``First Device Conditioning\" is for 3 mins conditioning at 0.1~mA, ``Second Device Conditioning\" refers to an additional conditioning of 10 mins  at 0.1~mA plus an additional 3~mins at 0.2~mA, whereas ``After Device Conditioning\" signifies an additional conditioning for 15 mins  at 0.2~mA resulting in the optimally conditioned device. The first four columns contain directly measured quantities: MEL$|_{V}$ (MEL$|_{I}$) is the maximum MEL measured for a constant voltage (current), $B_0|_V$ ($B_0|_I$) is the half-width at quarter-maximum and is also the parameter entering into the non-Lorentzian empirical law. The next two columns show quantities that can be calculated from the measured data without reference to any theory: $\\alpha$ is the exponent of the device's non-linear I-V characteristics (see Section~\\ref{section2}) and $\\eta$ is the relative electroluminescence efficiency ($\\eta \\equiv 1$ for the pristine device). The remaining quantities were extracted from fits to our theory (see text).}\n\\label{my-table}\n\\begin{tabular}{ c   c   c   c   c   c   c   c   c   c   c }\n\\hline\\hline\n\\begin{tabular}[c]{@{}c@{}}Device Conditioning\\end{tabular} & MEL$|_{V}$ & MEL$|_{I}$ & $B_0$ $|_ {V}$ (mT) & $B_0$ $|_ {I}$ (mT) & $\\frac{MEL|_{V}}{MEL|_{I}} $ & $\\alpha$ & $\\eta$ & $k_D$ (s$^{-1}$) & $\\frac{G_T}{G_S}$ & $\\Delta_{ST}$ (meV) \\\\ \\hline\nBefore Device Conditioning                                                     & 0.62  & 0.19  & 10.8     & 10       & 3.27    & 13.4  & 1     & $1\\times10^{4}$ & 0.19  & 42  \\\\ \nFirst Device Conditioning                                                        & 1.15  & 0.23  & 11.3     & 9.5      & 5.00    & 16.2  & 0.38  & $9\\times10^{3}$  & 0.23  & 37  \\\\ \nSecond Device Conditioning                                                        & 4.00  & 0.35  & 14.5     & 9.5      & 11.4    & 24.1  & 0.16  & $9.2\\times10^{3}$    & 0.35  & 26  \\\\ \nAfter  Device Conditioning                                                     & 13.19 & 0.41  & 26.7     & 9.8      & 32.2    & 32.0  & 0.04  & $9.6\\times10^{3}$   & 0.42  & 22  \\\\ \\hline\\hline \n\\end{tabular}\n\\end{table*}\n\n\\subsection{Effects of device conditioning on magnetic field effects}\n\nFigure~\\ref{fig5}(c) and (d) show the effect of device conditioning on MC and MEL measured at a constant applied voltage at several different stages of device conditioning (using the same color coding as for Fig.~\\ref{fig5}(a)), and Fig.~\\ref{fig5}(e) and~(f) show the corresponding data for constant current measurements. Figure~\\ref{fig5}(c) and~(d) show that the MC magnitude dramatically increases from about 20\\% for the pristine device, to about 500\\% for the maximally conditioned device, and the EL magnitude increases from about 50\\% to about 1200\\%. Device conditioning has a significantly less dramatic effect on the data shown in Fig.~\\ref{fig5}(e) and~(f), which are for measurements at a constant current.\n\n{Table~\\ref{my-table} shows the fitting results for different amounts of device conditioning. We fit the constant current measurements with Eq.~\\ref{eq:MELeq} by holding $k_S$ and $\\Delta g$ constant, to the same values used in Sec.~\\ref{unconditioned} for the unconditioned devices, and setting $k_T=0$. We fit all data sets to the non-Lorentzian expression. We find that the non-Lorentzian lineshape results in excellent fits to the measured data, and the resulting fitting parameters are listed in {Table~\\ref{my-table}}. \n\nNoteworthy aspects of the fitting results are: (i) $\\alpha$ increases significantly from 13 to 32 upon conditioning, and a corresponding increase of the MEL$|_V$ measured at constant voltage over the MEL$|_I$ measured at constant current is observed. (ii) The electroluminescence efficiency, $\\eta$ decreases to 4\\% of the pristine value upon device conditioning. (iii) the curve width for constant voltage, $B_0|V$, increases upon conditioning but the curve width for constant current, $B_0|I$ does not. (iv) The exciplex dissociation rate $k_D$ appears to be largely insensitive to conditioning, whereas conditioning moves the triplet-to-singlet branching ratio to favor triplet formation more. In terms of our theory, this  indicates a reduction of the activation energy $\\Delta_{ST}$. Because $\\Delta_{ST}$ is a sensitive function of the electron-hole wavefunction overlap, a change in this quantity is to be expected if device conditioning results in changes to film morphology, molecular packing or electron-hole localization along the current flow paths. The increase in resistance associated with conditioning implies that conducting sites or electron-hole recombination sites are farther apart, which also is consistent with the reduction in $\\Delta_{ST}$. We note that further increase by conditioning in the MEL at constant current (which is connected directly to the $\\Delta_{ST}$ in our theory and Eq.~(\\ref{eq:MELeq})) should be possible since the regime of $\\Delta_{ST}\\ll k_BT$ has not yet been reached. The increase of $B_0|V$ while $B_0|I$ is unchanged in conditioning appears related to the increase of $\\alpha$ with conditioning.\n\nAlthough the reduction of the electroluminescence efficiency is not a problem for magnetosensor applications, it is undesirable if the device is to be used as a magnetosensitive light-emitting device. However, there is no known reason why this reduction in efficiency should be a necessary companion to large MFE. Procedures for achieving larger MEL without reducing $\\eta$ may be found in the future, once the microscopic mechanism of conditioning is better understood. For example, we speculate that conditioning decreases $\\Delta_{ST}$ by increasing the average separation of the electron donor molecule and the electron acceptor molecule, which simultaneously increases the resistance. Finding molecule pairs with smaller $\\Delta_{ST}$ but higher conductivity could lead to larger MELs without compromising $\\eta$. The exciplex model here will produce the largest MFEs  for a system with a $\\Delta_{ST}\\ll k_BT$, which is not a regime we reach even with conditioning. \n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig9.pdf}\n\\caption{\\label{fig6}\n{Magnetoconductance and magnetoelectroluminescence in TADF exciplex based devices that differ in the fabrication procedure used to deposit the top metal electrode.} \\rm{(a), (b) Devices whose top electrode was fabricated by thermal evaporation. These devices have been maximally conditioned. (c), (d) Devices whose top electrode was fabricated by e-beam evaporation. These devices are not sensitive to device conditioning.}\n}\n\\end{figure}\n\nIt was shown previously\\cite{Rybicki:2012:PRL} that the exposure of the organic layer to X-ray bremsstrahlung that is generated during the e-beam evaporation process can significantly increase the MFE. It is therefore interesting to investigate whether devices fabricated using e-beam evaporation for the top electrode/cathode layer instead of thermal evaporation show an MFE enhancement similar to device conditioning. Figure~\\ref{fig6}(a) and~(b) show MC and MEL measurements for the maximally conditioned thermally fabricated device as a function of temperature. We now compare these data for the thermally conditioned device to analogous data in an e-beam fabricated device (Fig.~\\ref{fig6}(c) and~(d)). Whereas the MFE in e-beam fabricated devices is large compared to unconditioned devices fabricated by thermal evaporation (see Sec.~\\ref{unconditioned}), it is a much smaller MFE than the thermally fabricated device after device conditioning (see Sec.~\\ref{sec:deviceconditioning}). In fact we found that the e-beam devices are no longer sensitive to the device conditioning process. For this reason, e-beam fabricated devices are the most suitable for studies of the dependence of MFE on various parameters (such as layer thickness, layer composition, etc.) where an additional dependence on current density is not desired, as it would complicate the analysis. We {therefore} used e-beam devices {for Fig.~\\ref{fig4a}(e),(f)}.\n\n\n\nAs a final comparison we show the stability of the conditioning procedure. Figure~\\ref{fig4b} shows that the device does not return to its unconditioned value after resting for 12~hours. Further studies of the evolution of the magnetic field response with rest time will be the subject of future work.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Fig10.pdf}\n\\caption{\\label{fig4b}\n\\sloppy\n\\noindent\n(a) and (b) Conditioning dependence of the device studied in Fig.~\\ref{fig3b}. The blue line is for the optimally conditioned device after a rest period of 12h and shows that the effect does not return to the pristine value.\n}\n\\end{figure}\n\n\n\\section{Comparison of magnetic field effects in exciplex devices to excitonic devices}\n\\label{section3}\n\n\n\n\n\\label{section4}\n\\begin{table}\n\\small{\n\\caption{\\label{S2}\n\\rm{Experimental values for $\\Delta V/V$ and MC at different currents in MEH-PPV, Alq$_3$  and m-MTDATA:3TPYMB devices. $\\alpha$ is obtained from fitting the IV curves and the expected MC is calculated from Eq.~\\ref{equ:constantItoVconversion} in Sec.~\\ref{section2}.}}\n\\rm{\n\\begin{center}\n\\begin {tabular} { c c c c c }\n \\hline\n \\hline\n Description & $\\alpha$ & $\\Delta V/V$ & expected MC & MC\\\\ \\hline\n \\multicolumn{5} { c }{MEH-PPV before  Device Conditioning}\\\\ \\hline\n 5 $\\mu$A & 7.5 & -0.0088 & 0.068 & 0.074\\\\\n 10 $\\mu$A & 7.5 & -0.0085 & 0.065 & 0.07\\\\\n 20 $\\mu$A & 7.5 & -0.0081 & 0.063 & 0.068\\\\ \\hline\n \\multicolumn{5}{ c }{MEH-PPV after  Device Conditioning}\\\\ \\hline\n 1 $\\mu$A & 8.1 & -0.0166 & 0.142 & 0.131\\\\\n 10 $\\mu$A & 8.1 & -0.0143 & 0.122 & 0.109\\\\\n 100 $\\mu$A & 8.1 & -0.0085 & 0.071 & 0.071\\\\ \\hline\n \\multicolumn{5}{ c }{Alq$_3$ }\\\\ \\hline\n 1 $\\mu$A & 7.2 & -0.0056 & 0.041 & 0.041\\\\\n 10 $\\mu$A & 7.2 & -0.0041 & 0.03 & 0.028\\\\\n 100 $\\mu$A & 7.2 & -0.0033 & 0.024 & 0.024\\\\ \\hline\n \\multicolumn{5}{ c }{m-MTDATA:3TPYMB at 30 $\\mu$A}\\\\ \\hline\n Before Device Conditioning & 13.43 & -0.024 & 0.372 & 0.325\\\\\nFirst Device Conditioning & 16.24 & -0.039 & 0.857 & 0.695\\\\\n Second Device Conditioning & 24.12 & -0.052 & 2.425 & 2.094\\\\\nAfter Device Conditioning & 32 & -0.054 & 4.418 & 6.436\\\\\n \\hline\n \\hline\n\\end{tabular}\n\\end{center}\n}\n}\n\\end{table}\n\n\n\\begin{figure}\n\\includegraphics[width=0.98\\linewidth]{Fig11.pdf}\n\\caption{\\label{fig7cf}\nMagneto-transport and magneto-luminescence in MEH-PPV and Alq$_3$  devices. Magneto-transport and magneto-luminescence at constant voltage (a), (b) and constant current (c), (d) before and after device conditioning in MEH-PPV and Alq$_3$  devices. }\n\\end{figure}\n\nIn this section we compare MFE in our exciplex system to the (previously known) excitonic MFE. The simple, single layer excitonic devices studied  are not optimized to be efficient OLEDs, but serve as a reference for our MFE studies. \n Figure~\\ref{fig7cf}(a)-(d) shows that the magnitude of MFE in MEH-PPV also increases with electrical conditioning, but that the MFE before and after conditioning are both much smaller than in the exciplex devices.\nThe MFE of the Alq$_3$ device is not sensitive to the electrical device conditioning, but it has previously been shown that a kind of device conditioning can be achieved by x-ray exposure\\cite{Rybicki:2012:PRL}. The value of $\\Delta V/V$ and $\\Delta EL/EL$ in MEH-PPV and Alq$_3$ devices at constant current is less than one third compared to the TADF exciplex devices. However, the value of $\\Delta I/I$ and $\\Delta EL/EL$ at constant votage is smaller than 2\\% compared to TADF devices. Moreover, the half-width-at-quarter-maximum of the traces, $B_0$, in MEH-PPV and Alq$_3$ devices is less than 5 mT, but for TADF exciplex devices, $B_0$ can be nearly 50 mT. We note that the reported data are first measured at a constant current from which we obtain $\\Delta V/V$ and $\\Delta EL/EL$ at constant current. Then we choose a voltage for the constant voltage measurement that results in a similar current flow as for the constant current measurements. In this way, we can perform an accurate, quantitative comparison between constant current and constant voltage measurements. See Table~\\ref{S2} for a summary of our results, where the observed value for the exponent $\\alpha$, the measured magnetovoltage, the expected magnetoconductance due to the ``$\\alpha$-enhancement\", and finally the actually measured magnetoconductance are shown. The table shows good agreement between expected and actual magnetoconductance, validating our picture.\n\n\n\n\\section{Conclusion}\n\nWe have shown that TADF-based organic diodes can exhibit immense sensitivity to magnetic fields. \nThe measured MFEs are the highest among systems with non-magnetic components. Previous MFEs in organic semiconductors and colloidal quantum dots fail to surpass 20\\%\\cite{Mermer:2005:PRB, Guyot-Sionnest2007}. Similar MFE values are found in chemical reaction yields\\cite{Timmel1998}. However in hybrid perovskites, where $\\Delta g$ is responsible for the MFEs, the MFEs are very small, $< 0.5$\\%.\\cite{Zhang:2015:NatPhys} \nSpin dynamics and the associated MFEs also have  been recently studied for defects between either two non-magnetic leads or one non-magnetic lead and one magnetic lead. In both cases, the MFEs are less than 0.1\\%\\ and appear to be due to hyperfine interactions\\cite{Swartz2014, Inoue2015}. In contrast to systems with magnetic components, in which the magnetic easy axes cause sensitivity to the vector character of the external magnetic field, \nthe MFEs of these nonmagnetic TADF-based materials can be expected to depend predominately on the scalar magnitude of the field.\nEven for devices with magnetic components --- for instance those exhibiting tunneling magnetoresistance with maximum room temperature observed values $> 600$\\% \\cite{Ikeda2008} --- our MFEs compare favorably despite other drawbacks inherent in the electronic properties of organic semiconductors when compared to metallic systems. \n\nOur results imply that magnetic field effects are a sensitive tool for investigating the spin-dependent exciplex physics that lies at the heart of TADF, and also shows that external and internal magnetic fields may serve as a booster of the electroluminescence efficiency in TADF devices.\nOur simple conditioning approach proves that immense MFE are achievable in organic semiconductors, even though the microscopic processes that occur upon device conditioning cannot be identified with certainty. We speculate that conditioning introduces chemical changes to the molecules and/or changes to the film's nanoscale morphology that move the electron donors and acceptors effectively farther apart, both decreasing $\\Delta_{ST}$ and increasing the resistance. It remains  a challenge to the organic semiconductor field to develop the necessary nanoscale tools to achieve smaller $\\Delta_{ST}$'s while retaining higher conductivity, through morphological control during deposition or improved molecular design and targeted chemical synthesis.\n\n\n\\begin{acknowledgments}\nWe acknowledge advice from J. Shinar on the coevaporation process. This work was supported in part by The University of Iowa Office of the Vice President for Research and Economic Development through the GAP and IFI Funding Programs. This material is based in part on work supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, under Award Number DE-SC0014336.\n\\end{acknowledgments}\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{36}\n\\makeatletter\n\\providecommand \\@ifxundefined [1]{\n \\@ifx{#1\\undefined}\n}\n\\providecommand \\@ifnum [1]{\n \\ifnum #1\\expandafter \\@firstoftwo\n \\else \\expandafter \\@secondoftwo\n \\fi\n}\n\\providecommand \\@ifx [1]{\n \\ifx #1\\expandafter \\@firstoftwo\n \\else \\expandafter \\@secondoftwo\n \\fi\n}\n\\providecommand \\natexlab [1]{#1}\n\\providecommand \\enquote  [1]{``#1''}\n\\providecommand \\bibnamefont  [1]{#1}\n\\providecommand \\bibfnamefont [1]{#1}\n\\providecommand \\citenamefont [1]{#1}\n\\providecommand \\href@noop [0]{\\@secondoftwo}\n\\providecommand \\href [0]{\\begingroup \\@sanitize@url \\@href}\n\\providecommand \\@href[1]{\\@@startlink{#1}\\@@href}\n\\providecommand \\@@href[1]{\\endgroup#1\\@@endlink}\n\\providecommand \\@sanitize@url [0]{\\catcode `\\\\12\\catcode `\\$12\\catcode\n  `\\&12\\catcode `\\#12\\catcode `\\^12\\catcode `\\_12\\catcode `\\%12\\relax}\n\\providecommand \\@@startlink[1]{}\n\\providecommand \\@@endlink[0]{}\n\\providecommand \\url  [0]{\\begingroup\\@sanitize@url \\@url }\n\\providecommand \\@url [1]{\\endgroup\\@href {#1}{\\urlprefix }}\n\\providecommand \\urlprefix  [0]{URL }\n\\providecommand \\Eprint [0]{\\href }\n\\providecommand \\doibase [0]{http://dx.doi.org/}\n\\providecommand \\selectlanguage [0]{\\@gobble}\n\\providecommand \\bibinfo  [0]{\\@secondoftwo}\n\\providecommand \\bibfield  [0]{\\@secondoftwo}\n\\providecommand \\translation [1]{[#1]}\n\\providecommand \\BibitemOpen [0]{}\n\\providecommand \\bibitemStop [0]{}\n\\providecommand \\bibitemNoStop [0]{.\\EOS\\space}\n\\providecommand \\EOS [0]{\\spacefactor3000\\relax}\n\\providecommand \\BibitemShut  [1]{\\csname bibitem#1\\endcsname}\n\\let\\auto@bib@innerbib\\@empty\n\n\\bibitem [{\\citenamefont {Friend}\\ \\emph {et~al.}(1999)\\citenamefont {Friend},\n  \\citenamefont {Gymer}, \\citenamefont {Holmes}, \\citenamefont {Burroughes},\n  \\citenamefont {Marks}, \\citenamefont {Taliani}, \\citenamefont {Bradley},\n  \\citenamefont {Dos~Santos}, \\citenamefont {Bredas}, \\citenamefont\n  {Logdlund},\\ and\\ \\citenamefont {Salaneck}}]{Friend:1999:Nature}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {R.~H.}\\ \\bibnamefont\n  {Friend}}, \\bibinfo {author} {\\bibfnamefont {R.~W.}\\ \\bibnamefont {Gymer}},\n  \\bibinfo {author} {\\bibfnamefont {A.~B.}\\ \\bibnamefont {Holmes}}, \\bibinfo\n  {author} {\\bibfnamefont {J.~H.}\\ \\bibnamefont {Burroughes}}, \\bibinfo\n  {author} {\\bibfnamefont {R.~N.}\\ \\bibnamefont {Marks}}, \\bibinfo {author}\n  {\\bibfnamefont {C.}~\\bibnamefont {Taliani}}, \\bibinfo {author} {\\bibfnamefont\n  {D.~D.~C.}\\ \\bibnamefont {Bradley}}, \\bibinfo {author} {\\bibfnamefont\n  {D.~A.}\\ \\bibnamefont {Dos~Santos}}, \\bibinfo {author} {\\bibfnamefont\n  {J.~L.}\\ \\bibnamefont {Bredas}}, \\bibinfo {author} {\\bibfnamefont\n  {M.}~\\bibnamefont {Logdlund}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont\n  {W.~R.}\\ \\bibnamefont {Salaneck}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo\n  {title} {Electroluminescence in conjugated polymers},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {Nature}\\ }\\textbf {\\bibinfo\n  {volume} {397}},\\ \\bibinfo {pages} {121} (\\bibinfo {year}\n  {1999})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Rothberg}\\ and\\ \\citenamefont\n  {Lovinger}(1996)}]{Rothberg1996}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Lewis~J.}\\\n  \\bibnamefont {Rothberg}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {Andrew~J.}\\\n  \\bibnamefont {Lovinger}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {{Status of and prospects for organic electroluminescence}},}\\ }\\href\n  {\\doibase 10.1557/JMR.1996.0403} {\\bibfield  {journal} {\\bibinfo  {journal}\n  {J. Mat. Res.}\\ }\\textbf {\\bibinfo {volume} {11}},\\ \\bibinfo {pages}\n  {3174--3187} (\\bibinfo {year} {1996})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Goushi}\\ \\emph {et~al.}(2012)\\citenamefont {Goushi},\n  \\citenamefont {Yoshida}, \\citenamefont {Sato},\\ and\\ \\citenamefont\n  {Adachi}}]{Goushi2012}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Kenichi}\\ \\bibnamefont\n  {Goushi}}, \\bibinfo {author} {\\bibfnamefont {Kou}\\ \\bibnamefont {Yoshida}},\n  \\bibinfo {author} {\\bibfnamefont {Keigo}\\ \\bibnamefont {Sato}}, \\ and\\\n  \\bibinfo {author} {\\bibfnamefont {Chihaya}\\ \\bibnamefont {Adachi}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Organic light-emitting\n  diodes employing efficient reverse intersystem crossing for\n  triplet-to-singlet state conversion},}\\ }\\href@noop {} {\\bibfield  {journal}\n  {\\bibinfo  {journal} {Nat. Photon.}\\ }\\textbf {\\bibinfo {volume} {6}},\\\n  \\bibinfo {pages} {253--258} (\\bibinfo {year} {2012})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Uoyama}\\ \\emph {et~al.}(2012)\\citenamefont {Uoyama},\n  \\citenamefont {Goushi}, \\citenamefont {Shizu}, \\citenamefont {Nomura},\\ and\\\n  \\citenamefont {Adachi}}]{Uoyama2012}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Hiroki}\\ \\bibnamefont\n  {Uoyama}}, \\bibinfo {author} {\\bibfnamefont {Kenichi}\\ \\bibnamefont\n  {Goushi}}, \\bibinfo {author} {\\bibfnamefont {Katsuyuki}\\ \\bibnamefont\n  {Shizu}}, \\bibinfo {author} {\\bibfnamefont {Hiroko}\\ \\bibnamefont {Nomura}},\n  \\ and\\ \\bibinfo {author} {\\bibfnamefont {Chihaya}\\ \\bibnamefont {Adachi}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Highly efficient organic\n  light-emitting diodes from delayed fluorescence},}\\ }\\href@noop {} {\\bibfield\n   {journal} {\\bibinfo  {journal} {Nature}\\ }\\textbf {\\bibinfo {volume}\n  {492}},\\ \\bibinfo {pages} {234} (\\bibinfo {year} {2012})}\\BibitemShut\n  {NoStop}\n\\bibitem [{\\citenamefont {Kalinowski}\\ \\emph {et~al.}(2003)\\citenamefont\n  {Kalinowski}, \\citenamefont {Cocchi}, \\citenamefont {Virgili}, \\citenamefont\n  {Di~Marco},\\ and\\ \\citenamefont {Fattori}}]{Kalinowski2003}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Jan}\\ \\bibnamefont\n  {Kalinowski}}, \\bibinfo {author} {\\bibfnamefont {Massimo}\\ \\bibnamefont\n  {Cocchi}}, \\bibinfo {author} {\\bibfnamefont {Dalia}\\ \\bibnamefont {Virgili}},\n  \\bibinfo {author} {\\bibfnamefont {Piergiulio}\\ \\bibnamefont {Di~Marco}}, \\\n  and\\ \\bibinfo {author} {\\bibfnamefont {Valeria}\\ \\bibnamefont {Fattori}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Magnetic field effects on\n  emission and current in \\hbox{Alq$_3$}-based electroluminescent diodes},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Chem. Phys.\n  Lett.}\\ }\\textbf {\\bibinfo {volume} {380}},\\ \\bibinfo {pages} {710} (\\bibinfo\n  {year} {2003})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Mermer}\\ \\emph {et~al.}(2005)\\citenamefont {Mermer},\n  \\citenamefont {Veeraraghavan}, \\citenamefont {Francis}, \\citenamefont\n  {Sheng}, \\citenamefont {Nguyen}, \\citenamefont {Wohlgenannt}, \\citenamefont\n  {Kohler}, \\citenamefont {Al-Suti},\\ and\\ \\citenamefont\n  {Khan}}]{Mermer:2005:PRB}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {O.}~\\bibnamefont\n  {Mermer}}, \\bibinfo {author} {\\bibfnamefont {G.}~\\bibnamefont\n  {Veeraraghavan}}, \\bibinfo {author} {\\bibfnamefont {T.~L.}\\ \\bibnamefont\n  {Francis}}, \\bibinfo {author} {\\bibfnamefont {Y.}~\\bibnamefont {Sheng}},\n  \\bibinfo {author} {\\bibfnamefont {D.~T.}\\ \\bibnamefont {Nguyen}}, \\bibinfo\n  {author} {\\bibfnamefont {M.}~\\bibnamefont {Wohlgenannt}}, \\bibinfo {author}\n  {\\bibfnamefont {A.}~\\bibnamefont {Kohler}}, \\bibinfo {author} {\\bibfnamefont\n  {M.~K.}\\ \\bibnamefont {Al-Suti}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont\n  {M.~S.}\\ \\bibnamefont {Khan}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo\n  {title} {Large magnetoresistance in nonmagnetic $\\pi$-conjugated\n  semiconductor thin film devices},}\\ }\\href@noop {} {\\bibfield  {journal}\n  {\\bibinfo  {journal} {Phys. Rev. B}\\ }\\textbf {\\bibinfo {volume} {72}},\\\n  \\bibinfo {pages} {205202} (\\bibinfo {year} {2005})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Prigodin}\\ \\emph {et~al.}(2006)\\citenamefont\n  {Prigodin}, \\citenamefont {Bergeson}, \\citenamefont {Lincoln},\\ and\\\n  \\citenamefont {Epstein}}]{Prigodin:2006:SynthMet}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {V.~N.}\\ \\bibnamefont\n  {Prigodin}}, \\bibinfo {author} {\\bibfnamefont {J.~D.}\\ \\bibnamefont\n  {Bergeson}}, \\bibinfo {author} {\\bibfnamefont {D.~M.}\\ \\bibnamefont\n  {Lincoln}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {A.~J.}\\ \\bibnamefont\n  {Epstein}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Anomalous room\n  temperature magnetoresistance in organic semiconductors},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {Synth. Met.}\\ }\\textbf {\\bibinfo\n  {volume} {156}},\\ \\bibinfo {pages} {757} (\\bibinfo {year}\n  {2006})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Desai}\\ \\emph {et~al.}(2007)\\citenamefont {Desai},\n  \\citenamefont {Shakya}, \\citenamefont {Kreouzis},\\ and\\ \\citenamefont\n  {Gillin}}]{Desai:2007:PRBphotocurrent}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {P.}~\\bibnamefont\n  {Desai}}, \\bibinfo {author} {\\bibfnamefont {P.}~\\bibnamefont {Shakya}},\n  \\bibinfo {author} {\\bibfnamefont {T.}~\\bibnamefont {Kreouzis}}, \\ and\\\n  \\bibinfo {author} {\\bibfnamefont {W.~P.}\\ \\bibnamefont {Gillin}},\\ }\\bibfield\n   {title} {\\enquote {\\bibinfo {title} {Magnetoresistance in organic\n  light-emitting diode structures under illumination},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {Phys. Rev. B}\\ }\\textbf {\\bibinfo\n  {volume} {76}},\\ \\bibinfo {pages} {235202} (\\bibinfo {year}\n  {2007})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Hu}\\ and\\ \\citenamefont {Wu}(2007)}]{Hu:2007:NatMat}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {B.}~\\bibnamefont\n  {Hu}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {Y.}~\\bibnamefont {Wu}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Tuning magnetoresistance\n  between positive and negative values in organic semiconductors},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Nat. Mater.}\\\n  }\\textbf {\\bibinfo {volume} {6}},\\ \\bibinfo {pages} {985} (\\bibinfo {year}\n  {2007})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Wang}\\ \\emph {et~al.}(2012)\\citenamefont {Wang},\n  \\citenamefont {Maci\\`a}, \\citenamefont {Wohlgenannt}, \\citenamefont {Kent},\\\n  and\\ \\citenamefont {Flatt\\'e}}]{Wang:2012:PRX}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Fujian}\\ \\bibnamefont\n  {Wang}}, \\bibinfo {author} {\\bibfnamefont {Ferran}\\ \\bibnamefont {Maci\\`a}},\n  \\bibinfo {author} {\\bibfnamefont {Markus}\\ \\bibnamefont {Wohlgenannt}},\n  \\bibinfo {author} {\\bibfnamefont {Andrew~D.}\\ \\bibnamefont {Kent}}, \\ and\\\n  \\bibinfo {author} {\\bibfnamefont {Michael~E.}\\ \\bibnamefont {Flatt\\'e}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Magnetic fringe-field\n  control of electronic transport in an organic film},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {Phys. Rev. X}\\ }\\textbf {\\bibinfo\n  {volume} {2}},\\ \\bibinfo {pages} {021013} (\\bibinfo {year}\n  {2012})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Maci\\'a}\\ \\emph {et~al.}(2014)\\citenamefont\n  {Maci\\'a}, \\citenamefont {Wang}, \\citenamefont {Harmon}, \\citenamefont\n  {Wohlgenannt}, \\citenamefont {Kent},\\ and\\ \\citenamefont\n  {Flatt\\'e}}]{Macia2014}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {F.}~\\bibnamefont\n  {Maci\\'a}}, \\bibinfo {author} {\\bibfnamefont {F.}~\\bibnamefont {Wang}},\n  \\bibinfo {author} {\\bibfnamefont {N.~J.}\\ \\bibnamefont {Harmon}}, \\bibinfo\n  {author} {\\bibfnamefont {M.}~\\bibnamefont {Wohlgenannt}}, \\bibinfo {author}\n  {\\bibfnamefont {A.~D.}\\ \\bibnamefont {Kent}}, \\ and\\ \\bibinfo {author}\n  {\\bibfnamefont {M.~E.}\\ \\bibnamefont {Flatt\\'e}},\\ }\\bibfield  {title}\n  {\\enquote {\\bibinfo {title} {Organic magnetoelectroluminescence for room\n  temperature transduction between magnetic and optical information},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Nat. Commun.}\\\n  }\\textbf {\\bibinfo {volume} {5}},\\ \\bibinfo {pages} {3069} (\\bibinfo {year}\n  {2014})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Crooker}\\ \\emph {et~al.}(2014)\\citenamefont\n  {Crooker}, \\citenamefont {Liu}, \\citenamefont {Kelley}, \\citenamefont\n  {Martinez}, \\citenamefont {Nie}, \\citenamefont {Mohite}, \\citenamefont\n  {Nayyar}, \\citenamefont {Tretiak}, \\citenamefont {Smith},\\ and\\ \\citenamefont\n  {Ruden}}]{Crooker2014}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {S.~A.}\\ \\bibnamefont\n  {Crooker}}, \\bibinfo {author} {\\bibfnamefont {F.}~\\bibnamefont {Liu}},\n  \\bibinfo {author} {\\bibfnamefont {M.~R.}\\ \\bibnamefont {Kelley}}, \\bibinfo\n  {author} {\\bibfnamefont {N.~J.~D.}\\ \\bibnamefont {Martinez}}, \\bibinfo\n  {author} {\\bibfnamefont {W.}~\\bibnamefont {Nie}}, \\bibinfo {author}\n  {\\bibfnamefont {A.}~\\bibnamefont {Mohite}}, \\bibinfo {author} {\\bibfnamefont\n  {I.~H.}\\ \\bibnamefont {Nayyar}}, \\bibinfo {author} {\\bibfnamefont\n  {S.}~\\bibnamefont {Tretiak}}, \\bibinfo {author} {\\bibfnamefont {D.~L.}\\\n  \\bibnamefont {Smith}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {P.~P.}\\\n  \\bibnamefont {Ruden}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {{Spectrally resolved hyperfine interactions between polaron and nuclear\n  spins in organic light emitting diodes: Magneto-electroluminescence\n  studies}},}\\ }\\href {\\doibase 10.1063/1.4898700} {\\bibfield  {journal}\n  {\\bibinfo  {journal} {Appl. Phys. Lett.}\\ }\\textbf {\\bibinfo {volume}\n  {105}},\\ \\bibinfo {pages} {153304} (\\bibinfo {year} {2014})}\\BibitemShut\n  {NoStop}\n\\bibitem [{\\citenamefont {Zhang}\\ \\emph {et~al.}(2015)\\citenamefont {Zhang},\n  \\citenamefont {Sun}, \\citenamefont {Sheng}, \\citenamefont {Zhai},\n  \\citenamefont {Mielczarek}, \\citenamefont {Zakhidov},\\ and\\ \\citenamefont\n  {Vardeny}}]{Zhang:2015:NatPhys}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {C.}~\\bibnamefont\n  {Zhang}}, \\bibinfo {author} {\\bibfnamefont {D.}~\\bibnamefont {Sun}}, \\bibinfo\n  {author} {\\bibfnamefont {C-X.}\\ \\bibnamefont {Sheng}}, \\bibinfo {author}\n  {\\bibfnamefont {Y.~X.}\\ \\bibnamefont {Zhai}}, \\bibinfo {author}\n  {\\bibfnamefont {K.}~\\bibnamefont {Mielczarek}}, \\bibinfo {author}\n  {\\bibfnamefont {A.}~\\bibnamefont {Zakhidov}}, \\ and\\ \\bibinfo {author}\n  {\\bibfnamefont {Z.~V.}\\ \\bibnamefont {Vardeny}},\\ }\\bibfield  {title}\n  {\\enquote {\\bibinfo {title} {Magnetic field effects in hybrid perovskite\n  devices},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Nat.\n  Phys.}\\ }\\textbf {\\bibinfo {volume} {11}},\\ \\bibinfo {pages} {427} (\\bibinfo\n  {year} {2015})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Wang}\\ \\emph {et~al.}(2008)\\citenamefont {Wang},\n  \\citenamefont {B\\\"assler},\\ and\\ \\citenamefont {Vardeny}}]{Wang:2008:PRL}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {F.~J.}\\ \\bibnamefont\n  {Wang}}, \\bibinfo {author} {\\bibfnamefont {H.}~\\bibnamefont {B\\\"assler}}, \\\n  and\\ \\bibinfo {author} {\\bibfnamefont {Z.~V.}\\ \\bibnamefont {Vardeny}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Magnetic field effects in\n  $\\pi$-conjugated polymer-fullerene blends: Evidence for multiple\n  components},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal}\n  {Phys. Rev. Lett.}\\ }\\textbf {\\bibinfo {volume} {101}},\\ \\bibinfo {pages}\n  {236805} (\\bibinfo {year} {2008})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Devir-Wolfman}\\ \\emph {et~al.}(2014)\\citenamefont\n  {Devir-Wolfman}, \\citenamefont {Khachatryan}, \\citenamefont {Gautam},\n  \\citenamefont {Tzabary}, \\citenamefont {Keren}, \\citenamefont {Tessler},\n  \\citenamefont {Vardeny},\\ and\\ \\citenamefont\n  {Ehrenfreund}}]{DevirWolfman2014}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Ayeleth~H}\\\n  \\bibnamefont {Devir-Wolfman}}, \\bibinfo {author} {\\bibfnamefont {Bagrat}\\\n  \\bibnamefont {Khachatryan}}, \\bibinfo {author} {\\bibfnamefont {Bhoj~R}\\\n  \\bibnamefont {Gautam}}, \\bibinfo {author} {\\bibfnamefont {Lior}\\ \\bibnamefont\n  {Tzabary}}, \\bibinfo {author} {\\bibfnamefont {Amit}\\ \\bibnamefont {Keren}},\n  \\bibinfo {author} {\\bibfnamefont {Nir}\\ \\bibnamefont {Tessler}}, \\bibinfo\n  {author} {\\bibfnamefont {Z~Valy}\\ \\bibnamefont {Vardeny}}, \\ and\\ \\bibinfo\n  {author} {\\bibfnamefont {Eitan}\\ \\bibnamefont {Ehrenfreund}},\\ }\\bibfield\n  {title} {\\enquote {\\bibinfo {title} {{Short-lived charge-transfer excitons in\n  organic photovoltaic cells studied by high-field magneto-photocurrent.}}}\\\n  }\\href {\\doibase 10.1038/ncomms5529} {\\bibfield  {journal} {\\bibinfo\n  {journal} {Nat. Commun.}\\ }\\textbf {\\bibinfo {volume} {5}},\\ \\bibinfo {pages}\n  {4529} (\\bibinfo {year} {2014})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Bobbert}\\ \\emph {et~al.}(2007)\\citenamefont\n  {Bobbert}, \\citenamefont {Nguyen}, \\citenamefont {van Oost}, \\citenamefont\n  {Koopmans},\\ and\\ \\citenamefont {Wohlgenannt}}]{Bobbert:2007:PRL}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {P.~A.}\\ \\bibnamefont\n  {Bobbert}}, \\bibinfo {author} {\\bibfnamefont {T.~D.}\\ \\bibnamefont {Nguyen}},\n  \\bibinfo {author} {\\bibfnamefont {F.~W.~A.}\\ \\bibnamefont {van Oost}},\n  \\bibinfo {author} {\\bibfnamefont {B.}~\\bibnamefont {Koopmans}}, \\ and\\\n  \\bibinfo {author} {\\bibfnamefont {M.}~\\bibnamefont {Wohlgenannt}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Bipolaron mechanism for\n  organic magnetoresistance},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo\n  {journal} {Phys. Rev. Lett.}\\ }\\textbf {\\bibinfo {volume} {99}},\\ \\bibinfo\n  {pages} {216801} (\\bibinfo {year} {2007})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Harmon}\\ and\\ \\citenamefont\n  {Flatt\\'e}(2014)}]{Harmon2014}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {N.~J.}\\ \\bibnamefont\n  {Harmon}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {M.~E.}\\ \\bibnamefont\n  {Flatt\\'e}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Organic\n  magnetoresistance from deep traps},}\\ }\\href@noop {} {\\bibfield  {journal}\n  {\\bibinfo  {journal} {J. Appl. Phys.}\\ }\\textbf {\\bibinfo {volume} {116}},\\\n  \\bibinfo {pages} {043707} (\\bibinfo {year} {2014})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Janssen}\\ \\emph {et~al.}(2013)\\citenamefont\n  {Janssen}, \\citenamefont {Cox}, \\citenamefont {Wouters}, \\citenamefont\n  {Kemerink}, \\citenamefont {Wienk},\\ and\\ \\citenamefont\n  {Koopmans}}]{Janssen:2013:NC}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {P.}~\\bibnamefont\n  {Janssen}}, \\bibinfo {author} {\\bibfnamefont {M.}~\\bibnamefont {Cox}},\n  \\bibinfo {author} {\\bibfnamefont {S.~H.~W.}\\ \\bibnamefont {Wouters}},\n  \\bibinfo {author} {\\bibfnamefont {M.}~\\bibnamefont {Kemerink}}, \\bibinfo\n  {author} {\\bibfnamefont {M.~M.}\\ \\bibnamefont {Wienk}}, \\ and\\ \\bibinfo\n  {author} {\\bibfnamefont {B.}~\\bibnamefont {Koopmans}},\\ }\\bibfield  {title}\n  {\\enquote {\\bibinfo {title} {Tuning organic magnetoresistance in\n  polymer-fullerene blends by controlling spin reaction pathways},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Nat. Commun.}\\\n  }\\textbf {\\bibinfo {volume} {4}},\\ \\bibinfo {pages} {2286} (\\bibinfo {year}\n  {2013})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Harmon}\\ and\\ \\citenamefont\n  {Flatt\\'e}(2012)}]{Harmon:2012:PRL}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {N.~J.}\\ \\bibnamefont\n  {Harmon}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {M.~E.}\\ \\bibnamefont\n  {Flatt\\'e}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Spin-flip\n  induced magnetoresistance in positionally disordered organic solids},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {Phys. Rev. Lett.}\\\n  }\\textbf {\\bibinfo {volume} {108}},\\ \\bibinfo {pages} {186602} (\\bibinfo\n  {year} {2012})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Haberkorn}(1976)}]{Haberkorn1976}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {R.}~\\bibnamefont\n  {Haberkorn}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Density\n  matrix description of spin-selective radical pair reactions},}\\ }\\href@noop\n  {} {\\bibfield  {journal} {\\bibinfo  {journal} {Mol. Phys.}\\ }\\textbf\n  {\\bibinfo {volume} {32}},\\ \\bibinfo {pages} {1491} (\\bibinfo {year}\n  {1976})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Kersten}\\ \\emph {et~al.}(2011)\\citenamefont\n  {Kersten}, \\citenamefont {Schellekens}, \\citenamefont {Koopmans},\\ and\\\n  \\citenamefont {Bobbert}}]{Kersten2011}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {S.~P.}\\ \\bibnamefont\n  {Kersten}}, \\bibinfo {author} {\\bibfnamefont {A.~J.}\\ \\bibnamefont\n  {Schellekens}}, \\bibinfo {author} {\\bibfnamefont {Bert}\\ \\bibnamefont\n  {Koopmans}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {P.~A.}\\ \\bibnamefont\n  {Bobbert}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Magnetic-field\n  dependence of the electroluminescence of organic light-emitting diodes: a\n  competition between exciton formation and spin mixing},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {Phys. Rev. Lett.}\\ }\\textbf\n  {\\bibinfo {volume} {106}},\\ \\bibinfo {pages} {197402} (\\bibinfo {year}\n  {2011})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Bergeson}\\ \\emph {et~al.}(2008)\\citenamefont\n  {Bergeson}, \\citenamefont {Prigodin}, \\citenamefont {Lincoln},\\ and\\\n  \\citenamefont {Epstein}}]{Bergeson2008}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {J.~D.}\\ \\bibnamefont\n  {Bergeson}}, \\bibinfo {author} {\\bibfnamefont {V.~N.}\\ \\bibnamefont\n  {Prigodin}}, \\bibinfo {author} {\\bibfnamefont {D.~M.}\\ \\bibnamefont\n  {Lincoln}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {A.~J.}\\ \\bibnamefont\n  {Epstein}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Inversion of\n  magnetoresistance in organic semiconductors},}\\ }\\href@noop {} {\\bibfield\n  {journal} {\\bibinfo  {journal} {Phys. Rev. Lett.}\\ }\\textbf {\\bibinfo\n  {volume} {100}},\\ \\bibinfo {pages} {067201} (\\bibinfo {year}\n  {2008})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Niedermeier}\\ \\emph {et~al.}(2008)\\citenamefont\n  {Niedermeier}, \\citenamefont {Vieth}, \\citenamefont {Patzold}, \\citenamefont\n  {Sarfert},\\ and\\ \\citenamefont {von Seggern}}]{Niedermeier:2008:PRB}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {U.}~\\bibnamefont\n  {Niedermeier}}, \\bibinfo {author} {\\bibfnamefont {M.}~\\bibnamefont {Vieth}},\n  \\bibinfo {author} {\\bibfnamefont {R.}~\\bibnamefont {Patzold}}, \\bibinfo\n  {author} {\\bibfnamefont {W.}~\\bibnamefont {Sarfert}}, \\ and\\ \\bibinfo\n  {author} {\\bibfnamefont {H.}~\\bibnamefont {von Seggern}},\\ }\\bibfield\n  {title} {\\enquote {\\bibinfo {title} {Enhancement of organic magnetoresistance\n  by electrical conditioning},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo\n   {journal} {Appl. Phys. Lett.}\\ }\\textbf {\\bibinfo {volume} {92}},\\ \\bibinfo\n  {eid} {193309} (\\bibinfo {year} {2008})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {McConnell}\\ and\\ \\citenamefont\n  {Chesnut}(1958)}]{McConnell1958}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {H.~M.}\\ \\bibnamefont\n  {McConnell}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {D.~B.}\\ \\bibnamefont\n  {Chesnut}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Theory of\n  isotropic hyperfine interactions in $\\pi$-electron radicals},}\\ }\\href@noop\n  {} {\\bibfield  {journal} {\\bibinfo  {journal} {J. Chem. Phys.}\\ }\\textbf\n  {\\bibinfo {volume} {28}},\\ \\bibinfo {pages} {107} (\\bibinfo {year}\n  {1958})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Dodin}\\ \\emph {et~al.}(2013)\\citenamefont {Dodin},\n  \\citenamefont {Ivanov},\\ and\\ \\citenamefont {Burshtein}}]{Dodin2013}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {D.~V.}\\ \\bibnamefont\n  {Dodin}}, \\bibinfo {author} {\\bibfnamefont {A.~I.}\\ \\bibnamefont {Ivanov}}, \\\n  and\\ \\bibinfo {author} {\\bibfnamefont {A.~I.}\\ \\bibnamefont {Burshtein}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Hyperfine interaction\n  mechanism of magnetic field effects in sequential flourophore and exciplex\n  flourescence},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal}\n  {J. of Chem. Phys.}\\ }\\textbf {\\bibinfo {volume} {138}},\\ \\bibinfo {pages}\n  {124102} (\\bibinfo {year} {2013})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Graeff}\\ \\emph {et~al.}(2005)\\citenamefont {Graeff},\n  \\citenamefont {Silva}, \\citenamefont {N\u009fesch},\\ and\\ \\citenamefont\n  {Zuppiroli}}]{Graeff2005}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {C.F.O.}\\ \\bibnamefont\n  {Graeff}}, \\bibinfo {author} {\\bibfnamefont {G.B.}\\ \\bibnamefont {Silva}},\n  \\bibinfo {author} {\\bibfnamefont {F.}~\\bibnamefont {N\u009fesch}}, \\ and\\ \\bibinfo\n  {author} {\\bibfnamefont {L.}~\\bibnamefont {Zuppiroli}},\\ }\\bibfield  {title}\n  {\\enquote {\\bibinfo {title} {Transport and recombination in organic\n  light-emitting diodes studied by electrically detected magnetic resonance},}\\\n  }\\href@noop {} {\\bibfield  {journal} {\\bibinfo  {journal} {European Physical\n  Journal E}\\ }\\textbf {\\bibinfo {volume} {18}},\\ \\bibinfo {pages} {21}\n  (\\bibinfo {year} {2005})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Yu}(2012)}]{Yu2012}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Z.~G.}\\ \\bibnamefont\n  {Yu}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {Spin-orbit coupling\n  and its effects in organic solids},}\\ }\\href@noop {} {\\bibfield  {journal}\n  {\\bibinfo  {journal} {Phys. Rev. B}\\ }\\textbf {\\bibinfo {volume} {85}},\\\n  \\bibinfo {pages} {115201} (\\bibinfo {year} {2012})}\\BibitemShut {NoStop}\n\\bibitem [{Sup()}]{SupMat}\n  \\BibitemOpen\n  \\href@noop {} {\\bibinfo  {journal} {See Supplemental Material at [URL will be\n  inserted by publisher] for videos of the change in electroluminescence of the\n  devices with magnetic field}\\ }\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Adachi}\\ \\emph {et~al.}()\\citenamefont {Adachi},\n  \\citenamefont {Goushi},\\ and\\ \\citenamefont {Yoshida}}]{adachi2012delayed}\n  \\BibitemOpen\n\\bibfield  {journal} {  }\\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont\n  {C.}~\\bibnamefont {Adachi}}, \\bibinfo {author} {\\bibfnamefont\n  {K.}~\\bibnamefont {Goushi}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont\n  {K.}~\\bibnamefont {Yoshida}},\\ }\\href@noop {} {\\enquote {\\bibinfo {title}\n  {Delayed fluorescence material and organic electroluminescence device},}\\\n  }\\bibinfo {note} {\\hbox{US} Patent App. 13/220,319 (2012).}\\BibitemShut\n  {Stop}\n\\bibitem [{\\citenamefont {Mark}\\ and\\ \\citenamefont\n  {Helfrich}(1962)}]{Mark1962}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {P.}~\\bibnamefont\n  {Mark}}\\ and\\ \\bibinfo {author} {\\bibfnamefont {W.}~\\bibnamefont\n  {Helfrich}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {Space-charge-limited currents in organic cystals},}\\ }\\href@noop {}\n  {\\bibfield  {journal} {\\bibinfo  {journal} {J. Appl. Phys.}\\ }\\textbf\n  {\\bibinfo {volume} {33}},\\ \\bibinfo {pages} {205} (\\bibinfo {year}\n  {1962})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Rybicki}\\ \\emph {et~al.}(2012)\\citenamefont\n  {Rybicki}, \\citenamefont {Lin}, \\citenamefont {Wang}, \\citenamefont\n  {Wohlgenannt}, \\citenamefont {He}, \\citenamefont {Sanders},\\ and\\\n  \\citenamefont {Suzuki}}]{Rybicki:2012:PRL}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {J.}~\\bibnamefont\n  {Rybicki}}, \\bibinfo {author} {\\bibfnamefont {R.}~\\bibnamefont {Lin}},\n  \\bibinfo {author} {\\bibfnamefont {F.}~\\bibnamefont {Wang}}, \\bibinfo {author}\n  {\\bibfnamefont {M.}~\\bibnamefont {Wohlgenannt}}, \\bibinfo {author}\n  {\\bibfnamefont {C.}~\\bibnamefont {He}}, \\bibinfo {author} {\\bibfnamefont\n  {T.}~\\bibnamefont {Sanders}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont\n  {Y.}~\\bibnamefont {Suzuki}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {Tuning the performance of organic spintronic devices using x-ray generated\n  traps},}\\ }\\href {\\doibase 10.1103/PhysRevLett.109.076603} {\\bibfield\n  {journal} {\\bibinfo  {journal} {Phys. Rev. Lett.}\\ }\\textbf {\\bibinfo\n  {volume} {109}},\\ \\bibinfo {pages} {076603} (\\bibinfo {year}\n  {2012})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Guyot-Sionnest}\\ \\emph {et~al.}(2007)\\citenamefont\n  {Guyot-Sionnest}, \\citenamefont {Yu}, \\citenamefont {Jiang},\\ and\\\n  \\citenamefont {Kang}}]{Guyot-Sionnest2007}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Philippe}\\\n  \\bibnamefont {Guyot-Sionnest}}, \\bibinfo {author} {\\bibfnamefont {Dong}\\\n  \\bibnamefont {Yu}}, \\bibinfo {author} {\\bibfnamefont {Pei-Hsun}\\ \\bibnamefont\n  {Jiang}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {Woowon}\\ \\bibnamefont\n  {Kang}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title} {{Spin blockade in\n  the conduction of colloidal CdSe nanocrystal films.}}}\\ }\\href {\\doibase\n  10.1063/1.2748765} {\\bibfield  {journal} {\\bibinfo  {journal} {J. Chem.\n  Phys.}\\ }\\textbf {\\bibinfo {volume} {127}},\\ \\bibinfo {pages} {014702}\n  (\\bibinfo {year} {2007})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Timmel}\\ \\emph {et~al.}(1998)\\citenamefont {Timmel},\n  \\citenamefont {Till}, \\citenamefont {Brocklehurst}, \\citenamefont\n  {McLaughlin},\\ and\\ \\citenamefont {Hore}}]{Timmel1998}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {C.~R.}\\ \\bibnamefont\n  {Timmel}}, \\bibinfo {author} {\\bibfnamefont {U.}~\\bibnamefont {Till}},\n  \\bibinfo {author} {\\bibfnamefont {B.}~\\bibnamefont {Brocklehurst}}, \\bibinfo\n  {author} {\\bibfnamefont {K.~A.}\\ \\bibnamefont {McLaughlin}}, \\ and\\ \\bibinfo\n  {author} {\\bibfnamefont {P.~J.}\\ \\bibnamefont {Hore}},\\ }\\bibfield  {title}\n  {\\enquote {\\bibinfo {title} {Effects of weak magnetic fields on free radical\n  recombination yields},}\\ }\\href@noop {} {\\bibfield  {journal} {\\bibinfo\n  {journal} {Molecular Physics}\\ }\\textbf {\\bibinfo {volume} {95}},\\ \\bibinfo\n  {pages} {71} (\\bibinfo {year} {1998})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Swartz}\\ \\emph {et~al.}(2014)\\citenamefont {Swartz},\n  \\citenamefont {Harashima}, \\citenamefont {Xie}, \\citenamefont {Lu},\n  \\citenamefont {Kim}, \\citenamefont {Bell}, \\citenamefont {Hikita},\\ and\\\n  \\citenamefont {Hwang}}]{Swartz2014}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Adrian~G.}\\\n  \\bibnamefont {Swartz}}, \\bibinfo {author} {\\bibfnamefont {Satoshi}\\\n  \\bibnamefont {Harashima}}, \\bibinfo {author} {\\bibfnamefont {Yanwu}\\\n  \\bibnamefont {Xie}}, \\bibinfo {author} {\\bibfnamefont {Di}~\\bibnamefont\n  {Lu}}, \\bibinfo {author} {\\bibfnamefont {Bongju}\\ \\bibnamefont {Kim}},\n  \\bibinfo {author} {\\bibfnamefont {Christopher}\\ \\bibnamefont {Bell}},\n  \\bibinfo {author} {\\bibfnamefont {Yasuyuki}\\ \\bibnamefont {Hikita}}, \\ and\\\n  \\bibinfo {author} {\\bibfnamefont {Harold~Y.}\\ \\bibnamefont {Hwang}},\\\n  }\\bibfield  {title} {\\enquote {\\bibinfo {title} {{Spin-dependent transport\n  across Co/LaAlO3/SrTiO3 heterojunctions}},}\\ }\\href {\\doibase\n  10.1063/1.4891174} {\\bibfield  {journal} {\\bibinfo  {journal} {Appl. Phys.\n  Lett.}\\ }\\textbf {\\bibinfo {volume} {105}},\\ \\bibinfo {pages} {032406}\n  (\\bibinfo {year} {2014})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Inoue}\\ \\emph {et~al.}(2015)\\citenamefont {Inoue},\n  \\citenamefont {Swartz}, \\citenamefont {Harmon}, \\citenamefont {Tachikawa},\n  \\citenamefont {Hikita}, \\citenamefont {Flatt{\\'{e}}},\\ and\\ \\citenamefont\n  {Hwang}}]{Inoue2015}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {Hisashi}\\ \\bibnamefont\n  {Inoue}}, \\bibinfo {author} {\\bibfnamefont {Adrian~G.}\\ \\bibnamefont\n  {Swartz}}, \\bibinfo {author} {\\bibfnamefont {Nicholas~J.}\\ \\bibnamefont\n  {Harmon}}, \\bibinfo {author} {\\bibfnamefont {Takashi}\\ \\bibnamefont\n  {Tachikawa}}, \\bibinfo {author} {\\bibfnamefont {Yasuyuki}\\ \\bibnamefont\n  {Hikita}}, \\bibinfo {author} {\\bibfnamefont {Michael~E.}\\ \\bibnamefont\n  {Flatt{\\'{e}}}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont {Harold~Y.}\\\n  \\bibnamefont {Hwang}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {{Origin of the Magnetoresistance in Oxide Tunnel Junctions Determined\n  through Electric Polarization Control of the Interface}},}\\ }\\href {\\doibase\n  10.1103/PhysRevX.5.041023} {\\bibfield  {journal} {\\bibinfo  {journal} {Phys.\n  Rev. X}\\ }\\textbf {\\bibinfo {volume} {5}},\\ \\bibinfo {pages} {041023}\n  (\\bibinfo {year} {2015})}\\BibitemShut {NoStop}\n\\bibitem [{\\citenamefont {Ikeda}\\ \\emph {et~al.}(2008)\\citenamefont {Ikeda},\n  \\citenamefont {Hayakawa}, \\citenamefont {Ashizawa}, \\citenamefont {Lee},\n  \\citenamefont {Miura}, \\citenamefont {Hasegawa}, \\citenamefont {Tsunoda},\n  \\citenamefont {Matsukura},\\ and\\ \\citenamefont {Ohno}}]{Ikeda2008}\n  \\BibitemOpen\n  \\bibfield  {author} {\\bibinfo {author} {\\bibfnamefont {S.}~\\bibnamefont\n  {Ikeda}}, \\bibinfo {author} {\\bibfnamefont {J.}~\\bibnamefont {Hayakawa}},\n  \\bibinfo {author} {\\bibfnamefont {Y.}~\\bibnamefont {Ashizawa}}, \\bibinfo\n  {author} {\\bibfnamefont {Y.~M.}\\ \\bibnamefont {Lee}}, \\bibinfo {author}\n  {\\bibfnamefont {K.}~\\bibnamefont {Miura}}, \\bibinfo {author} {\\bibfnamefont\n  {H.}~\\bibnamefont {Hasegawa}}, \\bibinfo {author} {\\bibfnamefont\n  {M.}~\\bibnamefont {Tsunoda}}, \\bibinfo {author} {\\bibfnamefont\n  {F.}~\\bibnamefont {Matsukura}}, \\ and\\ \\bibinfo {author} {\\bibfnamefont\n  {H.}~\\bibnamefont {Ohno}},\\ }\\bibfield  {title} {\\enquote {\\bibinfo {title}\n  {{Tunnel magnetoresistance of 604\\%\\ at 300~K by suppression of Ta diffusion\n  in CoFeB/MgO/CoFeB pseudo-spin-valves annealed at high temperature}},}\\\n  }\\href {\\doibase 10.1063/1.2976435} {\\bibfield  {journal} {\\bibinfo\n  {journal} {Appl. Phys. Lett.}\\ }\\textbf {\\bibinfo {volume} {93}},\\ \\bibinfo\n  {pages} {082508} (\\bibinfo {year} {2008})}\\BibitemShut {NoStop}\n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 37607, "prevtext": "\nwhich is an exact expression.\nBy the binomial series expansion, we obtain leading order terms\n\n", "index": 7, "text": "\\begin{equation}\nMC \\approx -\\alpha \\frac{\\Delta V}{V} +\\frac{\\alpha}{2}(\\alpha - 1) \\left (\\frac{\\Delta V}{V} \\right )^2 - ...\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"MC\\approx-\\alpha\\frac{\\Delta V}{V}+\\frac{\\alpha}{2}(\\alpha-1)\\left(\\frac{%&#10;\\Delta V}{V}\\right)^{2}-...\" display=\"block\"><mrow><mrow><mi>M</mi><mo>⁢</mo><mi>C</mi></mrow><mo>≈</mo><mrow><mrow><mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>V</mi></mrow><mi>V</mi></mfrac></mrow></mrow><mo>+</mo><mrow><mfrac><mi>α</mi><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>α</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>V</mi></mrow><mi>V</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>-</mo><mi mathvariant=\"normal\">…</mi></mrow></mrow></math>", "type": "latex"}]