[{"file": "1601.00967.tex", "nexttext": "\nwhere the $M_{\\rm dm}$ is the total dark matter mass in the halo, and\nthe $f_{\\rm b} = \\Omegab/\\Omegam \\sim 0.15$ is the cosmic baryon\nfraction (the ratio between baryon density and mass density including baryonic mass\nplus dark matter), so that the  $M_{\\rm b}$ is the baryonic mass inside the\nvirial radius if the baryons follow the dark matter closely.\n\nFig.~\\ref{fig:budget} shows the ratio between the  mass of each baryon\ncomponent inside the virial radius \nto the fiducial baryonic mass for the most massive galaxy in\neach zoom-in region. We present the fractions of total stellar mass\n(blue points), and the total baryonic mass\nincluding stellar mass plus gas mass (green points).\nFor the stellar mass fraction we also show the relations from the halo abundance \nmatching \\citep{Moster13, Behroozi13, Kravtsov14}.\nThe grey area is the one sigma scatter around the mean value \nfrom \\citet{Kravtsov14}.\n\nWe tried to capture the behaviour of the baryonic mass fraction as a \nfunction of the halo mass using a double power law formula:\n\n", "itemtype": "equation", "pos": 7555, "prevtext": "\n\n\\date{to be submitted to MNRAS}\n             \n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\\pubyear{2015}\n\n\\maketitle           \n\n\\label{firstpage}\n             \n\n\n\\begin{abstract}\n  We use the NIHAO galaxy formation simulations to make predictions\n  for the baryonic budget  in present day galaxies ranging from dwarf\n  ($\\Mhalo\\sim10^{10} \\Msun$) to Milky Way ($\\Mhalo\\sim10^{12} \\Msun$)\n  masses.  The sample is made of 88 independent high resolution\n  cosmological zoom-in simulations.  NIHAO galaxies reproduce key\n  properties of observed galaxies, such as the stellar mass vs halo\n  mass and cold gas vs stellar mass relations. Thus they make\n  plausible predictions for the baryon budget.  We present the mass\n  fractions of stars, cold gas ($T<10^4$K), cool gas ($10^4 < T <\n  10^5$K), warm-hot gas ($10^5 < T < 10^7$K), and hot gas ($10^7$K$ <\n  T$), inside the virial radius, $R_{200}$.  Compared to the predicted\n  baryon mass, using the dark halo mass and the universal baryon\n  fraction, $f_{\\rm b}\\equiv \\Omega_{\\rm b}/\\Omega_{\\rm m}=0.15$, we\n  find that for all of our haloes, the missing mass is not just outside \n  the virial radius $\\Rvir$, it has been relocated past 2$\\Rvir$.  \n  Haloes of mass $\\Mhalo\\sim 10^{10}\\Msun$ are missing $\\sim\n  90\\%$ of their baryons.  More massive haloes ($\\Mhalo\\sim\n  10^{12}\\Msun$) retain a higher fraction of their baryons, with $\\sim\n  30\\%$ missing, consistent with observational estimates.    \n\n\n\n\n\n\\end{abstract}\n\n\\begin{keywords}\n  galaxies: evolution -- galaxies: formation -- galaxies: dwarf -- galaxies: spiral -- \n  methods: numerical -- cosmology: theory\n\\end{keywords}\n\n\\setcounter{footnote}{1}\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:intro}\nCosmic structure formation has redistributed the baryons from  a\nnearly uniformly distributed plasma into a variety of states,\nincluding stars, stellar remnants, cold (atomic and molecular) gas,\nand hot (ionized) gas. The theories of galaxy formation can predict\nthe amount of mass in these different states, which can in turn be tested by\nobservational constraints.  \n\n\nOn cosmological scales, the ratio between the total baryonic and\ngravitating mass is measured to be $f_{\\rm b}\\equiv \\Omega_{\\rm\n  b}/\\Omega_{\\rm m}\\simeq 0.16$ (The Planck Collaboration 2014).\nHowever, the cold baryonic mass density implied by several galaxy baryon\nestimates is only 3-8\\% of the big bang nucleosynthesis expection\n\\citep{Persic92, Fukugita98,  Bell03, McGaugh10}.  The majority of the\ncosmic baryons are thought to be in the form of hot gas around or\nbetween galaxies \\citep{Cen09}. Until recently only a fraction of\nthese baryons had been detected \\citep{Bregman07, Shull12}.  This\ndiscrepancy is referred to as the ``missing baryon problem''.\nRecent advances in the detection of gas in the circum\ngalactic medium (CGM) have come from the COS survey \\citep{Tumlinson11,\n  Tumlinson13, Thom12,  Werk12, Werk13}.  On the scale of Milky Way\nmass haloes $\\Mhalo \\sim 10^{12}\\Msun$ a significant amount of warm\n($10^4 < T < 10^7$K) gas has been detected \\citep{Werk14}, accounting\nfor 33-88\\% of the baryon budget. In the future such observations will\nbe extended to a wider range of halo masses.\n\n\nIn this paper we make predictions for the baryonic budget for stars,\ncold, warm and hot gas in and around the virial radius of haloes of\nmass ranging from $\\Mhalo\\sim 10^{10}\\Msun$ to $10^{12}\\Msun$. We use\na sample of 88 zoom-in galaxy formation simulations from the NIHAO\nproject. NIHAO galaxies are consistent with the stellar mass vs halo\nmass relations from halo abundance matching since redshift $z\\sim 4$\n\\citep{Wang15}, the galaxy star formation rate vs stellar mass\nrelation since $z\\sim 4$ \\citep{Wang15}, and the cold gas mass vs\nstellar mass relation at $z\\sim 0$ (Stinson {et~al.~} 2015).  Therefore,\nthe simulations make plausible predictions for the mass fractions and\nphysical locations of the warm and hot gas components.  We find that\nall the haloes contain less baryons than expected according to the\ncosmic baryonic fraction, but the missing fraction is strongly mass\ndependent.\n\nThis paper is organized as follows: The cosmological hydrodynamical\nsimulations including star formation and feedback are briefly\ndescribed in  \\S\\ref{sec:sims}; In \\S\\ref{sec:budget} we present the\nresults including the baryonic budget, baryon distribution, and a\ncomparison with observations; \\S\\ref{sec:sum} gives a summary of our\nresults.\n\n\n\n\n\n\n\n\n\\section{Simulations} \n\\label{sec:sims}\n\nIn this study we use simulations from the NIHAO (Numerical\nInvestigation of a Hundred Astrophysical Objects) project \\citep{Wang15}.  \nThe initial conditions are created to keep the same numerical\nresolution across the whole mass range with typically a million dark\nmatter particles inside the virial radius of the target halo at \nredshift $z=0$.  The halos to be re-simulated at higher resolution\nwith baryons have been extracted from 3 different pure N-body\nsimulations with a box size of 60, 20 and 15 $h^{-1}$ Mpc\nrespectively.  We adopted the  latest compilation of cosmological\nparameters from the Planck  satellite \\citep{Planck14}. \nMore information on the collisionless parent simulations and\nsample  selection can be found in \\citet{Dutton14} and \\citet{Wang15}\n\nWe use the SPH hydrodynamics code {\\sc gasoline} \\citep{Wadsley04},\nwith a revised treatment of  hydrodynamics as described in\n\\citet{Keller14}.  The code includes a subgrid model for turbulent\nmixing of metal and energy \\citep{Wadsley08}, heating and cooling\ninclude photoelectric heating of dust grains, ultraviolet (UV) heating\nand ionization and  cooling due to hydrogen, helium and metals\n\\citep{Shen10}.  The star formation and feedback modeling follows what\nwas used in the MaGICC simulations \\citep{Stinson13}.  There are two\nsmall changes in NIHAO simulations: The change in  number of neighbors\nand the new combination of softening length and  particle mass increases\nthe threshold for star formation from  9.3 to 10.3\ncm$^{-3}$, the increase of pre-SN feedback efficiency $\\epsilon_{\\rm\n  ESF}$, from 0.1 to 0.13.  The more detail on star formation and\nfeedback modeling can be found in \\citet{Wang15}.\n\n\n\n\n\\begin{figure}\n\\centerline{\n\n\n\n  \\psfig{figure=barbudget_linearlog.eps,width=0.5\\textwidth}\n}\n\\caption{Fractional baryon content of our NIHAO simulations \n  as a function of halo\n  mass. The green points show the ratio between the baryonic mass\n  (stars + gas) inside the virial radius and the total baryonic mass\n  associated with the dark matter halo and the green lines are best\n  fitting lines. The blue points show the\n  corresponding fraction for the stars. The solid green line and\n  shaded region shows a double power-law fit, together with the\n  1$\\sigma$ scatter. For the stellar mass fraction we show several\n  relations from halo abundance matching.    The linear (upper panel)\n  and logarithmic (lower panel) scales emphasize the large amount of\n  ``missing'' baryons and the low star formation efficiencies.}\n\\label{fig:budget}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\centerline{\n  \\psfig{figure=ratioprofile_v4.eps,width=0.5\\textwidth}\n}\n\\caption{Baryon distribution of each galaxy from NIHAO simulations.\n  A comparison of how the baryons distribute in the halo with \n  different masses. \n  The lines are color coded by their halo mass, which show a clear\n  trend that the more massive halo preserve more baryons alone\n  the radius.}\n\\label{fig:rps}\n\\end{figure}\n\n\n\n\\section{Baryon budget}\n\\label{sec:budget}\n\nWe define the fiducial baryonic mass as:\n\n", "index": 1, "text": "\\begin{equation}\nM_{\\rm b} \\equiv M_{\\rm b}(R_{200})= \\frac{f_{\\rm b}}{1-f_{\\rm b}}M_{\\rm dm}(R_{200}) \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm b}\\equiv M_{\\rm b}(R_{200})=\\frac{f_{\\rm b}}{1-f_{\\rm b}}M_{\\rm dm}(R_{%&#10;200})\" display=\"block\"><mrow><msub><mi>M</mi><mi mathvariant=\"normal\">b</mi></msub><mo>≡</mo><mrow><msub><mi>M</mi><mi mathvariant=\"normal\">b</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mn>200</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>f</mi><mi mathvariant=\"normal\">b</mi></msub><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi mathvariant=\"normal\">b</mi></msub></mrow></mfrac><mo>⁢</mo><msub><mi>M</mi><mi>dm</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mn>200</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00967.tex", "nexttext": "\nIn this formula, the lower and higher mass ends have logarithmic slope\n$\\alpha$ and $\\beta$, respectively, while $\\gamma$ regulates how \nsharp the transition is from the lower to the higher ends.\nThe best fit parameters are as follows:\n\\begin{eqnarray}\n\\mathcal{M}_0  &=&  6.76 \\times 10^{10} \\nonumber \\\\\nf_0  &=&   0.336 \\nonumber \\\\\n\\alpha  &=&   0.684 \\\\\n\\beta  &=&   0.205 \\nonumber \\\\\n\\gamma  &=&   3.40\\nonumber  \n\\end{eqnarray}\nThe green shaded region indicates the scatter about the best fit line. These are \nmeasured in four different mass ranges, and are  summarized in Table.~\\ref{tab:sigma}.\n\n\n\n\\begin{table}\n\\caption{Scatters for best fit parameters for the total baryonic mass \nfraction computed inside one virial radius, $R_{200}$,  as a function of halo mass $M_{200}$\nin different mass ranges.} \n\\begin{center}\n\\begin{tabular}{lc}\n\\hline\nMass Range & $\\sigma $ \\\\\n\\hline\n$3\\times 10^{9}\\Msun < M_{200} <2\\times 10^{10} \\Msun$ & 0.151 \\\\\n$2\\times 10^{10}\\Msun < M_{200} < 7\\times 10^{10} \\Msun$ & 0.236 \\\\\n$7\\times 10^{10}\\Msun < M_{200} < 3\\times 10^{11} \\Msun$ & 0.125 \\\\\n$3\\times 10^{11}\\Msun < M_{200} < 3.5\\times 10^{12} \\Msun$ & 0.0518 \\\\\n\\hline\n\\end{tabular}\n\\label{tab:sigma}\n\\end{center}\n\\end{table}\n\n\n\nThe trends of each component fraction are similar, in that  the\nfractions are relatively low in low mass haloes, and increase as the\nhalo mass increases.  The main difference between the different\ncomponents is the slope, with the baryonic mass fraction having a\nshallower slope than the stellar mass fraction.  This is because in low mass haloes\n($\\Mhalo\\sim 10^{10}\\Msun$) most of the baryons are in the form of\ngas, while in the highest mass haloes we study ($\\Mhalo\\sim\n10^{12}\\Msun$) there are roughly equal amounts of stars and gas.\n\nFig.~\\ref{fig:budget} shows that all haloes in our study contain\nless than the universal fraction of baryons. The\nupper panel uses a linear y-axis scale, which highlights the large\namount of baryons that are missing, especially in low mass haloes. The\nlogarithmic scale in the lower panel highlights the power-law nature of the relatons.\n\nSince the haloes we study are above the mass where the cosmic UV\nbackground prevents gas from cooling, the missing baryons have most\nlikely been ejected from the central galaxies in supernova/stellar\nfeedback driven winds.  Although the lower mass galaxies have\nconverted a smaller fraction of their available baryons into stars,\nand hence there is proportionally less energy available to drive an\noutflow, they have expelled a larger fraction of their baryons,\nconsistent with expectations from energy driven gas outflows\n\\citep[e.g.,][]{Dutton12}.\n\n\n\\subsection{Where are the missing baryons?}\n\\label{sec:where}\n\nFig.~\\ref{fig:rps} shows the mass ratio profiles of total baryons  for\neach simulation. Here the y-axis is the ratio between the baryonic to\ndark matter mass, $M_{\\rm b}(<R) / M_{\\rm dm}(<R)$, enclosed\nwithin a sphere of radius, $R$, normalized by the cosmic\nbaryon-to-dark matter ratio, $\\Omega_{\\rm b}/\\Omega_{\\rm dm}$.\n\nEach solid curve represents a halo, and the curves are colored by\ntheir halo mass (red for high masses to blue for low masses).  Broadly\nspeaking, the curves have a similar shape, with a normalization that\ndepends on halo mass. They have a cusp in  the central region where the\nstars and cold gas dominate, then become flat in the outer region.\nMore massive haloes have higher baryon fractions at all radii.  At\nsmall radii, the baryon to dark matter ratio is higher than the cosmic\nvalue due to gas dissipation.  Even beyond the virial radius, there is\nlittle change in the baryon fraction up to 2 virial radii.  We thus\nconclude that the missing baryons are well outside of the virial\nradius.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\centerline{\n  \\psfig{figure=budget_v3.eps,width=0.5\\textwidth}\n}\n\\caption{Baryonic budget (the fraction of different components) \n  of $3.5\\times 10^{11} < M_{200}/\\Msun <\n  3.5 \\times 10^{12}$ NIHAO galaxies (blue points \n  with 1$\\sigma$ error bars) compared with observations of \n  M$_{200}$ = 10$^{12.2}$ $\\Msun$ galaxies (shaded regions)\n  }\n\\label{fig:comparison}\n\\end{figure}\n\n\n\n\n\\begin{table*}\n\\caption{The baryonic budget parameters for galaxies in NIHAO sample\n  in different mass bins. We refer to gas in the temperature range  T\n  $<$ $10^4$ K as cold; $10^4$ K $\\leqslant$ T $<$ $10^5$ K as cool;\n  $10^5$ K $\\leqslant$ T $<$ $10^7$ K as warm;  and T $\\geqslant$\n  $10^7$ K as hot.}\n\\begin{center}\n\\begin{tabular}{ccccc}\n\\hline\n\\hline\n\\end{tabular}\n\\label{tab:comperison}\n\\end{center}\n\\end{table*}\n\n\n\n\\subsection{Comparison with Observations of Milky Way mass haloes}\nSince the CGM is too diffuse to create emission lines, it must be\nobserved using quasar absorption lines.\nThe COS-HALOs survey is filling in details about the $z \\sim 0$\nCGM \\citep{Peeples14, Tumlinson11, Tumlinson13, Werk12, Werk13, Werk14}.\nFor the CGM of low-redshift $L^*$ galaxies, \\citet{Tumlinson13} and \n\\citet{Peeples14} constrain the mass of  the\nwarm-hot CGM ($T \\sim 10^{5-7}$), \\citet{Werk14} provides a strict\nlower limit to the mass of cool material ($T \\sim 10^{4-5}$) in the\nCGM of these galaxies.  In a study using X-rays, \n\\citet{Anderson13} place a\nconstraints on the mass of  hot gas ($T > 10^7$) residing in the\nextended hot halos.  \n\nIn Fig.~\\ref{fig:comparison}, we show the mean values and standard deviation\nof the mass fraction of stars and different components of gas in our\nmost massive galaxies ($3.49 \\times 10^{11} \\Msun$ $<$ M$_{200}$ $<$ \n$3.53 \\times 10^{12} \\Msun$) with blue points and error bars.\nThe gas is assigned to a range of temperature bins: \ncold gas (T $< 10^4$ K), cool gas ($10^4$ K $<$ T $< 10^5$ K), \nwarm gas ($10^5$ K $<$ T $< 10^7$ K) and hot gas (T $> 10^7$ K).\nThe observational constraints are shown with the same colour scheme\nin Fig. 11 in \\citet{Werk14}.\n\nIn this plot \\citet{Werk14} provides observational constraints for \nCGM gas mass that are shown as the shaded bars.\nThe stellar  mass range comes from\nhalo abundance matching as described in \\citet{Kravtsov14}.  \nThe cold disk gas mass comes from from \\citet{Dutton11}.  \n\nThe observations and the simulations match well in every phase\noutside of the cool CGM gas, where the observations find $3\\times$\nthe mass that simulations predict.  If the observations are correct,\nthe simulations have either ejected too far gas that could be cool, or \nthey have created a CGM with the wrong mix of gas temperatures. The\ntotal gas fractions (0.39 in COS-HALOs, 0.41 in NIHAO) suggest the\nlatter option.  As the CGM of lower mass galaxies will soon be observed ,\nTable~\\ref{tab:comperison} lists information about CGM\nmass fractions of the different components of gas in haloes down to a\nhalo mass of $\\sim 10^{10}\\Msun$.\n\n\n\n\n\n\n\n\\section{Summary}\n\\label{sec:sum}\n\nWe have used the NIHAO galaxy simulation suite \\citep{Wang15} to study\nthe statistical features of the baryonic budget and distribution\nspanning halo masses of $\\sim 10^{10}$ to $\\sim 10^{12}\\Msun$. NIHAO\nis a large (currently 88) set of high resolution cosmological\nhydrodynamical galaxy formation simulations. As shown in previous papers\nthe NIHAO galaxies reproduce several key observed scaling relations.\nWe summarize our results as follows:\n\n\\begin{itemize}\n\\item All of the NIHAO haloes have a lower baryon to dark matter ratio, \n      inside the viriral radius, than the cosmic baryon fraction. \n\n\\item The missing baryons in all haloes are beyond 2 virial radii.\n\n\\item Lower mass haloes have lost a larger fraction of their baryons, \n      even though they convert a lower fraction of the baryons into stars.\n\n\\item For the highest mass haloes in our study $\\sim 10^{12}\\Msun$ \n      our simulations are consistent with the observed fractions of stars, \n      cold gas, warm and hot gas. However, we underpredict \n      the cool ($10^4 < T < 10^5 K$) gas with $f_{\\rm cool}=0.11\\pm0.06$ \n      vs 0.28-0.48 observed.\n\n\\item This discrepancy may indicate that our feedback model pushes the \n      gas too far, or puts gas in the wrong phases, \n      and can be resolved with future observations. \n      Since we match the overall gas fraction we think that  \n      there might be some problem in mixing the gas temperature.\n\\end{itemize}\n\n\n\\section*{Acknowledgments} \n\n{\\sc Gasoline} was written by Tom Quinn and James Wadsley. Without\ntheir contribution, this paper would have been impossible.\nThe simulations were performed on the {\\sc theo} cluster of the\nMax-Planck-Institut f\\\"ur Astronomie and the {\\sc hydra} cluster at\nthe Rechenzentrum in Garching; and the Milky Way supercomputer, funded\nby the Deutsche Forschungsgemeinschaft (DFG) through Collaborative\nResearch Center (SFB 881) \"The Milky Way System\" (subproject Z2),\nhosted and co-funded by the J\\\"ulich Supercomputing Center (JSC). We\ngreatly appreciate the contributions of all these computing\nallocations.  AAD, GSS and AVM acknowledge support through the\nSonderforschungsbereich SFB 881 â\u0080\u009cThe Milky Way Systemâ\u0080\u009d (subproject A1)\nof the German Research Foundation (DFG).  The analysis made use of the\npynbody package \\citep{Pontzen13}.\n\nThe authors acknowledge support from the MPG-CAS through the\npartnership programme between the MPIA group lead by AVM and the PMO\ngroup lead by XK.\nLW acknowledges support of the MPG-CAS student\nprogramme.\nXK acknowledge the support from 973 program (No. 2015CB857003, 2013CB834900),\nNSFC project No.11333008 and the ``Strategic Priority Research Program the Emergence\nof Cosmological Structures'' of the CAS(No.XD09010000).\n\n\n\n\n\n\n\\begin{thebibliography}{}\n\n\n\n\n\\bibitem[Anderson et al.(2013)]{Anderson13} Anderson, M.~E., Bregman, J.~N., Dai, X.\\ 2013, {ApJ}, 762, 106\n\n\n\\bibitem[Agertz et al.(2007)]{Agertz07} Agertz, O., Moore, B., Stadel, J.\\ 2007, {MNRAS}, 380, 963\n\n\n\n\n\n\\bibitem[Behroozi et al.(2013)]{Behroozi13} Behroozi, P.~S.,\n  Wechsler, R.~H., \\& Conroy, C.\\ 2013, {ApJ}, 770, 57\n\n\n\\bibitem[Bell et al.(2003)]{Bell03} Bell, E.~F., McIntosh, D.~H., Katz, N., Weinberg, M.~D.,\\ 2003, {ApJ}, 585, 117\n\n\n\n\n\n\n\\bibitem[Bregman (2007)]{Bregman07}\nBregman, J.~N.\\ 2007, ARAA, 45, 221\n\n\n\n\n\\bibitem[Cen \\& Ostriker (1999)]{Cen09} \nCen, R.~Y., Ostriker, J.~P.\\ 1999, {ApJ}, 514, 1\n\n\n\n\n\n\n\\bibitem[Dutton et al.(2011)]{Dutton11} Dutton, A.~A., Conroy, \n  C., van den Bosch, F.~C., et al.\\ 2011, {MNRAS}, 416, 322\n  \n\n\\bibitem[Dutton(2012)]{Dutton12} Dutton, A.~A.\\ 2012,\n  {MNRAS}, 424, 3123\n  \n\n\\bibitem[Dutton \\& Macci{\\`o}(2014)]{Dutton14} Dutton,\n  A.~A., \\& Macci{\\`o}, A.~V.\\ 2014, {MNRAS}, 441, 3359 \n\n\n\n\n    \n\n\n\n\\bibitem[Fukugita et al.(1998)]{Fukugita98} Fukugita, M., Hogan, C.~J., Peebles, P.~J.~F.\\ 1998, {ApJ}, 503, 518\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem[Keller et al.(2014)]{Keller14} Keller, B.~W., Wadsley, \n  J., Benincasa, S.~M., \\& Couchman, H.~M.~P.\\ 2014, {MNRAS}, 442, 3013\n\n\n\n\\bibitem[Kravtsov et al.(2014)]{Kravtsov14} Kravtsov, A., \nVikhlinin, A., \\& Meshscheryakov, A.\\ 2014, arXiv:1401.7329 \n\n  \n\n\n\n\n\n\n\\bibitem[McGaugh et al.(2010)]{McGaugh10} McGaugh, S.~S., \nSchombert, J.~M., de Blok, W.~J.~G., Zagursky, M.~J.\\ 2010, {MNRAS},\n708, 14\n\n\n\\bibitem[Moster et al.(2013)]{Moster13} Moster, B.~P., Naab, T., \n\\& White, S.~D.~M.\\ 2013, {MNRAS}, 428, 3121 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem[the Planck Collaboration et  al.(2014)]{Planck14}\n  Planck Collaboration, Ade, P.~A.~R., Aghanim, N., et al.\\ 2014,\n  {A\\&A}, 571, AA16 \n \n\n\\bibitem[Peeples et al.(2014)]{Peeples14} Peeples, M.~S., Werk, J.~K., Tumlinson, J., et al.\\ 2014, {ApJ}, 786, 54\n\n\n\n\n\n\n\\bibitem[Persic \\& Salucci(1992)]{Persic92} Persic, M., Salucci, P.\\ 1992, {MNRAS}, 258, 14\n\n\n\\bibitem[Pontzen et al.(2013)]{Pontzen13} Pontzen, A., Ro{\\v s}kar, R., Stinson, G., \\& Woods, R.\\ 2013, Astrophysics Source Code Library, 1305.002 \n\n\n\n\n\n  \n\n\n\n\n\n\n\n\\bibitem[Shen et al.(2010)]{Shen10} Shen, S., Wadsley, J., \n\\& Stinson, G.\\ 2010, {MNRAS}, 407, 1581 \n\n\n\\bibitem[Shull et al.(2012)]{Shull12}\nShull, J.~M., Smith, B.~D., Danforth, C.~W.\\ 2012, {ApJ}, 759, 23\n\n\n\\bibitem[Stinson et al.(2013)]{Stinson13} Stinson, G.~S., Brook, \nC., Macci{\\`o}, A.~V., et al.\\ 2013, {MNRAS}, 428, 129 \n\n\n\n\n\n\n\\bibitem[Thom et al.(2012)]{Thom12}\nThom, C., Tumlinson, J., Werk, J.~K.\\ 2012, {ApJL}, 758, L41\n\n\n\n\\bibitem[Tumlinson et al.(2011)]{Tumlinson11} Tumlinson, J., Thom, C., Werk, J., et al.\\ 2011, Science, 334, 948\n\n\n\\bibitem[Tumlinson et al.(2013)]{Tumlinson13} Tumlinson, J., Thom, C., Werk, J., et al.\\ 2013, {ApJ}, 777, 59\n\n\n\n\n\n\n\n\n\\bibitem[Wadsley et al.(2004)]{Wadsley04} Wadsley, J.~W., Stadel, \nJ., \\& Quinn, T.\\ 2004, {NewA}, 9, 137 \n\n\n\\bibitem[Wadsley et al.(2008)]{Wadsley08} Wadsley, J.~W., \nVeeravalli, G., \\& Couchman, H.~M.~P.\\ 2008, {MNRAS}, 387, 427 \n\n  \n\\bibitem[Wang et al.(2015)]{Wang15} Wang, L., Dutton, A.~A.,  Stinson, G.~S., et al.\\ 2015, {MNRAS}, 454, 83\n  \n\n\\bibitem[Werk et al.(2012)]{Werk12} Werk, J.~k., Prochaska, J.~X., Thom, C., et al.\\ 2012, {ApJS}, 198, 3\n\n\n\\bibitem[Werk et al.(2013)]{Werk13} Werk, J.~k., Prochaska, J.~X., Thom, C., et al.\\ 2013, {ApJS}, 204, 17\n\n\n\\bibitem[Werk et al.(2014)]{Werk14} Werk, J.~k., Prochaska, J.~X., Thom, C., et al.\\ 2014, {ApJ}, 792, 8\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 8714, "prevtext": "\nwhere the $M_{\\rm dm}$ is the total dark matter mass in the halo, and\nthe $f_{\\rm b} = \\Omegab/\\Omegam \\sim 0.15$ is the cosmic baryon\nfraction (the ratio between baryon density and mass density including baryonic mass\nplus dark matter), so that the  $M_{\\rm b}$ is the baryonic mass inside the\nvirial radius if the baryons follow the dark matter closely.\n\nFig.~\\ref{fig:budget} shows the ratio between the  mass of each baryon\ncomponent inside the virial radius \nto the fiducial baryonic mass for the most massive galaxy in\neach zoom-in region. We present the fractions of total stellar mass\n(blue points), and the total baryonic mass\nincluding stellar mass plus gas mass (green points).\nFor the stellar mass fraction we also show the relations from the halo abundance \nmatching \\citep{Moster13, Behroozi13, Kravtsov14}.\nThe grey area is the one sigma scatter around the mean value \nfrom \\citet{Kravtsov14}.\n\nWe tried to capture the behaviour of the baryonic mass fraction as a \nfunction of the halo mass using a double power law formula:\n\n", "index": 3, "text": "\\begin{equation}\n\\frac{f}{f_0} = \\left( \n                        \\frac{M_{200}}{\\mathcal{M}_0} \n                        \\right)^\\alpha \n                        \\left\\{ 0.5 \\left[ 1+\\left( \n                        \\frac{M_{200}}{\\mathcal{M}_0} \n                        \\right)^\\gamma \\right] \n                        \\right\\}^{\\frac{\\beta-\\alpha}{\\gamma}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{f}{f_{0}}=\\left(\\frac{M_{200}}{\\mathcal{M}_{0}}\\right)^{\\alpha}\\left\\{0.%&#10;5\\left[1+\\left(\\frac{M_{200}}{\\mathcal{M}_{0}}\\right)^{\\gamma}\\right]\\right\\}^%&#10;{\\frac{\\beta-\\alpha}{\\gamma}}.\" display=\"block\"><mrow><mrow><mfrac><mi>f</mi><msub><mi>f</mi><mn>0</mn></msub></mfrac><mo>=</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mn>200</mn></msub><msub><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mi>α</mi></msup><mo>⁢</mo><msup><mrow><mo>{</mo><mrow><mn>0.5</mn><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mn>200</mn></msub><msub><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mi>γ</mi></msup></mrow><mo>]</mo></mrow></mrow><mo>}</mo></mrow><mfrac><mrow><mi>β</mi><mo>-</mo><mi>α</mi></mrow><mi>γ</mi></mfrac></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]