[{"file": "1601.01600.tex", "nexttext": "\nIn turn, the anomalous propagator, $F$, and self-energy (or superfluid gap), $\\Delta$, are related to both the normal and the full propagators:\n\n", "itemtype": "equation", "pos": 15035, "prevtext": "\n\\title{Pairing in high-density neutron matter including short- and long-range correlations}\n\n\\author{D. Ding}\n\\affiliation{Department of Physics, Washington University, St. Louis, Missouri 63130, USA}\n\n\\author{A. Rios}\n\\affiliation{Department of Physics, Faculty of Engineering and Physical Sciences, University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom}\n\n\\author{H. Dussan}\n\\affiliation{Department of Physics, Washington University, St. Louis, Missouri 63130, USA}\n\n\\author{W. H. Dickhoff}\n\\affiliation{Department of Physics, Washington University, St. Louis, Missouri 63130, USA}\n\n\\author{S. J. Witte}\n\\affiliation{Department of Physics, Washington University, St. Louis, Missouri 63130, USA}\n\\affiliation{Department of Physics and Astronomy, University of California, Los Angeles, CA 90095, USA}\n\n\\author{A. Polls}\n\\affiliation{Departament d'Estructura i Constituents de la Mat{\\`e}ria and Institut de Ci{\\`e}nces del Cosmos, Universitat de Barcelona, Avinguda Diagonal 647, E-8028 Barcelona, Spain}\n\n\\date{\\today}\n\n\n\\begin{abstract}\nPairing gaps in neutron matter need to be computed in a wide range of densities to address open questions in neutron star phenomenology. Traditionally, the Bardeen-Cooper-Schrieffer approach has been used to compute gaps from bare nucleon-nucleon interactions. Here, we incorporate the influence of short- and long-range correlations in the pairing gaps. Short-range correlations are treated including the appropriate fragmentation of single-particle states, and substantially suppress the gaps. Long-range correlations dress the pairing interaction via density and spin modes, and provide a relatively small correction. We use three different interactions as a starting point to control for any systematic effects. Results are relevant for neutron-star cooling scenarios, in particular in view of the recent observational data on Cassiopeia A. \n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle\n\n\n\\section{Introduction}\n\nSuperfluids play an important role in nuclear physics, from nuclear structure to neutron-star observations~\\cite{Dean2003}. In the latter, superfluidity is a key ingredient in the description of several relevant astrophysical phenomena. In a sense, neutron stars are essential testing grounds for the pairing properties of dense systems. \nIt is important that theoretical considerations on dense matter superfluids are guided by knowledge on another relevant testing ground of superfluidity: finite nuclei. Many-body theory can provide insight on  different aspects of singlet and triplet pairing in nuclear matter~\\cite{Steiner2009,Leinson2010}. \n\nOn the one hand, neutron stars cool predominantly by neutrino emission~\\cite{Yakovlev2004}. This process depends sensitively on the neutrino weak rates in the dense nuclear medium~\\cite{Reddy1997,Sedrakian2007}. The presence of superfluid pairs in the crust and the core suppresses some of these rates. A comparison with astrophysical observations, providing age and temperature estimates for several pulsars, can be used to test the validity of some assumptions on the core's pairing properties. Recently, observations of rapid cooling in Cassiopeia A have been interpreted as evidence of the onset of triplet-pairing-mediated cooling in the core~\\cite{Page2011}. While there is some debate regarding these observations on the astrophysical community~\\cite{Elshamouty2013,Ho2015}, it seems appropriate to review the status of many-body calculations of the pairing gaps in infinite neutron matter. \n\nOn the other hand, the accepted model for glitching in pulsar requires the presence of superfluids in the crusts of neutron stars~\\cite{Anderson1975,Pines1985,Haskell2015}. Neutron superfluid vortices are not free to move, but rather remain pinned through the interaction with lattice nuclei or defects. While the bulk of the star slows down by the emission of electromagnetic radiation, the superfluid component can only change its angular momentum via a substantial reconfiguration of the vortex network. This occurs in a single violent, short rearrangement event, which gives rise to the glitch. The strength and periodicity of these glitches provide constraints on the amount of the star's momentum of inertia which is stored in the superfluid~\\cite{Link1992,Andersson2012,Chamel2013}. Traditional models consider the superfluid as pinned to the crust, but a recent analysis has suggested that glitch phenomena require superfluids in the outer core of the star, too~\\cite{Ho2015b}. In this picture, the gap closure density of singlet superfluids becomes a sensitive probe of neutron star interior physics. While the effect of triplet pairing has not  been studied in this context, its strength and density dependence are likely to be relevant as well. \n\nIn nuclei, a well-known experimental property of pairing is its isovector nature. Neutron-neutron and proton-proton pairs dominate to a large extent nuclear pairing~\\cite{Afanasjev2015}. The possibility of $np$ pairing is less likely to occur in $N \\ne Z$ nuclei, but even in $N \\approx Z$ nuclei isoscalar $np$ pairing is elusive~\\cite{Frauendorf2014}. In stark contrast, Bardeen--Cooper--Schrieffer (BCS) pairing calculations in sub-saturation infinite matter with bare nucleon-nucleon (NN) forces predict a dominant pairing gap, of the order of $10$ MeV, in the $np$ sector~ \\cite{Baldo1992,Dean2003,Muther2005,Maurizio2014}. Mechanisms have been proposed to explain why spin triplet pairing is particularly suppressed in nuclei~\\cite{Frauendorf2014,Gezerlis2011}. One needs to call upon many-body theory, particularly beyond BCS pairing, to reconcile empirical observations with theory. After all, the well-known BCS method works best for uncorrelated systems, and one can put into question its applicability in dense, correlated nuclear systems~\\cite{Dickhoff08}. \n\nOther than dressing the in-medium interaction, correlations beyond the traditional mean-field and BCS frameworks have a large impact on the redistribution of single-particle (sp) strength~\\cite{Dickhoff2004a}. Studies in electron knock-out experiments have unambiguously demonstrated that approximately $35 \\, \\%$ of the sp strength lies beyond the quasi-particle peak~\\cite{Lapikas1993,Benhar2008,Arrington2011}. About one third of this sp strength depletion can be attributed to short-range correlations (SRC), that empty the nuclear Fermi sea and promote strength to the high-momentum region~\\cite{Rohe2004,Rios2009,Rios2014}. SRC are very similar in different nuclei, which bodes well with the idea that SRC are caused to some extent by the local short-distance repulsion of the NN force ~\\cite{Alvioli2013,Atti2015}. This idea has been exploited to study generic properties of short-range correlated pairs, including their spin and isospin content~\\cite{Wiringa2014,Neff2015,Ryckebusch2015}. All theoretical approaches indicate that SRC are dominated by $np$ pairs in a region of the order of 50-100 MeV below the mean-field potential~\\cite{Muther95}, in accordance to experimental findings~\\cite{Sargsian2014,Hen2014}. \n\nPairing is active in a momentum region close to the Fermi surface. The removal of sp strength in this momentum region due to SRC should impact the corresponding pairing gap~\\cite{Bozek1999,Shen2003,Muther2005}. To go beyond BCS theory, the Gorkov-Green's functions diagrammatic approach can be used to include correlations systematically into the pairing properties~\\cite{Soma2011}. Microscopic calculations taking into account SRC indicate a reduction of singlet pairing gaps in nuclear and neutron matter~\\cite{Bozek2000,Muther2005}. A qualitatively similar answer is obtained when using a BCS-like approach that is quenched by $\\mathcal{Z}$ factors~\\cite{Shen2003,Dong2015}, although a realistic description requires a full account of the spectral function width~\\cite{Bozek2003,Muther2005}. At finite temperature, SRC also correct the corresponding critical temperature of the pairing transition. We emphasize that a $\\mathcal{T}$-matrix resummation that fully accounts for SRC is needed to describe pseudo-gap phenomena in the vicinity of the phase transition~\\cite{Schnell1999}. Moreover, and according to the Thouless criterion, the onset of pairing is in one-to-one correspondence with the appearance of a pole in the $\\mathcal{T}$-matrix~\\cite{Thouless1960,Kadanoff1961,Alm1993}.\n\nIn finite nuclei, long range correlations (LRC) are responsible for about $20 \\, \\%$ of the sp fragmentation via the coupling of sp states to low-lying resonances and collective modes ~\\cite{Dickhoff2004a}. For pairing properties, polarization effects should mostly renormalize the effective interaction~\\cite{Wambach1993}, even at very low densities \\cite{Schulze2001}. Density and spin collective motion is expected to dress the interaction of paired particles, which does not necessarily resemble the free space NN force~\\cite{Shen2003}. While the properties of LRC can be different in finite and infinite nuclear matter, a screening mechanism that dresses the pairing interaction is expected to affect both singlet and triplet pairing in neutron-star matter~\\cite{Shen2003,Shen2005,Cao2006,Dong2013}. In particular, corrections at the level of the effective pairing interaction occur at low energies and Fermi liquid theory (FLT) can be used to provide a phenomenological, but systematic, understanding of screening~\\cite{Migdal1967,Wambach1993,Schwenk2003,Schwenk2004}. \n\nIn the following, we use a theoretical approach that combines self-consistent Green's functions (SCGF) techniques and FLT to include consistently the effect of SRC and LRC in the singlet and triplet gaps of neutron matter. SRC are included by means of a well established finite-temperature ladder resummation scheme, which is also able to describe quantitatively the density and isospin dependence of high-momentum components and tensor-like correlations~\\cite{Frick2003,Rios2009,Rios2014}. We extrapolate self-energies to zero temperature, and use them to generate spectral functions that provide a quantitative account of the removal of strength close to the Fermi surface~\\cite{Muther2005}. Based on the Gorkov formalism, our approach provides a quantitative estimate of the effect of SRC on pairing gaps. The feedback from the superfluid phase into the normal Green's functions properties below the critical temperature is missing, but it is expected to be small. \n\nWe extend the treatment of SRC presented in Ref.~\\cite{Muther2005} in four directions for the astrophysically relevant case of neutron matter. First, we consider, in addition to the singlet $^1$S$_0$ case, the case of pairing in the coupled triplet wave, $^3$PF$_2$. The size and density regime in which this gap operates could have relevance for neutrino cooling~\\cite{Page2011} and glitch phenomena in pulsars~\\cite{Ho2015b}. Second, we have implemented a computational method to extrapolate self-energies, spectral functions and thermodynamical properties from finite-temperature calculations into zero temperature. \n\nThird, with the aim of quantifying any potential systematic uncertainties related to the underlying Hamiltonian, we work with three different NN interactions. We use two high-quality phase-shift equivalent potentials, the CDBonn~\\cite{Machleidt1995} and Argonne v18 (Av18)~\\cite{Wiringa1995} forces. In terms of SRC, the latter is traditionally considered to be harder than the former, in the sense that it induces larger high-momentum components in the many-body wave function~\\cite{Rios2009,Rios2014}. Moreover, we also employ the N3LO Idaho potential, that has been derived in the context of chiral perturbation theory~\\cite{Entem2003}. The cut-off associated to the chiral expansion is implemented in the form of a regulator function in relative momentum which sharply cuts the potential from $\\Lambda=500$ MeV on. As a consequence, pairing calculations, which are directly sensitive to the relative momentum dependence of the matrix elements due to the BCS kinematics, become sensitive to the artificial regulator function for Fermi momenta above $k_F \\approx 2.5$ fm$^{-1}$.  \n\nFinally, we supplement the calculations of SRC in the gap equation with a physically relevant screening of the pairing matrix elements. To account for LRC in our infinite matter calculations, we screen the effective interaction using FLT as a starting point. Following Refs.~\\cite{Shen2003,Cao2006,Dong2013}, we dress the interaction with successive particle-hole excitations. These are coupled to the paired nucleons by vertices that are self-consistently determined using the concept of the induced interaction~\\cite{babu1973}. Collective modes on top of this are described using Fermi liquid theory, with Landau parameters obtained from Ref.~\\cite{Cao2006}. As a general conclusion, we find that the effect of LRC on triplet pairing gaps is smaller than that of SRC. \n\nThis paper is organized as follows. Section \\ref{sec:method} provides an overview of the method, with specific subsections devoted to the discussion of our treatment of SRC, temperature extrapolations and LRC. Results are summarized in Sec.~\\ref{sec:results}. Singlet pairing gaps are discussed in subsection~\\ref{sec:results1S0} and triplet gaps, in subsection~\\ref{sec:results3PF2}. We draw conclusions and provide an outlook of potential future work in Sec.~\\ref{sec:conclusions}. The appendices provide a discussion of numerical aspects related to zero-temperature extrapolations and fits.\n\n\n\n\\section{Methods}\n\\label{sec:method}\n\n\n\n\\subsection{Short-range correlations}\n\\label{sec:SRC}\n\nIn the following, we describe a method to include SRC into the pairing properties of dense nuclear matter. More specifically, we look at the inclusion of fragmented sp states into the gap equation. Technically, our method is founded in the Gorkov-Green's functions theory for the description of condensed fermionic systems~\\cite{Abrikosov1965,Dickhoff08,Soma2011}. A diagrammatic expansion in terms of self-consistent propagators exists in this case, and involves, in addition to the usual Green's functions, anomalous propagators as well. We do not provide details on the derivations of the equations here: they have been presented elsewhere in the nuclear physics literature~\\cite{Bozek2000,Muther2005,Dickhoff08}. We also note that similar approaches exist in condensed matter, particularly in the context of the BCS-BEC crossover \\cite{Haussmann2007}. In that field, our approach is reminiscent to the FLEX scheme~\\cite{Chen2005}. \n\nA specific formulation of Gorkov's theory allows for the resummation of correlations on the normal component of the propagator using the normal Dyson equation~\\cite{Pines1962,Migdal1967,Muther2005,Dickhoff08}. This is particularly useful for strongly correlated nuclear systems, in which there is already a substantial fragmentation in the normal state sp propagator, $G^N$. Below the critical temperature, the Gorkov formalism couples the full superfluid sp propagator, $G$, to its normal component via an anomalous self-energy,\n\n", "index": 1, "text": "\\begin{align}\nG(k, \\omega) &= G^N(k, \\omega) - G^N(k, \\omega) \\Delta(k, \\omega) G(k, \\omega) \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle G(k,\\omega)\" display=\"inline\"><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=G^{N}(k,\\omega)-G^{N}(k,\\omega)\\Delta(k,\\omega)G(k,\\omega)\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><msup><mi>G</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msup><mi>G</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nIn the lowest order diagrammatic approximation, $\\Delta$ is an energy-independent quantity. We note, however, that this formulation goes beyond the BCS approach in that the fragmentation of states at the normal level is described in terms of a fully dressed sp normal propagator, $G^N$.\n\nWorking in a partial wave basis, and after a suitable angle-average procedure has been considered, the expression for the lowest-order dressed anomalous self-energy leads to the generalized gap equation,\n\n", "itemtype": "equation", "pos": 15289, "prevtext": "\nIn turn, the anomalous propagator, $F$, and self-energy (or superfluid gap), $\\Delta$, are related to both the normal and the full propagators:\n\n", "index": 3, "text": "\\begin{align}\nF(k, \\omega) &= G^N(-k, -\\omega) G(k, \\omega)  \\Delta(k,\\omega) \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle F(k,\\omega)\" display=\"inline\"><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=G^{N}(-k,-\\omega)G(k,\\omega)\\Delta(k,\\omega)\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><msup><mi>G</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mi>k</mi></mrow><mo>,</mo><mrow><mo>-</mo><mi>ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\n$\\Delta^{JST}_L(k)$ is the pairing gap for a given partial wave, $L$, in the channel of total angular momentum $J$, pair spin $S$ and pair isospin $T$. Pairs are in a BCS-like state of opposite sp momenta, $k_1=-k_2$. The effective pairing interaction, $ \\mathcal{V}_{LL'}$, is therefore a function of relative momentum, $k=k_1$, and we work at zero pair centre-of-mass momentum. In BCS theory, $\\mathcal{V}_{LL'}$ would simply be a bare NN interaction. However, the effect of the medium is important for the pairing interaction, even at very low densities~\\cite{Abrikosov1965,Schulze2001,Dong2013}. We will therefore introduce a description of the screening of $\\mathcal{V}_{LL'}$ with polarization effects in Sec.~\\ref{sec:LRC}. In our nomenclature, the polarization effects in the effective interaction are equivalent to LRC effects. \n\nIn addition to the effective interaction, the kernel of the gap equation is determined by an energy denominator, $\\xi(k)$. In the Gorkov approach, the denominator is the double energy convolution~\\cite{Muther2005}:\n\n", "itemtype": "equation", "pos": 15876, "prevtext": "\nIn the lowest order diagrammatic approximation, $\\Delta$ is an energy-independent quantity. We note, however, that this formulation goes beyond the BCS approach in that the fragmentation of states at the normal level is described in terms of a fully dressed sp normal propagator, $G^N$.\n\nWorking in a partial wave basis, and after a suitable angle-average procedure has been considered, the expression for the lowest-order dressed anomalous self-energy leads to the generalized gap equation,\n\n", "index": 5, "text": "\\begin{align}\n\\Delta^{JST}_{L}(k) = - \\sum_{L'} \\int_0^\\infty \\frac{dk' \\, k'^2}{\\pi} \\frac{ \\langle k | \\mathcal{V}^{JST}_{LL'} | k' \\rangle }{\\xi(k')} \\Delta^{JST}_{L'}(k') \\, .\n\\label{eq:gap}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Delta^{JST}_{L}(k)=-\\sum_{L^{\\prime}}\\int_{0}^{\\infty}\\frac{dk^{%&#10;\\prime}\\,k^{\\prime 2}}{\\pi}\\frac{\\langle k|\\mathcal{V}^{JST}_{LL^{\\prime}}|k^{%&#10;\\prime}\\rangle}{\\xi(k^{\\prime})}\\Delta^{JST}_{L^{\\prime}}(k^{\\prime})\\,.\" display=\"inline\"><mrow><mrow><mrow><msubsup><mi mathvariant=\"normal\">Δ</mi><mi>L</mi><mrow><mi>J</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>T</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msup><mi>L</mi><mo>′</mo></msup></munder></mstyle><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup></mstyle><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>k</mi><mo>′</mo></msup></mpadded><mo>⁢</mo><msup><mi>k</mi><mrow><mi mathsize=\"142%\" mathvariant=\"normal\">′</mi><mo>⁣</mo><mn>2</mn></mrow></msup></mrow><mi>π</mi></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">⟨</mo><mi>k</mi><mo fence=\"true\" stretchy=\"false\">|</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒱</mi><mrow><mi>L</mi><mo>⁢</mo><msup><mi>L</mi><mo>′</mo></msup></mrow><mrow><mi>J</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>T</mi></mrow></msubsup><mo fence=\"true\" stretchy=\"false\">|</mo><msup><mi>k</mi><mo>′</mo></msup><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>k</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Δ</mi><msup><mi>L</mi><mo>′</mo></msup><mrow><mi>J</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>T</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>k</mi><mo>′</mo></msup><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nThe temperature, $T$, is included in the Fermi-Dirac distribution, $f(\\omega)=\\left[ 1+\\exp(\\omega-\\mu)/T) \\right]^{-1}$. The spectral function $A^N(k,\\omega)$ is related to the normal component of the self-energy,\n\n", "itemtype": "equation", "pos": 17137, "prevtext": "\n$\\Delta^{JST}_L(k)$ is the pairing gap for a given partial wave, $L$, in the channel of total angular momentum $J$, pair spin $S$ and pair isospin $T$. Pairs are in a BCS-like state of opposite sp momenta, $k_1=-k_2$. The effective pairing interaction, $ \\mathcal{V}_{LL'}$, is therefore a function of relative momentum, $k=k_1$, and we work at zero pair centre-of-mass momentum. In BCS theory, $\\mathcal{V}_{LL'}$ would simply be a bare NN interaction. However, the effect of the medium is important for the pairing interaction, even at very low densities~\\cite{Abrikosov1965,Schulze2001,Dong2013}. We will therefore introduce a description of the screening of $\\mathcal{V}_{LL'}$ with polarization effects in Sec.~\\ref{sec:LRC}. In our nomenclature, the polarization effects in the effective interaction are equivalent to LRC effects. \n\nIn addition to the effective interaction, the kernel of the gap equation is determined by an energy denominator, $\\xi(k)$. In the Gorkov approach, the denominator is the double energy convolution~\\cite{Muther2005}:\n\n", "index": 7, "text": "\\begin{align}\n\\frac{1}{2 \\xi(k)} = \\int \\frac{d \\omega}{2\\pi} \\frac{d \\omega'}{2\\pi} &A^N (k,\\omega) A (k,\\omega') \\times \\nonumber \\\\\n& \\frac{1-f(\\omega)-f(\\omega')}{\\omega+\\omega'}  \\, .\n\\label{eq:xik}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1}{2\\xi(k)}=\\int\\frac{d\\omega}{2\\pi}\\frac{d\\omega^{\\prime}}%&#10;{2\\pi}\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>=</mo><mstyle displaystyle=\"true\"><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>ω</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>ω</mi><mo>′</mo></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mrow></mrow></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle A^{N}(k,\\omega)A(k,\\omega^{\\prime})\\times\" display=\"inline\"><mrow><msup><mi>A</mi><mi>N</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mi>A</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><msup><mi>ω</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>×</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1-f(\\omega)-f(\\omega^{\\prime})}{\\omega+\\omega^{\\prime}}\\,.\" display=\"inline\"><mrow><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ω</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mi>ω</mi><mo>+</mo><msup><mi>ω</mi><mo>′</mo></msup></mrow></mfrac></mstyle></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nand includes information related to sp fragmentation in the normal phase~\\cite{Dickhoff08,Rios2009}. We work with self-energies that have been obtained within a finite-temperature $\\mathcal{T}-$matrix SCGF approach, discussed in detail in Refs.~\\cite{FrickPhD,RiosPhD,Soma2008}. At temperatures close to the pairing phase transition, $A^N$ develops a characteristic two-peak structure as a function of energy, which is an indication of a pseudo-gap phase~\\cite{Schnell1999}. At and below the critical temperature, the method is not valid anymore, as evidenced by the appearance of the Thouless pole in the $\\mathcal{T}-$matrix~\\cite{Thouless1960,Kadanoff1961,Alm1993}. We therefore obtain the normal spectral function at zero temperature by extrapolating finite temperature results down to zero temperature, as explained in the following subsection. This is in agreement with the physical interpretation of $A^N$ as a normal state spectral function. \n\nIn the lowest-order BCS approach at zero temperature, the spectral functions in the convolution of Eq.~(\\ref{eq:xik}) become delta functions in energy. The normal self-energy has a single peak at the normal quasi-particle energy, whereas the superfluid spectral function shows two unequally weighted solutions for a given momentum~\\cite{Bozek2000,Muther2005}. The energy denominator becomes a function of momentum, \n\n", "itemtype": "equation", "pos": 17568, "prevtext": "\nThe temperature, $T$, is included in the Fermi-Dirac distribution, $f(\\omega)=\\left[ 1+\\exp(\\omega-\\mu)/T) \\right]^{-1}$. The spectral function $A^N(k,\\omega)$ is related to the normal component of the self-energy,\n\n", "index": 9, "text": "\\begin{align}\nA^N(k,\\omega) = \\frac{-2 \\text{Im} \\Sigma^N(k,\\omega)}\n{ \\left[ \\omega - \\frac{k^2}{2m} - \\text{Re} \\Sigma^N(k,\\omega) \\right]^2 + \\text{Im} \\Sigma^N(k,\\omega)^2 } \\, ,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A^{N}(k,\\omega)=\\frac{-2\\text{Im}\\Sigma^{N}(k,\\omega)}{\\left[%&#10;\\omega-\\frac{k^{2}}{2m}-\\text{Re}\\Sigma^{N}(k,\\omega)\\right]^{2}+\\text{Im}%&#10;\\Sigma^{N}(k,\\omega)^{2}}\\,,\" display=\"inline\"><mrow><mrow><mrow><msup><mi>A</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mtext>Im</mtext><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msup><mrow><mo>[</mo><mrow><mi>ω</mi><mo>-</mo><mfrac><msup><mi>k</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></mfrac><mo>-</mo><mrow><mtext>Re</mtext><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup><mo>+</mo><mrow><mtext>Im</mtext><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mi>N</mi></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nwith the effective sp energy, \n\n", "itemtype": "equation", "pos": 19131, "prevtext": "\nand includes information related to sp fragmentation in the normal phase~\\cite{Dickhoff08,Rios2009}. We work with self-energies that have been obtained within a finite-temperature $\\mathcal{T}-$matrix SCGF approach, discussed in detail in Refs.~\\cite{FrickPhD,RiosPhD,Soma2008}. At temperatures close to the pairing phase transition, $A^N$ develops a characteristic two-peak structure as a function of energy, which is an indication of a pseudo-gap phase~\\cite{Schnell1999}. At and below the critical temperature, the method is not valid anymore, as evidenced by the appearance of the Thouless pole in the $\\mathcal{T}-$matrix~\\cite{Thouless1960,Kadanoff1961,Alm1993}. We therefore obtain the normal spectral function at zero temperature by extrapolating finite temperature results down to zero temperature, as explained in the following subsection. This is in agreement with the physical interpretation of $A^N$ as a normal state spectral function. \n\nIn the lowest-order BCS approach at zero temperature, the spectral functions in the convolution of Eq.~(\\ref{eq:xik}) become delta functions in energy. The normal self-energy has a single peak at the normal quasi-particle energy, whereas the superfluid spectral function shows two unequally weighted solutions for a given momentum~\\cite{Bozek2000,Muther2005}. The energy denominator becomes a function of momentum, \n\n", "index": 11, "text": "\\begin{align}\n\\xi(k) = | E(k) |\n\\label{eq:xie}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\xi(k)=|E(k)|\" display=\"inline\"><mrow><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": " \nTo obtain this result, we have also assumed that there is no renormalisation of the sp peaks, $\\mathcal{Z}(k)\\approx1$. In a low-density BCS approximation, the effective sp energy corresponds to a kinetic spectrum, $\\chi(k) = \\frac{k^2}{2m} - \\mu$, with $\\mu$ the chemical potential of the system. One can also add a mean-field potential contribution to the spectrum, or describe its effect by means of an effective mass~\\cite{Abrikosov1965,Dickhoff08}. The averaged gap, $\\overline \\Delta$ is associated with the partial wave that is active for a given Fermi momentum. In practice, different partial waves are active in different regions of Fermi momentum. Consequently, we consider  $\\overline \\Delta(k) \\approx \\Delta^{JST}_{L}(k)$ in the solution of the gap equation in a given $JST$ channel~\\cite{Dean2003}. For coupled channels, we take \n$\\overline \\Delta^2(k) = \\left( \\Delta^{JST}_{L} (k) \\right)^2 + \\left( \\Delta^{JST}_{L'} (k) \\right)^2 $.\n\nThe gap equation is an integral non-linear equation for $\\Delta^{JST}_{L}(k)$, which appears explicitly in the denominator via Eq.~(\\ref{eq:edk2}). In the fully correlated theory, in contrast, the gap appears indirectly in the definition of the superfluid spectral function,\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwith the effective sp energy, \n\n", "index": 13, "text": "\\begin{align}\nE^2(k)= \\chi^2(k) + \\overline \\Delta^2(k) \\, .\n\\label{eq:edk2}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle E^{2}(k)=\\chi^{2}(k)+\\overline{\\Delta}^{2}(k)\\,.\" display=\"inline\"><mrow><mrow><mrow><msup><mi>E</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msup><mover accent=\"true\"><mi mathvariant=\"normal\">Δ</mi><mo>¯</mo></mover><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nThe full sp propagator, $G(k,\\omega)$, computed in the superfluid phase, differs from the normal one by a factor that is proportional to the square of the gap,\n\n", "itemtype": "equation", "pos": 20538, "prevtext": " \nTo obtain this result, we have also assumed that there is no renormalisation of the sp peaks, $\\mathcal{Z}(k)\\approx1$. In a low-density BCS approximation, the effective sp energy corresponds to a kinetic spectrum, $\\chi(k) = \\frac{k^2}{2m} - \\mu$, with $\\mu$ the chemical potential of the system. One can also add a mean-field potential contribution to the spectrum, or describe its effect by means of an effective mass~\\cite{Abrikosov1965,Dickhoff08}. The averaged gap, $\\overline \\Delta$ is associated with the partial wave that is active for a given Fermi momentum. In practice, different partial waves are active in different regions of Fermi momentum. Consequently, we consider  $\\overline \\Delta(k) \\approx \\Delta^{JST}_{L}(k)$ in the solution of the gap equation in a given $JST$ channel~\\cite{Dean2003}. For coupled channels, we take \n$\\overline \\Delta^2(k) = \\left( \\Delta^{JST}_{L} (k) \\right)^2 + \\left( \\Delta^{JST}_{L'} (k) \\right)^2 $.\n\nThe gap equation is an integral non-linear equation for $\\Delta^{JST}_{L}(k)$, which appears explicitly in the denominator via Eq.~(\\ref{eq:edk2}). In the fully correlated theory, in contrast, the gap appears indirectly in the definition of the superfluid spectral function,\n\n", "index": 15, "text": "\\begin{align}\nA(k,\\omega) &= -2 \\text{Im} G(k,\\omega) \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A(k,\\omega)\" display=\"inline\"><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=-2\\text{Im}G(k,\\omega)\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mtext>Im</mtext><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": " \nConsequently, $A^N$ and $A$ only differ from each other close to the Fermi momentum and energy, where pairing effects are more prominent \\cite{Bozek1999,Muther2005}. \n\nA fully self-consistent description of pairing requires an explicit iterative calculation of both $A^N$ and $A$~\\cite{Bozek1999}. Here, we take a different approach, an initial step towards a full self-consistent solution that includes all the relevant correlations. First, because the two spectral functions are very similar in a wide energy and momentum domain, we compute the contribution to the effective denominator from the double convolution of \\emph{normal} spectral functions, \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nThe full sp propagator, $G(k,\\omega)$, computed in the superfluid phase, differs from the normal one by a factor that is proportional to the square of the gap,\n\n", "index": 17, "text": "\\begin{align}\nG(k,\\omega) &= G^N(k,\\omega) \\left [ 1 -G^N(-k,-\\omega) \\Delta^2(k,\\omega) G(k,\\omega)\\right] \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle G(k,\\omega)\" display=\"inline\"><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=G^{N}(k,\\omega)\\left[1-G^{N}(-k,-\\omega)\\Delta^{2}(k,\\omega)G(k,%&#10;\\omega)\\right]\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><msup><mi>G</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><msup><mi>G</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mi>k</mi></mrow><mo>,</mo><mrow><mo>-</mo><mi>ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nThis will account explicitly for fragmentation effects on the gap equation. The superfluid gap is then generated by the gap equation, Eq.~(\\ref{eq:gap}), with an energy denominator that has the same structure as in the BCS expression, Eqs.~(\\ref{eq:xie}) and (\\ref{eq:edk2}). One can indeed generate a superfluid spectral function from the resulting gap, see e.g. Ref.~\\cite{Muther2005}.\nFurther calculations of the normal self-energy then in principle require the effect of the gap to be included in the normal propagators~\\cite{Bozek1999}. We expect such feedback effects from the superfluid phase to be small in comparison to the relatively large fragmentation of strength associated with SRC which is captured effectively by Eq.~(\\ref{eq:chi}).\n\nThis approach was first exploited in Ref.~\\cite{Muther2005} to study the singlet pairing properties of neutron matter  and triplet pairing in symmetric nuclear matter. A major conclusion of that study was the large impact of sp fragmentation on pairing properties. Gaps in infinite matter are substantially quenched by the removal of strength mediated by SRC, generally by a factor of $\\approx 20 \\, \\%$. In nuclear matter, the SRC effect alone precludes the formation of a $^3$SD$_1$ pairing gap in nuclear matter at saturation density. This provides support for the lack of experimental evidence of isoscalar $np$ pairing from an infinite-matter calculation. \n\nFinally, we would like to comment on quasi-particle approximations to the pairing problem. In a quasi-particle limit, the spectral functions in Eq.~(\\ref{eq:xik}) and Eq.~(\\ref{eq:chi}) are replaced by delta functions centered around quasi-particle energies. In both the normal and the superfluid case, these are weighted by the corresponding renormalizations of the quasi-particle poles, or $\\mathcal{Z}$-factors \\cite{Baldo2000,Bozek2000,Dong2015}. These will effectively account for a removal of strength in different regions of momentum space, including the Fermi surface. In general, one finds that the quasi-particle energy denominator of Eq.~(\\ref{eq:xie}) is divided by a factor $Z^2(k)$. These quasi-particle approximations, however, include fragmentation in a very crude way and cannot reliably predict the effect of quenching due to SRC obtained with realistic spectral functions in the double convolution of Eq.~(\\ref{eq:chi}) \\cite{Muther2005}. \n\n\\subsection{Zero temperature extrapolation}\n\\label{sec:T0}\n\nThe normal spectral function at zero temperature, $A^N(k,\\omega)$, has been computed as an extrapolation of finite temperature self-energies. Numerical results of SCGF ladder approximation self-energies with microscopic NN interactions have been available in the literature for the last decade~\\cite{Frick2003,RiosPhD,Soma2008}. The pairing instability, however, precludes a direct calculation within the ladder approximation and normal propagators below the critical pairing temperature, $T_c$~\\cite{Alm1993,Muther2005}. Consequently, for a fixed density, we perform a series of  finite temperature calculations to determine the real and imaginary parts of the self-energy, and use these as input for an extrapolation to zero temperature. The fit is further constrained by the requirement that the macroscopic properties that are computed at $T=0$ provide a thermodynamically consistent description of the system. Numerical details are provided in Appendix~\\ref{app:T0}. Below, we discuss the properties of the extrapolated self-energies. \n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{self_CDBONN_008.pdf}\n\\caption{\\label{fig:self}(Color online) Imaginary part of the self-energy around the Fermi energy at $k_F=1.33$ fm$^{-1}$ for the CDBonn interaction for several temperatures. Panels (a), (b) and (c) correspond to momenta $k=0$, $k_F$ and $2k_F$, respectively. The $T=0$ extrapolation is shown in a solid line. Note the different vertical scales of each panel. }\n\\end{center}\n\\end{figure}\n\nThe three panels of Fig.~\\ref{fig:self} show the imaginary part of the self-energy as a function of energy, $\\omega$, for three characteristic momenta. Panels (a) and (c) show self-energies well below and above the Fermi momentum, respectively. Panel (b), in contrast, shows the $k=k_F$ case. Results are displayed for the CDBonn interaction at $k_F=1.33$ fm$^{-1}$, but equivalent conclusions are found with other NN interactions in this density regime. At large temperatures, there is little (or no) distinction between the hole, $\\omega < \\mu$, and the particle $\\omega>\\mu$, parts of $\\text{Im}\\Sigma$. As temperature decreases, however, a structure develops close to $\\omega \\approx \\mu$, with $\\text{Im}\\Sigma$ approaching zero in absolute value. This is the area where temperature plays the most important role, and where the extrapolation procedure is most critical. A momentum- and energy-dependent polynomial fit, described in Appendix~\\ref{app:T0}, captures this temperature dependence, and provides an extrapolated self-energy which provides consistent results.\n\nFrom the self-energy, one can obtain other relevant microscopic properties. Panel (a) in Fig.~\\ref{fig:mom_chi} shows an example of the temperature extrapolation of the momentum distribution. Again, while this specific example is for the CDBonn interaction at $k_F=1.33$ fm$^{-1}$, very similar results are obtained with other forces in a wide density regime. As temperature decreases, one finds the expected behavior for the correlated momentum distribution: the Fermi surface becomes increasingly sharp, and low and high-momentum features build up. As expected, the zero temperature $n(k)$ has a sharp discontinuity across the Fermi surface. The exact shape of the momentum distribution for momenta within a few percent of $k_F$ is sensitive to the extrapolation procedure, particularly to the order of the extrapolating polynomial. However, the implementation of the thermodynamically consistent extrapolation procedure guarantees that, on average, the discontinuity of the Fermi surface is within a few percent of the derivative of the self-energy (i.e. the $\\mathcal{Z}$-factor at $k=k_F$). We note that we have corrected the momentum distribution for missing strength effects, as discussed in Appendix~\\ref{app:T0}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{momchi_CDBONN_008.pdf}\n\\caption{\\label{fig:mom_chi}(Color online) Panel (a): momentum distribution at $k_F=1.33$ fm$^{-1}$ for the CDBonn interaction at different temperatures, including the $T=0$ extrapolation (solid line). Panel (b): effective sp denominator, $\\chi(k)$, in the same conditions.}\n\\end{center}\n\\end{figure}\n\n\\subsection{Pairing kernel with short range correlations}\n\\label{subsec:gap}\nPairing calculations require as input the double energy convolution of Eq.~(\\ref{eq:chi}). This convolution is formally equivalent to the dressed but non-interacting two-body propagator, $\\mathcal{G}_{II}^0$, in the in-medium $\\mathcal{T}-$matrix equation at zero energy and centre-of-mass momentum~\\cite{FrickPhD,Frick2003,Dickhoff08}. This is in correspondence to the well-known fact that Cooper pairing appears as a pole in the normal $\\mathcal{T}-$matrix in these conditions. The experience gathered in performing the double convolution in SCGF finite temperature calculations is useful in computing the energy denominator~\\cite{FrickPhD}. In particular, it is useful to keep track of the quasi-particle energies for each given sp momentum, so that the quasi-particle peak is well sampled in the double folding integrals~\\cite{RiosPhD}.\n\nPairing calculations, particularly in the $^3$PF$_2$ channel, are very sensitive to the Fermi surface region, and inaccuracies on the double folding are amplified in final gap solutions. In particular, missing strength corrections, analogous to those discussed for $n(k)$ in Appendix~\\ref{app:T0}, are essential to compute a continuous energy denominator in regions arbitrarily close to $k_F$. Panel (b) of Fig.~\\ref{fig:mom_chi} shows the energy denominators for a CDBonn calculation at $k_F=1.33$ fm$^{-1}$ as a function of momenta for a variety of temperatures. Here, as it was the case with $n(k)$, the largest modifications due to temperature occur close to $k_F$. The low and the high momentum ends of $\\chi(k)$ are less sensitive to temperature, and their details are well captured by finite temperature calculations. In contrast, the region around $k=k_F$ shows a non-negligible temperature dependence even in the lowest temperatures. In the quasi-particle approximation, the Sommerfeld expansions predicts a linear temperature dependence of the denominator in regions close to $k_F$. Panel (b) shows that a similar linear temperature dependence is generated in that region. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{chi_den_NN.pdf}\n\\caption{\\label{fig:chi_den}(Color online) Panels (a)-(c): energy denominator at $T=0$ as a function of momentum for different Fermi momenta, corresponding to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Panels (d)-(f): the same function, around the Fermi surface, plotted in a logarithmic scale. See text for details. }\n\\end{center}\n\\end{figure}\n\nThe density dependence of the zero-temperature double convolution is displayed in panels (a) to (c) of Fig.~\\ref{fig:chi_den}. Each panel represents the results obtained with a different NN interaction: (a) CDBonn \\cite{Machleidt1995}, (b) Av18 \\cite{Wiringa1995} and (c) the Entem-Machleidt N3LO potential \\cite{Entem2003}. We note that the different NN interactions enter the denominator calculation via the convolution of different extrapolated spectral functions. The spectral functions of these three interactions are relatively dissimilar \\cite{Rios2009}, but the integrated convolution smears out the differences to a certain extent. Consequently, the results obtained for $\\chi(k)$ (and its density dependence) are relatively close for all the NN forces. \n\nIn general, we find that the double convolution denominator increases with density. This density dependence occurs at all momenta, including the near vicinity of the Fermi surface that is displayed, in a logarithmic scale, in panels (d) to (f) of Fig.~\\ref{fig:chi_den}. The gap equation is mostly determined by the energy denominator close to the Fermi surface, and hence it is important that this region is well sampled for pairing purposes. The denominator shows a linear behavior both below and above $k_F$, with a sharp minimum at the Fermi surface. The value of $\\chi(k)$ at the Fermi surface, $k=k_F$, is relatively small, but non-zero. While the linear behavior is expected in a quasi-particle-type approach, the non-zero minimum is a direct consequence of the use of a double convolution beyond a quasi-particle picture. We note that, without the missing strength corrections discussed in Appendix \\ref{app:T0}, the near-Fermi-surface behavior would be erratic. The corrected calculations, in contrast, provide a well-defined function of both momentum and density. \n\nIn the quasi-particle limit of Eq.~(\\ref{eq:xie}), the denominator reflects the momentum and density dependence of the quasi-particle energy with respect to the chemical potential. We show the extrapolated zero-temperature quasi-particle denominator in Fig.~\\ref{fig:qp_den}, in the same conditions and for the same NN forces as Fig.~\\ref{fig:chi_den}. The quasi-particle energies are determined consistently by solving the corresponding implicit equation for the SCGF ladder self-energies,\n\n", "itemtype": "equation", "pos": 21550, "prevtext": " \nConsequently, $A^N$ and $A$ only differ from each other close to the Fermi momentum and energy, where pairing effects are more prominent \\cite{Bozek1999,Muther2005}. \n\nA fully self-consistent description of pairing requires an explicit iterative calculation of both $A^N$ and $A$~\\cite{Bozek1999}. Here, we take a different approach, an initial step towards a full self-consistent solution that includes all the relevant correlations. First, because the two spectral functions are very similar in a wide energy and momentum domain, we compute the contribution to the effective denominator from the double convolution of \\emph{normal} spectral functions, \n\n", "index": 19, "text": "\\begin{align}\n\\frac{1}{2 \\chi(k)} = \\int \\frac{d \\omega}{2\\pi} \\frac{d \\omega'}{2\\pi} &A^N (k,\\omega) A^N (k,\\omega') \\times \\nonumber \\\\\n& \\frac{1-f(\\omega)-f(\\omega')}{\\omega+\\omega'}  \\, .\n\\label{eq:chi}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1}{2\\chi(k)}=\\int\\frac{d\\omega}{2\\pi}\\frac{d\\omega^{\\prime}%&#10;}{2\\pi}\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>=</mo><mstyle displaystyle=\"true\"><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>ω</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>ω</mi><mo>′</mo></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mrow></mrow></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle A^{N}(k,\\omega)A^{N}(k,\\omega^{\\prime})\\times\" display=\"inline\"><mrow><msup><mi>A</mi><mi>N</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><msup><mi>A</mi><mi>N</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><msup><mi>ω</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>×</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1-f(\\omega)-f(\\omega^{\\prime})}{\\omega+\\omega^{\\prime}}\\,.\" display=\"inline\"><mrow><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ω</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mi>ω</mi><mo>+</mo><msup><mi>ω</mi><mo>′</mo></msup></mrow></mfrac></mstyle></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nand subtracting the chemical potential. \n\nThe quasi-particle picture provides an intuitive understanding for the density dependence of the energy denominator. Broadly speaking, the quasi-particle spectrum is more stretched as density increases. A sign notwithstanding, this gives rise to an increase of the denominator as density rises at low momenta. In turn, when measured with respect to the Fermi momentum, the high-momentum quasi-particle energies become more repulsive as density increases, which gives rise to the $k>k_F$ behavior.\n\nTwo important conclusions can be drawn from a comparison of Figs.~\\ref{fig:chi_den} and \\ref{fig:qp_den}. On the one hand, the qualitative density and momentum dependence of the quasi-particle and the double convolution denominators are similar. In particular, both are increasing functions of density. As functions of momenta, the initial decrease below $k_F$ is followed by an increase above the Fermi surface. Furthermore, a linear behavior is found near the Fermi surface in both cases, as expected on general grounds. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.56\\linewidth]{qp_den_NN.pdf}\n\\caption{\\label{fig:qp_den}(Color online) Panels (a)-(c): energy denominator at $T=0$ in the quasi-particle limit as a function of momentum for different Fermi momenta, corresponding to the (a) CDBonn, (b) Av18 and (c) N3LO interactions.}\n\\end{center}\n\\end{figure}\n\nOn the other hand, there are quantitative differences between both denominators. The double convolution takes into account the fragmentation of quasi-particle states in the normal state. Since strength is removed from the full quasi-particle peak, the denominator becomes larger than the corresponding quasi-particle value. As a matter of fact, the difference between the two results can be parametrized in terms of an effective $\\mathcal{Z}-$factor  \\cite{Bozek2000,Muther2005},\n\n", "itemtype": "equation", "pos": 33280, "prevtext": "\nThis will account explicitly for fragmentation effects on the gap equation. The superfluid gap is then generated by the gap equation, Eq.~(\\ref{eq:gap}), with an energy denominator that has the same structure as in the BCS expression, Eqs.~(\\ref{eq:xie}) and (\\ref{eq:edk2}). One can indeed generate a superfluid spectral function from the resulting gap, see e.g. Ref.~\\cite{Muther2005}.\nFurther calculations of the normal self-energy then in principle require the effect of the gap to be included in the normal propagators~\\cite{Bozek1999}. We expect such feedback effects from the superfluid phase to be small in comparison to the relatively large fragmentation of strength associated with SRC which is captured effectively by Eq.~(\\ref{eq:chi}).\n\nThis approach was first exploited in Ref.~\\cite{Muther2005} to study the singlet pairing properties of neutron matter  and triplet pairing in symmetric nuclear matter. A major conclusion of that study was the large impact of sp fragmentation on pairing properties. Gaps in infinite matter are substantially quenched by the removal of strength mediated by SRC, generally by a factor of $\\approx 20 \\, \\%$. In nuclear matter, the SRC effect alone precludes the formation of a $^3$SD$_1$ pairing gap in nuclear matter at saturation density. This provides support for the lack of experimental evidence of isoscalar $np$ pairing from an infinite-matter calculation. \n\nFinally, we would like to comment on quasi-particle approximations to the pairing problem. In a quasi-particle limit, the spectral functions in Eq.~(\\ref{eq:xik}) and Eq.~(\\ref{eq:chi}) are replaced by delta functions centered around quasi-particle energies. In both the normal and the superfluid case, these are weighted by the corresponding renormalizations of the quasi-particle poles, or $\\mathcal{Z}$-factors \\cite{Baldo2000,Bozek2000,Dong2015}. These will effectively account for a removal of strength in different regions of momentum space, including the Fermi surface. In general, one finds that the quasi-particle energy denominator of Eq.~(\\ref{eq:xie}) is divided by a factor $Z^2(k)$. These quasi-particle approximations, however, include fragmentation in a very crude way and cannot reliably predict the effect of quenching due to SRC obtained with realistic spectral functions in the double convolution of Eq.~(\\ref{eq:chi}) \\cite{Muther2005}. \n\n\\subsection{Zero temperature extrapolation}\n\\label{sec:T0}\n\nThe normal spectral function at zero temperature, $A^N(k,\\omega)$, has been computed as an extrapolation of finite temperature self-energies. Numerical results of SCGF ladder approximation self-energies with microscopic NN interactions have been available in the literature for the last decade~\\cite{Frick2003,RiosPhD,Soma2008}. The pairing instability, however, precludes a direct calculation within the ladder approximation and normal propagators below the critical pairing temperature, $T_c$~\\cite{Alm1993,Muther2005}. Consequently, for a fixed density, we perform a series of  finite temperature calculations to determine the real and imaginary parts of the self-energy, and use these as input for an extrapolation to zero temperature. The fit is further constrained by the requirement that the macroscopic properties that are computed at $T=0$ provide a thermodynamically consistent description of the system. Numerical details are provided in Appendix~\\ref{app:T0}. Below, we discuss the properties of the extrapolated self-energies. \n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{self_CDBONN_008.pdf}\n\\caption{\\label{fig:self}(Color online) Imaginary part of the self-energy around the Fermi energy at $k_F=1.33$ fm$^{-1}$ for the CDBonn interaction for several temperatures. Panels (a), (b) and (c) correspond to momenta $k=0$, $k_F$ and $2k_F$, respectively. The $T=0$ extrapolation is shown in a solid line. Note the different vertical scales of each panel. }\n\\end{center}\n\\end{figure}\n\nThe three panels of Fig.~\\ref{fig:self} show the imaginary part of the self-energy as a function of energy, $\\omega$, for three characteristic momenta. Panels (a) and (c) show self-energies well below and above the Fermi momentum, respectively. Panel (b), in contrast, shows the $k=k_F$ case. Results are displayed for the CDBonn interaction at $k_F=1.33$ fm$^{-1}$, but equivalent conclusions are found with other NN interactions in this density regime. At large temperatures, there is little (or no) distinction between the hole, $\\omega < \\mu$, and the particle $\\omega>\\mu$, parts of $\\text{Im}\\Sigma$. As temperature decreases, however, a structure develops close to $\\omega \\approx \\mu$, with $\\text{Im}\\Sigma$ approaching zero in absolute value. This is the area where temperature plays the most important role, and where the extrapolation procedure is most critical. A momentum- and energy-dependent polynomial fit, described in Appendix~\\ref{app:T0}, captures this temperature dependence, and provides an extrapolated self-energy which provides consistent results.\n\nFrom the self-energy, one can obtain other relevant microscopic properties. Panel (a) in Fig.~\\ref{fig:mom_chi} shows an example of the temperature extrapolation of the momentum distribution. Again, while this specific example is for the CDBonn interaction at $k_F=1.33$ fm$^{-1}$, very similar results are obtained with other forces in a wide density regime. As temperature decreases, one finds the expected behavior for the correlated momentum distribution: the Fermi surface becomes increasingly sharp, and low and high-momentum features build up. As expected, the zero temperature $n(k)$ has a sharp discontinuity across the Fermi surface. The exact shape of the momentum distribution for momenta within a few percent of $k_F$ is sensitive to the extrapolation procedure, particularly to the order of the extrapolating polynomial. However, the implementation of the thermodynamically consistent extrapolation procedure guarantees that, on average, the discontinuity of the Fermi surface is within a few percent of the derivative of the self-energy (i.e. the $\\mathcal{Z}$-factor at $k=k_F$). We note that we have corrected the momentum distribution for missing strength effects, as discussed in Appendix~\\ref{app:T0}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{momchi_CDBONN_008.pdf}\n\\caption{\\label{fig:mom_chi}(Color online) Panel (a): momentum distribution at $k_F=1.33$ fm$^{-1}$ for the CDBonn interaction at different temperatures, including the $T=0$ extrapolation (solid line). Panel (b): effective sp denominator, $\\chi(k)$, in the same conditions.}\n\\end{center}\n\\end{figure}\n\n\\subsection{Pairing kernel with short range correlations}\n\\label{subsec:gap}\nPairing calculations require as input the double energy convolution of Eq.~(\\ref{eq:chi}). This convolution is formally equivalent to the dressed but non-interacting two-body propagator, $\\mathcal{G}_{II}^0$, in the in-medium $\\mathcal{T}-$matrix equation at zero energy and centre-of-mass momentum~\\cite{FrickPhD,Frick2003,Dickhoff08}. This is in correspondence to the well-known fact that Cooper pairing appears as a pole in the normal $\\mathcal{T}-$matrix in these conditions. The experience gathered in performing the double convolution in SCGF finite temperature calculations is useful in computing the energy denominator~\\cite{FrickPhD}. In particular, it is useful to keep track of the quasi-particle energies for each given sp momentum, so that the quasi-particle peak is well sampled in the double folding integrals~\\cite{RiosPhD}.\n\nPairing calculations, particularly in the $^3$PF$_2$ channel, are very sensitive to the Fermi surface region, and inaccuracies on the double folding are amplified in final gap solutions. In particular, missing strength corrections, analogous to those discussed for $n(k)$ in Appendix~\\ref{app:T0}, are essential to compute a continuous energy denominator in regions arbitrarily close to $k_F$. Panel (b) of Fig.~\\ref{fig:mom_chi} shows the energy denominators for a CDBonn calculation at $k_F=1.33$ fm$^{-1}$ as a function of momenta for a variety of temperatures. Here, as it was the case with $n(k)$, the largest modifications due to temperature occur close to $k_F$. The low and the high momentum ends of $\\chi(k)$ are less sensitive to temperature, and their details are well captured by finite temperature calculations. In contrast, the region around $k=k_F$ shows a non-negligible temperature dependence even in the lowest temperatures. In the quasi-particle approximation, the Sommerfeld expansions predicts a linear temperature dependence of the denominator in regions close to $k_F$. Panel (b) shows that a similar linear temperature dependence is generated in that region. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{chi_den_NN.pdf}\n\\caption{\\label{fig:chi_den}(Color online) Panels (a)-(c): energy denominator at $T=0$ as a function of momentum for different Fermi momenta, corresponding to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Panels (d)-(f): the same function, around the Fermi surface, plotted in a logarithmic scale. See text for details. }\n\\end{center}\n\\end{figure}\n\nThe density dependence of the zero-temperature double convolution is displayed in panels (a) to (c) of Fig.~\\ref{fig:chi_den}. Each panel represents the results obtained with a different NN interaction: (a) CDBonn \\cite{Machleidt1995}, (b) Av18 \\cite{Wiringa1995} and (c) the Entem-Machleidt N3LO potential \\cite{Entem2003}. We note that the different NN interactions enter the denominator calculation via the convolution of different extrapolated spectral functions. The spectral functions of these three interactions are relatively dissimilar \\cite{Rios2009}, but the integrated convolution smears out the differences to a certain extent. Consequently, the results obtained for $\\chi(k)$ (and its density dependence) are relatively close for all the NN forces. \n\nIn general, we find that the double convolution denominator increases with density. This density dependence occurs at all momenta, including the near vicinity of the Fermi surface that is displayed, in a logarithmic scale, in panels (d) to (f) of Fig.~\\ref{fig:chi_den}. The gap equation is mostly determined by the energy denominator close to the Fermi surface, and hence it is important that this region is well sampled for pairing purposes. The denominator shows a linear behavior both below and above $k_F$, with a sharp minimum at the Fermi surface. The value of $\\chi(k)$ at the Fermi surface, $k=k_F$, is relatively small, but non-zero. While the linear behavior is expected in a quasi-particle-type approach, the non-zero minimum is a direct consequence of the use of a double convolution beyond a quasi-particle picture. We note that, without the missing strength corrections discussed in Appendix \\ref{app:T0}, the near-Fermi-surface behavior would be erratic. The corrected calculations, in contrast, provide a well-defined function of both momentum and density. \n\nIn the quasi-particle limit of Eq.~(\\ref{eq:xie}), the denominator reflects the momentum and density dependence of the quasi-particle energy with respect to the chemical potential. We show the extrapolated zero-temperature quasi-particle denominator in Fig.~\\ref{fig:qp_den}, in the same conditions and for the same NN forces as Fig.~\\ref{fig:chi_den}. The quasi-particle energies are determined consistently by solving the corresponding implicit equation for the SCGF ladder self-energies,\n\n", "index": 21, "text": "\\begin{align}\n\\varepsilon_\\text{qp}(k) = \\frac{ k^2 }{2m} + \\text{Re} \\Sigma^N(k,\\varepsilon_\\text{qp}(k) ) \\, ,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\varepsilon_{\\text{qp}}(k)=\\frac{k^{2}}{2m}+\\text{Re}\\Sigma^{N}(k%&#10;,\\varepsilon_{\\text{qp}}(k))\\,,\" display=\"inline\"><mrow><mrow><mrow><msub><mi>ε</mi><mtext>qp</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><msup><mi>k</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></mfrac></mstyle><mo>+</mo><mrow><mtext>Re</mtext><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mi>N</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mrow><msub><mi>ε</mi><mtext>qp</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nThe ratio is displayed, for a subset of relevant densities and three NN forces, in panels (a)-(c) of Fig.~\\ref{fig:zfacden}. $Z_\\text{eff}$ is always in the range $\\approx 0.8-0.9$, and shows a mild momentum dependence, with a minimum close to the Fermi surface. Our results suggest that the ratio decreases slowly with density. This is in accordance to an intuitive picture, where correlations, measured as a deviation from one in $Z_\\text{eff}$, become more important at higher densities. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{zfacdenNN.pdf}\n\\caption{\\label{fig:zfacden}(Color online) Panels (a)-(c): ratio of denominators, Eq.~(\\ref{eq:ratio}) at $T=0$ as a function of momentum for different Fermi momenta. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Panels (d)-(f): the actual $Z$-factor as a function of momentum in the same conditions. See text for details. }\n\\end{center}\n\\end{figure}\n\nIt is important to stress that the effective denominator ratio, $Z_\\text{eff}$, is different from the standard renormalization factor, \n\n", "itemtype": "equation", "pos": 35300, "prevtext": "\nand subtracting the chemical potential. \n\nThe quasi-particle picture provides an intuitive understanding for the density dependence of the energy denominator. Broadly speaking, the quasi-particle spectrum is more stretched as density increases. A sign notwithstanding, this gives rise to an increase of the denominator as density rises at low momenta. In turn, when measured with respect to the Fermi momentum, the high-momentum quasi-particle energies become more repulsive as density increases, which gives rise to the $k>k_F$ behavior.\n\nTwo important conclusions can be drawn from a comparison of Figs.~\\ref{fig:chi_den} and \\ref{fig:qp_den}. On the one hand, the qualitative density and momentum dependence of the quasi-particle and the double convolution denominators are similar. In particular, both are increasing functions of density. As functions of momenta, the initial decrease below $k_F$ is followed by an increase above the Fermi surface. Furthermore, a linear behavior is found near the Fermi surface in both cases, as expected on general grounds. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.56\\linewidth]{qp_den_NN.pdf}\n\\caption{\\label{fig:qp_den}(Color online) Panels (a)-(c): energy denominator at $T=0$ in the quasi-particle limit as a function of momentum for different Fermi momenta, corresponding to the (a) CDBonn, (b) Av18 and (c) N3LO interactions.}\n\\end{center}\n\\end{figure}\n\nOn the other hand, there are quantitative differences between both denominators. The double convolution takes into account the fragmentation of quasi-particle states in the normal state. Since strength is removed from the full quasi-particle peak, the denominator becomes larger than the corresponding quasi-particle value. As a matter of fact, the difference between the two results can be parametrized in terms of an effective $\\mathcal{Z}-$factor  \\cite{Bozek2000,Muther2005},\n\n", "index": 23, "text": "\\begin{align}\nZ^2_\\text{eff}(k) =\\frac{ E(k) }{\\chi(k)} \\, .\n\\label{eq:ratio}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Z^{2}_{\\text{eff}}(k)=\\frac{E(k)}{\\chi(k)}\\,.\" display=\"inline\"><mrow><mrow><mrow><msubsup><mi>Z</mi><mtext>eff</mtext><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nWe show this quantity, computed in the same conditions as  $Z_\\text{eff}$, in panels (d)-(f) of Fig.~\\ref{fig:zfacden}. Other than in the vicinity of the Fermi surface, the two renormalization factors provide very different results. $\\mathcal{Z}(k)$ is generally well above $Z_\\text{eff}(k)$. It peaks around $k=0$ at values of $\\approx 1.3-1.5$, decreases to a minimum close to $k_F$ and subsequently raises again to $\\approx 1$ at high momenta. Even though pairing properties are dominated by Fermi surface effects, where both renormalization factors are relatively similar, this comparison shows that a realistic description of the missing strength for pairing purposes can only be achieved approximately by a renormalization-corrected BCS-type approach~\\cite{Dong2013,Dong2015}. In fact, because the removal of strength is underestimated in $\\mathcal{Z}(k)$ with respect to $Z_\\text{eff}$, the corresponding gap is larger in a $Z-$factor corrected BCS approach as compared to a fully correlated description~\\cite{Bozek2000}. An additional difficulty is that it is unclear how particle number or density can be properly obtained from this approach.\n\n\n\n\\subsection{Long-range correlations}\n\\label{sec:LRC}\n\nThe most important effect of LRC on pairing properties will occur at the level of the effective pairing interaction when neutrons near the Fermi surface exchange possibly collective spin and density modes~ \\cite{Wambach1993,Schulze2001,Schwenk2003,Schwenk2004,Sedrakian2006,Sedrakian2007}. Following Refs.~\\cite{Shen2005,Cao2006,Dong2013}, we add to the interaction in the generalized gap equation, $\\mathcal{V}^{JST}_{LL'}$, the corresponding contributions accounting for such fluctuations in a physically motivated way. \nWe adopt the results of Ref.~\\cite{Cao2006}, which incorporate an induced interaction that leads to a well-behaved particle-hole interaction that fulfills appropriate stability criteria, not obeyed by interactions that incorporate only the effect of SRC like \\textit{e.g.} $\\mathcal{G}$-matrices~\\cite{dickhoff1987self}. The coupling to neutrons that are dressed by the full off-shell effect of SRC as described in the previous section is then governed by the exchange of both a density fluctuation and a spin mode. The collective features of these modes are controlled by self-consistently determined Landau parameters~\\cite{Cao2006}.Their contribution to the pairing interaction requires a recoupling from the particle-hole channel to the particle-particle channel and is therefore different for spin singlet and spin triplet pairing. We note that this is a physically motivated approach to the treatment of LRC that has only been tested in the literature in extensions to BCS theory where SRC are included in terms of renormalization factors~\\cite{Cao2006}. By restricting the effect of LRC to the effective interaction, we can test the effect of both SRC and LRC in pairing properties by turning either correlation effect on or off.\n\nFollowing Ref.~\\cite{Cao2006}, the interaction that treats LRC for the $^1$S$_0$ channel is given by \n\n", "itemtype": "equation", "pos": 36488, "prevtext": "\nThe ratio is displayed, for a subset of relevant densities and three NN forces, in panels (a)-(c) of Fig.~\\ref{fig:zfacden}. $Z_\\text{eff}$ is always in the range $\\approx 0.8-0.9$, and shows a mild momentum dependence, with a minimum close to the Fermi surface. Our results suggest that the ratio decreases slowly with density. This is in accordance to an intuitive picture, where correlations, measured as a deviation from one in $Z_\\text{eff}$, become more important at higher densities. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\linewidth]{zfacdenNN.pdf}\n\\caption{\\label{fig:zfacden}(Color online) Panels (a)-(c): ratio of denominators, Eq.~(\\ref{eq:ratio}) at $T=0$ as a function of momentum for different Fermi momenta. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Panels (d)-(f): the actual $Z$-factor as a function of momentum in the same conditions. See text for details. }\n\\end{center}\n\\end{figure}\n\nIt is important to stress that the effective denominator ratio, $Z_\\text{eff}$, is different from the standard renormalization factor, \n\n", "index": 25, "text": "\\begin{align}\n\\mathcal{Z}(k) =\\left.  \\frac{ 1 }{ 1 - \\partial_\\omega \\text{Re} \\Sigma^N(k,\\omega)}  \\right |_{\\omega=\\varepsilon_\\text{qp}(k) } \\, .\n\\label{eq:zfactor}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{Z}(k)=\\left.\\frac{1}{1-\\partial_{\\omega}\\text{Re}\\Sigma^%&#10;{N}(k,\\omega)}\\right|_{\\omega=\\varepsilon_{\\text{qp}}(k)}\\,.\" display=\"inline\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒵</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msub><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>1</mn><mo>-</mo><mrow><mrow><msub><mo>∂</mo><mi>ω</mi></msub><mo>⁡</mo><mrow><mtext>Re</mtext><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mi>N</mi></msup></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mstyle><mo fence=\"true\">|</mo></mrow><mrow><mi>ω</mi><mo>=</mo><mrow><msub><mi>ε</mi><mtext>qp</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msub></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nwhere $\\mathcal{G}^S_\\text{ph}$ represent the vertices that couple to the spin-$S$ excitation.\nThey can be thought of as particle-hole transformed $\\mathcal{G}$-matrix elements averaged around the Fermi energy. As argued in Ref.~\\cite{Cao2006}, these vertices are improved by employing the corresponding Landau parameters, as in the original work of Babu and Brown for liquid ${}^3$He~\\cite{babu1973}. The iterated bubble series is then represented by:\n\n", "itemtype": "equation", "pos": 39741, "prevtext": "\nWe show this quantity, computed in the same conditions as  $Z_\\text{eff}$, in panels (d)-(f) of Fig.~\\ref{fig:zfacden}. Other than in the vicinity of the Fermi surface, the two renormalization factors provide very different results. $\\mathcal{Z}(k)$ is generally well above $Z_\\text{eff}(k)$. It peaks around $k=0$ at values of $\\approx 1.3-1.5$, decreases to a minimum close to $k_F$ and subsequently raises again to $\\approx 1$ at high momenta. Even though pairing properties are dominated by Fermi surface effects, where both renormalization factors are relatively similar, this comparison shows that a realistic description of the missing strength for pairing purposes can only be achieved approximately by a renormalization-corrected BCS-type approach~\\cite{Dong2013,Dong2015}. In fact, because the removal of strength is underestimated in $\\mathcal{Z}(k)$ with respect to $Z_\\text{eff}$, the corresponding gap is larger in a $Z-$factor corrected BCS approach as compared to a fully correlated description~\\cite{Bozek2000}. An additional difficulty is that it is unclear how particle number or density can be properly obtained from this approach.\n\n\n\n\\subsection{Long-range correlations}\n\\label{sec:LRC}\n\nThe most important effect of LRC on pairing properties will occur at the level of the effective pairing interaction when neutrons near the Fermi surface exchange possibly collective spin and density modes~ \\cite{Wambach1993,Schulze2001,Schwenk2003,Schwenk2004,Sedrakian2006,Sedrakian2007}. Following Refs.~\\cite{Shen2005,Cao2006,Dong2013}, we add to the interaction in the generalized gap equation, $\\mathcal{V}^{JST}_{LL'}$, the corresponding contributions accounting for such fluctuations in a physically motivated way. \nWe adopt the results of Ref.~\\cite{Cao2006}, which incorporate an induced interaction that leads to a well-behaved particle-hole interaction that fulfills appropriate stability criteria, not obeyed by interactions that incorporate only the effect of SRC like \\textit{e.g.} $\\mathcal{G}$-matrices~\\cite{dickhoff1987self}. The coupling to neutrons that are dressed by the full off-shell effect of SRC as described in the previous section is then governed by the exchange of both a density fluctuation and a spin mode. The collective features of these modes are controlled by self-consistently determined Landau parameters~\\cite{Cao2006}.Their contribution to the pairing interaction requires a recoupling from the particle-hole channel to the particle-particle channel and is therefore different for spin singlet and spin triplet pairing. We note that this is a physically motivated approach to the treatment of LRC that has only been tested in the literature in extensions to BCS theory where SRC are included in terms of renormalization factors~\\cite{Cao2006}. By restricting the effect of LRC to the effective interaction, we can test the effect of both SRC and LRC in pairing properties by turning either correlation effect on or off.\n\nFollowing Ref.~\\cite{Cao2006}, the interaction that treats LRC for the $^1$S$_0$ channel is given by \n\n", "index": 27, "text": "\\begin{align}\n\\mathcal{V}^{S=0}_\\text{LRC} = \n{\\textstyle{\\frac{1}{2}}}  \\mathcal{G}^0_\\text{ph}  \\mathcal{G}^0_\\text{ph} \\Lambda^{S=0}(q) - \n{\\textstyle \\frac{3}{2}} \\mathcal{G}^1_\\text{ph}  \\mathcal{G}^1_\\text{ph} \\Lambda^{S=1}(q) \\, ,\n\\label{eq:veffS0}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{V}^{S=0}_{\\text{LRC}}={\\textstyle{\\frac{1}{2}}}\\mathcal{%&#10;G}^{0}_{\\text{ph}}\\mathcal{G}^{0}_{\\text{ph}}\\Lambda^{S=0}(q)-{\\textstyle\\frac%&#10;{3}{2}}\\mathcal{G}^{1}_{\\text{ph}}\\mathcal{G}^{1}_{\\text{ph}}\\Lambda^{S=1}(q)\\,,\" display=\"inline\"><mrow><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒱</mi><mtext>LRC</mtext><mrow><mi>S</mi><mo>=</mo><mn>0</mn></mrow></msubsup><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>0</mn></msubsup><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>0</mn></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mrow><mi>S</mi><mo>=</mo><mn>0</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mfrac><mn>3</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>1</mn></msubsup><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>1</mn></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mrow><mi>S</mi><mo>=</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nwhere $\\mathcal{L}^S$ corresponds to the relevant Landau parameter. The density mode with total spin $0$ in the particle-hole channel is determined by $\\mathcal{L}^0$  which is attractive at low density and usually denoted by $F_0$. The spin mode with total spin $1$ is determined by  $\\mathcal{L}^1$, which is repulsive but has similar magnitude and is often denoted by $G_0$.  The static Lindhard function, $\\Lambda_0(q)$\n\n", "itemtype": "equation", "pos": 40462, "prevtext": "\nwhere $\\mathcal{G}^S_\\text{ph}$ represent the vertices that couple to the spin-$S$ excitation.\nThey can be thought of as particle-hole transformed $\\mathcal{G}$-matrix elements averaged around the Fermi energy. As argued in Ref.~\\cite{Cao2006}, these vertices are improved by employing the corresponding Landau parameters, as in the original work of Babu and Brown for liquid ${}^3$He~\\cite{babu1973}. The iterated bubble series is then represented by:\n\n", "index": 29, "text": "\\begin{align}\n\\Lambda^S(q) = \\frac{\\Lambda_0(q)}{1 - \\Lambda_0(q) \\mathcal{L}^S} \\, ,\n\\label{eq:bubbles}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Lambda^{S}(q)=\\frac{\\Lambda_{0}(q)}{1-\\Lambda_{0}(q)\\mathcal{L}^%&#10;{S}}\\,,\" display=\"inline\"><mrow><mrow><mrow><msup><mi mathvariant=\"normal\">Λ</mi><mi>S</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>S</mi></msup></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nis employed in Eq.~(\\ref{eq:bubbles}), with the appropriate density of states $N(0)=\\frac{8mk_F}{\\hbar^2}$ and degeneracy factor $\\mathrm{g}=2$. \nWe assume as in Ref.~\\cite{Cao2006} that for neutron matter the effective mass in the density of states can be approximated by the bare mass.\nThe static Lindhard function is iterated to all orders according to Eq.~(\\ref{eq:bubbles}) and generates negative particle-hole propagators, $\\Lambda^S$. Projecting Eq.~(\\ref{eq:veffS0}) onto $L = 0$, the resulting interaction can then be included into the gap equation for ${}^1S_0$ pairing for a given density and appropriate values of the Landau parameters.\n\n\\begin{figure}\n\t\\begin{center}\n\t\t\\includegraphics[width=0.9\\linewidth]{LandauParameters.pdf}\n\t\\end{center}\n\t\\caption{\\label{fig:LDP}(Color online) Landau parameters $F_0$ and $G_0$ extrapolated to $k_F$ = 3.0 fm$^{-1}$ employing the results of Ref.~\\cite{Cao2006}. The corresponding value of the forward scattering sum rule is indicated by the open circles.}\n\\end{figure}\n\nBoth Landau parameters exhibit a modest density dependence in the domain relevant for singlet pairing ($k_F < 1.5$ fm$^{-1}$). The parameters are adopted from Ref.~\\cite{Cao2006} and are plotted in Fig.~\\ref{fig:LDP}.\nThe first term in Eq.~(\\ref{eq:veffS0}) is attractive, whereas the second term is repulsive. In the density domain relevant for singlet pairing this repulsion dominates on account of the spin factor leading to an inevitable additional suppression of the gap in this channel. Figure~\\ref{fig:VLRC} illustrates that the additional term, $\\mathcal{V}^{S}_\\text{LRC}$ [panels (c) and (d)], is relatively small compared to the bare interaction [panels (a) and (b)]. For the $^1$S$_0$ channel, LRC reduce the attraction of the bare Av18 interaction.\n\n\\begin{figure}\n\t\\begin{center}\n\t\t\\includegraphics[width=\\linewidth]{VLRCn.pdf}\n\t\\end{center}\n\t\\caption{\\label{fig:VLRC}(Color online) Panels (a) and (b): diagonal matrix elements of the Av18 interaction in the (a) $^1$S$_0$ and (b) $^3$P$_2$ channels. Panels (c) and (d): diagonal matrix elements of the additional pairing interaction representing the low-energy medium polarization at a density corresponding to $k_F =1.6$ fm$^{-1}$ in the same channels. The scales are different for each panel.}\n\\end{figure}\n\nThe procedure proposed in Ref.~\\cite{Cao2006} is generalized here to the case of the $^3$PF$_2$ coupled channel. For the $^3$PF$_2$ channel which involves spin-$1$ pairs, the sampling over density and spin modes becomes:\n\n", "itemtype": "equation", "pos": 41003, "prevtext": "\nwhere $\\mathcal{L}^S$ corresponds to the relevant Landau parameter. The density mode with total spin $0$ in the particle-hole channel is determined by $\\mathcal{L}^0$  which is attractive at low density and usually denoted by $F_0$. The spin mode with total spin $1$ is determined by  $\\mathcal{L}^1$, which is repulsive but has similar magnitude and is often denoted by $G_0$.  The static Lindhard function, $\\Lambda_0(q)$\n\n", "index": 31, "text": "\\begin{align}\n\\Lambda_0(q)=\\frac{N(0)}{\\mathrm{g}}\\frac{1}{2}\\left[-1+\\frac{1}{q}\\left(1-\\frac{q^2}{4}\\right) \\ln\\left|\\frac{1-q/2}{1+q/2}\\right|\\right]\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Lambda_{0}(q)=\\frac{N(0)}{\\mathrm{g}}\\frac{1}{2}\\left[-1+\\frac{1%&#10;}{q}\\left(1-\\frac{q^{2}}{4}\\right)\\ln\\left|\\frac{1-q/2}{1+q/2}\\right|\\right]\" display=\"inline\"><mrow><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mi mathvariant=\"normal\">g</mi></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mo>-</mo><mn>1</mn></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>q</mi></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msup><mi>q</mi><mn>2</mn></msup><mn>4</mn></mfrac></mstyle></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>|</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi>q</mi><mo>/</mo><mn>2</mn></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>q</mi><mo>/</mo><mn>2</mn></mrow></mrow></mfrac></mstyle><mo>|</mo></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nwith both terms yielding attraction. Contrary to the $^1$S$_0$ channel, this contribution will always lead to antiscreening of the gap, as it represents an attractive interaction. This point is illustrated in panel (d) of Fig.~\\ref{fig:VLRC}, which shows the relatively small but nevertheless attractive contribution of the LRC interaction in the $S=1$ channel. This is to be compared to the bare interaction in the $^3$P$_2$ channel, shown in panel (b). \n\nThe Landau parameters $F_0$ and $G_0$ from Ref. \\cite{Cao2006} are extrapolated to higher densities in a smooth way as shown in Fig.~\\ref{fig:LDP}. In Fig.~\\ref{fig:LDP}, we also include the contribution to the forward scattering sum rule of the Landau parameters $F_0$ and $G_0$ indicated by the open circles (see \\textit{e.g.} Refs.~\\cite{Friman1979,Dickhoff1981x,dickhoff1987self}). While the extrapolated Landau parameters are both positive at higher density, the forward scattering sum rule is nevertheless approximately fulfilled when one allows for a negative contribution of the Landau parameter $F_1$ (for example of about $-0.5$~\\cite{Dickhoff1981x}) to the sum rule, given by $F_1/(1+F_1/3)$. The extrapolation introduces some uncertainty in the effect of LRC for triplet pairing at higher density, but it should be emphasized that Eq.~(\\ref{eq:veffS1}) leads to antiscreening whatever the numerical values or sign of the Landau parameters $F_0$ and $G_0$. Moreover, this small correction is motivated by well-explored many-body theory principles.\n\nIn future work, we intend to generate the Landau parameters from a consistent evaluation starting from the ladder-summed effective interaction. A proper inclusion of the induced interaction with this starting point is however considerably beyond the scope of the present work. Further, the possibility that the presence of the pion-exchange tensor interaction strongly influences the spin mode \\cite{Dickhoff1981} should also be investigated (see also Ref.~\\cite{Pankratov2015}). A proper treatment of retardation implied by the possibility of exchanging low-lying density and spin modes in principle generates a complex solution of the gap equation which should also be explored further (see \\textit{e.g.} the work of Ref.~\\cite{Sedrakian2003} for a calculation with a dynamic pion-exchange interaction).\n\n\n\n\\section{Results}\n\\label{sec:results}\n\n\\subsection{Singlet pairing}\n\\label{sec:results1S0}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{1S0_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap1s0}(Color online) Pairing gaps at the Fermi surface as a function of Fermi momentum in the $^1$S$_0$ channel. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Results for different approximations are presented: BCS (solid lines), beyond BCS with short-range correlations (empty circles), beyond BCS with long-range correlations (empty squares) and beyond BCS with both short- and long-range correlations included (solid circles). The dashed lines represent the fits provided in Table~\\ref{table:1S0}. }\n\\end{figure}\n\nFigure~\\ref{fig:gap1s0} provides the pairing gaps in the $^1$S$_0$ channel computed at the corresponding Fermi surfaces in neutron matter for four different approximations. Results for the CDBonn, Av18 and N3LO NN forces are displayed in panels (a)-(c), respectively. Solid lines represent the standard BCS solution, computed using free sp spectra. The BCS+LRC results (empty squares) have been obtained by adding the dressed effective interactions of Eq.~(\\ref{eq:veffS0}) to the bare NN forces in the gap equation, Eq.~(\\ref{eq:gap}). SRC results (empty circles) are computed with bare NN forces, but double convolution denominators in the gap equation. Finally, the full circles are obtained from the full denominators and LRC-corrected effective interactions. \n\nThe BCS results (solid line) are very similar for all forces, which confirms that phase-shift equivalence is enough to fix the value of the gap in this channel~\\cite{Dean2003}. The BCS gap peaks at about $3$ MeV around $k_F=0.7$-$0.8$ fm$^{-1}$, and closes at $k_F \\approx 1.5$ fm$^{-1}$. As mentioned above, LRC in this channel screen part of the attraction of the NN forces. Consequently, BCS+LRC gaps (squares) are generally smaller than BCS results. While the overall Fermi momentum dependence is similar, including a similar closure density, the maximum of $\\Delta$ decreases to about $\\approx 2.5$ MeV. It is important to stress that the screening is the same for all interactions. \n\nIncluding SRC within the Green's function formalism outlined above (empty circles), we find that the overall gap is reduced, with a maximum that now sits just above $2$ MeV. This result is expected: by removing strength from the Fermi surface, the pairing phase space is quenched and the corresponding pairing gap decreases by about $30 \\%$. The mild density dependence of $Z_\\text{eff}$ also explains why the BCS and the SRC results have similar density dependences. There is a tendency to have a slightly lower closure density for the SRC results, a feature we shall discuss further when we introduce numerical parametrizations below.\n\nFinally, the complete results including both SRC and LRC are shown in full circles in Fig.~\\ref{fig:gap1s0}. Screening effects in this channel are repulsive, and as a consequence the corresponding LRC+SRC gaps decrease in size by about $25 \\%$ with respect to the SRC only data. These gaps peak at values of around $1.8$ MeV, for Fermi momenta close to $0.75$ fm$^{-1}$. While the overall density dependence is comparable to the previous results, we note a tendency to find a lower gap closure density. \n\nFor a given channel, a convenient parametrization of the density dependence of the gap function is given by:\n\n", "itemtype": "equation", "pos": 43687, "prevtext": "\nis employed in Eq.~(\\ref{eq:bubbles}), with the appropriate density of states $N(0)=\\frac{8mk_F}{\\hbar^2}$ and degeneracy factor $\\mathrm{g}=2$. \nWe assume as in Ref.~\\cite{Cao2006} that for neutron matter the effective mass in the density of states can be approximated by the bare mass.\nThe static Lindhard function is iterated to all orders according to Eq.~(\\ref{eq:bubbles}) and generates negative particle-hole propagators, $\\Lambda^S$. Projecting Eq.~(\\ref{eq:veffS0}) onto $L = 0$, the resulting interaction can then be included into the gap equation for ${}^1S_0$ pairing for a given density and appropriate values of the Landau parameters.\n\n\\begin{figure}\n\t\\begin{center}\n\t\t\\includegraphics[width=0.9\\linewidth]{LandauParameters.pdf}\n\t\\end{center}\n\t\\caption{\\label{fig:LDP}(Color online) Landau parameters $F_0$ and $G_0$ extrapolated to $k_F$ = 3.0 fm$^{-1}$ employing the results of Ref.~\\cite{Cao2006}. The corresponding value of the forward scattering sum rule is indicated by the open circles.}\n\\end{figure}\n\nBoth Landau parameters exhibit a modest density dependence in the domain relevant for singlet pairing ($k_F < 1.5$ fm$^{-1}$). The parameters are adopted from Ref.~\\cite{Cao2006} and are plotted in Fig.~\\ref{fig:LDP}.\nThe first term in Eq.~(\\ref{eq:veffS0}) is attractive, whereas the second term is repulsive. In the density domain relevant for singlet pairing this repulsion dominates on account of the spin factor leading to an inevitable additional suppression of the gap in this channel. Figure~\\ref{fig:VLRC} illustrates that the additional term, $\\mathcal{V}^{S}_\\text{LRC}$ [panels (c) and (d)], is relatively small compared to the bare interaction [panels (a) and (b)]. For the $^1$S$_0$ channel, LRC reduce the attraction of the bare Av18 interaction.\n\n\\begin{figure}\n\t\\begin{center}\n\t\t\\includegraphics[width=\\linewidth]{VLRCn.pdf}\n\t\\end{center}\n\t\\caption{\\label{fig:VLRC}(Color online) Panels (a) and (b): diagonal matrix elements of the Av18 interaction in the (a) $^1$S$_0$ and (b) $^3$P$_2$ channels. Panels (c) and (d): diagonal matrix elements of the additional pairing interaction representing the low-energy medium polarization at a density corresponding to $k_F =1.6$ fm$^{-1}$ in the same channels. The scales are different for each panel.}\n\\end{figure}\n\nThe procedure proposed in Ref.~\\cite{Cao2006} is generalized here to the case of the $^3$PF$_2$ coupled channel. For the $^3$PF$_2$ channel which involves spin-$1$ pairs, the sampling over density and spin modes becomes:\n\n", "index": 33, "text": "\\begin{align}\n\\mathcal{V}^{S=1}_\\text{LRC} = \n\\frac{1}{2} \\mathcal{G}^0_\\text{ph}  \\mathcal{G}^0_\\text{ph} \\Lambda^{S=0}(q) + \n\\frac{1}{2} \\mathcal{G}^1_\\text{ph}  \\mathcal{G}^1_\\text{ph} \\Lambda^{S=1}(q) \\, ,\n\\label{eq:veffS1}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathcal{V}^{S=1}_{\\text{LRC}}=\\frac{1}{2}\\mathcal{G}^{0}_{\\text{%&#10;ph}}\\mathcal{G}^{0}_{\\text{ph}}\\Lambda^{S=0}(q)+\\frac{1}{2}\\mathcal{G}^{1}_{%&#10;\\text{ph}}\\mathcal{G}^{1}_{\\text{ph}}\\Lambda^{S=1}(q)\\,,\" display=\"inline\"><mrow><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒱</mi><mtext>LRC</mtext><mrow><mi>S</mi><mo>=</mo><mn>1</mn></mrow></msubsup><mo>=</mo><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>0</mn></msubsup><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>0</mn></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mrow><mi>S</mi><mo>=</mo><mn>0</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>1</mn></msubsup><mo>⁢</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mtext>ph</mtext><mn>1</mn></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mrow><mi>S</mi><mo>=</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nwith $\\Delta_0$, $k_0$, $k_1$, $k_2$ and $k_3$ numerical parameters \\cite{Ho2015}.  In particular, $k_0$ and $k_2$ represent the Fermi momenta at which the gap opens and closes, respectively. Details on the numerical fit to this function are given in Appendix~\\ref{app:fits}. We note that this parametrization is particularly sharp around the closure points, and that in the singlet channel we supplement the fit with a zero value at zero density. We show in Table \\ref{table:1S0} the values of the parameters obtained for these fits. Further, we note that the dashed lines shown in Fig.~\\ref{fig:gap1s0} correspond to the fit functions. \n\nThe fit does reproduce the qualitative shape of the pairing gap. We take $k_2$,  displayed in column 5 of Table~\\ref{table:1S0}, as a measure of the gap closure density. The confidence interval associated to the fit is within $0.12$ fm$^{-1}$ (for the worst fit) from the central value. We note that there is a robust agreement and for all forces and many-body approaches the gap closure sits between $1.4$ and $1.5$ fm$^{-1}$. \n\nThis parametrization also allows a simple quantitative estimate of the gap maxima, and their location. For instance, the SRC maximum gap lies between $k_F=0.78$ (N3LO), $0.81$ (CDBonn) and $0.84$  fm$^{-1}$ (Av18), at a value between $\\Delta_\\text{max}^{^1S_0}=2.1$ MeV (Av18) and $2.3$ MeV (CDBonn and N3LO). Similarly, the SRC+LRC results peak between  $k_F=0.75$ (N3LO), $0.76$ (Av18) and $0.79$ fm$^{-1}$ (CDBonn) to maximum gaps of the order of $\\Delta_\\text{max}^{^1S_0}=1.8$ MeV for all three NN interactions.\n\nWe note that similar gaps have already been obtained in the literature. A comparison with the compilation of Ref.~\\cite{Ho2015} shows that our results are close to the Cao-Lombardo-Schuck (CLS)~\\cite{Cao2006} and Margueron-Sagawa-Hagino (MSH)~\\cite{Margueron2008} singlet gaps. MSH is fit to the CLS results, so the agreement between the two is not surprising. Our results include LRC in a way that is similar to CLS, but we note that the SRC physics is considered only at the $\\mathcal{Z}-$factor level in a Brueckner--Hartree--Fock calculation, and hence misses a complete description of hole-hole correlation effects.\n \n\\begin{table}[t!]\n\\caption{\\label{table:1S0}Parameters generated by a fit to the calculated gaps for the CDBonn, Av18, and N3LO interactions in the $^1$S$_0$ channel. For each interaction, the first line contains the results for the inclusion of SRC only, and the second the effect of both SRC and LRC.}\n\\centering \n\\begin{tabular}{cccccc} \n\\hline \\hline \nSinglet & $\\Delta_0$ & $k_0$ & $k_1$ & $k_2$ & $k_3$ \\\\\n & [MeV] & [fm$^{-1}$] & [fm$^{-2}$] & [fm$^{-1}$] & [fm$^{-2}$]  \\\\\n \\hline\nCDBonn SRC & 26.59 & 0.05 & 1.79 & 1.46 & 0.76 \\\\ \nCDBonn SRC+P & 18.18 & 0.05 & 1.39 & 1.45 & 0.81 \\\\ \nAv18 SRC & 32.22 & 0.04 & 3.46 & 1.40 & 0.43 \\\\ \nAv18 SRC+P & 14.07 & 0.04 & 1.00 & 1.44 & 0.78 \\\\ \nN3LO SRC & 7.77 & 0.00 & 0.56 & 1.49 & 0.38 \\\\ \nN3LO SRC+P & 5.85 & 0.00 & 0.46 & 1.48 & 0.42 \\\\ \n\\hline \n\\end{tabular} \n\\end{table}\n\nAll in all, the picture that arises for the singlet gaps provided by the three interactions is \\emph{remarkably robust}. The small variation of the result among NN forces provides an insightful constraint on the model dependence of the gap properties. In spite of their different short-range and (less relevant for neutron matter) tensor components, the 3 interactions considered here predict singlet gaps which are very close to each other. More importantly, the many-body effects are very similar in all cases. SRC deplete the gap by about $25 \\, \\%$. When LRC are included on top of SRC, the gap that remains is around $60 \\, \\%$  of the original BCS result for all forces. The effect of the correlation-induced gap quench in pairing properties, like the Cooper pair coherence length~\\cite{deBlasio1997}, or neutron star properties~\\cite{Ho2015}, go beyond the scope of the present paper and will be studied elsewhere.\n\nThe robustness of the singlet gap results with and without correlation effects is one of the major conclusions of this work. We note, however, that this result is not necessarily easily anticipated. The gap itself is a function of both Fermi momentum, $k_F$, and sp momentum, $k$. So far, we have focused on the values at the Fermi surface, $\\Delta^{JST}_L(k=k_F)$, but the momentum dependence provides useful information, too. In particular, as we are about to show, very different momentum dependences can lead to similar gaps at the Fermi surface. \n\nThe pairing gap is shown as a function of the momentum, $k$, for a variety of Fermi momenta in the fence plots of Fig.~\\ref{fig:gap1s0_2d}. Panels (a), (b) and (c) correspond to the three NN forces, CDBonn, Av18 and N3LO, respectively. We show results for both the BCS (dotted lines) and SRC-only (solid lines) approximations. In all cases, as expected in the singlet case, the gap peaks at zero momentum, subsequently decreases to negative values beyond the Fermi surface, and ultimately approaches zero asymptotically. In contrast to the results of N3LO in panel (c), both CDBonn and Av18 show a non-zero gap up to large values of momentum, $\\approx 6-7$ fm$^{-1}$. In principle, N3LO is regularized at a momentum scale of $500$ MeV~\\cite{Entem2003}, and hence it is not surprising to find that there is no support for a gap beyond $\\approx 3$ fm$^{-1}$. \n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{1S0_2d_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap1s0_2d}(Color online) Pairing gaps in the $^1$S$_0$ channel as a function of momentum for several Fermi momenta. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. The BCS (dashed lines) and SRC (solid lines) results are presented. The symbols represent the corresponding gaps at the Fermi surface, as shown in Fig.~\\ref{fig:gap1s0}.}\n\\end{figure}\n\nThe significant differences in high-momentum components do not alter the low-momentum gap. The values at the Fermi surface are close to each other, and indeed the momentum dependence is qualitatively similar for all three forces up to $k\\approx2.5$ fm$^{-1}$. The general effect of SRC is to tame this momentum dependence. The maximum of the gap decreases, and its negative minimum becomes less negative. In accordance with some of the ideas mentioned above, the quench of the momentum dependence is relatively density- and momentum independent. \n\n\\subsection{Triplet pairing}\n\\label{sec:results3PF2}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{3PF2_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap3pf2}(Color online) The same as Fig.~\\ref{fig:gap1s0_2d} for the coupled $^3$PF$_2$ channel. The grey band on panel (c) indicates the region in which cut-off effects are relevant for the N3LO force. }\n\\end{figure}\n\nWhereas singlet pairing is active at relatively low densities and affects the dynamics of both the core and the crust, triplet pairing, concerning the coupled $^3$PF$_2$ channel, takes place within the neutron star core, at Fermi momenta  $k_F>1$ fm$^{-1}$~\\cite{Ho2015,Page2011}. Higher Fermi momenta imply that higher relative momenta are explored in the bare (or the effective) interaction. Because phase-shift equivalent interactions are constrained only at low energies and relative momenta, it is not surprising that the corresponding gaps show a larger dependence on the NN force. We show the triplet gaps for three NN forces in panels (a)-(c) of Fig.~\\ref{fig:gap3pf2}. We use a logarithmic scale to discriminate better the results of different many-body approximations. \n\nDifferences between NN forces are already significant at the BCS level (solid lines). All gaps open at Fermi momenta around $k_F \\approx 1.1$ fm$^{-1}$. Triplet gaps peak around $2$-$2.5$ fm$^{-1}$. CDBonn provides the largest maximum ($\\Delta^{^3PF_2}_\\textrm{max} = 0.86$ MeV at $k_F\\approx2.5$ fm$^{-1}$), followed by N3LO ($\\Delta^{^3PF_2}_\\textrm{max} = 0.77$ MeV at $2.2$ fm$^{-1}$) and Av18 ($\\Delta^{^3PF_2}_\\textrm{max} \\approx 0.64$ MeV at $k_F=2.1$ fm$^{-1}$). In turn, the gap closure happens at larger densities for interactions with larger gaps. For CDBonn, the closure occurs at a very high density, $k_F \\approx 3.64$ fm$^{-1}$, beyond the limit of Fig.~\\ref{fig:gap3pf2}. Av18 and N3LO, instead, provide BCS closure momenta between $2.9$ and $3$ fm$^{-1}$. \n\nN3LO results are sensitive to the cut-off regularization of the NN force at large Fermi momenta \\cite{Maurizio2014}. The grey band in panel (c) indicates the region in which regularization effects become observable. It is important to stress that the two similar gap closures for Av18 and N3LO are indicative of two very different physical effects. On the left (right) panels of Fig.~\\ref{fig:NNpots} we show density plots for the $^3$P$_2$ ($^3$D$_2$) matrix elements of the three NN forces. A gap can only appear if attractive matrix elements of $\\mathcal{V}$ are available. Consequently, N3LO can only sustain a gap up to about $\\approx 3$ fm$^{-1}$ because its matrix elements are regularized, and hence tend to zero, beyond this momentum. In contrast, Av18 does have non-zero, rather repulsive matrix elements beyond about $\\approx 4$ fm$^{-1}$. It is the appearance of these repulsive matrix elements that forbids pairing above the closure momentum for Av18. The top panels also illustrate why CDBonn sustains gaps up to larger Fermi momenta: the attractive nature of its $P-$wave matrix elements covers a large relative momentum region.\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=\\linewidth]{NNpots_J2.pdf}\n\\end{center}\n\\caption{\\label{fig:NNpots}(Color online) Left panels: matrix elements of NN forces in fm for the $^3$P$_2$ partial wave. Right panels: the same for the $^3$D$_2$ wave.}\n\\end{figure}\n\nIn contrast to the singlet case, the inclusion of LRC on top of the BCS result leads to higher gaps. This result is in line with the discussion of Sec.~\\ref{sec:LRC}, because in this channel LRC are attractive and anti-screen the interaction. The effect is rather significant, with the Av18 BCS+LRC gap becoming more than a factor of $2$ larger than the original BCS result. The density dependence is also modified by LRC.\n\nWhen SRC are considered (empty circles), all $^3$PF$_2$ gaps are strongly suppressed. All maximum triplet gaps fall below $0.15$ MeV: $0.04$ MeV for Av18, $0.05$ for CDBonn and about $0.1$ MeV for N3LO. The density dependence of these gaps is also different than the BCS prediction. We note that the data for the SRC and SRC+LRC is relatively noisy, due to the numerical limitations of the zero temperature extrapolation discussed in Appendix~\\ref{app:T0}. Nevertheless, the gross features of the SRC effects are rather clear. \n\nIf we take the $k_0$ parameter of the fits presented in Table~\\ref{table:3PF2} as an indication of gap opening, triplet gaps start at $k_F \\approx 1.1$ fm$^{-1}$ for all forces. The corresponding gap maxima occur at $k_F=1.77$, $1.79$ and $1.92$ fm$^{-1}$ for CDBonn, Av18 and N3LO, respectively. This is to be compared to the substantially larger BCS values of $\\approx 2-2.5$ fm$^{-1}$. Finally, the gap closure occurs at lower Fermi momenta for the SRC gaps (see column 5 in Table~\\ref{table:3PF2}) than the corresponding BCS results. N3LO predicts the larger closure at $k_F \\approx 2.8$ fm$^{-1}$, whereas the lowest closure is given by Av18 at $2.0$  fm$^{-1}$. All in all, SRC triplet gaps are smaller and exhibit a smaller density range than their corresponding BCS counterparts. \n\n\\begin{table}[t!]\n\\caption{\\label{table:3PF2}Parameters generated by a fit to the calculated gaps for the CDBonn, Av18 and N3LO interactions in the $^3$PF$_2$ channel. For each interaction, the first line contains the results for the inclusion of SRC only, and the second the effect of both SRC and LRC.}\n\\centering \n\\begin{tabular}{cccccc} \n\\hline \\hline \nTriplet & $\\Delta_0$ & $k_0$ & $k_1$ & $k_2$ & $k_3$ \\\\\n & [MeV] & [fm$^{-1}$] & [fm$^{-2}$] & [fm$^{-1}$] & [fm$^{-2}$]  \\\\\n \\hline\nCDBonn SRC & 0.60 & 1.01 & 2.21 & 2.33 & 0.43 \\\\ \nCDBonn SRC+P & 0.41 & 1.03 & 0.56 & 2.81 & 1.00 \\\\ \nAv18 SRC & 0.09 & 1.01 & 0.64 & 1.98 & 0.005 \\\\ \nAv18 SRC+P & 0.17 & 1.10 & 0.35 & 2.18 & 0.05 \\\\ \nN3LO SRC & 0.43 & 1.13 & 0.83 & 2.59 & 0.41 \\\\ \nN3LO SRC+P & 0.60 & 1.11 & 0.69 & 2.79 & 0.53 \\\\ \n\\hline \n\\end{tabular} \n\\end{table}\n\nLRC, when considered in addition to SRC (solid circles), do not change the picture qualitatively. In this channel, spin-density fluctuations lead to a more attractive pairing interaction, and hence LRC increase the triplet pairing gap by a small percentage. LRC+SRC start at similar Fermi momenta than their SRC-only counterparts. The maximum gap that is produced, however, is almost twice as large: $0.17$ MeV for N3LO, $0.11$ for CDBonn and $0.07$ MeV for Av18. The corresponding Fermi momentum maxima are similar, $k_F=1.86$, $1.79$ and $1.98$ fm$^{-1}$ for CDBonn, Av18 and N3LO, respectively. In keeping with the larger maxima, gap closures also occur at larger Fermi momenta, with two interactions (CDBonn and N3LO) closing the gap at $k_F=2.8$ fm$^{-1}$, and the remaining one, Av18, at $2.2$ fm$^{-1}$. \n\nAll in all, our prediction for triplet gaps are also reasonably robust, and independent of the NN force. Triplet gaps are always at the level of $10$s of keV, peaking at Fermi momenta in the region $1.7-2$ fm$^{-1}$ and closing earlier than the BCS predictions. To compare with previous literature in similar conditions, we consider the results of Dong \\emph{et al.} in Ref.~\\cite{Dong2013}. They use the Av18 interaction and parametrize SRC in terms of $\\mathcal{Z}-$ factors. The maximum triplet gap in that calculation is $0.045$ MeV at $k_F\\approx1.6$ fm$^{-1}$, in very good agreement to our SRC result ($0.04$ MeV at $1.79$ fm$^{-1}$). We note that none of the gaps considered in the recent astrophysically motivated compilation of Ref.~\\cite{Ho2015} resemble our predictions. However, the maximum gaps that we produce compare well with the inferred value of triplet critical temperatures of Ref.~\\cite{Page2011}, $T_c = 5 \\times 10^8 \\text{ K} \\Rightarrow \\Delta_\\text{max}^{^3PF_2} \\approx 0.08 \\text{ MeV}$.\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{3PF2_2d_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap3pf2_2d}(Color online) The same as Fig.~\\ref{fig:gap1s0_2d} for the pairing gaps in the  $^3$PF$_2$ channel. Note the logarithmic scale on the $z$ axis.}\n\\end{figure}\n\nThe agreement between the different NN interactions is not trivial, as we have discussed in the singlet case. We have already illustrated the very different momentum-space structure of the triplet components of the NN forces in Fig.~\\ref{fig:NNpots}. Further, we present in Fig.~\\ref{fig:gap3pf2_2d} the momentum dependence of the triplet gap components for several Fermi momenta. We use again a logarithmic plot to distinguish better all the presented results. The BCS predictions (dotted lines) begin at zero, as expected from non-$S$-wave pairing, peak close to the Fermi surface, and subsequently decay. While CDBonn and Av18 show an inflection point at $k\\approx4$ fm$^{-1}$ and decay slowly with momentum, N3LO decays to zero for momenta well below this value. The corresponding SRC gaps show qualitatively similar behaviors and peaks, but are generally an order of magnitude smaller. There are differences in the density dependence, too. In any case, this figure illustrates the fact that, unlike the singlet case, triplet pairing gaps are more sensitive to the short-range (or, equivalently, high-momentum) components of the NN force.\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nWe have proposed a method that combines the SCGF framework for the treatment of SRC and FLT for the incorporation of LRC to the neutron matter pairing problem with NN interactions. This approach has two major ingredients. On the one hand, extrapolated normal ladder self-energies provide access to zero temperature spectral functions and, in turn, these give rise to depleted energy denominators that quench the gap. On the other, the pairing interaction is treated beyond the static, bare level. Screening is provided by considering vertices represented by Landau parameters, that couple to spin and density oscillations, whose collectivity is also controlled by the same Landau parameters. \n\nThe effect of SRC is to remove strength from the Fermi surface, thus necessarily reducing the gap. Compared to a quasi-particle, BCS-like picture, the energy denominators in the gap equation are quenched by a relatively momentum and density independent factor. In general, this is very different from the corresponding $\\mathcal{Z}$-factors associated to the ladder SCGF self-energy. This indicates that pairing calculations with $\\mathcal{Z}$-factors do not consider the full effect of SRC in a consistent way. \n\nWe take three major conclusions from our work. First, the universal effect of SRC is to deplete the gap substantially with respect to its BCS value in the whole momentum range. In the singlet channel this translates into a decrease in the Fermi surface gap of about $10-15 \\%$. In the triplet channel, the gaps were small, below $1$ MeV, at the BCS level. When SRC are considered, gaps reduce further to below $0.2$ MeV throughout a wide density regime. Second, whereas for the singlet case the effect of SRC is of the same order of the screening provided by LRC, in the triplet case LRC have an anti-screening effect that modestly increases the SRC determined gap for all three NN interactions. Third, the density dependence of triplet gaps is substantially modified by  SRC and LRC. We find gaps that open above $1.2$ fm$^{-1}$ and close below $2.6$ fm$^{-1}$ in all cases, with maxima that hardly reach $0.2$ MeV. Small triplet gaps of a similar size are commensurate with the Cassiopeia A rapid cooling scenario presented in Ref.~\\cite{Page2011}. \n\nWe have performed calculations with three very different, but phase-shift equivalent, interactions. For the singlet channel, our conclusions are extremely robust and independent of the NN force. Triplet gaps, in contrast, depend on the specifics of the interaction itself. CDBonn in general provides the largest and widest triplet gaps, whereas Av18 provides small and narrow pairing gaps. Cutoff effects artificially cut the triplet gaps of N3LO above $2.5$ fm$^{-1}$. We want to stress, however, that the SRC and LRC effects are universal and independent of the nuclear force under consideration. Work on incorporating three-nucleon forces in a consistent way, following Ref.~\\cite{Carbone2014}, is our first priority in the near future. In view of the impact of correlations on the BCS gaps on these three different interactions, we do not expect any qualitative differences with respect to these results. \n\nThe extension of the approach to asymmetric nuclear systems is also important~\\cite{Alm1993,Lombardo2001}. There is a small admixture of protons inside neutron stars, and their pairing is relevant for neutron star matter. In-medium SRC effects should be similar for proton pairing, and the suppression in the proton channel might have consequences for neutron star cooling. Pairing at finite momentum is also a relevant physical phenomena, particularly since it can lead to different pairing phases~\\cite{Stein2014}. The interplay of correlation and finite momentum effects will necessarily lead to a change in the phase diagram with respect to BCS results.\n\nThese calculations represent a first controlled step towards a full treatment of superfluidity within the Green's function formalism. At the SRC level, our treatment does not allow for the superfluid phase to feed back into the determination of the normal propagators. While feedback effects will be small, the reformulation of the problem in a Gorkov context would avoid the need of extrapolations from finite temperature. Such a self-consistent treatment of the ladder approximation in the pairing phase has never been implemented to our knowledge. At the LRC level, consistency at the Landau parameter level could provide small, quantitative differences in our results. Furthermore, the full spin dependence of the effective interaction, beyond the traditional Landau parameters~\\cite{Schwenk2004}, could have an impact on pairing gaps. Finally, the inclusion of polarization effects beyond the low-momentum transfer limit is an interesting, if computationally expensive, possibility.\n\n\\appendix\n\n\\section{Numerical treatment of the temperature extrapolation}\n\\label{app:T0}\nFor a given density, ladder self-energy calculations are typically performed for a set of $N_T\\approx 3$ to $10$ temperatures. The degeneracy parameter, $\\zeta = \\frac{T}{\\epsilon_F}$, with $\\epsilon_F$ the non-interacting Fermi energy, is a proxy for temperature in Fermi gases and is a natural dimensionless extrapolation parameter, in accordance to the Sommerfeld expansion \\cite{Ashcroft1976}. At each $\\zeta$, the real and imaginary parts of the self energy are stored as arrays in energy and momentum space. Typically, between $4000$ to $11000$ energies are needed, whereas we work with a fixed set of $70$ points in the momentum mesh. The self-energy is fit by a polynomial function of $\\zeta$,\n$ \\Sigma(k,\\omega; \\zeta) = \\sum_{l=0}^{L} a_l(k,\\omega) \\zeta ^{2l} \\, ,$\n in a window of $\\zeta$ values. For a given density, we take an upper limit of $\\zeta \\approx 1$ and a lower limit of $\\zeta  \\gtrsim 0.07$ (as long as the pairing instability does not set in). This ensures that the finite temperature data is neither thermally dominated ($\\zeta \\gg 1$) nor insensitive to thermal effects ($\\zeta \\ll 1$). Fig.~\\ref{fig:data} provides an illustration of the density and temperature mesh that we have used for the extrapolations with Av18.\n \n \\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.8\\linewidth]{extrap.pdf}\n\\end{center}\n\\caption{\\label{fig:data}(Color online) Each point in this plot corresponds to a density and temperature where ladder self-energies have been computed. Finite temperature points are used to extrapolate to zero temperature.}\n\\end{figure}\n\nThe zero-temperature self-energy is the independent coefficient of the polynomial fit, $a_0(k,\\omega)$, although in principle the fit can also be used to compute self-energies at arbitrary temperatures. For practical purposes, the interpolation involves only even powers, $2l$. Close to the Fermi surface, the temperature dependence of the self-energy is indeed expected to be quadratic \\cite{Abrikosov1965}. However, numerically computed self-energies, particularly close to $\\omega=\\mu$, need not be soft, continuous functions of degeneracy, due to numerical noise. Consequently, a single fit might extrapolate quantities in an unphysical way. For this reason, we perform not only one, but a series of fits with different values of $L$, the maximum power of the polynomial. Generally, we go from $L=1$ (corresponding to a $T^2$ dependence) to about $L=4$, depending on the total number of temperatures available.  All polynomial fits are performed using a $\\chi^2$ minimization procedure, which helps in evening out any numerical noise.\n \nIn the implementation, we extrapolate separately the imaginary and the real parts of the self-energy. Pairing is sensitive to the properties of $\\Sigma$ close to the Fermi energy. This is where the temperature dependence is more difficult to capture with fits. For a given polynomial order, $L$, we therefore allow for two different options. We either take the extrapolated $\\text{Im} \\Sigma$ as face value ($\\text{Im} \\Sigma \\le 0$ is imposed throughout, though) or we allow for a second option, where we match $\\text{Im} \\Sigma$ to the analytic function:\n\n", "itemtype": "equation", "pos": 49727, "prevtext": "\nwith both terms yielding attraction. Contrary to the $^1$S$_0$ channel, this contribution will always lead to antiscreening of the gap, as it represents an attractive interaction. This point is illustrated in panel (d) of Fig.~\\ref{fig:VLRC}, which shows the relatively small but nevertheless attractive contribution of the LRC interaction in the $S=1$ channel. This is to be compared to the bare interaction in the $^3$P$_2$ channel, shown in panel (b). \n\nThe Landau parameters $F_0$ and $G_0$ from Ref. \\cite{Cao2006} are extrapolated to higher densities in a smooth way as shown in Fig.~\\ref{fig:LDP}. In Fig.~\\ref{fig:LDP}, we also include the contribution to the forward scattering sum rule of the Landau parameters $F_0$ and $G_0$ indicated by the open circles (see \\textit{e.g.} Refs.~\\cite{Friman1979,Dickhoff1981x,dickhoff1987self}). While the extrapolated Landau parameters are both positive at higher density, the forward scattering sum rule is nevertheless approximately fulfilled when one allows for a negative contribution of the Landau parameter $F_1$ (for example of about $-0.5$~\\cite{Dickhoff1981x}) to the sum rule, given by $F_1/(1+F_1/3)$. The extrapolation introduces some uncertainty in the effect of LRC for triplet pairing at higher density, but it should be emphasized that Eq.~(\\ref{eq:veffS1}) leads to antiscreening whatever the numerical values or sign of the Landau parameters $F_0$ and $G_0$. Moreover, this small correction is motivated by well-explored many-body theory principles.\n\nIn future work, we intend to generate the Landau parameters from a consistent evaluation starting from the ladder-summed effective interaction. A proper inclusion of the induced interaction with this starting point is however considerably beyond the scope of the present work. Further, the possibility that the presence of the pion-exchange tensor interaction strongly influences the spin mode \\cite{Dickhoff1981} should also be investigated (see also Ref.~\\cite{Pankratov2015}). A proper treatment of retardation implied by the possibility of exchanging low-lying density and spin modes in principle generates a complex solution of the gap equation which should also be explored further (see \\textit{e.g.} the work of Ref.~\\cite{Sedrakian2003} for a calculation with a dynamic pion-exchange interaction).\n\n\n\n\\section{Results}\n\\label{sec:results}\n\n\\subsection{Singlet pairing}\n\\label{sec:results1S0}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{1S0_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap1s0}(Color online) Pairing gaps at the Fermi surface as a function of Fermi momentum in the $^1$S$_0$ channel. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. Results for different approximations are presented: BCS (solid lines), beyond BCS with short-range correlations (empty circles), beyond BCS with long-range correlations (empty squares) and beyond BCS with both short- and long-range correlations included (solid circles). The dashed lines represent the fits provided in Table~\\ref{table:1S0}. }\n\\end{figure}\n\nFigure~\\ref{fig:gap1s0} provides the pairing gaps in the $^1$S$_0$ channel computed at the corresponding Fermi surfaces in neutron matter for four different approximations. Results for the CDBonn, Av18 and N3LO NN forces are displayed in panels (a)-(c), respectively. Solid lines represent the standard BCS solution, computed using free sp spectra. The BCS+LRC results (empty squares) have been obtained by adding the dressed effective interactions of Eq.~(\\ref{eq:veffS0}) to the bare NN forces in the gap equation, Eq.~(\\ref{eq:gap}). SRC results (empty circles) are computed with bare NN forces, but double convolution denominators in the gap equation. Finally, the full circles are obtained from the full denominators and LRC-corrected effective interactions. \n\nThe BCS results (solid line) are very similar for all forces, which confirms that phase-shift equivalence is enough to fix the value of the gap in this channel~\\cite{Dean2003}. The BCS gap peaks at about $3$ MeV around $k_F=0.7$-$0.8$ fm$^{-1}$, and closes at $k_F \\approx 1.5$ fm$^{-1}$. As mentioned above, LRC in this channel screen part of the attraction of the NN forces. Consequently, BCS+LRC gaps (squares) are generally smaller than BCS results. While the overall Fermi momentum dependence is similar, including a similar closure density, the maximum of $\\Delta$ decreases to about $\\approx 2.5$ MeV. It is important to stress that the screening is the same for all interactions. \n\nIncluding SRC within the Green's function formalism outlined above (empty circles), we find that the overall gap is reduced, with a maximum that now sits just above $2$ MeV. This result is expected: by removing strength from the Fermi surface, the pairing phase space is quenched and the corresponding pairing gap decreases by about $30 \\%$. The mild density dependence of $Z_\\text{eff}$ also explains why the BCS and the SRC results have similar density dependences. There is a tendency to have a slightly lower closure density for the SRC results, a feature we shall discuss further when we introduce numerical parametrizations below.\n\nFinally, the complete results including both SRC and LRC are shown in full circles in Fig.~\\ref{fig:gap1s0}. Screening effects in this channel are repulsive, and as a consequence the corresponding LRC+SRC gaps decrease in size by about $25 \\%$ with respect to the SRC only data. These gaps peak at values of around $1.8$ MeV, for Fermi momenta close to $0.75$ fm$^{-1}$. While the overall density dependence is comparable to the previous results, we note a tendency to find a lower gap closure density. \n\nFor a given channel, a convenient parametrization of the density dependence of the gap function is given by:\n\n", "index": 35, "text": "\\begin{align}\n\\Delta^{JST}_L(k_F) = \\Delta_0 \\frac{ (k_F-k_0)^2}{(k_F-k_0)^2+k_1} \\frac{ (k_F-k_2)^2}{(k_F-k_2)^2+k_3} \\, ,\n\\label{eq:gapfit}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Delta^{JST}_{L}(k_{F})=\\Delta_{0}\\frac{(k_{F}-k_{0})^{2}}{(k_{F}%&#10;-k_{0})^{2}+k_{1}}\\frac{(k_{F}-k_{2})^{2}}{(k_{F}-k_{2})^{2}+k_{3}}\\,,\" display=\"inline\"><mrow><mrow><mrow><msubsup><mi mathvariant=\"normal\">Δ</mi><mi>L</mi><mrow><mi>J</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>T</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi mathvariant=\"normal\">Δ</mi><mn>0</mn></msub><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>F</mi></msub><mo>-</mo><msub><mi>k</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>F</mi></msub><mo>-</mo><msub><mi>k</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msub><mi>k</mi><mn>1</mn></msub></mrow></mfrac></mstyle><mo>⁢</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>F</mi></msub><mo>-</mo><msub><mi>k</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>F</mi></msub><mo>-</mo><msub><mi>k</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msub><mi>k</mi><mn>3</mn></msub></mrow></mfrac></mstyle></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nin the vicinity of the Fermi energy. This has the correct quadratic dependence in  energy of a normal Fermi liquid \\cite{Luttinger1961}. The exponential factor allows for a certain degree of asymmetry below and above the Fermi surface, which we find to be essential in order to match the numerical self-energies. This function is matched to the self-energy in a given range of energies, which is different for every momentum, $k$. \n\nWith access to the $T=0$ self-energies and spectral functions, one can compute several zero temperature properties from the microscopic properties. For instance, the energy per particle, $\\frac{E}{A}$, is obtained from the Koltun sum-rule at zero temperature \\cite{Dickhoff08}. Alternatively, the finite temperature SCGF calculations yield a set of energies which can independently be extrapolated to zero temperature using a polynomial fit. For simplicity, we take the same $L$ in the fit of this macroscopically determined data and in that of the associated self-energy. \n\nA good extrapolation procedure for the self-energy should ensure consistency between the micro- and the macroscopic results. In the example above, we would like the Koltun sum-rule at zero temperature to yield the same energy per particle than the extrapolated value from finite temperature data. We therefore construct a quality measure that quantifies the distance between extrapolations of micro- and macroscopic evaluations for some relevant data. The measure is built from a weighted sum of the relative differences between microscopic and macroscopic determinations of density, chemical potentials, energies, kinetic energies and $Z$-factors. The latter is determined independently from the discontinuity of the momentum distribution at the Fermi surface and from the on-shell derivatives of self-energies. The polynomial with $L$ that minimizes the quality measure, whether matched or not according to Eq.~(\\ref{eq:match}), is used in the extrapolation. This guarantees that the associated self-energy is consistent with both the microscopic and the macroscopic pseudo-data. The extrapolation procedure is automated, in an effort to avoid biases.\n\nBelow $T_c$ and as the temperature approaches zero asymptotically, the normal spectral function becomes an increasingly sharp function of energy close to the Fermi surface. It is important to keep track of these narrow structures in the calculation of the momentum distribution, $n(k)$. For a given momentum, $k$, the missing strength due to uncaptured narrow peaks can be estimated from the energy spectral function sum-rule \\cite{Dickhoff08}. Deviations from $1$ indicate missing strength contributions, which we use to correct the momentum distribution. We include a quasi-particle term that is weighted to account for the missing strength. We have tested this procedure against an independent determination of the momentum distribution, based on the derivatives of the zero-temperature self-energy \\cite{Rios2009}, and we have found quantitative agreement. \n\nMissing strength corrections are also relevant for the double convolution energy denominator of Eq.~(\\ref{eq:chi}). We use the sum-rule of the lowest-order two-particle propagator,\n\n", "itemtype": "equation", "pos": 73661, "prevtext": "\nwith $\\Delta_0$, $k_0$, $k_1$, $k_2$ and $k_3$ numerical parameters \\cite{Ho2015}.  In particular, $k_0$ and $k_2$ represent the Fermi momenta at which the gap opens and closes, respectively. Details on the numerical fit to this function are given in Appendix~\\ref{app:fits}. We note that this parametrization is particularly sharp around the closure points, and that in the singlet channel we supplement the fit with a zero value at zero density. We show in Table \\ref{table:1S0} the values of the parameters obtained for these fits. Further, we note that the dashed lines shown in Fig.~\\ref{fig:gap1s0} correspond to the fit functions. \n\nThe fit does reproduce the qualitative shape of the pairing gap. We take $k_2$,  displayed in column 5 of Table~\\ref{table:1S0}, as a measure of the gap closure density. The confidence interval associated to the fit is within $0.12$ fm$^{-1}$ (for the worst fit) from the central value. We note that there is a robust agreement and for all forces and many-body approaches the gap closure sits between $1.4$ and $1.5$ fm$^{-1}$. \n\nThis parametrization also allows a simple quantitative estimate of the gap maxima, and their location. For instance, the SRC maximum gap lies between $k_F=0.78$ (N3LO), $0.81$ (CDBonn) and $0.84$  fm$^{-1}$ (Av18), at a value between $\\Delta_\\text{max}^{^1S_0}=2.1$ MeV (Av18) and $2.3$ MeV (CDBonn and N3LO). Similarly, the SRC+LRC results peak between  $k_F=0.75$ (N3LO), $0.76$ (Av18) and $0.79$ fm$^{-1}$ (CDBonn) to maximum gaps of the order of $\\Delta_\\text{max}^{^1S_0}=1.8$ MeV for all three NN interactions.\n\nWe note that similar gaps have already been obtained in the literature. A comparison with the compilation of Ref.~\\cite{Ho2015} shows that our results are close to the Cao-Lombardo-Schuck (CLS)~\\cite{Cao2006} and Margueron-Sagawa-Hagino (MSH)~\\cite{Margueron2008} singlet gaps. MSH is fit to the CLS results, so the agreement between the two is not surprising. Our results include LRC in a way that is similar to CLS, but we note that the SRC physics is considered only at the $\\mathcal{Z}-$factor level in a Brueckner--Hartree--Fock calculation, and hence misses a complete description of hole-hole correlation effects.\n \n\\begin{table}[t!]\n\\caption{\\label{table:1S0}Parameters generated by a fit to the calculated gaps for the CDBonn, Av18, and N3LO interactions in the $^1$S$_0$ channel. For each interaction, the first line contains the results for the inclusion of SRC only, and the second the effect of both SRC and LRC.}\n\\centering \n\\begin{tabular}{cccccc} \n\\hline \\hline \nSinglet & $\\Delta_0$ & $k_0$ & $k_1$ & $k_2$ & $k_3$ \\\\\n & [MeV] & [fm$^{-1}$] & [fm$^{-2}$] & [fm$^{-1}$] & [fm$^{-2}$]  \\\\\n \\hline\nCDBonn SRC & 26.59 & 0.05 & 1.79 & 1.46 & 0.76 \\\\ \nCDBonn SRC+P & 18.18 & 0.05 & 1.39 & 1.45 & 0.81 \\\\ \nAv18 SRC & 32.22 & 0.04 & 3.46 & 1.40 & 0.43 \\\\ \nAv18 SRC+P & 14.07 & 0.04 & 1.00 & 1.44 & 0.78 \\\\ \nN3LO SRC & 7.77 & 0.00 & 0.56 & 1.49 & 0.38 \\\\ \nN3LO SRC+P & 5.85 & 0.00 & 0.46 & 1.48 & 0.42 \\\\ \n\\hline \n\\end{tabular} \n\\end{table}\n\nAll in all, the picture that arises for the singlet gaps provided by the three interactions is \\emph{remarkably robust}. The small variation of the result among NN forces provides an insightful constraint on the model dependence of the gap properties. In spite of their different short-range and (less relevant for neutron matter) tensor components, the 3 interactions considered here predict singlet gaps which are very close to each other. More importantly, the many-body effects are very similar in all cases. SRC deplete the gap by about $25 \\, \\%$. When LRC are included on top of SRC, the gap that remains is around $60 \\, \\%$  of the original BCS result for all forces. The effect of the correlation-induced gap quench in pairing properties, like the Cooper pair coherence length~\\cite{deBlasio1997}, or neutron star properties~\\cite{Ho2015}, go beyond the scope of the present paper and will be studied elsewhere.\n\nThe robustness of the singlet gap results with and without correlation effects is one of the major conclusions of this work. We note, however, that this result is not necessarily easily anticipated. The gap itself is a function of both Fermi momentum, $k_F$, and sp momentum, $k$. So far, we have focused on the values at the Fermi surface, $\\Delta^{JST}_L(k=k_F)$, but the momentum dependence provides useful information, too. In particular, as we are about to show, very different momentum dependences can lead to similar gaps at the Fermi surface. \n\nThe pairing gap is shown as a function of the momentum, $k$, for a variety of Fermi momenta in the fence plots of Fig.~\\ref{fig:gap1s0_2d}. Panels (a), (b) and (c) correspond to the three NN forces, CDBonn, Av18 and N3LO, respectively. We show results for both the BCS (dotted lines) and SRC-only (solid lines) approximations. In all cases, as expected in the singlet case, the gap peaks at zero momentum, subsequently decreases to negative values beyond the Fermi surface, and ultimately approaches zero asymptotically. In contrast to the results of N3LO in panel (c), both CDBonn and Av18 show a non-zero gap up to large values of momentum, $\\approx 6-7$ fm$^{-1}$. In principle, N3LO is regularized at a momentum scale of $500$ MeV~\\cite{Entem2003}, and hence it is not surprising to find that there is no support for a gap beyond $\\approx 3$ fm$^{-1}$. \n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{1S0_2d_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap1s0_2d}(Color online) Pairing gaps in the $^1$S$_0$ channel as a function of momentum for several Fermi momenta. The three panels correspond to the (a) CDBonn, (b) Av18 and (c) N3LO interactions. The BCS (dashed lines) and SRC (solid lines) results are presented. The symbols represent the corresponding gaps at the Fermi surface, as shown in Fig.~\\ref{fig:gap1s0}.}\n\\end{figure}\n\nThe significant differences in high-momentum components do not alter the low-momentum gap. The values at the Fermi surface are close to each other, and indeed the momentum dependence is qualitatively similar for all three forces up to $k\\approx2.5$ fm$^{-1}$. The general effect of SRC is to tame this momentum dependence. The maximum of the gap decreases, and its negative minimum becomes less negative. In accordance with some of the ideas mentioned above, the quench of the momentum dependence is relatively density- and momentum independent. \n\n\\subsection{Triplet pairing}\n\\label{sec:results3PF2}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{3PF2_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap3pf2}(Color online) The same as Fig.~\\ref{fig:gap1s0_2d} for the coupled $^3$PF$_2$ channel. The grey band on panel (c) indicates the region in which cut-off effects are relevant for the N3LO force. }\n\\end{figure}\n\nWhereas singlet pairing is active at relatively low densities and affects the dynamics of both the core and the crust, triplet pairing, concerning the coupled $^3$PF$_2$ channel, takes place within the neutron star core, at Fermi momenta  $k_F>1$ fm$^{-1}$~\\cite{Ho2015,Page2011}. Higher Fermi momenta imply that higher relative momenta are explored in the bare (or the effective) interaction. Because phase-shift equivalent interactions are constrained only at low energies and relative momenta, it is not surprising that the corresponding gaps show a larger dependence on the NN force. We show the triplet gaps for three NN forces in panels (a)-(c) of Fig.~\\ref{fig:gap3pf2}. We use a logarithmic scale to discriminate better the results of different many-body approximations. \n\nDifferences between NN forces are already significant at the BCS level (solid lines). All gaps open at Fermi momenta around $k_F \\approx 1.1$ fm$^{-1}$. Triplet gaps peak around $2$-$2.5$ fm$^{-1}$. CDBonn provides the largest maximum ($\\Delta^{^3PF_2}_\\textrm{max} = 0.86$ MeV at $k_F\\approx2.5$ fm$^{-1}$), followed by N3LO ($\\Delta^{^3PF_2}_\\textrm{max} = 0.77$ MeV at $2.2$ fm$^{-1}$) and Av18 ($\\Delta^{^3PF_2}_\\textrm{max} \\approx 0.64$ MeV at $k_F=2.1$ fm$^{-1}$). In turn, the gap closure happens at larger densities for interactions with larger gaps. For CDBonn, the closure occurs at a very high density, $k_F \\approx 3.64$ fm$^{-1}$, beyond the limit of Fig.~\\ref{fig:gap3pf2}. Av18 and N3LO, instead, provide BCS closure momenta between $2.9$ and $3$ fm$^{-1}$. \n\nN3LO results are sensitive to the cut-off regularization of the NN force at large Fermi momenta \\cite{Maurizio2014}. The grey band in panel (c) indicates the region in which regularization effects become observable. It is important to stress that the two similar gap closures for Av18 and N3LO are indicative of two very different physical effects. On the left (right) panels of Fig.~\\ref{fig:NNpots} we show density plots for the $^3$P$_2$ ($^3$D$_2$) matrix elements of the three NN forces. A gap can only appear if attractive matrix elements of $\\mathcal{V}$ are available. Consequently, N3LO can only sustain a gap up to about $\\approx 3$ fm$^{-1}$ because its matrix elements are regularized, and hence tend to zero, beyond this momentum. In contrast, Av18 does have non-zero, rather repulsive matrix elements beyond about $\\approx 4$ fm$^{-1}$. It is the appearance of these repulsive matrix elements that forbids pairing above the closure momentum for Av18. The top panels also illustrate why CDBonn sustains gaps up to larger Fermi momenta: the attractive nature of its $P-$wave matrix elements covers a large relative momentum region.\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=\\linewidth]{NNpots_J2.pdf}\n\\end{center}\n\\caption{\\label{fig:NNpots}(Color online) Left panels: matrix elements of NN forces in fm for the $^3$P$_2$ partial wave. Right panels: the same for the $^3$D$_2$ wave.}\n\\end{figure}\n\nIn contrast to the singlet case, the inclusion of LRC on top of the BCS result leads to higher gaps. This result is in line with the discussion of Sec.~\\ref{sec:LRC}, because in this channel LRC are attractive and anti-screen the interaction. The effect is rather significant, with the Av18 BCS+LRC gap becoming more than a factor of $2$ larger than the original BCS result. The density dependence is also modified by LRC.\n\nWhen SRC are considered (empty circles), all $^3$PF$_2$ gaps are strongly suppressed. All maximum triplet gaps fall below $0.15$ MeV: $0.04$ MeV for Av18, $0.05$ for CDBonn and about $0.1$ MeV for N3LO. The density dependence of these gaps is also different than the BCS prediction. We note that the data for the SRC and SRC+LRC is relatively noisy, due to the numerical limitations of the zero temperature extrapolation discussed in Appendix~\\ref{app:T0}. Nevertheless, the gross features of the SRC effects are rather clear. \n\nIf we take the $k_0$ parameter of the fits presented in Table~\\ref{table:3PF2} as an indication of gap opening, triplet gaps start at $k_F \\approx 1.1$ fm$^{-1}$ for all forces. The corresponding gap maxima occur at $k_F=1.77$, $1.79$ and $1.92$ fm$^{-1}$ for CDBonn, Av18 and N3LO, respectively. This is to be compared to the substantially larger BCS values of $\\approx 2-2.5$ fm$^{-1}$. Finally, the gap closure occurs at lower Fermi momenta for the SRC gaps (see column 5 in Table~\\ref{table:3PF2}) than the corresponding BCS results. N3LO predicts the larger closure at $k_F \\approx 2.8$ fm$^{-1}$, whereas the lowest closure is given by Av18 at $2.0$  fm$^{-1}$. All in all, SRC triplet gaps are smaller and exhibit a smaller density range than their corresponding BCS counterparts. \n\n\\begin{table}[t!]\n\\caption{\\label{table:3PF2}Parameters generated by a fit to the calculated gaps for the CDBonn, Av18 and N3LO interactions in the $^3$PF$_2$ channel. For each interaction, the first line contains the results for the inclusion of SRC only, and the second the effect of both SRC and LRC.}\n\\centering \n\\begin{tabular}{cccccc} \n\\hline \\hline \nTriplet & $\\Delta_0$ & $k_0$ & $k_1$ & $k_2$ & $k_3$ \\\\\n & [MeV] & [fm$^{-1}$] & [fm$^{-2}$] & [fm$^{-1}$] & [fm$^{-2}$]  \\\\\n \\hline\nCDBonn SRC & 0.60 & 1.01 & 2.21 & 2.33 & 0.43 \\\\ \nCDBonn SRC+P & 0.41 & 1.03 & 0.56 & 2.81 & 1.00 \\\\ \nAv18 SRC & 0.09 & 1.01 & 0.64 & 1.98 & 0.005 \\\\ \nAv18 SRC+P & 0.17 & 1.10 & 0.35 & 2.18 & 0.05 \\\\ \nN3LO SRC & 0.43 & 1.13 & 0.83 & 2.59 & 0.41 \\\\ \nN3LO SRC+P & 0.60 & 1.11 & 0.69 & 2.79 & 0.53 \\\\ \n\\hline \n\\end{tabular} \n\\end{table}\n\nLRC, when considered in addition to SRC (solid circles), do not change the picture qualitatively. In this channel, spin-density fluctuations lead to a more attractive pairing interaction, and hence LRC increase the triplet pairing gap by a small percentage. LRC+SRC start at similar Fermi momenta than their SRC-only counterparts. The maximum gap that is produced, however, is almost twice as large: $0.17$ MeV for N3LO, $0.11$ for CDBonn and $0.07$ MeV for Av18. The corresponding Fermi momentum maxima are similar, $k_F=1.86$, $1.79$ and $1.98$ fm$^{-1}$ for CDBonn, Av18 and N3LO, respectively. In keeping with the larger maxima, gap closures also occur at larger Fermi momenta, with two interactions (CDBonn and N3LO) closing the gap at $k_F=2.8$ fm$^{-1}$, and the remaining one, Av18, at $2.2$ fm$^{-1}$. \n\nAll in all, our prediction for triplet gaps are also reasonably robust, and independent of the NN force. Triplet gaps are always at the level of $10$s of keV, peaking at Fermi momenta in the region $1.7-2$ fm$^{-1}$ and closing earlier than the BCS predictions. To compare with previous literature in similar conditions, we consider the results of Dong \\emph{et al.} in Ref.~\\cite{Dong2013}. They use the Av18 interaction and parametrize SRC in terms of $\\mathcal{Z}-$ factors. The maximum triplet gap in that calculation is $0.045$ MeV at $k_F\\approx1.6$ fm$^{-1}$, in very good agreement to our SRC result ($0.04$ MeV at $1.79$ fm$^{-1}$). We note that none of the gaps considered in the recent astrophysically motivated compilation of Ref.~\\cite{Ho2015} resemble our predictions. However, the maximum gaps that we produce compare well with the inferred value of triplet critical temperatures of Ref.~\\cite{Page2011}, $T_c = 5 \\times 10^8 \\text{ K} \\Rightarrow \\Delta_\\text{max}^{^3PF_2} \\approx 0.08 \\text{ MeV}$.\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.6\\linewidth]{3PF2_2d_gaps.pdf}\n\\end{center}\n\\caption{\\label{fig:gap3pf2_2d}(Color online) The same as Fig.~\\ref{fig:gap1s0_2d} for the pairing gaps in the  $^3$PF$_2$ channel. Note the logarithmic scale on the $z$ axis.}\n\\end{figure}\n\nThe agreement between the different NN interactions is not trivial, as we have discussed in the singlet case. We have already illustrated the very different momentum-space structure of the triplet components of the NN forces in Fig.~\\ref{fig:NNpots}. Further, we present in Fig.~\\ref{fig:gap3pf2_2d} the momentum dependence of the triplet gap components for several Fermi momenta. We use again a logarithmic plot to distinguish better all the presented results. The BCS predictions (dotted lines) begin at zero, as expected from non-$S$-wave pairing, peak close to the Fermi surface, and subsequently decay. While CDBonn and Av18 show an inflection point at $k\\approx4$ fm$^{-1}$ and decay slowly with momentum, N3LO decays to zero for momenta well below this value. The corresponding SRC gaps show qualitatively similar behaviors and peaks, but are generally an order of magnitude smaller. There are differences in the density dependence, too. In any case, this figure illustrates the fact that, unlike the singlet case, triplet pairing gaps are more sensitive to the short-range (or, equivalently, high-momentum) components of the NN force.\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nWe have proposed a method that combines the SCGF framework for the treatment of SRC and FLT for the incorporation of LRC to the neutron matter pairing problem with NN interactions. This approach has two major ingredients. On the one hand, extrapolated normal ladder self-energies provide access to zero temperature spectral functions and, in turn, these give rise to depleted energy denominators that quench the gap. On the other, the pairing interaction is treated beyond the static, bare level. Screening is provided by considering vertices represented by Landau parameters, that couple to spin and density oscillations, whose collectivity is also controlled by the same Landau parameters. \n\nThe effect of SRC is to remove strength from the Fermi surface, thus necessarily reducing the gap. Compared to a quasi-particle, BCS-like picture, the energy denominators in the gap equation are quenched by a relatively momentum and density independent factor. In general, this is very different from the corresponding $\\mathcal{Z}$-factors associated to the ladder SCGF self-energy. This indicates that pairing calculations with $\\mathcal{Z}$-factors do not consider the full effect of SRC in a consistent way. \n\nWe take three major conclusions from our work. First, the universal effect of SRC is to deplete the gap substantially with respect to its BCS value in the whole momentum range. In the singlet channel this translates into a decrease in the Fermi surface gap of about $10-15 \\%$. In the triplet channel, the gaps were small, below $1$ MeV, at the BCS level. When SRC are considered, gaps reduce further to below $0.2$ MeV throughout a wide density regime. Second, whereas for the singlet case the effect of SRC is of the same order of the screening provided by LRC, in the triplet case LRC have an anti-screening effect that modestly increases the SRC determined gap for all three NN interactions. Third, the density dependence of triplet gaps is substantially modified by  SRC and LRC. We find gaps that open above $1.2$ fm$^{-1}$ and close below $2.6$ fm$^{-1}$ in all cases, with maxima that hardly reach $0.2$ MeV. Small triplet gaps of a similar size are commensurate with the Cassiopeia A rapid cooling scenario presented in Ref.~\\cite{Page2011}. \n\nWe have performed calculations with three very different, but phase-shift equivalent, interactions. For the singlet channel, our conclusions are extremely robust and independent of the NN force. Triplet gaps, in contrast, depend on the specifics of the interaction itself. CDBonn in general provides the largest and widest triplet gaps, whereas Av18 provides small and narrow pairing gaps. Cutoff effects artificially cut the triplet gaps of N3LO above $2.5$ fm$^{-1}$. We want to stress, however, that the SRC and LRC effects are universal and independent of the nuclear force under consideration. Work on incorporating three-nucleon forces in a consistent way, following Ref.~\\cite{Carbone2014}, is our first priority in the near future. In view of the impact of correlations on the BCS gaps on these three different interactions, we do not expect any qualitative differences with respect to these results. \n\nThe extension of the approach to asymmetric nuclear systems is also important~\\cite{Alm1993,Lombardo2001}. There is a small admixture of protons inside neutron stars, and their pairing is relevant for neutron star matter. In-medium SRC effects should be similar for proton pairing, and the suppression in the proton channel might have consequences for neutron star cooling. Pairing at finite momentum is also a relevant physical phenomena, particularly since it can lead to different pairing phases~\\cite{Stein2014}. The interplay of correlation and finite momentum effects will necessarily lead to a change in the phase diagram with respect to BCS results.\n\nThese calculations represent a first controlled step towards a full treatment of superfluidity within the Green's function formalism. At the SRC level, our treatment does not allow for the superfluid phase to feed back into the determination of the normal propagators. While feedback effects will be small, the reformulation of the problem in a Gorkov context would avoid the need of extrapolations from finite temperature. Such a self-consistent treatment of the ladder approximation in the pairing phase has never been implemented to our knowledge. At the LRC level, consistency at the Landau parameter level could provide small, quantitative differences in our results. Furthermore, the full spin dependence of the effective interaction, beyond the traditional Landau parameters~\\cite{Schwenk2004}, could have an impact on pairing gaps. Finally, the inclusion of polarization effects beyond the low-momentum transfer limit is an interesting, if computationally expensive, possibility.\n\n\\appendix\n\n\\section{Numerical treatment of the temperature extrapolation}\n\\label{app:T0}\nFor a given density, ladder self-energy calculations are typically performed for a set of $N_T\\approx 3$ to $10$ temperatures. The degeneracy parameter, $\\zeta = \\frac{T}{\\epsilon_F}$, with $\\epsilon_F$ the non-interacting Fermi energy, is a proxy for temperature in Fermi gases and is a natural dimensionless extrapolation parameter, in accordance to the Sommerfeld expansion \\cite{Ashcroft1976}. At each $\\zeta$, the real and imaginary parts of the self energy are stored as arrays in energy and momentum space. Typically, between $4000$ to $11000$ energies are needed, whereas we work with a fixed set of $70$ points in the momentum mesh. The self-energy is fit by a polynomial function of $\\zeta$,\n$ \\Sigma(k,\\omega; \\zeta) = \\sum_{l=0}^{L} a_l(k,\\omega) \\zeta ^{2l} \\, ,$\n in a window of $\\zeta$ values. For a given density, we take an upper limit of $\\zeta \\approx 1$ and a lower limit of $\\zeta  \\gtrsim 0.07$ (as long as the pairing instability does not set in). This ensures that the finite temperature data is neither thermally dominated ($\\zeta \\gg 1$) nor insensitive to thermal effects ($\\zeta \\ll 1$). Fig.~\\ref{fig:data} provides an illustration of the density and temperature mesh that we have used for the extrapolations with Av18.\n \n \\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[width=0.8\\linewidth]{extrap.pdf}\n\\end{center}\n\\caption{\\label{fig:data}(Color online) Each point in this plot corresponds to a density and temperature where ladder self-energies have been computed. Finite temperature points are used to extrapolate to zero temperature.}\n\\end{figure}\n\nThe zero-temperature self-energy is the independent coefficient of the polynomial fit, $a_0(k,\\omega)$, although in principle the fit can also be used to compute self-energies at arbitrary temperatures. For practical purposes, the interpolation involves only even powers, $2l$. Close to the Fermi surface, the temperature dependence of the self-energy is indeed expected to be quadratic \\cite{Abrikosov1965}. However, numerically computed self-energies, particularly close to $\\omega=\\mu$, need not be soft, continuous functions of degeneracy, due to numerical noise. Consequently, a single fit might extrapolate quantities in an unphysical way. For this reason, we perform not only one, but a series of fits with different values of $L$, the maximum power of the polynomial. Generally, we go from $L=1$ (corresponding to a $T^2$ dependence) to about $L=4$, depending on the total number of temperatures available.  All polynomial fits are performed using a $\\chi^2$ minimization procedure, which helps in evening out any numerical noise.\n \nIn the implementation, we extrapolate separately the imaginary and the real parts of the self-energy. Pairing is sensitive to the properties of $\\Sigma$ close to the Fermi energy. This is where the temperature dependence is more difficult to capture with fits. For a given polynomial order, $L$, we therefore allow for two different options. We either take the extrapolated $\\text{Im} \\Sigma$ as face value ($\\text{Im} \\Sigma \\le 0$ is imposed throughout, though) or we allow for a second option, where we match $\\text{Im} \\Sigma$ to the analytic function:\n\n", "index": 37, "text": "\\begin{align}\n\\text{Im} \\Sigma(k,\\omega\\approx\\mu;T=0) \\approx a_k (\\omega - \\mu)^2 e^{ -b_k (\\omega - \\mu) }\n\\label{eq:match}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{Im}\\Sigma(k,\\omega\\approx\\mu;T=0)\\approx a_{k}(\\omega-\\mu)^%&#10;{2}e^{-b_{k}(\\omega-\\mu)}\" display=\"inline\"><mrow><mtext>Im</mtext><mi mathvariant=\"normal\">Σ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>ω</mi><mo>≈</mo><mi>μ</mi><mo>;</mo><mi>T</mi><mo>=</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>≈</mo><msub><mi>a</mi><mi>k</mi></msub><msup><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo>-</mo><mi>μ</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>b</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ω</mi><mo>-</mo><mi>μ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nto estimate the missing strength at a given momentum, $\\varsigma_k$. The origin of this missing strength lies on the finite meshes in the calculation, and the difficulty of keeping track of narrow structures in energy space.\nThe missing strength correction in our ladder calculations is of the order of less than one percent away from the Fermi surface. $\\varsigma_k$ is generally largest ($50\\,\\%$ or above) for momenta which are within $2-3\\,\\%$ of the Fermi surface. Hence, the energy denominator only needs corrections in the close vicinity of the Fermi surface. We implement this correction by means of the replacement,\n\n", "itemtype": "equation", "pos": 77007, "prevtext": "\nin the vicinity of the Fermi energy. This has the correct quadratic dependence in  energy of a normal Fermi liquid \\cite{Luttinger1961}. The exponential factor allows for a certain degree of asymmetry below and above the Fermi surface, which we find to be essential in order to match the numerical self-energies. This function is matched to the self-energy in a given range of energies, which is different for every momentum, $k$. \n\nWith access to the $T=0$ self-energies and spectral functions, one can compute several zero temperature properties from the microscopic properties. For instance, the energy per particle, $\\frac{E}{A}$, is obtained from the Koltun sum-rule at zero temperature \\cite{Dickhoff08}. Alternatively, the finite temperature SCGF calculations yield a set of energies which can independently be extrapolated to zero temperature using a polynomial fit. For simplicity, we take the same $L$ in the fit of this macroscopically determined data and in that of the associated self-energy. \n\nA good extrapolation procedure for the self-energy should ensure consistency between the micro- and the macroscopic results. In the example above, we would like the Koltun sum-rule at zero temperature to yield the same energy per particle than the extrapolated value from finite temperature data. We therefore construct a quality measure that quantifies the distance between extrapolations of micro- and macroscopic evaluations for some relevant data. The measure is built from a weighted sum of the relative differences between microscopic and macroscopic determinations of density, chemical potentials, energies, kinetic energies and $Z$-factors. The latter is determined independently from the discontinuity of the momentum distribution at the Fermi surface and from the on-shell derivatives of self-energies. The polynomial with $L$ that minimizes the quality measure, whether matched or not according to Eq.~(\\ref{eq:match}), is used in the extrapolation. This guarantees that the associated self-energy is consistent with both the microscopic and the macroscopic pseudo-data. The extrapolation procedure is automated, in an effort to avoid biases.\n\nBelow $T_c$ and as the temperature approaches zero asymptotically, the normal spectral function becomes an increasingly sharp function of energy close to the Fermi surface. It is important to keep track of these narrow structures in the calculation of the momentum distribution, $n(k)$. For a given momentum, $k$, the missing strength due to uncaptured narrow peaks can be estimated from the energy spectral function sum-rule \\cite{Dickhoff08}. Deviations from $1$ indicate missing strength contributions, which we use to correct the momentum distribution. We include a quasi-particle term that is weighted to account for the missing strength. We have tested this procedure against an independent determination of the momentum distribution, based on the derivatives of the zero-temperature self-energy \\cite{Rios2009}, and we have found quantitative agreement. \n\nMissing strength corrections are also relevant for the double convolution energy denominator of Eq.~(\\ref{eq:chi}). We use the sum-rule of the lowest-order two-particle propagator,\n\n", "index": 39, "text": "\\begin{align}\n\\int \\frac{\\text{d}\\Omega}{2 \\pi} \\mathcal{G}_{II}^0(k,k'=k,\\Omega) =1 - 2 n(k) \\, ,\n \\label{eq:sumrule}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\int\\frac{\\text{d}\\Omega}{2\\pi}\\mathcal{G}_{II}^{0}(k,k^{\\prime}=%&#10;k,\\Omega)=1-2n(k)\\,,\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mo largeop=\"true\" symmetric=\"true\">∫</mo></mstyle><mstyle displaystyle=\"true\"><mfrac><mrow><mtext>d</mtext><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mrow><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mn>0</mn></msubsup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><msup><mi>k</mi><mo>′</mo></msup><mo>=</mo><mi>k</mi><mo>,</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mn>1</mn><mo>-</mo><mn>2</mn><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01600.tex", "nexttext": "\nThe resulting energy denominators are continuous, soft functions of momentum as a function of momentum (see Panel (b) in Fig.~\\ref{fig:mom_chi}) and in a wide range of densities (see panels (d)-(f) in Fig.~\\ref{fig:chi_den}). \n\n\\section{Fits}\n\\label{app:fits}\n\nThe parameters for the gap fits of Eq.~(\\ref{eq:gapfit}) in Tables~\\ref{table:1S0} and \\ref{table:3PF2} have been obtained from a robust bisquare non-linear least-square fit. The function is fit to all non-zero gap data plus the first zero value after the gap closure. For singlet gaps, in addition to the data points of Fig.~\\ref{fig:gap1s0}, we have supplemented the fit with a point with zero gap at zero Fermi momentum. Other than the N3LO results, the fitting algorithm prefers a gap opening at $k_0=0.04-0.05$ fm$^{-1}$. No additional points were given in the triplet channel. The goodness of fit as measured by the $r^2$ coefficient of determination, which is above $0.99$ for singlet fits. Triplet fits, in contrast, have $r^2$ ranging between $0.76$ for CDBonn, $0.83$ for Av18 and $0.97$ for N3LO. \n\n\\begin{acknowledgments}\nThis material is based upon work supported by the U.S. National Science Foundation under grant PHY-1304242; \nby the Consolider Ingenio 2010 Programme CPAN CSD2007-00042, Grant No. FIS2014-54672-P from MICINN (Spain), and Grant No. 2014SGR-401 from Generalitat de Catalunya (Spain); \nby STFC, through Grants No. ST/I005528/1, ST/L005816/1 and ST/J000051; \nand by NewCompstar, COST Action MP1304.\n\\end{acknowledgments}\n\n\\bibliographystyle{apsrev4-1}\n\\bibliography{biblio}\n\n\n", "itemtype": "equation", "pos": 77763, "prevtext": "\nto estimate the missing strength at a given momentum, $\\varsigma_k$. The origin of this missing strength lies on the finite meshes in the calculation, and the difficulty of keeping track of narrow structures in energy space.\nThe missing strength correction in our ladder calculations is of the order of less than one percent away from the Fermi surface. $\\varsigma_k$ is generally largest ($50\\,\\%$ or above) for momenta which are within $2-3\\,\\%$ of the Fermi surface. Hence, the energy denominator only needs corrections in the close vicinity of the Fermi surface. We implement this correction by means of the replacement,\n\n", "index": 41, "text": "\\begin{align}\n \\frac{1}{2 \\chi_c(k)} \\to  \\frac{1}{2 \\chi(k)} + \\frac{\\varsigma_k}{2 (\\varepsilon_k - \\mu)} \\, .\n \\label{eq:correction}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1}{2\\chi_{c}(k)}\\to\\frac{1}{2\\chi(k)}+\\frac{\\varsigma_{k}}{%&#10;2(\\varepsilon_{k}-\\mu)}\\,.\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><msub><mi>χ</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>→</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>+</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><msub><mi>ς</mi><mi>k</mi></msub><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ε</mi><mi>k</mi></msub><mo>-</mo><mi>μ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]