[{"file": "1601.03788.tex", "nexttext": "\n${U}_{l,k}$ and $\\tilde{U}_{l,k}$ are the inverted value and synthetic truth for unknown variable $U$. The second norm at time step $l$ can be computed with:\n\n\n", "itemtype": "equation", "pos": 7815, "prevtext": "\n\\begin{frontmatter}\n\n\\title{TSUFLIND-EnKF inversion model applied to tsunami deposits for estimation of transient flow depth and speed with quantified uncertainties}\n\\author[geovt]{Hui Tang\\corref{cor1}}\n\\ead{tanghui@vt.edu}\n\\author[aoevt]{Jianxun Wang}\n\\author[geovt]{Robert Weiss}\n\\author[aoevt]{Heng Xiao}\n\\cortext[cor1]{Corresponding author}\n\\address[geovt]{Department of Geoscience, Virginia Polytechnic State University, United States}\n\\address[aoevt]{Department of Aerospace and Ocean Engineering, Virginia Polytechnic State University, United States}\n\n\\begin{abstract}\n\nTsunami deposits are recordings of tsunami events that contain information about flow conditions. Deciphering quantitative information from tsunami deposits is especially important for analyzing paleo-tsunami events in which deposits comprise the only leftover physical evidence. The physical meaning of the deciphered quantities depends on the physical assumptions that are applied. The aim of our study is to estimate the characteristics of tsunamis and quantify the errors and uncertainties that inherent within them. To achieve this goal, we apply the TSUFLIND-EnKF inversion model to study the deposition of an idealized deposit created by a single tsunami wave and one real case from 2004 India ocean tsunami. TSUFLIND-EnKF model combines TSUFLIND for the deposition module with the Ensemble Kalman Filtering (EnKF) method. In our modeling, we assume that grain-size distribution and thickness from the idealized deposits at different depths can be used as an observational variable. Our tentative results indicate that sampling methods and sampling frequencies of tsunami deposits influence not only the magnitude of the inverted variables, but also their errors and uncertainties. An interesting result of our technique is that a larger number of samples from a given tsunami deposit does not automatically mean that the inversion results are more robust with smaller errors and decreased uncertainties.\n\\end{abstract}\n\n\\begin{keyword}\nTsunami \\sep Tsunami sediment \\sep Sediment transport\\sep Flow depth \\sep Flow speed \\sep Inversion Model \\sep EnKF method\n\\end{keyword}\n\\end{frontmatter}\n\n\\section{Introduction}\nThe 2004 Indian Ocean tsunami killed over two hundred thousand people, left more than one million homeless and is the most destructive tsunami in human history so far \\citep{JGRF:JGRF786}. However, as the population in coastal area increase quickly, future tsunamis can cause similar disasters or worse in the future \\citep{Jaffe201290}. Since the first documentation of tsunami sediment research in the 1950s, many examples of modern and paleotsunami deposits have been reported \\citep{Shepard1950,Goff2011107,Goff201270,Sugawara2014295}. Tsunami deposits play an important role not only in interpreting tsunami hydraulics, but also in tsunami hazard assessments \\citep{Jaffe2007347,EOST:EOST16250,Goto201146,huitang2015}, as tsunami deposits are the only leftover physical evidence.\n\nThere are two major ways to study tsunami deposit by using numerical models: forward and inversion models. Unfortunately, due to the lack of pretsunami topography data, it is difficult to use forward models to study paleo tsunami. Inversion models become a very powerful and useful tool to identify the characteristics of paleo tsunami. The most prominent models for tsunami flow inversion are: Mooreâ\u0080\u0099s advection model \\citep{Moore2007336}, Smith's model \\citep{Smith2007362}, Soulsbyâ\u0080\u0099s model \\citep{sousby2007}, TsuSedMod model \\citep{Jaffe2007347} and TSUFLIND model \\citep{huitang2015}. Many difficulties still remain in achieving accurate inversion results because of the intrinsic errors and uncertainties within tsunami deposit data set from tsunami field survey. A new method which can quantity the uncertainties will hold great promise for deciphering useful information from tsunami deposits \\citep[see][]{Sugawara2014295,huitang2015}. Therefore, \\citet{jianxun2015} propose a forward-inversion model framework (TSUFLIND-EnKF model) to estimate the flow condition and quantify the uncertainties in these estimations. The sedimentation module from TSUFLIND is employed for the deposition and the EnkF method is used for inverting hydrodynamics in TSUFLIND-EnKF model. In this study, we apply TSUFLIND-EnKF model and study the uncertainties in the final inversion results.\n\n\\section{Theoretical  Background}\n\nA correctly defined inversion model consists of a forward model, inversion method and observational data. TSUFLIND-EnKF model's forward model is based on a simplified version of the TSUFLIND model. The EnKF method is used as an inversion technique. We employ the sediment flux as observational data to connect the forward model with the inversion method. \n\n\\subsection{Forward Model}\n\nIn the TSUFLIND-EnKF model, TSUFLIND works as a forward model. TSUFLIND mainly incorporates three inversion models and adds some new modules to simulate tsunami deposit formation and estimate tsunami flow condition \\citep{huitang2015}. The forward model starts with computing the grain-size distribution and sediment concentration. The grain-size distribution is assumed to be log-normal and characterized by the mean grain size, largest grain size and smallest grain size. The method employed to calculate the suspended sediment concentration is based on \\citet{Madsen19931303}, and \\citet{Jaffe2007347}. Another important assumption is that settling velocity is constant for given grain size during deposition process. The bed sediment concentration is computed with \\citet{Madsen19931303}. The sediment flux at time step can be computed from average sediment concentration of grain size class at each water column layer. For more details about the forward model, we refer to \\citet{jianxun2015} and appendix A. \n\n\\subsection{EnKF Method}\nThe Ensemble Kalman Filtering (EnKF) method, firstly proposed by \\citet{evensen1994}, is an extension of the Kalman Filtering method for solving nonlinear problems and widely used in weather prediction \\citep{chui1999kalman}. As an inversion method, the EnKF method consists of three steps: initialization, propagation and analysis. Figure 1 depicts the flowchart outlining how this process works. \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=0.8\\textwidth]{Figure1.pdf}\n  \\caption{Flowchart for the EnKF method's iterative scheme to estimate tsunami flow parameters.}\n\\end{figure}\n\nIn the initial phase of the inversion process, we use the latin hypercube sampling method (LHS) to sample some initial ensemble for unknown variables based on prior. The LHS method is a series of statistical method for generating samples for parameters, which was described by \\citet{mckey1979}. The unknown variables and observational variable are combined in an augmented state. Propagation is predicting the sediment flux based on the shear velocity and water depth with forward model. Propagation is performed for every $\\Delta N$ forward model time steps which $\\Delta N$ is the number of time steps between two data assimilation operations. After that, Kalman gain matrix can be calculated in the analysis part. Finally, the augmented state is renewed based on the observational data and the Kalman gain matrix. The propagation and analysis step will be repeated for next data assimilation operation to combine with observational data. The total number of operations depends on how much observational data is available. For more details about the EnKF method in TSUFLIND-EnKF model, we refer to \\citet{jianxun2015} and appendix B.\n\n\\subsection{Inversion Result Evaluation and Error Model}\nWe utilize the relative error and second norm, $L_2$, to evaluate the inversion result and quantify inference error. For each ensemble, the inference error at time step $l$ is given by:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\varepsilon_{k}^l = \\frac{{U}_{l,k}-\\tilde{U}_{l,k}}{\\tilde{U}_{l,k}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\varepsilon_{k}^{l}=\\frac{{U}_{l,k}-\\tilde{U}_{l,k}}{\\tilde{U}_{l,k}}\" display=\"block\"><mrow><msubsup><mi>ε</mi><mi>k</mi><mi>l</mi></msubsup><mo>=</mo><mfrac><mrow><msub><mi>U</mi><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub></mrow><msub><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nwhere $M$ is the number of ensemble. \n\nAll experimental and modeled results, no matter how carefully measured and calculated, contain some errors. In order to study the influence of errors on the final inversion results, we propose a simplified error model that includes observational and model errors. In terms of observational error, there are two major sources: systematic error, $\\beta$, and measurement error. Here we assume that the measurement error is equal to the measurement greatest possible error, $\\epsilon$. The measurement's greatest possible error is usually half of the smallest scale of the experiment equipment. The observational error for the sediment flux is a relative error:\n\n\n", "itemtype": "equation", "pos": 8076, "prevtext": "\n${U}_{l,k}$ and $\\tilde{U}_{l,k}$ are the inverted value and synthetic truth for unknown variable $U$. The second norm at time step $l$ can be computed with:\n\n\n", "index": 3, "text": "\\begin{equation}\n{L_{2}^l}=\\sqrt{\\frac{\\sum_{k=1}^{M}{\\Big (\\frac{U_{l,k}-\\tilde{U}_{l,k}}{\\tilde{U}_{l,k}}\\Big)^2}}{M}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{L_{2}^{l}}=\\sqrt{\\frac{\\sum_{k=1}^{M}{\\Big{(}\\frac{U_{l,k}-\\tilde{U}_{l,k}}{%&#10;\\tilde{U}_{l,k}}\\Big{)}^{2}}}{M}}\" display=\"block\"><mrow><msubsup><mi>L</mi><mn>2</mn><mi>l</mi></msubsup><mo>=</mo><msqrt><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></msubsup><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mfrac><mrow><msub><mi>U</mi><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub></mrow><msub><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>l</mi><mo>,</mo><mi>k</mi></mrow></msub></mfrac><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mn>2</mn></msup></mrow><mi>M</mi></mfrac></msqrt></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nin which $\\tilde{m}_{l}$ is the true mass of the tsunami sediment for sample $l$ in given location. Also, the entire sediment is uniformly divided to several sediment samples to simplify the framework, therefore we also can write $E_{re}$ as:\n\n\n", "itemtype": "equation", "pos": 8911, "prevtext": "\nwhere $M$ is the number of ensemble. \n\nAll experimental and modeled results, no matter how carefully measured and calculated, contain some errors. In order to study the influence of errors on the final inversion results, we propose a simplified error model that includes observational and model errors. In terms of observational error, there are two major sources: systematic error, $\\beta$, and measurement error. Here we assume that the measurement error is equal to the measurement greatest possible error, $\\epsilon$. The measurement's greatest possible error is usually half of the smallest scale of the experiment equipment. The observational error for the sediment flux is a relative error:\n\n\n", "index": 5, "text": "\\begin{equation}\n{E_{re}} = \\frac{\\beta \\cdot \\tilde{m}_{l}+\\epsilon}{\\tilde{m}_{l}}\\cdot 100\\%\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{E_{re}}=\\frac{\\beta\\cdot\\tilde{m}_{l}+\\epsilon}{\\tilde{m}_{l}}\\cdot 100\\%\" display=\"block\"><mrow><msub><mi>E</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><mrow><mi>β</mi><mo>⋅</mo><msub><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover><mi>l</mi></msub></mrow><mo>+</mo><mi>ϵ</mi></mrow><msub><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover><mi>l</mi></msub></mfrac><mo>⋅</mo><mrow><mn>100</mn><mo lspace=\"0pt\" rspace=\"3.5pt\">%</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nin which $m$ is the total mass of the tsunami sediment and $N_l$ represents the total number of sediment samples. It should be noted that error in the observation data increases with an increasing number of sediment samples. The model error is difficult to estimate, however, a constructed model error is applied.\n\n\\section{Results}\n\\subsection{Parameter Study}\nThe TSUFLIND-EnKF requires five inputs: number of ensemble, mean of ensemble, range of ensemble, type of unknown parameter (shear velocity and water depth) and of unknown parameters (uniform distribution or normal distribution). TSUFLIND-EnKF's sensitivity to these inputs is tested in a parameter study. Based on the parameter study, we hope to get some general conclusions about both TSUFLIND-EnKF model and inversion theory for tsunami research community.  The setting for all parameter studies can be found in Table 1. The effects of errors will be examined in detail in the section 3.2.\n\n\\begin{table}\n\\begin{threeparttable}\n\\caption{Physical and computational parameters used for the parameter study.}\n\\centering\n\\begin{adjustbox}{max width=\\textwidth}\n\\begin{tabular}{l|c|c|c|c|c}\n  \\hline\n  \\textbf{Parameters}   & \\textbf{Case 1}  &  \\textbf{Case 2}  &   \\textbf{Case 3} & \\textbf{Case 4} & \\textbf{Case 5} \\\\ \n  \\hline\n  Inferred parameters &   $u_*$        & $u_*$ & $u_*$  & $u_*$ & $u_*$ and $h$         \\\\ \n    \\hline\n  Grain size $\\phi$ $(= - \\log_2 [D/D_\\textrm{ref}])$ &   \\multicolumn{5}{c}{$0-3.25$}  \\\\\n  $\\Delta t$ & \\multicolumn{5}{c}{0.5~s} \\\\\n  Data assimilation interval $\\Delta N$ & \\multicolumn{5}{c}{10} \\\\\n  std.~$\\sigma_i$ of observation error  &\n  \\multicolumn{5}{c}{$\\epsilon$ + 0.01$\\tilde{\\zeta}_i$} \\\\ \n   \\cline{2-6}\n  Number of samples $M$ & 10-3000 & \\multicolumn{4}{c}{1000} \\\\\n\\cline{2-6}\nPrior of unknown parameter& \\multicolumn{3}{c|}{Uniform} & Uniform/Normal & Uniform \\\\\n  \\hline\n  Synthetic truth $\\tilde{u}_*$ for $u_*$ $ \\mathrm{ ms}^{-1}$& \\multicolumn{5}{c}{$0.5$} \\\\\n   \\cline{2-6}\n    Mean of ensemble for $u_*$ ($\\mathrm{ ms}^{-1}$) & 0.8 &0.25-1.0 &\\multicolumn{3}{c}{0.8} \\\\\n     \\cline{2-6}\n  Range of ensemble for $u_*$ ($\\mathrm{ ms}^{-1}$) & \\multicolumn{2}{c|}{0.2} & 0.1-1.6 & 0.8/- & 0.8 \\\\\n\n \n  \\hline\n  Synthetic truth  $\\tilde{h}$ for $h$ (m)&  \\multicolumn{5}{c}{3}\\\\\n  \\cline{2-6}\n  Range of ensemble for $h$ (m)& \\multicolumn{4}{c|}{$-$} & 5\\\\\n  Mean   $\\bar{h}^0$ of ensemble for $h$ (m) &  \\multicolumn{4}{c|}{$-$}  &   5 \\\\\n\n  \\hline\n\\end{tabular}\n\\end{adjustbox}\n\\end{threeparttable}\n\\end{table}\nThe sensitivity of the inversion result to the number of ensemble is tested by changing the number from 10 to 3000. The difference between various ensemble number's inference error $L_2$ norm decreases with more data assimilation operations taken (Fig. 2a). An increasing number of ensemble from 10 to 40 causes a decreasing the final inference error by 59\\% (Fig. 2b). A decrease in the number of ensemble from 3000 to 40 results in the reduction of the final inference error by 63\\% (Fig. 2b). \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure2.pdf}\n  \\caption{The relative inference error $L_2$ norm versus time steps for the number of ensemble from 10 to 3000. (a): The $L_2$ norm of inference error as a function of the time step and number of ensemble. The number of ensemble changes from 50 to 3000. (b): The final inference error $L_2$ norm as a function of the number of ensemble from 10 to 3000.}\n\\end{figure}\n\nIn order to study the influence of the mean value of ensemble, the mean value is adjusted from 0.25 to 1.0 $\\text{ms}^{-1}$.  Figure 3a shows that the mean of ensemble will strongly change the inversion process pattern during inversion. However, the final inversion result is not a strong function of the mean value (Fig. 3b). For example, a 0.4 $\\text{ms}^{-1}$ adjustment in the mean value from 0.4 $\\text{ms}^{-1}$ to 0.8 $\\text{ms}^{-1}$ results in only a 5\\% change in the final inference error. The data resulting from a significant overestimation usually is superior to that of a dramatic underestimation. For instance, the inference error for the initial mean of 0.25 $\\text{ms}^{-1}$ is 300\\% larger than that from 0.75 $\\text{ms}^{-1}$ (Fig. 3b). Also, the result distributions change from underestimation to slight overestimation when the mean of ensemble changes from 0.3 $\\text{ms}^{-1}$ to 0.8 $\\text{ms}^{-1}$ (Fig. 3c).\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure3.pdf}\n  \\caption{The shear velocity and $L_2$ norm of inference error as a function of the mean of ensemble ranging from 0.25 to 1.0 $\\text{ms}^{-1}$. (a): The calculated shear velocity versus time step from 0 to 200 and mean of ensemble ranging from 0.3 to 0.8 $\\text{ms}^{-1}$; The black dashed line is the averaged value of shear velocity for each time step. The Red dashed line is the synthetic truth for these cases. (b): The inference error $L_2$ norm of final inversion results versus mean of ensemble 0.25-1.0 $\\text{ms}^{-1}$. (c): The final inversion result distributions for different mean of ensemble from 0.3 to 0.8 $\\text{ms}^{-1}$. The Red dashed line is the synthetic truth for these cases.}\n\\end{figure}\n\nThe value range of ensemble will change the number of data assimilation operations needed to make results converge. Usually, the larger range requires more operations to convergent (Fig. 4a). The variance of the final inference error norm for range changing from 0.2 $\\text{ms}^{-1}$ to 1.6 $\\text{ms}^{-1}$ is only 9\\% based on Fig. 4b. For the final result distribution, the final results follow a similar distribution pattern (Fig. 4c), which also indicates that TSUFLIND-EnKF is not sensitive to the range of ensemble unless the true value is not within the ensemble area.\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure4.pdf}\n  \\caption{The shear velocity and inference error $L_2$ norm as a function of the range of ensemble ranging from 0.1 to 1.6 $\\text{ms}^{-1}$. (a): The calculated shear velocity versus time step from 0 to 200 and range of ensemble ranging from 0.2 to 1.2 $\\text{ms}^{-1}$; The black dashed line is the averaged value of shear velocity for each time step. The Red dashed line is the synthetic truth for these cases. (b): The inference error $L_2$ norm of final inversion results versus range of ensemble 0.1-1.6 $\\text{ms}^{-1}$. (c): The final inversion result distributions for different range of ensemble from 0.3 to 0.8 $\\text{ms}^{-1}$. The Red dashed line is the synthetic truth for these cases.}\n\\end{figure}\n\nThere are two major type of distribution for unknown parameter in TSUFLIND-EnKF: uniform distribution and norm distribution. We set up the model as shear velocity with 0.8 $\\text{ms}^{-1}$ mean value, 0.8 $\\text{ms}^{-1}$ range and 1000 ensemble. The range of ensemble for the uniform distribution is exactly from 0.4 to 1.2 $\\text{ms}^{-1}$ (Fig. 5a). However, the normal distribution can only guarantee 68.2\\% samples in the range from 0.4 to 1.2 $\\text{ms}^{-1}$ (Fig. 5b). The distribution of unknown parameter strongly influences the inversion result distribution (Fig. 5c and 5d). The distribution has smaller interval in uniform distribution than normal distribution. However, the distribution of unknown does not influence the $L_2$ norm of the final inversion error significantly. The final $L_2$ norm by the normal distribution is only 9\\% larger than the uniform distribution. \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure5.pdf}\n  \\caption{Compare two different of unknown parameter's inversion processes and results. (a): Tsunami flow shear velocity estimates for each time step by uniform distribution; (b): The shear velocity estimates for each time step by norm distribution; (c): the shear velocity distributions for time step 0, 50, 100, 150 and final result by uniform distribution; (d): the shear velocity distributions for time step 0, 50, 100, 150 and final result by norm distribution.}\n\\end{figure}\n\nWe only calculate shear velocity for previous parameter study. As a part of parameter study, we explore TSUFLIND-EnKF's sensitivity to the choice of unknown parameter. We choose flow depth and shear velocity as unknown parameters. It should be noted that the shear velocity and water depth are inverted separately in the first two cases (Fig. 6a, 6c, 6e and 6f). The flow depth and shear velocity inversion results for the same initial condition are shown in Fig. 6e and 6f. The norm of final inference error for water depth is 16.2\\% larger than that for the shear velocity. In most real cases, both shear velocity and water depth are unknown. It should be noted that TSUFLIND-EnKF can estimate both water depth and shear velocity at the same time. In Figures 6b, 6d, 6g and 6h, the water depth and shear velocity are jointly inverted. The norm of final inference error for water depth is increased by 6\\% when the combination inversion is applied. The norm of final inference error for shear velocity by separation inversion is 12\\% smaller than that comes from combination inversion.\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure6.png}\n  \\caption{Compare two different unknown parameters inversion processes and results. (a)-(d): The inverted tsunami flow depths and shear velocities for each time step are indicated by the green area. The black dashed line is the average value of estimated unknown parameters. The red dashed line is the synthetic truth of estimated unknown parameters. (e)-(h): The water depth and shear velocity distributions for step 50, 100, 150 and final results. (a), (c), (e) and (f): Inverse water depth and shear velocity separately; (b), (d), (g) and (h): Inverse water depth and shear velocity together. }\n\\end{figure}\n\n\n\\subsection{Error Analysis}\n\nThe uncertainties of the inversion model arise from the fundamental theory employed and the observed data. We provide a systematic investigation of the uncertainty by varying the setting of observational data and the forward model. We anticipate a careful, but rigorous error analysis that can reveal important information and help to improve data collection during tsunami field survey.\n\nThis parameter study is carried by using an idealized tsunami deposit and provides the opportunity to study how observational and model errors influence the uncertainty of the final results. For this, it is assumed that all data from original idealized tsunami deposit and forward model are error free; the errors are added into the data manually. For Figures 7a and 7b, the model error is 1\\% and the observational error ranges from 0.1\\% to 30\\%. The $L_2$ norm  of final inference error only increases by 6\\%, when observational errors change from 0.1\\% to 5\\%. A change from 5\\% to 30\\% for the observational errors creates an obvious difference between these final reference error norms about 221.7\\% (Fig. 7b). The observational error is 1\\% and the model error changes from 0.1\\% to 30\\% in Fig. 7c and 7d. Based on Fig. 7a and 7c, it appears that the observational errors add more uncertainty to the inversion results than the model errors as long as both two types of errors are smaller than 10\\%. When  both model errors and observational errors are larger than 10\\%, both model errors and observational errors have a similar influence on the final inversion results. For the model error, the error norms of final inversion results decrease first and then increase again when the model error changes from 0.1\\% to 30\\% (Fig. 7d).\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure7.png}\n  \\caption{The $L_2$ norm of inference error as a function of time step and errors ranging from 0.1\\% to 30\\%. (a): The $L_2$ norm of inference error versus time step for observation error 0.1\\% to 30\\%. (b): The $L_2$ norm of inference error of final inversion results as a function of observation error from 0.1\\% to 30\\%. (c): The $L_2$ norm of inference error versus time step for model error 0.1\\% to 30\\%. (d): The $L_2$ norm of inference error of final inversion results as a function of model error from 0.1\\% to 30\\%.}\n\\end{figure}  \n\nEstimating sediment flux during tsunami is complicated due to large fluctuation of hydrodynamic forces during tsunami flooding. For most cases, the sediment flux can be estimated with the help of tsunami deposits. In here, we assume that the sediment flux can be calculated by the total tsunami deposit thickness, sampling frequency (the number of sediment layers) and grain-size distribution. For the all samples, it is assumed that the observational error is constant in each sample. The error analysis for this case is based on field data and real cases. The total systematic error ($\\beta$) and greatest possible errors ($\\epsilon$) for thickness measurement are set as 5\\% and 0.05 $\\mathrm{mm}$ respectively. The inference error of final inversion result is sensitive to the number of sediment samples (Fig. 8a and 8b). For example, for a 30-cm-thick deposit, the final inference error $L_2$ norm for water depth is about 0.083 for nine sediment layers and 0.0003 for eleven sediment layers (Fig. 8a). The final $L_2$ norm of inference error decreases first and then increases. Based on Fig. 8a and 8b, the best frequency of sampling for shear velocity is 9 and for water depth is 11. \n\n\\begin{figure}[h!]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure8.pdf}\n  \\caption{The final $L_2$ norm of inference error versus sample frequency and types of unknown parameters based on 30-cm-thick ideal tsunami deposit. (a): The final $L_2$ norm of inference error for water depth as a function of sample frequency from 6 to 30; (b): The final $L_2$ norm of inference error for shear velocity as a function of sample frequency from 6 to 30.}\n\\end{figure}\n\n\\subsection{Application and A Real Case}\n\nIn this section, we outline two applications based on real tsunami deposit. The data in this test case is from the coastal area in the vicinity of Ranganathapuram formed by 2004 India ocean tsunami \\citep{Bahlburg2007}. They will be used to design the sample frequency during the field work (Fig 9a). We assume we can take sample every 2 cm, 2.5 cm, 3 cm, 3.5 cm, 4 cm, 4.5 cm to 5 cm in vertical direction, which controls the frequency of sampling for each sample location along the slope. When the sediment thickness is not thick enough for one sediment sample, these sediments are sampled as one. Based on the field data (thickness and grain size range) and sample frequency, we can carry out the similar error analysis shown in Fig. 8 to estimate the sample frequency with smallest inference error. Figure 9a shows the tsunami deposit thickness and the best frequency of sampling along the slope for inversion shear velocity. When tsunami deposit at 50 m from inland is taken five samples in vertical direction,  which suggests the sediment should be sampled every 2 cm, this location will get the lowest inference error. At the sediment extension, all tsunami sediments are sampled as one layer, so the inference error is a constant at this location. \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1.0\\textwidth]{Figure9.pdf}\n  \\caption{TSUFLIND-EnKF application cases for  2004 India ocean tsunami. (a): Sediment thickness and suggested sample number along the section in the vicinity of Ranganathapuram after 2004 India tsunami. The blue line is sediment thickness from field data. The red line with dot is the best sample number ; (b): The topography of Ranganathapuram cross section and sample location for test case. }\n\\end{figure}\n\nIn here, we apply TSUFLIND-EnKF to inverse shear velocity and flow depth and demonstrate the capability of our framework based on the best sample frequency. Then we calculate depth-averaged velocity and Froude number by using Eqs. A3 and A4. We choose four deposit samples from Ranganathapuram formed by 2004 Indian ocean tsunami (Fig 9b, $I$, $II$,$III$,$IV$). The sediment thickness for these four samples are 0.21 m, 0.12 m, 0.10 m and 0.09 m, respectively. The water depth and shear velocity are inverted together. For this test case, data assimilation operation is applied every ten time steps of the forward model. Figure 10 depicts the inversion results for the shear velocity, water depth, depth-averaged velocity and Froude number at four sampled locations along the slope. Unlike previous inversion models, TSUFLIND-EnKF presents the final inversion results as a probability density distribution function instead of only one value or range of values (Fig. 10). For the shear velocity, sample $I$ and $II$ have a similar range and distribution with a mean value of 0.159 $\\text{ms}^{-1}$ (Fig 10 $I_a$ and $II_a$). And then shear velocity decrease to around 0.149 $\\text{ms}^{-1}$ (Fig 10 $III_a$ and $IV_a$). The water depth decreases from the mean value of 2.905 to 2.502 m (Fig 10 $I_b$ to $IV_b$). The depth-averaged velocity has a similar pattern: decrease from 5.0 to 4.65 $\\text{ms}^{-1}$. The mean Froude number does not change significantly in this case, which is around 0.94. \n\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1.1\\textwidth]{Figure10.png}\n  \\caption{Inversion results for 2004 India ocean tsunami case from TSUFLIND-EnKF. $I_a$-$IV_a$: Estimates of shear velocity, $u_*$, for location $I$ to $IV$ in Fig 9b; $I_b$-$IV_b$: inversion results of water depth, $H$, for location $I$ to $IV$ in Fig 9b; $I_c$-$IV_c$: inverted depth-averaged velocity, $U$, for location $I$ to $IV$ in Fig 9b; $I_d$-$IV_d$: Froude number for location $I$ to $IV$ in Fig 9b.}\n\\end{figure}\n\n\\section{Discussion}\n\nIn this study, we apply TSUFLIND-EnKF model to estimate tsunami flow parameters and carry out parameter study. The TSUFLIND-EnKF model uses the TSUFLIND as a forward model and EnKF method for inversion. The EnKF method originally is developed for the situation that the mean of ensemble is the true value. A significant limitation is that the choice of ensemble (the mean, range and total number) may influence the final results in some extreme conditions. When TSUFLIND-EnKF model is applied, it is required that the mean of ensemble is close to the true value. Generally speaking, an overestimation of mean of ensemble does not significantly change the final inversion results, so the mean of ensemble can be set up a slightly larger than the results from other inversion models. Based on the parameter study, we find that there is an ideal number of initial guess ensemble to reduce the uncertainty in the inversion result (Fig. 2b). The distribution of unknown parameters usually will not significantly change the inversion result (Fig. 5). However, when the distribution of unknown parameters follows a given distribution, using given distribution in ensemble can help get good inversion results quickly. TSUFLIND-EnKF model is not applicable when the observation variable is not sensitive to unknown parameter. The parameter study suggests that the increment of unknown parameters in TSUFLIND-EnKF potentially decreases the quantity of the final inversion results (Fig. 6). In the same situation, different unknown parameters may need different number of data assimilation operations to converge. For instance, the shear velocity converges quicker than the water depth in the test case. The reason for this behavior is that the sediment flux, which is the observational variable, is more sensitive to the shear velocity than the water depth. \n\nFor most cases, however, the sediment flux is almost impossible to measure during tsunami or other extreme high-energy events. Therefore, it has to be reconstructed by the deposit. The method to reconstruct tsunami sediment flux directly influences the uncertainty accommodate in the inversion results. When there are more errors in observational data from the deposit record than forward model, TSUFLIND-EnKF model will use more information from forward model results. Otherwise, TSUFLIND-EnKF will use more data from observational data. In other words, TSUFLIND-EnKF gets the best inversion results when the model error and the observational error are similar (Fig. 7). \n\nAlso the application of high precision forward model would require higher precision observational data to get the inversion results with smaller uncertainty. For the sample frequency, the inference error decreases first and then increases with increasing sample frequency. This is because the more sediment samples provide more information to help calculate the unknown parameters. At the same time, increasing samples will add more errors into the model, so the uncertainty increases again (Fig. 8a and 8b). These results suggest that there might be a best field sample frequency, which significantly reduces the uncertainty in the inversion model results. Based on Fig. 8a and 8b, the best frequency of sampling for shear velocity is 9 and for water depth is 11. The insensitive unknown parameters like water depth usually need more sediment samples to get results with smaller inference error (Fig. 8a and 8b). \n\nWhen we apply specific forward model to EnKF method, the sampling frequency and measurement method become the major source of inference error. In order to reduce the inference error, the sample frequency and method should be decided before sampling during fieldwork. We apply the data from 2004 India ocean tsunami to design a sample frequency for this test case (Fig 9a). An interesting result of this application is that a larger number of samples from a given location does not automatically improve inversion results, because the more samples may input more observational errors into the system. For the second application, we estimated flow condition for four locations in Ranganathapuram during 2004 Indian ocean tsunami. Both depth-averaged velocity and Froude number are larger than results based on TSUFLIND. The mean flow velocity ranges from 5.0 to 4.65 $\\text{ms}^{-1}$ with similar distribution, which is slightly larger than the result from TSUFLIND \\citep{huitang2015} (4.7 to 4.5 $\\text{ms}^{-1}$ from 150 m from shoreline to 207 m from shoreline) based on TSUFLIND model. One of the most important reason of the difference is that we directly apply the whole tsunami deposit, which may also consider bed load. Also, water depth used in \\cite{huitang2015} is based on Moore's model and usually will overestimate as the linear assumption is applied. However, we can inverse water depth and shear velocity at the same time in TSUFIND-EnKF model that overcome the limitation of Moore's model. \n\n\\section{Conclusion}\nMore field data is needed to quantify the limitation of the inversion model and how the tsunami flow can be better estimated. However, the TSUFLIND-EnKF model can provide meaningful information to improve estimates of these unknown parameters, such as speed and depth, and explore the inference error in the inversion results. Firstly, our study results show that TSUFLIND-EnKF gives reasonable estimates of unknown parameters (like shear velocity and water depth) for most conditions. Secondly, the sampling methods and frequencies of tsunami deposit influence not only the final inversion results, but also uncertainty the inversion result carry. The results of error analysis can work as a guide to help us improve future tsunami sediment field methods. From a more general viewpoint, these studies also indicate that the gap between results from modeling and fieldwork needs to be narrowed or closed because only together more robust inversion can be achieved. In this sense, researchers focusing on fieldwork must understand more about modeling, and more theoretical researchers must better comprehend the limitations and constraints of fieldwork. Also the application of a high-precision forward model would require high-precision data set.\n\n\\begin{appendices}\n\\section*{Appendix A: Forward Model}\n\nThe forward model based on \\citet{huitang2015}, and \\citet{Jaffe2007347} is briefly presented below. The sediment concentration is given by:\n\n", "itemtype": "equation", "pos": 9266, "prevtext": "\nin which $\\tilde{m}_{l}$ is the true mass of the tsunami sediment for sample $l$ in given location. Also, the entire sediment is uniformly divided to several sediment samples to simplify the framework, therefore we also can write $E_{re}$ as:\n\n\n", "index": 7, "text": "\\begin{equation}\n{E_{re}} = \\beta +\\frac{\\epsilon}{m}\\cdot{N_l}\\cdot 100\\%\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{E_{re}}=\\beta+\\frac{\\epsilon}{m}\\cdot{N_{l}}\\cdot 100\\%\" display=\"block\"><mrow><msub><mi>E</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi></mrow></msub><mo>=</mo><mrow><mi>β</mi><mo>+</mo><mrow><mfrac><mi>ϵ</mi><mi>m</mi></mfrac><mo>⋅</mo><msub><mi>N</mi><mi>l</mi></msub><mo>⋅</mo><mrow><mn>100</mn><mo lspace=\"0pt\" rspace=\"3.5pt\">%</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": " in which $w_{i}$ is the settling velocity for grain size $i$, $z_0$ denotes the bed roughness and is calculated based on \\citet{MacWilliams2005}. $z$ is elevation above sediment bed, and $k(z)$ represents the eddy viscosity profile from \\citet{gelfenbaum1986}. \nIn this equation, $C_{i, 0}$ denotes sediment concentration of the $i$\\textsuperscript{th} grain-size class at the bed, which is calculated with \\citet{Madsen19931303}:\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nin which $m$ is the total mass of the tsunami sediment and $N_l$ represents the total number of sediment samples. It should be noted that error in the observation data increases with an increasing number of sediment samples. The model error is difficult to estimate, however, a constructed model error is applied.\n\n\\section{Results}\n\\subsection{Parameter Study}\nThe TSUFLIND-EnKF requires five inputs: number of ensemble, mean of ensemble, range of ensemble, type of unknown parameter (shear velocity and water depth) and of unknown parameters (uniform distribution or normal distribution). TSUFLIND-EnKF's sensitivity to these inputs is tested in a parameter study. Based on the parameter study, we hope to get some general conclusions about both TSUFLIND-EnKF model and inversion theory for tsunami research community.  The setting for all parameter studies can be found in Table 1. The effects of errors will be examined in detail in the section 3.2.\n\n\\begin{table}\n\\begin{threeparttable}\n\\caption{Physical and computational parameters used for the parameter study.}\n\\centering\n\\begin{adjustbox}{max width=\\textwidth}\n\\begin{tabular}{l|c|c|c|c|c}\n  \\hline\n  \\textbf{Parameters}   & \\textbf{Case 1}  &  \\textbf{Case 2}  &   \\textbf{Case 3} & \\textbf{Case 4} & \\textbf{Case 5} \\\\ \n  \\hline\n  Inferred parameters &   $u_*$        & $u_*$ & $u_*$  & $u_*$ & $u_*$ and $h$         \\\\ \n    \\hline\n  Grain size $\\phi$ $(= - \\log_2 [D/D_\\textrm{ref}])$ &   \\multicolumn{5}{c}{$0-3.25$}  \\\\\n  $\\Delta t$ & \\multicolumn{5}{c}{0.5~s} \\\\\n  Data assimilation interval $\\Delta N$ & \\multicolumn{5}{c}{10} \\\\\n  std.~$\\sigma_i$ of observation error  &\n  \\multicolumn{5}{c}{$\\epsilon$ + 0.01$\\tilde{\\zeta}_i$} \\\\ \n   \\cline{2-6}\n  Number of samples $M$ & 10-3000 & \\multicolumn{4}{c}{1000} \\\\\n\\cline{2-6}\nPrior of unknown parameter& \\multicolumn{3}{c|}{Uniform} & Uniform/Normal & Uniform \\\\\n  \\hline\n  Synthetic truth $\\tilde{u}_*$ for $u_*$ $ \\mathrm{ ms}^{-1}$& \\multicolumn{5}{c}{$0.5$} \\\\\n   \\cline{2-6}\n    Mean of ensemble for $u_*$ ($\\mathrm{ ms}^{-1}$) & 0.8 &0.25-1.0 &\\multicolumn{3}{c}{0.8} \\\\\n     \\cline{2-6}\n  Range of ensemble for $u_*$ ($\\mathrm{ ms}^{-1}$) & \\multicolumn{2}{c|}{0.2} & 0.1-1.6 & 0.8/- & 0.8 \\\\\n\n \n  \\hline\n  Synthetic truth  $\\tilde{h}$ for $h$ (m)&  \\multicolumn{5}{c}{3}\\\\\n  \\cline{2-6}\n  Range of ensemble for $h$ (m)& \\multicolumn{4}{c|}{$-$} & 5\\\\\n  Mean   $\\bar{h}^0$ of ensemble for $h$ (m) &  \\multicolumn{4}{c|}{$-$}  &   5 \\\\\n\n  \\hline\n\\end{tabular}\n\\end{adjustbox}\n\\end{threeparttable}\n\\end{table}\nThe sensitivity of the inversion result to the number of ensemble is tested by changing the number from 10 to 3000. The difference between various ensemble number's inference error $L_2$ norm decreases with more data assimilation operations taken (Fig. 2a). An increasing number of ensemble from 10 to 40 causes a decreasing the final inference error by 59\\% (Fig. 2b). A decrease in the number of ensemble from 3000 to 40 results in the reduction of the final inference error by 63\\% (Fig. 2b). \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure2.pdf}\n  \\caption{The relative inference error $L_2$ norm versus time steps for the number of ensemble from 10 to 3000. (a): The $L_2$ norm of inference error as a function of the time step and number of ensemble. The number of ensemble changes from 50 to 3000. (b): The final inference error $L_2$ norm as a function of the number of ensemble from 10 to 3000.}\n\\end{figure}\n\nIn order to study the influence of the mean value of ensemble, the mean value is adjusted from 0.25 to 1.0 $\\text{ms}^{-1}$.  Figure 3a shows that the mean of ensemble will strongly change the inversion process pattern during inversion. However, the final inversion result is not a strong function of the mean value (Fig. 3b). For example, a 0.4 $\\text{ms}^{-1}$ adjustment in the mean value from 0.4 $\\text{ms}^{-1}$ to 0.8 $\\text{ms}^{-1}$ results in only a 5\\% change in the final inference error. The data resulting from a significant overestimation usually is superior to that of a dramatic underestimation. For instance, the inference error for the initial mean of 0.25 $\\text{ms}^{-1}$ is 300\\% larger than that from 0.75 $\\text{ms}^{-1}$ (Fig. 3b). Also, the result distributions change from underestimation to slight overestimation when the mean of ensemble changes from 0.3 $\\text{ms}^{-1}$ to 0.8 $\\text{ms}^{-1}$ (Fig. 3c).\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure3.pdf}\n  \\caption{The shear velocity and $L_2$ norm of inference error as a function of the mean of ensemble ranging from 0.25 to 1.0 $\\text{ms}^{-1}$. (a): The calculated shear velocity versus time step from 0 to 200 and mean of ensemble ranging from 0.3 to 0.8 $\\text{ms}^{-1}$; The black dashed line is the averaged value of shear velocity for each time step. The Red dashed line is the synthetic truth for these cases. (b): The inference error $L_2$ norm of final inversion results versus mean of ensemble 0.25-1.0 $\\text{ms}^{-1}$. (c): The final inversion result distributions for different mean of ensemble from 0.3 to 0.8 $\\text{ms}^{-1}$. The Red dashed line is the synthetic truth for these cases.}\n\\end{figure}\n\nThe value range of ensemble will change the number of data assimilation operations needed to make results converge. Usually, the larger range requires more operations to convergent (Fig. 4a). The variance of the final inference error norm for range changing from 0.2 $\\text{ms}^{-1}$ to 1.6 $\\text{ms}^{-1}$ is only 9\\% based on Fig. 4b. For the final result distribution, the final results follow a similar distribution pattern (Fig. 4c), which also indicates that TSUFLIND-EnKF is not sensitive to the range of ensemble unless the true value is not within the ensemble area.\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure4.pdf}\n  \\caption{The shear velocity and inference error $L_2$ norm as a function of the range of ensemble ranging from 0.1 to 1.6 $\\text{ms}^{-1}$. (a): The calculated shear velocity versus time step from 0 to 200 and range of ensemble ranging from 0.2 to 1.2 $\\text{ms}^{-1}$; The black dashed line is the averaged value of shear velocity for each time step. The Red dashed line is the synthetic truth for these cases. (b): The inference error $L_2$ norm of final inversion results versus range of ensemble 0.1-1.6 $\\text{ms}^{-1}$. (c): The final inversion result distributions for different range of ensemble from 0.3 to 0.8 $\\text{ms}^{-1}$. The Red dashed line is the synthetic truth for these cases.}\n\\end{figure}\n\nThere are two major type of distribution for unknown parameter in TSUFLIND-EnKF: uniform distribution and norm distribution. We set up the model as shear velocity with 0.8 $\\text{ms}^{-1}$ mean value, 0.8 $\\text{ms}^{-1}$ range and 1000 ensemble. The range of ensemble for the uniform distribution is exactly from 0.4 to 1.2 $\\text{ms}^{-1}$ (Fig. 5a). However, the normal distribution can only guarantee 68.2\\% samples in the range from 0.4 to 1.2 $\\text{ms}^{-1}$ (Fig. 5b). The distribution of unknown parameter strongly influences the inversion result distribution (Fig. 5c and 5d). The distribution has smaller interval in uniform distribution than normal distribution. However, the distribution of unknown does not influence the $L_2$ norm of the final inversion error significantly. The final $L_2$ norm by the normal distribution is only 9\\% larger than the uniform distribution. \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure5.pdf}\n  \\caption{Compare two different of unknown parameter's inversion processes and results. (a): Tsunami flow shear velocity estimates for each time step by uniform distribution; (b): The shear velocity estimates for each time step by norm distribution; (c): the shear velocity distributions for time step 0, 50, 100, 150 and final result by uniform distribution; (d): the shear velocity distributions for time step 0, 50, 100, 150 and final result by norm distribution.}\n\\end{figure}\n\nWe only calculate shear velocity for previous parameter study. As a part of parameter study, we explore TSUFLIND-EnKF's sensitivity to the choice of unknown parameter. We choose flow depth and shear velocity as unknown parameters. It should be noted that the shear velocity and water depth are inverted separately in the first two cases (Fig. 6a, 6c, 6e and 6f). The flow depth and shear velocity inversion results for the same initial condition are shown in Fig. 6e and 6f. The norm of final inference error for water depth is 16.2\\% larger than that for the shear velocity. In most real cases, both shear velocity and water depth are unknown. It should be noted that TSUFLIND-EnKF can estimate both water depth and shear velocity at the same time. In Figures 6b, 6d, 6g and 6h, the water depth and shear velocity are jointly inverted. The norm of final inference error for water depth is increased by 6\\% when the combination inversion is applied. The norm of final inference error for shear velocity by separation inversion is 12\\% smaller than that comes from combination inversion.\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure6.png}\n  \\caption{Compare two different unknown parameters inversion processes and results. (a)-(d): The inverted tsunami flow depths and shear velocities for each time step are indicated by the green area. The black dashed line is the average value of estimated unknown parameters. The red dashed line is the synthetic truth of estimated unknown parameters. (e)-(h): The water depth and shear velocity distributions for step 50, 100, 150 and final results. (a), (c), (e) and (f): Inverse water depth and shear velocity separately; (b), (d), (g) and (h): Inverse water depth and shear velocity together. }\n\\end{figure}\n\n\n\\subsection{Error Analysis}\n\nThe uncertainties of the inversion model arise from the fundamental theory employed and the observed data. We provide a systematic investigation of the uncertainty by varying the setting of observational data and the forward model. We anticipate a careful, but rigorous error analysis that can reveal important information and help to improve data collection during tsunami field survey.\n\nThis parameter study is carried by using an idealized tsunami deposit and provides the opportunity to study how observational and model errors influence the uncertainty of the final results. For this, it is assumed that all data from original idealized tsunami deposit and forward model are error free; the errors are added into the data manually. For Figures 7a and 7b, the model error is 1\\% and the observational error ranges from 0.1\\% to 30\\%. The $L_2$ norm  of final inference error only increases by 6\\%, when observational errors change from 0.1\\% to 5\\%. A change from 5\\% to 30\\% for the observational errors creates an obvious difference between these final reference error norms about 221.7\\% (Fig. 7b). The observational error is 1\\% and the model error changes from 0.1\\% to 30\\% in Fig. 7c and 7d. Based on Fig. 7a and 7c, it appears that the observational errors add more uncertainty to the inversion results than the model errors as long as both two types of errors are smaller than 10\\%. When  both model errors and observational errors are larger than 10\\%, both model errors and observational errors have a similar influence on the final inversion results. For the model error, the error norms of final inversion results decrease first and then increase again when the model error changes from 0.1\\% to 30\\% (Fig. 7d).\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure7.png}\n  \\caption{The $L_2$ norm of inference error as a function of time step and errors ranging from 0.1\\% to 30\\%. (a): The $L_2$ norm of inference error versus time step for observation error 0.1\\% to 30\\%. (b): The $L_2$ norm of inference error of final inversion results as a function of observation error from 0.1\\% to 30\\%. (c): The $L_2$ norm of inference error versus time step for model error 0.1\\% to 30\\%. (d): The $L_2$ norm of inference error of final inversion results as a function of model error from 0.1\\% to 30\\%.}\n\\end{figure}  \n\nEstimating sediment flux during tsunami is complicated due to large fluctuation of hydrodynamic forces during tsunami flooding. For most cases, the sediment flux can be estimated with the help of tsunami deposits. In here, we assume that the sediment flux can be calculated by the total tsunami deposit thickness, sampling frequency (the number of sediment layers) and grain-size distribution. For the all samples, it is assumed that the observational error is constant in each sample. The error analysis for this case is based on field data and real cases. The total systematic error ($\\beta$) and greatest possible errors ($\\epsilon$) for thickness measurement are set as 5\\% and 0.05 $\\mathrm{mm}$ respectively. The inference error of final inversion result is sensitive to the number of sediment samples (Fig. 8a and 8b). For example, for a 30-cm-thick deposit, the final inference error $L_2$ norm for water depth is about 0.083 for nine sediment layers and 0.0003 for eleven sediment layers (Fig. 8a). The final $L_2$ norm of inference error decreases first and then increases. Based on Fig. 8a and 8b, the best frequency of sampling for shear velocity is 9 and for water depth is 11. \n\n\\begin{figure}[h!]\n  \\centering\n    \\includegraphics[width=1\\textwidth]{Figure8.pdf}\n  \\caption{The final $L_2$ norm of inference error versus sample frequency and types of unknown parameters based on 30-cm-thick ideal tsunami deposit. (a): The final $L_2$ norm of inference error for water depth as a function of sample frequency from 6 to 30; (b): The final $L_2$ norm of inference error for shear velocity as a function of sample frequency from 6 to 30.}\n\\end{figure}\n\n\\subsection{Application and A Real Case}\n\nIn this section, we outline two applications based on real tsunami deposit. The data in this test case is from the coastal area in the vicinity of Ranganathapuram formed by 2004 India ocean tsunami \\citep{Bahlburg2007}. They will be used to design the sample frequency during the field work (Fig 9a). We assume we can take sample every 2 cm, 2.5 cm, 3 cm, 3.5 cm, 4 cm, 4.5 cm to 5 cm in vertical direction, which controls the frequency of sampling for each sample location along the slope. When the sediment thickness is not thick enough for one sediment sample, these sediments are sampled as one. Based on the field data (thickness and grain size range) and sample frequency, we can carry out the similar error analysis shown in Fig. 8 to estimate the sample frequency with smallest inference error. Figure 9a shows the tsunami deposit thickness and the best frequency of sampling along the slope for inversion shear velocity. When tsunami deposit at 50 m from inland is taken five samples in vertical direction,  which suggests the sediment should be sampled every 2 cm, this location will get the lowest inference error. At the sediment extension, all tsunami sediments are sampled as one layer, so the inference error is a constant at this location. \n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1.0\\textwidth]{Figure9.pdf}\n  \\caption{TSUFLIND-EnKF application cases for  2004 India ocean tsunami. (a): Sediment thickness and suggested sample number along the section in the vicinity of Ranganathapuram after 2004 India tsunami. The blue line is sediment thickness from field data. The red line with dot is the best sample number ; (b): The topography of Ranganathapuram cross section and sample location for test case. }\n\\end{figure}\n\nIn here, we apply TSUFLIND-EnKF to inverse shear velocity and flow depth and demonstrate the capability of our framework based on the best sample frequency. Then we calculate depth-averaged velocity and Froude number by using Eqs. A3 and A4. We choose four deposit samples from Ranganathapuram formed by 2004 Indian ocean tsunami (Fig 9b, $I$, $II$,$III$,$IV$). The sediment thickness for these four samples are 0.21 m, 0.12 m, 0.10 m and 0.09 m, respectively. The water depth and shear velocity are inverted together. For this test case, data assimilation operation is applied every ten time steps of the forward model. Figure 10 depicts the inversion results for the shear velocity, water depth, depth-averaged velocity and Froude number at four sampled locations along the slope. Unlike previous inversion models, TSUFLIND-EnKF presents the final inversion results as a probability density distribution function instead of only one value or range of values (Fig. 10). For the shear velocity, sample $I$ and $II$ have a similar range and distribution with a mean value of 0.159 $\\text{ms}^{-1}$ (Fig 10 $I_a$ and $II_a$). And then shear velocity decrease to around 0.149 $\\text{ms}^{-1}$ (Fig 10 $III_a$ and $IV_a$). The water depth decreases from the mean value of 2.905 to 2.502 m (Fig 10 $I_b$ to $IV_b$). The depth-averaged velocity has a similar pattern: decrease from 5.0 to 4.65 $\\text{ms}^{-1}$. The mean Froude number does not change significantly in this case, which is around 0.94. \n\n\n\\begin{figure}[!h]\n  \\centering\n    \\includegraphics[width=1.1\\textwidth]{Figure10.png}\n  \\caption{Inversion results for 2004 India ocean tsunami case from TSUFLIND-EnKF. $I_a$-$IV_a$: Estimates of shear velocity, $u_*$, for location $I$ to $IV$ in Fig 9b; $I_b$-$IV_b$: inversion results of water depth, $H$, for location $I$ to $IV$ in Fig 9b; $I_c$-$IV_c$: inverted depth-averaged velocity, $U$, for location $I$ to $IV$ in Fig 9b; $I_d$-$IV_d$: Froude number for location $I$ to $IV$ in Fig 9b.}\n\\end{figure}\n\n\\section{Discussion}\n\nIn this study, we apply TSUFLIND-EnKF model to estimate tsunami flow parameters and carry out parameter study. The TSUFLIND-EnKF model uses the TSUFLIND as a forward model and EnKF method for inversion. The EnKF method originally is developed for the situation that the mean of ensemble is the true value. A significant limitation is that the choice of ensemble (the mean, range and total number) may influence the final results in some extreme conditions. When TSUFLIND-EnKF model is applied, it is required that the mean of ensemble is close to the true value. Generally speaking, an overestimation of mean of ensemble does not significantly change the final inversion results, so the mean of ensemble can be set up a slightly larger than the results from other inversion models. Based on the parameter study, we find that there is an ideal number of initial guess ensemble to reduce the uncertainty in the inversion result (Fig. 2b). The distribution of unknown parameters usually will not significantly change the inversion result (Fig. 5). However, when the distribution of unknown parameters follows a given distribution, using given distribution in ensemble can help get good inversion results quickly. TSUFLIND-EnKF model is not applicable when the observation variable is not sensitive to unknown parameter. The parameter study suggests that the increment of unknown parameters in TSUFLIND-EnKF potentially decreases the quantity of the final inversion results (Fig. 6). In the same situation, different unknown parameters may need different number of data assimilation operations to converge. For instance, the shear velocity converges quicker than the water depth in the test case. The reason for this behavior is that the sediment flux, which is the observational variable, is more sensitive to the shear velocity than the water depth. \n\nFor most cases, however, the sediment flux is almost impossible to measure during tsunami or other extreme high-energy events. Therefore, it has to be reconstructed by the deposit. The method to reconstruct tsunami sediment flux directly influences the uncertainty accommodate in the inversion results. When there are more errors in observational data from the deposit record than forward model, TSUFLIND-EnKF model will use more information from forward model results. Otherwise, TSUFLIND-EnKF will use more data from observational data. In other words, TSUFLIND-EnKF gets the best inversion results when the model error and the observational error are similar (Fig. 7). \n\nAlso the application of high precision forward model would require higher precision observational data to get the inversion results with smaller uncertainty. For the sample frequency, the inference error decreases first and then increases with increasing sample frequency. This is because the more sediment samples provide more information to help calculate the unknown parameters. At the same time, increasing samples will add more errors into the model, so the uncertainty increases again (Fig. 8a and 8b). These results suggest that there might be a best field sample frequency, which significantly reduces the uncertainty in the inversion model results. Based on Fig. 8a and 8b, the best frequency of sampling for shear velocity is 9 and for water depth is 11. The insensitive unknown parameters like water depth usually need more sediment samples to get results with smaller inference error (Fig. 8a and 8b). \n\nWhen we apply specific forward model to EnKF method, the sampling frequency and measurement method become the major source of inference error. In order to reduce the inference error, the sample frequency and method should be decided before sampling during fieldwork. We apply the data from 2004 India ocean tsunami to design a sample frequency for this test case (Fig 9a). An interesting result of this application is that a larger number of samples from a given location does not automatically improve inversion results, because the more samples may input more observational errors into the system. For the second application, we estimated flow condition for four locations in Ranganathapuram during 2004 Indian ocean tsunami. Both depth-averaged velocity and Froude number are larger than results based on TSUFLIND. The mean flow velocity ranges from 5.0 to 4.65 $\\text{ms}^{-1}$ with similar distribution, which is slightly larger than the result from TSUFLIND \\citep{huitang2015} (4.7 to 4.5 $\\text{ms}^{-1}$ from 150 m from shoreline to 207 m from shoreline) based on TSUFLIND model. One of the most important reason of the difference is that we directly apply the whole tsunami deposit, which may also consider bed load. Also, water depth used in \\cite{huitang2015} is based on Moore's model and usually will overestimate as the linear assumption is applied. However, we can inverse water depth and shear velocity at the same time in TSUFIND-EnKF model that overcome the limitation of Moore's model. \n\n\\section{Conclusion}\nMore field data is needed to quantify the limitation of the inversion model and how the tsunami flow can be better estimated. However, the TSUFLIND-EnKF model can provide meaningful information to improve estimates of these unknown parameters, such as speed and depth, and explore the inference error in the inversion results. Firstly, our study results show that TSUFLIND-EnKF gives reasonable estimates of unknown parameters (like shear velocity and water depth) for most conditions. Secondly, the sampling methods and frequencies of tsunami deposit influence not only the final inversion results, but also uncertainty the inversion result carry. The results of error analysis can work as a guide to help us improve future tsunami sediment field methods. From a more general viewpoint, these studies also indicate that the gap between results from modeling and fieldwork needs to be narrowed or closed because only together more robust inversion can be achieved. In this sense, researchers focusing on fieldwork must understand more about modeling, and more theoretical researchers must better comprehend the limitations and constraints of fieldwork. Also the application of a high-precision forward model would require high-precision data set.\n\n\\begin{appendices}\n\\section*{Appendix A: Forward Model}\n\nThe forward model based on \\citet{huitang2015}, and \\citet{Jaffe2007347} is briefly presented below. The sediment concentration is given by:\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:2}\nC_{i}(z)=C_{i,0}e^{w_{i}\\int_{z_0}^{z}{\\frac{1}{K(z)}dz}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"C_{i}(z)=C_{i,0}e^{w_{i}\\int_{z_{0}}^{z}{\\frac{1}{K(z)}dz}}\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>C</mi><mrow><mi>i</mi><mo>,</mo><mn>0</mn></mrow></msub><mo>⁢</mo><msup><mi>e</mi><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mn>0</mn></msub><mi>z</mi></msubsup></mstyle><mrow><mfrac><mn>1</mn><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>⁢</mo><mrow><mo>𝑑</mo><mi>z</mi></mrow></mrow></mrow></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nwhere $\\beta_{0}$ is the resuspension coefficient, $f_{i}$ is a fraction of the sediment of grain size $i$. $S_{i}$ is the normalized excess shear stress given by \n\n\\begin{subequations}\n\n", "itemtype": "equation", "pos": 34035, "prevtext": " in which $w_{i}$ is the settling velocity for grain size $i$, $z_0$ denotes the bed roughness and is calculated based on \\citet{MacWilliams2005}. $z$ is elevation above sediment bed, and $k(z)$ represents the eddy viscosity profile from \\citet{gelfenbaum1986}. \nIn this equation, $C_{i, 0}$ denotes sediment concentration of the $i$\\textsuperscript{th} grain-size class at the bed, which is calculated with \\citet{Madsen19931303}:\n\n\n", "index": 11, "text": "\\begin{equation}\n\\label{eq:7}\nC_{i,0}=\\frac{\\beta_{0}(1-p)f_{i}S_{i}}{1+\\beta_{0}S_{i}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"C_{i,0}=\\frac{\\beta_{0}(1-p)f_{i}S_{i}}{1+\\beta_{0}S_{i}}\" display=\"block\"><mrow><msub><mi>C</mi><mrow><mi>i</mi><mo>,</mo><mn>0</mn></mrow></msub><mo>=</mo><mfrac><mrow><msub><mi>β</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>p</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>S</mi><mi>i</mi></msub></mrow><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>β</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>S</mi><mi>i</mi></msub></mrow></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n\\end{subequations}\nwhere $\\tau_{b}$ is the bed shear stress and $\\tau_{{cr}_{i}}$ is the critical shear stress of the initial sediment movement \\citep{Madsen19931303}.  The eddy viscosity profile, $k(z)$,  from \\citet{gelfenbaum1986} is given by:\n\n\n", "itemtype": "equation", "pos": 34324, "prevtext": "\nwhere $\\beta_{0}$ is the resuspension coefficient, $f_{i}$ is a fraction of the sediment of grain size $i$. $S_{i}$ is the normalized excess shear stress given by \n\n\\begin{subequations}\n\n", "index": 13, "text": "\\begin{align}\n\\label{eq:8}\nS_{i}= \\frac{\\tau_{b}-\\tau_{{cr}_{i}}}{\\tau_{{cr}_{i}}} \\:\\:\\: for \\:\\:\\: \\tau_{b} > \\tau_{{cr}_{i}} \n\\\\\nS_{i}= 0 \\:\\:\\: for \\:\\:\\: \\tau_{b} \\leq \\tau_{{cr}_{i}}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle S_{i}=\\frac{\\tau_{b}-\\tau_{{cr}_{i}}}{\\tau_{{cr}_{i}}}\\&gt;\\&gt;\\&gt;for%&#10;\\&gt;\\&gt;\\&gt;\\tau_{b}&gt;\\tau_{{cr}_{i}}\" display=\"inline\"><mrow><msub><mi>S</mi><mi>i</mi></msub><mo>=</mo><mrow><mpadded width=\"+6.6pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>τ</mi><mi>b</mi></msub><mo>-</mo><msub><mi>τ</mi><mrow><mi>c</mi><mo>⁢</mo><msub><mi>r</mi><mi>i</mi></msub></mrow></msub></mrow><msub><mi>τ</mi><mrow><mi>c</mi><mo>⁢</mo><msub><mi>r</mi><mi>i</mi></msub></mrow></msub></mfrac></mstyle></mpadded><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+6.6pt\"><mi>r</mi></mpadded><mo>⁢</mo><msub><mi>τ</mi><mi>b</mi></msub></mrow><mo>&gt;</mo><msub><mi>τ</mi><mrow><mi>c</mi><mo>⁢</mo><msub><mi>r</mi><mi>i</mi></msub></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle S_{i}=0\\&gt;\\&gt;\\&gt;for\\&gt;\\&gt;\\&gt;\\tau_{b}\\leq\\tau_{{cr}_{i}}\" display=\"inline\"><mrow><msub><mi>S</mi><mi>i</mi></msub><mo>=</mo><mrow><mpadded width=\"+6.6pt\"><mn>0</mn></mpadded><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+6.6pt\"><mi>r</mi></mpadded><mo>⁢</mo><msub><mi>τ</mi><mi>b</mi></msub></mrow><mo>≤</mo><msub><mi>τ</mi><mrow><mi>c</mi><mo>⁢</mo><msub><mi>r</mi><mi>i</mi></msub></mrow></msub></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nwhere $\\kappa =0.41$ is the von Karman constant, $z$ is the elevation above bed, $h$ denotes the water depth and $u_*$ is the shear velocity. After determining the eddy viscosity profile, the flow speed profile is calculated by :\n\n\n", "itemtype": "equation", "pos": 34773, "prevtext": "\n\\end{subequations}\nwhere $\\tau_{b}$ is the bed shear stress and $\\tau_{{cr}_{i}}$ is the critical shear stress of the initial sediment movement \\citep{Madsen19931303}.  The eddy viscosity profile, $k(z)$,  from \\citet{gelfenbaum1986} is given by:\n\n\n", "index": 15, "text": "\\begin{equation}\n\\label{eq:eddy}\nK(z) = \\kappa \\, u_* \\, z \\exp\\left[ {\\frac{-z}{h} - 3.2 \\left( \\frac{z}{h} \\right)^2 + \\frac{2}{3} \\times 3.2\n    \\left( \\frac{z}{h} \\right)^3} \\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"K(z)=\\kappa\\,u_{*}\\,z\\exp\\left[{\\frac{-z}{h}-3.2\\left(\\frac{z}{h}\\right)^{2}+%&#10;\\frac{2}{3}\\times 3.2\\left(\\frac{z}{h}\\right)^{3}}\\right],\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mi>κ</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>u</mi><mo>*</mo></msub></mpadded><mo>⁢</mo><mi>z</mi><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mrow><mfrac><mrow><mo>-</mo><mi>z</mi></mrow><mi>h</mi></mfrac><mo>-</mo><mrow><mn>3.2</mn><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>z</mi><mi>h</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>+</mo><mrow><mrow><mfrac><mn>2</mn><mn>3</mn></mfrac><mo>×</mo><mn>3.2</mn></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>z</mi><mi>h</mi></mfrac><mo>)</mo></mrow><mn>3</mn></msup></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nwhere $z_o$ is the bottom roughness from \\citet{MacWilliams2005}. The total time taken for all the sediment in the water column to settle, $T$, is divided to $N$ time steps of size $\\Delta t$ such that $T = N \\, \\Delta t$. For grain size class $i$, the water column can also be divided to $N$ layers. The sediment in layer $l$ consists of the sediment in the $l$\\textsuperscript{th} layer of the water column for all grain size classes, which thickness $\\Delta \\eta_l$ is computed by:\n\n\n", "itemtype": "equation", "pos": 35206, "prevtext": "\nwhere $\\kappa =0.41$ is the von Karman constant, $z$ is the elevation above bed, $h$ denotes the water depth and $u_*$ is the shear velocity. After determining the eddy viscosity profile, the flow speed profile is calculated by :\n\n\n", "index": 17, "text": "\\begin{equation}\n\\label{eq:6}\n\\ U(z)=\\int_{z_0}^{z}{\\frac{u_*^{2}}{K(z)}dz}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\ U(z)=\\int_{z_{0}}^{z}{\\frac{u_{*}^{2}}{K(z)}dz}\" display=\"block\"><mrow><mrow><mpadded lspace=\"5pt\" width=\"+5pt\"><mi>U</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mn>0</mn></msub><mi>z</mi></msubsup><mrow><mfrac><msubsup><mi>u</mi><mo>*</mo><mn>2</mn></msubsup><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>⁢</mo><mrow><mo>𝑑</mo><mi>z</mi></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n  in which $C_0$ is the total sediment concentration at the bed, $n$ is the number of grain size classes, and $\\overline{C}_{i, l}$ is the average concentration of grainsize class $i$ in the water column layer $l$, which can be obtained by a simple integration:\n  \n  \n", "itemtype": "equation", "pos": 35783, "prevtext": "\nwhere $z_o$ is the bottom roughness from \\citet{MacWilliams2005}. The total time taken for all the sediment in the water column to settle, $T$, is divided to $N$ time steps of size $\\Delta t$ such that $T = N \\, \\Delta t$. For grain size class $i$, the water column can also be divided to $N$ layers. The sediment in layer $l$ consists of the sediment in the $l$\\textsuperscript{th} layer of the water column for all grain size classes, which thickness $\\Delta \\eta_l$ is computed by:\n\n\n", "index": 19, "text": "\\begin{equation}\n    \\label{eq:d-eta}\n    \\Delta \\eta_l = \\frac{1}{C_0} \\left( \\sum_{i = 1}^{n} {\\overline{C}_{i, l} \\, \\Delta z_{i}}\n    \\right), \n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\Delta\\eta_{l}=\\frac{1}{C_{0}}\\left(\\sum_{i=1}^{n}{\\overline{C}_{i,l}\\,\\Delta z%&#10;_{i}}\\right),\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>η</mi><mi>l</mi></msub></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>C</mi><mn>0</mn></msub></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><mpadded width=\"+1.7pt\"><msub><mover accent=\"true\"><mi>C</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>z</mi><mi>i</mi></msub></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n The sediment flux is given by:\n\n", "itemtype": "equation", "pos": 36214, "prevtext": "\n  in which $C_0$ is the total sediment concentration at the bed, $n$ is the number of grain size classes, and $\\overline{C}_{i, l}$ is the average concentration of grainsize class $i$ in the water column layer $l$, which can be obtained by a simple integration:\n  \n  \n", "index": 21, "text": "\\begin{equation}\n    \\label{eq:cbar}\n    \\bar{C}_{i, l} = \\frac{1}{\\Delta z_i} \\int_z^{z + \\Delta z_i} \\, C_i (z) \\, dz.\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\bar{C}_{i,l}=\\frac{1}{\\Delta z_{i}}\\int_{z}^{z+\\Delta z_{i}}\\,C_{i}(z)\\,dz.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>z</mi><mi>i</mi></msub></mrow></mfrac><mo>⁢</mo><mrow><mpadded width=\"+1.7pt\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>z</mi><mrow><mi>z</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>z</mi><mi>i</mi></msub></mrow></mrow></msubsup></mpadded><mrow><msub><mi>C</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>z</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\nin which $\\Delta z_{i}$ represents the water column layer thickness and $\\Delta t$ denotes the forward model time interval. $\\overline{C}_{i, l}$ can be calculated from sediment concentration profile $C_{i}(z)$.  Based on Eqs. A6, A10 and A11, the sediment flux at each time step can be calculated.\\\n\n\\section*{Appendix B: Algorithm for Ensemble Kalman Filtering}\n\n\\label{app:enkf}\n\nThe algorithm of the ensemble Kalman filtering for inverse modeling is summarized below. For further more details about this algorithm, we refer to \\citet{jianxun2015}. Given the prior distribution of the parameters to be inferred (shear velocity $u_*$ and flow depth $h$) and sediment flux observations with error covariance matrix $\\mathbf{R}$, the following steps are performed:\n\\begin{enumerate}\n\\item \\textbf{Initialization:} Generate initial ensemble $\\{{\\mathbf{x}_j}\\}_{j = 1}^M$ of size $M$,\n  where the augmented system state is:\n  \n  \n", "itemtype": "equation", "pos": 36384, "prevtext": "\n The sediment flux is given by:\n\n", "index": 23, "text": "\\begin{equation}\n\\label{eq:flux}\n\\zeta_{i, l}  = \\frac{\\overline{C}_{i, l} \\, \\Delta z_{i}}{\\Delta t}  \\quad \\textrm{or\n   } \\\\\n\\zeta_{i, l}  =  \\overline{C}_{i, l} \\;  w_i  \\quad \\textrm{ in which }  \\quad\n  w_i = \\frac{\\Delta z_{i}}{\\Delta t} .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\zeta_{i,l}=\\frac{\\overline{C}_{i,l}\\,\\Delta z_{i}}{\\Delta t}\\quad\\textrm{or&#10;}\\\\&#10;\\zeta_{i,l}=\\overline{C}_{i,l}\\;w_{i}\\quad\\textrm{ in which }\\quad w_{i}=\\frac%&#10;{\\Delta z_{i}}{\\Delta t}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>ζ</mi><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub><mo>=</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msub><mover accent=\"true\"><mi>C</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>z</mi><mi>i</mi></msub></mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><mrow><mtext>or </mtext><mo>⁢</mo><msub><mi>ζ</mi><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+2.8pt\"><msub><mover accent=\"true\"><mi>C</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>,</mo><mi>l</mi></mrow></msub></mpadded><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext> in which </mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>=</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>z</mi><mi>i</mi></msub></mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n\n\n\\item \\textbf{Prediction:} \n  \\begin{enumerate}\n  \\item Propagate the state from current state at time $t$ to the next assimilation step $t + \\Delta\n    T$ with the forward model TSUFLIND, indicated as $\\mathcal{F}$,\n \n \n", "itemtype": "equation", "pos": 37574, "prevtext": "\nin which $\\Delta z_{i}$ represents the water column layer thickness and $\\Delta t$ denotes the forward model time interval. $\\overline{C}_{i, l}$ can be calculated from sediment concentration profile $C_{i}(z)$.  Based on Eqs. A6, A10 and A11, the sediment flux at each time step can be calculated.\\\n\n\\section*{Appendix B: Algorithm for Ensemble Kalman Filtering}\n\n\\label{app:enkf}\n\nThe algorithm of the ensemble Kalman filtering for inverse modeling is summarized below. For further more details about this algorithm, we refer to \\citet{jianxun2015}. Given the prior distribution of the parameters to be inferred (shear velocity $u_*$ and flow depth $h$) and sediment flux observations with error covariance matrix $\\mathbf{R}$, the following steps are performed:\n\\begin{enumerate}\n\\item \\textbf{Initialization:} Generate initial ensemble $\\{{\\mathbf{x}_j}\\}_{j = 1}^M$ of size $M$,\n  where the augmented system state is:\n  \n  \n", "index": 25, "text": "\\begin{equation}\n    \\label{eq:ini-x}\n    \\mathbf{x} = [\\zeta_1, \\cdots, \\zeta_n,  u_*, h]'\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{x}=[\\zeta_{1},\\cdots,\\zeta_{n},u_{*},h]^{\\prime}\" display=\"block\"><mrow><mi>𝐱</mi><mo>=</mo><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>ζ</mi><mn>1</mn></msub><mo>,</mo><mi mathvariant=\"normal\">⋯</mi><mo>,</mo><msub><mi>ζ</mi><mi>n</mi></msub><mo>,</mo><msub><mi>u</mi><mo>*</mo></msub><mo>,</mo><mi>h</mi><mo stretchy=\"false\">]</mo></mrow><mo>′</mo></msup></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n  in which $\\Delta T = \\Delta N \\Delta t$, indicating that the observation data is assimilated every\n  $\\Delta N$ time steps.\n\n\\item\n  Estimate the\n  mean $\\bar{\\mathbf{x}}$ and covariance $\\mathbf{P}^{(n+1)}$ of the ensemble as:\n  \n  \\begin{subequations}\n    \n", "itemtype": "equation", "pos": 37905, "prevtext": "\n\n\n\\item \\textbf{Prediction:} \n  \\begin{enumerate}\n  \\item Propagate the state from current state at time $t$ to the next assimilation step $t + \\Delta\n    T$ with the forward model TSUFLIND, indicated as $\\mathcal{F}$,\n \n \n", "index": 27, "text": "\\begin{equation}\n    \\label{eq:forward}\n    \\hat{\\mathbf{x}}_j^{(t+\\Delta T)} = \\mathcal{F} [ \\mathbf{x}_j^{(t)} ]\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\mathbf{x}}_{j}^{(t+\\Delta T)}=\\mathcal{F}[\\mathbf{x}_{j}^{(t)}]\" display=\"block\"><mrow><msubsup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>=</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msubsup><mi>𝐱</mi><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n  \\end{subequations}\n\\end{enumerate}\n\n\n\\item  \\textbf{Analysis:}\n  \\begin{enumerate}\n  \\item Compute the Kalman gain matrix as:\n    \n    \n", "itemtype": "equation", "pos": 38297, "prevtext": "\n  in which $\\Delta T = \\Delta N \\Delta t$, indicating that the observation data is assimilated every\n  $\\Delta N$ time steps.\n\n\\item\n  Estimate the\n  mean $\\bar{\\mathbf{x}}$ and covariance $\\mathbf{P}^{(n+1)}$ of the ensemble as:\n  \n  \\begin{subequations}\n    \n", "index": 29, "text": "\\begin{align}\n      \\bar{\\mathbf{x}}^{(t+\\Delta T)} = \\frac{1}{M}\\sum_{j=1}^N{\\hat{\\mathbf{x}}^{(t+\\Delta T)}_j}    \\label{eq:mean} \\\\\n      \\mathbf{P}^{(t+\\Delta T)} = \\frac{1}{M-1} \\sum_{j = 1}^{N} {\\left( \\hat{\\mathbf{x}}_j\\hat{\\mathbf{x}}_j' -  \n          \\bar{\\mathbf{x}}\\bar{\\mathbf{x}}' \\right)^{(t+\\Delta T)}}\n \\label{eq:cov} \n    \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\bar{\\mathbf{x}}^{(t+\\Delta T)}=\\frac{1}{M}\\sum_{j=1}^{N}{\\hat{%&#10;\\mathbf{x}}^{(t+\\Delta T)}_{j}}\" display=\"inline\"><mrow><msup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>M</mi></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><msubsup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathbf{P}^{(t+\\Delta T)}=\\frac{1}{M-1}\\sum_{j=1}^{N}{\\left(\\hat{%&#10;\\mathbf{x}}_{j}\\hat{\\mathbf{x}}_{j}^{\\prime}-\\bar{\\mathbf{x}}\\bar{\\mathbf{x}}^%&#10;{\\prime}\\right)^{(t+\\Delta T)}}\" display=\"inline\"><mrow><msup><mi>𝐏</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>M</mi><mo>-</mo><mn>1</mn></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><msup><mrow><mo>(</mo><mrow><mrow><msub><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi></msub><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mo>′</mo></msubsup></mrow><mo>-</mo><mrow><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">¯</mo></mover><mo>′</mo></msup></mrow></mrow><mo>)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n\n  \\item Update each sample in the predicted ensemble as follows:\n        \n        \n", "itemtype": "equation", "pos": 38785, "prevtext": "\n  \\end{subequations}\n\\end{enumerate}\n\n\n\\item  \\textbf{Analysis:}\n  \\begin{enumerate}\n  \\item Compute the Kalman gain matrix as:\n    \n    \n", "index": 31, "text": "\\begin{equation}\n      \\label{eq:kalman-gain}\n      \\mathbf{K}^{(t+\\Delta T)} = \\mathbf{P}^{(t+\\Delta T)} \\mathbf{H}' (\\mathbf{H} \\mathbf{P}^{(t+\\Delta T)} \\mathbf{H}' + \\mathbf{R})^{-1} \n    \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{K}^{(t+\\Delta T)}=\\mathbf{P}^{(t+\\Delta T)}\\mathbf{H}^{\\prime}(\\mathbf%&#10;{H}\\mathbf{P}^{(t+\\Delta T)}\\mathbf{H}^{\\prime}+\\mathbf{R})^{-1}\" display=\"block\"><mrow><msup><mi>𝐊</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><msup><mi>𝐏</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msup><mi>𝐇</mi><mo>′</mo></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>𝐇𝐏</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msup><mi>𝐇</mi><mo>′</mo></msup></mrow><mo>+</mo><mi>𝐑</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03788.tex", "nexttext": "\n  \\end{enumerate}\n\n\\item Repeat the prediction and analysis steps until  all observations are assimilated.\n\\end{enumerate}\n\\end{appendices}\n\n\n\n\\bibliographystyle{apa}\n\\bibliography{enkf}\n\n\n", "itemtype": "equation", "pos": 39075, "prevtext": "\n\n  \\item Update each sample in the predicted ensemble as follows:\n        \n        \n", "index": 33, "text": "\\begin{equation}\n      \\label{eq:update}\n      \\mathbf{x}_j^{(t+\\Delta T)} = \\hat{\\mathbf{x}}_j^{(t+\\Delta T)} + \\mathbf{K}\n      (\\boldsymbol{\\zeta}_j  - \\mathbf{H} \\hat{\\mathbf{x}}_j^{(t+\\Delta T)}) \n    \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{x}_{j}^{(t+\\Delta T)}=\\hat{\\mathbf{x}}_{j}^{(t+\\Delta T)}+\\mathbf{K}(%&#10;\\boldsymbol{\\zeta}_{j}-\\mathbf{H}\\hat{\\mathbf{x}}_{j}^{(t+\\Delta T)})\" display=\"block\"><mrow><msubsup><mi>𝐱</mi><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>=</mo><mrow><msubsup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>+</mo><mrow><mi>𝐊</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝜻</mi><mi>j</mi></msub><mo>-</mo><mrow><mi>𝐇</mi><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]