[{"file": "1601.06817.tex", "nexttext": "  \nwhere $f^{(i)}_{n}(\\tau)$ is the complex amplitude to find $n$ atoms on lattice site $i$ at time $\\tau$.  \n\nThe initial state can be found using the variational theorem.  We first assume a random initial guess for all of the $f$'s.  We then minimize the energy of $H$ by varying all $f$'s using a conjugate gradient method.  We find that keeping the parameters $f_{n}$  for $n\\leq 4$ is sufficient for the regime studied here.  Once the wavefunction is found, all initial state correlation functions can be computed.  \n\n\n\\begin{figure*}[t]\n  \\includegraphics[width=\\textwidth]{Figures/2D_density_U_8_Delta_0p3U_Omega_0p02U_mu_0p5U_DeltaR0_1.pdf}\n  \\caption{(Color online) The disorder averaged local density deviation from the initial state, $\\Delta n_{i}\\equiv\\langle \\langle n_{i} \\rangle \\rangle_{\\tau} -\\langle \\langle n_{i} \\rangle \\rangle_{\\tau=0}$, plotted as a function of position in the $x-y$ plane for three different times.  All model parameters are the same as Fig.~\\ref{fig_com_time_8_48}a where a superfluid occupies nearly the entire trap.  These parameters correspond to the right arrow in the phase diagram, Fig.~\\ref{fig_phasediagram}.  Here we see how the superfluid as a whole oscillates in the trap even in the presence of disorder.  }\n  \\label{fig_density_U_8}\n\\end{figure*}\n\nWe propagate the initial state wavefunction in time using the equations of motion consistent with the Gutzwiller ansatz.  The equations of motion for $f^{(i)}_{n}$ are \\cite{jaksch:2002}:   \n\\begin{eqnarray}\n\\mathrm{i\\hbar}\\partial_{\\tau}{f}^{(i)}_n &=& \\left[\\frac{U}{2}n(n-1)+n \\mu_i\\right]f^{(i)}_n\\\\ \\nonumber\n&-&t\\sum_{\\langle i, j \\rangle}\\left(\\psi^{*}_j \\sqrt{n+1} f^{(i)}_{n+1}+ \\psi_{j} \\sqrt{n} f^{(i)}_{n-1}\\right), \n\\end{eqnarray} \nwhere $\\psi_{j} = \\langle b_j \\rangle = \\sum_{n}\\sqrt{n}f^{(j) *}_{n-1}f^{(j)}_{n} $ is the mean-field superfluid order parameter.  \nWe numerically solve this set of coupled first order differential equations using the adaptive step size Runge-Kutta method.  This allows access to all correlation functions as a function of time.\n\nThe center of mass position and velocity are key observables often used in experiments to reveal insulating behavior.  We compute the total center of mass position along the $x$-direction and the center of mass velocity as a function of time:\n\\begin{eqnarray}\nX_{\\text{CM}}(\\tau)&=&\\frac{1}{N}\\sum_{i} \\langle \\langle \\hat{n}_{i} \\rangle \\rangle_{\\tau} [\\hat{x}\\cdot {\\mathbf R}_i] \\nonumber\\\\\nV_{\\text{CM}} (\\tau) &=& {   \\accentset{\\mbox{\\large\\bfseries .}}{{X}}}_{\\text{CM}}(\\tau).\n\\end{eqnarray} \nHere $N$ is the number of particles and $\\langle \\langle ... \\rangle \\rangle _{\\tau}$ indicates the disorder average of quantum state averages with respect to $|\\Psi_{\\rm GW}(\\tau)\\rangle$.  We find that disorder averaging with 1000 configurations is sufficient to obtain convergence.  \n\n\\section{Static Properties}\n\\label{sec_statics}\n\n\nIn this section we review the static properties of the disordered Bose-Hubbard model at zero temperature.  The schematic mean field phase diagram \\cite{fisher:1989} reproduced by the Gutzwiller ansatz \\cite{buonsante:2009} is depicted in Fig.~\\ref{fig_phasediagram}.  Here we see that the Mott insulator is separated from the superfluid by an intermediate Bose-glass.  The Mott insulator occurs at integer filling and is incompressible.  It has zero condensate fraction.  The Bose-glass and the superfluid are compressible but have non-zero condensate fraction.  The superfluid is characterized by a finite stiffness \\cite{fisher:1973}.  \n\n\nThe trapping potential lowers the chemical potential in moving from the center to the edge of the trap.  The trap can (at a mean field level) be thought of as sweeping the chemical potential vertically through the phase diagram.  The vertical arrows in Fig.~\\ref{fig_phasediagram} depict the three regimes of the trapped disordered Bose-Hubbard model studied in this work.  The left, central, and right arrows indicate parameters such that the central region of the trap (the top of the arrow) hosts a disordered Mott insulator, Bose-glass, and disordered superfluid, respectively.  The edges in the trap are composed of a mixture of superfluid and Bose-glass states in all three regimes.  \n\nTo characterize the phases in the trap we compute local correlation functions.  Figs.~\\ref{fig_density_radius}a-c plot the local density as a function of distance from the trap center.  The density qualitatively reveals the location on the phase diagram, with $\\langle \\hat{n} \\rangle\\approx1$ indicating the Mott insulator.  The local density fluctuations:\n\\begin{eqnarray}\n\\langle \\Delta n_{i}^{2} \\rangle \\equiv \\langle \\hat{n}_{i}^{2} \\rangle - \\langle \\hat{n}_{i} \\rangle^{2},\n\\end{eqnarray} \ncapture the local compressibility since: $\\langle \\Delta n_{i}^{2} \\rangle \\propto \\kappa_{i} k_{B}T$, where $T$ is temperature and local compressibility is $\\kappa_{i}=\\partial \\langle \\hat{n}_{i} \\rangle/\\partial \\mu$.  Figs.~\\ref{fig_density_radius}d-f plot the density fluctuations as a function of distance from the trap center.  The jump in fluctuations at the edge (in Figs.~\\ref{fig_density_radius}e and \\ref{fig_density_radius}f) indicate compressible edge states.   We have also used the superfluid order parameter and other correlation functions to identify the location on the phase diagram.\n\n\n\n\\section{Center of Mass Dynamics}\n\\label{sec_shortcm}\n\nThis section presents our primary results by correlating center of mass dynamics with phases in the center of the trap.  We find that even with moderately strong disorder, the superfluid phase oscillates.  Strong interaction significantly damps superfluid motion.  But when the center of the trap enters the Bose-glass and Mott phases, the center of mass dynamics slows considerably.  By computing the density in the lattice we find that the center of the system fails to move. Here the dynamics is dominated by flow along the edges.  \n\n\n\\begin{figure*}[t]\n  \\includegraphics[width=\\textwidth]{Figures/2D_density_U_26_Delta_0p3U_Omega_0p02U_mu_0p5U_DeltaR0_1.pdf}\n  \\caption{(Color online) The same as Fig.~\\ref{fig_density_U_8} but for an interaction strength of $U=26t$ (parameters of Fig.~\\ref{fig_com_time_8_48}d) which corresponds to a Bose-glass in the center of the trap (central arrow in Fig.~\\ref{fig_phasediagram}).  At $\\tau=0.8\\hbar/t$ we see the first mechanism of transport where at short times the edge state quickly slips around the central insulator, depicted in the left panel of Fig.~\\ref{fig_schematic_flow}.  At $\\tau=8\\hbar/t$ and $80\\hbar/t$ we see a different, two-step mechanism of transport, depicted in the right panel of Fig.~\\ref{fig_schematic_flow}.  Here the particles first slowly tunnel out of the central insulator to, in the second step, get pushed quickly along the edges.  In the two right snapshots, lateral tunneling events and a shrinking of the central insulator can be seen.}\n  \\label{fig_density_U_26}\n\\end{figure*}\n\n\n\n\\subsection{Superfluid Dynamics}\n\\label{sec_superfluidcm}\n\nWe start with the center of mass dynamics of the superfluid (see the right vertical arrow in Fig.~\\ref{fig_phasediagram}). Figs.~\\ref{fig_com_time_8_48}a-c show damped oscillations of the superfluid in the presence of disorder.  For large interaction strengths the superfluid quickly relaxes to sit at the trap center, Fig.~\\ref{fig_com_time_8_48}c.   Here the interplay of interactions and disorder dephase the initial state to effectively relax the system to the ground state of the new trap position.  This is in contrast to single particle motion in the trap where recurrences show that the wavefunction does not dephase in the absence of a reservoir or noise \\cite{rey:2005}.  Fig.~\\ref{fig_density_U_8} plots the local density at three different times to demonstrate the center of mass oscillations of the superfluid. \n\n\\subsection{Short-Time Insulator Dynamics}\n\\label{sec_insulatorlong}\n\n\nWe now turn to the center of mass trap dynamics in regimes where either the Bose-glass or Mott insulator lies in the center of the trap (see the left two vertical arrows in Fig.~\\ref{fig_phasediagram}).  The state propagated in Fig.~\\ref{fig_com_time_8_48}d has a Bose-glass in the center while Fig.~\\ref{fig_com_time_8_48}f has a Mott insulator.  Fig.~\\ref{fig_com_time_8_48}e shows an intermediate regime on the border of the Mott/Bose-glass transition.  On short time scales, the Bose-glass and Mott states should display insulating behavior because they are both locally gapped.  \n\n\nFigs.~\\ref{fig_com_time_8_48}d-f show two distinct regimes: short times ($\\tau \\lesssim \\hbar/t$) and long times ($\\tau \\gg \\hbar/t$).  At short times the center of mass quickly slips to a new value.  Here the initial slip is most prominent in the Bose-glass regime, Fig.~\\ref{fig_com_time_8_48}d.  The next section will discuss the long-time dynamics.\n\n\nThe left panel of Fig.~\\ref{fig_density_U_26} shows the density for $U=26 t$ (the Bose-glass regime) after a very short time.  Here we see that at short times the density flows in a ring around the edge.  We have checked that the initial center of mass velocity responds linearly to the applied force.  \n\n\\begin{figure}[t]\n  \\includegraphics[width=0.7\\linewidth]{Figures/com_vs_time_variousDeltaR0_U_26_variousU_Delta_0p3U_Omega_0p02U_mu_0p5U.pdf}\n  \\caption{(Color online) The disorder averaged center of mass position plotted as a function of time for: (a) several different trap shifts for $U=26$ and (b) several different $U$ for $\\Delta R_{0}=a$.  The model parameters are otherwise the same as Fig.~\\ref{fig_density_radius}.  In panel (a) we see that different trap shifts do not change the long time center of mass velocity (the slope is nearly constant).  But in panel (b) we see that the slope depends on $U$.  }\n  \\label{fig_com_time_BG_MI_variousD}\n\\end{figure}\n\nThe redistribution of the initial edge density corresponds to motion of the edge superfluid at velocities consistent with the band motion of individual edge particles.  The left panel of Fig.~\\ref{fig_schematic_flow} depicts short-time edge flow.  We verify that the times required for edge particles to move a distance on the order of the cloud size are consistent with our simulations.  If we consider a one-dimensional approximation to the edge state, the tight-binding energy of a single particle is $-2t\\cos(ka)$ where $k$ is the lattice wavevector.  The group velocity of the particle is then $\\sim 2at/\\hbar$.  The $U=26t$  insulator extends 4 lattice sites.  The total time for the edge particle to travel the length of the system is then $2 \\hbar/t$, consistent with the result from our simulations, $\\approx2.5 \\hbar/t$.  \n\nOur results show that the initial dynamics of trapped insulators reflect the motion of edge states.  The edge moves quickly, on time scales consistent with the motion of free particles.  We have also checked that, for short times, the center of mass velocity responds linearly to an applied potential.  We now turn to the long-time regime.\n\n\\subsection{Long-Time Insulator Dynamics}\n\\label{sec_insulatorlong}\n\nAfter the initial slip we find a regime of \\emph{constant center of mass velocity} at long times, $\\tau \\gg \\hbar/t$ (Figs.~\\ref{fig_com_time_8_48}d-f).  A naive expectation would be that the constant velocity is established by a slow drift of the center of mass as a whole where the disorder strength sets a scattering rate.  We find that the this picture is not correct.  Fig.~\\ref{fig_com_time_BG_MI_variousD}a shows that the long-time center of mass velocity does not change with the application of a linear potential and is therefore terminal (recall that the trap shift, $\\Delta R_{0}$, effectively applies a linear potential).  This behavior contrasts with behavior expected from a Drude-type model of transport where the center of mass as a whole would respond linearly to a weak potential. \n\n\nTo better understand the mechanism behind the terminal velocity at long times we study the density as a function of time.  The density in the trap plotted for several different times (the two right panels in Fig.~\\ref{fig_density_U_26}) reveals a two step process for long-time edge flow (right panel of Fig.~\\ref{fig_schematic_flow}).  First, a particle tunnels out of the center to the edge at a rate determined by the competition between the local gap in the center and the trapping potential.  In the second stage, the particle quickly moves along the edge to redistribute the center of mass.  Repeated tunneling out of the center followed by flow along the edge then results in a center of mass shift. Slow tunneling into the edge allows edge flow at long times and therefore dictates the time scale for center of mass motion. \n\nTo verify the two-step picture we construct a simple model to estimate the velocity at long times.  Appendix~\\ref{sec_two_site} uses a two-site model to show that in the absence of disorder the tunneling rate out of the center only depends on the trapping frequency, tunneling, and interaction strength.  The velocity in our two-site model is therefore independent of the trap shift.  We also find that the velocity expected from our two-site model compares well with our simulations. \n\nThe two-step picture and our simple model do suggest that the center of mass velocity should depend on $U$.  Fig.~\\ref{fig_com_time_BG_MI_variousD}b shows that the  long-time center of mass velocity varies with $U$.  Here stronger $U$ suppresses tunneling out of the bulk because the trap must compensate with high edge energies to confine the system.  We have checked that the $U$ dependence of the two-site model is consistent with our simulation.\n\n\nWe now discuss the long-time center of mass velocity as a direct measure of insulating behavior in the trap \\cite{scarola:2006a}.  We compute: \n\\begin{eqnarray} \nV_{\\text{CM}} (\\infty)\\equiv\\lim_{\\tau\\rightarrow\\infty}\\frac{1}{\\tau} \\int_{\\tau_{0}}^{\\tau}d\\tau'V_{\\text{CM}} (\\tau'), \n\\label{eq_vcm_long}\n\\end{eqnarray} \nwhere the limit $\\tau\\rightarrow\\infty$ is understood to imply a long time average such that the insulating states do not reach the center of the trap.  We choose $\\tau_{0}=20 \\hbar/t$ to include only long-times by avoiding integration over the short-time dynamics.  We expect that $V_{\\text{CM}} (\\infty)$ should vanish for both immobile states and for states that oscillate about the trap center because there is no net center of mass velocity for an oscillating state.\n\nFig.~\\ref{fig_velocity_long_vs_U} plots the long-time center of mass velocity in the trap as a function of $U$.  Varying $U$ allows access to the superfluid, Bose-glass, and Mott.  We find that $V_{\\text{CM}} (\\infty)$ is zero in the superfluid phase because the superfluid oscillates in the trap.  But at long times the center of mass performs a slow drift in insulating phases to lead to a non-zero $V_{\\text{CM}} (\\infty)$.  The Bose-glass phase shows the largest velocity because the tunneling out of the bulk into the edge is the fastest here.  But the large $U$ Mott limit restricts tunneling into the edge to eventually stop center of mass motion.\n\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.95\\linewidth]{Figures/long_time_velocity_vs_U_Delta_0p3U_Omega_0p02U_mu_0p5U_DeltaR0_1.pdf}\n  \\caption{(Color online) The disorder averaged center of mass velocity at long times [Eq.~(\\ref{eq_vcm_long})] plotted as a function of interaction strength.  For weak interactions the entire system is in the superfluid (SF) phase and frequent center of mass oscillations results in a zero net velocity.  For intermediate interaction strengths the Bose-glass (BG) lies in the trap center.  Here the two-step edge flow mechanism depicted in the right panel of Fig.~\\ref{fig_schematic_flow} allows a small but finite center of mass velocity.  At large interaction strengths the center of the system is in the Mott regime (MI) where tunneling into the edge (and therefore the center of mass velocity) is strongly suppressed.  }\n  \\label{fig_velocity_long_vs_U}\n\\end{figure}\n\nThe long time center of mass velocity responds to disorder and trapping.  We have checked that the center of mass velocity in the insulating phases is suppressed by increasing disorder or trapping frequency.  Here strong disorder and trapping impact both processes depicted in the right panel of Fig.~\\ref{fig_schematic_flow}.  They suppress tunneling out of the center into the edge while also restricting flow along the edge.  \n\n\\section{Summary}\n\\label{sec_summary}\n\nWe have studied the zero temperature trap dynamics of states prepared in a disordered Bose-Hubbard model.  We have computed the center of mass velocity of a disordered superfluid, a disordered Mott insulator, and a Bose-glass using Gutzwiller mean field theory.   While the superfluid exhibits damped oscillations for strong interaction strengths, the other two states are essentially motionless insulators at the trap center.  \n\nWe find that the center of mass velocity of trapped insulators is dominated by the flow of edge states.  We also find two time scales for the trapped insulators.  At short time scales the edge superfluid flows around the insulating bulk to move the center of mass.  But at longer time scales, tunneling out of the bulk to the edge establishes a slow drift of the center of mass.\n\n\nOur results can be used to identify insulating states in trapped optical lattices.  We find that, at long times, the edge flow around the Bose-glass can lead to center of mass velocities that are much larger than in the Mott.  We have studied parameter regimes that are similar to what has been explored in experiments.  In Ref.~\\cite{pasienski:2010}, for example, experiments were done using a speckle disorder potential applied to $^{87}$Rb atoms in a cubic optical lattice.  Here the Hubbard parameters were: $t/U\\sim0.005-0.3$ and the trapping potential keeps the density near 1.4 at the trap center.  The speckle disorder leads, most prominently, to an exponentially distributed onsite disorder potential in $\\mu_{i}$ \\cite{zhou:2010} which differs from our study.  But finite temperature effects should lead to the most important difference between our study and previous experiments.  Our results have so far excluded finite temperature effects while experiments \\cite{pasienski:2010} have been done in the regime  $k_{\\text{B}}T\\sim 3t $. \n\nAs a next step we will include non-zero temperatures in the initial state.  We expect that for very low temperatures, $k_{\\text{B}}T\\ll t$, our $T=0$ results will be qualitatively similar.  But for intermediate temperatures, $t \\lesssim k_{\\text{B}}T <U$, thermally assisted tunneling out of the central insulators and into the edge will significantly enhance the center of mass velocity.  Our results therefore offer a lower bound on the center of mass velocity.\n\n\\acknowledgements\n\nVWS acknowledges helpful discussions with B. DeMarco. We acknowledge support from AFOSR under grant FA9550-15-1-0445.\n\n\\appendix\n\n\\section{Two-site Tunneling Time}\n\\label{sec_two_site}\n\nIn this section we model the tunneling out of an insulating state at the trap center and into an edge state using a two-site effective model.  Fig.~\\ref{fig_twosites} shows part of a Mott insulator along one direction in the lattice.  The curved line depicts the trapping potential which eventually zeroes the edge density.  The trapping potential energy must be on the order of the interaction energy to zero the density.   \n\nWe consider a two-site tunneling model Hamiltonian,\n\\begin{eqnarray}\nH_{2} = - t  \\left( b_1^\\dagger b^{\\vphantom{\\dagger}}_2 + b_2^\\dagger b^{\\vphantom{\\dagger}}_1 \\right) + V   b_2^\\dagger b^{\\vphantom{\\dagger}}_2 ,\n\\end{eqnarray}\nwhere $V$ is the relative energy gap between the two sites.  $V$ is a fitting parameter on the order of the Mott gap.\n\n\\begin{figure}[t]\n\\vspace{0.2cm}\n  \\includegraphics[width=0.9\\linewidth]{Figures/two_sites.png}\n \\caption{(Color online)  Schematic showing sites of a lattice (dashes) along one direction filled up to site 1 with particles.  Site 2 is an empty edge site.  Tunneling from site 1 to site 2 is controlled with a potential, $V$, at site 2.  The dotted line depicts the parabolic trapping potential which zeroes the edge density. }\n \\label{fig_twosites}\n\\end{figure}\n\n\n\nSolving the Schr{\\\"o}dinger equation, we obtain the population on site 2, \n\\begin{eqnarray}\nn_2 = \\frac{2 t^2}{4 t^2+V^2}\\left\\{ \\cos \\left[ \\sqrt{4 t^2+ V^2} (\\tau/\\hbar) \\right]-1\\right\\}.\n\\end{eqnarray} \nThe tunneling rate from site 1 to site 2 can then be defined as,\n\\begin{eqnarray}\n\\Gamma =\\max_{\\tau} \\frac{dn_2}{d\\tau}= \\frac{2 t^2}{\\hbar\\sqrt{4 t^2+ V^2}}.\n\\end{eqnarray} \n$\\Gamma$ gives correct limits:\n$\\Gamma\\rightarrow t$ for $V \\rightarrow 0$  and $\\Gamma\\rightarrow 0$ for $ V \\rightarrow \\infty$.\n\nUsing $\\Gamma$ as an estimate for the tunneling rate out of the central insulator we can estimate the order of magnitude of the center of mass velocity.  Once the particle tunnels out of the center it then travels along the edge a distance $l$.  The center of mass velocity in this approximation becomes:\n\\begin{eqnarray}\nv= \\frac{\\Gamma l}{N}=\\frac{2 t^2 l}{N\\hbar\\sqrt{4 t^2+ V^2}},\n \\end{eqnarray} \nwhere $N$ is the total particle number in the trap.  To compare this estimate with the our simulations we substitute appropriate parameters.  For $U=26t$ and with parameters $V \\simeq 0.5U=13t$, $l\\simeq 2$, and $N=78$, we get a center of mass velocity $v=0.00435$ $at/\\hbar$, which is on the same order as our simulation result, $0.00432$ $at/\\hbar$ computed for $\\Delta=0$, $\\Omega=0.02U$, and $\\mu=0.5U$. \n\n\n\\bibliography{/Users/scarola/Desktop/Dropbox/Jabref_database/jabref_database_8_28_15}\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\title{Dynamics of Disordered States in the Bose-Hubbard Model with Confinement}\n\\author{Mi Yan, Hoi-Yin Hui, and V. W. Scarola}\n\\affiliation{Department of Physics, Virginia Tech, Blacksburg, Virginia 24061}\n\n\\begin{abstract}\nObservations of center of mass dynamics offer a straightforward method to identify strongly interacting quantum phases of atoms placed in optical lattices.  We theoretically study the dynamics of states derived from the disordered Bose-Hubbard model in a trapping potential.  We find that the edge states in the trap allow center of mass motion even with insulating states in the center.  We identify short and long-time scale mechanisms for edge state transport in insulating phases.  We also argue that the center of mass velocity can aid in identifying a Bose-glass phase.  Our zero temperature results offer important insights into mechanisms of transport of atoms in trapped optical lattices while putting bounds on center of mass dynamics expected at non-zero temperature.\n\\end{abstract}\n\\date{\\today}\n\\pacs{03.75.Lm,03.75.Kk,67.85.Hj,67.85.De}\n\n\\maketitle\n\n\\section{Introduction}\n\nUltracold atomic and molecular gases placed in optical lattices realize strongly correlated states of matter captured by Hubbard models \\cite{jaksch:1998,greiner:2002,lewenstein:2007,bloch:2008}.  Hubbard models are known to support fundamentally important states that serve as paradigms for understanding quantum collective behavior in solids.  New methods to observe and study these collective phases in optical lattices have been invented to better probe interesting quantum behavior.  Example diagnostics include Bragg spectroscopy \\cite{birkl:1995,weidemuler:1995} (applied recently to measure \\cite{hart:2015} local  antiferromagnetic spin correlations \\cite{corcovilos:2010,fuchs:2011,kozik:2013}), noise spectroscopy \\cite{altman:2004,foelling:2005,spielman:2007}, and center of mass transport.  \n\n\nCenter of mass transport experiments in optical lattices are often used to probe response in direct analogy to transport in solids.  In optical lattice transport the center of mass is shifted and the dynamics is observed using time of flight.  Transport studies of bosonic atoms in optical lattices have been used to study superfluid and Mott insulating states, states of the Bose-Hubbard model \\cite{cataliotti:2001,cristiani:2004,fallani:2004,fertig:2005,desarlo:2005,henderson:2006,mun:2007,fallani:2007,mckay:2008,white:2009,pasienski:2010}.  When the system is in a superfluid state it oscillates within the trapping potential.  The Mott insulator shows, by contrast, essentially no dynamics for very strong interactions.  More recently, disorder has been implemented \\cite{lye:2005,clement:2005,lye:2007,fallani:2007,billy:2008,roati:2008,chabe:2008,chen:2008,aspect:2009,white:2009,pasienski:2010,robert:2010,tanzi:2013} to further probe glassy states expected from a competition between strong disorder and inter-particle interactions.  In the experiments of Ref.~\\cite{pasienski:2010} it was argued that the suppression of center of mass transport indicated the presence of a Bose-glass, a state of the Bose-Hubbard phase diagram induced by disorder.\n\n\\begin{figure}[t]\n  \\includegraphics[width=\\linewidth]{Figures/schematic_flow.png}\n  \\caption{(Color online) Schematic showing two distinct mechanisms for center of mass dynamics after an initial shift of the trapping potential to the left.  The center of the system is in an insulating phase (either the Mott insulator or the Bose-glass) but the edges are superfluid. Left Panel:  We find that initially (on times scales shorter than the inter-site tunneling) the edge superfluid quickly moves around the insulator to the left to redistribute the total center of mass.  Right Panel:  We find that (on time scales much larger than the inter-site tunneling) a two stage process shifts the center of mass.  First particles slowly tunnel out of the central insulator into the edges (vertical arrows).  Then the particles quickly move to the left along the edge to redistribute the center of mass.}\n  \\label{fig_schematic_flow}\n\\end{figure}\n\nOptical lattice transport experiments have fundamental and crucial differences from solid state transport.  Particles in optical lattices are, to a good approximation, isolated systems.  The absence of a heat bath prevents direct thermalization.  Thermalization of initial states occurs via inter-particle interactions \\cite{mckay:2011}.  The system can therefore be slow to thermalize during transport because there is no external bath.  Furthermore, the absence of lattice phonons avoids conventional assumptions of dephasing often invoked in solids.  Other thermal effects are also very different.  For example, the absence of a particle number bath prevents transport via variable range hopping.  But the most pronounced differences arise from strong trapping.  In optical lattice experiments the response of the center of mass must be understood in the context of a parabolic trapping potential which mixes phases in the trap and leads to edge states \\cite{jaksch:1998,lewenstein:2007,scarola:2007}.  \n\nIn this work we study the dynamics of bosons in a disordered Bose-Hubbard model in the presence of a trap.  We seek to identify the precise mechanisms of transport in a trap and correlate the response with known phases.  We will include disorder to study the dynamic response of the following phases to an external field: a disordered superfluid, a Bose-glass, and a disordered Mott insulator as in Ref.~\\cite{lin:2012} but in the presence of confinement.  We will also focus entirely on the zero temperature response to identify purely quantum transport effects that should underpin low temperature experiments.  \n\nWe find that the insulating states (Bose-glass and Mott insulator) have center of mass motion that is dominated by edge effects.  Our simulations show that when the center of the system is in an insulating phase, it remains motionless under a trap shift, while the edge states move to therefore move the center of mass.  Fig.~\\ref{fig_schematic_flow} shows a schematic depicting distinct mechanisms of transport that we find.  The left panel depicts what we find at short times (with respect to the single-particle inter-site tunneling time scale).  Here we find that the edge states surrounding an insulator quickly move and dominate the center of mass motion.  \n\nBut at long times we find that disordered insulating states drift slowly (the center of mass moves only a site or two for times on the order of 100 times the inter-site tunneling).  The insulating states reach a terminal velocity that does not change with the applied field.  This is contradictory to the conventional Drude-type picture of particle motion.  We instead propose a two-stage process in which slow tunneling into edge states (right panel of Fig.~\\ref{fig_schematic_flow}) slowly moves the center of mass while leaving the central insulator motionless.  \n\nOur results reveal mechanisms for center of mass transport.  The presence of a trap leads to edge states.  The edge states are responsible for motion of the center of mass via two distinct mechanisms, one at short times and one at long times.  These mechanisms also differ from conventional pictures of bulk transport in solids where an applied field leads to an average drift of all particles.  Our results establish a basis for interpreting measurements of center of mass dynamics of atoms trapped in optical lattices.  \n\n\n\\section{Model}\n\\label{sec_model}\n\nOngoing optical lattice experiments containing bosonic alkali atoms are accurately captured by the Bose-Hubbard model \\cite{jaksch:1998}.  Controlled disorder, applied through speckle laser light or incommensuration \\cite{lewenstein:2007}, can significantly alter the phase diagram and therefore impact transport.  Transport experiments \\cite{pasienski:2010} can be understood from an interplay of temperature, disorder, trapping, and interactions \\cite{scarola:2015}. In this work we study zero temperature effects to focus on just disorder, trapping, and interactions.   \n\nWe study the dynamics of states of the disordered Bose-Hubbard model to assess transport properties in a parabolic trapping potential.  The Bose-Hubbard Hamiltonian is given by:\n\\begin{eqnarray}\nH = - t \\sum_{\\langle i,j \\rangle}  b_i^\\dagger b_j  + \\frac{U}{2}\\sum_i \\hat n_i (\\hat n_i - 1) +\\sum_i  \\mu_i \\hat n_i,\n \\label{bhmodel}\n\\end{eqnarray}\nwhere $b_{i}^{\\dagger}$ creates a boson at the site at lattice position ${\\mathbf{R}_i}$ and $\\hat{n}_{i}= b_{i}^{\\dagger} b_{i}^{\\phantom\\dagger}$ is the number operator.  Here $\\langle i,j\\rangle$ denotes summation over nearest neighbor sites.  \n$t$ is the single-particle nearest neighbor tunneling amplitude and $U$ is the on-site repulsive interaction energy.  The spatially inhomogeneous  chemical potential is: \n\\begin{eqnarray}\n\\mu _{i}=-\\mu+ \\Omega \\vert {\\mathbf R}_i - {\\mathbf R}_0(\\tau) \\vert^2+\\epsilon_{i},\n\\label{eq_muj}\n\\end{eqnarray}\nwhere the central chemical potential, $\\mu$, tunes the average density. $\\Omega$ is the strength of the harmonic trapping potential and $\\vert {\\mathbf R}_i - {\\mathbf R}_0(\\tau) \\vert$ defines the distance between a site $i$ and the trap center, ${\\mathbf R}_0(\\tau)$.  We work on a two-dimensional square of side lengths $L=L_{x}=L_{y}$.  We choose $L$ so that the density for edge sites vanishes for all trap frequencies used.  Distances are measured in units of the lattice spacing, $a$.  The trap center is a function of time, $\\tau$, and, in what follows, will be immediately shifted along the negative $x$ direction a distance $\\Delta R_{0}$ to induce particle number flow at $\\tau>0$.  The total pulse sequence is then: $ {\\mathbf R}_0(\\tau)=0$ for $\\tau\\leq 0$ and ${\\mathbf R}_0(\\tau)= -|\\Delta R_0| \\hat{x}$ for $\\tau> 0$.  By expanding the squared term in $\\mu_{i}$ we see that the trap shift can be thought of as an applied linear potential: $\\sim 2\\Omega {\\mathbf R}_i \\cdot \\hat{x} (\\Delta R_0)$.\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.9\\linewidth]{Figures/schematic_phase_diagrams.png}\n  \\caption{ (Color Online) Schematic mean field phase diagram of the disordered Bose-Hubbard model [Eq.~(\\ref{bhmodel})] in the absence of a trap, $\\Omega=0$. The black regions indicate the incompressible Mott insulators found at integer densities.  The grey regions indicate the compressible Bose-glass that separates the Mott from the superfluid.  The three vertical arrows depict how the trapping potential lowers the local chemical potential as we move from the center of the system (top of the arrow) to the edge (bottom of the arrow).  The three arrows represent regimes studied here, where the center of the system contains a:  disordered Mott insulator (left), Bose-glass (center), and disordered superfluid (right).  }\n  \\label{fig_phasediagram}\n\\end{figure}\n\n$\\epsilon_i$ denotes a random energy shift at the $i$th site.   In our study, the disorder is uniformly distributed with $\\epsilon_i\\in\\{-\\Delta/2,\\Delta/2\\}$.  Specifically, we use the box probability distribution function:\n \\begin{eqnarray}\n  P(\\epsilon)=\\frac{\\Theta \\left(\\Delta-\\vert\\epsilon\\vert \\right)}{2\\Delta},\n   \\label{eq_PU}\n \\end{eqnarray}\nwhere $\\Delta$ is the strength of the disorder and $\\Theta$ is the Heaviside step function. \n\n\\begin{figure}[t]\n\\centering\n  \\begin{tabular}{@{}cc@{}}\n    \\includegraphics[width=.23\\textwidth]{Figures/density_vs_radius_U_8_U_26_U_48_Delta_0p3U_Omega_0p02U_mu_0p5U.pdf} &\n    \\includegraphics[width=.24\\textwidth]{Figures/density_fluctuation_vs_radius_U_8_U_26_U_48_Delta_0p3U_Omega_0p02U_mu_0p5U.pdf} \n\\end{tabular}\n  \\caption{Panels (a)-(c) plot the disorder averaged local density in the initial state as a function of distance from the center of the trap.  Panels (a) and (c) have a superfluid and Mott insulator in the trap center, respectively.  Panel (b) is in an intermediate regime.  Model parameters are chosen to be: disorder strength $\\Delta=0.3U$, trap strength $\\Omega=0.02U$, and central chemical potential $\\mu=0.5U$.  Panels (d)-(f) plot the same but for the disorder averaged local density fluctuations in the initial state.  The density fluctuations in panels (e) and (f) show the edge superfluid. Error bars result from disorder averaging.}\n  \\label{fig_density_radius}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n  \\begin{tabular}{@{}cc@{}}\n    \\includegraphics[width=.24\\textwidth]{Figures/com_vs_time_U_8_U_12_U_16_Delta_0p3U_Omega_0p02U_mu_0p5U_DeltaR0_1.pdf} &\n    \\includegraphics[width=.23\\textwidth]{Figures/com_vs_time_U_26_U_36_U_48_Delta_0p3U_Omega_0p02U_mu_0p5U_DeltaR0_1.pdf} \n\\end{tabular}\n  \\caption{The disorder averaged center of mass position along the $x$-direction plotted as function of time for various interaction strengths, $U$.  The trap shift is chosen to be $\\Delta R_{0}=a$ and other model parameters are the same as Fig.~\\ref{fig_density_radius}.  Panels (a)-(c) are initially in the disordered superfluid state. In panel (d) the center of the system is initially in the Bose-glass state whereas panel (f) is initially in the Mott state.  The inset to panel (d) shows the short-time behavior. Panel (e) is initially in an intermediate state.  In panels (d)-(f), the center of mass has a nearly constant velocity for $\\tau\\gg\\hbar/t$. }\n  \\label{fig_com_time_8_48}\n\\end{figure}\n\n\nTo study the dynamics we use a stochastic mean field decoupling performed using variational wavefunctions: the time-dependent Gutzwiller ansatz \\cite{rokhsar:1991,jaksch:2002}.  The ansatz yields wavefunctions whose static expectation values agree very well with numerically exact quantum Monte Carlo \\cite{zakrzewski:2005}.  The wavefunction at time $\\tau$ is assumed to be in the product form:\n\n", "index": 1, "text": "\\begin{equation}\n|\\Psi_{\\rm GW}(\\tau)\\rangle=\\prod_{i}\\left[\\sum_{n=0}^{\\infty}f_n^{(i)}(\\tau) |n\\rangle_i \\right],\n\\label{eq_wf}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"|\\Psi_{\\rm GW}(\\tau)\\rangle=\\prod_{i}\\left[\\sum_{n=0}^{\\infty}f_{n}^{(i)}(\\tau%&#10;)|n\\rangle_{i}\\right],\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi mathvariant=\"normal\">Ψ</mi><mi>GW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mi>i</mi></munder><mrow><mo>[</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msubsup><mi>f</mi><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">⟩</mo></mrow><mi>i</mi></msub></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]