[{"file": "1601.08170.tex", "nexttext": "\nwhere $\\Theta(x)=1$ if $x>0$, zero otherwise, $d <R$ are the inner and outer radii,  and $A,\\  D > 0$. $D$ is the height of the potential barrier at the outer radius $R$, whereas $A+D$ is that at the inner core radius $d$. If $A=0$, then (\\ref{pot}) represents a soft core potential of radius $R$. Henceforth, we  take $\\epsilon=\\hbar^2/mR^2$ as our energy and temperature unit, and $R$ as the unit of length.\\\\ \\indent \nWhile obviously oversimplified, the above minimal model contains all the necessary elements allowing us to address the physical issues of interest. The basic qualitative and quantitative results are not expected to depend significantly on the details of the potential at the two most relevant distances, namely $d$ and $R$ (this conclusion has already been established quantitatively for the case of soft core repulsions \\cite{boninsegni11}).\n\\\\ \\indent\nWe studied the low temperature physical properties of the system at a fixed value of the density, namely $\\theta=4$, and for a strength of the the outer (soft) core $D=5$. We chose these values because a supersolid cluster crystal phase is known to exist at low temperature, for $A=0$, namely with no inner hard core \\cite{boninsegni11}. We obtained results for different values of $d$ and $A$.\n\\\\ \\indent Our study consists of Quantum Monte Carlo simulations, based on  the Worm\nAlgorithm in the continuous-space path integral representation \\cite{worm,worm2}. Because this well-established computational methodology is thoroughly described elsewhere, we do not review it here. The most important aspects to be emphasized here, are that it enables one to compute thermodynamic properties of Bose systems at finite temperature, directly from the microscopic Hamiltonian, in particular  energetic, structural and superfluid properties, in practice with no approximation. \nIn particular, it has consistently proven a superior option in the investigation of the low temperature physics of Bose systems, featuring significant advantages over ground state methods such as Diffusion Monte Carlo (DMC), the most notable being the absence of bias arising from the use of a trial wave function or a finite population of random walkers \\cite{bm,h2}, as well as the fact that it offers access to off-diagonal correlations such as the one-body density matrix, not accessible exactly to DMC \\cite{mb}.\n\\\\ \\indent\nTechnical details of the simulation are standard, and we refer the interested reader to Ref. \\onlinecite{worm2}. \nWe used the primitive high-temperature approximation for the many-particle propagator; while this is not the most efficient form for the particular system of interest, nonetheless it proves adequate for the scope of this study. All of the results reported here are extrapolated to the $\\tau\\to 0$ limit.\n\\\\ \\indent\nThe relevant physical quantities computed in this study are the pair correlation function, which allows on to monitor structural changes (away from the cluster crystal phase), as well as the superfluid density, both the global (computed using the well-known ``winding number\" estimator \\cite{pollock}), as well as the local one (i.e., inside the individual  clusters \\cite{noi}).  Finally, the Worm Algorithm also allows for the unbiased evaluation of  the one-body density matrix, which is connected to the observable momentum distribution.\n\\\\ \\indent\nAll of the results presented here are at temperature $T$=0.5 (in our energy units), which is known to be low enough for the soft core system with the above parameters $D$ and $R$ to be essentially in its ground state \\cite{boninsegni11}.  We simulated systems comprising a number of particles $N$=144 and 576. Simulations yield consistent results for the two system sizes.\n\\section{Results}\\label{sere}\nIf $A=0$ in (\\ref{pot}), the density $\\theta=4$ (i.e., the mean interparticle distance is 0.5 $R$) and $D=5$, then the ground state of the system is a supersolid cluster crystal,  with clusters comprising approximately 7 particles arranged on a triangular lattice (shown in Fig. \\ref{f1}). The superfluid fraction of the system is $\\sim $ 8\\% in the $T\\to 0$ limit \\cite{boninsegni11,note}. \n\\begin{figure}[h]\n\\centerline{\\includegraphics[height=3.2in]{f1}}\n\\caption{Density snapshot of a soft core system with $D$=5 at a density $\\theta=4$ and at temperature $T$=0.5 (see text for the units). The simulated system comprises 576 particles. }\n\\label{f1}\n\\end{figure}\n\\begin{figure}[h]\n\\centerline{\\includegraphics[height=2.5in]{f2}}\n\\caption{Superfluid fraction $\\rho_S$ of the system at temperature $T$=0.5, computed as a function of the parameter $A$ of the inner hard core of the interparticle potential (Eq. \\ref {pot}), for different values of the inner core radius $d$.\nWhen not explicitly shown, statistical errors are smaller of the symbol size.}\n\\label{f2}\n\\end{figure}\nPhysically, the effect of a hard core repulsion at short distances can be expected to be that of breaking down the clusters, thereby restoring translational invariance and stabilizing a homogeneous superfluid.  Fig. \\ref{f2} shows the computed superfluid fraction $\\rho_S$ of the system as a function of the parameter $A$ of the inner core of the interparticle potential (Eq. \\ref{pot}), for three different values of the inner core radius $d$ (expressed in units of $R$, the outer, ``soft\" core radius).\\\\ \\indent\nFor the  largest value of $d$ (0.1),  $\\rho_S$ increases rapidly with $A$, approaching unity for $A\\sim 35$. However, for intermediate values of $A$ (e.g., 15), the system is still in the supersolid phase, as shown by the well-defined oscillations of the pair correlation function $g(r)$, shown  in Fig. \\ref{f3}, as well as by density snapshots such as the one shown in Fig. \\ref{f1}.  As $A$ is increased further, to 35, the $g(r)$ is essentially flat, and any remnant of solid order has disappeared.\n\\begin{figure}[h]\n\\centerline{\\includegraphics[height=2.3in]{f3}}\n\\caption{Pair correlation function for the system at temperature $T$=0.5, computed for three different values of the parameter $A$ in Eq. \\ref{pot}. The value of the inner core radius $d$ is 0.1.}\n\\label{f3}\n\\end{figure}\n\\\\ \\indent\nThe superfluid fraction for $A=15$ is close to 40\\%, i.e., significantly strengthened with respect to the soft core \n(i.e., $A=0$) case. The physical reason for the increased superfluid response is the enhanced tunnelling between adjacent clusters caused by the higher inner potential barrier. This is confirmed by the calculation of the one-body density matrix $n(r)$, shown in Fig. \\ref{f4}, always at $T$=0.5 and for $d=0.1$, for the same three values of $A$ of Fig. \\ref{f3}. The oscillations which are a signature of the supersolid are still clearly visible for $A$=15, whereas no evidence of them is left for $A$=35.\n\\begin{figure}[h]\n\\centerline{\\includegraphics[height=2.3in]{f4}}\n\\caption{One-body density matrix computed at temperature $T$=0.5, computed for three different values of the parameter $A$ in Eq. \\ref{pot}. The value of the inner core radius $d$ is 0.1.}\n\\label{f4}\n\\end{figure}\nThe general trend illustrated by these results can also be observed for $d$=0.05. The main difference is that the solid order is more resilient, i.e., a greater height of the inner barrier is needed in order to ``melt\" the crystal. For example, in this case the system still displays solid order at this temperature for $A\\sim 30$, with a value of $\\rho_S$ close to as much as 70\\%. All of this points to an enhancement of the supersolid signal arising from the presence of multiple barriers of increasing (decreasing) height (radius).  Fig. \\ref{f1} shows a  linear dependence of $\\rho_S$ on $A$ in the supersolid phase, for $d=0.1$ and 0.05, with a slope that increases monotonically with $d/R$ (the results are not consistent with a dimensionally expected $(d/R)^2$ dependence). \n\\\\ \\indent\nWe were unable to fit the results obtained at the three different values of $d$ into a single pattern. As shown in Fig. \\ref {f2}, the estimates of the superfluid  fraction for the smaller value of $d$ considered, ($d=0.01$), are within the statistical errors of the calculation independent of the parameter $A$, at least over a range spanning several orders of magnitude. Indeed, we could not detect any significant change in the  value of $\\rho_S$, with respect to that corresponding to $A=0$, for $A$ as large as $2\\times 10^4$ \\cite{pipo}. Within the obvious limitations that a numerical study such as this one undoubtedly features, when it comes to making rigorous mathematical statements, these results do not rule out that, in the $d\\to 0$ limit, the supersolid cluster crystal phase may be robust against short-range, hard core repulsion of arbitrary strength. This would undermine the validity of the heuristic criterion \\cite{reatto} according to which the presence of a negative Fourier component in the interaction potential would be a necesary condition for the occurrence of a cluster crystal. Obviously, further studies will be needed to come to a definite conclusion on this subject. \n\\\\ \\indent\n\\section{Conclusions}\\label{conc}\nWe have studied by means of Quantum Monte Carlo simulations the stability of the 2D supersolid cluster crystal phase  of soft core bosons, in the presence of an inner repulsive hard core, which necessarily must exist in any realistic interatomic or intermolaecular pair-wise interaction. In general, within the obvious oversimplification of the model,  the results point to the robustness of the phase, if there exists a substantial difference in scale between the spatial extent of the region in which the potential is slowly varying (``flat\"), and the radius of the hard core repulsion. Indeed, our numerical results for a representative test case suggest that, if the ratio between inner and outer core radii is of order 1\\% or less, then the supersolid cluster crystal phase may be stable for an arbitrarily high inner barrier.\n\\\\ \\indent\nOn the other hand, for $d/R\\ {\\lower 2pt \\hbox{$\\buildrel>\\over{\\scriptstyle{\\sim}}$}}\\ 0.05$ a sufficiently high inner barrier causes the droplet crystal phase to melt into a homogeneous superfluid; there exists an intermediate range of inner core repulsive strength, however, the supersolid phase remains stable and the superfluid response is actually enhanced, as a result of increased tunnelling of particles among adjacent clusters. One could therefore think of exploiting this mechanism by engineering a modified soft core potential, featuring two or more steps; whether that is presently feasible using the Rydberg blockade or some other mechanism is unknown to us, but seems worthwhile a scenario to explore, as enhancing the signal will likely result in a more straightforward and unambiguous experimental detection.  \n\n\n\\section*{Acknowledgements}\n\nThis work was supported  by the Natural Science\nand Engineering Research Council of Canada. Computing support of Westgrid is gratefully acknowledged.\n\n\n\\begin{thebibliography}{0}\n\\bibitem{rmp}\nSee, for instance, M. Boninsegni and N. Prokof'ev, Rev. Mod. Phys. {\\bf 84}, 759 (2012).\n\\bibitem{hallock}\nFor a  recent account of the current status of the experimental and theoretical search for supersolidity in solid $^4$He, see M. H. W. Chan. R. B. Hallock and L. Reatto, J. Low Temp. Phys. {\\bf 172}, 317 (2013).\n\\bibitem{kc}\n E. Kim and M.H.W. Chan,\n{Science} {\\bf  305}, 1941 (2004).\n\\bibitem{chan2}\nDuk Y. Kim and M. H. W. Chan, Phys. Rev. Lett. {\\bf 109}, 155301 (2012).\n\\bibitem{pollet07}\nM. Boninsegni, A. B. Kuklov, L. Pollet, N. V. Prokof'ev, B. V. Svistunov and M. Troyer,  Phys. Rev. Lett. {\\bf 97}, 080401 (2006).\n\\bibitem{Andreev69} A. F. Andreev and I. M. Lifshitz,\n{Sov. Phys. JETP} {\\bf  29}, 1107 (1969).\n\\bibitem{Chester} G. V. Chester,\n{Phys. Rev. A} {\\bf  2}, 256 (1970).\n\\bibitem{boninsegni11}\nM. Boninsegni, J. Low Temp. Phys. {\\bf 168}, 137 (2012), and references therein.\n\\bibitem{gross}\nE. P. Gross, Phys. Rev. {\\bf 106}, 161 (1957).\n\\bibitem{saccani}\nS. Saccani, S. Moroni and M. Boninsegni, Phys. Rev. B {\\bf 83}, 092506 (2011).\n\\bibitem{saccani2}\nS. Saccani, S. Moroni and M. Boninsegni, \nPhys. Rev. Lett. {\\bf 108}, 175301 (2012). \n\\bibitem{ryd}\nSee, for instance, T. F. Gallagher, {\\it Rydberg Atoms}, (Cambridge University Press,Cambridge, UK, 1994).\n\\bibitem{henkel10}\nN. Henkel, R. Nath, and T. Pohl,\n {Phys. Rev. Lett.} {\\bf  104}, 195302 (2010).\n\\bibitem{greiner}\nSee, for instance, \nM. Greiner, O. Mandel, T. Esslinger, T. W. H\\\"ansch, and I. Bloch,\n{Nature} {\\bf  415},  39 (2002).\n\\bibitem{reatto}\nM. Rossi, S. L. Zavattari, D. E. Galli and L. Reatto, Phys. Rev. B {\\bf 84}, 052504 (2011).\n\\bibitem{worm}\nM. Boninsegni, N. Prokof'ev and B. Svistunov, Phys. Rev. Lett. {\\bf 96}, 070601 (2006).\n\\bibitem{worm2}\nM. Boninsegni, N. Prokof'ev and B. Svistunov, Phys. Rev. E {\\bf 74}, 036701 (2006).\n\\bibitem{bm}\nM. Boninsegni and S. Moroni,  Phys. Rev. E {\\bf 86}, 056712 (2012).\n\\bibitem{h2}\nM. Boninsegni, Phys. Rev. Lett. {\\bf 111}, 235303 (2013).\n\\bibitem{mb}\nIt should be mentioned that there exist ground state methods, similar in spirit to the Worm Algorithm, that allow for the computation of off-diagonal correlations. See, for instance, S. Moroni and M. Boninsegni, J. Low Temp. Phys. {\\bf 136}, 129 (2004).\n\\bibitem{pollock}\nE. L. Pollock and D. M. Ceperley, Phys. Rev. B {\\bf 36}, 8343 (1987).\n\\bibitem{noi}\nF. Mezzacapo and M. Boninsegni, Phys. Rev. Lett. {\\bf 100}, 145301 (2008).\n\\bibitem{note}\nIt should be noted that because the system breaks translational invariance in the ground state, the superfluid fraction need not saturate at 100\\% in the $T\\to 0$ limit.\n\\bibitem{pipo}\nThe convergence of the results with respect to the imaginary time step (see Ref. \\onlinecite{worm2} for details) becomes very slow for large values of $A$, using the primitive approximation.\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 10167, "prevtext": "\n\n\\title{Hard core repulsion and  supersolid cluster crystals\n} \n\\author{Massimo Boninsegni}\n\\affiliation{Department of Physics, University of Alberta, Edmonton, Alberta, Canada T6G 2E1}\n\\date{\\today}\n\\begin{abstract}\nWe study  the effect of a short-ranged hard-core repulsion on the stability and superfluid properties of the cluster crystal phase of two-dimensional (2D) soft core bosons. Results of Quantum Monte Carlo simulations on a cogent test case suggest that the main physical properties of the phase remain unaltered if the  range $d$ of the inner repulsive core is sufficiently short,  even if the strength of the repulsion is  several orders of magnitude greater than the outer soft core barrier. Only if $d$ is an appreciable fraction of the size of the clusters (${\\lower 2pt \\hbox{$\\buildrel>\\over{\\scriptstyle{\\sim}}$}}$ 5\\%) does  a sufficiently strong  hard core repulsion cause the crystal to break down into a homogeneous superfluid;\na moderate  inner core repulsion enhances  the superfluid response of the crystalline phase.\n\\end{abstract}\n\\maketitle\n\n\\section{Introduction}\n\nOne of the most exciting developments in cold atom physics is undoubtedly the theoretical possibility of synthesizing artificial phases of matter by tuning the interaction among atoms or molecules. This may pave the way to the observation of novel many-body phenomena, not (yet or easily) observed in naturally occurring condensed matter. A chief example is the putative supersolid phase of matter \\cite{rmp}, \nlong sought in the solid state system most likely to display it, i.e.,  a crystal of  $^4$He, but whose detection has so far eluded experimenters \\cite{hallock}.\n\\\\ \\indent\nAfter a decade of intense theoretical investigation, following the original claim of observation of non-classical rotational inertia in solid $^4$He by Kim and Chan \\cite{kc} (a claim since recanted \\cite{chan2}), the consensus seems to be that the most important physical  hinderance to supersolidity in condensed matter systems, is the strong repulsion that any interatomic or intermolecular pair interaction features at short distances. Such a repulsion originates from Pauli exclusion principle, affecting the overlapping electronic clouds of different atoms or molecules as they are brought close together;  its range is typically comparable to the  lattice constant of the crystal, and is at the root of the thermodynamic instability of a dilute gas of point  defects such as vacancies or interstitials \\cite{pollet07}, which according to  early theories of supersolidity might undergo Bose-Einstein Condensation \\cite{Andreev69,Chester}. Indeed, there is strong numerical evidence that no supersolid phase occurs in the presence of a pairwise interaction potential featuring a repulsive core, even one whose growth at short distance is slow, like the Yukawa pair potential \\cite{boninsegni11}. \n\\\\ \\indent\nOn the other hand, it was suggested a long time ago that the superfluid ground state of an interacting Bose system could also \nfeature a density modulation \\cite{gross} (i.e., satisfy the definition of supersolid phase)  if the pair potential features a relatively ``flat\" region at short inter-particle separation.  In  more recent times, Quantum Monte Carlo simulations have yielded robust evidence of a  supersolid    in the high density, low temperature region of the phase diagram of 2D soft core bosons \\cite{saccani,saccani2}, as well as of other system featuring similar pair-wise potentials \\cite{boninsegni11}. Such a phase  consists of a self-assembled crystal of superfluid droplets (clusters); tunnelling of particles among adjacent droplets can establish phase coeherence and give rise to a superfluid transition at low temperature. \n\\\\ \\indent\nA many-body system with such a peculiar inter-particle interaction would  \nhave been regarded of merely academic interest until not so long ago, but it now appears as if it might be\nrealized experimentally in an assembly of cold Rydberg atoms \\cite{ryd}. In particular, a physical mechanism known as  Rydberg blockade can give rise to a modified pair potential, precisely featuring the kind of  plateau at short distance that can underlie the supersolid cluster crystal phase described above \\cite{henkel10}. \\\\ \\indent \nIt seems fair to state that, at this time,  Rydberg atoms constitute the most promising way of observing the supersolid phase of matter. In particular,  its unambiguous detection   is rendered possible by the direct imaging of the momentum distribution,  which displays (Bragg) peaks in correspondence of reciprocal lattice vectors \\cite{greiner}. Although most of the theoretical predictions have been made for 2D systems, the physical arguments apply in three dimensions as well; in any case, it is possible to approach the 2D limit by confining particles spatially  using an external harmonic potential in the direction perpendicular to their motion (the so-called ``pancake\" geometry).\n\\\\ \\indent\nIn view of such a concrete  possibility, a number of theoretical issues must be addressed, in order to guide in the design and interpretation of experiments aimed at carrying out the observation described above. In particular, it is important to assess the robustness of the predicted supersolid phase against details of the interaction over which one may not exercise (complete) control. Previous work \\cite{boninsegni11}  has yielded convincing evidence that the behavior of the pair-wise interaction at long distances plays virtually no role in the appearance of the cluster crystal phase. It has been conjectured \\cite{reatto}, that a {\\it necessary} (not sufficient) condition for its occurrence, is that the Fourier transform of the two-body potential go negative (i.e., that the potential become attractive) in some range of $k$. This heuristic argument is consistent with all  the numerical evidence accumulated so far.\n\\\\ \\indent\nNothing quantitative is known about the effect of a hard core repulsion between particles at distances much shorter than the characteristic size of the clusters. As mentioned above, on very general grounds one knows that any physical interaction among atoms \nor molecules necessarily must feature \nsuch a repulsive core at sufficiently short distances. Thus, the experimental relevance of theoretical  predictions made for a  soft core model ultimately hinges on their robustness {\\em vis-a-vis} such a short-distance repulsion. One can reasonably opine that, if a \nsubstantial difference in scales exists between the characteristic radius $R$ of the soft core of the potential (or, phrased more generally, of the region in which the repulsive part of the potential softens), and the (presumably much smaller) radius $d$ of the hard core, i.e., if $d/R<<1$, then the basic physics of the soft core system should be unaffected. Since the softening of the potential at short distances is tunable, by means of the Rydberg blockade, one may conclude that such a condition ought to be generally attainable.\n\\\\ \\indent\nHowever,  even in the limit of vanishing radius (i.e., a $\\delta$-function term), an additional  repulsive term of sufficient strength can render the Fourier transfor of the potential positive-definite, in principle undermining the conjectured condition of stability of the droplet crystal stated above.\nThus, it seems worthwhile to carry out a first principle numerical study aimed at assessing quantitatively the effect of a hard core repulsion at short distance, in order to gain greater quantitative understanding of the boundaries within which experiments aimed at observing the supersolid droplet crystal phase of soft core systems should be performed. \n\\\\ \\indent\nTo this aim, we have performed Quantum Monte Carlo simulations of a 2D system of soft core bosons, with an additional hard core repulsion at short distances, also modeled as a simple rectangular barrier.\nSpecifically, we have studied the low temperature superfluid and structural properties of the system at a fixed density, and for a value of the soft core repulsion for which a supersolid cluster crystal phase is known to exist, on varying the strength and the radius of the inner hard core. Some of the results of our studies confirm our initial expectations,  whereas others seem nontrivial.\n\\\\ \\indent\nOur main findings are the following:\n\\\\ \\indent\n{\\em a}) As the height of the inner barrier is increased, one generally first observes the rise of the superfluid response of the cluster crystal, caused by enhanced tunnelling of particles across adjacent clusters. For a sufficiently strong inner repulsion, the cluster crystal ``melts\" into a homogeneous superfluid.\n\\\\ \\indent\n{\\em b}) The rise of the superfluid fraction with the height of the inner barrier is roughly linear, with a slope that increases monotonically with $d/R$. We could not establish a precise dependence based on the simulation data. For the lowest value of $d/R$ considered here (0.01),  the superfluid fraction remains constant, within the uncertainties of the calculation,  as the height of the barrier is varied over four orders of magnitude. This suggests that for a sufficiently short range, the cluster crystal phase may be stable against a hard core repulsion of arbitrary strength, even though the numerical simulations performed in this work do not allow us to make with confidence a mathematical statement of such breadth.\n\\\\ \\indent\nThe remainder of this paper is organized as follows: in Sec. \\ref{mc} we introduce the model and provide computational details; in   Sec. \\ref{sere} we illustrate our results and provide a theoretical interpretation. Finally, we outline our conclusions in Sec. \\ref{conc}.\n\\section{Model and Calculation}\\label {mc}\nOur system of interest consists of a collection of $N$ point-like particles of spin zero (hence obeying Bose statistics) and mass $m$, moving in two dimensions. The system is enclosed in a square simulation cell of side $L$, with periodic boundary conditions in all directions.  The density is $\\theta=N/L^2$. Particles are assumed to interact via the following pair potential, only depending on the inter-particle distance:\n\n", "index": 1, "text": "\\begin{equation}\\label{pot}\nV(r)= A\\ \\Theta(d-r)+D\\ \\Theta(R-r)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"V(r)=A\\ \\Theta(d-r)+D\\ \\Theta(R-r)\" display=\"block\"><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+5pt\"><mi>A</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>d</mi><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+5pt\"><mi>D</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>R</mi><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]