[{"file": "1601.00800.tex", "nexttext": "\nwhere the phase space distribution function $f$ is taken to correspond to free hadron resonance gas close to local equilibrium with non-equilibrium corrections proportional to the shear stress tensor:\n\n", "itemtype": "equation", "pos": 7356, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\dochead{}\n\n\n\n\n\\title{Effects of EoS in viscous hydro+cascade model for the RHIC Beam Energy Scan}\n\n\n\n\n\n\n\\author[INFN,BITP,FIAS]{Iu.~Karpenko}\n\\author[FIAS,ITP]{M.~Bleicher}\n\\author[FIAS,ITP,WR]{P.~Huovinen}\n\\author[FIAS,ITP,GSI]{H.~Petersen}\n\\address[INFN]{INFN - Sezione di Firenze, Via G. Sansone 1, I-50019 Sesto Fiorentino (Firenze), Italy}\n\\address[BITP]{Bogolyubov Institute for Theoretical Physics, 14-b, Metrolohichna st., 03680 Kiev, Ukraine}\n\\address[FIAS]{Frankfurt Institute for Advanced Studies, Ruth-Moufang-Stra{\\ss}e 1, D-60438 Frankfurt am Main, Germany}\n\\address[ITP]{Institute for Theoretical Physics, Johann Wolfgang Goethe Universit\\\"at, Max-von-Laue-Str.~1, D-60438 Frankfurt am Main, Germany}\n\\address[WR]{Institute of Theoretical Physics, University of Wroclaw, pl.~Maxa Borna 9, PL-50204 Wroclaw, Poland}\n\\address[GSI]{GSI Helmholtzzentrum f\\\"ur Schwerionenforschung GmbH, Planckstr. 1,  D-64291 Darmstadt, Germany}\n\n\\begin{abstract}\nA state-of-the-art 3+1 dimensional cascade + viscous hydro + cascade model vHLLE+UrQMD has been applied to heavy ion collisions in RHIC Beam Energy Scan range $\\sqrt{s_\\mathrm{NN}}=7.7\\dots 200$~GeV. Based on comparison to available experimental data it was estimated that an effective value of shear viscosity over entropy density ratio $\\eta/s$ in hydrodynamic stage has to decrease from $\\eta/s=0.2$ to $0.08$ as collision energy increases from $\\sqrt{{s_\\mathrm{NN}}} = 7.7$ to $39$~GeV, and to stay at $\\eta/s=0.08$ for $39\\le\\sqrt{s}\\le200$~GeV.\n\nIn this work we show how an equation of state with first order phase transition affects the hydrodynamic evolution at those collision energies and changes the results of the model as compared to ``default scenario'' with a crossover type EoS from chiral model.\n\\end{abstract}\n\n\\begin{keyword}\n\nquark-gluon plasma \\sep relativistic hydrodynamics \\sep hadron cascade\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\n\n\n\\section{Introduction}\n\\label{sec-intro}\n\nThe goal of ongoing Beam Energy Scan (BES) program at RHIC facility and future experimental programs at GSI FAIR and JINR NICA is to explore the high-$\\mu_B$ region of phase diagram of QCD matter and the phase transition from hadron gas to quark-gluon plasma by colliding heavy nuclei at different energies.\n\nFollowing the success of hydrodynamic description of heavy ion reactions at full RHIC and LHC energies, we have reported on creation of a state-of-the-art viscous hydro+cascade model and its application to heavy ion collisions in the BES collision energy range \\cite{Karpenko:2015xea}. In the context of this model,\nreproduction of available experimental data requires a finite collision energy dependent shear viscosity over entropy density ratio $\\eta/s$ in the hydrodynamic stage. This ratio was found to decrease from $\\eta/s=0.2$ to $0.08$ as collision energy increases from $\\sqrt{{s_\\mathrm{NN}}} = 7.7$ to $39$~GeV, and to stay at $\\eta/s=0.08$ for $39\\le\\sqrt{s}\\le200$~GeV. The found collision energy dependence of the effective $\\eta/s$ indicates that the physical $\\eta/s$-ratio may depend on baryochemical potential, and that $\\eta/s$ increases with increasing $\\mu_B$.\n\nHowever, only one version of the equation of state (EoS) was used throughout the analysis in \\cite{Karpenko:2015xea}, namely the chiral model EoS \\cite{Steinheimer:2010ib}. The question remains: how sensitive the obtained results are to the hydrodynamic EoS and whether it is possible to discriminate between EoSs using experimental data. In this work we show sensitivity of hadronic observables in RHIC BES collision energy range to the choice of the equation of state (EoS) in the fluid stage.\n\n\\section{The equations of state in the viscous hydro+cascade model}\n\n\n\nSince the model has been described in detail in\nRef.~\\cite{Karpenko:2015xea}, we summarise here its main features only.\nThe initial stage of evolution is described with UrQMD cascade \\cite{Bass:1998ca, Bleicher:1999xi}. At a hypersurface of constant Bjorken proper time $\\tau=\\sqrt{t^2-z^2}=\\tau_0$ the system is fluidized, {\\it i.e.}~the energy and momentum of individual hadrons are converted into energy and momentum of fluid. The $\\tau_0$ is a parameter of the model. At lower RHIC BES energies its value is\nset to the time when all initial nucleon-nucleon scatterings have happened. The hydrodynamic stage which follows is modelled with a 3+1 dimensional numerical solution of relativistic viscous hydrodynamics in Israel-Stewart framework using recently developed \\texttt{vHLLE} code \\cite{Karpenko:2013wva}. Particlization is set to happen when energy density $\\epsilon=\\epsilon_{\\rm sw}$ is reached. The following hadronic stage is described again with UrQMD cascade.\n\nIt is worth to note that at BES collision energies local baryon or\ncharge densities can be large. Therefore a consistent hydrodynamic description requires an EoS which is defined at all physical energy/baryon densities. Presently we have only two such EoSs at hand. One is the chiral model EoS (CM EoS), used in our previous analysis, whereas another is so called ``EoS Q'' \\cite{Kolb:2000sd}.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.52\\textwidth]{pressure_nb0}\n\\caption{Pressure as a function of energy density at zero baryon density, for the two EoSs used in the simulations: chiral model EoS (solid curve) and EoS Q (dashed curve).}\\label{fig1}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=0.52\\textwidth]{particlization}\n\\includegraphics[width=0.52\\textwidth]{last_interactions}\n\\caption{Longitudinal proper time distribution of hadrons sampled at particlization surface (left) and their last interaction points (right). All distributions correspond to midrapidity region of 20-30\\% central Au-Au collisions at different collision energies, simulated with CM EoS (solid curves) and EoS Q (dashed curves) in the fluid phase.}\\label{fig2}\n\\end{figure}\n\n\nThe chiral model (CM) EoS has correct asymptotic degrees of freedom at the high and low temperature limits -- quarks and hadrons -- and is in qualitative agreement with lattice QCD results at $\\mu_B=0$. However, deconfinement transition appears in it as a (wide) crossover where medium modified hadrons coexist with free quarks. The crossover happens at all values of baryon chemical potential.\n\nThe EoS Q comprises hadron resonance gas (HG) and quark-gluon plasma (QGP) phases. HG phase is constructed from contributions of hadron resonances with masses up to 2~GeV and includes repulsive interactions via a mean-field potential. QGP phase is described as an ideal gas of massless quarks and gluons inside a large bag with bag constant $B$. The value of the latter is taken to be $B^{1/4}=230$~MeV. The two phases are matched via Maxwell construction, which results in first order phase transition between the phases also at all values of baryon chemical potential. With the given value of the bag constant the transition temperature is $T_c(n_B=0)=164$~MeV at zero baryon density.\n\nThe particlization (transition from fluid to individual hadrons) is set to happen at fixed energy density $\\epsilon_{\\rm sw}=0.5$~GeV/fm$^3$ for both EoS scenarios. At this energy density the system is firmly on the hadronic side for both EoS. We apply conventional Cooper-Frye prescription for hadron distributions on the particlization hypersurface:\n\n", "index": 1, "text": "\\begin{equation}\np^0 \\frac{d^3N_i(x)}{d^3p} = d\\sigma_\\mu p^\\mu f(p\\cdot u(x),T(x),\\mu_i(x)),\n \\label{CFp}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"p^{0}\\frac{d^{3}N_{i}(x)}{d^{3}p}=d\\sigma_{\\mu}p^{\\mu}f(p\\cdot u(x),T(x),\\mu_{%&#10;i}(x)),\" display=\"block\"><mrow><mrow><mrow><msup><mi>p</mi><mn>0</mn></msup><mo>⁢</mo><mfrac><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><msub><mi>N</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>p</mi></mrow></mfrac></mrow><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>μ</mi></msub><mo>⁢</mo><msup><mi>p</mi><mi>μ</mi></msup><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>p</mi><mo>⋅</mo><mi>u</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00800.tex", "nexttext": "\nSuch distribution function is inconsistent with mean fields included in hadron phase of both EoS used in fluid phase. Therefore we recalculate the energy density, pressure, flow velocity $u^\\mu$,\ntemperature, and chemical potentials from the ideal parts of the\nenergy-momentum tensor and charge currents using a free hadron resonance gas EoS and use these values to\nevaluate the particle distributions on the switching surface.\n\n\\section{Results and conclusions}\n\nTo set up the calculations for the Beam Energy Scan range we take collision energy dependent values of the parameters of the model, used to approach the experimental data with CM EoS. Then we perform two sets of simulations: with CM EoS and EoS Q respectively. First of all we like to see how the hydrodynamic evolution itself is affected by the choice of the EoS. It is difficult to compare individual hydro evolutions with irregular initial conditions and different EoSs. Therefore we visualise the effects of the change of the EoS by using the event-averaged proper time distributions of the hadrons sampled at particlization surfaces, see Fig.~\\ref{fig2}, right. From the plot one can find that EoS Q results in longer average duration of the particle emission. This implies that the average duration of the fluid stage (which is defined as a space-time region where $\\tau>\\tau_0$ and $\\epsilon>\\epsilon_{\\rm sw}=0.5$~GeV/fm$^3$) is longer. Also, the relative change in the average duration of the fluid stage increases with decreasing collision energy and is maximal for lowest collision energy simulated, $\\sqrt{s_\\mathrm{NN}}=7.7$~GeV. We assume that the prolongation is the effect of the mixed phase in EoS Q, since at higher energy densities it is even harder than CM EoS, see Fig.~\\ref{fig1}.\n\nHowever, after being sampled at the particlization surface, hadrons decay and rescatter in the cascade. From Fig.~\\ref{fig2}, left, one can see that the resulting proper time distributions of the last interaction points of hadrons are much wider than the distributions of points of their creation, and differences between the two EoSs in fluid stage are largely smeared. This brings one to the question how much the EoS in the fluid phase affects the final observables.\n\nWe found that change in EoS has no impact on the shapes of rapidity distributions of produced particles. There is, however, some impact on the transverse dynamics of the system, which influence transverse momentum distributions of hadrons. From Fig.~\\ref{fig3}, left, one can conclude that EoS Q results in some suppression of the average radial flow, which decreases mean $p_T$ of hadrons (larger effect for heavier protons and smaller effect for lighter pions). The largest effect is seen in the $p_T$ integrated elliptic flow, which turns out to be suppressed in EoS Q case by the same amount for all collision energies.\n\nIn the previous analysis we have shown that elliptic flow, as well as other observables, can be varied by varying free model parameters. Therefore it remains an open question whether it is possible to readjust the parameters of the model in order to compensate such changes in excitation functions of the elliptic flow and mean transverse momentum while keeping same rapidity distributions.\n\n\\begin{figure}\n\\includegraphics[width=0.52\\textwidth]{meanPt}\n\\includegraphics[width=0.52\\textwidth]{v2v3_fit_w1PT_prel}\n\\caption{Mean $p_T$ of pions, kaons and protons at midrapidity (left), elliptic and triangular flow components of all charged hadrons (right) in 20-30\\% central Au-Au collisions, obtained from model simulations with collision energy dependent values of the parameters and two different equations of state in the fluid stage: chiral model EoS (solid curves) and EoS Q (dashed curves). The experimental data points are from the STAR collaboration \\cite{Adamczyk:2012ku,Adamczyk:2013waa}.}\\label{fig3}\n\\end{figure}\n\n\\section{Acknowledgements}\n\nThe simulations have been performed at the Center for Scientific Computing (CSC) at the Goethe-University Frankfurt. The authors acknowledge the financial support by the Helmholtz International Center for FAIR and Hessian LOEWE initiative. HP acknowledges funding by the Helmholtz Young Investigator Group VH-NG-822.  The work of PH was supported by BMBF under contract no. 06FY9092.\n\n\\bibliographystyle{elsarticle-num}\n\n\n\n\n\n\n\n\\begin{thebibliography}{00}\n\n\n\n\n\n\\bibitem{Karpenko:2015xea}\n  I.~A.~Karpenko, P.~Huovinen, H.~Petersen and M.~Bleicher,\n  \n  Phys.\\ Rev.\\ C {\\bf 91} (2015) 6,  064901\n  [arXiv:1502.01978 [nucl-th]].\n\\bibitem{Steinheimer:2010ib}\n  J.~Steinheimer, S.~Schramm and H.~Stocker,\n  \n  J.\\ Phys.\\ G {\\bf 38} (2011) 035001\n  doi:10.1088/0954-3899/38/3/035001\n  [arXiv:1009.5239 [hep-ph]].\n  \n\\bibitem{Bass:1998ca}\n  S.~A.~Bass {\\it et al.}, \n  \n  Prog.\\ Part.\\ Nucl.\\ Phys.\\  {\\bf 41} (1998) 255\n   \n  [nucl-th/9803035].\n\\bibitem{Bleicher:1999xi}\n  M.~Bleicher {\\it et al.}, \n  \n  J.\\ Phys.\\ G {\\bf 25} (1999) 1859\n  [hep-ph/9909407].\n\\bibitem{Karpenko:2013wva}\n  I.~Karpenko, P.~Huovinen and M.~Bleicher,\n  \n  Comput.\\ Phys.\\ Commun.\\  {\\bf 185} (2014) 3016\n  doi:10.1016/j.cpc.2014.07.010\n  [arXiv:1312.4160 [nucl-th]].\n  \n\\bibitem{Kolb:2000sd}\n  P.~F.~Kolb, J.~Sollfrank and U.~W.~Heinz,\n  \n  Phys.\\ Rev.\\ C {\\bf 62} (2000) 054909\n  doi:10.1103/PhysRevC.62.054909\n  [hep-ph/0006129].\n  \n\\bibitem{Adamczyk:2012ku}\n  L.~Adamczyk {\\it et al.} [STAR Collaboration],\n  \n  Phys.\\ Rev.\\ C {\\bf 86} (2012) 054908\n  doi:10.1103/PhysRevC.86.054908\n  [arXiv:1206.5528 [nucl-ex]].\n  \n\\bibitem{Adamczyk:2013waa}\n  L.~Adamczyk {\\it et al.} [STAR Collaboration],\n  \n  Phys.\\ Rev.\\ C {\\bf 88} (2013) 1,  014904\n  doi:10.1103/PhysRevC.88.014904\n  [arXiv:1301.2187 [nucl-ex]].\n  \n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 7679, "prevtext": "\nwhere the phase space distribution function $f$ is taken to correspond to free hadron resonance gas close to local equilibrium with non-equilibrium corrections proportional to the shear stress tensor:\n\n", "index": 3, "text": "\\begin{equation}\nf=f_{\\rm eq}(p^\\nu u_\\nu;T,\\mu_i)\\left[ 1+(1\\mp f_{\\rm eq})\\frac{p_\\mu p_\\nu \\pi^{\\mu\\nu}}{2T^2(\\epsilon+p)} \\right].\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"f=f_{\\rm eq}(p^{\\nu}u_{\\nu};T,\\mu_{i})\\left[1+(1\\mp f_{\\rm eq})\\frac{p_{\\mu}p_%&#10;{\\nu}\\pi^{\\mu\\nu}}{2T^{2}(\\epsilon+p)}\\right].\" display=\"block\"><mrow><mrow><mi>f</mi><mo>=</mo><mrow><msub><mi>f</mi><mi>eq</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>p</mi><mi>ν</mi></msup><mo>⁢</mo><msub><mi>u</mi><mi>ν</mi></msub></mrow><mo>;</mo><mi>T</mi><mo>,</mo><msub><mi>μ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>∓</mo><msub><mi>f</mi><mi>eq</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><msub><mi>p</mi><mi>μ</mi></msub><mo>⁢</mo><msub><mi>p</mi><mi>ν</mi></msub><mo>⁢</mo><msup><mi>π</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>T</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ϵ</mi><mo>+</mo><mi>p</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]