[{"file": "1601.06401.tex", "nexttext": "\nwhere c, L, $\\omega$ and $\\varepsilon(\\omega)$ are the speed of light, the length of the cell in layer-normal direction, frequency of light and \ncomplex dielectric function, respectively.\n\n\n\\section{G\\lowercase{a}S and C\\lowercase{a}(OH)$_2$ monolayers}\n\nThe optimized atomic structures of single layers of GaS and Ca(OH)$_2$ are shown \nin Fig.~\\ref{fig1}. The optimized lattice parameters for isolated monolayers \nare almost equal to each other, 3.58~\\AA~and 3.59~\\AA~for GaS and Ca(OH)$_2$, \nrespectively. In the GaS monolayer, every Ga atom is covalently bonded to three S \nand one Ga atom which creates a trigonal prismatic symmetry. The distance \nbetween two nearest neighbor Ga atoms is 2.44~\\AA~and the Ga-S distance \n2.36~\\AA~is slightly shorter. In the Ca(OH)$_2$ monolayer, the Ca atom has 6 \nionic bonds with O atoms with a bond length of 2.36~\\AA. Each O atom in the \nprimitive cell has one bond with a  H atom with bond length 0.96~\\AA.\n\n\\begin{figure}[htbp]\n\\includegraphics[width=13cm]{fig1.pdf}\n\\caption{\\label{fig1} The optimized atomic structures of (a) GaS and (c) \nCa(OH)$_2$ monolayers and their electronic structures and PDOS (right panel) \nwith SOC (b) and (d), respectively. \nThe gallium, sulfur, calcium, oxygen and hydrogen atoms are shown \nin green, yellow, blue, red and white, respectively. (e) The calculated band \nalignment of the monolayers where\nthe vacuum level of both materials is set to 0 eV.}\n\\end{figure}\n\n\nThe band structures including SOC of the individual monolayers are shown in \nFig.~\\ref{fig1}. Both electronic structures are basically similar to the ones \nreported earlier. \\cite{port,ma} The GaS monolayer is an indirect band gap \nsemiconductor with a gap of 2.59 eV, as seen in Fig.~\\ref{fig1}(b). The valence \nband minimum (VBM) of the compound resides along the $M-\\Gamma$ \ndirection but the conduction band minimum (CBM) is at the $M$ point in the \nBrillouin zone (BZ). The states in the vicinity of the Fermi level are composed \nof $p$ orbitals, however the VBM is mostly made up of the $s$ orbitals of the Ga and \nS atoms. Our Bader analysis showed that the Ga-S bonds have mostly a covalent \ncharacter and the Ga atoms donate 0.7$e$ whereas each S atom \ngains 0.7$e$ charge.\n\n\nContrary to the GaS monolayer, the Ca(OH)$_2$ monolayer is a direct band gap \nsemiconductor with a band gap of 3.66 eV. The VBM and CBM of the compound are \nlocated at the $\\Gamma$ point in the BZ. The states at the vicinity of the Fermi \nlevel originate from the $p_{x}$ and $p_{y}$ orbitals of the O atom, however the \nVBM is mostly from the $s$ and $p_{z}$ orbitals of the Ca and O atoms. The Ca \natom and H atoms donate, 1.6$e$ and 0.6$e$ charge respectively, and each O atom \nreceive 1.4$e$. The bonds in Ca(OH)$_2$ have mostly an ionic character. \n\n\nOur calculation revealed that the vacuum level of the isolated monolayers are different from each other. \nWhen the vacuum level of the monolayers is set to 0 eV as  shown in Fig.~\\ref{fig1}(e), the obtained heterostructure is a type II heterojunction which opens up the possibility of using\n it as an electron-hole separator under photo-excitation. As shown in the figure, the excited electrons and the holes pile up in the GaS and Ca(OH)$_2$ monolayer, respectively. Since the electrons \nand the holes of the heterostructure reside in different layers, the created excitons are spatially indirect and the recombination occurs through the staggered gap of the heterojuction.\nIt has been shown that spatially indirect excitons in MX$_2$ heterobilayers have a long lifetime ($\\sim$ 20 - 30 ns at room temperature) which is important for applications in \noptoelectronics and photovoltaics. \\cite{palummo} \n\nIn Figs.~\\ref{fig2}(a) and (b) the dielectric function and the oscillator strength of the optical transitions of isolated GaS and Ca(OH)$_2$ monolayers are shown, respectively.  \nFor GaS, the first peak of the dielectric function is composed of four optical transitions which are from valence band edge to conduction band edges at M, $\\Gamma$ and  \nK points in the Brillouin zone (BZ) which are very close in energy. For the Ca(OH)$_2$ monolayer, the first peak is composed of 2 optical transitions from $\\Gamma$ to $\\Gamma$  in the BZ. These \ntwo peaks are split by about 40 meV due to the SOC. \nThe first peak of the dielectric function is considered as the optical band gap of the compound which is at $\\sim$ 3.60 eV and $\\sim$ 4.48 eV for GaS and Ca(OH)$_2$, respectively with  exciton binding energy of 1.12 eV and 2.10 eV, respectively. \n\n\\begin{figure}[htbp]\n\\includegraphics[width=13cm]{fig2.pdf}\n\\caption{\\label{fig2} Imaginary part of the dielectric function and the \noscillator strength of the optical transitions of (a) GaS monolayer (b) \nCa(OH)$_2$ monolayer and (c) GaS-Ca(OH)$_2$ heterostructure. }\n\\end{figure}\n\n\n\\section{Heterostructure} \n\nHaving similar lattice constants opens up the possibility of using these monolayers for building blocks of vdW heterostructures. \nFor this purpose we place GaS monolayer on top of Ca(OH)$_2$ monolayer. \nIn order to find the minimum energy configuration of the heterostructure we \nshift the GaS monolayer along three different directions. The \nminimum energy configuration is obtained when the Ga and S atoms are \non top of the O (and H) and Ca atom of the Ca(OH)$_2$ monolayer, \nrespectively, as shown in Fig.~\\ref{fig3}. The geometric structure of the constituent layers of the heterostructure \ndoes not change when compared with their isolated form. The distance between the two layers is 1.98~\\AA~and the binding \nenergy ($E_{B}$) of the heterostructure is 0.12 eV per unit cell (Table.~\\ref{table}).\n\n\\begin{figure}[htbp]\n\\includegraphics[width=13cm]{fig3.pdf}\n\\caption{\\label{fig3} (a) The optimized atomic structures of GaS-Ca(OH)$_2$ \nheterostructure and (b) its electronic band structures together with the PDOS (right panel) \nwith SOC. The gallium, sulfur, calcium, oxygen and hydrogen atoms are shown \nin green, yellow, blue, red and white, respectively.}\n\\end{figure}\n\nAlthough the interaction between these two layers are weak, there is a \nsignificant decrease in the band gap when these two single layers are stacked on \ntop of each other (see in Fig.~\\ref{fig3}(b)). This dramatic \nmodification in the band gap is due to the difference in vacuum level of the \nconstituent monolayers. Our calculations show that the heterostructure has an \nindirect band gap of 1.45 eV where the VBM is at the $\\Gamma$ and the CBM is at \nthe $M$ point in the BZ. The $\\Gamma$ to $\\Gamma$ gap is 1.63 eV. The advantage \nof having an indirect band gap heterostructure is that it results in long-lived \nexcitons due to the small overlap of electron-hole wavefunctions. This opens up \nthe possibility of using the GaS-Ca(OH)$_2$ heterojuction for excitonic solar \ncells so that the electron-hole pairs can be split relatively easy.\n  \n\nAs shown in Table~\\ref{table}, the calculated workfunction of the \nheterostructure is found as 6.21 eV and 5.06 eV for GaS and Ca(OH)$_2$ sides of the heterojunction. \nDue to the interaction between two layers the workfunction values diminished 0.1 and increased 0.21 eV compared with the values for the \nisolated GaS and Ca(OH)$_2$ monolayers, respectively. \n\nThe partial density of states (PDOS) of the GaS-Ca(OH)$_2$ heterostructure is \nshown in the right panel of Fig.~\\ref{fig3}(b). As expected from the band \nalignment the valence band and the conduction band of the heterostructure are \nfrom GaS and Ca(OH)$_2$ monolayers, respectively. The resulting band structure \nof the heterostructure is shown in Fig.~\\ref{fig3}(b). As seen the band \nstructure of the heterostructure is almost an overlap of the band structures of \nthe isolated monolayers. This is due to the weak interaction between layers so \nthat the dispersion of the bands does not change. \n\n\nIn order to investigate only the spatially indirect excitons in the \nheterostructure, 4 valence and 4 conduction bands were taken into account for \nthe optical transitions in the BSE step. So, the optical transitions between \nthese bands correspond to the interlayer recombination of the electrons and \nholes through the staggered gap. This means that the exciton peaks shown in \nFig.~\\ref{fig2}(c) correspond only to spatially indirect excitons in the \nheterojunction. Consistent with the prediction of gap closing in the \nheterostructure, the first peak in the dielectric function appears at lower \nenergy ($\\sim$ 3.10 eV) than the one of the constituent monolayers as seen in \nthe figure. The exciton binding energy of the heterostructure is calculated as \n0.90 eV. \n\n\n\\begin{table}[htbp]\n\\caption{\\label{table} Ground state properties of GaS and Ca(OH)$_2$ monolayers \nand the heterostructure composed of these two monolayers. \nCalculated lattice parameters $a$ and $b$, interlayer binding energy $E_{B}$ \n(per unit cell), the band gap $E_g$  and the workfunction $\\Phi$ (for the heterstructure the first value is for the GaS and the second one is for the Ca(OH)$_2$ side, respectively) of the \nstructures.}\n\\begin{tabular}{ccccccccccccccccc}\n\\hline\\hline\n                 & $a$=$b$         &$E_{B}$           &$E_{coh}$/atom   & $E_g$ \n \n  & $\\Phi$   &\\\\\n                 &(\\AA{}{})         &   (eV)           &   (eV)          &  \n(eV) \n   &  (eV)    &\\\\\n\\hline\nGaS              &    3.58          &   ---           &    3.83         &  \n2.59(i) &  6.31    &\\\\\nCa(OH)$_2$       &    3.59          &   ---           &    4.59         &  \n3.66(d) &  4.85    &\\\\\nGaS-Ca(OH)$_2$   &    3.58          &   0.12          &    4.26         &  \n1.45(i) &  6.21,5.06    &\\\\\n\n\\hline\\hline\n\\end{tabular}\n\\end{table}\n\n\n\nOur calculations also reveal that the oscillator strengths of \nthe GaS monolayer is an order of magnitude larger than that of the Ca(OH)$_2$ \nmonolayer and the GaS-Ca(OH)$_2$ heterostructure. However, the oscillator \nstrength and the dielectric function of the heterostructure resemble the \nproperties of Ca(OH)$_2$. Similarly, as shown by Fang \\textit{et \nal.}\\cite{fang}, in case of the MoS$_2$-WSe$_2$ heterostructure, which is also a type II \nheterojunction, its optical properties resembles the one of MoS$_2$. Creation of such \nnanoscale type II heterojuctions leads to formation of spatially indirect \nexcitons which are vital elements for exciton solar cells and optoelectronics \ndevices due to the relatively longer life times of the excitons.     \n\n\n\\section{Optical Characterization of Stacking Type}\n\nIn this section, we will show that the optical spectra of ultra-thin heterostructures can be used to determine the stacking type of them.\nIn Fig.~\\ref{fig4}, the optimized atomic configuration, the electronic \nstructure and the optical transmittance and the reflectivity of the two lowest \nenergy configurations of the GaS-Ca(OH)$_2$ heterostructure are shown. The atomic structures of these two lowest energy configurations are completely different from each other, although the \nenergy difference between them is quite small $\\sim$ 5 meV. \n\n\nThe higher energy state (Fig.~\\ref{fig4}(b)) is obtained by 180$^{\\circ}$ rotation of the ground \nstate configuration (Fig.~\\ref{fig4}(a)), so it will be called as ``rotated state'' from now on. \nIn the rotated state the Ga and S atoms are on top of the Ca and O (and H)\natom of the Ca(OH)$_2$ monolayer, respectively and in both cases the interlayer spacing is found as 1.98~\\AA. As shown in Figs.~\\ref{fig4}(c) and (d), the electronic structure of the ground and \nthe rotated state are similar and the dispersion of the bands are identical. The only difference is that the band gap of the rotated state is 3 meV larger.\n\n\nAlthough, the electronic structure of the ground and rotated states are  \nvery close to each other, optical transmittance and the \nreflectivity profiles of their band edges are distinct as shown in Figs.~\\ref{fig4}(e) and \n(f). The main differences in the \noptical spectra of these two stacking cases originate from the different \nstrength of the optical transitions. It is predicted that the energies of these optical transitions are similar but their intensities are distinct.\nThis is due to the different orientation of the atoms in these two stackings. \nFor instance, the two peaks derived from the band edges are unique for both structures. \nAs seen in the optical transmittance profile of the ground state (Fig.~\\ref{fig4}(e)) these two peaks can be easily identified because of their almost equal oscillator strength. \nIn the rotated case however, the oscillator strength of the first peak is much smaller than the second one so that it can not be identified in the transmittance profile.  \nOn the other hand, the relative intensity of the first two peaks in the reflectivity profile are also unique for each stacking case. The intensity of the second peak is comparable but \nmuch smaller as compared to the first peak in the spectrum of the ground state.\n\nThis prediction is rather crucial to determine the stacking types of the heterostructures in experiments. The heterojunctions which are produced by growth technique might contain more than one \nstacking types in it, if the energy difference between different stacking types is small. Therefore, it is important to find a powerfull and sensitive tool to identify different stacking types in the produced heterostructures. In the light of above discussion, we suggest that the optical spectra (i.e. transmittance and reflectivity) can be used to identify different stacking types in a heterostructure.\n\n\\begin{figure}\n\\includegraphics[width=13cm]{fig4.pdf}\n\\caption{\\label{fig4} The optimized atomic structures of the two lowest energy \nconfigurations of GaS-Ca(OH)$_2$ heterostructure; (a) ground and (b) rotated state which has 5 meV higher energy. Their electronic structure ((c) and (d)) and \noptical transmittance and reflectivity ((e) and (f)).}\n\\end{figure}\n\n\\section{Conclusions}\nWe proposed a new kind of heterostructure in which the constituent monolayers are GaS and Ca(OH)$_2$ which are recently synthesized. \nThese two monolayers have similar lattice constants and they are \nwide band gap semiconductors. When they are stacked on top of \neach other the electronic band gap of the obtained heterostructure decreases \nsignificantly. Our calculations revealed that the obtained heterojuction is a \ntype II semiconductor in which the conduction band and the valence band are from \nGaS and Ca(OH)$_2$, respectively. This leads to localization of the electrons \nand holes in different layers which results in spatially indirect excitons. \nOur BSE-G$_0$W$_0$ calculations showed that the optical \noscillator strength of the GaS monolayer is an order of magnitude larger than \nthe one of monolayer Ca(OH)$_2$. We found that the band edge profiles of the optical spectrum of different stacking \ntypes of the heterojunction show differences although their electronic structures are rather similar.\nThis prediction opens up the possibility of using the optical spectrum \nfor the characterization of the stacking type of the ultra-thin \nheterostructures. \n \n\\section{Acknowledgments} \nThis work was supported by the Flemish Science Foundation (FWO-Vl) and the \nMethusalem foundation of the Flemish government. Computational resources were \nprovided by TUBITAK ULAKBIM, High Performance and Grid Computing Center \n(TR-Grid e-Infrastructure), and HPC infrastructure of the University of Antwerp \n(CalcUA) a division of the Flemish Supercomputer Center (VSC), which is funded \nby the Hercules foundation. H.S. is supported by a FWO Pegasus long Marie Curie \nFellowship.\n\n\\begin{thebibliography}{99}\n\n\\bibitem{graphene1} K. S. Novoselov, A. K. Geim, S. V. Morozov, D. Jiang, Y. Zhang, S. V. Dubonos, I. V. Grigorieva, and A. A. Firsov, Science \\textbf{306}, 666 (2004).\n\n\\bibitem{graphene2} K. S. Novoselov, D. Jiang, F. Schedin, T. J. Booth, V. V. Khotkevich, S. V. Morozov, and A. K. Geim, Proc. Natl. Acad. Sci. USA \\textbf{102}, 10451 (2005).\n\n\\bibitem{graphene3} A. K. Geim and K. S. Novoselov, Nat. Mater. \\textbf{6}, 183 (2007).\n\n\\bibitem{guzman} G. G. Guzm\\`{a}n-Verri and L. C. Lew Yan Voon,  Phys. Rev. B \\textbf{76}, 075131 (2007).\n\n\\bibitem{seymur} S. Cahangirov, M. Topsakal, E. Akturk, H. Sahin, and S. Ciraci, Phys. Rev. Lett. \\textbf{102}, 236804 (2009).\n \n\\bibitem{houssa} M. Houssa, G. Pourtois, V. V. Afanas\\'{e}v,  and A. Stesmans, Appl. Phys. Lett. \\textbf{96}, 082111 (2010).\n\n\\bibitem{sahin} H. Sahin, S. Cahangirov, M. Topsakal, E. Bekaroglu, E. Akturk, R. T. Senger, and S. Ciraci,  Phys. Rev. B \\textbf{80}, 155453 (2009).\n\n\\bibitem{neto} A. H. C. Neto and K. Novoselov, Rep. Prog. Phys. \\textbf{74}, 082501 (2011). \n\n\\bibitem{mak} K. F. Mak, C. Lee, J. Hone, J. Shan, and T. F. Heinz, Phys. Rev. Lett. \\textbf{105}, 136805 (2010).\n\n\\bibitem{splendiani} A. Splendiani, L. Sun, Y. Zhang, T. Li, J. Kim, C.-Y. Chim, G. Galli, and F. Wang, Nano Lett. \\textbf{10}, 1271 (2010).\n\n\\bibitem{wang} Q. H. Wang, K. Kalantar-Zadeh, A. Kis, J. N. Coleman, and M. S. Strano, Nat. Nanotechnol. \\textbf{7}, 699 (2012). \n\n\\bibitem{port} Y. Aierken, H. Sahin, F. Iyikanat, S. Horzum, A. Suslu, B. Chen, R. T. Senger, S. Tongay, and F. M. Peeters, Phys. Rev. B \\textbf{91}, 245413 (2015).\n\n\\bibitem{ma} Y. Ma, Y. Dai, M. Guo, L. Yu, and B. Huang, Phys. Chem. Chem. Phys. \\textbf{15}, 7098 (2013).\n\n\\bibitem{ptmcs} X. Meng, A. Pant, H. Cai, J. Kang, H. Sahin, B. Chen, K. Wu, S. Yang, A. Suslu, F. M. Peeters, and S. Tongay, Nanoscale \\textbf{7}, 17109 (2015).\n\n\\bibitem{ptmcs2} T. Cao, Z. Li, and S. G. Louie, Phys. Rev. Lett. \\textbf{114}, 236602 (2015).\n\n\\bibitem{ataca}C. Ataca, H. Sahin, and S. Ciraci, J. Phys. Chem. C \\textbf{116}, 8983 (2012).\n\n\\bibitem{miro} P. Mir\\'{o}, M. Audiffred, and T. Heine, Chem. Soc. Rev. \\textbf{43}, 6537 (2014).\n\n\\bibitem{chhowalla} M. Chhowalla, H. S. Shin, H. S. Shin, L.-J. Li, K. P. Loh, and H. Zhang, Nat. Chemistry \\textbf{5}, 263 (2013).\n\n\\bibitem{he} K. He, N. Kumar, L. Zhao, Z. Wang, K. F. Mak, H. Zhao, and J. Shan, Phys. Rev. Lett. \\textbf{113}, 026803 (2014). \n\n\\bibitem{klots} A. R. Klots, A. K. M. Newaz, B. Wang, D. Prasai, H. Krzyzanowska, J. Lin, D. Caudel, N. J. Ghimire, J. Yan, B. L. Ivanov, K. A. Velizhanin, A. Burger, D. G. Mandrus, N. H. Tolk, \nS. T. Pantelides, and  K. I. Bolotin, Scientific Reports \\textbf{4}, 6608 (2014).\n\n\\bibitem{chernikov} A. Chernikov, T. C. Berkelbach, H. M. Hill, A. Rigosi, Y. Li, O. B. Aslan, D. R. Reichman, M. S. Hybertsen, and T. F. Heinz, Phys. Rev. Lett. \\textbf{113}, 076802 (2014). \n\n\\bibitem{ugeda} M. M. Ugeda, A. J. Bradley, S.-F. Shi, F. H. da Jornada, Y. Zhang, D. Y. Qiu, W. Ruan, S.-K. Mo, Z. Hussain, Z.-X. Shen, F. Wang, Steven G. Louie, and Michael F. Crommie, \nNat. Mat. \\textbf{13}, 1091 (2014).\n\n\\bibitem{heinz} K. F. Mak, K. He, J. Shan, and Tony F. Heinz,  Nat. Nanotechnol. \\textbf{7}, 494 (2012). \n\n\\bibitem{sallen} G. Sallen, L. Bouet, X. Marie, G. Wang, C. R. Zhu, W. P. Han, Y. Lu, P. H. Tan, T. Amand, B. L. Liu, and B. Urbaszek, Phys. Rev. B \\textbf{86}, 081301(R) (2012).\n\n\\bibitem{xu} X. Xu, W. Yao, D. Xiao, and T. F. Heinz, Nat. Phys. \\textbf{10}, 343 (2014). \n\n\\bibitem{late1} D. J. Late, B. Liu, H. S. S. R. Matte, C. N. R. Rao, and V. P. Dravid, Adv. Funct. Mater. \\textbf{22}, 1894 (2012).\n\n\\bibitem{late2} D. J. Late, B. Liu, J. Luo, A. Yan, H. S. S. R. Matte, M. Grayson, C. N. R. Rao, and V. P. Dravid, Adv. Funct. Mater. \\textbf{24}, 3549 (2012).\n\n\\bibitem{hu}  P. A. Hu, Z. Z. Wen, L. F. Wang, P. H. Tan, and K. Xiao, ACS Nano \\textbf{6}, 5988 (2012).\n\n\\bibitem{geim} A. K. Geim and I. V. Grigorieva, Nature (London) \\textbf{499}, 419 (2013). \n\n\\bibitem{ross} J. S. Ross, P. Klement, A. M. Jones, N. J. Ghimire, J. Yan, D. G. Mandrus, T. Taniguchi, K. Watanabe, K. Kitamura, W. Yao, D. H. Cobden, and X. Xu, Nat. Nanotechnol. \\textbf{79}, \n268 (2014).\n\n\\bibitem{furchi} M. M. Furchi, A. Pospischil, F. Libisch, J. Burgd\\\"{o}rfer, and T. Mueller, Nano Lett. \\textbf{14}, 4785 (2014).\n\n\\bibitem{roy} T. Roy, M. Tosun, X. Cao, H. Fang, D.-H. Lien, P. Zhao, Y.-Z. Chen, Y.-L. Chueh, J. Guo, and A. Javey, ACS Nano \\textbf{9}, 2071 (2015).\n\n\\bibitem{rivera} P. Rivera, J. R. Schaibley, A. M. Jones, J. S. Ross, S. Wu, G. Aivazian, P. Klement, K. Seyler, G. Clark, N. J. Ghimire, J. Yan, D. G. Mandrus, W. Yao, and X. Xu, Nat. Commun. \n\\textbf{6}, 6242 (2015).\n\n\\bibitem{fang} H. Fang, C. Battaglia, C. Carraro, S. Nemsak, B. Ozdol, J. S. Kang, H. A. Bechtel, S. B. Desai, F. Kronast, A. A. Unal, G. Conti, C. Conlon, G. K. Palsson, M. C. Martin, Andrew\n M. Minor, C. S. Fadley, E. Yablonovitch, R. Maboudian, and A. Javey, Proc. Natl. Acad. Sci. USA \\textbf{111}, 6198 (2014).\n\n\\bibitem{calman} E. V. Calman, C. J. Dorow, M. M. Fogler, L. V. Butov, S. Hu, A. Mishchenko, and A. K. Geim,  arXiv:1510.04410v1.\n\n\\bibitem{paw1} G. Kresse and D. Joubert, Phys. Rev. B \\textbf{59}, 1758 (1999).\n\n\\bibitem{vasp1} G. Kresse and J. Hafner, Phys. Rev. B \\textbf{47}, 558(R) (1993).\n\n\\bibitem{pbe1} J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. \\textbf{77}, 3865 (1996).\n\n\\bibitem{bader1} R. F. W. Bader, \\textit{Atoms in Molecules - A Quantum Theory} (Oxford University Press, Oxford, UK, 1990).\n\n\\bibitem{grimme} S. Grimme, J. Comput. Chem. \\textbf{27}, 1787 (2006).\n\n\\bibitem{palummo} M. Palummo, M. Bernardi, and J. C. Grossman, Nano Lett. \\textbf{15}, 2794 (2015). \n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 8751, "prevtext": "\n\n\\title{Optical Properties of GaS-Ca(OH)$_2$ bilayer heterostructure}\n\n\\author{E. Torun}\n\\email{engin.torun@uantwerpen.be}\n\\affiliation{Department of Physics, University of Antwerp, Groenenborgerlaan 171, 2020 Antwerp, Belgium}\n\n\\author{H. Sahin}\n\\affiliation{Department of Physics, University of Antwerp, Groenenborgerlaan 171, 2020 Antwerp, Belgium}\n\n\\author{F. M. Peeters}\n\\affiliation{Department of Physics, University of Antwerp, Groenenborgerlaan 171, 2020 Antwerp, Belgium}\n\n\\date{\\today}\n\n\\pacs{78.66.-w 71.35.-y 73.22.-f 78.67.-n}\n\n\n\n\\begin{abstract}\nFinding novel atomically-thin heterostructures and understanding their characteristic properties are critical for developing better nanoscale optoelectronic devices. In this study, we investigate the electronic and optical properties of GaS-Ca(OH)$_2$ heterostructure using first-principle calculations. The band gap of the GaS-Ca(OH)$_2$ heterostructure is significantly reduced when compared with those of the isolated constituent layers. Our calculations show that the GaS-Ca(OH)$_2$ heterostructure is a type-II heterojunction which can be used to separate photoinduced charge carriers where electrons are localized in GaS and holes in the Ca(OH)$_2$ layer. This leads to spatially indirect excitons which are important for solar energy and optoelectronic applications due to their long lifetime.  By solving the Bethe-Salpeter equation on top of single shot GW calculation (G$_0$W$_0$) the dielectric function and optical oscillator strength of the constituent monolayers and the heterostructure are obtained. The oscillator strength of the optical transition for GaS monolayer is an order of magnitude larger than Ca(OH)$_2$ monolayer. We also found that the calculated optical spectra of different stacking types of the heterostructure show dissimilarities, although their electronic structures are rather similar. This prediction can be used to determine the stacking type of  ultra-thin heterostructures.\n\\end{abstract}\n\n\n\\maketitle\n\n\\section{Introduction}\nThe successful synthesis of graphene was a milestone in \ncondensed matter physics and materials science. \n\\cite{graphene1,graphene2,graphene3} Due to this remarkable achievement, a \nnew field of quasi-two-dimensional (2D) materials has emerged which \nchanged the perspective of materials research. Since then, the attention of \nmaterial science and condensed matter physics has been widened towards new \nsingle layer structures such as silicene \\cite{guzman,seymur}, germanene \n\\cite{seymur,houssa,sahin}, transition-metal dichalcogenides (TMDs) \n\\cite{neto,mak,splendiani,wang},  alkaline-earth-metal hydroxide (AEMHs) \n\\cite{port} and post-transition metal chalcogenides (PTMCs).\\cite{ma,ptmcs,ptmcs2} \n\nThese individual monolayers posses various significant electronic and \noptical properties which make them promising candidates for the next \ngeneration of nanoscale devices.\\cite{ataca,miro,chhowalla} For instance, monolayer TMDs are direct band gap semiconductors \nunlike their bulk counterparts, \\cite{mak,splendiani,wang} and exhibit large exciton binding energies in the order of 0.1-1.0 eV which results in  \n exciton resonances at room temperature. \\cite{he,klots,chernikov,ugeda} In addition, \nhaving strong coupling between the spin and the valley degrees of freedom \nopens up the possibility of valleytronic devices. \\cite{heinz,sallen,xu}     \n\nIn spite of the large amount of research on graphene-like structures and \nultra-thin TMDs, studies on single layer AEMHs (i.e.~Ca(OH)$_2$ and \nNi(OH)$_2$) and PTMCs (i.e.~GaS and GaSe) are sparse and have only very recently \nstarted. In the recent study of Aierken \\textit{et al.} it was shown that \nCa(OH)$_2$ can be isolated in monolayer form and it is a \ndirect band gap semiconductor independent of the number of layers. \\cite{port} \nSimilar to Ca(OH)$_2$, monolayer GaS and GaSe have been synthesized recently and it has been shown that both monolayers \nare indirect gap semiconductors and they are suitable candidates for use in \nfield-effect transistors and nanophotonic devices. \\cite{ptmcs,late1,late2,hu}\n\nAnother important aspect of the mentioned layered structures is \ntheir usage as building blocks for novel multi-layer heterostructures.  Recently, \na new field of research in materials science has emerged that deals with the \nstacking of two or more different monolayers on top of each other, namely van \nder Waals (vdW) heterostructures.\\cite{geim} This widens considerably the \ndiversity of possibilities for new functionalities and increases the range of \ndifferent electronic and opto-electronic applications. For instance, it has \nbeen shown that a p-n junction based on the hBN-WSe$_2$ heterostructure\nexhibit tunable electroluminescence \\cite{ross}. In addition, TMD \nheterostructures show a tunable photovoltaic effect \\cite{furchi} and can be \nused as tunnel diodes and transistors \\cite{roy}. Long-lived interlayer \nexcitons were observed by photoluminescence excitation spectroscopy in \nMoSe$_2$-WSe$_2$ heterostructure where electrons and holes are localized in \ndifferent layers. \\cite{rivera} It has been shown that spatially indirect \nexcitons can also be found in MoS$_2$-WSe$_2$ heterostructures which is a type II \nheterojuction. \\cite{fang}  Very recently, Calman \\textit{et al.} showed that the excitons in MoS$_2$ and \nhexagonal boron nitride (hBN) vdW heterostructure can be controlled by a gate \nvoltage, temperature, and the intensity and the helicity of the optical \nexcitation. \\cite{calman} \n\nSo far, the building blocks of these multi-layer heterostructures are \nusually graphene (and graphene-like monolayers) or \nTMD monolayers. Whereas, in this work we propose a new kind of \nheterostructure whose building blocks are GaS and Ca(OH)$_2$ which are \nrelatively new 2D crystals and they are members of PTMCs and AEMHs, \nrespectively. We show that the GaS and Ca(OH)$_2$ monolayers have similar \nlattice parameters and they are wide band gap semiconductors. When they are \nstacked on top of each other they form a type II heterojuction which has a \nsmaller band gap than the constituent layers. The calculated optical oscillator \nstrength of the GaS monolayer is $\\sim$10 times larger than the \none for  monolayer Ca(OH)$_2$. \n\nThis paper is organized as follows:\nWe first provide the computational methodology in Sec.~II. Then, \nwe investigate the geometric, electronic and optical properties \nof the isolated GaS and Ca(OH)$_2$ monolayers in Sec. III and the GaS-Ca(OH)$_2$ heterostructure in Sec.~IV.  \nIn Sec.~V, we show that the optical spectra of the heterostructure can be used to characterize their stacking type. \nFinally, we conclude our results in Sec.~VI.\n\n\\section{Computational Methodology}\nFirst-principle calculations are performed using the frozen-core projector augmented wave (PAW)~\\cite{paw1} potentials as implemented in the Vienna Ab-initio Simulation Package  (VASP).\\cite{vasp1} The electronic exchange-correlation potential is treated within the generalized gradient approximation (GGA) of Perdew-Burke-Ernzerhof (PBE).\\cite{pbe1} A plane-wave basis set with kinetic energy cutoff of 500 eV is used. A vacuum spacing of more  than 12~\\AA{} is taken to prevent interaction between adjacent images. A set of 20$\\times$20$\\times$1 $\\Gamma$ centered \\textbf{k}-point sampling is used for the primitive unit cells. The structures are relaxed until self-consistency for ionic relaxation reached 10$^{-5}$~eV between two consecutive steps. Pressures on the lattice unit cell are decreased to values less than 1.0 kBar in all directions. Atomic charge transfers are calculated using Bader's charge analysis. \\cite{bader1} We used the DFT-D2 method of Grimme as implemented in VASP for the\nvan der Waals correction in all the calculations. \\cite{grimme}\n\nThe dielectric function and the optical oscillator strength of the individual monolayers and the heterostructure \nare calculated by solving the Bethe-Salpeter equation (BSE) on top of the single shot GW (G$_{0}$W$_{0}$) calculation which is performed on top of standard DFT calculations including \nspin-orbit coupling (SOC). During this process we used $6\\times6\\times1$ $\\Gamma$ centered \\textbf{k}-point sampling. The cutoff for the response function was set to 200~eV. The number of bands used in our calculation is 320. The cutoff energy for the plane-waves was chosen to be 400~eV. We include 4 valence and 4 conduction bands into the calculations in the BSE step. \n\nOnce the dielectric function is obtained other linear optical spectral quantities such as layer dependent optical absorbance ($A(\\omega)$), transmittance ($T(\\omega)$) and frequency dependent reflectivity at normal incidence ($R(\\omega)$) can be calculated using the formula;\n\n\n", "index": 1, "text": "\\begin{equation}\n\\begin{split}\nA(\\omega)&=\\frac{\\omega}{c} L \\text{Im}\\varepsilon(\\omega), \\\\\nT(\\omega)&=1-A(\\omega),\\\\\nR(\\omega)&=\\left|\\frac{\\sqrt{\\varepsilon(\\omega)}-1}{\\sqrt{\\varepsilon(\\omega)}+1}\\right|^2\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle A(\\omega)&amp;\\displaystyle=\\frac{\\omega}{c}L\\text{Im}%&#10;\\varepsilon(\\omega),\\\\&#10;\\displaystyle T(\\omega)&amp;\\displaystyle=1-A(\\omega),\\\\&#10;\\displaystyle R(\\omega)&amp;\\displaystyle=\\left|\\frac{\\sqrt{\\varepsilon(\\omega)}-1%&#10;}{\\sqrt{\\varepsilon(\\omega)}+1}\\right|^{2}\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><mfrac><mi>ω</mi><mi>c</mi></mfrac><mo>⁢</mo><mi>L</mi><mo>⁢</mo><mtext>Im</mtext><mo>⁢</mo><mi>ε</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><msup><mrow><mo>|</mo><mfrac><mrow><msqrt><mrow><mi>ε</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt><mo>-</mo><mn>1</mn></mrow><mrow><msqrt><mrow><mi>ε</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt><mo>+</mo><mn>1</mn></mrow></mfrac><mo>|</mo></mrow><mn>2</mn></msup></mrow></mtd></mtr></mtable></math>", "type": "latex"}]