[{"file": "1601.05094.tex", "nexttext": "\nwhere $T_a$ are the generators of $SU(N)$ and\nwhere the fields $\\eta_a$ are the corresponding real coefficients in the expansion.\nIn addition, we assume that\n$\\phi$ and $\\eta$ are charged under distinct $\\IZ_2$ symmetries which we call\n$\\IZ_2^\\phi$ and $\\IZ_2^\\eta$, respectively.  The most general renormalizable scalar\npotential for $\\phi$ and $\\eta$ consistent with these symmetries is\nthen given by\n\\begin{eqnarray}\n  V_0 & = & \\frac{1}{2} M^2 \\phi^\\dagger \\phi\n    + \\mu^2\\mathrm{Tr}[{\\eta}{\\eta}]\n    + \\frac{\\xi_\\phi}{4}(\\phi^\\dagger\\phi)^2\n     \\nonumber \\\\ \n    & &\n    ~+  \\xi_\\eta\\big(\\mathrm{Tr}[{\\eta}{\\eta}]\\big)^2\n    + \\frac{\\xi_1}{2}\\phi^\\dagger{\\eta}{\\eta}\\phi\n    + \\xi_2\\mathrm{Tr}[{\\eta}{\\eta}{\\eta}{\\eta}]~,~~~~~~~\n    \\label{eq:V0}\n\\end{eqnarray}\nwhere $M$ and $\\mu$ are parameters with dimensions of mass, and where\n$\\xi_\\phi$, $\\xi_\\eta$, $\\xi_1$, and $\\xi_2$ are\ndimensionless coupling constants.\n\nLet us consider the regime in which $\\mu^2 < 0$ and $\\xi_\\eta > 0$, with\nthe values of the remaining model parameters such that $\\langle \\phi \\rangle = 0$.\nMoreover, for simplicity, let us assume that $\\xi_2$ is sufficiently small\nthat its effects on the vacuum structure of the theory can safely be neglected.\nIn this regime, the potential in Eq.~(\\ref{eq:V0}) is minimized for any set of\nvacuum expectation values (VEVs) $v_a \\equiv \\langle \\eta_a \\rangle$ which satisfy\nthe condition\n\n", "itemtype": "equation", "pos": 14056, "prevtext": "\n\\title{\nRandomness in the Dark Sector:\\\\\nEmergent Mass Spectra and Dynamical Dark Matter Ensembles\n}\n\n\n\\author{Keith R. Dienes$^{1,2}$\\footnote{E-mail address:  {\\tt dienes@email.arizona.edu}},\n      Jacob Fennick$^{3}$\\footnote{E-mail address:  {\\tt jfennick@hawaii.edu}},\n      Jason Kumar$^{3}$\\footnote{E-mail address:  {\\tt jkumar@hawaii.edu}},\n      Brooks Thomas$^{4}$\\footnote{E-mail address:  {\\tt bthomas@ColoradoCollege.edu}}}\n\\affiliation{\n     $^1\\,$Department of Physics, University of Arizona, Tucson, AZ  85721  USA\\\\\n     $^2\\,$Department of Physics, University of Maryland, College Park, MD  20742  USA\\\\\n     $^3\\,$Department of Physics \\& Astronomy, University of Hawaii, Honolulu, HI 96822  USA\\\\\n     $^4\\,$Department of Physics, Colorado College, Colorado Springs, CO  80903  USA}\n\n\\begin{abstract}\nIn general, non-minimal models of the dark sector\nsuch as Dynamical Dark Matter posit the existence\nof an ensemble of individual dark components\nwith differing masses, cosmological abundances, and couplings\nto the Standard Model.\nPerhaps the most critical among these features is the spectrum of masses,\nas this goes a long way towards determining the cosmological\nabundances and lifetimes of the corresponding states.\nMany different underlying theoretical structures can be imagined for the dark sector,\neach giving rise to its own mass spectrum and corresponding density of states.\nIn this paper, by contrast, we investigate the spectrum of masses\nthat emerges statistically from underlying processes which are essentially\nrandom.\nWe find a density of states $n(m)$ which decreases as a function of mass and actually\nhas an upper limit $m_{\\rm max}$ beyond which $n(m)=0$.   \nWe also demonstrate that this ``emergent'' density of states\nis particularly auspicious from the perspective of the Dynamical Dark Matter framework,\nleading to cosmological abundances and decay widths that are suitably balanced against\neach other across the dark-matter ensemble.\nThus randomness in the dark sector coexists quite naturally with Dynamical Dark Matter,\nand we examine the prospects for observing\nthe signals of such scenarios in dark-matter indirect-detection experiments.\n\\end{abstract}\n\n\n\\maketitle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction\\label{sec:Introduction}}\n\n\n\nDynamical Dark Matter~\\cite{DDM1,DDM2} (DDM) is an alternative framework\nfor dark-matter physics in which the dark sector consists of a large\n(potentially vast) ensemble of individual dark-matter particles, each\nwith its own mass, cosmological abundance, and decay width for decays\ninto Standard-Model (SM) states. \nWithin the DDM framework,\nthe phenomenological viability of such an ensemble is then achieved through\na balancing of lifetimes against cosmological abundances across the entire\nset of states comprising the ensemble.\nSpecifically, states within the DDM ensemble which have greater decay widths\ninto SM  states must have smaller cosmological abundances,\nwhile states with smaller decay widths may have larger cosmological abundances~\\cite{DDM1,DDM2}.\nAs such, DDM furnishes what may be considered to be the most general\nexample of a non-minimal dark sector, and even reduces to (and thereby incorporates) the simple\ncase of a single hyperstable dark-matter particle  \nas the number of individual states within the DDM ensemble \nis taken to one.\nHowever, as the number of dark-sector states becomes larger, these ensembles\ngive rise to rich collider-based, astrophysical, and cosmological\nphenomenologies~\\cite{DDMAxion,DDMLHC,DDMDD,DDMAMS,DDMComplementarity,CutsAndCorrelations,DDMJeff}\nwhich generalize and even transcend what is possible with a single dark-matter particle alone.\n\nAt first glance, it might seem that the masses, abundances and lifetimes\nof the individual components of the dark ensemble might be completely arbitrary.\nSuch a scenario would then require the introduction of a plethora of undetermined\nparameters, and would hardly be compelling from a theoretical perspective.\nHowever, as has been discussed in \nprior and ongoing work (see, {{\\it e.g.}\\/}, Refs.~\\cite{DDM1,DDM2,DDMString,DesigningDDMPaper})\nthe structures of such DDM ensembles \nare {\\it not}\\/ arbitrary --- they are \ndetermined according to internal organizing principles which \ndescribe the entire dark-sector ensemble as a single collective entity,\nwith the properties of all constituents of the ensemble specified in relation to each other.\nAs a result, realistic DDM ensembles are characterized by only a\nhandful of free parameters, and are thus every bit as predictive and as natural\nas more traditional dark-matter candidates.  \n\n\nThe presence of an organizing principle underpinning the structure of \nthe ensemble has been a universal feature of all realistic DDM models to date.  Indeed,\nin all cases, such organizing principles \nare then ultimately manifested \nin {\\it scaling relations}\\/ which \ncharacterize how the different properties of the ensemble \nconstituents scale with respect to each other across the ensemble as a whole.  \nThere are ultimately three different scaling relations which are critical for the\nphenomenology (and eventual viability) of the DDM ensemble.\nThe first of these is the relationship between the mass of an ensemble constituent \nand its cosmological abundance.  This usually depends on the theoretical structure of the ensemble along \nwith the additional choice of a particular \nthe additional choice of a particular \ncosmological history.   The second is a relationship between the mass of \nthe constituent and its decay width into SM  states.  \nThis usually depends on the structure of the ensemble along with the additional \nchoice of particular couplings between the ensemble and SM  states.\nHowever, there is a third scaling relation which follows directly from the structure\nof the ensemble itself, without any additional assumptions.\nThis is the  relationship between the \nmass of the constituent and the number of constituents with similar masses --- {{\\it i.e.}\\/}, \nthe density of states for the ensemble.  In some sense,\nthis latter scaling relation can be viewed as the most fundamental,\ndescribing the intrinsic spectral structure of the ensemble \nas a single entity.\n\n\nThere are many possible underlying theoretical structures \n--- {{\\it i.e.}\\/}, many possible over-arching theoretical constructions ---\nthat have been shown to give rise to viable \nDDM ensembles.\nFor example, viable\nDDM scenarios are known to exist in which the constituents are\nthe Kaluza-Klein modes of a single higher-dimensional field~\\cite{DDM1,DDM2,DDMAxion}.\nAlternatively, viable DDM scenarios exist in which \nthe constituents are the ``hadronic'' resonances which appear in the confining phase of a\nstrongly-coupled theory~\\cite{DDMString}, or as the oscillator states of \na fundamental string~\\cite{DDMString}.  In such cases, the sets of\nscaling relations which characterize the ensemble are fully determined\nby the underlying parameters of the theory.  \n\nIn this paper, however, we shall consider another possibility entirely, one in which\nthe properties of the ensemble constituents are {\\it not}\\/ dictated by an underlying theoretical construction, but\nare instead determined by random dynamical processes in the early universe.  \nAs we shall demonstrate, this need not be problematic because the required \nscaling relations can actually arise {\\it statistically}\\/, as {\\it emergent} phenomena.\nIndeed,\nalthough the mass, decay width, and cosmological abundance of each individual\nensemble constituent continues to be essentially random, \nthere exists a well-defined probability \ndistribution function (PDF) for each of these quantities across the ensemble \nas a whole.  As the number of constituents in the ensemble grows\nlarge --- the regime of interest for DDM --- the\ndistribution of each such quantity across the ensemble \nconforms to the corresponding PDF with\nan increasingly overwhelming probability.\nThus, such scenarios naturally\ngive rise to robust --- albeit probabilistic --- predictions for one or\nmore of the fundamental scaling relations that characterize the ensemble.\nMoreover, in scenarios of this sort,\nthe properties of the ensemble \ncontinue to be determined --- up to statistical fluctuations --- by only a few model \nparameters.\n\nIn this paper we shall provide a concrete example of a scenario in which a \n``statistical'' DDM ensemble of this sort arises.  \nThis will happen in essentially two steps.\nFirst, we shall demonstrate how random processes can give rise to a\nunique mass spectrum for a non-trivial dark sector.\nAs required, this spectrum can be recast as a scaling relationship between \nthe masses and density of states across a dark-sector ensemble.\nTo do this, we consider a\nclass of models in which there exists a hidden sector comprising one or more fields which\ntransform in some non-trivial multiplet representation of a large hidden-sector symmetry\ngroup.  Hidden-sector symmetries of this sort are well-motivated both in grand\nunified theories and in string theory.   \nIf this symmetry remains unbroken, the masses of the individual\ncomponent fields within these multiplets --- the fields which play the role of \nthe DDM ensemble constituents in models of this sort --- remain equal.  However, \nin cases in which this symmetry group is spontaneously broken, the degeneracy is \nlifted and a non-trivial mass spectrum for these component fields is generated.\nThis mass spectrum depends on the particular location on the vacuum manifold \nchosen by the symmetry-breaking dynamics.  Since this choice is essentially arbitrary, \nthe masses of the individual ensemble constituents are essentially random.  \nNevertheless, as we shall demonstrate, a predictable density-of-states function emerges in the limit that \nthe number of component fields is large.  \nMoreover, \nwe shall find that\nthis emergent density-of-states function \nis quite unlike those that emerge for KK towers, dark ``hadrons'',\nor other theoretical constructs.   Indeed, we shall see that it exhibits classic\nhallmarks that reflect its essentially random, statistical origin.\n\nThe second step is then to use this statistical scaling relation between masses and density \nof states in order to derive the additional required scaling relations \ninvolving decay widths/lifetimes and cosmological abundances.\nHowever, this second step need not necessarily involve \nadditional random dynamics.\nIndeed, once our statistical density-of-states function is specified,\nwe shall see that standard, well-established mechanisms for deriving \nthese additional scaling\nrelations will suffice. \nIn our case, however, we shall nevertheless introduce \na second (relatively minor) source of randomness into this step as well.\nOur purpose in doing this will be to remain as general as possible;\nwe shall nevertheless find that \nthis additional randomness does not disturb the main \nphenomenological features of our construction.\n\n\nThe ultimate result of our construction will be a collection of \nparticles whose scaling relations \nare emergent and satisfy the basic criteria for a viable DDM ensemble,\nwith lifetimes suitably balanced against abundances.\nMoreover, as we shall see, our underlying ``statistical'' density-of-states function \nwill be responsible in large measure for this success. \nThus, in this sense, we shall conclude that\nrandomness in the dark sector coexists quite naturally with DDM.~\n\nThis paper is organized as follows.  In Sect.~\\ref{sec:Model}, we present a simple\ntoy model of the sort described above --- {{\\it i.e.}\\/}, a model\nin which our non-minimal dark-sector constituents \ntransform as the elements of a multiplet\nof a large hidden-sector $SU(N)$ symmetry group,\nand in which\na non-trivial mass spectrum for these fields \nis generated via the random spontaneous breaking of this symmetry.\nThen, in Sect.~\\ref{sec:RandomMatrixGeneration}, \nusing the methods of random-matrix theory,  \nwe analyze the statistical properties of the resulting mass spectrum and the corresponding\ndensity of states.    We stress that our results up to this point are completely general,\nand need not have any particular connection to DDM.~  \nHowever, in \nSect.~\\ref{sec:DetectionAbundance}, we then examine how these ensemble constituents \ncan be coupled in a self-consistent manner to other fields of the theory, including \nthe fields of the SM.~   Such couplings to the SM will then enable us to translate our statistical mass spectra\ninto statistical relations governing the spectra of decay widths and cosmological abundances,\nand we shall find that  \nensembles \nexhibiting the properties of viable DDM ensembles\nnaturally emerge.\nFinally, in Sect.~\\ref{sec:IndirectDet}, we investigate the prospects for observing \nthe signals of such scenarios in dark-matter indirect-detection experiments.\nOur conclusions are summarized in Sect.~\\ref{sec:Conclusion}.\n\n\n\n\\section{Randomness in the Dark Sector:   An Example Model\\label{sec:Model}}\n\n\n\nIn this section, we introduce a simple toy model of the dark sector in which\nthe mass of each component within the resulting ensemble of states is determined\nthrough an essentially  random process.\nOur discussion in this section will be limited to setting up the model itself and the method\nby which these masses are generated. \nSect.~\\ref{sec:RandomMatrixGeneration} will then be devoted to an analysis of \nthe statistical properties of the resulting mass spectrum and the scaling   \nbehaviors it exhibits.\n\nOur toy model of the dark sector is as follows.\nWe begin by considering a scalar field $\\phi$ which\ntransforms in the fundamental representation of some $SU(N)$ symmetry --- a symmetry\nwhich may in principle be either global or local.  The $N$ individual complex\ncomponents $\\phi_i$ of this $SU(N)$ multiplet will collectively constitute our\nensemble.  In addition to $\\phi$, our toy model also includes a real scalar field\n$\\eta$ which transforms in the adjoint representation of the same $SU(N)$ symmetry.\nFor notational convenience, we can expand $\\eta$ in an $SU(N)$ basis\n\n", "index": 1, "text": "\\begin{equation}\n  {\\eta} ~\\equiv~ \\sum_{a=1}^{N^2-1} \\eta_a T_a~,\n  \\label{eq:etaDef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\eta}~{}\\equiv~{}\\sum_{a=1}^{N^{2}-1}\\eta_{a}T_{a}~{},\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><mi>η</mi></mpadded><mo rspace=\"5.8pt\">≡</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>a</mi><mo>=</mo><mn>1</mn></mrow><mrow><msup><mi>N</mi><mn>2</mn></msup><mo>-</mo><mn>1</mn></mrow></munderover><mrow><msub><mi>η</mi><mi>a</mi></msub><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>T</mi><mi>a</mi></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nThus, we see that the vacuum manifold for this toy theory is the surface of\nan $(N^2-2)$-sphere, and that the $v_a$  can be thought of as the components of an\n$(N^2-1)$-dimensional vector with length $v$.  The vacuum-manifold condition\nin Eq.~(\\ref{eq:VacuumManifoldCondit}) implies that one or more of the $\\eta_a$\nalways acquires a non-zero VEV.  Thus, the $SU(N)$ symmetry is at least partially\nbroken.  For a generic configuration of VEVs which satisfy this condition, all of\nthe $v_a$ are non-zero.\n\nSince the vacuum manifold is an equipotential surface,\nthere is no dynamical principle which determines the direction of this\n$(N^2-1)$-dimensional vector in field space.  In the absence of such a\ndynamical principle, this direction --- and the corresponding values of the\n$v_a$ --- are essentially arbitrary.  {\\it It is therefore reasonable to assume\nthat the particular assignment of $v_a$ values within the vacuum manifold are\ndetermined by random fluctuations in the early universe and that this\nassignment itself can therefore also be considered to be effectively\nrandom.}\n\nAlthough the assignment of $v_a$ values within the vacuum\nmanifold specified by Eq.~(\\ref{eq:VacuumManifoldCondit}) does not affect\n$\\langle V_0\\rangle$, this assignment does have physical consequences.\nChief among the items affected is the spectrum of masses of\nthe individual components of the $\\phi$ multiplet.\nThe mass matrix $\\mathcal{M}^2$ for the individual\ncomponents $\\phi_i$ of the multiplet $\\phi$ receives an additional\ncontribution from the $v_a$ in the broken phase of the theory.\nIn particular, the elements of this matrix become\n\\begin{eqnarray}\n  \\mathcal{M}^2_{ij} &=& M^2 \\mathbb{I}_{ij} +\n    \\xi_1 (\\langle{\\eta}\\rangle \\langle{\\eta}\\rangle)_{ij} \\nonumber \\\\\n    & = & M^2 \\mathbb{I}_{ij} +\n    \\xi_1 \\sum_{a=1}^{N^2-1} \\sum_{b=1}^{N^2-1} v_a v_b (T_a T_b)_{ij}~,~~\n  \\label{eq:MassMatrix}\n\\end{eqnarray}\nwhere $\\mathbb{I}$ is the $N\\times N$ identity matrix and where\n\n", "itemtype": "equation", "pos": 15569, "prevtext": "\nwhere $T_a$ are the generators of $SU(N)$ and\nwhere the fields $\\eta_a$ are the corresponding real coefficients in the expansion.\nIn addition, we assume that\n$\\phi$ and $\\eta$ are charged under distinct $\\IZ_2$ symmetries which we call\n$\\IZ_2^\\phi$ and $\\IZ_2^\\eta$, respectively.  The most general renormalizable scalar\npotential for $\\phi$ and $\\eta$ consistent with these symmetries is\nthen given by\n\\begin{eqnarray}\n  V_0 & = & \\frac{1}{2} M^2 \\phi^\\dagger \\phi\n    + \\mu^2\\mathrm{Tr}[{\\eta}{\\eta}]\n    + \\frac{\\xi_\\phi}{4}(\\phi^\\dagger\\phi)^2\n     \\nonumber \\\\ \n    & &\n    ~+  \\xi_\\eta\\big(\\mathrm{Tr}[{\\eta}{\\eta}]\\big)^2\n    + \\frac{\\xi_1}{2}\\phi^\\dagger{\\eta}{\\eta}\\phi\n    + \\xi_2\\mathrm{Tr}[{\\eta}{\\eta}{\\eta}{\\eta}]~,~~~~~~~\n    \\label{eq:V0}\n\\end{eqnarray}\nwhere $M$ and $\\mu$ are parameters with dimensions of mass, and where\n$\\xi_\\phi$, $\\xi_\\eta$, $\\xi_1$, and $\\xi_2$ are\ndimensionless coupling constants.\n\nLet us consider the regime in which $\\mu^2 < 0$ and $\\xi_\\eta > 0$, with\nthe values of the remaining model parameters such that $\\langle \\phi \\rangle = 0$.\nMoreover, for simplicity, let us assume that $\\xi_2$ is sufficiently small\nthat its effects on the vacuum structure of the theory can safely be neglected.\nIn this regime, the potential in Eq.~(\\ref{eq:V0}) is minimized for any set of\nvacuum expectation values (VEVs) $v_a \\equiv \\langle \\eta_a \\rangle$ which satisfy\nthe condition\n\n", "index": 3, "text": "\\begin{equation}\n  \\sum_{a=1}^{N^2-1}v_a^2 ~\\equiv~ v^2\n    ~=~ -\\frac{\\mu^2}{2\\xi_\\eta}~.\n  \\label{eq:VacuumManifoldCondit}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\sum_{a=1}^{N^{2}-1}v_{a}^{2}~{}\\equiv~{}v^{2}~{}=~{}-\\frac{\\mu^{2}}{2\\xi_{%&#10;\\eta}}~{}.\" display=\"block\"><mrow><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>a</mi><mo>=</mo><mn>1</mn></mrow><mrow><msup><mi>N</mi><mn>2</mn></msup><mo>-</mo><mn>1</mn></mrow></munderover><mpadded width=\"+3.3pt\"><msubsup><mi>v</mi><mi>a</mi><mn>2</mn></msubsup></mpadded></mrow><mo rspace=\"5.8pt\">≡</mo><mpadded width=\"+3.3pt\"><msup><mi>v</mi><mn>2</mn></msup></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><mo>-</mo><mpadded width=\"+3.3pt\"><mfrac><msup><mi>μ</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msub><mi>ξ</mi><mi>η</mi></msub></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nis the VEV of the matrix in Eq.~(\\ref{eq:etaDef}).  This contribution\nlifts the mass degeneracy among the $\\phi_i$ and results\nin a non-trivial spectrum of masses $m_i$ for the corresponding physical\nparticles --- a mass spectrum which is sensitive to the particular assignment of\n$v_a$ values.  \nIt is therefore in this way that the randomness of the dark sector affects\nthe masses of the components of the dark-matter ensemble. \nIndeed, the resulting squared masses $m^2$ of the ensemble constituents\nare simply the eigenvalues of the mass matrix in Eq.~(\\ref{eq:MassMatrix}), {{\\it i.e.}\\/},\n\n", "itemtype": "equation", "pos": 17685, "prevtext": "\nThus, we see that the vacuum manifold for this toy theory is the surface of\nan $(N^2-2)$-sphere, and that the $v_a$  can be thought of as the components of an\n$(N^2-1)$-dimensional vector with length $v$.  The vacuum-manifold condition\nin Eq.~(\\ref{eq:VacuumManifoldCondit}) implies that one or more of the $\\eta_a$\nalways acquires a non-zero VEV.  Thus, the $SU(N)$ symmetry is at least partially\nbroken.  For a generic configuration of VEVs which satisfy this condition, all of\nthe $v_a$ are non-zero.\n\nSince the vacuum manifold is an equipotential surface,\nthere is no dynamical principle which determines the direction of this\n$(N^2-1)$-dimensional vector in field space.  In the absence of such a\ndynamical principle, this direction --- and the corresponding values of the\n$v_a$ --- are essentially arbitrary.  {\\it It is therefore reasonable to assume\nthat the particular assignment of $v_a$ values within the vacuum manifold are\ndetermined by random fluctuations in the early universe and that this\nassignment itself can therefore also be considered to be effectively\nrandom.}\n\nAlthough the assignment of $v_a$ values within the vacuum\nmanifold specified by Eq.~(\\ref{eq:VacuumManifoldCondit}) does not affect\n$\\langle V_0\\rangle$, this assignment does have physical consequences.\nChief among the items affected is the spectrum of masses of\nthe individual components of the $\\phi$ multiplet.\nThe mass matrix $\\mathcal{M}^2$ for the individual\ncomponents $\\phi_i$ of the multiplet $\\phi$ receives an additional\ncontribution from the $v_a$ in the broken phase of the theory.\nIn particular, the elements of this matrix become\n\\begin{eqnarray}\n  \\mathcal{M}^2_{ij} &=& M^2 \\mathbb{I}_{ij} +\n    \\xi_1 (\\langle{\\eta}\\rangle \\langle{\\eta}\\rangle)_{ij} \\nonumber \\\\\n    & = & M^2 \\mathbb{I}_{ij} +\n    \\xi_1 \\sum_{a=1}^{N^2-1} \\sum_{b=1}^{N^2-1} v_a v_b (T_a T_b)_{ij}~,~~\n  \\label{eq:MassMatrix}\n\\end{eqnarray}\nwhere $\\mathbb{I}$ is the $N\\times N$ identity matrix and where\n\n", "index": 5, "text": "\\begin{equation}\n  \\langle{\\eta}\\rangle ~\\equiv~ \\sum_{a=1}^{N^2-1} v_a T_a~\n  \\label{eq:etaAbsDef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\langle{\\eta}\\rangle~{}\\equiv~{}\\sum_{a=1}^{N^{2}-1}v_{a}T_{a}~{}\" display=\"block\"><mrow><mrow><mo stretchy=\"false\">⟨</mo><mi>η</mi><mo rspace=\"5.8pt\" stretchy=\"false\">⟩</mo></mrow><mo rspace=\"5.8pt\">≡</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>a</mi><mo>=</mo><mn>1</mn></mrow><mrow><msup><mi>N</mi><mn>2</mn></msup><mo>-</mo><mn>1</mn></mrow></munderover><mrow><msub><mi>v</mi><mi>a</mi></msub><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>T</mi><mi>a</mi></msub></mpadded></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nwhere $\\lambda$ are the eigenvalues of the matrix $\\langle {\\eta} \\rangle$.\n\n\n\n\nWe conclude this section with several important comments.\nFirst, we note that while the mass spectrum of the $\\phi_i$ is in large part\ndetermined by the random values assigned to the $v_a$, certain properties of the\nmass-squared matrix for our ensemble constituents are nevertheless ensured by the\nsymmetry structure of the theory.  For example, the $\\IZ_2^\\eta$ symmetry ensures that\nthe eigenvalues $m_i^2$ of $\\mathcal{M}^2$ be positive-definite by forbidding operators\nsuch as $\\mathcal{O}_{{\\not{\\IZ}_2^\\eta}} \\sim \\phi^\\dagger \\eta \\phi$ from appearing in\nthe scalar potential in Eq.~(\\ref{eq:V0}).  This, in turn, ensures that the $\\IZ_2^\\phi$\nsymmetry remain unbroken at the minimum of the potential.  Thus, in the absence of\nany additional source of $\\IZ_2^\\phi$-symmetry breaking, the lightest of the $\\phi_i$\nmass eigenstates is absolutely stable.\n\nIt is perhaps also worth emphasizing that no splitting between the masses of the\nreal and imaginary components of the complex scalars $\\phi_i$ results from the\nspontaneous breaking of the $SU(N)$ symmetry in this model.\nIndeed, even in the broken phase of the theory, the Lagrangian for our toy model\nremains invariant under independent phase rotations of each of the $\\phi_i$.\nThis is a reflection of the fact that\neven in the case in which all of the $v_a$ are non-zero, the $SU(N)$ symmetry\nis not broken completely.  Indeed, the breaking of a symmetry by the VEV of\nan adjoint field cannot reduce the rank of the group.  Rather, a residual\n$U(1)^{N-1}$ symmetry always remains;  this may be either global or local, depending on\nthe construction.  Moreover, it can be seen from Eq.~(\\ref{eq:V0}) that our theory\nis also invariant under an ``accidental'' global $U(1)$ symmetry which corresponds\nto an overall phase rotation of the multiplet $\\phi$.  This overall $U(1)^{N}$\nsymmetry corresponds to the invariance of the Lagrangian under phase rotations of\nthe $N$ different fields $\\phi_i$.\n\nFinally, we remark that \nwe have yet to specify whether the $SU(N)$ symmetry is local or\nglobal.  Indeed, this choice does not have any effect on the mass spectrum of\nthe dark-sector ensemble --- at least at tree level.  However, this choice does have other\nimportant phenomenological consequences.  In the case in which this \nsymmetry is global, for example, a massless Goldstone boson will appear in the spectrum \nof the low-energy theory for each spontaneously-broken symmetry generator.\nThe presence of such a large number of Goldstone bosons is difficult to reconcile with \nobservational data.  These particles can violate bounds on the number of \nlight, thermalized degrees of freedom derived from Cosmic Microwave Background (CMB)\ndata~\\cite{Ade:2015xua}.  They may also potentially mediate long-range interactions \nbetween dark-matter particles which conflict with bounds from observations of large- \nand small-scale structure (see, {{\\it e.g.}\\/}, Ref.~\\cite{Ackerman:mha}).  There are two ways\nof evading these constraints.  One is to gauge the $SU(N)$ symmetry.  In this \ncase, the Goldstone bosons are absorbed into the longitudinal polarizations of the \nmassive gauge bosons, and no new light degrees of freedom remain in the theory.\nThe other is to introduce an additional, explicit breaking of the $SU(N)$ symmetry \nwhich leads to the generation of a small but non-zero mass for each would-be Goldstone \nboson.  Such explicit breaking will have a negligible effect on the mass\nspectrum of the ensemble constituents, provided that the associated symmetry-breaking \nterms are small compared to $V_0$.\n\n\n\n\n\n\n\\section{Randomness in the Dark Sector:  The Emergent Mass Spectrum\\label{sec:RandomMatrixGeneration}}\n\n\n\nWe have seen in the previous section that the mass spectrum of the fields $\\phi_i$\nin our toy model is sensitive to the effectively random assignment of $v_a$ values\nalong the vacuum manifold via Eq.~(\\ref{eq:neweq}).  \nSince these particles\nare to play the role of the ensemble constituents, it is critical to understand\nhow this assignment affects the spectrum of $m_i$ and whether a randomly chosen set\nof $v_a$ values consistent with Eq.~(\\ref{eq:VacuumManifoldCondit}) can potentially\ngive rise to an emergent, universal behavior for the corresponding spectrum.\n\nIn practice, this randomness can be incorporated into our toy model as follows.\nWe begin by choosing a set of $N^2-1$ numbers $x_a$ at random from a\nGaussian distribution centered around zero with unit variance.  We then obtain a\nset of VEVs $v_a$ for the components of our adjoint field $\\eta$ by rescaling these\nnumbers by a universal constant, chosen such that the vacuum-manifold constraint\nin Eq.~(\\ref{eq:VacuumManifoldCondit}) is satisfied:\n\n", "itemtype": "equation", "pos": 18395, "prevtext": "\nis the VEV of the matrix in Eq.~(\\ref{eq:etaDef}).  This contribution\nlifts the mass degeneracy among the $\\phi_i$ and results\nin a non-trivial spectrum of masses $m_i$ for the corresponding physical\nparticles --- a mass spectrum which is sensitive to the particular assignment of\n$v_a$ values.  \nIt is therefore in this way that the randomness of the dark sector affects\nthe masses of the components of the dark-matter ensemble. \nIndeed, the resulting squared masses $m^2$ of the ensemble constituents\nare simply the eigenvalues of the mass matrix in Eq.~(\\ref{eq:MassMatrix}), {{\\it i.e.}\\/},\n\n", "index": 7, "text": "\\begin{equation}\n  m^2 ~=~ M^2 + \\xi_1 \\lambda^2~,\n\\label{eq:neweq}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"m^{2}~{}=~{}M^{2}+\\xi_{1}\\lambda^{2}~{},\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msup><mi>m</mi><mn>2</mn></msup></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><msup><mi>M</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mi>ξ</mi><mn>1</mn></msub><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mi>λ</mi><mn>2</mn></msup></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nFrom this set of VEVs, we construct the matrix $\\langle{\\eta}\\rangle$\naccording to Eq.~(\\ref{eq:etaAbsDef}).  This matrix is required by $SU(N)$\ninvariance to be traceless and Hermitian and required by construction\nto satisfy Eq.~(\\ref{eq:VacuumManifoldCondit}), but is otherwise a generic\ncomplex $N\\times N$ matrix.  Our aim, then, is to study the statistical\nproperties of an ensemble of such matrices, and in particular the distribution\nof their eigenvalues $\\lambda_i$.\n\nA substantial literature exists concerning the statistical properties of\nensembles of randomly generated matrices.  Indeed, this is the central\nsubject of random-matrix theory (for reviews, see, {{\\it e.g.}\\/}, Ref.~\\cite{Mehta}).\nWe emphasize that the structure of the $\\langle{\\eta}\\rangle$ matrix in our\ntoy model differs from the canonical matrix structures commonly studied in\nthe random-matrix literature.  Nevertheless, for purposes of comparison,\nit is useful for us to begin our analysis of the properties\nour ensemble of $\\langle{\\eta}\\rangle$ matrices with a brief review\nof the properties of similar matrix ensembles whose properties are\nwell documented.\n\nWe begin by reviewing the properties of the case of a Gaussian Unitary Ensemble\n(GUE) --- a statistical ensemble consisting of $N\\times N$ Hermitian matrices $X$.\nThe off-diagonal elements $X_{ij}$ with $i<j$ of this matrix are complex numbers drawn\nfrom a complex Gaussian distribution centered around zero with variance $v^2/(2N^2)$\nfor some constant $v$.  Likewise, the diagonal elements $X_{ii}$ (no sum implied)\nare real numbers drawn from a standard Gaussian distribution with the same mean\nand variance.  The joint probability distribution function (PDF) \nfor obtaining a particular set of eigenvalues $\\lambda_i$ \nfrom the GUE is\n\n", "itemtype": "equation", "pos": 23255, "prevtext": "\nwhere $\\lambda$ are the eigenvalues of the matrix $\\langle {\\eta} \\rangle$.\n\n\n\n\nWe conclude this section with several important comments.\nFirst, we note that while the mass spectrum of the $\\phi_i$ is in large part\ndetermined by the random values assigned to the $v_a$, certain properties of the\nmass-squared matrix for our ensemble constituents are nevertheless ensured by the\nsymmetry structure of the theory.  For example, the $\\IZ_2^\\eta$ symmetry ensures that\nthe eigenvalues $m_i^2$ of $\\mathcal{M}^2$ be positive-definite by forbidding operators\nsuch as $\\mathcal{O}_{{\\not{\\IZ}_2^\\eta}} \\sim \\phi^\\dagger \\eta \\phi$ from appearing in\nthe scalar potential in Eq.~(\\ref{eq:V0}).  This, in turn, ensures that the $\\IZ_2^\\phi$\nsymmetry remain unbroken at the minimum of the potential.  Thus, in the absence of\nany additional source of $\\IZ_2^\\phi$-symmetry breaking, the lightest of the $\\phi_i$\nmass eigenstates is absolutely stable.\n\nIt is perhaps also worth emphasizing that no splitting between the masses of the\nreal and imaginary components of the complex scalars $\\phi_i$ results from the\nspontaneous breaking of the $SU(N)$ symmetry in this model.\nIndeed, even in the broken phase of the theory, the Lagrangian for our toy model\nremains invariant under independent phase rotations of each of the $\\phi_i$.\nThis is a reflection of the fact that\neven in the case in which all of the $v_a$ are non-zero, the $SU(N)$ symmetry\nis not broken completely.  Indeed, the breaking of a symmetry by the VEV of\nan adjoint field cannot reduce the rank of the group.  Rather, a residual\n$U(1)^{N-1}$ symmetry always remains;  this may be either global or local, depending on\nthe construction.  Moreover, it can be seen from Eq.~(\\ref{eq:V0}) that our theory\nis also invariant under an ``accidental'' global $U(1)$ symmetry which corresponds\nto an overall phase rotation of the multiplet $\\phi$.  This overall $U(1)^{N}$\nsymmetry corresponds to the invariance of the Lagrangian under phase rotations of\nthe $N$ different fields $\\phi_i$.\n\nFinally, we remark that \nwe have yet to specify whether the $SU(N)$ symmetry is local or\nglobal.  Indeed, this choice does not have any effect on the mass spectrum of\nthe dark-sector ensemble --- at least at tree level.  However, this choice does have other\nimportant phenomenological consequences.  In the case in which this \nsymmetry is global, for example, a massless Goldstone boson will appear in the spectrum \nof the low-energy theory for each spontaneously-broken symmetry generator.\nThe presence of such a large number of Goldstone bosons is difficult to reconcile with \nobservational data.  These particles can violate bounds on the number of \nlight, thermalized degrees of freedom derived from Cosmic Microwave Background (CMB)\ndata~\\cite{Ade:2015xua}.  They may also potentially mediate long-range interactions \nbetween dark-matter particles which conflict with bounds from observations of large- \nand small-scale structure (see, {{\\it e.g.}\\/}, Ref.~\\cite{Ackerman:mha}).  There are two ways\nof evading these constraints.  One is to gauge the $SU(N)$ symmetry.  In this \ncase, the Goldstone bosons are absorbed into the longitudinal polarizations of the \nmassive gauge bosons, and no new light degrees of freedom remain in the theory.\nThe other is to introduce an additional, explicit breaking of the $SU(N)$ symmetry \nwhich leads to the generation of a small but non-zero mass for each would-be Goldstone \nboson.  Such explicit breaking will have a negligible effect on the mass\nspectrum of the ensemble constituents, provided that the associated symmetry-breaking \nterms are small compared to $V_0$.\n\n\n\n\n\n\n\\section{Randomness in the Dark Sector:  The Emergent Mass Spectrum\\label{sec:RandomMatrixGeneration}}\n\n\n\nWe have seen in the previous section that the mass spectrum of the fields $\\phi_i$\nin our toy model is sensitive to the effectively random assignment of $v_a$ values\nalong the vacuum manifold via Eq.~(\\ref{eq:neweq}).  \nSince these particles\nare to play the role of the ensemble constituents, it is critical to understand\nhow this assignment affects the spectrum of $m_i$ and whether a randomly chosen set\nof $v_a$ values consistent with Eq.~(\\ref{eq:VacuumManifoldCondit}) can potentially\ngive rise to an emergent, universal behavior for the corresponding spectrum.\n\nIn practice, this randomness can be incorporated into our toy model as follows.\nWe begin by choosing a set of $N^2-1$ numbers $x_a$ at random from a\nGaussian distribution centered around zero with unit variance.  We then obtain a\nset of VEVs $v_a$ for the components of our adjoint field $\\eta$ by rescaling these\nnumbers by a universal constant, chosen such that the vacuum-manifold constraint\nin Eq.~(\\ref{eq:VacuumManifoldCondit}) is satisfied:\n\n", "index": 9, "text": "\\begin{equation}\n  v_a ~=~ v \\left(\\sum_{b=1}^{N^2-1} x_b^2\\right)^{-1/2} x_a~.\n\\label{eqhow}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"v_{a}~{}=~{}v\\left(\\sum_{b=1}^{N^{2}-1}x_{b}^{2}\\right)^{-1/2}x_{a}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi>v</mi><mi>a</mi></msub></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><mi>v</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>b</mi><mo>=</mo><mn>1</mn></mrow><mrow><msup><mi>N</mi><mn>2</mn></msup><mo>-</mo><mn>1</mn></mrow></munderover><msubsup><mi>x</mi><mi>b</mi><mn>2</mn></msubsup></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>x</mi><mi>a</mi></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nwhere $Z_N^{(\\mathrm{GUE})}$ is a normalization constant.  Note that this joint\nPDF vanishes whenever two or more of the $\\lambda_i$ are equal, a phenomenon called \neigenvalue repulsion.  The corresponding eigenvalue density --- {{\\it i.e.}\\/}, the PDF for a\n{\\it particular}\\/ eigenvalue $\\lambda$ within this matrix ensemble --- is\nobtained by integrating the joint PDF in Eq.~(\\ref{eq:JointPDFGUE}) over the\nremaining $\\lambda_i$.  The result is\n\\begin{eqnarray}\n  P_{\\mathrm{GUE}}(\\lambda) & = &\n    \\frac{e^{-\\frac{N^2}{v^2}\\lambda^2}}\n      {\\sqrt{\\pi}\\,v}\\sum_{k=0}^{N-1}\n    \\frac{H_k^2\\big(\\frac{N\\lambda}{v}\\big)}{2^k k!}~,\n  \\label{eq:OneEigPDFGUE}\n\\end{eqnarray}\nwhere $H_k(x)$ denotes the Hermite polynomial of degree $k$.\n\nWhile our ensemble of $\\langle{\\eta}\\rangle$ is closely related to the GUE,\nit is even more closely related to a class of matrix ensembles known as\nfixed-trace ensembles (FTE).  In particular,\nthis class of ensembles includes ensembles of complex, Hermitian matrices $X$\nwhich are generated in the same manner as those of the GUE, but subject to\nthe additional constraint $\\mathrm{Tr}[X^\\dagger X] = v^2/2$ for some constant $v$.\nThe joint PDF for the eigenvalues of such an \nFTE is~\\cite{LloydPagels,ZyczkowskiSommers}\n\\begin{eqnarray}\n  P_{\\mathrm{FTE}}(\\lambda_1,...,\\lambda_N) & = &\n    \\frac{1}{Z_N^{(\\mathrm{FTE})}}\n    \\delta\\left(\\frac{v^2}{2}- \\sum_{\\ell=1}^N \\lambda_\\ell^2\\right) ~~~~~~~~~~~\n    \\nonumber \\\\ & & \\times \n    \\prod_{i < j} |\\lambda_j - \\lambda_i|^2~,\n  \\label{eq:JointPDFFTE}\n\\end{eqnarray}\nwhere $\\delta(x)$ denotes the Dirac $\\delta$-function  and where\n$Z_N^{(\\mathrm{FTE})}$ is a normalization constant, which is in general\ndifferent from $Z_N^{(\\mathrm{GUE})}$.  \nNote that this PDF vanishes if $|\\lambda_i| > v / \\sqrt{2}$ for any $\\lambda_i$,\nas the $\\delta$-function constraint can no longer be satisfied\nin such cases.\nAs with the GUE, an\nanalytic expression for the eigenvalue density within the FTE can be\nobtained by integrating this joint PDF over the remaining $\\lambda_i$.\nIn particular, \nfor $\\lambda$ within the range $|\\lambda| < v / \\sqrt{2}$,\nwe find~\\cite{Akemann,Delannay}\n\\begin{eqnarray}\n  P_{\\mathrm{FTE}}(\\lambda) & = &\n    \\frac{\\sqrt{2}\\Gamma\\big({\\textstyle\\frac{N^2}{2}}\\big)}\n      {N v\\pi\\Gamma\\left(\\frac{N^2 - 1}{2}\\right)}\n    \\sum_{j=0}^{N-1}\\frac{(-2)^j\\Gamma\\left(j + {\\textstyle\\frac{1}{2}}\\right)}{j!}\n    \\left(\\!\\!\\begin{array}{c} N \\\\ j + 1\\end{array}\\!\\!\\right)\n    \\nonumber \\\\ & &\n      \\times \\,\n      \\rule[0pt]{0pt}{11pt}_2F_1\\!\\left(j + {\\textstyle\\frac{1}{2}},\n      {\\textstyle\\frac{3 - N^2}{2}};\n      {\\textstyle\\frac{1}{2}};\n      {\\textstyle\\frac{2\\lambda^2}{v^2}}\\right)~,\n   \\label{eq:OneEigPDFFTE}\n\\end{eqnarray}\nwhere $\\Gamma(x)$ is\nthe Euler gamma function and where $_2F_1\\left(a, b; c; x\\right)$ is\nthe ordinary hypergeometric function.\nBy contrast, $P_{\\mathrm{FTE}}(\\lambda) = 0$ \nfor all $|\\lambda| > v / \\sqrt{2}$.\n\nHad we chosen the symmetry group in our toy model to be $U(N)$ rather than\n$SU(N)$, our $\\langle{\\eta}\\rangle$ matrices would be the members\nof precisely this fixed-trace ensemble.  By contrast, for the $SU(N)$ case,\nnot only does Eq.~(\\ref{eq:VacuumManifoldCondit}) impose a constraint\n\n", "itemtype": "equation", "pos": 25146, "prevtext": "\nFrom this set of VEVs, we construct the matrix $\\langle{\\eta}\\rangle$\naccording to Eq.~(\\ref{eq:etaAbsDef}).  This matrix is required by $SU(N)$\ninvariance to be traceless and Hermitian and required by construction\nto satisfy Eq.~(\\ref{eq:VacuumManifoldCondit}), but is otherwise a generic\ncomplex $N\\times N$ matrix.  Our aim, then, is to study the statistical\nproperties of an ensemble of such matrices, and in particular the distribution\nof their eigenvalues $\\lambda_i$.\n\nA substantial literature exists concerning the statistical properties of\nensembles of randomly generated matrices.  Indeed, this is the central\nsubject of random-matrix theory (for reviews, see, {{\\it e.g.}\\/}, Ref.~\\cite{Mehta}).\nWe emphasize that the structure of the $\\langle{\\eta}\\rangle$ matrix in our\ntoy model differs from the canonical matrix structures commonly studied in\nthe random-matrix literature.  Nevertheless, for purposes of comparison,\nit is useful for us to begin our analysis of the properties\nour ensemble of $\\langle{\\eta}\\rangle$ matrices with a brief review\nof the properties of similar matrix ensembles whose properties are\nwell documented.\n\nWe begin by reviewing the properties of the case of a Gaussian Unitary Ensemble\n(GUE) --- a statistical ensemble consisting of $N\\times N$ Hermitian matrices $X$.\nThe off-diagonal elements $X_{ij}$ with $i<j$ of this matrix are complex numbers drawn\nfrom a complex Gaussian distribution centered around zero with variance $v^2/(2N^2)$\nfor some constant $v$.  Likewise, the diagonal elements $X_{ii}$ (no sum implied)\nare real numbers drawn from a standard Gaussian distribution with the same mean\nand variance.  The joint probability distribution function (PDF) \nfor obtaining a particular set of eigenvalues $\\lambda_i$ \nfrom the GUE is\n\n", "index": 11, "text": "\\begin{equation}\n  P_{\\mathrm{GUE}}(\\lambda_1,...,\\lambda_N) ~ = ~\n    \\frac{1}{Z_N^{(\\mathrm{GUE})}}\\prod_{k=1}^N e^{-\\frac{N^2}{v^2}\\lambda_k^2}\n    \\prod_{i < j} |\\lambda_j - \\lambda_i|^2~,\n  \\label{eq:JointPDFGUE}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"P_{\\mathrm{GUE}}(\\lambda_{1},...,\\lambda_{N})~{}=~{}\\frac{1}{Z_{N}^{(\\mathrm{%&#10;GUE})}}\\prod_{k=1}^{N}e^{-\\frac{N^{2}}{v^{2}}\\lambda_{k}^{2}}\\prod_{i&lt;j}|%&#10;\\lambda_{j}-\\lambda_{i}|^{2}~{},\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mi>GUE</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>λ</mi><mn>1</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>λ</mi><mi>N</mi></msub><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mfrac><mn>1</mn><msubsup><mi>Z</mi><mi>N</mi><mrow><mo stretchy=\"false\">(</mo><mi>GUE</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mfrac><msup><mi>N</mi><mn>2</mn></msup><msup><mi>v</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><msubsup><mi>λ</mi><mi>k</mi><mn>2</mn></msubsup></mrow></mrow></msup><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>&lt;</mo><mi>j</mi></mrow></munder><mpadded width=\"+3.3pt\"><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>λ</mi><mi>j</mi></msub><mo>-</mo><msub><mi>λ</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\non the squares of the eigenvalues $\\lambda_i$, but the tracelessness condition\non the $SU(N)$ generators $T_a$ imposes an additional constraint\n\n", "itemtype": "equation", "pos": 28613, "prevtext": "\nwhere $Z_N^{(\\mathrm{GUE})}$ is a normalization constant.  Note that this joint\nPDF vanishes whenever two or more of the $\\lambda_i$ are equal, a phenomenon called \neigenvalue repulsion.  The corresponding eigenvalue density --- {{\\it i.e.}\\/}, the PDF for a\n{\\it particular}\\/ eigenvalue $\\lambda$ within this matrix ensemble --- is\nobtained by integrating the joint PDF in Eq.~(\\ref{eq:JointPDFGUE}) over the\nremaining $\\lambda_i$.  The result is\n\\begin{eqnarray}\n  P_{\\mathrm{GUE}}(\\lambda) & = &\n    \\frac{e^{-\\frac{N^2}{v^2}\\lambda^2}}\n      {\\sqrt{\\pi}\\,v}\\sum_{k=0}^{N-1}\n    \\frac{H_k^2\\big(\\frac{N\\lambda}{v}\\big)}{2^k k!}~,\n  \\label{eq:OneEigPDFGUE}\n\\end{eqnarray}\nwhere $H_k(x)$ denotes the Hermite polynomial of degree $k$.\n\nWhile our ensemble of $\\langle{\\eta}\\rangle$ is closely related to the GUE,\nit is even more closely related to a class of matrix ensembles known as\nfixed-trace ensembles (FTE).  In particular,\nthis class of ensembles includes ensembles of complex, Hermitian matrices $X$\nwhich are generated in the same manner as those of the GUE, but subject to\nthe additional constraint $\\mathrm{Tr}[X^\\dagger X] = v^2/2$ for some constant $v$.\nThe joint PDF for the eigenvalues of such an \nFTE is~\\cite{LloydPagels,ZyczkowskiSommers}\n\\begin{eqnarray}\n  P_{\\mathrm{FTE}}(\\lambda_1,...,\\lambda_N) & = &\n    \\frac{1}{Z_N^{(\\mathrm{FTE})}}\n    \\delta\\left(\\frac{v^2}{2}- \\sum_{\\ell=1}^N \\lambda_\\ell^2\\right) ~~~~~~~~~~~\n    \\nonumber \\\\ & & \\times \n    \\prod_{i < j} |\\lambda_j - \\lambda_i|^2~,\n  \\label{eq:JointPDFFTE}\n\\end{eqnarray}\nwhere $\\delta(x)$ denotes the Dirac $\\delta$-function  and where\n$Z_N^{(\\mathrm{FTE})}$ is a normalization constant, which is in general\ndifferent from $Z_N^{(\\mathrm{GUE})}$.  \nNote that this PDF vanishes if $|\\lambda_i| > v / \\sqrt{2}$ for any $\\lambda_i$,\nas the $\\delta$-function constraint can no longer be satisfied\nin such cases.\nAs with the GUE, an\nanalytic expression for the eigenvalue density within the FTE can be\nobtained by integrating this joint PDF over the remaining $\\lambda_i$.\nIn particular, \nfor $\\lambda$ within the range $|\\lambda| < v / \\sqrt{2}$,\nwe find~\\cite{Akemann,Delannay}\n\\begin{eqnarray}\n  P_{\\mathrm{FTE}}(\\lambda) & = &\n    \\frac{\\sqrt{2}\\Gamma\\big({\\textstyle\\frac{N^2}{2}}\\big)}\n      {N v\\pi\\Gamma\\left(\\frac{N^2 - 1}{2}\\right)}\n    \\sum_{j=0}^{N-1}\\frac{(-2)^j\\Gamma\\left(j + {\\textstyle\\frac{1}{2}}\\right)}{j!}\n    \\left(\\!\\!\\begin{array}{c} N \\\\ j + 1\\end{array}\\!\\!\\right)\n    \\nonumber \\\\ & &\n      \\times \\,\n      \\rule[0pt]{0pt}{11pt}_2F_1\\!\\left(j + {\\textstyle\\frac{1}{2}},\n      {\\textstyle\\frac{3 - N^2}{2}};\n      {\\textstyle\\frac{1}{2}};\n      {\\textstyle\\frac{2\\lambda^2}{v^2}}\\right)~,\n   \\label{eq:OneEigPDFFTE}\n\\end{eqnarray}\nwhere $\\Gamma(x)$ is\nthe Euler gamma function and where $_2F_1\\left(a, b; c; x\\right)$ is\nthe ordinary hypergeometric function.\nBy contrast, $P_{\\mathrm{FTE}}(\\lambda) = 0$ \nfor all $|\\lambda| > v / \\sqrt{2}$.\n\nHad we chosen the symmetry group in our toy model to be $U(N)$ rather than\n$SU(N)$, our $\\langle{\\eta}\\rangle$ matrices would be the members\nof precisely this fixed-trace ensemble.  By contrast, for the $SU(N)$ case,\nnot only does Eq.~(\\ref{eq:VacuumManifoldCondit}) impose a constraint\n\n", "index": 13, "text": "\\begin{equation}\n  \\mathrm{Tr}\\big[\\langle{\\eta}\\rangle\\langle{\\eta}\\rangle\\big] ~=~\n  \\sum_{i=1}^N \\lambda_i^2 ~=~ \\frac{v^2}{2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{Tr}\\big{[}\\langle{\\eta}\\rangle\\langle{\\eta}\\rangle\\big{]}~{}=~{}\\sum_{%&#10;i=1}^{N}\\lambda_{i}^{2}~{}=~{}\\frac{v^{2}}{2}\" display=\"block\"><mrow><mrow><mi>Tr</mi><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><mrow><mo stretchy=\"false\">⟨</mo><mi>η</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>η</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\" rspace=\"5.8pt\">]</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mpadded width=\"+3.3pt\"><msubsup><mi>λ</mi><mi>i</mi><mn>2</mn></msubsup></mpadded></mrow><mo rspace=\"5.8pt\">=</mo><mfrac><msup><mi>v</mi><mn>2</mn></msup><mn>2</mn></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\non the eigenvalues themselves.  Thus, the joint PDF for our ensemble of\n$\\langle{\\eta}\\rangle$ matrices takes the form\n\\begin{eqnarray}\n  P_{\\rm SU(N)}(\\lambda_1,...,\\lambda_N) & = &\n    \\frac{1}{Z_N^{(\\eta)}}\n    \\delta\\bigg(\\sum_{p=1}^N \\lambda_p\\bigg) \n    \\delta\\bigg(\\frac{v^2}{2}- \\sum_{\\ell=1}^N \\lambda_\\ell^2\\bigg) \\nonumber\\\\\n    & & \\times\\, \n    \\prod_{i < j} |\\lambda_j - \\lambda_i|^2~.\n  \\label{eq:JointPDFEta}\n\\end{eqnarray}\n\nTo the best of our knowledge, no analytic expression for the corresponding \neigenvalue density $P_{\\rm SU(N)}(\\lambda)$ for arbitrary $N$ currently exists \nin the literature.  However, as we shall see, the eigenvalue densities which \nwe obtain numerically for matrices drawn from this ensemble bear many similarities \nto $P_{\\mathrm{GUE}}(\\lambda)$ and $P_{\\mathrm{FTE}}(\\lambda)$ for the same value \nof $N$.  Perhaps the most important of these similarities\nis that $P_{\\mathrm{GUE}}(\\lambda)$, $P_{\\mathrm{FTE}}(\\lambda)$, and\n$P_{\\rm SU(N)}(\\lambda)$ all begin to coincide for $N\\gg 1$.\nIn particular, for $N\\gg 1$,\nall three of these eigenvalue-density functions converge\nto the Wigner semicircle distribution~\\cite{Wigner}\n\n", "itemtype": "equation", "pos": 28902, "prevtext": "\non the squares of the eigenvalues $\\lambda_i$, but the tracelessness condition\non the $SU(N)$ generators $T_a$ imposes an additional constraint\n\n", "index": 15, "text": "\\begin{equation}\n  \\mathrm{Tr}\\big[\\langle{\\eta}\\rangle\\big] ~=~ \\sum_{i=1}^N \\lambda_i ~=~ 0~\n  \\label{eq:TracelessnessConstraint}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{Tr}\\big{[}\\langle{\\eta}\\rangle\\big{]}~{}=~{}\\sum_{i=1}^{N}\\lambda_{i}~%&#10;{}=~{}0~{}\" display=\"block\"><mrow><mrow><mi>Tr</mi><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>η</mi><mo stretchy=\"false\">⟩</mo></mrow><mo maxsize=\"120%\" minsize=\"120%\" rspace=\"5.8pt\">]</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mpadded width=\"+3.3pt\"><msub><mi>λ</mi><mi>i</mi></msub></mpadded></mrow><mo rspace=\"5.8pt\">=</mo><mpadded width=\"+3.3pt\"><mn>0</mn></mpadded></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\n\n\nGiven the relationship in Eq.~(\\ref{eq:neweq}) between the eigenvalues $\\lambda$\nand the corresponding ensemble masses $m$,\nit is relatively straightforward to \nconvert the eigenvalue-density function $P(\\lambda)$ associated with any\nmatrix ensemble into a corresponding density-of-states function $n(m)$ \nfor the mass-eigenstate fields $\\phi_i$.\nIn general, the density-of-states function $n(m)$ with respect to the ensemble-constituent\nmass $m$ is simply the product of the number of states  in the ensemble\n and the PDF for that value of $m$ within the ensemble:\n\n", "itemtype": "equation", "pos": 30218, "prevtext": "\non the eigenvalues themselves.  Thus, the joint PDF for our ensemble of\n$\\langle{\\eta}\\rangle$ matrices takes the form\n\\begin{eqnarray}\n  P_{\\rm SU(N)}(\\lambda_1,...,\\lambda_N) & = &\n    \\frac{1}{Z_N^{(\\eta)}}\n    \\delta\\bigg(\\sum_{p=1}^N \\lambda_p\\bigg) \n    \\delta\\bigg(\\frac{v^2}{2}- \\sum_{\\ell=1}^N \\lambda_\\ell^2\\bigg) \\nonumber\\\\\n    & & \\times\\, \n    \\prod_{i < j} |\\lambda_j - \\lambda_i|^2~.\n  \\label{eq:JointPDFEta}\n\\end{eqnarray}\n\nTo the best of our knowledge, no analytic expression for the corresponding \neigenvalue density $P_{\\rm SU(N)}(\\lambda)$ for arbitrary $N$ currently exists \nin the literature.  However, as we shall see, the eigenvalue densities which \nwe obtain numerically for matrices drawn from this ensemble bear many similarities \nto $P_{\\mathrm{GUE}}(\\lambda)$ and $P_{\\mathrm{FTE}}(\\lambda)$ for the same value \nof $N$.  Perhaps the most important of these similarities\nis that $P_{\\mathrm{GUE}}(\\lambda)$, $P_{\\mathrm{FTE}}(\\lambda)$, and\n$P_{\\rm SU(N)}(\\lambda)$ all begin to coincide for $N\\gg 1$.\nIn particular, for $N\\gg 1$,\nall three of these eigenvalue-density functions converge\nto the Wigner semicircle distribution~\\cite{Wigner}\n\n", "index": 17, "text": "\\begin{equation}\n  P_{\\mathrm{WS}}(\\lambda) ~ = ~\n \\begin{cases}\n   \\displaystyle{\\frac{\\sqrt{2N}}{\\pi v}\\sqrt{1-\\frac{N\\lambda^2}{2v^2}}}\n   &     {\\rm for} ~|\\lambda| < v \\sqrt{2/N} \\\\\n    0 & {\\rm otherwise}~.\n\\end{cases}\n\\label{eq:OneEigPDFWigner}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"P_{\\mathrm{WS}}(\\lambda)~{}=~{}\\begin{cases}\\displaystyle{\\frac{\\sqrt{2N}}{\\pi&#10;v%&#10;}\\sqrt{1-\\frac{N\\lambda^{2}}{2v^{2}}}}&amp;{\\rm for}~{}|\\lambda|&lt;v\\sqrt{2/N}\\\\&#10;0&amp;{\\rm otherwise}~{}.\\end{cases}\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mi>WS</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mfrac><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi></mrow></msqrt><mrow><mi>π</mi><mo>⁢</mo><mi>v</mi></mrow></mfrac><mo>⁢</mo><msqrt><mrow><mn>1</mn><mo>-</mo><mfrac><mrow><mi>N</mi><mo>⁢</mo><msup><mi>λ</mi><mn>2</mn></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>v</mi><mn>2</mn></msup></mrow></mfrac></mrow></msqrt></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mpadded width=\"+3.3pt\"><mi>for</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>λ</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>&lt;</mo><mrow><mi>v</mi><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>/</mo><mi>N</mi></mrow></msqrt></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"left\"><mrow><mpadded width=\"+3.3pt\"><mi>otherwise</mi></mpadded><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nThe PDF $P(m)$ can be\nobtained directly from the corresponding eigenvalue density $P(\\lambda)$ via a\nchange of variables.  It is more convenient, however, for us to express the\ndensity of states of ensemble constituents as a function of the dimensionless\nmass variable $\\tilde{m} \\equiv \\sqrt{2} m /(\\sqrt{\\xi_1}v)$ rather than the mass\n$m$ itself.  We also define the similarly rescaled mass parameter\n$\\tilde{M} \\equiv \\sqrt{2} M/(\\sqrt{\\xi_1}v)$.\nThe density-of-states function $n (\\tilde{m})$ with respect to $\\tilde{m}$ is\nthen given by\n\n", "itemtype": "equation", "pos": 31053, "prevtext": "\n\n\nGiven the relationship in Eq.~(\\ref{eq:neweq}) between the eigenvalues $\\lambda$\nand the corresponding ensemble masses $m$,\nit is relatively straightforward to \nconvert the eigenvalue-density function $P(\\lambda)$ associated with any\nmatrix ensemble into a corresponding density-of-states function $n(m)$ \nfor the mass-eigenstate fields $\\phi_i$.\nIn general, the density-of-states function $n(m)$ with respect to the ensemble-constituent\nmass $m$ is simply the product of the number of states  in the ensemble\n and the PDF for that value of $m$ within the ensemble:\n\n", "index": 19, "text": "\\begin{equation}\n           n(m) ~\\equiv~ N \\,P(m)~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"n(m)~{}\\equiv~{}N\\,P(m)~{}.\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">≡</mo><mrow><mpadded width=\"+1.7pt\"><mi>N</mi></mpadded><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nwhere the factor of two in this expression arises due to the fact that\n$\\lambda^2$ is positive-definite.  The corresponding density-of-states\nfunction $n (m)$ with respect to the constituent mass $m$ rather than\nthe dimensionless variable $\\tilde{m}$ is then given by\n\n", "itemtype": "equation", "pos": 31663, "prevtext": "\nThe PDF $P(m)$ can be\nobtained directly from the corresponding eigenvalue density $P(\\lambda)$ via a\nchange of variables.  It is more convenient, however, for us to express the\ndensity of states of ensemble constituents as a function of the dimensionless\nmass variable $\\tilde{m} \\equiv \\sqrt{2} m /(\\sqrt{\\xi_1}v)$ rather than the mass\n$m$ itself.  We also define the similarly rescaled mass parameter\n$\\tilde{M} \\equiv \\sqrt{2} M/(\\sqrt{\\xi_1}v)$.\nThe density-of-states function $n (\\tilde{m})$ with respect to $\\tilde{m}$ is\nthen given by\n\n", "index": 21, "text": "\\begin{equation}\n  n (\\tilde{m}) ~ = ~ 2 N P (\\lambda)\\frac{d\\lambda}{d\\tilde{m}}\n    ~=~ \\frac{\\sqrt{2} v N \\tilde{m}}{\\sqrt{\\tilde{m}^2 - \\tilde{M}^2}}\n    P (\\lambda)~,\n  \\label{eq:DOSFunctionEta}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"n(\\tilde{m})~{}=~{}2NP(\\lambda)\\frac{d\\lambda}{d\\tilde{m}}~{}=~{}\\frac{\\sqrt{2%&#10;}vN\\tilde{m}}{\\sqrt{\\tilde{m}^{2}-\\tilde{M}^{2}}}P(\\lambda)~{},\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+3.3pt\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>λ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover></mrow></mfrac></mpadded></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mfrac><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><mi>v</mi><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover></mrow><msqrt><mrow><msup><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover><mn>2</mn></msup><mo>-</mo><msup><mover accent=\"true\"><mi>M</mi><mo stretchy=\"false\">~</mo></mover><mn>2</mn></msup></mrow></msqrt></mfrac><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\n\nWithout an analytic expression for $P_{\\rm SU(N)}(\\lambda)$, we cannot write down\na closed-form expression for $n_{\\rm SU(N)}(\\tilde{m})$ for arbitrary $N$.\nNevertheless, for $N\\gg 1$ (where the Wigner semicircle approximation holds),\nwe can obtain an analytic approximation for $n_{\\rm SU(N)}(\\tilde{m})$ by taking \n$P_{\\rm SU(N)}(\\lambda)\\approx P_{\\mathrm{WS}}(\\lambda)$ in Eq.~(\\ref{eq:DOSFunctionEta}).\nMoreover, we can gain insight into the behavior of $n_{\\rm SU(N)}(\\tilde{m})$ for smaller\nvalues of $N$ by examining the properties of the density-of-states functions \n$n_{\\mathrm{GUE}}(\\tilde{m})$ and $n_{\\mathrm{FTE}}(\\tilde{m})$ which one would obtain \nfor a GUE and FTE, respectively.  Indeed, exact analytic expressions for these functions \ncan be obtained for arbitrary $N$ by substituting the eigenvalue densities in\nEqs.~(\\ref{eq:OneEigPDFGUE}) and~(\\ref{eq:OneEigPDFFTE}) into \nEq.~(\\ref{eq:DOSFunctionEta}).  These analytic expressions, as well as the \nWigner semicircle expression to which $n_{\\mathrm{GUE}}(\\tilde{m})$, \n$n_{\\mathrm{FTE}}(\\tilde{m})$, and $n_{\\rm SU(N)}(\\tilde{m})$ all tend for $N\\gg 1$,\nare given below:\n\\begin{widetext}\n\\begin{eqnarray}\n  n_{\\mathrm{GUE}}(\\tilde{m}) &=&\n    \\begin{cases}\n      \\displaystyle \\frac{\\sqrt{2}\\tilde{m}Ne^{-\\frac{1}{2} N^2(\\tilde{m}^2-\\tilde{M}^2)}}\n         {\\sqrt{\\pi(\\tilde{m}^2-\\tilde{M}^2)}} \n         \\sum_{k=0}^{N-1}\n         \\frac{H_k^2\\left(N\\sqrt{\\frac{\\tilde{m}^2-\\tilde{M}^2}{2}}\\right)}{2^k k!} ~~~~&\n         \\tilde{M} \\leq  \\tilde{m} ~~~~\n                      \\\\\n      0 & \\mbox{otherwise}~\n    \\end{cases} \\nonumber \\\\\n n_{\\mathrm{FTE}}(\\tilde{m}) &=&\n   \\begin{cases}\n   \\displaystyle\n   \\frac{2\\tilde{m}\\Gamma\\big({\\textstyle\\frac{N^2}{2}}\\big)}\n     {\\pi\\sqrt{\\tilde{m}^2-\\tilde{M}^2}}\n   \\sum_{j=0}^{N-1}\\frac{(-2)^j\\Gamma\\left(j + {\\textstyle\\frac{1}{2}}\\right)}\n     {j!\\Gamma\\left(\\frac{N^2 - 1}{2}\\right)}\n     \\left(\\!\\!\\begin{array}{c} N \\\\ j + 1\\end{array}\\!\\!\\right)\n     \\rule[0pt]{0pt}{11pt}_2F_1\\!\\left(j + {\\textstyle\\frac{1}{2}},\n     {\\textstyle\\frac{3 - N^2}{2}};\n     {\\textstyle\\frac{1}{2}};\n     {\\textstyle \\tilde{m}^2 - \\tilde{M}^2}\\right)~~~~\n     & \\tilde{M} \\leq  \\tilde{m} < \\displaystyle \\sqrt{\\tilde{M}^2 + 1 } \\\\\n   0 & \\mbox{otherwise}~\n    \\end{cases} \\nonumber \\\\\n n_{\\mathrm{WS}}(\\tilde{m}) &=&\n  \\begin{cases}\n   \\displaystyle \\frac{2 N^{3/2}}{\\pi}\n     \\sqrt{\\frac{\\tilde{m}^2}{\\tilde{m}^2-\\tilde{M}^2}-\\frac{N\\tilde{m}^2}{4}}~~~~\n     & \\tilde{M} \\leq  \\tilde{m} < \\displaystyle \\sqrt{\\tilde{M}^2 + \\frac{4}{N}} \\\\\n   0 & \\mbox{otherwise}~.\n  \\end{cases}\n  \\label{eq:DensityOfStateswithm}\n\\end{eqnarray}\n\\end{widetext}\n\n\\begin{figure}[h]\n  \\includegraphics[width=0.4\\textwidth, keepaspectratio]{CP1000TGUE.pdf}\n  \\caption{The density-of-states function $n(m)$ for the ensemble\n    constituents $\\phi_i$ for $N=1000$.  What initially might appear as a single\n    brownish histogram actually represents the superposition of two nearly identical\n    histograms, one blue and one orange, each of which\n    represents a data set comprising the ensemble-constituent masses\n    obtained for a sample of $n_{\\mathrm{mat}} = 50$ randomly generated\n    $\\langle{\\eta}\\rangle$ matrices.  The blue histogram corresponds\n    to a model in which the symmetry group is $SU(N)$, while the orange histogram\n    corresponds to a model in which the symmetry group is $U(N)$.\n    Likewise, the red curve represents the expression for $n_{\\mathrm{WS}}(\\tilde{m})$ in\n    Eq.~(\\protect\\ref{eq:DensityOfStateswithm}).  As discussed in the text, \n      for such large values of $N$ \n    as assumed here both histograms indeed coincide \n       and are essentially indistinguishable from\n    $n_{\\mathrm{WS}}(\\tilde{m})$. \n  \\label{fig:DOSFunctionN1000}}\n\\end{figure}\n\n\\begin{figure*}[t]\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP5TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP10TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP20TGUE.pdf}\n  \\caption{The density-of-states function $n(m)$ for the ensemble\n    constituents $\\phi_i$ for $N=5$ (left panel), $N=10$ (center panel), and\n    $N=20$ (right panel).  In each panel, the blue and orange histograms\n    each represent a data set comprising the ensemble-constituent masses\n    obtained for a sample of $n_{\\mathrm{mat}}$ randomly generated\n    $\\langle{\\eta}\\rangle$ matrices, where $n_{\\mathrm{mat}}$ is chosen\n    in each case such that the total number of individual mass eigenvalues\n    in the data set is $5 \\times 10^4$.  As in Fig.~\\protect\\ref{fig:DOSFunctionN1000},\n    the blue histogram corresponds to a model in which the symmetry group is\n    $SU(N)$, while the orange histogram corresponds to a model in which the symmetry\n    group is $U(N)$.  The solid, dot-dashed, and dashed curves in\n    each panel correspond to the functions $n_{\\mathrm{GUE}}(\\tilde{m})$,\n    $n_{\\mathrm{FTE}}(\\tilde{m})$, and $n_{\\mathrm{WS}}(\\tilde{m})$ in\n    Eq.~(\\protect\\ref{eq:DensityOfStateswithm}), respectively.\n  \\label{fig:DOSFunctionSmallN}}\n\\end{figure*}\n\nWith these analytic expressions as a guide, we now numerically examine the \ndistributions of masses obtained for statistical ensembles based on an $SU(N)$ \nsymmetry group.  In particular, we perform a numerical analysis \nof these distributions according to the following procedure.\nFor a given value of $N$, we randomly generate a number $n_{\\mathrm{mat}}$\nof $\\langle{\\eta}\\rangle$ matrices\nfollowing the procedure described above Eq.~(\\ref{eqhow}),\nwhere $n_{\\mathrm{mat}}$ is chosen\nsuch that the total number of individual eigenvalues in the data set\nis fixed to a reference value which we take to be  $5 \\times 10^4$.  \nFor each of these matrices, we diagonalize the\ncorresponding mass-squared matrix for the ensemble constituents in order to \nobtain their masses $m_i$.  We then combine the $m_i$ values for\nall of the matrices in our sample into a single data set, a histogram of\nwhich provides a numerical approximation to the corresponding analytic \ndensity-of-states function $n_{\\rm SU(N)}(\\tilde{m})$.  For purposes of comparison,\nwe also derive a numerical approximation for $n_{\\mathrm{FTE}}(\\tilde{m})$ --- \nthe density-of-states function obtained for a $U(N)$ rather than an \n$SU(N)$ symmetry group --- using the same procedure.\n\nIn Fig.~\\ref{fig:DOSFunctionN1000}, we show the density-of-states function\n$n(\\tilde{m})$ for the ensemble constituents generated by diagonalizing\nrandomly generated mass matrices, for $N=1000$ and $\\tilde{M}=0$.\nThe blue histogram corresponds to the $SU(N)$ case, while\nthe orange histogram corresponds to the $U(N)$ case.\nIn each case, the results correspond to a data set\ncomprising the ensemble-constituent masses obtained for a sample of\n$n_{\\mathrm{mat}} = 50$ randomly generated matrices.\nBy contrast, the red curve in Fig.~\\ref{fig:DOSFunctionN1000}\nrepresents the analytical function\n$n_{\\mathrm{WS}}(\\tilde{m})$ in Eq.~(\\ref{eq:DensityOfStateswithm}).  \nAs evident from Fig.~\\ref{fig:DOSFunctionN1000}, the function \n$n_{\\mathrm{WS}}(\\tilde{m})$ provides an excellent approximation \nto the histogram data, as claimed.  Moreover, for such a large value of $N$, \nthe functions $n_{\\mathrm{GUE}}(\\tilde{m})$ and $n_{\\mathrm{FTE}}(\\tilde{m})$\nare essentially indistinguishable from $n_{\\mathrm{WS}}(\\tilde{m})$.\nThus all three functions do an excellent job of approximating the data for $N\\gg 1$.\n\nIt is also interesting to examine how the results are modified in the regime\nin which $N$ is small and the Wigner semicircle distribution provides a less\nreliable approximation for the true density of states for the ensemble.\nIn Fig.~\\ref{fig:DOSFunctionSmallN}, we show the corresponding results for\n$N = 5$ (left panel), $N = 10$ (center panel), and $N=20$ (right panel).\nIn each panel, the blue and orange histograms each represent a data set\ncomprising the ensemble-constituent masses obtained for a sample of\n$n_{\\mathrm{mat}}$ randomly generated $\\langle{\\eta}\\rangle$ matrices,\nwhere $n_{\\mathrm{mat}}$ is chosen in each case such that the total number\nof individual mass eigenvalues in the data set is $5 \\times 10^4$.\nAs in Fig.~\\protect\\ref{fig:DOSFunctionN1000}, the blue histogram corresponds\nto a model in which the symmetry group is $SU(N)$ while the orange histogram corresponds\nto a model in which the symmetry group is $U(N)$.\nThe solid, dot-dashed, and dashed curves in each panel\ncorrespond to $n_{\\mathrm{GUE}}(\\tilde{m})$, $n_{\\mathrm{FTE}}(\\tilde{m})$, and\n$n_{\\mathrm{WS}}(\\tilde{m})$, respectively.\n\nWe see from Fig.~\\ref{fig:DOSFunctionSmallN}\nthat $n_{\\mathrm{WS}}(\\tilde{m})$ aptly characterizes the overall\n``envelope'' of the true density of states for small $N$ in both the $U(N)$\nand $SU(N)$ cases, just as it does for large $N$.  However, for small $N$, the\ntrue density of states for these cases also exhibits\n {\\it oscillations}\\/ around this envelope --- oscillations which grow increasingly\npronounced with decreasing $N$.  For the case in which the symmetry group is\n$U(N)$, the histogram data are distributed according to the density-of-states\nfunction $n_{\\mathrm{FTE}}(\\tilde{m})$, as expected; \nthis function actually includes the oscillations, and the histogram differs \nfrom  $n_{\\mathrm{FTE}}(\\tilde{m})$ only because of random fluctuations.\nHowever, for the case in which the symmetry group is $SU(N)$, the amplitude of \nthe oscillations is significantly more pronounced, and we see that neither \n$n_{\\mathrm{FTE}}(\\tilde{m})$ nor $n_{\\mathrm{WS}}(\\tilde{m})$ are accurate \ndescriptions of the density of states for the case of an $SU(N)$ symmetry group at \nsmall $N$.   However, as $N$ grows larger (as illustrated in the right panel of Fig.~\\ref{fig:DOSFunctionSmallN}),\nthe oscillations fade away in relative magnitude for both the $U(N)$ and $SU(N)$ cases, and \nthe actual distributions qualitatively begin to approach \n$n_{\\mathrm{WS}}(\\tilde{m})$.\n\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.4\\textwidth, keepaspectratio]{CompMValsLargeNPlotN1000.pdf}\n  \\caption{The density-of-states function $n_{\\mathrm{WS}}(\\tilde{m})$ for\n    several different choices of the mass parameter $\\tilde{M}$.  In each case,\n    we have taken $N = 1000$ and $n_{\\rm mat}=50$.\n  \\label{fig:DOSFunctionMadMLargeN}}\n\\end{figure}\n\n\\begin{figure*}[t]\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP5M0pt025TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP10M0pt025TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP20M0pt025TGUE.pdf}\n  \\caption{Same as Fig.~\\protect\\ref{fig:DOSFunctionSmallN},\n  but with $\\tilde{M}=0.025$ rather than $\\tilde{M} = 0$.\n  \\label{fig:DOSFunctionMadMSmallN}}\n\\end{figure*}\n\n\nWe now turn to consider how the density of states for our ensemble depends\non $\\tilde{M}$.  In Fig.~\\ref{fig:DOSFunctionMadMLargeN}, we display curves of\nthe Wigner density-of-states function $n_{\\mathrm{WS}}(\\tilde{m})$ for different\nvalues of $\\tilde{M}$.  For each of these curves, we have taken\n$N=1000$ --- a suitably large value of $N$ for which this function provides an\nexcellent approximation to the exact density-of-states function $n(\\tilde{m})$, in\nthe case of either a $U(N)$ or $SU(N)$ symmetry group.\nWe see that for $\\tilde{M} \\neq 0$, the presence of the additional contribution\nto the mass matrix in Eq.~(\\ref{eq:MassMatrix}) distorts the density-of-states\nfunction away from the semicircle form which arises in the $\\tilde{M} = 0$ case.\nThis is simply a reflection of the fact that states $\\phi_i$ in the ensemble which\nreceive comparatively small contributions $\\xi_1\\lambda_i^2 \\lesssim M^2$ to their\nsquared masses from symmetry breaking will have masses $m_i \\approx M$.\n\nIn Fig.~\\ref{fig:DOSFunctionMadMSmallN}, we show the corresponding densities of states\n(similar to Fig.~\\ref{fig:DOSFunctionSmallN}) for smaller values of $N$ but non-zero \n$\\tilde M$.  These results exhibit the same qualitative behavior as in\nFig.~\\ref{fig:DOSFunctionSmallN}.\n\nThe main results of this section thus far can be summarized as follows.  We have shown that\nin scenarios in which the ensemble constituents are the component fields of\na multiplet which transforms under a spontaneously-broken symmetry group, the \nPDF for the masses of those constituents takes a well-defined form.\nAs the number of component fields in the multiplet increases, the density-of-states \nfunction $n_{\\rm SU(N)}(m)$ for our ensemble becomes overwhelmingly statistically likely \nto coincide with that PDF.~  Moreover, the properties of this PDF function for the density of states \nare also significant.  In particular we observe that the density-of-states function  \ngenerally {\\it decreases}\\/ with increasing $m$, and does so in a predictable way with\na well-defined upper limit $n_{\\rm max}$ beyond which $n(m)=0$.\nBy contrast, other natural scenarios which naturally give rise to large numbers of\ndark particles, such as Kaluza-Klein towers~\\cite{DDM1,DDM2}, bound-state resonances \nin strongly coupled theories~\\cite{DDMString}, or oscillator states of a fundamental\nstring~\\cite{DDMString} give rise to density-of-state functions which are either\nindependent of $m$ or else rise exponentially with $m$.  \n\nThe emergent mass spectrum we have found in this section\nis ultimately the hallmark of the underlying randomness within our toy model.\nIndeed, this behavior for the emergent mass spectrum ---\nand the Wigner semi-circle rule from which it is derived  ---\napply more generally to large classes \nof random matrices~\\cite{Mehta},\nonly one example of which we have focused on here.\n\n\nFinally, before concluding this section, it is important to realize that we have only partially\ntackled the central problem that we face when discussing our random dark sector.\nThus far, we have focused on the extent to which a collection of $n_{\\rm mat}$ matrices, each yielding\n$N$ eigenvalues, together produce a set of $N n_{\\rm mat}$ eigenvalues which match our expected ``emergent'' \neigenvalue distributions.   This was done holding $N n_{\\rm mat}$ fixed, so that larger values of $N$ required\nfewer random matrices.        \n\nThis is fine for a mathematical study of random matrices.\nHowever, for practical purposes, the physics question we wish to address is somewhat different.  \nGiven the fact that we have only one observable universe, we expect to see only one possible mass spectrum\nfor our DDM ensemble.\nIn other words, although the underlying symmetry-breaking process is random, in reality\nwe expect to get only one ``roll of the dice''.\nThus, the real question we need to face has to do with the extent to which a given {\\it single}\\/ roll of the dice \n--- {{\\it i.e.}\\/}, the extent to which a {\\it single}\\/ randomly-generated $SU(N)$ matrix --- generates $N$ eigenvalues matching \nthe expected eigenvalue-distribution function $n_{\\rm SU(N)}$.   This is similar to the mathematical \nquestion we have already studied except that we now wish to hold $n_{\\rm mat}=1$.\n\nTo study this question for any $N$, we randomly generate an $SU(N)$ matrix following the \nprocedures outlined above, and calculate its $N$ eigenvalues.\nWe then place these eigenvalues into bins of equal size based on their magnitudes,\nand calculate the goodness-of-fit  $\\chi^2$ statistic \n\n", "itemtype": "equation", "pos": 32146, "prevtext": "\nwhere the factor of two in this expression arises due to the fact that\n$\\lambda^2$ is positive-definite.  The corresponding density-of-states\nfunction $n (m)$ with respect to the constituent mass $m$ rather than\nthe dimensionless variable $\\tilde{m}$ is then given by\n\n", "index": 23, "text": "\\begin{equation}\n  n (m) ~=~ \\frac{\\sqrt{2}n (\\tilde{m})}{\\sqrt{\\xi_1}v}~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"n(m)~{}=~{}\\frac{\\sqrt{2}n(\\tilde{m})}{\\sqrt{\\xi_{1}}v}~{}.\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mpadded width=\"+3.3pt\"><mfrac><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>m</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msqrt><msub><mi>ξ</mi><mn>1</mn></msub></msqrt><mo>⁢</mo><mi>v</mi></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nwhere $i$ labels the bin, where $n_{\\rm bins}$ indicates the total number of bins,\nwhere $X_i$ is the ``observed'' number of eigenvalues in the bin,\n and where $E_i$ is the ``expected'' number of eigenvalues in the bin according to the $n_{\\rm SU(N)}$ \neigenvalue-distribution function.\nGiven that we do not have an analytic form for $n_{\\rm SU(N)}$, we obtain our values of $E_i$\nvia the methods outlined above, choosing a value of $n_{\\rm mat}$ for each $N$ such\nthat a suitably large total number $n_{\\rm eigs}$ of random eigenvalues are generated.  \n\nThe value of $\\chi^2$ in Eq.~(\\ref{chi2def}) represents the extent to which the eigenvalues\nof a single randomly-generated $SU(N)$ matrix match $n_{\\rm SU(N)}$, as desired.   Of course,\ndepending on the particular matrix generated, the corresponding $\\chi^2$ could have values\nwhich are extremely large or extremely small.   What interests us is therefore $\\langle \\chi^2\\rangle$,\n{{\\it i.e.}\\/}, the {\\it average}\\/ value that $\\chi^2$ might have\nif we repeat this process $N'$ times.\nTo help us interpret the result, we then calculate a\nGaussian-equivalent significance $\\sigma$ \nby comparing $\\langle \\chi^2\\rangle$  to a $\\chi^2$-distribution with $n_{\\rm bins} - 1$ degrees of freedom in \norder to obtain a $p$-value, and then asking to what statistical significance $\\sigma$ this $p$-value would \ncorrespond for a Gaussian distribution.  \nThis value of $\\sigma$ thus  represents the degree to which, on average, the eigenvalues from a single random \nmatrix seem {\\it not}\\/ to have been drawn from the expected  $n_{\\rm SU(N)}$ \ndistribution.  A lower significance $\\sigma$ thus indicates better agreement with our expectations.\n\nOur results are shown in Fig.~\\ref{fig:oneroll} for\nthe case of $n_{\\rm eigs}=1.8\\times 10^6$,\n$N' = 10^5$, and $n_{\\rm bins}=40$.\nWe have also taken $\\tilde M=0$.\nNote that none of the qualitative results in this figure would change significantly if other values were chosen.\nWe also remark that\nwhen establishing our bins, we have \nwe have assumed an eigenvalue range from $\\tilde{m} = 0$ to $\\tilde{m} = \\tilde{m}_{\\rm WS}^{\\rm (max)}$, \nwhere  $\\tilde{m}_{\\rm WS}^{\\rm (max)}$ is the maximum possible eigenvalue $\\tilde{m}$ that can be obtained for the Wigner semicircle distribution for that same value of $N$.  \nAlthough eigenvalues values larger than $\\tilde{m}_{\\rm WS}^{\\rm (max)}$ are possible for the true $SU(N)$ ensemble,\nwe have already seen that such eigenvalues are exceedingly rare\nand populate a low-statistics regime in which the ``expected'' bin population is extremely small.  \nIncluding data in this regime therefore tends to skew the statistics in non-meaningful ways.   \n\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.35\\textwidth, keepaspectratio]{EquivSigmaPlot_ex3.pdf}\n  \\caption{The accuracy with which the $N$ eigenvalues of a {\\it single}\\ randomly-chosen $SU(N)$ matrix\n    match, on average, the $SU(N)$ probability distribution function\n     $n_{\\rm SU(N)}$, plotted as a function of $N$.\n      As discussed in the text, this accuracy is quoted in terms of the traditional Gaussian-equivalent \n        significance $\\sigma$ of the negative assertion\n   that on average the eigenvalues derived from a single random matrix seem {\\it not}\\/ to be drawn \nfrom the expected distribution $n_{\\rm SU(N)}$.\n     Thus lower significance $\\sigma$ indicates better agreement with $n_{\\rm SU(N)}$.}\n\\label{fig:oneroll}\n\\end{figure}\n\n\n\nSeveral features are immediately clear from Fig.~\\ref{fig:oneroll}.   As expected,\nwe see that $\\sigma$ decreases with increasing $N$, indicating that our $n_{\\rm SU(N)}$ distributions ---\noscillations and all ---  \nbecome increasingly precise as $N$ grows large.\nIn fact, given the results in Fig.~\\ref{fig:oneroll},\nwe find that \n\n", "itemtype": "equation", "pos": 47512, "prevtext": "\n\nWithout an analytic expression for $P_{\\rm SU(N)}(\\lambda)$, we cannot write down\na closed-form expression for $n_{\\rm SU(N)}(\\tilde{m})$ for arbitrary $N$.\nNevertheless, for $N\\gg 1$ (where the Wigner semicircle approximation holds),\nwe can obtain an analytic approximation for $n_{\\rm SU(N)}(\\tilde{m})$ by taking \n$P_{\\rm SU(N)}(\\lambda)\\approx P_{\\mathrm{WS}}(\\lambda)$ in Eq.~(\\ref{eq:DOSFunctionEta}).\nMoreover, we can gain insight into the behavior of $n_{\\rm SU(N)}(\\tilde{m})$ for smaller\nvalues of $N$ by examining the properties of the density-of-states functions \n$n_{\\mathrm{GUE}}(\\tilde{m})$ and $n_{\\mathrm{FTE}}(\\tilde{m})$ which one would obtain \nfor a GUE and FTE, respectively.  Indeed, exact analytic expressions for these functions \ncan be obtained for arbitrary $N$ by substituting the eigenvalue densities in\nEqs.~(\\ref{eq:OneEigPDFGUE}) and~(\\ref{eq:OneEigPDFFTE}) into \nEq.~(\\ref{eq:DOSFunctionEta}).  These analytic expressions, as well as the \nWigner semicircle expression to which $n_{\\mathrm{GUE}}(\\tilde{m})$, \n$n_{\\mathrm{FTE}}(\\tilde{m})$, and $n_{\\rm SU(N)}(\\tilde{m})$ all tend for $N\\gg 1$,\nare given below:\n\\begin{widetext}\n\\begin{eqnarray}\n  n_{\\mathrm{GUE}}(\\tilde{m}) &=&\n    \\begin{cases}\n      \\displaystyle \\frac{\\sqrt{2}\\tilde{m}Ne^{-\\frac{1}{2} N^2(\\tilde{m}^2-\\tilde{M}^2)}}\n         {\\sqrt{\\pi(\\tilde{m}^2-\\tilde{M}^2)}} \n         \\sum_{k=0}^{N-1}\n         \\frac{H_k^2\\left(N\\sqrt{\\frac{\\tilde{m}^2-\\tilde{M}^2}{2}}\\right)}{2^k k!} ~~~~&\n         \\tilde{M} \\leq  \\tilde{m} ~~~~\n                      \\\\\n      0 & \\mbox{otherwise}~\n    \\end{cases} \\nonumber \\\\\n n_{\\mathrm{FTE}}(\\tilde{m}) &=&\n   \\begin{cases}\n   \\displaystyle\n   \\frac{2\\tilde{m}\\Gamma\\big({\\textstyle\\frac{N^2}{2}}\\big)}\n     {\\pi\\sqrt{\\tilde{m}^2-\\tilde{M}^2}}\n   \\sum_{j=0}^{N-1}\\frac{(-2)^j\\Gamma\\left(j + {\\textstyle\\frac{1}{2}}\\right)}\n     {j!\\Gamma\\left(\\frac{N^2 - 1}{2}\\right)}\n     \\left(\\!\\!\\begin{array}{c} N \\\\ j + 1\\end{array}\\!\\!\\right)\n     \\rule[0pt]{0pt}{11pt}_2F_1\\!\\left(j + {\\textstyle\\frac{1}{2}},\n     {\\textstyle\\frac{3 - N^2}{2}};\n     {\\textstyle\\frac{1}{2}};\n     {\\textstyle \\tilde{m}^2 - \\tilde{M}^2}\\right)~~~~\n     & \\tilde{M} \\leq  \\tilde{m} < \\displaystyle \\sqrt{\\tilde{M}^2 + 1 } \\\\\n   0 & \\mbox{otherwise}~\n    \\end{cases} \\nonumber \\\\\n n_{\\mathrm{WS}}(\\tilde{m}) &=&\n  \\begin{cases}\n   \\displaystyle \\frac{2 N^{3/2}}{\\pi}\n     \\sqrt{\\frac{\\tilde{m}^2}{\\tilde{m}^2-\\tilde{M}^2}-\\frac{N\\tilde{m}^2}{4}}~~~~\n     & \\tilde{M} \\leq  \\tilde{m} < \\displaystyle \\sqrt{\\tilde{M}^2 + \\frac{4}{N}} \\\\\n   0 & \\mbox{otherwise}~.\n  \\end{cases}\n  \\label{eq:DensityOfStateswithm}\n\\end{eqnarray}\n\\end{widetext}\n\n\\begin{figure}[h]\n  \\includegraphics[width=0.4\\textwidth, keepaspectratio]{CP1000TGUE.pdf}\n  \\caption{The density-of-states function $n(m)$ for the ensemble\n    constituents $\\phi_i$ for $N=1000$.  What initially might appear as a single\n    brownish histogram actually represents the superposition of two nearly identical\n    histograms, one blue and one orange, each of which\n    represents a data set comprising the ensemble-constituent masses\n    obtained for a sample of $n_{\\mathrm{mat}} = 50$ randomly generated\n    $\\langle{\\eta}\\rangle$ matrices.  The blue histogram corresponds\n    to a model in which the symmetry group is $SU(N)$, while the orange histogram\n    corresponds to a model in which the symmetry group is $U(N)$.\n    Likewise, the red curve represents the expression for $n_{\\mathrm{WS}}(\\tilde{m})$ in\n    Eq.~(\\protect\\ref{eq:DensityOfStateswithm}).  As discussed in the text, \n      for such large values of $N$ \n    as assumed here both histograms indeed coincide \n       and are essentially indistinguishable from\n    $n_{\\mathrm{WS}}(\\tilde{m})$. \n  \\label{fig:DOSFunctionN1000}}\n\\end{figure}\n\n\\begin{figure*}[t]\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP5TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP10TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP20TGUE.pdf}\n  \\caption{The density-of-states function $n(m)$ for the ensemble\n    constituents $\\phi_i$ for $N=5$ (left panel), $N=10$ (center panel), and\n    $N=20$ (right panel).  In each panel, the blue and orange histograms\n    each represent a data set comprising the ensemble-constituent masses\n    obtained for a sample of $n_{\\mathrm{mat}}$ randomly generated\n    $\\langle{\\eta}\\rangle$ matrices, where $n_{\\mathrm{mat}}$ is chosen\n    in each case such that the total number of individual mass eigenvalues\n    in the data set is $5 \\times 10^4$.  As in Fig.~\\protect\\ref{fig:DOSFunctionN1000},\n    the blue histogram corresponds to a model in which the symmetry group is\n    $SU(N)$, while the orange histogram corresponds to a model in which the symmetry\n    group is $U(N)$.  The solid, dot-dashed, and dashed curves in\n    each panel correspond to the functions $n_{\\mathrm{GUE}}(\\tilde{m})$,\n    $n_{\\mathrm{FTE}}(\\tilde{m})$, and $n_{\\mathrm{WS}}(\\tilde{m})$ in\n    Eq.~(\\protect\\ref{eq:DensityOfStateswithm}), respectively.\n  \\label{fig:DOSFunctionSmallN}}\n\\end{figure*}\n\nWith these analytic expressions as a guide, we now numerically examine the \ndistributions of masses obtained for statistical ensembles based on an $SU(N)$ \nsymmetry group.  In particular, we perform a numerical analysis \nof these distributions according to the following procedure.\nFor a given value of $N$, we randomly generate a number $n_{\\mathrm{mat}}$\nof $\\langle{\\eta}\\rangle$ matrices\nfollowing the procedure described above Eq.~(\\ref{eqhow}),\nwhere $n_{\\mathrm{mat}}$ is chosen\nsuch that the total number of individual eigenvalues in the data set\nis fixed to a reference value which we take to be  $5 \\times 10^4$.  \nFor each of these matrices, we diagonalize the\ncorresponding mass-squared matrix for the ensemble constituents in order to \nobtain their masses $m_i$.  We then combine the $m_i$ values for\nall of the matrices in our sample into a single data set, a histogram of\nwhich provides a numerical approximation to the corresponding analytic \ndensity-of-states function $n_{\\rm SU(N)}(\\tilde{m})$.  For purposes of comparison,\nwe also derive a numerical approximation for $n_{\\mathrm{FTE}}(\\tilde{m})$ --- \nthe density-of-states function obtained for a $U(N)$ rather than an \n$SU(N)$ symmetry group --- using the same procedure.\n\nIn Fig.~\\ref{fig:DOSFunctionN1000}, we show the density-of-states function\n$n(\\tilde{m})$ for the ensemble constituents generated by diagonalizing\nrandomly generated mass matrices, for $N=1000$ and $\\tilde{M}=0$.\nThe blue histogram corresponds to the $SU(N)$ case, while\nthe orange histogram corresponds to the $U(N)$ case.\nIn each case, the results correspond to a data set\ncomprising the ensemble-constituent masses obtained for a sample of\n$n_{\\mathrm{mat}} = 50$ randomly generated matrices.\nBy contrast, the red curve in Fig.~\\ref{fig:DOSFunctionN1000}\nrepresents the analytical function\n$n_{\\mathrm{WS}}(\\tilde{m})$ in Eq.~(\\ref{eq:DensityOfStateswithm}).  \nAs evident from Fig.~\\ref{fig:DOSFunctionN1000}, the function \n$n_{\\mathrm{WS}}(\\tilde{m})$ provides an excellent approximation \nto the histogram data, as claimed.  Moreover, for such a large value of $N$, \nthe functions $n_{\\mathrm{GUE}}(\\tilde{m})$ and $n_{\\mathrm{FTE}}(\\tilde{m})$\nare essentially indistinguishable from $n_{\\mathrm{WS}}(\\tilde{m})$.\nThus all three functions do an excellent job of approximating the data for $N\\gg 1$.\n\nIt is also interesting to examine how the results are modified in the regime\nin which $N$ is small and the Wigner semicircle distribution provides a less\nreliable approximation for the true density of states for the ensemble.\nIn Fig.~\\ref{fig:DOSFunctionSmallN}, we show the corresponding results for\n$N = 5$ (left panel), $N = 10$ (center panel), and $N=20$ (right panel).\nIn each panel, the blue and orange histograms each represent a data set\ncomprising the ensemble-constituent masses obtained for a sample of\n$n_{\\mathrm{mat}}$ randomly generated $\\langle{\\eta}\\rangle$ matrices,\nwhere $n_{\\mathrm{mat}}$ is chosen in each case such that the total number\nof individual mass eigenvalues in the data set is $5 \\times 10^4$.\nAs in Fig.~\\protect\\ref{fig:DOSFunctionN1000}, the blue histogram corresponds\nto a model in which the symmetry group is $SU(N)$ while the orange histogram corresponds\nto a model in which the symmetry group is $U(N)$.\nThe solid, dot-dashed, and dashed curves in each panel\ncorrespond to $n_{\\mathrm{GUE}}(\\tilde{m})$, $n_{\\mathrm{FTE}}(\\tilde{m})$, and\n$n_{\\mathrm{WS}}(\\tilde{m})$, respectively.\n\nWe see from Fig.~\\ref{fig:DOSFunctionSmallN}\nthat $n_{\\mathrm{WS}}(\\tilde{m})$ aptly characterizes the overall\n``envelope'' of the true density of states for small $N$ in both the $U(N)$\nand $SU(N)$ cases, just as it does for large $N$.  However, for small $N$, the\ntrue density of states for these cases also exhibits\n {\\it oscillations}\\/ around this envelope --- oscillations which grow increasingly\npronounced with decreasing $N$.  For the case in which the symmetry group is\n$U(N)$, the histogram data are distributed according to the density-of-states\nfunction $n_{\\mathrm{FTE}}(\\tilde{m})$, as expected; \nthis function actually includes the oscillations, and the histogram differs \nfrom  $n_{\\mathrm{FTE}}(\\tilde{m})$ only because of random fluctuations.\nHowever, for the case in which the symmetry group is $SU(N)$, the amplitude of \nthe oscillations is significantly more pronounced, and we see that neither \n$n_{\\mathrm{FTE}}(\\tilde{m})$ nor $n_{\\mathrm{WS}}(\\tilde{m})$ are accurate \ndescriptions of the density of states for the case of an $SU(N)$ symmetry group at \nsmall $N$.   However, as $N$ grows larger (as illustrated in the right panel of Fig.~\\ref{fig:DOSFunctionSmallN}),\nthe oscillations fade away in relative magnitude for both the $U(N)$ and $SU(N)$ cases, and \nthe actual distributions qualitatively begin to approach \n$n_{\\mathrm{WS}}(\\tilde{m})$.\n\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.4\\textwidth, keepaspectratio]{CompMValsLargeNPlotN1000.pdf}\n  \\caption{The density-of-states function $n_{\\mathrm{WS}}(\\tilde{m})$ for\n    several different choices of the mass parameter $\\tilde{M}$.  In each case,\n    we have taken $N = 1000$ and $n_{\\rm mat}=50$.\n  \\label{fig:DOSFunctionMadMLargeN}}\n\\end{figure}\n\n\\begin{figure*}[t]\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP5M0pt025TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP10M0pt025TGUE.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{CP20M0pt025TGUE.pdf}\n  \\caption{Same as Fig.~\\protect\\ref{fig:DOSFunctionSmallN},\n  but with $\\tilde{M}=0.025$ rather than $\\tilde{M} = 0$.\n  \\label{fig:DOSFunctionMadMSmallN}}\n\\end{figure*}\n\n\nWe now turn to consider how the density of states for our ensemble depends\non $\\tilde{M}$.  In Fig.~\\ref{fig:DOSFunctionMadMLargeN}, we display curves of\nthe Wigner density-of-states function $n_{\\mathrm{WS}}(\\tilde{m})$ for different\nvalues of $\\tilde{M}$.  For each of these curves, we have taken\n$N=1000$ --- a suitably large value of $N$ for which this function provides an\nexcellent approximation to the exact density-of-states function $n(\\tilde{m})$, in\nthe case of either a $U(N)$ or $SU(N)$ symmetry group.\nWe see that for $\\tilde{M} \\neq 0$, the presence of the additional contribution\nto the mass matrix in Eq.~(\\ref{eq:MassMatrix}) distorts the density-of-states\nfunction away from the semicircle form which arises in the $\\tilde{M} = 0$ case.\nThis is simply a reflection of the fact that states $\\phi_i$ in the ensemble which\nreceive comparatively small contributions $\\xi_1\\lambda_i^2 \\lesssim M^2$ to their\nsquared masses from symmetry breaking will have masses $m_i \\approx M$.\n\nIn Fig.~\\ref{fig:DOSFunctionMadMSmallN}, we show the corresponding densities of states\n(similar to Fig.~\\ref{fig:DOSFunctionSmallN}) for smaller values of $N$ but non-zero \n$\\tilde M$.  These results exhibit the same qualitative behavior as in\nFig.~\\ref{fig:DOSFunctionSmallN}.\n\nThe main results of this section thus far can be summarized as follows.  We have shown that\nin scenarios in which the ensemble constituents are the component fields of\na multiplet which transforms under a spontaneously-broken symmetry group, the \nPDF for the masses of those constituents takes a well-defined form.\nAs the number of component fields in the multiplet increases, the density-of-states \nfunction $n_{\\rm SU(N)}(m)$ for our ensemble becomes overwhelmingly statistically likely \nto coincide with that PDF.~  Moreover, the properties of this PDF function for the density of states \nare also significant.  In particular we observe that the density-of-states function  \ngenerally {\\it decreases}\\/ with increasing $m$, and does so in a predictable way with\na well-defined upper limit $n_{\\rm max}$ beyond which $n(m)=0$.\nBy contrast, other natural scenarios which naturally give rise to large numbers of\ndark particles, such as Kaluza-Klein towers~\\cite{DDM1,DDM2}, bound-state resonances \nin strongly coupled theories~\\cite{DDMString}, or oscillator states of a fundamental\nstring~\\cite{DDMString} give rise to density-of-state functions which are either\nindependent of $m$ or else rise exponentially with $m$.  \n\nThe emergent mass spectrum we have found in this section\nis ultimately the hallmark of the underlying randomness within our toy model.\nIndeed, this behavior for the emergent mass spectrum ---\nand the Wigner semi-circle rule from which it is derived  ---\napply more generally to large classes \nof random matrices~\\cite{Mehta},\nonly one example of which we have focused on here.\n\n\nFinally, before concluding this section, it is important to realize that we have only partially\ntackled the central problem that we face when discussing our random dark sector.\nThus far, we have focused on the extent to which a collection of $n_{\\rm mat}$ matrices, each yielding\n$N$ eigenvalues, together produce a set of $N n_{\\rm mat}$ eigenvalues which match our expected ``emergent'' \neigenvalue distributions.   This was done holding $N n_{\\rm mat}$ fixed, so that larger values of $N$ required\nfewer random matrices.        \n\nThis is fine for a mathematical study of random matrices.\nHowever, for practical purposes, the physics question we wish to address is somewhat different.  \nGiven the fact that we have only one observable universe, we expect to see only one possible mass spectrum\nfor our DDM ensemble.\nIn other words, although the underlying symmetry-breaking process is random, in reality\nwe expect to get only one ``roll of the dice''.\nThus, the real question we need to face has to do with the extent to which a given {\\it single}\\/ roll of the dice \n--- {{\\it i.e.}\\/}, the extent to which a {\\it single}\\/ randomly-generated $SU(N)$ matrix --- generates $N$ eigenvalues matching \nthe expected eigenvalue-distribution function $n_{\\rm SU(N)}$.   This is similar to the mathematical \nquestion we have already studied except that we now wish to hold $n_{\\rm mat}=1$.\n\nTo study this question for any $N$, we randomly generate an $SU(N)$ matrix following the \nprocedures outlined above, and calculate its $N$ eigenvalues.\nWe then place these eigenvalues into bins of equal size based on their magnitudes,\nand calculate the goodness-of-fit  $\\chi^2$ statistic \n\n", "index": 25, "text": "\\begin{equation}\n        \\chi^2 ~\\equiv~  \\sum_{i=1}^{n_{\\rm bins}}  \\frac{ (X_i - E_i)^2 }{E_i}\n\\label{chi2def}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}~{}\\equiv~{}\\sum_{i=1}^{n_{\\rm bins}}\\frac{(X_{i}-E_{i})^{2}}{E_{i}}\" display=\"block\"><mrow><mpadded width=\"+3.3pt\"><msup><mi>χ</mi><mn>2</mn></msup></mpadded><mo rspace=\"5.8pt\">≡</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>n</mi><mi>bins</mi></msub></munderover><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>X</mi><mi>i</mi></msub><mo>-</mo><msub><mi>E</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msub><mi>E</mi><mi>i</mi></msub></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nWe thus see that the accuracy of our emergent mass distribution $n_{\\rm SU(N)}$\nactually grows {\\it exponentially}\\/ with $N$.\nBut perhaps most importantly, we see that our $\\sigma$ values are themselves\nextremely small {\\it throughout}\\/ the range of $N$ plotted, even for $N$  \nwhich are relatively small.   Thus we can conclude that our emergent eigenvalue distributions $n_{\\rm SU(N)}$ \ndo an extremely good job of describing the distributions of masses across\nthe dark sector ---\neven if the symmetries governing the dark sector are not overwhelmingly large.\n\n\n\n\n\n\n\\section{Towards a DDM Ensemble:   \nCouplings, Decay Widths, and Cosmological Abundances\\label{sec:DetectionAbundance}}\n\n\n\nIn the previous section, we analyzed the emergent mass spectrum \nfor the example model presented in Sect.~\\ref{sec:Model} and showed that for $N\\gg 1$ \nthe density-of-states function $n_{\\rm SU(N)}(\\tilde{m})$ for the $\\phi_i$\nconverges to the Wigner semicircle function $n_{\\mathrm{WS}}(\\tilde{m})$ given in Eq.~(\\ref{eq:DensityOfStateswithm}).  \nHowever, in order for these particles \nto constitute a viable DDM ensemble, they must collectively manifest an appropriate \nbalancing between decay widths and abundances.  In this section, we discuss how\na spectrum of decay widths and abundances can be generated for the $\\phi_i$ and \nhow the interplay between the corresponding scaling relations and the density-of-states\nfunction derived in the previous section can give rise to a DDM-like balancing \nbetween decay widths and abundances across the ensemble as a whole.  \nIndeed, as we shall see,\na density-of-states function which decreases with the mass $m$ \n --- as emerges for our random ensemble ---\ncan accommodate a broader range\nof scaling relations between decay width and mass, and between abundance and mass,\nthan is possible for other distributions.  \n\nNote that here and in the following, indices $i,j=1,2,...,N$ now label \nthe different mass eigenstates $\\phi_i$.\n\n\n\n\\subsection{Dark-Matter Decay\\label{sec:Decay}}\n\n\n\nWe begin with a discussion of the decay properties of the ensemble constituents. \nThe toy model introduced in Sect.~\\ref{sec:Model} involves only two additional\nmatter fields beyond those of the SM: the $SU(N)$ multiplets $\\phi$ and $\\eta$.  Given\nthe symmetry structure of the model, these fields couple to the fields of the SM only via \ngravitational interactions.  Moreover, the $\\IZ_2^\\phi$ symmetry of the model forbids \nall scattering and decay processes wherein number of $\\phi_i$ particles in the \ninitial and final states differ by an odd number.  As a consequence, the lightest of the \n$\\phi_i$ is absolutely stable.  Furthermore, the decay widths of the heavier ensemble\nconstituents are typically dominated by {\\it intra-ensemble}\\/ decays --- {{\\it i.e.}\\/}, decays to \nfinal states involving other, lighter $\\phi_i$.  The most relevant intra-ensemble decay\nprocesses include $\\phi_i \\rightarrow \\phi_j \\eta_{a}$, \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, and, in cases in which the $SU(N)$\nsymmetry is local, $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$, where $G^\\mu_a$ denotes one \nof the $SU(N)$ gauge fields.\n\nWhile channels of this sort provide a natural decay mechanism for the ensemble \nconstituents within the context of this minimal statistical DDM model, these channels\nare phenomenologically problematic for two reasons.  First, the corresponding decay \nwidths are typically far too large.    \nSecond, because the final states consist solely of hidden-sector particles, these decays \nare essentially invisible and yield no observable indirect detection signals.\nThus, in order to ensure phenomenological viability, we must find a way to suppress \nthese contributions while at the same time arranging additional mechanisms through which \nthe $\\phi_i$ can decay.    \n\nThe simplest and most natural way of suppressing processes involving $\\eta_a$ or $G^\\mu_a$\nin the final state is to arrange for the masses of the $\\phi_i$ to be parametrically small \nin comparison with the masses of the $\\eta_a$ and $G^\\mu_a$.  \nIndeed, this is not difficult to arrange.  The overall mass scale for the $\\phi_i$ \nis determined by the mass parameter $M$ in Eq.~(\\ref{eq:V0}) and by the parameter \ncombination $\\sqrt{\\xi_1} v$.  By contrast, the overall mass scales for the $\\eta_a$ and \nthe $G^\\mu_a$ are both independent of $M$ and $\\xi_1$.  Thus, suppressing decays such\nas $\\phi_i \\rightarrow \\phi_j \\eta_{a}$ and $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$  \nis simply a matter of taking $M$ and $\\xi_1$ to be sufficiently small. \nIndeed,  this parametric separation is \nanalogous to the situation in the \nSM lepton sector, where Majorana masses and Yukawa couplings of the light fermions play \nthe roles of $M$ and $\\xi_1$, respectively.\n\nIntra-ensemble decay processes such as $\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, \nin which one of the $\\phi_i$ decays to a final state involving only other, lighter ensemble \nconstituents, can also naturally be suppressed in a number of ways.  First of all,\ncontributions to such processes which arise due to the quartic interaction in \nEq.~(\\ref{eq:V0}) can be suppressed simply by taking the coupling coefficient $\\xi_\\phi$,\nwhich plays no other important role in the phenomenology of the model, to be sufficiently small.  \nMoreover, the remaining contributions, which proceed via diagrams involving virtual $\\eta_a$ or \n$G^\\mu_a$ fields, can likewise be suppressed by taking $M$ and $\\xi_1$ to be sufficiently small.   \nAlternatively, intra-ensemble decay processes of this sort can also be forbidden simply by \nkinematical considerations.  For example, processes of the form \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$ are kinematically forbidden unless  \n$m_{\\phi_i} > 3m_0$, where $m_0$ is the mass of the lightest ensemble\nconstituent.  If the mass spectrum of the theory is such that this condition is not\nsatisfied for even the heaviest of the $\\phi_i$, such intra-ensemble decays cannot occur.\nThis is not difficult to arrange.  Indeed, $m_0$ is essentially determined by $M$, while \nthe splitting between the masses of the heaviest and lightest of the ensemble constituents \nis essentially determined by $\\sqrt{\\xi_1} v$; thus, the lightest mass and the largest mass \nsplitting are parametrically independent.  \n\nHaving discussed how contributions from processes such as \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, $\\phi_i \\rightarrow \\phi_j \\eta_{a}$,\nand $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$ to the decay widths of the $\\phi_i$ can be\nsuppressed, we now turn to examine how decay widths of the correct order of magnitude can be \ngenerated for these fields.\nFor concreteness, we present an example of how the ensemble constituents \ncan be coupled to the fields of the SM --- and in particular the photon field.  We \nemphasize that this is merely one example, and that other self-consistent \ncoupling scenarios which lead to alternative decay phenomenologies for the $\\phi_i$\nare possible as well.  \n\nAs discussed above, our first step is to break the $\\IZ_2^\\phi$ symmetry.\nIn order to do this in a controlled \nmanner, we introduce an additional field $B$ which is odd under $\\IZ_2^\\phi$ and \ntransforms in the fundamental representation of $SU(N)$.\nGiven the symmetry structure of the visible and hidden \nsectors, the simplest method of coupling the $\\phi_i$ to the photon field is via\nan effective operator of the form\n\n", "itemtype": "equation", "pos": 51420, "prevtext": "\nwhere $i$ labels the bin, where $n_{\\rm bins}$ indicates the total number of bins,\nwhere $X_i$ is the ``observed'' number of eigenvalues in the bin,\n and where $E_i$ is the ``expected'' number of eigenvalues in the bin according to the $n_{\\rm SU(N)}$ \neigenvalue-distribution function.\nGiven that we do not have an analytic form for $n_{\\rm SU(N)}$, we obtain our values of $E_i$\nvia the methods outlined above, choosing a value of $n_{\\rm mat}$ for each $N$ such\nthat a suitably large total number $n_{\\rm eigs}$ of random eigenvalues are generated.  \n\nThe value of $\\chi^2$ in Eq.~(\\ref{chi2def}) represents the extent to which the eigenvalues\nof a single randomly-generated $SU(N)$ matrix match $n_{\\rm SU(N)}$, as desired.   Of course,\ndepending on the particular matrix generated, the corresponding $\\chi^2$ could have values\nwhich are extremely large or extremely small.   What interests us is therefore $\\langle \\chi^2\\rangle$,\n{{\\it i.e.}\\/}, the {\\it average}\\/ value that $\\chi^2$ might have\nif we repeat this process $N'$ times.\nTo help us interpret the result, we then calculate a\nGaussian-equivalent significance $\\sigma$ \nby comparing $\\langle \\chi^2\\rangle$  to a $\\chi^2$-distribution with $n_{\\rm bins} - 1$ degrees of freedom in \norder to obtain a $p$-value, and then asking to what statistical significance $\\sigma$ this $p$-value would \ncorrespond for a Gaussian distribution.  \nThis value of $\\sigma$ thus  represents the degree to which, on average, the eigenvalues from a single random \nmatrix seem {\\it not}\\/ to have been drawn from the expected  $n_{\\rm SU(N)}$ \ndistribution.  A lower significance $\\sigma$ thus indicates better agreement with our expectations.\n\nOur results are shown in Fig.~\\ref{fig:oneroll} for\nthe case of $n_{\\rm eigs}=1.8\\times 10^6$,\n$N' = 10^5$, and $n_{\\rm bins}=40$.\nWe have also taken $\\tilde M=0$.\nNote that none of the qualitative results in this figure would change significantly if other values were chosen.\nWe also remark that\nwhen establishing our bins, we have \nwe have assumed an eigenvalue range from $\\tilde{m} = 0$ to $\\tilde{m} = \\tilde{m}_{\\rm WS}^{\\rm (max)}$, \nwhere  $\\tilde{m}_{\\rm WS}^{\\rm (max)}$ is the maximum possible eigenvalue $\\tilde{m}$ that can be obtained for the Wigner semicircle distribution for that same value of $N$.  \nAlthough eigenvalues values larger than $\\tilde{m}_{\\rm WS}^{\\rm (max)}$ are possible for the true $SU(N)$ ensemble,\nwe have already seen that such eigenvalues are exceedingly rare\nand populate a low-statistics regime in which the ``expected'' bin population is extremely small.  \nIncluding data in this regime therefore tends to skew the statistics in non-meaningful ways.   \n\n\n\\begin{figure}[t]\n  \\includegraphics[width=0.35\\textwidth, keepaspectratio]{EquivSigmaPlot_ex3.pdf}\n  \\caption{The accuracy with which the $N$ eigenvalues of a {\\it single}\\ randomly-chosen $SU(N)$ matrix\n    match, on average, the $SU(N)$ probability distribution function\n     $n_{\\rm SU(N)}$, plotted as a function of $N$.\n      As discussed in the text, this accuracy is quoted in terms of the traditional Gaussian-equivalent \n        significance $\\sigma$ of the negative assertion\n   that on average the eigenvalues derived from a single random matrix seem {\\it not}\\/ to be drawn \nfrom the expected distribution $n_{\\rm SU(N)}$.\n     Thus lower significance $\\sigma$ indicates better agreement with $n_{\\rm SU(N)}$.}\n\\label{fig:oneroll}\n\\end{figure}\n\n\n\nSeveral features are immediately clear from Fig.~\\ref{fig:oneroll}.   As expected,\nwe see that $\\sigma$ decreases with increasing $N$, indicating that our $n_{\\rm SU(N)}$ distributions ---\noscillations and all ---  \nbecome increasingly precise as $N$ grows large.\nIn fact, given the results in Fig.~\\ref{fig:oneroll},\nwe find that \n\n", "index": 27, "text": "\\begin{equation}\n       \\sigma ~\\approx ~ (1.83)\\, e^{- (0.114)\\,N}  ~~~~~   {\\rm for}~~N\\gg 1~. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\sigma~{}\\approx~{}(1.83)\\,e^{-(0.114)\\,N}~{}~{}~{}~{}~{}{\\rm for}~{}~{}N\\gg 1%&#10;~{}.\" display=\"block\"><mrow><mrow><mrow><mpadded width=\"+3.3pt\"><mi>σ</mi></mpadded><mo rspace=\"5.8pt\">≈</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mn>1.83</mn><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mn>0.114</mn><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>N</mi></mrow></mrow></msup></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+6.6pt\"><mi>for</mi></mpadded><mo>⁢</mo><mi>N</mi></mrow><mo>≫</mo><mpadded width=\"+3.3pt\"><mn>1</mn></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nwhere $F^{\\mu\\nu}$ is the field-strength tensor for the SM photon field, \nwhere $\\Lambda$ is the cutoff scale of the effective theory, and where $c$ is a dimensionless\noperator coefficient.  \n\nWe shall assume that $B$ acquires a VEV due to some additional \ndynamics.  Provided that this dynamics is uncorrelated with the dynamics which gives \nrise to the mass matrix for the $\\phi_i$, the direction of this VEV in field space is \narbitrary.  For convenience, we choose to parametrize the VEVs of the individual components \n$B_i$ of $B$ (in the mass eigenbasis of the $\\phi_i$) as\n\n", "itemtype": "equation", "pos": 58943, "prevtext": "\nWe thus see that the accuracy of our emergent mass distribution $n_{\\rm SU(N)}$\nactually grows {\\it exponentially}\\/ with $N$.\nBut perhaps most importantly, we see that our $\\sigma$ values are themselves\nextremely small {\\it throughout}\\/ the range of $N$ plotted, even for $N$  \nwhich are relatively small.   Thus we can conclude that our emergent eigenvalue distributions $n_{\\rm SU(N)}$ \ndo an extremely good job of describing the distributions of masses across\nthe dark sector ---\neven if the symmetries governing the dark sector are not overwhelmingly large.\n\n\n\n\n\n\n\\section{Towards a DDM Ensemble:   \nCouplings, Decay Widths, and Cosmological Abundances\\label{sec:DetectionAbundance}}\n\n\n\nIn the previous section, we analyzed the emergent mass spectrum \nfor the example model presented in Sect.~\\ref{sec:Model} and showed that for $N\\gg 1$ \nthe density-of-states function $n_{\\rm SU(N)}(\\tilde{m})$ for the $\\phi_i$\nconverges to the Wigner semicircle function $n_{\\mathrm{WS}}(\\tilde{m})$ given in Eq.~(\\ref{eq:DensityOfStateswithm}).  \nHowever, in order for these particles \nto constitute a viable DDM ensemble, they must collectively manifest an appropriate \nbalancing between decay widths and abundances.  In this section, we discuss how\na spectrum of decay widths and abundances can be generated for the $\\phi_i$ and \nhow the interplay between the corresponding scaling relations and the density-of-states\nfunction derived in the previous section can give rise to a DDM-like balancing \nbetween decay widths and abundances across the ensemble as a whole.  \nIndeed, as we shall see,\na density-of-states function which decreases with the mass $m$ \n --- as emerges for our random ensemble ---\ncan accommodate a broader range\nof scaling relations between decay width and mass, and between abundance and mass,\nthan is possible for other distributions.  \n\nNote that here and in the following, indices $i,j=1,2,...,N$ now label \nthe different mass eigenstates $\\phi_i$.\n\n\n\n\\subsection{Dark-Matter Decay\\label{sec:Decay}}\n\n\n\nWe begin with a discussion of the decay properties of the ensemble constituents. \nThe toy model introduced in Sect.~\\ref{sec:Model} involves only two additional\nmatter fields beyond those of the SM: the $SU(N)$ multiplets $\\phi$ and $\\eta$.  Given\nthe symmetry structure of the model, these fields couple to the fields of the SM only via \ngravitational interactions.  Moreover, the $\\IZ_2^\\phi$ symmetry of the model forbids \nall scattering and decay processes wherein number of $\\phi_i$ particles in the \ninitial and final states differ by an odd number.  As a consequence, the lightest of the \n$\\phi_i$ is absolutely stable.  Furthermore, the decay widths of the heavier ensemble\nconstituents are typically dominated by {\\it intra-ensemble}\\/ decays --- {{\\it i.e.}\\/}, decays to \nfinal states involving other, lighter $\\phi_i$.  The most relevant intra-ensemble decay\nprocesses include $\\phi_i \\rightarrow \\phi_j \\eta_{a}$, \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, and, in cases in which the $SU(N)$\nsymmetry is local, $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$, where $G^\\mu_a$ denotes one \nof the $SU(N)$ gauge fields.\n\nWhile channels of this sort provide a natural decay mechanism for the ensemble \nconstituents within the context of this minimal statistical DDM model, these channels\nare phenomenologically problematic for two reasons.  First, the corresponding decay \nwidths are typically far too large.    \nSecond, because the final states consist solely of hidden-sector particles, these decays \nare essentially invisible and yield no observable indirect detection signals.\nThus, in order to ensure phenomenological viability, we must find a way to suppress \nthese contributions while at the same time arranging additional mechanisms through which \nthe $\\phi_i$ can decay.    \n\nThe simplest and most natural way of suppressing processes involving $\\eta_a$ or $G^\\mu_a$\nin the final state is to arrange for the masses of the $\\phi_i$ to be parametrically small \nin comparison with the masses of the $\\eta_a$ and $G^\\mu_a$.  \nIndeed, this is not difficult to arrange.  The overall mass scale for the $\\phi_i$ \nis determined by the mass parameter $M$ in Eq.~(\\ref{eq:V0}) and by the parameter \ncombination $\\sqrt{\\xi_1} v$.  By contrast, the overall mass scales for the $\\eta_a$ and \nthe $G^\\mu_a$ are both independent of $M$ and $\\xi_1$.  Thus, suppressing decays such\nas $\\phi_i \\rightarrow \\phi_j \\eta_{a}$ and $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$  \nis simply a matter of taking $M$ and $\\xi_1$ to be sufficiently small. \nIndeed,  this parametric separation is \nanalogous to the situation in the \nSM lepton sector, where Majorana masses and Yukawa couplings of the light fermions play \nthe roles of $M$ and $\\xi_1$, respectively.\n\nIntra-ensemble decay processes such as $\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, \nin which one of the $\\phi_i$ decays to a final state involving only other, lighter ensemble \nconstituents, can also naturally be suppressed in a number of ways.  First of all,\ncontributions to such processes which arise due to the quartic interaction in \nEq.~(\\ref{eq:V0}) can be suppressed simply by taking the coupling coefficient $\\xi_\\phi$,\nwhich plays no other important role in the phenomenology of the model, to be sufficiently small.  \nMoreover, the remaining contributions, which proceed via diagrams involving virtual $\\eta_a$ or \n$G^\\mu_a$ fields, can likewise be suppressed by taking $M$ and $\\xi_1$ to be sufficiently small.   \nAlternatively, intra-ensemble decay processes of this sort can also be forbidden simply by \nkinematical considerations.  For example, processes of the form \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$ are kinematically forbidden unless  \n$m_{\\phi_i} > 3m_0$, where $m_0$ is the mass of the lightest ensemble\nconstituent.  If the mass spectrum of the theory is such that this condition is not\nsatisfied for even the heaviest of the $\\phi_i$, such intra-ensemble decays cannot occur.\nThis is not difficult to arrange.  Indeed, $m_0$ is essentially determined by $M$, while \nthe splitting between the masses of the heaviest and lightest of the ensemble constituents \nis essentially determined by $\\sqrt{\\xi_1} v$; thus, the lightest mass and the largest mass \nsplitting are parametrically independent.  \n\nHaving discussed how contributions from processes such as \n$\\phi_i \\rightarrow \\phi_j \\phi_k \\phi_\\ell$, $\\phi_i \\rightarrow \\phi_j \\eta_{a}$,\nand $\\phi_i \\rightarrow \\phi_j G^\\mu_{a}$ to the decay widths of the $\\phi_i$ can be\nsuppressed, we now turn to examine how decay widths of the correct order of magnitude can be \ngenerated for these fields.\nFor concreteness, we present an example of how the ensemble constituents \ncan be coupled to the fields of the SM --- and in particular the photon field.  We \nemphasize that this is merely one example, and that other self-consistent \ncoupling scenarios which lead to alternative decay phenomenologies for the $\\phi_i$\nare possible as well.  \n\nAs discussed above, our first step is to break the $\\IZ_2^\\phi$ symmetry.\nIn order to do this in a controlled \nmanner, we introduce an additional field $B$ which is odd under $\\IZ_2^\\phi$ and \ntransforms in the fundamental representation of $SU(N)$.\nGiven the symmetry structure of the visible and hidden \nsectors, the simplest method of coupling the $\\phi_i$ to the photon field is via\nan effective operator of the form\n\n", "index": 29, "text": "\\begin{equation}\n  \\mathcal{O}_D  ~=~ \\frac{c}{\\Lambda^2} ( \\phi^\\dagger B + B^\\dagger \\phi ) \n    F^{\\mu \\nu} F_{\\mu \\nu}~,\n  \\label{eq:DecayOperator}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}_{D}~{}=~{}\\frac{c}{\\Lambda^{2}}(\\phi^{\\dagger}B+B^{\\dagger}\\phi)F^%&#10;{\\mu\\nu}F_{\\mu\\nu}~{},\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mi>D</mi></msub></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><mfrac><mi>c</mi><msup><mi mathvariant=\"normal\">Λ</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>ϕ</mi><mo>†</mo></msup><mo>⁢</mo><mi>B</mi></mrow><mo>+</mo><mrow><msup><mi>B</mi><mo>†</mo></msup><mo>⁢</mo><mi>ϕ</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>F</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>F</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msub></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "  \nHere, the $N$ different $\\beta_i$ are dimensionless and subject to the constraint\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $F^{\\mu\\nu}$ is the field-strength tensor for the SM photon field, \nwhere $\\Lambda$ is the cutoff scale of the effective theory, and where $c$ is a dimensionless\noperator coefficient.  \n\nWe shall assume that $B$ acquires a VEV due to some additional \ndynamics.  Provided that this dynamics is uncorrelated with the dynamics which gives \nrise to the mass matrix for the $\\phi_i$, the direction of this VEV in field space is \narbitrary.  For convenience, we choose to parametrize the VEVs of the individual components \n$B_i$ of $B$ (in the mass eigenbasis of the $\\phi_i$) as\n\n", "index": 31, "text": "\\begin{equation}\n  \\langle B_i \\rangle ~\\equiv~ b \\beta_i~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\langle B_{i}\\rangle~{}\\equiv~{}b\\beta_{i}~{}.\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>B</mi><mi>i</mi></msub><mo rspace=\"5.8pt\" stretchy=\"false\">⟩</mo></mrow><mo rspace=\"5.8pt\">≡</mo><mrow><mi>b</mi><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>β</mi><mi>i</mi></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nNote that since the $\\beta_i$ characterize the direction of the VEV in field space,\nall of them are generically non-zero.  By contrast, $b$ is a parameter with dimensions \nof mass which characterizes the overall magnitude of the collective contribution to \nthe breaking of \n$\\IZ_2^\\phi$ and $SU(N)$ from the $\\langle B_i\\rangle$.\nSince the results derived in Sect.~\\ref{sec:RandomMatrixGeneration} are predicated on\nthe $\\langle \\eta_a \\rangle$ being the dominant source of $SU(N)$ symmetry-breaking,\nwe require that $b \\ll v$.  Moreover,  as discussed in greater detail below, $b$ controls \nthe strength of the effective couplings between the ensemble constituents and the photon \nfield, and therefore the lifetimes of these constituents.  Thus, phenomenological \nconsiderations associated with dark-matter decay --- including, at the very least, the \nrequirement that the longest-lived particle in the ensemble have a lifetime that exceeds\nthe present age of the universe --- likewise constrain $b$ to be quite small.\n\nExpanding the $B_i$ around their VEVs in Eq.~(\\ref{eq:DecayOperator}) yields an\neffective tree-level interaction between each of the ensemble constituents and a\npair of photons:  \n\n", "itemtype": "equation", "pos": 59849, "prevtext": "  \nHere, the $N$ different $\\beta_i$ are dimensionless and subject to the constraint\n\n", "index": 33, "text": "\\begin{equation}\n  \\sum_i \\beta_i^* \\beta_i ~=~ 1~.\n  \\label{eq:BetaSqRel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\sum_{i}\\beta_{i}^{*}\\beta_{i}~{}=~{}1~{}.\" display=\"block\"><mrow><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msubsup><mi>β</mi><mi>i</mi><mo>*</mo></msubsup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>β</mi><mi>i</mi></msub></mpadded></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mpadded width=\"+3.3pt\"><mn>1</mn></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nNote that in principle, the $\\langle B_i \\rangle$ generically breaks any remaining \ncontinuous symmetries under which the $\\phi$ are charged, including the residual\n$U(1)$ symmetry associated with phase rotations of each complex scalar $\\phi_i$.\nAs a result, the $\\langle B_i \\rangle$ generically break the degeneracy between the \nreal and imaginary components of each $\\phi_i$.  Thus, in principle, these degrees of\nfreedom should be treated as distinct real fields.  However, because\nthe induced mass splitting between these fields is proportional to $b$, which is \nconstrained to be small in comparison with the masses of the $\\phi_i$, as discussed\nabove, this splitting has a negligible effect on the mass spectrum of the theory.  \nTherefore, in practice, we may safely neglect the splitting between the real and \nimaginary parts of the $\\phi_i$ and continue to treat the ensemble constituents as\ncomplex fields in what follows.\n\nUnder the assumption that the operator in Eq.~(\\ref{eq:DecayOperatorVEVed}) provides\nthe leading contribution to the decay width $\\Gamma_i$ of each ensemble constituent \n$\\phi_i$, the decay rate of each component is then given by\n\n", "itemtype": "equation", "pos": 61140, "prevtext": "\nNote that since the $\\beta_i$ characterize the direction of the VEV in field space,\nall of them are generically non-zero.  By contrast, $b$ is a parameter with dimensions \nof mass which characterizes the overall magnitude of the collective contribution to \nthe breaking of \n$\\IZ_2^\\phi$ and $SU(N)$ from the $\\langle B_i\\rangle$.\nSince the results derived in Sect.~\\ref{sec:RandomMatrixGeneration} are predicated on\nthe $\\langle \\eta_a \\rangle$ being the dominant source of $SU(N)$ symmetry-breaking,\nwe require that $b \\ll v$.  Moreover,  as discussed in greater detail below, $b$ controls \nthe strength of the effective couplings between the ensemble constituents and the photon \nfield, and therefore the lifetimes of these constituents.  Thus, phenomenological \nconsiderations associated with dark-matter decay --- including, at the very least, the \nrequirement that the longest-lived particle in the ensemble have a lifetime that exceeds\nthe present age of the universe --- likewise constrain $b$ to be quite small.\n\nExpanding the $B_i$ around their VEVs in Eq.~(\\ref{eq:DecayOperator}) yields an\neffective tree-level interaction between each of the ensemble constituents and a\npair of photons:  \n\n", "index": 35, "text": "\\begin{equation}\n  \\mathcal{O}_D ~=~\\frac{b}{\\Lambda^2} F^{\\mu\\nu} F_{\\mu\\nu}\n    \\sum_i \\big( \\phi_i^\\dagger \\beta_i + \\beta_i^* \\phi_i\\big) + \\ldots\n  \\label{eq:DecayOperatorVEVed}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}_{D}~{}=~{}\\frac{b}{\\Lambda^{2}}F^{\\mu\\nu}F_{\\mu\\nu}\\sum_{i}\\big{(}%&#10;\\phi_{i}^{\\dagger}\\beta_{i}+\\beta_{i}^{*}\\phi_{i}\\big{)}+\\ldots\" display=\"block\"><mrow><mpadded width=\"+3.3pt\"><msub><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mi>D</mi></msub></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><mrow><mfrac><mi>b</mi><msup><mi mathvariant=\"normal\">Λ</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><msup><mi>F</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><msub><mi>F</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msub><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mrow><mrow><msubsup><mi>ϕ</mi><mi>i</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>β</mi><mi>i</mi></msub></mrow><mo>+</mo><mrow><msubsup><mi>β</mi><mi>i</mi><mo>*</mo></msubsup><mo>⁢</mo><msub><mi>ϕ</mi><mi>i</mi></msub></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nIt is noteworthy that the effect of the randomness in these decay widths is reflected\nin the coefficients $|\\beta_i|^2$ which in turn \nmust satisfy the constraint in Eq.~(\\ref{eq:BetaSqRel}).\nThis indicates that while randomness can produce ${\\cal O}(1)$ fluctuations\nin the sizes of these decay widths, these decay widths must nevertheless satisfy \nthe bound\n\n", "itemtype": "equation", "pos": 62502, "prevtext": "\nNote that in principle, the $\\langle B_i \\rangle$ generically breaks any remaining \ncontinuous symmetries under which the $\\phi$ are charged, including the residual\n$U(1)$ symmetry associated with phase rotations of each complex scalar $\\phi_i$.\nAs a result, the $\\langle B_i \\rangle$ generically break the degeneracy between the \nreal and imaginary components of each $\\phi_i$.  Thus, in principle, these degrees of\nfreedom should be treated as distinct real fields.  However, because\nthe induced mass splitting between these fields is proportional to $b$, which is \nconstrained to be small in comparison with the masses of the $\\phi_i$, as discussed\nabove, this splitting has a negligible effect on the mass spectrum of the theory.  \nTherefore, in practice, we may safely neglect the splitting between the real and \nimaginary parts of the $\\phi_i$ and continue to treat the ensemble constituents as\ncomplex fields in what follows.\n\nUnder the assumption that the operator in Eq.~(\\ref{eq:DecayOperatorVEVed}) provides\nthe leading contribution to the decay width $\\Gamma_i$ of each ensemble constituent \n$\\phi_i$, the decay rate of each component is then given by\n\n", "index": 37, "text": "\\begin{equation}\n  \\Gamma_i ~ \\approx ~ \\frac{b^2 m^3_{i}}{2\\pi \\Lambda^4} |\\beta_i|^2~. \n\\label{eq:DecayRate}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\Gamma_{i}~{}\\approx~{}\\frac{b^{2}m^{3}_{i}}{2\\pi\\Lambda^{4}}|\\beta_{i}|^{2}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi mathvariant=\"normal\">Γ</mi><mi>i</mi></msub></mpadded><mo rspace=\"5.8pt\">≈</mo><mrow><mfrac><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>m</mi><mi>i</mi><mn>3</mn></msubsup></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mn>4</mn></msup></mrow></mfrac><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>β</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nThese decay widths therefore cannot grow without limit.\nAs a result, \nby adjusting the parameters in Eq.~(\\ref{eq:DecayRate2}), \nit is possible to ensure that our ensemble does not violate observational limits on dark-matter\ndecays to photons (see, {{\\it e.g.}\\/}, Ref.~\\cite{Slatyer:2012yq})  ---\nall despite the inherent randomness introduced into\nthe decay widths through the coefficients $\\beta_i$. \n \n\n\n\n\\subsection{Annihilation and Abundances}\n\n\nA number of mechanisms exist through which a spectrum of primordial abundances for a\nset of dark-sector particles can be established.  For concreteness, we focus here on \none particular mechanism, namely a variation~\\cite{DesigningDDMPaper} of thermal freeze-out \nwhich yields particularly interesting scaling relations between the masses and abundances of \nensemble constituents.\n\nThe spectrum of primordial abundances $\\Omega_i$ for the $\\phi_i$ depends principally \non the masses of these particles and on the cross-sections for the processes through which \nthey annihilate.  One of the simplest ways of arranging a set of cross-sections of\nthe correct order of magnitude is to introduce~\\cite{DesigningDDMPaper} \nan additional dark fermion $\\psi$ with a mass \n$m_\\psi < m_0$ into which the $\\phi_i$ can annihilate (where $m_0$ is the mass of the lightest\nensemble constituent), as well as an additional Abelian \ngauge group $U(1)_\\chi$ under which both $\\psi$ and the multiplet $\\phi$ are charged.\nFor phenomenological reasons, we shall also assume that $U(1)_\\chi$ is broken by some \nadditional dynamics, and therefore that the $U(1)$ gauge field $\\chi^\\mu$ is massive.  In what follows,\nwe shall assume that the breaking of this symmetry is essentially unrelated to the\nbreaking of $SU(N)$.  In other words, we shall assume that the Goldstone boson \nwhich provides the longitudinal polarization of $\\chi^\\mu$ transforms as a singlet \nunder $SU(N)$.  Under this assumption, \nall components of $\\phi$ will have identical $U(1)_\\chi$ charges \nand the couplings between $\\chi^\\mu$ and the mass eigenstates \n$\\phi_i$ may be taken to be diagonal.\n\nIn this scenario, the cross-section for dark-matter annihilation \nprocesses of the form $\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ receives a\ncontribution from diagrams involving an $s$-channel $\\chi^\\mu$, whereas the cross-section\nfor coannihilation processes of the form $\\phi_i^* \\phi_j \\rightarrow \\overline{\\psi} \\psi$ \nwith $i\\not= j$\nreceives no such contribution.  Contributions to the cross-sections for annihilation\nprocess of the form $\\phi_i^* \\phi_i \\rightarrow \\phi_j^* \\phi_j$ with $m_i > m_j$ (also\ninvolving an $s$-channel $\\chi^\\mu$) are also generated.  Moreover, contributions to the \ncross-sections for processes of the form $\\phi_i^* \\phi_i \\rightarrow \\chi^\\mu \\chi_\\mu$ \nare generated for ensemble constituents with $m_i > m_\\chi$ directly from the \ncorresponding gauge-kinetic terms in the field Lagrangian.  However, in situations in which \nthe effective coupling $g_\\psi$ between $\\chi^\\mu$ and the $\\psi$ field is much larger\nthan the coupling $g_i$ between $\\chi^\\mu$ and $\\phi_i$, the\n$\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ process will dominate. \nWe shall henceforth assume that $g_\\psi \\gg g_i$ for all $\\phi_i$, and thus that \nthe $\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ process provides the dominant \ncontribution to the annihilation cross-section of all of the $\\phi_i$.\nMoreover, we shall also take \n$g_i^2 N \\ll 1$ and $g_i^2 N \\ll g_\\psi^2$ in order to ensure\nthat the annihilation process remains perturbative at all relevant scales.  \n\nUnder these assumptions, the thermally averaged annihilation cross-section \n$\\langle \\sigma_A v \\rangle_i$ for each ensemble constituent is entirely determined \nby the masses $m_i$, $m_\\psi$, $m_\\chi$ and the couplings $g_i$, $g_\\psi$.\nFollowing the analysis of Ref.~\\cite{DesigningDDMPaper}, we find that the \ncorresponding thermal contribution to the relic abundance of each ensemble \nconstituent takes the form \n\n", "itemtype": "equation", "pos": 62988, "prevtext": "\nIt is noteworthy that the effect of the randomness in these decay widths is reflected\nin the coefficients $|\\beta_i|^2$ which in turn \nmust satisfy the constraint in Eq.~(\\ref{eq:BetaSqRel}).\nThis indicates that while randomness can produce ${\\cal O}(1)$ fluctuations\nin the sizes of these decay widths, these decay widths must nevertheless satisfy \nthe bound\n\n", "index": 39, "text": "\\begin{equation}\n  \\Gamma_i ~ \\leq ~ \\frac{b^2 m^3_{i}}{2\\pi \\Lambda^4} ~. \n\\label{eq:DecayRate2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\Gamma_{i}~{}\\leq~{}\\frac{b^{2}m^{3}_{i}}{2\\pi\\Lambda^{4}}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi mathvariant=\"normal\">Γ</mi><mi>i</mi></msub></mpadded><mo rspace=\"5.8pt\">≤</mo><mpadded width=\"+3.3pt\"><mfrac><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>m</mi><mi>i</mi><mn>3</mn></msubsup></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Λ</mi><mn>4</mn></msup></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nAlternatively, the $\\Omega_i$ may be expressed in terms of the mass $m_0$, abundance \n$\\Omega_0$, and $U(1)_\\chi$ coupling $g_0$ of the lightest ensemble constituent.\nThe result is\n\n", "itemtype": "equation", "pos": 67123, "prevtext": "\nThese decay widths therefore cannot grow without limit.\nAs a result, \nby adjusting the parameters in Eq.~(\\ref{eq:DecayRate2}), \nit is possible to ensure that our ensemble does not violate observational limits on dark-matter\ndecays to photons (see, {{\\it e.g.}\\/}, Ref.~\\cite{Slatyer:2012yq})  ---\nall despite the inherent randomness introduced into\nthe decay widths through the coefficients $\\beta_i$. \n \n\n\n\n\\subsection{Annihilation and Abundances}\n\n\nA number of mechanisms exist through which a spectrum of primordial abundances for a\nset of dark-sector particles can be established.  For concreteness, we focus here on \none particular mechanism, namely a variation~\\cite{DesigningDDMPaper} of thermal freeze-out \nwhich yields particularly interesting scaling relations between the masses and abundances of \nensemble constituents.\n\nThe spectrum of primordial abundances $\\Omega_i$ for the $\\phi_i$ depends principally \non the masses of these particles and on the cross-sections for the processes through which \nthey annihilate.  One of the simplest ways of arranging a set of cross-sections of\nthe correct order of magnitude is to introduce~\\cite{DesigningDDMPaper} \nan additional dark fermion $\\psi$ with a mass \n$m_\\psi < m_0$ into which the $\\phi_i$ can annihilate (where $m_0$ is the mass of the lightest\nensemble constituent), as well as an additional Abelian \ngauge group $U(1)_\\chi$ under which both $\\psi$ and the multiplet $\\phi$ are charged.\nFor phenomenological reasons, we shall also assume that $U(1)_\\chi$ is broken by some \nadditional dynamics, and therefore that the $U(1)$ gauge field $\\chi^\\mu$ is massive.  In what follows,\nwe shall assume that the breaking of this symmetry is essentially unrelated to the\nbreaking of $SU(N)$.  In other words, we shall assume that the Goldstone boson \nwhich provides the longitudinal polarization of $\\chi^\\mu$ transforms as a singlet \nunder $SU(N)$.  Under this assumption, \nall components of $\\phi$ will have identical $U(1)_\\chi$ charges \nand the couplings between $\\chi^\\mu$ and the mass eigenstates \n$\\phi_i$ may be taken to be diagonal.\n\nIn this scenario, the cross-section for dark-matter annihilation \nprocesses of the form $\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ receives a\ncontribution from diagrams involving an $s$-channel $\\chi^\\mu$, whereas the cross-section\nfor coannihilation processes of the form $\\phi_i^* \\phi_j \\rightarrow \\overline{\\psi} \\psi$ \nwith $i\\not= j$\nreceives no such contribution.  Contributions to the cross-sections for annihilation\nprocess of the form $\\phi_i^* \\phi_i \\rightarrow \\phi_j^* \\phi_j$ with $m_i > m_j$ (also\ninvolving an $s$-channel $\\chi^\\mu$) are also generated.  Moreover, contributions to the \ncross-sections for processes of the form $\\phi_i^* \\phi_i \\rightarrow \\chi^\\mu \\chi_\\mu$ \nare generated for ensemble constituents with $m_i > m_\\chi$ directly from the \ncorresponding gauge-kinetic terms in the field Lagrangian.  However, in situations in which \nthe effective coupling $g_\\psi$ between $\\chi^\\mu$ and the $\\psi$ field is much larger\nthan the coupling $g_i$ between $\\chi^\\mu$ and $\\phi_i$, the\n$\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ process will dominate. \nWe shall henceforth assume that $g_\\psi \\gg g_i$ for all $\\phi_i$, and thus that \nthe $\\phi_i^* \\phi_i \\rightarrow \\overline{\\psi} \\psi$ process provides the dominant \ncontribution to the annihilation cross-section of all of the $\\phi_i$.\nMoreover, we shall also take \n$g_i^2 N \\ll 1$ and $g_i^2 N \\ll g_\\psi^2$ in order to ensure\nthat the annihilation process remains perturbative at all relevant scales.  \n\nUnder these assumptions, the thermally averaged annihilation cross-section \n$\\langle \\sigma_A v \\rangle_i$ for each ensemble constituent is entirely determined \nby the masses $m_i$, $m_\\psi$, $m_\\chi$ and the couplings $g_i$, $g_\\psi$.\nFollowing the analysis of Ref.~\\cite{DesigningDDMPaper}, we find that the \ncorresponding thermal contribution to the relic abundance of each ensemble \nconstituent takes the form \n\n", "index": 41, "text": "\\begin{equation}\n  \\Omega_i ~\\propto~ \\langle \\sigma_A v \\rangle_i^{-1} \n    ~\\propto~ \\frac{m_i^2}{g_i^2 g_\\psi^2 }\n    \\left(1 - \\frac{m_\\chi^2}{4m_i^2} \\right)^2~.\n  \\label{eq:Abundance}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\Omega_{i}~{}\\propto~{}\\langle\\sigma_{A}v\\rangle_{i}^{-1}~{}\\propto~{}\\frac{m_%&#10;{i}^{2}}{g_{i}^{2}g_{\\psi}^{2}}\\left(1-\\frac{m_{\\chi}^{2}}{4m_{i}^{2}}\\right)^%&#10;{2}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi mathvariant=\"normal\">Ω</mi><mi>i</mi></msub></mpadded><mo rspace=\"5.8pt\">∝</mo><mpadded width=\"+3.3pt\"><msubsup><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>σ</mi><mi>A</mi></msub><mo>⁢</mo><mi>v</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>i</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mpadded><mo rspace=\"5.8pt\">∝</mo><mrow><mfrac><msubsup><mi>m</mi><mi>i</mi><mn>2</mn></msubsup><mrow><msubsup><mi>g</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>g</mi><mi>ψ</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msubsup><mi>m</mi><mi>χ</mi><mn>2</mn></msubsup><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mfrac></mrow><mo>)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nWe emphasize that in this expression the subscript `0' is merely shorthand \nfor that value of $i=1,...,N$ for which $m_i$ is minimized.\n\nIn interpreting the result in Eq.~(\\ref{eq:AbundanceInTermsOfOmega0}), \nit is instructive to consider the case in which the\ncouplings between $\\chi^\\mu$ and all of the $\\phi_i$ are identical --- {{\\it i.e.}\\/}, \nthe case in which $g_i = g_0$ for all $\\phi_i$.\nThus, as discussed in Ref.~\\cite{DesigningDDMPaper}, we see that in the limit in which \n$m_i \\gg m_\\chi$, the abundance $\\Omega_i$ increases with the mass of the ensemble \nconstituent.  In particular, $\\Omega_i \\propto m_i^2$.  By contrast, in the opposite\nlimit in which $m_i \\ll m_\\chi$, we see that $\\Omega_i \\propto m_i^{-2}$.  Thus, in\nthis limit, the heavier ensemble constituents have smaller abundances.  Finally, we\nnote that in the special case in which $2m_i \\approx m_\\chi$ and annihilation of a \nparticular ensemble constituent occurs on resonance, we obtain $\\Omega_i \\propto \\Gamma_\\chi^2 $, \nwhere $\\Gamma_\\chi$ is the total decay width of $\\chi$. \n\n\n\n\\subsection{Random Ensembles as DDM Ensembles\\label{sec:DDMatlast}}\n\n\nWe now seek to determine whether the scaling relations we have found for our random\nensemble are\nconsistent with the phenomenological balancing requirements that are\nthe cornerstone of the DDM framework.\nAs discussed in Refs.~\\cite{DDM1,DDM2}, these balancing requirements may be expressed as follows.\nFirst, we use our relation between decay widths $\\Gamma$ and masses $m$ in order\nto express our abundance function $\\Omega(m)$ \nand density-of-states function $n(m)$ \nin terms of $\\Gamma$ rather than $m$.\nNote that while  $\\Omega(m)$ and $n(m)$ are each \ndensities {\\it per unit mass},\nwhat we now seek are \nthe corresponding densities $\\Omega(\\Gamma)$ and $n(\\Gamma)$ \n {\\it per unit decay width}:\n\n", "itemtype": "equation", "pos": 67509, "prevtext": "\nAlternatively, the $\\Omega_i$ may be expressed in terms of the mass $m_0$, abundance \n$\\Omega_0$, and $U(1)_\\chi$ coupling $g_0$ of the lightest ensemble constituent.\nThe result is\n\n", "index": 43, "text": "\\begin{equation}\n  \\Omega_i ~=~ \\Omega_0 \\left(\\frac{m_0g_0}{m_ig_i}\\right)^2 \n    \\left(\\frac{4m_i^2 - m_\\chi^2}{4m_0^2 - m_\\chi^2}\\right)^2~.\n  \\label{eq:AbundanceInTermsOfOmega0}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\Omega_{i}~{}=~{}\\Omega_{0}\\left(\\frac{m_{0}g_{0}}{m_{i}g_{i}}\\right)^{2}\\left%&#10;(\\frac{4m_{i}^{2}-m_{\\chi}^{2}}{4m_{0}^{2}-m_{\\chi}^{2}}\\right)^{2}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi mathvariant=\"normal\">Ω</mi><mi>i</mi></msub></mpadded><mo rspace=\"5.8pt\">=</mo><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mn>0</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><msub><mi>m</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>g</mi><mn>0</mn></msub></mrow><mrow><msub><mi>m</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>g</mi><mi>i</mi></msub></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mrow><mo>(</mo><mfrac><mrow><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>i</mi><mn>2</mn></msubsup></mrow><mo>-</mo><msubsup><mi>m</mi><mi>χ</mi><mn>2</mn></msubsup></mrow><mrow><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo>-</mo><msubsup><mi>m</mi><mi>χ</mi><mn>2</mn></msubsup></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nGiven these new functions, \nit was then shown in Ref.~\\cite{DDM1} that if \n$\\Omega(\\Gamma)$ scales with $\\Gamma$ according to \n$\\Omega(\\Gamma) \\propto \\Gamma^\\alpha$ for some scaling coefficient $\\alpha$,\nand if  $n(\\Gamma) \\propto \\Gamma^\\beta$ for some scaling coefficient $\\beta$,\nthen the requirement\n\n", "itemtype": "equation", "pos": 69542, "prevtext": "\nWe emphasize that in this expression the subscript `0' is merely shorthand \nfor that value of $i=1,...,N$ for which $m_i$ is minimized.\n\nIn interpreting the result in Eq.~(\\ref{eq:AbundanceInTermsOfOmega0}), \nit is instructive to consider the case in which the\ncouplings between $\\chi^\\mu$ and all of the $\\phi_i$ are identical --- {{\\it i.e.}\\/}, \nthe case in which $g_i = g_0$ for all $\\phi_i$.\nThus, as discussed in Ref.~\\cite{DesigningDDMPaper}, we see that in the limit in which \n$m_i \\gg m_\\chi$, the abundance $\\Omega_i$ increases with the mass of the ensemble \nconstituent.  In particular, $\\Omega_i \\propto m_i^2$.  By contrast, in the opposite\nlimit in which $m_i \\ll m_\\chi$, we see that $\\Omega_i \\propto m_i^{-2}$.  Thus, in\nthis limit, the heavier ensemble constituents have smaller abundances.  Finally, we\nnote that in the special case in which $2m_i \\approx m_\\chi$ and annihilation of a \nparticular ensemble constituent occurs on resonance, we obtain $\\Omega_i \\propto \\Gamma_\\chi^2 $, \nwhere $\\Gamma_\\chi$ is the total decay width of $\\chi$. \n\n\n\n\\subsection{Random Ensembles as DDM Ensembles\\label{sec:DDMatlast}}\n\n\nWe now seek to determine whether the scaling relations we have found for our random\nensemble are\nconsistent with the phenomenological balancing requirements that are\nthe cornerstone of the DDM framework.\nAs discussed in Refs.~\\cite{DDM1,DDM2}, these balancing requirements may be expressed as follows.\nFirst, we use our relation between decay widths $\\Gamma$ and masses $m$ in order\nto express our abundance function $\\Omega(m)$ \nand density-of-states function $n(m)$ \nin terms of $\\Gamma$ rather than $m$.\nNote that while  $\\Omega(m)$ and $n(m)$ are each \ndensities {\\it per unit mass},\nwhat we now seek are \nthe corresponding densities $\\Omega(\\Gamma)$ and $n(\\Gamma)$ \n {\\it per unit decay width}:\n\n", "index": 45, "text": "\\begin{equation}\n  \\Omega(\\Gamma) ~=~ \\Omega(m) \\left|\\frac{dm}{d\\Gamma}\\right|~,~~~\n  n(\\Gamma) ~=~ n(m) \\left|\\frac{dm}{d\\Gamma}\\right|~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\Omega(\\Gamma)~{}=~{}\\Omega(m)\\left|\\frac{dm}{d\\Gamma}\\right|~{},~{}~{}~{}n(%&#10;\\Gamma)~{}=~{}n(m)\\left|\\frac{dm}{d\\Gamma}\\right|~{}.\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>|</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>m</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi></mrow></mfrac><mo rspace=\"5.8pt\">|</mo></mrow></mrow></mrow><mo rspace=\"12.4pt\">,</mo><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">=</mo><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>|</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>m</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi></mrow></mfrac><mo rspace=\"5.8pt\">|</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nserves as a good  rudimentary criterion for assessing\nwhether decay widths are balanced against abundances in the appropriate manner to yield\na viable DDM ensemble.\n\nFor the random toy model we have presented here, the abundance function $\\Omega(m)$ and \ndensity-of-states function $n(m)$, expressed as functions of the constituent mass $m$, \nare given in Eqs.~(\\ref{eq:AbundanceInTermsOfOmega0}) and~(\\ref{eq:DensityOfStateswithm}) for\n$N\\gg 1$, respectively.  \nLikewise, the result in Eq.~(\\ref{eq:DecayRate}) implies that \n$m \\propto \\Gamma^{1/3}$, whereupon we see that $|dm/d\\Gamma| = \\Gamma^{-2/3}$.\nAs discussed above, $\\Omega_i \\propto m_i^{-2}$\nin the $m_i \\ll m_\\chi$ limit; \nthus in this limit we have $\\Omega(m) \\propto \\Gamma^{-2/3}$\nand $\\Omega(\\Gamma)\\propto \\Gamma^{-4/3}$.\nWe therefore find $\\alpha = -4/3$ \nfor this toy model.  By contrast, the density-of-states\nfunction for the Wigner semicircle distribution which emerges for large $N$\ndoes not scale with $m$ according to a power law $n(m) \\propto \\Gamma^\\beta$ \nwith a constant index $\\beta$, but rather according to a relation\n$n(m) \\propto \\Gamma^{\\delta(m)}$ with a variable index $\\delta(m)$.\nSince $n(m)$ decreases monotonically with $m$, this variable index is bounded from\nabove:   $\\delta(m) \\leq 0$.  \nThis implies a corresponding bound \n$\\beta(\\Gamma) \\leq -2/3$ on the variable index $\\beta(\\Gamma)$.  \nOur random toy model therefore has\n\n", "itemtype": "equation", "pos": 70002, "prevtext": "\nGiven these new functions, \nit was then shown in Ref.~\\cite{DDM1} that if \n$\\Omega(\\Gamma)$ scales with $\\Gamma$ according to \n$\\Omega(\\Gamma) \\propto \\Gamma^\\alpha$ for some scaling coefficient $\\alpha$,\nand if  $n(\\Gamma) \\propto \\Gamma^\\beta$ for some scaling coefficient $\\beta$,\nthen the requirement\n\n", "index": 47, "text": "\\begin{equation}\n         x ~\\equiv~ \\alpha + \\beta ~{\\lower.7ex\\hbox{$\\;\\stackrel{\\textstyle<}{\\sim}\\;$}} ~ -1~\n\\label{criterion}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"x~{}\\equiv~{}\\alpha+\\beta~{}{\\lower 3.01pt\\hbox{$\\;\\stackrel{\\textstyle&lt;}{\\sim%&#10;}\\;$}}~{}-1~{}\" display=\"block\"><mrow><mpadded width=\"+3.3pt\"><mi>x</mi></mpadded><mo rspace=\"5.8pt\">≡</mo><mrow><mi>α</mi><mo>+</mo><mpadded width=\"+3.3pt\"><mi>β</mi></mpadded></mrow><mpadded lspace=\"2.8pt\" width=\"+6.1pt\"><mpadded depth=\"+3.0pt\" height=\"-3.0pt\" voffset=\"-3.0pt\"><mover><mo movablelimits=\"false\">∼</mo><mo mathsize=\"142%\" stretchy=\"false\">&lt;</mo></mover></mpadded></mpadded><mrow><mo>-</mo><mpadded width=\"+3.3pt\"><mn>1</mn></mpadded></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nand this satisfies Eq.~(\\ref{criterion}) for all values of $\\Gamma$.  We thus conclude that our random\nensemble indeed displays an appropriate balancing between lifetimes and abundances, as needed in order to serve as\na potentially viable DDM ensemble.\n\nIt is important to note that this success is not merely \nrestricted to situations in which our decay widths are dominated by dimension-five operators,\nsuch as we have considered above.\nIn general, if $d$ is the dimension of the dominant decay operator\nand the daughter particles are light,\ndimensional analysis implies that \n$\\Gamma \\propto m^{2d-7} / \\Lambda^{2d-8}$.\nRepeating the above steps assuming $\\Omega\\propto m^{-2}$ \nthen yields $\\alpha = (6-2d)/(2d-7)$ and $\\beta \\leq (8-2d)/(2d-7)$,\nwhereupon we see that $x=\\alpha+\\beta \\leq -2$, exactly as before.\nThus the suitability of our random ensemble to serve as a DDM ensemble\nis a fairly robust phenomenon. \n\n\nA few additional comments are in order.  First of all, while we have taken the field \n$\\psi$ into which the ensemble constituents annihilate to be a dark-sector fermion\nfor concreteness, there is nothing special about this choice.  For example, \nessentially none of our results would change were we to have taken $\\psi$ to be a \nscalar.  Indeed, the result in Eq.~(\\ref{eq:AbundanceInTermsOfOmega0}) does not \ndepend on the spin of $\\psi$.  Since the coupling $g_\\psi$ is independent \nof $m_\\chi$, the scaling of $\\langle \\sigma_A^i\\rangle$ with $m_i$ is determined \nby dimensional analysis alone.  Moreover, $\\psi$ need not be a dark-sector particle\nat all.  For example, a SM fermion could potentially play the role of $\\psi$, \nprovided that phenomenological constraints from indirect detection, collider physics, \n{{\\it etc}.\\/}, are satisfied.    \n\nFinally, we observe that it is possible to get a sense of the overall mass scale for\nthe DDM ensemble constituents for which a thermal relic density can be successfully \nobtained by analogy with the case of a standard WIMP.\nOnce again, we focus our attention on the perturbative regime and take $m_i \\ll m_\\chi$\nfor all $\\phi_i$, so that $\\Omega_i \\propto m_i^{-2}$.  In the limit in which \n$M \\gg \\sqrt{\\xi_1}$ and the masses of the $\\phi_i$ are approximately degenerate ---\n{{\\it i.e.}\\/}, $m_i \\approx m_0$ for all $\\phi_i$ --- we find that the total abundance of the \nensemble takes the form\n\n", "itemtype": "equation", "pos": 71570, "prevtext": "\nserves as a good  rudimentary criterion for assessing\nwhether decay widths are balanced against abundances in the appropriate manner to yield\na viable DDM ensemble.\n\nFor the random toy model we have presented here, the abundance function $\\Omega(m)$ and \ndensity-of-states function $n(m)$, expressed as functions of the constituent mass $m$, \nare given in Eqs.~(\\ref{eq:AbundanceInTermsOfOmega0}) and~(\\ref{eq:DensityOfStateswithm}) for\n$N\\gg 1$, respectively.  \nLikewise, the result in Eq.~(\\ref{eq:DecayRate}) implies that \n$m \\propto \\Gamma^{1/3}$, whereupon we see that $|dm/d\\Gamma| = \\Gamma^{-2/3}$.\nAs discussed above, $\\Omega_i \\propto m_i^{-2}$\nin the $m_i \\ll m_\\chi$ limit; \nthus in this limit we have $\\Omega(m) \\propto \\Gamma^{-2/3}$\nand $\\Omega(\\Gamma)\\propto \\Gamma^{-4/3}$.\nWe therefore find $\\alpha = -4/3$ \nfor this toy model.  By contrast, the density-of-states\nfunction for the Wigner semicircle distribution which emerges for large $N$\ndoes not scale with $m$ according to a power law $n(m) \\propto \\Gamma^\\beta$ \nwith a constant index $\\beta$, but rather according to a relation\n$n(m) \\propto \\Gamma^{\\delta(m)}$ with a variable index $\\delta(m)$.\nSince $n(m)$ decreases monotonically with $m$, this variable index is bounded from\nabove:   $\\delta(m) \\leq 0$.  \nThis implies a corresponding bound \n$\\beta(\\Gamma) \\leq -2/3$ on the variable index $\\beta(\\Gamma)$.  \nOur random toy model therefore has\n\n", "index": 49, "text": "\\begin{equation}\n  x(\\Gamma) ~\\leq~ -2~,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"x(\\Gamma)~{}\\leq~{}-2~{},\" display=\"block\"><mrow><mrow><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.8pt\">≤</mo><mrow><mo>-</mo><mpadded width=\"+3.3pt\"><mn>2</mn></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "  \nFor a standard WIMP which receives its abundance via thermal freeze-out, the usual \nconstraint that arises due to the requirement that the annihilation cross-section be \nperturbative is $m_{\\mathrm{WIMP}} \\lesssim 300~{\\text{TeV}}$~\\cite{GriestMassLimit}.\nThe corresponding constraint on a DDM ensemble of this sort in the degenerate limit\nin which the $m_i$ are approximately equal becomes\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nand this satisfies Eq.~(\\ref{criterion}) for all values of $\\Gamma$.  We thus conclude that our random\nensemble indeed displays an appropriate balancing between lifetimes and abundances, as needed in order to serve as\na potentially viable DDM ensemble.\n\nIt is important to note that this success is not merely \nrestricted to situations in which our decay widths are dominated by dimension-five operators,\nsuch as we have considered above.\nIn general, if $d$ is the dimension of the dominant decay operator\nand the daughter particles are light,\ndimensional analysis implies that \n$\\Gamma \\propto m^{2d-7} / \\Lambda^{2d-8}$.\nRepeating the above steps assuming $\\Omega\\propto m^{-2}$ \nthen yields $\\alpha = (6-2d)/(2d-7)$ and $\\beta \\leq (8-2d)/(2d-7)$,\nwhereupon we see that $x=\\alpha+\\beta \\leq -2$, exactly as before.\nThus the suitability of our random ensemble to serve as a DDM ensemble\nis a fairly robust phenomenon. \n\n\nA few additional comments are in order.  First of all, while we have taken the field \n$\\psi$ into which the ensemble constituents annihilate to be a dark-sector fermion\nfor concreteness, there is nothing special about this choice.  For example, \nessentially none of our results would change were we to have taken $\\psi$ to be a \nscalar.  Indeed, the result in Eq.~(\\ref{eq:AbundanceInTermsOfOmega0}) does not \ndepend on the spin of $\\psi$.  Since the coupling $g_\\psi$ is independent \nof $m_\\chi$, the scaling of $\\langle \\sigma_A^i\\rangle$ with $m_i$ is determined \nby dimensional analysis alone.  Moreover, $\\psi$ need not be a dark-sector particle\nat all.  For example, a SM fermion could potentially play the role of $\\psi$, \nprovided that phenomenological constraints from indirect detection, collider physics, \n{{\\it etc}.\\/}, are satisfied.    \n\nFinally, we observe that it is possible to get a sense of the overall mass scale for\nthe DDM ensemble constituents for which a thermal relic density can be successfully \nobtained by analogy with the case of a standard WIMP.\nOnce again, we focus our attention on the perturbative regime and take $m_i \\ll m_\\chi$\nfor all $\\phi_i$, so that $\\Omega_i \\propto m_i^{-2}$.  In the limit in which \n$M \\gg \\sqrt{\\xi_1}$ and the masses of the $\\phi_i$ are approximately degenerate ---\n{{\\it i.e.}\\/}, $m_i \\approx m_0$ for all $\\phi_i$ --- we find that the total abundance of the \nensemble takes the form\n\n", "index": 51, "text": "\\begin{equation}\n  \\Omega_{\\mathrm{tot}} ~\\propto~ \\frac{N m_\\chi^4}{g_0^2 g_\\psi^2 m_0^2}~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\Omega_{\\mathrm{tot}}~{}\\propto~{}\\frac{Nm_{\\chi}^{4}}{g_{0}^{2}g_{\\psi}^{2}m_%&#10;{0}^{2}}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi mathvariant=\"normal\">Ω</mi><mi>tot</mi></msub></mpadded><mo rspace=\"5.8pt\">∝</mo><mpadded width=\"+3.3pt\"><mfrac><mrow><mi>N</mi><mo>⁢</mo><msubsup><mi>m</mi><mi>χ</mi><mn>4</mn></msubsup></mrow><mrow><msubsup><mi>g</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>g</mi><mi>ψ</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>m</mi><mn>0</mn><mn>2</mn></msubsup></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\n \n\n\n\\section{Indirect-Detection Signals\\label{sec:IndirectDet}}\n\n\n\nWe now discuss one possible observational signal which arises in this DDM scenario.\nIn particular, we examine the spectrum of high-energy photons produced by\nthe annihilation and decay of the $\\phi_i$.\nIn principle, contributions to the photon spectrum can arise in this model both from\nthe dark-matter decay process $\\phi_i \\rightarrow \\gamma \\gamma$ and from the \nannihilation process $\\phi_i^* \\phi_i \\rightarrow \\bar{\\psi} \\psi$, followed by the\ndecay of $\\bar{\\psi}$ and $\\psi$ and into SM particles. \nFor simplicity, because the annnihilation contribution depends on additional model \ninputs not directly related to the decay widths or abundances of the $\\phi_i$ --- and, \nin particular, on the decay properties of $\\psi$ --- we concentrate on the decay \ncontribution.  \n \nUnder the assumption that the operator in Eq.~(\\ref{eq:DecayOperatorVEVed}) \ndominates the width of each of the $\\phi_i$, the primary injection \nspectrum of photons from dark-matter decay --- {{\\it i.e.}\\/}, the differential photon flux \nper unit energy $E_\\gamma$, including the individual contributions \nfrom all ensemble constituents --- takes the form\n\n", "itemtype": "equation", "pos": 74499, "prevtext": "  \nFor a standard WIMP which receives its abundance via thermal freeze-out, the usual \nconstraint that arises due to the requirement that the annihilation cross-section be \nperturbative is $m_{\\mathrm{WIMP}} \\lesssim 300~{\\text{TeV}}$~\\cite{GriestMassLimit}.\nThe corresponding constraint on a DDM ensemble of this sort in the degenerate limit\nin which the $m_i$ are approximately equal becomes\n\n", "index": 53, "text": "\\begin{equation}\n  m_i ~\\lesssim ~ \\frac{300~{\\text{TeV}}}{N}~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"m_{i}~{}\\lesssim~{}\\frac{300~{}{\\text{TeV}}}{N}~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi>m</mi><mi>i</mi></msub></mpadded><mo rspace=\"5.8pt\">≲</mo><mpadded width=\"+3.3pt\"><mfrac><mrow><mpadded width=\"+3.3pt\"><mn>300</mn></mpadded><mo>⁢</mo><mtext>TeV</mtext></mrow><mi>N</mi></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05094.tex", "nexttext": "\nThe overall normalization of this \ninjection spectrum depends on the astrophysical properties of the object(s) \nunder observation.  Interesting possibilities might include, {{\\it e.g.}\\/}, the galactic center \nand the halos of Milky-Way dwarf galaxies.  However, we can assume that the \nlocal energy densities \nof the $\\phi_i$ within the object(s)\nunder study are proportional to the corresponding cosmological energy densities $\\rho_i$.\nIn this case, the {\\it shape}\\/ of the injection spectrum depends on particle-physics\nconsiderations alone.   \n\n\\begin{figure*}[t]\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{FigMX0_1.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{FigMX1.pdf}~~~\n  \\includegraphics[width=0.3\\textwidth, keepaspectratio]{FigMX10.pdf}\n  \\caption{The normalized photon spectra associated with a set of benchmark DDM models\n     which experience decays through the operator in Eq.~(\\ref{eq:DecayOperatorVEVed}).\n     In each case, the DDM ensemble is characterized by the parameter choices \n     $N=100$, $M=10$~GeV, and $\\sqrt{\\xi_1 v^2} = \\sqrt{2}$~TeV, while  the left, center, and \n     right panels show the results obtained for\n     the cosmological abundances $\\Omega_i$ \n     that would result from $U(1)_\\chi$ gauge-boson masses \n     $m_\\chi = 100$~GeV, $1$~TeV, and $10$~TeV, respectively.  \n     Given the inherent randomness in the $\\phi_i$ mass matrix and the coupling parameters \n     $\\beta_i$ in Eq.~(\\ref{eq:DecayOperatorVEVed}), the green curve appearing in \n     each panel represents one possible spectrum which might be observed at a gamma-ray \n     detector with a Gaussian energy resolution of $\\Delta E_\\gamma / E_\\gamma = 0.09$.\n    The green curves in all three panels correspond to the same choice of\n    underlying random parameters.\n      By contrast, the orange curve appearing in each panel represents the corresponding \n     ``baseline'' injection spectrum obtained by taking the analytic expression for $n_{\\rm WS}(m)$ \n     as the density of states for the ensemble and by taking a universal coupling \n     $|\\beta_i| = N^{-1/2}$ in Eq.~(\\ref{eq:DecayOperatorVEVed}), while ignoring \n     detector effects.}\n  \\label{fig:DMDecaySpectrum}\n\\end{figure*}\n\nWe now illustrate the qualitative features which arise in the photon spectrum of \nscenarios of this sort.\nIn Fig.~\\ref{fig:DMDecaySpectrum}, we display the contribution to the photon \nflux from $\\phi_i$ decay in a set of benchmark DDM models with $N=100$, $M = 10$~GeV, and \n$\\sqrt{\\xi_1 v^2} = \\sqrt{2}$~TeV.~  The left, center, and right panels\nof Fig.~\\ref{fig:DMDecaySpectrum} correspond to $U(1)_\\chi$ gauge-boson masses of \n$m_\\chi = 100$~GeV, $1$~TeV, and $10$~TeV, respectively, where these\nmasses enter into the calculation of the cosmological abundances $\\Omega_i$ in\nEq.~(\\ref{abund}).  \nThe green curve in each panel represents one possible spectrum of signal events \nwhich might be observed by a gamma-ray detector with a Gaussian energy \nresolution $\\Delta E_\\gamma / E_\\gamma = 0.09$, given the inherent randomness \nin the $\\phi_i$ mass matrix and the coupling parameters $\\beta_i$.   \nNote that we have normalized \neach spectrum shown such that the total area under the curve is unity.   \nBy contrast, the orange curve shown \nin each panel represents the corresponding injection spectrum obtained by taking \nthe analytic expression for $n_{\\mathrm{WS}}(m)$ as the density of states for\nthe ensemble, and by taking a universal coupling $\\beta_i = N^{-1/2}$ between\neach $\\phi_i$ and the photon field, all while ignoring detector effects.  \nThus, the orange curve can be viewed as representing the overall reference ``baseline'' \naround which the corresponding actual injection spectrum fluctuates due \nto the inherent randomness in the masses and couplings.\n\nThe gamma-ray spectra shown in Fig.~\\ref{fig:DMDecaySpectrum} display a \nnumber of distinctive features.  One such feature is the characteristic shape of the \nspectral baseline ({{\\it i.e.}\\/}, the orange curve), which is primarily determined \nby the density-of-states function $n_{\\mathrm{WS}}(n)$ for our statistical DDM ensemble.\nIndeed, in the center and right panels of the figure, the influence of this \ndensity-of-states function on the spectral envelope is unmistakable.\nIn the left panel, which corresponds to the case in which $m_\\chi = 100$~GeV, \nthe shape of the envelope is modified at energies around $E_\\gamma \\approx 25$~GeV\ndue to the effect of the annihilation resonance, which suppresses the abundances\n(and therefore the photon-flux contributions) of ensemble constituents with \nmasses $m_i \\sim m_\\chi/2 \\approx 50$~GeV.  ~Nevertheless, even in this case, the\ninfluence of the density-of-states function on the spectral baseline is still  \nevident --- especially at large $E_\\gamma$.\n   \nAnother distinctive feature which emerges in the gamma-ray spectra of statistical \nDDM ensembles is the pattern of fluctuations in the observed spectrum around the \nspectral baseline.\nIndeed, in the regime in which the scale of the splitting between the $m_i$ exceeds the energy resolution\nof the detector,\nsignificant fluctuations are apparent across the relevant\nrange of $E_\\gamma$.  \nThese fluctuations (along with\ndetector effects) can obscure features which would otherwise be apparent in the gamma-ray \nspectrum.  For example, the pronounced dip in the spectral baseline due to the \nannihilation resonance is only partially evident in the observed gamma-ray spectrum for the \ncorresponding DDM ensemble.   \nBy contrast, we see that in the regime in which $E_\\gamma$ is large and the \nenergy resolution of the detector is less than or comparable to the rough scale of the splitting\nbetween the \nmass eigenvalues $m_i$, the effect of the random alignment of the $\\langle B_i\\rangle$ is \nsmeared out by detector effects.  \nConsequently, in this regime, the observed spectrum is reasonably well approximated by the spectral baseline\nup to the cutoff at $E_\\gamma \\approx 100$~GeV, which corresponds to the upper limit of the Wigner-Semicircle distribution for this choice of parameters.   The divergence between the observed spectrum and the spectral baseline \nabove this cutoff is solely a result of detector smearing.\n\n\nWe note that the flux spectrum shown in left panel of \nFig.~\\ref{fig:DMDecaySpectrum} displays fluctuations with magnitudes as large as \n50\\% or more of the overall baseline.  This is comparable to the fractional uncertainty \nin the measurement of the isotropic diffuse gamma-ray background at \n$E \\sim 100$~GeV~\\cite{Ackermann:2014usa}.  This implies that the potentially \nidentifiable signals of statistical DDM ensembles of this sort may manifest themselves \nnot only in the distinctive shape of the overall baseline associated with the gamma-ray spectrum, \nbut also in the pattern of fluctuations in that spectrum.\n\n\n\n\n\n\n\\section{Conclusions\\label{sec:Conclusion}}\n\n\nIn this paper, we studied the possibility that the properties of the dark sector\nare dominated by processes which are essentially random.\nWe considered a dark sector composed of an ensemble \nof $N$ individual \ncomponents\nwith differing masses, cosmological abundances, and couplings\nto the SM,\nand constructed a toy model in which the mass spectrum associated\nwith this ensemble is determined through an essentially random\nbreaking of an internal $SU(N)$ dark-sector symmetry.\nEven though this mass spectrum is determined randomly,\nwe were nevertheless\nable to bring the machinery of random-matrix theory to bear in order to\nderive predictions for the probability distribution of mass eigenvalues\nfor these component fields.  In this way, we were able to obtain a statistical prediction for a\ndensity-of-states function $n(m)$ \nfor the ensemble as a whole --- a prediction \nwhich grows more and more robust as the number $N$ of ensemble constituents increases.  \nMoreover, we found that this emergent density of states decreases as a function of mass and actually\nhas an upper limit $m_{\\rm max}$ beyond which $n(m)=0$ --- behavior which is quite unlike\nthe density-of-states functions for all other DDM ensembles which have previously been \ndiscussed in the literature.\n\nGiven these results for the dark-sector mass spectrum,\nwe then proceeded to demonstrate that \na set of corresponding cosmological abundances and decay widths for the \nensemble constituents can be generated via well-established mechanisms --- thermal \nfreeze-out and the controlled breaking of a stabilizing symmetry, respectively.\nWe then found that in scenarios of this sort, the fundamental scaling relations\nwhich govern the ensemble satisfy the basic criteria to be interpreted as potentially\nviable DDM ensembles --- ensembles in which cosmological abundances and decay widths satisfy\ncertain balancing relations across all constituents.\nThus, we were able to demonstrate that randomness in the dark sector coexists \nquite naturally with DDM.~\nFinally, we explored one possible observational signature of random DDM ensembles\nof this sort, namely the indirect detection of high-energy gamma rays produced \nfrom the decays of the ensemble constituents, and evaluated the prospects for the \ndetection of such signals.  \n\nThere are many ways in which the analysis of this paper might be generalized and extended.\nAs we have discussed in the Introduction,\nthere are three aspects of a dark-sector ensemble which are critical \nin determining the resulting phenomenology:\nthe spectrum of constituent masses, the spectrum of constituent cosmological abundances,\nand the spectrum of constituent decay widths into SM states.\nWhile the first of these describes the properties of the ensemble unto itself,\nthe second and third depend upon further information concerning how the ensemble \nemerges within a particular cosmological history\nand/or couples to SM states.\nIn this paper, we investigated the case in which only the first of these --- namely\nthe mass spectrum --- is determined randomly.\nIndeed, as have seen, the simple random mechanism which gives rise to\nthe density-of-states function for our ensemble is essentially unrelated to the \nphysics which determines the abundances and decay widths of the ensemble constituents.\n\nGiven this,\nwe may view our random mechanism as a fundamental ``kernel'' for establishing an\nensemble with a particular density-of-states function, a kernel which can be incorporated as\nan ingredient in any number of alternative scenarios.  As discussed in \nSect.~\\ref{sec:RandomMatrixGeneration}, the fact that the density of states for such\nensembles decreases with increasing $m$ implies that this ``kernel'' should be compatible\nwith a wide variety of scenarios for abundance and decay-width generation.  Indeed,\na broad class of models could be developed around ensembles of this sort  \nwhose detailed phenomenological implications might exhibit interesting and unanticipated characteristics.\nIt would also be interesting to explore further scenarios in which the\nmechanisms for generating cosmological abundances and SM decay widths  \nare themselves based on random processes.\n\nIt would also be interesting to consider more broadly the methods \nby which randomness in the dark sector might be detected.\nIdentifying characteristic features in the gamma-ray \nspectra of those statistical DDM ensembles,\nas we have discussed in Sect.~\\ref{sec:IndirectDet}, \nmay represent only one possible way of distinguishing\nbetween such ensembles experimentally.  Such ensembles clearly have a rich phenomenology\nand could potentially give rise to characteristic signals in the kinematic distributions\nof event-shape variables at colliders and as well as in distinctive recoil-energy spectra observed at\ndirect-detection experiments.\n\n\nFinally, near the end of Sect.~\\ref{sec:RandomMatrixGeneration},\nwe stated that a single universe can only exhibit one mass spectrum for the dark sector.\nIn other words, as stated there, we get only ``one roll of the dice''.\nOf course, there are certain situations in which this is not strictly true.  \nFor example, if the random effects which ultimately give rise to our dark-sector mass spectrum \nare associated with a first-order symmetry-breaking phase transition,\nthen different regions of spacetime could each correspond to their own distinct roll of the dice.\nLikewise, multiple rolls of the dice could also arise if we live a full-fledged multiverse,\nas recent developments in string theory suggest. \nThese questions are especially critical in the case of differing dark sectors\nbecause the dark sector carries a significant matter-based energy density and thus its properties play \na major role in the time evolution of the universe.\n\nIn either case, however, the end result would be\na series of different universes (or regions of spacetime) with different dark sectors,\neach existing within its own spatial domain and separated from the others \nby domain walls.   Such domain-wall topological defects would undoubtedly give rise to dramatic effects of their\nown, even beyond those associated with the properties of the different dark sectors they separate,\nand consequently there are tight phenomenological and astrophysical/cosmological\nconstraints that can already be placed on such scenarios coming from CMB anistropy limits\nand other energy-density constraints.\nHowever, if the only differences between the different universes are those that \nresult from different random throws of the \n$SU(N)$-breaking dice in the dark sector, then the $n_{\\rm SU(N)}$ probability distribution functions\nwe have discussed in this paper might have an even greater relevance \nthan we have imagined here, \nas averages across the entire universe or multiverse as a whole. \n\n\n\n\n\n\n\\begin{acknowledgments}\n\n\n\nWe would like to thank Jonathan Feng and Shrihari Gopalakrishna for useful discussions.\nKRD is supported in part by the Department of Energy under Grant DE-FG02-13ER41976\nand by the National Science Foundation\nthrough its employee IR/D program.  JK is supported in part by NSF CAREER grant \nPHY-1250573.  BT is supported in part by an internal research award from Reed College.   \nKRD, JK, and BT would also like to thank the Center for Theoretical Underground Physics \nand Related Areas (CETUP$^\\ast$) in Lead, South Dakota, for hospitality during the 2015 Summer Program.  The opinions\nand conclusions expressed herein are those of the authors, and do not represent any \nfunding agencies.\n\n\\end{acknowledgments}\n\n\n\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{DDM1}\n  K.~R.~Dienes and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 083523 (2012)\n  [arXiv:1106.4546 [hep-ph]].\n  \n\n\\bibitem{DDM2}\n  K.~R.~Dienes and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 083524 (2012)\n  [arXiv:1107.0721 [hep-ph]].\n  \n\n\\bibitem{DDMAxion}\n  K.~R.~Dienes and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 86}, 055013 (2012)\n  [arXiv:1203.1923 [hep-ph]].\n  \n\n\\bibitem{DDMLHC}\n  K.~R.~Dienes, S.~Su and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 86}, 054008 (2012)\n  [arXiv:1204.4183 [hep-ph]].\n  \n\n\\bibitem{DDMDD}\n  K.~R.~Dienes, J.~Kumar and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 86}, 055016 (2012)\n  [arXiv:1208.0336 [hep-ph]].\n  \n\n\\bibitem{DDMAMS}\n  K.~R.~Dienes, J.~Kumar and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 88}, 103509 (2013)\n  [arXiv:1306.2959 [hep-ph]].\n  \n\n\\bibitem{CutsAndCorrelations}\n  K.~R.~Dienes, S.~Su and B.~Thomas,\n  \n  Phys.\\ Rev.\\ D {\\bf 91}, 054002 (2015)\n  [arXiv:1407.2606 [hep-ph]].\n  \n\n\n\\bibitem{DDMComplementarity} \n  K.~R.~Dienes, J.~Kumar, B.~Thomas and D.~Yaylali,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 114}, 051301 (2015)\n  \n  [arXiv:1406.4868 [hep-ph]].\n  \n\n\n\\bibitem{DDMJeff} \n  K.~R.~Dienes, J.~Kost and B.~Thomas,\n  \n  arXiv:1509.00470 [hep-ph] (to appear in {\\it Phys.\\ Rev.}\\/~{\\bf D}).\n  \n\n\n\n\\bibitem{DDMString}\n  K.~R.~Dienes, F.~Huang, S.~Su, and B.~Thomas,\n  to appear.\n\n\\bibitem{DesigningDDMPaper}\n  K.~R.~Dienes, J.~Fennick, J.~Kumar, and B.~Thomas,\n  to appear.\n\n\n\\bibitem{Ade:2015xua}\n  P.~A.~R.~Ade {\\it et al.} [Planck Collaboration],\n  \n  arXiv:1502.01589 [astro-ph.CO].\n  \n\n\n\\bibitem{Ackerman:mha}\n  L.~Ackerman, M.~R.~Buckley, S.~M.~Carroll and M.~Kamionkowski,\n  \n  Phys.\\ Rev.\\ D {\\bf 79}, 023519 (2009)\n  [arXiv:0810.5126 [hep-ph]].\n  \n\n\\bibitem{Mehta}\n  M.~L.~Mehta, {\\it Random Matrices}\\/ (3rd ed.),\n  Amsterdam, Elsevier/Academic Press, 2004.\n\n\\bibitem{LloydPagels}\n  S.~Lloyd and H.~Pagels, \n  \n  Ann.\\ Phys.\\ {\\bf 188} 186 (1988).\n\n\\bibitem{ZyczkowskiSommers}\n  K.~Zyczkowski and H.~Sommers, \n  \n  J.\\ Phys.\\ A {\\bf 34} 7111 (2001).\n\n\\bibitem{Akemann}\n  G.~Akemann, G.~M.~Cicuta, L.~Molinari, and G.~Vernizzi,\n  \n  Phys.\\ Rev.\\ E {\\bf 59} 1489 (1999).\n\n\\bibitem{Delannay}\n  R.~Delannay and G.~Le Ca\\\"{e}r,\n  \n  J.\\ Phys.\\ A {\\bf 33} 2611 (2000).\n\n\\bibitem{Wigner}\n  E.~Wigner,\n  \n  Annals Math.\\ {\\bf 62}, 548 (1955);\n  \n  Annals Math.\\ {\\bf 67}, 325 (1958).\n\n\n\\bibitem{Slatyer:2012yq}\n  T.~R.~Slatyer,\n  \n  Phys.\\ Rev.\\ D {\\bf 87}, 123513 (2013)\n  [arXiv:1211.0283 [astro-ph.CO]].\n  \n  \n\n\\bibitem{GriestMassLimit}\n  K.~Griest and M.~Kamionkowski,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 64}, 615 (1990).\n  \n  \n\n\n\n\\bibitem{Ackermann:2014usa}\n  M.~Ackermann {\\it et al.} [Fermi-LAT Collaboration],\n  \n  Astrophys.\\ J.\\  {\\bf 799}, 86 (2015)\n  [arXiv:1410.3696 [astro-ph.HE]].\n  \n  \n\n\n\n  \n  \n  \n\n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 75780, "prevtext": "\n \n\n\n\\section{Indirect-Detection Signals\\label{sec:IndirectDet}}\n\n\n\nWe now discuss one possible observational signal which arises in this DDM scenario.\nIn particular, we examine the spectrum of high-energy photons produced by\nthe annihilation and decay of the $\\phi_i$.\nIn principle, contributions to the photon spectrum can arise in this model both from\nthe dark-matter decay process $\\phi_i \\rightarrow \\gamma \\gamma$ and from the \nannihilation process $\\phi_i^* \\phi_i \\rightarrow \\bar{\\psi} \\psi$, followed by the\ndecay of $\\bar{\\psi}$ and $\\psi$ and into SM particles. \nFor simplicity, because the annnihilation contribution depends on additional model \ninputs not directly related to the decay widths or abundances of the $\\phi_i$ --- and, \nin particular, on the decay properties of $\\psi$ --- we concentrate on the decay \ncontribution.  \n \nUnder the assumption that the operator in Eq.~(\\ref{eq:DecayOperatorVEVed}) \ndominates the width of each of the $\\phi_i$, the primary injection \nspectrum of photons from dark-matter decay --- {{\\it i.e.}\\/}, the differential photon flux \nper unit energy $E_\\gamma$, including the individual contributions \nfrom all ensemble constituents --- takes the form\n\n", "index": 55, "text": "\\begin{equation}\n  \\frac{dN}{dE_\\gamma} ~\\propto~ \\sum_i \n    \\frac{\\Omega_i \\Gamma_i}{m_i} \\delta(m_i - 2E_\\gamma)~.\n\\label{abund}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\frac{dN}{dE_{\\gamma}}~{}\\propto~{}\\sum_{i}\\frac{\\Omega_{i}\\Gamma_{i}}{m_{i}}%&#10;\\delta(m_{i}-2E_{\\gamma})~{}.\" display=\"block\"><mrow><mrow><mpadded width=\"+3.3pt\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>N</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>γ</mi></msub></mrow></mfrac></mpadded><mo rspace=\"5.8pt\">∝</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi mathvariant=\"normal\">Γ</mi><mi>i</mi></msub></mrow><msub><mi>m</mi><mi>i</mi></msub></mfrac><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mi>i</mi></msub><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>E</mi><mi>γ</mi></msub></mrow></mrow><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]