[{"file": "1601.02348.tex", "nexttext": "  \n\nUsing standard values of mass and radius of canonical neutron stars and the observed \nluminosities of GX~304-1 in above equation, the magnetospheric radii were estimated\nto be $\\sim$5100 and 6300~km during first and second observations, respectively. \nThis confirmed that the pulsar magnetosphere was relatively small during the first\nobservation. Therefore, the streams of additional matter were present within the \nmagnetosphere and found to be closer to the pulsar during the first {\\it Suzaku} \nobservation.\n\nPulse-phase resolved spectroscopy of GX~304-1 during two Type~I outbursts \nshowed the presence of narrow streams of matter (higher value of N$_{H_2}$) at \nseveral pulse phase ranges. The presence of such streams of matter are interpreted \nas the cause of absorption dips detected in soft X-ray pulse profiles of the pulsar. \nSeveral such dips are seen in the pulse profiles of Be/X-ray binary pulsars during \nX-ray outbursts. Density and opacity of matter in these narrow streams decides the \nenergy dependence of the dips in the pulse profiles of these pulsars. During both \nthe observations, pulse-phase variation of covering fraction was found to be similar. \nWe suggest that the geometry or distribution of absorbing matter around the pulsar \nis probably similar during both observations but at different locations. \n\n\\subsection{Cyclotron line in GX~304-1}\n\nCyclotron absorption line or CRSF was clearly detected in the\nspectra of GX~304-1 during both the observations and was described \nwith pseudo-Lorentzian function (CYCLABS) in the continuum model. \nThese are absorption like features which appear in hard X-ray spectrum \n($\\sim$10-100~keV) through the resonant scattering of the photons with \nelectrons in strong magnetic field ($\\sim$10$^{12}$~G) near the poles of \nthe neutron star. The cyclotron line energy is related with the magnetic \nfield through the relation {\\it E$_{cyc}$=11.6B$_{12}\\times(1+z){^{-1}}$ \n(keV)} or 12-B-12 rule, where B$_{12}$ is the magnetic field in the unit \nof 10$^{12}$~G and $z$ is the gravitational red-shift. Detection of \nCRSF in the pulsar spectrum, therefore, provides  the direct measurement\nof the magnetic field of the neutron star. Though, CRSF was already detected \nin GX~304-1 (Yamamoto et al. 2011), {\\it Suzaku} observations \nat different source intensities provide an opportunity to \ninvestigate the luminosity dependence of the cyclotron line energy. \nThe cyclotron feature was detected at $\\sim$53 and 50~keV during 2010 August \nand 2012 January {\\it Suzaku} observations, respectively. The observed \ncyclotron absorption line energies are not significantly different.  \nHowever, it shows a positive dependence on the pulsar luminosity, as seen \nin Her~X-1 (Staubert et al. 2007). In some other cases such as 4U~0115+63 \n(Nakajima et al. 2006; Tsygankov et al. 2007), and V~0332+53 (Tsygankov et al. \n2010), a negative correlation is observed between the luminosity of pulsar \nand the cyclotron absorption line energy.\n\nAttempts have been made to explain the observed positive and negative \ncorrelation between pulsar luminosity and the cyclotron line \nenergy. A negative correlation is expected in super-critical regime \nwhere the source luminosity is higher than the critical luminosity \n(Becker et al. 2012; Mushtukov et al. 2015a). Above critical luminosity, \ndensity of infalling matter becomes so high that the particles start \ninteracting and decelerating through the formation of a radiation-pressure \ndominated shock above the neutron star surface. Cyclotron scattering features \nmost likely occur closer to the shock region. With increasing luminosity, the \nshock height drift upwards in the accretion column where relatively low \nstrength of magnetic field produces cyclotron feature at lower energy. It \nexplains negative correlation as observed in 4U~0115+63 and V~0332+53. However, \nthe positive correlation is predicated for a sub-critical regime e.g. below \ncritical luminosity. The pressure of accreting matter in this regime pushes \nhydrodynamical shock closer to the neutron star surface where increase in \nthe strength of magnetic field with luminosity results a positive correlation \nbetween the cyclotron line energy and luminosity (Staubert et al. 2007), as seen \nin Her~X-1 and GX~304-1. The 1-70 keV luminosity of GX~304-1 during first and \nsecond {\\it Suzaku} observations was estimated to be 2.3$\\times$10$^{37}$ \nand 1$\\times$10$^{37}$ergs~s$^{-1}$, respectively, which lies in the sub-critical \nregime (Mushtukov et al. 2015a) and expected to show a positive correlation  \n with cyclotron line energy. \n\n\nPoutanen et al. (2013) and Nishimura (2014) have proposed alternate models \nto describe the dependence of cyclotron absorption line energy on the source\nluminosity. In these models, it is argued that the formation of cyclotron line \nin direct spectrum is questionable due to the large gradient of magnetic field \nstrength along line forming region in the accretion column. However, cyclotron \nline (CRSF) can be formed in the reflected radiation from the surface of the \nneutron star where magnetic field gradient is relatively small (Poutanen et al. \n2013). It is widely believed that the accretion column height is linearly \ndependent on source luminosity ($>$10$^{37}$~ergs~s$^{-1}$) or accretion rate. \nAt higher luminosity, larger area on neutron star surface (from the poles with \nstrong magnetic field towards equator with weak field strength) is expected to \nbe illuminated for cyclotron interactions. This explains the observed \nanti-correlation between cyclotron line energy and luminosity, as seen in \nV~0332+53. However, Nishimura (2014) described the observed correlations by \nconsidering the changes in polar emission region, direction of photon \npropagation and the shock height. The negative correlation was interpreted \nin terms of shock region displacement whereas the positive correlation was \nexplained by using the changes in beam pattern. In case of GX~304-1 (present\nwork), the cyclotron absorption line width, depth and ratio of line width and \nenergy (W/E$_{cyl}$) show positive correlation with luminosity. The observed\npositive correlation between the cyclotron line energy and luminosity in \nGX~304-1, therefore, can be explained as due to the change in beam pattern,\nas described by Nishimura (2014). Alternatively, Mushtukov et al. (2015b) \ndiscussed the positive luminosity dependence of sub-critical X-ray pulsars \nlike GX~304-1 by studying the changes of plasma velocity profile in line-forming \nregion under influence of radiation pressure from the hot-spot. The cyclotron line \nenergy at a luminosity was determined by corresponding redshift from\nvelocity profile at a given height. This model successfully predicts \nthe positive luminosity correlation of cyclotron line energy for pulsars \nlike GX~304-1 along with cyclotron line width dependence on luminosity and\npulse phase variation of cyclotron line parameters, which were not being \ndiscussed in Nishimura (2014).    \n\nInvestigation of the change in cyclotron parameters with pulse phase \nof the pulsar provides important evidences to understand the emission \ngeometry as well as the magnetic field mapping around the neutron star. \nA comparative study of these parameters at different intensity levels \nduring several outbursts can also yield information about the changes \nin emission or accretion column geometry. Pulse-phase resolved spectroscopy \nof cyclotron absorption line is one of the interesting results of this work. \nDuring both {\\it Suzaku} observations of the pulsar, cyclotron energy and depth \nwere found significantly variable with pulse-phase. Change in cyclotron \nline parameters with pulse phase has also been seen in other X-ray pulsars such \nas Cen~X-3 (Burderi et al. 2000), GX~301-2 (Kreykenbohm et al. 2004), 1A~1118-61 \n(Maitra et al. 2012), A~0535+26, XTE~J1946+274, 4U~1907+09 (Maitra \\& Paul 2013), \nV~0332+53 (Lutovinov et al. 2015) and Cep~X-4 (Jaisawal \\& Naik 2015) with \n$\\sim$10-30\\%  variation in cyclotron energy. \n\nThe cyclotron line energy for GX~304-1 was found variable with phase up \nto 17\\% and 24\\% for first and second {\\it Suzaku} observations, respectively. \nHowever, the cyclotron line depth showed phase dependence within a factor of \n$\\sim$2.5 for both observations. Various simulations were performed to study the \ndependence of the cyclotron line on pulsar phases, assuming certain sets of \nrule and geometry in line forming region (Sch{\\\"o}nherr et al. 2007; Mukherjee \n\\& Bhattacharya 2012). These studies predicated that 10-30\\% variation  \nin cyclotron energy with phases can be resulted due to effects of viewing angle \nof accretion column or emission region. However, more than 30\\% changes in \ncyclotron energy is contributed by distortion in the magnetic field geometry.\nIn GX~304-1 (present work), cyclotron energy is found to be variable within \n24\\% for both observations which can be explained as effects of viewing angle \nor local distortion in the magnetic field in line forming region. We found that \nthe cyclotron energy and depth for both observations were peaking around the 1.0-1.1 \n(or 0.0-0.1) phase range, which lies closer to the peak of pulse profiles at \n$\\geq$35~keV. This result supports the effect of cyclotron resonance \nscattering on beaming pattern that changes the shape of the pulse profiles.    \n\nIn summary, the timing and spectral properties of GX~304-1 were presented by using \n{\\it Suzaku} observations during Type~I outbursts. Absorption dips were detected in the \npulse profiles at soft X-rays. These dips were originated due to obscuration/absorption \nof X-ray photons with narrow streams of accretion flow at certain pulsar phases.\nThe shape of pulse profiles was significantly changed at $\\geq$35~keV e.g. close\nto the cyclotron line energy. Significant pulse phase dependence of cyclotron line \nwas explained as the effects of viewing angle or the role of complicated magnetic \n field of the pulsar.    \n   \n\n\n\\section*{Acknowledgments}\n\nWe sincerely thank the referee for his/her valuable comments and suggestions which \nimproved the paper significantly. The research work at Physical Research Laboratory \nis funded by the Department of Space, Government of India. The authors would like to \nthank all the members of the Suzaku for their contributions in the instrument \npreparation, spacecraft operation, software development, and in-orbit instrumental \ncalibration. This research has made use of data obtained through HEASARC Online \nService, provided by the NASA/GSFC, in support of NASA High Energy Astrophysics \nPrograms.\n\n\n\n\\begin{thebibliography}{}\n\n\n\\bibitem[]{}Becker P., Klochkov D., Sch{\\\"o}nherr G., et al. 2012, A\\&A, 544, A123 \n\\bibitem[]{}Bradt H. V., Clark G. W., Dower R., Doxsey R., Hearn D. R., Jernigan J. G., et al. 1977, Nature, 269, 21\n\\bibitem[]{}Burderi L., Di Salvo T., Robba N. R., La Barbera A., Guainazzi M., 2000, ApJ, 530, 429\n\\bibitem[]{}Corbet R. H. D., Smale A. P., Menzies J. W., Branduardi-Raymont G., Charles P. A., \n            et al., 1986, MNRAS, 221, 961\n\\bibitem[]{}Devasia J., James M., Paul B., Indulekha K., 2011, MNRAS, 417, 348\n\\bibitem[]{}Endo T., Nagase F. and Mihara T., 2000, PASJ, 52, 223\n\\bibitem[]{}Ferrigno C., Falanga M., Bozzo E., Becker P. A., Klochkov D., Santangelo A., 2011, A\\&A, 532, A76\n\\bibitem[]{}Forman W., Jones C., Cominsky L., Julien P., Murray S., et al. 1978, ApJS, 38, 357\n\\bibitem[]{}Giacconi R., Murray S., Gursky H., Kellogg E., Schreier E., et al. 1974, ApJS, 27, 37\n\\bibitem[]{}Haefner R., 1988, Inf. Bull. Var. Stars, 3260, 1\n\\bibitem[]{}Jaisawal G. K. and Naik S., 2015, MNRAS, 453, L21\n\\bibitem[]{}Klochkov D., Doroshenko V., Santangelo A., Staubert R., Ferrigno C., et al. 2012, A\\&A, 542, L28\n\\bibitem[]{}Koyama K. et al., 2007, PASJ, 59, 23\n\\bibitem[]{}Kreykenbohm I., Wilms J., Coburn W. et al., 2004, A\\&A, 427, 975 \n\\bibitem[]{}Krimm H. A.,  et al., 2010, Astron. Telegram, 2538, 1\n\\bibitem[]{}Lutovinov A. A., Tsygankov S. S., Suleimanov V. F. et al., 2015, 448, 2175\n\\bibitem[]{}Maitra C., Paul B., Naik S., 2012, MNRAS, 420, 2307\n\\bibitem[]{}Maitra C. \\& Paul B., 2013, 771, 96\n\\bibitem[]{}Makishima K., Mihara T., Nagase F., Tanaka Y., 1999, ApJ, 525, 978\n\\bibitem[]{}Manousakis A., et al. 2008, Astron. Telegram, 1613\n\\bibitem[]{}Mason K. O., Murdin P. G., Parkes G. E., Visvanathan N., 1978, MNRAS, 184, 45P\n\\bibitem[]{}Maurer G. S., Johnson W. N., Kurfess J. D., Strickman M. S., 1982, ApJ, 254, 271\n\\bibitem[]{}Malacaria C., Klochkov D., Santangelo A., \\& Staubert R., 2015, A\\&A, 581, 121\n\\bibitem[]{}McClintock J. E., Ricker G. R., Lewin W. H. G., 1971, ApJ, 166, L73\n\\bibitem[]{}McClintock J. E., Rappaport S. A., Nugent J. J., Li F. K.,  1977, ApJ, 216, L15\n\\bibitem[]{}Mihara T., et al.  2010, Astron. Telegram, 2779\n\\bibitem[]{}Mitsuda K. et al., 2007, PASJ, 59, 1\n\\bibitem[]{}Mukherjee D., \\& Bhattacharya D., 2012, MNRAS, 420, 720\n\\bibitem[]{}Mushtukov A. A., Suleimanov V. F., Tsygankov S. S. and Poutanen J., 2015a, MNRAS, 447, 1847\n\\bibitem[]{}Mushtukov A. A., Tsygankov S. S., Serber A. V., Suleimanov V. F., Poutanen J., 2015b, MNRAS, 454, 2714\n\\bibitem[]{}Naik S., Dotani T., Terada Y., et al. 2008, ApJ, 672, 516\n\\bibitem[]{}Naik S., Paul B., Kachhara C., Vadawale S. V., 2011, MNRAS, 413, 241\n\\bibitem[]{}Naik S., Maitra C., Jaisawal G. K., Paul B., 2013, ApJ, 764, 158\n\\bibitem[]{}Naik S. \\& Jaisawal G. K., 2015, RAA, 15, 537\n\\bibitem[]{}Nakajima M., Mihara T., Makishima K., Niko H.,  2006, ApJ, 646, 1125\n\\bibitem[]{}Negueruela I., Reig P., Coe M. J., \\& Fabregat J., 1998, A\\&A, 336, 251\n\\bibitem[]{}Nishimura O, 2014, ApJ, 781, 30\n\\bibitem[]{}Parkes G. E., Murdin P. G., Mason K. O., 1980, MNRAS, 190, 537\n\\bibitem[]{}Paul B. \\& Naik S., 2011, Bull. Astron. Soc. India, 39, 429 \n\\bibitem[]{}Pietsch W., Oegelman H., Kahabka P., Collmar W., Gottwald M., 1986, A\\&A, 163, 93\n\\bibitem[]{}Priedhorsky W. C., Terrell J., 1983, ApJ, 273, 709\n\\bibitem[]{}Postnov K. A., Mironov A. I., Lutovinov A. A., Shakura N. I., Kochetkova A. Yu., Tsygankov S. S., et al. 2015, MNRAS, 446, 1013\n\\bibitem[]{}Poutanen J. et al., 2013, ApJ, 777, 115\n\\bibitem[]{}Sch{\\\"o}nherr G., et al. 2007, A\\&A, 472, 353\n\\bibitem[]{}Sch{\\\"o}nherr G., et al. 2014, A\\&A, 564, 8\n\\bibitem[]{}Staubert R., Shakura N. I., Postnov K., et al. 2007, A\\&A, 465, L25\n\\bibitem[]{}Sugizaki M., Yamamoto T., Mihara T., Nakajima M., \\& Makishima K., 2015, PASJ, 67, 73\n\\bibitem[]{}Takahashi T. et al., 2007, PASJ, 59, 35  \n\\bibitem[]{}Tanaka Y., 1986, in Proc. IAU Colloq. 89, Vol. 255, Radiation\n            Hydrodynamics in Stars and Compact Objects, ed. D. Mihalas \\& K.-H. A. Winkler  \n\\bibitem[]{}Titarchuk L., 1994, ApJ, 434, 313 \n\\bibitem[]{}Tsygankov S. S., Lutovinov A. A., Churazov E. M., \\& Sunyaev R. A., 2006, MNRAS, 371, 19\n\\bibitem[]{}Tsygankov S. S., Lutovinov A. A., Churazov E. M., \\& Sunyaev R. A., 2007, Astron. Lett., 33, 368\n\\bibitem[]{}Tsygankov S. S., Lutovinov A. A., \\& Serber A. V., 2010, MNRAS, 401, 1628\n\\bibitem[]{}Yamamoto T.  et al., 2009, Astron. Telegram, 2297, 1\n\\bibitem[]{}Yamamoto T., Sugizaki M., Mihara T., Nakajima M., Yamaoka K., et al. 2011, PASJ, 63, 751\n\\bibitem[]{}Yamamoto T.,  et al., 2012, Astron. Telegram, 3856, 1\n\\bibitem[]{}White N. E., Swank J. H.  \\& Holt S. S., 1983, ApJ, 270, 711\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\date{}\n\n\\maketitle\n\n\\begin{abstract}\n\nWe report the timing and spectral properties of Be/X-ray binary pulsar \nGX~304-1 by using two {\\it Suzaku} observations during its 2010 August and \n2012 January X-ray outbursts. Pulsations at $\\sim$275~s were clearly \ndetected in the light curves from both the observations. Pulse profiles \nwere found to be strongly energy-dependent. During 2010 observation, \nprominent dips seen in soft X-ray ($\\leq$10 keV) pulse profiles were \nfound to be absent at higher energies. However, during 2012 observation, \nthe pulse profiles were complex due to the presence of several dips.\nSignificant changes in the shape of the pulse profiles were detected \nat high energies ($>$35 keV). A phase shift of $\\sim$0.3 was detected\nwhile comparing the phase of main dip in pulse profiles below and above\n$\\sim$35 keV. Broad-band energy spectrum of pulsar was well described by \na partially absorbed Negative and Positive power-law with Exponential cutoff \n(NPEX) model with 6.4~keV iron line and a cyclotron absorption feature. Energy \nof cyclotron absorption line was found to be $\\sim$53 and 50~keV for 2010 \nand 2012 observations, respectively, indicating a marginal positive dependence \non source luminosity. Based on the results obtained from phase-resolved spectroscopy,\nthe absorption dips in the pulse profiles can be interpreted as due to the\npresence of additional matter at same phases. Observed positive correlation between \ncyclotron line energy and luminosity, and significant pulse-phase variation of cyclotron \nparameters are discussed in the perspective of theoretical models on cyclotron \nabsorption line in X-ray pulsars.  \n\n\\end{abstract}\n\n\n\\begin{keywords}\npulsars: individual (GX~304-1) -- stars: neutron -- X-rays: stars\n\\end{keywords}\n\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=5in, width=4.8in, angle=-90]{fig1}\n\\caption{$Swift/BAT$ light curves of GX~304-1 in the 15-50 keV energy band, \nfrom 2010 July 28 (MJD 55405) to 2010 September 06 (MJD 55445) and 2011 \nDecember 30 (MJD 55925) to 2012 February 18 (MJD 55975) are shown in both \nsides of first panel, respectively. The arrow marks in both sides of first \npanel shows the date of {\\it Suzaku} observations of GX~304-1 during outburst. \nCorresponding pulse profiles in 0.5-10~keV (XIS-0; second panel), 10-70~keV \n(PIN; third panel) and 40-200~keV (GSO; fourth panel) obtained from the \nbackground subtracted light curves of both the observations are shown in both \nsides of figure. Phase zero was arbitrarily chosen at MJD 55421.76 and \n55957.4326 for first and second observations, respectively. The errors in the \npulse profiles are estimated for 1$\\sigma$ confidence level and two pulses are \nshown for clarity.}\n\\label{lc}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=6.5in, width=4.6in, angle=-90]{fig2}\n\\caption{Energy-resolved pulse profiles of GX~304-1 obtained from XIS-0, HXD/PIN and \nHXD/GSO light curves at various energy ranges, during first {\\it Suzaku} observation in \n2010 August outburst. The presence of absorption dips in profiles can be seen at \nvarious pulse phases. The error bars represent 1$\\sigma$ uncertainties. Two pulses \nin each panel are shown for clarity.}\n\\label{erpp2010}\n\\end{figure*}\n\n\n\n \n\\section{Introduction}\n\nBe/X-ray binary pulsar GX~304-1 was discovered during hard X-ray sky surveys \nwith balloon observations in 1967 (McClintock et al. 1971). The X-ray source \nwas detected with successive space missions and recognized as 3U~1258-61, \n4U~1258-61 \\& 2S~1258-613 (Giacconi et al. 1974; Bradt et al. 1977; \nForman et al. 1978). Using data from $SAS-3$ observations, X-ray pulsations \nat $\\sim$272~s were discovered in the source (McClintock et al. 1977). \nSpectral investigation of the pulsar, carried out from balloon observations, \nshowed that the continuum spectrum in 18-35~keV range was described by a \npower-law (Maurer et al. 1982). Later, a power-law model modified with high \nenergy cutoff was used to explain the 2-40~keV continuum spectrum obtained \nfrom  $HEAO~1$ observation of the pulsar (White, Swank \\& Holt 1983). Analyzing \nthe periodicity of the X-ray outbursts in 7 years of data from $Vela~5B$, the \norbital period of the GX~304-1 was reported to be 132.5~d (Priedhorsky \\& \nTerrell 1983). A shell star with visual magnitude of 15 was discovered in \nthe X-ray error box of the neutron star and identified as the optical \ncompanion of the pulsar (Mason et al. 1978). High resolution optical \nspectroscopy established the spectral class of the companion as Be star \nof type B2~Vne which is at a distance of 2.4$\\pm$0.5~kpc (Parkes et al. \n1980). \n\nGX~304-1 was monitored with $EXOSAT$ covering a duration of an expected outburst \nin 1984 July/August (Pietsch et al. 1986). However, no X-ray outburst was\ndetected during the $EXOSAT$ monitoring campaign. In contrast, the source \nflux was estimated to be significantly low e.g. by a factor of 25, than the \nquiescent flux level. This observed peculiarity was characterized as the X-ray \n``off'' state of the pulsar. Long term optical monitoring of the Be companion \nstar in 1978-1988 suggested a major change (loss) in the Be envelop or circumstellar \ndisk, the consequence of which is considered as the possible cause of the X-ray \n``off'' state in GX~304-1 (Corbet et al. 1986; Pietsch et al. 1986; Haefner 1988). \n\nAfter 28 years of quiescence, an X-ray outburst was detected from GX~304-1 with the\n{\\it INTEGRAL} observatory in 2008 June (Manousakis et al. 2008) after which the source \nwas found to be active in X-rays. Since then, several X-ray outbursts have been detected \nin the pulsar with {\\it Swift}/BAT and $MAXI$ (Yamamoto et al. 2009, 2012; Krimm et al. \n2010; Mihara et al. 2010). Using the {\\it Rossi X-Ray Timing Explorer (RXTE)} observations \nduring 2010 August outburst, energy and luminosity dependence of pulse profiles were found \nin GX~304-1 (Devasia et al. 2011). Apart from the evolution of pulse profiles, a \nquasi-periodic oscillation (QPO) at $\\sim$0.125~Hz was detected with harmonics in \nseveral $RXTE$/PCA observations during this outburst. The pulsar spectrum in 3-30~keV \nrange was described with a partial covering high energy cutoff power-law \nmodel (Devasia et al. 2011). During the same outburst in 2010 August, a cyclotron \nabsorption feature at $\\sim$54~keV was detected in the pulsar spectrum (Yamamoto et al. \n2011) and the corresponding magnetic field of the neutron star was estimated to be \n$\\sim$4.7$\\times$10$^{12}$~G. A positive correlation between cyclotron energy and \nluminosity was seen during 2012 January-February outburst with {\\it INTEGRAL} \n(Klochkov et al. 2012). Malacaria et al. (2015) performed timing and \nspectral analysis of the pulsar using the same {\\it INTEGRAL} data. The shape \nof the pulse profiles obtained from these observations were found to be similar \nin 20-40~keV, 40-60~keV and 18-80~keV energy ranges. Phase-resolved spectroscopy \nwas carried out by stacking multiple spectra of different fluxes. From this analysis,\nthe cyclotron absorption line energy was found to be nearly constant (within errors) \nwith pulse phases, except about 10\\% variation at one phase bin (Malacaria et al. \n2015). The evolution of the pulse period with luminosity was studied by using \ndata from $MAXI$/GSC, $RXTE$/PCA, $Swift$/XRT and $Fermi$/GBM observations \nduring a series of outbursts from 2009 to 2013 (Postnov et al. 2015; Sugizaki \net al. 2015). The observed pulse period variation was interpreted in terms of binary \nmodulation along with the spinning-up of the neutron star. The orbital parameters of \nthe binary system were estimated to be -- orbital period = 132.19~d, epoch at the \nperiastron = MJD~55425, pulse period $\\simeq$275.45~s, orbital eccentricity \n$\\simeq$ 0.5, a$_x$ sin~$i$ $\\simeq$ 500--600~light-s and  $\\omega$ at periastron \n$\\simeq$ 122.5$^\\circ$--130$^\\circ$ (Sugizaki et al. 2015). \n\nIn this work, the timing and broad-band spectral properties of GX~304-1 were \npresented in detail by using two {\\it Suzaku} observations during its outbursts in \n2010 August and 2012 January. Earlier, the evolution of pulse profiles up to \n$\\sim$30~keV had been reported by using $RXTE$/PCA observations during 2010 \noutburst (Devasia et al. 2011). Using {\\it Suzaku} observations, the \nevolution of pulse profiles up to $\\sim$150~keV has been presented in this paper.\nThe observed changes in the shape of pulse profiles close to the cyclotron absorption \nline are also being discussed. Although spectral studies of the pulsar during its 2012 \noutburst has been reported in 5-100~keV range by using {\\it INTEGRAL} observations \n(Malacaria et al. 2015), {\\it Suzaku} observations provide a better opportunity to \ninvestigate a detailed spectral and timing study in broad energy range (1-150 keV). \nThe details of observations, data analysis, results and interpretations are described \nin following sections of the paper.  \n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=6.5in, width=4.6in, angle=-90]{fig3}\n\\caption{Energy-resolved pulse profiles of GX~304-1 obtained from XIS-0, HXD/PIN \nand HXD/GSO light curves at various energy ranges, during second {\\it Suzaku} observation \nin 2012 January outburst. The presence of absorption dips in profiles at higher energies \ncan be seen at various pulse phases. The error bars represent 1$\\sigma$ uncertainties. \nTwo pulses in each panel are shown for clarity.}\n\\label{erpp2012}\n\\end{figure*}\n\n\n\n\\section{Observation and Analysis}\n\n{\\it Suzaku}, the fifth Japanese X-ray mission, was launched by Japan Aerospace \nExploration Agency (JAXA) on 2005 July 10 (Mitsuda et al. 2007). It offers a \nbroad energy coverage (0.2-600~keV) in the electromagnetic spectrum by using\ntwo sets of instruments e.g. the X-ray Imaging Spectrometers (XIS; Koyama et \nal. 2007) and Hard X-ray Detectors (HXD; Takahashi et al. 2007). The XISs are \nimaging CCD cameras and cover 0.2-12~keV energy range. Among four XISs, three \nXISs (XIS-0, XIS-2, XIS-3) are front-illuminated whereas one XIS (XIS-1) is \nback-illuminated. The effective areas of front and back-illuminated XISs are \n340~cm$^2$ and 390~cm$^2$ at 1.5~keV, respectively. Field of view of XIS detectors \nis $18'\\times18'$ in full window mode. The HXD unit of {\\it Suzaku} consists of two \nsets of detectors such as HXD/PIN and HXD/GSO. HXD/PIN is a silicon diode detector \ncovering 10-70~keV energy range, whereas HXD/GSO is a crystal scintillator detector \nworking in 40-600~keV energy range.  Effective areas for HXD/PIN and HXD/GSO are \n145 cm$^2$ at 15 keV and 315 cm$^2$ at 100 keV, respectively. Field of view of \nHXD/PIN and HXD/GSO (up to 100~keV) is $34'\\times34'$.\n\nGX~304-1 was observed with {\\it Suzaku} during its outbursts in 2010 August and \n2012 January. $Swift$/BAT light curves of the pulsar in 15-50~keV range, \ncovering the outbursts are shown in top panels of Fig.~\\ref{lc}.\nArrow marks in both panels indicate the date of {\\it Suzaku} observation \nof GX~304-1 during respective outbursts. During 2010 August outburst, the \n{\\it Suzaku} observation was carried out at the peak of outburst whereas the\nsecond observation was made during the decay phase of the 2012 January \noutburst. The first observation was performed on 2010 August 13, in \n`HXD nominal' position with an effective exposure of $\\sim$5.1~ks and \n$\\sim$12.9~ks for XIS and HXD detectors, respectively. However, the second\nobservation was made during 2012 January 31-February 02 for a longer effective \nexposures of $\\sim$16.5~ks for XIS and $\\sim$58.7~ks for HXD. The \nsecond observation was performed in `XIS nominal' position. During \nboth observations, the XIS detectors were operated in ``burst'' clock \nmode with `1/4' window option yielding 0.5~s time resolution. The \npublicly available archival data (observation~IDs: 905002010 and \n406060010) were used in the present study. Heasoft software package \nof version 6.12 and calibration database (CALDB) for XIS and HXD released\non 2014 February 03 and 2011 September 13, respectively, were used in\nthe data analysis.  \n\nThe unfiltered event data files were reprocessed by applying the `aepipeline'\npackage of FTOOLS. The clean event files generated after the reprocessing of \nXIS and HXD unfiltered event data were used in our analysis. The arrival times\nof the X-ray photons recorded in XIS and HXD event data were corrected for solar \nsystem barycenter by applying `aebarycen' task of {\\small FTOOLS}. The light \ncurves and spectra of the pulsar were extracted from clean event data by using \nthe $XSELECT$ package of FTOOLS. The XIS event data were corrected for the effect \nof thermal flexing and wobbling by applying attitude correction script \n\\textit{aeattcor.sl}\\footnote{http://space.mit.edu/ASC/software/suzaku/aeattcor.sl}. \nSubsequently, the pile-up estimation was made for XISs data by using S-lang script \n\\textit{pile\\_estimate.sl}\\footnote{http://space.mit.edu/ASC/software/suzaku/pile\\_estimate.sl}.\nFor first observation, a pile-up of $\\sim$22\\%, $\\sim$18\\% and  $\\sim$28\\%  \nwas found at the centers of XIS-0, XIS-1 and XIS-3, respectively. Therefore, an \nannulus region with inner and outer radii of $60''$ and $180''$ was selected \nto reduce the effect of pile-up to $\\le$4\\%. During the second observation, \nthe pile-up was estimated to be 17\\%, 13\\% and 18\\% at the centers of XIS-0, \nXIS-1 and XIS-3, respectively. An annular region with $40''$ inner and $180''$ \nouter radii was used to reduce the pile-up effect to $\\le$4\\% for the second \nobservation. These annulus regions were used for the extraction of source\nlight curves and spectra from cleaned XIS event data. The XIS background light \ncurves and spectra were extracted from the event data by selecting a circular \nregion away from the source. Response matrices and effective area files for \nXISs were created by using `xisrmfgen' and `xissimarfgen' tasks of FTOOLS, \nrespectively. HXD being a non-imaging detector system, source light curves \nand spectra were obtained from cleaned HXD/PIN and HXD/GSO event data by using \n{\\it XSELECT} package. However, PIN and GSO background light curves and spectra \nwere accumulated from simulated non-X-ray background event files provided by the\ninstrument team. A correction for cosmic X-ray background \n(CXB\\footnote{http://heasarc.nasa.gov/docs/suzaku/analysis/pin\\_cxb.html})\nwas also applied to PIN spectrum. In our spectral analysis, HXD/PIN \nresponse files released in 2010 July and 2011 June were used for 2010 \nAugust and 2012 January observations, respectively. For GSO data, \nresponse and effective area files released in 2010 May were used for \n2010 August observations.\n\n\n\n\\section{Results}\n\n\\subsection{Timing Analysis}\n\nAs described above, source and background light curves with 1~s time resolution \nwere extracted from barycentric corrected XIS-0, PIN and GSO event data for both \nthe observations. The $\\chi^2$-maximization technique was used to estimate the pulse \nperiod of the pulsar. Pulsations at periods of 275.45$\\pm$0.05 and 274.88$\\pm$0.01~s \nwere detected in the source light curves obtained from the first and second \n{\\it Suzaku} observations, respectively. Quoted errors in pulse period are \ncalculated for 90\\% confidence level. The estimated pulse periods were used \nto generate pulse profiles from background subtracted light curves from \ncorresponding observations. Pulse profiles in 0.5-10~keV (XIS-0), 10-70~keV \n(PIN) and 40-200~keV (GSO) energy ranges for both the observations are shown \nin second, third and fourth panels of Fig.~\\ref{lc}, respectively.\nPulse profiles were generated by using 55421.7600 MJD as epoch (phase zero) \nfor the first observation where as 55957.4326 MJD was used for the second \nobservation.  \n\nStrong energy dependence of pulse profiles can be clearly seen during both\nobservations (Fig.~\\ref{lc}) . Absorption dips at certain phases were seen \nin the soft X-ray pulse profiles (0.5-10~keV range). However, these dips \ndisappeared from the pulse profiles in 10-70~keV range. The pulsations were \nabsent or marginally seen in 40-200~keV pulse profiles obtained from GSO \nlight curves. Apart from the energy dependence, the pulse profiles are also \nfound to be luminosity dependent. The top panels of the Fig.~\\ref{lc} show \nthat the {\\it Suzaku} observations of the pulsar were carried out at different \nluminosity levels e.g. the source was comparatively brighter during the 2010 \nAugust observation than the 2012 January observation. However, the shape of \nthe pulse profiles in soft and hard X-rays (second and third panels) are \ndifferent due to the presence of absorption dips or dip-like features. Along \nwith the energy and luminosity dependence of the pulse profiles in GX~304-1, \na phase shift of $\\sim$0.1 (see Fig.~\\ref{lc}) was also found between the soft \n(XIS) and hard (PIN) X-ray  pulse profiles obtained from both the observations.\n\nTo investigate the evolution of pulse profiles with energy during both \n{\\it Suzaku} observations, we generated energy resolved pulse profiles \nin various energy bands and are shown in Fig.~\\ref{erpp2010} \\& \n~\\ref{erpp2012} for first and second observations, respectively. It \ncan be seen from Fig.~\\ref{erpp2010} that a prominent and narrow \nabsorption dip was present in pulse profiles up to $\\sim$8 keV. Beyond \nthis energy, the peak in the pulse profiles prior to the dip ($\\leq$ 0.3 \nphase; left panels of Fig.~\\ref{erpp2010}) disappeared and broadened \nthe minima in the pulse profile to 0.05-0.25 pulse phase range (panels \nin second column of Fig.~\\ref{erpp2010}). We suggest that this broadening \nof the minima in the pulse profile is the possible cause of observed \n$\\sim$0.1 phase shift in the soft (0.5-10~keV) and hard X-ray (10-70~keV) \npulse profiles. A careful inspection of Fig.~\\ref{erpp2010} \\& \n~\\ref{erpp2012} showed that the pulse profiles were complex due to presence\nof several absorption features (dips) at various pulse phases and strongly \nenergy dependent up to $\\sim$12~keV beyond which the shape of the profiles\nbecame simple up to $\\sim$35~keV. The main dip in the pulse profiles \nin this energy range (12-35 keV) was observed to be phase-shifted by \n$\\sim$0.1 phase compared to that in soft X-ray profiles. In pulse profiles\nbeyond $\\sim$35 keV, the main dip at $\\sim$0.1 phase appeared to be filled-up \ngradually with increase in energy. Along with the increase in the normalized\nintensity at $\\sim$0.1 phase (Fig.~\\ref{erpp2010} \\& ~\\ref{erpp2012}), a \nsignificant decrease in intensity was observed at $\\sim$0.7-0.8 phase range\nwhich appeared as the main dip in hard X-ray pulse profiles. These hard X-ray \npulse profiles ($\\geq$40~keV) appeared to be single-peaked and pulsations were \ndetected up to $\\sim$120~keV. \n\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[height=3.2in, width=2.4in, angle=-90]{fig4}\n\\caption{Energy spectrum of GX~304-1 in 1-130~keV energy range obtained with the XIS-0, XIS-3, \nPIN and GSO detectors from the first {\\it Suzaku} observation in 2010 August outburst, \nalong with the best-fit model comprising  a partial covering NPEX continuum model, \na Gaussian function for iron emission line and a cyclotron absorption component. \nThe middle and bottom panels show the contributions of the residuals to $\\chi^{2}$ \nfor each energy bin for the partial covering NPEX continuum model \nwithout and with cyclotron component in the model, respectively.}\n\\label{spec2010}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[height=3.2in, width=2.4in, angle=-90]{fig5}\n\\caption{Energy spectrum of GX~304-1 in 1-70~keV energy range obtained with the XIS-0, XIS-3 and PIN \ndetectors from the second {\\it Suzaku} observation in 2012 January outburst, along with the \nbest-fit model comprising  a partial covering NPEX continuum model, a Gaussian \nfunction for iron emission line and a cyclotron absorption component. The middle \nand bottom panels show the contributions of the residuals to $\\chi^{2}$ \nfor each energy bin for the partial covering NPEX continuum model \nwithout and with cyclotron component in the model, respectively.}\n\\label{spec2012}\n\\end{figure}\n\n\n\nThe energy resolved pulse profiles of GX~304-1 were found to be complex during\nboth the {\\it Suzaku} observations. Presence of multiple narrow and prominent \nabsorption dips were seen up to as high as $\\sim$50 keV. Beyond this energy, \nthe profiles appeared relatively simple. Presence of prominent dips up to higher \nenergies and sudden change in phase of main dip in pulse profiles beyond $\\sim$35~keV \nmade it interesting to investigate the properties of pulsar through phase-averaged and \nphase-resolved spectroscopy. \n\n\n\n\\begin{table*}\n\\centering\n\\caption{Best-fitting parameters (with 90\\% errors) obtained from the spectral fitting of {\\it Suzaku} \nobservations of GX~304-1 during 2010 August and 2012 January outbursts. \nModel-1 : partial covering NPEX \nmodel with Gaussian component; Model-2 : partial covering NPEX model \nwith Gaussian component and cyclotron absorption line.}\n\\begin{tabular}{lllll}\n\\hline\nParameter                      &  \\multicolumn{2}{c}{2010 August}     \t&   \\multicolumn{2}{c}{2012 January}   \\\\ \n\\\\\n                                &Model-1             &Model-2            &Model-1           &Model-2       \\\\\n\\hline\nN$_{H1}$$^a$                    &1.04$\\pm$0.02       &1.02$\\pm$0.02      &0.98$\\pm$0.02\t    &0.97$\\pm$0.02    \\\\\nN$_{H2}$$^b$                    &13.2$\\pm$1          &13.7$\\pm$1.2       &5.7$\\pm$0.5\t      &5.3$\\pm$0.5    \\\\\nCov. fraction                   &0.35$\\pm$0.02       &0.32$\\pm$0.02      &0.25$\\pm$0.02\t    &0.23$\\pm$0.02\t   \\\\\nPhoton index                    &0.6$\\pm$0.03        &0.57$\\pm$0.03       &0.42$\\pm$0.02\t    &0.43$\\pm$0.02    \\\\\nE$_{cut}$ (keV)\t                &6.6$\\pm$0.1         &7.1$\\pm$0.2        &6.8$\\pm$0.1       &7.4$\\pm$0.2    \\\\\n\nFe line energy (keV)            &6.41$\\pm$0.02       &6.41$\\pm$0.02      &6.41$\\pm$0.01     &6.41$\\pm$0.01 \\\\\nEq. width of Fe line  (eV)      &44$\\pm$7\t\t         &43$\\pm$8           &23$\\pm$2          &23$\\pm$3          \\\\\n\nCyclotron line energy (keV)     &--                  &53.2$\\pm$0.8       &--                &50$\\pm$1      \\\\\nWidth of cyclotron line (keV)   &--                  &6.5$^{+2.1}_{-1.6}$ &-- \t            &5.5$^{+2.6}_{-1.8}$   \\\\\nDepth of cyclotron line\t        &--                  &0.8$\\pm$0.1        &--                &0.5$\\pm$0.1 \\\\\n\nFlux$^c$ (1-10 keV)             &9.2$\\pm$0.5        &9.2$\\pm$0.6        &4.9$\\pm$0.2         &4.9$\\pm$0.2 \\\\\nFlux$^c$ (10-70 keV)            &24.5$\\pm$1.5       &24.4$\\pm$2.0        &9.6$\\pm$0.5       &9.6$\\pm$1.1   \\\\ \nFlux$^c$ (70-130 keV)           &0.2$\\pm$0.1        &0.2$\\pm$0.1         &--                &--           \\\\\n\n$\\chi^2$ (dofs)                 &857 (527)          &638 (524)           &863 (588)\t\t     &765 (585)      \\\\\n\\hline\n\\end{tabular}\n\\\\\n\\flushleft\n$^a$ : Equivalent hydrogen column density in the source direction (in 10$^{22}$ atoms cm$^{-2}$ units),\\\\ \n$^b$ : Additional hydrogen column density (in 10$^{22}$ atoms cm$^{-2}$ units), \\\\\n$^c$ : Absorption corrected flux in units of 10$^{-9}$  ergs cm$^{-2}$ s$^{-1}$. \n\\label{spec_par}\n\\end{table*}\n\n\n\n\\subsection{Spectral Analysis}\n\n\\subsubsection{Pulse-phase-averaged spectroscopy}\n\nPhase-averaged spectroscopy was performed by using spectra accumulated from XIS-0, \nXIS-1, XIS-3, PIN and GSO data obtained from both the observations. Earlier described \nprocedures were followed to obtain source and background spectra, response matrices \nand effective area files for corresponding detectors. After appropriate background \nsubtraction, simultaneous spectral fitting was carried out by using {\\small XSPEC} \nv12.7 package. As the pulsar was bright during the first observation, broad-band \nspectral fitting was carried out in 1-130~keV range. However, data in 1-70~keV \nenergy range were used for simultaneous fitting for second observation. \nThe XIS spectra from 2010 August observation were binned by a factor of 4 up \nto 3~keV, a factor of 6 from 3 to 7~keV and a factor of 8 from 7 to 10~keV, whereas\nfor 2012 January observation, the XIS spectra were binned by a factor of 5 up to 10~keV. \nPIN spectra from both the observations were binned by a factor of 2 from 25~keV to 45 keV, \na factor of 3 from 45~keV to 50 keV and a factor of 5 from 50 to 70~keV. The GSO spectra \nwere grouped as suggested by instrumentation team. Data in 1.7-1.9~keV and 2.2-2.4~keV \nenergy ranges were ignored from the spectral fitting due to the presence of known Si and \nAu edge features in the XIS spectra. All the spectral parameters except the relative \nnormalization of detectors were tied together during the fitting. \n    \n    \n\n\\begin{figure*}\n\\begin{center}$\n\\begin{array}{ccc}\n\\includegraphics[height=5 cm,angle=-90]{fig6a.eps} &\n\\includegraphics[height=5 cm,angle=-90]{fig6b.eps} & \\\\\n\\includegraphics[height=5 cm,angle=-90]{fig6c.eps} &\n\\includegraphics[height=5 cm,angle=-90]{fig6d.eps} &\n \\end{array}$\n\\end{center}\n\\caption{The $\\chi^{2}$ confidence contours between high energy cutoff, cyclotron line energy and width, \nobtained from the phase averaged spectra fitted by the partial covering NPEX model with cyclotron \ncomponent during 2010 August (upper panel) and 2012 January (lower panel) {\\it Suzaku} observations. \nThe innermost to outermost contours represent 68$\\%$, 90$\\%$ and 99$\\%$ confidence levels, respectively. \nThe ``+\" sign indicates the best fit values for both parameters.}\n\\label{con-all}\n\\end{figure*}    \n\n\nIt has been found that the phase-averaged spectra of Be/X-ray binary pulsars during \noutbursts have been described by power-law (e.g. GX~304-1; Maurer et al. 1982), high \nenergy cutoff power-law (e.g. 4U~0115+63, 4U~1145-61, GX~304-1; White et al. 1983), Fermi\nDirac cutoff power-law (e.g. X0331+53, A~0535+26; Tanaka 1986), NPEX (e.g. 4U~0115+63, \nX0331+53, Cep~X-4; Makishima et al. 1999) continuum models. However, recently it has \nbeen found that while performing phase-resolved spectroscopy on data taken during X-ray\noutbursts of these pulsars, above models do not yield acceptable fit at all phase bins,\nspecifically at phases of prominent and narrow absorption dips in the pulse profiles\n(Naik et al. 2011; Paul \\& Naik 2011; Naik et al. 2013 and references therein).\nTo investigate the changes in spectral parameters at all phase bins (dip and non-dip \nphases of the pulse profiles), a partial covering absorption component has been added\nto above standard continuum models. Addition of this component to the continuum model\nresulted in getting acceptable fit to all phase bins and explained the cause of the\nnarrow and prominent dips in the pulse profiles. Partial covering absorption model \nconsists of two different power-law components with same photon index but different \nnormalizations, being absorbed by different column densities (N$_{H1}$ \\& N$_{H2}$), \nrespectively (Endo et al. 2000). \n\nIn the beginning, standard continuum models such as high energy cutoff power-law \n(HECUT; White et al. 1983), Fermi Dirac cutoff power-law (FDCUT; Tanaka 1986), \nNewHcut (Burderi et al. 2000), cutoff power-law, NPEX (Makishima et al. 1999) and \nThermal Comptonization model (CompTT; Titarchuk 1994) were used in our spectral \nfitting to describe the continuum spectrum of GX~304-1. Due to the presence of \nnarrow absorption dips in the pulse profiles of the pulsar (previous section) as \nseen in other Be/X-ray binary pulsars, a partial covering absorption component\nwas added to above continuum models. Among these models, partial covering \nNPEX continuum model was found to fit the source spectra obtained from both the \nobservations better than all other continuum models. We selected this model to use \nin phase-averaged and phase-resolved spectral analysis of both the {\\it Suzaku} \nobservations of GX~304-1.   \n\nThe NPEX continuum model is a combination of two power-laws with positive \nand negative indices and a high energy cutoff. This model is an approximation \nof the unsaturated thermal Comptonization in  hot  plasma. The analytical form \nof NPEX model is  \n\n\\begin{eqnarray}\n\\centering\n\\nonumber \nNPEX(E) = (N_1 E^{-\\alpha_1} + N_2 E^{+\\alpha_2})  ~ \\exp \\left( -\\frac{E}{kT} \\right)\n\\label{eq1}\n\\end{eqnarray} \n\nwhere $N_1$, $\\alpha_1$ and $N_2$, $\\alpha_2$ are the normalization and photon index \nof the negative and positive power laws, respectively. $kT$ represents the cutoff energy \nin the unit of keV. The photon index of positive power law is fixed at a value of 2, \nrepresenting Wien's peak. During the spectral modeling, we found that the partial \ncovering NPEX model described the 1-130~keV (2010 observation) and 1-70~keV (2012\nobservation) spectra of the pulsar well. In addition to the continuum, iron fluorescence\nemission line at $\\sim$6.4~keV was detected in spectrum during both the observations. A \nweak iron emission edge like feature was found in the residual during the fitting of \nsecond observation. This was modeled by the addition of an edge component at $\\sim$7.7~keV \nin the spectral model. \n\nAn absorption like feature at $\\sim$54~keV was clearly seen in residuals obtained \nfrom spectral fittings of both the observations. Addition of a cyclotron absorption \ncomponent (`CYCLABS' in {\\it XSPEC} package) in the partial covering NPEX \ncontinuum model improved spectral fitting further with reduced $\\chi^2$ of \n$\\sim$1.5 for both the observations. The values of reduced $\\chi^2$, though acceptable,\nare found to be large. Investigating the residuals in 1-10 keV range, we noticed a marginal \ncross calibration uncertainties present between XIS-1 (back illuminated CCD) and XIS-0 \\& 3\n(front-illuminated CCD) spectra. While fitting the broad-band spectra without considering \ndata from XIS-1, the values of reduced $\\chi^2$ obtained are 1.22 and 1.31 for first\nand second observations, respectively. Best-fit model parameters obtained from \nsimultaneous spectral fitting of XIS-0 \\& 3, PIN and GSO data are given in Table~1. \nThe energy spectra of the pulsar along with the best-fit model components are shown \nin Fig.~\\ref{spec2010} and ~\\ref{spec2012}. The middle and bottom panels in each \nfigure show the residuals to the best-fit model without and with the addition of \ncyclotron absorption feature in the continuum model, respectively. The $\\chi^{2}$ \nconfidence contours were plotted to check the dependence of the cyclotron line energy \non high energy cutoff and cyclotron width and are shown in the top and bottom panels \nof Fig.~\\ref{con-all} for first and second observations, respectively. We did not \nfind any strong degeneracy among these spectral parameters.  \n\n\n\n\\begin{figure*}\n \\centering\n \\includegraphics[height=4.8in, width=3.9in, angle=-90]{fig7}\n \\caption{Spectral parameters obtained from the phase-resolved spectroscopy \nof GX~304-1 during the ${\\it Suzaku}$ observation in 2010 August.\nThe first and second panels in both sides show pulse profiles of the pulsar \nin 0.5-10~keV (XIS-0) and 10-70~keV (HXD/PIN) energy ranges. The values of \n$N_{H_2}$, covering fraction, power-law photon index and cutoff energy \n($E_{cut}$) are shown in third, fourth, fifth and sixth panels in left \nside, respectively. The cyclotron line parameters such as depth (third panel),\nline energy (fourth panel), source flux in 1-10 keV (fifth panel) and 10-70 keV \n(sixth panel) are shown in right side of the figure. Solid circles in the fourth\npanel in right side indicate that the cyclotron line energy was fixed for \ncorresponding phase-bin at the phase-averaged value. The errors in the figure \nare estimated for 90\\% confidence level.}\n\\label{sp2010}\n \\end{figure*}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=4.8in, width=3.9in, angle=-90]{fig8}\n\\caption{Spectral parameters obtained from the phase-resolved spectroscopy \nof GX~304-1 during the ${\\it Suzaku}$ observation in 2012 January.\nThe first and second panels in both sides show pulse profiles of the pulsar \nin 0.5-10~keV (XIS-0) and 10-70~keV (HXD/PIN) energy ranges. The values of \n$N_{H_2}$, covering fraction, photon index and cutoff energy ($E_{cut}$) \nare shown in third, fourth, fifth and sixth panels in left side, \nrespectively. The cyclotron line parameters such as depth (third panel),\nline energy (fourth panel), source flux in 1-10 keV (fifth panel) and 10-70 keV \n(sixth panel) are shown in right side of the figure. The errors in the figure \nare estimated for 90\\% confidence level.}\n\\label{sp2012}\n \\end{figure*}\n\n\n  \n\n\\subsubsection{Pulse-phase-resolved spectroscopy}\n\nPulse profiles of GX~304-1 are found to be different even when compared \nat same energy range from both {\\it Suzaku} observations. Therefore, \nit is interesting to perform phase-resolved spectroscopy to probe the changes \nin spectral parameters with pulse phase and then compare \nwith the observations at different luminosity level. As the first \nobservation was for a relatively short exposure ($\\sim$13 ks for HXD) \ncompared to the second observation ($\\sim$59 ks for HXD), phase-resolved \nspectroscopy was carried out by accumulating source spectra in 10 and 16 \npulse-phase bins for first and second observations, respectively. \nReprocessed XIS and PIN event data from both the observations were used\nto extract phase-resolved spectra by applying phase filter in $XSELECT$ package. \nData from HXD/GSO detector were not used in the phase resolved spectroscopy \ndue to lack of sufficient hard X-ray photons in each phase bin. Background\nspectra and response matrices used in phase-averaged spectroscopy were also\nused in phase-resolved spectral fitting. Simultaneous spectral fitting was\ncarried out on phase-resolved spectra obtained from both the observations\nby using partial covering NPEX continuum model along with the cyclotron\nabsorption component and Gaussian function for the iron emission line.\nWhile fitting, the values of relative instrument normalizations, equivalent \nhydrogen column density (N$_{H_1}$) and iron emission line parameters were \nfixed at the corresponding values obtained from phase-averaged spectroscopy. \nThe width of the cyclotron absorption line was fixed at the \nphase averaged value to constrain the feature. Spectral parameters obtained\nfrom fitting the XIS and PIN phase resolved spectra are shown in \nFig.~\\ref{sp2010} and ~\\ref{sp2012} for 2010 August 13 and 2012 \nJanuary 31 observations, respectively. Pulse profiles obtained from \nXIS-0 and PIN event data of each observation are also shown in top \ntwo panels of these figures. \n\nDuring both the observations, all the spectral parameters showed significant \nvariability with pulse-phase of the pulsar. Fig.~\\ref{sp2010} (2010 August \nobservation) shows that the value of additional hydrogen column density \n(N$_{H_2}$) varies in 1-30 $\\times$ 10$^{22}$~cm$^{-2}$ range over pulse \nphases. The value of N$_{H_2}$ was increased from 0.3 phase and became\nmaximum in 0.6-1.0 phase range. It can be seen that normalized intensity (XIS \npulse profile; top panel) was low at 0.6 phase and remain steady before reaching \nthe minimum value at 1.0 phase. Decrease in the normalized intensity of the pulsar \nduring above pulse phase range and simultaneous increase in the value of N$_{H_2}$\nconfirm that the plateau like feature in XIS pulse profile in 0.6-1.0 pulse phase\nrange was due to the presence of additional absorbing material close to the pulsar.\nThis can also explain the presence of an absorption dip in the XIS pulse profile \nand an increase in the N$_{H_2}$ value in 0.3-0.4 phase range of the pulsar. As \nin case of N$_{H_2}$, the covering fraction of the additional absorption was also \nfound to be comparatively high during the dip and plateau region. As expected, \nthe values of power-law photon index and cutoff energy were high \nduring the main dip in the XIS and PIN pulse profiles. The depth of the \ncyclotron absorption feature was found to be variable and single peaked. \nThe energy of cyclotron absorption feature also showed variation over the \npulse phase of the pulsar. The values of both the parameters were maximum at \ndip phase of the pulsar and gradually decreased to minimum value in 0.5-0.8 \nphase range. Data gaps in third and fourth panels in second column are due \nto the non-detection of cyclotron features in the spectral fitting for \ncorresponding phase-bins. The flux in 1-10~keV and 10-70~keV shows  \nvariation with pulse phase and follows the shape of pulse profile in respective \nenergy bands.\n\nThough the shape of XIS and PIN pulse profiles of the pulsar were significantly\ndifferent during second {\\it Suzaku} observation, the variation of spectral parameters\nover pulse phase was comparable. High values of absorption column density\nwere found at phases of absorption dip in XIS pulse profile. The values of power-law \nphoton index, cutoff energy, depth and energy of cyclotron absorption line, source \nflux in 1-10 keV and 10-70 keV were followed similar pattern as seen during\nthe 2010 August {\\it Suzaku} observation of the pulsar. Though the number of absorption \ndips and shape of the pulse profiles of the pulsar during both the observations were\ndifferent, presence of additional matter as the cause of absorption dips in the soft\nX-ray profiles is supported by the findings in the present work. However, low value\n($\\le$5$\\times$10$^{22}$ cm$^{-2}$) of absorption column density at $\\sim$0.1-0.2 phase \nrange (Fig.~\\ref{erpp2010} \\& ~\\ref{erpp2012}) suggested that the cause of absorption \ndip at above phase range in the hard X-ray pulse profiles was different.\n\n \n\n\\section{Discussion and Conclusions}\n\nPulse profiles of transient X-ray binary pulsars are complex due to \nthe presence of multiple absorption dips/features at lower energies. \nThese absorption features are strongly energy dependent \n-- prominent in soft X-ray pulse profiles and gradually disappear at \nhigher energies. Complex structures or absorption dips in pulse profiles \noriginate due to the photo-electric absorption of soft X-ray \nphotons by matter present around the neutron star. This can be confirmed \nby investigating energy resolved pulse profiles and the evolution of spectral \nproperties with pulse phases of the pulsar. Among the accretion powered \nX-ray pulsars, the pulse profiles of Be/X-ray binary pulsars during outbursts \nare found to be complex. These pulsars show regular and periodic X-ray outbursts \n(Type~I) that are associated with the periastron passage of the neutron star. \nDuring periastron passage, the neutron star captures copious amount of matter \nfrom the circumstellar disk of the Be companion star and undergoes X-ray \noutbursts. Typical X-ray luminosity of the pulsar during Type~I outburst \nis  $\\sim$10$^{36-37}$~erg~s$^{-1}$ (Negueruela et al. 1998). In case of \nGX~304-1, Type~I X-ray outbursts occur at a period of 132.5~d. Using  \ninstruments with good time resolution and wide-band energy coverage \ncapabilities onboard {\\it Suzaku}, we carried out a detailed study of\nthe pulsar during two Type~I outbursts. We also performed pulse-phase \nresolved spectroscopy of GX~304-1 to study the evolution of spectral \nparameters during these outbursts. \n\n\n\\subsection{Pulse Profiles}\n\nPulse profiles of GX~304-1 appeared to be different\nduring 2010 August and 2012 January Type~I outbursts. \nDuring 2010 August observation, the profiles were complex due to the\npresence/absence of peaks and dips at several pulse phases in soft and \nhard X-ray energy ranges. Due to this, a phase shift of $\\sim$0.1 was visible \nbetween the soft and hard X-ray pulse profiles (Fig.~\\ref{lc} \\& ~\\ref{erpp2010}). \nHowever, the shape of the pulse profiles of the pulsar during 2012 January outburst \nwere significantly different compared to 2010 August outburst. Number of absorption\ndips in the pulse profiles was more during 2012 observation. The strength of \nthese dips was also prominent compared to the earlier observation. These dips \nwere present in the pulse profiles up to higher energies unlike the 2010 August \nobservation, where the dips were seen in the pulse profiles up to $\\sim$10 keV. \nPulse-phase resolved spectroscopy during both the observations revealed the \npresence of additional matter at certain phases, causing the absorption dips \nin the soft X-ray pulse profiles. During 2012 observation, more number of \nnarrow absorption dips in the pulse profiles suggest the presence of dense \nnarrow streams of matter around the neutron star. However, during 2010 observation, \nrelatively simpler profile with single absorption dip and a plateau phase suggests \nthat the matter distribution around the neutron star is different and relatively \nsimple. The luminosity of the pulsar during 2010 {\\it Suzaku} observation was \nestimated to be higher (2.3$\\times$10$^{37}$ergs~s$^{-1}$) than the 2012 \n{\\it Suzaku} observation (1$\\times$10$^{37}$ergs~s$^{-1}$). The peak luminosity \nof 2010 August outburst was also found to be high compare to the 2012 January \noutburst (first panels of Fig.~1). As both the outbursts are Type~I X-ray outbursts,  \nobserved difference in the shape of the pulse profiles must be due to the difference \nin the subsequent mass accretion rate. \n\nAs in case of GX~304-1, another transient Be/X-ray binary pulsar EXO~2030+375\nwas also observed at the peaks of 2007 May and 2012 May Type-I outbursts with \n{\\it Suzaku}. The pulse profiles of EXO~2030+375 during these two outbursts were \nsignificantly different (Naik et al. 2013; Naik \\& Jaisawal 2015). During \nthe luminous outburst in 2007 May, the pulse profile of EXO~2030+375 consisted \nof several absorption dips as seen in the pulse profiles of GX~304-1 during 2012 \nJanuary outburst. However, during the less intense 2012 May outburst, the pulse \nprofiles were relatively smooth. Difference in the mass accretion rate during \nthese two Type~I outbursts was interpreted as the cause of different shape of \npulse profiles in EXO~2030+375. Such type of pulse profiles with multiple dips \nare also seen in other Be/X-ray binary pulsars such as A0535+35 (Naik et al. 2008), \nGRO~J1008-57 (Naik et al. 2011), 1A~1118--61 (Maitra et al. 2012 and references \ntherein). The dips in pulse profiles of these pulsars are originated due to the \nabsorption of emitted radiation by matter close to the neutron star. In most of \nthe cases, the dips in the pulse profiles are seen only in soft X-rays. However, \nthere are a few Be/X-ray pulsar in which the absorption dips are seen at same \nphase in the pulse profiles up to higher energy ($\\sim$70~keV) e.g. EXO~2030+375 \n(Naik et al. 2013). This is interpreted as due to the presence of dense additional \nabsorbers at various narrow pulse phase bins of the pulsar. Though, dip-like features \nin GX~304-1 (present work) appeared up to $\\sim$50~keV, the low value of additional \ncolumn density at dip phases suggests that absorption is not the cause of these \ndips in hard X-ray pulse profiles.\n\nEnergy resolved pulse profiles of GX~304-1, obtained from both the {\\it Suzaku}\nobservations revealed a significant phase-shift ($\\sim$0.35) of the main dip in \nprofiles at energies below and above $\\sim$35~keV. The observed phase-shift of\nthe main dip happened to occur at an energy close to the cyclotron absorption \nline energy in GX~304-1. Such type of effects e.g. phase-shifts (lags) or \nsignificant variations in pulse profiles close to the cyclotron absorption \nline energy are also seen in two other Be/X-ray binary pulsars such as V~0332+53 \n(Tsygankov et al. 2006) and 4U~0115+63 (Ferrigno et al. 2011). Using a numerical\nstudy on the effect of cyclotron resonant scattering in highly magnetized accretion \npowered X-ray pulsars, Sch{\\\"o}nherr et al. (2014) showed that a strong change in \nthe pulse profile is expected at the cyclotron absorption line energy. This change\nis attributed to the effects of angular redistribution of X-ray photons by cyclotron \nresonant scattering in a strong magnetic field combined with relativistic effects.\nIn GX~304-1, we observed a significant change in the phase of main dip in the pulse\nprofile close to the cyclotron line energy. This detection, along with\nthe reported results from V~0332+53 and 4U~0115+63 supports the results obtained from\nthe numerical study of Sch{\\\"o}nherr et al. (2014).      \n\n\n\\subsection{Spectroscopy}\n\nBroad-band spectra of accretion powered X-ray pulsars are described by \nseveral continuum models such as HIGHECUT, FDCUT, cutoff power-law, NPEX, \nCompTT. Along with the continuum model, additional components such as \nabsorption due to matter present in the interstellar medium, blackbody/bremsstrahlung \nfor soft X-ray excess, Gaussian functions for emission lines and cyclotron resonance \nscattering features (CRSF) are also needed to explain the observed spectrum. In \ncase of several Be/X-ray binary pulsars, a partially absorption component is being \nused to describe the presence of several absorption features (dips) at certain phases \nin the pulse profiles (Paul \\& Naik 2011 and references therein). Detection of \nCRSF in the broad-band pulsar spectrum provides direct estimation of\nthe magnetic field of X-ray pulsars. However, studies of CRSF at different pulse phases \nof the pulsars can reveal important information about the magnetic field geometry around \nthe neutron star. Therefore, broad-band spectroscopy of data obtained from the \nobservations with high spectral capability instruments on-board {\\it Suzaku} \nis an appropriate tool to understand the properties of accretion powered X-ray pulsars.\n\nThis paper reports the broad-band phase-averaged and phase-resolved \nspectroscopy of GX~304-1 by using two {\\it Suzaku} observations during \nits Type~I outbursts. The estimated values of galactic equivalent hydrogen \ncolumn density in the source direction (N$_{H_1}$) was same (within errors) \nduring both the observations. However, the values of additional column density \n(N$_{H_2}$ - local to the pulsar), were found to be different during both \nthe observations. The value of N$_{H_2}$ was high during the 2010 August \nobservation compared to 2012 January observation. It should be noted here \nthat the luminosities of the pulsar during the {\\it Suzaku} observation \n(Table~1) as well as at the peak (top panels of Fig.~1) of 2010 August \noutburst were high compared to corresponding values during 2012 January \noutburst. This confirms that the amount of mass accreted by the neutron \nstar from the Be circumstellar disk during 2010 August outburst was \nsignificantly more than that during 2012 January outburst. Similar findings \nhave also been reported for EXO~2030+275 during its Type~I outbursts with \nsignificantly different luminosities (Naik et al. 2013; Naik \\& Jaisawal \n2015). High value of N$_{H_2}$ during more luminous Type~I outbursts in \nBe/X-ray binary pulsars can be explained as due to significant amount of \nmass accreted by the neutron star from the circumstellar disk of the Be \ncompanion star.\n\nWe estimated the effect of additional column density (N$_{H_2}$) on the phase \naveraged spectrum by taking the difference in absorption corrected flux without and \nwith N$_{H_2}$ component. It was found that the 2010 August observation was more \naffected by absorption due to additional matter compared to the 2012 January \nobservation. The flux differences were estimated to be (1.8$\\pm$0.9$)\\times$10$^{-9}$ \nand (0.4$\\pm$0.3$)\\times$10$^{-9}$ ergs~cm$^{-2}$~s$^{-1}$ for 2010 August and 2012 \nJanuary observations, respectively. The covering fraction which is defined as \n{\\it Norm2/(Norm1+Norm2)}, where $Norm1$ and $Norm2$ are the normalizations of \nfirst and second power-law, was also found to be high during first observation. \nCovering fraction describes the possibility of interaction of photons with \nthe absorbing matter which is marginally offset from the line of sight at a phase \naveraged solid angle of {\\it $\\Omega$/4$\\pi$= Norm2/Norm1} (Endo et al. 2000). The \naveraged phase solid angles ($\\Omega$/4$\\pi$) for first and second observations were \nestimated to be 0.47 and 0.30, respectively. This indicates that the additional \nabsorbing matter during first observation was present relatively more closer \nto the neutron star that extending to a larger solid angle. \n\nAbsorption dips in the pulse profiles of Be/X-ray binary pulsars are explained\nas due to the presence of narrow streams of matter that are phase-locked with the \nneutron star. The magnetospheric radius of the pulsar can be used to constrain the \nlocation of additional absorbing matter in such narrow streams. The size of \nmagnetosphere of the pulsar depends on the mass accretion rate and the strength \nof the magnetic field (Mushtukov et al. 2015a and references therein) through the \nrelation  \n\n\n", "index": 1, "text": "\\begin{equation}\nR_{\\rm m}=2.6\\times 10^8\n M^{1/7}R_6^{10/7}B_{12}^{4/7}L_{37}^{-2/7} \\ \\mbox{cm}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"R_{\\rm m}=2.6\\times 10^{8}M^{1/7}R_{6}^{10/7}B_{12}^{4/7}L_{37}^{-2/7}\\ \\mbox{cm}\" display=\"block\"><mrow><msub><mi>R</mi><mi mathvariant=\"normal\">m</mi></msub><mo>=</mo><mrow><mrow><mn>2.6</mn><mo>×</mo><msup><mn>10</mn><mn>8</mn></msup></mrow><mo>⁢</mo><msup><mi>M</mi><mrow><mn>1</mn><mo>/</mo><mn>7</mn></mrow></msup><mo>⁢</mo><msubsup><mi>R</mi><mn>6</mn><mrow><mn>10</mn><mo>/</mo><mn>7</mn></mrow></msubsup><mo>⁢</mo><msubsup><mi>B</mi><mn>12</mn><mrow><mn>4</mn><mo>/</mo><mn>7</mn></mrow></msubsup><mo>⁢</mo><mpadded width=\"+5pt\"><msubsup><mi>L</mi><mn>37</mn><mrow><mo>-</mo><mrow><mn>2</mn><mo>/</mo><mn>7</mn></mrow></mrow></msubsup></mpadded><mo>⁢</mo><mtext>cm</mtext></mrow></mrow></math>", "type": "latex"}]