[{"file": "1601.03302.tex", "nexttext": "\n\nWith this choice of representations, the normalization for the hypercharge ${\\rm Y}$ \nof the ${\\rm U(1)_Y}$ gauge group is \ndefined by the relation ${\\rm Y=2(Q-T_3)}$, with  ${\\rm T_3}$ designating the third component of weak isospin.\n\n\n\nOnce Electroweak gauge interactions are turned on, \nthe chiral symmetry breaking pattern  ${\\rm SU(2)_L\\!\\otimes\\!SU(2)_R \\rightarrow SU(2)_V}$ \nof strong dynamics breaks  Electroweak symmetry in the expected pattern,\n${\\rm SU(2)_w \\times U(1)_Y \\rightarrow U(1)_{\\rm em}}$, and with the simultaneous\ndynamical realization of the composite Higgs mechanism. It is important to note that the \ndynamical Higgs mechanism is facilitated through the electroweak gauge couplings of\nthe sextet fermions and does not depend on the hypercharge assignments \nof the multiplets~\\cite{Susskind:1978ms}. \n\n\nHypercharges of left-handed doublets and right-handed singlets\nare determined from anomaly constraints and  consistent\nelectric charge assignments for fermions.  \nApparently, there are two simple solutions to the anomaly constraints\nwith different hypercharge assignments for \nleft-handed doublets. However,\nonly one of them avoids consistency problems with what we know about the relic abundance\nof dark baryons from their primordial evolution in the early Universe. \nBefore we describe the two different solutions to anomaly constraints in Section 4 with related implications,\nit is useful to briefly review first the merits of the sextet model for the minimal \nrealization of the composite Higgs mechanism\nwhich is independent of the two different hypercharge choices for left-handed doublets.\n\n\\subsection{The minimal composite Higgs in the sextet model}\n\nThe chiral symmetry breaking pattern ${\\rm SU(2)_L\\!\\otimes\\! SU(2)_R\\rightarrow SU(2)_V}$  of the \n${\\rm SU(2)}$ BSM flavor group of sextet fermions generates an isotriplet of three massless Goldstone \nbosons in the chiral limit. \n\nThe three Goldstones\nwill become longitudinal modes of the ${ W^{\\pm}}$ and $Z^0$ weak gauge bosons via the dynamical \nHiggs mechanism when the Electroweak interactions are turned on. This minimal realization of the composite Higgs\nmechanism comes from the perfect match between the longitudinal Electroweak gauge bosons \nand three massless Goldstone bosons  from sextet strong dynamics as one of the most \nattractive features of this BSM theory.\nIt is near-conformal with just one ${\\rm SU(2)}$  fermion flavor doublet with unexpected spectroscopy,\ndistinct from old Technicolor. We already noted that the\ndynamical Higgs mechanism does not depend on the electric charge assignment of the (u,d) fermion pair\nwith left-handed doublets and right-handed singlets as would be determined \nfrom the choice of hypercharges ${\\rm Y}$\nunder the weak isospin gauge group ${\\rm SU(2)_w}$. Independent of ${\\rm Y}$, \nthe three Goldstone bosons always have the correct \ninteger electric charges ${\\rm (\\pm 1,0)}$ to morph into the longitudinal components of the weak bosons as further\ndetailed in Section 4.\nSince the sextet gauge model is naturally located very close to the lower edge of the conformal window \nwithout fine tuning, a light scalar with a far separated resonance spectrum is expected from strong dynamics,\nmaking the minimal Higgs mechanism of the model economic and attractive.\n\nIn contrast, the condition of near-conformal behavior with fermions  in the fundamental \nrepresentations of ${\\rm SU(3) }$ bsm-color\nrequires a large number of fermion flavors in the BSM construction which leads to an excess of unwanted \nmassless Goldstone bosons. \n\n\n\n\nThe added complexities can be illustrated with the well-known one-family model\nfrom the Technicolor era with global flavor symmetry \n${\\rm SU(8)_L\\!\\otimes\\!SU(8)_R}$  of eight massless chiral fermions carrying bsm-color \nin the fundamental representation of the ${\\rm SU(3)}$ gauge group~\\cite{Farhi:1980xs}.\nIn the new near-conformal BSM paradigm a minimum of eight flavors is needed in the fundamental color\nrepresentation to get closer to the conformal window.  This motivated recent studies of the \neight-flavor fermion model to understand the\nstrong BSM force of the one-family model from several lattice studies~\\cite{Fodor:2009wk,Aoki:2014oha,Fodor:2015baa,Hasenfratz:2014rna,Appelquist:2014zsa,Schaich:2015psa}.\n\nThe  ${\\rm \\chi SB}$ pattern  ${\\rm SU(8)_L\\!\\otimes\\!SU(8)_R\\rightarrow SU(8)_V}$  generates 63 Goldstone bosons \nwith only three needed in the composite Higgs mechanism.\nGenerating masses for the excess unwanted Goldstone bosons  presents \nnon-trivial phenomenological challenges, making it more difficult to achieve the \ndesired goal of a near-conformal spectrum with a light $0^{++}$ scalar \nfar separated from resonance excitations.\n\n\\section{Constraints from global and gauge anomalies}\n\nAssuming that the strongly coupled gauge sector of the sextet model turns out to be compatible \nwith resonances \nin the 2-3 TeV region, a more complete BSM outlook of the model would come into focus,\nguided by anomaly constraints. \nWe will show that the existence of stable baryons in the sextet model when combined with our understanding \nof the early Universe requires anomalous fermion representation in the Electroweak sector. \n\nAlthough the sextet BSM model cannot offer a UV complete solution\nfor fermion mass generation and the related flavor problem, the outlook for new physics \nfrom extending the strongly coupled gauge sector guided by anomaly constraints is necessary. \n\nAnomaly compensating new physics has several important and immediate aspects \nwithout deference to physics on the scale of UV completion. \nIt provides an outlook and framework for new \nphysics the model can predict, or accommodate on several energy scales. \nAnomalies not only can predict or accommodate plausible new\nfermion content at the TeV scale but also give insight into\nElectroweak corrections to Standard Model expectations.\nThe example we will provide below is the anomaly canceling \npair of two massive lepton doublets (and associated right-handed singlets) to cancel the \nanomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}) from left-handed sextet fermion\ndoublets. New charged lepton \nand neutrino masses are partially constrained parameters in this anomaly matching extension.\nEven if the new fermion masses are set to very high energy scales, \ntheir infrared effects from the associated anomaly content will always survive. \nThe best known examples of this footprint from integrating out heavy fermions include\nthe Wess-Zumino effective action and other residual effects on the Electroweak scale~\\cite{D'Hoker:1984ph,D'Hoker:1984pc,Preskill:1990fr,D'Hoker:1992bv}.\n\n\n\\subsection{Anomaly conditions in the sextet model}\n\nAnomaly constraints have a long history in Technicolor motivated BSM model building with \nrepresentative examples \nin~\\cite{Dietrich:2005jn,Kainulainen:2006wq,Foadi:2007ue,Antola:2009wq,Kainulainen:2009rb}.\nThe first condition for model construction with left-handed doublets is the global Witten anomaly \nconstraint which requires an even number of left-handed SU(2) multiplets to \navoid inconsistency in the theory from a vanishing fermion determinant of the partition function~\\cite{Witten:1982fp}.\n\nIn addition, gauge anomaly constraints also have to be satisfied~\\cite{Adler:1969er}. \nWith vector current ${\\rm  V^i_\\mu(x)=\\overline{\\psi}T^i\\gamma_\\mu\\psi(x)}$ and axial current \n ${\\rm A^i_\\mu(x)=\\overline{\\psi}T^i\\gamma_\\mu\\gamma_5\\psi(x)}$\nconstructed from fermion fields and internal symmetry matrices ${\\rm T^i}$ in some group representation \nR for fermions, the anomaly in the axial vector Ward\nidentity is proportional to ${\\rm tr(\\{T^i(R),T^j(R)\\}T^k(R))}$ and must vanish. \nIn the sextet theory fermions are either left-handed doublets or right-handed singlets \nunder the ${\\rm SU(2)_w}$ gauge group. \nThe matrices ${\\rm T^i}$  will be either the ${\\rm \\tau^i}$ Pauli matrices \nor the diagonal ${\\rm U(1)}$ hypercharge ${\\rm Y}$.\nSince the ${\\rm SU(2)}$  group is  anomaly free, ${\\rm tr(\\{\\tau^i,\\tau^j\\}\\tau^k)=0}$, \nwe only need to consider anomalies where at least one ${\\rm T^i}$ is the hypercharge Y.\nThe non-trivial constraints come from two conditions on hypercharge traces,\n\n\n\n", "itemtype": "equation", "pos": 13734, "prevtext": "\n\n\\maketitle\n\n\\section{Introduction}\n\\label{sec:intro}\n\nAn important strongly coupled near-conformal gauge theory built on the minimally required\nSU(2) bsm-flavor doublet of two massless fermions, with a\nconfining gauge force on the TeV scale in the sextet\nrepresentation of the new SU(3) bsm-color is frequently discussed as an intriguing possibility \nfor the minimal realization of the composite Higgs mechanism.\n\nEarly discussions of the model as a BSM candidate were initiated in\nsystematic explorations of higher fermion representations of color gauge groups~\\cite{Dietrich:2005jn,Sannino:2004qp,Hong:2004td}\nfor extensions of the original Higgsless Technicolor paradigm~\\cite{Susskind:1978ms,Weinberg:1979bn}.\nIn fact, the first appearance of the particular two-index symmetric SU(3) fermion representation \ncan be traced even further back to Quantum Chromodynamics (QCD) where a doublet of sextet quarks\nwas proposed as a mechanism for Electroweak symmetry breaking (EWSB)\nwithout an elementary Higgs field~\\cite{Marciano:1980zf}. This idea had to be\nreplaced by a new\ngauge force at the TeV scale, orders of magnitude stronger than in QCD, to facilitate the dynamics \nof EWSB just below the lower edge of the conformal window in \nthe new BSM paradigm~\\cite{Dietrich:2005jn,Sannino:2004qp,Hong:2004td}.\nIt should be noted that throughout its early history the important near-conformal behavior \nof the model was a hypothesis only and definitive results had to wait for recent\nnon-perturbative investigations with lattice gauge theory methods\nas used in our work.\n\nNear-conformal BSM theories raise\nthe possibility of a light composite scalar, perhaps a Higgs impostor, to emerge from new strong dynamics,\nfar separated from the associated composite resonance spectrum in the few TeV mass range\nwith interesting and testable predictions for the Large Hadron Collider (LHC). \nThis scenario is very different from what was expected from QCD when scaled up to the Electroweak scale,\nas illustrated by the failure of the Higgsless Technicolor paradigm.\nGiven the discovery of the 125 GeV Higgs particle at the LHC, any realistic BSM theory must contain a Higgs-like state, \nperhaps with some hidden composite structure.\n\n\nBased on our {\\it ab initio} non-perturbative  lattice calculations\n\nwe find\naccumulating evidence for near-conformal behavior in the sextet theory with\nthe emergent low mass  $0^{++}$ scalar state far separated from \nthe composite resonance spectrum of bosonic excitations in the 2-3 TeV energy range~\\cite{Fodor:2012ty,Fodor:2012ni,Fodor:2014pqa,Fodor:2015vwa}. \n\n\n\n\n\nThe identification of the light scalar state is numerically challenging since it\nrequires the evaluation of disconnected fermion loop contributions to correlators with vacuum quantum numbers\nin the range of light fermion masses we explore.\nThe evidence to date is very promising that the $0^{++}$ scalar is light \nin the chiral limit and that the model at this stage remains an important BSM candidate.\n\nIn Section 2 critically important features of the strongly coupled sextet gauge sector \nof the light scalar are briefly reviewed.\nIn Section 3 we discuss the Electroweak interactions of sextet fermions and their Electroweak multiplet structure.\nThe outlook beyond the Standard Model under global and gauge anomaly constraints is presented in Section 4 \nincluding the choice for new leptons under the requirement of integer electric charges for dark baryons.\nIn Section 5 dark baryons from the sextet Electroweak multiplet structure are constructed \nwith discussion of model constraints based on galactic and terrestrial relic densities from the early Universe.\nSection 6 describes the construction of lattice baryon operators using staggered lattice fermions \nin the sextet color representation. Our first non-perturbative lattice results on sextet baryon spectroscopy\nare presented in Section 7.  We conclude in Section 8 with a brief summary and outlook. \n\n\n\\section{Two critical features of the sextet strong force}\n\nThe foundation of the theory is based on chiral symmetry breaking (${\\rm \\chi SB}$) from the sextet gauge force\nin the massless fermion limit with three Goldstone bosons \nfor the minimal realization of the Higgs mechanism.\n\n\nIn our work from lattice simulations, the ${\\rm \\chi SB}$ pattern \n${\\rm SU(2)_L\\!\\otimes\\! SU(2)_R\\rightarrow SU(2)_V}$  in the  bsm-flavor group\nis consistent with the absence of any \nevidence for a conformal infrared fixed point (IRFP) at scales\nreached so far with the scale-dependent strong gauge coupling~\\cite{Fodor:2015zna}. \nThese two fundamental features are intrinsically interdependent.\nThe existence of an IRFP would make the sextet theory conformal with unbroken chiral symmetry\nimplying the disappearance of the finite temperature ${\\rm \\chi SB}$ transition of massless fermions\nin the continuum limit~\\cite{Kogut:2015zta}.\nThe phenomenological relevance of the sextet BSM model would be questioned in this case, perhaps with\nspeculative changes from previously unexplored new features, like the role of four-fermion operators \nin strongly coupled gauge dynamics.\nThe current understanding of the sextet theory shows no evidence for the paradigm shift \nfrom an IRFP as briefly argued below.\n\n\\subsection{The scale-dependent renormalized coupling and its $\\beta$-function}\n\nThere have been several lattice studies of the renormalized sextet gauge coupling and its $\\beta$-function \nusing different schemes. The first studies using the Schr\\\"{o}dinger functional method with tuned\nmassless Wilson fermions \nwere not decisive to rule in or rule out an IRFP in the explored range \nof the renormalized coupling~\\cite{DeGrand:2010na, Shamir:2008pb}. \nOur recent study using the gradient \nflow scheme with exactly massless staggered fermions and with full investigation \nof systematic effects in taking the continuum limit shows no evidence that the $\\beta$-function \nhas an infrared fixed point in the gauge coupling range ${\\rm 0 < g^2 < 6.5}$ investigated~\\cite{Fodor:2015zna}.  \nThis finding is consistent \nwith studies of the mass-deformed Goldstone spectrum and the spectrum of the Dirac operator which exhibits\nthe Banks-Casher condensate in the chiral limit~\\cite{Banks:1979yr,Fodor:2015vwa}.\nOur ongoing investigations include detailed studies of the mass-deformed Goldstone spectrum\nand the chiral condensate via the GMOR relation in chiral perturbation theory. \nPredictions for ${\\rm \\chi SB}$ from Random Matrix Theory are being tested from the lowest eigenvalues of the Dirac spectrum for high precision results.\n\nPreliminary results from concurrent studies of the scale-dependent renormalized coupling,\nusing the gradient flow method with\nWilson fermions in finite volumes, reported a conformal IRFP in the sextet $\\beta$-function \nwithin the ${\\rm g^2 \\sim 5.5-6.5}$ range where the 3-loop and 4-loop perturbative \n$\\beta$-functions  develop zeros in the ${\\rm \\overline{MS}}$ scheme~\\cite{Anna_g2}.\nThese preliminary results have been revised and no IRFP \nis reported anymore in the sextet $\\beta$-function~\\cite{Hasenfratz:2015ssa}, \nsimilar to our findings~\\cite{Fodor:2015zna}.\n\nIt should be noted that the precise determination of the very small $\\beta$-function \npresents challenges even for the best gradient flow based methods which \nwere deployed by both groups under discussion.\nNevertheless, the outcome of these difficult scale-dependent gauge coupling studies\nremains consistent with our expectation that the theory is very close \nto the lower edge of the conformal window with ${\\rm \\chi SB}$ but without an IRFP.\n\n\\subsection{Finite temperature chiral transition}\n\nBased on the existence of  ${\\rm \\chi SB}$ at zero temperature,\nit would be expected that chiral symmetry is restored in the sextet theory in a finite-temperature \nchiral transition. This has been the focus \nof recent work with evidence presented for a chiral transition \nat finite lattice cutoff~\\cite{Kogut:2011ty,Kogut:2010cz,Kogut:2015zta}. \nTracking the cutoff-dependent temperature of the chiral transition as the gauge coupling is varied,\nthe authors conclude that the chiral transition should disappear in the continuum limit \nand they report new-found indications for a conformal IRFP in the continuum model~\\cite{Kogut:2015zta}. \nThis finding is based on the scale-dependent variation of the $\\beta$-function with the bare and renormalized gauge\ncouplings, significantly slower than the expected 2-loop perturbative behavior \nin the renormalized weak coupling range ${\\rm g^2_R \\sim 1-3}$ but without the removal of cutoff effects\nin the $\\beta$-function and without control of other systematics which can qualitatively affect the conclusions of~\\cite{Kogut:2015zta}.\nIn particular, the simple Wilson gauge action and unimproved simple staggered fermion action  \nwere used in~\\cite{Kogut:2015zta} with known large cutoff effects and lacking systematic control \non the estimate of the renormalized coupling and its continuum limit, limited to simulations away from the\nrequired chiral limit~\\cite{Kogut:2015zta}.\nIn contrast, our direct determination of the $\\beta$-function from the gauge field gradient flow method when\nthe cutoff is removed and the continuum\nlimit is taken shows agreement with the 2-loop $\\beta$-function in the ${\\rm g^2_R \\sim 1-3}$ range \nwithout any sign of a conformal IRFP~\\cite{Fodor:2015zna}. \n\nTo resolve the apparent controversy, definitive and systematic finite temperature studies of ${\\rm \\chi SB}$  \nwould be needed in the massless fermion limit of this important gauge field theory\nclose to the lower edge of the conformal window.\n\n\n\\section{Electroweak multiplets and anomaly constraints}\n\nThe first direct test of the sextet theory is expected to come from the strongly coupled sector \nof the new gauge force which predicts \nresonances in the 2-3 TeV range within the reach of Run 2 at the LHC.\n\nAs an example, a rho-like vector state has been predicted in the model\nat approximately 2 TeV which could be observed as a diboson resonance \nexcess above LHC background events~\\cite{Fodor:2012ty,Fodor:2012ni,Fodor:2014pqa,Fodor:2015vwa}.\nIn Section 7 we will briefly comment on the recently reported diboson excess\nfrom the ATLAS and CMS collaborations, consistent with our prediction but far from settled.\nThe location of the rho-like resonance at 2 TeV would be less surprising in Higgsless Technicolor, \nbut the emergent light ${\\rm 0^{++}}$ scalar on the Electroweak scale, far \nseparated from the resonance spectrum in sextet dynamics, is a distinct and unexpected new feature.\nThe recently found diphoton excess from\nATLAS and CMS resonance searches~\\cite{diphoton:2015}  in the invariant \nmass range around 750 GeV would require very specific explanation\nof a light flavor singlet near-conformal state separated from the 2-3 TeV composite resonance range\nin strongly coupled  composite gauge theories~\\cite{Molinaro:2015cwg}.\n\nBuilding a BSM theory requires the embedding of the strongly coupled sextet fermion doublet\ninto the ${\\rm SU(2)_w\\!\\otimes\\!U(1)_Y}$ Electroweak gauge group with a new outlook \nbeyond the Standard Model under global and gauge anomaly constraints. \nWe will show that the general construction can accommodate new physics\non the Energy Frontier including new heavy leptons and massive neutrinos. The related dark\nmatter content of the theory implies interesting scenarios for future investigations. \nAs a first step, model building requires a consistent \nElectroweak multiplet structure with a simple realization \nof the composite Higgs mechanism from sextet gauge dynamics.\n\n\\subsection{The Electroweak (EW) multiplet structure of sextet fermions}\n\nAs in the minimal scheme of Susskind~\\cite{Susskind:1978ms} and Weinberg~\\cite{Weinberg:1979bn}, \nthe gauge group of the theory  is \n${\\rm SU(3)_{bsm}\\!\\otimes\\!SU(3)_c\\!\\otimes\\!SU(2)_w\\!\\otimes\\!U(1)_Y}$ where  ${\\rm SU(3)_c}$ designates \nthe QCD color gauge group and ${\\rm SU(3)_{bsm}}$ represents the BSM color gauge group \nof the new strong gauge force.\nIn addition to quarks and leptons of the Standard Model, we include one ${\\rm SU(2)}$ \nbsm-flavor doublet ${\\rm  (u,d)}$ of fermions which are ${\\rm SU(3)_c}$ singlets and transform \nin the six-dimensional sextet representation of bsm-color, distinct from\nthe fundamental color representation of fermions in the original Technicolor\nscheme~\\cite{Susskind:1978ms,Weinberg:1979bn}. \nThe formal designation ${\\rm  (u,d)}$ for the bsm-flavor doublet of sextet fermions uses a similar notation \nto the two light quarks of QCD but describes completely different physics. \nThe massless sextet fermions form two chiral doublets \n${\\rm (u,d)_L}$ and ${\\rm (u,d)_R}$ under the global symmetry group\n${\\rm SU(2)_L\\!\\otimes\\!SU(2)_R\\otimes\\!U(1)_B}$. Baryon number\nis conserved \nfor quarks of the Standard Model separate from baryon number conservation \nfor sextet fermions which carry $1/3$ of BSM baryon charge associated with the BSM sector of the global ${\\rm U(1)_B}$  symmetry.\n\t\nIt is straightforward to define \nconsistent multiplets  for the sextet fermion flavor doublet \nunder the ${\\rm SU(2)_w\\!\\otimes\\!U(1)_Y}$ Electroweak gauge group\nwith hypercharge assignments for left- and right-handed fermions \ntransforming under the ${\\rm SU(2)_w}$  weak isospin group.\n\nThe two fermion flavors ${\\rm {u^{ab}}}$ and ${\\rm d^{ab}}$ of the strongly coupled sector\ncarry six colors in two-index symmetric tensor notation,\n${\\rm a,b = 1,2,3}$,  associated with the gauge force of the ${\\rm SU(3)_{bsm}}$ group.\nThis is equivalent to a six-dimensional vector notation in the sextet representation.\n\nThe fermions transform as left-handed weak isospin doublets\nand right-handed weak isospin singlets for each color,\n\n\n", "index": 1, "text": "\\begin{equation}\n{\\rm \\psi^{ab}_L = \\left(\\begin{array}{c}  {\\rm u^{ab}_L} \\\\  {\\rm d^{ab}_L }\\end{array}\\right) , \\qquad \\psi^{ab}_R = (u^{ab}_R ,\\; d^{ab}_R) }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\psi^{ab}_{L}=\\left(\\begin{array}[]{c}{\\rm u^{ab}_{L}}\\\\&#10;{\\rm d^{ab}_{L}}\\end{array}\\right),\\qquad\\psi^{ab}_{R}=(u^{ab}_{R},\\;d^{ab}_{R%&#10;})}.\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>ψ</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup><mo>=</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup></mtd></mtr><mtr><mtd columnalign=\"center\"><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo rspace=\"22.5pt\">,</mo><mrow><msubsup><mi>ψ</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo>=</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo rspace=\"5.3pt\">,</mo><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\nwhere  ${\\rm Y=2(Q-T_3)}$ with electric charge ${\\rm Q}$, and \n${\\rm T_3}$ as the third component of weak isospin. \n\nThere are two simple solutions for BSM model building with sextet fermions to satisfy \nthe Witten anomaly condition and\ngauge anomaly constraints on tr(Y) and ${\\rm tr(Y^3)}$ in Eq.~(\\ref{eq:hyper}). \nThe first solution with the choice ${\\rm Y(f_L)=0}$ for doublets of left-handed sextet fermions ${(\\rm f_L)}$\nleads  to half-integer electric charges for composite baryons. The second solution\nwith the  choice ${\\rm Y(f_L)=1/3}$ for doublets of left-handed sextet fermions leads to integer electric charges\nfor composite baryons.  The hypercharges of right-handed singlets are automatically set from\nconsistent electric charge assignments in both cases. The two choices are discussed next \nwith their implications.\n\n\n\\subsection{EW content from Y(${\\rm f_L}$)=0 with baryons of half-integer electric charge Q}\n\nSince left-handed fermion doublets occur with an even number of sextet colors in the strong sector, \nthe global anomaly condition is automatically satisfied for the first solution without  adding any new \nleft-handed lepton doublets to the theory.\nGauge anomaly cancellation in this case requires Y=0  assigned \nto left-handed doublets of fermions \nwith sextet color (a,b) in the two-index symmetric tensor representation,\n\n\n", "itemtype": "equation", "pos": 22136, "prevtext": "\n\nWith this choice of representations, the normalization for the hypercharge ${\\rm Y}$ \nof the ${\\rm U(1)_Y}$ gauge group is \ndefined by the relation ${\\rm Y=2(Q-T_3)}$, with  ${\\rm T_3}$ designating the third component of weak isospin.\n\n\n\nOnce Electroweak gauge interactions are turned on, \nthe chiral symmetry breaking pattern  ${\\rm SU(2)_L\\!\\otimes\\!SU(2)_R \\rightarrow SU(2)_V}$ \nof strong dynamics breaks  Electroweak symmetry in the expected pattern,\n${\\rm SU(2)_w \\times U(1)_Y \\rightarrow U(1)_{\\rm em}}$, and with the simultaneous\ndynamical realization of the composite Higgs mechanism. It is important to note that the \ndynamical Higgs mechanism is facilitated through the electroweak gauge couplings of\nthe sextet fermions and does not depend on the hypercharge assignments \nof the multiplets~\\cite{Susskind:1978ms}. \n\n\nHypercharges of left-handed doublets and right-handed singlets\nare determined from anomaly constraints and  consistent\nelectric charge assignments for fermions.  \nApparently, there are two simple solutions to the anomaly constraints\nwith different hypercharge assignments for \nleft-handed doublets. However,\nonly one of them avoids consistency problems with what we know about the relic abundance\nof dark baryons from their primordial evolution in the early Universe. \nBefore we describe the two different solutions to anomaly constraints in Section 4 with related implications,\nit is useful to briefly review first the merits of the sextet model for the minimal \nrealization of the composite Higgs mechanism\nwhich is independent of the two different hypercharge choices for left-handed doublets.\n\n\\subsection{The minimal composite Higgs in the sextet model}\n\nThe chiral symmetry breaking pattern ${\\rm SU(2)_L\\!\\otimes\\! SU(2)_R\\rightarrow SU(2)_V}$  of the \n${\\rm SU(2)}$ BSM flavor group of sextet fermions generates an isotriplet of three massless Goldstone \nbosons in the chiral limit. \n\nThe three Goldstones\nwill become longitudinal modes of the ${ W^{\\pm}}$ and $Z^0$ weak gauge bosons via the dynamical \nHiggs mechanism when the Electroweak interactions are turned on. This minimal realization of the composite Higgs\nmechanism comes from the perfect match between the longitudinal Electroweak gauge bosons \nand three massless Goldstone bosons  from sextet strong dynamics as one of the most \nattractive features of this BSM theory.\nIt is near-conformal with just one ${\\rm SU(2)}$  fermion flavor doublet with unexpected spectroscopy,\ndistinct from old Technicolor. We already noted that the\ndynamical Higgs mechanism does not depend on the electric charge assignment of the (u,d) fermion pair\nwith left-handed doublets and right-handed singlets as would be determined \nfrom the choice of hypercharges ${\\rm Y}$\nunder the weak isospin gauge group ${\\rm SU(2)_w}$. Independent of ${\\rm Y}$, \nthe three Goldstone bosons always have the correct \ninteger electric charges ${\\rm (\\pm 1,0)}$ to morph into the longitudinal components of the weak bosons as further\ndetailed in Section 4.\nSince the sextet gauge model is naturally located very close to the lower edge of the conformal window \nwithout fine tuning, a light scalar with a far separated resonance spectrum is expected from strong dynamics,\nmaking the minimal Higgs mechanism of the model economic and attractive.\n\nIn contrast, the condition of near-conformal behavior with fermions  in the fundamental \nrepresentations of ${\\rm SU(3) }$ bsm-color\nrequires a large number of fermion flavors in the BSM construction which leads to an excess of unwanted \nmassless Goldstone bosons. \n\n\n\n\nThe added complexities can be illustrated with the well-known one-family model\nfrom the Technicolor era with global flavor symmetry \n${\\rm SU(8)_L\\!\\otimes\\!SU(8)_R}$  of eight massless chiral fermions carrying bsm-color \nin the fundamental representation of the ${\\rm SU(3)}$ gauge group~\\cite{Farhi:1980xs}.\nIn the new near-conformal BSM paradigm a minimum of eight flavors is needed in the fundamental color\nrepresentation to get closer to the conformal window.  This motivated recent studies of the \neight-flavor fermion model to understand the\nstrong BSM force of the one-family model from several lattice studies~\\cite{Fodor:2009wk,Aoki:2014oha,Fodor:2015baa,Hasenfratz:2014rna,Appelquist:2014zsa,Schaich:2015psa}.\n\nThe  ${\\rm \\chi SB}$ pattern  ${\\rm SU(8)_L\\!\\otimes\\!SU(8)_R\\rightarrow SU(8)_V}$  generates 63 Goldstone bosons \nwith only three needed in the composite Higgs mechanism.\nGenerating masses for the excess unwanted Goldstone bosons  presents \nnon-trivial phenomenological challenges, making it more difficult to achieve the \ndesired goal of a near-conformal spectrum with a light $0^{++}$ scalar \nfar separated from resonance excitations.\n\n\\section{Constraints from global and gauge anomalies}\n\nAssuming that the strongly coupled gauge sector of the sextet model turns out to be compatible \nwith resonances \nin the 2-3 TeV region, a more complete BSM outlook of the model would come into focus,\nguided by anomaly constraints. \nWe will show that the existence of stable baryons in the sextet model when combined with our understanding \nof the early Universe requires anomalous fermion representation in the Electroweak sector. \n\nAlthough the sextet BSM model cannot offer a UV complete solution\nfor fermion mass generation and the related flavor problem, the outlook for new physics \nfrom extending the strongly coupled gauge sector guided by anomaly constraints is necessary. \n\nAnomaly compensating new physics has several important and immediate aspects \nwithout deference to physics on the scale of UV completion. \nIt provides an outlook and framework for new \nphysics the model can predict, or accommodate on several energy scales. \nAnomalies not only can predict or accommodate plausible new\nfermion content at the TeV scale but also give insight into\nElectroweak corrections to Standard Model expectations.\nThe example we will provide below is the anomaly canceling \npair of two massive lepton doublets (and associated right-handed singlets) to cancel the \nanomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}) from left-handed sextet fermion\ndoublets. New charged lepton \nand neutrino masses are partially constrained parameters in this anomaly matching extension.\nEven if the new fermion masses are set to very high energy scales, \ntheir infrared effects from the associated anomaly content will always survive. \nThe best known examples of this footprint from integrating out heavy fermions include\nthe Wess-Zumino effective action and other residual effects on the Electroweak scale~\\cite{D'Hoker:1984ph,D'Hoker:1984pc,Preskill:1990fr,D'Hoker:1992bv}.\n\n\n\\subsection{Anomaly conditions in the sextet model}\n\nAnomaly constraints have a long history in Technicolor motivated BSM model building with \nrepresentative examples \nin~\\cite{Dietrich:2005jn,Kainulainen:2006wq,Foadi:2007ue,Antola:2009wq,Kainulainen:2009rb}.\nThe first condition for model construction with left-handed doublets is the global Witten anomaly \nconstraint which requires an even number of left-handed SU(2) multiplets to \navoid inconsistency in the theory from a vanishing fermion determinant of the partition function~\\cite{Witten:1982fp}.\n\nIn addition, gauge anomaly constraints also have to be satisfied~\\cite{Adler:1969er}. \nWith vector current ${\\rm  V^i_\\mu(x)=\\overline{\\psi}T^i\\gamma_\\mu\\psi(x)}$ and axial current \n ${\\rm A^i_\\mu(x)=\\overline{\\psi}T^i\\gamma_\\mu\\gamma_5\\psi(x)}$\nconstructed from fermion fields and internal symmetry matrices ${\\rm T^i}$ in some group representation \nR for fermions, the anomaly in the axial vector Ward\nidentity is proportional to ${\\rm tr(\\{T^i(R),T^j(R)\\}T^k(R))}$ and must vanish. \nIn the sextet theory fermions are either left-handed doublets or right-handed singlets \nunder the ${\\rm SU(2)_w}$ gauge group. \nThe matrices ${\\rm T^i}$  will be either the ${\\rm \\tau^i}$ Pauli matrices \nor the diagonal ${\\rm U(1)}$ hypercharge ${\\rm Y}$.\nSince the ${\\rm SU(2)}$  group is  anomaly free, ${\\rm tr(\\{\\tau^i,\\tau^j\\}\\tau^k)=0}$, \nwe only need to consider anomalies where at least one ${\\rm T^i}$ is the hypercharge Y.\nThe non-trivial constraints come from two conditions on hypercharge traces,\n\n\n\n", "index": 3, "text": "\\begin{equation}\n\n{\\rm tr(Y )=0, \\quad tr(Y^3) \\propto tr(Q^2T_3 - QT^2_3) = 0}\\;, \n\n\\label{eq:hyper}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;{\\rm tr(Y)=0,\\quad tr(Y^{3})\\propto tr(Q^{2}T_{3}-QT^{2}_{3})=0}\\;,\\par&#10;\" display=\"block\"><mrow><mrow><mrow><mrow><mi>tr</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>tr</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi mathvariant=\"normal\">Y</mi><mn>3</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><mi>tr</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi mathvariant=\"normal\">Q</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi mathvariant=\"normal\">T</mi><mn>3</mn></msub></mrow><mo>-</mo><msubsup><mi>QT</mi><mn>3</mn><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+2.8pt\"><mn>0</mn></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\nleading to fractional charges ${\\rm Q(u_L) = 1/2}$ and ${\\rm Q(d_L) = -1/2}$ from the \n${\\rm Y=2(Q-T_3)}$ relation. \nHypercharges  in Eq.~(\\ref{eq:typeA})  \nare set for right-handed fermions  from consistent electric charge \nassignments ${\\rm Q(u_R) = 1/2}$ and ${\\rm Q(d_R) = -1/2}$. \n\nThe minimal Electroweak content with the choice ${\\rm Y(f_L)=0}$  \nleads \n\nto baryon states of three constituents forming flavor isospin doublets \nwith a half unit of positive electric charge for isospin +1/2 with (uud) content and a half unit of negative electric charge\nfor isospin -1/2 with (udd) content. This is in sharp contrast to electric charges carried \nby the proton and neutron in QCD\nwhere the Witten anomaly of three left-handed color doublets of (u,d)  quarks \nis compensated by the left-handed lepton doublet of the Electroweak theory. \nThe first generation of quarks and leptons then allows \nthe well-known choice of electric charges  \n${\\rm Q(u) = 2/3}$ and ${\\rm Q(d) = -1/3}$,\ncompatible with gauge anomaly constraints and the pattern applied to all three generations. \nAs a consequence, baryons in QCD carry integer electric charges.\nThe unique solution to anomaly constraints in the Standard Model is consistent\nwith direct observations of the full\nparticle content including quark and lepton quantum numbers \nmatching all the anomaly conditions.\n\n\n\n\nIn the sextet BSM theory we do not have direct observations on new heavy baryons\nto set unique  hypercharge\nassignments for left-handed doublets and right-handed singlets of sextet fermions from one of two alternate \nsolutions to the anomaly conditions. \nViability of the choices  ${\\rm Y(f_L)=0}$, or  ${\\rm Y(f_L)=1/3}$,  is\naffected by the different electric charge assignments they imply. \n\nWith heavy baryon masses in the 3 TeV range, as determined from our lattice simulations in Sections 6 and 7 outside the reach of immediate accelerator search, \nour understanding of the early Universe\nprovides important input concerning the two simple anomaly solutions.\n\nThe seemingly minimal solution with ${\\rm Y=0}$ for left-handed doublets would lead to intriguing \npredictions of baryon states with half-integer electric charges for future accelerator searches and relics\nwith fractional electric charges from the early Universe with observable consequences.\n\nProblems with half-integer electric charges, from the choice ${\\rm Y(f_L)=0}$ in our case, were anticipated earlier \nfrom strong observational limits on stable fractional charges in the early Universe \nand their terrestrial relics~\\cite{Chivukula:1989qb,Langacker:2011db}.\nSpecifically, the sextet model inheriting this problem (with a related discussion deferred to Section 5)\nleads to the non-controversial ${\\rm Y(f_L)=1/3}$ anomaly solution with new BSM implications and outlook.\n\n\n\\subsection{EW content from Y(${\\rm f_L}$)=1/3 with baryons of integer electric charge Q}\n\nMotivated by problems of the anomaly-free selection with half-integer electric charges,\nwe are now lead to consider the Electroweak content with sextet model baryons carrying integer electric charges \nwhich requires non-zero hypercharge for  left-handed fermions with sextet color, in close analogy\nwith the Standard Model pattern of fractional electric charges carried by three colors of quarks\nand integer charges carried by baryons in QCD. \n\nHypercharge assignment ${\\rm Y=1/3}$ is set for the left-handed sextet fermion doublets with consistent\nchoices required for right-handed singlets,\n\n\n", "itemtype": "equation", "pos": 23607, "prevtext": "\n\nwhere  ${\\rm Y=2(Q-T_3)}$ with electric charge ${\\rm Q}$, and \n${\\rm T_3}$ as the third component of weak isospin. \n\nThere are two simple solutions for BSM model building with sextet fermions to satisfy \nthe Witten anomaly condition and\ngauge anomaly constraints on tr(Y) and ${\\rm tr(Y^3)}$ in Eq.~(\\ref{eq:hyper}). \nThe first solution with the choice ${\\rm Y(f_L)=0}$ for doublets of left-handed sextet fermions ${(\\rm f_L)}$\nleads  to half-integer electric charges for composite baryons. The second solution\nwith the  choice ${\\rm Y(f_L)=1/3}$ for doublets of left-handed sextet fermions leads to integer electric charges\nfor composite baryons.  The hypercharges of right-handed singlets are automatically set from\nconsistent electric charge assignments in both cases. The two choices are discussed next \nwith their implications.\n\n\n\\subsection{EW content from Y(${\\rm f_L}$)=0 with baryons of half-integer electric charge Q}\n\nSince left-handed fermion doublets occur with an even number of sextet colors in the strong sector, \nthe global anomaly condition is automatically satisfied for the first solution without  adding any new \nleft-handed lepton doublets to the theory.\nGauge anomaly cancellation in this case requires Y=0  assigned \nto left-handed doublets of fermions \nwith sextet color (a,b) in the two-index symmetric tensor representation,\n\n\n", "index": 5, "text": "\\begin{equation}\n\n{\\rm Y(u_L^{ab}) =0, \\quad Y(d_L^{ab}) = 0, \\quad Y(u_R^{ab}) = 1, \\quad Y(d_R^{ab}) = -1}\\;,\n\n\\label{eq:typeA}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;{\\rm Y(u_{L}^{ab})=0,\\quad Y(d_{L}^{ab})=0,\\quad Y(u_{R}^{ab})=1,\\quad Y(%&#10;d_{R}^{ab})=-1}\\;,\\par&#10;\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>1</mn></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mpadded width=\"+2.8pt\"><mn>1</mn></mpadded></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\nEq.~(\\ref{eq:typeB}) leads to QCD-like electric charge assignments for sextet fermions with ${\\rm Q(u)=2/3}$ and ${\\rm Q(d)=-1/3}$.\nThe ${\\rm Y=1/3}$  hypercharge assignment for left-handed doublets\nimplies integer electric charges for composite baryons, built from three\nfermions of sextet color. The fermion content of the baryon doublet is given by\n${\\rm (uud) ~isospin=+1/2, ~Q=+1}$   and ${\\rm (udd) ~isospin=-1/2, ~Q=0}$,  in contrast to the\nhypercharge selection ${\\rm Y=0}$ leading to baryons of half-integer electric charges. \n\nWith six left-handed doublets there is no Witten anomaly, but  ${\\rm Y=1/3}$ for the left-handed doublets,\nnecessary to get integer electric charges \nfor composite baryons, leads to gauge anomalies,\n\n\\begin{eqnarray}\n\n&&{\\rm tr(Y )=6\\Big\\{\\frac{1}{3}\\times 2 + \\frac{4}{3} - \\frac{2}{3}\\Big\\} = 8},  \n \\label{eq:Banomaly1} \\\\ \n&&{\\rm tr\\big(Y^3\\big) \\propto tr\\big(Q^2T_3 - QT^2_3\\big)=\n\t6\\Big\\{\\big(\\frac{2}{3}\\big)^2\\times \\frac{1}{2} - \\big(\\frac{1}{3}\\big)^2\\times \\frac{1}{2} -\\frac{2}{3}\\times \\frac{1}{4} \n\t+ \\frac{1}{3}\\times \\frac{1}{4} \\Big\\}=\\frac{1}{2}}.     \n\n\\label{eq:Banomaly2}\n\\end{eqnarray}\n\nThe anomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}) have \nto be compensated with new physics from some unknown scale. Once a commitment is made \nto the ${\\rm Y=1/3}$ choice with integer electric charges for sextet model baryons,  infrared effects \nfrom anomaly compensating new physics cannot be ignored and will affect Electroweak precision tests\nand other predictions on the Electroweak scale. \nAs we will argue in Section 5, the non-controversial second type of  hypercharge choice, ${\\rm Y(f_L)=1/3}$,\nleads to relic stable baryons from the early Universe. These baryons are neutral\nwithout direct conflict from limits on galactic and terrestrial charged relics but they require  new physics\nto compensate the  anomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}).\n\n\n\\subsection{Y(${\\rm f_L}$)=1/3 anomaly cancellation with new left-handed lepton doublets}\n\nThe viable extension of the strongly coupled sextet gauge sector is anticipated from the anomaly \ncancellation mechanism of new left-handed fermion doublets. \nThe absence of a global SU(2) anomaly in the strongly coupled gauge sector requires the addition of a \npair of left-handed fermion doublets. They are introduced as singlets under SU(3) QCD color\nand SU(3) bsm-color. \nGauge anomaly constraints require the choice  ${\\rm Y\\neq 0}$ hypercharge assignment \nfor the left-handed fermion doublets to compensate the anomalies from sextet fermions as counted in \nEqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}). Consistent hypercharge \nassignments for right-handed singlets completes the solution for anomaly cancellation.\n\nFor simplicity,\nwe will use the notation of lepton families with a new family label   ${\\rm \\alpha = 1,2}$,\n\n\n", "itemtype": "equation", "pos": 27244, "prevtext": "\n\nleading to fractional charges ${\\rm Q(u_L) = 1/2}$ and ${\\rm Q(d_L) = -1/2}$ from the \n${\\rm Y=2(Q-T_3)}$ relation. \nHypercharges  in Eq.~(\\ref{eq:typeA})  \nare set for right-handed fermions  from consistent electric charge \nassignments ${\\rm Q(u_R) = 1/2}$ and ${\\rm Q(d_R) = -1/2}$. \n\nThe minimal Electroweak content with the choice ${\\rm Y(f_L)=0}$  \nleads \n\nto baryon states of three constituents forming flavor isospin doublets \nwith a half unit of positive electric charge for isospin +1/2 with (uud) content and a half unit of negative electric charge\nfor isospin -1/2 with (udd) content. This is in sharp contrast to electric charges carried \nby the proton and neutron in QCD\nwhere the Witten anomaly of three left-handed color doublets of (u,d)  quarks \nis compensated by the left-handed lepton doublet of the Electroweak theory. \nThe first generation of quarks and leptons then allows \nthe well-known choice of electric charges  \n${\\rm Q(u) = 2/3}$ and ${\\rm Q(d) = -1/3}$,\ncompatible with gauge anomaly constraints and the pattern applied to all three generations. \nAs a consequence, baryons in QCD carry integer electric charges.\nThe unique solution to anomaly constraints in the Standard Model is consistent\nwith direct observations of the full\nparticle content including quark and lepton quantum numbers \nmatching all the anomaly conditions.\n\n\n\n\nIn the sextet BSM theory we do not have direct observations on new heavy baryons\nto set unique  hypercharge\nassignments for left-handed doublets and right-handed singlets of sextet fermions from one of two alternate \nsolutions to the anomaly conditions. \nViability of the choices  ${\\rm Y(f_L)=0}$, or  ${\\rm Y(f_L)=1/3}$,  is\naffected by the different electric charge assignments they imply. \n\nWith heavy baryon masses in the 3 TeV range, as determined from our lattice simulations in Sections 6 and 7 outside the reach of immediate accelerator search, \nour understanding of the early Universe\nprovides important input concerning the two simple anomaly solutions.\n\nThe seemingly minimal solution with ${\\rm Y=0}$ for left-handed doublets would lead to intriguing \npredictions of baryon states with half-integer electric charges for future accelerator searches and relics\nwith fractional electric charges from the early Universe with observable consequences.\n\nProblems with half-integer electric charges, from the choice ${\\rm Y(f_L)=0}$ in our case, were anticipated earlier \nfrom strong observational limits on stable fractional charges in the early Universe \nand their terrestrial relics~\\cite{Chivukula:1989qb,Langacker:2011db}.\nSpecifically, the sextet model inheriting this problem (with a related discussion deferred to Section 5)\nleads to the non-controversial ${\\rm Y(f_L)=1/3}$ anomaly solution with new BSM implications and outlook.\n\n\n\\subsection{EW content from Y(${\\rm f_L}$)=1/3 with baryons of integer electric charge Q}\n\nMotivated by problems of the anomaly-free selection with half-integer electric charges,\nwe are now lead to consider the Electroweak content with sextet model baryons carrying integer electric charges \nwhich requires non-zero hypercharge for  left-handed fermions with sextet color, in close analogy\nwith the Standard Model pattern of fractional electric charges carried by three colors of quarks\nand integer charges carried by baryons in QCD. \n\nHypercharge assignment ${\\rm Y=1/3}$ is set for the left-handed sextet fermion doublets with consistent\nchoices required for right-handed singlets,\n\n\n", "index": 7, "text": "\\begin{equation}\n\n{\\rm Y(u_L^{ab}) = 1/3, \\quad Y(d_L^{ab}) = 1/3, \\quad Y(u_R^{ab}) = 4/3, \\quad Y(d_R^{ab}) = -2/3}\\;.\n\n\\label{eq:typeB}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;{\\rm Y(u_{L}^{ab})=1/3,\\quad Y(d_{L}^{ab})=1/3,\\quad Y(u_{R}^{ab})=4/3,%&#10;\\quad Y(d_{R}^{ab})=-2/3}\\;.\\par&#10;\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">L</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">u</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>4</mn><mo>/</mo><mn>3</mn></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi mathvariant=\"normal\">Y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">d</mi><mi mathvariant=\"normal\">R</mi><mi>ab</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>/</mo><mpadded width=\"+2.8pt\"><mn>3</mn></mpadded></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\nIt should be noted that the addition of the two lepton families is different from adding complete \ngenerations of quarks and leptons in the Standard Model. Here lepton families are added only to the\nsextet fermion doublet of the strongly coupled gauge sector. \n\nAs described before, the hypercharge assignment ${\\rm Y=1/3}$ is set for the left-handed \nsextet fermion doublet with ${\\rm Y=4/3}$ for the right-handed singlet ${\\rm u_R}$ and\n${\\rm Y=-2/3}$ for ${\\rm d_R}$,\nleading to QCD-like charge assignments for sextet fermions with ${\\rm Q(u)=2/3}$ and ${\\rm Q(d)=-1/3}$.\n\nThe added pair of lepton doublets, without introducing global anomalies, allows  QCD-like charge assignment \nfor the sextet fermion doublet by canceling the gauge anomalies when hypercharge ${\\rm Y=-1}$ \nis set for  the new left handed leptons ${\\rm N_L^{(\\alpha)}}$, ${\\rm E_L^{(\\alpha)}}$.\nThe right-handed singlets  ${\\rm N_R^{(\\alpha)}}$ are assigned ${\\rm Y=0}$, and \n${\\rm Y=-2}$ is set for the right-handed singlets ${\\rm E_R^{(\\alpha)}}$. It is easy to check that both gauge \nanomaly constraints of Eq.~(\\ref{eq:hyper}) are satisfied. \nThe new leptons ${\\rm E^{(\\alpha)}}$ carry electric charge ${\\rm Q=-1}$\nand electric charge Q=0 is set for the massive neutrinos ${\\rm N^{(\\alpha)}}$. \n\nThe Lagrangian of the two lepton flavors include gauge invariant mass terms for charged \nleptons and massive neutrinos~\\cite{Kainulainen:2009rb,Akhmedov:2014kxa}. \nThe most general mass matrix\nwith mixing describes Dirac masses for \nthe charged leptons ${\\rm E_-^{(\\alpha)}}$ with two additional terms\nrepresenting Majorana masses for ${\\rm N_L^{(\\alpha)}}$ and ${\\rm N_R^{(\\alpha)}}$.\nAfter diagonalization of the ${\\rm 2\\times 2}$ mass matrix, each lepton family\n\nwill have two\nneutrino mass eigenstates ${\\rm M_1}$ and ${\\rm M_2}$ in addition to the charged lepton mass ${\\rm M_E}$ and\na tunable mixing angle $\\Theta$ from the Lagrangian mass parameters~\\cite{Akhmedov:2014kxa}.\nThe two families can be allowed to mix which leads to more options in the full mass spectrum.\n\nA more comprehensive analysis of the lepton sector in the sextet BSM model is beyond the scope\nof this work and will be reported in a separate publication~\\cite{Kuti:2015}. Here the lepton sector \nserves to illustrate the most\nplausible framework for BSM extension of the sextet model, compatible with anomaly conditions \nand integer electric charges for baryons. The lepton sector with its spectrum and quantum numbers \nalso provides useful general guidance for expected new effects on the Electroweak scale from a broad \nrange of mass parameters, or equivalently the low energy effective action with a Wess-Zumino term and\nother residual anomaly effects if we seek to integrate out the leptons \nasymptotically in the heavy mass limit. \nClearly, the BSM outlook of the sextet model remains quite flexible and interesting. \nHere we only briefly summarize our main findings so far:\n\n\\begin{itemize}\n\n\t\\item There exists a range of charged lepton masses and heavy neutrino masses which are\n\tnot in conflict with Electroweak precision tests. In addition, in that range the charged leptons\n\tcan decay and the lowest stable mass is a Majorana neutrino.\t\n\n\t\\item Stable and heavy Majorana neutrinos are  interesting Dark Matter candidates in the\n\tmass range where their relic densities are not\tin conflict with direct dark matter experiments, like \n\tXENON100~\\cite{Aprile:2012nq} and LUX2013~\\cite{Akerib:2013tjd}.\n\n\t\\item The Wess-Zumino action and its effects on the Electroweak scale can be identified from the \n\tfootprints of  heavy leptons and neutrinos of the model at very high energy scales.\n\n\t\\item Restrictions on heavy fermions from vacuum instability of the effective potential with \n\tthe composite  Higgs remain a difficult and  unresolved problem.\n\\end{itemize}\n\nLeaving further analysis of the lepton sector for future reporting, we will turn in Sections 6 and 7 \nto the baryon spectrum\nfrom non-perturbative simulations since it is not affected by the intriguing properties of the lepton sector.\nIn Section 5  we will explain first in some detail why fractional electric charge assignment for baryons\nis problematic and most likely excluded by what we understand from the early history of the Universe. \n\n\n\n\nThe well motivated ${\\rm Y(f_L)=1/3}$ solution to the anomaly constraints with two lepton flavors \nleads to stable relic baryons from the early Universe. These baryons are neutral\nand contribute to the missing dark matter content of the Universe. \nTheir relic abundance and direct detection limits in dark matter experiments \nrequire quantitative analysis decoupled from future developments in the lepton sector.\n\n\n\\section{Sextet model baryons and the early Universe}\n\n\nThere is an \nexactly conserved ${\\rm U(1)}$ symmetry which, when combined with exact electric charge conservation, \nmeans that there is a lightest stable baryon state in the spectrum which will be the primary focus of \nthe forthcoming discussion. There are several questions to consider:\n\n\n\\hskip 0.2 in -- the electric charge of the lightest and stable sextet model baryon,\n\\vskip 0.02 in \n\\hskip 0.2 in -- their galactic and terrestrial relic abundance,\n\\vskip 0.02 in \n\\hskip 0.2 in -- limits from direct detection in dark matter experiments.\n\n\\noindent We will discuss these questions with two different choices of hypercharges for the left-handed \ndoublets of sextet fermions.\n\n\n\n\\subsection{Sextet model baryons from Y(${\\rm f_L}$)=0  with half unit of electric charge}\n\nThe choice ${\\rm Y(f_L)=0}$ for left-handed bsm-flavor doublets of fermions \nin the sextet bsm-color representation \nleads to composite baryon states in the 3 TeV mass range with spin one-half and electric charge ${\\rm Q=\\pm 1/2}$.\nThe two lightest baryon states form a degenerate pair and transform as an isospin doublet  ${\\rm (uud,udd)}$ of bsm-flavor carrying half-integer electric charges of opposite sign. \n\nSince the lightest sextet baryon carries half-integer charge it\nremains stable after its formation in the early Universe below the Electroweak transition temperature.\nAdditional speculations on some charge conservation violating mechanism to make fractionally charged baryons\nunstable are outside the scope of the model and our discussion.\nThe lowest stable baryon state of the sextet model with spin one-half and electric charge one-half \nunder this anomaly free scenario belongs to the class of fractionally charged massive particles (FCHAMP)\nwhich have been discussed in several aspects before~\\cite{DeRujula:1989fe,Langacker:2011db}. \n\nArguments were presented against fractionally charged leptons with detailed estimates on their relic terrestrial density \nfrom the early Universe, strongly violating observational limits~\\cite{Perl:2009zz,Langacker:2011db}. \nEstimates of the relic terrestrial density\nof sextet model baryons with half-integer charge proceed along similar lines with some  uncertainties \nfrom non-perturbative strong gauge dynamics \nbinding the fermions into baryons. We will briefly review the charge-symmetric evolution of \nthese baryons in the early Universe. \nSome assumptions we will make on annihilation cross sections from strong gauge dynamics \nare unlikely to affect the qualitative conclusions on this problematic\nanomaly-free choice. Charge-asymmetric evolution would make the scenario even less likely.\n\n\n\n\n\nIn the symmetric thermal evolution under discussion, baryons and antibaryons will remain  in\nthermal equilibrium with decreasing charge-symmetric densities well below the Electroweak transition temperature.\nAt some freeze-out temperature ${T_*}$ the annihilation rate of baryons and antibaryons \ncannot keep up any longer with the expansion rate of the Universe. The \ntotal number of baryons and antibaryons remains approximately constant after freeze-out\nfor ${\\rm T \\ll T_*}$ and the relic abundance level is set\nfrom the solution of the Boltzman equation~\\cite{Steigman:1979kw}. The freeze-out temperature  \nand the relic sextet baryon number density ${\\rm n_{B_6}}$ relative to ordinary baryon number density ${\\rm n_B}$\nwill depend on the sextet baryon mass ${\\rm M_{B_6}}$ mass and the thermally averaged annihilation rate \n${\\rm \\langle\\sigma v \\rangle_{ann}}$ of sextet model baryons and antibaryons,\n\n\n", "itemtype": "equation", "pos": 30271, "prevtext": "\n\nEq.~(\\ref{eq:typeB}) leads to QCD-like electric charge assignments for sextet fermions with ${\\rm Q(u)=2/3}$ and ${\\rm Q(d)=-1/3}$.\nThe ${\\rm Y=1/3}$  hypercharge assignment for left-handed doublets\nimplies integer electric charges for composite baryons, built from three\nfermions of sextet color. The fermion content of the baryon doublet is given by\n${\\rm (uud) ~isospin=+1/2, ~Q=+1}$   and ${\\rm (udd) ~isospin=-1/2, ~Q=0}$,  in contrast to the\nhypercharge selection ${\\rm Y=0}$ leading to baryons of half-integer electric charges. \n\nWith six left-handed doublets there is no Witten anomaly, but  ${\\rm Y=1/3}$ for the left-handed doublets,\nnecessary to get integer electric charges \nfor composite baryons, leads to gauge anomalies,\n\n\\begin{eqnarray}\n\n&&{\\rm tr(Y )=6\\Big\\{\\frac{1}{3}\\times 2 + \\frac{4}{3} - \\frac{2}{3}\\Big\\} = 8},  \n \\label{eq:Banomaly1} \\\\ \n&&{\\rm tr\\big(Y^3\\big) \\propto tr\\big(Q^2T_3 - QT^2_3\\big)=\n\t6\\Big\\{\\big(\\frac{2}{3}\\big)^2\\times \\frac{1}{2} - \\big(\\frac{1}{3}\\big)^2\\times \\frac{1}{2} -\\frac{2}{3}\\times \\frac{1}{4} \n\t+ \\frac{1}{3}\\times \\frac{1}{4} \\Big\\}=\\frac{1}{2}}.     \n\n\\label{eq:Banomaly2}\n\\end{eqnarray}\n\nThe anomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}) have \nto be compensated with new physics from some unknown scale. Once a commitment is made \nto the ${\\rm Y=1/3}$ choice with integer electric charges for sextet model baryons,  infrared effects \nfrom anomaly compensating new physics cannot be ignored and will affect Electroweak precision tests\nand other predictions on the Electroweak scale. \nAs we will argue in Section 5, the non-controversial second type of  hypercharge choice, ${\\rm Y(f_L)=1/3}$,\nleads to relic stable baryons from the early Universe. These baryons are neutral\nwithout direct conflict from limits on galactic and terrestrial charged relics but they require  new physics\nto compensate the  anomalies in Eqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}).\n\n\n\\subsection{Y(${\\rm f_L}$)=1/3 anomaly cancellation with new left-handed lepton doublets}\n\nThe viable extension of the strongly coupled sextet gauge sector is anticipated from the anomaly \ncancellation mechanism of new left-handed fermion doublets. \nThe absence of a global SU(2) anomaly in the strongly coupled gauge sector requires the addition of a \npair of left-handed fermion doublets. They are introduced as singlets under SU(3) QCD color\nand SU(3) bsm-color. \nGauge anomaly constraints require the choice  ${\\rm Y\\neq 0}$ hypercharge assignment \nfor the left-handed fermion doublets to compensate the anomalies from sextet fermions as counted in \nEqs.~(\\ref{eq:Banomaly1}) and (\\ref{eq:Banomaly2}). Consistent hypercharge \nassignments for right-handed singlets completes the solution for anomaly cancellation.\n\nFor simplicity,\nwe will use the notation of lepton families with a new family label   ${\\rm \\alpha = 1,2}$,\n\n\n", "index": 9, "text": "\\begin{equation}\n{\\rm \\left(\\begin{array}{c} {\\rm N^{(\\alpha)}_L }\\\\ {\\rm E^{(\\alpha)}_L} \\end{array}\\right) , \\quad  (N^{(\\alpha)}_R ,\\; E^{(\\alpha)}_R),  \\quad \\alpha=1,2 }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\left(\\begin{array}[]{c}{\\rm N^{(\\alpha)}_{L}}\\\\&#10;{\\rm E^{(\\alpha)}_{L}}\\end{array}\\right),\\quad(N^{(\\alpha)}_{R},\\;E^{(\\alpha)}%&#10;_{R}),\\quad\\alpha=1,2}.\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msubsup><mi mathvariant=\"normal\">N</mi><mi mathvariant=\"normal\">L</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mtd></mtr><mtr><mtd columnalign=\"center\"><msubsup><mi mathvariant=\"normal\">E</mi><mi mathvariant=\"normal\">L</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mtd></mtr></mtable><mo>)</mo></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi mathvariant=\"normal\">N</mi><mi mathvariant=\"normal\">R</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo rspace=\"5.3pt\">,</mo><msubsup><mi mathvariant=\"normal\">E</mi><mi mathvariant=\"normal\">R</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">)</mo></mrow><mo rspace=\"12.5pt\">,</mo><mi>α</mi></mrow><mo>=</mo><mn>1</mn></mrow><mo>,</mo><mn>2</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\\label{eq:annihil}\n\nThe velocity dependent annihilation cross section ${\\rm \\sigma}$ is known for ordinary nucleons\nand will be estimated for sextet model baryons whose mass is approximately ${\\rm M_{B_6}=3~TeV}$, \nas reported in Section 7 from our non-perturbative \nlattice simulations. For a qualitative estimate, the thermally averaged annihilation rate \nof sextet model baryons is scaled down from the \nnucleon-antinucleon annihilation cross sections of QCD according to the generally accepted approximation,\n\n\n", "itemtype": "equation", "pos": 38746, "prevtext": "\n\nIt should be noted that the addition of the two lepton families is different from adding complete \ngenerations of quarks and leptons in the Standard Model. Here lepton families are added only to the\nsextet fermion doublet of the strongly coupled gauge sector. \n\nAs described before, the hypercharge assignment ${\\rm Y=1/3}$ is set for the left-handed \nsextet fermion doublet with ${\\rm Y=4/3}$ for the right-handed singlet ${\\rm u_R}$ and\n${\\rm Y=-2/3}$ for ${\\rm d_R}$,\nleading to QCD-like charge assignments for sextet fermions with ${\\rm Q(u)=2/3}$ and ${\\rm Q(d)=-1/3}$.\n\nThe added pair of lepton doublets, without introducing global anomalies, allows  QCD-like charge assignment \nfor the sextet fermion doublet by canceling the gauge anomalies when hypercharge ${\\rm Y=-1}$ \nis set for  the new left handed leptons ${\\rm N_L^{(\\alpha)}}$, ${\\rm E_L^{(\\alpha)}}$.\nThe right-handed singlets  ${\\rm N_R^{(\\alpha)}}$ are assigned ${\\rm Y=0}$, and \n${\\rm Y=-2}$ is set for the right-handed singlets ${\\rm E_R^{(\\alpha)}}$. It is easy to check that both gauge \nanomaly constraints of Eq.~(\\ref{eq:hyper}) are satisfied. \nThe new leptons ${\\rm E^{(\\alpha)}}$ carry electric charge ${\\rm Q=-1}$\nand electric charge Q=0 is set for the massive neutrinos ${\\rm N^{(\\alpha)}}$. \n\nThe Lagrangian of the two lepton flavors include gauge invariant mass terms for charged \nleptons and massive neutrinos~\\cite{Kainulainen:2009rb,Akhmedov:2014kxa}. \nThe most general mass matrix\nwith mixing describes Dirac masses for \nthe charged leptons ${\\rm E_-^{(\\alpha)}}$ with two additional terms\nrepresenting Majorana masses for ${\\rm N_L^{(\\alpha)}}$ and ${\\rm N_R^{(\\alpha)}}$.\nAfter diagonalization of the ${\\rm 2\\times 2}$ mass matrix, each lepton family\n\nwill have two\nneutrino mass eigenstates ${\\rm M_1}$ and ${\\rm M_2}$ in addition to the charged lepton mass ${\\rm M_E}$ and\na tunable mixing angle $\\Theta$ from the Lagrangian mass parameters~\\cite{Akhmedov:2014kxa}.\nThe two families can be allowed to mix which leads to more options in the full mass spectrum.\n\nA more comprehensive analysis of the lepton sector in the sextet BSM model is beyond the scope\nof this work and will be reported in a separate publication~\\cite{Kuti:2015}. Here the lepton sector \nserves to illustrate the most\nplausible framework for BSM extension of the sextet model, compatible with anomaly conditions \nand integer electric charges for baryons. The lepton sector with its spectrum and quantum numbers \nalso provides useful general guidance for expected new effects on the Electroweak scale from a broad \nrange of mass parameters, or equivalently the low energy effective action with a Wess-Zumino term and\nother residual anomaly effects if we seek to integrate out the leptons \nasymptotically in the heavy mass limit. \nClearly, the BSM outlook of the sextet model remains quite flexible and interesting. \nHere we only briefly summarize our main findings so far:\n\n\\begin{itemize}\n\n\t\\item There exists a range of charged lepton masses and heavy neutrino masses which are\n\tnot in conflict with Electroweak precision tests. In addition, in that range the charged leptons\n\tcan decay and the lowest stable mass is a Majorana neutrino.\t\n\n\t\\item Stable and heavy Majorana neutrinos are  interesting Dark Matter candidates in the\n\tmass range where their relic densities are not\tin conflict with direct dark matter experiments, like \n\tXENON100~\\cite{Aprile:2012nq} and LUX2013~\\cite{Akerib:2013tjd}.\n\n\t\\item The Wess-Zumino action and its effects on the Electroweak scale can be identified from the \n\tfootprints of  heavy leptons and neutrinos of the model at very high energy scales.\n\n\t\\item Restrictions on heavy fermions from vacuum instability of the effective potential with \n\tthe composite  Higgs remain a difficult and  unresolved problem.\n\\end{itemize}\n\nLeaving further analysis of the lepton sector for future reporting, we will turn in Sections 6 and 7 \nto the baryon spectrum\nfrom non-perturbative simulations since it is not affected by the intriguing properties of the lepton sector.\nIn Section 5  we will explain first in some detail why fractional electric charge assignment for baryons\nis problematic and most likely excluded by what we understand from the early history of the Universe. \n\n\n\n\nThe well motivated ${\\rm Y(f_L)=1/3}$ solution to the anomaly constraints with two lepton flavors \nleads to stable relic baryons from the early Universe. These baryons are neutral\nand contribute to the missing dark matter content of the Universe. \nTheir relic abundance and direct detection limits in dark matter experiments \nrequire quantitative analysis decoupled from future developments in the lepton sector.\n\n\n\\section{Sextet model baryons and the early Universe}\n\n\nThere is an \nexactly conserved ${\\rm U(1)}$ symmetry which, when combined with exact electric charge conservation, \nmeans that there is a lightest stable baryon state in the spectrum which will be the primary focus of \nthe forthcoming discussion. There are several questions to consider:\n\n\n\\hskip 0.2 in -- the electric charge of the lightest and stable sextet model baryon,\n\\vskip 0.02 in \n\\hskip 0.2 in -- their galactic and terrestrial relic abundance,\n\\vskip 0.02 in \n\\hskip 0.2 in -- limits from direct detection in dark matter experiments.\n\n\\noindent We will discuss these questions with two different choices of hypercharges for the left-handed \ndoublets of sextet fermions.\n\n\n\n\\subsection{Sextet model baryons from Y(${\\rm f_L}$)=0  with half unit of electric charge}\n\nThe choice ${\\rm Y(f_L)=0}$ for left-handed bsm-flavor doublets of fermions \nin the sextet bsm-color representation \nleads to composite baryon states in the 3 TeV mass range with spin one-half and electric charge ${\\rm Q=\\pm 1/2}$.\nThe two lightest baryon states form a degenerate pair and transform as an isospin doublet  ${\\rm (uud,udd)}$ of bsm-flavor carrying half-integer electric charges of opposite sign. \n\nSince the lightest sextet baryon carries half-integer charge it\nremains stable after its formation in the early Universe below the Electroweak transition temperature.\nAdditional speculations on some charge conservation violating mechanism to make fractionally charged baryons\nunstable are outside the scope of the model and our discussion.\nThe lowest stable baryon state of the sextet model with spin one-half and electric charge one-half \nunder this anomaly free scenario belongs to the class of fractionally charged massive particles (FCHAMP)\nwhich have been discussed in several aspects before~\\cite{DeRujula:1989fe,Langacker:2011db}. \n\nArguments were presented against fractionally charged leptons with detailed estimates on their relic terrestrial density \nfrom the early Universe, strongly violating observational limits~\\cite{Perl:2009zz,Langacker:2011db}. \nEstimates of the relic terrestrial density\nof sextet model baryons with half-integer charge proceed along similar lines with some  uncertainties \nfrom non-perturbative strong gauge dynamics \nbinding the fermions into baryons. We will briefly review the charge-symmetric evolution of \nthese baryons in the early Universe. \nSome assumptions we will make on annihilation cross sections from strong gauge dynamics \nare unlikely to affect the qualitative conclusions on this problematic\nanomaly-free choice. Charge-asymmetric evolution would make the scenario even less likely.\n\n\n\n\n\nIn the symmetric thermal evolution under discussion, baryons and antibaryons will remain  in\nthermal equilibrium with decreasing charge-symmetric densities well below the Electroweak transition temperature.\nAt some freeze-out temperature ${T_*}$ the annihilation rate of baryons and antibaryons \ncannot keep up any longer with the expansion rate of the Universe. The \ntotal number of baryons and antibaryons remains approximately constant after freeze-out\nfor ${\\rm T \\ll T_*}$ and the relic abundance level is set\nfrom the solution of the Boltzman equation~\\cite{Steigman:1979kw}. The freeze-out temperature  \nand the relic sextet baryon number density ${\\rm n_{B_6}}$ relative to ordinary baryon number density ${\\rm n_B}$\nwill depend on the sextet baryon mass ${\\rm M_{B_6}}$ mass and the thermally averaged annihilation rate \n${\\rm \\langle\\sigma v \\rangle_{ann}}$ of sextet model baryons and antibaryons,\n\n\n", "index": 11, "text": "\\begin{equation}\n{\\rm  \\frac{n_{B_6}}{n_B} \\approx \\frac{10^{-25}}{M_{B_6}\\langle\\sigma v \\rangle_{ann}}}\\;.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\frac{n_{B_{6}}}{n_{B}}\\approx\\frac{10^{-25}}{M_{B_{6}}\\langle\\sigma v%&#10;\\rangle_{ann}}}\\;.\" display=\"block\"><mrow><mrow><mfrac><msub><mi mathvariant=\"normal\">n</mi><msub><mi mathvariant=\"normal\">B</mi><mn>6</mn></msub></msub><msub><mi mathvariant=\"normal\">n</mi><mi mathvariant=\"normal\">B</mi></msub></mfrac><mo>≈</mo><mpadded width=\"+2.8pt\"><mfrac><msup><mn>10</mn><mrow><mo>-</mo><mn>25</mn></mrow></msup><mrow><msub><mi mathvariant=\"normal\">M</mi><msub><mi mathvariant=\"normal\">B</mi><mn>6</mn></msub></msub><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi>σ</mi><mo>⁢</mo><mi mathvariant=\"normal\">v</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>ann</mi></msub></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\n\nBased on the value of ${\\rm M_{B_6}}$ we determined and using the rough estimate of the annihilation cross section,\nthe freeze-out temperature and the ratio ${\\rm x=M_{B_6}/T_* }$  can be approximately determined, \nwith the ratio logarithmically dependent on the thermally averaged annihilation cross section. \nThis  leads to an approximate relic sextet baryon number density as a fraction of nucleon number density,\n\n\n", "itemtype": "equation", "pos": 39384, "prevtext": "\n\\label{eq:annihil}\n\nThe velocity dependent annihilation cross section ${\\rm \\sigma}$ is known for ordinary nucleons\nand will be estimated for sextet model baryons whose mass is approximately ${\\rm M_{B_6}=3~TeV}$, \nas reported in Section 7 from our non-perturbative \nlattice simulations. For a qualitative estimate, the thermally averaged annihilation rate \nof sextet model baryons is scaled down from the \nnucleon-antinucleon annihilation cross sections of QCD according to the generally accepted approximation,\n\n\n", "index": 13, "text": "\\begin{equation}\n{\\rm  \\langle v\\sigma \\rangle_{ann} \\approx  \\langle v\\sigma \\rangle^{nuc}_{ann}\\times M^2_{nuc}/M^2_{B_6} }\\;. \n\\label{annihil6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\langle v\\sigma\\rangle_{ann}\\approx\\langle v\\sigma\\rangle^{nuc}_{ann}%&#10;\\times M^{2}_{nuc}/M^{2}_{B_{6}}}\\;.\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">v</mi><mo>⁢</mo><mi>σ</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>ann</mi></msub><mo>≈</mo><mrow><mrow><msubsup><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">v</mi><mo>⁢</mo><mi>σ</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>ann</mi><mi>nuc</mi></msubsup><mo>×</mo><msubsup><mi mathvariant=\"normal\">M</mi><mi>nuc</mi><mn>2</mn></msubsup></mrow><mo>/</mo><mpadded width=\"+2.8pt\"><msubsup><mi mathvariant=\"normal\">M</mi><msub><mi mathvariant=\"normal\">B</mi><mn>6</mn></msub><mn>2</mn></msubsup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03302.tex", "nexttext": "\n\nfar exceeding terrestrial limits of stable fractional charges. The factor $3$ in Eq.~\\ref{eq:annihil6} is associated \nwith the particular assumption about the annihilation rate and the details of the freeze-out calculation. \nOnly the order of magnitude estimate is relevant for the argument in what will follow. \nAs pointed out in~\\cite{Langacker:2011db}, fractionally charged baryons and anti-baryons\nwill get re-thermalized  at ${\\rm \\approx ~ 300~K}$  on Earth \nand continue annihilating over the 4.5 Gyr life of Earth.\nThis, at first thought, perhaps would bring their terrestrial density below acceptable\nobservational limits, many orders of magnitude less than the ${\\rm 3\\cdot 10^{-7} }$ freeze-out relic abundance.\nUnfortunately the terrestrial annihilation mechanism is blocked by some overlooked new mechanism\nin the early Universe where negatively charged sextet model baryons will capture alpha particles \nwith calculable estimates of the capture rate~\\cite{Langacker:2011db} and significant relic density compound\nparticles ${\\rm( \\alpha^{++}B^-)}$. \nThis will block the terrestrial annihilation for a large fraction of the positively charged free baryons with negatively\ncharged bound baryons which are screened by alpha particles of the compound,\nhiding behind a repulsive Gamow barrier.\nAs noted in~\\cite{Langacker:2011db} the terrestrial annihilation is unlikely to continue at the necessary rate\nfor fractionally charged leptons because \nnegative charges will bind to alpha particles with calculable rate estimates with the Gamow barrier\nblocking annihilation.   Similarly, relic positively charged\nbaryons cannot continue terrestrial annihilation at the needed rate, \nblocked by the repulsive Coulomb barrier between unbound  positively charged relic  baryons and \nthe compound ${\\rm( \\alpha^{++}B^-)}$ objects, \nso that the terrestrial bounds \nmost likely remain in violation. Other difficulties were also noted, like the symmetric \ndistribution of opposite sign fractional charges in the interstellar medium of the galaxy which is also problematic  \nfor detection~\\cite{Langacker:2011db}.\n\n\nUnless unforeseen considerations bring new arguments for the viability of stable sextet model baryons with half-unit of\nelectric charges, their existence from the early Universe makes the ${\\rm Y(f_L)=0}$ anomaly-free choice \n\nvery unlikely. We will discuss next the \nmore realistic solution to the anomaly-free construction.\n\n\n\\subsection{Sextet model baryons from Y(${\\rm f_L}$)=1/3 with integer units of electric charge}\n\nThe lightest baryons in the strongly coupled sextet gauge sector are expected to form \nisospin flavor doublets  ${\\rm (uud,udd)}$, similar to the pattern in QCD.\n\nAs we noted earlier, baryons in the sextet model  \n\nshould carry integer multiples of electric charges if ${\\rm Y(f_L)\\neq 0}$ to avoid problems with the relics\nof the early Universe. This leads to the\nsimplest choice  ${\\rm Y(f_L)=1/3}$ with gauge anomalies to be compensated. \nA new pair of left-handed lepton \ndoublets emerged from this choice in Section 4 as the simplest manifestation \nof the anomalies and the Electroweak extension of the strongly coupled sextet gauge sector.\n\nNeutron-like ${\\rm udd}$ sextet model baryons ${\\rm (n_6)}$ will carry no electric charge \nand proton-like ${\\rm uud}$ sextet model baryons ${\\rm (p_6)}$ have one unit of positive electric charge \nfrom the choice ${\\rm Y(f_L)=1/3}$. \nThe two baryon masses are split by electromagnetic interactions.\nThe ordering of the two baryon masses in the chiral limit of massless sextet fermions will\nrequire non-perturbative {\\em ab initio} lattice calculations of the electromagnetic \nmass shifts to confirm intuitive expectations\nthat the neutron-like ${\\rm n_6}$ baryon has lower mass than the proton-like ${\\rm p_6}$ baryon.\nIn QCD this pattern was confirmed by recent lattice calculations~\\cite{Borsanyi:2014jba}.\nWe expect the same ordering in the sextet model so that the proton-like ${\\rm p_6}$  baryon \nwill decay very fast, ${\\rm p_6 \\rightarrow n_6 + ... }$,  with a lifetime ${\\rm \\tau \\ll 1~second}$. \nIt is unlikely for rapidly decaying  ${\\rm p_6}$ baryons to leave any relic footprints \nfrom dark nucleosynthesis before they decay.\n\nWith BSM baryon number conservation the neutral ${\\rm n_6}$ baryon is stable \nand observational limits on its direct detection from experiments like \nXENON100~\\cite{Aprile:2012nq} and LUX2013~\\cite{Akerib:2013tjd} have to be estimated.\nIn charge symmetric thermal evolution sextet model baryons are produced with relic number density ratio\n${\\rm  n_{B_6}/n_B  \\approx 3\\cdot 10^{-7}}$ (Eq.~\\ref{eq:annihil}).\nFor 3 TeV sextet model baryon masses we can estimate the detectable dark matter ratio of \nrespective mass densities ${\\rm \\rho_{B_6}}$ and ${\\rm \\rho_{B}}$ as\n${\\rm \\rho_{B_6}/\\rho_B  \\approx 10^{-4}}$,\nabout ${\\rm 5\\cdot 10^{4}}$ times less than the full amount of unaccounted dark mass, \n${\\rm \\rho_{dark} \\approx 5\\cdot \\rho_B}$.  \nWe will use this mass density estimate to guide observational limits on relic sextet model baryons\nemerging from charge symmetric thermal evolution where\ntests of dark baryon detection come from elastic collisions with nuclei in dark matter detectors.\nThe neutral and stable ${\\rm n_6}$ \nbaryon can interact several different ways with heavy nuclei in direct detection experiments\nincluding (a) magnetic dipole interaction, (b) Z-boson exchange, (c) Higgs boson exchange, and \n(d) electric polarizability.\n\nA brief review of our estimates of these interactions will lead us to important observations from what follows.\nIt turns out that cross sections from (a) and (b) can be parametrized and well estimated without \nlattice simulations.\n\n(a) The magnetic moment ${\\rm \\mu_6 = g\\cdot e/2M_{n_6}}$  of the neutral ${\\rm n_6}$ sextet baryon\ncan be calculated from first principles on the lattice but the only unknown quantity, g,\nis not needed in our estimate. The magnetic moment ${\\rm \\mu_6}$ of ${\\rm n_6}$ controls the coherent scattering cross section \nfrom magnetic moments of protons and neutrons in heavy nuclei with slow elastic recoil in direct detection \nexperiments. If the mass density of relic ${\\rm n_6}$ baryons would be large enough to match \nall the missing dark matter, a limit on the magnetic dipole g-factor from LUX2013 would be set \nto ${\\rm g^2 \\leq (M_{n_6}/5.1~TeV)^3}$, otherwise they would have been detected~\\cite{Akerib:2013tjd}. \nWith ${\\rm M_{n_6} = 3~TeV}$ the limiting value ${\\rm g=0.45}$ can be far exceeded \ndue to the much lower relic mass density of ${\\rm n_6}$ in the symmetric thermal evolution of the Universe. \nThe precise value of ${\\rm g}$ would require a straightforward lattice calculation which is less\nimportant with low magnetic dipole cross sections well below observational limits in comparison with\ncross section estimates from Z-exchange.\n\n(b) The sextet model ${\\rm n_6}$ baryon carries isospin 1/2 and hypercharge \n${\\rm Y=1}$ which is the source to the Z-boson field.\nCoherent Z exchange between the ${\\rm n_6}$ baryon and heavy nuclei in detectors of direct searches\nleads to larger cross section than magnetic dipole scattering and detectability has to be carefully\ncalculated and compared with XENON100 data.\nIs the sextet model with its relic  baryon density  still safe against the \nmost sensitive detection limits in charge symmetric thermal evolution?  This turns out to be the most sensitive\ntest of the model. For dark matter candidates at ${\\rm M_{n_6} = 3~TeV}$ XENON100 \nsets a cross section bound of approximately\n${\\rm 10^{-43} cm^2}$ per nucleon under the assumption of full dark matter missing mass density of\n${\\rm \\rho_{dark} \\approx 5\\cdot \\rho_B}$.\nNow our estimate of the cross section from Z exchange per nucleon for  ${\\rm n_6}$  is \napproximately ${\\rm 10^{-39} cm^2}$, seemingly four orders of magnitude above detection threshold. \nThis is not the case however, because the ${\\rm n_6}$ relic charge symmetric mass density is about \n${\\rm 5\\cdot 10^{4}}$ times less than the full amount of unaccounted dark mass. This leads to the\ninteresting observation that the  ${\\rm n_6}$ sextet model baryons might be detectable in the \nnext generation of direct searches. There are several caveats to this including uncertainties in estimating\nthe relic density from hypothesized annihilation cross sections and the complications of asymmetric thermal\nevolution. \n\n(c) The Higgs exchange effect is expected to be small but it will require lattice calculation to determine the \ncoupling of the composite light scalar to the ${\\rm n_6}$ sextet model baryon. We will return to this problem\nin a future report.\n\n(d) Similarly, the estimate of the scattering cross section from electric polarizability of ${\\rm n_6}$ baryons requires \nlattice calculations which are left for future work. This effect is expected to be much smaller than cross sections\nfor (a) and (b).\n\nBased on these estimates we conclude that the sextet BSM model is consistent with observational limits and \nwill contribute a small fraction to the missing dark matter content.\nAs a last and important step of our analysis, we turn now to the non-perturbative lattice determination of the baryon masses.\n \n\n\\section{Construction of the sextet nucleon operator}\n\nWe next discuss how to build a sextet baryon operator that can be used in lattice simulations to isolate the baryon state and measure its mass. In the first two parts of this section we discuss the color, spin and flavor structure of the sextet baryon\nstate in the continuum.  We will see that a symmetric color contraction is needed in order to construct a color singlet three-fermion state when fermions are in the sextet representation of ${\\rm SU(3)}$. This is opposite to the behavior in QCD, where the baryon color wave function is antisymmetric. Consequently, the  construction of the sextet baryon operator is non-trivial using staggered lattice fermions, which we describe in the third part of this section. \n\n\\vspace{-0.1cm}\n\n\\subsection{Color structure}\n\n\\vspace{-0.1cm}\n\nThree ${\\rm SU(3)}$ sextet fermions can give rise to a color singlet. The tensor product $6 \\otimes 6 \\otimes 6$ can be decomposed \ninto irreducible representations of ${\\rm SU(3)}$ as \\cite{maria}\n\\begin{eqnarray}\n6 \\otimes 6 \\otimes 6= 1\\oplus2\\times 8\\oplus 10\\oplus {\\overline}{10}\\oplus 3\\times 27\\oplus 28\\oplus 2\\times 35,\n\\end{eqnarray}\nwhere irreps are denoted by their dimensions and ${\\overline}{10}$ is the complex conjugate of 10.\nThe color singlet state corresponds to the unique singlet above. Fermions in the $6$-representation $\\psi_{ab}$ are symmetric in the two indices and transform as\n\\begin{eqnarray}\n\\psi_{aa'} \\longrightarrow U_{ab}~U_{a'b'}~\\psi_{bb'}\n\\end{eqnarray} \nand the color singlet combination is given by\n\\begin{eqnarray}\n\\epsilon_{abc}~\\epsilon_{a'b'c'}~\\psi_{aa'}~ \\psi_{bb'}~ \\psi_{cc'}\\;.\n\\end{eqnarray} \n(We earlier used superscripts for clarity.) Let us introduce the index $A=1,\\ldots, 6$ for the $6$ components of the symmetric $\\psi_{ab}$, i.e.~switch notation to\n$\\psi_{ab} = \\Psi_A$. Then the above color singlet operator may be written as\n\\begin{eqnarray}\n\\epsilon_{abc}~\\epsilon_{a'b'c'}~\\psi_{aa'}~ \\psi_{bb'}~ \\psi_{cc'} = T_{ABC}~ \\Psi_A~ \\Psi_B~ \\Psi_C,\n\\label{colorsinglet}\n\\end{eqnarray}\nwith a completely symmetric 3-index tensor $T_{ABC}$. The contrast with QCD where the baryon color contraction is antisymmetric is here explicit.\n\n\\vspace{-0.1cm}\n\n\\subsection{Spin flavor structure}\n\n\\vspace{-0.1cm}\n\nAs we have seen the color contraction is symmetric for the sextet representation and hence the overall antisymmetry\nof the baryon wave function with respect to the interchange of any two fermions  must come from the spin-flavor structure. Our operator construction is fully relativistic, we look here at the non-relativistic limit for illustration, omitting color indices. We label the two flavors \n$u$ and $d$ as in QCD and the non-relativistic spin will be either $\\uparrow$ or $\\downarrow$. We start with $| \\uparrow u, \\uparrow d, \\downarrow u \\rangle$ and build the desired state by requiring it to be antisymmetric under all possible interchanges, leading to\n\\begin{eqnarray}\n\\label{psi}\n| \\uparrow \\psi  \\rangle = \n| \\uparrow u, \\uparrow d, \\downarrow u \\rangle + \n| \\downarrow u, \\uparrow u, \\uparrow d \\rangle + \n| \\uparrow d, \\downarrow u, \\uparrow u \\rangle - {\\nonumber} \\\\\n| \\downarrow u, \\uparrow d, \\uparrow u \\rangle - \n| \\uparrow d, \\uparrow u, \\downarrow u \\rangle - \n| \\uparrow u, \\downarrow u, \\uparrow d \\rangle\\;,\n\\end{eqnarray}\nwhich is similar to the wave function of triton~\\cite{Derrick58}.\n\n\\vspace{-0.1cm}\n\n\\subsection{From continuum Dirac to lattice Staggered basis}\n\n\\vspace{-0.1cm}\n\nWe next convert from continuum to staggered lattice fermion operators. The lattice operators that create the state (\\ref{psi}) belong to a suitable multiplet of ${\\rm SU(4)}$ taste symmetry. Our staggered fermion operator construction follows \\cite{gs, KlubergStern:1983dg, Altmeyer:1992dd, Ishizuka:1993mt}. We first convert from continuum operators to lattice operators in the Dirac basis, then we switch to lattice staggered fields. For simplicity we want to have operators as local as possible, thus in Dirac basis, our sextet baryon operator takes the form\n\\begin{eqnarray}\nN^{\\alpha i}(2y)~=T_{ABC}~ u_A^{\\alpha i}(2y) ~[u_B^{\\beta j}(2y) ~(C \\gamma_5 )_{\\beta \\gamma} \n~(C^* \\gamma_5^*)_{jk}~d_C^{\\gamma k}(2y)]\n\\end{eqnarray}\nwhere Greek letters and lower case Latin letters denote spin and taste indices respectively. $C$ is the charge conjugation matrix satisfying\n\\begin{eqnarray}\nC\\gamma_\\mu C^{-1}=-\\gamma_\\mu^{{\\rm T}},{\\nonumber}\\\\\n-C=C^{{\\rm T}}=C^\\dagger=C^{-1}.\n\\end{eqnarray}\nThe coordinate $y$ labels elementary staggered hypercubes.\nStaggered fields are defined as\n\\begin{eqnarray}\nu^{\\alpha i}(2y)=\\frac{1}{8}\\sum_\\eta \\Gamma^{\\alpha i}_\\eta~ \\chi_u(2y+\\eta)\\;, {\\nonumber}\n\\end{eqnarray}\nwhere $\\Gamma(\\eta)$ is an element of the Euclidean Clifford algebra labeled by the four-vector \n$\\eta$ whose elements are defined mod 2 as usual.\nMore precisely \n$\\Gamma(\\eta)=\\gamma_1^{\\eta_1}\\gamma_2^{\\eta_2}\\gamma_3^{\\eta_3}\\gamma_4^{\\eta_4}$ where \n$\\eta \\equiv (\\eta_1, \\eta_2, \\eta_3, \\eta_4)$.\nWritten in terms of the staggered fields,\n\\begin{eqnarray}\nN^{\\alpha i}(2y)~=-T_{ABC}~\\frac{1}{8^3}\\sum_{\\eta'} \\Gamma^{\\alpha i}_{\\eta'}~ \\chi_u^A(2y+\\eta')\n~\\sum_{\\eta }  S(\\eta)\\chi_u^B(2y+\\eta) \\chi_d^C(2y+\\eta)\\;,\n\\end{eqnarray}\nwhere $S(\\eta)$ is a sign factor.\nTo obtain a single time slice operator an extra term has to be either added to or subtracted from the diquark operator to cancel\nthe spread over two time slices of the unit hypercube. This is similar to what is done to construct \nthe single time slice meson operators in QCD. This extra term corresponds to the parity partner of the nucleon.\nThe single time slice nucleon operator reads\n\\begin{eqnarray}\nN^{\\alpha i}(2y)~=-T_{ABC}~\\frac{1}{8^3}\\sum_{{\\vec \\eta'}} \\Gamma^{\\alpha i}_{{\\vec \\eta'}}~ \\chi_u^A(2y+{\\vec \\eta'})\n~\\sum_{{\\vec \\eta} }  S({\\vec \\eta})\\chi_u^B(2y+{\\vec \\eta}) \\chi_d^C(2y+{\\vec \\eta}).\n\\end{eqnarray}\nThis operator is a sum of $8\\times 8=64$ terms over the elementary cube in a given time slice. \nThe local terms vanish individually after the symmetric \ncolor contraction. The non-vanishing terms are those where a diquark resides on a corner of the cube at a fixed \ntime-slice and the third fermion resides\non any of the other corners. The nucleon operator is thus the sum of $56$ such terms with appropriate sign factors. \nIn order to find the mass of the lowest lying state any one of these $56$ terms can in principle be used.\nWe list in Table \\ref{operators} the operators that we have implemented.\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|l|l|l|} \n\\hline\nLabel  &  Operators (set a) & Operators (set b)  \\\\\n\\hline\n ${\\rm IV_{{\\rm xy}}}$   & $\\chi_u(1,1,0,0)~\\chi_u(0,0,0,0)~\\chi_d(0,0,0,0)$&$\\chi_u(0,0,0,0)~\\chi_u(1,1,0,0)~\\chi_d(1,1,0,0)$\\\\\n \\hline\n ${\\rm IV_{{\\rm yz}}}$   & $\\chi_u(0,1,1,0)~\\chi_u(0,0,0,0)~\\chi_d(0,0,0,0)$&$\\chi_u(0,0,0,0)~\\chi_u(0,1,1,0)~\\chi_d(0,1,1,0)$\\\\\n \\hline\n ${\\rm IV_{{\\rm zx}}}$   & $\\chi_u(1,0,1,0)~\\chi_u(0,0,0,0)~\\chi_d(0,0,0,0)$&$\\chi_u(0,0,0,0)~\\chi_u(1,0,1,0)~\\chi_d(1,0,1,0)$\\\\\n \\hline\n VIII   & $\\chi_u(1,1,1,0)~\\chi_u(0,0,0,0)~\\chi_d(0,0,0,0)$&$\\chi_u(0,0,0,0)~\\chi_u(1,1,1,0)~\\chi_d(1,1,1,0)$\\\\\n \\hline\n\\end{tabular}\n\\end{center}\n\\caption{The set of staggered lattice baryon operators we used to determine the baryon mass.}\n\\label{operators}\n\\end{table}  \n\n\\vspace{-0.3cm}\n\n\\section{Lattice simulations}\n\n\\vspace{-0.2cm}\n\nWe use the same lattice action as in our other studies of the sextet model, namely the tree-level Symanzik-improved gauge\naction and the staggered fermion matrix with two stout steps of exponential smearing of the gauge link variables with two\nstout steps~\\cite{Morningstar:2003gk, Aoki:2005vt}. We implement the RHMC algorithm with the rooting procedure in all simulations to study the model with two fermion flavors. To accelerate the molecular dynamics time evolution we use multiple time scales~\\cite{Urbach:2005ji} and the Omelyan integrator~\\cite{Takaishi:2005tz}. The results we show here are at one lattice spacing corresponding to the bare gauge coupling $\\beta = 6 / g^2 = 3.2$, which is defined as the overall prefactor of the Symanzik lattice action. We have continuing studies of the spectrum on finer lattice spacings to allow us to quantify lattice artifacts and determine the continuum limit of the spectrum, which we will report on in future publications. We examine the time histories of the correlators, the fermion condensate, the topological charge, and the gauge field energy on the gradient flow to estimate autocorrelation times. For the estimate of the statistical errors of hadron masses we used correlated fitting of the effective masses with a double jackknife procedure applied to the covariance matrices~\\cite{delDebbio}.\n\n\\subsection{Nucleon operator comparison}\n\nWe investigate the quality of the signal for the operators listed in Table \\ref{operators} on ensembles of approximately 1000 trajectories, each measurement separated by 50 trajectories during the molecular dynamics evolution, on a lattice volume $V=32^3 \\times 64$ and at fermion mass $m=0.007$. For each operator the nucleon mass, $M_N$, is determined by correlated fitting of the effective mass with a double jackknife procedure applied to the covariance matrices from time separation $t_{min}$ to $t_{max}$. Figure \\ref{signal_comparison} compares the\ncorresponding fits for various values of $t_{min}$ at $t_{max}=20$. It is observed that,\nfor all operators, the fits are not very sensitive to the choice of the fit range. Moreover, all\noperators give consistent results for the nucleon mass within errors. The noise-to-signal\nratio is around $\\sim 5\\%$ for all operators, none of which is significantly\nless noisy than the others. Therefore the quality of the resulting spectroscopy is\nindependent of the choice of operator, and in the following analysis we use the operator\n$IV_{xy}$ from set $a$.\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.75}{\\includegraphics[angle=0,width=0.85\\textwidth]{compare_tmax20}}\n\\vskip -.3 cm\n\\caption{{\\footnotesize Comparison of $M_N$ from different operators varying $t_{min}$ \nwith fixed $t_{max}=20$. The calculation is performed on lattices with $\\beta=3.20$,\n$V = 32^3 \\times 64$ and $m=0.007$ over approximately 1000 trajectories. The $t_{min}$ \nvalues for the operators $IV_{xy}$, $IV_{yz}$ and $IV_{zx}$ are shifted by $0.25$,\n$0.5$ and $0.75$ respectively for clarity. Sets a and b correspond to the location of the diquark operator as in Table~\\ref{operators}.}}\\label{signal_comparison}\n\\end{center}\n\\end{figure}\n\n\\subsection{First results}\n\nIn this section we present our first results for the nucleon spectroscopy. Simulations and data analysis of the sextet model are continuously ongoing, what we show here is a snapshot of the results at one lattice spacing. The nucleon correlator of operator\n$IV_{xy}$ in set $a$ is measured on ensembles with lattice volume $V = 32^3 \\times 64$ and fermion masses ranging from $m=0.003$ to $m=0.008$, each with 200 to 300 configurations, each configuration separated by 5 Monte Carlo trajectories. In Figure \\ref{chiral} we show the chiral extrapolation of $M_N$, as well as extrapolations of the Goldstone boson, the $a_1$ and $\\rho$ mesons, denoted by $M_\\pi$, $M_{a_1}$ and $M_\\rho$ respectively \\cite{Fodor:2012ty, ourfuture}. For all except the Goldstone boson state we assume linear dependence on the fermion mass towards the chiral limit. We see the baryon remains significantly split from the meson sector of the spectrum in the chiral limit.\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.65}{\\includegraphics[angle=0,width=1.0\\textwidth]{chiral_all}}\n\\vspace{-0.1cm}\n\\caption{\n{\\footnotesize Chiral extrapolation of $M_N$ (blue) in comparison with\n$M_\\pi$, $M_{a_1}$ and $M_\\rho$. \nThe calculation is performed on lattices with $\\beta=3.20$, $V=48^3 \\times 96$ \nfor $m=0.003$ (except for $M_N$ on $V=32^3 \\times 64$) and $V=32^3 \\times 64$ for \nthe heavier fermion masses, using 200 to 300 configurations at each mass.}\n}\n\\label{chiral}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.55}{\\includegraphics[angle=0,width=1.0\\textwidth]{FpiLinFit_b3p20}}\n~ ~ ~\n\\scalebox{0.18}{\\includegraphics[angle=0,width=1.0\\textwidth]{all_channels}}\n\\vspace{-0.3cm}\n\\caption{{\\footnotesize Chiral extrapolation of $F_\\pi$. The simulations are performed on lattices with\n$\\beta=3.20$, $V=48^3 \\times 96$ for at fermion mass $m=0.003$ and V$=32^3 \\times 64$ for the heavier fermion masses, \nusing 200 to 300 configurations, see \\cite{ourfuture} for more details (left). Hadron spectroscopy at $\\beta=3.20$ converted to physical units (right).}}\\label{physical}\n\\end{center}\n\\end{figure}\n\nTo convert to physical units, one can use the scale set by the chiral limit of the Goldstone boson decay constant $F_\\pi$, denoted by $F$.  The left plot of figure \\ref{physical} shows the chiral\nextrapolation of $F_\\pi$, measured on lattices of size $48^3 \\times 96$ for $m=0.003$ and $32^3 \\times 64$ for the heavier fermion masses. A detailed description of the analysis is given in~\\cite{ourfuture}, the result we use here is $F=0.0253(4)$. The value in the chiral limit is likely to evolve, due to additional lattice simulations pushing to even lighter fermion mass, as well as modifications of the analysis taking into account lattice artifacts. The BSM implementation of the theory identifies the chiral limit of the Goldstone boson decay constant with the value of the scalar vacuum expectation value in the Standard Model, namely $F= v_R = 246$~GeV. This requirement follows from the generation of the Electroweak gauge boson mass $m_W = (g F)/2$ due to Goldstone boson contributions to the gauge boson vacuum polarization.\nWith this conversion, the baryon in the chiral limit is at approximately $3$~TeV. The nucleon, vector and axial vector meson masses are shown in physical units on the right panel of figure \\ref{physical}. Our initial studies indicate a composite scalar in the sextet model which is light, with $M_{\\rm H}/F$ in the range 1 to 3 in the chiral limit~\\cite{Fodor:2015vwa}. The large uncertainty is due to the difficulty of extracting a state with vacuum quantum numbers, which requires disconnected fermion diagrams to be calculated, a notoriously challenging computational problem. The lightness of the scalar, far separated from the remainder of the spectrum, means in the BSM context that experimental studies would need to explore the few TeV range for this model to be critically tested~\\cite{Aad:2015yza}.  \n\nIt has recently been reported by the ATLAS and CMS collaborations that there is an observed excess in $WW, WZ$ and $ZZ$ diboson pairs at around 2 TeV~\\cite{Aad:2015owa,CMS:2015gla}. One possible explanation is a vector resonance, which in our context would be the $\\rho$ state. As indicated in figure \\ref{physical}, the simulation results predict that the vector state is at roughly 2 TeV in the sextet model. This prediction will be refined in our ongoing study, including the dependence on the lattice cutoff, and will become of growing importance if the experimental excess persists. In Section 3 we already commented briefly on the recently found \ndiphoton excess in ATLAS and CMS resonance searches~\\cite{diphoton:2015}.\n\n\\vspace{-0.3cm}\n\n\\section{Summary and outlook}\n\n\\vspace{-0.2cm}\n\nWe have developed the operator technology to extract baryon states using staggered lattice fermions in the sextet model. The first results are encouraging that the lightest baryon mass can be nailed down with good precision from the current generation of lattice simulations. The emerging picture is of a spectrum with the baryon significantly above the vector and axial vector mesons in the chiral limit. The next step will be to extend the analysis, allowing more control over the chiral extrapolation and removing the distortion of the spectrum due to lattice artifacts and possible finite-volume contamination.\n\nThe study of the baryon is a natural extension of our ongoing work to explore the meson spectrum of the sextet model and shore up the case that the theory is near-conformal, with a massive spectrum in the chiral limit. Whether or not the model is ultimately viable will largely hinge on the fate of the composite scalar, which should be light for the minimal model to dynamically generate a Higgs impostor. The embedding of the sextet theory into the Standard Model brings other facets into play, such as constraints on the relic abundance of sextet model baryons in the early Universe, and experimental limits on stable particles with fractional charge~\\cite{Perl:2009zz}. The scenario of a neutral sextet baryon with additional lepton doublets for anomaly cancellation shows the possibility for rich BSM physics beyond simply a composite Higgs state, and will be brought into sharp relief if the model continues to warrant future study.  \n\n\\vspace{-0.3cm}\n\n\\section{Acknowledgement}\n\n\\vspace{-0.2cm}\n\n\n\nWe acknowledge support by the DOE under grant DE-SC0009919,\nby the NSF under grants 0970137 and 1318220, by the DOE ALCC award for the BG/Q Mira platform\nof Argonne National Laboratory, by OTKA under the grant OTKA-NF-104034, and by the Deutsche\nForschungsgemeinschaft grant SFB-TR 55. Computational resources were provided by the Argonne Leadership Computing Facility under an ALCC award, by USQCD at Fermilab, \nby the NSF XSEDE program, by the University of Wuppertal, by Juelich Supercomputing Center on Juqueen\nand by the Institute for Theoretical Physics, Eotvos University. \nWe are grateful to Szabolcs Borsanyi for his code development for the BG/Q platform. We are also \ngrateful to Sandor Katz and Kalman Szabo for their code developent for the CUDA platform \\cite{Egri:2006zm}. KH wishes to thank the Institute for Theoretical Physics and the Albert Einstein Center for Fundamental Physics at the University of Bern for their support.\n\n\n\n\\vspace{-0.2cm}\n\n\\begin{thebibliography}{99}\n\n\\vspace{-0.2cm}\n\n{\\footnotesize\n\n\n\\bibitem{Dietrich:2005jn} \nD.~D.~Dietrich, F.~Sannino and K.~Tuominen,\n\nPhys.\\ Rev.\\ D {\\bf 72}, 055001 (2005)\n[hep-ph/0505059].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Sannino:2004qp} \nF.~Sannino and K.~Tuominen,\n\nPhys.\\ Rev.\\ D {\\bf 71}, 051901 (2005)\n[hep-ph/0405209].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Hong:2004td} \nD.~K.~Hong, S.~D.~H.~Hsu and F.~Sannino,\n\nPhys.\\ Lett.\\ B {\\bf 597}, 89 (2004)\n[hep-ph/0406200].\n\\vspace{-0.1cm}\n\n\\bibitem{Susskind:1978ms}\nL.~Susskind,\n\nPhys.\\ Rev.\\  D {\\bf 20}, 2619 (1979).\n\\vspace{-0.1cm}\n\n\\bibitem{Weinberg:1979bn}\nS.~Weinberg,\n\nPhys.\\ Rev.\\  D {\\bf 19}, 1277 (1979).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Marciano:1980zf} \nW.~J.~Marciano,\n\nPhys.\\ Rev.\\ D {\\bf 21}, 2425 (1980).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2012ty} \nZ.~Fodor, K.~Holland, J.~Kuti, D.~Nogradi, C.~Schroeder and C.~H.~Wong,\n\nPhys.\\ Lett.\\ B {\\bf 718}, 657 (2012)\n[arXiv:1209.0391 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2012ni} \nZ.~Fodor, K.~Holland, J.~Kuti, D.~Nogradi, C.~Schroeder and C.~H.~Wong,\n\nPoS LATTICE {\\bf 2012}, 024 (2012)\n[arXiv:1211.6164 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2014pqa} \nZ.~Fodor, K.~Holland, J.~Kuti, D.~Nogradi and C.~H.~Wong,\n\nPoS LATTICE {\\bf 2013}, 062 (2014)\n[arXiv:1401.2176 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2015vwa} \n  Z.~Fodor, K.~Holland, J.~Kuti, S.~Mondal, D.~Nogradi and C.~H.~Wong,\n  \n  PoS LATTICE {\\bf 2014}, 244 (2015)\n  [arXiv:1502.00028 [hep-lat]].\n\\vspace{-0.1cm}\n\n\\bibitem{Fodor:2015zna} \nZ.~Fodor, K.~Holland, J.~Kuti, S.~Mondal, D.~Nogradi and C.~H.~Wong,\n\narXiv:1506.06599 [hep-lat].\n\\vspace{-0.1cm}\n\n\n\\bibitem{DeGrand:2010na} \nT.~DeGrand, Y.~Shamir and B.~Svetitsky,\n\n\nPhys.\\ Rev.\\ D {\\bf 82}, 054503 (2010)\n[arXiv:1006.0707 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Shamir:2008pb} \nY.~Shamir, B.~Svetitsky and T.~DeGrand,\n\nPhys.\\ Rev.\\ D {\\bf 78}, 031502 (2008)\n[arXiv:0803.1707 [hep-lat]].\n\\vspace{-0.1cm}\n\n\\bibitem{Banks:1979yr}\nT.~Banks and A.~Casher,\n\nNucl.\\ Phys.\\  B {\\bf 169}, 103 (1980).\n\\vspace{-0.1cm}\n\n\\bibitem{Anna_g2}\nA.~Hasenfratz,  talks at \\\\\n{\\tt http://www.kmi.nagoya-u.ac.jp/workshop/SCGT15/program/slides/SCGT15-Hasenfratz.pdf} \\\\\n{\\tt https://lattice.llnl.gov/meetings/2015/beyond-standard-model-physics/beyondindex.html} \\\\\n{\\tt http://www.usqcd.org/meetings/allHands2015/slides/hasenfratz-a.pdf}\n\\vspace{-0.1cm}\n\n\n\\bibitem{Hasenfratz:2015ssa} \n  A.~Hasenfratz, Y.~Liu and C.~Y.~H.~Huang,\n  \n  arXiv:1507.08260 [hep-lat].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kogut:2011ty} \nJ.~B.~Kogut and D.~K.~Sinclair,\n\nPhys.\\ Rev.\\ D {\\bf 84}, 074504 (2011)\n[arXiv:1105.3749 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kogut:2010cz} \nJ.~B.~Kogut and D.~K.~Sinclair,\n\nPhys.\\ Rev.\\ D {\\bf 81}, 114507 (2010)\n[arXiv:1002.2988 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kogut:2015zta} \nJ.~B.~Kogut and D.~K.~Sinclair,\n\narXiv:1507.00375 [hep-lat].\n\\vspace{-0.1cm}\n\n\\bibitem{diphoton:2015} \nATLAS-CONF-2015-081 and  CMS PAS-EXO-15-004.\n\n\n\\bibitem{Molinaro:2015cwg} \nE.~Molinaro, F.~Sannino and N.~Vignaroli,\n\narXiv:1512.05334 [hep-ph].\n\n\n\\bibitem{Farhi:1980xs} \nE.~Farhi and L.~Susskind,\n\nPhys.\\ Rept.\\  {\\bf 74}, 277 (1981).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2009wk} \nZ.~Fodor, K.~Holland, J.~Kuti, D.~Nogradi and C.~Schroeder,\n\nPhys.\\ Lett.\\ B {\\bf 681}, 353 (2009)\n[arXiv:0907.4562 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Aoki:2014oha} \nY.~Aoki {\\it et al.} [LatKMI Collaboration],\n\nPhys.\\ Rev.\\ D {\\bf 89}, 111502 (2014)\n[arXiv:1403.5000 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Fodor:2015baa} \nZ.~Fodor, K.~Holland, J.~Kuti, S.~Mondal, D.~Nogradi and C.~H.~Wong,\n\nJHEP {\\bf 1506}, 019 (2015)\n[arXiv:1503.01132 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Hasenfratz:2014rna} \nA.~Hasenfratz, D.~Schaich and A.~Veernala,\n\nJHEP {\\bf 1506}, 143 (2015)\n[arXiv:1410.5886 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Appelquist:2014zsa} \nT.~Appelquist {\\it et al.} [LSD Collaboration],\n\nPhys.\\ Rev.\\ D {\\bf 90}, no. 11, 114502 (2014)\n[arXiv:1405.4752 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Schaich:2015psa} \nD.~Schaich {\\it et al.} [LSD Collaboration],\n\n[arXiv:1506.08791 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\n\\bibitem{D'Hoker:1984ph} \nE.~D'Hoker and E.~Farhi,\n\nNucl.\\ Phys.\\ B {\\bf 248}, 59 (1984).\n\\vspace{-0.1cm}\n\n\\bibitem{D'Hoker:1984pc} \nE.~D'Hoker and E.~Farhi,\n\nNucl.\\ Phys.\\ B {\\bf 248}, 77 (1984).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Preskill:1990fr} \nJ.~Preskill,\n\nAnnals Phys.\\  {\\bf 210}, 323 (1991).\n\\vspace{-0.1cm}\n\n\n\\bibitem{D'Hoker:1992bv} \nE.~D'Hoker,\n\nPhys.\\ Rev.\\ Lett.\\  {\\bf 69}, 1316 (1992).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kainulainen:2006wq} \nK.~Kainulainen, K.~Tuominen and J.~Virkajarvi,\n\nPhys.\\ Rev.\\ D {\\bf 75}, 085003 (2007)\n[hep-ph/0612247].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Foadi:2007ue} \nR.~Foadi, M.~T.~Frandsen, T.~A.~Ryttov and F.~Sannino,\n\nPhys.\\ Rev.\\ D {\\bf 76}, 055005 (2007)\n[arXiv:0706.1696 [hep-ph]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Antola:2009wq} \nM.~Antola, M.~Heikinheimo, F.~Sannino and K.~Tuominen,\n\nJHEP {\\bf 1003}, 050 (2010)\n[arXiv:0910.3681 [hep-ph]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kainulainen:2009rb} \nK.~Kainulainen, J.~Virkajarvi and K.~Tuominen,\n\nJCAP {\\bf 1002}, 029 (2010)\n[arXiv:0912.2295 [astro-ph.CO]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Witten:1982fp} \nE.~Witten,\n\nPhys.\\ Lett.\\ B {\\bf 117}, 324 (1982).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Adler:1969er} \nS.~L.~Adler and W.~A.~Bardeen,\n\nPhys.\\ Rev.\\  {\\bf 182}, 1517 (1969).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Chivukula:1989qb} \nR.~S.~Chivukula and T.~P.~Walker,\n\nNucl.\\ Phys.\\ B {\\bf 329}, 445 (1990).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Langacker:2011db} \nP.~Langacker and G.~Steigman,\n\nPhys.\\ Rev.\\ D {\\bf 84}, 065040 (2011)\n[arXiv:1107.3131 [hep-ph]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Akhmedov:2014kxa} \nE.~Akhmedov,\n\narXiv:1412.3320 [hep-ph].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Kuti:2015} \nZ.~Fodor, K.~Holland, J.~Kuti, S.~Mondal, D.~Nogradi and C.~H.~Wong,\nunpublished (2015).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Aprile:2012nq} \nE.~Aprile {\\it et al.} [XENON100 Collaboration],\n\nPhys.\\ Rev.\\ Lett.\\  {\\bf 109}, 181301 (2012)\n[arXiv:1207.5988 [astro-ph.CO]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Akerib:2013tjd} \nD.~S.~Akerib {\\it et al.} [LUX Collaboration],\n\nPhys.\\ Rev.\\ Lett.\\  {\\bf 112}, 091303 (2014)\n[arXiv:1310.8214 [astro-ph.CO]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{DeRujula:1989fe} \nA.~De Rujula, S.~L.~Glashow and U.~Sarid,\n\nNucl.\\ Phys.\\ B {\\bf 333}, 173 (1990).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Perl:2009zz} \nM.~L.~Perl, E.~R.~Lee and D.~Loomba,\n\nAnn.\\ Rev.\\ Nucl.\\ Part.\\ Sci.\\  {\\bf 59}, 47 (2009).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Steigman:1979kw} \nG.~Steigman,\n\nAnn.\\ Rev.\\ Nucl.\\ Part.\\ Sci.\\  {\\bf 29}, 313 (1979).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Borsanyi:2014jba} \nS.~Borsanyi {\\it et al.},\n\nScience {\\bf 347}, 1452 (2015)\n[arXiv:1406.4088 [hep-lat]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{ourfuture} \nZ.~Fodor, K.~Holland, J.~Kuti, S.~Mondal, D.~Nogradi and C.~H.~Wong,\nPoS LATTICE {\\bf 2014}, 244 (2014).\n\\vspace{-0.1cm}\n \n\\bibitem{appelquist} \nT.~Appelquist {\\it et al.}  [Lattice Strong Dynamics (LSD) Collaboration],\n\nPhys.\\ Rev.\\ D {\\bf 88}, no. 1, 014502 (2013).\n\\vspace{-0.1cm}\n\n\\bibitem{maria}\nMaria~S~M~Wessl\\'{e}n,\nJournal\\ of\\ Physics:\\ Conference\\ Series\\ {\\bf175}, (2009) 012015.\n\\vspace{-0.1cm}\n\n\\bibitem{Derrick58}\nG.~Derrick and J.~M.~Blatt, Nucl.\\ Phys. {\\bf 8}, 310 (1958).\n\\vspace{-0.1cm}\n\n\n\n\n\n\n\n\n\n\\bibitem{gs}\nM.~F.~L.~Golterman and J.~Smit,\n\nNucl.\\ Phys.\\ B {\\bf 255}, 328 (1985).\n\\vspace{-0.1cm}\n\n\n\\bibitem{KlubergStern:1983dg} \nH.~Kluberg-Stern, A.~Morel, O.~Napoly and B.~Petersson,\n\nNucl.\\ Phys.\\ B {\\bf 220}, 447 (1983).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Altmeyer:1992dd} \n  R.~Altmeyer {\\it et al.} [MT(c) Collaboration],\n  \n  Nucl.\\ Phys.\\ B {\\bf 389}, 445 (1993).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Ishizuka:1993mt} \n  N.~Ishizuka, M.~Fukugita, H.~Mino, M.~Okawa and A.~Ukawa,\n  \n  Nucl.\\ Phys.\\ B {\\bf 411}, 875 (1994).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Morningstar:2003gk}\n  C.~Morningstar and M.~J.~Peardon,\n  \n  Phys.\\ Rev.\\  D {\\bf 69}, 054501 (2004).\n  \n\\vspace{-0.1cm}\n\n\n\\bibitem{Aoki:2005vt}\n  Y.~Aoki, Z.~Fodor, S.~D.~Katz, K.~K.~Szabo,\n  \n  JHEP {\\bf 0601}, 089 (2006).\n  \n\\vspace{-0.1cm}\n\n\n\\bibitem{Urbach:2005ji}\n C.~Urbach, K.~Jansen, A.~Shindler, U.~Wenger,\n\n \n \n Comput.\\ Phys.\\ Commun.\\  {\\bf 174}, 87-98 (2006).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Takaishi:2005tz}\n T.~Takaishi, P.~de Forcrand,\n \n \n Phys.\\ Rev.\\  {\\bf E73}, 036706 (2006).\n\\vspace{-0.1cm}\n\n\n\\bibitem{delDebbio} \nL.~Del Debbio, L.~Giusti, M.~Luscher, R.~Petronzio and N.~Tantalo,\n\nJHEP {\\bf 0702}, 082 (2007).\n\\vspace{-0.1cm}\n\n\n\\bibitem{Aad:2015yza} \n  G.~Aad {\\it et al.} [ATLAS Collaboration],\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 75}, no. 6, 263 (2015)\n  [arXiv:1503.08089 [hep-ex]].\n\\vspace{-0.1cm}\n\n\n\\bibitem{Aad:2015owa} \n  G.~Aad {\\it et al.} [ATLAS Collaboration],\n  \n  arXiv:1506.00962 [hep-ex].\n\\vspace{-0.1cm}\n\n\n\\bibitem{CMS:2015gla} \n  CMS Collaboration [CMS Collaboration],\n  \n  CMS-PAS-EXO-14-010.\n\\vspace{-0.1cm}\n\n\n\\bibitem{Egri:2006zm} \nG.~I.~Egri, Z.~Fodor, C.~Hoelbling, S.~D.~Katz, D.~Nogradi and K.~K.~Szabo,\n\nComput.\\ Phys.\\ Commun.\\  {\\bf 177}, 631 (2007)\n[hep-lat/0611022].\n\\vspace{-0.1cm}\n\n\n\n\n  \n\n\n\n}\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 39966, "prevtext": "\n\n\nBased on the value of ${\\rm M_{B_6}}$ we determined and using the rough estimate of the annihilation cross section,\nthe freeze-out temperature and the ratio ${\\rm x=M_{B_6}/T_* }$  can be approximately determined, \nwith the ratio logarithmically dependent on the thermally averaged annihilation cross section. \nThis  leads to an approximate relic sextet baryon number density as a fraction of nucleon number density,\n\n\n", "index": 15, "text": "\\begin{equation}\n{\\rm  \\frac{n_{B_6}}{n_B} \\approx 3\\cdot 10^{-7}},\n\\label{eq:annihil6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\frac{n_{B_{6}}}{n_{B}}\\approx 3\\cdot 10^{-7}},\" display=\"block\"><mrow><mrow><mfrac><msub><mi mathvariant=\"normal\">n</mi><msub><mi mathvariant=\"normal\">B</mi><mn>6</mn></msub></msub><msub><mi mathvariant=\"normal\">n</mi><mi mathvariant=\"normal\">B</mi></msub></mfrac><mo>≈</mo><mrow><mn>3</mn><mo>⋅</mo><msup><mn>10</mn><mrow><mo>-</mo><mn>7</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]