[{"file": "1601.03349.tex", "nexttext": "\n\nThe SFRs that result from the ANN predictions were shown by\nEllison et al. (2016) to be\nin excellent agreement with those from the SDSS for star-forming\ngalaxies.  In this paper, we additionally utilize the {L$_{\\rm IR}$}\\ values of the\nEllison et al. (2016) catalog to determine SFRs for AGN host galaxies;\nindeed, {L$_{\\rm IR}$}\\ SFRs are used  throughout this paper, for both star-forming\nand AGN dominated galaxies, unless otherwise stated.  Throughout\nthis paper we require $\\sigma_{\\rm ANN}$ (the uncertainty\non the ANN predicted {L$_{\\rm IR}$}) to be less than 0.1 dex (247,137 galaxeis) and convert {L$_{\\rm IR}$}\\\nto SFR using equation \\ref{eqn-sfr}.  \n\nIn order to compare the SFRs of AGN to those of star-forming (non-AGN)\ngalaxies, we define the SFR offset ($\\Delta$ SFR) of a given galaxy\n(SFR$_{\\rm gal}$) relative to a set of comparison star forming (as \ndefined by Kauffmann et al. 2003 and with S/N$>3$) galaxies\nthat are matched in stellar mass, redshift and local galaxy density\n(environment), also selected from the SDSS.  Local density is defined as\n$\\Sigma_5 = \\frac{5}{\\pi d_5^2}$,\nwhere $d_5$ is the projected distance in Mpc to the $5^{th}$ nearest\nneighbour within $\\pm$1000 {km~s$^{-1}$}.  Normalized densities, $\\delta_5$,\nare computed relative to the median $\\Sigma_5$ within a redshift slice\n$\\pm$ 0.01.  \nThe baseline tolerance used for matching is 0.1 dex\nin M$_{\\star}$, 0.005 in $z$ and 0.1 dex in $\\delta_5$.\nWe require at least 5 comparison galaxies in the matched sample;\nif this is not achieved then the mass, redshift and local density tolerances\nare grown in further increments of 0.1 dex, 0.005 and 0.1 dex respectively,\nuntil the minimum size criterion of 5 is met. \nThe SFR of the comparison star forming sample (SFR$_{\\rm comp}$) is taken as the median\nof the matched control sample. The SFR offset is then defined as:\n\n\n", "itemtype": "equation", "pos": 8650, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract}\nUsing artificial neural network (ANN) predictions of total infra-red\nluminosities ({L$_{\\rm IR}$}), we compare the host galaxy star formation rates (SFRs)\nof $\\sim$ 21,000 optically selected active galactic nuclei (AGN), 466 low excitation \nradio galaxies (LERGs) and 721 mid-IR selected AGN. SFR offsets ($\\Delta$ SFR)\nrelative to a sample of star-forming `main sequence' galaxies  (matched in M$_{\\star}$,\n  $z$ and local environment) are computed for the AGN hosts.  Optically\nselected AGN exhibit a wide range of $\\Delta$SFR, with a distribution skewed to\nlow SFRs and a median $\\Delta$ SFR =  $-0.06$ dex. The LERGs have SFRs\n  that are shifted to even lower values \n  with a median $\\Delta$ SFR = $-0.5$ dex.  In contrast, mid-IR selected\n  AGN have, on average, SFRs enhanced by a factor $\\sim$ 1.5.  We interpret\n  the different distributions of $\\Delta$ SFR amongst the different AGN\n  classes in the context of the relative contribution of triggering by galaxy mergers.\n  Whereas the LERGs are predominantly fuelled through low accretion rate\n  secular processes which are not accompanied by enhancements in SFR,\n  mergers, which can simultaneously boost SFRs, most frequently lead to powerful, obscured AGN.\n\\end{abstract}\n\n\\begin{keywords}\n  galaxies:  active,  galaxies: Seyfert, galaxies:interactions\n\\end{keywords}\n\n\\section{Introduction}\n\nNuclear activity is prevalent in star forming galaxies,\nindicating that a ready supply of matter for the production of\nstars is linked to the fuelling of active galactic nuclei (AGN).\nHowever, the level of star formation in AGN hosts, relative to galaxies\nthat do not exhibit signs of nuclear activity, is contentious.\nStudies of AGN host galaxies have variously shown that they exhibit elevated \n(Silverman et al. 2009; Santini et al. 2012; Juneau et al. 2013;\nRosario et al. 2015; Magliocchetti et al. 2016), normal (Hatziminaoglou \net al. 2010; Harrison et al. 2012; Rosario et al. 2013;\nStanley et al. 2015; Xu et al. 2015; Lanzuisi et al. 2015) or suppressed\n(Salim et al. 2007; Mullaney et al. 2012; Hardcastle et al. 2013; Gurkan et al. 2015; \nShimizu et al. 2015; Leslie et al. 2016) levels of star formation,\neither through `direct' measures of the star formation rate, SFR, or\nindirectly through galaxy colour.\n\nAt least part of the apparent tension in the literature may be associated\nwith observational methods and biases in the data.\nFor example, since star formation rate is known to correlate\nclosely with stellar mass, and AGN tend be more prevalent in higher\nmass galaxies, a simple comparison of AGN and non-AGN will be\nbiased towards high SFRs in the former.  Comparing SFRs at fixed M$_{\\star}$\nis therefore essential (e.g. Shimizu et al. 2015; Leslie et al. 2016).\nSome disagreement between studies may also arise due to the need to\neither stack or average the data in small samples (Mullaney et\nal. 2015).  Furthermore, the nature of star formation in AGN\nmay evolve as a function of redshift (Magliocchetti et al. 2015).\nA more subtle point is that AGN may be selected over a broad\nrange of luminosities and via\na number of diagnostics, spanning the electromagnetic spectrum \nfrom the X-ray and optical to the mid-infrared (IR) and radio (e.g. see Alexander \\&\nHickox 2012 for a review).  AGN selected at different wavelengths\ncan exhibit very different properties in their accretion\nrates, environments and host galaxy properties\n(e.g. Kauffmann et al. 2003; Tasse et al. 2008; Hickox et al. 2009; Smolcic  2009;\nBest \\& Heckman 2012).  The different techniques used\nin studies of different AGN samples makes it difficult to fairly\ncompare the SFRs throughout the AGN family.\nA more complete understanding\nof the SFRs in AGN therefore requires both large, sensitive samples\nfor which the distribution of SFRs can be fully parametrized,\nand a homogeneous comparison between multi-wavelength selected AGN.\n\nOne of the fundamental challenges in the pursuit of a homogeneous,\nmulti-wavelength assessment of star formation in AGN is the lack\nof large samples with uniformly and robustly measured SFRs.\nSince the AGN itself `contaminates' the optical recombination\nlines that are commonly used to calibrate SFRs, these studies have\nhad to adopt alternative methods to determine the SFRs.  Two\ncommon approaches have emerged in recent years.\nThe first method applies the anti-correlation of D$_{4000}$ and specific SFR\nmeasured in star-forming galaxies (e.g. Brinchmann et al. 2004) and\nassumes that the same anti-correlation applies in AGN.\nThe advantage of the D$_{4000}$ SFR calibration is that it\nis readily applied to galaxies with optical spectroscopy,\nand SFRs can hence be determined for large numbers of local\nAGN hosts, such as those in the SDSS.  The main disadvantage of\nthe D$_{4000}$ technique is that its uncertainties are\nrelatively large (Rosario et al. 2016).  \n\nMore robust SFRs\nfor local AGN may be determined from far IR luminosities which are\ngenerally considered to be less contaminated by AGN than\nother tracers (e.g. Netzer et al. 2007; Buat et al. 2010;\nHatziminaoglou et al. 2010; Mullaney et al. 2011).\nHowever, the use of IR SFR diagnostics to widely characterize\nthe local galaxy population has so far been relatively limited.\nUntil recently, the main resource for large area studies of\ngalactic IR luminosities were the all sky surveys performed\nby the Infrared Astronomical Satellite (\\textit{IRAS})\n(Neugebauer et al. 1984) and \\textit{AKARI} (Murakami et al. 2007).\nHowever, these surveys suffer from poor angular resolution\nand shallow sensitivity, leading to problems in confusion\nand detection of only the highest SFR galaxies.\nThe \\textit{Herschel Space Observatory} (hereafter, simply \\textit{Herschel},\nPilbratt et al. 2010),\nhas recently provided a significant step forward in terms of both\nangular resolution and sensitivity.  Several large surveys\nhave been performed with \\textit{Herschel}, such as the \\textit{Herschel} Multi-Tiered\nExtragalactic Survey (HerMES, Oliver et al. 2012) \nand the \\textit{Herschel} Stripe 82 survey (Viero et al. 2014).  However,\neven the largest of the \\textit{Herschel}  extra-galactic surveys, the\n\\textit{Herschel} Astrophysical Terahertz Large Area Survey (H-ATLAS, Eales et al.\n2010), covered only $\\sim$ 550 deg$^2$, which is much smaller\nthan the areas covered by optical spectroscopic surveys such as the SDSS.\nTherefore, a significant\nchallenge in studying the SFRs of AGN has been assembling samples \nthat are both large, and for which robust (e.g. IR) SFRs are available.\nLarge samples are vital for the measurement of SFR distributions, rather than\nbinned averages which can be dominated by outliers (Mullaney et al. 2015).\nIn Ellison et al. (2016) we presented a catalog of $\\sim$ 330,000\ninfra-red luminosities ({L$_{\\rm IR}$}) for galaxies in the SDSS, derived\nby artificial neural network (ANN) techniques.    In the\ncurrent work, we use the {L$_{\\rm IR}$}\\ catalog of Ellison et al. (2016)\nto explore the SFRs of AGN in the local Universe.\n\n\n\n\n\\section{Methodology}\n\nFull details of the {L$_{\\rm IR}$}\\ determinations used in this work are\nprovided in Ellison et al. (2016); only a brief summary is presented\nhere.  The \\textit{Herschel} Stripe 82 Survey (Viero et al. 2014) covers\na total of 79 deg$^2$ in an equatorial strip of the SDSS footprint.\nRosario et al. (2016) cross-matched the 250 $\\mu$m detected galaxies\nfrom \\textit{Herschel} with the SDSS DR7 Main Galaxy Sample whose extinction corrected\nPetrosian r-band magnitudes are brighter than 17.77 and whose\nredshifts are in the range 0.04 $< z <$ 0.15, using a positional\nmatching tolerance of 5 arcsecs.  The \\textit{Herschel}-SDSS matched\ncatalog contains 3319 galaxies, which were further cross-matched\nwith the \\textit{Wide Field IR Sky Explorer} (\\textit{WISE}, Wright et al. 2010)\ncatalog to yield photometry spanning the mid- to\nfar-IR.  Infra-red luminosities were derived by Rosario et al. (2016)\nby fitting the mid- and far-IR photometry with the spectral energy\ndistribution templates of Dale \\& Helou (2002).  AGN are\nexpected to contribute negligibly to the {L$_{\\rm IR}$}\\ of this sample\n(see Rosario et al. 2016 for more details).\n\nThe {L$_{\\rm IR}$}\\ is estimated from an artificial neural network that uses\n1136 \\textit{Herschel} detected galaxies with 23 physical parameters, such\nas stellar masses (Mendel et al. 2014), emission line strengths and\nphotometry (Simard et al. 2011), measured from SDSS data.\nBased on the popular conversion presented by Kennicutt (1998),\nthe {L$_{\\rm IR}$}\\ may be converted to star formation rates (for a Chabrier\ninitial mass function) using\n\n\n", "index": 1, "text": "\\begin{equation}\\label{eqn-sfr}\n\\log  L_{IR} (erg/s) = \\log SFR (M_{\\odot}/yr) + 43.591.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\log L_{IR}(erg/s)=\\log SFR(M_{\\odot}/yr)+43.591.\" display=\"block\"><mrow><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>L</mi><mrow><mi>I</mi><mo>⁢</mo><mi>R</mi></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>g</mi></mrow><mo>/</mo><mi>s</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>R</mi></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>M</mi><mo>⊙</mo></msub><mo>/</mo><mi>y</mi></mrow><mo>⁢</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mn>43.591</mn></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03349.tex", "nexttext": "\n\n\n\\section{Results}\n\n\\subsection{Optically selected AGN}\n\nBaldwin, Phillips \\& Terlevich (1981) pioneered the use of emission\nline ratios to distinguish galaxies dominated by various photoionizing\nprocesses.  Diagnostics separating star-forming from AGN dominated galaxies\nare now commonly referred to as `BPT' diagrams, in reference to these\nauthors.  In this paper, we make use of three of the most commonly\nused diagnostics which incorporate the ratios of [NII]/H$\\alpha$\nand [OIII]/H$\\beta$, by Kewley et al. (2001), Kauffmann et al. (2003) and\nStasinska et al. (2006), hereafter K01, K03 and S06 respectively.\nS06 identifies galaxies with even a small AGN contribution.  K03\nis slightly more relaxed in its selection of AGN but still includes\ngalaxies that are composites of star formation and AGN.\nAGN identified by K01 are those dominated by the AGN.\n\nWe begin our analysis with a single definition of `AGN', adopting\nK03 as our fiducial classification (although our results are qualitatively\nsimilar with any of the 3 diagnostics), with a S/N$>$5 requirement to minimize the\ncontribution by Low Ionization Nuclear Emission line Regions (LINERs;\nsee Leslie et al. 2016 for an assessment of SFR offsets in the LINER population).\nThese selection criteria yield\n20,926 AGN with robust ($\\sigma_{\\rm ANN} < 0.1$ dex)\n{L$_{\\rm IR}$}\\ predictions.    Fig. \\ref{MS_K03} shows the\nlocation of the main sequence of star forming galaxies as filled\nblue contours.  The SFRs of AGN derived from the ANN {L$_{\\rm IR}$}\\ are shown\nin red contours.  For comparison, we also show the aperture\ncorrected AGN SFRs derived from the SDSS spectra via the D$_{4000}$\nmethod.   \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=9.cm,angle=0]{main_sequence_AGN_sdss_K03_SN5_2panels.pdf}\n\\caption{Upper panel: A comparison of star formation rates (from ANN {L$_{\\rm IR}$}\\\n   estimates) in star forming galaxies\n  (filled blue contours) and AGN (open contours) classified according to Kauffmann\n  et al. (2003).  Lower panel: The\n  offset between SFRs in AGN (as measured from {L$_{\\rm IR}$}) relative to the main\n  sequence.  In both panels, red and green colours refer to SFRs derived from\n  ANN {L$_{\\rm IR}$}\\ predictions and from D$_{4000}$ measurements, respectively.  }\n\\label{MS_K03}\n\\end{figure}\n\nAs found by previous authors using the D$_{4000}$ method to measure\nSFRs (e.g. Salim et al. 2007; Shimizu et al.\n2015; Leslie et al. 2016), the optically selected AGN clearly\nhave {L$_{\\rm IR}$}\\ SFRs that lie below the main sequence, i.e. AGN have low SFRs\nfor their M$_{\\star}$, typically by 0.05 -- 0.1 dex, with a median $\\Delta$ SFR=-0.06.\nThe main sequence offsets\nmeasured using D$_{4000}$ extended to somewhat lower SFRs than the {L$_{\\rm IR}$}\\ derived values.\nThere are at least two possible reasons for this.  First, the\nSFRs derived from the ANN are limited to about 0.3 M$_{\\odot}$ yr$^{-1}$,\ndue to the detection limit in the training set.  It is therefore\nlikely that there is a further tail of low SFR AGN that are not included\nin our sample due to an effective `detection limit' in the ANN\n{L$_{\\rm IR}$}\\ predictions (e.g. Leslie et al. 2016).\nA second possible reason for the more extended green contours is that, as\nshown by Rosario et al. (2016) and Ellison et al. (2016), the\nD$_{4000}$ based SFRs are much more uncertain than those derived\nfrom {L$_{\\rm IR}$}, so the lower SFRs in the former may be a result of\na broader error disribution.  \n\nIn order to investigate the dependence of $\\Delta$ SFR on the relative\ncontribution of the AGN, in Fig. \\ref{BPT_dsfr} we plot the BPT\ndiagram for AGN colour-coded by $\\Delta$ SFR.   In order to explore the\ndependence of $\\Delta$ SFR over the maximum range on the BPT diagram,\nwe `relax' the definition of AGN by adopting the criteria of S06, but also\nshowing the demarcation lines fo K01 and K03.   There are $\\sim$ 33,300 galaxies that are classified\nas AGN by the S06 criterion for which we have ANN {L$_{\\rm IR}$}\\ predictions and\nfor which $\\Delta$ SFR can be determined.  To avoid crowding on Fig.\n\\ref{BPT_dsfr} we plot a random sample of 5000 AGN.\nFor reference, all three commonly used diagnostics (K01, K03, S06)\nare shown in Fig. \\ref{BPT_dsfr} as black lines.\nNegative values of $\\Delta$ SFR (low SFRs) dominate throughout the AGN `wing'.\nThe exception is very close to the\nS06 demarcation, where there appear to be fewer galaxies with suppressed SFRs.\nDespite the general preference for AGN to exhibit low $\\Delta$ SFRs,\nthere is a wide variety of\nSFR enhancements at most locations.  Fig. \\ref{BPT_dsfr}\ndemonstrates that, although there is a trend towards more suppressed SFRs as\nwe move along the AGN branch (see also Leslie et al. 2016), even galaxies\nthat are dominated by AGN can sometimes exhibit strong SFR enhancements\n(see also the middle panel of Fig. \\ref{all_dsfr}).  An important caveat \nto these conclusions is that samples of optically selected  AGN may\nbe inherently biased against galaxies with very high SFRs.  Trump\net al. (2015) have investigated the effect of star formation `dilution',\nwhereby high SFRs can move even moderately powerful AGN onto the\nstar forming branch of the BPT diagram.  The dilution effect is most\nproblematic for low mass galaxies.  However, as shown in the lower\npanel of Fig. \\ref{MS_K03} the median value of $\\Delta$ SFR in optically\nselected AGN does not depend strongly on M$_{\\star}$, indicating that\nany bias against the identification of highly star-forming AGN is not\ndriving the tendency towards suppressed SFRs.   \n\nFor the remainder of this paper, we use the K03 classification\nas our fiducial definition of `optical' AGN.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=9.cm,angle=0]{bpt_dsfr.pdf}\n\n\\caption{BPT diagram colour coded by $\\Delta$ SFR for AGN.The 3 black lines\n  show the AGN demarcations of (from top to bottom), K01, K03 and S06.\n  A random sample of 5000 out of $\\sim$33,300 AGN selected by S06 with\n  {L$_{\\rm IR}$}\\ based SFRs is shown.  }\n\\label{BPT_dsfr}\n\\end{figure}\n\n\n\\subsection{AGN selected in the IR and radio}\n\nThe physical properties, such as stellar mass distribution, morphological\nstructure and average colours, of AGN host galaxies depend strongly on how the\nAGN are selected (e.g. Hickox et al. 2009).  In this sub-section, we determine\nSFR offsets from the main sequence for two other samples of AGN, one selected\nbased on radio emission, and the other based on mid-IR colour selection.\nThe novelty of our work is that we can make a direct comparison of\nSFR offsets for these three populations based on a homogeneous analysis.\n\nThe sample of low luminosity radio-selected AGN, specifically\nthe low excitation radio galaxies (LERGs), is taken from the SDSS catalog\ncompiled by Best \\& Heckman (2012).   We determine the SFRs of the Best \\&\nHeckman LERG catalog from our ANN LIR predictions; there are 466\nLERGs for which $\\sigma_{\\rm ANN} < 0.1$.  \n\nThe sample of mid-IR selected AGN\nis identified by cross-matching the \\textit{WISE} All Sky Survey (Wright et al. 2010)\nwith the SDSS and requiring a maximum angular separation of\n6 arcsecs.  We use the W1 and W2 band profile magnitudes, with\na minimum S/N requirement of 5 and identify AGN as galaxies exceeding\nW1$-$W2$>$0.8 (Stern et al. 2012).  721 of these \\textit{WISE} selected AGN have ANN\n{L$_{\\rm IR}$}\\ with $\\sigma_{\\rm ANN} < 0.1$.  \n\nIn Fig. \\ref{all_dsfr} we show the SFR offsets of the three\nAGN samples (coloured histograms), as well as the distribution\nof $\\Delta$SFR amongst star-forming galaxies (black line).\n By definition, this latter distribution\nshould be centred at $\\Delta$ SFR = 0, since the star forming\ngalaxies define the main sequence from which offsets are computed;\nthe width of the histogram simply shows the scatter in the main sequence.\nIn the upper panel of Fig. \\ref{all_dsfr} we confirm the result\nof Gurkan et al. (2015), who studied LERGs in the H-ATLAS sample,\nthat LERGs are offset to lower SFRs than the star forming main sequence.  \nThe optically selected AGN (K03) are shown in the blue\nhistogram of the middle panel of Fig. \\ref{all_dsfr}.\nBy comparing the top and middle\npanels  of Fig. \\ref{all_dsfr} it can be seen that,\nwhilst both the LERGs and the optically selected AGN have a\nmodal $\\Delta$ SFR that is negative, the\ndistributions are quite different.  On average, the LERGs are shifted\nto much lower values of $\\Delta$ SFR than the optically selected\nAGN; the median offset is $\\Delta$SFR=$-0.5$.  \nWhilst 65 per cent of optically selected AGN lie within\na factor of two of the main sequence, and can even exhibit\nenhanced SFRs, the LERGs rarely attain the main sequence SFR\nfor their stellar mass. \n\n\\begin{figure}\n\\centering\n\n\\includegraphics[width=9.cm,angle=0]{plot_delta_sfr_stacked.pdf}\n\\caption{Distributions of $\\Delta$ SFR for various classes of AGN.\n  In all panels, the distribution of $\\Delta$ SFR in star forming\n  galaxies is shown in black; by definition, this distribution is\ncentred around $\\Delta$ SFR = 0.  }\n\\label{all_dsfr}\n\\end{figure}\n\nIn the lower panel of Fig. \\ref{all_dsfr} we show the distribution\nof SFR offsets for AGN identified in the mid-IR.  For the first time, we\ncan now compare the SFR offsets in a homogeneous way for the three\nAGN populations. In contrast to the optically selected AGN\nand the LERGs, the median $\\Delta$ SFR of mid-IR selected AGN\nis +0.17 dex, indicating that the typical powerful, dust-obscured AGN has a factor of $\\sim$\n1.5 excess SFR compared with the main sequence.  However, the tail\nof the $\\Delta$ SFR distribution extends up to +1 dex, indicating\nthat some mid-IR selected AGN have SFRs a factor of 10 above their\ncomparison sample.  Such elevated SFRs are absent in the LERG sample,\nand rare amongst the optically selected AGN. In Ellison et al.\n(2016) we showed that the ANN predictions of {L$_{\\rm IR}$}\\ were accurate\neven when the SFR was elevated to these levels above the main\nsequence.\n\n\\section{Discussion and conclusions}\n\nWhat drives the difference between the $\\Delta$ SFR distributions\nof the 3 types of AGN shown in Fig. \\ref{all_dsfr}?  In particular,\nwhy are the SFRs in mid-IR selected AGN enhanced relative to the main\nsequence, whereas LERGs have SFRs that are almost universally\nbelow expectations for their M$_{\\star}$ (see also\n  Gurkan et al. 2015)? Hardcastle et al. (2013)\nposed a similar question after finding that high excitation radio\ngalaxies (HERGs) had enhanced SFRs, in contrast to the low SFRs\nin LERGs.  Hardcastle et al. (2013) proposed this difference was due\nto the environments in which LERGs an HERGs are typically located\n(Best \\& Heckman 2012).  However, since our star-forming comparison\nsample is matched in $\\delta_5$, this seems unlikely to be the\nexplanation for the different $\\Delta$ SFR distributions seen in\nFig. \\ref{all_dsfr}.  \n\nOur finding that IR, optical and radio-selected AGN form a\nsequence in $\\Delta$ SFR is consistent with an evolutionary picture\nin which an abundant gas supply triggers \nenhanced star formation in an obscured AGN phase.  As the fuel supply\ndeclines, so does the star formation rate and the obscuration.\nA similar picture has been proposed by Hickox et al. (2009),\nbased on a comparison between the host galaxy and clustering \nproperties of a sample of IR, X-ray and radio selected AGN.\nHickox et al. (2009) found that AGN selected in these ways\nformed a sequence in decreasing star formation and accretion rate,\nand increasing halo mass.\nThe evolutionary sequence between star formation and obscuration\nis further supported by the observation that, for samples of X-ray selected\nAGN, star formation rates are significantly enhanced for\nthe obscured/absorbed AGN, but are normal or suppressed\nfor unobscured AGN (Stevens et al. 2005; Juneau et al. 2013).\nMoreover, the X-ray absorbed AGN fraction increases as\ngalaxies lie progressively above the star forming main\nsequence (Juneau et al. 2013).\n\nGalaxy mergers are a natural mechanism to explain such an \nevolutionary sequence, as first proposed by Sanders et al. (1988),\nsince mergers are known to be capable of triggering both star\nformation (e.g. Scudder et al. 2012) and AGN activity (e.g. Ellison\net al. 2011).  In this scenario, the merger remnant of a gas-rich, \nmajor merger first undergoes a significant\nstarburst, possibly manifesting as a luminous (or ultra-luminous) IR\ngalaxy and high accretion rate AGN (possibly a quasar).  As the starburst\nfades, the AGN transitions from obscured to unobscured and the\ngalaxy eventually evolves to an early type (e.g. see Fig. 6 in\nAlexander \\& Hickox 2012 for a schematic view of this process).\n\nThe dependence of star formation rate enhancement on AGN obscuration \nduring the post-merger phase is supported by the observation that\ncertain classes of AGN are more prevalent amongst ongoing mergers.\nFor example, in close pairs and recent post-mergers, optically\n  selected AGN are over-abundant (relative to the AGN frequency\n  in isolated galaxies) by a factor of 2--3 (Ellison et al. 2013),\ncompared to a factor of 5--20 in mid-IR selected AGN\n(Satyapal et al. 2014).  Mid-IR selected AGN have\nalso been shown to exhibit a high dual black hole fraction\n(Secrest et al., in preparation), in contrast to optical searches\nwhich have a low success rate in detecting binaries (Fu et al. 2011;\nMuller-Sanchez et. al 2015).  The connection between obscuration and\nmerging is also found in the X-ray, where the most absorbed AGN are\nfound most frequently in mergers (Kocevski et al. 2015; Lanzuisi et al.\n2015).\n\nIn contrast to the consistent link between obscured AGN and mergers,\nthe results for the unobscured population has been more controversial.\nWhereas an excess of AGN is measured in close pairs of galaxies (Ellison\net al. 2011; Silverman et al. 2011), demonstrating that mergers\n\\textit{may} trigger AGN, the morphological classification of AGN\nindicates that mergers do not appear to \\textit{dominate}\nthe triggering of unobscured AGN (e.g. Gabor et al. 2009;\nKocevski et al. 2012).  These results are consistent with the\ndistribution of SFRs in optically selected AGN (Fig \\ref{all_dsfr},\nmiddle panel), in which the\nmajority of galaxies have normal-to-low SFRs, and are hence unlikely\nto be linked to mergers.  The small number of optical AGN with enhanced\nSFRs may be those that are merger triggered, a postulate that is\nconfirmed through visual inspection of the SDSS images.\n\nIn contrast to optical and mid-IR selected\nAGN, there is no excess of LERGs in merger samples, indicating that\nthey are fuelled by secular processes,\nwhere low levels of accretion (not connected with a starburst)\ncan be maintained from a combination of\nstellar and external sources  (Ellison, Hickox \\& Patton 2015).\nRather than an `evolutionary' (i.e. time sequence) scenario,\nour observations may therefore also be explained by different relative \ncontributions of mergers to the 3 AGN classes.  I.e.\nLERGs have the lowest SFRs because\nthere is no boost from mergers, whereas a higher fraction of IR\nselected AGN are linked to mergers and have experienced triggered\nstar formation during the interaction.  Put another way, mergers\nmay lead to high SFRs and luminous (obscured) AGN, but a distinct, secular\npathway is responsible for lower luminosity AGN with normal or low\nSFRs (e.g. Shao et al. 2010).\n\nThe idea that the distribution of $\\Delta$ SFR in the different\nAGN classes is by driven by the relative contributions of mergers\nis supported by differences in their merger fractions.\nWe compute the merger fraction for each AGN class as the fraction\nof galaxies classified as a merger in Galaxy Zoo, requiring a\nmerger vote fraction $>$ 0.4 (e.g. Darg et al. 2010).\nMerger fractions for the different types of AGN are: radio - 1 per cent,\noptical - 3 per cent, mid-IR - 7 per cent.  The higher merger fraction\namongst the mid-IR sample is despite a redshift distribution skewed\ntowards slightly higher values than the optical AGN and\nLERG samples making it potentially harder to identify mergers therein.\nAlthough these merger fractions should not\nbe considered as absolute, due to the limitations of visual classification\nin shallow ground-based images, without removal of projected companions,\ntheir relative values are indicative that mergers are most prevalent amongst IR\nselected AGN, and least common amongst LERGs.  A complete assessment of\nmergers in this sample is beyond the scope of this paper, but we note that the excess\nof mergers amongst mid-IR selected persists for stricter cuts on merger\nvote fraction.\n\nIn conclusion, our main result is that the SFRs of AGN are critically\ndependent on how an AGN is selected. IR selected galaxies in the SDSS\nshow a median SFR enhancement of a factor of $\\sim$ 1.5, compared to\nan under-abundance of star formation in optically selected AGN (by\n$\\sim$ 25 per cent) and low luminosity radio-selected AGN (by a factor of\n3).  We propose that these differences may be explained by a relatively\nhigh fraction of mergers amongst IR selected AGN, a lower merger\nincidence amongst optically selected AGN, and the domination of\nsecular fuelling processes for LERGs, which are hosted primarily by\nmassive galaxies with low SFRs.\n\n\n\n\\begin{thebibliography}{}\n\\small\n\\itemindent -0.48cm\n\n\\bibitem[Alexander \\& Hickox (2012)]{ah12}\n        Alexander, D. M., Hickox, R. C., 2012, NewAR, 56, 93\n\n\\bibitem[Baldwin, Phillips \\& Terlevich (1981)]{bpt81}\n        Baldwin, J. A,; Phillips, M. M., Terlevich, R., 1981, PASP, 93, 5\n\n\\bibitem[Best \\& Heckman (2012)]{bh12}\n        Best, P. N.,  Heckman, T. M., 2012, MNRAS, 421, 1569\n\n\\bibitem[Brinchmann et al. 2004]{bri04} \n        Brinchmann, J., Charlot, S., White, S. D. M., Tremonti, C., \n\tKauffmann, G., Heckman, T., Brinkmann, J.,2004, MNRAS, 351, 1151  \n\n\\bibitem[Buat et al. (2010)]{buat10}\n        Buat, V., et al., 2010, MNRAS, 409, 1\n\n\\bibitem[Dale \\& Helou (2002)]{dh02}\n        Dale, D. A., \\& Helou, G., 2002, ApJ, 576, 159\n\n\\bibitem[Darg et al. (2010a)]{darg10a} \n        Darg, D. W., et al., 2010, MNRAS, 401, 1552\n\n\\bibitem[Eales et al. (2010)]{hatlas10}\n        Eales, s., et al.,  2010, PASP, 122, 499\n\n\\bibitem[Ellison et al. (2013)]{post} \n         Ellison, S. L., Mendel, J. T.,  Patton, D. R., Scudder, J. M.,\n\t2013, MNRAS, 453, 3627\n\n\\bibitem[Ellison, Patton \\& Hickox (2015)]{erh15}\n        Ellison, S. L., Patton, D. R., Hickox, R. C., 2015, MNRAS, 451, L35\n\n\\bibitem[Ellison et al. (2011)]{agn}\n         Ellison, S. L., Patton, D. R.,  Mendel, J. T., Scudder, \n\t J. M., 2011, MNRAS, 418, 2043\n\n\\bibitem[Ellison et al. (2016)]{lir_ann}\n        Ellison, S. L., Teimoorinia, H., Rosario, D. J., Mendel, J. T.,\n        2016, MNRAS, 455, 370\n\n\\bibitem[Fu et al. (2011)]{fu11}\n        Fu, H., Myers, A. D., Djorgovski, S. G., Yan, L.,\n\t2011, ApJ, 733, 103\n\n\\bibitem[Gabor et al. (2009)]{gab09}\n        Gabor, J. M.,  et al., 2009, ApJ, 691, 705\n\n\\bibitem[Gurkan et al. (2015)]{gur15}\n\tGurkan, G., et al., 2015, MNRAS, 452, 3776\n\n\\bibitem[Hardcastle et al. (2013)]{hard13}\n         Hardcastle, M. J., et al., 2013, MNRAS, 429, 2407\n\n\\bibitem[Harrison et al. (2012)]{har12}\n        Harrison, C. M., et al.,  2012, ApJ, 760, L15\n\n\\bibitem[Hatziminaoglou et al. (2010)]{hat10}\n        Hatziminaoglou, E., et al., 2010, A\\&A, 518, L33\n\n\\bibitem[Hickox et al. (2009)]{hick09}\n         Hickox, R. C., et al., 2009, ApJ, 696, 891\n\n\\bibitem[Juneau et al. (2013)]{jun13}\n        Juneau, S., 2013, ApJ, 764, 176\n\n\\bibitem[Kauffmann et al. (2003)]{kau03} \n\tKauffmann, G., et al., 2003, MNRAS, 346, 1055\n\n\\bibitem[]{}\n        Kennicutt, R.C. 1998, ARA\\&A, 36, 189\n\n\\bibitem[Kewley et al. (2001)]{kew01}  \n         Kewley, L. J., Dopita, M. A., Sutherland, R. S., Heisler, C. A., \n\t Trevena, J.,  2001, ApJ, 556, 121\n\n\\bibitem[Kocevski et al. (2011)]{koc11}\n        Kocevski, D., et al. 2012, ApJ, 744, 148\n\n\\bibitem[Kocevski et al. (2015)]{koc15}\n        Kocevski, D., et al. 2015, ApJ, 814, 104\n\n\\bibitem[Lanzuisi et al. (2015)]{lan15}\n        Lanzuisi, G., et al.,  2015, A\\&A, 573, 137\n\n\\bibitem[Leslie et al. (2015)]{les15}\n        Leslie, S. K., Kewley, L. J., Sanders, D. B., Lee, N.,\n\t2016, MNRAS, 455, L82\n\n\\bibitem[Magliocchetti et al. (2016)]{mag16}\n        Magliocchetti, M., Lutz, D., Santini, P., Salvato, M., Popesso, \n\tP., Berta, S., Pozzi, F., 2016, MNRAS, 456, 431\n\n\\bibitem[Mendel et al. (2014)]{mass}\n        Mendel, J. T., Palmer, M. J. D., Simard, L., Ellison, S. L.,  \n\tPatton, D. R., 2014, ApJS, 210, 3\n\n\\bibitem[Mullaney et al. (2011)]{mull11}  \n        Mullaney, J. R., Alexander, D. M., Goulding, A. D., \n\tHickox, R. C., 2011, MNRAS, 414, 1082\n\n\\bibitem[Mullaney et al. (2012)]{mull12}  \n         Mullaney, J. R., et al., 2012, ApJ, 419, 95\n\n\\bibitem[Mullaney et al. (2015)]{mull15}  \n        Mullaney, J. R., et al., 2015, MNRAS, 453, L83\n\n\\bibitem[Muller-Sanchez et al., (2015)]{ms15}\n         Muller-Sanchez, F., Comerford, J. M., Nevin, R., Barrows, R. S.,\n\t Cooper, M. C., Greene, J. E., 2015, ApJ, 813, 103\n\n\\bibitem[Murakami et al. (2007)]{akari}\n        Murakami, H., et al.,  2007, PASJ, 59S, 369\n\n\\bibitem[Netzer (2007)]{net07}\n        Netzer, H., et al.,  2007, ApJ, 666, 806\n\n\\bibitem[Neugebauer et al. (1984)]{iras84}\n        Neugebauer, G., et al., 1984, ApJ, 278, L1\n\n\\bibitem[Oliver et al. (2012)]{oli12}\n        Oliver, S. J., et al., 2012, MNRAS, 424, 1614\n\n\\bibitem[Pilbratt et al. 2010]{her12}\n        Pilbratt, G. L., et al., 2010, A\\&A, 518, 1\n\n\\bibitem[Rosario et al., (2013)]{ros13}\n        Rosario, D. J., et al.,  2013, A\\&A, 560, 72\n\n\\bibitem[Rosario et al., (2015)]{ros15a}\n        Rosario, D. J., et al.,  2015, A\\&A, 573, 85\n\n\\bibitem[Rosario et al. (2015)]{ros15b}\n         Rosario, D. J., Mendel, J. T., Ellison, S. L., Lutz, D.,\n         Trump, J. R., 2016, MNRAS, in press\n\n\\bibitem[Salim et al. (2007)]{sal07}\n        Salim, S., et al, 2007, ApJS, 173, 267\n\n\\bibitem[Sanders et al. (1988)]{san88}\n        Sanders, D. B., Soifer, B. T., Elias, J. H., Madore, B. F., \n\tMatthews, K., Neugebauer, G., Scoville, N. Z..,\n\t1988, ApJ, 325, 74\n\n\\bibitem[Santini et al. (2012)]{san12}\n        Santini, P., et al., 2012, A\\&A, 540, 109\n\n\\bibitem[Satyapal et al. (2014)]{sat14} \n        Satyapal, S., Ellison, S. L., McAlpine, W., Hickox, R. C., \n\tPatton, D. R., Mendel, J. T., 2014, MNRAS, 441, 1297\n\n\\bibitem[Scudder et al. (2012b)]{[pairs}\n         Scudder, J. M., Ellison, S. L., Torrey, P., Patton, D. R.,\n\t Mendel, J. T., 2012, MNRAS, 426, 549\n\n\\bibitem[Shao et al. 2010]{shao10}\n        Shao, L., et al.,  2010, A\\&A, 518, L26\n\n\\bibitem[Shimizu et al. (2015)]{shi15}\n        Shimizu, T. T., Mushotzky, R. F., Melendez, M., Koss, M., \n\tRosario, D. J., 2015, MNRAS, 452, 1841\n\n\\bibitem[Silverman et al. (2009)]{sil09} \n         Silverman, J. D., et al., 2009, ApJ, 696, 396\n\n\\bibitem[Simard et al. (2011)]{sim11}\n        Simard, L., Mendel, J. T., Patton, D. R., Ellison S. L., \n\tMcConnachie, A. W., 2011, ApJS, 196, 11\n\n\\bibitem[Smolcic (2009)]{smol09}\n        Smolcic, V.,  2009, ApJ, 699, L43        \n\n\\bibitem[Stanley et al. (2015)]{stan15}\n        Stanley, F. et al., 2015, MNRAS, 453, 591\n\n\\bibitem[Stasinska et al. (2006)]{stas06}\n        Stasinska, G., Cid Fernandes, R., Mateus, A., Sodre, L., \n\tAsari, N. V.,  2006, MNRAS, 371, 972\n\n\\bibitem[Stern et al. (2012)]{ste12}\n         Stern, D., et al., 2012, ApJ, 753, 30\n\n\\bibitem[Stevens et al. (2005)]{ste05}\n        Stevens, J. A., Page, M. J., Ivison, R. J., Carrera, F. J., \n\tMittaz, J. P. D., Smail, Ian, McHardy, I. M., 2005, MNRAS, 360, 610\n\n\\bibitem[Trump et al. (2015)]{tru15}\n         Trump, J. R., et al., 2015, ApJ, 811, 26\n\n\\bibitem[Tasse et al. (2008)]{tas08}\n        Tasse, C., Best, P. N., Rottgering, H., Le Borgne, D.,\n\t2008, A\\&A, 490, 893\n\n\\bibitem[Viero et al. (2014)]{s82}\n         Viero, M. P., et al., 2014, ApJS, 210, 22\n\n\\bibitem[Wright et al. (2010)]{wise}\n        Wright, E. L., et al., 2010, AJ, 140, 1868\n\n\\bibitem[Xu et al. (2015)]{xu15}\n        Xu, L., Rieke, G. H., Egami, E., Pereira, M. J., Haines, C. P., \n\tSmith, G. P., 2015, ApJS, 219, 18\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 10619, "prevtext": "\n\nThe SFRs that result from the ANN predictions were shown by\nEllison et al. (2016) to be\nin excellent agreement with those from the SDSS for star-forming\ngalaxies.  In this paper, we additionally utilize the {L$_{\\rm IR}$}\\ values of the\nEllison et al. (2016) catalog to determine SFRs for AGN host galaxies;\nindeed, {L$_{\\rm IR}$}\\ SFRs are used  throughout this paper, for both star-forming\nand AGN dominated galaxies, unless otherwise stated.  Throughout\nthis paper we require $\\sigma_{\\rm ANN}$ (the uncertainty\non the ANN predicted {L$_{\\rm IR}$}) to be less than 0.1 dex (247,137 galaxeis) and convert {L$_{\\rm IR}$}\\\nto SFR using equation \\ref{eqn-sfr}.  \n\nIn order to compare the SFRs of AGN to those of star-forming (non-AGN)\ngalaxies, we define the SFR offset ($\\Delta$ SFR) of a given galaxy\n(SFR$_{\\rm gal}$) relative to a set of comparison star forming (as \ndefined by Kauffmann et al. 2003 and with S/N$>3$) galaxies\nthat are matched in stellar mass, redshift and local galaxy density\n(environment), also selected from the SDSS.  Local density is defined as\n$\\Sigma_5 = \\frac{5}{\\pi d_5^2}$,\nwhere $d_5$ is the projected distance in Mpc to the $5^{th}$ nearest\nneighbour within $\\pm$1000 {km~s$^{-1}$}.  Normalized densities, $\\delta_5$,\nare computed relative to the median $\\Sigma_5$ within a redshift slice\n$\\pm$ 0.01.  \nThe baseline tolerance used for matching is 0.1 dex\nin M$_{\\star}$, 0.005 in $z$ and 0.1 dex in $\\delta_5$.\nWe require at least 5 comparison galaxies in the matched sample;\nif this is not achieved then the mass, redshift and local density tolerances\nare grown in further increments of 0.1 dex, 0.005 and 0.1 dex respectively,\nuntil the minimum size criterion of 5 is met. \nThe SFR of the comparison star forming sample (SFR$_{\\rm comp}$) is taken as the median\nof the matched control sample. The SFR offset is then defined as:\n\n\n", "index": 3, "text": "\\begin{equation}\n  \\Delta SFR = \\log SFR_{\\rm gal} - \\log SFR_{\\rm comp}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\Delta SFR=\\log SFR_{\\rm gal}-\\log SFR_{\\rm comp}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>R</mi></mrow><mo>=</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><msub><mi>R</mi><mi>gal</mi></msub></mrow></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><msub><mi>R</mi><mi>comp</mi></msub></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]