[{"file": "1601.02256.tex", "nexttext": "\n\n\\noindent\nSubsequently  we  compared  the  radial  velocity  scale  of  the  two\nspectrographs  with the  one  of HARPS  (for  the stars  in common  as\nreported below),  and we concluded  that the measurements  in the\nreference system of  GIRAFFE are in the  reference system of HARPS\nwith no noticable offset.\n\n\\noindent\nFig.\\ref{fig:epoch_zpoints_giraffe_uves} reports  the results obtained\napplying the plate-to-plate correction  to UVES data (middle and right\npanels).  Also  in this case  we observe a substantial  improvement of\nthe precision.  The dispersion of the best  Gaussian fit to the\nobserved distribution is  in this case 598 m  s$^{-1}$ (average of the\nupper  and  lower  UVES   spectra),  while  after  the  plate-to-plate\ncorrection the dispersion is equal to 156 m s$^{-1}$.   Thanks to the\nadoption of  the GIRAFFE reference system  we were then  able to check\nalso  for  intra-plate  systematics   for  UVES.   Note  that  such  a\ncorrection is  not possible using only the  simultaneous fibers, given\nthat only one simultaneous fiber per plate is allowed for UVES.  \nThe adoption of this correction improved further the dispersion (119 m\ns$^{-1}$)   although  we   note  that   the   corresponding  residuals\ndistribution presents evident  non-Gaussian tails.  Likely \nintra-plate  systematics are present although  the smaller number\nof stars used for the correction  may not be able to perfectly capture\nthe  systematic  trend.  .  We  proceeded  further  and analyzed  the\nepoch-to-epoch UVES systematics,  decorellating all residuals acquired\nduring the  same observing night as  a function of  color, airmass and\nallowing for the presence of a zero point offset.  In this case such a\ncorrection  appears to  deteriorate (127  m s$^{-1}$)  the\nprecisions, and we therefore did not apply it.\n\n\\noindent\nAfter the  above reported correction  steps, the upper and  lower UVES\nspectra  were merged, and  the results  finally merged  to the  one of\nGIRAFFE to produce a single  combined catalog. For what has been said,\nthe radial velocity scale of this  catalog is the one of GIRAFFE (that\nis  the one  of HARPS,  see below).   The GIRAFFE  and combined\ncatalogs contain 313  stars in total, while the  UVES catalog contains\n75 stars.  The total number of stars with at least two measurements is\nequal to  300 stars for  GIRAFFE (and combined catalog) and 67  stars \nfor UVES.\n\n\\noindent\nFig.\\ref{fig:rms_hist} shows  the final RMS obtained  for the GIRAFFE,\nUVES  and combined  sample for  all the  stars \nhaving  at  least two\nmeasurements  respectively and with RMS<1 km$\\rm s^{-1}$\n(250 stars for GIRAFFE and combined catalogs and 61 stars for UVES catalog).  \n\nThe median  precision (denoted by the vertical dashed lines \nin Fig.\\ref{fig:rms_hist}) \nof GIRAFFE is  240 m $\\rm  s^{-1}$ while  the one of  UVES is 180  m $\\rm\ns^{-1}$.  The combined sample median RMS (250 m $\\rm s^{-1}$) reflects\nthe GIRAFFE sample  RMS due to the much  larger number of measurements\nacquired   with   GIRAFFE.    Fig.\\ref{fig:rv_hist},  represents   the\nhistogram  of  all  the  radial  velocity measurements  in  the  final\ncatalog.  The peak due to cluster members is clearly visible.\n\n\\subsubsection{HARPS}\n\n\\noindent\nThe HARPS  radial velocities measurements were  obtained directly from\nthe header of the pipeline processed files, and no post-correction was\napplied.  This  sample is composed by a  set of 7 stars  that were all\nincluded  in the  UVES-GIRAFFE dataset  observed in  2004-2005.  While\nfour of  these objects appeared  possible planetary candidates  at the\ntime of  the follow-up, the  HARPS observations have dismissed  all of\nthem as false positives.\n\n\\noindent\nOn the contrary, we note that the transiting planetary candidate (star\n171895) we found  in our previous photometric  campaigns, described in\nM11,  has not  been targeted  with HARPS  and it  remains  therefore a\nprimary target for future observational efforts.\n\n\\noindent\nTo estimate the average precision  obtained by HARPS on this sample of\nstars we subtracted the mean radial velocity and calculated the RMS of\nall  combined residuals.  In this  way  we obtained  a value  of 35  m\n$\\rm\\,s^{-1}$.\n\n\\noindent\nBy comparing the average velocity obtained with GIRAFFE and with HARPS\nfor  these stars  we obtained  an average  difference between  the two\nspectrographs radial velocity scale equal to (-0.094$\\pm$0.091) km$\\rm\n\\,s^{-1}$, which demonstrates that  the radial velocity scale of GIRAFFE\nis consistent with the one of HARPS.\n\n\n\n\\section{Search for variables}\n\\label{sec:search}\n\nFigure~\\ref{fig:RMS} shows  the RMS  distribution for all  the catalog\nstars.  We adopted a magnitude dependent treshold for the detection of\nvariables  as visible in  Fig.~\\ref{fig:RMS_CLOSE}. This  RMS treshold\n($\\rm \\sigma_{ref}$) was calculated by medianing the RMS values of the\nstars  found  in 0.2  mag  bins  and fitting  a  linear  model to  the\nresulting median  values.  We  adopted a 5$\\rm  \\sigma_{ref}$ treshold\ndenoted  by the  dotted  line  in the  above  mentioned Figures.   All\nobjects beyond  this treshold were considered  bona-fide variables and\nare denoted in particular by the blue dots.\n\n\\noindent\nWe also searched for periodic variables given the extent of our survey\nand  the fact  that many  objects  have multiple  measurements in  our\ncatalog.   In particular we  limited the  search for  periodicities to\nstars with at  least 10 epochs.  We used  the Generalized Lomb Scargle\n(GLS) algorithm  of Zechmeister \\& K\\=urster (2009)  and in particular\ntheir  Eq.~5.  This algorithm  allows to  fit a  sinusoid to  the data\ntogether  with  a constant  offset.   To  properly  set the  detection\ntreshold  of  the  GLS  we  constructed  a  mock  sample  of  constant\nartificial  radial velocities.   The measurements  for each  star were\nsimulated assuming  a gaussian noise  with a dispersion equal  to $\\rm\n\\sigma_{ref}$.  We  considered the true distribution of  epochs of our\nstars,  each simulated  star  being a  constant  mock copy  of a  real\nobserved one. We created around 10$^5$ simulated stars and applied the\nGLS  to all  of them.   We searched  for periodic  signals considering\nperiods  in between  0.5 and  1000 days  subdividing this  interval in\n10000  equal frequency  steps.  From  the distribution  of  GLS powers\n($\\rm  p_{GLS}$) we  obtained, we  imposed a  False  Alarm Probability\n(FAP) treshold equal to 0.1$\\%$, which was found equal to $\\rm p_{GLS,\n  FAP}=0.956$.\n\n\\noindent\nIn the  exactly same way we  applied the GLS to  all real measurements\nflagging  out all  objects having  $\\rm p_{GLS}\\,>\\,p_{GLS,  FAP}$. We\nfound  that this  condition  was  met for  28  objects. We  considered\nhowever  as reliable  GLS variables  only those  for which  an orbital\nsolution      could      be       found      as      described      in\nSect.~\\ref{sec:spectroscopic_binaries}.  Most  of  the  GLS  solutions\nimplied long  term trends or  in any case  the phase coverage  was not\nconsidered  sufficient to perform  a fit.   All  of these\nobjects lie  beyond the  5$\\rm\\sigma_{ref}$ treshold and  are therefore\nalso RMS variables. \n\nThe final list of reliable  GLS variables contains 6 objects which are\ndenoted    by   the   green    dots   in    Figure~\\ref{fig:RMS}   and\nFigure~\\ref{fig:RMS_CLOSE}.  The  total list of  variables contains 45\nstars.\n\n\n\n\n\n\n\n\\section{Classification of the stars}\n\\label{sec:classification}\n\nWe  proceeded  by  calculating  the  average radial  velocity  of  the\ncluster.   To do  that we  used both  the proper  motion probabilities\nderived in M09 and the  radial velocities calculated in this work.  We\nfirst considered those objects  for which the proper motion membership\nprobability was  larger than 90$\\%$  at magnitude $V=$12.5  and larger\nthan 50$\\%$ at $V=18$,  interpolating linearly between these extremes.\nFurthermore, we impose  that the corresponding x and  y coordinates of\nthese   stars  should   have  been   contained   within  $800<x<1300$,\n$1000<y<3000$  in the  reference system  of  CCD51 of  the Wide  Field\nImager detector  where the cluster  was located in M09.   Beyond these\nlimits  we  considered our  proper  motions  doubtful  as reported  in\nearlier works.   These tresholds are the  same adopted in  the past to\nisolate cluster  members.  We  also limited the  sample to  stars that\nwere  not  flagged  out  as  variables  accordingly  to  the  analysis\nperformed in the  previous Section. In this way  we identify 66 stars.\nThe  average  cluster  radial  velocity  $\\rm  \\overline{RV}_{cl}$  we\nobtained is\n\n\n", "itemtype": "equation", "pos": 23995, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\n\\begin{abstract}\nThe old  and metal rich  open cluster NGC  6253 was observed  with the\nFLAMES multi-object  spectrograph during an  extensive radial velocity\ncampaign monitoring 317  stars with a median of  15 epochs per object.\nAll the  targeted stars are located  along the upper  main sequence of\nthe  cluster  between 14.8  $<$  V $<$  16.5.   Fifty nine stars  are\nconfirmed cluster members both by radial velocities and proper motions\nand  do not  show evidence  of variability.   We detected  45 variable\nstars among  which 25 belong to NGC  6253.  We were able  to derive an\norbital  solution  for 4  cluster  members  (and  for 2  field  stars)\nyielding  minimum masses  in between  $\\sim$90 M$\\rm_J$  and $\\sim$460\nM$\\rm_J$ and periods between 3 and 220 days.  Simulations demonstrated\nthat this  survey was sensitive to  objects down to 30  M$\\rm_J$ at 10\ndays orbital periods with a detection efficiency equal to 50\\%. On the\nbasis of  these results  we concluded that  the observed  frequency of\nbinaries down to the hydrogen burning  limit and up to 20 days orbital\nperiod is  around (1.5$\\pm$1.3)\\% in  NGC 6253.  The  overall observed\nfrequency  of   binaries  around  the  sample  of   cluster  stars  is\n(13$\\pm$3)\\%.  The  median radial  velocity precision achieved  by the\nGIRAFFE   spectrograph   in    this   magnitude   range   was   around\n$\\sim$240m$\\rm\\,s^{-1}$ ($\\sim$180 m$\\rm\\,s^{-1}$ for UVES).  Based on\na limited follow-up  analysis of 7 stars in our  sample with the HARPS\nspectrograph we determined  that a precision of 35  m $\\rm s^{-1}$ can\nbe  reached  in this  magnitude  range,  offering  the possibility  to\nfurther extend  the variability  analysis into the  substellar domain.\nProspects  are  even more  favourable  once  considering the  upcoming\nESPRESSO spectrograph at VLT.\n\\end{abstract}\n\n\n\n\\begin{keywords}\nopen clusters: general -- open clusters: individual NGC~6253\n\\end{keywords}\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:introduction}\n\nNGC            6253            ($\\alpha_{2000}=16^{h}\\,59^{m}\\,05^{s},\n\\delta_{2000}=-52^{\\circ}\\,42\\arcmin\\,30\\arcsec,\nl=335\\fdg5,b=-6\\fdg3$) is  an old and metal-rich  open cluster located\ninside the  solar ring  and projected toward  a rich  Galactic stellar\nfield in the direction of  the Galactic center.  The metal-rich nature\nof this cluster and its  importance in the context of Galactic studies\nwere early  recognized in the  seminal work of Bragaglia  et al.~(1997)\nand later on discussed by several other authors in the past (Piatti et\nal.  1998; Sagar,  Munari, \\& de Boer 2001;  Twarog, Anthony-Twarog \\&\nDe  Lee  2003; Anthony-Twarog,  Twarog,  \\&  Mayer  2007; Carretta  et\nal. 2000; Carretta,  Bragaglia \\& Gratton 2007; Sestito  et al.  2007;\nAnthony-Twarog  et  al.   2010).   Novel chemical  studies  have  been\nrecently presented in Mikolaitis  et al.~(2012) where C,N,O abundances\nand carbon  isotope ratios for four  red clump stars  of NGC~6253 were\nanalyzed and in Cummings et al.~(2012), focused on lithium abundance.\n  \nIn the  context of extrasolar  planet searches NGC~6253 plays  a major\nrole.  Given its high  metallicity and  the well  known fact  that the\nfrequency  of jupiter  planets found  around field  stars is  known to\nstrongly  correlate with metallicity  (e.g.  Gonzalez~1997;  Santos et\nal.~2001; Santos et al.~2004; Fischer \\& Valenti 2005; Mortier et al. 2012) we may expect a\nlarge  population of  these objects  to  be present  in this  cluster,\nunless  other  evolutionary  and  environmental  factors  alter  their\nformation histories.\n\nOur  previous  efforts  to   detect  this  population  and  to  better\ncharacterize cluster properties were  presented in a sequence of works\nstarting with Montalto et al.~(2009, hereafter M09) where we delivered\na  photometric  and   astrometric  catalog  including  proper  motions\nmembership  probabilities.   De   Marchi  et  al.~(2010)  studied  the\nphotometric  variability   properties  of  cluster   members  and  the\nsurrounding field  producing a catalog  of 595 variables, 35  of which\nwere proposed as cluster  members. In Montalto et al.~(2011, hereafter\nM11) we  presented the results  of a radial velocity  survey conducted\nwith the UVES/GIRAFFE spectrographs at VLT, mostly concentrated on the\nevolved  portion of  the color-magnitude  diagram.  In  that  work, we\npresented a follow-up analysis  of three planetary candidates we found\nin our  photometric studies and  highlight the discovery of  the first\ncluster double lined eclipsing  binary system, located in the turn-off\nregion (star 45368 in our catalog) which membership was confirmed both\nby proper motions  and by radial velocities.  We  analyzed a sample of\n139  stars in  the  cluster  region concluding  that  35 where  likely\ncluster members and 12 likely close binary systems.\n\nIn Montalto  et al~(2012), we performed equivalent  width analysis and\nderived Fe,  Si, Ca,  Ti, Cr  and Ni abundances  as well  as abundance\nratios  of  a main-sequence  star,  two  red-clump  stars and  a  blue\nstraggler cluster members.  For  our main-sequence star, we obtained a\nmetallicity of [Fe/H]=+0.26$\\pm$0.11 (rms), whereas for the two giants\nwe found that our  metallicities were on average [Fe/H]=+0.19$\\pm$0.13\n(rms), lower than what was  determined in previous studies (Sestito et\nal.~2007,   [Fe/H]=+0.36$\\pm$0.07   rms,   Carretta  et   al.    2007,\n[Fe/H]=+0.46$\\pm$0.03 rms).\n\nNGC-6253 fundamental  parameters are not  yet firmly set.  It  is well\nknown that  the different calibrated photometries presented  so far do\nnot agree well, and that significant differences exist among them. The\ncluster  age  was  set  to  3.5  Gyr  in  M09  and  the  reddening  to\n$E(B-V)$=0.15. These  estimates were respectively the  upper bound age\nand the lower bound reddening  derived from isochrone fit so far, once\ncompared with  the other results in the  literature.  However recently\nRozyczka et al.~(2014) presented  a detailed analysis of the eclipsing\nbinary 45368 (renamed in their work V15).  Their results indicate that\nthe age of  NGC~6253 should be comprised between 3.80  - 4.25 Gyr from\nthe mass-radius diagram and should be  even older (3.9 - 4.6 Gyr) from\ncolor-magnitude diagram  (CMD) fitting.  They also  report a reddening\nequal to $E(B-V)$=0.113  mag, and therefore lower than  our own value.\nThe same authors  presented in Kaluzny et al.~(2014)  the results of a\nnovel photometric  campaign in the cluster region,  conducted with the\n1.0m Swope Telescope in Las Campanas, focusing primarily on the bright\nportion of the CMD, in a domain only partially covered by our previous\nphotometric surveys.   Among a sample  of 25 additional  variables the\nauthors  detected  three  novel  eclipsing  binaries  members  of  the\ncluster.  The  analysis of  these objects will  likely  permit to\nreach more stringent constraints  on cluster properties and to further\ncomplement  the  results  obtained   for  45368.   It  has  been  also\ndemonstrated that theoretical models  fail to accurately reproduce the\nobserved    CMD,     particularly    for    evolved     stars    (M09,\nAnthony-Twarog~2010, Rozyczka et al.~2014).\n \nIn  this work,  we present  the  results of  another extensive  radial\nvelocity  campaign that  was performed  on  this cluster  in the  past\nyears.  This survey  superseeds by  far  both in  number of  monitored\nobjects and in number of epochs the analysis presented in M11 and also\nthe similar  one discussed  in Anthony-Twarog~(2010). It  represents a\nmore   ambitious  effort  to   better  characterize   radial  velocity\nvariability among  cluster members, and  an important step  toward the\ndetection of low mass objects.  \nThe preparation  of the observations presented in  this work preceeded\nin time the photometric and astrometric analysis discussed in\nM11. Sample selection was based  on the work of Twarog, Anthony-Twarog\n\\& De Lee (2003). The magnitude range of the sample stars is comprised\nin  between 14.8$<$  V $<$16.5.   All  the targeted stars lie on the upper\nmain sequence of NGC~6253.\n\n\nIn  Section~\\ref{sec:observations},  we describe  the observations  we\nacquired.      In  Section~\\ref{sec:reduction},    we     discuss data\nreduction. In Section~\\ref{sec:search}, we present the methods used to\nidentify   variables and  in Section~\\ref{sec:classification}      our\nclassification criteria.  In Section~\\ref{sec:spectroscopic_binaries},\nwe describe  the analysis of a sample   of spectroscopic binaries.  In\nSec.~\\ref{sec:comparison}, we compare   our  results  with  the  ones\nobtained during  previous surveys.  In  Section~\\ref{sec:simulations},\nwe  calculate  the     survey   detection  efficiency.    Finally   in\nSection~\\ref{sec:conclusions}, we summarize and conclude.\n\n\n\n\n\n\n\n\n\\section{Observations}\n\\label{sec:observations}\n\nThe observations described in this work have been acquired with FLAMES\n(Pasquini  et  al.   2002)  and   HARPS  (Mayor,  M.   et  al.   2003)\nspectrographs.  FLAMES  is  the  multi-object, intermediate  and  high\nresolution  spectrograph  of the  VLT  installed  at  the UT2  (Kueyen\ntelescope), in Paranal, Chile.  FLAMES  is a complex system that feeds\ntwo different  spectrographs, UVES  and GIRAFFE.  While  UVES provides\nthe  maximum resolution  (R =  47  000), but  can access  up to  eight\ntargets at  a time, GIRAFFE has an  intermediate resolution permitting\nto target up  to 132 objects at the time  or to perform integral\nfield  spectroscopy.   FLAMES  data  were obtained  in  two  different\nobserving  seasons  between  April-  July, 2004  and  March-July  2005\nrespectively.  For UVES we used  the standard setup centered at 580nm.\nFor  GIRAFFE we used  different high  resolution settings:  HR8, HR9B,\nHR11, HR12,  HR13, HR14A, HR14B overall covering  the wavelength range\nbetween 491.7nm and 670.1 nm  with a resolution in between R=17740 and\nR=28800.  In total 79 epochs were acquired obtaining 6558 spectra (553\nwith UVES and 5955 with GIRAFFE) corresponding to 317 stars.  In order\nto allow  high accuracy in  the radial velocity measurements  for both\nspectrographs  simultaneous  Th-Ar  lamps observations  were  acquired\ntogether with the  scientific targets.  However, for 21  out of the 79\nGIRAFFE plates  no simultaneous  calibrations were acquired.   For the\nrest of the  plates 5 fibers were allocated  to the calibration lamps,\nwhile  for  UVES 1  fiber  was  always  allocated to  the  simutaneous\ncalibration  lamp.   For   both  spectrographs  no  fibers  were\n  allocated to the sky.\n\nHARPS is the High Accuracy  Radial velocity Planet Searcher at the ESO\nLa  Silla 3.6m  telescope. We  used the  High Efficiency  mode (EGGS).\nHARPS  data   have  been  obtained  between  28-30   May,  2011.   The\nobservations were  much more limited  with respect to the  FLAMES runs\nand in  general obtained under  non optimal conditions. We  observed a\ntotal of 7 stars and a maximum of 5 epochs per object, resulting in 20\nmeasurements.  \nThese targets were  selected among the  sample of\nstars earlier observed with UVES/GIRAFFE with the purpose to follow-up\npotential planetary candidates. The early analysis of the UVES/GIRAFFE\ndata relied  upon  strong\nassumptions on the precision of the measurements, which was claimed at\nthe level of 40-50 m/s.  Furthermore, such  analysis neglected\nthe  presence  of potential  and  very  poorly  understood sources  of\nsystematics  that   could  have   compromised  the  accuracy   of  the\nmeasurements. In  this work, we  will study in detail  this problem,\npresenting for the first time a complete and troughout analysis of the \nentire dataset. \n\n\n\\noindent\nTable~\\ref{tab:observations} offers  an overview of  all the observing\nruns.\n\n\\section{Data analysis}\n\\label{sec:reduction}\n\nUVES  data were  reduced using  the  REFLEX (Freudling  et al.   2013)\nUVES-FIBER workflow.   GIRAFFE data  were reduced using  GASGANO.  For\nHARPS data we retrieved from the ESO archive the Science Data Products\nvia     the     Phase      3     spectral     query     \nform\\footnote{http://archive.eso.org/wdb/wdb/adp/\\\\phase3\\_spectral/form?phase3\\_collection=HARPS}.\n\n\\noindent\nAfter  the  data reduction  step  we  cross-correlate  all the  FLAMES\nspectra  with a  reference  spectrum.  Because  all  of the  monitored\nobjects were located on the upper main sequence of the CMD (see below)\nwe adopted a solar spectrum as  a template.  In particular we used the\natlas                  of                 FLAMES                 solar\nspectra\\footnote{http://www.eso.org/observing/dfo/quality/GIRAFFE/\\\\pipeline/solar.html}.\nThis  set of  measurements completely  covers all  high-resolution and\nlow-resolution settings of  the FLAMES fiber system.  We  took care to\nselect the spectra corresponding to our scientific setups as described\nin the previus Section.  For each given instrument and setting we also\nconstruct a  model for the  telluric contamination.  This was  done by\nusing the  ESO sky  correction tools and  in particular the  Sky Model\nCalculator\\footnote{http://www.eso.org/observing/etc/bin/gen/\\\\form?INS.MODE=swspectr+INS.NAME=SKYCALC}.\nThe model  spectra were  analyzed and the  regions with  the strongest\ncontamination were  then excluded from  the analysis of  the scientific\nspectra.   For the  cross-correlation  analysis we  developed our  own\ntools.   First an  accurate model  of  the continuum  was created,  by\naveraging   the   spectra   in   20  spectral   subregions,   strongly\ndownweighting  absorption and  emission features.   Then  a five-order\npolynomial was fit  and used to normalize the  spectrum. We calculated\nthe  cross-correlation   in  between  -200   km$\\rm\\,s^{-1}$  and  200\nkm$\\rm\\,s^{-1}$ in steps of  1 km$\\rm\\,s^{-1}$.  The centroid position\nwas calculated adopting a gaussian  function using the upper 30$\\%$ of\nthe  CCF  measured from  the  peak.  From  the  CCF  function we  also\ncalculated the  bisector as described  in Queloz et al.   (2001).  The\nobtained  radial  velocities  were   corrected  to  put  them  in  the\nheliocentric  reference system  and the  heliocentric julian  dates at\nmid-exposure were  calculated with the  task $rvcorrect$ of  IRAF.  We\nthen applied a quality cut, dropping from the list of measurements all\nthose  for  which  the CCF  peak  was  found  lower  than 0.3  or  the\nassociated   error  in  the   radial  velocity   was  larger   than  5\nkm$\\rm\\,s^{-1}$ or for which the  resulting spectra had a very low S/N\n(tipically  lower than  3).  A  sample of  5334 GIRAFFE  and  445 UVES\nmeasurements  remained  after these  steps  corresponding  to a  total\nnumber of 313 stars.  All the stars monitored with UVES were monitored\nalso with GIRAFFE.  The median  number of measurements per star in the\nfinal catalog is equal to 15. Fig.\\ref{fig:sn}, presents the S/N\nof the spectra. The S/N was calculated with the DER\\_SNR algorithm\npresented in Stoehr et al. (2008). Using the ESO exposure time calculator\nwe found a reasonable agreement between the observed S/N and the expected one.\n\n\n\n\\subsection{Systematics analysis}\n\n\\subsubsection{GIRAFFE}\n\n\\noindent\nBefore  merging the  datasets we  checked and  correct  for systematic\neffects. First we analyzed the  GIRAFFE dataset.  We selected a sample\nof reference  stars.  To do that  we imposed an RMS  treshold limit in\nradial  velocity  RMS$<1$  km$\\rm\\,s^{-1}$.   We further  limited  the\nsample to only stars with at least 10 measurements resulting in a list\nof 161 stars.   We checked then for plate to  plate zero point offsets\nin  radial  velocities as  illustrated  in Fig.\\ref{fig:offsets}  (top\npanel).   This   Figure  represents  the   average  subtracted  radial\nvelocities (RVs) for all  reference star GIRAFFE measurements, plotted\nas  a function of  the plate  number.  A  clear pattern  of systematic\nvariations is present which amounts to maximum shifts of up to $\\sim$1\nkm $\\rm s^{-1}$.   To correct for this effect,  we calculated a robust\naverage of the  residual RVs for each plate  and subtracted this value\nfor     all     the     measurements     of    that     plate.      In\nFig.\\ref{fig:epoch_zpoints_giraffe_uves}  (left  panel)  we  show  the\nhistograms  of the  residuals  RVs. We fit a Gaussian function to\nthese distributions to judge the improvement of the residual scatter\nduring the different steps of post-processing.  \nIn the  top  panel the  observed\nresiduals (before  any correction) are  visible.  The dispersion  \nof the best-fit Gaussian is equal to 631 m s$^{-1}$. In the second  \npanel from the\ntop the  effect of the plate  to plate correction is  visible.  Such a\ncorrection substantially improve the precision of the measurements \nbringing the dispersion to 212 m  s$^{-1}$ and it is therefore of paramount\nimportance. The fiber  system, however, may be subjected  also to more\nsubtle mechanical  drifts which  may depend on  a variety  of factors.\nSuch systematic drifts may in turn induce intra-plate systematics.  To\ncheck for  that we decorrelate  the radial velocity  residuals against\nthe fiber positioning  number. The result of this  correction is shown\nin      the      third       panel      from      the      top      in\nFig.\\ref{fig:epoch_zpoints_giraffe_uves}.  The corresponding dispersion\nimproved further being equal to 197 m s$^{-1}$  after  this   \ncorrection  demostrating   that  intra-plate\nsystematics  are indeed  present, albeit  their magnitude  seem  to be\nsmaller than the plate to  plate systematics.  It is possible that the\nresulting  radial  velocities  are   affected  also  by    variable\nobserving conditions during  each night.  We checked for  this effect by\nregrouping all measurements  as a function of the  observing night and\ndecorrelating  the  residuals  against  airmass (calculated  for  each\nstar), color (derived from our  catalog) and allowing for a systematic\nzero  point offset.  No   improvement  is observed  in this\ncase (the dispersion is equal\nto 199 m s$^{-1}$).  We decided in any case to apply this\nepoch-to-epoch correction  to the  GIRAFFE data. \nThe distributions in Fig.\\ref{fig:epoch_zpoints_giraffe_uves} appear close\nto Gaussian. The distribution of the $observed$ residuals\nin the top panel appears slightly asymmetric.\n\nBecause the\nGIRAFFE measurements  have been acquired  with 7 different  setups, we\nchecked  also for  the  presence of  setup-dependent systematics.   In\nFig.\\ref{fig:res_filter_giraffe}, we regrouped all the residual radial\nvelocities as a  function of the used setting.   No significant offset\nis observed after the correction steps reported above. However, we did\nnote the fact  that the different setups do not  appear to achieve the\nsame  performances. The  setting HR09B  delivered the  highest precision\n(155 m$\\rm\\,s^{-1}$ as measured from  the RMS of the residuals), while\nHR12 was  found the lowest  performant (287 m$\\rm\\,s^{-1}$).   This is\nlikely  due to  the strongest  telluric contamination  present  in the\nspectral window  of this setting.  It appears therefore that  beyond the\nsystematics discussed  above, the choice of the  instrumental setup is\nof great importance to achieve the highest radial velocity precisions.\n\n  \nThe  internal error  of  the  individual  measurements has  been\ninitially assigned  by our  Gaussian fitting algorithm  once performing\nthe CCF analysis, being the error of the centroid position obtained by\nthe   Levemberg-Marquardt  algorithm.    After   the  correction   for\nsystematics  we then calculated  the ratio  of the  median RMS  to the\nmedian internal error for UVES and GIRAFFE separately.  The individual\nerrors were then  multiplied by this factor.  This  approach allows to\nmatch  the  average  error  levels  based on  the  RMS  analysis,  but\npreserves the relative errors among different measurements.  \n\n\\noindent\nIt is interesting to compare  the results obtained by using the plates\nwhich  were  observed  with   simultaneous  calibrators  or  not.   In\nparticular the plates without calibrators were those obtained with the\nHR14B setting.   A look at  Fig.\\ref{fig:res_filter_giraffe} indicates\nthat the final RMS obtained for  this setting is in general not worser\nthe  one  obtained with  other  settings.   By  comparing instead  the\ndistribution  of the observed  residuals (without  any post-correction\napplied, therefore  the result of  the pipeline) we obtained  for this\nsetting a  dispersion equal to 690  m s$^{-1}$, worser than  the 631 m\ns$^{-1}$ quoted  above for the  entire sample.  Using only  the plates\nwith calibrators we obtain 632 m  s$^{-1}$, very close to the value of\nthe entire  sample, because plates with calibrators  are dominant.  It\nresults therefore that the correction applied by the pipeline based on\nthe  simultaneous  calibrators  does  not  improve  substantially  the\nprecision,  especially in  comparison with  the final  values  that we\nobtained by means  of our analysis.  In a recent  work Malavota et al.\n(2015) illustrated  that the  wavelength calibration  solution  may be\ninaccurate  in the  first  place due  to  the presence  of non  linear\ndistorsion  terms  between  the  wavelength solution  of  the  morning\ncalibration  and  the  simultaneous  calibrations. This  in  turn  can\nproduce artificial zero points offsets.   It may be also possible that\nthe  simultaneous calibrators  are not  tracking perfectly  the radial\nvelocity zero  points offsets  due to the  presence of  a differential\noffset between  the calibrators and the  scientific fibers. Inaccurate\nfiber  scrambling could be  a possible  reason.  If  the light  is not\nuniformly spread across the fiber, spurious radial velocity variations\ncan  be produced,  as  a  consequence of  thermal,  pressure or  other\nenvironmental variables (e. g. seeing) variations.  Our analysis seems\nto indicate that the plate-to-plate systematics are the most prominent\nsources of noise.  \n\n\\subsubsection{UVES}\n\n\\noindent\nThe FLAMES-UVES detector is the  mosaic of two different CCDs covering\nthe bluer and redder portion of  the spectral range of this setup. The\npipeline provides an output for each  one of them and we analyzed them\nindependently. In the following we will indicate them as the lower (L)\nand  upper (U)  UVES spectra.   The  average value  of the  systematic\ncorrected  GIRAFFE measurements  was  adopted as  the radial  velocity\nreference  system to  correct the  UVES measurements.   With  a median\nvalue  of 15  measurements per  star with  an RMS  down to  around 200\nm$\\rm\\,s^{-1}$, and  an overlap of  3-4 references per UVES  plate the\nprecision of such  a reference system can be expected  at the level of\n20    m$\\rm\\,s^{-1}$.     Fig.\\ref{fig:offsets},    illustrates    the\nplate-to-plate systematics  of the  UVES spectrograph with  respect to\nsuch  a reference  system.  Once  compared with  the  GIRAFFE observed\nresiduals (illustrated in the same figure) it appears that the the two\nspectrographs  did not follow  the same  pattern of  systematics.  The\nupper and  lower UVES spectra delivered instead  very similar results.\nImportantly, we can clearly see  the presence of an offset between the\nradial velocity  scale of  the two spectrographs.   \nWe selected\nthen the stars  in common between the UVES  and GIRAFFE datasets which\nwere considered GIRAFFE reference  stars (as defined above) and having\nalso at least  5 UVES measurements. By using this  sample (in total 34\nstars)  we  calculated, for  each  star,  the  difference between  the\naverage radial velocity calculated using only GIRAFFE measurements and\nonly  UVES  measurements (this  time  considered in the UVES  reference\nsystem).  \n\nThe histogram of these differences are illustrated in the\nbottom panels  of  Fig.\\ref{fig:offsets}.   Both the upper  and lower\nspectra  of UVES  deliver  offset radial  velocities  with respect  to\nGIRAFFE.  The average offset is found equal to:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\rm \\overline{RV}_{UVES}-\\rm \\overline{RV}_{GIRAFFE}=(-0.87\\pm0.15)\\rm\\,km\\,\\rm s^{-1}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\rm\\overline{RV}_{UVES}-\\rm\\overline{RV}_{GIRAFFE}=(-0.87\\pm 0.15)\\rm\\,km\\,\\rm&#10;s%&#10;^{-1}.\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>RV</mi><mo>¯</mo></mover><mi>UVES</mi></msub><mo>-</mo><msub><mover accent=\"true\"><mi>RV</mi><mo>¯</mo></mover><mi>GIRAFFE</mi></msub></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo>-</mo><mn>0.87</mn></mrow><mo>±</mo><mn>0.15</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>km</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02256.tex", "nexttext": "\n\n\\noindent\nwhere the  error quoted  is the error  of the  mean. The RMS  was $\\rm\n\\sigma_{cl}$=1.05 km $\\rm s^{-1}$.  To obtain this result we used 1531\nindividual measurements.\n\n\\noindent\nWe proceeded as follows to  classify all our stars into likely cluster\nmembers  and likely field  stars. Cluster  members were  identified as\nstars which  proper motion probability was  satisfying the constraints\nreported  above  and which  average  radial  velocity  was in  between\n$\\pm$3$\\rm \\sigma_{cl}$ from the cluster mean average velocity\n\\footnote{Note  that for stars  for which  we were  able to  derive an\n  orbital solution  the systemic  velocity was considered  rather than\n  the average velocity}. In absence  of proper motions (or in the case\nproper motions  were considered doubtful)  we considered as  bona fide\nmembers those stars satisfying only the radial velocity criterium. The\ntotal sample of cluster stars is  equal to 192 stars, 25 of which were\nflagged  out as  variables. Consequently,  the sample  of  field stars\ncontains 121  stars, 20 of which  are variables. On the  basis of this\nclassification we  obtain an observed frequency of  variables equal to\n13$\\%$ for  the cluster, and equal  to 17$\\%$ for the  field.  We also\nobtain  that the overall  field contamination  is around  38$\\%$. Some\ncaveats should be kept in mind however. Among all cluster members only\n59  satisfy the  stringent constraints  on proper  motions  and radial\nvelocity,    the   remaining   ones    are   only    radial   velocity\nmembers. Therefore a certain  field contamination can be expected from\nfield    stars    sharing     the    same    velocity    of    cluster\nmembers. Equivalently, among field  variables some fail to satisfy the\nradial    velocity   criterium   but    have   high    proper   motion\nprobabilities. Since they are variables, their average radial velocity\nis   not   necessarily   coincident   with  the   systemic   velocity.\nFigure~\\ref{fig:MEMBERS}  and  Figure~\\ref{fig:FIELD}  show the  color\nmagnitude diagrams  for cluster and  field stars respectively.  In the\nbackground  we displayed also  proper motion  likely members  from our\ncatalog in  the first case and  all other objects in  the second. From\nthese figures it is clear that  field stars are much more dispersed in\nthe CMD, and that cluster  members closely follow the main sequence of\nthe cluster. Blue  and green dots have the  same meaning than previous\nfigures, denoting  respectively RMS and GLS variables.   Red open dots\ndenote constant stars.\n\nTable~\\ref{tab:cluster_variables}  and Table~\\ref{tab:field_variables}  \nshow the complete list of variables along with their basic parameters.\n\n\\section{Analysis of periodic variables}\n\\label{sec:spectroscopic_binaries}\n\nFor six variables  we were able to derive  an orbital solution.  The\nperiod was fixed to the GLS  period corresponding to the peak with the\nstrongest power.  We modeled the Keplerian motion as:\n\n\n", "itemtype": "equation", "pos": 32717, "prevtext": "\n\n\\noindent\nSubsequently  we  compared  the  radial  velocity  scale  of  the  two\nspectrographs  with the  one  of HARPS  (for  the stars  in common  as\nreported below),  and we concluded  that the measurements  in the\nreference system of  GIRAFFE are in the  reference system of HARPS\nwith no noticable offset.\n\n\\noindent\nFig.\\ref{fig:epoch_zpoints_giraffe_uves} reports  the results obtained\napplying the plate-to-plate correction  to UVES data (middle and right\npanels).  Also  in this case  we observe a substantial  improvement of\nthe precision.  The dispersion of the best  Gaussian fit to the\nobserved distribution is  in this case 598 m  s$^{-1}$ (average of the\nupper  and  lower  UVES   spectra),  while  after  the  plate-to-plate\ncorrection the dispersion is equal to 156 m s$^{-1}$.   Thanks to the\nadoption of  the GIRAFFE reference system  we were then  able to check\nalso  for  intra-plate  systematics   for  UVES.   Note  that  such  a\ncorrection is  not possible using only the  simultaneous fibers, given\nthat only one simultaneous fiber per plate is allowed for UVES.  \nThe adoption of this correction improved further the dispersion (119 m\ns$^{-1}$)   although  we   note  that   the   corresponding  residuals\ndistribution presents evident  non-Gaussian tails.  Likely \nintra-plate  systematics are present although  the smaller number\nof stars used for the correction  may not be able to perfectly capture\nthe  systematic  trend.  .  We  proceeded  further  and analyzed  the\nepoch-to-epoch UVES systematics,  decorellating all residuals acquired\nduring the  same observing night as  a function of  color, airmass and\nallowing for the presence of a zero point offset.  In this case such a\ncorrection  appears to  deteriorate (127  m s$^{-1}$)  the\nprecisions, and we therefore did not apply it.\n\n\\noindent\nAfter the  above reported correction  steps, the upper and  lower UVES\nspectra  were merged, and  the results  finally merged  to the  one of\nGIRAFFE to produce a single  combined catalog. For what has been said,\nthe radial velocity scale of this  catalog is the one of GIRAFFE (that\nis  the one  of HARPS,  see below).   The GIRAFFE  and combined\ncatalogs contain 313  stars in total, while the  UVES catalog contains\n75 stars.  The total number of stars with at least two measurements is\nequal to  300 stars for  GIRAFFE (and combined catalog) and 67  stars \nfor UVES.\n\n\\noindent\nFig.\\ref{fig:rms_hist} shows  the final RMS obtained  for the GIRAFFE,\nUVES  and combined  sample for  all the  stars \nhaving  at  least two\nmeasurements  respectively and with RMS<1 km$\\rm s^{-1}$\n(250 stars for GIRAFFE and combined catalogs and 61 stars for UVES catalog).  \n\nThe median  precision (denoted by the vertical dashed lines \nin Fig.\\ref{fig:rms_hist}) \nof GIRAFFE is  240 m $\\rm  s^{-1}$ while  the one of  UVES is 180  m $\\rm\ns^{-1}$.  The combined sample median RMS (250 m $\\rm s^{-1}$) reflects\nthe GIRAFFE sample  RMS due to the much  larger number of measurements\nacquired   with   GIRAFFE.    Fig.\\ref{fig:rv_hist},  represents   the\nhistogram  of  all  the  radial  velocity measurements  in  the  final\ncatalog.  The peak due to cluster members is clearly visible.\n\n\\subsubsection{HARPS}\n\n\\noindent\nThe HARPS  radial velocities measurements were  obtained directly from\nthe header of the pipeline processed files, and no post-correction was\napplied.  This  sample is composed by a  set of 7 stars  that were all\nincluded  in the  UVES-GIRAFFE dataset  observed in  2004-2005.  While\nfour of  these objects appeared  possible planetary candidates  at the\ntime of  the follow-up, the  HARPS observations have dismissed  all of\nthem as false positives.\n\n\\noindent\nOn the contrary, we note that the transiting planetary candidate (star\n171895) we found  in our previous photometric  campaigns, described in\nM11,  has not  been targeted  with HARPS  and it  remains  therefore a\nprimary target for future observational efforts.\n\n\\noindent\nTo estimate the average precision  obtained by HARPS on this sample of\nstars we subtracted the mean radial velocity and calculated the RMS of\nall  combined residuals.  In this  way  we obtained  a value  of 35  m\n$\\rm\\,s^{-1}$.\n\n\\noindent\nBy comparing the average velocity obtained with GIRAFFE and with HARPS\nfor  these stars  we obtained  an average  difference between  the two\nspectrographs radial velocity scale equal to (-0.094$\\pm$0.091) km$\\rm\n\\,s^{-1}$, which demonstrates that  the radial velocity scale of GIRAFFE\nis consistent with the one of HARPS.\n\n\n\n\\section{Search for variables}\n\\label{sec:search}\n\nFigure~\\ref{fig:RMS} shows  the RMS  distribution for all  the catalog\nstars.  We adopted a magnitude dependent treshold for the detection of\nvariables  as visible in  Fig.~\\ref{fig:RMS_CLOSE}. This  RMS treshold\n($\\rm \\sigma_{ref}$) was calculated by medianing the RMS values of the\nstars  found  in 0.2  mag  bins  and fitting  a  linear  model to  the\nresulting median  values.  We  adopted a 5$\\rm  \\sigma_{ref}$ treshold\ndenoted  by the  dotted  line  in the  above  mentioned Figures.   All\nobjects beyond  this treshold were considered  bona-fide variables and\nare denoted in particular by the blue dots.\n\n\\noindent\nWe also searched for periodic variables given the extent of our survey\nand  the fact  that many  objects  have multiple  measurements in  our\ncatalog.   In particular we  limited the  search for  periodicities to\nstars with at  least 10 epochs.  We used  the Generalized Lomb Scargle\n(GLS) algorithm  of Zechmeister \\& K\\=urster (2009)  and in particular\ntheir  Eq.~5.  This algorithm  allows to  fit a  sinusoid to  the data\ntogether  with  a constant  offset.   To  properly  set the  detection\ntreshold  of  the  GLS  we  constructed  a  mock  sample  of  constant\nartificial  radial velocities.   The measurements  for each  star were\nsimulated assuming  a gaussian noise  with a dispersion equal  to $\\rm\n\\sigma_{ref}$.  We  considered the true distribution of  epochs of our\nstars,  each simulated  star  being a  constant  mock copy  of a  real\nobserved one. We created around 10$^5$ simulated stars and applied the\nGLS  to all  of them.   We searched  for periodic  signals considering\nperiods  in between  0.5 and  1000 days  subdividing this  interval in\n10000  equal frequency  steps.  From  the distribution  of  GLS powers\n($\\rm  p_{GLS}$) we  obtained, we  imposed a  False  Alarm Probability\n(FAP) treshold equal to 0.1$\\%$, which was found equal to $\\rm p_{GLS,\n  FAP}=0.956$.\n\n\\noindent\nIn the  exactly same way we  applied the GLS to  all real measurements\nflagging  out all  objects having  $\\rm p_{GLS}\\,>\\,p_{GLS,  FAP}$. We\nfound  that this  condition  was  met for  28  objects. We  considered\nhowever  as reliable  GLS variables  only those  for which  an orbital\nsolution      could      be       found      as      described      in\nSect.~\\ref{sec:spectroscopic_binaries}.  Most  of  the  GLS  solutions\nimplied long  term trends or  in any case  the phase coverage  was not\nconsidered  sufficient to perform  a fit.   All  of these\nobjects lie  beyond the  5$\\rm\\sigma_{ref}$ treshold and  are therefore\nalso RMS variables. \n\nThe final list of reliable  GLS variables contains 6 objects which are\ndenoted    by   the   green    dots   in    Figure~\\ref{fig:RMS}   and\nFigure~\\ref{fig:RMS_CLOSE}.  The  total list of  variables contains 45\nstars.\n\n\n\n\n\n\n\n\\section{Classification of the stars}\n\\label{sec:classification}\n\nWe  proceeded  by  calculating  the  average radial  velocity  of  the\ncluster.   To do  that we  used both  the proper  motion probabilities\nderived in M09 and the  radial velocities calculated in this work.  We\nfirst considered those objects  for which the proper motion membership\nprobability was  larger than 90$\\%$  at magnitude $V=$12.5  and larger\nthan 50$\\%$ at $V=18$,  interpolating linearly between these extremes.\nFurthermore, we impose  that the corresponding x and  y coordinates of\nthese   stars  should   have  been   contained   within  $800<x<1300$,\n$1000<y<3000$  in the  reference system  of  CCD51 of  the Wide  Field\nImager detector  where the cluster  was located in M09.   Beyond these\nlimits  we  considered our  proper  motions  doubtful  as reported  in\nearlier works.   These tresholds are the  same adopted in  the past to\nisolate cluster  members.  We  also limited the  sample to  stars that\nwere  not  flagged  out  as  variables  accordingly  to  the  analysis\nperformed in the  previous Section. In this way  we identify 66 stars.\nThe  average  cluster  radial  velocity  $\\rm  \\overline{RV}_{cl}$  we\nobtained is\n\n\n", "index": 3, "text": "\\begin{equation}\n\\rm \\overline{RV}_{cl}=(-28.81\\pm0.003)\\,km\\,\\rm s^{-1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\rm\\overline{RV}_{cl}=(-28.81\\pm 0.003)\\,km\\,\\rm s^{-1}\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>RV</mi><mo>¯</mo></mover><mi>cl</mi></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo>-</mo><mn>28.81</mn></mrow><mo>±</mo><mn>0.003</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>km</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02256.tex", "nexttext": "\n\n\\noindent\nwhere $\\tilde{K}$  is the  radial velocity semi-amplitude  without the\ncontribution of the eccentricity  $e$, $k=e\\,\\cos \\omega $, $h=e\\,\\sin\n\\omega   $,  $\\gamma$   is   the  barycentric   radial  velocity   and\n$u=\\nu+\\omega$ is  the true argument  of latitude with $\\nu$  the true\nanomaly and $\\omega$ the argument of the pericenter.\n\n\\noindent\nWe considered as  free parameters: $\\tilde{K}$, $h$, $k$,  the time of\nmaximum  radial velocity  ($t_{MAX}$) and  $\\gamma$.   The convergence\ntoward   the  best-fit   solution   was  obtained   by   means  of   a\nLevenberg-Marquardt algorithm (Press  1992), and the uncertainties and\nthe best fit values of the parameters by means of a Markov Chain Monte\nCarlo analysis.  For  each radial velocity curve we  created 20 chains\nof 10$^{5}$ steps.  Each chain is started from a point 5-$\\sigma$ away\n(in  one  randomly  selected  free parameter)  from  the  best-fitting\nsolution   obtained  by   the   Levenberg-Marquardt  algorithm.    The\n$\\chi^2_{\\rm old}$ of the fit of this initial solution is recorded and\ncompared  with  the  $\\chi^2_{\\rm  new}$  obtained  in  the  following\nstep. The following step is obtained jumping from the initial position\nto  another  one  in  the multidimensional  parameter  space  randomly\nselecting  one of the  free parameters  and changing  its value  by an\narbitrary  amount  which is  dependent  on  a  jump constant  and  the\nuncertainty $\\sigma$  of the parameter itself.  Steps  are accepted or\nrejected  accordingly   to  the  Metropolis-Hastings   criterium.   If\n$\\chi^2_{\\rm  new}$  is lower  than  $\\chi^2_{\\rm  old}$  the step  is\nexecuted,      otherwise     the     execution      probability     is\n$P=e^{-\\Delta\\chi^2/2}$         where        $\\Delta\\chi^2=\\chi^2_{\\rm\n  new}-\\chi^2_{\\rm old}$.   In this  latter situation a  random number\nbetween 0 and 1 is  drawn from a uniform probability distribution.  If\nthis number is lower than $P$ then the step is executed, otherwise the\nstep  is rejected and  the previous  step is  repeated instead  in the\nchain.  In  any case  the value of  the $\\chi^2$  of the last  step is\nrecorded and compared with the one of the following step up to the end\nof the chain.  We adjusted the jump constants (one for each parameter)\nin such a way that the step acceptance rate for all the parameters was\naround 25 per  cent.  We then excluded the first 20  per cent steps of\neach chain to avoid the  initial burn-in phase, and for each parameter\nwe merged the remaining part  of the chains together.  Then we derived\nthe  mode  of the  resulting  distributions,  and  the 68.3  per  cent\nconfidence limits  defined by the 15.85th and  the 84.15th percentiles\nin the cumulative distributions.\n\n\\noindent\nThe radial velocity measurements  after subtraction of the barycentric\nvelocities, along  with the best  fit model, bisector diagram  and the\nperiodogram                 are                shown                in\nFig.~\\ref{fig:v21659}-Fig.~\\ref{fig:v478}.       Our      best-fit\nparameters  are given  in  Table~\\ref{tab:spectroscopic_binaries}. The\nbest-fit  models correspond to  values of  the reduced  $\\chi$ squared\nbetween $\\sqrt{\\chi_{r}^2}=0.8-2.5$. \n\n\\noindent\nThe bisector  error was  calculated from  the dispersion  of the\ndistribution  of  bisector values  of  all  the  spectra, and  assumed\nidentical  for all  stars.  We  also checked  for  linear correlations\nbetween the bisector  and radial velocity measurements calculating\nthe Pearson correlation coefficient.  For the six cases considered the\ncoefficient is comprised in between  -0.47 and 0.56 which denoted that\nno strong correlations are found.  \n\n\\noindent\nFor those variables  that were considered cluster members  (4 out of 6\nas shown in Table~\\ref{tab:spectroscopic_binaries}) we also calculated\nthe  mass function and,  by assuming  for the  primary the  mass ($\\rm\nM_{*}$) obtained  by isochrone fit\\footnote{We considered  the 3.5 Gyr\n  isochrone   that   was   discussed    in   M09.}    we   report   in\nTable~\\ref{tab:spectroscopic_binaries}  a lower  limit on  the minimum\nmass of the companion which is given by the following equation\n\n\n", "itemtype": "equation", "pos": 35770, "prevtext": "\n\n\\noindent\nwhere the  error quoted  is the error  of the  mean. The RMS  was $\\rm\n\\sigma_{cl}$=1.05 km $\\rm s^{-1}$.  To obtain this result we used 1531\nindividual measurements.\n\n\\noindent\nWe proceeded as follows to  classify all our stars into likely cluster\nmembers  and likely field  stars. Cluster  members were  identified as\nstars which  proper motion probability was  satisfying the constraints\nreported  above  and which  average  radial  velocity  was in  between\n$\\pm$3$\\rm \\sigma_{cl}$ from the cluster mean average velocity\n\\footnote{Note  that for stars  for which  we were  able to  derive an\n  orbital solution  the systemic  velocity was considered  rather than\n  the average velocity}. In absence  of proper motions (or in the case\nproper motions  were considered doubtful)  we considered as  bona fide\nmembers those stars satisfying only the radial velocity criterium. The\ntotal sample of cluster stars is  equal to 192 stars, 25 of which were\nflagged  out as  variables. Consequently,  the sample  of  field stars\ncontains 121  stars, 20 of which  are variables. On the  basis of this\nclassification we  obtain an observed frequency of  variables equal to\n13$\\%$ for  the cluster, and equal  to 17$\\%$ for the  field.  We also\nobtain  that the overall  field contamination  is around  38$\\%$. Some\ncaveats should be kept in mind however. Among all cluster members only\n59  satisfy the  stringent constraints  on proper  motions  and radial\nvelocity,    the   remaining   ones    are   only    radial   velocity\nmembers. Therefore a certain  field contamination can be expected from\nfield    stars    sharing     the    same    velocity    of    cluster\nmembers. Equivalently, among field  variables some fail to satisfy the\nradial    velocity   criterium   but    have   high    proper   motion\nprobabilities. Since they are variables, their average radial velocity\nis   not   necessarily   coincident   with  the   systemic   velocity.\nFigure~\\ref{fig:MEMBERS}  and  Figure~\\ref{fig:FIELD}  show the  color\nmagnitude diagrams  for cluster and  field stars respectively.  In the\nbackground  we displayed also  proper motion  likely members  from our\ncatalog in  the first case and  all other objects in  the second. From\nthese figures it is clear that  field stars are much more dispersed in\nthe CMD, and that cluster  members closely follow the main sequence of\nthe cluster. Blue  and green dots have the  same meaning than previous\nfigures, denoting  respectively RMS and GLS variables.   Red open dots\ndenote constant stars.\n\nTable~\\ref{tab:cluster_variables}  and Table~\\ref{tab:field_variables}  \nshow the complete list of variables along with their basic parameters.\n\n\\section{Analysis of periodic variables}\n\\label{sec:spectroscopic_binaries}\n\nFor six variables  we were able to derive  an orbital solution.  The\nperiod was fixed to the GLS  period corresponding to the peak with the\nstrongest power.  We modeled the Keplerian motion as:\n\n\n", "index": 5, "text": "\\begin{equation}\n\\rm RV\\, = \\, \\tilde{K} \\frac{\\cos u +k}{\\sqrt{1-h^2-k^2}} + \\gamma \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\rm RV\\,=\\,\\tilde{K}\\frac{\\cos u+k}{\\sqrt{1-h^{2}-k^{2}}}+\\gamma\" display=\"block\"><mrow><mpadded width=\"+1.7pt\"><mi>RV</mi></mpadded><mo rspace=\"4.2pt\">=</mo><mrow><mrow><mover accent=\"true\"><mi mathvariant=\"normal\">K</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mfrac><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi mathvariant=\"normal\">u</mi></mrow><mo>+</mo><mi mathvariant=\"normal\">k</mi></mrow><msqrt><mrow><mn>1</mn><mo>-</mo><msup><mi mathvariant=\"normal\">h</mi><mn>2</mn></msup><mo>-</mo><msup><mi mathvariant=\"normal\">k</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mrow><mo>+</mo><mi>γ</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02256.tex", "nexttext": "\n\n\\noindent\nthe  value given by  the expression  on the  right represents  a lower\nlimit on  the minimum mass because  we neglected the term  on the mass\nratio $\\rm  q=m/M_{*}$, which contributes as $\\rm  (1+q)^{2/3}$ to the\nnumerator of  the term on  the right.  The  values we obtained  are in\nbetween $\\sim$90  $\\rm M_{J}$ and $\\sim$460 $\\rm  M_{J}$.  The periods\ninstead are in between $\\sim$3  days and $\\sim$220 days.  We note that\nthe  attribution of  the  exact  period is  still  ambiguous for  some\nobjects. Among  this sample of  objects star 478  seems to have  a non\nnegligible eccentricity e=(0.16$\\pm$0.03).  For star 29531 instead the\n$\\chi_r$ of  the fit is  2.5 and this  may suggest the presence  of an\nadditional companion.\n\n\n\n\n\\section{Comparison with previous surveys}\n\\label{sec:comparison}\n\nSo far four main surveys have been performed toward NGC~6253 to search\nfor variables. As reported in the introduciton De Marchi et al.~(2010)\nand    Kaluzny    et     al.~(2014)    searched    for     photometric\nvariables. Anthony-Twarog  et al.~(2010) and   M11 searched for radial\nvelocity variables.\n\n\\noindent\nWe observed the  detached eclipsing binary V23 (39883  in our catalog)\nreported in  Kaluzny et  al.~(2014).  This object  is a  proper motion\nmember of NGC~6253 and sits close  to the turn-off. We obtained only 1\nmeasurement   on  it   which   gave  a   radial   velocity  equal   to\n(-52.96$\\pm$0.18) km$\\rm\\,s^{-1}$.\n\n\\noindent\nThe star  16649 was classified in De  Marchi et al.  (2010)  as a long\nperiod variable, likely cluster member  and located at around 7 arcmin\nfrom the  cluster center. It  showed a photometric variability  at the\n1$\\%$ level.  This  object has been extensively observed  here.  A set\nof 32 measurements have been  acquired.  It results that star 16649 is\nalso   a   radial   velocity    variable   and   it   is   listed   in\nTable~\\ref{tab:cluster_variables} as a  likely cluster member variable.\nThe mean radial velocity is -28.446 km$\\rm\\,s^{-1}$ and the RMS is 7.7\nkm$\\rm\\,s^{-1}$.  Membership  is estabilished  solely on the  basis of\nradial  velocity.   The GLS  algorithm  flagged  out  this star  as  a\nvariable, but at the nominal period ($\\sim$63 days) it presents a very\npoor  phase coverage  and  no orbital  solution  was possible.   These\nobservations support the idea that this object is a long period binary\nsystem.  It  is curious  to note  that in fact,  this object  was also\nobserved  by  Anthony-Twarog et  al.~(2010)  during  the Hydra  radial\nvelocity   survey  on   NGC6253.  Also   in  that   case   star  16649\n(corresponding to  star 7592 in  their numeration) was found  a radial\nvelocity  variable star.  The  authors report  a mean  radial velocity\nequal to -27.38 km$\\rm\\,s^{-1}$ and an RMS equal to 10 km$\\rm\\,s^{-1}$\nmeasured out of a set of 3 measurements.\n\n\\noindent\nThe interesting star 55053 was  also listed in De Marchi et al.~(2010)\nas a  long period  variable, likely cluster  member. It is  located at\naround 5.2 arcmin from the cluster  center. In our study we obtained a\nset  of 15  radial velocity  measurements on  it.  Interestingly, this\nobject  is  not a  radial  velocity variable,  at  least  down to  0.4\nkm$\\,\\rm\\,s^{-1}$, the value  we calculated for the RMS.  In our study\nit  is   classified  as  a   radial  velocity  non   variable  cluster\nmember. Membership is estabilished on the basis of radial velocity\ngiven that the average velocity is -28.613 km$\\rm\\,s^{-1}$.\n\n\\noindent\nNo  matches  were  found  with  our previous  radial  velocity  survey\npresented  in Montalto  et  al.~(2011), because  there  we focused  on\nbrighter objects.   \n\n\\noindent\nThe overlap with the  Anthony-Twarog et al.~(2010)\nsurvey  is instead  substantial. We  counted a  total of  32  stars in\ncommon among the two surveys which gives us the opportunity to further\ncheck  for  long-term variability  for  these  objects. Comparing  our\nradial velocities with the ones of  the authors we found in general an\nexcellent agreement.   \n\n\\noindent\nStar  21659  is  an   interesting  variable  that  was  discovered  by\nAnthony-Twarog et al.~(2010). The authors  report an RMS equal to 19.5\nkm$\\,s^{-1}$ for this object (their  star 7495) and cosidered it among\ntheir list  of five likely cluster  variable stars. In  our study this\nobject was  classified as well as  a cluster variable.  In addition to\nthat it is among the list  of objects for which we derived the orbital\nsolution, as  reported in Table~\\ref{tab:spectroscopic_binaries}.  The\nradial  velocity  semi-amplitude   we  found  (41.8  km$\\rm\\,s^{-1}$)  is\nconsistent with the RMS reported by Anthony-Twarog et al.~(2010).\n\n\\noindent\nStar 8247  (7303 in  Anthony-Twarog et al.~2010)  was considered  as a\nlikely member cluster variable by  the authors which gave an RMS equal\nto  16.4  km$\\rm\\,s^{-1}$.   In  our  data this  object  is  instead  not\nvariable, but we  note that our mean radial  velocity differs from the\none of  the authors  by 13 km$\\rm\\,s^{-1}$.   This object is  likely a\nlong period cluster variable.\n\n\\noindent\nOn the contrary  star 7470 in Anthony-Twarog et  al.~(2010, which does\nnot have an  entry in our own  catalog), is in the list  of our likely\ncluster variables in  Table~\\ref{tab:cluster_variables}, having an RMS\nequal to  4.519 km$\\rm\\,s^{-1}$. Anthony-Twarog et  al.~(2010) did not\nconsider this  object as a  variable, but their  RMS is similar  to us\n(3.24  km$\\rm\\,s^{-1}$),  quite   larger  than  their  average  level,\nalthough probably at the limit of detectability.\n\n\n\n\n\\section{Discussion}\n\\label{sec:simulations}\n\n\\noindent\nThe survey  we presented in this  work is one of  the deepest searches\nfor binaries in an old open cluster ever performed so far. Milliman et\nal.~(2014),  based  on  their   on  going  long-term  radial  velocity\nmonitoring  of  the  old  open  cluster NGC~6819  concluded  that  the\nfraction of binaries with periods  less than 10$^{4}$ days is equal to\n22$\\,\\%\\,\\pm\\,$3$\\%$.  Our total frequency is lower as reported below,\nbut it is  also based on a 2 year survey  while Milliman et al.~(2014)\nare monitoring NGC~6819 since 17  years. Binaries surveys in the field\n(albeit  including a variety  of detection  methods) suggest  that the\ntotal  multiplicity  fraction  around  field stars  is  around  54$\\%$\n(e. g. Raghavan et al.~2010).\n\nTo understand our detection limits and binary fractions we performed a\nset    of   simulations.     Similarly   to    what   was    done   in\nSect.~\\ref{sec:search}, we  created a mock sample  of measurements for\neach    observed   star,   assuming    the   baseline    noise   level\n$\\rm\\sigma_{ref}$ and injecting an  artificial signal into the data to\nmimick the presence of a  companion star. We randomized both the phase\nand the inclination of the orbits  and considered 25 bins in true mass\n(between 20 and 500 $\\rm M_{J}$) and an orbital period equal either to\n10 days  or to 200  days. We therefore applied  the 5$\\rm\\sigma_{ref}$\ntreshold  calculating  the  detection  efficiency in  each  mass  bin.\nFigure~\\ref{fig:efficiency}, shows the detection efficiency curves for\nthe two periods considered as a function of the companion mass.  Those\ncurves are  essentially average efficiencies over the  whole sample of\nstars monitored. The simulations indicate that at a period of 10 days,\nobjects  with  masses down  to  $\\sim$30  M$\\rm_{J}$  could have  been\ndetected with  a $\\sim$50$\\%$ efficiency.  At  90$\\%$ confidence limit\nwe  expect   to  be   able  to  detect   stars  with  at   least  0.15\nM$\\rm_{\\odot}$.   \nConsidering  a  period of  200  days, a  50$\\%$\ndetection  efficiency corresponds to  $\\sim$0.1 M$\\rm_{\\odot}$,  and a\n90$\\%$ detection efficiency to $\\sim$0.4 M$\\rm_{\\odot}$.  \n\nLooking     at    the     results     we    obtained     in\nTab.~\\ref{tab:spectroscopic_binaries},  we  conclude that  essentially\nfor  all the  detected  objects, the  detection  efficiency should  be\nbeyond  80$\\%$. The  only exception  is star  30324 which  has  a long\nperiod (223  days) and  a low  minimum mass (92  M$_{\\rm J}$)  and may\nindeed lie  in a  $\\sim50\\%$ efficiency region.   If the true  mass of\nthis object is close to the  limit indicated by its minimum mass, this\nwould indicate that a correcting factor  at least equal to 2 should be\napplied  to  derive the  true  frequency  of  stars with  long  period\ncompanions. This  may also be supported  by the fact that  for most of\nthe  variable objects we  detected it  was not  possible to  derive an\norbital solution.\n\n\\noindent\nConsidering  therefore only  the  sample of  close-in cluster  members\nvariables for  which an orbital  solution was found, we  conclude that\nthe frequency of binaries down  to the hydrogen burning limit and with\nperiods up to $\\sim$20 days is around (1.5$\\pm$1.3)$\\%$, that is 3 out\n200 members, in  the upper main sequence of  NGC~6253, while the total\nbinary  frequency is equal  to (13$\\pm$3)$\\%$.   The  errors were\nobtained considering a binomial distribution.\n\n\\noindent\nComparatively, in  M11 we  obtained a frequency  of binaries  equal to\n(29$\\pm$9)$\\%$.   These  binaries   were  all   flagged  out   with  a\n5$\\rm\\sigma$ detection treshold like  in this work and were considered\nlikely short period binaries  given that the observations spanned only\na few  days.  The sample of  cluster stars (35) was  much smaller than\nthe one analyzed in this work which gives a larger uncertainty for the\nestimated frequency. Even accounting for that, it appears however that\nthe frequency  among evolved stars  is larger (at a  2-$\\sigma$ level)\nthan the total frequency of  binaries on the main sequence we obtained\nabove.  \n\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nWe described  an extensive radial  velocity survey toward the  old and\nmetal rich open cluster NGC~6253.  The survey was performed during two\nseasons between April 2004 and July 2005 using the FLAMES spectrograph\nmonitoring a  total number  of 317  stars with a  median number  of 15\nepochs per star.  A more limited follow up of  7 objects was performed\nwith the HARPS spectrograph in June 2011.\n\nWe obtained  a median  precision equal to  240 m$\\rm\\,s^{-1}$  for the\nGIRAFFE   spectrograph,   180   m$\\rm\\,s^{-1}$   for   UVES   and   35\nm$\\rm\\,s^{-1}$  for HARPS,  working in  a magnitude  range  in between\n14.8$<V<$16.5.   Among  the sample  of  monitored  stars,  59 are  now\nclassified as radial velocity and proper motion cluster members and do\nnot show any evidence  of variability.  Field contaminations was equal\nto 38$\\%$ of the total sample.\n\nIn total  we found  45 variable stars,  among which 25  are considered\ncluster members and 20 field objects.  For 6 spectroscopic binaries we\nobtained the orbital solution, which implied minimum masses in between\n$\\sim$90  M$\\rm_{J}$-$\\sim$460  M$\\rm_{J}$   and  orbital  periods  in\nbetween $\\sim$3 days and $\\sim$220 days.\n\nThe frequency of binaries down to the hydrogen burning limit and up to\n20 days  orbital period is  found equal to (1.5$\\pm$1.3)$\\%$.   in the\nupper main sequence  of NGC~6253, while the total  binary frequency is\nequal to (13$\\pm$3)$\\%$.\n\nThe precisions  achieved by the  HARPS spectrograph are  sufficient to\nfurther extend the exploration of the binary frequency well within the\nsubstellar domain, and  to analyze the high mass  end of the planetary\ndomain (down to 4-5  M$\\rm_J$).  The upcoming ESPRESSO spectrograph at\nVLT  will represent  an even  more  powerful tool  to study  planetary\nfrequencies   in  stellar   clusters.    A  precision   of  around   5\nm$\\rm\\,s^{-1}$  may be  expected with  similar exposure  times  on our\ntargets.  This  will push  further  our  exploration  well within  the\nplanetary domain, down to around half a jupiter mass.\n\n\n\n\\section*{acknowledgements}\nWe acknowledge  the support from  Funda\\c{c}\\~ao para a Ci\\^encia  e a\nTecnologia   (FCT,  Portugal)   in   the  form   of  grant   reference\nPTDC/FIS-AST/1526/2014.  MM acknowledges  the support from FCT through\nthe grant and SFRH/BDP/71230/2010.  This wark is based on observations\nmade with  ESO Telescopes  at the La  Silla Paranal  Observatory under\nprogramme  ID  073.C-0251,  075.C-0245   and  on  data  products  from\nobservations  made  with  ESO  Telescopes  at  the  La  Silla  Paranal\nObservatory under  programme ID  087.C-0497. The anonymous  referee is\nalso aknowledged for the useful comments and suggestions which help us\nto further improve this manuscript.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{99}\n\n\n\n\n\n\\bibitem[2007]{anthony07} Anthony-Twarog, B. J., Twarog, B. A. \\& Mayer L. 2007, AJ, 133, 1585\n\n\\bibitem[2010]{anthony10} Anthony-Twarog, B. J., Deliyannis, C. P., Twarog, B. A., Cummings, J. D., Maderak, R. M. 2010, AJ, 139, 2034\n\n\\bibitem[1997]{bragaglia97} Bragaglia, A., Tessicini, G., Tosi, M., Marconi, G., Munari, U. 1997, MNRAS, 284, 477 \n\n\\bibitem[2000]{carretta00} Carretta, E., Bragaglia, A., Tosi, M., Marconi, G. 2000, ASPC, 198, 273\n\n\\bibitem[2007]{carretta07} Carretta, E., Bragaglia, A. \\& Gratton, R. G. 2007, A\\&A, 473, 129\n\n\n\n\\bibitem[2012]{cummings12} Cummings, J. D., Deliyannis, C. P., Anthony-Twarog, B., Twarog, B., Maderak, R. M. 2012, AJ, 144, 137\n\n\\bibitem[2010]{demarchi10} De Marchi, F., Poretti, E., Montalto, M., Desidera, S., Piotto, G. 2010, A\\&A, 509, 17\n\n\\bibitem[2005]{fischer05} Fischer, D. A. \\& Valenti, J. 2005, ApJ, 622, 1102\n\n\\bibitem[2013]{freudling13} Freudling, W., Romaniello, M., Bramich, D. M., Ballester, P., Forchi, V., Garc\\'ia-Dabl\\'o, C. E., Moehler, S., Neeser, M. J. 2013, A\\&A, 559, 96\n\n\n\n\\bibitem[1997]{gonzalez97} Gonzalez, G. 1997, MNRAS, 285, 403\n\n\\bibitem[2014]{kaluzny14} Kaluzny, J., Rozyczka, M., Pych, W., Thompson, I. B. 2014, AcA, 64, 77\n\n\\bibitem[2003]{mayor03} Mayor, M., Pepe, F., Queloz, D., Bouchy, F., Rupprecht, G., Lo Curto, G., Avila, G., Benz, W. et al. 2003, The Messenger, 114, 20.\n\n\n\n\\bibitem[2015]{malavolta15} Malavolta, L., Piotto, G., Bedin, L. R., Sneden, C., Nascimbeni, V., Sommariva, V. 2015, MNRAS, 454, 2621\n\n\\bibitem[2012]{mikolaitis12} Mikolaitis, \\u S., Tautvai\\u sien\\.{e}, G., Gratton R., Bragaglia, A., Carretta, E. 2012, A\\&A, 541, 137\n\n\\bibitem[2014]{milliman14} Milliman, K. E., Mathieu, R. D., Geller, A. M., Gosnell, N. M., Meibom, S., Platais, I. 2014, AJ, 148, 38\n\n\\bibitem[2009]{montalto09} Montalto, M., Piotto G., Desidera, S., Platais, I., Carraro, G., Momany, Y., De Marchi, F., Recio-Blanco, A. 2009, A\\&A, 505, 1129, (M09)\n\n\\bibitem[2011]{montalto11} Montalto, M., Villanova, S., Koppenhoefer, J., Piotto, G., Desidera, S., De Marchi, F., Poretti, E., Bedin, L. R. et al. 2011, A\\&A, 535, 39, (M11) \n\n\\bibitem[2012]{montalto12} Montalto, M., Santos, N. C., Villanova, S., Pace, G., Piotto, G., Desidera, S., De Marchi, F., Pasquini, L. et al. 2012, MNRAS, 423, 3039\n\n\\bibitem[2012]{mortier12} Mortier, A., Santos, N. C., Sozzetti, A., Mayor, M. Latham, D., Bonfils, X., Udry, S. 2012, A\\&A, 543, 45\n\n\\bibitem[2002]{pasquini02} Pasquini, L., Avila, G., Blecha, A., Cacciari, C., Cayatte, V., Colless, M., Damiani, F., De Propris, R. et al. 2002, The Messenger, 110, 1.\n\n\\bibitem[1998]{piatti98} Piatti, A. E., Clari\\'a, J. J., Bica, E., Geisler, D., Minniti, D., 1998, AJ, 116, 801\n\n\\bibitem[1992]{press92} Press W. H., Teukolsky S. A., Vetterling W. T., Flannery B. P. 1992, Cambridge: University Press, $|$c1992, 2nd ed.\n\n\\bibitem[2001]{Queloz01} Queloz, D., Henry, G. W., Sivan, J. P., Baliunas, S. L., Beuzit, J. L., Donahue, R. A., Mayor, M., Naef, D. et al. 2001, A\\&A 379, 279\n\n\\bibitem[2010]{raghavan10} Raghavan, D., McAlister, H. A., Henry, T. J., Latham, D. W., Marcy, G. W., Mason, B. D., Gies, D. R., White, R. J. 2010, ApJS, 190, 1\n\n\\bibitem[2014]{rozyczka14} Rozyczka, M., Kaluzny, J., Thompson, I. B., Dotter, A., Pych, W., Narloch, W. 2014, AcA, 64, 233\n\n\\bibitem[2001]{sagar01} Sagar, R., Munari, U., \\& de Boer, K. S. 2001, MNRAS, 327, 23\n\n\\bibitem[2001]{santos01} Santos, N. C., Israelian, G., Mayor, M. 2001, A\\&A, 373, 1019\n\n\\bibitem[2004]{santos04} Santos, N. C., Israelian, G. \\& Mayor, M. 2004, A\\&A, 415, 1153\n\n\\bibitem[2007]{sestito07} Sestito, P., Randich, S. \\& Bragaglia, A. 2007, A\\&A, 465, 185\n\n\\bibitem[2008]{stoehr08} Stoehr, F., White, R., Smith, M.,  Kamp, I., Thompson, R., Durand, D., Freudling, W., Fraquelli, D. et al. 2008, ASPC, 394, 505\n\n\\bibitem[2003]{twarog03} Twarog, B. A., Anthony-Twarog, B. J., \\& De Lee, N. 2003, AJ, 125, 1383\n\n\\bibitem[2003]{zech09} Zechmeister, M. \\& K\\=urster, M. 2009, A\\&A, 496, 577\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{table*}\n\n\\caption{Observations}\n\\label{tab:observations}\n\\centering\n\\begin{tabular}{c c c c}\n\\hline\nObserving time & Exposure time & Instrument & Dates \\\\\n\\hline\n58hr   & 900s-3600s  & UVES/GIRAFFE & 2/4/2004-15/7/2004 \\\\\n38.5hr & 2020s-2700s & UVES/GIRAFFE & 3/5/2005-1/7/2005  \\\\\n13.5hr & 680s-3600s  & HARPS        & 28-30/05/2011      \\\\\n\n\n\n\\hline                                   \n\\end{tabular}\n\\end{table*}\n\n\n\\begin{table*}\n\\caption{Cluster variables$\\rm^{a}$}\n\\label{tab:cluster_variables}\n\\centering\n\\begin{tabular}{ccccccccc}\n\\hline\nID & RA(J2000) & DEC(J2000) & {\\it B-V} & {\\it V} & N. obs. & $\\rm\\overline{RV}$ (km $\\rm s^{-1}$) & RMS(km $\\rm s^{-1}$) & P($\\%$)$\\rm^{b}$  \\\\\n\\hline           \n  39667 &   254.732063568  &   -52.736025614   &    0.845  &    15.137   &     42  &   -29.087   &    4.030    &      88.  \\\\\n  29531 &   254.699632781  &   -52.704366462   &    0.828  &    15.628   &     28  &   -27.300   &   24.509    &      89.  \\\\\n  33955 &   254.700423295  &   -52.630001667   &    0.832  &    15.990   &     26  &   -29.945   &   13.486    &      90.  \\\\\n  31617 &   254.689311198  &   -52.669417089   &    0.831  &    15.797   &     11  &   -28.108   &    1.725    &      91.  \\\\\n  39854 &   254.781010467  &   -52.723246777   &    0.828  &    15.189   &      3  &   -30.762   &   10.677    &      94.  \\\\\n  43081 &   254.767887749  &   -52.693853688   &    0.835  &    15.119   &     17  &   -30.744   &   11.849    &      93.  \\\\\n  31834 &   254.734726224  &   -52.665662838   &    0.810  &    16.068   &     25  &   -26.430   &    3.467    &      82.  \\\\\n\\hline           \n  30324 &   254.746004485   &  -52.690480237   &    0.814   &   15.940    &    41  &   -28.595   &    1.455     &     $-$  \\\\\n  21659 &   254.876860986   &  -52.797707300   &    0.825   &   15.814    &    37  &   -29.166   &   30.154     &     $-$  \\\\\n  39831 &   254.854747288   &  -52.724276741   &    0.789   &   15.464    &    36  &   -26.177   &   29.672     &     93.  \\\\\n    $-$ &   254.871791667   &  -52.737444444   &    0.822   &   15.010    &    19  &   -29.012   &    2.035     &     $-$  \\\\\n  35905 &   254.658158455   &  -52.596792279   &    0.866   &   16.213    &     6  &   -28.896   &    7.217     &     24.  \\\\\n    $-$ &   254.979041667   &  -52.729833333   &    0.844   &   15.769    &     7  &   -28.434   &    4.519     &     $-$  \\\\\n  24648 &   254.756000212   &  -52.791118012   &    0.913   &   16.428    &    39  &   -26.037   &    6.109     &      0.  \\\\\n  49148 &   254.607856534   &  -52.777415622   &    0.846   &   15.550    &     7  &   -25.939   &    2.451     &     $-$  \\\\\n  34667 &   254.708667366   &  -52.617760801   &    0.865   &   16.456    &    31  &   -29.062   &   13.748     &     85.  \\\\\n  16649 &   254.892499238   &  -52.618200382   &    0.856   &   16.040    &    32  &   -28.446   &    7.678     &     $-$  \\\\\n  30290 &   254.850999373   &  -52.690813347   &    0.825   &   15.544    &    41  &   -26.183   &   19.692     &     90.  \\\\\n    $-$ &   254.794625000   &  -52.807416667   &    0.847   &   16.324    &    39  &   -29.067   &    3.014     &     $-$  \\\\\n  14466 &   254.902801435   &  -52.714731958   &    0.854   &   14.774    &    28  &   -26.381   &    1.467     &     $-$  \\\\\n  27965 &   254.847398993   &  -52.732799296   &    0.812   &   15.812    &    19  &   -28.740   &    5.294     &     70.  \\\\\n  27341 &   254.863111261   &  -52.743533585   &    0.819   &   15.658    &    16  &   -26.352   &    9.431     &     85.  \\\\\n  49667 &   254.600056580   &  -52.710400816   &    0.828   &   15.794    &     6  &   -30.035   &    6.405     &     $-$  \\\\\n  41026 &   254.645602194   &  -52.641141858   &    0.811   &   14.869    &    22  &   -31.695   &    1.350     &      6.  \\\\\n    $-$ &   254.977791667   &  -52.770055556   &    0.825   &   15.617    &     6  &   -28.714   &    2.009     &     $-$  \\\\\n\\hline\n\n\n\n\\end{tabular}\n\\newline\na -- $\\,\\,$Below the horizontal line membership is estabilished only on the basis of radial velocities.\n\\newline\nb -- $\\,\\,$Proper motion membership probability.\n\\end{table*}\n\n\n\\begin{table*}\n\\caption{Field variables}\n\\label{tab:field_variables}\n\\centering\n\\begin{tabular}{cccccccccc}\n\\hline\nID & RA(J2000) & DEC(J2000) & {\\it B-V} & {\\it V} & N. obs. & $\\rm\\overline{RV}$ (km $\\rm s^{-1}$) & RMS(km $\\rm s^{-1}$) & P($\\%$)\\\\\n\\hline\n  31505  &   254.687118376  &   -52.671306636   &    0.864  &    15.728   &     41   &  -25.258   &    4.116    &      91. \\\\\n    478  &   254.923022901  &   -52.809584139   &    0.879  &    14.783   &     35   &  -55.207   &    4.216    &     $-$  \\\\\n  40696  &   254.778223506  &   -52.662991026   &    0.807  &    15.255   &     23   &  -24.845   &    5.866    &      95. \\\\\n  28889  &   254.782822852   &  -52.715868624    &   0.824  &   15.701    &    29    &  -24.585   &    1.415    &      90. \\\\\n  27108  &   254.786303150  &   -52.747918476   &    0.821  &    15.426   &     41   &  -23.120   &    3.147    &      89. \\\\\n  28017  &   254.789168050  &   -52.731954093   &    0.814  &    15.436   &     25   &  -36.817   &   17.897    &      92. \\\\\n\n   9156  &   254.897722920  &   -52.620682013   &    0.875  &    16.213   &      6   &   -2.398   &    1.442    &     $-$  \\\\\n    $-$  &   254.956791667  &   -52.780388889   &    0.851  &    16.056   &     25   &  -24.514   &    7.795    &     $-$  \\\\\n  39659  &   254.842084425  &   -52.736277043   &    0.768  &    15.266   &     30   &  -28.756   &   10.886    &      28. \\\\\n  49446  &   254.621343512  &   -52.739416289   &    0.905  &    15.163   &     40   &  -12.317   &    4.569    &     $-$  \\\\\n   9756  &   254.913463429  &   -52.608067153   &    0.910  &    16.263   &      8   &  -71.134   &   66.779    &     $-$  \\\\\n  28733  &   254.790227260  &   -52.718374337   &    0.795  &    15.830   &     27   &  -26.188   &    7.492    &      56. \\\\\n  23507  &   254.713571036  &   -52.811072103   &    0.808  &    15.779   &     36   &  -25.407   &    5.046    &     $-$  \\\\\n  31512  &   254.810969168  &   -52.670869985   &    0.822  &    15.562   &     36   &  -32.037   &    1.814    &      90. \\\\\n    $-$  &   254.933625000  &   -52.587555556   &    0.889  &    16.047   &      2   &  -21.799   &    2.256    &     $-$  \\\\ \n  10638  &   254.903502113  &   -52.587731891   &    0.946  &    15.490   &      8   &  -11.044   &    5.990    &     $-$  \\\\ \n    $-$  &   254.865708333  &   -52.674027778   &    0.885  &    16.024   &     37   &  -61.851   &    8.402    &     $-$  \\\\ \n  23848  &   254.736362325  &   -52.805171881   &    0.835  &    16.104   &     14   & -100.238   &    6.578    &     $-$  \\\\\n  24548  &   254.742155375  &   -52.792685121   &    0.800  &    16.005   &     23   &  -93.670   &    1.698    &       0. \\\\\n    $-$  &   254.769458333  &   -52.707944444   &    0.833  &    15.427   &      5   &  -23.596   &    1.624    &     $-$  \\\\\n\\hline\n\n\n\n\\end{tabular}\n\\end{table*}\n\n\n\\newpage\n\n\n\\begin{table*}\n\\caption{Spectroscopic binaries}\n\\label{tab:spectroscopic_binaries}\n\\centering\n\\begin{tabular}{cccccccccc}\n\\hline\nID & Period (days) & $\\rm \\tilde{K}$(m $\\rm s^{-1}$) & e$\\,$cos$\\rm \\,\\omega$ &  e$\\,$sin$\\rm \\,\\omega$ &  $\\rm t_{MAX}$ (HJD-2450000) & $\\gamma$(km $\\rm s^{-1}$) & P($\\%$) & m$\\,$sin$\\,$i ($\\rm M_{J}$) & $\\chi_{red}$ \\\\\n\\hline\n29531                  &   3.204288  &  35800$_{-79}^{+79}$   &  -0.0018$_{-0.0033 }^{+0.0033}$  &  -0.00788$_{-0.0027}^{+0.0019}$ &  3201.39496$_{-0.0028 }^{+0.0013}$ &  -27.30048$_{-0.047}^{+0.075}$  &   89 & 279 &  2.5 \\\\                \n30324                  & 224.118409  &   3000$_{-146}^{+134}$ &  -0.091$_{-0.051 }^{+0.021 }$    &  -0.12344$_{-0.0277}^{+0.0099}$ &  3561.65496$_{-0.71}^{+0.83}$      & -28.59548$_{-0.074}^{+0.062}$  &   $-$ &  92 & 0.8 \\\\          \n21659                  &   9.967883  &  41800$_{-70}^{+65}$   &  -0.0047$_{-0.0012 }^{+0.0010 }$ &   0.00345$_{-0.0025}^{+0.0015}$ &  3522.36771$_{-0.0024}^{+0.0017}$   &  -29.16622$_{-0.052}^{+0.027}$ &   $-$ & 466 & 1.3 \\\\\n33955                  &   8.808062  &  21000$_{-65}^{+147}$  &  -0.0015$_{-0.0036 }^{+0.0054 }$ &  -0.00248$_{-0.0039}^{+0.0033}$ &  3552.49403$_{-0.0035}^{+0.0047}$   & -29.94483$_{-0.085}^{+0.043}$  &   90 & 220  & 1.0 \\\\         \n39659$\\rm^{a}$ &   7.651044  &  13500$_{-119}^{+171}$ &   0.0027$_{-0.017 }^{+0.0061 }$  &   0.02813$_{-0.0113}^{+0.0049}$ &  3144.08394$_{-0.018}^{+0.013}$    & -28.75597$_{-0.098}^{+0.058}$   &   28 & 146 & 1.2  \\\\     \n  478$\\rm^{a}$ &  23.846401  &   6100$_{-60}^{+81}$   &  -0.1612$_{-0.0093 }^{+0.010}$   &  -0.03923$_{-0.0080}^{+0.0094}$ & 3149.34776$_{-0.077}^{+0.021}$     & -55.20715$_{-0.053}^{+0.053}$  &    $-$ & 102 & 1.5 \\\\  \n\\hline\n\\end{tabular}\na -- $\\,\\,$Field star\n\\end{table*}\n\n\n\\clearpage\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig1.eps}\n\\caption{\nObserved S/N for  the spectra acquired with each  GIRAFFE setting used\nin this work and with the UVES spectrograph (bottom right panel).\n\\label{fig:sn}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=14cm]{fig2.eps}\n\\caption{ Plate  to plate radial velocity systematics  for GIRAFFE and\nUVES as a function of plate  number (top panels).  In the bottom panel\nwe  report the  histogram of the  difference between  the average\nradial velocity  calculated in  the GIRAFFE reference  system (<RV$\\rm\n_G$>) and in the UVES  reference system (<RV$\\rm _U$> and <RV$\\rm _L$>\nfor  the upper  and lower  UVES spectra  respectively).   Only GIRAFFE\nreference stars  having also 5  UVES radial velocity  measurements (34\nstars) are considered.  \n\\label{fig:offsets}\n}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=5cm]{fig3a.eps}\n\\includegraphics[width=5cm]{fig3b.eps}\n\\includegraphics[width=5cm]{fig3c.eps}\n\\caption{\nAverage   subtracted   radial   velocities   for  GIRAFFE   and   UVES\nspectrographs during  different stages of  post-processing as reported\nin the panels and in the text. The continuous line represents\nthe best-fit Gaussian to the residual distributions.\n\\label{fig:epoch_zpoints_giraffe_uves}\n}\n\\end{figure*}\n\n\\newpage\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig4.eps}\n\\caption{\nRadial velocity residuals for each GIRAFFE setting.\n\\label{fig:res_filter_giraffe}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig5.eps}\n\\caption{\nTop: histogram  of radial  velocity corrected RMS  \nfor  all stars with at least two measurements and RMS below 1 km s$^{-1}$ \nobserved  with\nGIRAFFE (top), UVES (middle) and in the combined catalog (bottom).\nThe dashed vertical lines denote median values.\n\\label{fig:rms_hist}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig6.eps}\n\\caption{\nHistogram  of all  radial  velocities measurements  acquired with  the\nFLAMES spectrograph.\n\\label{fig:rv_hist}\n}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig7.eps}\n\\caption{\nRadial velocity  RMS for  all stars  in our catalog  as a  function of\nmagnitude.   The  dashed  line  denotes the  magnitude  dependent  RMS\ntreshold  described   in  the  text,  the  dotted   line  denotes  the\n5$\\rm\\sigma$  detection treshold.  Blue points  are RMS  variables and\ngreen points are GLS variables.\n\\label{fig:RMS}\n}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig8.eps}\n\\caption{\nRadial velocity RMS for all stars in our catalog in the region below 5\nkm $\\rm\\,s^{-1}$.\n\\label{fig:RMS_CLOSE}\n}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig9.eps}\n\\caption{\nColor  magnitude diagram  for cluster  members.  Blue  and  green dots\nrepresent RMS and GLS variables respectively. \nRed open circles represent radial velocity constant stars.\nOn  the background  the  CMD of  proper  motion members  from the  M09\ncatalog.\n\\label{fig:MEMBERS}\n}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig10.eps}\n\\caption{\nThe same as Fig.\\ref{fig:MEMBERS} for field stars.\n\\label{fig:FIELD}\n}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig11.eps}\n\\caption{\nSurvey detection tresholds as a function of the companion mass and period.\n\\label{fig:efficiency}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig12.eps}\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 21659.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v21659}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig13.eps}\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 29531.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v29531}\n}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig14.eps}\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 30324.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v30324}\n}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=16cm]{fig15.eps}\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 33955.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v33955}\n}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\includegraphics[width=16cm]{fig16.eps}\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 39659.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v39659}\n}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\includegraphics[width=16cm]{fig17.eps}\n\\flushleft\n\\caption{\nFolded  RV  curve with best fit  model  and \nresiduals  (top), bisector\n(middel) and periodogram (bottom) for star 478.\nThe dashed horizontal line in the periodogram\npanel denotes the GLS algorithm detection treshold\n(p$\\rm_{GLS,FAP}$) as defined in the text.\n\\label{fig:v478}\n}\n\\end{figure*}\n\n\n\n\n\n\n\n\\bsp\t\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 40041, "prevtext": "\n\n\\noindent\nwhere $\\tilde{K}$  is the  radial velocity semi-amplitude  without the\ncontribution of the eccentricity  $e$, $k=e\\,\\cos \\omega $, $h=e\\,\\sin\n\\omega   $,  $\\gamma$   is   the  barycentric   radial  velocity   and\n$u=\\nu+\\omega$ is  the true argument  of latitude with $\\nu$  the true\nanomaly and $\\omega$ the argument of the pericenter.\n\n\\noindent\nWe considered as  free parameters: $\\tilde{K}$, $h$, $k$,  the time of\nmaximum  radial velocity  ($t_{MAX}$) and  $\\gamma$.   The convergence\ntoward   the  best-fit   solution   was  obtained   by   means  of   a\nLevenberg-Marquardt algorithm (Press  1992), and the uncertainties and\nthe best fit values of the parameters by means of a Markov Chain Monte\nCarlo analysis.  For  each radial velocity curve we  created 20 chains\nof 10$^{5}$ steps.  Each chain is started from a point 5-$\\sigma$ away\n(in  one  randomly  selected  free parameter)  from  the  best-fitting\nsolution   obtained  by   the   Levenberg-Marquardt  algorithm.    The\n$\\chi^2_{\\rm old}$ of the fit of this initial solution is recorded and\ncompared  with  the  $\\chi^2_{\\rm  new}$  obtained  in  the  following\nstep. The following step is obtained jumping from the initial position\nto  another  one  in  the multidimensional  parameter  space  randomly\nselecting  one of the  free parameters  and changing  its value  by an\narbitrary  amount  which is  dependent  on  a  jump constant  and  the\nuncertainty $\\sigma$  of the parameter itself.  Steps  are accepted or\nrejected  accordingly   to  the  Metropolis-Hastings   criterium.   If\n$\\chi^2_{\\rm  new}$  is lower  than  $\\chi^2_{\\rm  old}$  the step  is\nexecuted,      otherwise     the     execution      probability     is\n$P=e^{-\\Delta\\chi^2/2}$         where        $\\Delta\\chi^2=\\chi^2_{\\rm\n  new}-\\chi^2_{\\rm old}$.   In this  latter situation a  random number\nbetween 0 and 1 is  drawn from a uniform probability distribution.  If\nthis number is lower than $P$ then the step is executed, otherwise the\nstep  is rejected and  the previous  step is  repeated instead  in the\nchain.  In  any case  the value of  the $\\chi^2$  of the last  step is\nrecorded and compared with the one of the following step up to the end\nof the chain.  We adjusted the jump constants (one for each parameter)\nin such a way that the step acceptance rate for all the parameters was\naround 25 per  cent.  We then excluded the first 20  per cent steps of\neach chain to avoid the  initial burn-in phase, and for each parameter\nwe merged the remaining part  of the chains together.  Then we derived\nthe  mode  of the  resulting  distributions,  and  the 68.3  per  cent\nconfidence limits  defined by the 15.85th and  the 84.15th percentiles\nin the cumulative distributions.\n\n\\noindent\nThe radial velocity measurements  after subtraction of the barycentric\nvelocities, along  with the best  fit model, bisector diagram  and the\nperiodogram                 are                shown                in\nFig.~\\ref{fig:v21659}-Fig.~\\ref{fig:v478}.       Our      best-fit\nparameters  are given  in  Table~\\ref{tab:spectroscopic_binaries}. The\nbest-fit  models correspond to  values of  the reduced  $\\chi$ squared\nbetween $\\sqrt{\\chi_{r}^2}=0.8-2.5$. \n\n\\noindent\nThe bisector  error was  calculated from  the dispersion  of the\ndistribution  of  bisector values  of  all  the  spectra, and  assumed\nidentical  for all  stars.  We  also checked  for  linear correlations\nbetween the bisector  and radial velocity measurements calculating\nthe Pearson correlation coefficient.  For the six cases considered the\ncoefficient is comprised in between  -0.47 and 0.56 which denoted that\nno strong correlations are found.  \n\n\\noindent\nFor those variables  that were considered cluster members  (4 out of 6\nas shown in Table~\\ref{tab:spectroscopic_binaries}) we also calculated\nthe  mass function and,  by assuming  for the  primary the  mass ($\\rm\nM_{*}$) obtained  by isochrone fit\\footnote{We considered  the 3.5 Gyr\n  isochrone   that   was   discussed    in   M09.}    we   report   in\nTable~\\ref{tab:spectroscopic_binaries}  a lower  limit on  the minimum\nmass of the companion which is given by the following equation\n\n\n", "index": 7, "text": "\\begin{equation}\n\\rm m\\,sin\\,i>\\Big(M^2_{*}\\frac{\\tilde{K}^3\\,P}{2\\,\\pi\\,G}\\Big)^{\\frac{1}{3}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\rm m\\,sin\\,i&gt;\\Big{(}M^{2}_{*}\\frac{\\tilde{K}^{3}\\,P}{2\\,\\pi\\,G}\\Big{)}^{\\frac%&#10;{1}{3}}\" display=\"block\"><mrow><mrow><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">m</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>sin</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">i</mi></mrow><mo>&gt;</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><msubsup><mi mathvariant=\"normal\">M</mi><mo>*</mo><mn>2</mn></msubsup><mo>⁢</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msup><mover accent=\"true\"><mi mathvariant=\"normal\">K</mi><mo stretchy=\"false\">~</mo></mover><mn>3</mn></msup></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">P</mi></mrow><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">G</mi></mrow></mfrac></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mfrac><mn>1</mn><mn>3</mn></mfrac></msup></mrow></math>", "type": "latex"}]