[{"file": "1601.05664.tex", "nexttext": "\nwhere {$Y_i$} represents the urban quantity (wages or income) of unit $i$ under enquiry, {$U_i$} is the urban referent (population or density), {$a_0$} is a time dependent normalisation constant, {$\\lambda$} is the scaling coefficient and {$\\epsilon_i$} is the estimated residual.\\\\\n\nThis regression is the log-transform of the following scaling equations specified for population \\eqref{eq:scalingd} and density \\eqref{eq:scalingensity}. \n\n  \\begin{figure}[H]\n \\begin{center}\n  \\caption{Variations of Scaling Exponents with respect to Geographical Scales and Economic Specifications}\n  \\label{fig:vizExponents}\n  \\includegraphics[width=0.47\\textwidth]{Transpose_fficialScaling.png}   \n   \\end{center}\n\\small From left to right on the x-axis: regression of total wages with total residents/total jobs ($\\beta$), with the residential/job density ($\\gamma$); regression of total income with total residents/households ($\\beta$), with the residential/households density ($\\gamma$). The dots represent estimated values, and the lines the extent of the confidence intervals.\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 26489, "prevtext": "\n\n\\maketitle \n\n\n\n\n\n\\begin{abstract}\nAgglomeration economies are a persistent subject of debate among economists and urban planners. Their definition turns on whether or not larger cities and regions are more efficient and more productive than smaller ones. We complement existing discussion on agglomeration economies and the urban wage premium here by providing a sensitivity analysis of estimated coefficients to different delineations of urban agglomeration as well as to different definitions of the economic measure that summarises the urban premium. This quantity can consist of total wages measured at the place of work, or of income registered at the place of residence. The chosen option influences the scaling behaviour of city size as well as the spatial distribution of the phenomenon at the city level. Spatial discrepancies between the distribution of jobs and the distribution of households at different economic levels makes city definitions crucial to the estimation of economic relations which vary with city size. We argue this point by regressing measures of income and wage over about five thousands different definitions of cities in France, based on our algorithmic aggregation of administrative spatial units at regular cutoffs which reflect density, population thresholds and commuting flows. We also go beyond aggregated observations of wages and income by searching for evidence of larger inequalities and economic segregation in the largest cities. This paper therefore considers the spatial and economic complexity of cities with respect to discussion about how we measure agglomeration economies. It provides a basis for reflection on alternative ways to model the processes which lead to observed variations, and this can provide insights for more comprehensive regional planning. \\\\\n\n{\\bf Keywords: }Cities, Size, Agglomeration economies, Income, Wage, Inequality, Segregation\\\\\n\n\\end{abstract}\n\n\n\n\\begin{multicols}{2} \n\n\\section{Introduction}\n\nAs complex systems, cities exhibit quantitative and qualitative change in composition as they grow in size. Economies of agglomeration are one of the most debated of such transformations. Research suggests that there is evidence of systematic variations in productivity levels across space, but the diversity of specifications used to estimate the magnitude of agglomeration economies makes it hard to compare studies and this leads to a wide array of differences in quantitative results. \\\\\n\nIn their review, \\citet{rosenthal2004} find that city size tends to increase individual productivity by 3 to 8\\%. In a meta-analysis, \\citet{melo2009} looked at the parameters influencing this estimation in thirty-four studies where they found: \n\n\\noindent\\begin{itemize}\n\\item {\\bf country specific} effects: stronger agglomeration effects are reported in studies of France and Italy, compared to the USA, and they are even weaker in China, Japan, Sweden and the UK.\n\\item {\\bf industrial coverage} effects: Agglomeration economies of service activities are larger than those estimated for the economy as a whole.\n\\item {\\bf controls and fixed} effects: Controlling for differences in human capital and skills at the individual level significantly lowers the estimation of city size effects on productivity. \n\\item confounded relations from the type of {\\bf urban measures} used (total population or density) and their {\\bf spatial characteristics}. \\item a {\\bf publication bias} towards reporting a larger number of significant positive relations rather than negative or non-significant ones.\n\\end{itemize} \n\nUsing six spatial definitions in France, \\citet{briant2010} looked at scale and shape effects in the estimation of the wage premium. They concluded that their impact on the coefficients measured were less important than the effect of specifications and controls used in the regressions (the use of gross or net wages for example). We argue here that spatial effects are less trivial than shape and scale differences, and deserve to be studied extensively, in particular by distinguishing between urban and non-urban spaces (i.e. geographical units larger than cities at the regional scale or smaller than cities at the local scale). To this end, we ask three questions: \\\\\n\n\\begin{itemize}[label=--]\n\\item Are agglomeration economies specifically urban or do larger regions that include non-urban areas exhibit this behaviour too? \n\\item Does the location of economic agents within cities matter when measuring agglomeration economies? \n\\item Are larger cities more unequal?\n\\end{itemize}\n\nThese questions have not been studied much despite the fact that population cutoffs and spatial definitions affect the variation of {\\it per capita} measures across city size \\citep{fragkias2013, rybski2013, arcaute2015, cottineau2015}. In particular, the diversity of the urban landscape within cities is populated by different kinds of activities and different classes of population with different economic characteristics. We therefore expect that the way cities are defined matters in the estimation of agglomeration economies, the wage premium and internal inequalities.\n\n\n\n\n\n\\section{Hypotheses about cities, scales, economic output and inequality}\n\nWe start by reviewing the different economic mechanisms which might cause wealth, income and productivity to cluster in cities, in cities of larger sizes, and in neighbourhoods of particular affluence. We find that the mixed evidence from the literature is paralleled by a diversity in different theories as to the causes (section \\ref{sec:cause}) and {\\it loci} (section \\ref{sec:geo}) of agglomeration economies. This leads us to articulate in section \\ref{sec:why} our own hypotheses about why urban definition should be of importance in the estimation of agglomeration economies. \n\n\\subsection{Mechanisms of agglomeration}\n\\label{sec:cause}\n\nWhat we refer to here as a causal limit to agglomeration relates to the direction from which wage and income premia arise between cities and individuals as articulated in different economic theories. From the causes and reinforcing mechanisms of agglomeration economies within the framework of regional science, urban economics and the new economic geography, we find two groups of explanations. The first acknowledges a retroaction of cities on people (making them more productive, providing them with more knowledge, interactions and opportunities, etc.), whereas the second focuses on the micro foundations of aggregate measurements of the wage premium as well as of the spatial accumulation of wealth. \\\\\n\n\\citet{puga2010} summarises the first group into three classes of mechanisms. Larger cities and markets allow for increased: sharing (infrastructure and facilities), matching (demand and supply for products and skills) and learning (of new practices and technologies). These causal chains rely on the effect of city size and large-scale amenities with high fixed costs \\citep{glaeser2001} to increase the output measured at the aggregate level. Another type of explanation involves the self sorting of the most productive and educated workers in the largest cities \\citep{baumsnow2012}. Sorting describes the fact that economic agents of different educational attainments choose different locations, corresponding to different but equivalent bargains (typically: higher salary and higher rents in large cities or lower salary and lower rents in smaller cities), depending on their preferences for different sets of amenities. The distribution of jobs is assumed to follow the realisation of individual preferences and individual real income levels to be equivalent in cities of different sizes. However, the concentration of highly educated workers affects the productive composition of large cities and boosts the total income generated compared to smaller cities. \\\\\n\nFrom an aggregate perspective, \\citet{krugman1996} reviews potential mechanisms explaining the distribution of activity in space as an equilibrium between centripetal forces (natural and relative location advantages, market size, knowledge spillovers) and centrifugal forces (commuting costs, urban land rents, congestion and pollution) driving the location of firms and individuals as a consequence. In this framework, agglomeration economies occur where centripetal exceed centrifugal forces.\\\\\n\nConsequently there seem to be two major ways of looking at higher wages and incomes in larger agglomerations: either urban concentrations produce higher productivity {\\it per se}, or it is because highly productive workers and industries have similar location preferences. In the latter case, no real economic premium exists at the individual level in the largest cities as larger wages only compensate for larger rents, although \\citet{eeckhout2014} suggest that this leads to larger cities being more unequal (due to complementarities in extreme skills). Similarly, either individual preferences or particular urban characteristics explain the variety of city sizes. These theoretical but undecided options suggest further empirical investigations, and add to the definitional sources of confusion: what are the most appropriate spatial limits of agglomerations and which economic quantity is most relevant to measure agglomeration effects?\n\n\\subsection{Defining agglomeration economies}\n\\label{sec:geo}\n\nTwo major sources of confusion (city definition and economic specifications) have hampered the empirical testing of results drawn from models that have originated in the New Economic Geography and the New Urban Economics. \\\\\n\n\\citet{martin1999} and \\citet{osullivan2004} point to the unclear, undefined or usually over-simplified concepts of space and time which plague most theories of agglomeration economies. The extreme example of this simplification of space is the linear space that is assumed in the classic textbook by \\citet{fujita2001}. Beyond this simplification, there does not appear to be any agreement about the scale at which agglomeration economies emerge. Most  authors refer to cities usually as homogeneous objects \\citep{mera1973, sveikauskas1975, henderson1986, moomaw1988, henderson2003}, whereas some refer more broadly to industrial districts \\cite{marshall1920}, dense urban spaces \\citep{ciccone1996, ciccone2002} or to 'small regions' \\citep{fingleton2006}. Some researchers have explicitly questioned the right scale at which these processes occur \\citep{mori2015}. From a concentration analysis in the US performed at different geographical levels (from zip codes to states), \\citet{rosenthal2001} conclude that different causes of agglomeration play out at each geographical level. \\citet{arribasbel2015} examine the link between small employment districts and city-level measures of urban externalities and conclude that smaller units generate higher levels because cities are internally heterogeneous, with employment highly concentrated in their central parts and people of different income levels located in different areas. Finally despite limits on data, some theoretical urban arguments are empirically tested with regional data on exhaustive partitions, which seems problematic.\\\\\n\nIn this paper, we evaluate the hypothesis that the city is the relevant unit to observe agglomeration economies as well as internal inequalities. We do not take this statement for granted but explore and compare results for different geographies. Our exploration is motivated by a search for robustness but also because we think there are theoretical reasons why urban definitional criteria should play a role in the estimation of urban inequalities. \\\\\n\nThe second source of definitional confusion relates to what is measured empirically when referring to \"economies\", \"rich populations\" or \"premium wages\". Indeed, the lack of comparability between empirical studies from the literature emerges from the variety of economic outputs that relate to city size. Typically, the theoretical prediction which we want to verify with empirical data is the increase in added value per capita with city size (or agglomeration of population) \\citep{mera1973, sveikauskas1975, ciccone1996}. However, added value is seldom measured at local levels of administrative geography, so wages are often taken as a proxy for productivity levels \\citep{combes2011}. Moreover, taking nominal or real wages and controlling for education levels and/or housing prices have important impacts on empirical results \\citep{moretti2004, briant2010}. We also observe a strong theoretical difference between measuring wage (or income) premium at the individual level of workers located in cities on the one hand \\citep{briant2010, baumsnow2012, eeckhout2014}, and evaluating the effect of population size on the mass of income produced and its distribution in cities on the other \\citep{glaeser2001, bettencourt2012, arcaute2015}. \\\\\n\nFinally, when looking at inequality, a more classical indicator of wealth differences is income. This derives for some part from the revenue of labour (although with large variations across the income distribution of households), and for the rest from capital profits and welfare transfers \\citep{piketty2013, atkinson2015}. These two specifications are thus not necessarily strongly correlated in space, as we know that the distribution of production and consumption at residence locations do not coincide \\citep{davezies2008}. The uneven spatial distribution of income in cities is explained by models of segregation, but wage premia, income inequality, and segregation are rarely associated with city size even though the distribution of wealth is of paramount importance in urban processes of production and growth \\citep{atkinson2015}. The key (and overarching) question of urban socioeconomics seems to be this: as cities get larger, do they get richer, but also more unequal and segregated \\citep{batty2015, sarkar2015}? \\\\\n\nBecause all these processes are linked and localised in cities, we strongly expect their spatial delimitation to play a strong role in the empirical estimation of agglomeration economies and inequalities, as well as the obvious effects of econometric specification. We also expect these variations to tell a story about the social and morphological heterogeneity of urban space. We see four reasons why size effects on production and income inequality should vary with urban definitions.\n\n\\subsection{Why should urban definition matter to the estimation of agglomeration economies ?}\n\\label{sec:why}\n\n\\subparagraph{Because agglomeration economies are considered to be urban.}\nIf processes of learning, sharing, matching and sorting are enhanced by urban characteristics (such as the density of interactions), then the measure of agglomeration economies and scaling of economic variables needs to be performed on urban objects. A unique set of criteria to define cities is obviously illusory (as cities can be defined in many valid but non equivalent ways \\citep{bretagnolle2001, parr2007}), but it is clear that the same estimation performed at an urban and a regional level are supposed to give different results. \n\n\\subparagraph{Because the estimation of other parameters changes with city definition.} When studying the concentration of infrastructural and socio-economic attributes with city size, the choice of definitional criteria (density, flow and population thresholds to spatially delineate urban clusters) has proven to affect the value of scaling estimates \\citep{fragkias2013, rybski2013, arcaute2015, cottineau2015}.\n\n\\subparagraph{Because cities are heterogeneously populated and used for activities.} Jobs and amenities are more concentrated than the resident population in cities \\citep{terrier1990, glaeser2001, arribasbel2015}. This feature has increased since the 1950s because of the development of automobile mobility and the sprawl of residential population beyond the built-up area of cities. Therefore restrictive and extensive delineations do not capture the same activities within their urban boundaries and the resulting activity composition might be affected differently by size effects. Finally, in terms of social landscapes and income inequality, \\citet{guilluy2013} and \\citet{davezies2014} note for contemporary France, that different urban morphologies tend to coincide with different mixes of activities (productive and residential), but also with different population categories: recent immigrants and young professionals tend to reside in the densest parts of the largest metropolises, pockets of suburban wealth belong to their periphery, whereas rural areas and the outskirts of medium-sized and smaller cities concentrate deprived households. This implies that including some or all these heterogeneous spaces in the delineation of cities will modify the picture of urban wealth and inequality, and potentially its relation to city size. \n\n\\subparagraph{Because geolocated estimations are subject to spatial biases in general.} There is a large body of literature that has focused on the aggregation biases in spatial measures associated with varying administrative boundaries. The Modifiable Area Unit Problem (MAUP) \\citep{openshaw1979, openshaw1983} affects the measurement of concentration \\citep{rosenthal2001} and segregation \\citep{wong1999, wong2004, reardon2006} in general, so we must expect estimations of agglomeration economies and urban inequality to behave similarly and respond to the variations of shape and scale of the units defined as urban. The aim of this paper is to test this assumption and evaluate the significance of this variation on possible conclusions, using the data and methods exposed in the following section. \n\n\n\n\n\n\\section{Data and Methods}\n\\label{sec:method}\nFor this experiment, we use multiple definitions of cities applied to three sets of recent French data: \n\n\\noindent\\begin{itemize}\n\\item {\\bf Population data} are gathered for 36546 local units from the 2011 French Population Census\\footnote{source : \\url{http://www.insee.fr/fr/themes/detail.asp?reg_id=99&ref_id=base-cc-evol-struct-pop-2011}} (cf. Figure \\ref{fig:COM}) and aggregated into higher levels of geography (cf. Figures \\ref{fig:UU} to \\ref{fig:DEP}). \n\\item  {\\bf Income data} are provided by the taxation office. It gives for each local unit the sum of income declared by the 'fiscal households' (people who declare their income together) for the year 2011. The distributional income data refer to the number of households in each taxation bracket of declared income of 2011 and their aggregated income at the local unit level\\footnote{source : \\url{http://www2.impots.gouv.fr/documentation/statistiques/ircom2011/ir2011.htm}}. Unfortunately, the 8 taxation brackets do not correspond to regular quantiles of households. Their distribution is displayed in Table \\ref{tab:income}. \n\\end{itemize}\n\n\\begin{table}[H]\n\\begin{center}\n\\caption{Distribution of French households per income, 2011}\n\\label{tab:income}\n\\begin{tabular}{|c|c|c|c|c|}\n\\hline\nCat. & Income (k\\euro) & N households & \\% & of total* \\\\ \\hline\nB1 & $0 - 10$   & 6,380,662 & 24.0 & 18.1 \\\\\nB2 & $10 - 12$   & 1,614,293 & 6.1 & 4.6  \\\\\nB3 & $12 - 15$   & 2,616,818 & 9.8 & 7.4 \\\\\nB4 & $15- 20$   & 4,279,602 & 16.1 & 12.2 \\\\\nB5 & $20 - 30$   & 4,766,371 & 17.9 & 13.5 \\\\\nB6 & $30 - 50$   & 4,323,569 & 16.3 & 12.3 \\\\\nB7 & $50 - 100$   & 2,094,955 & 7.9 & 6.0 \\\\\nB8 & $> 100$  \\euro & 522,190 & 2.0 & 1.5\\\\ \\hline\n & Total & 26,598,460 & 100 & 75.6  \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\small *The number of households (35,178,358) is higher than the number of households for which we know the income bracket (26,598,460). We end up with 75.6\\% of the distributional information.\n\\end{table}\n\nFor privacy reasons, categories with less than 10 households are absent from the data, leaving small local units with an incomplete description of their income distribution (1 out of 4 households are not accounted for in the distributional data, cf. Table \\ref{tab:income}). This missing distributional data thus does not affect large (urban) units to the same extent as the smaller (rural) ones. \\\\\n\n\\noindent\\begin{itemize}\n\\item\n{\\bf Wage data} comes from the public database CLAP ({\\it Connaissance locale de l'appareil productif}\\footnote{source : \\url{http://www.insee.fr/fr/methodes/default.asp?page=definitions/clap.htm}}) which provides information about firms and their employees. We use data from 2008 for total wages and the total number of employees, which are gathered at the workplace (defined as the firm's location) and aggregated to the local scale of {\\it communes}. In order to compare the distribution of firms according to their average wage levels with the distribution of income, we produced a partition into 8 classes that exhibits the same frequency as used in the income tax brackets (cf. Table \\ref{tab:wages}). Because we had access to individual firms data, distributional information has a better spatial coverage than the income distribution. \n\\end{itemize}\n\nIn order to compare the different specifications for the regressions performed here, we consider absolute numbers of firms, jobs and residents as measures of the size of a geographical unit, and the number of firms, jobs and residents per unit of urbanised surface (extracted from CORINE Landcover 2006 raster data\\footnote{source : \\url{http://www.statistiques.developpement-durable.gouv.fr/donnees-ligne/li/1825.html}}) as the density of a geographical unit.\n\n\\begin{table}[H]\n\\begin{center}\n\\caption{Distribution of firms and jobs per mean wages, 2008}\n\\label{tab:wages}\n\\begin{tabular}{|c|c|c|c|c|c|}\n\\hline\nCat. & Mean w (k\\euro) & N firms  & \\% & N jobs*   & \\%  \\\\ \\hline\nF1 & $10 - 15.7$ & 277,421 & 24.0 & 1,235,134 & 11.6\\\\\nF2 & $15.7 - 16.8$ & 70,187 & 6.1 & 327,983 & 3.1\\\\\nF3 & $16.8 - 18.7$  & 113,776 & 9.8 & 625,324 & 5.9\\\\\nF4 & $18.7 - 21.9$ & 186,071 & 16.1 & 1,192,853 & 11.1\\\\\nF5 & $21.9 - 27.0$ & 207,234 & 17.9 &2,307,616 & 21.6\\\\\nF6 & $27.0 - 36.8 $& 187,983 & 16.3 &3,344,014 & 31.3\\\\\nF7 & $36.8 - 63.8$ & 91,085 & 7.9 &1,418,670 & 13.3 \\\\\nF8 & $> 63.8$ & 22,705  & 2.0 & 222,805 & 2.1\\\\ \\hline\n & Total & 1,156,462 & 100 &10,674,399 & 100 \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\small *Jobs here correspond to full-time equivalents. Therefore, comparing the number of jobs (10,674,399) with the active population of France in 2008 (27,984,000) makes a satisfying approximation of the total productive activity in local units, as 2.1 million of them are unemployed, and around 20\\% of the remaining 25.9 million work part-time. N.B. Establishments are the most relevant level to assign jobs, but wage data at this level are too weak. Therefore, we adopted the company level (as in most studies), as they provide a more exhaustive information. Consequently, in some cases, a job assigned to the company location may actually be performed in one of the company establishments in a different place. \n\\end{table}\n\n\n Our method for defining cities (besides the official French delineations of urban cores {\\it Unit\\'{e}s Urbaines} and metropolitan areas {\\it Aires Urbaines}) has been developed by \\citet{arcaute2015} and applied to France by \\citet{cottineau2015}. It consists of an algorithm for clustering local units ({\\it communes} in France) into urban cores, based on a density cutoff: all contiguous local units of higher density than this threshold are aggregated. A second algorithm attaches functional peripheries to these urban cores, based on the percentage of commuters of local units working in the centres. A final criterion is used to select clusters: it is the minimum population of the considered cluster. The advantage of this method is that it can produce representations of the urban system for a variety of values for each criterion. Thirty different combinations are shown in Appendix \\ref{fig:defs}.\n\n\n\n\\begin{figure}[H]\n \\begin{center}\n  \\caption{36546 Local Units (COM)}\n  \\label{fig:COM}\n\\includegraphics[width=0.3\\textwidth]{COMf.png}   \n  \\caption{2233 City Cores (UU)}\n  \\label{fig:UU}\n\\includegraphics[width=0.3\\textwidth]{UUf.png}   \n  \\caption{771 Metropolitan Areas (AU)}\n  \\label{fig:AU}\n\\includegraphics[width=0.3\\textwidth]{AUf.png}   \n  \\caption{96 NUTS 3 regions (DEP)}\n  \\label{fig:DEP}\n\\includegraphics[width=0.3\\textwidth]{DEPf.png}   \n   \\end{center}\n\\end{figure}\n\n\n\\section{Empirical Results}\n\\label{sec:empirical}\n\nOur empirical results are organised into three categories, following the three questions stated in introduction. Section \\ref{sec:official} answers the question \"are economies of agglomeration specifically urban\" with mixed evidence. Section \\ref{sec:system} reports variations of wealth across cities and other geographical units with respect to their size, trying to identify the definitions under which larger cities are richer. Finally, section \\ref{sec:cities} investigates the question of inequality and its relation to city size.\n\n\n\n\n\n\n\\subsection{Are economies of agglomeration urban?}\n\\label{sec:official}\n\nIn this section we test whether or not agglomeration effects are characteristic of urban spaces. For this purpose we study two types of geographical boundary. The first type represents urban areas while the second includes non-urban regions as well. In the first and urban-only category, {\\bf city cores} ({\\it Unit{\\'e}s Urbaines} or UU, cf. Figure \\ref{fig:UU}) are defined based on the continuity of the built-up area ($< 200$ meters between buildings), and {\\bf metropolitan areas} ({\\it Aires Urbaines} or AU, cf. Figure \\ref{fig:AU}) correspond to city cores of more than 1500 jobs to which are attached communes where more than 40\\% of their working residents commute to the city core. In the second category, {\\bf local units} ({\\it Communes} or COM, cf. Figure \\ref{fig:COM}) and {\\bf NUTS 3 regions} ({\\it D{\\'e}partements} or DEP, cf. Figure \\ref{fig:DEP}) provide an exhaustive coverage of the French territory, including rural areas, at respectively low and high scales. \\\\\n\nThese four delineations vary with respect to their number, population and spatial extension (cf. Appendix \\ref{tab:4scales}). We use them as a benchmark to incorporate the effect of scale and 'urbanity' in different geographical delineations with economic specifications \\citep{briant2010}.\n\nTechnically, we regress the total economic output (wages from firms and households' total income) of the spatial units on their total population and urban population density in the following equation\n\n", "index": 1, "text": "\\begin{align}\n\\label{eq:scalinlog}\n  log(Y_i)  = a_0  + \\lambda \\times log(U_i) + \\epsilon_i\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle log(Y_{i})=a_{0}+\\lambda\\times log(U_{i})+\\epsilon_{i}\" display=\"inline\"><mrow><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>Y</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>a</mi><mn>0</mn></msub><mo>+</mo><mrow><mrow><mi>λ</mi><mo>×</mo><mi>l</mi></mrow><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>U</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msub><mi>ϵ</mi><mi>i</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\nwhere {\\it b} represents a time dependent normalisation constant and {$\\beta$} the scaling exponent of the variable with the size $P_i$ of unit $i$; and \n\n\n", "itemtype": "equation", "pos": 27678, "prevtext": "\nwhere {$Y_i$} represents the urban quantity (wages or income) of unit $i$ under enquiry, {$U_i$} is the urban referent (population or density), {$a_0$} is a time dependent normalisation constant, {$\\lambda$} is the scaling coefficient and {$\\epsilon_i$} is the estimated residual.\\\\\n\nThis regression is the log-transform of the following scaling equations specified for population \\eqref{eq:scalingd} and density \\eqref{eq:scalingensity}. \n\n  \\begin{figure}[H]\n \\begin{center}\n  \\caption{Variations of Scaling Exponents with respect to Geographical Scales and Economic Specifications}\n  \\label{fig:vizExponents}\n  \\includegraphics[width=0.47\\textwidth]{Transpose_fficialScaling.png}   \n   \\end{center}\n\\small From left to right on the x-axis: regression of total wages with total residents/total jobs ($\\beta$), with the residential/job density ($\\gamma$); regression of total income with total residents/households ($\\beta$), with the residential/households density ($\\gamma$). The dots represent estimated values, and the lines the extent of the confidence intervals.\n\\end{figure}\n\n\n", "index": 3, "text": "\\begin{align}\n\\label{eq:scalingd}\n  Y_i  = b \\times P_i ^\\beta \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Y_{i}=b\\times P_{i}^{\\beta}\" display=\"inline\"><mrow><msub><mi>Y</mi><mi>i</mi></msub><mo>=</mo><mrow><mi>b</mi><mo>×</mo><msubsup><mi>P</mi><mi>i</mi><mi>β</mi></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\nwhere {\\it c} represents a time dependent normalisation constant and {$\\gamma$} the scaling exponent of the variable with density $D_i$ of unit $i$.\\\\\n\n\nWe interpret the value of the exponents {$\\beta$} and {$\\gamma$} by reference to 1 (the linear regime), as is common practice in urban scaling \\citep{pumain2004, bettencourt2007, arcaute2015}. In this case, an exponent equal to 1 represents the absence of economies of agglomeration. Exponents significantly greater than 1 (where the confidence interval does not intersect with the interval [0.95;1.05] for example in Figure \\ref{fig:vizExponents}) indicate economies of agglomeration, that is rising average income or wages with size or density (the superlinear regime), whereas an estimation with $\\beta$ or $\\gamma$ significantly less than 1 (the sub linear regime) suggests diseconomies of agglomeration.\\\\\n\nFigure \\ref{fig:vizExponents} and present the results obtained with the four geographical delineations (rows) and eight economic specifications (columns): the OLS regression is performed on wages or income, using the absolute population or its density, and considering the unit's population as the resident population or the referent population (which is jobs for wages and households for income). Therefore, by looking at rows in Figure \\ref{fig:vizExponents}, one can evaluate the sensitivity to economic specifications, whereas by looking at columns, the reader can see variations in estimations that depend only on the geographical delineation chosen (scale and 'urbanity'). The cells highlighted with letters correspond to estimations that can be compared with results from the literature.\\\\\n\nWe find that half of the estimations shown here (16 out of 32) give a linear relation between economic output and population (linear regime). Economies of agglomeration (superlinear) are found in 13 cases, and diseconomies (sublinear) in 3 cases, all at the most local level. Two of our estimations about cities in France are in agreement with similar estimations for UK cities where there are local economies of agglomeration in terms of wages with the resident population \\citep{glaeser2001} (comparable in scale and specifications to Cell A) and no superlinear scaling of income in metropolitan areas \\citep{arcaute2015} (Cell D). On the other hand, the absence of economies of agglomeration for wages with the total population that we find in metropolitan areas for France (Cell B) contradicts results usually produced for the USA \\citep{sveikauskas1975, glaeser2001, bettencourt2012}. Similarly, the regression of wages against residential density in NUTS 3 regions shows too high a variability to be considered significant in the linear regime in France (Cell C) whereas \\citet{ciccone2002} reports the existence of economies of agglomeration in European and American regions. \\\\\n\nThe referent population (i.e.: residents, households or jobs) plays a decisive role in estimation when considering the variation of wages with density. Indeed, jobs are spatially more concentrated than houses, and less ubiquitous. For all the other cases, this specification plays a negligible role. There appears to be more specification difference reported between regressions with the absolute population or with the density than between regressions of wages or of income. However, the two exponents $\\beta$ and $\\gamma$ are mathematically linked through the scaling of the urbanised area with population (cf. Appendix \\ref{app.ScalingDensityTotal}), and therefore their different values provide less information about possible economic mechanisms than about the way cities of different sizes sprawl in extent. On the contrary, differences between specifications based wages or income represent the two sides of wealth: its creation and its redistribution, and how these are not spatially equivalent.\\\\\n\nFinally, regarding the sensitivity of estimates to geographical specifications, we find the scale of analysis to be decisively important for the results obtained. We also find mixed evidence as to the 'urbanity' of economies of agglomeration. Looking at the scaling of wages with size for example (column 2), economies of agglomeration appear only for non-urban definitions! Indeed, partitions of the territory at the local (COM) and the regional (DEP) scales exhibit superlinear exponents (respectively 1.060 and 1.086, cf. Appendix \\ref{tab:scalingUAUwages}), whereas city cores (UU) and metropolitan areas (AU) produce exponents closer to 1 (respectively 1.037 and 1.024). Counter-intuitively then, only larger regions and small places are richer, not cities. We think this results from the inclusion of rural areas in the non-urban definitions. Therefore, the qualitative difference between urban and rural places (or regions) create this quantitative result, rather than a change in economic behaviour for spatial units of larger population. When we consider density (column 4), estimates significantly over 1 are obtained for the most local scales. This confirms the explanations involving local processes within the labour market (sharing, learning, matching) rather than those of residential 'sorting', because this only holds for high work densities in the city centres (and not with high residential densities with high levels of amenities). The opposite is true for the scaling of income with population (column 6): larger regions only (DEP) exhibit an exponent greater than 1. Finally, the only 'urban' manifestation of economies of agglomeration is unexpected and this is the relative concentration of income in cities of high residential density (column 8). This process concerns the city scale as it plays in the opposite way for local places (COM).\\\\\n\nTo conclude, economies of agglomeration on the production side are urban insofar as 'urban' refers to the dense productive areas of central cities, and on the consumption side insofar as 'urban' refers to large-scale integrated entities between cities and metropolitan areas. However, insofar as economies of agglomeration should derive from the absolute concentration of people and jobs, then they appear to be non-urban and are observed better at the regional scale.\n\n\n\n\n\n\\subsection{Are larger cities richer?}\n\\label{sec:system}\n\nTo disentangle the mixed conclusions about 'urban' economies of agglomerations we used a multiplicity of delineations of cities that allow for the exploration of intermediary situations to that of official definitions and proceed to a sensitivity analysis to three definitional criteria of cities: minimum density, minimum commuting flows and minimum population size. \n\n \\begin{figure}[H]\n \\begin{center}\n  \\caption{Examples of urban clusters definitions}\n  \\label{fig:ex}\n\\includegraphics[width=0.47\\textwidth]{clusterExamples.png}   \n    \\end{center}\n\\end{figure}\n\nUsing the algorithms developed by \\citet{arcaute2015}, we combined 39 density cutoffs, 21 flow cutoffs and 6 population cutoffs to build 4914 representations of the French system of cities, from the most restrictive delineation (cf. Appendix \\ref{fig:defs}, top right corner) of very dense centres with no functional periphery (close to local units or COM) to a very loose consideration of urban lifestyle that covers most of the French territory and thus close to a regional partition such as NUTS 3 or DEP (Figure \\ref{fig:defs}, bottom left). \n\n \\begin{figure}[H]\n \\begin{center}\n  \\caption{Synthetic urban clusters vs official definitions}\n  \\label{fig:corrDefs}\n\\includegraphics[width=0.28\\textwidth]{CorrDefs_clean.png}   \n    \\end{center}\n\n  \\end{figure}\n\nThe differences with the previous four definitions is that we can observe transitions of scaling behaviour for all three parameters that are easy to interpret, and thus control for the way people locate within cities. This answers our second research question. Figure \\ref{fig:ex} illustrates the fact that each change in the definitional criteria affects the resulting urban clusters generated, and hence the measured levels of urban population, wage and income which we use. For example, when the density cutoff increases from 5 to 20 residents per ha, the technological pole of Saclay is excluded from the Parisian city core. When the density cutoff decreases from 5 to 1, the urban cluster of Lille embraces most of the North region. Finally, the large unit of Fontainebleau (which has high income but is covered in forest land-use) is not attached to the Paris metropolitan area over the 55\\% flow cutoff. We finally see how the central and peripheral criteria affect in a somewhat different way dense agglomerations (like Lille for example) or suburban and smaller cities (such as Amiens). Figure \\ref{fig:corrDefs} illustrates the correlation between the standard and synthetic definitions\\footnote{The correlation analysis is performed at the level of the local units. If they belong to a cluster, for a given definition, they get the value 1, otherwise 0. The same process is done for UUs and AUs. At the regional level (DEP), all local units get the value 1, as the definition is a partition of the territory. Therefore a correlation of 1 means that all and only local units included in a city or a region are part of a cluster. A correlation of -1 on the other hand means that all and only local units included in a city or a region are not part of a cluster. For the CORINE raster dataset, the correlation is performed with the percentage of land use that is classified as 'urban' (111 + 112 in the 2006 land-use classification code).}.\\\\\n\nUrban cluster definitions with high density cutoffs ($> 5$ residents per ha) and high flow cutoffs (i.e. composed mostly of central dense local units) represent best the urban land use at the local unit level as given by satellite raster data\\footnote{From the CORINE LandCover 2006. A commune is labelled urban where the majority of its land-use is urban.}. The clusters that correspond best to standard City Cores (UU) have a minimum density cutoff ($< 4$ residents per ha) and a high flow cutoff ($> 70\\%$). At similar levels of density, the cluster equivalent for Metropolitan Areas (AU) are characterised by a lower flow cutoff, as this definition includes the suburban spaces of commuting populations. Finally, the large clusters produced by definitions involving low density cutoffs and low flow cutoffs get closer to the complete coverage of France, and therefore to the spatial definition of NUTS 3 units.\\\\\n\nWe regress total wages and income on the total and specific populations associated with wages and income, for each of the 4914 different definitions of cities. We relate the variations of the coefficients of the agglomeration economies with the definitional criteria of cities and the urban landscapes they correspond to by representing the value of coefficients by a colour and projecting this onto the definitional axes (density, flow and population cutoffs). Given the variety of definitional values that we take into account, we can trace the effect of these criteria on the estimation of the wage and income premium in French cities through heatmaps. Out of the 4914 regressions performed on 39 density cutoffs (criterion 1), 21 flow cutoffs (criterion 2) and 6 population cutoffs (criterion 3), we display only 3276 regressions in the following figures (4 heatmaps) by selecting 4 population cutoffs (no cutoff, 10, 20 and 50 thousand residents). The corresponding definitions are mapped in the same way as in Appendix \\ref{fig:defs}, that is with cities as high density kernels in the top right corner, loose centres at the top left corner, and extensive cities at the bottom left corner. Each square represents the value of the estimated coefficient of the regression on all urban clusters defined by the three criteria (Figure \\ref{fig:readHM}).\\\\\n\n\\begin{figure}[H]\n \\begin{center}\n  \\caption{A legend for the heatmaps of scaling exponents (Fig. \\ref{fig:scalingTotalDefinitions}-\\ref{fig:scalingseg})}\n  \\label{fig:readHM}\n\\includegraphics[width=0.4\\textwidth]{ReadHM.png}   \n    \\end{center}\n\\end{figure}\n\nWhen regressing the total wages and total income against total and specific populations (Figure \\ref{fig:scalingTotalDefinitions}), we find mostly linear to superlinear relations. The projection of the standard definitions onto the closest systematic definitions helps understand the results obtained above. Indeed, Metropolitan Areas (AU) appeared at an urban scale at which no significant agglomeration economies are measured ($0.95 \\leq \\beta \\leq 1.05$). This non-effect is also recorded for any definition when we regress the total wages by the number of workers at the workplace. For that matter, there are no values of parameters that enables us to observe agglomeration economies with this specification. Income begins to scale super-linearly with population at high density thresholds and for the upper part of the urban hierarchy only (where P $\\geq 20$). This means that the relative concentration of income in large aggregates of population is a phenomenon that plays out at the level of large city centres only (high density cutoffs and high commuting flows), suggesting a change in urban quality when cities grow to become metropolises. Finally, the measure of agglomeration economies through wages (against total population) appears to be the most sensitive to city delineations: size effects become rare when we measure them on urban clusters with a minimum population of 10,000 residents (a reasonable minimum size for a city). This remains for clusters that do not correspond to any conceptual urban definitions (bottom right corner) or any population cutoffs. In this case, the coefficients measured are relatively high (superior to 1.05 and 1.1), matching observations made with local and city core definitions (cf. Figure \\ref{fig:vizExponents}).\\\\\n\n\n\\begin{figure*}\n \\begin{center}\n  \\caption{Variations of scaling estimations with city definitions}\n  \\label{fig:scalingTotalDefinitions}\n\\includegraphics[width=0.7\\textwidth]{AggregatedWagesIncome.png} \n  \\end{center}\n\\end{figure*}\n\n\n\nTo conclude, larger cities tend to concentrate the jobs rather than higher wages. In terms of income, there are positive size effects in the most urban parts of the largest cities. Therefore, regarding our results for France, larger cities are not necessarily richer (this depends on the specification chosen) but the wealth produced in central cities 'circulates' \\cite{davezies2008} spatially and ends up more concentrated as income per capita in the largest cities than it was as wages per job. The location of households and jobs within the cities thus definitely matters when it comes to estimating economies of agglomeration. \n\n\n\n\n\n\n\\subsection{Are larger cities more unequal?}\n\\label{sec:cities}\n\nThanks to the recent major contributions concerning inequality at national and international levels (for instance, see \\citep{stiglitz2012, piketty2013, atkinson2015}), we know that the uneven distribution of wealth and income among the members of a society is not neutral as this affects social equity,  social reproduction, and economic growth. We also know that the spatial concentration of the rich \\citep{pincon2010} and of the poor \\citep{wilson1987, glaeser2009, bischoff2013} in neighbourhoods and cities can produce self-reinforcing effects of economic, health, crime and education inequalities \\citep{blau1982, lynch1998, lobmayer2002, reardon2006, wilkinson2006, roscigno2006, manzo2010, aizer2014, dorling2014}. It has been reported elsewhere, generally in the USA, that larger cities are more segregated \\citep{logan2011, bischoff2013} and more unequal \\citep{glaeser2009, batty2015, sarkar2015}. Indeed, \\citet{eeckhout2014} suggest that the better performance of large cities has to do with a productive complementarity between high skilled workers and low skilled workers, resulting in a larger inequality of skills and larger nominal wages (although they show a constant average of skills and real wages with city size). However, we are still missing a comprehensive understanding of size effects on segregation and inequality that integrate with the heterogeneous structure of cities.  \n\n\n\n\n\\begin{figure*}\n \\begin{center}\n \\caption{Variations of the Gini index with city size and urban definition}\n  \\label{fig:scalinggini}\n\\includegraphics[width=0.7\\textwidth]{ScalingGini.png} \n  \\end{center}\n\\end{figure*}\n\n\n\\subparagraph{Inequality: } \nAs an aggregate measure of inequality, the Gini coefficient has the merit of being synthetic, scale-independent and largely comparable between distributions based on different numbers and categories. Moreover, it correlates closely with other measures of inequality in cities \\citep{glaeser2009} for which we have no information here. We have estimated Gini coefficients for wages and income from grouped data as in \\cite{fuller1979}: \n\n\n", "itemtype": "equation", "pos": 27909, "prevtext": "\nwhere {\\it b} represents a time dependent normalisation constant and {$\\beta$} the scaling exponent of the variable with the size $P_i$ of unit $i$; and \n\n\n", "index": 5, "text": "\\begin{align}\n\\label{eq:scalingensity}\n Y_i  &= c \\times D_i ^\\gamma \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Y_{i}\" display=\"inline\"><msub><mi>Y</mi><mi>i</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=c\\times D_{i}^{\\gamma}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mi>c</mi><mo>×</mo><msubsup><mi>D</mi><mi>i</mi><mi>γ</mi></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 44875, "prevtext": "\nwhere {\\it c} represents a time dependent normalisation constant and {$\\gamma$} the scaling exponent of the variable with density $D_i$ of unit $i$.\\\\\n\n\nWe interpret the value of the exponents {$\\beta$} and {$\\gamma$} by reference to 1 (the linear regime), as is common practice in urban scaling \\citep{pumain2004, bettencourt2007, arcaute2015}. In this case, an exponent equal to 1 represents the absence of economies of agglomeration. Exponents significantly greater than 1 (where the confidence interval does not intersect with the interval [0.95;1.05] for example in Figure \\ref{fig:vizExponents}) indicate economies of agglomeration, that is rising average income or wages with size or density (the superlinear regime), whereas an estimation with $\\beta$ or $\\gamma$ significantly less than 1 (the sub linear regime) suggests diseconomies of agglomeration.\\\\\n\nFigure \\ref{fig:vizExponents} and present the results obtained with the four geographical delineations (rows) and eight economic specifications (columns): the OLS regression is performed on wages or income, using the absolute population or its density, and considering the unit's population as the resident population or the referent population (which is jobs for wages and households for income). Therefore, by looking at rows in Figure \\ref{fig:vizExponents}, one can evaluate the sensitivity to economic specifications, whereas by looking at columns, the reader can see variations in estimations that depend only on the geographical delineation chosen (scale and 'urbanity'). The cells highlighted with letters correspond to estimations that can be compared with results from the literature.\\\\\n\nWe find that half of the estimations shown here (16 out of 32) give a linear relation between economic output and population (linear regime). Economies of agglomeration (superlinear) are found in 13 cases, and diseconomies (sublinear) in 3 cases, all at the most local level. Two of our estimations about cities in France are in agreement with similar estimations for UK cities where there are local economies of agglomeration in terms of wages with the resident population \\citep{glaeser2001} (comparable in scale and specifications to Cell A) and no superlinear scaling of income in metropolitan areas \\citep{arcaute2015} (Cell D). On the other hand, the absence of economies of agglomeration for wages with the total population that we find in metropolitan areas for France (Cell B) contradicts results usually produced for the USA \\citep{sveikauskas1975, glaeser2001, bettencourt2012}. Similarly, the regression of wages against residential density in NUTS 3 regions shows too high a variability to be considered significant in the linear regime in France (Cell C) whereas \\citet{ciccone2002} reports the existence of economies of agglomeration in European and American regions. \\\\\n\nThe referent population (i.e.: residents, households or jobs) plays a decisive role in estimation when considering the variation of wages with density. Indeed, jobs are spatially more concentrated than houses, and less ubiquitous. For all the other cases, this specification plays a negligible role. There appears to be more specification difference reported between regressions with the absolute population or with the density than between regressions of wages or of income. However, the two exponents $\\beta$ and $\\gamma$ are mathematically linked through the scaling of the urbanised area with population (cf. Appendix \\ref{app.ScalingDensityTotal}), and therefore their different values provide less information about possible economic mechanisms than about the way cities of different sizes sprawl in extent. On the contrary, differences between specifications based wages or income represent the two sides of wealth: its creation and its redistribution, and how these are not spatially equivalent.\\\\\n\nFinally, regarding the sensitivity of estimates to geographical specifications, we find the scale of analysis to be decisively important for the results obtained. We also find mixed evidence as to the 'urbanity' of economies of agglomeration. Looking at the scaling of wages with size for example (column 2), economies of agglomeration appear only for non-urban definitions! Indeed, partitions of the territory at the local (COM) and the regional (DEP) scales exhibit superlinear exponents (respectively 1.060 and 1.086, cf. Appendix \\ref{tab:scalingUAUwages}), whereas city cores (UU) and metropolitan areas (AU) produce exponents closer to 1 (respectively 1.037 and 1.024). Counter-intuitively then, only larger regions and small places are richer, not cities. We think this results from the inclusion of rural areas in the non-urban definitions. Therefore, the qualitative difference between urban and rural places (or regions) create this quantitative result, rather than a change in economic behaviour for spatial units of larger population. When we consider density (column 4), estimates significantly over 1 are obtained for the most local scales. This confirms the explanations involving local processes within the labour market (sharing, learning, matching) rather than those of residential 'sorting', because this only holds for high work densities in the city centres (and not with high residential densities with high levels of amenities). The opposite is true for the scaling of income with population (column 6): larger regions only (DEP) exhibit an exponent greater than 1. Finally, the only 'urban' manifestation of economies of agglomeration is unexpected and this is the relative concentration of income in cities of high residential density (column 8). This process concerns the city scale as it plays in the opposite way for local places (COM).\\\\\n\nTo conclude, economies of agglomeration on the production side are urban insofar as 'urban' refers to the dense productive areas of central cities, and on the consumption side insofar as 'urban' refers to large-scale integrated entities between cities and metropolitan areas. However, insofar as economies of agglomeration should derive from the absolute concentration of people and jobs, then they appear to be non-urban and are observed better at the regional scale.\n\n\n\n\n\n\\subsection{Are larger cities richer?}\n\\label{sec:system}\n\nTo disentangle the mixed conclusions about 'urban' economies of agglomerations we used a multiplicity of delineations of cities that allow for the exploration of intermediary situations to that of official definitions and proceed to a sensitivity analysis to three definitional criteria of cities: minimum density, minimum commuting flows and minimum population size. \n\n \\begin{figure}[H]\n \\begin{center}\n  \\caption{Examples of urban clusters definitions}\n  \\label{fig:ex}\n\\includegraphics[width=0.47\\textwidth]{clusterExamples.png}   \n    \\end{center}\n\\end{figure}\n\nUsing the algorithms developed by \\citet{arcaute2015}, we combined 39 density cutoffs, 21 flow cutoffs and 6 population cutoffs to build 4914 representations of the French system of cities, from the most restrictive delineation (cf. Appendix \\ref{fig:defs}, top right corner) of very dense centres with no functional periphery (close to local units or COM) to a very loose consideration of urban lifestyle that covers most of the French territory and thus close to a regional partition such as NUTS 3 or DEP (Figure \\ref{fig:defs}, bottom left). \n\n \\begin{figure}[H]\n \\begin{center}\n  \\caption{Synthetic urban clusters vs official definitions}\n  \\label{fig:corrDefs}\n\\includegraphics[width=0.28\\textwidth]{CorrDefs_clean.png}   \n    \\end{center}\n\n  \\end{figure}\n\nThe differences with the previous four definitions is that we can observe transitions of scaling behaviour for all three parameters that are easy to interpret, and thus control for the way people locate within cities. This answers our second research question. Figure \\ref{fig:ex} illustrates the fact that each change in the definitional criteria affects the resulting urban clusters generated, and hence the measured levels of urban population, wage and income which we use. For example, when the density cutoff increases from 5 to 20 residents per ha, the technological pole of Saclay is excluded from the Parisian city core. When the density cutoff decreases from 5 to 1, the urban cluster of Lille embraces most of the North region. Finally, the large unit of Fontainebleau (which has high income but is covered in forest land-use) is not attached to the Paris metropolitan area over the 55\\% flow cutoff. We finally see how the central and peripheral criteria affect in a somewhat different way dense agglomerations (like Lille for example) or suburban and smaller cities (such as Amiens). Figure \\ref{fig:corrDefs} illustrates the correlation between the standard and synthetic definitions\\footnote{The correlation analysis is performed at the level of the local units. If they belong to a cluster, for a given definition, they get the value 1, otherwise 0. The same process is done for UUs and AUs. At the regional level (DEP), all local units get the value 1, as the definition is a partition of the territory. Therefore a correlation of 1 means that all and only local units included in a city or a region are part of a cluster. A correlation of -1 on the other hand means that all and only local units included in a city or a region are not part of a cluster. For the CORINE raster dataset, the correlation is performed with the percentage of land use that is classified as 'urban' (111 + 112 in the 2006 land-use classification code).}.\\\\\n\nUrban cluster definitions with high density cutoffs ($> 5$ residents per ha) and high flow cutoffs (i.e. composed mostly of central dense local units) represent best the urban land use at the local unit level as given by satellite raster data\\footnote{From the CORINE LandCover 2006. A commune is labelled urban where the majority of its land-use is urban.}. The clusters that correspond best to standard City Cores (UU) have a minimum density cutoff ($< 4$ residents per ha) and a high flow cutoff ($> 70\\%$). At similar levels of density, the cluster equivalent for Metropolitan Areas (AU) are characterised by a lower flow cutoff, as this definition includes the suburban spaces of commuting populations. Finally, the large clusters produced by definitions involving low density cutoffs and low flow cutoffs get closer to the complete coverage of France, and therefore to the spatial definition of NUTS 3 units.\\\\\n\nWe regress total wages and income on the total and specific populations associated with wages and income, for each of the 4914 different definitions of cities. We relate the variations of the coefficients of the agglomeration economies with the definitional criteria of cities and the urban landscapes they correspond to by representing the value of coefficients by a colour and projecting this onto the definitional axes (density, flow and population cutoffs). Given the variety of definitional values that we take into account, we can trace the effect of these criteria on the estimation of the wage and income premium in French cities through heatmaps. Out of the 4914 regressions performed on 39 density cutoffs (criterion 1), 21 flow cutoffs (criterion 2) and 6 population cutoffs (criterion 3), we display only 3276 regressions in the following figures (4 heatmaps) by selecting 4 population cutoffs (no cutoff, 10, 20 and 50 thousand residents). The corresponding definitions are mapped in the same way as in Appendix \\ref{fig:defs}, that is with cities as high density kernels in the top right corner, loose centres at the top left corner, and extensive cities at the bottom left corner. Each square represents the value of the estimated coefficient of the regression on all urban clusters defined by the three criteria (Figure \\ref{fig:readHM}).\\\\\n\n\\begin{figure}[H]\n \\begin{center}\n  \\caption{A legend for the heatmaps of scaling exponents (Fig. \\ref{fig:scalingTotalDefinitions}-\\ref{fig:scalingseg})}\n  \\label{fig:readHM}\n\\includegraphics[width=0.4\\textwidth]{ReadHM.png}   \n    \\end{center}\n\\end{figure}\n\nWhen regressing the total wages and total income against total and specific populations (Figure \\ref{fig:scalingTotalDefinitions}), we find mostly linear to superlinear relations. The projection of the standard definitions onto the closest systematic definitions helps understand the results obtained above. Indeed, Metropolitan Areas (AU) appeared at an urban scale at which no significant agglomeration economies are measured ($0.95 \\leq \\beta \\leq 1.05$). This non-effect is also recorded for any definition when we regress the total wages by the number of workers at the workplace. For that matter, there are no values of parameters that enables us to observe agglomeration economies with this specification. Income begins to scale super-linearly with population at high density thresholds and for the upper part of the urban hierarchy only (where P $\\geq 20$). This means that the relative concentration of income in large aggregates of population is a phenomenon that plays out at the level of large city centres only (high density cutoffs and high commuting flows), suggesting a change in urban quality when cities grow to become metropolises. Finally, the measure of agglomeration economies through wages (against total population) appears to be the most sensitive to city delineations: size effects become rare when we measure them on urban clusters with a minimum population of 10,000 residents (a reasonable minimum size for a city). This remains for clusters that do not correspond to any conceptual urban definitions (bottom right corner) or any population cutoffs. In this case, the coefficients measured are relatively high (superior to 1.05 and 1.1), matching observations made with local and city core definitions (cf. Figure \\ref{fig:vizExponents}).\\\\\n\n\n\\begin{figure*}\n \\begin{center}\n  \\caption{Variations of scaling estimations with city definitions}\n  \\label{fig:scalingTotalDefinitions}\n\\includegraphics[width=0.7\\textwidth]{AggregatedWagesIncome.png} \n  \\end{center}\n\\end{figure*}\n\n\n\nTo conclude, larger cities tend to concentrate the jobs rather than higher wages. In terms of income, there are positive size effects in the most urban parts of the largest cities. Therefore, regarding our results for France, larger cities are not necessarily richer (this depends on the specification chosen) but the wealth produced in central cities 'circulates' \\cite{davezies2008} spatially and ends up more concentrated as income per capita in the largest cities than it was as wages per job. The location of households and jobs within the cities thus definitely matters when it comes to estimating economies of agglomeration. \n\n\n\n\n\n\n\\subsection{Are larger cities more unequal?}\n\\label{sec:cities}\n\nThanks to the recent major contributions concerning inequality at national and international levels (for instance, see \\citep{stiglitz2012, piketty2013, atkinson2015}), we know that the uneven distribution of wealth and income among the members of a society is not neutral as this affects social equity,  social reproduction, and economic growth. We also know that the spatial concentration of the rich \\citep{pincon2010} and of the poor \\citep{wilson1987, glaeser2009, bischoff2013} in neighbourhoods and cities can produce self-reinforcing effects of economic, health, crime and education inequalities \\citep{blau1982, lynch1998, lobmayer2002, reardon2006, wilkinson2006, roscigno2006, manzo2010, aizer2014, dorling2014}. It has been reported elsewhere, generally in the USA, that larger cities are more segregated \\citep{logan2011, bischoff2013} and more unequal \\citep{glaeser2009, batty2015, sarkar2015}. Indeed, \\citet{eeckhout2014} suggest that the better performance of large cities has to do with a productive complementarity between high skilled workers and low skilled workers, resulting in a larger inequality of skills and larger nominal wages (although they show a constant average of skills and real wages with city size). However, we are still missing a comprehensive understanding of size effects on segregation and inequality that integrate with the heterogeneous structure of cities.  \n\n\n\n\n\\begin{figure*}\n \\begin{center}\n \\caption{Variations of the Gini index with city size and urban definition}\n  \\label{fig:scalinggini}\n\\includegraphics[width=0.7\\textwidth]{ScalingGini.png} \n  \\end{center}\n\\end{figure*}\n\n\n\\subparagraph{Inequality: } \nAs an aggregate measure of inequality, the Gini coefficient has the merit of being synthetic, scale-independent and largely comparable between distributions based on different numbers and categories. Moreover, it correlates closely with other measures of inequality in cities \\citep{glaeser2009} for which we have no information here. We have estimated Gini coefficients for wages and income from grouped data as in \\cite{fuller1979}: \n\n\n", "index": 7, "text": "\\begin{align}\n\\label{eq:giniGroup}\nG_{LowerBound} = \\sum_{i = 1}^k (x_{i-1} y_i - x_i y_{i-1})\n  \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle G_{LowerBound}=\\sum_{i=1}^{k}(x_{i-1}y_{i}-x_{i}y_{i-1})\" display=\"inline\"><mrow><msub><mi>G</mi><mrow><mi>L</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>B</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover></mstyle><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>x</mi><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msub><mi>y</mi><mi>i</mi></msub></mrow><mo>-</mo><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\nwhere $k$ represents a group of income (or wages), $y_i$ is the cumulative proportion of income received by $x_i$, $x_i$ is the cumulative proportion of households earning $k$ or less (firms distributing average wages of $k$ or less) and $g =   \\sum_{i = 1}^k  \\frac{[(y_{i} - y_{i-1}) - ( r_{i-1} (x_{i} - x_{i-1})] [( r_{i} (x_{i} - x_{i-1}) - (y_{i} - y_{i-1})] }{r_i - r_{i-1}} $ with $r_i = \\frac{z_i * X_k}{Y_k}$, where $Y_k$ is the total income, $X_k$ is the total number of households and $z_i$ is the lower bound of the bracket $i$.  \\\\\n\n\n\nOne value of the Gini index was computed for each city of each city definition, based on the number of households (or firms) of each income (or wage) category and their aggregate income (or total wages) in the city in question. The value of the Gini index was then regressed against the log of population for all cities {\\it s} for a given city definition, as below:\n\n\n", "itemtype": "equation", "pos": 44985, "prevtext": "\n\n\n", "index": 9, "text": "\\begin{align} \\label{eq:giniGroup2} Gini = G_{LowerBound} + 0.5 g   \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Gini=G_{LowerBound}+0.5g\" display=\"inline\"><mrow><mrow><mi>G</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>i</mi></mrow><mo>=</mo><mrow><msub><mi>G</mi><mrow><mi>L</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>B</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>+</mo><mrow><mn>0.5</mn><mo>⁢</mo><mi>g</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n\nFigure \\ref{fig:scalinggini} shows the values of $\\alpha$ as a function of the three definitional criteria of cities. A first conclusion is that size is not sufficient to predict the level of inequality in cities. Indeed, the statistical fitness of the regression models for all the city definitions are quite weak. Typically, less than 20\\% of the variance of the Gini coefficients is 'explained' by the (logged) size of cities for definitions with low population cutoffs. For $P = 50$, most models 'explain' between 20 and 40\\% of the variation in wage inequality, but only half of the variations of income inequality. That being said, this picture is however clear: all regressions clearly give a positive estimate. This coefficient belongs to the interval [0 ; 0.05] for any definition and economic specification. When $\\alpha = 0.05$, inequality (the Gini Index) increases by $2^{0.05} = 3.5$ percentage points in a city twice as large. In other words, when there is a relation between size and inequality, it is always in the same direction: larger cities are slightly more unequal. The way one defines cities seems almost irrelevant with respect to this relation.\n\n\n\n\n\\subparagraph{Distribution: } \n\n\n\\begin{figure*}\n \\begin{center}\n  \\caption{Variations of scaling estimations for distributional groups with city definitions}\n  \\label{fig:scalingIncomeDistribution}\n  Number of Firms by mean {\\bf Wages} categories vs. Firms population\\\\\n  \n\\includegraphics[width=1\\textwidth]{DistributionWages_by_Ent.png}   \\\\\n\nNumber of Households by {\\bf Income} categories vs. Households population\\\\\n\n\\includegraphics[width=1\\textwidth]{DistributionIncome_by_Sum.png}   \\\\\n\n Income and wage distribution \\\\\n  \\begin{tabular}{|c|c|c|c|c|c|c|c|c|}\n\\hline\n\n  Group & 1&2&3&4&5&6&7&8 \\\\ \\hline\nIncome (k\\euro) & $0 - 10$ & $10 - 12$ & $12 - 15$  & $15 - 20$ & $20 - 30$& $30 - 50$& $50 - 100$& $> 100$   \\\\\nWages (k\\euro) & $10 - 15.7$ &  $15.7 - 16.8$ & $16.8 - 18.7$ &$18.7 - 21.9$   & $21.9 - 27.0$ & $27.0 - 36.8$& $36.8 - 63.8$ & $> 63.8$ \\\\  \\hline\n\\%& 24.0 & 6.1 & 9.8 & 16.1 & 17.9 & 16.3 & 7.9 & 2.0\\\\ \\hline\n  \\end{tabular}\n\\end{center}\n\\end{figure*}\n\n\nThe Gini coefficient does not say if this higher inequality in large cities comes from a pyramidal society, if the rich are richer and/or if the poor are poorer in the largest cities. In order to disaggregate the study, we look at the income and wage distributions and investigate the scaling properties of the 8 wage groups of firms and of the 8 income groups of households. As stated in section \\ref{sec:method}, the income partition is not ideal. The bounds are constrained by tax brackets and we have adapted them to represent the same share of firms in the case of wage data. Therefore, our income and wage groups are not significant by themselves but are at least comparable to one another. If larger cities are more unequal, we expect them to concentrate relatively more households in the low and/or high income groups (which would scale superlinearly), and firms of the low and/or high wage groups. By contrast, we expect middle-income and middle-wage groups to concentrate relatively in the smallest cities (and scale sublinearly). According to Figure \\ref{fig:scalingIncomeDistribution}, the larger the city, the larger the number of high-income earners and the number of high wages firms. This observation is ordered by wage and income group, so that the richer the household and the firm, the more probable it is to find it in a large city. Therefore the hypothesis of a more pyramidal structure of the larger urban societies would be rejected, as we find a changing mix of firms and households with city size that looks more like a translation in the scale of average income and wages rather than a polarisation. \\\\\n\nComparing patterns of income and wages, we find a dual scaling behaviour for firms, as the potential wage premia are entirely due to the top 10\\% of firms (classes 7 and 8)\\footnote{and even more for the top 2\\% of class 8}, which scale superlinearly. The 90\\% remaining firms are distributed proportionately with the firm population in all cities, whatever the city definition. This pattern could induce more inequality between firms in terms of mean wages within the largest cities, but also a great inequality between cities of different size. The picture is similar for the income distribution, although in metropolitan areas of over 20,000 residents ($P = 20$), the lower income earners seem to scale sublinearly, whereas the top 25\\% of households (class 6 to 8) scale super-linearly. This picture suggests that income inequality is a spatial phenomenon that is most striking at the national level between cities than within them, because households of similar income seem to concentrate in the same kinds of cities: small cities for the poorest, and large cities for the richest. \\\\\n\nFinally, there are two exceptions and interesting variations of scaling of distributional groups with respect to city definitions: first increases in superlinear exponents for the top income earners in the most urban parts of cities (when density, commuting integration and population minimum increases - corner top right of the heatmaps), second the sublinear scaling of top wages firms in city definitions with low minimum density and no population cutoff. On looking at these regressions and their residuals, they usually include urban clusters with very few firms. We therefore attribute the sublinearity to the artifact of a few top average wage firms such as high-tech firms which locate in small cities of industrial valleys (like Heuliez in Cerizay, providing 30 jobs assembling electric cars) or to  very small firms (hotels, helicopter tours, etc.) with part time employees in highly touristic areas (Corsica, Saint-Tropez, Morzine, etc.). Such businesses are clearly exceptions rather than the rule.\\\\\n\nA last interesting finding is that when we scale the total income and wages by group with total population, we find the same result, whereas when we scale the total income and wages by group with the population of the group, all relations are linear. Therefore the largest cities do not generate wage and income premia for the each distribution group \\citep{sarkar2015} but rather concentrate the richest income earners and firms.\n\n\n\n\n\\begin{figure*}\n \\begin{center}\n \\caption{Variations of the Segregation index with city size and urban definition}\n  \\label{fig:scalingseg}\n\\includegraphics[width=0.7\\textwidth]{ScalingSegregation.png}\n  \\end{center}\n\\end{figure*}\n\n\n\\subparagraph{Segregation: } A final way of looking at inequality in cities, along with the location of people and firms, is to look at the degree of the spatial segregation of economic groups within cities. Inequality and segregation are necessarily linked in the sense that if there were no economic inequality, there would be no economic segregation (or rather, it would be undefined). However, various spatial arrangements of economic agents are possible for the same level of inequality, depending on the growth of the housing market \\citep{watson2006}, their total population \\citep{bischoff2013} and/or their density profile \\citep{spielman2014}. The social impacts of spatial clustering and segregation is known as the 'neighbourhood effects', and is usually positive in rich neighbourhoods, and negative in poor ones. Therefore it is worth investigating if the level of economic segregation varies with the different spaces in cities, as well as with respect to their size so that we might target urban policies more efficiently.\\\\\n\nIncome segregation is a relatively recent development in the segregation literature, and probably because of this, the indexes used to measure it are usually taken from those developed to measure residential racial segregation (a qualitative differentiation). The ordinal nature of income and wage groups however calls for a specific set of measures, such as the ones developed by \\citet{reardon2009}. From this set, we chose the ordinal variation ratio index $R^O$ from equation \\ref{R}, which we interpret as the \"proportion of variation in a population that lies between, rather than within, organisational units\" \\citep[p. 150]{reardon2009}, in our case: the communes which compose the urban clusters. This measure does not depend on the overall inequality of each city, but only on the spatial distribution of groups present in the city.\n\n\n", "itemtype": "equation", "pos": 45982, "prevtext": "\nwhere $k$ represents a group of income (or wages), $y_i$ is the cumulative proportion of income received by $x_i$, $x_i$ is the cumulative proportion of households earning $k$ or less (firms distributing average wages of $k$ or less) and $g =   \\sum_{i = 1}^k  \\frac{[(y_{i} - y_{i-1}) - ( r_{i-1} (x_{i} - x_{i-1})] [( r_{i} (x_{i} - x_{i-1}) - (y_{i} - y_{i-1})] }{r_i - r_{i-1}} $ with $r_i = \\frac{z_i * X_k}{Y_k}$, where $Y_k$ is the total income, $X_k$ is the total number of households and $z_i$ is the lower bound of the bracket $i$.  \\\\\n\n\n\nOne value of the Gini index was computed for each city of each city definition, based on the number of households (or firms) of each income (or wage) category and their aggregate income (or total wages) in the city in question. The value of the Gini index was then regressed against the log of population for all cities {\\it s} for a given city definition, as below:\n\n\n", "index": 11, "text": "\\begin{align}\n\\label{eq:gini}\nGini_s = \\alpha * log(Population_s) + b + \\epsilon_s\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Gini_{s}=\\alpha*log(Population_{s})+b+\\epsilon_{s}\" display=\"inline\"><mrow><mrow><mi>G</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><msub><mi>i</mi><mi>s</mi></msub></mrow><mo>=</mo><mrow><mrow><mrow><mi>α</mi><mo>*</mo><mi>l</mi></mrow><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>P</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><msub><mi>n</mi><mi>s</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi>b</mi><mo>+</mo><msub><mi>ϵ</mi><mi>s</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n with: $i$ being a local unit that has a population $t_i$, and which composes a city cluster that has a population $T$, $v = \\frac{4}{K - 1} \\sum_j^{K-1}{c_j (1 - c_j)}$ and $v_i = \\frac{4}{K - 1} \\sum_j^{K-1}{c_{i,j} (1 - c_{i,j})}$. $K$ is the number of income (wage) groups $j$ and $c_j$ is the cumulative proportion of households (firms) which earn an income (distribute wages) of group $j$ or under.\\\\\n\nOne value of the segregation index was computed for each city of each city definition, based on the number of households (or firms) in each income (or wage) category in the local units composing the city in question. The value of the segregation index was then regressed against the log of population for all cities {\\it s} as below:\n\n\n", "itemtype": "equation", "pos": 54523, "prevtext": "\n\nFigure \\ref{fig:scalinggini} shows the values of $\\alpha$ as a function of the three definitional criteria of cities. A first conclusion is that size is not sufficient to predict the level of inequality in cities. Indeed, the statistical fitness of the regression models for all the city definitions are quite weak. Typically, less than 20\\% of the variance of the Gini coefficients is 'explained' by the (logged) size of cities for definitions with low population cutoffs. For $P = 50$, most models 'explain' between 20 and 40\\% of the variation in wage inequality, but only half of the variations of income inequality. That being said, this picture is however clear: all regressions clearly give a positive estimate. This coefficient belongs to the interval [0 ; 0.05] for any definition and economic specification. When $\\alpha = 0.05$, inequality (the Gini Index) increases by $2^{0.05} = 3.5$ percentage points in a city twice as large. In other words, when there is a relation between size and inequality, it is always in the same direction: larger cities are slightly more unequal. The way one defines cities seems almost irrelevant with respect to this relation.\n\n\n\n\n\\subparagraph{Distribution: } \n\n\n\\begin{figure*}\n \\begin{center}\n  \\caption{Variations of scaling estimations for distributional groups with city definitions}\n  \\label{fig:scalingIncomeDistribution}\n  Number of Firms by mean {\\bf Wages} categories vs. Firms population\\\\\n  \n\\includegraphics[width=1\\textwidth]{DistributionWages_by_Ent.png}   \\\\\n\nNumber of Households by {\\bf Income} categories vs. Households population\\\\\n\n\\includegraphics[width=1\\textwidth]{DistributionIncome_by_Sum.png}   \\\\\n\n Income and wage distribution \\\\\n  \\begin{tabular}{|c|c|c|c|c|c|c|c|c|}\n\\hline\n\n  Group & 1&2&3&4&5&6&7&8 \\\\ \\hline\nIncome (k\\euro) & $0 - 10$ & $10 - 12$ & $12 - 15$  & $15 - 20$ & $20 - 30$& $30 - 50$& $50 - 100$& $> 100$   \\\\\nWages (k\\euro) & $10 - 15.7$ &  $15.7 - 16.8$ & $16.8 - 18.7$ &$18.7 - 21.9$   & $21.9 - 27.0$ & $27.0 - 36.8$& $36.8 - 63.8$ & $> 63.8$ \\\\  \\hline\n\\%& 24.0 & 6.1 & 9.8 & 16.1 & 17.9 & 16.3 & 7.9 & 2.0\\\\ \\hline\n  \\end{tabular}\n\\end{center}\n\\end{figure*}\n\n\nThe Gini coefficient does not say if this higher inequality in large cities comes from a pyramidal society, if the rich are richer and/or if the poor are poorer in the largest cities. In order to disaggregate the study, we look at the income and wage distributions and investigate the scaling properties of the 8 wage groups of firms and of the 8 income groups of households. As stated in section \\ref{sec:method}, the income partition is not ideal. The bounds are constrained by tax brackets and we have adapted them to represent the same share of firms in the case of wage data. Therefore, our income and wage groups are not significant by themselves but are at least comparable to one another. If larger cities are more unequal, we expect them to concentrate relatively more households in the low and/or high income groups (which would scale superlinearly), and firms of the low and/or high wage groups. By contrast, we expect middle-income and middle-wage groups to concentrate relatively in the smallest cities (and scale sublinearly). According to Figure \\ref{fig:scalingIncomeDistribution}, the larger the city, the larger the number of high-income earners and the number of high wages firms. This observation is ordered by wage and income group, so that the richer the household and the firm, the more probable it is to find it in a large city. Therefore the hypothesis of a more pyramidal structure of the larger urban societies would be rejected, as we find a changing mix of firms and households with city size that looks more like a translation in the scale of average income and wages rather than a polarisation. \\\\\n\nComparing patterns of income and wages, we find a dual scaling behaviour for firms, as the potential wage premia are entirely due to the top 10\\% of firms (classes 7 and 8)\\footnote{and even more for the top 2\\% of class 8}, which scale superlinearly. The 90\\% remaining firms are distributed proportionately with the firm population in all cities, whatever the city definition. This pattern could induce more inequality between firms in terms of mean wages within the largest cities, but also a great inequality between cities of different size. The picture is similar for the income distribution, although in metropolitan areas of over 20,000 residents ($P = 20$), the lower income earners seem to scale sublinearly, whereas the top 25\\% of households (class 6 to 8) scale super-linearly. This picture suggests that income inequality is a spatial phenomenon that is most striking at the national level between cities than within them, because households of similar income seem to concentrate in the same kinds of cities: small cities for the poorest, and large cities for the richest. \\\\\n\nFinally, there are two exceptions and interesting variations of scaling of distributional groups with respect to city definitions: first increases in superlinear exponents for the top income earners in the most urban parts of cities (when density, commuting integration and population minimum increases - corner top right of the heatmaps), second the sublinear scaling of top wages firms in city definitions with low minimum density and no population cutoff. On looking at these regressions and their residuals, they usually include urban clusters with very few firms. We therefore attribute the sublinearity to the artifact of a few top average wage firms such as high-tech firms which locate in small cities of industrial valleys (like Heuliez in Cerizay, providing 30 jobs assembling electric cars) or to  very small firms (hotels, helicopter tours, etc.) with part time employees in highly touristic areas (Corsica, Saint-Tropez, Morzine, etc.). Such businesses are clearly exceptions rather than the rule.\\\\\n\nA last interesting finding is that when we scale the total income and wages by group with total population, we find the same result, whereas when we scale the total income and wages by group with the population of the group, all relations are linear. Therefore the largest cities do not generate wage and income premia for the each distribution group \\citep{sarkar2015} but rather concentrate the richest income earners and firms.\n\n\n\n\n\\begin{figure*}\n \\begin{center}\n \\caption{Variations of the Segregation index with city size and urban definition}\n  \\label{fig:scalingseg}\n\\includegraphics[width=0.7\\textwidth]{ScalingSegregation.png}\n  \\end{center}\n\\end{figure*}\n\n\n\\subparagraph{Segregation: } A final way of looking at inequality in cities, along with the location of people and firms, is to look at the degree of the spatial segregation of economic groups within cities. Inequality and segregation are necessarily linked in the sense that if there were no economic inequality, there would be no economic segregation (or rather, it would be undefined). However, various spatial arrangements of economic agents are possible for the same level of inequality, depending on the growth of the housing market \\citep{watson2006}, their total population \\citep{bischoff2013} and/or their density profile \\citep{spielman2014}. The social impacts of spatial clustering and segregation is known as the 'neighbourhood effects', and is usually positive in rich neighbourhoods, and negative in poor ones. Therefore it is worth investigating if the level of economic segregation varies with the different spaces in cities, as well as with respect to their size so that we might target urban policies more efficiently.\\\\\n\nIncome segregation is a relatively recent development in the segregation literature, and probably because of this, the indexes used to measure it are usually taken from those developed to measure residential racial segregation (a qualitative differentiation). The ordinal nature of income and wage groups however calls for a specific set of measures, such as the ones developed by \\citet{reardon2009}. From this set, we chose the ordinal variation ratio index $R^O$ from equation \\ref{R}, which we interpret as the \"proportion of variation in a population that lies between, rather than within, organisational units\" \\citep[p. 150]{reardon2009}, in our case: the communes which compose the urban clusters. This measure does not depend on the overall inequality of each city, but only on the spatial distribution of groups present in the city.\n\n\n", "index": 13, "text": "\\begin{align}\n\\label{R}\nR^O = \\sum_i{\\frac{t_i}{T * v} (v - v_i)} \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle R^{O}=\\sum_{i}{\\frac{t_{i}}{T*v}(v-v_{i})}\" display=\"inline\"><mrow><msup><mi>R</mi><mi>O</mi></msup><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder></mstyle><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi>t</mi><mi>i</mi></msub><mrow><mi>T</mi><mo>*</mo><mi>v</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>v</mi><mo>-</mo><msub><mi>v</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n\nFigure \\ref{fig:scalingseg} shows the values of $\\alpha$ as a function of our three definitional criteria of cities. A most unexpected result of this analysis is the decrease in wage segregation with size for the set of definitions with no population cutoff (the first heatmap on the left). Again, except for this case, the explanatory power of all the models is very low. For this one though, half of the value of the segregation index can be predicted by the number of firms in the city, no matter what the definition, and a larger number of firms leads to a lower level of wage segregation. The spatial segregation of average wages by firm decreases by up to 7 percentage points for a city twice as large. This means that there are larger variations of average wage between the firms of large cities than between the local units that compose them. In other words, the local mix of firms is more homogeneously representative of the whole in larger cities. This might derive from the very low number of firms in the smallest clusters, and the high possibility of being segregated: if two firms of two different wage group are in two different units, the segregation index equals 1. When small clusters are removed from the analysis, segregation of firms for the spatial equivalents of metropolitan areas increases with city size. \\\\\n\nIn terms of income, we find no conclusive size effects with respect to segregation. Except with very dense city core definitions (top right corners) and the equivalents for metropolitan areas, for which larger cities are slightly more segregated, we find elasticities close to 0 for all representations of the system of cities. Larger cities thus do not necessarily contain the greatest household segregation. This finding contradicts some of the evidence of increasing income  segregation with size in the US \\citep{jargowsky1996, watson2009, glaeser2009, reardon2011, bischoff2013}. This could be explained by cultural differences between the two countries (large American cities being more segregated than large French cities), by attributes that are very specific to the definition of metropolitan areas (as we see a positive elasticity in the area that correspond best to the delineation of AU in France), by the different indexes used or by the fact that homogeneously rich and homogeneously poor cities are less segregated \\citep{dabet2014}. The present data do no allow us to draw any conclusions about this matter.\n\n\n\n\n\\section{Conclusion}\n\nThere are a large diversity of theories and models concerning economies of agglomeration. A thorough evaluation of the sensitivity of empirical estimates to economic and geographic definitions can help us go beyond the mixed evidence reported (or censored in the case of negative results \\citep{melo2009}) in the literature, and possibly refute, corroborate and choose between competing and complementary models. In this paper, we have reviewed the different causal mechanisms leading to positive externalities of urban agglomeration. We then hypothesised how different geographical specifications might affect the estimation of wage and income premia, before posing our three key questions:\\\\\n\n{\\bf Are agglomeration economies specifically urban or do larger regions that include non-urban areas exhibit this behaviour too?} Evidence from French cities and non-urban partitions reveal that economic specifications are crucial to answering this question. Economies of agglomeration with absolute size appear higher at a regional (i.e. not specifically urban) scale, but there seems to be a local productive advantage to local concentration of workers and at an urban scale, income concentration with density. These results back up micro-behavioural hypotheses of better learning, sharing and matching in a dense working environment. Sorting seems more appropriate to describe residential location choices and the search for amenities in denser cities.\\\\\n\n{\\bf Does the location of economic agents within cities matter when measuring agglomeration economies?} Obviously, it does. The concentration of jobs relative to the spatial distribution of population explains most of the discrepancy between results obtained with different economic specifications. What is more is that size effects affect different spaces of cities and regions differently: large and dense city cores concentrate more income and more high-income earners as they grow in size, whereas income is proportional to the number of households in metropolitan areas. \\\\\n\n{\\bf Are larger cities richer and more unequal? } We asked implicitly in the title to this paper: how to define urban agglomerations if you wish to detect agglomeration economies? Based on the results reported in the paper, we find that built-up areas correspond to the delineation that produces the most distinct economies of agglomeration in the most consensual understanding of the term (higher wage output with working population density). The absolute size effect on income also happens for these kinds of dense city cores. But this comes with higher inequality, slightly higher income segregation, and it ignores the fact that the people working in the dense part of the city, generating economic output by interacting closely during the day, tend to commute from other parts of the city which are less efficient (in terms of economic output) and consume more infrastructure as they grow in size \\citep{cottineau2015}. \\\\\n\nWe think that it is important to take into account this spatial focus on income and wealth inequality, given its consequences for a city population's health, education, crime and equity, particularly in an era when inequality is increasing through  generations and over space, alongside the every greater polarisation of income in big cities.\\\\\n\n\\begin{center}\n\\large \\bf \\sc{Aknowledgements}\\\\\n\\end{center}\n\n\nThe authors acknowledge the funding the ERC Advanced Grants MECHANICITY (249393-ERC-2009-AdG) and GeoDiverCity (269826-ERC-2010-AdG) and thank Fabien Paulus for providing access to the CLAP database.\n \n\n\n\n\\begin{thebibliography}{74}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\bibitem[{Aizer and Currie(2014)}]{aizer2014}\nAizer, A., Currie, J., 2014. The intergenerational transmission of inequality:\n  {Maternal} disadvantage and health at birth. science 344~(6186), 856--861.\n\n\\bibitem[{Arcaute et~al.(2015)Arcaute, Hatna, Ferguson, Youn, Johansson, and\n  Batty}]{arcaute2015}\nArcaute, E., Hatna, E., Ferguson, P., Youn, H., Johansson, A., Batty, M., 2015.\n  Constructing cities, deconstructing scaling laws. Journal of The Royal\n  Society Interface 12~(102), 20140745.\n\n\\bibitem[{Arribas-Bel et~al.(2015)Arribas-Bel, Ramos, Sanz-Gracia, and\n  {others}}]{arribasbel2015}\nArribas-Bel, D., Ramos, A., Sanz-Gracia, F., 2015. The size\n  distribution of employment centers within the {US} {Metropolitan} {Areas}.\n  Environment and Planning B: Planning and Design 42~(1), 23--39.\n\n\\bibitem[{Atkinson(2015)}]{atkinson2015}\nAtkinson, A.~B., 2015. Inequality: {What} {Can} {Be} {Done}? Harvard University\n  Press.\n\n\\bibitem[{Batty(2015)}]{batty2015}\nBatty, M., 2015. Optimal cities, ideal cities. Environment and Planning B:\n  Planning and Design 42, 571--573.\n\n\\bibitem[{Baum-Snow and Pavan(2012)}]{baumsnow2012}\nBaum-Snow, N., Pavan, R., 2012. Understanding the {City} {Size} {Wage}\n  {Gap}. The Review of Economic Studies 79~(1), 88--127.\n\n\\bibitem[{Bettencourt(2013)}]{bettencourt2012}\nBettencourt, L.~M., 2013. The origins of scaling in cities. Science 340~(6139),\n  1438--1441.\n\n\\bibitem[{Bettencourt et~al.(2007)Bettencourt, Lobo, Helbing, K{\\\"u}hnert, and\n  West}]{bettencourt2007}\nBettencourt, L.~M., Lobo, J., Helbing, D., K{\\\"u}hnert, C., West, G.~B., 2007.\n  Growth, innovation, scaling, and the pace of life in cities. PNAS, 104~(17), 7301--7306.\n\n\\bibitem[{Bischoff and Reardon(2013)}]{bischoff2013}\nBischoff, K., Reardon, S.~F., 2013. Residential segregation by income,\n  1970-2009. Tech. rep., American Communities Project Brown University.\n\n\\bibitem[{Blau and Blau(1982)}]{blau1982}\nBlau, J.~R., Blau, P.~M., 1982. The cost of inequality: {Metropolitan}\n  structure and violent crime. American Sociological Review, 114--129.\n\n\\bibitem[{Bretagnolle et~al.(2002)Bretagnolle, Paulus, and\n  Pumain}]{bretagnolle2001}\nBretagnolle, A., Paulus, F., Pumain, D., 2002. Time and space scales for\n  measuring urban growth. Cybergeo: European Journal of Geography. \\url{https://cybergeo.revues.org/3790}\n\n\\bibitem[{Briant et~al.(2010)Briant, Combes, and Lafourcade}]{briant2010}\nBriant, A., Combes, P.~P., Lafourcade, M., 2010. Dots to boxes: {Do} the\n  size and shape of spatial units jeopardize economic geography estimations?\n  Journal of Urban Economics 67~(3), 287--302.\n\n\\bibitem[{Ciccone(2002)}]{ciccone2002}\nCiccone, A., 2002. Agglomeration effects in {Europe}. European Economic Review\n  46~(2), 213--227.\n\n\\bibitem[{Ciccone and Hall(1996)}]{ciccone1996}\nCiccone, A., Hall, R.~E., 1996. Productivity and the density of economic\n  activity. Tech. rep., National Bureau of Economic Research.\n\n\\bibitem[{Combes et~al.(2011)Combes, Duranton, and Gobillon}]{combes2011}\nCombes, P.-P., Duranton, G., Gobillon, L., 2011. The identification of\n  agglomeration economies. Journal of Economic Geography 11~(2), 253--266.\n\n\\bibitem[{Cottineau et~al.(2015)Cottineau, Hatna, Arcaute, and\n  Batty}]{cottineau2015}\nCottineau, C., Hatna, E., Arcaute, E., Batty, M., 2015. Paradoxical\n  {Interpretations} of {Urban} {Scaling} {Laws}. arXiv preprint\n  arXiv:1507.0787800000.\n\n\\bibitem[{Dabet and Floch(2014)}]{dabet2014}\nDabet, G., Floch, J.-M., 2014. La s{\\'e}gr{\\'e}gation spatiale dans les grandes\n  unit{\\'e}s urbaines de {France} m{\\'e}tropolitaine. {Une} approche par les\n  revenus. Documents de travail H 2014/01, INSEE, Paris.\n\n\\bibitem[{Davezies(2008)}]{davezies2008}\nDavezies, L., 2008. La {R{\\'e}publique} et ses territoires: la circulation\n  invisible des richesses. Seuil Paris.\n\n\\bibitem[{Davezies and Talandier(2014)}]{davezies2014}\nDavezies, L., Talandier, M., 2014. L'{\\'e}mergence de syst{\\`e}mes\n  productivo-r{\\'e}sidentiels. {Territoires} productifs, {Territoires}\n  r{\\'e}sidentiels : quelles interactions ? No.~19 in Commissariat\n  g{\\'e}n{\\'e}ral {\\`a} l'{\\'e}galit{\\'e} des territoires ({CGET}). La\n  Documentation fran{\\c c}aise, Paris.\n\n\\bibitem[{Dorling(2014)}]{dorling2014}\nDorling, D., 2014. Inequality and the 1\\%. Verso Books, London.\n\n\\bibitem[{Duranton and Puga(2004)}]{duranton2004}\nDuranton, G., Puga, D., 2004. Micro-foundations of urban agglomeration\n  economies. Handbook of regional and urban economics 4, 2063--2117.\n\n\\bibitem[{Eeckhout et~al.(2014)Eeckhout, Pinheiro, and\n  Schmidheiny}]{eeckhout2014}\nEeckhout, J., Pinheiro, R., Schmidheiny, K., 2014. Spatial sorting. Journal of\n  Political Economy 122~(3), 554--620.\n\n\\bibitem[{Fingleton(2006)}]{fingleton2006}\nFingleton, B., 2006. The new economic geography versus urban economics: an\n  evaluation using local wage rates in {Great} {Britain}. Oxford Economic\n  Papers 58~(3), 501--530.\n\n\\bibitem[{Fragkias et~al.(2013)Fragkias, Lobo, Strumsky, and\n  Seto}]{fragkias2013}\nFragkias, M., Lobo, J., Strumsky, D., Seto, K.~C., 2013. Does size matter?\n  {Scaling} of {CO} 2 emissions and {US} urban areas. PLoS ONE, 8(6): e64727. \n\n\\bibitem[{Fujita et~al.(2001)Fujita, Krugman, and Venables}]{fujita2001}\nFujita, M., Krugman, P.~R., Venables, A., 2001. The spatial economy: {Cities},\n  regions, and international trade. MIT press, Cambridge, MA.\n\n\\bibitem[{Fuller(1979)}]{fuller1979}\nFuller, M., 1979. The estimation of {Gini} coefficients from grouped data:\n  {Upper} and {Lower} {Bounds}. Economics Letters 3~(2), 187--192.\n\n\\bibitem[{Glaeser et~al.(2001)Glaeser, Kolko, and Saiz}]{glaeser2001}\nGlaeser, E.~L., Kolko, J., Saiz, A., 2001. Consumer city. Journal of economic\n  geography 1~(1), 27--50.\n\n\\bibitem[{Glaeser et~al.(2009)Glaeser, Resseger, and Tobio}]{glaeser2009}\nGlaeser, E.~L., Resseger, M., Tobio, K., 2009. Inequality in {Cities}. Journal\n  of Regional Science 49~(4), 617--646.\n\n\\bibitem[{Guilluy(2013)}]{guilluy2013}\nGuilluy, C., 2013. Fractures fran{\\c c}aises. Flammarion, Champs essais, Paris.\n\n\\bibitem[{Henderson(1986)}]{henderson1986}\nHenderson, J.~V., 1986. Efficiency of resource usage and city size. Journal of\n  Urban Economics 19~(1), 47--70.\n\n\\bibitem[{Henderson(2003)}]{henderson2003}\nHenderson, J.~V., Jan. 2003. Marshall's scale economies. Journal of Urban\n  Economics 53~(1), 1--28.\n\n\\bibitem[{Jargowsky(1996)}]{jargowsky1996}\nJargowsky, P.~A., 1996. Take the money and run: economic segregation in {US}\n  metropolitan areas. American sociological review, 984--998.\n\n\\bibitem[{Krugman(1996)}]{krugman1996}\nKrugman, P., 1996. Urban concentration: the role of increasing returns and\n  transport costs. International Regional Science Review 19~(1-2), 5--30.\n\n\\bibitem[{Lobmayer and Wilkinson(2002)}]{lobmayer2002}\nLobmayer, P., Wilkinson, R.~G., 2002. Inequality, residential segregation\n  by income, and mortality in {US} cities. Journal of Epidemiology and\n  Community Health 56~(3), 183--187.\n\n\\bibitem[{Logan(2011)}]{logan2011}\nLogan, J.~R., 2011. Separate and unequal: {The} neighborhood gap for blacks,\n  {Hispanics} and {Asians} in {Metropolitan} {America}. Project US2010 Report, Brown University,\n  1--22. \\url{http://www.s4.brown.edu/us2010/Data/Report/report0727.pdf}\n\n\\bibitem[{Lynch et~al.(1998)Lynch, Kaplan, Pamuk, Cohen, Heck, Balfour, and\n  Yen}]{lynch1998}\nLynch, J.~W., Kaplan, G.~A., Pamuk, E.~R., Cohen, R.~D., Heck, K.~E., Balfour,\n  J.~L., Yen, I.~H., 1998. Income inequality and mortality in metropolitan\n  areas of the {United} {States}. American Journal of Public Health 88~(7),\n  1074--1080.\n\n\\bibitem[{Manzo(2009)}]{manzo2010}\nManzo, G., 2009. La spirale des in{\\'e}galit{\\'e}s: choix scolaires en {France}\n  et en {Italie} au {XXe} si{\\`e}cle. Presses de l'Universit{\\'e}\n  Paris-Sorbonne, Paris.\n\n\\bibitem[{Marshall(1920)}]{marshall1920}\nMarshall, A., 1920. Principles of economics, 8th Edition. MacMillan, London.\n\n\\bibitem[{Martin(1999)}]{martin1999}\nMartin, R., 1999. The new 'geographical turn' in economics: some critical\n  reflections. Cambridge journal of Economics, 23 (1), 65--91.\n\n\\bibitem[{Melo et~al.(2009)Melo, Graham, and Noland}]{melo2009}\nMelo, P.~C., Graham, D.~J., Noland, R.~B., 2009. A meta-analysis of\n  estimates of urban agglomeration economies. Regional Science and Urban\n  Economics 39~(3), 332--342.\n\n\\bibitem[{Mera(1973)}]{mera1973}\nMera, K., Jan. 1973. On the {Urban} {Agglomeration} and {Economic}\n  {Efficiency}. Economic Development and Cultural Change 21~(2), 309--324.\n  \n\\bibitem[{Moomaw(1988)}]{moomaw1988}\nMoomaw, R.~L., 1988. Agglomeration economies: localization or urbanization?\n  Urban Studies 25~(2), 150--161, 00119.\n\n\\bibitem[{Moretti(2004)}]{moretti2004}\nMoretti, E., 2004. Human capital externalities in cities. Handbook of regional\n  and urban economics 4, 2243--2291.\n\n\\bibitem[{Mori and Smith(2015)}]{mori2015}\nMori, T., Smith, T.~E., 2015. On the spatial scale of industrial\n  agglomerations. Journal of Urban Economics 89, 1--20.\n\n\\bibitem[{Openshaw(1983)}]{openshaw1983}\nOpenshaw, S., 1983. The modifiable areal unit problem. Geo Books, Norwich.\n\n\\bibitem[{Openshaw and Taylor(1979)}]{openshaw1979}\nOpenshaw, S., Taylor, P.~J., 1979. A million or so correlation coefficients:\n  three experiments on the modifiable areal unit problem. In: Wrigley, N.\n  (Ed.), Statistical applications in the spatial sciences. 21. Pion,\n  London, 127--144.\n\n\\bibitem[{O'Sullivan(2004)}]{osullivan2004}\nO'Sullivan, D., 2004. Complexity science and human geography. Transactions of\n  the Institute of British Geographers 29~(3), 282--295.\n\n\\bibitem[{Parr(2007)}]{parr2007}\nParr, J.~B., 2007. Spatial definitions of the city: four perspectives. Urban\n  Studies 44~(2), 381--392.\n\n\\bibitem[{Piketty(2013)}]{piketty2013}\nPiketty, T., 2013. Le capital au {XXIe} si{\\`e}cle, Paris, Seuil. \n\n\\bibitem[{Pin{\\c c}on and Pin{\\c c}on-Charlot(2010)}]{pincon2010}\nPin{\\c c}on, M., Pin{\\c c}on-Charlot, M., 2010. Les ghettos du gotha. {\\'E}d.\n  du Seuil.\n\n\\bibitem[{Puga(2010)}]{puga2010}\nPuga, D., 2010. The {Magnitude} and {Causes} of {Agglomeration} {Economies}.\n  Journal of Regional Science 50~(1), 203--219.\n\n\\bibitem[{Pumain(2004)}]{pumain2004}\nPumain, D., 2004. Scaling laws and urban systems. Santa Fe Institute, Working\n  Paper n 04-02.\n\n\\bibitem[{Reardon(2006)}]{reardon2006}\nReardon, S.~F., 2006. A conceptual framework for measuring segregation and its\n  association with population outcomes. Methods in social epidemiology 1, 169-192.\n\n\\bibitem[{Reardon(2009)}]{reardon2009}\nReardon, S.~F., 2009. Measures of ordinal segregation. Research on Economic\n  Inequality 17~(1), 129--55.\n\n\\bibitem[{Reardon and Bischoff(2011)}]{reardon2011}\nReardon, S.~F., Bischoff, K., 2011. Income {Inequality} and {Income}\n  {Segregation}. American Journal of Sociology 116~(4), 1092--1153.\n\n\\bibitem[{Roscigno et~al.(2006)Roscigno, Tomaskovic-Devey, and\n  Crowley}]{roscigno2006}\nRoscigno, V.~J., Tomaskovic-Devey, D., Crowley, M., 2006. Education and the\n  inequalities of place. Social Forces 84~(4), 2121--2145.\n\n\\bibitem[{Rosenthal and Strange(2001)}]{rosenthal2001}\nRosenthal, S.~S., Strange, W.~C., 2001. The determinants of agglomeration.\n  Journal of Urban Economics 50~(2), 191--229.\n\n\\bibitem[{Rosenthal and Strange(2004)}]{rosenthal2004}\nRosenthal, S.~S., Strange, W.~C., 2004. Evidence on the nature and sources of\n  agglomeration economies. Handbook of regional and urban economics 4,\n  2119--2171.\n\n\\bibitem[{Rybski et~al.(2013)Rybski, Sterzel, Reusser, Winz, Fichtner, and\n  Kropp}]{rybski2013}\nRybski, D., Sterzel, T., Reusser, D.~E., Winz, A.-L., Fichtner, C., Kropp,\n  J.~P., 2013. Cities as nuclei of sustainability? arXiv preprint\n  arXiv:1304.4406.\n\n\\bibitem[{Sarkar et~al.(2015)Sarkar, Phibbs, Simpson, and Wasnik}]{sarkar2015}\nSarkar, S., Phibbs, P., Simpson, R., Wasnik, S., 2015. The scaling of income\n  inequality in cities. arXiv preprint arXiv:1509.00959.\n\n\\bibitem[{Spielman and Harrison(2014)}]{spielman2014}\nSpielman, S., Harrison, P., 2014. The {Co}-evolution of {Residential}\n  {Segregation} and the {Built} {Environment} at the {Turn} of the 20th\n  {Century}: {A} {Schelling} {Model}. Transactions in GIS 18~(1), 25--45.\n\n\\bibitem[{Stiglitz(2012)}]{stiglitz2012}\nStiglitz, J., 2012. The price of inequality. Penguin UK, 00007.\n\n\\bibitem[{Sveikauskas(1975)}]{sveikauskas1975}\nSveikauskas, L., 1975. The {Productivity} of {Cities}. The Quarterly\n  Journal of Economics 89~(3), 393--413.\n\n\\bibitem[{Terrier(1990)}]{terrier1990}\nTerrier, C., 1990. Les villes: toujours plus tertiaires. Economie et\n  statistique 230~(1), 47--54.\n\n\\bibitem[{Ullman(1941)}]{ullman1941}\nUllman, E., May 1941. A {Theory} of {Location} for {Cities}. American Journal\n  of Sociology 46~(6), 853--864.\n\n\\bibitem[{Watson(2006)}]{watson2006}\nWatson, T., 2006. Metropolitan {Growth}, {Inequality}, and {Neighborhood}\n  {Segregation} by {Income} [with {Comments}]. Brookings-Wharton Papers on\n  Urban Affairs, 1--52.\n\n\\bibitem[{Watson(2009)}]{watson2009}\nWatson, T., 2009. Inequality and the measurement of residential segregation by\n  income in {American} neighborhoods. Review of Income and Wealth 55~(3),\n  820--844.\n\n\\bibitem[{Wilkinson and Pickett(2006)}]{wilkinson2006}\nWilkinson, R.~G., Pickett, K.~E., 2006. Income inequality and population\n  health: a review and explanation of the evidence. Social Science \\& Medicine\n  62~(7), 1768--1784.\n\n\\bibitem[{Wilson(1987)}]{wilson1987}\nWilson, W.~J., 1987. The truly disadvantaged: {The} inner city, the underclass,\n  and public policy. University of Chicago Press.\n\n\\bibitem[{Wong(2004)}]{wong2004}\nWong, D.~W., 2004. Comparing {Traditional} and {Spatial} {Segregation}\n  {Measures}: {A} {Spatial} {Scale} {Perspective}. Urban Geography 25~(1),\n  66--82.\n\n\\bibitem[{Wong et~al.(1999)Wong, Lasus, and Falk}]{wong1999}\nWong, D. W.~S., Lasus, H., Falk, R.~F., 1999. Exploring the variability of\n  segregation index {D} with scale and zonal systems: an analysis of thirty\n  {US} cities. Environment and Planning A 31, 507--522.\n\\end{thebibliography}\n\\end{multicols}\n\n\n \\newpage\n\\LARGE \\centering Appendix\\\\\n\n\n\\setcounter{equation}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\setcounter{section}{0}\n\\makeatletter\n \n\n\\section{Overview of pre-defined spatial delineations}\n\\label{tab:4scales}\n\n\\begin{table}[H]\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\nSpatial def. & N & Area (ha): mean & [min;max] & Pop.: mean & [min;max] & Orders of magnitude\\\\ \\hline\nCOM & 36 546 & 2 553 & [1 ; 5 188] & 1 724 & [0 ; 2 249 975] & 6 \\\\\nUU & 2 233 & 8 414 & [4 ; 1 238 155] & 21 760 & [605 ; 10 516 110] & 5\\\\\nAU & 771 & 61 381 & [18 ; 4 877 170] & 69 295 & [2 169 ; 12 292 895]  & 4\\\\\nDEP & 96 & 972 529 & [77 ; 2 769 560] & 656 983 & [77 156 ; 2 579 208] & 2 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\\section{Mathematical link between Scaling with Total Population and Density}\n\\label{app.ScalingDensityTotal}\n\n\\small As the urban area usually scales with city size, we have a relation of the form:\n\n\n", "itemtype": "equation", "pos": 55345, "prevtext": "\n with: $i$ being a local unit that has a population $t_i$, and which composes a city cluster that has a population $T$, $v = \\frac{4}{K - 1} \\sum_j^{K-1}{c_j (1 - c_j)}$ and $v_i = \\frac{4}{K - 1} \\sum_j^{K-1}{c_{i,j} (1 - c_{i,j})}$. $K$ is the number of income (wage) groups $j$ and $c_j$ is the cumulative proportion of households (firms) which earn an income (distribute wages) of group $j$ or under.\\\\\n\nOne value of the segregation index was computed for each city of each city definition, based on the number of households (or firms) in each income (or wage) category in the local units composing the city in question. The value of the segregation index was then regressed against the log of population for all cities {\\it s} as below:\n\n\n", "index": 15, "text": "\\begin{align}\n\\label{eq:seg}\nR^O_s = \\alpha * log(Population_s) + b + \\epsilon_s\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle R^{O}_{s}=\\alpha*log(Population_{s})+b+\\epsilon_{s}\" display=\"inline\"><mrow><msubsup><mi>R</mi><mi>s</mi><mi>O</mi></msubsup><mo>=</mo><mrow><mrow><mrow><mi>α</mi><mo>*</mo><mi>l</mi></mrow><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>P</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><msub><mi>n</mi><mi>s</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi>b</mi><mo>+</mo><msub><mi>ϵ</mi><mi>s</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n {\\small where $A_i$ represents the urbanised area of city $i$}\\\\\n\nWe can relate the scaling equation of the variable $Y$ with total population and scaling with density by expressing $\\beta$ as a function of $\\alpha$ \\eqref{eq:scalingp} and $\\gamma$ \\eqref{eq:scalingensity}:\n\n\n", "itemtype": "equation", "pos": 76690, "prevtext": "\n\nFigure \\ref{fig:scalingseg} shows the values of $\\alpha$ as a function of our three definitional criteria of cities. A most unexpected result of this analysis is the decrease in wage segregation with size for the set of definitions with no population cutoff (the first heatmap on the left). Again, except for this case, the explanatory power of all the models is very low. For this one though, half of the value of the segregation index can be predicted by the number of firms in the city, no matter what the definition, and a larger number of firms leads to a lower level of wage segregation. The spatial segregation of average wages by firm decreases by up to 7 percentage points for a city twice as large. This means that there are larger variations of average wage between the firms of large cities than between the local units that compose them. In other words, the local mix of firms is more homogeneously representative of the whole in larger cities. This might derive from the very low number of firms in the smallest clusters, and the high possibility of being segregated: if two firms of two different wage group are in two different units, the segregation index equals 1. When small clusters are removed from the analysis, segregation of firms for the spatial equivalents of metropolitan areas increases with city size. \\\\\n\nIn terms of income, we find no conclusive size effects with respect to segregation. Except with very dense city core definitions (top right corners) and the equivalents for metropolitan areas, for which larger cities are slightly more segregated, we find elasticities close to 0 for all representations of the system of cities. Larger cities thus do not necessarily contain the greatest household segregation. This finding contradicts some of the evidence of increasing income  segregation with size in the US \\citep{jargowsky1996, watson2009, glaeser2009, reardon2011, bischoff2013}. This could be explained by cultural differences between the two countries (large American cities being more segregated than large French cities), by attributes that are very specific to the definition of metropolitan areas (as we see a positive elasticity in the area that correspond best to the delineation of AU in France), by the different indexes used or by the fact that homogeneously rich and homogeneously poor cities are less segregated \\citep{dabet2014}. The present data do no allow us to draw any conclusions about this matter.\n\n\n\n\n\\section{Conclusion}\n\nThere are a large diversity of theories and models concerning economies of agglomeration. A thorough evaluation of the sensitivity of empirical estimates to economic and geographic definitions can help us go beyond the mixed evidence reported (or censored in the case of negative results \\citep{melo2009}) in the literature, and possibly refute, corroborate and choose between competing and complementary models. In this paper, we have reviewed the different causal mechanisms leading to positive externalities of urban agglomeration. We then hypothesised how different geographical specifications might affect the estimation of wage and income premia, before posing our three key questions:\\\\\n\n{\\bf Are agglomeration economies specifically urban or do larger regions that include non-urban areas exhibit this behaviour too?} Evidence from French cities and non-urban partitions reveal that economic specifications are crucial to answering this question. Economies of agglomeration with absolute size appear higher at a regional (i.e. not specifically urban) scale, but there seems to be a local productive advantage to local concentration of workers and at an urban scale, income concentration with density. These results back up micro-behavioural hypotheses of better learning, sharing and matching in a dense working environment. Sorting seems more appropriate to describe residential location choices and the search for amenities in denser cities.\\\\\n\n{\\bf Does the location of economic agents within cities matter when measuring agglomeration economies?} Obviously, it does. The concentration of jobs relative to the spatial distribution of population explains most of the discrepancy between results obtained with different economic specifications. What is more is that size effects affect different spaces of cities and regions differently: large and dense city cores concentrate more income and more high-income earners as they grow in size, whereas income is proportional to the number of households in metropolitan areas. \\\\\n\n{\\bf Are larger cities richer and more unequal? } We asked implicitly in the title to this paper: how to define urban agglomerations if you wish to detect agglomeration economies? Based on the results reported in the paper, we find that built-up areas correspond to the delineation that produces the most distinct economies of agglomeration in the most consensual understanding of the term (higher wage output with working population density). The absolute size effect on income also happens for these kinds of dense city cores. But this comes with higher inequality, slightly higher income segregation, and it ignores the fact that the people working in the dense part of the city, generating economic output by interacting closely during the day, tend to commute from other parts of the city which are less efficient (in terms of economic output) and consume more infrastructure as they grow in size \\citep{cottineau2015}. \\\\\n\nWe think that it is important to take into account this spatial focus on income and wealth inequality, given its consequences for a city population's health, education, crime and equity, particularly in an era when inequality is increasing through  generations and over space, alongside the every greater polarisation of income in big cities.\\\\\n\n\\begin{center}\n\\large \\bf \\sc{Aknowledgements}\\\\\n\\end{center}\n\n\nThe authors acknowledge the funding the ERC Advanced Grants MECHANICITY (249393-ERC-2009-AdG) and GeoDiverCity (269826-ERC-2010-AdG) and thank Fabien Paulus for providing access to the CLAP database.\n \n\n\n\n\\begin{thebibliography}{74}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\bibitem[{Aizer and Currie(2014)}]{aizer2014}\nAizer, A., Currie, J., 2014. The intergenerational transmission of inequality:\n  {Maternal} disadvantage and health at birth. science 344~(6186), 856--861.\n\n\\bibitem[{Arcaute et~al.(2015)Arcaute, Hatna, Ferguson, Youn, Johansson, and\n  Batty}]{arcaute2015}\nArcaute, E., Hatna, E., Ferguson, P., Youn, H., Johansson, A., Batty, M., 2015.\n  Constructing cities, deconstructing scaling laws. Journal of The Royal\n  Society Interface 12~(102), 20140745.\n\n\\bibitem[{Arribas-Bel et~al.(2015)Arribas-Bel, Ramos, Sanz-Gracia, and\n  {others}}]{arribasbel2015}\nArribas-Bel, D., Ramos, A., Sanz-Gracia, F., 2015. The size\n  distribution of employment centers within the {US} {Metropolitan} {Areas}.\n  Environment and Planning B: Planning and Design 42~(1), 23--39.\n\n\\bibitem[{Atkinson(2015)}]{atkinson2015}\nAtkinson, A.~B., 2015. Inequality: {What} {Can} {Be} {Done}? Harvard University\n  Press.\n\n\\bibitem[{Batty(2015)}]{batty2015}\nBatty, M., 2015. Optimal cities, ideal cities. Environment and Planning B:\n  Planning and Design 42, 571--573.\n\n\\bibitem[{Baum-Snow and Pavan(2012)}]{baumsnow2012}\nBaum-Snow, N., Pavan, R., 2012. Understanding the {City} {Size} {Wage}\n  {Gap}. The Review of Economic Studies 79~(1), 88--127.\n\n\\bibitem[{Bettencourt(2013)}]{bettencourt2012}\nBettencourt, L.~M., 2013. The origins of scaling in cities. Science 340~(6139),\n  1438--1441.\n\n\\bibitem[{Bettencourt et~al.(2007)Bettencourt, Lobo, Helbing, K{\\\"u}hnert, and\n  West}]{bettencourt2007}\nBettencourt, L.~M., Lobo, J., Helbing, D., K{\\\"u}hnert, C., West, G.~B., 2007.\n  Growth, innovation, scaling, and the pace of life in cities. PNAS, 104~(17), 7301--7306.\n\n\\bibitem[{Bischoff and Reardon(2013)}]{bischoff2013}\nBischoff, K., Reardon, S.~F., 2013. Residential segregation by income,\n  1970-2009. Tech. rep., American Communities Project Brown University.\n\n\\bibitem[{Blau and Blau(1982)}]{blau1982}\nBlau, J.~R., Blau, P.~M., 1982. The cost of inequality: {Metropolitan}\n  structure and violent crime. American Sociological Review, 114--129.\n\n\\bibitem[{Bretagnolle et~al.(2002)Bretagnolle, Paulus, and\n  Pumain}]{bretagnolle2001}\nBretagnolle, A., Paulus, F., Pumain, D., 2002. Time and space scales for\n  measuring urban growth. Cybergeo: European Journal of Geography. \\url{https://cybergeo.revues.org/3790}\n\n\\bibitem[{Briant et~al.(2010)Briant, Combes, and Lafourcade}]{briant2010}\nBriant, A., Combes, P.~P., Lafourcade, M., 2010. Dots to boxes: {Do} the\n  size and shape of spatial units jeopardize economic geography estimations?\n  Journal of Urban Economics 67~(3), 287--302.\n\n\\bibitem[{Ciccone(2002)}]{ciccone2002}\nCiccone, A., 2002. Agglomeration effects in {Europe}. European Economic Review\n  46~(2), 213--227.\n\n\\bibitem[{Ciccone and Hall(1996)}]{ciccone1996}\nCiccone, A., Hall, R.~E., 1996. Productivity and the density of economic\n  activity. Tech. rep., National Bureau of Economic Research.\n\n\\bibitem[{Combes et~al.(2011)Combes, Duranton, and Gobillon}]{combes2011}\nCombes, P.-P., Duranton, G., Gobillon, L., 2011. The identification of\n  agglomeration economies. Journal of Economic Geography 11~(2), 253--266.\n\n\\bibitem[{Cottineau et~al.(2015)Cottineau, Hatna, Arcaute, and\n  Batty}]{cottineau2015}\nCottineau, C., Hatna, E., Arcaute, E., Batty, M., 2015. Paradoxical\n  {Interpretations} of {Urban} {Scaling} {Laws}. arXiv preprint\n  arXiv:1507.0787800000.\n\n\\bibitem[{Dabet and Floch(2014)}]{dabet2014}\nDabet, G., Floch, J.-M., 2014. La s{\\'e}gr{\\'e}gation spatiale dans les grandes\n  unit{\\'e}s urbaines de {France} m{\\'e}tropolitaine. {Une} approche par les\n  revenus. Documents de travail H 2014/01, INSEE, Paris.\n\n\\bibitem[{Davezies(2008)}]{davezies2008}\nDavezies, L., 2008. La {R{\\'e}publique} et ses territoires: la circulation\n  invisible des richesses. Seuil Paris.\n\n\\bibitem[{Davezies and Talandier(2014)}]{davezies2014}\nDavezies, L., Talandier, M., 2014. L'{\\'e}mergence de syst{\\`e}mes\n  productivo-r{\\'e}sidentiels. {Territoires} productifs, {Territoires}\n  r{\\'e}sidentiels : quelles interactions ? No.~19 in Commissariat\n  g{\\'e}n{\\'e}ral {\\`a} l'{\\'e}galit{\\'e} des territoires ({CGET}). La\n  Documentation fran{\\c c}aise, Paris.\n\n\\bibitem[{Dorling(2014)}]{dorling2014}\nDorling, D., 2014. Inequality and the 1\\%. Verso Books, London.\n\n\\bibitem[{Duranton and Puga(2004)}]{duranton2004}\nDuranton, G., Puga, D., 2004. Micro-foundations of urban agglomeration\n  economies. Handbook of regional and urban economics 4, 2063--2117.\n\n\\bibitem[{Eeckhout et~al.(2014)Eeckhout, Pinheiro, and\n  Schmidheiny}]{eeckhout2014}\nEeckhout, J., Pinheiro, R., Schmidheiny, K., 2014. Spatial sorting. Journal of\n  Political Economy 122~(3), 554--620.\n\n\\bibitem[{Fingleton(2006)}]{fingleton2006}\nFingleton, B., 2006. The new economic geography versus urban economics: an\n  evaluation using local wage rates in {Great} {Britain}. Oxford Economic\n  Papers 58~(3), 501--530.\n\n\\bibitem[{Fragkias et~al.(2013)Fragkias, Lobo, Strumsky, and\n  Seto}]{fragkias2013}\nFragkias, M., Lobo, J., Strumsky, D., Seto, K.~C., 2013. Does size matter?\n  {Scaling} of {CO} 2 emissions and {US} urban areas. PLoS ONE, 8(6): e64727. \n\n\\bibitem[{Fujita et~al.(2001)Fujita, Krugman, and Venables}]{fujita2001}\nFujita, M., Krugman, P.~R., Venables, A., 2001. The spatial economy: {Cities},\n  regions, and international trade. MIT press, Cambridge, MA.\n\n\\bibitem[{Fuller(1979)}]{fuller1979}\nFuller, M., 1979. The estimation of {Gini} coefficients from grouped data:\n  {Upper} and {Lower} {Bounds}. Economics Letters 3~(2), 187--192.\n\n\\bibitem[{Glaeser et~al.(2001)Glaeser, Kolko, and Saiz}]{glaeser2001}\nGlaeser, E.~L., Kolko, J., Saiz, A., 2001. Consumer city. Journal of economic\n  geography 1~(1), 27--50.\n\n\\bibitem[{Glaeser et~al.(2009)Glaeser, Resseger, and Tobio}]{glaeser2009}\nGlaeser, E.~L., Resseger, M., Tobio, K., 2009. Inequality in {Cities}. Journal\n  of Regional Science 49~(4), 617--646.\n\n\\bibitem[{Guilluy(2013)}]{guilluy2013}\nGuilluy, C., 2013. Fractures fran{\\c c}aises. Flammarion, Champs essais, Paris.\n\n\\bibitem[{Henderson(1986)}]{henderson1986}\nHenderson, J.~V., 1986. Efficiency of resource usage and city size. Journal of\n  Urban Economics 19~(1), 47--70.\n\n\\bibitem[{Henderson(2003)}]{henderson2003}\nHenderson, J.~V., Jan. 2003. Marshall's scale economies. Journal of Urban\n  Economics 53~(1), 1--28.\n\n\\bibitem[{Jargowsky(1996)}]{jargowsky1996}\nJargowsky, P.~A., 1996. Take the money and run: economic segregation in {US}\n  metropolitan areas. American sociological review, 984--998.\n\n\\bibitem[{Krugman(1996)}]{krugman1996}\nKrugman, P., 1996. Urban concentration: the role of increasing returns and\n  transport costs. International Regional Science Review 19~(1-2), 5--30.\n\n\\bibitem[{Lobmayer and Wilkinson(2002)}]{lobmayer2002}\nLobmayer, P., Wilkinson, R.~G., 2002. Inequality, residential segregation\n  by income, and mortality in {US} cities. Journal of Epidemiology and\n  Community Health 56~(3), 183--187.\n\n\\bibitem[{Logan(2011)}]{logan2011}\nLogan, J.~R., 2011. Separate and unequal: {The} neighborhood gap for blacks,\n  {Hispanics} and {Asians} in {Metropolitan} {America}. Project US2010 Report, Brown University,\n  1--22. \\url{http://www.s4.brown.edu/us2010/Data/Report/report0727.pdf}\n\n\\bibitem[{Lynch et~al.(1998)Lynch, Kaplan, Pamuk, Cohen, Heck, Balfour, and\n  Yen}]{lynch1998}\nLynch, J.~W., Kaplan, G.~A., Pamuk, E.~R., Cohen, R.~D., Heck, K.~E., Balfour,\n  J.~L., Yen, I.~H., 1998. Income inequality and mortality in metropolitan\n  areas of the {United} {States}. American Journal of Public Health 88~(7),\n  1074--1080.\n\n\\bibitem[{Manzo(2009)}]{manzo2010}\nManzo, G., 2009. La spirale des in{\\'e}galit{\\'e}s: choix scolaires en {France}\n  et en {Italie} au {XXe} si{\\`e}cle. Presses de l'Universit{\\'e}\n  Paris-Sorbonne, Paris.\n\n\\bibitem[{Marshall(1920)}]{marshall1920}\nMarshall, A., 1920. Principles of economics, 8th Edition. MacMillan, London.\n\n\\bibitem[{Martin(1999)}]{martin1999}\nMartin, R., 1999. The new 'geographical turn' in economics: some critical\n  reflections. Cambridge journal of Economics, 23 (1), 65--91.\n\n\\bibitem[{Melo et~al.(2009)Melo, Graham, and Noland}]{melo2009}\nMelo, P.~C., Graham, D.~J., Noland, R.~B., 2009. A meta-analysis of\n  estimates of urban agglomeration economies. Regional Science and Urban\n  Economics 39~(3), 332--342.\n\n\\bibitem[{Mera(1973)}]{mera1973}\nMera, K., Jan. 1973. On the {Urban} {Agglomeration} and {Economic}\n  {Efficiency}. Economic Development and Cultural Change 21~(2), 309--324.\n  \n\\bibitem[{Moomaw(1988)}]{moomaw1988}\nMoomaw, R.~L., 1988. Agglomeration economies: localization or urbanization?\n  Urban Studies 25~(2), 150--161, 00119.\n\n\\bibitem[{Moretti(2004)}]{moretti2004}\nMoretti, E., 2004. Human capital externalities in cities. Handbook of regional\n  and urban economics 4, 2243--2291.\n\n\\bibitem[{Mori and Smith(2015)}]{mori2015}\nMori, T., Smith, T.~E., 2015. On the spatial scale of industrial\n  agglomerations. Journal of Urban Economics 89, 1--20.\n\n\\bibitem[{Openshaw(1983)}]{openshaw1983}\nOpenshaw, S., 1983. The modifiable areal unit problem. Geo Books, Norwich.\n\n\\bibitem[{Openshaw and Taylor(1979)}]{openshaw1979}\nOpenshaw, S., Taylor, P.~J., 1979. A million or so correlation coefficients:\n  three experiments on the modifiable areal unit problem. In: Wrigley, N.\n  (Ed.), Statistical applications in the spatial sciences. 21. Pion,\n  London, 127--144.\n\n\\bibitem[{O'Sullivan(2004)}]{osullivan2004}\nO'Sullivan, D., 2004. Complexity science and human geography. Transactions of\n  the Institute of British Geographers 29~(3), 282--295.\n\n\\bibitem[{Parr(2007)}]{parr2007}\nParr, J.~B., 2007. Spatial definitions of the city: four perspectives. Urban\n  Studies 44~(2), 381--392.\n\n\\bibitem[{Piketty(2013)}]{piketty2013}\nPiketty, T., 2013. Le capital au {XXIe} si{\\`e}cle, Paris, Seuil. \n\n\\bibitem[{Pin{\\c c}on and Pin{\\c c}on-Charlot(2010)}]{pincon2010}\nPin{\\c c}on, M., Pin{\\c c}on-Charlot, M., 2010. Les ghettos du gotha. {\\'E}d.\n  du Seuil.\n\n\\bibitem[{Puga(2010)}]{puga2010}\nPuga, D., 2010. The {Magnitude} and {Causes} of {Agglomeration} {Economies}.\n  Journal of Regional Science 50~(1), 203--219.\n\n\\bibitem[{Pumain(2004)}]{pumain2004}\nPumain, D., 2004. Scaling laws and urban systems. Santa Fe Institute, Working\n  Paper n 04-02.\n\n\\bibitem[{Reardon(2006)}]{reardon2006}\nReardon, S.~F., 2006. A conceptual framework for measuring segregation and its\n  association with population outcomes. Methods in social epidemiology 1, 169-192.\n\n\\bibitem[{Reardon(2009)}]{reardon2009}\nReardon, S.~F., 2009. Measures of ordinal segregation. Research on Economic\n  Inequality 17~(1), 129--55.\n\n\\bibitem[{Reardon and Bischoff(2011)}]{reardon2011}\nReardon, S.~F., Bischoff, K., 2011. Income {Inequality} and {Income}\n  {Segregation}. American Journal of Sociology 116~(4), 1092--1153.\n\n\\bibitem[{Roscigno et~al.(2006)Roscigno, Tomaskovic-Devey, and\n  Crowley}]{roscigno2006}\nRoscigno, V.~J., Tomaskovic-Devey, D., Crowley, M., 2006. Education and the\n  inequalities of place. Social Forces 84~(4), 2121--2145.\n\n\\bibitem[{Rosenthal and Strange(2001)}]{rosenthal2001}\nRosenthal, S.~S., Strange, W.~C., 2001. The determinants of agglomeration.\n  Journal of Urban Economics 50~(2), 191--229.\n\n\\bibitem[{Rosenthal and Strange(2004)}]{rosenthal2004}\nRosenthal, S.~S., Strange, W.~C., 2004. Evidence on the nature and sources of\n  agglomeration economies. Handbook of regional and urban economics 4,\n  2119--2171.\n\n\\bibitem[{Rybski et~al.(2013)Rybski, Sterzel, Reusser, Winz, Fichtner, and\n  Kropp}]{rybski2013}\nRybski, D., Sterzel, T., Reusser, D.~E., Winz, A.-L., Fichtner, C., Kropp,\n  J.~P., 2013. Cities as nuclei of sustainability? arXiv preprint\n  arXiv:1304.4406.\n\n\\bibitem[{Sarkar et~al.(2015)Sarkar, Phibbs, Simpson, and Wasnik}]{sarkar2015}\nSarkar, S., Phibbs, P., Simpson, R., Wasnik, S., 2015. The scaling of income\n  inequality in cities. arXiv preprint arXiv:1509.00959.\n\n\\bibitem[{Spielman and Harrison(2014)}]{spielman2014}\nSpielman, S., Harrison, P., 2014. The {Co}-evolution of {Residential}\n  {Segregation} and the {Built} {Environment} at the {Turn} of the 20th\n  {Century}: {A} {Schelling} {Model}. Transactions in GIS 18~(1), 25--45.\n\n\\bibitem[{Stiglitz(2012)}]{stiglitz2012}\nStiglitz, J., 2012. The price of inequality. Penguin UK, 00007.\n\n\\bibitem[{Sveikauskas(1975)}]{sveikauskas1975}\nSveikauskas, L., 1975. The {Productivity} of {Cities}. The Quarterly\n  Journal of Economics 89~(3), 393--413.\n\n\\bibitem[{Terrier(1990)}]{terrier1990}\nTerrier, C., 1990. Les villes: toujours plus tertiaires. Economie et\n  statistique 230~(1), 47--54.\n\n\\bibitem[{Ullman(1941)}]{ullman1941}\nUllman, E., May 1941. A {Theory} of {Location} for {Cities}. American Journal\n  of Sociology 46~(6), 853--864.\n\n\\bibitem[{Watson(2006)}]{watson2006}\nWatson, T., 2006. Metropolitan {Growth}, {Inequality}, and {Neighborhood}\n  {Segregation} by {Income} [with {Comments}]. Brookings-Wharton Papers on\n  Urban Affairs, 1--52.\n\n\\bibitem[{Watson(2009)}]{watson2009}\nWatson, T., 2009. Inequality and the measurement of residential segregation by\n  income in {American} neighborhoods. Review of Income and Wealth 55~(3),\n  820--844.\n\n\\bibitem[{Wilkinson and Pickett(2006)}]{wilkinson2006}\nWilkinson, R.~G., Pickett, K.~E., 2006. Income inequality and population\n  health: a review and explanation of the evidence. Social Science \\& Medicine\n  62~(7), 1768--1784.\n\n\\bibitem[{Wilson(1987)}]{wilson1987}\nWilson, W.~J., 1987. The truly disadvantaged: {The} inner city, the underclass,\n  and public policy. University of Chicago Press.\n\n\\bibitem[{Wong(2004)}]{wong2004}\nWong, D.~W., 2004. Comparing {Traditional} and {Spatial} {Segregation}\n  {Measures}: {A} {Spatial} {Scale} {Perspective}. Urban Geography 25~(1),\n  66--82.\n\n\\bibitem[{Wong et~al.(1999)Wong, Lasus, and Falk}]{wong1999}\nWong, D. W.~S., Lasus, H., Falk, R.~F., 1999. Exploring the variability of\n  segregation index {D} with scale and zonal systems: an analysis of thirty\n  {US} cities. Environment and Planning A 31, 507--522.\n\\end{thebibliography}\n\\end{multicols}\n\n\n \\newpage\n\\LARGE \\centering Appendix\\\\\n\n\n\\setcounter{equation}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\setcounter{section}{0}\n\\makeatletter\n \n\n\\section{Overview of pre-defined spatial delineations}\n\\label{tab:4scales}\n\n\\begin{table}[H]\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\nSpatial def. & N & Area (ha): mean & [min;max] & Pop.: mean & [min;max] & Orders of magnitude\\\\ \\hline\nCOM & 36 546 & 2 553 & [1 ; 5 188] & 1 724 & [0 ; 2 249 975] & 6 \\\\\nUU & 2 233 & 8 414 & [4 ; 1 238 155] & 21 760 & [605 ; 10 516 110] & 5\\\\\nAU & 771 & 61 381 & [18 ; 4 877 170] & 69 295 & [2 169 ; 12 292 895]  & 4\\\\\nDEP & 96 & 972 529 & [77 ; 2 769 560] & 656 983 & [77 156 ; 2 579 208] & 2 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\\section{Mathematical link between Scaling with Total Population and Density}\n\\label{app.ScalingDensityTotal}\n\n\\small As the urban area usually scales with city size, we have a relation of the form:\n\n\n", "index": 17, "text": "\\begin{align}\n\\label{eq:scalingp}\n  A_i  = a \\times P_i ^\\alpha \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A_{i}=a\\times P_{i}^{\\alpha}\" display=\"inline\"><mrow><msub><mi>A</mi><mi>i</mi></msub><mo>=</mo><mrow><mi>a</mi><mo>×</mo><msubsup><mi>P</mi><mi>i</mi><mi>α</mi></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n {\\small with $b' = \\frac{c}{a^\\gamma}$ and $\\beta' = \\gamma (1 - \\alpha)$}.\\\\\n\nThis gives\n\n\n", "itemtype": "equation", "pos": 77044, "prevtext": "\n {\\small where $A_i$ represents the urbanised area of city $i$}\\\\\n\nWe can relate the scaling equation of the variable $Y$ with total population and scaling with density by expressing $\\beta$ as a function of $\\alpha$ \\eqref{eq:scalingp} and $\\gamma$ \\eqref{eq:scalingensity}:\n\n\n", "index": 19, "text": "\\begin{align*}\n  Y_i  &= c \\times D_i ^\\gamma \\\\\n    &= c \\times (\\frac{P_i}{A_i}) ^\\gamma \\\\\n    &= \\frac{c}{a^\\gamma}  \\times P_i ^{ \\gamma (1 - \\alpha)} \\\\\n    &= b' \\times P_i ^{\\beta'} \n    \\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Y_{i}\" display=\"inline\"><msub><mi>Y</mi><mi>i</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=c\\times D_{i}^{\\gamma}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mi>c</mi><mo>×</mo><msubsup><mi>D</mi><mi>i</mi><mi>γ</mi></msubsup></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=c\\times(\\frac{P_{i}}{A_{i}})^{\\gamma}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mi>c</mi><mo>×</mo><msup><mrow><mo stretchy=\"false\">(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>P</mi><mi>i</mi></msub><msub><mi>A</mi><mi>i</mi></msub></mfrac></mstyle><mo stretchy=\"false\">)</mo></mrow><mi>γ</mi></msup></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{c}{a^{\\gamma}}\\times P_{i}^{\\gamma(1-\\alpha)}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>c</mi><msup><mi>a</mi><mi>γ</mi></msup></mfrac></mstyle><mo>×</mo><msubsup><mi>P</mi><mi>i</mi><mrow><mi>γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=b^{\\prime}\\times P_{i}^{\\beta^{\\prime}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><msup><mi>b</mi><mo>′</mo></msup><mo>×</mo><msubsup><mi>P</mi><mi>i</mi><msup><mi>β</mi><mo>′</mo></msup></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05664.tex", "nexttext": "\n\nGiven the scaling of urban surface with population in French cities ($\\alpha_{UU}=0.856 [0.841;0.870], R^2=86.4\\%$, and $\\alpha_{AU}=0.888 [0.873;0.904], R^2=94.2\\%$) we expect to find $\\gamma > \\beta$, as found in Table \\ref{tab:scalingUAUwages} and Figure \\ref{fig:vizExponents}, consistently with \\eqref{eq:2}. \\\\\n\n\n\\section{Scaling estimations for official definitions}\n\\label{tab:scalingUAUwages}\n\n\\begin{table*}\nScaling of total wages with {\\bf population}\n\\begin{center}\n\\begin{tabular}{lclc|lclclclclclcl}\n\\hline\nSpatial def. & Reference & $\\beta$ & CI (95\\%)  & $R^2$ \\%    & n \\\\ \\hline\n\\multirow{2}{*}{COM*}      & Total Pop. & 1.428 & [1.420 ; 1.436] & 77.6 & 34969 \\\\\n\t\t\t & Total Jobs & 1.060 & [1.059 ; 1.061] & 99.0 & 34992 \\\\ \\hline\n\\multirow{2}{*}{UU}   & Total Pop.  & 1.160 & [1.136 ; 1.184] & 79.7 & 2233 \\\\\n                          & Total Jobs & 1.037 & [1.034 ; 1.041] & 99.3 & 2233 \\\\\\hline\n\\multirow{2}{*}{AU}      & Total Pop.  & 0.954 & [0.935 ; 0.973] & 92.9 & 771  \\\\\n\t\t\t & Total Jobs & 1.024 & [1.019 ; 1.027] & 99.7 & 771 \\\\\\hline\n\\multirow{2}{*}{DEP}      & Total Pop.  & 1.122 & [1.068 ; 1.177] & 94.7 & 96  \\\\\n\t\t\t & Total Jobs & 1.086 & [1.070 ; 1.103] & 99.4 & 96 \\\\\\hline\n \\end{tabular}\n\\end{center}\nScaling of total wages with {\\bf density}\n\\begin{center}\n\\begin{tabular}{lclclclclclcl}\n\\hline\nSpatial def. & Reference & $\\gamma$ & CI (95\\%)  & $R^2$ \\%    & n \\\\ \\hline\n\t\\multirow{2}{*}{COM}& Total Density & 0.798 & [0.769 ; 0.826] & 11.7 & 22775 \\\\\n\t\t\t& Job Density & 1.137 &[1.126 ; 1.149] & 62.0 & 22788  \\\\ \\hline\n\\multirow{2}{*}{UU}  & Total Density & 1.175 & [1.037 ; 1.313] & 11.1 & 2232  \\\\\n\t\t\t & Job Density & 1.360 & [1.303 ; 1.417] & 49.7 & 2232 \\\\ \\hline\n\t\\multirow{2}{*}{AU}& Total Density & 1.748 & [1.494 ; 2.003] & 19.1 & 771 \\\\\n\t\t\t & Job Density & 1.037 & [0.831 ; 1.242] & 11.3 & 771  \\\\ \\hline\n\\multirow{2}{*}{DEP} & Total Density & 1.191 & [0.869 ; 1.512] & 36.5 & 96 \\\\\n\t\t\t & Job Density & 1.006 &[0.743 ; 1.269] & 38.0 & 96 \\\\ \\hline\n\\end{tabular}\n\\end{center}\nScaling of total income with {\\bf population}\n\\begin{center}\n\\begin{tabular}{lclc|lclclclclclcl}\n\\hline\nSpatial def. & Reference & $\\beta$ & CI (95\\%)  & $R^2$ \\%    & n \\\\ \\hline\n\\multirow{2}{*}{COM}      & Total Pop. & 1.043 & [1.041 ; 1.044] & 97.6 & 36437 \\\\\n\t\t\t & Households Pop. & 1.043 & [1.041 ; 1.045] & 97.1 & 36457 \\\\ \\hline\n\\multirow{2}{*}{UU}   & Total Pop.  & 1.008 & [1.001 ; 1.015] & 97.1 & 2233 \\\\\n                          & HH Pop. & 0.989 & [0.981 ; 0.997] & 96.4 & 2233 \\\\\\hline\n\\multirow{2}{*}{AU}      & Total Pop.  & 1.031 & [1.024 ; 1.038] & 99.1 & 771  \\\\\n\t\t\t & HH Pop. & 1.040 & [1.035 ; 1.046] & 99.4 & 771 \\\\\\hline\n\\multirow{2}{*}{DEP}      & Total Pop.  & 1.095 & [1.065 ; 1.124] & 98.3 & 96  \\\\\n\t\t\t & HH Pop. & 1.115 & [1.085 ; 1.144] & 98.4 & 96 \\\\\\hline\n \\end{tabular}\n\\end{center}\nScaling of total income with {\\bf density}\n\\begin{center}\n\\begin{tabular}{lclclclclclcl}\n\\hline\nSpatial def. & Reference & $\\gamma$ & CI (95\\%)  & $R^2$ \\%    & n \\\\ \\hline\n\\multirow{2}{*}{COM}      & Total Density. & 0.621 & [0.604 ; 0.639] & 17.5 & 22995 \\\\\n\t\t\t & HH Density & 0.634 & [0.617 ; 0.652] & 18.0 & 23005 \\\\ \\hline\n\\multirow{2}{*}{UU}   & Total Density  & 1.000 & [0.893 ; 1.108] & 13.0 & 2232 \\\\\n                          & HH Density & 1.164 & [1.055 ; 1.272] & 16.5 & 2232 \\\\\\hline\n\\multirow{2}{*}{AU}      & Total Density  & 1.748 & [1.479 ; 2.018] & 17.4 & 771  \\\\\n\t\t\t & HH Density & 1.866 & [1.580 ; 2.153] & 17.5 & 771 \\\\\\hline\n\\multirow{2}{*}{DEP}      & Total Density  & 1.045 & [0.723 ; 1.367] & 30.6 & 96  \\\\\n\t\t\t & HH Density & 0.980 & [0.652 ; 1.308] & 27.2 & 96 \\\\\\hline\n \\end{tabular}\n\\end{center}\n\\small *COM stands for {\\it communes}, the French local spatial units, UU for {\\it Unit\\'{e}s Urbaines} (the definition of City Cores), AU for {\\it Aires Urbaines} (Metropolitan Areas) and DEP for the NUTS 3 level ({\\it D{\\'e}partements}).\\\\\n\\end{table*}\n\n\\newpage\n\\section{Multiple Representation of the French system of Cities}\n      \\label{fig:defs}\n \\begin{figure}[H]\n \\begin{center}\n \\begin{minipage}[b]{\\textwidth}\n \\includegraphics[width=\\textwidth]{frenchDefs.png}\nP, the population minimum, is here set to 0. D is the minimum density of residents per ha to define urban centres (in red). C indicates the share of Commuters (in \\%) living in the periphery and working in the density-based urban cluster (in green). Aggregation performed using the 2013 GeoFla geometry of communes. \\url{https://www.data.gouv.fr/fr/datasets/geofla-communes/}\n    \\end{minipage}\n    \\end{center}\n\\end{figure}\n\n\n\n", "itemtype": "equation", "pos": 77344, "prevtext": "\n {\\small with $b' = \\frac{c}{a^\\gamma}$ and $\\beta' = \\gamma (1 - \\alpha)$}.\\\\\n\nThis gives\n\n\n", "index": 21, "text": "\\begin{align}\n\\label{eq:diff}\n\\alpha > 1 \\iff \\gamma < \\beta \\\\\n\\label{eq:2}\n\\alpha < 1 \\iff \\gamma > \\beta \\\\\n\\alpha = 1 \\iff \\gamma = \\beta \n    \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\alpha&gt;1\\iff\\gamma&lt;\\beta\" display=\"inline\"><mrow><mrow><mi>α</mi><mo>&gt;</mo><mn>1</mn></mrow><mo>⇔</mo><mrow><mi>γ</mi><mo>&lt;</mo><mi>β</mi></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\alpha&lt;1\\iff\\gamma&gt;\\beta\" display=\"inline\"><mrow><mrow><mi>α</mi><mo>&lt;</mo><mn>1</mn></mrow><mo>⇔</mo><mrow><mi>γ</mi><mo>&gt;</mo><mi>β</mi></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\alpha=1\\iff\\gamma=\\beta\" display=\"inline\"><mrow><mrow><mi>α</mi><mo>=</mo><mn>1</mn></mrow><mo>⇔</mo><mrow><mi>γ</mi><mo>=</mo><mi>β</mi></mrow></mrow></math>", "type": "latex"}]