[{"file": "1601.02663.tex", "nexttext": "\nwhere $\\epsilon_{0}$ stands for the phonon energy in the absence of magnetic field, $\\lambda$ is the electron-phonon coupling parameter, and $T_{k}=v_{f}\\sqrt{2e\\hbar B} \\left( \\sqrt{k} + \\sqrt{k+1} \\right)$ describes the energy of interband LL transitions, with index $k$, for $\\left| n \\right| - \\left| m \\right| = 1$, in which $n$ and $m$ are labels for the initial and final Landau levels involved in the transition. $\\delta_k$ represents the LL broadening parameter, which is of particular significance to the present work. The real and complex parts of $\\widetilde{\\epsilon}=\\epsilon-\\imath \\Gamma$ yield the phonon energy and broadening from the electron-phonon coupling, respectively. Comparison between Eq. \\ref{eq1} and the $E_{2g}$ phonon energy and linewidth experimentally obtained as a function of magnetic field allows one to extract sample-related parameters such as $v_F$, $\\lambda$ and $\\delta_k$.\n\n\n\\begin{figure}\n\\includegraphics[width=0.6\\textwidth]{SiCsp.eps}\n\\includegraphics[width=0.55\\textwidth]{SiCsp-B.eps}\n\\includegraphics[width=0.6\\textwidth]{SiC-xc-w.eps}\n\\caption{\\label{MEG} (a) Raman spectra of multilayer epitaxial graphene on SiC at 5.5 K and zero field. The characteristic graphene $D$, $G$, and $2D$ bands are indicated. The peak at $\\sim 1555$~cm$^{-1}$ is a spurious signal due to parasitic scattering in the optical fiber. (b) G-band at selected magnetic fields and $T=5.5$ K; points represent experimental data and solid lines are lorentzian curve fittings. (c) $E_{2g}$ phonon energy and full width at half maximum (FWHM) as a function of magnetic field; empty and filled circles represents two sets of data, taken on different spots of the sample, both showing a graphene-like single-peaked $2D$ band; solid lines represents a simulation according to Eq.~\\ref{eq1} using a single Landau level width $\\delta = 17.6$ meV for all inter-LL transitions.}\n\\end{figure}\n\n\n\n\n\nWe first investigate the multilayer epitaxial graphene sample on SiC. Such samples are known to present weak electronic coupling between graphene layers \\cite{FaugerasAPL}, also showing very small carrier concentrations of the order of $10^{10}$ cm$^{-2}$ or lower \\cite{SadowskiIR,OrlitaIR}. Sample regions showing graphene-like Raman spectra with sharpest $2D$ bands were chosen for our study. Figure ~\\ref{MEG}(a) shows the overall Raman spectrum at 5 K, showing the characteristic $D$, $G$ and $2D$ bands. The Raman spectra of this sample nearby the $E_{2g}$ mode ($G$-band) are displayed in Fig.~\\ref{MEG}(b) for selected applied magnetic fields, revealing a clear $B$-sensitivity. Single-lorentzian fits were performed (solid lines in Fig.~\\ref{MEG}(b)) and the peak energy and linewidth (FWHM) were extracted for two sets of data obtained at distinct spot positions on the sample, yielding reproducible oscillations with field that are signatures of the magneto-phonon resonance in graphene \\cite{faugerasfit} (see Fig.~\\ref{MEG}(c)). Excellent match with experimental data is obtained if Eq.~\\ref{eq1} is employed with the parameters $\\epsilon_0=1581.7\\:$~cm$^{-1}$, $v_{f}=0.985\\times10^{6}\\:$m/s, $\\lambda=4.1\\times10^{-3}$, and $\\delta_k =17.6$ meV for all $k$ (see solid lines in Fig. \\ref{MEG}(c)). A constant phonon linewidth contribution $\\Gamma_{0}=8.2\\:$~cm$^{-1}$, attributed to phonon decay processes not related to the electron-phonon coupling, was convoluted with $\\Gamma$ to model the total $B$-dependent linewidth of the $G-$band. Overall, the extracted parameters are comparable to those previously reported for another multilayer epitaxial graphene sample \\cite{faugerasfit}.\n\n\n\n\\begin{figure}\n  \\includegraphics[width=0.5\\textwidth]{SLG2a.eps}\n\t\\includegraphics[width=0.6\\textwidth]{SLGsp.eps}\n\t\\includegraphics[width=0.6\\textwidth]{SLGspb.eps}\n\\caption{\\label{SLG} (a) Optical image  of our exfoliated graphene sample, obtained using an orange filter. The blue circle indicates the approximate dimension and position of the laser spot focused into the single-layer graphene (SLG) region. (b) Raman spectrum of the SLG region at room temperature. The $G$ and $2D$ bands are observed at 1584 and 2694 cm$^{-1}$ with full widths at half maxima of 14.3(9) and 25.4(3) cm$^{-1}$, respectively. The $2D/G$ peak area and peak heigth ratios are 7.2(5) and 4.1(3), respectively. (c) G-band of the SLG sample at $T=2$ K and various magnetic fields. Solid lines in (b) and (c) are lorentzian fits to the observed peaks.}\n\\end{figure}\n\nWe proceed to the investigation of single-layer exfoliated graphene deposited on SiO$_2$. Figure \\ref{SLG}(a) shows the optical image of this sample. Figure \\ref{SLG}(b) shows the overall Raman spectrum at room temperature with the characteristic $G$ and $2D$ bands and no sign of the defect-activated $D$-band. This result indicates absence of a significant level of structural defects such as atomic vacancies or impurities. A combined analysis of the peak intensities \\cite{Das}, areas \\cite{Basko}, positions and linewidths \\cite{Das,Pisana} of the $G$- and $2D$- bands extracted from the room-temperature Raman spectrum reveals an electrically neutral graphene within our resolution ($n_0=0 \\pm 1 \\times 10^{12}$ cm$^{-2}$). The $G$-band Raman spectrum for selected magnetic fields and $T=5$ K is displayed in Fig. \\ref{SLG}(c). This band clearly splits in two peaks above $\\sim 12$ T, in line with previous reports \\cite{kim2013filling,Remi}. Figure \\ref{SLGB} shows the position of the $G$-band at 5 K as a function of magnetic field. For $B \\lesssim 12$ T, where a single $G$-band was observed within our resolution, no magnetophonon resonance could be detected, in contrast to the multilayer epitaxial sample. For $B>12$ T, one of the components of the splitted $G-$band remain at a nearly constant energy position, while a second component follows a pre-resonant behavior associated with the $k=1$ ($n=0 \\leftrightarrow \\pm 1$) inter-Landau level transitions at $B_{res}^{k=1}=25-30$ T \\cite{kim2013filling}. Note that the peak position of this field-dependent component follows a similar behavior found for the multilayer epitaxial graphene in the higher-field regime above 12 T (see also Fig. \\ref{MEG}(c)). It is therefore evident from our results and from the literature \\cite{kim2013filling,Remi} that single layer graphene on SiO$_2$ is inhomogeneous and regions with two distinct behavious are found within probed areas of a few $\\mu$m$^{2}$: (i) regions showing no observable magnetophonon resonance at all and (ii) regions showing clear manifestations of the main $k=0$ resonance.\n\n\\begin{figure}\n\t\\includegraphics[width=0.8\\textwidth]{SLG-sim.eps}\t\n\\caption{\\label{SLGB} $G-$band central positions for the single layer graphene sample, obtained by fits using a single lorentzian below 12 T and two lorentzians above 12 T (see also Fig. \\ref{SLG}(c)). The grey area marks an intemediate field region where a single peak was employed in the fit although a double peak structure, not resolved in our data, is likely to be present. Circles and triangles refer to datasets taken on two independent runs. The results for the $B$-dependent component above 12 T are given as open symbols. Dashed green and dotted blue lines are the simulated magnetophonon resonance effect according to Eq. \\ref*{eq1} using fixed Landau level broadening parameters $\\delta=13.6$ and 63 meV, respectively. The inset shows the $B-$dependence of the full width at half maxima for the two peaks observed above 12 T (symbols). The solid red lines in the main panel and in the inset are the results of a simulation using Eq. \\ref*{eq1} with $\\delta$ parameter dependent on $B$  using $\\Delta B=1.7$~T and $\\Delta v_F/v_F=0.032$ (see text).}\n\\end{figure}\n\nInsight into the observed behavior of the $G$-band with field for single-layer exfoliated graphene on SiO$_2$ is gained by an analysis of Eq. \\ref{eq1} as a function of the $\\delta_k$ parameters related to the LL transition widths. The dashed and dotted lines in Fig. \\ref{SLGB} show the calculated $B$-dependence of the $G$-band central wavenumber for two selected values of $\\delta$, assumed so far to be the same for all transition indexes $k$. In these simulations, the parameters $\\epsilon_0=1582\\:$~cm$^{-1}$, $v_{f}=1.15\\times10^{6}\\:$m/s, $\\lambda=5.5\\times10^{-3}$ were employed. For $\\delta=13.6$ meV, the high-field pre-resonant behavior observed for one of the $G-$band components is captured. However, if the same \n$\\delta$ is used for the other LL transitions, the resonance at 3.8 T associated to the $n=-1 \\rightarrow 2$ and $n=-2 \\rightarrow 1$ LL transitions remains proeminent and would be clearly visible within our resolution. If, on the other hand, a much larger $\\delta=63$ meV is employed in the simulations, all the magnetophonon resonances are washed out, including the observed pre-resonant behavior in the field range $B>$12 T. We conclude that, while the $B-$independent component of the $G-$band observed in single-layer graphene on SiO$_2$ may be attributed to sample regions showing a very large $\\delta$ value, the behavior observed for the $B-$dependent $G-$band component cannot be explained by single-$\\delta$ magnetophonon resonances. In fact, a much larger $\\delta_k$ for the low-field resonances ($k \\geq 2$) with respect to the main one ($k=$1) is necessary for Eq. \\ref*{eq1} to capture the observed behavior of the $B-$dependent $G$-band component of our single-layer graphene sample. This conclusion is not restricted to our exfoliated single-layer sample on SiO$_2$. In fact, recent results of magnetophonon resonance on single-layer graphene encapsuled on hexagonal boron nitride by Neumann {\\it et al.} could only be fit with increasing $\\delta_k$ parameters with $k$ \\cite{neumann2015magneto}.\n\nIn the absence of a complete theory that describes the Landau level broadening in neutral graphene, a simple phenomenological model is developed here. The manifestations of MPR in the Raman spectra occur at fields ($B_{res}^k$) where the interband LL energy difference, $E_{res}^k=v_{F}\\sqrt{2e\\hbar B_{res}^k}(\\sqrt{|n|}+ \\sqrt{|n+1|})$, equals the $G-$band energy, $E_{G-band}$. From this equation, two possible broadening pathways are readily identified: (i) broadening due to Fermi velocity dispersion, leading to $\\delta_k/E_{G-band} = \\Delta v_F / v_F$, and (ii) broadening due to strain-induced internal pseudo-magnetic field distribution ~\\cite{Castro Neto,andoanomaly,PhysRevLett.97.196804}, leading to  $\\delta_k/E_{G-band} = \\Delta B / 2 B_{res}^k$. While pathway (i) leads to a single broadening parameter $\\delta$ which is independent of the $k$ transition index such as observed for MEG, pathway (ii) leads to $\\delta_k$ values inversely proportional to $B_{res}^k$. \n\nIn order to verify broadening mechanisms indicated above are consistent with our observations in SLG, simulations of the $E_{2g}$ phonon energy and linewidth according to Eq. \\ref{eq1} were performed considering the Lorentzian-convoluted parameter $\\delta_k = (\\Delta v_F /v_F + \\Delta B / 2 B_{res}^k) E_{G-band}$. Good match with experimental data for the $B-$dependent component of the $G$-band is found using the parameters $\\Delta v_F / v_F = 0.032$ and $\\Delta B = 1.7$ T (solid lines in Fig. \\ref{SLGB} and inset). These parameters indicate that the LL broadening that damps the resonances at low fields in single layer graphene arises mostly from a large local pseudo-magnetic field distribution~\\cite{Castro Neto,andoanomaly,PhysRevLett.97.196804}. Indeed, it is known that such pseudo-magnetic fields could reach values up to tens of tesla in some cases ~\\cite{Yeh20111649}, therefore the observed value of $\\Delta B = 1.7$ T for our single layer graphene sample on SiO$_2$ is a reasonable result. \n\nFor the multilayer epitaxial graphene sample, the strain-induced broadening discussed above for single layer graphene is not relevant, due to the large number of graphene sheets protected by the neighboring layers, and the LL broadening parameter $\\delta = 17.6$ meV is independent of $B_{res}^k$. This is characteristic of a broadening mechanism due to Fermi-velocity distribution with $\\Delta v_F/ v_F = 0.09$. It is well established that $v_F$ is strongly dependent of a residual interaction with the substrate or neighboring graphene layers, reaching maximum values for suspended single-layer graphene samples ~\\cite{Hwang}. We conclude that the residual interlayer interaction in multilayer epitaxial graphene samples fluctuates from layer to layer, leading to a larger Fermi-velocity distribution for such type of graphene samples as compared to single layer graphene.\n\nIn summary, a quantitative analysis of the magneto-phonon resonances in multilayer epitaxial and single layer graphene samples allowed us to identify the main Landau level broadening mechanisms for each sample. In single layer graphene, the Landau Levels in the low-field regime broadens mostly due to inhomogeneous strain caused by the interaction with the substrate, while in multilayer epitaxial graphene the Landau Level broadening is caused mainly by variations in the Fermi velocity created by the fluctuations in the interlayer residual interactions. This work paves the way for systematical investigations of Landau level broadening channels for graphene using Raman spectroscopy, which is necessary to optimize sample production methods and bring its unique quantum effects to the subtesla field region.\n\n\\section{Methods}\n{\\bf Sample production} The multilayer epitaxial sample was obtained by decomposition of the carbon face of 4H-SiC$(000\\overline{1})$ substrate in argon atmosphere. Sublimation time was 60 minutes at $T = 2048$ K. Further details on the preparation and characterization of this sample by Raman scattering, atomic force microscopy and grazing-incidence x-ray diffraction are given in Ref. \\cite{mendes2012}. The single layer graphene flake was produced by conventional mechanical exfoliation of natural graphene deposited over the $300$~nm SiO$_2$ layer of a Si substrate.\n\n{\\bf Raman scattering} The micro-Raman spectra were performed using a $488$ nm Ar-ion laser and a $15$~T magnetocryostat. The sample was fixed to piezoelectric stages. The sample, $xyz$ stages and objective were immersed in He gas or superfluid. The magnetic field was perpendicular to the sample surface. The elastic component of the scattered signal was rejected by an edge filter. For the experiment on multilayer epitaxial graphene on SiC, a $200$~$\\mu$m diameter size optical fiber, which works as a confocal configuration, was used to transport the Raman signal to the entrance of a single $1800$~g/mm grating spectrometer coupled with a liquid nitrogen-cooled charge coupled device detector; the laser was focused using a 50X objective lens, with 7 mm working distance and a spot size of $\\approx2.5$~$\\mu$m. For single layer graphene on SiO$_2$, a single $1200$~g/mm grating spectrometer with a peltier-cooled CCD detector was employed; we used a $40\\times$ objective lens with a $200$~$\\mu$m working distance, resulting in $\\sim 3.5$~$\\mu$m focal spot diameter.\n\n\n\\begin{acknowledgments}\nWe thank M.A. Pimenta, E. Nery, F. Plentz, and L. Malard for helpful discussions. This work was supported by CAPES, FAPESP, FAPEMIG, CNPq, Nanocarbon INCT and Nanofabrication Network, Brazil.\n\\end{acknowledgments}\n\n\n\\begin{references}\n\n\\bibitem{Castro Neto} Castro Neto, A.H. {\\it et al.} The electronic properties of graphene. {\\it Rev. Mod. Phys.} {\\bf 81}, 109 (2009).\n\n\\bibitem{Li_STS} Li, G., Luican, A., and Andrei, E.Y. Scanning Tunneling Spectroscopy of Graphene on Graphite. {\\it Phys. Rev. Lett.} {\\bf 102}, 176804 (2009).\n\n\\bibitem{Mayer_STS} Luican-Mayer, A. {\\it et al.} Screening Charged Impurities and Lifting the Orbital Degeneracy in Graphene by Populating Landau Levels. {\\it Phys. Rev. Lett.} {\\bf 112}, 036804 (2014).\n\n\\bibitem{SadowskiIR} Sadowski, M.L. {\\it et al.} Landau Level Spectroscopy of Ultrathin Graphite Layers. {\\it Phys. Rev. Lett.} {\\bf 97}, 26Â¨6405 (2006).\n\n\\bibitem{JiangIR} Jiang, Z. {\\it et al.} Infrared Spectroscopy of Landau Levels of Graphene. {\\it Phys. Rev. Lett.} {\\bf 98}, 197403 (2007).\n\n\\bibitem{OrlitaIR} Orlita, M. {\\it et al.} Approaching the Dirac Point in High-Mobility Multilayer Epitaxial Graphene. {\\it Phys. Rev. Lett.} {\\bf 101}, 267601 (2008).\n\n\\bibitem{PhysRevLett.107.036807} Faugeras, C. {\\it et al.}. Magneto-Raman Scattering of Graphene on Graphite: Electronic and Phonon Excitations. {\\it Phys. Rev. Lett.} {\\bf 107}, 036807 (2011).\n\n\\bibitem{FaugerasEPL} C. Faugeras {\\it et al.} A micro-magneto-Raman scattering study of graphene on a bulk graphite substrate. {\\it Europhys. Lett.} {\\bf 108}, 27011 (2014).\n\n\\bibitem{ando2005electronic} Ando, T. Theory of Electronic States and Transport in Carbon Nanotubes. {\\it J. Phys. Soc. Japan}, {\\bf 74}, 777 (2005).\n\n\\bibitem{tando} Ando, T. Magnetic Oscillation of Optical Phonon in Graphene, {\\it J. Phys. Soc. Japan} {\\bf 76}, 024712 (2007).\n\n\\bibitem{Goerbig} Goerbig, M.O., Fuchs, J.-N., Kechedzhi, K. and Fal'ko, V.I. Filling-Factor-Dependent Magnetophonon Resonance in Graphene. {\\it Phys. Rev. Lett.} {\\bf 99}, 087402 (2007).\n\n\\bibitem{faugerasfit} Faugeras, C. {\\it et al.} Tuning the Electron-Phonon Coupling in Multilayer Graphene with Magnetic Fields. {\\it Phys. Rev. Lett.} {\\bf 103}, 186803 (2009).\n\n\\bibitem{PhysRevLett.105.227401} Yan, J. {\\it et al.} Observation of Magnetophonon Resonance of Dirac Fermions in Graphite. {\\it Phys. Rev. Lett.} {\\bf 105}, 227401 (2010).\n\n\\bibitem{PhysRevB.85.121403} Kim, Y. {\\it et al.}. Magnetophonon resonance in graphite: High-field Raman measurements and electron-phonon coupling contributions. {\\it Phys. Rev. B} {\\bf 85}, 121403 (2012).\n\n\\bibitem{Goler20121289} Goler, S., Yan, J., Pellegrini, V., and Pinczuk, A., Raman spectroscopy of magneto-phonon resonances in graphene and graphite. {\\it Sol. State Commun.} {\\bf 152}, 1289 (2012).\n\n\\bibitem{kim2013filling} Kim, Y. {\\it et al.} Measurement of Filling-Factor-Dependent Magnetophonon Resonances in Graphene Using Raman Spectroscopy. {\\it Phys. Rev. Lett.} {\\bf 110}, 227402 (2013).\n\n\\bibitem{leszczynski2014electrical} Leszczynski, P. {\\it et al.} Electrical Switch to the Resonant Magneto-Phonon Effect in Graphene. {\\it Nano Lett.} {\\bf 14}, 1460 (2014).\n\n\\bibitem{neumann2015magneto} Neumann, C. {\\it et al.} Low {\\it B} Field Magneto-Phonon Resonances in Single-Layer and Bilayer Graphene. {\\it Nano Lett.} {\\bf 15}, 1547 (2015).\n\n\\bibitem{FaugerasAPL} Faugeras, C. {\\it et al.} Few-layer graphene on SiC, pyrolitic graphite, and graphene: A Raman scattering study. {\\it Appl. Phys. Lett.} {\\bf 92}, 011914 (2008).\n\n\\bibitem{Das} Das, A. {\\it et al.} Monitoring dopants by Raman scattering\nin an electrochemically top-gated\ngraphene transistor. {\\it Nature Nanotech.} {\\bf 3}, 210 (2008).\n\n\\bibitem{Basko} Basko, D.M., Piscanec, S., and Ferrari, A.C. Electron-electron interactions and doping dependence of the two-phonon Raman intensity\nin graphene. {\\it Phys. Rev. B} {\\bf 80}, 165413 (2009).\n\n\\bibitem{Pisana} Pisana, S. {\\it et al.} Breakdown of the adiabatic\nBornâ\u0080\u0093Oppenheimer approximation\nin graphene. {\\it Nature Mater.} {\\bf 6}, 198 (2007).\n\n\\bibitem{Remi} Remi, S., Swan, A., and Goldberg, B.B. High Magnetic Field Raman Spectroscopy of Electron Phonon Interactions in Graphene. {\\it Proceedings of the XXII International Conference on Raman Spectroscopy}, p. 465 (2010).\n\n\\bibitem{PhysRevB.76.201401} Malard, L.M. {\\it et al.} Probing the electronic structure of bilayer graphene by Raman scattering. {\\it Phys. Rev. B} {\\bf 76}, 201401 (2007).\n\n\\bibitem{pimenta2007studying} Pimenta, M.A. {\\it et al.} Studying disorder in graphite-based systems by Raman spectroscopy. {\\it Phys. Chem. Chem. Phys.} {\\bf 9}, 1276 (2007).\n\n\\bibitem{andoanomaly} Ando, T. Anomaly of Optical Phonon in Monolayer Graphene. {\\it J. Phys. Soc. Japan} {\\bf 75}, 124701 (2006).\n\n\\bibitem{PhysRevLett.97.196804} Morpurgo, A. F. and Guinea, F. {\\it Intervalley Scattering, Long-Range Disorder, and Effective Time-Reversal Symmetry Breaking in Graphene}. {\\it Phys. Rev. Lett.} {\\bf 97}, 196804 (2006).\n\n\\bibitem{Yeh20111649} Yeh, N.-C. Strain-induced pseudo-magnetic fields and charging effects on CVD-grown graphene. {\\it Surf. Science} {\\bf 605}, 1649 (2011).\n\n\\bibitem{Hwang} Hwang, C. {\\it et al.} Fermi velocity engineering in graphene by substrate modification. {\\it Sci. Rep.} {\\bf 2}, 590 (2012).\n\n\\bibitem{mendes2012} Mendes-de-Sa, T.G. {\\it et al.} Correlation between (in) commensurate domains of multilayer epitaxial graphene grown on SiC$(000\\overline{1})$ and single layer electronic behavior. {\\it Nanotechnol.} {\\bf 23}, 475602 (2012).\n\n\\end{references}\n\n\n\n", "itemtype": "equation", "pos": 5036, "prevtext": "\n\n\\title{Landau Level Broadening Mechanisms of Neutral Graphene: Strain Fields versus Fermi Velocity Distribution}\n\n\\author{F. M. Ardito}\n\\affiliation{Instituto de F\\'{i}sica ``Gleb Wataghin,'' Universidade Estadual de Campinas, Campinas, S\\~{a}o Paulo 13083-859, Brazil}\n\n\\author{T. G. Mendes-de-S\\'{a}}\n\\affiliation{Departamento de F\\'{i}sica, Universidade Federal de Minas Gerais, Belo Horizonte, Minas Gerais 30123-970, Brazil}\n\n\\author{P. F. Gomes}\n\\affiliation{Instituto de F\\'{i}sica ``Gleb Wataghin,'' Universidade Estadual de Campinas, Campinas, S\\~{a}o Paulo 13083-859, Brazil}\n\\affiliation{Instituto de CiÃªncias Exatas e Tecnol\\'{o}gicas, Universidade Federal de Goi\\'{a}s, Jata\\'{i} 75801-615, Brazil}\n\n\\author{D. L. Mafra}\n\\affiliation{Departamento de F\\'{i}sica, Universidade Federal de Minas Gerais, Belo Horizonte, Minas Gerais 30123-970, Brazil}\n\n\\author{R. G. Lacerda}\n\\affiliation{Departamento de F\\'{i}sica, Universidade Federal de Minas Gerais, Belo Horizonte, Minas Gerais 30123-970, Brazil}\n\n\\author{F. Iikawa}\n\\affiliation{Instituto de F\\'{i}sica ``Gleb Wataghin,'' Universidade Estadual de Campinas, Campinas, S\\~{a}o Paulo 13083-859, Brazil}\n\n\\author{E. Granado}\n\\affiliation{Instituto de F\\'{i}sica ``Gleb Wataghin,'' Universidade Estadual de Campinas, Campinas, S\\~{a}o Paulo 13083-859, Brazil}\n\n\\begin{abstract}\n\nThe singular half-integer quantum hall effect in graphene is a direct consequence of the characteristic Landau levels (LL) predicted by the Dirac equation. Albeit sharp levels are required to reinforce the manifestation of this effect, little information on the most relevant mechanisms leading to broadening of quantized electronic levels in graphene samples is presently available. In this work, micro-Raman experiments at low temperatures and fields up to 15 T were performed on two electrically neutral graphene samples, namely a natural single-layer graphene flake deposited over a Si/SiO$_2$ substrate and a multilayer epitaxial graphene sample produced by silicon sublimation out of a SiC surface. Interband LL transition widths were extracted by the damping of the magnetophonon resonances associated with optically active LL transitions crossing the energy of the $E_{2g}$ Raman-active phonon. The dependence of the transition widths with the resonance fields provides direct information on the broadening mechanisms. From this analysis, the LL broadening in multilayer epitaxial graphene on SiC is attributed to a distribution of Fermi velocities due to fluctuations of residual interlayer graphene interactions, while an additional mechanism due to the presence of random strain-induced pseudomagnetic fields takes place in single layer graphene on SiO$_2$. This work demonstrates the existence of distinct mechanisms that degrate the quantum electronic effects in graphene, which are affected differently by the sample production methodology.\n\n\\end{abstract}\n\n\n\n\\maketitle\n\n\nThe Landau Level (LL) energies for the linear electronic bands around the Dirac points in graphene are $E_{n}= sgn (n)v_{F}\\sqrt{2e\\hbar B |n|}$ ~\\cite{Castro Neto}, where the index $n=0$, $\\pm 1$, $\\pm2$, ..., $v_F$ is the Fermi velocity and $B$ is the magnetic field perpendicular to the carbon sheet. Ideal graphene, i.e., a perfectly flat, isolated, defect-free and strain-free layer, is expected to show extremely sharp LL at low temperatures. On the other hand, real samples show imperfections that are characteristic of the sample production method, leading to LL broadening and consequent damping of the effects associated to the Dirac equation. A proper understanding of the main mechanisms of LL broadening is therefore desirable and should help in the quest for optimized graphene samples with reinforced quantum relativistic effects.\n\nAs detailed below, the mechanisms of LL broadening may be pinned down by a quantitative analysis of the {\\it B}-dependence of the LL width. Such information can be achieved  by direct observations of the LL by Scanning Tunelling Spectroscopy \\cite{Li_STS,Mayer_STS}, Infrared absorption \\cite{SadowskiIR,JiangIR,OrlitaIR} and Raman scattering \\cite{PhysRevLett.107.036807,FaugerasEPL}. Alternatively, the broadening of LL may be more conveniently studied by an analysis of phonon Raman scattering, which is a versatile and widespread technique that probe structural and electronic properties of graphitic samples. In fact, electron-phonon interaction in graphene leads to magneto-phonon resonances (MPR) when the energy of an optically active LL transition obeying $|n|-|m|=1$ crosses the energy of the $E_{2g}$ Raman-active phonon \\cite{ando2005electronic,tando,Goerbig}, causing oscillations of the phonon energy and linewidth. Several works have reported the MPR from Dirac fermions in graphene and graphitic samples \\cite{PhysRevLett.107.036807,faugerasfit,PhysRevLett.105.227401,PhysRevB.85.121403,Goler20121289,kim2013filling,leszczynski2014electrical,neumann2015magneto}. For electrically neutral graphene, the MPR are described by  \\cite{faugerasfit}\n\n", "index": 1, "text": "\\begin{equation}\n\\widetilde{\\epsilon}^2 - \\epsilon_{0}^2= 4 \\lambda \\epsilon_{0} e\\hbar B  v_{F}^{2} \\sum\\limits_{k=0}^{\\infty}\\left[ \\frac{ T_{k}}{\\left( \\widetilde{\\epsilon}+\\imath \\delta_k \\right) ^2 - T_k^2} + \\frac{1}{T_k} \\right ]\n\\label{eq1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\widetilde{\\epsilon}^{2}-\\epsilon_{0}^{2}=4\\lambda\\epsilon_{0}e\\hbar Bv_{F}^{2%&#10;}\\sum\\limits_{k=0}^{\\infty}\\left[\\frac{T_{k}}{\\left(\\widetilde{\\epsilon}+%&#10;\\imath\\delta_{k}\\right)^{2}-T_{k}^{2}}+\\frac{1}{T_{k}}\\right]\" display=\"block\"><mrow><mrow><msup><mover accent=\"true\"><mi>ϵ</mi><mo>~</mo></mover><mn>2</mn></msup><mo>-</mo><msubsup><mi>ϵ</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo>=</mo><mrow><mn>4</mn><mo>⁢</mo><mi>λ</mi><mo>⁢</mo><msub><mi>ϵ</mi><mn>0</mn></msub><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi>B</mi><mo>⁢</mo><msubsup><mi>v</mi><mi>F</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mo>[</mo><mrow><mfrac><msub><mi>T</mi><mi>k</mi></msub><mrow><msup><mrow><mo>(</mo><mrow><mover accent=\"true\"><mi>ϵ</mi><mo>~</mo></mover><mo>+</mo><mrow><mi>ı</mi><mo>⁢</mo><msub><mi>δ</mi><mi>k</mi></msub></mrow></mrow><mo>)</mo></mrow><mn>2</mn></msup><mo>-</mo><msubsup><mi>T</mi><mi>k</mi><mn>2</mn></msubsup></mrow></mfrac><mo>+</mo><mfrac><mn>1</mn><msub><mi>T</mi><mi>k</mi></msub></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]