[{"file": "1601.01593.tex", "nexttext": "\nHere, $H_0$ is the one-particle Hamiltonian and $V_C$ the Coulomb repulsion. For the one-particle wave functions, we adopt the spinor basis $\\psi(\\bm{r}^{(i)})=\\left( \\psi_+(\\bm{r}^{(i)}),-i\\psi_-(\\bm{r}^{(i)}) \\right)^T$, where the coordinate $\\bm{r}^{(i)}=(x^{(i)},y^{(i)})$ represents the position of the $i$-th electron on the TI surface. In this basis, the kinetic term $T^{(i)}$ reads $T^{(i)}=v_F\\bm{\\sigma}^{(i)}\\cdot\\bm{p}^{(i)}$, where $v_F$ is the Fermi velocity, $\\bm{\\sigma}^{(i)}=(\\sigma_x^{(i)},\\sigma_y^{(i)})$ are the Pauli matrices acting on the spin of the $i$-th particle, and $\\bm{p}^{(i)}=-i\\hbar\\nabla_{\\bm r^{(i)}}$. The confining potential $U^{(i)}$ we consider is $U^{(i)}=M \\Theta(r^{(i)}-R)\\sigma_z^{(i)}$, where $r^{(i)}=|\\bm{r}^{(i)}|$, $\\Theta(x)$ is the Heaviside step function, $R$ is the radius of the dot, and the limit $M\\rightarrow \\infty$ is taken for simplicity \\cite{berry}. Note that this confinement breaks time-reversal symmetry.\n\nExperimentally, such confinement could be realized by depositing a structured ferromagnetic layer on the TI surface. The (spinor) eigenvectors $\\psi_{n,m}(\\bm{r}^{(i)})$ of $H_0^{(i)}$ are\n\n", "itemtype": "equation", "pos": 7190, "prevtext": "\n\n\\title{Correlation and current anomalies in topological quantum dots}\n\\author{C. De Beule}\n\\email{christophe.debeule@uantwerpen.be}\n\\affiliation{Department of Physics, University of Antwerp, 2020 Antwerp, Belgium}\n\\author{N. Traverso Ziani}\n\\email{niccolo.traverso@physik.uni-wuerzburg.de}\n\\affiliation{Institute of Theoretical Physics and Astrophysics, University of W\\\"urzburg, 97074 W\\\"urzburg, Germany}\n\\author{M. Zarenia}\n\n\\affiliation{Department of Physics, University of Antwerp, 2020 Antwerp, Belgium}\n\\author{B. Partoens}\n\n\\affiliation{Department of Physics, University of Antwerp, 2020 Antwerp, Belgium}\n\\author{B. Trauzettel}\n\n\\affiliation{Institute of Theoretical Physics and Astrophysics, University of W\\\"urzburg, 97074 W\\\"urzburg, Germany}\n\\affiliation{Department of Physics, University of California, Berkeley, California 94720, USA}\n\\begin{abstract}\nWe theoretically investigate the ground-state properties of a quantum dot defined on the surface of a strong three-dimensional time-reversal invariant topological insulator. Confinement is realized by ferromagnetic barriers and Coulomb interaction is treated numerically for up to seven electrons in the dot. Experimentally relevant intermediate interaction strengths are considered. The topological nature of the dot has interesting consequences: $i)$ spin polarization increases and the ground state exhibits quantum phase transitions at specific angular momenta as a function of interaction strength $ii)$ the onset of Wigner correlations takes place mainly in one spin channel, $iii)$ the ground state is characterized by a persistent current which changes sign as a function of the distance from the center of the quantum dot.\n\\end{abstract}\n\\pacs{73.21.La, 03.65.Pm, 71.15.Rf}\n\n\\maketitle\n\nTopological insulators (TIs) \\cite{2dteo1,2dteo2,2dexp1,2dexp2,3dteo1,3dteo2,3dexp} are peculiar insulators hosting metallic states at boundaries with other insulators distinguished by their topology.\n\nThe metallic surface or interface states are, for a certain class of TIs, protected from time-reversal invariant perturbations and characterized by spin-momentum locking, relating the quasi-momentum of the one-particle states to their spin projection \\cite{rev1,rev2}. Due to their special properties, the surface states are potentially interesting for applications in spintronics \\cite{st1,st2,st3} and quantum computation \\cite{qc1,qc2}. A promising step toward device applications is represented by the progress made in topological insulator nanostructures. On the one hand, nanostructures can overcome some intrinsic limitations of state of the art TIs \\cite{short,nanostruct1,nanostruct2,nanostruct3}. On the other hand, the ability to produce topological nanostructures may lead to new physics, relating to, for instance, Majorana fermions \\cite{majo1,majo2,majo3}, parafermions \\cite{para1,para2,para3}, qubits \\cite{qbit}, topological Josephson junctions \\cite{jj1,jj2,jj3}, and \nanomalous superconducting pairing \\cite{francois}.\\\\\n\\indent The main challenge in the theoretical description of nanostructured TIs is represented by the need to properly take into account electron-electron interactions. Interaction effects in two-dimensional quantum spin Hall systems are striking: In the weakly interacting regime, the low-energy properties of the edge states are well described by the helical Luttinger liquid \\cite{helical1,helical2}; in the case of strong interactions, the physics is even richer, in terms of both exotic edge \\cite{para1,para2,fw} and bulk \\cite{fract} properties. For three-dimensional time-reversal invariant TIs, the Landau theory of the two-dimensional helical surface states has been developed to deal with the weak to intermediate interaction regime \\cite{helland}, while the strongly interacting regime is dominated by fractionalization \\cite{fract}.\\\\\n\\indent Moreover, the study of interacting massless Dirac fermions, relevant for strong TIs, can greatly benefit from research on the electronic properties of graphene \\cite{graphene}. Graphene has been deeply investigated during the last decade and it was indeed shown that the properties of interacting particles in nanostructures can significantly differ from the corresponding bulk theories. For example, bulk graphene is characterized by the absence of Wigner crystallization \\cite{nowig}: due to the linear spectrum, the kinetic energy has the same scaling with density as the Coulomb energy \n\nso that there is no competition.\nConsequently, intrinsic interactions in graphene are insufficient to establish Wigner crystallization. In finite structures, such as quantum dots, this simple picture fails, and Wigner molecules, or their onset, may emerge for strong but reasonable interaction strengths \\cite{egger,karina}. A similar increase of the effects of electron-electron interactions in finite structures has been reported \\cite{egger2} for quantum dots in a two-dimensional electron gas (2DEG) \\cite{2d1,2d2,2d3,2d4}. In general, the same behavior also characterizes the surface states of strong three-dimensional TIs. However, as we show below, the presence of a \\emph{single} Dirac cone has remarkable consequences on the ground state of topological quantum dots.\\\\\n\\indent In this Letter, we investigate the ground-state properties of a circular quantum dot hosted on the surface of a three-dimensional strong topological insulator, confined by hard wall (i.e.\\ infinite mass) boundaries. The inspection is carried out numerically with exact diagonalization for up to seven electrons in the dot. We consider an intermediate interaction regime such that electrons are strongly correlated but the Wigner molecule is not yet fully developed, meaning that the electrons are not yet fully localized. After introducing the model, we discuss the anomalous spin-resolved behavior of the ground state. The quantum dot is characterized by a spontaneous spin polarization which increases with interaction strength, similar to quantum dots in a 2DEG with strong Rashba coupling \\cite{naseri}. We draw an analogy, in terms of quantum phase transitions, between interactions in the topological system and external magnetic fields in 2DEG quantum dots. Moreover, the spatial distribution of the spin-resolved density shows a partial segregation between spins. While the density of the majority spin (spin up in our case) is localized mostly near the boundary of the dot, that of the minority spin (spin down in our case) is localized more near the center. Intuitively, this suggests that spin down particles are effectively stiffer towards electron-electron interactions and, hence, energetically unfavored. This picture is supported by the spin-resolved density-density correlation functions: the majority spin component shows strong correlations, while the minority spin density remains more liquid-like. Finally, we present the most remarkable property of the topological dot: The ground state is characterized by a persistent current. Surprisingly, the current changes sign as a function of the radius of the dot in all cases under consideration. We carefully explain below why this happens.\n\nThe Hamiltonian $H$ we consider is\n\n\n\n\n\n", "index": 1, "text": "\\begin{equation}\nH=\\sum_i H_0^{(i)}+V_C, \\quad H_0^{(i)}=T^{(i)}+U^{(i)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H=\\sum_{i}H_{0}^{(i)}+V_{C},\\quad H_{0}^{(i)}=T^{(i)}+U^{(i)}.\" display=\"block\"><mrow><mrow><mrow><mi>H</mi><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><msubsup><mi>H</mi><mn>0</mn><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow><mo>+</mo><msub><mi>V</mi><mi>C</mi></msub></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msubsup><mi>H</mi><mn>0</mn><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>=</mo><mrow><msup><mi>T</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>+</mo><msup><mi>U</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01593.tex", "nexttext": "\nHere, $m$ is an integer, $\\theta=\\arctan\\left( y/x \\right)$, $J_m(x)$ are Bessel functions, and $k_{n,m}$ are the solutions for $k$ with $n$ radial nodes of the hard wall boundary condition:\n\n", "itemtype": "equation", "pos": 8442, "prevtext": "\nHere, $H_0$ is the one-particle Hamiltonian and $V_C$ the Coulomb repulsion. For the one-particle wave functions, we adopt the spinor basis $\\psi(\\bm{r}^{(i)})=\\left( \\psi_+(\\bm{r}^{(i)}),-i\\psi_-(\\bm{r}^{(i)}) \\right)^T$, where the coordinate $\\bm{r}^{(i)}=(x^{(i)},y^{(i)})$ represents the position of the $i$-th electron on the TI surface. In this basis, the kinetic term $T^{(i)}$ reads $T^{(i)}=v_F\\bm{\\sigma}^{(i)}\\cdot\\bm{p}^{(i)}$, where $v_F$ is the Fermi velocity, $\\bm{\\sigma}^{(i)}=(\\sigma_x^{(i)},\\sigma_y^{(i)})$ are the Pauli matrices acting on the spin of the $i$-th particle, and $\\bm{p}^{(i)}=-i\\hbar\\nabla_{\\bm r^{(i)}}$. The confining potential $U^{(i)}$ we consider is $U^{(i)}=M \\Theta(r^{(i)}-R)\\sigma_z^{(i)}$, where $r^{(i)}=|\\bm{r}^{(i)}|$, $\\Theta(x)$ is the Heaviside step function, $R$ is the radius of the dot, and the limit $M\\rightarrow \\infty$ is taken for simplicity \\cite{berry}. Note that this confinement breaks time-reversal symmetry.\n\nExperimentally, such confinement could be realized by depositing a structured ferromagnetic layer on the TI surface. The (spinor) eigenvectors $\\psi_{n,m}(\\bm{r}^{(i)})$ of $H_0^{(i)}$ are\n\n", "index": 3, "text": "\\begin{equation}\n\\psi_{n,m}(\\bm{r})= A_{n,m} e^{im\\theta} \\left(\\begin{matrix} J_m (k_{n,m}r) \\\\ ie^{i\\theta} J_{m+1} (k_{n,m}r) \\end{matrix}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\psi_{n,m}(\\bm{r})=A_{n,m}e^{im\\theta}\\left(\\begin{matrix}J_{m}(k_{n,m}r)\\\\&#10;ie^{i\\theta}J_{m+1}(k_{n,m}r)\\end{matrix}\\right).\" display=\"block\"><mrow><mrow><mrow><msub><mi>ψ</mi><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>A</mi><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi>J</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi>i</mi><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>θ</mi></mrow></msup><mo>⁢</mo><msub><mi>J</mi><mrow><mi>m</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01593.tex", "nexttext": "\nThe spinor normalization then reads $A_{n,m}^{-2} = 2\\pi R^2 J_m(k_{n,m}R)^2 \\left[ 2-(2m+1)/(k_{n,m}R) \\right]$ and the corresponding eigenvalues are $E_{n,m}=\\hbar v_F k_{n,m}$. The spectrum is symmetric with respect to zero energy and a gap $\\Delta \\approx 2.87\\hbar v_F/R$ is present. Throughout this Letter, similarly to Refs.\\ \\cite{egger,plus1,plus2,plus3}, we assume all negative energy states to be filled and inert. For $(n,m)$ corresponding to positive energy, we define the fermionic annihilation (creation) operators $c_{n,m}$ ($c^\\dag_{n,m}$). The corresponding Fermi spinor $\\Psi(\\bm{r})$ is given by $\\Psi(\\bm{r})=(\\Psi_+(\\bm{r}),\\Psi_-(\\bm{r}))^T=\\sum_{n,m}\\psi_{n,m}(\\bm{r})c_{n,m}$. The explicit form of the Hamiltonian, once the negative energy states are removed from the Hilbert space, is (repeated indexes are summed)\n\\begin{eqnarray}\nH'&=&H_0'+V'_C, \\label{eq:H} \\\\\nH'_0&=&E_{n,m} c^\\dag_{n,m}c_{n,m},\\\\\nV'_C&=&V_{n_1,m_1;n_2,m_2}^{n_3,m_3;n_4,m_4}c^\\dag_{n_1,m_1}c^\\dag_{n_2,m_2}c_{n_3,m_3}c_{n_4,m_4},\n\\end{eqnarray}\nwhere $V_{n_1,m_1;n_2,m_2}^{n_3,m_3;n_4,m_4}$ are the matrix elements of the Coulomb interaction with respect to the spinor wave functions $\\psi_{n_i,m_i}(\\bm{r}^{(i)})$. Since the total angular momentum $J_z = \\sum_i \\left( m_i + 1/2 \\right)$ is conserved in our model, the Hamiltonian can be written in block diagonal form.\n\nThe effective fine-structure constant $\\alpha$ that controls the relative weight of kinetic and Coulomb energy is given by $\\alpha=e^2/(4\\hbar\\pi\\epsilon_0\\epsilon v_F)$, where \n\n$\\epsilon$ is the surface dielectric constant of the TI under inspection. As expected, $\\alpha$ does not depend on the dot radius $R$, so it cannot be tuned with the density. For the surface of the well-studied TI  Bi$_2$Se$_3$, we have $\\epsilon \\approx 50$ and $v_F \\approx 5 \\cdot 10^5$ m/s \\cite{xia09} yielding a very small $\\alpha \\approx 0.09$. One possibility to increase $\\alpha$ would be to consider TI thin films on top of a suitable substrate. In this way, screening through the bulk is reduced. For example, for Bi$_2$Se$_3$ thin films grown on InP \\cite{landolt14}, we find \\cite{landolt01} $0.6 < \\alpha < 0.9$. Apart from nanostructuring, larger $\\alpha$ values could become available as more TIs (in particular those with smaller $\\epsilon$) are discovered experimentally \\cite{ando13}.\n\nOur aim is to characterize the ground-state properties of a dot containing $N$ electrons, described by the Hamiltonian in Eq.\\ \\eqref{eq:H} in the intermediate interaction regime  $0<\\alpha<2$. To do so, the ground-state average $\\langle O \\rangle$ of operators $O$ are evaluated numerically by exact diagonalization. The first quantity we address is the average spin polarization $\\left<S_z\\right> = \\frac{\\hbar}{2} \\int d^2\\bm r \\langle\\Psi^\\dag(\\bm{r})\\sigma_z\\Psi(\\bm{r})\\rangle$. The noninteracting spin polarization $\\left<S_z\\right>$ is due to the presence of the boundary that breaks time-reversal symmetry. Turning on electron-electron interactions increases the spin polarization: two different cases are shown in Fig.\\ \\ref{fig1}(a). For $N=4$ the increase is smooth, while for $N=7$ the increase is larger and shows a jump. As shown in Fig.\\ \\ref{fig1}(b), the difference is due to the nature of the ground state as a function of $\\alpha$: while for $N=4$ one has total angular momentum $J_z=4$ for $0<\\alpha<2$, the jump in $\\left<S_z\\right>$ for $N=7$ corresponds to a level crossing where $J_z$ changes from $J_z=6.5$ to $J_z=10.5$ at $\\alpha \\approx 0.7$. The physical significance of the polarization is the following: With increasing interaction strength, the system evolves towards a classical state, the Wigner molecule. In non-topological systems, the classical nature, and the consequent loss of the spin degree of freedom, is allowed by the fact that many states tend to become degenerate in the limit of infinite interaction strength. The combination of a single cone and spin-momentum locking prevents our system from developing this degeneracy. Increasing the spin polarization is therefore a natural way to approach the classical limit in the topological quantum dot. The quantum phase diagram shown in Fig.\\ \\ref{fig1}(b) indicates that the effect is generic for $2<N<7$ and $0<\\alpha<2$. Moreover, it presents some peculiarities: in ordinary 2DEG quantum dots, $\\left< S_z \\right>$ does not change with interaction strength. In this case the total spin is fixed by an applied magnetic field which itself can induce quantum phase transitions towards states with a higher spin imbalance \\cite{egger2,2d1}. The \\emph{magic} numbers, i.e.\\ the orbital angular momentum $M$ of the ground state, can then be determined from the symmetry properties of the wave function (e.g.\\ $M=3, 6, \\ldots$ for $N=3$ and $M=6, 10, \\ldots$ for $N=4$) \\cite{newref}. The interplay of spin-momentum locking, Coulomb interaction, and the boundary which act as a spin-selection mechanism yields similar (but different) quantum phase transitions in our system at zero magnetic field as $\\alpha$ is increased. Most strikingly, the analogy is profound: the observed $J_z$ ground state values can be obtained from assuming a maximum value for $\\left< S_z \\right>$, and the same \\emph{magic} number rule for the angular momentum expectation value, even if the maximal spin value is not yet reached.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig11.pdf}\n\t\\caption{(Color online)$(a)$ Spin polarization $\\left<S_z\\right>$, in units $\\frac{\\hbar}{2}$, as a function of $\\alpha$ for  $N=4$ (blue, solid, left $y$-axis), and $N=7$ (red, dashed, right $y$-axis). $(b)$ Quantum phase diagram as a function of $N$ and $\\alpha$. Dots indicate phase transitions and the numbers are the angular momentum $J_z$ of the ground state.}\n\t\\label{fig1}\n\\end{figure}\n\nMore can be learned about the spin structure by inspecting the radial distribution of the spin up/down density $\\rho_{\\pm}(r)=\\langle\\Psi^\\dag(\\bm{r})[(1\\pm\\sigma_z)/2]\\Psi(\\bm{r})\\rangle$. For $N=4,5,6,7$ (the cases $N=4$ and $N=7$ are shown in Fig.\\ \\ref{fig2} for $\\alpha=2$) the spin-down component is dominant close to the center of the dot, while the spin-up component is dominant closer to the edge. Directly at the edge, however, the spin-resolved densities are forced to be equal by the boundary conditions. Qualitatively, this means that the spin-down density is stiffer towards interactions because it is concentrated closer to the center than the spin-up density.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig22.pdf}\n\t\\caption{(Color online) Total electron density $\\rho_{+}(r)+\\rho_{-}(r)$ (red, solid), spin imbalance $\\rho_{+}(r)-\\rho_{-}(r)$ (blue, dashed), $\\rho_{+}(r)$ (green, dotted), and $\\rho_{-}(r)$ (purple, dash dotted) as a function of the radius $r$ for $\\alpha=2$ and $(a)$ $N=4$, $(b)$ $N=7$.}\n\t\\label{fig2}\n\\end{figure}\nThis behavior is consistent with the increase of the spin polarization $\\left<S_z\\right>$ when the interaction strength is increased: spin-up electrons can respond faster to electron-electron interactions so that it is energetically favorable to polarize the system.\n\nIn order to directly access the spin selection, we address the spin-resolved density-density correlation functions $d_{s,s'}(\\bm{r},\\bm{r}')$, with $s,s'=\\pm$ labeling the spin projection. Explicitly, we define\n\n", "itemtype": "equation", "pos": 8798, "prevtext": "\nHere, $m$ is an integer, $\\theta=\\arctan\\left( y/x \\right)$, $J_m(x)$ are Bessel functions, and $k_{n,m}$ are the solutions for $k$ with $n$ radial nodes of the hard wall boundary condition:\n\n", "index": 5, "text": "\\begin{equation}\nJ_m(kR)=J_{m+1}(kR).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"J_{m}(kR)=J_{m+1}(kR).\" display=\"block\"><mrow><mrow><mrow><msub><mi>J</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>⁢</mo><mi>R</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>J</mi><mrow><mi>m</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>⁢</mo><mi>R</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01593.tex", "nexttext": "\nso that the interpretation of $d_{s,s'}(\\bm{r},\\bm{r}')$ is the probability of finding a particle with spin projection $s$ at position $\\bm{r}$ if an electron with spin projection $s'$ is fixed at position $\\bm{r}'$. The results for $N=4$ and $N=7$ (which well represent the physics up to seven particles) are shown in Fig.\\ \\ref{fig3} in the noninteracting case $\\alpha=0$ and for $\\alpha=2$. In the figure, $r$ and $r'$ are fixed at the maximum of the total density (spin-up density for $N=7$ and $\\alpha=0$) and $d_{s,s'}(\\bm{r},\\bm{r}')$ is plotted as a function of the polar angle $\\theta$ of $\\bm r$ with $\\theta'=0$. In the noninteracting case, we observe that $d_{+,+}(\\bm{r},\\bm{r}')$ dominates over the others due to the spin polarization induced by the boundary. Moreover, they are characterized by three and six peaks for respectively $N=4$ and $N=7$, which means that, on average, the weight of the spin-up component of each of the electrons is dominant. Consistent with the Pauli principle, $d_{+,+}(\\bm{r},\\bm{r}')$ and $d_{-,-}(\\bm{r},\\bm{r}')$ are zero for $\\theta=0$, while $d_{+,-}(\\bm{r},\\bm{r}')$ is not. When interactions are increased the peaks in $d_{+,+}(\\bm{r},\\bm{r}')$ become more pronounced, indicating the onset of Wigner oscillations. The correlation function $d_{+,-}(\\bm{r},\\bm{r}')$ exhibits respectively three and six (weaker) oscillations as well. This is a consequence of the topological nature of the system. Remarkably, no signature of antiferromagnetic correlations, characterizing 2DEG dots \\cite{antiferro}, are present. In our case, we also find $d_{+,-}(\\bm{r},\\bm{r}')\\sim 0$ at $\\theta=0$ which indicates unambiguously that $\\alpha=2$ corresponds to significant interactions in the dot. The spin-down correlations $d_{-,-}(\\bm{r},\\bm{r}')$, however, remain rather featureless (liquid-like) even for $\\alpha=2$. The system is hence characterized by a spin selective Wigner oscillation. This behavior is consistent both with the increase in spin polarization and the radial dependence of the spin-resolved density. Intuitively speaking, one of the effects of interactions in confined systems is to push particles closer to the boundaries as to minimize the interaction energy. Particles that remain near the center when interactions are increased (the spin-down density in this case) do not minimize the interaction energy, and their spatial distribution and correlations are still mostly determined by kinetic energy and confinement. Therefore the system becomes more polarized with increasing interaction strength.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig33.pdf}\n\t\\caption{(Color online) Plot of $d_{+,+}(\\bm{r},\\bm{r}')$ (blue, solid), $d_{+,-}(\\bm{r},\\bm{r}')$ (green, dashed), and $d_{-,-}(\\bm{r},\\bm{r}')$ (red, dash-dotted), as a function of $\\theta$; light/thin lines correspond to $\\alpha=0$ and dark/thick lines to $\\alpha=2$. In $(a)$ $N=4$, $\\theta'=0$, and for $\\alpha=0$, $r=r'=0.8R$, while for $\\alpha=2$, $r=r'=0.93R$. (b) $N=7$, $\\theta'=0$, and for $\\alpha=0$, $r=r'=0.76R$, while for $\\alpha=2$, $r=r'=0.96R$.}\n\t\\label{fig3}\n\\end{figure}\n\nIn the last part of this Letter, we discuss another consequence of the topological nature of the quantum dot on the local observables by inspecting the local azimuthal current density,\n\n\n\n", "itemtype": "equation", "pos": 16223, "prevtext": "\nThe spinor normalization then reads $A_{n,m}^{-2} = 2\\pi R^2 J_m(k_{n,m}R)^2 \\left[ 2-(2m+1)/(k_{n,m}R) \\right]$ and the corresponding eigenvalues are $E_{n,m}=\\hbar v_F k_{n,m}$. The spectrum is symmetric with respect to zero energy and a gap $\\Delta \\approx 2.87\\hbar v_F/R$ is present. Throughout this Letter, similarly to Refs.\\ \\cite{egger,plus1,plus2,plus3}, we assume all negative energy states to be filled and inert. For $(n,m)$ corresponding to positive energy, we define the fermionic annihilation (creation) operators $c_{n,m}$ ($c^\\dag_{n,m}$). The corresponding Fermi spinor $\\Psi(\\bm{r})$ is given by $\\Psi(\\bm{r})=(\\Psi_+(\\bm{r}),\\Psi_-(\\bm{r}))^T=\\sum_{n,m}\\psi_{n,m}(\\bm{r})c_{n,m}$. The explicit form of the Hamiltonian, once the negative energy states are removed from the Hilbert space, is (repeated indexes are summed)\n\\begin{eqnarray}\nH'&=&H_0'+V'_C, \\label{eq:H} \\\\\nH'_0&=&E_{n,m} c^\\dag_{n,m}c_{n,m},\\\\\nV'_C&=&V_{n_1,m_1;n_2,m_2}^{n_3,m_3;n_4,m_4}c^\\dag_{n_1,m_1}c^\\dag_{n_2,m_2}c_{n_3,m_3}c_{n_4,m_4},\n\\end{eqnarray}\nwhere $V_{n_1,m_1;n_2,m_2}^{n_3,m_3;n_4,m_4}$ are the matrix elements of the Coulomb interaction with respect to the spinor wave functions $\\psi_{n_i,m_i}(\\bm{r}^{(i)})$. Since the total angular momentum $J_z = \\sum_i \\left( m_i + 1/2 \\right)$ is conserved in our model, the Hamiltonian can be written in block diagonal form.\n\nThe effective fine-structure constant $\\alpha$ that controls the relative weight of kinetic and Coulomb energy is given by $\\alpha=e^2/(4\\hbar\\pi\\epsilon_0\\epsilon v_F)$, where \n\n$\\epsilon$ is the surface dielectric constant of the TI under inspection. As expected, $\\alpha$ does not depend on the dot radius $R$, so it cannot be tuned with the density. For the surface of the well-studied TI  Bi$_2$Se$_3$, we have $\\epsilon \\approx 50$ and $v_F \\approx 5 \\cdot 10^5$ m/s \\cite{xia09} yielding a very small $\\alpha \\approx 0.09$. One possibility to increase $\\alpha$ would be to consider TI thin films on top of a suitable substrate. In this way, screening through the bulk is reduced. For example, for Bi$_2$Se$_3$ thin films grown on InP \\cite{landolt14}, we find \\cite{landolt01} $0.6 < \\alpha < 0.9$. Apart from nanostructuring, larger $\\alpha$ values could become available as more TIs (in particular those with smaller $\\epsilon$) are discovered experimentally \\cite{ando13}.\n\nOur aim is to characterize the ground-state properties of a dot containing $N$ electrons, described by the Hamiltonian in Eq.\\ \\eqref{eq:H} in the intermediate interaction regime  $0<\\alpha<2$. To do so, the ground-state average $\\langle O \\rangle$ of operators $O$ are evaluated numerically by exact diagonalization. The first quantity we address is the average spin polarization $\\left<S_z\\right> = \\frac{\\hbar}{2} \\int d^2\\bm r \\langle\\Psi^\\dag(\\bm{r})\\sigma_z\\Psi(\\bm{r})\\rangle$. The noninteracting spin polarization $\\left<S_z\\right>$ is due to the presence of the boundary that breaks time-reversal symmetry. Turning on electron-electron interactions increases the spin polarization: two different cases are shown in Fig.\\ \\ref{fig1}(a). For $N=4$ the increase is smooth, while for $N=7$ the increase is larger and shows a jump. As shown in Fig.\\ \\ref{fig1}(b), the difference is due to the nature of the ground state as a function of $\\alpha$: while for $N=4$ one has total angular momentum $J_z=4$ for $0<\\alpha<2$, the jump in $\\left<S_z\\right>$ for $N=7$ corresponds to a level crossing where $J_z$ changes from $J_z=6.5$ to $J_z=10.5$ at $\\alpha \\approx 0.7$. The physical significance of the polarization is the following: With increasing interaction strength, the system evolves towards a classical state, the Wigner molecule. In non-topological systems, the classical nature, and the consequent loss of the spin degree of freedom, is allowed by the fact that many states tend to become degenerate in the limit of infinite interaction strength. The combination of a single cone and spin-momentum locking prevents our system from developing this degeneracy. Increasing the spin polarization is therefore a natural way to approach the classical limit in the topological quantum dot. The quantum phase diagram shown in Fig.\\ \\ref{fig1}(b) indicates that the effect is generic for $2<N<7$ and $0<\\alpha<2$. Moreover, it presents some peculiarities: in ordinary 2DEG quantum dots, $\\left< S_z \\right>$ does not change with interaction strength. In this case the total spin is fixed by an applied magnetic field which itself can induce quantum phase transitions towards states with a higher spin imbalance \\cite{egger2,2d1}. The \\emph{magic} numbers, i.e.\\ the orbital angular momentum $M$ of the ground state, can then be determined from the symmetry properties of the wave function (e.g.\\ $M=3, 6, \\ldots$ for $N=3$ and $M=6, 10, \\ldots$ for $N=4$) \\cite{newref}. The interplay of spin-momentum locking, Coulomb interaction, and the boundary which act as a spin-selection mechanism yields similar (but different) quantum phase transitions in our system at zero magnetic field as $\\alpha$ is increased. Most strikingly, the analogy is profound: the observed $J_z$ ground state values can be obtained from assuming a maximum value for $\\left< S_z \\right>$, and the same \\emph{magic} number rule for the angular momentum expectation value, even if the maximal spin value is not yet reached.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig11.pdf}\n\t\\caption{(Color online)$(a)$ Spin polarization $\\left<S_z\\right>$, in units $\\frac{\\hbar}{2}$, as a function of $\\alpha$ for  $N=4$ (blue, solid, left $y$-axis), and $N=7$ (red, dashed, right $y$-axis). $(b)$ Quantum phase diagram as a function of $N$ and $\\alpha$. Dots indicate phase transitions and the numbers are the angular momentum $J_z$ of the ground state.}\n\t\\label{fig1}\n\\end{figure}\n\nMore can be learned about the spin structure by inspecting the radial distribution of the spin up/down density $\\rho_{\\pm}(r)=\\langle\\Psi^\\dag(\\bm{r})[(1\\pm\\sigma_z)/2]\\Psi(\\bm{r})\\rangle$. For $N=4,5,6,7$ (the cases $N=4$ and $N=7$ are shown in Fig.\\ \\ref{fig2} for $\\alpha=2$) the spin-down component is dominant close to the center of the dot, while the spin-up component is dominant closer to the edge. Directly at the edge, however, the spin-resolved densities are forced to be equal by the boundary conditions. Qualitatively, this means that the spin-down density is stiffer towards interactions because it is concentrated closer to the center than the spin-up density.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig22.pdf}\n\t\\caption{(Color online) Total electron density $\\rho_{+}(r)+\\rho_{-}(r)$ (red, solid), spin imbalance $\\rho_{+}(r)-\\rho_{-}(r)$ (blue, dashed), $\\rho_{+}(r)$ (green, dotted), and $\\rho_{-}(r)$ (purple, dash dotted) as a function of the radius $r$ for $\\alpha=2$ and $(a)$ $N=4$, $(b)$ $N=7$.}\n\t\\label{fig2}\n\\end{figure}\nThis behavior is consistent with the increase of the spin polarization $\\left<S_z\\right>$ when the interaction strength is increased: spin-up electrons can respond faster to electron-electron interactions so that it is energetically favorable to polarize the system.\n\nIn order to directly access the spin selection, we address the spin-resolved density-density correlation functions $d_{s,s'}(\\bm{r},\\bm{r}')$, with $s,s'=\\pm$ labeling the spin projection. Explicitly, we define\n\n", "index": 7, "text": "\\begin{equation}\nd_{s,s'}(\\bm{r},\\bm{r}')=\\frac{\\langle\\Psi^\\dag_s(\\bm{r})\\Psi^\\dag_{s'}(\\bm{r}')\\Psi_{s'}(\\bm{r}')\\Psi_s(\\bm{r})\\rangle}{N(N-\\delta_{s,s'})},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"d_{s,s^{\\prime}}(\\bm{r},\\bm{r}^{\\prime})=\\frac{\\langle\\Psi^{\\dagger}_{s}(\\bm{r%&#10;})\\Psi^{\\dagger}_{s^{\\prime}}(\\bm{r}^{\\prime})\\Psi_{s^{\\prime}}(\\bm{r}^{\\prime%&#10;})\\Psi_{s}(\\bm{r})\\rangle}{N(N-\\delta_{s,s^{\\prime}})},\" display=\"block\"><mrow><mrow><mrow><msub><mi>d</mi><mrow><mi>s</mi><mo>,</mo><msup><mi>s</mi><mo>′</mo></msup></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo>,</mo><msup><mi>𝒓</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mo stretchy=\"false\">⟨</mo><mrow><msubsup><mi mathvariant=\"normal\">Ψ</mi><mi>s</mi><mo>†</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><msup><mi>s</mi><mo>′</mo></msup><mo>†</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝒓</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ψ</mi><msup><mi>s</mi><mo>′</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝒓</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ψ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>N</mi><mo>-</mo><msub><mi>δ</mi><mrow><mi>s</mi><mo>,</mo><msup><mi>s</mi><mo>′</mo></msup></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01593.tex", "nexttext": "\nwhere $\\hat\\theta=(-y/r,x/r)$. Note that $J_\\theta(r)$, unlike the quantities that we inspected until now, is not a spin-resolved observable, but depends crucially on the distribution of orbital angular momenta which are related to the spin degree of freedom by spin-momentum locking. An anomalous behavior of $J_\\theta(r)$ can thus be expected in our system. The total angular momentum of the ground state for $\\alpha=2$ is $J_z=2,4.5,4,7.5,12,10.5$ for respectively $N=2,..,7$ electrons. Consequently the ground state is a rotating Wigner oscillation with a nonzero local current. However, due to spin-momentum locking, the orbital angular momentum is not a good quantum number and the rotation pattern is nontrivial. As shown in Fig.\\ \\ref{fig4} for the cases (a) $N=4$ and (b) $N=7$, $J_\\theta(r)$ changes sign as a function of $r$ with positive currents close to the edge and negative currents closer to the center. This behavior is due to contributions of negative angular momentum to the ground state, and goes beyond the intuitive picture of a coherently rotating Wigner oscillation for ordinary 2DEG quantum dots. Moreover, the boundary between regions of opposite current becomes sharper with increasing interaction strength. \n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=0.94\\linewidth]{fig44.pdf}\n\t\\caption{(Color online) Azimuthal current density $J_\\theta(r)$ of the ground state for $\\alpha=0$ (blue, solid), $\\alpha=1$ (green, dashed), and $\\alpha=2$ (red, dotted) for $(a)$ $N=4$, $(b)$ $N=7$.}\n\t\\label{fig4}\n\\end{figure}\n\nAs far as the experimental observations of our predictions are concerned, different issues might arise. On the one hand, the realization of quantum dots on the surface of topological insulators remains a challenge but it should, for instance, be possible by magnetic confinement. On the other hand, the spin polarization that we predict, can, in principle, be accessed by coupling the dot to spin-polarized local probes \\cite{spinpol1,spinpol2}. The unusual behavior characterizing the local azimuthal current could be detected by means of local SQUIDs \\cite{localsquid}.\n\nIn conclusion, we have analyzed the ground-state properties of a quantum dot defined on the surface of a three-dimensional strong topological insulator. We have considered an intermediate interaction regime characterized by the onset of Wigner oscillations in the density-density correlation functions. The onset of Wigner oscillations is special in our system: It is concomitant with spin polarization of the dot, so that electron-electron interactions in the topological dot play a similar role as an external magnetic field for quantum dot in a 2DEG, and affects mainly one spin component.\n\nFinally, we have discussed the behavior of the azimuthal particle current which changes sign as a function of the distance from the center of the dot, revealing a fingerprint of spin-momentum locking and hence of the topological nature of the system.\n\n\\begin{acknowledgments}\nC.D.B.\\ is an aspirant and M.Z.\\ a postdoc fellow of the Flemish Research Foundation (FWO). N.T.Z.\\ and B.T.\\ acknowledge financial support by the DFG (SPP1666 and SFB1170 \"ToCoTronics\"), the Helmholtz Foundation (VITI), and the ENB Graduate school on \"Topological Insulators\". We thank F.\\ Cr\\'epin and F.\\ Cavaliere for interesting discussions.\n\\end{acknowledgments}\n\n\\begin{thebibliography}{99}\n\\bibitem{2dteo1} C. L. Kane and E. J. Mele, Phys. Rev. Lett. \\textbf{95}, 226801 (2005).\n\\bibitem{2dteo2} B. A. Bernevig, T. L. Hughes, and S.-C. Zhang, Science \\textbf{314}, 1757 (2006).\n\\bibitem{2dexp1} M. K\\\"onig, S. Weidmann, C. Br\\\"une, A. Roth, H. Buhmann, L. W. Molenkampf, X.-L. Qi, and S.-C. Zhang, Science \\textbf{318}, 766 (2007).\n\\bibitem{2dexp2} I. Knez, R.-R. Du, and G. Sullivan, Phys. Rev. Lett. \\textbf{107}, 136603 (2011).\n\\bibitem{3dteo1} L. Fu, C.L. Kane, and E.J. Mele, Phys. Rev. Lett. \\textbf{98}, 106803 (2007).\n\\bibitem{3dteo2} L. Fu and C. L. Kane, Phys. Rev. B \\textbf{76}, 045302 (2007).\n\\bibitem{3dexp} D. Hsieh, Y. Xia, D. Qian, L. Wray, J. H. Dil, F. Meier, J. Osterwalder, L. Patthey, J. G. Checkelsky, N. P. Ong, A. V. Fedorov, H. Lin, A. Bansi, D. Grauer, Y. S. Hor, R. J. Cava, and M. Z. Hasan, Nature \\textbf{452}, 970 (2008).\n\\bibitem{rev1} M. Z. Hasan and C. L. Kane, Rev. Mod. Phys. \\textbf{82}, 3045 (2010).\n\\bibitem{rev2} X.-L. Qi and S.-C. Zhang, Rev. Mod. Phys. \\textbf{83}, 1057 (2011).\n\\bibitem{st1} D. Pesin and A. H. Macdonald, Nat. Mater. \\textbf{11} 409 (2012).\n\\bibitem{st2} A. Roth, C. Br\\\"une, H. Buhmann, L. W. Molenkamp, J. Maciejko, X.-L. Qi, and S.-C. Zhang, {Science} \\textbf{325}, {5938} (2009).\n\\bibitem{st3} P. Michetti and B. Trauzettel, Appl. Phys. Lett. \\textbf{102}, {063505} (2013).\n\\bibitem{qc1} S. Das Sarma, M. Freedman, and C. Nayak, Physics Today \\textbf{59}, 32 (2006).\n{32}.\n\\bibitem{qc2} C. Nayak, S. H. Simon, A. Stern, M. Freedman, and S. Das Sarma, Rev. Mod. Phys. \\textbf{80}, 1083 (2008).\n\\bibitem{short} M. K\\\"onig, M. Baenninger, A. G. F. Garcia, N. Harjee, B. L. Pruitt, C. Ames, P. Leubner, C. Br\\\"une, H. Buhmann, L. W. Molenkamp, and D. Goldhaber-Gordon, Phys. Rev. X \\textbf{3}, 021003 (2013).\n\\bibitem{nanostruct1} D. Kong, J. C. Randel, H. Peng, J. J. Cha, S. Meister, K. Lai, Y. Chen, Z.-X. Shen, H. C. Manoharan, and Y. Cui, Nano Lett. \\textbf{10}, 329 (2009).\n\\bibitem{nanostruct2} D. Kong and Y. Cui, Nature Chem. \\textbf{3}, 845 (2011).\n\\bibitem{nanostruct3} S. Cho, D. Kim, P. Syers, N. P. Butch, J. Paglione, and M. S. Fuhrer, Nano Lett. \\textbf{12}, 469-472 (2012).\n\\bibitem{majo1} L. Fu and C. L. Kane, Phys. Rev. Lett. \\textbf{100}, 096407 (2008).\n\\bibitem{majo2} L. Fu and C. L. Kane, Phys. Rev. Lett. \\textbf{102}, 216403 (2009).\n\\bibitem{majo3} J. D. Sau, S. Tewari, R. Lutchyn, T. Stanescu, S. Das Sarma, Phys. Rev. B \\textbf{82}, 214509 (2010).\n\\bibitem{para1} F. Zhang and C. L. Kane, Phys. Rev. Lett. \\textbf{113}, 036401 (2014).\n\\bibitem{para2} C. P. Orth, R. P. Tiwari, T. Meng, and T. L. Schmidt,\nPhys. Rev. B \\textbf{91}, 081406(R) (2015).\n\\bibitem{para3} J. Klinovaja, A. Yacoby, and D. Loss, Phys. Rev. B \\textbf{90}, 155447 (2014).\n\\bibitem{qbit} G. J. Ferreira and D. Loss Phys. Rev. Lett. \\textbf{111}, 106802 (2013).\n\\bibitem{jj1} L. Fu and C. L. Kane, Phys. Rev. B \\textbf{79}, 161408(R) (2009).\n\\bibitem{jj2} G. Tkachov and E.M. Hankiewicz, Phys. Rev. B, \\textbf{88}, 075401 (2013).\n\\bibitem{jj3} J. Wiedenmann, E. Bocquillon, R.S. Deacon, S. Hartinger, O. Herrmann, T.M. Klapwijk, L. Maier, C. Ames, C. Br\\\"une, C. Gould, A. Oiwa, K. Ishibashi, S. Tarucha, H. Buhmann, and L.W. Molenkamp, arXiv:1503.05591v2.\n\\bibitem{francois} F. Cr\\'epin, P. Burset, and B. Trauzettel Phys. Rev. B \\textbf{92}, 100507(R) (2015).\n\\bibitem{helical1} C. Wu, B. A. Bernevig, and S.-C. Zhang, Phys. Rev. Lett. \\textbf{96}, 106401 (2006).\n\\bibitem{helical2} C. Xu and J. E. Moore, Phys. Rev. B \\textbf{73}, 045322 (2006).\n\\bibitem{fw} N. T. Ziani, F. Cr\\'epin, and B. Trauzettel, Phys. Rev. Lett. \\textbf{115}, 206402 (2015).\n\\bibitem{fract} J. Maciejko and G. Fiete, Nature Phys. \\textbf{11}, 385 (2015).\n\\bibitem{helland} R. Lundgren and J. Maciejko, Phys. Rev. Lett. \\textbf{115}, 066401 (2015).\n\\bibitem{graphene} M. I. Katsnelson, Graphene: Carbon in Two Dimensions (Cambridge University Press, Cambridge, 2012).\n\\bibitem{nowig} H. P. Dahal, Y. N. Joglekar, K. S. Bedell, A. V. Balatsky, Phys. Rev. B \\textbf{74}, 233405 (2006).\n\\bibitem{egger} T. Paananen, R. Egger, and H. Siedentop, Phys. Rev. B \\textbf{83}, 085409 (2011).\n\\bibitem{karina} K. A. Guerrero-Becerra and M. Rontani, Phys. Rev. B \\textbf{90}, 125446 (2014).\n\\bibitem{egger2} R. Egger, W. Hausler, C.H. Mak, H. Grabert, Phys. Rev. Lett. \\textbf{82}, 3320 (1999).\n\\bibitem{2d1} S. M. Reimann and M. Manninen, Rev. Mod. Phys. \\textbf{74}, 1283 (2002).\n\\bibitem{2d2} C. Yannouleas and U. Landman, Rep. Prog. Phys. \\textbf{70}, 2067 (2007).\n\\bibitem{2d3} S. Kalliakos, M. Rontani, V. Pellegrini, C. P. Garcia, A. Pinczuk, G. Goldoni, M. Molinari, L. N. Pfeiffer, and K. W. West, Nat. Phys \\textbf{4}, 467 (2008).\n\\bibitem{2d4} F. Cavaliere, U. De Giovannini, M. Sassetti, and B. Kramer, New J. Phys. \\textbf{11}, 123004 (2009).\n\\bibitem{naseri} A. Naseri, A. Zazunov, and R. Egger, Phys. Rev. X \\textbf{4}, 031033 (2014).\n\\bibitem{berry} M. V. Berry and R. J. Mondragon, Proc. R. Soc. Lond. A \\textbf{412}, 53-74 (1987).\n\\bibitem{plus1} J. Sucher, Phys. Rev. \\textbf{107}, 1448 (1957); Phys. Rev. 109, 1010 (1958); Phys. Rev. A \\textbf{22}, 348 (1980); Int. J. Quantum Chem. \\textbf{25}, 3 (1984).\n\\bibitem{plus2} W. H\\\"{a}usler and R. Egger, Phys. Rev. B \\textbf{80}, 161402(R) (2009).\n\\bibitem{plus3} R. Egger, A. De Martino, H. Siedentop, and E. Stockmeyer, J. Phys. A: Math. Theor. \\textbf{43}, 215202 (2010).\n\\bibitem{xia09} Y. Xia, D. Qian, D. Hsieh, L. Wray, A. Pal, H. Lin, A. Bansil, D. Grauer, Y. S. Hor, R. J.  Cava, and M. Z. Hasan, Nat. Phys. \\textbf{5}, 398 (2009).\n\\bibitem{landolt14} G. Landolt, S. Schreyeck, S. V. Eremeev, B. Slomski, S. Muff, J. Osterwalder, E. V. Chulkov, C. Gould, G. Karczewski, K. Brunner, H. Buhmann, L. W. Molenkamp, and J. H. Dil, Phys. Rev. Lett. \\textbf{112}, 057601 (2014).\n\\bibitem{landolt01} H. Landolt and R. B\\\"ornstein, \\textit{Group III Condensed Matter}, Vol. 41A1a (Springer, 2001).\n\\bibitem{ando13} Y. Ando, J. Phys. Soc. Jap. \\textbf{82}, 102001 (2013).\n\\bibitem{newref} W. Y. Ruan, Y.Y. Liu, C. G. Bao, and Z. Q. Zhang, Phys. Rev. B \\textbf{51}, 7942 (1995).\n\\bibitem{antiferro} S. M. Reimann, M. Koskinen, M. Manninen, Phys. Rev. B \\textbf{62}, 8108 (2000).\n\\bibitem{spinpol1} R. Wiesendanger, Rev. Mod. Phys. \\textbf{81}, 1495 (2009).\n\\bibitem{spinpol2} M. Bode, Rep. Prog. Phys. \\textbf{66}, 523 (2003).\n\\bibitem{localsquid} K. C. Nowack, E. M. Spanton, M. Baenninger, M. K\\\"onig, J. R. Kirtley, B. Kalisky, C. Ames, P. Leubner, C. Br\\\"une, H. Buhmann, L. W. Molenkamp, D. Goldhaber-Gordon, and K. A. Moler, Nat. Mater. \\textbf{12}, 787 (2013).\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 19712, "prevtext": "\nso that the interpretation of $d_{s,s'}(\\bm{r},\\bm{r}')$ is the probability of finding a particle with spin projection $s$ at position $\\bm{r}$ if an electron with spin projection $s'$ is fixed at position $\\bm{r}'$. The results for $N=4$ and $N=7$ (which well represent the physics up to seven particles) are shown in Fig.\\ \\ref{fig3} in the noninteracting case $\\alpha=0$ and for $\\alpha=2$. In the figure, $r$ and $r'$ are fixed at the maximum of the total density (spin-up density for $N=7$ and $\\alpha=0$) and $d_{s,s'}(\\bm{r},\\bm{r}')$ is plotted as a function of the polar angle $\\theta$ of $\\bm r$ with $\\theta'=0$. In the noninteracting case, we observe that $d_{+,+}(\\bm{r},\\bm{r}')$ dominates over the others due to the spin polarization induced by the boundary. Moreover, they are characterized by three and six peaks for respectively $N=4$ and $N=7$, which means that, on average, the weight of the spin-up component of each of the electrons is dominant. Consistent with the Pauli principle, $d_{+,+}(\\bm{r},\\bm{r}')$ and $d_{-,-}(\\bm{r},\\bm{r}')$ are zero for $\\theta=0$, while $d_{+,-}(\\bm{r},\\bm{r}')$ is not. When interactions are increased the peaks in $d_{+,+}(\\bm{r},\\bm{r}')$ become more pronounced, indicating the onset of Wigner oscillations. The correlation function $d_{+,-}(\\bm{r},\\bm{r}')$ exhibits respectively three and six (weaker) oscillations as well. This is a consequence of the topological nature of the system. Remarkably, no signature of antiferromagnetic correlations, characterizing 2DEG dots \\cite{antiferro}, are present. In our case, we also find $d_{+,-}(\\bm{r},\\bm{r}')\\sim 0$ at $\\theta=0$ which indicates unambiguously that $\\alpha=2$ corresponds to significant interactions in the dot. The spin-down correlations $d_{-,-}(\\bm{r},\\bm{r}')$, however, remain rather featureless (liquid-like) even for $\\alpha=2$. The system is hence characterized by a spin selective Wigner oscillation. This behavior is consistent both with the increase in spin polarization and the radial dependence of the spin-resolved density. Intuitively speaking, one of the effects of interactions in confined systems is to push particles closer to the boundaries as to minimize the interaction energy. Particles that remain near the center when interactions are increased (the spin-down density in this case) do not minimize the interaction energy, and their spatial distribution and correlations are still mostly determined by kinetic energy and confinement. Therefore the system becomes more polarized with increasing interaction strength.\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=\\linewidth]{fig33.pdf}\n\t\\caption{(Color online) Plot of $d_{+,+}(\\bm{r},\\bm{r}')$ (blue, solid), $d_{+,-}(\\bm{r},\\bm{r}')$ (green, dashed), and $d_{-,-}(\\bm{r},\\bm{r}')$ (red, dash-dotted), as a function of $\\theta$; light/thin lines correspond to $\\alpha=0$ and dark/thick lines to $\\alpha=2$. In $(a)$ $N=4$, $\\theta'=0$, and for $\\alpha=0$, $r=r'=0.8R$, while for $\\alpha=2$, $r=r'=0.93R$. (b) $N=7$, $\\theta'=0$, and for $\\alpha=0$, $r=r'=0.76R$, while for $\\alpha=2$, $r=r'=0.96R$.}\n\t\\label{fig3}\n\\end{figure}\n\nIn the last part of this Letter, we discuss another consequence of the topological nature of the quantum dot on the local observables by inspecting the local azimuthal current density,\n\n\n\n", "index": 9, "text": "\\begin{equation}\nJ_\\theta(r)=v_F \\hat \\theta \\cdot \\langle \\Psi^\\dagger(\\bm r) \\bm \\sigma \\Psi(\\bm r) \\rangle,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"J_{\\theta}(r)=v_{F}\\hat{\\theta}\\cdot\\langle\\Psi^{\\dagger}(\\bm{r})\\bm{\\sigma}%&#10;\\Psi(\\bm{r})\\rangle,\" display=\"block\"><mrow><mrow><mrow><msub><mi>J</mi><mi>θ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>v</mi><mi>F</mi></msub><mo>⁢</mo><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>⋅</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi mathvariant=\"normal\">Ψ</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>𝝈</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]