[{"file": "1601.02160.tex", "nexttext": "\nwhere $A$ is proportional to the number of functional antibodies displayed on the cell surface, $B$ accounts for background fluorescence, and $C$ is the concentration of free antigen in solution. Fig.\\ 1D illustrates the shape of curves having this form. By using flow cytometry to measure $y$ on clonal populations of yeast at different antigen concentrations $C$, one can fit curves to Eq.\\ \\ref{eq:y_of_A} and thereby learn $K_D$. Such measurements, however, can only be performed in a low-throughput manner. \n\nTite-Seq allows thousands of titration curves to be measured in parallel. The Sort-Seq procedure illustrated in Fig.\\ 1A-C is performed at multiple antigen concentrations, and the resulting average bin number for each variant is plotted against concentration. Curves of the form in Eq.\\ \\ref{eq:y_of_A} are fit to these proxy measurements, and $K_D$ values are thereby inferred for each variant. \n\nWe emphasize that $K_D$ values cannot, in general, be accurately inferred from Sort-Seq experiments performed at a single antigen concentration. Because the relationship between binding and $K_D$ is sigmoidal, the amount of bound antigen provides a useful readout of $K_D$ only when the concentration of antigen used in the labeling procedure is comparable in magnitude to $K_D$. However, single mutations within a protein binding domain often change $K_D$ by multiple orders of magnitude. Sort-Seq experiments used to measure the sequence-affinity landscape must therefore be carried out over a range of concentrations large enough to encompass this variation. \n\nFurthermore, as illustrated in Fig.\\ 1D, different antibody variants often lead to substantially different levels of functional antibody expression on the yeast cell surface. If one performs Sort-Seq at a single antigen concentration, high affinity (low $K_D$) variants with low expression (blue variant) may bind less antigen than low affinity (high $K_D$) variants with high expression (orange variant). Only by measuring full titration curves can the effect that sequence has on affinity be deconvolved from sequence-dependent effects on functional protein expression. \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_2.pdf}\n\\caption{\n{\\bf Antibody constructs used in this paper.}\n(A) Co-crystal structure 4-4-20 antibody; PDB code 1FLR \\cite{Whitlow:1995vw}. The CDR1H and CDR3H regions are colored blue and red, respectively. (B) The scFv construct, from \\cite{Boder:1997ii} that was used in this study. Biotinylated fluorescein was used as the antigen, and bound antigen was visualized using streptavidin-RPE (PE). The amount of surface-expressed protein was visualized separately by labeling the c-Myc epitope at the C-terminus of the scFv construct with Brilliant Violet 421 (BV). Approximate location of the CDR1H (blue) and CDR3H (red) regions within the scFv are illustrated. (C) The gene coding for this scFv construct.  The six CDR regions indicated. The WT sequence of the two variable regions (10 aa each) are also shown. (D) Composition of the CDR1H and CDR3H scFv libraries.\n}\n\\label{figure2}\n\\end{figure}\n\n\n\\subsection{Proof-of-principle Tite-Seq experiments}\n\nTo test the feasibility of Tite-Seq, we used a well-characterized antibody-antigen system: the 4-4-20 single chain variable fragment (scFv) antibody \\cite{Boder:1997ii}, which binds the small molecule fluorescein with $K_D = 0.7 \\pm 0.3$ nM \\cite{Boder:2000ku}. This system was used in early work to establish the capabilities of yeast display, and a high resolution co-crystal structure of the 4-4-20 antibody bound to fluorescein has been determined \\cite{Whitlow:1995vw} (Fig.\\ 2A). An ultra-high-affinity ($K_D = 270$ fM) variant of this scFv, called 4m5.3, has also been found \\cite{Boder:2000ku}. In what follows, we refer to the 4-4-20 scFv from \\cite{Boder:1997ii} as WT, and the 4m5.3 variant from \\cite{Boder:2000ku} as OPT. \n\nThe scFv was expressed on the surface of yeast as part of the multi-domain construct described in \\cite{Boder:1997ii} (Fig.\\ 2B). Following \\cite{Boder:2000ku}, we used fluorescein-biotin as the antigen and labeled scFv-bound antigen with streptavidin-RPE (PE).  \nThe amount of surface-expressed protein was separately quantified by labeling the C-terminal c-Myc tag using anti-c-Myc primary antibodies and secondary antibodies conjugated to Brilliant Violet 421 (BV). See Appendix B for details on yeast display and labeling. \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_3.pdf}\n\\caption{\n{\\bf Example titration curves.}\n(A) Flow cytometry measurements and inferred titration curves for the WT scFv and two variant scFvs (C5 and C39). Different shades indicate results from three different replicate experiments. (B) Tite-Seq measurements and fitted curves for the same scFvs as in panel A. Different shades indicate results for different synonymous variants; not all synonymous variants are shown. In both panels, the term ``(adjusted)'' labeling the ordinate refers to the fact that the inferred background $B$ was subtracted from the data points and from the fitted curves. Vertical lines show $K_D$ values corresponding to each titration curve.\n}\n\\label{figure3}\n\\end{figure}\n\n\nTwo different scFv libraries were assayed (Fig.\\ 2C): one with a 10 aa variable region encompassing CDR1H (blue), and one with a 10 aa variable region encompassing CDR3H (red). The composition of each library is summarized in Fig.\\ 2D; each library contained the WT sequence, all 600 single-codon variants, a sample of 1100 double codons missense variance, and a sample of 150 triple codon variants. See Methods and Appendix C for details on library generation. As a negative control, we used a non-functional scFv referred to here as $\\Delta$.\n\nTite-Seq was carried out as follows. Approximately $3 \\times 10^6$ yeast cells expressing scFv variants in either the CDR1H or CDR3H libraries were incubated with fluorescein-biotin at one of the following concentrations: $0$ M, $10^{-8.5}$ M, $10^{-8}$ M, $10^{-7.5}$ M, $10^{-7}$ M, $10^{-6.5}$ M, $10^{-6}$ M, $10^{-5.5}$ M, $10^{-5}$ M, $10^{-4.5}$ M, or $10^{-4}$ M. After PE labeling of bound antigen, $\\sim 10^6$ cells were sorted into four bins using FACS. The bins used for these sorts are shown in Figs.\\ S1A,B; the number of cells sorted into each bin is shown in Fig.\\ S2A. Each bin of cells was regrown and bulk DNA was extracted. Variant CDR1H and CDR3H regions were then PCR amplified and sequenced using paired-end Illumina sequencing (see Appendix D for details). The final data set consisted of $\\sim 2 \\times 10^6$ sequences per bin (Fig.\\ S2B). For each variant sequence in each bin, a ``weighted average bin'' value was computed as described in Appendix E. \n\nA $K_D$ value was then inferred for each variant DNA sequence by fitting a function of the form in Eq.\\ \\ref{eq:y_of_A} to these weighted average bin values. In particular, the background term $B$ for each clone  was determined from the 0 M fluorescein measurement, as well as from the average of lowest 10\\% of fluorescent measurements, assumed to correspond to non-functional constructs (see Appendix F for details). After inspecting the resulting titration curves, we judged that $K_D$ values could not be confidently called below $10^{-9}$ M and above $10^{-5}$ M.\n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure*}\n\\noindent\n\\includegraphics[width=\\linewidth]{figure_4.pdf}\n\\caption{\n{\\bf Accuracy and precision of Tite-Seq.}\n(A) Tite-Seq measurements of $K_D$ for the WT scFv (white), three variant CDR1H clones (blue), and two variant CDR3H clones (red). Error bars on flow $K_D$ values are the same for all data points; they show the average mean squared error computed computed using three replicate measurements for each clone. Error bars on Tite-Seq $K_D$ values were estimated using the regression fit in panel B. (B) Estimated signal-to-noise ratios (S/N) of Tite-Seq measurements as a function of the number of sequence reads. Solid lines indicate S/N values computed for CDR1H (blue) and CDR3H (red) variants within twenty equally populated bins along the abscissa. Dotted lines indicate linear regression fits. (C) Density plots of $K_D$ and $E$ measurements for variants in the CDR1H (left) and CDR3H (right) libraries. White dots indicate measurements for synonymous mutants of the WT scFv (18 for CDR1H, 15 for CDR3H). $K_D$ values $\\geq 10^{-5}$ M and $\\leq 10^{-9}$ M are not shown. \n}\n\\label{figure4}\n\\end{figure*}\n\n\nDuring each Tite-Seq experiment, we also measured the effects of sequence variation on scFv expression. For each scFv library, we labeled the c-Myc tag of expressed constructs with BV as described above, then sorted and sequenced cells (Figs.\\ S1C,D and Fig.\\ S2A,B). In what follows, we use $E$ to denote the weighted average bin value for each variant in each library, normalized by the mean of such measurements for WT scFvs in that same library. \n\n\\subsection{Low-throughput validation experiments}\n\nTo judge the accuracy of Tite-Seq, we performed separate titration curve measurements on individual scFv clones. In addition to the WT, OPT, and $\\Delta$, we measured three clones from the CDR1H library (named C5, C7, and C39) and three clones from the CDR3H library (C45, C93, C133). Each clone underwent the same labeling procedure as in the Tite-Seq experiment, after which median fluorescence values were measured using standard flow cytometry. $K_D$ values were then inferred by fitting titration curves of the form in Eq.\\ \\ref{eq:y_of_A}; $B$ was determined from data taken at 0 M fluorescein and from measurements on $\\Delta$. Three replicate titration curves were taken for each clone.\n\n\\subsection{Tite-Seq can measure dissociation constants}\n\nFig.\\ 3A shows flow cytometry measurements along with fitted curves and $K_D$ values for three scFv clones: WT, C5, and C39. Corresponding Tite-Seq data and results shown in Fig.\\ 3B. This figure provides a sense for how precisely titration curves can be measured by each method. Although individual data points can be noisy, fitting curves to multiple data points nevertheless provide reasonably accurate measurements of affinity. The accuracy of these measurements is increased by averaging over replicates. \n\nFig.\\ 4A compares the $K_D$ values measured by Tite-Seq to those measured by flow cytometry for WT and the five library clones found to have $K_D$ values within the range of detection ($10^{-9}$ M to $10^{-5}$ M). For the CDR3H clone C45, which is not plotted, Tite-Seq yielded $K_D \\geq 10^{-5}$ M whereas flow cytometry gave $K_D = 10^{-5.23 \\pm 0.39}$ M. As expected, our three $K_D$ measurements for OPT (CDR1H Tite-Seq, CDR3H Tite-Seq, and flow cytometry) were all at or below the detection boundary of $10^{-9}$ M.\n\nError bars on flow cytometry $K_D$ values were computed using the average variance observed in replicate measurements. The computation of error bars on Tite-Seq $K_D$ values was more involved: measurements on synonymous variants were used to estimate the signal-to-noise ratio (S/N) as a function of the number of sequence reads; this dependence of S/N on read number was then used to estimate error bars on Tite-Seq $K_D$ values. The S/N values observed for each of the two libraries are illustrated in Fig. 4B. Details on error estimates are provided in Appendix F. \n\nFig.\\ 4A reveals a strong correspondence between the Tite-Seq and flow cytometry $K_D$ values. There is a detectable bias, but it is small compared to the $100$-fold range of $K_D$ values measured. The robustness of Tite-Seq is further illustrated by the consistency of $K_D$ values measured for the WT scFv in the two different libraries: $K_D = 10^{-8.20 \\pm 0.05}$ M for CDR1H, $K_D = 10^{-8.04 \\pm 0.21}$ M for CDR3H. These measurements are also consistent with the flow cytometry measurement of $K_D = 10^{-7.52 \\pm 0.40}$ M. We note that the Tite-Seq $K_D$ measurements for the WT scFv are about a factor of 10 larger than the previously measured value of $K_D = 0.7 \\pm 0.3$ nM \\cite{Boder:2000ku}. This is likely due to differences in buffers: we used a TBS buffer with more salt (700 mM NaCl) than the PBS buffer used by \\cite{Boder:2000ku} (150 mM NaCl), a difference that is expected to increase $K_D$.  \n\nThe necessity of performing $K_D$ measurements over a wide range of antigen concentrations is illustrated in Fig.\\ S3. At each antigen concentration used in our Tite-Seq experiments, the enrichment of scFvs in the high-PE bins correlated poorly with the $K_D$ values inferred from full titration curves. Moreover, at each antigen concentration used, a detectable correlation between $K_D$ and enrichment was found only for scFvs with $K_D$ values close to that concentration. \n\nFig.\\ S4 suggests a possible reason for the weak correlation between enrichment in high-PE bins and $K_D$ values. We found that, at saturating concentrations of fluorescein ($2\\, \\mu$M), cells expressing the OPT scFv bound twice as much fluorescein as cells expressing the WT scFv. This difference was not due to variation in the total amount of displayed scFv, which one might control for by labeling the c-Myc epitope as in \\cite{Reich:2015ep}. Rather, this difference in binding reflects a difference in the fraction of displayed scFvs that functioned properly. Yeast display experiments performed at a single antigen concentration cannot distinguish such differences in scFv functionality from differences in scFv affinity.\n\n\\subsection{Differing effects of mutations in CDR1H and CDR3H}\n\nIn both the CDR1H and CDR3H libraries, a large fraction of mutations (41\\% for CDR1H, 58\\% for CDR3H) increased $K_D$ above our detection limit of $10^{-5}$ M. A much smaller fraction of variants (2.2\\% for CDR1H, 5.4\\% for CDR3H) had $K_D$ values below our measurement threshold of $10^{-9}$ M. Both of these results suggest that binding affinity is more sensitive to variation in CDR3H than to variation in CDR1H, a finding consistent with the conventional understanding of antibody function \\cite{Xu:2000vq,Liberman:2013hq}. This difference, however, is somewhat modest. \n\nA much more striking difference between CDR1H and CDR3H was observed in how mutations affected expression of scFvs on the yeast cell surface. This difference can be seen in Fig.\\ 4C, which provides a global view of the $K_D$ and $E$ values measured by Tite-Seq. This landscape shows that expression is more sensitive to mutations in CDR1H than in CDR3H. For instance, both CDR1H and CDR3H showed similar numbers of variants with $E > 1.25$ (5.8\\% vs.\\ 5.9\\%, respectively), but CDR1H showed 65\\% more variants with $E < 0.75$ (56\\% vs.\\ 34\\%), and three times more variants with $E < 0.5$ (31\\% vs.\\ 10\\%). \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_5.pdf}\n\\caption{\n{\\bf Effects of substitution mutations.} \nHeatmaps show the measured effects on affinity (A,B) and expression (C,D) of all single amino acid substitutions within the variables regions of CDR1H (A,C) and CDR3H (B,D). White dots indicate residues of the WT scFv. Green dots indicate non-WT residues in the OPT scFv.}\n\\label{figure5}\n\\end{figure}\n\n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_6.pdf}\n\\caption{\n{\\bf Structural context of mutational effects.} \n(A) Crystal structure \\cite{Whitlow:1995vw} of the two variable\nregions of the WT antibody in complex with fluorescein (green). Each\nresidue (CDR1H: positions 28-37; CDR3H: positions 100-109) is colored\naccording to the $S_K$ and $S_E$ values computed for that\nposition. These variables, $S_K$ and $S_E$, respectively quantify the\nsensitivity of $K_D$ and $E$ to amino acid substitutions at specified\npositions; see Eqs.~\\ref{SK} and \\ref{SE} for definitions. (B,C) For each position in the CDR1H and CDR3H variable regions, $S_K$ is plotted against either (B) the number of contacts the WT residue makes within the protein structure, or (C) the distance of the WT residue to the fluorescein antigen. \n}\n\\label{figure6}\n\\end{figure}\n\n\nThese differences between CDR1H and CDR3H can also be seen in Fig.\\ 5, which shows the measured effect of each substitution mutation on affinity and expression. Figs.\\ 5A,B reveal that CDR1H and CDR3H exhibit similar substitution-affinity landscapes. In both regions, the large majority of substitutions increase $K_D$, and mutations that decrease $K_D$ tend to cluster at a small number of residue positions (CDR1H positions 28, 31, and 37, and CDR3H positions 104 and 108). Figs.\\ 5C and 5D, which show the substitution-expression landscape, differ more substantially. Specifically, substitutions at positions 31 and 34-37 in CDR1H affect expression, on average, much more than do mutations at any of the CDR3H positions. \n\nTo further validate Tite-Seq affinity measurements, we examined positions in the high affinity mutant OPT that differ from WT and that lie within the variable regions tested here. As illustrated in Fig.\\ 5A,B, five of the six OPT-specific mutations are neutral or reduce $K_D$. The remaining mutation, D106E, has previously been shown to require co-mutation with S101A in order to increase affinity \\cite{Midelfort:2004iq}.\n\n\\subsection{Structural correlates of the sequence-affinity landscape}\n\nNext we asked whether the sensitivity of affinity and expression values to the identity of the residue at each variable position could be understood from a structural perspective. To quantify this sensitivity at each position $i$, we computed two quantities:\n\\begin{eqnarray}\\label{SK}\nS^i_K &=& \\sqrt{\\left\\langle \\left( \\log_{10} K_D^{ia} - \\log_{10} K_D^{\\rm WT} \\right)^2 \\right\\rangle_a},  \\\\\n\\label{SE}\nS^i_E &=& \\sqrt{\\left\\langle \\left( E^{ia} - E^{\\rm WT} \\right)^2 \\right\\rangle_a}.\n\\end{eqnarray}\nHere, $K_D^{\\rm WT}$ and $E^{\\rm WT}$ respectively denote the dissociation constant and expression level measured for the WT scFv, $K_D^{ia}$ and $E^{ia}$ denote analogous quantities for the scFv with a single substitution mutation of amino acid $a$ at position $i$, and $\\langle \\cdot \\rangle_a$ denotes an average computed over the 19 non-WT amino acids at that position. \n\nFig.\\ 6A shows the WT CDR1H and CDR3H variable regions in complex with fluorescein. Each residue is colored according to the $S_K$ and $S_E$ values computed for its position. As expected from Figs.\\ 4C and 5C,D, the positions that strongly affect expression are located in CDR1H. To get a better understanding of what aspects of the structure might govern affinity, we plotted $S_K$ values against two other quantities: the number of amino acid contacts made by the WT residue within the antibody structure (Fig.\\ 6B), and the distance between the WT residue and the antigen (Fig.\\ 6C). We found a strong correlation between $S_K$ and the number of contacts, but no significant correlation between $S_K$ and distance to antigen. $S_E$ did not correlate significantly with either of these variables (see Fig.\\ S5).\n\n\n\n\\section{Discussion}\n \nWe have described a massively parallel assay, called Tite-Seq, for measuring the sequence-affinity landscape of antibodies. Although Tite-Seq was demonstrated here in the context of antibody-antigen binding, this assay can be used to study any receptor-ligand binding system that is compatible with yeast display.\n\nAs one application, we found that Tite-Seq measurements can help elucidate the structural basis of protein sequence-function relationships. For the fluorescein-binding scFv antibody studied here, we observed that the number of contacts that an amino acid has with other residues was highly correlated with how strongly mutations to that amino acid affected antigen-binding affinity. By contrast, we found no significant correlation between the distance of an amino acid from the antigen and the magnitude of mutational effects on affinity. This suggests that protein residues primarily affect binding affinity indirectly, via interactions with other residues, rather than through direct interactions with the antigen. \n\nWe also found differing effects between CDR1H and CDR3H. As expected, we found that variation in CDR3H had a (modestly) larger effect on affinity than variation in CDR1H. Somewhat unexpectedly, we also found that variation in CDR1H affects protein expression much more strongly than variation in CDR3H. Surface expression in the yeast display system provides a proxy readout of thermostability. Our observation therefore suggests that CDR1H plays a much larger role than CDR3H in stabilizing antibody structure. Together, these two findings suggest a biochemical rational for why CDR3H is more likely than CDR1H to be mutated in functioning receptors \\cite{Liberman:2013hq}, why it acquires mutations earlier than other CDRs \\cite{Liberman:2013hq}, and why variation in CDR3H is often sufficient to establish antigen specificity \\cite{Xu:2000vq}.\n\nThe range of affinities measured in our Tite-Seq experiments include a substantial fraction of the physiological range relevant to affinity maturation ($\\sim 10^{-6}$ M to $10^{-10}$ M) \\cite{batista1998,foote1995kinetic, roost1995early}. Experimental details made it difficult for us to measure affinities of $\\lesssim 10^{-9}$ M, but this limitation might be alleviated with improvements to our labeling protocol. We therefore suggest that future Tite-Seq experiments might be useful for mapping the sequence-affinity trajectories of antibodies during the affinity maturation process.\n\nMany DMS experiments for measuring protein sequence-affinity relationships have been described in recent years \\cite{Fowler2014}, including methods that combine Sort-Seq with yeast display \\cite{Reich:2015ep}. Such approaches apply a selection procedure to a library of variant proteins, then use the enrichment of each protein variant as a proxy measurement of the affinity. In particular, Reich et al. \\cite{Reich:2015ep} recently showed that such measurements can provide approximate values for the relative rank-order of $K_D$ values (at least when the variable protein is an unstructured peptide). \n\nTite-Seq differs fundamentally from prior DMS experiments in that full titration curves, not enrichment statistics, are used to measure binding affinities. The measurement of titration curves provides three major advantages. First, this determines absolute $K_D$ values (in units of concentration), not just rank-order values. Second, because ligand binding is a sigmoidal function of affinity, DMS experiments performed at a single ligand concentration will become less sensitive the more receptor $K_D$s differ from ligand concentration. Mutations within a protein's binding domain, however, often change $K_D$ by multiple orders of magnitude. Titration curve measurements integrate information over a range of concentrations large enough to measure these effects. \n\nFinally, protein sequence determines not just ligand-binding affinity, but also the amount of surface-displayed protein and the fraction of this protein that is functional. As demonstrated in our experiments, these confounding effects can strongly distort yeast display affinity measurements made at a single antigen concentration. The titration curves measured by Tite-Seq, however, are able to disambiguate these effects. More generally, changing a protein's amino acid sequence can be expected to change multiple biochemical properties of that protein. Our work emphasizes the importance of designing massively parallel assays appropriately in order to disentangle these properties so that measurements of the specific activity of interest can be obtained. \n\n\n\n\\section{Methods}\n \nVariant CDR3H and CDR1H regions were generated using microarray-synthesized oligos (LC Biosciences, Houston TX. USA).  These were inserted into the 4-4-20 scFv of \\cite{Boder:1997ii} using cassette-replacement restriction cloning as in \\cite{Kinney:2010tn}, thereby yielding $\\gtrsim 10^8$ transformants. EYB100 yeast \\cite{Boder:1997ii} were transformed with scFv-expressing plasmids using standard methods, yielding providing $\\gtrsim 10^5$ transformants. Prior to labeling, OPT- and $\\Delta$-displaying yeast were spiked into the CDR3H and CDR1H libraries to provide internal positive and negative controls. Further experimental details are provided in Appendices B-D. The used oligos are reported in Appendix G.\n\n\n \n{\\bf Acknowledgements.} We would like to thank Jacklyn Jansen, Amy Keating, Lother Reich, and Bruce Stillman for helpful discussions. We would also like to thank Dane Wittrup for sharing plasmids and yeast strains. \nRMA, TM and AMW were supported by European Research Council Starting Grant n. 306312.\nJBK was supported by the Simons Center for Quantitative Biology at Cold Spring Harbor Laboratory.\n\n\n\\bibliographystyle{pnas}\n\\begin{thebibliography}{10}\n\n\\bibitem{Chan2010}\nChan AC, Carter PJ\n\\newblock (2010) {Therapeutic antibodies for autoimmunity and inflammation}.\n\\newblock \\emph{Nat. Rev. Immunol.} 10:301--316.\n\n\\bibitem{Murphy:vw}\nMurphy KP, Travers P, Walport M\n\\newblock (2008) \\emph{{Janeway's Immunobiology}}\n\\newblock (Garland Science), 7 edition.\n\n\\bibitem{smith1985filamentous}\nSmith GP\n\\newblock (1985) Filamentous fusion phage: novel expression vectors that\n  display cloned antigens on the virion surface.\n\\newblock \\emph{Science} 228:1315--1317.\n\n\\bibitem{Vaughan1996}\nVaughan TJ, {et~al.}\n\\newblock (1996) Human antibodies with sub-nanomolar affinities isolated from a\n  large non-immunized phage display library.\n\\newblock \\emph{Nat Biotech} 14:309--314.\n\n\\bibitem{molecules16010412}\nSchirrmann T, Meyer T, Sch{\\\"u}tte M, Frenzel A, Hust M\n\\newblock (2011) Phage display for the generation of antibodies for proteome\n  research, diagnostics and therapy.\n\\newblock \\emph{Molecules} 16:412.\n\n\\bibitem{Boder:1997ii}\nBoder ET, Wittrup KD\n\\newblock (1997) {Yeast surface display for screening combinatorial polypeptide\n  libraries}.\n\\newblock \\emph{Nature Biotechnology} 15:553--557.\n\n\\bibitem{Gai:2007ks}\nGai SA, Wittrup KD\n\\newblock (2007) {Yeast surface display for protein engineering and\n  characterization.}\n\\newblock \\emph{Current Opinion in Structural Biology} 17:467--473.\n\n\\bibitem{Weinstein:2009he}\nWeinstein JA, Jiang N, White RA, Fisher DS, Quake SR\n\\newblock (2009) {High-throughput sequencing of the zebrafish antibody\n  repertoire.}\n\\newblock \\emph{Science (New York, NY)} 324:807--810.\n\n\\bibitem{Robins:2009da}\nRobins HS, {et~al.}\n\\newblock (2009) {Comprehensive assessment of T-cell receptor beta-chain\n  diversity in alphabeta T cells.}\n\\newblock \\emph{Blood} 114:4099--4107.\n\n\\bibitem{Robins:2010hd}\nRobins HS, {et~al.}\n\\newblock (2010) {Overlap and effective size of the human CD8+ T cell receptor\n  repertoire.}\n\\newblock \\emph{Science translational medicine} 2:47ra64--47ra64.\n\n\\bibitem{Mora:2010jx}\nMora T, Walczak AM, Bialek W, Callan CG\n\\newblock (2010) {Maximum entropy models for antibody diversity}.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 107:5405--5410.\n\n\\bibitem{Murugan:2012it}\nMurugan A, Mora T, Walczak AM, Callan CG\n\\newblock (2012) {Statistical inference of the generation probability of T-cell\n  receptors from sequence repertoires.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 109:16161--16166.\n\n\\bibitem{Zvyagin:2014kw}\nZvyagin IV, {et~al.}\n\\newblock (2014) {Distinctive properties of identical twins' TCR repertoires\n  revealed by high-throughput sequencing.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 111:5980--5985.\n\n\\bibitem{Elhanati:2014eu}\nElhanati Y, Murugan A, Callan CG, Mora T, Walczak AM\n\\newblock (2014) {Quantifying selection in immune receptor repertoires.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 111:9875--9880.\n\n\\bibitem{Elhanati:2015tz}\nElhanati Y, {et~al.}\n\\newblock (2015) {Inferring processes underlying B-cell repertoire diversity}.\n\\newblock \\emph{arXiv:1212.3647 [q-bio.QM]}.\n\n\\bibitem{Madi:2014js}\nMadi A, {et~al.}\n\\newblock (2014) {T-cell receptor repertoires share a restricted set of public\n  and abundant CDR3 sequences that are associated with self-related immunity.}\n\\newblock \\emph{Genome Res} 24:1603--1612.\n\n\\bibitem{parameswaran2013convergent}\nParameswaran P, {et~al.}\n\\newblock (2013) Convergent antibody signatures in human dengue.\n\\newblock \\emph{Cell host \\& microbe} 13:691--700.\n\n\\bibitem{Jiang2013}\nJiang N, {et~al.}\n\\newblock (2013) {Lineage Structure of the Human Antibody Repertoire in\n  Response to Influenza Vaccination}.\n\\newblock \\emph{Sci. Transl. Med.} 5:171ra19--171ra19.\n\n\\bibitem{Vollmers2013}\nVollmers C, Sit RV, Weinstein Ja, Dekker CL, Quake SR\n\\newblock (2013) {Genetic measurement of memory B-cell recall using antibody\n  repertoire sequencing.}\n\\newblock \\emph{Proc. Natl. Acad. Sci. U. S. A.} 110:13463--8.\n\n\\bibitem{Laserson2014}\nLaserson U, {et~al.}\n\\newblock (2014) {High-resolution antibody dynamics of vaccine-induced immune\n  responses}.\n\\newblock \\emph{Proc. Natl. Acad. Sci.} 111:4928--4933.\n\n\\bibitem{Galson2014}\nGalson JD, Pollard AJ, Tr\\\"{u}ck J, Kelly DF\n\\newblock (2014) {Studying the antibody repertoire after vaccination: Practical\n  applications}.\n\\newblock \\emph{Trends Immunol.} 35:319--331.\n\n\\bibitem{Wucherpfennig:2007jr}\nWucherpfennig KW, {et~al.}\n\\newblock (2007) {Polyspecificity of T cell and B cell receptor recognition.}\n\\newblock \\emph{Seminars in immunology} 19:216--224.\n\n\\bibitem{Fowler2014}\nFowler DM, Fields S\n\\newblock (2014) {Deep mutational scanning: a new style of protein science}.\n\\newblock \\emph{Nat. Methods} 11:801--807.\n\n\\bibitem{Kinney:2010tn}\nKinney JB, Murugan A, Callan CG, Cox EC\n\\newblock (2010) {Using deep sequencing to characterize the biophysical\n  mechanism of a transcriptional regulatory sequence}.\n\\newblock \\emph{Proc. Natl. Acad. Sci. USA} 107:9158--9163.\n\n\\bibitem{Shusta:1999ky}\nShusta EV, Kieke MC, Parke E, Kranz DM, Wittrup KD\n\\newblock (1999) {Yeast polypeptide fusion surface display levels predict\n  thermal stability and soluble secretion efficiency.}\n\\newblock \\emph{Journal of Molecular Biology} 292:949--956.\n\n\\bibitem{VanAntwerp:2000jf}\nVanAntwerp JJ, Wittrup KD\n\\newblock (2000) {Fine affinity discrimination by yeast surface display and\n  flow cytometry.}\n\\newblock \\emph{Biotechnology progress} 16:31--37.\n\n\\bibitem{Boder:2000ku}\nBoder ET, Midelfort KS, Wittrup KD\n\\newblock (2000) {Directed evolution of antibody fragments with monovalent\n  femtomolar antigen-binding affinity}.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 97:10701--10705.\n\n\\bibitem{Midelfort:2004iq}\nMidelfort KS, {et~al.}\n\\newblock (2004) {Substantial energetic improvement with minimal structural\n  perturbation in a high affinity mutant antibody}.\n\\newblock \\emph{Journal of Molecular Biology} 343:685--701.\n\n\\bibitem{Xu:2000vq}\nXu JL, Davis MM\n\\newblock (2000) {Diversity in the CDR3 region of V(H) is sufficient for most\n  antibody specificities.}\n\\newblock \\emph{Immunity} 13:37--45.\n\n\\bibitem{hoet2005}\nHoet RM, {et~al.}\n\\newblock (2005) Generation of high-affinity human antibodies by combining\n  donor-derived and synthetic complementarity-determining-region diversity.\n\\newblock \\emph{Nat Biotech} 23:344--348.\n\n\\bibitem{Whitlow:1995vw}\nWhitlow M, Howard AJ, Wood JF, Voss EW, Hardman KD\n\\newblock (1995) {1.85 A structure of anti-fluorescein 4-4-20 Fab.}\n\\newblock \\emph{Protein engineering} 8:749--761.\n\n\\bibitem{Reich:2015ep}\nReich LL, Dutta S, Keating AE\n\\newblock (2015) {SORTCERY-A High-Throughput Method to Affinity Rank Peptide\n  Ligands.}\n\\newblock \\emph{Journal of Molecular Biology} 427:2135--2150.\n\n\\bibitem{Liberman:2013hq}\nLiberman G, Benichou J, Tsaban L, Glanville J, Louzoun Y\n\\newblock (2013) {Multi Step Selection in Ig H Chains is Initially Focused on\n  CDR3 and Then on Other CDR Regions.}\n\\newblock \\emph{Frontiers in immunology} 4:274.\n\n\\bibitem{batista1998}\nBatista FD, Neuberger MS\n\\newblock (1998) Affinity dependence of the b cell response to antigen: A\n  threshold, a ceiling, and the importance of off-rate.\n\\newblock \\emph{Immunity} 8:751--759.\n\n\\bibitem{foote1995kinetic}\nFoote J, Eisen HN\n\\newblock (1995) Kinetic and affinity limits on antibodies produced during\n  immune responses.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 92:1254--1256.\n\n\\bibitem{roost1995early}\nRoost HP, {et~al.}\n\\newblock (1995) Early high-affinity neutralizing anti-viral igg responses\n  without further overall improvements of affinity.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 92:1257--1261.\n\n\\end{thebibliography}\n\n\n\\appendix\n\n\\setcounter{figure}{0}\n\\makeatletter \n\\renewcommand{\\thefigure}{S\\@arabic\\c@figure}\n\\makeatother\n\n \n \n\\section{Tite-Seq simulations}\n\nFor Fig.\\ 1 in the main text, we simulated data at nine antigen concentrations ($C = 10^{-9}$ M, $10^{-8.5}$ M, \\ldots, $10^{-4}$ M) for two hypothetical scFvs: one with $K_D = 3\\times 10^{-7}$ M, $A = 300$, $B = 10$, and one with $K_D = 10^{-5}$ M, $A = 1000$, $B = 10$. For each clone and at each concentration, fluorescence signals were simulated for 1000 cells by multiplying the $y$ quantity in Eq.\\ \\ref{eq:y_of_A} by a factor of $\\exp(\\eta)$ where $\\eta$ is a normally distributed random number. Fig.\\ 1D shows the resulting flow cytometry measurements, computed by taking the median of these simulated fluorescence signals.  Curves of the form Eq.\\ \\ref{eq:y_of_A} were fit to these data by minimizing the square deviation between predicted $\\log_{10} y$ values and $\\log_{10}$ flow cytometry measurements. Fig.\\ 1E shows Tite-Seq measurements simulated by sorting these 1000 cells into three bins defined by the following fluorescence boundaries: $(0,30)$ for bin 0, $(30,300)$ for bin 1, and $(300, \\infty)$ for bin 2.  The mean bin number was then computed for each clone at each concentration, and curves of the form $\\log_{10} y$ were fit to mean bin values using least squares optimization. \n\n\n\\section{Yeast display}\n\\subsection{Innoculation aliquots for yeast display \\label{method:pre_measure}}\nTo ensure consistency in yeast display population sizes, we pre-aliquoted yeast cells with consistent densities. For clones, we picked colonies and grew them in sc -trp 2\\% glucose liquid media. For libraries, we resuspended 1 ml$\\cdot$OD from our $-80^{\\circ}$ C library stocks into sc -trp 2\\% glucose liquid media to ensure library diversity. We grew liquid cultures until their OD600 absorption measured between 0.9 and 1.1. We then stored yeast aliquots with 10\\% glycerol at $-80^{\\circ}$ C. For clones, aliquots were meted out in 0.2 ml$\\cdot$OD aliquots. For libraries, aliquots were meted out in 1.5 ml$\\cdot$ OD aliquots. \n\n\\subsection{Yeast display induction and labeling \\label{method:labeling}}\nWe added cell aliquots stored at $-80^{\\circ}$ C to SC -trp + 2\\% glucose media until the OD600 equaled 0.05.  We kept clonal populations above 0.2 ml$\\cdot$OD, and library populations above 3 ml$\\cdot$OD. After 8 hours, we added 25\\% volume of YPD, centrifuged the cells at 3000 rpm for 8 minutes, aspirated the media, and resuspended cells at 0.05 OD600 SC -trp +2\\% galctose media. scFv production was induced in galactose for approximately 16 hours at $22^{\\circ}$ C. We then added 25\\% volume YPD, and spun down the cells at 3000 rpm for 8.  Cells were washed with 100 $\\mu$l of ice cold TBS-BSA. TBS-BSA is made from 1 ml 100 mg/ml BSA added to 9 ml TBS (473 ml of water, 25 ml of 1 M Tris, 2.92 g of NaCl adjusted to pH 8 with NaOH). Cells were then centrifuged, and resuspended in labeling solution containing 0 M or $10^{-8.5}-10^{-4}$ M biotinylated fluorescein, or 1.4 $\\mu$g/ml c-Myc rabbit antibody, per 0.2 ml$\\cdot$OD of cells. Fluorescein volumes were kept at high enough levels to ensure ten times as many fluorescein molecules as scFv molecules, assuming 100,000 scFv per cell. Cells were shaken at 700 rpm for 1 hour at room temperature during labeling. Cells were then centrifuged, and the supernatant was drained. Cells were then twice washed with 1.5 ml ice cold TBS-BSA. Cells were centrifuged at 3,000 rpm for 8 minutes and the supernatant was aspirated. The cells were then suspended in 112.5 $\\mu$l/(ml$\\cdot$OD cells) of a secondary labeling solution having 4 $\\mu$g/ml streptavidin R-PE or 0.8  $\\mu$g/ml BV421 anti-rabbit donkey antibody. Secondary labeling occurred for 30 minutes at 4C at 300 rpm. Cells were then centrifuged at 3,000 rpm for 8 minutes, resuspended in ice cold TBS, and prepared for FACS or flow cytometry analysis. \n\n\\subsection{Flow cytometry and FACS gating strategies}\n\\label{fc_measurements}\nWe measured titration curves by either flow cytometry or FACS sorting for Tite-Seq using similar gating strategies. For flow cytometry, cells were first filtered by their forward scatter channels (fsc) and side scatter channels (ssc). scFv expression was then measured by average BV421 channel values corresponding to c-Myc epitopes on cell surfaces, excluding extreme values. For $K_D$ measurements, we further gated cells by their fluorescein and PE signals. We removed cells with high fluorescein fluorescence, since fluorescein's fluorescence signal is quenched by antibody binding, meaning that non-quenched signal indicates non-specific fluorescein binding. Concurrently, we also removed extreme PE values. We then measured titration curves from average PE channel values, corresponding to fluorescein bound to scFv antibodies. For Tite-Seq, we first filtered cells by fsc and ssc channels. For expression measurements, we sorted cells into one of four gates along the BV421 channel. For Tite-Seq titration curves, we furthered filtered cells by their fluorescein and PE signals. Cells were then sorted into one of four gates by their PE signal values.\n\n\\section{Generation of scFv libraries}\n\nWe obtained custom microarray oligonucleotides from LC Sciences to generate a library of mutant CDR1H ($\\mu$1H) and CDR3H ($\\mu$3H) domains. We created separate libraries for the CDR 1H and 3H regions by performing PCR on these oligonucleotide libraries. CDR3H mutants in the LC sciences microarray library were amplified by PCR using oRAL10 and oRAR10 primers to create $\\mu$3H sequences. CDR1 library sequences ($\\mu$1H) were created by amplifying the LC Sciences microarray library by PCR using oRAL11 and oRAR11 primers. \n\nNon-mutated single CDR regions were created by performing PCR on the pJK36 plasmid  (Fig.~\\ref{fig:start_plasmids}A) with 1H\\_2F and 1H\\_1R primers to create the 1H primer, and 3H\\_2R and 3H\\_1F primers to create the 3H primer. \nBy mixing non-mutated (1H or 3H) primers with library primers ($\\mu$1H or $\\mu$3H) and performing PCR on the pJK36 plasmid we created ~360 bp long mutagenized scFv insertion sequences, iRA10,  with one or both CDR regions mutated. The iRA10 sequence with added Bsal cut sites were made into iRA11 sequences libraries by performing PCR with oRA10 and oRA11 primers. The iRA11 sequences have complementary sticky DNA to the plasmid backbone pRA10 (Fig.~\\ref{fig:pRA_plasmids}A) easing the integration of the sequence into the plasmid.\n\nHaving created library sequences, iRA11, that have sticky single stranded DNA at their ends after BsaI digest, we created a target plasmid for the iRA11 library sequences. The target plasmid pRA10 (Fig.~\\ref{fig:pRA_plasmids}A) was designed to have the same features as the pJK36 plasmid, where the CDR1H and 3H scFv domains were replaced with a cassette containing the toxic ccdB gene  the chloramphenicol marker, and surrounded by BsmBI digest sites. pRA10, was created from Gibson cloning iRA12, iRA13, and iRA14 sequences together. iRA12 contained the BsmBI digest sites, ccdB toxic gene, and chloramphinicol drug resistance markers. iRA12 was created by PCR from pJK14 (Fig.~\\ref{fig:start_plasmids}B) from \\cite{Kinney:2010tn}, which contains the ccdB cassette, with oRA12 and oRA13. iRA13 was created by performing PCR on pJK36 with oRA15 and oRA16 (Fig.~\\ref{fig:start_plasmids}A). iRA14 was created by performing PCR on pJK36 with oRA14 with oRA17 (Fig.~\\ref{fig:start_plasmids}A).  We transformed DB3.1 E.\\ coli, which are ccdB resistant, with the assembled pRA10 plasmid (Fig.~\\ref{fig:pRA_plasmids}A), grew them in ampicillin and chloramphinicol, and then extracted the pRA10 plasmids from {\\em E. coli} using the Qiagen plasmid mini-prep kit.\n\nTo introduce our mutagenized CDR1H and/or CDR3H sequences back into an scFv expressing plasmid, we replaced the ccdB gene in pRA10 with the iRA11 insertions containing our library mutations. To do this we digested both the iRA11 library sequences and the pRA10 plasmid to create sticky DNA sequences that could be easily ligated together (Fig.~\\ref{fig:pRA_plasmids} B).\nWe digested the pRA10 backbone with BsmBI and iRA11 with BsaI. Digesting pRA10 with BsmBI had the additional effect of excising the ccdB and chloramphenicol resistance genes from the plasmid. The BsmBI and BsaI digests were purified using Qiagen's QIAquick PCR purification kit and mixed together at molar ratios of 1:2.5, respectively. The BsmBI and BsaI digest mixtures were ligated with T4 DNA ligase and then dialyzed to remove salts. Electrocompetant DH10B {\\em E. coli} were electroporated with 50 $\\mu$l of ligated DNA. {\\em E. coli} were grown for 1 hour in SOB media, then ampicillin was added and {\\em E. coli} were grown overnight.  Because ccdB is toxic to DH10B cells, only plasmids that were successfully cut and reliagated were able to grow. We used Qiagen's plasmid mini-prep kit to extract amplified pRA11 libraries.  We then chemically transformed EBY100 \\textit{S. cerevisiae} cells for each of the pRA11 libraries (Fig.~\\ref{fig:pRA_plasmids}B). Finally, we induced scFv expression in the transformed \\textit{S. cerevisiae} libraries. We FACS filtered cells which displayed both HA and c-Myc domains in roughly equal amounts to eliminate \\textit{S. cerevisiae} with indels in the scFv domain of their plasmids. From this filtered library we isolated and sequenced 144 clones. We then chose 6 clones to confirm Tite-Seq measurements.\n\n\\section{Tite-Seq implementation}\nEach library was spiked with 0.625\\% pJK37 and $\\Delta$ controls and then subjected to 12 FACS rounds. The first FACS separated cells based on receptor expression approximately evenly into different bins based on average c-Myc labeling. The other 11 FACS separated cells were grown in different fluorescein concentrations approximately evenly based on the amount of bound fluorescein. The affinity FACS gates were drawn to have roughly log-linear mean values. Cells were sorted into 1 ml 2X YPAD media contained in a rounded 5 ml polypropylene tube. Cells were regrown overnight in sc -trp 2\\% glucose. 25 ml$\\cdot$OD of cell populations were spun down and resuspended in 200 $\\mu$l 0.5 mm glass beads, 200 $\\mu$l of Phenol/chloroform/isoamyl alcohol and 200 $\\mu$l of yeast lysis buffer (982 ml water, 10 ml  1 M NaCl, 2 ml Triton X-100, 1 ml 1 M Tris pH 8.0, 0.1 ml 1 M EDTA, 5 ml 20\\%SDS). The cell/phenol/glass bead/yeast lysis mixture was vortexed for 30 minutes. 200 $\\mu$l water was added. We then spun the tubes down five times, removing the aqueous layer and adding different media between each centrifugation of cells in the following order: 2  x 200 $\\mu$l of Phenol/chloroform/isoamyl alcohol, 2 x 200 $\\mu$l of chloroform/isoamyl alcohol, 1 ml ice cold 100\\% EtOH. We then spun the tubes down, aspirated the EtOH, and added 250 $\\mu$l  70\\% ice cold EtOH. We again spun the tubes down, aspirated the EtOH, and resuspended purified DNA in 100 $\\mu$l of IDTE.\n\nWe then performed PCR on our phenol purified DNA with bar coded primers L2AF\\_XX and L2AF\\_XX (Fig.~\\ref{fig:pRA_plasmids}B). Here the XX refers to 1 of 48 possible bar-code combinations (see section 4 of Appendix G). We used variable length, 7-10 bp, bar-codes to increase sequence variability during DNA sequencing.  We then pooled these sequences and performed a second round of PCR with Illumina adapter primers PE1v3ext and PE2v3. PCR products from the single library CDR1H and CDR3H FACS + 2.5\\% molarity random PhiX DNA submitted separately for Illumina Hi-Seq analysis. \n\nWe assigned sequence origins according to the 7-10 bp barcodes. Correspondingly to the barcode length we used the 8-11th to 14th bp to confirm the orientation of the sequence (i.e. containing CDR1H or CDR3H region). We categorized each read solely as a function of its CDR1H and CDR3H region. We excluded sequences that we did not design, and those with mismatching bar-codes.\n\n\\section{Signal reconstruction from sequence data}\nHere we describe how to reconstruct the fluorescence signal of a large number of variants from sequence data following FACS sorting.\n\nAfter processing, the data can be summarized by the number of times a given scFv variant $s_i$ was matched to a sequence read in a given FACS bin $j=0,\\ldots,3$. We call this number $M_{j}(s_i)$.\nEach sequence $s_i$ was assigned a probability distribution $p_{j}(s_i)$ over bin index $j$, represented by histograms in Fig.~1D, and defined as\n\n", "itemtype": "equation", "pos": 10798, "prevtext": "\n\n \n\n\n\\title{{Measuring the sequence-affinity landscape of antibodies with massively parallel titration curves}}\n\n\\author{Rhys M. Adams$^{1}$, Justin B. Kinney$^{2,*}$, Thierry\n  Mora$^{3,*}$, and Aleksandra M. Walczak$^{1,*}$}\n\n\\affiliation{$^{1}$Laboratoire de Physique Th\\'eorique, UMR8549, CNRS\n  and \\'Ecole Normale Sup\\'erieure,\\\\\n24, rue Lhomond, 75005 Paris,\n  France}\n\n\\affiliation{$^{2}$Simons Center for Quantitative Biology, Cold Spring\n  Harbor Laboratory, 1 Bungown Rd., Cold Spring Harbor, NY, 11724,\n  USA}\n\n\\affiliation{$^{3}$Laboratoire de Physique Statistique, UMR8550, CNRS\n  and \\'Ecole Normale Sup\\'erieure,\\\\\n24, rue Lhomond, 75005 Paris, France\\\\\n$^*$Equal contribution}\n\n\\begin{abstract}\n \nDespite the central role that antibodies play in the adaptive immune system and in biotechnology, much remains unknown about the quantitative relationship between an antibody's amino acid sequence and its antigen binding affinity. Here we describe a new experimental approach, called Tite-Seq, that is capable of measuring binding titration curves and corresponding affinities for thousands of variant antibodies in parallel. The measurement of titration curves eliminates the confounding effects of antibody expression and stability inherent to standard deep mutational scanning assays. We demonstrate Tite-Seq on the CDR1H and CDR3H regions of a well-studied scFv antibody. Our data sheds light on the structural basis for antigen binding affinity, and suggests a dominant role for CDR1H in establishing antibody stability. Tite-Seq fills a large gap in the ability to measure critical aspects of the adaptive immune system, and can be readily used for studying sequence-affinity landscapes in other protein systems.\n\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n \nDuring an infection, the immune system must recognize and neutralize invading pathogens. B-cells contribute to immune defense by expressing receptors, called antibodies, that bind specifically to foreign antigens. The astonishing capability of antibodies to recognize virtually any foreign molecule has also been exploited by scientists for a wide variety of applications, and antibodies now play central roles in a variety of experimental techniques (immunofluorescence, western blots, ChIP-Seq, etc.). Antibody-based therapeutic drugs have also been developed for treating a wide variety of diseases \\cite{Chan2010}.\n\nMuch is known about the qualitative mechanisms of antibody generation and function \\cite{Murphy:vw}. The antigenic specificity of antibodies in humans, mice, and most jawed vertebrates is primarily governed by six complementarity determining regions (CDRs), each roughly 10 amino acids long.  Three CDRs (denoted CDR1H, CDR2H, and CDR3H) are located on the antibody heavy chain, and three are on the light chain.  During B-cell differentiation, these six sequences are randomized through V(D)J recombination, then selected for functionality and for the ability to avoid recognizing host antigens. Upon participation in an immune response, CDR regions can further undergo somatic hypermutation and selection, yielding higher-affinity antibodies for specific antigens. \n\nMany high-throughput techniques for assaying and selecting antibodies are currently available. Many methods, including phage display \\cite{smith1985filamentous,Vaughan1996,molecules16010412} and yeast display \\cite{Boder:1997ii,Gai:2007ks} technologies, have been developed for artificially selecting and optimizing antibodies in vitro. More recently, advances in DNA sequencing technology have made it possible to effectively monitor antibody and T-cell receptor diversity within immune repertoires, e.g. in healthy individuals \\cite{Weinstein:2009he,Robins:2009da,Robins:2010hd,Mora:2010jx,Murugan:2012it,Zvyagin:2014kw,Elhanati:2014eu,Elhanati:2015tz}, in specific tissues \\cite{Madi:2014js}, in individuals with diseases \\cite{parameswaran2013convergent} or following vaccination \\cite{Jiang2013,Vollmers2013,Laserson2014,Galson2014}.\n\nMany questions remain about basic aspects of the quantitative relationship between antibody sequence and antigen binding affinity, such as the extent of poly-specificity \\cite{Wucherpfennig:2007jr}, i.e., how many different antibody sequences bind a given antigen with a specified affinity, or the role that epistatic effects play in determining the qualitative geometry of the sequence-affinity landscape. These aspects are important for understanding the effectiveness of somatic hypermutation,\nand more generally for interpreting repertoire surveys and using them for diagnosis.\n\nIn recent years, a variety of ``deep mutational scanning'' (DMS) assays \\cite{Fowler2014}, have been developed for measuring protein sequence-function relationships in a massively parallel manner. The general format of DMS assays provides a promising approach for measuring the affinity of many protein sequences in a single experiment, and thus gaining insight into the sequence-affinity landscape. None of the methods yet described, however, have succeeded in providing quantitative measurements of binding affinity -- i.e., dissociation constant measurements in molar units. \n\nTo enable massively parallel measurements of binding affinity for antibodies and other proteins, we have developed an assay called ``Tite-Seq.''  Tite-Seq works by building on the capabilities of Sort-Seq, an experimental strategy that was first developed for studying transcriptional regulatory sequences in bacteria \\cite{Kinney:2010tn}. Sort-Seq combines fluorescence-activated cell sorting (FACS) with high-throughput sequencing to provide massively parallel measurements of cellular fluorescence. In the Tite-Seq assay, Sort-Seq is applied to antibodies displayed on the surface of yeast cells and incubated with antigen at a wide range of concentrations. From the resulting sequence data, thousands of antibody-antigen titration curves and their corresponding dissociation constants (here denoted $K_D$) can be computed. \n\nBy assaying full titration curves, Tite-Seq is able to measure affinities over many orders of magnitude. Moreover, the resulting affinity values are not confounded by variation in protein expression or stability, as is the case with standard DMS assays. In fact, Tite-Seq readily provides separate measurements of protein expression level, which can serve as a proxy measurement of theromostability \\cite{Shusta:1999ky}. Finally, unlike other DMS experiments based on phage-display or ribosome-display techniques, the yeast display platform used by Tite-Seq enables simple low-throughput validation measurements \\cite{VanAntwerp:2000jf}. \n\nWe performed Tite-Seq on a protein library derived from a well-studied short chain variable fragment (scFv) antibody specific to fluorescein \\cite{Boder:1997ii,Boder:2000ku}. Mutations were restricted to the CDR1H and CDR3H regions, which are known to play an important role in the antigen recognition of this scFv \\cite{Boder:2000ku,Midelfort:2004iq} and of antibodies in general \\cite{Xu:2000vq,hoet2005}. The resulting affinity measurements were validated with titration curves for a handful of clones measured using standard flow cytometry. \n\nOur measurements reveal a large and unexpected difference between the effects of mutations in CDR1H and in CDR3H. Comparing the effects of mutations with the known antibody-fluorescein co-crystal structure \\cite{Whitlow:1995vw} also identifies a strong relationship between the effect that a position has on affinity and the number of molecular contacts that the residue at that position makes within the antibody. \n\n\n\\section{Results}\n \n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_1.pdf}\n\\caption{\n{\\bf Illustration of Tite-Seq.} \n(A) A library of variant antibodies (various colors) are displayed on the surface of yeast cells (tan). Each cell expresses a single variant, while each variant is expressed by multiple cells. (B) The library is exposed to antigen (green triangles) at a defined concentration, cell-bound antigen is fluorescently labeled, and FACS is used to sort cells into bins according to measured fluorescence. (C) The antibody variants in each bin are sequenced and the distribution of each variant across bins is computed (histograms; colors correspond to specific variants). A summary statistic (dot), such as mean bin number, is used to quantify the average amount of bound antigen per cell. (D) Antibody-antigen $K_D$ values (vertical lines) can be read from titration curves (solid lines) fit to measurements of average cellular fluorescence over a wide range of concentrations (dots). Such curves can be directly measured using flow cytometry, but only in a low-throughput manner. (E) Tite-Seq consists of performing the Sort-Seq experiment in panels A-C at multiple antigen concentrations, then fitting titration curves using the histogram summary statistic (e.g., mean bin number) as a proxy for average cellular fluorescence. This provides a massively parallel way to measure antibody $K_D$ values. Tite-Seq results corresponding to the titration curves in panel E were simulated using 3 sorting bins; see Appendix A for simulation details. \n}\n\\label{figure1}\n\\end{figure}\n\n\n\\subsection{Overview of Tite-Seq}\nOur general strategy is illustrated in Fig.\\ 1. First, a library of variant antibodies is displayed on the surface of yeast cells (Fig.\\ 1A). The composition of this library is such that each cell displays a single antibody variant, and each variant is expressed on the surface of multiple cells. Cells are then incubated with the antigen of interest, bound antigen is fluroescently labeled, and fluorescence-activated cell sorting (FACS) is used to sort cells one-by-one into multiple``bins'' based on this fluorescent readout (Fig.\\ 1B). Deep sequencing is then used to survey the antibody variants present in each bin. Because each variant antibody is sorted multiple times, it will be associated with a histogram of counts spread across one or more bins (Fig.\\ 1C). The spread in each histogram is due to cell-to-cell variability in antibody expression, and to the inherent noisiness of flow cytometry measurements. Finally, the histogram corresponding to each antibody variant is used to compute an ``average bin number'' (Fig.\\ 1C, dots), which serves as a proxy measurement for the average amount of bound antigen per cell. \n\nIt has previously been shown that $K_D$ values can be accurately measured using yeast-displayed antibodies by taking titration curves, i.e., by measuring the average amount of bound antigen as a function of antigen concentration \\cite{VanAntwerp:2000jf, Gai:2007ks}. The average fluorescence $y$ of labeled cells is expected to be related to antigen concentration via\n\n", "index": 1, "text": "\\begin{equation}\ny = B + A \\frac{C}{C+ K_D}\n\\label{eq:y_of_A}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"y=B+A\\frac{C}{C+K_{D}}\" display=\"block\"><mrow><mi>y</mi><mo>=</mo><mrow><mi>B</mi><mo>+</mo><mrow><mi>A</mi><mo>⁢</mo><mfrac><mi>C</mi><mrow><mi>C</mi><mo>+</mo><msub><mi>K</mi><mi>D</mi></msub></mrow></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\nDuring PCR, sequence counts differed from the number of cells sorted. To correct for this we scaled the number of sequences by $k_{j}$ to match the number of sorted cells. The $k_{j}$ scaling factor is the ratio of the number of cells sorted into a bin, $N_{j}$, to the total number of reads from that bin,\n\n", "itemtype": "equation", "pos": 56045, "prevtext": "\nwhere $A$ is proportional to the number of functional antibodies displayed on the cell surface, $B$ accounts for background fluorescence, and $C$ is the concentration of free antigen in solution. Fig.\\ 1D illustrates the shape of curves having this form. By using flow cytometry to measure $y$ on clonal populations of yeast at different antigen concentrations $C$, one can fit curves to Eq.\\ \\ref{eq:y_of_A} and thereby learn $K_D$. Such measurements, however, can only be performed in a low-throughput manner. \n\nTite-Seq allows thousands of titration curves to be measured in parallel. The Sort-Seq procedure illustrated in Fig.\\ 1A-C is performed at multiple antigen concentrations, and the resulting average bin number for each variant is plotted against concentration. Curves of the form in Eq.\\ \\ref{eq:y_of_A} are fit to these proxy measurements, and $K_D$ values are thereby inferred for each variant. \n\nWe emphasize that $K_D$ values cannot, in general, be accurately inferred from Sort-Seq experiments performed at a single antigen concentration. Because the relationship between binding and $K_D$ is sigmoidal, the amount of bound antigen provides a useful readout of $K_D$ only when the concentration of antigen used in the labeling procedure is comparable in magnitude to $K_D$. However, single mutations within a protein binding domain often change $K_D$ by multiple orders of magnitude. Sort-Seq experiments used to measure the sequence-affinity landscape must therefore be carried out over a range of concentrations large enough to encompass this variation. \n\nFurthermore, as illustrated in Fig.\\ 1D, different antibody variants often lead to substantially different levels of functional antibody expression on the yeast cell surface. If one performs Sort-Seq at a single antigen concentration, high affinity (low $K_D$) variants with low expression (blue variant) may bind less antigen than low affinity (high $K_D$) variants with high expression (orange variant). Only by measuring full titration curves can the effect that sequence has on affinity be deconvolved from sequence-dependent effects on functional protein expression. \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_2.pdf}\n\\caption{\n{\\bf Antibody constructs used in this paper.}\n(A) Co-crystal structure 4-4-20 antibody; PDB code 1FLR \\cite{Whitlow:1995vw}. The CDR1H and CDR3H regions are colored blue and red, respectively. (B) The scFv construct, from \\cite{Boder:1997ii} that was used in this study. Biotinylated fluorescein was used as the antigen, and bound antigen was visualized using streptavidin-RPE (PE). The amount of surface-expressed protein was visualized separately by labeling the c-Myc epitope at the C-terminus of the scFv construct with Brilliant Violet 421 (BV). Approximate location of the CDR1H (blue) and CDR3H (red) regions within the scFv are illustrated. (C) The gene coding for this scFv construct.  The six CDR regions indicated. The WT sequence of the two variable regions (10 aa each) are also shown. (D) Composition of the CDR1H and CDR3H scFv libraries.\n}\n\\label{figure2}\n\\end{figure}\n\n\n\\subsection{Proof-of-principle Tite-Seq experiments}\n\nTo test the feasibility of Tite-Seq, we used a well-characterized antibody-antigen system: the 4-4-20 single chain variable fragment (scFv) antibody \\cite{Boder:1997ii}, which binds the small molecule fluorescein with $K_D = 0.7 \\pm 0.3$ nM \\cite{Boder:2000ku}. This system was used in early work to establish the capabilities of yeast display, and a high resolution co-crystal structure of the 4-4-20 antibody bound to fluorescein has been determined \\cite{Whitlow:1995vw} (Fig.\\ 2A). An ultra-high-affinity ($K_D = 270$ fM) variant of this scFv, called 4m5.3, has also been found \\cite{Boder:2000ku}. In what follows, we refer to the 4-4-20 scFv from \\cite{Boder:1997ii} as WT, and the 4m5.3 variant from \\cite{Boder:2000ku} as OPT. \n\nThe scFv was expressed on the surface of yeast as part of the multi-domain construct described in \\cite{Boder:1997ii} (Fig.\\ 2B). Following \\cite{Boder:2000ku}, we used fluorescein-biotin as the antigen and labeled scFv-bound antigen with streptavidin-RPE (PE).  \nThe amount of surface-expressed protein was separately quantified by labeling the C-terminal c-Myc tag using anti-c-Myc primary antibodies and secondary antibodies conjugated to Brilliant Violet 421 (BV). See Appendix B for details on yeast display and labeling. \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_3.pdf}\n\\caption{\n{\\bf Example titration curves.}\n(A) Flow cytometry measurements and inferred titration curves for the WT scFv and two variant scFvs (C5 and C39). Different shades indicate results from three different replicate experiments. (B) Tite-Seq measurements and fitted curves for the same scFvs as in panel A. Different shades indicate results for different synonymous variants; not all synonymous variants are shown. In both panels, the term ``(adjusted)'' labeling the ordinate refers to the fact that the inferred background $B$ was subtracted from the data points and from the fitted curves. Vertical lines show $K_D$ values corresponding to each titration curve.\n}\n\\label{figure3}\n\\end{figure}\n\n\nTwo different scFv libraries were assayed (Fig.\\ 2C): one with a 10 aa variable region encompassing CDR1H (blue), and one with a 10 aa variable region encompassing CDR3H (red). The composition of each library is summarized in Fig.\\ 2D; each library contained the WT sequence, all 600 single-codon variants, a sample of 1100 double codons missense variance, and a sample of 150 triple codon variants. See Methods and Appendix C for details on library generation. As a negative control, we used a non-functional scFv referred to here as $\\Delta$.\n\nTite-Seq was carried out as follows. Approximately $3 \\times 10^6$ yeast cells expressing scFv variants in either the CDR1H or CDR3H libraries were incubated with fluorescein-biotin at one of the following concentrations: $0$ M, $10^{-8.5}$ M, $10^{-8}$ M, $10^{-7.5}$ M, $10^{-7}$ M, $10^{-6.5}$ M, $10^{-6}$ M, $10^{-5.5}$ M, $10^{-5}$ M, $10^{-4.5}$ M, or $10^{-4}$ M. After PE labeling of bound antigen, $\\sim 10^6$ cells were sorted into four bins using FACS. The bins used for these sorts are shown in Figs.\\ S1A,B; the number of cells sorted into each bin is shown in Fig.\\ S2A. Each bin of cells was regrown and bulk DNA was extracted. Variant CDR1H and CDR3H regions were then PCR amplified and sequenced using paired-end Illumina sequencing (see Appendix D for details). The final data set consisted of $\\sim 2 \\times 10^6$ sequences per bin (Fig.\\ S2B). For each variant sequence in each bin, a ``weighted average bin'' value was computed as described in Appendix E. \n\nA $K_D$ value was then inferred for each variant DNA sequence by fitting a function of the form in Eq.\\ \\ref{eq:y_of_A} to these weighted average bin values. In particular, the background term $B$ for each clone  was determined from the 0 M fluorescein measurement, as well as from the average of lowest 10\\% of fluorescent measurements, assumed to correspond to non-functional constructs (see Appendix F for details). After inspecting the resulting titration curves, we judged that $K_D$ values could not be confidently called below $10^{-9}$ M and above $10^{-5}$ M.\n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure*}\n\\noindent\n\\includegraphics[width=\\linewidth]{figure_4.pdf}\n\\caption{\n{\\bf Accuracy and precision of Tite-Seq.}\n(A) Tite-Seq measurements of $K_D$ for the WT scFv (white), three variant CDR1H clones (blue), and two variant CDR3H clones (red). Error bars on flow $K_D$ values are the same for all data points; they show the average mean squared error computed computed using three replicate measurements for each clone. Error bars on Tite-Seq $K_D$ values were estimated using the regression fit in panel B. (B) Estimated signal-to-noise ratios (S/N) of Tite-Seq measurements as a function of the number of sequence reads. Solid lines indicate S/N values computed for CDR1H (blue) and CDR3H (red) variants within twenty equally populated bins along the abscissa. Dotted lines indicate linear regression fits. (C) Density plots of $K_D$ and $E$ measurements for variants in the CDR1H (left) and CDR3H (right) libraries. White dots indicate measurements for synonymous mutants of the WT scFv (18 for CDR1H, 15 for CDR3H). $K_D$ values $\\geq 10^{-5}$ M and $\\leq 10^{-9}$ M are not shown. \n}\n\\label{figure4}\n\\end{figure*}\n\n\nDuring each Tite-Seq experiment, we also measured the effects of sequence variation on scFv expression. For each scFv library, we labeled the c-Myc tag of expressed constructs with BV as described above, then sorted and sequenced cells (Figs.\\ S1C,D and Fig.\\ S2A,B). In what follows, we use $E$ to denote the weighted average bin value for each variant in each library, normalized by the mean of such measurements for WT scFvs in that same library. \n\n\\subsection{Low-throughput validation experiments}\n\nTo judge the accuracy of Tite-Seq, we performed separate titration curve measurements on individual scFv clones. In addition to the WT, OPT, and $\\Delta$, we measured three clones from the CDR1H library (named C5, C7, and C39) and three clones from the CDR3H library (C45, C93, C133). Each clone underwent the same labeling procedure as in the Tite-Seq experiment, after which median fluorescence values were measured using standard flow cytometry. $K_D$ values were then inferred by fitting titration curves of the form in Eq.\\ \\ref{eq:y_of_A}; $B$ was determined from data taken at 0 M fluorescein and from measurements on $\\Delta$. Three replicate titration curves were taken for each clone.\n\n\\subsection{Tite-Seq can measure dissociation constants}\n\nFig.\\ 3A shows flow cytometry measurements along with fitted curves and $K_D$ values for three scFv clones: WT, C5, and C39. Corresponding Tite-Seq data and results shown in Fig.\\ 3B. This figure provides a sense for how precisely titration curves can be measured by each method. Although individual data points can be noisy, fitting curves to multiple data points nevertheless provide reasonably accurate measurements of affinity. The accuracy of these measurements is increased by averaging over replicates. \n\nFig.\\ 4A compares the $K_D$ values measured by Tite-Seq to those measured by flow cytometry for WT and the five library clones found to have $K_D$ values within the range of detection ($10^{-9}$ M to $10^{-5}$ M). For the CDR3H clone C45, which is not plotted, Tite-Seq yielded $K_D \\geq 10^{-5}$ M whereas flow cytometry gave $K_D = 10^{-5.23 \\pm 0.39}$ M. As expected, our three $K_D$ measurements for OPT (CDR1H Tite-Seq, CDR3H Tite-Seq, and flow cytometry) were all at or below the detection boundary of $10^{-9}$ M.\n\nError bars on flow cytometry $K_D$ values were computed using the average variance observed in replicate measurements. The computation of error bars on Tite-Seq $K_D$ values was more involved: measurements on synonymous variants were used to estimate the signal-to-noise ratio (S/N) as a function of the number of sequence reads; this dependence of S/N on read number was then used to estimate error bars on Tite-Seq $K_D$ values. The S/N values observed for each of the two libraries are illustrated in Fig. 4B. Details on error estimates are provided in Appendix F. \n\nFig.\\ 4A reveals a strong correspondence between the Tite-Seq and flow cytometry $K_D$ values. There is a detectable bias, but it is small compared to the $100$-fold range of $K_D$ values measured. The robustness of Tite-Seq is further illustrated by the consistency of $K_D$ values measured for the WT scFv in the two different libraries: $K_D = 10^{-8.20 \\pm 0.05}$ M for CDR1H, $K_D = 10^{-8.04 \\pm 0.21}$ M for CDR3H. These measurements are also consistent with the flow cytometry measurement of $K_D = 10^{-7.52 \\pm 0.40}$ M. We note that the Tite-Seq $K_D$ measurements for the WT scFv are about a factor of 10 larger than the previously measured value of $K_D = 0.7 \\pm 0.3$ nM \\cite{Boder:2000ku}. This is likely due to differences in buffers: we used a TBS buffer with more salt (700 mM NaCl) than the PBS buffer used by \\cite{Boder:2000ku} (150 mM NaCl), a difference that is expected to increase $K_D$.  \n\nThe necessity of performing $K_D$ measurements over a wide range of antigen concentrations is illustrated in Fig.\\ S3. At each antigen concentration used in our Tite-Seq experiments, the enrichment of scFvs in the high-PE bins correlated poorly with the $K_D$ values inferred from full titration curves. Moreover, at each antigen concentration used, a detectable correlation between $K_D$ and enrichment was found only for scFvs with $K_D$ values close to that concentration. \n\nFig.\\ S4 suggests a possible reason for the weak correlation between enrichment in high-PE bins and $K_D$ values. We found that, at saturating concentrations of fluorescein ($2\\, \\mu$M), cells expressing the OPT scFv bound twice as much fluorescein as cells expressing the WT scFv. This difference was not due to variation in the total amount of displayed scFv, which one might control for by labeling the c-Myc epitope as in \\cite{Reich:2015ep}. Rather, this difference in binding reflects a difference in the fraction of displayed scFvs that functioned properly. Yeast display experiments performed at a single antigen concentration cannot distinguish such differences in scFv functionality from differences in scFv affinity.\n\n\\subsection{Differing effects of mutations in CDR1H and CDR3H}\n\nIn both the CDR1H and CDR3H libraries, a large fraction of mutations (41\\% for CDR1H, 58\\% for CDR3H) increased $K_D$ above our detection limit of $10^{-5}$ M. A much smaller fraction of variants (2.2\\% for CDR1H, 5.4\\% for CDR3H) had $K_D$ values below our measurement threshold of $10^{-9}$ M. Both of these results suggest that binding affinity is more sensitive to variation in CDR3H than to variation in CDR1H, a finding consistent with the conventional understanding of antibody function \\cite{Xu:2000vq,Liberman:2013hq}. This difference, however, is somewhat modest. \n\nA much more striking difference between CDR1H and CDR3H was observed in how mutations affected expression of scFvs on the yeast cell surface. This difference can be seen in Fig.\\ 4C, which provides a global view of the $K_D$ and $E$ values measured by Tite-Seq. This landscape shows that expression is more sensitive to mutations in CDR1H than in CDR3H. For instance, both CDR1H and CDR3H showed similar numbers of variants with $E > 1.25$ (5.8\\% vs.\\ 5.9\\%, respectively), but CDR1H showed 65\\% more variants with $E < 0.75$ (56\\% vs.\\ 34\\%), and three times more variants with $E < 0.5$ (31\\% vs.\\ 10\\%). \n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_5.pdf}\n\\caption{\n{\\bf Effects of substitution mutations.} \nHeatmaps show the measured effects on affinity (A,B) and expression (C,D) of all single amino acid substitutions within the variables regions of CDR1H (A,C) and CDR3H (B,D). White dots indicate residues of the WT scFv. Green dots indicate non-WT residues in the OPT scFv.}\n\\label{figure5}\n\\end{figure}\n\n\n \n\\graphicspath{{\"./Main_figures/\"}}\n\\begin{figure}\n\\noindent\n\\includegraphics[width={\\linewidth}]{figure_6.pdf}\n\\caption{\n{\\bf Structural context of mutational effects.} \n(A) Crystal structure \\cite{Whitlow:1995vw} of the two variable\nregions of the WT antibody in complex with fluorescein (green). Each\nresidue (CDR1H: positions 28-37; CDR3H: positions 100-109) is colored\naccording to the $S_K$ and $S_E$ values computed for that\nposition. These variables, $S_K$ and $S_E$, respectively quantify the\nsensitivity of $K_D$ and $E$ to amino acid substitutions at specified\npositions; see Eqs.~\\ref{SK} and \\ref{SE} for definitions. (B,C) For each position in the CDR1H and CDR3H variable regions, $S_K$ is plotted against either (B) the number of contacts the WT residue makes within the protein structure, or (C) the distance of the WT residue to the fluorescein antigen. \n}\n\\label{figure6}\n\\end{figure}\n\n\nThese differences between CDR1H and CDR3H can also be seen in Fig.\\ 5, which shows the measured effect of each substitution mutation on affinity and expression. Figs.\\ 5A,B reveal that CDR1H and CDR3H exhibit similar substitution-affinity landscapes. In both regions, the large majority of substitutions increase $K_D$, and mutations that decrease $K_D$ tend to cluster at a small number of residue positions (CDR1H positions 28, 31, and 37, and CDR3H positions 104 and 108). Figs.\\ 5C and 5D, which show the substitution-expression landscape, differ more substantially. Specifically, substitutions at positions 31 and 34-37 in CDR1H affect expression, on average, much more than do mutations at any of the CDR3H positions. \n\nTo further validate Tite-Seq affinity measurements, we examined positions in the high affinity mutant OPT that differ from WT and that lie within the variable regions tested here. As illustrated in Fig.\\ 5A,B, five of the six OPT-specific mutations are neutral or reduce $K_D$. The remaining mutation, D106E, has previously been shown to require co-mutation with S101A in order to increase affinity \\cite{Midelfort:2004iq}.\n\n\\subsection{Structural correlates of the sequence-affinity landscape}\n\nNext we asked whether the sensitivity of affinity and expression values to the identity of the residue at each variable position could be understood from a structural perspective. To quantify this sensitivity at each position $i$, we computed two quantities:\n\\begin{eqnarray}\\label{SK}\nS^i_K &=& \\sqrt{\\left\\langle \\left( \\log_{10} K_D^{ia} - \\log_{10} K_D^{\\rm WT} \\right)^2 \\right\\rangle_a},  \\\\\n\\label{SE}\nS^i_E &=& \\sqrt{\\left\\langle \\left( E^{ia} - E^{\\rm WT} \\right)^2 \\right\\rangle_a}.\n\\end{eqnarray}\nHere, $K_D^{\\rm WT}$ and $E^{\\rm WT}$ respectively denote the dissociation constant and expression level measured for the WT scFv, $K_D^{ia}$ and $E^{ia}$ denote analogous quantities for the scFv with a single substitution mutation of amino acid $a$ at position $i$, and $\\langle \\cdot \\rangle_a$ denotes an average computed over the 19 non-WT amino acids at that position. \n\nFig.\\ 6A shows the WT CDR1H and CDR3H variable regions in complex with fluorescein. Each residue is colored according to the $S_K$ and $S_E$ values computed for its position. As expected from Figs.\\ 4C and 5C,D, the positions that strongly affect expression are located in CDR1H. To get a better understanding of what aspects of the structure might govern affinity, we plotted $S_K$ values against two other quantities: the number of amino acid contacts made by the WT residue within the antibody structure (Fig.\\ 6B), and the distance between the WT residue and the antigen (Fig.\\ 6C). We found a strong correlation between $S_K$ and the number of contacts, but no significant correlation between $S_K$ and distance to antigen. $S_E$ did not correlate significantly with either of these variables (see Fig.\\ S5).\n\n\n\n\\section{Discussion}\n \nWe have described a massively parallel assay, called Tite-Seq, for measuring the sequence-affinity landscape of antibodies. Although Tite-Seq was demonstrated here in the context of antibody-antigen binding, this assay can be used to study any receptor-ligand binding system that is compatible with yeast display.\n\nAs one application, we found that Tite-Seq measurements can help elucidate the structural basis of protein sequence-function relationships. For the fluorescein-binding scFv antibody studied here, we observed that the number of contacts that an amino acid has with other residues was highly correlated with how strongly mutations to that amino acid affected antigen-binding affinity. By contrast, we found no significant correlation between the distance of an amino acid from the antigen and the magnitude of mutational effects on affinity. This suggests that protein residues primarily affect binding affinity indirectly, via interactions with other residues, rather than through direct interactions with the antigen. \n\nWe also found differing effects between CDR1H and CDR3H. As expected, we found that variation in CDR3H had a (modestly) larger effect on affinity than variation in CDR1H. Somewhat unexpectedly, we also found that variation in CDR1H affects protein expression much more strongly than variation in CDR3H. Surface expression in the yeast display system provides a proxy readout of thermostability. Our observation therefore suggests that CDR1H plays a much larger role than CDR3H in stabilizing antibody structure. Together, these two findings suggest a biochemical rational for why CDR3H is more likely than CDR1H to be mutated in functioning receptors \\cite{Liberman:2013hq}, why it acquires mutations earlier than other CDRs \\cite{Liberman:2013hq}, and why variation in CDR3H is often sufficient to establish antigen specificity \\cite{Xu:2000vq}.\n\nThe range of affinities measured in our Tite-Seq experiments include a substantial fraction of the physiological range relevant to affinity maturation ($\\sim 10^{-6}$ M to $10^{-10}$ M) \\cite{batista1998,foote1995kinetic, roost1995early}. Experimental details made it difficult for us to measure affinities of $\\lesssim 10^{-9}$ M, but this limitation might be alleviated with improvements to our labeling protocol. We therefore suggest that future Tite-Seq experiments might be useful for mapping the sequence-affinity trajectories of antibodies during the affinity maturation process.\n\nMany DMS experiments for measuring protein sequence-affinity relationships have been described in recent years \\cite{Fowler2014}, including methods that combine Sort-Seq with yeast display \\cite{Reich:2015ep}. Such approaches apply a selection procedure to a library of variant proteins, then use the enrichment of each protein variant as a proxy measurement of the affinity. In particular, Reich et al. \\cite{Reich:2015ep} recently showed that such measurements can provide approximate values for the relative rank-order of $K_D$ values (at least when the variable protein is an unstructured peptide). \n\nTite-Seq differs fundamentally from prior DMS experiments in that full titration curves, not enrichment statistics, are used to measure binding affinities. The measurement of titration curves provides three major advantages. First, this determines absolute $K_D$ values (in units of concentration), not just rank-order values. Second, because ligand binding is a sigmoidal function of affinity, DMS experiments performed at a single ligand concentration will become less sensitive the more receptor $K_D$s differ from ligand concentration. Mutations within a protein's binding domain, however, often change $K_D$ by multiple orders of magnitude. Titration curve measurements integrate information over a range of concentrations large enough to measure these effects. \n\nFinally, protein sequence determines not just ligand-binding affinity, but also the amount of surface-displayed protein and the fraction of this protein that is functional. As demonstrated in our experiments, these confounding effects can strongly distort yeast display affinity measurements made at a single antigen concentration. The titration curves measured by Tite-Seq, however, are able to disambiguate these effects. More generally, changing a protein's amino acid sequence can be expected to change multiple biochemical properties of that protein. Our work emphasizes the importance of designing massively parallel assays appropriately in order to disentangle these properties so that measurements of the specific activity of interest can be obtained. \n\n\n\n\\section{Methods}\n \nVariant CDR3H and CDR1H regions were generated using microarray-synthesized oligos (LC Biosciences, Houston TX. USA).  These were inserted into the 4-4-20 scFv of \\cite{Boder:1997ii} using cassette-replacement restriction cloning as in \\cite{Kinney:2010tn}, thereby yielding $\\gtrsim 10^8$ transformants. EYB100 yeast \\cite{Boder:1997ii} were transformed with scFv-expressing plasmids using standard methods, yielding providing $\\gtrsim 10^5$ transformants. Prior to labeling, OPT- and $\\Delta$-displaying yeast were spiked into the CDR3H and CDR1H libraries to provide internal positive and negative controls. Further experimental details are provided in Appendices B-D. The used oligos are reported in Appendix G.\n\n\n \n{\\bf Acknowledgements.} We would like to thank Jacklyn Jansen, Amy Keating, Lother Reich, and Bruce Stillman for helpful discussions. We would also like to thank Dane Wittrup for sharing plasmids and yeast strains. \nRMA, TM and AMW were supported by European Research Council Starting Grant n. 306312.\nJBK was supported by the Simons Center for Quantitative Biology at Cold Spring Harbor Laboratory.\n\n\n\\bibliographystyle{pnas}\n\\begin{thebibliography}{10}\n\n\\bibitem{Chan2010}\nChan AC, Carter PJ\n\\newblock (2010) {Therapeutic antibodies for autoimmunity and inflammation}.\n\\newblock \\emph{Nat. Rev. Immunol.} 10:301--316.\n\n\\bibitem{Murphy:vw}\nMurphy KP, Travers P, Walport M\n\\newblock (2008) \\emph{{Janeway's Immunobiology}}\n\\newblock (Garland Science), 7 edition.\n\n\\bibitem{smith1985filamentous}\nSmith GP\n\\newblock (1985) Filamentous fusion phage: novel expression vectors that\n  display cloned antigens on the virion surface.\n\\newblock \\emph{Science} 228:1315--1317.\n\n\\bibitem{Vaughan1996}\nVaughan TJ, {et~al.}\n\\newblock (1996) Human antibodies with sub-nanomolar affinities isolated from a\n  large non-immunized phage display library.\n\\newblock \\emph{Nat Biotech} 14:309--314.\n\n\\bibitem{molecules16010412}\nSchirrmann T, Meyer T, Sch{\\\"u}tte M, Frenzel A, Hust M\n\\newblock (2011) Phage display for the generation of antibodies for proteome\n  research, diagnostics and therapy.\n\\newblock \\emph{Molecules} 16:412.\n\n\\bibitem{Boder:1997ii}\nBoder ET, Wittrup KD\n\\newblock (1997) {Yeast surface display for screening combinatorial polypeptide\n  libraries}.\n\\newblock \\emph{Nature Biotechnology} 15:553--557.\n\n\\bibitem{Gai:2007ks}\nGai SA, Wittrup KD\n\\newblock (2007) {Yeast surface display for protein engineering and\n  characterization.}\n\\newblock \\emph{Current Opinion in Structural Biology} 17:467--473.\n\n\\bibitem{Weinstein:2009he}\nWeinstein JA, Jiang N, White RA, Fisher DS, Quake SR\n\\newblock (2009) {High-throughput sequencing of the zebrafish antibody\n  repertoire.}\n\\newblock \\emph{Science (New York, NY)} 324:807--810.\n\n\\bibitem{Robins:2009da}\nRobins HS, {et~al.}\n\\newblock (2009) {Comprehensive assessment of T-cell receptor beta-chain\n  diversity in alphabeta T cells.}\n\\newblock \\emph{Blood} 114:4099--4107.\n\n\\bibitem{Robins:2010hd}\nRobins HS, {et~al.}\n\\newblock (2010) {Overlap and effective size of the human CD8+ T cell receptor\n  repertoire.}\n\\newblock \\emph{Science translational medicine} 2:47ra64--47ra64.\n\n\\bibitem{Mora:2010jx}\nMora T, Walczak AM, Bialek W, Callan CG\n\\newblock (2010) {Maximum entropy models for antibody diversity}.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 107:5405--5410.\n\n\\bibitem{Murugan:2012it}\nMurugan A, Mora T, Walczak AM, Callan CG\n\\newblock (2012) {Statistical inference of the generation probability of T-cell\n  receptors from sequence repertoires.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 109:16161--16166.\n\n\\bibitem{Zvyagin:2014kw}\nZvyagin IV, {et~al.}\n\\newblock (2014) {Distinctive properties of identical twins' TCR repertoires\n  revealed by high-throughput sequencing.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 111:5980--5985.\n\n\\bibitem{Elhanati:2014eu}\nElhanati Y, Murugan A, Callan CG, Mora T, Walczak AM\n\\newblock (2014) {Quantifying selection in immune receptor repertoires.}\n\\newblock \\emph{Proc Natl Acad Sci U S A} 111:9875--9880.\n\n\\bibitem{Elhanati:2015tz}\nElhanati Y, {et~al.}\n\\newblock (2015) {Inferring processes underlying B-cell repertoire diversity}.\n\\newblock \\emph{arXiv:1212.3647 [q-bio.QM]}.\n\n\\bibitem{Madi:2014js}\nMadi A, {et~al.}\n\\newblock (2014) {T-cell receptor repertoires share a restricted set of public\n  and abundant CDR3 sequences that are associated with self-related immunity.}\n\\newblock \\emph{Genome Res} 24:1603--1612.\n\n\\bibitem{parameswaran2013convergent}\nParameswaran P, {et~al.}\n\\newblock (2013) Convergent antibody signatures in human dengue.\n\\newblock \\emph{Cell host \\& microbe} 13:691--700.\n\n\\bibitem{Jiang2013}\nJiang N, {et~al.}\n\\newblock (2013) {Lineage Structure of the Human Antibody Repertoire in\n  Response to Influenza Vaccination}.\n\\newblock \\emph{Sci. Transl. Med.} 5:171ra19--171ra19.\n\n\\bibitem{Vollmers2013}\nVollmers C, Sit RV, Weinstein Ja, Dekker CL, Quake SR\n\\newblock (2013) {Genetic measurement of memory B-cell recall using antibody\n  repertoire sequencing.}\n\\newblock \\emph{Proc. Natl. Acad. Sci. U. S. A.} 110:13463--8.\n\n\\bibitem{Laserson2014}\nLaserson U, {et~al.}\n\\newblock (2014) {High-resolution antibody dynamics of vaccine-induced immune\n  responses}.\n\\newblock \\emph{Proc. Natl. Acad. Sci.} 111:4928--4933.\n\n\\bibitem{Galson2014}\nGalson JD, Pollard AJ, Tr\\\"{u}ck J, Kelly DF\n\\newblock (2014) {Studying the antibody repertoire after vaccination: Practical\n  applications}.\n\\newblock \\emph{Trends Immunol.} 35:319--331.\n\n\\bibitem{Wucherpfennig:2007jr}\nWucherpfennig KW, {et~al.}\n\\newblock (2007) {Polyspecificity of T cell and B cell receptor recognition.}\n\\newblock \\emph{Seminars in immunology} 19:216--224.\n\n\\bibitem{Fowler2014}\nFowler DM, Fields S\n\\newblock (2014) {Deep mutational scanning: a new style of protein science}.\n\\newblock \\emph{Nat. Methods} 11:801--807.\n\n\\bibitem{Kinney:2010tn}\nKinney JB, Murugan A, Callan CG, Cox EC\n\\newblock (2010) {Using deep sequencing to characterize the biophysical\n  mechanism of a transcriptional regulatory sequence}.\n\\newblock \\emph{Proc. Natl. Acad. Sci. USA} 107:9158--9163.\n\n\\bibitem{Shusta:1999ky}\nShusta EV, Kieke MC, Parke E, Kranz DM, Wittrup KD\n\\newblock (1999) {Yeast polypeptide fusion surface display levels predict\n  thermal stability and soluble secretion efficiency.}\n\\newblock \\emph{Journal of Molecular Biology} 292:949--956.\n\n\\bibitem{VanAntwerp:2000jf}\nVanAntwerp JJ, Wittrup KD\n\\newblock (2000) {Fine affinity discrimination by yeast surface display and\n  flow cytometry.}\n\\newblock \\emph{Biotechnology progress} 16:31--37.\n\n\\bibitem{Boder:2000ku}\nBoder ET, Midelfort KS, Wittrup KD\n\\newblock (2000) {Directed evolution of antibody fragments with monovalent\n  femtomolar antigen-binding affinity}.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 97:10701--10705.\n\n\\bibitem{Midelfort:2004iq}\nMidelfort KS, {et~al.}\n\\newblock (2004) {Substantial energetic improvement with minimal structural\n  perturbation in a high affinity mutant antibody}.\n\\newblock \\emph{Journal of Molecular Biology} 343:685--701.\n\n\\bibitem{Xu:2000vq}\nXu JL, Davis MM\n\\newblock (2000) {Diversity in the CDR3 region of V(H) is sufficient for most\n  antibody specificities.}\n\\newblock \\emph{Immunity} 13:37--45.\n\n\\bibitem{hoet2005}\nHoet RM, {et~al.}\n\\newblock (2005) Generation of high-affinity human antibodies by combining\n  donor-derived and synthetic complementarity-determining-region diversity.\n\\newblock \\emph{Nat Biotech} 23:344--348.\n\n\\bibitem{Whitlow:1995vw}\nWhitlow M, Howard AJ, Wood JF, Voss EW, Hardman KD\n\\newblock (1995) {1.85 A structure of anti-fluorescein 4-4-20 Fab.}\n\\newblock \\emph{Protein engineering} 8:749--761.\n\n\\bibitem{Reich:2015ep}\nReich LL, Dutta S, Keating AE\n\\newblock (2015) {SORTCERY-A High-Throughput Method to Affinity Rank Peptide\n  Ligands.}\n\\newblock \\emph{Journal of Molecular Biology} 427:2135--2150.\n\n\\bibitem{Liberman:2013hq}\nLiberman G, Benichou J, Tsaban L, Glanville J, Louzoun Y\n\\newblock (2013) {Multi Step Selection in Ig H Chains is Initially Focused on\n  CDR3 and Then on Other CDR Regions.}\n\\newblock \\emph{Frontiers in immunology} 4:274.\n\n\\bibitem{batista1998}\nBatista FD, Neuberger MS\n\\newblock (1998) Affinity dependence of the b cell response to antigen: A\n  threshold, a ceiling, and the importance of off-rate.\n\\newblock \\emph{Immunity} 8:751--759.\n\n\\bibitem{foote1995kinetic}\nFoote J, Eisen HN\n\\newblock (1995) Kinetic and affinity limits on antibodies produced during\n  immune responses.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 92:1254--1256.\n\n\\bibitem{roost1995early}\nRoost HP, {et~al.}\n\\newblock (1995) Early high-affinity neutralizing anti-viral igg responses\n  without further overall improvements of affinity.\n\\newblock \\emph{Proceedings of the National Academy of Sciences of the United\n  States of America} 92:1257--1261.\n\n\\end{thebibliography}\n\n\n\\appendix\n\n\\setcounter{figure}{0}\n\\makeatletter \n\\renewcommand{\\thefigure}{S\\@arabic\\c@figure}\n\\makeatother\n\n \n \n\\section{Tite-Seq simulations}\n\nFor Fig.\\ 1 in the main text, we simulated data at nine antigen concentrations ($C = 10^{-9}$ M, $10^{-8.5}$ M, \\ldots, $10^{-4}$ M) for two hypothetical scFvs: one with $K_D = 3\\times 10^{-7}$ M, $A = 300$, $B = 10$, and one with $K_D = 10^{-5}$ M, $A = 1000$, $B = 10$. For each clone and at each concentration, fluorescence signals were simulated for 1000 cells by multiplying the $y$ quantity in Eq.\\ \\ref{eq:y_of_A} by a factor of $\\exp(\\eta)$ where $\\eta$ is a normally distributed random number. Fig.\\ 1D shows the resulting flow cytometry measurements, computed by taking the median of these simulated fluorescence signals.  Curves of the form Eq.\\ \\ref{eq:y_of_A} were fit to these data by minimizing the square deviation between predicted $\\log_{10} y$ values and $\\log_{10}$ flow cytometry measurements. Fig.\\ 1E shows Tite-Seq measurements simulated by sorting these 1000 cells into three bins defined by the following fluorescence boundaries: $(0,30)$ for bin 0, $(30,300)$ for bin 1, and $(300, \\infty)$ for bin 2.  The mean bin number was then computed for each clone at each concentration, and curves of the form $\\log_{10} y$ were fit to mean bin values using least squares optimization. \n\n\n\\section{Yeast display}\n\\subsection{Innoculation aliquots for yeast display \\label{method:pre_measure}}\nTo ensure consistency in yeast display population sizes, we pre-aliquoted yeast cells with consistent densities. For clones, we picked colonies and grew them in sc -trp 2\\% glucose liquid media. For libraries, we resuspended 1 ml$\\cdot$OD from our $-80^{\\circ}$ C library stocks into sc -trp 2\\% glucose liquid media to ensure library diversity. We grew liquid cultures until their OD600 absorption measured between 0.9 and 1.1. We then stored yeast aliquots with 10\\% glycerol at $-80^{\\circ}$ C. For clones, aliquots were meted out in 0.2 ml$\\cdot$OD aliquots. For libraries, aliquots were meted out in 1.5 ml$\\cdot$ OD aliquots. \n\n\\subsection{Yeast display induction and labeling \\label{method:labeling}}\nWe added cell aliquots stored at $-80^{\\circ}$ C to SC -trp + 2\\% glucose media until the OD600 equaled 0.05.  We kept clonal populations above 0.2 ml$\\cdot$OD, and library populations above 3 ml$\\cdot$OD. After 8 hours, we added 25\\% volume of YPD, centrifuged the cells at 3000 rpm for 8 minutes, aspirated the media, and resuspended cells at 0.05 OD600 SC -trp +2\\% galctose media. scFv production was induced in galactose for approximately 16 hours at $22^{\\circ}$ C. We then added 25\\% volume YPD, and spun down the cells at 3000 rpm for 8.  Cells were washed with 100 $\\mu$l of ice cold TBS-BSA. TBS-BSA is made from 1 ml 100 mg/ml BSA added to 9 ml TBS (473 ml of water, 25 ml of 1 M Tris, 2.92 g of NaCl adjusted to pH 8 with NaOH). Cells were then centrifuged, and resuspended in labeling solution containing 0 M or $10^{-8.5}-10^{-4}$ M biotinylated fluorescein, or 1.4 $\\mu$g/ml c-Myc rabbit antibody, per 0.2 ml$\\cdot$OD of cells. Fluorescein volumes were kept at high enough levels to ensure ten times as many fluorescein molecules as scFv molecules, assuming 100,000 scFv per cell. Cells were shaken at 700 rpm for 1 hour at room temperature during labeling. Cells were then centrifuged, and the supernatant was drained. Cells were then twice washed with 1.5 ml ice cold TBS-BSA. Cells were centrifuged at 3,000 rpm for 8 minutes and the supernatant was aspirated. The cells were then suspended in 112.5 $\\mu$l/(ml$\\cdot$OD cells) of a secondary labeling solution having 4 $\\mu$g/ml streptavidin R-PE or 0.8  $\\mu$g/ml BV421 anti-rabbit donkey antibody. Secondary labeling occurred for 30 minutes at 4C at 300 rpm. Cells were then centrifuged at 3,000 rpm for 8 minutes, resuspended in ice cold TBS, and prepared for FACS or flow cytometry analysis. \n\n\\subsection{Flow cytometry and FACS gating strategies}\n\\label{fc_measurements}\nWe measured titration curves by either flow cytometry or FACS sorting for Tite-Seq using similar gating strategies. For flow cytometry, cells were first filtered by their forward scatter channels (fsc) and side scatter channels (ssc). scFv expression was then measured by average BV421 channel values corresponding to c-Myc epitopes on cell surfaces, excluding extreme values. For $K_D$ measurements, we further gated cells by their fluorescein and PE signals. We removed cells with high fluorescein fluorescence, since fluorescein's fluorescence signal is quenched by antibody binding, meaning that non-quenched signal indicates non-specific fluorescein binding. Concurrently, we also removed extreme PE values. We then measured titration curves from average PE channel values, corresponding to fluorescein bound to scFv antibodies. For Tite-Seq, we first filtered cells by fsc and ssc channels. For expression measurements, we sorted cells into one of four gates along the BV421 channel. For Tite-Seq titration curves, we furthered filtered cells by their fluorescein and PE signals. Cells were then sorted into one of four gates by their PE signal values.\n\n\\section{Generation of scFv libraries}\n\nWe obtained custom microarray oligonucleotides from LC Sciences to generate a library of mutant CDR1H ($\\mu$1H) and CDR3H ($\\mu$3H) domains. We created separate libraries for the CDR 1H and 3H regions by performing PCR on these oligonucleotide libraries. CDR3H mutants in the LC sciences microarray library were amplified by PCR using oRAL10 and oRAR10 primers to create $\\mu$3H sequences. CDR1 library sequences ($\\mu$1H) were created by amplifying the LC Sciences microarray library by PCR using oRAL11 and oRAR11 primers. \n\nNon-mutated single CDR regions were created by performing PCR on the pJK36 plasmid  (Fig.~\\ref{fig:start_plasmids}A) with 1H\\_2F and 1H\\_1R primers to create the 1H primer, and 3H\\_2R and 3H\\_1F primers to create the 3H primer. \nBy mixing non-mutated (1H or 3H) primers with library primers ($\\mu$1H or $\\mu$3H) and performing PCR on the pJK36 plasmid we created ~360 bp long mutagenized scFv insertion sequences, iRA10,  with one or both CDR regions mutated. The iRA10 sequence with added Bsal cut sites were made into iRA11 sequences libraries by performing PCR with oRA10 and oRA11 primers. The iRA11 sequences have complementary sticky DNA to the plasmid backbone pRA10 (Fig.~\\ref{fig:pRA_plasmids}A) easing the integration of the sequence into the plasmid.\n\nHaving created library sequences, iRA11, that have sticky single stranded DNA at their ends after BsaI digest, we created a target plasmid for the iRA11 library sequences. The target plasmid pRA10 (Fig.~\\ref{fig:pRA_plasmids}A) was designed to have the same features as the pJK36 plasmid, where the CDR1H and 3H scFv domains were replaced with a cassette containing the toxic ccdB gene  the chloramphenicol marker, and surrounded by BsmBI digest sites. pRA10, was created from Gibson cloning iRA12, iRA13, and iRA14 sequences together. iRA12 contained the BsmBI digest sites, ccdB toxic gene, and chloramphinicol drug resistance markers. iRA12 was created by PCR from pJK14 (Fig.~\\ref{fig:start_plasmids}B) from \\cite{Kinney:2010tn}, which contains the ccdB cassette, with oRA12 and oRA13. iRA13 was created by performing PCR on pJK36 with oRA15 and oRA16 (Fig.~\\ref{fig:start_plasmids}A). iRA14 was created by performing PCR on pJK36 with oRA14 with oRA17 (Fig.~\\ref{fig:start_plasmids}A).  We transformed DB3.1 E.\\ coli, which are ccdB resistant, with the assembled pRA10 plasmid (Fig.~\\ref{fig:pRA_plasmids}A), grew them in ampicillin and chloramphinicol, and then extracted the pRA10 plasmids from {\\em E. coli} using the Qiagen plasmid mini-prep kit.\n\nTo introduce our mutagenized CDR1H and/or CDR3H sequences back into an scFv expressing plasmid, we replaced the ccdB gene in pRA10 with the iRA11 insertions containing our library mutations. To do this we digested both the iRA11 library sequences and the pRA10 plasmid to create sticky DNA sequences that could be easily ligated together (Fig.~\\ref{fig:pRA_plasmids} B).\nWe digested the pRA10 backbone with BsmBI and iRA11 with BsaI. Digesting pRA10 with BsmBI had the additional effect of excising the ccdB and chloramphenicol resistance genes from the plasmid. The BsmBI and BsaI digests were purified using Qiagen's QIAquick PCR purification kit and mixed together at molar ratios of 1:2.5, respectively. The BsmBI and BsaI digest mixtures were ligated with T4 DNA ligase and then dialyzed to remove salts. Electrocompetant DH10B {\\em E. coli} were electroporated with 50 $\\mu$l of ligated DNA. {\\em E. coli} were grown for 1 hour in SOB media, then ampicillin was added and {\\em E. coli} were grown overnight.  Because ccdB is toxic to DH10B cells, only plasmids that were successfully cut and reliagated were able to grow. We used Qiagen's plasmid mini-prep kit to extract amplified pRA11 libraries.  We then chemically transformed EBY100 \\textit{S. cerevisiae} cells for each of the pRA11 libraries (Fig.~\\ref{fig:pRA_plasmids}B). Finally, we induced scFv expression in the transformed \\textit{S. cerevisiae} libraries. We FACS filtered cells which displayed both HA and c-Myc domains in roughly equal amounts to eliminate \\textit{S. cerevisiae} with indels in the scFv domain of their plasmids. From this filtered library we isolated and sequenced 144 clones. We then chose 6 clones to confirm Tite-Seq measurements.\n\n\\section{Tite-Seq implementation}\nEach library was spiked with 0.625\\% pJK37 and $\\Delta$ controls and then subjected to 12 FACS rounds. The first FACS separated cells based on receptor expression approximately evenly into different bins based on average c-Myc labeling. The other 11 FACS separated cells were grown in different fluorescein concentrations approximately evenly based on the amount of bound fluorescein. The affinity FACS gates were drawn to have roughly log-linear mean values. Cells were sorted into 1 ml 2X YPAD media contained in a rounded 5 ml polypropylene tube. Cells were regrown overnight in sc -trp 2\\% glucose. 25 ml$\\cdot$OD of cell populations were spun down and resuspended in 200 $\\mu$l 0.5 mm glass beads, 200 $\\mu$l of Phenol/chloroform/isoamyl alcohol and 200 $\\mu$l of yeast lysis buffer (982 ml water, 10 ml  1 M NaCl, 2 ml Triton X-100, 1 ml 1 M Tris pH 8.0, 0.1 ml 1 M EDTA, 5 ml 20\\%SDS). The cell/phenol/glass bead/yeast lysis mixture was vortexed for 30 minutes. 200 $\\mu$l water was added. We then spun the tubes down five times, removing the aqueous layer and adding different media between each centrifugation of cells in the following order: 2  x 200 $\\mu$l of Phenol/chloroform/isoamyl alcohol, 2 x 200 $\\mu$l of chloroform/isoamyl alcohol, 1 ml ice cold 100\\% EtOH. We then spun the tubes down, aspirated the EtOH, and added 250 $\\mu$l  70\\% ice cold EtOH. We again spun the tubes down, aspirated the EtOH, and resuspended purified DNA in 100 $\\mu$l of IDTE.\n\nWe then performed PCR on our phenol purified DNA with bar coded primers L2AF\\_XX and L2AF\\_XX (Fig.~\\ref{fig:pRA_plasmids}B). Here the XX refers to 1 of 48 possible bar-code combinations (see section 4 of Appendix G). We used variable length, 7-10 bp, bar-codes to increase sequence variability during DNA sequencing.  We then pooled these sequences and performed a second round of PCR with Illumina adapter primers PE1v3ext and PE2v3. PCR products from the single library CDR1H and CDR3H FACS + 2.5\\% molarity random PhiX DNA submitted separately for Illumina Hi-Seq analysis. \n\nWe assigned sequence origins according to the 7-10 bp barcodes. Correspondingly to the barcode length we used the 8-11th to 14th bp to confirm the orientation of the sequence (i.e. containing CDR1H or CDR3H region). We categorized each read solely as a function of its CDR1H and CDR3H region. We excluded sequences that we did not design, and those with mismatching bar-codes.\n\n\\section{Signal reconstruction from sequence data}\nHere we describe how to reconstruct the fluorescence signal of a large number of variants from sequence data following FACS sorting.\n\nAfter processing, the data can be summarized by the number of times a given scFv variant $s_i$ was matched to a sequence read in a given FACS bin $j=0,\\ldots,3$. We call this number $M_{j}(s_i)$.\nEach sequence $s_i$ was assigned a probability distribution $p_{j}(s_i)$ over bin index $j$, represented by histograms in Fig.~1D, and defined as\n\n", "index": 3, "text": "\\begin{align}\np_{j}(s_i)=\\frac{k_{j} M_{j}(s_i)}{\\sum_{j'} k_{j'} M_{j'}(s_i)}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle p_{j}(s_{i})=\\frac{k_{j}M_{j}(s_{i})}{\\sum_{j^{\\prime}}k_{j^{%&#10;\\prime}}M_{j^{\\prime}}(s_{i})}.\" display=\"inline\"><mrow><mrow><mrow><msub><mi>p</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>k</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>M</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><msup><mi>j</mi><mo>′</mo></msup></msub><mrow><msub><mi>k</mi><msup><mi>j</mi><mo>′</mo></msup></msub><mo>⁢</mo><msub><mi>M</mi><msup><mi>j</mi><mo>′</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mstyle></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\n\nThe fluorescence of each sequence (represented by circles in Fig.~1C) was then estimated as\n\n", "itemtype": "equation", "pos": 56444, "prevtext": "\nDuring PCR, sequence counts differed from the number of cells sorted. To correct for this we scaled the number of sequences by $k_{j}$ to match the number of sorted cells. The $k_{j}$ scaling factor is the ratio of the number of cells sorted into a bin, $N_{j}$, to the total number of reads from that bin,\n\n", "index": 5, "text": "\\begin{align}\nk_{j} = \\frac{N_{j}}{\\sum_i M_{j}(s_i)}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle k_{j}=\\frac{N_{j}}{\\sum_{i}M_{j}(s_{i})}.\" display=\"inline\"><mrow><mrow><msub><mi>k</mi><mi>j</mi></msub><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>N</mi><mi>j</mi></msub><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><msub><mi>M</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mstyle></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\nwhere $w_j$ is the estimated mean fluorescence in bin $j$, taken to be $\\propto V^j$, where $V$ is the fold difference between the upper and lower fluorescence bounds deliminting each bin. This method of averaging was used instead of the median or the geometric mean, because the fluorescence was typically bimodal and these alternatives would have given too much weight to the lowest peak of nonfluorescent cells.\n\nThis procedure was applied to the FACS-sorted sequence data sorted using antigen labeling, for each concentration $C=0$ M, $10^{-8.5}$ M, $10^{-8}$ M, $\\ldots$, $10^{-4}$ M of the antigen. The reconstructed Tite-Seq signal, calculated using Eq.~\\ref{eqn:m} for each $C$, is denoted by $y_{\\textrm{Tite-Seq}}(s_i,C)$. We applied the same procedure to the data sorted using scFv labeling, yielding the expression signal $E_{\\textrm{Tite-Seq}}(s_i)$.\n\nTo estimate the error made on the Tite-Seq measurement $F(s_i)$, we used variations across synonymous mutants. We grouped the sequences $s_i$ into groups of equal size, ranked according to their read count, $M(s_i)=\\sum_j M_{j}(s_i)$, and indexed each group by the their mean read count $M$. In each group, we calculated the mean square difference $\\sigma_{\\rm emp}^2(M)=\\langle (F(s_i)-\\bar F(a_i))^2\\rangle_M$, where the average $\\langle\\cdot\\rangle_M$ was taken over all sequences in the group indexed by $M$, and $\\bar F(a_i)$ is the average signal over synonymous mutants with the same amino-acid sequence $a_i$. Because $\\sigma_{\\rm emp}(M)$ was still a noisy function of $M$, we approximated it by a power law, \n\n", "itemtype": "equation", "pos": 56604, "prevtext": "\n\nThe fluorescence of each sequence (represented by circles in Fig.~1C) was then estimated as\n\n", "index": 7, "text": "\\begin{align}\nF(s_i) = \\sum_{j=1}^4  w_j p_{j}(s_i),\n\\label{eqn:m}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle F(s_{i})=\\sum_{j=1}^{4}w_{j}p_{j}(s_{i}),\" display=\"inline\"><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mn>4</mn></munderover></mstyle><mrow><msub><mi>w</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>p</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\n where $\\alpha$ and $\\beta$ were fitted using mean square error minimization in logarithmic space. In the case of antigen-labeled data, we pulled data from all antigen concentration $C$ together to obtain the empirical error $\\sigma_{\\rm emp}(M)$.\n\n\\section{Inferring $K_D$ from titration curves}\nThe antigen fluorescence was assumed to follow a non-cooperative Hill function:\n\n", "itemtype": "equation", "pos": 58267, "prevtext": "\nwhere $w_j$ is the estimated mean fluorescence in bin $j$, taken to be $\\propto V^j$, where $V$ is the fold difference between the upper and lower fluorescence bounds deliminting each bin. This method of averaging was used instead of the median or the geometric mean, because the fluorescence was typically bimodal and these alternatives would have given too much weight to the lowest peak of nonfluorescent cells.\n\nThis procedure was applied to the FACS-sorted sequence data sorted using antigen labeling, for each concentration $C=0$ M, $10^{-8.5}$ M, $10^{-8}$ M, $\\ldots$, $10^{-4}$ M of the antigen. The reconstructed Tite-Seq signal, calculated using Eq.~\\ref{eqn:m} for each $C$, is denoted by $y_{\\textrm{Tite-Seq}}(s_i,C)$. We applied the same procedure to the data sorted using scFv labeling, yielding the expression signal $E_{\\textrm{Tite-Seq}}(s_i)$.\n\nTo estimate the error made on the Tite-Seq measurement $F(s_i)$, we used variations across synonymous mutants. We grouped the sequences $s_i$ into groups of equal size, ranked according to their read count, $M(s_i)=\\sum_j M_{j}(s_i)$, and indexed each group by the their mean read count $M$. In each group, we calculated the mean square difference $\\sigma_{\\rm emp}^2(M)=\\langle (F(s_i)-\\bar F(a_i))^2\\rangle_M$, where the average $\\langle\\cdot\\rangle_M$ was taken over all sequences in the group indexed by $M$, and $\\bar F(a_i)$ is the average signal over synonymous mutants with the same amino-acid sequence $a_i$. Because $\\sigma_{\\rm emp}(M)$ was still a noisy function of $M$, we approximated it by a power law, \n\n", "index": 9, "text": "\\begin{equation}\\label{sigma}\n\\sigma_{\\rm emp}(M)\\approx \\sigma_{\\rm model}(M)= \\alpha M^\\beta,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm emp}(M)\\approx\\sigma_{\\rm model}(M)=\\alpha M^{\\beta},\" display=\"block\"><mrow><mrow><mrow><msub><mi>σ</mi><mi>emp</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><msub><mi>σ</mi><mi>model</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><msup><mi>M</mi><mi>β</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\nwhere $y(s_i,C)$ is the antigen fluorescence, $C$ is the antigen concentration, $B(C)$ is the background autofluorescence, $A$ a scaling factor, and $K_D(s_i)$ the dissociation constant of scFv $s_i$. The fluorescence $y(s_i,C)$ can be estimated directly from the mean of flow cytometry fluorescence data in a single clone, or using $y_{\\textrm{Tite-Seq}}(s_i,C)$ in the Tite-Seq experiment as explained above.\n\nThe autofluorescence was estimated as $B(C)=y_0(C)-y_0(0)+y(s_i,0)$, where $y_0(C)$ is the fluorescence of clones with no affinity for the antigen, at concentration $C$. Note it may depend on $C$ because of non-specific binding. \nFor flow-cytometry measurements, we measured $y_0$ directly as the mean fluorescence of a strain expressing a non-productive antibody. For Tite-Seq measurements, we\n estimated it as the average of the lowest 10\\% of $y_{\\textrm{Tite-Seq}}(s_i,C)$ of all sequences in the library, reasoning that these 10\\% are nonfunctional variants.\nThe sequence-dependent offset $y(s_i,0) -y_0(0)$ was added to enforce $y(s_i,0)=B(0)$.\n\nThe dissociation constant was inferred by minimizing the following objective function with respect to $K_D$ and $C$ for each sequence $s_i$:\n\n", "itemtype": "equation", "pos": 58755, "prevtext": "\n where $\\alpha$ and $\\beta$ were fitted using mean square error minimization in logarithmic space. In the case of antigen-labeled data, we pulled data from all antigen concentration $C$ together to obtain the empirical error $\\sigma_{\\rm emp}(M)$.\n\n\\section{Inferring $K_D$ from titration curves}\nThe antigen fluorescence was assumed to follow a non-cooperative Hill function:\n\n", "index": 11, "text": "\\begin{equation}\ny(s_i,C)=B(C)+A(s_i)\\frac{C}{C+K_D(s_i)},\n\\label{KD_objective}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"y(s_{i},C)=B(C)+A(s_{i})\\frac{C}{C+K_{D}(s_{i})},\" display=\"block\"><mrow><mrow><mrow><mi>y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo>,</mo><mi>C</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>C</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mi>C</mi><mrow><mi>C</mi><mo>+</mo><mrow><msub><mi>K</mi><mi>D</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02160.tex", "nexttext": "\nwhere the sum on $C$ runs over values of the fluorescein concentrations used in the experiments. We set $\\sigma(s_i,C)=1$ in the case of flow cytometry measurements, and to $\\sigma(s_i,C)=\\sigma_{\\rm model}(M(s_i,C))$  in the case of Tite-Seq measurements, where $\\sigma_{\\rm model}(M)$ is given by Eq.~\\ref{sigma}, and \n$M(s_i,C)$ is the read count of sequence $s_i$ at antigen concentration $C$.\n\nThe parameters were found by scanning combinations of $K_D \\in [10^{-10} M,10^{-3} M]$, and $A\\in[A_0, 10 A_0]$ for Tite-Seq or $A\\in[A_0, 100 A_0]$, where $A_0$ was set to enforce positive values of $A$. Tite-Seq fits generally had lower ranges of fluorescence than flow cytometry measurements due to the binning process, justifying the different ranges of Tite-Seq fits.\nSome antigen concentrations were not used in the fit because of abnormal fluorescence distributions. These were $C=10^{-8.5}$\\,M and $C=10^{-4}$\\,M for Tite-Seq, and $C=10^{-8.5}$\\,M, $C=10^{-4.5}$\\,M and $C=10^{-4}$\\,M for flow-cytometry measurements.\n\nTo estimate the error on $K_D$, we used a similar procedure to the one explained in the previous section for $F$. We grouped sequences into bins according to their total read counts over all fluorescein concentrations and FACS bins, $M_T(s_i)=\\sum_C \\sum_j M_j(s_i, C)$, and calculated the error as\n$\\sigma^2_{K_D}(M_T)=\\langle (K_D(s_i)-\\bar K_D(a_i))^2\\rangle_{M_T}$,\nwhere $\\bar K_D(a_i)$ is the average $K_D$ over synonymous mutants with amino-acid sequence $a_i$. Since this function was noisy, we fitted it to a power-law analogously to Eq.~\\ref{sigma}. The signal-to-noise ratio was then calculated as $\\mathrm{Var}(K_D(s_i))/\\sigma^2_{K_D}(M_T)$, where the variance was taken over all variants in the library.\n\n\\begin{widetext}\n\n\\section{Oligos used}\n\n\\subsection{library oligos}\n\n\\textbf{oRAL10}:\tTTCTGAGGAGACGGTGACTGAGGTTCCTTG\n\n\\textbf{oRAR10}:\tTGAAGACATGGGTATCTATTACTGTACG\n\n\\textbf{oRAL11}:\tCAGTCCTTTCTCTGGAGACTGGCG\n\n\\textbf{oRAR11}:\tATGAAACTCTCCTGTGTTGCCTCTGGATTC\n\n\\textcolor{blue}{\\textbf{Oligo 1H}}:  GTGTTGCCTCTGGATTC  \\textcolor{blue}{ACTTTTAGTGACTACTGGATGAACTGGGTC} CGCCAGTCTCCAGA AGGAGAGTTTCAT\n\n\\textcolor{red}{\\textbf{Oligo 3H}}:  GTGACTGAGGTTCCTTG  \\textcolor{red}{ACCCCAGTAGTCCATACCATAGTAAGAACC}  CGTACAGTAATAGATACCCAT \n\nBlue denotes CDR1 mutations, red denotes CDR3 mutations.\n\n\\subsection{Non-mutated library oligos}\n\n\\textbf{3H1F}: TTCTGAGGAGACGGTGACT\n\n\\textbf{3H2R}: TGAAGACATGGGTATCTATTACTGTAC\n\n\\textbf{1H2F}: CAGTCCTTTCTCTGGAGACTG\n\n\\textbf{1H1R}: ATGAAACTCTCCTGTGTTGCCT\n\n\\subsection{Plasmid oligos}\n\n\\textbf{oRA10}:GCATATCTAAGGTCTCGTTCTGAGGAGACGGTGAC\n\n\\textbf{oRA11}:GCCGATTGTTGGTCTCCATGAAACTCTCCTGTGTTGC\n\n\\textbf{oRA12}:GAAATAAGCTTTTGTTCTGGAGACGGCAATTGCTAG\n\n\\textbf{oRA13}:AACCTGGGAGGCCCATGAAGAGACGTTCCACGC\n\n\\textbf{oRA14}:AGACAAGCTGTGACCCGAAAGGGCCTCGTGATA\n\n\\textbf{oRA15}:CACGAGGCCCTTTCGGGTCACAGCTTGTCTGTA\n\n\\textbf{oRA16}:CTAGCAATTGCCGTCTCCAGAACAAAAGCTTATTTCTGAA\n\n\\textbf{oRA17}:CTAGCGTGGAACGTCTCTTCATGGGCCTCCCAGG\n\n\\subsection{Hi-throughput sequencing oligos}\\label{NGS_oligos}\n\n\\textbf{Illumina PE1v3ext}: AATGATACGGCGACCACCGAGATCT ACACTCTTTCCCTACACGACG\n\n\\textbf{Illumina PE2v3}: AAGCAGAAGACGGCATACGAGATCGGT CTCGGCATTCCTGCT\n\n\\textbf{L1AF}:ACACTCTTTCCCTACACGACGCTCTTCCGATCTNNNNAGTCTTCTTCAGAAATAAGC\n\n\\textbf{L1AR}:CTCGGCATTCCTGCTGAACCGCTCTTCCGATCTNNNNGCTTGGTGCAACCTG\n\nNNNN denotes a variable length nucleotide barcode. Forward barcodes were paired identically to reverse barcodes. The barcodes are: `TAAGTGGCGC', `CCATGCCAC', `AAGCATCA', `TCTGAGC', `AACTAAGCCT', `CGGATTCAG', `CCAGCGCT', `GACGTCA', `ATACAACAGC', `CGACTAGGT', `TACGATCG', `CCTAATG', `ACATATCGAC', `GTCGATGTG', `TGACGGTC', `ATGGTAC', `GTACATCCTT', `ACTTGGTTG', `ATTGCAGG', `CGCCATC', `AGACGTATCC', `GAAGGTCCG', `TCATGTGA', `CAATTGG', `TTGGCGGCAT', `TCCATCCTG', `TGGCGCAT', `ACCTTCG', `TATTGCAATC', `CACCACGAT', `TTGTAGGC', `AACTGAC', `CGTCGCTACC', `GAGTCTTGG', `GATGCCTC', `TGAACCT', `AAGGTCTCGT', `GGTAGTTCC', `CGATAATC', `CTCATGT', `CTCTTCCAAG', `TGTGAATAC', `TCTCGCCA', `CCTCGGA', `ACGCCTGCTC', `GCTCTGGAC', `TAACTTGC', `GCTTGAT', `ACTGTATGTC', `GCGACAGAT', `ACGGAGTG', `ACGTATA', `CCAGACGCGT', `CTTGACAGA', `GAACAGGT', `CGCTGCA', `GGCTTGGAGT', `AGTTCTACA', `CATGCGAG', `TGTCCAA', `GCGAAGACCT', `GGCGCTTAA', `GCAGTTAG', and `TCAGTAT'\n\n\\end{widetext}\n\n\\graphicspath{{\"./SI_figures/\"}}\n\n \n\\begin{figure}\n\\centering\n\\includegraphics{figure_S1_gates.pdf}\n    \\caption{\n    {\\bf FACS gates used for Tite-Seq.} (A,B) Fluorescence gates used to sort (A) CDR1H and (B) CDR3H libraries based on the PE fluorescence readout of bound antigen. Colors indicate the fluorescences gates used for bins 0, 1, 2, and 3 (arrayed from left to right). Each sample was sorted for $\\sim$ 20 min; the number of cells sorted into each bin is shown in Fig.\\ S2A.  An ``X'' in the background indicates that Tite-Seq data at that fluorescein concentration was ignored during the inference of titration curves. These data were ignored due to irregularities in the florescence distributions of one or both of the scFv libraries. Such irregularities were likely caused by variation in the labeling procedure. (C,D) Fluorescence gates used to sort (C) CDR1H and (D) CDR3H libraries based on the BV fluorescence readout of expression. \n    }\n\\label{fig:si_gates}\n\\end{figure}\n\n\n \n\\begin{figure}\n\\centering\n\\includegraphics{figure_S2_counts.pdf}\n        \\caption{\n        {\\bf FACS counts and read counts.} (A) The number of PE-labeled cells sorted into each bin at each fluorescein concentration during Tite-Seq measurements, together with the number of BV-labeled cells sorted into each bin during Sort-Seq expression measurements. (B) The number of filtered Illumina sequence reads obtained for each bin of sorted cells shown in panel A.}\n\\label{fig:si_counts}\n\\end{figure}\n\n\n \n\\begin{figure}\n\\includegraphics{figure_S3_sensitivity.pdf}\n\\caption{\n\t{\\bf Enrichment correlates poorly with $K_D$.} To assess how well simple enrichment calculations might reproduce the $K_D$ values measured by Tite-Seq, we did the following calculation. For each of the two libraries (CDR1H and CDR3H), we partitioned scFvs into seven groups based on their measured $K_D$s (columns). For each group at each antigen concentration (rows), we then computed the enrichment of each scFv in the high PE bins (bins 2,3) relative to the low PE bins (bins 0,1). In these enrichment calculations, the number of counts in each bin was re-weighted to accurately reflect the fraction of library cells falling within the fluorescence range of that bin. This figure shows the resulting Spearman rank correlation $(\\rho)$ between enrichment and log $K_D$ values computed for each scFv group at each antigen concentration. In both libraries, we see that correlation values above background (which can be assessed from the values in the 0 M fluorescein row) only occur close to the diagonal, i.e., when $K_D$ is close to the fluorescein concentration used. Even then, the maximum correlation value $(\\rho_\\mathrm{max})$ observed for each library remains below 0.5, indicating the general inability to determine $K_D$ from enrichment statistics.}\\label{fig:titeseq_v_enrichment}\n\\end{figure}\n\n\n \n\\begin{figure}\n\\includegraphics{figure_S4_facs.pdf}\n\\caption{\n\t{\\bf Different fractions of displayed OPT and WT scFvs are functional.} 2D flow cytometry histograms showing both OPT- and WT-expressing cells labeled with PE and BV after incubation at 2 $\\mu$M fluorescein. At this fluorescein concentration, nearly all functional WT and OPT scFvs are bound. Regression lines (fixed to have slope 1) were fit to data points with BV signal between $10^{4.5}$ and $10^5$. The vertical shift of the OPT data relative to the WT data indicates a factor of $2.03 \\pm 0.07$ difference (computed from four replicate experiments) in the amount labeled antigen. This difference is not due to a difference in the number of surface-displayed scFvs, as this would cause the OPT and WT clouds to lie along the same diagonal. Rather, this difference between WT and OPT is due to variation in the fraction of surface-displayed scFvs that are functional.}\\label{fig:pJK36_v_pJK37}\n\\end{figure}\n\n\n \n\\begin{figure}\n\\includegraphics{figure_S5_structure.pdf}\n\\caption{\n{\\bf The effect of amino acid variation on expression does not have a clear structural basis.} For each amino acid position in the CDR1H and CDR3H variable regions, $S_E$ is plotted against either (A) the number of contacts or (B) the distance to the fluorescein molecule. Points are colored as in Fig.\\ \\ref{figure6}. No significant correlation is observed in either plot. \n}\\label{fig:antigen_correlation}\n\\end{figure}\n\n\n \n\\begin{figure*}\n\\centering\n\\includegraphics[height=6in]{figure_S6_pJK.pdf}\n        \\caption{\\title{pJK14, pJK36, and pJK37 plasmids} (A) We performed PCR on pJK36 using a microarray library of oligonucleotides to generate iRA10 libraries of CDR1, 3H variants. We performed PCR on pJK36 to generate the iRA13 and iRA14 sequences. (B) We performed PCR on pJK14 to generate the iRA12 insertion sequence. Cloning fragments excluding extension sequences are shown in orange, primer binding sites in purple, genes in green, non-coding elements in red, and scFv domains in blue. Plasmid pJK36 is identical to plasmid pCT302 from, and plasmid pJK37 is identical to plasmid pCT-4M5.3; both of these were reported in \\cite{Boder:2000ku} and were kindly provided by Dane Wittrup. The pJK14 plasmid was reported in \\cite{Kinney:2010tn}.}\n        \\label{fig:start_plasmids}\n\\end{figure*}\n\n\n \n\\begin{figure*}\n\\centering\n\\includegraphics[height=6in]{figure_S7_pRA.pdf}\n        \\caption{\\title{pRA10 and pRA11 plasmids} (A) We digested the pRA10 backbone with BsmBI and then ligated the fragment with BsaI digested iRA11 fragments to create (B) pRA11 plasmid libraries with mutated CDR1H or 3H domains. Cloning fragments excluding extension sequences are shown in orange, primer binding sites in purple, genes in green, non-coding elements in red, plasmid digest in brown, and scFv domains in blue.}\\label{fig:pRA_plasmids}\n\\end{figure*}\n\n\n\n\n", "itemtype": "equation", "pos": 60055, "prevtext": "\nwhere $y(s_i,C)$ is the antigen fluorescence, $C$ is the antigen concentration, $B(C)$ is the background autofluorescence, $A$ a scaling factor, and $K_D(s_i)$ the dissociation constant of scFv $s_i$. The fluorescence $y(s_i,C)$ can be estimated directly from the mean of flow cytometry fluorescence data in a single clone, or using $y_{\\textrm{Tite-Seq}}(s_i,C)$ in the Tite-Seq experiment as explained above.\n\nThe autofluorescence was estimated as $B(C)=y_0(C)-y_0(0)+y(s_i,0)$, where $y_0(C)$ is the fluorescence of clones with no affinity for the antigen, at concentration $C$. Note it may depend on $C$ because of non-specific binding. \nFor flow-cytometry measurements, we measured $y_0$ directly as the mean fluorescence of a strain expressing a non-productive antibody. For Tite-Seq measurements, we\n estimated it as the average of the lowest 10\\% of $y_{\\textrm{Tite-Seq}}(s_i,C)$ of all sequences in the library, reasoning that these 10\\% are nonfunctional variants.\nThe sequence-dependent offset $y(s_i,0) -y_0(0)$ was added to enforce $y(s_i,0)=B(0)$.\n\nThe dissociation constant was inferred by minimizing the following objective function with respect to $K_D$ and $C$ for each sequence $s_i$:\n\n", "index": 13, "text": "\\begin{equation}\nO(K_D,A;s_i)= \\sum_C \\frac{\\left [\\ln y(s_i,C) - \\ln \\left( B(C) + A \\frac{C}{C+K_D} \\right )  \\right ]^2}{\\sigma(s_i,C)^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"O(K_{D},A;s_{i})=\\sum_{C}\\frac{\\left[\\ln y(s_{i},C)-\\ln\\left(B(C)+A\\frac{C}{C+%&#10;K_{D}}\\right)\\right]^{2}}{\\sigma(s_{i},C)^{2}}\" display=\"block\"><mrow><mrow><mi>O</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>K</mi><mi>D</mi></msub><mo>,</mo><mi>A</mi><mo>;</mo><msub><mi>s</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>C</mi></munder><mfrac><msup><mrow><mo>[</mo><mrow><mrow><mrow><mi>ln</mi><mo>⁡</mo><mi>y</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo>,</mo><mi>C</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mrow><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>C</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>A</mi><mo>⁢</mo><mfrac><mi>C</mi><mrow><mi>C</mi><mo>+</mo><msub><mi>K</mi><mi>D</mi></msub></mrow></mfrac></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup><mrow><mi>σ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi>i</mi></msub><mo>,</mo><mi>C</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow></mrow></math>", "type": "latex"}]