[{"file": "1601.08138.tex", "nexttext": "\n\nIf the cyclotron absorption takes place near the poles of the neutron star\nthe observed resonance energy shall be corrected by the effect of the gravitational\nredshift: \n$\\rm E_{\\rm cyc}^{\\rm obs}$ = $\\rm E_{\\rm cyc}(1 + \\rm z)^{-1}$  with \n\n\n", "itemtype": "equation", "pos": 21744, "prevtext": "\n\\date{}\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2014}\n\n\\maketitle\n            \n\\label{firstpage}\n\\begin{abstract}\n\nIGR~J19149+1036 is a high mass X-ray binary detected by INTEGRAL \nin 2011 in the hard X-ray domain.  \nWe have analyzed the BAT survey data of the first 103 months of the Swift mission detecting this\nsource at a significance level of $\\sim30$ standard deviations. The timing analysis on the long term\nBAT light curve reveals the presence of a strong sinusoidal intensity modulation of $22.25\\pm 0.05$ d, that we\ninterpret as the orbital period of this binary system.\n\nA broad band (0.3-150 keV) spectral analysis was performed combining the BAT spectrum and the\nXRT spectra from the pointed follow up observations. The spectrum is adequately modeled with\nan absorbed power law with a high energy cutoff  at $\\sim24$ keV and an absorption \ncyclotron feature at $\\sim31$ keV. Correcting \nfor the gravitational redshift, the inferred  magnetic field at the neutron star surface is \n$B_{\\rm surf} \\sim 3.6 \\times 10^{12}$ gauss. \n\n\n\\end{abstract}\n\n\\begin{keywords}\nX-rays: binaries -- X-rays: individual: IGR~J19149+1036\n\n\\noindent\nFacility: {\\it Swift}\n\n\\end{keywords}\n\n\\section{Introduction}\\label{intro} \n\nSince 2004 November, the Burst Alert Telescope (BAT, \\citealp{bat}) on board the \nSwift observatory  \\citep{swift} has been scanning the \nentire sky in the hard X-ray domain (15--150 keV) recording \ntiming and spectral information for any detected source (more than 1700 sources after 100\nmonths of survey\\footnote{http://bat.ifc.inaf.it}). Thanks to its wide field of view \nand to the Swift pointing strategy, the BAT observes daily $\\sim 90\\%$ of the sky, and\ntherefore it is specially fit for source variability studies.\nBAT has proved to be a valuable tool to detect transient phenomena \nfrom known and unknown sources \\citep{krimm13}\nand, by combining the entire data span, to reveal long \nperiodicities of Galactic high mass X-ray binaries (HMXB, e.g. \\citealp{corbet1, corbet2, \ncorbet3, corbet4, corbet5, corbet6, corbet7, cusumano10, cusumano13a, cusumano13b, laparola10,\nlaparola13, segreto13a,segreto13b, dai11}).\n\nIn this paper we present a comprehensive temporal and spectral analysis of the Swift data\ncollected on IGR~J19149+1036. \nThis source was detected by IBIS/ISGRI at a  position consistent \nwith the Einstein source 2E~1912.5+1031  \\citep{pavan11}, although a firm association was not\npossible due to large systematic uncertainties related to the presence of GRS 1915+105 at a \ndistance lower than $\\sim 20'$. The source was \nalso detected by JEM-X with a 3-10 keV X-ray flux of $\\rm 7\\times 10^{-12} erg~s^{-1}cm^{-2}$.\nThe field around IGR~J19149+1036 was observed by Swift/XRT several times.\nThe analysis of the XRT data collected on 2010 Dec. 5 and \n2011 Feb. 17, reported in \\citet{bozzo11}, allowed to estimate a refined source position at \nRA = 19h14m56.73s and Dec = +10deg 36' 38.11'' (J2000), with an associated uncertainty \nof 3.7 arcsec, that confirmed the association with 2E~1912.5+1031 suggested \nby \\citet{pavan11}. The XRT spectrum was modeled by an absorbed \npower-law with a column density N$_{\\textrm H}=\\rm 6.5 \\times 10^{22} cm^{-2}$ and a\nphoton index $\\Gamma=1.8$, with an observed 1-10 keV X-ray flux of\n$\\rm 1.8\\times 10^{-11} erg~s^{-1}cm^{-2}$. 2MASS~J19145680+1036387 (J=14.34,\nH=12.41, K=11.53), within the XRT error circle, is the most likely  counterpart \nto IGR~J19149+1036. \n\nThis paper is organized as follows. Section 2 describes the BAT and XRT data reduction. \nSection 3 reports on the timing analysis. Section 4 describes the broad\nband spectral analysis. In Section  5 we briefly discuss our results.\n\n\n\n\\begin{figure}\n\\begin{center}\n\n\\centerline{\\hspace{.5truecm}\\includegraphics[width=7.5cm,angle=0]{mappaprova2.ps}}\n\\centerline{\\includegraphics[width=8.5cm]{profile.ps}}\n\\centerline{\\hspace{.5truecm}\\includegraphics[width=7.5cm,angle=0]{2e1912_res6_nobar.ps}}\n\\caption[IGR~J19149+1036 sky maps]{ \n{\\bf Top panel}:  \n15-150 keV BAT sky map around IGR~J19149+1036\nThe crosses  mark the position of the sources detected in the field; the star\nmarks the XRT position of IGR~J19149+1036. \n{\\bf Middle panel}: \nValues of the significance extracted along the line that connects the \noptical position of the two surces (magenta\nline in top panel). The plot shows the data (crosses) and the best-fitting\nmodel (black line, the sum of two Gaussian profiles).\nThe higher peak (red line) corresponds to GRS~1915+105 while the lower peak (blue line)\ncorresponds to IGR~J19149+1036.\n{\\bf Bottom panel}: 15-150 keV significance \"residual map\".\n                }\n                \\label{map} \n        \\end{center}\n        \\end{figure}\n\n\n\n\\section{Observations and data reduction}\\label{data}\n\nThe results reported in this paper on IGR~J19149+1036 derive from the analysis of the\nBAT survey data relevant to the  first 103 months of the Swift\nmission. The data were retrieved from the Swift public\narchive\\footnote{http://heasarc.gsfc.nasa.gov/cgi-bin/W3Browse/swift.pl}\nin the form of detector plane histograms (DPH):\nthree-dimensional arrays (two spatial dimensions, one spectral\ndimension) that collect count-rate data in 5-min time bins for\n80 energy channels. We use a dedicated software \\citep{segreto10} \nto process these data, producing all-sky maps in several energy intervals between 15 and 150 keV,\ndetecting sources on these maps and\nextracting, for each source, standard products such as light curves and spectra.\nFigure~\\ref{map}  (top panel) shows the 15-150 keV significance sky map\n(exposure time 39.4 Ms) in the direction of IGR J19149+1036. The source is close\n($\\sim$20 arcmin) to the much brighter object GRS 1915+105: the positions of these two \nsources are marked with  black crosses. In this map IGR J19149+1036 is not immediately detected\n because it is embedded in the PSF signal of the close brighter source. \nHowever, if we extract the values of the significance along the line that connects the \noptical position of the two surces (magenta line in top panel of Figure~\\ref{map}) we observe an\nasymmetric profile  (Figure~\\ref{map}, central panel) that suggests the presence of a \nfaint source (IGR J19149+1036) hidden by the PSF of the brighter one (GRS 1915+105).\nIndeed, the fit of this profile with a single Gaussian shows\nsystematic residuals; conversely, the profile is  well fitted with a \ndouble Gaussian. The best fit peaks of the two Gaussians \ncorrespond to the position of the two sources.\n\n\n\nIn order to make IGR J19149+1036 emerge in the sky map, we perform on each\nDPH a subtraction of the expected illumination pattern from all the  \ndetected sources; from the resulting \"residual shadowgrams\"\nwe generate new survey \"residual maps\" where any previously undetected\nsource can emerge. IGR~J19149+1036 was detected in the 15--150 keV all-sky \"residual map\"\n(Fig. 1, bottom panel) with a signal to noise ratio of 28.6 standard deviations and of 31.7 standard \ndeviations in the 15--60 keV all-sky map, where its signal-to-noise \nis maximized. \nThe 15--60 keV energy band was used to extract \nthe light curve with the maximum resolution ($\\sim300$ s) allowed by the \nSwift-BAT survey data.  For each time bin the contribution from GRS 1915+105 is subtracted. \nThe time tag of each bin, defined as the central time of the bin interval, was\ncorrected to the solar system barycenter (SSB) by using the task {\\sc earth2sun}. \nThe background subtracted spectrum averaged over the entire survey period was \nextracted in 14 energy channels and analyzed using the BAT redistribution \nmatrix available in the Swift calibration \ndatabase\\footnote{http://swift.gsfc.nasa.gov/docs/heasarc/caldb/swift/}.\n\nSwift-XRT \\citep{xrt} observed the field around IGR~J19149+1036  5 times after the discovery of the source\nby Integral.  The source was always observed \nin Photon Counting (PC) mode \\citep{hill04}\nfor a total exposure of $\\sim$3800 s. \nThe details on the five Swift-XRT observations are reported in Table~\\ref{log}.\nThe XRT data were processed with standard procedures ({\\sc xrtpipeline} \nv.0.12.8) using the {\\sc ftools} in the {\\sc heasoft} package (v 6.15) and the \nproducts were extracted adopting a grade filtering of 0-12. The source events for timing and\nspectral analysis were extracted from a circular region of 20 pixel radius (1 pixel = 2.36'') \ncentered on the source position as determined with {\\sc xrtcentroid} \n(RA= 19h14m56.8s and Dec = +10deg 36' 39.1'', J2000), while \nthe background was extracted from an annular region \ncentered on the source, with an inner radius of 60 pixels and an outer radius of\n 90 pixels that avoids  contamination due to the stray--light from GRS~J1915+105 and to the PSF tail\nof IGR~J19149+1036. \nAll source event arrival times were converted to \nthe SSB with the task {\\sc barycorr}\\footnote{http://http://heasarc.gsfc.nasa.gov/ftools/caldb/help/barycorr.html}.\nAncillary response files were generated \nwith {\\sc xrtmkarf}\\footnote{http://heasarc.gsfc.nasa.gov/ftools/caldb/help/xrtmkarf.html}. \nWe also extracted a single source and a single background spectra from the 5 XRT observations\nand combined the relevant ancillary files using {\\sc addarf}, that weights them by the exposure \ntimes of the corresponding source spectra. Finally, the spectra were re-binned with a \nminimum of 20 counts per energy channel. This lower limit of counts per bin is enough to \nensure that the deviation of the observed number of counts from the expected values \napproximates quite well a Gaussian distribution, that is a requirement to apply the  \n$\\chi^2$ statistics. We used the spectral redistribution matrix v014 and the \nspectral analysis was performed using {\\sc xspec} v.12.5.  \n\nErrors are at 90\\,\\% confidence level for a single parameter, if not stated otherwise.\n\n\n\n\\begin{table*}\n\\caption{XRT observations log. The quoted orbital phase refers to the profile shown   \nin Figure~\\ref{period}.\\label{log}} \n\\scriptsize\n\\begin{center}\n\\begin{tabular}{r l l l l l l} \\hline\nObs \\# & Obs ID     & $T_{start}$ & $T_{elapsed}$ & Exposure & Rate            & Orb. Phase  \\\\\n       &            &  MJD        &  (s)          & (s)      &  (c/s)              &     \\\\ \\hline \\hline\n1      &00041130001 & 55535.220   & 29310.9       &  911.5   &$0.23\\pm0.02$        &0.47  \\\\\n2      &00041130002 & 55609.162   & 46002.1       &  1261.2  &$0.13\\pm0.01$        &0.79  \\\\ \n3      &00041130003 & 56267.370   & 388.6         &  387.1   &$0.13\\pm0.02$        &0.39  \\\\ \n4      &00041130004 & 56631.147   & 52911.4       &  849.1   &$0.10\\pm0.01$        &0.75  \\\\ \n5      &00067133005 & 56632.625   & 403.6         &  402.0   &$0.10\\pm0.02$        &0.81  \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\end{table*}\n\n\n\\begin{figure}\n\\begin{center}\n\n\\centerline{\\includegraphics[width=9cm,angle=0]{periodogramma.ps}}\n\\caption[]{{\\bf Top panel}: Periodogram of {\\it Swift}-BAT (15--60\\,keV) data for\nIGR~J19149+1036.\n{\\bf Bottom panel}: Periodogram of {\\it Swift}-BAT  (15--60\\,keV) data for GRS 1915+105. The inset\nshows a close-up view of the periodogram in the 10--30 d interval.                                                              \n                \\label{period}\n}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n\\centerline{\\includegraphics[width=6cm,angle=270]{figura_profilo_pulsato.ps}}\n\n\\centerline{\\includegraphics[width=6cm,angle=270]{figura_bat.ps}}\n\\caption[]{\n{\\bf Top panel}: {\\it Swift}-BAT light curve folded at a period $P=22.25\\pm0.05$\\,d,\nwith 16 phase bins. The arrow points to the phase corresponding to the time of \nthe five XRT observations. \n{\\bf Bottom panel}: BAT light curve. The bin length corresponds to a time interval of  \n$P_0$\\,days.  \n                \\label{fold}\n}\n\\end{center}\n\\end{figure}\n\n\n\n\\section{Timing analysis and results}\\label{timing} \n\n\n\nWe  produced the periodogram of the long term Swift-BAT 15--60 keV light curve \napplying  a folding technique  \\citep{leahy83} which consists in the production of a count rate \nprofile at different trial periods by folding the photon arrival times in N phase bins\nand evaluating for each resulting profile the $\\chi^2$ value with respect to \nthe average count rate. A periodic modulation corresponds to a large value of  $\\chi^2$.\nWe searched in the 1--1000 d period range with a period spacing given \nby P$^{2}/(N  \\,\\Delta$T$_{\\rm BAT})$ where P is the trial period, $N=16$  \nand $\\Delta$T$_{\\rm BAT}\\sim 272.4$ Ms is the data span length. \nThe  average rate in  each profile phase bin was evaluated by weighting the rates  \nwith  the  inverse  square  of  their statistical error. \nThis procedure is mandatory  for data collected by a large field of view coded mask telescope as BAT \nthat are characterized by a large spread of statistical errors.\nThe periodogram (Figure~\\ref{period}, top panel)  shows the \npresence of several prominent features. The highest feature is \nat P$_0=22.25\\pm0.05$ d ($\\chi^2\\sim 702$)  \nwhere P$_0$ and its error are the centroid and the standard deviation \nobtained by modeling this feature with a Gaussian function.\nUsing the method described in \\citet{cusumano13a} we find that the probability of finding such a high\n$\\chi^2$ value by chance is $\\sim 10^{-58}$.\nThe other features clearly visible in  the\nperiodogram and showing  decreasing $\\chi^2$ peaks towards higher trial periods correspond \nto a series of multiples of P$_0$. We verified that the detected periodicity is not present\nin the periodogram of GRS 1915+105 as shown in the bottom panel of Fig.~\\ref{period}.\n\nThe intensity profile (Fig.~\\ref{fold}, top panel) folded at  P$_0$ with \nT$_{\\rm epoch}=54924.32 $ MJD  is characterized \nby a single symmetric peak with a minimum consistent with zero intensity.\nThe minimum dip centroid, evaluated by fitting the data \nwith a Gaussian function, falls at phase 1.06 $\\pm$ 0.01, corresponding\nto  MJD $(54925.7\\pm 0.2)\\pm  n \\times $P$_0$. The peak centroid is at phase 0.56$\\pm$ \n0.01, corresponding to  MJD $(54936.8\\pm 0.2)\\pm  n \\times $P$_0$ . \n\n\nFigure~\\ref{fold} (bottom panel) shows the 103 months BAT light curve with a time resolution of \nP$_0$ days. The source shows a quite persistent behaviour without any significant\nintensity enhancements, which is consistent with the very low level of red noise\nobserved in the source periodogram shown in figure~\\ref{fold}, top panel.\n\nTable~\\ref{log} lists the average count rate during each XRT observation and the \nrelevant orbital phase evaluated with respect to P$_0$ and\nT$_{\\rm epoch}$. \nWe performed a timing analysis on the XRT data searching for the presence of\na periodic modulation tied to the compact object rotation.\nIn order to avoid systematics caused by the read-out time in PC mode (characterized by\na time resolution bin of $\\delta T_{XRT}$=2.5073 s), the arrival times of the events in \nPC mode were randomized within $\\delta T_{XRT}$. \nMoreover, XRT observations are fragmented into snapshots  of different duration and\ntime separation that may introduce spurious features in the timing analysis. \nTo avoid these systematics we performed a folding analysis on each snapshot with \nan exposure time higher than 500 s and with a statistical content larger than 100 counts, \nsearching in a period range [$\\delta T_{XRT}$~:~100] s. \nThe periodograms obtained from snapshots belonging to the same observation\nwere also summed together. We did not found significant features \nin any of the resulting periodograms.\n\n\n\n\\section{Spectral Analysis} \\label{spectral}\n\nBecause the XRT and BAT data are collected at different times and with different exposures,\nwe verified\nthat no significant spectral variability is present both among the \nfive XRT observations and during the BAT monitoring. To this aim we produced  \nhardness ratios  of the source events in the energy bands 4--10 keV / 0.5--4 keV \nfrom each XRT observation and in the energy bands 35--150 keV / 15--35 keV for \nthe BAT data. In both cases, no significant variability is observed.\n\nIn order to maximize the S/N ratio of the BAT data, we produced a spectrum selecting the data in\nthe phase interval 0.3-0.8 (see Figure~\\ref{fold}, top panel ).\nThen fitted the BAT spectrum and the XRT spectrum obtained from the entire XRT dataset using a\ncommon spectral model, including a multiplicative factor that is frozen \nto unity for the XRT spectrum and is left free to vary  for the BAT  spectrum, to account for \nany inter-calibration uncertainty between the two telescopes and/or \nfor different average source intensity between the  XRT and BAT observing times.   \nThe  combined  XRT-BAT  spectrum (Fig.~\\ref{spec}, top panel)  was  first modeled  with  an\nabsorbed power law (model 1 {\\tt cons*phabs*powerlaw}) with a $\\chi^2$ of 74.7\nwith 34 degrees of freedom (d.o.f.). We also tried to model the broad band spectrum\nincluding a cutoff in the model  (model 2 {\\tt cons*phabs*cutoffpl}) obtaining a $\\chi^2$  of \n69.9 (33 d.o.f.). \nBoth models result indeed unacceptable, with residuals (Fig.~\\ref{spec}, middle panel) that\nshow a broad range residual pattern both in the XRT and in the BAT data.\nWe added to both models an absorption cyclotron line ({\\tt cyclabs}), obtaining a significant \nimprovement in the $\\chi^2$ (28.4, 30 d.o.f, with $\\Delta\\chi_0^2=41.5$) only for model 2 with a \nflat residual distribution (Fig.~\\ref{spec}, bottom panel).\nTable \\ref{fit} reports the spectral results of the best fitting model.\nTo estimate the statistical significance of the presence of the cyclotron absorption feature \nwe applied a Monte Carlo simulation on the BAT spectrum. The details of this\nprocedure can be found in \\citet{dai11b}.\nWe find that the  probability of chance occurrence to find a $\\Delta \\chi^2$ value $\\ge 41.5 $ is \n$\\sim 2.7 \\times10^{-6}$.\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\n\\centerline{\\includegraphics[width=5.4cm,angle=-90]{spettro_cyc_m.ps}}\n\\centerline{\\includegraphics[width=5.4cm,angle=-90]{figura_residuals_nocyc_m.ps}}\n\\centerline{\\includegraphics[width=5.9cm,angle=-90]{figura_residuals_cyc_m.ps}}\n\\caption[IGR~J19149+1036 XRT and BAT energy spectral distribution]{{\\bf Top panel}:\nIGR~J19149+1036 \nXRT and BAT spectra and best fit {\\tt phabs*cutoffpl} model. \n{\\bf Middle panel}: Residuals in unit of standard deviations for the {\\tt phabs*cutoffpl}\nmodel.\n{\\bf Bottom panel}: Residuals in unit of standard deviations for the {\\tt\nphabs*cutoffpl*cyclabs} model.\n                }\n\\label{spec} \n\\end{center}\n\\end{figure}\n\n\n\n\\begin{table}\n\\begin{tabular}{ r l l}\n\\hline\nParameter & Best fit value & Units    \\\\ \\hline \\hline\n$\\rm n_H$    & $3.9^{+0.3}_{-0.1} \\times 10^{22}$ & $\\rm cm^{-2}$\\\\\n$\\Gamma$  &$0.9^{+0.4}_{-0.4}$&          \\\\\n$E_{cut}$ &$24^{+10}_{-5}$ & keV\\\\\n$N$       &$ 1.8^{+1.6}_{-0.8}\\times 10^{-3}$ &ph $\\rm keV^{-1} cm^{-2} s^{-1}$ at 1 keV \\\\\n$\\rm C_{BAT}$&$1.1^{+0.5}_{-0.4}$&\\\\\n$\\rm E_{cyc}$& $31.2^{+1.9}_{-2.2}$& keV\\\\\n$\\rm D_{cyc}$& $0.9^{+0.4}_{-0.4}$& \\\\\n$\\rm W_{cyc}$& $8.4^{+4.2}_{-2.8}$& keV \\\\\n$\\rm F$ (0.3--10 keV)&$1.76\\times 10^{-11}$& erg s$^{-1}$ cm$^{-2}$\\\\\n$\\rm F$ (15--150 keV)&$4.53\\times 10^{-11}$& erg s$^{-1}$ cm$^{-2}$\\\\\n$\\chi^2$   &28.4  (30 d.o.f.) & \\\\ \\hline\n\\end{tabular}\n\\caption{Best fit spectral parameters for the {\\tt\nphabs*cutoffpl*cyclabs} model.  $\\rm C_{BAT}$ is the\nconstant factor to be multiplied to the model in order to match the XRT and BAT data.\nWe report {\\bf observed} fluxes for the standard XRT (0.3--10 keV) and BAT (15--150 keV)\nenergy bands. \\label{fit}}\n\\end{table}\n\n\n\n\n\n\n\\section{Conclusions}\\label{conclusion}\n\nWe have analyzed the Swift-BAT and XRT data relevant to the HMXB IGR~J19149+1036. \nThe source is close ($\\sim$20 arcmin) to the much brighter source GRS 1915+105, and\nan ad hoc imaging analysis was necessary to reveal it in the BAT all sky map, where it emerges\nat a significance level of $\\sim29$\n($\\sim32$) standard deviations in the 15--150 keV (15--60 keV) band after \n103 months of the Swift mission. \nThe timing analysis on the long term BAT light curve \nunveils the presence of a periodic modulation in the hard X-ray emission \nwith a period of P$_0=22.25\\pm0.05$ days. We interpret this modulation\nas the orbital period of the binary system. The folded light curve is characterized\nby a single symmetric peak with a roughly sinusoidal shape that shows a minimum consistent with \nzero intensity, lasting $\\sim30$ per cent of the orbital period.\nSuch a long minimum intensity phase interval is difficult to explain with \na full eclipse of the compact object, unless we speculate that the system has both an extremely \neccentric orbit and a high inclination angle. An alternative explanation is \nthat the modulation is caused by the passage of the compact source through the \nstellar wind, whose density decreases as the source approaches the orbit apastron. \nHowever, no definite conclusion on the geometry of the binary system can be drawn, without knowing\nthe spectral type of the companion star. \n\nThe broad band spectrum cannot be adequately described by the standard continua used for HMXB, because of\nthe presence of an absorption feature within the BAT energy range.\nWe obtain a good description of the data introducing a cyclotron line in the cutoff power law model.\nThe energy of the cutoff is $\\sim 24$ keV and the line is centered at E$_{\\rm cyc} \\sim 31$ keV. \nThe presence of absorption cyclotron lines has been revealed in several HMXB. \nThey are thought to be originated near the magnetic poles of the\nneutron star due to resonant scattering processes of the X-rays by electrons whose kinetic \nenergies  are quantized in discrete Landau energy levels perpendicular to the B-field\n\\citep{Landau07}. \n\nTheir energy centroid is related to the intensity of the magnetic field of the neutron star:\n\n", "index": 1, "text": "\\begin{equation}\n\\rm B_{\\rm obs} =10^{12} \\times \\frac{E_{\\rm cyc}/(1 keV)}{11.6} Gauss\\sim 2.7\\times10^{12} Gauss\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\rm B_{\\rm obs}=10^{12}\\times\\frac{E_{\\rm cyc}/(1keV)}{11.6}Gauss\\sim 2.7%&#10;\\times 10^{12}Gauss\" display=\"block\"><mrow><msub><mi mathvariant=\"normal\">B</mi><mi>obs</mi></msub><mo>=</mo><mrow><mrow><msup><mn>10</mn><mn>12</mn></msup><mo>×</mo><mfrac><mrow><msub><mi mathvariant=\"normal\">E</mi><mi>cyc</mi></msub><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>⁢</mo><mi mathvariant=\"normal\">k</mi><mo>⁢</mo><mi mathvariant=\"normal\">e</mi><mo>⁢</mo><mi mathvariant=\"normal\">V</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mn>11.6</mn></mfrac></mrow><mo>⁢</mo><mi>Gauss</mi></mrow><mo>∼</mo><mrow><mrow><mn>2.7</mn><mo>×</mo><msup><mn>10</mn><mn>12</mn></msup></mrow><mo>⁢</mo><mi>Gauss</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.08138.tex", "nexttext": "\n\nUsing standard parameters for the neutron star ($M_{\\rm ns}=1.4\\,M_{\\sun}$, $\\rm R_{\\rm ns} = 10^6$ cm),\nthe magnetic field at the neutron star surface would be B$_{\\rm surf} \\sim 3.6 \\times 10^{12}$ \nGauss. This result is fully consistent with the distribution of the magnetic field values derived for \nneutron stars in binary systems, that peaks in the range $1-4 \\times 10^{12}$ G \\citep{maki99}.\n  \n\\section*{Acknowledgments}\nThis work has been supported by ASI grant I/011/07/0.\n\n\n\\bibliographystyle{aa}\n\n\\begin{thebibliography}{}\n\n\n\\bibitem[Barthelmy et al.(2005)]{bat} Barthelmy, S.~D., et \nal.\\ 2005, Space Science Reviews, 120, 143 \n\n\n\\bibitem[Bozzo et al.(2011)]{bozzo11} Bozzo, E., Ferrigno, C., \nPavan, L., Walter, R., \n\\& Stella, L.\\ 2011, The Astronomer's Telegram, 3326, 1 \n\n\n\n\n\n\n\\bibitem[Burrows et al.(2004)]{xrt} Burrows, D.~N., Hill, \nJ.~E., Nousek, J.~A., et al.\\ 2004, SPIE, 5165, 201 \n\n\n\\bibitem[Corbet \\& Krimm(2009)]{corbet1} Corbet, R.~H.~D., \\& Krimm, H.~A.\\ 2009, \nThe Astronomer's Telegram, 2008, 1\n \n\\bibitem[Corbet et al. (2010a)]{corbet2} Corbet, R.~H.~D., Krimm,\nH.~A., \\& Skinner, G.~K.\\ 2010, The Astronomer's Telegram, 2559, 1\n\n\\bibitem[Corbet et al. (2010b)]{corbet3} Corbet, R.~H.~D., Krimm,\nH.~A., Barthelmy, S.~D., et al.\\ 2010, The Astronomer's Telegram, 2570, 1\n\n\\bibitem[Corbet et al. (2010c)]{corbet4} Corbet, R.~H.~D.,\nBarthelmy, S.~D., Baumgartner, W.~H., et al.\\ 2010, The Astronomer's\nTelegram, 2588, 1\n\n\\bibitem[Corbet et al. (2010d)]{corbet5} Corbet, R.~H.~D.,\nBarthelmy, S.~D., Baumgartner, W.~H., et al.\\ 2010, The Astronomer's\nTelegram, 2598, 1\n\n\\bibitem[Corbet et al. (2010e)]{corbet6} Corbet, R.~H.~D.,\nBarthelmy, S.~D., Baumgartner, W.~H., et al.\\ 2010, The Astronomer's\nTelegram, 2599, 1\n \n\\bibitem[Corbet \\& Krimm(2010)]{corbet7} Corbet, R.~H.~D., \\& Krimm, H.~A.\\ 2010, \nThe Astronomer's Telegram, 3079, 1\n\n\\bibitem[Corbet(1986)]{corbet86} Corbet, R.~H.~D., 1986, {MNRAS}, 220, 1047\n\n\\bibitem[Cusumano et al.(2010)]{cusumano10} Cusumano, G., La \nParola, V., Romano, P., et al.\\ 2010, {MNRAS}, 406, L16 \n\n\\bibitem[Cusumano et al.(2013a)]{cusumano13a} Cusumano, G., Segreto, \nA., La Parola, V., et al.\\ 2013, {MNRAS}, 436, L74 \n\n\\bibitem[Cusumano et al.(2013b)]{cusumano13b} Cusumano, G., Segreto, \nA., La Parola, V., et al.\\ 2013, {ApJL}, 775, L25 \n\n\\bibitem[D'A{\\`i} et al.(2011a)]{dai11} D'A{\\`i}, A., La Parola, V., Cusumano, G., \net al.\\ 2011, {A\\&A}, 529, A30\n\n\\bibitem[D'A{\\`i} et al.(2011b)]{dai11b} D'A{\\`i}, A., Cusumano, G., La Parola, V., et al.\\ 2011, \n{A\\&A}, 532, A73 \n\n\n\\bibitem[Dickey \\& Lockman(1990)]{dickey90} Dickey, J.~M., \\& Lockman, F.~J.\\ \n1990, ARAA, 28, 215 \n\n\\bibitem[Gehrels et al.(2004)]{swift} Gehrels, N., et al.\\ \n2004, {ApJ}, 611, 1005 \n\n\n\\bibitem[Kennea et al.(2005)]{atel459} Kennea J. A., Burrows D. N., Nousek\nJ. A., Chester M., Roming P., Barthelmy S., Gehrels N., Beckmann V., Soldi S.,\n2005, ATEL 459\n\n\\bibitem[Krimm et al.(2013)]{krimm13} Krimm, H.~A., Holland, \nS.~T., Corbet, R.~H.~D., et al.\\ 2013, ApJS, 209, 14 \n\n\\bibitem[Hill et al.(2004)]{hill04} Hill, J.~E., Burrows, \nD.~N., Nousek, J.~A., et al.\\ 2004, SPIE, 5165, 217 \n\n\\bibitem[La Parola et al.(2013)]{laparola13} La Parola, V., \nCusumano, G., Segreto, A., et al.\\ 2013, {ApJL}, 775, L24 \n\n\\bibitem[La Parola et al.(2010)]{laparola10} La Parola, V., \nCusumano, G., Romano, P., et al.\\ 2010, {MNRAS}, 405, L66 \n\n\\bibitem[Leahy et al.(1983)]{leahy83} Leahy, D.~A., Elsner, \nR.~F., \\& Weisskopf, M.~C.\\ 1983, {ApJ}, 272, 256 \n\n\\bibitem[Makishima et al.(1999)]{maki99} Makishima, K., \nMihara, T., Nagase, F., \\& Tanaka, Y.\\ 1999, {ApJ}, 525, 978 \n\n\\bibitem[Pavan et al.(2011)]{pavan11} Pavan, L., Bozzo, E., Ferrigno, C., \net al.\\ 2011, {A\\&A}, 526, A122 \n\n\\bibitem[Segreto et al.(2010)]{segreto10} Segreto, A., Cusumano, G., Ferrigno, C., \nLa Parola, V., Mangano, V., Mineo, T., \\& Romano, P.\\ 2010, {A\\&A}, 510, A47 \n\n\\bibitem[Segreto et al.(2013a)]{segreto13a} Segreto, A., La Parola, V., Cusumano, G., \net al.\\ 2013, {A\\&A}, 558, A99 \n\n\\bibitem[Segreto et al.(2013b)]{segreto13b} Segreto, A., Cusumano, G., La Parola, V., \net al.\\ 2013, {A\\&A}, 557, A113 \n\n\\bibitem[Sch{\\\"o}nherr et al.(2007)]{Landau07} Sch{\\\"o}nherr, G., Wilms, J., Kretschmar, P., et al.\\ 2007,\n{A\\&A}, 472, 353 \n\\label{lastpage}\n\n\n\\end{thebibliography}{}\n\n\n", "itemtype": "equation", "pos": 22117, "prevtext": "\n\nIf the cyclotron absorption takes place near the poles of the neutron star\nthe observed resonance energy shall be corrected by the effect of the gravitational\nredshift: \n$\\rm E_{\\rm cyc}^{\\rm obs}$ = $\\rm E_{\\rm cyc}(1 + \\rm z)^{-1}$  with \n\n\n", "index": 3, "text": "\\begin{equation}\n(1 + \\rm z)^{-1} = \\left(1-\\frac{\\rm 2GM_{\\rm ns}}{\\rm R_{\\rm ns}c^2}\\right)^{0.5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"(1+\\rm z)^{-1}=\\left(1-\\frac{\\rm 2GM_{\\rm ns}}{\\rm R_{\\rm ns}c^{2}}\\right)^{0.5}\" display=\"block\"><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi mathvariant=\"normal\">z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>=</mo><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">G</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">M</mi><mi>ns</mi></msub></mrow><mrow><msub><mi mathvariant=\"normal\">R</mi><mi>ns</mi></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">c</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>)</mo></mrow><mn>0.5</mn></msup></mrow></math>", "type": "latex"}]