[{"file": "1601.04302.tex", "nexttext": "\n\nThe coefficient vector ${\\ensuremath{{\\bm a}}}$ includes the weights for each independent variable of the input vector $\\mathbf{x}$, and is estimated using the corresponding data.  \nThe value of coefficient ${\\ensuremath{{a}}}_i$ quantifies the impact that feature $x_i$ has on the probability of win, while the corresponding $p$-value quantifies its statistical significance.  \nIn our study, a contesting team is associated with the binary dependent variable ${\\ensuremath{W}}$ that represents whether the team wins (i.e., ${\\ensuremath{W}}=1$) or loses (i.e., ${\\ensuremath{W}}=0$).  \n\n{\\bf Statistical Bootstrap: }\nIn order to perform a game outcome prediction, we first need to forecast the performance of each of the contesting teams.  \nHowever, we only have a small set of historic performance data for each team.  \nTo overcome this problem we will rely on statistical bootstrap.  \nStatistical bootstrap \\cite{efron93} is a robust method for estimating the unknown distribution of a population's statistic when a sample of the population is known.\nThe basic idea of the bootstrapping method is that in the absence of any other information about the population, the observed sample contains all the available information about the underlying distribution.\nHence resampling with replacement is the best guide to what can be expected from the population distribution had the latter been available.\nBy generating a large number of such resamples allows us to get a very accurate estimate of the required distribution.\nFurthermore, for data with dependencies (temporal or otherwise), appropriate block resampling retains any dependencies between data points \\cite{kunsch89}.\nWe will utilize bootstrap in our prediction engine.\n\n\n\\section{Results}\n\\label{sec:results}\n\nIn this section we will present our results.  \nWe will start by examining the {\\tt rational coaching} hypothesis and then we will move on to present our logistic regression model.  \n\n\\subsection{The {\\tt rational coaching} hypothesis}\n\\label{sec:rational_coaching}\n\nOur running hypothesis is: \n\n\\begin{hyp} \n\\label{hyp:h1}{\\tt [Rational Coaching]:}\nCoaching decisions are always rational in terms of maximizing the number of points scored.  \n\\end{hyp}\n\nTo reiterate, in order to study the above hypothesis we will analyze the decisions taken for the PAT and a fourth down situation.  \n\n\n\n\\subsubsection{Points After Touchdown}\n\\label{sec:pat}\n\n\n\nOnce a team scores a touchdown (worth 6 points) they have the option to either kick an extra point field goal from the 15-yard line (i.e., a 33-yard field goal) or make a regular play from the 2-yard line for 2 points (known as two-point conversion).  \nIt is clear that this is a strategic decision that teams have to make.  \nIn some cases the decision is easy (i.e., the team is trailing by 2 points with the clock running out) but in most of the touchdowns the decision is not so clear since special circumstances do not exist. \nIn fact, one would expect that such extraordinary situations appear only for the touchdowns towards the end of the game.  \nSo what about the rest of the touchdowns? \n\nAnalyzing our data we find that the dominant decision is to settle for the extra point after a touchdown instead of trying to score more points and attempting a two-point conversion.  \n\nIn particular, from the 9,021 touchdowns during the 7 regular seasons that our data span, only 460 of them were followed by a two-point conversion attempt.  \nFrom these, 235 were successful, that is, an overall 51\\% success rate.  \nOn the other hand, from the 8,561 extra point kick attempts, 8,425 were successful, which translates to a 98.4\\% success rate.   \nIf the decision criteria was the success rate, then the extra point kick is clearly the optimal choice! \nHowever, a game is won by points and not success rates and therefore, the coaching objective of a rational team should be to maximize the (expected) number of points scored \\cite{RePEc:ucp:jpolec:v:114:y:2006:i:2:p:340-365}.  \nWith ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ and ${\\ensuremath{{s}}}_{{\\tt kick}}$ being the success rates for the two-point conversions and extra point kicks respectively, the expected point differential benefit per touchdown $\\mathbf{E}[p]$ of a two-point conversion over an extra point kick is given by: \n\n\n", "itemtype": "equation", "pos": 13475, "prevtext": "\n\\vspace*{0.35in}\n\n\n\\begin{flushleft}\n{\\Large {\\tt Footballonomics}: The Anatomy of American Football}\\\\ Evidence from 7 years of NFL game data\n\\newline\n\n\\\\\nKonstantinos Pelechrinis\\textsuperscript{1}\n\n\n\n\n\n\n\n\\\\\n\\bf{1} School of Information Sciences, University of Pittsburgh, Pittsburgh, PA, USA\n\n\n\n\n\n\\\\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n* E-mail: Corresponding kpele@pitt.edu\n\\end{flushleft}\n\n\nDo NFL teams make rational decisions?\nWhat factors potentially affect the probability of wining a game in NFL?\nHow can a team come back from a demoralizing interception? \nIn this study we begin by examining the hypothesis of {\\tt rational coaching}, that is, coaching decisions are always rational with respect to the maximization of the expected points scored.  \nWe reject this hypothesis by analyzing the decisions made in the past 7 NFL seasons for two particular plays; (i) the Point(s) After Touchdown (PAT) and (ii) the fourth down decisions.   \n\nHaving rejected the {\\tt rational coaching} hypothesis we move on to examine how the detailed game data collected can potentially inform game-day decisions.  \nWhile NFL teams personnel definitely have an intuition on which factors are crucial for winning a game, in this work we take a data-driven approach and provide quantifiable evidence using a large dataset of NFL games for the 7-year period between 2009 and 2015.  \nIn particular, we use a logistic regression model to identify the impact and the corresponding statistical significance of factors such as possession time, number of penalty yards, balance between passing and rushing offense etc.   \nOur results clearly imply that avoiding turnovers is the best strategy for winning a game but turnovers can be overcome with letting the offense on the field for more time.  \nFinally we combine our descriptive model with statistical bootstrap in order to provide a prediction engine for upcoming NFL games.  \nOur evaluations indicate that even by only considering a small number of (straightforward) factors, we can achieve a very good prediction accuracy.  \n\nIn particular, the average accuracy during seasons 2014 and 2015 is approximately 63\\%.  \nThis performance is comparable to the more complicated state-of-the-art prediction systems, while it outperforms expert analysts 60\\% of the time.  \n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\nWhile American football is viewed mainly as a physical game - and it surely is - at the same time is probably the most strategic sports game, a fact that makes it appealing even to international crowd \\cite{lamb12}.  \nThis has lead to people analyzing the game with the use of data analytics methods and game theory.  \nFor instance, after the controversial last play call of Super Bowl XLIX the Economist argued with data and game theory that this play was rational and not that bad after all \\cite{economist-superbowlxlix}.  \n\nThe ability to analyze and collect large volumes of data have put forward a quantification-based approach of the success in various sports during the last few years.  \nFor example, Clark {\\em et al.} \\cite{clark2013going} analyzed the factors that affect the success of a field goal kick and contrary to popular belief they did not identify any situational factor (e.g., regular vs post season, home vs away etc.) as being significant.  \nIn another direction the authors in \\cite{Pfitzner14} and \\cite{warner10} are studying models and systems for determining a successful betting strategy for NFL games, while Stair {\\em et al.} \\cite{stair08} show that the much-discussed off-field misconduct of NFL players does not affect a team's performance.  \nIn a different sport, Fewell {\\em et al.} \\cite{fewell2012basketball} analyzed data from the 2010 NBA play-offs using network theory.  \nIn particular, they considered a network where each team player is a node and there is an edge between two players if they exchanged a pass.  \nUsing this structure they found that there is a consistent association between a team's advancement in the next playoff round and the values of clustering and network entropy.  \nWith regards to soccer, Vilar {\\em et al.} \\cite{Vilar2013} focus on the analysis of local dynamics and show that local player numerical dominance is key to defensive stability and offensive opportunity.  \nBar-Eli {\\em et al.} \\cite{bar2007action,bar2009penalty} further collected information from 286 penalty kicks from professional leagues in Europe and South America and analyzed the decisions made by the penalty tackers and the goal keepers.  \nTheir main conclusion is that from a statistical standpoint, it seems to be more advantageous for a goal keeper to defend by remaining in the goal's center.  \nFurthermore, Di {\\em et al.} \\cite{di2007performance} analyzed the motion of 200 soccer players from 20 games of the Spanish Premier League and 10 games of the Champions League and found that the different positional roles demand for different work intensities.  \n\nIn another direction the authors in \\cite{Correia2011984} analyzed the pass behavior of rugby players.  \nThey found that the time period required in order to close the gap between the first attacker and the defender explained 64\\% of the variance found in pass duration and this can further yield information about future pass possibilities.  \nPredicting the outcome of a sports game has long been a topic of interest and various models have appeared (e.g., \\cite{glickman1998state,constantinou2010evaluating,cohea11}).  \nHowever, many of them rely on strong theoretical assumptions (e.g., team strength factors obey to a  first-order autoregressive process) that is hard to verify.  \nData from professional sporting competitions have also been used extensively as a proxy for testing various hypotheses of firm optimization as well as understanding the way people behave and understand - and misinterpret - statistical information (e.g., \\cite{risen06,RePEc:ucp:jpolec:v:114:y:2006:i:2:p:340-365,GILOVICH1985295,10.2307/2291254})\n\n\n\nComplementary to the existing efforts the purpose of our study is twofold.  \nFirst, we want to examine the {\\tt rational coaching} hypothesis.  \nIn particular, the goal of every team is to win, which is achieved by maximizing the number of points scored.  \nHence, one should expect the decisions that the coaches are making to always be rational with respect to this objective.    \nHowever, triggered by anecdote evidence, such as the article by the Economist mentioned above, it seems that rational decisions made by coaching staff are many times received with questions and are scrutinized.  \nSuch scrutiny might discourage coaches from following rational decisions especially when they rationale behind its justification is complex.  \nThe {\\em status quo bias} \\cite{10.1257/jep.5.1.193} can further perpetuate this behavior and hence, coaches make decisions that differ from those that a rational agent would take to maximize the expected points scored.    \n\n\nUsing game data from the National Football League for the period between 2009 and 2015 we provide convincing evidence to reject the {\\tt rational coaching} hypothesis.  \nWe focus on two particular decisions that the coaches face multiple times during the course of a single game, namely, the Point(s) After Touchdown (PAT) and the fourth down decisions.  \nThe status quo for PAT is to go for an extra point kick unless if specific situations appear (the supposedly irrelevant factors termed by Thaler \\cite{thaler2015misbehaving} that affect human decisions).  \nThe status quo for fourth down decisions is to punt, unless again if specific situations appear (e.g., game clock running out and trailing in the score).  \nOur game data analysis shows that actually (with very few exceptions) both are not the rational decisions to make when the objective is to maximize the expected number of points scored in a game. \nThis tenacity of NFL coaches is rather surprising especially given that similar issues have been reported in the literature since 1967 \\cite{doi:10.1080/00031305.1967.10479847,sackrowitz2000refining,RePEc:ucp:jpolec:v:114:y:2006:i:2:p:340-365}! \nOne might have expected that with data analysis and statistics being an integral part of sports organizations during the last decade, this behavior would have changed and decisions would follow more closely those of an ``ideal'' rational agent.   \nHowever, it appears that the status quo bias is extremely strong in American football.  \n\nSecond, \ntaking a rational, data-driven approach, we are interested in quantifying the impact of various factors on the probability of wining a game of American football.  \nMore specifically, \nusing the same data as above, we extract specific team statistics for both the winning and losing teams.  \nWe then use logistic regression to quantify the effect and statistical significance of each of these factors on the probability of wining. \n\nThis model is a descriptive model, i.e., one that analyzes the factors that affect the success of an NFL team.  \nHowever, one of the most intriguing tasks for professional sports analysts is predicting the winners of the upcoming NFL matchups.  \nA factor that makes this task particularly hard for American football is the small number of games during a season, which translates to large uncertainty.  \nTo tackle this problem we propose a combination of statistical bootstrap with the logistic regression model developed above in order to provide a baseline prediction probability.  \nWhile our approach is shown to exhibit an accuracy of approximately 63\\% (comparable to that of the state-of-the-art systems such as Microsoft's Cortana), it should be treated as a baseline estimation.    \nSimply put the output probability of our model can be though of as an anchor value for the probability of win.  \nFurther adjustments can be made using information about the specific match-up (i.e., roster, weather forecast etc.).  \n\nIn the rest of the study we present the data and methods that we used (see \\nameref{sec:materials_methods}).  \nWe then present the results (see \\nameref{sec:results}) and discuss the implications of our study (see \\nameref{sec:discussion}). \n\n\\iffalse\nThe rest of the paper is organized as follows.  \nIn Section \\ref{sec:background} we briefly discuss relevant studies in quantifying important factors of success in different sports.  \nWe also provide a background on statistical bootstraping and describe the dataset we used.  \nSection \\ref{sec:2pt-conv} discusses the rationality behind coaching decisions based on evidence from PAT plays, while Section \\ref{sec:model} describes the features we consider for our logistic regression model for the winning probability and the corresponding model.  \n\nFinally, Section \\ref{sec:predict} describes and evaluates our prediction model, while Section \\ref{sec:conclusions} concludes our work.  \n\\fi\n\\section{Materials and Methods}\n\\label{sec:materials_methods}\n\nIn this section we will present the dataset we used to perform our analysis as well as the different methodological pieces of our analysis.  \n\n{\\bf NFL Dataset: }\nIn order to perform our analysis we utilize a dataset collected from NFL's Game Center for all the games (regular and post season) between the seasons 2009 and 2015.  \nWe access the data using the Python {\\tt nflgame} API \\cite{nflgame}.  \nThe dataset includes detailed play-by-play information for every game that took place during these seasons.  \nIn total, we collected information for 1,792 regular season games and 77 play-off games.  \nGiven the small sample for the play-off games and in order to have an equal contribution in our dataset from all the teams we focus our analysis on the regular season games, even though play-off games are by themselves of interest in many perspectives.   \n\n{\\bf Mean Field Analysis: }\nMany times it is hard - if not intractable at all - to model and examine all the interactions between the components of a complex stochastic system.  \nIn these cases, we often rely on mean field analysis where the complex interactions are approximated by a single averaged effect.  \nMean field approximations have been extensively used in physics and network science.  \nFor example, the growth dynamics of various generative network models (e.g., preferential attachment, small-world etc.) have been analyzed through mean field approximations (e.g., \\cite{barabasi1999173,newman2000mean}) and provide accurate results despite the abstractions introduced.  \nIn our work, we will use mean field analysis to estimate the expected point benefit from the various decisions available to a coach.  \nThis analysis considers interactions between consecutive plays only (e.g., a failed fourth down and the ensuing starting field position for the drive of the opposing team) and ignores higher order interactions (e.g., the potential impact of a decision 5 drives later).  \n\n\n{\\bf Logistic Regression: }\nIn order to identify the importance of various factors on winning an American football game we will rely on a generalized linear model, namely, logistic regression.  \nLogistic regression is used to capture the dependencies of a binary variable $Z$ to a set of independent variables $\\mathbf{x}$.   \nThe output ${\\ensuremath{y}}$ of the logistic regression provides us with the probability of this random variable taking the value of 1, i.e., ${\\ensuremath{y}}=\\Pr(Z = 1)$ given vector $\\mathbf{x}$.  \nWith this setting the logistic regression model for $Z$ is given by: \n\n\n", "index": 1, "text": "\\begin{equation}\n\\Pr(Z=1| \\mathbf{x})= \\frac{\\exp({\\ensuremath{{\\bm a}}}^T\\cdot\\mathbf{x})}{1+\\exp({\\ensuremath{{\\bm a}}}^T\\cdot\\mathbf{x})}\n\\label{eq:logistic}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Pr(Z=1|\\mathbf{x})=\\frac{\\exp({{\\bm{a}}}^{T}\\cdot\\mathbf{x})}{1+\\exp({{\\bm{a}%&#10;}}^{T}\\cdot\\mathbf{x})}\" display=\"block\"><mrow><mrow><mi>Pr</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>Z</mi><mo>=</mo><mn>1</mn></mrow><mo stretchy=\"false\">|</mo><mi>𝐱</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝒂</mi><mi>T</mi></msup><mo>⋅</mo><mi>𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝒂</mi><mi>T</mi></msup><mo>⋅</mo><mi>𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.04302.tex", "nexttext": " \n\nWith the extra point kick, the probability of success is 0.984 and thus, the expected number of points is 0.984.  \nOn the contrary, with the two-point conversion the success rate is only 0.51 but the expected number of points is 1.02, which ultimately gives a positive expected point differential benefit (i.e., $\\mathbf{E}[p] > 0$).  \n\nOf course, the net gain per touchdown is fairly small and not all the teams have the same success rate in the two-point conversions and the extra point kick attempts.  \n\n\n\n\n\n\nHence, not all teams would necessarily benefit from this strategy.  \nFigure \\ref{fig:2pts} presents the expected benefit $\\mathbf{E}[p]$ per team using the corresponding success rates from our 7-year dataset.  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.26]{figures/2pts}\n\\caption{Different teams have different expected point gains based on the corresponding success rates ${\\ensuremath{{s}}}_{{\\tt2pts}}$ and ${\\ensuremath{{s}}}_{{\\tt kick}}$.  On the top of each bar we also present the number of times that the corresponding team attempted a two-point conversion in our dataset.  Pittsburgh Steelers and Chicago Bears appear to have to gain the most from switching to two-point conversions.  In fact, half of the Steeler's two-point conversion attempts in the dataset happened during the 2015 regular season.  The largest expected gain is observed for San Diego.  However, the Chargers have only tried the two-point conversion 6 times and it might be hard to consider the corresponding success rate statistically representative and robust.}\n\\label{fig:2pts}\n\\end{center}\n\\end{figure}\n\n\nNevertheless, practicing two-point conversion plays can be beneficial in the long term.  \nIncreasing slightly the success rates can turn to non-negligible point gains.  \nIn fact, the new rules for the extra point kicks introduced at the beginning of the 2015 season have led to a statistically significant reduction in ${\\ensuremath{{s}}}_{{\\tt kick}}$.  \nIn particular, the extra kick is snapped from the 15-yard line (as alluded to above) instead of the 2-yard line that used to be all the previous years.  \nTable \\ref{tab:kick_success} depicts the success rates for the extra point kicks over the years that our dataset spans.  \nAs we can observe there is a significant drop of approximately 5\\% ($p$-value $< 10^{-6}$) in the success rate during the 2015 season! \nOn the contrary, there was no impact on the success rate of the two-point conversion attempts (as one might have expected).  \nThe success rate for 2015 was 1.6\\% higher than the yearly average success rate between 2009-2014. \nHowever this difference is not statistically significant ($p$-value = 0.4).   \nTherefore, it appears as a good potential strategy for the teams to start practicing and attempting two-point conversions.  \n\n\\begin{table}[h]\n\\scriptsize\n  \\begin{center}\n    \\begin{tabular}{l|c|c}\n    \\toprule\n\t\t\t\\bf Year & \\bf ${\\ensuremath{{s}}}_{{\\tt kick}}$ & \\bf ${\\ensuremath{{s}}}_{{\\tt 2pt}}$ \\\\\n      \\midrule\n\n2009 & 0.9814 & 0.4426\\\\\n2010 & 0.9884 & 0.5471\\\\\n2011 & 0.9942 & 0.5 \\\\\n2012 & 0.9935 & 0.55\\\\\n2013 & 0.9960 & 0.4929\\\\\n2014 & 0.9926  & 0.5161\\\\\n2015 & {\\bf 0.9416} & 0.5247\\\\\n\\bottomrule\n    \\end{tabular}\n    \\vspace{0.2cm}\n       \\caption{The new PAT rules introduced in 2015 have led to significant drop of the success rate of the extra point kick by approximately 5\\% ($p$-value $< 0.001$). On the contrary, there is no impact (as expected) on the two-point conversion success rate.  }\n    \\label{tab:kick_success}\n  \\end{center}\n\\end{table}\n\nCurrently, the decision to attempt a two-point conversion depends mainly on the score differential and the time remaining in the game, two supposedly irrelevant factors as per a rational economic model \\cite{thaler2015misbehaving}.  \nFor instance, when a team scores a touchdown which gives them the lead by one point, it is typical to try for the two point conversion that will potentially give a 3 point lead instead of a 2, hence, putting the pressure on the opposing team to score a touchdown to win the game.  \nWhen the touchdown provides a two point lead then things are more complicated and typically teams will attempt the extra point kick.  \nWhat our analysis suggests is that these factors should not impact the decision to attempt a two point conversion, since the expected point benefit is larger regardless of these factors.  \nIn fact, if a team includes in its playbook the conversion, the success rate ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ is also expected to get higher - at least during a transient period - and thus, an even greater benefit is expected.  \nOf course at some point the opposing defenses will also adopt and hence, ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ will converge to a steady value.    \nHowever, we believe that teams will continue to be conservative, mainly due to the fact that in order for the expected outcome to converge to what is predicted by Equation (\\ref{eq:2pts}) a very large number of attempts need to made.  \nAnd while throughout a season this is true, it is not true within a single game where a very small number of attempts will be made by each team (on average 2.5 touchdowns per team per game).  \nNevertheless, our analysis clearly serves as a convincing evidence that coaching decisions are not always rational.  \nIn fact even teams that have started adopting their game plan - mainly due to the PAT rule changes - are still overly conservative.  \nFor instance, the Pittsburgh Steelers during the 2015 season attempted for multiple two-point conversion in ``unconventional'' times of the game (e.g., during the first quarter, etc.).  \nHowever, they only attempted 11 conversion (converting 8 of them) out of the 45 touchdowns they scored, which is an overall rate of just about 25\\%. \n\n\n\\subsubsection{Fourth Down Decisions}\n\\label{sec:4thdown}\n\nAnother decision that coaches have to take - more often than the PAT - is what to do in the fourth down situations.  \nIn American football the teams have 4 tries to advance 10 yards on the field.  \nIf they fail to do so the opponent takes the ball at the yard line that the team was stopped.  \nThe teams have to make a choice after the first 3 tries on whether to go for their fourth try and keep their drive alive or whether to punt the ball and push the ensuing drive of the opposing team further from their own goal line.  \nDepending on the distance to the goal they might also have the possibility to try for a field goal for 3 points.  \n\nIn the vast majority of the cases that coaches face this decision, they decide to either punt or kick a field goal.  \nExceptions of course appear in specific situations, e.g., when a team is trailing by more than 3 points and the clock is running down.  \nUsing mean field approximations we will calculate the net benefit from ``going for it'' on fourth down.  \nIn order to estimate the expected benefit we need to compute from our data the following quantities: (i) the conversion rate of a fourth down conversion (as a function of both the field position and the yards to cover for a first down), (ii) the success rate of a field goal (as a function of the distance from the goal) and (iii) the probability of success for a drive (field goal or touchdown) as a function of the starting field position of the drive.  \nThe latter is needed in order to calculate the (average) impact that a failed fourth down conversion will have on the ensuing drive of the opposing team.  \n\n{\\bf Fourth down conversion rate: }\nWe begin by examining the success rate of the fourth down conversion attempts.  \nOverall, the fourth down conversion rate is a stunning 77.9\\%! \nFurthermore, we examine whether this conversion rate is affected by factors such as the position of the offense on the field and the yards remaining for a first down.  \nFigure \\ref{fig:4th-down-fp} shows the success rate as a function of the field position of the offense. \nAs we can see the rate is fairly constant for a long range of field positions.  \nIn particular, once a team has passed its own 35-yard line it seems that the fourth-down conversion rate is constant.  \nIt also appears that closer to its own goal line a team has lower conversion rate (always greater than 50\\% though).  \nHowever, this might be attributed to the fact that there is an underlying sampling bias in the data in these situations.  \nTeams, under normal circumstances (e.g., first quarter drive) do not attempt a fourth down conversion when they are in their own territory, since a failed attempt will give the opponent a very good field position (in fact one that is already in field-goal range).  \nThe only scenario when a team will attempt a fourth down conversion with this field position (i.e., in their own territory) is a situation where the clock is running down and the team is trailing.  \nHowever, in these cases there is already a lot of time and psychological pressure that the conversion rate is getting a hit.  \nIn fact, out of the 1,870 fourth down conversion attempts in our dataset, only 202 (i.e., approximately 10\\%) occurred while the team was between the 1 and 35-yard lines in its own territory.  \nFor the same range in the opponent's territory this number was 931 or approximately 49\\% of all the attempts.  \nHence, even though there appears to be an impact of the field position on the success rate, we believe that this is more an artifact of the current tactics of the NFL coaching, which leads to sampling bias in our dataset.  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/4th-down-fp.pdf}\n\\caption{The field position of the offense does not seem to impact the outcome of a fourth down conversion, especially beyond the 35-yard line of the offense's territory.}\n\\label{fig:4th-down-fp}\n\\end{center}\n\\end{figure}\n\nWe further examine the fourth down conversion rate as a function of the yards needed to be covered to get a first down.  \nOne expects that shorter yardage has a higher success rate as compared to longer yardage.  \nFigure \\ref{fig:4th-down-yardage} depicts our results.  \nIn fact, there is a declining trend, that is, the more yards the offense has to cover in the fourth down, the lower the chances of a successful conversion.  \nAn interesting observation is the fact that 55\\% of the fourth down attempts in our dataset are in fourth down and one situations, i.e., the offense has to cover only one yard.  \nHence, the overall fourth down conversion rate is skewed, since the maximum conversion rate is observed in these situations and is equal to 89\\%.  \nFurthermore, the vast majority of the attempts (95\\% of them) require at most 10 yards to reach the first down mark.  \nAdjusting for this, we obtain the average of the fourth down conversion rate as 73\\%.\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/4thdownVSyards}\n\\caption{The fourth down conversion rate reduces with an increase of the yardage left for the first down.  More than 50\\% of the cases that teams go for it on fourth down is for 1 yard.  This skews the overall fourth down conversion rate, since covering more yardage is in general harder as compared to covering 1 yard.  Given that 95\\% of the attempts require at most 10 yards to be covered, the adjusted fourth down conversion rate is 73\\%.}\n\\label{fig:4th-down-yardage}\n\\end{center}\n\\end{figure}\n\n{\\bf Field Goal Success Rate: }\nWhen teams face a fourth down decision in their opponent's territory they can decide to settle for a field goal, which will provide them with 3 points if successful.    \nIn order to calculate the expected payoff from a field goal attempt we calculate the success rate of the kick as a function of the distance from the goal.  \nFigure \\ref{fig:fg-dist} depicts our results.  \nAs we can see there is a slowly declining field goal success rate, which exhibits a steeper decline after the 50 yards.  \nHowever, only 11\\% of the field goal attempts in our dataset had a distance larger than 50 yards. \nThese typically correspond to efforts to tie or win a game when the clock is running down; under regular circumstances teams would most probably have punted the ball.  \nOverall, the success rate of a field goal (not controlling for the distance from the goal) is 85.5\\%.\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.26]{figures/fg_distance}\n\\caption{The overall success rate of a field goal attempt is 85\\%.  The success rate declines with the distance from the goal and exhibits a sharp decline beyond a distance of 50 yards.  This sharp decline might be simply an artifact of the fewer data points in this regime (only 11\\% of the field goal attempts were beyond a 50 yard distance).}\n\\label{fig:fg-dist}\n\\end{center}\n\\end{figure}\n\n{\\bf Success of a Drive and Starting Field Position: }\nTurning the ball on downs (i.e., failing a fourth down conversion) does not only impact the current drive of the offense by terminating it with 0 points, but it might also give the opponent a very good starting field position.  \nAfter a touchdown or a field goal the team that scored, kicks the ball from their own 35 yard line.  \nThe opponent has a dedicated player (called kick returner) who receives the ball and tries to advance it on the field.  \nTypically, most of the kicking teams attempt to kick the ball beyond the opponent's goal line, which will not give the opportunity to the kick returner to advance the ball.  \nIn this case the next drive starts from the offense's 20 yard line (i.e., the offense has to cover 80 yards to score a touchdown).  \n\nThe starting position of a team can potentially impact the success of the drive.  \nIf the kick returner is able to advance the ball well beyond his own 20 yard line (e.g., at the opponent's territory) then the offense has a short field to work with and increased chances of scoring.  \nThe same is true if the team gets the ball well beyond their own 20 yard line due to a turn on downs from the opponent.  \nHence, in order to calculate the potential loss from a failed fourth down conversion we need to estimate how a turn on downs will impact the success of the ensuing drive from the opposing team.  \nFigure \\ref{fig:drive-fp} presents the fraction of drives that resulted in a field goal, touchdown or failed (i.e., ended with a turnover or a punt) as a function of the starting position captured by the distance that needs to be covered to score a touchdown.  \nAs we can see when the distance that the offense has to cover at the beginning of the drive is less that 25 yards the probability of scoring a touchdown is rapidly increasing, while the probability of not scoring at all reduces rapidly as well. \nHowever, both of them are much smaller compared to the probability of a failed drive (for a distance greater than 50 yards).  \n \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/drive-fp}\n\\caption{A drive that starts in the opponents territory has significantly increased probability of leading to a scoring play (touchdown or field goal).  On the contrary, turning the ball on downs at the opponents territory (between the yard lines 50 and 20) increases the probability of the ensuing drive to lead to a score by only 7\\% on average as compared to the baseline case of a drive starting after a touchback. }\n\\label{fig:drive-fp}\n\\end{center}\n\\end{figure}\n\nClearly the starting field position can impact the success of the drive especially when this drive starts at the opponents territory.  \nThis might be the reason that an offense rarely (under regular game situations) goes for fourth down when they are in their own territory; a failed conversion increases dramatically the chances for a scoring ensuing drive from the opponent.  \nHowever, when the offense has entered the opponents territory (i.e., beyond the 50 yards in the figure) failing to convert on a fourth down increases the chances of a scoring ensuing drive by only 7\\% on average as compared to the baseline case of a touchback.  \n\n\nWe will make use of these results and curves in what follows to estimate the mean field approximation of the net gain for going for it on a fourth down situation.  \nA negative net gain will provide supporting evidence for the {\\tt rational coaching} hypothesis, while a positive one will provide further evidence against it.  \n\n\\vspace{0.2in}\n{\\bf Mean Field Net Point Benefit}\n\nFor the mean field approximation of the net point gain $\\mathbf{E}[P]$ we need to calculate the expected point benefit $\\mathbf{E}[P^+]$ from a successful fourth down conversion as well as the expected point cost $\\mathbf{E}[P^-]$ from a potential failed conversion.  \nThe expected benefit $\\mathbf{E}[P^+]$ is a function of the fourth down conversion rate ${\\ensuremath{{s}}}_{{\\tt 4conv}}$ as well as the field position ${\\ensuremath{l}}$, i.e.,  $\\mathbf{E}[P^+] = f_1({\\ensuremath{{s}}}_{{\\tt 4conv}}, {\\ensuremath{l}})$.  \nOn the contrary, the expected point cost $\\mathbf{E}[P^-]$ is a function of the success rate of a field goal ${\\ensuremath{{s}}}_{{\\tt fg}}$, which itself is a function of the field position ${\\ensuremath{l}}$, and the increase in the probability $\\Delta \\pi_{{\\tt td}}$ and $\\Delta \\pi_{{\\tt fg}}$ of the ensuing opponent's drive leading to a touchdown or field goal score respectively, which itself depends on the field position ${\\ensuremath{l}}$ as well, i.e., $\\mathbf{E}[P^-] = f_2({\\ensuremath{{s}}}_{{\\tt fg}},\\Delta \\pi_{{\\ensuremath{{s}}}},{\\ensuremath{l}})$.  \nIn particular, \n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nThe coefficient vector ${\\ensuremath{{\\bm a}}}$ includes the weights for each independent variable of the input vector $\\mathbf{x}$, and is estimated using the corresponding data.  \nThe value of coefficient ${\\ensuremath{{a}}}_i$ quantifies the impact that feature $x_i$ has on the probability of win, while the corresponding $p$-value quantifies its statistical significance.  \nIn our study, a contesting team is associated with the binary dependent variable ${\\ensuremath{W}}$ that represents whether the team wins (i.e., ${\\ensuremath{W}}=1$) or loses (i.e., ${\\ensuremath{W}}=0$).  \n\n{\\bf Statistical Bootstrap: }\nIn order to perform a game outcome prediction, we first need to forecast the performance of each of the contesting teams.  \nHowever, we only have a small set of historic performance data for each team.  \nTo overcome this problem we will rely on statistical bootstrap.  \nStatistical bootstrap \\cite{efron93} is a robust method for estimating the unknown distribution of a population's statistic when a sample of the population is known.\nThe basic idea of the bootstrapping method is that in the absence of any other information about the population, the observed sample contains all the available information about the underlying distribution.\nHence resampling with replacement is the best guide to what can be expected from the population distribution had the latter been available.\nBy generating a large number of such resamples allows us to get a very accurate estimate of the required distribution.\nFurthermore, for data with dependencies (temporal or otherwise), appropriate block resampling retains any dependencies between data points \\cite{kunsch89}.\nWe will utilize bootstrap in our prediction engine.\n\n\n\\section{Results}\n\\label{sec:results}\n\nIn this section we will present our results.  \nWe will start by examining the {\\tt rational coaching} hypothesis and then we will move on to present our logistic regression model.  \n\n\\subsection{The {\\tt rational coaching} hypothesis}\n\\label{sec:rational_coaching}\n\nOur running hypothesis is: \n\n\\begin{hyp} \n\\label{hyp:h1}{\\tt [Rational Coaching]:}\nCoaching decisions are always rational in terms of maximizing the number of points scored.  \n\\end{hyp}\n\nTo reiterate, in order to study the above hypothesis we will analyze the decisions taken for the PAT and a fourth down situation.  \n\n\n\n\\subsubsection{Points After Touchdown}\n\\label{sec:pat}\n\n\n\nOnce a team scores a touchdown (worth 6 points) they have the option to either kick an extra point field goal from the 15-yard line (i.e., a 33-yard field goal) or make a regular play from the 2-yard line for 2 points (known as two-point conversion).  \nIt is clear that this is a strategic decision that teams have to make.  \nIn some cases the decision is easy (i.e., the team is trailing by 2 points with the clock running out) but in most of the touchdowns the decision is not so clear since special circumstances do not exist. \nIn fact, one would expect that such extraordinary situations appear only for the touchdowns towards the end of the game.  \nSo what about the rest of the touchdowns? \n\nAnalyzing our data we find that the dominant decision is to settle for the extra point after a touchdown instead of trying to score more points and attempting a two-point conversion.  \n\nIn particular, from the 9,021 touchdowns during the 7 regular seasons that our data span, only 460 of them were followed by a two-point conversion attempt.  \nFrom these, 235 were successful, that is, an overall 51\\% success rate.  \nOn the other hand, from the 8,561 extra point kick attempts, 8,425 were successful, which translates to a 98.4\\% success rate.   \nIf the decision criteria was the success rate, then the extra point kick is clearly the optimal choice! \nHowever, a game is won by points and not success rates and therefore, the coaching objective of a rational team should be to maximize the (expected) number of points scored \\cite{RePEc:ucp:jpolec:v:114:y:2006:i:2:p:340-365}.  \nWith ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ and ${\\ensuremath{{s}}}_{{\\tt kick}}$ being the success rates for the two-point conversions and extra point kicks respectively, the expected point differential benefit per touchdown $\\mathbf{E}[p]$ of a two-point conversion over an extra point kick is given by: \n\n\n", "index": 3, "text": "\\begin{equation}\n\\mathbf{E}[p] = 2\\cdot {\\ensuremath{{s}}}_{{\\tt 2pts}} - 1\\cdot {\\ensuremath{{s}}}_{{\\tt kick}}\n\\label{eq:2pts}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{E}[p]=2\\cdot{{s}}_{{\\tt 2pts}}-1\\cdot{{s}}_{{\\tt kick}}\" display=\"block\"><mrow><mrow><mi>𝐄</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>p</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mrow><mn>2</mn><mo>⋅</mo><msub><mi>s</mi><mrow><mn>𝟸</mn><mo>⁢</mo><mi>𝚙</mi><mo>⁢</mo><mi>𝚝</mi><mo>⁢</mo><mi>𝚜</mi></mrow></msub></mrow><mo>-</mo><mrow><mn>1</mn><mo>⋅</mo><msub><mi>s</mi><mi>𝚔𝚒𝚌𝚔</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04302.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 35568, "prevtext": " \n\nWith the extra point kick, the probability of success is 0.984 and thus, the expected number of points is 0.984.  \nOn the contrary, with the two-point conversion the success rate is only 0.51 but the expected number of points is 1.02, which ultimately gives a positive expected point differential benefit (i.e., $\\mathbf{E}[p] > 0$).  \n\nOf course, the net gain per touchdown is fairly small and not all the teams have the same success rate in the two-point conversions and the extra point kick attempts.  \n\n\n\n\n\n\nHence, not all teams would necessarily benefit from this strategy.  \nFigure \\ref{fig:2pts} presents the expected benefit $\\mathbf{E}[p]$ per team using the corresponding success rates from our 7-year dataset.  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.26]{figures/2pts}\n\\caption{Different teams have different expected point gains based on the corresponding success rates ${\\ensuremath{{s}}}_{{\\tt2pts}}$ and ${\\ensuremath{{s}}}_{{\\tt kick}}$.  On the top of each bar we also present the number of times that the corresponding team attempted a two-point conversion in our dataset.  Pittsburgh Steelers and Chicago Bears appear to have to gain the most from switching to two-point conversions.  In fact, half of the Steeler's two-point conversion attempts in the dataset happened during the 2015 regular season.  The largest expected gain is observed for San Diego.  However, the Chargers have only tried the two-point conversion 6 times and it might be hard to consider the corresponding success rate statistically representative and robust.}\n\\label{fig:2pts}\n\\end{center}\n\\end{figure}\n\n\nNevertheless, practicing two-point conversion plays can be beneficial in the long term.  \nIncreasing slightly the success rates can turn to non-negligible point gains.  \nIn fact, the new rules for the extra point kicks introduced at the beginning of the 2015 season have led to a statistically significant reduction in ${\\ensuremath{{s}}}_{{\\tt kick}}$.  \nIn particular, the extra kick is snapped from the 15-yard line (as alluded to above) instead of the 2-yard line that used to be all the previous years.  \nTable \\ref{tab:kick_success} depicts the success rates for the extra point kicks over the years that our dataset spans.  \nAs we can observe there is a significant drop of approximately 5\\% ($p$-value $< 10^{-6}$) in the success rate during the 2015 season! \nOn the contrary, there was no impact on the success rate of the two-point conversion attempts (as one might have expected).  \nThe success rate for 2015 was 1.6\\% higher than the yearly average success rate between 2009-2014. \nHowever this difference is not statistically significant ($p$-value = 0.4).   \nTherefore, it appears as a good potential strategy for the teams to start practicing and attempting two-point conversions.  \n\n\\begin{table}[h]\n\\scriptsize\n  \\begin{center}\n    \\begin{tabular}{l|c|c}\n    \\toprule\n\t\t\t\\bf Year & \\bf ${\\ensuremath{{s}}}_{{\\tt kick}}$ & \\bf ${\\ensuremath{{s}}}_{{\\tt 2pt}}$ \\\\\n      \\midrule\n\n2009 & 0.9814 & 0.4426\\\\\n2010 & 0.9884 & 0.5471\\\\\n2011 & 0.9942 & 0.5 \\\\\n2012 & 0.9935 & 0.55\\\\\n2013 & 0.9960 & 0.4929\\\\\n2014 & 0.9926  & 0.5161\\\\\n2015 & {\\bf 0.9416} & 0.5247\\\\\n\\bottomrule\n    \\end{tabular}\n    \\vspace{0.2cm}\n       \\caption{The new PAT rules introduced in 2015 have led to significant drop of the success rate of the extra point kick by approximately 5\\% ($p$-value $< 0.001$). On the contrary, there is no impact (as expected) on the two-point conversion success rate.  }\n    \\label{tab:kick_success}\n  \\end{center}\n\\end{table}\n\nCurrently, the decision to attempt a two-point conversion depends mainly on the score differential and the time remaining in the game, two supposedly irrelevant factors as per a rational economic model \\cite{thaler2015misbehaving}.  \nFor instance, when a team scores a touchdown which gives them the lead by one point, it is typical to try for the two point conversion that will potentially give a 3 point lead instead of a 2, hence, putting the pressure on the opposing team to score a touchdown to win the game.  \nWhen the touchdown provides a two point lead then things are more complicated and typically teams will attempt the extra point kick.  \nWhat our analysis suggests is that these factors should not impact the decision to attempt a two point conversion, since the expected point benefit is larger regardless of these factors.  \nIn fact, if a team includes in its playbook the conversion, the success rate ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ is also expected to get higher - at least during a transient period - and thus, an even greater benefit is expected.  \nOf course at some point the opposing defenses will also adopt and hence, ${\\ensuremath{{s}}}_{{\\tt 2pts}}$ will converge to a steady value.    \nHowever, we believe that teams will continue to be conservative, mainly due to the fact that in order for the expected outcome to converge to what is predicted by Equation (\\ref{eq:2pts}) a very large number of attempts need to made.  \nAnd while throughout a season this is true, it is not true within a single game where a very small number of attempts will be made by each team (on average 2.5 touchdowns per team per game).  \nNevertheless, our analysis clearly serves as a convincing evidence that coaching decisions are not always rational.  \nIn fact even teams that have started adopting their game plan - mainly due to the PAT rule changes - are still overly conservative.  \nFor instance, the Pittsburgh Steelers during the 2015 season attempted for multiple two-point conversion in ``unconventional'' times of the game (e.g., during the first quarter, etc.).  \nHowever, they only attempted 11 conversion (converting 8 of them) out of the 45 touchdowns they scored, which is an overall rate of just about 25\\%. \n\n\n\\subsubsection{Fourth Down Decisions}\n\\label{sec:4thdown}\n\nAnother decision that coaches have to take - more often than the PAT - is what to do in the fourth down situations.  \nIn American football the teams have 4 tries to advance 10 yards on the field.  \nIf they fail to do so the opponent takes the ball at the yard line that the team was stopped.  \nThe teams have to make a choice after the first 3 tries on whether to go for their fourth try and keep their drive alive or whether to punt the ball and push the ensuing drive of the opposing team further from their own goal line.  \nDepending on the distance to the goal they might also have the possibility to try for a field goal for 3 points.  \n\nIn the vast majority of the cases that coaches face this decision, they decide to either punt or kick a field goal.  \nExceptions of course appear in specific situations, e.g., when a team is trailing by more than 3 points and the clock is running down.  \nUsing mean field approximations we will calculate the net benefit from ``going for it'' on fourth down.  \nIn order to estimate the expected benefit we need to compute from our data the following quantities: (i) the conversion rate of a fourth down conversion (as a function of both the field position and the yards to cover for a first down), (ii) the success rate of a field goal (as a function of the distance from the goal) and (iii) the probability of success for a drive (field goal or touchdown) as a function of the starting field position of the drive.  \nThe latter is needed in order to calculate the (average) impact that a failed fourth down conversion will have on the ensuing drive of the opposing team.  \n\n{\\bf Fourth down conversion rate: }\nWe begin by examining the success rate of the fourth down conversion attempts.  \nOverall, the fourth down conversion rate is a stunning 77.9\\%! \nFurthermore, we examine whether this conversion rate is affected by factors such as the position of the offense on the field and the yards remaining for a first down.  \nFigure \\ref{fig:4th-down-fp} shows the success rate as a function of the field position of the offense. \nAs we can see the rate is fairly constant for a long range of field positions.  \nIn particular, once a team has passed its own 35-yard line it seems that the fourth-down conversion rate is constant.  \nIt also appears that closer to its own goal line a team has lower conversion rate (always greater than 50\\% though).  \nHowever, this might be attributed to the fact that there is an underlying sampling bias in the data in these situations.  \nTeams, under normal circumstances (e.g., first quarter drive) do not attempt a fourth down conversion when they are in their own territory, since a failed attempt will give the opponent a very good field position (in fact one that is already in field-goal range).  \nThe only scenario when a team will attempt a fourth down conversion with this field position (i.e., in their own territory) is a situation where the clock is running down and the team is trailing.  \nHowever, in these cases there is already a lot of time and psychological pressure that the conversion rate is getting a hit.  \nIn fact, out of the 1,870 fourth down conversion attempts in our dataset, only 202 (i.e., approximately 10\\%) occurred while the team was between the 1 and 35-yard lines in its own territory.  \nFor the same range in the opponent's territory this number was 931 or approximately 49\\% of all the attempts.  \nHence, even though there appears to be an impact of the field position on the success rate, we believe that this is more an artifact of the current tactics of the NFL coaching, which leads to sampling bias in our dataset.  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/4th-down-fp.pdf}\n\\caption{The field position of the offense does not seem to impact the outcome of a fourth down conversion, especially beyond the 35-yard line of the offense's territory.}\n\\label{fig:4th-down-fp}\n\\end{center}\n\\end{figure}\n\nWe further examine the fourth down conversion rate as a function of the yards needed to be covered to get a first down.  \nOne expects that shorter yardage has a higher success rate as compared to longer yardage.  \nFigure \\ref{fig:4th-down-yardage} depicts our results.  \nIn fact, there is a declining trend, that is, the more yards the offense has to cover in the fourth down, the lower the chances of a successful conversion.  \nAn interesting observation is the fact that 55\\% of the fourth down attempts in our dataset are in fourth down and one situations, i.e., the offense has to cover only one yard.  \nHence, the overall fourth down conversion rate is skewed, since the maximum conversion rate is observed in these situations and is equal to 89\\%.  \nFurthermore, the vast majority of the attempts (95\\% of them) require at most 10 yards to reach the first down mark.  \nAdjusting for this, we obtain the average of the fourth down conversion rate as 73\\%.\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/4thdownVSyards}\n\\caption{The fourth down conversion rate reduces with an increase of the yardage left for the first down.  More than 50\\% of the cases that teams go for it on fourth down is for 1 yard.  This skews the overall fourth down conversion rate, since covering more yardage is in general harder as compared to covering 1 yard.  Given that 95\\% of the attempts require at most 10 yards to be covered, the adjusted fourth down conversion rate is 73\\%.}\n\\label{fig:4th-down-yardage}\n\\end{center}\n\\end{figure}\n\n{\\bf Field Goal Success Rate: }\nWhen teams face a fourth down decision in their opponent's territory they can decide to settle for a field goal, which will provide them with 3 points if successful.    \nIn order to calculate the expected payoff from a field goal attempt we calculate the success rate of the kick as a function of the distance from the goal.  \nFigure \\ref{fig:fg-dist} depicts our results.  \nAs we can see there is a slowly declining field goal success rate, which exhibits a steeper decline after the 50 yards.  \nHowever, only 11\\% of the field goal attempts in our dataset had a distance larger than 50 yards. \nThese typically correspond to efforts to tie or win a game when the clock is running down; under regular circumstances teams would most probably have punted the ball.  \nOverall, the success rate of a field goal (not controlling for the distance from the goal) is 85.5\\%.\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.26]{figures/fg_distance}\n\\caption{The overall success rate of a field goal attempt is 85\\%.  The success rate declines with the distance from the goal and exhibits a sharp decline beyond a distance of 50 yards.  This sharp decline might be simply an artifact of the fewer data points in this regime (only 11\\% of the field goal attempts were beyond a 50 yard distance).}\n\\label{fig:fg-dist}\n\\end{center}\n\\end{figure}\n\n{\\bf Success of a Drive and Starting Field Position: }\nTurning the ball on downs (i.e., failing a fourth down conversion) does not only impact the current drive of the offense by terminating it with 0 points, but it might also give the opponent a very good starting field position.  \nAfter a touchdown or a field goal the team that scored, kicks the ball from their own 35 yard line.  \nThe opponent has a dedicated player (called kick returner) who receives the ball and tries to advance it on the field.  \nTypically, most of the kicking teams attempt to kick the ball beyond the opponent's goal line, which will not give the opportunity to the kick returner to advance the ball.  \nIn this case the next drive starts from the offense's 20 yard line (i.e., the offense has to cover 80 yards to score a touchdown).  \n\nThe starting position of a team can potentially impact the success of the drive.  \nIf the kick returner is able to advance the ball well beyond his own 20 yard line (e.g., at the opponent's territory) then the offense has a short field to work with and increased chances of scoring.  \nThe same is true if the team gets the ball well beyond their own 20 yard line due to a turn on downs from the opponent.  \nHence, in order to calculate the potential loss from a failed fourth down conversion we need to estimate how a turn on downs will impact the success of the ensuing drive from the opposing team.  \nFigure \\ref{fig:drive-fp} presents the fraction of drives that resulted in a field goal, touchdown or failed (i.e., ended with a turnover or a punt) as a function of the starting position captured by the distance that needs to be covered to score a touchdown.  \nAs we can see when the distance that the offense has to cover at the beginning of the drive is less that 25 yards the probability of scoring a touchdown is rapidly increasing, while the probability of not scoring at all reduces rapidly as well. \nHowever, both of them are much smaller compared to the probability of a failed drive (for a distance greater than 50 yards).  \n \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/drive-fp}\n\\caption{A drive that starts in the opponents territory has significantly increased probability of leading to a scoring play (touchdown or field goal).  On the contrary, turning the ball on downs at the opponents territory (between the yard lines 50 and 20) increases the probability of the ensuing drive to lead to a score by only 7\\% on average as compared to the baseline case of a drive starting after a touchback. }\n\\label{fig:drive-fp}\n\\end{center}\n\\end{figure}\n\nClearly the starting field position can impact the success of the drive especially when this drive starts at the opponents territory.  \nThis might be the reason that an offense rarely (under regular game situations) goes for fourth down when they are in their own territory; a failed conversion increases dramatically the chances for a scoring ensuing drive from the opponent.  \nHowever, when the offense has entered the opponents territory (i.e., beyond the 50 yards in the figure) failing to convert on a fourth down increases the chances of a scoring ensuing drive by only 7\\% on average as compared to the baseline case of a touchback.  \n\n\nWe will make use of these results and curves in what follows to estimate the mean field approximation of the net gain for going for it on a fourth down situation.  \nA negative net gain will provide supporting evidence for the {\\tt rational coaching} hypothesis, while a positive one will provide further evidence against it.  \n\n\\vspace{0.2in}\n{\\bf Mean Field Net Point Benefit}\n\nFor the mean field approximation of the net point gain $\\mathbf{E}[P]$ we need to calculate the expected point benefit $\\mathbf{E}[P^+]$ from a successful fourth down conversion as well as the expected point cost $\\mathbf{E}[P^-]$ from a potential failed conversion.  \nThe expected benefit $\\mathbf{E}[P^+]$ is a function of the fourth down conversion rate ${\\ensuremath{{s}}}_{{\\tt 4conv}}$ as well as the field position ${\\ensuremath{l}}$, i.e.,  $\\mathbf{E}[P^+] = f_1({\\ensuremath{{s}}}_{{\\tt 4conv}}, {\\ensuremath{l}})$.  \nOn the contrary, the expected point cost $\\mathbf{E}[P^-]$ is a function of the success rate of a field goal ${\\ensuremath{{s}}}_{{\\tt fg}}$, which itself is a function of the field position ${\\ensuremath{l}}$, and the increase in the probability $\\Delta \\pi_{{\\tt td}}$ and $\\Delta \\pi_{{\\tt fg}}$ of the ensuing opponent's drive leading to a touchdown or field goal score respectively, which itself depends on the field position ${\\ensuremath{l}}$ as well, i.e., $\\mathbf{E}[P^-] = f_2({\\ensuremath{{s}}}_{{\\tt fg}},\\Delta \\pi_{{\\ensuremath{{s}}}},{\\ensuremath{l}})$.  \nIn particular, \n\n\n", "index": 5, "text": "\\begin{equation}\n\\mathbf{E}[P^+]= 6 \\cdot {\\ensuremath{{s}}}_{{\\tt 4conv}}^{\\gamma({\\ensuremath{l}})} \n\\label{eq:mfa1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{E}[P^{+}]=6\\cdot{{s}}_{{\\tt 4conv}}^{\\gamma({l})}\" display=\"block\"><mrow><mrow><mi>𝐄</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>P</mi><mo>+</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mn>6</mn><mo>⋅</mo><msubsup><mi>s</mi><mrow><mn>𝟺</mn><mo>⁢</mo><mi>𝚌</mi><mo>⁢</mo><mi>𝚘</mi><mo>⁢</mo><mi>𝚗</mi><mo>⁢</mo><mi>𝚟</mi></mrow><mrow><mi>γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04302.tex", "nexttext": "\nwhere $\\gamma({\\ensuremath{l}})$ is the number of times that the offense will need to convert a fourth down to reach the goal line.  \nClearly the further from the goal line (i.e., small ${\\ensuremath{l}}$) the larger the expected value of $\\gamma({\\ensuremath{l}})$.  \nIn order to have a realistic estimate for $\\gamma({\\ensuremath{l}})$ we analyzed all the approximately 43,000 drives from all the games in our dataset.  \nThe average drive length is 29 yards.  \nThis means that, on average in order to keep the drive alive, the team will need to convert on fourth down once every 29 yards.  \nTherefore, if a team starts at its own 20-yard, this means that they will have to successfully convert on average 2.7 times before reaching the goal line.  \nIn general, with ${\\ensuremath{l}}$ being the starting field position of a team (i.e., the yards to cover are $100-{\\ensuremath{l}}$) we have $\\gamma({\\ensuremath{l}}) = \\dfrac{100-{\\ensuremath{l}}}{29}$.  \n\nUsing the results from Figures \\ref{fig:4th-down-fp}, \\ref{fig:fg-dist} and \\ref{fig:drive-fp} we obtain Figure \\ref{fig:point_ben}. \nThis figure depicts the expected point benefit (i.e., $\\mathbf{E}[P] = \\mathbf{E}[P^+] - \\mathbf{E}[P^-]$) that the offense will have as a function of the field position at the first time it faces a fourth down situation.  \nIn particular, the horizontal axis represents the distance to the goal line.  \nAs we can see, $\\mathbf{E}[P]$ is positive for more than 80\\% of the field.  \nIn fact the average point gain is 1.4 points per drive ($p$-value $<$ 0.01), which can translate to significant point gains over the course of a game.  \n  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/expected_point_ben_4thdown}\n\\caption{The expected point benefit is positive for most of the field length.  The benefits become particularly tempting, i.e., $\\mathbf{E}[P] > 2$, when the offense has stepped into the opponent's territory.  Overall, the expected point benefit is 1.4 ($p$-value $<$ 0.01) and the fact that teams typically punt or settle for a field goal on fourth down provides additional evidence for rejecting the {\\tt rational coaching} hypothesis.  }\n\\label{fig:point_ben}\n\\end{center}\n\\end{figure}\n\nIn conclusion, even though there clearly are cases where going for it on fourth down does not provide any benefit - i.e., in the regime where $\\mathbf{E}[P] < 0$ - teams are extremely reluctant on attempting the conversion even though the game data show that there can be significant point benefits.  \nOur analysis with respect to the fourth down decisions (and in particular the results in Figure \\ref{fig:point_ben} from our mean field approximation) further supports the rejection of the {\\tt rational coaching} hypothesis.  \n\n\\subsection{Game Day Models}\n\\label{sec:model}\n\nIn this part of our work we will present our descriptive and predictive models.  \nIn brief, we build a logistic regression model to understand the factors that impact the probability of a team winning an American football game and then we combine it with statistical bootstrap in order to provide predictions for upcoming match-ups.  \n\n\\subsubsection{Descriptive Model}\n\\label{sec:descriptive}\n\nLet us denote with ${\\ensuremath{W}}$ the binary random variable that represents that event of winning a game.  \n${\\ensuremath{W}} = 1$ if the team wins the game and 0 otherwise.  \nAs aforementioned a logistic regression model for ${\\ensuremath{W}}$ will provide us with the probability of the team winning the game given the set of input features, i.e., ${\\ensuremath{y}}=\\Pr({\\ensuremath{W}} = 1 | {\\mathbf{x}})$.  \n\nThe input of this model is vector ${\\mathbf{x}}$ that includes features that can potentially impact the probability of a team winning.  \n\n\\iffalse\n\n", "itemtype": "equation", "pos": 35703, "prevtext": "\n\n\n", "index": 7, "text": "\\begin{equation}\n\\mathbf{E}[P^-]= 3 \\cdot {\\ensuremath{{s}}}_{{\\tt fg}} + (3\\cdot  \\Delta \\pi_{{\\tt fg}}+ 6\\cdot  \\Delta \\pi_{{\\tt td}})\n\\label{eq:mfa2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{E}[P^{-}]=3\\cdot{{s}}_{{\\tt fg}}+(3\\cdot\\Delta\\pi_{{\\tt fg}}+6\\cdot%&#10;\\Delta\\pi_{{\\tt td}})\" display=\"block\"><mrow><mrow><mi>𝐄</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>P</mi><mo>-</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mrow><mn>3</mn><mo>⋅</mo><msub><mi>s</mi><mi>𝚏𝚐</mi></msub></mrow><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mn>3</mn><mo>⋅</mo><mi mathvariant=\"normal\">Δ</mi></mrow><mo>⁢</mo><msub><mi>π</mi><mi>𝚏𝚐</mi></msub></mrow><mo>+</mo><mrow><mrow><mn>6</mn><mo>⋅</mo><mi mathvariant=\"normal\">Δ</mi></mrow><mo>⁢</mo><msub><mi>π</mi><mi>𝚝𝚍</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04302.tex", "nexttext": "\n\\fi\n\n\nThe features we use as the input for our model include: \n\n{\\bf  Total offensive yards: }\nThis feature captures the total yards (rushing and passing) produced by the offense in the game.  \n\n{\\bf Penalty Yards: }\nThis features captures the total yards the team was penalized with.  \n\n{\\bf Turnovers: }\nThis feature captures the total turnovers produced by the team (i.e., how many times the quarterback was intercepted, fumbles recovered by the opposing team and turns on downs).  \n\n{\\bf Interceptions: }\nThis feature represents the total number of interceptions produced by the defense of the team.\n\n{\\bf Possession time: }\nThis feature captures the total ball possession time for the team. \n\n{\\bf Passing-to-Rushing ratio ${\\ensuremath{{r}}}$: }\nThe passing-to-rushing ratio ${\\ensuremath{{r}}}$ corresponds to the fraction of offensive yards gained by passing: \n\n\n", "itemtype": "equation", "pos": 39628, "prevtext": "\nwhere $\\gamma({\\ensuremath{l}})$ is the number of times that the offense will need to convert a fourth down to reach the goal line.  \nClearly the further from the goal line (i.e., small ${\\ensuremath{l}}$) the larger the expected value of $\\gamma({\\ensuremath{l}})$.  \nIn order to have a realistic estimate for $\\gamma({\\ensuremath{l}})$ we analyzed all the approximately 43,000 drives from all the games in our dataset.  \nThe average drive length is 29 yards.  \nThis means that, on average in order to keep the drive alive, the team will need to convert on fourth down once every 29 yards.  \nTherefore, if a team starts at its own 20-yard, this means that they will have to successfully convert on average 2.7 times before reaching the goal line.  \nIn general, with ${\\ensuremath{l}}$ being the starting field position of a team (i.e., the yards to cover are $100-{\\ensuremath{l}}$) we have $\\gamma({\\ensuremath{l}}) = \\dfrac{100-{\\ensuremath{l}}}{29}$.  \n\nUsing the results from Figures \\ref{fig:4th-down-fp}, \\ref{fig:fg-dist} and \\ref{fig:drive-fp} we obtain Figure \\ref{fig:point_ben}. \nThis figure depicts the expected point benefit (i.e., $\\mathbf{E}[P] = \\mathbf{E}[P^+] - \\mathbf{E}[P^-]$) that the offense will have as a function of the field position at the first time it faces a fourth down situation.  \nIn particular, the horizontal axis represents the distance to the goal line.  \nAs we can see, $\\mathbf{E}[P]$ is positive for more than 80\\% of the field.  \nIn fact the average point gain is 1.4 points per drive ($p$-value $<$ 0.01), which can translate to significant point gains over the course of a game.  \n  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.36]{figures/expected_point_ben_4thdown}\n\\caption{The expected point benefit is positive for most of the field length.  The benefits become particularly tempting, i.e., $\\mathbf{E}[P] > 2$, when the offense has stepped into the opponent's territory.  Overall, the expected point benefit is 1.4 ($p$-value $<$ 0.01) and the fact that teams typically punt or settle for a field goal on fourth down provides additional evidence for rejecting the {\\tt rational coaching} hypothesis.  }\n\\label{fig:point_ben}\n\\end{center}\n\\end{figure}\n\nIn conclusion, even though there clearly are cases where going for it on fourth down does not provide any benefit - i.e., in the regime where $\\mathbf{E}[P] < 0$ - teams are extremely reluctant on attempting the conversion even though the game data show that there can be significant point benefits.  \nOur analysis with respect to the fourth down decisions (and in particular the results in Figure \\ref{fig:point_ben} from our mean field approximation) further supports the rejection of the {\\tt rational coaching} hypothesis.  \n\n\\subsection{Game Day Models}\n\\label{sec:model}\n\nIn this part of our work we will present our descriptive and predictive models.  \nIn brief, we build a logistic regression model to understand the factors that impact the probability of a team winning an American football game and then we combine it with statistical bootstrap in order to provide predictions for upcoming match-ups.  \n\n\\subsubsection{Descriptive Model}\n\\label{sec:descriptive}\n\nLet us denote with ${\\ensuremath{W}}$ the binary random variable that represents that event of winning a game.  \n${\\ensuremath{W}} = 1$ if the team wins the game and 0 otherwise.  \nAs aforementioned a logistic regression model for ${\\ensuremath{W}}$ will provide us with the probability of the team winning the game given the set of input features, i.e., ${\\ensuremath{y}}=\\Pr({\\ensuremath{W}} = 1 | {\\mathbf{x}})$.  \n\nThe input of this model is vector ${\\mathbf{x}}$ that includes features that can potentially impact the probability of a team winning.  \n\n\\iffalse\n\n", "index": 9, "text": "\\begin{equation}\n\\Pr({\\ensuremath{W}}=1| {\\mathbf{x}})= \\frac{\\exp({\\ensuremath{{\\bm a}}}^T\\cdot{\\mathbf{x}})}{1+\\exp({\\ensuremath{{\\bm a}}}^T\\cdot{\\mathbf{x}})}\n\\label{eq:logistic}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\Pr({W}=1|{\\mathbf{x}})=\\frac{\\exp({{\\bm{a}}}^{T}\\cdot{\\mathbf{x}})}{1+\\exp({{%&#10;\\bm{a}}}^{T}\\cdot{\\mathbf{x}})}\" display=\"block\"><mrow><mrow><mi>Pr</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>W</mi><mo>=</mo><mn>1</mn></mrow><mo stretchy=\"false\">|</mo><mi>𝐱</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝒂</mi><mi>T</mi></msup><mo>⋅</mo><mi>𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝒂</mi><mi>T</mi></msup><mo>⋅</mo><mi>𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.04302.tex", "nexttext": "\n\nThe goal of this feature is to capture the offense's balance between rushing and passing.  \nA perfectly balanced offense will have ${\\ensuremath{{r}}}=0.5$. \nWe would like to emphasize here that ${\\ensuremath{{r}}}$ refers to the actual yardage produced and not to the passing/rushing attempts.  \n\n\\begin{table}[h]\n\\scriptsize\n  \\begin{center} \n    \\begin{tabular}{l|c}\n    \\toprule\n\t\t\t\\bf Feature & \\bf Average paired difference \\\\\n      \\midrule\n\nTotal Yards & 50.95257 $^{***}$\\\\\nPenalty Yards & -3.09375$^{**}$\\\\\nTurnovers & -1.049665$^{***}$\\\\\nInterceptions & 0.390625$^{***}$ \\\\\nPossession Time (sec) & 214.7573$^{***}$ \\\\\n${\\ensuremath{{r}}}$ &  -0.05496846$^{***}$ \\\\\n\\bottomrule\n    \\end{tabular}\n    \\vspace{0.2cm}\n       \\caption{Paired t-test for the considered features. The difference represents $\\overline{{\\ensuremath{{x}}}_{i,j}^+}-\\overline{{\\ensuremath{{x}}}_{i,j}^-}$. Significance codes:    0 '$^{***}$'   0.01 '$^{**}$'   0.05 '$^{*}$'   0.1 '$.$'   1 ' '.}\n    \\label{tab:test}\n  \\end{center}\n\\end{table}\n\nBefore delving into the details of the descriptive model, we perform some basic analysis that compares the features we include in the model.  \nIn particular, we perform a paired t-test for each feature, where each pair corresponds to a specific game.  \nMore specifically, for each feature ${\\ensuremath{{x}}}_i$, we compare the pairs (${\\ensuremath{{x}}}_{i,j}^+,~{\\ensuremath{{x}}}_{i,j}^-$), where ${\\ensuremath{{x}}}_{i,j}^+$ (${\\ensuremath{{x}}}_{i,j}^-$) is the value of ${\\ensuremath{{x}}}_i$ for the winner (loser) of the j$^{th}$ game in our dataset.  \nTable \\ref{tab:test} depicts the results of the two-sided paired t-tests.    \nAs we can see all of the differences are significantly different than zero (at the significance level of $\\alpha=0.01$).  \nFigure \\ref{fig:ecdf} further presents the empirical cumulative distribution function (ECDF) for the paired differences for all the features.  \nFor example, we can see that in only 20\\% of the games the winning team had more turnovers compared to the losing team.                        \nWe further perform the Kolmogorov-Smirnov test for the ECDFs of the considered features for the winning and losing teams.  \nThe tests reject the null hypothesis at the significance level of $\\alpha=0.01$ for all cases, that is, the distribution of the features is statistically different for the winning and losing teams.\n\n \\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.8]{figures/ecdf}\n\\caption{Empirical cumulative distribution function for the paired differences of each feature.  Based on the Kolmogorov-Smirnov test the features' ECDFs for the winning and losing teams are statistically different (at the significance level $\\alpha=0.01$). } \n\\label{fig:ecdf}\n\\end{center}\n\\end{figure}\n\nOur basic data analysis above indicates that the distribution of the features considered is significantly different for the winning and losing teams.  \nTo further delve into the details, we use our data to train the logistic regression model and we obtain the results presented in Table \\ref{tab:regr}.  \nAs we can see all the coefficients are statistically significant.  \nHowever, the number of total yards produced by the offense as well as the possession time seem to have the weakest correlation with the probability of winning a game.  \nOn the contrary committing turnovers quickly deteriorates the probability of winning the game and the same is true for an unbalanced offense.  \n\n\\begin{table}[h]\n\\scriptsize\n  \\begin{center}\n    \\begin{tabular}{l|c}\n    \\toprule\n\t\t\t\\bf Feature & \\bf Coefficient \\\\\n      \\midrule\n\nTotal Yards & 0.007716$^{***}$\\\\\nPenalty Yards & -0.012323$^{***}$\\\\\nTurnovers & -0.889084$^{***}$\\\\\nInterceptions & 0.654004$^{***}$ \\\\\nPossession Time & 0.002199$^{***}$ \\\\\n${\\ensuremath{{r}}}$ &  -3.142612$^{***}$ \\\\\n\\bottomrule\n    \\end{tabular}\n    \\vspace{0.2cm}\n       \\caption{Coefficients of our logistic regression model for the random variable ${\\ensuremath{W}}$. Significance codes: 0 '$^{***}$'   0.01 '$^{**}$'   0.05 '$^{*}$'   0.1 '$.$'   1 ' '.}\n    \\label{tab:regr}\n  \\end{center}\n\\end{table}\n\nWhile the direction of the effects for these variables are potentially intuitive for the coaching staff of NFL teams, the benefit of our quantifying approach is that it assigns specific magnitude to the importance of each factor.  \nFor example, if we want to increase the probability of winning by 10\\% the team should decrease the turnovers it commits (keeping all else constant) by approximately 20\\% on average.   \nOn the contrary, if the team was working on reducing its penalty yards, the same effect (i.e., increase by 10\\% the probability of winning) would require a reduction in the penalty yardage by approximately 72\\% on average.  \nHence, while all of the factors considered are statistically significant, some of them appear to be much more important and potential parts of the game a team could work on.  \n\nMore importantly though we would like to reflect on how one should interpret and use these results.  \nFor example, one could be tempted to focus on the feature with the coefficient with maximum absolute magnitude, that is, ratio ${\\ensuremath{{r}}}$ and conclude that making ${\\ensuremath{{r}}} = 0$, that is, calling only run plays will increase the probability of win.  \nHowever, this is clearly not true as every person with basic familiarity with American football should know.  \nAt the same time the logistic regression model is not contradicting itself! \nWhat happens is that the model developed - similar to any data driven model - is {\\em valid} only for the range of values that the input variables cover.  \nOutside of this range, the generalized linear trend might still hold or not.  \nFigure \\ref{fig:quant-ratio} depicts the distribution of ratio ${\\ensuremath{{r}}}$ for the winning and losing teams.  \nAs we can see our data cover approximately the range ${\\ensuremath{{r}}}\\in[0.3, 0.98]$ and the trend should only be considered valid within this range (and potentially within a small $\\epsilon$).  \nIt is interesting also to observe that the mass of the distribution for the winning teams is concentrated well above ${\\ensuremath{{r}}} = 0.5$, with the maximum density observed for ${\\ensuremath{{r}}} \\approx 0.64$.  \nWe also present at the same figure a table with the range that our features cover for both winning and losing teams.   \nFurthermore, the logistic regression model captures merely correlations (rather than cause-effect relations). \nGiven that some of the features are also correlated themselves (see Figure \\ref{fig:corr}) and/or are result of situational football makes it even harder to identify real causes.  \nFor instance, there appears to be a small but statistically significant negative correlation between ratio ${\\ensuremath{{r}}}$ and possession time.  \nFurthermore, a typical tactic followed by teams leading in a game towards the end of the fourth quarter is to run the clock out by calling running plays.  \nThis will lead to a reduced ratio ${\\ensuremath{{r}}}$ as compared to the counterfactual ${\\ensuremath{{r}}}$ expected if the team continued its original game-plan and hence, might artificially deflate the actual contribution of ${\\ensuremath{{r}}}$ on the probability of winning.  \nSimilarly, teams that are trailing in the score towards the end of the game will typically call plays involving long passes in order to cover more yardage faster.  \nHowever, these plays are also more risky and will lead to turnovers more often, therefore, inflating the impact of turnovers in the probability of win.  \nNevertheless, this is always a problem when a field experiment cannot be designed and only observational data are available.  \nIn the supplementary material (see \\nameref{si:reverse_causality}), we further examine for potential reverse causality and we do not find strong evidence for it.  \nIn conclusion, our model provides quantifiable, actionable, insights but they need to be carefully interpreted when designing play actions based on it.  \n\n \\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.8]{figures/quantiles-ratio}\n\\caption{Our model is trained within the range of input variable values on the left table.  The figure on the right presents the probability density function for ${\\ensuremath{{r}}}$ for the winning and losing instances respectively. }\n\\label{fig:quant-ratio}\n\\end{center}\n\\end{figure}\n\n \\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.4]{figures/corr}\n\\caption{Correlations between the different features considered.  Insignificant correlations ($p$-value $> 0.05$) are crossed out.}\n\\label{fig:corr}\n\\end{center}\n\\end{figure}\n\n\n\\subsubsection{Predictive Model}\n\\label{sec:predictive}\n\nWe now turn our attention on how we can use the above model in order to predict the outcome of a future game.  \nIn a realistic setting, in order to be able to apply this logistic regression model we will need to provide as an input the team statistics/features.   \nThis is by itself a separate prediction problem, namely, a team performance prediction model.  \nHence, we begin by evaluating the prediction performance of the logistic regression model itself using traditional machine learning evaluation methods.  \nIn particular, we evaluate the accuracy prediction of our model through cross validation.  \nIn this way we do not need to predict the value of the features but we explore the accuracy of the pure logistic regression model.   \nUsing 10-fold cross validation we obtain an accuracy of {\\bf 80.45\\%} $\\pm$ {\\bf 0.9\\%}.  \nTo reiterate this performance is conditional to the input features being known! \nHowever, how can we predict these features, since in a realistic setting we will not know the performance of each team beforehand?  \nSimply put, a prediction system will need to first estimate the two teams statistics/features (i.e., total yards, penalty yards, etc.) and then use the logistic regression model to predict the winning team.  \n\nThe most straightforward way for this task is to use historic game data from the current season and calculate descriptive statistics such as the mean or the median of each feature.  \nThe problem with this approach is that the NFL season is fairly small (compared to other sports) and hence, descriptive statistics such as the mean and the median might not be appropriate.  \nTherefore, we propose to utilize statistical bootstrap in order to resample with replacement ${\\mathcal{B}}$ times the empirical distribution for each one of the features from the observed sample.  \n\nFigure \\ref{fig:system} illustrates the components of our prediction engine.  \n\n \\begin{figure}[h]\n\\begin{center}\n\\includegraphics[scale=0.8]{figures/predict}\n\\caption{The proposed prediction engine consists of 3 modules; a bootstrap module, a logistic regression module and a statistical test module.  }\n\\label{fig:system}\n\\end{center}\n\\end{figure}\n\n\nMore specifically, the first part of the prediction engine obtains three inputs; (i) historical information for games of the current season, (ii) the number of bootstrap samples ${\\mathcal{B}}$ to obtain and (iii) the correlation matrix between the six features considered.  \nIn particular, for every team $T$ we have a matrix $\\mathbf{M}_T$ each row of which represents a game in the current season, while the columns correspond to the six different features.  \nIn the case of ``simple'' bootstrapping we would uniformly at random select for each feature one row (i.e., one of the past performances of the team with respect to this feature) and hence, we would obtain a resampled vector $\\mathbf{x}_T^i$ that represents a potential performance for $T$ given its past.  \nHowever, there are two factors that we need to take into consideration.  \nFirst, more recent games might be more representative of recent adjustments (or roster losses due to injuries) as compared to performances during the first weeks of the season.  \nIn order to control for this, instead of sampling the rows of $\\mathbf{M}_T$ for every feature uniformly at random, we bias the sampling probabilities to favor the last $k$ games of the team.  \nSecond, sampling the features independently can lead to vectors $\\mathbf{x}_T^i$ that do not exhibit the correlations between the features that are present in the actual data.  \nFigure \\ref{fig:corr} represents the correlations between the different pairs of features.  \nFor example, as we can see the total yards and the possession time exhibit a medium to strong level of correlation.  \nThis means that when we sample for the total yards of the i$^{th}$ bootstrap sample, we should not sample the possession time independently, but rather select the possession time from the same game/row of $\\mathbf{M}_T$.  \nThis essentially mimics the block bootstrapping approach \\cite{kunsch89} used for time-series data to keep the dependencies between consecutive time-points.  \nThe rest of the correlations between the features are fairly weak (and some also insignificant) and hence, we proceed as normal with the rest of the features.  \n\nOnce bootstrapping is completed, its output is essentially a set of potential future performances for each team as captured through the feature vectors.  \nSimply put for each of the two competing teams we have bootstrapped vectors $\\mathbf{x}_1^1, \\mathbf{x}_1^2,\\dots,\\mathbf{x}_1^{{\\mathcal{B}}}$ and $\\mathbf{x}_2^1, \\mathbf{x}_2^2,\\dots,\\mathbf{x}_2^{{\\mathcal{B}}}$ respectively.  \nThese vectors form the input in our logistic regression model which provides a set of winning probabilities for each team, i.e., $\\mathcal{P}_i = \\{\\Pr({\\ensuremath{W}}_i=1|\\mathbf{x}_i^1),\\dots,\\Pr({\\ensuremath{W}}_i=1|\\mathbf{x}_i^{{\\mathcal{B}}})\\},~ i \\in \\{1,2\\}$. \nOnce we obtain these probabilities sets, we finally perform a hypothesis test to identify whether the two sets represent probabilities that are statistically different at a predefined significance level $\\alpha$: \n\n\\vspace{-0.15in}\n\\begin{eqnarray}\nH_0: & \\overline{\\mathcal{P}_1} = \\overline{\\mathcal{P}_2} \\label{eq:null}\\\\\nH_1: & \\overline{\\mathcal{P}_1} \\neq \\overline{\\mathcal{P}_2} \\label{eq:alt}\n\\end{eqnarray}\n\nIf the null hypothesis is rejected, then the sign of the difference $\\overline{\\mathcal{P}_1}-\\overline{\\mathcal{P}_2}$ will inform us about the team most probable to win the matchup.  \nWe trained our logistic regression model using the previous 5 seasons and have evaluated our prediction engine with the 10 last weeks of the 2014 and 2015 regular seasons.   \nThe 7 first weeks of each of the evaluation seasons are used to provide the input in the bootstrap mechanism.   \n\nWe further set ${\\mathcal{B}} = 1,000$, $k=5$ and $\\alpha  = 0.05$.  \n\n\n\n\n\nOur predictions are on average better than approximately 60\\% of the expert predictions.  \nThe expert predictions we considered form a very good baseline since they include the forecasts of sports analysts from major networks (ESPN, NFL network, CBS and FOX sports) \\cite{nfl-expert}. \nFigure \\ref{fig:accuracy} presents the performance of our prediction engine for each week, while the overall accuracy is 63.3\\%.  \nAs we can see in both seasons the prediction accuracy in weeks 13-17 is higher as compared to weeks 8-12.  \nThe reason for that is that in weeks 13-17 there is a greater amount of historic performance data for bootstrap to work with.  \n\n\nFinally, this performance is very close to that of the more complicated state-of-the-art prediction systems such as Cortana.  \nCortana exhibited an accuracy of approximately 64.5\\% over the same two seasons \\cite{cortana}. \n\n \\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[scale=0.35]{figures/predict_accuracy.pdf}\n\\caption{The performance of our prediction engine is better during the last part of the season, since bootstrap has more performance information about the teams to work with.}\n\\label{fig:accuracy}\n\\end{center}\n\\end{figure}\n\n\n\\iffalse\n\\subsection{Discussion and Limitations}\n\\label{sec:disc}\n\nIn our evaluation, we focused on the last 5 weeks of the 2015 regular season.  \nThe reason for this is that in Week 13 we have a good amount of historic information from the season in order to provide an accurate prediction.  \nEarlier in the season this information is even more sparse and our system's accuracy is expected to exhibit high variance.  \nWith respect to the performance of our prediction engine we would like to emphasize on the fact that it is very impressive if one considers that we do not account for game-specific information (e.g., injured players, teams resting players during the last week, etc.).  \nEven without considering such information the system performs on average better than 60\\% of the experts, who are taking into consideration these signals.  \nHence, our system in its current form can be considered as providing an {\\em anchoring} probability \\cite{kahneman1973psychology} from which an expert can adjust his/her prediction using game-specific information.  \nFurthermore, there is room for further improving this anchoring probability.  \nIn particular, one of the limitations of our system is that currently it does not incorporate any information for the schedule strength of teams.  \nSimply put, when performing the bootstrap for the future performance of team $T$ we just extrapolate from the older performance of $T$ without considering the strength of the teams that it has played against.  \nFor example, in the 2014 NFL season the winner of NFC South (Carolina Panthers) had a percentage record less than 0.5.  \nThis means that Carolina had faced mainly teams with a losing record and hence, the corresponding team statistics might have been inflated as a result of the bootstrap process described above.  \nHowever, our engine is easily adoptable to account for this.  \nIn particular, let us consider that we want to estimate the performance of team $T_1$ against $T_2$.  \nIn order to account for the strength of $T_2$, we can bias the re-sampling probabilities based on the propensity score \\cite{austin2011introduction} of the set of teams $\\mathcal{T}$ that $T_1$ has faced in the past. \nThe propensity score is mainly used as a quasi-experimental technique, in order to match a treated sample with an untreated observational set based on a set of observable cofounders.  \nIn our setting, the propensity score $\\pi_i$ for $T_i \\in \\mathcal{T}$ will simply provide as with the ``similarity'' of $T_i$ with $T_2$.  \nConsequently, the resampling probability for $T_i$ will be proportional to $\\pi_i$. \n\n\n{\\textbf{\\textsc{\\textcolor{red}{({Talk about the comparative analysis, simulation when you talk about the schedule strenght})}}}}\n\\fi\n\n\\label{sec:discussion}\n\nIn this study we have used data from the last 7 NFL seasons to first examine whether coaches are making rational, informed by data, decisions.  \nOur results indicate that this is not the case after examining two specific play calls that teams face very often in each game, PAT and fourth down.  \nSimilar findings have been reported in the past \\cite{doi:10.1080/00031305.1967.10479847,sackrowitz2000refining,RePEc:ucp:jpolec:v:114:y:2006:i:2:p:340-365} but one might have expected that with the recent ability of teams to collect and analyze much more detailed data for the game their playbooks would have been more data-driven.    \nAfter rejecting the hypothesis of {\\tt rational coaching}, we focus on identifying factors that can impact the probability of winning a game.  \nWe then combine this model with statistical bootstrap in order to predict the outcome of upcoming match ups.  \n\n\n\nWe would like here to emphasize on the fact that our analysis for the {\\tt rational coaching} hypothesis, simply rejects the hypothesis.  \nMore specifically, we do not claim that it is always beneficial to try a two-point conversion.  \nThere are case where an extra point kick is the optimal case.  \nFor instance, if a team is down by 6 points and scores a touchdown to tie the game with 1 second left on the clock, it is obvious that the optimal strategy is to go for an extra point kick since the probability of success (approximately 95\\%) is much higher as compared to converting the two points attempt (a little over 50\\%).  \nThis is exactly what we also explained in Figure \\ref{fig:point_ben} with respect to the fourth down decision.  \nIt is not always beneficial (i.e., $\\mathbf{E}[P] > 0$) to go for it on fourth down but it is beneficial way more often than what coaches decide to go for it; an observation that allows us to reject the {\\tt rational coaching} hypothesis! \n \nOur prediction results indicate that as the season progresses the performance of our system is improved; there is more information about the historic performance of a team that bootstrap can exploit.   \nEarlier in the season this information is more sparse and our system's accuracy is expected to exhibit high variance.  \nWith respect to the performance of our prediction engine we would like to emphasize on the fact that it is very impressive if one considers that we do not account for game-specific information (e.g., injured players, teams resting players during the last week, etc.).  \nEven without considering such information the system performs on average better than the experts, who are taking into consideration these signals, 60\\% of the time.  \nHence, our system in its current form can be considered as providing an {\\em anchoring} probability \\cite{kahneman1973psychology} from which an expert can adjust his/her prediction using game-specific information.\n  \nMoreover, there is room for improving this anchoring probability further.  \nIn particular, one of the limitations of our system is that currently it does not incorporate any information for the schedule strength of teams.  \nSimply put, when performing the bootstrap for the future performance of team $T$ we just extrapolate from the older performance of $T$ without considering the strength of the teams that it has played against.  \nTeams might have put up a lot of offensive yards just because they have played with teams with poor defense. \nFor example, in the 2014 NFL season the winner of NFC South (Carolina Panthers) had a season record less than 0.5.  \nThis means that Carolina had faced mainly teams with a losing record and hence, the corresponding team statistics might have been inflated as a result of the bootstrap process described above.  \nHowever, our engine is easily adoptable to account for this.  \nIn particular, let us consider that we want to estimate the performance of team $T_1$ against $T_2$.  \nIn order to account for the strength of $T_2$, we can bias the re-sampling probabilities based on the propensity score \\cite{austin2011introduction} of the set of teams $\\mathcal{T}$ that $T_1$ has faced in the past. \nThe propensity score is mainly used as a quasi-experimental technique, in order to match a treated sample with an untreated observational set based on a set of observable cofounders.  \nIn our setting, the propensity score $\\pi_i$ for $T_i \\in \\mathcal{T}$ will essentially provide us with a ``similarity'' measure of $T_i$ with $T_2$.  \nConsequently, the resampling probability for $T_i$ will be proportional to $\\pi_i$. \nThis biased resampling will allow us to incorporate/simulate in the prediction engine the potential interactions between the teams of the upcoming match ups.  \nIncluding defense-oriented features in the propensity score matching will allow us to perform a more balanced prediction - i.e., consider both offense and defense - since defensive attributes are currently underrepresented in our prediction logistic regression model.  \nThis can potentially significantly improve the prediction performance of our engine.  \n\n\n\n\n\n\n\\section*{Acknowledgments}\n\n\n\\subsection*{S1 Text}\n\\label{si:reverse_causality}\n\n{\\bf Reverse Causality}\n\nOne of the problems with any model based on observational data is the direction of the effects captured by the model.  \nFor example, in our case two features whose impact might be ambiguous are the ratio ${\\ensuremath{{r}}}$ and the turnovers.  \nIn particular, teams that are ahead in score towards the end of the game follow a ``conservative'' play call, running the football more, and hence, decreasing ratio ${\\ensuremath{{r}}}$.  \nTherefore, the negative coefficient for ${\\ensuremath{{r}}}$ in the logistic regression model might be capturing what is called reverse causality/causation. \nWinning teams artificially decrease ${\\ensuremath{{r}}}$ due to conservative play calling at the end of the game.  \nSimilarly, teams that are behind in score towards the end of the game follow a more ``risky'' play call and hence, this leads to more turnovers (and not the other way around).  \n\nOne possible way to explore whether this is the case is to examine how the values of these two features change over the course of the game.  \nWe begin with ratio ${\\ensuremath{{r}}}$.  \nIf the reverse causation hypothesis were true, then the ratio ${\\ensuremath{{r}}}$ for the winning team of a game would have to reduce over the course of the game.  \nIn order to examine this hypothesis, we compute the ratio ${\\ensuremath{{r}}}$ at the end of each quarter.  \nFigure \\ref{fig:r_wins} presents the results.  \nAs we can see during the first quarter there is a large variability for the value of ${\\ensuremath{{r}}}$ as one might have expected mainly due to the small number of drives.  \nHowever, after the first quarter it seems that the value of ${\\ensuremath{{r}}}$ is stabilized.  \nThere is a slight decrease during the fourth quarter but this decrease is not statistically significant.  \nTherefore, we can more confidently reject the existence of reverse causality for ratio ${\\ensuremath{{r}}}$.\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=3in,height=3in]{figures/ratioR_quarter_wins}\n\\caption{Ratio ${\\ensuremath{{r}}}$ is stable after the first quarter, allowing us to reject the reverse causation hypothesis for ${\\ensuremath{{r}}}$.}\n\\label{fig:r_wins}\n\\end{center}\n\\end{figure}\n\nWe now focus our attention on the turnovers and the potential reverse causation with respect to this feature.  \nIn order to examine this hypothesis, we obtain from our data the time within the game (at the minute granularity) that errors were committed by the winning and losing teams.  \n\nWe then compare the paired difference for the turnover differential until the end of the third quarter for each game.  \nOur results show that the winning teams commit fewer turnovers than their losing opponents by the end of the third quarter ($p$-value $<$ 0.01), further supporting that avoiding turnovers will ultimately lead to a win.  \nOf course, as we can see from Figure \\ref{fig:turnovers-time}, there is a spike of turnovers towards the end of each half (and smaller spikes towards the end of each quarter).  \nThese spikes can be potentially explained from the urgency to score since either the drive will stop if the half ends or the game will be over respectively.  \nHowever, regardless of the reasons for these spikes, the main point is that if you commit turnovers, either early in the game (e.g., the first three quarters) or late, the chances of winning the game are reduced.  \n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=3in,height=3in]{figures/turnovers_time}\n\\caption{Turnovers spike towards the end of each quarter, with the highest density appearing during the two-minute warning.}\n\\label{fig:turnovers-time}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\\small\n\\bibliography{ta}  \n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 40695, "prevtext": "\n\\fi\n\n\nThe features we use as the input for our model include: \n\n{\\bf  Total offensive yards: }\nThis feature captures the total yards (rushing and passing) produced by the offense in the game.  \n\n{\\bf Penalty Yards: }\nThis features captures the total yards the team was penalized with.  \n\n{\\bf Turnovers: }\nThis feature captures the total turnovers produced by the team (i.e., how many times the quarterback was intercepted, fumbles recovered by the opposing team and turns on downs).  \n\n{\\bf Interceptions: }\nThis feature represents the total number of interceptions produced by the defense of the team.\n\n{\\bf Possession time: }\nThis feature captures the total ball possession time for the team. \n\n{\\bf Passing-to-Rushing ratio ${\\ensuremath{{r}}}$: }\nThe passing-to-rushing ratio ${\\ensuremath{{r}}}$ corresponds to the fraction of offensive yards gained by passing: \n\n\n", "index": 11, "text": "\\begin{equation}\n{\\ensuremath{{r}}} = \\dfrac{\\textsf{\\# of passing yards}}{\\textsf{\\# of total yards}}\n\\label{eq:ratio}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{{r}}=\\dfrac{\\textsf{\\# of passing yards}}{\\textsf{\\# of total yards}}\" display=\"block\"><mrow><mi>r</mi><mo>=</mo><mfrac><mtext mathvariant=\"sans-serif\"># of passing yards</mtext><mtext mathvariant=\"sans-serif\"># of total yards</mtext></mfrac></mrow></math>", "type": "latex"}]