[{"file": "1601.00869.tex", "nexttext": "\nwhere $\\alpha$ is the fine-structure constant, $D_{n} \\eqqcolon (\\Phi_{n} | \\hat{D}_z| \\Phi_i)$ is the transition dipole matrix element from the initial state $|\\Phi_i)$ [$|\\Phi^{\\text{MF}}_0)$ in this case] to the excited state $|\\Phi_{n})$ along the polarization axis, and $\\sigma_n (\\omega)$ defines the individual cross section to $|\\Phi_{n})$. The $\\sigma_{\\text{tot}} (\\omega)$ we obtain [see Figs.~\\ref{fig:dip_4d}(b) and \\ref{fig:dip_4d}(d)] are in excellent quantitative agreement with those given by a CIS wave-packet calculation without complex scaling \\cite{d.krebs14a}. This ensures that the SES does not perturb the wave functions in the physical inner region, where photoabsorption and electron-electron interactions take place. Reasonable quantitative agreement between the $\\sigma_{\\text{tot}} (\\omega)$ predicted by CIS and the experimental spectrum is demonstrated Ref.~\\cite{d.krebs14a}.\n\nFigure \\ref{fig:dip_4d}(a) displays the distribution of the squared dipole matrix elements $D_{n}^2$ in polar form for the intrachannel eigenstates. For clarity, only those with $|D_{n}^2| > 0.016$ are shown. The dipole strengths are concentrated in two separate regions $G_{1}$ and $G_{2}$ in the energy plane. We thereupon analyze the effective cross section for all the states in each region, where their individual $\\sigma_n(\\omega)$ can undergo strong constructive or destructive interferences depending on the relative dipole phases. In the first region $G_{1}$ lies only the exposed intrachannel resonances. As their $D_{n}^2$ are large in amplitude and nearly in phase, their $\\sigma_n$ interfere constructively and bring a net contribution $\\sigma_{G_{1}}(\\omega)$ that dominates the narrow peak at 80 eV in $\\sigma_{\\text{tot}}$ [Fig.~\\ref{fig:dip_4d}(b)]. In the second region $G_{2}$ are the continuum states near $\\operatorname{Im} \\{ E \\} = -30 \\: \\text{eV}$. Owing to the rapid phase variation in $D_{n}^2$, the $\\sigma_n$ of those states interfere destructively. Therefore, the effective $\\sigma_{G_{2}}(\\omega)$, which implicitly contains the contributions from the unexposed intrachannel resonances, practically plays no part in $\\sigma_{\\text{tot}}$. All the other states not plotted in Fig.~\\ref{fig:dip_4d}(a) cause the tiny difference between $\\sigma_{\\text{tot}}$ and $\\sigma_{G_{1}}+\\sigma_{G_{2}}$.\n\nFigure \\ref{fig:dip_4d}(c) is the distribution of the $D_{n}^2$ for the eigenstates in the full CIS model. The first region of concern $G_{1}$ encompasses $R_{1-1}$ and the neighboring continuum states. If one associates a net transition dipole to the continuum states, it roughly has half of the amplitude and points in the opposite direction in comparison to that of $R_{1-1}$. Due to this destructive interference, all the states in $G_{1}$ jointly produce a weak asymmetric background $\\sigma_{G_{1}}(\\omega)$ in $\\sigma_{\\text{tot}}$ [Fig.~\\ref{fig:dip_4d}(d)]. For $R_{1-2}$ has a large transition dipole and is very isolated, its own characteristic feature $\\sigma_{G_{2}}(\\omega)$ stands out without much interference and provides the major contribution to the broad hump around 100 eV in $\\sigma_{\\text{tot}}$. The discrepancy between $\\sigma_{\\text{tot}}$ and $\\sigma_{G_{1}}+\\sigma_{G_{2}}$ mostly comes from the continuum states with $\\operatorname{Im} \\{ E \\} \\leq -30 \\: \\text{eV}$ omitted in Fig.~\\ref{fig:dip_4d}(c).\n\nIn traditional spectroscopic studies, the energy up-shift and broadening of the structure in $\\sigma_{\\text{tot}}$ [see Figs.~\\ref{fig:dip_4d}(b) and \\ref{fig:dip_4d}(d)] have long been understood as a correlation-induced modification of the Siegert energy of a single resonance state \\cite{j.cooper64a, m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a, a.starace82a, m.amusia90b}. In contrast to this conventional wisdom, we demonstrate that the changes in $\\sigma_{\\text{tot}}$ are in fact a highly nontrivial result of switching the visibilities of two distinct resonance substructures that have no adiabatic connection to each other. While interchannel couplings suppress the spectral feature of the exposed intrachannel resonances by moving $R_{1-1}$ downward in the energy plane and introducing destructive interferences with nearby continuum states, they enhance the spectral feature of the unexposed intrachannel resonances by moving $R_{1-2}$ horizontally away from the continuum and eliminating destructive interferences.\n\n\n\n\n\\begin{figure}\n\\includegraphics[angle=270]{cx_4d.eps}\n\\caption{\\label{fig:cx_4d}(Color online) One-photon cross sections with and without the contribution of $R_{3}$ as a function of the total three-photon excitation energy relative to the Xe ground state. The initial state is presumed the lowest $4d^{-1} n d \\: (^1D)$ state.}\n\\end{figure}\n\nFinally, we propose an efficient three-photon two-color scheme to probe the multiphoton-excited collective resonance $R_{3}$ predicted in this work. Such a scheme may be realized with a combination of XUV FELs \\cite{j.feldhaus10a, e.allaria10a} and lower-order HHG \\cite{t.sekikawa04a, f.krausz09a}. The first step involves a two-photon resonant excitation of the Xe ground state to the lowest $4d^{-1} n d \\: (^1D)$ state at 64.8 eV. This requires an intense XUV source with a mean photon energy of 32.5 eV and a sub-eV bandwidth to avoid the excitation of other bound states with even parity. In the second step, the $4d^{-1} n d \\: (^1D)$ state absorbs one photon with a different color and goes to $R_{3}$ [$4d^{-1}\\epsilon f \\: (^1F)$]. The second weak source should be tunable or with a broad bandwidth covering a photon energy about 10 eV in the VUV. Note that the two pulses may have to overlap temporally given the Auger decay of $4d^{-1}$ on the femtosecond time scale \\cite{m.jurvansuu01a}. As a proof of concept, we assume the initial state is the lowest $4d^{-1} n d \\: (^1D)$ state and compute the one-photon cross sections using Eq.~(\\ref{eq:cx}) \\cite{Note2}. Fig.~\\ref{fig:cx_4d} shows the cross sections with and without the contribution of $R_{3}$ as a function of the total three-photon excitation energy relative to the ground state. Comparison between the two spectra verifies that the window resonance close to 75 eV arises exactly from the target $R_3$.\n\n\n\n\nIn summary, we demonstrate the fundamental role of electronic correlations on the formation of various types of $4d^{-1} \\epsilon f$ collective resonances in Xe by directly tracking the adiabatic evolution of the resonance eigenstates. By analyzing the state-resolved one-photon cross section and the quantum interference effects, we explain why the resonance substructure cannot be resolved in the standard spectroscopic studies, where an exchange of the visibilities of the two resonances was misinterpreted as a change of the Siegert energy of one resonance state. While Coulomb interactions broaden the width of the dipole-allowed $R_{1-1}$, they generate surprisingly long-lived multiphoton-excited $R_{3}$ and $R_{5}$. This opens up possibilities to probe novel nonlinear behavior of Xe with new light source technology. Beginning with the prototypical collective excitations in a multielectron atom, the insights and methodology of this Letter pave the way towards a deeper understanding of the collective response of matter to light--- from the linear to the nonlinear regime.\n\n\n\n\n\\begin{acknowledgments}\nWe thank Dr.~O.~Vendrell for helpful discussions. S.P.~is funded by the Alexander von Humboldt Foundation and by the NSF through a grant to ITAMP.\n\\end{acknowledgments}\n\n\n\n\n\n\n \n", "itemtype": "equation", "pos": 18518, "prevtext": "\n\n\n\n\n\\title{Collective resonances of atomic xenon from the linear to the nonlinear regime}\n\n\\begin{CJK*}{UTF8}{}\n\n\\author{Yi-Jen Chen \\CJKfamily{bsmi}(é\u0099³æ\u0080¡è\u0093\u0081)}\n\\email{yi-jen.chen@cfel.de}\n\\affiliation{Center for Free-Electron Laser Science, DESY, Notkestrasse 85, 22607 Hamburg, Germany}\n\\affiliation{Department of Physics, University of Hamburg, Jungiusstrasse 9, 20355 Hamburg, Germany}\n\n\\author{Stefan Pabst}\n\\affiliation{Center for Free-Electron Laser Science, DESY, Notkestrasse 85, 22607 Hamburg, Germany}\n\\affiliation{ITAMP, Harvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA}\n\n\\author{Robin Santra}\n\\email{robin.santra@cfel.de}\n\\affiliation{Center for Free-Electron Laser Science, DESY, Notkestrasse 85, 22607 Hamburg, Germany}\n\\affiliation{Department of Physics, University of Hamburg, Jungiusstrasse 9, 20355 Hamburg, Germany}\n\n\\date{\\today}\n\n\n\n\n\\begin{abstract}\nWe explain the origin of the two collective sub-resonances of the $4d$ giant dipole resonance of atomic Xe recently discovered by nonlinear spectroscopy. In the case of one-photon absorption, while a change in the resonant-like feature in the cross section upon the inclusion of electronic correlations has been commonly attributed to a change of the resonance parameters of a single resonance state, we show that this modification is a result of switching between the relative visibilities of the underlying resonance states. In addition, we predict hitherto undiscovered collective $4d$ resonance states in Xe that can only be accessed through multiphoton absorption. Unlike any known collective feature in atoms, these resonances are exceptionally long-lived (more than 100 attoseconds), thus opening up possibilities to probe new collective effects in atoms with modern XUV light sources.\n\\end{abstract}\n\n\\pacs{32.80.Aa, 32.80.Rm, 31.15.A-, 31.15.vj}\n\n\\maketitle\n\n\\end{CJK*}\n\n\n\n\nAlthough the one-particle approximation can well describe a many-electron atom in several aspects, it fails conspicuously in some cases to capture the many-body nature of an atom. Indeed, as early as 1933, Bloch \\cite{f.bloch33a} proposed the existence of plasma-like collective excitations within an atom. It is best exemplified today by the $4d$ giant dipole resonance (GDR) in the XUV one-photon ionization spectrum of atomic Xe \\cite{c.brechignac94a, m.amusia00a, a.starace82a, m.amusia90b}, where intensive studies have shown that electronic correlations beyond the mean-field (MF) level are required to bring satisfactory agreement between theory \\cite{j.cooper64a, m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a} and experiment \\cite{d.ederer64a, a.lukirskii64a}. Since the GDR stems from electrons deep in the inner shell, it appears in elements nearby Xe in the periodic table \\cite{c.brechignac94a, m.amusia00a} and survives in molecules and solids \\cite{c.brechignac94a, j.connerade87a}. Moreover, it is closely related to the collective behavior of a diversity of many-body systems such as fullerenes, metallic clusters, and nuclei \\cite{c.brechignac94a, m.amusia00a}. \n\n\n\n\nIn state-of-the-art experiments, the collective character of the GDR remains at the heart of the nonlinear response of Xe to various new light sources. Not only does it lead to a striking enhancement in the high-harmonic generation (HHG) spectra of Xe driven by intense NIR lasers \\cite{a.shiner11a, s.pabst13b}, but it also creates an unusual charge-state distribution of Xe irradiated by XUV free-electron lasers (FELs) \\cite{m.richter09a, n.gerken14a}. More recently, an experiment at FLASH \\cite{t.mazza15a} on two-photon above-threshold ionization (ATI) of Xe provided evidence for a substructure of the GDR \\cite{g.wendin73c, y.chen15a} that was unobserved in linear spectroscopy. The two-resonance substructure of the GDR is a key indicator of electronic correlations \\cite{y.chen15a}. So far, the many-body nature of the GDR has been studied only through calculations of the one-photon cross section \\cite{j.cooper64a, m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a, a.starace82a, m.amusia90b}. Despite indisputable quantitative success, previous research cannot resolve the substructure, and is thus insufficient to uncover the fundamental multielectron mechanism on the formation of the GDR.\n\n\n\n\nIn this Letter, by  directly studyingthe intrinsic electronic structure, we explain how the two collective dipole resonances emerge from the underlying uncorrelated resonances and why only one of the two resonances is visible in linear spectroscopy. It is known that, when going from a one-particle to a many-body description, a narrow peak at 80 eV \\cite{j.cooper64a} in the one-photon cross section changes into a broad hump at 100 eV \\cite{m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a}. We demonstrate that this change is not an intuitive consequence of modifying the resonance parameters of a single resonance state as suggested by conventional spectroscopic studies \\cite{j.cooper64a, m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a, a.starace82a, m.amusia90b}, but a consequence of switching the relative importance of the constituent resonances. Furthermore, we predict the existence of hitherto unknown multiphoton-excited collective resonance states of the $4d^{-1} \\epsilon f$ type. These unusually long-lived collective features offer opportunities to probe new collective nonlinear response of Xe in the XUV or VUV using FELs or HHG sources.\n\n\n\n\nTo unveil these insights, we investigate the \\textit{ab initio} electronic structure in the $4d$ continuum of Xe by diagonalizing the many-electron Hamiltonian subjected to smooth exterior complex scaling (SES) \\cite{n.moiseyev11a, n.moiseyev98b, n.moiseyev98a, h.karlsson98a, c.buth07b} within the wave-function--based configuration-interaction singles (CIS) many-body theory \\cite{n.rohringer06a, l.greenman10a, s.pabst12b, s.pabst13a}. Up to now, other theoretical approaches to inner-shell collective excitations in atoms have neither considered multiphoton-excited collective resonances \\footnote{We point out that Refs.~\\cite{g.wendin87a, a.lhuillier87a} inspect the correlation effects on the two-photon ionization spectra in the \\textit{valence shell} of Xe. On the other hand, Ref.~\\cite{l.pi14a} examines the three-photon resonances in the $4d$ subshell of Xe in a \\textit{MF model}.} nor studied the resonance states explicitly \\cite{a.starace82a, m.amusia90b, j.cooper64a, m.amusia67a, w.brandt67a, a.starace70a, g.wendin73c, a.zangwill80a}. The latter aspect is particularly imperative, because resonances generally overlap and interfere in the cross section, impinging on the identification of their individual features.\n\nThe combination of CIS and SES has been described in detail in Ref.~\\cite{y.chen15a}, and has successfully predicted the two dipole resonances \\cite{y.chen15a} in consistence with the substructure in the ATI spectrum \\cite{t.mazza15a}. Briefly, we represent the nonrelativistic $N$-body Hamiltonian including the exact two-electron Coulomb interactions in the CIS configuration space $\\mathcal{V}_{\\text{CIS}}$, which comprises the Hartree-Fock ground state $| \\Phi^{\\text{MF}}_0)$ and its singly excited one-particle--one-hole (1p-1h) configurations $| \\Phi^\\mathbf{a}_\\mathbf{i} )$ \\cite{a.szabo96a}. Since the wave function ansatz is a summation over various Slater determinants, CIS is able to capture essential many-body physics beyond the MF picture \\cite{n.rohringer06a, l.greenman10a, s.pabst12b, s.pabst13a}. Applications of CIS to physical processes involving the GDR can be found in Refs.~\\cite{t.mazza15a, d.krebs14a, s.pabst13b, s.pabst15a}. Resonance states are not elements of the Hilbert space of a Hermitian Hamiltonian \\cite{n.moiseyev11a, n.moiseyev98b, w.reinhardt82a, r.santra02a}. Hence, SES \\cite{n.moiseyev11a, n.moiseyev98b, n.moiseyev98a, h.karlsson98a, c.buth07b}, a variant of the well-established complex scaling theory \\cite{n.moiseyev11a, n.moiseyev98b, w.reinhardt82a}, is employed to rigorously transform a resonance state into one discrete and isolated eigenfunction of the scaled non-Hermitian Hamiltonian. Complex scaling is typically used to address resonances in few-electron systems \\cite{n.moiseyev79a, a.scrinzi98a, d.telnov02a, c.mccurdy02a, x.bian11a} but had not been used before for collective excitations in a multielectron atom as complex as Xe.\n\nExploiting the conservation of the total spin and magnetic quantum numbers $S = M =0$ \\cite{n.rohringer06a, s.pabst12b}, the hole index $\\mathbf{i} = nl_{\\pm m}$ \\cite{s.pabst12b} specifies one ionization channel, and $\\mathcal{V}_{\\text{CIS}}$ accommodates only spin-singlet configurations reachable by single or multiple dipole excitations in linearly polarized light fields. The calculations are performed using our \\textsc{XCID} package \\cite{xcid}. For numerical parameters please see the Supplemental Material \\footnote{See Supplemental Material at \\url{http://}, which includes the numerical parameters used for Figs.~\\ref{fig:diag_4d}-\\ref{fig:dip_4d} and Fig.~\\ref{fig:cx_4d}.}.\n\nTo systematically study the many-body effects, we compare the results of two scenarios: the full CIS model and a reduced intrachannel model. The genuine two-electron correlations within CIS are fully encapsulated by the interchannel-coupling matrix elements $( \\Phi^\\mathbf{a}_\\mathbf{i} | \\hat{H}_{\\text{Coulomb}} | \\Phi^\\mathbf{b}_\\mathbf{j} )$ with $\\mathbf{a} \\neq \\mathbf{b}$ and $\\mathbf{i} \\neq \\mathbf{j}$ \\cite{a.starace82a, s.pabst12b} \\footnote{The symmetric inner product $\\left( \\cdot \\right| , \\left| \\cdot \\right)$ must be used to assure orthogonality among the eigenstates of the scaled non-Hermitian Hamiltonian \\cite{n.moiseyev11a, n.moiseyev98b, r.santra02a}.}. It is this type of interactions that simultaneously changes the state of the photoelectron and that of the cation, forming an entangled p-h pair. In the intrachannel model, all the interchannel terms are set to zero, and the Hamiltonian effectively acts as a one-particle potential \\cite{s.pabst13a}.\n\n\n\n\n\\begin{figure}\n\\includegraphics[angle=270]{diag_4d.pdf}\n\\caption{\\label{fig:diag_4d}(Color online) Complex energy spectra near the $4d$ threshold of Xe for (a) the intrachannel and (b) the full CIS models. Horizontal and vertical axes represent the real and imaginary parts of the energy eigenvalues, respectively.}\n\\end{figure}\n\nFigure \\ref{fig:diag_4d}(a) presents the spectrum of the complex energy eigenvalues for the intrachannel model in the vicinity of the $4d$ ionization threshold at 67.5 eV \\cite{a.thompson09a}. According to the Balslev-Combes theorem \\cite{n.moiseyev11a, n.moiseyev98b, w.reinhardt82a}, the bound states remain on the real axis, the continuum is rotated clockwise by twice the scaling angle \\cite{y.chen15a, Note2}, and the resonances are exposed poles above the rotated continuum. The eigenvalue of the pole is the Siegert energy: $E = \\Xi - i \\Gamma / 2$, with $\\Xi$ the excitation energy and $\\Gamma$ the inverse lifetime for the quasibound electron to escape to infinity \\cite{n.moiseyev11a, n.moiseyev98b, r.santra02a}. A group of three nearly degenerate $4d^{-1}_{\\pm m} \\epsilon f_{\\pm m}$ shape resonances \\cite{j.cooper64a, a.starace82a} can be seen, one for each $4d_{\\pm m}$ channel. The small energy splitting reflects the nonspherical structure of the ionic potential \\cite{y.chen15a}.\n\n\\begin{table}\n\\caption{\\label{tab:energy_4d} Siegert energies of the exposed collective resonances near the $4d$ threshold of Xe in the full CIS model.\\footnote{The energies have an uncertainty of 0.5 eV. This is estimated by varying the numerical parameters over a sensible range \\cite{Note2}.}}\n\\begin{ruledtabular}\n\\begin{tabular}{lcccc}\n$\\text{Label}$ & $\\text{Configuration}$ & $\\Xi \\: \\text{(eV)}$ & $\\Gamma \\: \\text{(eV)}$ & $\\Gamma^{-1} \\: \\text{(as)}$\\\\\n\\hline\n$R_{1-1}$ & $4d^{-1} \\epsilon f \\: (^1P)$ & $73.3$ & $24.9$ & $26.4$\\\\\n$R_{1-2}$ & $4d^{-1} \\epsilon f  \\: (^1P)$ & $111.3$ & $58.0$ & $11.4$\\\\\n$R_{3}$ & $4d^{-1} \\epsilon f \\: (^1F)$ & $74.3$ & $4.9$ & $135.4$\\\\\n$R_{5}$ & $4d^{-1} \\epsilon f \\: (^1H)$ & $72.2$ & $2.8$ & $237.4$\\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{table}\n\nFigure \\ref{fig:diag_4d}(b) depicts the energy spectrum for the full CIS model, where four resonances are visible. Clearly, the resonance substructure critically hinges on the two-body Coulomb interactions. The Siegert energies are detailed in Table \\ref{tab:energy_4d}. As the full Hamiltonian is rotationally invariant, each resonance state has a definite total orbital angular momentum quantum number $L$. $R_{1-1}$ and $R_{1-2}$ have $L=1$ [$4d^{-1}\\epsilon f$ ($^1P$)]; they can both contribute to the one-photon cross section associated with the known GDR \\cite{g.wendin73c, y.chen15a} and are responsible for the substructure observed in the ATI spectrum \\cite{t.mazza15a}. $R_{3}$ and $R_{5}$ have $L=3$ [$4d^{-1}\\epsilon f$ ($^1F$)] and $L=5$ [$4d^{-1}\\epsilon f$ ($^1H$)], respectively; these formerly unknown resonances can only be accessed via multiphoton absorption. The resonances $4d^{-1}\\epsilon f$ ($^1D$) and $4d^{-1}\\epsilon f$ ($^1G$) are absent because of the restrictions imposed on $\\mathcal{V}_{\\text{CIS}}$ \\cite{n.rohringer06a, s.pabst12b}. Assuming electric dipole transitions for linearly polarized radiation \\cite{f.faisal87a}, a closed-shell ground state is allowed to go to odd-parity excited states with only an odd $L$. The hole population in each resonance state \\cite{l.greenman10a} is primarily distributed among different $4d_{\\pm m}^{-1}$, with small admixtures of $5s_{0}^{-1}$ and $5p_{\\pm m}^{-1}$ from the outer shell. As a result of channel mixing, the resonance wave function must be written as a coherent superposition of various 1p-1h configurations and thereby represents a collective excitation \\cite{b.povh95a}.\n\n\n\n\n\\begin{figure}\n\\includegraphics[angle=270]{switch_4d.pdf}\n\\caption{\\label{fig:switch_4d}(Color online) Evolution of the complex energy spectrum near the $4d$ threshold of Xe from the intrachannel to the full CIS model. The interchannel-coupling strength $\\xi$ is represented by the false color. Locations of the unexposed intrachannel resonances are indicated by black crosses \\cite{Note2}.}\n\\end{figure}\n\nTo elucidate the role of correlations accounting for the notable discrepancy between the resonance substructures of the two models, Fig.~\\ref{fig:switch_4d} shows how an eigenstate in the intrachannel model evolves into an eigenstate in the full CIS model upon adiabatic switching of interactions. In short, we diagonalize the Hamiltonian varying the strength of the interchannel-coupling terms $\\xi ( \\Phi^{\\mathbf{a}}_{\\mathbf{i}} | \\hat{H}_{\\text{Coulomb}} | \\Phi^{\\mathbf{b}}_{\\mathbf{j}} ), \\: \\xi \\in [0,1]$. The intrachannel model is equivalent to the case where $\\xi = 0$, and the full model to the case where $\\xi = 1$.\n\nFirst, we focus on the upper-left corner of Fig.~\\ref{fig:switch_4d}. As $\\xi$ increases, the three intrachannel resonances turn into $R_{1-1}$, $R_{3}$, and $R_{5}$ in the full model. At first sight, one may picture this as multiplet splitting in the subspace spanned by the three intrachannel resonances. However, the formation of $R_{1-1}$, $R_{3}$, and $R_{5}$ is far more complicated than that and requires configuration mixing among the intrachannel resonances and the intrachannel continuum. A simple way to see this is that the eigenvalues of the reduced $3 \\times 3$ Hamiltonian with off-diagonal interchannel couplings must analytically add up to a constant for an arbitrary $\\xi$, whereas the sum of $\\Xi$ for these three poles is obviously not conserved.\n\nInterestingly, interchannel couplings have a particularly strong impact on the spectral widths for this group of resonances, giving rise to anomalous segregation of a broad mode ($R_{1-1}$) and two narrow modes ($R_{3}$ and $R_{5}$) [see Table \\ref{tab:energy_4d}]. To date, no sustained collective resonance in atoms (i.e.~no ``atomic plasmon'') has been found-- it always carries density oscillations dying out more or less within one period \\cite{c.brechignac94a, m.amusia00a}. Since $R_{3}$ and $R_5$ are exceptionally long-lived (with $\\Xi / \\Gamma > 15$), they can be justly called ``multiphoton-excited atomic plasmons'' and are expected to reveal distinctive features in nonlinear spectroscopy \\cite{j.feldhaus10a, e.allaria10a, t.sekikawa04a} or pump-probe experiment \\cite{f.krausz09a}.\n\nNext, let us look at the lower part of Fig.~\\ref{fig:switch_4d}. When turning on interactions, the broad resonance $R_{1-2}$ emerges out of the continuum, keeps its width, and quickly becomes rather isolated. The emergence of $R_{1-2}$ does not mean that correlations create an additional pole of the S-matrix. Instead, it signals that the intrachannel potential can support another group of $4d^{-1}_{\\pm m} \\epsilon f_{\\pm m}$ shape resonances [with $\\operatorname{Re}\\{E\\} \\approx 70 \\: \\text{eV}, \\: \\operatorname{Im}\\{E\\} \\approx -30 \\: \\text{eV}$ (see Fig.~\\ref{fig:switch_4d})] that is not exposed by the scaling angle chosen for the figures \\cite{Note2}. With the angle used, these highly damped resonances are embedded in the intrachannel continuum close to $ \\operatorname{Im}\\{E\\} = -30 \\: \\text{eV}$.\n\n\n\n\n\\begin{figure*}\n\\includegraphics[angle=270, width=6.7in]{dip_4d.pdf}\n\\caption{\\label{fig:dip_4d}(Color online) Left panels: Distributions of $D_{n}^2$ for (a) the intrachannel and (c) the full CIS models. Each state with $|D_{n}^2|>0.016$ is represented by a filled circle and a vector of equal length. The amplitude $|D_{n}^2|$ is indicated by the false color, and the phase $\\operatorname{arg}\\{D_{n}^2\\}$ is indicated by the angle of the vector with respect to the real energy axis. Other states with $|D_{n}^2| \\leq 0.016$ are represented by smaller black circles. Right panels: Total cross sections and effective cross sections for states in various energy regions for (b) the intrachannel and (d) the full CIS models. See text for the notation used.}\n\\end{figure*}\n\nSo far, the center of our discussion has been the intrinsic electronic structure. We now elaborate how the resonances are imprinted in the photoabsorption spectra, starting with the one-photon case related to the GDR. The total one-photon absorption cross section can be directly constructed from the eigenstates of the scaled non-Hermitian Hamiltonian \\cite{c.buth07b, e.narevicius98a, t.rescigno75a}:\n\n", "index": 1, "text": "\\begin{equation}\n\\sigma_{\\text{tot}} (\\omega) = - 4 \\pi \\alpha \\omega \\operatorname{Im} \\sum_{n} \\frac{D_{n}^2} {\\omega - E_{n}} \\eqqcolon \\sum_n \\sigma_n (\\omega), \\label{eq:cx}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\text{tot}}(\\omega)=-4\\pi\\alpha\\omega\\operatorname{Im}\\sum_{n}\\frac{D_%&#10;{n}^{2}}{\\omega-E_{n}}\\eqqcolon\\sum_{n}\\sigma_{n}(\\omega),\" display=\"block\"><mrow><mrow><mrow><msub><mi>σ</mi><mtext>tot</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>α</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><mo>Im</mo><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mfrac><msubsup><mi>D</mi><mi>n</mi><mn>2</mn></msubsup><mrow><mi>ω</mi><mo>-</mo><msub><mi>E</mi><mi>n</mi></msub></mrow></mfrac></mrow></mrow></mrow><mo>≕</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><msub><mi>σ</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]