[{"file": "1601.00844.tex", "nexttext": "\nwhen $b_0$ is constant throughout the sample and $|x|>0$, $|y|>0$. The same applies to 1-D mask \nwith the only difference that $ |y| = 150\\: \\mu$m, which is small enough, compared with the \npattern wavelength, to neglect its size and consider it as a 1-D mask. In the presented configurations \n$I_0 =0.9\\: mW/cm^2$ and $b_0=0.1\\:mW/cm^2$.  The alternating voltage  $V_0$ has been varied between $3$ and $7$ $V_{rms}$, \nat a constant frequency $f_0=5\\:kHz$,\n starting with the appearance of stationary roll-patterns.\nFor different $V_0$ values, the dynamical behavior obtained \nin the system was recorded with a CCD  camera.\nFigure~\\ref{Fig2} shows the spatiotemporal \nevolution of the observed patterns in one and two dimensions, respectively. \nThis evolution is characterized by projected \nspatiotemporal diagrams,  which are constructed, in the 2-D experiments, \nby picking an arbitrary line---transversal to the \nrolls \ndirection---in the illuminated zone and superposing it as time evolves; \nin the 1-D experiments this  construction is simpler, is enough to superpose the pattern as the time evolves. \nThe system exhibits stationary  stripe patterns (cf. Fig.~\\ref{Fig2}a).\nThese patterns are  induced by a spatial filtering in the Fourier plane (cf. FP in Fig.~\\ref{Fig1}).  Actually, through a slit, \nwe can filter spatial modes and break the rotational symmetry. In this way, we forced the system just to present \nroll-patterns in a given direction. \n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.95\\columnwidth]{2.pdf} \n\\caption{Spatial textures in LCLV with optical feedback at different voltage $V_0$. Top panels \ncorrespond to  spatiotemporal diagrams of observed dynamics working with one-dimensional patterns. \nMiddle panels panels stand for projected spatiotemporal diagrams of two-dimensional textures. \n a) Periodic regime, b) quasi-periodic dynamics, c) chaotic behavior, \nand d) a 3-D spatiotemporal diagram of a complex texture at $V_0=4.3V{rms}$. All values were taken during $100~s$ and are normalized.}\n\\label{Fig2}       \n\\end{figure}\n\nIncreasing $V_0$, \nthe pattern begins to oscillate in a complex manner (see Fig.~\\ref{Fig2}b). \nWe observe in the projected spatiotemporal diagram  local\nwaves, oscillations and spatiotemporal dislocations.\nSimilar dynamics has been reported in one-dimensional inhomogeneous spatial \nsystems \\cite{ClercOrtega2014,Louvergneaux2001,Szwaj2005}.\nIn our experiments these inhomogeneities can be caused by the \ninherent imperfections and inhomogeneities \ninduced by the filter in the Fourier plane. Hence, this kind of dynamical \nbehavior could be expected.\nThe complex dynamics exhibited by this pattern \nis constantly repeated over time. Which leads us to infer that this kind of behavior \ncould be quasi-periodicity.\n\n \nFurther increasing $V_0$, the dynamics shown by the pattern becomes \nmore and more complex (cf. Fig.~\\ref{Fig2}c).\nClearly, in the projected spatiotemporal diagram, we detected an intermittent behavior. \nThat is, the pattern exhibits aperiodic oscillations invaded by large fluctuations, generating several \nspatial and temporal dislocations. Likewise, the system exhibits a high spatiotemporal complexity. \nThis kind of disorder is usually associated to spatiotemporal chaotic textures\n\\cite{Nicolis1995,Verschueren2013,Bodenschatz2002}.\nFigure \\ref{Fig2}d shows a 3-D spatiotemporal diagram, \nfrom this diagram it is clear that an arbitrarily chosen line represents the dynamics. \n\n\nA mathematical tool for analyze the spatial modes interaction is the Fourier spectrum.\nFigure \\ref{Fig3} shows the Fourier spectra of  different dynamical regimes. Showing that the \ndynamics changes between stripe patterns, quasi-periodicity and spatiotemporal chaotic textures. \nThe stationary pattern is characterized \nby a dominant wavelength $f$. The width of this peak is due to temperature fluctuations and \ndynamics of defects such as dislocations and boundary grains. The quasi periodic texture is characterized by the \nappearance of   incommensurable wavelengths, $\\{f',f'''\\}$, with respect to the main wavelength $f''$ and its harmonics. \nThe spatiotemporal  chaotic texture is characterized by presenting an enlarged spectrum \nas a result of the interaction between the  main  incommensurable modes \\cite{Kuramoto84}. \nNote that in this regime, the modes are coupled with \nexponential decay (see the dashed line in Fig.~\\ref{Fig3}). Therefore, \nthe system does not exhibit power spectrum behavior which is the hallmark \nof turbulence dynamics \\cite{Frisch}.\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.95\\columnwidth]{3.pdf} \n\\caption{Fourier spectra for three different dynamical regimes. In gray (blue) the Fourier spectrum \nof a stationary pattern, in light-gray (red) a quasi-periodic regime, it can be observed the emergence of \nincommensurable frequencies ($f'$, $f''$ and $f'''$). In black, a broadened spectrum that corresponds \nto a chaotic texture, presenting an exponential decay of the modes marked by the dashed line.}\n\\label{Fig3}       \n\\end{figure}   \n\n{\\it Quantifying the chaos.--} A characterization of complex dynamics \nlike chaos and spatiotemporal chaos\ncan be done by means of Lyapunov exponents. There are as many exponents\nas the dimension of the system under study. \nThe analytical study of Lyapunov exponents is a paramount \nendeavor and in practice inaccessible, then the pragmatic strategy \nis a numerical derivation of the exponents. \nFrom  experimental data, in the case of low-dimensional dynamical systems, \nby means of recognition \nof initial conditions one can determine the LLE \\cite{Swinney85}.\nThis exponent accounts for the greatest exponential growth\nand its defined by\n\n", "itemtype": "equation", "pos": 7841, "prevtext": "\n\n\\title{From stationary patterns to spatiotemporal chaotic textures}\n\n\\author{Marcel G. Clerc$^{1}$}\n\\author{Gregorio Gonz\\'alez-Cort\\'es$^{2}$}\n\\author{Vincent Odent$^{1,\\dagger}$}\n\\author{Mario Wilson $^{1,*}$}\n\n\\affiliation{$^{1}$Departamento de F\\'isica, Facultad de Ciencias F\\'isicas y \nMatem\\'aticas, Universidad de Chile, Blanco Encalada 2008, Santiago, Chile}\n\n\\affiliation{ $^{2}$Departamento de F\\'isica, Facultad de Ciencias, Universidad \nde Chile, Las Palmeras 3425, \\~Nu\\~noa, Chile}\n\n\\affiliation{ $^{*}$corresponding author: mario.wilson@ing.uchile.cl}\n\n\n\\begin{abstract}\n Macroscopic systems subjected to injection and dissipation of energy can\nexhibit complex spatiotemporal behaviors as result of dissipative self-organization. \nDespite   the substantive  theoretical and numerical  progress to characterize these behaviors, \nits experimental implementation has been almost sterile. Here, we report a two-dimensional  pattern forming set up, which \nexhibits a transition from stationary patterns to spatiotemporal\nchaotic textures,  based on a nematic liquid crystal layer with \nspatially modulated input beam and optical feedback. Using an adequate projection of spatiotemporal diagrams, \nwe determine the largest Lyapunov exponent.\nThis exponent and Fourier transform  lead to a reconciliation of experimental observations  \nand theoretical developments. In particular, we can distinguish between spatiotemporal chaos\nand amplitude turbulence concepts; which are usually merged. \n\\end{abstract}\n\n\n\\maketitle\n\n\\begin{figure*}\n\\includegraphics[width=1.8\\columnwidth]{1.pdf} \n\\caption{Schematic representation of the experimental setup. LCLV stands for the liquid crystal light valve, L represents \nthe achromatic lenses with a focal distance $f=25\\:cm$, M are the mirrors, \nFB is an optical fiber bundle, BS stands for the beam splitters, PC \nrepresents a polarizing cube, SLM is a spatial light modulator and FP represents the Fourier plane.\nF and B stand for the forward (incoming) and backward (reflected) beam respectively. $d$ is the equivalent optical length. \nIn the bottom left  part of the image, two examples of obtained patterns  and textures.}\n\\label{Fig1}       \n\\end{figure*}\n\nOptical  systems maintained far from equilibrium,\nthrough the injection and dissipation  of energy, can\npresent  spatiotemporal  structures, \n{\\it patterns}~\\cite{Arecchi90,Huyet,Tredicce96,Mamaev98,Rogers2004,ResidoriReport,PatternsOptics,Descalzi2011}.\nThese structures appear as a way to \noptimize energy transport and momenta~\\cite{Prigogine}.  \nPatterns are the result of the interplay between the linear gain and the\nnonlinear saturation mechanisms. In many physical systems,\nthese structures are stationary and emerge as a spatial instability of a uniform state\nwhen a control parameter is changed and surpasses a critical\nvalue, which usually corresponds to imbalances of forces.\nAs the parameters of the system are changed, stationary patterns can become \nunstable and bifurcate to more\ncomplex patterns, even into aperiodic dynamics states \n\\cite{Nicolis,DefectMediated,GorenEckmannProcaccia}.  \nThis behavior is characterized by complex spatiotemporal dynamics exhibited by the \npattern and a continuous coupling between spatial modes in time. \nComplex spatiotemporal dynamics  of patterns have been observed, for example, \nin fluids \\cite{Bodenschatz,Miranda,Limat}, chemical reaction-diffusion systems \\cite{Flesselles}, \ncardiac fibrillation \\cite{Weiss}, electroconvection \\cite{Zhou}, fluidized granular matter \\cite{Moon},  \nnonlinear optical cavities \\cite{Arecchi90,Huyet,Tredicce96,Mamaev98} and in a liquid crystal light valve  \\cite{VBCR2013}.\nIn most of these studies, complex behaviors are characterized by spatial and temporal \nFourier transforms, wave vector distribution, \nfiltering spatiotemporal diagrams, power spectrum of spatial mode, \nlength distributions, Poincar\\'e maps and number of defects as a function of the parameters.\nHowever, in these experimental studies, spatiotemporal complexity has not been characterized using rigorous tools of \ndynamical systems theory as Lyapunov exponents \\cite{Manneville90}. \nThese exponents characterize the exponential sensitivity \nof the dynamical behaviors under study and in turn gives a characteristic time scale on which one has \nthe ability to predict the time evolution of the system. When the largest Lyapunov exponent (LLE)\nis positive (negative) the system under study is chaotic (stationary).\nIndeed, from experimental data in spatial extended systems, \nit is a difficult task to infer the value of Lyapunov exponents. \n\n\n\n{\\it Experimental details.--} \nA flexible optical experimental setup that exhibits pattern formation is the liquid crystal light valve (LCLV)\nwith an optical feedback (see Fig.~\\ref{Fig1})~\\cite{ResidoriReport}. \nThe LCLV is illuminated by an expanded and collimated He-Ne laser beam, $\\lambda=633 \\:nm$, \n with $3$~cm transverse diameter and power $I_{in}=6.5$ mW/cm$^2$, linearly polarized along the vertical axis. \n Once shone into the LCLV, the beam is reflected by the dielectric mirror \ndeposed on the rear part of the cell and, thus, sent to the polarizing cube. Due to the phase-change the light suffers in the reflection, \nthe polarizing cube will send the  reflected light into the feedback loop. To close the feedback \n loop, a mirror and an optical fiber bundle  are used, these elements \n assure the light to reach the photoconductor placed in the back part of the LCLV. \nIn the feedback loop, a 4-f array is placed in order to obtain a self-imaging \nconfiguration and access to the Fourier plane, this array is constructed \nwith 2 identical lenses  with focal length $f=25~cm$ placed in such a way \nthat both sides of the LCLV are conjugated planes. We filter the Fourier plane in order to force the system to exhibit roll-patterns in a given direction.\nThanks to this configuration the free propagation length in the feedback loop \ncan be easily adjusted. For the performed experiments an optical equivalent length of $d=-4$~cm was used.\nA spatial light modulator (SLM) was placed in the input beam optical path with a $1:1$ imaging between \nthe SLM and the frontal part of the LCLV.    \nWith the aid of a specialized software, a square mask was produced and sent to the \nSLM. The SLM and the polarizing cube combination allow to impose an arbitrary shape \nto the input beam.  \nFor a uniform mask  of 160 gray-value, the typical input intensity would be \n$I_{w}=0.83\\:mW/cm^2$. To obtain the shape used in the experiments, \none and two-dimensional masks, $I(x,y)$, were created and, by means of these masks, one and two dimensional patterns \ncan be obtained as can be seen in the bottom left part of Fig.~\\ref{Fig1}. \nThe system dynamics is controlled by adjusting the external voltage $V_0$ \napplied to the LCLV.\n\nThe dynamics exhibited by the LCLV with optical feedback is characterized by the changes that \nmolecular orientation induces in the phase of the reflected light  \nwhich in its turn---optical feedback---produces a voltage that \nreorients the liquid crystal molecules. \n\n\\noindent{\\it From stationary to disordered dynamics.--} The presented dynamics in the LCLV \nhave been explored in two different configurations, the first one using an intensity \nmask of zero-level intensity everywhere except for a central square part with length $a_0=2.5$ mm (2-D \nmask), and the second one with a zero-level intensity except on a narrow channel of 150 $\\mu$m width and $2.5$ mm\nlength (1-D mask). \nThe injected intensity  is spatially modulated as $I_{in}=I_0(x,y)$, where $I_0$  can be controlled by changing the mask created \nin the SLM, and\n $\\{x, y\\}$ are the transverse coordinates of the sample. $I_0$ \nis measured when imposing a given gray-value to the illuminated area, that is, for the 2-D mask\n", "index": 1, "text": "\n\\[\nI_{0}(x,y)=\\left\\{\n\\begin{array}\n[c]{c}\nI_{0}+b_{0} \\ \\  \\ \\ \\ \\  |x| \\leq a_0, \\ {\\text and }  \\ \\  |y| \\leq a_0\\\\\nb_{0}  \\ \\ \\ \\  \\ \\ \\ \\ \\ \\  \\ \\ \\ \\ \\ \\  \\ \\ \\ \\ \\ \\  \\ \\ \\ \\ else\n\\end{array}\n\\right.\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"I_{0}(x,y)=\\left\\{\\begin{array}[c]{c}I_{0}+b_{0}\\ \\ \\ \\ \\ \\ |x|\\leq a_{0},\\ {%&#10;\\text{a}nd}\\ \\ |y|\\leq a_{0}\\\\&#10;b_{0}\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ else\\end{array}\\right.\" display=\"block\"><mrow><mrow><msub><mi>I</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mrow><mrow><mrow><msub><mi>I</mi><mn>0</mn></msub><mo>+</mo><msub><mi>b</mi><mn>0</mn></msub></mrow><mo mathsize=\"70%\" separator=\"true\" stretchy=\"false\">   </mo><mrow><mo stretchy=\"false\">|</mo><mi>x</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>≤</mo><msub><mi>a</mi><mn>0</mn></msub></mrow><mo rspace=\"7.5pt\">,</mo><mrow><mrow><mrow><mtext>a</mtext><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>d</mi></mrow><mo mathsize=\"70%\" separator=\"true\" stretchy=\"false\"> </mo><mrow><mo stretchy=\"false\">|</mo><mi>y</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>≤</mo><msub><mi>a</mi><mn>0</mn></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>b</mi><mn>0</mn></msub><mo mathvariant=\"italic\" separator=\"true\">             </mo><mrow><mi>e</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>e</mi></mrow></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00844.tex", "nexttext": "\nwhere ${\\bf u}(x,t)$ and ${\\bf u}'(x,t)$ are given fields, $\\Delta_o \\equiv||{\\bf u}(x,t_0)-{\\bf u}'(x,t_0)||$\n and $ ||f(x,t) ||^2 \\equiv \\int |f(x,t)|^2 dx$\nis a norm. $\\Delta(t) \\equiv||{\\bf u}(x,t)-{\\bf u}'(x,t)||$ stands for the global evolution of the difference between the fields.\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.98\\columnwidth]{4.pdf} \n\\caption{LLE estimation for the LCLV with optical feedback with \n$V_0=3.75V_{rms}$. a) Projected spatiotemporal diagram, line 1 and line 2 correspond to two close initial condition, b) \nIntensity profiles of line 1 and  2, c) A 3-D graph  that shows evolution of differences $\\Delta(t,V_0)$ for different applied voltages \n$V_0$, it can be noted that not always the trajectories are exponentially separated, and d) Temporal evolution of global \ndifference $\\Delta(t)$, dots stand for experimental data and the continuous curve is the exponential fitting $\\Delta(t) \n\\approx ae^{bt}+ce^{dt}$ with $a=0.1163$, $b=0.6258$, $c=7.598$ and $d=0.01465$.}\n\\label{Fig4}       \n\\end{figure}\n\nWhen $\\lambda_0$ is positive or negative, the perturbation of a given trajectory \nis characterized by an exponential  separation or approach, respectively.\nHence, attractors such as stationary patterns or uniform equilibrium are characterized by negative $\\lambda_0$.\nConversely, complex behaviors such as chaos and spatiotemporal chaos  exhibit positive $\\lambda_0$.\nDynamical behaviors with zero LLEs correspond to equilibrium with invariant directions, \nsuch as periodic or quasi-periodic solutions and non-chaotic attractors \n\\cite{Ott2002}. Therefore, the LLE is an exceptional order parameter for characterizing  \ntransitions from stationary to complex spatiotemporal dynamics.\n\n Experimentally, to estimate the LLE,  it is  mandatory to have two close initial conditions\nand observe if their evolution diverge at large times. \nThe implemented method needs, as a first step,  to find two close fields \n(see lines 1 and 2 in Figs.~\\ref{Fig4}a and  \\ref{Fig4}b) \nalong the projected  spatiotemporal \ndiagrams and compute their difference $\\Delta_0$. The temporal evolution of the difference should be \ngiven by $\\Delta(t) \\approx  \\Delta_0 e^{\\lambda_0 t}$ for large $t$ (cf  Figs.~\\ref{Fig4}c and \\ref{Fig4}d). \nDue to the complexity of evolution of the difference between fields---clearly the number of positive Lyapunov \nexponents is huge---we will consider at least two unstable growth directions,\nthat is  $\\Delta(t) \\approx ae^{bt}+ce^{dt}$ (cf. Fig.~\\ref{Fig4}).\n\n\\begin{figure}[t]\n\\includegraphics[width=0.95\\columnwidth]{5.pdf} \n\\caption{Bifurcation diagram constructed with the estimated LLE as a function of applied \nvoltage $V_0$ of the LCLV with optical feedback. The diagram is clearly separated in four dynamical \nregimes, stationary patters before $V_0=3.5V_{rms}$, chaos shadowed in gray (blue), intermittency between chaos and quasi-periodicity in light-gray (yellow) area and a window of quasi-periodicity shadowed at the end (orange). The stars correspond to the calculated \nLLE while the circles show the normalized mean intensity present in the LCLV. \nThe insets correspond to phase space reconstruction in the respective parameters.}\n\\label{Fig5}       \n\\end{figure}\n\n\nA bifurcation diagram was constructed with the obtained LLEs as can be seen in Fig.~\\ref{Fig5}. \nThe system starts with stationary stripe patterns at $V_0=3.0\\:V_{rms}$ and the dynamics remains unchanged until the \napplied voltage reached $V_0=3.5\\:V_{rms}$. At  this voltage, the LLE goes to zero, meaning that the system exhibits a bifurcation.\nExperimentally, we observed that the steady pattern changes to an aperiodic \nregime. The chaotic behavior remains until \nthe mean intensity in the LCLV \ndestroys  the chaotic attractor due to destructive interference at $V_0=3.9\\:V_{rms}$ (see \nFig.~\\ref{Fig5}), \ncausing a crisis. Once the light is recovered, the system enters in an intermittent regime between \nchaos and quasi-periodicity. After this window the system \nbecomes chaotic until the attractor is annihilated by destructive interference  at $V_0=5.35 \\:V_{rms}$. Once the light is recovered the \nsystem remains in a quasi-periodic regime until the next cycle of destructive interference arrives.   \nThis dynamic regime is characterized by having an oscillatory pattern which LLE is zero.\n\nGiven a temporal signal, the attractor of the system can be built by taking the signal \nat different periodic times (arbitrary periodic separation $\\tau$)  and constructing the vector \n$(I(x,t),I(x,t+\\tau,x),I(x,t+2\\tau),\\cdots)$\nwith $x$ as a fixed position, {\\it phase space \nreconstruction} \\cite{Abarbanel}. \nBottom panels of  Fig.~\\ref{Fig5} show three different attractors projected in three dimensions using this embedding method.\nFor low voltage a fixed point can be seen, \nthis behavior is observed when the stationary pattern is displayed in the LCLV.\nThe Points dispersion accounts for the inherent fluctuations of the system. Increasing the tension $V_0$, the phase space \nreconstruction exhibits a\ntorus,  which accounts for the quasi-periodic behavior observed \nat $V_0=4.65\\:V_{rms}$. For larger voltage,\nthe phase space reconstruction exhibits a strange attractor.\n\n\n Our study provides clear evidence that the LCLV with optical feedback is\nspatiotemporally chaotic in a certain range of parameters. The LLEs are experimentally accessible and allow us\nto characterize  the transitions from stationary to complex spatiotemporal dynamics.\nUsing the LLEs, one can reconcile the theory with experimental \nobservations.\n Certainly new concepts in the theory of dynamical systems must be developed to achieve a better experimental characterization of spatiotemporal complex behaviors. Notwithstanding, the LLE and power spectrum allow distinguishing well-established dynamical behaviors such as turbulence and spatiotemporal chaos, \nwhich are often merged and confuse.\n\n\\noindent {\\it Acknowledgements.} MGC and MW acknowledge the support of FONDECYT N$^{\\circ} 1150507$ and N$^{\\circ} 3140387$ respectively. \nVO acknowledges the support of the 'R\\'egion Nord-Pas-de-Calais'.\n\n\\bigskip\n\n\n$^{\\dagger}$Present address: Universit\\'e Lille1, Laboratoire de Physique des Lasers, Atomes et\nMol\\'ecules, CNRS UMR8523, 59655 Villeneuve d'Ascq Cedex, France\n\n\\begin{references}\n\n\\bibitem{Arecchi90}  Arecchi, F. T., Giacomelli, G., Ramazza, P. L. \\& Residori, S. \nExperimental evidence of chaotic itinerancy and spatiotemporal chaos in optics, \n{\\it Phys. Rev. Lett.} {\\bf 65}, 2531-2534 (1990).\n\n\\bibitem{Huyet} Huyet, G., Martinoni, M. C., Tredicce, J. R. \\&  Rica, S. \nSpatiotemporal dynamics of lasers with a large Fresnel number, \n{\\it Phys. Rev. Lett.} {\\bf 75}, 4027-4030  (1995).\n\n\\bibitem{Tredicce96} Huyet, G. \\& Tredicce, J. R. \nSpatio-temporal chaos in the transverse section of lasers, \n{\\it Physica. D} {\\bf 96} 209-214 (1996).\n\n\\bibitem{Mamaev98} Mamaev, A. V. \\& Saffman, M. \nSelection of unstable patterns and control of optical turbulence by Fourier plane filtering. \n{\\it Phys. Rev. Lett.} {\\bf 80}, 3499-4502 (1998).\n\n\n\\bibitem{Rogers2004}  Rogers, E. A., Kalra, R., Schroll, R. D., Uchida, A., Lathrop, D. P. \\& Roy, R. \nGeneralized synchronization of spatiotemporal chaos in a liquid crystal spatial light modulator. \n{\\it Phys. Rev. Lett.} {\\bf 93}, 084101 (2004).\n\n\\bibitem{ResidoriReport}  Residori, S.  Patterns, fronts and structures in a \nliquid-crystal-light-valve with optical feedback, {\\it Phys. Rep.} {\\bf 416}, 201-272 (2005).\n\n\\bibitem{PatternsOptics} Staliunas, K. \\& S\\'anchez-Morcillo J. \n{\\it Transverse patterns} (Springer Science $\\&$ Business Media, Berlin, 2003).\n\n\\bibitem{Descalzi2011} Descalzi, O., Clerc, M. G., Residori, S. \\& Assanto, G. (Eds.), \n{\\it Localized states in physics: solitons and patterns}, (Springer Science $\\&$ Business Media, Berlin Heidelberg, 2011).\n\n\\bibitem{Prigogine}   Nicolis, G. \\&  Prigogine, I., {\\sl Self-Organization in\nNon Equilibrium Systems} (J.Wiley \\& Sons, New York, 1977).\n\n\n\\bibitem{Nicolis} Nicolis, G. {\\it Introduction to Nonlinear Science} (Cambridge University press, \nCambridge, 1995).\n\n\n\\bibitem{DefectMediated} Coullet, P.  \\& Lega, J. Defect-mediated turbulence in wave patterns, \n{\\it Europhys. Lett.} {\\bf 7}, 511-516 (1988).\nCoullet, P., Gil,  L. \\& Lega, J. Defect-mediated turbulence, \n{\\it Phys. Rev. Lett.} {\\bf 62}, 1619-1622 (1989).\n\n\\bibitem{GorenEckmannProcaccia} Goren, G., Eckmann, J. P. \\& Procaccia, I. \nScenario for the onset of space-time chaos,\n{\\it Phys. Rev.  E} {\\bf 57}, 4106-4134 (1998).\n\n\\bibitem{Bodenschatz} Decker, W. , Pesch, W. \\& Weber, A. Spiral defect chaos in Rayleigh-Benard \nconvection, {\\it Phys. Rev. Lett.} {\\bf 73}, 648-651 (1994).\nEchebarria, B. \\& Riecke, H. Defect chaos of oscillating hexagons in rotating convection,\n{\\it Phys. Rev. Lett.}  {\\bf 84}, 4838-4841 (2000); \nDaniels, K. E. \\& Bodenschatz, E. Defect turbulence in inclined layer convection, \n{\\it Phys. Rev. Lett.}  {\\bf 88}, 034501 (2002).\n\n\\bibitem{Miranda} Miranda, M. \\& Burguete, J.  \nExperimentally observed route to spatiotemporal chaos in an extended one-dimensional \narray of convective oscillators,\n{\\it Phys. Rev. E} {\\bf 79}, 046201 (2009).\n\n\\bibitem{Limat} Brunet, P. \\& Limat, I.  \nDefects and spatiotemporal disorder in a pattern of falling liquid columns \n{\\it Phys.  Rev. E} {\\bf 70}, 046207 (2004).\n\n\\bibitem{Flesselles} Ouyang, Q. \\& Flesselles, J. M. \nTransition from spirals to defect turbulence driven by a convective instability,\n {\\it Nature (London)} {\\bf 379}, 143-146 (1996).\n\n\\bibitem{Weiss} Garfinkel, A., Spano, M. L., Ditto, W. L. \\& Weiss, J. N. \nControlling Cardiac Chaos. {\\it Science} {\\bf 257}, 1230-1235 (1992).\n\n\\bibitem{Zhou} Zhou, S. Q. \\& Ahlers, G.  \nSpatiotemporal chaos in electroconvection of a homeotropically aligned nematic liquid crystal,\n{\\it Phys. Rev. E}  {\\bf 74}, 046212 (2006).\n\n\\bibitem{Moon}  Moon, S. J., Shattuck, M. D., Bizon, C., Goldman, D. I., Swift, J. B. \\& Swinney, H. L.  \nPhase bubbles and spatiotemporal chaos in granular patterns,\n {\\it Phys.  Rev. E} {\\bf 65},  011301 (2001).\n\n\\bibitem{VBCR2013}    Verschueren N.,  Bortolozzo U., Clerc M.G. \\&  Residori S.\nSpatiotemporal chaotic localized\nstate in liquid crystal light valve experiments with optical feedback, \n{\\it Phys. Rev. Lett.} {\\bf 110}, 104101 (2013);\n{\\it Phil. Trans. R. Soc. A.}  {\\bf 372}, 20140011 (2014).\n\n\n\\bibitem{Manneville90}  Manneville P. {\\it Dissipative Structures and Weak Turbulence}\n(Academic Press, San Diego, 1990).\n\n \n\\bibitem{ClercOrtega2014}  Clerc, M. G.,  Falcon, C.,  Garcia-Nustes, M. A.,  Odent, V. \\&  Ortega, I. \nEmergence of spatiotemporal dislocation chains in drifting patterns,\n{\\it CHAOS} {\\bf  24}, 023133 (2014).\n\n\\bibitem{Louvergneaux2001}  Louvergneaux, E. \nPattern-Dislocation-Type Dynamical Instability in 1D Optical Feedback Kerr Media with \nGaussian Transverse Pumping, {\\it Phys. Rev. Lett.} {\\bf 87}, 244501 (2001).\n\n\n\\bibitem{Szwaj2005} Bielawski, S., Szwaj, C.,  Bruni, C.,  Garzella, D.,  Orlandi, G. L. \\&  Couprie, M. E. \nAdvection-Induced Spectrotemporal Defects in a Free-Electron Laser\n{\\it Phys. Rev. Lett.} {\\bf 95}, 034801 (2005).\n\n\n\\bibitem{Nicolis1995}  Nicolis, G., Introduction to Nonlinear Science (Cambridge\nUniversity Press, Cambridge, 1995).\n\n\\bibitem{Verschueren2013} Clerc, M. G. \\&  Verschueren, N. \nQuasiperiodicity route to spatiotemporal chaos in one-dimensional pattern-forming systems,\n{\\it Phys. Rev. E.} {\\bf 88}, 052916 (2013).\n\n\\bibitem{Bodenschatz2002}  Daniels, K. E. \\& Bodenschatz, E. Defect Turbulence in Inclined Layer Convection\n{\\it Phys. Rev. Lett.} {\\bf 88}, 034501 (2002).\n\n\\bibitem{Kuramoto84}  Kuramoto, Y. Chemical Oscillations, {\\it Waves, and Turbulence}\n(Springer, New York, 1984).\n\n\\bibitem{Frisch} Frisch, U., {\\it Turbulence: the legacy of AN Kolmogorov} (Cambridge university press, Cambridge, 1995).\n\n\\bibitem{Swinney85} Wolf, A., Swift, J. B., Swinney, H. L. \\& Vastano, J. A. \nDetermining the lyapunov exponents from a time series. \n{\\it Phys. D} {\\bf 16}, 285-317 (1985).\n\n\\bibitem{Ott2002}  Ott, E., {\\it Chaos in Dynamical Systems}, (2nd ed., Cambridge\nUniversity Press, Cambridge, 2002).\n\n \\bibitem{Abarbanel} Abarbanel, H. {\\it  Analysis of Observed Chaotic Data} (Springer-Verlag, New York,  1996).\n\n\\end{references}\n\n\n", "itemtype": "equation", "pos": 13737, "prevtext": "\nwhen $b_0$ is constant throughout the sample and $|x|>0$, $|y|>0$. The same applies to 1-D mask \nwith the only difference that $ |y| = 150\\: \\mu$m, which is small enough, compared with the \npattern wavelength, to neglect its size and consider it as a 1-D mask. In the presented configurations \n$I_0 =0.9\\: mW/cm^2$ and $b_0=0.1\\:mW/cm^2$.  The alternating voltage  $V_0$ has been varied between $3$ and $7$ $V_{rms}$, \nat a constant frequency $f_0=5\\:kHz$,\n starting with the appearance of stationary roll-patterns.\nFor different $V_0$ values, the dynamical behavior obtained \nin the system was recorded with a CCD  camera.\nFigure~\\ref{Fig2} shows the spatiotemporal \nevolution of the observed patterns in one and two dimensions, respectively. \nThis evolution is characterized by projected \nspatiotemporal diagrams,  which are constructed, in the 2-D experiments, \nby picking an arbitrary line---transversal to the \nrolls \ndirection---in the illuminated zone and superposing it as time evolves; \nin the 1-D experiments this  construction is simpler, is enough to superpose the pattern as the time evolves. \nThe system exhibits stationary  stripe patterns (cf. Fig.~\\ref{Fig2}a).\nThese patterns are  induced by a spatial filtering in the Fourier plane (cf. FP in Fig.~\\ref{Fig1}).  Actually, through a slit, \nwe can filter spatial modes and break the rotational symmetry. In this way, we forced the system just to present \nroll-patterns in a given direction. \n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.95\\columnwidth]{2.pdf} \n\\caption{Spatial textures in LCLV with optical feedback at different voltage $V_0$. Top panels \ncorrespond to  spatiotemporal diagrams of observed dynamics working with one-dimensional patterns. \nMiddle panels panels stand for projected spatiotemporal diagrams of two-dimensional textures. \n a) Periodic regime, b) quasi-periodic dynamics, c) chaotic behavior, \nand d) a 3-D spatiotemporal diagram of a complex texture at $V_0=4.3V{rms}$. All values were taken during $100~s$ and are normalized.}\n\\label{Fig2}       \n\\end{figure}\n\nIncreasing $V_0$, \nthe pattern begins to oscillate in a complex manner (see Fig.~\\ref{Fig2}b). \nWe observe in the projected spatiotemporal diagram  local\nwaves, oscillations and spatiotemporal dislocations.\nSimilar dynamics has been reported in one-dimensional inhomogeneous spatial \nsystems \\cite{ClercOrtega2014,Louvergneaux2001,Szwaj2005}.\nIn our experiments these inhomogeneities can be caused by the \ninherent imperfections and inhomogeneities \ninduced by the filter in the Fourier plane. Hence, this kind of dynamical \nbehavior could be expected.\nThe complex dynamics exhibited by this pattern \nis constantly repeated over time. Which leads us to infer that this kind of behavior \ncould be quasi-periodicity.\n\n \nFurther increasing $V_0$, the dynamics shown by the pattern becomes \nmore and more complex (cf. Fig.~\\ref{Fig2}c).\nClearly, in the projected spatiotemporal diagram, we detected an intermittent behavior. \nThat is, the pattern exhibits aperiodic oscillations invaded by large fluctuations, generating several \nspatial and temporal dislocations. Likewise, the system exhibits a high spatiotemporal complexity. \nThis kind of disorder is usually associated to spatiotemporal chaotic textures\n\\cite{Nicolis1995,Verschueren2013,Bodenschatz2002}.\nFigure \\ref{Fig2}d shows a 3-D spatiotemporal diagram, \nfrom this diagram it is clear that an arbitrarily chosen line represents the dynamics. \n\n\nA mathematical tool for analyze the spatial modes interaction is the Fourier spectrum.\nFigure \\ref{Fig3} shows the Fourier spectra of  different dynamical regimes. Showing that the \ndynamics changes between stripe patterns, quasi-periodicity and spatiotemporal chaotic textures. \nThe stationary pattern is characterized \nby a dominant wavelength $f$. The width of this peak is due to temperature fluctuations and \ndynamics of defects such as dislocations and boundary grains. The quasi periodic texture is characterized by the \nappearance of   incommensurable wavelengths, $\\{f',f'''\\}$, with respect to the main wavelength $f''$ and its harmonics. \nThe spatiotemporal  chaotic texture is characterized by presenting an enlarged spectrum \nas a result of the interaction between the  main  incommensurable modes \\cite{Kuramoto84}. \nNote that in this regime, the modes are coupled with \nexponential decay (see the dashed line in Fig.~\\ref{Fig3}). Therefore, \nthe system does not exhibit power spectrum behavior which is the hallmark \nof turbulence dynamics \\cite{Frisch}.\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.95\\columnwidth]{3.pdf} \n\\caption{Fourier spectra for three different dynamical regimes. In gray (blue) the Fourier spectrum \nof a stationary pattern, in light-gray (red) a quasi-periodic regime, it can be observed the emergence of \nincommensurable frequencies ($f'$, $f''$ and $f'''$). In black, a broadened spectrum that corresponds \nto a chaotic texture, presenting an exponential decay of the modes marked by the dashed line.}\n\\label{Fig3}       \n\\end{figure}   \n\n{\\it Quantifying the chaos.--} A characterization of complex dynamics \nlike chaos and spatiotemporal chaos\ncan be done by means of Lyapunov exponents. There are as many exponents\nas the dimension of the system under study. \nThe analytical study of Lyapunov exponents is a paramount \nendeavor and in practice inaccessible, then the pragmatic strategy \nis a numerical derivation of the exponents. \nFrom  experimental data, in the case of low-dimensional dynamical systems, \nby means of recognition \nof initial conditions one can determine the LLE \\cite{Swinney85}.\nThis exponent accounts for the greatest exponential growth\nand its defined by\n\n", "index": 3, "text": "\\begin{equation}\n\\lambda_0= \\lim_{t\\rightarrow \\infty} \\lim_{\\Delta_0 \\rightarrow 0} \\frac{1}{t} \n\\ln\\left[\\frac{\\left|\\left| {{\\bf u}(x,t)-{\\bf u}'(x,t)}\\right|\\right| }{\\left|\\left| {{\\bf u}(x,t_o)-{\\bf u}'(x,t_o)}\\right|\\right|}\\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{0}=\\lim_{t\\rightarrow\\infty}\\lim_{\\Delta_{0}\\rightarrow 0}\\frac{1}{t}%&#10;\\ln\\left[\\frac{\\left|\\left|{{\\bf u}(x,t)-{\\bf u}^{\\prime}(x,t)}\\right|\\right|}%&#10;{\\left|\\left|{{\\bf u}(x,t_{o})-{\\bf u}^{\\prime}(x,t_{o})}\\right|\\right|}\\right],\" display=\"block\"><mrow><mrow><msub><mi>λ</mi><mn>0</mn></msub><mo>=</mo><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>t</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi mathvariant=\"normal\">Δ</mi><mn>0</mn></msub><mo>→</mo><mn>0</mn></mrow></munder><mo>⁡</mo><mrow><mfrac><mn>1</mn><mi>t</mi></mfrac><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>[</mo><mfrac><mrow><mo fence=\"true\">||</mo><mrow><mrow><mi>𝐮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msup><mi>𝐮</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\">||</mo></mrow><mrow><mo fence=\"true\">||</mo><mrow><mrow><mi>𝐮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><msub><mi>t</mi><mi>o</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msup><mi>𝐮</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><msub><mi>t</mi><mi>o</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\">||</mo></mrow></mfrac><mo>]</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]