[{"file": "1601.01653.tex", "nexttext": "\nUnder the null hypothesis that edges are randomly assigned, we expect a mean number of shared edges to be 169.1 with the standard deviation of approximately 13.0. Consequently, the observed value of $n_k=2,763$ is about 200 standard deviations greater than the expected value. Therefore, under the null hypothesis, the number of edges present in both the Enrichr gene network and the PSICQUIC PPI network is extremely statistically significant.\n\nIt is conceivable that this result is due to users submitting gene set queries containing proteins known to have many interactors, and hence the null distribution we used for the calculation would be inappropriate and the result invalid.\n\nOne way to account for this is to condition the test on the frequency of each gene. To do this, we perform a separate hypergeometric test for each gene, and correct for multiple hypothesis testing. There are 899 proteins that have at least one interaction that overlaps with the Enrichr network; when corrected for multiple hypotheses testing, with a False Discovery Rate of 2\n\nAnother possible explanation for the apparently significant overlap between edges in the Enrichr gene network and the PSICQUIC PPI network is that there are a significant number of user queries containing genes with known PPIs. To address this, we recovered the Enrichr lists that contribute to the prediction of at least one PPI and counted the number of proteins in each query list for which there is another protein in the query with which it interacts. If a user submitted a list of proteins with known protein interactions, then the ratio of the counted proteins to the length of the query will be large. We note that the actual ratio is less than 1\\%, which suggests that users are not submitting gene sets with known PPIs to Enrichr to any significant degree. This suggests that the significant overlap in the edges in the gene network inferred from Enrichr submissions is predictive of known and potentially novel protein-protein interactions.\n\nWe show the network of edges between genes that are present in both the Enrichr-inferred gene network and the PSICQUIC PPI network (Fig. \\ref{fig-rePPI}).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{PPI-Sub-01.pdf}\n\\caption{The part of the network of the gene-gene associations inferred from Enrichr that is also supported by known protein-protein interactions from PSICQUIC.}\n\\label{fig-rePPI}\n\\end{figure}\n\n\n\\subsection{Evaluating the recapitulation of prior knowledge about gene functions with the gene-gene association network inferred from Enrichr queries}\nWe took a collection of 28 annotated gene set libraries that represent prior knowledge of associations between genes and their functions from a range of biological themes, including Gene Ontology, mouse phenotypes, protein complexes, histone modifications and DNA binding. We addressed the question of the extent to which the information in these gene set libraries is recapitulated by the gene-gene association networks inferred by Enrichr queries.\n\nIn order to test this for a single gene set, we mapped the genes in the set to nodes in the Enrichr queries gene-gene association network, and then calculated the mean point-wise mutual information between each pair of genes. In order to assess the significance of this collective measure of similarity, we numerically calculated a null distribution by randomly choosing a set of nodes in the Enrichr queries' network with the same cardinality as the gene set in question. The random choice was weighted by the overall frequency of the gene in the gene set library from which it originates. This is equivalent to generating a null distribution based on random permutation of the gene set library repeated many times. By comparing the actual collective similarity to the null distribution, we calculate a significance p value for the collective similarity of the gene set in the Enrichr queries' gene-gene association network. A small p value indicates that the members of the gene set in question are significantly more similar to each other in the network inferred by Enrichr queries than would be expected if the gene set library from which the set was originated was randomly permuted. We interpret a small p value as indicating that the network inffered by the Enrichr queries has recovered the gene set in question. The list of all gene set libraries examined (Table \\ref{table-gmtdata}).\n\n\n\\begin{table}\n\\caption{Gene set libraries used to assess recovery of functional associations by the network inferred from the Enrichr queries.}\n\\label{table-gmtdata}\n\\centering\n\\begin{tabular}{l c c}\n\tGene Set Library& \\# of Sets &Mean Set Size\\\\\n\t\\hline\n\t\n\nBioCarta pathways\t&\t249\t&\t18 \\\\\nCancer Cell Line Encyclopedia\t&\t967\t&\t176\\\\\nChEA\t&\t240\t&\t1456\\\\\nChromosome location\t&\t386\t&\t85\\\\\nCORUM\t&\t1673\t&\t5\\\\\nGene Ontology Biological Process\t&\t941\t&\t78\\\\\nGene Ontology Cellular Component\t&\t205\t&\t172\\\\\nGene Ontology Molecular Function\t&\t402\t&\t122\\\\\nGeneSigDB\t&\t2139\t&\t127\\\\\nGenome Browser PWMs\t&\t615\t&\t275\\\\\nHMDB Metabolites\t&\t3906\t&\t47\\\\\nHuman Gene Atlas\t&\t84\t&\t450\\\\\nKEA\t&\t474\t&\t37\\\\\nKEGG pathways\t&\t200\t&\t48\\\\\nMGI MP top 3\t&\t71\t&\t717\\\\\nMGI MP top 4\t&\t476\t&\t202\\\\\nmicroRNAs\t&\t222\t&\t155\\\\\nMouse Gene Atlas\t&\t96\t&\t660\\\\\nNCI60\t&\t93\t&\t343\\\\\nNURSA-IP-MS\t&\t1796\t&\t158\\\\\nOMIM disease genes\t&\t90\t&\t25\\\\\nOMIM Expanded\t&\t187\t&\t89\\\\\nPfam-InterPro-domains\t&\t311\t&\t35\\\\\nPPI Hub Proteins\t&\t385\t&\t247\\\\\nReactome pathways\t&\t78\t&\t73\\\\\nTF PPIs\t&\t290\t&\t79\\\\\nVirusMINT\t&\t85\t&\t15\\\\\nWikiPathways pathways\t&\t199\t&\t39\\\\\n\t\n\\end{tabular}\n\\end{table}\n\n\nAfter correcting for multiple hypotheses testing and setting a false discovery rate threshold of 1\\%, we counted the number of gene sets in each library that are significantly recovered in the Enrichr queries' gene-gene network (Fig. \\ref{fig-reGMT}).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{gmt-comparisions-EnrichR-01.pdf}\n\\caption{The proportion of gene sets in each library that are significantly clustered in the gene-gene association network inferred from queries to Enrichr.}\n\\label{fig-reGMT}\n\\end{figure}\n\nWe observed that for some libraries, over 30\\% of the gene sets in the library are recoverable by the Enrichr queries' gene-gene association network. \nThe libraries containing data from genome-wide gene expression profiling have the most overlap, followed by ChEA, which has lists of genes associated with transcription factors from ChIP-seq profiling. Next are pathway libraries such as reactome, KEGG and WikiPathways. This rank order of libraries likely reflects the nature of most submitted lists to analysis with Enrichr. These query submissions are likely dominated by differentially expressed genes from genome-wide mRNA profiling. The recovery of annotated pathways suggests that the inferred gene-gene association network likely contains new and more complete pathway knowledge.      \n\n\\section{Discussion and Conclusions}\n\nIn this study, we analyzed for the first time, a large collection of gene set queries submitted by the many users of the popular enrichment analysis tool Enrichr. We examined the distribution of occurrence of genes, the length of submitted gene sets, and the distribution of submissions by individual users. We show that the distribution of gene occurrence in queries is complex, with some genes appearing often in submitted lists. The length of gene set queries peaks at 200-400 genes per query, and the distribution of submitters follows a power law. By constructing a gene-gene association network of co-occurrence, we were able to show that such a network captures known protein-protein interactions and functional associations much more frequently than by chance. This means that the collective data from thousands of queries potentially holds new knowledge about the local and global structure of the human functional interactome. As more submissions accumulate, it is expected that such predictions will be refined and improved. While experimental validation of these predictions is outside the scope of this present work, the gene-gene association network resource we developed here can be used to prioritize predictions for general and specific hypotheses that can be tested experimentally and systematically drive rational research explorations. The reuse of privately submitted gene sets by the Enrichr users should be handled with caution. The analysis that we conducted here and the gene-gene association networks we constructed keep the identities of users private. Furthermore, we do not provide the gene sets used for our analysis publicly.   \n\n\\section{Methods}\n\\subsection{Data Preprocessing}\nAs of June 25th 2015, 172,798 queries of gene sets were submitted to Enrichr from 5,114 unique IP addresses. In order to analyze the global structure of these gene sets, preprocessing was necessary because the raw data include multiple instances of the example data set supplied by the Enrichr website for demonstration purposes, special characters and strings that cannot be interpreted as gene lists caused by erroneous input from users, and large collections of queries from individual users who utilized the Enrichr API. These entries were removed so that the resulting dataset is representative of the entire community of Enrichr users and is not dominated by any individual user or small subset thereof.\n\nThe first filter was applied to retain only word strings that are members of a reference set of 39920 standard human, mouse and rat gene names. The resulting sets of genes corresponding to each user input list was then subjected to a sequence of subsequent filters.\n\nUse of the Enrichr API enables programmatic access to Enrichr. This resulted in a minority of users submitting a large number of gene lists. In order for the data set to be balanced and representative of the entire community of Enrichr users, and not dominated by a small minority of users, we filtered out gene lists associated with IP addresses from which large numbers of lists were received.\n\nThe results of 11,579 differential expression analyses were received from the GEO2Enrichr Chrome Extension, which submits three gene sets for every differential expression computation for analysis with Enrichr: upregulated, down regulated and combined gene sets, respectively. Only the combined gene sets were retained in this analysis.\n\nGene sets that contained more than 2,000 genes were rejected on the basis that they were non-specific and incurred undue computational expense in subsequent analysis. \n\nFinally, all instances of the demonstration gene set from the Enrichr website were removed. The result was 19,196 gene sets composed of 27,770 genes supplied from 3,308 unique IP addresses.\n\n\\subsection{Network Inference}\nWe employ the methods described in \\cite{kumar2012logical} to reconstruct networks from the filtered gene sets. \n\nThe most basic approach to construct a network from a large collection of gene sets is to define a distance matrix between the gene sets and examine the resulting distance matrix. The most obvious similarity measure between two gene sets A and B is the Jaccard index:\n\n", "itemtype": "equation", "pos": 14134, "prevtext": "\n\n\n\n\\title{Large Collection of Diverse Gene Set Search Queries Recapitulate Known Protein-Protein Interactions and Gene-Gene Functional Associations}\n\n\n\n\n\n\\author{\\IEEEauthorblockN{Neil R. Clark$^{1,2,3}$, Avi Ma'ayan$^{1,2,3, *}$}\n\\IEEEauthorblockA{$^1$Department of Pharmacology and Systems Therapeutics, Icahn School of Medicine at Mount Sinai, \\\\\nOne Gustave L Levy Place, Box 1215, New York, NY, USA \\\\\n$^2$Big Data to Knowledge (BD2K) Library of Integrated Network-based Cellular Signatures (LINCS) \\\\ \nData Coordination and Integration Center (DCIC)\\\\ \n$^3$Mount Sinai Knowledge Management Center (KMC)\nfor Illuminating the Druggable Genome (IDG)\\\\\n$^*$Corresponding author:\navi.maayan@mssm.edu\n}\n\n}\n\n\\maketitle\n\n\n\\begin{abstract}\n\nPopular online enrichment analysis tools from the field of molecular systems biology provide users with the ability to submit their experimental results as gene sets for individual analysis. Such queries are kept private, and have never before been considered as a resource for integrative analysis. By harnessing gene set query submissions from thousands of users, we aim to discover biological knowledge beyond the scope of an individual study. In this work, we investigated a large collection of gene sets submitted to the tool Enrichr by thousands of users. Based on co-occurrence, we constructed a global gene-gene association network. We interpret this inferred network as providing a summary of the structure present in this crowdsourced gene set library, and show that this network recapitulates known protein-protein interactions and functional associations between genes. This finding implies that this network also offers predictive value. Furthermore, we visualize this gene-gene association network using a new edge-pruning algorithm that retains both the local and global structures of large-scale networks. Our ability to make predictions for currently unknown gene associations, that may not be captured by individual researchers and data sources, is a demonstration of the potential of harnessing collective knowledge from users of popular tools in the field of molecular systems biology.\n\nKeywords - gene sets, big data, item set mining\n\\end{abstract}\n\n\n\n\\IEEEpeerreviewmaketitle\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\nSystems approaches to genome-wide molecular data are increasingly using gene sets, as opposed to individual genes, as the basic units of analysis. For example, in the field of molecular diagnostics, biomarker sets, as opposed to single gene biomarkers, are increasingly being applied \\cite{wang2008gene}. Beyond molecular diagnostics, genomics, transcriptomics and proteomics experiments often identify gene sets that are differentially expressed, or gene sets that contain genetic variations associated with a phenotype. Using methods such as enrichment analyses \\cite{chen2013enrichr,huang2009bioinformatics, subramanian2005gene}, common biological functions can illuminate prior knowledge originating from the collection of experimentally identified gene sets.\n\nOne approach to enrichment analysis is to take a set of experimentally identified genes and analyze these genes by comparing them to a library of gene sets with a known associated biological theme, e.g., members of cell signaling pathways, or targets of transcription factors.  Enrichr \\cite{chen2013enrichr} is a popular online tool we developed to enable users to submit gene sets for this type of analysis. Since its launch in 2013, over 900,000 gene sets have been submitted to Enrichr by over 25,000 unique users. These gene sets originate from diverse experimental platforms, profiling genes and proteins at various regulatory levels of mammalian molecular data.\n\nWe hypothesize that the gene set submitted to Enrichr may contain patterns and structure that could reveal novel associations between genes, gene modules and molecular biological mechanisms. The large size of this data set and the diversity of the scientific community from which it originates potentially provide a unique perspective that may reveal new insights.\n\nIn combinatorial mathematical terms, the nearly 1 million gene sets that were submitted to Enrichr comprise a family of sets, i.e., a collection of subsets from the set of all genes in the human, mouse and rat genomes. A common approach to the analysis of this form of data is to treat each set as an item-set in analogy to a market basket, and identify frequently occurring combinations of items \\cite{brin1997dynamic}. An alternative has been proposed in which item-sets that are logically related are identified \\cite{kumar2012logical}. The identification of logical item-sets is particularly relevant for the gene sets submitted to Enrichr because this approach takes into account rare items, and because biological knowledge is incomplete, logically associated groups of items may only be partially represented in any given basket. These are important properties, as we aim to identify functional modules even for rarely occurring genes. We expect that due to partial information contained within an individual query, not all members of a relevant functional module will be present in any given gene set submitted for analysis with Enrichr. This partial information is expected to produce high level of false positive associations. Due to the expected high false positive rates, a degree of noise-filtering may also improve the accuracy of  such analysis.\n\nHere we provide an interpretable picture of the global properties of a large collection of the lists submitted to Enrichr by thousands of users. To accomplish this we employ the method of logical item-set to extract gene modules. As a consequence, we infer a network of relationships between genes and visualize this network using a novel edge-pruning method we devised. Next, we examine the degree of compatibility of our findings with annotated gene set libraries such as the Human Gene Atlas or the Gene Ontology (GO), as well as with known protein-protein interactions.\n\n\\section{Results}\nBy the middle of 2015, the Enrichr gene set queries consisted of 172,798 gene sets submitted from 5,114 unique internet protocol (IP) addresses. Our analysis began by applying a number of filters. First, we removed any query that did not correspond to an official gene symbol. Next, we ensured that no individual users dominated in their contributions to the data set by removing all entries from users that contributed many gene sets (see methods for more details). After this strict cleaning criteria, the result was a family of 19,196 gene sets, composed of 27,770 genes supplied from 3,308 unique IP addresses of unique users of Enrichr.\n\n\\subsection{Enrichr gene set library metrics}\nThe distribution of gene frequencies is surprisingly complex (Fig. \\ref{fig-genefreqdist}). The distribution approximately decays exponentially from frequencies greater than ~300; however, the lower frequencies are characterized by a bimodal distribution. The large mode at the lowest frequencies has an overrepresentation of uncharacterized genes, gene names with no functional associations or known protein-protein interactions; but even discounting those genes, this peak remains relatively large. The lower frequencies are also characterized by a mode at around 200 occurrences. The frequency of occurrence of genes in submissions to Enrichr has a characteristic frequency that decays exponentially, as opposed to being characterized by a power law. Given the predominance of scale-free distributions, it is perhaps surprising that there is a definite scale for frequencies of gene occurrence in this data set. \n\nThe distribution of the lengths of gene sets submitted to Enrichr approximately fits a power-law, with a notable peak at about 200 and 400 genes (Fig. \\ref{fig-linelengths}). The distribution of the number of submissions to Enrichr per user IP address also follows a power-law, suggesting that most users submit only a few lists, but there is a substantial body of heavy users.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{plot_genefreq_EnichR-02.pdf}\n\\caption{ The distribution of the occurrences of unique gene symbols in Enrichr gene set queries.}\n\\label{fig-genefreqdist}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{linelengths-02.pdf}\n\\caption{ The distribution of the size of each gene set query submitted to Enrichr.}\n\\label{fig-linelengths}\n\\end{figure}\n\n\\subsection{Gene-gene and gene-set/gene-set network inference}\nThe Enrichr collection of gene set queries can be transposed, such that for each gene there is an associated set of Enrichr submission queries. To explore the structure in this data, and also to potentially form the basis for an informative decomposition of the data, we can infer networks of similarities between gene pairs and, in addition, networks of Enricr queries. We employ the methods developed in \\cite{kumar2012logical} to infer noise-filtered networks of associations between these entities.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=6in]{GeneNetPlot-AdultOnsetDiabetes-01.pdf}\n\\caption{The edge-pruned network of gene associations inferred from Enrichr queries. (a) The global view of the network. (b) A selection of the largest local network structures. (c) As an example of one possible use of this network, we highlight genes known to be associated with adult-onset diabetes (KEGG) and illustrate the local network structure that includes at least one of these genes.}\n\\label{fig-genenetwork}\n\\end{figure*}\n\nIn order to visualize the network of gene associations, we employ an edge-pruning algorithm that results in an interpretable representation of the global network structure while preserving local features of the network topology (Fig. \\ref{fig-genenetwork}a). A selection of the largest local structures, preserved by the edge pruning algorithm, is shown in Fig. \\ref{fig-genenetwork}b. One potential use of this network is to make predictions of novel associations based on prior knowledge. As an example of this, we highlight genes known to be associated with Adult Onset Diabetes (KEGG) (Fig. \\ref{fig-genenetwork}c). Illustrating local network structures that include at least one of these genes suggests local structures as candidate novel predictions for genes likely associated with the adult-onset diabetes pathway.\n\nOne of the local structures contains the adult-onset diabetes Genes MAFA and NEUROG3 (KEGG) along with two other genes, UTS2R and FLJ45717, that are not identified in KEGG as being associated with diabetes. However, UTS2 and its receptor UTS2R have been reported \\cite{jiang2008comparative} to be involved in glucose metabolism and insulin resistance, which lead to the development of type-2 diabetes in humans. There is no known association of FLJ45717 with diabetes; however, as this gene forms the center of a star graph local structure, we consider it a novel candidate for involvement in adult-onset diabetes.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=6in]{LinesNetPlot-01.pdf}\n\\caption{The edge-pruned network of associations between query submissions to Enrichr. (a) The global view of the network. (b) A selection of the largest local structures. (c) The gene sets submitted by the five Enrichr users with the largest number of submissions are highlighted, each with a different color.}\n\\label{fig-linenetwork}\n\\end{figure*}\n\nWe can also apply the same approach to the network of associations between gene set queries submitted to Enrichr (Fig. \\ref{fig-linenetwork}). This network appears to show a degree of clustering by user; this perhaps reflects individual users special research interests, or a common method of data acquisition.\n\n\\subsection{Comparing the clustering of Enrichr networks to random scale-free networks}\nThe clustering coefficients of the gene and gene-set networks are 0.43 and 0.17, respectively. In order to gauge the significance of this, we compared these clustering coefficients to the typical clustering coefficients for a random scale-free network generated by the Barabasi-Albert random scale-free graph model. Artificial shuffled networks of a similar size and degree distribution generated by the Barabasi-Albert model have a typical clustering coefficient of 0.0026 and 0.0054 respectively. Hence, we see that the Enrichr queries gene, and gene-set, networks have a clustering coefficient which is orders of magnitude greater than would be expected if the networks were randomly scale-free by the Barabasi-Albert model.\n\n\\subsection{Examining the gene network for recovery of known protein-protein interactions}\nNext, we asked whether the gene-gene association network created from the Enrichr queries can be used to predict physical protein interactions. We used the PSICQUIC database of protein-protein interactions (PPIs) and examined the statistical significance of the overlap between the PSICQUIC PPI network and the gene-gene network inferred from Enrichr submissions. After applying a threshold of 0.3 for the similarity of a normalized point-wise mutual information for the gene-gene association network, two binary matrices remained.\n\nIn the first test of the significance of the similarity between these two binary matrices, we count the number of non-zero entries in each matrix and the number of elements that are nonzero in both matrices. Based on a null distribution whereby the matrices are randomly permuted, we can use the hypergeometric distribution to quantify the significance of the overlap between the two matrices.\n\nThere are $n_1=13,586$ genes that are in both the Enrichr queries network and the PSICQUIC PPI network. With a threshold on the normalized point-wise mutual information of 0.05, there are $n_1=99,758$ edges in the Enrichr network and $n_2=156,388$ known PPIs. There are $n_k=2,763$ edges that are present in both the Enrichr network and the PSICQUIC PPI network. In this regime, the Poisson approximation to the hypergeometric distribution is applicable. With a total number of possible edges given by $n_g (1-n_g)$, the rate parameter for the Poisson distribution is given by:\n\n", "index": 1, "text": "\\begin{equation}\n\\frac{n_1 n_2}{n_g (1-n_g)}=169.1\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{n_{1}n_{2}}{n_{g}(1-n_{g})}=169.1\" display=\"block\"><mrow><mfrac><mrow><msub><mi>n</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>n</mi><mn>2</mn></msub></mrow><mrow><msub><mi>n</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>n</mi><mi>g</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mn>169.1</mn></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nLet the set of all elements be V, and the family of sets be M, then:\n\n", "itemtype": "equation", "pos": 25331, "prevtext": "\nUnder the null hypothesis that edges are randomly assigned, we expect a mean number of shared edges to be 169.1 with the standard deviation of approximately 13.0. Consequently, the observed value of $n_k=2,763$ is about 200 standard deviations greater than the expected value. Therefore, under the null hypothesis, the number of edges present in both the Enrichr gene network and the PSICQUIC PPI network is extremely statistically significant.\n\nIt is conceivable that this result is due to users submitting gene set queries containing proteins known to have many interactors, and hence the null distribution we used for the calculation would be inappropriate and the result invalid.\n\nOne way to account for this is to condition the test on the frequency of each gene. To do this, we perform a separate hypergeometric test for each gene, and correct for multiple hypothesis testing. There are 899 proteins that have at least one interaction that overlaps with the Enrichr network; when corrected for multiple hypotheses testing, with a False Discovery Rate of 2\n\nAnother possible explanation for the apparently significant overlap between edges in the Enrichr gene network and the PSICQUIC PPI network is that there are a significant number of user queries containing genes with known PPIs. To address this, we recovered the Enrichr lists that contribute to the prediction of at least one PPI and counted the number of proteins in each query list for which there is another protein in the query with which it interacts. If a user submitted a list of proteins with known protein interactions, then the ratio of the counted proteins to the length of the query will be large. We note that the actual ratio is less than 1\\%, which suggests that users are not submitting gene sets with known PPIs to Enrichr to any significant degree. This suggests that the significant overlap in the edges in the gene network inferred from Enrichr submissions is predictive of known and potentially novel protein-protein interactions.\n\nWe show the network of edges between genes that are present in both the Enrichr-inferred gene network and the PSICQUIC PPI network (Fig. \\ref{fig-rePPI}).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{PPI-Sub-01.pdf}\n\\caption{The part of the network of the gene-gene associations inferred from Enrichr that is also supported by known protein-protein interactions from PSICQUIC.}\n\\label{fig-rePPI}\n\\end{figure}\n\n\n\\subsection{Evaluating the recapitulation of prior knowledge about gene functions with the gene-gene association network inferred from Enrichr queries}\nWe took a collection of 28 annotated gene set libraries that represent prior knowledge of associations between genes and their functions from a range of biological themes, including Gene Ontology, mouse phenotypes, protein complexes, histone modifications and DNA binding. We addressed the question of the extent to which the information in these gene set libraries is recapitulated by the gene-gene association networks inferred by Enrichr queries.\n\nIn order to test this for a single gene set, we mapped the genes in the set to nodes in the Enrichr queries gene-gene association network, and then calculated the mean point-wise mutual information between each pair of genes. In order to assess the significance of this collective measure of similarity, we numerically calculated a null distribution by randomly choosing a set of nodes in the Enrichr queries' network with the same cardinality as the gene set in question. The random choice was weighted by the overall frequency of the gene in the gene set library from which it originates. This is equivalent to generating a null distribution based on random permutation of the gene set library repeated many times. By comparing the actual collective similarity to the null distribution, we calculate a significance p value for the collective similarity of the gene set in the Enrichr queries' gene-gene association network. A small p value indicates that the members of the gene set in question are significantly more similar to each other in the network inferred by Enrichr queries than would be expected if the gene set library from which the set was originated was randomly permuted. We interpret a small p value as indicating that the network inffered by the Enrichr queries has recovered the gene set in question. The list of all gene set libraries examined (Table \\ref{table-gmtdata}).\n\n\n\\begin{table}\n\\caption{Gene set libraries used to assess recovery of functional associations by the network inferred from the Enrichr queries.}\n\\label{table-gmtdata}\n\\centering\n\\begin{tabular}{l c c}\n\tGene Set Library& \\# of Sets &Mean Set Size\\\\\n\t\\hline\n\t\n\nBioCarta pathways\t&\t249\t&\t18 \\\\\nCancer Cell Line Encyclopedia\t&\t967\t&\t176\\\\\nChEA\t&\t240\t&\t1456\\\\\nChromosome location\t&\t386\t&\t85\\\\\nCORUM\t&\t1673\t&\t5\\\\\nGene Ontology Biological Process\t&\t941\t&\t78\\\\\nGene Ontology Cellular Component\t&\t205\t&\t172\\\\\nGene Ontology Molecular Function\t&\t402\t&\t122\\\\\nGeneSigDB\t&\t2139\t&\t127\\\\\nGenome Browser PWMs\t&\t615\t&\t275\\\\\nHMDB Metabolites\t&\t3906\t&\t47\\\\\nHuman Gene Atlas\t&\t84\t&\t450\\\\\nKEA\t&\t474\t&\t37\\\\\nKEGG pathways\t&\t200\t&\t48\\\\\nMGI MP top 3\t&\t71\t&\t717\\\\\nMGI MP top 4\t&\t476\t&\t202\\\\\nmicroRNAs\t&\t222\t&\t155\\\\\nMouse Gene Atlas\t&\t96\t&\t660\\\\\nNCI60\t&\t93\t&\t343\\\\\nNURSA-IP-MS\t&\t1796\t&\t158\\\\\nOMIM disease genes\t&\t90\t&\t25\\\\\nOMIM Expanded\t&\t187\t&\t89\\\\\nPfam-InterPro-domains\t&\t311\t&\t35\\\\\nPPI Hub Proteins\t&\t385\t&\t247\\\\\nReactome pathways\t&\t78\t&\t73\\\\\nTF PPIs\t&\t290\t&\t79\\\\\nVirusMINT\t&\t85\t&\t15\\\\\nWikiPathways pathways\t&\t199\t&\t39\\\\\n\t\n\\end{tabular}\n\\end{table}\n\n\nAfter correcting for multiple hypotheses testing and setting a false discovery rate threshold of 1\\%, we counted the number of gene sets in each library that are significantly recovered in the Enrichr queries' gene-gene network (Fig. \\ref{fig-reGMT}).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{gmt-comparisions-EnrichR-01.pdf}\n\\caption{The proportion of gene sets in each library that are significantly clustered in the gene-gene association network inferred from queries to Enrichr.}\n\\label{fig-reGMT}\n\\end{figure}\n\nWe observed that for some libraries, over 30\\% of the gene sets in the library are recoverable by the Enrichr queries' gene-gene association network. \nThe libraries containing data from genome-wide gene expression profiling have the most overlap, followed by ChEA, which has lists of genes associated with transcription factors from ChIP-seq profiling. Next are pathway libraries such as reactome, KEGG and WikiPathways. This rank order of libraries likely reflects the nature of most submitted lists to analysis with Enrichr. These query submissions are likely dominated by differentially expressed genes from genome-wide mRNA profiling. The recovery of annotated pathways suggests that the inferred gene-gene association network likely contains new and more complete pathway knowledge.      \n\n\\section{Discussion and Conclusions}\n\nIn this study, we analyzed for the first time, a large collection of gene set queries submitted by the many users of the popular enrichment analysis tool Enrichr. We examined the distribution of occurrence of genes, the length of submitted gene sets, and the distribution of submissions by individual users. We show that the distribution of gene occurrence in queries is complex, with some genes appearing often in submitted lists. The length of gene set queries peaks at 200-400 genes per query, and the distribution of submitters follows a power law. By constructing a gene-gene association network of co-occurrence, we were able to show that such a network captures known protein-protein interactions and functional associations much more frequently than by chance. This means that the collective data from thousands of queries potentially holds new knowledge about the local and global structure of the human functional interactome. As more submissions accumulate, it is expected that such predictions will be refined and improved. While experimental validation of these predictions is outside the scope of this present work, the gene-gene association network resource we developed here can be used to prioritize predictions for general and specific hypotheses that can be tested experimentally and systematically drive rational research explorations. The reuse of privately submitted gene sets by the Enrichr users should be handled with caution. The analysis that we conducted here and the gene-gene association networks we constructed keep the identities of users private. Furthermore, we do not provide the gene sets used for our analysis publicly.   \n\n\\section{Methods}\n\\subsection{Data Preprocessing}\nAs of June 25th 2015, 172,798 queries of gene sets were submitted to Enrichr from 5,114 unique IP addresses. In order to analyze the global structure of these gene sets, preprocessing was necessary because the raw data include multiple instances of the example data set supplied by the Enrichr website for demonstration purposes, special characters and strings that cannot be interpreted as gene lists caused by erroneous input from users, and large collections of queries from individual users who utilized the Enrichr API. These entries were removed so that the resulting dataset is representative of the entire community of Enrichr users and is not dominated by any individual user or small subset thereof.\n\nThe first filter was applied to retain only word strings that are members of a reference set of 39920 standard human, mouse and rat gene names. The resulting sets of genes corresponding to each user input list was then subjected to a sequence of subsequent filters.\n\nUse of the Enrichr API enables programmatic access to Enrichr. This resulted in a minority of users submitting a large number of gene lists. In order for the data set to be balanced and representative of the entire community of Enrichr users, and not dominated by a small minority of users, we filtered out gene lists associated with IP addresses from which large numbers of lists were received.\n\nThe results of 11,579 differential expression analyses were received from the GEO2Enrichr Chrome Extension, which submits three gene sets for every differential expression computation for analysis with Enrichr: upregulated, down regulated and combined gene sets, respectively. Only the combined gene sets were retained in this analysis.\n\nGene sets that contained more than 2,000 genes were rejected on the basis that they were non-specific and incurred undue computational expense in subsequent analysis. \n\nFinally, all instances of the demonstration gene set from the Enrichr website were removed. The result was 19,196 gene sets composed of 27,770 genes supplied from 3,308 unique IP addresses.\n\n\\subsection{Network Inference}\nWe employ the methods described in \\cite{kumar2012logical} to reconstruct networks from the filtered gene sets. \n\nThe most basic approach to construct a network from a large collection of gene sets is to define a distance matrix between the gene sets and examine the resulting distance matrix. The most obvious similarity measure between two gene sets A and B is the Jaccard index:\n\n", "index": 3, "text": "\\begin{equation}\nJ(A,B)=\\frac{|A\\cap B|}{|A \\cup B|}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"J(A,B)=\\frac{|A\\cap B|}{|A\\cup B|}\" display=\"block\"><mrow><mrow><mi>J</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>A</mi><mo>,</mo><mi>B</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mo stretchy=\"false\">|</mo><mrow><mi>A</mi><mo>∩</mo><mi>B</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>A</mi><mo>∪</mo><mi>B</mi></mrow><mo stretchy=\"false\">|</mo></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nand the co-occurrence counts of pairs of genes is given by:\n\n", "itemtype": "equation", "pos": 25468, "prevtext": "\nLet the set of all elements be V, and the family of sets be M, then:\n\n", "index": 5, "text": "\\begin{equation}\nM=\\left\\{m^{(n)}=\\left\\{m_l^{(n)}\\right\\}_{l=1}^{L_n }\\subset V \\right\\}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"M=\\left\\{m^{(n)}=\\left\\{m_{l}^{(n)}\\right\\}_{l=1}^{L_{n}}\\subset V\\right\\}\" display=\"block\"><mrow><mi>M</mi><mo>=</mo><mrow><mo>{</mo><msup><mi>m</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><msubsup><mrow><mo>{</mo><msubsup><mi>m</mi><mi>l</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>}</mo></mrow><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>L</mi><mi>n</mi></msub></msubsup><mo>⊂</mo><mi>V</mi><mo>}</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\n\nwhere $\\delta(bool)$ is a Dirac delta function defined such that:\n\n", "itemtype": "equation", "pos": 25633, "prevtext": "\nand the co-occurrence counts of pairs of genes is given by:\n\n", "index": 7, "text": "\\begin{equation}\n\\phi(\\alpha,\\beta)=\\sum_{n=1}^N \\delta(\\alpha \\in m^{(n)}) \\delta(\\beta \\in m^{(n)})\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\phi(\\alpha,\\beta)=\\sum_{n=1}^{N}\\delta(\\alpha\\in m^{(n)})\\delta(\\beta\\in m^{(%&#10;n)})\" display=\"block\"><mrow><mi>ϕ</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>∈</mo><msup><mi>m</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo stretchy=\"false\">)</mo></mrow><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>β</mi><mo>∈</mo><msup><mi>m</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\n\nThe marginal counts are then defined in terms of the co-occurrence counts as:\n\n", "itemtype": "equation", "pos": 25817, "prevtext": "\n\nwhere $\\delta(bool)$ is a Dirac delta function defined such that:\n\n", "index": 9, "text": "\\begin{equation*}  \n\\delta(bool)=\n\t\\begin{cases} \n\t\t1 & \\text{if} bool=True, \\\\\n\t\t0 & \\text{Otherwise}    \n\t\\end{cases}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\delta(bool)=\\begin{cases}1&amp;\\text{if}bool=True,\\\\&#10;0&amp;\\text{Otherwise}\\end{cases}\" display=\"block\"><mrow><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>b</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mn>1</mn></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext>if</mtext><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi></mrow><mo>=</mo><mrow><mi>T</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>e</mi></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"left\"><mtext>Otherwise</mtext></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\n\nwhich is the number of all co-occurrences. Finally, the total number of co-occurrences is given by:\n\n", "itemtype": "equation", "pos": 26032, "prevtext": "\n\nThe marginal counts are then defined in terms of the co-occurrence counts as:\n\n", "index": 11, "text": "\\begin{equation}\n\\phi(\\alpha)=\\sum_{\\beta \\in G, \\alpha \\ne \\beta } \\phi (\\alpha, \\beta) \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\phi(\\alpha)=\\sum_{\\beta\\in G,\\alpha\\neq\\beta}\\phi(\\alpha,\\beta)\" display=\"block\"><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>β</mi><mo>∈</mo><mi>G</mi></mrow><mo>,</mo><mrow><mi>α</mi><mo>≠</mo><mi>β</mi></mrow></mrow></munder><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nThen the co-occurrence probability is given by:\n\n", "itemtype": "equation", "pos": 26238, "prevtext": "\n\nwhich is the number of all co-occurrences. Finally, the total number of co-occurrences is given by:\n\n", "index": 13, "text": "\\begin{equation}\n\\phi_0=\\frac{1}{2} \\sum_{\\alpha \\in V} \\phi(\\alpha) =\\frac{1}{2} \\sum_{\\alpha \\in V}\\sum_{\\beta \\in V} \\phi(\\alpha, \\beta) \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\phi_{0}=\\frac{1}{2}\\sum_{\\alpha\\in V}\\phi(\\alpha)=\\frac{1}{2}\\sum_{\\alpha\\in V%&#10;}\\sum_{\\beta\\in V}\\phi(\\alpha,\\beta)\" display=\"block\"><mrow><msub><mi>ϕ</mi><mn>0</mn></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>α</mi><mo>∈</mo><mi>V</mi></mrow></munder><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>α</mi><mo>∈</mo><mi>V</mi></mrow></munder><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>β</mi><mo>∈</mo><mi>V</mi></mrow></munder><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nand the marginal probability is given by:\n\n", "itemtype": "equation", "pos": 26442, "prevtext": "\nThen the co-occurrence probability is given by:\n\n", "index": 15, "text": "\\begin{equation}\nP(\\alpha, \\beta)=\\frac{\\phi(\\alpha,\\beta)}{\\phi_0} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"P(\\alpha,\\beta)=\\frac{\\phi(\\alpha,\\beta)}{\\phi_{0}}\" display=\"block\"><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>ϕ</mi><mn>0</mn></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nThe Jaccard index can now be defined in these terms as:\n\n", "itemtype": "equation", "pos": 26568, "prevtext": "\nand the marginal probability is given by:\n\n", "index": 17, "text": "\\begin{equation}\nP(\\alpha)=\\phi(\\alpha)/phi_0 \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"P(\\alpha)=\\phi(\\alpha)/phi_{0}\" display=\"block\"><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>h</mi><mo>⁢</mo><msub><mi>i</mi><mn>0</mn></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\n\nWhen the collection of gene set queries is transposed such that the genes are the labels and the queries are the members of sets, the Jaccard index can be applied.\n\nWe can also use the following distance measures:\n\\begin{itemize}\n\t\\item Cosine Distance: \\newline $\\psi_{cos}=P(\\alpha,\\beta)/\\sqrt{P(\\alpha)P(\\beta) }$\n\t\\item Point-Wise Mutual Information: \\newline $\\psi_{pmi}=\\text{max}\\left\\{ 0,Log(P(\\alpha,\\beta)/P(\\alpha)P(\\beta) )\\right\\}$\n\t\\item Normalized Point-Wise Mutual Information:\\newline $\\psi_{nmi}=-\\psi_{pmi}/(Log(P(\\alpha,\\beta)))$\n\\end{itemize}\nWe apply a noise filter by iteratively applying a threshold for similarity: the pair counts for gene pairs that do not pass the threshold are set to zero, and the similarity matrix is recalculated.\n\nThroughout the rest of this analysis, we only use the normalized point-wise mutual information as a measure of similarity between genes for the Enrichr queries data.\n\n\n\n\\subsection{Network visualization}\nBecause the resultant networks are densely connected, direct visualization of the graph is not interpretable. Edge pruning has been proposed for the simplification of graphs to aid in generating interpretable visualizations of their structure \\cite{zhou2010network}. We find that such edge pruning algorithms, applied to very large graphs, are able to represent the global structure at the expense of the local structure. To potentially improve this, we employed an edge pruning approach that is able to capture both global and local structure in the graph.\n\nIn the initial step, a set of local structures is derived by varying the threshold for similarity and identifying connected graph components at the point at which they disconnect from the giant component. Such point is defined as any connected component that contains more than 10\\% of all nodes or has an absolute number of nodes greater than 100 nodes; this number is chosen based on the visualizability properties of the resulting local structures.\n\nThe local structures represent local regions of the network that are distinguishable from the rest of the network at an appropriate scale of similarity. As such, they depict the similarity relationships between the nodes and their neighborhood in the network.\n\nOnce the local structures have been identified, we employ a naive edge-pruning algorithm. We do not prune edges that are members of the local structures, thereby preserving them in the final simplified network. The number of edges that are available to be pruned is equal to the difference between the total number of edges in the original network, $n_e$,  and the number of edges that are part of the local structures, $n_{e;ls}$. The pruning process preserves the connectivity of the network, so after the maximum degree of pruning, the minimum number of edges remaining must be equal to:\n\n", "itemtype": "equation", "pos": 26686, "prevtext": "\nThe Jaccard index can now be defined in these terms as:\n\n", "index": 19, "text": "\\begin{equation}\n\\psi_{jac}=\\frac{P(\\alpha, \\beta)}{P(\\alpha)+P(\\beta)-P(\\alpha,\\beta))}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\psi_{jac}=\\frac{P(\\alpha,\\beta)}{P(\\alpha)+P(\\beta)-P(\\alpha,\\beta))}\" display=\"block\"><mrow><msub><mi>ψ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>=</mo><mfrac><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>,</mo><mi>β</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nAccordingly, the maximum number of edges that can be pruned while preserving the connectivity of the network is:\n\n", "itemtype": "equation", "pos": 29623, "prevtext": "\n\nWhen the collection of gene set queries is transposed such that the genes are the labels and the queries are the members of sets, the Jaccard index can be applied.\n\nWe can also use the following distance measures:\n\\begin{itemize}\n\t\\item Cosine Distance: \\newline $\\psi_{cos}=P(\\alpha,\\beta)/\\sqrt{P(\\alpha)P(\\beta) }$\n\t\\item Point-Wise Mutual Information: \\newline $\\psi_{pmi}=\\text{max}\\left\\{ 0,Log(P(\\alpha,\\beta)/P(\\alpha)P(\\beta) )\\right\\}$\n\t\\item Normalized Point-Wise Mutual Information:\\newline $\\psi_{nmi}=-\\psi_{pmi}/(Log(P(\\alpha,\\beta)))$\n\\end{itemize}\nWe apply a noise filter by iteratively applying a threshold for similarity: the pair counts for gene pairs that do not pass the threshold are set to zero, and the similarity matrix is recalculated.\n\nThroughout the rest of this analysis, we only use the normalized point-wise mutual information as a measure of similarity between genes for the Enrichr queries data.\n\n\n\n\\subsection{Network visualization}\nBecause the resultant networks are densely connected, direct visualization of the graph is not interpretable. Edge pruning has been proposed for the simplification of graphs to aid in generating interpretable visualizations of their structure \\cite{zhou2010network}. We find that such edge pruning algorithms, applied to very large graphs, are able to represent the global structure at the expense of the local structure. To potentially improve this, we employed an edge pruning approach that is able to capture both global and local structure in the graph.\n\nIn the initial step, a set of local structures is derived by varying the threshold for similarity and identifying connected graph components at the point at which they disconnect from the giant component. Such point is defined as any connected component that contains more than 10\\% of all nodes or has an absolute number of nodes greater than 100 nodes; this number is chosen based on the visualizability properties of the resulting local structures.\n\nThe local structures represent local regions of the network that are distinguishable from the rest of the network at an appropriate scale of similarity. As such, they depict the similarity relationships between the nodes and their neighborhood in the network.\n\nOnce the local structures have been identified, we employ a naive edge-pruning algorithm. We do not prune edges that are members of the local structures, thereby preserving them in the final simplified network. The number of edges that are available to be pruned is equal to the difference between the total number of edges in the original network, $n_e$,  and the number of edges that are part of the local structures, $n_{e;ls}$. The pruning process preserves the connectivity of the network, so after the maximum degree of pruning, the minimum number of edges remaining must be equal to:\n\n", "index": 21, "text": "\\begin{equation}\nn_{ls}+n_{e;ls}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"n_{ls}+n_{e;ls}\" display=\"block\"><mrow><msub><mi>n</mi><mrow><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mi>e</mi><mo>;</mo><mrow><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></mrow></msub></mrow></math>", "type": "latex"}, {"file": "1601.01653.tex", "nexttext": "\nThe iterative process by which edges are pruned is as follows:\n\\begin{enumerate}\n\t\\item Set a counter $i=0$\n\t\\item Identify the edge with the lowest similarity measure\n\t\\item If removing the edge does not cut the network, then remove it.\n\t\\item $i\\rightarrow i+1$\n\t\\item If $i<\\gamma(n_e-n_{e;ls}-n_{ls})$ then return to step 1; otherwise, stop.\n\\end{enumerate}\n\n\n\\section*{Acknowledgment}\nWe would like to thank Dr. Kathleen M. Jagodnik for providing useful comments and copyediting.\nFunding: This work was supported in part by grants from the NIH: R01GM098316, U54HG008230 and U54CA189201 to AM.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{IEEEtran}\n\n\n\n\n\\bibliography{EnrichRSets-bibliography-01}\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 29784, "prevtext": "\nAccordingly, the maximum number of edges that can be pruned while preserving the connectivity of the network is:\n\n", "index": 23, "text": "\\begin{equation}\nn_e-n_{e;ls}-n_{ls}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"n_{e}-n_{e;ls}-n_{ls}\" display=\"block\"><mrow><msub><mi>n</mi><mi>e</mi></msub><mo>-</mo><msub><mi>n</mi><mrow><mi>e</mi><mo>;</mo><mrow><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></mrow></msub><mo>-</mo><msub><mi>n</mi><mrow><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow></math>", "type": "latex"}]