[{"file": "1601.07117.tex", "nexttext": "\ni.e.\\ the contrast between the diffraction intensity at wavevectors $\\mathbf{G}_i$ and that at $-\\mathbf{G}_i$, the two sets of wavevectors being related by inversion.  This measure is robust against variations in the total atom number and against residual center-of-mass motion of the condensed atoms with respect to the lattice potential.  We note that imaging aberrations introduce a slight offset in $\\mathcal{A}$ (about 0.1) in our experiment, seen in Figs.\\ref{fig:SpinDep} and \\ref{fig:TimeDep}.\n\nWe confirm that the momentum-space inversion asymmetry results from the real-space inversion asymmetry of the lattice potential by varying the magnitude and sign of the inversion symmetry breaking potential $V_a(\\mathbf{r})$.  We tune $V_a(\\mathbf{r})$ by rotating the magnetic field through angle $\\theta$ to change the polarization of the condensate before exposing the condensate to the lattice potential.  \n\n\nOur data also emphasize the fact that even a $2.3\\%$ asymmetry in the lattice potential can lead to highly visible asymmetry in the matter-wave diffraction pattern.  The evolution of the momentum space asymmetry $\\mathcal{A}$ vs. pulse time is portrayed in Fig.\\ \\ref{fig:TimeDep}.  The asymmetry grows from small values at early times to over $50\\%$ at $\\tau \\sim 57 \\, \\mu$s, and also displays clear modulation in time reflecting the coherent dynamics of matter waves within the imposed lattice potential.  Throughout these dynamics, reversing the sign of the inversion asymmetry of the lattice reverses the observed inversion asymmetry of the diffracted atoms.\n\nWe present two physical pictures that explain the origin of the observed momentum-space inversion asymmetry.  First, let us consider how the momentum-space asymmetry originates from low-order diffraction in the lattice.  This description, shown schematically in Fig.\\ \\ref{fig:ExpFig} is valid in the limit of a shallow optical lattice and in the Raman-Nath regime, where we can ignore the kinetic energy of the diffracting atoms \\cite{gadway2009analysis}.  Both the scalar and vector Stark shift optical lattice potentials, $V_s$ and $V_a$ can be characterized in momentum space by their Fourier transforms $V_{s,a}(\\pm \\mathbf{G}_i)$ at the wavevectors $\\pm \\mathbf{G}_i$, with the relation $V_{s,a}(\\mathbf{G}_i) = V_{s,a}^*(-\\mathbf{G}_i)$ valid because both potentials are real.  Because both potentials have $C_3$ rotational symmetry, and considering their inversion symmetries, we have $V_{s}(\\pm \\mathbf{G}_i) = \\beta_s$ and $V_{a}(\\pm \\mathbf{G}_i) = \\pm i \\beta_a$ where $\\beta_s$ and $\\beta_a$ are both real.\n\nWe now consider the probability amplitudes $p(\\pm \\mathbf{G}_i)$ for atoms diffracting from their initial zero momentum state to a final wavevector $\\pm \\mathbf{G}_i$ within a time $\\tau$.  As illustrated in Fig.\\ \\ref{fig:ExpFig}a such diffraction can be achieved by one first-order process, with amplitude $- i (\\beta_s \\mp i \\beta_a) \\tau/\\hbar$, and by two second-order processes, which sum to an amplitude $(-i)^2 (\\beta_s \\pm i \\beta_a)^2 \\tau^2/\\hbar^2$.  Interference between the first- and second-order scattering amplitudes results in an imbalance of probability for diffraction into opposite wavevectors.  Calculating the asymmetry parameter $\\mathcal{A}$ at short times and for small lattice asymmetry ($|\\beta_a| \\ll |\\beta_s|$) we obtain $\\mathcal{A} \\simeq 6 \\beta_a t/\\hbar$, which is plotted as a gray dotted line in Fig.\\ \\ref{fig:TimeDep} and describes the data well for short $\\tau$ data.  \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=3.5in]{TimeDependence3.eps}\n\\caption{Oscillations in $\\mathcal{A}$ as a function of the Kaptiza-Dirac pulse time $\\tau$, shown for $\\theta=0.44$ radians (circles) and $\\theta=2.2$ radians (triangles).  The data represent the mean and standard error of five experimental runs at each pulse time.  A numerical calculation (solid line) with no free parameters closely reproduces the time dependence of $\\mathcal{A}$, whilst perturbation theory (dashed line) captures the short time behavior. Inset time of flight images show directly the evolution of the first order asymmetry.}\n\\label{fig:TimeDep}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{ExpFig.eps}\n\\caption{a) Atoms at zero momentum are coupled to wavevectors $\\pm \\mathbf{G}_i$ by the asymmetric Fourier components of the potential. b) Interference between first and second order processes create a population imbalance at $\\pm \\mathbf{G}_i$. c) Momentum space amplitudes and phases of the lowest two eigenstates. $\\mathcal{H}_a$ primarily mixes the symmetric ground state $|\\psi_{1,+}^{(0)}\\rangle$ and the antisymmetric excited state $|\\psi_{2,-}^{(0)}\\rangle$.  d) With perturbation $\\mathcal{H}_a$, the Kapitza-Dirac pulse projects the initial condensate wavefunction into the asymmetric first excited state, which beats with the other symmetric states.}\n\\label{fig:ExpFig}\n\\end{figure}\n\n\nWhile the model above provides a simple analytic expression for $\\mathcal{A}$, its assumptions are violated under the conditions of our experiment. For one, our experiments are performed with a deep lattice that leads to diffraction to high order, as exemplified by the many diffraction peaks in our images.  Second, given the high kinetic energy of the large momentum states produced in our experiment, the measurements are performed with pulse times that are long enough to be outside the Raman-Nath regime.  Therefore, the diffraction pattern produced in our measurement is better described as resulting from coherent dynamics governed by the band-structure of the optical lattice.\n\nWe therefore performed numerical calculations that trace the evolution of a non-interacting gas, produced initially at zero momentum, within the lattice band structure.  The numerical results for $\\theta=0.44$ radians and a lattice depth of 87 kHz with no free parameters are shown in Fig.\\ \\ref{fig:TimeDep} to match up well with the observed time dependence of the diffraction asymmetry.  \n\nTo provide an intuitive description of the coherent dynamics in $\\mathcal{A}$ that we both observe and calculate, we consider the effect of a small inversion symmetry breaking perturbation to the band structure of an inversion symmetric lattice potential.  The unperturbed Hamiltonian $\\mathcal{H}_0$, which includes the kinetic energy and the inversion-symmetric lattice potential $V_s(\\mathbf{r})$, has eigenstates $|\\psi_{i, \\pm}^{(0)}\\rangle$ that are either even (labeled by $+$) or odd (labeled by $-$) under the action of the spatial inversion.  The small antisymmetric lattice potential $V_a(\\mathbf{r)}$ mixes the even and odd eigenstates.  To first order in $V_a$ the zero quasi-momentum eigenstates become\n\n\\begin{eqnarray}\n\\ket{\\psi_{i,+}^{(1)}} &\\approx& \\ket{\\psi_{i,+}^{(0)}} + \\sum_j \\alpha_{j,i}\\ket{\\psi_{j,-}^{(0)}} \\\\\n\\ket{\\psi_{j,-}^{(1)}} &\\approx& \\ket{\\psi_{j,-}^{(0)}} + \\sum_i -\\alpha_{j,i}^*\\ket{\\psi_{i,+}^{(0)}}\n\\end{eqnarray}\nwhere $\\alpha_{j,i}=\\frac{\\bra{\\psi_{j,-}^{(0)}} V_a \\ket{\\psi_{i,+}^{(0)}}}{E_{j,-}^{(0)} - E_{i,+}^{(0)}}$.\n\n\n\nThe initial state zero-momentum condensate can be written in the basis of inversion-even eigenstates as $|\\psi(0)\\rangle = \\sum_i c_i |\\psi_{i, +}^{(0)}\\rangle$. During the lattice pulse time $\\tau$ this initial state evolves in time as\n\n", "itemtype": "equation", "pos": 10484, "prevtext": "\n\n\\title{Signatures of spatial inversion asymmetry of an optical lattice observed in matter-wave diffraction}\n\n\\author{C. K. Thomas$^{1}$}\n\\author{T. H. Barter$^{1}$}\n\\author{T.-H. Leung$^{1}$}\n\\author{S. Daiss$^{2}$}\n\\author{D. M. Stamper-Kurn$^{1,3}$}\n\\thanks{Electronic address: dmsk@berkeley.edu}\n\\affiliation{\n    $^1$Department of Physics, University of California, Berkeley CA 94720,\n    $^2$Physikalisches Institut der Universitat Heidelberg, Im Neuenheimer Feld 226, DE-69120 Heidelberg, Germany,\n    $^3$Materials Sciences Division, Lawrence Berkeley National Laboratory, Berkeley, CA 94720}\n\n\\date{\\today }\n\n\\begin{abstract}\nThe structure of a two-dimensional honeycomb optical lattice potential with small inversion asymmetry is characterized using coherent diffraction of $^{87}$Rb atoms.  We demonstrate that even a small potential asymmetry, with peak-to-peak amplitude of $\\leq 2.3\\%$ of the overall lattice potential, can lead to pronounced inversion asymmetry in the momentum-space diffraction pattern.  The observed asymmetry is explained quantitatively by considering both Kaptiza-Dirac scattering in the Raman-Nath regime, and also either perturbative or full-numerical treatment of the band structure of a periodic potential with a weak inversion symmetry breaking term.  Our results have relevance both for the experimental development of coherent atom optics and also for the proper interpretation of time-of-flight assays of atomic materials in optical lattices.\n\\end{abstract}\n\n\n\n\\maketitle\n\nIn x-ray crystallography, the diffraction of light is interpreted to determine the exact crystalline structure of a material.  Similarly, with the availability of ultracold sources of coherent matter waves of atoms, one can use atomic diffraction to characterize potentials experienced by the atoms.  Of particular interest are the optical lattice potentials produced by periodic patterns of light intensity and polarization, formed by the intersection of several coherent plane waves of light or by direct imaging.  Lattice potentials of various geometries and dimensionalities, some incorporating atomic-spin dependence and gauge fields, have been produced or proposed for the purpose of creating synthetic atomic materials by placing quantum-degenerate atoms within them \\cite{pets94,bloc05nphys,bloc12qsim}.  Just as in condensed matter, the characteristics of such synthetic atomic materials derive from the nature of the optical crystal upon which they are based.  Matter-wave crystallography therefore becomes a vital tool in the study of such synthetic quantum matter.\n\nA key first step in determining the structure of a lattice is the assignment of its point-group and space-group symmetries.  The violation of a symmetry is identified in x-ray crystallography by a difference in the intensities of diffraction spots \\cite{ladd13xraybook}.  Following such work, here we detect the inversion asymmetry of an optical lattice by observing significant asymmetries in the diffraction of a coherent matter wave from the potential.  For this, we produce a spin-polarized $^{87}$Rb Bose-Einstein condensate at rest, and then impose for a variable pulse duration the two-dimensional honeycomb optical lattice potential by three light beams intersecting at equal angles \\cite{solt11hexagonal}.  The resulting Kaptiza-Dirac diffraction is quantified by imaging the gas after it is released in time of flight.  By tuning the pulse time and working with a deep optical lattice, we produce highly visible (over $50\\%$ contrast) inversion asymmetry in the populations of the first-order diffraction peaks even while the inversion asymmetric part of the potential is $\\leq 2.3\\%$ of the overall lattice potential.  This observation highlights the extreme sensitivity of coherent matter-wave scattering in revealing features of a potential landscape under investigation.\n\n\nAside from demonstrating sensitive optical-lattice crystallography, our observation also has implications for the development of atom optics.  Matter-wave interferometers for several applications have employed brief pulses of light to split and recombine atomic beams coherently \\cite{wicht2002preliminary, kasevich1992measurement}.  Kaptiza-Dirac diffraction, i.e.\\ the diffraction of atoms from standing-wave rather than traveling-wave optical potentials, has the advantage that it is technically simple to implement, requiring only light waves at a single optical frequency \\cite{mosk83,ovch99}.  However, as compared with Bragg or Raman diffraction, it has the disadvantage of being less efficient and less selective \\cite{martin1988bragg}.  The technical simplicity has inspired modifications of Kaptiza-Dirac diffraction employing several pulses of light so as to diffract atoms to selected diffraction orders with high efficiency \\cite{wu05splitting}, although the diffraction remained inversion symmetric, with as many atoms diffracted to the wavevector $+\\mathbf{G}$ as to the wavevector $-\\mathbf{G}$.  Our measurements show how this last constraint can be lifted by demonstrating inversion-asymmetric Kaptiza-Dirac diffraction of matter waves in two dimensions.  Similar to the previous demonstration of such asymmetric diffraction in one dimension \\cite{jo12kag}, we explain how this asymmetry arises from the interference between different diffraction pathways to the same final momentum state.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics{Fig1_z.eps}\n\\caption{a) Three 1064 nm beams interfere at $120^\\circ$ with in-plane polarization to create a honeycomb lattice of intensity maxima.  b) We define a quantization axis orthogonal to the lattice plane and decompose the lattice into circular polarizations. The light at site A is primarily $\\sigma^+$ whilst the light at site B is primarily $\\sigma^- $. The atoms are polarized by a uniform magnetic field B$_0$ at an angle $\\theta$ from the quantization axis.  c) The scalar Stark shift creates a uniform honeycomb potential and the vector Stark shift creates an energy offset between sites A and B that is proportional to $\\cos\\theta$. d) The potential depth at sites A and B due to the combination of vector and scalar Stark shifts.}\n\\label{fig:Scheme}\n\\end{figure*}\n\nWe begin by describing the optical lattice potential characterized and used in this work.  As in Ref.\\ \\cite{solt11hexagonal} and illustrated in Fig.\\ \\ref{fig:Scheme}, we form a two-dimensional honeycomb lattice using three beams of light at the wavelength $\\lambda = 1064$ nm, with equal intensity, propagating horizontally and intersecting at equal angles, with each beam linearly polarized in-plane.  The beams produce a periodic pattern of varying intensity and optical polarization.\n\n\n\n\n\n\n\n\n\nRubidium atoms exposed to this optical lattice experience an ac Stark shift that can be divided into scalar, vector and tensor terms acting on the atomic hyperfine spin.  The tensor light shift is negligible in our experiment owing to the large detuning of the lattice light from the atomic transitions. The scalar light shift is proportional to light intensity and produces a honeycomb lattice potential $V_s(\\mathbf{r})$ with two sites of equal depth per unit cell, as in Fig.\\ \\ref{fig:Scheme}a,b.   \n\nThe vector light shift produces a potential $V_a(\\mathbf{r})$ that is proportional to both intensity and the dot product of helicity and atomic hyperfine spin \\cite{cct72}.  Fig.\\ \\ref{fig:Scheme}b shows that the helicity in the lattice is staggered so that $V_a(\\mathbf{r})$ is of opposite sign at each of the two sites in the unit cell.\n\n\nThe scalar and vector light shift potentials differ in their inversion symmetry, with $V_s(\\mathbf{r})$ being symmetric and $V_a(\\mathbf{r})$ being antisymmetric under spatial inversion.   To see this, take the center of the inversion operation as one of the zero-intensity locations within the optical lattice.\n\n\nWe control the magnitude of $V_a(\\mathbf{r})$ by slowly rotating a uniform magnetic field $\\mathbf{B}_0$ by an angle $\\theta$ with respect to the vertical quantization axis so that the atoms remain spin polarized along $\\mathbf{B}_0$ and $V_a(\\mathbf{r}) \\propto \\cos\\theta$.  For alkali atoms, the maximum value of $|V_a(\\mathbf{r})|$, is suppressed with respect that of the inversion-symmetric potential $|V_s(\\mathbf{r})|$ by the optical detuning from resonance.  For our setup, 2$|V_a/V_s|_{max} = 2.3\\%$, so that the vector Stark shift adds only a small inversion symmetry breaking potential atop a graphene-like, inversion symmetric honeycomb lattice.  The resulting lattice potential has a small, state-dependent offset in energy between sites A and B, as illustrated in Fig.\\ \\ref{fig:Scheme}c,d.\n\n\n\n\\begin{figure}[b]\n\\centering\n\n\\includegraphics[width=3.5in]{SpinDep.eps}\n\\caption{Time of flight images show an asymmetry in the first order diffraction peaks, which are highlighted by circles and triangles. The experiment is repeated five times at each angle with a pulse time of $50 \\ \\mu s$.  $\\mathcal{A}$ is computed for each image and the mean and standard error are shown.}\n\\label{fig:SpinDep}\n\\end{figure}\n\nIn order to characterize this lattice using matter waves, we create nearly pure, spin polarized, optically trapped Bose-Einstein condensates of $3\\times 10^{5}$ $^{87}$Rb atoms.  We then pulse on a three-beam lattice potential for which the peak-to-peak amplitude of $V_s$ is $h \\times 87 \\pm 4$ kHz, calibrated before the experiment with two-beam Kapitza-Dirac pulses \\cite{morsch2006dynamics}.  We hold the lattice at this constant depth for a pulse time $\\tau$ between 10 and 100 $\\mu$s.  During the pulse the condensate evolves in the honeycomb lattice potential.  After pulse time $\\tau$ we simultaneously switch off the optical lattice and optical trapping potentials and allow the atoms to expand freely.  After 20 ms, we image their density to reveal the momentum-space distribution of the atoms after the lattice pulse.  These images show peaks at the reciprocal lattice vectors $\\mathbf{G}_1 = \\mathbf{k}_3 - \\mathbf{k}_2$, and cyclic, where $\\mathbf{k}_{1,2,3}$ are the wavevectors of the incident beams that form the lattice.  $\\mathbf{G}_i$ are shown schematically in Fig.\\ \\ref{fig:ExpFig}a.\n\n\nThe first image of Fig.\\ \\ref{fig:SpinDep} shows a pronounced momentum space inversion asymmetry in the first order diffraction peaks, wherein more atoms are diffracted to $\\mathbf{G}_i$ than $-\\mathbf{G}_i$.  We quantify this asymmetry with the parameter $\\mathcal{A}$ as\n\n", "index": 1, "text": "\\begin{equation}\n\\mathcal{A} = \\frac{\\sum_i \\left(P_{\\mathbf{G}_i} - P_{-\\mathbf{G}_i}\\right)}{\\sum_i \\left(P_{\\mathbf{G}_i} + P_{-\\mathbf{G}_i}\\right)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{A}=\\frac{\\sum_{i}\\left(P_{\\mathbf{G}_{i}}-P_{-\\mathbf{G}_{i}}\\right)}%&#10;{\\sum_{i}\\left(P_{\\mathbf{G}_{i}}+P_{-\\mathbf{G}_{i}}\\right)},\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒜</mi><mo>=</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><mo>(</mo><mrow><msub><mi>P</mi><msub><mi>𝐆</mi><mi>i</mi></msub></msub><mo>-</mo><msub><mi>P</mi><mrow><mo>-</mo><msub><mi>𝐆</mi><mi>i</mi></msub></mrow></msub></mrow><mo>)</mo></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><mo>(</mo><mrow><msub><mi>P</mi><msub><mi>𝐆</mi><mi>i</mi></msub></msub><mo>+</mo><msub><mi>P</mi><mrow><mo>-</mo><msub><mi>𝐆</mi><mi>i</mi></msub></mrow></msub></mrow><mo>)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07117.tex", "nexttext": "\nwhere $\\omega_i = E_{i,+}/\\hbar$ and $\\omega_j = E_{j,-}/\\hbar$.\n\nThe numerator of the inversion asymmetry parameter $\\mathcal{A}$ is the expectation value of an inversion-odd operator $M$ that is diagonal in the basis of reciprocal lattice momenta, with matrix element $\\pm 1$ for the wavevectors $\\pm \\mathbf{G}_i$.  $\\langle M \\rangle$ is only nonzero for states with opposite inversion symmetry.\n\n\n Using the first-order expression above for $|\\psi(t)\\rangle$, we obtain $\\langle M \\rangle = M_1(t) + M_2(t)$ with\n\\begin{eqnarray}\nM_1(t) & = & \\sum_{i,j,k} \\left( c^*_i c_k e^{-i (\\omega_k - \\omega_i)t} \\alpha^*_{j,i} M_{j,k} + c.c \\right) \\\\\nM_2(t) & = & \\sum_{i,j,k} \\left( c^*_i c_k e^{-i (\\omega_j - \\omega_i)t} \\left(-\\alpha_{j,k}\\right) M^*_{j,i} + c.c. \\right)\n\\end{eqnarray}\nand $M_{j,i} = \\langle \\psi_{j,-}^{(0)} | M | \\psi_{i,+}^{(0)}\\rangle$.\n\nThese equations show two generic scenarios that lead to a large momentum-space asymmetry.   $M_1(t)$ describes the beating between the first two terms of equation \\ref{eq:TimeEv}, which represent the incorporation of inversion antisymmetry into an even eigenstate $\\ket{\\psi_{i,+}^{(0)}}$ of $\\mathcal{H}_0$. In order for this to have a large effect, an inversion-antisymmetric state $\\ket{\\psi_{j,-}^{(0)}}$ must be close in energy to $\\ket{\\psi_{i,+}^{(0)}}$ so as to be strongly mixed by the perturbation $\\mathcal{H}_a$ (giving large $\\alpha_{j,i}$).  There must also be a third inversion symmetric state, $|\\psi_{k,+}^{(0)}\\rangle$), with which the perturbed state can interfere.  In this case, we expect also a modulation in $\\mathcal{A}$ at the frequency $\\omega_i - \\omega_k$.  This scenario is illustrated in Fig.\\ \\ref{fig:ExpFig}, where we identify $\\ket{\\psi_{i,+}^{(0)}}$ as the ground state and $\\ket{\\psi_{j,-}^{(0)}}$ as the first excited state.\n\nThe second scenario, described by $M_2(t)$, involves antisymmetric unperturbed states $\\ket{\\psi_{j,-}^{(0)}}$, like the excited state shown in Fig.\\ \\ref{fig:ExpFig}.  When there is a nearby even state $|\\psi_{i,+}^{(0)}\\rangle$, the perturbation $\\mathcal{H}_a$ introduces population at zero-momentum so that $c_j$ is nonzero.  The state $\\ket{\\psi_{j,-}^{(0)}}$ remains mostly antisymmetric and will interfere with all inversion even states $|\\psi_{k,+}^{(0)}$ that have large population in the first-order diffraction momenta (giving large $M_{j,k}$).  In this case, we expect modulation in $\\mathcal{A}$ at frequencies $\\omega_j - \\omega_k$.\n\nIn our experiment the lowest two energy eigenstates are only partially hybridized because $2 |V_a/V_s|$ is small compared to the energy splitting between the ground and first excited states of $\\mathcal{H}_0$.  As a result, the evolution of $\\mathcal{A}$ in Fig.\\ \\ref{fig:TimeDep} is dominated by  $M_2(t)$.  The three states that maximally contribute to $\\mathcal{A}$ are illustrated in Fig.\\ \\ref{fig:ExpFig}, their frequency differences of 2.3 kHz and 63 kHz can be seen in the signal of $\\mathcal{A}$.   \n\nOur observations, along with the theoretical descriptions offered in this work, illustrate how matter-wave diffraction can be made highly sensitive to, and strongly manipulated by, fine features of an optical lattice.  Our work also suggests an explanation for the momentum-space asymmetry observed in time of flight diffraction of a transversely polarized rubidium condensate reported in Ref.\\ \\cite{solt12twisted} (see also Ref.\\ \\cite{jurg15twisted}).  In that experiment, the condensate was loaded into a spin-dependent optical lattice and after time of flight the spin states were separated by Stern-Gerlach, revealing an equal and opposite momentum-space asymmetry for the two spin states.  The asymmetry was interpreted as evidence of a ground-state superfluid that forms with a spatially dependent phase in the superfluid order parameter.  A later theoretical study \\cite{chou13twisted} found no evidence for such a ``twisted superfluid'' state, as would be naively expected given that the optical lattice and mean-field interaction potentials are both real valued.  \n\nWe suggest that the inversion-asymmetric diffraction patterns observed in the experiment \\cite{solt12twisted} may have resulted from matter-wave diffraction from the inversion-asymmetric transient honeycomb lattice that repulsion from one atomic spin state creates for the second spin state in early time of flight.  Such diffraction of one matter wave off another can be described equivalently as nonlinear coherent wave mixing induced by interatomic interactions \\cite{pert10mixing}.  The observation in Ref.\\ \\cite{solt12twisted} that the sign of the asymmetry parameter $\\mathcal{A}$  was consistent between experimental repetitions supports our view that the asymmetry resulted from deterministic matter-wave dynamics rather than by the spontaneous symmetry breaking that might have been expected for a quantum phase transition of the sort claimed in that work.  Moreover, in a recent experiment with the same system as in Ref.\\ \\cite{solt12twisted}, the diffraction was modified by eliminating one spin population from the lattice just before the atoms were released \\cite{sengtwisted}.  The consequent elimination of the asymmetry signal is consistent with our suggested explanation.\n\n \n\nThis work was supported by the NSF and the AFOSR through the MURI program.\n\n\n\n\\bibliographystyle{apsrev}\n\\bibliography{allrefs_x2}\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 17984, "prevtext": "\ni.e.\\ the contrast between the diffraction intensity at wavevectors $\\mathbf{G}_i$ and that at $-\\mathbf{G}_i$, the two sets of wavevectors being related by inversion.  This measure is robust against variations in the total atom number and against residual center-of-mass motion of the condensed atoms with respect to the lattice potential.  We note that imaging aberrations introduce a slight offset in $\\mathcal{A}$ (about 0.1) in our experiment, seen in Figs.\\ref{fig:SpinDep} and \\ref{fig:TimeDep}.\n\nWe confirm that the momentum-space inversion asymmetry results from the real-space inversion asymmetry of the lattice potential by varying the magnitude and sign of the inversion symmetry breaking potential $V_a(\\mathbf{r})$.  We tune $V_a(\\mathbf{r})$ by rotating the magnetic field through angle $\\theta$ to change the polarization of the condensate before exposing the condensate to the lattice potential.  \n\n\nOur data also emphasize the fact that even a $2.3\\%$ asymmetry in the lattice potential can lead to highly visible asymmetry in the matter-wave diffraction pattern.  The evolution of the momentum space asymmetry $\\mathcal{A}$ vs. pulse time is portrayed in Fig.\\ \\ref{fig:TimeDep}.  The asymmetry grows from small values at early times to over $50\\%$ at $\\tau \\sim 57 \\, \\mu$s, and also displays clear modulation in time reflecting the coherent dynamics of matter waves within the imposed lattice potential.  Throughout these dynamics, reversing the sign of the inversion asymmetry of the lattice reverses the observed inversion asymmetry of the diffracted atoms.\n\nWe present two physical pictures that explain the origin of the observed momentum-space inversion asymmetry.  First, let us consider how the momentum-space asymmetry originates from low-order diffraction in the lattice.  This description, shown schematically in Fig.\\ \\ref{fig:ExpFig} is valid in the limit of a shallow optical lattice and in the Raman-Nath regime, where we can ignore the kinetic energy of the diffracting atoms \\cite{gadway2009analysis}.  Both the scalar and vector Stark shift optical lattice potentials, $V_s$ and $V_a$ can be characterized in momentum space by their Fourier transforms $V_{s,a}(\\pm \\mathbf{G}_i)$ at the wavevectors $\\pm \\mathbf{G}_i$, with the relation $V_{s,a}(\\mathbf{G}_i) = V_{s,a}^*(-\\mathbf{G}_i)$ valid because both potentials are real.  Because both potentials have $C_3$ rotational symmetry, and considering their inversion symmetries, we have $V_{s}(\\pm \\mathbf{G}_i) = \\beta_s$ and $V_{a}(\\pm \\mathbf{G}_i) = \\pm i \\beta_a$ where $\\beta_s$ and $\\beta_a$ are both real.\n\nWe now consider the probability amplitudes $p(\\pm \\mathbf{G}_i)$ for atoms diffracting from their initial zero momentum state to a final wavevector $\\pm \\mathbf{G}_i$ within a time $\\tau$.  As illustrated in Fig.\\ \\ref{fig:ExpFig}a such diffraction can be achieved by one first-order process, with amplitude $- i (\\beta_s \\mp i \\beta_a) \\tau/\\hbar$, and by two second-order processes, which sum to an amplitude $(-i)^2 (\\beta_s \\pm i \\beta_a)^2 \\tau^2/\\hbar^2$.  Interference between the first- and second-order scattering amplitudes results in an imbalance of probability for diffraction into opposite wavevectors.  Calculating the asymmetry parameter $\\mathcal{A}$ at short times and for small lattice asymmetry ($|\\beta_a| \\ll |\\beta_s|$) we obtain $\\mathcal{A} \\simeq 6 \\beta_a t/\\hbar$, which is plotted as a gray dotted line in Fig.\\ \\ref{fig:TimeDep} and describes the data well for short $\\tau$ data.  \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=3.5in]{TimeDependence3.eps}\n\\caption{Oscillations in $\\mathcal{A}$ as a function of the Kaptiza-Dirac pulse time $\\tau$, shown for $\\theta=0.44$ radians (circles) and $\\theta=2.2$ radians (triangles).  The data represent the mean and standard error of five experimental runs at each pulse time.  A numerical calculation (solid line) with no free parameters closely reproduces the time dependence of $\\mathcal{A}$, whilst perturbation theory (dashed line) captures the short time behavior. Inset time of flight images show directly the evolution of the first order asymmetry.}\n\\label{fig:TimeDep}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=3.5in]{ExpFig.eps}\n\\caption{a) Atoms at zero momentum are coupled to wavevectors $\\pm \\mathbf{G}_i$ by the asymmetric Fourier components of the potential. b) Interference between first and second order processes create a population imbalance at $\\pm \\mathbf{G}_i$. c) Momentum space amplitudes and phases of the lowest two eigenstates. $\\mathcal{H}_a$ primarily mixes the symmetric ground state $|\\psi_{1,+}^{(0)}\\rangle$ and the antisymmetric excited state $|\\psi_{2,-}^{(0)}\\rangle$.  d) With perturbation $\\mathcal{H}_a$, the Kapitza-Dirac pulse projects the initial condensate wavefunction into the asymmetric first excited state, which beats with the other symmetric states.}\n\\label{fig:ExpFig}\n\\end{figure}\n\n\nWhile the model above provides a simple analytic expression for $\\mathcal{A}$, its assumptions are violated under the conditions of our experiment. For one, our experiments are performed with a deep lattice that leads to diffraction to high order, as exemplified by the many diffraction peaks in our images.  Second, given the high kinetic energy of the large momentum states produced in our experiment, the measurements are performed with pulse times that are long enough to be outside the Raman-Nath regime.  Therefore, the diffraction pattern produced in our measurement is better described as resulting from coherent dynamics governed by the band-structure of the optical lattice.\n\nWe therefore performed numerical calculations that trace the evolution of a non-interacting gas, produced initially at zero momentum, within the lattice band structure.  The numerical results for $\\theta=0.44$ radians and a lattice depth of 87 kHz with no free parameters are shown in Fig.\\ \\ref{fig:TimeDep} to match up well with the observed time dependence of the diffraction asymmetry.  \n\nTo provide an intuitive description of the coherent dynamics in $\\mathcal{A}$ that we both observe and calculate, we consider the effect of a small inversion symmetry breaking perturbation to the band structure of an inversion symmetric lattice potential.  The unperturbed Hamiltonian $\\mathcal{H}_0$, which includes the kinetic energy and the inversion-symmetric lattice potential $V_s(\\mathbf{r})$, has eigenstates $|\\psi_{i, \\pm}^{(0)}\\rangle$ that are either even (labeled by $+$) or odd (labeled by $-$) under the action of the spatial inversion.  The small antisymmetric lattice potential $V_a(\\mathbf{r)}$ mixes the even and odd eigenstates.  To first order in $V_a$ the zero quasi-momentum eigenstates become\n\n\\begin{eqnarray}\n\\ket{\\psi_{i,+}^{(1)}} &\\approx& \\ket{\\psi_{i,+}^{(0)}} + \\sum_j \\alpha_{j,i}\\ket{\\psi_{j,-}^{(0)}} \\\\\n\\ket{\\psi_{j,-}^{(1)}} &\\approx& \\ket{\\psi_{j,-}^{(0)}} + \\sum_i -\\alpha_{j,i}^*\\ket{\\psi_{i,+}^{(0)}}\n\\end{eqnarray}\nwhere $\\alpha_{j,i}=\\frac{\\bra{\\psi_{j,-}^{(0)}} V_a \\ket{\\psi_{i,+}^{(0)}}}{E_{j,-}^{(0)} - E_{i,+}^{(0)}}$.\n\n\n\nThe initial state zero-momentum condensate can be written in the basis of inversion-even eigenstates as $|\\psi(0)\\rangle = \\sum_i c_i |\\psi_{i, +}^{(0)}\\rangle$. During the lattice pulse time $\\tau$ this initial state evolves in time as\n\n", "index": 3, "text": "\\begin{align}\n\\label{eq:TimeEv}\n\\ket{\\psi(t)} = \\sum_i c_i e^{-i\\omega_i t} (  \\ket{\\psi_{i,+}^{(0)}} +  \\sum_{j}-\\alpha_{j,i}\\ket{\\psi_{j,-}^{(0)}} ) \\\\ \\nonumber\n+\\sum_{j,k}-\\alpha_{j,k}c_k e^{-i\\omega_j t} \\ket{\\psi_{j,-}^{(0)}}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\ket{\\psi(t)}=\\sum_{i}c_{i}e^{-i\\omega_{i}t}(\\ket{\\psi_{i,+}^{(0)%&#10;}}+\\sum_{j}-\\alpha_{j,i}\\ket{\\psi_{j,-}^{(0)}})\" display=\"inline\"><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder></mstyle><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ω</mi><mi>i</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><msubsup><mi>ψ</mi><mrow><mi>i</mi><mo>,</mo><mo>+</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">⟩</mo></mrow><mo>+</mo><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi></munder></mstyle></mrow><mo>-</mo><mrow><msub><mi>α</mi><mrow><mi>j</mi><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><msubsup><mi>ψ</mi><mrow><mi>j</mi><mo>,</mo><mo>-</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle+\\sum_{j,k}-\\alpha_{j,k}c_{k}e^{-i\\omega_{j}t}\\ket{\\psi_{j,-}^{(0%&#10;)}}\" display=\"inline\"><mrow><mrow><mo>+</mo><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>,</mo><mi>k</mi></mrow></munder></mstyle></mrow><mo>-</mo><mrow><msub><mi>α</mi><mrow><mi>j</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>⁢</mo><msub><mi>c</mi><mi>k</mi></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ω</mi><mi>j</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><msubsup><mi>ψ</mi><mrow><mi>j</mi><mo>,</mo><mo>-</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></math>", "type": "latex"}]