[{"file": "1601.00886.tex", "nexttext": "\nwhere  $\\hat H_{\\rm q} = ({\\omega_{\\rm q}}/{2}) \\sum_i  \\hat \\sigma^{(i)}_z $ and $ \\hat H_{\\rm c} =\\omega_{\\rm c} \\hat a^\\dag \\hat a$, describe the qubit and cavity Hamiltonians in the absence of interaction, $\\hat X =  \\hat a + \\hat a^\\dag$, $\\hat \\sigma^{(i)}_x$ and $\\hat \\sigma^{(i)}_z$\nare Pauli operators for the $i$th qubit, and $\\lambda$ is the coupling rate of each qubit to the cavity mode. For $\\theta= 0$ parity is conserved. For flux qubits, this angle, as well as the transition frequency $\\omega_{\\rm q}$, can be continuously tuned by changing the external flux bias \\cite{Liu2005,Niemczyk2010}. For the sake of simplicity, Eq.~(\\ref{HH}) describes identical qubits, but this is not an essential point.\nIn contrast to the Jaynes-Cummings (JC) model, the Hamiltonian in Eq.~(\\ref{HH}) explicitly contains counter-rotating\n terms of the form $\\hat \\sigma^{(i)}_+ \\hat a^\\dag$, $\\hat \\sigma^{(i)}_- \\hat a$, $\\hat \\sigma^{(i)}_z \\hat a^\\dag$, and $\\hat \\sigma^{(i)}_z \\hat a$. The first (second) term creates (destroys) two excitations while the third (fourth) term creates (destroy) one excitation.\n\nThe presence of counter-rotating terms in the interaction Hamiltonian enables four different paths which, starting from the initial state $|g,g,1 \\rangle$,  reach the final state $|e,e,0 \\rangle$ (see Supplemental Fig.~S1 \\cite{SuppMat}). Each path includes three virtual transitions involving out-of-resonance intermediate states. Fig.~1 only displays  the process that gives the main contribution to the effective coupling between the bare states $|g,g,1 \\rangle$ and  $|e,e,0 \\rangle$. Higher-order processes, depending on the atom-field interaction strength, can also contribute. By applying standard third-order perturbation theory, we obtain the following effective coupling rate, $\\Omega_{\\rm eff}/\\omega_{\\rm q}  \\equiv  (8/3)(\\lambda/\\omega_{\\rm q})^3 \\sin \\theta \\cos^2{\\theta}$. The analytical derivation of the  effective coupling rate as a function of $ \\lambda/\\omega_{\\rm q} $ is presented in the Supplemental Material \\cite{SuppMat}. Already at a coupling rate $\\lambda/ \\omega_{\\rm q} = 0.1$, an effective (two qubits)-(one photon) coupling rate $\\Omega_{\\rm eff}/\\omega_{\\rm q} \\sim 10^{-3}$ can be obtained. \n\n\\begin{figure}[!ht]\n\t\\centering\n\t\\includegraphics[scale=0.20]{Fig1.pdf}\n\t\\caption{(Color online) Sketch of the process giving the main contribution to the effective coupling between the bare states $| g,g,1 \\rangle$ and $|e,e,0 \\rangle$, via intermediate virtual transitions. Here, the excitation-number nonconserving processes are represented by arrowed dashed line. The transition matrix elements are also shown.\n\t \\label{fig:1}}\n\\end{figure}\n\n\nWe diagonalize numerically the Hamiltonian in Eq.~(\\ref{HH}) for the case of two qubits and indicate the resulting energy eigenvalues and eigenstates as $\\hbar \\omega_{i}$ and  $| i\\rangle$  with $i = 0, 1, \\dots$, choosing the labelling of the states  such that $\\omega_{k} > \\omega_{j}$ for $k>j$.  We use a normalized coupling rate $\\lambda / \\omega_{\\rm q} = 0.1$ and an angle $\\theta = \\pi/6$.   \nFigure~2a shows the frequency differences $\\omega_{i,0} = \\omega_{i} - \\omega_{0}$ for the lowest energy states as a function of the resonator frequency.\nStarting from the lowest excited states of the spectrum, a large splitting anticrossing around $\\omega_{\\rm c} / \\omega_{\\rm q} =1$ can be observed (see arrows in Fig.~2a). It corresponds to the standard vacuum Rabi splitting, which appears also when neglecting the counter-rotating terms. The straight line at $E/  \\omega_{\\rm q} =1$ corresponds to the dark antisymmetric state $(|g,e,0 \\rangle - |e,g,0 \\rangle)/\\sqrt{2}$. Even larger splitting anticrossings around $\\omega_{\\rm c} / \\omega_{\\rm q} =1$ can be observed at higher $E$ values. These correspond to the second and third rung of the JC ladder. We are interested in the region around $\\omega_{\\rm c} / \\omega_{\\rm q} =2$, where the levels 3 and 4  display an apparent crossing at $E / \\omega_{\\rm q} \\approx 2$. Actually, what appears as a crossing on this scale, it turns out to be a splitting anticrossing on an enlarged view as in Fig.~2b.\nObserving that just outside this avoided-crossing region one level remains flat as a function of $\\omega_{\\rm c}$ with energy $\\omega \\approx 2 \\omega_{\\rm q}$, while the other grows as $\\omega_{\\rm c}$, this splitting clearly originates from the hybridization of the states $|e,e,0 \\rangle$ and $|g,g, 1 \\rangle$. The resulting states are well approximated by the states $(|e,e,0 \\rangle  \\pm |g,g, 1 \\rangle)/\\sqrt{2}$.\n This splitting is not present in the rotating-wave approximation (RWA), where the coherent coupling between states with a different number of excitations is not allowed, nor does it occur in the absence of symmetry breaking ($\\theta =0$). The normalized splitting has a value 2 $\\Omega_{\\rm eff } / \\omega_{\\rm q} = 1.97 \\times 10^{-3}$, which is in good agreement with  $2 \\times 10^{-3} $, obtained within perturbation theory. This observed hybridization opens the way to the observation of weird effects such as the simultaneous excitations of \\textit{two} qubits with only \\textit{one} cavity photon. Such a coupling between the states $|e,e,0 \\rangle$ and $|g,g,1 \\rangle$ can be analytically described by the effective interaction Hamiltonian $H_{\\rm eff} = -\\Omega_{\\rm eff} (|e,e,0 \\rangle \\langle g,g,1| + {\\rm H.c.})$.\n\n\\begin{figure}[!ht]\n\t\\includegraphics[scale=.40]{Fig2.pdf}\n\t\\caption{(Color online) (a) Frequency differences $\\omega_{i,0} = \\omega_{i} - \\omega_{0}$ for the lowest energy eigenstates of Hamiltonian~(\\ref{HH}) as a function of $\\omega_{\\rm c}/ \\omega_{\\rm q}$. Here we consider a normalized coupling rate $\\lambda/\\omega_{\\rm q}=0.1$ between the resonator and each of the qubits. We used $\\theta = \\pi/6$. The black arrows indicate the ordinary vacuum splitting arising from the coupling between the states $|g,g,1 \\rangle$ and $(1 /\\sqrt{2}) ( |g,e,0 \\rangle + |e,g,0 \\rangle)$.\n\t\t(b) Enlarged view of the spectral region delimited by a square in panel (a). This shows an avoided-level crossing,  demonstrating  the coupling between the states $|g,g,1 \\rangle$ and $|e,e,0 \\rangle$ due to the presence of counter-rotating terms in the system Hamiltonian. \\label{fig:2PhEnergyLevels}}\n\\end{figure}\n\n\nA key theoretical issue of the USC regime is the distinction between bare (unobservable) excitations and physical particles that can be detected \\cite{Ridolfo2012,Stassi2013}.\nFor example, when the counter-rotating terms are taken into account, the mean photon number in the system ground state becomes different from zero: $\\langle 0|\\hat a^{\\dagger} \\hat a|0 \\rangle\\neq 0$.\nHowever, these photons are actually virtual \\cite{Ridolfo2012} because they do not correspond to real particles that can be detected in a photon-counting experiment. The same problem holds for the excited states.\nAccording to these analyses, the presence of an $n$-photon contribution in a specific eigenstate of the system does not imply that the system can emit $n$ photons when prepared in this state.\n\nIn order to fully understand and characterize this anomalous avoided crossing not present in the RWA, a more quantitative analysis is required.\nIn the following, we therefore calculate the output signals and correlations which can be measured in a photodetection experiment.\nWe fix the cavity frequency at the value where the splitting between level 3 and 4 is minimum. Instead of starting from the ideal initial state $(|3 \\rangle - |4 \\rangle)/\\sqrt{2} \\approx |g,g,1 \\rangle$, more realistically, we consider the system initially \nin its ground state $|0 \\rangle \\approx |g,g,0 \\rangle$ and\n study the direct excitation of the cavity by an electromagnetic Gaussian pulse with central frequency $\\omega_{\\rm d} = (\\omega_{4,0} + \\omega_{3,0})/2$.\nIn this strongly-dispersive regime, the resonator displays very low anharmonicity, so that for a strong system excitation as that induced by a $\\pi$-pulse, higher-energy states of the resonator (as the state $| 8 \\rangle \\simeq |g,g,2 \\rangle$) can be resonantly populated.\nThis problem can be avoided by feeding the system with a single photon input or by probing the system in the weak-excitation regime. However, in order to achieve a deterministic transition $| g,g,1 \\rangle \\to |e,e,0 \\rangle$, a useful route involves introducing a Kerr nonlinearity into the resonator, able to activate a photon blockade.  In circuit QED this can be realized by introducing some additional Josephson junction, or coupling the resonator with weakly-detuned artificial atoms  \\cite{Hoffman2011}. This additional nonlinearity can be described by the Hamiltonian term $\\hat H_{\\rm K} = \\mu\\,  \\hat a^{\\dag\\, 2}\\,  \\hat a^2$.\nThe driving Hamiltonian, describing the system excitation by a coherent electromagnetic pulse is $\n\\hat H_{\\rm d}(t) = {\\cal E}(t) \\cos (\\omega t) \\hat X$, \nwhere ${\\cal E}(t) = A \\exp{[-(t-t_0)^2/(2 \\tau^2)]}/(\\tau \\sqrt{2 \\pi})$. Here, $A$ and $\\tau$ are the amplitude  and the standard deviation of the Gaussian pulse, respectively.\n$A$ includes the factor $\\sqrt{\\kappa}$, where $\\kappa$ is the loss rate through the cavity port.\nThe system is thus under the influence of the total Hamiltonian $\\hat H = \\hat H_0 + \\hat H_{\\rm K} + \\hat H_{\\rm d}(t)$.\n\n\n  The output photon flux emitted by a resonator can be expressed as $\\Phi_{\\rm out}= \\kappa \\langle \\hat X^{-} \\hat X^{+}\\rangle$, where $\\hat X^{+}=\\sum_{j,k>j}X_{jk}|j\\rangle \\langle k|$ and $\\hat X^{-}=(\\hat X^{+})^{\\dagger}$, with $X_{jk}\\equiv \\langle j| (\\hat a^{\\dagger}+\\hat a)|k\\rangle$, are the positive and negative frequency cavity-photon operators \\cite{Garziano2013,Garziano2015}. Neglecting the counter-rotating terms, or in the limit of negligible coupling rates, they coincide with $\\hat a$ and $\\hat a^\\dag$, respectively. \nThe signal directly emitted from the qubit is proportional to the qubit mean excitation number $\\langle \\hat C^- \\hat C^+ \\rangle$, where $\\hat C^\\pm$ are the qubit positive and negative frequency operators, defined as $\\hat C^{+}=\\sum_{j,k>j}C_{jk}|j\\rangle \\langle k|$ \\;and \\; $\\hat C^{-}=(\\hat C^{+})^{\\dagger}$, with $C_{jk}\\equiv \\langle j|(\\hat \\sigma_{-}+ \\hat \\sigma_{+})|k\\rangle$ \\cite{Garziano2013,Garziano2015}.  Neglecting the counter-rotating terms, or in the limit of negligible coupling rates, they coincide with $\\hat \\sigma_-$ and $\\hat \\sigma_+$, respectively. In circuit QED systems, this emission can be detected by coupling the qubit to an additional microwave antenna \\cite{Hofheinz2009}.\n\n\nThanks to the photon-blockade effect, induced by the Kerr interaction $\\hat H_{\\rm K}$, it is possible to resonantly excite the split states $| 3 \\rangle$ and $|4 \\rangle$ with a $\\pi$-pulse, so that after the pulse arrival the population is completely transferred from the ground state to only these two energy levels. We use a pulse width $\\tau = 1/(4\\, \\omega_{43})$.\n\n\\begin{figure}[ht]\n\t\\includegraphics[height= 100 mm]{Fig3.pdf}\n\t\\caption{(Color online) (a)  Time evolution of the cavity mean photon number $\\langle \\hat X^{-} \\hat X^{+}\\rangle$ (dotted blue curve),  qubit 1 mean excitation number $\\langle \\hat C_1^{-} \\hat C_1^{+}\\rangle$ (continuous black curve), and  the zero-delay two-qubit correlation function $G_{\\rm q}^{(2)} = \\langle \\hat C_1^- \\hat C_2^-\\hat C_2^+ \\hat C_1^+\\rangle$ (dashed red curve) after the arrival of a $\\pi$-like Gaussian pulse initially exciting the resonator. After the arrival of the pulse, the system undergoes vacuum Rabi oscillations showing the reversible joint absorption and re-emission of one photon by two qubits. $\\langle \\hat C_1^{-} \\hat C_1^{+}\\rangle$ and $G_{\\rm q}^{(2)}(t)$  are almost coincident. This perfect two-qubit correlation is a signature that the two qubits are jointly excited.\n(b)\tTime evolution of the cavity mean photon number (dotted blue curve),  the qubit  mean excitation number, and the two-qubit correlation  as in (a), but including the effect of cavity damping and atomic decay. The corresponding rates are $\\kappa = \\gamma = 4 \\times 10^{-5} \\omega_{\\rm q}$.\n\t\t} \\label{fig:2PhCorrelationFunction}\n\\end{figure}\n\n Figure~3a displays the numerically-calculated dynamics of the photon number  $\\langle \\hat X^{-} \\hat X^{+}\\rangle$, of the  mean excitation number $\\langle \\hat C_1^- \\hat C_1^+ \\rangle$ for qubit 1 (which, of course, coincides with that of qubit 2), and of the two-qubit correlation $G_{\\rm q}^{(2)} \\equiv \\langle \\hat C_1^- \\hat C_2^-\\hat C_2^+ \\hat C_1^+\\rangle$.\n Vacuum Rabi oscillations showing the reversible excitation exchange between the qubits and the resonator are clearly visible. \n  \n  We observe that, after a half Rabi period, $\\Omega_{\\rm eff}\\, t = \\pi/2$, the excitation is fully transferred to the two qubits which reach an excitation probability approaching one. Hence, not only the multiatom absorption of a single photon is possible, but it can  essentially be deterministic. \n  We observe that the single-qubit excitation $\\langle \\hat C_i^- \\hat C_i^+ \\rangle$ and $G_{\\rm q}^{(2)}$  almost coincide at any time. This almost-perfect two-qubit correlation is a clear signature of the joint excitation: if one qubit gets excited, the probability that also the other one is excited is very close to one.\n  In summary, an electromagnetic pulse is able, thanks to the photon blockade effect, to generate a \\textit{single} cavity-photon, which then gets jointly absorbed by a \\textit{couple} of qubits. \n  The resonant coupling can be stopped at this time, {e.g.}, by changing the resonance frequency of the qubits. If not, the reverse process starts, where two qubits jointly emit a  \\textit{single} photon:  $|e,e,0 \\rangle \\to |g,g,1 \\rangle$. \n  We observe that  $\\langle \\hat X^{-} \\hat X^{+}\\rangle$ is not exactly zero at the photon minima. This occurs because the two-qubit excited state, owing to the same processes inducing its coupling with the one-photon state, acquires a dipole transition matrix element, so that this state is able to emit photons. We find that (not shown here) this effects increase when increasing the atom-field coupling strength $\\lambda$.\n   In order to exclude that this joint qubit excitation does not occur via more conventional paths, involving the creation of photon pairs and/or a 1-qubit-1-photon excitation, we have also calculated the photonic second-order correlation function  $G_{\\rm c}^{(2)} \\equiv \\langle (\\hat X^-)^2 (\\hat X^+)^2\\rangle$\n  and the qubit-cavity correlation  $G_{\\rm qc}^{(2)} \\equiv \\langle \\hat C_i^- \\hat X^-\\hat X^+ \\hat C_i^+\\rangle$. We find that their value is more than two orders of magnitude lower than that of the two-qubit correlation  $G_{\\rm q}^{(2)}$.\n  \n  Figure~3a has been obtained without including loss effects.\nThe influence of cavity field damping and atomic decay on the  process can be studied by the master equation approach. We consider the system interacting with zero-temperature baths.\nBy using the Born-Markov approximation without the post-trace RWA \\cite{Law2015},  the resulting  master equation  for the reduced density matrix of the system is\n\n", "itemtype": "equation", "pos": 6471, "prevtext": "\n\n\n\n\n\n\n\n\n\n\n\\title{A Single Photon Can Simultaneously Excite Two or More Atoms}\n\n\n\n\n\n\n\n\n\n\n\n\\author{Luigi Garziano$^{1,2}$}\n\n\\author{Vincenzo Macr\\`{i}$^1$}\n\\author{Roberto Stassi$^{1,2}$}\n\\author{Omar Di Stefano$^1$}\n\\author{Franco Nori$^{2,3}$}\n\\author{Salvatore Savasta$^{1,2}$}\n\n\\affiliation{$^1$Dipartimento di Fisica e di Scienze della Terra, Universit\\`{a} di Messina, I-98166 Messina, Italy,}\n\\affiliation{$^2$CEMS, RIKEN, Saitama 351-0198, Japan,}\n\\affiliation{$^3$Physics Department, The University of Michigan, Ann Arbor, Michigan 48109-1040, USA}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\nWe consider two separate atoms interacting with a single-mode optical resonator. When the frequency of the resonator field is twice the atomic transition frequency, we show that there \nexists a resonant  coupling between \\textit{one} photon and \\textit{two} atoms,  via intermediate virtual states connected by counter-rotating processes. If the resonator is prepared in its one-photon state, the photon can be jointly absorbed by the two atoms in their ground state which will both reach their excited state with probability close to one. Like ordinary quantum Rabi oscillations, this process is coherent and reversible, so that two atoms in their excited state will undergo a downward transition jointly emitting a single cavity photon. \nThis joint absorption and emission processes can also occur with three atoms. The parameters used to investigate this process correspond to experimentally demonstrated values in circuit quantum electrodynamics systems.\n\n\n\n\n\n\n\n\n\\end{abstract}\n\n\n\\pacs{ 42.50.Pq, 42.50.Ct, 85.25.Cp, 84.40.Az}\n\n\n\n\n\\maketitle\n\n\n\n\n\n\n\n\n\n\n\n\nMultiphoton excitation and emission processes were predicted in 1931 by Maria G{\\\"{o}ppert-Mayer  in her doctoral dissertation on the theory of two-photon quantum transitions \\cite{Goeppert-Mayer1931}. Two-photon absorption consists in the simultaneous absorption of two photons of identical or different frequencies by an atom or a molecule.\n\nTwo-photon excitation is now a powerful spectroscopic and diagnostic tool \\cite{Denk1990,So2000}. \nOne may wonder if the reverse phenomenon, {i.e.}, joint multiatom emission of one photon or  multiatom excitation with a single photon, is ever possible.\nWe show that these processes, not only can be enabled by the strong correlation between the states of the atoms and those of the field occurring in cavity quantum electrodynamics (QED) \\cite{Haroche2006}, but they can even take place with probability approaching one.\n\nCavity QED investigates the interaction of confined electromagnetic field modes with natural or artificial atoms  under conditions where the quantum nature of light affects the system dynamics \\cite{Haroche2013,Haroche2013a}.\n A high degree of manipulation and control of quantum systems can be reached in the strong-coupling regime, where the atom-field coupling rate is dominant with respect to the loss and decoherence rates.\n This paves the way for\nmany interesting physical applications \\cite{Deleglise2008, Hofheinz2009,Haroche2013a, Vlastakis2013}.\nCavity QED is also very promising for the realization of  quantum gates \\cite{Rauschenbeutel1999, Zheng2000, You2006} and quantum networks for quantum computational tasks \\cite{Felinto2006,Kimble2008,Ritter2012}.\nMany of the proposed concepts, pioneered with flying atoms,\nhave been adapted and further developed using superconducting\nartificial atoms in the electromagnetic field of microwave\nresonators, giving rise\nto the rapidly growing  field of circuit QED, which is very\npromising for future quantum technologies \\cite{You2003,Blais2004,Wallraff2004,Chiorescu2004,You2006, Hofheinz2009,Vlastakis2013}.\nIn these systems, coupling rates between an individual qubit and a single electromagnetic mode of the order of $10 \\%$ of the unperturbed frequency\n of the bare subsystems have been experimentally reached \\cite{Niemczyk2010, Forn-Diaz2010, Fedorov2010,Forn-Diaz2015}. Such a coupling rate is significantly higher than that obtained using natural atoms. \n\n\n Such an ultrastrong coupling (USC) opens the door to the study of the physics of virtual processes which do not conserve the number of excitations governed by the counter-rotating terms in the interaction Hamiltonian \\cite{DeLiberato2009,Ai2010,Cao2010,Cao2011,Stassi2013,Ridolfo2013,Garziano2013,Garziano2014,Huang2014,Zhao2015}.\nRecently, it has been shown that these excitation-number-nonconserving processes enable higher order atom-field  resonant transitions, making possible  coherent and reversible multiphoton exchanges between the qubit and the resonator \\cite{Zhu2013,Law2015,Garziano2015}.\n\n\nHere we examine  a quantum system constituted by two two-level atoms coupled to a single-mode resonator in the regime where the field-atom detuning $\\Delta =\\omega_{\\rm c} - \\omega_{\\rm q}$ is large ($\\omega_{\\rm c}$ and $\\omega_{\\rm q}$ are the resonance frequency of the cavity mode  and the qubit transition frequency). \nWe investigate the situation where the two qubits are initially in their ground state and one photon is present in the resonator, corresponding to the initial state $|g,g,1 \\rangle$.  We find that, if $\\omega_{\\rm c} \\approx 2 \\omega_{\\rm q}$, a single cavity photon  is able to excite simultaneously two independent atoms. During this process no parametric down-conversion,  splitting the initial photon into observable pairs of photons at frequency $\\omega_{\\rm c}/2$, occurs. The cavity photon is directly and jointly absorbed by the two atoms.\nAs shown in Fig.~1, the initial state $|g,g,1 \\rangle$ goes to  virtual\nintermediate states that do not conserve the energy, but comes back to the real final state\n$|e,e,0 \\rangle$ that does conserve energy.\n If $\\omega_{\\rm c} \\approx 3 \\omega_{\\rm q}$ the simultaneous excitation of three atoms:  $|g,g,g,1 \\rangle \\to |e,e,e,0 \\rangle$ is also possible. If the coupling is sufficiently strong, even a higher number of atoms can be excited with a single photon. Owing to optical selection rules, the two-atom process requires  parity-symmetry breaking of the atomic potentials, which can be easily  achieved in superconducting artificial atoms \\cite{Liu2005,Gross2008,Zhu2013}. On the contrary, the three-atom  process does not need broken symmetry.\n\nThe Hamiltonian describing the system consisting of a single cavity mode interacting with two or more identical qubits with possible symmetry-broken potentials  is given by \\cite{Niemczyk2010,Garziano2014}\n\n", "index": 1, "text": "\\begin{equation}\n\\hat H_0 =  \\hat H_{\\rm q} + \\hat H_{\\rm c} + \\lambda  \\hat X\n \\sum_i\n (\\cos \\theta\\,  \\hat \\sigma^{(i)}_x + \\sin \\theta\\, \\hat \\sigma^{(i)}_z )\\, ,\n\\label{HH}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\hat{H}_{0}=\\hat{H}_{\\rm q}+\\hat{H}_{\\rm c}+\\lambda\\hat{X}\\sum_{i}(\\cos\\theta%&#10;\\,\\hat{\\sigma}^{(i)}_{x}+\\sin\\theta\\,\\hat{\\sigma}^{(i)}_{z})\\,,\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub><mo>=</mo><mrow><msub><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">q</mi></msub><mo>+</mo><msub><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">c</mi></msub><mo>+</mo><mrow><mi>λ</mi><mo>⁢</mo><mover accent=\"true\"><mi>X</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>x</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow><mo>+</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\nwhere the superoperator ${\\cal D}$ is defined as \n$\\mathcal{D}[\\hat O]\\hat\\rho=\\frac{1}{2}(2 \\hat O\\, \\hat\\rho\\, \\hat O^{\\dagger}-\\hat \\rho\\, \\hat O^{\\dagger}\\, \\hat O-\\hat O^{\\dagger}\\, \\hat O\\,  \\hat \\rho)$.\nWe use $\\kappa = \\gamma = 3 \\times 10^{-5}\\,  \\omega_{\\rm q}$. Figure~3b shows how the cavity losses and the atomic decay affects the system dynamics. As expected, the \nvacuum Rabi oscillations undergo damping and, as expected, the two-qubit correlation is more fragile to losses.\nFinally, we have also considered the case when the two qubits display different coupling rates with the resonator field. We used $\\lambda_1 /\\omega_{\\rm q}= 8 \\times 10^{-2}$ and \n$\\lambda_2 /\\omega_{\\rm q}= 1.2 \\times 10^{-1}$. We found that also in this case \n$\\langle \\hat C_1^- \\hat C_1^+ \\rangle = \\langle \\hat C_2^- \\hat C_2^+ \\rangle \\simeq  G_{\\rm q}^{(2)}$. This result \\textit{further confirms the simultaneous and joint nature of this multiatom process}.\n\nThe processes described here can be observed by placing two superconducting artificial atoms at opposite ends of a superconducting transmission line resonator \\cite{Majer2007}.\nThese multi-atom excitation and emission processes can find useful applications for the development of novel quantum technologies. Conditional quantum-state transfer is a first possible application: the quantum information stored in one of the two qubits can be transferred to the resonator conditioned by the state of the second qubit. We also observe that the quantum Rabi oscillations displayed in Fig.~3 imply that  a hybrid entangled GHZ state, $(|g,g,1 \\rangle + |e,e,0 \\rangle)/ \\sqrt{2}$, can be obtained by an elementary quantum Rabi process\nafter a time $t = \\pi/(4 \\Omega_{\\rm eff})$. This state can be stored by just changing the transition frequency of one of the two qubits.\n\nBesides possible applications, the puzzling results presented here, showing that \\textit{one} photon can divide its energy into \\textit{two} spatially-separated atoms, and that vacuum fluctuations \\cite{Norirmp} can induce separate atoms to  behave as a single quantum entity (as testified by the one-photon transition matrix element acquired by the transition $|g,g \\rangle \\to |e,e \\rangle$), provide new insights into the quantum aspects of the interaction between light and matter.\n\nWe hope that this proposal for the\nsimultaneous excitation of two or three atoms with a single photon, might be effective in producing the\nsimultaneous excitation of two or three referees with a single manuscript.\n\nThis work is partially supported by the RIKEN iTHES Project, the MURI Center for Dynamic Magneto-Optics via the AFOSR award number FA9550-14-1-0040,\nthe IMPACT program of JST, a Grant-in-Aid for Scientific Research (A), and  from the MPNS\nCOST Action MP1403 Nanoscale Quantum Optics.\n\\newline\n\\newline\n\\noindent\n\\begin{center}\n{\\Large \\bf Supplemental Material:}\n\n\\vspace{0.7 cm}\n\\noindent {\\bf DERIVATION OF THE EFFECTIVE HAMILTONIAN}\n\\end{center}\nAccording to standard time-dependent perturbation theory, for a constant perturbation switched-on at $t=0$, the resulting transition rate can be expressed as\n\n", "itemtype": "equation", "pos": 21791, "prevtext": "\nwhere  $\\hat H_{\\rm q} = ({\\omega_{\\rm q}}/{2}) \\sum_i  \\hat \\sigma^{(i)}_z $ and $ \\hat H_{\\rm c} =\\omega_{\\rm c} \\hat a^\\dag \\hat a$, describe the qubit and cavity Hamiltonians in the absence of interaction, $\\hat X =  \\hat a + \\hat a^\\dag$, $\\hat \\sigma^{(i)}_x$ and $\\hat \\sigma^{(i)}_z$\nare Pauli operators for the $i$th qubit, and $\\lambda$ is the coupling rate of each qubit to the cavity mode. For $\\theta= 0$ parity is conserved. For flux qubits, this angle, as well as the transition frequency $\\omega_{\\rm q}$, can be continuously tuned by changing the external flux bias \\cite{Liu2005,Niemczyk2010}. For the sake of simplicity, Eq.~(\\ref{HH}) describes identical qubits, but this is not an essential point.\nIn contrast to the Jaynes-Cummings (JC) model, the Hamiltonian in Eq.~(\\ref{HH}) explicitly contains counter-rotating\n terms of the form $\\hat \\sigma^{(i)}_+ \\hat a^\\dag$, $\\hat \\sigma^{(i)}_- \\hat a$, $\\hat \\sigma^{(i)}_z \\hat a^\\dag$, and $\\hat \\sigma^{(i)}_z \\hat a$. The first (second) term creates (destroys) two excitations while the third (fourth) term creates (destroy) one excitation.\n\nThe presence of counter-rotating terms in the interaction Hamiltonian enables four different paths which, starting from the initial state $|g,g,1 \\rangle$,  reach the final state $|e,e,0 \\rangle$ (see Supplemental Fig.~S1 \\cite{SuppMat}). Each path includes three virtual transitions involving out-of-resonance intermediate states. Fig.~1 only displays  the process that gives the main contribution to the effective coupling between the bare states $|g,g,1 \\rangle$ and  $|e,e,0 \\rangle$. Higher-order processes, depending on the atom-field interaction strength, can also contribute. By applying standard third-order perturbation theory, we obtain the following effective coupling rate, $\\Omega_{\\rm eff}/\\omega_{\\rm q}  \\equiv  (8/3)(\\lambda/\\omega_{\\rm q})^3 \\sin \\theta \\cos^2{\\theta}$. The analytical derivation of the  effective coupling rate as a function of $ \\lambda/\\omega_{\\rm q} $ is presented in the Supplemental Material \\cite{SuppMat}. Already at a coupling rate $\\lambda/ \\omega_{\\rm q} = 0.1$, an effective (two qubits)-(one photon) coupling rate $\\Omega_{\\rm eff}/\\omega_{\\rm q} \\sim 10^{-3}$ can be obtained. \n\n\\begin{figure}[!ht]\n\t\\centering\n\t\\includegraphics[scale=0.20]{Fig1.pdf}\n\t\\caption{(Color online) Sketch of the process giving the main contribution to the effective coupling between the bare states $| g,g,1 \\rangle$ and $|e,e,0 \\rangle$, via intermediate virtual transitions. Here, the excitation-number nonconserving processes are represented by arrowed dashed line. The transition matrix elements are also shown.\n\t \\label{fig:1}}\n\\end{figure}\n\n\nWe diagonalize numerically the Hamiltonian in Eq.~(\\ref{HH}) for the case of two qubits and indicate the resulting energy eigenvalues and eigenstates as $\\hbar \\omega_{i}$ and  $| i\\rangle$  with $i = 0, 1, \\dots$, choosing the labelling of the states  such that $\\omega_{k} > \\omega_{j}$ for $k>j$.  We use a normalized coupling rate $\\lambda / \\omega_{\\rm q} = 0.1$ and an angle $\\theta = \\pi/6$.   \nFigure~2a shows the frequency differences $\\omega_{i,0} = \\omega_{i} - \\omega_{0}$ for the lowest energy states as a function of the resonator frequency.\nStarting from the lowest excited states of the spectrum, a large splitting anticrossing around $\\omega_{\\rm c} / \\omega_{\\rm q} =1$ can be observed (see arrows in Fig.~2a). It corresponds to the standard vacuum Rabi splitting, which appears also when neglecting the counter-rotating terms. The straight line at $E/  \\omega_{\\rm q} =1$ corresponds to the dark antisymmetric state $(|g,e,0 \\rangle - |e,g,0 \\rangle)/\\sqrt{2}$. Even larger splitting anticrossings around $\\omega_{\\rm c} / \\omega_{\\rm q} =1$ can be observed at higher $E$ values. These correspond to the second and third rung of the JC ladder. We are interested in the region around $\\omega_{\\rm c} / \\omega_{\\rm q} =2$, where the levels 3 and 4  display an apparent crossing at $E / \\omega_{\\rm q} \\approx 2$. Actually, what appears as a crossing on this scale, it turns out to be a splitting anticrossing on an enlarged view as in Fig.~2b.\nObserving that just outside this avoided-crossing region one level remains flat as a function of $\\omega_{\\rm c}$ with energy $\\omega \\approx 2 \\omega_{\\rm q}$, while the other grows as $\\omega_{\\rm c}$, this splitting clearly originates from the hybridization of the states $|e,e,0 \\rangle$ and $|g,g, 1 \\rangle$. The resulting states are well approximated by the states $(|e,e,0 \\rangle  \\pm |g,g, 1 \\rangle)/\\sqrt{2}$.\n This splitting is not present in the rotating-wave approximation (RWA), where the coherent coupling between states with a different number of excitations is not allowed, nor does it occur in the absence of symmetry breaking ($\\theta =0$). The normalized splitting has a value 2 $\\Omega_{\\rm eff } / \\omega_{\\rm q} = 1.97 \\times 10^{-3}$, which is in good agreement with  $2 \\times 10^{-3} $, obtained within perturbation theory. This observed hybridization opens the way to the observation of weird effects such as the simultaneous excitations of \\textit{two} qubits with only \\textit{one} cavity photon. Such a coupling between the states $|e,e,0 \\rangle$ and $|g,g,1 \\rangle$ can be analytically described by the effective interaction Hamiltonian $H_{\\rm eff} = -\\Omega_{\\rm eff} (|e,e,0 \\rangle \\langle g,g,1| + {\\rm H.c.})$.\n\n\\begin{figure}[!ht]\n\t\\includegraphics[scale=.40]{Fig2.pdf}\n\t\\caption{(Color online) (a) Frequency differences $\\omega_{i,0} = \\omega_{i} - \\omega_{0}$ for the lowest energy eigenstates of Hamiltonian~(\\ref{HH}) as a function of $\\omega_{\\rm c}/ \\omega_{\\rm q}$. Here we consider a normalized coupling rate $\\lambda/\\omega_{\\rm q}=0.1$ between the resonator and each of the qubits. We used $\\theta = \\pi/6$. The black arrows indicate the ordinary vacuum splitting arising from the coupling between the states $|g,g,1 \\rangle$ and $(1 /\\sqrt{2}) ( |g,e,0 \\rangle + |e,g,0 \\rangle)$.\n\t\t(b) Enlarged view of the spectral region delimited by a square in panel (a). This shows an avoided-level crossing,  demonstrating  the coupling between the states $|g,g,1 \\rangle$ and $|e,e,0 \\rangle$ due to the presence of counter-rotating terms in the system Hamiltonian. \\label{fig:2PhEnergyLevels}}\n\\end{figure}\n\n\nA key theoretical issue of the USC regime is the distinction between bare (unobservable) excitations and physical particles that can be detected \\cite{Ridolfo2012,Stassi2013}.\nFor example, when the counter-rotating terms are taken into account, the mean photon number in the system ground state becomes different from zero: $\\langle 0|\\hat a^{\\dagger} \\hat a|0 \\rangle\\neq 0$.\nHowever, these photons are actually virtual \\cite{Ridolfo2012} because they do not correspond to real particles that can be detected in a photon-counting experiment. The same problem holds for the excited states.\nAccording to these analyses, the presence of an $n$-photon contribution in a specific eigenstate of the system does not imply that the system can emit $n$ photons when prepared in this state.\n\nIn order to fully understand and characterize this anomalous avoided crossing not present in the RWA, a more quantitative analysis is required.\nIn the following, we therefore calculate the output signals and correlations which can be measured in a photodetection experiment.\nWe fix the cavity frequency at the value where the splitting between level 3 and 4 is minimum. Instead of starting from the ideal initial state $(|3 \\rangle - |4 \\rangle)/\\sqrt{2} \\approx |g,g,1 \\rangle$, more realistically, we consider the system initially \nin its ground state $|0 \\rangle \\approx |g,g,0 \\rangle$ and\n study the direct excitation of the cavity by an electromagnetic Gaussian pulse with central frequency $\\omega_{\\rm d} = (\\omega_{4,0} + \\omega_{3,0})/2$.\nIn this strongly-dispersive regime, the resonator displays very low anharmonicity, so that for a strong system excitation as that induced by a $\\pi$-pulse, higher-energy states of the resonator (as the state $| 8 \\rangle \\simeq |g,g,2 \\rangle$) can be resonantly populated.\nThis problem can be avoided by feeding the system with a single photon input or by probing the system in the weak-excitation regime. However, in order to achieve a deterministic transition $| g,g,1 \\rangle \\to |e,e,0 \\rangle$, a useful route involves introducing a Kerr nonlinearity into the resonator, able to activate a photon blockade.  In circuit QED this can be realized by introducing some additional Josephson junction, or coupling the resonator with weakly-detuned artificial atoms  \\cite{Hoffman2011}. This additional nonlinearity can be described by the Hamiltonian term $\\hat H_{\\rm K} = \\mu\\,  \\hat a^{\\dag\\, 2}\\,  \\hat a^2$.\nThe driving Hamiltonian, describing the system excitation by a coherent electromagnetic pulse is $\n\\hat H_{\\rm d}(t) = {\\cal E}(t) \\cos (\\omega t) \\hat X$, \nwhere ${\\cal E}(t) = A \\exp{[-(t-t_0)^2/(2 \\tau^2)]}/(\\tau \\sqrt{2 \\pi})$. Here, $A$ and $\\tau$ are the amplitude  and the standard deviation of the Gaussian pulse, respectively.\n$A$ includes the factor $\\sqrt{\\kappa}$, where $\\kappa$ is the loss rate through the cavity port.\nThe system is thus under the influence of the total Hamiltonian $\\hat H = \\hat H_0 + \\hat H_{\\rm K} + \\hat H_{\\rm d}(t)$.\n\n\n  The output photon flux emitted by a resonator can be expressed as $\\Phi_{\\rm out}= \\kappa \\langle \\hat X^{-} \\hat X^{+}\\rangle$, where $\\hat X^{+}=\\sum_{j,k>j}X_{jk}|j\\rangle \\langle k|$ and $\\hat X^{-}=(\\hat X^{+})^{\\dagger}$, with $X_{jk}\\equiv \\langle j| (\\hat a^{\\dagger}+\\hat a)|k\\rangle$, are the positive and negative frequency cavity-photon operators \\cite{Garziano2013,Garziano2015}. Neglecting the counter-rotating terms, or in the limit of negligible coupling rates, they coincide with $\\hat a$ and $\\hat a^\\dag$, respectively. \nThe signal directly emitted from the qubit is proportional to the qubit mean excitation number $\\langle \\hat C^- \\hat C^+ \\rangle$, where $\\hat C^\\pm$ are the qubit positive and negative frequency operators, defined as $\\hat C^{+}=\\sum_{j,k>j}C_{jk}|j\\rangle \\langle k|$ \\;and \\; $\\hat C^{-}=(\\hat C^{+})^{\\dagger}$, with $C_{jk}\\equiv \\langle j|(\\hat \\sigma_{-}+ \\hat \\sigma_{+})|k\\rangle$ \\cite{Garziano2013,Garziano2015}.  Neglecting the counter-rotating terms, or in the limit of negligible coupling rates, they coincide with $\\hat \\sigma_-$ and $\\hat \\sigma_+$, respectively. In circuit QED systems, this emission can be detected by coupling the qubit to an additional microwave antenna \\cite{Hofheinz2009}.\n\n\nThanks to the photon-blockade effect, induced by the Kerr interaction $\\hat H_{\\rm K}$, it is possible to resonantly excite the split states $| 3 \\rangle$ and $|4 \\rangle$ with a $\\pi$-pulse, so that after the pulse arrival the population is completely transferred from the ground state to only these two energy levels. We use a pulse width $\\tau = 1/(4\\, \\omega_{43})$.\n\n\\begin{figure}[ht]\n\t\\includegraphics[height= 100 mm]{Fig3.pdf}\n\t\\caption{(Color online) (a)  Time evolution of the cavity mean photon number $\\langle \\hat X^{-} \\hat X^{+}\\rangle$ (dotted blue curve),  qubit 1 mean excitation number $\\langle \\hat C_1^{-} \\hat C_1^{+}\\rangle$ (continuous black curve), and  the zero-delay two-qubit correlation function $G_{\\rm q}^{(2)} = \\langle \\hat C_1^- \\hat C_2^-\\hat C_2^+ \\hat C_1^+\\rangle$ (dashed red curve) after the arrival of a $\\pi$-like Gaussian pulse initially exciting the resonator. After the arrival of the pulse, the system undergoes vacuum Rabi oscillations showing the reversible joint absorption and re-emission of one photon by two qubits. $\\langle \\hat C_1^{-} \\hat C_1^{+}\\rangle$ and $G_{\\rm q}^{(2)}(t)$  are almost coincident. This perfect two-qubit correlation is a signature that the two qubits are jointly excited.\n(b)\tTime evolution of the cavity mean photon number (dotted blue curve),  the qubit  mean excitation number, and the two-qubit correlation  as in (a), but including the effect of cavity damping and atomic decay. The corresponding rates are $\\kappa = \\gamma = 4 \\times 10^{-5} \\omega_{\\rm q}$.\n\t\t} \\label{fig:2PhCorrelationFunction}\n\\end{figure}\n\n Figure~3a displays the numerically-calculated dynamics of the photon number  $\\langle \\hat X^{-} \\hat X^{+}\\rangle$, of the  mean excitation number $\\langle \\hat C_1^- \\hat C_1^+ \\rangle$ for qubit 1 (which, of course, coincides with that of qubit 2), and of the two-qubit correlation $G_{\\rm q}^{(2)} \\equiv \\langle \\hat C_1^- \\hat C_2^-\\hat C_2^+ \\hat C_1^+\\rangle$.\n Vacuum Rabi oscillations showing the reversible excitation exchange between the qubits and the resonator are clearly visible. \n  \n  We observe that, after a half Rabi period, $\\Omega_{\\rm eff}\\, t = \\pi/2$, the excitation is fully transferred to the two qubits which reach an excitation probability approaching one. Hence, not only the multiatom absorption of a single photon is possible, but it can  essentially be deterministic. \n  We observe that the single-qubit excitation $\\langle \\hat C_i^- \\hat C_i^+ \\rangle$ and $G_{\\rm q}^{(2)}$  almost coincide at any time. This almost-perfect two-qubit correlation is a clear signature of the joint excitation: if one qubit gets excited, the probability that also the other one is excited is very close to one.\n  In summary, an electromagnetic pulse is able, thanks to the photon blockade effect, to generate a \\textit{single} cavity-photon, which then gets jointly absorbed by a \\textit{couple} of qubits. \n  The resonant coupling can be stopped at this time, {e.g.}, by changing the resonance frequency of the qubits. If not, the reverse process starts, where two qubits jointly emit a  \\textit{single} photon:  $|e,e,0 \\rangle \\to |g,g,1 \\rangle$. \n  We observe that  $\\langle \\hat X^{-} \\hat X^{+}\\rangle$ is not exactly zero at the photon minima. This occurs because the two-qubit excited state, owing to the same processes inducing its coupling with the one-photon state, acquires a dipole transition matrix element, so that this state is able to emit photons. We find that (not shown here) this effects increase when increasing the atom-field coupling strength $\\lambda$.\n   In order to exclude that this joint qubit excitation does not occur via more conventional paths, involving the creation of photon pairs and/or a 1-qubit-1-photon excitation, we have also calculated the photonic second-order correlation function  $G_{\\rm c}^{(2)} \\equiv \\langle (\\hat X^-)^2 (\\hat X^+)^2\\rangle$\n  and the qubit-cavity correlation  $G_{\\rm qc}^{(2)} \\equiv \\langle \\hat C_i^- \\hat X^-\\hat X^+ \\hat C_i^+\\rangle$. We find that their value is more than two orders of magnitude lower than that of the two-qubit correlation  $G_{\\rm q}^{(2)}$.\n  \n  Figure~3a has been obtained without including loss effects.\nThe influence of cavity field damping and atomic decay on the  process can be studied by the master equation approach. We consider the system interacting with zero-temperature baths.\nBy using the Born-Markov approximation without the post-trace RWA \\cite{Law2015},  the resulting  master equation  for the reduced density matrix of the system is\n\n", "index": 3, "text": "\\begin{equation}\\label{ME}\n\\dot{\\hat\\rho}= i [\\hat \\rho(t),\\hat H] + \\kappa {\\cal D}\\, [\\hat X^+]{\\hat\\rho}\n+ \\gamma \\sum_i  {\\cal D}[\\hat C_i^+]\\, {\\hat\\rho}\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\hat{\\rho}}=i[\\hat{\\rho}(t),\\hat{H}]+\\kappa{\\cal D}\\,[\\hat{X}^{+}]{\\hat{%&#10;\\rho}}+\\gamma\\sum_{i}{\\cal D}[\\hat{C}_{i}^{+}]\\,{\\hat{\\rho}}\\,,\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover><mo>˙</mo></mover><mo>=</mo><mrow><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><mrow><mi>κ</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi class=\"ltx_font_mathcaligraphic\">𝒟</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mover accent=\"true\"><mi>X</mi><mo stretchy=\"false\">^</mo></mover><mo>+</mo></msup><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>+</mo><mrow><mi>γ</mi><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒟</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi><mo>+</mo></msubsup><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></mpadded></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\nwhere $i$ and $f$ label the initial and final states with corresponding energies $E_i$ and $E_f$,  and $V^{\\rm eff}_{f\\, i}$ describes the effective coupling strength connecting the initial and final states. In the framework of first-order perturbation theory, this effective coupling strength coincides with the matrix element of the generic  perturbing interaction $\\hat V$: $V^{\\rm eff}_{f i} = V_{f i}= \\langle f | \\hat V | i \\rangle$.\nIf $i$ and $f$ are coupled only via third-order perturbation theory, the resulting effective coupling strength is,\n\n", "itemtype": "equation", "pos": 25103, "prevtext": "\nwhere the superoperator ${\\cal D}$ is defined as \n$\\mathcal{D}[\\hat O]\\hat\\rho=\\frac{1}{2}(2 \\hat O\\, \\hat\\rho\\, \\hat O^{\\dagger}-\\hat \\rho\\, \\hat O^{\\dagger}\\, \\hat O-\\hat O^{\\dagger}\\, \\hat O\\,  \\hat \\rho)$.\nWe use $\\kappa = \\gamma = 3 \\times 10^{-5}\\,  \\omega_{\\rm q}$. Figure~3b shows how the cavity losses and the atomic decay affects the system dynamics. As expected, the \nvacuum Rabi oscillations undergo damping and, as expected, the two-qubit correlation is more fragile to losses.\nFinally, we have also considered the case when the two qubits display different coupling rates with the resonator field. We used $\\lambda_1 /\\omega_{\\rm q}= 8 \\times 10^{-2}$ and \n$\\lambda_2 /\\omega_{\\rm q}= 1.2 \\times 10^{-1}$. We found that also in this case \n$\\langle \\hat C_1^- \\hat C_1^+ \\rangle = \\langle \\hat C_2^- \\hat C_2^+ \\rangle \\simeq  G_{\\rm q}^{(2)}$. This result \\textit{further confirms the simultaneous and joint nature of this multiatom process}.\n\nThe processes described here can be observed by placing two superconducting artificial atoms at opposite ends of a superconducting transmission line resonator \\cite{Majer2007}.\nThese multi-atom excitation and emission processes can find useful applications for the development of novel quantum technologies. Conditional quantum-state transfer is a first possible application: the quantum information stored in one of the two qubits can be transferred to the resonator conditioned by the state of the second qubit. We also observe that the quantum Rabi oscillations displayed in Fig.~3 imply that  a hybrid entangled GHZ state, $(|g,g,1 \\rangle + |e,e,0 \\rangle)/ \\sqrt{2}$, can be obtained by an elementary quantum Rabi process\nafter a time $t = \\pi/(4 \\Omega_{\\rm eff})$. This state can be stored by just changing the transition frequency of one of the two qubits.\n\nBesides possible applications, the puzzling results presented here, showing that \\textit{one} photon can divide its energy into \\textit{two} spatially-separated atoms, and that vacuum fluctuations \\cite{Norirmp} can induce separate atoms to  behave as a single quantum entity (as testified by the one-photon transition matrix element acquired by the transition $|g,g \\rangle \\to |e,e \\rangle$), provide new insights into the quantum aspects of the interaction between light and matter.\n\nWe hope that this proposal for the\nsimultaneous excitation of two or three atoms with a single photon, might be effective in producing the\nsimultaneous excitation of two or three referees with a single manuscript.\n\nThis work is partially supported by the RIKEN iTHES Project, the MURI Center for Dynamic Magneto-Optics via the AFOSR award number FA9550-14-1-0040,\nthe IMPACT program of JST, a Grant-in-Aid for Scientific Research (A), and  from the MPNS\nCOST Action MP1403 Nanoscale Quantum Optics.\n\\newline\n\\newline\n\\noindent\n\\begin{center}\n{\\Large \\bf Supplemental Material:}\n\n\\vspace{0.7 cm}\n\\noindent {\\bf DERIVATION OF THE EFFECTIVE HAMILTONIAN}\n\\end{center}\nAccording to standard time-dependent perturbation theory, for a constant perturbation switched-on at $t=0$, the resulting transition rate can be expressed as\n\n", "index": 5, "text": "\\begin{equation}\n\tW_{i \\to f} = \\frac{2 \\pi}{\\hbar} |V^{\\rm eff}_{f i}|^2\\,  \\delta(E_f - E_i)\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"W_{i\\to f}=\\frac{2\\pi}{\\hbar}|V^{\\rm eff}_{fi}|^{2}\\,\\delta(E_{f}-E_{i})\\,,\" display=\"block\"><mrow><mrow><msub><mi>W</mi><mrow><mi>i</mi><mo>→</mo><mi>f</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mi mathvariant=\"normal\">ℏ</mi></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">|</mo><msubsup><mi>V</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi></mrow><mi>eff</mi></msubsup><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mpadded><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>f</mi></msub><mo>-</mo><msub><mi>E</mi><mi>i</mi></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\n\nIn the case when the states $|n \\rangle$ and $|m \\rangle$  are virtual intermediate states that do not conserve energy, the only effect of the perturbation is to couple, via these virtual intermediate states, the initial and final states. The same coupling can be described by the effective Hamiltonian\n\n", "itemtype": "equation", "pos": 25772, "prevtext": "\nwhere $i$ and $f$ label the initial and final states with corresponding energies $E_i$ and $E_f$,  and $V^{\\rm eff}_{f\\, i}$ describes the effective coupling strength connecting the initial and final states. In the framework of first-order perturbation theory, this effective coupling strength coincides with the matrix element of the generic  perturbing interaction $\\hat V$: $V^{\\rm eff}_{f i} = V_{f i}= \\langle f | \\hat V | i \\rangle$.\nIf $i$ and $f$ are coupled only via third-order perturbation theory, the resulting effective coupling strength is,\n\n", "index": 7, "text": "\\begin{equation}\\label{eff}\n\tV^{\\rm eff}_{f i} =  \\sum_{m,n} \\frac{V_{fn} V_{nm} V_{mi}}{(E_i - E_m)(E_i - E_n)}\\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"V^{\\rm eff}_{fi}=\\sum_{m,n}\\frac{V_{fn}V_{nm}V_{mi}}{(E_{i}-E_{m})(E_{i}-E_{n}%&#10;)}\\,.\" display=\"block\"><mrow><mrow><msubsup><mi>V</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi></mrow><mi>eff</mi></msubsup><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>,</mo><mi>n</mi></mrow></munder><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>V</mi><mrow><mi>f</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi></mrow></msub></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>i</mi></msub><mo>-</mo><msub><mi>E</mi><mi>m</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>i</mi></msub><mo>-</mo><msub><mi>E</mi><mi>n</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\nwith $V^{\\rm eff}_{f i}$ provided by Eq.~(2).\n\nWe observe that, applying first-order perturbation theory by using this effective Hamiltonian, we obtain the same result of standard  third-order perturbation theory with the real perturbation $\\hat V$. Hence, Eq.~(\\ref{eff}) describes the effective coupling strength between the energy-degenerate states $| g,g,1 \\rangle$ and\n$|e,e,0\\rangle$. We consider the case $\\omega_{\\rm c} \\approx 2 \\omega_{\\rm q}$ and a perturbation of the form:\n\n", "itemtype": "equation", "pos": 26208, "prevtext": "\n\nIn the case when the states $|n \\rangle$ and $|m \\rangle$  are virtual intermediate states that do not conserve energy, the only effect of the perturbation is to couple, via these virtual intermediate states, the initial and final states. The same coupling can be described by the effective Hamiltonian\n\n", "index": 9, "text": "\\begin{equation}\n\tH_{\\rm eff} = V^{\\rm eff}_{f i}\\, | f \\rangle \\langle i | + {\\rm H. c.}\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"H_{\\rm eff}=V^{\\rm eff}_{fi}\\,|f\\rangle\\langle i|+{\\rm H.c.}\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>H</mi><mi>eff</mi></msub><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msubsup><mi>V</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi></mrow><mi>eff</mi></msubsup></mpadded><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>f</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>i</mi><mo fence=\"true\" stretchy=\"false\">|</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">H</mi></mrow></mrow><mo>.</mo><mi mathvariant=\"normal\">c</mi></mrow><mo rspace=\"4.2pt\">.</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\n\n\\begin{figure}[!ht]\n\t\\centering\n\t\\includegraphics[height=19.8cm,width=8.5cm]{SuppFig1.pdf}\n\t\\caption{(Color online) Coupling between the bare states $| g,g,1 \\rangle$ and $|e,e,0 \\rangle$ via intermediate virtual transitions. Here, the excitation-number nonconserving processes are represented by the arrowed red dashed lines. The transition matrix elements are also shown (in blue).\n\t\t\\label{fig:1}}\n\\end{figure}\n\n\nAfter carefully inspecting all the possible intermediate states, we find that only the four paths shown in Fig.~S1 can connect the states $| g,g,1 \\rangle$ and\n$|e,e,0\\rangle$.\nApplying Eq.~(\\ref{eff}), we obtain,\n\n", "itemtype": "equation", "pos": 26803, "prevtext": "\nwith $V^{\\rm eff}_{f i}$ provided by Eq.~(2).\n\nWe observe that, applying first-order perturbation theory by using this effective Hamiltonian, we obtain the same result of standard  third-order perturbation theory with the real perturbation $\\hat V$. Hence, Eq.~(\\ref{eff}) describes the effective coupling strength between the energy-degenerate states $| g,g,1 \\rangle$ and\n$|e,e,0\\rangle$. We consider the case $\\omega_{\\rm c} \\approx 2 \\omega_{\\rm q}$ and a perturbation of the form:\n\n", "index": 11, "text": "\\begin{equation}\n\t\\hat V =\\lambda  \\hat X\n\t\\sum_i\n\t(\\cos \\theta\\,  \\hat \\sigma^{(i)}_x + \\sin \\theta\\, \\hat \\sigma^{(i)}_z )\\, .\n\t\\label{Hpert}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\hat{V}=\\lambda\\hat{X}\\sum_{i}(\\cos\\theta\\,\\hat{\\sigma}^{(i)}_{x}+\\sin\\theta\\,%&#10;\\hat{\\sigma}^{(i)}_{z})\\,.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>V</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mi>λ</mi><mo>⁢</mo><mover accent=\"true\"><mi>X</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>x</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow><mo>+</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mi>z</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00886.tex", "nexttext": "\n\n\n\n\\begin{figure}[ht!]\n\t\\includegraphics[height=70 mm]{SuppFig2}\n\t\\caption{(Color online) Comparison between the numerically-calculated normalized Rabi splitting (points)  (corresponding to twice the effective coupling between one cavity photon and two independent atoms) and the corresponding calculation using third-order perturbation theory (continuous red curve).\n\t}\\label{Fig2}\n\\end{figure}\nFigure~S2 displays the comparison of the magnitudes of the effective Rabi splitting $2  \\Omega_{\\rm eff}/ \\omega_{\\rm q} $  between the states  $| g,g,1 \\rangle$ and\n$|e,e,0\\rangle$ obtained analytically [Eq.~(5)] via third-order perturbation theory\nand by the numerical diagonalization of the Hamiltonian in Eq.~(1) (in the main text), as a function of  the normalized interaction strength $ \\lambda/\\omega_{\\rm q} $.\nThe agreement is very good, also  for coupling strengths $\\lambda$ beyond $10 \\%$ of the qubit transition frequency $\\omega_{\\rm q}$. This result confirms the $(\\lambda / \\omega_{\\rm q})^3$ proportionality of the effective (one-photon)-(two-atoms) coupling predicted by the above analysis.\n\n\\newpage\n\n\n\n\n\\bibliography{Riken}\n\n\n", "itemtype": "equation", "pos": 27593, "prevtext": "\n\n\\begin{figure}[!ht]\n\t\\centering\n\t\\includegraphics[height=19.8cm,width=8.5cm]{SuppFig1.pdf}\n\t\\caption{(Color online) Coupling between the bare states $| g,g,1 \\rangle$ and $|e,e,0 \\rangle$ via intermediate virtual transitions. Here, the excitation-number nonconserving processes are represented by the arrowed red dashed lines. The transition matrix elements are also shown (in blue).\n\t\t\\label{fig:1}}\n\\end{figure}\n\n\nAfter carefully inspecting all the possible intermediate states, we find that only the four paths shown in Fig.~S1 can connect the states $| g,g,1 \\rangle$ and\n$|e,e,0\\rangle$.\nApplying Eq.~(\\ref{eff}), we obtain,\n\n", "index": 13, "text": "\\begin{equation}\\label{eff1}\n\t\\Omega_{\\rm eff} \\equiv -  V^{\\rm eff}_{f i} = \\frac{8}{3}\\sin \\theta \\cos^2{\\theta}  \\left(\\frac{\\lambda}{\\omega_{\\rm q}}\\right)^3 \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Omega_{\\rm eff}\\equiv-V^{\\rm eff}_{fi}=\\frac{8}{3}\\sin\\theta\\cos^{2}{\\theta}%&#10;\\left(\\frac{\\lambda}{\\omega_{\\rm q}}\\right)^{3}\\,.\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>eff</mi></msub><mo>≡</mo><mrow><mo>-</mo><msubsup><mi>V</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi></mrow><mi>eff</mi></msubsup></mrow><mo>=</mo><mrow><mfrac><mn>8</mn><mn>3</mn></mfrac><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><msup><mi>cos</mi><mn>2</mn></msup><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><mi>λ</mi><msub><mi>ω</mi><mi mathvariant=\"normal\">q</mi></msub></mfrac><mo>)</mo></mrow><mn>3</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]