[{"file": "1601.01524.tex", "nexttext": "\n\nwherein $r$ is the separation from the star, $b$ is the galactic latitude, $m_{\\odot}$ is the apparent magnitude of the star in the observed filter, $\\Delta m_{max}$ is the maximum achieved contrast within the separation $r$, and $\\rho$ is the stellar density. \nTo estimate the stellar density as a function of the galactic latitude and the achieved magnitude limit, we utilize the TRILEGAL\\footnote{http://stev.oapd.inaf.it/cgi-bin/trilegal\\_1.6} population synthesis code by \\cite{2005A&A...436..895G}. We choose the default parameters for the different parts of the Galaxy and the lognormal initial mass function of \\cite{2001ApJ...554.1274C}.\nWe find that in an area of 1\\,deg$^2$ around Kepler-21 we should be able to detect 452 stars with a limiting magnitude of 12.86\\,mag in SDSS i-band. The limiting magnitude is the value that we are computing as described in section \\ref{sec: detect} for a separation of 0.8\\,arcsec.\nThis yields a stellar density $\\rho$ of 3.5$\\cdot10^{-5}$ sources per arcsec$^2$. Putting this into equation \\ref{prob} we find a probability of 6.5$\\cdot10^{-5}$ to detect an unrelated background or foreground source within 0.77\\,arcsec of Kepler-21.\nWe thus conclude that, given our astrometry, the most likely explanation is indeed that the companion candidate is physically bound to Kepler-21.\\\\\nKepler-21\\,B is located at a projected separation of only 87\\,au, which might indicate that it should have had a strong influence on the planet formation process. One possible scenario might be that the stellar companion excited high eccentricities in the forming planet causing close encounters with the primary star. The eccentricity could have then been damped by tidal heating which would have left the companion on a very short periodic circular orbit. Such scenarios have been suggested to occur in multiple planetary systems, where multiple objects interact dynamically, e.g. by \\cite{1996Sci...274..954R}. Given that the system is evolved ($\\sim$3.6\\,Gyr), it is consistent that we would now observe the end product of this interaction.     \n\n\\subsection{Kepler-68}\n\nThe star Kepler-68 hosts three known planets detected via transit and radial velocity observations by \\cite{2013ApJ...766...40G}. The innermost two of these planets have orbit periods in the order of days and masses in the order of several Earth masses and were detected in transit, while the outer planet d was found in radial velocity data and has a much longer orbit period of $\\sim$1.6\\,yr (semi-major axis of 1.4\\,au) and higher mass (m$\\cdot$sin(i) = 0.95\\,M$_{Jup}$). The inner planets appear to be on circular orbits while the outer planet exhibits an orbit eccentricity of 0.18. \\\\\nThe newly discovered stellar component Kepler-68\\,B is located at a projected separation of 1485\\,au. Due to this large separation, the expected period of Kozai-Lidov type resonances is in the order of several Gyr. It seems thus unlikely that the stellar component has a major influence on the dynamics of the inner system via this mechanism. It remains unclear if such a widely separated outer stellar component has a strong influence on the circumstellar disk in the planet formation phase. \nFollowing the argument of \\cite{2012ApJ...745...19K}, who studied the occurence rate of circumstellar disks in young binary systems, a major influence of the secondary stellar component is only expected for separations of up to 40\\,au. If this observational result holds true, then Kepler-68\\,B is too widely separated to have influenced the circumstellar disk around Kepler-68\\,A. However, it is in principle also possible that the B component is on a very eccentric orbit. If this is the case then close interactions with the inner planets or the planet forming disk might have happend. In the case of a very eccentric orbit, we would expect to find the stellar companion at a wide separation since it spends the majority of the time there. Further high precision astrometric monitoring combined with statistical orbit analysis might shed some light on the orbit of the B component.  \\\\\nSince the source that we now identified as Kepler-68\\,B was detected in 2MASS, it was included in the Kepler input catalogue. With its large separation of ~11arcsec the new stellar component is not within the \"classical\" Kepler PSF. However, Kepler-68 is strongly saturated and shows bleeding. Therefore, the changes in flux can only be seen at the end of bleed columns. \n \\cite{2013ApJ...766...40G} showed that Kepler-68\\,B is located almost precisely in the column direction from Kepler-68. \nIn most of the observing quarters of Kepler, the bleeding encompasses Kepler-68\\,B and, hence, has to be taken into account for the transit measurements. \nIf the light contribution of B is not considered, systematic errors in the system parameters will arise without changing the quality of the transit fit. \nFrom the measured magnitude difference of ~6.6\\,mag (see Tab.~\\ref{tab:measurements}) we calculated the amount of contaminating light. \nIf B is a binary that exhibits total eclipses, the transit depth measured by Kepler would be ~2300\\,ppm. \nThis is much higher than the  detected transit depth of 346\\,ppm and 55\\,ppm for Kepler-68\\,b and Kepler-68\\,c, respectively (\\citealt{2013ApJ...766...40G}). \nTherefore a partial or grazing eclipse of B could produce a transit signal. \nHowever, as shown before by e.g. \\cite{2011ApJ...732L..24L} or \\cite{2011ApJS..197....5F}, it is very unlikely that an eclipsing background object can mimic a multiple planetary system. \nFurthermore \\cite{2013ApJ...766...40G} showed that in Quarter 9 Kepler-68 as well as Kepler-68\\,B are located between columns in such a way that the bleeding terminates before reaching the latter. \nIn this way they proved that Kepler-68\\,B cannot be the source of the transit signal. Finally, by applying the BLENDER procedure (\\citealt{2004ApJ...614..979T}, \\citealt{2011ApJS..197....5F}), \\cite{2013ApJ...766...40G} could rule out all false positive scenarios involving eclipsing binaries and validate Kapler-68\\,b,c as planets.\n\n\n\\subsection{HD\\,197037}\n\nHD\\,197037 hosts an m$\\cdot$sin(i) = 0.79 M$_{Jup}$ planet on a $\\sim$2.8\\,yr period (semi-major axis of 2.1\\,au), discovered by \\cite{2012ApJ...749...39R}. They found that their best fitting orbit solution for the planet exhibits an eccentricity of 0.22. They also note that they include in their model a linear trend in radial velocity with a slope of -1.87$\\pm$0.3\\,ms$^{-1}$yr$^{-1}$, which could be attributed to a long period planet of 0.7\\,M$_{Jup}$ and a period of $\\sim$12\\,yr, or possibly a more distant stellar companion of which they find no further evidence.\\\\\nTo determine if the newly detected stellar companion HD\\,197037\\,B can be responsible for this linear trend in the radial velocity, we performed a dedicated Monte Carlo simulation. We fixed the system mass to the combined mass of both stellar components, i.e. 0.34\\,M$_\\odot$ for B and 1.11\\,M$_\\odot$ for A (\\citealt{2012ApJ...749...39R}). We then generated random bound Keplerian orbits which are compatible with our astrometric measurement of HD\\,197037\\,B. To somewhat narrow the wide parameter space, we restricted our simulation to orbits with a semi-major axis between 3\\,arcsec and 6\\,arcsec and times of periastron passage within 2000\\,yr from our astrometric epoch.\nWe created a total of 15000 such orbits. We then checked which of these orbits would introduce a slope as measured by \\cite{2012ApJ...749...39R} in their measurement period between the beginning of 2001 and 2012. Out of the 15000 randomely generated orbits, 1217 orbits fulfill this criterion. In Fig.~\\ref{hd197037-orbit}, we show the eccentricities and orbit inclinations of all these orbits.\nWe find that there is no strongly preferred region of the parameter space for an orbit of the B component to produce the measured radial velocity slope. In particular we find orbits for the full range of possible eccentricities. The range of possible inclinations is constrained only by the photometric mass estimate of the B component, i.e. the orbit needs to have a minimum inclination of $\\sim$18\\,deg to produce the radial velocity signal. From our imaging epochs we can not yet constrain the orbit of the B component, i.e. it is in principle possible that the B component is in a face-on or close to face-on orbit configuration. \nHowever given the large range of orbit solutions of the B component that reproduce the measured linear radial velocity trend, we find it likely that this trend is indeed caused by the stellar B component and not by an additional long period planet.\\\\\nThe non-circular orbit of the existing extrasolar planet around the A component might also be well explained by the new stellar companion if they are cought in mutual Kozai-Lidov type resonances. Given the potential very young age of the system of 0.3$\\pm$0.3\\,Gyr (\\citealt{2015AandA...575A..18B}), it may also be possible that the stellar B component was not originally a part of the system but was just caught as the result of a stellar flyby in more recent times. This would then have disrupted the original circular orbit of the planet. However, since HD197037 is not a known member of a star forming region or young moving group, such an event would seem rather unlikely.\n\n\\begin{figure}\n\n\\includegraphics[scale=0.4]{hd197037_orbit.pdf}\n\n\\caption[]{Inclination and eccentricity distribution for possible orbits of HD197037\\,B that induce a linear trend in the radial velocity of HD197037\\,A as measured by \\cite{2012ApJ...749...39R}. Shown are 1217 out of 15000 randomly generated bound keplerian orbits that include the current position of HD197037\\,B and that match the total system mass.} \n\\label{hd197037-orbit}\n\\end{figure}\n\n\n\\subsection{HD\\,217786}\n\n\\cite{2011A&A...527A..63M} discovered a long period ($\\sim$3.6\\,yr) planet or brown dwarf with a minimum mass of 13\\,M$_{Jup}$ around HD\\,217786 via radial velocity measurements. They found that the best fitting orbit solution of the object is very eccentric with e = 0.4$\\pm$0.05. They do not see long term radial velocity trends in their data.\\\\\nThe new stellar companion HD\\,217786\\,B is located at a projected separation of 155\\,au. To explore whether the large eccentricity of the planetary companion could be caused by Kozai-Lidov resonances with the stellar companion, we calculated the period of possible Kozai cycles. For this purpose we used the formula provided in \\cite{2005ApJ...627.1001T}. We assumed that the semi-major axis of the orbit of the stellar companion is equal to its projected separation and that the orbit is circular. We get a period of $\\sim$ 6.2\\,Myr. This period can be approximately an order of magnitude shorter if the stellar companion is on a significantly eccentric orbit itself. Given the large system age of $\\sim$6.5\\,Gyr, more than a thousand Kozai cycles could have been complete in principle. It is thus conceivable that the eccentricity of the planetary companion is indeed caused by such interactions with the newly discovered stellar companion.\nHowever, this is just one possible scenario to explain the eccentricity of the planet and it strongly depends on the actual orbit of the new stellar companion.\n\n\n\\section{Summary}\n\nWe searched for stellar companions around 63 stars known to harbor extrasolar planets using AstraLux at the Calar Alto observatory. We found previously unknown faint companion candidates within the field of view of our observations around 11 of the observed systems. Of these companion candidates, four, namely Kepler-21\\,B, Kepler-68\\,B, HD\\,197037\\,B and HD\\,217786\\,B, emerged as co-moving, and thus in all likelihood gravitationally bound, companions. The candidates detected around HD188015 and Kepler-37 are more consistent with background objects. For the remaining 5 systems follow-up lucky imaging observations must still be performed to determine the status of the objects, i.e. if they are co-moving with the exoplanet host star. The candidate found next to HD\\,43691 might be of special interest since it may be a low-mass binary itself.\\\\\nWe also present new photometric and astrometric measurements for the previously known companions to the HD\\,2638, HAT-P-7, HD\\,185269, WASP-76 and HAT-P-32 systems. Our SPHERE observations of HD\\,185269\\,B showed that the companion is actually a very low-mass binary itself, making the system one of only 17 triple systems known to harbor extrasolar planets. Continued astrometric monitoring within the next decade will allow us to determine the dynamical mass of the binary companion.\\\\\nWe note that the previously detected companion candidate to WASP-76 (\\citealt{2015AandA...579A.129W}) is more consistent with a background source given our new astrometric measurement, however no final conclusion could be drawn due to the short time baseline between the two observational epochs.\\\\\nIncluding the first part of our survey presented in \\cite{2012MNRAS.421.2498G} we have now studied the multiplicity of 128 known exoplanet systems. In this sample we found so far 7 new confirmed binary systems. This includes the new systems reported by us in this work and in \\cite{2012MNRAS.421.2498G}, as well as all systems that were first reported in other studies, but that were unknown at the time of our first epoch observation. \nThis yields a multiplicity rate of only 5.5\\% in our sample. This is much lower than previous values reported by \\cite{2012A&A...542A..92R} (12\\%), \\cite{2014MNRAS.439.1063M} (13\\%) or \\cite{2015MNRAS.450.3127M} (9\\%). If most of the unconfirmed companions that we report in this study turn out to be bound companions, the multiplicity rate of our study would increase to 9-10\\%, which would be in better agreement with previous results. \nOne contributing factor to our lower multiplicity rate might be that the majority of our sample is comprised of planetary systems found via the radial velocity method. Radial velocity surveys routinely exclude known binary systems from their target sample. Thus they introduce an inherent bias towards single star systems. However, the same was in principle true for the studies by \\cite{2014MNRAS.439.1063M} and \\cite{2015MNRAS.450.3127M}.\\\\\nIf the low multiplicity rate that we recover is indeed caused by a bias introduced by radial velocity surveys, then it would be expected that a higher stellar multiplicity rate is found for transiting planets. \\cite{2015ApJ...813..130W} present the results of an adaptive optics imaging search around 138 Kepler planet hosts. They find a stellar multiplicity rate of 8.0$\\pm$4.0\\,\\% for multi-planet systems and 6.4$\\pm$5.8\\,\\% for single-planet systems and stellar companions with semi-major axes between 100\\,au and 2000\\,au.\nThese values are in principle consistent with the stellar multiplicity rate of 5.5\\,\\% that we find, which might indicate that the selection bias of radial velocity surveys has no significant influence on our result.\nHowever, from a statistical point of view, considering simple random sampling, our sample size is too small for accurate predictions. If we assume a confidence level of 95\\%, then our estimated level of accuracy for a population size of 1200 exoplanet systems is only 8.2\\%. Given that our sample is definitely biased towards single star systems, our actual level of accuracy will be worse than this estimate.\nTo get a reliable estimate of the stellar multiplicity of exoplanet systems with a margin of error on the 5\\% level, a random sample size of 291 systems is neccessary considering the known population of $\\sim$1200 confirmed systems. If we consider a much larger population, i.e. all planetary systems in the Galaxy, then a larger random sample size of 385 systems is needed. These are again lower limits considering the potential biases introduced by exoplanet surveys.\nWe are continuing our mutiplicity survey in order to provide a homogeneous observation base for statistical analysis.\n\n\n\n\n\n\\section*{Acknowledgments}\n\nWe would like to thank the very helpful staff at the Calar Alto Observatory for their assistance in carrying out our observations. In particular we would like to thank S. Pedraz, G. Bergond and F. Hoyo for organizing and carrying out service mode observations for us.\nCG and MM thank DFG for support in projects MU2695/13-1, MU2695/14-1, MU2695/15-1, MU2695/16-1, MU2695/18-1, MU2695/20-1, MU2695/22-1, MU2695/23-1. HA acknowledges support from the Millennium Science Initiative (Chilean Ministry of Economy), through grant \"Nucleus P10-022-F\" and from FONDECYT grant 3150643. MS thanks Piezosystem Jena for financial support.\nSPHERE is an instrument designed and built by a consortium consisting of IPAG (Grenoble, France), MPIA (Heidelberg, Germany), LAM (Marseille, France), LESIA (Paris, France), Laboratoire Lagrange (Nice, France), INAF - Osservatorio di Padova (Italy), Observatoire de Geneve (Switzerland), ETH Zurich (Switzerland), NOVA (Netherlands), ONERA (France) and ASTRON (Netherlands) in collaboration with ESO. SPHERE was funded by ESO, with additional contributions from CNRS (France), MPIA (Germany), INAF (Italy), FINES (Switzerland) and NOVA (Netherlands). SPHERE also received funding from the European Commission Sixth and Seventh Framework Programmes as part of the Optical Infrared Coordination Network for Astronomy (OPTICON) under grant number RII3-Ct-2004-001566 for FP6 (2004-2008), grant number 226604 for FP7 (2009-2012) and grant number 312430 for FP7 (2013-2016). \nThis research has made use of the SIMBAD database as well as the VizieR catalogue access tool, operated at CDS, Strasbourg, France. This research has made use of NASA's Astrophysics Data System Bibliographic Services. \nFinally CG would like to thank Donna Keeley for language editing of the manuscript.\n\n\\bibliographystyle{mnras}\n\\bibliography{myBib}\n\n\n\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": 89957, "prevtext": "\n\n\\date{Accepted 2015 XX. Received 2015 XX}\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2015}\n\n\\maketitle\n\n\\label{firstpage}\n\n\\begin{abstract}\nThe vast majority of extrasolar planets are detected by indirect detection methods such as transit monitoring and radial velocity measurements. While these methods are very successful in detecting short-periodic planets, they are mostly blind to wide sub-stellar or even stellar companions on long orbits. \nIn our study we present high resolution imaging observations of 63 exoplanet hosts carried out with the lucky imaging instrument AstraLux at the Calar Alto 2.2\\,m telescope as well as with the new SPHERE high resolution adaptive optics imager at the ESO/VLT in the case of a known companion of specific interest.\nOur goal is to study the influence of stellar multiplicity on the planet formation process.\\\\\nWe detected and confirmed 4 previously unknown stellar companions to the exoplanet hosts HD197037, HD217786, Kepler-21 and Kepler-68. In addition, we detected 11 new low-mass stellar companion candidates which must still be confirmed as bound companions. We also provide new astrometric and photometric data points for the recently discovered very close binary systems WASP-76 and HD\\,2638. Furthermore, we show for the first time that the previously detected stellar companion to the HD185269 system is a very low mass binary.\nFinally we provide precise constraints on additional companions for all observed stars in our sample.\n\n\\end{abstract}\n\n\\begin{keywords}\nastrometry -- planets and satellites: formation -- (stars:) binaries: visual -- techniques: high angular resolution -- stars: individual: HD185269 -- stars: individual: Kepler-21 -- stars: individual: Kepler-68 -- stars: individual: HD197037 -- stars: individual: HD217786.\n\\end{keywords}\n\n\\section{Introduction}\n\nWe live in a golden age for extrasolar planet discoveries. In the past decade several large radial velocity and transit surveys have discovered more than 1200 systems containing extrasolar planets (exoplanet.eu, as of July 2015). While these indirect detection methods have been incredibly successful, they have a few inherent biases.\nIn particular, while they are very sensitive to short-period companions (often in the order of days or weeks), they are blind to wide (sub-) stellar companions at several tens or hundreds of au. However, more than 50\\% of all main sequence stars in the Galaxy and approximately half of all solar type stars are actually members of stellar multiple systems (\\citealt{2000prpl.conf..703M}, \\citealt{2010ApJS..190....1R}). \nIt is thus of great interest to investigate the influence of stellar multiplicity on extrasolar planet formation and orbital evolution. \\\\\nThere have been a large number of theoretical and observational studies that investigated the influence of close and wide stellar companions on the various stages of the planet formation process. It is, for instance, believed that close stellar companions will truncate protoplanetary disks and shorten their dissipation timescale.\nThis has been observationally confirmed e.g. by \\cite{2006ApJ...653L..57B} who found a significantly reduced number of disks in binary systems in their Spitzer survey of the young $\\eta$\\,Cha star cluster. Other studies such as \\cite{2012ApJ...745...19K} find that this effect is dependent on the binary separation with significant drops of disk occurrences only observed for systems with separations smaller than $\\sim$40\\,au.\\\\\nIn addition to the initial conditions and timescales in the protoplanetary disk, stellar companions might also influence the accretion of planetesimals by exciting higher eccentricities and velocities which might lead to more destructive collisions (see e.g. \\citealt{2007arXiv0705.3421K} or \\citealt{2008MNRAS.386..973P}). However, recent studies find that this effect might be mitigated by the gravitational force of sufficiently massive disks (\\citealt{2013ApJ...764L..16R}).\\\\\nFinally, stellar companions might have a major influence on the observed semi-major axis, inclination and eccentricity distributions of extrasolar planets. Studies by \\cite{2007ApJ...669.1298F} and \\cite{2015ApJ...799...27P} suggest that Kozai-Lidov type interactions between planets and stellar companions, in combination with tidal friction, might explain some of the observed extreme short period orbits. Other studies (e.g. \\citealt{2011Natur.473..187N}) suggest that such interactions could explain very eccentric planet orbits or spin-orbit misalignment. \nFor a comprehensive overview of all these effects we suggest the article by \\cite{2014arXiv1406.1357T}.\\\\\nTo study these effects, it is necessary to find the true fraction of multiple stellar systems amongst extrasolar planet host stars. Diffraction- or seeing-limited imaging is a primary tool for this purpose, in particular to find multiple stellar systems with planets in S-type oribts, i.e. the planets orbit one of the stellar components of the system. This orbit configuration accounts for the majority of multiple stellar exoplanet systems (see e.g. \\citealt{2012A&A...542A..92R}). \\\\\nThere have been a number of imaging studies in the past such as \\cite{2007A&A...474..273E}, \\cite{2007AandA...469..755M}, \\cite{2009A&A...498..567D}, \\cite{2011A&A...528A...8C}, \\cite{2012A&A...546A..10L}, or more recently \\cite{2014AJ....148...78D}, \\cite{2014MNRAS.439.1063M}, \\cite{2015MNRAS.450.3127M} and \\cite{2015A&A...575A..23W}.\\\\\nIn this work we present the results of our ongoing multiplicity study employing the lucky imaging instrument AstraLux (\\citealt{2008SPIE.7014E..48H}) at the Calar Alto 2.2\\,m telescope. In particular we present results for 63 systems obtained between 2011 and 2015. Results prior to that can be found in the first publication of our survey in \\cite{2012MNRAS.421.2498G}. Our targets are stars around which an exoplanet has been detected by radial velocity or transit observations and which have not yet been observed with high resolution imaging. \nWe further limit our sample to stars within $\\sim$200\\,pc (with few exceptions) so that we are able to confirm detected companion candidates via common proper motion analysis. In addition to our lucky imaging observations, we complement our study with extreme adaptive optics supported images from the new planet hunting instrument SPHERE (\\citealt{2008SPIE.7014E..18B}) at the ESO/VLT. \\\\\nWe derive astrometric and photometric data of all detected companion candidates and perform common proper motion analysis for all systems with more than one observation epoch. Finally we provide detailed detection limits on all observed systems. \n\n\\section{Observations and data reduction}\n\nThe observations presented in this study were undertaken between July 2011 and March 2015 with the lucky imaging instrument AstraLux at the Calar Alto Observatory. \nIn addition, we present data for one system which was taken with the new SPHERE planet hunting instrument at the ESO VLT during guaranteed time observations (GTO) in May 2015. \\\\\nFor our lucky imaging observations we used short exposures times in the same order as the coherence time of the atmosphere (e.g. \\cite{2008SPIE.7014E..48H} measure a speckle coherence times at the Calar Alto of 36\\,ms). \nWe then recorded a large number of individual images (typically 50000) of which we only used subsets with the highest Strehl ratio (\\citealt{Strehl1902}) for final combination. \nThe lucky imaging technique is described in detail in e.g. \\cite{2006AA...446..739L}. All lucky imaging observations were undertaken using the SDSS i filter. \nThe electron multiplying gain of the instrument was adjusted individually for each target to enable high signal-to-noise without saturating the primary star. \nWe also adjusted the focus of the instrument several times during the night to ensure highest image quality. \nIn our 2011, 2013 and 2014 observations in visitor mode, we used the full field of view of the detector of 24\\,$\\times$\\,24 arcsec with the shortest possible exposure time of 29.54\\,ms in frame transfer mode. \nFor the brightest targets we used shorter integrations times without frame transfer mode and less overall frames due to larger overheads, i.e. significantly increased readout time. \nIn the 2015 observations in service mode the instrument was used in windowed mode, reading only half of the field of view. This enabled shorter exposure times of typically 15.03\\,ms. Details for each system are given in Tab.~\\ref{tab:obs-overview}.\\\\\nData reduction of the lucky imaging data included flat fielding with sky flats taken during dawn, as well as bias subtraction. Bias frames were taken before each science exposure with the same gain settings as the science target. \nAfter flat fielding and bias subtraction, the Strehl ratio in each image was measured and then only the images with the 10\\%, 5\\% and 1\\% best Strehl ratios were aligned and combined respectively\\footnote{If not otherwise stated we generally used the best 10\\% images for subsequent analysis.}. \nFor the final data reduction we utilized the native AstraLux pipeline available at Calar Alto (described in detail by \\citealt{2008SPIE.7014E..48H}), as well as our own pipeline for the reduction of lucky imaging data. Our own pipeline was used in all those (few) cases where the Calar Alto pipeline produced no output due to software malfunction.\nFinal images with detected known companions as well as new companion candidates are shown in Fig.~\\ref{known-comp-images} and \\ref{new-comp-images}. We show the 2013 data when available, since it is in general of slightly higher quality than the 2014 data due to better weather conditions (higher coherence time, no clouds). \nTo enhance the contrast between the bright primary stars and the faint companion candidates, we have employed high pass filtering on the images. \\\\\nIn addition, we did use SPHERE's near infrared camera IRDIS (\\citealt{2008SPIE.7014E..3LD}) in dual band imaging mode (\\citealt{2010MNRAS.407...71V}) to image the HD\\,185269 system in Y, J and H-band with broad band filters on 02-05-2015. The specific interest in this system was triggered by an observed elongation of the companion's PSF in our AstraLux observations. \nWe used the minimal exposure time of 0.84\\,s without coronagraph and with neutral density filter, which led to only minor saturation of the core of the primary star's point spread function (PSF) in Y and H-band, and no saturation in J-band. For each filter setting we took a total of 20 individual exposures for a total integration time of 16.8\\,s.\nAll individual images in each band were median combined and then flat fielded and dark subtracted. Since we did not apply a dither pattern in this very short observation sequence, we then used a bad pixel mask (created from flat and dark frames) to eliminate bad pixels. \nFinally we combined both images of the dual imaging mode in each band. A resulting combined color image is shown in Fig.~\\ref{hd185269-sphere}.\n\n\\begin{table*}\n\n \n \n  \\caption{Observation summary of all targets observed with AstraLux at the Calar Alto 2.2\\,m telescope. We give the total integration time for each target for a frame selection rate of 10\\,\\%.}\n  \\begin{tabular}{@{}lccccccc@{}}\n  \\hline\n        \n Star \t& R.A.\t\t\t& DEC\t\t\t& epoch \t& \\# of frames\t\t& exposure time [ms] & tot. integ. time [s] & field of view [arcsec]\t\t\\\\\n\\hline\nHD2638\t&\t00 29 59.87274\t&\t-05 45 50.4009\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD2952\t&\t00 33 10.39467\t&\t+54 53 41.9440\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD5608\t&\t00 58 14.21893\t&\t+33 57 03.1843\t&\t17-01-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD5891\t&\t01 00 33.19204\t&\t+20 17 32.9381\t&\t17-01-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD8574\t&\t01 25 12.51565\t&\t+28 34 00.1010\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD10697\t&\t01 44 55.82484\t&\t+20 04 59.3381\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nWASP-76\t&\t01 46 31.8590\t&\t+02 42 02.065\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHAT-P-32\t&\t02 04 10.278\t&\t+46 41 16.21\t&\t19-08-2014\t&\t60000\t&\t29.54\t&\t177.24\t&\t24$\\times$24\t\\\\\nHD12661\t&\t02 04 34.28834\t&\t+25 24 51.5031\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD13189\t&\t02 09 40.17260\t&\t+32 18 59.1649\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD13908\t&\t02 18 14.56056\t&\t+65 35 39.6988\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD15779\t&\t02 32 09.42200\t&\t-01 02 05.6236\t&\t17-01-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD285507\t&\t04 07 01.22653\t&\t+15 20 06.0989\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD290327\t&\t05 23 21.56490\t&\t-02 16 39.4302\t&\t10-03-2015\t&\t50000\t&\t15.03\t&\t75.15\t&\t12$\\times$12\t\\\\\nHD40979\t&\t06 04 29.94214\t&\t+44 15 37.5940\t&\t10-03-2015\t&\t50000\t&\t29.54\t&\t147.70\t&\t12$\\times$12\t\\\\\nHD43691\t&\t06 19 34.67623\t&\t+41 05 32.3113\t&\t10-03-2015\t&\t16383\t&\t15.01\t&\t24.59\t&\t12$\\times$12\t\\\\\nHD45350\t&\t06 28 45.71155\t&\t+38 57 46.6670\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nOmi Uma\t&\t08 30 15.87064\t&\t+60 43 05.4115\t&\t10-03-2015\t&\t20000\t&\t5.01\t&\t10.02\t&\t12$\\times$12\t\\\\\nGJ328\t&\t08 55 07.597\t&\t+01 32 56.44\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD95089\t&\t10 58 47.73629\t&\t+01 43 45.1758\t&\t10-03-2015\t&\t32766\t&\t15.01\t&\t49.18\t&\t12$\\times$12\t\\\\\nHD96063\t&\t11 04 44.45463\t&\t-02 30 47.5867\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD99706\t&\t11 28 30.21370\t&\t+43 57 59.6902\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD100655\t&\t11 35 03.75349\t&\t+20 26 29.5713\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHIP57274\t&\t11 44 40.96488\t&\t+30 57 33.4552\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD102329\t&\t11 46 46.64518\t&\t+03 28 27.4563\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD106270\t&\t12 13 37.28529\t&\t-09 30 48.1691\t&\t10-03-2015\t&\t16383\t&\t15.01\t&\t24.59\t&\t12$\\times$12\t\\\\\nHD113337\t&\t13 01 46.92669\t&\t+63 36 36.8092\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD116029\t&\t13 20 39.54263\t&\t+24 38 55.3080\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t13 20 39.54263\t&\t+24 38 55.3080\t&\t20-08-2014\t&\t60000\t&\t29.54\t&\t177.24\t&\t24$\\times$24\t\\\\\nHD120084\t&\t13 42 39.20186\t&\t+78 03 51.9756\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nBeta UMi\t&\t14 50 42.32580\t&\t+74 09 19.8142\t&\t10-03-2015\t&\t20000\t&\t4\t&\t8.00\t&\t12$\\times$12\t\\\\\nHD131496\t&\t14 53 23.02871\t&\t+18 14 07.4562\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD131496\t&\t14 53 23.02871\t&\t+18 14 07.4562\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD136726\t&\t15 17 05.88899\t&\t+71 49 26.0466\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n11 UMi\t&\t15 17 05.88899\t&\t+71 49 26.0466\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD136512\t&\t15 20 08.55879\t&\t+29 36 58.3488\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nOmi CrB\t&\t15 20 08.55879\t&\t+29 36 58.3488\t&\t10-03-2015\t&\t50000\t&\t15.01\t&\t75.05\t&\t12$\\times$12\t\\\\\nHD139357\t&\t15 35 16.19886\t&\t+53 55 19.7129\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD145457\t&\t16 10 03.91431\t&\t+26 44 33.8927\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD152581\t&\t16 53 43.58257\t&\t+11 58 25.4822\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHAT-P-18\t&\t17 05 23.151\t&\t+33 00 44.97\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t17 05 23.151\t&\t+33 00 44.97\t&\t19-08-2014\t&\t65540\t&\t29.54\t&\t193.61\t&\t24$\\times$24\t\\\\\n\t&\t17 05 23.151\t&\t+33 00 44.97\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD156279\t&\t17 12 23.20383\t&\t+63 21 07.5391\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD163607\t&\t17 53 40.49479\t&\t+56 23 31.0417\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD163917\t&\t17 59 01.59191\t&\t-09 46 25.0798\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHIP91258\t&\t18 36 53.15422\t&\t+61 42 09.0124\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nKepler-37\t&\t18 56 14.3063\t&\t+44 31 05.356\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nKepler-21\t&\t19 09 26.83535\t&\t+38 42 50.4593\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t19 09 26.83535\t&\t+38 42 50.4593\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD180314\t&\t19 14 50.20890\t&\t+31 51 37.2569\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nKepler-63\t&\t19 16 54.294\t&\t+49 32 53.51\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nKepler-68\t&\t19 24 07.7644\t&\t+49 02 24.957\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t19 24 07.7644\t&\t+49 02 24.957\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nKepler-42\t&\t19 28 52.556\t&\t+44 37 09.62\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHAT-P-7\t&\t19 28 59.3616\t&\t+47 58 10.264\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD185269\t&\t19 37 11.74092 \t&\t+28 29 59.5055\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t19 37 11.74092 \t&\t+28 29 59.5055\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD188015\t&\t19 52 04.54338\t&\t+28 06 01.3517\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t19 52 04.54338\t&\t+28 06 01.3517\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD190360\t&\t20 03 37.40587\t&\t+29 53 48.4944\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\n\n\n\t\n\\hline\\end{tabular}\n\n\n\\end{table*}\n\n\n\t\n\t\n\t\n\t\n\\begin{table*}\n\\ContinuedFloat\n\n\n\n \n \n  \\caption{\\textbf{Continued}}\n  \\begin{tabular}{@{}lccccccc@{}}\n  \\hline\n        \n Star \t\t\t\t& R.A.\t\t\t\t\t\t\t& DEC\t\t\t\t& epoch & \\# of frames\t\t& exposure time [ms] & tot. integ. time [s] & field of view [arcsec]\t\t\t\t\t\t\t\t\\\\\n\\hline\n\nHD197037\t&\t20 39 32.96014\t&\t+42 14 54.7845\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t20 39 32.96014\t&\t+42 14 54.7845\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD206610\t&\t21 43 24.90004\t&\t-07 24 29.7086\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD208527\t&\t21 56 23.98467\t&\t+21 14 23.4961\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD210277\t&\t22 09 29.86552\t&\t-07 32 55.1548\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD217786\t&\t23 03 08.205\t&\t-00 25 46.66\t&\t28-07-2011\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t23 03 08.205\t&\t-00 25 46.66\t&\t30-06-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\t&\t23 03 08.205\t&\t-00 25 46.66\t&\t20-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD240210\t&\t23 10 29.2303\t&\t+57 01 46.035\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD219828\t&\t23 18 46.73445\t&\t+18 38 44.6021\t&\t30-06-2013\t&\t19214\t&\t29.54\t&\t56.76\t&\t24$\\times$24\t\\\\\nHD220074\t&\t23 20 14.37962\t&\t+61 58 12.4578\t&\t19-08-2014\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\nHD222155\t&\t23 38 00.30741\t&\t+48 59 47.4907\t&\t01-07-2013\t&\t50000\t&\t29.54\t&\t147.70\t&\t24$\\times$24\t\\\\\n\n\n\n\\hline\\end{tabular}\n\\label{tab:obs-overview}\n\n\\end{table*}\n\n\n\n\n\n\\begin{figure*}\n\\subfloat[HD\\,2638]{\n\\includegraphics[scale=0.25]{hd2638-known.jpg}\n\\label{HD2638}\n}\n\\subfloat[HAT-P-7]{\n\\includegraphics[scale=0.25]{hat-p-7-known.jpg}\n\\label{hat-p-7}\n}\n\\subfloat[HD\\,185269]{\n\\includegraphics[scale=0.2545]{hd185269-known.jpg}\n\\label{hd185269-astralux}\n}\n\n\\subfloat[WASP-76]{\n\\includegraphics[scale=0.25]{wasp-76.jpg}\n\\label{wasp-76}\n}\n\\subfloat[HAT-P-32]{\n\\includegraphics[scale=0.25]{hat-p-32.jpg}\n\\label{hat-p-32}\n}\n\n\\caption[]{Images of known low-mass stellar companions to exoplanet host stars, followed up in our multiplicity study. The halos of the bright host stars were removed by high-pass filtering. North is up and East is to the left.} \n\\label{known-comp-images}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\subfloat[HD\\,10697]{\n\\includegraphics[scale=0.2]{hd10697.jpg}\n\\label{hd10697}\n}\n\\subfloat[HD\\,43691]{\n\\includegraphics[scale=0.2]{hd43691.jpg}\n\\label{hd43691}\n}\n\\subfloat[HD\\,116029]{\n\\includegraphics[scale=0.2]{hd116029.jpg}\n\\label{hd116029}\n}\n\\subfloat[HAT-P-18]{\n\\includegraphics[scale=0.2]{hat-p-18.jpg}\n\\label{hat-p-18}\n}\n\n\\subfloat[Kepler-37]{\n\\includegraphics[scale=0.2]{kepler37.jpg}\n\\label{kepler37}\n}\n\\subfloat[Kepler-21]{\n\\includegraphics[scale=0.2]{kepler21.jpg}\n\\label{kepler21}\n}\n\\subfloat[Kepler-68]{\n\\includegraphics[scale=0.199]{kepler68_new_2.jpg}\n\\label{kepler68}\n}\n\\subfloat[Kepler-42]{\n\\includegraphics[scale=0.2]{kepler42.jpg}\n\\label{kepler42}\n}\n\n\\subfloat[HD\\,188015]{\n\\includegraphics[scale=0.2]{hd188015.jpg}\n\\label{hd188015}\n}\n\\subfloat[HD\\,197037]{\n\\includegraphics[scale=0.2]{hd197037.jpg}\n\\label{hd197037}\n}\n\\subfloat[HD\\,217786]{\n\\includegraphics[scale=0.2]{hd217786.jpg}\n\\label{hd217786}\n}\n\n\\caption[]{Images of all newly detected companion candidates during the course of our multiplicity study with Astralux at the Calar Alto 2.2\\,m telescope. Spatial scaling of each image is indicated. The companion candidates (cc) are marked in all images. All images were high-pass filtered to remove the bright halo of the host star. North is always up and East is to the left.}\n\\label{new-comp-images}\n\\end{figure*}\n\n\n\n\\begin{figure}\n\n\\includegraphics[scale=0.275]{hd185269-sphere.jpg}\n\n\\caption[]{Composite color image of the exoplanet host star HD\\,185269 and its companion taken with SPHERE/IRDIS on 02-05-2015. Red, green and blue channels are H, J and Y-band data respectively. In the SPHERE/IRDIS image the low mass stellar companion discovered by us (\\citealt{2012MNRAS.421.2498G}) is for the first time resolved as a low mass stellar binary. North is up and East is to the left.} \n\\label{hd185269-sphere}\n\\end{figure}\n\n\n\n\n\n\\section{Astrometric calibration and measurements}\n\\label{sec:astrometry}\nThe most reliable method to determine if individual companion candidates are bound to the systems around which they are discovered is to ascertain if they exhibit the same proper motion as the primary star of the system. \nFor this purpose we are measuring the separation and relative position angle (PA) of all newly discovered companion candidates relative to the primary star. To ensure that our astrometric measurements can be compared between different observation epochs as well as with measurements done with different instrument, we took astrometric calibration images in each observation epoch. \nIn 2013 and 2014 we used the center of the globular cluster M\\,15 for this purpose. In the 2015 observation epoch M\\,15 was not visible and we imaged three wide binary systems instead (HIP\\,72508, HI\\,P80953 and HIP\\,59585). To calibrate the pixel scale as well as the orientation of the detector we used as reference HST observations of M 15 that were taken on 22-10-2011 with the Wide Field Camera 3 (WFC3, \\citealt{2008SPIE.7010E..1EK}). \nIn the case of the binary stars, we used all measurements of the respective systems in the Washington Double Star Catalog (\\citealt{2001AJ....122.3466M}) as reference. We applied a linear fit to these available measurements to correct for the slow orbital motion of these wide binaries.\nFor the calibration using cluster data, we measured individual star positions in our AstraLux image and the HST reference image with IDL\\footnote{Interactive Data Language} starfinder (\\citealt{2000SPIE.4007..879D}), which fits a reference PSF to each star position. The reference PSF was created from the data itself. We then used our own cross correlation routines to identify the same stars in both images. Finally we calculated separations and relative orientations of each star relative to all other stars. This was done for 92 stars in 2013 and 90 stars in 2014.\nWe then used the known astrometric calibration of the HST reference image to calculate an astrometric solution for each individual measurement. To exclude stars with a strong proper motion or possibly misidentified stars we employed sigma clipping. The final astrometric solution for the 2013 and 2014 observations is the median of all computed solutions. \nWe give the results in Tab.~\\ref{tab: astrocal}. The listed uncertainties are the standard deviations of all astrometric solutions.\\\\\nIn the case of the binary stars, we only have two objects in the field of view, thus we could not create a reference PSF from the data. Instead we are fitting a two dimensional Gaussian to the star positions. We checked that this approach is valid by comparing similar measurements in the cluster images with the starfinder results. The deviations between the two methods were typically much smaller than the measurement accuracy.\nThe result of the binary calibration is also given in Tab.~\\ref{tab: astrocal}. We used the weighted average of the three solutions calculated from the individual binary systems. For the uncertainty, we conservatively assumed the largest individual uncertainty that we measured. The uncertainty of the calibration includes the uncertainty of the linear orbital motion fit mentioned earlier. We note that calibrations using binary stars are prone to systematic offsets due to unaccounted for (or underestimated) orbital motion of the systems. We thus caution that the result of the 2015 calibration might still suffer from such an offset.\\\\\nWe have one companion candidate which was already observed in July of 2011 for the first time. In this case we utilized the astrometric calibration derived by us with cluster and binary data in \\cite{2012MNRAS.421.2498G}.\\\\\nFor the SPHERE/IRDIS data we used the astrometric solution calculated by the SPHERE consortium for the GTO run in which the data was taken. This astrometric calibration was derived from multiple observations of the globular clusters 47\\,Tuc and NGC\\,6380, for which also precise HST reference observations as well as proper motions for individual cluster members are available. There is a small dependence of the pixel scale on the utilized filter; for our Y-band observations we used 12.234$\\pm$0.029 mas/pix and -1.78$\\pm$0.13 deg, while we used 12.214$\\pm$0.029 mas/pix for the J-band, and 12.210$\\pm$0.029 mas/pix for the H-band (the detector orientation is not influenced by the filter choice). In addition, IRDIS shows a small anamorphism between the detector x and y direction.  \nThis was also determined from observations of the globular cluster 47\\,Tuc. To correct for this anamorphism we multiplied the separation in y by a factor of 1.0062. A detailed description of the IRDIS astrometric calibration is given in \\cite{2015arXiv151104072M}.\\\\\nThe measurements of the relative positions of companion candidates to the primary stars was also done by fitting a 2 dimensional Gaussian to both objects since there were no other objects in the field of view to build a reference PSF. Also, it is problematic to build an average reference PSF from different data sets, since the shape of the PSF will highly depend on the atmospheric conditions and the height of the target above the horizon.\nTo ensure that we obtained a stable fitting result, we repeated the fitting procedure for each object at least 20 times with slightly different starting positions and fitting box sizes. For companion candidates that were separated by less than 2\\,arcsec from the bright primary stars, we removed the primary stars' bright halo by high pass filtering before we measured the companion candidates position. All results are listed in Tab.~\\ref{tab:measurements}. The given uncertainties are the uncertainties of the Gaussian fitting added in quadrature to the uncertainties of the astrometric calibration. Multiple observation epochs were available for several systems. We discuss these systems in the following in detail and test if the companion candidates are co-moving with the primary stars.\\\\\n\\\\\n\\textit{WASP-76}\\\\\n\\\\\nWASP-76 was observed by us only once in August of 2014. We detected a faint companion candidate $\\sim$0.44\\,arcsec to the south-west of the star. Two months later in October of 2014, the target was observed also with AstraLux by \\cite{2015AandA...579A.129W}, who also detected this companion candidate and claim that it is likely a bound companion due to the decreasing likelihood of background objects with decreasing separation. We used their discovery astrometric data point, along with our own astrometric measurement, to determine if it is possible to draw conclusions on the proper motion of the object relative to the primary star. The corresponding diagram is shown in Fig.~\\ref{wasp76-pm}. In order to achieve an accurate position measurement of this faint source, we employed high pass filtering on the images to remove the bright halo of the exoplanet host. \\\\\nDue to the short time baseline of only two months, and the large uncertainties given by \\cite{2015AandA...579A.129W} (presumably due to worse weather conditions compared with our own detection), it is not possible to draw firm conclusions on the proper motion of the companion candidate. However, we note that our own measurement is in principle more consistent with the object being a non-moving background source rather than a bound companion. Particularly the 1$\\sigma$ deviation of the two separation measurements could be well explained by parallactic displacement of the primary star relative to a presumably distant background source. Any future measurement with a similar precision as our own measurement of August 2014 will be enough to determine the status of this companion candidate.  \\\\\n\\\\\n\\textit{HD\\,185269}\\\\\n\\\\\nA low-mass companion to the HD\\,185269 system was discovered by us with AstraLux observations in \\cite{2012MNRAS.421.2498G} with observations performed between 2008 and 2011. We followed up on this companion in our current study with observations taken in July 2013 and August 2014. We show the image obtained in the 2013 observation epoch in Fig.~\\ref{known-comp-images}.\nIn this observation epoch we observed for the first time that the companion appeared extended in north-east/south-west direction, while the PSF of the primary star showed no such distortion. This prompted us to re-observe this system with SPHERE/IRDIS. The much higher resolution extreme AO images of SPHERE show for the first time that the companion is actually a very low mass binary system itself with two approximately equally bright components (see Fig.~\\ref{hd185269-sphere}).\nIn addition to the (unresolved) follow-up astrometry performed with AstraLux, we measured the relative position of each binary component to the primary star in all bands of the SPHERE/IRDIS observation. We used again Gaussian fitting to determine the positions of all objects.\nThe primary star shows a very mild saturation of the innermost 2-3 pixels in Y and H-band. We measured its position again multiple times to ensure that we reached a good fit (we fit the flanks of the saturated PSF in this case). Final results are listed in Tab.~\\ref{tab: hd185269-sphere}. In addition, we used our measurements to calculate the weighted average of the position of the Bb component with respect to the Ba component. We arrive at a separation of 123.55$\\pm$0.44\\,mas ($\\sim$5\\,au projected separation at a distance of 47.37$\\pm$1.72\\,pc, \\citealt{2007AandA...474..653V}) and a position angle of 214.87$\\pm$0.21\\,deg.\\\\\nSince the SPHERE image confirmed that HD\\,185269\\,B is a binary, we re-examined our 2013 AstraLux observation in order to provide an astrometric measurement of the relative binary position. \nThis is useful to determine the orbit of the binary and constrain its mass dynamically in later follow-up studies of the system. Due to the marginally resolved nature of the binary source in our 2013 AstraLux data, Gaussian fitting proved to be difficult. \nInstead we used the primary star's PSF as template and fitted it to the two components of HD185269\\,B using IDL starfinder. This fit yielded a separation of 95.6$\\pm$2.8\\,mas and a PA of 221.1$\\pm$1.3\\,deg of Bb relative to Ba, as well as separations of 4538$\\pm$14\\,mas and 4458$\\pm$14\\,mas and PAs of 8.39$\\pm$0.17\\,deg and 7.72$\\pm$0.18\\,deg of Ba and Bb relative to A.\nAs expected for a system with such small separation, we see strong orbital motion between the 2013 and the 2015 observation epoch. Due to the non-optimal weather conditions in 2014, the companion is not resolved in our 2014 AstraLux observation. \nAt least one additional astrometric measurement is needed to constrain the orbital elements of this binary system.\\\\\n\\\\\n\\textit{HD\\,43691}\\\\\n\\\\\nHD\\,43691 was imaged by us once in March of 2015. We detected a companion candidate approximately 4.4\\,arcsec to the north-east of the exoplanet host star. \nSince we only have one epoch it is not yet possible to determine if the object is indeed related to the HD\\,43691 system. However, upon close inspection of the companion candidate's PSF we noticed that it appears extended along an angle of roughly 135\\,deg. \nA close-up of the companion candidate's PSF, as well as the primary stars' PSF, is shown in Fig.~\\ref{hd43691-contour}. We actually see at least two distinct peaks in the PSF (signal-to-noise ratio\\footnote{The noise was determined by calculating the standard deviation in a 5$\\times$5 pixel box centered on the two brightest peaks of the source.} of 5.8 and 5.5, separation of $\\sim$84\\,mas, i.e. 6.7\\,au at 80.4\\,pc), which would indicate that the object itself may be a multiple system. We compared the companion candidate's PSF with the PSF of the primary star to exclude that this is merely an effect caused by the observation conditions. \nHowever, the primary star' PSF appears circular in the center with a halo that is slightly extended in north-south direction, i.e. we see no indication for an intrinsic smearing of the PSF along the angle seen in the companion candidate. We note that there appears to be a third peak directly north of the south-east component of the companion candidate's PSF. This might indeed be a residual of a north-south extended halo, as seen in the primarie's PSF.\nThe object might hence be a binary or even trinary companion to HD\\,43691\\,A. However, further observations are required to confirm that the source is co-moving with the primary star and that it is indeed a multiple system itself.\\\\\n\\\\\n\\textit{Kepler-37}\\\\\n\\\\\nKepler-37 (KOI-245, KIC 8478994) was observed by us only once in August of 2014. In this data set we discovered a wide ($\\sim$8.5\\,arcsec) companion candidate south-south-west of the exoplanet host star. Kepler-37 was previously observed by \\cite{2014A&A...566A.103L}, also using AstraLux at the Calar Alto observatory. In addition, it was targeted by \\cite{2012AJ....144...42A} using ARIES at the MMT observatory. Both studies do not mention the companion candidate recovered in our own AstraLux image, since they are focusing on close companions within 6\\,arcsec of the primary star.\\\\\nSince the object was located at such a relatively large separation, we decided to check the 2MASS (\\citealt{2006AJ....131.1163S}) survey for previous detection. \nWhile the object was not listed in the 2MASS point source catalog, it was visible in the reduced J, H and K images. We extracted the astrometric position from the individual 2MASS images using Richardson-Lucy deconvolution and then averaged the results over all bands. For details on the extraction we refer to our recent study \\cite{2015MNRAS.450.3127M}. \nWe find a separation of 8.030$\\pm$0.138\\,arcsec and a PA of 202.99$\\pm$1.85\\,deg in the 2MASS observation epoch of 1998.47. We used the 2MASS data in combination with our more precise AstraLux measurement to test if the discovered object is co-moving with the primary star. \nThe corresponding diagram is shown in Fig.~\\ref{kepler37-pm}. Even though the uncertainties of the 2MASS measurement are large compared to our AstraLux measurement, the position of the companion candidate in the 2MASS epoch is consistent within 1$\\sigma$ with a non-moving background object. By comparison, co-motion with the primary can be rejected on the 4$\\sigma$ level.\nWe thus conclude that the object is likely located in the distant background and is not physically associated with the Kepler-37 system.\\\\\n\\\\\n\\textit{Kepler-21}\\\\\n\\\\\nKepler-21 (KOI-975, KIC 3632418) was observed in July of 2013 and August 2014 with Astralux. A very close companion candidate at approximately 0.8\\,arcsec was detected south-east of the primary star. In order to get an accurate position measurement of this faint source, we employed high pass filtering on the images to remove the bright halo of the exoplanet host.\nThe resulting measurements were compared with the proper motion of the primary star. The corresponding diagram is shown in Fig.~\\ref{kepler21-pm}. Due to the direction of motion of Kepler-21, no significant change in separation would be expected for a co-moving object as well as a non-moving background object.\nHowever, as can be seen in the diagram, both types of objects diverge in expected PA. Our measurements of the PA of the companion candidate show no significant change in PA, consistent with common proper motion. We can reject the background hypothesis with 4.0$\\sigma$. \nWe thus conclude that the object that we detected is most likely gravitationally bound to Kepler-21\\,A and is thus a new low-mass stellar companion in this system.\\\\\n\\\\\n\\textit{Kepler-68}\\\\\n\\\\\nKepler-68 (KOI-246, KIC 11295426) was imaged by us also in July of 2013 and August of 2014. A wide companion candidate approximately 11\\,arcsec to the south-east was detected in both observation epochs. \nUnfortunately Kepler-68 exhibits only a very small proper motion of -10.60$\\pm$1.60 mas/yr in declination and -8.50$\\pm$1.60 mas/yr in right ascension. Thus with only one year of epoch difference it was not possible to assert whether the companion candidate is co-moving with the primary star. \nHowever, since the companion candidate is located at a wide separation, we checked again the 2MASS catalogue to see if the source had been previously detected. \nWe found that our companion candidate is indeed contained in the 2MASS point source catalogue at a relative position of 10.989$\\pm$0.085\\,arcsec and 145.45$\\pm$0.44\\,deg. Using this additional observation epoch we tested the companion for common proper motion with the primary star. \nThe corresponding diagram is shown in Fig~\\ref{kepler68-pm}. While the separation is inconclusive due to the tangential direction of motion of the primary star, we would have expected a significant change in PA of our measurements with respect to the 2MASS epoch if the companion candidate was a non-moving background object.\nInstead we find that all measurements are consistent with no change in PA. However, due to the large uncertainties of the 2MASS epoch we can only reject the background hypothesis with 2.1$\\sigma$. We conclude that, given our data, it seems likely that the companion candidate is indeed bound to the Kepler-68 system, but further observations need to be undertaken to strengthen this conclusion.\\\\\n\\\\\n\\textit{HD\\,188015}\\\\\n\\\\\nHD\\,188015 was observed by us with AstraLux in July 2013 and August 2014. In Fig.~\\ref{hd188015} we show our 2013 observation epoch. A total of 6 companion candidates are visible in the field of view of AstraLux. The high density of objects in the field of view compared to other systems is not entirely surprising since HD\\,188015 is located in the direction of the Galactic disk (Galactic latitude of +00.5428$^\\circ$). We note that HD\\,188015 has a known low-mass stellar companion at $\\sim$13\\,arcsec and a PA of 85\\,deg, discovered by \\cite{2006ApJ...646..523R} in Sloan Digital Sky Survey (SDSS, \\citealt{2000AJ....120.1579Y}) data. This companion is outside of the field of view of our AstraLux observations.\\\\          \nIn August 2014 observation conditions were not as favorable as in 2013 with shorter coherence times and thin cloud layers passing through during the observations. Thus only the candidate marked as cc1 was re-detected with high signal-to-noise. Of the other five companions, four were detected marginally with cc5 being the exception. The marginal detections in 2014 did not allow for fitting of a Gaussian to the companion candidates. Instead we have determined the center of light with a simple centroid for those four sources.\nThis led to much larger uncertainties of the 2014 astrometry. We nonetheless used the 2014 astrometry in combination with the known proper motion of the primary star to determine if one or several of the companion candidates are co-moving with the primary star.\nThe corresponding diagrams for cc1 to cc6 (with the exception of cc5) are shown in Fig.~\\ref{hd188015-cc1-pm} to Fig.~\\ref{hd188015-cc6-pm}. For cc1 the available astrometry is more consistent with a background object and we can reject common proper motion with HD\\,188015\\,A on the 3$\\sigma$ level. \nFor the remaining companion candidates we cannot reject common proper motion or background hypothesis with any significance. This is caused by the larger uncertainty of the 2014 measurements in combination with the short time baseline of only one year. We note, however, that the astrometry of cc2 and cc4 is more consistent with a distant background object, while the same is not true for cc3 and cc6. The latter two remain completely inconclusive due to their opposite behavior in separation and PA.\nWe point out that this seemingly mixed behavior could be caused by a non-zero proper motion of these objects. To gain a better understanding of this system, at least one further observation epoch in good observing conditions is required.\\\\\n\\\\\n\\textit{HD\\,197037}\\\\\n\\\\\nHD\\,19037 was observed by us with AstraLux in two epochs in July 2013 and August 2014. We detected a companion candidate approximately 3.7\\,arcsec to the south of the primary star. \nUsing the proper motion of the primary star, we calculated the expected position of a non-moving background object in 2013 given the 2014 measurement. \nThe corresponding diagram is shown in Fig.~\\ref{hd197037-pm}. The astrometry in both epochs is consistent with no significant change in relative position. We can reject the background hypothesis with 4.8$\\sigma$ in separation and 18.6$\\sigma$ in PA.\nWe conclude that the detected object is co-moving with HD\\,19037\\,A and is thus most likely a new gravitationally bound stellar companion to the system. \\\\\n\\\\\n\\textit{HD\\,217786}\\\\\n\\\\\nHD\\,217786 was observed by us on three different occasions in July 2011 and 2013, as well as in August of 2014. In all three observation epochs we detected a companion candidate approximately 2.8\\,arcsec to the south of the primary star. The proper motion for this system is well determined to be -88.78$\\pm$0.84 mas/yr in declination and -170.13$\\pm$0.61 mas/yr in right ascension (\\citealt{2007AandA...474..653V}).\nWe show the astrometric measurements as well as the expected behavior of a background object in Fig.~\\ref{hd217786-pm}. The PA of the companion candidate is not changing significantly with time. However, we detect a small increase in separation. The dashed lines in the diagram show the expected change for a circular edge-on orbit.\nThe data points are consistent with such a change within 1$\\sigma$. We note that even stronger changes in separation are possible for eccentric orbits. The change in separation is much smaller than what would be expected from a background object and is also showing the wrong direction (for a background object the separation should have decreased from 2011 to 2014). In fact we can reject the background hypothesis with 42.8$\\sigma$ in separation and 18.9$\\sigma$ in PA.\nWe thus conclude that the discovered object is very likely bound to the system and emerges as new low-mass stellar companion. Due to the small change in separation, but no change in PA, we expect the companion to be in a close to edge-on orbit configuration, but longer astrometric monitoring is required to test this hypothesis.\n\n\n\n\\begin{figure*}\n\\subfloat[WASP-76]{\n\\includegraphics[scale=0.38]{wasp76-pm.pdf}\n\\label{wasp76-pm}\n}\n\\subfloat[Kepler-37]{\n\\includegraphics[scale=0.38]{kepler37-pm.pdf}\n\\label{kepler37-pm}\n}\n\\subfloat[Kepler-21]{\n\\includegraphics[scale=0.38]{kepler21-pm.pdf}\n\\label{kepler21-pm}\n}\n\n\\subfloat[Kepler-68]{\n\\includegraphics[scale=0.38]{kepler68-pm.pdf}\n\\label{kepler68-pm}\n}\n\\subfloat[HD\\,188015\\,cc\\,1]{\n\\includegraphics[scale=0.38]{hd188015-cc1-pm.pdf}\n\\label{hd188015-cc1-pm}\n}\n\\subfloat[HD\\,188015\\,cc\\,2]{\n\\includegraphics[scale=0.38]{hd188015-cc2-pm.pdf}\n\\label{hd188015-cc2-pm}\n}\n\n\\subfloat[HD\\,188015\\,cc\\,3]{\n\\includegraphics[scale=0.38]{hd188015-cc3-pm.pdf}\n\\label{hd188015-cc3-pm}\n}\n\\subfloat[HD\\,188015\\,cc\\,4]{\n\\includegraphics[scale=0.38]{hd188015-cc4-pm.pdf}\n\\label{hd188015-cc4-pm}\n}\n\\subfloat[HD\\,188015\\,cc\\,6]{\n\\includegraphics[scale=0.38]{hd188015-cc6-pm.pdf}\n\\label{hd188015-cc6-pm}\n}\n\n\n\\caption[]{Proper motion analysis for all companion candidates with two or more observation epochs. Data points are AstraLux measurements if not otherwise marked. The dashed lines enclose the area in which a co-moving companion would be expected. This takes into account possible circular orbital motion with the semi-major axis given by the projected separation of the companion.\nThe grey area enclosed by the wobbled lines is the area in which a non-moving background object would be expected, depending on the proper motion and distance of the primary star. The wobble is introduced by the parallactic shift in the primary position due to the Earth's revolution around the sun.} \n\n\\end{figure*}\n\\begin{figure*}\n\n\\ContinuedFloat\n\n\\subfloat[HD\\,197037]{\n\\includegraphics[scale=0.38]{hd197037-pm.pdf}\n\\label{hd197037-pm}\n}\n\\subfloat[HD\\,217786]{\n\\includegraphics[scale=0.38]{hd217786-pm.pdf}\n\\label{hd217786-pm}\n}\n\n\n\\caption[]{\\textbf{Continued.} Proper motion analysis for all companion candidates with two or more observation epochs. Data points are AstraLux measurements if not otherwise marked. The dashed lines enclose the area in which a co-moving companion would be expected. This takes into account possible circular orbital motion with the semi-major axis given by the projected separation of the companion.\nThe grey area enclosed by the wobbled lines is the area in which a non-moving background object would be expected, depending on the proper motion and distance of the primary star. The wobble is introduced by the parallactic shift in the primary position due to the Earth's revolution around the sun.} \n\\label{pm-diagrams}\n\\end{figure*}\n\n\n\n\\begin{table}\n \n \n \\caption{Astrometric calibration of all observation epochs as derived from observations of the center of the globular cluster M\\,15. During our 2015 observation epoch M\\,15 was not visible; we instead used binary stars. We list the pixel-scale (PS) and the position angle (PA) of the y-axis for all observation epochs. }\n \n  \\begin{tabular}{@{}ccc@{}}\n  \\hline \n Epoch \t& PS $[mas/pix]$&  PA of y-axis $[^\\circ]$\\\\\n \\hline\n\t30-06-2013\t\t&\t46.748 $\\pm$ 0.14\t&\t358.18 $\\pm$ 0.16\t\t\\\\\n\t19-08-2014\t\t&\t46.864 $\\pm$ 0.10\t&\t358.15 $\\pm$ 0.12\t\t\\\\\n\t10-03-2015\t\t&\t46.834 $\\pm$ 0.13\t&\t357.66 $\\pm$ 0.15\t\t\\\\\n\n\\hline\\end{tabular}\n\\label{tab: astrocal}\n\n\n\\end{table}\n\n\n\n\\begin{table*}\n \n \n  \\caption{Relative astrometry and photometry of all detected known companions and new companion candidates extracted from our Astralux observations. We indicate if the companion candidate is co-moving with the host star or not, if this can already be determined. We also give the confidence level of the proper motion result for the newly detected companion candidates, as well as the corresponding reference for the previously known systems.}\n  \\begin{tabular}{@{}lccccccc@{}}\n  \\hline\n        \n Star \t\t& \\# cc\t\t& \tepoch  \t\t& separation [arcsec] \t\t& \tposition angle [deg] \t\t& \t$\\Delta$mag [mag] \t& \tco-moving?\t& confidence level\\\\\n \\hline\n\\multicolumn{7}{c}{Known companions} \\\\\n\\hline\n\nHD\\,2638 \t&\t\t&\t20-08-2014\t&\t0.5199 $\\pm$ 0.0040\t&\t167.76 $\\pm$ 0.35\t\t&\t3.11 $\\pm$ 0.41\t\t&\tyes\t\t&\t\\cite{2015AJ....149..118R}\t\\\\\nHAT-P-7\t\t&\t\t& \t19-08-2014\t&\t3.828 $\\pm$ 0.011\t&\t89.76 $\\pm$ 0.20\t\t&\t7.556 $\\pm$ 0.068\t&\tyes\t\t&\t\\cite{2010PASJ...62..779N}\t\\\\\nHD\\,185269\t&\t\t&\t30-06-2013\t&\t4.501 $\\pm$ 0.016\t&\t8.09 $\\pm$ 0.24\t\t\t&\t7.018 $\\pm$ 0.067\t&\tyes\t\t&\t\\cite{2012MNRAS.421.2498G}\t\\\\\n\t\t&\t\t&\t19-08-2014\t&\t4.533 $\\pm$ 0.014\t&\t8.06 $\\pm$ 0.22\t\t\t&\t7.118 $\\pm$ 0.074\t&\t\t\t&\t\t\\\\\nWASP-76\t\t&\t\t&\t20-08-2014\t&\t0.4438 $\\pm$ 0.0053\t&\t214.92 $\\pm$ 0.56\t\t&\t2.58 $\\pm$ 0.27\t\t&\t-\t\t&\t\\cite{2015AandA...579A.129W}\t\\\\\nHAT-P-32\t&\t\t&\t20-08-2014\t&\t2.9250 $\\pm$ 0.0074\t&\t110.79 $\\pm$ 0.17\t\t&\t5.403 $\\pm$ 0.057\t&\tyes\t\t&\t\\cite{2015ApJ...800..138N}\t\\\\\n\n \\hline\n\\multicolumn{7}{c}{New companion candidates} \\\\\n\\hline\n\nHD\\,10697\t&\t\t&\t21-08-2014\t&\t8.858 $\\pm$ 0.019\t&\t286.73 $\\pm$ 0.14\t\t&\t7.402 $\\pm$ 0.095\t&\t-\t\t&\t\t\\\\\nHD\\,43691\t&\t\t&\t10-03-2015\t&\t4.435 $\\pm$ 0.016\t&\t40.77 $\\pm$ 0.24\t\t&\t7.71 $\\pm$ 0.11\t\t&\t-\t\t&\t\t\\\\\nHD\\,116029\t&\t\t&\t30-06-2013\t&\t1.3871 $\\pm$ 0.0058\t&\t209.11 $\\pm$ 0.28\t\t&\t8.8 $\\pm$ 1.8\t\t&\t-\t\t&\t\t\\\\\nHAT-P-18\t&\t\t&\t01-07-2013\t&\t2.643 $\\pm$ 0.014\t&\t185.72 $\\pm$ 0.33\t\t&\t7.19 $\\pm$ 0.12\t\t&\t-\t\t&\t\t\\\\\nKepler-37\t&\t\t&\t20-08-2014\t&\t8.516 $\\pm$ 0.019\t&\t196.93 $\\pm$ 0.15\t\t&\t6.347 $\\pm$ 0.056\t&\tno\t\t&\t4.3\\,$\\sigma$\t\\\\\nKepler-21  \t&\t\t& \t02-07-2013\t&\t0.7671 $\\pm$ 0.0062\t&\t129.74 $\\pm$ 0.46\t\t&\t5.9$^{+4.2}_{-1.0}$\t&\tyes\t\t&\t4.0\\,$\\sigma$\t\\\\\n\t\t&\t\t&\t20-08-2014\t&\t0.7739 $\\pm$ 0.0099\t&\t129.53 $\\pm$ 0.63\t\t&\t$<$ 8.1\t\t\t&\t\t\t&\t\t\\\\\nKepler-68\t&\t\t&\t02-07-2013\t&\t10.953 $\\pm$ 0.034\t&\t145.39 $\\pm$ 0.20\t\t&\t6.569 $\\pm$ 0.073\t&\tyes\t\t&\t2.1\\,$\\sigma$\t\\\\\n\t\t&\t\t&\t19-08-2014\t&\t10.979 $\\pm$ 0.030\t&\t145.43 $\\pm$ 0.18\t\t&\t6.641 $\\pm$ 0.075\t&\t\t\t&\t\t\\\\\nKepler-42\t&\t\t&\t01-07-2013\t&\t5.206 $\\pm$ 0.017\t&\t118.93 $\\pm$ 0.21\t\t&\t4.157 $\\pm$ 0.082\t&\t-\t\t&\t\t\\\\\nHD\\,188015\t&\t1\t&\t01-07-2013\t&\t4.167 $\\pm$ 0.013\t&\t296.88 $\\pm$ 0.20\t\t&\t8.46 $\\pm$ 0.12\t\t&\tno\t\t&\t3.0\\,$\\sigma$\t\\\\\n\t\t&\t2\t&\t01-07-2013\t&\t10.835 $\\pm$ 0.033\t&\t305.61 $\\pm$ 0.19\t\t&\t9.00 $\\pm$ 0.15\t\t&\t-\t\t&\t\t\\\\\n\t\t&\t3\t&\t01-07-2013\t&\t9.784 $\\pm$ 0.031\t&\t268.09 $\\pm$ 0.20\t\t&\t9.40 $\\pm$ 0.18\t\t&\t-\t\t&\t\t\\\\\n\t\t&\t4\t&\t01-07-2013\t&\t4.063 $\\pm$ 0.013\t&\t113.72 $\\pm$ 0.20\t\t&\t9.05 $\\pm$ 0.15\t\t&\t-\t\t&\t\t\\\\\n\t\t&\t5\t&\t01-07-2013\t&\t7.037 $\\pm$ 0.021\t&\t168.55 $\\pm$ 0.19\t\t&\t9.35 $\\pm$ 0.18\t\t&\t-\t\t&\t\t\\\\\n\t\t&\t6\t&\t01-07-2013\t&\t7.197 $\\pm$ 0.022\t&\t109.60 $\\pm$ 0.19\t\t&\t8.78 $\\pm$ 0.14\t\t&\t-\t\t&\t\t\\\\\n\t\t&\t1\t&\t20-08-2014\t&\t4.237 $\\pm$ 0.014\t&\t297.52 $\\pm$ 0.22\t\t&\t8.91 $\\pm$ 0.23\t\t&\t\t\t&\t\t\\\\\n\t\t&\t2\t&\t20-08-2014\t&\t10.9449 $\\pm$ 0.070\t&\t305.71 $\\pm$ 0.37\t\t&\t9.11 $\\pm$ 0.23\t\t&\t\t\t&\t\t\\\\\n\t\t&\t3\t&\t20-08-2014\t&\t9.947 $\\pm$ 0.102\t&\t268.15 $\\pm$ 0.52\t\t&\t9.47 $\\pm$\t0.29\t&\t\t\t&\t\t\\\\\n\t\t&\t4\t&\t20-08-2014\t&\t4.006 $\\pm$ 0.067\t&\t112.48 $\\pm$ 0.79\t\t&\t9.25 $\\pm$\t0.36\t&\t\t\t&\t\t\\\\\n\t\t&\t6\t&\t20-08-2014\t&\t7.066 $\\pm$ 0.068\t&\t109.41 $\\pm$ 0.50\t\t&\t8.78 $\\pm$\t0.18\t&\t\t\t&\t\t\\\\\nHD\\,197037\t&\t\t&\t02-07-2013\t&\t3.676 $\\pm$ 0.011\t&\t182.21 $\\pm$ 0.18\t\t&\t5.124\t$\\pm$ 0.051\t&\tyes\t\t&\t19.2\\,$\\sigma$\t\\\\\n\t\t&\t\t&\t20-08-2014\t&\t3.6876 $\\pm$ 0.0088\t&\t182.14 $\\pm$ 0.17\t\t&\t5.159\t$\\pm$ 0.052\t&\t\t\t&\t\t\\\\\nHD\\,217786\t&\t\t&\t28-07-2011\t&\t2.8105 $\\pm$ 0.0091\t&\t170.81 $\\pm$ 0.26\t\t&\t7.212\t$\\pm$ 0.078\t&\tyes\t\t&\t46.8\\,$\\sigma$\t\\\\\n\t\t&\t\t&\t01-07-2013\t&\t2.8327 $\\pm$ 0.0092\t&\t170.22 $\\pm$ 0.20\t\t&\t7.171\t$\\pm$ 0.084\t&\t\t\t&\t\t\\\\\n\t\t&\t\t&\t21-08-2014\t&\t2.8560 $\\pm$ 0.0069\t&\t170.34 $\\pm$ 0.16\t\t&\t7.160\t$\\pm$ 0.096\t&\t\t\t&\t\t\\\\\n\n\n\\hline\\end{tabular}\n\\label{tab:measurements}\n\n\\end{table*}\n\n\n\n\\begin{table}\n \n \n \\caption{Astrometric measurements of the two low-mass binary components of the HD185269 system relative to the host star from SPHERE data}\n \n  \\begin{tabular}{@{\\extracolsep{4pt}}ccccc@{}}\n  \\hline \n\t\t\t& \\multicolumn{2}{c}{Ba} \t\t\t\t& \\multicolumn{2}{c}{Bb} \\\\\n  \\cline{2-3} \\cline{4-5}\t\t\t\n Filter \t\t& Sep. $[arcsec]$\t&  PA $[^\\circ]$ \t\t& Sep. $[arcsec]$\t&  PA $[^\\circ]$\\\\\n\tY\t\t&\t4.549 $\\pm$ 0.011\t&\t8.15 $\\pm$ 0.15\t\t&\t4.442 $\\pm$ 0.011\t&\t7.43 $\\pm$ 0.14\t\\\\\n\tJ\t\t&\t4.547 $\\pm$ 0.011\t&\t8.15 $\\pm$ 0.14\t\t&\t4.436 $\\pm$ 0.011\t&\t7.44 $\\pm$ 0.15\t\\\\\n\tH\t\t&\t4.547 $\\pm$ 0.011\t&\t8.15 $\\pm$ 0.15\t\t&\t4.436 $\\pm$ 0.011\t&\t7.43 $\\pm$ 0.15\t\\\\\n\n\\hline\\end{tabular}\n\\label{tab: hd185269-sphere}\n\n\n\\end{table}\n\n\n\\section{Photometric measurements and mass determination}\n\\label{sec: phot}\n\nTo determine the masses of the confirmed companions as well as the possible companion candidates, we performed photometric measurements for all our observation epochs. \nSince the photometry depends on the gain settings of the detector as well as the observation conditions and height of the target, we did not record a photometric standard star and rather give relative photometric measurements of the companions (and candidates) to their primary stars. \nWhile the PSFs of all sources in one image are similar, they are changing with observing conditions and elevation of the targets as well, thus it is not possible to build a reference PSF for photometric measurements from the data. We instead decided to perform aperture photometry on all sources. \nWe used the aperture photometry tool (APT, \\citealt{2012PASP..124..737L}) for these measurements. The aperture size was adjusted for each image individually to encircle the majority of the flux of the companion candidates. The same aperture size was then used to get the reference measurement from the primary star. \nIn the cases where the faint sources were located within the bright halo of the primary star, care was taken to select a sky aperture close to the companion position to accurately subtract the contribution of the primary to the flux in the aperture. \nIn the case of the primary star, we used sky apertures with large separations from the primary in order to not oversubstract flux due to halo contributions. All results are given in Tab.~\\ref{tab:measurements}. \\\\\nThe presented uncertainties take into account statistical uncertainties, which were scaled with a factor of $\\sqrt{2}$ to take into account the increased photometric uncertainty of electron multiplying CCDs. \nIn addition, we consider uncertainties in the differential magnitudes from changing aperture sizes, i.e. if we increase or decrease the aperture radius by up to 2\\,pixels. \nThese were typically in the order of 0.04\\,mag and were added in quadrature to the statistical uncertainties.\\\\   \nTo convert our photometric measurements to masses we used the BT-SETTL evolutionary models for low-mass stars, brown dwarfs and planets (\\citealt{2011ASPC..448...91A}). \nThese models take the absolute magnitude and the age of an object as input. To compute the absolute magnitude of our confirmed/possible companions we used the apparent magnitude of the host star in the SDSS i-band, as well as the distance of the host star. We then assume that the companions are of the same age as the host star.\nWe summarize these input values for all targets in our survey in Tab.~\\ref{tab:detection-input}. To get a finer model-grid we interpolated (linearly) between different model ages and star magnitudes. The final masses for all confirmed or possible companion candidates are listed along with their derived absolute magnitude in Tab.~\\ref{tab:masses}.\nThe listed uncertainties for the absolute magnitude include the uncertainty of the apparent magnitude of the host star, as well as the uncertainty in the measured differential magnitude and the uncertainty in the distance of the system. The uncertainties listed for the masses of the objects also account for the uncertainty of the system age.\nIn the following we compare our photometric measurements and mass determination for a few systems with available literature values.\\\\ \n\\\\\n\\textit{HD\\,2638}\\\\\n\\\\\nFor the close stellar companion to HD\\,2638 we find a differential magnitude of 3.11 $\\pm$ 0.41\\,mag in the SDSS i-band. Using this measurement along with the age, distance and apparent magnitude of the primary star, we find a mass of 0.425$^{+0.067}_{-0.095}$ M$_\\odot$ for the companion.\nThe companion was originally discovered by \\cite{2015ApJ...799....4R} using Robo-AO in the optical. They have two measurements in the SDSS i-band and find differential magnitudes between primary and companion of 3.39\\,mag and 3.19\\,mag (\\citealt{2015ApJ...799....4R}, \\citealt{2015AJ....149..118R}). They do not provide uncertainties for these measurements. However, given our own uncertainties, both values are within 1\\,$\\sigma$ of our own measurement.\nTo compare our mass result with independent measurements, we used the K$_s$ and J-band photometric measurements of the companion, provided in the characterization paper of the object by \\cite{2015AJ....149..118R}. To calculate a mass range we use again BT-SETTL models. We find an approximate mass range of 0.53\\,M$_\\odot$ to 0.45\\,M$_\\odot$. \nWhile this is slightly larger than our own SDSS i-band result, both measurements are consistent within our 1$\\sigma$ uncertainties. The small discrepancy might be explained by a potential oversubtraction of background flux in our SDSS i-band images.\\\\\n\\\\\n\\textit{HAT-P-7}\\\\\n\\\\\nWe measure a differential SDSS i-band magnitude between HAT-P-7\\,A and B of 7.556 $\\pm$ 0.068\\,mag. This value is in excellent agreement with the measurement very recently reported in \\cite{2015A&A...575A..23W}, who use the same instrument setup and find a value of 7.58 $\\pm$ 0.17\\,mag. \nUsing our differential SDSS i-band magnitude and the system parameters listed in Tab.~\\ref{tab:detection-input}, we arrive at a mass of 0.205$^{+0.026}_{-0.021}$ M$_\\odot$.\nThis mass estimate is consistent with the mass range given in the discovery paper by \\cite{2010PASJ...62..779N}, who find 0.17 - 0.20\\,M$_\\odot$ from near infrared and optical photometry. It also agrees with the more recent mass estimated by \\cite{2015ApJ...800..138N}, who find a range of  0.196 - 0.232\\,M$_\\odot$, also from near infrared photometry.\\\\\n\\\\\n\\textit{HD\\,185269}\\\\\n\\\\\nThe photometric measurements in SDSS i-band of the 2013 and 2014 AstraLux observation of this system are consistent within 1$\\sigma$ with the previous value published by us in \\cite{2012MNRAS.421.2498G}.\nBesides the unresolved SDSS i-band photometry, the SPHERE data enabled us to take photometric measurements of the individual components of HD\\,185269\\,B. Since we do not have additional sources in the field of view other than the primary and the binary companion, we again used aperture photometry to derive the brightness of the binary components. \nAs mentioned previously the primary star is saturated in Y and H-band, thus in these bands we could only measure the brightness difference between the binary components. However, our J-band data is unsaturated, which enabled photometric calibration of the binary measurements with the primary star.\nWe list all our results in Tab.~\\ref{tab:hd185269-sphere-phot}. The given J-band magnitudes are assuming that the neutral density filter is flat across the covered wavelength range.\\\\ \nWe used again the BT-SETTL models to convert the J-band measurements into masses of the individual components. For this conversion we utilized the J-band magnitude of the primary of 5.518$\\pm$0.027\\,mag (\\citealt{2003yCat.2246....0C}) and the most recent age estimate by \\cite{2013A&A...551L...8P} of 3.49$\\pm$0.79\\,Gyr. The system is located at a distance of 47.37$\\pm$1.72\\,pc (\\citealt{2007AandA...474..653V}).\nGiven the brightness of the binary components, we calculate masses of 0.165$\\pm$0.008\\,M$_\\odot$ and 0.154$^{+0.009}_{-0.008}$\\,M$_\\odot$ for the Ba and Bb components respectively. \\\\\nTo compare these results with our unresolved SDSS i-band measurements we calculated the flux ratio between the two components in Y-band. Given the differential brightness measured in our SPHERE image, the flux ratio between the two components is 0.8. \nTo verify that this flux ratio is consistent with our AstraLux observations in SDSS i-band, we used the results obtained from PSF fitting of the two components of HD185269\\,B in the 2013 AstraLux data mentioned in section \\ref{sec:astrometry}. This PSF fitting yields a flux ratio of 0.78, i.e. consistent with the Y-band results obtained with SPHERE.\nWe calculated the expected apparent SDSS i-band magnitudes for both components to be 14.12$\\pm$0.10\\,mag and 14.36$\\pm$0.10\\,mag. \nFrom these measurements we derived SDSS i-band masses of 0.18$\\pm$0.01\\,M$_\\odot$ and 0.16$\\pm$0.01\\,M$_\\odot$ for the Ba and Bb component respectively. These are consistent with our more precise J-band masses within 1$\\sigma$.\\\\\n\\\\\n\\textit{WASP-76}\\\\\n\\\\\nFor WASP-76 we find a differential magnitude in the SDSS i-band of 2.58 $\\pm$ 0.27\\,mag. This is very consistent with the value of 2.51 $\\pm$ 0.25\\,mag recovered by \\cite{2015AandA...579A.129W}, using the same instrument setup. \nGiven our differential magnitude and the age, distance and apparent magnitude of the primary star shown in Tab.~\\ref{tab:detection-input}, we compute a mass of the object of 0.692$^{+0.074}_{-0.059}$ M$_\\odot$, assuming that it is indeed gravitationally bound.\\\\\n\\\\\n\\textit{HAT-P-32}\\\\\n\\\\\nIn the case of the HAT-P-32 system we find a differential SDSS i-band magnitude of 5.403 $\\pm$ 0.057\\,mag for the stellar companion. Given the age, distance and apparent magnitude of the primary star this translates into a mass of 0.340$^{+0.048}_{-0.024}$ M$_\\odot$. The mass of HAT-P-32\\,B was also recently estimated by \\cite{2015ApJ...800..138N}, who detected the companion in J, H and K-band. They arrived at a mass of 0.393 $\\pm$ 0.012\\,M$_\\odot$ for J and K-band, and 0.4243 $\\pm$ 0.0085\\,M$_\\odot$ for H-band. Our mass estimate is lower but marginally consistent within 1$\\sigma$ with their J and K-band results. We are deviating from their higher H-band mass by 1.5\\,$\\sigma$. However, we want to point out that their two mass estimates also deviate by a similar margin. In principle it is possible that our slightly lower mass estimate is caused by an overestimation of the background, which is dominated by the bright stellar halo, even though we get consistent photometric results with other studies for sources at even smaller separations, such as WASP-76. \n\n\\section{Detection limits}\n\n\\label{sec: detect}\n\nTo guide future observations and enable more sophisticated statistical analysis of the multiplicity ratio of exoplanet hosts, we have derived detection limits at various separations for each of our target stars. For this purpose, we first computed the achievable magnitude difference (contrast) compared to the bright primary star at these separations. \nWe assume that an object is detectable when its' signal-to-noise ratio is equal or larger than 5. We then use the peak brightness of the bright primary star as calibration value for the signal. The noise at each separation is determined by averaging over the standard deviation measured in 5$\\times$5 pixel boxes which are centered on each pixel with the respective separation from the primary star. \nIn Fig.~\\ref{average-contrast} we show the average contrast of all our observations along with the best and worst contrast achieved up to a separation of 5\\,arcsec, at which we reach the background limit.\nTo convert from these magnitude limits to mass limits, we again utilized the BT-SETTL models as described in section \\ref{sec: phot}. The input values for this conversion are given in Tab.~\\ref{tab:detection-input}. The final derived mass limits are given in Tab.~\\ref{tab:detection-output}. \nIn some cases not all necessary input values were available; we then give only the achievable magnitude limit, which can be used to calculate mass limits at a later time, should all the input values become available. In addition, in a few cases the detectable minimum mass was located outside of our model grid. We then give a lower or upper detection limit based on the closest grid value.\\\\\nOur detection limits depend mostly on the atmospheric conditions during the observations as well as the brightness and distance of the exoplanet host. Since our sample consists mostly of evolved systems with typical ages in the order of a few Gyr, the dependency of the detectable mass limit on the age is less important.\nWe are on average sensitive to masses down to 0.52\\,$M_\\odot$ outside of 1\\,arcsec and down to 0.16\\,$M_\\odot$ in the background limited region outside of 5\\,arcsec. These detection limits are comparable to our previous study \\cite{2012MNRAS.421.2498G} in which we used AstraLux on a similar sample of target systems.\n\n\n\n\\begin{figure}\n\\subfloat[HD\\,43691\\,A]{\n\\includegraphics[scale=0.25]{hd43691-contour-A.jpg}\n\\label{hd43691-contour-A}\n}\n\n\\subfloat[HD\\,43691\\,cc]{\n\\includegraphics[scale=0.25]{hd43691-contour-cc.jpg}\n\\label{hd43691-contour-cc}\n}\n\n\\caption[]{Close up of the primary star and companion candidate PSF of HD\\,43691. The primary star appears relatively circular with a halo that extends in the north-south direction. \nThe companion candidate shows at least two distinct brightness peaks that are extending at an angle of approximately 135\\,deg. Contour lines have been overplotted to guide the eye. }\n\\label{hd43691-contour}\n\\end{figure}\n\n\n\\begin{figure}\n\n\\includegraphics[scale=0.42]{average_contrast.pdf}\n\n\\caption[]{Contrast achieved in our AstraLux observations. We show the average contrast (solid, red line) as well as the best and worst contrast (dash-dotted, blue lines). The contrast depends strongly on the observing conditions, which explains the large spread between the best and worst contrast. Individual contrast curves for each target are available as supplementary online material.} \n\\label{average-contrast}\n\\end{figure}\n\n\n\n\\begin{table*}\n \n \n  \\caption{Distances, apparent magnitudes and ages of all target stars in our survey. We give the corresponding references in adjacent columns.}\n  \\begin{tabular}{@{}lclclcl@{}}\n  \\hline\n        \n Star \t\t\t\t& SDSS i [mag]\t& Ref. \t\t\t\t\t\t\t& Distance [pc] \t\t\t\t& Ref. \t\t\t\t\t\t\t& Age [Gyr]\t\t\t& Ref. \t\t\t\t\t\t\t\t\t\t\t\\\\\n \\hline\n\nHD2638\t&\t9.01\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t49.9$\\,\\pm\\,$4.0\t\t&\t\\cite{2007AandA...474..653V}\t&\t1.9$\\,\\pm\\,$2.6\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD2952\t&\t\t...\t&\t\t&\t114.2$\\,\\pm\\,$6.2\t\t&\t\\cite{2007AandA...474..653V}\t&\t...\t&\t\t\\\\\nHD5608\t&\t5.49\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t56.4$\\,\\pm\\,$1.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t...\t&\t\t\\\\\nHD5891\t&\t7.474\\,$\\pm$\\,0.01\t\t&\t\\cite{2012ApJS..203...21A}\t&\t251.3$\\,\\pm\\,$109.8\t\t&\t\\cite{2007AandA...474..653V}\t&\t1.5$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD8574\t&\t6.97\\,$\\pm$\\,0.01\t\t&\t\\cite{2008PASP..120.1128O}\t&\t44.6$\\,\\pm\\,$1.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t5.0$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD10697\t&\t5.91\\,$\\pm$\\,0.15\t\t&\t\\cite{2008PASP..120.1128O}\t&\t32.6$\\,\\pm\\,$0.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.1$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nWASP-76\t&\t9.318\\,$\\pm$\\,0.001\t\t&\t\\cite{2012ApJS..203...21A}\t&\t120.0$\\,\\pm\\,$20.0\t\t&\t\\cite{2013arXiv1310.5607W}\t&\t5.3$^{+6.1}_{-2.9}$\t&\t\\cite{2013arXiv1310.5607W}\t\\\\\nHAT-P-32\t&\t11.12\\,$\\pm$\\,0.08\t\t&\t\\cite{2008PASP..120.1128O}\t&\t320.0$\\,\\pm\\,$16.0\t\t&\t\\cite{2011ApJ...742...59H}\t&\t0.1$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD12661\t&\t7.1\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t35.0$\\,\\pm\\,$0.8\t\t&\t\\cite{2007AandA...474..653V}\t&\t1.8$\\,\\pm\\,$0.5\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD13189\t&\t6.56\\,$\\pm$\\,0.09\t\t&\t\\cite{2008PASP..120.1128O}\t&\t561.8$\\,\\pm\\,$390.6\t\t&\t\\cite{2007AandA...474..653V}\t&\t...\t&\t\t\\\\\nHD13908\t&\t7.33\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t71.2$\\,\\pm\\,$3.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.9$\\,\\pm\\,$0.4\t&\t\\cite{2014AandA...563A..22M}\t\\\\\nHD15779\t&\t4.82\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t81.4$\\,\\pm\\,$3.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t...\t&\t\t\\\\\nHD285507\t&\t9.91\\,$\\pm$\\,0.11\t\t&\t\\cite{2008PASP..120.1128O}\t&\t41.3$\\,\\pm\\,$4.0\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.63$\\,\\pm\\,$0.05\t&\t\\cite{2014ApJ...787...27Q}\t\\\\\nHD290327\t&\t8.62\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t56.7$\\,\\pm\\,$5.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t11.8$\\,\\pm\\,$1.2\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD40979\t&\t6.57\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t33.1$\\,\\pm\\,$0.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t1.5$\\,\\pm\\,$0.5\t&\t\\cite{2007AandA...469..755M}\t\\\\\nHD43691\t&\t7.88\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t80.4$\\,\\pm\\,$5.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.1$\\,\\pm\\,$2.5\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD45350\t&\t7.53\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t48.9$\\,\\pm\\,$1.8\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.0$\\,\\pm\\,$0.9\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nOmi Uma\t&\t2.9635\\,$\\pm$\\,0.042\t\t&\t\\cite{2005AJ....130..873J}\t&\t54.9$\\,\\pm\\,$0.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.36$\\,\\pm\\,$0.03\t&\t\\cite{2008AandA...480...91S}\t\\\\\nGJ328\t&\t8.946\\,$\\pm$\\,0.131\t\t&\t\\cite{2005AJ....130..873J}\t&\t19.8$\\,\\pm\\,$0.8\t\t&\t\\cite{2013ApJ...774..147R}\t&\t...\t&\t\t\\\\\nHD95089\t&\t7.4\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t139.1$\\,\\pm\\,$18.2\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.3$\\,\\pm\\,$0.2\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD96063\t&\t7.76\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t158.0$\\,\\pm\\,$23.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.6$\\,\\pm\\,$0.7\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD99706\t&\t7.14\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t128.9$\\,\\pm\\,$12.4\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.8$\\,\\pm\\,$0.2\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD100655\t&\t5.93\\,$\\pm$\\,0.11\t\t&\t\\cite{2008PASP..120.1128O}\t&\t122.2$\\,\\pm\\,$8.0\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.9$\\,\\pm\\,$0.2\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHIP57274\t&\t8.23\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t25.9$\\,\\pm\\,$0.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t8.4$\\,\\pm\\,$3.7\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD102329\t&\t7.32\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t158.0$\\,\\pm\\,$23.8\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.0$\\,\\pm\\,$0.3\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD106270\t&\t7.21\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t84.9$\\,\\pm\\,$6.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t4.0$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD113337\t&\t5.95\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t36.9$\\,\\pm\\,$0.4\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.2$\\,\\pm\\,$0.1\t&\t\\cite{2014AandA...561A..65B}\t\\\\\nHD116029\t&\t7.36\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t123.2$\\,\\pm\\,$10.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.5$\\,\\pm\\,$0.5\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD120084\t&\t5.37\\,$\\pm$\\,0.05\t\t&\t\\cite{2008PASP..120.1128O}\t&\t100.7$\\,\\pm\\,$2.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t1.1$\\,\\pm\\,$0.3\t&\t\\cite{2008AandA...480...91S}\t\\\\\nBeta UMi\t&\t1.081\\,$\\pm$\\,0.042\t\t&\t\\cite{2005AJ....130..873J}\t&\t40.1$\\,\\pm\\,$0.2\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.0$\\,\\pm\\,$1.0\t&\t\\cite{2014AandA...566A..67L}\t\\\\\nHD131496\t&\t7.33\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t110.0$\\,\\pm\\,$10.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t4.5$\\,\\pm\\,$0.4\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD131496\t&\t7.33\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t110.0$\\,\\pm\\,$10.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t4.5$\\,\\pm\\,$0.4\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD136726\t&\t4.25\\,$\\pm$\\,0.06\t\t&\t\\cite{2008PASP..120.1128O}\t&\t122.1$\\,\\pm\\,$2.9\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.9$\\,\\pm\\,$0.9\t&\t\\cite{2015AandA...575A..18B}\t\\\\\n11 UMi\t&\t4.25\\,$\\pm$\\,0.06\t\t&\t\\cite{2008PASP..120.1128O}\t&\t122.1$\\,\\pm\\,$2.9\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.9$\\,\\pm\\,$0.9\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD136512\t&\t4.99\\,$\\pm$\\,0.06\t\t&\t\\cite{2008PASP..120.1128O}\t&\t82.8$\\,\\pm\\,$3.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.85$\\,\\pm\\,$0.38\t&\t\\cite{2008PASJ...60..781T}\t\\\\\nOmi CrB\t&\t4.99\\,$\\pm$\\,0.06\t\t&\t\\cite{2008PASP..120.1128O}\t&\t82.8$\\,\\pm\\,$3.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t5.6$\\,\\pm\\,$2.2\t&\t\\cite{2008AandA...480...91S}\t\\\\\nHD139357\t&\t4.68\\,$\\pm$\\,0.5\t\t&\t\\cite{2003AJ....125..984M}\t&\t118.1$\\,\\pm\\,$4.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.0$\\,\\pm\\,$2.0\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD145457\t&\t6.08\\,$\\pm$\\,0.11\t\t&\t\\cite{2008PASP..120.1128O}\t&\t125.3$\\,\\pm\\,$7.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.6$\\,\\pm\\,$0.4\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD152581\t&\t7.95\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t185.5$\\,\\pm\\,$40.2\t\t&\t\\cite{2007AandA...474..653V}\t&\t8.6$\\,\\pm\\,$2.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHAT-P-18\t&\t12.125\\,$\\pm$\\,0.01\t\t&\t\\cite{2009ApJS..182..543A}\t&\t166.0$\\,\\pm\\,$9.0\t\t&\t\\cite{2011ApJ...726...52H}\t&\t12.4$\\,\\pm\\,$6.4\t&\t\\cite{2011ApJ...726...52H}\t\\\\\nHD156279\t&\t7.65\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t36.6$\\,\\pm\\,$0.6\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.4$\\,\\pm\\,$1.9\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD163607\t&\t7.643\\,$\\pm$\\,0.001\t\t&\t\\cite{2012ApJS..203...21A}\t&\t68.8$\\,\\pm\\,$2.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t8.91$\\,\\pm\\,$0.01\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD163917\t&\t2.78\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t46.2$\\,\\pm\\,$0.6\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.45$\\,\\pm\\,$0.07\t&\t\\cite{2008AandA...480...91S}\t\\\\\nHIP91258\t&\t8.33\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t44.9$\\,\\pm\\,$1.4\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.4$\\,\\pm\\,$2.4\t&\t\\cite{2014AandA...563A..22M}\t\\\\\nKepler-37\t&\t9.38\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t66.0$\\,\\pm\\,$33.0\t\t&\t\\cite{2013Natur.494..452B}\t&\t3.7$\\,\\pm\\,$0.8\t&\t\\cite{2013MNRAS.436.1883W}\t\\\\\nKepler-21\t&\t8.06\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t112.9$\\,\\pm\\,$7.9\t\t&\t\\cite{2007AandA...474..653V}\t&\t3.55$\\,\\pm\\,$0.03\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD180314\t&\t6.14\\,$\\pm$\\,0.05\t\t&\t\\cite{2008PASP..120.1128O}\t&\t131.4$\\,\\pm\\,$7.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.9$\\,\\pm\\,$0.6\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nKepler-63\t&\t11.44\\,$\\pm$\\,0.02\t\t&\t\\cite{2012yCat.1322....0Z}\t&\t200.0$\\,\\pm\\,$15.0\t\t&\t\\cite{2013ApJ...775...54S}\t&\t0.210$\\,\\pm\\,$0.045\t&\t\\cite{2013ApJ...775...54S}\t\\\\\nKepler-68\t&\t9.83\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t135.0$\\,\\pm\\,$10.0\t\t&\t\\cite{2013ApJ...766...40G}\t&\t6.3$\\,\\pm\\,$1.7\t&\t\\cite{2013ApJ...766...40G}\t\\\\\nKepler-42\t&\t14.375\\,$\\pm$\\,0.5\t\t&\t\\cite{2012yCat.1322....0Z}\t&\t38.7$\\,\\pm\\,$6.3\t\t&\t\\cite{2012ApJ...747..144M}\t&\t5.0$\\,\\pm\\,$1.0\t&\t\\cite{2012ApJ...747..144M}\t\\\\\nHAT-P-7\t&\t10.37\\,$\\pm$\\,0.01\t\t&\t\\cite{2008PASP..120.1128O}\t&\t320.0$\\,\\pm\\,$40.0\t\t&\t\\cite{2008ApJ...680.1450P}\t&\t1.5$\\,\\pm\\,$0.2\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD188015\t&\t7.93\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t57.0$\\,\\pm\\,$2.9\t\t&\t\\cite{2007AandA...474..653V}\t&\t5.3$^{+2.6}_{-0.3}$\t&\t\\cite{2012ApJ...756...46R}\t\\\\\nHD190360\t&\t5.41\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t15.9$\\,\\pm\\,$0.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t11.5$^{+1.3}_{-2.8}$\t&\t\\cite{2012ApJ...756...46R}\t\\\\\nHD197037\t&\t6.63\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t32.3$\\,\\pm\\,$0.4\t\t&\t\\cite{2007AandA...474..653V}\t&\t0.3$\\,\\pm\\,$0.3\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD206610\t&\t7.87\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t193.8$\\,\\pm\\,$43.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.1$\\,\\pm\\,$0.3\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD208527\t&\t4.78\\,$\\pm$\\,0.13\t\t&\t\\cite{2008PASP..120.1128O}\t&\t403.2$\\,\\pm\\,$73.0\t\t&\t\\cite{2007AandA...474..653V}\t&\t2.0$\\,\\pm\\,$1.3\t&\t\\cite{2013AandA...549A...2L}\t\\\\\nHD210277\t&\t6.23\\,$\\pm$\\,0.04\t\t&\t\\cite{2008PASP..120.1128O}\t&\t21.6$\\,\\pm\\,$0.2\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.9$\\,\\pm\\,$2.0\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD217786\t&\t7.54\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t54.9$\\,\\pm\\,$2.3\t\t&\t\\cite{2007AandA...474..653V}\t&\t6.5$\\,\\pm\\,$0.8\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD240210\t&\t7.16\\,$\\pm$\\,0.13\t\t&\t\\cite{2005AJ....130..873J}\t&\t143.0$\\,\\pm\\,$53.0\t\t&\t\\cite{2009ApJ...707..768N}\t&\t10.9$\\,\\pm\\,$1.8\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD219828\t&\t7.78\\,$\\pm$\\,0.03\t\t&\t\\cite{2008PASP..120.1128O}\t&\t72.3$\\,\\pm\\,$4.1\t\t&\t\\cite{2007AandA...474..653V}\t&\t5.0$\\,\\pm\\,$0.7\t&\t\\cite{2015AandA...575A..18B}\t\\\\\nHD220074\t&\t4.77\\,$\\pm$\\,0.07\t\t&\t\\cite{2008PASP..120.1128O}\t&\t324.7$\\,\\pm\\,$52.7\t\t&\t\\cite{2007AandA...474..653V}\t&\t4.5$\\,\\pm\\,$2.8\t&\t\\cite{2013AandA...549A...2L}\t\\\\\nHD222155\t&\t6.86\\,$\\pm$\\,0.02\t\t&\t\\cite{2008PASP..120.1128O}\t&\t49.1$\\,\\pm\\,$1.5\t\t&\t\\cite{2007AandA...474..653V}\t&\t7.9$\\,\\pm\\,$0.1\t&\t\\cite{2015AandA...575A..18B}\t\\\\\n\t\t\n\\hline\\end{tabular}\n\\label{tab:detection-input}\n\n\\end{table*}\n\n\n\\begin{table}\n \n \n \\caption{Absolute magnitude and derived masses for all confirmed or possible companions detected in our survey. The absolute magnitude refers to the SDSS i-band. If multiple measurements were available, we give the average absolute magnitude. }\n \\begin{threeparttable}\n  \\begin{tabular}{@{}ccc@{}}\n  \\hline \n Object \t\t\t& abs. mag. $[mag]$\t&  mass $[M_\\odot]$\\\\\n \\hline\n\tHD\\,2638 \t\t& 8.63 $\\pm$ 0.45\t&\t0.425$^{+0.067}_{-0.095}$\t\\\\\n\tHAT-P-7\t\t\t& 10.40$\\pm$0.28 \t&\t0.205$^{+0.026}_{-0.021}$\t\\\\\n\tHD\\,185269\\tnote{1}\t\t& 10.10 $\\pm$ 0.13 \t&\t0.232$^{+0.012}_{-0.012}$\t\t\\\\\n\tWASP-76\t\t\t& 6.50 $\\pm$ 0.45 \t&\t0.692$^{+0.074}_{-0.059}$\t\t\\\\\n\tHAT-P-32\t\t& 9.00$\\pm$0.15 \t&\t0.340$^{+0.048}_{-0.024}$\t\t\\\\\n\tHD\\,10697\t\t& 10.75 $\\pm$ 0.18\t&\t0.177$^{+0.013}_{-0.010}$\t\\\\\n\tHD\\,43691\\tnote{1}\t\t& 11.06 $\\pm$ 0.19 \t&\t0.160$^{+0.010}_{-0.010}$\t\t\\\\\n\tHD\\,116029\t\t& 10.7 $\\pm$ 1.8 \t&\t0.18$^{+0.21}_{-0.07}$\t\t\\\\\n\tHAT-P-18\t\t& 13.21 $\\pm$ 0.17 \t&\t0.0994$^{+0.0022}_{-0.0016}$\t\t\\\\\n\tKepler-21  \t\t& 8.6$^{+4.2}_{-1.0}$ \t&\t0.42$^{+0.14}_{-0.32}$\t\t\\\\\n\tKepler-68\t\t& 10.78 $\\pm$ 0.18 \t&\t0.175$^{+0.013}_{-0.010}$\t\t\\\\\n\tKepler-42\t\t& 15.59 $\\pm$ 0.62\t&\t0.0819$^{+0.0035}_{-0.0029}$\t\t\\\\\n\tHD\\,197037\t\t& 9.225 $\\pm$ 0.066 \t&\t0.3412$^{+0.0098}_{-0.0477}$\t\t\\\\\n\tHD\\,217786\t\t& 11.02 $\\pm$ 0.13\t&\t0.1622$^{+0.0071}_{-0.0068}$\t\t\\\\\n        \t\t\n\\hline\\end{tabular}\n\n\\begin{tablenotes}\n\\item[1] we give the unresolved magnitude and the derived mass from that unresolved magnitude\n\\end{tablenotes}\n\\end{threeparttable}\n\\label{tab:masses}\n\n\\end{table}\n        \t\t\n\n\\begin{table}\n \n \n \\caption{SPHERE photometric measurements and mass estimates of the resolved components of the binary HD185269\\,B. The primary star is saturated in Y and H-band, and thus masses and differential magnitudes could only be calculated in J-band.}\n \n  \\begin{tabular}{@{}cccc@{}}\n  \\hline \n Filter\t\t\t\t\t& BB\\_Y\t\t\t\t&   BB\\_J\t\t\t& BB\\_H\t\t\\\\\n \\hline\n$\\Delta$Ba/Bb $[mag]$\t \t\t&\t0.24 $\\pm$ 0.11 \t&\t0.14 $\\pm$ 0.12 \t& 0.21 $\\pm$ 0.04 \t\\\\\n$\\Delta$A/Ba $[mag]$\t\t\t&\t\t...\t\t&\t6.957 $\\pm$ 0.082\t&  ...\t\\\\\n$\\Delta$A/Bb $[mag]$\t\t\t&\t\t...\t\t&\t7.093 $\\pm$ 0.088 \t&  ...\t\\\\\nmass Ba $[M_\\odot]$\t\t\t&\t \t...\t\t&\t0.165$\\pm$0.08 \t\t&  ...\t\\\\\nmass Bb $[M_\\odot]$      \t\t&\t \t...\t\t&\t0.154$^{+0.009}_{-0.008}$ \t\t\t&  ...\t\\\\\n      \n\\hline\\end{tabular}\n\\label{tab:hd185269-sphere-phot}\n\n\n\\end{table}\n\n        \t\t\n        \t\t\n        \t\t\n        \t\t\n\\begin{table*}\n \n \n  \\caption{Detection limits of all stars observed in our survey. We give the achievable magnitude difference as well as the corresponding mass limit.}\n  \\begin{tabular}{@{\\extracolsep{4pt}}lcccccccc@{}}\n  \\hline\n\t\t\t\t\t\t\t& \\multicolumn{2}{c}{0.5 arcsec}  & \\multicolumn{2}{c}{1 arcsec}        & \\multicolumn{2}{c}{2.5 arcsec}\t\t\t&\t\t\\multicolumn{2}{c}{5 arcsec} \\\\\n\t\\cline{2-3} \\cline{4-5} \\cline{6-7} \\cline{8-9}\n Star \t\t\t\t& $\\Delta$\\,mag\t &\tM$_{min}$\\,[M$_\\odot$]\t\t\t& $\\Delta$\\,mag \t\t\t&\t\tM$_{min}$\\,[M$_\\odot$]\t\t\t& $\\Delta$\\,mag \t\t&\t\tM$_{min}$\\,[M$_\\odot$]\t\t& $\\Delta$\\,mag \t& M$_{min}$\\,[M$_\\odot$]\t\\\\\n\t\t\n\t \\hline\t\n\t\t\nHD2638\t\t&\t3.3\t&\t 0.402 $^{+0.062}_{-0.091}$ \t&\t5.3\t&\t 0.171 $^{+0.028}_{-0.059}$ \t&\t9.0\t&\t 0.0878 $^{+0.0028}_{-0.043}$ \t\t&\t9.6\t&\t 0.0843 $^{+0.0027}_{-0.045}$\t\\\\\nHD2952\t\t&\t3.8\t&\t...\t\t\t\t&\t6.4\t&\t...\t\t\t\t&\t10.3\t&\t...\t\t\t\t\t&\t10.9\t&\t...\t\\\\\nHD5608\t\t&\t2.8\t&\t...\t\t\t\t&\t4.1\t&\t...\t\t\t\t&\t7.7\t&\t...\t\t\t\t\t&\t9.9\t&\t...\t\\\\\nHD5891\t\t&\t2.9\t&\t 1.22 $^{+0.18}_{-1.20}$ \t&\t4.0\t&\t 1.00 $^{+0.18}_{-0.15}$ \t&\t7.5\t&\t 0.52 $^{+0.12}_{-0.13}$ \t\t&\t9.5\t&\t 0.243 $^{+0.12}_{-0.076}$\t\\\\\nHD8574\t\t&\t3.9\t&\t 0.5564 $^{+0.0068}_{-0.0060}$ \t&\t6.9\t&\t 0.1868 $^{+0.0039}_{-0.0034}$ \t&\t10.4\t&\t 0.09028 $^{+0.00054}_{-0.00043}$ \t&\t10.8\t&\t 0.08800 $^{+0.00034}_{-0.00028}$\t\\\\\nHD10697\t\t&\t3.8\t&\t 0.614 $^{+0.019}_{-0.019}$ \t&\t6.3\t&\t 0.275 $^{+0.019}_{-0.019}$ \t&\t9.9\t&\t 0.0994 $^{+0.0021}_{-0.0015}$ \t\t&\t10.1\t&\t 0.0974 $^{+0.0017}_{-0.0016}$\t\\\\\nWASP-76\t\t&\t3.3\t&\t 0.60 $^{+0.11}_{-0.11}$ \t&\t5.3\t&\t 0.34 $^{+0.13}_{-0.14}$ \t&\t8.7\t&\t 0.108 $^{+0.022}_{-0.049}$ \t\t&\t9.1\t&\t 0.102 $^{+0.016}_{-0.047}$\t\\\\\nHAT-P-32\t&\t3.9\t&\t 0.554 $^{+0.054}_{-0.028}$ \t&\t6.0\t&\t 0.253 $^{+0.063}_{-0.030}$ \t&\t8.4\t&\t 0.0871 $^{+0.024}_{-0.0074}$ \t\t&\t8.5\t&\t 0.0826 $^{+0.027}_{-0.0071}$\t\\\\\nHD12661\t\t&\t3.7\t&\t 0.498 $^{+0.015}_{-0.017}$ \t&\t6.1\t&\t 0.19823 $^{+0.010}_{-0.0083}$ \t&\t9.8\t&\t 0.0901 $^{+0.0013}_{-0.0011}$ \t\t&\t10.0\t&\t 0.0881 $^{+0.0011}_{-0.0014}$\t\\\\\nHD13189\t\t&\t3.7\t&\t...\t\t\t\t&\t5.7\t&\t...\t\t\t\t&\t9.9\t&\t...\t\t\t\t\t&\t10.3\t&\t...\t\\\\\nHD13908\t\t&\t3.8\t&\t 0.655 $^{+0.034}_{-0.032}$ \t&\t6.2\t&\t 0.329 $^{+0.039}_{-0.037}$ \t&\t9.8\t&\t 0.1046 $^{+0.0037}_{-0.0036}$ \t\t&\t10.1\t&\t 0.0997 $^{+0.0036}_{-0.0026}$\t\\\\\nHD15779\t\t&\t2.9\t&\t...\t\t\t\t&\t3.9\t&\t...\t\t\t\t&\t7.4\t&\t...\t\t\t\t\t&\t9.8\t&\t...\t\\\\\nHD285507\t&\t3.8\t&\t 0.189 $^{+0.019}_{-0.016}$ \t&\t5.0\t&\t 0.1266 $^{+0.0085}_{-0.0069}$ \t&\t8.6\t&\t 0.0762 $^{+0.0029}_{-0.0032}$ \t\t&\t9.0\t&\t 0.0726 $^{+0.0029}_{-0.0035}$\t\\\\\nHD290327\t&\t3.3\t&\t 0.480 $^{+0.062}_{-0.070}$ \t&\t4.5\t&\t 0.301 $^{+0.076}_{-0.056}$ \t&\t8.0\t&\t 0.1041 $^{+0.0080}_{-0.0060}$ \t\t&\t8.6\t&\t 0.0965 $^{+0.0054}_{-0.0048}$\t\\\\\nHD40979\t\t&\t3.4\t&\t 0.5946 $^{+0.0095}_{-0.0095}$ \t&\t5.2\t&\t 0.347 $^{+0.011}_{-0.011}$ \t&\t9.0\t&\t 0.1025 $^{+0.0011}_{-0.0010}$ \t\t&\t9.8\t&\t 0.09399 $^{+0.00097}_{-0.00074}$\t\\\\\nHD43691\t\t&\t3.5\t&\t 0.652 $^{+0.051}_{-0.047}$ \t&\t4.9\t&\t 0.477 $^{+0.051}_{-0.054}$ \t&\t7.7\t&\t 0.160 $^{+0.021}_{-0.017}$ \t\t&\t8.3\t&\t 0.133 $^{+0.014}_{-0.011}$\t\\\\\nHD45350\t\t&\t3.5\t&\t 0.562 $^{+0.023}_{-0.023}$ \t&\t5.1\t&\t 0.337 $^{+0.029}_{-0.027}$ \t&\t8.7\t&\t 0.1054 $^{+0.0026}_{-0.0025}$ \t\t&\t9.7\t&\t 0.0942 $^{+0.0019}_{-0.0017}$\t\\\\\nOmi Uma\t\t&\t3.5\t&\t$>$1.4\t\t\t\t&\t5.2\t&\t 1.017 $^{+0.013}_{-0.011}$ \t&\t8.9\t&\t 0.4966 $^{+0.0080}_{-0.0076}$ \t\t&\t9.6\t&\t 0.3937 $^{+0.0091}_{-0.0084}$\t\\\\\nGJ328\t\t&\t3.3\t&\t...\t\t\t\t&\t4.4\t&\t...\t\t\t\t&\t7.5\t&\t...\t\t\t\t\t&\t8.2\t&\t...\t\\\\\nHD95089\t\t&\t3.3\t&\t 0.914 $^{+0.11}_{-0.098}$ \t&\t5.0\t&\t 0.671 $^{+0.082}_{-0.080}$ \t&\t8.6\t&\t 0.212 $^{+0.067}_{-0.046}$ \t\t&\t9.5\t&\t 0.155 $^{+0.040}_{-0.027}$\t\\\\\nHD96063\t\t&\t3.1\t&\t 0.91 $^{+0.13}_{-0.11}$ \t&\t4.2\t&\t 0.756 $^{+0.11}_{-0.092}$ \t&\t7.9\t&\t 0.282 $^{+0.11}_{-0.075}$ \t\t&\t9.2\t&\t 0.166 $^{+0.056}_{-0.034}$\t\\\\\nHD99706\t\t&\t3.5\t&\t 0.887 $^{+0.077}_{-0.070}$ \t&\t5.3\t&\t 0.652 $^{+0.060}_{-0.059}$ \t&\t8.7\t&\t 0.213 $^{+0.047}_{-0.037}$ \t\t&\t9.3\t&\t 0.170 $^{+0.034}_{-0.024}$\t\\\\\nHD100655\t&\t3.3\t&\t 1.150 $^{+0.084}_{-0.072}$ \t&\t4.9\t&\t 0.848 $^{+0.055}_{-0.050}$ \t&\t8.9\t&\t 0.320 $^{+0.050}_{-0.045}$ \t\t&\t9.7\t&\t 0.225 $^{+0.035}_{-0.030}$\t\\\\\nHIP57274\t&\t3.4\t&\t 0.285 $^{+0.021}_{-0.017}$ \t&\t4.6\t&\t 0.1740 $^{+0.0099}_{-0.0076}$ \t&\t7.4\t&\t 0.0958 $^{+0.0014}_{-0.0013}$ \t\t&\t7.7\t&\t 0.0931 $^{+0.0014}_{-0.0014}$\t\\\\\nHD102329\t&\t3.3\t&\t 0.97 $^{+0.14}_{-0.12}$ \t&\t4.8\t&\t 0.745 $^{+0.11}_{-0.094}$ \t&\t8.5\t&\t 0.263 $^{+0.10}_{-0.071}$ \t\t&\t9.8\t&\t 0.156 $^{+0.050}_{-0.030}$\t\\\\\nHD106270\t&\t3.1\t&\t 0.806 $^{+0.051}_{-0.047}$ \t&\t4.4\t&\t 0.643 $^{+0.045}_{-0.043}$ \t&\t7.8\t&\t 0.203 $^{+0.033}_{-0.026}$ \t\t&\t8.8\t&\t 0.145 $^{+0.018}_{-0.014}$\t\\\\\nHD113337\t&\t3.6\t&\t 0.671 $^{+0.012}_{-0.013}$ \t&\t5.6\t&\t 0.405 $^{+0.022}_{-0.021}$ \t&\t9.3\t&\t 0.0819 $^{+0.015}_{-0.0076}$ \t\t&\t9.6\t&\t 0.0752 $^{+0.019}_{-0.0066}$\t\\\\\nHD116029\t&\t4.1\t&\t 0.751 $^{+0.060}_{-0.054}$ \t&\t7.1\t&\t 0.372 $^{+0.066}_{-0.064}$ \t&\t10.2\t&\t 0.120 $^{+0.014}_{-0.011}$ \t\t&\t10.3\t&\t 0.1155 $^{+0.013}_{-0.0089}$\t\\\\\nHD120084\t&\t3.4\t&\t 1.148 $^{+0.035}_{-0.030}$ \t&\t4.8\t&\t 0.896 $^{+0.024}_{-0.021}$ \t&\t8.8\t&\t 0.356 $^{+0.020}_{-0.019}$ \t\t&\t9.8\t&\t 0.227 $^{+0.013}_{-0.012}$\t\\\\\nBeta UMi\t&\t3.5\t&\t$>$1.3\t\t\t\t&\t4.6\t&\t$>$1.3\t\t\t\t&\t8.0\t&\t 0.7522 $^{+0.010}_{-0.0084}$ \t\t&\t9.6\t&\t 0.5536 $^{+0.0073}_{-0.0064}$\t\\\\\nHD131496\t&\t4.0\t&\t 0.741 $^{+0.062}_{-0.057}$ \t&\t6.9\t&\t 0.370 $^{+0.071}_{-0.069}$ \t&\t10.1\t&\t 0.117 $^{+0.014}_{-0.010}$ \t\t&\t10.3\t&\t 0.1115 $^{+0.014}_{-0.0072}$\t\\\\\nHD136726\t&\t4.2\t&\t 1.240 $^{+0.071}_{-0.045}$ \t&\t7.0\t&\t 0.777 $^{+0.021}_{-0.020}$ \t&\t10.3\t&\t 0.349 $^{+0.021}_{-0.020}$ \t\t&\t10.5\t&\t 0.320 $^{+0.022}_{-0.020}$\t\\\\\n11 UMi\t\t&\t3.3\t&\t$>$1.2\t\t\t\t&\t4.7\t&\t 1.120 $^{+0.044}_{-0.040}$ \t&\t8.6\t&\t 0.589 $^{+0.017}_{-0.016}$ \t\t&\t9.7\t&\t 0.438 $^{+0.021}_{-0.020}$\t\\\\\nHD136512\t&\t4.1\t&\t 1.008 $^{+0.042}_{-0.038}$ \t&\t7.0\t&\t 0.590 $^{+0.025}_{-0.024}$ \t&\t10.5\t&\t 0.170 $^{+0.013}_{-0.011}$ \t\t&\t10.7\t&\t 0.160 $^{+0.011}_{-0.011}$\t\\\\\nOmi CrB\t\t&\t3.5\t&\t 1.040 $^{+0.074}_{-0.058}$ \t&\t4.8\t&\t 0.852 $^{+0.043}_{-0.037}$ \t&\t8.5\t&\t 0.373 $^{+0.032}_{-0.031}$ \t\t&\t10.1\t&\t 0.192 $^{+0.017}_{-0.014}$\t\\\\\nHD139357\t&\t4.4\t&\t 1.03 $^{+0.19}_{-1.00}$ \t&\t7.3\t&\t 0.674 $^{+0.068}_{-0.065}$ \t&\t10.2\t&\t 0.291 $^{+0.079}_{-0.058}$ \t\t&\t10.3\t&\t 0.283 $^{+0.076}_{-0.056}$\t\\\\\nHD145457\t&\t4.5\t&\t 0.896 $^{+0.053}_{-0.049}$ \t&\t7.2\t&\t 0.536 $^{+0.040}_{-0.041}$ \t&\t10.3\t&\t 0.170 $^{+0.021}_{-0.017}$ \t\t&\t10.4\t&\t 0.163 $^{+0.019}_{-0.016}$\t\\\\\nHD152581\t&\t3.9\t&\t 0.79 $^{+0.15}_{-0.13}$ \t&\t6.8\t&\t 0.46 $^{+0.14}_{-0.16}$ \t&\t9.7\t&\t 0.146 $^{+0.069}_{-0.036}$ \t\t&\t9.8\t&\t 0.142 $^{+0.064}_{-0.033}$\t\\\\\nHAT-P-18\t&\t4.1\t&\t 0.222 $^{+0.028}_{-0.023}$ \t&\t6.6\t&\t 0.1067 $^{+0.0045}_{-0.0037}$ \t&\t7.9\t&\t 0.0923 $^{+0.0028}_{-0.0025}$ \t\t&\t8.0\t&\t 0.0915 $^{+0.0028}_{-0.0021}$\t\\\\\nHD156279\t&\t4.0\t&\t 0.389 $^{+0.015}_{-0.013}$ \t&\t6.5\t&\t 0.1478 $^{+0.0039}_{-0.0035}$ \t&\t10.0\t&\t 0.08598 $^{+0.00050}_{-0.00050}$ \t&\t10.3\t&\t 0.08471 $^{+0.00050}_{-0.00050}$\t\\\\\nHD163607\t&\t3.7\t&\t 0.609 $^{+0.020}_{-0.018}$ \t&\t6.2\t&\t 0.271 $^{+0.019}_{-0.018}$ \t&\t9.6\t&\t 0.1019 $^{+0.0023}_{-0.0022}$ \t\t&\t9.8\t&\t 0.0991 $^{+0.0020}_{-0.0015}$\t\\\\\nHD163917\t&\t3.8\t&\t 1.289 $^{+0.021}_{-0.019}$ \t&\t6.6\t&\t 0.7652 $^{+0.0095}_{-0.0095}$ \t&\t10.5\t&\t 0.2481 $^{+0.0075}_{-0.0072}$ \t\t&\t11.2\t&\t 0.1843 $^{+0.0050}_{-0.0048}$\t\\\\\nHIP91258\t&\t3.4\t&\t 0.451 $^{+0.024}_{-0.044}$ \t&\t5.0\t&\t 0.234 $^{+0.016}_{-0.055}$ \t&\t8.7\t&\t 0.0939 $^{+0.0016}_{-0.040}$ \t\t&\t9.8\t&\t 0.08582 $^{+0.00099}_{-0.042}$\t\\\\\nKepler-37\t&\t3.5\t&\t 0.40 $^{+0.33}_{-0.25}$ \t&\t5.5\t&\t 0.177 $^{+0.30}_{-0.078}$ \t&\t9.0\t&\t 0.089 $^{+0.040}_{-0.013}$ \t\t&\t9.5\t&\t 0.086 $^{+0.027}_{-0.011}$\t\\\\\nKepler-21\t&\t3.7\t&\t 0.691 $^{+0.043}_{-0.043}$ \t&\t6.0\t&\t 0.395 $^{+0.052}_{-0.051}$ \t&\t9.0\t&\t 0.129 $^{+0.014}_{-0.010}$ \t\t&\t9.2\t&\t 0.124 $^{+0.012}_{-0.010}$\t\\\\\nHD180314\t&\t4.4\t&\t 0.924 $^{+0.054}_{-0.048}$ \t&\t7.2\t&\t 0.544 $^{+0.035}_{-0.035}$ \t&\t10.2\t&\t 0.176 $^{+0.020}_{-0.019}$ \t\t&\t10.4\t&\t 0.168 $^{+0.018}_{-0.017}$\t\\\\\nKepler-63\t&\t3.7\t&\t 0.424 $^{+0.059}_{-0.063}$ \t&\t5.8\t&\t 0.171 $^{+0.034}_{-0.032}$ \t&\t8.0\t&\t 0.081 $^{+0.014}_{-0.011}$ \t\t&\t8.1\t&\t 0.081 $^{+0.014}_{-0.012}$\t\\\\\nKepler-68\t&\t4.0\t&\t 0.485 $^{+0.049}_{-0.054}$ \t&\t6.6\t&\t 0.175 $^{+0.027}_{-0.020}$ \t&\t9.0\t&\t 0.1003 $^{+0.0052}_{-0.0038}$ \t\t&\t9.1\t&\t 0.0985 $^{+0.0046}_{-0.0037}$\t\\\\\nKepler-42\t&\t4.8\t&\t 0.0794 $^{+0.0045}_{-0.0040}$ \t&\t6.4\t&\t 0.0760 $^{+0.0020}_{-0.0061}$ \t&\t6.6\t&\t 0.0756 $^{+0.0020}_{-0.0062}$ \t\t&\t6.6\t&\t 0.0757 $^{+0.0020}_{-0.0062}$\t\\\\\nHAT-P-7\t\t&\t3.6\t&\t 0.704 $^{+0.082}_{-0.079}$ \t&\t5.9\t&\t 0.414 $^{+0.090}_{-0.090}$ \t&\t8.8\t&\t 0.136 $^{+0.029}_{-0.019}$ \t\t&\t9.0\t&\t 0.127 $^{+0.025}_{-0.018}$\t\\\\\nHD188015\t&\t4.5\t&\t 0.424 $^{+0.040}_{-0.040}$ \t&\t7.3\t&\t 0.143 $^{+0.012}_{-0.010}$ \t&\t10.3\t&\t 0.0881 $^{+0.0015}_{-0.0015}$ \t\t&\t10.5\t&\t 0.0870 $^{+0.0015}_{-0.0015}$\t\\\\\nHD190360\t&\t3.7\t&\t 0.4873 $^{+0.0088}_{-0.0062}$ \t&\t6.2\t&\t 0.1886 $^{+0.0042}_{-0.0031}$ \t&\t9.9\t&\t 0.08902 $^{+0.00031}_{-0.00028}$ \t&\t10.3\t&\t 0.08710 $^{+0.00031}_{-0.00025}$\t\\\\\nHD197037\t&\t3.8\t&\t 0.5255 $^{+0.0087}_{-0.024}$ \t&\t6.2\t&\t 0.212 $^{+0.011}_{-0.043}$ \t&\t10.0\t&\t 0.077 $^{+0.011}_{-0.025}$ \t\t&\t10.4\t&\t 0.072 $^{+0.012}_{-0.024}$\t\\\\\nHD206610\t&\t3.2\t&\t 0.97 $^{+0.21}_{-0.17}$ \t&\t4.8\t&\t 0.74 $^{+0.16}_{-0.14}$ \t&\t8.6\t&\t 0.240 $^{+0.15}_{-0.084}$ \t\t&\t9.6\t&\t 0.161 $^{+0.088}_{-0.043}$\t\\\\\nHD208527\t&\t4.0\t&\t$>$1.4\t\t\t\t&\t6.9\t&\t 1.16 $^{+0.24}_{-1.2}$ \t&\t10.1\t&\t 0.66 $^{+0.12}_{-0.11}$ \t\t&\t10.3\t&\t 0.63 $^{+0.12}_{-0.11}$\t\\\\\nHD210277\t&\t3.3\t&\t 0.5234 $^{+0.0099}_{-0.0089}$ \t&\t5.7\t&\t 0.2152 $^{+0.0070}_{-0.0064}$ \t&\t9.6\t&\t 0.09015 $^{+0.00069}_{-0.00042}$ \t&\t10.2\t&\t 0.08645 $^{+0.00040}_{-0.00036}$\t\\\\\nHD217786\t&\t4.0\t&\t 0.532 $^{+0.027}_{-0.025}$ \t&\t5.4\t&\t 0.322 $^{+0.031}_{-0.029}$ \t&\t9.5\t&\t 0.0984 $^{+0.0023}_{-0.0020}$ \t\t&\t9.8\t&\t 0.0948 $^{+0.0020}_{-0.0020}$\t\\\\\nHD240210\t&\t3.6\t&\t 0.85 $^{+0.35}_{-0.85}$ \t&\t5.8\t&\t 0.61 $^{+0.22}_{-0.25}$ \t&\t9.7\t&\t 0.159 $^{+0.17}_{-0.056}$ \t\t&\t10.4\t&\t 0.129 $^{+0.12}_{-0.034}$\t\\\\\nHD219828\t&\t4.1\t&\t 0.559 $^{+0.035}_{-0.035}$ \t&\t7.0\t&\t 0.194 $^{+0.024}_{-0.020}$ \t&\t9.8\t&\t 0.0984 $^{+0.0033}_{-0.0028}$ \t\t&\t9.9\t&\t 0.0974 $^{+0.0029}_{-0.0027}$\t\\\\\nHD220074\t&\t3.7\t&\t$>$1.2\t\t\t\t&\t6.1\t&\t 1.16 $^{+0.24}_{-1.2}$ \t&\t9.8\t&\t 0.64 $^{+0.11}_{-0.10}$ \t\t&\t10.2\t&\t 0.58 $^{+0.11}_{-0.10}$\t\\\\\nHD222155\t&\t3.4\t&\t 0.654 $^{+0.019}_{-0.019}$ \t&\t4.9\t&\t 0.468 $^{+0.023}_{-0.021}$ \t&\t8.8\t&\t 0.1177 $^{+0.0045}_{-0.0043}$ \t\t&\t9.6\t&\t 0.1026 $^{+0.0023}_{-0.0021}$\t\\\\\n\n\t\t\t\t\n\n\\hline\\end{tabular}\n\\label{tab:detection-output}\n\n\\end{table*}\n\n\\section{Discussion of the new bound stellar companions}\n\n\\subsection{Kepler-21}\n\nKepler-21 (also known as HD\\,179070, KOI-975, KIC 3632418) is the brightest star in the original Kepler sample. \\cite{2012ApJ...746..123H} found a transiting planet of approximately 1.6 times the size of the earth in a $\\sim$2.8 day orbit around this star. According to them, the planet has an upper mass limit of 10.5 Earth masses and is moving on a circular orbit. They also carried out high resolution adaptive optics imaging of the host star with the Keck telescope in the near infrared. In these images taken on 22-02-2011 they detected a faint source with a separation of 0.75\\,arcsec at a position angle of 129\\,deg. This source is identical to the source that we detected with AstraLux in our 2013 and 2014 observations and that emerged as new co-moving low-mass stellar companion. \nWe introduce this companion here as a new discovery, because \\cite{2012ApJ...746..123H} exclude the possibility that the source is physically associated to the host star based on its J-K$_s$ color. They argue that the color of the companion is either consistent with a late M dwarf which should then be located at $\\sim$15\\,pc or with a M0 giant, which would be located in an approximate distance of 10\\,kpc. Since Kepler-21 is located at approximately 112\\,pc, the two sources should then not be associated. However, our own astrometric measurements in 2013 and 2014 show clearly that the source is co-moving with Kepler-21. In fact, also the astrometric position given by \\cite{2012ApJ...746..123H} in their 2011 Keck measurement is perfectly consistent with a co-moving object. If the object was indeed a background giant in some kpc distance, we would have expected a position angle of 119.6\\,deg at the time of the 2011 meassurement. Unfortunately \\cite{2012ApJ...746..123H} do not provide uncertainties for their astrometric meassurements. However, a deviation of almost 10\\,deg seems very unlikely.\nTo get an estimate of the likelihood to detect a background or foreground object within 0.77\\,arcsec around Kepler-21 we followed the approach by \\cite{2014A&A...566A.103L}. They give the probability to find a physically unrelated source within a certain distance of a star with \n\n\n", "index": 1, "text": "\\begin{equation}\nP(r,b,m_{\\odot},\\Delta m_{max}) = \\pi r^2 \\rho (b,m_{\\odot},\\Delta m_{max}) \\ ,  \n\\label{prob} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"P(r,b,m_{\\odot},\\Delta m_{max})=\\pi r^{2}\\rho(b,m_{\\odot},\\Delta m_{max})\\ ,\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo>,</mo><mi>b</mi><mo>,</mo><msub><mi>m</mi><mo>⊙</mo></msub><mo>,</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>m</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>π</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>b</mi><mo>,</mo><msub><mi>m</mi><mo>⊙</mo></msub><mo>,</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>m</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub></mrow><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]