[{"file": "1601.06759.tex", "nexttext": "\nThe value $p(x_i | x_1,...,x_{i-1})$ is the probability of the $i$-th pixel $x_i$ given all the previous pixels $x_1,...,x_{i-1}$. The generation proceeds row by row and pixel by pixel. Figure \\ref{depen} illustrates the conditioning scheme.\n\n\nEach pixel $x_i$ is in turn jointly determined by three values, one for each of the color channels Red, Green and Blue (RGB). We rewrite the distribution $p(x_i|{\\mathbf}{x}_{<i})$ as the following product:\n\n", "itemtype": "equation", "pos": 8826, "prevtext": " \n\n\\twocolumn[\n\\icmltitle{Pixel Recurrent Neural Networks}\n\n\n\n\n\n\\icmlauthor{A\\\"aron van den Oord}{avdnoord@google.com}\n\\icmlauthor{Nal Kalchbrenner}{nalk@google.com}\n\\icmlauthor{Koray Kavukcuoglu}{korayk@google.com}\n\\icmladdress{\\vspace{0.3cm} Google DeepMind}\n\n\n\n\n\n\\icmlkeywords{PixelRNN, Discrete Image Distribution, Image Density Models, Recurrent Neural Networks}\n\n\\vskip 0.3in\n]\n\n\n\\begin{abstract} \n\nModeling the distribution of natural images is a landmark problem in unsupervised learning.\nThis task requires an image model that is at once expressive, tractable and scalable. We present a deep neural network that sequentially predicts the pixels in an image along the two spatial dimensions. Our method models the discrete probability of the raw pixel values and encodes the complete set of dependencies in the image. Architectural novelties include fast two-dimensional recurrent layers and an effective use of residual connections in deep recurrent networks. \nWe achieve log-likelihood scores on natural images that are considerably better than the previous state of the art.\nOur main results also provide benchmarks on the diverse ImageNet dataset. Samples generated from the model appear crisp, varied and globally coherent.\n\n\\end{abstract} \n\n\n\\section{Introduction}\n\nGenerative image modeling is a central problem in unsupervised learning. Probabilistic density models can be used for a wide variety of tasks that range from image compression and forms of reconstruction such as image inpainting (e.g., see Figure \\ref{fig:intro_completions}) and deblurring, to generation of new images. When the model is conditioned on external information, possible applications also include creating images based on text descriptions or simulating future frames in a planning task. One of the great advantages in generative modeling is that there are practically endless amounts of image data available to learn from. However, because images are high dimensional and highly structured, estimating the distribution of natural images in general is extremely challenging.\n\n\\begin{figure}[!t]\n\\centering\n\\small\n\\hspace{0.02cm} {occluded} \\hfill completions \\hfill{original} \\,\n\n\\vspace{0.1cm}\n\\includegraphics[ width=0.98\\linewidth]{compl3.png} \n\\caption{Image completions sampled from a PixelRNN.}\n\\label{fig:intro_completions}\n\\end{figure}\n\nOne of the most important obstacles in generative modeling is building complex and expressive models that are also tractable and scalable. This trade-off has resulted in a large variety of generative models, each having their advantages. Most work focuses on stochastic latent variable models \\cite{rezende2014stochastic, DBLP:journals/corr/KingmaW13} that aim to extract meaningful representations, but often come with an intractable inference step that can hinder their performance.\n\nOne effective approach to \\emph{tractably} model a joint distribution of the pixels in the image is to cast it as a product of conditional distributions; this approach has been adopted in autoregressive models such as NADE \\cite{larochelle2011} and fully visible sigmoid belief networks \\cite{neal1992connectionist}. The factorization turns the joint modeling problem into a sequence problem, where one learns to predict the next pixel given all the previously generated pixels. But to model the highly nonlinear and long-range correlations between pixels and the complex conditional distributions that result, a highly expressive sequence model is necessary.\n\nRecurrent Neural Networks (RNN) are powerful models that offer a compact, shared parametrization of a series of conditional distributions. RNNs have been shown to excel at hard sequence problems ranging from handwriting generation \\cite{DBLP:journals/corr/Graves13}, to character prediction \\cite{sutskever2011generating} and to machine translation \\cite{kalchbrenner13emnlp}. A two-dimensional RNN has produced very promising results in modeling grayscale images and textures \\cite{theis2015generative}. \n\n\nIn this paper we advance two-dimensional RNNs and apply them to large-scale modeling of natural images.\nThe resulting \\emph{PixelRNNs} are composed of up to twelve, fast two-dimensional Long Short-Term Memory (LSTM) layers. These layers use LSTM units in their state \\cite{hochreiter1997long, graves2009offline}  and adopt a convolution to compute at once all the states along one of the spatial dimensions of the data. We design two types of these layers. The first type is the \\emph{Row LSTM} layer where the convolution is applied along each row; a similar technique is described in \\cite{NIPS2015_5642}. The second type is the \\emph{Diagonal BiLSTM} layer where the convolution is applied in a novel fashion along the diagonals of the image. The networks also incorporate \\emph{residual connections} \\cite{DBLP:journals/corr/HeZRS15} around LSTM layers; we observe that this helps with training of the PixelRNN for up to twelve layers of depth. \n\nWe also consider a second, simplified architecture which shares the same core components as the PixelRNN. \nWe observe that Convolutional Neural Networks (CNN) can also be used as sequence model with a fixed dependency range, by using \\emph{Masked} convolutions. The \\emph{PixelCNN} architecture is a fully convolutional network of fifteen layers that preserves the spatial resolution of its input throughout the layers and outputs a conditional distribution at each location.\n \nBoth PixelRNN and PixelCNN capture the full generality of pixel inter-dependencies without introducing independence assumptions as in e.g., latent variable models. The dependencies are also maintained between the RGB color values within each individual pixel. \nFurthermore, in contrast to previous approaches that model the pixels as continuous values (e.g., \\citet{theis2015generative, gregor2013deep}), we model the pixels as \\emph{discrete} values using a multinomial distribution implemented with a simple softmax layer. We observe that this approach gives both representational and training advantages for our models.\n\n\nThe contributions of the paper are as follows. In Section \\ref{sect:pixelrnn} we design two types of PixelRNNs corresponding to the two types of LSTM layers; we describe the purely convolutional PixelCNN that is our fastest architecture; and we design a \\emph{Multi-Scale} version of the PixelRNN.\nIn Section \\ref{sect:experiments} we show the relative benefits of using the discrete softmax distribution in our models and of adopting residual connections for the LSTM layers. Next we test the models on MNIST and on CIFAR-10 and show that they obtain log-likelihood scores that are considerably better than previous results. We also provide results for the large-scale ImageNet dataset resized to both $32 \\times 32$ and $64 \\times 64$ pixels; to our knowledge likelihood values from generative models have not previously been reported on this dataset. Finally, we give a qualitative evaluation of the samples generated from the PixelRNNs. The samples are crisp, give evidence of significant object and scene awareness and create realistic novel compositions.\n\n\n\n\n\n\\section{Model}\n\\label{framework}\n\n\n\nOur aim is to estimate a distribution over natural images that can be used to tractably compute the likelihood of images and to generate new ones. The network scans the image one row at a time and one pixel at a time within each row.  For each pixel it predicts the conditional distribution over the possible pixel values given the scanned context. Figure \\ref{depen} illustrates this process. The joint distribution over the image pixels is factorized into a product of conditional distributions. The parameters used in the predictions are shared across all pixel positions in the image. \n\nTo capture the generation process, \\citet{theis2015generative} propose to use a two-dimensional LSTM network \\cite{graves2009offline} that starts at the top left pixel and proceeds towards the bottom right pixel. The advantage of the LSTM network is that it effectively handles long-range dependencies that are central to object and scene understanding. The two-dimensional structure ensures that the signals are well propagated both in the left-to-right and top-to-bottom directions. \n\nIn this section we first focus on the form of the distribution,\nwhereas the next section will be devoted to describing the architectural innovations inside PixelRNN.\n\n\n\\subsection{Generating an Image Pixel by Pixel}\n\nThe goal is to assign a probability $p({\\mathbf}{x})$ to each image ${\\mathbf}{x}$ formed of $n \\times n$ pixels. We can write the image ${\\mathbf}{x}$ as a one-dimensional sequence $x_1,...,x_{n^2}$ where pixels are taken from the image row by row. To estimate the joint distribution $p({\\mathbf}{x})$ we write it as the product of the conditional distributions over the pixels:\n\n", "index": 1, "text": "\\begin{equation}\np({\\mathbf}{x}) = \\prod_{i=1}^{n^2} p(x_i | x_1,...,x_{i-1})\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"p({\\mathbf{}}{x})=\\prod_{i=1}^{n^{2}}p(x_{i}|x_{1},...,x_{i-1})\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msup><mi>n</mi><mn>2</mn></msup></munderover><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><msub><mi>x</mi><mn>1</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06759.tex", "nexttext": " \nEach of the colors is thus conditioned on the other channels as well as on all the previously generated pixels.\n\n\\subsection{Pixels as Discrete Variables}\n\nPrevious approaches use a continuous distribution for the values of the pixels in the image (e.g. \\citet{uria2013deep,theis2015generative}). By contrast we model $p({\\mathbf}{x})$ as a discrete distribution, with every conditional distribution in Equation \\ref{eq:color_conditioning} being a multinomial that is modeled with a softmax layer. Each channel variable $x_{i,*}$ simply takes one of 256 distinct values. The discrete distribution is representationally simple and has the advantage of being arbitrarily multimodal without prior on the shape. Experimentally we also find the discrete distribution to be easy to learn and to produce better performance compared to a continuous distribution (Section \\ref{sect:experiments}).\n\n\\begin{figure}\n\n\\centering\n\\includegraphics[width=0.48\\textwidth]{receptivefields6.pdf}\n\\caption{Left: To generate pixel $x_i$ one conditions on all the previously generated pixels left and above of $x_i$. Center: Illustration of a Row LSTM with a kernel of size 3. The dependency field of the Row LSTM does not reach pixels further away on the sides of the image. Right: Illustration of the two directions of the Diagonal BiLSTM. The dependency field of the Diagonal BiLSTM covers the entire available context in the image.}\n\\label{depen}\n\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Pixel Recurrent Neural Networks}\n\\label{sect:pixelrnn}\n\nIn this section we describe the architectural components that compose the {PixelRNN}. In Sections \\ref{sect:row_lstm} and \\ref{sect:diag_lstm}, we describe the two types of LSTM layers that use convolutions to compute at once the states along one of the spatial dimensions. \nIn Section \\ref{sect:residual} we describe how to incorporate \\emph{residual} connections to improve the training of a PixelRNN with many LSTM layers.  In Section \\ref{sect:masked} we describe the softmax layer that computes the {discrete} joint distribution of the colors and the masking technique that ensures the proper conditioning scheme. In Section \\ref{sect:pixelcnn} we describe the PixelCNN architecture. Finally in Section \\ref{sect:multiscale} we describe the multi-scale architecture.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.46\\textwidth]{skewing3.pdf}\n\\caption{In the Diagonal BiLSTM, to allow for parallelization along the diagonals, the input map is skewed by offseting each row by one position with respect to the previous row. When the spatial layer is computed left to right and column by column, the output map is shifted back into the original size. The convolution uses a kernel of size $2 \\times 1$. }\n\\label{fig:bilstm}\n\\end{figure}\n\n\\subsection{Row LSTM}\n\\label{sect:row_lstm}\n\nThe Row LSTM is a unidirectional layer that processes the image row by row from top to bottom computing features for a whole row at once; the computation is performed with a one-dimensional convolution. For a pixel $x_i$ the layer captures a roughly triangular context above the pixel as shown in Figure \\ref{depen} (center). The kernel of the one-dimensional convolution has size $k \\times 1$ where $k \\geq 3$; the larger the value of $k$ the broader the context that is captured. The weight sharing in the convolution ensures translation invariance of the computed features along each row.\n\nThe computation proceeds as follows. An LSTM layer has an {input-to-state} component and a recurrent {state-to-state} component that together determine the four gates inside the LSTM core. To enhance parallelization in the Row LSTM the input-to-state component is first computed for the entire two-dimensional input map; for this a $k \\times 1$ convolution is used to follow the row-wise orientation of the LSTM itself. The convolution is \\emph{masked} to include only the valid context (see Section \\ref{sect:masked}) and produces a tensor of size $4h \\times n \\times n$, representing the four gate vectors for each position in the input map, where $h$ is the number of features in the  LSTM layer.\n\n To compute one step of the state-to-state component of the LSTM layer, one is given the previous hidden and cell states ${\\mathbf}{h}_{i-1}$ and ${\\mathbf}{c}_{i-1}$, each of size $h \\times n \\times 1$. The new hidden and cell states ${\\mathbf}{h}_i$, ${\\mathbf}{c}_i$ are obtained as follows:\n\n \n", "itemtype": "equation", "pos": -1, "prevtext": "\nThe value $p(x_i | x_1,...,x_{i-1})$ is the probability of the $i$-th pixel $x_i$ given all the previous pixels $x_1,...,x_{i-1}$. The generation proceeds row by row and pixel by pixel. Figure \\ref{depen} illustrates the conditioning scheme.\n\n\nEach pixel $x_i$ is in turn jointly determined by three values, one for each of the color channels Red, Green and Blue (RGB). We rewrite the distribution $p(x_i|{\\mathbf}{x}_{<i})$ as the following product:\n\n", "index": 3, "text": "\\begin{equation}\np(x_{i,R}|{\\mathbf}{x}_{<i})p(x_{i,G}|{\\mathbf}{x}_{<i},x_{i,R})p(x_{i,B}|{\\mathbf}{x}_{<i},x_{i,R},x_{i,G})\n\\label{eq:color_conditioning}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"p(x_{i,R}|{\\mathbf{}}{x}_{&lt;i})p(x_{i,G}|{\\mathbf{}}{x}_{&lt;i},x_{i,R})p(x_{i,B}|%&#10;{\\mathbf{}}{x}_{&lt;i},x_{i,R},x_{i,G})\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>R</mi></mrow></msub><mo stretchy=\"false\">|</mo><msub><mi>x</mi><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>G</mi></mrow></msub><mo stretchy=\"false\">|</mo><msub><mi>x</mi><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow></msub><mo>,</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>R</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>B</mi></mrow></msub><mo stretchy=\"false\">|</mo><msub><mi>x</mi><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow></msub><mo>,</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>R</mi></mrow></msub><mo>,</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>,</mo><mi>G</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06759.tex", "nexttext": "\nwhere ${\\mathbf}{x}_i$ of size $h \\times n \\times 1$ is row $i$ of the input map, and $\\circledast$ represents the convolution operation and $\\odot$ the element-wise multiplication. The weights ${\\mathbf}{K}^{ss}$ and ${\\mathbf}{K}^{is}$ are the kernel weights for the state-to-state and the input-to-state components, where the latter is precomputed as described above. In the case of the output, forget and input gates ${\\mathbf}{o}_i$, ${\\mathbf}{f}_i$ and ${\\mathbf}{i}_i$, the activation $\\sigma$ is the logistic sigmoid function, whereas for the content gate ${\\mathbf}{g}_i$, $\\sigma$ is the $\\tanh$ function. Each step computes at once the new state for an entire row of the input map. Since the Row LSTM layer is unidirectional, it is relatively fast, but it has a considerable drawback.  Due to its roughly triangular shape, the receptive field induced by the layer misses a large portion of the previously generated context corresponding to the areas on either side of the current pixel. For example, for a value of $k=3$ for the state-to-state convolution, which we find gives the best performance in the experiments, the receptive field for the pixels near the center of the image misses roughly \\emph{half} of the generated context (Figure \\ref{depen}).\n\n\\subsection{Diagonal BiLSTM}\n\\label{sect:diag_lstm}\n\nThe Diagonal BiLSTM is designed to both parallelize the computation and to capture the entire available context for any image size. Each of the two directions of the layer scans the image in a diagonal fashion starting from a corner at the top and reaching the opposite corner at the bottom. Each step in the computation computes at once the LSTM state along a diagonal in the image. Figure \\ref{depen} (right) illustrates the computation and the resulting receptive field.\n\n\nThe diagonal computation proceeds as follows. We first skew the input map into a space that makes it easy to apply convolutions along diagonals. The {skewing} operation offsets each row of the input map by one position with respect to the previous row, as illustrated in Figure \\ref{fig:bilstm}; this results in a map of size $n \\times (2n-1)$. At this point we can compute the input-to-state and state-to-state components of the Diagonal BiLSTM. For each of the two directions, the input-to-state component is simply a $1 \\times 1$ convolution $K^{is}$ that contributes to the four gates in the LSTM core; the operation generates a $4 h \\times n \\times n$ tensor. The state-to-state recurrent component is then computed with a \\emph{column-wise} convolution $K^{ss}$ that has a kernel of size $2 \\times 1$. The step takes the previous hidden and cell states, combines the contribution of the input-to-state component and produces the next hidden and cell states, as defined in Equation \\ref{eq:lstm}. The output feature map is then skewed back into an $n \\times n$ map by removing the offset positions. This computation is repeated for each of the two directions. Given the two output maps, to prevent the layer from seeing future pixels, the \\emph{right} output map is then shifted down by one row and added to the \\emph{left} output map.\n \nBesides reaching the full dependency field, the Diagonal BiLSTM has the additional advantage that it uses a convolutional kernel of size $2\\times1$ that processes a minimal amount of information at each step yielding a highly non-linear computation. Kernel sizes larger than $2\\times1$ are not particularly useful as they do not broaden the already global receptive field of the Diagonal BiLSTM. \n\n\\begin{figure}\n\\centering\n\\hfill\n\\begin{subfigure}{.12\\textwidth}\n  \n  \\includegraphics[width=\\linewidth,left]{ResidualOnly.pdf}\n \n  \n\\end{subfigure}\n\\hfill\n\\begin{subfigure}{.28\\textwidth}\n  \\includegraphics[width=\\linewidth]{rgb3.pdf}\n  \n  \n  \\label{fig:sub2}\n\\end{subfigure}\n\\hfill\n\\caption{Left: Diagram of a residual connection around a LSTM layer. Right: Diagram of the connectivity inside a masked convolution. In the first layer, each of the RGB channels is connected to previous channels and to the context, but is not connected to itself. In subsequent layers, the channels are also connected to themselves.}\n\\label{fig:residual_and_masking}\n\\end{figure}\n\\subsection{Residual Connections}\n\\label{sect:residual}\n\nWe train PixelRNNs of up to twelve layers of depth. As a means to both increase convergence speed and propagate signals more directly through the network, we deploy \\emph{residual connections} \\cite{DBLP:journals/corr/HeZRS15} from one LSTM layer to the next. Figure \\ref{fig:residual_and_masking} (left) shows a diagram of the connections. The input map to the LSTM layer has $2h$ features. The input-to-state component reduces the number of features by producing $h$ features per gate. After applying the recurrent layer, the output map is upsampled back to $2h$ features per position via a $1\\times1 $ convolution and the input map is added to the output map. This method is related to previous approaches that use gating along the depth of the recurrent network \\cite{DBLP:journals/corr/KalchbrennerDG15,zhang2016highway}, but has the advantage of not requiring additional gates. Apart from residual connections, one can also use learnable skip connections from each layer to the output. In the experiments we evaluate the relative effectiveness of residual and layer-to-output skip connections. \n\n\\subsection{Masked Convolution}\n\\label{sect:masked}\n\nThe $h$ features for each input position at every layer in the network are split into three parts, each corresponding to one of the RGB channels. When predicting the R channel for the current pixel $x_i$, only the generated pixels left and above of $x_i$ can be used as context. When predicting the G channel, the value of the R channel can also be used as context in addition to the previously generated pixels. Likewise, for the B channel, the values of both the R and G channels can be used. To restrict connections in the network to these dependencies, we apply a \\emph{mask} to the input-to-state convolutions and to other purely convolutional layers in a PixelRNN. \n\nWe use two types of masks that we indicate with \\emph{mask A} and \\emph{mask B}, as shown in Figure \\ref{fig:residual_and_masking}. Mask A is applied only to the first convolutional layer in a PixelRNN and restricts the connections to those neighboring pixels and to those colors in the current pixels that have already been predicted. On the other hand, mask B is applied to all the subsequent input-to-state convolutional transitions and relaxes the restrictions of mask A by also allowing the connection from a color to itself. The masks can be easily implemented by zeroing out the corresponding weights in the input-to-state convolutions after each update. Figure \\ref{fig:residual_and_masking} (right) shows the connections in each of the two masks. Similar masks have also been used in (variational) autoencoders \\cite{gregor2013deep, germain2015made}.\n\n\n\\subsection{PixelCNN}\n\\label{sect:pixelcnn}\n\nThe Row and Diagonal LSTM layers have a potentially unbounded dependency range within their receptive field. This comes with a computational cost as each state needs to be computed sequentially. One simple workaround is to make the receptive field large, but not unbounded. We can use standard convolutional layers to capture a bounded receptive field and compute features for all pixel positions at once. The PixelCNN uses multiple convolutional layers that preserve the spatial resolution; pooling layers are not used. Masks are adopted in the convolutions to avoid seeing the future context. Note that the advantage of parallelization of the PixelCNN over the PixelRNN is only available during training or during evaluating of test images. The image generation process is sequential for both kinds of networks, as each sampled pixel needs to be given as input back into the network.\n\n\\subsection{Multi-Scale PixelRNN}\n\\label{sect:multiscale}\n\nThe Multi-Scale PixelRNN is composed of an \\emph{unconditional} PixelRNN and one or more \\emph{conditional} PixelRNNs. The unconditional network first generates a smaller $s \\times s$ image just like a standard PixelRNN described above, where $s$ is a smaller integer that divides $n$. The conditional network then takes the $s \\times s$ image as an additional input and generates a larger $n\\times n$ image.\n\nThe conditional network is similar to a standard PixelRNN, but each of its layers is biased with an upsampled version of the small $s \\times s$ image. The upsampling and biasing processes are defined as follows. In the upsampling process, one uses a convolutional network with deconvolutional layers to construct an enlarged feature map of size $c \\times n \\times n$, where $c$ is the number of features in the output map of the upsampling network. Then, in the biasing process, for each layer in the conditional PixelRNN, one simply maps the $c \\times n \\times n$ conditioning map into a $4h \\times n \\times n$ map that is added to the input-to-state map of the corresponding layer; this is performed using a $1 \\times 1$ unmasked convolution. The larger $n \\times n$ image is then generated as usual.\n\n\n\\section{Specifications of Models}\n\nIn this section we give the specifications of the PixelRNNs used in the experiments. We have four types of networks: the PixelRNN based on Row LSTM, the one based on Diagonal BiLSTM, the fully convolutional one and the Multi-Scale one. \n\n\n\\begin{table*}[ht]\n\\small\n\t\\begin{center}\n\t\\begin{tabular}{|l|l|l|}\n\t\t\\toprule\n\t\t  \\multicolumn{1}{|c|}{\\textbf{ PixelCNN} }& \\multicolumn{1}{c|}{\\textbf{ Row LSTM} } & \\multicolumn{1}{|c|}{\\textbf{ Diagonal BiLSTM} }  \\\\ \\midrule\n\t\t \\multicolumn{3}{|c|}{ $7 \\times 7$ conv, mask A} \\\\ \\midrule \n\t    \\multirow{3}{*}{ $3\\times3$  conv layers, mask B} & Row LSTM layers & Diagonal BiLSTM layers \\\\ \n\t    & Input-State: $3 \\times 1$ conv, mask B & Input-State: $1\\times1$ conv, mask B \\\\\n\t    & State-State: $3 \\times 1$ conv, no mask & State-State: $1\\times2$ conv, no mask \\\\ \\midrule\n\t     \\multicolumn{3}{|c|}{ ReLU followed by $1 \\times 1$ conv, mask B (2 layers)} \\\\ \\midrule\n\t     \\multicolumn{3}{|c|}{ 256-way Softmax for each RGB color (Natural images) or Sigmoid (MNIST)} \\\\ \n\t    \\bottomrule\n\t\\end{tabular}\n\t\\end{center}\n\\caption{Details of the PixelRNN architectures.}\n\\label{table:architectures}\n\\end{table*}\n\nTable \\ref{table:architectures} specifies each layer in the single-scale networks. The first layer is a $7\\times7$ convolution that uses the mask of type A, which prevents the network from seeing (as input) the color that it is about to predict. The two types of LSTM networks then use a variable number of recurrent layers. The input-to-state convolution in this layer uses a mask of type B, whereas the state-to-state convolution is not masked. The PixelCNN uses convolutions of size $3\\times3$ with a mask of type B. The top feature map is then passed through a couple of layers consisting of a Rectified Linear Unit (ReLU) and a $1\\times1$ convolution. For the CIFAR-10 and ImageNet experiments, these layers have 1024 feature maps; for the MNIST experiment, the layers have 32 feature maps. Residual and layer-to-output connections are used across the layers of all three networks.\n\nThe networks used in the experiments have the following hyperparameters. For MNIST we use a Diagonal BiLSTM with 7 layers and $h=16$ number of hidden units (Section \\ref{sect:residual} and Figure \\ref{fig:residual_and_masking} left). For CIFAR-10 the Row and Diagonal BiLSTMs have 12 layers and a number of $h=128$ units. The PixelCNN has 15 layers and $h=128$. For $32\\times32$ ImageNet  we adopt a 12 layer Row LSTM with $h=384$ units and for $64\\times64$ ImageNet we use a 4 layer Row LSTM with $h=512$ units; the latter model does not use residual connections. \n\n\n\n\n\\section{Experiments}\n\\label{sect:experiments}\n\nIn this section we describe our experiments and results.  We begin by describing the way we evaluate and compare our results. In Section \\ref{sect:training_details} we give details about the training. Then we give results on the relative effectiveness of architectural components and our best results on the MNIST, CIFAR-10 and ImageNet datasets.\n\n\\subsection{Evaluation}\n\nAll our models are trained and evaluated on the log-likelihood loss function coming from a discrete distribution.\nAlthough natural image data is usually modeled with \\emph{continuous} distributions using density functions, we can compare our results with previous art in the following way. In the literature it is currently best practice to add real-valued noise to the pixel values to dequantize the data when using density functions \\cite{uria2013rnade}. When uniform noise is added (with values in the interval [0, 1]), then the log-likelihoods of continuous and discrete models are directly comparable \\cite{theis2015note}. In our case, we can use the values from the discrete distribution as a piecewise-uniform continuous function that has a constant value for every interval $[i, i+1], i = 1, 2, \\dots 256$. This corresponding distribution will have the same log-likelihood (on data with added noise) as the original discrete distribution (on discrete data). \n\nFor MNIST we report the negative log-likelihood in \\emph{nats} as it is common practice in literature. For CIFAR-10 and ImageNet we report negative log-likelihoods in \\emph{bits} per dimension. The total discrete log-likelihood is normalized by the dimensionality of the images (e.g., $32\\times 32\\times 3=3072$ for CIFAR-10). These numbers are interpretable as the number of bits that a compression scheme based on this model would need to compress every RGB color value \\citep{van2014student, theis2015note}; in practice there is also a small overhead due to arithmetic coding.\n\n\n\\subsection{Training Details}\n\\label{sect:training_details}\n\nOur models are trained on GPUs using the Torch toolbox. From the different parameter update rules tried, RMSProp gives best convergence performance and is used for all experiments. The learning rate schedules were manually set for every dataset to the highest values that allowed fast convergence. The batch sizes also vary for different datasets. For smaller datasets such as MNIST and CIFAR-10 we use smaller batch sizes of 16 images as this seems to regularize the models. For ImageNet we use as large a batch size as allowed by the GPU memory; this corresponds to 64 images/batch for $32\\times32$ ImageNet, and 32 images/batch for $64\\times64$ ImageNet. Apart from scaling and centering the images at the input of the network, we don't use any other preprocessing or augmentation. For the multinomial loss function we use the raw pixel color values as categories. For all the PixelRNN models, we learn the initial recurrent state of the network.\n\n\\subsection{Discrete Softmax Distribution}\nApart from being intuitive and easy to implement, we find that using a softmax on discrete pixel values instead of a mixture density approach on continuous pixel values gives better results. For the Row LSTM model with a softmax output distribution we obtain 3.06 bits/dim on the CIFAR-10 validation set. For the same model with a Mixture of Conditional Gaussian Scale Mixtures (MCGSM) \\cite{theis2015generative} we obtain 3.22 bits/dim. \n\nIn Figure \\ref{fig:softmax_activations} we show a few softmax activations from the model. Although we don't embed prior information about the meaning or relations of the 256 color categories, e.g. that pixel values 51 and 52 are neighbors, the distributions predicted by the model are meaningful and can be multimodal, skewed, peaked or long tailed. Also note that the color values 0 and 255 often get a much higher probability as they are generally more frequent. Another advantage of the discrete distribution is that we do not worry about parts of the distribution mass lying outside the interval [0, 255], which is something that typically happens with continuous distributions.\n\n\\begin{figure}[!ht]\n  \\centering\n  \\includegraphics[width=0.4\\textwidth]{softmax.pdf}\n  \\caption{Example softmax activations from the model. The top left shows the distribution of the first pixel red value (first value to sample).}\n  \\label{fig:softmax_activations}\n\\end{figure}\n\n\\subsection{Residual Connections}\nAnother core component of the networks is residual connections. In Table \\ref{table:effect_skipconnections} we show the results of having residual connections, having standard skip connections or having both, in the 12-layer CIFAR-10 Row LSTM model. We see that using residual connections is as effective as using skip connections; using both is also effective and preserves the advantage. \n\n\\begin{table}[ht]\n\t\\begin{center}\n\t\\begin{tabular}{ccc}\n\t\t\\toprule\n\t\t & \\textbf{No skip} & \\textbf{Skip} \\\\ \n\t\t\\midrule\n\t\t\\textbf{No residual}: & 3.22 & 3.09 \\\\ \n\t    \\textbf{Residual}: & 3.07 & 3.06 \\\\ \n\t    \\bottomrule\n\t\\end{tabular}\n\t\\end{center}\n\\caption{Effect of residual and skip connections in the Row LSTM network evaluated on the Cifar-10 validation set in bits/dim.}\n\\label{table:effect_skipconnections}\n\\end{table}\n\nWhen using both the residual and skip connections, we see in Table \\ref{table:effect_of_layers} that performance of the Row LSTM improves with increased depth. This holds for up to the 12 LSTM layers that we tried.\n\n\\begin{table}[h]\n\\centering\n\t\\begin{tabular}{ccccccc}\n\t\t\\toprule\n\t\t\\textbf{\\# layers}: & 1 & 2 & 3 & 6 & 9 & 12 \\\\ \n\t    \\midrule\n\t    \\textbf{NLL}: & 3.30 & 3.20 & 3.17 & 3.09 & 3.08 & 3.06 \\\\\n\t    \\bottomrule\n\t\\end{tabular}\n\\caption{Effect of the number of layers on the negative log likelihood evaluated on the CIFAR-10 validation set and measured in bits/dim.}\n\\label{table:effect_of_layers}\n\\end{table}\n\n\\subsection{MNIST}\n\nAlthough the goal of our work was to model natural images on a large scale, we also tried our model on the binary version \\cite{salakhutdinov2008quantitative} of MNIST \\cite{lecun1998gradient} as it is a good sanity check and there is a lot of previous art on this dataset to compare with. In Table \\ref{table:mnist} we report the performance of the Diagonal BiLSTM model and that of previous published results. To our knowledge this is the best reported result on MNIST so far. \n\n\\begin{table}[h]\n\t\\begin{center}\n\t\\begin{tabular}{lcc}\n\t\t\\toprule\n\t\t\\textbf{Model} & \\textbf{NLL Test}  \\\\ \n\t\t\\midrule\n\t\tDBM 2hl [1]: & $\\approx$ 84.62 \\\\ \n\t\tDBN 2hl [2]: & $\\approx$ 84.55 \\\\ \n\t\tNADE [3]: & 88.33 \\\\ \n\t\tEoNADE 2hl (128 orderings) [3]: & 85.10 \\\\ \n\t\tEoNADE-5 2hl (128 orderings) [4]: \\quad \\quad \\quad & 84.68 \\\\ \n\t\tDLGM [5]: & $\\approx$ 86.60 \\\\ \n\t\tDLGM 8 leapfrog steps [6]: & $\\approx$ 85.51 \\\\ \n\t\tDARN 1hl [7]: & $\\approx$ 84.13 \\\\ \n\t\tMADE 2hl (32 masks) [8]: & 86.64 \\\\\n\t\tDRAW [9]: & $\\leq$ 80.97 \\\\ \n\t\t\\midrule\n\t\tDiagonal BiLSTM (1 layer, $h=32$): & \\textbf{80.75} \\\\\n\t\tDiagonal BiLSTM (7 layers, $h=16$): & \\textbf{79.20} \\\\ \n\t    \\bottomrule\n\t\\end{tabular}\n\t\\end{center}\n\\caption{Test set performance of different models on MNIST in \\emph{nats} (negative log-likelihood). Prior results taken from [1] \\cite{salakhutdinov2009deep}, [2] \\cite{murray2009evaluating}, [3] \\cite{uria2013deep}, [4] \\cite{raiko2014iterative}, [5] \\cite{rezende2014stochastic}, [6] \\cite{salimans2014markov}, [7] \\cite{gregor2013deep}, [8] \\cite{germain2015made}, [9] \\cite{gregor2015draw}.}\n\\label{table:mnist}\n\\end{table}\n\n\n\n\n\\begin{table}[h]\n\\centering\n\t\\begin{tabular}{lcc}\n\t\t\\toprule\n\t\t\\textbf{Model} & \\textbf{NLL Test (Train)}  \\\\ \n\t\t\\midrule\n\t\tUniform Distribution: & 8.00 \\\\ \n\t\tMultivariate Gaussian: & 4.70 \\\\ \n\t\tNICE [1]: & 4.48 \\\\ \n\t\tDeep Diffusion [2]: & 4.20 \\\\ \n\t\tDeep GMMs [3]: & 4.00 \\\\ \n\t\t\\midrule\n\t\tPixelCNN: & 3.14 (3.08) \\\\ \n\t\tRow LSTM: & 3.07 (3.00) \\\\ \n\t\tDiagonal BiLSTM: \\quad\\quad\\quad\\quad\\quad\\quad\\quad\\quad & \\textbf{3.00} (2.93) \\\\ \n\t    \\bottomrule\n\t\\end{tabular}\n\\caption{Test set performance of different models on CIFAR-10 in \\emph{bits/dim}. For our models we give training performance in brackets. [1] \\cite{dinh2014nice}, [2] \\cite{deepdiffusion}, [3] \\cite{van2014factoring}.}\n\\label{table:cifar10}\n\\end{table}\n\n\n\\begin{figure*}[htp]\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n  \\includegraphics[trim={0 0 199 0},clip, width=0.95\\linewidth]{cifar_samples_bilstm_nl5_nh256.png}\n\\end{subfigure}\n\\hfill\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n  \\includegraphics[trim={0 0 199 198},clip, width=0.95\\linewidth]{imnet32_samples_residual_nh384.png}\n\\end{subfigure}\n\\hfill\n\\caption{Samples from models trained on CIFAR-10 (left) and ImageNet 32x32 (right) images. In general we can see that the models capture local spatial dependencies relatively well. The ImageNet model seems to be better at capturing more global structures than the CIFAR-10 model. The ImageNet model was larger and trained on much more data, which explains the qualitative difference in samples.}\n\\label{fig:samples_32}\n\\end{figure*}\n\n\\begin{figure*}[htp]\n\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n  \\includegraphics[trim={0 196 521 0},clip, width=0.95\\textwidth]{samples_ims64_nl3_nh500.png}\n\\end{subfigure}\n\\hfill\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n  \\includegraphics[trim={0 261 1 0},clip, width=0.95\\linewidth]{ims64_multiscale.png}\n\\end{subfigure}\n\\hfill\n\\caption{Samples from models trained on ImageNet 64x64 images. Left: normal model, right: multi-scale model. We can see that the single-scale model trained 64x64 images is less able to capture global structure than the 32x32 model. The multi-scale model seems to resolve this problem. Although these models get similar performance in log-likelihood, the samples on the right do seem globally more coherent.}\n\\label{fig:samples_64}\n\\end{figure*}\n\\vspace{-0.5cm}\n\n\\begin{figure*}[htp]\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n\\hspace{0.02cm} {occluded} \\hfill completions \\hfill{original} \\,\n\n\\vspace{0.1cm}\n  \\includegraphics[width=0.96\\textwidth]{compl2.png}\n\\end{subfigure}\n\\hfill\n\\begin{subfigure}{.5\\textwidth}\n  \\centering\n\\hspace{0.02cm} {occluded} \\hfill completions \\hfill{original} \\,\n\n\\vspace{0.1cm}\n  \\includegraphics[ width=0.96\\linewidth]{compl1.png}\n\\end{subfigure}\n\\hfill\n\\caption{Image completions sampled from a model that was trained on 32x32 ImageNet images. Note that diversity of the completions is high, which can be attributed to the log-likelihood loss function used in this generative model, as it encourages models with high entropy. As these are sampled from the model, we can easily generate millions of different completions. It is also interesting to see that textures such as water, wood and shrubbery are also inputed relative well.}\n\\label{fig:completions}\n\\end{figure*}\n\n\n\n\\subsection{CIFAR-10}\n\nNext we test our models on the CIFAR-10 dataset \\cite{krizhevsky2009learning}. Table \\ref{table:cifar10} lists the results of our models and that of previously published approaches. For the proposed networks, the Diagonal BiLSTM has the best performance, followed by the Row LSTM and the PixelCNN. This coincides with the size of the respective receptive fields: the Diagonal BiLSTM has a global view, the Row LSTM has a partially occluded view and the PixelCNN sees the fewest pixels in the context. This suggests that effectively capturing a large receptive field is important. \nFigure \\ref{fig:samples_32} (left) shows CIFAR-10 samples generated from the Diagonal BiLSTM.\n\n\n\n\n\\begin{table}[h]\n\t\\begin{center}\n\t\\begin{tabular}{lcc}\n\t\t\\toprule\n\t\t\\textbf{Image size} & \\textbf{NLL Validation (Train)}  \\\\ \n\t\t\\midrule\n\t\t32x32: & 3.86 (3.83) \\\\ \n\t\t64x64: & 3.63 (3.57) \\\\ \n\t    \\bottomrule\n\t\\end{tabular}\n\t\\end{center}\n\\caption{Negative log-likelihood performance on $32\\times32$ and $64\\times64$ ImageNet in \\emph{bits/dim}.}\n\\label{table:imagenet}\n\\end{table}\n\n\n\n\\subsection{ImageNet}\n\nAlthough to our knowledge the are no published results on the ILSVRC ImageNet dataset \\cite{ILSVRC15} that we can compare our models with, we give our ImageNet log-likelihood performance in Table \\ref{table:imagenet}. On ImageNet the current PixelRNNs do not appear to overfit, as we saw that their validation performance improved with size and depth. The main constraint on model size are currently computation time and GPU memory.\n\nNote that the ImageNet models are in general less compressible than the CIFAR-10 images. ImageNet has greater variety of images, and the images were most likely resized with a different algorithm than the one we used for images. The ImageNet images are less blurry, which means neighboring pixels are less correlated to each other and thus less predictable. Because the downsampling method can influence the compression performance, we will release the used downsampled images.\n\nFigure \\ref{fig:samples_32} (right) shows $32\\times32$ samples drawn from our model trained on ImageNet. Figure \\ref{fig:samples_64} shows $64\\times64$ samples from the same model with and without multi-scale conditioning. Finally, we also show completions sampled from the model in Figure \\ref{fig:completions}.\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Conclusions}\n\nIn this paper we significantly improve and build upon deep recurrent neural networks as generative models for natural images. We have described novel two-dimensional LSTM layers: the Row LSTM and the Diagonal BiLSTM, that scale more easily to larger datasets. The models were trained to model the raw RGB pixel values of images. We treated the pixel values as discrete random variables by using a softmax layer in the conditional distributions. We employed masked convolutions to allow PixelRNNs to model full dependencies between the color channels. We proposed and evaluated architectural improvements in these models resulting in PixelRNNs with up to 12 LSTM layers.\n\nWe have shown that the PixelRNNs significantly improve the state of the art on the Binary MNIST and CIFAR-10 datasets. We also provide new benchmarks for generative image modeling on the ImageNet dataset. Based on the samples and completions drawn from the models we can conclude that the PixelRNNs are able to model both spatially local and long-range correlations and are able to produce images that are sharp and coherent.\nGiven that these models improve as we make them larger and that there is practically unlimited data available to train on, more computation and larger models are likely to further improve the results.\n\n\\section*{Acknowledgements}\n\nThe authors would like to thank Shakir Mohamed and Guillaume Desjardins for helpful input on this paper and Lucas Theis, Alex Graves, Karen Simonyan, Lasse Espeholt, Danilo Rezende, Karol Gregor and Ivo Danihelka for insightful discussions.\n\n\n\\bibliography{pixelRNN}\n\\bibliographystyle{icml2016}\n\n\n\n", "itemtype": "equation", "pos": 13944, "prevtext": " \nEach of the colors is thus conditioned on the other channels as well as on all the previously generated pixels.\n\n\\subsection{Pixels as Discrete Variables}\n\nPrevious approaches use a continuous distribution for the values of the pixels in the image (e.g. \\citet{uria2013deep,theis2015generative}). By contrast we model $p({\\mathbf}{x})$ as a discrete distribution, with every conditional distribution in Equation \\ref{eq:color_conditioning} being a multinomial that is modeled with a softmax layer. Each channel variable $x_{i,*}$ simply takes one of 256 distinct values. The discrete distribution is representationally simple and has the advantage of being arbitrarily multimodal without prior on the shape. Experimentally we also find the discrete distribution to be easy to learn and to produce better performance compared to a continuous distribution (Section \\ref{sect:experiments}).\n\n\\begin{figure}\n\n\\centering\n\\includegraphics[width=0.48\\textwidth]{receptivefields6.pdf}\n\\caption{Left: To generate pixel $x_i$ one conditions on all the previously generated pixels left and above of $x_i$. Center: Illustration of a Row LSTM with a kernel of size 3. The dependency field of the Row LSTM does not reach pixels further away on the sides of the image. Right: Illustration of the two directions of the Diagonal BiLSTM. The dependency field of the Diagonal BiLSTM covers the entire available context in the image.}\n\\label{depen}\n\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Pixel Recurrent Neural Networks}\n\\label{sect:pixelrnn}\n\nIn this section we describe the architectural components that compose the {PixelRNN}. In Sections \\ref{sect:row_lstm} and \\ref{sect:diag_lstm}, we describe the two types of LSTM layers that use convolutions to compute at once the states along one of the spatial dimensions. \nIn Section \\ref{sect:residual} we describe how to incorporate \\emph{residual} connections to improve the training of a PixelRNN with many LSTM layers.  In Section \\ref{sect:masked} we describe the softmax layer that computes the {discrete} joint distribution of the colors and the masking technique that ensures the proper conditioning scheme. In Section \\ref{sect:pixelcnn} we describe the PixelCNN architecture. Finally in Section \\ref{sect:multiscale} we describe the multi-scale architecture.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.46\\textwidth]{skewing3.pdf}\n\\caption{In the Diagonal BiLSTM, to allow for parallelization along the diagonals, the input map is skewed by offseting each row by one position with respect to the previous row. When the spatial layer is computed left to right and column by column, the output map is shifted back into the original size. The convolution uses a kernel of size $2 \\times 1$. }\n\\label{fig:bilstm}\n\\end{figure}\n\n\\subsection{Row LSTM}\n\\label{sect:row_lstm}\n\nThe Row LSTM is a unidirectional layer that processes the image row by row from top to bottom computing features for a whole row at once; the computation is performed with a one-dimensional convolution. For a pixel $x_i$ the layer captures a roughly triangular context above the pixel as shown in Figure \\ref{depen} (center). The kernel of the one-dimensional convolution has size $k \\times 1$ where $k \\geq 3$; the larger the value of $k$ the broader the context that is captured. The weight sharing in the convolution ensures translation invariance of the computed features along each row.\n\nThe computation proceeds as follows. An LSTM layer has an {input-to-state} component and a recurrent {state-to-state} component that together determine the four gates inside the LSTM core. To enhance parallelization in the Row LSTM the input-to-state component is first computed for the entire two-dimensional input map; for this a $k \\times 1$ convolution is used to follow the row-wise orientation of the LSTM itself. The convolution is \\emph{masked} to include only the valid context (see Section \\ref{sect:masked}) and produces a tensor of size $4h \\times n \\times n$, representing the four gate vectors for each position in the input map, where $h$ is the number of features in the  LSTM layer.\n\n To compute one step of the state-to-state component of the LSTM layer, one is given the previous hidden and cell states ${\\mathbf}{h}_{i-1}$ and ${\\mathbf}{c}_{i-1}$, each of size $h \\times n \\times 1$. The new hidden and cell states ${\\mathbf}{h}_i$, ${\\mathbf}{c}_i$ are obtained as follows:\n\n \n", "index": 5, "text": "\\begin{equation}\n \\begin{split}\n [{\\mathbf}{o}_i, {\\mathbf}{f}_i, {\\mathbf}{i}_i, {\\mathbf}{g}_i ] & = \\sigma ({\\mathbf}{K}^{ss} \\circledast {\\mathbf}{h}_{i-1} + {\\mathbf}{K}^{is} \\circledast {\\mathbf}{x}_{i}) \\\\\n{\\mathbf}{c}_i & = {\\mathbf}{f}_i \\odot {\\mathbf}{c}_{i-1} + {\\mathbf}{i}_i \\odot {\\mathbf}{g}_i \\\\\n{\\mathbf}{h}_i & = {\\mathbf}{o}_i \\odot \\tanh({\\mathbf}{c}_i)\\\\\n\\end{split}\n\\label{eq:lstm}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle[{\\mathbf{}}{o}_{i},{\\mathbf{}}{f}_{i},{\\mathbf{}}{i%&#10;}_{i},{\\mathbf{}}{g}_{i}]&amp;\\displaystyle=\\sigma({\\mathbf{}}{K}^{ss}\\circledast{%&#10;\\mathbf{}}{h}_{i-1}+{\\mathbf{}}{K}^{is}\\circledast{\\mathbf{}}{x}_{i})\\\\&#10;\\displaystyle{\\mathbf{}}{c}_{i}&amp;\\displaystyle={\\mathbf{}}{f}_{i}\\odot{\\mathbf{%&#10;}}{c}_{i-1}+{\\mathbf{}}{i}_{i}\\odot{\\mathbf{}}{g}_{i}\\\\&#10;\\displaystyle{\\mathbf{}}{h}_{i}&amp;\\displaystyle={\\mathbf{}}{o}_{i}\\odot\\tanh({%&#10;\\mathbf{}}{c}_{i})\\\\&#10;\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mo stretchy=\"false\">[</mo><msub><mi>o</mi><mi>i</mi></msub><mo>,</mo><msub><mi>f</mi><mi>i</mi></msub><mo>,</mo><msub><mi>i</mi><mi>i</mi></msub><mo>,</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">]</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>K</mi><mrow><mi>s</mi><mo>⁢</mo><mi>s</mi></mrow></msup><mo>⊛</mo><msub><mi>h</mi><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>K</mi><mrow><mi>i</mi><mo>⁢</mo><mi>s</mi></mrow></msup><mo>⊛</mo><msub><mi>x</mi><mi>i</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><msub><mi>c</mi><mi>i</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>⊙</mo><msub><mi>c</mi><mrow><mi>i</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow><mo>+</mo><mrow><msub><mi>i</mi><mi>i</mi></msub><mo>⊙</mo><msub><mi>g</mi><mi>i</mi></msub></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><msub><mi>h</mi><mi>i</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><msub><mi>o</mi><mi>i</mi></msub><mo>⊙</mo><mrow><mi>tanh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>c</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}]