[{"file": "1601.07772.tex", "nexttext": "\nIf this function is $\\geq 0$ then it quantifies the ``quantumness'' of any given state by measuring the total amount of ``negativity\" in the Wigner function. \nHere $V_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}$ is a normalisation constant that ensures $\\int_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}  \\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace  \\ud{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace} = 1 $.\nFor $\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})$ we find that this provides a form of entanglement measure which, although ordered differently, is equivalent to the von Neumann entropy formalism for pure states (mixed states have been analysed and will be the topic of a future paper).\nWe can take this approach further by observing that any Wigner function is mathematically equivalent to a scalar potential field~\\cite{KF-Flow} so that we can derive from it a vector field that we term the ``Wigner flow'' according to $\\vec{\\mathcal{W}}_{{\\hat{\\rho}}}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})=-\\nabla_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}\\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace$.\nThe resultant vector field of the Wigner function lays out the tangent space and shows the ``flow'' of the Wigner function.\nThis allows us to explore areas such as a Helmholtz decomposition that should allow us to study a field-equation formalism of entanglement that may connect to incompressibility and Lyapunov-like exponents; for example visualizing islands of stable entanglement in collections of noisy quantum spin systems.\nIt also leads us to to propose another entanglement measure \n\n", "itemtype": "equation", "pos": 24997, "prevtext": "\n\n\n\n\\title{A General Framework for Wigner Function Generation and Entanglement Measures}\n\\author{Todd Tilma}\\email{tilma.t.aa@m.titech.ac.jp}\n\\affiliation{Tokyo Institute of Technology, 2-12-1 Ookayama, Meguro-ku, Tokyo 152-8550, Japan}\n\\author{M.J. Everitt}\\email{m.j.everitt@physics.org}\n\\affiliation{{Quantum Systems Engineering Research Group, Department of Physics, Loughborough University, Leicestershire LE11 3TU, United Kingdom}}\n\\author{J.H. Samson}\n\\affiliation{{Quantum Systems Engineering Research Group, Department of Physics, Loughborough University, Leicestershire LE11 3TU, United Kingdom}}\n\\author{William J. Munro}\n\\affiliation{NTT Basic Research Labs, NTT Corporation, 3-1 Morinosato-Wakamiya, Atsugi, Kanagawa 243-0198, Japan}\n\\author{Kae Nemoto}\\email{nemoto@nii.ac.jp}\n\\affiliation{National Institute of Informatics, 2-1-2 Hitotsubashi, Chiyoda-ku, Tokyo 101-8430, Japan}\n\\date{\\today}\n\n\\begin{abstract}\nThe possibility of constructing a complete, continuous Wigner function for any quantum system has been a subject of investigation for over 50 years. \nA key system that has served to illustrate the difficulties of this problem has been an ensemble of spins. \nWhile numerous attempts have come close to generating a complete Wigner phase-space description, each has either being artificial in its construction or fallen short of realising this ambition. \nHere we present  a natural method of constructing Wigner functions that can be used to fully describe any quantum object or systems of systems. \nWe see no reason why our approach should be limited to non-relativistic quantum mechanics; it may even lead to phase-space methods for more exotic frameworks such as string theory. \nIn addition we show that the natural visual representation of the quantum state by the Wigner function leads to multiple and intuitive entanglement measures.\n\\end{abstract}\n\n\\pacs{02.20.-a,02.20.Sv,03.65.Fd,03.65.Ud,03.65.Aa}\n\\keywords{characteristic functions, entanglement, group parametrizations}\n\n\\maketitle\n\n\n\n\n\nOut of all available choices, one can argue that the Wigner function presents the most natural phase-space representation of quantum mechanics.\n The main advantage being that it simultaneously retains the intuitiveness with respect to classical phase-space whilst rendering clearly quantum information - leading to the now iconic Wigner function for macroscopically distinct superposition of states (Schr\\\"odinger cat states)~\\cite{Deleglise:2008gt}. \nIn this regard the Wigner function possesses a unique advantage over other representations (such as the $P$~\\cite{PhysRevLett.10.277,PhysRev.131.2766} and $Q$~\\cite{Husimi1940} functions). \nEven though all are quasi-probability distribution functions, the Wigner function's marginals are easily linked to amplitudes of a given representation, and its equations of motion are closely and intuitively relatable to the classical ones for the same system~\\cite{Wigner1984}.\nThese properties are further augmented by a transparent connection to the quantum-classical transition where solutions to the classical Liouville equation can be recovered as the action becomes large with respect to a Plank cell (see, e.g.,~\\cite{PhysRevLett.80.4361}). \nIndeed, it is possible to reformulate much of quantum mechanics in phase-space (a nice historical overview can be found in~\\cite{Curtright:2012ka}). \nFeynman's path integrals and the Wigner/Weyl/Groenewold/Moyal phase-space approach share a similar ambition; to have a formulation of quantum mechanics with a clear and intuitive link to classical physics. \nThey also have a number of features in common where, e.g., they both are underpinned by a statistical ensemble view (in the Feynman picture we sum over paths and Wigner functions are analogous to classical probability density functions), it is even possible to link the two~\\cite{Samson:2003ij}. \n\nSo, if this representation is so good - why has it not become much more popular (as the Feynman path integral did). \nOne possible reason is that the Wigner function is not directly comparable to a classical probability density function as it can take on negative values. \nHowever, this negativity is associated with quantumness and vanishes in the classical limit. \nGiven that physicists have historically been able to overcome such ontological difficulties when a model has shown to add value, we do not see this as an obstacle to moving to a phase-space formulation of quantum mechanics (for an extended discussion see, e.g.,~\\cite{extended_probabilities}).  \nOf much greater importance is the fact that finding a Wigner function for finite dimensional systems (and systems of these systems) has proved challenging. \nWigner functions that are themselves discrete can be developed with nice properties~\\cite{Wootters19871,PhysRevA.70.062101}, but they lack the intuitiveness of their continuous variable counterparts. \nThere has also been some progress with regards to the development of continuous Wigner-like functions for finite dimensional systems - especially with regards to ensembles of spins~\\cite{Agarwal1981,Shibata1976,PhysRevA.59.971,Braunstein-1004.5425,Klimov-1008.2920,Wolf6247,Luis-052112,Luis-495302,Klimov055303,TilmaKae1,PhysRevA.86.062117}. \nHowever, each has come with their own limitations; the most important of these being that the Wigner function must be a complete representation of any quantum state (e.g., one should be able to reconstruct the state vector/density operator from the Wigner function itself, at least up to an arbitrary total phase). \nPrevious work produced Wigner functions that either failed to be complete; were artificial in their construction; or did not address experimentally realisable systems. \nBased on the normal Wigner function for continuous variable systems we propose an alternative method for computing Wigner functions that addresses this issue - providing a pathway to the formulation of intuitively analogous, easy to calculate, complete Wigner functions for quantum systems that are currently of importance to both quantum information and atomic/molecular/optical physics.\n\nThe standard textbook form of  the Wigner function describing how to transform a Hilbert space operator $\\OpA$ to a classical phase-space function $\\mathrm{A}(\\mathbf{q},\\mathbf{p})$~\\cite{Weyl1927,Moyal1949,Ozizmir1967,Leaf1968-1,Leaf1968-2}, is\n\\bel{Weyl-Wigner-ND1}\n\\mathrm{A}(\\mathbf{q},\\mathbf{p}) = \\int_{-\\boldsymbol{\\infty}}^{+\\boldsymbol{\\infty}} \\ud \\mathbf{z} \\, \\bra{\\mathbf{q}+\\frac{\\mathbf{z}}{2}} \\hat{A} \\ket{\\mathbf{q}-\\frac{\\mathbf{z}}{2}} \\, e^{i \\mathbf{p} \\cdot \\mathbf{z}/\\hbar}, \n\\ee where $\\mathbf{q}=[q_1,q_2,\\ldots,q_N]$ and $\\mathbf{p}=[p_1,p_2,\\ldots,p_N]$ are $N$-dimensional vectors representing classical phase-space position and momentum values, $\\mathbf{z}=[z_1,z_2,\\ldots,z_N]$, and $\\hbar$ is Planck's constant. \nIt is well known that this can be also written in terms of the displacement ($\\OpD$) and parity (${\\ensuremath{\\hat \\Pi}\\xspace}$) operators  according to:\n\\bel{WignerStart}\n\\mathrm{A}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})=2 \\Trace{ \\hat{A} \\, \\OpD({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}) {\\ensuremath{\\hat \\Pi}\\xspace} \\OpD^\\dag({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}) }\n\\ee\nwhere ${\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}$ is any full parametrisation of the phase-space.\nIn this situation, the displacement operator is often parametrised in terms of position and momentum coordinates or eigenvalues of the annihilation operators (coherent states).\nFurthermore, this Wigner function is nothing more than the expectation value of the displaced parity operator. \nThe question then, is, especially for composite quantum systems, \\emph{can this displaced parity operators approach be generalised to other, especially spin, systems?}\nThe starting point, which shares the same form as~\\Eq{WignerStart}, is to observe that any phase-space distribution for $\\OpA$ is a characteristic function $\\ensuremath{\\mathrm{W}_{{\\OpA}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace$ given in terms of a \n``characteristing'' operator $\\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace$ parametrized in terms of a set of phase-space coordinates ${\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}$ and $\\OpA$ for the system according to the generalized Weyl rule that maps operators to functions according to \n\\bel{WignerBaseDef}\n\\ensuremath{\\mathrm{W}_{{\\OpA}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace=\\Trace{\\OpA \\, \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace}.\n\\ee\nSuch a distribution function is said to have a Stratonovich-Weyl correspondence~\\cite{Stratonovich56} with the operator if it satisfies certain properties (note that the special case $\\OpA={\\hat{\\rho}}$ yields a distribution function for the state of the quantum system). Setting ${\\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}({{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}})}\\xspace}=2\\OpD({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}) {\\ensuremath{\\hat \\Pi}\\xspace} \\OpD({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})$ yields the usual Wigner function in position and momentum space.\n\nBased on work by Moyal \\textit{et.\\ al.\\ }\\cite{Moyal1949,Wigner1984,Varilly:1989gs}, C. Brif and A. Mann~\\cite{PhysRevA.59.971} used this approach to propose  a general method to generate phase-space distributions and the concomitant calculus needed to formulate quantum mechanics of which Wigner functions arise as a special case of more general characteristic functions. \nResults from~\\cite{Wigner1984} (especially section 4.4) and ~\\cite{PhysRevA.59.971,OCONNELL1981121} can then be brought to bear in order to formulate specific Wigner functions. \nThis approach has been most successfully applied in~\\cite{Klimov-1008.2920} but the construction of the Wigner function for a system of spins required a somewhat artificial mapping to a multipole expansion.\n\nHow do we improve on this? As with past works, to generate a Wigner function, $\\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace$ must be that operator which satisfies the Stratonovich-Weyl correspondence and that is self conjugate. \nWhile this statement is true it does not capture the essence of~\\Eq{WignerStart} where the Wigner function of a quantum state is also (twice) the expectation value of the displaced parity operator. \nNow, the parity operator can be thought of as one that produces a $\\pi$ rotation in phase-space. \nIn this way {\\ensuremath{\\hat \\Pi}\\xspace} has analogous properties to $\\hat{\\sigma}_z$ for a two-level quantum system in the Pauli representation where it acts as a $\\pi$ rotation about the $z$-axis of the Bloch sphere.\nIn this way, the rotation operator, $\\OpU_2^\\Half(\\theta,\\phi,\\Phi)=e^{\\ui \\hat{\\sigma}_z \\phi}e^{\\ui \\hat{\\sigma}_y \\theta}e^{\\ui \\hat{\\sigma}_z \\Phi}$, can also be thought of as being analogous to the displacement operator. \nSo, in order to obtain a Wigner function for a two-level atom/qubit/spin we are motivated to think of replacing the displaced parity operator with the rotated $\\sigma_z$ operator and impose the self conjugate Stratonovich-Weyl correspondence.\n\nThis argument leads to the following expression\n\\bel{eq:WF1s}\n{\\ensuremath{\\hat{\\Delta}}\\xspace} _2^\\Half(\\theta,\\phi)=\\Half \\left[\\Id -\\sqrt{3}\\left(\\OpU_2^\\Half \\hat{\\sigma}_z\\OpU_2^\\Half\\right) \\right]\n\\ee\nwhere the Euler angles $(\\theta,\\phi)$ are being used to parametrise phase-space.  \nThe difference in form to~\\Eq{WignerStart} is needed to ensure that~\\Eq{eq:WF1s} produces a Wigner function with the correct properties under the Stratonovich-Weyl correspondence in phase-space. \n\nWe can use~\\Eq{eq:WF1s} as a starting point for constructing \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace for more complex spin systems and ensembles of spins. \nCrucially, we need to observe that a set of $D$ general spin systems live in a Hilbert space of the form $\\bigotimes_1^D \\SU{2}$ that is a subspace of $\\SU{{\\ensuremath{\\mathfrak{D}}\\xspace}}$ where {\\ensuremath{\\mathfrak{D}}\\xspace} is the total dimension of the system. \nFrom this, the key to formulating an appropriate kernel is observing that  the operator that plays the same role as the parity operator needs to belong the Hilbert space of the total system, which is $\\SU{{\\ensuremath{\\mathfrak{D}}\\xspace}}$. \nThis ``parity'' operator is the last of the generalised Gell-Mann matrices, $\\hat{\\Lambda}_i$,  which, as $\\hat{\\sigma}_z$ is $\\hat{\\Lambda}_{3}$ in  $\\SU{2}$, is a natural extension of the case considered in~\\Eq{eq:WF1s}. \nThis observation leads us to propose that spin Wigner functions can be generated using kernels of the form:\n\\bel{eq:WFNs}\n\\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace=\\frac{1}{{\\ensuremath{\\mathfrak{D}}\\xspace}} \\left[\\Id_{{\\ensuremath{\\mathfrak{D}}\\xspace}} -\\mathcal{N}\\left(\\hat{\\mathbb{U}}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}) \\hat{\\Lambda}_{{\\ensuremath{\\mathfrak{D}}\\xspace}^2-1}\\hat{\\mathbb{U}}^\\dag({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}) \\right) \\right]\n\\ee\nwhere $\\hat{\\mathbb{U}}$ is some appropriate rotation operator, or product of operators, closed under {\\ensuremath{\\boldsymbol{\\Omega}}\\xspace} (while we focus on continuous {\\ensuremath{\\boldsymbol{\\Omega}}\\xspace} our definiton could work in the discrete case too); $\\mathcal{N}$ is a normalisation factor depending on $\\hat{\\mathbb{U}}$; and $\\hat{\\Lambda}_{{\\ensuremath{\\mathfrak{D}}\\xspace}^2-1}$ is a diagonal matrix where every non-zero element is $\\sqrt{\\frac{2}{{\\ensuremath{\\mathfrak{D}}\\xspace}({\\ensuremath{\\mathfrak{D}}\\xspace}-1)}}$ except $(\\hat{\\Lambda}_{{\\ensuremath{\\mathfrak{D}}\\xspace}^2-1})_{{\\ensuremath{\\mathfrak{D}}\\xspace} {\\ensuremath{\\mathfrak{D}}\\xspace}}=-\\sqrt{\\frac{2({\\ensuremath{\\mathfrak{D}}\\xspace}-1)}{{\\ensuremath{\\mathfrak{D}}\\xspace}}}$~\\cite{Tilma2}.  \nThe question we now address is how to choose $\\hat{\\mathbb{U}}$ so as to satisfy the self conjugate Stratonovich-Weyl correspondence. Our tests to date lead us to believe that this is a general expression that works for any combination of spins which means that we have a pathway to generating Wigner functions for fermions, bosons, any other finite dimensional system and arbitrary combinations of each. \n\nFrom this one framework, there are a number of different possible ``true'' Wigner functions we can now develop to address different situations and needs. \nWe now introduce the ones that we have explored so far. \nThe first example is a spin-$j$ representation of \\SU{2}. \nHere $\\hat{\\mathbb{U}}=\\OpU^{j}_{2}=e^{\\ui \\OpJ_3 \\phi}e^{\\ui \\OpJ_2 \\theta}e^{\\ui \\OpJ_3 \\Phi}$ where $\\OpJ_i$ are the usual angular momentum operators for a space of dimension ${\\ensuremath{\\mathfrak{D}}\\xspace}=2j+1$ (where $j$ is $0,1/2,1,3/2,\\ldots$). In this case \n\\bel{highj}\n\\hat{\\Delta}_2^j(\\theta,\\phi)=\\frac{1}{2j+1}\n\\left[\n\t\\Id_{2j+1} +\n\t\\mathcal{N}\n\t\\OpU^{j}_{2}\n\t\\hat{\\Lambda}_{(2j+1)^2-1}\n\t(\\OpU^{j}_{2})^\\dag\n\\right]\n\\ee \nwhere $\\mathcal{N}=\\sqrt{{(2j+2)(2j+1)(2j)}/{2}}$ and we note that $\\Phi$ makes no contribution. \n\\begin{figure}[!t]\n    \\subfloat[$\\ket{\\frac{1}{2}}+\\ket{-\\frac{1}{2}}$]    \n        {\\includegraphics[width=0.3\\linewidth]\n        {figure1a.pdf}}\n        \\hfill\n    \\subfloat[\\mbox{$\\ket{\\frac{3}{2}}+\n        \\ket{-\\frac{3}{2}}$}]\n        {\\includegraphics[width=0.3\\linewidth]\n        {figure1b.png}}\n        \\hfill\n    \\subfloat[$\\ket{\\frac{7}{2}}+\\ket{-\\frac{7}{2}}$]\n        {\\includegraphics[width=0.3\\linewidth]\n        {figure1c.png}}\n    \\\\\n    \\subfloat[$\\ket{\\frac{1}{2}}+\\ket{-\\frac{1}{2}}$]\n        {\\includegraphics[width=0.3\\linewidth]    \n        {figure1d.png}}\n    ~\n    \\subfloat[Bell, \\ket{\\Phi^+}]    \n        {\\includegraphics[width=0.3\\linewidth]\n        {figure1e.png}}\n    ~\n    \\subfloat[GHZ state]    \n        {\\includegraphics[width=0.3\\linewidth]\n        {figure1f.png}}\n\\caption{\n    \\textbf{(a-c)} Polar plot of the Wigner function using  $\\hat{\\Delta}_2^j(\\theta,\\phi)$, \n    as defined in~\\Eq{highj} for high spin spaces of \n    dimension  $1/2$ (a),  3/2 (b) and  7/2 (c). Here we \n    have used as examples normalised states of the \n    form $\\ket{j, m=j}+\\ket{j,m=-j}$ (where we have \n    labeled states in terms of the quantum numbers for \n    $\\OpJ^2$ and $\\OpJ_z$). Note that there are $2j$ \n    interference terms and that images are not to the \n    same scale \n    \n    \\textbf{(d-f)} Mercator projection of the Wigner function using $\\Hat{\\Delta}_{2\\otimes}^\n    \\Half(\\{\\theta_i,\\phi_i\\})$, as defined in~\\Eq{susu}, \n    for a set of  1 (d),  2 (e) and  3 (f) spins/two-level-\n    atoms/spins where we have taken the slice $\n    \\theta_i=\\theta$ (as the ordinate from $0$ to $\\pi/2$) and $\\phi_i=\\phi$ \n    (as the abscissa for $0$ to $\\pi$). Using (e) as an example we note \n    that Wigner functions of all bell states are rotations \n    of the Wigner function for \\ket{\\Phi^+} in $\n    (\\theta_1,\\phi_1,\\theta_2,\\phi_2)$ space. However\n    the Wigner function for \\ket{\\Psi^\\pm} is $\\frac{1}{4}\\left(1-\\sqrt{5}\\left[\\cos 2\\theta_1 \\cos 2\\theta_2 \\mp \\cos 2(\\phi_1-\\phi_2) \\sin 2\\theta_1 \\sin 2\\theta_2\\right] \\right)$\n    the singlet state \\ket{\\Psi^-} is constant over the $\n    (\\theta=\\theta_i,\\phi=\\phi_i)$ slice (which is \n    expected due to the symmetry of the singlet \n    state). The Wigner function for \\ket{\\Psi^-} can be obtained from that of \\ket{\\Psi^+}, or \\emph{vice versa}, by mapping $\\theta_1\\rightarrow -\\theta_1$ or $\\theta_2\\rightarrow -\\theta_2$. Hence, visualisation of states that have this \n    symmetry would need to use different slices. For \n    all plots, blue is positive and red negative and black is the zero contour. \n\\label{fig:egs}}\n\\end{figure}\nIn~\\Fig{fig:egs} (a-c) we present plots of these Wigner functions applied to three example superposition states that are spin cat states. \nWe could follow previous work, such as~\\cite{PhysRevA.49.4101,PhysRevA.86.062117,Klimov-1008.2920}, and map spin coherent states onto this space so as to visualise such systems of two-level atoms (but without the need for a multipole expansion). \nWhile there is a lot of work using such mappings the Wigner functions can be hard to interpret as a high-spin space does not directly reflect the tensor product structure of a number, $D$, of two level atoms/qubits/spins. \nInstead, we introduce a different  kernel that does recognise this structure by using a different rotation operator $\\hat{\\mathbb{U}}=\\bigotimes_i^D \\hat{U}^{\\Half}_2(\\theta_i,\\phi_i,\\Phi_i)_i=\\bigotimes_i^D e^{\\ui \\hat{\\sigma}_z^{(i)} \\phi_i}e^{\\ui \\hat{\\sigma}_y^{{(i)}} \\theta_i}e^{\\ui \\hat{\\sigma}_z^{(i)} \\Phi_i}$ which is the tensor product of the rotation operator for each spin-$\\Half$ system (note that if we used $\\hat{S}_i$ instead of $\\hat{\\sigma}_i$ this would also produce an interesting Wigner function and the difference between the two will be expanded upon in a future publication).\n\\ba\n\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})&=&\\frac{1}{2^D}\n\\Bigg[\n\t\\Id_{2^D} + \\label{susu} \\\\ \\nonumber &&\n\t\\mathcal{N}\n\t\\left\\{\\bigotimes_i^D (\\OpU^{\\Half}_2)_i\\right\\}\n\t\\hat{\\Lambda}_{2^{2D}-1}\n\t\\left\\{\\bigotimes_i^D (\\OpU^{\\Half}_2)_i^\\dag\\right\\}\n\t\\Bigg]\n\\ea \nwhere $\\mathcal{N}=\\sqrt{{(2^D+1)(2^D)(2^D-1)}/{2}}$ and we note again that the $\\Phi_i$'s make no contribution. \nAs the dimension of this Wigner function scales with the number of qubits/atoms/spins it becomes harder to visualise. \nHowever, the slice that sets all $\\theta_i=\\theta_j$ and $\\phi_i=\\phi_j$ for all $i,j$ has good analogy with the $Q$ function.\nIn~\\Fig{fig:egs} (d-f) we show the this slice for all $i,j$ for a selection of states that are usually mapped onto the respective spin states shown in ~\\Fig{fig:egs} (a-c). \nIt may also be of interest to note that we obtain analytic expressions for all of the Wigner functions plotted here which allows for deeper insights than the graphics alone provide. This, together with the better reflection of the underlying structure of the quantum system, yields a Wigner function that has utility beyond visualisation of quantum states and we will return to discuss this shortly. \n\nIt is intersting to note that if we write $\\OpA = \\OpV \\OpA_0 \\OpV^\\dag$ where $\\OpV$ is some unitary operator then, in general,\n\\bel{easy}\n\\ensuremath{\\mathrm{W}_{{\\OpA}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace=\\Trace{ \\OpV \\OpA_0 \\OpV^\\dag \\, \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace}=\\Trace{  \\OpA_0\\, \\tilde{\\Delta}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})},\n\\ee\nwhere we have a new, \"rotated\" kernel $\\tilde{\\Delta}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})=\\OpV^\\dag  \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace \\OpV$.\nThen, if, for example $\\OpA={\\hat{\\rho}}$ and $\\OpV$ was the evolution operator, or a set of quantum gate operations, this expression can lead  an efficient way to compute the Wigner function for a dynamical process or an algorithm as $\\OpV^\\dag  \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace \\OpV$ (a similar process could be used visualise gate operations and algorithms themselves in phase-space). \n\\begin{figure}[!tb]\n\\includegraphics[keepaspectratio=true,width=0.45\\linewidth]{figure2a.png}\n\\hfill\n{\n\\setlength{\\fboxsep}{0pt}\n\\setlength{\\fboxrule}{1pt}\n\\fcolorbox{gray}{white}{\\includegraphics[keepaspectratio=true,width=0.45\\linewidth]{figure2b.png}}\n}\n\\caption{Comparison of the Wigner and $Q$ functions for states generated by one axis squeezing of a set of two-level systems. \n\nThe initial state is $\\ket{+_6}:=\\bigotimes_{i=1}^6 \n\\ket{j=\\Half,m=\\Half}_i+\\ket{j=\\Half,m=-\\Half}_i$ \n\nand the Hamiltonian is $\\OpH=\\left(\\bigoplus_i \\hat{\\sigma}_z\\right)^2$. \nWe calculate the Wigner function using~\\Eq{easy} using $\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})$, $\\OpA=\\OP{+_6}{+_6}$ and $\\OpV=\\exp(-\\ui\\OpH t)$ where $t=\\pi/125$. $Q$ is calculated in the usual way using the natural $\\theta$, $\\phi$ parametrisation of spin coherent states (see~\\cite{Nemoto2000} for details). \n\nAs in~\\Fig{fig:egs} (d-f), we have taken the slice $\\theta_i=\\theta$ (as the ordinate) and $\\phi_i=\\phi$ (as the abscissa).\n\nIn both figures we clearly see squeezing but in the Wigner function we also see negative volume visualising quantum correlations. \nNote, unlike in~\\Fig{fig:egs} (d-f), here $\\phi$ ranges from $-\\pi/2$ to $\\pi/2$.\n\n\\label{Fig:sq}}\n\\end{figure} \nAs an example of the utility of this approach is shown in~\\Fig{Fig:sq} where we have applied this approach to a set of spins using $\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})$ for a toy model of one-axis twisting. \n\nBefore proceeding, we note that there is a further useful Wigner function example obtained by setting $\\hat{\\mathbb{U}}=\\OpU_N^\\Half$ the rotation operator for $\\SU{N}$ (as defined in~\\cite{Tilma2}). \nThis results in the kernel \n\\be\n\\Hat{\\Delta}_N^\\Half(\\{\\theta_i,\\phi_i\\})=\\frac{1}{N}\n\\left[\n\t\\Id_{N} +\n\t\\mathcal{N}\n\t\\OpU_N^\\Half\n\t\\hat{\\Lambda}_{N^{2}-1}\n\t(\\OpU_N^\\Half)^\\dag\n\\right]\n\\ee\nthat is needed to generate a Wigner function for a general $N$-level quantum system or qudit, where $\\mathcal{N}=\\sqrt{{(N+1)(N)(N-1)}/{2}}$.  This function is identical that defined in~\\cite{TilmaKae1}  but without explicit reference to coherent states. \nIn this case there are $N(N-1)/2$ pairs of coordinates $\\{\\theta_i,\\phi_i\\}$ corresponding to every pure state being a coherent state. \nWe note that this means that the graphical representation of pure states is not so interesting but instead we could consider the dynamic of a set of $D$ qubits/atoms/spins represented by this function. \nIn this way we see that their dynamics can be mapped onto the dynamics of a coherent state in $\\SU{N=2^D}$ which is a form of holographic principle that reminds us of conformal field theories. \nWe would also like to point out, while it is beyond the scope of this paper, there will be many other useful Wigner functions based on~\\Eq{eq:WFNs}, for example, if we use: $\\hat{\\mathbb{U}}=\\hat{U}^{j=0}_2(\\theta_s,\\phi_s,\\Phi_s) \\otimes \\hat{U}^{j=1/2}_2(\\theta_p,\\phi_p,\\Phi_p)\\otimes\\hat{U}^{j=1}_2(\\theta_d,\\phi_d,\\Phi_d)\\otimes \\ldots$ the resulting Wigner function might find great utility in atomic physics as it is a decomposition that naturally reflects atomic orbital structure.\n\nReturning to our main discussion of $\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})$, as with all Wigner functions, quantum correlations within the quantum state lead to interference fringes with negative values. \nFollowing~\\cite{Kenfack2004,Dahl2006} we can calculate the amount of these negative components of the Wigner function by evaluating\n\n", "index": 1, "text": "\\begin{equation}\n\\label{Neg-Vol}\n\\mathrm{V}_{\\hat{\\rho}} = \n\\frac{1}{V_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}}\n\\int_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}} \n\\left(\n    \\ensuremath{\\left\\vert{\\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace}\\right\\vert}\\xspace -\\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace  \n\\right)\n\\ud{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{V}_{\\hat{\\rho}}=\\frac{1}{V_{{\\boldsymbol{\\Omega}}}}\\int_{{\\boldsymbol{%&#10;\\Omega}}}\\left(\\left|{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\boldsymbol{\\Omega}}%&#10;\\right)}\\right|-\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\boldsymbol{\\Omega}}\\right)%&#10;\\right)\\ud{\\boldsymbol{\\Omega}},\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">V</mi><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></msub><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>V</mi><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></msub></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></msub><mrow><mrow><mo>(</mo><mrow><mrow><mo>|</mo><mrow><msub><mi mathvariant=\"normal\">W</mi><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>)</mo></mrow></mrow><mo>|</mo></mrow><mo>-</mo><mrow><msub><mi mathvariant=\"normal\">W</mi><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\ud</mtext></merror><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07772.tex", "nexttext": "\nwhich we have termed Enffusion because of the connection to the diffusion of the vector field.\nIn~\\Fig{radar} we show a radar plot that compares our two measures with current standards for four qubits~\\cite{PhysRevA.65.052112} and we see that each state describes a unique path in this plot. \nComparing entanglement measures in this way may help characterise entanglement within systems of qubits, spins, or two-level atoms.\n\n\\begin{figure}[!tb]\n\\resizebox{\\linewidth}{!}{\n\\begin{tikzpicture}[label distance=.15cm,rotate=194]\n\\newdimen\\L \n\\L=10cm\n \\tkzKiviatDiagram[\n        radial=5,\n        radial  style/.style ={-},\n        lattice style/.style ={blue!0},\n        scale=1.5,\n        label style/.style={font=\\LARGE}        \n ]\n        {\n            {Negative Volume, $\\mathrm{V}_{\\hat{\\rho}}$ \n            of~\\Eq{Neg-Vol}}\n            ,\n            Two-Tangle\n            ,\n            Three-Tangle\n            ,\n            {Enffusion, $\\mathrm{Enff}({\\hat{\\rho}})$ \n            of~\\Eq{enff}}\n            ,\n            Entropy of Entanglement\n        }\n\\tkzKiviatLine[thick,color=blue,mark=square,\n                mark size=3pt\n               ](0.714235\\L,0.25\\L,0.25\\L,0.90458\\L,0.811278\\L) \n \\tkzKiviatLine[thick,color=red,mark=*,\n                ball color=red,mark size=2pt\n                ](0.579086\\L,0\\L,1\\L,0.848265\\L,1\\L) \n         \\tkzKiviatLine[thick,color=ForestGreen,mark=pentagon,ball color=YellowOrange,\n                mark size=6pt\n                ](0.672142,0.333333\\L,0\\L,1\\L,1\\L) \n          \\tkzKiviatLine[thick,color=Magenta,mark=triangle,ball color=magenta,\n                mark size=5pt\n               ](0.672142\\L, 0.333333\\L, 1\\L, 1\\L, 1\\L) \n\\end{tikzpicture}}\n\\caption{Radar plot comparing standard and new entanglement measures arising from the spin Wigner function for the following states: W (blue square), GHZ (red dot - note zero two-tangle), C4a (green pentagon - note zero entropy of entanglement) and C4b (magenta triangle) of four qubits/spins/two-level atoms. \nWe observe that the \\emph{Normalized Negative Volume} is unique in so far as it is the only measure to be able to distinguish the entanglement of all states. \nPlease see~\\cite{PhysRevA.65.052112} for definitions.}\n\\label{radar}\n\\end{figure} \n\nWe note that our presentation of the Wigner function will find utility representing any finite dimensional system within phase-space.\nEarly studies indicate that our approach is equally applicable to the generation of other phase-space distributions, such as the $Q$ function, and that the connections between them will be greatly elucidated by this approach. \nFurthermore, as construction of the kernel \\ensuremath{{\\ensuremath{\\hat{\\Delta}}\\xspace}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace recognises both the algebra and and ``parity'' of the underlying group structure believe we have a method to generate the Wigner functions needed to describe any system.  \nFor example, this formalism should help generate usable Wigner functions for high-spin $\\SU{N}$ systems important in quantum gravity and other extensions to quantum mechanics.\nLastly, we see no reason why we could not extend our results further still and develop phase-space methods for more exotic frameworks such as string theory.\n\nWe would like to thank Shane Dooley, Emi Yukawa and Michael Hanks for interesting and informative discussions. We also note that TT and MJE contributed equally to this work.\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{apsrev4-1}\n\\bibliography{refs}  \n\n\n", "itemtype": "equation", "pos": 27205, "prevtext": "\nIf this function is $\\geq 0$ then it quantifies the ``quantumness'' of any given state by measuring the total amount of ``negativity\" in the Wigner function. \nHere $V_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}$ is a normalisation constant that ensures $\\int_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}  \\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace  \\ud{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace} = 1 $.\nFor $\\Hat{\\Delta}_{2\\otimes}^\\Half(\\{\\theta_i,\\phi_i\\})$ we find that this provides a form of entanglement measure which, although ordered differently, is equivalent to the von Neumann entropy formalism for pure states (mixed states have been analysed and will be the topic of a future paper).\nWe can take this approach further by observing that any Wigner function is mathematically equivalent to a scalar potential field~\\cite{KF-Flow} so that we can derive from it a vector field that we term the ``Wigner flow'' according to $\\vec{\\mathcal{W}}_{{\\hat{\\rho}}}({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace})=-\\nabla_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}\\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace$.\nThe resultant vector field of the Wigner function lays out the tangent space and shows the ``flow'' of the Wigner function.\nThis allows us to explore areas such as a Helmholtz decomposition that should allow us to study a field-equation formalism of entanglement that may connect to incompressibility and Lyapunov-like exponents; for example visualizing islands of stable entanglement in collections of noisy quantum spin systems.\nIt also leads us to to propose another entanglement measure \n\n", "index": 3, "text": "\\begin{equation}\n\\label{enff}\n\\mathrm{Enff}({\\hat{\\rho}}) = \\frac{1}{ V_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}}} \\int_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}} \n\\ensuremath{\\left\\vert{\\nabla^2_{{\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}} \\ensuremath{\\mathrm{W}_{{{\\hat{\\rho}}}}\\left({\\ensuremath{\\boldsymbol{\\Omega}}\\xspace}\\right)}\\xspace}\\right\\vert}\\xspace   \\ud\\Omega,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{Enff}({\\hat{\\rho}})=\\frac{1}{V_{{\\boldsymbol{\\Omega}}}}\\int_{{%&#10;\\boldsymbol{\\Omega}}}\\left|{\\nabla^{2}_{{\\boldsymbol{\\Omega}}}\\mathrm{W}_{{{%&#10;\\hat{\\rho}}}}\\left({\\boldsymbol{\\Omega}}\\right)}\\right|\\ud\\Omega,\" display=\"block\"><mrow><mrow><mrow><mi>Enff</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>V</mi><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></msub></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></msub><mrow><mrow><mo>|</mo><mrow><mrow><msubsup><mo>∇</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mn>2</mn></msubsup><mo>⁡</mo><msub><mi mathvariant=\"normal\">W</mi><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">^</mo></mover></msub></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\boldsymbol</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>)</mo></mrow></mrow><mo>|</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\ud</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]