[{"file": "1601.03668.tex", "nexttext": "\nOnce $(r_{\\parallel},r_p)$ are defined for each galaxy pair we can proceed to calculate the two-dimensional correlation function, $\\xi(r_{\\parallel},r_p)$ in an analogous way to $\\xi(r)$ \\citep{2002sgd..book.....M}. \nWith this method, for every galaxy pair we define a plane passing through the observer and containing the vectors $\\mathbf{s_1}$ and $\\mathbf{s_2}$. \nTherefore, we only need to assume isotropy in the plane perpendicular to the line of sight. \n\nTo estimate the projected correlation function we need a random Poisson catalogue with the same selection function as our data. \nWe create this auxiliary catalogue in each case using the software \\textsc{Mangle} \\citep{ham04a,swa08a} to apply the angular selection mask defined in \\citetalias{2014MNRAS.441.1783A}.\nIn addition, the random points are distributed so that they follow the redshift distribution of each of the galaxy samples used (see Section \\ref{sec:seg}).\nWe estimate the two-dimensional two-point correlation function as \\citep{1993ApJ...412...64L}\n\n", "itemtype": "equation", "pos": 25681, "prevtext": "\n\n\\title{The ALHAMBRA survey: evolution of galaxy spectral segregation}\n\n\\author{\nLl.~Hurtado-Gil\\altaffilmark{1,2},\nP.~Arnalte-Mur\\altaffilmark{1},\nV.~J.~Mart\\'inez\\altaffilmark{1,3,4},\nA.~Fern\\'andez-Soto\\altaffilmark{2,4},\nM.~Stefanon\\altaffilmark{5},\nB.~Ascaso\\altaffilmark{6,21},  \nC.~L\\'opez-Sanju\\'an\\altaffilmark{8}, \nI.~M\\'arquez\\altaffilmark{7},\nM.~Povi\\'c\\altaffilmark{7},\nK.~Viironen\\altaffilmark{8},\nJ.~A.~L.~Aguerri\\altaffilmark{9,10},\nE.~Alfaro\\altaffilmark{7},\nT.~Aparicio-Villegas\\altaffilmark{11,7}\nN.~Ben\\'itez\\altaffilmark{7},           \nT.~Broadhurst\\altaffilmark{12,13}, \nJ.~Cabrera-Ca\\~no\\altaffilmark{14},\nF.~J.~Castander\\altaffilmark{15},\nJ.~Cepa\\altaffilmark{9,10},\nM.~Cervi\\~no\\altaffilmark{7,9,10},         \nD.~Crist\\'obal-Hornillos\\altaffilmark{8}, \nR.~M.~Gonz\\'alez~Delgado\\altaffilmark{7},\nC.~Husillos\\altaffilmark{7},\nL.~Infante\\altaffilmark{16},          \nJ.~Masegosa\\altaffilmark{7},  \nM.~Moles\\altaffilmark{8,7},\nA.~Molino\\altaffilmark{17,7},\nA.~del~Olmo\\altaffilmark{7},\nS.~Paredes\\altaffilmark{18},\nJ.~Perea\\altaffilmark{7},              \nF.~Prada\\altaffilmark{7,19,20},\n\\and J.~M.~Quintana\\altaffilmark{7}\n}\n\n\\begin{abstract}\n{\\small\nWe study the clustering of galaxies as a function of spectral type and redshift in the range $0.35 < z < 1.1$ using data from the Advanced Large Homogeneous Area Medium Band Redshift Astronomical (ALHAMBRA) survey. The data cover 2.381  deg$^2$ in 7 fields, after applying a detailed angular selection mask, with accurate photometric redshifts [$\\sigma_z < 0.014(1+z)$] down to $I_{AB} < 24$. From this catalog we draw five fixed number density, redshift-limited bins. We estimate the clustering evolution for two different spectral populations selected using the ALHAMBRA-based photometric templates: quiescent and star-forming galaxies. For each sample, we measure the real-space clustering using the projected correlation function. Our calculations are performed over the range $[0.03,10.0] h^{-1}$ Mpc, allowing us to find a steeper trend for $r_p \\lesssim 0.2 h^{-1}$ Mpc, which is especially clear for star-forming galaxies. Our analysis also shows a clear early differentiation in the clustering properties of both populations: star-forming galaxies show weaker clustering with evolution in the correlation length over the analysed redshift range, while quiescent galaxies show stronger clustering already at high redshifts, and no appreciable evolution. We also perform the bias calculation where similar segregation is found, but now it is among the quiescent galaxies where a growing evolution with redshift is clearer.\nThese findings clearly corroborate the well known colour-density relation, confirming that quiescent galaxies are mainly located in dark matter halos that are more massive than those typically populated by star-forming galaxies.}\n\\end{abstract}\n\n\n\\section{Introduction}\n\\label{sec:intro} \n\nIt has been well established that different types of galaxies cluster in  different ways \\citep{1988ApJ...331L..59H,1988ApJ...333L...9D, 1989ApJ...339L...9D, 1991MNRAS.252..261E,1995ApJ...442..457L,1997ApJ...489...37G,2006MNRAS.368...21L,2010A&A...513A..22M, 2006A&A...457..145P}. \nElliptical galaxies are preferentially located at the cores of rich galaxy clusters, i.e, in high density environments, while spiral galaxies are the dominant population in the field \\citep{1976ApJ...208...13D,1980ApJ...236..351D, 1986ApJ...300...77G, 2006A&A...458...39C}.\nThis phenomenon, called galaxy segregation, has been confirmed in the largest galaxy redshift surveys available up to date, the 2dF Galaxy redshift survey \\citep[2dFGRS,][]{2003MNRAS.344..847M}, the Sloan Digital Sky Survey \\citep[SDSS,][]{2006MNRAS.372.1749A,2011ApJ...736...59Z} and the Baryonic Oscillation Spectroscopic Survey \\citep[BOSS,][]{2013ApJ...767..122G}. The dependence of clustering on different galaxy properties such as stellar mass, concentration index, or the strength of the 4000 \\AA -break has been studied by \\cite{2006MNRAS.368...21L}.  \n\nSince segregation is a consequence of the process of structure formation in the universe, it is therefore very important to understand its evolution with redshift or cosmic time. \nSeveral works have extended the analysis of segregation by colour or spectral type to redshifts  in the range $z \\sim 0.3 - 1.2$ using recent spectroscopic surveys such as the VIMOS-VLT Deep Survey \\citep[VVDS,][]{Meneux2006a}, the Deep Extragalactic Evolutionary Probe 2 survey \\citep[DEEP2,][]{coi08a}, or the PRIsm Multi-object Survey \\citep[PRIMUS,][]{Skibba2013c}. \\Citet{tor09a}, instead, used the zCOSMOS survey to study segregation by morphological type at $z \\sim 0.8$.\nAll these studies show that segregation by colour or spectral type was already present at $z \\sim 1$. \nIn particular,  \\citet{Meneux2006a}, using a sample of 6,500 VVDS galaxies covering half a square degree, have unambiguously established that early-type galaxies are more strongly clustered than late-type galaxies at least since redshift $z\\sim 1.2$. The correlation length obtained by these authors for late-type galaxies is $r_0 \\sim 2.5 h^{-1}$ Mpc at $z \\sim 0.8$ and roughly twice this value for early-type galaxies. They have also calculated the relative bias between the two types of galaxies obtaining an approximately constant value $b_{\\rm rel} \\sim 1.3-1.6$ for $0.2 \\le z \\le 1.2$ depending on the sample. This value is slightly larger than the one obtained by \\citet{2003MNRAS.344..847M} $b_{\\rm rel} \\sim 1.45 \\pm 0.14$ for the 2dF Galaxy Redshift Survey with median redshift $z=0.1$. The results obtained by \\citet{coi08a} for DEEP2 reinforced those outlined above, although the measured correlation lengths for DEEP2 galaxies are systematically slightly larger than the values reported for the VVDS sample by \\citet{Meneux2006a}. In addition, \\citet{coi08a} have detected a significant rise of the correlation function at small scales $r_p \\le 0.2 h^{-1}$ Mpc for their brighter samples.\nFor the zCOSMOS-Bright redshift survey, \\citet{tor09a} found also that early-type galaxies exhibit stronger clustering than late-type galaxies on scales from $0.1$ to \n$10 h^{-1}$ Mpc already at $z \\simeq 0.8$, and the relative difference increases with cosmic time on small scales, but does not significantly evolve from $z=0.8$ to $z=0$ on large scales. A similar result is reported by \\citet{Skibba2013c}. These authors show that the clustering amplitude for the PRIMUS sample increases with color, with redder galaxies displaying stronger clustering at scales \n$r_p \\leq 1 h^{-1}$ Mpc. They have also detected a color dependence within the red sequence, with the reddest galaxies being more strongly correlated than their less red counterparts. This effect is absent in the blue cloud.\n\nSeveral broad-band photometric surveys have extended these studies to even larger redshift \\citep[e.g.][]{har10a, McCracken2015c}. \\citeauthor{har10a}, using data from the UKIDSS Ultra Deep Survey, find segregation between passive and star-forming galaxies at $z \\lesssim 1.5$, but find consistent clustering properties for both galaxy types at $z \\sim 2$.\n\nIn the present paper we use the high-quality data of the Advanced Large Homogeneous Area Medium-Band Redshift Astronomical survey (ALHAMBRA) \\citep{mol08a, 2013arXiv1306.4968M}\\footnote{http://alhambrasurvey.com} to study the clustering segregation of quiescent and star-forming galaxies. ALHAMBRA is very well suited for the analysis of galaxy clustering and segregation studies at very small scales. With a reliable calculation of the projected correlation function we find a clear steepening of the correlation at scales between $0.03$ to $0.2 h^{-1}$ Mpc \\citep{2006A&A...457..145P, coi08a}, specially for the star-forming galaxies. Moreover, its continuous selection function over a large redshift range makes ALHAMBRA an ideal survey for evolution studies. In \\cite{2014MNRAS.441.1783A} (hereafter \\citetalias{2014MNRAS.441.1783A}) the authors presented the results of the evolution of galaxy clustering on scales $r_p < 10 h^{-1}$ Mpc for samples selected in luminosity and redshift over $\\sim 5$ Gyr by means of the projected correlation function $w_p(r_p)$. \nIn this paper we use the same statistic to study the evolution of galaxy segregation by spectral type at $0.35 < z < 1.1$.\n \n \nDetails on the samples used in this analysis are described in Section~\\ref{sec:seg}.\nIn Section~\\ref{sec:methods}, we introduce the statistic used in our analysis, the projected correlation function, and the methods to obtain reliable estimates of this quantity and to model the results. Finally, in Section~\\ref{sec:res}, we present our results, and in Section~\\ref{sec:con} the conclusions. \nThroughout the paper we use a fiducial flat $\\Lambda CDM$ cosmological model with parameters $\\Omega_M = 0.27$, $\\Omega_{\\Lambda} = 0.73$, $\\Omega_b = 0.0458$ and $\\sigma_8 = 0.816$ based on the 7-year \\textit{Wilkinson Microwave Anisotropy Probe (WMAP)} results \\citep{2011ApJS..192...18K}. \nAll the distances used are comoving, and are expressed in terms of the Hubble parameter $h \\equiv H_0/100 \\rm{\\ km} \\rm{\\ s}^{-1} \\rm{\\ Mpc}^{-1}$. Absolute magnitudes are given as $M - 5 \\log_{10}(h)$. \n\n\n\n\\section{ALHAMBRA galaxy samples}\n\\label{sec:seg} \n\nThe Advanced Large Homogeneous Area Medium-Band Redshift Astronomical\nsurvey (ALHAMBRA) \\citep{mol08a, 2013arXiv1306.4968M} is a project\nthat has imaged seven different areas in the sky through a\npurposedly-built set of 20 contiguous, non-overlapping, 310 \\AA-wide\nfilters covering the whole visible range from 3500 to 9700 \\AA, plus\nthe standard near-infrared $JHK_s$ filters. The nominal depth (5$\\sigma$, $3''$ aperture) is $I_{AB} \\sim 24.5$ and the total sky coverage after masking is 2.381\ndeg$^2$. The final catalogue, described in \\cite{2013arXiv1306.4968M}, includes over 400,000 galaxies, with a photometric redshift accuracy better than $\\sigma_z / (1+z) =\n0.014$. Full details on how the accuracy depends on the sample magnitude, \ngalaxy type, and bayesian odds selection limits are given in that work. For the characteristics \nof the sample that we use in this paper the authors quote a dispersion $\\sigma_{\\rm NMAD} <\n0.014$ and a catastrophic rate $\\eta_1 = 0.04$\\% \\footnote{Where $\\sigma_{\\rm NMAD}$ is the normalized median absolute deviation, and $\\eta_2$ is defined as the proportion of objects with absolute \ndeviation $|\\delta z| / (1+z) > 0.2$.}. There is no evidence of \nsignificantly different behaviour for galaxies with spectral energy distributions \ncorresponding to quiescent or star-forming types. Contamination by AGNs is minor \n(approximately 0.1\\% of the sources could correspond to this class, which has not been \npurged from the ALHAMBRA catalogues) and should be \ndominated by low-luminosity AGN, which are in many cases fit by strong emission-line galaxies \nwith an approximately correct redshift.\n\nObject detection is performed over a synthetic image, created\nvia a combination of ALHAMBRA filters, that mimics the Hubble Space\nTelescope F814W filter (hereafter denoted by $I$) so that the\nreference magnitude is directly comparable to other\nsurveys. Photometric redshifts were obtained using the\ntemplate-fitting code BPZ \\citep{2000ApJ...536..571B}, with an\nupdated set of 11 Spectral Energy Distribution (SED) templates, as\ndescribed in \\cite{2013arXiv1306.4968M}. Although a full posterior\nprobability distribution function in redshift $z$ and spectral type\n$T$ is produced for each object, in this work we take a simpler\napproach and assign to each galaxy the redshift $z_b$ and type $T_b$\ncorresponding to the best fit to its observed photometry. We have checked that the errors induced by the redshift uncertainties, which\nare partly absorbed by the deprojection technique, are under control\nas long as we use relatively bright galaxies with good quality\nphotometric redshift determinations. This makes ALHAMBRA a very well suited catalogue: together with the high resolution photometric redshifts, the abundant imaging allows us both a reliable color segregation, used in this work, and a high completeness in the galaxy population at small scale separations, which will be the specific object of a future work. \n\nWe have drawn different samples from the ALHAMBRA survey to perform our analysis in a similar way as was done in \\citetalias{2014MNRAS.441.1783A}. \nFirst, we cut the magnitude range at $I < 24$, where the catalogue is photometrically complete \\citep{2013arXiv1306.4968M} and we do not expect any significant field-to-field variation in depth. \nSecond, stars are eliminated using the star-galaxy separation method described in \\cite{2013arXiv1306.4968M}.\nAs explained in \\citetalias{2014MNRAS.441.1783A}, the expected contamination by stars in the resulting samples is less than 1~per cent.\nFinally, we cleanse the catalogue using the angular masks defined in \\citetalias{2014MNRAS.441.1783A}, which eliminate regions with less reliable photometry around bright stars or image defects, or very close to the image borders.\nThe sample selected in this way contains 174633 galaxies over an area of $2.381 \\deg^2$, {\\it i.e.}, with an approximate source density of $7.3 \\times 10^4$ galaxies per square degree.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.25\\textheight]{magnitude}\\\\ \n\\end{center}\n\\caption{\\label{redmag}Selected samples with fixed number density in the photometric redshift vs. absolute $B$-band magnitude diagram. The quiescent and star-forming galaxy samples are plotted in red and blue color, respectively. The solid lines mark the boundaries of our selected samples described in Table~\\ref{population}.}\n\\end{figure}\n\nGiven the ALHAMBRA depth, we divide our sample in 5 non-overlapping redshift bins.  These redshift bins are $[0.35,0.5[$, $[0.5,0.65[$, $[0.65,0.8[$, $[0.8,0.95[$, and $[0.95,1.1]$ \\footnote{Note that the redshift bins used here are different to those in \\citetalias{2014MNRAS.441.1783A}, where overlapping bins were allowed.}. \nAs in this work we focus on the galaxy spatial segregation by spectral type we use a luminosity selection to obtain a fixed number density. In this way we guarantee that we are comparing similar populations at different redshifts. \nIn order to select a sample that is complete up to $z = 1.1$ we define a threshold magnitude of $M_B^{th}(0) - 5\\log(h) = -19.36$ for the highest redshift bin. This limit determines the galaxy number density ($\\bar{n} = 9.35 \\times 10^{-3} \\, h^{3}$ Mpc$^{-3})$ that we will keep constant for the remaining redshift bins. This way, our results do not rely on measurements of the luminosity function. This will allow us to study the evolution with redshift of the galaxy spectral segregation. Figure ~\\ref{redmag} shows the luminosity and redshift selections used in this work. We should remark on the non-monotonic evolution of the faint limit of our samples with redshift. This effect is not unexpected, as a combination of cosmic variance in the large-scale structure and the artificial redshift peaks that are induced by the photometric redshift methods produce density changes that are observable at the scales we are using. In any case the effect is very small, representing a variation of only 0.1 magnitudes per bin over a monotonic evolution.\n\nWe classify our galaxies as `quiescent' and `star-forming' according to the best-fitting template, $Tb$, obtained from the BPZ analysis.\nTemplates 1 to 5 correspond to quiescent galaxies, 6 and 7 correspond to star-forming galaxies, and 8 to 11 correspond to starburst galaxies. We consider as quiescent galaxies those with a template value smaller than 5.5, and star-forming those with a value bigger than 5.5. Therefore, we include in the star-forming category also those galaxies classified as starbursts. Note that in the fitting process interpolation between templates is performed. \n\nIn a previous work \\cite{2013MNRAS.435.3444P}  built a morphological catalogue of 22,051 galaxies in ALHAMBRA. We cannot, however, use this catalogue as the basis for our analysis as it includes only a small subset of the galaxies in our sample: in its cleanest version it is limited to $AB(\\rm{F613W})<22$ and redshift $z < 0.5$ for ellipticals. A cross-check showed that, if we identify quiescent galaxies as early-type and star-forming galaxies as late-type, our SED-based classification agrees with the morphological one for over 65\\% of the sample. Taking into account that the nominal accuracy of the morphological catalogue is 90\\%, that we are actually using only the objects close to its detection limit and that, as noted in \\cite{2013MNRAS.435.3444P}, the relationship between morphological- and colour-based classifications is far from being as direct as could na\\\"ively be expected, we consider that these figures prove that the classification is accurate within the expected limits.\n\n\\begin{deluxetable*}{lcc|cccc|cccc|c}\n\\tablewidth{0pt}\n\\tablecaption{\\label{population}\nCharacteristics of the galaxy samples used \n}\n\\tablehead{\n\\colhead{}       & \\colhead{}          & \\colhead{}                   & \\multicolumn{4}{c}{Quiescent galaxies}                                                                      & \\multicolumn{4}{c}{Star-forming galaxies} & \\colhead{}\\\\\n\\colhead{Sample} & \\colhead{$z$ range} & \\colhead{$V (h^{-3} Mpc^3)$}  & \\colhead{$N_{\\rm Q}$} & \\colhead{$\\bar{n} (h^{3} Mpc^{-3})$} & \\colhead{$M_{B}^{\\rm med}$} & \\colhead{$\\bar{z}$}    & \\colhead{$N_{\\rm Sf}$} & \\colhead{$\\bar{n} (h^{3} Mpc^{-3})$} & \\colhead{$M_{B}^{\\rm med}$} & \\colhead{$\\bar{z}$} & \\colhead{$\\frac{N_{\\rm Q}}{N_{\\rm Q}+N_{\\rm Sf}}$}\n}\n\\startdata\nz0.43 & $0.35 - 0.5$ & $3.48 \\times 10^{5}$ & 1650 & $ 4.74 \\times 10^{-3}$ & -20.53 & 0.43 & 1605 & $ 4.61 \\times 10^{-3}$ & -20.26 & 0.43 & 0.51\\\\\nz0.57 & $0.5 - 0.65$  & $5.42 \\times 10^{5}$ & 1818 & $ 3.35 \\times 10^{-3}$ & -20.77 & 0.58 & 3258 & $ 6.01 \\times 10^{-3}$ & -20.35 & 0.57 & 0.36\\\\\nz0.73 & $0.65 - 0.8$  & $7.33 \\times 10^{5}$ & 2291 & $ 3.12 \\times 10^{-3}$ & -20.87 & 0.73 & 4570 & $ 6.23 \\times 10^{-3}$ & -20.56 & 0.73 & 0.33\\\\\nz0.88 & $0.8 - 0.95$  & $9.09 \\times 10^{5}$ & 2509 & $ 2.75 \\times 10^{-3}$ & -21.06 & 0.87 & 6002 & $ 6.6 \\times 10^{-3}$ & -20.82 & 0.88 & 0.29\\\\\nz1.00 & $0.95 - 1.1$  & $1.06 \\times 10^{6}$ & 2182 & $ 2.05 \\times 10^{-3}$ & -20.91 & 1.02 & 7768 & $ 7.30 \\times 10^{-3}$ & -20.74 & 1.03 & 0.22\\\\\n\\enddata\n\\tablecomments{$V$ is the volume covered by ALHAMBRA in each redshift bin. For each of the samples selected by spectral type we show the number of galaxies $N$, the mean number density $\\bar{n}$, the median $B$-band absolute magnitude $M_B^{\\rm med}$ and the mean redshift $\\bar{z}$. The last column gives the fraction of early-type galaxies in the bin. NW ALH-4 frame is not included.}\n\\end{deluxetable*}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.35\\textheight]{color_mag.pdf}\\\\ \n\\end{center}\n\\caption{\\label{color}\nAbsolute rest-frame broad-band colour-magnitude diagram for galaxies\nwith redshifts between 0.35 and 0.75. Quiescent and star-forming galaxies\n(selected by their best-fit spectral type) are shown, respectively, as\nred and blue percentile contours. We have used SDSS absolute magnitudes derived from\nthe ALHAMBRA photometry as described in the text. Our classification\nby (photometric) spectral type closely matches the usual broad-band\ncolour selection.}\n\\end{figure}\n\n\nIn Fig.~\\ref{color} we show how our classification of quiescent and\nstar-forming galaxies performs on a colour-luminosity diagram. We plot\n$M_r$ and $M_u$, which correspond to the absolute magnitudes in the\nSDSS rest-frame broad-band filters $r$ and $u$, and were estimated\nfrom ALHAMBRA data by \\cite{2011Stefanon} for galaxies with redshift\n$0.35 < z < 0.75$ and good quality photometric redshifts. We see how\nwell the ALHAMBRA spectral-type classification reproduces the expected\nbehaviour \\citep{2004ApJ...608..752B}: quiescent galaxies correspond\nto the `red sequence' in the diagram, while star-forming galaxies form\nthe `blue cloud'.  In addition to the clear segregation in colour, we\nsee that quiescent galaxies show, on average, slightly brighter\nluminosities than star-forming ones. This shows that our selection by\n(photometric) spectral type is almost equivalent to a selection in\nbroad-band colour.\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[height=0.47\\textheight]{field2_z07_projection_mag_new_zbin.pdf}\\\\\n\\includegraphics[height=0.47\\textheight]{field4_z07_projection_mag_new_zbin.pdf}\\\\\n\\caption{\\label{fields}Projection onto the sky of the z0.73 sample ($0.65 < z < 0.8$) for two ALHAMBRA fields: ALH-2 (top) and ALH-4/COSMOS (bottom). Galaxies have been coloured according to their type: blue circles correspond to star-forming and red circles to quiescent galaxies, and the size of each circle is proportional to the luminosity of the corresponding galaxy. North is to the top and East is to the left. The diagram shows the geometry of the ALHAMBRA fields, with the angular mask described in the text displayed as a light-grey background. The scale of 10 $h^{-1}$ Mpc at $z=0.7$ is indicated as a vertical bar. A heavy concentration of red circles (quiescent galaxies), corresponding to the big coherent structure described in the text, is patent in the NW quadrant of the ALH-4/COSMOS field.}\n\\end{center}\n\\end{figure*}\n\n\n\nIn Fig.~\\ref{fields} we show the projection of two fields, ALH-2 and ALH-4/COSMOS, onto the plane of the sky. The coherent superstructure in the ALH-4/COSMOS field at $0.6 < z < 0.8$ is well appreciated. The skeleton of the structures, that form the cosmic web, is perfectly delineated by the red quiescent galaxies, while blue star-forming ones tend to populate the field or lower density regions. A similar trend was also visible in the redshift versus right ascension diagram of \\citet{2013Msngr.151...41G}. We will further study this colour-density relation \\citep{2006A&A...458...39C} in the following sections by means of the projected correlation function.\n\nFinally, we remove the North-West ALH-4 frame from the analysis (the top-right section on the bottom panel of Fig.~\\ref{fields}). As seen in \\citetalias{2014MNRAS.441.1783A}, there exists an anomalous clustering in the ALH-4 field, which overlaps with the Cosmic Evolution Survey \\citep[COSMOS,][]{Scoville2007h}.\nIt is well known that the COSMOS survey presents higher clustering amplitude than similar surveys \\citep[see, e.g.,][]{McCracken2007a,tor10a}, due to the presence of large overdense structures in the field \\citep{Guzzo2007a,Scoville2007d}.\nThis overdensity of structures is also observed in ALHAMBRA when comparing this peculiar region of the ALH-4 field with the rest of the fields \\citep{2013arXiv1306.4968M,Ascaso2015a}. In \\citetalias{2014MNRAS.441.1783A} the authors showed that ALH-4/COSMOS is an outlier in terms of clustering. We have seen that not only does this region introduce anomalies in the measurement of the clustering statistics, but it also affects the error estimation of these statistics.\nIn \\citetalias{2014MNRAS.441.1783A} the authors also identified ALH-7/ELAIS-N1 as an outlier field (although the significance of the anomaly was smaller in this case).\nHowever, here we do not find any significant change in our results when removing the ALH-7/ELAIS-N1 field, so we keep it in for all our calculations.\n\n\n\nFor each redshift bin we will analyse the clustering for the full \nselected population and separately for quiescent and star-forming galaxies.  Table~\\ref{population} summarises the different samples\nin each redshift bin.  Columns $N_{\\rm Q}$ and $N_{\\rm Sf}$ are the\nnumber of quiescent and star-forming galaxies respectively, and the last\ncolumn is the fraction of quiescent galaxies in each of the redshift\nsubsamples.\n\n\nWe see that the fraction of quiescent galaxies decreases with\nredshift. This behaviour is expected qualitatively, as blue\nstar-forming galaxies are dominant at earlier cosmic times, while red\nquiescent galaxies appear late, once star formation\nstops. This trend was also observed in a similar redshift range by\ne.g. \\cite{2009A&A...508.1217Z} for the zCOSMOS 10k bright sample. They found that\nthe population of bright late-type galaxies becomes dominant at higher redshifts, and therefore the fraction of early-type galaxies decreases with redshift accordingly.\n\n\n\n\\section{Methods}\n\\label{sec:methods}\n\nThe method used for the correlation analysis of our data follows closely the one used in \\citetalias{2014MNRAS.441.1783A}, where it is discussed in detail.\nWe present here a summary of the methods and some points where the details differ. \nWe estimate the correlation function using the estimator proposed by \\cite{1993ApJ...412...64L} and the projected correlation function to recover real-space clustering from our photometric redshift catalogues as described by \\cite{1983ApJ...267..465D} and \\cite{2009MNRAS.394.1631A}. \nWe use the delete-one jackknife method for the error estimation and linear regression to fit the different model correlation functions to our data.\n\n\\subsection{Estimation of the projected correlation function}\n\\label{sec:estimation-wp}\n\nThe method introduced by \\citeauthor{1983ApJ...267..465D} is based on the decomposition of pair separations in distances parallel and perpendicular to the line-of-sight, $(r_{\\parallel},r_p)$.  \nGiven two galaxies, if we define their radial vectors to the observer as $\\mathbf{s_1}$ and $\\mathbf{s_2}$, then their separation vector is $\\mathbf{s} \\equiv \\mathbf{s_1} - \\mathbf{s_2}$ and the line-of-sight vector is $\\mathbf{l} \\equiv \\mathbf{s_1} + \\mathbf{s_2}$. \nFrom these, we can now calculate the transverse and radial distances as\n\n", "index": 1, "text": "\\begin{equation}\\label{distv}\nr_{\\parallel} \\equiv \\frac{|\\mathbf{s} \\cdot \\mathbf{l}|}{|\\mathbf{l}|}, r_{p} \\equiv \\sqrt{\\mathbf{s} \\cdot \\mathbf{s} - r_{\\parallel}^2} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"r_{\\parallel}\\equiv\\frac{|\\mathbf{s}\\cdot\\mathbf{l}|}{|\\mathbf{l}|},r_{p}%&#10;\\equiv\\sqrt{\\mathbf{s}\\cdot\\mathbf{s}-r_{\\parallel}^{2}}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>r</mi><mo>∥</mo></msub><mo>≡</mo><mfrac><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝐬</mi><mo>⋅</mo><mi>𝐥</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mrow><mo stretchy=\"false\">|</mo><mi>𝐥</mi><mo stretchy=\"false\">|</mo></mrow></mfrac></mrow><mo>,</mo><mrow><msub><mi>r</mi><mi>p</mi></msub><mo>≡</mo><mpadded width=\"+1.7pt\"><msqrt><mrow><mrow><mi>𝐬</mi><mo>⋅</mo><mi>𝐬</mi></mrow><mo>-</mo><msubsup><mi>r</mi><mo>∥</mo><mn>2</mn></msubsup></mrow></msqrt></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nwhere $DD(r_{\\parallel},r_p)$, $DR(r_{\\parallel},r_p)$ and $RR(r_{\\parallel},r_p)$ correspond to pairs of points with transverse separations in the interval $[r_p, r_p + \\mathrm{d}r_p]$ and radial separations in the interval $[r_\\parallel, r_\\parallel + \\mathrm{d}r_\\parallel]$. $DD$ counts pairs of points in the data catalogue, $RR$ counts pairs in the random Poisson catalogue, and $DR$ counts crossed pairs between a point in the data catalogue and a point in the Poisson catalogue. \n$N_D$ is the number of points in the data catalogue, and $N_R$ ($= 20 N_D$) is the number of points used in our random Poisson catalogue.\n\nWe can define the projected correlation function as\n\n", "itemtype": "equation", "pos": 26897, "prevtext": "\nOnce $(r_{\\parallel},r_p)$ are defined for each galaxy pair we can proceed to calculate the two-dimensional correlation function, $\\xi(r_{\\parallel},r_p)$ in an analogous way to $\\xi(r)$ \\citep{2002sgd..book.....M}. \nWith this method, for every galaxy pair we define a plane passing through the observer and containing the vectors $\\mathbf{s_1}$ and $\\mathbf{s_2}$. \nTherefore, we only need to assume isotropy in the plane perpendicular to the line of sight. \n\nTo estimate the projected correlation function we need a random Poisson catalogue with the same selection function as our data. \nWe create this auxiliary catalogue in each case using the software \\textsc{Mangle} \\citep{ham04a,swa08a} to apply the angular selection mask defined in \\citetalias{2014MNRAS.441.1783A}.\nIn addition, the random points are distributed so that they follow the redshift distribution of each of the galaxy samples used (see Section \\ref{sec:seg}).\nWe estimate the two-dimensional two-point correlation function as \\citep{1993ApJ...412...64L}\n\n", "index": 3, "text": "\\begin{equation}\\label{LS}\n\\hat{\\xi}(r_{\\parallel},r_p) = 1 + {\\left(\\frac{N_R}{N_D}\\right)}^2\\frac{DD(r_{\\parallel},r_p)}{RR(r_{\\parallel},r_p)} - 2\\frac{N_R}{N_D}\\frac{DR(r_{\\parallel},r_p)}{RR(r_{\\parallel},r_p)} \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\xi}(r_{\\parallel},r_{p})=1+{\\left(\\frac{N_{R}}{N_{D}}\\right)}^{2}\\frac{%&#10;DD(r_{\\parallel},r_{p})}{RR(r_{\\parallel},r_{p})}-2\\frac{N_{R}}{N_{D}}\\frac{DR%&#10;(r_{\\parallel},r_{p})}{RR(r_{\\parallel},r_{p})}\\,,\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mn>1</mn><mo>+</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>N</mi><mi>R</mi></msub><msub><mi>N</mi><mi>D</mi></msub></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mfrac><mrow><mi>D</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mfrac><msub><mi>N</mi><mi>R</mi></msub><msub><mi>N</mi><mi>D</mi></msub></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mi>D</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nAs $w_p$ depends only on $r_p$, and the angle between any pair of points is small, it will not be significantly affected by redshift errors, as these will mainly produce shifts in $r_{\\parallel}$. \nFor computational reasons, we have to fix a finite upper limit, $r_{\\parallel, \\rm max}$, for the integral in Eq.~\\ref{int}. The authors showed in \\citetalias{2014MNRAS.441.1783A} that the optimal value for our samples is  $r_{\\parallel,\\rm max} = 200\\, h^{-1}$~Mpc.\n\nWe further correct our measured $w_p(r_p)$ for the bias introduced by the integral constraint \\citep{1980lssu.book.....P}.\nThis effect arises because we are measuring the correlation function with respect to the mean density of a sample instead of the global mean of the parent population.\nWe base our correction on the effect of the integral constraint on the three-dimensional correlation function $\\xi(r)$. \nThis function is biased to first order as\n\n", "itemtype": "equation", "pos": 27812, "prevtext": "\nwhere $DD(r_{\\parallel},r_p)$, $DR(r_{\\parallel},r_p)$ and $RR(r_{\\parallel},r_p)$ correspond to pairs of points with transverse separations in the interval $[r_p, r_p + \\mathrm{d}r_p]$ and radial separations in the interval $[r_\\parallel, r_\\parallel + \\mathrm{d}r_\\parallel]$. $DD$ counts pairs of points in the data catalogue, $RR$ counts pairs in the random Poisson catalogue, and $DR$ counts crossed pairs between a point in the data catalogue and a point in the Poisson catalogue. \n$N_D$ is the number of points in the data catalogue, and $N_R$ ($= 20 N_D$) is the number of points used in our random Poisson catalogue.\n\nWe can define the projected correlation function as\n\n", "index": 5, "text": "\\begin{equation}\\label{int}\nw_p(r_p) = 2\\int^{\\infty}_{0}\\hat{\\xi}(r_{\\parallel},r_p) \\mathrm{d}r_{\\parallel} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"w_{p}(r_{p})=2\\int^{\\infty}_{0}\\hat{\\xi}(r_{\\parallel},r_{p})\\mathrm{d}r_{%&#10;\\parallel}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>w</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mo>∥</mo></msub><mo>,</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mpadded width=\"+1.7pt\"><msub><mi>r</mi><mo>∥</mo></msub></mpadded></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nwhere $K$ is the integral constraint term. Using eq.~(\\ref{int}), the effect on $w_p(r_p)$ is then\n\n", "itemtype": "equation", "pos": 28861, "prevtext": "\nAs $w_p$ depends only on $r_p$, and the angle between any pair of points is small, it will not be significantly affected by redshift errors, as these will mainly produce shifts in $r_{\\parallel}$. \nFor computational reasons, we have to fix a finite upper limit, $r_{\\parallel, \\rm max}$, for the integral in Eq.~\\ref{int}. The authors showed in \\citetalias{2014MNRAS.441.1783A} that the optimal value for our samples is  $r_{\\parallel,\\rm max} = 200\\, h^{-1}$~Mpc.\n\nWe further correct our measured $w_p(r_p)$ for the bias introduced by the integral constraint \\citep{1980lssu.book.....P}.\nThis effect arises because we are measuring the correlation function with respect to the mean density of a sample instead of the global mean of the parent population.\nWe base our correction on the effect of the integral constraint on the three-dimensional correlation function $\\xi(r)$. \nThis function is biased to first order as\n\n", "index": 7, "text": "\\begin{equation}\n\\xi(r) = \\xi^{\\rm true}(r) - K \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\xi(r)=\\xi^{\\rm true}(r)-K\\,,\" display=\"block\"><mrow><mrow><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mi>ξ</mi><mi>true</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mpadded width=\"+1.7pt\"><mi>K</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nGiven a model correlation function, $K$ can be estimated as \\citep{Roche1999o}\n\n", "itemtype": "equation", "pos": 29028, "prevtext": "\nwhere $K$ is the integral constraint term. Using eq.~(\\ref{int}), the effect on $w_p(r_p)$ is then\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:wpKcorrect}\nw_p^{\\rm true}(r_p, r_{\\parallel,  \\rm max}) = w_p(r_p, r_{\\parallel, \\rm max}) + 2Kr_{\\parallel, \\rm max} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"w_{p}^{\\rm true}(r_{p},r_{\\parallel,\\rm max})=w_{p}(r_{p},r_{\\parallel,\\rm max%&#10;})+2Kr_{\\parallel,\\rm max}\\,.\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>w</mi><mi>p</mi><mi>true</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo>,</mo><msub><mi>r</mi><mrow><mo>∥</mo><mo>,</mo><mi>max</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>w</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo>,</mo><msub><mi>r</mi><mrow><mo>∥</mo><mo>,</mo><mi>max</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>K</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>r</mi><mrow><mo>∥</mo><mo>,</mo><mi>max</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nWe proceed in an iterative way to introduce this correction for each of our samples.\nWe first fit our original $w_p(r_p)$ measurements to a double power-law model, $A\\cdot x^\\beta + C\\cdot x^\\delta$. We use the model $\\xi(r)$ obtained from this fit to estimate $K$ using Eq.~\\ref{eq:Kest}, and obtain our corrected values of $w_p(r_p)$ from Eq.~(\\ref{eq:wpKcorrect}).\nWe use the corrected values to perform the model fits described in Sects.~\\ref{sec:power} and \\ref{sec:depend-bias-spectr}, and for all the results reported in Sect.~\\ref{sec:res}.\nIn any case, the effect of the integral constraint in our measurements is always much smaller than the statistical errors.\n\nTo estimate the correlation function errors for each bin in $r_p$, we used the jackknife method \\citep[see, e.g.,][]{nor08a}. \nWe divided our volume in $N_\\textrm{jack} = 47$ equal sub-volumes, corresponding to the individual ALHAMBRA frames \\citep[see][]{2013arXiv1306.4968M}, and constructed our jackknife samples omitting one sub-volume at a time. \nWe repeated the full calculation of $w_p(r_p)$ (including the integral constraint correction) for each of these samples. \nDenoting by $w_{pi}^{k}$ the correlation function obtained for bin $i$ in the jackknife sample $k$, the covariance matrix of the projected correlation function is then \n\n", "itemtype": "equation", "pos": 29273, "prevtext": "\nGiven a model correlation function, $K$ can be estimated as \\citep{Roche1999o}\n\n", "index": 11, "text": "\\begin{equation}\n\\label{eq:Kest}\nK \\simeq \\frac{\\sum_i RR(r_i)\\xi^{\\rm model}(r_i)}{\\sum_i RR(r_i)} = \\frac{\\sum_i RR(r_i)\\xi^{\\rm model}(r_i)}{N_R(N_R-1)} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"K\\simeq\\frac{\\sum_{i}RR(r_{i})\\xi^{\\rm model}(r_{i})}{\\sum_{i}RR(r_{i})}=\\frac%&#10;{\\sum_{i}RR(r_{i})\\xi^{\\rm model}(r_{i})}{N_{R}(N_{R}-1)}\\,.\" display=\"block\"><mrow><mrow><mi>K</mi><mo>≃</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>ξ</mi><mi>model</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>ξ</mi><mi>model</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mi>N</mi><mi>R</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>N</mi><mi>R</mi></msub><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nwhere $\\bar{w}_{pi}$ is the average of the values obtained for bin $i$. \nThe errors for individual data points (shown as errorbar in the plots) are obtained from the diagonal terms of the covariance matrix as\n\n", "itemtype": "equation", "pos": 30765, "prevtext": "\nWe proceed in an iterative way to introduce this correction for each of our samples.\nWe first fit our original $w_p(r_p)$ measurements to a double power-law model, $A\\cdot x^\\beta + C\\cdot x^\\delta$. We use the model $\\xi(r)$ obtained from this fit to estimate $K$ using Eq.~\\ref{eq:Kest}, and obtain our corrected values of $w_p(r_p)$ from Eq.~(\\ref{eq:wpKcorrect}).\nWe use the corrected values to perform the model fits described in Sects.~\\ref{sec:power} and \\ref{sec:depend-bias-spectr}, and for all the results reported in Sect.~\\ref{sec:res}.\nIn any case, the effect of the integral constraint in our measurements is always much smaller than the statistical errors.\n\nTo estimate the correlation function errors for each bin in $r_p$, we used the jackknife method \\citep[see, e.g.,][]{nor08a}. \nWe divided our volume in $N_\\textrm{jack} = 47$ equal sub-volumes, corresponding to the individual ALHAMBRA frames \\citep[see][]{2013arXiv1306.4968M}, and constructed our jackknife samples omitting one sub-volume at a time. \nWe repeated the full calculation of $w_p(r_p)$ (including the integral constraint correction) for each of these samples. \nDenoting by $w_{pi}^{k}$ the correlation function obtained for bin $i$ in the jackknife sample $k$, the covariance matrix of the projected correlation function is then \n\n", "index": 13, "text": "\\begin{equation}\n\\label{eq:covmat}\n\\Sigma_{ij} = \\frac{N_{\\rm jack} - 1}{N_{\\rm jack}}\\sum_{k=1}^{N_{\\rm jack}}(w_{p}^{k}(r_i)-\\bar{w}_{p}(r_i)) \\cdot (w_{p}^{k}(r_j)-\\bar{w}_{p}(r_j)) \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Sigma_{ij}=\\frac{N_{\\rm jack}-1}{N_{\\rm jack}}\\sum_{k=1}^{N_{\\rm jack}}(w_{p}%&#10;^{k}(r_{i})-\\bar{w}_{p}(r_{i}))\\cdot(w_{p}^{k}(r_{j})-\\bar{w}_{p}(r_{j}))\\,,\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><msub><mi>N</mi><mi>jack</mi></msub><mo>-</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>jack</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>jack</mi></msub></munderover><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mi>w</mi><mi>p</mi><mi>k</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mover accent=\"true\"><mi>w</mi><mo stretchy=\"false\">¯</mo></mover><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mi>w</mi><mi>p</mi><mi>k</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mover accent=\"true\"><mi>w</mi><mo stretchy=\"false\">¯</mo></mover><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\n\n\n\n\n\\section{Results and discussion}\n\\label{sec:res} \n\nIn this section we first present the results of the calculation of the projected correlation function $w_p(r_p)$ for the different samples described in Section~\\ref{sec:seg}. This is done in Subsection~\\ref{sec:power}. We also present the analysis of the bias (Subsection~\\ref{sec:depend-bias-spectr}). The calculation has been performed for scales from $0.03$ to $10.0 \\, h^{-1} $ Mpc for the projected correlation function and from $1.0$ to $10.0 \\, h^{-1} $ Mpc for the bias. Fig.~\\ref{full} shows the projected correlation function for the full samples. The first remarkable result that deserves to be pointed out is a clear change of the slope of the $w_p(r_p)$ functions around $r_p \\sim 0.2 \\, h^{-1} $ Mpc, as already mentioned by \\cite{2006ApJ...644..671C} and \\cite{coi08a}. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.5\\textheight]{wprp_full_com}\n\\end{center}\n\\caption{\\label{full}\nProjected correlation function for the full population sample in each of the redshift bins (points with errorbars). Top: small scales ($0.03 < r_p < 0.2$). Bottom: large scales ($0.2 < r_p < 10.0$). Error bars are calculated with the delete-one jackknife method and values at the same $r_p$ are shifted for clarity.\nSolid lines with matching colors show the best-fit power law in each case. The black segment represents the mean slope of the curves.}\n\\end{figure}\n\nIn this section, we compare our results with previous works that studied the galaxy clustering and  its dependence on spectral type or colour in the redshift range $z \\in [0,1]$, as mentioned in the introduction. \nGiven the luminosity selection of our sample (see Section~\\ref{sec:seg}), in each case we use for comparison the published results for volume-limited samples with number density closest to $n = 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$.\nThe number density of the samples shown in our comparisons are within $20\\%$ of this figure with two exceptions: the PRIMUS sample at $z \\simeq 0.4$ (with number density of $n = 1.6 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$, \\citealp{Skibba2013c}), and the VIPERS sample at $z \\simeq 0.6$ (with number density of $n = 0.33 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$, \\citealp{2013Marulli}).\nIn the case of \\citet{Meneux2006a}, they use a flux-limited sample resulting in a evolving number density with redshift in the range $n = 0.33 - 1.2 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$.\n\n\n\n\n\\subsection{Power-law modelling}\n\\label{sec:power}\n\nPower laws are simple and widely used models to describe the correlation function of the galaxy distributions, as they provide a very good approximation over a large range of scales with only two free parameters. The observed change of the slope mentioned above  forced us to model the projected correlation function $w_p$ by means of two power laws, one that fits the function at small scales and the other one at large scales. A similar treatment was done by \\cite{2006ApJ...644..671C} in their analysis of the clustering in the DEEP2 survey at $z=1$. The departure from power-law behavior at small scales can be explained naturally in the framework of the halo occupation distribution (HOD) model that considers the contribution to the correlation function of pairs within the same halo (one-halo term), which is dominant at short scales, and the transition to the regime where the function is dominated by pairs from different halos (two-halo term), at large scales. We will present HOD fits to the ALHAMBRA data in a separate paper. Therefore, we fit two power laws as:\n\n\n", "itemtype": "equation", "pos": 31179, "prevtext": "\nwhere $\\bar{w}_{pi}$ is the average of the values obtained for bin $i$. \nThe errors for individual data points (shown as errorbar in the plots) are obtained from the diagonal terms of the covariance matrix as\n\n", "index": 15, "text": "\\begin{equation}\n\\sigma_i = \\sqrt{\\Sigma_{ii}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{i}=\\sqrt{\\Sigma_{ii}}.\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mi>i</mi></msub><mo>=</mo><msqrt><msub><mi mathvariant=\"normal\">Σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub></msqrt></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nfor the small scales, and\n\n\n", "itemtype": "equation", "pos": 34835, "prevtext": "\n\n\n\n\n\\section{Results and discussion}\n\\label{sec:res} \n\nIn this section we first present the results of the calculation of the projected correlation function $w_p(r_p)$ for the different samples described in Section~\\ref{sec:seg}. This is done in Subsection~\\ref{sec:power}. We also present the analysis of the bias (Subsection~\\ref{sec:depend-bias-spectr}). The calculation has been performed for scales from $0.03$ to $10.0 \\, h^{-1} $ Mpc for the projected correlation function and from $1.0$ to $10.0 \\, h^{-1} $ Mpc for the bias. Fig.~\\ref{full} shows the projected correlation function for the full samples. The first remarkable result that deserves to be pointed out is a clear change of the slope of the $w_p(r_p)$ functions around $r_p \\sim 0.2 \\, h^{-1} $ Mpc, as already mentioned by \\cite{2006ApJ...644..671C} and \\cite{coi08a}. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.5\\textheight]{wprp_full_com}\n\\end{center}\n\\caption{\\label{full}\nProjected correlation function for the full population sample in each of the redshift bins (points with errorbars). Top: small scales ($0.03 < r_p < 0.2$). Bottom: large scales ($0.2 < r_p < 10.0$). Error bars are calculated with the delete-one jackknife method and values at the same $r_p$ are shifted for clarity.\nSolid lines with matching colors show the best-fit power law in each case. The black segment represents the mean slope of the curves.}\n\\end{figure}\n\nIn this section, we compare our results with previous works that studied the galaxy clustering and  its dependence on spectral type or colour in the redshift range $z \\in [0,1]$, as mentioned in the introduction. \nGiven the luminosity selection of our sample (see Section~\\ref{sec:seg}), in each case we use for comparison the published results for volume-limited samples with number density closest to $n = 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$.\nThe number density of the samples shown in our comparisons are within $20\\%$ of this figure with two exceptions: the PRIMUS sample at $z \\simeq 0.4$ (with number density of $n = 1.6 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$, \\citealp{Skibba2013c}), and the VIPERS sample at $z \\simeq 0.6$ (with number density of $n = 0.33 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$, \\citealp{2013Marulli}).\nIn the case of \\citet{Meneux2006a}, they use a flux-limited sample resulting in a evolving number density with redshift in the range $n = 0.33 - 1.2 \\times 10^{-2} \\, h^3 \\, \\mathrm{Mpc}^{-3}$.\n\n\n\n\n\\subsection{Power-law modelling}\n\\label{sec:power}\n\nPower laws are simple and widely used models to describe the correlation function of the galaxy distributions, as they provide a very good approximation over a large range of scales with only two free parameters. The observed change of the slope mentioned above  forced us to model the projected correlation function $w_p$ by means of two power laws, one that fits the function at small scales and the other one at large scales. A similar treatment was done by \\cite{2006ApJ...644..671C} in their analysis of the clustering in the DEEP2 survey at $z=1$. The departure from power-law behavior at small scales can be explained naturally in the framework of the halo occupation distribution (HOD) model that considers the contribution to the correlation function of pairs within the same halo (one-halo term), which is dominant at short scales, and the transition to the regime where the function is dominated by pairs from different halos (two-halo term), at large scales. We will present HOD fits to the ALHAMBRA data in a separate paper. Therefore, we fit two power laws as:\n\n\n", "index": 17, "text": "\\begin{equation}\nw_{p}^{s}(r_p) = A r_p^{\\beta}, \\text{if } r_p \\leq r_s\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"w_{p}^{s}(r_{p})=Ar_{p}^{\\beta},\\text{if }r_{p}\\leq r_{s}\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>w</mi><mi>p</mi><mi>s</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>A</mi><mo>⁢</mo><msubsup><mi>r</mi><mi>p</mi><mi>β</mi></msubsup></mrow></mrow><mo>,</mo><mrow><mrow><mtext>if </mtext><mo>⁢</mo><msub><mi>r</mi><mi>p</mi></msub></mrow><mo>≤</mo><msub><mi>r</mi><mi>s</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nfor the large ones. We fix value $r_s \\simeq0.2 h^{-1}$ Mpc. An abrupt change in the projected correlation function has also been detected at this scale by \\cite{2006A&A...457..145P} for the blue galaxies of the COMBO-17 sample. $A$, $\\beta$, $C$ and $\\delta$ are the free parameters. We treat each power law independently and express them in terms of the equivalent model for the three-dimensional correlation function $\\xi$. \n\n", "itemtype": "equation", "pos": 34950, "prevtext": "\nfor the small scales, and\n\n\n", "index": 19, "text": "\\begin{equation}\nw_{p}^{l}(r_p) = C r_p^{\\delta}, \\text{if } r_p \\geq r_s\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"w_{p}^{l}(r_{p})=Cr_{p}^{\\delta},\\text{if }r_{p}\\geq r_{s}\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>w</mi><mi>p</mi><mi>l</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>C</mi><mo>⁢</mo><msubsup><mi>r</mi><mi>p</mi><mi>δ</mi></msubsup></mrow></mrow><mo>,</mo><mrow><mrow><mtext>if </mtext><mo>⁢</mo><msub><mi>r</mi><mi>p</mi></msub></mrow><mo>≥</mo><msub><mi>r</mi><mi>s</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\n$A$ and $\\beta$ (analogously, $C$ and $\\delta$) can be related to the parameters $\\gamma$ (power-law index) and $r_0$ (correlation length) as shown in \\cite{1983ApJ...267..465D}: \n\n", "itemtype": "equation", "pos": 35467, "prevtext": "\nfor the large ones. We fix value $r_s \\simeq0.2 h^{-1}$ Mpc. An abrupt change in the projected correlation function has also been detected at this scale by \\cite{2006A&A...457..145P} for the blue galaxies of the COMBO-17 sample. $A$, $\\beta$, $C$ and $\\delta$ are the free parameters. We treat each power law independently and express them in terms of the equivalent model for the three-dimensional correlation function $\\xi$. \n\n", "index": 21, "text": "\\begin{equation}\n\\xi^{\\rm pl}(r) = \\left(\\frac{r}{r_0}\\right)^{-\\gamma} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\xi^{\\rm pl}(r)=\\left(\\frac{r}{r_{0}}\\right)^{-\\gamma}\\,.\" display=\"block\"><mrow><mrow><mrow><msup><mi>ξ</mi><mi>pl</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><mi>r</mi><msub><mi>r</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>γ</mi></mrow></msup></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\n\n\nWe have performed the fitting of this model to our data using a standard $\\chi^2$ method, by minimizing the quantity\n\n", "itemtype": "equation", "pos": 35739, "prevtext": "\n$A$ and $\\beta$ (analogously, $C$ and $\\delta$) can be related to the parameters $\\gamma$ (power-law index) and $r_0$ (correlation length) as shown in \\cite{1983ApJ...267..465D}: \n\n", "index": 23, "text": "\\begin{equation}\nA = r_{0}^{\\gamma} \\frac{\\Gamma(0.5)\\Gamma\\left[0.5(\\gamma-1)\\right]}{\\Gamma(0.5\\gamma)} \\; , \\; \\beta = 1 - \\gamma \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"A=r_{0}^{\\gamma}\\frac{\\Gamma(0.5)\\Gamma\\left[0.5(\\gamma-1)\\right]}{\\Gamma(0.5%&#10;\\gamma)}\\;,\\;\\beta=1-\\gamma\\,.\" display=\"block\"><mrow><mrow><mrow><mi>A</mi><mo>=</mo><mrow><msubsup><mi>r</mi><mn>0</mn><mi>γ</mi></msubsup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0.5</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>0.5</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>γ</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>]</mo></mrow></mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>0.5</mn><mo>⁢</mo><mi>γ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow><mo rspace=\"5.3pt\">,</mo><mrow><mi>β</mi><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mpadded width=\"+1.7pt\"><mi>γ</mi></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nwhere $\\Sigma$ is the covariance matrix. We fit this model to our data at scales $0.03 \\leq r_p \\leq 0.2 h^{-1}$ Mpc and $ 0.2 \\leq r_p \\leq 10.0 h^{-1}$ Mpc for each sample using the covariance matrix computed from eq.~(\\ref{eq:covmat}), to obtain the best-fit values of $r_0$, $\\gamma$ and their uncertainties (see Table~\\ref{fittablem}). This fitting has been performed using the POWERFIT code developed by \\citet{2012ApJ...745..180M}. \n\n\nWe must remark that the statistical errors of the correlation function at different separations $r_p$ are heavily correlated because a given large-scale structure adds pairs at many different distances. The higher the values of the off-diagonal terms of the covariance matrix, the stronger the correlations between the errors. When this happens the best fit parameters $r_0$ and $\\gamma$ might be affected as has been illustrated by \\cite{2004ApJ...608...16Z} for the SDSS survey. One could ignore the error correlations and use only the diagonal terms, but this is not justified if these terms are dominant. The parameters of the fits are listed in Table~\\ref{fittablem}. \n\n\n\\subsubsection{Full samples}\n\nFig.~\\ref{full} (top panel) shows the measurements of the projected correlation function $w_p(r_p)$ for the full samples at the small scales ($0.03 \\leq r_p \\leq 0.2 h^{-1} $ Mpc). The bottom panel shows the same function for large scales ($0.2 \\leq r_p \\leq 10.0 h^{-1} $ Mpc). Looking at both diagrams, we confirm the rise of the correlation function  at small scales already detected by \\citet{coi08a} with values of $\\gamma \\sim 2.2$ (for the slope of the three-dimensional correlation function). We can also appreciate in the top panel of Fig.~\\ref{full} that the correlation functions are steeper for the high-redshift samples with values of $\\gamma$ increasing from $\\sim 2.1$ for the closest redshift bin ($z \\sim 0.4$) to $\\sim 2.3$ for the farthest ($z\\sim 1$). The correlation length significantly decreases with increasing redshift (see also Table~\\ref{fittablem}).  \n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_full}\n\\end{center}\n\\caption{\\label{eli_full}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our full population samples. In black, the $1\\sigma$ confidence regions of the large scales fit ($0.2 < r_p < 10.0 h^{-1}$ Mpc) and in grey, the $1\\sigma$ confidence regions of the small scales fit ($0.03 < r_p < 0.2 h^{-1}$ Mpc). For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample accross different redshift bins.\nFor comparison, we show as points with errorbars the results of \\cite{2003MNRAS.344..847M} (2dF), \\cite{2011ApJ...736...59Z} (SDSS), \\cite{2006ApJ...644..671C} (DEEP2), \\cite{2013Marulli} (VIPERS) and \\cite{Skibba2013c} (PRIMUS) (see the text for details). The parameters and their 1-sigma variation have been calculated using the method described in Sect.~\\ref{sec:res}.} \n\\end{figure}\n\nFor the large scales $ 0.2 \\leq r_p \\leq 10.0 h^{-1}$ Mpc, the slope of the correlation function is rather constant for all samples with values around $\\gamma =1.8$, while again the correlation length decreases with redshift from $r_0 =4.1 \\pm 0.5$ for $z\\sim 0.4$ to $r_0=3.5 \\pm 0.3$ for $z\\sim 1$. \nThe evolution of the amplitude indicates that the change in clustering is mainly driven by the overall growth of structure in the matter density field.\nAs we use for the fits the scales $0.2 < r_p < 10.0 h^{-1}$ Mpc (the 2-halo term becoming important at scales $r_p > 1.0 \\, h^{-1}$ Mpc) the fact that the slope $\\gamma$ does not significantly change also implies that the 2-halo contribution for this population does not significantly change its profile over this redshift interval.\nAll these effects were studied in detail in \\citetalias{2014MNRAS.441.1783A} and extended to samples with different luminosities (see e.g. their figure~7).\nWe have seen that this is only broken at shorter scales, where the curve presents slightly higher values.\n\n\n\\begin{deluxetable*}{l|ccccc} \n\\tablewidth{18cm}\n\\tablecaption{\\label{fittablem}Results of the different fits to $w(r_p)$: power law and bias models}\n\\tablehead{\n\\colhead{Sample} & \\multicolumn{5}{c}{Full population}\\\\\n\\colhead{} & \\colhead{$r^s_0$} & \\colhead{$\\gamma^s$} & \\colhead{$r^l_0$} & \\colhead{$\\gamma^l$} & \\colhead{$b$}}\n\\startdata\nz0.43 & $3.1 \\pm 0.6$ & $2.1 \\pm 0.13 $ & $ 4.1 \\pm 0.5$ & $1.87 \\pm 0.12$ & $1.21 \\pm 0.14 $\\\\\nz0.57 & $2.9 \\pm 0.4$ & $2.11 \\pm 0.1 $ & $ 4 \\pm 0.5$ & $1.85 \\pm 0.1$ & $1.23 \\pm 0.17 $\\\\\nz0.73 & $2.8 \\pm 0.5$ & $2.12 \\pm 0.12 $ & $ 3.7 \\pm 0.4$ & $1.94 \\pm 0.1$ & $1.25 \\pm 0.14 $\\\\\nz0.88 & $2.5 \\pm 0.4$ & $2.18 \\pm 0.1 $ & $ 3.2 \\pm 0.7$ & $1.94 \\pm 0.15$ & $1.2 \\pm 0.5 $\\\\\nz1.00 & $2 \\pm 0.3$ & $2.3 \\pm 0.11 $ & $ 3.5 \\pm 0.3$ & $1.72 \\pm 0.06$ & $1.3 \\pm 0.13 $\\\\\n\\hline\n\\colhead{} & \\multicolumn{5}{c}{Quiescent galaxies}\\\\\n\\hline\nz0.43 & $4 \\pm 1.2$ & $2.11 \\pm 0.17 $ & $ 4.9 \\pm 0.7$ & $1.89 \\pm 0.16$ & $1.26 \\pm 0.19 $\\\\\nz0.57 & $2.3 \\pm 0.5$ & $2.62 \\pm 0.18 $ & $ 5.4 \\pm 0.8$ & $1.85 \\pm 0.11$ & $1.8 \\pm 0.2 $\\\\\nz0.73 & $3.6 \\pm 0.7$ & $2.29 \\pm 0.14 $ & $ 4.3 \\pm 0.7$ & $2.15 \\pm 0.16$ & $1.4 \\pm 0.2 $\\\\\nz0.88 & $4 \\pm 0.9$ & $2.25 \\pm 0.13 $ & $ 4.2 \\pm 0.8$ & $2.14 \\pm 0.17$ & $1.6 \\pm 0.3 $\\\\\nz1.00 & $3.5 \\pm 0.9$ & $2.28 \\pm 0.16 $ & $ 4.8 \\pm 0.8$ & $1.8 \\pm 0.13$ & $1.9 \\pm 0.3 $\\\\\n\\hline\n\\colhead{} & \\multicolumn{5}{c}{Star-forming galaxies}\\\\\n\\hline\nz0.43 & $2.4 \\pm 1.7$ & $2 \\pm 0.5 $ & $ 4.3 \\pm 0.5$ & $1.66 \\pm 0.13$ & $1.33 \\pm 0.18 $\\\\\nz0.57 & $2.2 \\pm 0.7$ & $2.1 \\pm 0.2 $ & $ 3.6 \\pm 0.4$ & $1.73 \\pm 0.12$ & $1.21 \\pm 0.17 $\\\\\nz0.73 & $2.8 \\pm 0.9$ & $2.1 \\pm 0.2 $ & $ 3.5 \\pm 0.4$ & $1.86 \\pm 0.14$ & $1.18 \\pm 0.14 $\\\\\nz0.88 & $1.8 \\pm 0.5$ & $2.3 \\pm 0.2 $ & $ 3 \\pm 0.4$ & $1.7 \\pm 0.12$ & $1.2 \\pm 0.4 $\\\\\nz1.00 & $1.7 \\pm 0.3$ & $2.34 \\pm 0.13 $ & $ 3.2 \\pm 0.3$ & $1.69 \\pm 0.09$ & $1.25 \\pm 0.13 $\n\\enddata\n\\tablecomments{Results of the fits of the power law model and the bias model to the data for each of our samples. $r_0^s$ and $\\gamma^s$ correspond to the scales $0.03 < r_p < 0.2 h^{-1} $ Mpc, and $r_0^l$ and $\\gamma^l$ to the scales $0.2 < r_p < 10.0 h^{-1} $ Mpc. These parameters have been calculated using the methods described in Sections~\\ref{sec:power} and \\ref{sec:depend-bias-spectr}}.\n\\end{deluxetable*}\n\n\nThe overall trend can be visualized in Fig.~\\ref{eli_full}, where we show the evolution of the best-fit parameters of the three-dimensional correlation function $\\xi(r)$ for small and large scales in the full population samples. Despite the great uncertainties, the diagram shows evolution with $r_0$ decreasing for both scale ranges as redshift grows. In addition, at small scales, the slope $\\gamma$ also increases with redshift. The evolution, at large scales, of the correlation length extrapolates well to lower redshift with the value reported by \\cite{2011ApJ...736...59Z} for the SDSS and by \\cite{2003MNRAS.344..847M} for the 2dF galaxy redshift survey. \\cite{2011ApJ...736...59Z} analysed the SDSS Main catalogue by means of the projected correlation function. They obtained values for the parameters $r_0$ and $\\gamma$ by the same method used here, over the scale range $0.1 < r_p < 50 h^{-1}$ Mpc.\nThe values correspond to the galaxies selected in the luminosity bin $-20 < M_r < -19$ and $0.027 < z < 0.064$, with a number density ($n = 10.04 \\times 10^{-3}\\, h^3 \\, \\mathrm{Mpc}^{-3}$) and typical luminosity ($L^{\\rm med}/L^{\\star} = 0.4$) similar to the ALHAMBRA sample used in this work, so this is, qualitatively, a valid comparison. As we can see in Fig.~\\ref{eli_full}, the slope of the correlation function for the full SSDS main sample is $\\gamma =1.78 \\pm 0.02$ compatible within one $\\sigma$ with the values obtained for the ALHAMBRA survey at higher redshift within the range of large scales analysed here, and the correlation length $r_0 =4.89 \\pm 0.26$ follows the evolutionary trend delineated by the ALHAMBRA higher redshift samples: $r_0$ increases at lower redshifts. Very similar results have been obtained by \\cite{2003MNRAS.344..847M} for the 2dFGRS with  $\\gamma =1.73 \\pm 0.03$ and $r_0 =4.69 \\pm 0.22$ within the range $ 0.2< r_p < 20.0 h^{-1}$ Mpc in the redshift interval $0.01< z < 0.015$. At larger redshift our results can be compared with the ones reported by \\cite{Skibba2013c} for the PRIMUS survey. They have analysed two bins of redshift $ 0.2 < z < 0.5$ and $0.5 < z < 1$ with $M_g < -19$. In Fig.~\\ref{eli_full} we have displayed their results for the correlation function parameters. We also plot a point corresponding to the VIMOS Public Extragalactic Redshift Survey (VIPERS) from \\cite{2013Marulli} and another point corresponding to the DEEP2 survey from \\cite{2006ApJ...644..671C}. All these results, for the three high redshift surveys, show perfect agreement with our own ALHAMBRA results.\n\n\nIt is important to understand the correlation between parameters $\\gamma$ and $r_0$, as its interpretation can be delicate. \nIf, for instance, $\\gamma$ grows with the redshift of the sample, $r_0$ will tend to reduce its value, as $\\xi(r)=1$ for shorter distances, as it can be appreciated in the top-left points (short $r_p$ scales) displayed in Fig.~\\ref{eli_full} \nWe must have this in mind for a proper understanding of our results. \nOn the other hand, the decrease of $r_0$ with increasing redshift when $\\gamma$ does not change, as we find in bottom-right points (large scales) in Fig.~\\ref{eli_full}, can be interpreted as a self-similar growth of the structure at the calculated scales. \nThis effect is specially reflected in the tilt of the confidence ellipses in Fig.~\\ref{eli_full}, which shows the negative correlation between $r_0$ and $\\gamma$.\n\n\n\n\\subsubsection{Segregated samples}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[height=0.75\\textheight]{wprp_combined_5}\\\\\n\\end{center}\n\\caption{\\label{type}\nProjected correlation functions for  quiescent (red) and star-forming (blue) galaxies (points with errorbars). \nSolid lines with matching colors show the best-fit power law in each case.\nFor reference, we also show the results for the full population with the continuous black line.\nFrom top to bottom, left to right, the five reshift bins:  ($0.35 < z < 0.5$), ($0.5 < z < 0.65$), ($0.65 < z < 0.8$), ($0.8 < z < 0.95$) and ($0.95 < z < 1.1$). \nError bars are calculated with the delete-one jackknife method.}\n\\end{figure*}\n\n\n\nFig.~\\ref{type} shows the projected correlation function $w_p(r_p)$ for the quiescent and star-forming galaxies at the five redshift bins, compared to the full population.\nAs expected, the full population result occupies an intermediate position at low redshift, but evolves with redshift towards star-forming positions. This is expected due to the higher abundance of the latter in our samples, specially at high redshift. A visual inspection of Fig.~\\ref{type} suggests that the projected correlation function shows the double slope corresponding to the 1-halo and the 2-halo terms, specially for the star-forming galaxies, due to their tendency to cluster in lower mass halos with smaller virial radii \\citep{2000MNRAS.318..203S}.\n\nQuiescent galaxies show a higher clustering at every redshift bin. In order to study the change of the clustering properties with redshift and spectral type, we fit the projected correlation function $w_p(r_p)$ of each sample with a power law model, using the method described above.\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_seg_esq}\n\\end{center}\n\\caption{\\label{eli_seg_esq}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our spectral segregated samples for the small scales ($r_p \\leq 0.2 h^{-1}$). In red, the $1\\sigma$ confidence regions of the quiescent galaxies fit and in blue, the $1\\sigma$ confidence regions of the star-forming galaxies fit. For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample accross different redshift bins.\nThe parameters and their 1-sigma variation have been calculated using the method described in Section~\\ref{sec:power}}\n\\end{figure}\n\nThe amplitude of their correlation functions, as well as their slope, is higher than that for the star-forming galaxies in all cases. As for the full population we have modelled the correlation function with two different power laws at scales larger and smaller than $r_p = 0.2  h^{-1}$ Mpc. Star-forming galaxies show for all redshift bins a clear rise in their correlation function at small separations. As mentioned in the introduction, \\cite{coi08a} found the same result for the bright blue galaxies of the DEEP2 galaxy redshift survey. They found that the effect is more pronounced at higher redshift corresponding to brighter galaxies. For the quiescent galaxies we would have fitted a single power law for the whole range, in particular for some redshift bins. However we have proceeded in the same way for the two galaxy types in order to simplify the analysis of the segregation. The comparison of the best-fit model to the data in each case is shown in Fig.~\\ref{type}, and we see an excellent agreement in all cases. The parameters obtained from the fits are listed in Table~\\ref{fittablem}.\n\nAs we have done for the full population, to visualize if there is any evolution of the correlation function parameters we show the diagram of $\\gamma$ vs. $r_0$ in Figs.~\\ref{eli_seg_esq} and ~\\ref{eli_seg_dre} for the segregated populations with the corresponding confidence regions, separated in the two scale regimes. In both cases (short and large scales) the parameter space occupied by quiescent galaxies can be clearly distinguished from the space occupied by star-forming galaxies, the first ones showing larger correlation length for both scaling ranges with the difference between both types well over 3$\\sigma$ for small scales and about 2$\\sigma$ for large scales.\n\nAt short scales the exponent of the correlation function $\\gamma$ is similar for both galaxy types with values around $\\gamma \\sim 2.2$ (Fig.~\\ref{eli_seg_esq}). The correlation length for star-forming galaxies varies roughly in the range $r_0= [2,3] \\, h^{-1}$ Mpc. A visual hint of evolution could be appreciated for the star-forming galaxies, with steeper correlation functions (and lower correlation lengths) for higher redshifts, nevertheless, given the large error bars (see Table~\\ref{fittablem}), this trend is not really significant. The parameters of the correlation function for quiescent galaxies at small scales do not show any evolution at all with values for $\\gamma$ in the range $[2.1, 2.3]$ and correlation lengths in the range $r_0= [3.5,4.0] \\, h^{-1}$ Mpc for all redshift bins except for the second bin ($z=0.57$), which displays a higher value of the exponent $\\gamma$ and smaller $r_0$.  The ALHAMBRA survey has allowed us to measure the behaviour of the clustering properties of the segregated samples at these very short scales. These scales had not been previously studied with the detail that we are showing here because other samples cannot reliably estimate the correlation function at $r_p < 0.1  h^{-1}$ Mpc because they are not deep enough, or dense enough at these distance, due for example to fiber collisions in the case of spectroscopic surveys \\citep{2012ApJ...756..127G}.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_seg_dre}\n\\end{center}\n\\caption{\\label{eli_seg_dre}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our spectral segregated samples. In red, the $1\\sigma$ confidence regions of the quiescent galaxies fit and in blue, the $1\\sigma$ confidence regions of the star-forming galaxies fit. For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample across different redshift bins.\nFor comparison, we show as points with errorbars the results of \\cite{2011ApJ...736...59Z} and \\cite{coi08a} (see the text for details). The parameters and their 1-sigma variation have been calculated using the method described in Section~\\ref{sec:power}. For comparison, we plot the results obtained by 1) \\cite{2003MNRAS.344..847M} (2dF) at $z \\sim 0.01$, 2) \\cite{2011ApJ...736...59Z} (SDSS) at $z \\sim 0.05$, 3) \\cite{coi08a} (DEEP2) at $z \\sim 0.9$ and 4) \\cite{Skibba2013c} (PRIMUS) at $z \\sim 0.38$ and $z \\sim 0.6$.}\n\\end{figure}\n\n\n\n\nFig.~\\ref{eli_seg_dre} shows the same results at scales $0.2 < r_p < 10.0  h^{-1}$ Mpc. For this scale range, we can compare with the results from other authors. \nWe see again that the regions of parameter space occupied in the diagram for quiescent and star-forming galaxies are different.\nStar-forming galaxies present both lower exponent $\\gamma$ and lower correlation length $r_0$ than quiescent galaxies. These differences are significant at the 2$\\sigma$ level.\nThe value of $\\gamma$, exponent of the correlation function, is roughly constant for all redshift bins and is $\\sim 1.7$. \nA hint of evolution can be seen in the correlation length, since $r_0$ decreases from $r_0 \\sim 4.3$ to $r_0 \\sim 3 \\, h^{-1}$ Mpc with increasing redshift, which corresponds to a $\\sim2\\sigma$ change in $r_0$.\nThe values of the correlation function parameters reported by other authors for different samples at lower and similar redshift are compatible with the ALHAMBRA results shown here.\nIn the diagram we see that our fits are consistent with the points corresponding to the correlation function parameters of the active galaxies from the 2dFGRS \\citep{2003MNRAS.344..847M} at $z \\sim 0.01$, a blue subsample drawn from the SDSS-main  \\citep{2011ApJ...736...59Z} at $z \\sim 0.05$, a blue population of the DEEP2 redshift survey \\citep{coi08a} at $z \\sim 0.9$, and the blue sample from the PRIMUS survey \\citep{Skibba2013c} at $z \\sim 0.4$.\nThis result also agrees with the qualitative behaviour of the evolution  of the correlation length reported by \\citet{Meneux2006a} from the VVDS sample where they conclude that the clustering amplitude of the late-type star-forming galaxies remains roughly constant since $z\\sim 1.5$, although they found a slight rise of this amplitude at their larger redshift bin $1.2 < z <2.0$. \nHowever, one should bear in mind that \\cite{Meneux2006a} use a flux-limited sample, so this evolution may be affected by the change in luminosity of the samples.\nThe values of the correlation length reported by  \\citet{Meneux2006a} are slightly smaller than the values calculated here for the ALHAMBRA survey.\n\nQuiescent galaxies show stronger clustering than late-type star-forming galaxies.\nTheir correlation function parameters at large scales are nearly compatible within the errors with fixed values around $r_0 = 5 \\, h^{-1}$ Mpc and $\\gamma = 2$, but the clustering length is smaller than the one calculated at low redshift by \\citet{2003MNRAS.344..847M} for passive galaxies in the 2dFGRS and by \\citet{2011ApJ...736...59Z} for the red galaxies in SDSS.\nInstead, the values of the amplitude of the correlation function reported by \\citet{Skibba2013c} at $z \\sim 0.4$ for PRIMUS, by \\citet{coi08a} at $z \\sim 0.9$ for the DEEP2  and by \\citet{Meneux2006a} agree with our results within the errors. \n\nFor both star-forming and passive galaxies, the only discrepant measurement in Fig.~\\ref{eli_seg_dre} is that corresponding to the PRIMUS samples at $z \\sim 0.6$, which show values of $r_0$ significantly larger than those obtained by ALHAMBRA at similar redshifts (and also by DEEP2 at $z \\sim 0.9$). \nThis difference may be due to the fact that the PRIMUS survey includes the COSMOS field, which contains a large overdensity at this redshift affecting the clustering measurements (see the discussion in Section~\\ref{sec:seg}).\n\n\n\nThis segregation is generally explained by the tendency of red, quiescent or early-type galaxies to form in dense environments, while blue, star-forming or late-type galaxies typically form in the field or in low mass haloes \\citep{1980ApJ...236..351D,2003MNRAS.346..601G,2004ApJ...608..752B, 2005ApJ...621..673T, 2009A&A...508.1217Z, McNaught-Roberts2014a}. \n\n\n\n\n\n\n\n\\subsection{Dependence of the bias on spectral type and redshift}\n\\label{sec:depend-bias-spectr}\n\nIn order to disentangle the evolution of the galaxy clustering of different populations from the overall growth of structure, we study the bias $b$ of our samples based on the projected correlation function measurements.\nWe use a simple linear model, with a constant and scale-independent bias.\nIn this model, the galaxy projected correlation function is given by\n\n", "itemtype": "equation", "pos": 36011, "prevtext": "\n\n\nWe have performed the fitting of this model to our data using a standard $\\chi^2$ method, by minimizing the quantity\n\n", "index": 25, "text": "\\begin{equation}\n\\label{chim}\n\\chi^2(r_0, \\gamma) = \\sum_{i=1}^{N_{bins}} \\sum_{j=1}^{N_{bins}} (w_p(r_i) - w_p^{pw}(r_i)) \\cdot \\Sigma_{ij}^{-1} \\cdot (w_p(r_j) - w_p^{pw}(r_j)) \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}(r_{0},\\gamma)=\\sum_{i=1}^{N_{bins}}\\sum_{j=1}^{N_{bins}}(w_{p}(r_{i})%&#10;-w_{p}^{pw}(r_{i}))\\cdot\\Sigma_{ij}^{-1}\\cdot(w_{p}(r_{j})-w_{p}^{pw}(r_{j}))\\,,\" display=\"block\"><mrow><mrow><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mn>0</mn></msub><mo>,</mo><mi>γ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mrow><mi>b</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi></mrow></msub></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mrow><mi>b</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi></mrow></msub></munderover><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>w</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msubsup><mi>w</mi><mi>p</mi><mrow><mi>p</mi><mo>⁢</mo><mi>w</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⋅</mo><msubsup><mi mathvariant=\"normal\">Σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>w</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msubsup><mi>w</mi><mi>p</mi><mrow><mi>p</mi><mo>⁢</mo><mi>w</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03668.tex", "nexttext": "\nwhere $b$ is the bias, and $w^m_p(r_p)$ is the theoretical prediction for the projected correlation function of the matter distribution.\nOur model for $w^m_p$ is based on $\\Lambda$CDM with cosmological parameters consistent with the WMAP7 results \\citep{2011ApJS..192...18K}, including a normalization of the power spectrum $\\sigma_8 = 0.816$. \nThe matter power spectrum at the median redshift of each sample is obtained using the \\textsc{Camb} software \\citep{2000ApJ...538..473L}, including the non-linear \\textsc{Halofit} corrections \\citep{2003MNRAS.341.1311S}.\nWe obtain the real-space correlation function $\\xi(r)$ by a Fourier transform of the matter power spectrum and the final projected correlation function $w_p$ using eq.~(\\ref{int}). \n\nWe fit this model to our data in the range $1.0 < r_p < 10.0 \\, h^{-1}$ Mpc, corresponding mainly to the two-halo term of the correlation function.\nThe best fit value and uncertainty of the bias is obtained by the same method as described in Section~\\ref{sec:power} for the parameters of the power-law model. \nThe results of these fits for each of our samples are listed in Table~\\ref{fittablem}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.41\\textheight]{bias_ratio}\n\\end{center}\n\\caption{\\label{bias}\nGalaxy bias of our quiescent (q) and star-forming (sf) galaxies as function of their median redshift.\nBias is estimated by a fit to eq.~(\\ref{eq:modelbias}), as described in Sect.~\\ref{sec:depend-bias-spectr}. The solid lines correspond to the bias of haloes of a fixed mass, according to the model of \\citet{Tinker2005d}. These lines are labelled \nwith the corresponding halo mass in terms of $\\log_{10}\\left[ M_{\\rm h} / (h^{-1} \\, {\\rm M}_{\\odot}) \\right]$. For comparison, we plot the results obtained by 1) \\cite{2011ApJ...736...59Z}, 2) \\cite{coi08a}, 3) \\cite{Skibba2013c}, 4) \\cite{2003MNRAS.344..847M}, 5) \\cite{2013Marulli}, 6) \\cite{Meneux2006a} and 7) \\cite{2011MNRAS.412..825D}.  Bias values from different authors have been adapted for the assumed cosmological parameters used in this paper.}\n\\end{figure}\n\nWe show the evolution of the bias as a function of redshift for our different populations in the top panel of Fig.~\\ref{bias} (red and blue squares).  \nAs expected, we also see the effect of spectral segregation in this case, as the bias of early-type quiescent galaxies is consistently larger than that of late-type star-forming galaxies. \nThe bias observed for the full population, not shown, is similar to that of the star-fotming galaxies.\nFor comparison we show, as solid lines, the bias for dark matter haloes of a fixed mass, according to the model of \\citet{Tinker2005d}, and the values obtained by previous works for samples at similar redshift ranges and number densities.\nThe bias values in those cases were obtained by a similar method as here, and using compatible scale ranges. \\footnote{In the case of \\cite{2003MNRAS.344..847M}, as the bias values are not given explicitly, we derived them using their power law best fit at a scale of $5 h^{-1}$ Mpc.}.\n\n\nFor the star-forming galaxies, we obtain that their bias is approximately constant, with values $b \\simeq 1.25$, over the range we explore. \nThis explains the evolution of $r_0$ at large scales observed in Fig.~\\ref{eli_seg_dre}.\nIf the bias is constant, the main driver for the evolution of the galaxy clustering amplitude is the growth factor, therefore $r_0$ grows with cosmic time, as observed.\nGiven the uncertainties, and the relatively slow evolution of the halo bias, the measured bias in this case is also consistent with the evolution of the bias of haloes with mass in the range $M_{\\rm h} \\simeq 10^{11.5} - 10^{12} \\, h^{-1} \\, \\mathrm{M}_{\\odot}$.\nAs shown in Fig.~\\ref{bias}, our results for the star-forming population are fully consistent with those obtained for similar populations of blue galaxies in the the DEEP2 \\citep{coi08a} and PRIMUS \\citep{Skibba2013c} surveys.\n\n\nThe bias of quiescent galaxies shows a clear evolution, increasing with redshift, which is remarkably similar to the expected evolution of the bias for haloes of mass $M_{\\rm h} \\simeq 10^{12.5} \\, h^{-1} \\, \\mathrm{M}_{\\odot}$.\nThis clear evolution of the bias in this case compensates the clustering evolution due to the growth factor, resulting in an approximately constant value of $r_0$, as shown above in Fig.~\\ref{eli_seg_dre}.\nOur results for this population are consistent with the observed bias for red galaxies in the DEEP2 and PRIMUS surveys. \nWe note that the bias measurement for the PRIMUS sample at $z \\simeq 0.6$ may be affected by the presence of a large overdensity in the COSMOS field, as noted above.\nThe larger number of bins in redshift used in this ALHAMBRA analysis allows us to see more clearly this evolutionary trend.\n\n\nIn the bottom panel of Fig.~\\ref{bias} we show the relative bias, defined as the ratio of the bias of quiescent galaxies over the bias of the star-forming ones, as function of redshift.\nWe also show for comparison the results from previous surveys at similar redshifts including, in addition to those shown in the top panel, the VVDS survey \\citep{Meneux2006a}, and the zCOSMOS-Bright survey \\citep{2011MNRAS.412..825D}. \\cite{Meneux2006a} used flux-limited samples with evolving galaxy density so their absolute bias measurements are not comparable to ours. The analysis in  \\cite{2011MNRAS.412..825D} only provided values of the relative bias of their samples.\nAt $z \\sim 0$ we show the results from the 2dFGRS survey \\citep{2003MNRAS.344..847M} and the SDSS \\citep{2011ApJ...736...59Z}. \nWe note that in the two low redshift cases, the relative bias is calculated using a slightly different method: \\citet{2003MNRAS.344..847M} calculate it using the ratio of the galaxy variances $\\sigma_{8, \\rm gal}$ of the samples, while we have calculated the relative bias for SDSS as the ratio of the best-fit power laws of the two samples at a scale $r = 5 \\, h^{-1} \\, \\mathrm{Mpc}$ (see, e.g. Eq.~9 of \\citet{2002MNRAS.332..827N}).\n\nWe obtain values of the relative bias in the range $b_{\\rm rel} \\simeq 1-1.5$, consistent with all previous results at similar redshifts.\nThe relative bias shows a very faint evolution, slightly increasing with redshift.\nHowever, given the errors, our results are also consistent with being constant.\nA similar, faint trend is also seen for the VVDS results of \\cite{Meneux2006a}.\nHowever, if we include the $z \\sim 0$ values, this evolution is broken, and the best description of the results is a constant relative bias with redshift.\n\nOverall, our results indicate that, for samples selected by the same $B$-band luminosity and redshift, passive galaxies reside in haloes up to 10 times more massive than those hosting active galaxies.\nWhen studying the evolution with redshift, the observed bias suggests that quiescent galaxies (following a constant number density selection) reside in haloes of constant mass, while this is not clear in the case of star-forming galaxies. \nIn the latter case, there seems to be an indication that they populate slightly more massive haloes at lower redshift.\nWe will study the relation between galaxies and dark matter haloes using a more detailed HOD modelling in a future work.\n\n\n\\section{Conclusions}\n\\label{sec:con}\n\n\n\nThe ALHAMBRA survey allows us to perform accurate clustering calculations with different segregation criteria. Its 23-filter photometry provides reliable galaxy parameters with good completeness out to very high redshifts ($ z \\sim 1.10$), opening the possibility to analyze the galaxy clustering of different galaxy populations. In AM14 the authors chose to select galaxy samples using different luminosity thresholds, while in this work we made a selection by spectral type. This selection follows the spectral classification of the ALHAMBRA photometric templates and has been proved to match remarkably well the usual selection by broad-band color. \n\nA rise of the correlation function at small scales is found as already noticed by \\cite{coi08a}. We have been able to show that this trend holds at smaller scales and to \ncharacterise its redshift evolution.\n\nOur sample allows us to measure the clustering properties of galaxy \npopulations segregated by spectral type and their redshift evolution in an homogeneous \nway. At scales larger than $0.2 \\, h^{-1}$ Mpc, quiescent galaxies cluster with a higher \namplitude than star-forming ones. The difference is significant at the 2$\\sigma$ level. There is also a significant hint of evolution (2$\\sigma$) in the clustering amplitude of active galaxies, while the clustering of the passive ones remains \nconstant. These results are compatible with previous works in the literature, but \nin the present work we have increased the redshift resolution. \n\nRegarding the small scales ($r_p < 0.2 \\, h^{-1}$ Mpc) we find almost no change in the \ncorrelation function compared with the large scales in the quiescent population. On \nthe other hand, the star-forming galaxies show a clear variation in the slope \nbetween small and large scales, which is possibly decreasing towards low \nredshifts. \n\nOur measurements of the bias value for the different populations show strong \nsegregation between them. The bias of the quiescent population clearly evolves \nwith redshift following the expected behaviour for haloes of approximate mass \n$10^{12.5} \\, h^{-1} M_{\\astrosun}$.  The star-forming population bias remains basically constant over our observed redshift range, but it can still be compatible with the theoretical \nevolution of lower mass haloes ($M_h \\sim 10^{11.5-12}  \\, h^{-1} M_{\\astrosun}$). As a consequence, the relative bias hints at a slow evolution, which would not be completely consistent with observations at $z \\sim 0$.\n\n\n\n\n\\acknowledgements\nWe would like to thank an anonymous referee for his/her comments that have improved the quality and readability of this paper. This work is based on observations collected at the Germanâ\u0080\u0093Spanish Astronomical Center, Calar Alto, jointly operated by the Max-Planck-Institut f\\\"ur Astronomie (MPIA) and the Instituto de Astrof\\'{\\i}sica de Andaluc\\'{\\i}a (CSIC). This work was mainly supported by the Spanish Ministry for Economy and Competitiveness and FEDER funds through grants AYA2010-22111-C03-02 and AYA2013-48623-C2-2, and by the Generalitat Valenciana through project PrometeoII 2014/060.\nWe also acknowledge support from the Spanish Ministry for Economy and Competitiveness and FEDER funds through grants  AYA2012-39620, AYA2013-40611-P, AYA2013-42227-P, AYA2013-43188-P, AYA2013-48623-C2-1, ESP2013-48274, AYA2014-58861-C3-1,  Junta de Andaluc\\'{\\i}a grants TIC114, JA2828, P10-FQM-6444, and Generalitat de Catalunya project SGR-1398. \nBA acknowledges received funding from the European Union's Horizon 2020 research and innovation programme under the Marie Sklodowska-Curie grant agreement No 656354.\n\n\\bibliography{ref}\n\n\\section*{Author Affiliations}\n\\small{\n\\noindent\n$^1$ Observatori Astron\\`omic, Universitat de Val\\`encia, C/ Catedr\\`atic Jos\\'e Beltr\\'an 2, E-46980, Paterna, Spain\\\\\n$^2$ Instituto de F\\'isica de Cantabria (CSIC-UC), E-39005 Santander, Spain\\\\\n$^3$ Departament d'Astronomia i Astrof\\'isica, Universitat de Val\\`encia, E-46100, Burjassot, Spain\\\\\n$^4$ Unidad Asociada Observatorio Astron\\'omico (IFCA-UV), E-46980, Paterna, Spain\\\\\n$^5$ Leiden Observatory, Leiden University, P.O. Box 9513, 2300 RA Leiden, The Netherlands\\\\\n$^6$ GEPI, Observatoire de Paris, CNRS, Universit\\'e Paris Diderot, 61, Avenue de lâ\u0080\u0099Observatoire 75014, Paris France\\\\\n$^7$ IAA-CSIC, Glorieta de la Astronom\\'ia s/n, 18008 Granada, Spain\\\\\n$^8$ Centro de Estudios de F\\'isica del Cosmos de Arag\\'on, Plaza San Juan 1, 44001 Teruel, Spain\\\\\n$^9$ Instituto de Astrof\\'isica de Canarias, V\\'ia L\\'actea s/n, 38200 La Laguna, Tenerife, Spain\\\\\n$^{10}$ Departamento de Astrof\\'isica, Facultad de F\\'isica, Universidad de La Laguna, 38206 La Laguna, Spain\\\\\n$^{11}$ Observat\\'orio Nacional-MCT, Rua Jos\\'e Cristino, 77. CEP 20921-400, Rio de Janeiro-RJ, Brazil\\\\\n$^{12}$ Department of Theoretical Physics, University of the Basque Country UPV/EHU, 48080 Bilbao, Spain\\\\\n$^{13}$ IKERBASQUE, Basque Foundation for Science, Bilbao, Spain\\\\\n$^{14}$ Departamento de F\\'isica At\\'omica, Molecular y Nuclear, Facultad de F\\'isica, Universidad de Sevilla, 41012 Sevilla, Spain\\\\\n$^{15}$ Institut de Ci\\`encies de l'Espai (IEEC-CSIC), Facultat de Ci\\`encies, Campus UAB, 08193 Bellaterra, Spain\\\\\n$^{16}$ Departamento de Astronom\\'ia, Pontificia Universidad Cat\\'olica. 782-0436 Santiago, Chile\\\\\n$^{17}$ Instituto de Astronom{\\'{\\i}}a, Geof{\\'{\\i}}sica e Ci\\'encias Atmosf\\'ericas, Universidade de S{\\~{a}}o Paulo, S{\\~{a}}o Paulo, Brazil\\\\\n$^{18}$ Departamento de Matem\\'atica Aplicada y Estad{\\'{\\i}}stica, Universidad Polit\\'ecnica de Cartagena, C/Dr. Fleming s/n, 30203 Cartagena, Spain\\\\\n$^{19}$ Instituto de F\\'{\\i}sica Te\\'orica, (UAM/CSIC), Universidad Aut\\'onoma de Madrid, Cantoblanco, E-28049 Madrid, Spain\\\\\n$^{20}$ Campus of International Excellence UAM+CSIC, Cantoblanco, E-28049 Madrid, Spain\\\\\n$^{21}$ APC, AstroParticule et Cosmologie, Universit\\'{e} Paris Diderot, CNRS, 10, rue Alice Domon et L\\'{e}onie Duquet, 75013 Paris, France\\\\\n}\n\n\n", "itemtype": "equation", "pos": 56980, "prevtext": "\nwhere $\\Sigma$ is the covariance matrix. We fit this model to our data at scales $0.03 \\leq r_p \\leq 0.2 h^{-1}$ Mpc and $ 0.2 \\leq r_p \\leq 10.0 h^{-1}$ Mpc for each sample using the covariance matrix computed from eq.~(\\ref{eq:covmat}), to obtain the best-fit values of $r_0$, $\\gamma$ and their uncertainties (see Table~\\ref{fittablem}). This fitting has been performed using the POWERFIT code developed by \\citet{2012ApJ...745..180M}. \n\n\nWe must remark that the statistical errors of the correlation function at different separations $r_p$ are heavily correlated because a given large-scale structure adds pairs at many different distances. The higher the values of the off-diagonal terms of the covariance matrix, the stronger the correlations between the errors. When this happens the best fit parameters $r_0$ and $\\gamma$ might be affected as has been illustrated by \\cite{2004ApJ...608...16Z} for the SDSS survey. One could ignore the error correlations and use only the diagonal terms, but this is not justified if these terms are dominant. The parameters of the fits are listed in Table~\\ref{fittablem}. \n\n\n\\subsubsection{Full samples}\n\nFig.~\\ref{full} (top panel) shows the measurements of the projected correlation function $w_p(r_p)$ for the full samples at the small scales ($0.03 \\leq r_p \\leq 0.2 h^{-1} $ Mpc). The bottom panel shows the same function for large scales ($0.2 \\leq r_p \\leq 10.0 h^{-1} $ Mpc). Looking at both diagrams, we confirm the rise of the correlation function  at small scales already detected by \\citet{coi08a} with values of $\\gamma \\sim 2.2$ (for the slope of the three-dimensional correlation function). We can also appreciate in the top panel of Fig.~\\ref{full} that the correlation functions are steeper for the high-redshift samples with values of $\\gamma$ increasing from $\\sim 2.1$ for the closest redshift bin ($z \\sim 0.4$) to $\\sim 2.3$ for the farthest ($z\\sim 1$). The correlation length significantly decreases with increasing redshift (see also Table~\\ref{fittablem}).  \n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_full}\n\\end{center}\n\\caption{\\label{eli_full}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our full population samples. In black, the $1\\sigma$ confidence regions of the large scales fit ($0.2 < r_p < 10.0 h^{-1}$ Mpc) and in grey, the $1\\sigma$ confidence regions of the small scales fit ($0.03 < r_p < 0.2 h^{-1}$ Mpc). For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample accross different redshift bins.\nFor comparison, we show as points with errorbars the results of \\cite{2003MNRAS.344..847M} (2dF), \\cite{2011ApJ...736...59Z} (SDSS), \\cite{2006ApJ...644..671C} (DEEP2), \\cite{2013Marulli} (VIPERS) and \\cite{Skibba2013c} (PRIMUS) (see the text for details). The parameters and their 1-sigma variation have been calculated using the method described in Sect.~\\ref{sec:res}.} \n\\end{figure}\n\nFor the large scales $ 0.2 \\leq r_p \\leq 10.0 h^{-1}$ Mpc, the slope of the correlation function is rather constant for all samples with values around $\\gamma =1.8$, while again the correlation length decreases with redshift from $r_0 =4.1 \\pm 0.5$ for $z\\sim 0.4$ to $r_0=3.5 \\pm 0.3$ for $z\\sim 1$. \nThe evolution of the amplitude indicates that the change in clustering is mainly driven by the overall growth of structure in the matter density field.\nAs we use for the fits the scales $0.2 < r_p < 10.0 h^{-1}$ Mpc (the 2-halo term becoming important at scales $r_p > 1.0 \\, h^{-1}$ Mpc) the fact that the slope $\\gamma$ does not significantly change also implies that the 2-halo contribution for this population does not significantly change its profile over this redshift interval.\nAll these effects were studied in detail in \\citetalias{2014MNRAS.441.1783A} and extended to samples with different luminosities (see e.g. their figure~7).\nWe have seen that this is only broken at shorter scales, where the curve presents slightly higher values.\n\n\n\\begin{deluxetable*}{l|ccccc} \n\\tablewidth{18cm}\n\\tablecaption{\\label{fittablem}Results of the different fits to $w(r_p)$: power law and bias models}\n\\tablehead{\n\\colhead{Sample} & \\multicolumn{5}{c}{Full population}\\\\\n\\colhead{} & \\colhead{$r^s_0$} & \\colhead{$\\gamma^s$} & \\colhead{$r^l_0$} & \\colhead{$\\gamma^l$} & \\colhead{$b$}}\n\\startdata\nz0.43 & $3.1 \\pm 0.6$ & $2.1 \\pm 0.13 $ & $ 4.1 \\pm 0.5$ & $1.87 \\pm 0.12$ & $1.21 \\pm 0.14 $\\\\\nz0.57 & $2.9 \\pm 0.4$ & $2.11 \\pm 0.1 $ & $ 4 \\pm 0.5$ & $1.85 \\pm 0.1$ & $1.23 \\pm 0.17 $\\\\\nz0.73 & $2.8 \\pm 0.5$ & $2.12 \\pm 0.12 $ & $ 3.7 \\pm 0.4$ & $1.94 \\pm 0.1$ & $1.25 \\pm 0.14 $\\\\\nz0.88 & $2.5 \\pm 0.4$ & $2.18 \\pm 0.1 $ & $ 3.2 \\pm 0.7$ & $1.94 \\pm 0.15$ & $1.2 \\pm 0.5 $\\\\\nz1.00 & $2 \\pm 0.3$ & $2.3 \\pm 0.11 $ & $ 3.5 \\pm 0.3$ & $1.72 \\pm 0.06$ & $1.3 \\pm 0.13 $\\\\\n\\hline\n\\colhead{} & \\multicolumn{5}{c}{Quiescent galaxies}\\\\\n\\hline\nz0.43 & $4 \\pm 1.2$ & $2.11 \\pm 0.17 $ & $ 4.9 \\pm 0.7$ & $1.89 \\pm 0.16$ & $1.26 \\pm 0.19 $\\\\\nz0.57 & $2.3 \\pm 0.5$ & $2.62 \\pm 0.18 $ & $ 5.4 \\pm 0.8$ & $1.85 \\pm 0.11$ & $1.8 \\pm 0.2 $\\\\\nz0.73 & $3.6 \\pm 0.7$ & $2.29 \\pm 0.14 $ & $ 4.3 \\pm 0.7$ & $2.15 \\pm 0.16$ & $1.4 \\pm 0.2 $\\\\\nz0.88 & $4 \\pm 0.9$ & $2.25 \\pm 0.13 $ & $ 4.2 \\pm 0.8$ & $2.14 \\pm 0.17$ & $1.6 \\pm 0.3 $\\\\\nz1.00 & $3.5 \\pm 0.9$ & $2.28 \\pm 0.16 $ & $ 4.8 \\pm 0.8$ & $1.8 \\pm 0.13$ & $1.9 \\pm 0.3 $\\\\\n\\hline\n\\colhead{} & \\multicolumn{5}{c}{Star-forming galaxies}\\\\\n\\hline\nz0.43 & $2.4 \\pm 1.7$ & $2 \\pm 0.5 $ & $ 4.3 \\pm 0.5$ & $1.66 \\pm 0.13$ & $1.33 \\pm 0.18 $\\\\\nz0.57 & $2.2 \\pm 0.7$ & $2.1 \\pm 0.2 $ & $ 3.6 \\pm 0.4$ & $1.73 \\pm 0.12$ & $1.21 \\pm 0.17 $\\\\\nz0.73 & $2.8 \\pm 0.9$ & $2.1 \\pm 0.2 $ & $ 3.5 \\pm 0.4$ & $1.86 \\pm 0.14$ & $1.18 \\pm 0.14 $\\\\\nz0.88 & $1.8 \\pm 0.5$ & $2.3 \\pm 0.2 $ & $ 3 \\pm 0.4$ & $1.7 \\pm 0.12$ & $1.2 \\pm 0.4 $\\\\\nz1.00 & $1.7 \\pm 0.3$ & $2.34 \\pm 0.13 $ & $ 3.2 \\pm 0.3$ & $1.69 \\pm 0.09$ & $1.25 \\pm 0.13 $\n\\enddata\n\\tablecomments{Results of the fits of the power law model and the bias model to the data for each of our samples. $r_0^s$ and $\\gamma^s$ correspond to the scales $0.03 < r_p < 0.2 h^{-1} $ Mpc, and $r_0^l$ and $\\gamma^l$ to the scales $0.2 < r_p < 10.0 h^{-1} $ Mpc. These parameters have been calculated using the methods described in Sections~\\ref{sec:power} and \\ref{sec:depend-bias-spectr}}.\n\\end{deluxetable*}\n\n\nThe overall trend can be visualized in Fig.~\\ref{eli_full}, where we show the evolution of the best-fit parameters of the three-dimensional correlation function $\\xi(r)$ for small and large scales in the full population samples. Despite the great uncertainties, the diagram shows evolution with $r_0$ decreasing for both scale ranges as redshift grows. In addition, at small scales, the slope $\\gamma$ also increases with redshift. The evolution, at large scales, of the correlation length extrapolates well to lower redshift with the value reported by \\cite{2011ApJ...736...59Z} for the SDSS and by \\cite{2003MNRAS.344..847M} for the 2dF galaxy redshift survey. \\cite{2011ApJ...736...59Z} analysed the SDSS Main catalogue by means of the projected correlation function. They obtained values for the parameters $r_0$ and $\\gamma$ by the same method used here, over the scale range $0.1 < r_p < 50 h^{-1}$ Mpc.\nThe values correspond to the galaxies selected in the luminosity bin $-20 < M_r < -19$ and $0.027 < z < 0.064$, with a number density ($n = 10.04 \\times 10^{-3}\\, h^3 \\, \\mathrm{Mpc}^{-3}$) and typical luminosity ($L^{\\rm med}/L^{\\star} = 0.4$) similar to the ALHAMBRA sample used in this work, so this is, qualitatively, a valid comparison. As we can see in Fig.~\\ref{eli_full}, the slope of the correlation function for the full SSDS main sample is $\\gamma =1.78 \\pm 0.02$ compatible within one $\\sigma$ with the values obtained for the ALHAMBRA survey at higher redshift within the range of large scales analysed here, and the correlation length $r_0 =4.89 \\pm 0.26$ follows the evolutionary trend delineated by the ALHAMBRA higher redshift samples: $r_0$ increases at lower redshifts. Very similar results have been obtained by \\cite{2003MNRAS.344..847M} for the 2dFGRS with  $\\gamma =1.73 \\pm 0.03$ and $r_0 =4.69 \\pm 0.22$ within the range $ 0.2< r_p < 20.0 h^{-1}$ Mpc in the redshift interval $0.01< z < 0.015$. At larger redshift our results can be compared with the ones reported by \\cite{Skibba2013c} for the PRIMUS survey. They have analysed two bins of redshift $ 0.2 < z < 0.5$ and $0.5 < z < 1$ with $M_g < -19$. In Fig.~\\ref{eli_full} we have displayed their results for the correlation function parameters. We also plot a point corresponding to the VIMOS Public Extragalactic Redshift Survey (VIPERS) from \\cite{2013Marulli} and another point corresponding to the DEEP2 survey from \\cite{2006ApJ...644..671C}. All these results, for the three high redshift surveys, show perfect agreement with our own ALHAMBRA results.\n\n\nIt is important to understand the correlation between parameters $\\gamma$ and $r_0$, as its interpretation can be delicate. \nIf, for instance, $\\gamma$ grows with the redshift of the sample, $r_0$ will tend to reduce its value, as $\\xi(r)=1$ for shorter distances, as it can be appreciated in the top-left points (short $r_p$ scales) displayed in Fig.~\\ref{eli_full} \nWe must have this in mind for a proper understanding of our results. \nOn the other hand, the decrease of $r_0$ with increasing redshift when $\\gamma$ does not change, as we find in bottom-right points (large scales) in Fig.~\\ref{eli_full}, can be interpreted as a self-similar growth of the structure at the calculated scales. \nThis effect is specially reflected in the tilt of the confidence ellipses in Fig.~\\ref{eli_full}, which shows the negative correlation between $r_0$ and $\\gamma$.\n\n\n\n\\subsubsection{Segregated samples}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[height=0.75\\textheight]{wprp_combined_5}\\\\\n\\end{center}\n\\caption{\\label{type}\nProjected correlation functions for  quiescent (red) and star-forming (blue) galaxies (points with errorbars). \nSolid lines with matching colors show the best-fit power law in each case.\nFor reference, we also show the results for the full population with the continuous black line.\nFrom top to bottom, left to right, the five reshift bins:  ($0.35 < z < 0.5$), ($0.5 < z < 0.65$), ($0.65 < z < 0.8$), ($0.8 < z < 0.95$) and ($0.95 < z < 1.1$). \nError bars are calculated with the delete-one jackknife method.}\n\\end{figure*}\n\n\n\nFig.~\\ref{type} shows the projected correlation function $w_p(r_p)$ for the quiescent and star-forming galaxies at the five redshift bins, compared to the full population.\nAs expected, the full population result occupies an intermediate position at low redshift, but evolves with redshift towards star-forming positions. This is expected due to the higher abundance of the latter in our samples, specially at high redshift. A visual inspection of Fig.~\\ref{type} suggests that the projected correlation function shows the double slope corresponding to the 1-halo and the 2-halo terms, specially for the star-forming galaxies, due to their tendency to cluster in lower mass halos with smaller virial radii \\citep{2000MNRAS.318..203S}.\n\nQuiescent galaxies show a higher clustering at every redshift bin. In order to study the change of the clustering properties with redshift and spectral type, we fit the projected correlation function $w_p(r_p)$ of each sample with a power law model, using the method described above.\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_seg_esq}\n\\end{center}\n\\caption{\\label{eli_seg_esq}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our spectral segregated samples for the small scales ($r_p \\leq 0.2 h^{-1}$). In red, the $1\\sigma$ confidence regions of the quiescent galaxies fit and in blue, the $1\\sigma$ confidence regions of the star-forming galaxies fit. For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample accross different redshift bins.\nThe parameters and their 1-sigma variation have been calculated using the method described in Section~\\ref{sec:power}}\n\\end{figure}\n\nThe amplitude of their correlation functions, as well as their slope, is higher than that for the star-forming galaxies in all cases. As for the full population we have modelled the correlation function with two different power laws at scales larger and smaller than $r_p = 0.2  h^{-1}$ Mpc. Star-forming galaxies show for all redshift bins a clear rise in their correlation function at small separations. As mentioned in the introduction, \\cite{coi08a} found the same result for the bright blue galaxies of the DEEP2 galaxy redshift survey. They found that the effect is more pronounced at higher redshift corresponding to brighter galaxies. For the quiescent galaxies we would have fitted a single power law for the whole range, in particular for some redshift bins. However we have proceeded in the same way for the two galaxy types in order to simplify the analysis of the segregation. The comparison of the best-fit model to the data in each case is shown in Fig.~\\ref{type}, and we see an excellent agreement in all cases. The parameters obtained from the fits are listed in Table~\\ref{fittablem}.\n\nAs we have done for the full population, to visualize if there is any evolution of the correlation function parameters we show the diagram of $\\gamma$ vs. $r_0$ in Figs.~\\ref{eli_seg_esq} and ~\\ref{eli_seg_dre} for the segregated populations with the corresponding confidence regions, separated in the two scale regimes. In both cases (short and large scales) the parameter space occupied by quiescent galaxies can be clearly distinguished from the space occupied by star-forming galaxies, the first ones showing larger correlation length for both scaling ranges with the difference between both types well over 3$\\sigma$ for small scales and about 2$\\sigma$ for large scales.\n\nAt short scales the exponent of the correlation function $\\gamma$ is similar for both galaxy types with values around $\\gamma \\sim 2.2$ (Fig.~\\ref{eli_seg_esq}). The correlation length for star-forming galaxies varies roughly in the range $r_0= [2,3] \\, h^{-1}$ Mpc. A visual hint of evolution could be appreciated for the star-forming galaxies, with steeper correlation functions (and lower correlation lengths) for higher redshifts, nevertheless, given the large error bars (see Table~\\ref{fittablem}), this trend is not really significant. The parameters of the correlation function for quiescent galaxies at small scales do not show any evolution at all with values for $\\gamma$ in the range $[2.1, 2.3]$ and correlation lengths in the range $r_0= [3.5,4.0] \\, h^{-1}$ Mpc for all redshift bins except for the second bin ($z=0.57$), which displays a higher value of the exponent $\\gamma$ and smaller $r_0$.  The ALHAMBRA survey has allowed us to measure the behaviour of the clustering properties of the segregated samples at these very short scales. These scales had not been previously studied with the detail that we are showing here because other samples cannot reliably estimate the correlation function at $r_p < 0.1  h^{-1}$ Mpc because they are not deep enough, or dense enough at these distance, due for example to fiber collisions in the case of spectroscopic surveys \\citep{2012ApJ...756..127G}.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.27\\textheight]{elipses_seg_dre}\n\\end{center}\n\\caption{\\label{eli_seg_dre}\nParameters $r_0$, $\\gamma$ obtained from the power-law fit to the projected correlation functions of our spectral segregated samples. In red, the $1\\sigma$ confidence regions of the quiescent galaxies fit and in blue, the $1\\sigma$ confidence regions of the star-forming galaxies fit. For clarity, we show only the regions for the first and last redshift bin. Lines link the best-fit results for each sample across different redshift bins.\nFor comparison, we show as points with errorbars the results of \\cite{2011ApJ...736...59Z} and \\cite{coi08a} (see the text for details). The parameters and their 1-sigma variation have been calculated using the method described in Section~\\ref{sec:power}. For comparison, we plot the results obtained by 1) \\cite{2003MNRAS.344..847M} (2dF) at $z \\sim 0.01$, 2) \\cite{2011ApJ...736...59Z} (SDSS) at $z \\sim 0.05$, 3) \\cite{coi08a} (DEEP2) at $z \\sim 0.9$ and 4) \\cite{Skibba2013c} (PRIMUS) at $z \\sim 0.38$ and $z \\sim 0.6$.}\n\\end{figure}\n\n\n\n\nFig.~\\ref{eli_seg_dre} shows the same results at scales $0.2 < r_p < 10.0  h^{-1}$ Mpc. For this scale range, we can compare with the results from other authors. \nWe see again that the regions of parameter space occupied in the diagram for quiescent and star-forming galaxies are different.\nStar-forming galaxies present both lower exponent $\\gamma$ and lower correlation length $r_0$ than quiescent galaxies. These differences are significant at the 2$\\sigma$ level.\nThe value of $\\gamma$, exponent of the correlation function, is roughly constant for all redshift bins and is $\\sim 1.7$. \nA hint of evolution can be seen in the correlation length, since $r_0$ decreases from $r_0 \\sim 4.3$ to $r_0 \\sim 3 \\, h^{-1}$ Mpc with increasing redshift, which corresponds to a $\\sim2\\sigma$ change in $r_0$.\nThe values of the correlation function parameters reported by other authors for different samples at lower and similar redshift are compatible with the ALHAMBRA results shown here.\nIn the diagram we see that our fits are consistent with the points corresponding to the correlation function parameters of the active galaxies from the 2dFGRS \\citep{2003MNRAS.344..847M} at $z \\sim 0.01$, a blue subsample drawn from the SDSS-main  \\citep{2011ApJ...736...59Z} at $z \\sim 0.05$, a blue population of the DEEP2 redshift survey \\citep{coi08a} at $z \\sim 0.9$, and the blue sample from the PRIMUS survey \\citep{Skibba2013c} at $z \\sim 0.4$.\nThis result also agrees with the qualitative behaviour of the evolution  of the correlation length reported by \\citet{Meneux2006a} from the VVDS sample where they conclude that the clustering amplitude of the late-type star-forming galaxies remains roughly constant since $z\\sim 1.5$, although they found a slight rise of this amplitude at their larger redshift bin $1.2 < z <2.0$. \nHowever, one should bear in mind that \\cite{Meneux2006a} use a flux-limited sample, so this evolution may be affected by the change in luminosity of the samples.\nThe values of the correlation length reported by  \\citet{Meneux2006a} are slightly smaller than the values calculated here for the ALHAMBRA survey.\n\nQuiescent galaxies show stronger clustering than late-type star-forming galaxies.\nTheir correlation function parameters at large scales are nearly compatible within the errors with fixed values around $r_0 = 5 \\, h^{-1}$ Mpc and $\\gamma = 2$, but the clustering length is smaller than the one calculated at low redshift by \\citet{2003MNRAS.344..847M} for passive galaxies in the 2dFGRS and by \\citet{2011ApJ...736...59Z} for the red galaxies in SDSS.\nInstead, the values of the amplitude of the correlation function reported by \\citet{Skibba2013c} at $z \\sim 0.4$ for PRIMUS, by \\citet{coi08a} at $z \\sim 0.9$ for the DEEP2  and by \\citet{Meneux2006a} agree with our results within the errors. \n\nFor both star-forming and passive galaxies, the only discrepant measurement in Fig.~\\ref{eli_seg_dre} is that corresponding to the PRIMUS samples at $z \\sim 0.6$, which show values of $r_0$ significantly larger than those obtained by ALHAMBRA at similar redshifts (and also by DEEP2 at $z \\sim 0.9$). \nThis difference may be due to the fact that the PRIMUS survey includes the COSMOS field, which contains a large overdensity at this redshift affecting the clustering measurements (see the discussion in Section~\\ref{sec:seg}).\n\n\n\nThis segregation is generally explained by the tendency of red, quiescent or early-type galaxies to form in dense environments, while blue, star-forming or late-type galaxies typically form in the field or in low mass haloes \\citep{1980ApJ...236..351D,2003MNRAS.346..601G,2004ApJ...608..752B, 2005ApJ...621..673T, 2009A&A...508.1217Z, McNaught-Roberts2014a}. \n\n\n\n\n\n\n\n\\subsection{Dependence of the bias on spectral type and redshift}\n\\label{sec:depend-bias-spectr}\n\nIn order to disentangle the evolution of the galaxy clustering of different populations from the overall growth of structure, we study the bias $b$ of our samples based on the projected correlation function measurements.\nWe use a simple linear model, with a constant and scale-independent bias.\nIn this model, the galaxy projected correlation function is given by\n\n", "index": 27, "text": "\\begin{equation}\n\\label{eq:modelbias}\nw_p(r_p) = b^2 w_p^m(r_p) \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"w_{p}(r_{p})=b^{2}w_{p}^{m}(r_{p})\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>w</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>w</mi><mi>p</mi><mi>m</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>p</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]