[{"file": "1601.07731.tex", "nexttext": "\n\\end{widetext}\nwhere P is the pressure (GPa), $V_0$ is the volume at ambient pressure, $V$ is the deformed volume, $B_0$ is the bulk modulus (GPa), and $B_0^\\prime$ is the pressure derivative of the bulk modulus.\nAll 3 parameters, $V_0$, $B_0$, and $B_0^\\prime$ have been fitted simultaneously using software EoSFit7 ~\\cite{Angel14}.\nThe cell volumes determined at ambient pressure have been included in the fit since the data were measured by the same experimental method as the data obtained at the high pressures and therefore are the subject of the same experimental errors.\\\\\nIt is difficult to reveal a phase transition from pressure-volume (P-V) plot, especially when pressure induced volume change is small. Thus, we used so-called $F-f$ plot\\cite{Anderson95} to verify a suspicion for possible phase transitions. This plot shows a dependency of the normalized stress $F$:\n\n\n", "itemtype": "equation", "pos": 8255, "prevtext": "\n\n\n\n\n\n\n\\title{High-pressure studies of MSb$_3$ (M = Fe, Co) at quasi-hydrostatic conditions} \n\n\n\n\n\n\n\n\n\n\n\\author{P.Alexeev}\n\\affiliation{DESY}\n\\author{K.Glazyrin}\n\\affiliation{DESY}\n\\author{I.Sergeev}\n\\affiliation{DESY}\n\\author{J.Bednarcik}\n\n\n\\affiliation{DESY}\n\\author{R.P.Hermann}\n\\affiliation{ORNL}\n\n\n\n\n\n\n\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe present a comparative study of the unfilled CoSb$_3$ and FeSb$_3$ skutterudites and report on their compressibility studied by high-pressure synchrotron X-ray diffraction. The equation of state for FeSb$_3$ was received for the first time. The third order Birch-Murnaghan isothermal equations of state were fitted to the experimental data in the pressure ranges atm-34 GPa for CoSb$_3$ and atm-14 GPa for FeSb$_3$.  Bulk moduli of 95(5) GPa and 86(4) GPa have been obtained for CoSb$_3$ and FeSb$_3$, respectively. The bulk modulus of FeSb$_3$ is in a contrast by about 30\\% with literature value obtained indirectly.\nAnomaly was observed in the diffraction pattern of CoSb$_3$ at the pressures 34.4-39.6 GPa which is most probably reasoned by structure transition.\n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle \n\n\n\n\\section{Introduction}\nFilled skutterudite compounds represent a wide, interesting class of thermoelectric materials. They attract attention by combination of two contrasting physical properties: high electrical conductivity, comparable to that of the narrow band gap semiconductors, and a low thermal conductivity similar to the glasses ~\\cite{SLK94, Sales96, SLK95}. A myriad of interesting transport properties has been observed in the filled skutterudites: metal-insulator transitions, conventional and unconventional superconductivity, heavy-fermion behavior, magnetic ordering ~\\cite{Shirotani97, Bauer02, Sales03, Bauer04, Xing15}. Recent studies of these compounds reveal a strong dependency of these parameters on the structure and doping by rare-earth atoms \\cite{Sales96}. A comprehensive understanding of physics behind the transport properties of filled skutterudites requires an insight on structure, its elastic response of unfilled framework structure to stresses and strains induced by doping \\cite{Sales03}.\\\\\nThe framework of the filled skutterudites is built by parent compound, binary skutterudite $OMX_3$ with $O$, $M$ and $X$ being a vacancy, a d-metal, and a pnictogen atom, respectively. At ambient pressure the structure of the framework is cubic of type $CoAs_3$ with the space group $Im\\overline{3}$ (\\#204) and 8 molecules per unit cell. Each unit cell has 2 atoms of sort $M$ residing in the positions 8c, 6 atoms of sort $X$ occupying  the positions 24g, and 2 vacancies which are located in the positions 2a ~\\cite{Sales96, SLK95}.  In the filled skutterudites, the vacancies are typically filled by rare-earth atoms which 'rattle' around the equilibrium positions and scatter the phonons, thus reducing thermal conductivity ~\\cite{Sales96, SLK95, Nolas98}.\\\\\nAt present the most studied skutterudites have their frameworks built by Co$_{4}$Sb$_{12}$ polyanion. However, only a limited degree of filling can be achieved for this framework ~\\cite{Sales96, Nolas98}. The recent study has demonstrated that substitution of Co by Fe increases the upper limit for filling fraction \\cite{Sales00}. Notably that Fe$_{4}$Sb$_{12}$ with 716 electrons/unit cell and Co$_{4}$Sb$_{12}$ with 720 electrons/unit cell can be considered as almost isoelectronic compounds but FeSb$_3$ demonstrates smaller average phonon group velocity and phonon softening compared to CoSb$_3$, thus promises lower thermal conductivity\\cite{Anne11, Pera15}. The increased filling fraction and the later observation raised the application potential of Fe$_{x}$Co$_{x-4}$Sb$_{12}$ and Fe$_{4}$Sb$_{12}$  and stimulated synthesis attempts further. \\\\\nInterestingly, the parent compound FeSb$_3$ has not been fully studied yet owning to that the synthesis became possible only recently ~\\cite{Williams01, Anne11, Daniel15}. To the best of our knowledge, the elastic properties of FeSb$_3$  have not been characterized under high-pressure yet. They are, however, of great importance as they shed light on structure stiffness. An enhanced stiffness of an unfilled skutterudite indicates that its framework may accommodate larger atoms without affecting structural integrity \\cite{Anderson95}.\\\\\nHere we report on a high-pressure X-ray diffraction study of CoSb$_3$ and FeSb$_3$ at the similar quasi-hydrostatic conditions. The results allow us to quantify compression of the materials, measure their bulk modulus at ambient and high pressures. Moreover, the obtained data provide access to the structural stability and heat transport parameters of the compounds.\\\\\nWith respect to the high pressure behavior of CoSb$_3$, we discuss the problem of the 'self-insertion'  \\cite{Kraemer07, Matsui12}. This effect is the pressure induced displacement of the $X$ atoms from framework 24g positions into vacant 2a sites. Self-insertion process can lead to formation of a new interesting thermoelectric compounds, e.g. Sb$_x$CoSb$_{3-x}$ in case of CoSb$_3$. Indeed, it was demonstrated recently that the skutterudite Sb$_x$CoSb$_{3-x}$ has an increased $ZT$ figure of merit compared to that of the parent compound\\cite{Fugi14, Miotto11}. Thus, an understanding of the self-insertion effect is the key for improvement of performance of this thermoelectric material. In addition, we note that the previous studies of parent CoSb$_3$ \\cite{Kraemer07, Matsui12} were carried out at non-hydrostatic conditions and the equation of state as well as the understanding on physics behind the 'self-insertion' should be revisited.\n\n\\section{Experimental aspects}\nThe FeSb$_3$ sample has been produced by elemental modulated reactant method (EMRM)\\cite{Williams01, Anne11} in a form of thin films. The samples have been scratched from the substrate and grounded to a fine powder with grain size smaller than 10 $\\mu$m. In case of FeSb$_3$ the sample was a mix of FeSb$_3$ and Si powders. Si additive was used as a internal calibrant for pressure and temperature in this case. CoSb$_3$ sample has been produced by chemical synthesis (please check either that is correct) and grounded to a fine powder.\\\\\nWe used symmetric diamond anvil cells (DAC) of Mao-type with 300 $\\mu$m culets and Rhenium gaskets to constrain the samples and the pressure medium in each run. The gasket plate was pre-indented to a thickness of about 30 $\\mu$m, and a hole of about 150 $\\mu$m in diameter has been drilled by electric discharge machine. The ruby spheres have been loaded into the sample enclosure in the DAC together with Ne pressure medium and the pressure was measured from the shift of the luminescence line of the ruby spheres using standard calibration procedures after Ref.\\cite{Mao86} in the pressure range atm-8 GPa and after Ref.\\cite{Dewaele08} at the higher pressures.\n\\\\\n Our experiment has been performed at P02.2 extreme conditions beamline of the PETRA III light source \\cite{Liermann10}. The experimental pressure range was atm-39.6 GPa for CoSb$_3$ and atm-42.4 GPa for FeSb$_3$ and the wavelength of 0.2893 \\r{A} was employed. In addition to the high pressure data we have measured ambient pressure lattice parameters of FeSb$_3$ at the high resolution powder diffraction beamline P02.1 of the PETRA III light source using the wavelength  of 0.2078 \\r{A}.  The 2D-detector (Perkin-Eimer XRD1621) with the pixel size 200 $\\mu$m has been used in both experiments while the distance from sample to detector was 518.633 and 2061.472 mm in the experiments at the high-pressures and in the experiments at ambient pressure, respectively. For the high-pressure experiments the beam was focused by compound refractive lenses to the size approximately 3x8 $\\mu$m$^2$.\nThe obtained two-dimensional patterns were integrated by Fit2D program \\cite{Hammers97} and the received one-dimensional $\\Theta-2\\Theta$ patterns were analyzed by JANA program \\cite{Petricek14} within the le Bail data analysis. Good quality of ambient pressure data allowed us to carry out Rietveld analysis.\\\\\nThe compressibility data have been approximated by a least-square fit to the third order Birch-Murnaghan equation of state (B.-M. EoS):\n\n\\begin{widetext}\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:bm}\n\\resizebox{0.8\\textwidth}{!}\n{$\nP(V)=\\frac{3B_0}{2}\n\\left[\\left(\\frac{V_0}{V}\\right)^\\frac{7}{3} -\n\\left(\\frac{V_0}{V}\\right)^\\frac{5}{3}\\right]\n\\left\\{1+\\frac{3}{4}\\left(B_0^\\prime-4\\right)\n\\left[\\left(\\frac{V_0}{V}\\right)^\\frac{2}{3} - 1\\right]\\right\\}\n$}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1.m1\" class=\"ltx_Math\" alttext=\"P(V)=\\frac{3B_{0}}{2}\\left[\\left(\\frac{V_{0}}{V}\\right)^{\\frac{7}{3}}-\\left(%&#10;\\frac{V_{0}}{V}\\right)^{\\frac{5}{3}}\\right]\\left\\{1+\\frac{3}{4}\\left(B_{0}^{%&#10;\\prime}-4\\right)\\left[\\left(\\frac{V_{0}}{V}\\right)^{\\frac{2}{3}}-1\\right]\\right\\}\" display=\"inline\"><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>V</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>B</mi><mn>0</mn></msub></mrow><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>V</mi><mn>0</mn></msub><mi>V</mi></mfrac><mo>)</mo></mrow><mfrac><mn>7</mn><mn>3</mn></mfrac></msup><mo>-</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>V</mi><mn>0</mn></msub><mi>V</mi></mfrac><mo>)</mo></mrow><mfrac><mn>5</mn><mn>3</mn></mfrac></msup></mrow><mo>]</mo></mrow><mo>⁢</mo><mrow><mo>{</mo><mrow><mn>1</mn><mo>+</mo><mrow><mfrac><mn>3</mn><mn>4</mn></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msubsup><mi>B</mi><mn>0</mn><mo>′</mo></msubsup><mo>-</mo><mn>4</mn></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>V</mi><mn>0</mn></msub><mi>V</mi></mfrac><mo>)</mo></mrow><mfrac><mn>2</mn><mn>3</mn></mfrac></msup><mo>-</mo><mn>1</mn></mrow><mo>]</mo></mrow></mrow></mrow><mo>}</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07731.tex", "nexttext": "\n\non the Eulerian strain $f$:\n\n\n", "itemtype": "equation", "pos": 9441, "prevtext": "\n\\end{widetext}\nwhere P is the pressure (GPa), $V_0$ is the volume at ambient pressure, $V$ is the deformed volume, $B_0$ is the bulk modulus (GPa), and $B_0^\\prime$ is the pressure derivative of the bulk modulus.\nAll 3 parameters, $V_0$, $B_0$, and $B_0^\\prime$ have been fitted simultaneously using software EoSFit7 ~\\cite{Angel14}.\nThe cell volumes determined at ambient pressure have been included in the fit since the data were measured by the same experimental method as the data obtained at the high pressures and therefore are the subject of the same experimental errors.\\\\\nIt is difficult to reveal a phase transition from pressure-volume (P-V) plot, especially when pressure induced volume change is small. Thus, we used so-called $F-f$ plot\\cite{Anderson95} to verify a suspicion for possible phase transitions. This plot shows a dependency of the normalized stress $F$:\n\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq:F}\nF=\\frac{P}{3f(1+2f)^{5/2}}  \t\t\t\t\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"F=\\frac{P}{3f(1+2f)^{5/2}}\" display=\"block\"><mrow><mi>F</mi><mo>=</mo><mfrac><mi>P</mi><mrow><mn>3</mn><mo>⁢</mo><mi>f</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>f</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>5</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.07731.tex", "nexttext": "\n\nA change in the slope of $F$ reveals discontinuity in the bulk compressibility, $B_0$, or its derivative, $B_0^\\prime$. Thus, the $F-f$ plot can be used to image changes in mechanical properties and lattice dynamics \\cite{Anderson95}.\n\n\\section{Results}\n\\subsection{CoSb$_3$ and FeSb$_3$ at atmospheric pressure}\nThe crystal structure of the both compounds is described by $Im\\overline{3}$ (\\# 204) space group at ambient pressure. For CoSb$_3$ we observe an excellent agreement between V$_0$ obtained by us and the values reported in the literature (see Table \\ref{Table1}). Refinement of the diffraction pattern for FeSb$_3$ (s. Fig \\ref{diffrfe}) delivers V$_0$ much lower than that given in the literature (see Table \\ref{Table1}). We strongly believe that this prominent discrepancy can be attributed to the differences in the material preparation procedures. In the works \\cite{Hornb97,Anne11,Daniel15} FeSb$_3$  was in the form a thin film deposited on substrates which is easy to bend, while in our study the material was in a form of powder and has undergone substantial grinding in the agate mortar. Thus the material was less affected by additional strains attributed to the sample-substrate interface in our case. The work \\cite{Daniel15} gives the lattice constant lower than in the Ref. \\cite{Anne11}. The similarly lower lattice constant was obtained in the work with FeSb$_3$ thin film annealed at 250$^o$C for 7 hours (s. Table \\ref{Table1}) \\cite{Hornb97}. Therefore, the hypothesis about bending of the substrate in the works \\cite{Anne11, Daniel15} can be reliable. The effect of the strain can indeed explain a strong scatter of V$_0$ reported in literature \\cite{Hornb97,Anne11,Daniel15} and therefore the observation should be taken into account as measurements of the elastic properties of the strained thin films are by default modified and do not represent bulk properties of the material.\n\n\\begin{figure}[ht]\n\\includegraphics[width=0.6\\linewidth]{pattfesb3.eps}\n\\caption{\\label{diffrfe}Diffraction patterns of FeSb$_3$ at ambient pressure: measured (black) and refined by Rietveld method (red). The green stars show reflections from Si admixture \\cite{Ducl90}}\n\\end{figure}\n\n\\begin{table}[h]\n\\caption{\\label{Table1} Lattice constants of CoSb$_3$ and FeSb$_3$ at ambient conditions}\n\\begin{tabular}{l c c c c}\n\\hline\n\\hline\nWork\t& $a_0$, \\r{A} & Synthesis method & Sample form\\\\\n\\hline\t\n\\textbf{CoSb$_3$} & & &\\\\\n\\hline\t\nThis work &\t9.03708(9)  & chemical synthesis & powder\\\\\n\\hline\t\nThis work, from EoS &\t9.038 & &\\\\\n\\hline\t\nRef \\cite{Anne11} &\t9.0320(8) & chemical synthesis  & powder\\\\\n\\hline\n\\textbf{FeSb$_3$} & & &\\\\\n\\hline\t\nThis work\t& 9.0553(3)  & EMRM & powder\\\\\n\\hline\nThis work, from EoS &\t9.0556 & &\\\\\n\\hline\nRef. \\cite{Anne11} &\t9.2383(6) & EMRM & powder on a tape\\\\\n\\hline\nRef. \\cite{Daniel15} &\t9.154 & MBE & thin films\\\\\n\\hline\nRef. \\cite{Hornb97} & 9.1762(3) & EBPVD and annealing 250$^o$C for 7 h & thin films\\\\\n\\hline\t\n\\hline\t\n\\end{tabular}\n\\\\\n\\it EoS: equation of state; EMRM: elemental modulated reactant method; MBE: molecular beam epitaxy; EBPVD: electron-beam physical vapor deposition \\rm\n\\end{table}\n\n\\subsection{CoSb$_3$ and FeSb$_3$ in the pressure range atm-34 GPa}\nIn the Figure \\ref{pv} we show experimental data on material volume as a function of pressure. The relative deviations Rp and wRp between the experimental and the modeled pattern are not higher than 0.7 and 1.2, respectively, at the pressures below 34.4 GPa for CoSb$_3$ and below 14 GPa for FeSb$_3$.\n\n\\begin{figure}[ht]\n\\includegraphics[width=\\linewidth]{eos.eps}\n\\caption{\\label{pv}Volume of the unit cell for CoSb$_3$ and FeSb$_3$ as a function of pressure. The red and blue curves are the Birch-Murnaghan equations of state for CoSb$_3$ and FeSb$_3$, respectively. The green stars show structural transitions of Si admixture in FeSb$_3$\\cite{Ducl90}}\n\\end{figure}\n\n\\begin{figure}[ht]\n\\includegraphics[width=\\linewidth]{vbyv.eps}\n\\caption{\\label{volvol}Pressure dependency of volume of the FeSb$_3$ unit cell. Data are normalized on the volumes of the CoSb$_3$ unit cell calculated from EoS. The green stars indicate structural transitions of Si in FeSb$_3$\\cite{Ducl90}}\n\\end{figure}\n\nThe experimental P-V data can be approximated by EoS in the pressure range atm-34 GPa for CoSb$_3$ and atm-14 GPa for FeSb$_3$. The fit parameters V$_0$, $B_0$, and $B_0^\\prime$ are shown in the Table \\ref{Table2}. Here, the reduced $\\chi^2$ statistical test criterium of the goodness of fits is 0.0689 for the both fits.\nThe fit of the experimental data for FeSb$_3$ is possible for the pressure range atm-42.4 GPa, however, the reduced $\\chi^2$ for this fit will be 0.1872. A poor quality of data due to the silicon admixture in FeSb$_3$ is the reason of the increased error of the fit. At the pressures 11-15 GPa silicon structure changes from cubic to tetragonal\\cite{Hanfl99, Hu86} and additional reflections from silicon appear in the diffraction patterns at the pressures higher than 14.7 GPa, overlaping the reflections of FeSb$_3$ and impeding the determination of the lattice constant. \\\\\nThe bulk modulus of CoSb$_3$ has been determined from the fit as 95(5) GPa. This value is in a very good agreement with the literature data 93(6) GPa\\cite{Kraemer05, Kraemer07}. Bulk modulus for FeSb$_3$ was obtained as 86(4) GPa, being about 30\\% higher compared to the literature value \\cite{Anne11} obtained indirectly.\\\\\nThe F-f plot for CoSb$_3$ and FeSb$_3$ is shown in the Figure \\ref{ff}. For CoSb$_3$, we observe that the normalized stress F is nearly constant in the pressure range atm-34.4 GPa. This allows us to state that CoSb$_3$ skutterudite does not undergo structural transitions up to the pressure 34 GPa which is higher than the values reported previously \\cite{Kraemer07, Matsui12}.\\\\\nFor FeSb$_3$ we observe as least 4 knot points in the F-f plot: at 14, 21, 30, and 34 GPa. Here, it is notable that F is constant in the pressure ranges atm-14, 21-30, 34-42 GPa. Constant value of F shows that during fit the $B_0^\\prime$=4 and a change of structure is not probable. The positive slope of F indicates a possible structural change in the pressure ranges 14-21 and 30-34 GPa. In the range 14-21 GPa the change is probably reasoned by non-hydrostatic condition due to the structural transition of the Si admixture. Indeed, the width of the reflection (1 0 3) in FeSb$_3$ has a monotonic increase at the pressures higher than 30 GPa (Fig.\\ref{refl}). This fact can be a sign of increased stress and most unlikely a change in the structure as it is the case in CoSb$_3$ (see the next section). The increased stress is most probable due to the non-hydrostatic conditions in this pressure range.\n\n\\begin{figure}[ht]\n\\includegraphics[width=\\linewidth]{Ff.eps}\n\\caption{\\label{ff}F-f plot for CoSb$_3$ and FeSb$_3$. The green stars show structural transitions of Si admixture in FeSb$_3$\\cite{Ducl90}}\n\\end{figure}\n\n\\begin{figure}[ht]\n\\includegraphics[width=\\linewidth]{widths.eps}\n\\caption{\\label{refl}Pressure dependency of the width of the (1 0 3) reflection in CoSb$_3$ and FeSb$_3$}\n\\end{figure}\n\nWe can state from our measurements that the volume of the unit cell of FeSb$_3$ decreases with pressure by nearly the same ratio as it is for CoSb$_3$. The relative difference is approximately 0.5\\% in the pressure range atm-15 GPa which in smaller than the error in the determination of the lattice constant (Fig.\\ref{volvol}). The difference values are influenced by phase change of the Si admixture at the pressures larger than 14 GPa.\n\n\\begin{table}[ht]\n\\caption{\\label{Table2} Results of the fit by Birch-Murnaghan equation of state for CoSb$_3$ and FeSb$_3$}\n\\begin{tabular}{  l  c  c  c}\n\\hline\t\n\\hline\t\nFit parameter\t& CoSb$_3$ & FeSb$_3$ & FeSb$_3^*$ \\\\\n\\hline\t\nV$_0$, \\r{A}$^3$ &\t737.7(22) & 742.6(6) &\t742.2(6) \\\\\n\\hline\t\nB$_0$, GPa & 95(5) & 86(4) & 91(1) \\\\\n\\hline\t\n$B_0^\\prime$ & 4.1(4)\t& 5.3(8) & 4 \\\\\n\\hline\n\\hline\t\n\\end{tabular}\n\\\\\n\\it *: $B_0^\\prime$ is fixed\\rm\n\\end{table}\n\n\\subsection{CoSb$_3$ and FeSb$_3$ in the pressure range 34-40 GPa}\n\nThere is an interesting change in the diffraction pattern of CoSb$_3$ at 34.4 GPa (Fig. \\ref{diffr}). The widths of the reflections increase abruptly at this pressure (Fig. \\ref{refl}). Furthermore, it is clearly seen that the (2 2 4) reflection do split at the pressure 34.4 GPa (Fig. \\ref{diffr}).\nWe note that the structural change of CoSb$_3$ observed by us has been seen before \\cite{Kraemer07, Matsui12}, however, the splitting of the reflections was probably not resolved in the works \\cite{Kraemer07, Matsui12}. In that studies the pressure point of the change was predicted to reside between 20 GPa and 35 GPa \\cite{Kraemer07, Matsui12}. Neon used in our study provides better hydrostatic conditions in the sample enclosure upon increase of the pressure, in contrast to methanol-ethanol and methanol-ethanol-water pressure media \\cite{Batchelder67, Hazen84} used in the works \\cite{Kraemer07, Matsui12}. The usage of neon as pressure medium allowed us to determine the pressure point more precisely.\\\\\nInterestingly, we observe a change in diffraction pattern of CoSb$_3$ at the pressure 34.4 GPa, namely several reflections become broader or split (Fig. \\ref{diffr}). Recently, it has been shown that the abrupt increase of the widths of reflections is a typical evidence of a structural transition in the pnictide compounds with similar structure\\cite{Mart11, MCG08, Mart09, Marty11}. The abrupt increase of the widths (Fig. \\ref{refl}) and the splitting of the reflections (Fig. \\ref{diffr}) can thus be interpreted as the marks of a structural transition. The reason of the transition is not clear for us, it could probably be induced by non-hydrostacity and the uniaxial compression of the sample at this pressure.\n\n\\begin{figure}[ht]\n\\includegraphics[width=0.9\\linewidth]{twotheta.eps}\n\\caption{\\label{diffr}Evolution of diffraction patterns with pressure for CoSb$_3$ and FeSb$_3$. Green and pink stars show peaks from Si phases}\n\\end{figure}\n\nNo significant changes were observed in the diffraction pattern for FeSb$_3$ (Fig. \\ref{diffr}) up to 40 GPa, although the width of the (1 0 3) reflection increases monotonically in the pressure range 30-40 GPa. Such increase is characteristic for the appearance of mechanical stress in the sample and most unlikely for a structure transition. The increased stress and the shapes of the reflections (Fig. \\ref{diffr}) can be the signs of non-hydrostatic compression of FeSb$_3$ which starts to appear at 30 GPa and becomes more pronounced at 37 GPa, probably due to the impact of the Si admixture.\n\n\\section{Conclusions}\n\nAs a conclusion, we measured compressibility of the unfilled CoSb$_3$ and FeSb$_3$ skutterudites by high-pressure synchrotron X-ray diffraction. Ne pressure medium provided conditions close to hydrostatic.\nThe experimental data have been approximated by third order Birch-Murnaghan isothermal equations of state in the pressure ranges atm-34 GPa for CoSb$_3$ and atm-14 GPa for FeSb$_3$. Notably, the equation of state for FeSb$_3$ has been received for the first time. The bulk moduli have been derived as 95(5) GPa and 86(4) GPa for CoSb$_3$ and FeSb$_3$, respectively. The bulk modulus of FeSb$_3$ is about 30\\% higher compared to the literature value obtained indirectly. No significant difference in the volumes of the unit cells of CoSb$_3$ and FeSb$_3$ was observed in the pressure range atm-14 GPa.\nThe anomaly in the diffraction pattern of CoSb$_3$ have been observed at the pressures 34.4-39.6 GPa. The anomaly is most probably due to a change in the crystal structure induced by the uniaxial compression of the sample. We note that the anomaly was not observed in the diffraction pattern of FeSb$_3$ up to 40 GPa, however, the compressibility data might be influenced by the non-hydrostacity in the pressure range 30-40 GPa.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{apsrev4-1}\n\\bibliography{paperbib}\n\n\n", "itemtype": "equation", "pos": 9549, "prevtext": "\n\non the Eulerian strain $f$:\n\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:f}\nf(V)=\\frac{1}{2} \\left[\\frac{V_0}{V}^{\\frac{2}{3}}-1\\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"f(V)=\\frac{1}{2}\\left[\\frac{V_{0}}{V}^{\\frac{2}{3}}-1\\right]\" display=\"block\"><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>V</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><msup><mfrac><msub><mi>V</mi><mn>0</mn></msub><mi>V</mi></mfrac><mfrac><mn>2</mn><mn>3</mn></mfrac></msup><mo>-</mo><mn>1</mn></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}]