[{"file": "1601.02069.tex", "nexttext": "\n\n\\noindent\nwhere the initial frequency, $f_0$, or the {\\em base frequency} will be\na time-constant: $f_0(t)=f_0=const$, and factors $m_n(t)$ for $n>0$,\ncorrespond to transposition tones for time $t$ of a harmonic sequence of level $n$, and\n$m_0(t)$ corresponds to the instrument score. Each $m_n(t)$ time sequence\nis selected from the corresponding $n$-level scale\n$S_n$ as: \n\n\n", "itemtype": "equation", "pos": 18194, "prevtext": "\n\n\n\n\n\n\\title{Dynamic Transposition of Melodic Sequences on Digital Devices}\n\n\\author{\nA.V. Smirnov,\nandrei.v.smirnov@gmail.com. \n\n\n\n}\n\n\\maketitle \n\n\\sffamily\\mdseries\n\n\\begin{abstract}\nA method is proposed which enables one to produce musical compositions by using\ntransposition in place of harmonic progression.  A transposition scale is\nintroduced to provide a set of intervals commensurate with the musical scale,\nsuch as chromatic or just intonation scales.  A sequence of intervals selected\nfrom the transposition scale is used to shift instrument frequency at\npredefined times during the composition which serves as a harmonic sequence of\na composition.  A transposition sequence constructed in such a way can be\nextended to a hierarchy of sequences.  The fundamental sound frequency of an\ninstrument is obtained as a product of the base frequency, instrument key\nfactor, and a cumulative product of respective factors from all the harmonic\nsequences.  The multiplication factors are selected from subsets of rational\nnumbers, which form instrument scales and transposition scales of different\nlevels.  Each harmonic sequence can be related to its own transposition scale,\nor a single scale can be used for all levels.  When composing for an orchestra\nof instruments, harmonic sequences and instrument scales can be assigned\nindependently to each musical instrument.  The method solves the problem of\nusing just intonation scale across multiple octaves as well as simplifies\nwriting of instrument scores.\n\n\\end{abstract}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\nRepetition is one of the main elements of music.  Indeed, a common technique\nused in composition is a repetition of a melodic sequence in different keys.\nThe change of keys introduces another important element of music, that of\ngradual change (harmonic/chord progression or sequence), which removes the\nmonotony of a simple repetition. In principle, the change of key in harmonic\nprogression amounts to a frequency shift and can be done by transposition.  For\nexample, the technique of using barre chords when playing a guitar does exactly\nthat, and this greatly enhances the versatility of the instrument.  Another example is a tuning slide of a trombone.\n\nTo accomplish the same on a key-based instrument one can supply such instrument\nwith extra transposition keys. This set of keys can be used during the\nperformance to transpose the instrument each time the change of harmonic key\nneeds to be done within the composition. In this case the melody can be played\nas if it always stays in the same key, which simplifies playing technique.\nAlso, a number of keys in an octave of such instrument can be reduced to only\nthe keys which form harmonic intervals, since most melodic sequences tend to\ncomply to these intervals. For example, in chromatic scale one would use 8\ntones, including major and minor triads, instead of 12 semitones. \n\nFor example, the octave in a conventional chromatic scale is sub-divided into\n12 intervals (semitones). Thus, in an instrument with a range of three octaves\none would need 36 buttons (or instrument keys) to play all notes. However, one\ncan achieve essentially the same by using six buttons for playing the notes and\nother six buttons to do the transposition.  This will result in a three-fold\nreduction in the number of instrument keys (or buttons), and the reduction will\nbe greater if more octaves are involved.  Moreover, since most melodies when\nplayed in the same musical key use only a small subset of 12 semitones, one can\nassign the scale tones to the play buttons and use the transposition buttons\nfor switching the musical keys.  For example, one could use only eight tones of\nthe chromatic scale, including major and minor triads, instead of 12 semitones.\nThis way one will only engage the transposition keys when changing the musical\nkey, therefore simplifying the performance.  \n\nThere is another important advantage of such an instrument. Unlike a\nconventional keyboard or a guitar, it can be made to play in scales other than\nchromatic scale. One can easily assign the frequencies of a Pythagorean or just\nintonation scale to the keys of such instrument.  This is because the\nuniformity of musical intervals within the octave is no longer required, since\nthe scale played by the instrument keys is easily transposed to different\nmusical keys.\n\nThis kind of transposition cannot be easily accomplished on an acoustic\ninstrument. For example, the barre technique on a guitar will fail because\ntransposition in a just intonation scale will require simultaneous re-tuning of\nall the strings.  This is because just intervals are not uniform across the\noctave as in chromatic scale.  On the other hand, an electronic instrument or a\ncomputer sequencing application can easily accommodate such technique which we\nshall refer to as {\\em dynamic transposition} and which is the main subject of\nthis work.\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{The Choice of Scale}\n\nOne limitation of a standard chromatic scale used in music\ntoday is the inexact representation of harmonic tones, as derived from\nthe physics of resonating strings \\cite{WdPM1980}. Harmonic frequencies\ndiffer by rational multipliers,  for example 2, 1/2,\n3/2, 3/4, 4/3. Sounds combined of such frequencies are usually pleasant\nto the ear.  This could be related to resonances caused by harmonic\nfrequencies inside the ear, or some more complex phenomena inside the\nbrain \\cite{LevYBM2007,CkMCCS2001}.  \nIndeed, earlier instruments were based on resonating strings, and were tuned to\nfollow these ratios which is reflected, for example, in Pythagorean scale\n\\cite{BnMTP2003}. Here we will refer to a {\\em rational scale} as a just\nintonation scale with intervals perceived as consonant.  A significant\nlimitation of a rational scale is that it is not {\\em transpositionally invariant} in\na sense that the same chords played in different keys will not sound the same\n(this definition differs somewhat from \\cite{MlIFATC07}).  This is because the\nintervals in a scale like 1, 6/5, 5/4, 4/3, 3/2, are not equal whereas in\nchromatic scale they are equally spaced on a logarithmic scale as is\nillustrated in Fig.\\ref{chromatic}. This makes it impossible to play the same\nmelody in different keys on a rational scale.  Thus, a scale derived from\nrational numbers can not be easily applied to a key-based instrument, such as a\npiano, or an organ.  Elaborate tuning systems and scales combined with novel\nkeyboard concepts have been devised to overcome this limitation\n\\cite{Fokker67,Fokker69,Fontville91,MlIFATC07}, but these techniques \n\nadded\nto the complexity of the keyboard and required extra technical skills from a performer.  In a addition to that a variety of sound\nsynthesis methods as well as spectral music techniques \\cite{SpectralMusic01}\nand frequency modulation synthesis \\cite{FMsynth73} have been developed, which\nfocus more on acoustical quality of sound rather than on composition techniques and melodic\nsequencing, and are outside of the scope of this work.\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=4.8in]{chromatic.png}\n\\caption{\\label{chromatic}~Frequencies of chromatic scale\n}\n\\vspace{5mm}\n\\parbox{4in}{\nNumber above each line added to one is equal to the scaling factor used to obtain the\nfrequency associated with that line. Red points correspond to the C-major scale.\n}\n\\end{figure}\n\nA number of composers and performers experimented in just intonation scale,\nmost notably, Harry Partch, James Tenney, and Ben Johnston. In particular,\nHarry Partch \\cite{HarryParth} did early experiments with tunings based on a larger number of\nunequal tones in the octave following just intonation and produced \ninstruments which could play in this scale. James Tenney started one of the early and\nsuccessful experimentations with electronic and computer generated music, in which\nhe resorted to more harmoneous scales, and improved the\nacoustic quality of sound.  Another approach \\cite{BenJonson06} is\nbased on extending the musical notation by introducing more intervals in line\nwith just intonation scale. This work demonstrated the advantages and\ndrawbacks of musical instruments and composition techniques based on \nsuch scales. However, the methods mentioned above did not rely on transposition as means\nof replacing harmonic progression in a sense the current work suggests.\n\nIn addition to that, a number of novel tuning methods have\nbeen researched and proposed over the years \\cite{CarlosTAC87}, including the\nasymmetric division of octave \\cite{SetharesRTT92} and adjusting the instrument\ntuning to timbre \\cite{SetharesTTSS2005}.  \nHowever these techniques either\nincrease the complexity of an instrument or like chromatic scale, they compromise\nthe purity of intervals derived from the rational scale. \n\nIndeed, frequencies produced by chromatic scale no longer differ by rational\nmultipliers, but rather by transcendental numbers resulting from the\nlogarithmic operation as is evident from Fig.\\ref{chromatic}. This is the\nreason why chords played on an acoustic piano sound more pleasantly than those\nplayed on an electronic keyboard, since the strings of an acoustic instrument\ncan self-adjust their frequencies due to the resonance effect. This makes them\nlapse to more pleasant rational intervals \\cite{CarlosTAC87}.\n\nThus, despite the advantages of just intonation and other rational scales, various technical problems \nprevented these techniques from gaining popularity.\n\n\n\n\n\n\n\nOne notable exception is a recent technique of program controlled tuning\n\\cite{Hermode11}, which actually enables one to play in just\nintonation scale on electronic keyboards. However, this technique only corrects\nmusical tuning when chords are played, i.e. several notes played simultaneously.\nIt does not simplify music sequencing by taking advantage of transposition, neither does it attempt to\nsimplify the instrument by and reducing the\ncardinality of the octave as discussed below. These simplifications constitute the essence of\ndynamic transposition technique which is discussed next.\n\n\n\\section{Dynamic Transposition}\n\nThere are two main techniques for shifting sound frequency in music: modulation\nand transposition.  Modulation has been mainly used for sound effects, or as an\noccasional semi-tone shift in a composition.  A wider frequency shift was\nmainly limited to octave shift in some electronic keyboards. Shifting of\ninstrument's frequency to a different key is commonly done with transposition.\nHowever, this shift is usually made permanent for the duration of the\nperformance. To author's knowledge neither modulation nor transposition have\nbeen widely used in place of harmonic progression, that is, to change current\nkey in a composition.  Nevertheless, such application will enable the usage of\nrational scales, simplify a keyboard instrument, as well as reduce the number\nof notes in an octave \\cite{SmirnovPat2013,Tectral15}. In particular it can simplify learning of of musical scales and enable easy to play instruments.\n\nIndeed, if we consider the number of tones in an octave, or cardinality, then\nwith the proposed technique it can be reduced to only the most harmonic musical\nintervals, such as those in a rational scale.  This is because the number of\nkeys in the octave can be made equal to the number of tones in the scale.  For\nexample, instead of selecting 7 keys for a chromatic scale out of 12 semitones\nin an octave, one is left with just 7 keys corresponding to 7 tones and no need\nfor selection.  And for simpler scales this number can be further reduced.\nNow, instead of a multitude of tonic combinations for every key one has a\nsingle scale, which is a set of basic ratios.  For example, instead of\nmemorizing major/minor tonic triads for every key, such as \"C,E,G\",\n\"C,$^\\flat$E,G\" for major/minor triads in C-key, etc.  (a total of\n2$\\cdot$12=24 combinations), one will have to remember only two combinations of\nratios: (5/4, 3/2) for a major triad and (6/5, 3/2) for a minor triad, the\nfirst number in the triad always being 1.  Shifting to different chords in a\nprogression will amount to multiplication of these numbers by a rational number\nselected from the currently used scale.  For example, a sequence (1, 9/8, 5/4,\n4/3, 3/2, 5/6, 15/8, 2) will resemble the chromatic major scale.\n\nWe will refer to an\noctave setup according to the rational scale as {\\em instrument scale}.  In this case a harmonic\nprogression can be replaced by a {\\em transposition sequence}, which we will\nalso refer to as a {\\em harmonic sequence} for clarity.  This harmonic\nsequence can be further generalized to a hierarchy of harmonic sequences\nof different levels.  A harmonic sequence on each level of hierarchy is\nderived from a {\\em transposition scale}, which is also a rational scale, i.e.\na subset of rational numbers.  Each transposition scale can be equal to the\ninstrument scale, or can differ from it, thus creating a {\\em multi-scale\ncomposition}.  Each harmonic sequence can be related to its own transposition scale, or\na single scale can be used for all levels.  Frequencies of sounds are obtained\nby multiplying the base frequency by the factor corresponding the current\ninstrument key selected from the instrument scale and by a cumulative product\nof factors selected from harmonic sequences on all levels and\ncorresponding to the current time interval in the composition.\n\n\nOne can also extend this method of multi-scale composition to a {\\em\nmulti-scale orchestra} of instruments.  In this case when composing for an\norchestra, harmonic sequences and scales can be assigned independently to\neach musical instrument.  This method also opens up opportunities of exploring\ndifferent musical scales that can exist within the realm of physical\nresonances.\n\n\n\n\\section{\\label{hs}Harmonic Sequences}\n\nIn the proposed system of generating musical sounds the fundamental\nfrequency of each sound is obtained as a product between the base\nfrequency and a cumulative product of rational multipliers. Looking from a\nslightly different perspective, the fundamental frequency is obtained as\na multiple of another frequency, which in turn can be obtained as a\nmultiple of yet another frequency, and so on. The multipliers can be\nselected from a subset of rational numbers, defined by simple ratios of\ntwo integers. \n\nIn the simplest case, which we shall refer to as a {\\em level-1} composition, the\nprocedure of creating a composition starts with a single {\\em base frequency}\nand a subset of rational numbers, further referred to as the {\\em instrument\nscale}, and each number in the set will be referred to as the {\\em instrument\nkey}.  Each sound in a composition is characterized by its fundamental\nfrequency, further referred to as the {\\em note frequency}, and the associated\ntime interval. The note frequency is obtained by multiplying the base frequency\nby a factor taken from the instrument scale and corresponding to the current\ninstrument key. We will refer to this number as the {\\em scale key}. \nThe pair consisting of the scale key and the corresponding time\ninterval will be referred to as the {\\em note}. \n\n\n\nThus, the procedure of level-1 composition sets for each time\ninterval in a composition a corresponding note frequency equal to a product of\nthe base frequency and one of the keys selected from the instrument scale.\nThis key selection can be done independently for each instrument.  The time\nintervals can be overlapping, thus allowing for playing chords.  This sequence\nof notes selected from the instrument scale will be referred to as the {\\em\ninstrument score}. The manner in which the instrument score is compiled is not\nimportant for this discussion and is presumably done by a composer.\n\n\nIn the next step this procedure is extended to {\\em level-2}\ncomposition (Fig.\\ref{scales}). In this case in addition to the base\nfrequency (A), instrument scale (D),\nand instrument score (E), there is another layer of\nrational numbers further referred to as the {\\em transposition scale}\n(B), inserted between the base frequency and the\ninstrument scale.  Similarly to the level-1 composition, a sequence of\nnumbers is selected from this scale and assigned to the corresponding time\nintervals, thus resulting in another sequence of key-time pairs, which\nwe will refer to as the {\\em harmonic sequence} (C), and each pair in the\nsequence will be referred to as the {\\em transposition tone}.  Unlike the notes of the\ninstrument score, time intervals of transposition tones should be\nnon-overlapping and span the entire composition.\nThus, in the notation of Fig.\\ref{scales}  \n$f_i^j$ represents the frequency \non $i$-th level, obtained from $j$-th key \nin $i$-th scale, $k_i^j$.\n\nSelection of transposition keys and associated time intervals to make up a\nharmonic sequence is done by a composer and it will determine the\nharmonic structure of the composition.\n\nAs an example consider the level-2 composition. Here the instrument sound frequencies ($f_2^j$) are determined as\ntriple products of the base frequency, transposition tones, and instrument\nkeys.  The selection of a transposition tone for each note is always\npossible and unique, because the time intervals of transposition tones are\nrestricted to be non-overlapping and span the entire composition.\nIn fact, the level-2 composition procedure corresponds to a conventional composition\nwhere the instrument score takes the place of a conventional\nscore and harmonic sequence takes place of a chord progression\n(harmony of the song). \nThe difference here is in simplification in the\ninstrument score due to the effect of frequency shift provided by transposition\nsequencing and simpler octave structure as discussed above.\n\n\\begin{figure}[h]\n\\centering\n\\fbox{\\includegraphics[width=4.6in]{scale.png}}\n\\caption{\\label{scales}~Assigning frequencies in level-2\ncomposition: \nA - base frequency, \nB - transposition scale, \nC - harmonic sequence, \nD - instrument scale, \nE - instrument score. \n}\n\\end{figure}\n\n\nOne can further generalize the above procedure to {\\em level-n}\ncomposition through an {\\em n}-step recursive frequency transformation which is\nspecified for each time, $t$, in the composition, as: \n\n\n", "index": 1, "text": "\\begin{equation}\nf_{n+1}(t) = f_n(t)m_n(t) = f_0\\prod_{i=0}^nm_i(t)\n\\label{fn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"f_{n+1}(t)=f_{n}(t)m_{n}(t)=f_{0}\\prod_{i=0}^{n}m_{i}(t)\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>f</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>m</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>f</mi><mn>0</mn></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>0</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>m</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02069.tex", "nexttext": "\n\n\\noindent\nwhere \n${\\hat{\\cal R}}_n^{(t)}$ denotes a generally time-dependent selection\noperator provided by a composer or an algorithm, and\nscale $S_n$ on level $n$ is an ordered\ncollection of keys, $k_n^i$, represented by a subset of \nrational numbers,\ni.e. \n\n\n", "itemtype": "equation", "pos": 18665, "prevtext": "\n\n\\noindent\nwhere the initial frequency, $f_0$, or the {\\em base frequency} will be\na time-constant: $f_0(t)=f_0=const$, and factors $m_n(t)$ for $n>0$,\ncorrespond to transposition tones for time $t$ of a harmonic sequence of level $n$, and\n$m_0(t)$ corresponds to the instrument score. Each $m_n(t)$ time sequence\nis selected from the corresponding $n$-level scale\n$S_n$ as: \n\n\n", "index": 3, "text": "\\begin{equation}\nm_n(t) = {\\hat{\\cal R}}_n^{(t)}S_n\n\\label{kn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"m_{n}(t)={\\hat{\\cal R}}_{n}^{(t)}S_{n}\" display=\"block\"><mrow><mrow><msub><mi>m</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><msub><mi>S</mi><mi>n</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02069.tex", "nexttext": "\n\n\n\n\n\n\n\n\nThe above requirement of non-overlapping time intervals in a harmonic\nsequence means that only the $0$-level selection\noperator, ${\\hat{\\cal R}}_{0}^{(t)}$, acting on the instrument\nscale in (\\ref{kn}), is allowed to generate multiple selections for the same value of $t$,\nthereby enabling chords in the instrument score. Chords have no obvious meaning\nfor a harmonic sequence as defined here.\n\nLet's now consider an example of level-3 composition. Here\nwe introduce a second\nharmonic sequence and optionally the associated transposition\nscale. The frequency of sound in this case will be determined as a product of\nthe base frequency, the key from the currently played note of a particular instrument\nscore, and the transposition tones from the harmonic sequences of levels 1 and 2, both corresponding to the current time interval.\nThus, according to (\\ref{fn}) the key note frequency in an instrument score will be determined as:\n\n", "itemtype": "equation", "pos": 19005, "prevtext": "\n\n\\noindent\nwhere \n${\\hat{\\cal R}}_n^{(t)}$ denotes a generally time-dependent selection\noperator provided by a composer or an algorithm, and\nscale $S_n$ on level $n$ is an ordered\ncollection of keys, $k_n^i$, represented by a subset of \nrational numbers,\ni.e. \n\n\n", "index": 5, "text": "$$S_n = \\mathop{\\bigcup}_{j}k_n^j$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"S_{n}=\\mathop{\\bigcup}_{j}k_{n}^{j}\" display=\"block\"><mrow><msub><mi>S</mi><mi>n</mi></msub><mo>=</mo><mrow><munder><mo mathsize=\"160%\" movablelimits=\"false\" stretchy=\"false\">⋃</mo><mi>j</mi></munder><msubsup><mi>k</mi><mi>n</mi><mi>j</mi></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02069.tex", "nexttext": "\n\n\n\n\n\nIn this case the instrument score is provided by sequence $m_0$, which\ncorresponds to a conventional score, harmonic sequence $m_1$ will\ncorrespond to a harmonic structure of a song, such as a sequence of keys\nassigned to different measures, e.g.  C, Am, F, G, and harmonic sequence\n$m_2$ can be related to a conventional transposition, which in this case will\nup/down-shift all frequencies in certain parts of the song.  The distinction\nfrom the conventional composition will be in simplification in the\ninstrument score, because the transition between different keys\n(chord progression) is already taken care of by the harmonic sequences. \nAnother simplification comes from the lower\ncardinality of the octave as well as from the fact that the\nproblem of selecting appropriate tones corresponding to a current melodic key\nno longer exists.\n\nIt should be noted that one can also use the reverse definition of sequences\n$m_i$, where the last sequence takes place of an instrument score and the rest\nperform the transposition, which corresponds to the illustration in\nFig.\\ref{scales}.\n\nIn the case of multiple instruments (orchestra) it is possible to\nassign different instrument scales to different instruments and even\nto direct them to follow different harmonic sequences.  In the\nsimplest case the base-level harmonic sequence may consist of a\nsingle tone, which will correspond to a transposition of that\ninstrument to a different frequency range for a duration of the\ncomposition.\n\nEven though in the proposed formalism one can use different transposition scales on\ndifferent levels in reality it\nwould seem most practical to use just one transposition scale on all levels.\nAlso, for human composers and performers it will probably be not very\npractical to go beyond level-3 composition.  Nevertheless, higher level\nmulti-scale compositions can be explored in algorithmically generated\ncompositions.\n\nIn summary, the method of dynamic transposition described here augments the\nconventional notions of transposition with the concepts of harmonic sequences\nand harmonic scales and the usage of rational numbers to relate note\nfrequencies to the base frequency through harmonic tones.\n\n\\section{Implementation}\n\n\\subsection{Music Sequencing}\n\nThe principles outlined above can be easily implemented in a\nmusic software by adapting standard\nMIDI-sequencer techniques. \nFor the purpose of this work an open source LMMS software  \n\\cite{David:2012:LCG:2432363} was installed on a Linux PC and modified to enable a level-3 composition as described in Sec.\\ref{hs}.\nThe new customized sequencer was used for manual composition in just intonation scale \\cite{Tectral15}.\n\n\\begin{figure}[h]\n\\centering\n\\fbox{\\includegraphics[width=4.0in]{keyboard.png}}\n\\caption{\\label{keyboard}~Instrument score or harmonic sequence in a \"piano\"-roll.\n}\n\\end{figure}\n\n\\begin{figure}[h]\n\\centering\n\\fbox{\\includegraphics[width=4.0in]{track.png}}\n\\caption{\\label{track}~Transposition sequence displayed as a track in a song editor.\n}\n\\end{figure}\n\nFig.\\ref{keyboard} shows a generic\npiano-roll type panel where piano keys are replaced with an ordered set\nof ratios, which can represent either instrument or transposition scales.\nThis setup can be used for entering instrument scores as well as\nharmonic sequences - all in a similar manner. It should be noted, that\nthe two octaves of numerical keys shown are all the keys needed\nto play an instrument. Shifting to higher or lower octaves can be done by\nharmonic sequencing.\n\n\nFig.\\ref{track} shows a generic view of a song editor, where along with\ntraditional instrument tracks a harmony track is added. In this case it\nprovides a global harmonic sequence for all instruments.\n\n\n\\subsection{Instruments}\n\nIt is also feasible to design electronic musical instruments based on\nthese principles.  If implemented in a keyboard fashion, such\ninstrument will require a small set of keys for a single octave or a\ncouple of octaves only.  The keys will correspond to a pre-defined\ninstrument scale. A common 7-tone scale will suffice for most purposes,\nresulting in a 7-key keyboard. But even simpler 4-6 key instruments could\nbe useful for playing basses or for less sophisticated game oriented\ndevices.  A transposition control for such instrument can be implemented\nin a separate key, knob, touch-pad, or similar. \n\nFigure~\\ref{keytar} provides two examples of possible instruments using dynamic transposition.\nAn even simpler implementation can be based on two joysticks each equipped\nwith several buttons. In this case one joystick can be used for playing the\nmusical tones and another for dynamic transposition. \n\n\\begin{figure}[h]\n\\centering\n\\subfloat[\"Soundgun\" with a transposition slider and dynamic transposition buttons.]{\\fbox{\\includegraphics[width=4.8in]{soundgun.png}}}\\\\\n\\subfloat[\"Keytar\" with dynamic transposition buttons.]{\\fbox{\\includegraphics[width=4.8in]{keytar.png}}}\n\\caption{\\label{keytar}~Model instruments based on dynamic transposition. \\\\\n(1) play buttons, (2) transposition buttons, (3) transposition slider, (4) transposition knob.\n}\n\\end{figure}\n\n\nWhole harmonic\nsequences can be programmed-in for the purposes of performance.\nIn this case switching between transposition tones in a sequence can\nbe done automatically, or by pushing a separate key.\n\n\n\\subsection{Notation}\n\nNo attempt is made in this work to introduce a musical notation to accompany\nthe proposed method. As long as the technique is not used for life performance\nno need for any specific notation arises. Indeed, in the current implementation\nall instrument scores and harmonic sequences are recorded and modified by\nmeans of a piano roll editor shown in Fig.\\ref{keyboard} and then stored in\nrespective computer files. The final result is an audio file used for playback,\nwhile the human-readable scores are available either via editor interface of\nthe respective sequencer application or in XML-encoded text files. The\nnotation used in those files is similar to the MIDI standard modified for\nhandling non-chromatic frequencies and harmonic sequences.\n\nNevertheless, a variety of specific musical notations can be developed for the\npurpose of life performance. This can be a simplification of the conventional\nnotation. For example, the accidentals can be dropped since the cardinality of\nthe octave is equal to the number of tones in the scale. Thus, all notes can be\nlabeled by plain letters, including those of harmonic sequences. Numerical\nlabeling by respective rational multiplies can be used for rigour or\ncolor labeling can be employed to enhance score readability in life performances.\nUltimately, the notation used should depend on the key layout of the\ninstrument so as to facilitate reading of the score.  Thus, with color labeled\nkeys the respective color labeling for the score would be appropriate.\n\nAlso, to simplify the performance, the harmonic sequence(s) can be stored and\nread by the instrument, while the performer will only read the instrument\nscore. In this case each change of harmonic key in chord progression can be\ndone either automatically by the instrument or manually by the performer, using\na single key or a foot pedal.\n\n\n\\section{Conclusions}\n\nAs mentioned in earlier, the limitation of a just intonation\nscale is in its inability to achieve transpositional invariance.  In the\nproposed method this limitation is overcome by introducing a generalized\ntransposition as a system of multiple scales, and hierarchical harmonic\nsequences derived from the sets of rational numbers. In this framework it is\nnow possible to replace harmonic progression with transposition of the base\nfrequency to any value, and do so independently for different instruments. In\nthis way one can play the same melodic sequence of tones in different keys and\nstill realize a simple rational scaling of the base frequency as well as to\nretain the uniformity of key patterns within any harmonic key, or indeed within\nany frequency range.  Thus, the proposed method enables the usage of musical\nscales beyond chromatic, including just intonation and other rational scales.\nFrom the perspective of physical reality of resonances and wave harmonics,\nfrequencies produced as rational multiples of the fundamental frequency are\nmore natural, and therefore tend to be more pleasant to human ear, which is\nindeed confirmed by old traditions and modern research.\n\n\nThe proposed method can be used for both composing music by means of sequencer\napplications and for life performances. It is mostly applicable to electronic\ninstruments, computers, and other sound-capable digital devices.  In addition\nto a more harmonious sound generation the method can simplify writing of\nmusical scores as well as playing instruments built on these principles. The\nmethod also opens the possibility of exploring multi-level transposition \ntechnique in algorithmic compositions.\n\n\n\n\n\\bibliographystyle{plain}\n\\bibliography{paper}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 19981, "prevtext": "\n\n\n\n\n\n\n\n\nThe above requirement of non-overlapping time intervals in a harmonic\nsequence means that only the $0$-level selection\noperator, ${\\hat{\\cal R}}_{0}^{(t)}$, acting on the instrument\nscale in (\\ref{kn}), is allowed to generate multiple selections for the same value of $t$,\nthereby enabling chords in the instrument score. Chords have no obvious meaning\nfor a harmonic sequence as defined here.\n\nLet's now consider an example of level-3 composition. Here\nwe introduce a second\nharmonic sequence and optionally the associated transposition\nscale. The frequency of sound in this case will be determined as a product of\nthe base frequency, the key from the currently played note of a particular instrument\nscore, and the transposition tones from the harmonic sequences of levels 1 and 2, both corresponding to the current time interval.\nThus, according to (\\ref{fn}) the key note frequency in an instrument score will be determined as:\n\n", "index": 7, "text": "\n\\[\nf_3 = f_2m_2 = f_1m_1m_2 = f_0m_0m_1m_2\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"f_{3}=f_{2}m_{2}=f_{1}m_{1}m_{2}=f_{0}m_{0}m_{1}m_{2}\" display=\"block\"><mrow><msub><mi>f</mi><mn>3</mn></msub><mo>=</mo><mrow><msub><mi>f</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>2</mn></msub></mrow><mo>=</mo><mrow><msub><mi>f</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>2</mn></msub></mrow><mo>=</mo><mrow><msub><mi>f</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>2</mn></msub></mrow></mrow></math>", "type": "latex"}]