[{"file": "1601.02581.tex", "nexttext": "\nwhere $T$ and $\\mu$ are the temperature and chemical potential of the polaritons, respectively, and $k_B$ is the Boltzmann constant. The ground state ($k_{||}=0)$ of the lower polariton shifts to higher energy as the density increases, due to the repulsive interpolariton interactions. We defined the ground state energy in each case as $E=0$ so that $\\mu= 0$ corresponds to the condition for Bose-Einstein condensation. The best fits of the data to $N_{BE}(E)$ were determined using $T$ and $\\mu$ as free parameters in nonlinear least-squares regressions, and are shown as solid curves in Fig.~2. \n\nWhen the polariton states are strongly negatively detuned and have very weak interactions, the fits to the Bose-Einstein distribution are poor. As seen in Fig.~2(a), for the case of $\\delta=-5$ meV, at low density the distribution has a reasonable fit to a Maxwell-Boltzmann distribution (which corresponds to a single exponential, i.e., a straight line on a semi-log plot), but as the polariton density is increased, the distribution is no longer fully thermal. The hump at $E = 0.5$ meV is a manifestation of the bottleneck effect, as was also observed in Ref.~\\cite{Kasprzak2008}.  As the density is increased further, a peak occurs which is condensate-like, but the rest of the distribution does not fit the Bose-Einstein functional form in Eq.~(\\ref{eq:BEdistrib}), indicating that the polaritons are not in thermal equilibrium.  This behavior is similar to that seen in many other experiments with short-lifetime polaritons, e.g.~Ref \\cite{Kasprzak2006, Kasprzak2008}, and is consistent with a nonequilibrium polariton condensate. The nonequilibrium distribution has been reproduced by numerical solution to the quantum Boltzmann equation \\cite{Hartwell2010}. Despite the long cavity lifetime, the photon-like polaritons with weak interactions do not reach thermal equilibrium.\n\nIn contrast, $N(E)$ at $\\delta=0$ is well described by $N_{BE}(E)$ for all pump powers up to $P=1.1P_{BE}$. At pump powers well below $P_{BE}$, $N(E)$ is well described by a single exponential function, i.e., a Maxwell-Boltzmann distribution.  Between $P=0.9P_{BE}$ and $P=1.1P_{BE}$, an upturn in the distribution at $E=0$ meV is observed, indicating that $N(E)$ deviates from Maxwell-Boltzmann statistics and must be described by a Bose-Einstein distribution with the reduced chemical potential $|\\mu/k_BT| < 1$. The fit values of $T$ and $\\mu$ used in Fig.~2b are shown in Fig.~3 as the blue symbols. As seen in this figure, when the density is increased, $T$ decreases from around 20 K to a lowest value of $13.9 \\pm 0.2$ K and $\\mu/k_BT$ smoothly goes from $-2.93 \\pm 0.16$ to $-0.28 \\pm 0.01$. For pump powers greater than $1.1P_{BE}$, a condensate in the ground state appears. This peak cannot be fit to an ideal Bose-Einstein distribution, and we believe that the reason is the appearance of many-body effects such as the Bogoliubov linear spectrum and depletion of the condensate due to interactions. The high-energy tail of the top two curves has the same absolute value, indicating that the population in the excited states saturates when there is a condensate, consistent with a Bose-Einstein condensation phase transition for bosons in thermal equilibrium. \n\n \\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.75\\textwidth]{Fig3}\n    \\caption{ (color online). (a) Effective temperatures of polaritons for bath temperatures $T=12.5$  K (blue points) and $T=22.5$ K (red points) at different pump powers extracted by fitting the energy distributions (shown in Fig.~2b for the 12.5 K case) to the equilibrium Bose-Einstein model. The dashed lines indicate the helium bath temperatures. (b) Reduced chemical potential $\\alpha=\\mu/k_BT$ for bath temperatures $T=12.5$ K (blue points) and $T=22.5$ K (red points) at different pump powers  .}\n \\end{figure}\n\nThe upturn in the shape of $N(E)$ in the low energy states unambiguously distinguishes $N(E)$ as a Bose-Einstein distribution rather than a Maxwell-Boltzmann distribution. Previous reports using short-lifetime samples \\cite{Deng2006,Kasprzak2008} showed fits of $N(E)$ without the clear upturn near $E=0$ at excitonic detunings; although a condensate peak appeared in some cases, there was not a clear density-dependent evolution from a thermal Maxwell-Boltzmann distribution to a degenerate Bose-Einstein, non-condensed distribution. Furthermore, short-lifetime samples thermalized only when the microcavity was positively detuned \\cite{Deng2006} and the polariton characteristics were mostly exciton-like so that the motion of the polaritons was severely restricted (see Supplementary Materials for a detailed discussion). In contrast, the long lifetime polaritons seen here at zero detuning follow Bose-Einstein statistics throughout the phase transition and propagate to fill the trap in spatial equilibrium. \n\nWe emphasize that not only the curvature of the fits in Fig.~2 but also the absolute vertical scale of the fits is constrained by the value of $\\mu$. We do not have a free parameter to change the overall intensity scaling factor for each curve. The data points give the absolute occupation numbers as indicated by the vertical scale in addition to the relative occupation numbers at different pump powers. When the value of $\\mu$ in the Bose-Einstein distribution is increased toward zero, this increases the absolute value of $N_{BE}(E)$. Thus, the fits are tightly constrained by the requirement that we fit not only the shape of the distribution but also the relative heights of all the curves with only two parameters, $T$ and $\\mu$. This constraint is reflected in the very small relative uncertainties in the fit values of $\\mu$ shown in Fig.~3b. \n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Characteristics of equilibrium polariton condensates at different bath temperatures}\n\n\\noindent The bath temperature was also varied in the range of 10.0--25.0 K. Good thermalization has been achieved across this range (see Supplementary Materials for plots of distributions at different bath temperatures). In Fig. 3, we plot the fitted values of $T$ and $\\mu/k_BT$ for different pump powers. As can be seen, when the bath temperature is low, the fit values of $T$ at low densities are much higher than $T_{bath}$ and at higher densities they settle to temperatures slightly above $T_{bath}$, while for a bath temperature of $T = 22.5$ K, the fitted temperatures stay pinned to the bath temperature, within the uncertainty. The chemical potential increases smoothly toward zero in each case as the density is increased.\n\nSince the polaritons are well characterized by the fits to Bose-Einstein distributions, we obtain the total number of polaritons by extrapolating the fitted distributions $N(E)$ of polaritons as shown in Fig.~2 to high energies, and then integrating over the energy, and multiplying by the density of states, using the standard formula\n\n", "itemtype": "equation", "pos": 15908, "prevtext": "\n\\title{Bose-Einstein Condensation of Long-Lifetime Polaritons in Thermal Equilibrium}\n\\author{Yongbao Sun,$^{1}{}^\\ast$  Patrick Wen,$^{1}$ Yoseob Yoon,$^{1}$ Gangqiang Liu,$^{2}$ Mark Steger,$^{2}$\\\\ Loren N. Pfeiffer,$^{3}$ Ken West,$^{3}$ David W. Snoke,$^{2}{}^\\ast$ and Keith A. Nelson,$^{1}$}\n\\affiliation{${}^1$Department of Chemistry and Center for Excitonics, Massachusetts Institute of Technology, 77 Massachusetts Avenue, Cambridge, MA 02139, USA \\\\ \n${}^2$Department of Physics, University of Pittsburgh, 3941 O'Hara St., Pittsburgh, PA 15218, USA\\\\\n${}^3$Department of Electrical Engineering, Princeton University, Princeton, NJ 08544, USA\n}\n\n\\begin{abstract}\nExciton-polaritons in semiconductor microcavities have been used to demonstrate quantum effects such as Bose-Einstein condensation, superfluity, and quantized vortices. However, in these experiments, the polaritons have not reached thermal equilibrium when they undergo the transition to a coherent state. This has prevented the verification of one of the canonical predictions for condensation, namely the phase diagram. In this work, we have created a polariton gas in a semiconductor microcavity in which the quasiparticles have a lifetime much longer than their thermalization time. This allows them to reach thermal equilibrium in a laser-generated confining trap. Their energy distributions are well fit by equilibrium Bose-Einstein distributions over a broad range of densities and temperatures from very low densities all the way up to the threshold for Bose-Einstein condensation. The good fits of the Bose-Einstein distribution  over a broad range of density and temperature imply that the particles obey the predicted power law for the phase boundary of Bose-Einstein condensation. \n\\end{abstract}\n\\maketitle \n\n\n\\noindent\\textbf{Introduction}\n\n\\noindent The realization of polariton condensation in semiconductor microcavities from liquid helium temperature \\cite{Kasprzak2006, Balili2007} all the way up to room temperature \\cite{Christopoulos2007, Kena-Cohen2010, Plumhof2014}  presents great opportunities both for fundamental studies of many-body physics and for all-optical devices on the technology side. Exciton-polaritons in a semiconductor microcavity are admixtures of the confined light modes of the cavity and excitonic transitions, typically those of excitons in semiconductor quantum wells (QWs) placed at the antinodes of the cavity. Despite the similarities between polaritons and cold atoms, as demonstrated by the observation of Bose-Einstein condensation (BEC) \\cite{Kasprzak2006, Balili2007, Christopoulos2007, Kena-Cohen2010, Plumhof2014}, superfluidity \\cite{Amo2009}, and quantized vortices \\cite{Lagoudakis2008, Lagoudakis2009, Sanvitto2010, Nardin2011, Tosi2012}, polaritons possess many unique features, among which is finite intrinsic lifetime. In most previous experiments, the lifetime of the polaritons in microcavities has been 30 ps or less \\cite{Wertz2010}. This is enough time for particles to thermalize partially but not fully \\cite{Deng2006, Kasprzak2008}, which has led to the common description of polariton condensates as ``nonequilibrium condensates'' \\cite{Szymanska2006}.  In typical experiments, the polariton gas is far from equilibrium at low density and reaches a Maxwell-Boltzmann distribution at moderate densities, but then as density increases toward the BEC threshold, the particle distribution cannot be fit by an equilibrium Bose-Einstein distribution with a meaningful chemical potential (See the Supplementary Materials for a review of earlier data). \n\nThe theory of nonequilibrium condensation is an active field \\cite{Szymanska2006,Wouters2010,Hartwell2010, Keeling2011,Smith2012}, and polariton experiments and theory have shown that a great number of canonical features of condensation persist in nonequilibrium. Debates persist over whether polariton condensates can be called true Bose-Einstein condensates \\cite{Butov2007, Butov2012, Deveaud-Pledran2012}, in part related to the question of whether polariton condensation is intrinsically a nonequilibrium effect. Although many effects in polariton experiments do not depend on whether the polaritons reach thermal equilibrium or not, it is of fundamental importance to investigate that whether polariton condensates can reach thermal equilibrium. Strictly speaking, BEC cannot occur in an ideal infinite 2D system, but it has been shown \\cite{Holzmann2007, Berman2008} that a 2D Bose gas in a large but finite trap has the same threshold behavior as a 3D Bose gas in a finite trap of the same type. It is therefore appropriate to talk of BEC in 2D and 3D finite trapped systems using the same language. \n\nIn this paper, we report the observation of fully thermalized polaritons all the way up to the Bose condensation threshold, in an exceptionally high-$Q$ microcavity structure in a laser-generated annular trap under non-resonant excitation. The high $Q$ corresponds to a long polariton lifetime, allowing polaritons to propagate to the center of the trap \\cite{interactions} and establish both spatial and thermal equilibrium. The measured distributions can be fit well by the equilibrium Bose-Einstein model over a broad range of densities and bath temperatures. The temperature values extracted from the fits follow the measured bath temperatures closely. The chemical potentials determined from the fits give predictions for the polariton densities that agree well with independent measurements of the densities. \n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Trapping polaritons in a high-$Q$ microcavity} \n\n\\noindent The main challenge in reaching full thermalization in polariton systems is to achieve a very long polariton lifetime, longer than their thermalization time. The thermalization time for the polariton gas was estimated to be at least 40 ps for polaritons that are mostly exciton-like \\cite{Deng2006}, and can be even longer for more photon-like polaritons (see Supplementary Materials for a discussion of how to vary the exciton/photon component through use of a wedged microcavity whose variable widths yield cavity resonance frequencies that are positively or negatively detuned from the exciton resonance frequency). However, most samples used in previous experiments have polariton lifetimes on the order of a few picoseconds due to leakage of light out of the cavities. This suggests that an improvement of the cavity $Q$ by at least an order of magnitude is needed, which is not trivial for GaAs fabrication technology. A GaAs-based high-$Q$ microcavity structure grown by molecular beam epitaxy (MBE) was used in the measurements. The main change from samples used in previous experiments \\cite{Balili2007} was to double the number of the quarter-wavelength layers in the distributed Bragg reflectors (DBRs) that make up the mirrors of the cavity; detailed recipe and the difficulties involved in fabricating a long lifetime sample are described in the Supplementary Materials. The new microcavity structure has a $Q$ of $\\sim$320,000 and a cavity photon lifetime of $\\sim$135 ps. This corresponds to a polariton lifetime of 270 ps at resonance, which has been confirmed by the long-range (millimeter scale) propagation of polaritons created through either resonant \\cite{Steger2015} or non-resonant \\cite{Steger2013} optical excitation. \n\nDue to the light effective mass and inefficient scattering with phonons, polaritons can propagate over long distances, up to millimeters when they are mostly photonic \\cite{Steger2013,Steger2015}. In order to guide them toward equilibrium with a specified location and geometry, we made a spatial trap.  We made use of the fact that excitons in the same structure have much larger effective mass than that of the polaritons; the typical polariton mass is less than $10^{-4}$ times the electron mass, while the free exciton mass is on the order of a tenth of an electron mass. Therefore, the excitons created by non-resonant optical excitation are essentially static as seen by polaritons, and the repulsion of the polaritons by the excitons acts as a static potential energy barrier. This method has been used previously in several experiments to confine polaritons \\cite{Tosi2012_2,Cristofolini2013, interactions, Askitopoulos2013, Askitopoulos2015}.\n\nThe 2D annular trap in this work was formed by irradiating a high-resolution spatial light modulator (SLM) with a pixel density of $1920\\times1080$ by a commercial continuous wave (c.w.) laser. The SLM was used for shaping the incident Gaussian beam into a specified intensity pattern. We imposed a conical prism phase map onto the SLM which was placed at the Fourier plane of an imaging lens. At the conjugate plane of this lens, the beam was transformed into a ring-shaped pattern with a diameter of $\\sim$2 mm. With another two pairs of telescopes, a ring-shaped beam with a diameter of 38 $\\mu$m was formed at the microcavity, as shown in Fig 1a. The wavelength of the c.w. laser was tuned to 720 nm, about 125 meV above the lower polariton resonance, to match the second reflection minimum above the stop band of the cavity at resonance (see Supplementary Materials for details). This generates a high density of free carriers along the ring. Non-resonant excitation of this type guarantees that the phase coherence of the pump laser is lost in the many-phonon scattering events through which the hot carriers relax into cold polaritons, and any coherence in the system arises spontaneously at sufficiently high density due to the nature of Bose-Einstein condensation. In order to avoid unwanted sample heating, the c.w. laser light was gated by an acousto-optic modulator (AOM) at 1 kHz repetition rate with a duty cycle of 0.5\\%. In Fig.~1b, we show the normalized light intensity plot for the $x=0$ slice of the ring pattern in Fig.~1a. The light intensity in the center is nearly negligible; as discussed above, it gives rise to a nearly flat potential for the polaritons in the center of the ring, in which the variation in energy is much less than $k_BT$.\n\n\\begin{figure}[htbp]\n \\centering\n   \\includegraphics[scale = 0.4]{Fig1}\n    \\caption{ (color online). (a) Reflection of the excitation beam from the sample surface. The white circle indicates the region of the sample that is observed in photoluminescence (PL) imaging measurements after spatial filtering. (b) Normalized excitation light intensity along the $x=0$ line through the center of the excitation ring pattern shown in (a). (c). Spectrally resolved PL along $x=0$. The PL within the solid white lines is collected and imaged onto the spectrometer CCD in the far-field geometry for the polariton distribution measurements. The dashed white line indicates the photon energy gradient deduced from the low-density spectrum.}\n \\end{figure}\n\nThe formation of a 2D polariton trap was verified by measuring the energy of the lower polariton state as a function of sample position. A near-field image of the sample surface was imaged onto the entrance slit of an imaging spectrometer. The spectrometer slit selected the $x=0$ slice of the near-field image and was then spectrally dispersed on the spectrometer CCD. The resulting image, plotted in Fig.~1c for the case of moderate pump power below the condensation threshold, shows the intensity of the photoluminescence (PL) emitted by lower polaritons as a function of both the PL energy and the sample position. The white dashed line indicates the emission energies at very low pump powers; the slope of this line arises from the wedge of the cavity thickness, which causes a gradient in the cavity photon energy. At the pump region, there is a blue shift of the polariton energy due to their interactions with each other as well as from repulsive interactions between polaritons and excitons and free carriers. As seen in Fig.~1c, the barrier is not constant around the ring, varying by about 1 meV from one side to the other due to inhomogeneity in the pump intensity. The barrier is slightly wider than the laser profile, because excitons propagate up to 10 $\\mu$m. The potential landscape is nearly flat in the region from -11 $\\mu$m to 11 $\\mu$m indicated by the white circle in Fig.~1a and the horizontal lines in Fig.~1b and 1c.  PL was collected from only this region for determinations of the polariton energy distribution as discussed below. The nearly flat potential profile corresponds to a constant density of states in 2D. Additionally, a nearly homogeneous distribution was established in the field of view, as evidenced by little change in the energy-resolved emission intensities in Fig.~1c (see Fig. S6 in Ref.~\\cite{interactions} for a direct measurement of spatial profiles under similar conditions). \n\nPolaritons are generated in the pump region and stream away in all directions.  However, only polaritons that propagate into the center of the trap can meet and interact,  leading to the accumulation of the densities high enough for condensation. A near-field image of the sample was projected onto a spatial filter at a reconstructed real-space plane of the sample surface to select only the PL from inside the trap (within the white circle in Fig.~1a), and a far-field image of the PL that passed through the spatial filter was projected onto an imaging spectrometer, giving the intensity of the PL, $I$, as function of both the in-plane wavevector component, $k_{||}$, and the corresponding energy, $E(k_{||})$. The dispersion $E(k_{||})$ is illustrated in Fig.~S3. Finally, $I[E(k_{||})]$ was converted into the number of polaritons, $N[E(k_{||})]$ (hereafter simply $N(E)$),  by the use of one single efficiency factor throughout the experiments. Detailed information about how to determine the efficiency factor can be found in Ref.~\\cite{interactions}. Crucially, the same efficiency factor was used for all the distributions so that the absolute occupation numbers of different distributions could be compared.\n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Varying the polariton gas from nonequilibrium to equilibrium} \n\n\\noindent To see the effect of interactions on thermalization, $N(E)$ was measured at two different cavity detunings, $\\delta=-5$ meV and $\\delta=0$ meV, for a series of pump powers. The detuning $\\delta$ is the energy difference between the cavity resonance and exciton energy at $k_{||}=0$.  Changing the detuning changes the underlying excitonic fraction of the polaritons, which governs their interactions. Positive values of detunings indicates polaritons are more exciton-like, while negative values of detunings give polaritons which are mostly photon-like.  Here $\\delta = 0$ meV and $\\delta = -5$ meV correspond to excitonic fractions of 50\\% and 30\\%, respectively.  This indicates that the polaritons with $\\delta=-5$ meV have interactions which are weaker by a factor of 3 than those at $\\delta = 0$ meV, and less well thermalization is expected. \n\n \\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.75\\textwidth]{Fig2}\n    \\caption{ (color online).  Energy distributions of polaritons in the center of the trap at (a) $\\delta = -5$ meV (b) $\\delta = 0$ meV at different pump powers at a bath temperature of $T_{bath} = 12.5$ K. The solid curves are best fits to the equilibrium Bose-Einstein distribution in Eq.~(\\ref{eq:BEdistrib}). The fitted values of $T$ and $\\mu$ are shown in Fig.~3. The threshold powers $P_{BE}$ are 382 mW and 443 mW for detunings $\\delta = -5$ meV and $\\delta = 0$ meV, respectively.}\n\\end{figure}\n\nThe measured distributions $N(E)$ at both detunings and various pump powers are shown in Fig.~2. The pump powers are reported in terms of the threshold power, $P_{BE}$, defined below. The sample was immersed in a helium bath that was kept at a temperature $T_{bath} = 12.5$ K for both detuning positions. The measured values of $N(E)$ were fit to a Bose-Einstein distribution, given by\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:BEdistrib}\nN_{BE}(E)=\\frac{1}{e^{(E-\\mu)/k_BT}-1},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"N_{BE}(E)=\\frac{1}{e^{(E-\\mu)/k_{B}T}-1},\" display=\"block\"><mrow><mrow><mrow><msub><mi>N</mi><mrow><mi>B</mi><mo>⁢</mo><mi>E</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><msup><mi>e</mi><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>E</mi><mo>-</mo><mi>μ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><msub><mi>k</mi><mi>B</mi></msub></mrow><mo>⁢</mo><mi>T</mi></mrow></msup><mo>-</mo><mn>1</mn></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nwhere $A$ is the area of our field of view, $m_{LP}$ is the effective mass of the lower polariton, and $g=2$ accounts for the spin degeneracy of the polaritons. Fig.~4 shows the deduced occupation number from Eq.~(\\ref{NE}) as the pump power was increased, using the fit values of $T$ and $\\mu$ in $N(E)$ at each pump power, for the case of bath temperature $T_{bath} = 12.5$~K. \n\n\n\\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.55\\textwidth]{Fig4}\n    \\caption{ (color online). The effective temperatures of polaritons $T_{fit}$  (blue) and total number of polaritons $N_{tot}$ (red) at different reduced chemical potentials at a bath temperature of $T_{bath}=12.5$ K. The vertical dashed line indicates the threshold of the Bose-Einstein degeneracy, i.e., $-\\mu/k_BT=\\ln2$.}\n \\end{figure}\n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Scaling law of polariton Bose condensation} \n\n\\noindent Defining the threshold for Bose-Einstein condensation in a two-dimensional system with a flat potential is problematic, because unlike the three-dimensional case, the density of states is flat in two dimensions, and the energy distribution $N_{BE}(E)$ given by (\\ref{eq:BEdistrib}) evolves continuously into one which is sharply peaked at $E=0$ as density increases.  We can define the threshold for crossover from classical to Bose-Einstein statistics as the case when $N(0) \\sim 1$, or we can define the threshold for condensation, or quasi-condensation, when $N(0) \\gg 1$, e.g., $N(0) \\sim 10$. Whichever threshold for $N(0)$ we pick, Eq.~(\\ref{NE}) implies the same scaling law, namely that the total number $N_{tot}$ at the critical threshold will be proportional to the temperature $T$. This is equivalent to a dimensional analysis of the onset of quantum effects when the thermal de Broglie wavelength $\\lambda_{T}$ is comparable to the average interparticle distance $r_s$, which for a  two-dimensional system gives\n\\begin{eqnarray}\nr_s \\sim n^{-1/2} \\sim \\lambda_{T} \\sim \\sqrt{\\frac{\\hbar^2}{mk_BT}}.\n\\label{eq:rs}\n\\end{eqnarray}\nand therefore $n\\propto T$.\n\nThe fit values of $T$ at the critical threshold are plotted in Fig.~5a, showing the general trend of $T_{BE}$ slightly higher than $T_{bath}$, as discussed earlier. The relative deviation is highest at low bath temperature, when the heat capacity of the sample is lowest, allowing the local sample temperature to rise more due to the laser heating. \n\n \\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.85\\textwidth]{Fig5}\n    \\caption{ (color online). (a) The critical temperature as a function of lattice temperature for $\\delta = 0$ meV. The solid black line indicates $T_{BE}=T_{\\textrm{bath}}$. (b) \\textit{Phase diagram of the transition to a degenerate Bose gas}. The solid black line shows the best fit of a linear relation $N_{BE} \\propto  T_{BE}$.}\n \\end{figure}\nFig.~5b shows the phase diagram implied by the good fits to our thermalized data. We defined the threshold of quantum degeneracy as $N(0)=1$, which corresponds to a Bose-Einstein distribution with $\\mu/k_BT=-\\ln2$, shown by the black dashed line in Fig.~4. For each bath temperature, \nthe threshold pump power $P_{BE}$ was chosen which gave a fit value of $\\mu/k_BT$ closest to $-\\ln2$. The fit value of $T$ at this threshold and the total occupation number from Eq.~(2) then give us the phase boundary, plotted as the blue symbols in Fig.~5b. The solid black lines are the best linear fit. Above the line, the polariton gas is quantum-degenerate, and below it, the gas is classical. \n\nIt has been a longstanding assumption that the Bose condensation effects seen in polariton systems are a direct result of the quantum nature of the system when $r_s \\sim \\lambda_{T}$, but up to now it has not been possible to directly test this.  By using high-quality microcavities with lifetimes over an order of magnitude longer than those of previous samples, polaritons within a two-dimensional flat optical trap are seen to unambiguously show thermal Bose-Einstein statistics. This clearly distinguishes polariton condensation from the conventional lasing effect in semiconductor materials. \n\nNow that we have samples in which true equilibrium can be established, new experiments are possible to test theoretical predictions of interacting Bose gas theory which have been elusive in cold atom experiments. For example, studies can be conducted of the excitation spectrum of the interacting Bose gas, and of the crossover from 2D to 1D equilibrium which can be controlled by spatial shaping of the excitation light to make tailored potential energy landscapes. Characteristics of the nonequilibrium state can also be studied systematically by varying the cavity detuning to control the polariton interaction strength. Dynamical relaxation into the equilibrium state can also be studied by using pulsed rather than c.w. excitation followed by time-resolved measurements, as well as the coherence properties as the system passes through the Berezinsky-Kosterlitz-Thouless (BKT) transition. \n\n\\bibliographystyle{sciencemag}\n\\bibliography{thermalization}\n\n\\vspace*{.5cm}\n\\noindent\\textbf{ACKNOWLEDGEMENTS} \\\\\nY.S., P.W., Y.Y. and K.A.N were supported as part of the Center for Excitonics, an Energy Frontier Research Center funded by the US Department of Energy, Office of Science, Office of Basic Energy Sciences under Award Number DE-SC0001088. G.L., M.S. and D.W.S. were  supported  by  the  National  Science  Foundation under grants PHY-1205762 and DMR-1104383. L.N.P. and K.W. were funded by the Gordon and Betty Moore Foundation through the EPiQS initiative Grant GBMF4420, and by the National Science Foundation MRSEC Grant DMR-1420541.\n\n\\vspace*{.5cm}\n\\noindent\\textbf{SUPPLEMENTARY MATERIALS} \\\\\nSOM Text\\\\\nFig.~S1 to S6\n\n\\vspace*{.5cm}\n\\noindent\\textbf{ADDITIONAL INFORMATION}\\\\\nCorrespondence and requests for materials should be addressed to Y.S. at ybsun@mit.edu or to D.W.S. at snoke@pitt.edu.\n\n\\newpage\n\\appendix\n\\setcounter{figure}{0}    \n\n\\begin{center}\n{\\bf \\large Supplementary Materials for Bose-Einstein Condensation of Long-Lifetime Polaritons in Thermal Equilibrium}\n\\end{center}\n\\begin{center}\n{Yongbao Sun,$^{1}{}^\\ast$  Patrick Wen,$^{1}$ Yoseob Yoon,$^{1}$ Gangqiang Liu,$^{2}$ Mark Steger,$^{2}$\\\\ Loren N. Pfeiffer,$^{3}$ Ken West,$^{3}$ David W. Snoke,$^{2}{}^\\ast$ and Keith A. Nelson,$^{1}$}\n\\end{center}\n\n\\begin{center}\n\\fontsize{10pt}{20pt}{\\it ${}^1$Department of Chemistry and Center for Excitonics, Massachusetts Institute of Technology, 77 \\\\ Massachusetts Avenue, Cambridge, MA 02139, USA}\\par\n\\fontsize{10pt}{20pt}{\\it ${}^2$Department of Physics, University of Pittsburgh, 3941 O'Hara St., Pittsburgh, PA 15218, USA}\\par\n\\fontsize{10pt}{20pt}{\\it ${}^3$Department of Electrical Engineering, Princeton University, Princeton, NJ 08544, USA}\\par\n\\end{center}\n\n\n\\noindent\\textbf{\\textrm{Detailed sample structure}}\\hspace{10pt} The structure of the sample used in the experiments described in the main text is shown in Fig.~\\ref{microcavity3d} and Fig.~\\ref{microcavity}a: three sets of four 7-nm GaAs quantum wells (QWs) are embedded at the three antinodes in a $3\\lambda/2$ microcavity, with the front and\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.75\\textwidth]{FigS3}\n   \\caption{ (color online) 3D illustration of microcavity structure used in this work. The red lines indicate the intensity distribution of the confined optical field. The red cone shows the pump laser beam. The dark and light gray alternate layers are the distributed Bragg reflectors (DBRs) that are used to confine the light in the cavity, shown as the orange region. Quantum wells (QWs) are shown as the orange layers. }\n\\label{microcavity3d}\n\\end{figure}\n back distributed Bragg reflectors (DBRs), composed of 32 and 40 pairs, respectively, of Al$_{0.2}$Ga$_{0.8}$As/AlAs $\\lambda/4$ layers. This microcavity structure is identical to semiconductor microcavity structures with short polariton lifetimes \\cite{Balili2007} except that the number of layers in the DBRs is doubled. This leads to an significant increase in the lifetime of the trapped cavity field to about 135 ps, implying a polariton lifetime at $\\delta = 0$ of 270 ps, which has been verified by transport measurements \\cite{Steger2015}. \n \nIn Fig.~\\ref{microcavity3d},  the cavity region is indicated as the orange section, and red lines show a plot of the intensity distribution of the confined light modes in the cavity. We also show the ring-shaped optical excitation beam as the red cone on the right side of the structure. The microcavity structure is wedged along one direction as shown  in Fig.~\\ref{microcavity}a, which allows tuning of photon resonance across the exciton resonance, thus allowing control of the exciton fraction in the polariton state. \n  \n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.75\\textwidth]{FigS3s}\n   \\caption{ (color online) Schematic illustration of microcavity structure used in this work. The dark and light gray alternative layers indicate the distributed Bragg reflectors (DBRs) that are used to confine the light in the cavity. Sets of quantum wells (QWs) are shown as the black lines. The wedged  cavity allows different cavity resonance frequencies to be selected. (b) Calculated white light reflectance of the sample structure. The black arrow indicates the second reflection minimum above stop band to which the the laser wavelength was tuned to match.}\n\\label{microcavity}\n\\end{figure}\n\nAlthough the concept of doubling the number of DBR layers is simple, the fabrication is not trivial, because it requires much longer fabrication times, approximately 30 hours of molecular-beam epitaxy (MBE), with tight control during the entire growth process.  If the growth process is not well controlled, inhomogeneities in the lower levels will be amplified in higher levels.\n\nFig.~\\ref{microcavity}b plots the simulated spectrum of white light reflection of a microcavity structure. The stop band for optical transmission spans from 740 nm to 820 nm. Peaks around 780 nm arise from lower and upper polariton resonances. In the measurements, we tuned the laser wavelength to the second reflection minimum above the stop band, as indicated by the black arrow.  \n\n\\vspace*{0.3cm}\n\\noindent\\textbf{\\textrm{Background on exciton-polaritons in semiconductor microcavities}}.\\hspace{10pt}  Exciton-polaritons are formed in semiconductor microcavities through strong coupling between optical modes of the microcavity and exciton transitions of a material embedded inside the microcavity \\cite{Kavokin2007, Deng2010, Snoke2010, Carusotto2013}. For the case of a single microcavity mode and a single exciton transition, two polariton modes, the upper and lower polaritons, are formed with energies $E_{LP}(k_{||})$ and $E_{UP}(k_{||})$ given by:\n\n", "itemtype": "equation", "pos": 22923, "prevtext": "\nwhere $T$ and $\\mu$ are the temperature and chemical potential of the polaritons, respectively, and $k_B$ is the Boltzmann constant. The ground state ($k_{||}=0)$ of the lower polariton shifts to higher energy as the density increases, due to the repulsive interpolariton interactions. We defined the ground state energy in each case as $E=0$ so that $\\mu= 0$ corresponds to the condition for Bose-Einstein condensation. The best fits of the data to $N_{BE}(E)$ were determined using $T$ and $\\mu$ as free parameters in nonlinear least-squares regressions, and are shown as solid curves in Fig.~2. \n\nWhen the polariton states are strongly negatively detuned and have very weak interactions, the fits to the Bose-Einstein distribution are poor. As seen in Fig.~2(a), for the case of $\\delta=-5$ meV, at low density the distribution has a reasonable fit to a Maxwell-Boltzmann distribution (which corresponds to a single exponential, i.e., a straight line on a semi-log plot), but as the polariton density is increased, the distribution is no longer fully thermal. The hump at $E = 0.5$ meV is a manifestation of the bottleneck effect, as was also observed in Ref.~\\cite{Kasprzak2008}.  As the density is increased further, a peak occurs which is condensate-like, but the rest of the distribution does not fit the Bose-Einstein functional form in Eq.~(\\ref{eq:BEdistrib}), indicating that the polaritons are not in thermal equilibrium.  This behavior is similar to that seen in many other experiments with short-lifetime polaritons, e.g.~Ref \\cite{Kasprzak2006, Kasprzak2008}, and is consistent with a nonequilibrium polariton condensate. The nonequilibrium distribution has been reproduced by numerical solution to the quantum Boltzmann equation \\cite{Hartwell2010}. Despite the long cavity lifetime, the photon-like polaritons with weak interactions do not reach thermal equilibrium.\n\nIn contrast, $N(E)$ at $\\delta=0$ is well described by $N_{BE}(E)$ for all pump powers up to $P=1.1P_{BE}$. At pump powers well below $P_{BE}$, $N(E)$ is well described by a single exponential function, i.e., a Maxwell-Boltzmann distribution.  Between $P=0.9P_{BE}$ and $P=1.1P_{BE}$, an upturn in the distribution at $E=0$ meV is observed, indicating that $N(E)$ deviates from Maxwell-Boltzmann statistics and must be described by a Bose-Einstein distribution with the reduced chemical potential $|\\mu/k_BT| < 1$. The fit values of $T$ and $\\mu$ used in Fig.~2b are shown in Fig.~3 as the blue symbols. As seen in this figure, when the density is increased, $T$ decreases from around 20 K to a lowest value of $13.9 \\pm 0.2$ K and $\\mu/k_BT$ smoothly goes from $-2.93 \\pm 0.16$ to $-0.28 \\pm 0.01$. For pump powers greater than $1.1P_{BE}$, a condensate in the ground state appears. This peak cannot be fit to an ideal Bose-Einstein distribution, and we believe that the reason is the appearance of many-body effects such as the Bogoliubov linear spectrum and depletion of the condensate due to interactions. The high-energy tail of the top two curves has the same absolute value, indicating that the population in the excited states saturates when there is a condensate, consistent with a Bose-Einstein condensation phase transition for bosons in thermal equilibrium. \n\n \\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.75\\textwidth]{Fig3}\n    \\caption{ (color online). (a) Effective temperatures of polaritons for bath temperatures $T=12.5$  K (blue points) and $T=22.5$ K (red points) at different pump powers extracted by fitting the energy distributions (shown in Fig.~2b for the 12.5 K case) to the equilibrium Bose-Einstein model. The dashed lines indicate the helium bath temperatures. (b) Reduced chemical potential $\\alpha=\\mu/k_BT$ for bath temperatures $T=12.5$ K (blue points) and $T=22.5$ K (red points) at different pump powers  .}\n \\end{figure}\n\nThe upturn in the shape of $N(E)$ in the low energy states unambiguously distinguishes $N(E)$ as a Bose-Einstein distribution rather than a Maxwell-Boltzmann distribution. Previous reports using short-lifetime samples \\cite{Deng2006,Kasprzak2008} showed fits of $N(E)$ without the clear upturn near $E=0$ at excitonic detunings; although a condensate peak appeared in some cases, there was not a clear density-dependent evolution from a thermal Maxwell-Boltzmann distribution to a degenerate Bose-Einstein, non-condensed distribution. Furthermore, short-lifetime samples thermalized only when the microcavity was positively detuned \\cite{Deng2006} and the polariton characteristics were mostly exciton-like so that the motion of the polaritons was severely restricted (see Supplementary Materials for a detailed discussion). In contrast, the long lifetime polaritons seen here at zero detuning follow Bose-Einstein statistics throughout the phase transition and propagate to fill the trap in spatial equilibrium. \n\nWe emphasize that not only the curvature of the fits in Fig.~2 but also the absolute vertical scale of the fits is constrained by the value of $\\mu$. We do not have a free parameter to change the overall intensity scaling factor for each curve. The data points give the absolute occupation numbers as indicated by the vertical scale in addition to the relative occupation numbers at different pump powers. When the value of $\\mu$ in the Bose-Einstein distribution is increased toward zero, this increases the absolute value of $N_{BE}(E)$. Thus, the fits are tightly constrained by the requirement that we fit not only the shape of the distribution but also the relative heights of all the curves with only two parameters, $T$ and $\\mu$. This constraint is reflected in the very small relative uncertainties in the fit values of $\\mu$ shown in Fig.~3b. \n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Characteristics of equilibrium polariton condensates at different bath temperatures}\n\n\\noindent The bath temperature was also varied in the range of 10.0--25.0 K. Good thermalization has been achieved across this range (see Supplementary Materials for plots of distributions at different bath temperatures). In Fig. 3, we plot the fitted values of $T$ and $\\mu/k_BT$ for different pump powers. As can be seen, when the bath temperature is low, the fit values of $T$ at low densities are much higher than $T_{bath}$ and at higher densities they settle to temperatures slightly above $T_{bath}$, while for a bath temperature of $T = 22.5$ K, the fitted temperatures stay pinned to the bath temperature, within the uncertainty. The chemical potential increases smoothly toward zero in each case as the density is increased.\n\nSince the polaritons are well characterized by the fits to Bose-Einstein distributions, we obtain the total number of polaritons by extrapolating the fitted distributions $N(E)$ of polaritons as shown in Fig.~2 to high energies, and then integrating over the energy, and multiplying by the density of states, using the standard formula\n\n", "index": 3, "text": "\\begin{equation}\nN_{\\textrm{tot}}= \\frac{gAm_{LP}}{2\\pi\\hbar^2}\\int_0^\\infty N(E)dE\n\\label{NE}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"N_{\\textrm{tot}}=\\frac{gAm_{LP}}{2\\pi\\hbar^{2}}\\int_{0}^{\\infty}N(E)dE\" display=\"block\"><mrow><msub><mi>N</mi><mtext>tot</mtext></msub><mo>=</mo><mrow><mfrac><mrow><mi>g</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><msub><mi>m</mi><mrow><mi>L</mi><mo>⁢</mo><mi>P</mi></mrow></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">ℏ</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>E</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nwhere $k_{||}$ is the wave vector in the plane perpendicular to the microcavity confinement direction, $E_X(k_{||})$ is the energy of the exciton transition, $E_C(k_{||})$ is the energy of the cavity mode, $\\delta(k_{||})$ is the detuning energy defined as $\\delta(k_{||})=E_C(k_{||})-E_X(k_{||})$, and $\\Omega$ is the strength of radiative coupling between the exciton and cavity field, also known as full Rabi splitting energy. The confinement of light gives the cavity mode a parabolic dispersion in the plane perpendicular to the confinement direction: $E_C\\simeq E_C(0) + \\hbar^2k_{||}^2/2m_C$, where $m_C$ is the effective mass of the cavity field. This effective mass is typically $10^{-4}$ times lighter than the vacuum electron mass, and about $10^{-3}$ times less than an exciton in a GaAs quantum well structure, so that $E_X(k_{||})$ is essentially constant with $k_{||}$. The energies $E_X(k_{||}),E_C(k_{||}),E_{LP}(k_{||})$, and $E_{UP}(k_{||})$ are given in Fig.~\\ref{energy_dispersion} for three different values of $\\delta(k_{||}=0)$. The energies were calculated using (\\ref{eq:Epolariton}) and parameters matching the sample structure used in the experiments: $\\Omega = 10.84$ meV and $E_X(0)=1604.6$ meV. \n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.85\\textwidth]{FigS1}\n   \\caption{ (color online) Dispersion curves of polariton modes at three representative cavity detunings (a) $\\delta = -5$ meV, (b) $\\delta = 0$ meV, and (c) $\\delta = 5$ meV. The dotted line shows the confined cavity mode, and the dashed line shows the bare exciton mode. The blue and red solid lines indicate the upper polariton (UP) and lower polariton (LP) branches, respectively, arising from the strong coupling between cavity modes and exciton modes. Our sample parameters were used in the calculations.}\n\\label{energy_dispersion}\n\\end{figure}\n\nThe length of the cavity increases monotonically along one direction of the QW plane so that the energy of the cavity mode can be tuned relative to the exciton resonance energy, as shown in Fig.~\\ref{spatial_dispersion}, allowing us to experimentally tune $\\delta(k_{||}=0)$. The energies of all modes in Fig.~\\ref{energy_dispersion} are plotted as a function of $k_{||}$, the in-plane wave vector. \n\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.50\\textwidth]{FigS2}\n   \\caption{ (color online) (a) The calculated upper polariton (blue line) and lower polariton (red line) ground state ($k_{||}=0$) energies at different positions of the sample. The dashed line indicates the exciton energies, and the dotted line shows the cavity energies. (b) Excitonic fractions of upper polaritons (blue line) and  lower polaritons (red line) at different sample positions.}\n\\label{spatial_dispersion}\n\\end{figure}\n\nThe polariton modes are linear superpositions of the exciton and microcavity photon modes. The lower polariton and upper polariton operators, $\\hat{P}_{k_{||}}$ and $\\hat{Q}_{k_{||}}$, respectively, can be written in terms of exciton and cavity operators, $\\hat{a}_{k_{||}}$ and $\\hat{b}_{k_{||}}$:\n\n", "itemtype": "equation", "pos": 33855, "prevtext": "\nwhere $A$ is the area of our field of view, $m_{LP}$ is the effective mass of the lower polariton, and $g=2$ accounts for the spin degeneracy of the polaritons. Fig.~4 shows the deduced occupation number from Eq.~(\\ref{NE}) as the pump power was increased, using the fit values of $T$ and $\\mu$ in $N(E)$ at each pump power, for the case of bath temperature $T_{bath} = 12.5$~K. \n\n\n\\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.55\\textwidth]{Fig4}\n    \\caption{ (color online). The effective temperatures of polaritons $T_{fit}$  (blue) and total number of polaritons $N_{tot}$ (red) at different reduced chemical potentials at a bath temperature of $T_{bath}=12.5$ K. The vertical dashed line indicates the threshold of the Bose-Einstein degeneracy, i.e., $-\\mu/k_BT=\\ln2$.}\n \\end{figure}\n\n\\vspace*{0.35cm}\n\\noindent\\textbf{Scaling law of polariton Bose condensation} \n\n\\noindent Defining the threshold for Bose-Einstein condensation in a two-dimensional system with a flat potential is problematic, because unlike the three-dimensional case, the density of states is flat in two dimensions, and the energy distribution $N_{BE}(E)$ given by (\\ref{eq:BEdistrib}) evolves continuously into one which is sharply peaked at $E=0$ as density increases.  We can define the threshold for crossover from classical to Bose-Einstein statistics as the case when $N(0) \\sim 1$, or we can define the threshold for condensation, or quasi-condensation, when $N(0) \\gg 1$, e.g., $N(0) \\sim 10$. Whichever threshold for $N(0)$ we pick, Eq.~(\\ref{NE}) implies the same scaling law, namely that the total number $N_{tot}$ at the critical threshold will be proportional to the temperature $T$. This is equivalent to a dimensional analysis of the onset of quantum effects when the thermal de Broglie wavelength $\\lambda_{T}$ is comparable to the average interparticle distance $r_s$, which for a  two-dimensional system gives\n\\begin{eqnarray}\nr_s \\sim n^{-1/2} \\sim \\lambda_{T} \\sim \\sqrt{\\frac{\\hbar^2}{mk_BT}}.\n\\label{eq:rs}\n\\end{eqnarray}\nand therefore $n\\propto T$.\n\nThe fit values of $T$ at the critical threshold are plotted in Fig.~5a, showing the general trend of $T_{BE}$ slightly higher than $T_{bath}$, as discussed earlier. The relative deviation is highest at low bath temperature, when the heat capacity of the sample is lowest, allowing the local sample temperature to rise more due to the laser heating. \n\n \\begin{figure}[htbp]\n \\centering\n   \\includegraphics[width=0.85\\textwidth]{Fig5}\n    \\caption{ (color online). (a) The critical temperature as a function of lattice temperature for $\\delta = 0$ meV. The solid black line indicates $T_{BE}=T_{\\textrm{bath}}$. (b) \\textit{Phase diagram of the transition to a degenerate Bose gas}. The solid black line shows the best fit of a linear relation $N_{BE} \\propto  T_{BE}$.}\n \\end{figure}\nFig.~5b shows the phase diagram implied by the good fits to our thermalized data. We defined the threshold of quantum degeneracy as $N(0)=1$, which corresponds to a Bose-Einstein distribution with $\\mu/k_BT=-\\ln2$, shown by the black dashed line in Fig.~4. For each bath temperature, \nthe threshold pump power $P_{BE}$ was chosen which gave a fit value of $\\mu/k_BT$ closest to $-\\ln2$. The fit value of $T$ at this threshold and the total occupation number from Eq.~(2) then give us the phase boundary, plotted as the blue symbols in Fig.~5b. The solid black lines are the best linear fit. Above the line, the polariton gas is quantum-degenerate, and below it, the gas is classical. \n\nIt has been a longstanding assumption that the Bose condensation effects seen in polariton systems are a direct result of the quantum nature of the system when $r_s \\sim \\lambda_{T}$, but up to now it has not been possible to directly test this.  By using high-quality microcavities with lifetimes over an order of magnitude longer than those of previous samples, polaritons within a two-dimensional flat optical trap are seen to unambiguously show thermal Bose-Einstein statistics. This clearly distinguishes polariton condensation from the conventional lasing effect in semiconductor materials. \n\nNow that we have samples in which true equilibrium can be established, new experiments are possible to test theoretical predictions of interacting Bose gas theory which have been elusive in cold atom experiments. For example, studies can be conducted of the excitation spectrum of the interacting Bose gas, and of the crossover from 2D to 1D equilibrium which can be controlled by spatial shaping of the excitation light to make tailored potential energy landscapes. Characteristics of the nonequilibrium state can also be studied systematically by varying the cavity detuning to control the polariton interaction strength. Dynamical relaxation into the equilibrium state can also be studied by using pulsed rather than c.w. excitation followed by time-resolved measurements, as well as the coherence properties as the system passes through the Berezinsky-Kosterlitz-Thouless (BKT) transition. \n\n\\bibliographystyle{sciencemag}\n\\bibliography{thermalization}\n\n\\vspace*{.5cm}\n\\noindent\\textbf{ACKNOWLEDGEMENTS} \\\\\nY.S., P.W., Y.Y. and K.A.N were supported as part of the Center for Excitonics, an Energy Frontier Research Center funded by the US Department of Energy, Office of Science, Office of Basic Energy Sciences under Award Number DE-SC0001088. G.L., M.S. and D.W.S. were  supported  by  the  National  Science  Foundation under grants PHY-1205762 and DMR-1104383. L.N.P. and K.W. were funded by the Gordon and Betty Moore Foundation through the EPiQS initiative Grant GBMF4420, and by the National Science Foundation MRSEC Grant DMR-1420541.\n\n\\vspace*{.5cm}\n\\noindent\\textbf{SUPPLEMENTARY MATERIALS} \\\\\nSOM Text\\\\\nFig.~S1 to S6\n\n\\vspace*{.5cm}\n\\noindent\\textbf{ADDITIONAL INFORMATION}\\\\\nCorrespondence and requests for materials should be addressed to Y.S. at ybsun@mit.edu or to D.W.S. at snoke@pitt.edu.\n\n\\newpage\n\\appendix\n\\setcounter{figure}{0}    \n\n\\begin{center}\n{\\bf \\large Supplementary Materials for Bose-Einstein Condensation of Long-Lifetime Polaritons in Thermal Equilibrium}\n\\end{center}\n\\begin{center}\n{Yongbao Sun,$^{1}{}^\\ast$  Patrick Wen,$^{1}$ Yoseob Yoon,$^{1}$ Gangqiang Liu,$^{2}$ Mark Steger,$^{2}$\\\\ Loren N. Pfeiffer,$^{3}$ Ken West,$^{3}$ David W. Snoke,$^{2}{}^\\ast$ and Keith A. Nelson,$^{1}$}\n\\end{center}\n\n\\begin{center}\n\\fontsize{10pt}{20pt}{\\it ${}^1$Department of Chemistry and Center for Excitonics, Massachusetts Institute of Technology, 77 \\\\ Massachusetts Avenue, Cambridge, MA 02139, USA}\\par\n\\fontsize{10pt}{20pt}{\\it ${}^2$Department of Physics, University of Pittsburgh, 3941 O'Hara St., Pittsburgh, PA 15218, USA}\\par\n\\fontsize{10pt}{20pt}{\\it ${}^3$Department of Electrical Engineering, Princeton University, Princeton, NJ 08544, USA}\\par\n\\end{center}\n\n\n\\noindent\\textbf{\\textrm{Detailed sample structure}}\\hspace{10pt} The structure of the sample used in the experiments described in the main text is shown in Fig.~\\ref{microcavity3d} and Fig.~\\ref{microcavity}a: three sets of four 7-nm GaAs quantum wells (QWs) are embedded at the three antinodes in a $3\\lambda/2$ microcavity, with the front and\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.75\\textwidth]{FigS3}\n   \\caption{ (color online) 3D illustration of microcavity structure used in this work. The red lines indicate the intensity distribution of the confined optical field. The red cone shows the pump laser beam. The dark and light gray alternate layers are the distributed Bragg reflectors (DBRs) that are used to confine the light in the cavity, shown as the orange region. Quantum wells (QWs) are shown as the orange layers. }\n\\label{microcavity3d}\n\\end{figure}\n back distributed Bragg reflectors (DBRs), composed of 32 and 40 pairs, respectively, of Al$_{0.2}$Ga$_{0.8}$As/AlAs $\\lambda/4$ layers. This microcavity structure is identical to semiconductor microcavity structures with short polariton lifetimes \\cite{Balili2007} except that the number of layers in the DBRs is doubled. This leads to an significant increase in the lifetime of the trapped cavity field to about 135 ps, implying a polariton lifetime at $\\delta = 0$ of 270 ps, which has been verified by transport measurements \\cite{Steger2015}. \n \nIn Fig.~\\ref{microcavity3d},  the cavity region is indicated as the orange section, and red lines show a plot of the intensity distribution of the confined light modes in the cavity. We also show the ring-shaped optical excitation beam as the red cone on the right side of the structure. The microcavity structure is wedged along one direction as shown  in Fig.~\\ref{microcavity}a, which allows tuning of photon resonance across the exciton resonance, thus allowing control of the exciton fraction in the polariton state. \n  \n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.75\\textwidth]{FigS3s}\n   \\caption{ (color online) Schematic illustration of microcavity structure used in this work. The dark and light gray alternative layers indicate the distributed Bragg reflectors (DBRs) that are used to confine the light in the cavity. Sets of quantum wells (QWs) are shown as the black lines. The wedged  cavity allows different cavity resonance frequencies to be selected. (b) Calculated white light reflectance of the sample structure. The black arrow indicates the second reflection minimum above stop band to which the the laser wavelength was tuned to match.}\n\\label{microcavity}\n\\end{figure}\n\nAlthough the concept of doubling the number of DBR layers is simple, the fabrication is not trivial, because it requires much longer fabrication times, approximately 30 hours of molecular-beam epitaxy (MBE), with tight control during the entire growth process.  If the growth process is not well controlled, inhomogeneities in the lower levels will be amplified in higher levels.\n\nFig.~\\ref{microcavity}b plots the simulated spectrum of white light reflection of a microcavity structure. The stop band for optical transmission spans from 740 nm to 820 nm. Peaks around 780 nm arise from lower and upper polariton resonances. In the measurements, we tuned the laser wavelength to the second reflection minimum above the stop band, as indicated by the black arrow.  \n\n\\vspace*{0.3cm}\n\\noindent\\textbf{\\textrm{Background on exciton-polaritons in semiconductor microcavities}}.\\hspace{10pt}  Exciton-polaritons are formed in semiconductor microcavities through strong coupling between optical modes of the microcavity and exciton transitions of a material embedded inside the microcavity \\cite{Kavokin2007, Deng2010, Snoke2010, Carusotto2013}. For the case of a single microcavity mode and a single exciton transition, two polariton modes, the upper and lower polaritons, are formed with energies $E_{LP}(k_{||})$ and $E_{UP}(k_{||})$ given by:\n\n", "index": 5, "text": "\\begin{align}\nE_{LP/UP}(k_{||}) = \\frac{1}{2}\\left[E_{X}({k_{||}}) + E_{C}(k_{||}) \\mp \\sqrt{\\Omega^2 + \\delta^2(k_{||})}\\right]\n\\label{eq:Epolariton}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle E_{LP/UP}(k_{||})=\\frac{1}{2}\\left[E_{X}({k_{||}})+E_{C}(k_{||})%&#10;\\mp\\sqrt{\\Omega^{2}+\\delta^{2}(k_{||})}\\right]\" display=\"inline\"><mrow><mrow><msub><mi>E</mi><mrow><mrow><mrow><mi>L</mi><mo>⁢</mo><mi>P</mi></mrow><mo>/</mo><mi>U</mi></mrow><mo>⁢</mo><mi>P</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mrow><msub><mi>E</mi><mi>X</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>E</mi><mi>C</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>∓</mo><msqrt><mrow><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup><mo>+</mo><mrow><msup><mi>δ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nThe coefficients, $X(k_{||})$ and $C(k_{||})$, are called the exciton and cavity Hopfield coefficients \\cite{Hopfield1958} and are given by \n\n", "itemtype": "equation", "pos": 37094, "prevtext": "\nwhere $k_{||}$ is the wave vector in the plane perpendicular to the microcavity confinement direction, $E_X(k_{||})$ is the energy of the exciton transition, $E_C(k_{||})$ is the energy of the cavity mode, $\\delta(k_{||})$ is the detuning energy defined as $\\delta(k_{||})=E_C(k_{||})-E_X(k_{||})$, and $\\Omega$ is the strength of radiative coupling between the exciton and cavity field, also known as full Rabi splitting energy. The confinement of light gives the cavity mode a parabolic dispersion in the plane perpendicular to the confinement direction: $E_C\\simeq E_C(0) + \\hbar^2k_{||}^2/2m_C$, where $m_C$ is the effective mass of the cavity field. This effective mass is typically $10^{-4}$ times lighter than the vacuum electron mass, and about $10^{-3}$ times less than an exciton in a GaAs quantum well structure, so that $E_X(k_{||})$ is essentially constant with $k_{||}$. The energies $E_X(k_{||}),E_C(k_{||}),E_{LP}(k_{||})$, and $E_{UP}(k_{||})$ are given in Fig.~\\ref{energy_dispersion} for three different values of $\\delta(k_{||}=0)$. The energies were calculated using (\\ref{eq:Epolariton}) and parameters matching the sample structure used in the experiments: $\\Omega = 10.84$ meV and $E_X(0)=1604.6$ meV. \n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.85\\textwidth]{FigS1}\n   \\caption{ (color online) Dispersion curves of polariton modes at three representative cavity detunings (a) $\\delta = -5$ meV, (b) $\\delta = 0$ meV, and (c) $\\delta = 5$ meV. The dotted line shows the confined cavity mode, and the dashed line shows the bare exciton mode. The blue and red solid lines indicate the upper polariton (UP) and lower polariton (LP) branches, respectively, arising from the strong coupling between cavity modes and exciton modes. Our sample parameters were used in the calculations.}\n\\label{energy_dispersion}\n\\end{figure}\n\nThe length of the cavity increases monotonically along one direction of the QW plane so that the energy of the cavity mode can be tuned relative to the exciton resonance energy, as shown in Fig.~\\ref{spatial_dispersion}, allowing us to experimentally tune $\\delta(k_{||}=0)$. The energies of all modes in Fig.~\\ref{energy_dispersion} are plotted as a function of $k_{||}$, the in-plane wave vector. \n\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.50\\textwidth]{FigS2}\n   \\caption{ (color online) (a) The calculated upper polariton (blue line) and lower polariton (red line) ground state ($k_{||}=0$) energies at different positions of the sample. The dashed line indicates the exciton energies, and the dotted line shows the cavity energies. (b) Excitonic fractions of upper polaritons (blue line) and  lower polaritons (red line) at different sample positions.}\n\\label{spatial_dispersion}\n\\end{figure}\n\nThe polariton modes are linear superpositions of the exciton and microcavity photon modes. The lower polariton and upper polariton operators, $\\hat{P}_{k_{||}}$ and $\\hat{Q}_{k_{||}}$, respectively, can be written in terms of exciton and cavity operators, $\\hat{a}_{k_{||}}$ and $\\hat{b}_{k_{||}}$:\n\n", "index": 7, "text": "\\begin{align}\n\\hat{P}_{k_{||}} &= X(k_{||})\\hat{a}_{k_{||}}+C(k_{||})\\hat{b}_{k_{||}k_{||}}\\\\\n\\hat{Q}_{k_{||}} &=-C(k_{||})\\hat{a}_{k_{||}}+X(k_{||})\\hat{b}_{k_{||}}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\hat{P}_{k_{||}}\" display=\"inline\"><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=X(k_{||})\\hat{a}_{k_{||}}+C(k_{||})\\hat{b}_{k_{||}k_{||}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mi>X</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></msub></mrow><mo>+</mo><mrow><mi>C</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>b</mi><mo stretchy=\"false\">^</mo></mover><mrow><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo>⁢</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></mrow></msub></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\hat{Q}_{k_{||}}\" display=\"inline\"><msub><mover accent=\"true\"><mi>Q</mi><mo stretchy=\"false\">^</mo></mover><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=-C(k_{||})\\hat{a}_{k_{||}}+X(k_{||})\\hat{b}_{k_{||}}.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mi>C</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></msub></mrow></mrow><mo>+</mo><mrow><mi>X</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>b</mi><mo stretchy=\"false\">^</mo></mover><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></msub></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\n\nThe characteristics of the polariton modes are determined by the coefficients, which depend on $\\delta(k_{||})$. The lower polariton is more photon-like and the upper polariton is more exciton-like for $\\delta(k_{||})<0$, and the lower polariton is more exciton-like and the upper polariton is more photon-like when $\\delta(k_{||})>0$. Due to the wedge in the cavity thickness, we can easily tune the excitonic fraction $|X(k_{||})|^2$ of lower polaritons by moving the excitation spot to different sample positions, as shown in Fig.~\\ref{spatial_dispersion}b, where we plot $|X(k_{||}=0)|^2$ at different positions on the sample. As seen in Fig.~\\ref{energy_dispersion} and Fig.~\\ref{spatial_dispersion}, the energies and shapes of the polariton dispersion curves depend strongly on $\\delta$:\npositive detuning results in lower polaritons that are more exciton-like, with a heavier effective mass and stronger interactions with phonons and other carriers, while negative detuning results in lower polaritons that are more photon-like, with a smaller effective polariton mass and weaker interactions with phonons and other carriers.\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Review of earlier thermalization data.}} Two earlier works have addressed in depth the thermalization of polaritons in short-lifetime samples. In Ref.~\\cite{Kasprzak2008}, the polariton condensate in CdTe-based samples was studied over a wide range of lattice temperatures. In the reported data, the distributions $ N(E)$ were of two types. At high temperature at low density, the distributions fit a classical Maxwell-Boltzmann distribution. At low temperature and high density, the distributions  had a peak at $E=0$,  but could not be fit by an equilibrium Bose-Einstein distribution with a well-defined temperature and chemical potential. For example, in the curve for $T$ = 5.3 K in Fig.~1a of Ref.~\\cite{Kasprzak2008}, the best fit to an equilibrium Bose-Einstein distribution missed the data by about a factor of 10 at low energy. There was no comparison of the data at different densities, so that the meaningfulness of the fit values of chemical potential (in particular, the prediction of the absolute number of particles from the chemical potential) could not be verified. The interaction strength of the polaritons was varied by changing the detuning, and it was shown that the distributions became much farther from equilibrium as the interaction strength decreased. \n\nIn Ref.~\\cite{Deng2006}, the interaction strength was also varied by changing the detuning, and it was shown that for weak interactions, the distribution $N(E)$ was far from equilibrium, while for strongly excitonic detuning (6 to 9 meV), the distribution became more thermalized. Reasonable fits to a Bose-Einstein equilibrium distribution were reported, but the system as a whole was still strongly in nonequilibrium. An intense pulsed laser was used, which gave a rapidly changing temperature and density of the polaritons on time scales of tens of picoseconds. It could be argued, however, that on short time scales of 1-2 picoseconds, the gas could be considered to be in quasi-equilibrium. More significantly, the strongly excitonic nature of the polaritons gave them a very short mean free path, which implies a very low diffusion constant. Since the polaritons were generated with a single laser spot, this led to an inhomogeneous spatial distribution. The momentum-space data were collected by integrating over the entire spatial profile. In this type of experiment with short-lifetime polaritons and a single Gaussian laser excitation spot, the potential-energy profile felt by the polaritons is strongly renormalized, leading to both self-trapping of the condensate in a small, quasi-harmonic potential inside the laser spot \\cite{Deng2003}, and free streaming away from the spot \\cite{Richard2005}. In general, it has been shown that integration of a spatially inhomogeneous distribution can lead to misleading fits to a Bose-Einstein distribution \\cite{OHara2000}, although reasonable assumptions for density and temperature variations can give fits with an average temperature and chemical potential \\cite{Snoke1990}. \n\nLater work by the same group \\cite{Roumpos2012} with the same short-lifetime structure used a large laser spot with a flat intensity profile and resonant detuning that gave longer mean free path to reduce the spatial inhomogeneity. In this configuration, the spatial coherence properties were measured. The power law for the spatial coherence was found to depend crucially on the nonequilibrium nature of the polariton gas \\cite{Roumpos2012, Dagvadorj2015}.\n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS4}} \n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS9}} \n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS5}} \n\\caption{Energy distributions of polaritons (dots) and the best fits to equilibrium Bose-Einstein model (solid lines)  at a bath temperature of $T=10.0$ K (a), $T=17.5$K (b) and $T=25.0$  K(c), with corresponding threshold pump powers $P_{BE}=435$ mW, $P_{BE} = 474$ mW, and $P_{BE} = 557$ mW, respectively. }\n\\label{Edistribution}\n\\end{figure}\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Energy distributions at different temperatures.}} In Fig.~\\ref{Edistribution}, we show the energy distributions at three representative  bath temperatures, i.e., $T_{bath}=10.0$ K, $T_{bath}=17.5$ K and $T_{bath} = 25.0$ K, in our measurements for a series of pump powers. As seen in these figures, the distributions at all temperatures fit well to the ideal Bose-Einstein function in Eq.~(1) in the main text, up to a ground-state occupation number $N(0) \\sim$ 2--3. At higher densities, the distribution deviates from the ideal Bose-Einstein distribution. This is not surprising, since many-body effects play an important role when there is a large ground state occupation.\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Goodness of fit.}} Following Ref.~\\cite{interactions}, we calculated polariton number in the field of view by integrating the fitted distribution \n\n", "itemtype": "equation", "pos": 37414, "prevtext": "\nThe coefficients, $X(k_{||})$ and $C(k_{||})$, are called the exciton and cavity Hopfield coefficients \\cite{Hopfield1958} and are given by \n\n", "index": 9, "text": "\\begin{align}\n|X(k_{||})|^2 &= \\frac{1}{2}\\left(1+\\frac{\\delta(k_{||})}{\\sqrt{\\delta^2(k_{||})+\\Omega^2}}\\right)\\\\\n|C(k_{||})|^2 &= \\frac{1}{2}\\left(1-\\frac{\\delta(k_{||})}{\\sqrt{\\delta^2(k_{||}k_{||})+\\Omega^2}}\\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle|X(k_{||})|^{2}\" display=\"inline\"><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>X</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{2}\\left(1+\\frac{\\delta(k_{||})}{\\sqrt{\\delta^{2}(k_{||}%&#10;)+\\Omega^{2}}}\\right)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><msqrt><mrow><mrow><msup><mi>δ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle|C(k_{||})|^{2}\" display=\"inline\"><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>C</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{2}\\left(1-\\frac{\\delta(k_{||})}{\\sqrt{\\delta^{2}(k_{||}%&#10;k_{||})+\\Omega^{2}}}\\right).\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><msqrt><mrow><mrow><msup><mi>δ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub><mo>⁢</mo><msub><mi>k</mi><mrow><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">|</mo></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nwhere $g = 2$ is the spin degeneracy factor of polaritons, $m$ is the effective mass of polaritons, $S$ is area of the field of view, and $E_{max}$ is the upper bound of the energy limit collected by the objective lens. We also computed the polariton number in the field of view by directly summing up the CCD count per second multiplied by the appropriate conversion factor, namely\n\n", "itemtype": "equation", "pos": 43755, "prevtext": "\n\nThe characteristics of the polariton modes are determined by the coefficients, which depend on $\\delta(k_{||})$. The lower polariton is more photon-like and the upper polariton is more exciton-like for $\\delta(k_{||})<0$, and the lower polariton is more exciton-like and the upper polariton is more photon-like when $\\delta(k_{||})>0$. Due to the wedge in the cavity thickness, we can easily tune the excitonic fraction $|X(k_{||})|^2$ of lower polaritons by moving the excitation spot to different sample positions, as shown in Fig.~\\ref{spatial_dispersion}b, where we plot $|X(k_{||}=0)|^2$ at different positions on the sample. As seen in Fig.~\\ref{energy_dispersion} and Fig.~\\ref{spatial_dispersion}, the energies and shapes of the polariton dispersion curves depend strongly on $\\delta$:\npositive detuning results in lower polaritons that are more exciton-like, with a heavier effective mass and stronger interactions with phonons and other carriers, while negative detuning results in lower polaritons that are more photon-like, with a smaller effective polariton mass and weaker interactions with phonons and other carriers.\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Review of earlier thermalization data.}} Two earlier works have addressed in depth the thermalization of polaritons in short-lifetime samples. In Ref.~\\cite{Kasprzak2008}, the polariton condensate in CdTe-based samples was studied over a wide range of lattice temperatures. In the reported data, the distributions $ N(E)$ were of two types. At high temperature at low density, the distributions fit a classical Maxwell-Boltzmann distribution. At low temperature and high density, the distributions  had a peak at $E=0$,  but could not be fit by an equilibrium Bose-Einstein distribution with a well-defined temperature and chemical potential. For example, in the curve for $T$ = 5.3 K in Fig.~1a of Ref.~\\cite{Kasprzak2008}, the best fit to an equilibrium Bose-Einstein distribution missed the data by about a factor of 10 at low energy. There was no comparison of the data at different densities, so that the meaningfulness of the fit values of chemical potential (in particular, the prediction of the absolute number of particles from the chemical potential) could not be verified. The interaction strength of the polaritons was varied by changing the detuning, and it was shown that the distributions became much farther from equilibrium as the interaction strength decreased. \n\nIn Ref.~\\cite{Deng2006}, the interaction strength was also varied by changing the detuning, and it was shown that for weak interactions, the distribution $N(E)$ was far from equilibrium, while for strongly excitonic detuning (6 to 9 meV), the distribution became more thermalized. Reasonable fits to a Bose-Einstein equilibrium distribution were reported, but the system as a whole was still strongly in nonequilibrium. An intense pulsed laser was used, which gave a rapidly changing temperature and density of the polaritons on time scales of tens of picoseconds. It could be argued, however, that on short time scales of 1-2 picoseconds, the gas could be considered to be in quasi-equilibrium. More significantly, the strongly excitonic nature of the polaritons gave them a very short mean free path, which implies a very low diffusion constant. Since the polaritons were generated with a single laser spot, this led to an inhomogeneous spatial distribution. The momentum-space data were collected by integrating over the entire spatial profile. In this type of experiment with short-lifetime polaritons and a single Gaussian laser excitation spot, the potential-energy profile felt by the polaritons is strongly renormalized, leading to both self-trapping of the condensate in a small, quasi-harmonic potential inside the laser spot \\cite{Deng2003}, and free streaming away from the spot \\cite{Richard2005}. In general, it has been shown that integration of a spatially inhomogeneous distribution can lead to misleading fits to a Bose-Einstein distribution \\cite{OHara2000}, although reasonable assumptions for density and temperature variations can give fits with an average temperature and chemical potential \\cite{Snoke1990}. \n\nLater work by the same group \\cite{Roumpos2012} with the same short-lifetime structure used a large laser spot with a flat intensity profile and resonant detuning that gave longer mean free path to reduce the spatial inhomogeneity. In this configuration, the spatial coherence properties were measured. The power law for the spatial coherence was found to depend crucially on the nonequilibrium nature of the polariton gas \\cite{Roumpos2012, Dagvadorj2015}.\n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS4}} \n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS9}} \n\\subfloat{\\includegraphics[width=0.32\\textwidth]{FigS5}} \n\\caption{Energy distributions of polaritons (dots) and the best fits to equilibrium Bose-Einstein model (solid lines)  at a bath temperature of $T=10.0$ K (a), $T=17.5$K (b) and $T=25.0$  K(c), with corresponding threshold pump powers $P_{BE}=435$ mW, $P_{BE} = 474$ mW, and $P_{BE} = 557$ mW, respectively. }\n\\label{Edistribution}\n\\end{figure}\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Energy distributions at different temperatures.}} In Fig.~\\ref{Edistribution}, we show the energy distributions at three representative  bath temperatures, i.e., $T_{bath}=10.0$ K, $T_{bath}=17.5$ K and $T_{bath} = 25.0$ K, in our measurements for a series of pump powers. As seen in these figures, the distributions at all temperatures fit well to the ideal Bose-Einstein function in Eq.~(1) in the main text, up to a ground-state occupation number $N(0) \\sim$ 2--3. At higher densities, the distribution deviates from the ideal Bose-Einstein distribution. This is not surprising, since many-body effects play an important role when there is a large ground state occupation.\n\n\\vspace*{.3cm}\n\\noindent\\textbf{\\textrm{Goodness of fit.}} Following Ref.~\\cite{interactions}, we calculated polariton number in the field of view by integrating the fitted distribution \n\n", "index": 11, "text": "\\begin{align}\nN_{fit} &= \\frac{gmS}{2\\pi\\hbar^2}\\int_0^{E_{max}}N(E)dE \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle N_{fit}\" display=\"inline\"><msub><mi>N</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{gmS}{2\\pi\\hbar^{2}}\\int_{0}^{E_{max}}N(E)dE\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>g</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>S</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">ℏ</mi><mn>2</mn></msup></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><msub><mi>E</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub></msubsup></mstyle><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>E</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nwhere $N_i,\\tau_i$ and $M_i$ are the CCD counts per second, the lifetime of the polariton state, and the density of $k$ states at pixel $i$. $\\xi$ accounts for the overall optical efficiency of the collection setup, including the loss in the dispersive grating and the quantum efficiency of the CCD. We define the goodness of fit as \n\n", "itemtype": "equation", "pos": 44222, "prevtext": "\nwhere $g = 2$ is the spin degeneracy factor of polaritons, $m$ is the effective mass of polaritons, $S$ is area of the field of view, and $E_{max}$ is the upper bound of the energy limit collected by the objective lens. We also computed the polariton number in the field of view by directly summing up the CCD count per second multiplied by the appropriate conversion factor, namely\n\n", "index": 13, "text": "\\begin{align}\nN_{int} &= \\sum_i\\frac{N_i\\tau_i}{\\xi M_i} \\label{sum_CCD}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle N_{int}\" display=\"inline\"><msub><mi>N</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{i}\\frac{N_{i}\\tau_{i}}{\\xi M_{i}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder></mstyle><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>N</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>τ</mi><mi>i</mi></msub></mrow><mrow><mi>ξ</mi><mo>⁢</mo><msub><mi>M</mi><mi>i</mi></msub></mrow></mfrac></mstyle></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.50\\textwidth]{FigS6}\n   \\caption{ (color online) Goodness of fit at different bath temperatures.}\n\\label{gof}\n\\end{figure}\nwhere the superscript $c$ indicates the critical point of Bose degeneracy determined from main text. This quantity can be used as a quantitative measure of the overall quality of Bose-Einstein fitting. Fig.~\\ref{gof} plots the $gof$ at the critical threshold $\\mu/k_BT = -\\ln 2$ for the data shown in Fig.~5b of the main text. As can be seen, this factor varies within $5\\%$ for most of the temperatures. This confirms the high-quality fits, and thus confirms full thermalization of polariton gas in the range of studied temperatures. The slight increase in the $gof$ might come from the temperature-dependent emission rate of polaritons, which was not taken into account in the current data analysis routine. \n\n\\vspace{.3cm}\n\\noindent\\textbf{\\textrm{Replot of phase diagram.}} Fig.~5b in the main text shows the phase diagram deduced by fitting the $N(E)$ data to a Bose-Einstein distribution, and then integrating the fit curve using Eq.~(2) in the main text. This method allows us to account for the high-energy tail of the particle distribution which extends outside of our detected range, due to the fact that high-energy states correspond to high $k_{\\|}$, which give light emission outside the numerical aperture of our collection lens. Fig.~S6 shows two alternate ways of deducing the phase diagram, which rely less on the theoretical fit. \n\nFig.~\\ref{phase_diagram}(a) plots the total number of particles computed from summing the CCD counts per second as in Eq.~(\\ref{sum_CCD}), without using any fit.\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.90\\textwidth]{FigS7}\n   \\caption{ (color online) $N_{BE}$ in the field of view versus $T_{BE}$, with $N_{BE}$ computed from only summing the CCD counts in the field of view (a) and including high-energy corrections (b). Solid lines are best linear fits $N_{BE}\\propto T_{BE}$. }\n\\label{phase_diagram}\n\\end{figure}\nThe black line is the best linear fit $y\\propto x$. As can be seen, this plot deviates from linearity. This deviation is a result of the change in the fraction of polaritons in the field of view at different temperatures. As the temperature of the polaritons increases, the energy distribution tends to become broad, as indicated by a reduction in the slope in the semilog plot of $N(E)$ in Fig.~2 in the main text, and this will lead to more polaritons outside of the field of view of our measurements. \n\nFig.~\\ref{phase_diagram}b shows a correction to Fig.~\\ref{phase_diagram}a, using the integrated CCD counts within the field of view, but adding a correction for the high-energy tail outside our field of view, based on the fits to the Bose-Einstein distribution.  The particle numbers plotted in Fig.~\\ref{phase_diagram}b are therefore\n\n", "itemtype": "equation", "pos": 44641, "prevtext": "\nwhere $N_i,\\tau_i$ and $M_i$ are the CCD counts per second, the lifetime of the polariton state, and the density of $k$ states at pixel $i$. $\\xi$ accounts for the overall optical efficiency of the collection setup, including the loss in the dispersive grating and the quantum efficiency of the CCD. We define the goodness of fit as \n\n", "index": 15, "text": "\\begin{align}\ngof &= \\frac{N_{fit}^c}{N_{int}^c}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle gof\" display=\"inline\"><mrow><mi>g</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>f</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{N_{fit}^{c}}{N_{int}^{c}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><msubsup><mi>N</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow><mi>c</mi></msubsup><msubsup><mi>N</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi></mrow><mi>c</mi></msubsup></mfrac></mstyle></mrow></math>", "type": "latex"}, {"file": "1601.02581.tex", "nexttext": "\nwhere $N_{int}$ is determined using Eq.~(\\ref{sum_CCD}), and the temperature and chemical potential in $N(E)$ are taken from the fitted values of Bose-Einstein distributions. The polariton population beyond the upper bound $E=20$ meV of the integration is negligible. The black line is a fitted linear relation. The difference is negligible compared to Fig.~5 in the main text, which is not surprising because of the fits to the Bose-Einstein distribution fall on top of the data at all temperatures. Compared to Fig.~\\ref{phase_diagram}a, the proportionality is improved because of the inclusion of polariton populations at high energies which are outside of our field of view.\n\n\n\n\n\n", "itemtype": "equation", "pos": 47610, "prevtext": "\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.50\\textwidth]{FigS6}\n   \\caption{ (color online) Goodness of fit at different bath temperatures.}\n\\label{gof}\n\\end{figure}\nwhere the superscript $c$ indicates the critical point of Bose degeneracy determined from main text. This quantity can be used as a quantitative measure of the overall quality of Bose-Einstein fitting. Fig.~\\ref{gof} plots the $gof$ at the critical threshold $\\mu/k_BT = -\\ln 2$ for the data shown in Fig.~5b of the main text. As can be seen, this factor varies within $5\\%$ for most of the temperatures. This confirms the high-quality fits, and thus confirms full thermalization of polariton gas in the range of studied temperatures. The slight increase in the $gof$ might come from the temperature-dependent emission rate of polaritons, which was not taken into account in the current data analysis routine. \n\n\\vspace{.3cm}\n\\noindent\\textbf{\\textrm{Replot of phase diagram.}} Fig.~5b in the main text shows the phase diagram deduced by fitting the $N(E)$ data to a Bose-Einstein distribution, and then integrating the fit curve using Eq.~(2) in the main text. This method allows us to account for the high-energy tail of the particle distribution which extends outside of our detected range, due to the fact that high-energy states correspond to high $k_{\\|}$, which give light emission outside the numerical aperture of our collection lens. Fig.~S6 shows two alternate ways of deducing the phase diagram, which rely less on the theoretical fit. \n\nFig.~\\ref{phase_diagram}(a) plots the total number of particles computed from summing the CCD counts per second as in Eq.~(\\ref{sum_CCD}), without using any fit.\n\\begin{figure}[htbp]\n\\centering\n  \\includegraphics[width=0.90\\textwidth]{FigS7}\n   \\caption{ (color online) $N_{BE}$ in the field of view versus $T_{BE}$, with $N_{BE}$ computed from only summing the CCD counts in the field of view (a) and including high-energy corrections (b). Solid lines are best linear fits $N_{BE}\\propto T_{BE}$. }\n\\label{phase_diagram}\n\\end{figure}\nThe black line is the best linear fit $y\\propto x$. As can be seen, this plot deviates from linearity. This deviation is a result of the change in the fraction of polaritons in the field of view at different temperatures. As the temperature of the polaritons increases, the energy distribution tends to become broad, as indicated by a reduction in the slope in the semilog plot of $N(E)$ in Fig.~2 in the main text, and this will lead to more polaritons outside of the field of view of our measurements. \n\nFig.~\\ref{phase_diagram}b shows a correction to Fig.~\\ref{phase_diagram}a, using the integrated CCD counts within the field of view, but adding a correction for the high-energy tail outside our field of view, based on the fits to the Bose-Einstein distribution.  The particle numbers plotted in Fig.~\\ref{phase_diagram}b are therefore\n\n", "index": 17, "text": "\\begin{align}\nN_{tot} &= N_{int}+ \\frac{gmS}{2\\pi\\hbar^2}\\int_{E_{max}}^{E= \\textrm{20 meV}}N(E)dE \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle N_{tot}\" display=\"inline\"><msub><mi>N</mi><mrow><mi>t</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=N_{int}+\\frac{gmS}{2\\pi\\hbar^{2}}\\int_{E_{max}}^{E=\\textrm{20 %&#10;meV}}N(E)dE\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><msub><mi>N</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>g</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>S</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">ℏ</mi><mn>2</mn></msup></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>E</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mrow><mi>E</mi><mo>=</mo><mtext>20 meV</mtext></mrow></msubsup></mstyle><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>E</mi></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}]