[{"file": "1601.02594.tex", "nexttext": "\nwhere $f_{st}$ is the hopping integral of fermionic partons between nearest neighbors (to be determined below) and $\\mu$ is the chemical potential. This Hamiltonian can be viewed as a ``mean field\" theory of the original SU(3) spin problem. The chemical potential $\\mu$ is chosen to ensure that the particle number constraint is satisfied on average. A trial wave function in the physical spin Hilbert space should satisfy the single occupancy constraint rigorously, which can be written as a Gutzwiller projected wave function\n\n", "itemtype": "equation", "pos": 13603, "prevtext": "\n\n\\title{Possible SU(3) Chiral Spin Liquid on the Kagome Lattice}\n\n\\author{Ying-Hai Wu}\n\\email{yinghai.wu@mpq.mpg.de}\n\n\\author{Hong-Hao Tu}\n\\email{hong-hao.tu@mpq.mpg.de}\n\n\\affiliation{Max-Planck-Institut f{\\\"u}r Quantenoptik, Hans-Kopfermann-Stra{\\ss}e 1, 85748 Garching, Germany}\n\n\\date{\\today}\n\n\\begin{abstract}\nWe propose an SU(3) symmetric Hamiltonian with short-range interactions on the Kagome lattice and show that it hosts an Abelian chiral spin liquid (CSL) state. We provide numerical evidence based on exact diagonalization to show that this CSL state is stabilized in an extended region of the parameter space and can be viewed as a lattice version of the Halperin 221 fractional quantum Hall (FQH) state of two-component bosons. We also construct a parton wave function for this CSL state and demonstrate that its variational energies are in good agreement with exact diagonalization results. The parton description further supports that the CSL is characterized by a chiral edge conformal field theory (CFT) of the SU(3)$_1$ Wess-Zumino-Witten type.\n\\end{abstract}\n\\maketitle\n\n{\\em Introduction} -- Topological aspects of condensed matter have been actively studied since the discovery of the quantum Hall effect. An important development in this area is the concept of topological order~\\cite{wen2004}, which describes phases that can not be distinguished using the conventional symmetry breaking paradigm but exhibit exotic topological properties such as fractional charge, anyonic braiding statistics, and ground state degeneracy on high genus manifold. Besides the FQH states, it has long been speculated that there could be topologically ordered states in antiferromagnetic spin systems (called spin liquid) which do not break the crystalline symmetries or spin rotation symmetries. To suppress the tendency of forming magnetic orders, one should consider frustrated lattices in which no simple alignment of spins can achieve the lowest energy under antiferromagnetic exchange. The Kagome lattice has been very promising in this regard, and recent numerical and experimental studies indeed point to the existence of spin liquid states in certain systems~\\cite{yan2011,han2012,jiang2012,depenbrock2012,he2014,gong2014,bauer2014}.\n\nThe theoretical study of strongly correlated spin systems is generally very difficult. Being motivated by the large $N$ expansion in gauge field theory, it has been proposed that one may investigate SU(N) spin systems using similar perturbative methods (organized in powers of $1/N$) to obtain some hints about the physics of SU(2) spins~\\cite{arovas1988,affleck1988b,read1989,hermele2009}. One may worry that the perturbative results obtained in the large $N$ limit might not be applicable when $N$ is small, so other theoretical methods and numerical calculations are also essential in understanding the physics. Exactly solvable models, such as the Uimin-Lai-Sutherland model~\\cite{uimin1970,lai1974,sutherland1975}, the Haldane-Shastry type models~\\cite{haldane1988,shastry1988,kawakami1992,ha1992}, the Affleck-Kennedy-Lieb-Tasaki type models~\\cite{affleck1987,affleck1991,chen2005,greiter2007a,greiter2007b,arovas2008}, have been designed and they provide useful insight into SU(N) spin systems. Another widely used method is to decompose the spins as bosonic or fermionic partons and build exotic spin states using mean field states of the partons and Gutzwiller projection. Based on different approaches, a rich variety of physical phenomena has been revealed in SU(N) spin systems~\\cite{azaria1999,zhang2001,harada2003,corboz2011,bieri2012,honerkamp2004,cazalilla2009,gorshkov2010,manmana2011,nonne2013}.\n\nIt might appear at first sight that SU(N) spin systems are not relevant in experiments because the spins in solid state systems are almost all due to electrons so belong to the SU(2) group. However, it was proposed~\\cite{li1998,yamashita1998} that the SU(4) Heisenberg model might describe certain materials in which SU(4) symmetry arise from coupled spin and orbital degrees of freedom~\\cite{kugel1973}. There has also been substantial progress in experiments using cold atoms with several internal states, which brings SU(N) spin systems even closer to experimental reality~\\cite{taie2010,taie2012,zhang2014,scazza2014}. The atomic species, lattice configurations, and the forms of interactions in cold atom experiments can be tuned in a wide range~\\cite{bloch2008,cazalilla2014}, which would enable us to explore the rich physics associated with SU(N) spins.\n\nThe connection between FQH states and spin liquid was revealed in a seminal work by Kalmeyer and Laughlin~\\cite{kalmeyer1987}, which demonstrated that bosonic FQH states can be mapped to spin states. In this example, one maps the spin-$1/2$ degree of freedom on a lattice site to a boson and impose the hard-core constraint such that there is at most one boson per site. This can be generalized to cases where the lattice sites have higher spins of the SU(2) group \\cite{greiter2009}. We will explain below how to map SU(3) spins to bosons and establish a correspondence between SU(3) spin liquid and FQH states of two-component bosons.\n\nBeing equipped with the mapping between FQH and spin liquid states, we can use some techniques developed for FQH states to understand spin liquid. One fruitful way in the FQH context is to express FQH wave functions as chiral correlators of CFTs~\\cite{moore1991,nielsen2012}. The advantage of this approach is that, by using CFT null field technique~\\cite{nielsen2011}, it can give a parent Hamiltonian with the spin liquid as its exact ground state~\\cite{nielsen2012,tu2013a,tu2014b,bondesan2014} (see Refs.~\\cite{schroeter2007,greiter2014} for alternative ways of deriving parent Hamiltonians). However, these parent Hamiltonians usually contain long-range interactions. To be more realistic, it is of great importance to test where the spin liquid states can be stabilized using Hamiltonians consist of only simple short-range interactions~\\cite{nielsen2013,glasser2015}.\n\n{\\em Mapping SU(3) Spins to Bosons} --- To make connections between SU(3) spin models and two-component FQH wave functions, we briefly review their properties. The generators of the SU(3) group are usually chosen to be the eight $3\\times3$ Gell-Mann matrices $\\lambda_i$ ($i=1,2,\\cdots,8$). For a lattice where each site is described by the fundamental representation and the whole system is described by an SU(3) invariant Hamiltonian, the local Hilbert space dimension is three and there are two U(1) symmetries. To formulate a boson description, we may interpret the lattice as being occupied by two-component bosons (the two internal states are labeled as $\\uparrow$ and $\\downarrow$). Imposing the hard-core constraint that allows for at most one boson on each site results in a local Hilbert space dimension three ({\\em i.e.} empty, one $\\uparrow$ boson, and one $\\downarrow$ boson). The two U(1) symmetries correspond to the particle number conservation of these two types of bosons.\n\nThe simplest FQH state of two-component bosons is the Halperin 221 state at filling factor $2/3$~\\cite{halperin1983}\n\\begin{eqnarray}\n\\Psi_{221} = \\prod^{M}_{s>t=1} (z^{\\uparrow}_s-z^{\\uparrow}_t)^2 (z^{\\downarrow}_s-z^{\\downarrow}_t)^2 \\prod^{M}_{s,t=1} (z^{\\uparrow}_s-z^{\\downarrow}_t),\n\\end{eqnarray}\nwhere $z=x+iy$ is the complex coordinate in two dimensions and the superscripts indicate the internal states. The low-energy properties of this state is encoded in the Chern-Simons theory with the Lagrangian\n\\begin{eqnarray}\n{\\mathcal L} = \\frac{1}{4\\pi} K_{IJ} \\epsilon^{\\mu\\nu\\rho} a^{I}_{\\mu} \\partial_\\nu a^{J}_{\\rho},\n\\end{eqnarray}\nwhere $K_{IJ}$ is the $2\\times2$ matrix\n\\begin{eqnarray}\n\\left(\\begin{array}{cc}\n2 & 1 \\\\\n1 & 2\n\\end{array}\\right)\n\\label{Kmatrix}\n\\end{eqnarray}\nOne characteristic signature of topologically ordered states, the ground state degeneracy on torus, can be deduced from this Chern-Simons theory as ${\\rm det}K=3$. The Chern-Simons action also provides useful information about its edge physics: the $K$ matrix has two positive eigenvalues, so there are two copropagating edge modes described by $U(1){\\times}U(1)$ bosons. For bosons in the lowest Landau level, this state is the exact ground state if there are only contact interactions $\\sum_{\\sigma\\tau} \\delta({\\mathbf r}^\\sigma-{\\mathbf r}^\\tau)$ between all the bosons regardless of their spins. The contact interaction forbids two bosons to appear at the same position, which is somewhat equivalent to the constraint of having at most one boson per site in the boson description of SU(3) spin systems. In general, the spin models defined on a lattice appear to be very different from the simple continuum model, but their low-energy effective theories are the same Chern-Simons. This can be seen from the parton construction of the SU(3) chiral spin liquid state (see below).\n\n\\begin{figure}\n\\includegraphics[width=0.49\\textwidth]{Figure1.pdf}\n\\caption{The Kagome lattice with 18 sites. The red circles illustrate the three types of terms $P_{st}$, $Q_{rst}$, and $Q^{-1}_{rst}$ in the SU(3) Hamiltonian~(\\ref{eq:Hamiltonian}). The green arrows on the small triangles and the numbers in their vicinity give the hopping phases in the parton mean field Hamiltonian~(\\ref{eq:partonMF}).}\n\\label{Figure1}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=0.49\\textwidth]{Figure2.pdf}\n\\caption{Numerical results on the Kagome lattice with 18 sites. (a) energy spectra at $K_1=0.6$ and $K_2=0.4$; (b) energy spectra at $K_1=0.6$ and $K_2=0.5$; (c) $E_{\\rm gap}$ at $K_1=0.0,0.1,\\cdots,1.0$ and $K_2=0.3,0.4,\\cdots,0.7$; (d) $E_{\\rm split}$ at $K_1=0.0,0.1,\\cdots,1.0$ and $K_2=0.3,0.4,\\cdots,0.7$. The value of $J$ is chosen to be 1 in all calculations.}\n\\label{Figure2}\n\\end{figure}\n\n{\\em Exact Diagonalization} --- The CFT construction provides us parent Hamiltonians for which the SU(3) spin liquids are exact ground states~\\cite{tu2014b,bondesan2014}. These Hamiltonians inevitably contain long-range terms but they provide useful hints about what kind of short-range Hamiltonians might have ground states in the same phase. A general Hamiltonian can be written in terms of the Gell-Mann matrices, but SU(3) invariance gives stringent constrains on the Hamiltonians and it is usually more convenient to express them in terms of swapping operators. For our purpose, we need to define two-body and three-body swapping operators $P_{st}$ and $Q_{rst}$. When $P_{st}$ is applied on a state, the spin states on the lattice sites $s$ and $t$ are exchanged. When $Q_{rst}$ is applied on a state, the spin states on lattice $r$, $s$ and $t$ are cyclically permuted in a counterclockwise way.\n\nThe short-range Hamiltonian we have tested consists of two-body terms acting on all nearest neighbors and three-body terms acting on all small triangles\n\\begin{eqnarray}\nH &=& J \\sum_{\\langle{st}\\rangle} P_{st} + (K_1 - i K_2) \\sum_{\\langle{rst}\\rangle} Q_{rst} \\nonumber \\\\\n  &+& (K_1 + i K_2) \\sum_{\\langle{rst}\\rangle} Q^{-1}_{rst},\n  \\label{eq:Hamiltonian}\n\\end{eqnarray}\nwhere $Q^{-1}_{rst}$ means permuting the spin states clockwisely (equivalent to two counterclockwise permutations). In Fig.~\\ref{Figure1}, we show a Kagome lattice with 18 sites ($3$ unit cells along one direction and $2$ unit cells along the other direction) as well as the terms in the Hamiltonian. The Hamiltonian~(\\ref{eq:Hamiltonian}) is SU(3) invariant, so its eigenstates belong to definite representations of the SU(3) group. We impose periodic boundary conditions in both directions so the eigenstates also have good momentum quantum numbers. We choose $J=1$ as the energy scale and vary $K_{1,2}$ over a broad range to search for the optimal values that may stabilize a SU(3) chiral spin liquid. In the thermodynamic limit, the spin liquid state that we seek has three degenerate ground states but their energies generally split in finite size systems. To characterize the energy spectra quantitatively, we plot in Fig.~\\ref{Figure2} the gap $E_{\\rm gap}$ between the third state and the fourth state as well as the energy splitting $E_{\\rm split}$ of the lowest three eigenstates. The first hint of the existence of a spin liquid is that $E_{\\rm gap}$ is sufficiently large while $E_{\\rm split}$ is small enough. One can see that this is indeed the case in a region around $K_1\\approx0.6$ and $K_2\\approx0.45$. It is also important to confirm that the three quasi-degenerate ground states are SU(3) singlets, which we have done by explicit calculations in several cases [including the two spectra shown in Fig.~\\ref{Figure2} (a) and (b)]. Furthermore, it is found that the ground states occur in the $K_x=0$ and $K_y=0$ momentum sector. We have obtained similar results for the Kagome lattice with $12$ sites ($2$ unit cells along both directions).\n\n\\emph{Parton Wave Functions} --- To gain further insights into the nature of the ground states of the SU(3) Hamiltonian (\\ref{eq:Hamiltonian}), we now resort to a parton wave function description of the numerically observed spin liquid phase. This relies on a fermionic representation of the SU(3) spins, where the three local states are encoded using singly occupied fermions, $|\\alpha\\rangle =c^{\\dagger}_{\\alpha}|0\\rangle$ ($\\alpha=1,2,3$). The redundant states in the fermionic Hilbert space are removed by a Gutzwiller projector $P_{\\mathrm{G}}$ which locally enforce single occupancy on each site, {\\em i.e.} $\\sum_{\\alpha}c^{\\dagger}_{s\\alpha}c_{s\\alpha}=1$ $\\forall s$.\n\nWe assume that the partons are described by the free fermion Hamiltonian\n\n", "index": 1, "text": "\\begin{equation}\nH_{\\rm parton} = \\sum_{\\alpha} \\sum_{\\langle{st}\\rangle} f_{st} c^{\\dagger}_{s\\alpha} c_{t\\alpha} - \\mu \\sum_{\\alpha} \\sum_{s} c^{\\dagger}_{s\\alpha} c_{s\\alpha},\n\\label{eq:partonMF}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H_{\\rm parton}=\\sum_{\\alpha}\\sum_{\\langle{st}\\rangle}f_{st}c^{\\dagger}_{s%&#10;\\alpha}c_{t\\alpha}-\\mu\\sum_{\\alpha}\\sum_{s}c^{\\dagger}_{s\\alpha}c_{s\\alpha},\" display=\"block\"><mrow><mrow><msub><mi>H</mi><mi>parton</mi></msub><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi>s</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow></munder><mrow><msub><mi>f</mi><mrow><mi>s</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⁢</mo><msubsup><mi>c</mi><mrow><mi>s</mi><mo>⁢</mo><mi>α</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>c</mi><mrow><mi>t</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>s</mi></munder><mrow><msubsup><mi>c</mi><mrow><mi>s</mi><mo>⁢</mo><mi>α</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>c</mi><mrow><mi>s</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02594.tex", "nexttext": "\nwhere $|\\Psi _{\\rm parton}\\rangle $ is the Fermi sea ground state of~(\\ref{eq:partonMF}).\n\nFor our purpose of describing the numerically observed CSL state, we choose the hopping integral $f_{st}$ in~(\\ref{eq:partonMF}) to be complex numbers whose phases depend on only one parameter $\\theta$ as shown in Fig.~\\ref{Figure1}. The value of $\\theta$ determines the fluxes in the triangles and hexagons of the Kagome lattice. With this prescription, the parton Hamiltonian~(\\ref{eq:partonMF}) has three energy bands. As we are looking for an SU(3) singlet ansatz, the chemical potential is fixed so that only the lowest band is completely filled by fermionic partons.\n\n\\begin{figure}\n\\centering\n\\includegraphics[scale=0.42]{parton}\n\\caption{(Color online) (a) Variational energy of the parton trial state as a function of the parameter $\\theta$. The lowest variational energies for the Hamiltonian~(\\ref{eq:Hamiltonian}) with $K_1=0.6$, $K_2=0.4$ (green crosses) and $K_1=0.6$, $K_2=0.5$ (blue open circles) both appear at $\\theta_{\\rm min}\\approx0.88\\pi$. The gap between the lowest and the middle bands of the parton Hamiltonian vanishes at $\\theta=\\pi/4$ and $\\theta=3\\pi/4$ (denoted by two dotted lines). (b) Band structure of the parton Hamiltonian at the optimal variational point $\\theta_{\\rm min}$. The three bands are separated by energy gaps and have Chern numbers $-1$, $0$, and $+1$, respectively (from top to bottom).}\n\\label{fig:parton}\n\\end{figure}\n\nTo optimize the variational ansatz, we choose many different $\\theta$ values and compute the energy of the wave function Eq.~(\\ref{eq:partonWF}) with respect to the Hamiltonian (\\ref{eq:Hamiltonian}) to select the one giving the lowest energy. This has been done in several cases on the lattice with 18 sites but we focus here on the following two sets of parameters, i) $K_{1}=0.6, K_{2}=0.4$ and ii) $K_{1}=0.6, K_{2}=0.5$. The variational energy as a function of $\\theta$ is shown in Fig.~\\ref{fig:parton} (a). The best results in the two cases, which both appear at $\\theta_{\\rm min}\\approx0.88\\pi$, are $-13.12$ for $K_{2}=0.4$ and $-14.08$ for $K_{2}=0.5$. They are quite close to the energies of the three quasi-degenerate ground states [see Fig.~\\ref{Figure2} (a) and (b)].\n\nFor the optimal choice $\\theta_{\\rm min}$, the three parton energy bands of~(\\ref{eq:partonMF}) have Chern numbers $-1$, $0$, $+1$, respectively [see Fig.~\\ref{fig:parton}(b), from top to bottom]. This means that the parton trial wave function (\\ref{eq:partonWF}) describes a Gutzwiller projected Chern insulator with Chern number $+1$. It should be emphasized that our parton wave function is constructed for partons obeying periodic boundary conditions. Based on previous experience \\cite{zhang2012,tu2013b} of parton construction for chiral topological states, we expect that two more parton states can be obtained by choosing twisted boundary conditions for the partons. The existing one and these two more states provide a complete approximation of the ground state manifold.\n\nHaving determined that the SU(3) CLS state may be interpreted as Gutzwiller projected Chern insulator with Chern number $+1$, one can proceed to derive the low-energy effective theory for the CLS state using functional path integral. After integrating out the fermionic partons~\\cite{lu2014,liu2014}, the resulting theory is just the Chern-Simons theory with the $K$ matrix given by Eq.~(\\ref{Kmatrix}). This process further supports the claim that the SU(3) CSL state shares the same topological order as the Halperin 221 state.\n\n{\\em Conclusion and Discussion} --- In this Letter, we have investigated an SU(3) symmetric Hamiltonian consists of short-range interactions on the Kagome lattice. Based on exact diagonalization results, we have identified an extended region in the parameter space where system is an Abelian SU(3) CSL. A trial wave function constructed using fermionic partons and Gutzwiller projection is found to be a good approximation of the exact eigenstates obtained in numerical calculations. The low-energy effective theory is deduced based on an analogy with the Halperin 221 FQH states of two-component bosons as well as from the parton trial wave function and turns out to be the SU(3)$_1$ Chern-Simons theory. It has been shown in Ref.~\\cite{sun2015} how to derive a Chern-Simons theory for SU(2) spin systems on arbitrary lattices, so one might expect that the Chern-Simons theory for the SU(3) CSL studied in this work can also be derived without reference to partons.\n\nIn general, one can establish a mapping between SU(N) spins and (N-1)-component bosons, which suggests that SU(N) CSL and FQH states of multi-component bosons are closely related. It would be very interesting if one can also identify short-range interactions in other SU(N) spin systems that can host CSL states. Another exciting direction opened by our current work is to investigate SU(N) CSL with non-Abelian anyons. The CFT construction of multi-component non-Abelian FQH states~\\cite{ardonne1999,ardonne2001} is also a good starting point in this study. The relation between these non-Abelian spin-singlet (NASS) states and the Halperin 221 state is very much the same as that between the Moore-Read state and the Laughlin state. While the Kalmeyer-Laughlin state is designed for spin-$1/2$ systems, the lattice version of the Moore-Read state may be realized in spin-$1$ systems. It should be possible to reformulate the NASS states in SU(N) spin systems where the spins are described by higher-dimensional representation of the SU(N) group. It would also require numerics to test whether one can find sufficiently simple short-range microscopic Hamiltonians to stabilize these states.\n\nUpon finalizing the manuscript we noticed two recent preprints~\\cite{nataf2016a,nataf2016b} on closely related topics.\n\n{\\em Acknowledgement} --- We are grateful to Meng Cheng for helpful discussions. HHT acknowledges A.~E.~B.~Nielsen and G.~Sierra for an earlier collaboration on the SU(N) CSL. Exact diagonalization calculations are performed using the DiagHam package for which we thank all the authors. This work is supported by the EU project SIQS.\n\n\\bibliography{Liquid}\n\n\n", "itemtype": "equation", "pos": 14345, "prevtext": "\nwhere $f_{st}$ is the hopping integral of fermionic partons between nearest neighbors (to be determined below) and $\\mu$ is the chemical potential. This Hamiltonian can be viewed as a ``mean field\" theory of the original SU(3) spin problem. The chemical potential $\\mu$ is chosen to ensure that the particle number constraint is satisfied on average. A trial wave function in the physical spin Hilbert space should satisfy the single occupancy constraint rigorously, which can be written as a Gutzwiller projected wave function\n\n", "index": 3, "text": "\\begin{equation}\n|\\Psi \\rangle =P_{\\rm G}|\\Psi _{\\rm parton}\\rangle,\n\\label{eq:partonWF}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"|\\Psi\\rangle=P_{\\rm G}|\\Psi_{\\rm parton}\\rangle,\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msub><mi>P</mi><mi mathvariant=\"normal\">G</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Ψ</mi><mi>parton</mi></msub><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]