[{"file": "1601.01147.tex", "nexttext": "\nThe definitions of these factors ensure that the same fractional change in different factors leads to the same total amount change (see below), so that we can make a fair comparison between the effects of changes in different rainstorm properties. We use these factors to compare the baseline period and the future period to identify which spatio-temporal aspects of rainstorms are the main drivers of precipitation pattern changes and how they contribute to the total precipitation amount change in Section 4. We also use them to compare the baseline period and the observational data to examine the model-observation discrepancy in terms of rainstorm characteristics. Each factor is defined as follows:\n\n\\textit{\\textbf{Average intensity (mm/hour)}}. The average precipitation intensity is the size-weighted average of all rainstorm intensities. Since the length of each time step is 3 hours, the hourly intensity is computed as $\\frac{1}{3} \\times \\sum_{i=1}^{N} \\sum_{t=b(S_i)}^{e(S_i)} a(S_i,t) \\times s(S_i,t) / \\sum_{i=1}^{N} \\sum_{t=b(S_i)}^{ e(S_I)} s(S_i,t)$.\n\n\\textit{\\textbf{Size factor (km$^2$)}}. Size factor is the average storm size per each rainstorm event at each time step, computed as $\\mbox{(the area of each grid cell)} \\times \\sum_{i=1}^{N}\\sum_{t=b(S_i)}^{e(S_i)} s(S_i,t) / \\sum_{i=1}^{N} l(S_i)$, where the area of each grid cell is $144 \\mbox{ km}^2$ for the model output and $16 \\mbox{ km}^2$ for the observational data.\n\n\\textit{\\textbf{Duration factor (hour/rainstorm)}}. Duration factor is the mean duration per each rainstorm event. The factor is computed as $3 \\mbox{ hours}\\times\\sum_{i=1}^{N}  l(S_i)  / N$, because the length of each time step is 3 hours.\n\n\\textit{\\textbf{Number of Rainstorms}}. The number of rainstorms is simply given by $N$.\n\n\\subsection{Spatial analysis} \\label{section:SpatialAnalysis}\n\n\n\nWe can also use the computed metrics to find and visualize the spatial distribution of the rainstorm characteristics over the area of interest. Following a standard procedure in spatial point process analysis \\citep[see, e.g. ][Chapter 21]{gelfand2010handbook}, we estimate the expected number of rainstorms originate at a spatial location $\\mathbf{s}$ as\n\n", "itemtype": "equation", "pos": 22785, "prevtext": "\n\n\\maketitle\n\\doublespacing\n\n\n\n\n\n\\abstract{\\small Climate models robustly imply that some significant change in precipitation patterns will occur. Models consistently project that the intensity of individual precipitation events increases by approximately 6-7\\%/K, following the increase in atmospheric water content, but that total precipitation increases by a lesser amount (2-3\\%/K in the global average). Some other aspect of precipitation events must then change to compensate for this difference. We develop here a new methodology for identifying individual rainstorms and studying their physical characteristics -- including starting location, intensity, spatial extent, duration, and trajectory -- that allows identifying that compensating mechanism. We apply this technique to precipitation over the contiguous U.S.\\ from both radar-based data products and high-resolution model runs simulating 100 years of business-as-usual warming. In model studies, we find that the dominant compensating mechanism is a reduction of storm size. In summer, rainstorms become more intense but smaller; in winter, rainstorm shrinkage still dominates, but storms also become less numerous and shorter duration. These results imply that flood impacts from climate change will be less severe than would be expected from changes in precipitation intensity alone. We show also that projected changes are smaller than model-observation biases, implying that the best means of incorporating them into impact assessments is via ``data-driven simulations'' that apply model-projected changes to observational data. We therefore develop a simulation algorithm that statistically describes model changes in precipitation characteristics and adjusts data accordingly, and show that, especially for summertime precipitation, it outperforms simulation approaches that do not include spatial information.\n} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\n\nSome of the most impactful effects of human-induced climate change may be changes in precipitation patterns \\citep[AR5;][]{ipcc2013ipcc}. \nChanges in future flood and drought events and water supply \nmay incur social costs and mandate changes in management practices \n\\citep[e.g.][]{rosenzweig1994potential,vorosmarty2000global,christensen2004effects,barnett2008human,karl2009global,nelson2009climate,piao2010impacts}. Understanding and projecting changes in future precipitation patterns is therefore important for informed assessment of climate change impacts and design of adaptation strategies.\n\nFuture changes in spatio-temporal precipitation patterns are not well studied, but climate models show consistent hydrological changes in simulations under higher CO$_2$ \\citep[e.g.][]{hennessy1997changes,giorgi2005updated,tebaldi2004regional}, which imply that some changes must occur. Models robustly project uniform increases in precipitation intensity (amount/time when rain occurs) of $\\approx 6\\%$ per degree temperature rise, following atmospheric water content governed by Clausius-Clapeyron \\citep[e.g.][]{held2006robust,willett2007attribution,stephens2008controls,wang2012review}. However, model total precipitation rates rise differently: in the global average, by only 2-3\\% per degree \\citep[e.g.,][]{knutson1995time,allen2002constraints,held2006robust,stephens2008controls,wang2012review}. \n (Time-averaged precipitation rise exceeds Clausius-Clapeyron only in the deep tropics.) \nNearly all latitudes then show a discrepancy between changes in rainfall intensity and total amount that must be ``compensated'' by some other change in precipitation characteristics.\nIn the midlatitudes, the amount/intensity discrepancy resembles the global average \n(Figure \\ref{figure:puzzle}). \n\nModel midlatitude rain events must therefore experience changes in frequency (fewer storms), duration (shorter storms), or size (smaller storms).\n\nCurrent approaches to studying future precipitation cannot determine changes in rainstorm characteristics, because they do not consider individual events. Studies generally analyze precipitation at individual model grid cells \\citep{knutson1995time,semenov2002secular,stephens2008controls} or over broad regions \\citep{tebaldi2004regional,giorgi2005updated}. Effects from changes in rainstorm frequency, duration, and size are all confounded in local or spatially-aggregated time series. To overcome this limitation, we need an approach that identifies, tracks, and analyzes individual rainstorms.\nCurrently-used rainstorm tracking algorithms are not appropriate for climate studies: they are designed for severe convective storms in the context of nowcasting and forecasting using weather forecasting models \\citep{davis2006object2}, radar \\citep[e.g.][]{dixon1993titan,johnson1998storm,wilson1998nowcasting,fox2005bayesian,xu2005kernel,davis2006object1,han20093d,lakshmanan2009efficient}, or satellite images \\citep{morel2002climatology1,morel2002climatology2}. Storm studies in climate projections have also focused only on very large and intense events \\citep{hodges1994general,cressie2012dynamical}. These algorithms cannot efficiently handle lower-intensity precipitation events with more complicated morphological features and evolution patterns. Studying future precipitation patterns requires new storm identification and tracking strategies.\n\n\nSuch studies also require high-resolution model output. For a model to plausibly represent changes in real-world rain events it must at minimum resolve those events.  Computational constraints mean that typical General Circulation Model (GCM) runs used for climate projections have spatial resolution of order 100 km, too coarse to represent morphological features of localized rainstorms. \nFine-grained observational data can be generated from radar datasets;  \nstudies of future precipitation require dedicated model runs at similar resolution, at the price of more limited time series. \n\nFinally, making practical use of insights into changes in rainstorm characteristics requires methods for combining model projections with observational data. \n\nHydrological and agricultural impact assessments cannot use scenarios of future precipitation from even high-resolution models, since model precipitation  can differ considerably from that in observations \\citep[e.g.][]{ines2006bias,baigorria2007assessing,teutschbein2012bias,muerth2013need}. \n\nThe two primary current approaches to addressing these biases are bias correcting model output based on observations (of means or marginal distributions) \\citep[e.g.][]{ines2006bias,christensen2008need,piani2010statistical1,piani2010statistical2,teutschbein2012bias} and ``delta'' methods that adjust observations by model-projected changes (in means or marginal distributions) \\citep[e.g.][]{hay2000comparison,raisanen2013projections,raty2014evaluation}. Neither approach allows representing changes in spatio-temporal dependence. \nSome work has extended bias correction methods to also address biases in spatio-temporal dependence \\citep{vrac2015multivariate}, but these methods do not allow for future \\textit{changes} in that dependence. Existing delta methods capture current present-day spatio-temporal dependence but do not address future changes. An important objective of this work is therefore to extend delta methods to capture model-projected changes in rainstorm characteristics, while still ensuring the greatest fidelity to real-world precipitation statistics. \n\n\n\n\n\n\n\n\n\nIn this work we both seek to understand the changes in rainstorm characteristics in future model projections that compensate for the amount-intensity discrepancy, and to develop an approach to transform observed rainstorms into future simulations to account for those changes. \nThe remainder of this paper is organized as follows. In Section \\ref{section:ModelAndObs}, we describe the high-resolution regional climate model runs and the radar-based observational data products used in the study.  In Section \\ref{section:RainstormAnalysis1}, we develop an algorithm for identifying and tracking individual rainstorms, and in Section \\ref{section:RainstormAnalysis2}, we develop metrics for analyzing spatio-temporal precipitation patterns. In Section \\ref{section:results}, we compare precipitation in observations and present-day and future climate projections, and in Section \\ref{section:simulation}, we develop a simulation method to generate future precipitation simulations that combines information from models and observations. Finally, in Section \\ref{section:discussion}, we discuss the implications of these results. \n\n\n\\section{Climate Model Output and Radar-based Observational Data} \\label{section:ModelAndObs}\n\nAs discussed above, model output used to study rainstorm characteristics must be at high spatial resolution.  In this study \nwe use high-resolution dynamically downscaled model runs over the continental U.S.\\ region, with a constant-spacing grid of 12 $\\times$ 12 km, described by \\citet{wang2015high}. These runs use the Weather Forecasting and Research (WRF) model \\citep{skamarock2008time} as the high-resolution regional climate model, nudged by a coarser simulation from the Community Climate System Model 4 (CCSM4) \\citep{gent2011community} of the business-as-usual (RCP 8.5) scenario. (The CCSM4 run is an ensemble member from the CMIP5 archive; see \\cite{meinshausen2011rcp} and \\cite{WCRP2015CMIP5} for further information.) Because high-resolution runs are computationally demanding, WRF was run only for two 10-year segments of the scenario, which we term the ``baseline'' (1995-2004) and ``future'' (2085-2094) time periods. In this analysis we separately analyze summertime (June, July, August) and wintertime (December, January, February) precipitation because of seasonal differences in precipitation characteristics. U.S.\\ precipitation is predominantly convective in summer and large-scale in winter (Figure \\ref{figure:illustration}).\n\nBoth CCSM4 and WRF are widely-used models for atmospheric and climate science. WRF has been extensively used for mesoscale convection studies, for dynamical downscaling of climate model projections \\citep{lo2008assessment,bukovsky2009precipitation,wang2015model}, and as a forecasting model for numerical weather prediction \\citep[e.g.][]{jankov2005impact,davis2006object2,clark2009comparison,skamarock2008time}.  Validation studies addressing these different contexts include \\citet{ma2015dynamic}, who showed in a model-observation comparison that downscaling CCSM4 output using WRF improved the fidelity of modeled summer precipitation over China on both seasonal and sub-seasonal timescales. For forecasting, \\citet{davis2006object2} studied intense and long-lived storms in 4-km resolution WRF forecasts over the U.S.\\ and found that the model captured storm initialization reasonably well but showed some apparent biases in storm size, intensity, and duration. \n\nWe compare WRF/CCSM4 model output to an observational data product of similar spatial and temporal resolution: the NCEP Stage IV analysis (``Stage IV data''  hereafter), which is based on combined radar and gauge data \\citep{lin2005ncep,prat2015evaluation}. The Stage IV dataset provides hourly and 24-hourly precipitation at 4 km resolution (constant-spacing $4\\times 4$ km grid cells) over the contiguous United Stages from 2002 to the present. (To match our model output, we use ten years of data from 2002 to 2011, and aggregate the 1-hourly data to 3-hourly.) \nStage IV data are produced by `mosaicing' data from different regions \ninto a unified gridded dataset. This mosaicing leaves artifacts in the spatial pattern of average precipitation: the range edges of individual radar stations are visible by eye in Figure \\ref{figure:SpatialAndHistogram}. These artifacts do not however compromise our analysis.\n\n\nComparison of the present-day WRF run with Stage IV data shows that the model captures seasonal mean precipitation amounts well (Tables \\ref{table:SummerDisc} and \\ref{table:WinterDisc}, the first row), but with a large bias in rainfall intensity. Rain rates in precipitating grid cells in WRF output are $\\sim$50\\% lower than in observations (Figure \\ref{figure:lost_amount}). The bias is consistent across two orders of magnitude in intensity, nearly identical in both summer and winter, and unlikely to be a sampling artifact, since both model and observation grid cell sizes (16 and 144 km$^2$) are well below typical areal sizes of precipitating events. Because the model matches observed total rainfall, the too-low intensity in individual rainstorms must be compensated by some other bias in precipitation characteristics:\nmodel precipitation events may be more frequent, more numerous, larger in size, or any combination of these factors.  (\\citet{davis2006object2} has noted a bias in WRF toward too-large rainstorm events, though in a study of only the most severe storms.)  Understanding model-observation biases therefore becomes an  \nan analogous problem to understanding differences in present and future model projections. Both cases involve amount-intensity discrepancies, that imply some change in spatio-temporal precipitation properties that can be understood only by \n\nidentifying and tracking individual rainstorms. \n\n\nIntensity differences do introduce one minor complication in analysis. It is typical in statistical analyses of precipitation to cut off all data with precipitation intensity below a particular threshold, to remove spurious light precipitation and make analysis tractable. In our case the intensity distributions for model and observation are different, suggesting that different cutoffs might be warranted.  \nFor simplicity, we apply the same cutoff of \n $0.033$mm/hour (black line in Figure \\ref{figure:lost_amount}) to both model and observations. This choice should negligibly affect the overall results, since even in the worst case (model wintertime), the cutoff excludes less than 2\\% of seasonal precipitation.\n\n\n \n\\section{Identifying and Tracking Individual Rainstorms} \\label{section:RainstormAnalysis1}\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n \nAs discussed previously, existing algorithms for finding rainstorm events are appropriate only for the strongest storms. We develop here a more general approach. \nFinding rainstorm events in spatio-temporal data involves two tasks: \n\n\n\\begin{itemize}\n\\item[A.] Rainstorm identification: Divide the precipitation field at each time step into individual storms\n\\item[B.] Rainstorm tracking: Build rainstorm events evolving over time by tracking identified storms across consecutive time steps\n\\end{itemize}\nWe describe each step below, and provide more detail on algorithms in Section S1 in the Supplementary Document. \n\n\\subsection{Identifying rainstorms at a single time step} \\label{subsection:StormIdentification}\nWe first identify rainstorms from the precipitation field at each time step $t$. This step is essentially a clustering problem because it requires grouping contiguous regions of grid cells with positive precipitation amount (i.e. $>0.1$ mm/3 hour, due to the removal of smaller values described in Section \\ref{section:ModelAndObs}) into clusters based on their morphological features and proximity. Treating each contiguous precipitation region as an individual rainstorm leads to overly separated rainstorm events, ignoring the possibility that a single storm system can often have multiple separate precipitation regions (see Figure \\ref{figure:challenges}a left panel and Figure \\ref{figure:identification} step 1). Here we group nearby regions into ``rainstorm segments'' using a technique termed almost-connected component labeling \\citep{eddins2010almost,murthy2015automated}. The basic idea is to find groups of connected rainstorm regions, in each of which the regions are close enough to form a contiguous area after some dilation of individual regions.  This procedure provides a natural way of grouping precipitation regions based on their proximity and morphological features. Unlike other traditional clustering algorithms such as k-means clustering \\citep{hartigan1979algorithm}, the approach does not require a pre-specified number of clusters and hence enables quick and automatic clustering of contiguous regions. \n\nHowever, almost-connected component labeling often suffers from a ``chaining effect'' producing overly large rainstorm segments: small number of grid cells located between two large regions can cause awkward linkage  between the two regions. (Figure \\ref{figure:challenges}a, right panel). We use a three stage  procedure based on mathematical morphology \\cite[cf.][]{han20093d} that treats ``large'' regions and ``small'' regions separately to avoid the chaining effect caused by small regions: In the first stage we form segments using only the ``large'' regions (Figure \\ref{figure:identification}, step 2). In the second stage we assign small regions to the closest existing segments from the previous stage if they are close to the existing segments (Figure \\ref{figure:identification} step 3). In the third stage we form segments of the remaining small regions (Figure \\ref{figure:identification} step 4). \n\n\\subsection{Tracking rainstorms over different time steps} \\label{subsection:StormTracking}\n\nOnce the rainstorm segments for all time points are identified, we link them in different time steps to form rainstorm events evolving over time and space. This task is complicated by the fact that rainstorms  often split into multiple segments that drift in different directions. (See Figure \\ref{figure:challenges}b for illustration.) Most existing algorithms are not designed to  handle this possibility. Our new algorithm is partly inspired by the work of \\cite{hodges1994general} and \\cite{morel2002climatology1}, but extends their work to more efficiently identify segments originating from the same rainstorm and track their movement over time.\n\nThe algorithm works sequentially in time. For each time step from $t = 1$ to $T$,  we assign each rainstorm segment to one of the existing rainstorm events based on the two criteria:  (i) the shapes of linked rainstorms in two consecutive time steps are morphologically similar enough to be considered as the same rainstorm, and (ii) the rainstorm location and the movement direction do not change too abruptly over time. If we cannot find any existing rainstorm events that meet these criteria for a rainstorm segment, we initialize a new rainstorm event starting with that segment. On the other hand, if more than two events satisfy the criteria, we assign the rainstorm segment to the most morphologically similar event. Since the multiple rainstorm segments at the same time step can be assigned to the same rainstorm event, our algorithm can incorporate situations where a rainstorm splits into multiple segments. \nWe denote the resulting rainstorm events $S_1,\\dots,S_N$. \n\nFigure \\ref{figure:tracking} shows example time steps for rainstorm tracking results from our algorithm. As shown in the figure, the algorithm can simultaneously track different rainstorms with various morphological features reasonably well. \n\n\n\\section{Describing Rainstorm Characteristics} \\label{section:RainstormAnalysis2}\n\n\n\n\n\n\nOnce rainstorms are identified and tracked, the goal is to  \nquantitatively describe them.   \nHowever, there is little precedent in the literature for this task;\nmost previous rainstorm studies focus only on analyzing storm trajectories or tracks \\citep{hodges1994general,morel2002climatology2}. \n\nWe therefore develop a set of metrics for characterizing storms, and follow a four-stage process for  \ndescribing spatio-temporal precipitation patterns and comparing those patterns between different climate states (or between model output and observations):\t\t\t\n\n\n\\begin{itemize}\n\\item[A.] Compute metrics for individual rainstorms: duration, size, mean intensity and central location.\n\\item[B.] Extend those metrics to apply to aggregate precipitation. That is, we decompose the total precipitation amount into the product of: average intensity, a size factor, a duration factor, and the number of rainstorms. \n\\item[C.] Estimate the geographic variation of those aggregate metrics. That is, we find spatial patterns of rainstorm properties.  \n\\item[D.] Compare precipitation patterns across model runs or across models and observations. \n\\end{itemize}\nWe describe the algorithms for each of these step below.\n\n\n\\subsection{Metrics for individual rainstorms} \\label{subsection:metrics}\n\n\nWe characterize each individual rainstorm event $S_i$ with four metrics: duration, size, mean intensity, and central location. \nFor completeness, we describe below how each metric is computed. Note that size, location, and amount metrics are not scalars but vectors or matrices over the lifetime of each storm.\n\n\n\n\n\n\n\\textit{\\textbf{Duration}}. The storm identifying algorithm gives us the beginning and ending timesteps of the lifetime of storm $S_i$ ($b(S_i)$ and $e(S_i)$, respectively). Since all analysis involves 3-hour timesteps, the rainstorm duration is $l(S_i)\\times$3 hours, where $l(S_i)=e(S_i) -b(S_i)+1$. \n\n\\textit{\\textbf{Size}}. Rainstorm size is a vector of length $l(S_i)$ timesteps. The storm identification algorithm identifies a number $s(S_i,t)$ of grid cells as part of the storm at each timestep $t$. (We do not need to estimate fractional coverage of individual grid cells when using a grid as fine as 12 $\\times$ 12 km or 4 $\\times$ 4 km.)  The size at each timestep is the $s(S_i,t)\\times$144 km$^2$ for the model output and $s(S_i,t)\\times$16 km$^2$ for the observational data.\n\n\\textit{\\textbf{Mean intensity}}. Also a time series of length $l(S_i)$. At each time step $t$ when the rainstorm $S_i$ exists over the contiguous U.S.\\, we compute its average precipitation amount $a(S_i,t)$ by taking the average of the precipitation intensity over all grid cells identified with the storm, i.e.\\ $a(S_i,t)=\\sum_{k=1}^{s(S_i,t)} v_{i,t,k} / s(S_i,t)$, where $v_{i,t,k}$ $\\left(k=1,\\dots,s(S_i,t)\\right)$ is the precipitation intensity at each grid cell location of $S_i$ at time $t$.\n\n\\textit{\\textbf{Central location}}. The central location of each rainstorm event $S_i$ is a $l(S_i)\\times2$ matrix, where each row $c(S_i,t)$ is the the center of gravity weighted by the precipitation amount in each grid cell. This location measure is invariant to rotation and translation of the rainstorm event on the surface of the globe.  (See Section S2 in the Supplementary Document.)\n\n\n\n   \n\n\n \n\\subsection{Factorizing total precipitation} \\label{section:factorization}\n\nUsing the computed metrics for each rainstorm, we decompose the total precipitation amount into the following four factors to describe different spatio-temporal aspects of precipitation patterns:\n\n", "index": 1, "text": "\\begin{align*}\n\\mbox{Total Amount} =  \\mbox{Average Intensity} \\times \\mbox{Size Factor}\\times \\mbox{Duration Facter} \\times \\mbox{Number of Rainstorms}.\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mbox{Total Amount}=\\mbox{Average Intensity}\\times\\mbox{Size %&#10;Factor}\\times\\mbox{Duration Facter}\\times\\mbox{Number of Rainstorms}.\" display=\"inline\"><mrow><mrow><mtext>Total Amount</mtext><mo>=</mo><mrow><mtext>Average Intensity</mtext><mo>×</mo><mtext>Size Factor</mtext><mo>×</mo><mtext>Duration Facter</mtext><mo>×</mo><mtext>Number of Rainstorms</mtext></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01147.tex", "nexttext": "\nwhere $k(\\mathbf{s}_1,\\mathbf{s}_2)$ is a kernel function that satisfies $\\sum_{\\mathbf{s}_2 \\in \\mathcal{S}} k(\\mathbf{s}_1,\\mathbf{s}_2)=1$ and smoothly decays as the distance between $\\mathbf{s}_1$ and $\\mathbf{s}_2$ increases, and $\\mathcal{S}$ is a set of all grid cell locations in the contiguous United States. See Section S3 in the Supplementary Document for more details about the choice of the kernel function $k(\\mathbf{s}_1,\\mathbf{s}_2)$. To estimate the spatial pattern of the rainstorm metrics we apply spatial smoothing using the same kernel function $k(\\mathbf{s}_1,\\mathbf{s}_2)$. See Section S4 in the Supplementary Document for further details about how to compute the spatial pattern.\n\n\n\\subsection{Comparing Rainstorm Characteristics in Two Precipitation Patterns} \\label{section:ComparisonMethod}\n\nThe approaches described in Section 4\\ref{subsection:metrics}--\\ref{section:SpatialAnalysis} above provide a framework to compare any two spatio-temporal precipitation datasets and to identify similarities and differences in rainstorm characteristics. For each dataset, we decompose the total precipitation amount over the study area into its component factors using the method described in Section 4\\ref{section:factorization}. To identify differences, we compute the ratios of the factors in the datasets being compared. This analysis helps us to understand, in an average sense, which characteristics of rainstorms drive differences in spatio-temporal precipitation. To identify geographic variations in the various rainstorm characteristics, we also use the spatial analysis \nof Section 4\\ref{section:SpatialAnalysis} to map individual rainstorm metrics across the study area, and compare different datasets by taking ratios. \n(Note that some metrics -- the annual mean and the intensity of precipitation -- are pixel-wise rather than spatially smoothed characteristics.)\nTo quantify the statistical uncertainty in estimating the ratios of factors, we construct 95\\% confidence intervals by bootstrap sampling (shown in last column of Tables \\ref{table:SummerChange}--\\ref{table:WinterChangeDry}). See Section S5 in the Supplementary Document for details of uncertainty analysis.\n\n\n\nNote that both model output and observations include large numbers of small rainstorms with negligible precipitation. These tiny storms do not affect the average intensity and size factors, which are weighted by amount and size, but if included in the analysis would dominate estimates of the duration factor and number of storms, reducing the utility of these factors at providing information about events that contribute significantly to overall rainfall.  We therefore exclude those rainstorms with the lowest individual precipitation amounts (whose values add up to 0.1\\% of total precipitation).\n\n\\section{Results} \\label{section:results}\n\nThe methods described above allow us to compare rainstorm characteristics both between model output and observations and between model output for present-day and future climate states. In both cases we know \\textit{a priori} that there must be differences in spatio-temporal precipitation characteristics.\n\nWe find that WRF output and Stage IV data show substantial differences in rainstorm characteristics, but with different discrepancies in summer (Figure \\ref{figure:SummerDisc} and Table \\ref{table:SummerDisc}) and winter (Figure \\ref{figure:WinterDisc} and Table \\ref{table:WinterDisc}). In both seasons, we find that intensity in modeled precipitation events is considerably too low (as was evident even without rainstorm identification) even though U.S.\\-average total precpitation is similar in model and observations. \nIn summer, the compensating factor that resolves this discrepancy is predominantly size.  WRF summer rainstorms are roughly 30\\% too weak but also 50\\% too large (Table 1). The size bias is similar to that found by \\citet{davis2006object2}. \nHowever, while \\citet{davis2006object2} reports that the WRF summer precipitation duration is too long, we find no bias in rainstorm duration. In our model output, the total number of summer storms across the study area is similar to that in observations, but with geographic patterns of bias: too many storms in the north and too few in the south (Figure \\ref{figure:SummerDisc}).\n\n\nIn winter, when U.S.\\ precipitation is predominantly large-scale rather than convective, model biases are both qualitatively and quantitatively different than in summer. \nThe intensity and size effects seen in summer become still larger in winter, and other factors become discrepant as well.\nWRF winter rainstorms are substantially weaker, larger, fewer, and longer than those in Stage IV data. \n (Figure \\ref{figure:WinterDisc} and Table \\ref{table:WinterDisc}). Winter storms are half as intense in the model as in observations and more than twice as large, biases which roughly cancel.\nThe number of winter storms is also half that of observations, and their duration twice as long. Changes in storm number are nearly uniform across the study area,\n\nbut other biases do not cancel locally. They do approximately cancel across the study area, so that while local precipitation amounts can be discrepant from observations, model and observations again are in reasonable agreement for total U.S.\\ average precipitation. \n\n\nWhile the model-observation comparison is sobering, WRF model runs still offer a self-consistent response to changed climate conditions, and can provide insight into potential future changes in precipitation characteristics.\nWe compare the baseline and future WRF runs using the same approaches described above.\nThe precipitation responses to climate change again differ by season, and show similar distinctions between summer convective and winter large-scale precipitation as those seen in the model-observation comparison.\n  \nIn the summer, the main drivers of changing precipitation patterns are again rainstorm intensity and size (Table \\ref{table:SummerChange} and Figure \\ref{figure:SpatialChange}, first column). Changes in the other aspects (duration and the number of storms) are relatively small and not statistically significant. For convective precipitation, at least in the WRF model runs used here, the compensating mechanism that allows a 3\\%/K increase in total precipitation amount that differs from the 6\\%/K increase in precipitation intensity is a decrease in the size of individual rainstorms (-3\\%/K). \n\nIn the winter, changes in precipitation patterns in future climate conditions are more complicated (Table 4 and Figure \\ref{figure:SpatialChange}, second column). Across the whole U.S.\\, the winter intensity effect is about a third less than that in summer, but still significant (4.4\\%/K) and larger than the change in total rainfall (2.5\\%/K). In contrast to summer, reduction in the size, duration and number of storms all play a role in compensating for that discrepancy. (Size is estimated as the most important factor, but these differences are not statistically significant.) Interestingly, while each of these factors show different geographic patterns of change, the change in annual mean is much more spatially uniform.  \nThis regional variation in compensation mechanisms means that different regions show different spatio-temporal precipitation changes that can  be significant for socioeconomic impacts. \n\nWinter patterns of total precipitation changes are also less uniform than those in summer. In both seasons, a part of the U.S.\\ Southwest shows decreased rather than increased precipitation under future climate conditions, but the area of drying becomes larger in the winter, extending to about 1/3 of the contiguous U.S.\\ This area provides a useful test area for examining the mechansisms driving changes in rainstorm characteristics, since it presents an even stronger discrepancy between changes in intensity and total amount of precipitation than does the average U.S.\\ In the drying region, the intensity response is muted (and even negative in places), but still on average positive (Tables \\ref{table:SummerChangeDry} and \\ref{table:WinterChangeDry}, the first and second rows). That is, average storm intensity increases (by +2-3\\%/K in summer and winter) while total precipitation actually decreases (by -5-6\\%/K). We therefore repeat the analysis of changes in precipitation characteristics on the region of drying. (The analyzed areas for each season roughly coincide with the red regions in the maps in the first row of Figure \\ref{figure:SpatialChange}; see Figure S1 for the exact areas analyzed.) We find that reduction of rainstorm size remains the dominant compensating factor in both summer and winter, with storm shrinkage substantial enough (more than -6\\%/K in both seasons) to result in decreased total precipitation even though storms are stronger (Tables \\ref{table:SummerChangeDry} and \\ref{table:WinterChangeDry}). The main drivers of changing precipitation patterns in drying areas again appear to be partially compensating changes in intensity and size. \n \n\n  \n\n\n\n\n\n\n\n\nFinally,  we conduct a preliminary graphical exploration of potential changes in rainstorm trajectories in changing climate conditions. Once rainstorms are identified across time, the trajectory of each storm is easily found by linking its central locations at each time step. Figures S2 and S3 in the Supplementary Document show rainstorm trajectories in the baseline and the future model runs. Although more detailed analysis would be useful, we see no clear sign of changes. \nThat is, regional differences in total precipitation change do not appear to be driven by deviations on storm trajectories. \n\n\\section{Simulating Future Precipitation Patterns by Changing Size and Intensity Distributions} \\label{section:simulation}\n\nThe model runs used in this analysis suggest that rainstorm properties would change siginficantly under future climate conditions. But \nmodel biases are strong enough that model projections alone are unsuitable for impacts assessments. \nWe therefore seek to produce simulations of future precipitation that reflect the model-projected changes in rainstorm characteristics, but also incorporate information from observational data. \n\n\n\n\n\n\n\n\n\nWe take a data-driven simulation approach, i.e.\\ we transform observational data into a future simulation using information from the climate model runs. For simulating rainstorm changes, this approach has a clear advantage over bias correction of model output, because the model biases in rainstorm characteristics are much larger than than the expected changes from present to future climate states.\nThe approach has been used in simulations of temperature \\citep{leeds2015simulation,poppick2015temperatures} and in a few studies of precipitation \\citep[e.g.][]{hay2000comparison,raisanen2013projections,raty2014evaluation}, but in no case allowing for changes in spatio-temporal dependence. (This weakness is shared with bias correction approaches applied to individual time series.)  \n\n \n\n\nIn this section we propose an algorithm for precipitation simulations that includes expected changes in the two aspects of rainstorm characteristics that change most significantly in future conditions, size and intensity. \n\nThis method should be highly appropriate for simulating future summer precipitation, when factors other than size and intensity are largely unchanged. For winter precipitation, the method may be problematic because the duration and number of storms also show large, generally compensating changes.\n(Accounting for those changes would be more complicated, however, because the number of storms increases in future projections, requiring creation of rain events not present in observations.)\n\nOur simulation approach consists of two steps:\n\\begin{itemize}\n\\item[A.] Changing the size of individual rainstorms in the observational record  \n\\item[B.] Changing the distribution of precipitation intensity in the transformed data from step 1 \n\\end{itemize}\nIn the remainder of this section, we first describe the algorithm, and then validate it by testing whether it produces improved simulation results over a simple grid-cell level simulation that incorporates no spatial information. \nWe describe only the basic steps here, and give details and equations in Section S6 in the Supplementary Document.\n\n\\subsection{Changing Individual Rainstorm Sizes} \\label{subsection:ChangingSize}\n\n\nTo change the sizes of observed rainstorms, we first determine the location-dependent resizing factors by comparing the estimated size functions between the baseline and future model runs (computed using the approach in Section 4\\ref{section:SpatialAnalysis}).\nWe then resize each observed rainstorm at each time step using the resizing factor that corresponds to its central location. To avoid changing the shape of a storm, we follow a simple resizing procedure that involves changing the distances between the storm center and all individual grid cells in the storm by the same factor. \nWe regrid the rainstorm mathematically to a grid whose spacing is the inverse of the resizing factor (Figure \\ref{figure:simulation}a, second panel). \nWe then resize these new grid cells to those of the original grid, while keeping the center of the resulting rainstorm as close as possible to its original location (Figure \\ref{figure:simulation}a, third panel). \n\nNote that in some cases a rainstorm event is split into two or more sub-storms that are far from each other. For resizing purposes, we consider that those two parts warrant individual treatment if the shortest distance between their edges is greater than 120 km. In this case we define separate central locations and separate resizing factors for each sub-storm in the scattered rainstorm event.\n\n\\subsection{Changing Intensity Distribution at Each Grid Cell Location} \\label{subsectionChangingEachCell}\n\n\nIn the second step of the algorithm, we change the time series at individual grid cell locations to adjust the marginal distribution of intensities. An illustrative example of the transformation described here is shown in Figure \\ref{figure:simulation}b. The basic idea is to change the observed time series using a transformation that turns the marginal distribution of the baseline time series into the future time series at the same geographical location. Since the observational data are not on the same grid as the model output, we use the time series at the closest model grid cell location to find the transformation. Note that we are transforming the observed time series from the dataset given by the resizing procedure described in the previous section, not the original observational dataset. Therefore, to find the right transformation, we need to transform the baseline model output with the same resizing procedure and use the time series from the changed output.\n\n\nWe first change the number of wet time steps (i.e. time steps with positive precipitation amount) at each location as suggested by the model time series at the same geographical location. If the model time series shows a decrease in the number of wet time steps, we apply the same fractional change by turning the lowest intensities into zeros. If the number of wet time steps increases, we promote some of dry time steps (i.e. time steps with no precipitation amount) to wet time steps to apply the same fractional change. To choose the dry time steps to promote, we use an idea similar to that described in \\citet{vrac2007statistical}, which creates rainfalls that are close in space or time to existing rainfalls. We first promote as many time steps as possible based on the precipitation amounts in their spatially adjacent grid cells. If there are not enough grid cells with positive precipitation in their spatially adjacent grid cells, we select the time steps based on the precipitation amounts in their adjacent time steps. \n\nOnce the number of wet time steps is changed, we transform the marginal distribution of positive intensities for each time series. For each value of an individual time series, we find the rescaling factor by computing the ratio between the corresponding quantiles of the baseline intensities and the future intensities. We multiply each value by the rescaling factor computed in this way to obtain a simulated time series. We transform the time series at all grid cell locations in this way to obtain a simulation for future precipitation. \n\n\\subsection{Comparing Simulation Results to Grid Cell-wise Simulation} \\label{subsection:ComparingResults}\n\n\n\nWe evaluate the performance of our simulation approach by applying it to the baseline model run itself, whose future state is known. We then check if the resulting simulated precipitation patterns indeed reproduce statistical characteristics of the actual future run. As a metric for comparison, we evaluate the distribution of ``dry spell'' lengths (successive timesteps without rainfall), a characteristic that is not itself explicitly adjusted in our simulation method. We compare the performance of our simulation, that incorporates spatial information about rainstorm events, with a simpler ``grid cell-wise simulation'' that uses no information from adjacent grid cells (but instead simply changes the intensity distribution at a given location as in Section \\ref{subsectionChangingEachCell}b). Table \\ref{table:KLDivergence} summarizes the results for five regions of the United States  (Midwest, Great Plains, Northeast, Wet South, and Dry South, see Figure S4 for how we define those regions). In all regions, the rainstorm event-based approach produces offers advantages over the simpler grid-cell-based approach in summer (when precipitation changes are dominated by intensity and size, the two factors our approach addresses). In winter, when rainstorm changes include features not captured by our approach (changes in number and duration), the event-based approach offers comparable performance but no clear advantage. \n\nFor the summer season, the results show that our approach produces a distribution of dry spell lengths that are closer to those from the future model run than the baseline model run. Moreover, our approach outperforms the grid cell-wise approach in terms of reproducing the distribution of dry spell lengths in the actual future run in all regions. The findings here show that changing the sizes of rainstorm events in our simulation approach leads to a better performance in simulating individual time series for the summer season. This result might seem somewhat counterintuitive because one may think that changing properties of rainstorm events is relevant mostly to the spatial characteristics of the precipitation patterns and hence not important in improving the grid cell-wise performance. However, we argue that changing rainstorm events can in fact lead to a better simulation results for each grid cell by allowing more flexible changes. Figure \\ref{figure:SimulExample} illustrates this point using an   example time series from the observational data at the grid cell location close to Chicago. As shown in the figure, our rainstorm event-based approach often removes a whole precipitation event from the grid cell location by changing the sizes of rainstorm events and therefore leads to a more flexible adjustment to the overall precipitation pattern at the location. In contrast, the grid-cell level approach adjusts mostly the magnitudes of the precipitation rate and therefore other aspects of observed precipitation patterns are largely unaffected.\n\n\n\n\n\n\n \n \n\\section{Discussion} \\label{section:discussion}\n\n\n\n\n\nClimate model projections robustly imply that the spatio-temporal characteristics of precipitation events must change in future climate states. To help understand those potential changes, we have developed a new framework for analyzing changes or differences  \nin rainstorm characteristics, including metrics for average intensity, size, duration, and number.\n The analysis framework is applicable both for comparison of future to present-day model simulations and for characterizing and validating the performance of models against observations. The same metrics allow us also to construct a method for simulating future precipitation events that combines model-projected changes with observational data.\n \nUsing this framework, we compare rainstorm properties in present and future high-resolution (12 km) dynamically downscaled model runs (WRF driven by CCSM4), and between those runs and the Stage IV radar-based observational data product. \nIn all cases, the largest factors driving differences in rainstorm properties are intensity and size, and in the summer season, when U.S.\\ precipitation is predominantly convective, intensity and size are virtually the only factors of importance. In the model-observation comparison, WRF summer storms are too large but also too weak (leaving total precipitation consistent with observations). In the present-future model run comparison, WRF summer storms become smaller and stronger under future climate conditions (allowing total precipitation to rise less steeply than storm intensity). \nThe same size-intensity tradeoffs are apparent in winter, when U.S.\\ precipitation tends to be large-scale, but differences in the duration and frequency of rainstorms also become important.  \nIn the model-observation comparison, WRF winter storms are not only too large and weak, but also too few and too long-lasting. In the model present-future comparison, WRF winter storms become smaller and stronger, as in summer, but also more numerous and of shorter duration. \n \n  \n \n\n\n These parallels may aid in understanding the underlying causes of model bias. Note that model-observation biases are generally larger than the projected changes under nearly a century of  business-as-usual CO2 emissions. (To compare model projections to model bias, see Tables S1 and S2, which reproduce Tables \\ref{table:SummerDisc} and \\ref{table:WinterDisc}, but for the Stage IV data area only.) WRF future simulations project that rainstorms become 20-26\\% more intense (in summer and winter, respectively), but those future model storms remain weaker than observed present-day storms (by 13 and 29\\%). Size biases are even more persistent: for example, future WRF winter rainstorms become 4\\% smaller, but remain 130\\% larger than in observations (Tables S1 and S2).\n\nThe scale of these biases suggests that a methodology for identifying detailed rainstorm characteristics, such as that described here, is essential for validating and improving the representation of precipitation in models. \n\n\nModel bias in rainstorm characteristics does not invalidate the lessons of the present-future model comparisons. The \\textit{changes} in precipitation intensity and amount are well-understood consequences of different physical constraints on the hydrological cycle. \nThe rise in intensity is driven by the increased water content in warmer air and matches the fractional rise in saturation vapor pressure (Clausius-Clapeyron). The rise in total precipitation is the result of the radiative properties of a more infrared-opaque atmosphere, which mandate a greater export of energy from the surface to the atmosphere as latent heat. \nThe resulting changes in intensity and amount are robust across models \\citep{knutson1995time,allen2002constraints,held2006robust,willett2007attribution,stephens2008controls,wang2012review} and are replicated in the dynamically downscaled runs here. That robustness suggests that the intensity/amount discrepancy shown in models will also manifest in the real world as climate evolves, and that precipitation events in the real world must, like those in all simulations, experience some compensating change in spatio-temporal characteristics.  The WRF simulations described here provide a self-consistent response to these fundamental constraints and at least a potential analogue for understanding the real-world response. In WRF, compensation largely occurs through reduction in rainstorm size, with the size factor overwhelmingly dominant in summertime convective precipitation. \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe identified changes in summer and winter precipitation characteristics have different implications for the societal impacts of changing hydrology. The robust rise in precipitation intensity in model projections has prompted concern about increase in severe flooding events. The WRF model runs here suggest that risk may be lessened by a reduction in storm size. \nFrom the viewpoint of regional hydrology, more severe but smaller storms may cause less flooding than more severe but less frequent storms. At the scale of a drainage basin, summer precipitation per rain event in our simulations rises not as Clausius-Clapeyron but as the smaller rise in total rainfall amount.  \nIn winter,  precipitation events show more complex and potentially more impactful changes than those in summer. Intensity increases are somewhat less than in summer, but storm frequency (number of initializations) plays a larger role in compensating for the intensity/amount discrepancy. The combination means that at the scale of a drainage basin, precipitation per event would increase by more in winter than in summer. Furthermore, the spatial heterogeneity of changes in wintertime precipitation characteristics would imply more geographically diverse local impacts of future precipitation changes. \nThose heterogeneities also mean that observational studies of limited regions may be an unreliable guide to average future impacts. For example, \\citet{berg2013strong} studied individual rain events in Germany in radar-based data and concluded that while convective precipitation increases in intensity at warmer temperatures, large-scale precipitation does not. The WRF model runs analyzed here conflict with that finding, but also suggest that a possible explanation may simply be geographic diversity in response.\n\n\n\n\n\n\n\n\nThe potential flood impacts from more severe storms have motivated our development of precipitation simulation methods for risk assessments. While our approach has a clear advantage over other plausible simulation methods for summer precipitation, simulating winter precipitation remains a research priority. Since our model runs project a future increase in winter storm number, a data-driven simulation algorithm that includes such an increase would have to create new rainstorms in the observational record, rather than simply modifying existing storms. Creating physically plausible precipitation events would likely require consideration of many other variables, including temperature and relative humidity. In the summer, agricultural assessments would require joint simulation of precipitation and temperature, another outstanding research challenge.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis analysis represents, to our knowledge, a first attempt to understand and simulate model-projected changes in precipitation characteristics such as size, duration, and frequency of rainstorm events. The results provide both insight and a practically useful simulation approach, and the methodology for identifying and tracking storms opens up many other potential areas of research. One important area is understanding potential changes in storm tracks. While our preliminary analysis shows no obvious changes in rainstorm trajectories, further analysis would be useful.\nThe existing studies that examine rainstorm trajectories do so rather informally \\citep{hodges1994general,morel2002climatology2,xu2005kernel,cressie2012dynamical} and formal statistical analysis of rainstorm trajectories is a largely unexplored area. \n\nA second obvious need is for multi-model studies to determine if \n\nreduction in rainstorm size is robustly the dominant mechanism that compensates for the intensity/amount discrepancy in future projections. Finally, studies at other latitudes may provide additional insight.\nThe changes in precipitation characteristics identified here, even if robust across models, are not a response to temperature rise alone and would not be the same in other geographic regions. In the tropics, total precipitation rises \\textit{more} rather than less steeply than Clausius-Clapeyron, requiring a different compensating response. Understanding how precipitation characteristics change in response to geographically differing constraints on the hydrological cycle may provide new insight into convective organization and structure. All these studies are made possible only given a methodology for identifying and studying the physical characterisitics of individual storms.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Acknowledgments}\nThe authors thank Dongsoo Kim for helpful comments on the observational dataset. This work was conducted as part of the Research Network for Statistical Methods for Atmospheric and Oceanic Sciences (STATMOS), supported by NSF Award \\#s 1106862, 1106974, and 1107046, and the Center for Robust Decision Making on Climate and Energy Policy (RDCEP), supported by the NSF Decision Making Under Uncertainty program Award \\# 0951576.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \\bibliographystyle{ametsoc2014}\n \\bibliography{../short,../references}\n\n\\newpage\n\n\n\n\n\\begin{table}\n\\begin{center}\nModel vs. Observations, Summer (JJA),\\\\\n\\begin{tabular}{l|r|r|r}\n\\hline\n&   Observation & Model &  Difference (\\%)  \\\\\n \\hline\nAnnual Mean (cm/season) & 21 & 20& -4.7 \\\\\n\\hdashline\nIntensity (mm/hour) &  3.8 & 2.6 &  -33   \\\\ \nSize (10$^4$ km$^2$) &  3.4 & 5.3 & 51   \\\\ \nDuration (hour) & 10.9 & 9.7 & -11  \\\\\nNumber of Storms (storms/hour)& 1.5 & 1.6 & 5.1 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Comparison of rainstorm characteristics between the WRF model output and Stage IV data for the summer season. The number of storms in the last row show the number of rainstorm initializations ($N$ in Section \\ref{section:RainstormAnalysis1}). The values in the first and second columns are the average values in the model run and observational data respectively, and the values in the last column are their fractional differences. To remove the Western region where Stage IV data are problematic, we exclude the model output and data from the region west of $114^\\circ$ W from the comparison. The overall precipitation amount in the model output matches well with observational with only about 5\\% underestimation (first row). However, the mean intensity is 33\\% smaller (second row) and the size factor is 51\\% larger (third row) than those from the observations, indicating that the summer rainstorms in the model output are much larger and weaker comparing to the rainstorms in the baseline model run. The other characteristics, the duration and the number of rainstorms show relatively smaller differences (fourth and fifth rows respectively).}\n\\label{table:SummerDisc}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\\begin{center}\nModel vs. Observations, Winter (DJF)\\\\\n\\begin{tabular}{l|r|r|r}\n\\hline\n&  Observation & Model &  Difference (\\%) \\\\\n \\hline\nSeasonal Mean (cm/season)& 13& 14 & 14\\\\\n\\hdashline\nIntensity (mm/hour) &  2.4 & 1.4 &  -39  \\\\ \nSize (10$^4$ km$^2$) & 9.9 & 25& 150  \\\\ \nDuration (hour) & 15 & 24 & 61  \\\\\nNumber of Storms (storms/hour) & 0.35 & 0.17 & -53\\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Same as Table 1 but for the winter season. The overall precipitation and intensity show slightly more discrepancy than the summer season, as the model produces about 14\\% more overall precipitation with 39\\% less intensity (first and second rows respectively). Other rainstorm properties show much larger differences,   as the model rainstorms are much larger (150\\%, second row) and longer (61\\%, third row), but much less frequent (-53\\%, fifth row) than observational data.}\n\\label{table:WinterDisc}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\\begin{center}\nBaseline vs. Future, Summer (JJA), Contiguous U.S.\n\\begin{tabular}{l|r|r|r|r}\n\\hline\n&  Baseline & ~~Future~~ &  Change (\\%/K) & 95\\% CI for Change \\\\\n \\hline\nSeasonal Mean (cm/season)&  21.0 &   24 &    3.0 &    (0.98, 5.1)\\\\\n\\hdashline\nIntensity (mm/hour) &  2.4 & 3.1 &  6.2  & (3.9, 8.4) \\\\ \nSize (10$^4$ km$^2$) &  4.9& 4.3 & -3.2  & (-5.2, -0.70) \\\\ \nDuration (hour) & 9.8 & 9.9 & 0.17  & (-0.26, 0.52)) \\\\\nNumber of Storms (storms/hour) & 1.9 & 2.3 & 0.53  & (-0.35, 1.4)\\\\\n\\hhline{=====}\nTemperature (K) & 295.8 & 300.1 & 4.3 & \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Changes in rainstorm properties from the baseline run to the future run for the summer season. The first and second columns show the average values of each factor defined in Section 4\\ref{section:factorization} for the baseline and future runs respectively. The third and fourth columns show the fractional changes of each factor per temperature change and their 95\\% confidence intervals (See Section 4\\ref{section:ComparisonMethod}\n for how they are computed). The last row shows the average temperatures  in the study area for each run and their difference (4.3K). The changes in each factor are computed as the fractional change divided by the temperature difference. The annual mean increases by about 3.0\\%/K (12\\% in total) and the intensity by about 6.2\\%/K (27\\% in total), which aligns well with existing studies. Both of the  changes are statistically significant as the lower limits are greater than 0\\%/K. The size factor significantly decreases and the magnitude of change (-3.2\\%/K, -13.7\\% in total) is much larger than other aspects, indicating that the change in size is the main compensating mechanism for the mismatch between the annual mean and intensity. Other aspects are projected to remain almost the same.}\n \\label{table:SummerChange}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\\begin{center}\nBaseline vs. Future, Winter (DJF), Contiguous U.S.\n\\begin{tabular}{l|r|r|r|r}\n\\hline\n&  Baseline & ~~Future~~ &  Change (\\%/K) & 95\\% CI for Change \\\\\n \\hline\nSeasonal Mean (cm/season)& 20& 22 & 2.5 & (-1.2, 6.6) \\\\\n\\hdashline\nIntensity (mm/hour) &  1.6 & 1.9 &  4.4  & (2.5, 5.8) \\\\ \nSize (10$^4$ km$^2$) &  30 & 29 & -0.76  & (-3.1, 2.0) \\\\ \nDuration (hour) & 25 & 25 & -0.34  & (-1.6, 1.5) \\\\\nNumber of Storms (storms/hour) & 0.17 & 0.17 & -0.73  & (-2.5, 1.0)\\\\\n\\hhline{=====}\nTemperature (K) & 274.9  & 279.5  & 4.6 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{The same as Table 3 but for the winter season. The change in temperature is very close to the summer season (4.6 K). The annual mean increases by about 2.5\\%/K (11\\% in total) and the intensity by about 4.4\\%/K (20\\% in total), which are smaller than the values in the summer season and also those reported by other studies. While the change in size factor is larger than those in duration and number of storms as summer, the magnitudes of changes in size and number are similar.}\n \\label{table:WinterChange}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\\begin{center}\nBaseline vs. Future, Summer (JJA), Dry Region\n\\begin{tabular}{l|r|r|r|r}\n\\hline\n&  Baseline & ~~Future~~ &  Change (\\%/K) & 95\\% CI for Change \\\\\n \\hline\nSeasonal Mean (cm/season)& 3.2 & 2.6 & -4.6 & (-9.5, 2.0) \\\\\n\\hdashline\nIntensity (mm/hour) &  2.8 & 3.1 &  2.4  & (-1.0, 5.0) \\\\ \nSize (10$^4$ km$^2$) &  3.8& 2.7 & -6.6  & (-9.9, -2.5) \\\\ \nDuration (hour) & 8.6 & 8.3 & -0.8  & (-1.7, 0.0)) \\\\\nNumber of Storms (storms/hour) & 0.39 & 0.41 & 1.2  & (-0.70, 3.4)\\\\\n\\hhline{=====}\nTemperature (K)  & 299.5  & 304.0  & 4.5  \\\\\n\\hline\n\\end{tabular}\n\\caption{The same as Table 3 but for the regions where the annual mean precipitation decreases in the summer season. The factors are computed by treating the region illustrated in Figure S1 in the Supplementary Document as the study area. The change in temperature is similar to the entire study area in summer (4.5K). The increase in intensity is much smaller and the decrease in size factor is much larger than the entire contiguous U.S.\\ Other aspects remain almost unchanged. }\n \\label{table:SummerChangeDry}\n\\end{center}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\n\\begin{center}\nBaseline vs. Future, Winter (DJF), Dry Region\n\\begin{tabular}{l|r|r|r|r}\n\\hline\n&  Baseline & ~~Future~~ &  Change (\\%/K) & 95\\% CI for Change \\\\\n \\hline\nSeasonal Mean (cm/season)& 4.6 & 3.4 & -6.0 & (-10, -0.63) \\\\\n\\hdashline\nIntensity (mm/hour) &  1.7 & 1.9 &  3.1  & (-0.26, 5.3) \\\\ \nSize (10$^4$ km$^2$) &  19 & 14 & -5.9  & (-9.3, -3.2) \\\\ \nDuration (hour) & 22.0 & 20.2 & -1.4  & (-3.0, 0.31)) \\\\\nNumber of Storms (storms/hour) & 0.067 & 0.066 & -0.50 & (-3.3, 2.5)\\\\\n\\hhline{=====}\nTemperature (K)  & 278.2 K & 282.6 K & 4.4 K \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{The same as Table 4 but for the regions where the annual mean precipitation decreases in the winter season. The factors are computed by treating the region illustrated in Figure S1 in the Supplementary Document as the study area. The change in temperature is close to the entire study area in winter (4.4K). Unlike the changes in the entire contiguous U.S.\\ shown in Table 4, the size factor clearly decreases in the future and the change is statistically significant.}\n \\label{table:WinterChangeDry}\n\\end{table}\n\\clearpage\n\n\\begin{table}\n\\begin{center}\nKL-divergence vs. Actual Future (Dry spell Length)\\\\\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~($ \\times10^{-2}$)\\\\\n\\begin{tabular}{l|l|ccccc}\n\\hline\nSeason&Region&i. Baseline&ii. Pixel-wise&iii. Storm-based&i-iii&ii-iii\\\\\n\\hline\n\\multirow{ 5}{*}{Summer}& Wet South&   0.47 &   0.17 &   0.09 &   0.38 &   0.07\\\\\n& Dry South &   0.49  &  0.25  &  0.22  &  0.26 &   0.03\\\\\n& East Coast &   0.39 &   0.37  & 0.28  &  0.11 &   0.09\\\\\n& Midwest &   0.44 &   0.18  &  0.12   & 0.32 &   0.07\\\\\n& Great Plains &   0.19  &  0.11  &  0.11 &  0.08  &  0.00\\\\\n\\hdashline\n\\multirow{ 5}{*}{Winter}& Wet South&   0.41 &   0.33  &  0.33 &   0.09 &   0.00\\\\\n& Dry South &   1.32 &   0.46 &   0.49 &   0.83&   -0.03\\\\\n& East Coast &   0.29  &  0.28   & 0.28  &  0.01  &  0.00\\\\\n& Midwest &   0.34  &  0.30 &   0.28 &   0.06 &   0.02\\\\\n& Great Plains &   0.67 &   0.49  &  0.47 &  0.20 &   0.03\\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{\nKullback-Leibler divergences from each simulation to the actual future model runs in terms of the\ndistributions of dry spell lengths. For each region, we find the dry spell lengths at each grid cell and pool them into one dataset to make a histogram. We then compare these histograms using the Kullback-Leibler (KL) divergence As a reference value, we compute the KL divergence for the baseline model run against the actual future simulation for each state (third column). For the histograms from the two simulation methods, we compute the KL divergence to measure how different they are from the histogram of the dry spell lengths from the actual future run (fourth and fifth columns). The differences in KL-divergence between the baseline and our approach measures how our simulations are closer to the actual future run than the baseline model run (sixth column). The difference in KL-divergence between the grid\ncell-wise approach and our approach measures how our simulations performs better than those from the\ngrid cell-wise approach (seventh column). In summer, our approach clearly shows a better performance in reproducing the distribution of dry spell lengths than the grid cell-wise approach as the storm size and intensity are the main drivers of rainstorm changes in this season. In winter, however, our approach does not yield better  results compared to the grid-cell approach because the duration and number of storms also contribute to the changes.}\n\\label{table:KLDivergence}\n\\end{table}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\clearpage\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.6]{Figure1.png}\n\\end{center}\n\\caption{Fractional changes in the global annual mean of water vapor content in a CCSM4 run from the CMIP5 archive under the RCP 8.5 scenario (blue circles), the theoretical water vapor content given by the Clausius-Clapeyron relation (sold blue line), the precipitation intensities from our WRF runs in the summer (blue asterisk) and winter (blue square) seasons, and the total precipitation amount in the CCSM4 run (red circles), the WRF runs in summer (red asterisk), and winter (red square), as a function of the annual global mean temperature changes.  The water vapor content increase in the CCSM4 run and the precipitation intensity changes in the WRF runs roughly follow the theoretical relationship given by the Clausius-Clapeyron relation, although the WRF runs in winter show a slightly smaller change. The total precipitation increases in all cases (CCSM4, WRF summer, and WRF winter) are much lower than this theoretical relationship.}\n\\label{figure:puzzle}\n\\end{figure}\n\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.43]{Figure4.png}\n\\end{center}\n\\caption{Example precipitation patterns in a single time step form (a) WRF and (b) Stage IV data, for the summer  (left panels) and winter seasons (right panels). Both model and observations show summer precipitation mostly from small-scale convective storms and winter precipitation from larger-scale phenomena.}\n\\label{figure:illustration}\n\\end{figure}\n\n\\clearpage\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.46]{Figure2.png}\n\\end{center}\n\\caption{Comparison of time-averaged precipitation in the baseline model run and in Stage IV observational data. Here we use the 24 hourly Stage IV dataset, to have a better coverage in the West Coast. The model underestimates precipitation in the East and overestimates it in the West.}\n\\label{figure:SpatialAndHistogram}\n\\end{figure}\n\n\n\n\n\\clearpage\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.55]{Figure3.png}\n\\end{center}\n\\caption{Cumulative distributions of precipitation vs.\\ intensity in the baseline model output (solid) and in observations (dashed). Summer is shown in red and winter in blue for both cases. Data used are 3-hourly precipitation for all individual and model grid cells (i.e.\\ no spatial or temporal aggregation). Units are restated as hourly precipitation for clarity. High-intensity precipitation contributes more heavily to cumulative precipitation in observations than in model output, in both seasons. Differences here imply that intensities of rainfall in model output are $\\sim 50$\\% lower than those in observations.\n\n This difference is unlikely to be a sampling artifact of spatial resolution since both model and observation grid cell sizes (144 and 16 km$^2$) are considerably smaller than typical storm sizes.\n Black line marks our cutoff threshold for the analysis. (We exclude precipitation below intensity of 0.33 mm/hour). This cutoff  negligibly affects the analysis; even in the worst case (model winter) we exclude only 1.8\\% of total precipitation.}\n\\label{figure:lost_amount}\n\\end{figure}\n\n\n\n\n\\clearpage\n\\begin{figure}\n(a)\n\\begin{center}\n\\includegraphics[scale=0.25]{Figure5a.png}\n\\end{center}\n(b)\n\\begin{center}\n\\includegraphics[scale=0.37]{Figure5b.png}\n\\end{center}\n\\caption{Challenges posed by our rainstorm identification and tracking problem. (a) All contiguous precipitation regions distinguished by different colors  from an example time step (left panel) and a standard clustering result in naive almost-connected-component labeling (right panel). Due to the chaining effect, the labeling approach results in overly large segments. (b) An example of a rainstorm split into two different rainstorms over time. Our tracking algorithm needs to be able to track both sub-storms and label them as the same rainstorm event.}\n\\label{figure:challenges}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.18]{Figure6.png}\n\\end{center}\n\\caption{Illustration of our rainstorm identification algorithm. In Step 1, we identify all contiguous precipitation areas. In Step 2, we apply almost-connected-component labeling for only the large areas. In Step 3, we add small areas to the existing nearby rainstorm events if they are close enough to any existing ones. In Step 4, we form rainstorm events that consist of only the remaining small areas. This approach prevents the chaining effect shown in Figure \\ref{figure:challenges} (a).}\n\\label{figure:identification}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.23]{Figure7.png}\n\\end{center}\n\\caption{Rainstorm events constructed by our tracking algorithm in three consecutive example time steps. The rainstorm events are distinguished by different colors. Rainstorms with the same colors at different time steps belong to the same rainstorm objects. Our algorithm can efficiently track multiple events simultaneously.}\n\\label{figure:tracking}\n\\end{figure}\n\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.26]{Figure8_summer.png}\n\\end{center}\n\\caption{Model-observation comparison for the summer season. The discrepancy plots (third column) are obtained by computing the fraction of difference from the baseline model run (first column) to observational data (second column) at each grid cell. The annual mean and intensities are computed for individual pixels (first and second rows). Each pixel of the panels in the third row represents the average size of rainstorms that pass by the location. Each pixel of the panels in the fourth and fifth rows represents the average duration and frequency for the storms that originate form the location. The observed rainstorms are much more intense and smaller compared to the rainstorms in the baseline model run. The discrepancy in the number of rainstorms shows clear north-south contrast, with too many observed rainstorms in the northern half and too less in the southern half of the contiguous U.S.\\ }\n\\label{figure:SummerDisc}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.26]{Figure8_winter.png}\n\\end{center}\n\\caption{The same plots as those in Figure \\ref{figure:SummerDisc} but for the winter season. The observational data have much higher total annual precipitation in the East Coast and Southeast regions and much lower in the remaining  regions. The observed rainstorms are generally much larger in number and much smaller in size except for Florida, Maine and the southern end of Texas.}\n\\label{figure:WinterDisc}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.26]{Figure9.png}\n\\end{center}\n\\caption{Spatial patterns of fractional changes in annual mean, intensity, size, duration, and the number of storms in the summer and winter seasons. The areas screened out by dots roughly cover the regions with precipitation amount less than 10 cm/season. As similar to Figure \\ref{figure:SummerDisc}, each pixel of the panels in the first and the second rows represent changes at individual grid cell location. For the size change patterns (third row), each pixel shows the changes in average size of storms that pass by the grid cell location. In the fourth and fifth rows, each pixel shows the changes in the duration and number of the storms that originate from the grid cell location. In the summer seasons the total precipitation amount  increases except for a part of the Southern region. The intensity also increases in most regions except for a small part of the Southern region. In most regions, the average rainstorm size substantially decreases but the duration and number of storms do not show clear changes. In the winter seasons, the overall spatial patterns of changes are more complex than in the summer seasons. }\n\n\\label{figure:SpatialChange}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n(a)\\\\\n\\includegraphics[scale=0.5]{Figure10a.png}\\\\\n(b)\\\\\n\\begin{center}\n\\includegraphics[scale=0.8]{Figure10b.png}\n\\end{center}\n\\caption{Illustration of two steps of our simulation algorithm. (a) Shrinking an observed rainstorm by regridding it into a coarser grid and resizing the new grid cell to original grid cell size. This approach resizes a rainstorm without changing the shape of the original rainstorm. (b) An example of intensity distribution transformation applied to a grid cell near Chicago area. The plot shows the cumulative precipitation amounts versus the precipitation rate rescaled relative to the maximum rate for the WRF baseline (solid red line) and future (dashed red line), and Stage IV data before (solid blue line) and after (dashed blue line) applying the transformation. The algorithm applies the same transformation that changes the marginal distribution of the baseline time series into the future time series.}\n\\label{figure:simulation}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.65]{Figure11.png}\n\\end{center}\n\\caption{An example of original time series in 2006 August from the Stage IV data (solid gray line) at a grid cell location near Chicago area and the corresponding simulated time series from the grid cell-wise approach (dashed red line) and our approach (solid blue line). The grid cell-wise  approach mostly rescales the intensity of the original time series, but our approach allows more flexible changes such as removing rainstorm events on 8/20 and 8/28 and drastically changing the intensity distributions for the rainstorm events on 8/19 and 8/29.}\n\\label{figure:SimulExample}\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 25156, "prevtext": "\nThe definitions of these factors ensure that the same fractional change in different factors leads to the same total amount change (see below), so that we can make a fair comparison between the effects of changes in different rainstorm properties. We use these factors to compare the baseline period and the future period to identify which spatio-temporal aspects of rainstorms are the main drivers of precipitation pattern changes and how they contribute to the total precipitation amount change in Section 4. We also use them to compare the baseline period and the observational data to examine the model-observation discrepancy in terms of rainstorm characteristics. Each factor is defined as follows:\n\n\\textit{\\textbf{Average intensity (mm/hour)}}. The average precipitation intensity is the size-weighted average of all rainstorm intensities. Since the length of each time step is 3 hours, the hourly intensity is computed as $\\frac{1}{3} \\times \\sum_{i=1}^{N} \\sum_{t=b(S_i)}^{e(S_i)} a(S_i,t) \\times s(S_i,t) / \\sum_{i=1}^{N} \\sum_{t=b(S_i)}^{ e(S_I)} s(S_i,t)$.\n\n\\textit{\\textbf{Size factor (km$^2$)}}. Size factor is the average storm size per each rainstorm event at each time step, computed as $\\mbox{(the area of each grid cell)} \\times \\sum_{i=1}^{N}\\sum_{t=b(S_i)}^{e(S_i)} s(S_i,t) / \\sum_{i=1}^{N} l(S_i)$, where the area of each grid cell is $144 \\mbox{ km}^2$ for the model output and $16 \\mbox{ km}^2$ for the observational data.\n\n\\textit{\\textbf{Duration factor (hour/rainstorm)}}. Duration factor is the mean duration per each rainstorm event. The factor is computed as $3 \\mbox{ hours}\\times\\sum_{i=1}^{N}  l(S_i)  / N$, because the length of each time step is 3 hours.\n\n\\textit{\\textbf{Number of Rainstorms}}. The number of rainstorms is simply given by $N$.\n\n\\subsection{Spatial analysis} \\label{section:SpatialAnalysis}\n\n\n\nWe can also use the computed metrics to find and visualize the spatial distribution of the rainstorm characteristics over the area of interest. Following a standard procedure in spatial point process analysis \\citep[see, e.g. ][Chapter 21]{gelfand2010handbook}, we estimate the expected number of rainstorms originate at a spatial location $\\mathbf{s}$ as\n\n", "index": 3, "text": "\\begin{equation*}\nn(\\mathbf{s})=\\sum_{i=1}^{N} k(c(S_i,1),\\mathbf{s}),\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"n(\\mathbf{s})=\\sum_{i=1}^{N}k(c(S_{i},1),\\mathbf{s}),\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐬</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>S</mi><mi>i</mi></msub><mo>,</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mi>𝐬</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]