[{"file": "1601.04584.tex", "nexttext": "\n\nAs shown in Fig. $1$d, $\\phi_A$ values agree with the theoretical porosity curve, $\\phi_T$ (solid line). This confirms that the beads are positioned almost perfectly inside the tube to achieve a certain packing configuration.\n\nAll evaporation experiments are carried out in a controlled environment chamber (Electro-Tech Systems â\u0080\u0093 Model $5100$, PA, USA) where relative humidity ($20.0 \\pm 2.0\\%$) and temperature ($32 \\pm 2^{\\circ}$C) are kept constant. Images of the receding front are taken over time using a Canon $500$D SLR camera with $18-55$~mm lens with a resolution of 35 $\\mu$m per pixel. \n\n\\begin{figure}\n\\centerline{\\includegraphics[width=3.5in]{Fig1}}\n\\caption{Illustrations of the ``single-column\" porous media configurations of circular tubes filled with glass spheres of packing angle, $\\alpha$. (\\textbf{a}) Straight configuration with $\\alpha = 180^{\\circ}$. (\\textbf{b}) Loose packing configuration with $60^{\\circ} < \\alpha < 180^{\\circ}$. (\\textbf{c}) Close-packed configuration with $\\alpha \\sim 60^{\\circ}$. (\\textbf{d}) Graph of the experimental porosities as a function of the average measured packing angle. The theoretical porosity curve, Eq. 1, is also plotted versus the experimental porosity. The horizontal error bars are the standard deviations of the average packing angle value measured between all the beads in the tube. The vertical error bars come from the calculation of the experimental porosity, which includes uncertainties for the actual tube diameter and the actual radius of the spheres.  The inset shows a geometrical representation of adjacent spheres from which the theoretical porosity can be derived using trigonometry.  }\n \\label{Fig1}\n\\end{figure}\n\n\n\n\n\\section{Background}\n\nDrying of wet granular media has been widely studied in recent years. In a granular medium, the main phenomena taking place are illustrated in Fig. $2$a. Drying is widely considered as an invasion percolation process (IP)~\\cite{Shaw87, Prat02}. It is a modified form of percolation, described by displacement of two immiscible fluids~\\cite{Prat99}. Studies~\\cite{Coussot00, Lehmann08, Shokri08, Yiotis12b, Yiotis12a, Prat02, Prat07, Chauvet09, Chauvet10} have shown distinct regimes associated with transport mechanisms that affect evaporation flux behavior in porous media. Water evaporation from porous media such as soil generally has two regimes and an abrupt transition from capillary-supported high and nearly constant rates (regime $1$) to diffusion-controlled lower evaporation rates (regime $2$)~\\cite{Coussot00, Chauvet09, Prat07, Yiotis12a, Yiotis12b, Lehmann08}. During regime 1, the loss of water in the medium leads to liquid-gas interfaces that exhibit high capillary pressures, which permit liquid from the bulk to flow towards the evaporating surface located at the top of the tube. The films form the Partially Saturated Zone (PSZ). The interface between the lower fully wet region and the PSZ is called the percolating front. Its position is denoted as $z_{inf}$. This continuous hydraulic capillary network links the percolating front and the evaporating surface and liquid transport through this network helps sustain evaporation rates~\\cite{Coussot00}. The mechanism taking place during regime 1 is illustrated in Fig. $2$a (left). As long as the liquid films are attached to the upper surface, evaporation rates remain high and the percolating front continues to recede inside the medium. The position of the percolating front, $z_{inf}$, scales linearly with time, $t$, during regime 1~\\cite{Lehmann08, Shokri08, Yiotis12b, Prat02, Coussot00}. After the PSZ reaches a certain characteristic length, which depends on contact angle~\\cite{Chraibi09, Shokri09} or pore shape~\\cite{Prat07, Yiotis12b, Chauvet09}, the capillary connections are broken and thus liquid films detach from the evaporating surface and an evaporating front, $z_{sup}$ starts to form as shown in Fig. $2$a (right). This marks the onset of regime $2$ of evaporation. As the evaporating front also recedes inside the medium, a dry region separates the evaporating front and the surface of the tube. During regime 2, evaporation rates slow down and $z_{inf}$ scales as $\\sqrt{t}$ because gaseous water now diffuses across the dry region to the  surface of the tube~\\cite{Camassel05, Chauvet09, Yiotis12b}. \n\n\n\\section{Results and Discussion}\n\\subsection{Experimental Results}\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3in]{Fig2}\n\\caption{(\\textbf{a}) Schematic of the two evaporation regimes in the single-column porous medium, where $z_{inf}$ is the position of the percolating front, $z_{sup}$ is the position of the evaporating front, and $h$ is the characteristic length of the Partially Saturated Zone (PSZ). In regime 1, we observe fully wet and PSZ; while in regime 2, we observe three zones due to the dry zone below the surface. (\\textbf{b}) Experimental images showing time evolution of Partially Saturated Zone (PSZ) for three different packing configurations: straight, loose, and close-packed. The PSZ for each configuration is indicated by the arrows.}\n\\label{Fig2}\n\\end{figure}\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3.4in]{Fig3}\n\\caption{(\\textbf{a}) Plot of the position of the percolating front, $z_{inf}$, as function of time $t$ and packing angle configuration, $\\alpha$. Each color corresponds to a packing angle in Table 1. For close configurations (1-3), a linear first regime is observed followed by an abrupt transition to the second regime. For loose configurations (4-8), the curves scale as $z \\propto \\sqrt{t}$, similar to the solid line, which represents evaporation from an empty circular capillary tube for reference. (\\textbf{b}) Extent of $h$ plotted as a function of $t$. For close configurations (1-3), a maximum is reached before stabilizing at a constant value. For loose configurations (4-8), the thickness fluctuates suggesting its instability. And for straight configurations (9), it is nearly inexistent. }\n\\label{Fig3}\n\\end{figure}\n\nLiquid inside the tubes are left for evaporation. Typical evaporation patterns can be seen in Fig. 2b, which shows different images at various stages of evaporation. We can see different behaviors depending on the packing configuration. For straight configuration or high packing angle, there is no formation of PSZ (Fig. 2b, left). This behavior is observed until the packing angle is decreased down to  $ \\alpha \\sim 100^{\\circ}$ (Fig. 2b, middle), where films subsist in the PSZ. When the packing angle is again further decreased to a close-packed configuration, a large PSZ appears: the evaporation behavior is now completely analogous to that of a 2D packing. To quantify the differences in evaporation behavior for each packing configuration, we measure the position of the percolating front with time as shown in Fig. 3a. The curves in the figure are numbered according to configuration encoded on the legend bar, whose corresponding packing angle values are shown in Table 1. \n\nFig. 3a also shows a strong difference in the behavior of the front when the packing angle, $\\alpha$, is increased from close-packed configurations to loose configurations. Close-packed configurations (1-3) clearly show a fast-developing first regime prior to an abrupt transition towards the slow second regime of evaporation. For loose configurations (4-9), the position of the percolating increases at a very slow rate. There is no observable first regime. The time-evolution of the front position suggests a purely diffusive regime with time scaling as $\\sqrt{t}$~\\cite{Camassel05, Bird02} (solid line). This same observation is inferred by looking at the extents of the height of the PSZ, $h$, as a function of time, in Fig. $3$b. For loose and straight configurations (4-9), the PSZ seems unstable and $h$ heavily fluctuates around 1 or 2 bead diameters (0.1-0.2~cm). The upper front of the PSZ disconnects immediately from the evaporating surface. This observation confirms the fact that there is no regime 1 for loose and straight configurations, but the system is instantly dominated by the slow regime $2$ of diffusion. Measurements of $h$ for close configuration clearly show two distinct regimes in Fig. 3b (1-3). For close configurations, $h$ reaches a maximum value before stabilization at a quasi-constant value. To summarize, these experiments show that evaporation of a single tube of spheres in a predefined controlled arrangement exhibit the same characteristic as the evaporation of a 2D system. However, the arrangement of the glass bead controls the extent of the PSZ. Above a certain configuration angle, the PSZ cannot form, the evaporation pattern is analogous to that of almost perfectly circular tube (solid black line in Fig. 3a). \n\n\nThe process is modelled and described schematically in Fig. 4. The initial configuration is depicted in Fig. 4a, where a fully saturated tube with beads is shown. As water evaporates, the volume decreases (Fig. 4b).  Air continues to penetrate inside the medium and the menisci form between spherical beads 1, 2, and 3 in Fig. 4c. ``I\" and ``II\" are the menisci between beads 1 and 2 and beads 2 and 3 respectively. At the beginning of the process, menisci ``I\" and ``II\" are linked, water from one meniscus can flow into the other. As the process goes on, Fig. 4c, more menisci develop along the tortuous packing and a column of water forms the PSZ. At the top of the column, however, volume of the meniscus ``I\" gets smaller and smaller until it reaches a volume where the connection between ``I\" and ``II\" break (Fig. 4d). After prolonged periods, this connection is completely disconnected (Fig. 4e). This description helps understand why close-packings allow for larger PSZ heights. Indeed as packing gets closer, menisci of higher curvatures are formed that still ensure hydraulic connectivity with the menisci formed below in the PSZ. Higher curvatures induce higher pressure drops along the columns and therefore lead to larger PSZ~\\cite{Scheel08}.\n\n\n\n\n\n\\subsection{Model Definition of the Extent of the Liquid Film Region}\n\n\nFor a certain height $h$, the difference in pressure along the interfaces of the menisci in the percolating and evaporating fronts of the liquid film region is in equilibrium with the hydrostatic pressure~\\cite{Princen69, deGennes10}. Liquid flow upward towards the tube top is driven by a competition between capillary, viscous, and gravity forces. The Bond number, $B_o = \\frac{\\rho g R^{2}}{\\sigma}$, where $R$ is the bead radius and $\\sigma$ is the surface tension of water, gives $B_o \\sim 10^{-3}$. Thus, capillary forces dominate over gravity. The capillary number is defined as, $C_a = \\frac{\\eta \\nu}{\\sigma}$, where $\\eta$ is the dynamic viscosity and $\\nu$ is the characteristic liquid velocity determined experimentally from the curves of $h = f(t)$. We calculate $C_a \\sim 10^{-9}$. Thus, capillary forces dominate over viscous forces. Thus, for this particular simplified set-up of a granular column of beads inside a circular tube, viscous effects are ignored. In addition, surface tension gradients are also neglected because temperature inside the controlled environment chamber is constant. \n\nThe height, $h$ of the PSZ is then written as:\n\n\n", "itemtype": "equation", "pos": 6748, "prevtext": "\n\n\\title{Effect of granular packing geometry on evaporation}\n\\shorttitle{Effect of granular packing geometry on evaporation } \n\n\\author{Cesare M. Cejas$^{1}$, Larry Hough$^{1}$,\nChristian Fr$\\acute{e}$tigny$^{2}$, and R$\\acute{e}$mi Dreyfus$^{1}$}\n\\shortauthor{C.M. Cejas,  \\etal}\n\n\\institute{                    \n  \\inst{1} Complex Assemblies of Soft Matter, CNRS-Solvay-UPenn UMI 3254, Bristol, PA 19007-3624, USA\\\\\n  \\inst{2} Sciences et Ing$\\acute{e}$nierie de la Mati$\\grave{e}$re Molle CNRS SIMM UMR 7615 ESPCI, Paris, France 75005\n}\n\\pacs{64.70.fm}{evaporation/condensation}\n\\pacs{47.56.+r}{porous media}\n\\pacs{47.55.nb}{capillary effects (interfacial flows)}\n\n\n\\abstract{\nUnderstanding evaporation or drying in granular media still remains complex despite recent advancements. Evaporation depends on liquid transport across a connected film network from the bulk to the surface. In this study, we investigate the stability of film networks as a function of granular packing. Using a controlled experimental approach, we vary the granular packing geometry and show the changes in the height of the liquid film network during evaporation as packing shifts from a loose-packed to a close-packed arrangement. This height can be calculated from an equilibrium between hydrostatic pressure and the pressure difference between two points in the vertical film network. We use a simulation approach to calculate the pressure in both the percolating front and evaporating front within the two-phase zone of air/water mixture. Results show good agreement between the model and the experiment.}\n\n\\maketitle\n\n\n\nWater evaporation out of porous media is a physical process of technological and scientific importance. In particular, it is known to affect mechanical and biological properties of soil. Thus, understanding its mechanism is of primary significance in hydrology~\\cite{Lehmann08}. Previous studies~\\cite{Lehmann08, Shokri08, Yiotis12b, Prat99} have tackled the challenge of predicting the evaporation rate and drying behavior out of a porous medium. More recent studies~\\cite{Dreyfus14} have used evaporation rates to analytically predict the lifetime of plant. It is now well-established that the evaporation rate is intricately related to a so-called Partially Saturated Zone (PSZ), which is a mixture of air and liquid that forms beneath the surface. However, what affects the organization and geometrical characteristics of this layer is still under debate~\\cite{Prat02, Prat07}. \n\nThe mechanism of liquid flow through pores in the PSZ has been described by two models. In the first model, the transport of liquid through the PSZ is explained by the polydispersity of the pores. Pore size distribution is the key point that permits liquid flow from larger pores into smaller ones~\\cite{Lehmann08, Shokri08}. In the second model, polydispersity is not a necessary ingredient. Individual pore size and shape is what governs the transport of liquid~\\cite{Dong95, Chauvet09, Prat07, Chauvet10}. It has been shown both experimentally and numerically that corners within the pore walls help maintain the stability of the films~\\cite{Chauvet09, Yiotis12b} and that the evaporation rate is influenced by sharp corner edges~\\cite{Prat07, Dong95}. Films that carpet these corner edges act as hydraulic pathways for easy and rapid transport of water from the bulk out of the porous medium. Furthermore, it has been demonstrated that the evaporation mechanism out of a complex porous medium is perfectly analogous to the evaporation mechanism out of a square capillary tube, opening new routes towards a simplified and accurate description of evaporation~\\cite{Prat07, Yiotis12b}.  The geometry of the corners of the square tube influence the curvature of the corner films, which could help disrupt or maintain liquid film stability~\\cite{Yiotis12a, Yiotis12b}. This square tube model has been very useful for predicting evaporation rates~\\cite{Camassel05, Chauvet09, Yiotis12a, Yiotis12b}. Still, to improve our understanding of the evaporation process, it is necessary to examine the stability of liquid films and its relation to granular packing geometry. \n\nIn this paper, we study the evaporation out of a circular capillary tube filled with monodisperse glass beads. By changing the ratio between the tube diameter and the glass bead, we control the conformation of the beads in the tube from straight to close-packed. We show that packing configurations play a significant role in the stability of the liquid film network during evaporation and also contributes to transition from a capillary-supported to a diffusion-controlled regime. \n \n\n\n\\section{\\textcolor{black}{Materials and methods}}\nOur experimental set-up consists of two types of capillary tubes and one type of glass spheres of diameter $d = 1.0 \\pm 0.2$~mm (Sigma Aldrich, USA). The borosilicate capillary tubes have lengths of $L = 10$~cm (Vitrocom, NJ, USA), and is of circular cross-section. The tubes are filled with glass spheres to resemble a ``single-column\" porous medium. Given a monodisperse set of glass spheres, two different internal diameters (1.5~mm, 2.0~mm) of the circular capillary tube are used to ensure specific packing configurations. The beads inside the circular tube form a 2D monolayer packing. We do not observe helical structures. The tube walls are made hydrophobic using a silane solution (OMS Solutions, Canada) to reduce wetting effects on the capillary tube wall. \n\nThe columns are vertically mounted on a stand and  the top area remains open. They are fully saturated with deionized water using a vacuum pump. This technique eliminates the presence of bubbles. The glass spheres, pre-washed with 0.1~M HCl, have a constant wetting angle $\\theta = 16.7^{\\circ} \\pm 4.5^{\\circ}$. The spheres are placed in the capillary tubes in different packing configurations defined by the packing angle $\\alpha$, as depicted in Fig. $1$a-c. Straight configurations have a packing angle of $\\alpha = 180^{\\circ}$, while loose configurations have angles of $60^{\\circ} < \\alpha \\leq 180^{\\circ}$, and close-packed configurations have angles of $\\alpha = 60^{\\circ}$. \n\nThe experimental porosities, $\\phi_A$, are calculated from the volume of the capillary tube, $V_C$, and total number of glass spheres, $nV_S$: $\\phi_A = (V_C - nV_S) / V_C$, where $V_S$ is the volume of a single glass bead and $n$ is the total number of glass beads inside the capillary tube. In Fig. $1$d, the porosities are plotted as a function of packing angle, $\\alpha$. The value of $\\alpha$ is the average value of angle measurements of the beads positioned inside the tube. The theoretical porosities are calculated from the geometry of three adjacent spherical particles, shown below:\n\n\n", "index": 1, "text": "\\begin{equation}\n  \\phi_T= 1 - \\frac{2}{(1+\\cos(\\alpha/2))^2(1+2\\sin(\\alpha/2))},\n\\label{Eq1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\phi_{T}=1-\\frac{2}{(1+\\cos(\\alpha/2))^{2}(1+2\\sin(\\alpha/2))},\" display=\"block\"><mrow><mrow><msub><mi>ϕ</mi><mi>T</mi></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mn>2</mn><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>α</mi><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>α</mi><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04584.tex", "nexttext": "\nwhere $\\rho$ is the density of water, $g$ is the acceleration due to gravity, $P_{inf}$ is the pressure in the percolating front while $P_{sup}$ is the pressure in the evaporating front. These two pressures at distinct points in the network are quantities that determine the extent of the PSZ. How can we estimate these two pressures?\n\nFirst, $P_{sup}$ is the pressure at the top of the liquid column (evaporating front). This pressure is minimal when the meniscus adopts the smaller curvature that can still join three beads as shown in meniscus ``I\" in Fig. 4d. To estimate this pressure we focus on the pressure in a single pendular bridge. We consider a drop of water of certain volume trapped between two adjacent spheres as shown in Fig. $5$a. During evaporation, the volume of liquid in the pendular bridge decreases (Fig. 5a) and the pressure is defined as $\\bigtriangleup P = \\sigma (-1/r_1 + 1/r_2 )$. Relative to the surrounding ambient pressure, the liquid capillary bridges have very low pressure (increasingly negative), which allow it to draw liquid from other neighbors~\\cite{Xu08}. \n\nSecond, $P_{inf}$ is the pressure in the bottom of the PSZ (percolating front). During evaporation, the saturation of water at the percolating front is higher compared to the saturation of water at the evaporating front. One can consider the meniscus in the percolation front to have the shape presented in Fig. 5b (left panel). Therefore, to estimate this pressure, we focus on the pressure in the pendular bridge between three adjacent spheres. Here, at constant liquid volume, the shape of the meniscus depends on the half-separation distance, $s$, between the spheres, which changes with the packing angle, $\\alpha$. Fig. 5b (right panel) shows the change in meniscus shape as a function of packing angle. In this figure, increasing liquid volume also increases the value of the bridge angle or half-filling angle, $\\beta$, until liquid film continuity is recovered. Thus, the minimum value of the bridge angle to maintain liquid continuity is $\\beta = \\alpha / 2$ . Tomography data have also shown that the liquid bridges in a dense packing of equally sized spheres, $\\alpha \\sim 60^{\\circ}$, will also achieve coalescence if the bridge angle $\\beta = 30^{\\circ}$~\\cite{Scheel08}.\n\nHaving qualitatively described the forms of the meniscus in the upper and lower parts of the PSZ, we now quantitatively define the pressures in both areas.\n\n\\begin{figure}\n\\centerline{\\includegraphics[width=3.5in]{Fig4}}\n\\caption{(\\textbf{a-e}) Schematic of the evolution of an evaporating meniscus for loose configurations. The system starts out fully saturated. Initially, liquid films denoted as ``I\" and ``II\" are connected but as evaporation proceeds, these liquid films break. }\n \\label{Fig4}\n\\end{figure}\n\n\n\\begin{figure}\n\\centerline{\\includegraphics[width=3.7in]{Fig5}}\n\\caption{(\\textbf{a}) Schematic showing pendular bridge between two spheres. The liquid bridge is described by bridge angle, $\\beta$. The wetting angle is $\\theta$. (\\textbf{b}) Schematic of meniscus in the percolating front (left panel). Schematic showing relationship between packing configuration, $\\alpha$, and liquid volume (right panel). Higher packing angles break film continuity. \nWhen liquid volume is increased, the coalescence of liquid bridges recover film continuity. By geometry, $\\beta$ is half of $\\alpha$. The bridge angle is the minimum angle value in which liquid film continuity is ensured. }\n \\label{Fig5}\n\\end{figure}\n\nTo calculate the pressure in the evaporating front, $P_{sup}$, we use Surface Evolver~\\cite{Carter96, Brakke10, Berthier12} to simulate the meniscus shape between two adjacent beads. Surface Evolver can provide the energy value of the most stable form of the meniscus given a set of constraints (e.g. minimum volume or wetting angle). From this information, we then obtain the pressure value from the derivative of energy with respect to volume,  $P_{sim} = dE/dV_{sim}$. Then, we generate curves depicting pressure as a function of volume. The spheres used in the simulation are in contact with one another. In this case, the only constraint used in the simulation for calculating $P_{sup}$ is meniscus volume, $V_{sim}$. Pressure values calculated from Surface Evolver, $P_{sim}$, are normalized through the following relationship: $P= P_{sim}\\sigma$cos$\\theta/R$. Similarly, the values for volume in Surface Evolver, $V_{sim}$, are normalized using: $V = V_{sim}R^3$, where $R$ is the radius of the bead, $R = 0.5$~mm. The results are in Fig. 6a. The inset figures show examples of Surface Evolver minimization. \n\nTo obtain the curve for pressure as function of packing angle, $\\alpha$, an important relationship to determine is that between $\\beta$ and liquid volume, $V$. Willett, $et$~$al$~\\cite{Willett00} reports a closed-form expression for calculating capillary forces between equal spheres, while Scheel $et$~$al$~\\cite{Scheel08} reports an equation for calculating the Laplace pressure in a capillary bridge assuming toroidal shapes as a function of $\\beta$. In both expressions, the calculation of $\\beta$ as function of volume requires a non-zero value for half-separation distance, $s$. However, in our case we have considered $s=0$ since the spheres are in complete contact. We therefore analyze the images obtained from Surface Evolver to obtain a direct relationship between the bridge angle, $\\beta$, and meniscus volume. We interpolate points and obtain a polynomial fit of this analysis, which is shown in the inset in Fig. 6b. Now that we have obtained the curves for $P=f(V)$ and $\\beta=f(V)$, we can obtain the curve for $P=f(\\alpha)$, where $\\beta = \\alpha/2$. This curve is shown in Fig. 6b. \n\nTo calculate the pressure in the percolating front, $P_{inf}$, we also use Surface Evolver~\\cite{Carter96, Brakke10, Berthier12}, but this time we simulate the meniscus shape between $three$ adjacent beads using a code written by Carter~\\cite{Carter96}. Apart from liquid volume, we add an additional constraint in the simulation, which is the separation distance between two spheres defined by a packing angle. We similarly calculate the pressure value from $P_{sim} = dE/dV_{sim}$. In this simulation, the middle sphere remains fixed while two spheres are gradually separated as defined by the packing angle $\\alpha$. Simulation values for both pressure and volume are normalized using $P= P_{sim}\\sigma$cos$\\theta/R$ and $V = V_{sim}R^3$, respectively, where $R$ is the radius of the bead. We vary the liquid volume and packing angle and the results are in Fig. 6c, showing the relationship between pressure and packing angle, $P=f(\\alpha)$ for different values of $V_{sim}$. The images in Fig. 6d show examples of Surface Evolver minimization for meniscus in 3 beads. \n\n\n\\begin{figure}\n\\centerline{\\includegraphics[width=3.6in]{Fig6}}\n\\caption{(\\textbf{a}) Graph of $\\Delta P_{sup}$ as a function of meniscus volume, $V$, between two spheres. Inset figures show examples of Surface Evolver simulation as function of increasing volume. (\\textbf{b}) Graph of $\\Delta P_{sup}$ as a function of packing angle, $\\alpha$. The inset figure is $\\beta=f(V)$ also calculated from Surface Evolver. Additional points were interpolated and a polynomial ft was obtained as shown by the solid lines. (\\textbf{c}) Graphs of $\\Delta P_{inf}$ calculated from Surface Evolver as a function of $\\alpha$. Each curve is calculated at a certain $V_{sim}$, while the solid lines are  fits with interpolated points. (\\textbf{d}) Surface Evolver simulation images of meniscus volume between three spheres. Each image corresponds to a point in the red curve ($V_{sim} = 1.0$) in Fig. 6c. }\n \\label{Fig6}\n\\end{figure}\n\nEach curve in Fig. 6c is shown at constant meniscus volume. Hence, in Fig. 6c, the higher curves on the graph show larger meniscus volume. We obtain no numerical solution for $\\alpha > 120^{\\circ}$. We use a polynomial fit to interpolate the simulation points and demonstrate the dependence of the pressure difference with packing angle inside the percolating front. \n\nIn both the evaporating front $P_{sup}$ and the percolating front $P_{inf}$, the pressure is calculated as the difference between the surrounding air and the pressure in the liquid. Once the values of $P_{inf}$ and $P_{sup}$ have been determined, we use Eq. 2 to calculate the values of height $h$ of the PSZ as a function of packing angle, $h = f(\\alpha)$.\n\nAs the volume in the meniscus that joins three spheres in the percolation front is unknown, we use it as a fitting parameter. We find that the best fit is achieved for $V_{sim} = 0.5$. In applying Eq. 2, we find numerically that above a certain packing angle ($\\sim 70^{\\circ}$), the pressure in the evaporating front gets larger than the pressure in the percolating front, $P_{sup} > P_{inf}$, and thus $h < 0$. A negative value for $h$ is physically impossible and is interpretated as a condition when the liquid film network is not stable anymore and thus cannot exist continuously. Therefore above a critical angle, when the model predicts a negative $h$ value, all values of $h$ are instead represented as $h=0$. This ``critical\" angle was also observed  in our experiments, where no PSZ is formed and only the diffusive regime appears. The model is compared to our experimental results, as presented in Fig. 7, and shows an excellent agreement. \n\n\n\n\n\\begin{figure}\n\\centerline{\\includegraphics[width=2.5in]{Fig7}}\n\\caption{The experimental values ($\\bigcirc$) obtained for $h$ plotted as a function of $\\alpha$, and fitted with Eq. $2$ considering that $\\beta = \\alpha/2$. The sharp transition of the curve shows that stable connections are quickly broken once the granular column is loosened. }\n \\label{Fig7}\n\\end{figure}\n\n\n\n\n\\section{Conclusion}\n\nWe studied how granular packing affects liquid film stability in capillary networks by using spherical particles inside circular capillary tubes to demonstrate a simple granular system with varying packing arrangements from loose-packed to close-packed. We compared our experimental results with simulation performed using Surface Evolver. Using simple geometrical argument, we were able to calculate the pressure in the evaporation and percolation fronts and extract the height of the PSZ from these values. Close-packed systems have more stable liquid film connections; thus, evaporation rates are faster.  At a certain packing threshold, liquid connections are broken and thus loose-packed systems have less stable liquid films that easily break and have slower evaporation rates (via diffusion). \n\nThe manner in which the particles are arranged in 3D bulk systems clearly affects packing compactness and liquid distribution. Less liquid will be found in densely and closely-packed areas where evaporation is favored while, in contrast, loosely-packed areas will hold greater liquid content for longer periods. Results also raise interesting questions on the role of polydispersity on packing compactness especially when smaller particles fill the pore spaces made by surrounding larger ones. Such configurations create smaller pores, whose liquid films have smaller curvatures and high pressures. This drives greater capillary flow for rapid transport of water. Such results would help contribute to the better comprehension of the complex nature of multiphase fluid flow in 3D bulk systems. \n\n\n\n\n\n\n\\begin{acknowledgments}\nWe thank the support of Solvay COMPASS (UMI 3254) laboratory and CNRS in collaboration with UPenn. We also thank Jennifer Reiser, Marine Truchet, Prof. Doug Durian (UPenn), Prof. W. Craig Carter (MIT), and Prof. Kenneth Brakke (Susquehanna University) for discussions on Surface Evolver. Finally, we thank Alban Sauret for helpful comments on the manuscript revision.\n\\end{acknowledgments}\n\n\\bibliography{References}\n\n\n\n", "itemtype": "equation", "pos": 18113, "prevtext": "\n\nAs shown in Fig. $1$d, $\\phi_A$ values agree with the theoretical porosity curve, $\\phi_T$ (solid line). This confirms that the beads are positioned almost perfectly inside the tube to achieve a certain packing configuration.\n\nAll evaporation experiments are carried out in a controlled environment chamber (Electro-Tech Systems â\u0080\u0093 Model $5100$, PA, USA) where relative humidity ($20.0 \\pm 2.0\\%$) and temperature ($32 \\pm 2^{\\circ}$C) are kept constant. Images of the receding front are taken over time using a Canon $500$D SLR camera with $18-55$~mm lens with a resolution of 35 $\\mu$m per pixel. \n\n\\begin{figure}\n\\centerline{\\includegraphics[width=3.5in]{Fig1}}\n\\caption{Illustrations of the ``single-column\" porous media configurations of circular tubes filled with glass spheres of packing angle, $\\alpha$. (\\textbf{a}) Straight configuration with $\\alpha = 180^{\\circ}$. (\\textbf{b}) Loose packing configuration with $60^{\\circ} < \\alpha < 180^{\\circ}$. (\\textbf{c}) Close-packed configuration with $\\alpha \\sim 60^{\\circ}$. (\\textbf{d}) Graph of the experimental porosities as a function of the average measured packing angle. The theoretical porosity curve, Eq. 1, is also plotted versus the experimental porosity. The horizontal error bars are the standard deviations of the average packing angle value measured between all the beads in the tube. The vertical error bars come from the calculation of the experimental porosity, which includes uncertainties for the actual tube diameter and the actual radius of the spheres.  The inset shows a geometrical representation of adjacent spheres from which the theoretical porosity can be derived using trigonometry.  }\n \\label{Fig1}\n\\end{figure}\n\n\n\n\n\\section{Background}\n\nDrying of wet granular media has been widely studied in recent years. In a granular medium, the main phenomena taking place are illustrated in Fig. $2$a. Drying is widely considered as an invasion percolation process (IP)~\\cite{Shaw87, Prat02}. It is a modified form of percolation, described by displacement of two immiscible fluids~\\cite{Prat99}. Studies~\\cite{Coussot00, Lehmann08, Shokri08, Yiotis12b, Yiotis12a, Prat02, Prat07, Chauvet09, Chauvet10} have shown distinct regimes associated with transport mechanisms that affect evaporation flux behavior in porous media. Water evaporation from porous media such as soil generally has two regimes and an abrupt transition from capillary-supported high and nearly constant rates (regime $1$) to diffusion-controlled lower evaporation rates (regime $2$)~\\cite{Coussot00, Chauvet09, Prat07, Yiotis12a, Yiotis12b, Lehmann08}. During regime 1, the loss of water in the medium leads to liquid-gas interfaces that exhibit high capillary pressures, which permit liquid from the bulk to flow towards the evaporating surface located at the top of the tube. The films form the Partially Saturated Zone (PSZ). The interface between the lower fully wet region and the PSZ is called the percolating front. Its position is denoted as $z_{inf}$. This continuous hydraulic capillary network links the percolating front and the evaporating surface and liquid transport through this network helps sustain evaporation rates~\\cite{Coussot00}. The mechanism taking place during regime 1 is illustrated in Fig. $2$a (left). As long as the liquid films are attached to the upper surface, evaporation rates remain high and the percolating front continues to recede inside the medium. The position of the percolating front, $z_{inf}$, scales linearly with time, $t$, during regime 1~\\cite{Lehmann08, Shokri08, Yiotis12b, Prat02, Coussot00}. After the PSZ reaches a certain characteristic length, which depends on contact angle~\\cite{Chraibi09, Shokri09} or pore shape~\\cite{Prat07, Yiotis12b, Chauvet09}, the capillary connections are broken and thus liquid films detach from the evaporating surface and an evaporating front, $z_{sup}$ starts to form as shown in Fig. $2$a (right). This marks the onset of regime $2$ of evaporation. As the evaporating front also recedes inside the medium, a dry region separates the evaporating front and the surface of the tube. During regime 2, evaporation rates slow down and $z_{inf}$ scales as $\\sqrt{t}$ because gaseous water now diffuses across the dry region to the  surface of the tube~\\cite{Camassel05, Chauvet09, Yiotis12b}. \n\n\n\\section{Results and Discussion}\n\\subsection{Experimental Results}\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3in]{Fig2}\n\\caption{(\\textbf{a}) Schematic of the two evaporation regimes in the single-column porous medium, where $z_{inf}$ is the position of the percolating front, $z_{sup}$ is the position of the evaporating front, and $h$ is the characteristic length of the Partially Saturated Zone (PSZ). In regime 1, we observe fully wet and PSZ; while in regime 2, we observe three zones due to the dry zone below the surface. (\\textbf{b}) Experimental images showing time evolution of Partially Saturated Zone (PSZ) for three different packing configurations: straight, loose, and close-packed. The PSZ for each configuration is indicated by the arrows.}\n\\label{Fig2}\n\\end{figure}\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3.4in]{Fig3}\n\\caption{(\\textbf{a}) Plot of the position of the percolating front, $z_{inf}$, as function of time $t$ and packing angle configuration, $\\alpha$. Each color corresponds to a packing angle in Table 1. For close configurations (1-3), a linear first regime is observed followed by an abrupt transition to the second regime. For loose configurations (4-8), the curves scale as $z \\propto \\sqrt{t}$, similar to the solid line, which represents evaporation from an empty circular capillary tube for reference. (\\textbf{b}) Extent of $h$ plotted as a function of $t$. For close configurations (1-3), a maximum is reached before stabilizing at a constant value. For loose configurations (4-8), the thickness fluctuates suggesting its instability. And for straight configurations (9), it is nearly inexistent. }\n\\label{Fig3}\n\\end{figure}\n\nLiquid inside the tubes are left for evaporation. Typical evaporation patterns can be seen in Fig. 2b, which shows different images at various stages of evaporation. We can see different behaviors depending on the packing configuration. For straight configuration or high packing angle, there is no formation of PSZ (Fig. 2b, left). This behavior is observed until the packing angle is decreased down to  $ \\alpha \\sim 100^{\\circ}$ (Fig. 2b, middle), where films subsist in the PSZ. When the packing angle is again further decreased to a close-packed configuration, a large PSZ appears: the evaporation behavior is now completely analogous to that of a 2D packing. To quantify the differences in evaporation behavior for each packing configuration, we measure the position of the percolating front with time as shown in Fig. 3a. The curves in the figure are numbered according to configuration encoded on the legend bar, whose corresponding packing angle values are shown in Table 1. \n\nFig. 3a also shows a strong difference in the behavior of the front when the packing angle, $\\alpha$, is increased from close-packed configurations to loose configurations. Close-packed configurations (1-3) clearly show a fast-developing first regime prior to an abrupt transition towards the slow second regime of evaporation. For loose configurations (4-9), the position of the percolating increases at a very slow rate. There is no observable first regime. The time-evolution of the front position suggests a purely diffusive regime with time scaling as $\\sqrt{t}$~\\cite{Camassel05, Bird02} (solid line). This same observation is inferred by looking at the extents of the height of the PSZ, $h$, as a function of time, in Fig. $3$b. For loose and straight configurations (4-9), the PSZ seems unstable and $h$ heavily fluctuates around 1 or 2 bead diameters (0.1-0.2~cm). The upper front of the PSZ disconnects immediately from the evaporating surface. This observation confirms the fact that there is no regime 1 for loose and straight configurations, but the system is instantly dominated by the slow regime $2$ of diffusion. Measurements of $h$ for close configuration clearly show two distinct regimes in Fig. 3b (1-3). For close configurations, $h$ reaches a maximum value before stabilization at a quasi-constant value. To summarize, these experiments show that evaporation of a single tube of spheres in a predefined controlled arrangement exhibit the same characteristic as the evaporation of a 2D system. However, the arrangement of the glass bead controls the extent of the PSZ. Above a certain configuration angle, the PSZ cannot form, the evaporation pattern is analogous to that of almost perfectly circular tube (solid black line in Fig. 3a). \n\n\nThe process is modelled and described schematically in Fig. 4. The initial configuration is depicted in Fig. 4a, where a fully saturated tube with beads is shown. As water evaporates, the volume decreases (Fig. 4b).  Air continues to penetrate inside the medium and the menisci form between spherical beads 1, 2, and 3 in Fig. 4c. ``I\" and ``II\" are the menisci between beads 1 and 2 and beads 2 and 3 respectively. At the beginning of the process, menisci ``I\" and ``II\" are linked, water from one meniscus can flow into the other. As the process goes on, Fig. 4c, more menisci develop along the tortuous packing and a column of water forms the PSZ. At the top of the column, however, volume of the meniscus ``I\" gets smaller and smaller until it reaches a volume where the connection between ``I\" and ``II\" break (Fig. 4d). After prolonged periods, this connection is completely disconnected (Fig. 4e). This description helps understand why close-packings allow for larger PSZ heights. Indeed as packing gets closer, menisci of higher curvatures are formed that still ensure hydraulic connectivity with the menisci formed below in the PSZ. Higher curvatures induce higher pressure drops along the columns and therefore lead to larger PSZ~\\cite{Scheel08}.\n\n\n\n\n\n\\subsection{Model Definition of the Extent of the Liquid Film Region}\n\n\nFor a certain height $h$, the difference in pressure along the interfaces of the menisci in the percolating and evaporating fronts of the liquid film region is in equilibrium with the hydrostatic pressure~\\cite{Princen69, deGennes10}. Liquid flow upward towards the tube top is driven by a competition between capillary, viscous, and gravity forces. The Bond number, $B_o = \\frac{\\rho g R^{2}}{\\sigma}$, where $R$ is the bead radius and $\\sigma$ is the surface tension of water, gives $B_o \\sim 10^{-3}$. Thus, capillary forces dominate over gravity. The capillary number is defined as, $C_a = \\frac{\\eta \\nu}{\\sigma}$, where $\\eta$ is the dynamic viscosity and $\\nu$ is the characteristic liquid velocity determined experimentally from the curves of $h = f(t)$. We calculate $C_a \\sim 10^{-9}$. Thus, capillary forces dominate over viscous forces. Thus, for this particular simplified set-up of a granular column of beads inside a circular tube, viscous effects are ignored. In addition, surface tension gradients are also neglected because temperature inside the controlled environment chamber is constant. \n\nThe height, $h$ of the PSZ is then written as:\n\n\n", "index": 3, "text": "\\begin{equation}\n   h = \\frac{P_{inf} - P_{sup}}{\\rho g},\n\\label{Eq2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"h=\\frac{P_{inf}-P_{sup}}{\\rho g},\" display=\"block\"><mrow><mrow><mi>h</mi><mo>=</mo><mfrac><mrow><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>-</mo><msub><mi>P</mi><mrow><mi>s</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mrow><mrow><mi>ρ</mi><mo>⁢</mo><mi>g</mi></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]