[{"file": "1601.05013.tex", "nexttext": "\nThis interaction is the nearest-neighbor version of the interaction that commonly leads to instantaneous spectral diffusion in rare earth crystals \\cite{liu87,liu90laser}. We previously measured these nearest neighbor interactions to be on the order of 40~MHz in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} \\cite{ahlefeldt13precision}, larger than the inhomogeneous linewidth. The second interaction is an off-diagonal interaction, of the form\n\n", "itemtype": "equation", "pos": 21305, "prevtext": "\n\n\\title{Ultra-narrow optical inhomogeneous linewidth in a stoichiometric rare earth crystal}\n\n\\author{R. L. Ahlefeldt}\n\\affiliation{Department of Physics, Montana State University, Bozeman, MT 59717, USA}\n\\affiliation{Laser Physics Centre, Research School of Physics and Engineering, The Australian National University, Canberra 0200, Australia}\n\\author{M. R. Hush}\n\\affiliation{School of Engineering and Information Technology,\nUniversity of New South Wales at the Australian Defence Force Academy, Canberra 2600, Australia}\n\\author{M. J. Sellars}\n\\affiliation{Centre for Quantum Computation and Communication Technology, Research School of Physics and Engineering, The Australian National University, Canberra 0200, Australia}\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe have measured a low optical inhomogeneous linewidth of 25 MHz in the stoichiometric rare earth crystal {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} by isotopically purifying the crystal in {\\ensuremath{{^{{35}}}}}Cl. The hyperfine levels of {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} are  spectrally resolved and retain their long coherence times, allowing the whole population of  {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} ions to be prepared in the same hyperfine state using hole burning techniques. Combined with this ability, the crystal has two useful properties for quantum information applications. First, a high optical density, which can be exploited to produce highly efficient Raman-type quantum memories. Second, due to the close ion spacing, large excitation induced ion-ion frequency shifts similar to those seen in cold atom lattice Rydberg systems. These interactions can lead to quantum many-body states that could be observed using standard optical spectroscopy techniques.\n\\end{abstract}\n\n\\pacs{03.67.Hk, 32.70.Jz, 78.40.Ha,Â 61.72.S-}\n\n\n\n\n\n\n\\maketitle\nThe hyperfine levels of rare earth ions have exceptionally long coherence times, as much as 6 hours in {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace} \\cite{zhong15}. Additionally, these hyperfine levels are addressable through an intermediary optical level, allowing high fidelity spin storage and readout using optical pulses \\cite{jobez15,gundogan15}. Because of these properties, doped rare earth crystals have received considerable attention for quantum memory applications \\cite{gundogan15, jobez15, hedges10, dajczgewand14, saglamyurek15}.\n\nThe efficiency of quantum memories can benefit from more optically dense crystals. Simply increasing the dopant concentration typically does not work, because this leads to more disorder in the crystal and therefore more optical inhomogeneous broadening, decreasing the normalized spectral density \\cite{konz03}. To avoid this trade-off between spectral and spatial density, we suggest the use of stoichiometric rare earth ion crystals with narrow inhomogeneous linewidths to create highly efficient quantum memories. Not only do these have higher optical densities, if the linewidth is lower than the hyperfine splitting it should be possible to enact quantum memories without employing spectral hole-burning, allowing the full ensemble of ions to be utilized, permitting larger memory bandwidths.\n\nStoichiometric rare earth ions also form a novel and flexible platform to investigate many body quantum physics. The physical proximity of the ions in the crystal lattice can result in very strong inter-ion interactions. A broad range of interactions between nearest-neighbor rare-earth ions  has been previously observed on the optical transition: from purely dipole \\cite{uitert67,shionoya76, hegarty828, uitert71} to electric multipole \\cite{goldner97, uitert67, nakazawa67, uitert71, birgeneau69} to exchange \\cite{uitert66, blasse67, vial82, birgeneau68}, with many materials showing a mixture of multipole and exchange. Interactions can be mostly diagonal (static) \\cite{ahlefeldt13precision, lukac89}, or mostly off-diagonal (energy transfer) \\cite{serrano14, birgeneau69, uitert67, nakazawa67, uitert71, birgeneau68, blasse67}. By careful selection of the rare earth element and the crystal structure, customized, strongly interacting lattices of ions could be created. The resultant many body dynamics in these systems can be interrogated using flexible and efficient optical techniques.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA baseline requirement to observe many body effects optically is that the optical inhomogeneous broadening must be smaller than the interaction strength between neighboring ions. This means that, as for quantum memories, very low crystalline disorder is a crucial requirement for many body investigations.\n\nVery low levels of disorder have been achieved in doped rare earth crystals. The most well-known example is YLiF$_4$ \\cite{agladze91,macfarlane92,chukalina00}. When isotopically purified in $^7$Li to remove broadening caused by isotopic disorder, this material has optical inhomogeneous linewidths as low as 16~MHz for Er{\\ensuremath{^{3+}}\\xspace} \\cite{thiel11rare} and 10~MHz for Nd{\\ensuremath{^{3+}}\\xspace} \\cite{macfarlane98}. To achieve such narrow lines, it was necessary to use extremely low rare earth dopant concentrations, around 3~ppm. So, while these crystals are low disorder, the optical density and the spatial density are too low for them to be useful for either quantum memory or many-body applications.\n\nIn this paper, we show that the situation is very different for stoichiometric materials: reducing disorder via isotopic purification increases the spectral density while maintaining the high spatial density, resulting in a material with a small inhomogeneous linewidth and very high optical density. We demonstrate that the linewidth reduction is sufficient in our chosen material that the hyperfine structure is resolved. Further, we suggest that this material can be tailored to be used either for high-efficiency quantum memories, or for observing many body effects such as excitation blockade.\n\nAs this paper concentrates on minimizing the disorder, we have chosen to use an Eu{\\ensuremath{^{3+}}\\xspace} material with fairly large inter-atomic distances, {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, to minimize the effects of ion-ion interactions on the optical spectrum. This material is a good starting point because it has a narrow linewidth of 100~MHz without isotopic purification \\cite{ahlefeldt09}, and good coherence times when deuterated \\cite{ahlefeldt13optical}. This makes it an excellent quantum memory candidate in its own right. It also has diagonal ion-ion interactions of the order of 40~MHz, sufficient that some quantum many body effects, particularly excitation blockade, should be observable.\n\n{EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} is a monoclinic crystal with  a single rare earth site of C$_2$ site symmetry \\cite{belskii65, kepert83}. The environment of an Eu{\\ensuremath{^{3+}}\\xspace} ion in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} is shown in Figure \\ref{figEucystal}. It has eight direct ligands -- six water molecules and two Cl ions at distances between 2.4 and 2.8 \\AA. Also shown are the first shell of Eu{\\ensuremath{^{3+}}\\xspace} neighbors.\n\\begin{figure}\n\\centering\n\\includegraphics[width = 0.4\\textwidth]{EuCl3structure}\n\\caption{\\label{fig:eucl3structure} The first shell of Eu{\\ensuremath{^{3+}}\\xspace} ions (gray) in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}. The C$_2$ symmetry axis is vertical. The Eu{\\ensuremath{^{3+}}\\xspace} ions are labeled by their distance from the central ion. Ligand ions Cl (green), O (blue) and H (red) are only shown for the central ion. Our previous measurements suggest that the static interaction between ions separated by 6.53~\\AA\\xspace along the C$_2$ axis is $>40$~MHz.   }\n\\label{figEucystal}\n\\end{figure}\n\nThe {\\ensuremath{^7}F\\ensuremath{_0\\rightarrow ^5}D\\ensuremath{_0}}\\xspace transition of {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} at 579.703~nm (vacuum) shows a highly structured line spread over 600 MHz, with each component line approximately 100 MHz wide. The structure of the line can be completely explained by a combination of the hyperfine structure of the two europium isotopes and shifts caused by different isotopes occupying the nearest neighbor ligand positions \\cite{ahlefeldt09}. These isotope shifts can be large, up to 2~GHz for Eu{\\ensuremath{^{3+}}\\xspace} ions neighboring D ions ({\\ensuremath{{^{{2}}}}}H), and we expect that isotopes occupying more distant sites contribute substantially to the inhomogeneous broadening.\n\nThe contribution of the different isotopes to the broadening can be estimated simply. It  depends on the concentration of that element in the crystal, the abundance of the isotope relative to the dominant isotope, and the perturbation to the lattice caused by substituting the isotope. This latter quantity depends on the relative mass difference of the isotope and the dominant isotope, thus D causes the largest perturbation and {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace} the smallest.\n\nWe have measured the inhomogeneous broadening rate due to D as 91 MHz/\\% concentration \\cite{ahlefeldt09}, suggesting that D is responsible for 1.4~MHz of the inhomogeneous broadening seen in natural abundance crystals. Assuming the broadening scales linearly with the relative mass difference, the concentration and the abundance, we expect that {\\ensuremath{{^{{17}}}}}O and {\\ensuremath{{^{{18}}}}}O contribute $\\approx 2$~MHz to the inhomogeneous broadening, {\\ensuremath{{^{{37}}}}}Cl $\\approx 60$~MHz, and {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace} $\\approx 10$~MHz. These numbers are approximate, but clearly indicate that {\\ensuremath{{^{{37}}}}}Cl is likely to be the major source of broadening in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, and that the best method for reducing the linewidth is to isotopically purify the crystal in {\\ensuremath{{^{{35}}}}}Cl.\n\nWe grew a crystal isotopically purified in {\\ensuremath{{^{{35}}}}}Cl from a water solution at just above room temperature. The starting material was 6 g of {Eu\\ensuremath{^{35}}Cl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} that had been prepared from Na{\\ensuremath{{^{{35}}}}}Cl and 99.999\\% {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}. The nominal isotopic purity was 99.67\\%. Sufficient water was added to saturate the solution at 30$^\\circ$C. A crystal was grown out of the solution over 1 week after lowering the temperature to 29$^\\circ$C. The growth rate during this time was not constant as the hotplate used for growth only has a temperature stability of $\\pm 1^\\circ$C. As we note below, this instability in the growth rate is the likely cause for the macroscopic variations in inhomogeneous linewidth.\n\n The excitation spectrum of the {\\ensuremath{^7}F\\ensuremath{_0\\rightarrow ^5}D\\ensuremath{_0}}\\xspace transition was measured with a Coherent 699-29 ring dye laser with the crystal at 4~K in a helium bath cryostat. Because {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} is hygroscopic, the crystal was mounted in a small helium-gas-filled chamber to avoid exposure to air or vacuum. The laser beam was orientated parallel to the C$_2$ axis to minimize absorption. Even along this direction, the absorption is high, and a confocal imaging system  was used to collect fluorescence only from the front face of the crystal. In this setup, achromatic 10~cm lenses were used for objective and imaging lenses, and the emission was focused onto the end of a 62.5~$\\mu$m multimode fiber serving as the pinhole.  \n \n The laser spot was scanned across the crystal to find a region with a narrow linewidth. In our studies of {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, we have seen that it often has macroscopic variations in the inhomogeneous linewidth due to large-scale defects in the crystal. Variations in the linewidth of 20~MHz over mm-sized areas of the crystals are common, and some regions have highly distorted lineshapes with linewidths broadened by up to 100~MHz. Broad regions are often associated with visible inclusions in the crystal, or with areas of surface damage where the crystal has deliquesced and re-crystallized due to exposure to air. Inclusions and growth defects are often caused by an unstable growth rate, suggesting that the macroscopic inhomogeneous broadening could be reduced by improving the temperature stability of the growth apparatus. \n\n Figure \\ref{fig:iso} shows the excitation spectrum of {Eu\\ensuremath{^{35}}Cl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}. There is a 200 MHz Eu{\\ensuremath{^{3+}}\\xspace} isotope shift in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, leading to two sets of peaks: around 0 MHz frequency offset are those due to {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace}, while at higher frequencies are those due to {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace}. These sets of peaks are split by the hyperfine interaction. For {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace}, which has hyperfine splittings approximately twice as large as {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace}, this hyperfine structure is well resolved. In Fig. \\ref{fig:iso}, we have labeled each peak for {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} with the transition that generates it.\n \n\\begin{figure}\n\\centering\n\\includegraphics{isospecnew}\n\\caption{\\label{fig:iso}  Excitation spectrum of the {\\ensuremath{^7}F\\ensuremath{_0\\rightarrow ^5}D\\ensuremath{_0}}\\xspace transition in isotopically pure {Eu\\ensuremath{^{35}}Cl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}. The energy level structure of the $^7$F$_0$ ground and $^5$D$_0$ excited states for {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} is shown on the upper left, where the splittings are given in MHz. The positions of each transition between the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} ground and excited states are indicated by red lines on the spectrum. The weak transitions are bracketed. }\n \\end{figure}\n \n The inhomogeneous linewidth of each line in the spectrum is $25\\pm 5$~MHz. The instrumental broadening due to instability in the laser scan is less than 5~MHz. As described earlier, we expect that about 10~MHz of the remaining linewidth is due to {\\ensuremath{{^{{151}}}}}Eu{\\ensuremath{^{3+}}\\xspace}, with about 3~MHz due to the extra O and H isotopes. Therefore, isotopic purification of all the elements in the crystal can be expected to lead to a linewidth less than 10~MHz.\n \n \nAt 25~MHz, the inhomogeneous broadening has already reached an interesting limit: it is smaller than the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} hyperfine structure, as well as the static excitation-induced interactions between Eu{\\ensuremath{^{3+}}\\xspace} ions. This regime is very useful for certain quantum information applications. We will discuss two of these: Raman-type quantum memories, and quantum many-body dynamics. While current crystals could be used in these applications, it is beneficial to also isotopically purify the Eu{\\ensuremath{^{3+}}\\xspace}: as well as reducing the inhomogeneous broadening, this allows us to tailor the spatial density of {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} to the application. Low concentrations (1-10\\%) of {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} are most suitable for memories, while high concentrations are ideal for investigating many-body effects. \n\nRaman-type quantum memory protocols such as EIT \\cite{harris90, fleischhauer02}, DLCZ \\cite{duan01} and Raman echoes \\cite{moiseev13} typically use a $\\Lambda$ system of two ground states and an optical excited state which are coupled by off-resonant optical fields. There are three main requirements for optimal performance of these memories: low decoherence on the transition between the ground state levels \\cite{lvovsky09}, a very high optical depth on one optical transition, and zero excitation probability on the other (the second ground state must be empty).\n\nIn {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, a suitable $\\Lambda$ system can be made with two {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} hyperfine ground states and one optical excited state. To ensure a long hyperfine coherence time, a {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} concentration of $1-10$\\% is needed, as at high concentrations Eu{\\ensuremath{^{3+}}\\xspace} spin flip-flops will shorten the hyperfine lifetime and coherence time. The real advantage of this system over other materials in which Raman memories have been implemented is the optical depth: because the line is so narrow and the concentration high compared to gas systems or lightly-doped rare earth crystals, extremely high optical depths can be achieved. We have previously measured the oscillator strength of the {\\ensuremath{^7}F\\ensuremath{_0\\rightarrow ^5}D\\ensuremath{_0}}\\xspace transition to be $3\\times10^{-9}$, suggesting the optical density of a 10\\% {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} crystal with a 10 ~MHz linewidth is $\\approx 700$~cm$^{-1}$. This already high optical depth can be tripled by taking advantage of the resolution of the hyperfine structure, which makes it possible to optically pump nearly all the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} ions in the crystal into a single hyperfine state. This has the additional advantage that it creates the required second empty state for the memory.\n \nTo illustrate the optical depth that can be reached, consider a crystal with a 10~MHz linewidth, such as could be achieved by reducing the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} concentration to 10\\%. The combination of an optical field repeatedly swept over the $g_2\\rightarrow e_3$ and $g_1\\rightarrow e_3$ transitions and an rf field resonant with the $g_1 \\rightarrow g_2$ transition could pump over 95\\% of all the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} ions in the crystal into the $g_3$ level, as shown in Figure \\ref{fig:iso}. On resonance with the $g_3\\rightarrow e_3$ transition, the optical pumping is even more effective: over 99.7\\% of the atoms at that frequency reside in the $g_3$ level. The most suitable empty level for the Raman memory is $g_1$, which has less than 0.1\\% population at this frequency. The result is an excellent $\\Lambda$ system with an optical depth in excess of 2000~cm$^{-1}$.\n\nThe main reason for using crystals with low concentrations of {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} for Raman-type memories is to avoid interactions between the Eu{\\ensuremath{^{3+}}\\xspace} ions. However, it is also interesting to consider the opposite regime - materials fully concentrated in {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace}, for which interactions between the ions start to become important. Exactly like the low concentration crystals described above, a crystal fully concentrated in {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} will have less isotopic disorder and therefore a lower inhomogeneous linewidth than the materials we studied here -- again, on the order of 10~MHz. \n\n\\begin{figure}\n\\centering\n\\includegraphics{holeburn}\n\\caption{\\label{fig:holeburn}  Simulation of holeburning the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} population in a $< 10$ \\% {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace}:{Eu\\ensuremath{^{35}}Cl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} crystal into a single ground state, in this case $g_3$.  We assume an inhomogeneous linewidth of 10~MHz. The dashed line shows the simulated excitation spectrum for {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} before burning, while the solid line shows the result of the holeburning preparation.  A combination of an rf field tuned to the $g_1\\rightarrow g_2$ transition and an optical field swept over the $g_2\\rightarrow e_3$ and $g_1\\rightarrow e_3$ transitions (corresponding to the region from 320 to  500 MHz in the spectrum) is used to burn over 95\\% of the ions into the $g_3$ state. Most of the ions that remain in $g_1$ and $g_2$ are in the wings of the line. }\n\\end{figure}\n\nUsing hole burning techniques on the fully concentrated crystal, we can create a lattice of interacting Eu{\\ensuremath{^{3+}}\\xspace} ions, the ideal platform for investigating many-body quantum phenomena. The interactions that dominate in this material will determine what many-body states can be observed.\n\n\nWe are interested in interactions on the optical transition between the $^7$F$_0$ ground state and the $^5$D$_0$ electronic excited state. We assume the {\\ensuremath{{^{{153}}}}}Eu{\\ensuremath{^{3+}}\\xspace} population has been prepared in the $g_3$ state using the holeburning method described above. Two Eu{\\ensuremath{^{3+}}\\xspace} ions separated by a distance $r$ can interact through a variety of complex mechanisms including direct electric multipole interactions or exchange, a wavefunction-overlap mechanism that is often mediated by intervening ligands (superexchange). Regardless of the mechanism, there are two qualitatively different parts of the interaction. The first is a diagonal interaction producing a static shift to the electronic levels\n\n", "index": 1, "text": "\\begin{equation}\nH_{\\rm sh}/h = V(r) |e_3, e_3 \\rangle \\langle e_3,e_3|\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H_{\\rm sh}/h=V(r)|e_{3},e_{3}\\rangle\\langle e_{3},e_{3}|\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>H</mi><mi>sh</mi></msub><mo>/</mo><mi>h</mi></mrow><mo>=</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>e</mi><mn>3</mn></msub><mo>,</mo><msub><mi>e</mi><mn>3</mn></msub></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>e</mi><mn>3</mn></msub><mo>,</mo><msub><mi>e</mi><mn>3</mn></msub></mrow><mo fence=\"true\" rspace=\"4.2pt\" stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05013.tex", "nexttext": "\n\nBecause this is off-diagonal, it will only be important when the two ions can be considered resonant: when the interaction strength is larger than the inhomogeneous broadening. We can estimate the size of the interaction by assuming it scales as dipole-dipole: $T(r) \\approx d_{\\rm trans}^2/ 2\\pi h \\epsilon_0 r^3$, where the transition dipole moment is $d_{\\rm trans} = 1.6 \\times 10^{-33}$ C.m \\cite{ahlefeldt13precision}. Then, the dipole interaction strength at the shortest Eu{\\ensuremath{^{3+}}\\xspace} inter-ion distance of 6~\\AA\\xspace is 0.1~MHz, two orders of magnitude smaller than the inhomogeneous linewidth. Therefore, this interaction will be negligible in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace}, and the static shift interaction will dominate the many body dynamics observed.\n\nAs the diagonal interaction dominates, the best analogue for {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} among cold atom systems is an optical lattice of Rydberg atoms \\cite{anderson11,viteau11}, and the many-body effects predicted for Rydberg systems should also be observable in our rare earth ion setting. Currently, the primary experimental signature used to verify the presence of Rydberg interactions is the blockade effect \\cite{dudin12,tong04}: exciting one atom in the system pushes nearby atoms out of resonance with the exciting field. Exploring the blockade effect in a rare earth ion context presents a unique challenge as the blockade region is likely to be nanometers in size, and thus sub-wavelength. This makes direct imaging of the excitation impractical and instead spectral methods must be used. \n\nThe blockade effect could be indirectly observed through the suppression of excitation \\cite{tong04} or EIT spectroscopy \\cite{pritchard10}. To directly determine the blockade region, a spectrally narrow sub-ensemble of ions can be excited, and then the shifts caused by this excitation can be observed in the optical spectrum \\cite{ahlefeldt13precision}. The geometry of the interaction strengths can be determined from the spectrum and used to infer the exact size of the blockade region. Lastly, although the size of the blockade region is likely to be well below the diffraction limit of light, sub-wavelength imaging is possible by using a spectro-spatial method \\cite{schiller92},  in which an electric or magnetic field gradient creates a large spatial variation in the optical transition frequency over a region much smaller than the diffraction limit. \n\nAfter verification and quantification of the blockade region, there are a variety of many-body states theoretically predicted to exist for Rydberg systems that could be investigated in rare earth crystals. For example, paramagnetic states with short range quantum correlations \\cite{lesanovsky11} and the so-called devil's staircase of crystalline phases \\cite{weimer10, pohl10, schachenmayer10, pupillo10}. More general many-body phenomena have also been predicted, but are yet to be confirmed, such as quantum critical behavior \\cite{weimer08}, fermionic transport \\cite{olmos09}, collective jumps \\cite{lee12} and non-equilibrium dynamical transitions \\cite{marcuzzi14}. \n\nIn conclusion, we have shown that {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} isotopically purified in {\\ensuremath{{^{{35}}}}}Cl has an optical inhomogeneous linewidth for the {\\ensuremath{^7}F\\ensuremath{_0\\rightarrow ^5}D\\ensuremath{_0}}\\xspace transition of Eu{\\ensuremath{^{3+}}\\xspace} of 25~MHz, the lowest of any stoichiometric rare earth crystal and one of the lowest inhomogeneous linewidths measured in any material. Isotopic purification of the other elements in the crystal, in particular Eu{\\ensuremath{^{3+}}\\xspace}, will further lower this linewidth. The linewidth is much smaller than the hyperfine splitting, suggesting this material would be a good system for Raman-type quantum memories. The splitting is also smaller than the excitation induced frequency shifts between nearest neighbors, suggesting many-body physics, analogous to those seen in Rydberg systems, can be observed.\n\n\\begin{acknowledgments}\nThis work was supported by the Australian Research Council Centre of Excellence for Quantum Computation and Communication Technology (Grant No. CE110001027). MRH acknowledges funding from an Australian Research Council (ARC) Discovery Project (project number DP140101779). MJS was supported by an Australian Research Council Future Fellowship (Grant No. FT110100919).\n\\end{acknowledgments}\n\n\n\\bibliography{paper_refs_isotopically}\n\n\n\n", "itemtype": "equation", "pos": 21843, "prevtext": "\nThis interaction is the nearest-neighbor version of the interaction that commonly leads to instantaneous spectral diffusion in rare earth crystals \\cite{liu87,liu90laser}. We previously measured these nearest neighbor interactions to be on the order of 40~MHz in {EuCl\\ensuremath{_3}.6H\\ensuremath{_2}O\\xspace} \\cite{ahlefeldt13precision}, larger than the inhomogeneous linewidth. The second interaction is an off-diagonal interaction, of the form\n\n", "index": 3, "text": "\\begin{equation}\nH_{\\rm ex}/h = T(r) |e_3, g_3 \\rangle \\langle g_3, e_3 | + T^*(r) |g_3, e_3 \\rangle \\langle e_3, g_3 |\\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"H_{\\rm ex}/h=T(r)|e_{3},g_{3}\\rangle\\langle g_{3},e_{3}|+T^{*}(r)|g_{3},e_{3}%&#10;\\rangle\\langle e_{3},g_{3}|\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>H</mi><mi>ex</mi></msub><mo>/</mo><mi>h</mi></mrow><mo>=</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>e</mi><mn>3</mn></msub><mo>,</mo><msub><mi>g</mi><mn>3</mn></msub></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>g</mi><mn>3</mn></msub><mo>,</mo><msub><mi>e</mi><mn>3</mn></msub></mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mo>+</mo><mrow><msup><mi>T</mi><mo>*</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>g</mi><mn>3</mn></msub><mo>,</mo><msub><mi>e</mi><mn>3</mn></msub></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>e</mi><mn>3</mn></msub><mo>,</mo><msub><mi>g</mi><mn>3</mn></msub></mrow><mo fence=\"true\" rspace=\"4.2pt\" stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]