[{"file": "1601.04488.tex", "nexttext": " \n\\noindent where $S_\\nu$ is the integrated 1.1 mm flux (Jy), \n$D$ is the distance (kpc), $R_t$ is the gas-to-dust mass ratio (assumed to be 100), \n$B_\\nu$ is the Planck function for a dust temperature $T_d$, \nand $\\kappa_\\nu$ is the dust absorption coefficient.  \nIn the calculation, we use $\\kappa_\\nu$ = 1.14\\,cm$^2$\\,g$^{-1}$ \\citep[e.g.][]{enoch08,bally10},  \n$D$ = 1.8 kpc, and $T_d$ = 20 K \n\\citep[an average temperature value estimated from NH$_{3}$ line data; see][for more details]{kirsanova14}. \nThe masses computed from the observed dust continuum data are listed in Table~\\ref{tab1}. \nThe total gas mass of the 15 clumps comes out to be $\\sim$1179 M$_{\\odot}$. \nThe clump masses vary between 7 M$_{\\odot}$ and 285 M$_{\\odot}$.   \nAll the clumps have masses below 100 M$_{\\odot}$ except three clumps.\nThese three clumps are associated with Central~E (clump IDs 6 and 9) and East~1 (clump ID 15) \nsubregions and have masses more than 200 M$_{\\odot}$ \n(see Table~\\ref{tab1}). In an earlier work of the S235 complex (excluding North and North-West subregions), \n\\citet{klein05} selected thirteen dust emission clumps in the JCMT SCUBA 850 $\\mu$m survey \n\\citep[beam size $\\sim$14$\\arcsec$; see Fig.~1 of IRAS 05377+3548 in][]{klein05}. \nThey estimated a mass range of clumps between 10 and 120 M$_{\\odot}$, using an average dust temperature of \n20 K, a gas-to-dust mass ratio of 150, and a distance of 1.8 kpc. \n\\citet{kirsanova14} also computed a mass range of dense gas in the clumps between 12 and \n250 M$_{\\odot}$ \\citep[see Table~6 in][]{kirsanova14}. Considering the clump masses estimated in the present work, \none can find a noticeable difference in the clump mass at the high end of the estimated range compared to \nthe previous works. At the low end of the range, the gas mass is almost same in the present calculations compared to the earlier \nworks. More extensive high sensitivity and high resolution observations at mm/sub-mm wavelengths would \nallow to further explore the clump mass at the high end of the estimated mass range.\n\nIn Figure~\\ref{fig3a}, we show the distribution of clump masses as a function of distance from the location of the O9.5V star. \nInterestingly, we notice that the clump masses increase as we move away from the location of the ionizing star. \nThis correlation is seen only for those clumps which are distributed near the edges of the sphere-like \nshell (e.g. Central~E, East~2, North, and North-West subregions).  \nThe implication of this correlation for the star formation process is discussed in Section~\\ref{sec:disc}. \n\nThe column densities of clumps can also be computed using the Bolocam data.\nThe column density per beam is given by \\citep[see][]{deharveng10}: \n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\title{A multi-wavelength study of star formation activity in the S235 complex}\n\\author{L.~K. Dewangan\\altaffilmark{1,3}, D.~K. Ojha\\altaffilmark{2}, A. Luna\\altaffilmark{1}, B.~G. Anandarao\\altaffilmark{3}, J.~P. Ninan\\altaffilmark{2}, K.~K. Mallick\\altaffilmark{2}, and Y.~D. Mayya\\altaffilmark{1}}\n\n\\email{lokeshd@prl.res.in}\n\n\\altaffiltext{1}{Instituto Nacional de Astrof\\'{\\i}ísica, \\'{O}ptica y Electr\\'{o}nica, Luis Enrique Erro \\# 1, Tonantzintla, Puebla, M\\'{e}xico C.P. 72840}\n\\altaffiltext{2}{Department of Astronomy and Astrophysics, Tata Institute of Fundamental Research, Homi Bhabha Road, Mumbai 400 005, India}\n\\altaffiltext{3}{Physical Research Laboratory, Navrangpura, Ahmedabad - 380 009, India}\n\n\n\\begin{abstract}\nWe have carried out an extensive multi-wavelength study to investigate the star formation process \nin the S235 complex. The S235 complex has a sphere-like shell appearance at wavelengths \nlonger than 2 $\\mu$m and harbors an O9.5V type star approximately at its center.\nNear-infrared extinction map traces eight subregions (having A$_{V}$ $>$ 8 mag), and \nfive of them appear to be distributed in an almost regularly spaced manner along the sphere-like shell surrounding the ionized emission. \nThis picture is also supported by the integrated $^{12}$CO and $^{13}$CO intensity maps and by \nBolocam 1.1 mm continuum emission. The position-velocity analysis of CO reveals \nan almost semi-ring like structure, suggesting an expanding H\\,{\\sc ii} region. \nWe find that the Bolocam clump masses increase as we move away from the location of the ionizing star.\nThis correlation is seen only for those clumps which are distributed near the edges of the shell. \nPhotometric analysis reveals 435 young stellar objects (YSOs), 59\\% of which are found in clusters. \nSix subregions (including five located near the edges of the shell) are very well correlated with the dust clumps, CO gas, and YSOs.\nThe average values of Mach numbers derived using NH$_{3}$ data \nfor three (East~1, East~2, and Central~E) out of these six subregions are 2.9, 2.3, and 2.9, indicating these subregions are supersonic. \nThe molecular outflows are detected in these three subregions, further confirming the on-going star formation activity.\nTogether, all these results are interpreted as observational evidence of positive feedback of a massive star. \n\n\\end{abstract}\n\\keywords{dust, extinction -- H\\,{\\sc ii} regions -- ISM: clouds -- ISM: individual objects (S235) -- stars: formation -- stars: pre-main sequence} \n\n\n\\section{Introduction}\n\\label{sec:intro} \n\nThe energetics of massive stars can strongly influence the surroundings \\citep{zinnecker07}. \nMassive stars can destroy star-forming clouds (i.e., negative feedback) and can also \ntrigger star formation (i.e., positive feedback), leading to the formation of a new generation \nof stars including young massive star(s) \\citep{deharveng10}. \nHowever, the feedback processes of massive stars are still poorly understood.\n\nThe extended star-forming region S235 is known to be a \npart of the giant molecular cloud G174+2.5 in the Perseus Spiral Arm \\citep[e.g.][]{heyer96} and contains two known sites ``S235 complex\" and ``S235AB region\" \n(see Figure~1 in \\citet{dewangan11} and also in \\citet{kirsanova14}). The present work is focused on ``S235 complex\" and does not include ``S235AB region\". Different values of the distance (1.36 kpc, 1.59 kpc, 1.8 kpc, 2.1 kpc, and 2.5 kpc) to the extended star-forming \nregion S235 are reported in the literature \\citep[e.g.][]{georgelin73,israel78,evans81a,brand93,burns15,foster15}. \nIn the present work, we have chosen a distance of 1.8 kpc following \\citet{evans81a}, which is an intermediate value of the published distance range. \nThe H\\,{\\sc ii} region associated with the S235 complex is predominantly ionized by a single massive star BD+35$^{o}$1201 \nof O9.5V type \\citep{georgelin73}. \nThe S235 complex has been studied using multiple datasets spanning near-infrared (NIR) to radio wavelengths. \nThe S235 complex is known as an active site of star formation, harboring young stellar clusters \n\\citep[e.g.,][]{kirsanova08,dewangan11,camargo11,chavarria14} associated with known star-forming subregions, \nnamely East~1, East~2, and Central \\citep[e.g.][]{kirsanova08}.  In our previous work on the S235 complex \nusing the {\\it Spitzer}-IRAC data \\citep[][hereafter Paper I]{dewangan11},  \nwe detected several young stellar objects (YSOs) including a High Mass Protostellar Object (HMPO) candidate \nas well as signatures of outflow activities. Using $^{13}$CO (1$-$0) line data, \\citet{kirsanova08} found three molecular gas components \n(i.e., $-18$ km s$^{-1}$ $< V_{lsr} < -15$ km s$^{-1}$ (red), $-21$ km s$^{-1}$ $< V_{lsr} < -18$ km s$^{-1}$ (central), \nand $-25$ km s$^{-1}$ $< V_{lsr} < -21$ km s$^{-1}$ (blue)) in the direction of the S235 complex. \nHowever, the complex is well traced in mainly two molecular gas components (central and blue). \nMore recently, \\citet{kirsanova14} derived physical parameters of dense gas (i.e., gas density and temperature) \nin subregions of the complex using ammonia (NH$_{3}$) line observations. \nHowever, the properties of dense gas are not explored with respect to the ionizing star location. \nPrevious studies indicated that the S235 H\\,{\\sc ii} region is interacting with its surrounding molecular cloud \nand the S235 complex has been cited as a possible site of triggered star formation \\citep{kirsanova08,kirsanova14,camargo11}.  \n\n{\\it Spitzer} images revealed that the complex has a sphere-like shell morphology and \nthe ionizing star is approximately located at its center (see Figure~\\ref{fig1a} given in Paper~I). \nIn addition to the observed interesting morphology, the complex is a relatively nearby star-forming site, making it a promising site to \nstudy the feedback of a massive star. \nIn spite of the numerous existing observations and interpretations, the feedback of an O9.5V type star \nis not systematically explored in the S235 complex. \nThe aim of the present work is to study the physical processes governing the interaction and feedback effect of a \nmassive star on its surroundings.\n\nIn order to address above aim, we revisited the S235 complex using high sensitivity United Kingdom Infra-Red Telescope (UKIRT) \nInfrared Deep Sky Survey (UKIDSS) NIR data, Giant Metre-wave Radio Telescope (GMRT) 610 MHz radio continuum map, and \ndust continuum 1.1 mm data, in conjunction with published narrow band H$_{2}$ map, \n{\\it Spitzer} mid-infrared (MIR) data, NH$_{3}$ line data, NRAO VLA Sky Survey (NVSS) 1.4 GHz continuum map, and CO line data.\nWe performed a detailed study of the distribution and kinematics of molecular gas in the complex. \nIn order to systematically explore the feedback of a massive star, we estimated various pressure components \n(such as pressure of an H\\,{\\sc ii} region, radiation pressure, stellar wind pressure, pressure exerted \nby the self-gravitating molecular cloud, and ratio of thermal to non-thermal gas pressure).  \nFor a detailed study of the embedded young population in the complex, we employed different color-color and color-magnitude \ndiagrams obtained using NIR and MIR data, as well as extinction map generated from NIR data, and the surface density analysis. \nAdditionally, the physical properties of gas derived using the line and continuum data were investigated. \n \nIn Section~\\ref{sec:obser}, we provide the description of various datasets \nalong with reduction procedures. In Section~\\ref{sec:data}, we summarize the results related to the \nphysical environment and point-like sources. \nThe possible star formation scenario is discussed in Section~\\ref{sec:disc}. \nOur main conclusions are summarized in Section~\\ref{sec:conc}.\n\n\\section{Data and analysis}\n\\label{sec:obser}\n\nMulti-wavelength data are employed to study the physical conditions in the S235 complex. \nThe size of the selected region is $\\sim$17$\\farcm$6  $\\times$ 15$\\farcm$5, \ncentered at $\\alpha_{2000}$ = 05$^{h}$40$^{m}$57.8$^{s}$,\n$\\delta_{2000}$ = +35$\\degr$51$\\arcmin$13$\\arcsec$, corresponding to a physical scale of about  9.2 pc  $\\times$ 8.1 pc \nat a distance of 1.8 kpc.\n\n\\subsection{Narrow-band H$_{2}$ image}\nNarrow-band H$_{2}$ ($\\nu$ = $1-0$ S(1) at $\\lambda$ = 2.122 $\\mu$m ($\\Delta \\lambda =0.032\\, \\mu \\rm m$)) imaging \ndata of the S235 complex were obtained from \nthe survey of extended H$_{2}$ emission \\citep{navarete15}, conducted at the Canada-France-Hawaii Telescope (CFHT), \nMauna Kea, Hawaii, using Wide-field InfraRed Camera (WIRCam). The observations were performed with the average seeing of $\\sim$0$\\farcs$7. \nThe survey also provided K-band continuum ($\\lambda$ = 2.218 $\\mu$m; $\\Delta \\lambda =0.033\\, \\mu \\rm m$) images, \nwhich were used to get the final continuum-subtracted H$_{2}$ map. \nNote that the H$_{2}$ image published by \\citet{navarete15} contains only the East~2 and Central star-forming subregions \\citep[see source IDs 164 and 165 in Table B2 given in][]{navarete15}, \nwhile the H$_{2}$ image in this work is presented for a larger area $\\sim$10$\\farcm$7 $\\times$ 9$\\farcm$9 toward the complex. \nOne can find more details about the survey in the work of \\citet{navarete15}. \n\n\\subsection{Near-infrared data}\n\nWe obtained deep NIR photometric {\\it JHK} images and the magnitudes of point sources in the region ($\\sim$17$\\farcm$6  $\\times$ 15$\\farcm$5) from \nthe UKIDSS 6$^{th}$ archival data release (UKIDSSDR6plus) of the Galactic Plane \nSurvey \\citep[GPS;][]{lawrence07}. The survey uses the UKIRT Wide Field Camera \n\\citep[WFCAM;][]{casali07}. \nFollowing the selection conditions given in \\citet{lucas08},  \nwe retrieved only reliable NIR sources in the region. \nOne can also find more details about the selection procedure of the GPS photometry in the work of \\citet{dewangan15b}.\nTwo Micron All Sky Survey \\citep[2MASS;][]{skrutskie06} data were obtained for bright sources that were saturated in the GPS catalog. \n\nWe found 2444 sources detected in all the three NIR ({\\it JHK}) bands. \nAdditionally, 326 sources were selected having detections only in the H and K bands.\n\n\n\\subsection{{\\it Spitzer} data}\n\nThe photometric images (3.6--24 $\\mu$m) of the S235 complex were obtained from the {\\it Spitzer} Space Telescope \nInfrared Array Camera \\citep[IRAC;][]{fazio04} and the \nMultiband Imaging Photometer \\citep[MIPS;][]{rieke04}. \nThe final processed IRAC images (3.6--8.0 $\\mu$m) and photometry of point sources were taken from Paper I. \nMIPS 24 $\\mu$m observations were retrieved from the {\\it Spitzer} public \narchive\\footnote[1]{see http://sha.ipac.caltech.edu/applications/Spitzer/SHA/}, \nwhich were carried out in MIPS scan mode on 15 April 2008 (Program id 40005; PI: Giovanni Fazio).\nMIPS mosaic at 24 $\\mu$m was generated using the Basic Calibrated Data (BCD) images.\n\n\\subsection{Dust continuum 1.1 mm data}\nBolocam 1.1 mm image \\citep{aguirre11} and Bolocam source catalog at 1.1 mm \\citep[v2.1;][]{ginsburg13} were \nobtained from Bolocam Galactic Plane Survey (BGPS). \nThe effective full width at half maximum (FWHM) of the 1.1 mm map is $\\sim$33$\\arcsec$. \n\n\\subsection{Radio continuum data}\n\nWe used the archival radio continuum data at 610 MHz (50 cm) and 1.4 GHz (21 cm).\nThe 1.4 GHz map was retrieved from the NVSS archive. \nThe beam size of the NVSS image is $\\sim$45$\\arcsec$ \\citep{condon98}.\nThe  610 MHz continuum data were observed on 18--19 June 2005 (Project Code: 08SKG01) \nand were retrieved from the GMRT archive. \nGMRT radio data reduction was carried out using AIPS software, in a manner similar to that described in \\citet{mallick13}. \nSince the S235 complex was away from the center of the observed field, \nthe primary beam correction for 610 MHz was also carried out, using the AIPS PBCOR task and parameters \nfrom the GMRT manual\\footnote[2]{http://gmrt.ncra.tifr.res.in/gmrt\\_hpage/Users/doc/obs\\_manual.pdf}. \nThe synthesized beam size of the final 610 MHz map is $\\sim$48$\\arcsec$ $\\times$ 44\\farcs2. \n\n\\subsection{Molecular CO line data}\nThe J=1$-$0 lines of $^{12}$CO and $^{13}$CO data were observed from the Five College Radio Astronomy \nObservatory (FCRAO) 14 meter telescope in New Salem, Massachusetts. \nThe FCRAO beam sizes were 45$\\arcsec$ and 46$\\arcsec$ for $^{12}$CO and $^{13}$CO, respectively. \nThe S235 complex was observed as part of the Extended Outer Galaxy Survey \\citep[E-OGS,][]{brunt04}, \nthat extends the coverage of the FCRAO Outer Galaxy Survey \\citep[OGS,][]{heyer98} to Galactic longitude $l$ = 193$\\degr$, \nover a latitude range of $-$3$\\degr$.5 $\\leq$ $b$ $\\leq$ +5$\\degr$.5. \nHowever, the data cubes of S235 complex were further re-processed and a document describing the re-processing \ndata methods is given in \\citet{brunt04} (also Brunt C.M. et al.; in preparation).\nThese CO data cubes were obtained from M. Heyer and C. Brunt (through private communication). \n\n\\subsection{Other Data}\nWe utilized the publicly available archival WISE\\footnote[3]{Wide Field Infrared Survey Explorer, which is a joint project of the\nUniversity of California and the JPL, Caltech, funded by the NASA} \\citep{wright10} image at 12 $\\mu$m (spatial resolution $\\sim6\\arcsec$). \nWe also used previously published NH$_{3}$ line data from \\citet{kirsanova14}. \n\n\\section{Results}\n\\label{sec:data}\n\n\\subsection{Mid-infrared and radio continuum images}\n\\label{subsec:mir}\nThe most prominent feature of the S235 complex observable in the infrared regime, the sphere-like \nshell morphology, is detected at wavelengths longer than 2 $\\mu$m (see Figure~\\ref{fig1a}). \nFigure~\\ref{fig1a}a is a three-color composite image made using MIPS 24 $\\mu$m in red, WISE 12.0 $\\mu$m in green, \nand IRAC 8.0 $\\mu$m in blue. Figure~\\ref{fig1a}b shows a three-color composite image using \nMIPS 24 $\\mu$m (red), IRAC 4.5 $\\mu$m (green), and UKIDSS 2.2 $\\mu$m (blue). \nRadio continuum contours at 1.4 GHz and 610 MHz are also overlaid on the color-composite images in Figures~\\ref{fig1a}a and~\\ref{fig1a}b, respectively.\nThese radio continuum contours trace the ionized emission in the S235 complex. \nThe distribution of ionized emission is almost spherical in both the radio maps.\nThe location of a previously characterized O9.5V star (BD +35$^{o}$1201) appears at the peak of radio continuum emission. \nThe bulk of the ionized emission, as traced at the sensitivity levels shown in the Figures~\\ref{fig1a}a and~\\ref{fig1a}b, is well located inside \nthe sphere-like shell, as highlighted by a circle in Figure~\\ref{fig1a}a. \nThe radio emission at 610 MHz appears elongated in north direction, as highlighted by an \narrow (see Figure~\\ref{fig1a}b). This particular feature does not appear to be seen in the  NVSS 1.4 GHz map. \nThe WISE 12 $\\mu$m band is dominated by the 11.3 $\\mu$m polycyclic aromatic hydrocarbon (PAH) emission  \nas well as the warm dust continuum emission. The 24 $\\mu$m image shows the warm dust emission,\nwhereas the 8 $\\mu$m band contains PAH emission features at 7.7 and 8.6 $\\mu$m (including the continuum). \nIn Figure~\\ref{fig1a}, we notice that the warm dust emission is surrounded by the 8 $\\mu$m emission. \nFurthermore, the correlation of the warm dust and ionized emission is evident, which has generally been found in H\\,{\\sc ii} \nregions \\citep[e.g.][]{deharveng10,paladini12}.  \nIn addition to the extended emission, the embedded stellar contents are visually seen around the sphere-like shell. \nThe different subregions (viz. East~1, East~2, North, North-West, Central~W, Central~E, South-West, and South) in the S235 complex are\nshown in Figure~\\ref{fig1a}b. Note that three subregions (East~1, South-West, and South) are located away from the edges of the \nsphere-like shell (see Figure~\\ref{fig1a}). \nThere is noticeable nebular emission seen between East~1 subregion and the sphere-like shell, \nwhich is designated as eastern emission wall in Figure~\\ref{fig1a}a.\nThe Central~E subregion contains two bright sources, namely EB IRS~1/G173.6328+02.8064 (hereafter, IRS~1) \nand EB IRS~2/G173.6339+02.8218 (hereafter, IRS~2) \\citep{evans81a} with previously estimated \nluminosities of $\\sim$2.5 $\\times$ 10$^{3}$ L$_{\\odot}$ \nand $\\sim$1.5 $\\times$ 10$^{3}$ L$_{\\odot}$ \\citep{evans81b}, respectively. \nFurthermore, radio continuum emissions are absent toward these two sources (IRS~1 and IRS~2), as pointed out \nby \\citet{nordh84}. Combining these information with the radio continuum data presented in this work, \none can note that no radio continuum emission peaks are seen toward the subregions. \nFigure~\\ref{fig1a}b shows the enhanced 4.5 $\\mu$m and K-band extended emission features in the East~1 and East~2 \nsubregions. In Paper~I, the signatures of outflow activities were found toward East~1 and East~2 subregions \ndue to the presence of shock-excited H$_{2}$ emissions as revealed by the IRAC ratio maps. \nNote that the embedded sources in East~1 subregion appear to be separated by the eastern emission \nwall from the sphere-like shell (see Figure~\\ref{fig1a}a).\n\n\\subsection{Near-infrared extinction map}\nThe visual extinction (A$_{V}$) map of the S235 complex is generated using the publicly available GPS NIR (JHK) photometric data. \nThe extinction value of individual stars was computed using a color-excess \nalong the line of sight \\citep[$E(H - K) = (H - K)_{obs} - <(H - K)_{0}>$; see equation given in][]{lada94} using the \nreddening laws of \\citet{indebetouw05}. The $<$(H - K)$_{0}$$>$ is the mean intrinsic color of the stars, \nwhich was determined to be $\\sim$0.25 from the nearby control \nfield (similar size as target region; central coordinates: $\\alpha_{J2000}$ = 05$^{h}$43$^{m}$35$^{s}$.8, \n$\\delta_{J2000}$ = +35$\\degr$20$\\arcmin$20$\\arcsec$.4). \nThe extinction map was created by mean value of 40 nearest neighbours. \nThe resultant A$_{V}$ map of S235 complex is shown in Figure~\\ref{fig2a}a, \nwhich allows to trace several embedded subregions in the complex. \nAll these subregions are indicated in Figure~\\ref{fig2a}a, which are already \nhighlighted in Figure~\\ref{fig1a}b based on the visual appearance of stellar contents. \nThe A$_{V}$ values vary between 2 and 12.5 mag with an average of about 5.8 mag. \nThe A$_{V}$ map also resembles the sphere-like morphology as highlighted in Figure~\\ref{fig1a}a, \nexcept in the north direction, where it seems to be broken (shown by an arrow in Figure~\\ref{fig2a}a). \n\nFifteen Bolocam dust continuum clumps at 1.1 mm were retrieved from Bolocam source catalog (v2.1) \nand are shown in Figure~\\ref{fig2a}a. Figure~\\ref{fig2a}a illustrates a correlation between extinction and dust clumps. \nMost of the clumps are located in the region having A$_{V}$ greater than 8 mag. \n\n\\subsection{Clump properties}\n\\label{subsec:dstmas}\nDust continuum emission is known to trace the dense and cold regions. \nIn Figure~\\ref{fig2a}b, we show Bolocam dust continuum emission at 1.1 mm, which is seen toward all the marked subregions in Figure~\\ref{fig1a}b.\nIt is important to note that previously published SCUBA/JCMT 850 $\\mu$m data (beam size $\\sim$14$\\arcsec$) \nare not available toward the ``North\" and ``North-West\" subregions of the S235 \ncomplex \\citep[e.g.][]{klein05,francesco08}. \nTherefore, the 1.1 mm data (beam size $\\sim$33$\\arcsec$) provide a more complete information \nof the dense and cold regions of the S235 complex. \nThe identified fifteen clumps in the 1.1 mm map are also presented in Figure~\\ref{fig2a}b. \nThe association of clump(s) with each subregion is listed in Table~\\ref{tab1}. Five subregions \n(i.e., North-West, Central~W, Central~E, East~1, and East~2) contain at least two clumps, while other \ntwo subregions (i.e., South-West and North) are associated with a single clump. \nIn order to derive gas mass M$_{g}$ for each clump at 1.1 mm emission, \nthe following formula has been utilized \\citep{hildebrand83}:\n\n", "index": 1, "text": "\\begin{equation}\nM_{g} \\, = \\, \\frac{D^2 \\, S_\\nu \\, R_t}{B_\\nu(T_d) \\, \\kappa_\\nu}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M_{g}\\,=\\,\\frac{D^{2}\\,S_{\\nu}\\,R_{t}}{B_{\\nu}(T_{d})\\,\\kappa_{\\nu}}\" display=\"block\"><mrow><mpadded width=\"+1.7pt\"><msub><mi>M</mi><mi>g</mi></msub></mpadded><mo rspace=\"4.2pt\">=</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msup><mi>D</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>S</mi><mi>ν</mi></msub></mpadded><mo>⁢</mo><msub><mi>R</mi><mi>t</mi></msub></mrow><mrow><msub><mi>B</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>T</mi><mi>d</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>κ</mi><mi>ν</mi></msub></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\n\\noindent In the equation above, S$_\\nu$, $R_t$, $\\kappa_\\nu$, and $B_\\nu$(T${_d}$) are defined as in Equation 1, \n$\\mu_{H2}$ = 2.8 is the mean molecular weight per hydrogen molecule \\citep{kauffmann08}, \nthe hydrogen atom mass $m_{\\mathrm H}$ is in grams, and the beam solid angle \n$\\Omega_\\mathrm{beam}$ (= $\\pi \\, (FWHM / (206265 \\times \\sqrt{4\\,ln\\,2}))^{2}$ = $2.9 \\times 10^{-8}$ \nfor Bolocam beam FWHM= 33$\\arcsec$) is in steradians, and \n$N(\\mathrm H_2)$ \\citep[= $2.0 \\times 10^{22}\\,\\,S_\\nu (Jy)$ at $T_D$ = 20 K; see][]{bally10} is \nper square centimeter. The column densities thus computed are listed in Table~\\ref{tab1}. Bolocam clumps have column densities \nbetween 0.33 $\\times$ 10$^{22}$ and 13.5 $\\times$ 10$^{22}$ cm$^{-2}$.\n\n\\subsection{IRAC ratio and H$_{2}$ maps}\n\\label{subsec:h2out}\n\nIn order to trace molecular H$_{2}$ emission in the complex, we examined the {\\it Spitzer}-IRAC ratio (4.5 $\\mu$m/3.6 $\\mu$m) \nmap and the narrow H$_{2}$ (2.12 $\\mu$m) map. The {\\it Spitzer}-IRAC ratio maps have been utilized by many authors to \nstudy the interaction between a massive star and its surrounding interstellar\nmedium (ISM) \\citep{povich07,watson08,kumarld10a,kumarld10,dewangan11,dewangan12}.\nIRAC 3.6 $\\mu$m and 4.5 $\\mu$m bands have almost identical \npoint response function (PRF), therefore, one can directly take the ratio of 4.5 $\\mu$m to 3.6 $\\mu$m bands.\nIn Figure~\\ref{fig4ua}, we display a ratio map of 4.5 $\\mu$m/3.6 $\\mu$m emission. \nThe spherical shell-like morphology is evident and the map depicts the edges of the shell. \nAdditionally, several features are seen that are present toward the edges of the shell and in the vicinity of a massive star. \nIn general,  the bright emission region in ratio 4.5 $\\mu$m/3.6 $\\mu$m map indicates the excess 4.5 $\\mu$m emission, \nwhile the remaining black or dark gray regions suggest the domination of 3.6 $\\mu$m emission.  \nIRAC 4.5 $\\mu$m band contains a prominent molecular hydrogen line emission ($\\nu$ = 0--0 $S$(9); 4.693 $\\mu$m), \nwhich can be excited by outflow shocks, and a \nhydrogen recombination line Br$\\alpha$ (4.05 $\\mu$m).\nIRAC 3.6 $\\mu$m band harbors PAH emission at 3.3 $\\mu$m as well as a prominent molecular hydrogen feature at 3.234 \n$\\mu$m ($\\nu$ = 1--0 $ O$(5)). In ratio map, we also notice a bright region in the vicinity of the massive star \nthat coincides with warm dust emission traced at 24 $\\mu$m as well as with the peak of the radio emission (see arrow in Figure~\\ref{fig4ua}). \nThis bright emission region probably traces the Br$\\alpha$ feature originated by photoionized gas. \nIn East~1, East~2, Central~E, and North-West subregions, we found bright emissions that are marked in the ratio map. \nNote that there are no radio continuum emission detected toward these subregions. Therefore, these emissions are \nprobably H$_{2}$ features tracing outflow activities (see Section~\\ref{subsec:vel} for molecular outflows). \nFigure~\\ref{fig5} shows a continuum-subtracted 2.12 $\\mu$m H$_{2}$ ($\\nu$ = $1-0$ S(1)) image, \nrevealing the presence of H$_{2}$ emission in the complex. \nThe complex contains diffuse or filamentary-like H$_{2}$ features as well as extended H$_{2}$ \nemission. The extended H$_{2}$ emission is seen as polar \nstructures (i.e., monopolar, bipolar, and multipolar; see East~1, East~2, and Central~E subregions in Figures~\\ref{fig5} and~\\ref{fig6}).\nThe bipolar emission structure is often interpreted as a bipolar outflow excited by a young star.\nThe multipolar structures could be originated due to presence of bipolar outflows associated with multiple young stars.\nThe monopolar H$_{2}$ structure could be explained by the presence of a bipolar outflow excited by a young star, \nhowever its red-shifted component is hidden from view due to inclination angle, extinction, and \nopacity of the ISM around the young star. \nIn Figure~\\ref{fig6}, we present H$_{2}$, 4.5 $\\mu$m, and 24 $\\mu$m images of three \nsubregions (i.e., East~1,  East~2, and Central-E), where polar structures are traced in the H$_{2}$ map. \nIn East~1 subregion, one multipolar structure is clearly traced. Additionally, some H$_{2}$ knots are seen. \nThe H$_{2}$ map confirms intense outflow or jet activities in this subregion. \nThe extended 4.5 $\\mu$m emission is also detected similar to those seen in the H$_{2}$ map. \nThe prominent 4.5 $\\mu$m emission was reported in Paper~I using the IRAC ratio map 4.5 $\\mu$m/8.0 $\\mu$m \n(see Figure~11 in Paper~I). \nThis subregion contains a cluster of embedded YSOs which makes difficult to pinpoint the exact exciting source(s) of outflows.\nHowever, some probable driving sources (i.e. YSOs) of outflows, that are taken from Paper~I, are marked in the 4.5 $\\mu$m and 24 $\\mu$m images. \nThese highlighted YSOs appear bright in the 24 $\\mu$m image. \nIn East~2 subregion, a bipolar structure is detected and is also seen in the 4.5 $\\mu$m image (also see Figure~12 in Paper~I). \nIn Paper~I, the driving source of this outflow was characterized as a HMPO candidate. \nThe position of this YSO is also marked in the 4.5 $\\mu$m and 24 $\\mu$m images. \nThe YSO is very bright in the 24 $\\mu$m image. \nIn Central-E subregion (see Figure~\\ref{fig6}), we find a bipolar and two monopolar structures \n\\citep[also see source IDs 164 and 165 in Table B2 given in][]{navarete15}. \nThe probable exciting sources of one bipolar structure (Outflow-ce1) \nand one monopolar structure (Jet-ce) are marked in the 4.5 $\\mu$m and 24 $\\mu$m images (see Figure~\\ref{fig6}). \nThe 24 $\\mu$m counterparts of these driving sources are also seen. \nHowever, the driving source of one monopolar structure (Outflow-ce2; Figure~\\ref{fig6}) is not detected.  \nIn general, one can refer H$_{2}$ nebulosity as an outflow when it traces back to a source. \nIn the present case, considering the morphology of H$_{2}$ nebulosity \\citep[e.g.][]{takami10}, \nwe refer this monopolar structure as the outflow signature. \nIt is generally accepted that the molecular outflows directly indicate the presence of star formation processes. \nA comparison of the 2.12 $\\mu$m H$_{2}$ emission with the features detected in the ratio map suggest that the black \nregion in the ratio map probably traces the H$_{2}$ features (see Figures~\\ref{fig4ua} and~\\ref{fig5}). \nHowever, the presence of 3.3 $\\mu$m PAH feature can not be ignored. \nThe prominent diffuse or filamentary-like H$_{2}$ features traced in the H$_{2}$ map could be explained by ultra-violet (UV) fluorescence.  \nIn summary, the IRAC ratio and H$_{2}$ maps trace photodissociation regions (or photon-dominated regions, \nor PDRs) around the H\\,{\\sc ii} region and star formation activities in the complex.\n\n\\subsection{CO molecular gas associated with the S235 complex}\n\\label{subsec:vel}\nIn the following, we present molecular line data analysis, which enables us to examine the ongoing physical \nprocesses and velocity structures present in the complex.\n\n\\subsubsection{$^{12}$CO and $^{13}$CO Distributions}\n\nIn Figure~\\ref{fig7}, we present the velocity channel maps of the J = 1$-$0 line of $^{13}$CO (at intervals of 0.25 km s$^{-1}$). \nThe maps reveal the distribution of molecular gas components along the line of sight. \nThe maps are shown for the velocity range of $-$22.75 km s$^{-1}$ to $-$15 km s$^{-1}$. \nOne may notice from Figure~\\ref{fig7} that the distribution of molecular gas is clumpy, as also previously pointed out by \\citet{heyer96}. \nIn general, the $^{13}$CO line is more optically thin compared to $^{12}$CO line. \nTherefore, the $^{13}$CO line data can trace dense condensation and its associated velocity better than $^{12}$CO. \nConsidering this fact, we preferred to show only $^{13}$CO channel maps of the complex. \nIn the velocity range from $-$22.75 to $-$21.25 km s$^{-1}$, Central~W, East~2, and North-West subregions are well detected.  \nIn the velocity range from $-$21 to $-$19.75 km s$^{-1}$, Central~E, Central~W, East~1, East~2, North, and North-West subregions are traced.  \nIn the velocity range from $-$19.50 to $-$18.0 km s$^{-1}$, Central~E and East~1 subregions are seen. \nThe $^{13}$CO gas kinematics presented in this work is consistent with the previous work of \\citet{kirsanova08}.  \nThey suggested the presence of three molecular gas components in the complex, which correspond to quiescent undisturbed primordial \ngas (i.e. $-$18 km s$^{-1}$ $< V_{lsr} < -$15 km s$^{-1}$ (red)), gas compressed by the shock from expanding S235 H\\,{\\sc ii} \nregion (i.e. $-$21 km s$^{-1}$ $< V_{lsr} < -$18 km s$^{-1}$ (central)), and gas expulsion from the embedded young star clusters driven \nby the combined effect of the cluster stars (i.e. $-$25 km s$^{-1}$ $< V_{lsr} < -$21 km s$^{-1}$ (blue)). \nFurthermore, \\citet{kirsanova14} utilized NH$_{3}$ line data\nand found the densest molecular clumps associated with East~1, East~2, and Central subregions, mostly belong to the ``central\" molecular component. \n\n\nFigure~\\ref{fig8} shows the $^{12}$CO and $^{13}$CO integrated gray scale maps, obtained by integrating over the velocity \nrange between $-$23 and $-$18 km s$^{-1}$. \nBolocam dust continuum emission contours are also overlaid on the $^{12}$CO integrated map to illustrate the \nphysical association of dust emission with the complex. \nThe integrated CO maps trace a region empty of molecular gas \nbetween two subregions, namely North and North-West. \nIt is to be noted that the region empty of CO gas is exactly coincident with the broken part in the extinction map, \nwhere the radio continuum emission at 610 MHz is elongated (see Figures~\\ref{fig1a}b and~\\ref{fig2a}a). \nThis region also appears to be associated with Br$\\alpha$ emission \nwhich is surrounded by H$_{2}$ and/or PAH features (see Figure~\\ref{fig4ua}). \nIt suggests a close interaction between ionized and molecular gas in the complex. \nIt seems that the ionizing photons have managed to escape in this direction. \nWe propose that these features are best explained by the existence of a cavity \nbetween North and North-West subregions (also see Section~\\ref{subsec:phyp}).\n\nIn Figure~\\ref{fig9}, we show position-velocity (p-v) analysis of $^{12}$CO and $^{13}$CO gas. \nThe p-v plots (right ascension-velocity and declination-velocity) of $^{12}$CO and $^{13}$CO gas have revealed \nnoticeable velocity gradients and show \nessentially the same structure. However, $^{13}$CO data provide more information related to the velocity \nstructure of the denser regions compared to $^{12}$CO emission (see declination-velocity plots in Figure~\\ref{fig9}). \nThe p-v plots of $^{12}$CO and $^{13}$CO gas reveal an almost semi-ring-like or C-like structure at larger scale (about 8 parsec extended). \nThe detection of such morphology in the p-v plot is often interpreted as signature of an expanding shell \\citep[e.g.][]{wilson05,arce11,dewangan15b}. \nWe find an expansion velocity of the gas to be $\\sim$3 km s$^{-1}$.  \nDetailed discussion about this morphology can be found in Section~\\ref{subsec:phyp}. \nNote that the S235 complex hosts the O9.5V type star, therefore the presence of the C-like structure in the \ncomplex can be interpreted as caused by the expanding H\\,{\\sc ii} region. \nSimilar result was also observed in W42 star-forming region \\citep[see Figure~8 in][]{dewangan15b}.\n\n\\subsubsection{Molecular outflows}\n\nIn addition to the C-like structure in the p-v plots, we have also found noticeable velocity gradients \ntoward the East~1, East~2, Central~E, and North-West subregions, suggesting the presence of outflow activities in each of \nsubregions. Following Paper~I, we know that the East~1, East~2, and Central~E subregions contain a cluster of YSOs. \nWe have searched for outflows toward these subregions using the doppler shifted velocity components (red, green, and blue).\nDue to the coarse beam of CO data (beam size $\\sim$46$\\arcsec$), we cannot pinpoint the exact exciting source of the outflows \nin each subregion. Considering this limitation, we have not shown the doppler shifted components (red, green, and blue) toward \nthe East~2, Central~E, and North-West subregions. \nIn Figure~\\ref{fig10}, we present the noticeable receding, approaching, and rest gas components only in East~1 subregion. \nWe have also marked the position of at least one probable driving source of the CO outflow (also see Section~\\ref{subsec:h2out}). \nHigh resolution molecular line observations are necessary to examine better insight into the molecular outflows in the complex.\n\n\\subsection{NH$_{3}$ radial velocity and non-thermal velocity dispersion}\n\\label{subsec:amonia}\n\nAs mentioned in the introduction, in general, it is known that NH$_{3}$ data trace the densest regions of molecular cloud in a given star-forming region. \nThe properties of densest gas traced by NH$_{3}$ line observations have not yet been studied \nwith respect to the ionizing star in the S235 complex. \nThe locations of NH$_{3}$ line observations are marked in Figure~\\ref{fig2a}b, which were mainly observed in \nEast~1, East~2, and Central~E subregions \\citep[see][for more details]{kirsanova14}. \nIn Figure~\\ref{fig15}a, we show the variation of NH$_{3}$(1,1) radial velocity in each subregion as a function of distance from the location of the O9.5V star. \nThe NH$_{3}$(1,1) radial velocities vary between $-$22 and $-$18.5 km~s$^{-1}$ in these three subregions. \nIn general, there are noticeable velocity variations within East~1 ($-$21.5 to $-$19.0 km~s$^{-1}$), \nEast~2 ($-$21.5 to $-$20.5 km~s$^{-1}$), and Central~E ($-$22 to $-$18.5 km~s$^{-1}$) subregions. \nThese observational characteristics are also evident in CO data (see Figure~\\ref{fig9}). \n\\citet{balser11} reported the velocity of ionized gas to be about $-25.61(\\pm0.12)$ km s$^{-1}$ in the S235 H\\,{\\sc ii} region \nusing a hydrogen radio recombination line (H87-93$\\alpha$).  \nTherefore, the molecular gas is red-shifted with respect to the ionized gas in the S235 H\\,{\\sc ii} region. \nInterestingly,  we investigate that the radial velocity observed in Central~E subregion shows a linear \ntrend as we move away from the location of a massive star, \nwhich is not seen in other two subregions. In each subregion, we have line of sight velocity components and \nit seems that the radial velocity of gas in Central~E subregion might be almost equal to the real velocity, \nhowever it is not the case for other two subregions. \nThe observed trend could be interpreted as the direct influence of the expanding H\\,{\\sc ii} region excited by the O9.5V star.\nFurther discussion on this result is presented in Section~\\ref{sec:disc}. \n\nWe computed thermal sound speed ($a_{s}$), non-thermal velocity dispersion ($\\sigma_{NT}$), and the ratio of thermal to \nnon-thermal pressure ($P_{TNT} = {a_s^2}/{\\sigma^2_{NT}}$). \nOne can find more details about $P_{TNT}$ in the work of \\citet{lada03}. \nThe sound speed $a_{s}$ (= $(k T_{kin}/\\mu m_{H})^{1/2}$) can be estimated with the knowledge of \ngas kinetic temperature (T$_{kin}$) and $\\mu$=2.37 (approximately 70\\% H and 28\\% He by mass). \nThe non-thermal velocity dispersion is given by:\n\n", "itemtype": "equation", "pos": 22622, "prevtext": " \n\\noindent where $S_\\nu$ is the integrated 1.1 mm flux (Jy), \n$D$ is the distance (kpc), $R_t$ is the gas-to-dust mass ratio (assumed to be 100), \n$B_\\nu$ is the Planck function for a dust temperature $T_d$, \nand $\\kappa_\\nu$ is the dust absorption coefficient.  \nIn the calculation, we use $\\kappa_\\nu$ = 1.14\\,cm$^2$\\,g$^{-1}$ \\citep[e.g.][]{enoch08,bally10},  \n$D$ = 1.8 kpc, and $T_d$ = 20 K \n\\citep[an average temperature value estimated from NH$_{3}$ line data; see][for more details]{kirsanova14}. \nThe masses computed from the observed dust continuum data are listed in Table~\\ref{tab1}. \nThe total gas mass of the 15 clumps comes out to be $\\sim$1179 M$_{\\odot}$. \nThe clump masses vary between 7 M$_{\\odot}$ and 285 M$_{\\odot}$.   \nAll the clumps have masses below 100 M$_{\\odot}$ except three clumps.\nThese three clumps are associated with Central~E (clump IDs 6 and 9) and East~1 (clump ID 15) \nsubregions and have masses more than 200 M$_{\\odot}$ \n(see Table~\\ref{tab1}). In an earlier work of the S235 complex (excluding North and North-West subregions), \n\\citet{klein05} selected thirteen dust emission clumps in the JCMT SCUBA 850 $\\mu$m survey \n\\citep[beam size $\\sim$14$\\arcsec$; see Fig.~1 of IRAS 05377+3548 in][]{klein05}. \nThey estimated a mass range of clumps between 10 and 120 M$_{\\odot}$, using an average dust temperature of \n20 K, a gas-to-dust mass ratio of 150, and a distance of 1.8 kpc. \n\\citet{kirsanova14} also computed a mass range of dense gas in the clumps between 12 and \n250 M$_{\\odot}$ \\citep[see Table~6 in][]{kirsanova14}. Considering the clump masses estimated in the present work, \none can find a noticeable difference in the clump mass at the high end of the estimated range compared to \nthe previous works. At the low end of the range, the gas mass is almost same in the present calculations compared to the earlier \nworks. More extensive high sensitivity and high resolution observations at mm/sub-mm wavelengths would \nallow to further explore the clump mass at the high end of the estimated mass range.\n\nIn Figure~\\ref{fig3a}, we show the distribution of clump masses as a function of distance from the location of the O9.5V star. \nInterestingly, we notice that the clump masses increase as we move away from the location of the ionizing star. \nThis correlation is seen only for those clumps which are distributed near the edges of the sphere-like \nshell (e.g. Central~E, East~2, North, and North-West subregions).  \nThe implication of this correlation for the star formation process is discussed in Section~\\ref{sec:disc}. \n\nThe column densities of clumps can also be computed using the Bolocam data.\nThe column density per beam is given by \\citep[see][]{deharveng10}: \n\n\n", "index": 3, "text": "\\begin{equation}\nN(\\mathrm H_2) =\n\\frac{S_\\nu \\, R_t}\n{\\kappa_\\nu\\,\\,\nB_\\nu(T_d)\\,\\,\n\\mu_{H2}\\,\\,m_{\\mathrm H}\\,\\,\\Omega_\\mathrm{beam}}\\mathrm, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"N(\\mathrm{H}_{2})=\\frac{S_{\\nu}\\,R_{t}}{\\kappa_{\\nu}\\,\\,B_{\\nu}(T_{d})\\,\\,\\mu_%&#10;{H2}\\,\\,m_{\\mathrm{H}}\\,\\,\\Omega_{\\mathrm{beam}}}\\mathrm{,}\" display=\"block\"><mrow><mrow><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msub><mi>S</mi><mi>ν</mi></msub></mpadded><mo>⁢</mo><msub><mi>R</mi><mi>t</mi></msub></mrow><mrow><mpadded width=\"+3.4pt\"><msub><mi>κ</mi><mi>ν</mi></msub></mpadded><mo>⁢</mo><msub><mi>B</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>T</mi><mi>d</mi></msub><mo rspace=\"5.9pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+3.4pt\"><msub><mi>μ</mi><mrow><mi>H</mi><mo>⁢</mo><mn>2</mn></mrow></msub></mpadded><mo>⁢</mo><mpadded width=\"+3.4pt\"><msub><mi>m</mi><mi mathvariant=\"normal\">H</mi></msub></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>beam</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\nwhere $\\Delta V$ is the measured FWHM linewidth of the observed NH$_{3}$ spectra, \n$\\sigma_{\\rm T}$ (= $(k T_{kin}/17 m_H)^{1/2}$) is the thermal broadening for NH$_{3}$ at T$_{kin}$ \\citep[e.g.][]{dunham11}, \nand $m_H$ is the mass of hydrogen atom. The computed values of $a_{s}$, $\\sigma_{NT}$, and $P_{TNT}$ are given in Table~\\ref{tab3}. \nThe value of $P_{TNT}$ is computed for each of the observed positions.  \nIn each subregion, the variation of $P_{TNT}$ as a function of distance from the location of a massive star is shown in Figure~\\ref{fig15}b. \nWe find an average $P_{TNT}$ value of 0.13, 0.21, and 0.22 for East~1, East~2, and Central~E subregions, respectively. \nIt suggests that non-thermal pressure is dominant in these densest subregions. \nThe lower values of $P_{TNT}$ might be due to contributions from the bipolar outflows, as investigated in previous section. \nThe average values of Mach numbers ($\\sigma_{\\rm NT}$/$a_{s}$) estimated for East~1, East~2, and Central~E \nsubregions are 2.9, 2.3, and 2.9, respectively which indicate that these subregions are supersonic. \n\n\\subsection{Feedback of a massive star}\n\\label{subsec:feed}\nIn this section, we derive the various pressure components (pressure of an H\\,{\\sc ii} region $(P_{HII})$, radiation pressure (P$_{rad}$), \nand stellar wind ram pressure (P$_{wind}$)) driven by a massive star to study its feedback in the vicinity.\n\nIt is found that the massive star is approximately located at the center of the sphere-like shell. \nThe radio continuum images presented in this work can be used to estimate the number of Lyman continuum photons (N$_{uv}$).\nThe expression of N$_{uv}$ is given by \\citep{matsakis76}:\n\n", "itemtype": "equation", "pos": 37810, "prevtext": "\n\n\\noindent In the equation above, S$_\\nu$, $R_t$, $\\kappa_\\nu$, and $B_\\nu$(T${_d}$) are defined as in Equation 1, \n$\\mu_{H2}$ = 2.8 is the mean molecular weight per hydrogen molecule \\citep{kauffmann08}, \nthe hydrogen atom mass $m_{\\mathrm H}$ is in grams, and the beam solid angle \n$\\Omega_\\mathrm{beam}$ (= $\\pi \\, (FWHM / (206265 \\times \\sqrt{4\\,ln\\,2}))^{2}$ = $2.9 \\times 10^{-8}$ \nfor Bolocam beam FWHM= 33$\\arcsec$) is in steradians, and \n$N(\\mathrm H_2)$ \\citep[= $2.0 \\times 10^{22}\\,\\,S_\\nu (Jy)$ at $T_D$ = 20 K; see][]{bally10} is \nper square centimeter. The column densities thus computed are listed in Table~\\ref{tab1}. Bolocam clumps have column densities \nbetween 0.33 $\\times$ 10$^{22}$ and 13.5 $\\times$ 10$^{22}$ cm$^{-2}$.\n\n\\subsection{IRAC ratio and H$_{2}$ maps}\n\\label{subsec:h2out}\n\nIn order to trace molecular H$_{2}$ emission in the complex, we examined the {\\it Spitzer}-IRAC ratio (4.5 $\\mu$m/3.6 $\\mu$m) \nmap and the narrow H$_{2}$ (2.12 $\\mu$m) map. The {\\it Spitzer}-IRAC ratio maps have been utilized by many authors to \nstudy the interaction between a massive star and its surrounding interstellar\nmedium (ISM) \\citep{povich07,watson08,kumarld10a,kumarld10,dewangan11,dewangan12}.\nIRAC 3.6 $\\mu$m and 4.5 $\\mu$m bands have almost identical \npoint response function (PRF), therefore, one can directly take the ratio of 4.5 $\\mu$m to 3.6 $\\mu$m bands.\nIn Figure~\\ref{fig4ua}, we display a ratio map of 4.5 $\\mu$m/3.6 $\\mu$m emission. \nThe spherical shell-like morphology is evident and the map depicts the edges of the shell. \nAdditionally, several features are seen that are present toward the edges of the shell and in the vicinity of a massive star. \nIn general,  the bright emission region in ratio 4.5 $\\mu$m/3.6 $\\mu$m map indicates the excess 4.5 $\\mu$m emission, \nwhile the remaining black or dark gray regions suggest the domination of 3.6 $\\mu$m emission.  \nIRAC 4.5 $\\mu$m band contains a prominent molecular hydrogen line emission ($\\nu$ = 0--0 $S$(9); 4.693 $\\mu$m), \nwhich can be excited by outflow shocks, and a \nhydrogen recombination line Br$\\alpha$ (4.05 $\\mu$m).\nIRAC 3.6 $\\mu$m band harbors PAH emission at 3.3 $\\mu$m as well as a prominent molecular hydrogen feature at 3.234 \n$\\mu$m ($\\nu$ = 1--0 $ O$(5)). In ratio map, we also notice a bright region in the vicinity of the massive star \nthat coincides with warm dust emission traced at 24 $\\mu$m as well as with the peak of the radio emission (see arrow in Figure~\\ref{fig4ua}). \nThis bright emission region probably traces the Br$\\alpha$ feature originated by photoionized gas. \nIn East~1, East~2, Central~E, and North-West subregions, we found bright emissions that are marked in the ratio map. \nNote that there are no radio continuum emission detected toward these subregions. Therefore, these emissions are \nprobably H$_{2}$ features tracing outflow activities (see Section~\\ref{subsec:vel} for molecular outflows). \nFigure~\\ref{fig5} shows a continuum-subtracted 2.12 $\\mu$m H$_{2}$ ($\\nu$ = $1-0$ S(1)) image, \nrevealing the presence of H$_{2}$ emission in the complex. \nThe complex contains diffuse or filamentary-like H$_{2}$ features as well as extended H$_{2}$ \nemission. The extended H$_{2}$ emission is seen as polar \nstructures (i.e., monopolar, bipolar, and multipolar; see East~1, East~2, and Central~E subregions in Figures~\\ref{fig5} and~\\ref{fig6}).\nThe bipolar emission structure is often interpreted as a bipolar outflow excited by a young star.\nThe multipolar structures could be originated due to presence of bipolar outflows associated with multiple young stars.\nThe monopolar H$_{2}$ structure could be explained by the presence of a bipolar outflow excited by a young star, \nhowever its red-shifted component is hidden from view due to inclination angle, extinction, and \nopacity of the ISM around the young star. \nIn Figure~\\ref{fig6}, we present H$_{2}$, 4.5 $\\mu$m, and 24 $\\mu$m images of three \nsubregions (i.e., East~1,  East~2, and Central-E), where polar structures are traced in the H$_{2}$ map. \nIn East~1 subregion, one multipolar structure is clearly traced. Additionally, some H$_{2}$ knots are seen. \nThe H$_{2}$ map confirms intense outflow or jet activities in this subregion. \nThe extended 4.5 $\\mu$m emission is also detected similar to those seen in the H$_{2}$ map. \nThe prominent 4.5 $\\mu$m emission was reported in Paper~I using the IRAC ratio map 4.5 $\\mu$m/8.0 $\\mu$m \n(see Figure~11 in Paper~I). \nThis subregion contains a cluster of embedded YSOs which makes difficult to pinpoint the exact exciting source(s) of outflows.\nHowever, some probable driving sources (i.e. YSOs) of outflows, that are taken from Paper~I, are marked in the 4.5 $\\mu$m and 24 $\\mu$m images. \nThese highlighted YSOs appear bright in the 24 $\\mu$m image. \nIn East~2 subregion, a bipolar structure is detected and is also seen in the 4.5 $\\mu$m image (also see Figure~12 in Paper~I). \nIn Paper~I, the driving source of this outflow was characterized as a HMPO candidate. \nThe position of this YSO is also marked in the 4.5 $\\mu$m and 24 $\\mu$m images. \nThe YSO is very bright in the 24 $\\mu$m image. \nIn Central-E subregion (see Figure~\\ref{fig6}), we find a bipolar and two monopolar structures \n\\citep[also see source IDs 164 and 165 in Table B2 given in][]{navarete15}. \nThe probable exciting sources of one bipolar structure (Outflow-ce1) \nand one monopolar structure (Jet-ce) are marked in the 4.5 $\\mu$m and 24 $\\mu$m images (see Figure~\\ref{fig6}). \nThe 24 $\\mu$m counterparts of these driving sources are also seen. \nHowever, the driving source of one monopolar structure (Outflow-ce2; Figure~\\ref{fig6}) is not detected.  \nIn general, one can refer H$_{2}$ nebulosity as an outflow when it traces back to a source. \nIn the present case, considering the morphology of H$_{2}$ nebulosity \\citep[e.g.][]{takami10}, \nwe refer this monopolar structure as the outflow signature. \nIt is generally accepted that the molecular outflows directly indicate the presence of star formation processes. \nA comparison of the 2.12 $\\mu$m H$_{2}$ emission with the features detected in the ratio map suggest that the black \nregion in the ratio map probably traces the H$_{2}$ features (see Figures~\\ref{fig4ua} and~\\ref{fig5}). \nHowever, the presence of 3.3 $\\mu$m PAH feature can not be ignored. \nThe prominent diffuse or filamentary-like H$_{2}$ features traced in the H$_{2}$ map could be explained by ultra-violet (UV) fluorescence.  \nIn summary, the IRAC ratio and H$_{2}$ maps trace photodissociation regions (or photon-dominated regions, \nor PDRs) around the H\\,{\\sc ii} region and star formation activities in the complex.\n\n\\subsection{CO molecular gas associated with the S235 complex}\n\\label{subsec:vel}\nIn the following, we present molecular line data analysis, which enables us to examine the ongoing physical \nprocesses and velocity structures present in the complex.\n\n\\subsubsection{$^{12}$CO and $^{13}$CO Distributions}\n\nIn Figure~\\ref{fig7}, we present the velocity channel maps of the J = 1$-$0 line of $^{13}$CO (at intervals of 0.25 km s$^{-1}$). \nThe maps reveal the distribution of molecular gas components along the line of sight. \nThe maps are shown for the velocity range of $-$22.75 km s$^{-1}$ to $-$15 km s$^{-1}$. \nOne may notice from Figure~\\ref{fig7} that the distribution of molecular gas is clumpy, as also previously pointed out by \\citet{heyer96}. \nIn general, the $^{13}$CO line is more optically thin compared to $^{12}$CO line. \nTherefore, the $^{13}$CO line data can trace dense condensation and its associated velocity better than $^{12}$CO. \nConsidering this fact, we preferred to show only $^{13}$CO channel maps of the complex. \nIn the velocity range from $-$22.75 to $-$21.25 km s$^{-1}$, Central~W, East~2, and North-West subregions are well detected.  \nIn the velocity range from $-$21 to $-$19.75 km s$^{-1}$, Central~E, Central~W, East~1, East~2, North, and North-West subregions are traced.  \nIn the velocity range from $-$19.50 to $-$18.0 km s$^{-1}$, Central~E and East~1 subregions are seen. \nThe $^{13}$CO gas kinematics presented in this work is consistent with the previous work of \\citet{kirsanova08}.  \nThey suggested the presence of three molecular gas components in the complex, which correspond to quiescent undisturbed primordial \ngas (i.e. $-$18 km s$^{-1}$ $< V_{lsr} < -$15 km s$^{-1}$ (red)), gas compressed by the shock from expanding S235 H\\,{\\sc ii} \nregion (i.e. $-$21 km s$^{-1}$ $< V_{lsr} < -$18 km s$^{-1}$ (central)), and gas expulsion from the embedded young star clusters driven \nby the combined effect of the cluster stars (i.e. $-$25 km s$^{-1}$ $< V_{lsr} < -$21 km s$^{-1}$ (blue)). \nFurthermore, \\citet{kirsanova14} utilized NH$_{3}$ line data\nand found the densest molecular clumps associated with East~1, East~2, and Central subregions, mostly belong to the ``central\" molecular component. \n\n\nFigure~\\ref{fig8} shows the $^{12}$CO and $^{13}$CO integrated gray scale maps, obtained by integrating over the velocity \nrange between $-$23 and $-$18 km s$^{-1}$. \nBolocam dust continuum emission contours are also overlaid on the $^{12}$CO integrated map to illustrate the \nphysical association of dust emission with the complex. \nThe integrated CO maps trace a region empty of molecular gas \nbetween two subregions, namely North and North-West. \nIt is to be noted that the region empty of CO gas is exactly coincident with the broken part in the extinction map, \nwhere the radio continuum emission at 610 MHz is elongated (see Figures~\\ref{fig1a}b and~\\ref{fig2a}a). \nThis region also appears to be associated with Br$\\alpha$ emission \nwhich is surrounded by H$_{2}$ and/or PAH features (see Figure~\\ref{fig4ua}). \nIt suggests a close interaction between ionized and molecular gas in the complex. \nIt seems that the ionizing photons have managed to escape in this direction. \nWe propose that these features are best explained by the existence of a cavity \nbetween North and North-West subregions (also see Section~\\ref{subsec:phyp}).\n\nIn Figure~\\ref{fig9}, we show position-velocity (p-v) analysis of $^{12}$CO and $^{13}$CO gas. \nThe p-v plots (right ascension-velocity and declination-velocity) of $^{12}$CO and $^{13}$CO gas have revealed \nnoticeable velocity gradients and show \nessentially the same structure. However, $^{13}$CO data provide more information related to the velocity \nstructure of the denser regions compared to $^{12}$CO emission (see declination-velocity plots in Figure~\\ref{fig9}). \nThe p-v plots of $^{12}$CO and $^{13}$CO gas reveal an almost semi-ring-like or C-like structure at larger scale (about 8 parsec extended). \nThe detection of such morphology in the p-v plot is often interpreted as signature of an expanding shell \\citep[e.g.][]{wilson05,arce11,dewangan15b}. \nWe find an expansion velocity of the gas to be $\\sim$3 km s$^{-1}$.  \nDetailed discussion about this morphology can be found in Section~\\ref{subsec:phyp}. \nNote that the S235 complex hosts the O9.5V type star, therefore the presence of the C-like structure in the \ncomplex can be interpreted as caused by the expanding H\\,{\\sc ii} region. \nSimilar result was also observed in W42 star-forming region \\citep[see Figure~8 in][]{dewangan15b}.\n\n\\subsubsection{Molecular outflows}\n\nIn addition to the C-like structure in the p-v plots, we have also found noticeable velocity gradients \ntoward the East~1, East~2, Central~E, and North-West subregions, suggesting the presence of outflow activities in each of \nsubregions. Following Paper~I, we know that the East~1, East~2, and Central~E subregions contain a cluster of YSOs. \nWe have searched for outflows toward these subregions using the doppler shifted velocity components (red, green, and blue).\nDue to the coarse beam of CO data (beam size $\\sim$46$\\arcsec$), we cannot pinpoint the exact exciting source of the outflows \nin each subregion. Considering this limitation, we have not shown the doppler shifted components (red, green, and blue) toward \nthe East~2, Central~E, and North-West subregions. \nIn Figure~\\ref{fig10}, we present the noticeable receding, approaching, and rest gas components only in East~1 subregion. \nWe have also marked the position of at least one probable driving source of the CO outflow (also see Section~\\ref{subsec:h2out}). \nHigh resolution molecular line observations are necessary to examine better insight into the molecular outflows in the complex.\n\n\\subsection{NH$_{3}$ radial velocity and non-thermal velocity dispersion}\n\\label{subsec:amonia}\n\nAs mentioned in the introduction, in general, it is known that NH$_{3}$ data trace the densest regions of molecular cloud in a given star-forming region. \nThe properties of densest gas traced by NH$_{3}$ line observations have not yet been studied \nwith respect to the ionizing star in the S235 complex. \nThe locations of NH$_{3}$ line observations are marked in Figure~\\ref{fig2a}b, which were mainly observed in \nEast~1, East~2, and Central~E subregions \\citep[see][for more details]{kirsanova14}. \nIn Figure~\\ref{fig15}a, we show the variation of NH$_{3}$(1,1) radial velocity in each subregion as a function of distance from the location of the O9.5V star. \nThe NH$_{3}$(1,1) radial velocities vary between $-$22 and $-$18.5 km~s$^{-1}$ in these three subregions. \nIn general, there are noticeable velocity variations within East~1 ($-$21.5 to $-$19.0 km~s$^{-1}$), \nEast~2 ($-$21.5 to $-$20.5 km~s$^{-1}$), and Central~E ($-$22 to $-$18.5 km~s$^{-1}$) subregions. \nThese observational characteristics are also evident in CO data (see Figure~\\ref{fig9}). \n\\citet{balser11} reported the velocity of ionized gas to be about $-25.61(\\pm0.12)$ km s$^{-1}$ in the S235 H\\,{\\sc ii} region \nusing a hydrogen radio recombination line (H87-93$\\alpha$).  \nTherefore, the molecular gas is red-shifted with respect to the ionized gas in the S235 H\\,{\\sc ii} region. \nInterestingly,  we investigate that the radial velocity observed in Central~E subregion shows a linear \ntrend as we move away from the location of a massive star, \nwhich is not seen in other two subregions. In each subregion, we have line of sight velocity components and \nit seems that the radial velocity of gas in Central~E subregion might be almost equal to the real velocity, \nhowever it is not the case for other two subregions. \nThe observed trend could be interpreted as the direct influence of the expanding H\\,{\\sc ii} region excited by the O9.5V star.\nFurther discussion on this result is presented in Section~\\ref{sec:disc}. \n\nWe computed thermal sound speed ($a_{s}$), non-thermal velocity dispersion ($\\sigma_{NT}$), and the ratio of thermal to \nnon-thermal pressure ($P_{TNT} = {a_s^2}/{\\sigma^2_{NT}}$). \nOne can find more details about $P_{TNT}$ in the work of \\citet{lada03}. \nThe sound speed $a_{s}$ (= $(k T_{kin}/\\mu m_{H})^{1/2}$) can be estimated with the knowledge of \ngas kinetic temperature (T$_{kin}$) and $\\mu$=2.37 (approximately 70\\% H and 28\\% He by mass). \nThe non-thermal velocity dispersion is given by:\n\n", "index": 5, "text": "\\begin{equation}\n\\sigma_{\\rm NT} = \\sqrt{\\frac{\\Delta V^2}{8\\ln 2}-\\frac{k T_{kin}}{17 m_H}} = \\sqrt{\\frac{\\Delta V^2}{8\\ln 2}-\\sigma_{\\rm T}^{2}} ,\n\\label{sigmanonthermal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm NT}=\\sqrt{\\frac{\\Delta V^{2}}{8\\ln 2}-\\frac{kT_{kin}}{17m_{H}}}=%&#10;\\sqrt{\\frac{\\Delta V^{2}}{8\\ln 2}-\\sigma_{\\rm T}^{2}},\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mi>NT</mi></msub><mo>=</mo><msqrt><mrow><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>V</mi><mn>2</mn></msup></mrow><mrow><mn>8</mn><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mn>2</mn></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>k</mi><mo>⁢</mo><msub><mi>T</mi><mrow><mi>k</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mrow><mn>17</mn><mo>⁢</mo><msub><mi>m</mi><mi>H</mi></msub></mrow></mfrac></mrow></msqrt><mo>=</mo><msqrt><mrow><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>V</mi><mn>2</mn></msup></mrow><mrow><mn>8</mn><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mn>2</mn></mrow></mrow></mfrac><mo>-</mo><msubsup><mi>σ</mi><mi mathvariant=\"normal\">T</mi><mn>2</mn></msubsup></mrow></msqrt></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\\noindent where S$_{\\nu}$ is the measured total flux density in Jy, D is the distance in kpc, \nT$_{e}$ is the electron temperature, and $\\nu$ is the frequency in GHz. \nThe calculation of N$_{uv}$ is performed for both the radio frequencies (0.61 GHz and 1.4 GHz) separately. \nSubstituting D = 1.8 kpc, T$_{e}$ = 10000 K, and S$_{1.4}$ = 1.92 Jy, we compute N$_{uv}$ = 4.9 $\\times$ 10$^{47}$ s$^{-1}$.\nSimilarly, we find N$_{uv}$ = 8.2 $\\times$ 10$^{47}$ s$^{-1}$ for D, T$_{e}$, and S$_{0.61}$ = 3.49 Jy. \nThe estimates of ionizing photon flux values at different frequencies correspond to a single ionizing star of O9.5V spectral type \\citep{martins05}, \nwhich is also in agreement with the previously reported spectral type of the ionizing source of the complex \\citep[e.g.][]{georgelin73}.  \n\nThe different pressure components ($P_{HII}$, P$_{rad}$, and P$_{wind}$; as mentioned above) are defined as below \\citep[e.g.][]{bressert12}:\n\n", "itemtype": "equation", "pos": 39683, "prevtext": "\nwhere $\\Delta V$ is the measured FWHM linewidth of the observed NH$_{3}$ spectra, \n$\\sigma_{\\rm T}$ (= $(k T_{kin}/17 m_H)^{1/2}$) is the thermal broadening for NH$_{3}$ at T$_{kin}$ \\citep[e.g.][]{dunham11}, \nand $m_H$ is the mass of hydrogen atom. The computed values of $a_{s}$, $\\sigma_{NT}$, and $P_{TNT}$ are given in Table~\\ref{tab3}. \nThe value of $P_{TNT}$ is computed for each of the observed positions.  \nIn each subregion, the variation of $P_{TNT}$ as a function of distance from the location of a massive star is shown in Figure~\\ref{fig15}b. \nWe find an average $P_{TNT}$ value of 0.13, 0.21, and 0.22 for East~1, East~2, and Central~E subregions, respectively. \nIt suggests that non-thermal pressure is dominant in these densest subregions. \nThe lower values of $P_{TNT}$ might be due to contributions from the bipolar outflows, as investigated in previous section. \nThe average values of Mach numbers ($\\sigma_{\\rm NT}$/$a_{s}$) estimated for East~1, East~2, and Central~E \nsubregions are 2.9, 2.3, and 2.9, respectively which indicate that these subregions are supersonic. \n\n\\subsection{Feedback of a massive star}\n\\label{subsec:feed}\nIn this section, we derive the various pressure components (pressure of an H\\,{\\sc ii} region $(P_{HII})$, radiation pressure (P$_{rad}$), \nand stellar wind ram pressure (P$_{wind}$)) driven by a massive star to study its feedback in the vicinity.\n\nIt is found that the massive star is approximately located at the center of the sphere-like shell. \nThe radio continuum images presented in this work can be used to estimate the number of Lyman continuum photons (N$_{uv}$).\nThe expression of N$_{uv}$ is given by \\citep{matsakis76}:\n\n", "index": 7, "text": "\\begin{equation}\n\nN_{uv} (s^{-1}) = 7.5\\, \\times\\, 10^{46}\\, \\left(\\frac{S_{\\nu}}{Jy}\\right)\\left(\\frac{D}{kpc}\\right)^{2} \n\\left(\\frac{T_{e}}{10^{4}K}\\right)^{-0.45} \\\\ \\times\\,\\left(\\frac{\\nu}{GHz}\\right)^{0.1}\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\par&#10; N_{uv}(s^{-1})=7.5\\,\\times\\,10^{46}\\,\\left(\\frac{S_{\\nu}}{Jy}\\right)%&#10;\\left(\\frac{D}{kpc}\\right)^{2}\\left(\\frac{T_{e}}{10^{4}K}\\right)^{-0.45}\\\\&#10;\\times\\,\\left(\\frac{\\nu}{GHz}\\right)^{0.1}\\par&#10;\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mpadded width=\"+1.7pt\"><mn>7.5</mn></mpadded><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn> 10</mn><mn>46</mn></msup></mpadded></mrow><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi>S</mi><mi>ν</mi></msub><mrow><mi>J</mi><mo>⁢</mo><mi>y</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>D</mi><mrow><mi>k</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>c</mi></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>T</mi><mi>e</mi></msub><mrow><msup><mn>10</mn><mn>4</mn></msup><mo>⁢</mo><mi>K</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>0.45</mn></mrow></msup></mrow><mo rspace=\"4.2pt\">×</mo><msup><mrow><mo>(</mo><mfrac><mi>ν</mi><mrow><mi>G</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>z</mi></mrow></mfrac><mo>)</mo></mrow><mn>0.1</mn></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 40850, "prevtext": "\n\\noindent where S$_{\\nu}$ is the measured total flux density in Jy, D is the distance in kpc, \nT$_{e}$ is the electron temperature, and $\\nu$ is the frequency in GHz. \nThe calculation of N$_{uv}$ is performed for both the radio frequencies (0.61 GHz and 1.4 GHz) separately. \nSubstituting D = 1.8 kpc, T$_{e}$ = 10000 K, and S$_{1.4}$ = 1.92 Jy, we compute N$_{uv}$ = 4.9 $\\times$ 10$^{47}$ s$^{-1}$.\nSimilarly, we find N$_{uv}$ = 8.2 $\\times$ 10$^{47}$ s$^{-1}$ for D, T$_{e}$, and S$_{0.61}$ = 3.49 Jy. \nThe estimates of ionizing photon flux values at different frequencies correspond to a single ionizing star of O9.5V spectral type \\citep{martins05}, \nwhich is also in agreement with the previously reported spectral type of the ionizing source of the complex \\citep[e.g.][]{georgelin73}.  \n\nThe different pressure components ($P_{HII}$, P$_{rad}$, and P$_{wind}$; as mentioned above) are defined as below \\citep[e.g.][]{bressert12}:\n\n", "index": 9, "text": "\\begin{equation}\nP_{HII} = \\mu m_{H} c_{s}^2\\, \\left(\\sqrt{3N_{uv}\\over 4\\pi\\,\\alpha_{B}\\, D_{s}^3}\\right);\\\\ \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"P_{HII}=\\mu m_{H}c_{s}^{2}\\,\\left(\\sqrt{3N_{uv}\\over 4\\pi\\,\\alpha_{B}\\,D_{s}^{%&#10;3}}\\right);\\\\&#10;\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>H</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow></msub><mo>=</mo><mrow><mi>μ</mi><mo>⁢</mo><msub><mi>m</mi><mi>H</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msubsup><mi>c</mi><mi>s</mi><mn>2</mn></msubsup></mpadded><mo>⁢</mo><mrow><mo>(</mo><msqrt><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>N</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mrow><mn>4</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>α</mi><mi>B</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>D</mi><mi>s</mi><mn>3</mn></msubsup></mrow></mfrac></msqrt><mo>)</mo></mrow></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 40977, "prevtext": "\n\n\n", "index": 11, "text": "\\begin{equation}\nP_{rad} = L_{bol}/ 4\\pi c D_{s}^2; \\\\ \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"P_{rad}=L_{bol}/4\\pi cD_{s}^{2};\\\\&#10;\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>=</mo><mrow><mrow><msub><mi>L</mi><mrow><mi>b</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>/</mo><mn>4</mn></mrow><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><msubsup><mi>D</mi><mi>s</mi><mn>2</mn></msubsup></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\nIn the equations above, N$_{uv}$, $\\mu$, and m$_{H}$ are defined earlier, the radiative recombination \ncoefficient is ``$\\alpha_{B}$'' \\citep[=  2.6 $\\times$ 10$^{-13}$ $\\times$ (10$^{4}$ K/T$_{e}$)$^{0.7}$ cm$^{3}$ s$^{-1}$; see][]{kwan97}, \nc$_{s}$ is the sound speed in the photo-ionized region (= 10 km s$^{-1}$), $\\dot{M}_{w}$ is the mass-loss rate, \nV$_{w}$ is the wind velocity of the ionizing source,  L$_{bol}$ is the bolometric luminosity of the complex, and \nD$_{s}$ is the projected distance from the location of the O9.5V type star to the subregions \nwhere the pressure components are estimated. \nOne can infer from equations 5, 6, and 7 that the pressures, P$_{rad}$ and P$_{wind}$, \nscale as $D_{s}^{-2}$ while P$_{HII}$ scales as $D_{s}^{-3/2}$.\\\\ \n\nNote that the highlighted subregions are not located at the same projected distance from \nthe location of a massive star (see Figures~\\ref{fig2a} and~\\ref{fig3a}). \nTherefore, we compute the pressure components driven by a massive star (i.e., $P_{HII}$,  P$_{rad}$, and P$_{wind}$) \nat D$_{s}$ = 3.4 pc (East~1), 3.0 pc (East~2), 1.5 pc (Central~E), 2.6 pc (North), 2.7 pc (North-West), 1.9 pc (Central~W), and 3.0 pc (South-West) (see Figures~\\ref{fig2a} and~\\ref{fig3a}). \n\n\\citet{evans81a} estimated a total gas mass of the S235 cloud to be about 3000 $M_\\odot$ in a radius of 3 pc. \n\\citet{nordh84} computed a total luminosity of S235 of $\\sim$8 $\\times$ 10$^{4}$ L$_{\\odot}$.\nWe use $M_{cloud}$ $\\approx$ 3000 $M_\\odot$, R$_{c}$ $\\approx$ 3.0 pc, $L_{bol}$ $\\approx$ 8 $\\times$ 10$^{4}$ L$_{\\odot}$, \n$\\dot{M}_{w}$ $\\approx$ 1.58 $\\times$ 10$^{-9}$ M$_{\\odot}$ yr$^{-1}$ \\citep[for O9.5V star;][]{marcolino09}, \nV$_{w}$ $\\approx$ 1500 km s$^{-1}$ \\citep[for O9.5V star;][]{marcolino09} in the above equations to compute the pressure contributions \ndriven by a massive star on different subregions (see the list in Table~\\ref{tab4}). \nThe error associated with each pressure component related to each subregion is also given in Table~\\ref{tab4}.  \nIn the S235 complex, we find that the pressure of the H\\,{\\sc ii} region exceeds the radiation pressure and the \nstellar wind pressure (see Table~\\ref{tab4}).  \nThe total pressure (P$_{total}$ = P$_{HII}$ + $P_{rad}$ + P$_{wind}$) driven by a massive star on each subregion is also tabulated in \nTable~\\ref{tab4}, which is found to be $\\sim$10$^{-10}$ dynes cm$^{-2}$ for each subregion.\n\nAdditionally, pressure exerted by the self-gravity of the surrounding molecular gas is also estimated using the relation \\citep[e.g.][]{harper09}:\n\n", "itemtype": "equation", "pos": 41049, "prevtext": "\n\n\n", "index": 13, "text": "\\begin{equation}\nP_{wind} = \\dot{M}_{w} V_{w} / 4 \\pi D_{s}^2; \\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"P_{wind}=\\dot{M}_{w}V_{w}/4\\pi D_{s}^{2};\\\\&#10;\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>w</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>=</mo><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mi>w</mi></msub><mo>⁢</mo><msub><mi>V</mi><mi>w</mi></msub></mrow><mo>/</mo><mn>4</mn></mrow><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>D</mi><mi>s</mi><mn>2</mn></msubsup></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.04488.tex", "nexttext": "\n\\noindent where $\\Sigma$ $(= M_{cloud}/\\pi R_{c}^2)$ is the mean mass surface density of the cloud, \nM$_{cloud}$ is the mass of the molecular gas, and R$_{c}$ is the radius of the molecular region. \nThe value of $P_{cloud}$ for the entire cloud is estimated to be $\\sim$(1.0$\\pm$0.5) $\\times$ 10$^{-10}$ dynes cm$^{-2}$. \nThe values of $P_{cloud}$ associated with different subregions are also found to be $\\sim$0.1--3.0 $\\times$10$^{-10}$ dynes \ncm$^{-2}$ (see Table~\\ref{tab1} and Figure~\\ref{fig2a}a). \nIn subregions, we find P$_{total}$ $\\gtrsim$ $P_{cloud}$ (see Table~\\ref{tab4}). \nThis argument is still valid if we put all the subregions at the same projected distance \n(i.e. D$_{s}$ = 3.0 pc; see pressure calculations related to East~2 in Table~\\ref{tab4}). \nAdditionally, the $P_{cloud}$ is relatively higher than the pressure associated with a typical cool molecular cloud \n($\\sim$10$^{-11}$ -- 10$^{-12}$ dynes cm$^{-2}$ for a temperature $\\sim$20 K and the particle density $\\sim$10$^{3}$--10$^{4}$ cm$^{-3}$) \n\\citep[see Table 7.3 of][]{dyson80}. \nConsidering the pressure value associated with a typical cool molecular cloud, \nwe infer that an additional physical process has been acted to compress the surrounding molecular gas \nto enhance the pressure in the complex. \nConsequently, this process may stimulate the initial collapse and fragmentation of the extended molecular cloud.  \nThe pressure calculations indicate that the photoionized gas can be considered as the \nimportant contributor for the feedback mechanism in the S235 complex.\n\n\\subsection{Young stellar objects in S235}\n\n\\subsubsection{Identification of young stellar objects}\n\\label{subsec:phot1}\nA population of YSOs can be identified using NIR and MIR color schemes as utilized by many authors \n\\citep[e.g.][]{allen04,lada06,gutermuth09}. In Paper~I, we identified YSOs using only IRAC data. \nIn the present work, we also employed the UKIDSS-GPS NIR data, in combination with IRAC data for finding more deeply embedded \nand faint sources. Note that the UKIDSS-GPS NIR data are three magnitudes deeper than 2MASS. \nHere, we describe the procedure of YSOs identification and classification using photometric IRAC and GPS data.\\\\\n\n\n1. We selected sources having detections in all four {\\it Spitzer}-IRAC \nbands, which were taken from Paper~I. \nWe found 131 YSOs (52 Class~I and 79 Class~II), 4 Class~III, 133 photospheres, \nand 38 contaminants in our selected region shown in Figure~\\ref{fig1a}a. \nThe details of YSOs classification can be found in Paper~I. Figure~\\ref{fig16}a displays the different selected sources. \nIn Figure~\\ref{fig16}a, we show Class~I YSOs (red circles), Class~II YSOs (open blue triangles), \nClass~III YSOs (black squares), photospheric emissions (gray dots), and \nPAH-emission-contaminated apertures (magenta multiplication symbols). \\\\ \n\n2. Then, we considered sources lacking detections in two longer \nwavelengths of IRAC bands (5.8 and 8.0 $\\mu$m). \nFor such sources, GPS-IRAC (H, K, 3.6, and 4.5 $\\mu$m) classification scheme was utilized, as described in details by \n\\citet{gutermuth09}. In this method, the dereddened color-color space ([K$-$[3.6]]$_{0}$ and [[3.6]$-$[4.5]]$_{0}$) was used to identify infrared-excess sources.\nThese dereddened colors were computed using the color excess ratios given in \\citet{flaherty07}. \nThis scheme also offered to identify possible dim extragalactic contaminants from YSOs with additional conditions (i.e., [3.6]$_{0}$ $<$ 15 mag for Class~I and [3.6]$_{0}$ $<$ 14.5 mag for Class~II). \nWe used the observed color and the reddening law \\citep[from][]{flaherty07} to compute the dereddened 3.6 $\\mu$m magnitudes. \nIn the end, 16 Class~I and 133 Class~II YSOs are obtained using GPS-IRAC data (see Figure~\\ref{fig16}b). \\\\\n\n3. NIR color-color diagram (H$-$K vs J$-$H) is a very useful tool to select infrared-excess sources. \nWe applied this scheme for sources, having detections in all the three JHK bands. \nFigure~\\ref{fig16}c shows a NIR color-color diagram of such sources. \nThe reddening lines are drawn using the extinction law of \\citet{indebetouw05}. \nThe color-color diagram is divided into three different regions, namely ``I'', ``II'', and ``III''.  One can find more details about \nNIR YSOs classification in \\citet{sugitani02} and \\citet{dewangan12}.  \nThe sources distributed in the ``I'' region represent the likely Class~I objects (protostellar objects). \nT Tauri-like sources (Class~II objects) are identified within the ``II'' region along the T Tauri locus with large NIR excess. \nThe sources that fall between the reddening bands of the main-sequence and giant stars are located in the ``III'' region. \nWith this method, we obtain 5 Class~I and 96 Class~II sources (see Figure~\\ref{fig16}c). \\\\ \n\n4. Finally, we considered sources (significant in number) that have detections only in the  H and K bands. \nIn order to further identify infrared excess sources from such sample, we utilized a color-magnitude (H$-$K/K) diagram (see Figure~\\ref{fig16}d). \nThe diagram allows to select red sources having H$-$K $>$ 1.04. \nThe color-magnitude analysis of the nearby control field allowed us to infer this color criterion. \nThis condition provides us 54 additional deeply embedded infrared excess sources.\\\\\n\nRecently, \\citet{chavarria14} also presented photometry of the entire extended star-forming S235 region (including S235AB region) using NIR and {\\it Spitzer} data. \nThese authors obtained K-band observations using the 2.1-m telescope located at Kitt Peak National Observatory. \nAdditionally, they observed J and H bands using the 6.5-m Multiple Mirror Telescope (MMT) telescope located at Fred Lawrence Whipple Observatory. \nThey identified 690 YSOs in the entire S235 complex. However, they did not separate the contaminations in their analysis. \nAdditionally, they did not provide the positions of their identified YSOs. Therefore, a comparison of our selected YSOs to the sources identified by \n\\citet{chavarria14} cannot be  thoroughly performed in this work (see Figure~\\ref{fig17} in this work and Figure B2 in \\citet{chavarria14}). \nIn our YSOs analysis, we have carefully separated the contaminations from YSO populations. \nAs a result of the four schemes explained above, a total of 435 YSOs are yielded in the complex (S235AB region is not included). \nThe positions of all YSOs are shown in Figure~\\ref{fig17}. \n\n\n\\subsubsection{Spatial distribution of YSOs}\n\\label{subsec:surfden}\nIn recent years, the surface density of young stellar populations in star-forming regions has been adopted to identify \nand to study the young stellar clusters \\citep[e.g.][]{gutermuth09,bressert10}. In Paper~I, the surface density map of YSOs was \ncomputed using the nearest-neighbour (NN) technique \\citep[also see][for more details]{gutermuth09,bressert10}. \nHere, we also followed the same procedure and generated the surface density map of all the selected 435 YSOs.\nThe map was created using a 5$\\arcsec$ grid and 6 NN at a distance of 1.8 kpc. \nFigure~\\ref{fig17} shows the resultant surface density contours of YSOs overlaid on the extinction map.\nThe contour levels are shown at 10, 20, 40, and 70 YSOs/pc$^{2}$, increasing from the outer to the inner regions. \nThe figure clearly illustrates the spatial correlation between YSOs surface density and extinction. \n\nThe surface density analysis allows to trace the individual groups or clusters of YSOs. \nNow, we want to identify the clustered populations from distributed sources. \nHowever, there is no unique method to find a cutoff distance for tracing these two populations.  \nStatistical analysis, such as empirical cumulative distribution (ECD) of YSOs as a \nfunction of NN distance, is often studied to infer the clustered YSO populations in \nstar-forming regions \\citep[see][for more details]{chavarria08,gutermuth09,dewangan11}. \nIn the ECD analysis, a cutoff length (also referred as the distance of inflection d$_{c}$) is chosen, to delineate the low-density/distributed populations. \nFor the present case, we selected a cutoff distance of d$_{c}$ $\\sim$52$\\arcsec$ (0.45 pc at a distance of 1.8 kpc), \nwhich separates the cluster members within the contour level of 10 YSOs/pc$^{2}$. \nSuch cutoff distance has been determined for different star-forming regions, \nsuch as the Diamond Ring region in the Cygnus-X star-forming complex \\citep[d$_{c}$ $\\sim$61$\\arcsec$ or 0.43 pc at 1450 pc;][]{beerer10}, \nthe Cygnus-OB2 region in the Cygnus-X complex \\citep[d$_{c}$ $\\sim$72$\\arcsec$ or 0.51 pc;][]{guarcello13}, and the W5 star-forming region \n\\citep[d$_{c}$ $\\sim$33$\\arcsec$ or 0.32 pc at 2 kpc;][]{chavarria14}. \nThe comparison of d$_{c}$ values suggests that W5 is more densely populated with YSOs compared to Cygnus-X. \nIn general, the value of d$_{c}$ offers to infer the most densely YSOs populated star-forming regions. \nThe ECD analysis yielded a clustered fraction of about 59\\% YSOs (i.e. 258 from a total of 435 YSOs). \nThe YSO clusters are mainly distributed in East~1, East~2, Central~E, Central~W, North-West, South, and South-West subregions. \nIn Central~E and East~1 subregions, we found the highest level of surface density contours. \nNorth subregion is not associated with any YSO cluster; however, it contains a few Class~II YSOs. \nThe clustered and scattered YSO locations are identified in Figure~\\ref{fig17} by filled and open symbols, respectively.\n\n\nWe also constructed separately the surface density contour maps of Class~I \nand Class~II YSOs, using the same algorithm as explained above.  \nThe surface density contour maps of Class~I and Class~II YSOs are shown in Figure~\\ref{fig18}a. \nThe surface density of Class~I YSOs lies between 0.04 and 42.75 YSOs/pc$^{2}$ with a dispersion ($\\sigma$) of 2.64 \nand is shown by contour levels of 5, 8, 10, and 20 YSOs/pc$^{2}$. \nSimilarly, the surface density of Class~II YSOs is found to lie between 0.17 and 174 YSOs/pc$^{2}$, with a dispersion of 6.62 \nand is drawn at contour levels of 10, 20, and 40 YSOs/pc$^{2}$. \nAll the Class~I and Class~II YSO clusters are exclusively found in the regions with A$_{V} > 8$ mag.\nThe Class~I YSO clusters are traced in East~1, East~2, Central~E, South, and South-West subregions (see Figure~\\ref{fig18}a). \n\n\\section{Discussion}\n\\label{sec:disc}\n\\subsection{Expanding H\\,{\\sc ii} region}\n\\label{subsec:phyp}\n\nOne of the important results of the present work is the identification of \nan almost semi-ring-like or C-like structure in the p-v plots, \nwhich is similar to the one observed in Orion nebula \\citep[see Figure~10b in][]{wilson05} and to that in W42 \\citep[see Figure~8 in][]{dewangan15b}. \n\\citet{arce11} also studied such observed structures in Perseus molecular \ncloud along with the modeling of expanding bubbles in a turbulent medium. \nThese authors suggested that the semi-ring-like or C-like structure in the p-v plots is the signature of an expanding shell.\nThey also mentioned that the ring-like morphology can be seen in the p-v plot when the powerful ionizing source is \nsituated at the center of the region.\nAdditionally, the NH$_{3}$ radial velocity observed in Central~E subregion exhibits a linear trend as one moves away from the location of a massive star.\nThe analysis of pressure contributions driven by a massive star (i.e., P$_{HII}$, P$_{rad}$, and P$_{wind}$) \nindicates that the P$_{HII}$ value is higher than the other pressure components. \nTherefore, it seems that the C-like structure in the p-v plots corresponds to the expanding H\\,{\\sc ii} region excited by the O9.5V star at \nthe center of the sphere-like shell. Negative feedback of the O9.5V star is also evident by the presence of a \ncavity (i.e. empty of molecular CO gas region) between North and North-West subregions. \nPreviously, \\citet{evans81a} also suggested that the S235 molecular cloud is heated \nby the exciting star. All these observed features suggest the impact of ionizing photons on \nthe low density regions in the complex, through which the ionized gas might have escaped. \n\n\\subsection{Morphology and signposts of star formation}\n\\label{subsec:signp}\n\nThe NIR extinction map of the S235 complex provides a more complete picture of the spatial distribution of embedded subregions.\nThere are eight subregions which are well correlated with the locations of the dust clumps, CO gas, and YSOs.\nFive of these subregions (i.e. Central~E, East~2, North, North-West, and Central~W) appear to be nearly \nregularly spaced along the sphere-like shell surrounding the ionized emission. \\citet{deharveng03} also reported similar configuration in Sh~104 \nregion that was classified as a site of triggered star formation.\nFurthermore, three subregions (i.e. East~1, South, and South-West) in the S235 complex are spatially away from the sphere-like shell. \nThe presence of H$_{2}$ and PAH emissions at the boundaries of the sphere-like shell indicates the presence \nof PDR surrounding the ionized emission (see Figure~\\ref{fig4ua}). \nIn the present work, we investigated more number of YSOs using GPS, in addition to IRAC data, compared to Paper~I.  \nThe YSO clusters are found in all the subregions except North, where only Class~II YSOs are seen without any clustering.\nAdditionally, the clusters of Class~I YSOs are associated with Central~E, East~1, East~2, South, \nand South-West subregions. \nThe molecular data also revealed outflow signatures in  the Central~E, East~1, East~2, and North-West subregions. \nWe find the probable outflow driving candidate (i.e. Class~I YSO) in each subregion.  \nAll together, the early stages of star formation activity are evident in all the eight subregions.\n\nConcerning the molecular gas distribution toward the South and South-West subregions (see Figure~\\ref{fig7}), \nwe suggest that these two subregions seem to be located at the interface between the S235 \nmolecular cloud ($-$23 km~s$^{-1}$ $< V_{lsr} < -$18 km~s$^{-1}$) \nand the S235AB molecular cloud ($-$17 km~s$^{-1}$ $< V_{lsr} < -$15 km~s$^{-1}$). \nAs previously also reported by \\citet{evans81a}, the extended star-forming region S235 is comprised of two velocity components \nat $-$20 and $-$17 km s$^{-1}$. The velocity information suggests that the molecular gas associated with S235AB region is red-shifted with respect to \nthe S235 molecular cloud. In the integrated $^{12}$CO map, some molecular gas is seen toward the South and South-West subregions (see Figure~\\ref{fig8}a), \nhowever the molecular gas is absent there in the integrated $^{13}$CO map (see Figure~\\ref{fig8}b). \nAdditionally, A$_{V}$ value is found significant there (see Figure~\\ref{fig2a}a). \nFurthermore, the molecular gas is noticeably traced toward these subregions in \na velocity range $-$17 km~s$^{-1}$ to $-$15 km~s$^{-1}$ (see Figure~\\ref{fig7}). \nIn Figures~\\ref{fig19a}a and~\\ref{fig19a}b, we present the distribution of molecular gas toward the \n``S235 complex\" and the ``S235AB region\". \nThe CO map is integrated in the [-25,-15] km s$^{-1}$ velocity range (see Figure~\\ref{fig19a}a). \nIn Figure~\\ref{fig19a}b, the p-v plot of $^{13}$CO gas reveals an almost broad bridge feature. \nThe p-v plot shows that two peaks (a red shifted and a blue shifted; as mentioned above) are separated by \nlower intensity intermediated velocity emission.\nThe presence of such broad bridge feature in the p-v plot might indicate the signature of a collision between two clouds \n\\citep[e.g.][]{haworth15a,haworth15b}. \nTherefore, there is a possibility of the formation of YSO clusters associated with \nSouth and South-West subregions by the interaction between these two clouds. \nIn the present work, our analysis is mainly focused on the S235 complex, therefore the results related to \nthe S235AB region are not presented in this work. \nHence, a detailed investigation of the interaction between these two clouds is beyond the scope of present work. \nIt is important to note that the broad bridge feature is not seen in the p-v maps of ``S235 complex\" \n(see Figure~\\ref{fig9}), suggesting the applicability of cloud-cloud collision scenario is unlikely in the S235 complex. \nHence, we rule out the cloud-cloud collision process within the S235 complex.\n\n\\subsection{Triggered star formation}\n\\label{subsec:signp1}\nIn Section~\\ref{subsec:feed}, we showed that the total pressure driven by a massive star is in \nequilibrium with the pressure exerted by the self-gravitating molecular cloud. \nIn Section~\\ref{subsec:phyp}, we discussed that the signature of the expanding H\\,{\\sc ii} region is evident. \nAdditionally, we inferred that the densest subregions (i.e. East~1, East~2, and Central~E)  traced by \nNH$_{3}$ data are supersonic (see Section~\\ref{subsec:amonia}). We also pointed out that the observed higher velocity dispersions  \ncould be due to the presence of outflows in the subregions. \n\\citet{morgan10} studied 44 bright-rimmed clouds (BRCs) using NH$_{3}$ data and \nfound that the potentially triggered samples of BRCs are associated with higher velocity\ndispersions compared to non-triggered sources.  \nIn their samples, non-triggered sources were largely subsonic, whereas the triggered samples of BRCs were supersonic. \nThese results indicate that the S235 complex could be a site of triggered star formation. \nThis interpretation is further supported by the observed configuration as traced in the extinction map, \ndust continuum emission, molecular gas, ionized emission, and distribution of YSOs. \nTherefore, the on-going star formation in the S235 complex may have been influenced by the expanding H\\,{\\sc ii} region. \n\nTheoretically, there are two main scenarios discussed in the literature which explain the triggered star formation \nby the expansion of the H\\,{\\sc ii} region \\citep{elmegreen98,deharveng05}: ``collect and collapse\" \n\\citep[see][]{elmegreen77,whitworth94,dale07} and radiation-driven implosion \\citep[RDI; see][]{bertoldi89,lefloch94}. \nIn the ``collect and collapse\" scenario, massive and dense shell of cool neutral material can be accumulated \naround an expanding H\\,{\\sc ii} region, and star formation occurs when this material becomes gravitationally unstable. \nIn the RDI model, the expanding H\\,{\\sc ii} region causes the instability and aids in the collapse of \na pre-existing dense clump in the molecular cloud. \n\\citet{kirsanova14} utilized NH$_{3}$ line data and suggested that the subregions (i.e. S235 East~2 and S235 Central) were formed via triggering by a ``collect-and-collapse\" process. Furthermore, they suggested that S235 East~1 region was formed as a result of an interaction of the shock front from S235 complex  with a pre-existing dense clump.\n\nIn the present work, Bolocam data analysis revealed that the clump masses grow as one goes away from the location of the ionizing star. \nThis pattern is observed only for those clumps which are located near the edges of the sphere-like \nshell (e.g. Central~E, East~2, North, and North-West subregions). \nIt seems that the material has been collected on the edges of the sphere-like shell by the expanding H\\,{\\sc ii} region (also see Figure~\\ref{fig2a}a), \nsuggesting the ``collect and collapse\" scenario applicable in the complex. \nIn order to check the ``collect and collapse\" process as triggering mechanism, \nwe calculated the dynamical age (t$_{dyn}$) of the H\\,{\\sc ii} region and the fragmentation time scale (t$_{frag}$) \nfollowing the equations given in \\citet{dyson80} and \\citet{whitworth94}, respectively. \nOne can find more details of similar analysis in \\citet{dewangan12}. \nThe condition for the ``collect and collapse\" process is t$_{dyn}$ $\\geq$ t$_{frag}$. \nTo find the values of ambient density (n$_{0}$=) for t$_{dyn}$ $\\geq$ t$_{frag}$ condition, \nthe diagram of t$_{frag}$ and t$_{dyn}$ as a function of ``n$_{0}$\" is shown in Figure~\\ref{fig19a}c.\nThe t$_{frag}$ is estimated for different ``a$_{s}$\" values of 0.2, 0.3, and 0.4 km s$^{-1}$ (see Section~\\ref{subsec:amonia} for ``a$_{s}$\" estimation). \n\nHere, we use N$_{uv}$ = 4.9 $\\times$ 10$^{47}$ s$^{-1}$ (see Section~\\ref{subsec:feed}) for the \nentire radio emission of the region (spatial extent $\\sim$6$\\farcm$40 or 3.35 pc) \nand $\\alpha_{B}$ = 2.6 $\\times$ 10$^{-13}$ cm$^{3}$ s$^{-1}$ at T$_{e}$ = 10000 K. \nIf the condition ``t$_{dyn}$ $\\geq$ t$_{frag}$\" is satisfied then the values of ``n$_{0}$\" should be greater than 5750, 7700, and 9240 cm$^{-3}$ \nfor different ``a$_{s}$\" values of 0.2, 0.3, and 0.4 km s$^{-1}$, respectively (see Figure~\\ref{fig19a}c). \nOn the other hand, if n$_{0}$ $<$ 5750 cm$^{-3}$, then the condition ``t$_{dyn}$ $\\geq$ t$_{frag}$\" is not fulfilled. \nConsequently, the fragmentation of the molecular materials into clumps will not occur due to the ``collect and collapse\" process in the complex.  \n\n\nUsing $^{13}$CO, NH$_{3}$, H$_{2}$CO, HCO$^{+}$, and HCN line data, \na significant density variation (i.e. 1 $\\times$ 10$^{3}$ -- 2 $\\times$ 10$^{4}$ cm$^{-3}$) has been reported \nin the S235 complex \\citep{evans81a,kirsanova14}. \\citet{nordh84} noted that the density structure of the S235 cloud is non-homogeneous with \nhigh density clumps engulfed in a medium with lower density. \n\\citet{kirsanova14} adopted the value of volume density of 7000 cm$^{-3}$ to compute the age of the S235 H\\,{\\sc ii} region. \nIn order to compare the previous results, following \\citet{kirsanova14}, we also adopt the same value of volume density (i.e. n$_{0}$ = 7000 cm$^{-3}$) in the present work. \nSubstituting N$_{uv}$, n$_{0}$, and an average radius of the H\\,{\\sc ii} region R $\\approx$ 1.67 pc, \nwe find t$_{dyn}$ $\\sim$1 Myr. Our estimated t$_{dyn}$ value is in agreement with the work of \\citet{kirsanova14}. \nThe t$_{frag}$ is computed to be about 0.85 Myr, 1.1 Myr, and 1.3 Myr, respectively, \nfor a$_{s}$ = 0.2, 0.3, and 0.4 km s$^{-1}$. \nWe find that the dynamical age of the H\\,{\\sc ii} region (t$_{dyn} \\approx $ 1 Myr) is comparable with the fragmentation \ntime scale (t$_{frag} \\approx $ 0.85--1.3 Myr) for n$_{0}$ = 7000 cm$^{-3}$ and a$_{s}$ = 0.2--0.4 km s$^{-1}$. \nIn general, the average ages of Class~I and Class~II YSOs are $\\sim$0.44 Myr and $\\sim$1--3 Myr \\citep{evans09}, respectively.  \nConsidering these ages, one can notice that the dynamical age of the H\\,{\\sc ii} region is comparable to the ages of YSOs. \nThese calculations suggest that the molecular materials have been fragmented into several condensations around the sphere-like shell \n(also see Figure~\\ref{fig17}). \nTherefore, the ``collect and collapse\" scenario seems to be applicable in the S235 complex, which could be responsible for the origin of Central~E, \nEast~2, North, North-West, and Central~W subregions. \n\nNote that East~1 subregion is far away from the sphere-like shell and is the most massive clump in the complex. \nAdditionally, this subregion is separated by the eastern emission wall from the sphere-like shell and is in pressure equilibrium \nand is associated with Class~I and Class~II YSO clusters. \nThis subregion is considered as the youngest star-forming site in the complex \\citep[see][]{kirsanova14} and is supersonic. \nTherefore, it seems that the YSO clusters in East~1 subregion could be originated by \ncompression of the pre-existing dense material by the expanding H\\,{\\sc ii} region through the RDI process. \n\n\n\\section{Summary and Conclusions}\n\\label{sec:conc}\nIn this paper, we have made an extensive investigation of the S235 complex using the multi-wavelength data covering radio through NIR wavelengths. \nThe results obtained in this work are based on the study of ionized emission, molecular emission, cold dust emission, \nembedded young populations, and various physical calculations. \nThe important findings of this work are as follows:\\\\\n$\\bullet$ The most prominent structure in the S235 complex is the sphere-like shell morphology, \nas traced at wavelengths longer than 2 $\\mu$m.\\\\ \n$\\bullet$ The distribution of ionized emission observed in the GMRT 610 MHz and NVSS 1.4 GHz continuum maps is \nalmost spherical. \nThe ionizing photon flux values estimated at both the frequencies correspond to a single ionizing star of O9.5V spectral type. \nThe location of the counterpart of this ionizing star (i.e. BD +35$^{o}$1201) appears at the \npeak of radio continuum emissions as well as approximately at the center of the sphere-like shell.\\\\\n$\\bullet$ The NIR extinction map depicts eight subregions (East~1, East~2, North, North-West, Central~W, Central~E, \nSouth-West, and South; having A$_{V}$ $>$ 8 mag), and five of them seem to be located in an almost \nregularly spaced manner along the sphere-like shell surrounding the ionized emission.\\\\ \n$\\bullet$ Bolocam dust continuum emission at 1.1 mm is found toward all the eight subregions \nand provides more insight of the dense and cold regions of the S235 complex, which is lacking \nin the published sub-mm maps in the literature.\\\\ \n$\\bullet$ Bolocam clump masses increase as one moves away from the location of the ionizing star.\nThis characteristic is found only for those clumps which are located near the edges of the shell.\\\\ \n$\\bullet$ The position-velocity analysis of $^{12}$CO and $^{13}$CO emissions depicts an almost \nsemi-ring like structure, indicating the signature of an expanding H\\,{\\sc ii} region.\\\\ \n$\\bullet$ The pressure calculations (P$_{HII}$, $P_{rad}$, and P$_{wind}$) indicate that the photoionized gas associated with the S235 H\\,{\\sc ii} \nregion can be considered as the major contributor for the feedback mechanism in the S235 complex.\\\\ \n$\\bullet$ A cavity of empty molecular gas is investigated between North and North-West subregions, \nillustrating the interaction between the ionized gas  and the molecular gas.\\\\\n$\\bullet$ The mean values of Mach numbers inferred using NH$_{3}$ line data \nfor three out of eight subregions (East~1, East~2, and Central~E) are 2.9, 2.3, and 2.9, suggesting \nthese subregions are supersonic.\\\\ \n$\\bullet$ The molecular outflows are evident in East~1, East~2, and Central~E subregions.\\\\ \n$\\bullet$ The analysis of UKIDSS-NIR and {\\it Spitzer}-IRAC photometry reveals \na total of 435 YSOs, $\\sim$59\\% of which are found in clusters associated with the molecular cloud. \\\\\n$\\bullet$ In six subregions (including five located near the edges of the shell), the YSOs clusters are very well \nspatially correlated with the extinction, dust continuum emission, and molecular gas surrounding the ionized emission.\\\\\n$\\bullet$ The observed configuration as traced in the extinction map, dust continuum emission, molecular gas, \nionized emission, and distribution of YSOs favours the triggered star formation in the S235 complex.\\\\  \n$\\bullet$ The dynamical age of the S235 H\\,{\\sc ii} region (t$_{dyn} \\approx $ 1 Myr) is comparable with the fragmentation \ntime scale (t$_{frag} \\approx $ 0.85--1.3 Myr) of accumulated gas layers for ambient density (n$_{0}$) = 7000 cm$^{-3}$ and \nsound speed (a$_{s}$) = 0.2--0.4 km s$^{-1}$. \\\\\n\nConsidering all the observational evidences presented in this work, \nwe conclude that the S235 complex can be considered as a promising nearby site of triggered star formation \nwhere both ``collect and collapse\" and RDI processes seem to be applicable. \nAdditionally, the star formation activity at the interface between the \nS235 molecular cloud and the S235AB molecular cloud due to the cloud-cloud collision appears likely.\n\n\n\\acknowledgments\nWe thank the anonymous referee for providing useful comments, which greatly improved the scientific contents of the paper. \nLKD acknowledges the financial support provided by the FCT (Portugal) grant SFRH/BPD/79741/2011 and \nthe CONACYT(M\\'{e}xico) grant CB-2010-01-155142-G3. AL acknowledges the CONACYT(M\\'{e}xico) grant CB-2012-01-1828-41.\nThis work is based on data obtained as part of the UKIRT Infrared Deep Sky Survey. \nThis publication made use of data products from the Two Micron All Sky Survey (a joint project of the University of Massachusetts and \nthe Infrared Processing and Analysis Center / California Institute of Technology, funded by NASA and NSF), archival \ndata obtained with the {\\it Spitzer} Space Telescope (operated by the Jet Propulsion Laboratory, California Institute \nof Technology under a contract with NASA). \nThe Canadian Galactic Plane Survey (CGPS) is a Canadian project with international partners. \nThe Dominion Radio Astrophysical Observatory is operated as a national facility by the \nNational Research Council of Canada. The Five College Radio Astronomy Observatory \nCO Survey of the Outer Galaxy was supported by NSF grant AST 94-20159. The CGPS is \nsupported by a grant from the Natural Sciences and Engineering Research Council of Canada. \nWe thank F. Navarete for providing the narrow-band H$_{2}$ image through the survey of \nextended H$_{2}$ emission from massive YSOs. \nWe thank M.~S.~N. Kumar for initial discussion on the near-infrared data. \n\n\n\\begin{figure*}\n\n\\epsscale{0.62}\n\\plotone{f1.pdf}\n\n\\caption{\\scriptsize MIR and NIR emissions toward the S235 complex (size of the selected \nfield $\\sim 17$\\farcm$6 \\times 15$\\farcm$5$ (or 9.2 pc $\\times$ 8.1 pc); \ncentered at $\\alpha_{2000}$ = 05$^{h}$ 40$^{m}$ 57.8$^{s}$, \n$\\delta_{2000}$ = +35$\\degr$ 51$\\arcmin$ 13$\\arcsec$). \na) The image is the result of the combination of three bands: 24 $\\mu$m in red (MIPS), 12.0 $\\mu$m in \ngreen (WISE), and 8.0 $\\mu$m in blue (IRAC).\nContours of NVSS 1.4 GHz radio continuum emission (beam size $\\sim$45$\\arcsec$) are superimposed with 5, 10, 25, 40, 55, 70, 85, and 98\\% of \nthe peak value (i.e., 0.124 Jy/beam).  The big circle highlights a sphere-like shell morphology seen in {\\it Spitzer} images. \nA nebular emission is designated as eastern emission wall (see Section~\\ref{subsec:mir} for more details). \nb) Color-composite map using {\\it Spitzer} MIPS 24 $\\mu$m (red), IRAC 4.5 $\\mu$m (green), and \nUKIDSS K (blue) images. \nGMRT 610 MHz radio continuum contours (beam size $\\sim$48$\\arcsec$ $\\times$ 44\\farcs2) are drawn \nin white color with levels of 5, 10, 25, 40, 55, 70, 85, and 98\\% of the peak value (i.e., 0.158 Jy/beam). \nDifferent subregions are also labeled in the map (see text for more details). \nIn both the panels, the positions of two bright sources (IRS 1 and IRS 2) and an O9.5V star (BD+35$^{\\degr}$1201) are marked with diamond and \nstar symbols, respectively. \nThe scale bar on the top left shows a size of 1 pc at a distance of 1.8 kpc in both the figures.}\n\\label{fig1a}\n\\end{figure*}\n\n\\begin{figure*}\n\n\\epsscale{0.68}\n\\plotone{f2.pdf}\n\n\\caption{\\scriptsize a) Visual extinction map of the S235 complex obtained using the NIR data. \nb) Contour map of Bolocam 1.1 mm dust continuum emission (beam size $\\sim$33$\\arcsec$).\nThe contour levels are 8, 15, 20, 30, 40, 55, 70, 85, and 95\\% of the peak value i.e. 1.2 Jy/beam.\nThe positions of previously observed NH$_{3}$ line observations in East~1 (x), East~2 (*), \nand Central~E ($\\diamond$) subregions are marked (see text for details and also Table~\\ref{tab3}). \nThe positions of dust clumps at 1.1 mm are marked by yellow square symbols in both the \npanels and are labeled in panel ``a\" (see Table~\\ref{tab1}).\nIn both the panels, other marked symbols and labels are similar to those shown in Figure~\\ref{fig1a}.}\n\\label{fig2a}\n\\end{figure*}\n\n\\begin{figure*}\n\n\\epsscale{1.0}\n\\plotone{f3.pdf}\n\n\\caption{\\scriptsize The distribution of clump masses (estimated using Bolocam 1.1 mm data) with respect to the location of an O9.5V star (D$_{s}$). \nFilled circles show the clumps distributed near the edges of the sphere-like shell \n(i.e. Central~E, East~2, North, and North-West subregions; see Figure~\\ref{fig2a} and Table~\\ref{tab1}).}\n\\label{fig3a}\n\\end{figure*}\n\n\n\\begin{figure*}\n\n\\epsscale{1.0}\n\\plotone{f4.pdf}\n\n\\caption{\\scriptsize {\\it Spitzer}-IRAC ratio map of 4.5 $\\mu$m/3.6 $\\mu$m emission (similar area as shown in Figure~\\ref{fig1a}). \nThe area enclosed in the white circle shows artifact present in the map. The location of an O9.5V star (BD+35$^{\\degr}$1201) is \nmarked with a star. The diamond symbols indicate the possible outflow activities (see text for more details). \nAn arrow indicates the bright emission in the map, which probably traces the Br$\\alpha$ emission. \nNote that this bright emission is surrounded by black regions.\nThe dashed box is shown as a zoomed-in view in Figure~\\ref{fig5}. \nTwo bright sources (i.e. IRS~1 and IRS~2) have sidelobes therefore the features \naround these sources in the ratio map can not be considered for scientific interpretation. \nThe ratio map is subjected to median filtering with a width of 5 pixels and smoothened by \n4 pixel $\\times$ 4 pixel using a boxcar algorithm.}\n\\label{fig4ua}\n\\end{figure*}\n\n\n\\begin{figure*}\n\n\\epsscale{1.0}\n\\plotone{f5.pdf}\n\n\\caption{\\scriptsize CFHT continuum-subtracted H$_{2}$ map (gray-scale) at 2.12 $\\mu$m of the \nS235 complex (size of the region $\\sim$10$\\farcm$7 $\\times$ 9$\\farcm$9 or $\\sim$5.6 pc $\\times$ 5.2 pc), \nas shown by a dashed box in Figure~\\ref{fig4ua}. \nThe location of an O9.5V star (BD+35$^{\\degr}$1201) is marked with a star symbol. \nAn arrow in orange color is similar to the one shown in Figure~\\ref{fig4ua}. \nThe H$_{2}$ map is subjected to median filtering with a \nwidth of 3 pixels and smoothened by 3 pixel $\\times$ 3 pixel using a boxcar algorithm to enhance the faint features. \nThe dashed boxes are shown as a zoomed-in view in Figure~\\ref{fig6}. }\n\\label{fig5}\n\\end{figure*}\n\n\n\\begin{figure*}\n\n\\epsscale{1.0}\n\\plotone{f6.pdf}\n\n\\caption{\\scriptsize A comparison of H$_{2}$, 4.5 $\\mu$m, and 24 $\\mu$m images toward three \nsubregions (East~1, East~2, and Central-E) in the S235 complex \n(see dashed boxes in Figure~\\ref{fig5}). \nLeft panel: CFHT continuum-subtracted H$_{2}$ maps (log-scale) at 2.12 $\\mu$m. \nJet-like features and outflows are marked in the figures. \nThe H$_{2}$ maps are subjected to median filtering with a \nwidth of 3 pixels and smoothened by 3 pixel $\\times$ 3 pixel using a boxcar algorithm to enhance the faint features. \nMiddle panel: IRAC 4.5 $\\mu$m images (log-scale). \nRight panel: MIPS 24  $\\mu$m images (log-scale). The positions of the probable driving sources of outflows are shown by open \nsquares in both the middle and right panels. \nSources are also labeled in East~1 and East~2 subregions in the middle panel.}\n\\label{fig6}\n\\end{figure*}\n\n\\begin{figure*}\n\n\\epsscale{0.70}\n\\plotone{f7.pdf}\n\n\\caption{\\scriptsize The $^{13}$CO(J =1$-$0) velocity channel contour maps of the S235 complex. \nThe velocity value (in km s$^{-1}$) is indicated in each panel. \nThe contour levels are 10, 20, 40, 55, 70, 85, and 98\\% of the peak value (in K km s$^{-1}$), which is also given in each panel.  \nThe location of an O9.5V star is marked by a filled star. \nOther marked symbols and labels are similar to those shown in Figure~\\ref{fig2a}b.}\n\\label{fig7}\n\\end{figure*}\n\n\\begin{figure*}\n\\epsscale{0.73}\n\\plotone{f8.pdf}\n\n\\caption{\\scriptsize The contour maps of integrated $^{12}$CO and $^{13}$CO emissions in the velocity range of $-$23 to $-$18 km s$^{-1}$. \nThe contour levels are 10, 20, 40, 55, 70, 85, and 98\\% of the peak values \n(i.e. 11.566 K km s$^{-1}$ ($^{12}$CO) and 31.719 K km s$^{-1}$ ($^{13}$CO)).  \nIn the top panel, Bolocam 1.1 mm dust continuum \nemission contours are shown by dashed navy contours with similar levels to those as shown in Figure~\\ref{fig2a}b. \nIn both the panels, other marked symbols and labels are similar to those shown in Figure~\\ref{fig1a}.}\n\\label{fig8}\n\\end{figure*}\n\n\n\\begin{figure*}\n\n\\epsscale{1.0}\n\\plotone{f9.pdf}\n\n\\caption{\\scriptsize The position-velocity diagrams of $^{12}$CO (left) and $^{13}$CO (right).\n{\\bf Top Left:} Right Ascension-velocity map of $^{12}$CO. \nThe $^{12}$CO emission is integrated over the declination range from +35$\\degr$43$\\arcmin$30$\\arcsec$ (35$\\degr$.725) to \n+35$\\degr$59$\\arcmin$13$\\farcs$2 (35$\\degr$.987). \nThe lowest gray-scale level corresponds to $30\\sigma$ \n (where $1\\sigma$ = 0.01053 K degree), with successive levels increasing in steps of $30\\sigma$. \n {\\bf Bottom Left:} Declination-velocity map of $^{12}$CO. The $^{12}$CO emission is integrated over the \n right ascension range from 05$^{h}$41$^{m}$40$^{s}$.8 (85$\\degr$.42) to 05$^{h}$40$^{m}$12$^{s}$ (85$\\degr$.05). \n The lowest gray-scale level corresponds to $30\\sigma$ \n (where $1\\sigma$ = 0.011258 K degree), with successive levels increasing in steps of $30\\sigma$. \n{\\bf Top Right:} Right Ascension-velocity map of $^{13}$CO. \nThe $^{13}$CO emission is integrated over the declination range from +35$\\degr$43$\\arcmin$30$\\arcsec$ (35$\\degr$.725) to \n+35$\\degr$59$\\arcmin$13$\\farcs$2 (35$\\degr$.987). The lowest gray-scale level corresponds to $15\\sigma$ \n (where $1\\sigma$ = 0.005265 K degree), with successive levels increasing in steps of $15\\sigma$. \n{\\bf Bottom Right:} Declination-velocity map of $^{13}$CO. \nThe $^{13}$CO emission is integrated over the right ascension range from 05$^{h}$41$^{m}$40$^{s}$.8 (85$\\degr$.42) \nto 05$^{h}$40$^{m}$12$^{s}$ (85$\\degr$.05). The lowest gray-scale level corresponds to $15\\sigma$ \n (where $1\\sigma$ = 0.005629 K degree), with successive levels increasing in steps of $15\\sigma$. \nIn all the panels, a cyan dashed line shows the location of the ionizing star.}\n\\label{fig9}\n\\end{figure*}\n\n\\begin{figure*}\n\\epsscale{1.0}\n\\plotone{f10.pdf}\n\n\\caption{\\scriptsize Outflow signature in East~1 subregion. {\\bf Top Left:} \nA contour map of integrated $^{13}$CO emission in the velocity range of $-$23 to $-$17 km s$^{-1}$.  \nThe lowest gray-scale level represents $20\\sigma$, with successive levels \nincreasing in steps of $20\\sigma$. The channel RMS is 0.159 K km s$^{-1}$. \nThe solid box in East~1 subregion is shown as a zoomed-in view in bottom left panel. \nThe location of an O9.5V star is shown by a filled star. \n{\\bf Bottom Left:} The selected area of contour map (in black color) is highlighted by a box in top left panel. \nDifferent color contours show the receding gas ($-$18.5  to  $-$17.0~km\\,s$^{-1}$; red) \nand approaching gas ($-$20.5  to  $-$19.0~km\\,s$^{-1}$; blue) with respect to that at \nrest ($-$19.0  to  $-$18.5~km\\,s$^{-1}$; green). The spatial boundaries of these doppler components are shown in both the right panels. \n{\\bf Top Right:} Declination-velocity map. \n{\\bf Bottom Right:} Right Ascension-velocity map. \nIn both the right panels, the contours are similar to those shown in Figure~\\ref{fig9}.\nThe slices of receding, approaching, and rest gas are shown in red, blue, and green dashed boxes in both the right panels, respectively. \nThe position of the probable driving source of outflow ($\\alpha_{2000}$ = 05$^{h}$ 41$^{m}$ 29.5$^{s}$, \n$\\delta_{2000}$ = +35$\\degr$ 48$\\arcmin$ 58$\\farcs$7) is shown by an open circle in both the left panels. \nThe cyan dashed line represents the position of the probable driving source of outflow in both the right panels.} \n\\label{fig10} \n\\end{figure*}\n\n\\begin{figure*}\n\\epsscale{1.0}\n\\plotone{f11.pdf}\n\n\\caption{\\scriptsize a) Figure shows a variation of NH$_{3}$(1,1) radial velocity (V$_{lsr}$) in each subregion \nas a function of distance from the location of an O9.5V star (D$_{s}$) (see Figure~\\ref{fig2a}b and Table~\\ref{tab3}). \nb) Ratio of thermal to non-thermal gas pressure (P$_{TNT}$ = ${a^2_{s}}/{\\sigma^2_{NT}}$) vs. D$_{s}$ (see Table~\\ref{tab3}). \nThe low value of P$_{TNT}$ corresponds to the dominant term in the denominator (i.e. non-thermal velocity dispersion ($\\sigma_{NT}$)).} \n\\label{fig15} \n\\end{figure*}\n\n\\begin{figure*}\n\\epsscale{0.9}\n\\plotone{f12.pdf}\n\n\\caption{\\scriptsize a) {\\it Spitzer}-IRAC color-color diagram ([3.6]$-$[4.5] vs. [5.8]$-$[8.0]) \\citep[from][]{dewangan11}. \nThe ``$\\Box$'' and ``$\\times$'' symbols indicate the Class~III sources and identified PAH-emission-contaminated apertures, respectively; \nb) The dereddened [K$-$[3.6]]$_{0}$ $vs$ [[3.6]$-$[4.5]]$_{0}$ color-color diagram using GPS and IRAC data; \nc) NIR color-color diagram (H$-$K vs J$-$H). The solid curves show the unreddened \nlocus of main sequence stars (red) and giants (magenta) \\citep[from][]{bessell88}. \nClassical T Tauri (CTTS) locus (in California Institute of Technology (CIT) system) \\citep{meyer97} is \ndrawn with a solid green line. The three parallel long-dashed lines represent \nthe reddening vectors (with A$_{K}$ = 3 mag) of giants, main-sequence stars, and CTTS stars. \nThe extinction vector A$_{K}$ = 1 mag is also shown in the diagram. \nThe extinction vectors are drawn from \\citet{indebetouw05} extinction laws. \nThe color-color diagram is divided into three different subregions, namely ``I'', ``II'', and ``III''. \nThe loci of the unreddened dwarf (Bessell \\& Brett (BB) system), \ngiant (BB-system) and CTTS (CIT system) are transfered into the 2MASS system using transformation \nequations given in \\citet{carpenter01}; \nd) Color-magnitude diagram (H$-$K/K) of the sources detected in H and K bands. \nIn all the panels, we show Class~I (red circles) and Class~II (open blue triangles) YSOs. \nIn the first two panels, the arrow represents the extinction vector corresponding to the average extinction laws from \\citet{flaherty07}. \nThe dots (in gray color) show the stars with only photospheric emissions (see the text for YSOs selection conditions).}\n\\label{fig16}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\epsscale{1.0}\n\\plotone{f13.pdf}\n\n\\caption{\\scriptsize Overlay of YSO surface density contours on the extinction map. \nThe background map is similar to the one shown in Figure~\\ref{fig2a}a. \nThe surface density contours (in white color) are shown at 10, 20, 40, and 70 YSOs pc$^{-2}$, increasing from \nthe outer to the inner regions. \nThe positions of Class~I and Class~II YSOs identified within our selected region are shown by red circles and blue triangles, respectively. \nAll the cluster members (YSOs having d$_{c}$ $\\leq$ 0.453 pc) are shown by filled symbols (see text for details). \nThe YSOs greater than d$_{c}$ ($>$ 0.453 pc) are marked by open symbols. \nThe location of an O9.5V star is shown by a filled star. }\n\\label{fig17}\n\\end{figure*}\n\n\\clearpage\n\\begin{figure*}\n\\epsscale{1.0}\n\\plotone{f14.pdf}\n\n\\caption{\\scriptsize Overlay of Class I and Class II YSO surface density contours on the integrated $^{13}$CO map. \nThe background map is similar to the one shown in Figure~\\ref{fig8}b. \nThe surface density contours of Class I YSOs are drawn in red color with 5, 8, 10, and 20 YSO pc$^{-2}$. \nThe Class II YSO surface density contours are overlaid in yellow color with 10, 20, and 40 YSO pc$^{-2}$. \nThe location of an O9.5V star is shown by a filled star. \nThe positions of dust clumps are shown by blue squares in the map (see Table~\\ref{tab1}).} \n\\label{fig18} \n\\end{figure*}\n\n\n\\begin{figure*}\n\\epsscale{1.0}\n\\plotone{f15ab.pdf}\n\\epsscale{0.65}\n\\plotone{f15c.pdf}\n\n\\caption{\\scriptsize a) The distribution of molecular gas toward the S235 complex and the S235AB region. \nA contour map of integrated $^{13}$CO emission in the velocity range of $-$25 to $-$15 km s$^{-1}$.  \nThe location of an O9.5V star is shown by a filled star. The solid box shows the field of the S235 complex, as shown in Figure~\\ref{fig1a}a. \nThe S235AB region is also marked in the map. b) Declination-velocity map. \nThe position-velocity diagram suggests the possibility of interaction between the S235 molecular cloud and the S235AB molecular cloud.\nc) Plot of fragmentation timescale (t$_{frag}$) and dynamical time (t$_{dyn}$) as function of initial density (n$_{0}$) of the ambient neutral medium.\nThe fragmentation timescale is computed for different sound speed of neutral gas ($a_{s}$) = 0.2, 0.3, and 0.4 km s$^{-1}$ (see Table~\\ref{tab3}). \nDotted lines depict the value of ``n$_{0}$\" at which ``t$_{dyn}$\" is equal to ``t$_{frag}$\" for different ``$a_{s}$\" values (see the text for more details).} \n\\label{fig19a} \n\\end{figure*}\n\n\\begin{table*}\n\\scriptsize\n\\setlength{\\tabcolsep}{0.05in}\n\\centering\n\\caption{Bolocam clumps at 1.1 mm (see Figure~\\ref{fig2a}). \nTable contains BGPS source designations, positions, distance from an O9.5V star (D$_{s}$), deconvolved effective radius (R$_{eff}$), \nintegrated flux density (S$_{\\nu}$), clump mass (M$_{g}$), column density (N(H$_{2}$)), and self-gravitating pressure ($P_{clump}$ \n$\\approx$ $\\pi G (M_{g}/ \\pi R_{eff}^2$)$^2$). \nClump masses were estimated using the integrated fluxes for a dust temperature = 20 K at a distance of 1.8 kpc. \nThe positions of clumps located near the sphere-like shell are highlighted by superscript ``$\\dagger$'' (see Figure~\\ref{fig3a} and also see text for more details).}\n\\label{tab1}\n\\begin{tabular}{lcccccccccccccc}\n\\hline  \n  ID                             & BGPS                      &  RA              &   Dec                 & D$_{s}$ &  R$_{eff}$   & S$_{\\nu}$  & M$_{g}$         &   N(H$_{2}$)  &   $P_{clump}$        &    Subregion                  \\\\   \n                                  &  Name                      & [2000]          &  [2000]               & (pc)       &  $\\arcsec$(pc)          &  [Jy]            &  (M$_{\\odot}$)  &   (10$^{22}$ cm$^{-2}$)   &   (10$^{-10}$ dynes\\, cm$^{-2}$) &  \\\\   \n\\hline \t\t\t\t\t\t   \t      \t   \t\t\t\t\t\t\t      \n1                                & G173.570+02.749     &   05:40:42.9   &      +35:50:57     &  1.75\t&     50.53(0.44)   &  0.549\t &    23.10    & 1.10  & 0.13 &  Central~W \\\\\t\t\t\t\t\t\t\t\t\t       \n2$^{\\dagger}$             & G173.515+02.785     &   05:40:43.2   &\t+35:54:57     &  2.80\t &     80.20(0.70)   &  1.345\t  &    56.59    &  2.69&  0.12 &North-West\\\\\n3                                & G173.640+02.707     &   05:40:43.3   &      +35:46:04     &  2.98\t&     57.77(0.50)   &  1.429\t &    60.12    & 2.86 &  0.54 &South-West\\\\\n4                                & G173.613+02.733     &   05:40:45.4   &      +35:48:18     &  1.94\t&     59.10(0.52)   &  1.947\t &    81.92    &3.90 &   0.85 &Central~W \\\\\n5$^{\\dagger}$             & G173.543+02.785     &   05:40:47.6   &\t+35:53:31     &  1.92\t &      --      &  0.193    &     8.12     & 0.39 &     --  &North-West  \\\\\n6$^{\\dagger}$             & G173.625+02.787     &   05:41:00.9   &\t+35:49:24     &  0.71\t &     95.09(0.83)   &  5.128\t  &   215.75   & 10.30  & 0.91&Central~E \\\\\n7$^{\\dagger}$             & G173.546+02.849     &   05:41:04.3   &\t+35:55:21     &  2.48\t &     37.49(0.33)   &  0.438\t  &    18.43    & 0.88 &  0.26&North \\\\\n8                                & G173.594+02.827     &   05:41:06.2   &\t    +35:52:12     &  1.07    &      --      &  0.482\t&    20.28    & 0.96   &   --  & --  \\\\\n9$^{\\dagger}$             & G173.633+02.807     &   05:41:07.2   &\t+35:49:38     &  1.01\t &     93.12(0.81)   &  5.978\t  &   251.53   & 12.0  & 1.36 &Central~E\\\\\n10$^{\\dagger}$           & G173.657+02.823     &   05:41:14.9   &      +35:48:55     &  1.91\t&\t--     &  0.255\t   &    10.73    & 0.51  &    --  & Central~E\\\\\n11                              & G173.610+02.853     &   05:41:15.3   &\t   +35:52:13     &  1.87    &\t    --     &  0.216    &     9.10     & 0.43  &    -- & --    \\\\\n12$^{\\dagger}$           & G173.625+02.875     &   05:41:23.0   &      +35:52:12     &  2.63\t&\t--     &  1.041\t   &    43.80    & 2.08  &    --  &   East 2   \\\\\n13$^{\\dagger}$           & G173.621+02.887     &   05:41:25.4   &      +35:52:47     &  2.97\t&      44.71(0.39)  &  2.087\t &    87.81    &  4.18 & 3.09  &  East 2   \\\\\n14                              & G173.706+02.847     &   05:41:28.8   &      +35:47:08     &  3.65    &\t--    &  0.166\t  &     6.98     &  0.33 &    --  &  East 1   \\\\\n15                              & G173.676+02.873     &   05:41:30.6   &      +35:49:29     &  3.39    &      80.34(0.70)  &  6.768\t&   284.76   & 13.5  & 3.13&   East 1  \\\\\n\\hline          \n\\end{tabular}\n\\end{table*}\n\n\\begin{table*}\n\\scriptsize\n\\setlength{\\tabcolsep}{0.05in}\n\\centering\n\\caption{\\scriptsize Physical parameters derived from NH$_{3}$ line data \\citep[from][]{kirsanova14}. \nTable contains the information about three subregions (e1 = East1, e2 = East2, and cn = Central~E), \npositions, distance from an O9.5V star (D$_{s}$), kinematical temperature (T$_{kin}$), volume density (n(H$_{2}$)), NH$_{3}$ (1,1) line \nwidth ($\\Delta V$), NH$_{3}$ (1,1) line velocity (V$_{lsr}$), \nsound speed ($a_{s}$), thermal velocity dispersion ($\\sigma_{T}$), non-thermal velocity dispersion ($\\sigma_{NT}$), and \nratio of thermal to non-thermal gas pressure (P$_{TNT}$ = ${a^2_{s}}/{\\sigma^2_{NT}}$) (see text for more details and also \nFigures~\\ref{fig2a}b and~\\ref{fig15}).}\n\\label{tab3}\n\\begin{tabular}{lccccccccccccc}\n\n\n\\hline \t\t\t\t\t\t\t\t\t\t    \t        \t\t\t      \n  Region     &   RA \t   &      Dec     &    D$_{s}$               &     T$_{kin}$   &    n(H$_{2}$)\t   &\t$\\Delta V$ &   V$_{lsr}$          & $a_{s}$        & $\\sigma_{T}$&$\\sigma_{NT}$ & P$_{TNT}$  \\\\ \n          &   [2000]\t   &    [2000]    &    (pc)                     &     (K)      &   (10$^{3}$ cm$^{-3}$)   &   (km s$^{-1}$) &   (km s$^{-1}$)   &   (km s$^{-1}$)  &   (km s$^{-1}$) &   (km s$^{-1}$) &  (${a^2_{s}}/{\\sigma^2_{NT}}$) \\\\ \n\\hline \n   e1     & \t5:41:33.8  &    +35:51:07    &\t    3.67       \t &\t--   &  \t --   &     2.14 &  -21.39\t       &    --    &    --      &   --\t    &\t--\t\t      \\\\ \n   e1\t  & \t5:41:33.8  & \t+35:50:27    &      3.66       \t &\t--   &       --   &\t2.34 &  -20.90  \t       &    --      &    --    &   --\t    &\t--\t\t      \\\\ \n   e1  \t  & \t5:41:33.8  & \t+35:49:47    &      3.70      \t &    21.20  &       --   &\t1.95 &  -19.95  \t       &  0.27  &  0.10      & 0.82\t    & 0.11\t\t      \\\\ \n   e1 \t  & \t5:41:33.8  & \t+35:49:07    &      3.76       \t &\t--   &       --   &\t1.52 &  -19.37  \t       &    --     &    --     &   --\t    &\t--\t\t      \\\\ \n   e1 \t  & \t5:41:31.1  & \t+35:51:07    &      3.38       \t &\t--   &       --   &\t1.06 &  -20.70  \t       &    --    &    --     &   --\t    &\t--\t\t      \\\\ \n   e1     & \t5:41:31.1  & \t+35:50:27    &      3.38      \t &    20.73  &      18    &\t2.30 &  -20.87  \t       &  0.27   &  0.10     & 0.97\t    & 0.08\t\t      \\\\ \n   e1  \t  & \t5:41:31.1  & \t+35:49:47    &      3.41      \t &    18.57  &      19    &\t1.95 &  -20.20  \t       &  0.25  &  0.09      & 0.82\t    & 0.09\t\t      \\\\ \n   e1  \t  & \t5:41:31.1  & \t+35:49:07    &      3.48      \t &    31.53  &      19    &\t1.97 &  -19.62  \t       &  0.33  &  0.12      & 0.83\t    & 0.16\t\t      \\\\ \n   e1  \t  & \t5:41:28.4  & \t+35:50:27    &      3.10       \t &\t--   &       --   &\t2.69 &  -14.31  \t       &    --    &    --     &   --\t    &\t--\t\t      \\\\ \n   e1 \t  & \t5:41:28.4  & \t+35:49:47    &      3.14       \t &\t--   &       --   &\t1.54 &  -19.78  \t       &    --   &    --      &   --\t    &\t--\t\t      \\\\ \n   e1 \t  & \t5:41:28.4  & \t+35:49:07    &      3.21      \t &    19.31  &      13    &\t1.73 &  -19.21  \t       &  0.26   &  0.10     & 0.73\t    & 0.12\t\t      \\\\ \n   e1\t  & \t5:41:28.4  & \t+35:48:27    &      3.32      \t &    18.99  &       --   &\t1.27 &  -19.06  \t       &  0.25   &  0.10     & 0.53\t    & 0.23\t\t      \\\\ \n   e2\t  & \t5:41:31.1  & \t+35:52:27    &      3.50       \t &\t--   &       --   &\t1.68 &  -21.14  \t       &    --      &    --   &   --\t    &\t--\t\t      \\\\ \n   e2\t  & \t5:41:31.1  & \t+35:51:47    &      3.42      \t &    17.56  &       --   &\t1.91 &  -21.24  \t       &  0.24   &  0.09     & 0.81\t    & 0.09\t\t      \\\\ \n   e2\t  & \t5:41:28.4  & \t+35:51:47    &      3.14      \t &    16.69  &       --   &\t1.78 &  -20.96  \t       &  0.24   &  0.09     & 0.75\t    & 0.10\t\t      \\\\ \n   e2\t  & \t5:41:28.4  & \t+35:52:27    &      3.22      \t &    17.69  &       --   &\t1.27 &  -21.28  \t       &  0.25    &  0.09    & 0.53\t    & 0.21\t\t      \\\\ \n   e2\t  & \t5:41:28.4  & \t+35:53:07    &      3.34      \t &    28.56  &       3    &\t1.48 &  -21.37  \t       &  0.31   &  0.12     & 0.62\t    & 0.26\t\t      \\\\ \n   e2\t  & \t5:41:25.8  & \t+35:51:47    &      2.87      \t &    17.68  &       --   &\t1.34 &  -21.13  \t       &  0.25   &  0.09     & 0.56\t    & 0.19\t\t      \\\\ \n   e2\t  & \t5:41:25.8  & \t+35:52:27    &      2.95     \t &    20.81  &       --   &\t1.19 &  -21.10  \t       &  0.27   &  0.10     & 0.50\t    & 0.29\t\t      \\\\ \n   e2\t  & \t5:41:25.8  & \t+35:53:07    &      3.08       \t &\t--   &       --   &\t1.47 &  -21.00  \t       &    --      &    --   &   --\t    &\t--\t\t      \\\\ \n   e2\t  & \t5:41:23.1  & \t+35:51:47    &      2.59      \t &    36.45  &       --   &\t1.42 &  -20.99  \t       &  0.35   &  0.13     & 0.59\t    & 0.36\t\t      \\\\ \n   cn\t  & \t5:41:15.1  & \t+35:49:47    &      1.75      \t &    22.48  &       --   &\t1.44 &  -19.97  \t       &  0.28  &  0.10      & 0.60\t    & 0.21\t\t      \\\\ \n   cn\t  & \t5:41:15.1  & \t+35:49:07    &      1.88      \t &    22.25  &      1\t  &\t2.84 &  -20.26  \t       &  0.28  &  0.10      & 1.20\t    & 0.05\t\t      \\\\ \n   cn\t  & \t5:41:12.4  & \t+35:49:47    &      1.48      \t &    27.92  &      4\t  &\t1.46 &  -20.08  \t       &  0.31   &  0.12     & 0.61\t    & 0.26\t\t      \\\\ \n   cn\t  & \t5:41:12.4  & \t+35:49:07    &      1.63      \t &    21.61  &      6\t  &\t1.13 &  -20.18  \t       &  0.27  &  0.10      & 0.47\t    & 0.34\t\t      \\\\ \n   cn\t  & \t5:41:12.4  & \t+35:48:27    &      1.84      \t &    14.32  &       --   &\t2.03 &  -18.95  \t       &  0.22  &  0.08      & 0.86\t    & 0.07\t\t      \\\\ \n   cn\t  & \t5:41:09.8  & \t+35:49:47    &      1.22       \t &     --    &       --   &\t2.41 &  -20.23  \t       &    --     &    --    &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:09.8  & \t+35:49:07    &      1.40      \t &    23.65  &       --   &\t2.24 &  -20.42  \t       &  0.28  &  0.11      & 0.95\t    & 0.09\t\t      \\\\ \n   cn\t  & \t5:41:09.8  & \t+35:48:27    &      1.63      \t &     --    &       --   &\t0.82 &  -18.65  \t       &    --   &    --      &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:07.1  & \t+35:49:47    &      0.97       \t &     --    &       --   &\t3.06 &  -21.52  \t       &    --    &    --     &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:07.1  & \t+35:49:07    &      1.18       \t &     --    &       --   &\t1.66 &  -21.56  \t       &    --   &    --      &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:07.1  & \t+35:48:27    &      1.45      \t &   13.41   &      5\t  &\t2.55 &  -20.80  \t       &  0.21  &  0.08       & 1.08\t    & 0.04\t\t      \\\\ \n   cn\t  & \t5:41:04.4  & \t+35:49:47    &      0.74       \t &     --    &       --   &\t1.54 &  -21.73  \t       &    --       &    --  &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:04.4  & \t+35:49:07    &      1.01       \t &     --    &       --   &\t1.87 &  -21.70  \t       &    --       &    --  &   --\t    &\t--\t\t      \\\\ \n   cn\t  & \t5:41:04.4  & \t+35:48:27    &      1.31      \t &   15.44   &      2\t  &\t1.46 &  -21.00  \t       &  0.23 &  0.09       & 0.61\t    & 0.14\t\t      \\\\ \n   cn\t  & \t5:41:01.8  & \t+35:49:47    &      0.56      \t &   43.04   &      5\t  &\t1.07 &  -21.84  \t       &  0.38 &  0.14       & 0.43\t    & 0.79\t\t      \\\\ \n\\hline          \t\t\n\\end{tabular}\t\t\t\n\\end{table*}\t\t\t\n\n\n\\begin{table*}\n\\scriptsize\n\\setlength{\\tabcolsep}{0.01in}\n\\centering\n\\caption{Pressure components driven by an O9.5V star on different subregions of the S235 complex. \nThe pressure exerted by the self-gravitating molecular cloud in each subregion is estimated \nto be $\\approx$0.1--3.0 $\\times$ 10$^{-10}$ dynes cm$^{-2}$ (see text for more details).}\n\\label{tab4}\n\\begin{tabular}{lccccccccccccc}\n\n\n\\hline \t\t\t\t\t\t\t\t\t\t    \t        \t\t\t      \n Pressure                      &   East 1 \t           &    East 2                   &       Central~E                  &     North\t                &   North-West    &    Central~W  &    South-West \\\\ \n   (dynes\\, cm$^{-2}$)      &  at D$_{s}$ = 3.4 pc \t   &   at D$_{s}$ = 3.0 pc     &    at D$_{s}$ = 1.5 pc       &     at D$_{s}$ = 2.6 pc     &     at D$_{s}$ = 2.7 pc   &  at D$_{s}$ = 1.9 pc &  at D$_{s}$ = 3.0 pc \\\\ \n\\hline \n P$_{HII}$  & (7.8$\\pm$0.2)$\\times$10$^{-11}$  & (9.4$\\pm$0.2)$\\times$10$^{-11}$  &  (2.7$\\pm$0.07)$\\times$10$^{-10}$  &  (1.2$\\pm$0.03)$\\times$10$^{-10}$  &  (1.1$\\pm$0.03)$\\times$10$^{-10}$  &  (1.9$\\pm$0.05)$\\times$10$^{-10}$  &  (9.4$\\pm$0.2)$\\times$10$^{-11}$ \\\\ \n P$_{rad}$    & (7.4$\\pm$0.2)$\\times$10$^{-12}$\t  & (9.5$\\pm$0.5)$\\times$10$^{-12}$  &  (3.8$\\pm$0.2)$\\times$10$^{-11}$  &  (1.3$\\pm$0.06)$\\times$10$^{-11}$  &  (1.2$\\pm$0.06)$\\times$10$^{-11}$  &  (2.4$\\pm$0.1)$\\times$10$^{-11}$  &  (9.5$\\pm$0.5)$\\times$10$^{-12}$ \\\\ \n P$_{wind}$  & (1.1$\\pm$0.08)$\\times$10$^{-14}$   & (1.4$\\pm$0.1)$\\times$10$^{-14}$  &  (5.6$\\pm$0.4)$\\times$10$^{-14}$  &  (1.9$\\pm$0.1)$\\times$10$^{-14}$  &  (1.7$\\pm$0.1)$\\times$10$^{-14}$  &  \n (3.5$\\pm$0.2)$\\times$10$^{-14}$  &  (1.4$\\pm$0.1)$\\times$10$^{-14}$ \\\\ \n P$_{total}$  & (0.9$\\pm$0.02)$\\times$10$^{-10}$\t  & (1.0$\\pm$0.02)$\\times$10$^{-10}$  &  (3.0$\\pm$0.07)$\\times$10$^{-10}$  &  (1.3$\\pm$0.03)$\\times$10$^{-10}$  &  (1.2$\\pm$0.03)$\\times$10$^{-10}$  &  (2.1$\\pm$0.05)$\\times$10$^{-10}$  &  (1.0$\\pm$0.02)$\\times$10$^{-10}$ \\\\ \n\\hline          \t\t\n\\end{tabular}\t\t\t\n\\end{table*}\t\t\t\n\n\n\\begin{thebibliography}{}\n\n\\bibitem[Aguirre et al.(2011)]{aguirre11}\nAguirre, J.~E., Ginsburg, A.~G., Dunham, M.~K., et al. 2011, ApJS, 192, 4 \n\n\\bibitem[Allen et al.(2004)]{allen04}\nAllen, L.~E., Calvet, N., D'Alessio, P., et al. 2004, ApJS, 154, 363\n\n\\bibitem[Arce et al.(2011)]{arce11}\nArce, H.~G., Borkin, M.~A., Goodman, A.~A., Pineda, J.~E., \\& Beaumont, C.~N. 2011, ApJ, 742, 105\n\n\\bibitem[Bally et al.(2010)]{bally10}\nBally, J., Aguirre, J., Battersby, C., et al. 2010, ApJ, 721, 137\n\n\\bibitem[Balser et al.(2011)]{balser11}\nBalser, D.~S., Rood, R.~T., Bania, T.~M., \\& Anderson, L.~D. 2011, ApJ, 738, 27\n\n\\bibitem[Beerer et al.(2010)]{beerer10}\nBeerer, I.~M., Koenig, X.~P., Hora, J.~L., et al. 2010, ApJ, 720, 679\n\n\\bibitem[Bertoldi(1989)]{bertoldi89}\nBertoldi, F. 1989, ApJ, 346, 735\n\n\\bibitem[Bessell \\& Brett(1988)]{bessell88}\nBessell, M.~S., \\& Brett, J.~M. 1988, PASP, 100, 1134\n\n\\bibitem[Brand \\& Blitz(1993)]{brand93} \nBrand, J., \\& Blitz, L. 1993, A\\&A, 275, 67\n\n\\bibitem[Bressert et al.(2010)]{bressert10}\nBressert, E., Bastian, N., Gutermuth, R., et al. 2010, MNRAS, 409, 54\n\n\\bibitem[Bressert et al.(2012)]{bressert12}\nBressert, E., Ginsburg, A., Bally, J., et al. 2012, ApJ, 758, 28\n\n\\bibitem[Brunt(2004)]{brunt04}\nBrunt C., 2004, in Clemens D., Shah R., Brainerd T., eds, Proc. of ASP Conference 317. Milky Way Surveys: The\nStructure and Evolution of our Galaxy, p. 79\n\n\\bibitem[Burns et al.(2015)]{burns15}\nBurns, R.~A., Imai, H., Handa, T., et al. 2015, MNRAS, 453, 3163\n\n\\bibitem[Camargo et al.(2011)]{camargo11}\nCamargo, D., Bonatto, C., \\& Bica, E. 2011, 416, 1522\n\n\\bibitem[Carpenter(2001)]{carpenter01}\nCarpenter, J.~M 2001, AJ, 121, 2851\n\n\\bibitem[Casali et al.(2007)]{casali07}\nCasali, M., Adamson, A., Alves de Oliveira, C., et al. 2007, A\\&A, 467, 777\n\n\\bibitem[Chavarr\\'{i}a et al.(2008)]{chavarria08}\nChavarr\\'{i}a, L.~A., Allen, L.~E., Hora, J.~L., Brunt, C.~M., \\& Fazio, G.~G. 2008, ApJ, 682, 445\n\n\\bibitem[Chavarr\\'{i}a et al.(2014)]{chavarria14}\nChavarr\\'{i}a L., Allen L., Brunt C., et al. 2014, MNRAS, 439, 3719\n\n\\bibitem[Condon et al.(1998)]{condon98}\nCondon, J.~J., Cotton, W.~D., Greisen, E.~W., et al. 1998, AJ, 115, 1693\n\n\\bibitem[Dale et al.(2007)]{dale07}\nDale, J.~E., Clark, P.~C., \\& Bonnell, I.~A. 2007, MNRAS, 377, 535\n\n\\bibitem[Deharveng et al.(2003)]{deharveng03}\nDeharveng, L., Lefloch, B., Zavagno, A., et al 2003, A\\&A, 408, 25L\n\n\\bibitem[Deharveng et al.(2005)]{deharveng05}\nDeharveng, L., Zavagno, A., \\& Caplan, J. 2005, A\\&A, 433, 565\n\n\\bibitem[Deharveng et al.(2010)]{deharveng10}\nDeharveng, L., Schuller, F., Anderson, L.~D., et al. 2010, A\\&A, 523, 6\n\n\\bibitem[Dewangan \\& Anandarao(2011)]{dewangan11}\nDewangan, L.~K., \\& Anandarao, B.~G. 2011, MNRAS, 414, 1526\n\n\\bibitem[Dewangan et al.(2012)]{dewangan12}\nDewangan, L.~K., Ojha, D.~K., Anandarao, B.~G., Ghosh, S.~K., \\& Chakraborti, S. 2012, ApJ, 756, 151\n\n\\bibitem[Dewangan et al.(2015)]{dewangan15b}\nDewangan, L.~K., Luna, A., Ojha, D.~K., et al. 2015, ApJ, 811, 79\n\n\\bibitem[Dunham et al.(2011)]{dunham11}\nDunham, M.~K., Rosolowsky, E., Evans, II N.~J., Cyganowski, C., \\& Urquhart, J.~S. 2011, ApJ, 741, 110\n\n\\bibitem[Dyson \\& Williams(1980)]{dyson80}\nDyson, J.~E., \\& Williams, D.~A. 1980, Physics of the interstellar medium (New York, Halsted Press, p. 204)\n\n\\bibitem[Elmegreen \\& Lada(1977)]{elmegreen77}\nElmegreen, B.~G., \\& Lada, C.~J. 1977, ApJ, 214, 725\n\n\\bibitem[Elmegreen(1998)]{elmegreen98}\nElmegreen, B.~G. 1998, ASP Conf. Ser. 148, Origins, ed. C. E. Woodward, J. M. Shull, \\& \nH. A. Thronson, Jr. (San Francisco, CA: ASP), 150\n\n\\bibitem[Enoch et al.(2008)]{enoch08} \nEnoch, M.~L., Evans, II, N.~J., Sargent, A.~I., et al. 2008, ApJ, 684, 1240\n\n\\bibitem[Evans \\& Blair(1981)]{evans81a} \nEvans, N.~J., II, \\& Blair, G.~N. 1981, ApJ, 246, 394\n\n\\bibitem[Evans et al.(1981)]{evans81b} \nEvans, N.~J., II, Beichman, C., Gatley I., et al. 1981, ApJ, 246, 409\n\n\\bibitem[Evans et al.(2009)]{evans09}\nEvans, N.~J., II, Dunham, M.~M., J$\\o{}$rgensen, J.~K., et al. 2009, ApJS, 181, 321\n\n\\bibitem[Fazio et al.(2004)]{fazio04}\nFazio, G.~G., Hora, J.~L., Allen, L.~E., et al. 2004, ApJS, 154, 10\n\n\\bibitem[Flaherty et al.(2007)]{flaherty07}\nFlaherty, K.~M., Pipher, J.~L., Megeath, S.~T., et al. 2007, ApJ, 663, 1069\n\n\\bibitem[Foster \\& Brunt(2015)]{foster15}\nFoster, T. \\& Brunt, C.~M. 2015, AJ, 150, 147\n\n\\bibitem[Francesco et al.(2008)]{francesco08}\nFrancesco, J.~D., Johnstone, D., Kirk H., MacKenzie, T., \\& Ledwosinska, E. 2008, APJSS, 175, 277\n\n\\bibitem[Georgelin et al.(1973)]{georgelin73} \nGeorgelin, Y.~M., Georgelin, Y.~P., \\& Roux S. 1973, A\\&A, 25, 337\n\n\\bibitem[Ginsburg et al.(2013)]{ginsburg13} \nGinsburg, A., Glenn, J., Rosolowsky, E., et al.\t2013 ,ApJS, 208,14\n\n\\bibitem[Guarcello et al.(2013)]{guarcello13} \nGuarcello, M.~G., Drake, J.~J., Wright, N.~J., et al. 2013, ApJ, 773, 135\n\n\\bibitem[Gutermuth et al.(2009)]{gutermuth09}\nGutermuth, R.~A., Megeath, S.~T., Myers, P.~C., et al. 2009, ApJS, 184, 18\n\n\\bibitem[Harper-Clark \\& Murray(2009)]{harper09}\nHarper-Clark, E., \\& Murray, N. 2009, ApJ, 693, 1696\n\n\\bibitem[Haworth et al.(2015a)]{haworth15a} \nHaworth, T.~J., Tasker, E.~J., Fukui, Y., et al. 2015a, MNRAS, 450, 10\n\n\\bibitem[Haworth et al.(2015b)]{haworth15b} \nHaworth, T.~J., Shima, K., Tasker, E.~J., et al. 2015b, MNRAS, 454, 1634\n\n\\bibitem[Heyer et al.(1996)]{heyer96}\nHeyer, M.~H., Carpenter, J.~M., \\& Ladd, E.~F. 1996, ApJ, 463, 630\n\n\\bibitem[Heyer et al.(1998)]{heyer98}\nHeyer, M., Brunt, C., Snell, R., et al. 1998, ApJS, 115, 241\n\n\\bibitem[Hildebrand(1983)]{hildebrand83} \nHildebrand, R.~H. 1983, Quarterly Journal of the RAS, 24, 267\n\n\\bibitem[Indebetouw et al.(2005)]{indebetouw05} \nIndebetouw, R., Mathis, J.~S., Babler, B.~L., et al. 2005, ApJ, 619, 931\n\n\\bibitem[{Israel} and {Felli}(1978)]{israel78} \nIsrael, F.~P., \\& Felli, M. 1978, A\\&A, 63, 325 \n\n\\bibitem[Kauffmann et al.(2008)]{kauffmann08}\nKauffmann, J., Bertoldi, F., Bourke, T.~L., Evans, II N.~J., \\& Lee, C.~W. 2008, ApJ, 487, 993\n\n\\bibitem[Kirsanova et al.(2008)]{kirsanova08} \nKirsanova, M.~S., Sobolev, A.~M., Thomasson, M., et al. 2008, MNRAS, 388, 729\n\n\\bibitem[Kirsanova et al.(2014)]{kirsanova14} \nKirsanova, M.~S., Wiebe, D.~S., Sobolev, A.~M., et al. 2014, MNRAS, 437, 1593\n\n\\bibitem[Klein et al.(2005)]{klein05}\nKlein, R.,  Posselt, B., Schreyer, K., Forbrich, J., \\& Henning, Th. 2005, ApJS, 161, 361\n\n\\bibitem[Kumar Dewangan \\& Anandarao(2010)]{kumarld10a} \nKumar Dewangan, Lokesh \\& Anandarao, B.~G. 2010, MNRAS, 402, 2583\n\n\\bibitem[Kumar \\& Anandarao(2010)]{kumarld10} \nKumar, Dewangan Lokesh \\& Anandarao, B.~G. 2010, MNRAS, 407, 1170\n\n\\bibitem[Kwan(1997)]{kwan97} \nKwan, J., 1997, ApJ, 489, 284\n\n\\bibitem[Lada et al.(1994)]{lada94} \nLada, C.~J., Lada, E.~A., Clemens, D.~P., \\& Bally, J. 1994, ApJ, 429, 694\n\n\\bibitem[Lada et~al.(2003)]{lada03}\nLada, C.~J., Bergin, E.~A., Alves, J.~F., \\& Huard, T.~L. 2003, ApJ,  586, 286\n\n\\bibitem[Lada et al.(2006)]{lada06}\nLada, C.~J., Muench, A.~A., Luhman, K.~L., et al. 2006, AJ, 131, 1574\n\n\\bibitem[Lawrence et al.(2007)]{lawrence07}\nLawrence, A., Warren, S.~J., Almaini, O., et al. 2007, MNRAS, 379, 1599\n\n\\bibitem[Lefloch \\& Lazareff(1994)]{lefloch94}\nLefloch, B., \\& Lazareff, B. 1994, A\\&A, 289, 559\n\n\\bibitem[Lucas et al.(2008)]{lucas08}\nLucas, P.~W., Hoare, M.~G., Longmore, A., et al. 2008, MNRAS, 391, 1281\n\n\\bibitem[Mallick et al.(2013)]{mallick13}\nMallick, K.~K., Kumar, M.~S.~N., Ojha, D.~K., et al. 2013, ApJ, 779, 113\n\n\\bibitem[Martins et al.(2005)]{martins05}\nMartins, F., Schaerer, D., \\& Hillier, D.~J. 2005, A\\&A, 436, 1049\n\n\\bibitem[Marcolino et al.(2009)]{marcolino09}\nMarcolino, W.~L.~F., Bouret, J.~-C., Martins, F., et al. 2009, A\\&A, 498, 837\n\n\\bibitem[Matsakis et al.(1976)]{matsakis76}\nMatsakis, D.~N., Evans, N.~J., II, Sato, T., \\& Zuckerman, B. 1976, AJ, 81, 172\n\n\\bibitem[Meyer et al.(1997)]{meyer97} \nMeyer, M.~R., Calvet, N., \\& Hillenbrand, L.~A. 1997, AJ, 114, 288\n\n\\bibitem[Morgan et al.(2010)]{morgan10}\nMorgan, L.~K., Figura, C.~C., Urquhart, J.~S., \\& Thompson, M.~A. 2010, MNRAS, 408, 157\n\n\\bibitem[Navarete et al.(2015)]{navarete15} \t\nNavarete, F., Damineli, A., Barbosa, C.~L., \\& Blum, R.~D. 2015, MNRAS, 450, 4364\n\n\\bibitem[Nordh et al.(1984)]{nordh84}\nNordh, H.~L., van Duinen, R.~J., Fridlund, C.~V.~M., et al. 1984, A\\&A, 131, 221\n\n\\bibitem[Paladini et al.(2012)]{paladini12} \nPaladini, R., Umana, G., Veneziani, M., et al. 2012, ApJ, 760, 149\n\n\\bibitem[Povich et al.(2007)]{povich07} \nPovich, M.~S., Stone, J.~M., Churchwell, E., et al. 2007, ApJ, 660, 346\n\n\\bibitem[Rieke et al.(2004)]{rieke04}\nRieke, G.~H., Young, E.~T., Engelbracht, C.~W., et al. 2004, ApJS, 154, 25  \n\n\\bibitem[Skrutskie et al.(2006)]{skrutskie06}\nSkrutskie, M.~F., Cutri, R.~M., Stiening, R., et al. 2006, AJ, 131, 1163\n\n\\bibitem[Sugitani et al.(2002)]{sugitani02}\nSugitani, K., Tamura, M., Nakajima, Y., et al. 2002, ApJ, 565, L25\n\n\\bibitem[Takami et al.(2010)]{takami10}\nTakami, M., Karr, J.~L., Koh, H., Chen, H.~H., \\&, Lee, H.~T. 2010, ApJ, 720, 155\n\n\\bibitem[Watson et al.(2008)]{watson08}\nWatson, C., Povich, M.~S., Churchwell, E.~B., et al. 2008, ApJ, 681, 1341\n\n\\bibitem[Whitworth et al.(1994)]{whitworth94}\nWhitworth, A.~P., Bhattal, A.~S., Chapman, S.~J., Disney, M.~J.,  \\& Turner, J.~A. 1994b, MNRAS, 268, 291\n\n\\bibitem[Wilson et al.(2005)]{wilson05} \nWilson, B.~A., Dame, T.~M., Masheder, M.~R.~W., \\& Thaddeus, P. 2005, A\\&A, 430, 523\n\n\\bibitem[Wright et al.(2010)]{wright10}\nWright, E.~L., Eisenhardt, P.~R.~M., Mainzer, et al. 2010, AJ, 140, 1868\n\n\\bibitem[Zinnecker \\& Yorke(2007)]{zinnecker07} \nZinnecker, H., \\& Yorke, H.~W. 2007, ARA\\&A, 45, 481\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 43685, "prevtext": "\n\nIn the equations above, N$_{uv}$, $\\mu$, and m$_{H}$ are defined earlier, the radiative recombination \ncoefficient is ``$\\alpha_{B}$'' \\citep[=  2.6 $\\times$ 10$^{-13}$ $\\times$ (10$^{4}$ K/T$_{e}$)$^{0.7}$ cm$^{3}$ s$^{-1}$; see][]{kwan97}, \nc$_{s}$ is the sound speed in the photo-ionized region (= 10 km s$^{-1}$), $\\dot{M}_{w}$ is the mass-loss rate, \nV$_{w}$ is the wind velocity of the ionizing source,  L$_{bol}$ is the bolometric luminosity of the complex, and \nD$_{s}$ is the projected distance from the location of the O9.5V type star to the subregions \nwhere the pressure components are estimated. \nOne can infer from equations 5, 6, and 7 that the pressures, P$_{rad}$ and P$_{wind}$, \nscale as $D_{s}^{-2}$ while P$_{HII}$ scales as $D_{s}^{-3/2}$.\\\\ \n\nNote that the highlighted subregions are not located at the same projected distance from \nthe location of a massive star (see Figures~\\ref{fig2a} and~\\ref{fig3a}). \nTherefore, we compute the pressure components driven by a massive star (i.e., $P_{HII}$,  P$_{rad}$, and P$_{wind}$) \nat D$_{s}$ = 3.4 pc (East~1), 3.0 pc (East~2), 1.5 pc (Central~E), 2.6 pc (North), 2.7 pc (North-West), 1.9 pc (Central~W), and 3.0 pc (South-West) (see Figures~\\ref{fig2a} and~\\ref{fig3a}). \n\n\\citet{evans81a} estimated a total gas mass of the S235 cloud to be about 3000 $M_\\odot$ in a radius of 3 pc. \n\\citet{nordh84} computed a total luminosity of S235 of $\\sim$8 $\\times$ 10$^{4}$ L$_{\\odot}$.\nWe use $M_{cloud}$ $\\approx$ 3000 $M_\\odot$, R$_{c}$ $\\approx$ 3.0 pc, $L_{bol}$ $\\approx$ 8 $\\times$ 10$^{4}$ L$_{\\odot}$, \n$\\dot{M}_{w}$ $\\approx$ 1.58 $\\times$ 10$^{-9}$ M$_{\\odot}$ yr$^{-1}$ \\citep[for O9.5V star;][]{marcolino09}, \nV$_{w}$ $\\approx$ 1500 km s$^{-1}$ \\citep[for O9.5V star;][]{marcolino09} in the above equations to compute the pressure contributions \ndriven by a massive star on different subregions (see the list in Table~\\ref{tab4}). \nThe error associated with each pressure component related to each subregion is also given in Table~\\ref{tab4}.  \nIn the S235 complex, we find that the pressure of the H\\,{\\sc ii} region exceeds the radiation pressure and the \nstellar wind pressure (see Table~\\ref{tab4}).  \nThe total pressure (P$_{total}$ = P$_{HII}$ + $P_{rad}$ + P$_{wind}$) driven by a massive star on each subregion is also tabulated in \nTable~\\ref{tab4}, which is found to be $\\sim$10$^{-10}$ dynes cm$^{-2}$ for each subregion.\n\nAdditionally, pressure exerted by the self-gravity of the surrounding molecular gas is also estimated using the relation \\citep[e.g.][]{harper09}:\n\n", "index": 15, "text": "\\begin{equation}\nP_{cloud} \\approx\\pi G\\Sigma^2\\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"P_{cloud}\\approx\\pi G\\Sigma^{2}\\\\&#10;\" display=\"block\"><mrow><msub><mi>P</mi><mrow><mi>c</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>≈</mo><mrow><mi>π</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mn>2</mn></msup></mrow></mrow></math>", "type": "latex"}]