[{"file": "1601.01820.tex", "nexttext": "\nwhere $W(kr)$ is the window function (see Peebles 1993). For the latter, here we adopt a sharp-$k$ form (a tophat sphere in Fourier space) with a halo mass assigned to the filter scale by the relation $M = 4\\pi\\,\\overline{\\rho} (cr)^3/3$ with $c = 2.7$ (Schneider et al. 2013). In fact, both theoretical arguments (Benson et al. 2013) and numerical experiments (see Schneider et al. 2012; 2013; Angulo et al. 2013) show that the resulting mass distributions and EPS merger trees (conditional mass function) provide an excellent fit to N-body results for a wide range of DM masses and redshifts (see Schneider 2015). \n\nThus, the linear power spectrum $P(k)$ determines the history of collapse, the evolution, and  the mass distribution of DM halos. For the CDM cosmology we adopt the form $P_{CDM}(k)$ given by Bardeen et al. (1986). The WDM spectrum $P_{WDM}(k)$ is suppressed with respect to the CDM case below a characteristic scale depending on the mass of the WDM particles (and, for non-thermal particles, also on their mode of production; see Kusenko 2009; Destri, de Vega, Sanchez 2013a); in fact, the large thermal velocities of the lighter WDM particles erase the perturbations with size comparable to and below the free- streaming scale $r_{fs}$. In particular, if WDM is composed by relic thermalized particles, the suppression factor can be parametrized as (Bode, Ostriker \\& Turok 2001; see also Viel et al. 2005; Destri, de Vega, Sanchez 2013a)\n\n", "itemtype": "equation", "pos": 15273, "prevtext": "\n\n\\title{Constraining the Warm Dark Matter Particle Mass through Ultra-Deep UV Luminosity Functions at z=2} \n\\author{N. Menci$^1$, N.G. Sanchez$^2$, M. Castellano$^1$, A. Grazian$^1$}\n\n\\affil{$^1$INAF - Osservatorio Astronomico di Roma, via di Frascati 33, 00040 Monte Porzio Catone, Italy}\n\\affil{\n$^2$Observatoire de Paris, LERMA, CNRS UMR 8112, 61, Observatoire de Paris PSL, Sorbonne Universit\\'es, UPMC Univ. Paris 6, 61 Avenue de l'Observatoire, F-75014 Paris, France}\n\n\\begin{abstract}\n\n\nWe compute  the mass function of galactic dark matter halos for different values of the Warm Dark Matter (WDM) particle mass $m_X$ and compare it with the  abundance of ultra-faint galaxies derived from the  deepest UV luminosity function available so far at redshift $z\\approx 2$. The magnitude limit $M_{UV}=-13$ reached by such observations allows us to probe the WDM  mass functions down to scales close to or smaller than the half-mass mode mass scale $\\sim 10^9\\,M_{\\odot}$. This allowed for an efficient discrimination among predictions for different $m_X$ which turn out to be  independent of the star formation efficiency adopted to associate the observed UV luminosities of galaxies to the corresponding dark matter masses. Adopting a conservative approach  to take into account the existing theoretical uncertainties in the galaxy halo mass function, we derive a robust limit $m_X\\geq 1.8$ keV for the mass of thermal relic WDM particles  when comparing with the measured abundance of the faintest  galaxies, while $m_X\\geq 1.5$ keV is obtained when we compare with   the Schechter fit to the observed luminosity function. The corresponding lower limit for sterile neutrinos depends on the modeling of the production mechanism; for instance $m_{sterile}\\gtrsim 4$ keV holds for the Shi-Fuller mechanism.  We discuss the impact of observational uncertainties on the above bound on $m_X$. As a baseline for comparison with forthcoming observations from the HST Frontier Field, we provide predictions for the abundance  of faint galaxies with $M_{UV}=-13$ for different values of $m_X$ and of the star formation efficiency, valid up to $z\\approx 4$.\n\\end{abstract}\n\n\\keywords{cosmology: dark matter -- galaxies: abundances -- galaxies: formation  }\n\\section{Introduction}\n\nIn cosmological models of structure formation, galaxies form from the condensation of baryons within  larger dark matter (DM) halos. These originate from the collapse of  density perturbations in the DM density field, which dominates the matter content of the Universe and drives the collapse and the growth of cosmic structures (see Peebles 1993). In the  paradigm of cold dark matter (CDM), the primordial DM density perturbations have slowly increasing amplitude down to sub-galactic scales, owing to the negligible thermal velocities of the CDM \nparticles. This yields an ever-increasing number of collapsed small-mass halos,  resulting into a steep halo mass function $N(M)\\sim M^{-2}$ and into cuspy density profiles of DM halos. Although the physics of baryons and the energy injected by Supernovae (Dekel \\& Silk 1986) are known to suppress the luminosity-to-mass ratio $L/M$ (see Somerville \\& Dav\\'e 2014 and references therein) and to expand the DM distribution inside halos (see Mashchenko, Wadsley \\& Couchman 2008; Read \\& Gilmore 2005; Governato et al. 2012; Ogiya \\& Mori 2014; Di Cintio 2014), it is currently matter of debate whether such an effect can simultaneously account for all the observed properties of low-mass galaxies, namely, their flat luminosity (or stellar mass) function $N(L)\\sim L^{-1.3}$ up to $z\\approx 3$ (see, ee.g., Fontana et al. 2006; Fontanot et al. 2009; Lo Faro et al. 2009; Marchesini et al. 2009; Guo et al. 2011; Parsa et al. 2015), their cored DM density profiles (see, e.g., Alam, Bullock, \\& Weinberg 2002; Kuzio de Naray \\& Spekkens 2011; de Vega, Salucci \\& Sanchez 2014), the low abundance of satellites in Milky Way-like halos (see, e.g., Klypin et al. 1999; Moore et al. 1999; but see also Koposov et al. 2009) and around field galaxies up to $z\\sim 1$ (Nierenberg et al. 2013), and the observed \n$L/M$ ratios in the population of dwarf galaxies (see Boylan-Kolchin, Bullock \\& Kaplinghat 2012; Moster, Naab, White 2013; Collins et al. 2014; Ferrero et al. 2012; Garrison-Kimmel et al. 2014b; Tollerud, Boylan-Kolchin \\& Bullock 2014; Papastergis et al. 2015; Sawala et al. 2015; Pawlowski et al. 2015), while still matching the observed local distribution of rotational velocities which shows only a mild increase $N(v)\\sim v^{-1.2}$ at the  low-mass end (Papastergis et al. 2011; Klypin et al. 2014) and the relatively blue colors of satellite galaxies (Kimm et al. 2009; Dave' et al. 2011; Hirschman et al. 2012, Bower et al. 2012, Weinmann et al. 2012; Hirschman et al. 2013). \n\nIn this context, models based on warm dark matter (WDM, see Bode, Ostriker \\& Turok 2001), composed by particles with masses in the keV scale (see de Vega \\& Sanchez 2010), are receiving increasing attention. In fact, in such a scenario the perturbation power spectrum is suppressed with respect to the CDM case at small scales $\\lesssim 1$ Mpc due to the free-streaming of the lighter and faster DM particles.  The corresponding lack of small-scale power results in a reduced dwarf galaxy abundance and shallower inner density profiles naturally matching the observations (Macci\\'o et al. 2012; Schneider et al. 2012, Lovell et al. 2012, 2014; Polisensky \\& Ricotti et al. 2011; de Vega, Salucci, Sanchez 2014; \nPapastergis et al. 2015; see also Polisenski \\& Ricotti 2015 and references therein), while being indistinguishable from CDM on larger scales. Recent works have investigated the impact of  adopting a WDM cosmology on galaxy formation, showing that it can naturally match the observed number of satellites (Nierenberg et al. 2013), the galaxy luminosity and stellar mass distributions over a wide range of masses and redshift (Menci et al. 2012; Benson et al. 2013; Dayal, Mesinger, Pacucci 2015), as well as the star formation properties of low-mass galaxies (Calura, Menci, Gallazzi 2014), thus constituting a viable framework for galaxy formation and even for the evolution of the AGN population (Menci et al. 2013). \n\nThe two most popular classes of WDM particle candidates are thermal relic particles and sterile neutrinos\n(for a discussion see Colombi, Dodelson, Widrow 1996; for recent reviews see, e.g., Biermann, De Vega \\& Sanchez 2013). While for the former it is possible to derive a one-to-one correspondence with the shape of the power spectrum, for sterile neutrinos the free-streaming length  (and hence the effect on the perturbation spectrum) depends on their production mechanism (see Destri, de Vega, Sanchez 2013a). In fact, these can be produced at the proper dark matter abundance through different processes: i) scattering  due to their mixing with active neutrinos through the Dodelson \\& Widrow (1994) mechanism; ii) resonant production including the case of  lepton asymmetry (Shi \\& Fuller 1999); iii)  coupling with other fields (Kusenko 2009; Shaposhnikov \\& Tkachev 2006). Several astrophysical constraints  \nare leading to a rather definite window for the thermal relic mass $1\\lesssim m_X/keV\\lesssim 4$, yielding a power spectrum corresponding to that produced by (non-thermal) sterile neutrinos with mass $m_{sterile}\\approx 4-12$ keV, depending on the production mechanism. Indeed, these constitute the simplest candidates (see, e.g.,  Abazajian 2014) for a dark matter interpretation of the origin of the recent unidentified X-ray line reported in stacked observations of X-ray clusters with the XMM-Newton telescope with both CCD instruments on board the telescope, and of the Perseus cluster with the Chandra observatory (Bulbul et al. 2014; independent indications of a consistent line in XMM-Newton observations of M31 and the Perseus Cluster is reported in Boyarsky et al. 2014).  Such a value is consistent with lower limits $m_X\\geq 1$ keV (for thermal relics at 2$\\sigma$ level, Pacucci, Mesinger \\& Haiman 2013) derived from the density of high-redshift galaxies set by the two objects already detected at $z\\approx 10$ by the Cluster Lensing And Supernova survey with Hubble (CLASH).  A similar limit has been derived by Lapi \\& Danese (2015) from the observed abundance of \n $z\\approx 8$ galaxies with UV magnitude $M_{UV}\\approx -17$, while tighter limits can be inferred only by extrapolating the UV luminosity function to magnitudes as faint as $M_{UV}\\approx -13$. \nThe thermal relic equivalent mass of sterile neutrinos inferred from X-ray observations is also consistent with the limits set by different authors  ($m_X\\geq 2.3$ keV, Polisensky \\& Ricotti 2011; $m_X\\gtrsim 1.5$ keV,  Lovell et al. 2012, 2015;  Horiuchi et al. 2014) from the abundance of ultra-faint Milky Way satellites measured in the Sloan Digital Sky Survey (see, e.g., Belokurov et al. 2010), but in tension with that derived by comparing small scale structure in the Lyman-Î± forest of high- resolution ($z > 4$) quasar spectra with hydrodynamical N-body simulations which yields $m_X\\gtrsim 3.3$ keV  (Viel et al. 2013). \n\nAt present,  various uncertainties may still affect the constraints (for the points below, see discussions in Abazjian et al. 2011, Watson et al. 2012; Schultz et al. 2014 and references therein; Lovell et al. 2015). Lyman-$\\alpha$ is  a challenging tool, and requires disentangling the effects of pressure support and thermal broadening from those caused by the DM spectrum, as well as assumptions on the thermal history of the intergalactic medium and of the ionizing background (see Garzilli \\& Boyarsky 2015). \nAdditional uncertainties may derive from rendering the  velocity dispersion of the real WDM particles with simulation particles which are  $10^{68}$ times heavier. Also for the comparisons of sub-halos to Milky Way dwarfs, these usually assume a correction factor $\\approx  4$ to account for the number of dwarfs being missed by current surveys, and lower correction factors would appreciably weaken the constraints.  Given the potential systematic problems with known astrophysical WDM constraints, and the present lack of experimental determination from particle physics experiments (see, e.g., Lasserre et al. 2014), it is useful to explore different probes. \n\nA first approach is to compare predicted mass distributions with observed luminosity functions of  galaxies at high redshifts. In fact, the exponential suppression of small-scale structures characteristic of WDM models should yield amplified differences with respect to CDM at early cosmic times, since in any hierarchical model of structure formation low-mass objects are the first to collapse. An observed abundance of galaxies at early epochs can in principle set strong lower limits on the WDM particle mass (e.g. Barkana, Haiman \\& Ostriker 2001; Mesinger, Perna \\& Haiman 2005). This is the approach taken by Schultz et al. (2014; see also Dayal, Mesinger, Pacucci 2015), who compare \nUV luminosity functions of dropout galaxies at $z>6$ with the predicted mass function of different WDM models, \nafter connecting the UV luminosity to the DM halo mass through the abundance matching technique.\n The limit of this approach is constituted by the flux limits of present surveys. Observational abundances at high redshifts $z\\approx 6$ can be derived only for relatively bright objects $M_{UV}<-16$, corresponding to DM masses $M\\geq 10^{10}\\,M_{\\odot}$. Thus, at present such an approach does not allow to probe  different WDM models in the low-mass regime  $M\\leq 10^9\\,M_{\\odot}$ where the differences are maximal; \n as a consequence, relatively loose limits $m_X\\gtrsim 1$ keV can be set through such a  method. \n  \nIn this paper we take a different approach to set stringent limits on $m_X$. We choose to compare with the UV luminosity functions at a lower redshift \n$z\\approx 2$ but extending to extremely faint magnitudes $M_{UV}\\geq -13$. Although at such redshifts the \ndifferences among the predicted abundances are smaller than at $z\\gtrsim 6$, the gain in magnitude allows to probe the mass distribution down to extremely small DM masses $M_{DM}\\leq 10^9\\,M_{\\odot}$, making possible to obtain tighter and robust limits on the WDM candidate mass. \nIn particular, the deep UV imaging of lensing clusters with the {\\it Hubble Space Telescope}  (HST) has recently allowed to exploit the large magnifications provided by the cluster potential wells to achieve unprecedented detection limit, detecting galaxies down to $M_{UV}=-13$, i.e., 100 times fainter than previous surveys (Alavi et al. 2014). Although incompleteness correction and cluster mass model can still constitute delicate issues, this strategy of surveying large numbers of background galaxies with deep observations of lensing clusters has already been adopted with deep Hubble imaging of the Frontier Fields beginning in Cycle 21. Thus the approach we propose here will be soon applicable to compare with a much larger amount of  data. As we shall show below, the above detection limits allow to probe the mass function of galaxies predicted by WDM with different particle  masses $m_X$  in the region around and below $M=10^9\\,M_{\\odot}$ where the different models predict maximally divergent abundances. In addition, as we shall show below, at such galaxy masses the WDM mass functions show a maximum which can be compared with \nthe observed abundances to set limits to the particle mass $m_X$ which are in practice independent on the specific baryon physics adopted to connect UV magnitudes to DM masses. \n\nTo compare with observations, we derive the galaxy DM mass function from the Monte Carlo realizations of the history of DM halo and sub-halos (see Menci et al. 2012 and references therein). The processes included in the computation are recalled in Sect. 2, where we also test our model results against recent N-body simulations. In Sect. 3 we connect \nthe DM masses to UV luminosity, and parametrise the present uncertainties in the $L_{UV}/M$ relation through a \nstar formation efficiency $\\eta$. This allows us to compare (Sect. 4) the observed densities derived from the deep UV luminosity function by Alavi et al. (2014) with the DM mass function computed assuming different WDM thermal relic masses ranging from 1 keV to 2 keV, for a wide range of possible values of $\\eta$. We devote Sect. 5 to conclusions. \n\n\\section{Method}\n\n\\subsection{The History of Dark Matter Halos in CDM and WDM Cosmology}\n\nThe backbone of the computation is constituted by the collapse history of DM halos on progressively larger scales. Realizations of such histories are generated through a Monte Carlo procedure on the basis of the merging rates given by the Extended Press \\& Schechter (EPS) theory, see Bond et al. (1991); Bower (1991); Lacey \\& Cole (1993). In this framework, the  evolution of the DM condensations is determined by \nthe  power spectrum $P(k)$ of DM perturbations (in terms of the wave-number $k=2\\pi/r$) through the variance of the primordial DM density field. This is a function of the mass scale $M\\propto \\overline{\\rho} r^3$ of the DM density perturbations (and of the background density $\\overline{\\rho}$) given by \n\n", "index": 1, "text": "\\begin{equation} \n\\sigma^2(M)=\\int {dk\\,k^2\\over 2\\,\\pi^2}\\,P(k)\\,W(kr)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\sigma^{2}(M)=\\int{dk\\,k^{2}\\over 2\\,\\pi^{2}}\\,P(k)\\,W(kr)\" display=\"block\"><mrow><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>k</mi></mpadded><mo>⁢</mo><msup><mi>k</mi><mn>2</mn></msup></mrow><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><msup><mi>π</mi><mn>2</mn></msup></mrow></mfrac></mpadded><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>⁢</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 16819, "prevtext": "\nwhere $W(kr)$ is the window function (see Peebles 1993). For the latter, here we adopt a sharp-$k$ form (a tophat sphere in Fourier space) with a halo mass assigned to the filter scale by the relation $M = 4\\pi\\,\\overline{\\rho} (cr)^3/3$ with $c = 2.7$ (Schneider et al. 2013). In fact, both theoretical arguments (Benson et al. 2013) and numerical experiments (see Schneider et al. 2012; 2013; Angulo et al. 2013) show that the resulting mass distributions and EPS merger trees (conditional mass function) provide an excellent fit to N-body results for a wide range of DM masses and redshifts (see Schneider 2015). \n\nThus, the linear power spectrum $P(k)$ determines the history of collapse, the evolution, and  the mass distribution of DM halos. For the CDM cosmology we adopt the form $P_{CDM}(k)$ given by Bardeen et al. (1986). The WDM spectrum $P_{WDM}(k)$ is suppressed with respect to the CDM case below a characteristic scale depending on the mass of the WDM particles (and, for non-thermal particles, also on their mode of production; see Kusenko 2009; Destri, de Vega, Sanchez 2013a); in fact, the large thermal velocities of the lighter WDM particles erase the perturbations with size comparable to and below the free- streaming scale $r_{fs}$. In particular, if WDM is composed by relic thermalized particles, the suppression factor can be parametrized as (Bode, Ostriker \\& Turok 2001; see also Viel et al. 2005; Destri, de Vega, Sanchez 2013a)\n\n", "index": 3, "text": "\\begin{equation}\n{P_{WDM}(k)\\over P_{CDM}(k)}=\\Big[1+(\\alpha\\,k)^{2\\,\\mu}\\Big]^{-10/\\mu}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{P_{WDM}(k)\\over P_{CDM}(k)}=\\Big{[}1+(\\alpha\\,k)^{2\\,\\mu}\\Big{]}^{-10/\\mu},\" display=\"block\"><mrow><mrow><mfrac><mrow><msub><mi>P</mi><mrow><mi>W</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>P</mi><mrow><mi>C</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">[</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mpadded width=\"+1.7pt\"><mi>α</mi></mpadded><mo>⁢</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mi>μ</mi></mrow></msup></mrow><mo maxsize=\"160%\" minsize=\"160%\">]</mo></mrow><mrow><mo>-</mo><mrow><mn>10</mn><mo>/</mo><mi>μ</mi></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nwhere $\\Omega_X$ is the WDM density parameter, $h$ is the Hubble constant in units of 100 km/s/Mpc, and $\\mu=1.12$; to our purpose the above expression for the suppression is equivalent to that found by Destri, de Vega, Sanchez (2013a). \nA similar expression \nholds for sterile neutrinos provided one substitutes the mass $m_X$ with a mass $m_{sterile}$ adopting proper conversion factors.\nNote that different relations between $m_{sterile}$ and $m_X$ hold when different production mechanisms are considered (see Kusenko 2009 for a review, and Lovell 2015 for a recent discussion).\nThree typical sterile neutrino models are the  Dodelson Widrow (DW) model, the Shi Fuller (SF) resonant production model (depending on the lepton asymmetry $\\mathcal L$) and the neutrino Minimal Standard Model ($\\nu$MSM).  The masses of the WDM particles in different production models giving the same power spectrum are related to the thermal relic mass $m_X$ according to the following formulas (Destri, de Vega and Sanchez 2013a): \n$m_{DW} \\simeq 2.85$ keV $(m_X/{\\rm keV})^{4/3}$,  $m_{SF}\\simeq 2.55\\,m_X$ (in the case of $\\mathcal L=0$), and $m_{\\nu\\,MSM} \\simeq1.9\\,m_X$. Such conversions are based on \nthe WDM primordial spectrum of fermions decoupling out of thermal equilibrium, computed by solving the evolution Volterra integral equations derived from the linearized Boltzmann-Vlasov equations in De Vega \\& Sanchez (2012). Note however that the best-fit expressions for the numerically computed power spectra of non-thermal particles provided by different authors may \n differ in the literature: for a discussion concerning the accuracy of the above conversion factors and the comparison with previous literature (including Viel et al. 2005) we refer to  Destri, de Vega and Sanchez (2013a).\n\nThe characteristic scale of power suppression due to free streaming in WDM can be quantified through the â\u0080\u0098half-modeâ\u0080\u0099 scale at which the WDM transfer function drops to 1/2 (Schneider et al. 2012). This is given by (see Schneider et al. 2012) \n\n", "itemtype": "equation", "pos": 16925, "prevtext": "\n\n", "index": 5, "text": "$${\\rm ~with}~~~~~ \n\\alpha=0.049 \\,\n\\Bigg[{\\Omega_X\\over 0.25}\\Bigg]^{0.11}\\,\n\\Bigg[{m_X\\over {\\rm keV}}\\Bigg]^{-1.11}\\,\n\\Bigg[{h\\over 0.7}\\Bigg]^{1.22}\\,h^{-1}\\,{\\rm Mpc},  \\nonumber\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"{\\rm\\leavevmode\\nobreak\\ with}\\leavevmode\\nobreak\\ \\leavevmode\\nobreak\\ %&#10;\\leavevmode\\nobreak\\ \\leavevmode\\nobreak\\ \\leavevmode\\nobreak\\ \\alpha=0.049\\,%&#10;\\Bigg{[}{\\Omega_{X}\\over 0.25}\\Bigg{]}^{0.11}\\,\\Bigg{[}{m_{X}\\over{\\rm keV}}%&#10;\\Bigg{]}^{-1.11}\\,\\Bigg{[}{h\\over 0.7}\\Bigg{]}^{1.22}\\,h^{-1}\\,{\\rm Mpc},\" display=\"block\"><mrow><mrow><mrow><mpadded lspace=\"5pt\" width=\"+5pt\"><mi>with</mi></mpadded><mo mathvariant=\"italic\" separator=\"true\">    </mo><mi>α</mi></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mn>0.049</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mi>X</mi></msub><mn>0.25</mn></mfrac><mo maxsize=\"260%\" minsize=\"260%\">]</mo></mrow><mn>0.11</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mfrac><msub><mi>m</mi><mi>X</mi></msub><mi>keV</mi></mfrac><mo maxsize=\"260%\" minsize=\"260%\">]</mo></mrow><mrow><mo>-</mo><mn>1.11</mn></mrow></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mfrac><mi>h</mi><mn>0.7</mn></mfrac><mo maxsize=\"260%\" minsize=\"260%\">]</mo></mrow><mn>1.22</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>h</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mpadded><mo>⁢</mo><mi>Mpc</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nwhere $\\overline{\\rho}$ is the background density of the Universe. For values of thermal relic masses $m_X=1-2$ keV considered here, one obtains $M_{1/2}=1-5\\cdot 10^9\\,M_{\\odot}$. As shown by several  authors (Schneider et al. 2012, 2013; Angulo et al. 2013), at this scale the DM mass function saturates and starts to turn off. Thus, effectively constraining the WDM particle mass requires probing the abundance of DM halos down to masses $M\\approx \\,10^9\\,M_{\\odot}$. \nBelow such a mass scale, numerical simulations in WDM cosmology have long been subject to artificial fragmentation (see, e.g., Wang \\& White 2007). With the advances in the resolution, it has been shown that \nat scales below $M_{1/2}$ simulations yield a number of 'proto-halos', where the density peak has not fully virialised (Angulo et al. 2013); at these scales, they outnumber the virialized halos. \nIn this paper we are not interested in providing a detailed and improved description of the mass function, but rather to derive conservative upper limits to the abundance of low-mass galaxies to compare with observations in order to obtain constraints on the WDM particle mass. Thus,  we consider as an upper limit to the abundance of low-mass galaxies the total (halo+proto-halo) mass function, which is limited from above by the relation  (Angulo et al. 2013): \n\n", "itemtype": "equation", "pos": 19147, "prevtext": "\nwhere $\\Omega_X$ is the WDM density parameter, $h$ is the Hubble constant in units of 100 km/s/Mpc, and $\\mu=1.12$; to our purpose the above expression for the suppression is equivalent to that found by Destri, de Vega, Sanchez (2013a). \nA similar expression \nholds for sterile neutrinos provided one substitutes the mass $m_X$ with a mass $m_{sterile}$ adopting proper conversion factors.\nNote that different relations between $m_{sterile}$ and $m_X$ hold when different production mechanisms are considered (see Kusenko 2009 for a review, and Lovell 2015 for a recent discussion).\nThree typical sterile neutrino models are the  Dodelson Widrow (DW) model, the Shi Fuller (SF) resonant production model (depending on the lepton asymmetry $\\mathcal L$) and the neutrino Minimal Standard Model ($\\nu$MSM).  The masses of the WDM particles in different production models giving the same power spectrum are related to the thermal relic mass $m_X$ according to the following formulas (Destri, de Vega and Sanchez 2013a): \n$m_{DW} \\simeq 2.85$ keV $(m_X/{\\rm keV})^{4/3}$,  $m_{SF}\\simeq 2.55\\,m_X$ (in the case of $\\mathcal L=0$), and $m_{\\nu\\,MSM} \\simeq1.9\\,m_X$. Such conversions are based on \nthe WDM primordial spectrum of fermions decoupling out of thermal equilibrium, computed by solving the evolution Volterra integral equations derived from the linearized Boltzmann-Vlasov equations in De Vega \\& Sanchez (2012). Note however that the best-fit expressions for the numerically computed power spectra of non-thermal particles provided by different authors may \n differ in the literature: for a discussion concerning the accuracy of the above conversion factors and the comparison with previous literature (including Viel et al. 2005) we refer to  Destri, de Vega and Sanchez (2013a).\n\nThe characteristic scale of power suppression due to free streaming in WDM can be quantified through the â\u0080\u0098half-modeâ\u0080\u0099 scale at which the WDM transfer function drops to 1/2 (Schneider et al. 2012). This is given by (see Schneider et al. 2012) \n\n", "index": 7, "text": "\\begin{equation}\nM_{1/2}={4\\pi\\over 3}\\,\\overline{\\rho}\\,\\Bigg[\\pi\\alpha\\Big(2^{\\mu/5}-1\\Big)^{-{1\\over 2\\mu}}\\Bigg]^{3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"M_{1/2}={4\\pi\\over 3}\\,\\overline{\\rho}\\,\\Bigg{[}\\pi\\alpha\\Big{(}2^{\\mu/5}-1%&#10;\\Big{)}^{-{1\\over 2\\mu}}\\Bigg{]}^{3}\" display=\"block\"><mrow><msub><mi>M</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msub><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow><mn>3</mn></mfrac></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>ρ</mi><mo>¯</mo></mover></mpadded><mo>⁢</mo><msup><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mrow><mi>π</mi><mo>⁢</mo><mi>α</mi><mo>⁢</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><msup><mn>2</mn><mrow><mi>μ</mi><mo>/</mo><mn>5</mn></mrow></msup><mo>-</mo><mn>1</mn></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mrow><mo>-</mo><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>μ</mi></mrow></mfrac></mrow></msup></mrow><mo maxsize=\"260%\" minsize=\"260%\">]</mo></mrow><mn>3</mn></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nHere $N_{CDM}$ is the mass function in the CDM case.\nThus, to derive conservative limits for the WDM particle mass, in the following we shall show the results of our computation for both the virialized halo and the halo+proto-halo population: the first is obtained from EPS computed using the variance in Eq. 1 (with a sharp-k filter for the window function) and the spectrum in eq. 2 (depending on the chosen WDM mass $m_X$); the latter is obtained from CDM merging trees after artificially suppressing the abundance of DM haloes with masses $M\\leq M_{1/2}$ with a probability $N/N_{CDM}$ (depending on the chosen WDM mass through the corresponding half-mode mass $M_{1/2}$ in eq. 3).\n\nSince our aim is to compute solid upper limits for the WDM mass function (and hence lower limits for the WDM particle mass), we do not explicitly include the effect of residual thermal velocities (on top of gravitationally induced velocities) derived by Benson et al. (2013). In fact,  \n their implementation is still matter of debate, and several authors argue that their effect is negligible for the models we consider\n (Macci\\'o et al. 2012; Shao et al. 2013; Schneider 2013; Angulo et al. 2013). In any case, all authors agree that their inclusion would provide an even larger suppression of the WDM abundances below $M_{1/2}$ (see, e.g., Benson et al. 2013), so that neglecting their effect allow us to derive conservative constraints. \n\n\n\\begin{center}\n\\vspace{-0.1cm}\n\\scalebox{0.38}[0.38]{\\rotatebox{-0}{\\includegraphics{./fig1.pdf}}}\n\\scalebox{0.36}[0.36]{\\rotatebox{-0}{\\includegraphics{./fig1b.pdf}}}\n\\end{center}\n\\vspace{-0.3cm }\n {\\footnotesize \nFig. 1. To illustrate the reliability of our model in predicting the galactic DM mass functions we compare with \ndifferent existing simulations. Top Panel: The  mass functions of isolated halos at $z=2.4$ computed from our model for the CDM case (solid black line) and for WDM with $m_X=1$ keV (dashed line) assuming a sharp-k filter. We compare with available simulations at the same redshift by Schneider et al. (2013) for the same DM models. Bottom Panels: To test our computation of the dynamical evolution of sub-halos, we compare with existing \nsimulations in the CDM case. The cumulative mass function of sub-halos computed in our model in the CDM case (solid lines) are compared with results from the CDM Bolshoi simulations (Klypin et al. 2011) for the two different ranges of host halo masses, as indicated in the panels. \n\\vspace{0.2cm}}\n\nAfter computing the histories of host DM halos with the EPS approach described above, we follow the \nhistory of collapsed DM clumps once they are included in larger virialized host DM halos (details on the computation are given in Menci et al. 2012; 2014). Such sub-halos, associated to the single galaxies,  are tracked in our Monte Carlo simulations following the  canonical procedure adopted by semi-analytic models of galaxy formation: they may survive as satellites, or merge to form larger galaxies due to binary aggregations, or coalesce into the central dominant galaxy due to dynamical friction  (see, e.g., Gan 2010; Sommerville \\& Dav\\'e 2014 and references therein).  \n \n\nTo test our computation we first compare the resulting mass function of isolated halos (host halos) against existing N-body simulations at $z=2.4$, close to the redshift range we shall focus on when we compare with  observed luminosity functions. As shown in the left panel of Fig. 1, the agreement is excellent for isolated virialized halos using a sharp-k filter in the computation of the variance in eq. 1. Testing our computation for the dynamical evolution of sub-halos associated to individual galaxies also leads to a very good agreement with the results from the Bolshoi simulations (Klypin et al. 2011) at the faint end of the distributions for different host halo masses (right panels in Fig. 1); an analogous comparison with the sub-halo mass function resulting from the Millenium simulations is presented in Nieremberg et al. (2013), and also shows a good matching. \n\n\nThus, our computation provides reliable, tested results that can be used to predict galaxy mass functions for \ndifferent WDM models, and to compare with the observed UV luminosity function at $z=2$. To this aim, we need to quantify the relation between the UV magnitude of galaxies and the mass of their DM halo, as we discuss in the next section.\n\n\\subsection{Relating UV luminosities to DM masses}\n\nThe deepest LF derived at $z=2$ so far are those by Alavi et al. (2014) extending down to $M_{UV}=-13$ at $z\\approx 2$. \nThe large density (per unit magnitude) $N\\approx 2$ Mpc$^{-3}$ of galaxies at such faint magnitude constrains  \n the abundance of corresponding DM halos predicted by different DM models. To estimate the range of  masses of the DM halo hosting such low-luminosity galaxies we start from the well established relation between UV magnitude and the star formation rate (expressed in $M_{\\odot}\\,yr^{-1}$, see Madau et al. 1998)\n\n", "itemtype": "equation", "pos": 20624, "prevtext": "\nwhere $\\overline{\\rho}$ is the background density of the Universe. For values of thermal relic masses $m_X=1-2$ keV considered here, one obtains $M_{1/2}=1-5\\cdot 10^9\\,M_{\\odot}$. As shown by several  authors (Schneider et al. 2012, 2013; Angulo et al. 2013), at this scale the DM mass function saturates and starts to turn off. Thus, effectively constraining the WDM particle mass requires probing the abundance of DM halos down to masses $M\\approx \\,10^9\\,M_{\\odot}$. \nBelow such a mass scale, numerical simulations in WDM cosmology have long been subject to artificial fragmentation (see, e.g., Wang \\& White 2007). With the advances in the resolution, it has been shown that \nat scales below $M_{1/2}$ simulations yield a number of 'proto-halos', where the density peak has not fully virialised (Angulo et al. 2013); at these scales, they outnumber the virialized halos. \nIn this paper we are not interested in providing a detailed and improved description of the mass function, but rather to derive conservative upper limits to the abundance of low-mass galaxies to compare with observations in order to obtain constraints on the WDM particle mass. Thus,  we consider as an upper limit to the abundance of low-mass galaxies the total (halo+proto-halo) mass function, which is limited from above by the relation  (Angulo et al. 2013): \n\n", "index": 9, "text": "\\begin{equation}\nN=N_{CDM}\\,\\Bigg(1+{M_{1/2}\\over M}\\Bigg)^{-1}~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"N=N_{CDM}\\,\\Bigg{(}1+{M_{1/2}\\over M}\\Bigg{)}^{-1}\\leavevmode\\nobreak\\ .\" display=\"block\"><mrow><mrow><mi>N</mi><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mrow><mi>C</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow></msub></mpadded><mo>⁢</mo><mpadded width=\"+5pt\"><msup><mrow><mo maxsize=\"260%\" minsize=\"260%\">(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><msub><mi>M</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msub><mi>M</mi></mfrac></mrow><mo maxsize=\"260%\" minsize=\"260%\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nwhere $E_{B-V}$ is the color excess (assuming a Calzetti extinction law), and the first equality follows from expressing the star formation rate $\\dot  m_*=m_g/\\tau_*$ in terms of the gas mass $m_g$ and of the gas conversion timescale $\\tau_*$ (Schmidt 1959; Kennicutt 1998; see Santini et al 2014 and references therein). \nTo connect the above expression to the mass of the galactic DM halos we define the star formation efficiency factor \n\n", "itemtype": "equation", "pos": 25712, "prevtext": "\nHere $N_{CDM}$ is the mass function in the CDM case.\nThus, to derive conservative limits for the WDM particle mass, in the following we shall show the results of our computation for both the virialized halo and the halo+proto-halo population: the first is obtained from EPS computed using the variance in Eq. 1 (with a sharp-k filter for the window function) and the spectrum in eq. 2 (depending on the chosen WDM mass $m_X$); the latter is obtained from CDM merging trees after artificially suppressing the abundance of DM haloes with masses $M\\leq M_{1/2}$ with a probability $N/N_{CDM}$ (depending on the chosen WDM mass through the corresponding half-mode mass $M_{1/2}$ in eq. 3).\n\nSince our aim is to compute solid upper limits for the WDM mass function (and hence lower limits for the WDM particle mass), we do not explicitly include the effect of residual thermal velocities (on top of gravitationally induced velocities) derived by Benson et al. (2013). In fact,  \n their implementation is still matter of debate, and several authors argue that their effect is negligible for the models we consider\n (Macci\\'o et al. 2012; Shao et al. 2013; Schneider 2013; Angulo et al. 2013). In any case, all authors agree that their inclusion would provide an even larger suppression of the WDM abundances below $M_{1/2}$ (see, e.g., Benson et al. 2013), so that neglecting their effect allow us to derive conservative constraints. \n\n\n\\begin{center}\n\\vspace{-0.1cm}\n\\scalebox{0.38}[0.38]{\\rotatebox{-0}{\\includegraphics{./fig1.pdf}}}\n\\scalebox{0.36}[0.36]{\\rotatebox{-0}{\\includegraphics{./fig1b.pdf}}}\n\\end{center}\n\\vspace{-0.3cm }\n {\\footnotesize \nFig. 1. To illustrate the reliability of our model in predicting the galactic DM mass functions we compare with \ndifferent existing simulations. Top Panel: The  mass functions of isolated halos at $z=2.4$ computed from our model for the CDM case (solid black line) and for WDM with $m_X=1$ keV (dashed line) assuming a sharp-k filter. We compare with available simulations at the same redshift by Schneider et al. (2013) for the same DM models. Bottom Panels: To test our computation of the dynamical evolution of sub-halos, we compare with existing \nsimulations in the CDM case. The cumulative mass function of sub-halos computed in our model in the CDM case (solid lines) are compared with results from the CDM Bolshoi simulations (Klypin et al. 2011) for the two different ranges of host halo masses, as indicated in the panels. \n\\vspace{0.2cm}}\n\nAfter computing the histories of host DM halos with the EPS approach described above, we follow the \nhistory of collapsed DM clumps once they are included in larger virialized host DM halos (details on the computation are given in Menci et al. 2012; 2014). Such sub-halos, associated to the single galaxies,  are tracked in our Monte Carlo simulations following the  canonical procedure adopted by semi-analytic models of galaxy formation: they may survive as satellites, or merge to form larger galaxies due to binary aggregations, or coalesce into the central dominant galaxy due to dynamical friction  (see, e.g., Gan 2010; Sommerville \\& Dav\\'e 2014 and references therein).  \n \n\nTo test our computation we first compare the resulting mass function of isolated halos (host halos) against existing N-body simulations at $z=2.4$, close to the redshift range we shall focus on when we compare with  observed luminosity functions. As shown in the left panel of Fig. 1, the agreement is excellent for isolated virialized halos using a sharp-k filter in the computation of the variance in eq. 1. Testing our computation for the dynamical evolution of sub-halos associated to individual galaxies also leads to a very good agreement with the results from the Bolshoi simulations (Klypin et al. 2011) at the faint end of the distributions for different host halo masses (right panels in Fig. 1); an analogous comparison with the sub-halo mass function resulting from the Millenium simulations is presented in Nieremberg et al. (2013), and also shows a good matching. \n\n\nThus, our computation provides reliable, tested results that can be used to predict galaxy mass functions for \ndifferent WDM models, and to compare with the observed UV luminosity function at $z=2$. To this aim, we need to quantify the relation between the UV magnitude of galaxies and the mass of their DM halo, as we discuss in the next section.\n\n\\subsection{Relating UV luminosities to DM masses}\n\nThe deepest LF derived at $z=2$ so far are those by Alavi et al. (2014) extending down to $M_{UV}=-13$ at $z\\approx 2$. \nThe large density (per unit magnitude) $N\\approx 2$ Mpc$^{-3}$ of galaxies at such faint magnitude constrains  \n the abundance of corresponding DM halos predicted by different DM models. To estimate the range of  masses of the DM halo hosting such low-luminosity galaxies we start from the well established relation between UV magnitude and the star formation rate (expressed in $M_{\\odot}\\,yr^{-1}$, see Madau et al. 1998)\n\n", "index": 11, "text": "\\begin{equation}\nlog\\,\\dot m_*=log\\,\\Big(m_*/\\tau_*\\Big)=-0.4\\,\\Big(M_{UV}+18.16-9.97\\,E_{B-V}\\Big)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"log\\,\\dot{m}_{*}=log\\,\\Big{(}m_{*}/\\tau_{*}\\Big{)}=-0.4\\,\\Big{(}M_{UV}+18.16-9%&#10;.97\\,E_{B-V}\\Big{)}\" display=\"block\"><mrow><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>g</mi></mpadded><mo>⁢</mo><msub><mover accent=\"true\"><mi>m</mi><mo>˙</mo></mover><mo>*</mo></msub></mrow><mo>=</mo><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>g</mi></mpadded><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><msub><mi>m</mi><mo>*</mo></msub><mo>/</mo><msub><mi>τ</mi><mo>*</mo></msub></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mn>0.4</mn></mpadded><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><mrow><msub><mi>M</mi><mrow><mi>U</mi><mo>⁢</mo><mi>V</mi></mrow></msub><mo>+</mo><mn>18.16</mn></mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mn>9.97</mn></mpadded><mo>⁢</mo><msub><mi>E</mi><mrow><mi>B</mi><mo>-</mo><mi>V</mi></mrow></msub></mrow></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nSubstituted in the previous equation, this allows to recast the Eq. 4 in the form \n\n", "itemtype": "equation", "pos": 26268, "prevtext": "\nwhere $E_{B-V}$ is the color excess (assuming a Calzetti extinction law), and the first equality follows from expressing the star formation rate $\\dot  m_*=m_g/\\tau_*$ in terms of the gas mass $m_g$ and of the gas conversion timescale $\\tau_*$ (Schmidt 1959; Kennicutt 1998; see Santini et al 2014 and references therein). \nTo connect the above expression to the mass of the galactic DM halos we define the star formation efficiency factor \n\n", "index": 13, "text": "\\begin{equation}\n\\eta=(m_*/M)\\,(m_g/m_*)/(10^8{\\rm yrs}/\\tau_*)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\eta=(m_{*}/M)\\,(m_{g}/m_{*})/(10^{8}{\\rm yrs}/\\tau_{*})\" display=\"block\"><mrow><mi>η</mi><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mo>*</mo></msub><mo>/</mo><mi>M</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mi>g</mi></msub><mo>/</mo><msub><mi>m</mi><mo>*</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mn>10</mn><mn>8</mn></msup><mo>⁢</mo><mi>yrs</mi></mrow><mo>/</mo><msub><mi>τ</mi><mo>*</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01820.tex", "nexttext": "\nwhere we have taken  $E_{B-V}\\approx 0$ (as estimated by Alavi et al. 2014 for the faintest galaxies in their sample). Different observations allow to estimate the range of possible values for $\\eta$. \n\nMeasurements of the conversion timescale at $z=2$ yield \n$\\tau_*=0.5-2\\cdot 10^8$ yrs (Daddi et al. 2010; Genzel et al. 2010; Santini et al 2014; Silverman et al. 2015). \n\nThe gas-to-stars ratio $m_g/m_*$ is usually expressed in terms of the  total gas fraction $f_g=m_g/(m_g+m_*)$; recent estimates indicate that such a fraction increases with redshift and with decreasing stellar mass; measurements derived from CO surveys  (see Tacconi et al. 2013; Conselice et al. 2013;  Silverman et al. 2015) and from deep IR {\\it Herschel} observations of dust emission (Magdis et al. 2012; Santini et al. 2014) yield a $f_g=0.2-0.65$ for the faintest galaxies at $z=2$, corresponding to a range $m_g/m_*=f_g/(1-f_g)=0.4-2$. \n\nAs for the star-to-DM ratio $(m_*/M)$, this is subject to large uncertainties, as shown by several existing papers. Works based on the extrapolation of abundance matching relations between the observed stellar mass function and the CDM halo mass distribution (see Moster et al. 2013; Behroozi et al. 2014) show that at $z=2$ it takes values in the range $-3\\leq log(m_*/M)\\leq -2$, a range supported also by high-resolution hydrodynamical N-body simulations (see Hopkins et al. 2014) in the CDM framework. However, larger values are indicated by the kinematics of dwarf galaxies (Sawala et al. 2011; Ferrero et al. 2012) and in particular of the Milky Way and M31 dwarf spheroidal galaxies (see Sawala et al. 2015 and references therein; Di Cintio et al. 2015; Papastergis et al. 2015). \nWe note in WDM cosmology the $m_*/M$ ratio takes values systematically larger than in the CDM case, both when  this is estimated through the abundance matching technique (due to the flatter shape of the mass function of DM halos in WDM cosmologies) and from estimates based on the galaxy kinematics (due to the lower concentration of WDM halos; de Vega, Salucci, Sanchez 2014; Papastergis et al 2015). Here we shall conservatively consider the whole interval $-3.2\\leq log(m_*/M)\\leq -1.5$ as compatible with present uncertainties for all  the DM models presented here. \n\nGiven the above observational constraints we obtain the interval $-3.6\\leq log\\,\\eta\\leq -1$\nfor the allowed range of the combination $\\eta$ at $z=2$. This corresponds to a range $10^7\\leq M/M_{\\odot}\\leq 3\\cdot 10^9$ for the possible values of the halo mass of galaxies associated to $M_{UV}=-13$ at $z=2$, and - according to the discussion above - \nto stellar masses $10^5\\lesssim m_*/M_{\\odot}\\lesssim 10^8$. \n\nWe underline that the above measurements for $\\tau_*$, $f_g$, $m_*/M$ are obtained for significantly brighter galaxies than $M_{UV}=-13$. \nWe note, however, that similar extrapolations based on $\\dot m_*-m_*$ relation at $z\\approx 2$ (the \"main sequence\", see Noeske et al. 2007;  Speagle et al. 2014)\nyield consistent results. Measurements of such a relation from recent large  surveys \nyield $log\\,m_*/M_{\\odot}=7.1\\pm 0.7$ for galaxies with star formation rates corresponding to $M_{UV}=-13$; direct fitting the $M_{UV}$-$m_*$ relation for objects in the $1.5<z<2.5$ range in CANDELS\nGOODS-South (on the basis of the available release of photometric redshifts and\nrest-frame properties from Dahlen et al. 2013 and Santini et al. 2015) yields $log\\,m_*/M_{\\odot}=6.7\\pm 0.5$ for galaxies with $M_{UV}=-13$ (notice that the uncertainties quoted above do not include the possible effects of bursty star formation, which could enlarge the scatter in the star formation main sequence for low stellar masses, \nsee Dominguez et al. 2015).\n\nThus, we are confident that the range $10^7\\leq M/M_{\\odot}\\leq 5\\cdot 10^9$ covers the possible values of DM mass of galaxies corresponding to $M_{UV}=-13$. Comparing the observed abundance of such galaxies at $z=2$ with predictions for the abundance of the corresponding DM masses in different DM models constitutes the subject of the next section. \n\n\\section{Results}\n\nTo effectively discriminate among different WDM models we need to probe the abundance of galaxies \ndown to DM masses $M\\sim 10^7-10^9$ $M_{\\odot}$, corresponding to UV magnitudes as faint as \n$M_{UV}\\geq -14$. This is not trivial: even with \nthe new Wide-Field Camera 3 (WFC3) on the HST selecting star-forming galaxies  via the Lyman break technique at $1 < z < 3$ (Oesch et al. 2010; Hathi et al. 2010; Parsa et al. 2015) the detection is limited by the depth of the shallow UV imaging to galaxies with absolute UV magnitude (measured at 1500 ${\\AA}$) brighter than $M_{UV}=â\u0088\u009219$. A recent burst in the study of ultra-faint galaxies has been made possible \nby using foreground massive systems as lenses to magnify background galaxies. This strong gravitational lensing preserves  surface brightness while spreading out  the emitted light over a larger area and magnifying it. Over the last decade, this has been used to study individual lensed galaxies in great detail (e.g., Pettini et al. 2002; Siana et al. 2008, 2009; Stark et al. 2008; Jones et al. 2010; Yuan et al. 2013). This approach has allowed\n to survey faint star-forming galaxies at $z\\approx 2$ behind the massive cluster A1689, reaching magnitudes 100 times fainter than previous surveys at the same redshift (Alavi et al. 2014). Since  the mass distribution of A1689 is well constrained, it was possible  to calculate the intrinsic sensitivity of the observations as a function of source plane position, allowing for accurate determinations of the effective volume as a function of luminosity, and hence for a determination of the luminosity function down to $M_{UV}=-13$. \n \nTo compare with the above measurements, we compute the mass function of galactic DM halos at $z=2$ as described in Sect. 2.1 for the CDM case and for WDM models with four different masses for the candidate DM particle (in terms of the  thermal relic mass): $m_X=1$ keV, $m_X=1.5$ keV; $m_X=1.8$ keV; $m_X=2$ keV; in all cases we adopted a matter density parameter $\\Omega_0=0.3$, a baryon density parameter $\\Omega_b=0.05$, a Dark Energy density parameter $\\Omega_{\\Lambda}=0.7$, and $h=0.7$. \nThe comparison with the observed abundance of faint galaxies with $M_{UV}=-13$ is performed considering different values of the star formation parameter in the range $-3.6\\leq log\\,\\eta\\leq -1$ for converting observed UV magnitudes (at 1500 ${\\AA}$) to DM masses after eq. 2. The results are shown in Fig. 2, where we also illustrate the effects of the theoretical uncertainties (sect. 2.1) in the computation of the DM mass function; these are represented by the solid areas whose lower and upper bounds correspond to assuming a sharp-k filter or the suppression factor $N/N_{CDM}$.\n\n\\begin{center}\n\\vspace{-0.cm}\n\\hspace{-0.2cm}\n\\scalebox{0.38}[0.38]{\\rotatebox{-0}{\\includegraphics{./fig2.pdf}}}\n\\end{center}\n\\vspace{-0.4cm }\n {\\footnotesize \nFig. 2. The predicted mass functions of galactic DM halos at $z=2$ corresponding to different thermal relic masses $m_X$ are compared with the observed abundance of faint  galaxies from Alavi et al. (2014) with $M_{UV}=-13$ (upper \nhatched rectangle) and $M_{UV}=-14$ (lower hatched rectangle). The latter have been converted from number density per unit magnitude to \n number density per unit $log M$. The height of the rectangles corresponds to the Poissonian errorbar given in Alavi et al. (2014), while their horizontal size corresponds to different values of the star formation parameter $\\eta$ (see text), as indicated by the small horizontal axis. \nFor each value of $m_X$, we bracket the uncertainties in the computation of the DM mass functions (discussed in Sect. 2.1) through the lower and upper bounds of the shaded regions, which correspond to assuming a sharp-k filter or the suppression factor $N/N_{CDM}$ (accounting also for proto-halos). \n\\vspace{0.2cm}}\n\n\nThe comparison (even allowing for an additional uncertainty of $\\sigma_{CV} \\approx 0.13$ in the observed density due to cosmic variance, see Alavi et al. 2014) sets a firm lower limit $m_X\\geq 1.8$ keV for the value of the thermal relic mass: the corresponding value of the sterile neutrino masses depends on the production scenarios (as discussed in Sect. 2.1) $m_{sterile}\\gtrsim 4.6$ keV for resonantly produced sterile neutrinos. WDM models with smaller values of the particle mass predict too low abundances compared to the observed value \nmeasured by Alavi et al. (2014) for any choice of the star formation efficiency $\\eta$.  On the other hand, particle masses $m_X\\sim 2-3$ keV yield galaxy number densities consistent with observations for a wide range of $\\eta$, while in the limit of $m_X\\gg 1$ we recover the generic CDM result that very inefficient star formation is required to match the observed galaxy abundances.\nWe stress that our results are {\\it conservative}  and are robust with respect to present uncertainties in the modelling of the WDM mass distribution and - most \nimportant - with respect to the details in the baryonic physics. In particular, they are robust with respect to: \n\\newline\ni) The specific value of the star formation efficiency $\\eta$ and consequently the effect of baryonic processes \n(like star formation, feedback) determining the efficiency of star formation for given mass of the host DM halo. \nThis is due to the fact that the ultra-deep observations we are comparing with allow us to probe the DM halo mass \nfunction in the mass range around the half-mode mass where the DM mass functions  are characterized by a maximum value.  \\newline\nii) The modeling of the effects of residual DM dispersion velocities on the mass function of DM haloes (see sect. 2.1): while in our computation these have not been included, their effect would be to provide a sharper decrease of the mass function at small masses (see, e.g., Benson et al. 2013), thus yielding tighter constraints.\n\\newline\niii) The kind of DM clumps hosting the UV emitting galaxies. In fact,  the upper boundaries of the solid filled  regions in Fig. 2 correspond to predictions including also proto-halos (see discussion in Sect. 2.1). \\newline\niv) The possible effects of UV background and reionization. Indeed, such effects go in the direction of  further suppressing the abundance of galaxies in low-mass halos (Sawala et al. 2015), so our  limits are conservative with respect to these processes. \n\nWe also note the importance of having pushed the magnitude limit of the measured luminosity functions to faint values.\nIndeed, limiting the computation to $M_{UV}\\leq -14-15$ (see Fig. 2) would only allow to obtain $m_X\\geq 1$, as indeed already obtained by Smith et al. (2014) based on the UV luminosity functions at $z>4$. \n\nWhile our results are robust with respect to uncertainties in the modelling of baryon physics and of the halo mass distribution, they descend from the observed number densities derived by Alavi et al. (2014) for the faintest galaxies in their sample. Thus, a delicate issue is constituted by the analysis they adopted to measure the luminosity function at the faint end. \n\nUncertainties on the result of Alavi et al. (2014) can\nbe due to the selection criterion of the $z=2$ galaxies, to completeness corrections,  and to the estimates of the magnification factors. \nAs for the first, the Alavi et al. (2014) galaxies have been selected through the widely used\nUV-dropout method; further check with spectroscopic redshifts\nof a sample of (intrinsically faint) magnified sources\ndemonstrated that this color criterion is able to recover 75\\% of the\ngalaxies with spectroscopic redshifts $1.8<z_{spec}<2.4$, thus demonstrating the robustness of\nthe adopted method.\nAs for the correction for incompleteness at faint magnitudes, this has been derived\n through detailed simulations: Alavi et al. (2014) studied the completeness as\na function of redshift, magnitude and magnification of the sources by\na Monte Carlo approach, randomly varying also the IGM transmission and\nthe dust attenuations. In addition, they take into account the photometric\nuncertainties, the size distribution of the galaxies and the\ninstrumental effects (e.g. charge transfer inefficiency). At $z\\sim 2$\nthe typical value for the completeness of galaxies of $M_{UV}\\sim -14$\nwith a magnification of 5 magnitudes is $\\sim 40\\%$. Under these\nconsiderations, we can conclude that the incompleteness correction \nis robust even at their faintest limits.\nThe uncertainties on the magnification can be the dominant source of\nerrors in Alavi et al. (2014) results. Indeed, one galaxy at $M_{UV}\\sim -14$ \nin the sample has a\nmagnification of 8 magnitudes (a factor $>1000$ in luminosity). While, the\nreliability of this galaxy is not discussed in detail in Alavi et al. (2014), \nthe luminosity function at $M_{UV}=-14$ and $M_{UV}=-13$ we compare with \nis derived from 4 galaxies in total (2 for each mag bin) with much lower magnifications, \nbetween 30 and 300 in luminosity.  \nThus, the uncertainties in the observed number densities may be larger than those \nrelated to the Poissonian noise: in  fact, the Schecher fit to the whole luminosity function \nin Alavi et al. (2014), when computed in the faintest magnitude bin $M_{UV}\\approx -13$, \nis centered significantly lower than the measured number density.\n\nTo discuss the impact of  the uncertainties in the measurements by Alavi et al. (2014) and to the aim of providing a baseline for future observations,  we compare in Fig. 3  the measured density of galaxies with $M_{UV}=-13$ with that  \nexpected for different WDM particle masses (expressed as above in terms of the equivalent thermal relic mass $m_X$); the color code shows the star formation efficiency parameter $\\eta$ adopted to convert from the DM mass function to the luminosity function. To discuss the impact of uncertainties in the measurement by Alavi et al. (2014), we show both the \n  Poissonian errorbars (hatched region) and (as a dashed line) the number density corresponding to the Schechter fit of the whole sample in  Alavi et al. (2014) computed at $M_{UV}=-13$. Relying on the number density corresponding to the binned data in Alavi et al. (2014) implies a  limit $m_X\\geq 1.8$ keV for the mass of the thermal relic WDM particle,  while assuming a larger uncertainty covering the whole range between the binned data and the Schechter fit yields a weaker but still significant limit $m_X\\geq 1.5$ keV.  \n \n\\begin{center}\n\\vspace{0.cm}\n\\scalebox{0.36}[0.36]{\\rotatebox{-0}{\\includegraphics{./fig3.pdf}}}\n\\end{center}\n\\vspace{-0.2cm }\n {\\footnotesize \nFig. 3. The predicted number density of galaxies per unit magnitude at $M_{UV}=-13$ at $z=2$ is shown as a function of different WDM particle mass (equivalent thermal relics mass $m_X$). The color code shows the star formation efficiency parameter $\\eta$ adopted to convert from DM mass function to the luminosity function. The number density corresponding (within their $1\\sigma$ errorbars) to the \nmeasurement by Alavi et al. (2014) is shown as a hatched region. The dashed line shows the number density corresponding to the Schechter fit of the whole sample in  Alavi et al. (2014) computed at $M_{UV}=-13$.\n\\vspace{0.2cm}} \n \n Next results from Frontier Field surveys will allow for a confirmation, or even for a strenghtning, of the limits on $m_X$. \n In fact, although the lensing cluster \nAbell 1689 is at the moment the most studied\ncluster with deep HST images and with the most constrained\nmagnification map (43 confirmed multiple systems with 24 measured \nspectroscopic redshifts, see Limousin et al. 2007; Coe et al. 2010), this database will be probably superseded\nsoon  by the advent of the HST Frontier Field initiative. In this respect, we stress that, although in this paper we focus on the comparison of different DM models with the measurements by Alavi et al. (2014),  the strategy of surveying large numbers of background galaxies with deep observations of lensing clusters has been adopted with deep Hubble imaging of the Frontier Fields. Thus, the results presented here will constitute a reference baseline for deriving limits on WDM particles from such surveys in the near future.\n \n For the moment, we note that matching a  given observed density \nrequires decreasing values of the $\\eta$ parameter for increasing values $m_X$. In particular, we recover the \nwell-known result that the  CDM  limit corresponding to large $m_X\\gg 1$ keV is associated to very inefficient  \nstar formation efficiencies $log\\,\\eta\\lesssim-3$ (unless a severe suppression of galaxy formation takes place in low mass DM halos with $M<10^9\\,M_{\\odot}$, see Sawala et al. 2015). Note that although the results in the plot have  been computed at $z=2$ they remain practically valid up to $z=4$, since the low-mass end of the mass function remains almost unchanged in such a range of redshifts.\n \nWe stress that the masses $m_X$ in Fig. 3 are the equivalent thermal relic masses. We note in particular that  a sterile neutrino with a mass $m_{sterile}=7$ keV,  constituting the best  candidate for a DM interpretation of the origin of the recent unidentified X-ray line reported in stacked observations of X-ray clusters (Bulbul et al. 2014; Boyarsky et al. 2014), corresponds (in the case of Shi-Fuller sterile neutrinos) to a thermal relic mass $m_X\\approx 2.8$ keV, which is consistent with the observed abundance of galaxies at $M_{UV}=-13$ for a wide range of star formation efficiency $-2.5\\leq log\\,\\eta\\leq -1.5$. Notice that -  \nsince for $m_X\\gtrsim 4$ keV the WDM scenario is nearly indistinguishable from Cold Dark Matter on the scales relevant for galaxy formation - our results define an effective window $1.8\\leq m_X\\lesssim 4$ keV for the (thermal relic) mass of WDM particles. Finally, the above limits are in agreement with the lower bound obtained from applying the Thomas-Fermi theory to compact dwarf galaxies (Destri, de Vega, Sanchez 2013b). \n \n\n\n\n\\section{Conclusions}\n\nWe showed how the magnitude limits $M_{UV}=-13$ of present and forthcoming UV luminosity functions allow to probe the number density of DM halos close to - or even below - the half-mode mass of Warm Dark Matter scenario, corresponding to scales $M\\sim 10^9\\,M_{\\odot}$. This provides strong constraints on the mass of the WDM particles which are in practice unaffected by  the details of the baryon physics determining the $L/M$ ratio which at present is measured only for brighter galaxies. In fact,  as long as the number density of ultra-faint galaxies is high\nenough, our approach yields constraints on the WDM particle mass that are independent on the star formation efficiency $\\eta$. \n \n\nWe applied our method to the  observations by Alavi et al. (2014), who use a foreground galaxy cluster as a lens to magnify background galaxies, so as to measure UV luminosity functions down to the above \nmagnitude limits. The measured abundance of galaxies in the faintest magnitude bin $M_{UV}\\approx -13$ \nyields a lower limit $m_X\\geq 1.8$ keV for the mass of WDM thermal relic particles, while a limit $m_X\\geq 1.5$ keV is obtained when we compare with \n the Schechter fit to the observed luminosity function presented in Alavi et al. (2014).\n\n   The corresponding lower limit for the sterile neutrino mass depends on the production model; for instance, \n the limit  $m_X\\geq 1.8$ keV  for thermal relics corresponds to  $m_{sterile}\\gtrsim 4.6$ keV in the case of  the Shi Fuller model with vanishing lepton asymmetry (see the discussion in sect. 2.1 for the conversion factors when other models are considered). The above limit is conservative and robust with respect to the theoretical uncertainties still affecting the computation of the mass function of galactic DM clumps (effects of residual thermal velocities, inclusion of proto-halos) and with respect to the details of the baryon physics (star formation efficiency $\\eta$ in a given DM halo, see sect. 2.2). \nTighter constraints will be achievable when observational determinations of $\\eta$ at $z=2$ will be available for galaxies with $M_{UV}=-13$ (see Fig.  3), or when  the number density of such faint galaxies at higher redshift $z\\approx 5-8$ will be measured or extrapolated: the latter approach has been proposed by Lapi \\& Danese (2015),  who suggest to constrain the abundance of such faint galaxies at high redshift by requiring \nthem to satisfy the Planck constraints on reionization.\n\n Of course, the above limit $m_X\\geq1.8$ keV relies on the statistics of ultra-faint field galaxies observed through the magnification provided by lensing clusters (see discussion in sect 3), which at present is limited to A1689.  \nHowever, the present statistical limitations will be  superseded  by the completion of the HST Frontier Field initiative. The Frontier Field campaign (e.g. Coe et al. 2015) is\ncollecting observations of 6 strong lensing clusters with 7 HST optical and\nnear infra-red  bands to a 5$\\sigma$ depth of ~28.5 (AB magnitudes). Most importantly, large efforts\nare ongoing to complement HST observations with ancillary imaging data\nfrom space-based UV (Siana et al. 2014, similarly to the Abell-1689 data\ndiscussed in Alavi et al. 2014) ground-based infra-red, \nSpitzer mid-infrared, and with deep follow-up spectroscopy \n(e.g. Wang et al. 2015, Karman et al. 2015). Lens models of the Frontier Field clusters\nare being produced and constantly updated by several different teams, and can be found at the Hubble \n Frontier Field website.\n\\footnote{\nhttps://archive.stsci.edu/prepds/frontier/lensmodels/}. According to Richard\net al. (2014), between 17\\% to 38\\% of the area in the image plane in each of\nthe Frontier Fields cluster pointings benefits of a magnification $\\mu>10$.\nThis implies that galaxies \nas faint as $M_{UV}\\approx -12.8$, -13.3, -13.6 (assuming $\\mu=50$), are detectable at\n$z=$3, 4, 5, respectively, over a total of ~7 sq. arcmin.  The Frontier Field will thus soon\nallow to extend the investigation of the ultra-faint end of UV luminosity functions at\n$z\\approx 3-5$ to a $\\sim$ 6 times wider area with respect to Alavi et al. (2014), while also\naddressing any concern due to cosmic variance thanks to the observation of\nsix independent pointings, which should reduce it by a factor $\\sim 1/\\sqrt{6}$. \n\nSuch an observational program will allow to decrease the statistical uncertainty on the measured density of ultra-faint UV galaxies by a factor 3 at least. The effects of such an improvement in the statistics  can be appreciated from inspection of Fig. 3. As an example, assuming  the same central value for the observed number density, rising the lower limit (solid thick line) by a logarithmic factor 0.4 would provide a constraint $m_X\\geq 2.3$ keV on the mass of WDM particles. \n\\begin{acknowledgements}\nWe thank the referee for helpful comments that helped to improve the manuscript. \nNM thanks the Observatoire de Paris LERMA - CIAS for the invitation and the kind hospitality.  MC acknowledge the contribution of the FP7 SPACE project ASTRODEEP (Ref.No: 312725), supported by the European Commission. \nThis work was partially supported by PRIN INAF 2012.\\\\ \n\\end{acknowledgements}\n\n\\begin{thebibliography}{}\n\n\\bibitem{}Abazajian K.N., Calabrese E., Cooray A., De Bernardis F., Dodelson S., et al., 2011, Astropart.Phys., 35, 177, 1103.5083\n\\bibitem{}Abazajian K.N. 2014, Phys. Rev. Lett. 112, 161303\n\\bibitem{}Alam, S.M.K., Bullock, J.S., Weinberg, D.H. 2002, ApJ, 572, 34\n\\bibitem{}Alavi, A. et al. 2014, ApJ, 780, 143\n\\bibitem{}Angulo, R.E., Hahn, O., Abel, T. 2013, MNRAS, 434, 3337\n\\bibitem{}Bardeen J. M., Bond J. R., Kaiser N., Szalay A. S., 1986, ApJ, 304, 15 \n\\bibitem{}Barkana R., Haiman Z., Ostriker J. P., 2001, ApJ, 558, 482\n\\bibitem{}Behroozi, P.S. et al. 2014, ApJ, 787, 156\n\\bibitem{}Belokurov, V. et al. 2010, ApJ, 712, 103\n\\bibitem{}Benson, A.J. et al. 2013, MNRAS, 428, 1774\n\\bibitem{}Biermann, P.L., de Vega, H.J., Sanchez, N.G. 2013, in Highlights and Conclusions of the Chalonge Meudon workshop 2012 [arXiv:1305.7452]\n\\bibitem{}Bode, P., Ostriker, J.P., Turok, N. 2001, ApJ, 556, 93\n\\bibitem{}Bond, J.R., Cole, S., Efstathiou, G., \\& Kaiser, N.,1991, ApJ, 379, 440\n\\bibitem{}Bower, R.G. 1991, MNRAS, 248, 332\n\\bibitem{}Bower, R.G., Benson, A.J., Crain, R.A. 2012, MNRAS, 422, 2816\n\\bibitem{}Boyarsky, A., Ruchayskiy, O., Iakubovskyi, D., Franse, J. 2014, Phys.Rev.Lett. 113, 1301 \n\\bibitem{}Boylan-Kolchin, M., Bullock, J., Kaplinghat, M. 2012, MNRAS, 422, 1203\n\\bibitem{}Bulbul, E., Markevitch, M., Foster, A.R., Smith, R.K., Loewenstein, M., Randall, S.W. 2014, ApJ, 789, 13\n\\bibitem{}Calura, F., Menci, N. Gallazzi, A. 2014, MNRAS, 440, 2066\n\\bibitem{}Coe , D., BenÃ­tez, N., Broadhurst, T., Moustakas, L.A.  2010, ApJ, 723, 1678\n\\bibitem{}Coe, D., Bradley, L.,  Zitrin, A. 2015, ApJ, 800, 84\n\\bibitem{}Colombi, S., Dodelson, S., Widrow, L.M. 1996, ApJ, 458, 1\n\\bibitem{}Collins, K. et al. 2014, AJ, 147, 39\n\\bibitem{}Conselice, C. J., Mortlock, A., Bluck, A. F. L., Gru Ì\u0088tzbauch, R., Duncan, K. 2013, MNRAS, 430, 1051\n\\bibitem{}Daddi, E., Elbaz, D., Walter, F., et al. 2010, ApJ, 714, L118\n\\bibitem{}Dav\\'e R., Oppenheimer B. D., Finlator K., 2011, MNRAS, 415, 11\n\\bibitem{}Dayal, P., Mesinger, A., Pacucci, F. 2015, MNRAS, 806, 67\n\\bibitem{}Dekel, A., Silk, J. 1996, ApJ, 303, 39\n\\bibitem{}de Vega H. J., Sanchez N. G., 2010, MNRAS, 404, 885\n\\bibitem{}de Vega H. J., Sanchez N. G., 2012, Phys Rev D:  85, 043516 \n\\bibitem{}de Vega, H.J., Salucci, P., Sanchez, N.G. 2014, MNRAS, 442, 2717\n\\bibitem{}Destri, C., de Vega,  P., Sanchez, N.G. 2013a, Phys.Rev.D, 88, 3512\n\\bibitem{}Destri, C., de Vega,  P., Sanchez, N.G. 2013b, New Astronomy 22, 39\n\\bibitem{}Di Cintio, A. et al. 2014, MNRAS, 441, 2986\n\\bibitem{}Dodelson, S., Widrow, L.M. 1994, Phys. Rev. Lett. 72, 17\n\\bibitem{}Dom\\'inguez, A., Siana, B., Brooks, A.M, Christensen, C.R., Bruzual, G., Stark, D.P., Alavi, A.  2015, MNRAS, 451, 5358\n\\bibitem{}Ferrero, I., Abadi, M.G., Navarro, J.F., Sales, L.V., Gurovich, S. 2012, MNRAS, 425, 2817\n\\bibitem{}Fontana A. et al., 2006, A\\&A, 459, 745\n\\bibitem{}Fontanot, F., De Lucia, G., Monaco, P., Somerville, R.S., Santini, P. 2009, MNRAS, 397, 1776\n\\bibitem{}Gan, J., Kang, X., van den Bosch, F.C., Hou, J. 2010, MNRAS, 408, 2201\n\\bibitem{}Garrison-Kimmel, S., Boylan-Kolchin, M., Bullock, J.S., Kirby, E.N. 2014, MNRAS, 444, 222\n\\bibitem{}Garzilli, A., Boyarsky, A. 2015, preprint [arXiv:1510.07006v1]\n\\bibitem{}Genzel, R., Tacconi, L. J., Gracia-Carpio, J., et al. 2010, MNRAS, 407, 2091\n\\bibitem{}Governato, F., Zolotov, A., Pontzen, A., Christensen, C., Oh, S.H., Brooks, A.M., Quinn, T., Shen, S., Wadsley, J. 2012, MNRAS, 422, 1231\n\\bibitem{}Guo Q. et al., 2011, MNRAS, 413, 101\n\\bibitem{}Hathi, N. P., Ryan, R. E., Jr., Cohen, S. H., et al. 2010, ApJ, 720, 1708\n\\bibitem{}Hirschmann M., Somerville R. S., Naab T., Burkert A., 2012, MNRAS, 426, 237\n\\bibitem{}Hirschmann M., Naab T., Dav\\'e R., Oppenheimer B. D., Ostriker J. P., Somerville R. S., Oser L., Genzel R., Tacconi L. J., FÌ\u0088orster-Schreiber N. M., Burkert A., Genel S., 2013, MNRAS, 436, 2929\n\\bibitem{}Hopkins, P.F. et al. 2014, MNRAS, 445, 581\n\\bibitem{}Horiuchi, S., Humphrey, P.J., Onorbe, J., Abazajian, K.N., Kaplinghat, M., Shea, G. 2014, Phys.Rev.D, 89, 5017\n\\bibitem{}Jones, T., Ellis, R., Jullo, E., \\& Richard, J. 2010, ApJL, 725, L176\n\\bibitem{}Karman, W. et al. 2015, A\\&A, 574, 11\n\\bibitem{}Kennicutt, Jr., R. C. 1998, ApJ, 498, 541\n\\bibitem{}Kimm, T. et al. 2009, MNRAS, 394, 1131\n\\bibitem{}Klypin, A.A., Kravtsov, A.V., Valenzuela, O., Prada, F. 1999, ApJ, 522, 82\n\\bibitem{}Klypin, A., Trujillo-Gomez, S., Primack, J. 2011, ApJ, 740, 102\n\\bibitem{}\tKlypin, A., Karachentsev, I., Makarov, D., Nasonova, O. 2014, MNRAS, submitted [arXiv:1405.4523]\n\\bibitem{}Koposov, S.E., Yoo, J., Rix, H-W., Weinberg, D.H,; MacciÃ², A.V., EscudÃ©, J.M. 2009, ApJ, 692, 2179\n\\bibitem{}Kusenko, A. 2009, Phys.Rept., 481,1\n\\bibitem{}Kuzio de Naray, R., Spekkens, K. 2011, ApJ, 741, 29\n\\bibitem{}Lacey, C., \\& Cole, S., 1993, MNRAS, 262, 627 \n\\bibitem{}Lapi, A., Danese, L. 2015, JCAP, 9, 33\n\\bibitem{}Lasserre, T. 2014, in Proceedings of the 13th International Conference on Topics in Astroparticle and Underground Physics, TAUP 2013 (F. Avignone \\& W. Haxton, editors, Physics Procedia, Elsevier) [arXiv:1404.7352]\n\\bibitem{}Limousin, M. et al. 2007, ApJ, 668, 643\n\\bibitem{}Lo Faro. B, Monaco, P., Vanzella, E., Fontanot, F., Silva, L., Cristiani, S. 2009, MNRAS, 399, 827\n\\bibitem{}Lovell M. R. et al., 2012, MNRAS, 420, 2318\n\\bibitem{}Lovell M. R., Frenk C. S., Eke V. R., Jenkins A., Gao L., Theuns T., 2014, MNRAS, 439, 300\n\\bibitem{}Lovell M. R. et al 2015, preprint [arXiv:1511.0407]: \n\\bibitem{}Macci\\'o, A., Paduroiu S., Anderhalden D., Schneider A., Moore B., 2012, MNRAS, 424, 1105\n\\bibitem{}Madau, P., Pozzetti, L., Dickinson, M. 1998, ApJ, 498, 106\n\\bibitem{}Marchesini, D., van Dokkum, P.G.; F\\\"orster Schreiber, N.M., Franx, M., LabbÃ©, I., Wuyts, S. 2009, ApJ, 701, 1765\n\\bibitem{}Mashchenko, S., Wadsley, J. and Couchman, H., M. P 2008, Science, 319, 174\n\\bibitem{}Menci, N., Fiore, F., Lamastra, A. 2012, MNRAS, 421, 2384\n\\bibitem{}Menci, N., Fiore, F., Lamastra, A. 2013, ApJ, 766, 110\n\\bibitem{}Menci, N., Gatti, M., Fiore, F., Lamastra, A. 2014, A\\&A, 569, 37\n\\bibitem{}Mesinger, A., Perna, R., Haiman, Z. 2005, ApJ, 623, 1\n\\bibitem{}Moore, B., Quinn, T., Governato, F., Stadel, J., Lake, G. 1999, MNRAS, 310, 1147\n\\bibitem{}Moster, B.P., Naab, T., White, S.D.M. 2013, MNRAS, 428, 3121\n\\bibitem{}Nierenberg, A.M. 2013, Treu, T., Menci, N., Lu, Y., Wang, W. 2013, ApJ, 772, 146\n\\bibitem{}Noeske K. G. et al., 2007, ApJ, 660, L43\n\\bibitem{}Oesch, P. A., Bouwens, R. J., Carollo, C. M., et al. 2010, ApJL, 725, L150\n\\bibitem{}Ogiya, Go, Mori, M. 2014, ApJ, 793, 46\n\\bibitem{}Pacucci, F., Mesinger, A., Haiman, Z. 2013, MNRAS, 435, L53\n\\bibitem{}Papastergis, E., Martin, A. M., Giovanelli, R., Haynes, M. P. 2011, ApJ, 739, 38\n\\bibitem{}Papastergis, E., Giovanelli, R., Haynes, M.P., Shankar, F. 2015, A\\&A, 575, 113\n\\bibitem{}Parsa, S., Dunlop, J.R., McLure, R.J., Mortlock, A. preprint [arXiv:1507.05629]\n\\bibitem{}Pawlowski, M.S., Famaey, B., Merritt, D., Kroupa, P. 2015, preprint [arXiv:1510:0806]\n\\bibitem{}Peebles, P.J.E. 1993, {\\it Principles of Physical Cosmology} (Princeton: Princeton Univ. Press)  \n\\bibitem{}Pettini, M., Rix, S. A., Steidel, C. C., et al. 2002, Ap\\&SS, 281, 461\n\\bibitem{}Polisensky E., Ricotti M., 2011, Phys. Rev. D, 83, 3506\n\\bibitem{}Polisensky E., Ricotti M., 2015, MNRAS, 450, 2172\n\\bibitem{}Read, J.I., Gilmore, G. 2005, MNRAS, 356, 107\n\\bibitem{}Richard, J. et al. 2014, MNRAS, 444, 268\n\\bibitem{}Santini, P. et al. 2014, A\\&A, 562, A30\n\\bibitem{}Santini, P. et al. 2015, ApJ, 801, 97\n\\bibitem{}Sawala, T. et al. 2015, MNRAS, 448, 2941\n\\bibitem{}Schmidt, M. 1959, ApJ, 129, 243\n\\bibitem{}Schneider, A., Smith, R.E., Maccio', A.V., Moore, B. 2012, MNRAS, 424, 684\n\\bibitem{}Schneider, A., Smith, R.E., Reed, D. 2013, MNRAS, 433, 1573\n\\bibitem{}Schneider, A. 2015, MNRAS, 451, 3117\n\\bibitem{}Schultz C., On Ì\u0083orbe J., Abazajian K. N., Bullock J. S., 2014, MNRAS, 442,\n\\bibitem{}Shao S., Gao L., Theuns T., Frenk C. S., 2013, MNRAS, 430, 2346\n\\bibitem{}Shaposhnikov, M., Tkachev, I. 2006, Physics Letters B, 639, 414\n\\bibitem{}Shi, X.d., Fuller, G.M. 1999, Phys. Rev. Lett. 82, 2832\n\\bibitem{}Siana, B.D., Teplitz, H. I., Chary, R.-R., Colbert, J., \\& Frayer, D. T. 2008b, ApJ, 689, 59\n\\bibitem{}Siana, B.D., Smail, I., Swinbank, A. M., et al. 2009, ApJ, 698, 1273\n\\bibitem{}Siana, B.D., et al. 2014, Proceedings of the American Astronomical Society, AAS Meeting, 223\n\\bibitem{}Silverman, J.D. et al. 2015, ApJL, submitted, [arXiv:15050.4977S]\n\\bibitem{}Smith, R. E., Markovic K., 2011, Phys. Rev. D, 84, 3507\n\\bibitem{}Somerville, R., \\& Dav\\'e, R., 2014, ARAA, submitted [arXiv:1412.2712]\n\\bibitem{}\tSpeagle, J.S., Steinhardt, C.L., Capak, P.L., Silverman, J.D. 2014, ApJS, 214, 15\n\\bibitem{}Stark, D. P., Swinbank, A. M., Ellis, R. S., et al. 2008, Natur, 455, 775\n\\bibitem{}Tacconi, L. J., Neri, R., Genzel, R., et al. 2013, ApJ, 768, 74\n\\bibitem{}\tTollerud, E.J., Boylan-Kolchin, M., Bullock, J.S. 2014, MNRAS, 440, 3511\n\\bibitem{}Viel, M., Legourgues, J., Haenhelt, M.G., Matarrese, S. Riotto, A. 2005, Phys. Rev. D, 71, 063534\n\\bibitem{}Viel M., Becker G. D., Bolton J. S., Haehnelt M. G. A., 2013, Phys. Rev. D, 88, 3502\n\\bibitem{}Wan, J., White, S.D.M. 2007, MNRAS, 380, 93\n\\bibitem{}Wang, X. et al. 2015, preprint [arXiv:1504.02405]\n\\bibitem{}Watson C. R., Li Z., Polley N. K., 2012, J. Cosmol. Astropart. Phys., 03,018\n\\bibitem{}Weinmann S. M., Pasquali A., Oppenheimer B. D., Finlator K., Mendel J. T., Crain R. A., Maccio` A. V., 2012, \nMNRAS, 426, 2797\n\\bibitem{}Yuan, T.-T., Kewley, L. J., \\& Richard, J. 2013, ApJ, 763, 9\n\n\\end{thebibliography}\n\n\\newpage\n\n\n\n\\newpage\n\n\n\n\n\n\n\n\n\n \n\n", "itemtype": "equation", "pos": 26430, "prevtext": "\nSubstituted in the previous equation, this allows to recast the Eq. 4 in the form \n\n", "index": 15, "text": "\\begin{equation}\nlog\\,M/M_{\\odot}=-0.4\\,\\Big(M_{UV}+18.16\\Big)+8-log\\,\\eta\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"log\\,M/M_{\\odot}=-0.4\\,\\Big{(}M_{UV}+18.16\\Big{)}+8-log\\,\\eta\" display=\"block\"><mrow><mrow><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>g</mi></mpadded><mo>⁢</mo><mi>M</mi></mrow><mo>/</mo><msub><mi>M</mi><mo>⊙</mo></msub></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mn>0.4</mn></mpadded><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><msub><mi>M</mi><mrow><mi>U</mi><mo>⁢</mo><mi>V</mi></mrow></msub><mo>+</mo><mn>18.16</mn></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow></mrow></mrow><mo>+</mo><mn>8</mn></mrow><mo>-</mo><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>g</mi></mpadded><mo>⁢</mo><mi>η</mi></mrow></mrow></mrow></math>", "type": "latex"}]