[{"file": "1601.01222.tex", "nexttext": "\nin which $r_1, r_2, \\ldots, r_n$ are role identifiers and $n\\ge0$ is an integer.\n\\end{definition}\n\n\n\\begin{definition}\nGiven any SoC $s$,\nWe shall say that request for service $a$ is enabled when it is in the service registry\nof the SCE of $s$.\n\\end{definition}\n\n\n\\begin{definition}\nGiven any FSO $f$,\nany SoC $s\\in f$,\nand any request for service $a$ that was enabled in $s$, we shall say that $a$ is active when\nall of its role identifiers have been associated to actors of $f$.\n\\label{d:active}\n\\end{definition}\n\nNote that, in Definition~\\ref{d:active}, we refer to the actors of $f$, not $s$. This means that\nthose actors may belong to any of the SoC's of $f$.\n\n\\begin{definition}\nAn association of roles to actors shall be called in what follows as ``enrollment''.\nA ``local enrollment'' shall be one in which all roles are found in the present SoC.\nOtherwise, we shall use the term ``global enrollment.''\n\\end{definition}\n\nAs in sociocracy~\\cite{BuEn12}, also in FSO we have two organizational rules:\n\\begin{description}\n\\item[Double membership:] For any $0<k<m$ and for any $s\\in\\hbox{SoC}(k)$, let us call $\\sigma(s)$ the SCE of $s$.\nThe double membership rule states that $\\sigma(s)$ is at the same time a member of $s$ and a member of $\\Pi(s)$.\n\\item[Exception:] Being the SCE of $s$, $\\sigma(s)$ receives notifications published by all the members of $s$.\nWhen an incoming notification corresponds to a request for services $a$ defined as\nin~\\eqref{e:ga}, $\\sigma(s)$ initiates a local enrollment, trying to identify a set of local actors\nto be associated with the roles necessary to enable $a$.\nThis is done by checking the current state of the\nsystem registry, which maintains an up-to-date state of all the members of $s$.\nThe exception rule states that, whenever $\\sigma(s)$ cannot identify in $s$ all the roles necessary\nto fulfil $a$, it will raise an \\emph{exception\\/} by publishing $a$ and its missing roles to $\\Pi(s)$.\nIn other words, a failed local enrollment is turned into a global enrollment.\n\\end{description}\n\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=1.0\\textwidth]{whole.jpg}}\n\\caption{Exemplification of a 3-layer FSO. PSC loci are in this case smart rooms,\nsmart houses, and a ``smart building''. Top vertex represent SCE's, which manage their SoC\nand at the same time are members of their parent SoC.}\\label{f:FSO}\n\\end{figure}\n\n\nIn what follows, we illustrate how the the SoC and the FSO fulfil the key requirements\nto the realization of an effective PSC infrastructure that we have\nintroduced in Sect.~\\ref{s:socorg}.\n\n\n\\section{SoC's and FSO's as foundation for PSC infrastructures}\\label{s:found}\n\nAs we mentioned in Sect.~\\ref{s:socorg},\nPSC constitutes a ``communication channel'' (\\emph{sensu\\/} Boulding's model)\nthat is characterized by the following major services:\nsocial translucence; referral services; and the empowering of a system's parts\nand whole. In what follows we highlight how SoC and FSO support those services.\n\n\n\\subsection{Social translucence}\\label{ss:st}\n\nAs already mentioned, social translucence is obtained in SoC's by identifying mutualistic\nrelationships and by making the involving parties aware of the existence of those relationships.\nIn order to better explain this concept we now introduce a number of definitions.\n\n\\begin{definition}[Social action]\nLet $D$ and $R$ be two social systems.\nBehaviors may take place in either system\nas specified by behavior sets $B_D$ and $B_R$. Then the\nfollowing bijective function:\n\n", "itemtype": "equation", "pos": 18209, "prevtext": "\n\\title{Fractal social organization as a foundation to\\\\pervasive social computing services}\n\\author{Vincenzo De~Florio}\n\\ead{vincenzo.deflorio@gmail.com}\n\\address{MOSAIC/Uiversiteit Antwerpen \\& MOSAIC/iMinds research institute,\nMiddelheimlaan 1, 2020 Antwerp, Belgium}\n\\begin{abstract}\nPervasive social computing is a promising approach that promises to empower\nboth the individual and the whole and thus candidates itself as a foundation\nto the ``smarter'' social organizations that our new turbulent and\nresource-scarce worlds so urgently requires.\nIn this contribution we first identify\nthose that we consider as the major requirements to be fulfilled in order\nto realize an effective pervasive social computing infrastructure.\nWe then\nconjecture that our service-oriented community \nand fractal social organization fulfil those\nrequirements and therefore constitute an effective strategy to design pervasive social computing\ninfrastructures.\nIn order to motivate our conjecture, in this paper\nwe discuss a model of social translucence and discuss fractal social\norganization as a referral service empowering a social system's parts and whole.\n\\end{abstract}\n\\begin{keyword}\nSocial system \\sep\nSocial organization \\sep\nPervasive social computing \\sep\nService-oriented community \\sep\nFractal social organization\n\\end{keyword}\n\n\\maketitle\n\n\n\\section{Introduction}\nSeveral are the definitions of\npervasive social computing (PSC) that may be found in the literature.\nThose definitions provide different pictures of what PSC is and which challenges it is meant\nto tackle. A key difference is that\nsome definitions propose PSC as an approach to augment the individual while\nothers put the accent on the social dimension. A related major difference \nis given by the\nchallenges that PSC is to tackle.\nThose challenges range from the creation of an\n``an integrated\ncomputing environment, which promises to augment five facets of human intelligence:\nphysical environment awareness, behavior awareness, community awareness, interaction awareness, and content awareness''\nto the definition of an approach\n``born for addressing new situations and new challenges in the age of integrated cyber and physical worlds''.\nOur modern times have indeed introduced several new situations that challenge our ability to sustain\nour societies and economies~\\cite{DeBl08a}. Those situations and challenges may be synthetically expressed as\nthe advent of Anthropocene---the time of man as the pivotal element\nfor the progress and the evolution of our ecosystems. In the times of Anthropocene, it is man the main factor\nwho is responsible for the emergence of ecosystem stability or instability; it is man's action that can lead\neither to balance and sustainability or to rapid resource exhaustion, chaos, and unsustainability.\nThe ever growing human population; a physical world more and more depleted of its resources; and\nthe widespread of the pure individual-centric, competitive-oriented model,\nall themes masterfully discussed by Hardin in his ``Tragedy of the Commons''~\\cite{Hardin68},\nprovide us with a pessimistic vision to our future. The negative role of man in this context were\nbrilliantly rendered by famous cartoonist and comic artist Walt Kelly\nfor the 1970 edition of Earth Day, in which his character Pogo after observing the\ndevastating effect of pollution on their habitat concludes: ``We have met the enemy, and he is \\emph{us}!''\n\nI believe such a pessimistic conclusion should be coupled with other facts of opposite sign.\nOur modern times are providing us with unprecedented possibilities for more profitable and sustainable forms\nof social action. As observed by~\\cite{BenCa09},\nthe ``pervasiveness of handheld devices and the enormous popularity of social networking websites''\nset the conditions to the emergence of novel, more efficient and cost-effective ways to organize our services.\nMoreover, a technology ``relentlessly pushing down communication costs''~\\cite{Kellogg05} provides us with the\nopportunity to evolve our ``static, local organization of an obsolete yesterday''~\\cite{BuckFuller75} and\nrealize and experiment with novel, dynamic, and distributed forms of organization.\nOur stance in the present contribution is that PSC may be interpreted also as\nthe technological foundation for the definition of the above-mentioned novel, dynamic, and distributed\nforms of organization.\n\nIn fact, PSC artificially augments several ``facets of human intelligence''~\\cite{Zhou12}\nand realizes a quasi-ubiquitous ``communication channel'' that, in the classic definition\nby Kenneth Boulding~\\cite{Bou56}, turns a set of roles into a\n\\emph{social organization},\n\n\t\t\t\t      \n\t\t\t\t      \n\t\t\t\t      \n\t\t\t\t    \n                                      \nnamely the most advanced known system class in his general systems classification.\n\nThis paper discusses fractal social organization (FSO) as an architecture for the design of\nPSC services. We first discuss social\norganizations in the framework of PSC in Sect.~\\ref{s:socorg}.\nFSO is then introduced in Sect.~\\ref{s:socfso}.\nNext, in Sect.~\\ref{s:found}, we discuss the relation between FSO and PSC.\n\n\nOur conclusions and a view to are finally given in Sect.~\\ref{s:end}.\n\n\n\\section{Social organizations}\\label{s:socorg}\n\nOne of the first and most renowned definitions of social system was provided in 1956 by Kenneth Boulding\nin his now classic article~\\cite{Bou56}:\n\\begin{quote}\n``it is tempting to define social organizations, or almost any social system,\n  as a set of roles tied together with channels of communication.''\n\\end{quote}\nAfter 70 years from its formulation, Boulding's definition is still actual and deserving analysis.\nThe definition includes four parts:\n\\begin{description}\n\\item[A set:] This highlights the fact that social actors are usually grouped\ninto sets, defined by some measure of physical or logical proximity.\nIn fact this is a subset of those social actors that are relatively close to each other\naccording to the above measure. The term \\emph{locality\\/} has been used to refer\nto the locus defined by the physical or logical measure of proximity~\\cite{BenCa09}.\nIn the case of a \\emph{pervasive\\/} social system this implies that this set is relatively dense\nand populated.\n\\item[of roles:] Quoting again from~\\cite{Bou56},\n\\begin{quote}\n``The unit of such systems is not perhaps the person---the individual human as such---but the `role'---that\n  part of the person which is concerned with the organization or situation in question.''\n\\end{quote}\nShifting the attention from the actor to the role introduces another source of dynamic behavior:\na social system is one in which roles may mutate with time and the context, leading to complex\ndynamical reconfigurations.\n\\item[tied together:] This part of the definition highlights the fact that in a social ``whole''\nthe parts are joined together by some aggregative force. This force may be due to cultural,\nanthropological, or physiological reasons. Symbiotic or other mutualistic relationships; affection;\nsharing of the same ideals or aims; lineage; and, in general, the individual returns produced by the social union\nstrenghten the cohesion of the parts with the social whole. A dual, disgregative, force exists,\nwhich corresponds to the strength of the negative returns that are experienced by the social parts.\nIf the perceived disadvantages resulting from the social union outweight the perceived advantages,\nthe parts shall loosen up from the whole, disintegrating the social system into its constituent units.\nBecause of this, ``tying the roles together'' means also the ability to accentuate the ``centripetal''\nsocial force and to dump the ``centrifugal'' force. A technique to achieve this is\n\\emph{social translucence}: a socially translucent object, service, system, or user,\nis one for which the returns associated with social interactions are made apparent~\\cite{ErKe00}.\n\\item[with channels of communication:] \nIt is once again Boulding who observes how\n\\begin{quote}\n``Communication and information processes are found in a wide variety of empirical situations,\n  and are unquestionably essential in the development of organization, both in the biological and the social world.''\n\\end{quote}\nSeveral aspects should be highlighted here.\nFirst, ``communication'' is here much more than sharing data---it is sharing structured,\nsemantically described information~\\cite{BenCa09} that provide snapshots of the individual and social context:\ncapabilities, policies, availabilities, location data, as well as viewpoints about experienced facts.\nSecondly, nowadays powerful and pervasive ``communication channels'' are driven by a technology that offer ever more\ncomplex services while ``relentlessly pushing down communication costs''~\\cite{Kellogg05}.\nThird, the ``pervasiveness of handheld devices and the enormous popularity of\nsocial networking websites''~\\cite{BenCa09}\ncontribute to the creation of\na quasi-ubiquitous and world-wide ``communication channel'' that\nin practice artificially augments several ``facets of human intelligence''~\\cite{Zhou12}.\n\\end{description}\n\nIt is the ambition of pervasive social computing (PSC) to realize such social system or better, using\nBoulding's terminology, to realize such social organization. PSC provides a ``communication channel''\nthat energizes aggregative forces with the following extra advantages:\n\\begin{description}\n\\item[Social translucence:] thanks to the PSC infrastructures the users\ncan more easily ``see through'' and ``farther'', which allows them to identify opportunities\nresulting from social unions~\\cite{ErKe00,Kellogg05,de2014mutualistic}.\n\n\\item[Referral Service:]\nAs exemplified in~\\cite{BenCa09}, through PSC\none does not look for roles; rather, one advertises one's task.\nIt is then the PSC infrastructure that identifies actors best-matching the sought roles.\nPSC thus shifts the responsibility for handling social services from the user to the ``channel''.\nIt is the channel that is charged with the task to manage the highly dynamic set of roles\nmade available by the actors.\n\n\n\n\\item[Empowering the Parts:]\nPSC ``socially augments'' the individual with\n``five facets of human intelligence:\n  physical environment awareness, behavior awareness,\n  community awareness, interaction awareness, and content awareness''~\\cite{Zhou12}.\nAs a side-effect, this also strengthens the social ``whole'' because of the\nextra advantages deriving from the augmented awareness.\n\n\\item[Empowering the Whole:]\nPSC also empowers the union of the parts, making it possible to address\n``new situations and new challenges in the age of integrated cyber and physical worlds''~\\cite{Zhou12}.\nMore than this, PSC favors the emergence of a coherent and purposeful ``social behavior''\nfrom a set of mostly independent individual behaviors.\n\nA new ``social individual''---the social system---then raises from the union of the parts~\\cite{DeBl10}.\nThe classic behavioral classification of~\\cite{RWB43} or their extensions such as the one\nintroduced in~\\cite{DF15b,DF15d} may then be used\nto characterize the ``systemic class'' of the social system.\nOne of the challenges of PSC is to foster\nthe emergence of advanced forms of collective intelligence in PSC-empowered social systems.\n\\end{description}\n\nOur stance here is that three are the key requirements to be fulfilled in order to realize\nan effective PSC infrastructure:\n\\begin{enumerate}\n\\item The definition of an effective ``communication channel'': a ``server'' taking the shape of,\ne.g., a middleware~\\cite{BenCa09} able to offer PSC services to the constituent actors of a\nsocial system identified by a given locus.\n\\item The definition of an effective ``second-order'' communication channel able to\noffer PSC services \\emph{to a set of servers\\/} as defined in 1.\n\\item The definition of a mechanism to ``tie together'' and effectively\norganize a nested compositional hierarchy of communication channels.\n\\end{enumerate}\n\nIn what follows we conjecture that our service-oriented community (SoC)~\\cite{DeBl10,DFCBD12}\nand fractal social organization~\\cite{DF13c,DF13a,DF14d,DF15c} fulfil the above three requirements\nand therefore constitute an effective ``strategy'' to design PSC infrastructures.\n\n\nin next secton we introduce SoC's and FSO's in terms of the three above-mentioned PSC requirements.\n\n\n\n\n\\section{Service-oriented communities and fractal social organizations}\\label{s:socfso}\n\nWe have concluded last section by identifying those that we consider to be the three key requirements to PSC.\nIn what follows we ``map'' those three requirements onto the concepts of SoC and FSO.\n\n\n\\subsection{Service-oriented communities as PSC channels}\\label{s:fso:soc}\n\nA SoC may be described as the practical organization of a social system according to the classic\ndefinition recalled in Sect.~1: ``a set of roles tied together via channels of communication''.\nFigure~\\ref{f:SoC-1} provides a high-level view to the structure of the SoC and highlights its relation\nwith social systems and PSC.\nIn a SoC, a set of roles played by human beings\nand cyber-physical systems in physical or logical proximity are tied together via\na social computing engine (SCE).\nBy means of a publish/subscribe mechanism, said engine is made aware of: the dynamic assignments\nof roles; the availability of the corresponding actors; their engagement policies; their location;\nthe occurrence of events; resource state changes; requests for service; and other contextual information.\nThe SCE receives said information as semantically described services, which are then stored into a\nservice registry. The arrival of new service descriptions triggers a semantic match with the records\nalready stored in the registry. This is done in order\nto identify roles able to fulfil the requests for services\nwaiting to be answered. Once roles are identified, a notification is sent to the corresponding actors.\nIn so doing, \\emph{social translucence\\/} is realized:\nactors become aware of the ``win-wins''---the mutually\nrewarding relationships that they may enact and exploit.\nAt the same time, the SCE makes it possible to optimize\nthe tasks of the ``parts'' (the social actors) and those of the ``whole'' (the social system).\nNew arrivals are also matched against service role protocols, namely sequences of actions that are activated\nby the verification of a guard expressing the availability of one or more roles. One such protocol, e.g.,\ninstructs what to do when an accelerometer ``fires'', publishing the fact that an associated elderly person\nis suspected to have fallen~\\cite{DeFPa15b}.\nSCE also realizes a simple form of e-referral~\\cite{EReferrals,ShBe07,Boudreau}:\ninstead of contacting possible actors ``on a one-to-one basis''~\\cite{BenCa09},\nrequesting actors just ``advertise'' their requests. We refer to such service\nas ``simple'' because the range of possible candidate roles is limited to those\nin proximity of each other.\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=1.0\\textwidth]{SoC-1b.png}}\n\\caption{General structure of a service-oriented community. Rectangles represent actors and roles.\nActors/roles publish context information (roles, facts, and services)\nvia the \\texttt{publish()} method.\nThe top rectangle\nis the social computing engine, which manages the PSC services (translucence, referral, and empowering)\nvia semantic description and matching (represented as the blue triangle).\nCandidate roles are informed via \\texttt{notify()}. If the corresponding actors agree to commit to\na social service, they \\texttt{bind()} together and the service is started.}\\label{f:SoC-1}\n\\end{figure}\n\nSoC's have been used in the past to realize cyber-physical societies such as\nthe mutual assistance community (MAC)~\\cite{SDGB10b}. In a MAC, social translucence is\nsought by identifying mutualistic relationships through the use of\nsemantic service description and matching~\\cite{4618805}. One such relationship is the so-called\n``participant'' service mode, which was exemplified in~\\cite{SDGB07a} and modeled\nin~\\cite{de2014mutualistic}.\n\n\n\n\\subsection{Fractal social organization}\\label{s:fso:fso}\n\nFSO may be concisely defined as the organization of a nested compositional hierarchy (NCH) of SoC's.\n\nIn order to better explain this concept, we need to describe two elements: how the NCH is structured and how\nit is organized.\n\nThe NCH structuring is obtained by allowing an SoC to be a member of a greater SoC.\nThis means that sets of roles are included into greater sets of roles.\nFor simplicity, those sets may be visualized as loci, or containers,\nstructured as a Matryoshka doll.\nThe idea is exemplified in Fig.~\\ref{f:FSO}. In that picture we have a set\nof layers representing different classes of loci---for instance rooms, houses, and buildings.\nThe only difference between the loci lies in a simple compositional rule:\na building can contain houses, human beings and cyber-physical systems;\nhouses can contain rooms, human beings and cyber-physical systems; \nand rooms may only contain human beings and cyber-physical systems.\nThis may be generalized by stating that a level-$k$ SoC can only include \nlevel-$j$ SoC's, with $j$ and $k$ integers such that $0\\le k<j$ and\nthe assumption that a level-0 SoC corresponds to an individual member---a human being or\na cyber-physical system.\n\nThe second element we need to clarify is the organization of the SoC hierarchy.\nIn order to do so, we now introduce a number of symbols and definitions.\n\n\\begin{definition}\nGiven any FSO $f$,\nlet us refer to\nSoC${}_f(k)$ as to the set of all the $level-k$ SoC's of $f$. When $f$ may be omitted\nwithout introducing ambiguity, we shall use symbol SoC$(k)$.\n\\end{definition}\n\n\\begin{definition}\nGiven any FSO $f$,\nfor any SoC $s\\in f$, we shall refer to $\\Pi(s)$ as to the parent of $s$, namely\nthe SoC of $f$ that includes $s$ among its members.\n\\end{definition}\n\n\\begin{definition}\nGiven any FSO $f$,\nlet us define $m_f = \\max_k \\hbox{SoC}_f(k)$. When $f$ may be omitted\nwithout introducing ambiguity, we shall use symbol $n$\nto refer to the root level of $f$.\n\\end{definition}\n\n\\begin{definition}\nLet us define\nas request for services the following guarded action:\n\n", "index": 1, "text": "\\begin{equation}\na: r_1, r_2, \\ldots, r_n,\\label{e:ga}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"a:r_{1},r_{2},\\ldots,r_{n},\" display=\"block\"><mrow><mrow><mi>a</mi><mo>:</mo><mrow><msub><mi>r</mi><mn>1</mn></msub><mo>,</mo><msub><mi>r</mi><mn>2</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>r</mi><mi>n</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\nmaps behaviors in $B_D$ with corresponding behaviors in $B_R$.\n\\end{definition}\n\nAs an example, if $D$ and $R$ are respectively the animalia and plantae kingdoms,\nthen $\\sigma$ shall map behaviors produced by animals (for instance,\nrespiration) into behaviors experienced by plants (for instance, production of\ncarbon dioxide); and if $D$ and $R$ are respectively the plantae and the animalia kingdoms,\nthen $\\sigma$ shall map behaviors produced by plants (for instance,\nphotosynthesis) into behaviors experience by animals (for instance, production of\noxygen).\n\n\\begin{definition}\nLet $S$ be a social system\nin which behaviors may\ntake place as specified by behavior set $B_S$ . Then the following\nfunction:\n\n", "itemtype": "equation", "pos": 21778, "prevtext": "\nin which $r_1, r_2, \\ldots, r_n$ are role identifiers and $n\\ge0$ is an integer.\n\\end{definition}\n\n\n\\begin{definition}\nGiven any SoC $s$,\nWe shall say that request for service $a$ is enabled when it is in the service registry\nof the SCE of $s$.\n\\end{definition}\n\n\n\\begin{definition}\nGiven any FSO $f$,\nany SoC $s\\in f$,\nand any request for service $a$ that was enabled in $s$, we shall say that $a$ is active when\nall of its role identifiers have been associated to actors of $f$.\n\\label{d:active}\n\\end{definition}\n\nNote that, in Definition~\\ref{d:active}, we refer to the actors of $f$, not $s$. This means that\nthose actors may belong to any of the SoC's of $f$.\n\n\\begin{definition}\nAn association of roles to actors shall be called in what follows as ``enrollment''.\nA ``local enrollment'' shall be one in which all roles are found in the present SoC.\nOtherwise, we shall use the term ``global enrollment.''\n\\end{definition}\n\nAs in sociocracy~\\cite{BuEn12}, also in FSO we have two organizational rules:\n\\begin{description}\n\\item[Double membership:] For any $0<k<m$ and for any $s\\in\\hbox{SoC}(k)$, let us call $\\sigma(s)$ the SCE of $s$.\nThe double membership rule states that $\\sigma(s)$ is at the same time a member of $s$ and a member of $\\Pi(s)$.\n\\item[Exception:] Being the SCE of $s$, $\\sigma(s)$ receives notifications published by all the members of $s$.\nWhen an incoming notification corresponds to a request for services $a$ defined as\nin~\\eqref{e:ga}, $\\sigma(s)$ initiates a local enrollment, trying to identify a set of local actors\nto be associated with the roles necessary to enable $a$.\nThis is done by checking the current state of the\nsystem registry, which maintains an up-to-date state of all the members of $s$.\nThe exception rule states that, whenever $\\sigma(s)$ cannot identify in $s$ all the roles necessary\nto fulfil $a$, it will raise an \\emph{exception\\/} by publishing $a$ and its missing roles to $\\Pi(s)$.\nIn other words, a failed local enrollment is turned into a global enrollment.\n\\end{description}\n\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=1.0\\textwidth]{whole.jpg}}\n\\caption{Exemplification of a 3-layer FSO. PSC loci are in this case smart rooms,\nsmart houses, and a ``smart building''. Top vertex represent SCE's, which manage their SoC\nand at the same time are members of their parent SoC.}\\label{f:FSO}\n\\end{figure}\n\n\nIn what follows, we illustrate how the the SoC and the FSO fulfil the key requirements\nto the realization of an effective PSC infrastructure that we have\nintroduced in Sect.~\\ref{s:socorg}.\n\n\n\\section{SoC's and FSO's as foundation for PSC infrastructures}\\label{s:found}\n\nAs we mentioned in Sect.~\\ref{s:socorg},\nPSC constitutes a ``communication channel'' (\\emph{sensu\\/} Boulding's model)\nthat is characterized by the following major services:\nsocial translucence; referral services; and the empowering of a system's parts\nand whole. In what follows we highlight how SoC and FSO support those services.\n\n\n\\subsection{Social translucence}\\label{ss:st}\n\nAs already mentioned, social translucence is obtained in SoC's by identifying mutualistic\nrelationships and by making the involving parties aware of the existence of those relationships.\nIn order to better explain this concept we now introduce a number of definitions.\n\n\\begin{definition}[Social action]\nLet $D$ and $R$ be two social systems.\nBehaviors may take place in either system\nas specified by behavior sets $B_D$ and $B_R$. Then the\nfollowing bijective function:\n\n", "index": 3, "text": "\\begin{equation}\n\\sigma: B_D \\to B_R\n\\label{e:act}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\sigma:B_{D}\\to B_{R}\" display=\"block\"><mrow><mi>σ</mi><mo>:</mo><mrow><msub><mi>B</mi><mi>D</mi></msub><mo>→</mo><msub><mi>B</mi><mi>R</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\nmaps behaviors in $B_S$ with a semantic interpretation/evaluation of\nthe significance of those behaviors for $S$. We assume that said\ninterpretation may be associated at least with one of the\nfollowing three classes: positive, neutral, and negative,\nmeaning respectively that the mapped action is evaluated as\nbeing beneficial, insignificant, or disadvantageous. Integers 1,\n0, and -1 will be used to represent the above three classes\nrespectively.\n\\end{definition}\n\nAs an example, if $S$ is the animal kingdom, then a behavior\nsuch as $b=$``production of oxygen'' would be considered as beneficial,\nand therefore $\\varepsilon_S(b) = 1$.\n\nWe can now define a mutualistic precondition:\n\\begin{definition}[Mutualistic precondition]\nLet $D$ and $R$, $B_D$ and $B_R$, and $I_D$ and $I_R$\nbe defined as above. Then the following\nconditions are called the mutualistic precondition (MP)\nbetween $D$ and $R$:\n\n", "itemtype": "equation", "pos": 22553, "prevtext": "\nmaps behaviors in $B_D$ with corresponding behaviors in $B_R$.\n\\end{definition}\n\nAs an example, if $D$ and $R$ are respectively the animalia and plantae kingdoms,\nthen $\\sigma$ shall map behaviors produced by animals (for instance,\nrespiration) into behaviors experienced by plants (for instance, production of\ncarbon dioxide); and if $D$ and $R$ are respectively the plantae and the animalia kingdoms,\nthen $\\sigma$ shall map behaviors produced by plants (for instance,\nphotosynthesis) into behaviors experience by animals (for instance, production of\noxygen).\n\n\\begin{definition}\nLet $S$ be a social system\nin which behaviors may\ntake place as specified by behavior set $B_S$ . Then the following\nfunction:\n\n", "index": 5, "text": "\\begin{equation}\n\\varepsilon_S : B_S \\to I_S\n\\label{e:eval}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\varepsilon_{S}:B_{S}\\to I_{S}\" display=\"block\"><mrow><msub><mi>ε</mi><mi>S</mi></msub><mo>:</mo><mrow><msub><mi>B</mi><mi>S</mi></msub><mo>→</mo><msub><mi>I</mi><mi>S</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 23529, "prevtext": "\nmaps behaviors in $B_S$ with a semantic interpretation/evaluation of\nthe significance of those behaviors for $S$. We assume that said\ninterpretation may be associated at least with one of the\nfollowing three classes: positive, neutral, and negative,\nmeaning respectively that the mapped action is evaluated as\nbeing beneficial, insignificant, or disadvantageous. Integers 1,\n0, and -1 will be used to represent the above three classes\nrespectively.\n\\end{definition}\n\nAs an example, if $S$ is the animal kingdom, then a behavior\nsuch as $b=$``production of oxygen'' would be considered as beneficial,\nand therefore $\\varepsilon_S(b) = 1$.\n\nWe can now define a mutualistic precondition:\n\\begin{definition}[Mutualistic precondition]\nLet $D$ and $R$, $B_D$ and $B_R$, and $I_D$ and $I_R$\nbe defined as above. Then the following\nconditions are called the mutualistic precondition (MP)\nbetween $D$ and $R$:\n\n", "index": 7, "text": "\\begin{equation}\n\\exists b\\in B_D : \\varepsilon_D(b)\\ge0 \\wedge \\varepsilon_R(\\sigma(b))>0 \\label{e:mp1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\exists b\\in B_{D}:\\varepsilon_{D}(b)\\geq 0\\wedge\\varepsilon_{R}(\\sigma(b))&gt;0\" display=\"block\"><mrow><mrow><mrow><mo>∃</mo><mi>b</mi></mrow><mo>∈</mo><msub><mi>B</mi><mi>D</mi></msub></mrow><mo>:</mo><mrow><mrow><msub><mi>ε</mi><mi>D</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>b</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mrow><mn>0</mn><mo>∧</mo><mrow><msub><mi>ε</mi><mi>R</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>b</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mn>0</mn></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\n\\end{definition}\n\nThe first formula, \\eqref{e:mp1}, states that there exists a behavior in $B_D$ that is interpreted as\npositive or neutral, though its occurrence\nproduces positive returns for $R$.\nThe second formula, \\eqref{e:mp2}, expresses a dual condition: an action $c$ that is either neutral or positive\nin $R$ translates in a beneficial action $\\sigma^{-1}(c)$.\n\nAnimal respiration and plant photosyntesis are behaviors that fulfil MP.\n\n\\begin{definition}[Mutualistic relationship]\nA mutualistic\nrelationship between two social systems $D$ and $R$\nis defined as the social behavior occurring when $D$ and\n$R$ enact individual behaviors that correspond to the mutualistic\npreconditions \\eqref{e:mp1} and \\eqref{e:mp2}. When a mutualistic relation\nexists between $D$ and $R$,\nwe shall write $D\\ointclockwise R$.\n\\label{d:mr}\n\\end{definition}\n\nWhat possibly happens in nature is that the positive returns\ntriggered by a certain behavior of $D$ stimulate in $R$ the\nproduction of a dual behavior. The positive interpretation of the\nlatter in $D$ further stimulates the production of the former\nactions, which consolidates the mutualistic\nrelationship between $D$ and $R$ (viz.  $D\\ointclockwise R$).\n\n\\begin{definition}[Chain of mutualistic relationships]\nMutualistic relationships may take place also between three or more social systems;\na typical case that occurs in nature is that of chains of mutualistic\nrelationships:\n\n", "itemtype": "equation", "pos": 23649, "prevtext": "\n\n", "index": 9, "text": "\\begin{equation}\n\\exists c\\in B_R : \\varepsilon_R(c)\\ge0 \\wedge \\varepsilon_D(\\sigma^{-1}(c))>0 \\label{e:mp2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\exists c\\in B_{R}:\\varepsilon_{R}(c)\\geq 0\\wedge\\varepsilon_{D}(\\sigma^{-1}(c%&#10;))&gt;0\" display=\"block\"><mrow><mrow><mrow><mo>∃</mo><mi>c</mi></mrow><mo>∈</mo><msub><mi>B</mi><mi>R</mi></msub></mrow><mo>:</mo><mrow><mrow><msub><mi>ε</mi><mi>R</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mrow><mn>0</mn><mo>∧</mo><mrow><msub><mi>ε</mi><mi>D</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>σ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mn>0</mn></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 25202, "prevtext": "\n\\end{definition}\n\nThe first formula, \\eqref{e:mp1}, states that there exists a behavior in $B_D$ that is interpreted as\npositive or neutral, though its occurrence\nproduces positive returns for $R$.\nThe second formula, \\eqref{e:mp2}, expresses a dual condition: an action $c$ that is either neutral or positive\nin $R$ translates in a beneficial action $\\sigma^{-1}(c)$.\n\nAnimal respiration and plant photosyntesis are behaviors that fulfil MP.\n\n\\begin{definition}[Mutualistic relationship]\nA mutualistic\nrelationship between two social systems $D$ and $R$\nis defined as the social behavior occurring when $D$ and\n$R$ enact individual behaviors that correspond to the mutualistic\npreconditions \\eqref{e:mp1} and \\eqref{e:mp2}. When a mutualistic relation\nexists between $D$ and $R$,\nwe shall write $D\\ointclockwise R$.\n\\label{d:mr}\n\\end{definition}\n\nWhat possibly happens in nature is that the positive returns\ntriggered by a certain behavior of $D$ stimulate in $R$ the\nproduction of a dual behavior. The positive interpretation of the\nlatter in $D$ further stimulates the production of the former\nactions, which consolidates the mutualistic\nrelationship between $D$ and $R$ (viz.  $D\\ointclockwise R$).\n\n\\begin{definition}[Chain of mutualistic relationships]\nMutualistic relationships may take place also between three or more social systems;\na typical case that occurs in nature is that of chains of mutualistic\nrelationships:\n\n", "index": 11, "text": "\\begin{equation}\n\\exists b\\in S_0 : \\left( \\bigwedge_{i=0}^{t-1} \\varepsilon_{S_i}(\\sigma^i(b))\\ge0 \\right) \\wedge\n\\varepsilon_{S_t}(\\sigma^t(b))>0\n\\label{e:mp3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\exists b\\in S_{0}:\\left(\\bigwedge_{i=0}^{t-1}\\varepsilon_{S_{i}}(\\sigma^{i}(b%&#10;))\\geq 0\\right)\\wedge\\varepsilon_{S_{t}}(\\sigma^{t}(b))&gt;0\" display=\"block\"><mrow><mo>∃</mo><mi>b</mi><mo>∈</mo><msub><mi>S</mi><mn>0</mn></msub><mo>:</mo><mrow><mo>(</mo><munderover><mo largeop=\"true\" mathsize=\"160%\" movablelimits=\"false\" stretchy=\"false\" symmetric=\"true\">⋀</mo><mrow><mi>i</mi><mo>=</mo><mn>0</mn></mrow><mrow><mi>t</mi><mo>-</mo><mn>1</mn></mrow></munderover><msub><mi>ε</mi><msub><mi>S</mi><mi>i</mi></msub></msub><mrow><mo stretchy=\"false\">(</mo><msup><mi>σ</mi><mi>i</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>b</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>≥</mo><mn>0</mn><mo>)</mo></mrow><mo>∧</mo><msub><mi>ε</mi><msub><mi>S</mi><mi>t</mi></msub></msub><mrow><mo stretchy=\"false\">(</mo><msup><mi>σ</mi><mi>t</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>b</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>&gt;</mo><mn>0</mn></mrow></math>", "type": "latex"}, {"file": "1601.01222.tex", "nexttext": "\n\\end{definition}\n\nThe first formula, \\eqref{e:mp3}, states that there exists a chain of behaviors\nthat are interpreted as\npositive or neutral by a corresponding chain of social systems; and that\nthe last behavior in the chain\nproduces positive returns for the social system at the end of the chain.\nThe second formula, \\eqref{e:mp2}, expresses a dual condition: there exists\na chain of behaviors that ``moves'' from the end of the chain towards its\nbeginning; all those behaviors are positive or neutral, except at the beginning of the chain,\nfor which the behavior is beneficial.\n\nWhen \\eqref{e:mp3} and \\eqref{e:mp4} both hold for a set of social systems $\\mathbf{S}$, we\nshall indicate this by means of symbol $\\ointclockwise_\\mathbf{S}$.\nThe same symbol shall be used also for any other form of mutualistic relationship\nexperienced by a set of social systems $\\mathbf{S}$, including the one\nintroduced in Definition~\\ref{d:mr}.\n\n\nThe above definitions and symbols allow us to construct\nthe following semi-formal definition of social translucence.\n\\begin{definition}[Social translucence]\nGiven a set of social systems $\\mathbf{S}$ for which $\\ointclockwise_\\mathbf{S}$ holds,\nsocial translucence is the property to making all involved social systems\naware that $\\ointclockwise_\\mathbf{S}$ holds.\n\\end{definition}\n\nAchieving social translucence thus means that the SCE of a SoC makes use of the\n\\texttt{notify()} method of Fig.~\\ref{f:SoC-1} to spread awareness\nof the existence of a ``behaviour''\n(in fact, a service request) that, once enacted, would result in a mutualistic relationship.\nIn case of global enrollment, the first \\texttt{notify()} would trigger subsequent \\texttt{notify()}'s\nacross the nodes of the involved SoC's until all the enrolled social systems are made aware\nof the benefits of the social union expressed by the service request.\n\n\n\n\n\n\n\n\n\n\n\\subsection{Empowering the parts and the whole through e-referral}\\label{ss:eref}\n\nAs mentioned before, a major advantage of FSO and the SON mechanism is given by\nan e-referral approach that extends the scope of the one provided by SoC's.\nWhen a request for services $a$ is enabled, the corresponding actors become a new temporary SoC whose\nlifespan in limited to the duration of $a$. If enabling a request for services required\nexceptions---in other words,\nwhen the enrollment is global---the new temporary\nSoC is made of agents from different communities. In\nthat case, the new community brings together nodes\nfrom different layers of the FSO hierarchy. Because of\nthis, we call such a new SoC a social overlay network (SON).\nThe rigidity of existing organizations is thus\nreplaced by an agile and dynamic PSC infrastructure that exploits\nand promotes cooperation between PSC loci that represent\nsocietal services at different scales.\n\nThe need for such enhanced cooperation may be proved by considering two\ncases: a first one focusing on crisis management organizations, and a second\none related to healthcare.\nThe first case is one in which a single event with a global scope affects several\nsocial organizations at the same time.\n\nThe second case is one in which a single event requires a complex, composite,\nand coherent response from a number of social organizations.\nIn the rest of this section we shall briefly discuss those two cases\nin Sect.~\\ref{ss:crisis} and Sect.~\\ref{ss:care}.\n\n\n\n\\subsubsection{Crisis management organizations}\\label{ss:crisis}\n\nA practical case where FSO's and their SON's may be particularly of use is that of\ncrisis management and recovery.\nAs observed in~\\cite{DFSB14,DF15d}, disastrous events such as the Katrina hurricane~\\cite{CARRI3}\ndisrupt several concentric ``social layers'' at the same time---typically local, regional, national,\nand federal emergency response organizations. A major problem that was experienced during the\nKatrina crisis was that those organizations may be loosely coordinated and non-cooperating.\nConflicting goals and conflicting actions;\nmultiple uncoordinated efforts that resulted in wasting resources and in\nsome cases masked each other out;\nthe inability to share promptly and dynamically the organizational assets\naccording to the experienced needs; \nand the inability to make use of spontaneous (that is, non-institutional) responders~\\cite{DFSB14},\nwhere some of the reasons that slowed down\nand degraded considerably the effectiveness of the response to Katrina:\n\\begin{quote}\n    [Responders] ``would have been able to do more if the tri-level system (city, state, federal)\nof emergency response was able to\n    \\emph{effectively use, collaborate with, and coordinate the combined public and private efforts}''~\\cite{RAND}.\n\\end{quote}\nSimilar delays and inefficiencies~\\cite{Miskel08} were experienced also in other cases\\footnote{\n\tSee for instance the case of Hurricane Andrew~\\cite{Adair02}. Two eloquent quotes by Dr. Kate Hale,\n\tDade County's emergency management director during Andrew's crisis, were\n\t``They keep saying we're going to get supplies. For God's sake, where are they?'';\n\t``\\emph{Where in the hell is the cavalry on this one?}''.}.\n\nA major technique advocated as a solution to organizational delays and efficiencies in disaster recovery\nis so-called community resilience.\nAccording to RAND~\\cite{RAND}, community resilience is\n\n\\begin{quote}\nA measure of the sustained ability of a community to utilize available resources to respond to, withstand, and recover from adverse \nsituations. [\\dots] Resilient communities withstand and recover from disasters. They also learn from past disasters to strengthen future recovery \nefforts.\n\n\t\n\t\n\t\n\\end{quote}\n\nIn~\\cite{Paja}, an FSO for crisis management enabling community resilience was proposed.\nBy means of multi-agent simulations it was shown of two SoC's may share knowledge and resources\nin the course of a crisis. The crisis in this case was modeled as a number of\nhouses catching fire. Timely intervention was necessary in order to contain the damage.\nSaid simulation proved that cooperation between fire fighters organizations and ``non-institutional''\nresponders (individuals in proximity) considerably reduces the amount of burned down houses.\n\n\n\n\\subsubsection{Inter-organizational cooperation in healthcare}\\label{ss:care}\n\nRegardless of its nature, any system is affected by its design assumptions. Our societies are no exception.\nThe emergence of sought properties such as economic and social welfare for all;\nsustainability with respect to natural ecosystems;\nand especially manageability and resilience, highly depends on the way social organizations are designed.\nA typical case in point is given by traditional healthcare organizations.\nA common assumption\ncharacterizing those organizations is the adoption of a strict\nclient-server model. The major consequence of said assumption\nis the lack of server-side orchestration of responses to the users' requests.\nIn other words,\nit is the responsibility of the client to identify which server to bind to;\n   it is the user that needs to know, e.g., which emergency service to invoke; which\n   hospital to call first; which civil organization to refer to, and so on.\n   Referral services \\emph{do\\/} exist, though they mainly cover\n   very specific and simple cases (typically, the seamless transfer of patient information\n   from a primary to a secondary practitioner~\\cite{EReferrals}).\n   Moreover,\n   typically such services possess an incomplete view of the available resources.\nFurthermore, to the best of our knowledge, none of the existing referral services provides a composite response to complex\n   requests such that the action, knowledge, and assets\n   of multiple servers are automatically or semi-automatically combined and orchestrated.\n   Even electronic referral systems in use today are mostly limited~\\cite{ShBe07} and only provide\n   predefined services in specific domains\\footnote{\n        Interesting examples of such systems include SHINE~\\cite{SHINE} and SHINE OS$+$~\\cite{SHINEOS+}.}.\n   As a consequence,\n   in the face of complex servicing requests calling for the joint action of multiple servers,\n   the client is basically \\emph{left on its own}. Societal organizations do not\n   provide unitary responses nor assist the client in composing and managing them.\n   Reasons for this may be found in lack of awareness and also in the ``convenient''\n   shift of responsibility for failures\n   from the server to the client\\footnote{As observed by~\\cite{ZenVerhulst},\n        an example of said shift of responsibility may be found in car industry with respect to\n        aviation industry. A matter for reflection is the fact that the shift of responsibility\n        regrettably translates in an inferior safety culture.}.\n\nThrough the above considerations it becomes apparent that new and better\nassumptions are called for by social organizations.\nIn particular, the increasing complexity of modern times require that societal\norganizations assume responsibility for becoming the enablers\nof collectively intelligent responses.\nThose organization should function as a catalyst\nof mutualistic cooperation among the role players at all levels,\nfrom the citizens to the governing institutions. By means of the\norganization, knowledge should flow among the players highlighting\nneeds, assets, requirements, and opportunities. The\norganization should assist in the process of self-orchestrating a\nresponse, making it easier for all parties involved to coordinate\nthemselves, exchange information, and take the right and\ntimely decisions.\n\nSaid new model has been studied\nin the two papers~\\cite{DeFPa15a,DeFPa15b}. There, we introduced two e-referral services\nbased on our FSO's.\nThe first service makes use of FSO exceptions and SON's to self-orchestrate\na composite response for the user. By means of multi-agent simulations we proved\nthat this considerably shortens the\naverage time an individual in need of care has to wait until s/he receives the necessary treatment,\nincreases the amount of treated patients,\nand reduces the number of patients that could not timely receive their treatment.\nA major conclusion is the empowerment of the individuals and of society as a whole.\n\n\n\nThe second service again uses simulated FSO's and their SON's to tackle the well-known problem\nof falls identification. In order to improve the quality of\nfalls detection systems, a cloud of volunteers is used as an extra ``detection layer''\nto verify whether alarms actually correspond to falls or are false positives.\nMajor conclusions are that FSO's dynamic hierarchical organization optimally\norchestrates all participating entities thus overcoming the stiffness of the traditional organizations.\nMajor returns include an\nimprovement of social costs and a\nbetter use of the social resources (empowerment of the whole) as well as\na reduction of the average time to respond to identified falls (empowerment of the parts).\n\n\n\n\n\n\\section{Conclusions}\\label{s:end}\n\nWe have recalled the major characteristics of SoC and FSO, and shown that they\ncorrespond to the major requirements of pervasive social computing: social translucence,\ne-referral, and the empowerment of a social system's parts and whole.\nIn particular, we have mapped social translucence with the social computing engine\nof SoC's, and we have discussed FSO-based e-referral services in the crisis management\nand healthcare management domains.\nThanks to the FSO organizational rules and FSO's nested compositional hierarchy,\nthe advertising of service requests extends beyond the originating locus. This makes it possible\nto achieve ``inter-loci'' cooperation though the mechanism we called ``social overlay networks.''\nWe showed how\nthe ability to compose social overlay networks\nconstitute a mechanism to achieve complex e-referral services\nand enable social cooperation between co-existing organizations.\nBy recalling results achieved through multi-agent simulation,\nwe suggested how FSO-based pervasive social computing replaces\nthe rigidity of existing organizations\nwith an agile and dynamic PSC infrastructure that exploits\ncooperation between PSC loci that represent societal services at different scales.\nIn our future work we hope to move from simulation to real-life experimentation\nextending systems such as the FSO middleware of~\\cite{DFSB13a,DF15c}.\nA major challenge shall be to prove the resilience of those systems~\\cite{DF15d,DF15b},\nnamely improving the quality of social organizations while preserving key\naspects of their identity.\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\n\\bibliographystyle{elsarticle-harv}\n\n\n\n\\bibliography{/refs/thesis}\n\n", "itemtype": "equation", "pos": 25379, "prevtext": "\n\n", "index": 13, "text": "\\begin{equation}\n\\exists c\\in S_t : \\left( \\bigwedge_{i=1}^{t-1} \\varepsilon_{S_{t-1-i}}(\\sigma^{-i}(c))\\ge0 \\right) \\wedge\n\\varepsilon_{S_0}(\\sigma^{-t}(c))>0.\n\\label{e:mp4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\exists c\\in S_{t}:\\left(\\bigwedge_{i=1}^{t-1}\\varepsilon_{S_{t-1-i}}(\\sigma^{%&#10;-i}(c))\\geq 0\\right)\\wedge\\varepsilon_{S_{0}}(\\sigma^{-t}(c))&gt;0.\" display=\"block\"><mrow><mo>∃</mo><mi>c</mi><mo>∈</mo><msub><mi>S</mi><mi>t</mi></msub><mo>:</mo><mrow><mo>(</mo><munderover><mo largeop=\"true\" mathsize=\"160%\" movablelimits=\"false\" stretchy=\"false\" symmetric=\"true\">⋀</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mrow><mi>t</mi><mo>-</mo><mn>1</mn></mrow></munderover><msub><mi>ε</mi><msub><mi>S</mi><mrow><mi>t</mi><mo>-</mo><mn>1</mn><mo>-</mo><mi>i</mi></mrow></msub></msub><mrow><mo stretchy=\"false\">(</mo><msup><mi>σ</mi><mrow><mo>-</mo><mi>i</mi></mrow></msup><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>≥</mo><mn>0</mn><mo>)</mo></mrow><mo>∧</mo><msub><mi>ε</mi><msub><mi>S</mi><mn>0</mn></msub></msub><mrow><mo stretchy=\"false\">(</mo><msup><mi>σ</mi><mrow><mo>-</mo><mi>t</mi></mrow></msup><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>&gt;</mo><mn>0</mn><mo>.</mo></mrow></math>", "type": "latex"}]