[{"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $M_{\\rm h}(z_0)=10^{13}$ M$_\\odot$ is the host DM halo at redshift $z_0=6.4$.\nThe redshift evolution of this resolution mass is shown in the left panel of \nFig.~\\ref{fig:fig1}. This choice enables us to simulate different \nrealizations of the merger tree resolving high-$z$ mini-halos in a relatively short \ncomputational time. \n\nIn mini-halos, which we define here as dark matter halos with $1200~{\\rm K} \\le T_{\\rm vir}< 10^4$ K, \nthe primordial gas can cool via rotational transitions of {H$_2$ } (e.g. \\citealt{HTL96}).\nDark matter halos whose virial temperature exceeds the threshold for efficient atomic \nline cooling,  $T_{\\rm vir} \\geq 10^4$~K, are instead referred to as {\\it Lyman$-\\alpha$} (Ly$\\alpha$) halos. \nThe number of mini-halos and Ly$\\alpha$ halos averaged over 10 different merger\ntree realizations is shown as a function of redshift in the right panel of \nFig.~\\ref{fig:fig1}. \nAs expected, at $z \\gtrsim 17$ mini-halos represent the dominant population among dark matter\nprogenitors. Their number decreases at lower redshift down to $z \\sim 14$, below which \nthe halo population is completely dominated by more massive systems.\nThis is a consequence of the redshift evolution of the \nassumed resolution mass which exceeds the minimum mass of Ly$\\alpha$ halos at these redshifts\\footnote{In other words, we are note able to resolve mini-halos at redshift \n$z<14$ due to the chosen resolution mass threshold. \nThis does not affect our results because at these $z$ radiative feedback has already \nsuppressed star and BH formation in all halos below a virial \ntemperature of $10^4$ K. This will be discussed in section \\ref{sec:results}.}. \n\n\n\n\n\\begin{figure*}\n\\includegraphics [width=8.0cm]{resolutionmasses.pdf}\n\\includegraphics [width=8.0cm]{numberhalos.pdf}\n\\caption{Left panel: redshift evolution of the resolution mass adopted in the merger\ntree simulations (solid red line) and of the dark matter halo masses corresponding to\na virial temperature of $1200$ K (azure dot-dashed line) and $10^4$ K (blue dashed line).\nRight panel: the number of dark matter halos as a function of redshift averaged over\n10 independent realizations of the merger tree (solid line). Long and short-dashed lines\nshow the separate contributions of mini-halos and Lyman-$\\alpha$ halos (see text).\nShaded regions represent the minimum and maximum values at each redshift.} \n\\label{fig:fig1} \n\\end{figure*} \n\n\n\\subsection{UV radiation}\n\\label{sec:UV}\n\nThe radiation emitted by stars and accreting BHs gradually builds up a cosmic ultraviolet (UV) \nbackground.\nSince we reconstruct the merger history of a single biased, high density region at \n$z>6$, here we refer to UV background as the cumulative emission\ncoming from all the progenitor galaxies of the $M_{\\rm h} = 10^{13}$ {M$_\\odot$} \\, DM halo \nwithin its comoving volume at the turn-around radius, $V_{\\rm com} = 50 \\, \\rm Mpc^3$.\n\nRadiative feedback effects have a fundamental role in the history of star and BH seed formation. \nPhotons in the Lyman$-$Werner (LW) band, $[11.2 - 13.6]$ eV, can easily dissociate \n{H$_2$ } molecules, suppressing cooling and star formation in metal-poor \nmini-halos (e.g. \\citealt{HRL97a, HRL97b}, \\citealt{ON99}, \\citealt{Omukai01}, \n\\citealt{Mach01}). Even a moderate LW flux can lead to an increase of the minimum mass required for DM \nhalos to host star formation (see Appendix A). \n\nThe increased gas temperature in photo-ionized regions leads to an increase of the \ncosmological Jeans mass. As a result, gas accretion onto low-mass dark matter halos\nis suppressed in ionized regions, while the internal gas in existing low-mass halos will be\nphoto-evaporated (e.g. \\citealt{BL99}, \\citealt{Shap04}, \\citealt{SM13}).\n\nThe cumulative flux (in units of erg cm$^{-2}$ s$^{-1}$ Hz$^{-1}$ sr$^{-1}$) at the \nobserved frequency $\\nu_{\\rm obs}$ and redshift $z_{\\rm obs}$ is computed as (e.g. \n\\citealt{HM96}):\n\n\n", "itemtype": "equation", "pos": 13343, "prevtext": "\n\n\\date{Accepted . Received }\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \n\\pubyear{2016}\n\\maketitle\n\n\\begin{abstract}\nThe growth of the first super massive black holes (SMBHs) at $z > 6$ is\nstill a major challenge for theoretical models. If it starts from\nblack hole (BH) remnants of Population III stars (light seeds \nwith mass $\\sim 100$ M$_\\odot$) it requires super-Eddington\naccretion. An alternative route is to start from heavy seeds\nformed by the direct collapse of gas onto a $\\sim 10^5$ M$_\\odot$\nBH. Here we investigate the relative role of light and heavy\nseeds as BH progenitors of the first SMBHs. We use the \ncosmological, data constrained semi-analytic model {\\textsc{GAMETE/QSOdust}}\n\\, to simulate several independent merger histories of $z > 6$\nquasars. Using physically motivated prescriptions to form light and heavy \nseeds in the progenitor galaxies, \nwe find that the formation of a few heavy seeds (between 3 and 30 in our reference\nmodel)  enables the Eddington-limited  growth of \nSMBHs at $z > 6$. This conclusion depends sensitively on the\ninterplay between chemical, radiative and mechanical feedback effects,\nwhich easily erase the conditions that allow the suppression\nof gas cooling in the low metallicity gas \n($Z < Z_{\\rm cr}$ and $J_{\\rm LW} > J_{\\rm cr}$). \nWe find that heavy seeds can not form if dust cooling triggers gas fragmentation above a\ncritical dust-to-gas mass ratio (${\\cal D} \\ge {\\cal D}_{\\rm cr}$). \nIn addition, the relative importance of light and heavy seeds\ndepends on the adopted mass range for light seeds, as this dramatically\naffects the history of cold gas along the merger tree, by both SN and\nAGN-driven winds. \n\n\\end{abstract}\n\n\\begin{keywords}\nGalaxies: evolution, high-redshift, ISM; quasars: general; black hole physics; stars: black holes\n\n\\end{keywords}\n\\section{Introduction}\n\nSuper Massive Black Holes (SMBHs), powering the most luminous quasars \n($>10^{47}$ erg s$^{-1}$) at redshift $z>6$, are among the most \nintriguing and puzzling astronomical objects observed in the early Universe.\nObservational campaigns are pushing the high redshift frontier closer and \nbeyond the reionization epoch, expanding the census of high redshift quasars. \n\nThe most distant quasar observed so far is ULAS J1120+0641, at $z\\sim 7$, \nin which the central engine is a black hole (BH) with a mass of \n$M_{\\rm BH}=2.0^{+1.5}_{-0.7}\\times 10^9$ {M$_\\odot$} \\, \\citep{Mortlock11}, \nalready in place when the Universe was as old as $\\sim 700$ Myr. \nRecently, \\citet{Wu15} discovered an ultraluminous quasar at $z\\sim 6.3$ \n($\\sim 4\\times 10^{14}$ L$_\\odot$) hosting a massive BH of \n$(1.2\\pm 0.19)\\times 10^{10}$ {M$_\\odot$}, presumably accreting close to the \nEddington rate.\n\nThe existence of $10^9-10^{10}$ {M$_\\odot$} \\, BHs in the early Universe \n(\\citeauthor{Fan01} \\citeyear{Fan01, Fan04}; \n\\citeauthor{deRosa11} \\citeyear{deRosa11, deRosa14} and \nreferences therein) poses a challenge to theoretical models aimed to \nexplain the formation and growth of such massive objects. \nMany efforts have been done so far in order to\nunveil the nature of their progenitor seed BHs,\nhow and when these seeds form and how they can grow so rapidly, in less than \n$\\sim 1$ Gyr, up to few billion solar masses and more.\n\nDifferent scenarios \nfor BH formation have been proposed so far (see e.g. \\citealt{Rees78, \nVolonteri10}, \\citealt*{VolonteriBellovary12}\nfor comprehensive reviews).\nBH seeds with $M_{\\rm BH} \\sim 10^2$ M$_\\odot$ are predicted to form as end products \nof massive, metal-poor Population III (Pop~III) stars (e.g. \\citealt{Abel02, Heger03};\n\\citealt*{MadauRees01}; \\citealt{Yoshida08, Latif13b, Hirano14}).\nRunaway collisions of massive stars during the gravitational collapse of \nthe core of compact star clusters can lead to the formation  of  intermediate mass \nBHs with $M_{\\rm BH} \\sim 10^3-10^4$ M$_\\odot$ (e.g. \\citealt{Omukai08}; \\citealt*{Devecchi09};\n\\citealt{Katz15}). In addition, the fast merging of stellar mass BHs in a cluster\nhas been proposed as a possible way to give rise to more massive seeds\n(\\citealt{Davies11, Lupi14}). Finally, the formation of more massive, $10^4-10^6$ {M$_\\odot$}, seed BHs \nis predicted to occur via direct collapse of dense, \nmetal poor gas clouds in halos with virial temperatures $T_{\\rm vir}\\geq 10^4$ K which \nare exposed to a strong {H$_2$ } photodissociating flux (e.g. \\citealt{BL03, Begelman06, \nSpaansSilk06}; \\citealt*{IO12}; \\citealt{Inayoshi14, Ferrara14}).\nLow metallicity and the suppression of {H$_2$ } molecules formation are fundamental requirements \nfor avoiding gas cooling, cloud fragmentation and thus star formation. \n\nIt has been suggested that the less massive seeds (Pop III remnants and collapsed \nstellar clusters) would require a continuous gas accretion close to or above the \nEddington limit in order to grow up to few billion solar masses in less than\n$\\sim 1$ Gyr. \nFor example, \\citet{Johnson13} show that BH seeds as massive as\n$10^5$ {M$_\\odot$}, are required if sub-Eddington accretion and a large radiative efficiency\n($\\epsilon_{\\rm r}\\geq 0.1$) are assumed (see also \\citealt*{VSD15}). \n\nAlthough the conditions in which they can form are met only in very rare \nenvironments (e.g. \\citeauthor{Hosokawa12} \\citeyear{Hosokawa12, Hosokawa13}; \n\\citealt{Inayoshi14}; \\citealt*{IH14}, \\citealt{Sugimura15, Yue14})\ndirect collapse BHs (DCBHs) have been proposed as a viable \nscenario to explain  high redshift SMBHs.\nThe formation mechanism, characteristic mass and relevant processes in the direct \ncollapse scenario have been widely investigated in the literature \n(e.g. \\citeauthor{Latif13a} \\citeyear{Latif13a, Latif13b, Latif14b}; \n\\citealt{Johnson12, Sugimura14}; \n\\citeauthor{Agarwal14} \\citeyear{Agarwal12, Agarwal14, Agarwal15};\n\\citealt{LatifVolonteri15}, \\citeauthor{Glover15a} \\citeyear{Glover15a, Glover15b}).\n\nThe work presented in this paper is similar in spirit to what has been done \nby \\citet{Petri12} who presented a semi-analytic model for the assembly of \nhigh-$z$ SMBHs along a merger history, starting from DCBHs of $10^5$ {M$_\\odot$} \\, \nand stellar mass BHs of $10^2$ {M$_\\odot$}.\nThey show that the final BH mass assembled via both gas accretion and BH-BH mergers, \nstrongly depends on the fraction of halos hosting DCBHs in the merger tree. \nA $\\sim 10^{10}$ {M$_\\odot$} \\, BH can be obtained if this fraction reaches $100\\%$.\nHowever, these authors do not follow the chemical evolution of the host galaxies, \nand in particular of the metallicity and dust-to-gas ratio of the interstellar medium.\n\nThe aim of this paper is to investigate the relative role of the less massive, Pop III remnant,\nseed BHs (light seeds) and of the most massive DCBH seeds (heavy seeds) in the formation \nand evolution of the first SMBHs, taking into account the BH-host galaxy co-evolution.\nTo this aim we adopt an improved version of the semi-analytic code {\\textsc{GAMETE/QSOdust}} \\,\nwhich has been successfully used to investigate the evolutionary scenarios of\nhigh redshift quasars at $z>5$ (\\citealt{V11,V12,V14}). In particular, together with\nthe mass of the BH, the model well reproduce the properties of the quasars host galaxies \nsuch as the star formation rate, the mass of gas, metals and dust.\n\nAs in \\citet{V11} we select as our target the quasar SDSS J1148+5251, \nobserved at redshift $z=6.4$. This is one of the best studied object at\nhigh redshift, hosting a BH mass of $(2-6)\\times 10^9$ {M$_\\odot$} \\, \n(\\citealt{Barth03, Willott03}). The other main observed properties of this \nquasar are summarized in \\citet{V11} and \\citet{V14}. \n\nThe paper is organized as follows. \nIn section 2 we present our approach introducing the model {\\textsc{GAMETE/QSOdust}} \\, \nand presenting in details the new features implemented for this work.\nThe results are presented in section 3 where we study \nthe redshift evolution of the BH mass and the birth environment of the seeds\npredicted by the reference model. In section 4 we discuss the dependence of \nthe results on the model assumptions and parameters, and we summarize the \nconclusions in section 5.\n\n\n\n\\section{Summary of the model}\nHere we briefly introduce {\\textsc{GAMETE/QSOdust}}, the semi-analytic model adopted for \nthis study, focusing on the new features implemented to investigate the \nnature of the first seed black holes.\nWe refer the reader to \\citeauthor{V11} (\\citeyear{V11,V14}) for a full description \nof the code.\n\n{\\textsc{GAMETE/QSOdust}}\\, is a data constrained model aimed at the study of the formation and evolution \nof the first quasars and their host galaxies.  \nIt is based on the semi-analytic merger tree model \\textsc{GAMETE}\nwhich was originally developed by \\citet{SS07} to investigate the early evolution\nof the Milky Way and later applied to the Milky Way dwarf satellites \\citep{SS08,SS09,SS15},\nto investigate their contribution to the reionization and metal enrichment  history of the \nLocal Group \\citep{SS14}, and to explore the connection of Damped Lyman-$\\alpha$ systems\nwith local dwarfs \\citep{SS12}.\nA two-phase interstellar medium (ISM) version of \\textsc{GAMETE} was successfully \nadopted as a stellar archaeology tool to investigate the origin of metal-poor \nlow-mass stars in the Milky Way (\\citealt{deBen14}, \\citeauthor{deBen14} in prep).\n\nIn its present version, {\\textsc{GAMETE/QSOdust}} \\, enables us to investigate the co-evolution\nof nuclear black holes and their host galaxies, following their star formation\nhistories and the enrichment of their ISM with metals and dust. \nThe gas reservoir inside each galaxy is \nregulated by processes of star formation, BH growth and feedback.\n\nWe assume that the first SMBHs, observed at $z>5$, reside in dark \nmatter (DM) halos of $M_{\\rm h} = 10^{13}$ {M$_\\odot$} \\, \nThus, we first reconstruct the merger tree of such massive halos, decomposing them \ninto their progenitors, backward in time, following a binary Monte Carlo approach \nbased on the Extended Press-Schechter theory (see \\citealt{V11} and references \ntherein for details): at each timestep, a halo of mass $M_{\\rm h}$ can either lose mass or \nlose mass and fragment into two less massive ($\\leq M_{\\rm h}/2$) progenitors.\n\nAlong the merger history of the DM progenitors, we follow the gradual evolution of \nthe central SMBH and its host galaxy, via both mass accretion and mergers.\nWe define as major mergers halos merging with mass ratio $\\mu>1/4$, where $\\mu$ is \nthe ratio of the less massive halo over the most massive companion.\nIn each galaxy, the star formation rate (SFR) is assumed to be proportional to the \navailable gas mass and the efficiency at which the gas is transformed into stars is \nenhanced during major mergers (see \\citeauthor{V11} \\citeyear{V11,V14}). \n\nFollowing \\citet{V11}, we assume\nthat in major mergers pre-existing BHs merge in symbiosis with their \nhost galaxies and form of a new, more massive BH. \nIn minor mergers BHs are unable to spiral in on short timescales as the \nmerger time scale is on the order of the Hubble time or longer (see e.g. \n\\citealt{TH09}). As a result, the least massive BH of the merging pair remains as a \nsatellite and we do not follow its evolution.  \n\nWe assume Eddington-limited BH growth. The\naccretion rate is described by the Bondi-Hoyle-Lyttleton (BHL) formula\nwhere we introduce a free parameter, $\\alpha_{\\rm BH}$, which is commonly adopted\nto quantify the increased density in the inner regions around the BH \\citep{diMat05}.\nA value of $\\alpha_{\\rm BH} = 50 $ is fixed to match the observed SMBH mass of J1148.\nA fraction of the energy released by supernova explosions and BH accretion\nis converted into kinetic energy of the gas in the host galaxy, thus driving gas outflows \nin the form of winds. In our previous study \\citep{V12} we show that the BH-host galaxy co-evolution is \nregulated by quasar feedback, with SN-driven winds providing a negligible \ncontribution to the mass outflow rate, in good agreement with observations of \noutflowing gas in J1148 \\citep{M12,Cicone15}.\nThe AGN-driven wind efficiency, $\\epsilon_{\\rm w,AGN} =  2.5 \\times 10^{-3}$ is fixed to match the observed \ngas mass in the host galaxy of J1148 (see Section~2.7).\n\nFinally,  the ISM of each progenitor galaxy is progressively enriched with metals \nand dust produced by Asymptotic Giant Branch (AGB) stars and Supernovae (SNe) \naccording to their stellar evolutionary time scales. \nHere we adopt the improved version of the chemical evolution module of {\\textsc{GAMETE/QSOdust}} \\,\npresented in \\citet{V14}, where we consistently follow the evolution of metals and dust\n taking into account the dust life-cycle in a two-phase ISM. \nIn hot diffuse gas, dust grains can be destroyed by SN shocks while in cold, dense \nclouds - where stars form - dust grains can grow by accretion of gas-phase heavy elements.\n\nIn the following sections we describe the new features introduced in the model\nfor the purpose of the present study.\n\n\n\n\\subsection{Resolving mini-halos}\n\\label{sec:DMhalos}\n\nThe first collapsed objects where the gas is able to cool and form stars have small masses, \n$M_{\\rm h} \\sim 10^{5-6}$ {M$_\\odot$}, and virial temperatures $T_{\\rm vir}< 10^4$~K  \n(see e.g. \\citealt{Bromm13} for a recent review).  To resolve these so-called\n{\\it mini-halos}, we simulate the merger trees adopting a minimum mass of:\n\n", "index": 1, "text": "\\begin{equation}\nM_{\\rm res}(z_i) = 10^{-3} \\, M_{\\rm h}(z_0)\\,\\Big(\\frac{1+z_i}{1+z_0}\\Big)^{-7.5}\n\\label{eq:mres}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm res}(z_{i})=10^{-3}\\,M_{\\rm h}(z_{0})\\,\\Big{(}\\frac{1+z_{i}}{1+z_{0}}%&#10;\\Big{)}^{-7.5}\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mi>res</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>3</mn></mrow></msup></mpadded><mo>⁢</mo><msub><mi>M</mi><mi mathvariant=\"normal\">h</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mn>0</mn></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mfrac><mrow><mn>1</mn><mo>+</mo><msub><mi>z</mi><mi>i</mi></msub></mrow><mrow><mn>1</mn><mo>+</mo><msub><mi>z</mi><mn>0</mn></msub></mrow></mfrac><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mrow><mo>-</mo><mn>7.5</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": " \nwhere $\\tau_{\\rm H_2}$ is the {H$_2$ } optical depth in the LW band and $\\epsilon(\\nu_{z},z)$ \nis the comoving emissivity, namely the monochromatic luminosity per unit comoving\nvolume (erg s$^{-1}$ Hz$^{-1}$ cm$^{-3}$), in the LW band at redshift $z$. \nThe redshift $z_{\\rm max}$ represents the highest redshift from which a LW photon emitted\nby a source at $z>z_{\\rm obs}$ can reach the observer at $z_{\\rm obs}$ before being redshifted\nat lower frequencies, outside the LW range, into a H Lyman resonance line. \nIn the dark screen approximation, this \nredshift can be defined as $(1+z_{\\rm max})/(1+z_{\\rm obs}) = \\nu_{i}/\\nu_{\\rm obs}$ (see e.g. \n\\citealt{HRL97}, \\citealt{HAR00}) being $\\nu_{i}$ the first Lyman line frequency \nabove the observed one.\n\nIn general, $\\tau_{\\rm H_2}$ depends on {H$_2$ } number density, on the line profile and \non the probability that the molecule is dissociated after a transition. It can reach values \n$\\tau_{\\rm H_2}\\geq 3$ (\\citealt{CFA00}, \\citealt{RGS01})\nleading to a reduction in the LW background flux of about one order of magnitude.\nFollowing \\citet{Ahn09} we compute the intergalactic absorption averaged over the LW band\nusing the modulation factor described by the fitting formula: \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\noindent\nwhere $M_{\\rm h}(z_0)=10^{13}$ M$_\\odot$ is the host DM halo at redshift $z_0=6.4$.\nThe redshift evolution of this resolution mass is shown in the left panel of \nFig.~\\ref{fig:fig1}. This choice enables us to simulate different \nrealizations of the merger tree resolving high-$z$ mini-halos in a relatively short \ncomputational time. \n\nIn mini-halos, which we define here as dark matter halos with $1200~{\\rm K} \\le T_{\\rm vir}< 10^4$ K, \nthe primordial gas can cool via rotational transitions of {H$_2$ } (e.g. \\citealt{HTL96}).\nDark matter halos whose virial temperature exceeds the threshold for efficient atomic \nline cooling,  $T_{\\rm vir} \\geq 10^4$~K, are instead referred to as {\\it Lyman$-\\alpha$} (Ly$\\alpha$) halos. \nThe number of mini-halos and Ly$\\alpha$ halos averaged over 10 different merger\ntree realizations is shown as a function of redshift in the right panel of \nFig.~\\ref{fig:fig1}. \nAs expected, at $z \\gtrsim 17$ mini-halos represent the dominant population among dark matter\nprogenitors. Their number decreases at lower redshift down to $z \\sim 14$, below which \nthe halo population is completely dominated by more massive systems.\nThis is a consequence of the redshift evolution of the \nassumed resolution mass which exceeds the minimum mass of Ly$\\alpha$ halos at these redshifts\\footnote{In other words, we are note able to resolve mini-halos at redshift \n$z<14$ due to the chosen resolution mass threshold. \nThis does not affect our results because at these $z$ radiative feedback has already \nsuppressed star and BH formation in all halos below a virial \ntemperature of $10^4$ K. This will be discussed in section \\ref{sec:results}.}. \n\n\n\n\n\\begin{figure*}\n\\includegraphics [width=8.0cm]{resolutionmasses.pdf}\n\\includegraphics [width=8.0cm]{numberhalos.pdf}\n\\caption{Left panel: redshift evolution of the resolution mass adopted in the merger\ntree simulations (solid red line) and of the dark matter halo masses corresponding to\na virial temperature of $1200$ K (azure dot-dashed line) and $10^4$ K (blue dashed line).\nRight panel: the number of dark matter halos as a function of redshift averaged over\n10 independent realizations of the merger tree (solid line). Long and short-dashed lines\nshow the separate contributions of mini-halos and Lyman-$\\alpha$ halos (see text).\nShaded regions represent the minimum and maximum values at each redshift.} \n\\label{fig:fig1} \n\\end{figure*} \n\n\n\\subsection{UV radiation}\n\\label{sec:UV}\n\nThe radiation emitted by stars and accreting BHs gradually builds up a cosmic ultraviolet (UV) \nbackground.\nSince we reconstruct the merger history of a single biased, high density region at \n$z>6$, here we refer to UV background as the cumulative emission\ncoming from all the progenitor galaxies of the $M_{\\rm h} = 10^{13}$ {M$_\\odot$} \\, DM halo \nwithin its comoving volume at the turn-around radius, $V_{\\rm com} = 50 \\, \\rm Mpc^3$.\n\nRadiative feedback effects have a fundamental role in the history of star and BH seed formation. \nPhotons in the Lyman$-$Werner (LW) band, $[11.2 - 13.6]$ eV, can easily dissociate \n{H$_2$ } molecules, suppressing cooling and star formation in metal-poor \nmini-halos (e.g. \\citealt{HRL97a, HRL97b}, \\citealt{ON99}, \\citealt{Omukai01}, \n\\citealt{Mach01}). Even a moderate LW flux can lead to an increase of the minimum mass required for DM \nhalos to host star formation (see Appendix A). \n\nThe increased gas temperature in photo-ionized regions leads to an increase of the \ncosmological Jeans mass. As a result, gas accretion onto low-mass dark matter halos\nis suppressed in ionized regions, while the internal gas in existing low-mass halos will be\nphoto-evaporated (e.g. \\citealt{BL99}, \\citealt{Shap04}, \\citealt{SM13}).\n\nThe cumulative flux (in units of erg cm$^{-2}$ s$^{-1}$ Hz$^{-1}$ sr$^{-1}$) at the \nobserved frequency $\\nu_{\\rm obs}$ and redshift $z_{\\rm obs}$ is computed as (e.g. \n\\citealt{HM96}):\n\n\n", "index": 3, "text": "\\begin{equation}\nJ(\\nu_{\\rm obs},z_{\\rm obs}) = \\frac{(1+z_{\\rm obs})^3}{4\\pi} \n\\int_{z_{\\rm obs}}^{z_{\\rm max}} dz \\, c \\, \\Big| \\frac{dt}{dz}\\Big|\n\\, \\epsilon(\\nu_{z},z) \\,  e^{-\\tau_{\\rm H_2}(\\nu_{\\rm obs},z_{\\rm obs},z)} \n\\label{eq:Jlw}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"J(\\nu_{\\rm obs},z_{\\rm obs})=\\frac{(1+z_{\\rm obs})^{3}}{4\\pi}\\int_{z_{\\rm obs}%&#10;}^{z_{\\rm max}}dz\\,c\\,\\Big{|}\\frac{dt}{dz}\\Big{|}\\,\\epsilon(\\nu_{z},z)\\,e^{-%&#10;\\tau_{\\rm H_{2}}(\\nu_{\\rm obs},z_{\\rm obs},z)}\" display=\"block\"><mrow><mrow><mi>J</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ν</mi><mi>obs</mi></msub><mo>,</mo><msub><mi>z</mi><mi>obs</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi>z</mi><mi>obs</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mi>obs</mi></msub><msub><mi>z</mi><mi>max</mi></msub></msubsup><mrow><mrow><mo>𝑑</mo><mpadded width=\"+1.7pt\"><mi>z</mi></mpadded></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>c</mi></mpadded><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">|</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>z</mi></mrow></mfrac><mo maxsize=\"160%\" minsize=\"160%\" rspace=\"4.2pt\">|</mo></mrow><mo>⁢</mo><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ν</mi><mi>z</mi></msub><mo>,</mo><mi>z</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>τ</mi><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ν</mi><mi>obs</mi></msub><mo>,</mo><msub><mi>z</mi><mi>obs</mi></msub><mo>,</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $r_{\\rm cMpc}$ is the distance between the emitting source, at redshift $z$,\nand the observer at redshift $z_{\\rm obs}$, expressed in units of comoving Mpc:\n\n", "itemtype": "equation", "pos": 18881, "prevtext": " \nwhere $\\tau_{\\rm H_2}$ is the {H$_2$ } optical depth in the LW band and $\\epsilon(\\nu_{z},z)$ \nis the comoving emissivity, namely the monochromatic luminosity per unit comoving\nvolume (erg s$^{-1}$ Hz$^{-1}$ cm$^{-3}$), in the LW band at redshift $z$. \nThe redshift $z_{\\rm max}$ represents the highest redshift from which a LW photon emitted\nby a source at $z>z_{\\rm obs}$ can reach the observer at $z_{\\rm obs}$ before being redshifted\nat lower frequencies, outside the LW range, into a H Lyman resonance line. \nIn the dark screen approximation, this \nredshift can be defined as $(1+z_{\\rm max})/(1+z_{\\rm obs}) = \\nu_{i}/\\nu_{\\rm obs}$ (see e.g. \n\\citealt{HRL97}, \\citealt{HAR00}) being $\\nu_{i}$ the first Lyman line frequency \nabove the observed one.\n\nIn general, $\\tau_{\\rm H_2}$ depends on {H$_2$ } number density, on the line profile and \non the probability that the molecule is dissociated after a transition. It can reach values \n$\\tau_{\\rm H_2}\\geq 3$ (\\citealt{CFA00}, \\citealt{RGS01})\nleading to a reduction in the LW background flux of about one order of magnitude.\nFollowing \\citet{Ahn09} we compute the intergalactic absorption averaged over the LW band\nusing the modulation factor described by the fitting formula: \n\n", "index": 5, "text": "\\begin{equation}\n e^{-\\tau_{\\rm H_2}} = \\left\\{\n \\begin{array}{lr}\n    1.7 \\, e^{-(r_{\\rm cMpc}/116.29\\alpha)^{0.68}}-0.7 \\,\\,\\,\\,\\,  {\\rm if} \\, \\,\\, r_{\\rm cMpc}/\\alpha \\le 97.39\\\\\n    0  \\,\\,\\,\\,\\,  {\\rm if}\\,  \\,\\, r_{\\rm cMpc}/\\alpha > 97.39\n \\end{array}\n \\right.\n\\label{eq:absorp}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"e^{-\\tau_{\\rm H_{2}}}=\\left\\{\\begin{array}[]{lr}1.7\\,e^{-(r_{\\rm cMpc}/116.29%&#10;\\alpha)^{0.68}}-0.7\\,\\,\\,\\,\\,{\\rm if}\\,\\,\\,r_{\\rm cMpc}/\\alpha\\leq 97.39\\\\&#10;0\\,\\,\\,\\,\\,{\\rm if}\\,\\,\\,r_{\\rm cMpc}/\\alpha&gt;97.39\\end{array}\\right.\" display=\"block\"><mrow><msup><mi>e</mi><mrow><mo>-</mo><msub><mi>τ</mi><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub></msub></mrow></msup><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mpadded width=\"+1.7pt\"><mn>1.7</mn></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>r</mi><mi>cMpc</mi></msub><mo>/</mo><mn>116.29</mn></mrow><mo>⁢</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>0.68</mn></msup></mrow></msup></mrow><mo>-</mo><mrow><mrow><mpadded width=\"+8.5pt\"><mn>0.7</mn></mpadded><mo>⁢</mo><mpadded width=\"+5.1pt\"><mi>if</mi></mpadded><mo>⁢</mo><msub><mi>r</mi><mi>cMpc</mi></msub></mrow><mo>/</mo><mi>α</mi></mrow></mrow><mo>≤</mo><mn>97.39</mn></mrow></mtd><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mpadded width=\"+8.5pt\"><mn>0</mn></mpadded><mo>⁢</mo><mpadded width=\"+5.1pt\"><mi>if</mi></mpadded><mo>⁢</mo><msub><mi>r</mi><mi>cMpc</mi></msub></mrow><mo>/</mo><mi>α</mi></mrow><mo>&gt;</mo><mn>97.39</mn></mrow></mtd><mtd/></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwith \n$H(z) = H_{0}[\\Omega_{\\rm M}(1+z)^3 + \\Omega_\\Lambda]^{1/2}$. The scaling factor $\\alpha$ in \neq.~(\\ref{eq:absorp}) is defined as:\n\n", "itemtype": "equation", "pos": 19356, "prevtext": "\n\\noindent\nwhere $r_{\\rm cMpc}$ is the distance between the emitting source, at redshift $z$,\nand the observer at redshift $z_{\\rm obs}$, expressed in units of comoving Mpc:\n\n", "index": 7, "text": "\\begin{equation}\n r_{\\rm cMpc} = -\\int^{z}_{z_{\\rm obs}} \\frac{c dz}{H(z)} \n \\label{eq:separation}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"r_{\\rm cMpc}=-\\int^{z}_{z_{\\rm obs}}\\frac{cdz}{H(z)}\" display=\"block\"><mrow><msub><mi>r</mi><mi>cMpc</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mi>obs</mi></msub><mi>z</mi></msubsup><mfrac><mrow><mi>c</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>z</mi></mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\nThe resulting average attenuation of the UV flux increases with increasing comoving ratio \n$r_{\\rm c Mpc}/\\alpha$, approaching zero when $r_{\\rm cMpc}=97.39\\alpha$ which is the maximum \ndistance from which the observer can see LW photons emitted by a source at redshift $z$, \nthe so-called LW horizon (see Fig.~3 of \\citealt{Ahn09}).\n\nIn what follows, we call $J_{\\rm LW}$ the LW background flux in units \nof $10^{-21}$ erg cm$^{-2}$ s$^{-1}$ Hz$^{-1}$ sr$^{-1}$  and we compute it at the central\nfrequency of the LW band using eqs.~(\\ref{eq:Jlw}) --  (\\ref{alpha}).\n\nFollowing \\citet{SS14}, the time evolution of the filling factor of ionized regions is computed as:\n\n", "itemtype": "equation", "pos": 19617, "prevtext": "\n\\noindent\nwith \n$H(z) = H_{0}[\\Omega_{\\rm M}(1+z)^3 + \\Omega_\\Lambda]^{1/2}$. The scaling factor $\\alpha$ in \neq.~(\\ref{eq:absorp}) is defined as:\n\n", "index": 9, "text": "\\begin{equation}\n \\alpha = \\left ( \\frac{h}{0.7} \\right)^{-1} \\, \\left( \\frac{\\Omega_{\\rm M}}{0.27} \\right )^{-1/2} \n          \\, \\left ( \\frac{1+z}{21} \\right )^{-1/2}.\n \\label{alpha}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\alpha=\\left(\\frac{h}{0.7}\\right)^{-1}\\,\\left(\\frac{\\Omega_{\\rm M}}{0.27}%&#10;\\right)^{-1/2}\\,\\left(\\frac{1+z}{21}\\right)^{-1/2}.\" display=\"block\"><mrow><mrow><mi>α</mi><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><mi>h</mi><mn>0.7</mn></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">M</mi></msub><mn>0.27</mn></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mpadded><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mn>21</mn></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $f_{\\rm esc} =  0.1$ is the escape fraction of ionizing photons,\n$\\dot{n}_{\\gamma}=\\sum_{i} \\dot{N}_{\\gamma,i}/V_{com}$ is the\ntotal production rate of ionizing photons per unit volume \nsummed over all the emitting sources, \n$n_{\\rm H} = X_{\\rm H} \\, n_{\\rm IGM}$ is the comoving hydrogen number density in the integalactic medium (IGM), $n_{\\rm IGM}$ is the IGM gas number density and $X_{\\rm H}=0.76$ is the \nhydrogen mass fraction. \nIn the right-hand side of eq.~(\\ref{eq:QHII}), $\\alpha_{B}=2.6 \\times 10^{-13}$ cm$^3$ s$^{-1}$ is \nthe hydrogen recombination rate and $C = 3$ is the clumping factor. \n\nAt each given redshift, the total LW emissivity and ionizing photon rate are computed \nsumming over all the emitting sources, both stars and \naccreting BHs.\n\nFor Pop~III stars, we use the mass-dependent emissivities\ngiven by \\citet{Schaerer02} for $Z=0$ stars with no mass loss (see Table 4 and Table 6 of the original paper). \nFor Pop II/I stars we compute the metallicity and age-dependent  emissivities using \\citet{BC03} \npopulation synthesis model. We assume that the stars form in a single burst with a Salpeter\nInitial Mass Function (IMF) in the mass range $[0.1-100]$ {M$_\\odot$}.\n\nFor accreting BHs, we compute the LW and ionizing photons production rates by modeling the Spectral Energy \nDistribution (SED) as a classic multicolor disk spectrum up to $k T_{\\rm max} \\sim 1 \\, {\\rm keV} \\, (M_{\\rm BH}/ \\rm M_\\odot)^{-1/4}$\n\\citep{SS1973}, and a non-thermal power-law component with spectral slope $L_\\nu \\propto \\nu^{-\\alpha}$, with $\\alpha \\approx 2$\nat higher energies \\citep{SS1973,SOS04}.\n\n\n\n\\subsection{Star formation rate} \n\\label{sec:SF}\n\nIn each progenitor galaxy, the star formation rate is computed as:\n\n", "itemtype": "equation", "pos": 20485, "prevtext": "\nThe resulting average attenuation of the UV flux increases with increasing comoving ratio \n$r_{\\rm c Mpc}/\\alpha$, approaching zero when $r_{\\rm cMpc}=97.39\\alpha$ which is the maximum \ndistance from which the observer can see LW photons emitted by a source at redshift $z$, \nthe so-called LW horizon (see Fig.~3 of \\citealt{Ahn09}).\n\nIn what follows, we call $J_{\\rm LW}$ the LW background flux in units \nof $10^{-21}$ erg cm$^{-2}$ s$^{-1}$ Hz$^{-1}$ sr$^{-1}$  and we compute it at the central\nfrequency of the LW band using eqs.~(\\ref{eq:Jlw}) --  (\\ref{alpha}).\n\nFollowing \\citet{SS14}, the time evolution of the filling factor of ionized regions is computed as:\n\n", "index": 11, "text": "\\begin{equation}\n\\dot{Q}_{\\rm HII}(z)= f_{\\rm esc} \\dot{n}_{\\gamma}/n_{\\rm H} - \\alpha_{B} \\, C \\, n_{\\rm H} \\, (1+z)^3 Q_{\\rm HII}\n \\label{eq:QHII}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\dot{Q}_{\\rm HII}(z)=f_{\\rm esc}\\dot{n}_{\\gamma}/n_{\\rm H}-\\alpha_{B}\\,C\\,n_{%&#10;\\rm H}\\,(1+z)^{3}Q_{\\rm HII}\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>Q</mi><mo>˙</mo></mover><mi>HII</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>f</mi><mi>esc</mi></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>n</mi><mo>˙</mo></mover><mi>γ</mi></msub></mrow><mo>/</mo><msub><mi>n</mi><mi mathvariant=\"normal\">H</mi></msub></mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>α</mi><mi>B</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>C</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>n</mi><mi mathvariant=\"normal\">H</mi></msub></mpadded><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup><mo>⁢</mo><msub><mi>Q</mi><mi>HII</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $M_{\\rm ISM}$ is the gas mass, $\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst}$ is the\ntotal star formation efficiency accounting for both quiescent and merger-driven episodes of star formation. \nFollowing \\citet{V11}, we take $\\epsilon_{\\rm quies}=0.1$ and $\\epsilon_{\\rm burst} = 8$ for equal mass\nmergers, with a modulation that depends on the mass ratio of the merging pairs\n(see eq.~11 and Table~2 in \\citealt{V11}). Finally, the quantity $f_{\\rm cool}$ quantifies the \nreduced cooling efficiency of mini-halos with respect to Ly$\\alpha$ halos. Hence, we assume $f_{\\rm cool} = 1$\nin progenitor systems with $T_{\\rm vir} \\ge 10^4$~K whereas in mini-halos this parameter quantifies the\nmass fraction of gas that can cool in one dynamical time and it depends on the virial temperature,\nredshift, gas metallicity and intensity of the LW background. The computation of $f_{\\rm cool}$ \nis described in Appendix A.\\\\\n\n\n\\noindent \n\\textit{Photo-heating feedback.}\\\\\nTo account for the effects of the increased gas temperature in photo-ionized regions,\nwe assume that star formation is suppressed, i.e. \n$(\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst})=0$, in halos with virial temperature below the \ntemperature of the IGM. Hence, we neglect the hydrodynamic\nresponse of the gas (see Sobacchi \\& Mesinger 2013) and we assume a\nfeedback model where star formation is suppressed instantaneously when $T_{\\rm vir}<T_{\\rm IGM}$.\nThe mean IGM temperature is computed taking into account the volume filling factor of\nionized regions, \n$T_{\\rm IGM} = Q_{\\rm HII} \\, T_{\\rm reio} + (1-Q_{\\rm HII}) \\, T_{\\rm gas}$ where $T_{\\rm reio} = 2 \\times 10^4$ K is \nthe assumed post-reionization temperature and $T_{\\rm gas} = 170 \\, (1+z)^2$. \\\\\n\n\\noindent \n\\textit{Photo-dissociating feedback}.\\\\\nSuppression of $\\rm H_2$ cooling and star formation in mini-halos due to\nphoto-dissociation by LW photons is taken into account through the \nparameter $f_{\\rm cool}$ in eq.~(\\ref{eq:sfr}), whose calculation\nis presented  in Appendix A. Depending on the halo virial temperature,\nredshift, gas metallicity and intensity of the LW background, we compare \nthe cooling time and the free-fall time and quantify the mass fraction of\ngas that is able to cool and form stars. We find that in the presence\nof a LW background, the cooling efficiency is rapidly suppressed in\nmini-halos. In fact, when $J_{\\rm LW} \\lesssim 1$, \n$f_{\\rm cool} \\neq 0$ only in mini-halos at $z \\gtrsim 20$ or if the gas is already\nmetal-enriched to $Z \\gtrsim 0.1$ Z$_\\odot$.  For more details, we refer the\nreader to Appendix A and Figs.~\\ref{fig:A1}-\\ref{fig:A4}.\n\n\n\\subsection{Stellar initial mass function} \n\\label{sec:popIII}\nCurrently, there are no direct observational constraints on the initial mass function of the \nfirst generation of stars. Theoretical studies do not yet provide a firm determination of\nthe stellar mass spectrum emerging from the first star forming regions (see e.g. \n\\citealt{Bromm13} and \\citealt{Glover13} for comprehensive reviews).\nRecent numerical studies suggest that - depending on their formation environment -\nPop III stars can have masses varying from 10s to 1000s {M$_\\odot$}, with a distribution \nthat peaks around few tens to few hundreds solar masses \n(e.g. \\citealt{Hosokawa11,Hirano14,Susa14,Hirano15}).\n\nFollowing \\citet{deBen14}, we assume that Pop III stars form according to a Larson IMF \\citep{Larson1998},\n\n", "itemtype": "equation", "pos": 22394, "prevtext": "\n\\noindent\nwhere $f_{\\rm esc} =  0.1$ is the escape fraction of ionizing photons,\n$\\dot{n}_{\\gamma}=\\sum_{i} \\dot{N}_{\\gamma,i}/V_{com}$ is the\ntotal production rate of ionizing photons per unit volume \nsummed over all the emitting sources, \n$n_{\\rm H} = X_{\\rm H} \\, n_{\\rm IGM}$ is the comoving hydrogen number density in the integalactic medium (IGM), $n_{\\rm IGM}$ is the IGM gas number density and $X_{\\rm H}=0.76$ is the \nhydrogen mass fraction. \nIn the right-hand side of eq.~(\\ref{eq:QHII}), $\\alpha_{B}=2.6 \\times 10^{-13}$ cm$^3$ s$^{-1}$ is \nthe hydrogen recombination rate and $C = 3$ is the clumping factor. \n\nAt each given redshift, the total LW emissivity and ionizing photon rate are computed \nsumming over all the emitting sources, both stars and \naccreting BHs.\n\nFor Pop~III stars, we use the mass-dependent emissivities\ngiven by \\citet{Schaerer02} for $Z=0$ stars with no mass loss (see Table 4 and Table 6 of the original paper). \nFor Pop II/I stars we compute the metallicity and age-dependent  emissivities using \\citet{BC03} \npopulation synthesis model. We assume that the stars form in a single burst with a Salpeter\nInitial Mass Function (IMF) in the mass range $[0.1-100]$ {M$_\\odot$}.\n\nFor accreting BHs, we compute the LW and ionizing photons production rates by modeling the Spectral Energy \nDistribution (SED) as a classic multicolor disk spectrum up to $k T_{\\rm max} \\sim 1 \\, {\\rm keV} \\, (M_{\\rm BH}/ \\rm M_\\odot)^{-1/4}$\n\\citep{SS1973}, and a non-thermal power-law component with spectral slope $L_\\nu \\propto \\nu^{-\\alpha}$, with $\\alpha \\approx 2$\nat higher energies \\citep{SS1973,SOS04}.\n\n\n\n\\subsection{Star formation rate} \n\\label{sec:SF}\n\nIn each progenitor galaxy, the star formation rate is computed as:\n\n", "index": 13, "text": "\\begin{equation}\\label{eq:sfr}\n{\\rm SFR } = f_{\\rm cool} \\, M_{\\rm ISM} \\, (\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst})/\\tau_{\\rm dyn} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm SFR}=f_{\\rm cool}\\,M_{\\rm ISM}\\,(\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst%&#10;})/\\tau_{\\rm dyn}\" display=\"block\"><mrow><mi>SFR</mi><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>f</mi><mi>cool</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>M</mi><mi>ISM</mi></msub></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ϵ</mi><mi>quies</mi></msub><mo>+</mo><msub><mi>ϵ</mi><mi>burst</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><msub><mi>τ</mi><mi>dyn</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwith $\\alpha = - 1.35$, $m_{\\rm ch} = 20$ M$_\\odot$ and $10$ M$_\\odot \\le m_\\ast \\le 300$ M$_\\odot$. \nDuring each star formation episode, we stochastically sample the IMF until we reach the total\nstellar mass formed\\footnote{We have tested that the IMF\nis fully reconstructed in the $[10-300]\\, \\rm M_\\odot$ mass range when the total stellar mass formed is \n$M_{\\rm star}>10^6 \\, \\rm M_\\odot$.}(see also \\citealt{deBennassuti15}). In Fig.~\\ref{fig:randomIMF} we show three examples \nof the mass distribution of Pop~III stars emerging from a star formation episode where the\ntotal stellar mass formed is $M_{\\rm star} \\sim 10^2 \\, \\rm M_\\odot$  (left panel), \n$\\sim 5\\times 10^3 \\, \\rm M_\\odot$ (middle panel) and $\\sim 1.6\\times 10^5 \\, \\rm M_\\odot$ (right panel). \nThe stellar population shown in the left panel is representative of the conditions that apply in small\nmass mini-halos. Only 6 stars are formed with masses in the range $[10  - 30]\\, \\rm M_\\odot$. In larger\nmass halos, as shown in the middle and right panels, the mass range that is populated is extended\ntoward larger stellar masses.\n\nWhen the metallicity in star forming regions is $Z_{\\rm ISM} \\ge Z_{\\rm crit}$, where\n$Z_{\\rm crit}$ is the critical metallicity for low-mass star formation\n (\\citeauthor{Schneider02} \\citeyear{Bromm01, Schneider02, Schneider03}), we assume that \nPop~II stars form in the stellar mass range $[0.1-100] \\, \\rm M_\\odot$ according to a Larson \nIMF with $m_{\\rm ch} = 0.35 \\, \\rm M_\\odot$. In what follows, we adopt $Z_{\\rm crit} = 10^{-3.8}$ Z$_\\odot$\nand we discuss the impact of assuming a dust-driven transition at lower $Z_{\\rm crit}$ \\citep{Omukai05,Schneider12a}.\n \n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{pop3IMFrandom.pdf}\n\\caption{Examples of the mass distribution of Pop~III stars emerging from stochastic\nsampling of the IMF in three different halos (see text). The total stellar mass formed is \n$10^2 \\, \\rm M_\\odot$ (left panel),\n$\\sim 5 \\times 10^3 \\, \\rm M_\\odot$ (middle panel) and $\\sim 1.6\\times 10^5 \\, \\rm M_\\odot$ \n(right panel).\nGrey shaded regions indicate the mass range leading to BH remnants.} \n\\label{fig:randomIMF} \n\\end{figure} \n\n \n\n\n\\subsection{Light black hole seed formation} \n\\label{sec:lightSeeds}\n\nLight BH seeds form as remnants of Pop~III stars. Here we assume that stars with \nmasses in the range $[40 - 140]\\, \\rm M_\\odot$ and $\\ge 260\\, \\rm M_\\odot$ do not \nexplode as SNe and directly collapse to BHs \\citep{Heger02}. The number \nand masses of BH remnants depend on the frequency with which these \nmass ranges are sampled when Pop~III stars form and stochastically populate\nthe IMF (see the previous section).\nIn the two halos shown in the middle and right\npanels of Fig.~\\ref{fig:randomIMF}, the stochastic sampling selects 124 and 3900 stars.\nThe shaded regions in the same figure indicate the mass range leading to BH remnants.\nIn small mini-halos, light BH seeds are very rare (see left panel).\n\nThe subsequent evolution of newly formed BHs depends on their mass. \nAs discussed by \\citet{Volonteri10}, lighter BHs are not expected to settle at the \ncenter but rather wander through the host galaxy, interacting with stars. For this\nreason,  we select as a light BH seed the most \nmassive BH remnant\\footnote{ In the three examples shown in Fig.~\\ref{fig:randomIMF}, \nwe do not assign any light BH seed to the population represented by the left panel\nand only one light BH seed in the other cases, taken to be the most massive BH remnant\namong the 2 (15) BHs of $\\sim [260 - 300] \\, \\rm M_\\odot$ formed\nin the middle (right) panel.}.\nWe discuss the implications of this assumption in section \\ref{sec:discussion}. \n\n\\subsection{Heavy black hole seed formation}\n\\label{sec:heavySeeds}\n\nFragmentation of gas clouds, and thus star formation, is prevented in Ly$\\alpha$ halos\n($T_{\\rm vir}\\geq 10^4$ K) in which the ISM metallicity is sub-critial ($Z_{\\rm ISM}<Z_{\\rm cr}$) \nand the LW background is strong enough to photo-dissociate $\\rm H_2$ \\citep{Omukai08}. \nThe latter condition is usually expressed as $J_{\\rm LW}>J_{\\rm cr}$,\nwhere $J_{\\rm cr}$ is the critical value in units of $10^{-21}$ erg cm$^{-2}$ s$^{-1}$Hz$^{-1}$ sr$^{-1}$.\nIf all the above conditions are simultaneously satisfied, the collapse proceeds almost \nisothermally thanks to atomic H line cooling, avoiding fragmentation into smaller clumps. \nThis process leads to the formation of a single BH with mass in the range \n$[10^{4}-10^{6}] \\, \\rm M_\\odot$,\nthat we call heavy BH seed, in some cases through an intermediate  phase of super-massive star formation \n(see e.g. \\citealt{Hosokawa12,Hosokawa13} for more details). \nRecently, \\citet{Ferrara14} investigated the mass spectrum of heavy BH seeds and found that their masses \nrange between  $\\sim 5\\times 10^4\\, \\rm M_\\odot$ \\, to $\\sim 2\\times 10^6 \\, \\rm M_\\odot$ \n(see also \\citealt{VB10}). \n\nFollowing these studies, we assume that heavy BH seeds form with an average mass of \n$10^5 \\, \\rm M_\\odot$ in Ly$\\alpha$ halos with sub-critical metallicity \nand super-critical LW background. \n\nThe exact value of $J_{\\rm cr}$ is still a matter of debate. \nIts value depends on whether sufficient $\\rm H_2$ to cool the gas within\na free-fall time is formed before it\nis collisionally dissociated at $\\sim 10^4 \\rm \\,cm^{-3}$, and depends on the spectral energy distribution of the sources of radiation \n\\citep{Omukai01,OhHaiman02, BL03, Omukai08, Agarwal12, Latif14b, Sugimura14, Sugimura15, Agarwal15}.\nIn addition, Ly$\\alpha$ halos can be exposed to intense local radiation, which exceeds the background \nlevel, in biased, dense regions of the Universe, and close to star forming galaxies \\citep{Dijkstra08,TH09,Dijkstra14}. \nAdditional complications come when {H$_2$ } self-shielding is taken into account  \\citep{Shang10, Hartwig15} and \nwhen the presence of X-ray or ionizing radiation increase the free electron fraction, favoring the formation\nof $\\rm H_2$ \\citep{IO11,Yue14,Johnson14,IT15}.  As a result, values of $J_{\\rm cr}$ between $\\sim 30$ and $\\sim 10^4$\nhave been proposed and used to estimate the number density of heavy seeds.\nIn particular, $J_{\\rm cr} > 500-10^3$ and up to $10^{4} - 10^{5}$ is always required to enable the direct \ncollapse mechanism in 3D numerical simulations to produce supermassive stars with mass \n$10^4-10^5 \\, \\rm M_\\odot$ \\citep{Latif14a, Regan14, LatifVolonteri15}.\nHere we adopt a reference value of $J_{\\rm cr}=300$ and we discuss the implications of this \nassumption in section \\ref{sec:discussion}. \n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{aveBHevo_fiducial.pdf}\n\\caption{Black hole mass as a function of redshift. \n  The black solid line represents the total\n  mass in BHs growing by gas accretion and mergers with other BHs \n  while the blue dashed and the red dot-dashed lines show the contribution\n  of the light and heavy seed BHs, respectively (without gas accretion).\n  Each line is the average over 10 different merger tree realizations with\n  the shades indicating $1\\sigma$ dispersion.} \n\\label{fig:bhevo} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1cm}\n\\includegraphics [width=6cm]{aveLSzdistri_fiducial.pdf}\n\\includegraphics [width=6cm]{aveHSzdistri_fiducial.pdf}\n\\includegraphics [width=6cm]{aveLSmdistri_fiducial.pdf}\n\\caption{Distribution of formation redshift of light (left panel) and heavy seeds (central panel). The\nright panel shows  the distribution of birth masses for light seeds only as heavy seeds are all assumed\nto have a mass of $10^5 \\, \\rm M_\\odot$. Histograms and data points show the average over 10 different \nmerger tree realizations with $1-\\sigma$ error bars.} \n\\label{fig:histogLS} \n\\end{figure*} \n\n\n\n\\section{Results} \n\\label{sec:results}\n\nIn this section we present the main results of our study. In the same\nspirit of \\citet{V11,V14}, we follow the formation\nof a SMBH with a mass of  $\\sim (2-6)\\times 10^9$ {M$_\\odot$} \\, at redshift $z=6.4$, \nsimilar to the one expected to power the bright quasar J1148 \\citep{Barth03, Willott03, deRosa11}. \n In what follows, we present the results\naveraged over 10 independent realizations of the merger tree of a \n$10^{13}$ {M$_\\odot$} \\, DM halo. However, in order to explore the dependence\nof some results on the merger history, we also discuss the properties of individual merger trees.\n\n\n\n\n\n\n\\subsection{Evolution of the black hole mass}\n\\label{sec:BHseeds}\n\nIn Fig.~\\ref{fig:bhevo} we show the predicted evolution of the total BH mass in a \nmerger tree as a function of redshift.\nFor each merger tree, we consider the contribution of BH progenitors to the total BH mass at each redshift.\nWe classify as BH progenitors only those BHs which do not become satellites at any stage of the \nmerger tree and whose mass will be inherited by the final SMBH at $z = 6.4$\\footnote{For each\nmerger tree, we follow backward in time the evolution of the SMBH. At each minor merger event, we cut the branch of the tree\nof the lighter, satellite progenitor BH and we only follow the branch of the most massive one. At each major merger event, we continue to\nfollow both branches of the progenitor BHs. This procedure allows us to reconstruct a-posteriori the sample of  BH progenitors whose masses \ndirectly contribute to the final SMBH mass at $z = 6.4$.}.\nThe free parameters of the model have been selected to reproduce a SMBH mass of \n$\\sim 3\\times 10^9 \\, \\rm M_\\odot$ at $z = 6.4$, in good agreement with that expected for quasar J1148 (red \ndata point in Fig.~\\ref{fig:bhevo}). \nIn the same figure we also show the separate contribution of light (blue dashed line) and \nheavy (red dot-dashed line) BH seeds to the total BH mass at different epochs. \n\\newline\n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLWBevo_fiducial.pdf}\n\\includegraphics [width=6.0cm]{aveQHII_fiducial.pdf}\n\\includegraphics [width=6.0cm]{aveIGMmet_fiducial.pdf}\n\\caption{\n\\textit{Left panel:} redshift evolution of the total Lyman Werner background flux\n(black solid line). Green dot-dashed and yellow dashed lines indicate the contribution of \naccreting BHs (AGNs) and stars, respectively. \nThe three horizontal lines indicate three different \ncritical values $J_{\\rm cr}=30, 300, $ and $10^3$ (see text for details). For comparison,\nwe also show the cosmic mean LW background predicted by Dijkstra et al. (2014, dotted\nline).\n\\textit{Middle panel:} Volume filling factor of ionized hydrogen regions (HII) as a \nfunction of redshift. \n\\textit{Right panel:} redshift evolution of the metallicity of the IGM in which halos are \nembedded. The horizontal line shows the critical metallicity \nfor Pop III/II transition adopted in the reference model. \nIn all panels, lines indicate the average values over 10 different merger tree \nrealizations with shades representing the $1-\\sigma$ dispersion. \n}\n\\label{fig:feedback} \n\\end{figure*} \n\n\n\\noindent \\textit{Light seeds-dominated regime}.\nAt high redshift ($z \\gtrsim 18$), BH growth is dominated by \nthe formation of light seeds. Their rate of formation\nis strongly regulated by photo-dissociating feedback which inhibits\nPop~III star formation in mini-halos.\nThe total mass from BH light seeds rapidly grows in time, \nreaching, on average, a maximum value of $\\sim 10^5 \\, \\rm M_\\odot$\nat $z \\sim 15.5$, below which their formation is suppressed by\nmetal enrichment. \n\\newline\n\n\\noindent \\textit{Heavy seeds-dominated regime}.\nHeavy seeds start to form at redshift $z \\lesssim 18$ and dominate\nthe evolution of the BH mass for a brief but significant period of time.\nIn fact, they rapidly grow in number and by $z \\sim 15.5$\ntheir contribution to the total BH mass is, on average, $\\sim 1.3\\times 10^6$ {M$_\\odot$},\nmore than one order of magnitude larger than that of light BH seeds. Not\nsurprisingly, the rise of heavy seeds marks the fall of\nlight seeds. In fact, Ly$\\alpha$ halos with $Z < Z_{\\rm cr}$ either form Pop~III stars,\nhence light BH seeds (when $J_{\\rm LW} < J_{\\rm cr}$), or form heavy seeds \n(when $J_{\\rm LW} \\ge J_{\\rm cr}$). \n\\newline\n\n\n\\noindent \\textit{Accretion-dominated regime}.\nAt $z \\lesssim 16$, BH growth is dominated by gas accretion. In fact, at this epoch\nthe progenitor galaxies are all enriched to $Z \\ge Z_{\\rm cr}$ preventing the formation\nof both light and heavy seeds. Overall, gas accretion provides the dominant contribution\nto the final SMBH mass at $z = 6.4$, in agreement with \\citet{V11}\\footnote{\nIn \\citet{V11} gas accretion dominates the evolution of the BH mass at  $z \\lesssim 11$.\nIn the present model gas accretion starts to dominate at an earlier \nredshift. The difference with \\citet{V11} is due to the different merger histories (which now include \nmini-halos) and BH seeding prescription.}. This is a consequence of the strong BH mass dependence\nof the BHL accretion law, which leads to run-away BH growth.\n\\newline\n\n\nIn our reference model, a total of $\\sim 4800$ light and \n$\\sim 100$ heavy seeds are formed, on average, at $z \\gtrsim 16$. \nHowever, only $\\sim 13\\%$ of these seeds ($\\sim 620$ light and $\\sim 13$ heavy) \nare BH progenitors, because a dominant fraction is lost along minor branches of the merger tree \nand become satellites. \n\nIn Fig.~\\ref{fig:histogLS}  we show the BH progenitor\nformation redshifts and birth masses.  \nLight BH seeds start forming at $z \\sim 24$ although their number increases considerably \nat $z \\lesssim 20$, with a peak at $z \\sim 17$ followed by a rapid decline. This redshift\ndistribution reflects the properties of their birth environments. At\nthe highest $z$, light BH seeds form in mini-halos, whose star formation efficiency is \nlow and prone to photo-dissociating feedback. \nTheir birth mass distribution shows that the largest \nnumber of light BH seeds is concentrated in the most massive bin, with $\\sim 240$ BHs ($\\sim 40\\%$\nof the total) with mass in the range $[260 - 300]\\, \\rm M_\\odot$, while the remaining are almost \nequally distributed between $40$ and $140 \\, \\rm M_\\odot$ (see the right panel).\nOn the other hand, heavy seed BH progenitors form, on average, over a very narrow\nredshift range, at $15.5 \\lesssim z \\lesssim 18$, with a peak at $z \\sim 16.5$ that is \nslightly shifted with respect to that of light seeds, followed by a sharp decline.  This\nsudden appearance and decline of heavy seeds is a consequence of their tight\nbirth environmental conditions which are satisfied only by a relatively small number\nof halos and over a very limited period of time, as it will be clarified in the following\nsection. \n\n\n\n\n\\subsection{Birth environment of SMBH seeds}\n\\label{sec:environment}\n\nThe results presented in the previous section show how the mass growth of \nSMBHs at $z > 6$ depends on a complex interplay between \nradiative and chemical feedback processes that shape the birth environment of light and\nheavy BH seeds.  Since SMBHs at $z > 6$ form in biased regions of the Universe, \nthe intensity of the LW background, the volume \nfilling factor of ionized regions and the gas metallicity, which set the relative strength\nof feedback processes, are expected to be different from the cosmic mean values\nat the same redshift. \n\nThe left panel of Fig.~\\ref{fig:feedback} shows the relative contribution of\naccreting BHs (AGNs, green dot-dashed line) and stellar emission (yellow dashed line)\nto the LW background (black solid line). At all redshifts, the LW\nemission is dominated by star formation. The intensity of the LW background\nincreases very rapidly, exceeding values of $J_{\\rm cr} = 30, 300$, and  \n$10^3$ (marked by the horizontal lines), on average,  at $z \\sim 20, 16.5,$ and $15$,\nwith some dispersion among different merger histories (see section \\ref{sec:singelMTs}).\nIn the same figure we also show, for comparison, the cosmic mean LW background \npredicted by \\citet{Dijkstra14}.\n\nThe central panel of Figure \\ref{fig:feedback} shows the evolution of the volume filling factor\nof ionized regions. We find that  $Q_{\\rm HII} \\sim 1$ at $z \\lesssim 14$, consistent with the\nexpectations from the rapid increase of the UV background intensity.\n\nFinally, in the right panel of Figure \\ref{fig:feedback} we present the redshift evolution \nof the metallicity of the IGM, the medium in which all halos are embedded. \nThis metallicity, $Z_{\\rm IGM}$, increases as mechanical feedback, in the form of \ngalaxy-scale winds driven by the SNe and AGNs, ejects metal-enriched gas \nout of the galaxies, enriching the surrounding medium. \nThe horizontal line indicates the critical metallicity for low-mass star formation\nthat we have adopted in the reference model, $Z_{\\rm cr} = 10^{-3.8}$ Z$_\\odot$. \nThe average IGM metallicity exceeds this critical value at $z \\lesssim 17$, with\nsome dispersion among different merger histories. \n\n\nThe effects of radiative feedback on the environment\nwhere light and heavy BH seeds form is summarized in Fig.~\\ref{fig:massLimit}, which shows the redshift\nevolution of the minimum halo mass for star formation (black solid line). \nAt high redshifts the minimum\nhalo mass rapidly increases as a consequence of photo-dissociating feedback, reaching\nthe minimum mass of Ly$\\alpha$ halos (short-dashed line) already at $z \\sim 20$, on average. Hence, as\nit was anticipated in section~\\ref{sec:BHseeds}, the dominant fraction of light BH seeds\nform in Ly$\\alpha$ halos \nwhich are less vulnerable to photo-dissociating feedback. Between\n$16 \\lesssim z \\lesssim 20$ Ly$\\alpha$ halos with masses $M_{\\rm h} \\sim (3 - 5)\\times 10^7 \\, \\rm M_\\odot$ and\nsub-critical metallicity can either form\nlight or heavy BH seeds depending on the intensity of $J_{\\rm LW}$. When $z \\lesssim 16$\nthe minimum mass for star formation increases as a consequence of photo-heating\nfeedback and achieve the adopted minimum mass for star formation in ionized regions, \n$M_{\\rm h} \\gtrsim 2 \\times 10^8 \\, \\rm M_\\odot$ (dot-dashed line), by $z \\sim 13$, when the IGM\nis fully ionized. The figure also shows that the minimum mass for star formation depends on the\nadopted resolution mass only at $z \\lesssim 11$, when the epoch of BH seed formation is already\nterminated. Hence, the results are independent of the mass resolution of the merger trees. \n  \nFinally, to quantify the effect of chemical feedback on heavy BH seeds formation, we\ncompute their occurence ratio, defined as the number of progenitor halos which satisfy\nthe conditions $J_{\\rm LW} > J_{\\rm cr}$ and $Z < Z_{\\rm cr}$ divided by the\nnumber of progenitor halos with $J_{\\rm LW} > J_{\\rm cr}$. When averaged \nover 10 independent merger histories, we find the occurrence \nratio at $z > 15$ to be $\\sim 5\\%$, meaning that chemical \nfeedback plays a dominant role.\n \n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{aveMmin_fiducial.pdf}\n\\caption{Average minimum halo mass for star forming as a function of redshift \n(black solid line). \nThe line indicates the average over 10 different merger histories and the\nshaded region shows the $1-\\sigma$ dispersion. \nFor comparison, we also show the resolution mass of the merger trees (red long-dashed line), the \nminimum mass of  Ly$\\alpha$ halos (with $T_{\\rm vir} = 10^4$~K, blue short-dashed line) and \nthe adopted minimum mass for star formation in ionized regions (with $T_{\\rm vir} = 2\\times 10^4$~K, green dot-dashed line).}\n\\label{fig:massLimit} \n\\end{figure} \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{BHevo_fiducial.pdf}\n\\caption{Evolution of the BH mass as a function of redshift for 10 different merger trees. Black solid lines show the total BH mass while blue dashed and red dot-dashed\nlines represent the contribution of light and heavy seeds, respectively, without gas \naccretion.} \n\\label{fig:bhevo10r} \n\\end{figure} \n\n\n\n\n\\subsection{Dependence on the hierarchical history}\n\\label{sec:singelMTs}\n\nOne of the advantages of a semi-analytical model is that it allows one\nto run independent merger tree simulations of the same quasar.\n\nIn Fig.~\\ref{fig:bhevo10r} we show the evolution of the BH mass and\nthe contribution of light and heavy seeds as a function of redshift for\n10 different merger trees. In 9 out of 10 runs, the final BH mass is in \nvery good agreement with the data. \nThe only exception is the simulation shown in panel (e),\nwhere only light BH seeds form. This supports the conclusion that,\n as long as gas accretion is assumed to be Eddington-limited,\nheavy BH seeds are required to grow a SMBH at $z > 6$.\n\n\nThe relative contribution of light and heavy BH seeds depends on the individual\nmerger tree. \nEven when light BH seeds start to form at\n$z \\gtrsim 20$ (see\npanels a, b, f, g and h), their total mass does not exceed $\\sim 10^5\\, \\rm M_\\odot$ and it is comparable to\nthe mass of one single heavy BH seed.  Only\nbetween $\\sim 3$ to $\\sim 30$ heavy BH seeds are required to grow a SMBH by $z \\sim 6.4$, \nand their total mass ranges between $\\sim 3 \\times 10^5 \\, \\rm M_\\odot$ and \n$\\sim 3 \\times 10^6 \\, \\rm M_\\odot$.\n\nIt is interesting to investigate in more details why no heavy BH seed is formed\nin the simulation shown in panel (e). We compare the properties of this simulation\nwith the one shown in panel (b), which is characterized by a similar high-$z$ evolution\nof the light BH seeds mass. In Fig.~\\ref{fig:agemet} we show the metallicity of \nall progenitor halos in the two simulations (gray points) as a function of redshift.\nThe solid line is the mean metallicity of the IGM and open blue circles \n(red squares) represent progenitor halos hosting light (heavy) BH seeds.\nLight BH seeds form in halos with $Z < Z_{\\rm cr}$, where the value corresponding\nto $Z_{\\rm cr}$ in the reference model is shown by the horizontal dashed line. \nAs expected, heavy seeds form only  in a small number of halos of simulation (b), \nwhere $Z < Z_{\\rm cr}$ and $J_{\\rm LW} > J_{\\rm cr}$ \n(the redshift at which this condition is satisfied is indicated by the vertical \ndot-dashed line). \n\nThe redshift and metallicity distribution of progenitor halos is different in the two\nsimulations. Newly virialized progenitor halos  have the same metallicity of the IGM, while \nin others the metallicity can be significantly smaller or larger.  \nAt $z \\lesssim 20$, $Z_{\\rm IGM}$ is slightly smaller \nin simulation (e) and there is a smaller fraction of halos with $Z < Z_{\\rm IGM}$,\nmeaning that self-enrichment is more efficient than in simulation (b).\nIn addition, the LW background intensity becomes larger than $J_{\\rm cr}$ at a lower\nredshift in simulation (e),  $z \\sim 15.5$ instead of $z \\sim 16.5$.  \nAs a result, there is no single progenitor halo where  the conditions for heavy BH seed formation\nare satisfied.\n\n\n\n\n\\begin{figure}\n\\vspace{\\baselineskip}\n\\includegraphics[width=\\hsize]{agemet_fiducial.png}\n\\caption{Metallicity as a function of redshift of all the progenitor halos (gray points) in two merger\ntree simulations (b, left panel) and (e, left panel) shown in Fig.~\\ref{fig:bhevo10r}. Open blue circles\nand red squares indicate the progenitors where light and heavy BH seeds form. In each panel,\nthe solid line is the mean IGM metallicity, the horizontal dashed line is the value of $Z_{\\rm cr}$\nand the vertical dot-dashed line is the redshift at which $J_{\\rm LW} > J_{\\rm cr}$.} \n\\label{fig:agemet} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveBHevo_testJLW.pdf}\n\\includegraphics [width=6.0cm]{aveBHevo_testDcr.pdf}\n\\includegraphics [width=6.0cm]{aveIGMdust.pdf}\n\\caption{Same as in Fig.~\\ref{fig:bhevo} but assuming  $J_{\\rm cr} = 10^3$ (left panel) and \na dust-driven transition to Pop~II star formation occurring at ${\\cal D}_{\\rm cr} = 4.4 \\times 10^{-9}$ (middle panel). \nIn the right panel we show the average metallicity (blue solid line) and dust-to-gas ratio (red dashed \nline) of the IGM. Horizontal dashed (dot-dashed) line indicates $Z_{\\rm cr}$ in absolute units and ${\\cal D}_{\\rm cr}$, respectively. \nIn all panels the curves are averages over 10 merger tree realizations with shades representing the $1-\\sigma$ dispersion.} \n\\label{fig:testLWDcr} \n\\end{figure*} \n\n\n\\section{Discussion} \n\\label{sec:discussion}\n\nThe results of the reference model depend on a number of assumptions whose\nimportance is critically discussed below. \n\n\n\\subsection{Dependence on $J_{\\rm cr}$}\n\nThe critical intensity of the LW background that enables the collapse of gas in \nmetal-poor Ly$\\alpha$ halos is still highly debated. Here\nwe discuss the consequences of increasing $J_{\\rm cr}$ to  $10^3$.\n\nAlthough the LW background can reach very large values in the biased region that we are\nsimulating, on average it exceeds $J_{\\rm cr}=10^3$ at $z \\lesssim 14.5$ (see left panel in Fig.~\\ref{fig:feedback}),\nwhen all progenitor halos have been already enriched above the critical metallicity for Pop~II star formation.\nLy$\\alpha$ halos with $Z < Z_{\\rm cr}$ and \n$300 \\lesssim J_{\\rm LW} \\lesssim 10^3$ now host Pop~III star formation and no single heavy BH seed forms.\n\nThe redshift evolution of the total BH mass is shown in the left panel of Fig.~\\ref{fig:testLWDcr}. \nThe  growth of the BH is strongly suppressed and $M_{\\rm BH} \\lesssim 10^6 \\, \\rm M_\\odot$ at  \n$z \\sim 6.4$. In fact, despite the larger number of light seeds at \n$16 \\lesssim z \\lesssim 18$ compared to the reference model ($\\sim 4$ times larger, on average), \ntheir BH masses are too small to activate efficient \ngas accretion, unless a much higher BH accretion efficiency ($\\alpha_{\\rm BH}$) or super-Eddington accretion\nis assumed (\\citealt{VolonteriRees05, Li12, AN14, MHD14}; Pezzulli et al. 2015). \n\n\n\n\n\n\n\\subsection{Dependence on the critical dust-to-gas ratio}\n\nIn the reference model we assume that low mass Pop II stars form\nwhen the metallicity of the star forming gas reaches a critical value of $Z_{\\rm cr} = 10^{-3.8}$\nZ$_\\odot$,\nabove  which metal fine-structure line cooling becomes efficient. \nHowever, semi-analytic and numerical studies suggest that gas cooling and fragmentation\ncan be activated at a lower metallicity when dust grains are present (\\citealt{Schneider02}; \\citealt{Schneider06};\n \\citealt{Omukai10}; \\citealt{Dopcke11}). \n\\citet{Schneider12a} show that low-mass Pop~II stars can form\nwhen the dust-to-gas mass ratio, ${\\cal D}$, exceeds a critical value of\n${\\cal D}_{\\rm cr}=4.4^{-1.9}_{-1.8} \\times 10^{-9}$. \nMoreover, a dust-driven transition is consistent with observations of the\ntail of the metallicity distribution function of Galactic halo stars \\citep{Schneider12b,deBen14}.\n\nIn {\\textsc{GAMETE/QSOdust}} \\, we follow dust enrichment in the ISM of all progenitor halos and we can explore\nthe effects of dust cooling and fragmentation on the formation of Pop~III\nstars, hence of light BH seeds, and on the direct collapse of gas onto a heavy BH seed. \nFollowing \\citet{Omukai08}, we assume that when ${\\cal D} < {\\cal D}_{\\rm cr}$\nand $J_{\\rm LW} > J_{\\rm cr}$, the gas collapses almost isothermally until the densities are\nlarge enough to activate dust cooling and fragmentatio, forming a compact \nPop~II stellar cluster. The middle panel of Fig.~\\ref{fig:testLWDcr} shows\nthat the effect is similar to imposing a larger LW flux critical threshold. A smaller number of\nlight seeds is formed, heavy seed formation is suppressed, and BH growth is dramatically inefficient, \nleading to $M_{\\rm BH} \\sim 3 \\times 10^4 \\, \\rm M_\\odot$ at $z=6.4$. In fact, on average, dust enrichment\nallows most of the halos to reach the critical threshold at $z \\gtrsim 20$ (see the right panel\nof Fig.~\\ref{fig:testLWDcr}), confining the formation\nof light seeds only in the first star forming progenitors and preventing the formation of heavy seeds,\nas the condition $J_{\\rm LW} > J_{\\rm cr}$ is achieved only at smaller redshifts. \n\nThis conclusion\ndoes not depend on the fate  of the newly formed dust-induced compact Pop~II stellar clusters. Even assuming that\ntheir dynamical evolution favors the collapse into a black hole of mass $\\sim 10^3 \\, \\rm M_\\odot$ \n\\citep{Omukai08,Devecchi09, Devecchi10, Devecchi12}, their number and mass are too small to significantly affect the BH mass growth rate. \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=7.5cm]{pop3IMFhirano.pdf}\n\\caption{Initial mass function (IMF) of Population III stars. The black solid line shows the Larson IMF\nadopted in the reference model, normalized to 1 in the mass range $[10-300]\\, \\rm M_\\odot$. \nGreen dashed  and orange dot-dashed lines show the analytic functions used to approximate\nthe results of \\citet{Hirano15} for $J_{\\rm LW} < 0.1$ and $>0.1$, respectively. \nIn both cases, the mass distribution is normalized to 1 in the mass range $[10-2000]\\, \\rm M_\\odot$.} \n\\label{fig:hiranoIMF} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLSmdistri_testhirano.pdf}\n\\includegraphics [width=6.0cm]{aveLSzdistri_testhirano.pdf}\n\\includegraphics [width=6.0cm]{bhevo_testIMFhirano.pdf}\n\\caption{Same as Fig.~\\ref{fig:histogLS} but only for light BH seeds and \nassuming the environment-dependent\nPop~III IMF predicted by \\citet{Hirano15}. In the right panel we show the\nBH mass growth and the contribution of light and heavy seeds in 4 different realizations\nof the merger tree. The labels (b), (g), (f) and (i) are used to enable a direct comparison \nwith the results presented in Fig.~\\ref{fig:bhevo10r}.} \n\\label{fig:testhirano} \n\\end{figure*} \n\n\n\\subsection{IMF of Population III stars}\n\nFirst attempts to predict the Pop III stellar mass spectrum ab-initio, starting from cosmological\ninitial conditions, have been recently made through sophisticated numerical simulations\n\\citep{Hirano14, Hirano15}. \nAccording to \\citet{Hirano15}, Pop III stars which form in halos exposed to a LW background intensity $J_{\\rm LW}<0.1$ \nfollow a mass distribution characterized by two peaks, at $\\sim 25$ and \n$\\sim 250 \\, \\rm M_\\odot$.\nConversely, only very massive ($>100 \\, \\rm M_\\odot$) stars form when $J_{\\rm LW}>0.1$ \n as less efficient cooling causes higher gas temperature and \nlarger accretion rates (see Fig.~6 in \\citealt{Hirano15}). \n\nIn order to test the implications of this environment-dependent Pop~III IMF, we \napproximate the mass distribution found by \\citet{Hirano15} with the analytic\nfunctions shown in Fig.~\\ref{fig:hiranoIMF}, where the IMF are normalized\nto 1 in the stellar mass range $[10-2000]\\, \\rm M_\\odot$ (dashed and dot-dashed lines\nfor $J_{\\rm LW} < 0.1$ and $>0.1$, respectively). For comparison, we\nalso show the IMF adopted in the reference model (solid line). \nGiven the shape of the new distribution, we expect a larger number\nof massive Pop III remnants, leading to more frequent light BH seeds with \nmass $> 300 \\, \\rm M_\\odot$ compared to the reference model.\n\nThe resulting average mass and redshift distributions of light seeds are\nshown in the left and middle panels of Fig.~\\ref{fig:testhirano}. The two\npeaks of the mass distribution reflect the underlying Pop~III IMF. \nThe number of light BH seeds is $\\sim 10$ times larger than in the\nreference model, and $\\sim 30 \\%$ of these have a mass $> 300 \\, \\rm M_\\odot$. \nIn fact, the shape of the underlying Pop~III IMF affects the star formation\nhistory at $z > 15$ through both mechanical and chemical feedback: the larger\nnumber of stars with masses in the pair-instability SN range,\n$160 \\, \\rm M_\\odot \\lesssim m_\\ast \\lesssim 240 \\, \\rm M_\\odot$ \\citep{Heger02}, and \nabove leads to strong SN and AGN-driven outflows of metal-enriched gas out of the first mini-halos. \nThe integrated effect of this feedback-regulated star formation rate along the\nhierarchical evolution is to decrease the metallicity of gas-poor star forming\nprogenitors - favoring the formation of a larger number of Pop~III BH remnants -\nand the LW emissivity, hence the intensity of the LW background. As a result,\nthe condition $J_{\\rm LW} > J_{\\rm cr}$ is met at lower $z$ compared to the\nreference model, when most of the Ly$\\alpha$ halos have already been enriched\nabove the critical metallicity and  the formation of heavy seeds\nis suppressed in 7 out of 10 merger trees.\n\nIn these conditions, the BH mass growth at $10 \\lesssim  z \\lesssim 15$ is very sensitive to the amount \nof leftover gas from winds in progenitor systems. In the right panel of  Fig.~\\ref{fig:testhirano} we show the \nBH mass growth and the contribution of light and heavy seeds as a function of redshift for 4 different merger tree \nsimulations. In the top panels, we show the results for the same (b) and (g) \nmerger tree realizations presented in Fig.~\\ref{fig:bhevo10r}.  Despite \nno heavy seed is formed, $M_{\\rm BH} \\sim 10^9 \\, \\rm M_\\odot$ at $z \\sim 6.4$\nin simulation (b), only a factor of a few smaller than the observed value.\nAlthough the total BH mass contributed by light seeds is similar, gas accretion\nis less efficient in simulation (g) and the final BH mass is significantly smaller. \nIn the bottom panel, we show the results of two simulations where, despite a \ncomparable number of heavy seeds forms,  the\nfinal BH mass at $z \\sim 6.4$ differs by almost two orders of magnitude.\nIn simulation (f), a large number of light BH seeds forms over the redshift range\n$17 \\lesssim z \\lesssim 25$. Gas depletion in their progenitor galaxies\ndue to AGN feedback causes a lower average accretion rate at $z < 15$ and\nthe BH mass at $z = 6.4$ is only $\\sim 5 \\times 10^7 \\, \\rm M_\\odot$. On the contrary,\nthe small number of light BH seeds formed in simulation (i) at $z \\lesssim 20$\ndoes not significantly affect the gas content of progenitor galaxies and gas accretion\nat $z < 15$ can be efficient enough to form a SMBH at $z = 6.4$, with a mass consistent\nwith the data.\n\n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLSmdistri_testdynamics.pdf}\n\\includegraphics [width=6.0cm]{aveLSzdistri_testdynamics.pdf}\n\\includegraphics [width=6.0cm]{aveBHevo_testdynamics.pdf}\n\\caption{Same as in Figs.~\\ref{fig:bhevo} and~\\ref{fig:histogLS} but assuming that\nall BH remnants of Pop III stars merge to form a single more massive BH seed.\nIn addition, in the middle panel we show the redshift distribution of light seeds with\n masses $>300$ {M$_\\odot$} \\, (azure histogram and gray data points).} \n\\label{fig:testdynamics} \n\\end{figure*} \n\n\\subsection{Dynamics of light BH seeds}\n\n\nIn the reference model, we assume that only the most massive  Pop III remnant form a light BH seed that\nsettles at the galaxy center accreting gas \nfrom the surrounding medium. \nTo test the effect of this assumption, here we investigate the opposite, extreme scenario\nand we allow all BH remnants to merge and form a single more massive \nlight BH seed that migrates at the center of the galaxy. The underlying \nassumption is that the merging timescale is shorter than the characteristic timestep\nof the simulation, and that dynamical effects, such as 3-body scattering \\citep{Miller02, Gultekin06} and gravitational recoil \n\\citep{Haiman04, Shapiro05, VolonteriRees06} are not ejecting the merging BHs. Regarding 3-body scattering, \nwe can rescale the results by \\citeauthor{Gultekin04} (\\citeyear{Gultekin04, Gultekin06}) and \\cite{Miller09}, while for the gravitational \nrecoil we can use the Monte Carlo sampling of recoil velocities in \\cite{VGD10}. In general, the potential well of the halo\nbecomes sufficiently massive to retain merging and scattering BHs only when the halo mass is $\\sim 10^7-10^8 \\, \\rm M_\\odot$. This is because most\nof the merging BHs have mass ratio between 1:6 and 1:1, where the recoil velocity is typically $>100$ km/s for random spin magnitudes and configurations. Similarly, 3-body scattering appears to cease to be effective in ejecting BHs when the escape velocity becomes $>100$ km/s. \nWe note, however, that sudden gas inflows, triggered by mergers or collimated gas streams from the cosmic web, can temporarily deepen the potential well\nand allow mergers and 3-body scattering to occur \\citep{Davies11,Lupi14}. We will in the following assume, optimistically, that all formed BHs can merge, but in reality we expect that only a fraction of them can be retained, and this fraction increases with the mass of the host halo.\n\nThe resulting mass and redshift distribution of light seeds is shown in the left and middle \npanels of Fig.~\\ref{fig:testdynamics}, respectively. As expected, the mass spectrum of\nlight seeds now extends well beyond $300 \\, \\rm M_\\odot$, the maximum BH\nremnant mass for the adopted Pop~III IMF. Less massive, more numerous, light seeds\n($\\lesssim 300 \\, \\rm M_\\odot$) form in less efficient star \nforming halos, while more massive light seeds ($> 300 \\, \\rm M_\\odot$) are the result of the \ncoalescence of several (from few to hundreds) Pop III remnants formed in \nmore efficient star forming halos. Interestingly, there is a tail of the mass distribution\nthat extends up to $\\sim 10^5 \\, \\rm M_\\odot$, showing that few light seeds may reach a\nmass comparable to that of heavy seeds. \n\nThe redshift distribution of light seeds is fairly independent of their mass, as shown\nby the two histograms  in the middle panel of Fig.~\\ref{fig:testdynamics}.\nCompared with the analogous plot for the reference model shown in Fig.~\\ref{fig:histogLS},\na much larger number of light seeds is formed. This is a consequence of the\nstronger feedback induced by more massive BHs on their host galaxy. In the shallow\npotential wells of small halos at high redshift, BH feedback is able to unbind most \n- if not all - of the gas. As a result, the ISM metallicity remains below the critical value for \na longer period of time, leading to a prolonged phase of Pop~III star and light BH seeds\nformation. \n\nThe effect on the BH mass growth rate is shown in the right panel of Fig.~\\ref{fig:testdynamics}.\nIn this case, the contribution of light seeds exceeds that of heavy seeds, which is smaller\n(by a factor $\\sim 3$) than in the reference model, and triggers a faster and more efficient growth.\nThe BH mass exceeds $\\sim 10^9 \\, \\rm M_\\odot$ at $z \\lesssim 10$ and reaches a final value\nof  $\\sim 6 \\times 10^{10} \\, \\rm M_\\odot$ at $z \\sim 6.4$, a factor of 20 larger than in the reference model.\n\n\n\n\n\n\n\\section{Conclusions} \n\\label {sec:conclusions}\n\nWe have investigated the origin of SMBHs at $z > 6$ applying a\nlargely improved version of the semi-analytical model {\\textsc{GAMETE/QSOdust}}. \nIn this work we explore the relative role of light BH seeds, formed as remnants\nof massive Pop~III stars, and heavy BH seeds, formed by the direct collapse\nof gas, in the formation pathway to the first SMBHs. \n\nTo this aim, we have implemented a physically motivated prescription to estimate\nthe cold gas mass fraction in mini-halos, taking into account molecular and metal\nfine-structure cooling and the photo-dissociation of $\\rm H_2$ in the presence of an\nexternal LW background. \nWe then follow the subsequent\nevolution of the BHs and their host galaxies along the hierarchical history of a\n$z = 6.4$ halo with a mass of $10^{13} \\, \\rm M_\\odot$.\nThe free parameters of the model, such\nas the accretion efficiency entering in the formulation of Eddington-limited\nBondi accretion, the AGN wind efficiency, the efficiency of quiescent and merger-driven\nstar formation, have been fixed to reproduce the observed properties of SDSS J1148.\nSimulating different merger trees of the same halo, we compute the intensity of the\nLW background, accounting for the contribution of stars and accreting BHs, the\nfilling factor of ionized regions, the metal and dust enrichment in and outside the\nprogenitor galaxies, to explore if and when heavy BH seeds can form in metal-poor\nLyman-$\\alpha$ halos exposed to a strong LW background. \n\nIn the reference model, where we assume that Pop~III stars form in progenitor\ngalaxies with $Z < Z_{\\rm cr} = 10^{-3.8}$ Z$_\\odot$ according to a Larson IMF in the \nmass range $10 \\, \\rm M_\\odot \\le m_\\ast \\le 300 \\, \\rm M_\\odot$, a small number of light\nBH seeds are hosted in mini-halos at $z \\gtrsim 20$ before radiative feedback is\nable to suppress $\\rm H_2$ cooling. The dominant fraction of light BH seeds form in \nLyman-$\\alpha$ cooling halos at $15 \\lesssim z \\lesssim 20$, before the intensity\nof the LW background becomes larger than $J_{\\rm cr} = 300$ allowing the direct\ncollapse of gas and the formation of heavy seeds. In these conditions, we find that\nin 9 out of 10 merger tree simulations between 3 to $\\sim 30$ heavy seeds are able to form \nbefore metals have enriched all the progenitor galaxies  to $Z \\ge Z_{\\rm cr}$ and \nlow-mass Pop~II stars form. We find that:\n\n\\begin{itemize}\n\n\\item The growth of $z > 6$ SMBHs relies\non heavy seeds. The only simulation where the interplay between chemical and \nradiative feedback effects prevents the formation of heavy seeds predicts a\nfinal BH mass of $M_{\\rm BH} < 10^6 \\, \\rm M_\\odot$.\n\n\\item The above result dramatically depends on the assumed values of $J_{\\rm cr}$\nand $Z_{\\rm cr}$. A larger value of $J_{\\rm cr}$ ($= 10^3$) or a Pop~III/Pop~II transition\ndriven by dust-cooling at a critical dust-to-gas ratio of ${\\cal D}_{\\rm cr} = 4.4 \\times 10^{-9}$\nprevents the formation of heavy seeds, hampering the mass growth of the nuclear BH\nso that its final mass at $z = 6.4$ is $M_{\\rm BH} < 10^6 \\, \\rm M_\\odot$ in all the merger tree\nsimulations.\n\n\\item The relative importance of heavy and light BH seeds depends on the adopted IMF\nof Pop~III stars, as this affects the history of cold gas along the merger tree by means of\nSN and AGN-driven winds.\n\n\\item As long as gas accretion is assumed to be Eddington-limited, the mass of individual BH \nseeds is the key condition to trigger SMBH growth. If  all BH remnants merge before \nsettling to the center of their progenitor galaxy, the mass distribution of light BH seeds \nextends to $\\sim 10^3 - 10^5 \\, \\rm M_\\odot$. In these conditions, gas accretion is so efficient \nthat by $z = 6.4$ the SMBH mass is - on average - $ >10^{10} \\, \\rm M_\\odot$ and the evolution is \ncompletely dominated by light BH seeds. \n\\end{itemize}\n\n\n\n\\begin{figure}\n\\includegraphics [width=7.5cm]{aveDCBHdens_fiducial.pdf}\n\\caption{Predicted number density of DCBHs as a function of $z$.  \nThe solid line shows the average number of all DCBHs formed in the reference model and the dot-dashed line \nshows the same quantity for real DCBH progenitors (see text). For each of these two classes, the shades span \nthe values found in different merger tree simulations. For comparison, we also show the values predicted by\nDijkstra et al. (2014, traingles) and Agarwal et al. (2014, horizontal dashed line). The latter value has been \nmultiplied by $10^{-6}$ to enable the comparison.} \n\\label{fig:DCBHdens} \n\\end{figure} \n\n\n   \nWe conclude that  the formation of a $> 10^9 \\, \\rm M_\\odot$ BH at $z > 6$ depends on a\ncomplex interplay of feedback processes, where the mass and redshift distribution\nof both light and heavy seeds have a fundamental role.  \nThe first SMBHs can grow by Eddington-limited\naccretion only if sufficiently massive BH seeds are able to form in their progenitor galaxies. This can\nbe achieved by means of  Pop~III BH remnants (light seeds) if  Pop~III stars form with $m_\\ast > 300 \\, \\rm M_\\odot$\nor if smaller mass BH remnants merge to form a single, more massive BH.\nAlternatively, even a few heavy seeds with mass $\\sim 10^5 \\, \\rm M_\\odot$ can provide the right ``head-start'', but their formation requires favourable conditions that can only be achieved if $J_{\\rm cr} \\lesssim 300$\nand $Z_{\\rm cr} \\geq 10^{-3.8}$ Z$_\\odot$. Since $J_{\\rm cr}<300$ is lower than required by 3D cosmological simulations of the collapse of primordial clouds, alternative models of direct collapse driven by dynamical processes should be kept in mind (e.g. \\citealt{LoebRasio94, EisensteinLoeb95, Begelman06, Mayer07, VB10}).\n\nIn our reference model, where the formation of a SMBH relies on heavy seeds, the  number of heavy seeds progenitors \nvaries between 3 and 27 among the different merger tree simulations, with an average number of 13.\nIf we weight these numbers by the observed comoving density of quasars at $z = 6$, $n_{\\rm SMBH} \\sim 10^{-9} \\,\\, \\rm{cMpc}^{-3}$, \nwe can predict the comoving number density of direct collapse BHs (DCBHs). This is shown in \nFig.~\\ref{fig:DCBHdens}, where we compare the results of our reference model with other studies. We find that by $z \\sim 15$ the\ncomoving number density of DCBH is $3 \\times 10^{-9} \\, \\,  {\\rm cMpc}^{-3} \\lesssim n_{\\rm DCBH} \n\\lesssim 2.7 \\times 10^{-8}  \\, \\, \\rm{cMpc}^{-3}$. We clarify that these numbers refer to heavy BH seeds progenitors of SMBHs at $z = 6$.\nIn the same reference model, a much larger population of direct collapse BHs form ($\\sim 100$ on average) which - however - end up as \nsatellites and do not directly contribute to the mass growth of the SMBH. For these enlarged population, the comoving number density\nthat we predict is $\\sim 10^{-7} \\, \\, \\rm{cMpc}^{-3}$, in very good agreement with the results of \\citet{Dijkstra14} for their fiducial model.\nA much larger value has been found by \\citet{Agarwal14}, who report $\\sim 6$ potential DCBH hosts in their 4 cMpc size simulation box \nat $z \\sim 10$, leading to an estimated comoving number density of $\\sim 0.09  \\, \\, \\rm{cMpc}^{-3}$. As already noted by \\citet{Dijkstra14},\nthe main reason for this discrepancy is that \\citet{Agarwal14} adopts a $J_{\\rm cr} = 30$. No DCBH would form in their box if \n$J_{\\rm cr} = 300$ were to be assumed (see the bottom panel of their Fig.~1). \n\nCompared to these previous analyses, our study allows to identify BH seeds that are the progenitors of the first\nSMBHs, and to study the conditions that allow these BH seeds to germinate.\n\n\n\n\n\\section*{Acknowledgments}\nWe thank the anonymous referee for useful comments and suggestions.\nThe research leading to these results has received funding from the European Research Council under the European Union's\nSeventh Framework Programme (FP/2007-2013) / ERC Grant Agreement n. 306476. \nThis work is supported in part by the Grant-in-Aid from the Ministry of Education, Culture,\nSports, Science and Technology (MEXT) of Japan (25287040 KO).\n\n\n\n\\appendix\n\n\\section{Halo gas cooling efficiency}\n\nIn each dark matter halo, the fraction of gas mass that is able to cool is set by the balance \nbetween the cooling time and the dynamical time. Here we adopt a procedure similar to\nthat presented in \\citet{M01}. \n\nWe compute the free-fall time as,\n\n", "itemtype": "equation", "pos": 25958, "prevtext": "\n\\noindent\nwhere $M_{\\rm ISM}$ is the gas mass, $\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst}$ is the\ntotal star formation efficiency accounting for both quiescent and merger-driven episodes of star formation. \nFollowing \\citet{V11}, we take $\\epsilon_{\\rm quies}=0.1$ and $\\epsilon_{\\rm burst} = 8$ for equal mass\nmergers, with a modulation that depends on the mass ratio of the merging pairs\n(see eq.~11 and Table~2 in \\citealt{V11}). Finally, the quantity $f_{\\rm cool}$ quantifies the \nreduced cooling efficiency of mini-halos with respect to Ly$\\alpha$ halos. Hence, we assume $f_{\\rm cool} = 1$\nin progenitor systems with $T_{\\rm vir} \\ge 10^4$~K whereas in mini-halos this parameter quantifies the\nmass fraction of gas that can cool in one dynamical time and it depends on the virial temperature,\nredshift, gas metallicity and intensity of the LW background. The computation of $f_{\\rm cool}$ \nis described in Appendix A.\\\\\n\n\n\\noindent \n\\textit{Photo-heating feedback.}\\\\\nTo account for the effects of the increased gas temperature in photo-ionized regions,\nwe assume that star formation is suppressed, i.e. \n$(\\epsilon_{\\rm quies}+\\epsilon_{\\rm burst})=0$, in halos with virial temperature below the \ntemperature of the IGM. Hence, we neglect the hydrodynamic\nresponse of the gas (see Sobacchi \\& Mesinger 2013) and we assume a\nfeedback model where star formation is suppressed instantaneously when $T_{\\rm vir}<T_{\\rm IGM}$.\nThe mean IGM temperature is computed taking into account the volume filling factor of\nionized regions, \n$T_{\\rm IGM} = Q_{\\rm HII} \\, T_{\\rm reio} + (1-Q_{\\rm HII}) \\, T_{\\rm gas}$ where $T_{\\rm reio} = 2 \\times 10^4$ K is \nthe assumed post-reionization temperature and $T_{\\rm gas} = 170 \\, (1+z)^2$. \\\\\n\n\\noindent \n\\textit{Photo-dissociating feedback}.\\\\\nSuppression of $\\rm H_2$ cooling and star formation in mini-halos due to\nphoto-dissociation by LW photons is taken into account through the \nparameter $f_{\\rm cool}$ in eq.~(\\ref{eq:sfr}), whose calculation\nis presented  in Appendix A. Depending on the halo virial temperature,\nredshift, gas metallicity and intensity of the LW background, we compare \nthe cooling time and the free-fall time and quantify the mass fraction of\ngas that is able to cool and form stars. We find that in the presence\nof a LW background, the cooling efficiency is rapidly suppressed in\nmini-halos. In fact, when $J_{\\rm LW} \\lesssim 1$, \n$f_{\\rm cool} \\neq 0$ only in mini-halos at $z \\gtrsim 20$ or if the gas is already\nmetal-enriched to $Z \\gtrsim 0.1$ Z$_\\odot$.  For more details, we refer the\nreader to Appendix A and Figs.~\\ref{fig:A1}-\\ref{fig:A4}.\n\n\n\\subsection{Stellar initial mass function} \n\\label{sec:popIII}\nCurrently, there are no direct observational constraints on the initial mass function of the \nfirst generation of stars. Theoretical studies do not yet provide a firm determination of\nthe stellar mass spectrum emerging from the first star forming regions (see e.g. \n\\citealt{Bromm13} and \\citealt{Glover13} for comprehensive reviews).\nRecent numerical studies suggest that - depending on their formation environment -\nPop III stars can have masses varying from 10s to 1000s {M$_\\odot$}, with a distribution \nthat peaks around few tens to few hundreds solar masses \n(e.g. \\citealt{Hosokawa11,Hirano14,Susa14,Hirano15}).\n\nFollowing \\citet{deBen14}, we assume that Pop III stars form according to a Larson IMF \\citep{Larson1998},\n\n", "index": 15, "text": "\\begin{equation}\n\\Phi(m_\\ast) \\propto m_\\ast^{\\alpha-1} \\, \\, e^{-m_\\ast/m_{\\rm ch}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\Phi(m_{\\ast})\\propto m_{\\ast}^{\\alpha-1}\\,\\,e^{-m_{\\ast}/m_{\\rm ch}},\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>m</mi><mo>∗</mo></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><mpadded width=\"+3.4pt\"><msubsup><mi>m</mi><mo>∗</mo><mrow><mi>α</mi><mo>-</mo><mn>1</mn></mrow></msubsup></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>m</mi><mo>∗</mo></msub><mo>/</mo><msub><mi>m</mi><mi>ch</mi></msub></mrow></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $v_{\\rm e}$ is the escape velocity ($v_r$ is the infall velocity of a test particle at rest at $r$), \ndark matter halos are assumed to have a NFW density profile with concentration parameter $c = 4.8$,\nand the gas follows an isothermal gas density distribution\n(see eqs. 9, 18 and 21 in \\citealt{M01}). \n\nThe cooling time is defined as,\n\n", "itemtype": "equation", "pos": 72324, "prevtext": "\n\\noindent\nwith $\\alpha = - 1.35$, $m_{\\rm ch} = 20$ M$_\\odot$ and $10$ M$_\\odot \\le m_\\ast \\le 300$ M$_\\odot$. \nDuring each star formation episode, we stochastically sample the IMF until we reach the total\nstellar mass formed\\footnote{We have tested that the IMF\nis fully reconstructed in the $[10-300]\\, \\rm M_\\odot$ mass range when the total stellar mass formed is \n$M_{\\rm star}>10^6 \\, \\rm M_\\odot$.}(see also \\citealt{deBennassuti15}). In Fig.~\\ref{fig:randomIMF} we show three examples \nof the mass distribution of Pop~III stars emerging from a star formation episode where the\ntotal stellar mass formed is $M_{\\rm star} \\sim 10^2 \\, \\rm M_\\odot$  (left panel), \n$\\sim 5\\times 10^3 \\, \\rm M_\\odot$ (middle panel) and $\\sim 1.6\\times 10^5 \\, \\rm M_\\odot$ (right panel). \nThe stellar population shown in the left panel is representative of the conditions that apply in small\nmass mini-halos. Only 6 stars are formed with masses in the range $[10  - 30]\\, \\rm M_\\odot$. In larger\nmass halos, as shown in the middle and right panels, the mass range that is populated is extended\ntoward larger stellar masses.\n\nWhen the metallicity in star forming regions is $Z_{\\rm ISM} \\ge Z_{\\rm crit}$, where\n$Z_{\\rm crit}$ is the critical metallicity for low-mass star formation\n (\\citeauthor{Schneider02} \\citeyear{Bromm01, Schneider02, Schneider03}), we assume that \nPop~II stars form in the stellar mass range $[0.1-100] \\, \\rm M_\\odot$ according to a Larson \nIMF with $m_{\\rm ch} = 0.35 \\, \\rm M_\\odot$. In what follows, we adopt $Z_{\\rm crit} = 10^{-3.8}$ Z$_\\odot$\nand we discuss the impact of assuming a dust-driven transition at lower $Z_{\\rm crit}$ \\citep{Omukai05,Schneider12a}.\n \n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{pop3IMFrandom.pdf}\n\\caption{Examples of the mass distribution of Pop~III stars emerging from stochastic\nsampling of the IMF in three different halos (see text). The total stellar mass formed is \n$10^2 \\, \\rm M_\\odot$ (left panel),\n$\\sim 5 \\times 10^3 \\, \\rm M_\\odot$ (middle panel) and $\\sim 1.6\\times 10^5 \\, \\rm M_\\odot$ \n(right panel).\nGrey shaded regions indicate the mass range leading to BH remnants.} \n\\label{fig:randomIMF} \n\\end{figure} \n\n \n\n\n\\subsection{Light black hole seed formation} \n\\label{sec:lightSeeds}\n\nLight BH seeds form as remnants of Pop~III stars. Here we assume that stars with \nmasses in the range $[40 - 140]\\, \\rm M_\\odot$ and $\\ge 260\\, \\rm M_\\odot$ do not \nexplode as SNe and directly collapse to BHs \\citep{Heger02}. The number \nand masses of BH remnants depend on the frequency with which these \nmass ranges are sampled when Pop~III stars form and stochastically populate\nthe IMF (see the previous section).\nIn the two halos shown in the middle and right\npanels of Fig.~\\ref{fig:randomIMF}, the stochastic sampling selects 124 and 3900 stars.\nThe shaded regions in the same figure indicate the mass range leading to BH remnants.\nIn small mini-halos, light BH seeds are very rare (see left panel).\n\nThe subsequent evolution of newly formed BHs depends on their mass. \nAs discussed by \\citet{Volonteri10}, lighter BHs are not expected to settle at the \ncenter but rather wander through the host galaxy, interacting with stars. For this\nreason,  we select as a light BH seed the most \nmassive BH remnant\\footnote{ In the three examples shown in Fig.~\\ref{fig:randomIMF}, \nwe do not assign any light BH seed to the population represented by the left panel\nand only one light BH seed in the other cases, taken to be the most massive BH remnant\namong the 2 (15) BHs of $\\sim [260 - 300] \\, \\rm M_\\odot$ formed\nin the middle (right) panel.}.\nWe discuss the implications of this assumption in section \\ref{sec:discussion}. \n\n\\subsection{Heavy black hole seed formation}\n\\label{sec:heavySeeds}\n\nFragmentation of gas clouds, and thus star formation, is prevented in Ly$\\alpha$ halos\n($T_{\\rm vir}\\geq 10^4$ K) in which the ISM metallicity is sub-critial ($Z_{\\rm ISM}<Z_{\\rm cr}$) \nand the LW background is strong enough to photo-dissociate $\\rm H_2$ \\citep{Omukai08}. \nThe latter condition is usually expressed as $J_{\\rm LW}>J_{\\rm cr}$,\nwhere $J_{\\rm cr}$ is the critical value in units of $10^{-21}$ erg cm$^{-2}$ s$^{-1}$Hz$^{-1}$ sr$^{-1}$.\nIf all the above conditions are simultaneously satisfied, the collapse proceeds almost \nisothermally thanks to atomic H line cooling, avoiding fragmentation into smaller clumps. \nThis process leads to the formation of a single BH with mass in the range \n$[10^{4}-10^{6}] \\, \\rm M_\\odot$,\nthat we call heavy BH seed, in some cases through an intermediate  phase of super-massive star formation \n(see e.g. \\citealt{Hosokawa12,Hosokawa13} for more details). \nRecently, \\citet{Ferrara14} investigated the mass spectrum of heavy BH seeds and found that their masses \nrange between  $\\sim 5\\times 10^4\\, \\rm M_\\odot$ \\, to $\\sim 2\\times 10^6 \\, \\rm M_\\odot$ \n(see also \\citealt{VB10}). \n\nFollowing these studies, we assume that heavy BH seeds form with an average mass of \n$10^5 \\, \\rm M_\\odot$ in Ly$\\alpha$ halos with sub-critical metallicity \nand super-critical LW background. \n\nThe exact value of $J_{\\rm cr}$ is still a matter of debate. \nIts value depends on whether sufficient $\\rm H_2$ to cool the gas within\na free-fall time is formed before it\nis collisionally dissociated at $\\sim 10^4 \\rm \\,cm^{-3}$, and depends on the spectral energy distribution of the sources of radiation \n\\citep{Omukai01,OhHaiman02, BL03, Omukai08, Agarwal12, Latif14b, Sugimura14, Sugimura15, Agarwal15}.\nIn addition, Ly$\\alpha$ halos can be exposed to intense local radiation, which exceeds the background \nlevel, in biased, dense regions of the Universe, and close to star forming galaxies \\citep{Dijkstra08,TH09,Dijkstra14}. \nAdditional complications come when {H$_2$ } self-shielding is taken into account  \\citep{Shang10, Hartwig15} and \nwhen the presence of X-ray or ionizing radiation increase the free electron fraction, favoring the formation\nof $\\rm H_2$ \\citep{IO11,Yue14,Johnson14,IT15}.  As a result, values of $J_{\\rm cr}$ between $\\sim 30$ and $\\sim 10^4$\nhave been proposed and used to estimate the number density of heavy seeds.\nIn particular, $J_{\\rm cr} > 500-10^3$ and up to $10^{4} - 10^{5}$ is always required to enable the direct \ncollapse mechanism in 3D numerical simulations to produce supermassive stars with mass \n$10^4-10^5 \\, \\rm M_\\odot$ \\citep{Latif14a, Regan14, LatifVolonteri15}.\nHere we adopt a reference value of $J_{\\rm cr}=300$ and we discuss the implications of this \nassumption in section \\ref{sec:discussion}. \n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{aveBHevo_fiducial.pdf}\n\\caption{Black hole mass as a function of redshift. \n  The black solid line represents the total\n  mass in BHs growing by gas accretion and mergers with other BHs \n  while the blue dashed and the red dot-dashed lines show the contribution\n  of the light and heavy seed BHs, respectively (without gas accretion).\n  Each line is the average over 10 different merger tree realizations with\n  the shades indicating $1\\sigma$ dispersion.} \n\\label{fig:bhevo} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1cm}\n\\includegraphics [width=6cm]{aveLSzdistri_fiducial.pdf}\n\\includegraphics [width=6cm]{aveHSzdistri_fiducial.pdf}\n\\includegraphics [width=6cm]{aveLSmdistri_fiducial.pdf}\n\\caption{Distribution of formation redshift of light (left panel) and heavy seeds (central panel). The\nright panel shows  the distribution of birth masses for light seeds only as heavy seeds are all assumed\nto have a mass of $10^5 \\, \\rm M_\\odot$. Histograms and data points show the average over 10 different \nmerger tree realizations with $1-\\sigma$ error bars.} \n\\label{fig:histogLS} \n\\end{figure*} \n\n\n\n\\section{Results} \n\\label{sec:results}\n\nIn this section we present the main results of our study. In the same\nspirit of \\citet{V11,V14}, we follow the formation\nof a SMBH with a mass of  $\\sim (2-6)\\times 10^9$ {M$_\\odot$} \\, at redshift $z=6.4$, \nsimilar to the one expected to power the bright quasar J1148 \\citep{Barth03, Willott03, deRosa11}. \n In what follows, we present the results\naveraged over 10 independent realizations of the merger tree of a \n$10^{13}$ {M$_\\odot$} \\, DM halo. However, in order to explore the dependence\nof some results on the merger history, we also discuss the properties of individual merger trees.\n\n\n\n\n\n\n\\subsection{Evolution of the black hole mass}\n\\label{sec:BHseeds}\n\nIn Fig.~\\ref{fig:bhevo} we show the predicted evolution of the total BH mass in a \nmerger tree as a function of redshift.\nFor each merger tree, we consider the contribution of BH progenitors to the total BH mass at each redshift.\nWe classify as BH progenitors only those BHs which do not become satellites at any stage of the \nmerger tree and whose mass will be inherited by the final SMBH at $z = 6.4$\\footnote{For each\nmerger tree, we follow backward in time the evolution of the SMBH. At each minor merger event, we cut the branch of the tree\nof the lighter, satellite progenitor BH and we only follow the branch of the most massive one. At each major merger event, we continue to\nfollow both branches of the progenitor BHs. This procedure allows us to reconstruct a-posteriori the sample of  BH progenitors whose masses \ndirectly contribute to the final SMBH mass at $z = 6.4$.}.\nThe free parameters of the model have been selected to reproduce a SMBH mass of \n$\\sim 3\\times 10^9 \\, \\rm M_\\odot$ at $z = 6.4$, in good agreement with that expected for quasar J1148 (red \ndata point in Fig.~\\ref{fig:bhevo}). \nIn the same figure we also show the separate contribution of light (blue dashed line) and \nheavy (red dot-dashed line) BH seeds to the total BH mass at different epochs. \n\\newline\n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLWBevo_fiducial.pdf}\n\\includegraphics [width=6.0cm]{aveQHII_fiducial.pdf}\n\\includegraphics [width=6.0cm]{aveIGMmet_fiducial.pdf}\n\\caption{\n\\textit{Left panel:} redshift evolution of the total Lyman Werner background flux\n(black solid line). Green dot-dashed and yellow dashed lines indicate the contribution of \naccreting BHs (AGNs) and stars, respectively. \nThe three horizontal lines indicate three different \ncritical values $J_{\\rm cr}=30, 300, $ and $10^3$ (see text for details). For comparison,\nwe also show the cosmic mean LW background predicted by Dijkstra et al. (2014, dotted\nline).\n\\textit{Middle panel:} Volume filling factor of ionized hydrogen regions (HII) as a \nfunction of redshift. \n\\textit{Right panel:} redshift evolution of the metallicity of the IGM in which halos are \nembedded. The horizontal line shows the critical metallicity \nfor Pop III/II transition adopted in the reference model. \nIn all panels, lines indicate the average values over 10 different merger tree \nrealizations with shades representing the $1-\\sigma$ dispersion. \n}\n\\label{fig:feedback} \n\\end{figure*} \n\n\n\\noindent \\textit{Light seeds-dominated regime}.\nAt high redshift ($z \\gtrsim 18$), BH growth is dominated by \nthe formation of light seeds. Their rate of formation\nis strongly regulated by photo-dissociating feedback which inhibits\nPop~III star formation in mini-halos.\nThe total mass from BH light seeds rapidly grows in time, \nreaching, on average, a maximum value of $\\sim 10^5 \\, \\rm M_\\odot$\nat $z \\sim 15.5$, below which their formation is suppressed by\nmetal enrichment. \n\\newline\n\n\\noindent \\textit{Heavy seeds-dominated regime}.\nHeavy seeds start to form at redshift $z \\lesssim 18$ and dominate\nthe evolution of the BH mass for a brief but significant period of time.\nIn fact, they rapidly grow in number and by $z \\sim 15.5$\ntheir contribution to the total BH mass is, on average, $\\sim 1.3\\times 10^6$ {M$_\\odot$},\nmore than one order of magnitude larger than that of light BH seeds. Not\nsurprisingly, the rise of heavy seeds marks the fall of\nlight seeds. In fact, Ly$\\alpha$ halos with $Z < Z_{\\rm cr}$ either form Pop~III stars,\nhence light BH seeds (when $J_{\\rm LW} < J_{\\rm cr}$), or form heavy seeds \n(when $J_{\\rm LW} \\ge J_{\\rm cr}$). \n\\newline\n\n\n\\noindent \\textit{Accretion-dominated regime}.\nAt $z \\lesssim 16$, BH growth is dominated by gas accretion. In fact, at this epoch\nthe progenitor galaxies are all enriched to $Z \\ge Z_{\\rm cr}$ preventing the formation\nof both light and heavy seeds. Overall, gas accretion provides the dominant contribution\nto the final SMBH mass at $z = 6.4$, in agreement with \\citet{V11}\\footnote{\nIn \\citet{V11} gas accretion dominates the evolution of the BH mass at  $z \\lesssim 11$.\nIn the present model gas accretion starts to dominate at an earlier \nredshift. The difference with \\citet{V11} is due to the different merger histories (which now include \nmini-halos) and BH seeding prescription.}. This is a consequence of the strong BH mass dependence\nof the BHL accretion law, which leads to run-away BH growth.\n\\newline\n\n\nIn our reference model, a total of $\\sim 4800$ light and \n$\\sim 100$ heavy seeds are formed, on average, at $z \\gtrsim 16$. \nHowever, only $\\sim 13\\%$ of these seeds ($\\sim 620$ light and $\\sim 13$ heavy) \nare BH progenitors, because a dominant fraction is lost along minor branches of the merger tree \nand become satellites. \n\nIn Fig.~\\ref{fig:histogLS}  we show the BH progenitor\nformation redshifts and birth masses.  \nLight BH seeds start forming at $z \\sim 24$ although their number increases considerably \nat $z \\lesssim 20$, with a peak at $z \\sim 17$ followed by a rapid decline. This redshift\ndistribution reflects the properties of their birth environments. At\nthe highest $z$, light BH seeds form in mini-halos, whose star formation efficiency is \nlow and prone to photo-dissociating feedback. \nTheir birth mass distribution shows that the largest \nnumber of light BH seeds is concentrated in the most massive bin, with $\\sim 240$ BHs ($\\sim 40\\%$\nof the total) with mass in the range $[260 - 300]\\, \\rm M_\\odot$, while the remaining are almost \nequally distributed between $40$ and $140 \\, \\rm M_\\odot$ (see the right panel).\nOn the other hand, heavy seed BH progenitors form, on average, over a very narrow\nredshift range, at $15.5 \\lesssim z \\lesssim 18$, with a peak at $z \\sim 16.5$ that is \nslightly shifted with respect to that of light seeds, followed by a sharp decline.  This\nsudden appearance and decline of heavy seeds is a consequence of their tight\nbirth environmental conditions which are satisfied only by a relatively small number\nof halos and over a very limited period of time, as it will be clarified in the following\nsection. \n\n\n\n\n\\subsection{Birth environment of SMBH seeds}\n\\label{sec:environment}\n\nThe results presented in the previous section show how the mass growth of \nSMBHs at $z > 6$ depends on a complex interplay between \nradiative and chemical feedback processes that shape the birth environment of light and\nheavy BH seeds.  Since SMBHs at $z > 6$ form in biased regions of the Universe, \nthe intensity of the LW background, the volume \nfilling factor of ionized regions and the gas metallicity, which set the relative strength\nof feedback processes, are expected to be different from the cosmic mean values\nat the same redshift. \n\nThe left panel of Fig.~\\ref{fig:feedback} shows the relative contribution of\naccreting BHs (AGNs, green dot-dashed line) and stellar emission (yellow dashed line)\nto the LW background (black solid line). At all redshifts, the LW\nemission is dominated by star formation. The intensity of the LW background\nincreases very rapidly, exceeding values of $J_{\\rm cr} = 30, 300$, and  \n$10^3$ (marked by the horizontal lines), on average,  at $z \\sim 20, 16.5,$ and $15$,\nwith some dispersion among different merger histories (see section \\ref{sec:singelMTs}).\nIn the same figure we also show, for comparison, the cosmic mean LW background \npredicted by \\citet{Dijkstra14}.\n\nThe central panel of Figure \\ref{fig:feedback} shows the evolution of the volume filling factor\nof ionized regions. We find that  $Q_{\\rm HII} \\sim 1$ at $z \\lesssim 14$, consistent with the\nexpectations from the rapid increase of the UV background intensity.\n\nFinally, in the right panel of Figure \\ref{fig:feedback} we present the redshift evolution \nof the metallicity of the IGM, the medium in which all halos are embedded. \nThis metallicity, $Z_{\\rm IGM}$, increases as mechanical feedback, in the form of \ngalaxy-scale winds driven by the SNe and AGNs, ejects metal-enriched gas \nout of the galaxies, enriching the surrounding medium. \nThe horizontal line indicates the critical metallicity for low-mass star formation\nthat we have adopted in the reference model, $Z_{\\rm cr} = 10^{-3.8}$ Z$_\\odot$. \nThe average IGM metallicity exceeds this critical value at $z \\lesssim 17$, with\nsome dispersion among different merger histories. \n\n\nThe effects of radiative feedback on the environment\nwhere light and heavy BH seeds form is summarized in Fig.~\\ref{fig:massLimit}, which shows the redshift\nevolution of the minimum halo mass for star formation (black solid line). \nAt high redshifts the minimum\nhalo mass rapidly increases as a consequence of photo-dissociating feedback, reaching\nthe minimum mass of Ly$\\alpha$ halos (short-dashed line) already at $z \\sim 20$, on average. Hence, as\nit was anticipated in section~\\ref{sec:BHseeds}, the dominant fraction of light BH seeds\nform in Ly$\\alpha$ halos \nwhich are less vulnerable to photo-dissociating feedback. Between\n$16 \\lesssim z \\lesssim 20$ Ly$\\alpha$ halos with masses $M_{\\rm h} \\sim (3 - 5)\\times 10^7 \\, \\rm M_\\odot$ and\nsub-critical metallicity can either form\nlight or heavy BH seeds depending on the intensity of $J_{\\rm LW}$. When $z \\lesssim 16$\nthe minimum mass for star formation increases as a consequence of photo-heating\nfeedback and achieve the adopted minimum mass for star formation in ionized regions, \n$M_{\\rm h} \\gtrsim 2 \\times 10^8 \\, \\rm M_\\odot$ (dot-dashed line), by $z \\sim 13$, when the IGM\nis fully ionized. The figure also shows that the minimum mass for star formation depends on the\nadopted resolution mass only at $z \\lesssim 11$, when the epoch of BH seed formation is already\nterminated. Hence, the results are independent of the mass resolution of the merger trees. \n  \nFinally, to quantify the effect of chemical feedback on heavy BH seeds formation, we\ncompute their occurence ratio, defined as the number of progenitor halos which satisfy\nthe conditions $J_{\\rm LW} > J_{\\rm cr}$ and $Z < Z_{\\rm cr}$ divided by the\nnumber of progenitor halos with $J_{\\rm LW} > J_{\\rm cr}$. When averaged \nover 10 independent merger histories, we find the occurrence \nratio at $z > 15$ to be $\\sim 5\\%$, meaning that chemical \nfeedback plays a dominant role.\n \n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{aveMmin_fiducial.pdf}\n\\caption{Average minimum halo mass for star forming as a function of redshift \n(black solid line). \nThe line indicates the average over 10 different merger histories and the\nshaded region shows the $1-\\sigma$ dispersion. \nFor comparison, we also show the resolution mass of the merger trees (red long-dashed line), the \nminimum mass of  Ly$\\alpha$ halos (with $T_{\\rm vir} = 10^4$~K, blue short-dashed line) and \nthe adopted minimum mass for star formation in ionized regions (with $T_{\\rm vir} = 2\\times 10^4$~K, green dot-dashed line).}\n\\label{fig:massLimit} \n\\end{figure} \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{BHevo_fiducial.pdf}\n\\caption{Evolution of the BH mass as a function of redshift for 10 different merger trees. Black solid lines show the total BH mass while blue dashed and red dot-dashed\nlines represent the contribution of light and heavy seeds, respectively, without gas \naccretion.} \n\\label{fig:bhevo10r} \n\\end{figure} \n\n\n\n\n\\subsection{Dependence on the hierarchical history}\n\\label{sec:singelMTs}\n\nOne of the advantages of a semi-analytical model is that it allows one\nto run independent merger tree simulations of the same quasar.\n\nIn Fig.~\\ref{fig:bhevo10r} we show the evolution of the BH mass and\nthe contribution of light and heavy seeds as a function of redshift for\n10 different merger trees. In 9 out of 10 runs, the final BH mass is in \nvery good agreement with the data. \nThe only exception is the simulation shown in panel (e),\nwhere only light BH seeds form. This supports the conclusion that,\n as long as gas accretion is assumed to be Eddington-limited,\nheavy BH seeds are required to grow a SMBH at $z > 6$.\n\n\nThe relative contribution of light and heavy BH seeds depends on the individual\nmerger tree. \nEven when light BH seeds start to form at\n$z \\gtrsim 20$ (see\npanels a, b, f, g and h), their total mass does not exceed $\\sim 10^5\\, \\rm M_\\odot$ and it is comparable to\nthe mass of one single heavy BH seed.  Only\nbetween $\\sim 3$ to $\\sim 30$ heavy BH seeds are required to grow a SMBH by $z \\sim 6.4$, \nand their total mass ranges between $\\sim 3 \\times 10^5 \\, \\rm M_\\odot$ and \n$\\sim 3 \\times 10^6 \\, \\rm M_\\odot$.\n\nIt is interesting to investigate in more details why no heavy BH seed is formed\nin the simulation shown in panel (e). We compare the properties of this simulation\nwith the one shown in panel (b), which is characterized by a similar high-$z$ evolution\nof the light BH seeds mass. In Fig.~\\ref{fig:agemet} we show the metallicity of \nall progenitor halos in the two simulations (gray points) as a function of redshift.\nThe solid line is the mean metallicity of the IGM and open blue circles \n(red squares) represent progenitor halos hosting light (heavy) BH seeds.\nLight BH seeds form in halos with $Z < Z_{\\rm cr}$, where the value corresponding\nto $Z_{\\rm cr}$ in the reference model is shown by the horizontal dashed line. \nAs expected, heavy seeds form only  in a small number of halos of simulation (b), \nwhere $Z < Z_{\\rm cr}$ and $J_{\\rm LW} > J_{\\rm cr}$ \n(the redshift at which this condition is satisfied is indicated by the vertical \ndot-dashed line). \n\nThe redshift and metallicity distribution of progenitor halos is different in the two\nsimulations. Newly virialized progenitor halos  have the same metallicity of the IGM, while \nin others the metallicity can be significantly smaller or larger.  \nAt $z \\lesssim 20$, $Z_{\\rm IGM}$ is slightly smaller \nin simulation (e) and there is a smaller fraction of halos with $Z < Z_{\\rm IGM}$,\nmeaning that self-enrichment is more efficient than in simulation (b).\nIn addition, the LW background intensity becomes larger than $J_{\\rm cr}$ at a lower\nredshift in simulation (e),  $z \\sim 15.5$ instead of $z \\sim 16.5$.  \nAs a result, there is no single progenitor halo where  the conditions for heavy BH seed formation\nare satisfied.\n\n\n\n\n\\begin{figure}\n\\vspace{\\baselineskip}\n\\includegraphics[width=\\hsize]{agemet_fiducial.png}\n\\caption{Metallicity as a function of redshift of all the progenitor halos (gray points) in two merger\ntree simulations (b, left panel) and (e, left panel) shown in Fig.~\\ref{fig:bhevo10r}. Open blue circles\nand red squares indicate the progenitors where light and heavy BH seeds form. In each panel,\nthe solid line is the mean IGM metallicity, the horizontal dashed line is the value of $Z_{\\rm cr}$\nand the vertical dot-dashed line is the redshift at which $J_{\\rm LW} > J_{\\rm cr}$.} \n\\label{fig:agemet} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveBHevo_testJLW.pdf}\n\\includegraphics [width=6.0cm]{aveBHevo_testDcr.pdf}\n\\includegraphics [width=6.0cm]{aveIGMdust.pdf}\n\\caption{Same as in Fig.~\\ref{fig:bhevo} but assuming  $J_{\\rm cr} = 10^3$ (left panel) and \na dust-driven transition to Pop~II star formation occurring at ${\\cal D}_{\\rm cr} = 4.4 \\times 10^{-9}$ (middle panel). \nIn the right panel we show the average metallicity (blue solid line) and dust-to-gas ratio (red dashed \nline) of the IGM. Horizontal dashed (dot-dashed) line indicates $Z_{\\rm cr}$ in absolute units and ${\\cal D}_{\\rm cr}$, respectively. \nIn all panels the curves are averages over 10 merger tree realizations with shades representing the $1-\\sigma$ dispersion.} \n\\label{fig:testLWDcr} \n\\end{figure*} \n\n\n\\section{Discussion} \n\\label{sec:discussion}\n\nThe results of the reference model depend on a number of assumptions whose\nimportance is critically discussed below. \n\n\n\\subsection{Dependence on $J_{\\rm cr}$}\n\nThe critical intensity of the LW background that enables the collapse of gas in \nmetal-poor Ly$\\alpha$ halos is still highly debated. Here\nwe discuss the consequences of increasing $J_{\\rm cr}$ to  $10^3$.\n\nAlthough the LW background can reach very large values in the biased region that we are\nsimulating, on average it exceeds $J_{\\rm cr}=10^3$ at $z \\lesssim 14.5$ (see left panel in Fig.~\\ref{fig:feedback}),\nwhen all progenitor halos have been already enriched above the critical metallicity for Pop~II star formation.\nLy$\\alpha$ halos with $Z < Z_{\\rm cr}$ and \n$300 \\lesssim J_{\\rm LW} \\lesssim 10^3$ now host Pop~III star formation and no single heavy BH seed forms.\n\nThe redshift evolution of the total BH mass is shown in the left panel of Fig.~\\ref{fig:testLWDcr}. \nThe  growth of the BH is strongly suppressed and $M_{\\rm BH} \\lesssim 10^6 \\, \\rm M_\\odot$ at  \n$z \\sim 6.4$. In fact, despite the larger number of light seeds at \n$16 \\lesssim z \\lesssim 18$ compared to the reference model ($\\sim 4$ times larger, on average), \ntheir BH masses are too small to activate efficient \ngas accretion, unless a much higher BH accretion efficiency ($\\alpha_{\\rm BH}$) or super-Eddington accretion\nis assumed (\\citealt{VolonteriRees05, Li12, AN14, MHD14}; Pezzulli et al. 2015). \n\n\n\n\n\n\n\\subsection{Dependence on the critical dust-to-gas ratio}\n\nIn the reference model we assume that low mass Pop II stars form\nwhen the metallicity of the star forming gas reaches a critical value of $Z_{\\rm cr} = 10^{-3.8}$\nZ$_\\odot$,\nabove  which metal fine-structure line cooling becomes efficient. \nHowever, semi-analytic and numerical studies suggest that gas cooling and fragmentation\ncan be activated at a lower metallicity when dust grains are present (\\citealt{Schneider02}; \\citealt{Schneider06};\n \\citealt{Omukai10}; \\citealt{Dopcke11}). \n\\citet{Schneider12a} show that low-mass Pop~II stars can form\nwhen the dust-to-gas mass ratio, ${\\cal D}$, exceeds a critical value of\n${\\cal D}_{\\rm cr}=4.4^{-1.9}_{-1.8} \\times 10^{-9}$. \nMoreover, a dust-driven transition is consistent with observations of the\ntail of the metallicity distribution function of Galactic halo stars \\citep{Schneider12b,deBen14}.\n\nIn {\\textsc{GAMETE/QSOdust}} \\, we follow dust enrichment in the ISM of all progenitor halos and we can explore\nthe effects of dust cooling and fragmentation on the formation of Pop~III\nstars, hence of light BH seeds, and on the direct collapse of gas onto a heavy BH seed. \nFollowing \\citet{Omukai08}, we assume that when ${\\cal D} < {\\cal D}_{\\rm cr}$\nand $J_{\\rm LW} > J_{\\rm cr}$, the gas collapses almost isothermally until the densities are\nlarge enough to activate dust cooling and fragmentatio, forming a compact \nPop~II stellar cluster. The middle panel of Fig.~\\ref{fig:testLWDcr} shows\nthat the effect is similar to imposing a larger LW flux critical threshold. A smaller number of\nlight seeds is formed, heavy seed formation is suppressed, and BH growth is dramatically inefficient, \nleading to $M_{\\rm BH} \\sim 3 \\times 10^4 \\, \\rm M_\\odot$ at $z=6.4$. In fact, on average, dust enrichment\nallows most of the halos to reach the critical threshold at $z \\gtrsim 20$ (see the right panel\nof Fig.~\\ref{fig:testLWDcr}), confining the formation\nof light seeds only in the first star forming progenitors and preventing the formation of heavy seeds,\nas the condition $J_{\\rm LW} > J_{\\rm cr}$ is achieved only at smaller redshifts. \n\nThis conclusion\ndoes not depend on the fate  of the newly formed dust-induced compact Pop~II stellar clusters. Even assuming that\ntheir dynamical evolution favors the collapse into a black hole of mass $\\sim 10^3 \\, \\rm M_\\odot$ \n\\citep{Omukai08,Devecchi09, Devecchi10, Devecchi12}, their number and mass are too small to significantly affect the BH mass growth rate. \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=7.5cm]{pop3IMFhirano.pdf}\n\\caption{Initial mass function (IMF) of Population III stars. The black solid line shows the Larson IMF\nadopted in the reference model, normalized to 1 in the mass range $[10-300]\\, \\rm M_\\odot$. \nGreen dashed  and orange dot-dashed lines show the analytic functions used to approximate\nthe results of \\citet{Hirano15} for $J_{\\rm LW} < 0.1$ and $>0.1$, respectively. \nIn both cases, the mass distribution is normalized to 1 in the mass range $[10-2000]\\, \\rm M_\\odot$.} \n\\label{fig:hiranoIMF} \n\\end{figure} \n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLSmdistri_testhirano.pdf}\n\\includegraphics [width=6.0cm]{aveLSzdistri_testhirano.pdf}\n\\includegraphics [width=6.0cm]{bhevo_testIMFhirano.pdf}\n\\caption{Same as Fig.~\\ref{fig:histogLS} but only for light BH seeds and \nassuming the environment-dependent\nPop~III IMF predicted by \\citet{Hirano15}. In the right panel we show the\nBH mass growth and the contribution of light and heavy seeds in 4 different realizations\nof the merger tree. The labels (b), (g), (f) and (i) are used to enable a direct comparison \nwith the results presented in Fig.~\\ref{fig:bhevo10r}.} \n\\label{fig:testhirano} \n\\end{figure*} \n\n\n\\subsection{IMF of Population III stars}\n\nFirst attempts to predict the Pop III stellar mass spectrum ab-initio, starting from cosmological\ninitial conditions, have been recently made through sophisticated numerical simulations\n\\citep{Hirano14, Hirano15}. \nAccording to \\citet{Hirano15}, Pop III stars which form in halos exposed to a LW background intensity $J_{\\rm LW}<0.1$ \nfollow a mass distribution characterized by two peaks, at $\\sim 25$ and \n$\\sim 250 \\, \\rm M_\\odot$.\nConversely, only very massive ($>100 \\, \\rm M_\\odot$) stars form when $J_{\\rm LW}>0.1$ \n as less efficient cooling causes higher gas temperature and \nlarger accretion rates (see Fig.~6 in \\citealt{Hirano15}). \n\nIn order to test the implications of this environment-dependent Pop~III IMF, we \napproximate the mass distribution found by \\citet{Hirano15} with the analytic\nfunctions shown in Fig.~\\ref{fig:hiranoIMF}, where the IMF are normalized\nto 1 in the stellar mass range $[10-2000]\\, \\rm M_\\odot$ (dashed and dot-dashed lines\nfor $J_{\\rm LW} < 0.1$ and $>0.1$, respectively). For comparison, we\nalso show the IMF adopted in the reference model (solid line). \nGiven the shape of the new distribution, we expect a larger number\nof massive Pop III remnants, leading to more frequent light BH seeds with \nmass $> 300 \\, \\rm M_\\odot$ compared to the reference model.\n\nThe resulting average mass and redshift distributions of light seeds are\nshown in the left and middle panels of Fig.~\\ref{fig:testhirano}. The two\npeaks of the mass distribution reflect the underlying Pop~III IMF. \nThe number of light BH seeds is $\\sim 10$ times larger than in the\nreference model, and $\\sim 30 \\%$ of these have a mass $> 300 \\, \\rm M_\\odot$. \nIn fact, the shape of the underlying Pop~III IMF affects the star formation\nhistory at $z > 15$ through both mechanical and chemical feedback: the larger\nnumber of stars with masses in the pair-instability SN range,\n$160 \\, \\rm M_\\odot \\lesssim m_\\ast \\lesssim 240 \\, \\rm M_\\odot$ \\citep{Heger02}, and \nabove leads to strong SN and AGN-driven outflows of metal-enriched gas out of the first mini-halos. \nThe integrated effect of this feedback-regulated star formation rate along the\nhierarchical evolution is to decrease the metallicity of gas-poor star forming\nprogenitors - favoring the formation of a larger number of Pop~III BH remnants -\nand the LW emissivity, hence the intensity of the LW background. As a result,\nthe condition $J_{\\rm LW} > J_{\\rm cr}$ is met at lower $z$ compared to the\nreference model, when most of the Ly$\\alpha$ halos have already been enriched\nabove the critical metallicity and  the formation of heavy seeds\nis suppressed in 7 out of 10 merger trees.\n\nIn these conditions, the BH mass growth at $10 \\lesssim  z \\lesssim 15$ is very sensitive to the amount \nof leftover gas from winds in progenitor systems. In the right panel of  Fig.~\\ref{fig:testhirano} we show the \nBH mass growth and the contribution of light and heavy seeds as a function of redshift for 4 different merger tree \nsimulations. In the top panels, we show the results for the same (b) and (g) \nmerger tree realizations presented in Fig.~\\ref{fig:bhevo10r}.  Despite \nno heavy seed is formed, $M_{\\rm BH} \\sim 10^9 \\, \\rm M_\\odot$ at $z \\sim 6.4$\nin simulation (b), only a factor of a few smaller than the observed value.\nAlthough the total BH mass contributed by light seeds is similar, gas accretion\nis less efficient in simulation (g) and the final BH mass is significantly smaller. \nIn the bottom panel, we show the results of two simulations where, despite a \ncomparable number of heavy seeds forms,  the\nfinal BH mass at $z \\sim 6.4$ differs by almost two orders of magnitude.\nIn simulation (f), a large number of light BH seeds forms over the redshift range\n$17 \\lesssim z \\lesssim 25$. Gas depletion in their progenitor galaxies\ndue to AGN feedback causes a lower average accretion rate at $z < 15$ and\nthe BH mass at $z = 6.4$ is only $\\sim 5 \\times 10^7 \\, \\rm M_\\odot$. On the contrary,\nthe small number of light BH seeds formed in simulation (i) at $z \\lesssim 20$\ndoes not significantly affect the gas content of progenitor galaxies and gas accretion\nat $z < 15$ can be efficient enough to form a SMBH at $z = 6.4$, with a mass consistent\nwith the data.\n\n\n\n\n\\begin{figure*}\n\\hspace{-1 cm}\n\\includegraphics [width=6.0cm]{aveLSmdistri_testdynamics.pdf}\n\\includegraphics [width=6.0cm]{aveLSzdistri_testdynamics.pdf}\n\\includegraphics [width=6.0cm]{aveBHevo_testdynamics.pdf}\n\\caption{Same as in Figs.~\\ref{fig:bhevo} and~\\ref{fig:histogLS} but assuming that\nall BH remnants of Pop III stars merge to form a single more massive BH seed.\nIn addition, in the middle panel we show the redshift distribution of light seeds with\n masses $>300$ {M$_\\odot$} \\, (azure histogram and gray data points).} \n\\label{fig:testdynamics} \n\\end{figure*} \n\n\\subsection{Dynamics of light BH seeds}\n\n\nIn the reference model, we assume that only the most massive  Pop III remnant form a light BH seed that\nsettles at the galaxy center accreting gas \nfrom the surrounding medium. \nTo test the effect of this assumption, here we investigate the opposite, extreme scenario\nand we allow all BH remnants to merge and form a single more massive \nlight BH seed that migrates at the center of the galaxy. The underlying \nassumption is that the merging timescale is shorter than the characteristic timestep\nof the simulation, and that dynamical effects, such as 3-body scattering \\citep{Miller02, Gultekin06} and gravitational recoil \n\\citep{Haiman04, Shapiro05, VolonteriRees06} are not ejecting the merging BHs. Regarding 3-body scattering, \nwe can rescale the results by \\citeauthor{Gultekin04} (\\citeyear{Gultekin04, Gultekin06}) and \\cite{Miller09}, while for the gravitational \nrecoil we can use the Monte Carlo sampling of recoil velocities in \\cite{VGD10}. In general, the potential well of the halo\nbecomes sufficiently massive to retain merging and scattering BHs only when the halo mass is $\\sim 10^7-10^8 \\, \\rm M_\\odot$. This is because most\nof the merging BHs have mass ratio between 1:6 and 1:1, where the recoil velocity is typically $>100$ km/s for random spin magnitudes and configurations. Similarly, 3-body scattering appears to cease to be effective in ejecting BHs when the escape velocity becomes $>100$ km/s. \nWe note, however, that sudden gas inflows, triggered by mergers or collimated gas streams from the cosmic web, can temporarily deepen the potential well\nand allow mergers and 3-body scattering to occur \\citep{Davies11,Lupi14}. We will in the following assume, optimistically, that all formed BHs can merge, but in reality we expect that only a fraction of them can be retained, and this fraction increases with the mass of the host halo.\n\nThe resulting mass and redshift distribution of light seeds is shown in the left and middle \npanels of Fig.~\\ref{fig:testdynamics}, respectively. As expected, the mass spectrum of\nlight seeds now extends well beyond $300 \\, \\rm M_\\odot$, the maximum BH\nremnant mass for the adopted Pop~III IMF. Less massive, more numerous, light seeds\n($\\lesssim 300 \\, \\rm M_\\odot$) form in less efficient star \nforming halos, while more massive light seeds ($> 300 \\, \\rm M_\\odot$) are the result of the \ncoalescence of several (from few to hundreds) Pop III remnants formed in \nmore efficient star forming halos. Interestingly, there is a tail of the mass distribution\nthat extends up to $\\sim 10^5 \\, \\rm M_\\odot$, showing that few light seeds may reach a\nmass comparable to that of heavy seeds. \n\nThe redshift distribution of light seeds is fairly independent of their mass, as shown\nby the two histograms  in the middle panel of Fig.~\\ref{fig:testdynamics}.\nCompared with the analogous plot for the reference model shown in Fig.~\\ref{fig:histogLS},\na much larger number of light seeds is formed. This is a consequence of the\nstronger feedback induced by more massive BHs on their host galaxy. In the shallow\npotential wells of small halos at high redshift, BH feedback is able to unbind most \n- if not all - of the gas. As a result, the ISM metallicity remains below the critical value for \na longer period of time, leading to a prolonged phase of Pop~III star and light BH seeds\nformation. \n\nThe effect on the BH mass growth rate is shown in the right panel of Fig.~\\ref{fig:testdynamics}.\nIn this case, the contribution of light seeds exceeds that of heavy seeds, which is smaller\n(by a factor $\\sim 3$) than in the reference model, and triggers a faster and more efficient growth.\nThe BH mass exceeds $\\sim 10^9 \\, \\rm M_\\odot$ at $z \\lesssim 10$ and reaches a final value\nof  $\\sim 6 \\times 10^{10} \\, \\rm M_\\odot$ at $z \\sim 6.4$, a factor of 20 larger than in the reference model.\n\n\n\n\n\n\n\\section{Conclusions} \n\\label {sec:conclusions}\n\nWe have investigated the origin of SMBHs at $z > 6$ applying a\nlargely improved version of the semi-analytical model {\\textsc{GAMETE/QSOdust}}. \nIn this work we explore the relative role of light BH seeds, formed as remnants\nof massive Pop~III stars, and heavy BH seeds, formed by the direct collapse\nof gas, in the formation pathway to the first SMBHs. \n\nTo this aim, we have implemented a physically motivated prescription to estimate\nthe cold gas mass fraction in mini-halos, taking into account molecular and metal\nfine-structure cooling and the photo-dissociation of $\\rm H_2$ in the presence of an\nexternal LW background. \nWe then follow the subsequent\nevolution of the BHs and their host galaxies along the hierarchical history of a\n$z = 6.4$ halo with a mass of $10^{13} \\, \\rm M_\\odot$.\nThe free parameters of the model, such\nas the accretion efficiency entering in the formulation of Eddington-limited\nBondi accretion, the AGN wind efficiency, the efficiency of quiescent and merger-driven\nstar formation, have been fixed to reproduce the observed properties of SDSS J1148.\nSimulating different merger trees of the same halo, we compute the intensity of the\nLW background, accounting for the contribution of stars and accreting BHs, the\nfilling factor of ionized regions, the metal and dust enrichment in and outside the\nprogenitor galaxies, to explore if and when heavy BH seeds can form in metal-poor\nLyman-$\\alpha$ halos exposed to a strong LW background. \n\nIn the reference model, where we assume that Pop~III stars form in progenitor\ngalaxies with $Z < Z_{\\rm cr} = 10^{-3.8}$ Z$_\\odot$ according to a Larson IMF in the \nmass range $10 \\, \\rm M_\\odot \\le m_\\ast \\le 300 \\, \\rm M_\\odot$, a small number of light\nBH seeds are hosted in mini-halos at $z \\gtrsim 20$ before radiative feedback is\nable to suppress $\\rm H_2$ cooling. The dominant fraction of light BH seeds form in \nLyman-$\\alpha$ cooling halos at $15 \\lesssim z \\lesssim 20$, before the intensity\nof the LW background becomes larger than $J_{\\rm cr} = 300$ allowing the direct\ncollapse of gas and the formation of heavy seeds. In these conditions, we find that\nin 9 out of 10 merger tree simulations between 3 to $\\sim 30$ heavy seeds are able to form \nbefore metals have enriched all the progenitor galaxies  to $Z \\ge Z_{\\rm cr}$ and \nlow-mass Pop~II stars form. We find that:\n\n\\begin{itemize}\n\n\\item The growth of $z > 6$ SMBHs relies\non heavy seeds. The only simulation where the interplay between chemical and \nradiative feedback effects prevents the formation of heavy seeds predicts a\nfinal BH mass of $M_{\\rm BH} < 10^6 \\, \\rm M_\\odot$.\n\n\\item The above result dramatically depends on the assumed values of $J_{\\rm cr}$\nand $Z_{\\rm cr}$. A larger value of $J_{\\rm cr}$ ($= 10^3$) or a Pop~III/Pop~II transition\ndriven by dust-cooling at a critical dust-to-gas ratio of ${\\cal D}_{\\rm cr} = 4.4 \\times 10^{-9}$\nprevents the formation of heavy seeds, hampering the mass growth of the nuclear BH\nso that its final mass at $z = 6.4$ is $M_{\\rm BH} < 10^6 \\, \\rm M_\\odot$ in all the merger tree\nsimulations.\n\n\\item The relative importance of heavy and light BH seeds depends on the adopted IMF\nof Pop~III stars, as this affects the history of cold gas along the merger tree by means of\nSN and AGN-driven winds.\n\n\\item As long as gas accretion is assumed to be Eddington-limited, the mass of individual BH \nseeds is the key condition to trigger SMBH growth. If  all BH remnants merge before \nsettling to the center of their progenitor galaxy, the mass distribution of light BH seeds \nextends to $\\sim 10^3 - 10^5 \\, \\rm M_\\odot$. In these conditions, gas accretion is so efficient \nthat by $z = 6.4$ the SMBH mass is - on average - $ >10^{10} \\, \\rm M_\\odot$ and the evolution is \ncompletely dominated by light BH seeds. \n\\end{itemize}\n\n\n\n\\begin{figure}\n\\includegraphics [width=7.5cm]{aveDCBHdens_fiducial.pdf}\n\\caption{Predicted number density of DCBHs as a function of $z$.  \nThe solid line shows the average number of all DCBHs formed in the reference model and the dot-dashed line \nshows the same quantity for real DCBH progenitors (see text). For each of these two classes, the shades span \nthe values found in different merger tree simulations. For comparison, we also show the values predicted by\nDijkstra et al. (2014, traingles) and Agarwal et al. (2014, horizontal dashed line). The latter value has been \nmultiplied by $10^{-6}$ to enable the comparison.} \n\\label{fig:DCBHdens} \n\\end{figure} \n\n\n   \nWe conclude that  the formation of a $> 10^9 \\, \\rm M_\\odot$ BH at $z > 6$ depends on a\ncomplex interplay of feedback processes, where the mass and redshift distribution\nof both light and heavy seeds have a fundamental role.  \nThe first SMBHs can grow by Eddington-limited\naccretion only if sufficiently massive BH seeds are able to form in their progenitor galaxies. This can\nbe achieved by means of  Pop~III BH remnants (light seeds) if  Pop~III stars form with $m_\\ast > 300 \\, \\rm M_\\odot$\nor if smaller mass BH remnants merge to form a single, more massive BH.\nAlternatively, even a few heavy seeds with mass $\\sim 10^5 \\, \\rm M_\\odot$ can provide the right ``head-start'', but their formation requires favourable conditions that can only be achieved if $J_{\\rm cr} \\lesssim 300$\nand $Z_{\\rm cr} \\geq 10^{-3.8}$ Z$_\\odot$. Since $J_{\\rm cr}<300$ is lower than required by 3D cosmological simulations of the collapse of primordial clouds, alternative models of direct collapse driven by dynamical processes should be kept in mind (e.g. \\citealt{LoebRasio94, EisensteinLoeb95, Begelman06, Mayer07, VB10}).\n\nIn our reference model, where the formation of a SMBH relies on heavy seeds, the  number of heavy seeds progenitors \nvaries between 3 and 27 among the different merger tree simulations, with an average number of 13.\nIf we weight these numbers by the observed comoving density of quasars at $z = 6$, $n_{\\rm SMBH} \\sim 10^{-9} \\,\\, \\rm{cMpc}^{-3}$, \nwe can predict the comoving number density of direct collapse BHs (DCBHs). This is shown in \nFig.~\\ref{fig:DCBHdens}, where we compare the results of our reference model with other studies. We find that by $z \\sim 15$ the\ncomoving number density of DCBH is $3 \\times 10^{-9} \\, \\,  {\\rm cMpc}^{-3} \\lesssim n_{\\rm DCBH} \n\\lesssim 2.7 \\times 10^{-8}  \\, \\, \\rm{cMpc}^{-3}$. We clarify that these numbers refer to heavy BH seeds progenitors of SMBHs at $z = 6$.\nIn the same reference model, a much larger population of direct collapse BHs form ($\\sim 100$ on average) which - however - end up as \nsatellites and do not directly contribute to the mass growth of the SMBH. For these enlarged population, the comoving number density\nthat we predict is $\\sim 10^{-7} \\, \\, \\rm{cMpc}^{-3}$, in very good agreement with the results of \\citet{Dijkstra14} for their fiducial model.\nA much larger value has been found by \\citet{Agarwal14}, who report $\\sim 6$ potential DCBH hosts in their 4 cMpc size simulation box \nat $z \\sim 10$, leading to an estimated comoving number density of $\\sim 0.09  \\, \\, \\rm{cMpc}^{-3}$. As already noted by \\citet{Dijkstra14},\nthe main reason for this discrepancy is that \\citet{Agarwal14} adopts a $J_{\\rm cr} = 30$. No DCBH would form in their box if \n$J_{\\rm cr} = 300$ were to be assumed (see the bottom panel of their Fig.~1). \n\nCompared to these previous analyses, our study allows to identify BH seeds that are the progenitors of the first\nSMBHs, and to study the conditions that allow these BH seeds to germinate.\n\n\n\n\n\\section*{Acknowledgments}\nWe thank the anonymous referee for useful comments and suggestions.\nThe research leading to these results has received funding from the European Research Council under the European Union's\nSeventh Framework Programme (FP/2007-2013) / ERC Grant Agreement n. 306476. \nThis work is supported in part by the Grant-in-Aid from the Ministry of Education, Culture,\nSports, Science and Technology (MEXT) of Japan (25287040 KO).\n\n\n\n\\appendix\n\n\\section{Halo gas cooling efficiency}\n\nIn each dark matter halo, the fraction of gas mass that is able to cool is set by the balance \nbetween the cooling time and the dynamical time. Here we adopt a procedure similar to\nthat presented in \\citet{M01}. \n\nWe compute the free-fall time as,\n\n", "index": 17, "text": "\\begin{equation}\nt_{\\rm ff}(r) = \\int_0^r \\frac{dr'}{\\sqrt{v^2_{\\rm e}(r')-v^2_{\\rm e}(r)}} \\left( = \\int_0^r \\frac{dr'}{v_r(r')}\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm ff}(r)=\\int_{0}^{r}\\frac{dr^{\\prime}}{\\sqrt{v^{2}_{\\rm e}(r^{\\prime})-v%&#10;^{2}_{\\rm e}(r)}}\\left(=\\int_{0}^{r}\\frac{dr^{\\prime}}{v_{r}(r^{\\prime})}%&#10;\\right),\" display=\"block\"><mrow><mrow><mrow><msub><mi>t</mi><mi>ff</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>r</mi></msubsup><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>r</mi><mo>′</mo></msup></mrow><msqrt><mrow><mrow><msubsup><mi>v</mi><mi mathvariant=\"normal\">e</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>r</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msubsup><mi>v</mi><mi mathvariant=\"normal\">e</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt></mfrac></mrow><mspace width=\"veryverythickmathspace\"/><mrow><mo>(</mo><mrow><mi/><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>r</mi></msubsup><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>r</mi><mo>′</mo></msup></mrow><mrow><msub><mi>v</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>r</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $k$ is Boltzmann's constant, $n$ is the gas number density and $\\Lambda(n, Z)$ is the density and\nmetallicity dependent cooling rate per unit volume. \n\nThe parameter $f_{\\rm cool}$ introduced in section \\ref{sec:SF} is defined as the ratio between the gas mass\nwithin a radius $r_{\\rm cool}$ such that $t_{\\rm cool}(r_{\\rm cool}) = t_{\\rm ff}(r_{\\rm cool})$ and the total gas\nmass within the virial radius. \n\nIn Lyman-$\\alpha$ halos, even in primordial conditions the gas can efficiently cool by means of H and He transitions.\nHence, we assume that in these systems $f_{\\rm cool} = 1$ and the SFR is only limited by the infall rate (see eq.~\\ref{eq:sfr})\\footnote{This condition is strictly true only at $z \\ge 9$ for halos with $T_{\\rm vir} < 5 \\times 10^5$~K.\nIn fact, above this temperature and in primordial conditions the cooling rate is dominated by free-free emission. Here\nwe assume $f_{\\rm cool} = 1$ for all Lyman-$\\alpha$ halos because most of these larger virial temperatures (mass) halos\nare already metal-enriched when they first appear along the merger tree and therefore the cooling rate is dominated by\nhighly ionized metal species \\citep{SD93}.}.\n\nIn mini-halos the cooling time\n can be longer than the free-fall time at most radii, so that $f_{\\rm cool} \\ll 1$. The \nexact value of this parameter depends on the virial temperature, redshift (hence halo mass) and metallicity of \nthe gas. The cooling rate is computed considering a simplified version of the chemical evolution model of\n\\citet{Omukai2012} that we describe below.  \\\\\n\n\\noindent\n{\\it Cooling and heating processes:}\\\\\nTo compute the cooling rate we consider the following physical processes: H Ly$\\alpha$\nemission ($\\Lambda_{\\rm Ly\\alpha}$), H$_2$ rovibrational emission ($\\Lambda_{\\rm H_2}$), and CII and OI\nfine-structure line emission ($\\Lambda_{\\rm CII}$, $\\Lambda_{\\rm OI}$). Photoelectric emission\nby dust ($\\Gamma_{\\rm PE}$) is also taken onto account as it provides an important heating process when\nthe medium is dust enriched and in the presence of a far UV (FUV) background (Wolfire et al. 1995). For\nsimplicity, we assume the same spectral shape in the Galactic ISM and we take the Habing parameter for\nthe FUV to be $G_0 = 2.9 \\times 10^{-2} J_{\\rm LW}$. Hence, the total cooling rate is computed as:\n\n", "itemtype": "equation", "pos": 72830, "prevtext": "\n\\noindent\nwhere $v_{\\rm e}$ is the escape velocity ($v_r$ is the infall velocity of a test particle at rest at $r$), \ndark matter halos are assumed to have a NFW density profile with concentration parameter $c = 4.8$,\nand the gas follows an isothermal gas density distribution\n(see eqs. 9, 18 and 21 in \\citealt{M01}). \n\nThe cooling time is defined as,\n\n", "index": 19, "text": "\\begin{equation}\nt_{\\rm cool} (r) = \\frac{3 \\, n \\, k\\, T_{\\rm vir}}{2\\, \\Lambda(n, Z)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm cool}(r)=\\frac{3\\,n\\,k\\,T_{\\rm vir}}{2\\,\\Lambda(n,Z)},\" display=\"block\"><mrow><mrow><mrow><msub><mi>t</mi><mi>cool</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><mn>3</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>k</mi></mpadded><mo>⁢</mo><msub><mi>T</mi><mi>vir</mi></msub></mrow><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Λ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>Z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\n\\noindent\n{\\it Ionization degree:}\\\\\nThe post-recombination leftover electron fraction is $y_{\\rm e, prim} \\sim 2 \\times 10^{-4}$. Following\nvirialization, the ionization degree can increase due to collisional ionization: \n\n", "itemtype": "equation", "pos": 75247, "prevtext": "\n\\noindent\nwhere $k$ is Boltzmann's constant, $n$ is the gas number density and $\\Lambda(n, Z)$ is the density and\nmetallicity dependent cooling rate per unit volume. \n\nThe parameter $f_{\\rm cool}$ introduced in section \\ref{sec:SF} is defined as the ratio between the gas mass\nwithin a radius $r_{\\rm cool}$ such that $t_{\\rm cool}(r_{\\rm cool}) = t_{\\rm ff}(r_{\\rm cool})$ and the total gas\nmass within the virial radius. \n\nIn Lyman-$\\alpha$ halos, even in primordial conditions the gas can efficiently cool by means of H and He transitions.\nHence, we assume that in these systems $f_{\\rm cool} = 1$ and the SFR is only limited by the infall rate (see eq.~\\ref{eq:sfr})\\footnote{This condition is strictly true only at $z \\ge 9$ for halos with $T_{\\rm vir} < 5 \\times 10^5$~K.\nIn fact, above this temperature and in primordial conditions the cooling rate is dominated by free-free emission. Here\nwe assume $f_{\\rm cool} = 1$ for all Lyman-$\\alpha$ halos because most of these larger virial temperatures (mass) halos\nare already metal-enriched when they first appear along the merger tree and therefore the cooling rate is dominated by\nhighly ionized metal species \\citep{SD93}.}.\n\nIn mini-halos the cooling time\n can be longer than the free-fall time at most radii, so that $f_{\\rm cool} \\ll 1$. The \nexact value of this parameter depends on the virial temperature, redshift (hence halo mass) and metallicity of \nthe gas. The cooling rate is computed considering a simplified version of the chemical evolution model of\n\\citet{Omukai2012} that we describe below.  \\\\\n\n\\noindent\n{\\it Cooling and heating processes:}\\\\\nTo compute the cooling rate we consider the following physical processes: H Ly$\\alpha$\nemission ($\\Lambda_{\\rm Ly\\alpha}$), H$_2$ rovibrational emission ($\\Lambda_{\\rm H_2}$), and CII and OI\nfine-structure line emission ($\\Lambda_{\\rm CII}$, $\\Lambda_{\\rm OI}$). Photoelectric emission\nby dust ($\\Gamma_{\\rm PE}$) is also taken onto account as it provides an important heating process when\nthe medium is dust enriched and in the presence of a far UV (FUV) background (Wolfire et al. 1995). For\nsimplicity, we assume the same spectral shape in the Galactic ISM and we take the Habing parameter for\nthe FUV to be $G_0 = 2.9 \\times 10^{-2} J_{\\rm LW}$. Hence, the total cooling rate is computed as:\n\n", "index": 21, "text": "\\begin{equation}\n\\Lambda = \\Lambda_{\\rm Ly\\alpha} + \\Lambda_{\\rm H_2} + \\Lambda_{\\rm CII} + \\Lambda_{\\rm OI} - \\Gamma_{\\rm PE}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\Lambda=\\Lambda_{\\rm Ly\\alpha}+\\Lambda_{\\rm H_{2}}+\\Lambda_{\\rm CII}+\\Lambda_{%&#10;\\rm OI}-\\Gamma_{\\rm PE}.\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Λ</mi><mo>=</mo><mrow><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mi>Ly</mi><mo>⁢</mo><mi>α</mi></mrow></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Λ</mi><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Λ</mi><mi>CII</mi></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Λ</mi><mi>OI</mi></msub></mrow><mo>-</mo><msub><mi mathvariant=\"normal\">Γ</mi><mi>PE</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nfollowed by radiative recombination:\n\n", "itemtype": "equation", "pos": 75614, "prevtext": "\n\n\\noindent\n{\\it Ionization degree:}\\\\\nThe post-recombination leftover electron fraction is $y_{\\rm e, prim} \\sim 2 \\times 10^{-4}$. Following\nvirialization, the ionization degree can increase due to collisional ionization: \n\n", "index": 23, "text": "\\begin{equation}\n\\rm H + e \\rightarrow H^{+} + 2 e\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\rm H+e\\rightarrow H^{+}+2e\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">H</mi><mo>+</mo><mi mathvariant=\"normal\">e</mi></mrow><mo>→</mo><mrow><msup><mi mathvariant=\"normal\">H</mi><mo>+</mo></msup><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">e</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nHence, the ionization fraction reaches an equilibrium value given by:\n\n", "itemtype": "equation", "pos": 75727, "prevtext": "\n\\noindent\nfollowed by radiative recombination:\n\n", "index": 25, "text": "\\begin{equation}\n\\rm H^+ + e \\rightarrow H + \\gamma.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\rm H^{+}+e\\rightarrow H+\\gamma.\" display=\"block\"><mrow><mrow><mrow><msup><mi mathvariant=\"normal\">H</mi><mo>+</mo></msup><mo>+</mo><mi mathvariant=\"normal\">e</mi></mrow><mo>→</mo><mrow><mi mathvariant=\"normal\">H</mi><mo>+</mo><mi>γ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nIn the model, we take the ionization degree to be $y_{\\rm e} = {\\rm max}(y_{\\rm e, prim}; y_{\\rm e, eq})$ and the \natomic hydrogen fraction as $y_{\\rm H} \\sim 1 -y_{\\rm e}$ because the molecular fraction is always $\\ll1$.\\\\\n\n\n\\noindent\n{\\it Molecular fraction:}\\\\\nMolecular hydrogen can form from the gas phase via the H$^-$ channel:\n\\begin{eqnarray}\n\\rm H + e \\rightarrow H^- + \\gamma \\\\\n\\rm H^- +H \\rightarrow H_2 + e\n\\end{eqnarray}\n\\noindent\nor on the surface of dust grains. In one free-fall time, the H$_2$ fraction formed can be approximated as:\n\n", "itemtype": "equation", "pos": 75875, "prevtext": "\n\\noindent\nHence, the ionization fraction reaches an equilibrium value given by:\n\n", "index": 27, "text": "\\begin{equation}\ny_{\\rm e, eq} = \\frac{k_{\\rm ion}}{k_{\\rm ion}+k_{\\rm rec}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"y_{\\rm e,eq}=\\frac{k_{\\rm ion}}{k_{\\rm ion}+k_{\\rm rec}}.\" display=\"block\"><mrow><mrow><msub><mi>y</mi><mrow><mi mathvariant=\"normal\">e</mi><mo>,</mo><mi>eq</mi></mrow></msub><mo>=</mo><mfrac><msub><mi>k</mi><mi>ion</mi></msub><mrow><msub><mi>k</mi><mi>ion</mi></msub><mo>+</mo><msub><mi>k</mi><mi>rec</mi></msub></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $k_{\\rm H^-, form} \\, n_{\\rm H} \\, n_{\\rm e}$ is the $\\rm H_2$ formation rate via  the H$^-$ channel, $k_{\\rm dust, form}$ is the $\\rm H_2$\nformation rate on dust grains, and the recombination time is:\n\n", "itemtype": "equation", "pos": 76530, "prevtext": "\n\\noindent\nIn the model, we take the ionization degree to be $y_{\\rm e} = {\\rm max}(y_{\\rm e, prim}; y_{\\rm e, eq})$ and the \natomic hydrogen fraction as $y_{\\rm H} \\sim 1 -y_{\\rm e}$ because the molecular fraction is always $\\ll1$.\\\\\n\n\n\\noindent\n{\\it Molecular fraction:}\\\\\nMolecular hydrogen can form from the gas phase via the H$^-$ channel:\n\\begin{eqnarray}\n\\rm H + e \\rightarrow H^- + \\gamma \\\\\n\\rm H^- +H \\rightarrow H_2 + e\n\\end{eqnarray}\n\\noindent\nor on the surface of dust grains. In one free-fall time, the H$_2$ fraction formed can be approximated as:\n\n", "index": 29, "text": "\\begin{equation}\ny_{\\rm H_2, form} =\\frac{k_{\\rm H^-, form}}{k_{\\rm rec}} \\, {\\rm ln} \\left (1+\\frac{t_{\\rm ff}}{t_{\\rm rec}}\\right) + k_{\\rm dust, form} \\, y_{\\rm H} \\, n \\, t_{\\rm ff},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"y_{\\rm H_{2},form}=\\frac{k_{\\rm H^{-},form}}{k_{\\rm rec}}\\,{\\rm ln}\\left(1+%&#10;\\frac{t_{\\rm ff}}{t_{\\rm rec}}\\right)+k_{\\rm dust,form}\\,y_{\\rm H}\\,n\\,t_{\\rm&#10;ff},\" display=\"block\"><mrow><mrow><msub><mi>y</mi><mrow><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo>,</mo><mi>form</mi></mrow></msub><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mfrac><msub><mi>k</mi><mrow><msup><mi mathvariant=\"normal\">H</mi><mo>-</mo></msup><mo>,</mo><mi>form</mi></mrow></msub><msub><mi>k</mi><mi>rec</mi></msub></mfrac></mpadded><mo>⁢</mo><mi>ln</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><msub><mi>t</mi><mi>ff</mi></msub><msub><mi>t</mi><mi>rec</mi></msub></mfrac></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>k</mi><mrow><mi>dust</mi><mo>,</mo><mi>form</mi></mrow></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>y</mi><mi mathvariant=\"normal\">H</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><msub><mi>t</mi><mi>ff</mi></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nIn the presence of a LW background, the $\\rm H_2$ fraction reaches an equlibrium value given by \\citep{ag89}:\n\n", "itemtype": "equation", "pos": 76950, "prevtext": "\n\\noindent\nwhere $k_{\\rm H^-, form} \\, n_{\\rm H} \\, n_{\\rm e}$ is the $\\rm H_2$ formation rate via  the H$^-$ channel, $k_{\\rm dust, form}$ is the $\\rm H_2$\nformation rate on dust grains, and the recombination time is:\n\n", "index": 31, "text": "\\begin{equation}\nt_{\\rm rec} = \\frac{1}{ k_{\\rm rec} \\, y_{\\rm e} \\, n}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm rec}=\\frac{1}{k_{\\rm rec}\\,y_{\\rm e}\\,n}.\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>rec</mi></msub><mo>=</mo><mfrac><mn>1</mn><mrow><mpadded width=\"+1.7pt\"><msub><mi>k</mi><mi>rec</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>y</mi><mi mathvariant=\"normal\">e</mi></msub></mpadded><mo>⁢</mo><mi>n</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nwhere $k_{\\rm dis}$ is the $\\rm H_2$ dissociation coefficient and it is calculated considering the $\\rm H_2$ self-shielding factor as is \n\\citet{WH11}. In the model, we take the $\\rm H_2$ fraction to be $y_{\\rm H_2} = {\\rm min} (y_{\\rm H_2, form}; y_{\\rm H_2, eq})$. \\\\\n\n\\noindent\n{\\it Metal fractions:}\\\\\nFor simplicity, at each given metallicity $Z$ all the carbon atoms are assumed to be in CII and the oxygen atoms in OI,\nwith an elemental abundance given by:\n\n", "itemtype": "equation", "pos": 77158, "prevtext": "\n\\noindent\nIn the presence of a LW background, the $\\rm H_2$ fraction reaches an equlibrium value given by \\citep{ag89}:\n\n", "index": 33, "text": "\\begin{equation}\ny_{\\rm H_2, eq}  = \\left(k_{\\rm H^-, form} \\, y_{\\rm e} + k_{\\rm dust, form}\\right)\\, \\frac{y_{\\rm H} \\, n}{k_{\\rm dis}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"y_{\\rm H_{2},eq}=\\left(k_{\\rm H^{-},form}\\,y_{\\rm e}+k_{\\rm dust,form}\\right)%&#10;\\,\\frac{y_{\\rm H}\\,n}{k_{\\rm dis}},\" display=\"block\"><mrow><mrow><msub><mi>y</mi><mrow><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo>,</mo><mi>eq</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>(</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>k</mi><mrow><msup><mi mathvariant=\"normal\">H</mi><mo>-</mo></msup><mo>,</mo><mi>form</mi></mrow></msub></mpadded><mo>⁢</mo><msub><mi>y</mi><mi mathvariant=\"normal\">e</mi></msub></mrow><mo>+</mo><msub><mi>k</mi><mrow><mi>dust</mi><mo>,</mo><mi>form</mi></mrow></msub></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msub><mi>y</mi><mi mathvariant=\"normal\">H</mi></msub></mpadded><mo>⁢</mo><mi>n</mi></mrow><msub><mi>k</mi><mi>dis</mi></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\nWhen dust grains are present, we account for partial depletion of these two elements on dust grains and we assume\nan elemental fraction of \\citep{Pollack94}:\n\n", "itemtype": "equation", "pos": 77786, "prevtext": "\n\\noindent\nwhere $k_{\\rm dis}$ is the $\\rm H_2$ dissociation coefficient and it is calculated considering the $\\rm H_2$ self-shielding factor as is \n\\citet{WH11}. In the model, we take the $\\rm H_2$ fraction to be $y_{\\rm H_2} = {\\rm min} (y_{\\rm H_2, form}; y_{\\rm H_2, eq})$. \\\\\n\n\\noindent\n{\\it Metal fractions:}\\\\\nFor simplicity, at each given metallicity $Z$ all the carbon atoms are assumed to be in CII and the oxygen atoms in OI,\nwith an elemental abundance given by:\n\n", "index": 35, "text": "\\begin{equation}\ny_{\\rm CII} = 3.97 \\times 10^{-4} \\, \\frac{Z}{\\rm Z_\\odot} \\,\\,\\,\\,\\,\\,\\,\\,\\,\\, y_{\\rm OI} = 8.49 \\times 10^{-4}  \\, \\frac{Z}{\\rm Z_\\odot}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"y_{\\rm CII}=3.97\\times 10^{-4}\\,\\frac{Z}{\\rm Z_{\\odot}}\\,\\,\\,\\,\\,\\,\\,\\,\\,\\,y_{%&#10;\\rm OI}=8.49\\times 10^{-4}\\,\\frac{Z}{\\rm Z_{\\odot}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>y</mi><mi>CII</mi></msub><mo>=</mo><mrow><mrow><mn>3.97</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>4</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><mfrac><mi>Z</mi><msub><mi mathvariant=\"normal\">Z</mi><mo>⊙</mo></msub></mfrac></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">   </mo><mrow><msub><mi>y</mi><mi>OI</mi></msub><mo>=</mo><mrow><mrow><mn>8.49</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>4</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><mfrac><mi>Z</mi><msub><mi mathvariant=\"normal\">Z</mi><mo>⊙</mo></msub></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07915.tex", "nexttext": "\n\\noindent\n\\\\\n\nUsing the above prescription we run a large set of models, changing the virial temperature, redshift, gas metallicity, and the value of the external\nLW background, and we compute the corresponding $f_{\\rm cool}$. The results are summarized in Figs.~\\ref{fig:A1}-\\ref{fig:A4}. When $Z = 0$,\n$f_{\\rm cool}$ is a strong function of $T_{\\rm vir}$. In the absence of a LW background (see Fig.\\ref{fig:A1}), $f_{\\rm cool}$ drops from $\\sim 1$\nto $\\sim 0.1$ in the temperature range $8000~{\\rm K} \\le T_{\\rm vir} < 10^4~{\\rm K}$, followed by a smoother decline to $\\sim 10^{-2}$ at \n$T_{\\rm vir} \\sim 10^3~{\\rm K}$. Even in these favourable conditions (no $\\rm H_2$ dissociation), for a fixed $T_{\\rm vir}$ \n$f_{\\rm cool}$ strongly depends on redshift. This reflects the density dependence of the cooling rate, which - for the same physical\nconditions - leads to a shorter cooling time at high redshift. This result holds even when the gas metallicity is $Z > 0$. Significant deviations\nfrom the primordial case require a metallicity of $Z \\ge 0.1$ Z$_{\\odot}$ at $z \\gtrsim 20$, of $Z \\ge 0.5$ Z$_\\odot$ at $10 \\lesssim z \\lesssim 15$,\nof $Z \\ge$ Z$_\\odot$ at $6 \\lesssim z \\lesssim 8$. Finally at $z < 6$ we find that - independently of the gas metallicity - gas cooling in mini-halos is suppressed.\n\nFigs.\\ref{fig:A2}-\\ref{fig:A4} show how the above results change when the intensity of the LW background ranges between $1 \\le J_{\\rm LW} \\le 10^2$. \nAs expected, the largest effect is in the behaviour of the $Z < 0.1$ Z$_\\odot$ gas, which can cool only if $J_{\\rm LW} \\lesssim 1$ and $z \\gtrsim 20$.\n \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{J0vsTdust.pdf}\n\\caption{The mass fraction of gas that is able to cool in one free-fall time, $f_{\\rm cool}$ as a function of halo virial\ntemperature for $J_{\\rm LW}=0$. Each line represents a fixed gas metallicity: $Z = 0$ (black), $10^{-2}$ (violet), $10^{-1.5}$ (blue), $10^{-1}$ (green), \n$10^{-0.5}$ (red), $1$ (yellow), in solar units. Here we consider the presence of dust grains (see text). Different panels are for \ndifferent redshift, from $z=25$ to $z=6$, as labelled in the figure.}\n\\label{fig:A1} \n\\end{figure} \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{J1vsTdust.pdf}\n\\caption{Same as Fig.~\\ref{fig:A1} but for $J_{\\rm LW}=1$.}\n\\label{fig:A2} \n\\end{figure} \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{J10vsTdust.pdf}\n\\caption{Same as Fig.~\\ref{fig:A1} but for $J_{\\rm LW}=10$.}\n\\label{fig:A3} \n\\end{figure} \n\n\n\n\n\\begin{figure}\n\\includegraphics [width=8.0cm]{J100vsTdust.pdf}\n\\caption{Same as Fig.~\\ref{fig:A1} but for $J_{\\rm LW}=100$.}\n\\label{fig:A4} \n\\end{figure} \n\n\n\n\n\n\\bibliography{biblioTest}\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": 78126, "prevtext": "\n\\noindent\nWhen dust grains are present, we account for partial depletion of these two elements on dust grains and we assume\nan elemental fraction of \\citep{Pollack94}:\n\n", "index": 37, "text": "\\begin{equation}\ny_{\\rm CII} = 0.93 \\times 10^{-4} \\, \\frac{Z}{\\rm Z_\\odot} \\,\\,\\,\\,\\,\\,\\,\\,\\,\\, y_{\\rm OI} = 3.57 \\times 10^{-4}  \\, \\frac{Z}{\\rm Z_\\odot}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"y_{\\rm CII}=0.93\\times 10^{-4}\\,\\frac{Z}{\\rm Z_{\\odot}}\\,\\,\\,\\,\\,\\,\\,\\,\\,\\,y_{%&#10;\\rm OI}=3.57\\times 10^{-4}\\,\\frac{Z}{\\rm Z_{\\odot}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>y</mi><mi>CII</mi></msub><mo>=</mo><mrow><mrow><mn>0.93</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>4</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><mfrac><mi>Z</mi><msub><mi mathvariant=\"normal\">Z</mi><mo>⊙</mo></msub></mfrac></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">   </mo><mrow><msub><mi>y</mi><mi>OI</mi></msub><mo>=</mo><mrow><mrow><mn>3.57</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>4</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><mfrac><mi>Z</mi><msub><mi mathvariant=\"normal\">Z</mi><mo>⊙</mo></msub></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]