[{"file": "1601.00053.tex", "nexttext": "\nor in shorter notation (we will use onwards)\n\n", "itemtype": "equation", "pos": 14084, "prevtext": "\n\n\\title{Efficient Symmetrized DMRG Algorithm for Low-lying Excited States of Conjugated Carbon Systems: Application to Coronene, Ovalene and 1,12-Benzoperylene}\n\n\\date{\\today}\n\n\\author{Suryoday Prodhan}\n\\email[Electronic mail: ]{suryodayp@sscu.iisc.ernet.in}\n\\affiliation{Solid State and Structural Chemistry Unit, Indian Institute of Science, Bangalore-560012, India.}\n\\author{Sumit Mazumdar}\n\\email[Electronic mail: ]{sumit@physics.arizona.edu}\n\\affiliation{Department of Physics, University of Arizona, Tucson, Arizona 85721, USA.}\n\\affiliation{College of Optical Sciences, University of Arizona, Tucson, Arizona 85721, USA.}\n\\author{S. Ramasesha}\n\\email[Electronic mail: ]{ramasesh@sscu.iisc.ernet.in}\n\\affiliation{Solid State and Structural Chemistry Unit, Indian Institute of Science, Bangalore-560012, India.}\n\n\\begin{abstract}\n\nSymmetry adapted density matrix renormalization group (SDMRG) technique has been an efficient method for studying low-lying eigenstates in one- and quasi-one\ndimensional electronic systems. However, SDMRG method had bottlenecks involving construction of linearly independent symmetry adapted basis states as the symmetry\nmatrices in the DMRG basis were not sparse. We have developed a modified algorithm to overcome this bottleneck. The new method incorporates end-to-end interchange\nsymmetry $(C_2)$, electron-hole symmetry $(J)$ and parity symmetry $(P)$ in these calculations. The one-to-one correspondence between direct-product basis states\nin the DMRG Hilbert space for these symmetry operations renders the symmetry matrices in the new basis with maximum sparseness, just one non-zero matrix element per\nrow. Using methods similar to those employed in exact diagonalization technique for Pariser-Parr-Pople (PPP) models, developed in the eighties, it is possible to\nconstruct orthogonal SDMRG basis states while bypassing the slow step of Gram-Schmidt orthonormalization procedure. The method together with the PPP model which\nincorporates long-range electronic correlations is employed to study the correlated excited state spectrum of coronene, substituted coronene, ovalene and\n1,12-benzoperylene; all these systems can be viewed as graphene dots. It is known that in linear polyenes the correlation parameters of the model Hamiltonian determine\nthe ordering of the lowest one-photon, two-photon and triplet states, which are experimentally important. In the systems we have studied, the correlation parameters\nfor all the orbitals of the model are same, however, the ordering of the important states is very different in these systems. This underlines the importance of the\ntopology of the hopping term in the PPP model for molecules. We also discuss in detail the properties of these important states in the molecules we have studied.\nThe properties include bond orders, spin density distribution in the triplet state and transition dipole moment for the low-lying one-photon states from the ground\nstate. Besides, the exciton binding energies and charge gaps are also reported for these systems.\n\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\nSuccessful exfoliation of a single atomic layer of graphene from graphite crystal has led to an explosion of research,  \nboth experimental and theoretical, in the area of graphene and related systems. A sheet of carbon atoms, arranged in honeycomb structure can be assumed to be the \nparent structure from which carbon allotropes like carbon nanotubes and graphite can be constructed. Each of the carbon atoms in graphene being $sp^2$-hybridized \nare $\\sigma$-bonded with three nearest neighbors while the $2p_z$ orbital, perpendicular to the molecular plain provides the conjugation network. The completely \nfilled $\\sigma$-band lies deep down in energy and primarily renders stability to the structure. On the other hand, the half filled $\\pi$-band, due to the overlap \nof the $2p_z$ orbitals, is mostly responsible for fascinating properties like linear dispersion of electronic energy band near the vertices of the Brillouin zone \nleading to formation of Dirac cones. Fractional quantum Hall effect at room temperature and tunneling through classically forbidden region exhibiting Klein paradox\nare consequences of the dispersion \\cite{castro-neto}. \n\nBeing a $\\pi$-conjugated system, electron-electron correlation should play an important role in the physics of this two-dimensional carbon array, although the \nstrength of correlation may get diminished from well-known $\\pi$-conjugated systems like polyenes, linear polyacenes or carbon nanotubes due to higher dimensionality.\nTight-binding calculations of graphene without explicitly considering the electron-electron repulsion provides sufficiently accurate ground state description \n\\cite{wallace}, yet, ignoring explicit electron correlations has been criticized recently. On the contrary, organic polyene and polyacene systems, which are quasi-one \ndimensional, have been well studied in the long-ranged Pariser-Parr-Pople (PPP) model and the effect of electron-electron correlation is found to be qualitatively \nsignificant. The ordering of excited states in polyenes differ from single CI calculations and it provides an explanation of the optical spectra in these systems \n\\cite{schulten-cpl,*tavan-prb, ramasesha-prb, *ramasesha-jcp}. Correlation also plays a significant role in dynamical properties of polyenes; observation of \nelectroluminescence efficiency which is far in excess of the upper bound placed by the spin statistics, gets resolved only after taking explicit electron correlations \nin account \\cite{kunj-nature,*shuai-prl}. Crossover of the dipole allowed or one-photon state $(1B_u)$ and the dark two-photon state $(2A_g)$ in polyacene series with \nincreasing chain length, is observed in the PPP model calculations and agrees well with experiments \\cite{raghu-prb}. Correlated electronic calculations even support \nthe higher optical gaps observed in carbon nanotubes with different diameters, contrary to tight binding calculations \\cite{sumit-prl, *spataru-prl, *chang-prl}. The \neffect of an additional dimension on the correlation effect, therefore, is worthwhile investigating starting from systems such as polycyclic peri-condensed acenes \n(graphene nano-discs), which resemble closely to two-dimensional graphene system.\n\nWhile a number of optical studies have been carried out on polynuclear aromatic hydrocarbons \\cite{patter, *bowen, *stephens, *dawson, *tanaka, *aihara, *clar, \n*ehrenfreund, *ruiterkamp, *itoh, *abouaf, *fawcett}, most of the theoretical studies are either in the non-interacting limit or approximating the electron repulsion \nvia a mean field. Moffitt and Coulson calculated the bond order in coronene exploiting both H\\\"{u}ckel's tight binding method and valence bond method without considering \nhigh energy ionic structures \\cite{moffitt} while Pritchard and Sumner calculated the ground state wavefunction and bond order for coronene and ovalene using \nself-consistent molecular orbital theory \\cite{pritchard, *hummel}. Hummel and Ruedenberg also used similar techniques to study other large polyaromatic hydrocarbons. \nA number of electronic structure calculations of these polycyclic compounds and their ions, employing density functional theory (DFT) and its time-dependent variant \n(TDDFT) have been reported \\cite{hammonds, *weisman, *birer, *malloci}. The accuracy of these calculations depend upon the reliability of the functional form of the \nexchange correlation potential which still is not beyond doubt for strongly correlated systems. Furthermore, implementation of the TDDFT method considers only single \nparticle-hole excitations which lacks the desired accuracy. In recent past, excited state ordering in some of these molecules were studied using multiple reference \nconfiguration interaction (MRCI) approach, which considers upto quadruple excitations of each targeted state \\cite{sumit-jpc}. The theoretical predictions are in \nagreement with the optical and two-photon absorption data. Another study has speculated the effect of different molecular geometries over the ordering of excited states \nin polynuclear hydrocarbons \\cite{sumit-jcp, *cocchi-jpca}. While the Hartree-Fock semiemperical calculations are oversimplified, the accuracy of the other method used \nis still dubious. This problem can be overcome by exact diagonalization technique in full Hilbert space, though the size of the Hilbert space increases exponentially \nwith system size and makes it computationally expensive even for moderate-sized systems. \n\nThe density matrix renormalization group method (DMRG), put forward by White \\cite{white-prl, *white-prb}, is a well-accepted\nmethod for calculating low-lying states of one and quasi-one dimensional systems. Ramasesha et al. have successfully implemented spatial and discrete symmetries in \nDMRG to target low-lying states in specific symmetry subspaces \\cite{rama-prb-dmrg,raghu-prb}. In this study, we have employed a new and highly accurate DMRG algorithm \nfor utilizing end-to-end interchange symmetry $(C_2)$, electron-hole symmetry $(J)$ and spin-flip or parity symmetry $(P)$. The advantage of this algorithm over the\nprevious symmetrized DMRG method is that the symmetry operators can be expressed as highly sparse matrices with only one nonzero element per row. This allows \nrepresenting the symmetry operators by vectors of the same dimension as of the DMRG Hilbert space. Hence it is possible to employ very large DMRG cut-offs in the new\nsymmetry adaptation algorithm. We have used this new algorithm to calculate the ground state, lowest-lying two-photon and one-photon states in $M_S=0$ sector along with\na few low-lying triplet states in $M_S=1$ sector for coronene, ovalene, 1,12-benzoperylene and substituted coronene. Notably, coronene has $D_{6h}$ symmetry, while the \nother three are of lower symmetry groups; nonetheless, in our study, we have considered only one $C_2$ symmetry axis in all the molecules. We have also characterized these \nstates by calculating bond orders along with the spin density at different sites (in $M_S=1$ sector). Charge gaps and exciton binding energies for coronene, ovalene and \n1,12-benzoperylene are also mentioned here.\n\nThe paper is organized as follows. In the next section, we have given an account of the modified algorithm and compared it with exact calculations for $16$-site polyene \nchain and tetracene with $18$ $p_z$-orbitals in conjugation. In section III, we have discussed our results for coronene, ovalene, 1,12-benzoperylene and substituted \ncoronene. In the last section we have summarized our study and concluded.\n\n\\section{Methodology}\n\n\\subsection{Modified Algorithm For Symmetry Adaptation}\n\nThe DMRG procedure is a truncated Hilbert space algorithm which adopts iterative block-building scheme for calculating low-lying eigenstates of large one or quasi-one \ndimensional Hamiltonians \\cite{white-prl,schollwock}. The system block or left block (L) along with the environment block, also denoted as right block (R) are linearly \ngrown through addition of one new site to each block per iteration and these two together form the superblock which corresponds to the physical system to be studied. In\nthe infinite DMRG algorithm, superblock of size $2l$ consists of system and environment blocks of same size $(l)$. The reduced density matrix of the system (environment)\nis generated from low-lying eigenstates of the superblock by tracing over the environment (system) states. Matrix elements of the reduced density matrix of the system \n(environment) are represented by $\\rho_{m,m'}=\\sum_{n} \\psi^{}_{m,n} \\psi^{\\ast}_{m',n}$, where $m,m'$ are system (environment) states while $n$ are environment (system) \nstates. Reduced density matrices for both the system and environment are diagonalized and $M^{l}$ density matrix eigenstates (DME) with highest eigenvalues $(\\{\\mu_L\\}\n\\mbox{for system and } \\{\\mu_R\\} \\mbox{for environment})$ are stored as column vectors of a  $M^{l-1} d_{\\sigma} \\times M^{l}$ matrix, where $M^{l-1}$ is the number of \ntruncated reduced density matrix eigenstates retained at $(l-1)$-th iteration and $d_{\\sigma}$ is the dimension of the Fock space of the newly added site in $l$-th \niteration. The Hamiltonian and site operators of the newly generated blocks are constructed in the basis $\\mu^{l-1} \\sigma$ and then renormalized using the $M^{l-1} \nd_{\\sigma} \\times M^{l}$ matrix. Further addition of two new sites gives a system of $2l+2$ sites, whose basis $|\\mu_L^{l} \\sigma_i \\sigma_{i'} \\mu_R^{l} \\rangle$ is \ngenerated by direct product of $|\\mu_L^l\\rangle$ of the system block, $|\\mu_R^l\\rangle$ of the environment block with $|\\sigma_{i} \\rangle$ and $|\\sigma_{i'} \\rangle$ of \nthe newly added sites to the left and right blocks respectively. The Hamiltonian for the $2l+2$ sites system is formed in this direct product space and diagonalized to get\nthe energy eigenstates, which are utilized for the next iteration. In case of systems with finite size ${N}$, finite DMRG algorithm enhances the accuracy in eigenstate \ncalculation; infinite algorithm is employed starting from a small system until the desired superblock size is reached and then sweeping over the superblock is applied by \nchanging the system and environment sizes, keeping the superblock size fixed. The basis at a step of the finite DMRG sweeping can be represented by $|\\mu_L^{l} \\sigma_i \n\\sigma_{i'} \\mu_R^{N-l+2} \\rangle$, where $l$ can vary between $1$ and $N-3$. Once the size of the system (environment) block reaches its maximum, the environment (system)\nblock starts to grow at the expense of the other block. A complete sweep consists of expansion of both blocks to their maximum and returning back to the block size of the \nfinal infinite DMRG step.\n\nThe symmetry elements considered in our modified algorithm are same as in the work by Ramasesha et al.\\cite{rama-prb-dmrg}. The $C_2$ symmetry about an axis perpendicular\nto the plane of the molecule corresponds to the end-to-end interchange of the superblock with a phase factor: \n\n", "index": 1, "text": "\\begin{equation*}\n\\hat{C}_2 |\\mu_L^{l} \\sigma_i \\sigma_{i'} \\mu_R^{l} \\rangle = (-1)^\\gamma |\\mu_R^{l} \\sigma_{i'} \\sigma_{i} \\mu_L^{l} \\rangle \n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\hat{C}_{2}|\\mu_{L}^{l}\\sigma_{i}\\sigma_{i^{\\prime}}\\mu_{R}^{l}\\rangle=(-1)^{%&#10;\\gamma}|\\mu_{R}^{l}\\sigma_{i^{\\prime}}\\sigma_{i}\\mu_{L}^{l}\\rangle\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msubsup><mi>μ</mi><mi>L</mi><mi>l</mi></msubsup><mo>⁢</mo><msub><mi>σ</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>σ</mi><msup><mi>i</mi><mo>′</mo></msup></msub><mo>⁢</mo><msubsup><mi>μ</mi><mi>R</mi><mi>l</mi></msubsup></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mi>γ</mi></msup><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msubsup><mi>μ</mi><mi>R</mi><mi>l</mi></msubsup><mo>⁢</mo><msub><mi>σ</mi><msup><mi>i</mi><mo>′</mo></msup></msub><mo>⁢</mo><msub><mi>σ</mi><mi>i</mi></msub><mo>⁢</mo><msubsup><mi>μ</mi><mi>L</mi><mi>l</mi></msubsup></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\ni.e. the system and environment blocks interchange their density matrix eigenstates while the two newly added sites also interchange their Fock states. $n_{\\mu}, \nn_{\\sigma}, n_{\\sigma{'}} \\mbox{ and } n_{\\mu{'}}$ are the occupancies in the system block, environment block and in the two newly added sites. As the interchange\nshould not affect the superblock Hilbert space, system and environment blocks should have same density matrix eigenspaces. In other words, employing $C_2$ symmetry \napproximately halves the effective size of the superblock Hilbert space beside reducing the computational expense by avoiding environment block calculations, at \nevery infinite DMRG step and at the last step of the finite DMRG iteration. In this symmetry operation, each DMRG basis state is carried over to only one unique \nDMRG basis state, with a phase of $\\pm 1$. Thus the $C_2$ symmetry operation can be stored as a column vector with entry $\\pm j_k$, resulting from $C_2$ operation on \nthe state $k$.\n\nThe Hamiltonian of a half-filled bipartite system conserves electron-hole symmetry $(J)$, where interchanging the creation and annihilation operators at each lattice \nsites with an associated phase factor keeps the Hamiltonian invariant. On application of this symmetry element, Fock states of a single site transforms in the \nfollowing way: \n\n", "itemtype": "equation", "pos": 14290, "prevtext": "\nor in shorter notation (we will use onwards)\n\n", "index": 3, "text": "\\begin{equation*}\n\\begin{split}\n\\hat{C}_2 |\\mu \\sigma \\sigma{'} \\mu{'}\\rangle = &(-1)^{\\gamma} |\\mu{'} \\sigma{'} \\sigma \\mu \\rangle  \\\\ \n\\gamma=n_{\\mu}(n_{\\sigma} + n_{\\sigma{'}} + n_{\\mu{'}} &)+ n_{\\sigma}(n_{\\sigma{'}} + n_{\\mu{'}} ) + n_{\\sigma{'}}n_{\\mu{'}}\n\\end{split}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\hat{C}_{2}|\\mu\\sigma\\sigma{{}^{\\prime}}\\mu{{}^{%&#10;\\prime}}\\rangle=&amp;\\displaystyle(-1)^{\\gamma}|\\mu{{}^{\\prime}}\\sigma{{}^{\\prime}%&#10;}\\sigma\\mu\\rangle\\\\&#10;\\displaystyle\\gamma=n_{\\mu}(n_{\\sigma}+n_{\\sigma{{}^{\\prime}}}+n_{\\mu{{}^{%&#10;\\prime}}}&amp;\\displaystyle)+n_{\\sigma}(n_{\\sigma{{}^{\\prime}}}+n_{\\mu{{}^{\\prime}%&#10;}})+n_{\\sigma{{}^{\\prime}}}n_{\\mu{{}^{\\prime}}}\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msub><mo stretchy=\"false\">|</mo><mi>μ</mi><mi>σ</mi><mi>σ</mi><mmultiscripts><mi>μ</mi><mprescripts/><none/><mo>′</mo></mmultiscripts><mmultiscripts><mo stretchy=\"false\">⟩</mo><mprescripts/><none/><mo>′</mo></mmultiscripts><mo>=</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mi>γ</mi></msup><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mi>μ</mi><mo>⁢</mo><mmultiscripts><mi>σ</mi><mprescripts/><none/><mo>′</mo></mmultiscripts><mo>⁢</mo><mmultiscripts><mi>σ</mi><mprescripts/><none/><mo>′</mo></mmultiscripts><mo>⁢</mo><mi>μ</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>γ</mi><mo>=</mo><msub><mi>n</mi><mi>μ</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>n</mi><mrow><mi>σ</mi><msup><mi/><mo>′</mo></msup></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mi>μ</mi><msup><mi/><mo>′</mo></msup></mrow></msub></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mo stretchy=\"false\">)</mo><mo>+</mo><mi>n</mi><msub><mi/><mi>σ</mi></msub><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mrow><mi>σ</mi><msup><mi/><mo>′</mo></msup></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mi>μ</mi><msup><mi/><mo>′</mo></msup></mrow></msub><mo stretchy=\"false\">)</mo><mo>+</mo><mi>n</mi><msub><mi/><mrow><mi>σ</mi><msup><mi/><mo>′</mo></msup></mrow></msub><mi>n</mi><msub><mi/><mrow><mi>μ</mi><msup><mi/><mo>′</mo></msup></mrow></msub></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nwhere $\\eta_i$ is $1$ if `i' belongs to A-sublattice and $0$ if it belongs to B-sublattice.\n\nThe result of parity or spin-flip symmetry (P) which flips the spin at each site is given by the following:\n\n", "itemtype": "equation", "pos": 15931, "prevtext": "\n\\noindent\ni.e. the system and environment blocks interchange their density matrix eigenstates while the two newly added sites also interchange their Fock states. $n_{\\mu}, \nn_{\\sigma}, n_{\\sigma{'}} \\mbox{ and } n_{\\mu{'}}$ are the occupancies in the system block, environment block and in the two newly added sites. As the interchange\nshould not affect the superblock Hilbert space, system and environment blocks should have same density matrix eigenspaces. In other words, employing $C_2$ symmetry \napproximately halves the effective size of the superblock Hilbert space beside reducing the computational expense by avoiding environment block calculations, at \nevery infinite DMRG step and at the last step of the finite DMRG iteration. In this symmetry operation, each DMRG basis state is carried over to only one unique \nDMRG basis state, with a phase of $\\pm 1$. Thus the $C_2$ symmetry operation can be stored as a column vector with entry $\\pm j_k$, resulting from $C_2$ operation on \nthe state $k$.\n\nThe Hamiltonian of a half-filled bipartite system conserves electron-hole symmetry $(J)$, where interchanging the creation and annihilation operators at each lattice \nsites with an associated phase factor keeps the Hamiltonian invariant. On application of this symmetry element, Fock states of a single site transforms in the \nfollowing way: \n\n", "index": 5, "text": "\\begin{equation*}\n\\begin{split}\n\\hat{J}_i|0\\rangle &= |\\uparrow \\downarrow \\rangle  \\\\\n\\hat{J}_i|\\uparrow \\downarrow \\rangle &= -|0 \\rangle\n\\end{split}\n\\qquad\\qquad\n\\begin{split}\n\\hat{J}_i|\\uparrow \\rangle &= (-1)^{\\eta_i}|\\uparrow \\rangle \\\\\n\\hat{J}_i|\\downarrow \\rangle &= (-1)^{\\eta_i}|\\downarrow \\rangle  \n\\end{split}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\hat{J}_{i}|0\\rangle&amp;\\displaystyle=|\\uparrow%&#10;\\downarrow\\rangle\\\\&#10;\\displaystyle\\hat{J}_{i}|\\uparrow\\downarrow\\rangle&amp;\\displaystyle=-|0\\rangle%&#10;\\end{split}\\qquad\\qquad\\begin{split}\\displaystyle\\hat{J}_{i}|\\uparrow\\rangle&amp;%&#10;\\displaystyle=(-1)^{\\eta_{i}}|\\uparrow\\rangle\\\\&#10;\\displaystyle\\hat{J}_{i}|\\downarrow\\rangle&amp;\\displaystyle=(-1)^{\\eta_{i}}|%&#10;\\downarrow\\rangle\\end{split}\" display=\"block\"><mrow><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mo>=</mo><mo stretchy=\"false\">|</mo><mo>↑</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mo>↑</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mo>-</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mtd></mtr></mtable><mo mathvariant=\"italic\" separator=\"true\">    </mo><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↑</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><msub><mi>η</mi><mi>i</mi></msub></msup><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↑</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><msub><mi>η</mi><mi>i</mi></msub></msup><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mtd></mtr></mtable></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nNon-relativistic Hamiltonians remain invariant under parity symmetry. This symmetry can only be employed in $M_S=0$ space, as application of this symmetry maps from one \nnon-zero $M_S$ space to a $-M_S$ space. \n\nBoth $J_i$ and $P_i$ operators are site operators and hence, the operators for the full system can be defined as: \n\n", "itemtype": "equation", "pos": 16480, "prevtext": "\n\\noindent\nwhere $\\eta_i$ is $1$ if `i' belongs to A-sublattice and $0$ if it belongs to B-sublattice.\n\nThe result of parity or spin-flip symmetry (P) which flips the spin at each site is given by the following:\n\n", "index": 7, "text": "\\begin{equation*}\n\\begin{split}\n\\hat{P}_i|0\\rangle &= |0 \\rangle  \\\\\n\\hat{P}_i|\\uparrow \\downarrow \\rangle &= -|\\uparrow \\downarrow \\rangle\n\\end{split}\n\\qquad\\qquad\n\\begin{split}\n\\hat{P}_i|\\uparrow \\rangle &= |\\downarrow \\rangle \\\\\n\\hat{P}_i|\\downarrow \\rangle &= |\\uparrow \\rangle  \n\\end{split}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\hat{P}_{i}|0\\rangle&amp;\\displaystyle=|0\\rangle\\\\&#10;\\displaystyle\\hat{P}_{i}|\\uparrow\\downarrow\\rangle&amp;\\displaystyle=-|\\uparrow%&#10;\\downarrow\\rangle\\end{split}\\qquad\\qquad\\begin{split}\\displaystyle\\hat{P}_{i}|%&#10;\\uparrow\\rangle&amp;\\displaystyle=|\\downarrow\\rangle\\\\&#10;\\displaystyle\\hat{P}_{i}|\\downarrow\\rangle&amp;\\displaystyle=|\\uparrow\\rangle\\end{split}\" display=\"block\"><mrow><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mo>↑</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mo>=</mo><mo>-</mo><mo stretchy=\"false\">|</mo><mo>↑</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mtd></mtr></mtable><mo mathvariant=\"italic\" separator=\"true\">    </mo><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↑</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↓</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mo>↑</mo><mo stretchy=\"false\">⟩</mo></mrow></mrow></mtd></mtr></mtable></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nThe matrix element of these two symmetry operators for a superblock of size $2l+2$ can be represented by:\n\n", "itemtype": "equation", "pos": 17129, "prevtext": "\n\\noindent\nNon-relativistic Hamiltonians remain invariant under parity symmetry. This symmetry can only be employed in $M_S=0$ space, as application of this symmetry maps from one \nnon-zero $M_S$ space to a $-M_S$ space. \n\nBoth $J_i$ and $P_i$ operators are site operators and hence, the operators for the full system can be defined as: \n\n", "index": 9, "text": "\\begin{equation*}\n\\hat{J} = \\prod_i { }\\hat{J_i}\n\\qquad\\qquad\\qquad\n\\hat{P} = \\prod_i { }\\hat{P_i}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\hat{J}=\\prod_{i}{}\\hat{J_{i}}\\qquad\\qquad\\qquad\\hat{P}=\\prod_{i}{}\\hat{P_{i}}\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mi>i</mi></munder><mover accent=\"true\"><msub><mi>J</mi><mi>i</mi></msub><mo stretchy=\"false\">^</mo></mover></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">      </mo><mrow><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mi>i</mi></munder><mover accent=\"true\"><msub><mi>P</mi><mi>i</mi></msub><mo stretchy=\"false\">^</mo></mover></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\ni.e. it is direct product of matrix elements of corresponding symmetry operators in the left block DME space, right block DME space and in the Fock spaces of the \ntwo newly added sites.\n\nThe symmetry operators of the superblock follow the relations \n\n", "itemtype": "equation", "pos": 17360, "prevtext": "\n\\noindent\nThe matrix element of these two symmetry operators for a superblock of size $2l+2$ can be represented by:\n\n", "index": 11, "text": "\\begin{equation}\n\\begin{split}\n\\langle \\mu' &\\sigma' \\sigma \\mu | {\\cal{\\hat{R}}}_{2l+2} | \\nu \\tau \\tau' \\nu' \\rangle  \\\\\n&= \\langle \\mu | {\\cal{\\hat{R}}}_l | \\nu \\rangle \\langle \\sigma | {\\cal{\\hat{R}}}_i | \\tau \\rangle \n\\langle \\sigma' | {\\cal{\\hat{R}}}_{i'} | \\tau' \\rangle \\langle \\mu' | {\\cal{\\hat{R}}}_l | \\nu' \\rangle\n\\end{split}\n\\label{matelem}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\langle\\mu^{\\prime}&amp;\\displaystyle\\sigma^{\\prime}%&#10;\\sigma\\mu|{\\cal{\\hat{R}}}_{2l+2}|\\nu\\tau\\tau^{\\prime}\\nu^{\\prime}\\rangle\\\\&#10;&amp;\\displaystyle=\\langle\\mu|{\\cal{\\hat{R}}}_{l}|\\nu\\rangle\\langle\\sigma|{\\cal{%&#10;\\hat{R}}}_{i}|\\tau\\rangle\\langle\\sigma^{\\prime}|{\\cal{\\hat{R}}}_{i^{\\prime}}|%&#10;\\tau^{\\prime}\\rangle\\langle\\mu^{\\prime}|{\\cal{\\hat{R}}}_{l}|\\nu^{\\prime}%&#10;\\rangle\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>μ</mi><mo>′</mo></msup></mrow></mtd><mtd columnalign=\"left\"><mrow><msup><mi>σ</mi><mo>′</mo></msup><mi>σ</mi><mi>μ</mi><mo stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>l</mi></mrow><mo>+</mo><mn>2</mn></mrow></msub><mo stretchy=\"false\">|</mo><mi>ν</mi><mi>τ</mi><msup><mi>τ</mi><mo>′</mo></msup><msup><mi>ν</mi><mo>′</mo></msup><mo stretchy=\"false\">⟩</mo></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mrow><mo stretchy=\"false\">⟨</mo><mi>μ</mi><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mi>l</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><mi>ν</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>σ</mi><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><mi>τ</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>σ</mi><mo>′</mo></msup><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><msup><mi>i</mi><mo>′</mo></msup></msub><mo fence=\"true\" stretchy=\"false\">|</mo><msup><mi>τ</mi><mo>′</mo></msup><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>μ</mi><mo>′</mo></msup><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mi>l</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><msup><mi>ν</mi><mo>′</mo></msup><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nwhere $N_s$ and $N_e$ are number of sites and number of electrons in a basis state, on which the symmetry operations are applied. In case of half-filled fermionic\nsystem $N_s=N_e$; subsequently, each of the operator becomes their own inverse, the symmetry operators commute among themselves and form an abelian group. However, \nthe symmetry operators may not commute in individual block spaces and in Fock spaces of newly added sites.\n\nAs mentioned earlier, the $C_2$ symmetry operator maps one direct product state exclusively to another one. However, $J$ and $P$ operators do not produce a single state, \ndue to the absence of one-to-one symmetry correspondence between different density matrix eigenstates of a particular block, although the mapping of Fock states of a \nsingle site is exclusive. This absence of one-to-one mapping of the states in the sub-blocks and hence a one-to-one mapping of the states of the superblock leads to some\nserious problems in symmetry adaptation. Firstly, the matrix representation of the operators in the DME basis is not very sparse. Secondly, it is difficult to keep track\nof and thereby include all the symmetry partners of the $J$ and $P$ symmetry while introducing the DMRG cut-off. Thirdly, weeding out linearly dependent states after \nsymmetry adaptation is a slow step as it involves Gram-Schmidt orthonormalization of the symmetrized superblock states. Thus, a successful symmetry adaptation scheme \nmust have a one-to-one unique correspondence between states in the DME basis space.\n\nWe invoke the one-to-one correspondence among different DMEs which results in only one non-zero element in each row of the matrices of symmetry operators. This is \nachieved by considering truncated reduced density matrix eigenstates restricted to a specific region of the Hilbert space, as by symmetry we can obtain the DMEs in the \ncomplementary spaces. For example, the DMEs with total number of electrons $n_e < n_s$, the number of sites in the system block, are related to DMEs with $n_e > n_s$ by --\n\n", "itemtype": "equation", "pos": 17989, "prevtext": "\n\\noindent\ni.e. it is direct product of matrix elements of corresponding symmetry operators in the left block DME space, right block DME space and in the Fock spaces of the \ntwo newly added sites.\n\nThe symmetry operators of the superblock follow the relations \n\n", "index": 13, "text": "\\begin{equation}\n(\\hat{C}_2)^2 = 1\n\\qquad\n\\hat{J}^{\\phantom{|}2} = (-1)^{(N_s+N_e)}\n\\qquad\n\\hat{P}^2 = 1\n\\label{sym2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"(\\hat{C}_{2})^{2}=1\\qquad\\hat{J}^{\\phantom{|}2}=(-1)^{(N_{s}+N_{e})}\\qquad\\hat%&#10;{P}^{2}=1\" display=\"block\"><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>=</mo><mn>1</mn></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><msup><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msup><mo>=</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>N</mi><mi>s</mi></msub><mo>+</mo><msub><mi>N</mi><mi>e</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msup><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msup><mo>=</mo><mn>1</mn></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": " \n\\noindent\nand similarly the DMEs with $M_S > 0$ are related to DMEs with $M_S < 0$ by,\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\noindent\nwhere $N_s$ and $N_e$ are number of sites and number of electrons in a basis state, on which the symmetry operations are applied. In case of half-filled fermionic\nsystem $N_s=N_e$; subsequently, each of the operator becomes their own inverse, the symmetry operators commute among themselves and form an abelian group. However, \nthe symmetry operators may not commute in individual block spaces and in Fock spaces of newly added sites.\n\nAs mentioned earlier, the $C_2$ symmetry operator maps one direct product state exclusively to another one. However, $J$ and $P$ operators do not produce a single state, \ndue to the absence of one-to-one symmetry correspondence between different density matrix eigenstates of a particular block, although the mapping of Fock states of a \nsingle site is exclusive. This absence of one-to-one mapping of the states in the sub-blocks and hence a one-to-one mapping of the states of the superblock leads to some\nserious problems in symmetry adaptation. Firstly, the matrix representation of the operators in the DME basis is not very sparse. Secondly, it is difficult to keep track\nof and thereby include all the symmetry partners of the $J$ and $P$ symmetry while introducing the DMRG cut-off. Thirdly, weeding out linearly dependent states after \nsymmetry adaptation is a slow step as it involves Gram-Schmidt orthonormalization of the symmetrized superblock states. Thus, a successful symmetry adaptation scheme \nmust have a one-to-one unique correspondence between states in the DME basis space.\n\nWe invoke the one-to-one correspondence among different DMEs which results in only one non-zero element in each row of the matrices of symmetry operators. This is \nachieved by considering truncated reduced density matrix eigenstates restricted to a specific region of the Hilbert space, as by symmetry we can obtain the DMEs in the \ncomplementary spaces. For example, the DMEs with total number of electrons $n_e < n_s$, the number of sites in the system block, are related to DMEs with $n_e > n_s$ by --\n\n", "index": 15, "text": "\\begin{equation}\n\\hat{J}_{L} \\mu_i(n_s > n_e) = \\mu_j(n_s < n_e) \n\\label{muconvrt-1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\hat{J}_{L}\\mu_{i}(n_{s}&gt;n_{e})=\\mu_{j}(n_{s}&lt;n_{e})\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><msub><mi>μ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&gt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mi>μ</mi><mi>j</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&lt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": " \n\\noindent\nHence, we start with the following set of DME of the system block which satisfy the criteria $\\{\\mu_i(n_s \\ge n_e, M_S \\le 0)\\}$. \n\nWe consider here only the left block, as the algorithm will be same for the right block as well. This particular set of eigenstates can be segregated into four groups --\n\n(i) $\\mathbf{\\{\\mu_i(n_s > n_e, M_S < 0)\\}}$: Application of $J_{L}$, $P_{L}$ and their product on these eigenstates give the corresponding symmetry counterparts. \nAs $J_{L}$ and $P_{L}$ may not commute, we only considered the product $P_{L}J_{L}$; the order of operations of the two operators will become irrelevant in the \ndirect product basis space of a half-filled system, where $J$ and $P$ of the superblock commute.\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \n\\noindent\nand similarly the DMEs with $M_S > 0$ are related to DMEs with $M_S < 0$ by,\n\n", "index": 17, "text": "\\begin{equation}\n\\hat{P}_{L} \\mu_i(M_S < 0) = \\mu_j(M_S > 0).\n\\label{muconvrt-2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\hat{P}_{L}\\mu_{i}(M_{S}&lt;0)=\\mu_{j}(M_{S}&gt;0).\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><msub><mi>μ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&lt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mi>μ</mi><mi>j</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&gt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nThe DMEs obtained from $\\mu_i$ by symmetry operations are indexed and stored as eigenvectors $\\{\\mu_i\\}$. Symmetry correspondence in every \npair of these four eigenstates is also deduced using the relation $\\hat{P}_{L}\\hat{J}_{L} = (-1)^{(n_s+n_e)} \\hat{J}_{L}\\hat{P}_{L}$ along with Eqn. \\ref{sym2} \nand stored separately. The matrix elements of the symmetry operators are given by,\n\n", "itemtype": "equation", "pos": 21190, "prevtext": " \n\\noindent\nHence, we start with the following set of DME of the system block which satisfy the criteria $\\{\\mu_i(n_s \\ge n_e, M_S \\le 0)\\}$. \n\nWe consider here only the left block, as the algorithm will be same for the right block as well. This particular set of eigenstates can be segregated into four groups --\n\n(i) $\\mathbf{\\{\\mu_i(n_s > n_e, M_S < 0)\\}}$: Application of $J_{L}$, $P_{L}$ and their product on these eigenstates give the corresponding symmetry counterparts. \nAs $J_{L}$ and $P_{L}$ may not commute, we only considered the product $P_{L}J_{L}$; the order of operations of the two operators will become irrelevant in the \ndirect product basis space of a half-filled system, where $J$ and $P$ of the superblock commute.\n\n", "index": 19, "text": "\\begin{equation*}\n\\begin{split}\n\\resizebox{0.97\\hsize}{!}{$\\hat{J}_{L} \\mbox{ }\\mu_i(n_s > n_e, M_S < 0) = \\mu_{i_J}(n_s < n_e, M_S < 0)$} \\\\\n\\resizebox{0.97\\hsize}{!}{$\\hat{P}_{L} \\mbox{ }\\mu_i(n_s > n_e, M_S < 0) = \\mu_{i_P}(n_s > n_e, M_S > 0)$} \\\\\n\\resizebox{0.97\\hsize}{!}{$\\hat{P}_{L}\\hat{J}_{L} \\mbox{ }\\mu_i(n_s > n_e, M_S < 0) = \\mu_{i_{PJ}}(n_s < n_e, M_S > 0)$}\n\\end{split}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\resizebox{455.66235pt}{0.0pt}{$\\hat{J}_{L}\\mbox{ }%&#10;\\mu_{i}(n_{s}&gt;n_{e},M_{S}&lt;0)=\\mu_{i_{J}}(n_{s}&lt;n_{e},M_{S}&lt;0)$}\\\\&#10;\\displaystyle\\resizebox{455.66235pt}{0.0pt}{$\\hat{P}_{L}\\mbox{ }\\mu_{i}(n_{s}&gt;%&#10;n_{e},M_{S}&lt;0)=\\mu_{i_{P}}(n_{s}&gt;n_{e},M_{S}&gt;0)$}\\\\&#10;\\displaystyle\\resizebox{455.66235pt}{0.0pt}{$\\hat{P}_{L}\\hat{J}_{L}\\mbox{ }\\mu%&#10;_{i}(n_{s}&gt;n_{e},M_{S}&lt;0)=\\mu_{i_{PJ}}(n_{s}&lt;n_{e},M_{S}&gt;0)$}\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mtext> </mtext><msub><mi>μ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&gt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&lt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mi>μ</mi><msub><mi>i</mi><mi>J</mi></msub></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&lt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&lt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mtext> </mtext><msub><mi>μ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&gt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&lt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mi>μ</mi><msub><mi>i</mi><mi>P</mi></msub></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&gt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&gt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mtext> </mtext><msub><mi>μ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&gt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&lt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mi>μ</mi><msub><mi>i</mi><mrow><mi>P</mi><mo>⁢</mo><mi>J</mi></mrow></msub></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>s</mi></msub><mo>&lt;</mo><msub><mi>n</mi><mi>e</mi></msub><mo>,</mo><msub><mi>M</mi><mi>S</mi></msub><mo>&gt;</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 21985, "prevtext": "\n\\noindent\nThe DMEs obtained from $\\mu_i$ by symmetry operations are indexed and stored as eigenvectors $\\{\\mu_i\\}$. Symmetry correspondence in every \npair of these four eigenstates is also deduced using the relation $\\hat{P}_{L}\\hat{J}_{L} = (-1)^{(n_s+n_e)} \\hat{J}_{L}\\hat{P}_{L}$ along with Eqn. \\ref{sym2} \nand stored separately. The matrix elements of the symmetry operators are given by,\n\n", "index": 21, "text": "\\begin{equation*}\n(\\hat{J}_{L})_{i,j} = (-1)^{\\eta_J} \\delta_{i,i_J}\n\\qquad\n(\\hat{P}_{L})_{i,j} = (-1)^{\\eta_P} \\delta_{i,i_P} \\\\\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"(\\hat{J}_{L})_{i,j}=(-1)^{\\eta_{J}}\\delta_{i,i_{J}}\\qquad(\\hat{P}_{L})_{i,j}=(%&#10;-1)^{\\eta_{P}}\\delta_{i,i_{P}}\\\\&#10;\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><msub><mi>η</mi><mi>J</mi></msub></msup><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><msub><mi>i</mi><mi>J</mi></msub></mrow></msub></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><msub><mi>η</mi><mi>P</mi></msub></msup><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><msub><mi>i</mi><mi>P</mi></msub></mrow></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nwhere $\\eta$s are the corresponding phase factors.\n\n(ii) $\\mathbf{\\{\\mu_i(n_s > n_e, M_S = 0)\\}}$: Application of $J_{L}$ symmetry operator on these density matrix eigenvectors generate eigenvectors with particle number\n$2n_s-n_e$; yet, $P_{L}$ symmetry should map the eigenspace to itself. Therefore, to begin with, this group of eigenvectors is further sub-divided into smaller \nsub-groups $\\{\\mu_i(n_e = n'_e, M_S = 0)\\}$, where $n'_e$ is some particular value of $n_e$ and $n'_e < n_s$. Considering these smaller blocks, one at a time, we set up \nthe matrix of $\\hat{P}$ in this sub-space. This is diagonalized to obtain the eigenvectors of $\\hat{P}$ so that each of the new DMEs map into themselves with a phase \nfactor of $\\pm1$. These transformed ${\\mu_k(n_e = n'_e, M_S=0)}$ provide a one-to-one mapping under the symmetry operations $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$. \n\n(iii) $\\mathbf{\\{\\mu_i(n_s = n_e, M_S < 0)\\}}$: This set of eigenstates are similar to the one discussed above, differing only in the fact that $J_{L}$ will map the \nspace to itself instead of $P_{L}$. The space is sub-divided into smaller blocks on the basis of different negative $M_S$ values and the matrices of the operator \n$\\hat{J}$ are setup in these smaller DME basis spaces. The eigenstates of this operator serve as the new DMEs for obtaining one-to-one correspondence of the DMEs under \nthe symmetry operations.\n\n(iv) $\\mathbf{\\{\\mu_i(n_s = n_e, M_S = 0)\\}}$: This particular set of eigenvectors span a vector space which on application by both $J_{L}$ and $P_{L}$ should map \ninto itself. Hence, linear combinations are found out which are eigenvectors of $J_{L}$ with eigenvalues $(-1)^{\\zeta_J}$, $\\zeta_J=0$ or $1$. Using $J$-eigenvectors \nwith a particular eigenvalue $(-1)^{\\zeta_J}$, another set of linear combinations are formed which are eigenvectors of $P_{L}$, with eigenvalues $(-1)^{\\zeta_P}$,\n$\\zeta_P=0$ or $1$. To this end, we first construct the matrix representation of $\\hat{J}$ in the basis of DMEs with $n_s=n_e$ and $M_S=0$. We obtain the eigenvectors of\n$\\hat{J}$ in this space by diagonalizing the matrix. We then use the eigenvectors of $\\hat{J}$ as the basis in which the matrix of $\\hat{P}$ is set up. The resulting \neigenvectors of $\\hat{P}$ replace the DMEs in this space and they will be employed in symmetry adaptation.\n\nWhile imposing the cut-off in the DMEs, we only consider the subspace of DMEs with $n_e \\le n_s$ and $M_S \\le 0$. Since the DMEs related to these states by the operation \nof $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$ will also have the same eigenvalues, it is ensured that all DMEs above a cut-off in the density matrix eigenvalue\nare included. Usually the cut-off imposed in the specified sector is about $0.4$ times of the cut-off intended for the full density matrix. Since we have a one-to-one \ncorrespondence of the DMEs within a block for the operations $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$, it is a simple matter to extend the one-to-one correspondence to\nthe direct product basis states formed by the DMEs of the left and right blocks and the Fock space states of the newly added sites.\n\nSymmetry adapted direct product bases in an irreducible representation $\\Gamma$ can be generated by employing projection operator, which is given by --\n\n", "itemtype": "equation", "pos": 22131, "prevtext": "\n\n", "index": 23, "text": "\\begin{equation*}\n(\\hat{P}_{L}\\hat{J}_{L})_{i,j} = (-1)^{\\eta_{PJ}} \\delta_{i,i_{PJ}}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"(\\hat{P}_{L}\\hat{J}_{L})_{i,j}=(-1)^{\\eta_{PJ}}\\delta_{i,i_{PJ}}\" display=\"block\"><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>J</mi><mo stretchy=\"false\">^</mo></mover><mi>L</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><msub><mi>η</mi><mrow><mi>P</mi><mo>⁢</mo><mi>J</mi></mrow></msub></msup><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><msub><mi>i</mi><mrow><mi>P</mi><mo>⁢</mo><mi>J</mi></mrow></msub></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nwhere $\\chi(\\Gamma,{\\cal{R}}_i)$ is the character of the symmetry operator ${\\cal{\\hat{R}}}_i$ in the irreducible representation $\\Gamma$ and $h$ being the order of the \ngroup. \nOperation by ${\\cal P}(\\Gamma)$ on each of the basis states in the direct product space produces the symmetry adapted linear combinations. However, if ${\\cal P}(\\Gamma)$ \nacts on each of the states in the direct product space, we will end up with a linearly dependent symmetry adapted basis. In the earlier symmetry adaptation procedure \n\\cite{rama-prb-dmrg}, weeding out linear dependence by Gram-Schmidt orthonormalization technique was an extremely expensive step, computationally. With present technique,\nwhere we have a one-to-one correspondence between symmetry related states, this turns out to be extremely simple and computationally very efficient. Firstly we note that,\none-to-one correspondence between the DMRG basis states under the symmetry operations implies that a given basis state can appear only once (or not at all) in a given \nsymmetry space. Therefore, in the symmetry adaptation step, we sequentially go through the list of basis states, apply the projection operator and construct the symmetrized\ncombination along with elimination of the partners which have appeared in the symmetry combination from the list of unsymmetrized basis states. This ensures that a basis \nstate occurs at most once in the symmetrized states. Taken together with the orthonormality of the unsymmetrized basis states, this ensures orthogonality of the basis \nstates generated by the projection operator. Using these symmetry combinations, we can generate the transformation matrix $S$, which is $D\\times D_{\\Gamma}$ matrix where \n$D$ is the dimensionality of the unsymmetrized space and $D_{\\Gamma}$ is the dimensionality of the symmetrized space.\n\nThe Hamiltonian of the superblock can be transformed into symmetrized basis space by operating with the matrix $S$ as: \n\n", "itemtype": "equation", "pos": 25545, "prevtext": "\n\\noindent\nwhere $\\eta$s are the corresponding phase factors.\n\n(ii) $\\mathbf{\\{\\mu_i(n_s > n_e, M_S = 0)\\}}$: Application of $J_{L}$ symmetry operator on these density matrix eigenvectors generate eigenvectors with particle number\n$2n_s-n_e$; yet, $P_{L}$ symmetry should map the eigenspace to itself. Therefore, to begin with, this group of eigenvectors is further sub-divided into smaller \nsub-groups $\\{\\mu_i(n_e = n'_e, M_S = 0)\\}$, where $n'_e$ is some particular value of $n_e$ and $n'_e < n_s$. Considering these smaller blocks, one at a time, we set up \nthe matrix of $\\hat{P}$ in this sub-space. This is diagonalized to obtain the eigenvectors of $\\hat{P}$ so that each of the new DMEs map into themselves with a phase \nfactor of $\\pm1$. These transformed ${\\mu_k(n_e = n'_e, M_S=0)}$ provide a one-to-one mapping under the symmetry operations $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$. \n\n(iii) $\\mathbf{\\{\\mu_i(n_s = n_e, M_S < 0)\\}}$: This set of eigenstates are similar to the one discussed above, differing only in the fact that $J_{L}$ will map the \nspace to itself instead of $P_{L}$. The space is sub-divided into smaller blocks on the basis of different negative $M_S$ values and the matrices of the operator \n$\\hat{J}$ are setup in these smaller DME basis spaces. The eigenstates of this operator serve as the new DMEs for obtaining one-to-one correspondence of the DMEs under \nthe symmetry operations.\n\n(iv) $\\mathbf{\\{\\mu_i(n_s = n_e, M_S = 0)\\}}$: This particular set of eigenvectors span a vector space which on application by both $J_{L}$ and $P_{L}$ should map \ninto itself. Hence, linear combinations are found out which are eigenvectors of $J_{L}$ with eigenvalues $(-1)^{\\zeta_J}$, $\\zeta_J=0$ or $1$. Using $J$-eigenvectors \nwith a particular eigenvalue $(-1)^{\\zeta_J}$, another set of linear combinations are formed which are eigenvectors of $P_{L}$, with eigenvalues $(-1)^{\\zeta_P}$,\n$\\zeta_P=0$ or $1$. To this end, we first construct the matrix representation of $\\hat{J}$ in the basis of DMEs with $n_s=n_e$ and $M_S=0$. We obtain the eigenvectors of\n$\\hat{J}$ in this space by diagonalizing the matrix. We then use the eigenvectors of $\\hat{J}$ as the basis in which the matrix of $\\hat{P}$ is set up. The resulting \neigenvectors of $\\hat{P}$ replace the DMEs in this space and they will be employed in symmetry adaptation.\n\nWhile imposing the cut-off in the DMEs, we only consider the subspace of DMEs with $n_e \\le n_s$ and $M_S \\le 0$. Since the DMEs related to these states by the operation \nof $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$ will also have the same eigenvalues, it is ensured that all DMEs above a cut-off in the density matrix eigenvalue\nare included. Usually the cut-off imposed in the specified sector is about $0.4$ times of the cut-off intended for the full density matrix. Since we have a one-to-one \ncorrespondence of the DMEs within a block for the operations $\\hat{J}$, $\\hat{P}$ and $\\hat{P}\\hat{J}$, it is a simple matter to extend the one-to-one correspondence to\nthe direct product basis states formed by the DMEs of the left and right blocks and the Fock space states of the newly added sites.\n\nSymmetry adapted direct product bases in an irreducible representation $\\Gamma$ can be generated by employing projection operator, which is given by --\n\n", "index": 25, "text": "\\begin{equation}\n{\\cal P}(\\Gamma)=\\frac{1}{h}\\sum_i \\chi(\\Gamma,{\\cal{R}}_i) {\\cal{\\hat{R}}}_i\n\\label{prjctn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{\\cal P}(\\Gamma)=\\frac{1}{h}\\sum_{i}\\chi(\\Gamma,{\\cal{R}}_{i}){\\cal{\\hat{R}}}_%&#10;{i}\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒫</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>h</mi></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nThe transformed Hamiltonian is then diagonalized to get lowest-lying eigenvectors in different irreducible representations labeled as ${}^eA^{+}$, ${}^eB^{+}$, ${}^eA^{-}$,\n${}^eB^{-}$, ${}^oA^{+}$, ${}^oB^{+}$, ${}^oA^{-}$ and ${}^oB^{-}$, where the left-hand superscript represents character under $P$-symmetry, the right superscript is the \ncharacter under $J$-symmetry and the letter $A/B$ is the character under $C_2$ symmetry in the irreducible representation $\\Gamma$. The singlet lies in the `e' space while\nthe triplet lies in the `o' space. The space `+' refers to `covalent' space while `-' to the `ionic' space. $A (B)$ represents the space even (odd) under $C_2$ symmetry.\nThe ground state is usually in ${}^eA^{+}$ while the optically connected space is ${}^eB^{-}$. The lowest triplet lies in the ${}^oB^{+}$ space.\n\n\\subsection{Model Hamiltonian}\n\nThe model Hamiltonian employed for the study of peri-condensed polyacenes is the well known Pariser-Parr-Pople (PPP) Hamiltonian \\cite{pariser-parr, *pople}, which \nconsiders long-range Coulombic interaction along with on-site Hubbard interaction:\n\n", "itemtype": "equation", "pos": 27628, "prevtext": "\n\\noindent\nwhere $\\chi(\\Gamma,{\\cal{R}}_i)$ is the character of the symmetry operator ${\\cal{\\hat{R}}}_i$ in the irreducible representation $\\Gamma$ and $h$ being the order of the \ngroup. \nOperation by ${\\cal P}(\\Gamma)$ on each of the basis states in the direct product space produces the symmetry adapted linear combinations. However, if ${\\cal P}(\\Gamma)$ \nacts on each of the states in the direct product space, we will end up with a linearly dependent symmetry adapted basis. In the earlier symmetry adaptation procedure \n\\cite{rama-prb-dmrg}, weeding out linear dependence by Gram-Schmidt orthonormalization technique was an extremely expensive step, computationally. With present technique,\nwhere we have a one-to-one correspondence between symmetry related states, this turns out to be extremely simple and computationally very efficient. Firstly we note that,\none-to-one correspondence between the DMRG basis states under the symmetry operations implies that a given basis state can appear only once (or not at all) in a given \nsymmetry space. Therefore, in the symmetry adaptation step, we sequentially go through the list of basis states, apply the projection operator and construct the symmetrized\ncombination along with elimination of the partners which have appeared in the symmetry combination from the list of unsymmetrized basis states. This ensures that a basis \nstate occurs at most once in the symmetrized states. Taken together with the orthonormality of the unsymmetrized basis states, this ensures orthogonality of the basis \nstates generated by the projection operator. Using these symmetry combinations, we can generate the transformation matrix $S$, which is $D\\times D_{\\Gamma}$ matrix where \n$D$ is the dimensionality of the unsymmetrized space and $D_{\\Gamma}$ is the dimensionality of the symmetrized space.\n\nThe Hamiltonian of the superblock can be transformed into symmetrized basis space by operating with the matrix $S$ as: \n\n", "index": 27, "text": "\\begin{equation}\n\\tilde{H}_{2l+2} = S^{\\dagger} H_{2l+2} S\n\\label{Hamtrns}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\tilde{H}_{2l+2}=S^{\\dagger}H_{2l+2}S\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">~</mo></mover><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>l</mi></mrow><mo>+</mo><mn>2</mn></mrow></msub><mo>=</mo><mrow><msup><mi>S</mi><mo>†</mo></msup><mo>⁢</mo><msub><mi>H</mi><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>l</mi></mrow><mo>+</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mi>S</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\n$t_0$ is the nearest-neighbor hopping integral between bonded sites `i' and `j', $\\epsilon_i$ is the site energy of `i'-th carbon atom while $U$ is the on-site Coulomb \nrepulsion term. The intersite interaction energies, $V_{ij}$ are interpolated by Ohno scheme \\cite{ohno, *klopman} assuming C-C bond length of $1.4$ \\AA. \n$\\hat c_{i,\\sigma}^\\dagger$ and $\\hat c_{i,\\sigma}^{}$ are the creation and annihilation operators of an electron with spin $\\sigma$ in the $2p_z$ orbital of the carbon \natom at site `i' and $\\hat n_i=\\sum_{\\sigma} \\hat c_{i,\\sigma}^\\dagger \\hat c_{i,\\sigma}^{}$ is the corresponding number operator. For carbon atoms, the standard PPP \nparameters are $t_0=-2.4$ eV and $U=11.26$ eV while the site energy $(\\epsilon)$ for unsubstituted carbon atom is taken to be zero. $z_i$ is the local chemical potential, \nexpressed by the the number of electrons at site `i' which leaves the site neutral; for carbon atoms in a $\\pi$-conjugated system, $z_i=1$. Substitution effect by donor \nor acceptor groups can be modeled by considering the site energy $\\epsilon_i$ positive or negative respectively. \n\nAs DMRG calculations are done in constant $M_S$-basis space, contrary to the spin-adapted basis (Diagrammatic valence bond basis) calculations, labelling states by \ntheir spin value is ambiguous. The parity symmetry partially resolves this as the singlet state lies in the even-parity subspace while the triplet state lies in the \nodd-parity subspace. Though, higher spin states also lie in the even (odd) parity sub-spaces, they remain high in energy compared to singlet and triplet states in moderate \nsized carbon-based systems and so can be neglected \\cite{raghu-prb}. \n\n\\subsection{Comparison with exact calculation results}\n\nThe accuracy of our modified algorithm can be established by comparing the results obtained for small systems with exact PPP results, like in $16$-site polyene chain \nand tetracene molecule which has 18 sites. The difference between ground state energy of $16$-site polyene chain, obtained by symmetrized DMRG technique, and the  \nexact calculation result is plotted for four different cutoff values $M'^l$ in the sector $\\{ \\mu_i^L(n_s \\ge n_e,M_S \\le 0)\\}$ of the sub-block in Fig. \\ref{16site-ppp}. \nIn all the calculations, the energy values are accurate at least up to fifth decimal places when compared with exact calculation results. We have also plotted the \nfluctuations in the DMRG energy about the exact energy with number of finite DMRG sweeps for a fixed $M'^l$ value, which depicts that the fluctuation is negligible with \nnumber of sweeps and therefore, $2-3$ sweeps will suffice for acceptable convergence of energy.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=5.5cm]{errmax.eps}\n\\caption{\\label{16site-ppp}(Color online) Deviation of ground state energy calculated by symmetrized DMRG technique from exact energy value for different cutoff $M'^l$ of \nthe density matrix eigenstate space. The number of finite DMRG sweeps $(2)$ is fixed in all the cases. Inset: Fluctuation of DMRG ground state energy with respect to exact \nenergy value with increasing number of finite DMRG sweeps. The number of density matrix eigenstates retained, $M'^l$, is 225.}\n\\end{center}\n\\end{figure}\n\nIn Table \\ref{tetracene-ppp}, PPP energies of the ground state $({1}^1A^{+})$, lowest two-photon state $({2}^1A^{+})$, lowest one-photon state $({1}^1B^{-})$ and of the \nlowest triplet state $({1}^3B^{+})$ of both $16$-site polyene chain and tetracene molecule are presented. $M'^l$ is kept at $225$ for $16$-site polyene chain and $425$ for \ntetracene molecule, thus total number of DMEs retained for the sub-block is $\\sim 550$ and $\\sim 1000$ respectively at each step of DMRG calculation. Full CI \ncalculations, employing diagrammatic valence bond method (DVB) \\cite{ramasesh-ijqc}, shows excellent agreement with the results obtained and the upper bound of error in \nenergies of different states is of the order of $10^{-4}$.\n\n\\begin{table}[b]\n\\begin{center}\n\\caption{\\label{tetracene-ppp} Comparison of the energies of ground state, lowest two-photon state, lowest optical state and lowest triplet state of $16$-site polyene chain \nand tetracene, obtained by modified symmetrized DMRG algorithm and exact calculation. The exact calculations are carried out using diagrammatic valence bond method.}\n\\begin{ruledtabular}\n\\begin{tabular}{cccc}\nSystem & State & Exact calculation & DMRG calculation \\\\\n\\colrule\nPolyene of & ${1}^1A^{+}$ & $-33.55575$ & $-33.55575$ \\\\\n$16$ sites & ${2}^1A^{+}$ & $-32.03385$ & $-32.03385$ \\\\\n     & ${1}^1B^{-}$ & $-30.43291$ & $-30.43291$ \\\\\n     & ${1}^3B^{+}$ & $-32.87993$ & $-32.87993$ \\\\\n\\colrule\nTetracene & ${1}^1A^{+}$ & $-43.69083$ & $-43.69076$  \\\\\nmolecule  & ${2}^1A^{+}$ & $-40.55749$ & $-40.55725$  \\\\\n     & ${1}^1B^{-}$ & $-40.51439$ & $-40.51419$  \\\\\n     & ${1}^3B^{+}$ & $-42.47046$ & $-42.47038$  \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=6.3cm]{molecule_copy.eps}\n\\caption{\\label{molecule}(Color online) Schematic diagrams of coronene, 1,12-benzoperylene and ovalene with site (black and bold) and bond (red and italics) indices. \nThe sites of substitution in substituted coronene are indicated in curly brackets; $+\\epsilon$ (sites $1$ and $24$) represents a donor site while $-\\epsilon$ (sites \n$8$ and $17$) represents an acceptor site.}\n\\end{center}\n\\end{figure}\n\n\\section{Results and Discussion}\n\nWe have studied a few low-lying states of coronene, ovalene and $1,12-$benzoperylene in different symmetry spaces considering $\\sim 1000$ DMEs in PPP model and the \nenergy gaps are tabulated in Table. \\ref{energy-ppp1} and \\ref{energy-ppp2}. We have also calculated energies in the above symmetry spaces for substituted coronene, with \ndonor and acceptor groups of equal strength, set to $1.0$ eV ($|\\epsilon|=1.0$ eV). We have employed only a few of the existing spatial symmetries of the molecules, namely \n$C_2$ symmetry axis perpendicular to the molecular plane (in plane $C_2$ axis in case of  $1,12-$benzoperylene) for our calculations, as our DMRG calculations cannot \nincorporate more than one symmetry axis. Being treated as planar molecules, with Wannier orbitals, the reflection in the molecular plane is a trivial symmetry.\nYet, we can label the eigenstates according to different irreducible representations of the full group based on transition dipole moment direction for excitations from \nthe ground state. In case of coronene, we have considered its subgroup $D_{2h}$ rather than the full group $D_{6h}$ for labelling the eigenstates. The lowest optical states \nobtained may not be the states with highest transition dipole moment, which will be prominent in UV-visible spectroscopy but corresponds to the lowest energy state of the \nappropriate symmetry subspace; however, the results obtained are in good agreement with gas phase molecular spectroscopic data available for above molecules \\cite{patter}, \nsuggesting that the states obtained are also the ones with considerable transition dipoles in the energy range of the experiment.\n\n\\begin{table*}[t]\n\\begin{center}\n\\caption{\\label{energy-ppp1} Lowest energy states in coronene and ovalene with the energy gaps in units of eV. Although coronene has $D_{6h}$ symmetry, \nhere the energy states are labelled according to Abelian $D_{2h}$ symmetry representations. The transition dipole moment from ground state to the excited states \n$(\\mu_{tr,x/y})$ along specific axes are also specified in the last two columns in units of Debye.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccccc}\n\\multicolumn{5}{c}{Coronene} \\\\\n\\colrule\nNature of the state & State level & Energy Gap & $\\mu_{tr,x}(D)$ & $\\mu_{tr,y}(D)$ \\\\\n\\colrule\nTwo-photon & $(2\\thinspace{}^{1}A_{g}^{+}/ 1\\thinspace{}^{1}B_{1g}^{+})\\footnote{Probable labels for states which cannot be identified uniquely are given within \nparentheses.}$ & $3.97$ & $0.00$ & $0.00$ \\\\\n           & $(3\\thinspace{}^{1}A_{g}^{+}/ 2\\thinspace{}^{1}B_{1g}^{+})$ & $4.09$ & $0.00$ & $0.00$ \\\\\n           & $(4\\thinspace{}^{1}A_{g}^{+}/ 3\\thinspace{}^{1}B_{1g}^{+})$ & $5.08$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{2u}^{-}$ & $4.83$ & $0.81\\footnote{Non-zero value of transition dipole moment along polarization direction forbidden by symmetry \nis an artifact of the calculations as average density matrices, calculated from eigenstates of different symmetry subspaces, are employed to determine the transition \ndipole moment. However, the errors are negligible as intensities depend on the square of the transition dipole moment.}$ & $8.43$ \\\\\n        & $1\\thinspace{}^{1}B_{3u}^{-}$ & $4.87$ & $7.51$ & $0.49$ \\\\\n\\colrule\nTriplet & $(1\\thinspace{}^{3}B_{2u}^{+}/ 1\\thinspace{}^{3}B_{3u}^{+})$ & $2.35$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}B_{2u}^{+}/ 2\\thinspace{}^{3}B_{3u}^{+})$ & $3.00$ & $0.00$ & $0.00$ \\\\\n        & $(3\\thinspace{}^{3}B_{2u}^{+}/ 3\\thinspace{}^{3}B_{3u}^{+})$ & $3.02$ & $0.00$ & $0.00$ \\\\\n        & $(1\\thinspace{}^{3}A_{g}^{+}/  1\\thinspace{}^{3}B_{1g}^{+})$ & $3.35$ & $0.00$ & $0.00$ \\\\\n\\colrule\nDark states & $(1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+})$ & $2.82$ & $0.00$ & $0.00$ \\\\\n            & $(x\\thinspace{}^{1}B_{2u}^{-}$/ $x\\thinspace{}^{1}B_{3u}^{-})\\footnote{x implies that the level numbering is unknown.}$ & $3.88$ & $0.28$ & $1.74$  \\\\\n            & $(1\\thinspace{}^{1}A_{g}^{-}/ 1\\thinspace{}^{1}B_{1g}^{-})$ & $4.73$ & $0.00$ & $0.00$ \\\\\n\\colrule\n\\multicolumn{5}{c}{Ovalene} \\\\\n\\colrule\nTwo-photon & $(2\\thinspace{}^{1}A_{g}^{+}/ 1\\thinspace{}^{1}B_{1g}^{+})$ & $3.10$ & $0.00$ & $0.00$ \\\\\n           & $(3\\thinspace{}^{1}A_{g}^{+}/ 2\\thinspace{}^{1}B_{1g}^{+})$ & $3.75$ & $0.00$ & $0.00$ \\\\\n           & $(4\\thinspace{}^{1}A_{g}^{+}/ 3\\thinspace{}^{1}B_{1g}^{+})$ & $5.48$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{2u}^{-}$ & $3.32$ & $0.29$ & $6.58$ \\\\\n        & $2\\thinspace{}^{1}B_{2u}^{-}$ & $4.53$ & $0.33$ & $0.58$ \\\\\n        & $1\\thinspace{}^{1}B_{3u}^{-}$ & $4.64$ & $7.28$ & $0.22$ \\\\\n\\colrule\nTriplet & $(1\\thinspace{}^{3}B_{2u}^{+}/ 1\\thinspace{}^{3}B_{3u}^{+})$ & $1.49$ & $0.00$ & $0.00$ \\\\\n        & $(1\\thinspace{}^{3}A_{g}^{+}/ 1\\thinspace{}^{3}B_{1g}^{+})$ & $2.77$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}A_{g}^{+}/ 2\\thinspace{}^{3}B_{1g}^{+})$ & $2.80$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}B_{2u}^{+}/ 2\\thinspace{}^{3}B_{3u}^{+})$ & $2.82$ & $0.00$ & $0.00$ \\\\\n\\colrule\nDark states & $(1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+})$ & $2.65$ & $0.00$ & $0.00$ \\\\\n            & $(1\\thinspace{}^{1}A_{g}^{-}/ 1\\thinspace{}^{1}B_{1g}^{-})$ & $4.06$ & $0.00$ & $0.00$ \\\\\n            & $(2\\thinspace{}^{1}A_{g}^{-}/ 2\\thinspace{}^{1}B_{1g}^{-})$ & $4.69$ & $0.00$ & $0.00$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table*}[tp]\n\\begin{center}\n\\caption{\\label{energy-ppp2} Lowest energy states in 1,12-benzoperylene and substituted coronene with the energy gaps in units of eV. The transition \ndipole moment from ground state to the excited states $(\\mu_{tr,x/y})$ along specific axes are also specified in the last two columns in units of Debye.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccccc}\n\\multicolumn{5}{c}{1,12-Benzoperylene} \\\\\n\\colrule\nNature of the state & State level & Energy Gap & $\\mu_{tr,x}(D)$ & $\\mu_{tr,y}(D)$ \\\\\n\\colrule\nTwo-photon & $2\\thinspace{}^{1}A_{1}^{+}$ & $2.99$ & $0.00$ & $0.00$ \\\\\n           & $3\\thinspace{}^{1}A_{1}^{+}$ & $4.26$ & $0.00$ & $0.00$ \\\\\n\t   & $4\\thinspace{}^{1}A_{1}^{+}$ & $4.58$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{1}^{-}$ & $3.72$ & $0.00$ & $3.17$ \\\\\n        & $2\\thinspace{}^{1}B_{1}^{-}$ & $4.71$ & $0.00$ & $3.83$ \\\\\n        & $3\\thinspace{}^{1}B_{1}^{-}$ & $4.83$ & $0.00$ & $5.20$ \\\\\n\\colrule\nTriplet & $1\\thinspace{}^{3}B_{1}^{+}$ & $2.84$ & $0.00$ & $0.00$ \\\\\n        & $2\\thinspace{}^{3}B_{1}^{+}$ & $3.65$ & $0.00$ & $0.00$ \\\\\n        & $3\\thinspace{}^{3}B_{1}^{+}$ & $4.26$ & $0.00$ & $0.00$ \\\\\n\\colrule\n\\multicolumn{5}{c}{Substituted coronene} \\\\\n\\colrule\nTwo-photon & $2\\thinspace{}^{1}A_{g}$ & $4.01$ & $0.00$ & $0.00$ \\\\ \n           & $3\\thinspace{}^{1}A_{g}$ & $4.81$ & $0.00$ & $0.00$ \\\\\n\t   & $4\\thinspace{}^{1}A_{g}$ & $4.90$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{u}$ & $2.90$ & $0.00$ & $0.23$ \\\\\n        & $2\\thinspace{}^{1}B_{u}$ & $3.87$ & $0.12$ & $1.46$ \\\\\n        & $3\\thinspace{}^{1}B_{u}$ & $5.18$ & $0.17$ & $7.52$ \\\\\n        & $4\\thinspace{}^{1}B_{u}$ & $5.97$ & $4.10$ & $0.59$ \\\\\n\\colrule\nTriplet & $1\\thinspace{}^{3}B_{u}$ & $2.29$ & $0.00$ & $0.00$ \\\\\n        & $2\\thinspace{}^{3}B_{u}$ & $2.92$ & $0.00$ & $0.00$ \\\\\n        & $3\\thinspace{}^{3}B_{u}$ & $3.48$ & $0.00$ & $0.00$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\nThe relative ordering of the energy levels are closely associated with the effective correlation strength in linear $\\pi-$conjugated systems. In extended systems effective \ncorrelation strength can be \nthought of as the ratio of the on-site PPP correlation to the bandwidth of the one-particle spectrum. However, in molecules with discrete excitation spectrum, it is \ndifficult to use the width of the energy spectrum in place of the band width. Thus, it is difficult to a priori predict the ordering of the states based on one-particle \nbandwidth which are similar in all the molecules we have studied. In PPP or extended Hubbard model, the on-site correlation strength to a first approximation is expressed \nby $U_{PPP}\\sim (U-V_{12})$, where $V_{12}$ is the nearest-neighbor PPP term. Our calculations yield the lowest two-photon gap in ovalene molecule to be almost twice that \nof the lowest spin gap, which is a characteristic feature of regular polyene systems where two-photon state is predominantly two triplet excitations. The other two\nmolecules and substituted coronene, on the other hand, do not show this signature. Therefore, it can be suggested that the effective electronic correlation strength in\novalene molecule is comparable to regular polyene systems while the $\\pi-$ electrons in other molecules are less correlated. The ordering of low-lying singlet excited \nstates in coronene and ovalene, although, are in accordance with those in strongly correlated systems; the lowest optical states lie above the lowest two-photon states \nin both the systems. However, 1,12-benzoperylene shows some peculiar trend as the lowest two-photon state remains close to the lowest triplet state and quite low in energy \ncompared to $1\\thinspace{}^{1}B_{1}^{-}$, showing that in this system, we cannot view the $2\\thinspace{}^{1}A_{1}^{+}$ state as made up of two triplets generated in \ndifferent parts of the molecule.\n\nThe lowest two-photon gaps along with the lowest triplet gaps calculated in coronene and ovalene are in excellent agreement with the earlier report by Aryanpour \net al. \\cite{sumit-jcp}. The two-photon gaps reported earlier are $3.96$ eV and $3.03$ eV respectively for these systems, against $3.97$ eV and $3.10$ eV, found in our \ncalculations. The triplet gaps earlier reported are $2.38$ eV and $1.57$ eV for coronene and ovalene respectively, which are close to $2.35$ eV and $1.49$ eV obtained by \nus. However, the lowest one-photon gaps and relative positions of the lowest optical states with respect to the lowest two-photon states do not agree well with the \nprevious study. In coronene, the lowest optical gap reported earlier is $4.11$ eV while we have found two nearly degenerate excitations at higher energies of values, \n$4.83$ and $4.87$ eV. A low-lying state at an energy of $3.88$ eV, which has a small transition dipole appears in the same subspace as of the optical states. This is \nprobably because we have incorporated only one $C_2$ symmetry axis in our calculations. In DMRG calculations, for computing transition dipole moments we have used average \ndensity matrices, obtained from eigenstates of different symmetry subspaces and hence the spatial symmetry is not retained. This could lead to a small transition dipole \nmoment as an artifact for this state ($3.88 $ eV) although this state correspond $e-h$ allowed subspace and if spatial symmetry is not retained strictly we will have a weak \ntransition dipole. On the other hand, the $2.82$ eV excitation in coronene is optically forbidden as it belongs to the same e-h symmetry subspace as the ground state. \nThis argument is supported by the fact that this state acquires some intensity on breaking the $e-h$ symmetry by introducing substituents, as can be seen from Table. \n\\ref{energy-ppp2}. Thus it appears that as in benzene, in coronene the lowest degenerate excitations are pushed up in energy while the higher energy non-degenerate states \ncross these excitations on incorporating electron-electron interactions. In case of ovalene, we have found the lowest optical gap to be greater than the lowest two-photon \ngap while reverse ordering of states has been reported earlier. The earlier reported energy gap between the lowest one- and two-photon states as well as that\nobtained by us are relatively small. The earlier study used interaction parameters optimized to yield experimental gaps in condensed phase while our study employs\nparameters which are applicable to isolated molecules. In condensed phase the one-photon state will shift more towards the longer wavelength regime than two-photon state,\nthe former being ionic in nature. Thus we expect that the one-photon state will be below the two-photon state for ovalene in solution. The polarization in ovalene in\nthe lowest one-photon state is along the short axis while the higher energy optical excitation is long axis polarized. This is due to the fact that excitons with charge\nseparation along the short axis are more stable than those with separation along the long axis. Indeed, similar polarization for dipole excitations is also found in\npolyacenes \\cite{raghu-prb}.\n\n\\begin{table}[t]\n\\small\n\\begin{center}\n\\caption{\\label{trip_energy} Lowest triplet state energies obtained in $M_S=1$ sector and in $M_S=0$ sector with $\\chi_P=-1$ for coronene, ovalene and 1,12-benzoperylene \nin units of eV.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccc}\n & $M_S=1$ & $M_S=0, \\chi_P=-1$  \\\\\n\\colrule\nCoronene & $-58.67378$ & $-58.56182$  \\\\\nOvalene  & $-80.50885$ & $-80.37843$  \\\\\n1,12-Benzoperylene & $-52.54237$ & $-52.32442$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n \n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics*[height=5.5cm]{dblocc.eps}\n\\caption{\\label{dblocc}(Color online) Double occupancy plot with site index for coronene (top panel), ovalene (middle panel) and 1,12-benzoperylene (bottom panel). As \nall molecules are symmetric about $C_2$ axis, only half of the molecular sites are plotted, the other half being symmetry equivalent to it. The color scheme for double \noccupancy in different eigenstates are same in all three panels and are as follows: ground state (black filled circles), lowest two-photon state (red filled square), \nlowest optical state (green filled triangles) and lowest triplet state (blue open squares). Double occupancy in the other partner of the degenerate optical states in \ncoronene is shown by green broken line with open triangles. Lines connecting data points are given only as a guide to the eye.}\n\\end{center}\n\\end{figure}\n\nThe lowest triplet state energy in each of the molecules can be calculated in two ways while employing both $C_2$ and $J$ symmetries -- either by calculating the lowest \nenergy state in $M_S=1$ sector or by calculating the lowest energy state in the $M_S=0$ space with $\\chi_P=-1$. The energies obtained by both calculations are given\nin Table. \\ref{trip_energy}. It can be observed that the energies obtained in $M_S=1$ sector calculations are lower. This can be attributed to the larger Hilbert space\nof the $M_S=1$ state for a given DMRG cut-off compared to the Hilbert space dimension of the $M_S=0$ space with $\\chi_P=-1$. In fact, the parity symmetry almost bisects \nthe complete direct product space and therefore, the effective size of the Hilbert space becomes half of that in $M_S=1$ sector calculation. As DMRG is a variational \ntechnique, accuracy increases with the dimension of the Hilbert space and hence, the $M_S=1$ sector calculations are more accurate.  \n\nSpin gap is  also a good measure of electronic correlation strength. For a PPP chain, the spin gap can be estimated from the Heisenberg model, with an antiferromagnetic \n$J\\sim 4t^2/U_{PPP}$. This implies that with increasing effective correlation strength, the gap between the lowest singlet state and the lowest triplet state reduces. \nAccording to this line of argument, ovalene has the highest effective correlation strength while 1,12-Benzoperylene has the lowest among the molecules sited in \nTable. \\ref{energy-ppp1} and \\ref{energy-ppp2}. \n\nSubstitution by donor-acceptor groups does not seem to have appreciable effect on correlation strength, although, the lifting of electron-hole symmetry allows optical \ntransition to states which are labelled as dipole-forbidden in unsubstituted molecules. The extent of mixing of different symmetry states of the unsubstituted system due \nto substitution depends on the strength of the donor-acceptor groups. In the present case, the dipole-forbidden $1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+}$\nstate in unsubstituted coronene becomes symmetry allowed due to substitution and corresponds to the lowest optical state in substituted coronene. \n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=5.5cm]{spnden.eps}\n\\caption{\\label{spnden} Spin density plot for coronene (top panel), ovalene (middle) and 1,12-benzoperylene (bottom) in the lowest triplet state. The data points are \nconnected by a line for sake of smooth vision.}\n\\end{center}\n\\end{figure}\n\nIt is evident from above that the effective electron correlation strength is not controlled by the symmetry of the molecule; while coronene is the molecule with highest \nsymmetry $(D_{6h})$, substitution by donor-acceptor groups lowers the symmetry to $C_{2h}$, yet, the effective correlation strength in both the systems as indicated by \nthe spin gaps and relative positions of the energy levels, are comparable. \nOvalene is also a lower symmetry molecule $(D_{2h})$ than coronene, but appears to have large effective correlation strength. On the contrary, 1,12-benzoperylene \n$(C_{2v})$ being of similar symmetry to substituted coronene, seems to have rather low effective correlation strength compared with the latter.\n\nSpin density at different sites in the lowest triplet state, which is the expectation value of $\\langle {\\hat{S}_i}^z\\rangle$ in this state is plotted for different \nmolecules in Fig. \\ref{spnden}. In the coronene molecule we noted that the spin density is highest at sites 1, 8, 17 and 24 which are all related by symmetry of the \nmolecule. The fractional double occupancies at the above mentioned sites are small (Fig. \\ref{dblocc}), which is consistent with the higher spin densities at these sites. \nHowever, the bond order pattern along the periphery has period four and correspond to \n$\\mbox{\\st{  ( }}\\phantom{.}{=\\joinrel=}\\phantom{.} \\mbox{---} \\phantom{.}\\mbox{---}\\phantom{.} {=\\joinrel=}\\phantom{.}{\\mbox{\\st{  ) }}}_n$ \nwhich is unusual as one would expect a quinonoidal \nstructure from the spin density data. On the contrary, the spin densities are well-localized at sites 1 and $32$ in ovalene and at 2 and $21$ in 1,12-benzoperylene (Fig. \n\\ref{molecule} and \\ref{spnden}). In ovalene and 1,12-benzoperylene, there are many sites with negative spin densities unlike in the case of coronene. Again, we noted that\nthe fractional double occupancy is least at sites with high positive spin densities (Fig. \\ref{dblocc}). The peripheral bond order in ovalene has period four with kinks \nat the high spin density sites at the middle of the molecule. Bond $11$ and its symmetry partners (Fig. \\ref{molecule}) in the interior two benzene rings are \nrather weak as compared to that in the ground state and we can expect puckering of the structure in the triplet state. In 1,12-benzoperylene also we find bond order \npattern with period four on the periphery if we exclude bonds involving the high spin density sites. In substituted coronene, the spin density distribution is not \nsensitive to the strength of the substituents considered in this study.\n\n\\begin{table*}[t]\n\\begin{center}\n\\caption{\\label{bondorder} Bond order for coronene, substituted coronene, ovalene and 1,12-benzoperylene in ground state, lowest two-photon state, lowest optical state \nand lowest triplet state. The bond indices are according to Fig. \\ref{molecule}.}\n\\begin{ruledtabular}\n\\begin{tabular}{c|cccc|cccc|cccc|cccc}\n&\\multicolumn{4}{c|}{Coronene} & \\multicolumn{4}{c|}{Substituted coronene} & \\multicolumn{4}{c|}{Ovalene} & \\multicolumn{4}{c}{1,12-Benzoperylene} \\\\\n\\colrule\n&  &  &  &  &  &  &  &  &  &  &  &  &  &  &  &  \\\\\nBond &  & $2\\thinspace{}^{1}A_{g}^{+}$ & $1\\thinspace{}^{1}B_{2u}^{-}$ & $1\\thinspace{}^{3}B_{2u}^{+}$ &  &  &  &  &  & $2\\thinspace{}^{1}A_{g}^{+}$ &  & \n$1\\thinspace{}^{3}B_{2u}^{+}$ &  &  &  &  \\\\\nindex & $1\\thinspace{}^{1}A_{g}^{+}$ & or & and & or &  \n$1\\thinspace{}^{1}A_{g}$ & $2\\thinspace{}^{1}A_{g}$ & $1\\thinspace{}^{1}B_{u}$ & $1\\thinspace{}^{3}B_{u}$ & \n$1\\thinspace{}^{1}A_{g}^{+}$ & or & $1\\thinspace{}^{1}B_{2u}^{-}$ & or &\n$1\\thinspace{}^{1}A_{1}^{+}$ & $2\\thinspace{}^{1}A_{1}^{+}$ & $1\\thinspace{}^{1}B_{1}^{-}$ & $1\\thinspace{}^{3}B_{1}^{+}$ \\\\\n& & $2\\thinspace{}^{1}B_{1g}^{+}$ & $1\\thinspace{}^{1}B_{3u}^{-}$ & $1\\thinspace{}^{3}B_{3u}^{+}$ & \n&  &  &  &\n& $2\\thinspace{}^{1}B_{1g}^{+}$ &  & $1\\thinspace{}^{3}B_{3u}^{+}$ &\n&  &  &  \\\\\n&  &  &  &  &  &  &  &  &  &  &  &  &  &  &  &  \\\\\n\\colrule\n1 & 0.74 & 0.64 & 0.69 & 0.68 & 0.74 & 0.64 & 0.67 & 0.70 & 0.70 & 0.75 & 0.74 & 0.75 & 0.35 & 0.42 & 0.43 & 0.52 \\\\\n\n2 & 0.50 & 0.52 & 0.52 & 0.50 & 0.50 & 0.52 & 0.51 & 0.49 & 0.53 & 0.45 & 0.49 & 0.46 & 0.64 & 0.57 & 0.53 & 0.47 \\\\\n\n3 & 0.50 & 0.51 & 0.52 & 0.53 & 0.50 & 0.51 & 0.52 & 0.54 & 0.47 & 0.56 & 0.52 & 0.55 & 0.58 & 0.55 & 0.58 & 0.48 \\\\\n\n4 & 0.74 & 0.67 & 0.66 & 0.63 & 0.74 & 0.67 & 0.65 & 0.62 & 0.76 & 0.63 & 0.71 & 0.67 & 0.69 & 0.65 & 0.67 & 0.71 \\\\\n\n5 & 0.50 & 0.45 & 0.47 & 0.50 & 0.50 & 0.44 & 0.48 & 0.50 & 0.44 & 0.54 & 0.47 & 0.52 & 0.55 & 0.54 & 0.52 & 0.45 \\\\\n\n6 & 0.56 & 0.46 & 0.49 & 0.48 & 0.56 & 0.47 & 0.46 & 0.47 & 0.57 & 0.43 & 0.53 & 0.48 & 0.46 & 0.50 & 0.50 & 0.53 \\\\\n\n7 & 0.47 & 0.56 & 0.53 & 0.53 & 0.50 & 0.56 & 0.54 & 0.54 & 0.55 & 0.51 & 0.53 & 0.52 & 0.76 & 0.67 & 0.68 & 0.65 \\\\\n\n8 & 0.47 & 0.43 & 0.48 & 0.49 & 0.46 & 0.42 & 0.48 & 0.49 & 0.51 & 0.50 & 0.50 & 0.50 & 0.46 & 0.49 & 0.53 & 0.54 \\\\\n\n9 & 0.56 & 0.58 & 0.51 & 0.50 & 0.56 & 0.58 & 0.49 & 0.51 & 0.47 & 0.51 & 0.49 & 0.50 & 0.52 & 0.53 & 0.45 & 0.45 \\\\\n\n10 &  &  &  &  &  &  &  &  & 0.53 & 0.54 & 0.53 & 0.54 & 0.72 & 0.57 & 0.74 & 0.73 \\\\\n\n11 &  &  &  &  &  &  &  &  & 0.52 & 0.44 & 0.46 & 0.45 & 0.52 & 0.48 & 0.50 & 0.46 \\\\\n\n12 &  &  &  &  &  &  &  &  & 0.47 & 0.58 & 0.55 & 0.58 & 0.54 & 0.46 & 0.50 & 0.53 \\\\\n\n13 &  &  &  &  &  &  &  &  &  &  &  &  & 0.47 & 0.56 & 0.52 & 0.52 \\\\\n\n14 &  &  &  &  &  &  &  &  &  &  &  &  & 0.48 & 0.45 & 0.48 & 0.47 \\\\\n\n15 &  &  &  &  &  &  &  &  &  &  &  &  & 0.57 & 0.43 & 0.47 & 0.49 \\\\\n\\end{tabular}\n\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\nWe have tabulated the bond order values of different bonds, as indexed in Fig. \\ref{molecule} in lowest energy states of each symmetry subspaces, \nfor all the four molecules studied here. \nThe bond order values are related to bond lengths as indicated by Coulson \\cite{coulson}; bonds with higher bond order value has more double bond character while low value \ndepicts that the bond is primarily a single bond. The repercussion of similar bond order values for different bonds in coronene establishes $D_{6h}$ symmetry of the \nground state. This particular symmetry is not retained in the excited states indicating distorted equilibrium structures in these states. In excited states the bonds are \nsymmetric about two in-plane $C_2$ axes, which bisects the molecule. In two-photon state, a quinonoid structure emerges at the central part of the molecule, while in the \ndoubly degenerate optical states, which have almost similar bond orders and in the lowest triplet state the central \nbenzene ring gets squeezed compared to ground state and its connectivity to the peripheral benzene rings becomes weaker. Similar structures appear even in substituted \ncoronene. Small variation in bond orders for bonds connected to donor or acceptor sites are quite expected as the effective hopping amplitudes for bonds involving these \nsites will be different from the rest of the molecule. In ovalene, the edge bonds switch their character from double bond to single bond and vice versa in two-photon \nstate and triplet state, relative to those in the ground state. In optical state, the edge bonds become more or less of same character as all the bond orders become \nnearly equal. Yet, the most notable bond variation in ovalene is for the bonds 11 and 12 and their symmetry partners, which also switch their character like the edge \nbonds, but in all excited states; other bonds in the inner part of the molecule remain almost invariant. However, the biggest variation in bond order is observed in \nthe lowest triplet state of 1,12-benzoperylene when compared to the ground state bond orders. The Pauli blocking at the sites 2 and 21 converts the bond $1$ from a single \nbond to a double bond. Weakening of neighboring bonds can also be attributed to the Pauli blocking. Bond orders of most of the peripheral and ring bonds become nearly \nequal while bonds parallel to bond $1$ remain approximately same in all states. In the two-photon state, overall expansion of the structure is observed while in the \noptical state, most significant variation in bond order occurs in the lowermost ring as shown in Fig. \\ref{molecule}. The bond order of the weakest bond of the molecule \nincreases both in the two-photon state and the optical state also, but rather small compared to that in the triplet state.\n\nThe charge gap of a system is defined as the energy required to remove an electron from a neutral molecule and placing it on another neutral molecule. This \nprocess gives rise to two charged species of different charges and can be represented by the reaction \\cite{raghu-prb}: \n\n", "itemtype": "equation", "pos": 28840, "prevtext": "\n\\noindent\nThe transformed Hamiltonian is then diagonalized to get lowest-lying eigenvectors in different irreducible representations labeled as ${}^eA^{+}$, ${}^eB^{+}$, ${}^eA^{-}$,\n${}^eB^{-}$, ${}^oA^{+}$, ${}^oB^{+}$, ${}^oA^{-}$ and ${}^oB^{-}$, where the left-hand superscript represents character under $P$-symmetry, the right superscript is the \ncharacter under $J$-symmetry and the letter $A/B$ is the character under $C_2$ symmetry in the irreducible representation $\\Gamma$. The singlet lies in the `e' space while\nthe triplet lies in the `o' space. The space `+' refers to `covalent' space while `-' to the `ionic' space. $A (B)$ represents the space even (odd) under $C_2$ symmetry.\nThe ground state is usually in ${}^eA^{+}$ while the optically connected space is ${}^eB^{-}$. The lowest triplet lies in the ${}^oB^{+}$ space.\n\n\\subsection{Model Hamiltonian}\n\nThe model Hamiltonian employed for the study of peri-condensed polyacenes is the well known Pariser-Parr-Pople (PPP) Hamiltonian \\cite{pariser-parr, *pople}, which \nconsiders long-range Coulombic interaction along with on-site Hubbard interaction:\n\n", "index": 29, "text": "\\begin{equation}\n\\begin{split}\nH &=\\sum_{<i,j>,\\sigma} t_0 (\\hat c_{i,\\sigma}^\\dagger \\hat c_{j,\\sigma}^{} +\\mbox{ H.C.}) + \\sum_i \\epsilon_i \\hat n_i\\\\ \n&+\\sum_i \\frac {U}{2} \\hat n_i (\\hat n_i-1) + \\sum_{i>j} V_{ij}(\\hat n_i-z_i)(\\hat n_j-z_j) \n\\end{split}\n\\label{ppp}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle H&amp;\\displaystyle=\\sum_{&lt;i,j&gt;,\\sigma}t_{0}(\\hat{c}_{i%&#10;,\\sigma}^{\\dagger}\\hat{c}_{j,\\sigma}+\\mbox{ H.C.})+\\sum_{i}\\epsilon_{i}\\hat{n}%&#10;_{i}\\\\&#10;&amp;\\displaystyle+\\sum_{i}\\frac{U}{2}\\hat{n}_{i}(\\hat{n}_{i}-1)+\\sum_{i&gt;j}V_{ij}(%&#10;\\hat{n}_{i}-z_{i})(\\hat{n}_{j}-z_{j})\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mi>H</mi></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow><mo>,</mo><mi>j</mi><mo>⁣</mo><mrow><mo>&gt;</mo><mo>,</mo><mi>σ</mi></mrow></mrow></munder><mrow><msub><mi>t</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>i</mi><mo>,</mo><mi>σ</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><msub><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>j</mi><mo>,</mo><mi>σ</mi></mrow></msub></mrow><mo>+</mo><mtext> H.C.</mtext></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>ϵ</mi><mi>i</mi></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><mi>U</mi><mn>2</mn></mfrac><mo>⁢</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>&gt;</mo><mi>j</mi></mrow></munder><mrow><msub><mi>V</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>-</mo><msub><mi>z</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi></msub><mo>-</mo><msub><mi>z</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\nThe charge gap for a system can be calculated by obtaining the lowest energies in the hole and electron doped systems, and subtracting from their sum the energy of \ntwo neutral molecules:\n\n", "itemtype": "equation", "pos": 59664, "prevtext": "\n\\noindent\n$t_0$ is the nearest-neighbor hopping integral between bonded sites `i' and `j', $\\epsilon_i$ is the site energy of `i'-th carbon atom while $U$ is the on-site Coulomb \nrepulsion term. The intersite interaction energies, $V_{ij}$ are interpolated by Ohno scheme \\cite{ohno, *klopman} assuming C-C bond length of $1.4$ \\AA. \n$\\hat c_{i,\\sigma}^\\dagger$ and $\\hat c_{i,\\sigma}^{}$ are the creation and annihilation operators of an electron with spin $\\sigma$ in the $2p_z$ orbital of the carbon \natom at site `i' and $\\hat n_i=\\sum_{\\sigma} \\hat c_{i,\\sigma}^\\dagger \\hat c_{i,\\sigma}^{}$ is the corresponding number operator. For carbon atoms, the standard PPP \nparameters are $t_0=-2.4$ eV and $U=11.26$ eV while the site energy $(\\epsilon)$ for unsubstituted carbon atom is taken to be zero. $z_i$ is the local chemical potential, \nexpressed by the the number of electrons at site `i' which leaves the site neutral; for carbon atoms in a $\\pi$-conjugated system, $z_i=1$. Substitution effect by donor \nor acceptor groups can be modeled by considering the site energy $\\epsilon_i$ positive or negative respectively. \n\nAs DMRG calculations are done in constant $M_S$-basis space, contrary to the spin-adapted basis (Diagrammatic valence bond basis) calculations, labelling states by \ntheir spin value is ambiguous. The parity symmetry partially resolves this as the singlet state lies in the even-parity subspace while the triplet state lies in the \nodd-parity subspace. Though, higher spin states also lie in the even (odd) parity sub-spaces, they remain high in energy compared to singlet and triplet states in moderate \nsized carbon-based systems and so can be neglected \\cite{raghu-prb}. \n\n\\subsection{Comparison with exact calculation results}\n\nThe accuracy of our modified algorithm can be established by comparing the results obtained for small systems with exact PPP results, like in $16$-site polyene chain \nand tetracene molecule which has 18 sites. The difference between ground state energy of $16$-site polyene chain, obtained by symmetrized DMRG technique, and the  \nexact calculation result is plotted for four different cutoff values $M'^l$ in the sector $\\{ \\mu_i^L(n_s \\ge n_e,M_S \\le 0)\\}$ of the sub-block in Fig. \\ref{16site-ppp}. \nIn all the calculations, the energy values are accurate at least up to fifth decimal places when compared with exact calculation results. We have also plotted the \nfluctuations in the DMRG energy about the exact energy with number of finite DMRG sweeps for a fixed $M'^l$ value, which depicts that the fluctuation is negligible with \nnumber of sweeps and therefore, $2-3$ sweeps will suffice for acceptable convergence of energy.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=5.5cm]{errmax.eps}\n\\caption{\\label{16site-ppp}(Color online) Deviation of ground state energy calculated by symmetrized DMRG technique from exact energy value for different cutoff $M'^l$ of \nthe density matrix eigenstate space. The number of finite DMRG sweeps $(2)$ is fixed in all the cases. Inset: Fluctuation of DMRG ground state energy with respect to exact \nenergy value with increasing number of finite DMRG sweeps. The number of density matrix eigenstates retained, $M'^l$, is 225.}\n\\end{center}\n\\end{figure}\n\nIn Table \\ref{tetracene-ppp}, PPP energies of the ground state $({1}^1A^{+})$, lowest two-photon state $({2}^1A^{+})$, lowest one-photon state $({1}^1B^{-})$ and of the \nlowest triplet state $({1}^3B^{+})$ of both $16$-site polyene chain and tetracene molecule are presented. $M'^l$ is kept at $225$ for $16$-site polyene chain and $425$ for \ntetracene molecule, thus total number of DMEs retained for the sub-block is $\\sim 550$ and $\\sim 1000$ respectively at each step of DMRG calculation. Full CI \ncalculations, employing diagrammatic valence bond method (DVB) \\cite{ramasesh-ijqc}, shows excellent agreement with the results obtained and the upper bound of error in \nenergies of different states is of the order of $10^{-4}$.\n\n\\begin{table}[b]\n\\begin{center}\n\\caption{\\label{tetracene-ppp} Comparison of the energies of ground state, lowest two-photon state, lowest optical state and lowest triplet state of $16$-site polyene chain \nand tetracene, obtained by modified symmetrized DMRG algorithm and exact calculation. The exact calculations are carried out using diagrammatic valence bond method.}\n\\begin{ruledtabular}\n\\begin{tabular}{cccc}\nSystem & State & Exact calculation & DMRG calculation \\\\\n\\colrule\nPolyene of & ${1}^1A^{+}$ & $-33.55575$ & $-33.55575$ \\\\\n$16$ sites & ${2}^1A^{+}$ & $-32.03385$ & $-32.03385$ \\\\\n     & ${1}^1B^{-}$ & $-30.43291$ & $-30.43291$ \\\\\n     & ${1}^3B^{+}$ & $-32.87993$ & $-32.87993$ \\\\\n\\colrule\nTetracene & ${1}^1A^{+}$ & $-43.69083$ & $-43.69076$  \\\\\nmolecule  & ${2}^1A^{+}$ & $-40.55749$ & $-40.55725$  \\\\\n     & ${1}^1B^{-}$ & $-40.51439$ & $-40.51419$  \\\\\n     & ${1}^3B^{+}$ & $-42.47046$ & $-42.47038$  \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=6.3cm]{molecule_copy.eps}\n\\caption{\\label{molecule}(Color online) Schematic diagrams of coronene, 1,12-benzoperylene and ovalene with site (black and bold) and bond (red and italics) indices. \nThe sites of substitution in substituted coronene are indicated in curly brackets; $+\\epsilon$ (sites $1$ and $24$) represents a donor site while $-\\epsilon$ (sites \n$8$ and $17$) represents an acceptor site.}\n\\end{center}\n\\end{figure}\n\n\\section{Results and Discussion}\n\nWe have studied a few low-lying states of coronene, ovalene and $1,12-$benzoperylene in different symmetry spaces considering $\\sim 1000$ DMEs in PPP model and the \nenergy gaps are tabulated in Table. \\ref{energy-ppp1} and \\ref{energy-ppp2}. We have also calculated energies in the above symmetry spaces for substituted coronene, with \ndonor and acceptor groups of equal strength, set to $1.0$ eV ($|\\epsilon|=1.0$ eV). We have employed only a few of the existing spatial symmetries of the molecules, namely \n$C_2$ symmetry axis perpendicular to the molecular plane (in plane $C_2$ axis in case of  $1,12-$benzoperylene) for our calculations, as our DMRG calculations cannot \nincorporate more than one symmetry axis. Being treated as planar molecules, with Wannier orbitals, the reflection in the molecular plane is a trivial symmetry.\nYet, we can label the eigenstates according to different irreducible representations of the full group based on transition dipole moment direction for excitations from \nthe ground state. In case of coronene, we have considered its subgroup $D_{2h}$ rather than the full group $D_{6h}$ for labelling the eigenstates. The lowest optical states \nobtained may not be the states with highest transition dipole moment, which will be prominent in UV-visible spectroscopy but corresponds to the lowest energy state of the \nappropriate symmetry subspace; however, the results obtained are in good agreement with gas phase molecular spectroscopic data available for above molecules \\cite{patter}, \nsuggesting that the states obtained are also the ones with considerable transition dipoles in the energy range of the experiment.\n\n\\begin{table*}[t]\n\\begin{center}\n\\caption{\\label{energy-ppp1} Lowest energy states in coronene and ovalene with the energy gaps in units of eV. Although coronene has $D_{6h}$ symmetry, \nhere the energy states are labelled according to Abelian $D_{2h}$ symmetry representations. The transition dipole moment from ground state to the excited states \n$(\\mu_{tr,x/y})$ along specific axes are also specified in the last two columns in units of Debye.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccccc}\n\\multicolumn{5}{c}{Coronene} \\\\\n\\colrule\nNature of the state & State level & Energy Gap & $\\mu_{tr,x}(D)$ & $\\mu_{tr,y}(D)$ \\\\\n\\colrule\nTwo-photon & $(2\\thinspace{}^{1}A_{g}^{+}/ 1\\thinspace{}^{1}B_{1g}^{+})\\footnote{Probable labels for states which cannot be identified uniquely are given within \nparentheses.}$ & $3.97$ & $0.00$ & $0.00$ \\\\\n           & $(3\\thinspace{}^{1}A_{g}^{+}/ 2\\thinspace{}^{1}B_{1g}^{+})$ & $4.09$ & $0.00$ & $0.00$ \\\\\n           & $(4\\thinspace{}^{1}A_{g}^{+}/ 3\\thinspace{}^{1}B_{1g}^{+})$ & $5.08$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{2u}^{-}$ & $4.83$ & $0.81\\footnote{Non-zero value of transition dipole moment along polarization direction forbidden by symmetry \nis an artifact of the calculations as average density matrices, calculated from eigenstates of different symmetry subspaces, are employed to determine the transition \ndipole moment. However, the errors are negligible as intensities depend on the square of the transition dipole moment.}$ & $8.43$ \\\\\n        & $1\\thinspace{}^{1}B_{3u}^{-}$ & $4.87$ & $7.51$ & $0.49$ \\\\\n\\colrule\nTriplet & $(1\\thinspace{}^{3}B_{2u}^{+}/ 1\\thinspace{}^{3}B_{3u}^{+})$ & $2.35$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}B_{2u}^{+}/ 2\\thinspace{}^{3}B_{3u}^{+})$ & $3.00$ & $0.00$ & $0.00$ \\\\\n        & $(3\\thinspace{}^{3}B_{2u}^{+}/ 3\\thinspace{}^{3}B_{3u}^{+})$ & $3.02$ & $0.00$ & $0.00$ \\\\\n        & $(1\\thinspace{}^{3}A_{g}^{+}/  1\\thinspace{}^{3}B_{1g}^{+})$ & $3.35$ & $0.00$ & $0.00$ \\\\\n\\colrule\nDark states & $(1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+})$ & $2.82$ & $0.00$ & $0.00$ \\\\\n            & $(x\\thinspace{}^{1}B_{2u}^{-}$/ $x\\thinspace{}^{1}B_{3u}^{-})\\footnote{x implies that the level numbering is unknown.}$ & $3.88$ & $0.28$ & $1.74$  \\\\\n            & $(1\\thinspace{}^{1}A_{g}^{-}/ 1\\thinspace{}^{1}B_{1g}^{-})$ & $4.73$ & $0.00$ & $0.00$ \\\\\n\\colrule\n\\multicolumn{5}{c}{Ovalene} \\\\\n\\colrule\nTwo-photon & $(2\\thinspace{}^{1}A_{g}^{+}/ 1\\thinspace{}^{1}B_{1g}^{+})$ & $3.10$ & $0.00$ & $0.00$ \\\\\n           & $(3\\thinspace{}^{1}A_{g}^{+}/ 2\\thinspace{}^{1}B_{1g}^{+})$ & $3.75$ & $0.00$ & $0.00$ \\\\\n           & $(4\\thinspace{}^{1}A_{g}^{+}/ 3\\thinspace{}^{1}B_{1g}^{+})$ & $5.48$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{2u}^{-}$ & $3.32$ & $0.29$ & $6.58$ \\\\\n        & $2\\thinspace{}^{1}B_{2u}^{-}$ & $4.53$ & $0.33$ & $0.58$ \\\\\n        & $1\\thinspace{}^{1}B_{3u}^{-}$ & $4.64$ & $7.28$ & $0.22$ \\\\\n\\colrule\nTriplet & $(1\\thinspace{}^{3}B_{2u}^{+}/ 1\\thinspace{}^{3}B_{3u}^{+})$ & $1.49$ & $0.00$ & $0.00$ \\\\\n        & $(1\\thinspace{}^{3}A_{g}^{+}/ 1\\thinspace{}^{3}B_{1g}^{+})$ & $2.77$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}A_{g}^{+}/ 2\\thinspace{}^{3}B_{1g}^{+})$ & $2.80$ & $0.00$ & $0.00$ \\\\\n        & $(2\\thinspace{}^{3}B_{2u}^{+}/ 2\\thinspace{}^{3}B_{3u}^{+})$ & $2.82$ & $0.00$ & $0.00$ \\\\\n\\colrule\nDark states & $(1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+})$ & $2.65$ & $0.00$ & $0.00$ \\\\\n            & $(1\\thinspace{}^{1}A_{g}^{-}/ 1\\thinspace{}^{1}B_{1g}^{-})$ & $4.06$ & $0.00$ & $0.00$ \\\\\n            & $(2\\thinspace{}^{1}A_{g}^{-}/ 2\\thinspace{}^{1}B_{1g}^{-})$ & $4.69$ & $0.00$ & $0.00$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table*}[tp]\n\\begin{center}\n\\caption{\\label{energy-ppp2} Lowest energy states in 1,12-benzoperylene and substituted coronene with the energy gaps in units of eV. The transition \ndipole moment from ground state to the excited states $(\\mu_{tr,x/y})$ along specific axes are also specified in the last two columns in units of Debye.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccccc}\n\\multicolumn{5}{c}{1,12-Benzoperylene} \\\\\n\\colrule\nNature of the state & State level & Energy Gap & $\\mu_{tr,x}(D)$ & $\\mu_{tr,y}(D)$ \\\\\n\\colrule\nTwo-photon & $2\\thinspace{}^{1}A_{1}^{+}$ & $2.99$ & $0.00$ & $0.00$ \\\\\n           & $3\\thinspace{}^{1}A_{1}^{+}$ & $4.26$ & $0.00$ & $0.00$ \\\\\n\t   & $4\\thinspace{}^{1}A_{1}^{+}$ & $4.58$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{1}^{-}$ & $3.72$ & $0.00$ & $3.17$ \\\\\n        & $2\\thinspace{}^{1}B_{1}^{-}$ & $4.71$ & $0.00$ & $3.83$ \\\\\n        & $3\\thinspace{}^{1}B_{1}^{-}$ & $4.83$ & $0.00$ & $5.20$ \\\\\n\\colrule\nTriplet & $1\\thinspace{}^{3}B_{1}^{+}$ & $2.84$ & $0.00$ & $0.00$ \\\\\n        & $2\\thinspace{}^{3}B_{1}^{+}$ & $3.65$ & $0.00$ & $0.00$ \\\\\n        & $3\\thinspace{}^{3}B_{1}^{+}$ & $4.26$ & $0.00$ & $0.00$ \\\\\n\\colrule\n\\multicolumn{5}{c}{Substituted coronene} \\\\\n\\colrule\nTwo-photon & $2\\thinspace{}^{1}A_{g}$ & $4.01$ & $0.00$ & $0.00$ \\\\ \n           & $3\\thinspace{}^{1}A_{g}$ & $4.81$ & $0.00$ & $0.00$ \\\\\n\t   & $4\\thinspace{}^{1}A_{g}$ & $4.90$ & $0.00$ & $0.00$ \\\\\n\\colrule\nOptical & $1\\thinspace{}^{1}B_{u}$ & $2.90$ & $0.00$ & $0.23$ \\\\\n        & $2\\thinspace{}^{1}B_{u}$ & $3.87$ & $0.12$ & $1.46$ \\\\\n        & $3\\thinspace{}^{1}B_{u}$ & $5.18$ & $0.17$ & $7.52$ \\\\\n        & $4\\thinspace{}^{1}B_{u}$ & $5.97$ & $4.10$ & $0.59$ \\\\\n\\colrule\nTriplet & $1\\thinspace{}^{3}B_{u}$ & $2.29$ & $0.00$ & $0.00$ \\\\\n        & $2\\thinspace{}^{3}B_{u}$ & $2.92$ & $0.00$ & $0.00$ \\\\\n        & $3\\thinspace{}^{3}B_{u}$ & $3.48$ & $0.00$ & $0.00$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\nThe relative ordering of the energy levels are closely associated with the effective correlation strength in linear $\\pi-$conjugated systems. In extended systems effective \ncorrelation strength can be \nthought of as the ratio of the on-site PPP correlation to the bandwidth of the one-particle spectrum. However, in molecules with discrete excitation spectrum, it is \ndifficult to use the width of the energy spectrum in place of the band width. Thus, it is difficult to a priori predict the ordering of the states based on one-particle \nbandwidth which are similar in all the molecules we have studied. In PPP or extended Hubbard model, the on-site correlation strength to a first approximation is expressed \nby $U_{PPP}\\sim (U-V_{12})$, where $V_{12}$ is the nearest-neighbor PPP term. Our calculations yield the lowest two-photon gap in ovalene molecule to be almost twice that \nof the lowest spin gap, which is a characteristic feature of regular polyene systems where two-photon state is predominantly two triplet excitations. The other two\nmolecules and substituted coronene, on the other hand, do not show this signature. Therefore, it can be suggested that the effective electronic correlation strength in\novalene molecule is comparable to regular polyene systems while the $\\pi-$ electrons in other molecules are less correlated. The ordering of low-lying singlet excited \nstates in coronene and ovalene, although, are in accordance with those in strongly correlated systems; the lowest optical states lie above the lowest two-photon states \nin both the systems. However, 1,12-benzoperylene shows some peculiar trend as the lowest two-photon state remains close to the lowest triplet state and quite low in energy \ncompared to $1\\thinspace{}^{1}B_{1}^{-}$, showing that in this system, we cannot view the $2\\thinspace{}^{1}A_{1}^{+}$ state as made up of two triplets generated in \ndifferent parts of the molecule.\n\nThe lowest two-photon gaps along with the lowest triplet gaps calculated in coronene and ovalene are in excellent agreement with the earlier report by Aryanpour \net al. \\cite{sumit-jcp}. The two-photon gaps reported earlier are $3.96$ eV and $3.03$ eV respectively for these systems, against $3.97$ eV and $3.10$ eV, found in our \ncalculations. The triplet gaps earlier reported are $2.38$ eV and $1.57$ eV for coronene and ovalene respectively, which are close to $2.35$ eV and $1.49$ eV obtained by \nus. However, the lowest one-photon gaps and relative positions of the lowest optical states with respect to the lowest two-photon states do not agree well with the \nprevious study. In coronene, the lowest optical gap reported earlier is $4.11$ eV while we have found two nearly degenerate excitations at higher energies of values, \n$4.83$ and $4.87$ eV. A low-lying state at an energy of $3.88$ eV, which has a small transition dipole appears in the same subspace as of the optical states. This is \nprobably because we have incorporated only one $C_2$ symmetry axis in our calculations. In DMRG calculations, for computing transition dipole moments we have used average \ndensity matrices, obtained from eigenstates of different symmetry subspaces and hence the spatial symmetry is not retained. This could lead to a small transition dipole \nmoment as an artifact for this state ($3.88 $ eV) although this state correspond $e-h$ allowed subspace and if spatial symmetry is not retained strictly we will have a weak \ntransition dipole. On the other hand, the $2.82$ eV excitation in coronene is optically forbidden as it belongs to the same e-h symmetry subspace as the ground state. \nThis argument is supported by the fact that this state acquires some intensity on breaking the $e-h$ symmetry by introducing substituents, as can be seen from Table. \n\\ref{energy-ppp2}. Thus it appears that as in benzene, in coronene the lowest degenerate excitations are pushed up in energy while the higher energy non-degenerate states \ncross these excitations on incorporating electron-electron interactions. In case of ovalene, we have found the lowest optical gap to be greater than the lowest two-photon \ngap while reverse ordering of states has been reported earlier. The earlier reported energy gap between the lowest one- and two-photon states as well as that\nobtained by us are relatively small. The earlier study used interaction parameters optimized to yield experimental gaps in condensed phase while our study employs\nparameters which are applicable to isolated molecules. In condensed phase the one-photon state will shift more towards the longer wavelength regime than two-photon state,\nthe former being ionic in nature. Thus we expect that the one-photon state will be below the two-photon state for ovalene in solution. The polarization in ovalene in\nthe lowest one-photon state is along the short axis while the higher energy optical excitation is long axis polarized. This is due to the fact that excitons with charge\nseparation along the short axis are more stable than those with separation along the long axis. Indeed, similar polarization for dipole excitations is also found in\npolyacenes \\cite{raghu-prb}.\n\n\\begin{table}[t]\n\\small\n\\begin{center}\n\\caption{\\label{trip_energy} Lowest triplet state energies obtained in $M_S=1$ sector and in $M_S=0$ sector with $\\chi_P=-1$ for coronene, ovalene and 1,12-benzoperylene \nin units of eV.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccc}\n & $M_S=1$ & $M_S=0, \\chi_P=-1$  \\\\\n\\colrule\nCoronene & $-58.67378$ & $-58.56182$  \\\\\nOvalene  & $-80.50885$ & $-80.37843$  \\\\\n1,12-Benzoperylene & $-52.54237$ & $-52.32442$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n \n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics*[height=5.5cm]{dblocc.eps}\n\\caption{\\label{dblocc}(Color online) Double occupancy plot with site index for coronene (top panel), ovalene (middle panel) and 1,12-benzoperylene (bottom panel). As \nall molecules are symmetric about $C_2$ axis, only half of the molecular sites are plotted, the other half being symmetry equivalent to it. The color scheme for double \noccupancy in different eigenstates are same in all three panels and are as follows: ground state (black filled circles), lowest two-photon state (red filled square), \nlowest optical state (green filled triangles) and lowest triplet state (blue open squares). Double occupancy in the other partner of the degenerate optical states in \ncoronene is shown by green broken line with open triangles. Lines connecting data points are given only as a guide to the eye.}\n\\end{center}\n\\end{figure}\n\nThe lowest triplet state energy in each of the molecules can be calculated in two ways while employing both $C_2$ and $J$ symmetries -- either by calculating the lowest \nenergy state in $M_S=1$ sector or by calculating the lowest energy state in the $M_S=0$ space with $\\chi_P=-1$. The energies obtained by both calculations are given\nin Table. \\ref{trip_energy}. It can be observed that the energies obtained in $M_S=1$ sector calculations are lower. This can be attributed to the larger Hilbert space\nof the $M_S=1$ state for a given DMRG cut-off compared to the Hilbert space dimension of the $M_S=0$ space with $\\chi_P=-1$. In fact, the parity symmetry almost bisects \nthe complete direct product space and therefore, the effective size of the Hilbert space becomes half of that in $M_S=1$ sector calculation. As DMRG is a variational \ntechnique, accuracy increases with the dimension of the Hilbert space and hence, the $M_S=1$ sector calculations are more accurate.  \n\nSpin gap is  also a good measure of electronic correlation strength. For a PPP chain, the spin gap can be estimated from the Heisenberg model, with an antiferromagnetic \n$J\\sim 4t^2/U_{PPP}$. This implies that with increasing effective correlation strength, the gap between the lowest singlet state and the lowest triplet state reduces. \nAccording to this line of argument, ovalene has the highest effective correlation strength while 1,12-Benzoperylene has the lowest among the molecules sited in \nTable. \\ref{energy-ppp1} and \\ref{energy-ppp2}. \n\nSubstitution by donor-acceptor groups does not seem to have appreciable effect on correlation strength, although, the lifting of electron-hole symmetry allows optical \ntransition to states which are labelled as dipole-forbidden in unsubstituted molecules. The extent of mixing of different symmetry states of the unsubstituted system due \nto substitution depends on the strength of the donor-acceptor groups. In the present case, the dipole-forbidden $1\\thinspace{}^{1}B_{2u}^{+}/ 1\\thinspace{}^{1}B_{3u}^{+}$\nstate in unsubstituted coronene becomes symmetry allowed due to substitution and corresponds to the lowest optical state in substituted coronene. \n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[height=5.5cm]{spnden.eps}\n\\caption{\\label{spnden} Spin density plot for coronene (top panel), ovalene (middle) and 1,12-benzoperylene (bottom) in the lowest triplet state. The data points are \nconnected by a line for sake of smooth vision.}\n\\end{center}\n\\end{figure}\n\nIt is evident from above that the effective electron correlation strength is not controlled by the symmetry of the molecule; while coronene is the molecule with highest \nsymmetry $(D_{6h})$, substitution by donor-acceptor groups lowers the symmetry to $C_{2h}$, yet, the effective correlation strength in both the systems as indicated by \nthe spin gaps and relative positions of the energy levels, are comparable. \nOvalene is also a lower symmetry molecule $(D_{2h})$ than coronene, but appears to have large effective correlation strength. On the contrary, 1,12-benzoperylene \n$(C_{2v})$ being of similar symmetry to substituted coronene, seems to have rather low effective correlation strength compared with the latter.\n\nSpin density at different sites in the lowest triplet state, which is the expectation value of $\\langle {\\hat{S}_i}^z\\rangle$ in this state is plotted for different \nmolecules in Fig. \\ref{spnden}. In the coronene molecule we noted that the spin density is highest at sites 1, 8, 17 and 24 which are all related by symmetry of the \nmolecule. The fractional double occupancies at the above mentioned sites are small (Fig. \\ref{dblocc}), which is consistent with the higher spin densities at these sites. \nHowever, the bond order pattern along the periphery has period four and correspond to \n$\\mbox{\\st{  ( }}\\phantom{.}{=\\joinrel=}\\phantom{.} \\mbox{---} \\phantom{.}\\mbox{---}\\phantom{.} {=\\joinrel=}\\phantom{.}{\\mbox{\\st{  ) }}}_n$ \nwhich is unusual as one would expect a quinonoidal \nstructure from the spin density data. On the contrary, the spin densities are well-localized at sites 1 and $32$ in ovalene and at 2 and $21$ in 1,12-benzoperylene (Fig. \n\\ref{molecule} and \\ref{spnden}). In ovalene and 1,12-benzoperylene, there are many sites with negative spin densities unlike in the case of coronene. Again, we noted that\nthe fractional double occupancy is least at sites with high positive spin densities (Fig. \\ref{dblocc}). The peripheral bond order in ovalene has period four with kinks \nat the high spin density sites at the middle of the molecule. Bond $11$ and its symmetry partners (Fig. \\ref{molecule}) in the interior two benzene rings are \nrather weak as compared to that in the ground state and we can expect puckering of the structure in the triplet state. In 1,12-benzoperylene also we find bond order \npattern with period four on the periphery if we exclude bonds involving the high spin density sites. In substituted coronene, the spin density distribution is not \nsensitive to the strength of the substituents considered in this study.\n\n\\begin{table*}[t]\n\\begin{center}\n\\caption{\\label{bondorder} Bond order for coronene, substituted coronene, ovalene and 1,12-benzoperylene in ground state, lowest two-photon state, lowest optical state \nand lowest triplet state. The bond indices are according to Fig. \\ref{molecule}.}\n\\begin{ruledtabular}\n\\begin{tabular}{c|cccc|cccc|cccc|cccc}\n&\\multicolumn{4}{c|}{Coronene} & \\multicolumn{4}{c|}{Substituted coronene} & \\multicolumn{4}{c|}{Ovalene} & \\multicolumn{4}{c}{1,12-Benzoperylene} \\\\\n\\colrule\n&  &  &  &  &  &  &  &  &  &  &  &  &  &  &  &  \\\\\nBond &  & $2\\thinspace{}^{1}A_{g}^{+}$ & $1\\thinspace{}^{1}B_{2u}^{-}$ & $1\\thinspace{}^{3}B_{2u}^{+}$ &  &  &  &  &  & $2\\thinspace{}^{1}A_{g}^{+}$ &  & \n$1\\thinspace{}^{3}B_{2u}^{+}$ &  &  &  &  \\\\\nindex & $1\\thinspace{}^{1}A_{g}^{+}$ & or & and & or &  \n$1\\thinspace{}^{1}A_{g}$ & $2\\thinspace{}^{1}A_{g}$ & $1\\thinspace{}^{1}B_{u}$ & $1\\thinspace{}^{3}B_{u}$ & \n$1\\thinspace{}^{1}A_{g}^{+}$ & or & $1\\thinspace{}^{1}B_{2u}^{-}$ & or &\n$1\\thinspace{}^{1}A_{1}^{+}$ & $2\\thinspace{}^{1}A_{1}^{+}$ & $1\\thinspace{}^{1}B_{1}^{-}$ & $1\\thinspace{}^{3}B_{1}^{+}$ \\\\\n& & $2\\thinspace{}^{1}B_{1g}^{+}$ & $1\\thinspace{}^{1}B_{3u}^{-}$ & $1\\thinspace{}^{3}B_{3u}^{+}$ & \n&  &  &  &\n& $2\\thinspace{}^{1}B_{1g}^{+}$ &  & $1\\thinspace{}^{3}B_{3u}^{+}$ &\n&  &  &  \\\\\n&  &  &  &  &  &  &  &  &  &  &  &  &  &  &  &  \\\\\n\\colrule\n1 & 0.74 & 0.64 & 0.69 & 0.68 & 0.74 & 0.64 & 0.67 & 0.70 & 0.70 & 0.75 & 0.74 & 0.75 & 0.35 & 0.42 & 0.43 & 0.52 \\\\\n\n2 & 0.50 & 0.52 & 0.52 & 0.50 & 0.50 & 0.52 & 0.51 & 0.49 & 0.53 & 0.45 & 0.49 & 0.46 & 0.64 & 0.57 & 0.53 & 0.47 \\\\\n\n3 & 0.50 & 0.51 & 0.52 & 0.53 & 0.50 & 0.51 & 0.52 & 0.54 & 0.47 & 0.56 & 0.52 & 0.55 & 0.58 & 0.55 & 0.58 & 0.48 \\\\\n\n4 & 0.74 & 0.67 & 0.66 & 0.63 & 0.74 & 0.67 & 0.65 & 0.62 & 0.76 & 0.63 & 0.71 & 0.67 & 0.69 & 0.65 & 0.67 & 0.71 \\\\\n\n5 & 0.50 & 0.45 & 0.47 & 0.50 & 0.50 & 0.44 & 0.48 & 0.50 & 0.44 & 0.54 & 0.47 & 0.52 & 0.55 & 0.54 & 0.52 & 0.45 \\\\\n\n6 & 0.56 & 0.46 & 0.49 & 0.48 & 0.56 & 0.47 & 0.46 & 0.47 & 0.57 & 0.43 & 0.53 & 0.48 & 0.46 & 0.50 & 0.50 & 0.53 \\\\\n\n7 & 0.47 & 0.56 & 0.53 & 0.53 & 0.50 & 0.56 & 0.54 & 0.54 & 0.55 & 0.51 & 0.53 & 0.52 & 0.76 & 0.67 & 0.68 & 0.65 \\\\\n\n8 & 0.47 & 0.43 & 0.48 & 0.49 & 0.46 & 0.42 & 0.48 & 0.49 & 0.51 & 0.50 & 0.50 & 0.50 & 0.46 & 0.49 & 0.53 & 0.54 \\\\\n\n9 & 0.56 & 0.58 & 0.51 & 0.50 & 0.56 & 0.58 & 0.49 & 0.51 & 0.47 & 0.51 & 0.49 & 0.50 & 0.52 & 0.53 & 0.45 & 0.45 \\\\\n\n10 &  &  &  &  &  &  &  &  & 0.53 & 0.54 & 0.53 & 0.54 & 0.72 & 0.57 & 0.74 & 0.73 \\\\\n\n11 &  &  &  &  &  &  &  &  & 0.52 & 0.44 & 0.46 & 0.45 & 0.52 & 0.48 & 0.50 & 0.46 \\\\\n\n12 &  &  &  &  &  &  &  &  & 0.47 & 0.58 & 0.55 & 0.58 & 0.54 & 0.46 & 0.50 & 0.53 \\\\\n\n13 &  &  &  &  &  &  &  &  &  &  &  &  & 0.47 & 0.56 & 0.52 & 0.52 \\\\\n\n14 &  &  &  &  &  &  &  &  &  &  &  &  & 0.48 & 0.45 & 0.48 & 0.47 \\\\\n\n15 &  &  &  &  &  &  &  &  &  &  &  &  & 0.57 & 0.43 & 0.47 & 0.49 \\\\\n\\end{tabular}\n\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\nWe have tabulated the bond order values of different bonds, as indexed in Fig. \\ref{molecule} in lowest energy states of each symmetry subspaces, \nfor all the four molecules studied here. \nThe bond order values are related to bond lengths as indicated by Coulson \\cite{coulson}; bonds with higher bond order value has more double bond character while low value \ndepicts that the bond is primarily a single bond. The repercussion of similar bond order values for different bonds in coronene establishes $D_{6h}$ symmetry of the \nground state. This particular symmetry is not retained in the excited states indicating distorted equilibrium structures in these states. In excited states the bonds are \nsymmetric about two in-plane $C_2$ axes, which bisects the molecule. In two-photon state, a quinonoid structure emerges at the central part of the molecule, while in the \ndoubly degenerate optical states, which have almost similar bond orders and in the lowest triplet state the central \nbenzene ring gets squeezed compared to ground state and its connectivity to the peripheral benzene rings becomes weaker. Similar structures appear even in substituted \ncoronene. Small variation in bond orders for bonds connected to donor or acceptor sites are quite expected as the effective hopping amplitudes for bonds involving these \nsites will be different from the rest of the molecule. In ovalene, the edge bonds switch their character from double bond to single bond and vice versa in two-photon \nstate and triplet state, relative to those in the ground state. In optical state, the edge bonds become more or less of same character as all the bond orders become \nnearly equal. Yet, the most notable bond variation in ovalene is for the bonds 11 and 12 and their symmetry partners, which also switch their character like the edge \nbonds, but in all excited states; other bonds in the inner part of the molecule remain almost invariant. However, the biggest variation in bond order is observed in \nthe lowest triplet state of 1,12-benzoperylene when compared to the ground state bond orders. The Pauli blocking at the sites 2 and 21 converts the bond $1$ from a single \nbond to a double bond. Weakening of neighboring bonds can also be attributed to the Pauli blocking. Bond orders of most of the peripheral and ring bonds become nearly \nequal while bonds parallel to bond $1$ remain approximately same in all states. In the two-photon state, overall expansion of the structure is observed while in the \noptical state, most significant variation in bond order occurs in the lowermost ring as shown in Fig. \\ref{molecule}. The bond order of the weakest bond of the molecule \nincreases both in the two-photon state and the optical state also, but rather small compared to that in the triplet state.\n\nThe charge gap of a system is defined as the energy required to remove an electron from a neutral molecule and placing it on another neutral molecule. This \nprocess gives rise to two charged species of different charges and can be represented by the reaction \\cite{raghu-prb}: \n\n", "index": 31, "text": "\\begin{equation*}\n2M \\rightarrow P^+ + P^-\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"2M\\rightarrow P^{+}+P^{-}\" display=\"block\"><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>M</mi></mrow><mo>→</mo><mrow><msup><mi>P</mi><mo>+</mo></msup><mo>+</mo><msup><mi>P</mi><mo>-</mo></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00053.tex", "nexttext": "\n\\noindent\nwhere $N$ is the number of sites in a particular system.\n\n\\begin{table}[b]\n\\begin{center}\n\\caption{\\label{chargegap} Charge gap and exciton binding energy in coronene, ovalene and 1,12-benzoperylene in units of eV.}\n\\begin{ruledtabular}\n\\begin{tabular}{ccc}\n & Charge gap & Exciton binding energy  \\\\\n\\colrule\nCoronene & $7.05$ & $2.18-2.22$  \\\\\nOvalene  & $5.41$ & $2.09$  \\\\\n1,12-Benzoperylene & $8.21$ & $4.49$ \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n\nIn H\\\"uckel picture, the process is same as of photoexcitation and the charge gap will be equal to the optical gap. Long range interactions can alter the picture as the \nelectron-hole pair can get stabilized in a bound state, the exciton. The photoexcitation generally brings the system up to the excitonic state, which can be \nintramolecular in nature. For complete separation of the electron and hole, so they can move freely, the exciton has to be dissociated and the two charged species should \nbe in the continuum. The energy required to dissociate the exciton leading to freely moving electron and hole is the exciton binding energy. In Table.\\ref{chargegap}, we \nhave presented the charge gaps and the exciton binding energies for the unsubstituted molecules studied. The exciton binding energies are rather large, comparable for \ncoronene and ovalene and largest for 1,12-benzoperylene. Large exciton binding energies suggest that these molecules cannot be used in solar cell devices.\n\n\\section{Conclusion}\n\nEffective electronic correlation strength in higher-dimensional system is a very subtle parameter which is not only controlled by the one-particle bandwidth but also by \nthe topology \nof the system. Indeed, correlation plays a crucial part in the relative ordering of the one-photon, two-photon and triplet states. In this article, we have studied the \nlowest energy level ordering in some peri-condensed polyaromatic systems using the PPP model with standard parameters for $sp^2$ carbon atoms. We find the energy level \nordering to be strongly dependent on the topology of the transfer terms in these molecules. The effective strength of correlation in these molecules are also speculated \nfrom the energy level ordering and their energy gaps from the ground state. To enable these studies, we developed a computationally efficient algorithm for symmetry \nadaptation within the conventional DMRG procedure and obtained energy gaps for several one-photon, two-photon and triplet states in coronene, ovalene, 1,12-benzoperylene \nand substituted coronene. We have analyzed the bond order data of the excited states to infer the distortions in their equilibrium geometries while average double occupancy\nin these states are also computed to understand the effective correlation strength. In the triplet state, we have also calculated spin densities. All these studies show \nthat unlike the linear conjugated systems, the conjugation topology plays an important role besides the interaction parameters.\n\n\\begin{acknowledgements}\n\nWe acknowledge Prof. Diptiman Sen for valuable discussions during the development of the modified SDMRG algorithm. SR is thankful to the Department of Science and \nTechnology, India and Indo-US Science and Technology Forum for financial support through various grants.\nSM acknowledges partial support from NSF grant DMR-1151475 and the UA-REN Faculty Exploratory Research Grant.\nSP acknowledges CSIR India for a senior research fellowship.\n\n\\end{acknowledgements}\n\n\\bibliography{suryo-jctc-arxiv}\n\n\n", "itemtype": "equation", "pos": 59912, "prevtext": "\n\nThe charge gap for a system can be calculated by obtaining the lowest energies in the hole and electron doped systems, and subtracting from their sum the energy of \ntwo neutral molecules:\n\n", "index": 33, "text": "\\begin{equation*}\nE_C(N)=E_{P^+}(N)+E_{P^-}(N)-2E_M(N)\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex10.m1\" class=\"ltx_Math\" alttext=\"E_{C}(N)=E_{P^{+}}(N)+E_{P^{-}}(N)-2E_{M}(N)\" display=\"block\"><mrow><mrow><msub><mi>E</mi><mi>C</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>E</mi><msup><mi>P</mi><mo>+</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>E</mi><msup><mi>P</mi><mo>-</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>E</mi><mi>M</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]