[{"file": "1601.00708.tex", "nexttext": "\nWe do not consider heavy quarks in this study.\n\nIn PYTHIA, the final virtuality of shower gluons is forced to zero when the\nvalue becomes smaller than $Q_0$. While one could in principle undo this step,\nit turns out to be sufficient to reintroduce the non-perturbative gluon\nvirtuality manually without rebalancing momenta in the last splitting. We find\nthe typical error in total energy of the shower introduced this way is less\nthan 1\\% for 100 GeV jets. The lower panels of Figs.~\\ref{gluondecaygraph} and\n\\ref{gluondecaygraph2} show\nthe spectra of light and strange quarks from gluon decays for the same sample\nof 100 GeV jets used previously, together with the total light and strange quark\nspectra. The average number of quark and antiquarks in these 100 GeV jet\nshowers after decays is about 13. \n\nIn principle, quark recombination could be formulated completely in momentum\nspace (see Ref.~\\cite{Han:2012hp} for applications to jet showers). However,\nfor future applications in heavy ion collisions, where thermal partons will \nhave nontrivial space-momentum correlations, we espouse a formulation of\nquark recombination employing Wigner functions with both momentum and\nspace-time information. We are therefore led to introduce a space-time\nstructure of showers. We do this based on two simple premises: (i) Virtual\npartons with virtuality $Q$ have an average life time $1/Q$ in their rest\nframe before splitting. This time is then properly boosted into the lab\nframe. (ii) The centers of wave-packets representing partons move on free\nclassical trajectories given by the velocity $\\mathbf{p}/E$ of the parton in\nthe lab frame, where $E$ is the parton energy. \n\n\\begin{figure}[tb]\n\\centering\n\\includegraphics[width=\\columnwidth]{surfaceM.eps}\\\\\n\\caption{(Color online) Statistical distribution of quark-antiquark pairs \n  in 100 GeV jet parton shower in terms of relative spatial and momentum coordinates\n  $y$ and $k$ of the pair.  The coordinates are\n  defined in the common rest frame of the pair at the time the latter parton \n  is created in the shower. }\n\\label{drdkMB}\n\\end{figure}\n\nIn the jet rest frame the spatial density of its shower partons depends on the \ntime they are produced. However their density in momentum space is about \n0.025/GeV$^{3}$ and significantly smaller than the corresponding value of about 2.5/GeV$^{3}$ for partons in a quark-gluon plasma at its phase transition temperature. One can analyze this parton initial\nstate for hadronization more quantitatively.\nAs we will discuss in detail in the next section, the decisive physical\nquantities for recombination between a particular quark and antiquark pair \nto occur are the relative distances $y$ and $k$ between \nthe partons in space and momentum space measured at a common time in the rest\nframe of the pair.  In Fig.~\\ref{drdkMB} we show the statistical distribution of all \nquark-antiquark pairs we find in 100 GeV jet parton showers (normalized to \none jet) as a function of their distances $y$ and $k$ in \ntheir common rest frame at the time when the latter parton of a pair is created.\nWe find that this distribution peaks at $y\\sim 0.5$ fm and\n$k\\sim 0.3$ GeV, although large tails exist. This points to the \nexistence of a ``bulk'' of partons in a jet shower which are quite close in\nphase space and amenable to recombination, while another, non-negligible fraction\nof partons will be far removed from other partons in phase space.\n\n\\section{Quark Recombination}\n\nInstantaneous quark recombination is most conveniently expressed in terms of\nan overlap of Wigner functions \\cite{Fries:2008hs}. The momentum distributions of mesons and baryons formed from recombination of quarks are generally given by\n\\begin{eqnarray}\n\\label{Eq1}\n\\frac{dN_M}{d^3 {\\mathbf P}_M} &=& g_M\\int d^3{\\bf x}_1 d^3{\\bf p}_1 d^3{\\bf x}_2\nd^3{\\bf p}_2 f_{q}({\\bf x}_1, {\\bf p}_1) f_{\\bar{q}}({\\bf x}_2, {\\bf p}_2)\\nonumber\\\\\n&&\\times W_{M}({\\bf y}, {\\bf k})\\delta^{(3)}({\\bf P}_{M}-{\\bf p}_1 -{\\bf p}_2) \\, ,\n\\end{eqnarray}\nand\n\\begin{eqnarray}\n \\label{Eq2}\n\\frac{dN_B}{d^3 {\\bf P}_B} &=& g_B\\int d^3{\\bf x}_1 d^3{\\bf p}_1 d^3{\\bf x}_2 d^3{\\bf p}_2 d^3{\\bf x}_3 d^3{\\bf p}_3 f_{q_1}({\\bf x}_1, {\\bf p}_1)\\nonumber\\\\ \n&&\\times f_{q_2}({\\bf x}_2, {\\bf p}_2)f_{q_3}({\\bf x}_3, {\\bf p}_3)W_{B}({\\bf y}_{1},{\\bf k}_{1};{\\bf y}_{2},{\\bf\nk}_{2})\\nonumber\\\\\n&&\\times \\delta^{(3)}({\\bf P}_{B}-{\\bf p}_1 -{\\bf p}_2 -{\\bf p}_3) \\, ,\n\\end{eqnarray}\nrespectively. In the above, $f_{q}({\\bf x}_1,{\\bf p}_1)$ and $f_{\\bar{q}}({\\bf x}_2, {\\bf p}_2)$ are the phase-space distribution functions of quarks and antiquarks, and they are normalized as $\\int d^3{\\bf x}d^3{\\bf p}f_{q, \\bar q}({\\bf x},{\\bf  p})=N_{q,\\bar q}$, where $N_{q,\\bar q}$ is the quark or antiquary number. The Wigner functions of the meson and baryon (or antibaryon) are denoted by $W_{M}({\\bf y},{\\bf k})$ and $W_{B}({\\bf y}_{1},{\\bf k}_{1};{\\bf y}_{2},{\\bf k}_{2})$, expressed in terms of the relative coordinates and relative momenta of their valence quarks. For mesons, they are defined as\n\n", "itemtype": "equation", "pos": 9155, "prevtext": "\n\\title{Jet Fragmentation via Recombination of Parton Showers}\n\\author{Kyong Chol Han}\\email{khan@comp.tamu.edu}\n\\affiliation{Cyclotron Institute and Department of Physics and Astronomy, Texas A$\\&$M University, College Station, TX 77843-3366, USA}\n\\author{Rainer J. Fries}\\email{rjfries@comp.tamu.edu}\n\\affiliation{Cyclotron Institute and Department of Physics and Astronomy, Texas A$\\&$M University, College Station, TX 77843-3366, USA}\n\\author{Che Ming Ko}\\email{ko@comp.tamu.edu}\n\\affiliation{Cyclotron Institute and Department of Physics and Astronomy, Texas A$\\&$M University, College Station, TX 77843-3366, USA}\n\n\\begin{abstract}\nWe propose to model hadronization of parton showers in QCD jets through a hybrid\napproach involving quark recombination and string fragmentation. This is\nachieved by allowing gluons at the end of the perturbative shower evolution to\nundergo a non-perturbative splitting into quark and antiquark pairs, then\napplying a Monte-Carlo version of instantaneous quark recombination, and\nfinally subjecting remnant quarks (those which have not found a recombination\npartner) to Lund string fragmentation. When applied to parton showers from the\nPYTHIA Monte Carlo event generator, the final hadron spectra from our calculation compare quite well to PYTHIA jets that have been hadronized with the\ndefault Lund string fragmentation. Our new approach opens up the possibility\nto generalize hadronization to jets embedded in a quark gluon plasma.\n\\end{abstract}\n\n\\pacs{13.87.-a,13.87.Fh}\n\\maketitle\n\\section{Introduction}\n\nHadron production from jets in high-energy collisions of hadrons or nuclei is\noften parameterized through fragmentation functions, using the universality of\nthe process as given by factorization theorems of quantum chromodynamics (QCD)~\\cite{Collins:1981uw}. On a\nmicroscopic level, hadron production in jets can be modeled very well through\na perturbative evolution of the parton shower inside the jet using DGLAP\nsplitting kernels to some low virtuality cutoff $Q_0$, followed by a non-perturbative hadronization model like the Lund string model or cluster hadronization applied to the parton shower. Event generators like PYTHIA~\\cite{Sjostrand:2006za} and HERWIG~\\cite{Corcella:2002jc} have successfully implemented such strategies to describe high momentum hadron production in $e^{+}+e^-$, $p+p$ and other processes.\n\nIn collisions of heavy nuclei at high energy, QCD factorization in jet \nhadronization is broken up to much higher hadron momentum, roughly 6-8 GeV/$c$ \nat typical collider energies, compared to the situation in elementary $e^{+}+e^-$ and $p+p$\ncollisions. This can be readily seen from the baryon enhancement measured in\nnuclear collisions both in Au$+$Au collisions at the Relativistic Heavy Ion\nCollider (RHIC)~\\cite{Adler:2003qi} and in Pb$+$Pb collisions at the Large\nHadron Collider (LHC)~\\cite{Abelev:2012wca}. It has been suggested that hadron\nproduction at intermediate momenta, i.e. 2-8 GeV/$c$, can be described through\nthe process of quark recombination or\ncoalescence~\\cite{Greco:2003xt,Fries:2003vb,Greco:2003mm,Fries:2003kq,Fries:2004ej,Fries:2008hs}.\nIt is an intriguing idea to combine the concepts of quark recombination and\nparton showers since recombination can be easily generalized to the\nhadronization of jets in dense environments as found in relativistic heavy ion\ncollisions.  In fact, quark recombination was applied to hadronization in jets\nin the early days of QCD~\\cite{Das:1977cp,Chang:1980kh,Migneron:1981cv}, and\nmore recently by Hwa and Yang~\\cite{Hwa:2003ic}. However, parton showers in\nthose early works were not obtained from the sophisticated parton Monte Carlo\ngenerators available today, but rather fitted to data or determined from specific models. In addition, earlier work also used event-averaged spectra, ignoring fluctuations coming from the small number of partons in each jet.\n\nHere we show that essential aspects of hadron production in jet showers can be reproduced if we replace Lund string fragmentation in PYTHIA with an improved recombination model. We work with quarks and gluons at the end of their perturbative shower evolution, then let gluons decay into quark-antiquark pairs, evaluate quark recombination probabilities based on hadron Wigner functions by Monte Carlo sampling, and finally reapply Lund string fragmentation to those quarks which have not found a recombination partner. Finally, we compare our results to full PYTHIA results which simply hadronize entire showers by string fragmentation.\n\nThe paper is organized as follows. In the next section we describe how we\nprepare perturbative parton showers and extract the constituent quark\ndistributions in phase space. In Sec.\\ III, we describe the recombination\nmodel used in the present study and our treatment of remnant partons. In\nSec.\\ IV, we discuss our results and compare to full PYTHIA with string\nfragmentation. We conclude in Sec. V.  Also included is an Appendix to derive\nthe recurrence relation for the overlap integral between Gaussian wave packets\nand harmonic oscillator wave functions in the Wigner formalism used in\nthe recombination calculation. \nAlthough in this work we deal strictly with jets in the vacuum, our motivation \nderives from the desire to generalize our approach to jets in a QCD medium \nlater on \\cite{Han:new}.\n\n\n\\section{Parton Showers}\n\n\\begin{figure}[tb]\n\\centerline{\\hspace{0.4cm}\\includegraphics[width=\\columnwidth]{gtoq.eps}}\n\\caption{(Color online) Distribution $dN/dz$ of shower partons in terms of the momentum fraction $z$ of the initial jet momentum at the end of the perturbative shower evolution for a jet of 100 GeV before (upper panel) and after forcing gluon decays into quark-antiquark pairs (lower panel).}\n\\label{gluondecaygraph}\n\\end{figure}\n\n\\begin{figure}[tb]\n\\centerline{\\hspace{0.4cm}\\includegraphics[width=\\columnwidth]{gtoqpT.eps}}\n\\caption{(Color online) Same as Fig.\\ \\ref{gluondecaygraph} for \nthe shower parton transverse momentum distribution $dN/d^2 {\\bf p}_T$.}\n\\label{gluondecaygraph2}\n\\end{figure}\n\nWe are not concerned here with the mechanisms involved in creating parton\nshowers. We use PYTHIA 6.3~\\cite{Sjostrand:2006za} as a tool to create\nperturbative parton showers as input to our hadronization procedure. \nPYTHIA 6.3 also serves as our benchmark for hadronization when we run pure\nLund string fragmentation on the same ensemble of parton showers.\nOf course, another event generator that allows the extraction of shower partons\nfrom a jet before hadronization would work as well.\nUnless explicitly stated otherwise, the results presented here use\nmonoenergetic jets of energy 100 GeV which are extracted from $e^{+}+e^{-}$\ncollisions at a center-of-mass energy of $\\sqrt{s} = 2 E_\\mathrm{jet}=200$ GeV\nin PYTHIA 6.3. By setting the cutoff for the perturbative evolution of  the\njet to $Q_0 = 1$ GeV, we extract the final parton configuration before string\nbreaking. The upper panels of Figs.~\\ref{gluondecaygraph} and \\ref{gluondecaygraph2} show\nthe resulting light quark ($u,d,\\bar u, \\bar d$), strange quark ($s,\\bar s$) and gluon\n($g$) spectra as functions of their longitudinal momentum fraction $z$ in the \njet and as functions of their momentum $p_T$\ntransverse to the jet axis, respectively. More precisely we define\n\\begin{eqnarray}\nz =\\frac{\\mathbf{p} \\cdot \\mathbf{P}_{\\mathrm{jet}}}{|\\mathbf{P}_{\\mathrm{jet}}|^2},\\quad\np_T  = \\frac{\\sqrt{|\\mathbf{p}|^2 |\\mathbf{P}_{\\rm jet}|^2-({\\bf p}\\cdot{\\bf P}_{\\rm jet})^2}}{|\\mathbf{P}_{\\rm jet}|}.\n\\end{eqnarray}\nwhere $\\mathbf{p}$ is the 3-momentum of the considered parton and\n$\\mathbf{P}_{\\mathrm{jet}}$ is the 3-momentum of the original parton creating\nthe jet. The spectra $dN/dz$ and $dN/d^2 {\\bf p}_T$ are for one jet averaged over an ensemble of $10^6$ PYTHIA jets with $E_\\mathrm{jet} = 100$ GeV.\n\nSince recombination models are usually built on the premise of dominance of\nthe lowest Fock states in hadron wave functions, similar to hadronization in\nexclusive processes~\\cite{Lepage:1979zb,Lepage:1980fj}, only quarks and\nantiquarks are considered (see Ref.~\\cite{Muller:2005pv} for a study on higher\nFock states). Successful recombination models therefore postulate a\n(non-perturbative) splitting of gluons into quark-antiquark pairs. Using\nconstituent quarks with masses $m_{u,d}=0.33~\\rm{GeV}$ for light quarks and\n$m_s=0.5~\\rm{GeV}$ for strange quarks, consistent with PYTHIA, we thus let\ngluons at the end of their perturbative evolution decay with their remaining\nvirtualities between $2m_{u,d}$ and $m_\\mathrm{max}$, where $m_\\mathrm{max}>\n2m_s$ should be of the order of the scale $Q_0$. $m_\\mathrm{max}$ is in\nprinciple a parameter and its value will mostly influence the ratio of strange\nto non-strange hadrons. We set this parameter to 1.25 GeV throughout this\nwork. We decay gluons isotropically in their rest frame into $q\\bar q$ pairs. The decay chemistry gives equal weight to $u\\bar u$ and $d\\bar d$ pairs for gluon virtualities between $2 m_{u,d}$ and $2m_s$, while above the strangeness threshold the ratio of light to strange quarks is simply given by phase space and the vector nature of the decay as\n\n", "index": 1, "text": "\\begin{equation}\n  \\frac{\\Gamma(g^*\\to u\\bar u, d\\bar d)}{\\Gamma(g^* \\to s\\bar s)} = 2\n  \\frac{m^2 +2m^2 _{u,d}}{m^2 +2m^2 _s} \\sqrt{\\frac{m^2 -4m^2 _{u,d}}{m^2 -4m_s ^2}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\Gamma(g^{*}\\to u\\bar{u},d\\bar{d})}{\\Gamma(g^{*}\\to s\\bar{s})}=2\\frac{m^%&#10;{2}+2m^{2}_{u,d}}{m^{2}+2m^{2}_{s}}\\sqrt{\\frac{m^{2}-4m^{2}_{u,d}}{m^{2}-4m_{s%&#10;}^{2}}}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi mathvariant=\"normal\">Γ</mi><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mo>*</mo></msup><mo>→</mo><mi>u</mi><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">¯</mo></mover><mo>,</mo><mi>d</mi><mover accent=\"true\"><mi>d</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mo>*</mo></msup><mo>→</mo><mi>s</mi><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mfrac><mrow><msup><mi>m</mi><mn>2</mn></msup><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>m</mi><mrow><mi>u</mi><mo>,</mo><mi>d</mi></mrow><mn>2</mn></msubsup></mrow></mrow><mrow><msup><mi>m</mi><mn>2</mn></msup><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>s</mi><mn>2</mn></msubsup></mrow></mrow></mfrac><mo>⁢</mo><msqrt><mfrac><mrow><msup><mi>m</mi><mn>2</mn></msup><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mrow><mi>u</mi><mo>,</mo><mi>d</mi></mrow><mn>2</mn></msubsup></mrow></mrow><mrow><msup><mi>m</mi><mn>2</mn></msup><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>s</mi><mn>2</mn></msubsup></mrow></mrow></mfrac></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00708.tex", "nexttext": "\nwhere $m_1$ and $m_2$ are the masses of the quark and antiquark, respectively. For baryons (or antibaryons), while ${\\bf y}_1$ and ${\\bf k}_1$ are similarly defined as in Eq.(\\ref{eq:rel}), the second relative coordinate ${\\bf y}_2$ and relative momentum ${\\bf k}_2$\nare given by\n\\begin{eqnarray}\n\\label{distB}\n{\\bf y}_2&=&\\frac{m_1{\\bf x}_1+m_2{\\bf x}_2}{m_1+m_2}-{\\bf x}_3,\\nonumber\\\\\n{\\bf k}_2&=&\\frac{m_3({\\bf p}_1+{\\bf p}_2)-(m_1+m_2){\\bf p}_3}{m_1+m_2+m_3},\n\\end{eqnarray}\nwith $m_3$ being the mass of the third quark (or antiquark). The meson and baryon Wigner functions are normalized as \n$(2\\pi)^{-3}\\int d^3{\\bf y}d^3{\\bf k}f_M({\\bf y},{\\bf k})=1$ and\n$(2\\pi)^{-6}\\int d^3{\\bf y}_1d^3{\\bf k}_1d^3{\\bf y}_2d^3{\\bf k}_2f_B({\\bf y}_1,{\\bf k}_1;{\\bf y}_2,{\\bf k}_2)=1$. \nThe factor $g_{M}$ in Eq.(\\ref{eq:rel}) accounts for the\nprobability for the color triplet, spin-$1/2$ quark and antiquark to form a\ngiven color singlet meson, while $g_B$ is the corresponding factor for three\nquarks (antiquarks) to form a given color singlet baryon (antibaryon).  \nIn the present study, the phase space functions of quarks and antiquarks will \nbe replaced by the Wigner functions of individual quarks and antiquarks from the\nMonte Carlo jet shower generator, and we are going to use harmonic oscillator wave functions for hadrons to evaluate the momentum and space-time overlap integrals. \n\nIn Ref.~\\cite{Greco:2003xt} for recombination of thermal partons among\nthemselves and with jet partons, both the color and spin quantum numbers are\ntreated on a purely statistical basis.  The color flow in the parton shower \nis in principle tractable, although not yet implemented here for simplicity.\nSince the number of shower partons in a jet is very small, strong color \ncorrelations exist and the probability for colored shower partons to form \ncolor singlet hadrons is thus much larger than given by a statistical factor \nfor colored thermal partons. For the present study we will neglect the \nstatistical factors due to the color degrees of freedom and only include those due to the spin degrees of freedom. However, we prohibit the quark-antiquark pair from a forced gluon decay to recombine into a color-singlet meson.\nThis approximation can be solidified by either invoking local color neutrality\narguments~\\cite{Amati:1978by,Corcella:2002jc}, as also used for cluster hadronization in HERWIG, or\na color octet approach, similar to the one used in heavy quarkonium production \nin nuclear reactions~\\cite{Wong:1999ur} where color octet clusters are allowed\nto exchange soft gluons to convert into color singlets. Of course this could\nbe improved in the future by following color flow in the parton shower simulation.\n\nBecause of their large relative momenta, shower partons are quite likely to\nrecombine into excited hadron states. Wigner functions can have negative\nvalues, which makes them unsuitable for direct Monte Carlo\nevaluation. Instead we have to sample the quantum mechanical overlap integrals \nof the hadron Wigner functions with the Wigner functions representing\nthe wave packets of shower partons, which we take to be Gaussians\nhere.  The resulting quantum mechanical overlap integral, which is guaranteed \nto provide a positive definite probability density that can be sampled, is equivalent to \na Gaussian smearing of the Wigner functions in Eqs.(\\ref{Eq1}) and (\\ref{Eq2}), i.e., replacing\n$W_M$ by \n\\begin{eqnarray}\n\\label{Eq1a}\n\\overline W_{M}({\\bf y},{\\bf k})&=&\\int d^3{\\bf x}_1^\\prime d^3{\\bf k}_1^\\prime\nd^3{\\bf x}_2^\\prime d^3{\\bf k}_2^\\prime\\nonumber\\\\  \n&\\times& W_q({\\bf x}_1^\\prime,{\\bf k}_1^\\prime)W_{\\bar q}({\\bf x}_2^\\prime,{\\bf k}_2^\\prime)W_M({\\bf y}^\\prime,{\\bf k}^\\prime).\n\\end{eqnarray}\nIn the above, $W_q({\\bf x}_1^\\prime,{\\bf k}_1^\\prime)$ and $W_{\\bar q}({\\bf x}_2^\\prime,{\\bf k}_2^\\prime)$ are, respectively, the Wigner  functions of the quark and antiquark with their centroids at $({\\bf x}_1,{\\bf k}_1)$ and $({\\bf x}_2,{\\bf k}_2)$, respectively.\nThe formula for baryons is analogous.\n \nWe can evaluate Eq.(\\ref{Eq1a}) with the help of some mathematics worked out\nin Appendix~\\ref{wwwM}. The result for a meson in the $n$-th excited state in the center of mass frame of the \nquark-antiquark pair is \n\\begin{eqnarray}\\label{WigM3}\n\\overline W_{M,n} (\\mathbf{y} ,\\mathbf{k})=\\frac{v^{n}}{n!}e^{-v}.\n\\end{eqnarray}\nwith\n\\begin{eqnarray}\n\\label{WigM}\nv=\\frac{1}{2}\\left(\\frac{{\\bf y}^2}{\\sigma_M^2}+{\\bf k}^2 \\sigma_M^2 \\right).\n\\end{eqnarray} \nwhere $\\sigma_M$ is the width of the harmonic oscillator wave function for the\nrelative motion of quark antiquark pair.\n\nSimilarly, the Gaussian smeared Wigner function for a baryon, with a wave function in the $n_1$-th excited state in one relative coordinate and in the $n_2$-th excited state in the other relative coordinate, is given by \n\\begin{eqnarray}\n\\label{Wig3B}\n\\overline W_{B,n_1,n_2} (\\mathbf{y}_1 , \\mathbf{k}_1 ; \\mathbf{y}_2, \\mathbf{k}_2)=\\frac{v_1^{n_1}}{n_1!}e^{-v_1}\\cdot\\frac{v_2^{n_2}}{n_2!}e^{-v_2},\n\\end{eqnarray}\nwith\n\\begin{eqnarray}\n\\label{WigM}\nv_i=\\frac{1}{2}\\left(\\frac{{\\bf y}_{i} ^2}{\\sigma_{Bi}^2}+{\\bf k}_{i} ^2 \\sigma_{B_i^2}\\right),\\quad i=1,2.\n\\end{eqnarray}\n\nSince the wave functions of quarks and/or antiquarks in a hadron are always given in the rest frame of the hadron, we evaluate the relative coordinates and momenta in Eqs.(\\ref{eq:rel}) and (\\ref{distB}) using the parton coordinates and momenta given at \\emph{constant rest\nframe time}~\\cite{Chen:2003ava,Chen:2006vc} in terms of their equal-time coordinates in the hadron rest frame. To this end, for each candidate partons to be treated their phase-space coordinates have to be Lorentz transformed from the lab frame to their common\nrest frame, and subsequently the partons produced earlier in the parton shower are propagated like free particles to the time at which the last candidate parton is produced and available for hadronization. We have\nchecked that an algorithm that rather takes the distance of closest approach for the candidate partons has not much influence on the results as the parton shower is rapidly expanding. \n\nThe two width parameters $\\sigma_{B1}$ and $\\sigma_{B2}$ in the baryon Wigner function are related to each other by \n\\begin{eqnarray}\n\\label{BaryonSigma}\n\\sigma_{B2}=\\sigma_{B1}\\left(\\frac{\\mu_1}{\\mu_2}\\right)^{1/2},\n\\end{eqnarray}\nwhere the two reduced masses are defined as \\cite{Oh:2009zj} \n\\begin{eqnarray}\n\\mu_1 =\\frac{m_1 m_2}{m_1 +m_2},~~\\mu_2 =\\frac{(m_1 +m_2 )m_3}{m_1 +m_2 +m_3}.\n\\end{eqnarray}\n\nThe width parameters of the harmonic oscillator wave function can be related\nto the measured size of the formed hadron.\nMore precisely, for a meson consisting of quark and antiquark of masses $m_1$ and $m_2$ and quark charges $Q_1$ and $Q_2$, its mean-square charge radius is related to $\\sigma_M$ by~\\cite{Oh:2009zj}\n\\begin{eqnarray}\n\\langle r^2 \\rangle_M&=&|\\langle Q_1({\\bf x}_1-{\\bf X})^2+Q_2({\\bf x}_2-{\\bf X})^2\\rangle|\\nonumber\\\\\n&=&\\frac{3}{2}\\frac{|Q_1m_2^2+Q_2m_1^2|}{(m_1+m_2)^2}\\sigma_M^2,\n\\end{eqnarray}\nwhere ${\\bf X}=(m_1{\\bf x}_1+m_2{\\bf x}_2)/(m_1+m_2)$ is the center of mass coordinate.\n\nSimilarly, the width parameter $\\sigma_{B1}$ in the Wigner function of a baryon consisting of three quarks of masses $m_1$, $m_2$, and $m_3$, and charges $Q_1$, $Q_2$, and $Q_3$ are related to its mean-square charge radius is by~\\cite{Song:2012cd}\n\\begin{widetext}\n\\begin{eqnarray}\\label{radius}\n\\langle r^2 \\rangle_B&=&|\\langle Q_1({\\bf x}_1-{\\bf X})^2+Q_2({\\bf x}_2-{\\bf X})^2+Q_3({\\bf x}_3-{\\bf X})^2\\rangle|\\nonumber\\\\\n&=&\\frac{3\\sigma_{B1} ^2}{2(m_1 +m_2 +m_3 )}\\left[\\frac{m_2 (m_2 +m_3 )}{m_1 +m_2}Q_1+\\frac{m_1 (m_3 +m_1 )}{m_1 +m_2}Q_2 +\\frac{m_1 +m_2}{m_3}Q_3 \\right],\n\\end{eqnarray}\n\\end{widetext}\nwhere ${\\bf X}=(m_1{\\bf x}_1+m_2{\\bf x}_2+m_3{\\bf x}_3)/(m_1+m_2+m_3)$ denotes the center of mass of the three quarks.\n\n\\begin{table}[t]\\label{tab:1}\n\\caption{Empirical charge radii $R_c$ (from Ref.~\\cite{Beringer:1900zz}), width parameters $\\sigma_M$ or $\\sigma_{B1}$, and spin statistical factors $g$ for hadrons used in the calculation.}\n\\vspace{0.3cm}\n\\begin{tabular}{c|ccc}\n\\hline\\hline\nHadron & $R_c$ [fm] ~~& $\\sigma_M$ or $\\sigma_{B1}$ [fm] ~~& $g$ \\\\ \\hline\n$\\pi$ & 0.67 & 1.09 & 1/4 \\\\ \n$\\rho$ & -- & 1.09  & 3/4 \\\\ \n$K$ & 0.56 & 0.84  & 1/4 \\\\ \n$K^*$ & -- & 0.84  & 3/4 \\\\\n$N$ & 0.88 & 1.24  &1/4 \\\\ \n$N^*$ & -- & 1.24 & 1/4 \\\\ \n$\\Delta$ & -- & 1.24  & 1/2 \\\\ \n$\\Lambda$ & -- & 1.21 & 1/4 \\\\ \\hline\\hline\n\\end{tabular}\n\\end{table}\n\nWe use measured charge radii for charged pions, protons and charged kaons to\ndetermine the width parameters $\\sigma_\\pi$, $\\sigma_K$ and $\\sigma_N$ in the\npion, kaon and nucleon Wigner functions. The same width parameters are used\nfor their isospin partners and their antiparticles as well as their spin resonances\n$\\rho$, $K^*$, $N^*$, and $\\Delta$.  Since $\\Lambda$ and $\\bar\\Lambda$ have no\ncharge, their width parameters are determined instead from the matter radius,\nwhich is given by an equation similar to Eq.\\ (\\ref{radius}) after setting\n$Q_1=Q_2=Q_3=1/3$, and assuming that their size is the same as that of a\nproton. Excited states of these hadrons are then accounted for by the excited\nstates of the harmonic oscillator wave functions using the same width\nparameters.\nIn Table I we summarize the charge radii, width parameters and spin statistical factors for all stable hadrons and resonances included here.\n\nEqs.\\ (\\ref{WigM3}) and (\\ref{Wig3B}) can now be used to determine the\nrecombination probability for a given quark-antiquark pair or a triplet of\nquarks or antiquarks. For a given shower, the relative coordinates in the \ncommon rest frame are evaluated for all possible hadron candidates which are\nsubsequently accepted for recombination, or rejected, by Monte Carlo methods.\n\nSome quarks might have quite small probabilities for recombination with any\nother parton in the same shower.\nIn that case, there is a large probability that the Monte Carlo algorithm will\nnot find a recombination partner. Such quarks are typically far removed from\nothers in phase space, making all Wigner function overlap integrals small. The\nreason for this to occur is the lack of confinement in what is essentially a\nperturbative shower evolution. Of course isolated partons have to be connected\nby strings to another color charge and Lund string fragmentation can take care \nof their hadronization. We deal with such partons far removed in phase space\nby reconnecting them to other partons by QCD strings. This also includes undoing\nthe non-perturbative gluon splitting introduced earlier, if none of the\ndaughter quarks has found a recombination partner.\nWe thus form short strings of the types $(q,\\bar{q})$ and \n$(q,g,g,\\ldots,\\bar{q})$ and then hand them over to PYTHIA 6.3 for \nhadronization.\n\n\\begin{figure}[tb]\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{rem.eps}\n\\caption{(Color online) Probabilities of light and strange quarks to recombine\n  into hadrons as functions of their momentum fraction $z$ for100 GeV jets.}\n\\label{probremn}\n\\end{center}\n\\end{figure}\n\nWe end up with the following picture: Final hadron spectra are a mixture of\nhadrons from recombination (from quarks close in phase space to other quarks)\nand from string fragmentation (for quarks isolated in phase space or otherwise\nleftover). Typically, high-$z$ partons are both rare and far removed in phase\nspace. They are unlikely to recombine with other partons in the shower (or\npartons from a surrounding medium if one would consider such). This can be\nseen in Fig.\\ \\ref{probremn} where the probability of quarks to find a\nrecombination partner is plotted as a function of parton momentum fraction $z$\nfor 100 GeV jets. Thus in our model moderate to high-$z$ partons still\npreferentially hadronize by string breaking. On the other hand, we indeed find\nthe existence of a bulk of jet partons at lower $z$ in which quarks are \nclose enough in phase space so that they prefer recombination.\nRecall that our main motivation is to establish a hadronization model which\nnaturally generalizes to jets in a medium. It is now straightforward to see how\nour formalism can be applied to that more general case~\\cite{Han:new}.\n\nExcited states will be important channels for recombination. Excited mesons \nand baryons up to $n=5$  are known experimentally~\\cite{Beringer:1900zz}. \nHowever, here we include the contributions from excited meson states up to $n=8$ \nand excited baryon states up to $n_1+n_2=8$, which can be easily\ndone with harmonic oscillator wave functions. We allow\nexcited states to decay to multiple pions in the case of light quark mesons,\nto kaon and pion in the case of light and strange mesons, to (anti)nucleon and\npion in the case of light flavor (anti)baryons, and to $\\Lambda$ and pion in\nthe case of strangeness $\\pm 1$ baryons.  For decays into multiple pions, we\ndetermine their relative probabilities through the available phase space according to~\\cite{Milburn:1955zz}\n\\begin{eqnarray}\n\\label{prob}\nP_l(M)\\sim\\left[\\frac{1}{6\\pi^2}\\left(\\frac{M}{m_\\pi}\\right)^3\\right]^l\\frac{(4l-4)!(2l-1)}{(2l-1)!^2(3l-4)!}\n\\, .\n\\end{eqnarray}\nHere $l$ is the number of pions, $M$ is the mass of the excited state, or the invariant mass of the light quark-antiquark pair.\nThe pion mass $m_\\pi$ in the above equation comes from taking the radius of\nthe emitting source to be that of the inverse of the pion\nmass~\\cite{Milburn:1955zz}.  In the present study, we replace $1/m_\\pi$ by the\ndistance between the recombined quark and antiquark, and consider its decay to\nat most four pions. The momentum distribution of these pions is then\ndetermined from phase space considerations. An excited nucleon $N^*$ or\n$\\Delta$ decays to a nucleon and $l$ pions if its invariant mass is between\n$m_N+lm_\\pi$ and $m_N+(l+1)m_\\pi$ with $m_N$ being the nucleon masses. Again,\nwe include at most four pions in the decay and use phase space considerations\nto determine their momenta. An excited kaon or $\\Lambda$ is assumed to decay\nto a kaon or $\\Lambda$ and multi-pions in a similar way.  \n\n\\section{Results}\n\nIn the following, we compare results from our hadronization model applied\nto parton showers from PYTHIA 6.3 to calculations of PYTHIA with string\nfragmentation applied to the same parton showers.\n\n\\begin{figure}[tb]\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{piKproLamb.eps}\n\\caption{(Color online) Spectrum $dN/dz$ of pions (upper left panel), kaons (upper right panel), nucleons and antinucleons (lower left panel), and $\\Lambda$ and $\\bar\\Lambda$ (lower right panel) from our calculation. Shown separately are contributions from the recombination of shower partons (stars) and fragmentation of remnant partons (circles).  Also shown are the total contribution (dashed lines) and the results from PYTHIA string fragmentation (solid lines).}\n\\label{recomb}\n\\end{center}\n\\end{figure}\n\nFirst, we test the longitudinal structure of jets by comparing the spectra\n$dN/dz$ as functions of the momentum fraction $z$ longitudinal to the jet\naxis for our sample of 100 GeV jets. In Fig.~\\ref{recomb}, we show the spectra \nof pions (upper left panel),\nkaons (upper right panel), nucleons and antinucleons (lower left panel), and\n$\\Lambda$ and $\\bar\\Lambda$ (lower right panel) from 100 GeV quark jets. \nWe show separately hadrons from recombined shower partons (stars), from the \nfragmentation of remnant hadrons (circles) and their sum (dashed line).\nThe solid line indicates the result from PYTHIA 6.3 string fragmentation \napplied to the same sample of jet parton showers. We also show the recombination\nonly through the ground state of the harmonic oscillator wave functions \n($n=0$). As expected, we see that recombination spectra fall off faster with\n$z$ than the string fragmentation contribution. String fragmentation dominates\nat intermediate and high $z$ while recombination becomes the leading channel\nbelow $z\\sim 0.1$, where the bulk of the hadron production resides.\n\nWe also note that recombination proceeds mainly through excited hadron states\nand not directly into $n=0$ ground state hadrons. The $n=0$ channel includes \ndirect production of pion, kaon, nucleon, and $\\Lambda$ as well as production \nfrom the the decay of $n=0$ spin-excited states $\\rho$, $K^*$,\n$N^*$ and $\\Delta$. The inclusion of excited states $n>0$ makes the\nrecombination spectra considerably harder.\nOverall we find that the results from our model are consistent with spectra\ncreated by PYTHIA from pure string fragmentation.\nNote that the comparison to string fragmentation --- another model --- only makes \nsense on a qualitative level. Precision tuning of our model would have to\ninvolve fits to data which is outside the scope of this work.\nWe compare the transverse momentum spectra of jets in \nFig.~\\ref{recombpT}. Again, results obtained from our hybrid recombination\nand fragmentation model compare well to pure string fragmentation.\n\n\\begin{figure}[tb]\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{piKproLamb_pT.eps}\n\\caption{(Color online) Same as Fig.~\\ref{recomb} for the transverse momentum spectra.}\n\\label{recombpT}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[tb]\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{piKproLamb_50GeV.eps}\n\\caption{(Color online) Same as Fig.~\\ref{recomb} for jets of energy $E_\\mathrm{jet}=25$ GeV.}\n\\label{recomb_50}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[tb]\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{piKproLamb_50GeV_pT.eps}\n\\caption{(Color online) Same as Fig.~\\ref{recombpT} for jets of energy $E_\\mathrm{jet}=25$ GeV.}\n\\label{recomb_50pT}\n\\end{center}\n\\end{figure}\n\nFinally we check our approach to hadronization with jets of a smaller jet\nenergy and find again that our results reproduce pure string fragmentation reasonably\nwell. The spectra for $E_\\mathrm{jet}=25$ GeV jets are shown in \nFigs.~\\ref{recomb_50} and \\ref{recomb_50pT} for the longitudinal and\ntransverse momentum spectra, respectively.\nThe recombination probability depends on the absolute distance of partons\nin phase space. Hence we expect the range in $z$ in which recombination\ncompetes with remnant string fragmentation to decrease with rising $E_\\mathrm{jet}$.\nOn the other hand, at smaller jet energies recombination stays more\ncompetitive out to larger $z$ at least for mesons, while for baryons the\nreduced number of partons in lower energy jets can lead to the opposite effect.\n\n\\section{Summary and Discussions}\n\nWe have devised a model to hadronize perturbative parton showers in jets based\non a hybrid of quark recombination and string fragmentation. Our algorithm\nreproduces results from pure string fragmentation and can be easily generalized to include partons from an ambient medium.\n\nWe turn perturbative parton showers into showers of constituent quarks and antiquarks by gluon decay. We then apply Monte Carlo methods to recombine quarks and antiquarks using probabilities given by their overlap integrals with respect to meson and baryon Wigner functions. The width parameters in these Wigner functions are fixed by hadron charge radii. Remnant quarks and antiquarks, which are not used for recombination, are connected by strings and subjected to the usual string fragmentation procedure in PYTHIA. We find that decays of excited states from recombination make the most important contributions to spectra of pions, kaons and nucleons.\n\nWe have checked that both the longitudinal and transverse momentum structures of hadron showers reproduce the results from PYTHIA string fragmentation. The only adjustable parameter that we have kept is the mass cutoff for gluon decays into quark-antiquark pair which can be set by the strange to non-strange hadron ratio. However, other quantities which are not very well known, like the width parameters in the Wigner functions for excited states of hadrons, can in principle be used as parameters for further fine tuning of results.\n\nOur hybrid approach essentially keeps string dynamics intact for the high-$z$\ntail of the jet and replaces string dynamics with recombination for the bulk\nof the jet where $\\mathcal{O}(10)$ quarks with a few GeV/$c$ momentum can be found close enough together in phase space to recombine.\n\nIn the presence of a quark-gluon plasma produced in relativistic heavy ion collisions, we suggest that our approach  can be generalized by sampling the ambient medium (e.g.\\ provided by a fluid dynamic simulation into which the jet is embedded) for thermal partons. Recombination would be delayed if the ambient temperature is above the critical temperature $T_c$.  At $T_c$ jet partons would be allowed to recombine with thermal partons, and remnant jet partons could also be allowed to connect to thermal partons by strings. This process, like other jet-medium interactions, would allow the exchange of energy and momentum. Details of an in-medium algorithm will be provided in a forthcoming manuscript \\cite{Han:new}.\n\n\\section*{Acknowledgments}\n\nWe thank the members of the Recombination Working Group of the JET\ncollaboration for helpful discussions. This work was supported by the\nU.S. National Science Foundation under Grants PHY-0847538, PHY-1516590 and\nPHY-1068572, by the US Department of Energy under Contract\nNo. DE-FG02-10ER41682 within the framework of the JET Collaboration, and by the Welch Foundation under Grant No. A-1358.\n\n\\appendix*\n\\section{The Overlap of Gaussian Wave Packets with a Harmonic Oscillator}\n\\label{wwwM}\n\nIn this Appendix, we discuss details of the calculation of the overlap of\nharmonic oscillator Wigner functions and Gaussian wave packets.\nLet us start by noting that both Gaussian wave packets and the\nharmonic oscillator problem factorize into the three spatial directions. We\ncan thus solve the corresponding one dimensional problem and then readily \nfind the solution in three dimensions.\n\nWe start with the well known harmonic oscillator basis\\\nin one dimension~\\cite{MerzQM},  \n\\begin{eqnarray}\n\\phi_{n}(x)=\\left(\\frac{m\\omega}{\\pi\\hbar}\\right)^{1/4}\\frac{1}{\\sqrt{2^n n!}}H_{n}(\\xi)e^{-\\xi^2 /2},\n\\end{eqnarray}\nwhere $\\xi=\\sqrt{\\frac{m\\omega}{\\hbar}}x$, $H_{n}(\\xi)$ are Hermite\npolynomials and $\\omega$ is the oscillator frequency.\nThe Wigner transformation of the harmonic oscillator wave functions, defined by\n\\begin{eqnarray}\nW_{n}(x,k )=\\int^{\\infty} _{-\\infty} d\\eta~ e^{i k \\eta}\\phi_n \\left(x+\\frac{\\eta}{2}\\right)\\phi_n \\left(x+\\frac{\\eta}{2}\\right),\n\\end{eqnarray}\nleads to~\\cite{Groenewold:1946kp} \n\\begin{eqnarray}\\label{lag}\nW_n (u)= 2(-1)^n L_{n} (u)e^{-u/2},\n\\end{eqnarray}\nwhere $u=2\\left(\\frac{x^2}{\\sigma^2}+\\sigma^2 k^2\\right)$ with the width\n$\\sigma=\\left(\\frac{\\hbar}{m\\omega}\\right)^{1/2}$, and the $L_n$ are Laguerre polynomials.\n\nWe would like to calculate the overlap integral\n\\begin{eqnarray}\\label{recopack}\n\\overline W_n (x, k)&=&\\int dx_1^\\prime dk_1^\\prime dx_2^\\prime dk_2^\\prime\\nonumber\\\\\n&\\times& W(x_1^\\prime,k_1^\\prime)W(x_2^\\prime,k_2^\\prime)W_n (x,k),\n\\end{eqnarray}\nof the Wigner function with Gaussian wave packets\n\\begin{eqnarray}\n\\label{wavepacket}\nW(x_i^\\prime ,k_i^\\prime)=\\frac{1}{\\pi}e^{-(x_i^\\prime -x_{i} )^2 /\\delta^2} e^{-\\delta^2(k_i^\\prime-k_{i} )^2},~i=1,2,\\nonumber\\\\\n\\end{eqnarray}\nof width $\\delta$ around centroids $x_{i}$ and $k_{i}$ in space and momentum. Here $x=x_1-x_2$ and $k = (k_{1}-k_{2})/{2}$, and the result will only depend on the relative position of centroids $r=x_{1} -x_{2}$ and \n$p =(k_{1}-k_{2})/{2}$.\n\nUsing the generating function for Laguerre polynomials~\\cite{MathMPhy}, \n\\begin{eqnarray}\n\\label{genf}\n\\frac{1}{1-t}e^{-\\frac{tx}{1-t}}=\\sum^{\\infty} _{n=0} t^n L_n (x),\n\\end{eqnarray}\nit is straightforward to see that Eq.\\ (\\ref{lag}) leads to the generating function\nfor the oscillator Wigner functions\n\\begin{eqnarray}\n\\frac{2}{1+t}\\exp\\left(-\\frac{1-t}{2(1+t)}u\\right)=\\sum^{\\infty} _{n=0} t^n W_n (u).\n\\end{eqnarray}\nCarrying out the integrals from Eq.\\ (\\ref{recopack}) on both sides of above\nequation, we obtain the following generating function for the Gaussian smeared\nWigner function $\\overline W_n$ \n\\begin{eqnarray}\n&&\\frac{2}{(1+t)(1+a\\alpha)^{1/2}(1+a\\alpha^{-1})^{1/2}}\\nonumber\\\\\n&&\\times\\exp\\left(-\\frac{ax^2}{(1+a\\alpha)\\sigma^2}-\\frac{ak^2 \\sigma^2}{1+a\\alpha^{-1}}\\right)=\\sum^{\\infty} _{n=0}t^n \\overline W_n (x,k),\n\\nonumber\\\\\n\\end{eqnarray}\nwhere $a=\\frac{1-t}{1+t}$ and $\\alpha=2\\delta^2/\\sigma^2$.  By Taylor\nexpanding the left hand side in $t$ and comparing coefficients of the same powers in $t$ on both sides, we obtain the following recurrence relation for the $\\overline W_n$:\n\\begin{eqnarray}\n\\label{recurM}\n\\overline W_{n+5}&=&-\\frac{1}{\\Lambda_5}(\\Lambda_4\\overline W_{n+4}+\\Lambda_3\\overline W_{n+3}+\\Lambda_2\\overline W_{n+2} \\nonumber\\\\\n&&+\\Lambda_1\\overline W_{n+1}+\\Lambda_0\\overline W_n),\n\\end{eqnarray}\nwhere $\\Lambda_{i}~(i=0,1,\\ldots,5)$ are given by\n\\begin{eqnarray}\n\\Lambda_0 &=&-[(1+\\alpha)^2 +n](1-\\alpha)^2,\\nonumber\\\\\n\\Lambda_1 &=&[\\alpha(1-\\alpha)+2(x/\\sigma)^2 +2\\alpha^2 (k\\sigma)^2+n+1](1-\\alpha)^2 x \\nonumber\\\\\n\\Lambda_2 &=&[(1-\\alpha)(\\alpha^2 +4\\alpha+1)-2(x/\\sigma)^2 (3\\alpha +1)\\nonumber \\\\\n&&-2\\alpha(k\\sigma)^2(-\\alpha^2 +3\\alpha+2)\\nonumber\\\\\n&&-2(n+2)(1+\\alpha)^2(1-\\alpha)](1-\\alpha),\\nonumber\\\\\n\\Lambda_3 &=&[\\alpha(1-\\alpha)^2 +2(x/\\sigma)^2 (3\\alpha^2 -2\\alpha-1)\\nonumber \\\\\n&&+2\\alpha(k\\sigma)^2 (\\alpha^3 -3\\alpha^2 +9\\alpha-7)\\nonumber \\\\\n&&-2(n+3)(1+\\alpha)^2 (1-\\alpha)^2 ], \\nonumber\\\\\n\\Lambda_4 &=&[2(x/\\sigma)^2 +2\\alpha^2 (k\\sigma)^2 -(n+4)(1-\\alpha)^2](1+\\alpha)^2,\\nonumber\\\\\n\\Lambda_5 &=&-(n+5)(1+\\alpha)^2.\n\\end{eqnarray}\n\nTaking $\\alpha=2\\delta^2 /\\sigma^2 = 1$ for simplicity reduces Eq.(\\ref{recurM}) to \n\\begin{eqnarray}\\label{rec}\n\\overline W_{n+1} =\\frac{v}{n+1}\\overline W_n,\n\\end{eqnarray}\nwith \n\\begin{eqnarray}\n\\overline W_0 =\\exp(-v) ~~{\\rm and}~~ v=\\frac{1}{2}\\left(\\frac{x^2}{\\sigma^2}+k^2 \\sigma^2\\right)\n\\end{eqnarray}\nor equivalently \n\\begin{eqnarray}\n\\overline W_n = \\frac{v^n}{n!}e^{-v}.\n\\end{eqnarray}\nThe Gaussian smeared $\\overline W_n$ has the form of a Poisson distribution with the normalization\n\\begin{eqnarray}\n\\sum^{\\infty} _{n=0} \\frac{v^n}{n!}e^{-v}=1,\n\\end{eqnarray}\nwhich is similar to that of a coherent state~\\cite{sakurai}.\n\nIn three dimensions, the Gaussian smeared Wigner function is thus given by \n\\begin{eqnarray}\\label{WigM3}\n&&\\overline W_{n} (\\mathbf{x} ,\\mathbf{k})\\nonumber\\\\\n&&=\\sum_{n_{x}+n_{y}+n_{z}=n}\\overline W_{n_{x}} (x,k_{x} )\\overline W_{n_{y}} (y,k_{y} )\\overline W_{n_{z}} (z,k_{z} )\\nonumber\\\\\n&&=\\sum_{n_{x}+n_{y}+n_{z}=n}\\frac{v_x^{n_x}}{n_{x}!}e^{-v_x}\\cdot\\frac{v_y^{n_x}}{n_{y}!}e^{-v_y}\\cdot\\frac{v_z^{n_z}}{n_{z}!}e^{-v_z}\\nonumber\\\\\n&&=\\frac{1}{n!}e^{-v}\\sum_{n_{x}+n_{y}+n_{z}=n}\\frac{n!}{n_x!n_y!n_z!}v_x^{n_x}v_y^{n_y}v_z^{n_z}\\nonumber\\\\\n&&=\\frac{v^n}{n!}e^{-v},\n\\end{eqnarray}\nwith\n\\begin{eqnarray}\n\\label{WigM}\nv=v_{x}+v_{y}+v_{z}=\\frac{1}{2}\\left(\\frac{{\\bf x} ^2}{\\sigma^2}+{\\bf k}^2 \\sigma^2 \\right).\n\\end{eqnarray}\nThe fourth equality in Eq.(\\ref{WigM3}) follows from using the trinomial expansion formula \n\\begin{eqnarray}\n\\sum_{n_{x}+n_{y}+n_{z}=n}&&\\frac{n!}{n_x!n_y!n_z!}v_x^{n_x}v_y^{n_y}v_z^{n_z}\\nonumber\\\\\n&&=(v_x+v_y+v_z)^n=v^n.\n\\end{eqnarray}\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{Collins:1981uw}\n  J.~C.~Collins and D.~E.~Soper,\n  \n   Nucl.\\ Phys.\\ B {\\bf 194}, 445 (1982).\n   \n\n\n\\bibitem{Sjostrand:2006za}\n  T.~Sjostrand, S.~Mrenna and P.~Z.~Skands,\n  \n  JHEP {\\bf 0605}, 026 (2006).\n   \n\n\n\\bibitem{Corcella:2002jc}\n  G.~Corcella, I.~G.~Knowles, G.~Marchesini, S.~Moretti, K.~Odagiri, P.~Richardson, M.~H.~Seymour and B.~R.~Webber,\n  \n  hep-ph/0210213.\n  \n  \n\n\n\n\\bibitem{Adler:2003qi}\n  S.~S.~Adler {\\it et al.}  [PHENIX Collaboration],\n  \n   Phys.\\ Rev.\\ Lett.\\  {\\bf 91}, 072301 (2003) \n   \n\n\n\\bibitem{Abelev:2012wca}\n  B.~Abelev {\\it et al.}  [ALICE Collaboration],\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 109}, 252301 (2012)  \n\n\n\\bibitem{Greco:2003xt}\n  V.~Greco, C.~M.~Ko and P.~Levai,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 90}, 202302 (2003).\n  \n\n\n\\bibitem{Fries:2003vb}\n  R.~J.~Fries, B.~Muller, C.~Nonaka and S.~A.~Bass,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 90}, 202303 (2003).\n   \n\n\n\\bibitem{Greco:2003mm}\n  V.~Greco, C.~M.~Ko and P.~Levai,\n  \n  Phys.\\ Rev.\\ C {\\bf 68}, 034904 (2003).\n  \n\n\n\\bibitem{Fries:2003kq}\n  R.~J.~Fries, B.~Muller, C.~Nonaka and S.~A.~Bass,\n  \n  Phys.\\ Rev.\\ C {\\bf 68}, 044902 (2003).\n  \n  \n\n\\bibitem{Fries:2004ej}\n  R.~J.~Fries,\n  \n  J.\\ Phys.\\ G {\\bf 30}, S853 (2004).\n  \n\n\\bibitem{Fries:2008hs}\n  R.~J.~Fries, V.~Greco and P.~Sorensen,\n  \n  Ann.\\ Rev.\\ Nucl.\\ Part.\\ Sci.\\  {\\bf 58}, 177 (2008).\n  \n\n\\bibitem{Das:1977cp}\n  K.~P.~Das and R.~C.~Hwa,\n  \n  Phys.\\ Lett.\\ B {\\bf 68}, 459 (1977)  [Erratum-ibid.\\  {\\bf 73B}, 504 (1978)].\n   \n\n\\bibitem{Chang:1980kh}\n  V.~Chang and R.~C.~Hwa,\n  \n  Phys.\\ Rev.\\ D {\\bf 23}, 728 (1981).\n\n\\bibitem{Migneron:1981cv}\n  R.~Migneron, L.~M.~Jones and K.~E.~Lassila,\n  \n  Phys.\\ Rev.\\ D {\\bf 26}, 2235 (1982).\n\n\n\\bibitem{Hwa:2003ic}\n  R.~C.~Hwa and C.~B.~Yang,\n  \n  Phys.\\ Rev.\\ C {\\bf 70}, 024904 (2004).\n  \n\n\\bibitem{Han:new}\n  K.~C.~Han, R.~J.~Fries and C.~M.~Ko, {\\it In Preparation.}\n\n\\bibitem{Lepage:1979zb} \n  G.~P.~Lepage and S.~J.~Brodsky,\n  \n  Phys.\\ Lett.\\ B {\\bf 87}, 359 (1979).\n  \n  \n  \n\n\\bibitem{Lepage:1980fj} \n  G.~P.~Lepage and S.~J.~Brodsky,\n  \n  Phys.\\ Rev.\\ D {\\bf 22}, 2157 (1980).\n  \n  \n\n\\bibitem{Muller:2005pv}\n  B.~Muller, R.~J.~Fries and S.~A.~Bass,\n  \n  Phys.\\ Lett.\\ B {\\bf 618}, 77 (2005).\n  \n\n\\bibitem{Han:2012hp}\n  K.~C.~Han, R.~J.~Fries and C.~M.~Ko,\n  \n  J.\\ Phys.\\ Conf.\\ Ser.\\  {\\bf 420}, 012044 (2013).\n  \n\n\\bibitem{Amati:1978by} \n  D.~Amati, R.~Petronzio and G.~Veneziano,\n  \n  Nucl.\\ Phys.\\ B {\\bf 146}, 29 (1978).\n  doi:10.1016/0550-3213(78)90430-3\n\n\n\\bibitem{Wong:1999ur}\n  C.~Y.~Wong,\n  \n  Phys.\\ Rev.\\ D {\\bf 60}, 114025 (1999).\n \n  \n  \n\n\n\\bibitem{Chen:2003ava}\n  L.~-W.~Chen, C.~M.~Ko and B.~-A.~Li,\n  \n  Nucl.\\ Phys.\\ A {\\bf 729}, 809 (2003).\n  \n  \n\n\n\\bibitem{Chen:2006vc}\n  L.~-W.~Chen and C.~M.~Ko,\n  \n  Phys.\\ Rev.\\ C {\\bf 73}, 044903 (2006).\n \n  \n  \n\n\n\\bibitem{Oh:2009zj}\n  Y.~Oh, C.~M.~Ko, S.~H.~Lee and S.~Yasui,\n  \n  Phys.\\ Rev.\\ C {\\bf 79}, 044905 (2009).\n\n  \n  \n\n\n\\bibitem{Song:2012cd}\n  C.~M.~Ko, T.~Song, F.~Li, V.~Greco and S.~Plumari,\n  \n  Nucl.\\ Phys.\\ A {\\bf 928}, 234 (2014).\n  \n  \n  \n\n\n\\bibitem{Beringer:1900zz}\n  J.~Beringer {\\it et al.}  [Particle Data Group Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 86}, 010001 (2012).\n  \n  \n\n\n\\bibitem{Milburn:1955zz}\n  R.~H.~Milburn,\n  \n  Rev.\\ Mod.\\ Phys.\\  {\\bf 27}, 1 (1955).\n  \n  \n\n\\bibitem{MerzQM}\nE.~Merzbacher, \\emph{Quantum Mechanics}, John Wiley \\& Sons, INC.~(1998).\n\n\n\\bibitem{Groenewold:1946kp}\n  H.~J.~Groenewold,\n  \n  Physica {\\bf 12}, 405 (1946).\n  \n  \n\n\\bibitem{MathMPhy}\nJ.~Mathews and R. L. Walker, \\emph{Mathematical Methods of Physics}, Addison-Wesley Publishing Company, Inc. (1970).\n\n\\bibitem{sakurai}\nJ. J. Sakurai, \\emph{Modern Quantum Mechanics}, Addison-Wesley Publishing Company, Inc. (1985).\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 14363, "prevtext": "\nWe do not consider heavy quarks in this study.\n\nIn PYTHIA, the final virtuality of shower gluons is forced to zero when the\nvalue becomes smaller than $Q_0$. While one could in principle undo this step,\nit turns out to be sufficient to reintroduce the non-perturbative gluon\nvirtuality manually without rebalancing momenta in the last splitting. We find\nthe typical error in total energy of the shower introduced this way is less\nthan 1\\% for 100 GeV jets. The lower panels of Figs.~\\ref{gluondecaygraph} and\n\\ref{gluondecaygraph2} show\nthe spectra of light and strange quarks from gluon decays for the same sample\nof 100 GeV jets used previously, together with the total light and strange quark\nspectra. The average number of quark and antiquarks in these 100 GeV jet\nshowers after decays is about 13. \n\nIn principle, quark recombination could be formulated completely in momentum\nspace (see Ref.~\\cite{Han:2012hp} for applications to jet showers). However,\nfor future applications in heavy ion collisions, where thermal partons will \nhave nontrivial space-momentum correlations, we espouse a formulation of\nquark recombination employing Wigner functions with both momentum and\nspace-time information. We are therefore led to introduce a space-time\nstructure of showers. We do this based on two simple premises: (i) Virtual\npartons with virtuality $Q$ have an average life time $1/Q$ in their rest\nframe before splitting. This time is then properly boosted into the lab\nframe. (ii) The centers of wave-packets representing partons move on free\nclassical trajectories given by the velocity $\\mathbf{p}/E$ of the parton in\nthe lab frame, where $E$ is the parton energy. \n\n\\begin{figure}[tb]\n\\centering\n\\includegraphics[width=\\columnwidth]{surfaceM.eps}\\\\\n\\caption{(Color online) Statistical distribution of quark-antiquark pairs \n  in 100 GeV jet parton shower in terms of relative spatial and momentum coordinates\n  $y$ and $k$ of the pair.  The coordinates are\n  defined in the common rest frame of the pair at the time the latter parton \n  is created in the shower. }\n\\label{drdkMB}\n\\end{figure}\n\nIn the jet rest frame the spatial density of its shower partons depends on the \ntime they are produced. However their density in momentum space is about \n0.025/GeV$^{3}$ and significantly smaller than the corresponding value of about 2.5/GeV$^{3}$ for partons in a quark-gluon plasma at its phase transition temperature. One can analyze this parton initial\nstate for hadronization more quantitatively.\nAs we will discuss in detail in the next section, the decisive physical\nquantities for recombination between a particular quark and antiquark pair \nto occur are the relative distances $y$ and $k$ between \nthe partons in space and momentum space measured at a common time in the rest\nframe of the pair.  In Fig.~\\ref{drdkMB} we show the statistical distribution of all \nquark-antiquark pairs we find in 100 GeV jet parton showers (normalized to \none jet) as a function of their distances $y$ and $k$ in \ntheir common rest frame at the time when the latter parton of a pair is created.\nWe find that this distribution peaks at $y\\sim 0.5$ fm and\n$k\\sim 0.3$ GeV, although large tails exist. This points to the \nexistence of a ``bulk'' of partons in a jet shower which are quite close in\nphase space and amenable to recombination, while another, non-negligible fraction\nof partons will be far removed from other partons in phase space.\n\n\\section{Quark Recombination}\n\nInstantaneous quark recombination is most conveniently expressed in terms of\nan overlap of Wigner functions \\cite{Fries:2008hs}. The momentum distributions of mesons and baryons formed from recombination of quarks are generally given by\n\\begin{eqnarray}\n\\label{Eq1}\n\\frac{dN_M}{d^3 {\\mathbf P}_M} &=& g_M\\int d^3{\\bf x}_1 d^3{\\bf p}_1 d^3{\\bf x}_2\nd^3{\\bf p}_2 f_{q}({\\bf x}_1, {\\bf p}_1) f_{\\bar{q}}({\\bf x}_2, {\\bf p}_2)\\nonumber\\\\\n&&\\times W_{M}({\\bf y}, {\\bf k})\\delta^{(3)}({\\bf P}_{M}-{\\bf p}_1 -{\\bf p}_2) \\, ,\n\\end{eqnarray}\nand\n\\begin{eqnarray}\n \\label{Eq2}\n\\frac{dN_B}{d^3 {\\bf P}_B} &=& g_B\\int d^3{\\bf x}_1 d^3{\\bf p}_1 d^3{\\bf x}_2 d^3{\\bf p}_2 d^3{\\bf x}_3 d^3{\\bf p}_3 f_{q_1}({\\bf x}_1, {\\bf p}_1)\\nonumber\\\\ \n&&\\times f_{q_2}({\\bf x}_2, {\\bf p}_2)f_{q_3}({\\bf x}_3, {\\bf p}_3)W_{B}({\\bf y}_{1},{\\bf k}_{1};{\\bf y}_{2},{\\bf\nk}_{2})\\nonumber\\\\\n&&\\times \\delta^{(3)}({\\bf P}_{B}-{\\bf p}_1 -{\\bf p}_2 -{\\bf p}_3) \\, ,\n\\end{eqnarray}\nrespectively. In the above, $f_{q}({\\bf x}_1,{\\bf p}_1)$ and $f_{\\bar{q}}({\\bf x}_2, {\\bf p}_2)$ are the phase-space distribution functions of quarks and antiquarks, and they are normalized as $\\int d^3{\\bf x}d^3{\\bf p}f_{q, \\bar q}({\\bf x},{\\bf  p})=N_{q,\\bar q}$, where $N_{q,\\bar q}$ is the quark or antiquary number. The Wigner functions of the meson and baryon (or antibaryon) are denoted by $W_{M}({\\bf y},{\\bf k})$ and $W_{B}({\\bf y}_{1},{\\bf k}_{1};{\\bf y}_{2},{\\bf k}_{2})$, expressed in terms of the relative coordinates and relative momenta of their valence quarks. For mesons, they are defined as\n\n", "index": 3, "text": "\\begin{equation} \\label{eq:rel}\n{\\bf y}={\\bf x}_{1}-{\\bf x}_{2},\\quad {\\bf k}=\\frac{1}{m_1+m_2}(m_2{\\bf p}_{1}-m_1{\\bf p}_{2}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\bf y}={\\bf x}_{1}-{\\bf x}_{2},\\quad{\\bf k}=\\frac{1}{m_{1}+m_{2}}(m_{2}{\\bf p%&#10;}_{1}-m_{1}{\\bf p}_{2}),\" display=\"block\"><mrow><mrow><mrow><mi>𝐲</mi><mo>=</mo><mrow><msub><mi>𝐱</mi><mn>1</mn></msub><mo>-</mo><msub><mi>𝐱</mi><mn>2</mn></msub></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>𝐤</mi><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><msub><mi>m</mi><mn>1</mn></msub><mo>+</mo><msub><mi>m</mi><mn>2</mn></msub></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>m</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>𝐩</mi><mn>1</mn></msub></mrow><mo>-</mo><mrow><msub><mi>m</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>𝐩</mi><mn>2</mn></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]