[{"file": "1601.06197.tex", "nexttext": "\n\nwith $\\epsilon = T/T_\\mathrm{c} -1$ the reduced temperature, $\\nu$ and $z$ the correlation length and dynamical critical exponents, $\\eta$ the scaling dimension of the Bose field, and $\\mathcal{F}$ a universal scaling function.  The static  Bose gas belongs to the $XY$ (or $O(2)$) universality class, and is thus expected to have the same critical exponents as superfluid helium, i.e., in 3D, $\\nu \\simeq 0.67$ and $\\eta=0.038(4)$~\\cite{Zinn-Justin2002}.  \nThe critical dynamics of the system are expected to conform to those of the diffusive model denoted by $F$ in the classification of Ref.~\\cite{Hohenberg1977a}, implying a value $z=3/2$ for the dynamical critical exponent.\n\nThe influence of critical physics is significantly reduced in \nthe conditions of harmonic confinement typical of experimental Bose-gas systems, as compared to homogeneous systems.  Within a local-density approximation, the inhomogeneous thermodynamic parameters of the system imply that only a small fraction of atoms in the gas enter the critical regime, and so global observables are relatively insensitive to the effects of criticality.  Nevertheless, a few experiments have attempted to observe aspects of the critical physics of trapped Bose gases.  \n\nIn a homogeneous gas the introduction of interparticle interactions has no effect on the critical temperature at the mean-field level, but the magnitude and even the sign of the shift due to critical fluctuations was debated for several decades (see Ref.~\\cite{baym_blaizot_99} and references therein) before being settled by classical-field Monte-Carlo calculations~\\cite{kashurnikov_prokofev_01,arnold_moore_01}.  An experiment by the Aspect group carefully measured a shift in critical temperature of the trapped gas, but was unable to unambiguously infer any \nbeyond-mean-field contribution to this shift~\\cite{gerbier_thywissen_04,davis_blakie_06}.  A later experiment by the group of Hadzibabic made use of a Feshbach resonance to control the interaction strength in $^{41}$K, and found clear evidence of a positive beyond-mean-field shift~\\cite{smith_campbell_11} (see also the chapter by Smith in this volume).  \n\nIn 2007 the ETH Z\\\"urich group of Esslinger revisited their experiments on condensate formation and the coherence of a three-dimensional BEC with a new tool: the ability to count single atoms passing through an optical cavity below their ultra-cold gas~\\cite{ritter_ottl_07}.  They outcoupled atoms from two different vertical locations from their sample as it was cooled, realising interference in the falling matter waves.  By monitoring the visibility of the fringes, they were able to measure the growth of the coherence length as a function of time.  Using the same optical cavity setup, the Esslinger group subsequently measured the coherence length of their Bose gas as it was driven through the critical temperature by a small background heating rate, and determined the correlation-length critical exponent to be $\\nu = 0.67 \\pm 0.13$~\\cite{donner_ritter_07}. Their results are shown in Fig.~\\ref{fig:Davis2}(a).  Classical-field simulations of their experiment were in reasonable agreement, determining $\\nu = 0.80 \\pm 0.12$~\\cite{bezett_blakie_09}.  \n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=5.5cm]{figures/Donner_crit_exp_nu_with_label.pdf}\n\\includegraphics[height=5.5cm]{figures/Hadzibabic_scaling_of_l_with_label.pdf}\n\\caption{Critical phenomena in BECs. (a) Divergence of the equilibrium correlation length $\\xi$ as a function of the reduced temperature, and the fitting of the critical exponent, giving the result $\\nu = 0.67\\pm 0.13$. Inset: Double logarithmic plot of the same data. Taken from Ref.~\\cite{donner_ritter_07}. (b) Log-log plot of the dependence of the correlation length, here labelled $\\ell$, as a function of the characteristic time \n$\\tau_\\mathrm{Q}$ of the quench through the BEC phase transition.  The solid line corresponds to a Kibble--Zurek power-law scaling \n$\\ell \\propto \\tau_\\mathrm{Q}^b$ with $b = 0.35\\pm0.04$, in agreement with the beyond-mean-field prediction $b=1/3$ of the so-called $F$ model~\\cite{Hohenberg1977a} and inconsistent with the mean-field value $b = 1/4$.  This in turn implies a value $z = 1.4 \\pm 0.2$ for the dynamical critical exponent. Taken from Ref.~\\cite{navon_gaunt_15}.\n}\n\\label{fig:Davis2}\n\\end{figure*}\n\nAlthough an important topic in its own right, the greatest significance of the equilibrium theory of critical fluctuations to studies of condensate formation is that it provides a basis for generalisations of concepts such as critical scaling laws and universality classes to the domain of nonequilibrium physics.  In the remainder of this section we discuss two such extensions: the Kibble--Zurek mechanism (KZM), and the theory of non-thermal fixed points.\n\n\n\n\\subsection{The Kibble--Zurek mechanism}\n\\label{sec:Davis:KibbleZurek}\n\nThe theory of the Kibble--Zurek mechanism leverages the well-established results of the equilibrium theory of criticality to make immediate predictions for universal scaling behaviour in the nonequilibrium dynamics of passage through a second-order phase transition.\nThe underlying idea --- that causally disconnected regions of space break symmetry independently, leading to the formation of topological defects --- was first discussed by Kibble~\\cite{kibble_76}, who predicted that the distribution of defects following the transition would be determined by the instantaneous correlation length of the system as it passes through the Ginzburg temperature~\\cite{landau_lifshitz_book_80}.  Zurek later emphasised~\\cite{zurek_85} the importance of dynamic critical phenomena~\\cite{Hohenberg1977a} in such a scenario. \nIn particular, the scaling relations~\\eqref{davis_crit_exponents} imply that both the correlation length and the characteristic relaxation time of the system diverge as the critical point is approached ($\\epsilon \\rightarrow 0$), imposing a limit to the size of spatial regions over which order can be established during the transition.  Topological defects will thus be seeded, with a density determined by the correlation length at the time the system ``freezes'' during the transition, and will subsequently decay in the symmetry-broken phase.  The more rapidly the system passes through the critical point, the shorter the correlation length that is frozen in, and therefore more topological defects will form.  \nA dimensional analysis predicts that a linear ramp \n$\\epsilon(t) = -t/\\tau_\\mathrm{Q}$ of the reduced temperature through the critical point on a characteristic time scale \n$\\tau_\\mathrm{Q}$ results in a distribution of spontaneously formed defects with a density\n$n_d$\nthat scales as~\\cite{zurek_96}\n\n", "itemtype": "equation", "pos": 44209, "prevtext": "\n\\title{Formation of Bose--Einstein condensates}\n\n\\author{Matthew J. Davis}\n\\email{mdavis@physics.uq.edu.au}\n\\affiliation{School of Mathematics and Physics, The University of Queensland, St Lucia QLD 4072, Australia}\n\\affiliation{JILA, 440 UCB, University of Colorado, Boulder, Colorado 80309, USA}\n\n\\author{Tod M. Wright}\n\\affiliation{School of Mathematics and Physics, The University of Queensland, St Lucia QLD 4072, Australia}\n\n\\author{Thomas Gasenzer}\n\\affiliation{Kirchhoff-Institut f\\\"ur Physik, Universit\\\"at Heidelberg, Im Neuenheimer Feld 227, 69120 Heidelberg, Germany}\n\n\n\\author{Simon A. Gardiner}\n\\affiliation{Joint Quantum Centre (JQC) Durham-Newcastle, Department of Physics, Durham University, Durham DH1 3LE, United Kingdom}\n\n\n\n\\author{Nick P. Proukakis}\n\\affiliation{Joint Quantum Centre (JQC) Durham-Newcastle, School of Mathematics and Statistics, Newcastle University, Newcastle upon Tyne NE1 7RU, United Kingdom}\n\n\n\n\n\\begin{abstract}\nThe problem of understanding how a coherent, macroscopic Bose--Einstein condensate (BEC) emerges from the cooling of a thermal Bose gas has attracted significant theoretical and experimental interest over several decades. \nThe pioneering achievement of BEC in weakly-interacting dilute atomic gases in 1995 was followed by a number of experimental studies examining the growth of the BEC number, as well as the development of its coherence.  \nMore recently there has been interest in connecting such experiments to universal aspects of nonequilibrium phase transitions, in terms of both static and dynamical critical exponents.\nHere, the spontaneous formation of topological structures such as vortices and solitons in quenched cold-atom experiments has enabled the verification of the Kibble--Zurek mechanism predicting the density of topological defects in continuous phase transitions, first proposed in the context of the evolution of the early universe. \nThis chapter reviews progress in the understanding of BEC formation, and discusses open questions and future research directions in the dynamics of phase transitions in quantum gases.\n\\end{abstract}\n\n\\pacs{03.75.-b}\n\\maketitle\n\n\n\\section{Introduction}\nThe equilibrium phase diagram of the dilute Bose gas exhibits a continuous phase transition between condensed and noncondensed phases.  The order parameter characteristic of the condensed phase vanishes above some critical temperature $T_\\mathrm{c}$ and grows continuously with decreasing temperature below this critical point.  \nHowever, the dynamical process of condensate formation has proved to be a challenging phenomenon to address both theoretically and experimentally. This formation process is a crucial aspect of Bose systems and of direct relevance to all condensates discussed in this book, despite their evident system-specific properties. Important questions leading to  intense discussions in the early literature include the timescale for condensate formation, and the role of inhomogeneities and finite-size effects in \n``closed'' systems.  These issues are related to the concept of spontaneous symmetry breaking, its causes, and implications for physical systems (see, for example, the chapter by Snoke and Daley in this volume). \n\nIn this chapter we give an overview of the dynamics of condensate formation and describe the present understanding provided by increasingly well controlled cold-atom experiments and corresponding theoretical advances over the past twenty years.  We focus on the growth of BECs in cooled Bose gases, which, from a theoretical standpoint, requires a suitable nonequilibrium formalism. A recent book provides a more complete introduction to a number of different theoretical approaches to the description of nonequilibrium and non-zero-temperature quantum gases~\\cite{FINESS_book}. \n\nWe note that the past decade has seen the observation of BEC in a number of diverse experimental systems beyond ultracold atoms, including exciton-polaritons, magnons, and phonons, which are covered in other chapters of this volume.  Many of the universal aspects of condensate formation  also apply to these systems. \n\n\n\n\\section{The physics of BEC formation}\n\\label{sec:Davis:BECFormation}\nThe essential character of the excitations and collective response of a condensed Bose gas is well described by perturbative approaches that take as their starting point the breaking of the $U(1)$ gauge symmetry of the Bose quantum field.  This approach can be extended further to provide a kinetic description of excitations in a condensed gas weakly perturbed away from equilibrium~\\cite{griffin_nikuni_book_09}.  The description of the process of formation of a Bose-Einstein condensate in a closed system begins, however, in the opposite regime of kinetics of a non-condensed gas.  Over the past decades, there have been many studies using methods of kinetic theory to investigate the initiation of Bose--Einstein condensation.  It is now well established that these descriptions break down near the critical point, and in particular in any situation in which the formation process is far from adiabatic. \nA number of different theoretical methodologies have been applied to the issue of condensate formation, but most have converged to a similar description of the essential physics.  The prevailing view is  that a classical non-linear wave description ---  a form of  Gross--Pitaevskii equation --- can describe the nonequilibrium dynamics of the condensation process, which involves in general aspects of weak-wave turbulence and, in more aggressive cooling scenarios, strong turbulence.  The classical field describes the highly occupied modes of the gas at finite temperature and out of equilibrium.\n\nA summary of the consensus picture of condensate formation in a Bose gas cooled from above the critical temperature is as follows.  Well above the critical point the coherences between particles in distinct eigenstates of the appropriate single-particle Hamiltonian are negligible and the system is well described by a quantum Boltzmann kinetic equation for the occupation numbers of these single-particle modes.  As cooling of the gas proceeds due to inter-particle collisions and interactions with an external bath, if one is present, the occupation numbers of lower-energy modes increase.  Once phase correlations between these modes become significant, the system is best described in terms of an emergent quasiclassical field, which may in general exhibit large phase fluctuations, topological structures and turbulent dynamics, the nature of which may vary over time and depend on the specific details of the system --- including its dimensionality, density, and strength of interactions.  \nThis regime is sometimes referred to as a nonequilibrium \\emph{quasicondensate}, in analogy to the phase-fluctuating equilibrium regimes of low-dimensional Bose systems~\\cite{Popov1972,popov_book_83}.  The eventual relaxation of this quasicondensate establishes phase coherence across the sample, producing the state that we routinely call a Bose--Einstein condensate.\n\n\n\\subsection{The pre-condensation kinetic  regime}\n\\label{Pre-condensationKinetic}\n\nEarly investigations of the kinetics of condensation of a gas of massive bosons began with studies of such a system coupled to a thermal bath with infinite heat capacity, consisting of phonons \\cite{Inoue1976a} or fermions \\cite{levich_yakhot_77,levich_yakhot_78a,levich_yakhot_78b}.  These works inherited ideas from earlier studies of condensation of photons in cosmological scenarios~\\cite{Zeldovich1968a}.  In a homogeneous system, condensation is signified by a delta-function singularity of the momentum distribution at zero momentum (see, e.g., Ref.~\\cite{pitaevskii_stringari_book_03}).  Levich and Yakhot found~\\cite{levich_yakhot_77} that an initially non-degenerate equilibrium ideal Bose gas brought in contact with a bath with a temperature below \n$T_\\mathrm{c}$ would develop such a singularity at zero momentum only in the limit of an infinite evolution time (see also Ref.~\\cite{Tikhodeev1990a}).  These same authors subsequently found that the introduction of collisions between the bosons lead to the ``explosive'' development of a singular peak at zero momentum after a finite evolution time~\\cite{levich_yakhot_78a,levich_yakhot_78b}.  They were careful to point out, however, the approximations involved in their treatment of interactions, and indeed that the development of such coherence invalidates the assumptions underlying the quantum Boltzmann description, conjecturing that ``the system in the course of phase transition passes through a stage which may be identified as a period of strong turbulence'' \\cite{levich_yakhot_78a}. \n\nExperimental attempts in the 1980s to achieve Bose condensation of spin-polarized hydrogen (see the chapter by Greytak and Kleppner for an overview and recent developments), and excitons in semiconductors such as Cu$_2$O, inspired renewed theoretical interest in Bose-gas kinetics.  Eckern developed a kinetic theory~\\cite{eckern_84} for Hartree--Fock--Bogoliubov quasiparticles appropriate to the relaxation of the system on the condensed side of the transition.  Snoke and Wolfe revisited the question of the kinetics of approach to the condensation transition by undertaking numerical calculations of the quantum Boltzmann equation~\\cite{snoke_wolfe_89}.  They found in particular that the bosonic enhancement of scattering rates in the degenerate regime offset the increased number of scattering events required for rethermalisation in this regime, such that re-equilibration of a shock-cooled thermal distribution takes place on the order of three to four kinetic collision times, $\\tau_\\mathrm{kin}=(\\rho\\sigma v_{T})^{-1}$, where $\\rho$ is the particle density, $\\sigma$ is the collisional cross section, and the mean thermal velocity \n$v_{T} = (3 k_\\mathrm{B} T / m)^{1/2}$.\nThese results imply that a Boltzmann-equation description of this early kinetic regime is valid even for short-lived particles such as excitons, as the particle lifetime is long compared to this equilibration timescale.\n\nOver time a comprehensive picture of the process of condensation of a quench-cooled gas has emerged, and comprises three distinct stages of nonequilibrium dynamics:\na kinetic redistribution of population towards lower energy modes in the non-condensed phase, development of an instability that leads to nucleation of the condensate and a subsequent build-up of coherence, and finally condensate growth and phase ordering. \nIn the midst of increasingly intensive efforts to achieve Bose condensation in dilute atomic gases, by then including the new system of alkali-metal vapours, these stages were analysed in more detail in the early 1990s, beginning with a series of papers by Stoof \\cite{stoof_91,stoof_92, stoof_95,stoof_97,stoof_99}, and by Svistunov, Kagan, and Shlyapnikov \\cite{svistunov_91,kagan_svistunov_92,kagan_svistunov_94,kagan_95}.\n\nIn Ref.~\\cite{svistunov_91}, Svistunov discussed condensate formation in a weakly interacting, dilute Bose gas, with so-called gas parameter $\\zeta= \\rho^{1/3} a\\ll1$, where $a$ is the scattering length.  In a closed system, a cooling quench generically leads to a particle distribution which, below some energy scale $\\varepsilon_{0}$,  exceeds the equilibrium occupation number corresponding to the total energy and particle content.\nEnergy and momentum conservation then imply that a few particles scattered to high-momentum modes carry away a large fraction of the excess energy associated with this over-occupation, allowing the momentum of a majority of the particles to decrease.  \nShould the characteristic energy scale of the overpopulated regime be sufficiently small, \n$\\varepsilon_{0}\\ll\\hbar^{2}\\rho^{2/3}/m\\sim k_\\mathrm{B}T_\\mathrm{c}$, mode-occupation numbers in this regime will be much larger than unity, and the subsequent particle transport in momentum space towards lower energies is described by the quantum Boltzmann equation in the \nclassical-wave limit~\\cite{svistunov_91,kagan_svistunov_92,kagan_svistunov_94}.\nThis is valid for modes with energies above the scale set by the chemical potential \n$\\mu=g\\rho\\sim\\zeta k_\\mathrm{B} T_\\mathrm{c}$ of the ultimate equilibrium state, where $g=4\\pi \\hbar^{2}a/m$ is the interaction constant for particles of mass $m$.  At lower energies, the phase correlations between momentum modes become significant, and a description beyond the quantum Boltzmann equation is required.  \n\nWe note that for open systems such as exciton-polariton condensates,  the quasi-coherent dynamics of such low-energy modes will in general be  sensitive to the driving and dissipation corresponding to the continual  decay and replenishment of the bosons.\nSuch external coupling can dramatically alter the behaviour of the system, and its effects on condensate formation dynamics are a subject of current research --- \nsee, e.g., Refs.~\\cite{sieberer_huber_13,altman_sieberer_15,dagvadorj_fellows_14} and the chapter by Altman {\\em et al.}.  Hereafter, unless otherwise specified, the theoretical developments we discuss pertain to closed systems in which the bosons undergoing condensation are conserved in number during the formation process.\n\nBy assuming the scattering matrix elements in the wave Boltzmann equation to be independent of the mode energies, Svistunov discussed several different transport scenarios within the framework of weak-wave turbulence, in analogy to similar processes underlying Langmuir-wave turbulence in plasmas \\cite{Zakharov1992a}.\nHe concluded that the initial kinetic transport stage of the condensation process evolves as a weakly non-local particle wave in momentum space.  \nSpecifically, he proposed that the particle-flux wave followed the self-similar form $n(\\varepsilon,t)\\sim\\varepsilon_{1}(t)^{-7/6}f(\\varepsilon/\\varepsilon_{1}(t))$, with $\\varepsilon_{1}(t)\\sim(t-t_{*})^{3}$, and scaling function $f$ falling off as $f(x)\\propto x^{-\\alpha}$ for $x\\gg1$, with $\\alpha=7/6$.\nFollowing the arrival of this wave at time $t_*\\simeq t_0 +\\hbar\\varepsilon_0/\\mu^2$, a quasi-stationary wave-turbulent cascade forms in which particles are transported locally, from momentum shell to momentum shell, from the scale $\\varepsilon_{0}$ of the energy concentration in the initial state to the low-energy regime $\\varepsilon\\lesssim\\mu$ where coherence formation sets in.\n\nThe wave-kinetic (or weak-wave turbulence) stage of condensate formation following a cooling quench was investigated in more detail by Semikoz and Tkachev \\cite{Semikoz1995a.PhysRevLett.74.3093,Semikoz1997a}{{\\color{magenta}{{{,}}}}} who solved the wave Boltzmann equation numerically and found results consistent with the above scenario, albeit with a slightly shifted power-law exponent $\\alpha\\simeq1.24$ for the wave-turbulence spectrum.  Later dynamical classical-field simulations of the condensation formation process by Berloff and Svistunov \\cite{berloff_svistunov_02} further corroborated the above picture.\n\n\n\n\\subsection{The formation of coherence}\n\nIt has been known for some time that a kinetic Boltzmann equation model is unable to describe the development of a macroscopic zero-momentum occupation in the absence of seeding or other modifications ~\\cite{levich_yakhot_77,snoke_wolfe_89,svistunov_91}.  In any event, the quantum Boltzmann equation ceases to be valid in the high-density, low-energy regime in which condensation occurs.\nThe two-body scattering receives significant many-body corrections once the interaction energy $ g\\int_{k\\lesssim p}\\mathrm{d}\\mathbf{k}\\,n_{k}$ of particles with momenta below a given scale $p$ exceeds the kinetic energy at that scale, and these are indeed the prevailing conditions when phase coherence emerges and the condensate begins to grow~\\cite{svistunov_91}.\n\nIn a series of papers~\\cite{stoof_91,stoof_92,stoof_97,stoof_99}, Stoof took  account of these many-body corrections and developed a theory of condensate nucleation\n resting on kinetic equations incorporating a ladder-resummed many-body $T$-matrix determined from a one-particle-irreducible (1PI) effective action or free-energy functional. \nIn the 1PI formalism the propagators appearing in the effective action are taken as fixed, determined in this case by the initial thermal Bose number \ndistribution and the spectral properties of a free gas.\n\nConstructed within the Schwinger--Keldysh closed-time-path framework, the method allows the determination of the time evolution of the self-energy and thus of an effective chemical potential for the \nzero-momentum mode through the phase transition. \nDuring the kinetic stage, once the system has reached temperatures \nbelow the interaction-renormalized critical temperature, the self-energy renders the \nvacuum state of the zero-momentum mode metastable.\nStoof found that this modification of the self-energy occurs on a time scale \n$\\sim\\hbar/k_\\mathrm{B}T_\\mathrm{c}$ and gives rise to a small seed population in the zero mode, $n_{0}\\sim\\zeta^{2}\\rho$, within the kinetic time scale \n$\\tau_\\mathrm{kin}\\sim \\hbar/(\\zeta^{2}k_\\mathrm{B}T_\\mathrm{c})$.\t\nHe argued that, following this seeding, the system undergoes an unstable semi-classical evolution of the low-energy modes. \nTaking interactions between quasiparticles into account he found that the \nsquared dispersion $\\omega(\\mathbf{p})^{2}$ becomes negative for $p\\lesssim\\hbar\\sqrt{an_{0}(t)}$, i.e., below a momentum scale of the order of the inverse healing length associated with the density $n_{0}(t)$ of the existing condensed fraction.\nAs a result, the condensate grows linearly in time\nover the kinetic time scale $\\tau_\\mathrm{kin}$.\nThe growth process eventually ceases due to the conservation of total particle number, whereafter the final kinetic equilibration of quasi-particles takes place over a time scale \n$\\sim\\hbar/(\\zeta^{3}k_\\mathrm{B}T_\\mathrm{c})$ as discussed \npreviously by Eckern \\cite{eckern_84}, and by Semikoz and Tkachev  \\cite{Semikoz1997a}.\n\n\n\n\n\n\\subsection{Turbulent condensation}\n\nThe semi-classical scenario \nof Stoof is built on the assumptions that the cooling quench has driven the system to the critical point in a quasi-adiabatic fashion, and that the neglect of thermal fluctuations and nonequilibrium over-occupations in the self-energy is justified \\cite{stoof_99}.  \nHowever, as previously pointed out in Ref.~\\cite{levich_yakhot_78a}, a more vigorous quench may drive the system into an intermediate stage of strong turbulence, where the coherences between wave frequencies lead to the formation of coherent structures, such as vortices, that have a significant influence on the subsequent dynamics.\nThe main processes and scales governing this stage were discussed in detail by Kagan and Svistunov~\\cite{kagan_svistunov_94,kagan_95}. \nAs a result of excess particles being transported kinetically into the coherent regime (wave numbers below the final inverse healing length, $k\\lesssim\\xi^{-1}\\sim\\sqrt{a\\rho}$),  the density and phase of the Bose field fluctuate strongly  on length scales \nshorter than $\\xi$.\nThe growing population at even smaller wave numbers then implies, according to Refs.~\\cite{svistunov_91,kagan_svistunov_92,kagan_svistunov_94}, the formation of a \\emph{quasicondensate} over the respective length scales, as the coherent evolution of the field according to the Gross--Pitaevskii equation causes the density fluctuations to strongly decrease at the expense of phase fluctuations.\nThis short-range phase-ordering occurs on a time scale \n$\\tau_\\mathrm{c}\\sim\\hbar/\\mu\\sim\\hbar/(\\zeta k_\\mathrm{B}T_\\mathrm{c})$.  Depending on the flux of excess particles entering the coherent regime, this leads to quasicondensate formation over a minimum length scale $l_\\mathrm{v}>\\xi$ (see Sects.~\\ref{sec:Davis:KibbleZurek} and \\ref{sec:Davis:NTFP}) \\cite{Nowak:2012gd}.\nThe phase, however, remains strongly fluctuating on larger length scales due to the formation of topological defects --- vortex lines and rings.\nThese vortices appear in the form of clumps of strongly tangled filaments \\cite{Schwarz1988a} with an average distance between filaments of order $l_\\mathrm{v}$.\nIf the cooling quench is sufficiently strong to drive the system near a non-thermal fixed point, cf.~Sect.~\\ref{sec:Davis:NTFP}, this quasicondensate is characterised by new universal scaling laws in space and time.\n\nThe work of Kagan and Svistunov  laid the foundations for studying the role of superfluid turbulence in the process of Bose--Einstein condensation.\nKozik and Svistunov have subsequently elucidated the decay of the vortex tangle \nvia the transport of Kelvin waves created on the vortex filaments through their reconnections, which \ncan itself assume a wave-turbulent structure \\cite{Kozik2004a.PhysRevLett.92.035301,Kozik2005a.PhysRevLett.94.025301,Kozik2005a.PhysRevB.72.172505,Kozik2009a}.\n\n\n\n\n\\section{Condensate formation experiments}\n\n\\subsection{Growth of condensate number}\n\nWe now provide a historical overview of both experiments and theory related to condensate formation in ultracold atomic gases. \nThe first experiments to achieve Bose--Einstein condensation in 1995~\\cite{anderson_ensher_95,davis_mewes_95} reached the phase space density necessary for quantum degeneracy using the technique of  evaporative cooling~\\cite{ketterle_vandruten_96} --- the steady removal of the most energetic atoms, followed by rethermalisation to a lower temperature via atomic collisions.  These experiments, which concentrated on the BEC atom number as the conceptionally simplest observable, provided an indication of the time scale for condensation in trapped atomic gases, in the range of milliseconds to seconds.  This gave the impetus for the development of\na quantum kinetic theory  by Gardiner and Zoller using the techniques of open quantum systems.  They first considered the homogeneous Bose gas~\\cite{gardiner_zoller_97a}, before extending the formalism to trapped gases~\\cite{gardiner_zoller_98, gardiner_zoller_00}. Their methodology split the system into a ``condensate band'', containing modes significantly affected by the presence of a BEC, and a ``non-condensate band'' containing all other levels.  A master equation was derived for the condensate band using standard techniques~\\cite{gardiner_zoller_book_04}, yielding equations of motion for the occupations of the condensate mode and the low-lying excited states contained in the condensate band.   A simple BEC growth equation derived from this approach  provided a reasonable first estimate of the time of formation for the   $^{87}$Rb and $^{23}$Na BECs of the JILA~\\cite{anderson_ensher_95} and MIT~\\cite{davis_mewes_95} groups, respectively.\n\nThe first experiment to explicitly study the formation dynamics of a BEC in a dilute weakly interacting gas was performed by the Ketterle group at MIT, using their newly developed technique of non-destructive imaging~\\cite{miesner_stamper-kurn_98}.  Beginning with an equilibrium gas just above the critical temperature, they performed a sudden evaporative cooling ``quench'' by removing all atoms above a certain energy.  The subsequent evolution led to the formation of a condensate, with a characteristic S-shaped curve for the growth in condensate number.  This was interpreted as \nevidence of bosonic stimulation in the growth process, and they fitted the simple BEC growth equation of Ref.~\\cite{gardiner_zoller_97b} to their experimental observations.  However, the measured growth rates did not fit the theory all that well.  \n\nGardiner and co-workers subsequently developed an expanded rate-equa\\-tion approach incorporating the dynamics of a number of quasiparticle levels~\\cite{gardiner_lee_98,lee_gardiner_00}.  This formalism predicted faster growth rates, mostly due to the enhancement of collision rates by bosonic stimulation, but still failed to agree with the experimental data.  One limitation of this approach was that it neglected the evaporative cooling dynamics of the thermal cloud, instead treating it as being in a supersaturated thermal equilibrium.\n\nThe details of the evaporative cooling were simulated in two closely related works by Davis \\emph{et al.}~\\cite{davis_gardiner_00} and Bijlsma \\emph{et al.}~\\cite{bijlsma_zaremba_00}.  The former was based on the quantum kinetic theory of Gardiner and Zoller, while the latter\nemerged as a limit of the \nfield-theoretical approach of Stoof \\cite{stoof_97,stoof_99} and\nthe ``ZNG'' formalism previously developed for nonequilibrium trapped Bose gases~\\cite{zaremba_nikuni_99} by Zaremba, Nikuni, and Griffin.\nThe latter authors used a broken-symmetry approach to derive a quantum Boltzmann equation for non-condensed atoms coupled to a Gross--Pitaevskii equation for the condensate~\\cite{zaremba_griffin_98,zaremba_nikuni_99}, thereby extending their two-fluid model for trapped BECs~\\cite{zaremba_griffin_98}, which was based on the pioneering work of Kirkpatrick and Dorfman~\\cite{kirkpatrick_dorfman_83,kirkpatrick_dorfman_85a,kirkpatrick_dorfman_85b,kirkpatrick_dorfman_85c}.  \nThe ZNG methodology has since been used successfully and extensively  to study a variety of nonequilibrium phenomena in partially condensed \nBose gases, such as the temperature dependence of collective excitations, as reviewed in Ref.~\\cite{griffin_nikuni_book_09}.  As \nthis methodology is explicitly based on \nsymmetry breaking, it cannot address the initial seeding of a BEC, or any critical physics arising from fluctuations. However, it can model continued growth once a BEC is present.\n\nThe works of Davis~\\emph{et al.}~\\cite{davis_gardiner_00} and Bijlsma \\emph{et al.}~\\cite{bijlsma_zaremba_00} both introduced approximations to the formalisms they were built on, assuming that the condensate grew adiabatically in its ground state, and \ntreating all non-condensed atoms in a Boltzmann-like approach.  Both papers boiled down to simulating the quantum Boltzmann equation in the ergodic approximation, in which the \nphase-space distribution depends on the phase-space variables only through the energy~\\cite{luiten_reynolds_96}. Despite the different approaches, the calculations were in excellent agreement with one another --- yet still quantitatively disagreed with the MIT experimental data~\\cite{miesner_stamper-kurn_98}.  This disagreement has remained unexplained.\n\n\nA second  study of evaporative cooling to BEC in a dilute gas was performed by the group of Esslinger and H\\\"{a}nsch in Munich~\\cite{kohl_davis_02}.  In this experiment the Bose cloud, which was again initially prepared in an equilibrium state slightly above \n$T_\\mathrm{c}$, was subjected to a continuous rf field inducing the ejection of \nhigh-energy atoms from the sample.  By adjusting the frequency of the applied field and thus the energies of the removed atoms, these authors were able to investigate the growth of the condensate for varying rates of evaporative cooling.  \nDavis and Gardiner extended their earlier approach~\\cite{davis_gardiner_00} to include the effects of three-body loss and gravitational sag on the cooling of the $^{87}$Rb cloud in this experiment~\\cite{davis_gardiner_02}.  Their calculations yielded excellent agreement with the experimental data of Ref.~\\cite{kohl_davis_02} within its statistical uncertainty for all but the slowest cooling scenarios considered.  An example is shown in Fig.~\\ref{fig:Davis1}(a). \n\nIn 1997 Pinkse~\\emph{et al.}~\\cite{pinkse_mosk_97} experimentally demonstrated that adiabatically changing the trap shape could increase the \nphase-space density of an atomic gas by up to a factor of two and conjectured that this effect could be exploited to cross the BEC transition in a thermodynamically reversible fashion.  This scenario was subsequently realised in the MIT group by Stamper-Kurn \\emph{et al.}~\\cite{stamper-kurn_miesner_98} by slowly ramping on a tight ``dimple'' trap formed from an optical dipole potential on top of a weaker harmonic magnetic trap.  \nThis experiment \nwas the setting for the first application of a stochastic Gross--Pitaevskii methodology~\\cite{stoof_01}, previously developed from a nonequilibrium formalism for Bose gases  by Stoof~\\cite{stoof_99}.   This is based on the many-body T-matrix approximation, and uses the Schwinger--Keldysh path integral formulation of nonequilibrium quantum field theory to derive a Fokker-Planck equation for both the coherent and incoherent dynamics of a Bose gas.  The classical modes of the \ngas were represented by a Gross--Pitaevskii equation, with additional dissipative and noise terms resulting from a collisional coupling to a thermal bath with a temperature $T$ and chemical potential $\\mu$.\n\n Proukakis~\\emph{et al.}~\\cite{proukakis_schmiedmayer_06} subsequently used this methodology to study the formation of quasicondensates in a one-dimensional dimple trap.  A much later experiment~\\cite{garrett_ratnapala_11} \ninvestigated the dynamics of condensate formation following the sudden introduction of a dimple trap, and included quantum-kinetic simulations that were in good agreement with the data.\n\nA novel method of cooling a bosonic cloud to condensation was introduced in 2003 by the Cornell group at JILA~\\cite{harber_mcguirk_03}, who demonstrated the evaporative cooling of an atomic Bose cloud brought in close proximity to a dielectric surface, due to the selective adsorption of high-energy atoms.\nMore recently, similar experiments have been undertaken by the Durham \\cite{marchant_handel_11} and T\\\"ubingen groups~\\cite{markle_allen_15}, with the observed rates of loss in the latter case explained accurately by non-ergodic ZNG-method calculations of the evaporative cooling dynamics.  \nExample results are shown in Fig.~\\ref{fig:Davis1}(b).\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=6cm]{figures/Kohl_Davis_QKT_with_label.pdf}\n\\includegraphics[height=6cm]{figures/surface_evaporation_with_label.pdf}\n\\caption{(a) Growth of an atomic Bose--Einstein condensate modelled with the quantum Boltzmann equation.  The experiment began with a $^{87}$Rb Bose gas in an elongated harmonic trap with $N_{{\\mathrm{i}}} = (4.2\\pm0.2) \\times 10^6$ atoms at a temperature of $T_\\mathrm{i} = (640 \\pm 30)$ nK, before turning on rf evaporative cooling with a truncation energy of \n$1.4 k_\\mathrm{B} T$.  The solid and dotted lines show the theoretical calculations with a starting number of $N_{\\mathrm{i}} = 4.2\\times10^6$ and $N_{\\mathrm{i}} = 4.4\\times10^6$ atoms respectively.  Taken from Ref.~\\cite{kohl_davis_02}. (b) Surface evaporation leading to the formation of a BEC, showing the total atom number for three different cloud-surface distances.  The lines are the results of ZNG simulations, the points are from experiment.  The dot-dash gold line is for a ZNG simulation neglecting collisions in the thermal cloud, demonstrating that modelling the full dynamics of the thermal cloud is necessary for a quantitative understanding of the experiment.  The inset shows the total number, thermal cloud number, and condensate number, from top to bottom respectively, as a function of time. Taken from Ref.~\\cite{markle_allen_15}.}\n\\label{fig:Davis1}\n\\end{figure*}\n\n\n\\subsection{Other theories for condensate formation}\nFor completeness, here we briefly outline other theoretical methods that can be applied to condensate formation.\nA generalised kinetic equation for thermally excited Bogoliubov quasiparticles was obtained by Imamovic-To\\-ma\\-so\\-vic and Griffin~\\cite{imamovic-tomasovic_griffin_01} based on the application of the Kada\\-noff--Baym nonequilibrium Green's function approach~\\cite{kadanoff_baym_book_62} to a trapped Bose gas. \nThis kinetic equation reduces to that of Eckern~\\cite{eckern_84} in the homogenous limit and to that of ZNG~\\cite{zaremba_nikuni_99} when the quasiparticle character of the excitation spectrum is neglected. \nWalser \\emph{et al.}~\\cite{walser_williams_99,walser_cooper_01} derived a kinetic theory for a weakly interacting condensed Bose gas in terms of a coarse graining of the $N$-particle density operator over configurational variables.  Neglecting short-lived correlations between colliding atoms in a Markov approximation, they obtained kinetic equations for the condensate and noncondensate mean fields which were subsequently shown to be microscopically equivalent~\\cite{wachter_walser_01a} to the nonequilibrium Green's function approach of Ref.~\\cite{imamovic-tomasovic_griffin_01}.  \nExactly the same kinetic equations were derived by Proukakis \\cite{proukakis_2001a}, within the formalism of his earlier quantum kinetic formulation \\cite{proukakis_burnett_1996,proukakis_burnett_1998}, based on the adiabatic elimination of rapidly-evolving averages of non-condensate operators, ideas which fed into the development of the ZNG kinetic model \\cite{shi_griffin_98}.\nAlthough elegant, these formalisms have not provided a tractable computational methodology for modelling condensate formation away from the quasistatic limit.\n\nA non-perturbative method for the many-body dynamics of the Bose gas far from equilibrium has been developed by Berges, Gasenzer, and co-workers~\\cite{gasenzer_berges_05,berges_gasenzer_07,branschadel_gasenzer_08,Bodet2011a}.  This two-particle irreducible (2PI) effective-action approach provides a systematic way to derive approximate Kadanoff--Baym equations consistent with conservation laws such as those for energy and particle number. \nIn contrast to 1PI methods, single-particle correlators are \ndetermined self-consistently by these equations. \nThis approach allows the description of strongly correlated systems, and has been exploited in the context of turbulent condensation \\cite{Berges:2008wm,Berges:2008sr,Scheppach:2009wu} where it provides a self-consistently determined many-body $T$~matrix. \nThis 2PI effective-action approach is useful for studying strongly interacting systems such as 1D gases with large coupling constant~\\cite{Kronenwett:2010ic}, or relaxation and (pre-)thermalization of strongly correlated spinor gases \\cite{Babadi2015a.PhysRevX.5.041005}.\n\n\n\\subsection{Other pioneering condensate-formation experiments}\n\nThere are a number of experimental methods  other than evaporative cooling to increase the \nphase-space density of a quantum gas and form a condensate.   We briefly mention them here for completeness.\n\nAn experimental technique that has proved to be extremely useful for multi-component quantum gases is the method of sympathetic cooling, in which an atomic gas is cooled by virtue of its collisional interaction with a second gas of atoms, distinguished from the first either isotopically or by internal quantum numbers, which is itself subject to, e.g., evaporative cooling.  This technique was first demonstrated by Myatt \\emph{et al.}~\\cite{myatt_burt_97} in a gas comprising two distinct spin states of $^{87}$Rb, and was subsequently employed to cool a single-component Fermi gas to degeneracy by Schreck \\emph{et al.}~\\cite{schreck_ferrari_01}.\n\nIn a similar spirit, in 2009 the Inguscio group in Florence used entropy exchange between components of a two-species $^{87}$Rb-$^{41}$K Bose gas mixture to induce BEC in one of the components~\\cite{catani_barontini_09}.  The two gases were brought close to degeneracy by cooling, after which the strength of the  $^{41}$K  trapping potential was adiabatically increased, by introducing an optical dipole potential \nto which the $^{87}$Rb component \nwas largely insensitive.  In a single-component system this would lead to an increase in the temperature and leave the phase-space density unaffected.  However, in the dual-species setup the $^{87}$Rb cloud acted as a thermal reservoir, suppressing the temperature increase of the $^{41}$K component and causing it to cross the BEC threshold.\n\nIn 2004, the Sengstock group observed the formation of a BEC at constant temperature~\\cite{Erhard2004a}.  Working with a spin-1 system, they prepared a partially condensed gas consisting of  $m_F = \\pm1$ states.  Spin collisions within the BEC components populated the $m_F = 0$ state, which then quickly thermalised.  When the population of the $m_F =  0$ component reached the critical number a new BEC emerged.  The experiment was modelled with a simple rate equation.\n\nIn the same year, Ketterle's MIT group  performed an experiment \nin which they distilled a BEC from one trap minimum to another~\\cite{shin_saba_04}.  A non-zero-temperature BEC was formed in an optical dipole trap, before a second trap with a greater potential depth was brought nearby.  Atoms of sufficient thermal energy were able to cross the barrier between the two potential minima, populating the second trap.  Eventually the first condensate evaporated, and a second condensate formed in the new global trap minimum.\n\nFinally, we mention a recent experiment by the group of Schreck at Innsbruck, \nwho demonstrated the first experimental production of a BEC \nsolely by laser cooling~\\cite{stellmer_pasquiou_13}.  This feat was made possible by laser cooling on a narrow-linewidth transition of $^{84}$Sr, resulting in a low \nDoppler-limit temperature of just 350 nK.  A ``light-shift'' laser beam was introduced at the centre of the trap so that the atoms in that region no longer responded to the laser cooling, \nafter which an additional dimple trap was introduced to confine the atoms.  Repeatedly cycling the dimple trap on and off resulted in the formation of several condensates~\\cite{stellmer_pasquiou_13}.\n\n\n\n\n\n\\subsection{Low-dimensional Bose systems and phase fluctuations}\n\nThe experiments described above were in the three-dimensional (3D) realm, in which long-wavelength phase fluctuations are strongly suppressed away from the vicinity of the phase transition.  In lower dimensional systems such fluctuations are enhanced, leading to dramatic modifications to the physics of the degenerate regime.  In a two-dimensional (2D) system, thermal fluctuations of the phase erode the long-range order associated with true condensation, leaving only so-called quasi-long-range order characterised by correlation functions that decay algebraically with spatial separation~\\cite{Popov1972}.  A more complete analysis reveals the importance of vortex-antivortex pairs in this phase-fluctuating ``quasi-condensed'' regime~\\cite{kosterlitz_thouless_73}.  Such pairs undergo a so-called Berezinskii--Kosterlitz--Thouless (BKT) deconfinement transition at some finite temperature, above which even quasi-long-range order is lost and superfluidity is extinguished.  \nTwo-dimensional Bose systems are of particular interest due to their natural realisation in systems such as liquid helium films and the fact that the degenerate Bose quasiparticles such as excitons and polaritons in semiconductor systems are typically confined in a planar geometry.  An insightful overview of BKT physics can be found in the chapter by Kim, Nitsche and Yamamoto in this volume. \n\nThere have been numerous experimental \nrealisations of (quasi-)2D Bose gases in cold-atom experiments~\\cite{hadzibabic_kruger_06,schweikhard_tung_07,kruger_hadzibabic_07,clade_ryu_09,tung_lamporesi_10,hung_zhang_11}, with most notable the observations of \nthermally activated vortices \nvia interferometric measurements \\cite{hadzibabic_kruger_06} and the direct probing of the equation of state and \nscale invariance of the 2D system \\cite{hung_zhang_11} (see the chapter by Chin and Refs.~\\cite{prokofev_ruebenacker_01,simula_blakie_06,holzmann_krauth_08,bisset_davis_09,cockburn_proukakis_12} for related theoretical considerations). \nFurther details and a lengthy discussion of the interplay between BKT and BEC in homogeneous and trapped systems can be found in \nRef.~\\cite{hadzibabic_dalibard_12}.  Although theoretical works on the dynamics of such systems have existed for some time, little experimental work on the formation dynamics of condensates in these systems has been undertaken (aside from the quasi-2D Kibble-Zurek works discussed in the following section). \nConsiderable discussion is currently taking place \nregarding the emergence and nature of the BKT transition in driven-dissipative polariton condensates: experimentalists have observed evidence for quasi-long-range order \\cite{roumpos_lohse_12,nitsche_kim_14} (see \nKim \\emph{et al.}'s chapter), but the \nnature of the transition and its ``nonequilibrium\" features are \ntopics of current debate \\cite{dagvadorj_fellows_14,altman_sieberer_15} (see also the chapter by Keeling {\\em et al.}). \n\nIn one dimension, the effects of phase fluctuations are even more pronounced, leading to the complete destruction of long-range order and superfluidity at any finite temperature.  Many experiments with cold atoms in elongated \n``cigar-shaped'' traps have investigated the physics of such (quasi-) one-dimensional systems, though again, little work has been done on the formation dynamics of these degenerate samples.  We note, however, that quasicondensate regimes somewhat analogous to those of (quasi-) one-dimensional systems can be realized in elongated 3D traps~\\cite{petrov_shlyapnikov_01}.  In such a regime, the Bose gas behaves much as a conventional three-dimensional Bose condensate, except that the coherence length of the gas is shorter than the system extent along the long axis of the trap.  A study of condensate formation \nin this regime was performed by the Amsterdam group of Walraven~\\cite{shvarchuck_buggle_02} in 2002 in \nan elongated $^{23}$Na \ncloud.  Similarly to the MIT experiment~\\cite{miesner_stamper-kurn_98}, they performed rapid quench cooling of their sample from just above the critical temperature.  However, the system was in the hydrodynamic regime in the \nweakly trapped dimension, i.e., the mean distance between collisions was much shorter than the system length.  \n\n It was argued that the system rapidly came to a local thermal equilibrium in the radial direction, resulting in cooling of the cloud below the \\emph{local} degeneracy temperature over a large spatial region and generating an elongated quasicondensate.  However, \nthe extent of this quasicondensate along the long axis of the trap was larger than that expected at equilibrium, leading to large amplitude oscillations.  The momentum distribution of the \ncloud was imaged via ``condensate focussing'', with the breadth of the focal point giving an indication of the magnitude of the phase fluctuations present in the \nsample.  This interesting experiment was somewhat ahead of its time, with theoretical techniques unable to address many of the nonequilibrium aspects of the problem.  \n\nIn 2007 the group of Aspect from Institut d'Optique also studied the formation of a quasicondensate in an elongated \nthree-dimensional trap via continuous evaporative cooling~\\cite{hugbart_retter_07} in a similar fashion to the earlier work by K\\\"{o}hl \\emph{et al.}~\\cite{kohl_davis_02}.  As well as measuring the condensate number, they also performed Bragg spectroscopy during the growth to determine the momentum width and hence the coherence length of the system.  They found that the momentum width they measured rapidly decreased with time to the \nwidth expected in equilibrium for the instantaneous value of the condensate number. \nModelling of the growth of the condensate population \nusing the methodology of Ref.~\\cite{davis_gardiner_02}\nproduced results in good agreement with the experimental data, apart from an unexplained delay of 10--50 ms, depending on the rate of evaporation.\n\n\n\n\n\\section{Criticality and nonequilibrium dynamics}\n\nAs Bose--Einstein condensation is a continuous phase transition, the theory of critical phenomena~\\cite{binney_dowrick_92} predicts that in the vicinity of the critical point the correlations of the Bose field obey universal scaling relations.  In particular, the scaling of correlations at and near equilibrium is governed by a set of universal critical exponents and scaling functions, independent of the microscopic parameters of the gas.  \nFor a homogeneous system close to criticality, \nstandard theory predicts that the correlation length $\\xi$, relaxation time $\\tau$, and first-order correlation function $G(x)=\\langle\\psi^{\\dagger}(x)\\psi(0)\\rangle$ obey scaling laws\n\n\n", "index": 1, "text": "\\begin{equation}\n\\xi = \\frac{\\xi_0}{|\\epsilon|^\\nu}, \n\\quad \n\\tau = \\frac{\\tau_0}{|\\epsilon|^{\\nu z}},\n\\quad\nG(x) = \\epsilon^{\\nu(d-2+\\eta)}\\mathcal{F}(\\epsilon^{\\nu} x),\n\\label{davis_crit_exponents}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\xi=\\frac{\\xi_{0}}{|\\epsilon|^{\\nu}},\\quad\\tau=\\frac{\\tau_{0}}{|\\epsilon|^{\\nu&#10;z%&#10;}},\\quad G(x)=\\epsilon^{\\nu(d-2+\\eta)}\\mathcal{F}(\\epsilon^{\\nu}x),\" display=\"block\"><mrow><mrow><mrow><mi>ξ</mi><mo>=</mo><mfrac><msub><mi>ξ</mi><mn>0</mn></msub><msup><mrow><mo stretchy=\"false\">|</mo><mi>ϵ</mi><mo stretchy=\"false\">|</mo></mrow><mi>ν</mi></msup></mfrac></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>τ</mi><mo>=</mo><mfrac><msub><mi>τ</mi><mn>0</mn></msub><msup><mrow><mo stretchy=\"false\">|</mo><mi>ϵ</mi><mo stretchy=\"false\">|</mo></mrow><mrow><mi>ν</mi><mo>⁢</mo><mi>z</mi></mrow></msup></mfrac></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msup><mi>ϵ</mi><mrow><mi>ν</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>d</mi><mo>-</mo><mn>2</mn></mrow><mo>+</mo><mi>η</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ϵ</mi><mi>ν</mi></msup><mo>⁢</mo><mi>x</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06197.tex", "nexttext": "\nwhere $d$ is the dimensionality of the sample and $p$ is the intrinsic dimensionality of the defects.\n\nZurek initially described the KZM in the context of vortices in the $\\lambda$-transition of superfluid $^4$He~\\cite{zurek_85}.  Although vortices are observed in the wake of this transition, it is difficult to identify them as having formed due to the KZM rather than being induced by, e.g., inadvertent stirring~\\cite{zurek_96} (see also the chapter by Pickett in this volume).  \nThe prospect of generating vorticity in atomic BECs by means of the KZM was first discussed by Anglin and Zurek in 1999~\\cite{anglin_zurek_99}.    However, it was not until the 2008 experiment of the Anderson group at the University of Arizona~\\cite{weiler_neely_08} that spontaneously formed vortices were first observed in such a system (see also Ref.~\\cite{freilich_bianchi_10}).  \n \nThe observations of spontaneous vortices in Ref.~\\cite{weiler_neely_08} were supported by numerical simulations using the stochastic projected Gross-Pitaevskii equation description of Gardiner and Davis~\\cite{gardiner_davis_03}.  Their results are shown in Fig.~\\ref{fig:Davis3}.\nThis formalism is essentially a variant of the Gardiner-Zoller quantum kinetic theory, obtained by making a high-temperature approximation to the condensate-band master equation and then exploiting the quantum-classical correspondence of the Wigner representation to obtain a stochastic classical-field description of the condensate band~\\cite{gardiner_davis_03, blakie_bradley_08}. \nAlthough derived using different theoretical techniques, the resulting description is similar to the stochastic Gross-Pitaevskii equation of Stoof~\\cite{stoof_99,stoof_01}, both in terms of its physical content and its computational implementation\n--- see, e.g., discussion in Refs.~\\cite{proukakis_jackson_08,cockburn_proukakis_09}.\nA related phase-space method originating in quantum optics known as the positive-P representation has also been applied to ultracold gases~\\cite{steel_olsen_98}.  This has been used to investigate cooling \nof a small system towards BEC by Drummond and Corney~\\cite{drummond_corney_99}, \nwho observed features consistent with spontaneously formed vortices.  Despite formally being a statistically exact method, for interacting systems it tends to suffer from numerical divergences after a relatively short evolution time.\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=5.5cm]{figures/Weiler_Fig1a_with_label.pdf}\n\\includegraphics[height=6cm]{figures/Weiler_Fig1b_with_label.pdf}\n\\caption{Spontaneous vortices in the formation of a Bose--Einstein condensate. (a) Squares: Experimentally measured condensate population as a function of time.  Solid line: Condensate number from stochastic Gross--Pitaevskii simulations.  Dashed line: probability of finding one or more vortices in the simulations as a function of time, averaged over 298 trajectories.  The shaded area indicates the statistical uncertainty in the experimentally measured vortex probability at $t= 6.0$ s.  It was observed in experiment that there was no discernible vortex decay between 3.5 s and 6.0 s  (b) Experimental absorption images taken after 59 ms time-of-flight showing the presence of vortices.  (c) Simulated in-trap column densities  at $t=3.5$ s [indicated by the left vertical dotted line in (a).] (d) Phase images through the $z=0$ plane, with plusses (open circles) representing vortices with positive (negative) circulation. \nAdapted from C.~N.~Weiler \\emph{et al.}~\\cite{weiler_neely_08}.}\n\\label{fig:Davis3}\n\\end{figure*}\n\nIt seems likely that spontaneously formed vortices and other defects were present in earlier BEC-formation experiments, but not observed due to the practical difficulties inherent in resolving these defects in experimental imaging --- and indeed the fact that these experiments were not attempting to investigate whether such structures were present. \nAnother difficulty in identifying quantitative signatures of the KZM in experimental BECs is the inhomogeneity of the system in the experimental trapping potential, which is typically harmonic.  From the point of view of a local-density approximation, this inhomogeneity implies that the instantaneous coherence length and relaxation timescale are spatially varying quantities, and that the transition occurs at different times in different regions of space as the system is cooled. \nFollowing preliminary reports of the experimental observation of dark solitons following the formation of a quasi-one-dimensional BEC by the group of Engels at the University of Washington~\\cite{chiang_hamner_09}, Zurek applied the framework of the KZM to a quasi-1D BEC in a cigar-shaped trap to estimate the scaling of the number of spontaneously generated solitons as a function of the quench time~\\cite{zurek_09,damski_zurek_10}.  Witkowska \\emph{et al.}~\\cite{witkowska_deuar_11} numerically studied cooling leading to solitons in a comparable one-dimensional geometry.  Zurek's methodology for inhomogeneous systems was applied by del~Campo \\emph{et al.}~\\cite{delcampo_retzker_11} to strongly oblate geometries in which vortex filaments behave approximately as point vortices in the plane, an idealisation of the geometry of the experiment of Weiler \\emph{et al.} \\cite{weiler_neely_08}.  \n\n\nLamporesi \\emph{et al.}~\\cite{lamporesi_donadello_13} recently reported the spontaneous creation of Kibble--Zurek dark solitons in the formation of a BEC in \nan elongated trap, and found the scaling of the number of observed defects with cooling rate in good agreement with the predictions of Zurek~\\cite{zurek_09}.  It was later realised that the apparent solitons were actually solitonic vortices \\cite{trento_prl}. \nThe effects of inhomogeneity in such experiments can be mitigated by the realisation of ``box-like'' \nflat-bottomed trapping geometries.  The Dalibard group in Paris has observed the formation of spontaneous vortices in \na quasi-2D box-like geometry, and found scaling of the vortex number with quench rate in good agreement with the predictions of the KZM~\\cite{chomaz_corman_15}.   \nWe also note further work by the Dalibard group~\\cite{corman_chomaz_14} verifying the production of quench-induced supercurrents in a toroidal or ``ring-trap'' geometry~\\cite{das_sabbatini_12} analogous to the annular sample of superfluid helium considered in Zurek's original proposal~\\cite{zurek_85}.\n\nExperimental investigations of the KZM in dilute atomic gases have largely \nfocused on the imaging of defects in the wake of the phase transition --- either following time-of-flight expansion~\\cite{weiler_neely_08,lamporesi_donadello_13,chomaz_corman_15} or {\\em in situ} \\cite{trento_prl}.  However, the accurate extraction of critical scaling behaviour from such observations is hampered by the large background excitation of the field near the transition, and the \nrelaxation (or ``coarsening'') dynamics of defects in the symmetry-broken phase.  An alternative approach is to make quantitative measurements of global properties of the system following the quench.  Performing quench experiments in a three-dimensional box-like geometry, the Hadzibabic group in Cambridge~\\cite{navon_gaunt_15} made careful measurements of the scaling of the correlation length with quench time.  From the measured scaling law, these authors were able to infer a beyond-mean-field value $z = 1.4 \\pm 0.2$ for the dynamical critical exponent for this universality class.  Some of the results of Ref.~\\cite{navon_gaunt_15} are displayed in Fig.~\\ref{fig:Davis2}(b). \n\n\nThe possibilities for the \ntrapping and cooling of multicomponent systems in atomic physics experiments have naturally lead to investigations of the spontaneous formation of more complicated topological defects during a phase transition. Although such experiments have so-far largely focused on the formation of defects following a quench of Hamiltonian parameters~\\cite{sadler_higbie_06, de_campbell_14}, the formation of nontrivial domain structures following gradual sympathetic cooling in immiscible $^{85}$Rb-$^{87}$Rb~\\cite{papp_pino_08} and $^{87}$Rb-$^{133}$Cs~\\cite{mccarron_cho_11} Bose-Bose mixtures has also been observed.  \nThe competing growth dynamics of the two immiscible components in the formation of such a binary condensate have recently been investigated theoretically in the limit of a sudden temperature quench~\\cite{liu_pattinson_15} (see also Refs.~\\cite{sabbatini_zurek_11,swislocki_witkowska_13,hofmann_natu_14} for related critical scaling in other Hamiltonian quenches).  These investigations indicate the rich nonequilibrium dynamics possible in these systems, including strong memory effects on the coarsening of spontaneously formed defects and the potential ``microtrapping'' of one component in spontaneous defects formed in the other.\n\n\n\\subsection{Non-thermal fixed points}\n\\label{sec:Davis:NTFP}\n\nA general characterisation of the relaxation dynamics of quantum many-body systems quenched far out of equilibrium remains a largely open problem.  In particular, it is interesting to ask to what extent analogues of the universal descriptions arising from the equilibrium theory of critical fluctuations may exist for nonequilibrium systems.  A recent advance towards answering such questions has been made in the development of the theory of non-thermal fixed points: universal nonequilibrium configurations showing scaling in space and (evolution) time, characterised by a small number of fundamental properties.  The theory of such fixed points transposes the concepts of equilibrium and diffusive near-equilibrium renormalisation-group theory to the real-time evolution of nonequilibrium systems.  These developments provide, for example, a framework within which to understand the turbulent, coarsening, and relaxation dynamics following the creation of various kinds of defects and nonlinear patterns in a Kibble-Zurek quench.\n\nThe existence and significance of non-thermal scaling solutions in space and time was discussed by Berges  and collaborators in the context of reheating after early-universe inflation \\cite{Berges:2008wm,Berges:2008sr} and then \ngeneralised by Berges, Gasenzer, and coworkers to scenarios of strong matter-wave turbulence~\\cite{Scheppach:2009wu,Mathey2014a.PhysRevA.92.023635}.\nFor the condensation dynamics of the dilute Bose gas discussed here, the presence of a non-thermal fixed point can exert a significant  influence in the case of a strong cooling quench  \\cite{Nowak:2012gd,Orioli:2015dxa,Berges:2012us}.\n\nAs an illustration, we consider a particle distribution that drops abruptly above the healing-length scale $k_{\\xi}=\\sqrt{8\\pi a\\rho}$, as depicted on a double-logarith\\-mic scale in Fig.~\\ref{fig:NTFP} (dashed line).  In order for the influence of the non-thermal fixed point to be observed, the decay of $n(k)$ above $Q\\simeq k_{\\xi}$ is assumed to be much steeper than the quasi-thermal scaling that develops in the kinetic stage of condensation following a weak quench~\\cite{Semikoz1995a.PhysRevLett.74.3093,Semikoz1997a}, as discussed in Sect.~\\ref{sec:Davis:BECFormation}.\nSuch a distribution would, e.g., result from a severe cooling quench of a thermal Bose gas initially just above the critical temperature where $T>|\\mu|/k_\\mathrm{B}$ such that the Bose-Einstein distribution has developed a Rayleigh--Jeans scaling regime where $n(k)\\sim 2mk_\\mathrm{B}T/(\\hbar k)^{2}$. \nThe modulus of the chemical potential of this state determines the momentum scale $Q$ where the flat infrared scaling of the distribution goes over to the Rayleigh--Jeans scaling at larger $k$.\nIf this chemical potential is of the order of the ground-state energy of the post-quench fully condensed gas, $(\\hbar Q)^2/2m\\simeq|\\mu|\\simeq g\\rho$, with $g=4\\pi\\hbar^{2} a/m$, then the energy of the entire gas is concentrated at the scale $Q\\simeq k_{\\xi}$ after the quench.\nThis is a key feature of the extreme nonequilibrium initial state from which a non-thermal fixed point can be approached.\nWe note that, if in this state there is no significant zero-mode occupation $n_{0}$, the respective occupation number at $Q$ is on the order of the inverse of the diluteness parameter, $n_{Q}\\sim \\zeta^{-3/2}$. \n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=8cm]{figures/Fig_NTFP.pdf}\n\\caption{Sketch of the evolution of the single-particle momentum distribution $n_{k}(t)$ of a Bose gas close to a non-thermal fixed point (after Ref.~\\cite{Orioli:2015dxa}). Starting from the extreme initial distribution (dashed line, see main text for details) produced, e.g., by a strong cooling quench, a bidirectional redistribution of particles in momentum space (arrows) builds up a quasicondensate in the infrared while refilling the thermal tail at large momenta. The particle transport towards zero momentum is characterised by a self-similar scaling evolution in space and time, $n(k,t)=(t/t_{0})^{\\alpha}n([t/t_{0}]^{\\beta}k,t_{0})$, with characteristic scaling exponents $\\alpha$, $\\beta$. Note the double-logarithmic scale.}\n\\label{fig:NTFP}\n\\end{figure}\n\n\nIn analogy to the weak-wave-turbulence scenario \\cite{svistunov_91,kagan_svistunov_92,Semikoz1995a.PhysRevLett.74.3093,Semikoz1997a} discussed in Sect.~\\ref{Pre-condensationKinetic}, the initial overpopulation of modes with energies $\\sim (\\hbar Q)^{2}/2m$ leads to inverse particle transport while energy is transported to higher wavenumbers, as indicated by the arrows in Fig.~\\ref{fig:NTFP} \\cite{Nowak:2012gd,Orioli:2015dxa,Berges:2012us}. \nHowever, the inverse transport involves non-local scattering and thus does not represent a cascade.\nFurthermore, in contrast to the case of a weak quench \\cite{stoof_91,stoof_92,stoof_99,svistunov_91,kagan_svistunov_92,Semikoz1997a,berloff_svistunov_02}, in which weak-wave turbulence produces a quasi-thermal momentum distribution that  relaxes quickly to a thermal equilibrium distribution, here the inverse transport is characterised by a strongly non-thermal power-law scaling in the infrared.  Specifically, the momentum distribution $n(k)\\sim k^{-d-2}\\sim k^{-5}$ in $d=3$ dimensions~\\cite{Scheppach:2009wu} provides the ``smoking-gun''  of the influence of the non-thermal fixed point. \nSemiclassical simulations by Nowak, Gasenzer and collaborators \\cite{Nowak:2010tm,Nowak:2011sk,Nowak:2012gd,Nowak:2013juc} showed that this scaling is associated with the creation, dilution, coarsening and relaxation of a complex vortex tangle, as predicted on phenomenological grounds in Ref.~\\cite{kagan_svistunov_94}, and other types of (quasi-)topological excitations in low-dimensional, spinor and gauge systems~\\cite{Schole:2012kt,Schmidt:2012kw,Karl:2013mn, Karl:2013kua, Gasenzer:2013era}.  \n\nThe dynamics in the vicinity of the fixed point are characterised by an anomalously slow relaxation of the total vortex line length, which exhibits an algebraic decay $\\sim t^{-0.88}$ (see Ref.~\\cite{Schole:2012kt} for analogous results in the 2D case). At the same time, the condensate population grows as $n_{0}(t)\\sim t^{2}$ \\cite{Nowak:2012gd,Orioli:2015dxa}, a significant slowing compared to the $\\sim t^{3}$ behaviour observed for weakly nonequilibrium condensate formation \\cite{damle_majumdar_96,Nowak:2012gd}. \n\nIn the vicinity of the fixed point \nthe momentum distribution is expected to follow a self-similar scaling behaviour in space and time in the infrared, $n(k,t)=(t/t_{0})^{\\alpha}n([t/t_{0}]^{\\beta}k,t_{0})$.\nFor a 3D Bose gas, these scaling exponents have recently been numerically determined to be $\\alpha=1.66(12)$, $\\beta=0.55(3)$, in agreement with the analytically predicted values $\\alpha=\\beta d$, $\\beta=1/2$~\\cite{Orioli:2015dxa}.\nThis behaviour, here corresponding  to the dilution and relaxation of vortices leading to a build-up of the condensate population, represents the generalisation of critical slowing-down to real-time evolution far away from thermal equilibrium.\nAt very late times, the system leaves  the vicinity of the non-thermal fixed point, typically when the last topological patterns decay, and finally approaches thermal equilibrium \\cite{Kozik2004a.PhysRevLett.92.035301,Kozik2005a.PhysRevLett.94.025301,Kozik2005a.PhysRevB.72.172505,Kozik2009a,Schole:2012kt,connaughton_josserand_05}.\nThis equilibrium state corresponds to a fully established condensate superimposed with weak sound excitations.\n\nIn summary, non-thermal fixed points are nonequilibrium field configurations, exhibiting universal scaling in time and space, to which the system is attracted if suitably forced --- e.g., in the case of Bose condensation, following a sufficiently strong cooling quench.\nIn the vicinity of such fixed points, the relaxation of the field is critically slowed down and the dynamics exhibit self-similar time evolution, governed by new critical exponents and scaling functions.\nThe possibility of categorising systems into \ngeneralised ``universality classes'' associated with the new critical exponents is a fascinating prospect and the subject of current research~\\cite{sieberer_huber_13,altman_sieberer_15}.\n\nFinally in this section we note that prethermalisation or ``pre-Gibbsiani\\-sa\\-tion'', i.e., the approach of a state characterised by a Generalised Gibbs ensemble, usually in near-integrable systems (see the chapter by Schmiedmayer), represents a special case of a Gaussian non-thermal fixed point, meaning that the effective coupling of the prethermalised modes vanishes.\nIt is expected that the exponents $\\alpha$ and $\\beta$ in such a situation can become very small compared to unity.\nOnly at very late times the remaining effects of interactions may eventually drive the system away from the fixed point towards a thermal state. \n\n\\section{Conclusions and outlook}\n\nIn this chapter we have provided a brief introduction to the scenario of the formation of a Bose--Einstein condensate, and physics related to the dynamics of the BEC phase transition.  We have \ngiven a fairly comprehensive \nreview of the experiments studying the formation of simple, single-component BECs in three-dimensional atomic gases,\nwith brief mentions of how such features are affected by reduced effective dimensionality or in cases where more than one condensate may co-exist. However,  the underlying physics described here is relevant to several other systems, most notably exciton-polaritons confined in strictly two-dimensional geometries featuring pumping and decay, where experiments on condensate formation have also been performed~\\cite{nardin_lagoudakis_09,belykh_sibeldin_13,lagoudakis_manni_11}. \n\nAn interesting question is what are the similarities and differences between these systems, and others such as BECs of photons~\\cite{klaers_schmitt_10} and magnons~\\cite{demokritov_demidov_06}.  Furthermore, what can phase transitions in quantum gases teach us about phase transitions that cannot be accessed experimentally, such as inflationary scenarios of early-universe evolution?  This was one of the motivating questions in the formulation of the Kibble--Zurek mechanism, as well as in the development of the theory of non-thermal fixed points.  It remains to be seen what we can learn about such matters as the formation of cosmological topological defects and (possibly)  \nbaryon asymmetry by studying nanokelvin gases here on earth.\n\n\n\n\n\n\\bibliography{Davis_CUP_References_combined2}\n\\bibliographystyle{apsrev-MJD}\n\n\n\n\n\n", "itemtype": "equation", "pos": 51144, "prevtext": "\n\nwith $\\epsilon = T/T_\\mathrm{c} -1$ the reduced temperature, $\\nu$ and $z$ the correlation length and dynamical critical exponents, $\\eta$ the scaling dimension of the Bose field, and $\\mathcal{F}$ a universal scaling function.  The static  Bose gas belongs to the $XY$ (or $O(2)$) universality class, and is thus expected to have the same critical exponents as superfluid helium, i.e., in 3D, $\\nu \\simeq 0.67$ and $\\eta=0.038(4)$~\\cite{Zinn-Justin2002}.  \nThe critical dynamics of the system are expected to conform to those of the diffusive model denoted by $F$ in the classification of Ref.~\\cite{Hohenberg1977a}, implying a value $z=3/2$ for the dynamical critical exponent.\n\nThe influence of critical physics is significantly reduced in \nthe conditions of harmonic confinement typical of experimental Bose-gas systems, as compared to homogeneous systems.  Within a local-density approximation, the inhomogeneous thermodynamic parameters of the system imply that only a small fraction of atoms in the gas enter the critical regime, and so global observables are relatively insensitive to the effects of criticality.  Nevertheless, a few experiments have attempted to observe aspects of the critical physics of trapped Bose gases.  \n\nIn a homogeneous gas the introduction of interparticle interactions has no effect on the critical temperature at the mean-field level, but the magnitude and even the sign of the shift due to critical fluctuations was debated for several decades (see Ref.~\\cite{baym_blaizot_99} and references therein) before being settled by classical-field Monte-Carlo calculations~\\cite{kashurnikov_prokofev_01,arnold_moore_01}.  An experiment by the Aspect group carefully measured a shift in critical temperature of the trapped gas, but was unable to unambiguously infer any \nbeyond-mean-field contribution to this shift~\\cite{gerbier_thywissen_04,davis_blakie_06}.  A later experiment by the group of Hadzibabic made use of a Feshbach resonance to control the interaction strength in $^{41}$K, and found clear evidence of a positive beyond-mean-field shift~\\cite{smith_campbell_11} (see also the chapter by Smith in this volume).  \n\nIn 2007 the ETH Z\\\"urich group of Esslinger revisited their experiments on condensate formation and the coherence of a three-dimensional BEC with a new tool: the ability to count single atoms passing through an optical cavity below their ultra-cold gas~\\cite{ritter_ottl_07}.  They outcoupled atoms from two different vertical locations from their sample as it was cooled, realising interference in the falling matter waves.  By monitoring the visibility of the fringes, they were able to measure the growth of the coherence length as a function of time.  Using the same optical cavity setup, the Esslinger group subsequently measured the coherence length of their Bose gas as it was driven through the critical temperature by a small background heating rate, and determined the correlation-length critical exponent to be $\\nu = 0.67 \\pm 0.13$~\\cite{donner_ritter_07}. Their results are shown in Fig.~\\ref{fig:Davis2}(a).  Classical-field simulations of their experiment were in reasonable agreement, determining $\\nu = 0.80 \\pm 0.12$~\\cite{bezett_blakie_09}.  \n\n\\begin{figure*}\n\\centering\n\\includegraphics[height=5.5cm]{figures/Donner_crit_exp_nu_with_label.pdf}\n\\includegraphics[height=5.5cm]{figures/Hadzibabic_scaling_of_l_with_label.pdf}\n\\caption{Critical phenomena in BECs. (a) Divergence of the equilibrium correlation length $\\xi$ as a function of the reduced temperature, and the fitting of the critical exponent, giving the result $\\nu = 0.67\\pm 0.13$. Inset: Double logarithmic plot of the same data. Taken from Ref.~\\cite{donner_ritter_07}. (b) Log-log plot of the dependence of the correlation length, here labelled $\\ell$, as a function of the characteristic time \n$\\tau_\\mathrm{Q}$ of the quench through the BEC phase transition.  The solid line corresponds to a Kibble--Zurek power-law scaling \n$\\ell \\propto \\tau_\\mathrm{Q}^b$ with $b = 0.35\\pm0.04$, in agreement with the beyond-mean-field prediction $b=1/3$ of the so-called $F$ model~\\cite{Hohenberg1977a} and inconsistent with the mean-field value $b = 1/4$.  This in turn implies a value $z = 1.4 \\pm 0.2$ for the dynamical critical exponent. Taken from Ref.~\\cite{navon_gaunt_15}.\n}\n\\label{fig:Davis2}\n\\end{figure*}\n\nAlthough an important topic in its own right, the greatest significance of the equilibrium theory of critical fluctuations to studies of condensate formation is that it provides a basis for generalisations of concepts such as critical scaling laws and universality classes to the domain of nonequilibrium physics.  In the remainder of this section we discuss two such extensions: the Kibble--Zurek mechanism (KZM), and the theory of non-thermal fixed points.\n\n\n\n\\subsection{The Kibble--Zurek mechanism}\n\\label{sec:Davis:KibbleZurek}\n\nThe theory of the Kibble--Zurek mechanism leverages the well-established results of the equilibrium theory of criticality to make immediate predictions for universal scaling behaviour in the nonequilibrium dynamics of passage through a second-order phase transition.\nThe underlying idea --- that causally disconnected regions of space break symmetry independently, leading to the formation of topological defects --- was first discussed by Kibble~\\cite{kibble_76}, who predicted that the distribution of defects following the transition would be determined by the instantaneous correlation length of the system as it passes through the Ginzburg temperature~\\cite{landau_lifshitz_book_80}.  Zurek later emphasised~\\cite{zurek_85} the importance of dynamic critical phenomena~\\cite{Hohenberg1977a} in such a scenario. \nIn particular, the scaling relations~\\eqref{davis_crit_exponents} imply that both the correlation length and the characteristic relaxation time of the system diverge as the critical point is approached ($\\epsilon \\rightarrow 0$), imposing a limit to the size of spatial regions over which order can be established during the transition.  Topological defects will thus be seeded, with a density determined by the correlation length at the time the system ``freezes'' during the transition, and will subsequently decay in the symmetry-broken phase.  The more rapidly the system passes through the critical point, the shorter the correlation length that is frozen in, and therefore more topological defects will form.  \nA dimensional analysis predicts that a linear ramp \n$\\epsilon(t) = -t/\\tau_\\mathrm{Q}$ of the reduced temperature through the critical point on a characteristic time scale \n$\\tau_\\mathrm{Q}$ results in a distribution of spontaneously formed defects with a density\n$n_d$\nthat scales as~\\cite{zurek_96}\n\n", "index": 3, "text": "\\begin{equation}\nn_d\n\\propto \n\\tau_\\mathrm{Q}^{(p-d)\\nu/(1 + \\nu z)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"n_{d}\\propto\\tau_{\\mathrm{Q}}^{(p-d)\\nu/(1+\\nu z)},\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mi>d</mi></msub><mo>∝</mo><msubsup><mi>τ</mi><mi mathvariant=\"normal\">Q</mi><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>p</mi><mo>-</mo><mi>d</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>ν</mi></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>ν</mi><mo>⁢</mo><mi>z</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup></mrow><mo>,</mo></mrow></math>", "type": "latex"}]