[{"file": "1601.03687.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 58411, "prevtext": "\n\n\n\n\n\n\\title{An HST Proper-Motion Study of the Large-scale Jet of 3C273}\n\n\n\n\n\n\n\n\n\\author{Eileen T. Meyer\\altaffilmark{1} and William B. Sparks}\n\\affil{Space Telescope Science Institute, Baltimore, MD 21218}\n\\email{meyer@stsci.edu}\n\n\\author{Markos Georganopoulos\\altaffilmark{2}}\n\\affil{University of Maryland Baltimore County, Baltimore, MD 21250}\n\n\\author{Jay Anderson, Roeland van der Marel and John Biretta}\n\\affil{Space Telescope Science Institute, Baltimore, MD 21210}\n\n\\author{Tony Sohn}\n\\affil{Johns Hopkins University, Baltimore, MD 21210}\n\n\\author{Marco Chiaberge}\n\\affil{Space Telescope Science Institute, Baltimore, MD 21210}\n\n\n\\author{Eric Perlman}\n\\affil{Florida Institute of Technology, Melbourne, FL 32901}\n\n\\author{Colin Norman\\altaffilmark{3}}\n\\affil{Johns Hopkins University, Baltimore, MD 21210}\n\n\n\\altaffiltext{1}{University of Maryland Baltimore County, Baltimore, MD 21250}\n\\altaffiltext{2}{NASA Goddard Space Flight Center, Greenbelt, MD}\n\\altaffiltext{3}{Space Telescope Science Institute, Baltimore, MD 21210}\n\n\n\n\\begin{abstract}\nThe radio galaxy 3C 273 hosts one of the nearest and best-studied\npowerful quasar jets. Having been imaged repeatedly by the Hubble\nSpace Telescope (HST) over the past twenty years, it was chosen for an\nHST program to measure proper motions in the kiloparsec-scale resolved\njets of nearby radio-loud active galaxies. The jet in 3C 273 is highly\nrelativistic on sub-parsec scales, with apparent proper motions up to\n15$c$ observed by VLBI \\citep{lister2013}. In contrast, we\n  find that the kpc-scale knots are compatible with being stationary,\n  with a mean speed of $-$0.2$\\pm$0.5$c$ over the whole jet. Assuming\n  the knots are packets of moving plasma, an upper limit of $1c$\n  implies a bulk Lorentz factor $\\Gamma<$2.9. This suggests that the\n  jet has either decelerated significantly by the time it reaches the\n  kpc scale, or that the knots in the jet are standing shock\n  features. The second scenario is incompatible with the inverse\n  Compton off the Cosmic Microwave Background (IC/CMB) model for the\n  X-ray emission of these knots, which requires the knots to be in\n  motion, but IC/CMB is also disfavored in the first scenario due to\n  energetic considerations, in agreement with the recent finding of\n  \\cite{mey14} which ruled out the IC/CMB model for the X-ray emission\n  of 3C 273 via gamma-ray upper limits.\n\\end{abstract}\n\n\\section{Introduction}\n\nAbout 10\\% of active galactic nuclei (AGN) produce bipolar jets of\nrelativistic plasma which can reach scales of tens to hundreds of\nkiloparsecs in extent. While there is growing evidence that AGN\nfeedback, including jet production, may have an important impact on\ngalaxy and cluster evolution \\citep[e.g.][]{fabian2012}, uncertainties about the\nphysical characteristics of these jets has encumbered attempts to make\nthese impacts understood quantitatively. Among the chief open\nquestions are the identity of the radiating particles (positrons,\nelectrons, or hadronic species), the lifetimes and duty cycles of the\njets, and the magnetic field strength and speed of the plasma. All of\nthese characteristics feed into the calculation of how much energy\nand momentum are carried by these jets and ultimately deposited\ninto the galaxy and/or cluster-scale environment.  \n\nIn theory, proper-motion studies allow us to put direct constraints on the speed\nof AGN jets, and consequently their Lorentz factors\n($\\Gamma$). Hundreds of observations of jets with very long baseline\ninterferometry (VLBI) in the radio have detected proper motions of\njets on parsec and sub-parsec scales, relatively near to the black\nhole engine\n\\citep[e.g.][]{kellermann1999,giovannini2001,jorstad2001,piner2004,kellermann2004,jorstad2005,lister2009,piner2010}. These\nobservations show that these jets are often highly relativistic, such\nthat velocities near the speed of light coupled with relatively small\nviewing angles result in apparent superluminal motion. The\ndimensionless observed apparent velocity $\\beta_\\mathrm{app}$ is\nrelated to the real velocity $\\beta=v/c$ (where $c$ is the speed of\nlight) and viewing angle $\\theta$ through the well-known Doppler\nformula $\\beta_\\mathrm{app}=\\beta \\sin \\theta/(1 - \\beta \\cos\n\\theta)$. A measurement of $\\beta_\\mathrm{app}$ implies both a lower\nlimit on the Lorentz factor\n($\\Gamma_\\mathrm{min}\\approx\\beta_\\mathrm{app}$) and an upper limit on\nthe viewing angle -- constraints which are very difficult to derive\nusing other means such as spectral fitting, due to the inherent\ndegeneracy between intrinsic power, angle, and speed introduced by\nDoppler boosting of the observed flux.\n\nWhile proper motions of jets on parsec scales exist in large samples,\ndirect observations of jet motions on much larger scales (kpc-Mpc) are\nrare. Such observations naturally rely on sub-arcsecond resolution\ntelescopes like the Very Large Array (VLA), Atacama Large\nMillimeter/submillimeter Array (ALMA), or Hubble Space Telescope (HST)\nin order to image the full jet in detail, but this (much lower than\nVLBI) resolution necessarily also limits potential observations of\napparent motions to sources in the very local Universe, and require\nyears or even decades of repeated observations. Superluminal motions\non kpc scales also might not be common, as the jet presumably\ndecelerates as it extends out from the host galaxy, though it must be\nat least mildly relativistic to explain jet one-sidedness. Statistical\nstudies of jet-to-counterjet ratios in the radio generally suggest\nthat kpc-scale quasar jets are only mildly relativistic \\citep[$\\Gamma\\sim\nfew,$][]{arshakian2004,mullin2009}.\n\nA common problem for both VLBI-scale and kpc-scale\n  proper-motion studies is the interpretation of slow-moving or\n  stationary features in jets.  While observed motions imply a\n  corresponding minimum bulk speed, fast bulk speeds could also be\n  present in jets that do not produce convenient ballistic features\n  which can be easily tracked, and stationary or slow-moving features\n  may instead correspond to stationary shocks within the flow. An\n  obvious example is the famous knot HST-1 in the jet of M87, which is\n  thought to be a standing recollimation shock, through which plasma\n  is moving with a moderately relativistic bulk speed\n  \\citep{biretta1999,stawarz2006,cheung2007}. A similar feature has\n  been seen in the radio in 3C 120 \\citep{agudo2012}. On VLBI scales,\n  stationary features can also appear in jets along with moving\n  components. Some two-thirds of the objects in the VLBI proper motions study of\n  BL Lacs by \\cite{jorstad2001} contained stationary features, a\n  common finding in VLBI studies generally\n  \\cite[e.g.,][]{alberdi2000,lister2009}.\n\n\n\n\n\n\n\n\n\nFor many years, there were only two measured proper motions of jets on\nkpc scales, both taken with the VLA. These were the famous result of\n$\\beta_\\mathrm{app}$ up to $6c$ measured by \\cite{biretta1995} for the\njet in M87 (z=0.004, d=22 Mpc), and a speed of $\\approx 4c$ for a knot\nin the jet in 3C 120 (z=0.033, d=130 Mpc) by \\cite{walker1988}, though\nthis was later contradicted by additional VLA and Merlin observations\n\\citep{muxlow1991,walker1997}. In 1999, the first measurement of\nproper motions in the optical was accomplished by \\cite{biretta1999},\nusing four years of HST Faint Object Camera (FOC) imaging to confirm\nthe fast superluminal speeds in the inner jet of M87. However, until\nrecently \\citep{meyer2013_m87} it was unclear if M87 would prove to be the\nonly superluminal jet on kpc scales.\n\nWith the continued development of high-precision astrometry techniques\nto align HST\nimages\\footnote{http://www.stsci.edu/$\\sim$marel/hstpromo.html}, it is now\npossible to register images of jets repeatedly observed by HST over\nthe past 20 or more years for proper motions studies.  With a single\nmoderately deep HST image, it is possible to build a reference frame using\nbackground or stationary sources on which to register previous\narchival imaging to high precision. In many cases, the longest\nbaselines are supplied by the early WFPC2 snapshot programs which\ntargeted bright radio galaxies from 1994 through 1998 (e.g., HST\nprograms 5476, 5980, 6363). The first successful application of\nhigh-precision HST astrometric methods to jet proper motions was done\nfor the jet in M87, where we were successful in matching over 400 raw\nimages of the jet taken from 1995 through 2008 using globular clusters\nin the host galaxy \\citep[][]{meyer2013_m87}. The \\cite{meyer2013_m87}\nstudy greatly improved on previous efforts both in lengthening the\ntime baseline and in reaching errors on the speed measurements as low\nas 0.1$c$, allowing us to measure both transverse motions and\ndecelerations for the first time.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=3.4in]{figure1_orientation.eps}\n\\caption{\n\\label{fig:referencesys} {\\sl Upper Panel:} The immediate environment of 3C~273 as seen in the ACS/WFC\n  reference image from 2014. The intensity has been scaled to\n  emphasize the background sources, so the jet appears overexposed\n  (center).  The host galaxy/jet core is the extremely bright source\n  at right.  The thirteen galaxies used in the registration of the\n  1995 epoch are shown, boxed. The larger box outline is roughly the\n  field of view for the PC chip in 1995. {\\sl Lower Panel:} View of\n  the 3C 273 optical jet after galaxy light subtraction.  Knots are\n  labeled according to standard convention, as well as several\n  nearby background galaxies.}\n\\end{center}\n\\end{figure}\n\nIn the \\cite{meyer2013_m87} study of M87, we reached a limiting astrometric precision in\nmeasuring the positions of knots in the jet of a few mas or less.  Over a\ntwenty year baseline, this translates into a distance limit of\n$\\approx$600 Mpc\\footnote{Angular-size distances are used throughout\n  this paper, with $H_0$=69.6, $\\Omega_M$=0.286, $\\Omega_\\Lambda$=0.714.},\nfor a target accuracy of 1$c$ in the measurement of superluminal\nmotion. The handful of optical jets within this local volume which\nwere first observed in the 1990s are thus ripe targets for HST proper\nmotions studies. Based on the success of the \\cite{meyer2013_m87} study, we\nwere awarded ACS/WFC observations in cycle 21 for 3 additional nearby\njets previously imaged by HST, including 3C 273, the results of which\nare presented here. The results for accompanying target 3C 264, a jet\nsimilar to M87 but 5 times more distant, were published in\n\\cite{mey15_nature}, while those for 3C~346 will be published\nseparately. \n\nAt a redshift of 0.158 (d = 567 Mpc), 3C 273 is the furthest kpc-scale\nproper-motions target yet attempted with \\emph{HST}. The large-scale jet extends\nnearly 23$''$ from the core (see Figure~\\ref{fig:referencesys}) and\nhas been observed extensively from radio to X-rays over the past few\ndecades\n\\citep[e.g.,][]{schmidt1978,conway1981,tyson1982,lelievre1984,harris1987,thomson1993,bahcall1995,jester2001,marshall2001,sambruna2001,jester2005,jester2006,uchiyama2006,jester2007}. The\nX-ray jet of 3C~273 is one of a group of ``anomalous'' X-ray jets\ndiscovered by \\emph{Chandra}, where the X-ray emission is too hard and\nat too high a level to be consistent with the known radio-optical\nsynchrotron spectrum \\citep{jester2006}. The generally favored model\nup until very recently was that these X-rays were produced by inverse\nCompton upscattering of CMB photons by a jet still highly relativistic\non kpc scales, to match high speeds implied by parsec-scale VLBI\nproper motions \\citep{tavecchio2000,celotti2001}. As we discuss in\nthis paper, this model implies that the knots in jets like 3C 273\nshould move with significant proper motions. However, the IC/CMB model\nwas recently ruled out based on gamma-ray upper limits \\citep{mey14},\na method first described in \\cite{geo06}, and the strong upper limits\nplaced by our proper motion observations as described in this paper also strongly\ndisfavor an IC/CMB origin for the X-rays in 3C~273.\n\n\n\\begin{table}[!t]\n\\caption{HST Imaging Data} \\centering\n\\label{tabledata}\n\\begin{tabular}{lllcccc}\n\\toprule\nEpoch & PID            & Instrument & Date              & Filter & Exp.           & No.\\\\\n      &                &            & {\\tiny (mm/year)} &        & {\\tiny (s)}    &    \\\\\n\\midrule\n1995 & 5980\\phantom{7} & WFPC2/PC   & 06/1995           & F622W  & 2300           & 1 \\\\\n     &                 &            &                   &        & 2500           & 1 \\\\\n     &                 &            &                   &        & 2600           & 2\n\n \\\\\n2003 & 9069\\phantom{7} & WFPC2/PC   & 04/2003           & F622W  & 1100           & 2 \\\\\n     &                 &            &                   &        & 1300           & 6 \\\\\n2014 & 13327           & ACS/WFC    & 05/2014           & F606W  & \\phantom{0}550 & 4 \\\\\n     &                 &            &                   &        & \\phantom{0}598 & 12 \\\\\n\n\\bottomrule\n\\end{tabular}\n\\vspace{20pt}\n\\end{table}\n\nThe paper is organized as follows: in Section~\\ref{sec:methods} we\npresent our methods including use of background galaxies to register\nthe images; in Section~\\ref{sec:results} we present the resulting\nproper-motion limits, and in Section~\\ref{sec:discussion} we discuss\nthe implications that slow speeds have for our understanding of the\nphysical conditions in the outer 3C~273 jet.  In Section~\\ref{sec:conclusion} we\nsummarize our conclusions.\n\n\n\\section{methods}\n\\label{sec:methods}\nThe data used for this project is summarized in Table~\\ref{tabledata},\nwhere we list the project number, instrument setup, date of\nobservation, and exposure time(s) for the individual exposures,\norganized into epochs. Only the 1995 imaging has been previously\nreported in \\cite{jester2001}. We limited the study to observations in\n`V-band' F606W or F622W filters (noting that the wavelength range of\nthe latter is entirely within the range of the former) for\nconsistency.\n\n\\begin{figure*}[!t]\n\\begin{center}\n\\vspace{10pt}\n\\includegraphics[width=5in]{sampling.eps}\n\\caption{\\label{fig:sampling} At left, galaxy No. 2 from\n  Figure~\\ref{fig:referencesys} as seen in the ACS reference image.\n  The black points are a portion of the `sampling grid' described in\n  the text, which sample the flux distribution of the galaxy. At\n  right, the same galaxy in a single exposure (jca201l2q) from the\n  1995 WFPC2/PC set. The reference grid has been transformed based on\n  an initial solution into the coordinates of the raw exposure, as\n  shown. A flux-level cut was applied to only select the grid\n  points falling on the brightest parts of the image, so that the\n  positions can be compared more easily.  Note that the black areas in\n  the right image are locations of cosmic ray artifacts, where flux is\n  set to equal zero to make the image more clear.}\n\\end{center}\n\\end{figure*}\n\n\nBefore analyzing the archival WFPC2 data, each raw image was\nseparately corrected for CTE losses.  These losses are increasingly\nsignificant in WFPC2 data with time; we found that without making such\na correction the fluxes measured in the jet and background galaxies were underestimated by\n$\\approx$5 and $\\approx15$\\% in the 1995 and 2003 stacks, compared\nwith the ACS deep stack.  The correction was done pixel-by-pixel since\nthe jet is resolved and losses depend on the x and y location on the\ndetector; the method of calculating the correction maps is described\nin Appendix~\\ref{appendixA}. Note that the CTE correction was not\nfound to have any effect on image registration or measurement of proper\nmotions.\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Reference Image}\nThe four orbits of ACS/WFC imaging obtained in May of 2014 were\nstacked into a mean reference image (with cosmic-ray rejection) on a\nsuper-sampled scale with 0.025$''$ pixels. The registration of the 8\nindividual exposures utilized a full 6-parameter linear transformation\nbased on the distortion-corrected positions of 15-20 point-like\nsources. The median one-dimensional rms residual relative to the mean\nposition was 0.07 reference-frame pixels, or 1.75 mas, corresponding\nto a systematic error on the registration ($\\times 1/\\sqrt 16$) of\n0.44 mas, or about 2 hundredths of a pixel.\n\n\n\n\n\n\n\n\n\n\n\n\nThe final science image was scaled to monochromatic flux at 6000\n\\AA$\\,$, where the PHOTFLAM value was recalculated in IRAF/STSDAS\npackage {\\tt calcphot} with a power-law model, $\\nu^{-1}$, in keeping\nwith the spectral index reported in \\cite{jester2001}. We\nalso included a reddening/extinction correction with E(B-V)=0.018 for\nthe position of 3C 273 as derived from the publicly available online\nDUST tool\\footnote{http://irsa.ipac.caltech.edu/applications/DUST}.\n\n\n\\subsection{Background Source Registration}\nTo create the 1995 and 2003 epoch science images, an astrometric\nsolution was found between each individual\n(geometrically-corrected) exposure and the reference frame based on\nthe 2014 ACS image.  Typically, this is accomplished by identifying\nbackground point sources in the deep reference image which constitute\nthe reference frame of sources used to register the prior epochs.\nWhile some globular clusters associated with the 3C 273 host galaxy\ncan be seen in the deep ACS image, these are not detected in the much\nnoisier PC imaging. Instead, we identified 18 background galaxies\nbased on the criteria that they can be seen by eye above the noise in\nthe individual PC exposures.  These reference galaxies are highlighted\nin Figure~\\ref{fig:referencesys}. Note that galaxies 4, 5, and 6\nhave been previously identified as unrelated to the jet by their lack\nof radio emission, and the bright point source near the jet is\nactually a foreground star (and thus unsuitable for registering\nimages due to likely proper motions).\n\n\nTo match the archival images to a common reference frame, our general\nstrategy was to use the shape and light distribution of the galaxy to\nassist in matching their locations in each image. Instead of\nidentifying a single location associated with each galaxy in the deep\nreference image, we instead sample the galaxy in a grid pattern,\nresulting in a list of positions along with the flux at each point,\nsampling across each galaxy. For example, we show at left in\nFigure~\\ref{fig:sampling} one of the background galaxies from the\ndeep 2014 image. Grid points are placed at pixel centers, where we\nshow only those where the pixel value is $>$10 times the background\nfor illustration.  At right, we have used an initial transformation\nsolution to map the points to locations on the galaxy in a single raw\nframe.  The flux at each point is interpolated based on nearby pixels.\n\n \nWe used the geometric correction solutions to first create\ngeometrically-corrected (GC) images from the individual exposures.  An\ninitial (astrometric) transformation solution was found by supplying\n$\\approx$10 pairs of matched locations found by hand between the GC\nimage and the ACS reference image and calculating the six\ntransformation parameters (without match evaluation/rejection). This\ninitial transformation solution was then used to create a `rough' mean\nimage stack for each epoch (in counts units). This stacked image was\nthen `reverse-transformed' to create a reference image on the scale of\neach individual (distorted) raw exposure, in order to detect cosmic rays. These\nwere detected by initially looking for pixels at a high (10$\\sigma$)\ndeviation from the reference image value, and then masking all\nadjacent pixels until all surrounding pixels are near to the mean\nvalue for that pixel. A mask for all pixels flagged as cosmic rays (as\nwell as for a bad row at x=339 in the 1995 exposures) was thus created\nfor each raw exposure.\n\n\\subsection{Optimizing the Transformation}\nThe initial transformation solution described above is used as a\nstarting point to transform the x,y locations for each galaxy grid in\nthe reference frame into $x_{gc},y_{gc}$ location in the geometrically\ncorrected image as shown in and discussed previously for\nFigure~\\ref{fig:sampling}. The intensity can then be sampled at each\nlocation in the GC image, to be compared directly to the scaled counts\nvalue predicted by the scaled reference pixel value.  For each galaxy\nin each individual (GC) exposure, we shift the $x_{gc},y_{gc}$ over a\ngrid of $\\delta$x, $\\delta$y values, in steps of 1/10th of a pixel for\na total testing range of $\\pm$2 pixels. At each point in the grid, a\n`score' equal to the sum of squared differences is calculated for the\nsampling grid (dropping points falling on cosmic ray artifacts) based\non the updated $x_{gc},y_{gc}$ positions in the GC image. \n\n\n\n\n\n\n\n\n\nWe then fit the score matrix with a 2-dimensional Gaussian using IDL\nroutine 2DGAUSSFIT in order to find the value of $\\delta$x, $\\delta$y\ncorresponding to a globally consistent minimum which corresponds to\nthe optimal position shift which is used to update the location of the\ngalaxy in the reference frame.\n\nFor each individual exposure, we then compile an updated list of\nposition matches between the reference frame and the GC image from the\nmean x,y value of the galaxy sampling grid in each. In general, we used a subset\nof the background galaxies which were identifiable by eye and not\noverly affected by cosmic ray hits. The process of finding the initial\n$x_{gc}, y_{gc}$ values, followed by finding the optimal\n$\\delta$x,$\\delta$y improvement on the mean position, was iterated\nuntil the positions of galaxies stopped improving.\n\n\\begin{figure*}[t]\n\\begin{center}\n\\includegraphics[width=5.25in]{Figure4_3c273_3epochs.eps}\n\\caption{\\label{fig:3jet} The jet of 3C 273 as seen in 1995, 2003, and\n  2014.  The first two images were taken with the WFPC2/PC, the most\n  recent with the ACS/WFC.  All have been scaled to monochromatic flux\n  at 6000 Angstroms (white = 0.01 $\\mu Jy$) after CTE correction, and\n  background and host galaxy light subtraction. As shown, no changes\n  in the jet are readily apparent by eye.  The bright foreground star\n  below knots D and C3 does appear to move with a speed of about 2\n  mas/year. Note that we follow the knot labeling of \\citep{marshall2001}.}\n\\end{center}\n\\end{figure*}\n\nThe final science image stacks at each epoch have been scaled to\nmonochromatic flux at 6000 $\\AA$, with background and host galaxy\nlight subtracted, and are shown in Figure~\\ref{fig:3jet}. Note that we\nuse the knot labeling originally defined in \\cite{marshall2001} and\nnot the later, different labeling used in \\cite{uchiyama2006} and\n\\cite{jester2007}.\n\n\\subsection{Measuring Speeds}\n\nWe employed two methods to measure the positions of the 10 individual\nknots, as well as the 4 background galaxies and foreground star\nidentified in Figure~\\ref{fig:referencesys}, in each of the three\nepochs. First, similar to the methods employed in the studies of M87\nand 3C~264 \\citep{meyer2013_m87,mey15_nature}, we used a centroid\nposition (flux-weighted mean $x$ and $y$ location) inside a contour\nsurrounding the brightest part of the knot (hereafter referred to as\nthe `contour method').  For the brighter knots (A1, B1, D and H3), we\nused the 50\\% peak flux-over background contour as measured using a\ncosine-transform representation of the image. For the fainter knots\nwhere the flux is only slightly higher than the local background\n(making it difficult to form a closed contour), we simply used a fixed\ncircular aperture, centered on the brightest part of the knot (radius\nof the aperture depends on the size of the feature and is given in\nTable~\\ref{table:results}).\n\n\n\nAs a consistency check, we also measured the shift of each knot using\na second method which we refer to as the `cross-correlation'\nmethod. Over a grid with sub-pixel spacing of 0.2 super-sampled pixels\n(5 mas), we shifted the 1995 and 2003 images of each individual knot\nrelative to the 2014 image (same cutout area) over a 6x6 pixel area,\nevaluating the sum of the squared differences between interpolated\nflux over the knot area for each x/y shift combination. The resulting\nsum-of-squared differences image in all cases clearly shows a smooth\n`depression' feature which is reasonably well-fit by a two-dimensional\nGaussian under the transformation $g = 1 - f/\\mathrm{max}(f)$, where\n$f$ is the original sum of squared differences. Taking the minimum $f$\nlocation as measured by the peak of the two-dimensional Gaussian fit,\nwe measure the optimal shift for each knot.\n\n\nTo measure the approximate error on the positions measured, we\nrepeated both of the above methods for simulated images of the jet at\neach epoch. The simulated images were created by taking the deep 2014\nACS image and adding a Gaussian noise component appropriately scaled\nfrom the counts in the original WFPC2 exposures. Since the 2014 image\nitself has some noise, and also a slightly different PSF from the\nWFPC2 images, this method likely slightly overestimates the errors. We\ntake the error on each knot measurement to be the standard deviation\nof the measurements in the simulated images (10 in each epoch).\n\n\n\n\nFinally, we plotted the position of each feature relative to the 2014\nposition, versus time, to look for evidence of proper motions. We have\ntransformed from the coordinate frame of the aligned images (North up)\nto one based on the jet, where positive $x$ is in the outflow\ndirection along the jet (taken as position angle (PA) 42$^\\circ$ south of\neast) and positive $y$ is orthogonal and to the north of the jet. The\ndata are listed in table \\ref{table:results} and plotted in\nFigures~\\ref{fig:speeds1} and \\ref{fig:speeds2}. For both methods, the estimated\nerror on the measurement has been convolved with the systematic error\nof the registration, which is 0.18, 0.22, and 0.02 reference pixels\n(4.5, 2.8, and 0.5 mas) for the 1995, 2003, and 2014 epochs,\nrespectively.\n\n\n\n\n\n\n\n\n\n\n\\section{Results}\n\\label{sec:results}\n\nWe first show in Figure~\\ref{fig:3jet} a comparison of the jet of 3C\n273 in each epoch, where the background and host galaxy light has been\nsubtracted, and the jet rotated to horizontal. No obvious changes in\nthe jet are discernible by eye, and the fluxes of all components (as\nwell as background sources) are consistent to within 5\\%. The only\nmoving component, easily seen when blinking the 1995 and 2014 images\nagainst one another, is the foreground star near knot C3, which\nexhibits an apparent motion of 1.9 mas/year, at an angle of\n20$^\\circ$ north of the the jet direction (where the jet PA is\n222$^\\circ$). The proper motion is typical for disk stars in our own\ngalaxy \\citep[e.g.,][]{deason2013}, and the star has a V-band\nmagnitude of 25.6 (STMAG system) and color $m_{F606W}-m_{F814W}$ =\n2.9, consistent with the source being a milky way foreground star.\n\n\n\n\\begin{figure*}[t]\n\\centering\n\\includegraphics[width=6in]{multiplot_crosscor_pt1.pdf}\n\\caption{\\label{fig:speeds1} Shift of individual knots (name noted at\n  upper right of each panel) versus time relative to the 2014 measured\n  position.  Black points represent the contour-derived shifts and\n  orange points the cross-correlation derived shifts. As a guide,\n  lines corresponding to an apparent forward speed of 2$c$ (dotted\n  gray) and 5$c$ (dashed gray) and 10$c$ (solid gray) are plotted in\n  each subfigure. The thick solid blue line is the best-fit weighted\n  linear regression model to all points, while the thinner blue lines\n  show the 2$\\sigma$ (95\\%) upper and lower limit slopes. }\n\\end{figure*}\n\nIn Figures~\\ref{fig:speeds1}~and~\\ref{fig:speeds2}, we have plotted\nthe shift of each knot relative to 2014 versus time, where black\npoints represent the contour-derived shifts and orange points the\ncross-correlation derived shifts. As a guide, lines corresponding to\nan apparent forward speed of 2$c$ (dotted gray) and 5$c$ (dashed gray)\nand 10$c$ (solid gray) are plotted in each subfigure. The thick solid\nblue line is the best-fit weighted linear regression model to all\npoints, while the thinner blue lines show the 2$\\sigma$ (95\\%) upper\nand lower limit slopes.  While the two methods of measuring shifts\nagree well for most knots, the deviation of the cross-correlation\nmethod from the contour method increases with decreasing surface\nbrightness.  We have thus excluded the cross-correlation derived\npoints from the linear fitting for the two knots of particularly low\nsurface brightness, A2 and B2, though these points are still plotted\nin orange in Figure~\\ref{fig:speeds1}.\n\n\\begin{figure*}\n\\centering\n\n\\includegraphics[width=6in]{multiplot_crosscor_pt2.pdf}\n\\caption{\\label{fig:speeds2} Shift of individual knots (name noted at\n  upper right of each panel) versus time relative to the 2014 measured\n  position.  Black points represent the contour-derived shifts and\n  orange points the cross-correlation derived shifts. As a guide,\n  lines corresponding to an apparent forward speed of 2$c$ (dotted\n  gray) and 5$c$ (dashed gray) and 10$c$ (solid gray) are plotted in\n  each subfigure. The thick solid blue line is the best-fit weighted\n  linear regression model to all points, while the thinner blue lines\n  show the 2$\\sigma$ (95\\%) upper and lower limit slopes.}\n\\end{figure*}\n\nIn Table~\\ref{tab:speeds} we report the results of the weighted linear\nregression fit to the position measurements for the 10 identified\nknots in Figure~\\ref{fig:referencesys}, as well as four nearby\nbackground galaxies and the foreground star near knot C3. In column 1\nwe give the knot or object name, in column 2 the measured flux of the\nknot in $\\mu$Jy, in column 3 the aperture used to measure the surface\nbrightness given in column 4 in $\\mu$Jy/arcsec$^2$. In columns 5 and 6\nwe give the measured angular speed in mas yr$^{-1}$ in the $x$ (along\nthe jet) and $y$ (perpendicular to jet) directions, and in columns 7 and\n8 the corresponding apparent speeds $\\beta_{app,X}$, $\\beta_{app,Y}$\nin units of $c$, using the conversion factor 8.9856 $c$/(mas\nyr$^{-1}$). While these latter values are incorrect/unphysical for the\nfour galaxies and foreground star (as they are at different/unknown\ndistances), we include the conversion to $\\beta_{app}$ in\nTable~\\ref{table:speeds} as a convenient reference for the accuracy of\nour measurements, since these sources should be completely\nstationary. In column 9 we give the probability that the speed of the\nknot is greater than zero, and in the final column the 99\\% upper limit\non $\\beta_{app,X}$.\n\nAs shown, all knots have speeds consistent with zero within the errors\nof our measurements.  The mean speed along the jet, combining\n  all knot values in column 7, is $-0.2\\pm0.5c$ As an additional\ncheck, we ran a cross-correlation analysis as described above for\nindividual knots for the entire optical jet region.  The best-fit\nweighted linear regression line yielded a slope of $-$0.006$\\pm$0.22\nmas yr$^{-1}$ and 0.12$\\pm$0.22 mas yr$^{-1}$ along and perpendicular\nto the jet, and corresponding to apparent speeds of $-$0.04$\\pm$1.9$c$\nand 1.1$\\pm$1.9$c$, respectively, also consistent with a speed of zero\nin both directions.\n\n  \n  \n  \n  \n  \n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure*}\n\\centering\n\n\\includegraphics[width=6in]{multiplot_crosscor_galaxies.pdf}\n\\caption{\\label{fig:speedsgals} Shift of 4 nearby galaxies to the jet\n  (name noted at upper right of each panel) versus time relative to\n  the 2014 measured position.  Black points represent the\n  contour-derived shifts and orange points the cross-correlation\n  derived shifts. As a guide, lines corresponding to an apparent\n  forward speed of 2$c$ (dotted gray) and 5$c$ (dashed gray) and 10$c$\n  (solid gray) are plotted in each subfigure. The thick solid blue\n  line is the best-fit weighted linear regression model to all points,\n  while the thinner blue lines show the 2$\\sigma$ (95\\%) upper and\n  lower limit slopes.}\n\\end{figure*}\n\n\\begin{deluxetable*}{l|ccccc|cccc}\n\n\\tablewidth{0pt}\n\\tablecaption{\\label{table:results} Positions Relative to 2014 (Parallel and Transverse to Jet Axis)\\tablenotemark{a}}\n\\tablehead{\n& \n\\multicolumn{5}{c}{\\underline{$\\,\\,\\,$Contour Method$\\,\\,\\,$}} & \n\\multicolumn{4}{c}{\\underline{$\\,\\,\\,$Cross-Correlation Method$\\,\\,\\,$}}\\\\\nName &\nR$_{ap}$ & $\\delta x_\\mathrm{1995}$ & $\\delta y_\\mathrm{1995}$ & $\\delta x_\\mathrm{2003}$ & $\\delta y_\\mathrm{2003}$ &\n$\\delta x_\\mathrm{1995}$ & $\\delta y_\\mathrm{1995}$ & $\\delta x_\\mathrm{2003}$ & $\\delta y_\\mathrm{2003}$ \\\\\n(1) & (2) & (3) & (4) & (5) & (6) & (7) & (8) & (9) & (10) \n}\n\\startdata\nA1  &  &\\phantom{$-$}0.16$\\pm$ 0.19  &$-$0.07$\\pm$ 0.19  &$-$0.04$\\pm$ 0.23  &$-$0.18$\\pm$ 0.22  &\\phantom{$-$}0.21$\\pm$ 0.18  &$-$0.04$\\pm$ 0.18  &$-$0.03$\\pm$ 0.22  &\\phantom{$-$}0.04$\\pm$ 0.22  \\\\\nA2  &10  &\\phantom{$-$}0.07$\\pm$ 0.18  &\\phantom{$-$}0.07$\\pm$ 0.18  &$-$0.02$\\pm$ 0.22  &\\phantom{$-$}0.03$\\pm$ 0.22  &\\phantom{$-$}0.41$\\pm$ 0.18  &\\phantom{$-$}0.26$\\pm$ 0.18  &\\phantom{$-$}0.04$\\pm$ 0.22  &\\phantom{$-$}0.08$\\pm$ 0.22  \\\\\nB1  &  &\\phantom{$-$}0.27$\\pm$ 0.20  &$-$0.20$\\pm$ 0.20  &$-$0.18$\\pm$ 0.23  &$-$0.07$\\pm$ 0.23  &\\phantom{$-$}0.31$\\pm$ 0.18  &$-$0.11$\\pm$ 0.18  &$-$0.22$\\pm$ 0.22  &$-$0.09$\\pm$ 0.22  \\\\\nB2  &6.2  &\\phantom{$-$}0.04$\\pm$ 0.18  &\\phantom{$-$}0.04$\\pm$ 0.18  &$-$0.08$\\pm$ 0.22  &\\phantom{$-$}0.05$\\pm$ 0.22  &\\phantom{$-$}0.18$\\pm$ 0.18  &\\phantom{$-$}0.10$\\pm$ 0.18  &$-$0.48$\\pm$ 0.22  &\\phantom{$-$}0.37$\\pm$ 0.22  \\\\\nC1  &8.2  &\\phantom{$-$}0.04$\\pm$ 0.18  &\\phantom{$-$}0.00$\\pm$ 0.18  &$-$0.08$\\pm$ 0.22  &$-$0.00$\\pm$ 0.22  &$-$0.01$\\pm$ 0.18  &\\phantom{$-$}0.02$\\pm$ 0.18  &$-$0.49$\\pm$ 0.22  &\\phantom{$-$}0.04$\\pm$ 0.22  \\\\\nC2  &7  &\\phantom{$-$}0.01$\\pm$ 0.18  &$-$0.00$\\pm$ 0.18  &$-$0.02$\\pm$ 0.22  &$-$0.01$\\pm$ 0.22  &\\phantom{$-$}0.20$\\pm$ 0.18  &$-$0.07$\\pm$ 0.18  &$-$0.25$\\pm$ 0.22  &\\phantom{$-$}0.03$\\pm$ 0.22  \\\\\nC3  &7  &$-$0.06$\\pm$ 0.18  &\\phantom{$-$}0.00$\\pm$ 0.18  &$-$0.04$\\pm$ 0.22  &\\phantom{$-$}0.07$\\pm$ 0.22  &\\phantom{$-$}0.01$\\pm$ 0.18  &$-$0.08$\\pm$ 0.18  &$-$0.15$\\pm$ 0.22  &$-$0.03$\\pm$ 0.22  \\\\\nD  &  &$-$0.14$\\pm$ 0.19  &$-$0.23$\\pm$ 0.19  &\\phantom{$-$}0.15$\\pm$ 0.23  &$-$0.02$\\pm$ 0.23  &\\phantom{$-$}0.03$\\pm$ 0.18  &$-$0.18$\\pm$ 0.18  &\\phantom{$-$}0.02$\\pm$ 0.22  &$-$0.18$\\pm$ 0.22  \\\\\nH2  &5  &$-$0.01$\\pm$ 0.18  &$-$0.01$\\pm$ 0.18  &$-$0.04$\\pm$ 0.22  &$-$0.09$\\pm$ 0.22  &$-$0.08$\\pm$ 0.18  &$-$0.05$\\pm$ 0.18  &$-$0.05$\\pm$ 0.22  &$-$0.29$\\pm$ 0.22  \\\\\nH3  &  &$-$0.13$\\pm$ 0.19  &$-$0.01$\\pm$ 0.19  &\\phantom{$-$}0.17$\\pm$ 0.26  &$-$0.38$\\pm$ 0.26  &\\phantom{$-$}0.05$\\pm$ 0.18  &$-$0.13$\\pm$ 0.18  &$-$0.06$\\pm$ 0.22  &$-$0.00$\\pm$ 0.22  \n\\enddata\n\\tablenotetext{a}{Units of columns 2$-$10 are in reference frame pixels (25 mas)}\n\\end{deluxetable*}\n\n\n\n\n\\begin{deluxetable*}{lccccccccc}\n\\centering\n\\tablewidth{0pt}\n\\tablecaption{\\label{tab:speeds} Proper Motion Measurements for 3C 273 and Field Sources}\n\\tablehead{\n\\colhead{Name} & \n\\colhead{Flux} &\n\\colhead{Aperture} &\n\\colhead{SB} &\n\\colhead{$\\mu_{app,X}$} & \n\\colhead{$\\mu_{app,Y}$} & \n\\colhead{$\\beta_{app,X}$} &\n\\colhead{$\\beta_{app,Y}$} &\n\\colhead{P($\\beta_{app,X}$)$>0$} &\n\\colhead{99\\% UL $\\beta_{app,X}$ } \\\\\n & ($\\mu$Jy) & (pixels) & $\\mu$Jy/$''^2$ & (mas yr$^{-1}$) & (mas yr$^{-1}$) &   &   &   \n}\n\\startdata\nA1\t& 3.7\t& 51x20\t& 24.8\t&           $-$0.19$\\pm$0.16\t& \\phantom{$-$}0.09$\\pm$0.16\t&           $-$1.7$\\pm$1.4\t& \\phantom{$-$}0.8$\\pm$1.4\t& \\phantom{$>$}12\\%\t& 1.6 \\\\ \nA2\t& 1.2\t& 12.7\t&  6.7\t&           $-$0.07$\\pm$0.22\t&           $-$0.09$\\pm$0.22\t&           $-$0.6$\\pm$1.9\t&           $-$0.8$\\pm$1.9\t& \\phantom{$>$}38\\%\t& 3.8 \\\\ \nB1\t& 2.5\t& 14.6\t& 17.2\t&           $-$0.22$\\pm$0.16\t& \\phantom{$-$}0.19$\\pm$0.16\t&           $-$2.0$\\pm$1.4\t& \\phantom{$-$}1.7$\\pm$1.4\t& \\phantom{$>$} 8\\%\t& 1.3 \\\\ \nB2\t& 1.0\t& 9\t&  9.0\t&           $-$0.01$\\pm$0.22\t&           $-$0.06$\\pm$0.22\t&           $-$0.1$\\pm$1.9\t&           $-$0.6$\\pm$1.9\t& \\phantom{$>$}48\\%\t& 4.3 \\\\ \nC1\t& 3.0\t& 19.8\t& 10.7\t& \\phantom{$-$}0.10$\\pm$0.15\t&           $-$0.02$\\pm$0.15\t& \\phantom{$-$}0.9$\\pm$1.4\t&           $-$0.2$\\pm$1.4\t& \\phantom{$>$}75\\%\t& 4.2 \\\\ \nC2\t& 0.8\t& 7.3\t& 10.6\t&           $-$0.06$\\pm$0.15\t& \\phantom{$-$}0.03$\\pm$0.15\t&           $-$0.5$\\pm$1.4\t& \\phantom{$-$}0.3$\\pm$1.4\t& \\phantom{$>$}36\\%\t& 2.8 \\\\ \nC3\t& 1.6\t& 10.5\t& 10.6\t& \\phantom{$-$}0.07$\\pm$0.15\t& \\phantom{$-$}0.03$\\pm$0.15\t& \\phantom{$-$}0.6$\\pm$1.4\t& \\phantom{$-$}0.3$\\pm$1.4\t& \\phantom{$>$}67\\%\t& 3.9 \\\\ \nD\t& 1.9\t& 10.1\t& 17.6\t& \\phantom{$-$}0.02$\\pm$0.16\t& \\phantom{$-$}0.26$\\pm$0.16\t& \\phantom{$-$}0.2$\\pm$1.4\t& \\phantom{$-$}2.4$\\pm$1.4\t& \\phantom{$>$}55\\%\t& 3.5 \\\\ \nH3\t& 4.3\t& 22x44\t& 18.0\t& \\phantom{$-$}0.02$\\pm$0.16\t& \\phantom{$-$}0.14$\\pm$0.16\t& \\phantom{$-$}0.2$\\pm$1.4\t& \\phantom{$-$}1.3$\\pm$1.4\t& \\phantom{$>$}56\\%\t& 3.5 \\\\ \nH2\t& 0.5\t& 8.7\t&  6.1\t& \\phantom{$-$}0.07$\\pm$0.15\t& \\phantom{$-$}0.11$\\pm$0.15\t& \\phantom{$-$}0.6$\\pm$1.4\t& \\phantom{$-$}1.0$\\pm$1.4\t& \\phantom{$>$}67\\%\t& 3.9 \\\\\n\\hline\nIn1*\t& 0.0\t& \t&  0.0\t&           $-$0.01$\\pm$0.15\t&           $-$0.06$\\pm$0.15\t&           $-$0.1$\\pm$1.4\t&           $-$0.6$\\pm$1.4\t& \\phantom{$>$}46\\%\t& 3.2 \\\\ \nIn2*\t& 0.0\t& \t&  0.0\t& \\phantom{$-$}0.16$\\pm$0.15\t& \\phantom{$-$}0.02$\\pm$0.15\t& \\phantom{$-$}1.4$\\pm$1.4\t& \\phantom{$-$}0.1$\\pm$1.4\t& \\phantom{$>$}85\\%\t& 4.7 \\\\ \nA3*\t& 0.0\t& \t&  0.0\t&           $-$0.11$\\pm$0.15\t& \\phantom{$-$}0.27$\\pm$0.15\t&           $-$1.0$\\pm$1.4\t& \\phantom{$-$}2.4$\\pm$1.4\t& \\phantom{$>$}23\\%\t& 2.3 \\\\ \nEx1*\t& 0.0\t& \t&  0.0\t& \\phantom{$-$}0.05$\\pm$0.15\t& \\phantom{$-$}0.06$\\pm$0.15\t& \\phantom{$-$}0.4$\\pm$1.4\t& \\phantom{$-$}0.5$\\pm$1.4\t& \\phantom{$>$}63\\%\t& 3.7 \\\\ \nfs\\tablenotemark{$\\dagger$}\t& 0.0\t& \t&  0.0\t& \\phantom{$-$}1.79$\\pm$0.39\t& \\phantom{$-$}0.65$\\pm$0.37\t& \\phantom{$-$}16.1$\\pm$3.5\t& \\phantom{$-$}5.8$\\pm$3.3\t& \\phantom{$>$}100\\%\t& 24.3 \n\\enddata\n\\tablenotetext{*}{Background Galaxy}\n\\tablenotetext{$\\dagger$}{Foreground Star}\n\\tablenotetext{}{\\emph{Note--}$\\beta_{app}$ upper limit values are calculated for the background galaxies only as a convenient comparison to the values of the jet knots.  These values are not physically meaningful.}\n\\label{table:speeds}\n\\end{deluxetable*}\n\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=5.35in]{speeds_vs_distance.pdf}\n\\caption{\\label{fig:speedsVSdist} A comparison of jet speeds with\n  distance in the 3C~273 jet.  The radio VLBI-measured jet speeds for\n  the sub-arcsecond scale jet from \\cite{lister2013} are shown as\n  black triangles (note that the error bars are smaller than the symbol\n  size). The distance scale is broken at the gray bar to allow the\n  near-and-far velocity fields to be compared.  Our data for the\n  kpc-scale jet of 3C~273 is shown as orange lines spanning the\n  1$\\sigma$ error range, with dotted black lines giving the 2$\\sigma$\n  error range.  The blue lines and dotted extensions give the 1$\\sigma$\n  and 2$\\sigma$ measurements for the four background galaxies labeled\n  in Figure~\\ref{fig:referencesys}.}\n\\end{figure*}\n\n\n\\section{Discussion}\n\\label{sec:discussion}\n\n\\subsection{The velocity of the knots in the kpc-scale Jet}\nAs shown in Table~\\ref{table:speeds}, we do not detect significant\nproper motions in any of the knots in the jet of 3C~273. Only for the bright knots A1 and A2 is there a slight case for a significant\nnegative proper motion, just above the 1$\\sigma$ level, but we do not\nclaim this as a robust detection. These knots, like all other knots, do\nnot show any significant flux change over the 20 year timespan of the\nstudy, and an examination of the isophotes used in the contour method\nof position measurement did not suggest that any major change in knot\nshape (such as an increased north-west extension of the knot) could be\nresponsible for the observed negative value.\n\n\n\nAs shown in column 9 of Table~\\ref{table:speeds}, none of the knots\nhas a probability of speed greater than zero which rises to the level\nof significance (i.e, $>$95\\%). In general, the lack of knot\nproper-motion detections is not due to lack of proper-motions\nsensitivity in our study: if the knots in 3C273 had motions on the\norder of 5-7$c$ (corresponding to 0.56$-$0.78 mas yr$^{-1}$), as found\npreviously in M87 and 3C264, we would have been able to detect these\nmotions. The sensitivity of the study is also demonstrated by the\nsignificant proper motion measured for the foreground star (`fs' in\nTable~\\ref{table:speeds}).\n\nWe show in Figure~\\ref{fig:speedsVSdist} a comparison of our kpc-scale\nproper motion measurements with the parsec-scale jet speeds probed by\nradio interferometry by the MOJAVE project \\citep{lister2013}. The\nindependent axis is distance measured from the core along the jet\ndirection. The black triangles are the VLBI jet speeds (error bars are\nless than the symbol size), which reach values up to 15$c$. Our\nresults for the kpc-scale knots are shown as orange lines, spanning\n1$\\sigma$ errors, with dotted-black-line extensions representing the\n2$\\sigma$ error range. The distance scale is linear but with a break\nto show the two datasets side-by-side. We also show for comparison in\nblue our measurements for the four nearby galaxies labeled in\nFigure~\\ref{fig:referencesys}. These data points counter the slight\nimpression that there is a bias towards more positive values of the\nproper motions with increasing distance along the jet, ruling out that\nthis is due to any systematic bias in the image registration. Indeed,\nthe range of speeds observed for the background galaxies, known to\nhave a proper motion of absolutely zero, suggests that the spread in\nknot speeds is due to the random measurement error.\n\n\nThe VLBI speed data suggest the possibility of a deceleration with\ndistance already starting on parsec-scales, as shown in\nFigure~\\ref{fig:speedsVSdist}. If the three most distant points\nmeasured by VLBI accurately represent the maximum speed compared to\nthe highest upstream speed of nearly 15$c$, both exponential and\nlinear fits suggest the jet will reach mildly relativistic speeds\n($\\beta_{app}\\approx 1$) within an arcsecond (2.6 kpc, projected) of\nthe core, well before the distance to the optical jet which begins\n$\\approx$12$''$ further on from the core. A similar result is seen in\nM87, where the maximum speed reached at HST-1 of 6$c$ drops to speeds\nof $<$2$c$ within a kpc \\citep{biretta1999,meyer2013_m87}. Indeed, it\nshould be emphasized that while we refer to the jets of M87, 3C~264,\nand 3C~273 as ``kpc-scale'', the jet of 3C~273, at $\\approx$200-400\nkpc (deprojected) is likely 40-100 times longer than the lower-power\nFR I sources.  A recent acceleration study by the MOJAVE program\n\\citep{homan2015} shows that some sources switch from\nacceleration to deceleration beyond sub-kpc\nscales. It may simply be that even though 3C~273 starts out with a much\nhigher speed, the distance to knot A is such that the jet has slowed\ndown appreciably.  It is also worth noting that 3C~273 is somewhat\nunusual in not having hotspots, which are usually interpreted as the\npoint of final deceleration of a powerful, still-relativistic jet,\nwhich may also indicate that the jet has slowed either before or at\nthe optical jet.\n\n\\subsection{Constraints on the Physical Conditions in the kpc-scale Knots}\nWe now discuss the limits the present and previous observations yield\nfor two important physical parameters: the real speed $\\beta$ and the\nangle to the line-of-sight $\\theta$\n(Figure~\\ref{fig:betatheta}). Understanding the allowed parameter\nspace will in turn allow us to evaluate the energetic requirements and\nfitness of different physical models for the kpc-scale knots. Two\npossible scenarios are before us: either the knots are moving packets\nof plasma, or these features represent `standing shock' features which\nmove much more slowly than the bulk plasma speed. \n\nThe maximum observed speed of 15$c$ measured by the MOJAVE project\nimplies an angle no larger than 7.6$^\\circ$ as an absolute maximum\n(assuming $\\beta=1$) or 7.2$^\\circ$ to the line-of-sight for the\nparsec-scale jet if we assume that $\\Gamma<50$ as implied by the\nmaximum speeds observed for the entire sample of VLBI-observed jets\n\\citep[e.g.,][]{lister2009}.  No deviations are seen from parsec to\nkpc scales in 3C~273 which would suggest any bending in or out of the\nline-of-sight. We therefore adopt the 7.2$^\\circ$ as the maximum angle for\nthe kpc-scale jet as well. A further global limit on the angle to the\nline-of-sight can be calculated by assuming that the 24$''$\njet does not exceed 1 Mpc in total (deprojected) length, as very few\n radio galaxies exceed this length \\cite[e.g. 3C 236,][]{schilizzi2001}; this gives a\nlower limit $\\theta=3.8^\\circ$. These minimum and maximum angles are\nplotted as horizontal lines in Figure~\\ref{fig:betatheta}.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=3.5in]{newfigure.pdf}\n\\caption{\\label{fig:betatheta} This plot shows the allowed range of\n  real jet speed $\\beta$ and the angle to the line-of-sight $\\theta$\n  under two possible scenarios.  The light-blue shaded area\n  corresponds to the allowed region if the optical knots are moving\n  components, while the mauve region corresponds to the allowed\n  parameters if the optical jet is a continuous flow (and the knots\n  are shock features). For both areas, the left boundary is formed by\n  the curves dictated by the jet-to-counterjet ratio $R>10^4$ in each\n  case (\\citealt{conway1993}, see also \\citealt{geo06}), and the\n  entire jet is subject to the limits on viewing angle of\n  3.8$^\\circ<\\theta<$7.2$^\\circ$ dictated by the condition that the\n  jet not exceed 1 Mpc in length or a $\\Gamma>50$ in the parsec-scale\n  jet (see text). For the moving knots case, the thick upper-right\n  boundary corresponds to the limit from our observations that\n  $\\beta_{app}<1c$ for knot A1. In the continuous flow case, there is\n  an additional boundary from the condition that $\\delta<$7.8 from\n  \\cite{mey15_0637}. Within the allowed `moving knots' region, the\n  maximum speed $\\beta=0.94$, which corresponds to a limit\n  $\\Gamma\\leqslant 2.9$ and $\\delta\\leqslant5.5$ at this point.}\n\\end{figure}\n\nIf we assume that the optical knots are `ballistic' packets of moving\nplasma, a limit of $\\beta_\\mathrm{app}<1c$ on the knot speeds can be\nused to derive a limit in the $\\beta-\\theta$ plane, as shown in\nFigure~\\ref{fig:betatheta} as the slanting black line bounding the\nright of the allowed zone under the moving knots scenario (more\nconservative limits of 1.5$c$ and 2$c$ are shown as dashed and dotted\nlines as labeled). Further, the observation that the jet-to-counterjet\nratio $R$ exceeds 10$^4$ \\citep{conway1993} leads to the left boundary\nto this area, where\nR=(1+$\\beta$cos$\\theta$)$^{m+\\alpha}$/(1-$\\beta$cos$\\theta$)$^{m+\\alpha}$. In\nthe case of moving knots $m=3$ and for a continous flow $m=2$, while\nwe take $\\alpha$=0.8 from radio observations \\citep[see][]{geo06}.\nThe jet-to-counterjet ratio limit thus also leads to a left bound on\nthe allowed area for a continuous flow jet, as shown in\nFigure~\\ref{fig:betatheta}.  Note that the two zones (moving knots\nversus continuous flow) are nearly mutually exclusive only under the\n$\\beta_\\mathrm{app}<1c$ limit. Under the more conservative (larger)\nupper limits for $\\beta_\\mathrm{app}$, the moving knots allowed zone\nextends to higher $\\beta$ values, overlapping with purple-shaded the\ncontinuous flow region.\n\nThe allowed range of $\\beta$ according to the boundaries in\nFigure~\\ref{fig:betatheta} in the moving knots case under\n$\\beta_\\mathrm{app}<1c$ is 0.84$<\\beta<0.94$, corresponding to\n1.8$<\\Gamma<2.9$. The maximum $\\Gamma$ increases to 3.6 for a limit\n  $1.5c$ and $4.1$ for a limit of $2c$. The maximum Doppler beaming factor\nin the allowed zone under any of the $\\beta_\\mathrm{app}$ limits is\nfound at the point of minimum angle (3.8$^\\circ$) and maximum jet\nspeed. For $\\beta_\\mathrm{app}<1c$, $1.5c$, and $2c$, respectively, the\nupper limit on $\\delta$ is 5.5, 6.7, and 7.6.  As we discuss below, these\n$\\delta$ values are considerably lower than the $\\delta=20$ required (under\nequipartition) in the large-scale jet if the X-ray emission from the\nknots is from the IC/CMB process.\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Implications for the IC/CMB Model for the X-ray emission}\nThe kpc-scale jet of 3C~273 has been detected by \\emph{Chandra} in the\nX-rays \\citep{marshall2001,jester2006}, where the hard spectrum and\nhigh flux level of the knots shows that the X-rays are due to a\nseparate component from the radio-optical synchrotron spectrum.\nIndeed, HST observations by \\cite{jester2007} show that the spectrum\nis already upturning into this second component at UV energies. The\njet of 3C~273 is one of dozens of `anomalous' X-ray jets discovered by\n\\emph{Chandra} to have hard and high X-ray fluxes in the knots which require a\nsecond component \\citep[e.g.,][for a review]{harris2006}.  The most\nfavored explanation for the X-rays in these jets has been that the\nlarge-scale jet remains as highly relativistic as the parsec-scale\njet, with $\\Gamma$$\\approx$10 or more. Coupled with a small angle to\nthe line-of-sight, the increased Doppler boosting suggests that the\nX-rays could be consistent with inverse Compton upscattering of CMB\nphotons by the same electron population that produces the\nradio-optical synchrotron spectrum, assuming the electron energy\ndistribution can be extended to much lower energies than traced by GHz\nradio observations \\citep{tavecchio2000,celotti2001,jester2006}.  Alternatively,\nit has been suggested that the second component producing the X-rays\ncould be synchrotron in origin, from a separate electron energy\ndistribution which reaches multi-TeV energies\n\\citep{harris2004,kataoka2005,hardcastle2006,jester2006,uchiyama2006}. The\ndifferences between the IC/CMB and synchrotron mechanisms are important: the former requires a fast and powerful jet\n(sometimes near or super-Eddington), while the latter suggests a\nslower and less powerful jet on kpc scales \\citep{geo06}. The main\nopposition to the synchrotron interpretation remains its \nunclear origin \\citep{atoyan2002,aharonian2002,liu2015}.\n\nWhile IC/CMB is a popular explanation for anomalous X-ray jets, it has\nnow been ruled out explicitly in three cases: for PKS~1136-135 based\non UV polarization in the second spectral component \\citep{cara2013},\nand for PKS~0637-752 and 3C~273 based on non-detection of the\ngamma-rays implied by the IC/CMB model \\citep{mey14,mey15_0637}, an\nidea first proposed by \\cite{geo06}. In the case of 3C~273, we \nshow here in an independent way that the IC/CMB model is also \ndisfavored by our proper motions upper limits.\n\nIt has already been shown that the X-rays from the knots of 3C~273 and\nsimilar jets, can only be compatible with an IC/CMB origin if the\nknots are moving packets.  This is because in the case of\nparticle-accelerating standing shocks in the IC/CMB model, the\nextremely long (hundreds of Mpc) cooling length of the low energy\nX-ray emitting electrons would result in continuously-emitting X-ray\njets, instead of the observed knotty appearance\n\\citep{atoyan2002}. This is avoided in the case of a moving packet of\nplasma, as the low energy electrons remain confined within the packet.\n\n\n\nThe minimum power configuration for the first and brightest knot A1 is\nthat of equipartition between radiating electron and magnetic field\nenergy density.  With the additional assumption that the Lorentz\nfactor equals the Doppler factor, $\\Gamma=\\delta$ , this requires\n$\\delta=20$. All configurations, however, with $\\delta>7.6$ are\nexcluded because of the constraints discussed above. This requires\nthat we move away from the equipartition power requirement of\n$10^{48}$ erg s$^{-1}$ (assuming one proton per radiating electron),\nto $5 \\times 10^{48}$ erg s$^{-1}$ for the minimum power configuration\nin the permitted zone at the extreme edge where $\\theta=3.8^\\circ$,\n$\\delta=5.5$. Elsewhere in the allowed moving-knots zone the minimum\npower is even higher.\n \nWe compare now this power to the Eddington luminosity of the source.\nMass estimates for the black hole of 3C~273 vary widely, from $2\\times\n10^7\\,M_\\odot$ \\citep{wang2004} to $4\\times 10^8\\,M_\\odot$\n\\citep{pian2005} to $6.6\\times 10^9\\,M_\\odot$\n\\citep{paltani2005}. Even for the highest mass estimate, the Eddington\nluminosity is $10^{48}$ erg s$^{-1}$. This is barely compatible with\nthe equipartition configuration, which however we disfavor because it\ndoes not comply with our angle and superluminal motion constraints.\nThe minimum jet power compatible with $\\delta<5.5$ is five times\nhigher than the Eddington luminosity, adopting the highest black hole\nmass for 3C 273.\n\nGiven that the jet power is in general found to be sub-Eddington\n\\citep{ghisellininature} we disfavor the IC/CMB mechanism for the\nproduction of the X-rays, as it requires a power of at least five\ntimes Eddington, and up to several hundred times Eddington depending on\nthe black hole mass.\n\n\n\n\n\n\n\\section{Conclusions}\n\nWe have used new and archival HST V-band imaging of the optical jet in\n3C~273 to look for significant proper motions of the major knots over\nthe 19 years between June 1995 and May of 2014. We have described a\nmethod of image registration based on background galaxies; in the 2014\ndeep ACS imaging, our systematic error in the stacking is 0.44 mas,\nwhile the systematic error of registration for the 1995 and 2003\nepochs of WFPC2/PC imaging is 4.5 and 2.8 mas, respectively. We have\nused both a two-dimensional cross-correlation and a centroiding\ntechnique to measure relative shifts in the knots both along and\nperpendicular to the jet direction. Our results show that all knots\nhave speeds consistent with zero with typical 1$\\sigma$ errors on the\norder of 0.1$-$0.2 mas/year or 1.5$c$, and with 99\\% upper limit\nvalues ranging from $1-5$c. We have used nearby background galaxies to\nshow that these limits are consistent with stationary objects in the same field.\n\nThese results suggest that the knots in the kpc-scale jet, if they are\nmoving packets of plasma, must be relatively slow, in\n  agreement with previous studies based on jet-to-counterjet ratios in radio-loud populations \\citep{arshakian2004,mullin2009}.  Assuming\n  that the jet either remains at the same speed or decelerates as you\n  move downstream, the $2\\sigma$ upper limit speed derived from all\n  knots combined of $1c$ suggests that the entire optical jet is at\n  most mildly relativistic, with a maximum Lorentz factor of\n  $\\Gamma<2.9$. However, we cannot rule out the possibility that the\n  knots are standing shock features in the flow, where the bulk plasma\n  moves through the features with a higher $\\Gamma$.  The best limits\n  on the bulk plasma speed thus remain the limits derived from the\n  non-detection of the IC/CMB component in gamma-rays by\n  \\cite{mey15_0637}, where $\\delta<7.8$ is implied assuming\n  equipartition magnetic fields.\n\nFinally, we show that the observed upper limits on the proper motion\nof the knots confirms that the a near-equipartition IC/CMB model for\nthe X-rays of the kpc-scale knots is ruled out. The equipartition\nIC/CMB model requires that the knots are ballistic packets of moving\nplasma moving at the bulk speed $\\Gamma\\approx15-20$ which would imply\nproper motions on the order of 10$c$ or 1.12 mas/year which could have\nbeen detected in our study; our upper limits easily rule this out at a\nhigh level of significance ($>$5$\\sigma$). Moving away from\nequipartition conditions, an IC/CMB model consistent with our\nobservations requires a jet power on the order of five to several\nhundred times the Eddington limit, and is thus energetically disfavored.\n\nIn comparison to other recent HST observations of lower-power optical\njets M87 and 3C264, where highly superluminal speeds (6$-$7$c$) have been\nobserved in the optical kpc-scale jet, our first proper-motion study\nof a powerful quasar jet reveals no significant\nproper motions.  It remains to be seen whether this is\nbecause the jet has truly decelerated and is only mildly relativistic,\nor because the knot features in sources like M87 and 3C~273 represent\nvery different things: moving packets of plasma in the first instance\nand standing shocks in the second.\n\\label{sec:conclusion}\n\n\n \\acknowledgments E.T.M. acknowledges HST Grant GO-13327. E.T.M. and M.G. also acknolwedge NASA grant 14-ADAP14-0122.\n\n\\bibliographystyle{apj}\n\\bibliography{3c273,3c273_second}\n\n\n\n\\appendix\n\\section{CTE Correction Maps}\n\\label{appendixA}\nLosses due to charge transfer inefficiency (CTI=1-CTE) in the WFPC2\ndetectors is fairly well-studied problem. The first correction\nformulae were published by \\cite[][hereafter WHC99]{whitmore_cte_99},\nand later updated by \\cite{dolphin_cte_00}, in both cases based on\nobservations of stars. A comparison between the two shows reasonably\ngood agreement \\citep{whitmore_cte_02}, with the WHC99 formulae\nproducing smaller corrections at very low flux levels. We have used\nthe WHC99 formulae in our corrections, but the method of producing\npixel-by-pixel maps presented here could be used with any set of\ncorrections.\n\nApplying the WHC99 CTE loss correction formulae directly to the\nmeasured fluxes for the jet or galaxies in our imaging would be\ninappropriate because they are resolved, while the formulae are based\non fixed-aperture observations of stars. We also wished to produce\nCTE-corrected frames from the pipeline-produced `c0f' files to use in\nregistering the images through the background galaxies, where accurate\nflux levels are obviously helpful. Therefore, a pixel-by-pixel\ncorrection `map' for each raw image is needed.  Note that this method\nis not flux-conserving, but seems to work well in recovering the total\nflux in bright, resolved, but relatively compact sources such as the\njet knots and background galaxies. \n\nTo produce these maps, we first measured the background level in each\nraw image -- usually about 8 counts/pixel in 1995 and 3 counts/pixel\nin 2003. In order to calculate the corrected flux in each pixel, we\nneed the modified Julian date (MJD) of the observation, the $x$ and\n$y$ location on the detector, the background flux level, the `source'\nflux (total - background) and the WHC99 formulae.  We have assumed\nthat the CTE corrections have the same form (though not the same\nparameters) when based on the pixel value as when based on the total\nflux of a star within a radius=2 pixel aperture.  We transformed\nbetween these representations of the correction by using a `known'\nPSF, generated by the tinytim package, for the F622W filter using a\npowerlaw form and otherwise standard parameters. Since the original\ncorrection formulae were based on a 2-pixel-radius aperture, we only\nneed the PSF to be defined within an aperture of this size.  \n\nThe correction at each pixel $i$ is assumed to have the form:\n\n\n", "index": 1, "text": "\\begin{equation}\nx_{cts,i} = \\left(\\alpha_x + \\beta_x \\log\\left(\\mathrm{cts}_{0,i}\\right)\\right)\\mathrm{cts}_{0,i}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"x_{cts,i}=\\left(\\alpha_{x}+\\beta_{x}\\log\\left(\\mathrm{cts}_{0,i}\\right)\\right)%&#10;\\mathrm{cts}_{0,i}\" display=\"block\"><mrow><msub><mi>x</mi><mrow><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>s</mi></mrow><mo>,</mo><mi>i</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>(</mo><mrow><msub><mi>α</mi><mi>x</mi></msub><mo>+</mo><mrow><msub><mi>β</mi><mi>x</mi></msub><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub><mo>)</mo></mrow></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\nwhere the counts in the pixel \\emph{before CTE losses} is cts$_{0,i}$\nand $x_{cts,i}$ and $y_{cts,i}$ are the corrections for CTE losses in the\nx and y directions, respectively, in DN. We want to determine the values of\nthe $\\alpha$ and $\\beta$ parameters individually for each pixel.\n\nTo do that, we choose a vector of simulated observed stars with counts\n\\emph{before CTE losses} of $T^*_0$, and measured counts $T^*_M$ in\nthe two-pixel radius aperture. Starting with a vector of $T^*_M$\nvalues, the WHC99 formulae and properties of the pixel and image are\nused to get the values of $T^*_0$, $x_{cts}$ and $y_{cts}$, noting\nthat $T^*_0 = x_{cts} + y_{cts} + T^*_M$. These vectors can be related\nto the individual pixels falling within the aperture in the following\nway:\n\n\n", "itemtype": "equation", "pos": 58542, "prevtext": "\n\n\n", "index": 3, "text": "\\begin{equation}\ny_{cts,i} = \\left(\\alpha_y + \\beta_y \\log\\left(\\mathrm{cts}_{0,i}\\right)\\right)\\mathrm{cts}_{0,i}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"y_{cts,i}=\\left(\\alpha_{y}+\\beta_{y}\\log\\left(\\mathrm{cts}_{0,i}\\right)\\right)%&#10;\\mathrm{cts}_{0,i}\" display=\"block\"><mrow><msub><mi>y</mi><mrow><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>s</mi></mrow><mo>,</mo><mi>i</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>(</mo><mrow><msub><mi>α</mi><mi>y</mi></msub><mo>+</mo><mrow><msub><mi>β</mi><mi>y</mi></msub><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub><mo>)</mo></mrow></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\nwhere $y_{cts}$ is the total correction due to y-direction CTE losses\nfor all the pixels within the aperture.  Because we have used a\ncircular aperture, the fraction $f_i$ is used to only count the\nportion of the pixel that falls within the two-pixel radius, which we\nhave assumed is centered on the PSF. A similar equation holds in the\nx-direction. The vectors based on `stars' can be used to derive the\n$\\alpha$/$\\beta$ parameters from the following linear relation:\n\n\n", "itemtype": "equation", "pos": 59446, "prevtext": "\n\nwhere the counts in the pixel \\emph{before CTE losses} is cts$_{0,i}$\nand $x_{cts,i}$ and $y_{cts,i}$ are the corrections for CTE losses in the\nx and y directions, respectively, in DN. We want to determine the values of\nthe $\\alpha$ and $\\beta$ parameters individually for each pixel.\n\nTo do that, we choose a vector of simulated observed stars with counts\n\\emph{before CTE losses} of $T^*_0$, and measured counts $T^*_M$ in\nthe two-pixel radius aperture. Starting with a vector of $T^*_M$\nvalues, the WHC99 formulae and properties of the pixel and image are\nused to get the values of $T^*_0$, $x_{cts}$ and $y_{cts}$, noting\nthat $T^*_0 = x_{cts} + y_{cts} + T^*_M$. These vectors can be related\nto the individual pixels falling within the aperture in the following\nway:\n\n\n", "index": 5, "text": "\\begin{equation}\ny_{cts} = \\sum_i y_{cts,i}f_i\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"y_{cts}=\\sum_{i}y_{cts,i}f_{i}\" display=\"block\"><mrow><msub><mi>y</mi><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>y</mi><mrow><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>s</mi></mrow><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\nwhere\n\n\n", "itemtype": "equation", "pos": 59979, "prevtext": "\n\nwhere $y_{cts}$ is the total correction due to y-direction CTE losses\nfor all the pixels within the aperture.  Because we have used a\ncircular aperture, the fraction $f_i$ is used to only count the\nportion of the pixel that falls within the two-pixel radius, which we\nhave assumed is centered on the PSF. A similar equation holds in the\nx-direction. The vectors based on `stars' can be used to derive the\n$\\alpha$/$\\beta$ parameters from the following linear relation:\n\n\n", "index": 7, "text": "\\begin{equation}\n\\frac{y_{cts}}{S_1} = \\alpha_y + \\beta_y\\frac{S_2}{S_1}\n\\label{lineareq}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{y_{cts}}{S_{1}}=\\alpha_{y}+\\beta_{y}\\frac{S_{2}}{S_{1}}\" display=\"block\"><mrow><mfrac><msub><mi>y</mi><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>s</mi></mrow></msub><msub><mi>S</mi><mn>1</mn></msub></mfrac><mo>=</mo><mrow><msub><mi>α</mi><mi>y</mi></msub><mo>+</mo><mrow><msub><mi>β</mi><mi>y</mi></msub><mo>⁢</mo><mfrac><msub><mi>S</mi><mn>2</mn></msub><msub><mi>S</mi><mn>1</mn></msub></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 60092, "prevtext": "\n\nwhere\n\n\n", "index": 9, "text": "\\begin{equation}\nS_1 = \\sum_i \\mathrm{cts}_{0,i}f_i = T^*_0\\sum_i c_i f_i = T^*_0\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"S_{1}=\\sum_{i}\\mathrm{cts}_{0,i}f_{i}=T^{*}_{0}\\sum_{i}c_{i}f_{i}=T^{*}_{0}\" display=\"block\"><mrow><msub><mi>S</mi><mn>1</mn></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub></mrow></mrow><mo>=</mo><mrow><msubsup><mi>T</mi><mn>0</mn><mo>*</mo></msubsup><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub></mrow></mrow></mrow><mo>=</mo><msubsup><mi>T</mi><mn>0</mn><mo>*</mo></msubsup></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\nNote that the quantities $c_i$ define the PSF inside the aperture such that\n\n\n", "itemtype": "equation", "pos": 60190, "prevtext": "\n\n\n", "index": 11, "text": "\\begin{equation}\nS_2 = \\sum_i \\mathrm{cts}_{0,i}\\log\\left(\\mathrm{cts}_{0,i}\\right)f_i = T^*_0\\sum_i c_i f_i\\log\\left(T^*_0\\mathrm{cts}_{0,i}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"S_{2}=\\sum_{i}\\mathrm{cts}_{0,i}\\log\\left(\\mathrm{cts}_{0,i}\\right)f_{i}=T^{*}%&#10;_{0}\\sum_{i}c_{i}f_{i}\\log\\left(T^{*}_{0}\\mathrm{cts}_{0,i}\\right)\" display=\"block\"><mrow><msub><mi>S</mi><mn>2</mn></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub><mo>)</mo></mrow></mrow><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub></mrow></mrow><mo>=</mo><mrow><msubsup><mi>T</mi><mn>0</mn><mo>*</mo></msubsup><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><msubsup><mi>T</mi><mn>0</mn><mo>*</mo></msubsup><mo>⁢</mo><msub><mi>cts</mi><mrow><mn>0</mn><mo>,</mo><mi>i</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03687.tex", "nexttext": "\n\nUsing values of $T_M$ around the value of the observed pixel counts, a\nlinear least-squares fitting can easily derive the values of\n$\\alpha_y$ and $\\beta_y$ for equation~\\ref{lineareq}, and similarly\nfor $\\alpha_x$ and $\\beta_x$.  These then become the parameters for\ncalculating the pixel-based, rather than aperture-based correction.\n\n\n\n", "itemtype": "equation", "pos": 60432, "prevtext": "\n\nNote that the quantities $c_i$ define the PSF inside the aperture such that\n\n\n", "index": 13, "text": "\\begin{equation}\n\\sum_i c_i f_i = 1.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\sum_{i}c_{i}f_{i}=1.\" display=\"block\"><mrow><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub></mrow></mrow><mo>=</mo><mn>1</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}]