[{"file": "1601.02165.tex", "nexttext": "\nThe motivation to introduce $J_{2}$ is to perturb away the system from the U(1) Dirac spin liquid phase and to stabilize\nthe possible Z$_{2}$ spin liquid phase\\cite{Jiang2,Sheng,Kolley,Gong}. \nHere $<i,j>$ denotes NN pair of sites, $<<i,j>>$ denotes NNN pair of sites. \nTo describe the possible Z$_{2}$ spin liquid phase on the kagome lattice, we rewrite the spin operators in terms of \nthe slave particle operators $\\mathrm{S}=\\frac{1}{2}\\sum_{\\alpha,\\beta}f^{\\dagger}_{\\alpha}\\sigma_{\\alpha,\\beta}f_{\\beta}$ \nand introduce the following mean field ansatz for the slave Fermion $f_{\\alpha}$\n\n", "itemtype": "equation", "pos": 6110, "prevtext": "\n\n\\title[Short title for running header]{Z$_{2}$ spin liquid phase on the kagome lattice: a new saddle point}\n\\author{Tao Li}\n\\affiliation{Department of Physics, Renmin University of China,\nBeijing 100872, P.R.China}\n\\date{\\today}\n\n\\begin{abstract}\nWe have performed large scale variational search for the best RVB ansatz for the spin-$\\frac{1}{2}$ kagome \nantiferromagnet with both nearest-neighboring(NN) and next-nearest-neighboring(NNN) exchanges assuming \nonly translational symmetry. We find the best RVB state is always fully symmetric and has an mean field ansatz \nthat is gauge equivalent to a previous proposed Z$_{2}$ spin liquid ansatz. The Z$_{2}$ state is found to be slightly \nmore stable than the extensively studied U(1) \ngapless Dirac spin liquid state in both the $J_{2}\\neq0$ and the $J_{2}=0$ case and to possess a small spinon gap \nfor $J_{2}<0.2$. The breaking of the U(1) gauge symmetry in the Z$_{2}$ state is found to increase with $J_{2}$ and to be\nquite substantial around $J_{2}=0.15$. However, we find the Z$_{2}$ state is always very close to the gapless U(1) \nDirac spin liquid state, although they have very different RVB parameters. We argue the kagome antiferromagnet \nshould be better understood as a near critical system, rather than a system deep inside a gapped spin liquid phase \nwith well established Z$_{2}$ topological order.\n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle\nThe search for spin liquid state in frustrated quantum antiferromagnets has attracted a lot of attention in the strongly \ncorrelated electron system community. The spin-$\\frac{1}{2}$ kagome antiferromagnet \nis a particularly promising system for this purpose because of the strong geometrical frustration and the low coordinate \nnumber of the lattice. Early studies on small clusters find the ground state of the kagome antiferromagnet with NN \nexchange has no signature of any symmetry breaking and is very likely a quantum spin liquid\\cite{Elser,Chalker,Leung,Young,Lecheminant,Sindzingre,Nakano,Lauchli}.\nHowever, the exact nature of such a spin liquid phase is still under intense debate\\cite{Series,Vidal}. Especially, it is found that \nthe gap for triplet excitation above the ground state is very small, although the spin correlation length is only \nof the order of the lattice constant. More curiously, it is find that the spin singlet channel of the system may host \nan exponentially large number of low energy excitations below the exceptional small spin gap\\cite{Singlet,Mila,Auerbach,Poilblanc}. \n\nThe quest for the true nature of the ground state of the kagome antiferromagnet becomes even more urgent after \nits material realization in the \n$\\mathrm{ZnCu}_{3}\\mathrm{(OH)}_{6}\\mathrm{Cl}_{2}$ systems\\cite{Helton,Mendels,Han}. Recently, extensive DMRG simulations has been \nperformed on the kagome antiferromagnets both with \nonly NN exchange and that with more extended exchange couplings\\cite{Jiang1,Yan,Depenbrock,Jiang2,Sheng,Kolley,Gong}. The DMRG results seem to indicate that the kagome \nantiferromagnet with NN exchange has a small but finite gap in both spin triplet and spin singlet channel, \nwhich is in support of a \ngapped Z$_{2}$ spin liquid scenario. However, it is found that the $\\ln 2$ topological entanglement entropy expected for \na gapped Z$_{2}$ spin liquid can only be faithfully demonstrated when one introduce a finite NNN exchange coupling\\cite{Jiang2}. \nThe abundance of low energy singlet excitations in the system\\cite{Singlet} also raises the suspicion that the DMRG results may \nnot represent the intrinsic property of the system in the thermodynamic limit, since open boundary \ncondition is adopted in all DMRG simulations and symmetry breaking perturbations in the singlet channel \ncan be super relevant. \n\n\nAnother scenario on the spin liquid ground state of the kagome antiferromagnets is provided by variational studies\nbased on the RVB theory. \nIt was found previously that the best RVB state for the ground state of the kagome antiferromagnet with NN exchange \ncoupling is a U(1) spin liquid state with a Dirac-type spinon dispersion\\cite{Hastings,Ran}. Extensive studies on this state find it is\nactually a very robust saddle point provided that the symmetry of the system is unbroken\\cite{Lu,Iqbal1,Iqbal2}. \nAttempts to break the U(1) gauge symmetry(and to introduce spin gap) always result in increase of energy \nin the thermodynamic limit. More recently, study on the $J_{1}-J_{2}$ Heisenberg model on the kagome lattice has been \nperformed and it is found that the U(1) Dirac spin liquid state remains the most stable phase even when $J_{2}$ is \nquite large\\cite{Iqbal3}. This is strange since strong evidence for Z$_{2}$ topological order has already been reported \nin DMRG simulation in this case. The U(1) Dirac spin liquid state is thus argued to form a stable phase in the \nphase diagram around the NN Heisenberg model point, rather than a single quantum critical point.\n\nIn this work, we reinvestigate the possible spin liquid ground state of the kagome antiferromagnet with the RVB theory. \nTo reduce bias in our study, we only assume translational symmetry for the RVB state at the beginning. We have performed \nlarge scale variational search for the best RVB ground state for the $J_{1}-J_{2}$ model on the kagome lattice \nwith up to the second neighbor RVB order parameters. We find the best RVB state is a fully symmetric spin liquid \nwith a mean field ansatz that is gauge equivalent to a Z$_{2}$ ansatz proposed previously from the analysis of \nprojective symmetry group(PSG) on the kagome lattice\\cite{Lu}. \nDifferent from a previous study on the same state, we find a finite spin gap and Z$_{2}$\ngauge structure can be indeed be stabilized in both the $J_{2}\\neq0$ and the $J_{2}=0$ case, although the energy \nadvantage over the U(1) gapless state is very small. We find the extent of U(1) gauge symmetry \nbreaking increases with $J_{2}$. However, the spin gap is found to follow the opposite trend and vanishes around \n$J_{2}=0.2$. The size of the spin gap is found to be very small.\n\n\nThe model we study in this paper is given by\n\n", "index": 1, "text": "\\begin{equation}\nH=J_{1}\\sum_{<i,j>}\\mathrm{S}_{i}\\cdot\\mathrm{S}_{j}+J_{2}\\sum_{<<i,j>>}\\mathrm{S}_{i}\\cdot\\mathrm{S}_{j}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H=J_{1}\\sum_{&lt;i,j&gt;}\\mathrm{S}_{i}\\cdot\\mathrm{S}_{j}+J_{2}\\sum_{&lt;&lt;i,j&gt;&gt;}%&#10;\\mathrm{S}_{i}\\cdot\\mathrm{S}_{j}\" display=\"block\"><mrow><mi>H</mi><mo>=</mo><mrow><mrow><msub><mi>J</mi><mn>1</mn></msub><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow><mo>,</mo><mrow><mi>j</mi><mo>&gt;</mo><mi/></mrow></mrow></munder><mrow><msub><mi mathvariant=\"normal\">S</mi><mi>i</mi></msub><mo>⋅</mo><msub><mi mathvariant=\"normal\">S</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>+</mo><mrow><msub><mi>J</mi><mn>2</mn></msub><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>≪</mo><mi>i</mi></mrow><mo>,</mo><mrow><mi>j</mi><mo>≫</mo><mi/></mrow></mrow></munder><mrow><msub><mi mathvariant=\"normal\">S</mi><mi>i</mi></msub><mo>⋅</mo><msub><mi mathvariant=\"normal\">S</mi><mi>j</mi></msub></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02165.tex", "nexttext": "\nin which $\\psi_{i}=(f_{i,\\uparrow},f^{\\dagger}_{i,\\downarrow})$ is the Nambu spinor constructed from the slave Fermion. \n$U_{i,j}=\\left(\\begin{array}{cc}\\chi_{i,j} & \\Delta^{*}_{i,j} \\\\\\Delta_{i,j} & -\\chi^{*}_{i,j}\\\\ \\end{array}\\right)$ \nis a $2\\times2$ matrix with its matrix element $\\chi_{i,j}$ and $\\Delta_{i,j}$ representing the hopping\nand pairing type RVB order parameters for the ansatz. The RVB state is constructed by Gutzwiller projection of the \nmean field ground state and is given by\n\n", "itemtype": "equation", "pos": 6840, "prevtext": "\nThe motivation to introduce $J_{2}$ is to perturb away the system from the U(1) Dirac spin liquid phase and to stabilize\nthe possible Z$_{2}$ spin liquid phase\\cite{Jiang2,Sheng,Kolley,Gong}. \nHere $<i,j>$ denotes NN pair of sites, $<<i,j>>$ denotes NNN pair of sites. \nTo describe the possible Z$_{2}$ spin liquid phase on the kagome lattice, we rewrite the spin operators in terms of \nthe slave particle operators $\\mathrm{S}=\\frac{1}{2}\\sum_{\\alpha,\\beta}f^{\\dagger}_{\\alpha}\\sigma_{\\alpha,\\beta}f_{\\beta}$ \nand introduce the following mean field ansatz for the slave Fermion $f_{\\alpha}$\n\n", "index": 3, "text": "\\begin{equation}\nH_{MF}=\\sum_{i,j}\\psi_{i}^{\\dagger}U_{i,j}\\psi_{j}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"H_{MF}=\\sum_{i,j}\\psi_{i}^{\\dagger}U_{i,j}\\psi_{j}\" display=\"block\"><mrow><msub><mi>H</mi><mrow><mi>M</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></munder><mrow><msubsup><mi>ψ</mi><mi>i</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>U</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>ψ</mi><mi>j</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02165.tex", "nexttext": "\nhere $|\\{\\chi_{i,j},\\Delta_{i,j}\\}\\rangle$ denotes the mean field ground state of $H_{MF}$ and is a generalized \nBCS-type state. $\\mathrm{P_{G}}$ denotes the Gutzwiller projection to remove the doubly occupied configuration in the\nmean field ground state. The resultant RVB state can be simulated efficiently with the variational Monte Carlo method.\n\n\nIn our RVB state we will keep RVB order parameters $U_{i,j}$ up to the second neighboring bonds.\nTo represent a fully symmetric spin liquid state, these RVB order parameters should be invariant \nunder the symmetry operations of the Hamiltonian up to some SU(2) gauge transformations of the form \n$U_{i,j}\\longrightarrow G_{i}U_{i,j}G^{\\dagger}_{j}$. Here $G_{i}$ is a SU(2) matrix acting on the Nambu spinor \n$\\psi_{i}$. The symmetric RVB state so constructed can be \nclassified into distinct PSGs according to the gauge transformations $\\{G_{i}\\}$ needed to restore the form of the \nRVB order parameters after the symmetry operations. Here we will only assume the \ntranslational symmetry at the beginning. According to the scheme of the PSG classification, there are only two ways \nto realize the translational symmetry for a Z$_{2}$ spin liquid\\cite{Wen}. In the first class, the mean field ansatz should be\nmanifestly translational invariant. In the second class, the unit cell of the mean field ansatz should be doubled \nand a Z$_{2}$ gauge transformation is needed to restore the translated ansatz. In this study we will concentrated on the \nsecond class since it is energetically much more favorable than the first class. It can also be shown that \nonly the second kind of RVB state can be connected continuously to the U(1) Dirac spin liquid phase. \n\nIn our study, we will adopt a $L\\times L \\times 3$ cluster as illustrated in Fig.1. The doubled unit cell is illustrated \nby the region within the pink parallelogram. According to the PSG of the state, the RVB order parameters on the dashed \nbonds should be multiplied by an additional minus sign as compared to the RVB order parameters on the solid bonds\ntranslated from them. The on-site RVB order parameters should be manifestly translational invariant. As a result, \nwe have 3 independent on-site RVB order parameters, 6 independent RVB order parameters on the NN bonds and 6 \nindependent RVB order parameters on the NNN bonds. Using the remaining gauge degree of freedom allowed by the \ntranslational symmetry, we can transform the RVB order parameters on the gray sites and the RVB order parameters \non the two NN bonds from the gray sites into the form of $\\alpha\\tau_{3}$. Finally, we can transform the pairing \norder parameter on a third NN bonds into real.\nTaking all these considerations into account, we are left with 48 independent real variational parameters.\n\n\nWe have performed large scale variational optimization on the above RVB ansatz for the $J_{1}-J_{2}$ model on the kagome\nlattice. We have adopted the Stochastic Reconfiguration method in our variational search\\cite{SR}.\nThe optimized RVB ansatz is illustrated in Fig.1. More specifically, the on-site RVB order parameter are given by\n\\begin{eqnarray}\nU_{i,i}=\\left\\{\\begin{aligned}\n      \\mu\\tau_{3} & &   \\mathrm{gray\\ sites} \\\\\n      \\mu\\vec{n}_{\\phi_{1}}\\cdot\\vec{\\tau} & &  \\mathrm{navy\\ sites}\n      \\end{aligned}\n      \\right.\n\\end{eqnarray}\nin which $\\vec{\\tau}=(\\tau_{1},\\tau_{2},\\tau_{3})$ are the Pauli matrixes,\n $\\vec{n}_{\\phi}=(\\sin(\\phi),0,\\cos(\\phi))$ is a vector of unit length in the $\\tau_{1}-\\tau_{3}$ plane.\n $\\mu$ is a real number.\nThe RVB order parameters on the nearest-neighboring(NN) bonds are given by\n\\begin{eqnarray}\nU_{i,j}=-s_{i,j}\\left\\{\\begin{aligned}\n       \\tau_{3} & &   \\mathrm{black\\ bonds} \\\\\n       \\vec{n}_{\\phi_{2}}\\cdot\\vec{\\tau} & &  \\mathrm{red\\ bonds}\n      \\end{aligned}\n      \\right.\n\\end{eqnarray}\nHere $s_{i,j}=\\pm 1$ on the solid(dashed) NN bonds. \nThe RVB order parameter on the next-nearest-neighboring(NNN) bonds are given by\n\\begin{eqnarray}\nU_{i,j}=-\\nu_{i,j}\\left\\{\\begin{aligned}\n      \\eta\\vec{n}_{\\phi_{3}}\\cdot\\vec{\\tau} & &   \\mathrm{blue\\ bonds} \\\\\n      \\eta\\vec{n}_{\\phi_{4}}\\cdot\\vec{\\tau} & &   \\mathrm{green\\ bonds} \n      \\end{aligned}\n      \\right.\n\\end{eqnarray}\nHere $\\eta$ is a real number,  $\\nu_{i,j}=\\pm 1$ on the solid(dashed) NNN bonds. \n\n\\begin{figure}\n\\includegraphics[width=9cm,angle=0]{Graph1.eps}\n\\caption{The mean field ansatz of the Z$_{2}$ spin liquid state studied in this paper. The region within the pink \nparallelogram is the unit cell of the mean field Hamiltonian. The dots(bonds) in the same color have the same value \nfor the RVB order parameter $U_{i,j}$, except for an additional minus sign on the dashed bonds.} \\label{fig1}\n\\end{figure}\n\nThe above ansatz is manifestly time reversal symmetric but may in general break the point group symmetry \nof the kagome lattice. However, we find at the optimum of the variational energy, the following\nrelations always hold: $\\phi_{1}=2\\phi_{2}$,$\\phi_{4}=\\phi_{3}+\\phi_{2}$. In such a situation, \nwe can actually prove that the ansatz describes a fully symmetric spin liquid state.\nIn fact, we can show that the above RVB ansatz is gauge equivalent to the Z$_{2}$ ansatz proposed in Ref.[1] \nby the following gauge transformation\n\\begin{eqnarray}\nG_{i}=\\left\\{\\begin{aligned}\n\\exp(-i\\frac{\\phi_{2}\\tau_{2}}{2}) & & i\\in   \\mathrm{gray\\ sites}\\\\\n\\exp(i\\frac{\\phi_{2}\\tau_{2}}{2}) & & i\\in  \\mathrm{navy\\ sites}\n     \\end{aligned}\n     \\right.\n\\end{eqnarray}\nThe gauge transformed ansatz takes the form of\n\\begin{eqnarray}\nU_{i,j}=\\left\\{\\begin{aligned}\n\\mu\\vec{n}_{\\phi_{2}} \\cdot \\vec{\\tau} & & \\mathrm{on-site} \\\\\n                -s_{i,j}\\tau_{3}& & \\mathrm{NN\\ bonds}\\\\  \n                -\\nu_{i,j}\\eta\\vec{n}_{\\phi_{3}} \\cdot \\vec{\\tau}& & \\mathrm{NNN\\ bonds}\n\\end{aligned}  \n\\right.\n\\end{eqnarray}\n\n\n\nWhen both $\\phi_{2}$ and $\\eta$ are set to be zero, the above ansatz is reduced to the U(1) Dirac spin liquid ansatz.\nTo break the U(1) gauge symmetry, we can introduce a nonzero \npairing term either on a site or on a NNN bond. More specifically, if there exists two closed loops \nstarting from the same point, say, site $i$, on which the successive product of the RVB order parameters \n$P_{i}=U_{i,j}U_{j,k}...U_{l,i}$ do not commute, the U(1) gauge symmetry is broken. To determine the gauge structure of\nthe above ansatz, we can define the following two closed loops. The first one is a length-zero loop consisting of\nthe site $i$ only. The product of RVB order parameters on this loop is just the on-site RVB order parameter \n$P_{i}^{1}=U_{i,i}=\\mu\\vec{n}_{\\phi_{2}}\\cdot\\vec{\\tau}$. The second closed loop is the elementary triangle from site $i$. \nThe product of RVB order parameters on this loop is given by $P_{i}^{2}=U_{i,j}U_{j,k}U_{k,i}=-\\tau_{3}$. Here $i,j,k$\nare the three vertices of the elementary triangle. Thus, the U(1)\ngauge symmetry is broken when $\\phi_{2}\\neq 0$ or $\\pi$\\cite{2}. The deviation of $\\phi_{2}$ from $0$ or $\\pi$ \nprovides us a measure of the extent of the U(1) gauge symmetry breaking.\nFor the above ansatz, the U(1) gauge symmetry is broken when $\\phi_{2}\\neq 0,\\pi$ even in the absence of NNN \nRVB order parameters. However, our numerical optimization shows that the NNN RVB order parameter is crucial to \nstabilize a Z$_{2}$ gauge structure. More specifically, if we set $\\eta=0$, then in \nthe optimized ansatz we always have $\\phi_{2}=0$. As we will see below, the optimized value of both $\\phi_{2}$\nand $\\eta$ increase with $J_{2}$. This is consistent with previous DMRG studies which find that the \nconvergence of the topological entanglement entropy becomes better for larger $J_{2}$.\n\n\\begin{figure}\n\\includegraphics[width=9cm,angle=0]{parameters.eps}\n\\caption{The optimized variational parameters as a function of $J_{2}$. The system size is $L=12$ in the calculation}.\n\\end{figure}\n\nNow we present our results of the variational calculation on the $J_{1}-J_{2}$ model with the above RVB ansatz. \nOur calculation is done on a $L\\times L\\times 3$ cluster with $L$ ranging from 12 to 24. We use periodic-\nanti-periodic boundary condition in all calculations. Previous studies on the same ansatz find that the \nU(1) Dirac spin liquid is the best variational state even for quite \nlarge $J_{2}$ on sufficiently large system. What we find here is different. We find the U(1) Dirac spin liquid is not \nthe most stable state for both zero and non-zero $J_{2}$ on the largest system we have attempted, which is much larger \nthan that is used in previous studies. \nIn the fully symmetric state, there are four variational parameters, namely $\\mu$,\n$\\phi_{2}$, $\\phi_{3}$ and $\\eta$ to be determined by optimization of the variational energy. \nIn Fig.2 we plot the optimized \nvalues of the variational parameters as functions of $J_{2}$($J_{1}=1$). \nFrom the results, we see the extent of U(1) gauge symmetry breaking(which is dictated by the angle \n$\\phi_{2}$) increases monotonically with $J_{2}$. At $J_{2}=0.15$, the breaking of the U(1)\ngauge symmetry is very significant. \n\n\nTo show that the Z$_{2}$ saddle point we find is indeed more stable than the U(1) saddle point found in previous studies, \nwe plot the interpolation of the variational energy between these two saddle points. \nThe U(1) saddle point is reached when we set $\\phi_{2}=0$ and $\\phi_{3}=0$.\nThe value of $\\eta$ is in general nonzero for nonzero $J_{2}$ and should be optimized. We define an interpolation between \nthe optimized U(1) ansatz and the optimized Z$_{2}$ saddle point by mixing their variational parameters \nin the following way: $x_{i}=\\alpha x_{i}^{(0)}+(1-\\alpha)x_{i}^{(1)}$. \nHere $\\alpha$ is an interpolation parameter, $x_{i}^{(0)}$ and\n$x_{i}^{(1)}$ denote the set of optimized variational parameters($\\mu,\\phi_{2},\\phi_{3},\\eta$) for the U(1) and \nZ$_{2}$ saddle point. The variational energy as a function of the interpolation parameter $\\alpha$ at $J_{2}=0.15$ \nis shown in Fig.3. The Z$_{2}$ saddle point is obviously more \nrobust than the U(1) saddle point. However, the energy difference between the two saddle points is extremely \nsmall(or the order of $10^{-4}J_{1}$ per site). This is very unusual since the difference in the gauge structure \nof the two saddle points is so significant.\n\n\n\n\\begin{figure}\n\\includegraphics[width=8cm,angle=0]{eng.eps}\n\\caption{The interpolation of the variational energy between the U(1) saddle point and the Z$_{2}$ saddle point. \nThe calculation is done for $J_{2}=0.15$ on a $L=12$ system.}\n\\end{figure}\n\\begin{figure}\n\\includegraphics[width=8cm,angle=0]{z2flux.eps}\n\\caption{The optimized value of $\\phi_{2}$ at $J_{2}=0$ for different system sizes.}\n\\end{figure}\n\n\nAt the same time, we find the Z$_{2}$ phase angle $\\phi_{2}$ \nremains nonzero even for $J_{2}=0$(note the optimized value for $\\eta$ is significantly\nlarger than previous report, which is $0.0186(2)$\\cite{Iqbal1}). To check if this is a finite size effect, \nwe have performed the variational optimization on larger systems. Fig.4 shows the size dependence of \n$\\phi_{2}$ up to $L=24$, which is the largest size that we can deal with. We find although there is a tendency \nin $\\phi_{2}$ to decrease with increasing $L$, the slope is very small and it is hard conclude if it vanish on \nany finite system that we can treat. We note the largest $L$  we have treated is already significantly\nlarger than the circumference of the cylindrical clusters used in DMRG calculations. Thus it is possible that the \nweak signature of Z$_{2}$ spin liquid claimed by DMRG simulations at $J_{2}=0$ is still a finite size effect. \nThe true ground state at $J_{2}=0$ in the thermodynamic limit may still be very close to a gapless U(1) spin liquid, \nor a quantum critical point\\cite{Tao}.\n\nNow let's investigate the evolution of the spin gap with $J_{2}$. Usually, the spin gap opens when \nthe mean field ansatz breaks the U(1) gauge symmetry.  We thus should expect the spin gap to increase with the \nextent of U(1) gauge symmetry breaking. However, we find this is not true for our state. \nIn principle, it is impossible to extract the spin gap directly from the \nvariational calculation on the ground state.\nThe spin correlation length in the ground state is also not a good indicator for the spin excitation gap \nfor the kagome antiferromagnet. Here we will use the mean field result for the spinon gap as an indicator of the\nspin excitation gap. The evolution of the mean field spinon gap with $J_{2}$ is shown in Fig.5\n(note the magnitude of the NN RVB order parameter has been set to be one). To reduce finite size effect,\nwe have calculated the mean field dispersion in the thermodynamic limit with the optimized RVB parameters \nobtained on the $L=12$ cluster. We find the spinon gap actually decreases with increasing $J_{2}$ and approaches\nzero around $J_{2}=0.2$, a signature which may imply the proximity of the system to a magnetic ordered state \nat large $J_{2}$\\cite{Gong}.\n\\begin{figure}\n\\includegraphics[width=8cm,angle=0]{gap.eps}\n\\caption{The mean field spinon gap in the thermodynamic limit calculated with the optimized RVB parameters obtained on \nthe $L=12$ cluster.}\n\\end{figure}\n\nFinally, let us return to the problem of the exceptional insensitivity of the variational energy in the RVB parameters \nas we find in Fig.3. Similar behavior has also been reported in previous variational studies of the kagome antiferromagnet.\nA possible origin for such a strange behavior is that the saddle points with distinct RVB parameters may \ncorrespond to similar spin liquid state. This implies that some RVB parameters may be quasi-redundant.\nTo check if this is the case, we have calculated the overlap between the U(1) \nspin liquid state and the Z2 spin liquid state at $J_{2}=0.15$. To our surprise, we find the overlap is larger than 0.99 \non the $L=12$ cluster(the overlap at $J_{2}$ is even larger). To find out the origin for such a quasi-redundancy, \nwe plot in Fig.6 the density of state of spinon excitation for the two ansatzs at $J_{2}=0.15$. Except for the small gap \nfeature around $E=0.03$ for the Z$_{2}$ ansatz, the density of state of both ansatzs are almost \nidentical below $E=1$. The density of state for both states become drastically different only when $E>1$. \nThis implies that the main difference between the two states is in their high energy behavior, which for some reason\ndepend only very weakly on the structure of the ground state. This is possible for a multi-band system, in which\ntotally different high energy excitation spectrum can be realized on the same ground state. \nIt is interesting to see if similar behavior also occurs for RVB states on other on-primitive Bravais lattices.\n\n\n\\begin{figure}\n\\includegraphics[width=8cm,angle=0]{dos.eps}\n\\caption{The density of state of the U(1) and Z$_{2}$ ansatz at $J_{2}=0.15$.\n}\n\\end{figure}\n\nIn summary, we have performed large scale search for Z$_{2}$ spin liquid state for the spin-$\\frac{1}{2}$ kagome \nantiferromagnet with NN and NNN exchanges assuming only translational invariance. We find the best RVB state is \nalways fully symmetric and is gauge equivalent to a Z$_{2}$ ansatz proposed previously from symmetry analysis. The\nZ$_{2}$ state is found to be slightly more stable than the extensively studied U(1) gapless Dirac spin liquid state in both \nthe $J_{2}\\neq0$ and the $J_{2}=0$ case and to possess a small spinon gap for $J_{2}<0.2$.\nWe find while the extent of U(1) gauge symmetry breaking in the Z$_{2}$ state increases with \n$J_{2}$, the spinon gap follows the opposite trend.\nThese results are qualitatively consistent with the findings of the DMRG simulations on the $J_{1}-J_{2}$\nmodel on the kagome lattice. However, we note the Z$_{2}$ state we find is always very close to the gapless U(1) \nDirac spin liquid state, although they have very different RVB parameters. Thus we think the kagome antiferromagnet \nshould be better understood as a near critical system, rather than a system deep inside a gapped spin liquid phase \nwith well established Z$_{2}$ topological order.\n\n\n\nThis work is supported by NSFC Grant  No. 11034012 and the Research Funds of Renmin University of China. \nThe author acknowledge the discussion with Tomonori Shirakawa, Seiji Yunoki, Yuan-Ming Lu, Normand Bruce and Fa Wang \nin different stages of this work.\n\n\n\n\n\\begin{thebibliography}{99}\n\n\\bibitem{Elser} V. Elser, Phys. Rev. Lett. \\textbf{62}, 2405 (1989).\n\\bibitem{Chalker} J. T. Chalker and J. F. Eastmond, Phys. Rev. B \\textbf{46}, 14201 (1992).\n\\bibitem{Leung} P. W. Leung and V. Elser, Phys. Rev. B \\textbf{47}, 5459 (1993).\n\\bibitem{Young} N. Elstner and A. P. Young, Phys. Rev. B\\textbf{ 50}, 6871 (1994).\n\\bibitem{Lecheminant} P. Lecheminant, B. Bernu, C. Lhuillier, L. Pierre, and P. Sindzingre, Phys.Rev.B {\\bf 56}, 2521 (1997).\n\\bibitem{Sindzingre} P. Sindzingre and C. Lhuillier, Europhys. Lett. {\\bf 88}, 27009 (2009).\n\\bibitem{Nakano} H. Nakano and T. Sakai, J. Phys. Soc. Jpn. {\\bf 80}, 053704 (2011).\n\\bibitem{Lauchli} A. M. L\\\"auchli, J. Sudan, and E. S. S\\o rensen, Phys. Rev. B {\\bf 83}, 212401 (2011).\n\n\\bibitem{Series} R. R. P. Singh and D. A. Huse, Phys. Rev. Lett. {\\bf 68}, 1766 (1992); \nR. R. P. Singh and D. A. Huse, Phys. Rev. B \\textbf{76},\n180407(R) (2007); R. R. P. Singh and D. A. Huse, Phys. Rev. B \\textbf{77},144415 (2008).\n\\bibitem{Vidal} G. Evenbly and G. Vidal, Phys. Rev. Lett. \\textbf{104}, 187203 (2010).\n\n\\bibitem{Singlet} C. Waldtmann, H.-U. Everts, B. Bernu, C. Lhuillier, P. Sindzingre, P. Lecheminant, and L. Pierre, Eur. Phys. J. B \\textbf{2}, 501 (1998); P. Sindzingre, G. Misguich, C. Lhuillier, B. Bernu, L. Pierre, Ch. Waldtmann, and H.-U. Everts, Phys. Rev. Lett. \\textbf{84}, 2953 (2000); G. Misguich and B. Bernu, Phys. Rev. B, \\textbf{71}, 014417(2005); A. M. L\\\"{a}uchli and C. Lhuillier, arxiv:0901.1065.\n\\bibitem{Mila} F.Mila, Phys. Rev. Lett. \\textbf{81},2356(1998); M. Mambrini and F. Mila, Eur. Phys. J. B \\textbf{17}, 651 (2000).\n\\bibitem{Auerbach} R. Budnik and A. Auerbach, Phys. Rev. Lett.\\textbf{ 93}, 187205 (2004).\n\\bibitem{Poilblanc} D. Poilblanc, M. Mambrini, and D. Schwandt, Phys. Rev. B \\textbf{81}, 180402 (2010).\n\n\\bibitem{Helton} J. S. Helton, K. Matan, M. P. Shores, E. A. Nytko, B. M. Bartlett, Y. Yoshida, Y. Takano, A. Suslov, Y. Qiu, J.-H. Chung, D. G. Nocera, and Y. S. Lee, Phys. Rev. Lett. \\textbf{98}, 107204 (2007). \n\\bibitem{Mendels} P. Mendels, F. Bert, M. A. de Vries, A. Olariu, A. Harrison, F. Duc, J. C. Trombe, J. S. Lord, A. Amato, and C. Baines, Phys. Rev. Lett.\\textbf{ 98}, 077204 (2007).\n\\bibitem{Han} T. H. Han, J. S. Helton, S. Chu, D. G. Nocera, J. A. Rodriguez-Rivera, C. Broholm, Y. S. Lee  Nature \\textbf{492}, 406â\u0080\u0093410 (2012).\n\n\\bibitem{Jiang1} H. C. Jiang, Z. Y. Weng, and D. N. Sheng, Phys. Rev. Lett. \\textbf{101}, 117203 (2008).\n\\bibitem{Yan} S. Yan, D. A. Huse, and S. R. White, Science {\\bf 332}, 1173 (2011).\n\\bibitem{Depenbrock} S. Depenbrock, I. P. McCulloch, and U. Schollw\\\"ock, Phys. Rev. Lett. {\\bf 109}, 067201 (2012).\n\\bibitem{Jiang2} H. C. Jiang, Z. Wang, and L. Balents, Nat. Phys. {\\bf 8}, 902 (2012).\n\\bibitem{Sheng} S. S. Gong, W. Zhu, and D. N. Sheng, Sci. Rep. {\\bf 4}, 6317 (2014).  \n\\bibitem{Kolley} F. Kolley, S. Depenbrock, I. P. McCulloch, U. Schollw\\\"ock, V. Alba, Phys. Rev. B \\textbf{91}, 104418 (2015).\n\\bibitem{Gong} S. S. Gong, W. Zhu, L. Balents, and D. N. Sheng, Phys. Rev. B \\textbf{91}, 075112 (2015).\n \n\\bibitem{Hastings} M. B. Hastings, Phys. Rev. B {\\bf 63}, 014413 (2000).\n\\bibitem{Ran} Y. Ran, M. Hermele, P. A. Lee, and X. G. Wen, Phys. Rev. Lett. {\\bf 98}, 117205 (2007).\n\\bibitem{Lu} Y. M.Lu, Y. Ran, and P. A. Lee, Phys.Rev.B {\\bf 83}, 224413 (2011).\n\\bibitem{Iqbal1} Y. Iqbal, F. Becca, and D. Poilblanc, Phys. Rev. B {\\bf 83}, 100404(R) (2011).\n\\bibitem{Iqbal2} Y. Iqbal, F. Becca, and D. Poilblanc, Phys. Rev. B {\\bf 84}, 020407(R) (2011); New J. Phys. {\\bf 14}, 115031 (2012); Y. Iqbal, F. Becca, S. Sorella, and D. Poilblanc, Phys. Rev. B {\\bf 87}, 060405(R) (2013); Y. Iqbal, D. Poilblanc, and F. Becca, Phys. Rev. B {\\bf 89}, 020407(R) (2014).\n\\bibitem{Iqbal3} Y. Iqbal, D. Poilblanc, and F. Becca, Phys. Rev. B {\\bf 91}, 020402(R) (2015).\n\n\\bibitem{Wen} X. G. Wen, Phys. Rev. B \\textbf{65} 165113 (2002).\n\\bibitem{SR}  S. Yunoki and S. Sorella, Phys. Rev. B \\textbf{74}, 014408 (2006). \n\\bibitem{Tao} Tao Li, arXiv:1106.6134.\n\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 7422, "prevtext": "\nin which $\\psi_{i}=(f_{i,\\uparrow},f^{\\dagger}_{i,\\downarrow})$ is the Nambu spinor constructed from the slave Fermion. \n$U_{i,j}=\\left(\\begin{array}{cc}\\chi_{i,j} & \\Delta^{*}_{i,j} \\\\\\Delta_{i,j} & -\\chi^{*}_{i,j}\\\\ \\end{array}\\right)$ \nis a $2\\times2$ matrix with its matrix element $\\chi_{i,j}$ and $\\Delta_{i,j}$ representing the hopping\nand pairing type RVB order parameters for the ansatz. The RVB state is constructed by Gutzwiller projection of the \nmean field ground state and is given by\n\n", "index": 5, "text": "\\begin{equation}\n|\\mathrm{RVB}\\rangle=\\mathrm{P_{G}}|\\{\\chi_{i,j},\\Delta_{i,j}\\}\\rangle, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"|\\mathrm{RVB}\\rangle=\\mathrm{P_{G}}|\\{\\chi_{i,j},\\Delta_{i,j}\\}\\rangle,\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>RVB</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msub><mi mathvariant=\"normal\">P</mi><mi mathvariant=\"normal\">G</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mo stretchy=\"false\">{</mo><msub><mi>χ</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>,</mo><msub><mi mathvariant=\"normal\">Δ</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]