[{"file": "1601.01753.tex", "nexttext": "\n\nThe normalized return ${r_i}(t')$ of stock $i$ is defined as,\n\n\n", "itemtype": "equation", "pos": 5945, "prevtext": "\n\n\n\\begin{frontmatter}\n\n\\title{Geography and distance effect on financial dynamics in the Chinese stock market}\n\n\\author[SE]{Xing Li},\n\\author[SE]{Tian Qiu \\corauthref{cor}},\n\\corauth[cor]{Corresponding author. Address: 696 South Fenghe\nAvenue, School of Information Engineering, Nanchang Hangkong\nUniversity, Nanchang, 330063, China.} \\ead{tianqiu.edu@gmail.com}\n\\author[SE]{Guang Chen},\n\\author[SA1,SA2]{Li-Xin Zhong},\n\\author[SA3]{Xiong-Fei Jiang}\n\n\n\\address[SE]{School of Information Engineering, Nanchang Hangkong University, Nanchang, 330063, China}\n\\address[SA1]{School of Finance and Coordinated Innovation Center of Wealth Management and Quantitative Investment, Zhejiang University of Finance and Economics, Hangzhou, 310018, China}\n\\address[SA2]{School of Economics and Management, Tsinghua University, Beijing, 100084, China}\n\\address[SA3]{School of Information Engineering, Ningbo Dahongying University, Ningbo, 315175, China}\n\n\\begin{abstract}\nGeography effect is investigated for the Chinese stock market, based on the daily data of individual stocks. Companies located around the stock markets are found to greatly contribute to the markets in the geographical sector. A geographical correlation is introduced to quantify the geography effect on the stock correlation, which is observed to approach steady as the company location moves to the northeast China. Stock distance effect is further studied, where companies are found to more likely set their headquarters close to each other. In the normal market environment, the stock correlation decays with the stock distance, but is independent of the stock distance in and after the financial crisis.\n\n\n\\end{abstract}\n\n\\begin{keyword}\nEconophysics; Stock market; Geography effect \\PACS\n89.65.Gh, 05.45.Tp\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\\section{Introduction}\n\n\n\nStock market has an essential function to the country economics, therefore the market evolution has attracted a great interest of scientists from different research fields, such as the economists, mathematicians, and physicists. Among them, a lot of physicists devoted to the study of financial dynamics in the past two decades \\cite{man95,gop99,liu99,gab03,gu08,mis10,ren10,zha11,qiu12,pod09,ava14,cur14,ken15,qia15}, and some stylized facts have been revealed from the statistical physics perspective. Scaling behavior of the return and return interval distributions has been observed for different markets \\cite{man95,gop99,liu99,gu08,qiu08,yam05,wan08,jun08}. Volatility clustering is found to be universal for most markets \\cite{liu99,gia01}. The time correlation and time-spatial correlation is widely studied for the financial markets \\cite{son11,men14}. Various models have been proposed to understand the underlying mechanism of financial dynamics\\cite{egu00,gu09,che13,qiu10}, and the economic dynamics is also investigated from the experimental perspective \\cite{hua15a,hua15b}.\n\nPrevious studies have gained abundant characteristic of financial dynamics. However, there are few studies focusing on the the geography effect on financial dynamics, by using the long-term  empirical data of individual stocks. In fact, how the geography affects the finance is an important economic issue, and has received a wide discussion from the economic literature. It has ever been regarded that the rapid development of telecommunication and internet has changed the geography role in finance \\cite{cas89}. Economic space becomes no longer important \\cite{ohm95a,ohm95b,kob97}. However, a contrast point of view says that the spatial effect is still critical\\cite{ber97,zha04}. The geographical information has an essential influence on the pattern of cross-border equity \\cite{por05}. The cultural distance is also found to contribute to the transaction cost \\cite{agg09}. Lucey et al find a higher country-pair linkage for the smaller cultural distance \\cite{luc10}. Up to now, how geography and distance affect the financial dynamics still remains controversial.\n\nIn this article, we try to understand the geography effect on the stock market, by applying the random matrix theory, cross-correlation function, etc, based on the daily data of the individual stocks of the Chinese stock market. Our results show that the stock location still has an impact on the financial dynamics. Stock correlation decays with the distance only in the normal stock market, but presents no relation with the stock distance in and after the financial crisis.\n\n\\section*{Datasets and geographical sector}\nThe datasets are based on the daily data of the individual stocks of the Chinese stock market from the Jan. 1, 2005 to Dec. 31, 2010. Since the market experiences the financial crisis around the year 2008, the data cover three stages of the time before, in, and after the financial crisis. To ensure the stock liquidity, only the stocks whose number of trading days is no less than 150 days are selected. Finally, 778 stocks are chosen in the Shanghai stock market (SH), and 474 stocks are chosen in the Shenzhen stock market(SZ). The stock location is denoted as the headquarter location of the company, and the location of the selected stocks covers all the provinces of China. In the Shanghai stock market, the number of stocks whose company headquarters are located in the Shanghai city is 153, occupying 19.67\\% of the Shanghai stock market. And in the Shenzhen stock market, the number of stocks whose company headquarters are located in the Guangdong province is 121, occupying 25.53\\% of the Shenzhen stock market. It indicates that the company whose stock is of high liquidity still prefers to set the headquarter in the region around the financial center.\n\nBefore investigating the geography effect on the financial dynamics, let us introduce the return and correlation definitions. For a stock $i$, the price return ${R_i}(t')$ of time $t'$ is defined as the Logarithm return of the price $P_i(t')$ over one day,\n\n\n", "index": 1, "text": "\\begin{equation}\n{R_i}(t') = \\ln {P_i}(t') - \\ln {P_i}(t'-1)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{R_{i}}(t^{\\prime})=\\ln{P_{i}}(t^{\\prime})-\\ln{P_{i}}(t^{\\prime}-1)\" display=\"block\"><mrow><mrow><msub><mi>R</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>t</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>ln</mi><mo>⁡</mo><msub><mi>P</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>t</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>ln</mi><mo>⁡</mo><msub><mi>P</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>t</mi><mo>′</mo></msup><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01753.tex", "nexttext": "\n\nwhere ${\\sigma _i} = \\sqrt {\\langle R_i^2\\rangle  - {{\\langle {R_i}\\rangle }^2}}$. The stock correlation of the price return is defined as,\n\n\n", "itemtype": "equation", "pos": 6085, "prevtext": "\n\nThe normalized return ${r_i}(t')$ of stock $i$ is defined as,\n\n\n", "index": 3, "text": "\\begin{equation}\n{r_i}(t') = \\frac{{{R_i}(t') - \\langle {R_i}(t')\\rangle }}{{{\\sigma _i}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{r_{i}}(t^{\\prime})=\\frac{{{R_{i}}(t^{\\prime})-\\langle{R_{i}}(t^{\\prime})%&#10;\\rangle}}{{{\\sigma_{i}}}}\" display=\"block\"><mrow><mrow><msub><mi>r</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>t</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mrow><msub><mi>R</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>t</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>R</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>t</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow><msub><mi>σ</mi><mi>i</mi></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.01753.tex", "nexttext": "\n\nIn the past studies, the economic sectors have been widely investigated based on the random matrix theory \\cite{pan07,gop01,she09}.Business sectors can be identified for most mature markets, except for the Chinese stock market. The stocks of the Chinese stock market are identified by the ST and Blue-chip sectors \\cite{she09}. To understand how the geography affects the financial dynamics, here we apply the random matrix theory to revealing the geographical sector. Based on the stock correlations of the price returns in Eq. (3), the eigenvalues and eigenvectors of the correlation matrix $\\texttt{C}$ are analyzed. By searching for the dominant components in the eigenvectors of the first several largest eigenvalues, the geographical sectors can be identified.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{1.eps}\n\\caption{The absolute values of the eigenvectors $|u_i|$ are displayed for the first four\nlargest eigenvalues, with the left panel for the SH, and the right panel for the SZ. The stocks are arranged according to the stock locations, with the order of the location to be the Anhui province, Beijing,  Fujian  province, Gansu province, Guangdong province, Guangxi province, Guizhou province, Hainan province, Hebei province, Henan province, Heilongjiang province, Hubei province, Hunan province, Jilin province, Jiangsu province, Jiangxi province, Liaoning province, Neimenggu,\nNingxia, Qinghai province, Shandong province, Shanxi province, Shanxi province,\nShanghai, Sichuan province, Tianjin, Xizhang, Xinjiang, Yunnan province, Zhejiang province, and Chongqing. \\label{f4}}\n\\end{figure}\n\nAs shown in Fig. 1, the absolute values $|u_{i}|$ of the eigenvectors are displayed for the first four largest eigenvalues of the Shanghai and Shenzhen stock markets. For both markets, a uniform distribution is observed for the eigenvectors of the largest eigenvalue $\\lambda_0$. That is, similarly as the business sector \\cite{lal99, ple99}, the largest eigenvalue corresponds to some ''market mode'' for the geographical sector. However, for the second and third largest eigenvalues, it is observed that the stocks located in the Shanghai city dominate the Shanghai stock market, and the stocks located in the Guangdong province dominate the Shenzhen stock market, respectively. For the fourth largest eigenvalue $\\lambda_3$, one cannot find the significant component, i.e., no specific sector is identified. The results suggest that the stocks located in the Shanghai city and the Guangdong province play an important role in the Shanghai and Shenzhen stock market, which confirms the previous finding that the location of the stock market still has an essential impact on the financial dynamics.\n\n\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=12cm]{2.eps}\n\\caption{An illustration of the stock location after mapping is displayed for the SH and SZ in the left and right panel, respectively. \\label{f1}}\n\\end{figure}\n\n\\section*{Geographical correlation dynamics}\n\nFurther, the geography effect on the stock correlation dynamics is investigated. we make a two-dimensional map for the stock location. As shown in Fig. 2, all the stocks are mapped onto an $N \\times N$ lattice according to the stock location, with $N=10000$. The longitude ($Lon$) of the stock location is mapped onto the $x$-axis of the lattice, and the latitude ($Lat$) of the stock location is mapped onto the $y$-axis of the lattice. The $x$-axis and $y$-axis are uniformly divided by $N$, with the lattice interval of the $x$-axis and $y$-axis to be $l_x=\\frac{Max(Lon)-Min(Lon)}{N}$ and $l_y=\\frac{Max(Lat)-Min(Lat)}{N}$, respectively. If the longitude of the stock is in the $Min(Lon)+(n-1)l_x \\leq Lon < Min(Lon)+nl_x$, and the latitude of the stock is in the $Min(Lat)+(n-1)l_y \\leq Lat < Min(Lat)+nl_y$, the stock is then mapped onto the $n_{th}$ lattice, where $n=1,...,N$ is the geographical parameter.\n\nA geographical correlation (GC) is introduced to understand the geographical effect on the stock correlation dynamics, which is defined as,\n\n\n", "itemtype": "equation", "pos": 6333, "prevtext": "\n\nwhere ${\\sigma _i} = \\sqrt {\\langle R_i^2\\rangle  - {{\\langle {R_i}\\rangle }^2}}$. The stock correlation of the price return is defined as,\n\n\n", "index": 5, "text": "\\begin{equation}\n{c_{ij}} = \\langle {r_i}{r_j}\\rangle\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{c_{ij}}=\\langle{r_{i}}{r_{j}}\\rangle\" display=\"block\"><mrow><msub><mi>c</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msub><mi>r</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>r</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01753.tex", "nexttext": "\nwhere $R(n)$ is the $n \\times n$ lattice region, and $M$ is the number of stocks located in the region $R(n)$. That is, the geographical correlation is related to the geographical parameter $n$. Since the financial market experiences a big crisis around the year 2008, we investigate the geographical correlation for three stages, i.e., from Jan. 1, 2005 to Dec. 31, 2006 (2005-2006), Jan. 1, 2007 to Dec. 31, 2008 (2007-2008), and Jan. 1, 2009 to Dec. 31, 2010 (2009-2010). The year 2007-2008 corresponds to the financial crisis period, the year 2005-2006 is before the financial crisis, and the year 2009-2010 is after the financial crisis.\n\nThe geographical correlation $GC(n)$ on the geographical parameter $n$ is shown in Fig. 3. For the SH market, as $n$ is less than 7000, the geographical correlation $GC(n)$ decays with $n$ before and after the financial crisis, but increases with $n$ in the financial crisis time. As $n$ is greater than 7000, the geographical correlation $GC(n)$ then approaches to a steady state for all the three time periods. For the SZ market, as $n$ is less than 6000, the geographical correlation $GC(n)$ increases with $n$ before and after the financial crisis, but stays relatively stable at a high level in the financial crisis time. Similarly as the SH market, as $n$ is greater than 6000, the geographical correlation $GC(n)$ then approaches to a steady state for all the three time periods. One may find that the location of $n>7000$ and $n>6000$ corresponds to the northeast part of China. That is to say, the stock location has an impact on the market correlation, and the geographical correlation would approach stable as the company location moves to the northeast China. Moreover, for both markets, it is observed that the correlation of the year 2007-2008 is much higher than that of the year 2005-2006 and 2009-2010, and the correlation of the year 2009-2010 is also higher than that of the year 2005-2006. It suggests that, regardless of the location of the company, the stock correlation in the financial crisis period is much stronger than in the normal market period, and the high correlation may relax for a long time.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{3.eps}\n\\caption{The geographical correlation $GC(n)$ on the geographical parameter $n$ is displayed for the SH and SZ. The stars, circles and triangles are for the year 2005-2006, 2007-2008 and 2009-2010, respectively. \\label{f2}}\n\\end{figure}\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{4.eps}\n\\caption{The geographical correlation $GC(n)$ of the shuffled data on the geographical parameter $n$ is displayed, with the results being the average over 100 runs. The panels (a), (c), (e) are for the year 2005-2006, 2007-2008, 2009-2010 of the SH, and (b), (d), (f) are for the year 2005-2006, 2007-2008, 2009-2010 of the SZ, respectively. The stems suggest the error bar. \\label{f3}}\n\\end{figure}\n\nThe results are confirmed by calculating the geographical correlation of the shuffled data, which are generated by taking an average over a 100-run of shuffling procedure for the location of stocks. The geographical correlation $GC(n)$ on $n$ is shown in Fig. 4 for the shuffled data. Different from the original data, the $GC(n)$ is found to be stable for different geographical parameter $n$. It suggests that the stock location indeed has an impact on the market correlation. And the stock correlation in the financial crisis time is always higher than that before and after the financial crisis, which is also consistent with that observed in the real market data.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{5.eps}\n\\caption{The stock distance distributions are displayed for (a) the SH and (b) the SZ on a log-linear scale. The solid lines are the exponential fits.\\label{f5}}\n\\end{figure}\n\n\\section*{Distance effect on stock correlation}\n\nInternet shortens the distance of the world, and it becomes quite easy to access information. Then, should it change the geographical distance role in the stock markets, and should the long distance weaken the stock connections? To answer this question, we firstly investigate the stock distance distribution. The stock distance for the stock pairs inside each province is calculated. As shown in Fig. 5, a two-stage exponential decay of the distance distribution is observed for both the Shanghai and Shenzhen stock markets, with a crossover at about 87 kilometer for the SH and 102 kilometer for the SZ. For the distance less than the crossover point, the decay of the distribution is much faster than that of the distance greater than the crossover point. That is, the probability of the short distance is much greater than that of the long distance. The crossover phenomenon of the stock distance distribution indicates that the companies are prone to set their headquarters close to each other. The possible explanation could be that it is more convenient for companies to communicate for the short distance, while the long distance may hinder the communications.\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{6.eps}\n\\caption{The distance-dependent correlation $C(d)$ on the stock distance $d$ is displayed, with (a), (c), (e) for the year 2005-2006, 2007-2008, 2009-2010 of the SH, and (b), (d), (f) for the year 2005-2006, 2007-2008, 2009-2010 of the SZ, respectively. \\label{f6}}\n\\end{figure}\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{7.eps}\n\\caption{A similar figure as Fig. 6, but for the shuffled data. The stems suggest the error bar. \\label{f7}}\n\\end{figure}\n\nFurther, we study a distance-dependent correlation $C(d)$, which is defined as the average correlation for the stock pairs with the same distance,\n\n\n", "itemtype": "equation", "pos": 10462, "prevtext": "\n\nIn the past studies, the economic sectors have been widely investigated based on the random matrix theory \\cite{pan07,gop01,she09}.Business sectors can be identified for most mature markets, except for the Chinese stock market. The stocks of the Chinese stock market are identified by the ST and Blue-chip sectors \\cite{she09}. To understand how the geography affects the financial dynamics, here we apply the random matrix theory to revealing the geographical sector. Based on the stock correlations of the price returns in Eq. (3), the eigenvalues and eigenvectors of the correlation matrix $\\texttt{C}$ are analyzed. By searching for the dominant components in the eigenvectors of the first several largest eigenvalues, the geographical sectors can be identified.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{1.eps}\n\\caption{The absolute values of the eigenvectors $|u_i|$ are displayed for the first four\nlargest eigenvalues, with the left panel for the SH, and the right panel for the SZ. The stocks are arranged according to the stock locations, with the order of the location to be the Anhui province, Beijing,  Fujian  province, Gansu province, Guangdong province, Guangxi province, Guizhou province, Hainan province, Hebei province, Henan province, Heilongjiang province, Hubei province, Hunan province, Jilin province, Jiangsu province, Jiangxi province, Liaoning province, Neimenggu,\nNingxia, Qinghai province, Shandong province, Shanxi province, Shanxi province,\nShanghai, Sichuan province, Tianjin, Xizhang, Xinjiang, Yunnan province, Zhejiang province, and Chongqing. \\label{f4}}\n\\end{figure}\n\nAs shown in Fig. 1, the absolute values $|u_{i}|$ of the eigenvectors are displayed for the first four largest eigenvalues of the Shanghai and Shenzhen stock markets. For both markets, a uniform distribution is observed for the eigenvectors of the largest eigenvalue $\\lambda_0$. That is, similarly as the business sector \\cite{lal99, ple99}, the largest eigenvalue corresponds to some ''market mode'' for the geographical sector. However, for the second and third largest eigenvalues, it is observed that the stocks located in the Shanghai city dominate the Shanghai stock market, and the stocks located in the Guangdong province dominate the Shenzhen stock market, respectively. For the fourth largest eigenvalue $\\lambda_3$, one cannot find the significant component, i.e., no specific sector is identified. The results suggest that the stocks located in the Shanghai city and the Guangdong province play an important role in the Shanghai and Shenzhen stock market, which confirms the previous finding that the location of the stock market still has an essential impact on the financial dynamics.\n\n\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=12cm]{2.eps}\n\\caption{An illustration of the stock location after mapping is displayed for the SH and SZ in the left and right panel, respectively. \\label{f1}}\n\\end{figure}\n\n\\section*{Geographical correlation dynamics}\n\nFurther, the geography effect on the stock correlation dynamics is investigated. we make a two-dimensional map for the stock location. As shown in Fig. 2, all the stocks are mapped onto an $N \\times N$ lattice according to the stock location, with $N=10000$. The longitude ($Lon$) of the stock location is mapped onto the $x$-axis of the lattice, and the latitude ($Lat$) of the stock location is mapped onto the $y$-axis of the lattice. The $x$-axis and $y$-axis are uniformly divided by $N$, with the lattice interval of the $x$-axis and $y$-axis to be $l_x=\\frac{Max(Lon)-Min(Lon)}{N}$ and $l_y=\\frac{Max(Lat)-Min(Lat)}{N}$, respectively. If the longitude of the stock is in the $Min(Lon)+(n-1)l_x \\leq Lon < Min(Lon)+nl_x$, and the latitude of the stock is in the $Min(Lat)+(n-1)l_y \\leq Lat < Min(Lat)+nl_y$, the stock is then mapped onto the $n_{th}$ lattice, where $n=1,...,N$ is the geographical parameter.\n\nA geographical correlation (GC) is introduced to understand the geographical effect on the stock correlation dynamics, which is defined as,\n\n\n", "index": 7, "text": "\\begin{equation}\nGC(n) = \\frac{2}{M(M-1)}\\sum\\limits_{i,j \\in R(n)} {{c_{ij}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"GC(n)=\\frac{2}{M(M-1)}\\sum\\limits_{i,j\\in R(n)}{{c_{ij}}}\" display=\"block\"><mrow><mrow><mi>G</mi><mo>⁢</mo><mi>C</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>2</mn><mrow><mi>M</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>M</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mo>∈</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder><msub><mi>c</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01753.tex", "nexttext": "\n\nFigure 6 shows the distance-dependent correlation $C(d)$ on the stock distance for the three periods, i.e., before, in and after the financial crisis. It is observed that the $C(d)$ decays with the stock distance before the financial crisis, but is independent of the stock distance in and after the financial crisis. That is to say, in the normal financial stage, the stocks located close to each other have a more compact correlation than those located far way. But the distance effect disappears when the market encounters the financial crisis. To confirm the results, the dependence of the stock correlation on the stock distance is also investigated for the shuffled series. As shown in Fig. 7, the $C(d)$ of the shuffled data is observed to keep stable for different stock distances even in the normal market stage of the year 2005-2006, which is different from the results of the real market.\n\n\n\\section*{Conclusion}\n\nThe geography and distance effect on financial dynamics is investigated, based on the daily data of the individual stocks of the Chinese stock market. The financial center is found to still play an important role in stock dynamics, and the stocks located in the Shanghai city and the Guangdong province contribute greatly to the Shanghai and Shenzhen stock markets, respectively. The geographical correlation is introduced, which is found to be less fluctuated as the stock location moves to the northeast China. The stock distance distribution is studied, and is observed to obey a two-stage exponential decay, indicating that the companies incline to set their headquarters close to each other. Moreover, the stock distance is found to affect the stock correlation only in the normal market environment, but rarely influence the stock correlation in and after the financial crisis.\n\n\\bigskip\n{\\textbf{Acknowledgments:}}\n\nThis work was partially supported by the National Natural Science Foundation of China (Grant Nos. 11175079, 71371165 and 11505099), and the Jiangxi Provincial Young Scientist Training Project under Grant No. 20133BCB23017.\n\n\n\\begin{thebibliography}{36}\n\\bibitem{man95} R. N. Mantegna, H. E. Stanley, {\\it Nature} {\\bf 376} (1995) 46.\n\\bibitem{gop99} P. Gopikrishnan, V. Plerou, L. A. N. Amaral,  H. E. Stanley, {\\it Phys. Rev.} E {\\bf 60} (1999) 5305.\n\\bibitem{liu99} Y. Liu,  P. Gopikrishnan, P. Cizeau, M. Meyer, C. K. Peng, H. E. Stanley, {\\it Phys. Rev. E}  {\\bf 60} (1999) 1390.\n\\bibitem{gu08} G.F. Gu, W. Chen, W.X. Zhou, {\\it Physica A} {\\bf 387} (2008) 495.\n\\bibitem{gab03} X. Gabaix, P. Gopikrishnan, V. Plerou,  H. E. Stanley, {\\it Nature}  {\\bf 423} (2003) 267.\n\\bibitem{ren10}  F. Ren, W. X. Zhou, {\\it New J. of Phys.} {\\bf 12} (2010) 075030.\n\\bibitem{mis10}  J. Miskiewicz, M. Ausloos, {\\it Physica A} {\\bf 389} (2010) 797.\n\\bibitem{zha11} L. Zhao,  G. Yang, W. Wang, Y. Chen, J. P. Huang, H. Ohashi, H. E. Stanley, {\\it Proc. Natl. Acad. Sci. USA}\n{\\bf 108} (2011) 15058.\n\\bibitem{qiu12} T. Qiu, G. Chen, L. X. Zhong, X. R. Wu, {\\it Physica A} {\\bf 391} (2012) 2656.\n\\bibitem{pod09} B. Podobnik, D. Horvatic, A. M. Petersen, H. E. Stanley, {\\it Proc. Natl. Acad. Sci. USA} {\\bf 106} (2009) 22079.\n\\bibitem{ava14}  A. Avakian, B. Podobnik, M. Piskor, H. E. Stanley, {\\it Phys Rev.} E {\\bf 89} (2014) 032805.\n\\bibitem{cur14}  C. Curme, T. Preis, H. E. Stanley, H. S. Moat, {\\it Proc. Natl. Acad. Sci. USA} {\\bf 111} (2014) 11600.\n\\bibitem{ken15}  D. Y. Kenett, X. Huang, I. Vodenska, S. Havlin, H. E. Stanley, {\\it Quantitative Finance} {\\bf 15} (2015) 569.\n\n\\bibitem{qia15}  X. Y. Qian, Y. M. Liu, Z. Q. Jiang, B. Podobnik, W. X. Zhou, H. E. Stanley, {\\it Phys. Rev.} E {\\bf 91} (2015) 062816.\n\n\\bibitem{qiu08} T. Qiu , L. Guo, G. Chen, {\\it Physica A} {\\bf 387} (2008) 6812.\n\\bibitem{yam05} K. Yamasaki, L. Muchnik, S. Havlin, A. Bunde, H. E. Stanley {\\it Proc. Natl. Acad. Sci. U.S.A} {\\bf 102} (2005) 9424.\n\\bibitem{wan08} F. Z. Wang, K. Yamasaki, S. Havlin, H. E. Stanley {\\it Phys. Rev. E} {\\bf 77} (2008) 016109.\n\\bibitem{jun08} W. S. Jung, F. Z. Wang, S. Havlin, T. Kaizoji, H. T. Moon, H. E. Stanley {\\it Eur. Phys. J. B} {\\bf 62} (2008) 113.\n\\bibitem{gia01} I. Giardina, J. P. Bouchaud, M. Mezard, {\\it Physica A} {\\bf 299} (2001) 28.\n\\bibitem{son11} D. M. Song, M. Tumminello, W. X. Zhou, R. N. Mantegna, {\\it Phys. Rev.} E {\\bf 84} (2011) 026108.\n\\bibitem{men14} H. Meng, W. J. Xie, Z. Q. Jiang, B. Podobnik, W. X. Zhou, H. E. Stanley, {\\it Scientific Reports } {\\bf 4} (2014) 3566.\n\n\\bibitem{egu00} V. M. Eguiluz, M. G. Zimmermann, {\\it Phys. Rev. Lett.} {\\bf 85} (2000) 5659.\n\\bibitem{gu09} G. F. Gu, W. X. Zhou, {\\it EPL} {\\bf 86} (2009) 48002.\n\\bibitem{che13} J. J. Chen, B. Zheng, L. Tan, {\\it PLoS ONE} {\\bf 8} (2013) e79531.\n\\bibitem{qiu10} T. Qiu, B. Zheng, G. Chen, {\\it New J. Phys.} {\\bf 12} (2010) 043057.\n\\bibitem{hua15a} J. P. Huang, {Experimental Econophysics: Properties and Mechanisms of Laboratory Markets}, {\\it Springer } (2015).\n\\bibitem{hua15b} J. P. Huang, {\\it Physics Reports } {\\bf 564} (2015) 1.\n\n\\bibitem{cas89} M. Castells, {The Informational City}, {\\it Blackwell, Oxford } (1989).\n\\bibitem{ohm95a} K. Ohmae, {The Evolving Global Economy}, {\\it Harvard Business Review Books, Cambridge, MA } (1995) .\n\\bibitem{ohm95b} K. Ohmae, {The End of the Nation-State: The Rise of Regional Economies}, {\\it Harper Collins, London} (1995) .\n\\bibitem{kob97} S. J. Kobrin, {Electronic Cash and the End of National Markets}, {\\it Foreign Policy (Summer)} (1997) 65-77.\n\\bibitem{ber97} B. J. L. Berry, E. C. Conkling, D. M. Ray, {The Global Economy in Transition, second ed.}, {\\it Prentice Hall} (1997).\n\\bibitem{zha04} S. X. B. Zhao, L. Zhang, D. T. Wang, {\\it Geoforum} {\\bf 35} (2004) 577.\n\\bibitem{por05} R. Portes, H. Rey, {\\it Journal of International Economics} {\\bf 65} (2005) 269.\n\\bibitem{agg09} R. Aggarwal, C. Kearney, B. Lucey {\\it Manuscript, FMA Annual Meeting} { } (2009).\n\\bibitem{luc10} B. M. Lucey, Q. Y. Zhang, {\\it Emerging Markets Review} {\\bf 11} (2010) 62.\n\\bibitem{pan07} R. K. Pan, S. Sinha {\\it Phys. Rev.} E {\\bf 76} (2007) 046116.\n\\bibitem{she09} J. Shen, B. Zheng {\\it Europhys. Lett.} {\\bf 86} (2009) 48005.\n\\bibitem{gop01} P. Gopikrishnan, B. Rosenow, V. Plerou, H. E. Stanley, {\\it Phys. Rev.} E {\\bf 64} (2001) 035106.\n\\bibitem{lal99} L. Laloux, P. Cizeau, J. P. Bouchaud, M. Potters, {\\it Phys. Rev. Lett.} {\\bf 83} (1999 ) 1467.\n\\bibitem{ple99} V. Plerou, P. Gopikrishnan, B. Rosenow, L. A. N. Amaral and H. E. Stanley,  {\\it Phys. Rev. Lett.} {\\bf 83} (1999) 1471.\n\n\n\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 16320, "prevtext": "\nwhere $R(n)$ is the $n \\times n$ lattice region, and $M$ is the number of stocks located in the region $R(n)$. That is, the geographical correlation is related to the geographical parameter $n$. Since the financial market experiences a big crisis around the year 2008, we investigate the geographical correlation for three stages, i.e., from Jan. 1, 2005 to Dec. 31, 2006 (2005-2006), Jan. 1, 2007 to Dec. 31, 2008 (2007-2008), and Jan. 1, 2009 to Dec. 31, 2010 (2009-2010). The year 2007-2008 corresponds to the financial crisis period, the year 2005-2006 is before the financial crisis, and the year 2009-2010 is after the financial crisis.\n\nThe geographical correlation $GC(n)$ on the geographical parameter $n$ is shown in Fig. 3. For the SH market, as $n$ is less than 7000, the geographical correlation $GC(n)$ decays with $n$ before and after the financial crisis, but increases with $n$ in the financial crisis time. As $n$ is greater than 7000, the geographical correlation $GC(n)$ then approaches to a steady state for all the three time periods. For the SZ market, as $n$ is less than 6000, the geographical correlation $GC(n)$ increases with $n$ before and after the financial crisis, but stays relatively stable at a high level in the financial crisis time. Similarly as the SH market, as $n$ is greater than 6000, the geographical correlation $GC(n)$ then approaches to a steady state for all the three time periods. One may find that the location of $n>7000$ and $n>6000$ corresponds to the northeast part of China. That is to say, the stock location has an impact on the market correlation, and the geographical correlation would approach stable as the company location moves to the northeast China. Moreover, for both markets, it is observed that the correlation of the year 2007-2008 is much higher than that of the year 2005-2006 and 2009-2010, and the correlation of the year 2009-2010 is also higher than that of the year 2005-2006. It suggests that, regardless of the location of the company, the stock correlation in the financial crisis period is much stronger than in the normal market period, and the high correlation may relax for a long time.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{3.eps}\n\\caption{The geographical correlation $GC(n)$ on the geographical parameter $n$ is displayed for the SH and SZ. The stars, circles and triangles are for the year 2005-2006, 2007-2008 and 2009-2010, respectively. \\label{f2}}\n\\end{figure}\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{4.eps}\n\\caption{The geographical correlation $GC(n)$ of the shuffled data on the geographical parameter $n$ is displayed, with the results being the average over 100 runs. The panels (a), (c), (e) are for the year 2005-2006, 2007-2008, 2009-2010 of the SH, and (b), (d), (f) are for the year 2005-2006, 2007-2008, 2009-2010 of the SZ, respectively. The stems suggest the error bar. \\label{f3}}\n\\end{figure}\n\nThe results are confirmed by calculating the geographical correlation of the shuffled data, which are generated by taking an average over a 100-run of shuffling procedure for the location of stocks. The geographical correlation $GC(n)$ on $n$ is shown in Fig. 4 for the shuffled data. Different from the original data, the $GC(n)$ is found to be stable for different geographical parameter $n$. It suggests that the stock location indeed has an impact on the market correlation. And the stock correlation in the financial crisis time is always higher than that before and after the financial crisis, which is also consistent with that observed in the real market data.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{5.eps}\n\\caption{The stock distance distributions are displayed for (a) the SH and (b) the SZ on a log-linear scale. The solid lines are the exponential fits.\\label{f5}}\n\\end{figure}\n\n\\section*{Distance effect on stock correlation}\n\nInternet shortens the distance of the world, and it becomes quite easy to access information. Then, should it change the geographical distance role in the stock markets, and should the long distance weaken the stock connections? To answer this question, we firstly investigate the stock distance distribution. The stock distance for the stock pairs inside each province is calculated. As shown in Fig. 5, a two-stage exponential decay of the distance distribution is observed for both the Shanghai and Shenzhen stock markets, with a crossover at about 87 kilometer for the SH and 102 kilometer for the SZ. For the distance less than the crossover point, the decay of the distribution is much faster than that of the distance greater than the crossover point. That is, the probability of the short distance is much greater than that of the long distance. The crossover phenomenon of the stock distance distribution indicates that the companies are prone to set their headquarters close to each other. The possible explanation could be that it is more convenient for companies to communicate for the short distance, while the long distance may hinder the communications.\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{6.eps}\n\\caption{The distance-dependent correlation $C(d)$ on the stock distance $d$ is displayed, with (a), (c), (e) for the year 2005-2006, 2007-2008, 2009-2010 of the SH, and (b), (d), (f) for the year 2005-2006, 2007-2008, 2009-2010 of the SZ, respectively. \\label{f6}}\n\\end{figure}\n\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=10cm]{7.eps}\n\\caption{A similar figure as Fig. 6, but for the shuffled data. The stems suggest the error bar. \\label{f7}}\n\\end{figure}\n\nFurther, we study a distance-dependent correlation $C(d)$, which is defined as the average correlation for the stock pairs with the same distance,\n\n\n", "index": 9, "text": "\\begin{equation}\n{C(d)} = \\langle c_{ij}|d \\rangle\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{C(d)}=\\langle c_{ij}|d\\rangle\" display=\"block\"><mrow><mrow><mi>C</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>d</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>c</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">|</mo><mi>d</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow></math>", "type": "latex"}]