[{"file": "1601.03406.tex", "nexttext": "\nThis mass distribution has a harmonic core, consistent with the gently\nrising rotation curves in late-type galaxies of lower luminosity\n\\citep[{\\it e.g.}][]{CF85, Cati06, THINGS}.  Since the density declines as\n$r^{-5}$ when $r \\gg a$, where $a$ is the core radius, the function\ncould not represent an extended halo.  However, the models allow us to\nstudy the linear stability of a disk embedded in a live spherical\ncomponent whose velocity anisotropy can be varied.  It clearly cannot\ncapture secular angular momentum exchanges between bars and extensive\nhalos \\citep{Wein85, DS00}; this behavior is included in experiments\ndescribed in a later paper \\citep{SB15}.\n\n\\citet{Dejo87} gives expressions (in terms of hypergeometric\nfunctions) for the DF, characterized by a parameter $q$ that is\nrelated to the usual anisotropy parameter \\citep{BT08} as:\n\n", "itemtype": "equation", "pos": 6272, "prevtext": "\n\n\\title{Bar instability in disk-halo systems}\n\n\\author{J. A. Sellwood}\n\n\\affil{Department of Physics and Astronomy, Rutgers University, 136\n  Frelinghuysen Road, Piscataway, NJ 08854, USA}\n\n\\begin{abstract}\nWe show that the exponential growth rate of a bar in a stellar disk is\nsubstantially greater when the disk is embedded in a live halo than in\na rigid one having the same mass distribution.  We also find that the\nvigor of the instability in disk-halo systems varies with the shape of\nthe halo velocity ellipsoid.  Disks in rigid halos that are massive\nenough to be stable by the usual criteria, quickly form bars in\nisotropic halos and much greater halo mass is needed to avoid a strong\nbar; thus stability criteria derived for disks in rigid halos do not\napply when the halo is responsive.  The study presented here is of an\nidealized family of models with near uniform central rotation and that\nlack an extended halo; we present more realistic models with extended\nhalos in a companion paper.  The puzzle presented by the absence of\nstrong bars in some galaxies having gently rising inner rotation\ncurves is compounded by the results presented here.\n\\end{abstract}\n\n\\keywords{ galaxies: kinematics and dynamics -- galaxies: spiral --\n  galaxies: structure}\n\n\n\n\n\\section{Introduction} \\label{sec:intro}\n\n\nIt has long been known that the dominant dynamical instability of\nmassive stellar disks leads to the formation of a strong bar\n\\citep{MPQ70, Hohl71, Kaln72, Kaln77, Jala07}.  The mode is an\nexponentiating standing wave between two reflection points: corotation\nwhere traveling waves are strongly amplified as they swing from\nleading to trailing \\citep{GLB65, JT66}, and the disk center where an\ningoing trailing wave reflects into an outgoing leading wave.\n\\citet{Toom81}, who elucidated this mechanism for the bar mode, also\nargued that the instability could be quelled in at least two ways.\nToomre's preferred method was to interrupt feedback through the\ncenter, perhaps by ensuring that the waves are damped at an inner\nLindblad resonance \\citep[ILR,][]{Mark74}, which should be present if\nthe galaxy has a dense bulge, for example.  This feature accounts for\nthe remarkable linear stability of the Mestel, and other self-similar,\ndisks \\citep{Zang76, ER98}.  High-quality simulations \\citep{Sell89,\n  SM99, SE01} of massive disks having dense centers do indeed avoid\nbar-formation, as predicted by linear theory, but an ultra-responsive\ndisk can amplify even a modest level of noise to such an extent that\nthe linear theory expectation of damping at resonances can be\noverwhelmed, and particles become trapped into a bar through a\nnon-linear instability.  Thus, this stabilizing method may not always\nbe effective, especially in a galaxy that experiences a strong\nperturbation.  Random motions make the disk less responsive, and\ngenerally contribute to stability \\citep[{\\it e.g.}][]{AS86}.\n\nIt is indeed true that the bar instability is quelled when the disk is\nimmersed in a massive, unresponsive spheroidal component.  The effect\nof the extra central attraction is to shorten the preferred wavelength\nof gravitationally-driven disturbances in the disk until bi-symmetric\ndisturbances become no more than mild kinematic waves that can no\nlonger extract much amplification from the global potential well of\nthe galaxy \\citep{Toom81, BT08}.  This is the basis of several\nwell-known stability criteria \\citep{OP73, ELN82, CST95}.\n\nHowever, these criteria assume the halo is unresponsive, and here we\nshow that a responsive halo encourages the bar instability in disks,\nand that these stability criteria are inadequate when the disk is\nimmersed in a live halo.  A hint of a more vigorous bar instability\nmay have been present in the simulations reported by \\citet{AM02} and\nby \\citet{MVSH06}, but the focus of those papers was on the surprising\nsecular growth of the bars, which grew to encompass most of the disk.\nHere we find that, for models of isolated disk galaxies that do not\nhave a high central density, the disk-halo system possesses a unstable\nbar-forming mode that remains quite vigorous unless the disk has very\nlow mass or the velocity distribution of the halo is strongly radially\nbiased.\n\nIn order to develop an understanding of the instability, we focus on\nthe linear modes of highly idealized models of unstable disks that\nstart out axisymmetric and form bars, which is clearly a situation\nthat is unlikely to arise in nature.  In addition, the halos of our\nmodels are not at all extended, a choice that enabled the use of\nanisotropic velocity distributions and also excluded the complications\ncaused by secular bar growth.  \\citet{SB15} present slightly more\nrealistic simulations having extended halos in which disk mass rises\nthrough slow infall and find that models lacking a central mass\nconcentration continue to manifest similar behavior.\n\n\n\\section{Model set up} \\label{sec.setup}\n\n\nWe wish to create equilibrium, axisymmetric, disk-halo models with no\nbulge, in which the shape of the velocity ellipsoid of the halo\nparticles can be varied. \n\n\n\\subsection{Halo and disk}\n\n\nThe requirement that the halo distribution function (DF) be\nanisotropic is particularly limiting, since many available methods to\ncreate equilibrium halos in the presence of a disk assume an isotropic\nhalo DF.  However, if we choose a spherical halo for which anisotropic\nDFs are known, we can use the adiabatic invariance of actions to\ndetermine the equilibrium DF of the halo after an additional mass\ncomponent has built up, as originally set out by \\citet{Youn80}.\n\\citet{SM05} gave a full description of the method for halo\ncompression and showed that a spherical approximation is entirely\nadequate, even when the compressing component is a disk that is\nheavier than those used here.  If the DF of the uncompressed model was\noriginally a function of just two integrals, the DF of the compressed\nspherical halo remains a function of two actions: the radial action\nand total angular momentum.\n\nWe require a spherical model with known anisotropic DFs that also\nlacks a density cusp.  From this very limited selection \\citep{BT08},\nwe have chosen the family of anisotropic models given by\n\\citet{Dejo87} for the Plummer sphere, which has the density profile\n\n", "index": 1, "text": "\\begin{equation}\n\\rho(r) = {3M_P \\over 4\\pi a^3}\\left[1 + \\left({r \\over\n    a}\\right)^2\\right]^{-5/2}.\n\\label{eq.Plum}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\rho(r)={3M_{P}\\over 4\\pi a^{3}}\\left[1+\\left({r\\over a}\\right)^{2}\\right]^{-5%&#10;/2}.\" display=\"block\"><mrow><mrow><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>M</mi><mi>P</mi></msub></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi>a</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>(</mo><mfrac><mi>r</mi><mi>a</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mrow><mn>5</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03406.tex", "nexttext": "\nThe DF is positive or zero for all bound values of the specific\nenergy, $E$, and allowed specific total angular momentum, $L$, when\n$-\\infty < q \\leq 2$.  These halos, which have no net angular\nmomentum, are isotropic when $q=0$, radially biased when $q>0$ and\ntangentially biased when $q<0$, with $q=-\\infty$ giving a sphere\ncomposed of entirely circular orbits.  All models with finite $q$\nbecome isotropic as $r/a \\rightarrow 0$; anisotropy increases rapidly\noutwards and is already half its asymptotic value by $r=a$.  The\nmaximal radial bias is for $q=2$, where $\\beta \\rightarrow 1$ for $r\n\\gg a $.  We use just three different halo DFs in this work: $q=0$\n(isotropic), $q=2$ (maximal radial bias), and $q=-15$ (strong\ntangential bias).\n\nSimulations of an isolated Plummer sphere with $q=2$ revealed that it\nsuffers from a radial orbit instability.  The growth rate, $\\sim\n0.015(GM_P/a^3)^{1/2}$, was low but the outer halo became strongly\nprolate by $t\\sim 300(a^3/GM_P)^{1/2}$ in a model with $10^6$\nparticles.  We continue to use initially spherical models that are\ncompressed by the disk, and allow them to evolve self-consistently.\n\nWhen compressed by a disk, the spherical density profile is changed,\nof course, and \\citet{SM05} used this family of anisotropic models to\nillustrate how compressibility of a halo varied with radial bias,\nfinding, as expected, that halo compression was reduced as radial\npressure rises.  The models in this paper have lower disk masses,\nhowever, and compression has a minor effect on the density and a\nnegligible effect on the shape of the velocity ellipsoid.\n\nWe insert an exponential disk of surface density\n\n", "itemtype": "equation", "pos": 7258, "prevtext": "\nThis mass distribution has a harmonic core, consistent with the gently\nrising rotation curves in late-type galaxies of lower luminosity\n\\citep[{\\it e.g.}][]{CF85, Cati06, THINGS}.  Since the density declines as\n$r^{-5}$ when $r \\gg a$, where $a$ is the core radius, the function\ncould not represent an extended halo.  However, the models allow us to\nstudy the linear stability of a disk embedded in a live spherical\ncomponent whose velocity anisotropy can be varied.  It clearly cannot\ncapture secular angular momentum exchanges between bars and extensive\nhalos \\citep{Wein85, DS00}; this behavior is included in experiments\ndescribed in a later paper \\citep{SB15}.\n\n\\citet{Dejo87} gives expressions (in terms of hypergeometric\nfunctions) for the DF, characterized by a parameter $q$ that is\nrelated to the usual anisotropy parameter \\citep{BT08} as:\n\n", "index": 3, "text": "\\begin{equation}\n\\beta \\equiv 1 - {\\sigma_\\phi^2 \\over \\sigma_r^2} = 1 - {\\sigma_\\theta^2\n  \\over \\sigma_r^2} = {qr^2 \\over 2(a^2+r^2)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\beta\\equiv 1-{\\sigma_{\\phi}^{2}\\over\\sigma_{r}^{2}}=1-{\\sigma_{\\theta}^{2}%&#10;\\over\\sigma_{r}^{2}}={qr^{2}\\over 2(a^{2}+r^{2})}.\" display=\"block\"><mrow><mrow><mi>β</mi><mo>≡</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msubsup><mi>σ</mi><mi>ϕ</mi><mn>2</mn></msubsup><msubsup><mi>σ</mi><mi>r</mi><mn>2</mn></msubsup></mfrac></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msubsup><mi>σ</mi><mi>θ</mi><mn>2</mn></msubsup><msubsup><mi>σ</mi><mi>r</mi><mn>2</mn></msubsup></mfrac></mrow><mo>=</mo><mfrac><mrow><mi>q</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>a</mi><mn>2</mn></msup><mo>+</mo><msup><mi>r</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03406.tex", "nexttext": "\nWe limit the extent of the disk by tapering the surface density with a\nfunction that varies as a cubic polynomial from unity at $R=4.5R_d$ to\nzero at $R=5R_d$.  The disk has a Gaussian density profile in the\nvertical direction with $z_0=0.1R_d$.\n\nThis family of disk-halo models therefore has two further parameters,\nthe ratio of halo to disk mass, $M_P/M_d$, and ratio of the disk scale\nlength $R_d$ to the halo core radius $a$.  We have experimented with\nhalo masses in the range $1 \\leq M_P/M_d \\leq 5$ and keep $a = 1.5R_d$\nfor the reason given below.\n\n\n\\subsection{Initial velocities}\n\n\nTo make the halo finite, we adopt a maximum energy of halo particles\nequal to the potential in the disk plane at $r = 8a$ and select halo\nparticles with energies less than this from the compressed halo DF in\nthe manner described by \\citet[][Appendix A]{DS00}.  The rapid density\ndecline when $r \\gg a$ (eq.~\\ref{eq.Plum}) implies that just a few\npercent of the total mass is eliminated by our energy bound, and the\nhalo is in excellent equilibrium in the combined potential of the disk\nand halo.\n\nWe set the disk particles in orbital motion, add random speeds such\nthat Toomre's $Q=1.5$, and use the Jeans equations in the local\napproximation to set initial in-plane and vertical velocity balance\nfor the disk particles in the numerically-computed gravitational field\nof the total mass distribution.  As the disk mass generally\ncontributes a moderate fraction at most of the central attraction, the\nJeans equations yield a disk that is also in excellent initial\nequilibrium.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{rotcur.ps}\n\\end{center}\n\\caption{The radial variation of the circular speed in a series of\n  models with differing halo masses.  The unchanging disk contribution\n  is shown by the dotted line, while the full drawn curves are for\n  $M_P/M_d = 1$, 2, 3, 4, and 5.}\n\\label{fig.rotcur}\n\\end{figure}\n\nFigure~\\ref{fig.rotcur} shows the rotation curves of five of our\nmodels with differing halo masses.  The dotted curve shows the disk\ncontribution computed from the finitely thick and tapered disk, which\nis the same for all cases.  The shapes of the rotation curves are\nlittle affected by the mass of the halo, which was the reason for\nchoosing $a = 1.5R_d$.\n\n\\citet{Sack97} defined a maximum disk as one for which\n$\\left(V_d/V_{\\rm tot}\\right)^2 \\ga 0.85$ at the radius at which the\ndisk contribution peaks.  The models shown in Fig.~\\ref{fig.rotcur}\nare all therefore strongly submaximal since, at $R=2R_d$, they have\n$\\left(V_d/V_{\\rm tot}\\right)^2 = 0.476$, 0.336, 0.264, 0.219, and\n0.187 respectively for $M_P/M_d = 1$, 2, 3, 4, and 5.\n\nThe decrease of the circular speed at large radii is a consequence of\nour adopted Plummer halo.  While some results in this study would\nprobably be changed were a more extensive halo to be used, as we note\nin places, it seems ikely that a supporting response to the linear\ninstability that forms the initial bars (the principal result\npresented below) would be provided by any reasonable live halo.  In\nfact, the absence of an extended halo is an advantage, since it\nenables us to study the dynamical instability that forms the bar,\nwithout the complication of secular bar growth and braking caused by\ndynamical friction with an extended halo.\n\nAll the rotation curves rise nearly linearly from zero at the center,\nand this lack of shear in the inner parts is highly unfavorable for\nspiral arm development by swing amplification, as \\citet{SC84}\nreported.  Thus our strongly submaximal models in rigid halos do not\nmanifest multi-arm spirals of the kind found in other simulations of\nsubmaximal disks with more general rotation curve shapes\n\\citep[{\\it e.g.}][]{Fuji11, GKC12}.\n\nHenceforth, we adopt $M_d$ as our unit of mass, $R_d$, as our unit of\nlength and set $G=1$.  Consequently, a dynamical time is\n$(R_d^3/GM_d)^{1/2}$ and the velocity unit is $(GM_d/R_d)^{1/2}$.\nSince we have smaller disk galaxies, such as M33, in mind, we suggest\na scaling to physical units that sets $R_d = 1.4\\;$kpc \\citep{RV94}\nand $t_0 = 15\\;$Myr, which implies $M_d = 2.7 \\times\n10^{9}\\;$M$_\\odot$ and velocities scale as $(GM/R_d)^{1/2} \\simeq\n91\\;$km/s.  Thus the velocity rise to the peak shown in\nFig.~\\ref{fig.rotcur} roughly matches the inner rotation curve of M33\n\\citep{Kam15}.\n\n\n\\subsection{Numerical procedure}\n\n\nWe use the hybrid $N$-body code described by \\citet[][Appendix\n  B]{Sell03}, in which the gravitational field is computed with the\naid of two grids: a 3D cylindrical polar grid for the disk component,\nand a spherical grid for the halo component with a surface harmonic\nexpansion on each grid shell.  A comprehensive description of our\nnumerical methods is given in an on-line manual \\citep{Sell14}.\n\nWe generally use $10^6$ particles to represent each component, a time\nstep $\\delta t = 0.01$ dynamical times, include sectoral harmonics\n$0\\leq m \\leq 8$ in the force determination on the cylindrical polar\ngrid, where the cubic spline softening \\citep{Mona92} length is\n$0.2R_d$, and surface harmonics $0 \\leq l \\leq 4$ on the spherical\ngrid.  Aside from a time offset caused by a different seed amplitude,\nwe found the evolution was unaffected when the numbers of disk and\nhalo particles were varied over the range $10^5 \\leq N \\leq 10^7$, but\n$N=10^4$ was clearly inadequate.  We also verified that moderate\nchanges to the time step and grid size have little effect on the\noutcome of the simulations.\n\nWe recentered the grids on the particle centroid every 16 time steps,\nsince an offset between the particle distribution and the center of\nour polar grids could lead to numerical artifacts.  As a further\ncheck, we reran one case using a Cartesian grid, which has no\npreferred center and has adequate resolution for these models that do\nnot have a high central density, and once again the evolution followed\nthe same path.\n\n\n\\section{Bar growth}\n\n\\subsection{Halo anisotropy}\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{baramp.ps}\n\\end{center}\n\\caption{The evolution of four models with almost identical mass\n  distributions, with $M_P/M_d=3$, but having different DFs for the\n  halo.  The top panel shows the evolution of the bar amplitude in the\n  disk component; the red curve is for an tangentially biased halo DF,\n  the green for an isotropic halo, the blue for a radially biased halo\n  DF, and the cyan for a rigid halo.  The dashed horizontal line is\n  the expected value of the ordinate if the particles were distributed\n  at random in a axisymmetric disk.  The middle panel shows the time\n  evolution of the torque exerted by the disk on the live halo,\n  colored as in the top panel.  The bottom panel shows the initial and\n  final halo density profiles for the three live halo models.}\n\\label{fig.baramp}\n\\end{figure}\n\nThe top panel in Figure~\\ref{fig.baramp} shows the evolution of the\nbar amplitude in the disk in four models having almost identical mass\ndistributions, but having different DFs for the halo.  The quantity\nplotted is the ratio $A_2/A_0$, where\n\n", "itemtype": "equation", "pos": 9064, "prevtext": "\nThe DF is positive or zero for all bound values of the specific\nenergy, $E$, and allowed specific total angular momentum, $L$, when\n$-\\infty < q \\leq 2$.  These halos, which have no net angular\nmomentum, are isotropic when $q=0$, radially biased when $q>0$ and\ntangentially biased when $q<0$, with $q=-\\infty$ giving a sphere\ncomposed of entirely circular orbits.  All models with finite $q$\nbecome isotropic as $r/a \\rightarrow 0$; anisotropy increases rapidly\noutwards and is already half its asymptotic value by $r=a$.  The\nmaximal radial bias is for $q=2$, where $\\beta \\rightarrow 1$ for $r\n\\gg a $.  We use just three different halo DFs in this work: $q=0$\n(isotropic), $q=2$ (maximal radial bias), and $q=-15$ (strong\ntangential bias).\n\nSimulations of an isolated Plummer sphere with $q=2$ revealed that it\nsuffers from a radial orbit instability.  The growth rate, $\\sim\n0.015(GM_P/a^3)^{1/2}$, was low but the outer halo became strongly\nprolate by $t\\sim 300(a^3/GM_P)^{1/2}$ in a model with $10^6$\nparticles.  We continue to use initially spherical models that are\ncompressed by the disk, and allow them to evolve self-consistently.\n\nWhen compressed by a disk, the spherical density profile is changed,\nof course, and \\citet{SM05} used this family of anisotropic models to\nillustrate how compressibility of a halo varied with radial bias,\nfinding, as expected, that halo compression was reduced as radial\npressure rises.  The models in this paper have lower disk masses,\nhowever, and compression has a minor effect on the density and a\nnegligible effect on the shape of the velocity ellipsoid.\n\nWe insert an exponential disk of surface density\n\n", "index": 5, "text": "\\begin{equation}\n\\Sigma(R) = {M_d \\over 2\\pi R_d^2} e^{-R/R_d}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\Sigma(R)={M_{d}\\over 2\\pi R_{d}^{2}}e^{-R/R_{d}}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>M</mi><mi>d</mi></msub><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>R</mi><mi>d</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>R</mi><mo>/</mo><msub><mi>R</mi><mi>d</mi></msub></mrow></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03406.tex", "nexttext": "\nwhere $\\mu_j$ is the mass and $\\phi_j(t)$ the cylindrical polar angle\nof the $j$-th particle at time $t$, and the summation includes only\ndisk particles.  A straight line in this log-linear plot would be the\nsignature of exponential growth; periodic modulations may indicate\nbeats between two waves rotating with different pattern speeds.\n\nThe disk embedded in a rigid halo, cyan line, possesses very slowly\ngrowing, coherent bi-symmetric instabilities (see \\S\\ref{sec.modes}),\ncausing the value of $A_2/A_0$ to rise slowly, by a factor $\\sim 10$\nover the duration of the simulation.  However, the bar amplitude grows\nmore rapidly in all three cases with live halos, and the behavior\ndiffers remarkably with the nature of the halo DF.  The disk bar\nbecomes strongest in the tangentially biased halo ($q=-15$, red curve),\nwhile slower bar growth occurs for the radially biased ($q=2$, blue\ncurve) halo DF.  The isotropic halo ($q=0$, green curve) is\nintermediate.\n\nNotice that the value of $A_2/A_0$ reaches $\\sim 0.4$ for the\ntangentially biased (red) and isotropic (green) models.  These two\nbars become extremely strong inside $R\\la3R_d$, where density\nvariations from peak to trough are almost 100\\%.  The value of\n$A_2/A_0 \\ga 0.1$ for the bar when the halo is radially biased halo\n(blue) is still visually discernible as an oval distortion to the\ninner disk by $t=800$.  This mass model should be comfortably stable\nin a rigid halo by conventional stability criteria: $t_{\\rm OP} =\n0.10$ \\citep{OP73} and $V = 1.16(GM/R_d)^{1/2}$ at the peak of the\nrotation curve \\citep[Fig.~\\ref{fig.rotcur}][]{ELN82}.  This\nprediction is indeed borne out by the cyan line in the top panel of\nFig.~\\ref{fig.baramp} (see also \\S\\ref{sec.stab}), but the same model\nis clearly unstable when the halo is live whatever the shape of the\nhalo velocity ellipsoid.\n\nThe middle panel shows the (smoothed) time evolution of the torque\nexerted by the disk on the halo, determined from the rate of gain of\n$L_z$ by the halo, for the three cases with the live halo.  Comparison\nof these curves with those in the top panel, reveals that the bar\ngrows by giving angular momentum to the halo, since both the bar\namplitude and the halo torque grow exponentially at approximately the\nsame rate.\n\nNote that the radially biased halo, which suffered from a radial orbit\ninstability when isolated, seemed to remain closely spherical when the\ndisk was inserted.  Furthermore, since the bar grew more slowly, there\nis no evidence from the evolution of this model that a possible\ninstability in the halo encourages the formation of a disk bar.\n\nThe loss of angular momentum from the disk causes the disk mass\ndistribution to become more concentrated, which in turn causes\nadditional compression of the halo, overwhelming any tendency for the\nhalo to expand as a result of gaining angular momentum.  Halo\ncompression (bottom panel) is most pronounced for the tangentially\nbiased DF, red curves, partly because more angular momentum is lost\nfrom the disk (middle panel) and partly because the lower radial\npressure makes an tangentially biased halo more compressible.  The\nsmaller angular momentum changes and stiffer halos make the halo\ndensity changes in the other two models too small to notice.\n\n\n\\subsection{Other halo masses}\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{hmazi.ps}\n\\includegraphics[width=.9\\hsize]{hmiso.ps}\n\\end{center}\n\\caption{The time evolution of the bar amplitude in models with\n  differing $M_P/M_d$.  In the upper panel, all halos have tangentially\n  biased DFs, while the halo DFs are isotropic in the lower panel.\n  The value of $M_P/M_d$ is denoted by the line color: red for\n  $M_P/M_d = 2$, green for $M_P/M_d = 3$ (reproduced from\n  Fig~\\ref{fig.baramp}), blue for $M_P/M_d = 4$, and cyan for $M_P/M_d\n  = 5$.  The magenta line in the lower panel is for a rigid halo with\n  $M_P/M_d = 2$, and the dashed blue line is from the same $M_P/M_d =\n  4$ model, but with the evolution computed on a Cartesian grid.}\n\\label{fig.hmass}\n\\end{figure}\n\nFigure~\\ref{fig.hmass} shows the consequence of changing the halo\nmass.  The results in the upper panel are from simulations in which\nthe halo velocity ellipsoid was strongly tangentially biased ($q=-15$),\nwhile it was isotropic in the lower panel.  Since the disk in a rigid\nhalo, even, has a vigorous bar instability when $M_P/M_d = 2$ (magenta\nline, lower panel), the rapid rise in the bar amplitude for the\ncorresponding live halos, red lines, is hardly surprising, although it\nis noteworthy that the growth rates are clearly higher when the halo\nis live, and more so for the tangentially biased case.\n\nHowever, the other curves for more massive halos continue to reveal\nbar growth on a time scale that slows both with increasing halo mass\nand with a shrinking fraction of near circular orbits in the halo.\nThe green curves are from models with $M_P/M_d = 3$ that are simply\nreproduced from Fig.~\\ref{fig.baramp}, but the blue curves and the\ncyan curve are from models with $M_P/M_d = 4$ and 5, respectively.\nWhile these models have lower growth rates, the instability is still\nclearly present.\n\n\n\\subsection{Properties of the bars} \\label{sec.bars}\n\n\nSome bars in these disks become very strong, and buckle out of the\nplane, in the usual manner, to make peanut shapes that are very\npronounced for the strongest bars.  The bars always form and remain\nfast, {\\it i.e.}\\ corotation is close to the end of the bar.  The halo mass\nbeyond the disk edge at $R=5R_d$ in these simulations is less than 8\\%\nof the total in all the runs reported in this paper.  The absence of\nan extended halo almost certainly inhibits bar slow-down through\ndynamical friction, and therefore these bars should not be regarded as\ncounter-examples to the expectation \\citep{DS00} that ${\\cal R} \\equiv\na_B/R_c \\ga 1.4$ for strong bars immersed in dense halos.\\footnote{\n  The dimensionless ratio ${\\cal R} \\equiv R_c / a_B$, originally\n  defined by \\citet{Elme96}, with $R_c$ being the bar corotation\n  radius and $a_B$ being the semi-major axis of the bar, characterizes\n  the bar angular speed.}  This aspect also prevented the kind of\nsecular growth reported by \\citet{AM02} and \\citet{MVSH06}, where the\nbars grew continuously to encompass the entire original disk.\n\n\n\\section{Linear instabilities} \\label{sec.modes}\n\n\\subsection{Mode fitting}\n\n\nAlthough these are not ``quiet start'' simulations, the initial noise\nis low enough that the disturbances grow almost 100-fold before\nsaturating, which affords reasonable estimates of the exponential\ngrowth rate.  We used the mode fitting apparatus described in\n\\citet{SA86} to estimate eigenfrequencies for the most rapidly growing\nmodes over the period of linear growth.  The Fourier coefficients of\nthe density on the cylindrical polar grid, as well as logarithmic\nspiral transforms of the disk particles yield data that may be fitted\nwith exponentially growing and rotating modes.  The fitted mode\ngenerally has a complex frequency $\\omega$, where $\\Re(\\omega) =\nm\\Omega_p$, with $\\Omega_p$ being the pattern speed and $m=2$ for\nbisymmetric modes, and $\\Im(\\omega)$ is the $e$-folding rate.\n\nThe crosses in Figure~\\ref{fig.modes} show the best estimate of the\ngrowth rate of the most rapidly growing mode in each simulation, and\nthe error bars indicate the spread in values from multiple fits to\nslightly different time ranges, fitted data type, rescaling factors,\n{\\it etc.} \\ More than a single mode seemed to be required to fit the data\nfrom some simulations, especially where the amplitude appears to be\nmodulated.  In these cases, the estimated pattern speeds of the two\ndisturbances differ by about the right amount to account for the beat\nperiod, but a single, strong bar prevails in every case that reaches\nlarge amplitude.\n\nNote that all the measured pattern speeds of all the growing modes\nreported here are high enough to avoid ILRs.\n\nThe case with the rigid halo with $M_{\\rm P}/M_d = 3$ (cyan curve, top\npanel of Fig.~\\ref{fig.baramp}), possesses perhaps three very mildly\ngrowing coherent bisymmetric disturbances that we were able to\nidentify in this long simulation.  The shapes of these three waves\nshow the classic pattern \\citep{Toom81, BT08} of interference between\ningoing and outgoing waves, with more nodes for the lower frequency\nwaves, as expected for a low mass disk in a rigid halo.\n\nThe behavior of the estimated growth rates in Fig.~\\ref{fig.modes}\nwith both halo mass and with the halo velocity distribution is\nconsistent with the evolution of the amplitudes presented in\nFigs~\\ref{fig.baramp} and \\ref{fig.hmass}.  At all halo masses, the\ncyan points indicate that disks in rigid halos have the lowest growth\nrates compared with those from live halos, whatever the form of the\nDF.  Notice that the spread in growth rate at each halo mass broadens\nas the halo becomes more massive, implying that growth rates decline\nmore slowly with increasing halo mass in live halos and most slowly in\nhalos with tangentially biased DFs.  Compared with that in the rigid\nhalo, the bar growth rates range up to five times higher for the most\nmassive responsive halo; even a isotropic DF causes the mode to have a\nthree times higher growth rate.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{modes.ps}\n\\end{center}\n\\caption{The estimated growth rates of the most unstable mode as a\n  function of increasing halo mass.  The colors signify the nature of\n  the halo DF, as in Fig.~\\ref{fig.baramp}; red for tangentially\n  biased, green for isotropic, blue for radial bias, and cyan for a\n  frozen halo.  The halo mass is the same for each group of points,\n  which are offset horizontally for clarity.}\n\\label{fig.modes}\n\\end{figure}\n\n\n\\subsection{Mode mechanism}\n\n\nPhase coherence and exponential growth indicate that the disturbances\nare dynamical instabilities of the disk-plus-halo system.  Since the\nmodes lack ILRs, the instability appears to have a similar feed-back\nmechanism to that of the bar instability of massive disks reviewed in\nthe introduction, with the exception that amplification is boosted by\ninteraction with the halo.\n\nIt is well-known \\citep{LBK72} that, when halo interactions are\nexcluded, a disk inside corotation loses angular momentum, and that\noutside gains, as a self-excited mode grows.  The outward transfer of\nangular momentum across corotation is accomplished by the spiral\ntorque of the disturbance density.  In our simulations with live\nhalos, the torque from the disk on the halo (Fig.~\\ref{fig.baramp}\nmiddle panel) grows exponentially with the mode until it saturates,\nindicating that the bar is excited in these cases by the loss of\nangular momentum to the halo, and probably to the outer disk also.\nThe substantial differences in the disk bar growth rate when the halo\nDF is changed, while keeping the halo density almost constant, is\nclear evidence that halo particles on near circular orbits couple most\nstrongly to the density disturbance in the disk.\n\nIncreasing the halo mass slows the instability.  The relative\nfrequencies of disk and halo orbits must be little affected by\nchanging halo mass, since both the disk and halo particles move in the\nsame global potential.  The more likely explanation is that the\nrelatively less massive and more tightly wrapped disturbances in the\ndisk couple less effectively to the more massive halos.\n\n\n\\section{Discussion} \\label{sec.discuss}\n\n\\subsection{Two obvious questions}\n\n\nThe results presented here are so startling, it is reasonable to ask\ntwo questions: (1) can they be right? and, if so, (2) why is the\nimportance of responsive halos to the bar instability not more\ngenerally known?\n\nWe already reported in \\S\\ref{sec.setup} that our results were\ninsensitive to particle number, time step, grid resolution and even\nthe type of grid, as shown by the solid and dashed blue lines in the\nlower panel of Fig.~\\ref{fig.hmass}.  Furthermore, \\citet{AM02} and\n\\citet{MVSH06}, who both used direct-$N$ methods, stressed the effect\nof the halo on the disk bar in their simulations of sub-maximal disks,\nbut the bars in their models must have resulted from the same linear\ninstability that we have identified.  Thus there seems little room to\ndoubt the numerical results reported here.\n\nThe well-cited papers by \\citet{AM02} and \\citet{MVSH06} reported just\na couple of cases that may well have been unstable had they used rigid\nhalos, yet the formation of bars in sub-maximal disks has not\nhitherto been followed up with a systematic study.  In part, this\ncould be because to use a tree code for this kind of study would\nrequire $\\ga 100$ times more computer time \\citep{Sell14} than the\ncode we used here, which is able to compute the evolution of these\nmodels for a Hubble time with modest computational resources.  Yet the\nmore likely reason for no previous focused investigation may be that\nit is unfashionable to use simulations to study a single aspect of\ngalaxy dynamics.  Instead, many workers prefer to include all possible\nrelevant complications, such as ``gastrophysics,'' halo triaxiality,\nsubstructure, {\\it etc.}\\ into every simulation.  While a strong case can\nbe made for this approach, it comes with two clear disadvantages: it\nnot only makes the simulations very costly in computer time, but it\nalso renders the few results that can be obtained much more difficult\nto understand.\n\n\n\\subsection{Disk stability} \\label{sec.stab}\n\n\nThe difference of behavior between live and rigid halos is not\nqualitative, but simply that growth rates are higher.  As has been\nreported before \\citep[{\\it e.g.}][]{Toom81}, disks in even very massive\nrigid halos continue to possess mild bisymmetric instabilities, even\nthough they are believed to be ``stable.''  \n\nThus, the practical question of disk stability is perhaps best cast as\nwhether a bar would grow by less than some large factor, one hundred\nor $\\sim 5\\;e$-folds say, in a Hubble time or 800 dynamical times,\nwhich translates to $\\Im(\\omega) \\la 0.006$ in the units of this\npaper.  By this criterion, disk stability requires a more massive live\nhalo than a rigid one.  Judging from the slopes of the growth rate\nmeasurements in Fig.~\\ref{fig.modes}, the halo need be some 30\\% --\n50\\% more massive for the growth rate in a responsive isotropic halo\nto match that in a rigid halo.\n\nNote that this conclusion is indicated by isotropic halos in this one\nmass model, and that a more general stability criterion, if one\nexists, would require an extensive study to explore many different\nmass models and halo DFs.  Note also, that in models having a dense\ncenter, such as a bulge, the disk can be linearly stable at much\nhigher mass fraction than in these cases with gently rising rotation\ncurves \\citep{SB15}.\n\n\n\\subsection{Implications for real galaxies}\n\n\nHigher growth rates for bar instabilities in live halos make the\nsurvival of unbarred disks in bulgeless galaxies, which already had no\nclear explanation \\citep{Sell13}, still more perplexing.  The growth\nrate can be suppressed by reducing the disk mass, or by making the halo\nDF strongly radially biased, or by raising the level of random motion\nin the disk.  We discuss all these options in turn, finding each quite\nunattractive.\n\nThe usual argument against the rigid halo explanation for disk\nstability is that it predicts \\citep{SC84, ABP87} that galaxy disks\nshould be dominated by small-scale, multi-arm spirals, as found by\nothers \\citep[{\\it e.g.}][]{Fuji11, GKC12, DVH13}.  We have shown here that\nlive halos, unless they are strongly radially biased right to near the\ncenter, would require still lower disk masses.  In further\nexperiments, to be described later, we again observe tightly-wrapped,\nmulti-arm spirals in cool disks in compressed, isotropic Einasto halos\nthat are massive enough to suppress the bar.  However, nature does not\nappear to prefer this solution, since observations\n\\citep[{\\it e.g.}][]{Davi12}, find that the majority of spiral patterns in\ngalaxies have $m=2$ or 3.\n\nRelaxed halos from dark matter only $\\Lambda$CDM simulations are\nmostly isotropic near their centers and become mildly radially biased\nby the virial radius, where $\\beta \\simeq 0.35$ \\citep{DM11}.  Very\nlittle seems to have been reported of how the velocity ellipsoid shape\nis affected by baryonic infall and feedback, but a dramatic change\nwould seem unlikely.  Thus there is no reason to expect a {\\em strong}\nradial bias in the inner parts of the halos of real galaxies that\nwould materially improve the stability of real galaxy disks.\n\nDisks with large degrees of random motion will be more stable than\ncool disks \\citep{AS86}.  Current galaxy formation models\n\\citep{Gove10, Scan12, Chri14} favor strong ``feedback'' from dense\ngas clumps that impulsively eject large gas masses from the disk after\nadiabatic infall.  The effect of this repeated irreversible cycle is\nboth to lower the halo density and to make the remaining stellar disk\nquite puffy with large random motions in all three components.  While\nrandom motion among the disk stars must be stabilizing, the galaxies\nthat present the greatest stability puzzles are late-type spirals with\nstellar masses in the range few $\\times 10^8$ to several $\\times\n10^9\\;$M$_\\odot$.  These galaxies have little in the way of bulge\nlight, which is why their rotation curves rise slowly in the inner\nparts \\citep{Cati06}, and lie in the mass range of greatest flattening\n\\citep[{\\it e.g.}][]{SJM10}.  Furthermore, they usually have reasonably\nwell-developed spiral patterns, which is another indicator that the\ndisk cannot be so hot as to be dynamically unresponsive.\n\nThus, if galaxies are indeed embedded in responsive dark matter halos,\nthen the fact that a significant fraction of them lack a strong bar is\nstill more perplexing than before.\n\nIt is particularly puzzling that M33 supports a coherent two-arm\nspiral pattern and at the same time has no more than a very weak bar\n\\citep{RV94}.  This is because a bi-symmetric spiral pattern suggests\na massive disk; strong swing amplification is generally required\neither for a self-excited mode or for an amplified mild tidal\nperturbation.  Since swing amplification at $m=2$ is negligible in a\nlow-mass disk \\citep{Toom81}, a much stronger tidal field would be\nrequired to produce a pronounced two-arm distortion.  However, the\nvelocity map in the inner parts \\citep{Kam15} seems too regular to be\nconsistent with the strong tidal perturbation a low-mass disk would\nrequire.\n\n\n\\section{Conclusions} \n\n\nWe have demonstrated, for model galaxies lacking a dense center, that\na disk embedded in a live, {\\it i.e.}\\ responsive, halo tends to form a strong\nbar.  This is true, even when the disk is sufficiently sub-maximal\nthat it is expected to be stable by the traditional stability criteria\n\\citep{OP73, ELN82}.  It is important to realize that this instability\nis one of the combined disk and halo system; therefore, stability\nstudies of disks embedded in rigid halos do not tell the full story,\nand stability criteria derived from them do not apply to galaxies\nhaving live halos.\n\nWe have found that none of the unstable modes presented in this work\nhas an ILR, and that the mechanism for the linear mode remains that of\nfeedback through the center, as outlined by \\citet{Toom81}.  However,\nhis picture of swing amplification at corotation cannot be the whole\nstory, since the work reported here demonstrates that angular momentum\nloss to the halo is another source of wave amplification.  In other\nwork \\citep{SB15}, we find that linear bar instabilities are absent in\nmodels with dense bulges that inhibit wave reflection off the center.\n\nThe vigor of the disk instability in a live halo is strongly related\nto the ability of disk density variations to couple to near circular\norbits in the halo.  Therefore, compared with an isotropic halo of a\ngiven mass, higher growth rates are found when the halo DF is\ntangentially biased, and lower when it is radially biased.  Note that\nin all cases presented here, the halo has no net rotation.  Increasing\nthe halo mass slows the instability, but slowly growing modes persist\neven in very strongly submaximal disks embedded in isotropic halos.\n\nThe bars formed in these simulations are very strong, but their\nlengths are consistent with those observed in real galaxies.\n\\citet{Gado11} finds the median value $a_B/R_d \\simeq 1.5 \\pm 0.5$,\nwhere $a_B$ is the bar semi-major axis.  Note that the value of $R_d$ he\nused was that in the galaxy he observed, {\\it i.e.}, after the bar formed.\nWe find $a_B/R_{d,\\rm new} \\simeq 1.5$ in our models, since the scale\nlength of the disk outside the bar is about twice that of the original\ndisk.  The abruptly truncated halos of the models used here prevented\nfurther growth of the bars, of the kind reported by \\citet{AM02} and\nby \\citet{MVSH06}, which would make them unrealistically long and\nstrong \\citep[{\\it cf.}][]{Erwi05}.  Such bars would be unmistakable in any\nwell resolved galaxy image, and their absence in galaxies with gently\nrising rotation curves presents a major unsolved puzzle.\n\nGalaxy dynamics has turned out to be much richer and more complex than\nanyone imagined.  The fact that a surprise such as that presented here\ncould turn up after almost a half-century of simulations should remind\nus of how much more we have to learn, and how much may lie buried in\nthe confusing behavior of simulations that attempt to include\neverything that could be important.\n\n\n\\acknowledgments \n\n\nI wish to thank Joel Berrier for his persistent reports of bars in\nsimulations with live halos that prompted this study.  His help, both\nwith discussions and for researching the topic of anisotropy in halos\nfrom structure formation simulations, is gratefully acknowledged.  The\ncomments of an anonymous referee helped to clarify several points.\nThis work was supported by NSF grants AST/1108977 and AST/1211793.\n\n\\begin{thebibliography}{}\n\n\\def\\Omit#1{{ {\\it et al.}}}\n\n\\bibitem[\\protect\\citeauthoryear{Athanassoula {\\it et al.}}{1987}]{ABP87}\nAthanassoula, E., Bosma, A. \\& Papaioannou, S. 1987, {A\\&A}, {\\bf 179}, 23\n\n\\bibitem[\\protect\\citeauthoryear{Athanassoula \\& Misiriotis}{2002}]{AM02}\nAthanassoula, E. \\& Misiriotis, A. 2002, {MNRAS}, {\\bf 330}, 35\n\n\\bibitem[\\protect\\citeauthoryear{Athanassoula \\& Sellwood}{1986}]{AS86}\nAthanassoula, E. \\& Sellwood, J. A. 1986, {MNRAS}, {\\bf 221}, 213\n\n\\bibitem[\\protect\\citeauthoryear{Berrier \\& Sellwood}{2016}]{SB15}\nBerrier, J. C. \\& Sellwood, J. A. 2016, {ApJ}, (in preparation)\n\n\\bibitem[\\protect\\citeauthoryear{Binney \\& Tremaine}{2008}]{BT08}\nBinney, J. \\& Tremaine, S. 2008, {\\it Galactic Dynamics\\/} (2nd ed.; Princeton: Princeton University Press)\n\n\\bibitem[\\protect\\citeauthoryear{Carignan \\& Freeman}{1985}]{CF85}\nCarignan, C. \\& Freeman, K. C. 1985, {ApJ}, {\\bf 294}, 494\n\n\\bibitem[\\protect\\citeauthoryear{Catinella, Giovanelli \\& Haynes}{2006}]{Cati06}\nCatinella, B., Giovanelli, R. \\& Haynes, M P. 2006, {ApJ}, {\\bf 640}, 751\n\n\\bibitem[\\protect\\citeauthoryear{Christensen {\\it et al.}}{2014}]{Chri14}\nChristensen, C. R., Governato, F., Quinn, T.,\\Omit{ Brooks, A. M., Shen, S., McCleary, J., Fisher, D. B. \\& Wadsley, J.} 2014, {MNRAS}, {\\bf 440}, 2843\n\n\\bibitem[\\protect\\citeauthoryear{Christodoulou, Shlosman \\& Tohline}{1995}]{CST95}\nChristodoulou, D. M., Shlosman, I. \\& Tohline, J. E. 1995, {ApJ}, {\\bf 443}, 551\n\n\\bibitem[\\protect\\citeauthoryear{Davis {\\it et al.}}{2012}]{Davi12}\nDavis, B. L., Berrier, J. C., Shields, D. W.,\\Omit{ Kennefick, J., Kennefick, D., Seigar, M. S., Lacy, C. H. S. \\& Puerari, I.} 2012, {ApJS}, {\\bf 199}, 33\n\n\\bibitem[\\protect\\citeauthoryear{Debattista \\& Sellwood}{2000}]{DS00}\nDebattista, V. P. \\& Sellwood, J. A. 2000, {ApJ}, {\\bf 543}, 704\n\n\\bibitem[\\protect\\citeauthoryear{de Blok {\\it et al.}}{2008}]{THINGS}\nde Blok, W. J. G., Walter, F., Brinks, E., Trachternach, C., Oh, S.-H. \\& Kennicutt, R. C., Jr.\\ 2008, {AJ}, {\\bf 136}, 2648\n\n\\bibitem[\\protect\\citeauthoryear{Dejonghe}{1987}]{Dejo87}\nDejonghe, H. 1987, {MNRAS}, {\\bf 224}, 13\n\n\\bibitem[\\protect\\citeauthoryear{Diemand \\& Moore}{2011}]{DM11}\nDiemand, J. \\& Moore, B. 2011, ASL {\\bf 4}, 297\n\n\\bibitem[\\protect\\citeauthoryear{D'Onghia, Vogelsberger \\& Hernquist}{2013}]{DVH13}\nD'Onghia, E., Vogelsberger, M. \\& Hernquist, L. 2013, {ApJ}, {\\bf 766}, 34\n\n\\bibitem[\\protect\\citeauthoryear{Efstathiou, Lake \\& Negroponte}{1982}]{ELN82}\nEfstathiou, G., Lake, G. \\& Negroponte, J. 1982, {MNRAS}, {\\bf 199}, 1069\n\n\\bibitem[\\protect\\citeauthoryear{Elmegreen}{1996}]{Elme96}\nElmegreen, B. 1996, in IAU Colloq.\\ {\\bf 157}, {\\it Barred Galaxies}, ed.\\ R. Buta, D. A. Crocker \\& B. G. Elmegreen (San Francisco: ASP Conf series {\\bf 91}), 197\n\n\\bibitem[\\protect\\citeauthoryear{Erwin}{2005}]{Erwi05}\nErwin, P. 2005, {MNRAS}, {\\bf 364}, 283\n\n\\bibitem[\\protect\\citeauthoryear{Evans \\& Read}{1998}]{ER98}\nEvans, N. W. \\& Read, J. C. A. 1998, {MNRAS}, {\\bf 300}, 106\n\n\\bibitem[\\protect\\citeauthoryear{Fujii {\\it et al.}}{2011}]{Fuji11}\nFujii, M. S., Baba, J., Saitoh, T. R., Makino, J., Kokubo, E. \\& Wada, K. 2011, {ApJ}, {\\bf 730}, 109\n\n\\bibitem[\\protect\\citeauthoryear{Gadotti}{2011}]{Gado11}\nGadotti, A. D. 2011, {MNRAS}, {\\bf 415}, 3308\n\n\\bibitem[\\protect\\citeauthoryear{Goldreich \\& Lynden-Bell}{1965}]{GLB65}\nGoldreich, P. \\& Lynden-Bell, D. 1965, {MNRAS}, {\\bf 130}, 125\n\n\\bibitem[\\protect\\citeauthoryear{Grand, Kawata \\& Cropper}{2012}]{GKC12}\nGrand, R. J. J., Kawata, D. \\& Cropper, M.  2012, {MNRAS}, {\\bf 426}, 167\n\n\\bibitem[\\protect\\citeauthoryear{Governato {\\it et al.}}{2010}]{Gove10}\nGovernato, F., Brook, C., Mayer, L.,\\Omit{ Brooks, A., Rhee, G., Wadsley, J., Jonsson, P., Willman, B., Stinson, G., Quinn, T. \\& Madau, P.} 2010, {Nature}, {\\bf 463}, 203\n\n\\bibitem[\\protect\\citeauthoryear{Hohl}{1971}]{Hohl71}\nHohl, F. 1971, {ApJ}, {\\bf 168}, 343\n\n\\bibitem[\\protect\\citeauthoryear{Jalali}{2007}]{Jala07}\nJalali, M. A. 2007, {ApJ}, {\\bf 669}, 218\n\n\\bibitem[\\protect\\citeauthoryear{Julian \\& Toomre}{1966}]{JT66}\nJulian, W. H. \\& Toomre, A. 1966, {ApJ}, {\\bf 146}, 810\n\n\\bibitem[\\protect\\citeauthoryear{Kalnajs}{1972}]{Kaln72}\nKalnajs, A. J. 1972, {ApJ}, {\\bf 175}, 63\n\n\\bibitem[\\protect\\citeauthoryear{Kalnajs}{1977}]{Kaln77}\nKalnajs, A. J. 1977, {ApJ}, {\\bf 212}, 637\n\n\\bibitem[\\protect\\citeauthoryear{Kam {\\it et al.}}{2015}]{Kam15}\t\nKam, Z. S., Carignan, C., Chemin, L., Amram, P. \\& Epinat, B. 2015, {MNRAS}, {\\bf 449}, 4048\n\n\\bibitem[\\protect\\citeauthoryear{Lynden-Bell \\& Kalnajs}{1972}]{LBK72}\nLynden-Bell, D. \\& Kalnajs, A. J. 1972, {MNRAS}, {\\bf 157}, 1\n\n\\bibitem[\\protect\\citeauthoryear{Mark}{1974}]{Mark74}\nMark, J. W-K. 1974, {ApJ}, {\\bf 193}, 539\n\n\\bibitem[\\protect\\citeauthoryear{Martinez-Valpuesta, Shlosman \\& Heller}{2006}]{MVSH06}\nMartinez-Valpuesta, I., Shlosman, I. \\& Heller, C. 2006, {ApJ}, {\\bf 637}, 214\n\n\\bibitem[\\protect\\citeauthoryear{Miller, Prendergast \\& Quirk}{1970}]{MPQ70}\nMiller, R. H., Prendergast, K. H. \\& Quirk, W. J. 1970, {ApJ}, {\\bf 161}, 903\n\n\\bibitem[\\protect\\citeauthoryear{Monaghan}{1992}]{Mona92}\nMonaghan, J. J. 1992, {ARAA}, {\\bf 30}, 543\n\n\\bibitem[\\protect\\citeauthoryear{Ostriker \\& Peebles}{1973}]{OP73}\nOstriker, J. P. \\& Peebles, P. J. E. 1973, {ApJ}, {\\bf 186}, 467\n\n\\bibitem[\\protect\\citeauthoryear{Regan \\& Vogel}{1994}]{RV94}\nRegan, M. W. \\& Vogel, S. N. 1994, {ApJ}, {\\bf 434}, 536\n\n\\bibitem[\\protect\\citeauthoryear{Sackett}{1997}]{Sack97}\nSackett, P. D. 1997, {ApJ}, {\\bf 483}, 103\n\t\n\\bibitem[\\protect\\citeauthoryear{S\\'anchez-Janssen, M\\'endez-Abreu \\& Aguerri}{2010}]{SJM10}\nS\\'anchez-Janssen, R., M\\'endez-Abreu, J. \\& Aguerri, J. A. L. 2010 {MNRAS}, {406}, L65\n\n\\bibitem[\\protect\\citeauthoryear{Scannapieco {\\it et al.}}{2012}]{Scan12}\nScannapieco, C., Wadepuhl, M., Parry, O. H.,\\Omit{ Navarro, J. F., Jenkins, A., Springel, V., Teyssier, R., Carlson, E., Couchman, H. M. P., Crain, R. A., Dalla Vecchia, C., Frenk, C. S., Kobayashi, C., Monaco, P., Murante, G., Okamoto, T., Quinn, T., Schaye, J., Stinson, G. S., Theuns, T., Wadsley, J., White, S. D. M. \\& Woods, R.} 2012, {MNRAS} {\\bf 423}, 1726\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood}{1989}]{Sell89}\nSellwood, J. A. 1989, {MNRAS}, {\\bf 238}, 115\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood}{2003}]{Sell03}\nSellwood, J. A. 2003, {ApJ}, {\\bf 587}, 638\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood}{2013}]{Sell13}\nSellwood, J. A. 2013, in {\\it Planets Stars and Stellar Systems}, v.{\\bf 5}, eds.\\ T. Oswalt \\& G. Gilmore (Heidelberg: Springer) p.~923 (arXiv:1006.4855)\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood}{2014}]{Sell14}\nSellwood, J. A. 2014, arXiv:1406.6606 (on-line manual: \\hfil\\break {\\tt http://www.physics.rutgers.edu/$\\sim$sellwood/manual.pdf})\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood \\& Athanassoula}{1986}]{SA86}\nSellwood, J. A. \\& Athanassoula, E. 1986, {MNRAS}, {\\bf 221}, 195\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood \\& Carlberg}{1984}]{SC84}\nSellwood, J. A. \\& Carlberg, R. G. 1984, {ApJ}, {\\bf 282}, 61\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood \\& Evans}{2001}]{SE01}\nSellwood, J. A. \\& Evans, N. W. 2001, {ApJ}, {\\bf 546}, 176\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood \\& McGaugh}{2005}]{SM05}\nSellwood, J. A. \\& McGaugh, S. S. 2005, {ApJ}, {\\bf 634}, 70\n\n\\bibitem[\\protect\\citeauthoryear{Sellwood \\& Moore}{1999}]{SM99}\nSellwood, J. A. \\& Moore, E. M. 1999, {ApJ}, {\\bf 510}, 125\n\n\\bibitem[\\protect\\citeauthoryear{Toomre}{1981}]{Toom81}\nToomre, A. 1981, in {\\it The Structure and Evolution of Normal Galaxies}, ed.\\ S. M. Fall \\& D. Lynden-Bell (Cambridge: Cambridge University Press), p.~111\n\n\\bibitem[\\protect\\citeauthoryear{Weinberg}{1985}]{Wein85}\nWeinberg, M. D. 1985, {MNRAS}, {\\bf 213}, 451\n\n\\bibitem[\\protect\\citeauthoryear{Young}{1980}]{Youn80}\nYoung, P. 1980, {ApJ}, {\\bf 242}, 1232\n\n\\bibitem[\\protect\\citeauthoryear{Zang}{1976}]{Zang76}\nZang, T. A. 1976, {\\it PhD thesis}, MIT\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 16220, "prevtext": "\nWe limit the extent of the disk by tapering the surface density with a\nfunction that varies as a cubic polynomial from unity at $R=4.5R_d$ to\nzero at $R=5R_d$.  The disk has a Gaussian density profile in the\nvertical direction with $z_0=0.1R_d$.\n\nThis family of disk-halo models therefore has two further parameters,\nthe ratio of halo to disk mass, $M_P/M_d$, and ratio of the disk scale\nlength $R_d$ to the halo core radius $a$.  We have experimented with\nhalo masses in the range $1 \\leq M_P/M_d \\leq 5$ and keep $a = 1.5R_d$\nfor the reason given below.\n\n\n\\subsection{Initial velocities}\n\n\nTo make the halo finite, we adopt a maximum energy of halo particles\nequal to the potential in the disk plane at $r = 8a$ and select halo\nparticles with energies less than this from the compressed halo DF in\nthe manner described by \\citet[][Appendix A]{DS00}.  The rapid density\ndecline when $r \\gg a$ (eq.~\\ref{eq.Plum}) implies that just a few\npercent of the total mass is eliminated by our energy bound, and the\nhalo is in excellent equilibrium in the combined potential of the disk\nand halo.\n\nWe set the disk particles in orbital motion, add random speeds such\nthat Toomre's $Q=1.5$, and use the Jeans equations in the local\napproximation to set initial in-plane and vertical velocity balance\nfor the disk particles in the numerically-computed gravitational field\nof the total mass distribution.  As the disk mass generally\ncontributes a moderate fraction at most of the central attraction, the\nJeans equations yield a disk that is also in excellent initial\nequilibrium.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{rotcur.ps}\n\\end{center}\n\\caption{The radial variation of the circular speed in a series of\n  models with differing halo masses.  The unchanging disk contribution\n  is shown by the dotted line, while the full drawn curves are for\n  $M_P/M_d = 1$, 2, 3, 4, and 5.}\n\\label{fig.rotcur}\n\\end{figure}\n\nFigure~\\ref{fig.rotcur} shows the rotation curves of five of our\nmodels with differing halo masses.  The dotted curve shows the disk\ncontribution computed from the finitely thick and tapered disk, which\nis the same for all cases.  The shapes of the rotation curves are\nlittle affected by the mass of the halo, which was the reason for\nchoosing $a = 1.5R_d$.\n\n\\citet{Sack97} defined a maximum disk as one for which\n$\\left(V_d/V_{\\rm tot}\\right)^2 \\ga 0.85$ at the radius at which the\ndisk contribution peaks.  The models shown in Fig.~\\ref{fig.rotcur}\nare all therefore strongly submaximal since, at $R=2R_d$, they have\n$\\left(V_d/V_{\\rm tot}\\right)^2 = 0.476$, 0.336, 0.264, 0.219, and\n0.187 respectively for $M_P/M_d = 1$, 2, 3, 4, and 5.\n\nThe decrease of the circular speed at large radii is a consequence of\nour adopted Plummer halo.  While some results in this study would\nprobably be changed were a more extensive halo to be used, as we note\nin places, it seems ikely that a supporting response to the linear\ninstability that forms the initial bars (the principal result\npresented below) would be provided by any reasonable live halo.  In\nfact, the absence of an extended halo is an advantage, since it\nenables us to study the dynamical instability that forms the bar,\nwithout the complication of secular bar growth and braking caused by\ndynamical friction with an extended halo.\n\nAll the rotation curves rise nearly linearly from zero at the center,\nand this lack of shear in the inner parts is highly unfavorable for\nspiral arm development by swing amplification, as \\citet{SC84}\nreported.  Thus our strongly submaximal models in rigid halos do not\nmanifest multi-arm spirals of the kind found in other simulations of\nsubmaximal disks with more general rotation curve shapes\n\\citep[{\\it e.g.}][]{Fuji11, GKC12}.\n\nHenceforth, we adopt $M_d$ as our unit of mass, $R_d$, as our unit of\nlength and set $G=1$.  Consequently, a dynamical time is\n$(R_d^3/GM_d)^{1/2}$ and the velocity unit is $(GM_d/R_d)^{1/2}$.\nSince we have smaller disk galaxies, such as M33, in mind, we suggest\na scaling to physical units that sets $R_d = 1.4\\;$kpc \\citep{RV94}\nand $t_0 = 15\\;$Myr, which implies $M_d = 2.7 \\times\n10^{9}\\;$M$_\\odot$ and velocities scale as $(GM/R_d)^{1/2} \\simeq\n91\\;$km/s.  Thus the velocity rise to the peak shown in\nFig.~\\ref{fig.rotcur} roughly matches the inner rotation curve of M33\n\\citep{Kam15}.\n\n\n\\subsection{Numerical procedure}\n\n\nWe use the hybrid $N$-body code described by \\citet[][Appendix\n  B]{Sell03}, in which the gravitational field is computed with the\naid of two grids: a 3D cylindrical polar grid for the disk component,\nand a spherical grid for the halo component with a surface harmonic\nexpansion on each grid shell.  A comprehensive description of our\nnumerical methods is given in an on-line manual \\citep{Sell14}.\n\nWe generally use $10^6$ particles to represent each component, a time\nstep $\\delta t = 0.01$ dynamical times, include sectoral harmonics\n$0\\leq m \\leq 8$ in the force determination on the cylindrical polar\ngrid, where the cubic spline softening \\citep{Mona92} length is\n$0.2R_d$, and surface harmonics $0 \\leq l \\leq 4$ on the spherical\ngrid.  Aside from a time offset caused by a different seed amplitude,\nwe found the evolution was unaffected when the numbers of disk and\nhalo particles were varied over the range $10^5 \\leq N \\leq 10^7$, but\n$N=10^4$ was clearly inadequate.  We also verified that moderate\nchanges to the time step and grid size have little effect on the\noutcome of the simulations.\n\nWe recentered the grids on the particle centroid every 16 time steps,\nsince an offset between the particle distribution and the center of\nour polar grids could lead to numerical artifacts.  As a further\ncheck, we reran one case using a Cartesian grid, which has no\npreferred center and has adequate resolution for these models that do\nnot have a high central density, and once again the evolution followed\nthe same path.\n\n\n\\section{Bar growth}\n\n\\subsection{Halo anisotropy}\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=.9\\hsize]{baramp.ps}\n\\end{center}\n\\caption{The evolution of four models with almost identical mass\n  distributions, with $M_P/M_d=3$, but having different DFs for the\n  halo.  The top panel shows the evolution of the bar amplitude in the\n  disk component; the red curve is for an tangentially biased halo DF,\n  the green for an isotropic halo, the blue for a radially biased halo\n  DF, and the cyan for a rigid halo.  The dashed horizontal line is\n  the expected value of the ordinate if the particles were distributed\n  at random in a axisymmetric disk.  The middle panel shows the time\n  evolution of the torque exerted by the disk on the live halo,\n  colored as in the top panel.  The bottom panel shows the initial and\n  final halo density profiles for the three live halo models.}\n\\label{fig.baramp}\n\\end{figure}\n\nThe top panel in Figure~\\ref{fig.baramp} shows the evolution of the\nbar amplitude in the disk in four models having almost identical mass\ndistributions, but having different DFs for the halo.  The quantity\nplotted is the ratio $A_2/A_0$, where\n\n", "index": 7, "text": "\\begin{equation}\nA_m(t) = \\left| \\sum_j \\mu_je^{im\\phi_j} \\right|,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"A_{m}(t)=\\left|\\sum_{j}\\mu_{j}e^{im\\phi_{j}}\\right|,\" display=\"block\"><mrow><mrow><mrow><msub><mi>A</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>|</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi></munder><mrow><msub><mi>μ</mi><mi>j</mi></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>j</mi></msub></mrow></msup></mrow></mrow><mo>|</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]