[{"file": "1601.05095.tex", "nexttext": "\nHere, $\\delta$ is the expected transit depth for the planet, $N_{\\rm\n  transit}$ the number of transits in the entire {\\it Kepler}\nlight curve, and CDPP the combined differential photometric precision\nof the light curve over the transit duration time-scale.  \n\\citet{Fressin:2013}\nreported that $99.9\\%$ of the {\\it Kepler} candidates with a\nsignal-to-noise ratio (SNR) larger than $10.1$ will be detected by the\n{\\it Kepler} pipeline.\nWhen calculate the completeness, we define a planet as detectable \nif this SNR is greater than $10$. A\nhistogram of the 6.5-hour CDPP values for host stars in our sample \nis shown in Figure \\ref{fig:cdpphist}. The host stars of HJs \nand WJs have similar noise properties in their light curves. So \nwe expect similar detection completeness in these two groups.\n\nWe report the detection completeness thus estimated in \nFigure \\ref{fig:completeness}, averaged over the cohorts of HJ and WJ \nsystems separately. As expected, they look rather similar. We further \nverify this estimation by performing a signal-injection-and-recovery\nexperiment. We inject into the HJ light curves transit signals by \nplanets of orbit period around 10 days and various sizes \n($2 R_{\\rm Earth}, 1.5 R_{\\rm Earth}$ and $1 R_{\\rm\n  Earth}$). We obtain recovery rates of 100$\\%$, 93$\\%$ and 51$\\%$ at\nthese sizes. These match the above estimation using light curve CDPPs.\n\nAlso shown on Fig. \\ref{fig:completeness} are the positions of the \ntwo small companions of WASP-47b. If present, they should be \ntrivially detected around any of the giant planets.\n\n    \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{cdpp_all.eps}\n\\caption{Histogram of the 6.5 hour\n  CDPP for the light curves of the host stars in our {\\it Kepler}\n  giant planet sample.  Those with hot Jupiters are shown in black,\n  while those with warm Jupiters are shown in\n  red. The two populations have similar noise properties.} \n  \\label{fig:cdpphist}\n\\end{figure}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=0.8\\textwidth]{Completeness.eps}\n\\caption{The detection completeness \n    as a function of planet size (in Earth radius) and\n    orbital period (in day) for our systems. The contours (and\n    black lines) show the averaged completeness of all HJ systems,\n    while the red lines show that for the WJ systems. They are\n    similar. For planets larger than $2 R_{\\rm Earth}$, we are $>90\\%$\n    complete out to $50$ days; while for those larger than $1 R_{\\rm\n      Earth}$, we are $>90\\%$ complete out to $\\sim 3$ days. The latter\n    places stringent constraint on the  inner companions of HJs.\n    The interior and exterior companions of WASP-47c are noted here. \n    They are trivially detectable around all\n  systems. }\n\\label{fig:completeness}\n\\end{figure*}\n\n\\subsection{Results} \\label{sec:result}\n\nWe summarize our search results in Table \\ref{tab:companions}. \nWe find that, while none of the HJs has any transiting companion, 11 (out of 27) \nof the WJs do. All of these companions have also been reported by the \n{\\it Kepler} candidate catalog. We display\nthe architecture of these multiple systems in Figures \\ref{fig:periodradius} \\&\n\\ref{fig:companions}. \n\n\\begin{table}\n\\centering\n\\begin{tabular}{ccccc}\n\\hline\\hline\n group & total & $N_{\\rm multi}$ & Inner & Outer\\\\\n \\hline\n HJ & 45 & 0 & 0& 0\\\\\n\nconfirmed HJ & 28 & 0 & 0 & 0\\\\\n \\hline\n WJ & 27 & 10 & 10 & 3\\\\\n\n confirmed WJ & 12 & 7 & 7 & 2 \\\\\n \\hline\n\\end{tabular}\n\\caption{Summary of transiting companions for {\\it Kepler} giant planets. }\n\\label{tab:companions}\n\\end{table}\n\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Period_radius.eps}\n\\caption{Periods and radii for our sample of giant planets and their\n  neighbours.  The giant\n  planets that have companions are marked out in red  and are\n  connected to their companions by lines. Only warm Jupiters appear to belong in\n    multiple systems.\n}\n\\label{fig:periodradius}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{multi.eps}\n\\caption{Similar to Fig. \\ref{fig:periodradius} but showing more\nclearly the architecture of our multiple systems (around warm\nJupiters).  The planets are laid out in $\\log P$, with the size of the\ndot representing the size of the planet. The confirmed systems are noted\nby their {\\it Kepler} names. {\\bf Kepler-419} system is counted as a single warm Jupiter \nsystem in our calculation, given the companion is far away.}\n\\label{fig:companions}\n\\end{figure}\n\n\nAssuming all companions to the giant planets transit, we can estimate \nsimply the companion fraction using results in Table \n\\ref{tab:companions}. We focus on companions inward of $50$ \ndays and larger than $2 R_{\\rm Earth}$, since this population should \nbe detected nearly completely ($>90\\%$), and since \nmost of the companions we find do fall in this range. We term these \n{\\bf ``close''} companions.\nWe treat the problem as an estimation of the distribution of the event\nsuccess rate $p$ for a binomial distribution having observed $s$\nsuccesses in $n$ trials, for which each system is assumed to have\nequal weight. We imply a Jeffrey's prior (${\\rm Beta}(0.5,0.5)$) on\n$p$ \\footnote{Jeffrey's prior tends to give a larger uncertainty in the result compare to \na uniform prior, and avoids the diverge of PDF towards $p=0$.}. \nThe posterior distribution of $p$ can be expressed as ${\\rm\n  Beta}(s+0.5,n-s+0.5)$ \\citep{Everson:2002}.  We thereby\nobtain a multiplicity rate of hot Jupiters of\n$0.52^{+5.0}_{-0.52} \\%$, while that for warm Jupiters is $37.2^{+18.6}_{-16.3}\\%$. \nThroughout this work, we present results in terms of \nthe median of the distribution and their $95\\%$ confidence interval.\n  \nIf we only use the confirmed planet systems, the \nestimated multiplicity rate for hot Jupiters is ${\\rm Beta}(0.5,28.5)=0.8^{+7.7}_{-0.8}\\%$, \nand for warm Jupiters is ${\\rm Beta}(8.5,4.5)=58.1^{+23.9}_{-26.9}$. \nThis latter value, however, should be taken with caution as \nthe confirmed systems are likely to bias towards multiple system \n(they are usually prioritized during radial velocity follow-up observations).\n\n\n \\begin{table*}\n\\centering\n\\caption{The probability for a giant planet to have at least one ``close'' companion \nin the system. \\tablenotemark{a} \\label{tab:finalrate}}\n\\begin{tabular}{ccccc}\n\\hline\\hline\ngroup & candidate fp & mutual inclination & HJ rate ($\\%$) & WJ rate ($\\%$)\\\\\n\\hline\n1 & 0 & 0 & $0.5^{+5.0}_{-0.5}$ & $37.2^{+18.6}_{-16.3}$ \\\\\n\\hline\n 2 & $10\\%$ & $\\sigma_{\\mu}=1.8^o$ & $0.98^{+9.4}_{-0.98}$ & $58.1^{+31.7}_{-31.0}$\\\\\n\n3 & $10\\%$ & uniform & $8.4^{+46.4}_{-8.0}$ & -\\\\\n\\hline\n4 & $50\\%$ & 0 & $1.1^{+13.3}_{-1.1}$ &  $55.7^{+27.0}_{-31.1}$ \\\\\n\n5 & $50\\%$ & $\\sigma_{\\mu}=1.8^o$ & $1.6^{+19.5}_{-1.6}$ & $69.5^{+24.2}_{-30.8}$ \\\\\n\n6 & $50\\%$ & uniform & $9.1^{+45.8}_{-8.6}$ & -\\\\\n\\hline\n7 & $100\\%$ & 0 & $0.8^{+7.7}_{-0.8}$ & $58.1^{+23.9}_{-26.9}$\\\\\n\\hline\n\\tablenotetext{1}{For case 1,4 and 7, ``close\" companion refer to those with period \nsmaller than 50 days. For case 2,3,5 and 6, only the interior companion of the giant planets are considered.}\n\\end{tabular}\n\\end{table*}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth,trim=0 50 80 20,clip=true]{Multirate.eps}\n\\caption{The probability density distributions for\n  giant planets to have ``close'' companions, defined as inward of\n    $50$ days and larger than $2 R_{\\rm Earth}$. Here we assume that\n    all planets in a given system transit. The top panel\n  compares the companion rates for hot Jupiters (blue) and warm\n  Jupiters (red) in our standard Monte Carlo model \n    where the candidate false positive rate is assumed to be $50\\%$.  \n    Points with error-bars indicate the median of the\n  distribution and its $95\\%$ confidence interval. The middle panel\n  assumes that all unconfirmed candidates are\n  real planets ($fp = 0$), whereas the bottom panel assumes that\n  they are all false positives ($fp = 100\\%$) and only confirmed\n    planets are included.  The two populations of giant planets\n    are incompatible in all cases.}\n\\label{fig:rate}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth,trim=5 20 80\n10,clip=true]{Multirate_interior.eps}\n\\caption{Same as Fig. \\ref{fig:rate} but demonstrating the impact of\n    mutual inclinations, considering only {\\em inner} companions. \n    The top panel compares the {\\em inner} companion\n  rates using our standard priors, with the\n    histograms corresponding to a case where the mutual inclinations\n    is a narrow Rayleigh distribution with a dispersion of\n    $\\sigma_{\\mu} = 1.8^o$ -- compare these to the co-planar case.\n  The extreme case, marked with ``uniform $cos\\mu$'' for the HJ only,\n    is one where we assume that the orbital planes for hot Jupiters and their inner\n    companions are un-correlated. The bottom\n  panel shows the same content but for a smaller false positive\n  rate of $fp = 10\\%$, a value that we deem more plausible for our\n  sample.}\n\\label{fig:rate_interior}\n\\end{figure}\n\n\n\\subsubsection{Monte Carlo Simulation}\n\nTo have a more realistic estimation that takes into account of a\nmultitude of observational uncertainties, we perform a Monte Carlo\nMarkov Chain simulation with emcee \\citep{Foreman-Mackey:2013} to\nconstrain the rate of multiplicity. \n\nFor our standard MCMC model, we again assume all companions transit (a\nflat system), and we adopt a false positive rate of $50\\%$ for the\nunconfirmed planets in our sample. We continue to focus on\n  ``close'' companions for which our detection capacity is nearly\n  complete.  We also account for the scatter of the Neptune\npopulation into our sample. The details are laid out in Appendix\n\\ref{sec:stats} and the results are shown in the top panel of Figure\n\\ref{fig:rate}. We obtain that hot Jupiters have a multiplicity rate\nof $1.1^{+13.3}_{-1.1}\\%$, and warm Jupiters have a multiplicity rate\nof $55.7^{+27.0}_{-31.1}\\%$, largely unchanged from our previous\nestimates.\n\nIn the following, we relax or alter some of the assumptions in our \nstandard model. Results of all these experiments are summarized in \nTable \\ref{tab:finalrate}.\n\n\\subsubsection{Impact of false positives}\n\nFig. \\ref{fig:rate} compares the results when \ndifferent false positive rates for the unconfirmed systems are \nadopted. The overall effect of a smaller false-positive rate is to \nreduce the companion fraction for WJs, since the confirmed WJs have \na higher multiplicity than the unconfirmed ones.\n\nWe note that the false positive rate we adopt for our standard model \n($fp = 50\\%$) is likely too pessimistic for our sample. \nThis value is derived by \\citet{Santerne:2015} for all giant \ncandidates in the entire {\\it Kepler} candidate sample, while we \nbenefit from additional filtering based on follow-up measurements \nand additional vetting on the light curves. In fact, the individualized \nfalse-positive rates (Morton et al, 2016, in prep) for the unconfirmed \nobjects in our sample are in general low. We regard a more \noptimistic value of $fp =10\\%$ to be more suitable for our WJ candidates. \nWe will present more results for this false positive rate below.\n\n\n\n\\subsubsection{Impact of mutual inclination}\n\nSo far, we have assumed that the companions always\ntransit. \\citet{Fabrycky:2014} found that the {\\it Kepler} multiple\nsystems are indeed quite coplanar \\citep[also\nsee][]{Figueira:2012,FangMargot:2012,Tremaine:2011}.  Assuming that\nthe mutual inclination ($\\mu$) dispersion follows a Rayleigh\ndistribution, the inferred dispersion $\\sigma_\\mu$ typically lies in\nthe range 1.0$^{\\circ}$-2.2$^{\\circ}$. We investigate how this \naffects our results. \n\nWe consider only the possibility that the giant planet systems to have a\nnon-transiting companion interior to the giant planet. \nAs the transit probability is now a function of orbital period, \nwe need to assume a period distribution for the companion.\nThe occurrence rate of sub-Jovian planets is roughly flat in the log \nperiod space, and falls off for short periods \\citep{Howard:2012,Dong:2013}. \nWe assume the occurrence rate of the companion is flat in $\\log P$ for\nWJs, with a inner cut-off period of 1 day, and a power-law depends on\nperiod for HJs, with a inner cut-off period of 0.5 day. We simulate \nthe rate of interior companion assuming the prior of the mutual inclination \nis a Rayleigh distribution with $\\sigma_{\\mu}=1.8^{\\circ}$ for both the HJs and\nWJs. To explore the extremes, we also simulate the rate of interior\ncompanion for HJs assuming the $\\cos\\mu$ distribution is uniform\nbetween 0 and 1. The distribution of interior companion rate is\nconstrained as in Figure \\ref{fig:rate_interior}, upper panel using a false positive rate of \n$50\\%$. We show that assuming the same mutual inclination distribution, the median of\nthe multiplicity rate distribution of HJs and WJs both shift to a\nhigher value, but their $95\\%$ confidence interval do not overlap with\neach other. Even with the extreme case that the HJ companions have an\nuniform cosine mutual inclination distribution, the $95\\%$ confidence\ninterval of its distribution exclude the median of the WJ companion\nrate distribution. The conclusion holds with a $10\\%$ false positive \nrate (lower panel of Figure \\ref{fig:rate_interior}). If we assume instead a \nuniform logP distribution for the HJ companions, similar to that of the WJ's, the\nconclusion will be stronger since it allows less non-transiting\ncompanions.\n\nFor interior companions of HJs, we are able to constrain the detection \nof planets with size larger than 1.5 $R_{\\rm Earth}$ to be complete \nup to 10 days. However, this conclusion can be extended to 1$R_{\\rm Earth}$ \nif we correct for detection completeness assuming $df/dlogR$ is constant \nbetween 1-3 $R_{\\rm Earth}$ as suggested by \\citet{Petigura:2013}.\nIn reality, majority of the HJs have orbital period smaller than 5 days, \nthis allows us have almost complete detection to 1 $R_{\\rm Earth}$ regardless of \nthe size distribution.\n\nThe rate of exterior companions is extremely sensitive to the distribution \nof mutual inclinations, it is difficult to obtain a good constraint. If we \nassume every giant planet with interior companion also have an exterior companion, \nand that the interior and exterior companions have the same mutual inclination \ndistribution (a Rayleigh distribution with $\\sigma_\\mu=1.8^{\\circ}$), the \nobserved number of systems with exterior companion is expected to be a \nquarter of those with interior companions due to the transit probability \nand detection completeness. This is not in contradiction with the current \nobservations. \n\n\n\\section{Discussions}\\label{sec:discussion}\n\nOur main results (Fig. \\ref{fig:rate} and \\ref{fig:rate_interior}),\nthat HJs have companion fraction consistent with zero, while about\nhalf of WJs have close neighbours, reveal much about\ntheir respective formation mechanisms, as we discuss here.\n\n\\subsection{Two populations of Warm Jupiters?}\n\nTwo previous works have suggested that warm Jupiters are not all the\nsame beasts.  Using RV data, \\citet{Dawson:2013} suggested\nthat eccentric WJs tend to orbit around metal rich stars, while\nplanets around metal poor stars have predominately circular orbits.\nLater, also based on RV data, \\citet{Dong:2014} showed that more than\nhalf of the eccentric WJs ($e > 0.4$) have distant, Jovian companions,\nwhile the low-eccentricity WJs tend to be 'single'.  Taken together,\nthese suggest that more Jovian planets are produced around metal-rich\nstars, and this somehow raises the eccentricities of WJs (via either\nsecular perturbations or planet-planet scatterings). \n\n\nOur study of the {\\it Kepler} transit data adds a further dimension to\nthe picture. At least half of the WJs in our sample are flanked by\nclose, small companions.  Most likely, they are nearly coplanar with\nthese companions (to maximize transit probability), and are also\nnearly circular (so as to prevent dynamical instability in such\nclosely packed systems). RV counter-parts to these objects have been\nfound, e.g., HIP 57274c \\citep{Fischer:2012} which is a nearly\ncircular WJ with a small mass neighbour interior to its orbit, and\n GJ 876c \\citep{Rivera:2010}, and 55 Cnc-b\n\\citep{Endl:55}. However, due to limits on RV precision, most of these\nWJs will in general be observed as 'singles' on largely circular\norbits.\\footnote{In other words, the transit technique is uniquely\n  capable of revealing these small neighbours.}\n\nHow are the warm Jupiters formed? For those with low-mass neighbours,\nit seems sensible to argue that they are formed {\\it in-situ}, i.e.,\nthey undergo run-away gas accretion locally, from originally the\nlow-mass, closely packed planets that are so abundantly discovered by\nthe {\\it Kepler} mission.  This hypothesis is supported by the\nfollowing arguments.\n\n\\begin{itemize}\n\n \n\n\\item Small planets (sub-Jovian) are common around stars, and their\n  frequency rises outward steeply at just the inner edge of our WJ\n  zone \\citep{Howard:2012}, and it remains flat in logarithmic period\n  beyond this cut-off \\citep{Petigura:2013b,Silburt:2015}. \n \n\n\\item Measured masses for some of these small planets are available\n  \\citep[e.g.][]{Weiss:2013,Lithwick:2014}, with some reaching beyond\n  $10 M_{\\rm Earth}$ in solid mass.\n\n\\item Such massive cores can retain a heavy enough atmosphere and\n  undergo run-away gas accretion, at the observed locations for these\n  WJs \\citep[e.g.][]{Rafikov:2006}. Recent theoretical studies of\n  accretion of such an envelope \\citep{LeeChiang:2014,Batygin:2015}\n  further argue that cooling can be sufficiently fast to allow {\\it\n    in-situ} formation of giant planets at these distances.\n\n\\item As the WJ grows in mass, it can keep the planetary configuration\n  largely intact.\\footnote{It will be able to destabilize some of the\n    closest neighbours and ingest them in the process.} As a result,\n  we observe them today still flanked by small neighbours.\n\n\\end{itemize}\n\nAlternative theories such as disk migration,\nwhereby these WJs are formed at larger distances and migrated inward\nby interaction with the protoplanetary disk, and\n  high-eccentricity migration, face the challenge of\nexplaining the presence of small neighbours. \n\nWhat about the other WJs, the ones that have no transiting companions?\nStudies mentioned above argue that these may be a distinct\n  population. However, it needs to be firmly\nestablished that these WJs indeed always have distant Jovian\ncompanions, and/or are largely eccentric, and/or only reside around\nmetal-rich stars.  At\nthe moment, their origin remains an enigma.\n\nAssuming that the lonely WJs in our sample do form a distinct\n  population, we can estimate the\nrelative proportions of these two groups of WJs.  Among the WJs, 10\nout of 27 are in multiple systems, or $37^{+19}_{-16}$ of\nWJs. However, this value can rise to $58^{+31}_{-31}\\%$ if the mutual\ninclination dispersion of the system follows a Rayleigh distribution\npeaked at $1.8 \\deg$. In other words,\nat least half of all WJs are formed {\\it in situ}.\n\n\\subsection{Formation of Hot Jupiters}\n\nWe were initially motivated by the discovery of close companions\naround the hot Jupiter WASP-47b \\citep{Becker:2015}. After having\nestablished the general patten among hot and warm Jupiters, we return\nto reflect upon the existence of this particular system.\n\nWASP-47b was first identified by ground-based photometry, and \nthen verified with radial velocity measurements\n\\citep{Hellier:2012}. Thanks to this detection, it was proposed as a\ntarget for the K2 mission. In the meantime, the radial-velocity\nmonitoring of the system unveiled a second, long period gas giant\n\\citep{NeveuVanMalle:2015}.  \\citet{Becker:2015} analyzed the K2 data\nand announced the presence of two super-Earths, one inner to the hot\nJupiter, and one between both gas giants. The two low-mass companions\nof WASP-47b were discovered in a targeted observation, so it is\ndifficult to ascertain their statistical importance. However, we can\nset an upper limit on the frequency of such objects, based on the\nabsence of neighbours in our hot Jupiter sample. This is $1.0^{+9.5}\n_{-1.0}\\%$ among all hot Jupiters, assuming a candidate false positive\nrate of $10\\%$ and a mutual inclination dispersion of $1.8 \\deg$\n(Table \\ref{tab:finalrate}).\n\n\nThis leads us to believe that WASP-47b is a rather unique system among\nhot Jupiters, themselves rare systems. Based on our\ndiscussion above, we further speculate that since more than half of\nWJs may be formed {\\it in-situ}, this path may found its way into the\nperiod domain of HJs. Or, WASP-47b is also formed {\\it in-situ}\n\\citep{Boley:2015,Batygin:2015}, and is a tail of the {\\it in-situ}\nWJs.  Given the relative numbers of hot Jupiters (one, WASP-47b) and\nwarm Jupiters (7 out of the confirmed sample of 12) in multiple \nsystems, and the lower transit probability of WJs, this would \nsuggest that the {\\it in-situ} process is increasingly difficult \nfor closer-in planets, with WASP-47b being the hottest \nrepresentative of the warm Jupiter population.\n\nWhere do majority of the hot Jupiters come from then? We \nturn to the observations for answer.\nMany of the dynamical migration processes that are invoked to\n  explain hot Jupiters invariably produce the so-called 3-day pile\nup, an excess of HJs near 3-day orbital period. Such a pile-up,\noriginally discovered among RV population \\citep{Wright:2009}, but\nthen found to be absent in the {\\it Kepler} transit data\n\\citep{Howard:2012}, and then re-discovered recently through careful\nRV falsification of the transit candidates \\citet{Santerne:2015}, now\nseems here to stay. This lends support to the hypothesis that hot\nJupiters are products of violent dynamical processes.\n\n\\section{Concluding words}\n\n\nWhen we set out on this project, we wondered whether WASP-47b is a\ncommon-place hot Jupiter in terms of small neighbours.  By examining\nthe Kepler hot Jupiters, we found that systems such as WASP-47b are\nrare among the hot Jupiters -- among our statistical sample of 45 (28\nconfirmed) hot Jupiters, none shows small companions, either inner or\nouter.\n\nIn contrast, we found that among our warm Jupiter sample, half or more\nhave nearly coplanar, small companions.  Most of\n  these are inner companions, and given the fact that exterior\n  companions are less likely to transit, the data give the\n  impression that they are at least as common as the inner ones (Table\n  \\ref{tab:companions}).\n\nSo not only do hot Jupiters and warm Jupiters appear to be separated\nin their period distributions \\citep{Santerne:2015}, they are also\ndistinct in their respective fractions of close neighbours.\n\nMotivated by this discovery, and by recent theoretical progress in\nunderstanding gas accretion, we propose that a significant fraction of\nwarm Jupiters are formed {\\it in-situ}. \nThe prevalence of multiple low-mass planets in close proximity to one\nanother and to the star can, in a fraction of the cases, permit some\nof the planets to accrete enough envelope and to trigger run-away\ngrowth. This process can operate in the warm Jupiter locale, but \nappears to become increasingly difficult towards the hot Jupiter region,\nexplaining the rarity of systems like WASP-47b.\n\nFuture lines of work to extend our results include,\n\\begin{itemize}\n\n\\item The true neighbour fractions of warm Jupiters is sensitive to\n  the inclination dispersion in the system, as well as the false\n  positive rate of our warm Jupiter sample (Table\n  \\ref{tab:finalrate}). Both could be improved. Specifically, further\n  photometric and Radial Velocity monitoring of the confirmed warm\n  Jupiters discovered by ground based transit surveys, such as\n  HAT-P-15b \\citep{Kovacs:2012}, HATS-17b \\citep{Brahm:2015}, are\n  likely to reveal the presence of companions, if\n  current statistics holds.\n\n\\item Masses for these close companions are interesting. They may\nyield the critical mass above which runaway gas accretion occurs.\n\n\\item Multiple lines of evidences suggest that there may be a second\n  population of warm Jupiters. But data are inconclusive at the\n  moment. Studies of warm Jupiter eccentricity distribution, host star\n  metallicity distribution, presence of giant planet companions,\n  etc. may help answer whether there is a second pathway to form warm\n  Jupiters.\n\n\\item The {\\it in-situ} warm Jupiters accrete their gas inward of \n    the ice-line. As such, their envelope water content should \n    not be depleted by condensation. This may contrast with those \n    that accrete their gas beyond the iceline (barring core erosion \n    in these bodies) and may be testable by transmission spectroscopy.\n\n\\item Using transit data, we can exclude inner neighbours of hot\n  Jupiters, but the constraint is less stringent for the outer\n  neighbours, especially if they may be highly misaligned\n  \\citep{Batygin:2015}.  Radial velocity study is necessary.\n\n\\item If outer neighbours are indeed also absent among hot Jupiters,\n  theoretical study is needed to explain the rarity of {\\it in-situ}\n  formation for hot Jupiters, vs. that of warm Jupiters.\n  \n\n\n\\end{itemize}\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\n\nReferences to exoplanetary systems were obtained through the use of\nthe paper repositories,\n\\anchor{http://adsabs.harvard.edu/abstract\\_service.html}{ADS} and\n\\anchor{http://arxiv.org/archive/astro-ph}{arXiv}, but also through\nfrequent visits to the \\anchor{http://exoplanet.eu}{exoplanet.eu}\n\\citep{Schneider:2011} and\n\\anchor{http://exoplanets.org}{exoplanets.org} \\citep{Wright:2011}\nwebsites.  This paper includes data collected by the Kepler\nmission. Funding for the Kepler mission is provided by the NASA\nScience Mission directorate. Some of the data presented in this pa-\nper were obtained from the Multimission Archive at the Space Telescope\nScience Institute (MAST). STScI is operated by the Association of\nUniversities for Research in Astronomy, Inc., under NASA contract\nNAS5-26555. Support for MAST for non-HST data is provided by the NASA\nOffice of Space Science via grant NNX09AF08G and by other grants and\ncontracts. This research has made use of the NASA Exoplanet Archive,\nwhich is operated by the California Institute of Technology, under\ncontract with the National Aeronautics and Space Administration under\nthe Exoplanet Exploration Program.\n\n\n\\appendix\n\\section{Statistical Frame Work}\n\\label{sec:stats}\n\n\nThe observed giant planet multiplicity systems $N_{\\rm obs,m}$ can \narise from four origins: the confirmed multiple planet \nsystems $N_{\\rm obs,p,m}$, candidate multiple planet \nsystems $N_{\\rm obs,gc,m}$ with at least a giant planet, candidate \nmultiple planet systems with the most massive planet being Neptune \nnature $N_{\\rm obs,nc,m}$, and false positive multiple systems due to \nbinary contamination $N_{obs,s,m}$. We assume the \ncontribution to the multiple system with a giant planet from \nfalse positives ($N_{\\rm obs,s,m}$) to be negligible \\citep{Lissauer:2014}.  \n\n\n", "itemtype": "equation", "pos": 12401, "prevtext": "\n\n\n\\title{Warm Jupiters are less\n  lonely than hot Jupiters: close neighbours}\n\\author\n{\nChelsea Huang\\altaffilmark{1,2},  Yanqin Wu\\altaffilmark{3}, Amaury H.M.J. Triaud\\altaffilmark{1,3,4}\n}\n\\altaffiltext{1}{Centre for Planetary Sciences, University of Toronto at Scarborough, 1265 Military Trail, Toronto, ON, M1C 1A4, Canada}\n\\altaffiltext{2}{Dunlap Institute,University of Toronto, Toronto, ON, M5S 3H4, Canada}\n\\altaffiltext{3}{Department of Astronomy \\& Astrophysics, University of Toronto, Toronto, ON, M5S 3H4, Canada}\n\\altaffiltext{4}{Institute of Astronomy, University of Cambridge, Madingley Road, Cambridge, CB3 0HA, United Kingdom}\n\\email{chelsea.huang@utoronto.ca}\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\n\nExploiting the {\\it Kepler} transit data, we uncover a dramatic\ndistinction in the prevalence of sub-Jovian companions, between\n  systems that contain hot Jupiters (periods inward of 10 days) and \n  those that host warm Jupiters (periods\nbetween 10 and 200 days).  Hot Jupiters as a whole, with the \nsingular exception of WASP-47b, do not\nhave any detectable inner or outer planetary companions\n(with periods inward of 50 days\nand sizes down to $2 R_{\\rm Earth}$). \nRestricting ourselves to inner companions, our limits\n  reach down to $1 R_{\\rm Earth}$. In stark contrast, half of the\nwarm Jupiters are closely flanked by\nsmall companions.\nStatistically, the companion fractions for hot and warm Jupiters are\nmutually exclusive, in particular in regard to inner companions.\n  \\\\\n  The high companion fraction of warm Jupiters also yields clue to\n    their formation. The warm Jupiters that have\n    close-by siblings should have low orbital eccentricities\n  and low mutual inclinations. The orbital\n    configurations of these systems are reminiscent of those of the\n    low-mass, close-in planetary systems abundantly discovered by the\n    {\\it Kepler} mission. This, and other arguments, lead us to propose\n    that these warm Jupiters are formed {\\it\n    in-situ}. There are indications that there may be a\n    second population of warm Jupiters with different\n    characteristics.\nIn this picture, WASP-47b could\n  be regarded as the extending tail of the {\\it in-situ} warm Jupiters\ninto the hot Jupiter region, and does not represent the generic formation route for \nhot Jupiters.\n\\end{abstract}\n\n\\keywords{planets:general}\n\n\\section{Forewords}\n\nThe origin of hot Jupiters (HJs, period inward of $\\sim 10$ days) has\nremained an unsolved issue. Although multiple scenario have been\nproposed (disk migration, planet scattering, secular migration, etc.),\nnone seems capable of satisfying all observational constraints. The\nrecent discovery of two low-mass planetary companions\n\\citep{Becker:2015} close to the hot Jupiter WASP-47b\n\\citep{Hellier:2012} further obfuscates the picture. Motivated by the \nlarge population of low mass, closely-packed planets at small\ndistances away from their host stars\n\\citep{Mayor:2011,Howard:2012,Borucki:2011,Lissauer:2011}, and by the\nrealization that some of them could have accumulated enough mass to\nundergo run-away gas accretion \\citep{LeeChiang:2014},\n\\citet{Boley:2015,Batygin:2015} argue that WASP-47b, and possibly all\nhot Jupiters, are formed {\\it in-situ}, instead of  somehow being\ntransported inward.  Only a tiny fraction of super-Earths need follow\nthis path to be able to match the occurrence rate of hot Jupiters.\n\nWhile this seems a reasonable proposal for WASP-47b, could it \nexplain the majority of hot Jupiters? To answer this, we focus on the\nfollowing issue: is WASP-47b a generic hot Jupiter in terms of\nco-habiting with other planets? Currently, this question is\nbest addressed by exploiting the {\\it Kepler}  data to look for\nsmall transiting bodies in systems hosting (either confirmed or\ncandidate) hot Jupiters. If we find that WASP-47b is truly unique\namong all hot Jupiters, it may suggest that the formation of hot\nJupiters can have multiple pathways, with a minority being formed {\\it\n  in-situ}.\n\nThere is a second goal to our paper: the warm Jupiters (WJs). By this term \nwe refer specifically to those giant planets orbiting between 10 days and \n200 days in period. Unlike the hot Jupiters (inward of 10 days), they are \ntoo far out to have experienced little if any tidal circularization and \ntherefore may be difficult to migrate inward by mechanisms that invoke \nhigh-eccentricity excitation. On the other hand, they live inward of the \nsharp rise of giant planets outside $\\sim$ 1AU -- in fact, the period \nrange of warm Jupiters corresponds to the so-called 'period-valley', \nthe observed dip in occupation in-between the hot Jupiters and cold Jupiters \n\\citep[e.g.,][]{Mayor:2011,Wright:2012,Santerne:2015}. In contrast with hot \nJupiters, no theories have been proposed to explain the existence of \nthis class of objects. So in this paper, we hope to gain some insights \nby studying their companion fraction.\n\n\n\nThere have been multiple past claims that hot Jupiters lack sub-Jovian \n(and Jovian) close companions, by using RV data \n\\citep{Wright:2009}, by inferring from (the lack of) transit timing \nvariations in these objects \n\\citep{Steffen:2005,Gibson:2009,Latham:2011,Steffen:2012}, and by \nsearching for other transiting companions in the same systems \\citep{Steffen:2012}.\nThe last study, in particular, is closest to our work in spirit. \nUsing preliminary candidates resulting from the first four month \nof the {\\it Kepler} Mission (63 HJs and 31 WJs, defined differently \nfrom here), \\citet{Steffen:2012} found a difference between the two \npopulations: while none of the HJs have any transiting companions, \nfive of the 31 WJ candidates do. This leads them to suggest that \nHJs and WJs may be formed differently. However, due to the limitation \nof the short baseline of early stage {\\it Kepler} data, and their \ncrude criteria for candidate selection, their companion fractions \nare largely uncertain. For instance, among the five WJ candidates \nthat are claimed to have companions: Kepler-18d, with a radius of \n$0.6 R_J$, is actually a hot Neptune \\citep{Lithwick:2012}; KOI-190.01 \nis a diluted eclipsing binary \\citep{Santerne:2012}; and KOI-1300.01 is \nan eccentric eclipsing binary \\citep{Ofir:2012}. This highlights \nthe possible confusion ensued when selecting candidates based \non early {\\it Kepler} light-curves. Fortunately, four years down \nthe road, we not only have the full four year {\\it Kepler} dataset \nat our disposal, we also have a large number of confirmed Jovian \nplanets to inform us on the selection of candidates. We use \nboth of these to our advantage and revisit the issue of \ncompanion fractions for close-in Jovian planets. \n        \nOur paper proceeds as follows. We first describe how we select \nour samples of hot and warm Jupiters from the {\\it Kepler} data \nand how we evaluate our selection completeness in \nSection \\S \\ref{sec:data}; the companion fractions of the two \npopulation are estimated and presented in \nSection \\S\\ref{sec:result}. We discuss the implication of our result \nin Section \\S \\ref{sec:discussion} on the formation paths of hot \nJupiters and warm Jupiters.\n\n\\section{Companion Fractions in {\\it Kepler}}\\label{sec:data}\n\n\\subsection{Sample selection}\n\nWe aim to construct a clean and complete giant planet sample from the\nfull set of {\\it Kepler} data with period range from 0.5 to 200 days. We \nselect the planet candidates with shorter period range (0.5 to 34 days) \nfrom the Kepler Object of Interests (\\anchor{\nhttp://exoplanetarchive.ipac.caltech.edu/cgi-bin/TblView/nph-tblView?app=ExoTbls\\&config=cumulative\\&constraint=koi\\_pdisposition+like+\\%27CANDIDATE\\%27|}{cumulative table}), \nand then compensate the list of longer period planets from existing \nliteratures studying {\\it Kepler} giant planets. We ensure a uniform selection \nof all candidates by making the same selection threshold as presented \nbelow on planet candidates from both origins. \n\nWe start with all the candidates with radii between 8-20\n$R_{\\rm E}$.  We then restrict ourselves to those\naround stars with more reliable stellar parameters in the Kepler Input\nCatalog (with stellar effective temperatures between 4500 and\n6500K). To reduce the false positive rate in the sample, we also\nrequire each of the planetary candidate to have a fitted impact\nparameter smaller than 0.9, and a fitted stellar density from transit\nparameters between 0.2${\\, \\rm g}\\,{\\, \\rm cm}^{-3}$ and 5${\\, \\rm g}\\,{\\, \\rm cm}^{-3}$\n\\citep{Seager:2003}.  We further remove candidates that have\ndetectable secondary eclipses, or ellipsoidal variations, or centroid\nshifts during transit events.\n\nThe completeness and robustness of the {\\it Kepler} candidates\ndecreases for giant planets with longer orbital periods. A few \nteams released their own catalog of long period planetary \ncandidates discovered within the {\\it Kepler} data\n\\citep[i.e.]{Wang:2013}. In particular, \\citet{Dawson:2015} selected \n31 KOIs with orbital periods longer than 34 days by using the combined \ncatalog from all available sources (we refer to their Appendix A for \ntheir selection details).\n\nWe include the 22 candidates from \\citet{Dawson:2015} that have\norbital periods between 34 day and 200 day to complement our above\nselection, but reject five planetary\ncandidates from that sample because of their\nV-shaped transits and/or anomalously large radius \\citep[also see\n``exceptional candidate treatment\" section of][]{Dawson:2015}.  These\nwarm Jupiters matched our selection criterion for the KOIs with\nshorter orbital period. Therefore combining both samples preserves a\nuniform selection. We refer to our sample as the {\\it Kepler} giant\nplanet sample in the text hereafter and do not specifically\ndistinguish in the text between the concept of ``planets\" and ``planet\ncandidates\".\n\nWe present our final sample in Tables\n\\ref{table:hjplanet} \\& \\ref{table:wjplanet}. This sample\nincludes all of the 40 confirmed giant planets from the\ncatalog summarized by \\citet{Santerne:2015} matching \nour designed planet period and stellar properties range. \nWith our definitions of hot Jupiters and warm Jupiters, \nour sample includes 45 HJs (28 confirmed), and 27 WJs (12 confirmed). \nIt does not, however, include the hot Jupiter WASP-47b, since it is \nnot observed by the {\\it Kepler} main mission. \n\nIn Fig.  \\ref{fig:fluxradius}, we compare the sizes of these objects\nwith known Jupiters, as a function of their incident irradiation\nflux. They appear to fall into similar region, \nsuggesting that the fraction of false positives in our sample is\nsmall. More quantitatively, \\citet{Morton:2012} developed a\nstatistical frame work to quantify the false\npositive probability of {\\it Kepler} candidates. Judging by\nhis values for the unconfirmed objects\n  in our sample (Tables \\ref{table:hjplanet} \\&\n\\ref{table:wjplanet}), majority of them have\nnegligible probabilities to be false positives.\n\n\n\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{FluxRadius.eps}\n\\caption{The radius of our selected planets versus the incident flux\n  they receive, compared with all the known transiting hot Jupiters\n  (black *) and confirmed {\\it Kepler} giant planets (red crosses). We\n  separated our sample into two groups, the hot Jupiters ($P<10 day$) are in\n  purple dots, and the ones with longer orbital period (warm Jupiters) in green\n  dots. }\n\\label{fig:fluxradius}\n\\end{figure}\n\n\\subsection{Search and completeness of small-sized planets}\n\nWe seek additional companions in systems hosting our\nselection of giant planets. To address the possibility that the giant\nplanet transit signals would influence the detrending process and \nthe transit search algorithm, we first remove all of their \ntransits from the {\\it Kepler} raw (simple aperture, SAP) light\ncurves. This is done by creating data gaps\nin the light curves with a width $1.1\\times$ the fitted transit\nduration and centred on each expected giant planet transit. We then\ndetrend the light curves following \\citet{Huang:2013} and search for\nadditional transit signals using a Box Least Square (BLS)\nalgorithm. Any BLS peak detected with a transit dip significance\n(signal-to-noise of the transit signal) higher than 10 is investigated to \ncheck if it is due to a planet signal. \n\n\nMoreover, we can also calculate the\n  completeness of detection for a planet of a given size and\n  at a given period, based on an estimated signal-to-noise ratio,\n\n", "index": 1, "text": "\\begin{equation}\n{\\rm SNR} = \\frac{\\delta}{\\rm CDPP}\\times \\sqrt{N_{\\rm transit}}\\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\rm SNR}=\\frac{\\delta}{\\rm CDPP}\\times\\sqrt{N_{\\rm transit}}\\,.\" display=\"block\"><mrow><mrow><mi>SNR</mi><mo>=</mo><mrow><mfrac><mi>δ</mi><mi>CDPP</mi></mfrac><mo>×</mo><mpadded width=\"+1.7pt\"><msqrt><msub><mi>N</mi><mi>transit</mi></msub></msqrt></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\n\nThe individual terms above can be expressed as the following: \n\n\n", "itemtype": "equation", "pos": 39411, "prevtext": "\nHere, $\\delta$ is the expected transit depth for the planet, $N_{\\rm\n  transit}$ the number of transits in the entire {\\it Kepler}\nlight curve, and CDPP the combined differential photometric precision\nof the light curve over the transit duration time-scale.  \n\\citet{Fressin:2013}\nreported that $99.9\\%$ of the {\\it Kepler} candidates with a\nsignal-to-noise ratio (SNR) larger than $10.1$ will be detected by the\n{\\it Kepler} pipeline.\nWhen calculate the completeness, we define a planet as detectable \nif this SNR is greater than $10$. A\nhistogram of the 6.5-hour CDPP values for host stars in our sample \nis shown in Figure \\ref{fig:cdpphist}. The host stars of HJs \nand WJs have similar noise properties in their light curves. So \nwe expect similar detection completeness in these two groups.\n\nWe report the detection completeness thus estimated in \nFigure \\ref{fig:completeness}, averaged over the cohorts of HJ and WJ \nsystems separately. As expected, they look rather similar. We further \nverify this estimation by performing a signal-injection-and-recovery\nexperiment. We inject into the HJ light curves transit signals by \nplanets of orbit period around 10 days and various sizes \n($2 R_{\\rm Earth}, 1.5 R_{\\rm Earth}$ and $1 R_{\\rm\n  Earth}$). We obtain recovery rates of 100$\\%$, 93$\\%$ and 51$\\%$ at\nthese sizes. These match the above estimation using light curve CDPPs.\n\nAlso shown on Fig. \\ref{fig:completeness} are the positions of the \ntwo small companions of WASP-47b. If present, they should be \ntrivially detected around any of the giant planets.\n\n    \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{cdpp_all.eps}\n\\caption{Histogram of the 6.5 hour\n  CDPP for the light curves of the host stars in our {\\it Kepler}\n  giant planet sample.  Those with hot Jupiters are shown in black,\n  while those with warm Jupiters are shown in\n  red. The two populations have similar noise properties.} \n  \\label{fig:cdpphist}\n\\end{figure}\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=0.8\\textwidth]{Completeness.eps}\n\\caption{The detection completeness \n    as a function of planet size (in Earth radius) and\n    orbital period (in day) for our systems. The contours (and\n    black lines) show the averaged completeness of all HJ systems,\n    while the red lines show that for the WJ systems. They are\n    similar. For planets larger than $2 R_{\\rm Earth}$, we are $>90\\%$\n    complete out to $50$ days; while for those larger than $1 R_{\\rm\n      Earth}$, we are $>90\\%$ complete out to $\\sim 3$ days. The latter\n    places stringent constraint on the  inner companions of HJs.\n    The interior and exterior companions of WASP-47c are noted here. \n    They are trivially detectable around all\n  systems. }\n\\label{fig:completeness}\n\\end{figure*}\n\n\\subsection{Results} \\label{sec:result}\n\nWe summarize our search results in Table \\ref{tab:companions}. \nWe find that, while none of the HJs has any transiting companion, 11 (out of 27) \nof the WJs do. All of these companions have also been reported by the \n{\\it Kepler} candidate catalog. We display\nthe architecture of these multiple systems in Figures \\ref{fig:periodradius} \\&\n\\ref{fig:companions}. \n\n\\begin{table}\n\\centering\n\\begin{tabular}{ccccc}\n\\hline\\hline\n group & total & $N_{\\rm multi}$ & Inner & Outer\\\\\n \\hline\n HJ & 45 & 0 & 0& 0\\\\\n\nconfirmed HJ & 28 & 0 & 0 & 0\\\\\n \\hline\n WJ & 27 & 10 & 10 & 3\\\\\n\n confirmed WJ & 12 & 7 & 7 & 2 \\\\\n \\hline\n\\end{tabular}\n\\caption{Summary of transiting companions for {\\it Kepler} giant planets. }\n\\label{tab:companions}\n\\end{table}\n\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Period_radius.eps}\n\\caption{Periods and radii for our sample of giant planets and their\n  neighbours.  The giant\n  planets that have companions are marked out in red  and are\n  connected to their companions by lines. Only warm Jupiters appear to belong in\n    multiple systems.\n}\n\\label{fig:periodradius}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{multi.eps}\n\\caption{Similar to Fig. \\ref{fig:periodradius} but showing more\nclearly the architecture of our multiple systems (around warm\nJupiters).  The planets are laid out in $\\log P$, with the size of the\ndot representing the size of the planet. The confirmed systems are noted\nby their {\\it Kepler} names. {\\bf Kepler-419} system is counted as a single warm Jupiter \nsystem in our calculation, given the companion is far away.}\n\\label{fig:companions}\n\\end{figure}\n\n\nAssuming all companions to the giant planets transit, we can estimate \nsimply the companion fraction using results in Table \n\\ref{tab:companions}. We focus on companions inward of $50$ \ndays and larger than $2 R_{\\rm Earth}$, since this population should \nbe detected nearly completely ($>90\\%$), and since \nmost of the companions we find do fall in this range. We term these \n{\\bf ``close''} companions.\nWe treat the problem as an estimation of the distribution of the event\nsuccess rate $p$ for a binomial distribution having observed $s$\nsuccesses in $n$ trials, for which each system is assumed to have\nequal weight. We imply a Jeffrey's prior (${\\rm Beta}(0.5,0.5)$) on\n$p$ \\footnote{Jeffrey's prior tends to give a larger uncertainty in the result compare to \na uniform prior, and avoids the diverge of PDF towards $p=0$.}. \nThe posterior distribution of $p$ can be expressed as ${\\rm\n  Beta}(s+0.5,n-s+0.5)$ \\citep{Everson:2002}.  We thereby\nobtain a multiplicity rate of hot Jupiters of\n$0.52^{+5.0}_{-0.52} \\%$, while that for warm Jupiters is $37.2^{+18.6}_{-16.3}\\%$. \nThroughout this work, we present results in terms of \nthe median of the distribution and their $95\\%$ confidence interval.\n  \nIf we only use the confirmed planet systems, the \nestimated multiplicity rate for hot Jupiters is ${\\rm Beta}(0.5,28.5)=0.8^{+7.7}_{-0.8}\\%$, \nand for warm Jupiters is ${\\rm Beta}(8.5,4.5)=58.1^{+23.9}_{-26.9}$. \nThis latter value, however, should be taken with caution as \nthe confirmed systems are likely to bias towards multiple system \n(they are usually prioritized during radial velocity follow-up observations).\n\n\n \\begin{table*}\n\\centering\n\\caption{The probability for a giant planet to have at least one ``close'' companion \nin the system. \\tablenotemark{a} \\label{tab:finalrate}}\n\\begin{tabular}{ccccc}\n\\hline\\hline\ngroup & candidate fp & mutual inclination & HJ rate ($\\%$) & WJ rate ($\\%$)\\\\\n\\hline\n1 & 0 & 0 & $0.5^{+5.0}_{-0.5}$ & $37.2^{+18.6}_{-16.3}$ \\\\\n\\hline\n 2 & $10\\%$ & $\\sigma_{\\mu}=1.8^o$ & $0.98^{+9.4}_{-0.98}$ & $58.1^{+31.7}_{-31.0}$\\\\\n\n3 & $10\\%$ & uniform & $8.4^{+46.4}_{-8.0}$ & -\\\\\n\\hline\n4 & $50\\%$ & 0 & $1.1^{+13.3}_{-1.1}$ &  $55.7^{+27.0}_{-31.1}$ \\\\\n\n5 & $50\\%$ & $\\sigma_{\\mu}=1.8^o$ & $1.6^{+19.5}_{-1.6}$ & $69.5^{+24.2}_{-30.8}$ \\\\\n\n6 & $50\\%$ & uniform & $9.1^{+45.8}_{-8.6}$ & -\\\\\n\\hline\n7 & $100\\%$ & 0 & $0.8^{+7.7}_{-0.8}$ & $58.1^{+23.9}_{-26.9}$\\\\\n\\hline\n\\tablenotetext{1}{For case 1,4 and 7, ``close\" companion refer to those with period \nsmaller than 50 days. For case 2,3,5 and 6, only the interior companion of the giant planets are considered.}\n\\end{tabular}\n\\end{table*}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth,trim=0 50 80 20,clip=true]{Multirate.eps}\n\\caption{The probability density distributions for\n  giant planets to have ``close'' companions, defined as inward of\n    $50$ days and larger than $2 R_{\\rm Earth}$. Here we assume that\n    all planets in a given system transit. The top panel\n  compares the companion rates for hot Jupiters (blue) and warm\n  Jupiters (red) in our standard Monte Carlo model \n    where the candidate false positive rate is assumed to be $50\\%$.  \n    Points with error-bars indicate the median of the\n  distribution and its $95\\%$ confidence interval. The middle panel\n  assumes that all unconfirmed candidates are\n  real planets ($fp = 0$), whereas the bottom panel assumes that\n  they are all false positives ($fp = 100\\%$) and only confirmed\n    planets are included.  The two populations of giant planets\n    are incompatible in all cases.}\n\\label{fig:rate}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth,trim=5 20 80\n10,clip=true]{Multirate_interior.eps}\n\\caption{Same as Fig. \\ref{fig:rate} but demonstrating the impact of\n    mutual inclinations, considering only {\\em inner} companions. \n    The top panel compares the {\\em inner} companion\n  rates using our standard priors, with the\n    histograms corresponding to a case where the mutual inclinations\n    is a narrow Rayleigh distribution with a dispersion of\n    $\\sigma_{\\mu} = 1.8^o$ -- compare these to the co-planar case.\n  The extreme case, marked with ``uniform $cos\\mu$'' for the HJ only,\n    is one where we assume that the orbital planes for hot Jupiters and their inner\n    companions are un-correlated. The bottom\n  panel shows the same content but for a smaller false positive\n  rate of $fp = 10\\%$, a value that we deem more plausible for our\n  sample.}\n\\label{fig:rate_interior}\n\\end{figure}\n\n\n\\subsubsection{Monte Carlo Simulation}\n\nTo have a more realistic estimation that takes into account of a\nmultitude of observational uncertainties, we perform a Monte Carlo\nMarkov Chain simulation with emcee \\citep{Foreman-Mackey:2013} to\nconstrain the rate of multiplicity. \n\nFor our standard MCMC model, we again assume all companions transit (a\nflat system), and we adopt a false positive rate of $50\\%$ for the\nunconfirmed planets in our sample. We continue to focus on\n  ``close'' companions for which our detection capacity is nearly\n  complete.  We also account for the scatter of the Neptune\npopulation into our sample. The details are laid out in Appendix\n\\ref{sec:stats} and the results are shown in the top panel of Figure\n\\ref{fig:rate}. We obtain that hot Jupiters have a multiplicity rate\nof $1.1^{+13.3}_{-1.1}\\%$, and warm Jupiters have a multiplicity rate\nof $55.7^{+27.0}_{-31.1}\\%$, largely unchanged from our previous\nestimates.\n\nIn the following, we relax or alter some of the assumptions in our \nstandard model. Results of all these experiments are summarized in \nTable \\ref{tab:finalrate}.\n\n\\subsubsection{Impact of false positives}\n\nFig. \\ref{fig:rate} compares the results when \ndifferent false positive rates for the unconfirmed systems are \nadopted. The overall effect of a smaller false-positive rate is to \nreduce the companion fraction for WJs, since the confirmed WJs have \na higher multiplicity than the unconfirmed ones.\n\nWe note that the false positive rate we adopt for our standard model \n($fp = 50\\%$) is likely too pessimistic for our sample. \nThis value is derived by \\citet{Santerne:2015} for all giant \ncandidates in the entire {\\it Kepler} candidate sample, while we \nbenefit from additional filtering based on follow-up measurements \nand additional vetting on the light curves. In fact, the individualized \nfalse-positive rates (Morton et al, 2016, in prep) for the unconfirmed \nobjects in our sample are in general low. We regard a more \noptimistic value of $fp =10\\%$ to be more suitable for our WJ candidates. \nWe will present more results for this false positive rate below.\n\n\n\n\\subsubsection{Impact of mutual inclination}\n\nSo far, we have assumed that the companions always\ntransit. \\citet{Fabrycky:2014} found that the {\\it Kepler} multiple\nsystems are indeed quite coplanar \\citep[also\nsee][]{Figueira:2012,FangMargot:2012,Tremaine:2011}.  Assuming that\nthe mutual inclination ($\\mu$) dispersion follows a Rayleigh\ndistribution, the inferred dispersion $\\sigma_\\mu$ typically lies in\nthe range 1.0$^{\\circ}$-2.2$^{\\circ}$. We investigate how this \naffects our results. \n\nWe consider only the possibility that the giant planet systems to have a\nnon-transiting companion interior to the giant planet. \nAs the transit probability is now a function of orbital period, \nwe need to assume a period distribution for the companion.\nThe occurrence rate of sub-Jovian planets is roughly flat in the log \nperiod space, and falls off for short periods \\citep{Howard:2012,Dong:2013}. \nWe assume the occurrence rate of the companion is flat in $\\log P$ for\nWJs, with a inner cut-off period of 1 day, and a power-law depends on\nperiod for HJs, with a inner cut-off period of 0.5 day. We simulate \nthe rate of interior companion assuming the prior of the mutual inclination \nis a Rayleigh distribution with $\\sigma_{\\mu}=1.8^{\\circ}$ for both the HJs and\nWJs. To explore the extremes, we also simulate the rate of interior\ncompanion for HJs assuming the $\\cos\\mu$ distribution is uniform\nbetween 0 and 1. The distribution of interior companion rate is\nconstrained as in Figure \\ref{fig:rate_interior}, upper panel using a false positive rate of \n$50\\%$. We show that assuming the same mutual inclination distribution, the median of\nthe multiplicity rate distribution of HJs and WJs both shift to a\nhigher value, but their $95\\%$ confidence interval do not overlap with\neach other. Even with the extreme case that the HJ companions have an\nuniform cosine mutual inclination distribution, the $95\\%$ confidence\ninterval of its distribution exclude the median of the WJ companion\nrate distribution. The conclusion holds with a $10\\%$ false positive \nrate (lower panel of Figure \\ref{fig:rate_interior}). If we assume instead a \nuniform logP distribution for the HJ companions, similar to that of the WJ's, the\nconclusion will be stronger since it allows less non-transiting\ncompanions.\n\nFor interior companions of HJs, we are able to constrain the detection \nof planets with size larger than 1.5 $R_{\\rm Earth}$ to be complete \nup to 10 days. However, this conclusion can be extended to 1$R_{\\rm Earth}$ \nif we correct for detection completeness assuming $df/dlogR$ is constant \nbetween 1-3 $R_{\\rm Earth}$ as suggested by \\citet{Petigura:2013}.\nIn reality, majority of the HJs have orbital period smaller than 5 days, \nthis allows us have almost complete detection to 1 $R_{\\rm Earth}$ regardless of \nthe size distribution.\n\nThe rate of exterior companions is extremely sensitive to the distribution \nof mutual inclinations, it is difficult to obtain a good constraint. If we \nassume every giant planet with interior companion also have an exterior companion, \nand that the interior and exterior companions have the same mutual inclination \ndistribution (a Rayleigh distribution with $\\sigma_\\mu=1.8^{\\circ}$), the \nobserved number of systems with exterior companion is expected to be a \nquarter of those with interior companions due to the transit probability \nand detection completeness. This is not in contradiction with the current \nobservations. \n\n\n\\section{Discussions}\\label{sec:discussion}\n\nOur main results (Fig. \\ref{fig:rate} and \\ref{fig:rate_interior}),\nthat HJs have companion fraction consistent with zero, while about\nhalf of WJs have close neighbours, reveal much about\ntheir respective formation mechanisms, as we discuss here.\n\n\\subsection{Two populations of Warm Jupiters?}\n\nTwo previous works have suggested that warm Jupiters are not all the\nsame beasts.  Using RV data, \\citet{Dawson:2013} suggested\nthat eccentric WJs tend to orbit around metal rich stars, while\nplanets around metal poor stars have predominately circular orbits.\nLater, also based on RV data, \\citet{Dong:2014} showed that more than\nhalf of the eccentric WJs ($e > 0.4$) have distant, Jovian companions,\nwhile the low-eccentricity WJs tend to be 'single'.  Taken together,\nthese suggest that more Jovian planets are produced around metal-rich\nstars, and this somehow raises the eccentricities of WJs (via either\nsecular perturbations or planet-planet scatterings). \n\n\nOur study of the {\\it Kepler} transit data adds a further dimension to\nthe picture. At least half of the WJs in our sample are flanked by\nclose, small companions.  Most likely, they are nearly coplanar with\nthese companions (to maximize transit probability), and are also\nnearly circular (so as to prevent dynamical instability in such\nclosely packed systems). RV counter-parts to these objects have been\nfound, e.g., HIP 57274c \\citep{Fischer:2012} which is a nearly\ncircular WJ with a small mass neighbour interior to its orbit, and\n GJ 876c \\citep{Rivera:2010}, and 55 Cnc-b\n\\citep{Endl:55}. However, due to limits on RV precision, most of these\nWJs will in general be observed as 'singles' on largely circular\norbits.\\footnote{In other words, the transit technique is uniquely\n  capable of revealing these small neighbours.}\n\nHow are the warm Jupiters formed? For those with low-mass neighbours,\nit seems sensible to argue that they are formed {\\it in-situ}, i.e.,\nthey undergo run-away gas accretion locally, from originally the\nlow-mass, closely packed planets that are so abundantly discovered by\nthe {\\it Kepler} mission.  This hypothesis is supported by the\nfollowing arguments.\n\n\\begin{itemize}\n\n \n\n\\item Small planets (sub-Jovian) are common around stars, and their\n  frequency rises outward steeply at just the inner edge of our WJ\n  zone \\citep{Howard:2012}, and it remains flat in logarithmic period\n  beyond this cut-off \\citep{Petigura:2013b,Silburt:2015}. \n \n\n\\item Measured masses for some of these small planets are available\n  \\citep[e.g.][]{Weiss:2013,Lithwick:2014}, with some reaching beyond\n  $10 M_{\\rm Earth}$ in solid mass.\n\n\\item Such massive cores can retain a heavy enough atmosphere and\n  undergo run-away gas accretion, at the observed locations for these\n  WJs \\citep[e.g.][]{Rafikov:2006}. Recent theoretical studies of\n  accretion of such an envelope \\citep{LeeChiang:2014,Batygin:2015}\n  further argue that cooling can be sufficiently fast to allow {\\it\n    in-situ} formation of giant planets at these distances.\n\n\\item As the WJ grows in mass, it can keep the planetary configuration\n  largely intact.\\footnote{It will be able to destabilize some of the\n    closest neighbours and ingest them in the process.} As a result,\n  we observe them today still flanked by small neighbours.\n\n\\end{itemize}\n\nAlternative theories such as disk migration,\nwhereby these WJs are formed at larger distances and migrated inward\nby interaction with the protoplanetary disk, and\n  high-eccentricity migration, face the challenge of\nexplaining the presence of small neighbours. \n\nWhat about the other WJs, the ones that have no transiting companions?\nStudies mentioned above argue that these may be a distinct\n  population. However, it needs to be firmly\nestablished that these WJs indeed always have distant Jovian\ncompanions, and/or are largely eccentric, and/or only reside around\nmetal-rich stars.  At\nthe moment, their origin remains an enigma.\n\nAssuming that the lonely WJs in our sample do form a distinct\n  population, we can estimate the\nrelative proportions of these two groups of WJs.  Among the WJs, 10\nout of 27 are in multiple systems, or $37^{+19}_{-16}$ of\nWJs. However, this value can rise to $58^{+31}_{-31}\\%$ if the mutual\ninclination dispersion of the system follows a Rayleigh distribution\npeaked at $1.8 \\deg$. In other words,\nat least half of all WJs are formed {\\it in situ}.\n\n\\subsection{Formation of Hot Jupiters}\n\nWe were initially motivated by the discovery of close companions\naround the hot Jupiter WASP-47b \\citep{Becker:2015}. After having\nestablished the general patten among hot and warm Jupiters, we return\nto reflect upon the existence of this particular system.\n\nWASP-47b was first identified by ground-based photometry, and \nthen verified with radial velocity measurements\n\\citep{Hellier:2012}. Thanks to this detection, it was proposed as a\ntarget for the K2 mission. In the meantime, the radial-velocity\nmonitoring of the system unveiled a second, long period gas giant\n\\citep{NeveuVanMalle:2015}.  \\citet{Becker:2015} analyzed the K2 data\nand announced the presence of two super-Earths, one inner to the hot\nJupiter, and one between both gas giants. The two low-mass companions\nof WASP-47b were discovered in a targeted observation, so it is\ndifficult to ascertain their statistical importance. However, we can\nset an upper limit on the frequency of such objects, based on the\nabsence of neighbours in our hot Jupiter sample. This is $1.0^{+9.5}\n_{-1.0}\\%$ among all hot Jupiters, assuming a candidate false positive\nrate of $10\\%$ and a mutual inclination dispersion of $1.8 \\deg$\n(Table \\ref{tab:finalrate}).\n\n\nThis leads us to believe that WASP-47b is a rather unique system among\nhot Jupiters, themselves rare systems. Based on our\ndiscussion above, we further speculate that since more than half of\nWJs may be formed {\\it in-situ}, this path may found its way into the\nperiod domain of HJs. Or, WASP-47b is also formed {\\it in-situ}\n\\citep{Boley:2015,Batygin:2015}, and is a tail of the {\\it in-situ}\nWJs.  Given the relative numbers of hot Jupiters (one, WASP-47b) and\nwarm Jupiters (7 out of the confirmed sample of 12) in multiple \nsystems, and the lower transit probability of WJs, this would \nsuggest that the {\\it in-situ} process is increasingly difficult \nfor closer-in planets, with WASP-47b being the hottest \nrepresentative of the warm Jupiter population.\n\nWhere do majority of the hot Jupiters come from then? We \nturn to the observations for answer.\nMany of the dynamical migration processes that are invoked to\n  explain hot Jupiters invariably produce the so-called 3-day pile\nup, an excess of HJs near 3-day orbital period. Such a pile-up,\noriginally discovered among RV population \\citep{Wright:2009}, but\nthen found to be absent in the {\\it Kepler} transit data\n\\citep{Howard:2012}, and then re-discovered recently through careful\nRV falsification of the transit candidates \\citet{Santerne:2015}, now\nseems here to stay. This lends support to the hypothesis that hot\nJupiters are products of violent dynamical processes.\n\n\\section{Concluding words}\n\n\nWhen we set out on this project, we wondered whether WASP-47b is a\ncommon-place hot Jupiter in terms of small neighbours.  By examining\nthe Kepler hot Jupiters, we found that systems such as WASP-47b are\nrare among the hot Jupiters -- among our statistical sample of 45 (28\nconfirmed) hot Jupiters, none shows small companions, either inner or\nouter.\n\nIn contrast, we found that among our warm Jupiter sample, half or more\nhave nearly coplanar, small companions.  Most of\n  these are inner companions, and given the fact that exterior\n  companions are less likely to transit, the data give the\n  impression that they are at least as common as the inner ones (Table\n  \\ref{tab:companions}).\n\nSo not only do hot Jupiters and warm Jupiters appear to be separated\nin their period distributions \\citep{Santerne:2015}, they are also\ndistinct in their respective fractions of close neighbours.\n\nMotivated by this discovery, and by recent theoretical progress in\nunderstanding gas accretion, we propose that a significant fraction of\nwarm Jupiters are formed {\\it in-situ}. \nThe prevalence of multiple low-mass planets in close proximity to one\nanother and to the star can, in a fraction of the cases, permit some\nof the planets to accrete enough envelope and to trigger run-away\ngrowth. This process can operate in the warm Jupiter locale, but \nappears to become increasingly difficult towards the hot Jupiter region,\nexplaining the rarity of systems like WASP-47b.\n\nFuture lines of work to extend our results include,\n\\begin{itemize}\n\n\\item The true neighbour fractions of warm Jupiters is sensitive to\n  the inclination dispersion in the system, as well as the false\n  positive rate of our warm Jupiter sample (Table\n  \\ref{tab:finalrate}). Both could be improved. Specifically, further\n  photometric and Radial Velocity monitoring of the confirmed warm\n  Jupiters discovered by ground based transit surveys, such as\n  HAT-P-15b \\citep{Kovacs:2012}, HATS-17b \\citep{Brahm:2015}, are\n  likely to reveal the presence of companions, if\n  current statistics holds.\n\n\\item Masses for these close companions are interesting. They may\nyield the critical mass above which runaway gas accretion occurs.\n\n\\item Multiple lines of evidences suggest that there may be a second\n  population of warm Jupiters. But data are inconclusive at the\n  moment. Studies of warm Jupiter eccentricity distribution, host star\n  metallicity distribution, presence of giant planet companions,\n  etc. may help answer whether there is a second pathway to form warm\n  Jupiters.\n\n\\item The {\\it in-situ} warm Jupiters accrete their gas inward of \n    the ice-line. As such, their envelope water content should \n    not be depleted by condensation. This may contrast with those \n    that accrete their gas beyond the iceline (barring core erosion \n    in these bodies) and may be testable by transmission spectroscopy.\n\n\\item Using transit data, we can exclude inner neighbours of hot\n  Jupiters, but the constraint is less stringent for the outer\n  neighbours, especially if they may be highly misaligned\n  \\citep{Batygin:2015}.  Radial velocity study is necessary.\n\n\\item If outer neighbours are indeed also absent among hot Jupiters,\n  theoretical study is needed to explain the rarity of {\\it in-situ}\n  formation for hot Jupiters, vs. that of warm Jupiters.\n  \n\n\n\\end{itemize}\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\n\nReferences to exoplanetary systems were obtained through the use of\nthe paper repositories,\n\\anchor{http://adsabs.harvard.edu/abstract\\_service.html}{ADS} and\n\\anchor{http://arxiv.org/archive/astro-ph}{arXiv}, but also through\nfrequent visits to the \\anchor{http://exoplanet.eu}{exoplanet.eu}\n\\citep{Schneider:2011} and\n\\anchor{http://exoplanets.org}{exoplanets.org} \\citep{Wright:2011}\nwebsites.  This paper includes data collected by the Kepler\nmission. Funding for the Kepler mission is provided by the NASA\nScience Mission directorate. Some of the data presented in this pa-\nper were obtained from the Multimission Archive at the Space Telescope\nScience Institute (MAST). STScI is operated by the Association of\nUniversities for Research in Astronomy, Inc., under NASA contract\nNAS5-26555. Support for MAST for non-HST data is provided by the NASA\nOffice of Space Science via grant NNX09AF08G and by other grants and\ncontracts. This research has made use of the NASA Exoplanet Archive,\nwhich is operated by the California Institute of Technology, under\ncontract with the National Aeronautics and Space Administration under\nthe Exoplanet Exploration Program.\n\n\n\\appendix\n\\section{Statistical Frame Work}\n\\label{sec:stats}\n\n\nThe observed giant planet multiplicity systems $N_{\\rm obs,m}$ can \narise from four origins: the confirmed multiple planet \nsystems $N_{\\rm obs,p,m}$, candidate multiple planet \nsystems $N_{\\rm obs,gc,m}$ with at least a giant planet, candidate \nmultiple planet systems with the most massive planet being Neptune \nnature $N_{\\rm obs,nc,m}$, and false positive multiple systems due to \nbinary contamination $N_{obs,s,m}$. We assume the \ncontribution to the multiple system with a giant planet from \nfalse positives ($N_{\\rm obs,s,m}$) to be negligible \\citep{Lissauer:2014}.  \n\n\n", "index": 3, "text": "\\begin{equation}\nN_{\\rm obs,m} = N_{\\rm obs,p,m} + N_{\\rm obs,gc,m} + N_{\\rm obs,nc,m}. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm obs,m}=N_{\\rm obs,p,m}+N_{\\rm obs,gc,m}+N_{\\rm obs,nc,m}.\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>=</mo><mrow><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi mathvariant=\"normal\">p</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>+</mo><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi>gc</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>+</mo><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi>nc</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nin which, $N_{\\rm p}$ is the total number of confirmed system we have, $f(g,m)$ is \nthe rate of giant planet system having a close-in companion, $f(d)$ is the \nprobability for this companion to be detected. \n\nThe number of multiple systems originated from ``Jupiters\" and ``Neptunes\" can be \nestimated as:\n\n", "itemtype": "equation", "pos": 39580, "prevtext": "\n\nThe individual terms above can be expressed as the following: \n\n\n", "index": 5, "text": "\\begin{equation}\nN_{\\rm obs,p,m} = N_{\\rm p}f(g,m)f(d), \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm obs,p,m}=N_{\\rm p}f(g,m)f(d),\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi mathvariant=\"normal\">p</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>=</mo><mrow><msub><mi>N</mi><mi mathvariant=\"normal\">p</mi></msub><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo>,</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>d</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nand \n\n", "itemtype": "equation", "pos": 39958, "prevtext": "\nin which, $N_{\\rm p}$ is the total number of confirmed system we have, $f(g,m)$ is \nthe rate of giant planet system having a close-in companion, $f(d)$ is the \nprobability for this companion to be detected. \n\nThe number of multiple systems originated from ``Jupiters\" and ``Neptunes\" can be \nestimated as:\n\n", "index": 7, "text": "\\begin{equation}\nN_{\\rm obs,gc,m} = N_{\\rm pc}f(g)f(g,m)f(d),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm obs,gc,m}=N_{\\rm pc}f(g)f(g,m)f(d),\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi>gc</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>=</mo><mrow><msub><mi>N</mi><mi>pc</mi></msub><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo>,</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>d</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nin which $f(g)$ is the fraction of giant planets in the our selected radius \nrange, $f(g,m)$ and $f(n,m)$ is the probability a Jupiter/Neptune size planet \nhaving a close-in companion.  \n$N_{\\rm pc}$ is the number of planetary candidates that has planet nature, \n\n", "itemtype": "equation", "pos": 40040, "prevtext": "\nand \n\n", "index": 9, "text": "\\begin{equation}\nN_{\\rm obs,nc,m} = N_{\\rm pc}(1-f(g))f(n,m)f(d),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm obs,nc,m}=N_{\\rm pc}(1-f(g))f(n,m)f(d),\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>obs</mi><mo>,</mo><mi>nc</mi><mo>,</mo><mi mathvariant=\"normal\">m</mi></mrow></msub><mo>=</mo><mrow><msub><mi>N</mi><mi>pc</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>d</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nwith $fp$ denote the false positive rate of a unconfirmed KOI. \n\n\nThe problem can be summarized as a Bayesian problem, in which $N_m$ is \nobservable, and $f(g,m)$,$f(n,m)$,$f(FP)$,$f(g)$ as parameters we want to \nconstrain given the data. We can do this by sampling the posterior space: \n\n", "itemtype": "equation", "pos": 40384, "prevtext": "\nin which $f(g)$ is the fraction of giant planets in the our selected radius \nrange, $f(g,m)$ and $f(n,m)$ is the probability a Jupiter/Neptune size planet \nhaving a close-in companion.  \n$N_{\\rm pc}$ is the number of planetary candidates that has planet nature, \n\n", "index": 11, "text": "\\begin{equation}\nN_{\\rm pc} = (N-N_{\\rm p})\\times(1-fp), \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm pc}=(N-N_{\\rm p})\\times(1-fp),\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mi>pc</mi></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>N</mi><mo>-</mo><msub><mi>N</mi><mi mathvariant=\"normal\">p</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>×</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mi>p</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nThe likelihood $p(\\hat{w_{\\rm obs}} | \\hat{f})$ can be expressed \nas $B(N_{\\rm obs,m}-N_{\\rm obs,nc,m} | f(g,m), N_p+N_{\\rm pc,g})$, in which $B(s|x,N)$ indicate the probability of observing s success given N observations with success rate $x$.  \n\nThe priors $p({\\hat{f}})$ are assumed (estimated) as below. \n\\begin{itemize}\n\\item We use a Jefferey's prior for the multiplicity rate of giant planet $f(g,m)$. \n\n\\item $f(g)$ is the probability of an unconfirmed planet to be a giant planet. We \n    use the posterior of the radius distribution of the candidate to decide the \n    probability of a candidate to have a radius smaller than 8$R_{\\rm Earth}$. We \n    derived the average probability of a unconfirmed HJ to be a Neptune to be Beta(2.06,15.9), \n    and for warm jupiter is Beta(2.65,18.4).\n \n\\item We use the multiplicity rate for the super Neptunes ($4R_{\\rm Earth}<R_p<8R_{\\rm Earth}$) \n    within our designed stellar parameter and period range, in the entire KOI sample \n    (25 out of 140), as a prior for $f(n,m)$. We note that this rate is quite \n    uncertain, \\citep{Mayor:2011} report the multiplicity rate for small planets \n    are $\\sim70\\%$ with an unclear statistic significance. Given the rate of $f(g)$ is \n    small, the choice of f(g) do not impact the final result significantly.\n\n\\item We use two sets of false positive rate. We first use the false positive rate \n    from \\citep{Santerne:2015} to estimate the false positive rate of an unconfirmed \n    candidate $fp$. \\citet{Santerne:2015} identified 46 false positives out of 100 KOIs \n    in the effective temperature and period range we use. For hot Jupiters, the FP rate \n    is $42.8\\%$, and $49\\%$ for warm Jupiters. This is lower than the overall false \n    positive rate reported by \\citet{Santerne:2015}, since the authors found that the \n    false positive rate around stars with $T_{\\rm eff}$ higher than 6500 K is generally \n    higher, which are not included in our sample. We apply a beta distribution prior for \n    the false positive rate. Due to our additional selection on our candidates, the actual \n    false positive rate can be even lower. We use the astrophysical false positive rate \n    estimated by Morton et al (in prep) to obtain a more optimistic value (10\\%).\n\n  \\item We do not attempt to factor in the actual value of\n    the detection completeness $f(d)$ for our estimation of the final\n    rate since the size distribution of small planets have big\n    uncertainties. We note that the detection is complete to 2$R_{\\rm\n      Earth}$ with orbital period less than 50 days for both HJs and\n    WJs. While for interior companions, it is complete for HJs to\n    1.5$R_{\\rm Earth}$. We are able to prove that our conclusions are not changed if \n    extend this size limit to 1$R_{\\rm Earth}$ \n    by assuming $df/dlogR$ is constant between 1-3 $R_{\\rm Earth}$ as \n    suggested by \\citet{Petigura:2013}. Our experiment found out \n    that counting smaller planets is equivalent\n    to assume a more dispersed mutual inclination distribution for\n    both HJs and WJs. Unless the occurrence rate of planet has a \n    steep rise towards small size, it does not impact the companion rate of \n    HJs much, while the companion rate of WJs may shifts to a higher value. \n\n\\end{itemize}\n\nTo take into account the effect of mutual inclination angle dispersion, we compute an \naveraged transit probability for HJs and WJs separately on a mutual inclination grid \nwith $\\cos\\mu$ from 0 to 1. We later on interpolate on this grid to obtain the transit \nprobability at an arbitrary mutual inclination angle in our simulations. Since the \ninclination angle of the giant planet $i_g$ is usually loosely constrained by the transit \nfit, we assume that $\\cos{i_g}$ has a uniform probability as long as the planet transit. We \nalso integrate over the possible period range the companion could take. \n\n", "itemtype": "equation", "pos": 40745, "prevtext": "\nwith $fp$ denote the false positive rate of a unconfirmed KOI. \n\n\nThe problem can be summarized as a Bayesian problem, in which $N_m$ is \nobservable, and $f(g,m)$,$f(n,m)$,$f(FP)$,$f(g)$ as parameters we want to \nconstrain given the data. We can do this by sampling the posterior space: \n\n", "index": 13, "text": "\\begin{equation}\np(\\hat{f} | \\hat{w_{\\rm obs}}) = p(\\hat{f})\\times\\,p(\\hat{w_{\\rm obs}} | \\hat{f}).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"p(\\hat{f}|\\hat{w_{\\rm obs}})=p(\\hat{f})\\times\\,p(\\hat{w_{\\rm obs}}|\\hat{f}).\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">|</mo><mover accent=\"true\"><msub><mi>w</mi><mi>obs</mi></msub><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo rspace=\"4.2pt\">×</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>w</mi><mi>obs</mi></msub><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">|</mo><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\n\nFor the probability of the companion occur at a certain orbital period, we use the formalism \nfrom \\citet{Howard:2012} for the HJs. \n\n", "itemtype": "equation", "pos": 44754, "prevtext": "\nThe likelihood $p(\\hat{w_{\\rm obs}} | \\hat{f})$ can be expressed \nas $B(N_{\\rm obs,m}-N_{\\rm obs,nc,m} | f(g,m), N_p+N_{\\rm pc,g})$, in which $B(s|x,N)$ indicate the probability of observing s success given N observations with success rate $x$.  \n\nThe priors $p({\\hat{f}})$ are assumed (estimated) as below. \n\\begin{itemize}\n\\item We use a Jefferey's prior for the multiplicity rate of giant planet $f(g,m)$. \n\n\\item $f(g)$ is the probability of an unconfirmed planet to be a giant planet. We \n    use the posterior of the radius distribution of the candidate to decide the \n    probability of a candidate to have a radius smaller than 8$R_{\\rm Earth}$. We \n    derived the average probability of a unconfirmed HJ to be a Neptune to be Beta(2.06,15.9), \n    and for warm jupiter is Beta(2.65,18.4).\n \n\\item We use the multiplicity rate for the super Neptunes ($4R_{\\rm Earth}<R_p<8R_{\\rm Earth}$) \n    within our designed stellar parameter and period range, in the entire KOI sample \n    (25 out of 140), as a prior for $f(n,m)$. We note that this rate is quite \n    uncertain, \\citep{Mayor:2011} report the multiplicity rate for small planets \n    are $\\sim70\\%$ with an unclear statistic significance. Given the rate of $f(g)$ is \n    small, the choice of f(g) do not impact the final result significantly.\n\n\\item We use two sets of false positive rate. We first use the false positive rate \n    from \\citep{Santerne:2015} to estimate the false positive rate of an unconfirmed \n    candidate $fp$. \\citet{Santerne:2015} identified 46 false positives out of 100 KOIs \n    in the effective temperature and period range we use. For hot Jupiters, the FP rate \n    is $42.8\\%$, and $49\\%$ for warm Jupiters. This is lower than the overall false \n    positive rate reported by \\citet{Santerne:2015}, since the authors found that the \n    false positive rate around stars with $T_{\\rm eff}$ higher than 6500 K is generally \n    higher, which are not included in our sample. We apply a beta distribution prior for \n    the false positive rate. Due to our additional selection on our candidates, the actual \n    false positive rate can be even lower. We use the astrophysical false positive rate \n    estimated by Morton et al (in prep) to obtain a more optimistic value (10\\%).\n\n  \\item We do not attempt to factor in the actual value of\n    the detection completeness $f(d)$ for our estimation of the final\n    rate since the size distribution of small planets have big\n    uncertainties. We note that the detection is complete to 2$R_{\\rm\n      Earth}$ with orbital period less than 50 days for both HJs and\n    WJs. While for interior companions, it is complete for HJs to\n    1.5$R_{\\rm Earth}$. We are able to prove that our conclusions are not changed if \n    extend this size limit to 1$R_{\\rm Earth}$ \n    by assuming $df/dlogR$ is constant between 1-3 $R_{\\rm Earth}$ as \n    suggested by \\citet{Petigura:2013}. Our experiment found out \n    that counting smaller planets is equivalent\n    to assume a more dispersed mutual inclination distribution for\n    both HJs and WJs. Unless the occurrence rate of planet has a \n    steep rise towards small size, it does not impact the companion rate of \n    HJs much, while the companion rate of WJs may shifts to a higher value. \n\n\\end{itemize}\n\nTo take into account the effect of mutual inclination angle dispersion, we compute an \naveraged transit probability for HJs and WJs separately on a mutual inclination grid \nwith $\\cos\\mu$ from 0 to 1. We later on interpolate on this grid to obtain the transit \nprobability at an arbitrary mutual inclination angle in our simulations. Since the \ninclination angle of the giant planet $i_g$ is usually loosely constrained by the transit \nfit, we assume that $\\cos{i_g}$ has a uniform probability as long as the planet transit. We \nalso integrate over the possible period range the companion could take. \n\n", "index": 15, "text": "\\begin{equation}\n\\bar{f}_{\\rm tran}(\\mu) = \\frac{1}{N} \\int f_{\\rm tran}({\\rm period},i_g,\\mu) P({\\rm period})P(i_g)\\,{\\rm d}{\\rm period}\\,{\\rm d}i_g\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\bar{f}_{\\rm tran}(\\mu)=\\frac{1}{N}\\int f_{\\rm tran}({\\rm period},i_{g},\\mu)P(%&#10;{\\rm period})P(i_{g})\\,{\\rm d}{\\rm period}\\,{\\rm d}i_{g}\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">¯</mo></mover><mi>tran</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>μ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>N</mi></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>f</mi><mi>tran</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>period</mi><mo>,</mo><msub><mi>i</mi><mi>g</mi></msub><mo>,</mo><mi>μ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>period</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>i</mi><mi>g</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>dperiod</mi></mpadded><mo>⁢</mo><mrow><mo>d</mo><msub><mi>i</mi><mi>g</mi></msub></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05095.tex", "nexttext": "\nin which, $\\beta=0.27\\pm0.27$, $\\gamma=2.6\\pm0.3$. For ${\\rm period} <10 day$, this can be \napproximated with $f({\\rm period})\\propto {\\rm period}^2$. We use the latter in our calculation. \nFor WJs, we assume ${\\rm df}/{\\rm dlog}({\\rm period})=C$ instead with a\ncut-off inner period at 1 day. \n\nThe likelihood expression can be revised as $B(N_m | f(g,m)f_{\\rm tran}, N_p+N_{\\rm pc,g})$ \nas a conditional Binomial problem. Here we are assuming that the covariance between $f(g,m)$ \nand $f_{\\rm tran}$ are 0. \n \nWe choose two type of priors for the mutual inclination of HJs, a Rayleigh distribution \nwith $\\sigma_\\mu=1.8$ and a uniform distribution for $\\cos\\mu$ between 0 and 1. We only use \nthe Rayleigh distribution prior for the WJs. \n\n\n\\defcitealias{Almenara:2015}{Al12}\n\\defcitealias{Bonomo:2015}{Bo15}\n\\defcitealias{Rowe:2014}{Ro14}\n\\defcitealias{Bruno:2015} {Br15}\n\\defcitealias{Nesvorny:2012}{Ne12}\n\\defcitealias{Weiss:2013}{We13}\n\\defcitealias{He:14}{He14}\n\\defcitealias{Steffen:2010}{St10}\n\\defcitealias{Cabrera:2013}{Ca14}\n\\defcitealias{Schmitt:2014}{Sc14}\n\\defcitealias{Sanchis:2013}{Sa12}\n\\defcitealias{Schmitt:2014b}{Sc14b}\n\\defcitealias{Dawson:2012}{Da12}\n\\defcitealias{Santerne:2015}{Sa12}\n\\defcitealias{Esteves:2015}{Es15}\n\\defcitealias{Shporer:2011}{Sh11}\n\\defcitealias{OD:06}{Od06}\n\\defcitealias{Southworth:2010}{So10}\n\\defcitealias{Lillo-box:2015}{Li15}\n\\defcitealias{Pal:2008}{Pa08}\n\\defcitealias{Van:13}{Va13}\n\\defcitealias{Buchhave:2011}{Bu11}\n\\defcitealias{Bonomo:2012}{Bo12}\n\\defcitealias{Deleuil:2014}{De14}\n\\defcitealias{Jenkins:2010}{Je10}\n\\defcitealias{Latham:2010}{La10}\n\\defcitealias{Gandolfi:2013}{Ga13}\n\\defcitealias{Santerne:2012}{Sa12}\n\\defcitealias{Faigler:2013}{Fa13}\n\\defcitealias{Endl:2014}{En14}\n\\defcitealias{Koch:2010}{Ko10}\n\\defcitealias{Endl:2011}{En11}\n\n\n\n\n\\begin{deluxetable*}{llccccl}\n\\tabletypesize{\\scriptsize}\n\\centering\n\\tablewidth{0pc}\n\\tablecaption{Kepler Hot Jupiter Systems \\label{table:hjplanet}}\n\\tablehead{\n\\colhead{KIC}&\\colhead{Period}&\\colhead{$R_p$}&\\colhead{$M_p$}&\\colhead{$R_{\\rm star}$}\n& \\colhead{fp rate{\\tablenotemark{a}}} &\\colhead{Other Name/Reference{\\tablenotemark{b}}}  \\\\\n\\colhead{}&\\colhead{[day]}&\\colhead{$[R_{\\rm\n    Earth}]$}&\\colhead{$[M_{\\rm Jup}]$}\n&\\colhead{$[R_\\odot]$} &\\colhead{}  &\\colhead{} \\\\\n}\n\\startdata\n9115800 & 4.454194338 & $12.21^{+7.19}_{-1.6}$ & n/a & $0.915^{+0.539}_{-0.12}$ & 6.5e-5 &KOI-421.01 \n \\\\\n8544996 & 4.082275068 & $10.85^{+4.31}_{-0.81}$ & n/a & $0.707^{+0.316}_{-0.06}$& 2.1e-6 &KOI-913.01  \\\\\n7832356 & 7.886631104 & $9.23^{+3.33}_{-1.62}$ & n/a & $1.135^{+0.409}_{-0.199}$ & 1.3e-11 &KOI-1456.01  \\\\\n4076098&3.990106229&$8.02^{+3}_{-0.69}$&n/a&$0.9130^{+0.341}_{-0.079}$& 9e-5 &KOI1323.01  \\\\\n9643874&8.027680595&$8.89^{+3.39}_{-0.63}$&n/a&$0.887^{+0.338}_{-0.063}$& 1.1e-3 &KOI1457.01  \\\\\n7585481&8.098887986&$9.19^{+4.66}_{-0.85}$&n/a&$1.064^{+0.54}_{-0.098}$& 8.4e-9 &KOI890.01  \n\\\\\n3351888&1.625522200&$9.74^{+3.88}_{-1.24}$&n/a&$1.057^{+0.421}_{-0.135}$& 5.8e-7 &KOI801.01  \n\\\\\n9141746&6.491684259&$10.30^{+6.12}_{-1.24}$&n/a&$1.13^{+0.67}_{-0.14}$& 3.2e-4 &KOI-929.01 \n\\\\\n8255887&4.708326542&$11.10^{+4.17}_{-2.41}$&n/a&$1.21^{+0.46}_{-0.26}$& 4.9e-5 &KOI908.01 \n\\\\\n11138155&4.959319451&$11.88^{+4.91}_{-1.08}$&n/a&$1.025^{+0.424}_{-0.093}$& 1.7e-2 &KOI-760.01 \n\\\\\n10019708&3.268695154&$12.13^{+7.48}_{-1.4}$&n/a&$1.171^{+0.722}_{-0.135}$& 1.3e-10 &KOI-199.01  \n\\\\\n11414511&2.816504852&$12.82^{+4.94}_{-1.39}$&n/a&$0.9650^{+0.371}_{-0.105}$& 5.8e-4 &KOI-767.01  \n\\\\\n9595827&3.905081985&$13.14^{+0.86}_{-0.49}$&n/a&$0.8870^{+0.058}_{-0.033}$& 8.1e-4 &KOI-217.01 \n \\\\\n12019440&3.243259796&$13.63^{+6.16}_{-1.23}$&n/a&$1.0290^{+0.465}_{-0.299}$& 1.7e-3 &KOI-186.01  \n\\\\\n8323764&6.714251076&$16.46^{+6.05}_{-1.79}$&n/a&$0.8^{+0.29}_{-0.084}$ &3.4e-2 & KOI-3767.01  \n\\\\\n6849046&4.225384512&$9.00^{+1.76}_{-0.66}$&n/a&$1.05^{+0.21}_{-0.08}$& 0 &KOI-201.01 \\citepalias{Santerne:2015} \n\\\\\n7778437&5.014234575&$10.31^{+7.57}_{-1.54}$&n/a&$1.31^{+0.26}_{-0.26}$& 0 & KOI131.01 \\citepalias{Santerne:2012} \n\n\\\\\n7017372&5.240904530&$12.84^{+6.69}_{-2.52}$&n/a&$1.41^{+0.59}_{-0.24}$& 0 &KOI-3689.01 \\citepalias{Santerne:2015} \n\n\\\\\n757450&8.884922680&$11.30^{+0.66}_{-0.66}$&$9.9^{+0.5}_{-0.5}$&$0.88^{+0.04}_{-0.04}$& 0 &Kepler-75b \\citepalias{Bonomo:2015} \n\\\\\n4570949&1.544928883&$14.92^{+1.32}_{-1.32}$&$2.01^{+0.37}_{-0.35}$&$1.32^{+0.08}_{-0.08}$& 0 & Kepler-76b \\citepalias{Faigler:2013} \n\\\\\n5357901&3.797018335&$10.73^{+0.24}_{-0.24}$&$0.25^{+0.08}_{-0.08}$&$0.86^{+0.02}_{-0.02}$& 0 &Kepler-425b \\citepalias{He:14} \n\\\\\n5358624&3.525632561&$11.85^{+0.33}_{-0.33}$&$1.27^{+0.19}_{-0.19}$&$0.80^{+0.02}_{-0.02}$& 0 & Kepler-428b \\citepalias{He:14} \n\\\\\n5728139&5.334083460&$15.91^{+1.76}_{-1.76}$&$2.82^{+0.52}_{-0.52}$&$2.26^{+0.25}_{-0.25}$& 0 &Kepler-433b \\citepalias{Almenara:2015} \n\\\\\n5780885&4.885488953&$17.78^{+0.11}_{-0.11}$&$0.44^{+0.04}_{-0.04}$&$1.96^{+0.07}_{-0.07}$& 0 & Kepler-7b \\citepalias{Latham:2010} \n\\\\\n6046540&7.340714746&$10.53^{+0.22}_{-0.22}$&$0.63^{+0.12}_{-0.12}$&$1.12^{+0.04}_{-0.04}$& 0 & Kepler-74b \\citepalias{Bonomo:2015} \n\\\\\n6922244&3.522498573&$15.58^{+0.55}_{-0.66}$&$0.59^{+0.13}_{-0.12}$& $1.45^{+0.12}_{-0.13}$& 0 & Kepler-8b \\citepalias{Jenkins:2010} \n\\\\\n7529266&8.600153301&$21.84^{+1.98}_{-1.98}$&$0.84^{+0.15}_{-0.15}$&$3.21^{+0.3}_{-0.3}$& 0 & Kepler-435b \\citepalias{Almenara:2015} \n\\\\\n7877496&1.720861324&$14.70^{+0.44}_{-0.55}$&$0.94^{+0.12}_{-0.02}$&$1.29^{+0.04}_{-0.04}$& 0 & Kepler-412b \\citepalias{Deleuil:2014} \n\\\\\n8191672&3.548465405&$15.69^{+0.44}_{-0.55}$&$2.11^{+0.07}_{-0.09}$&$1.75^{+0.14}_{-0.15}$&0 &Kepler-5b \\citepalias{Koch:2010} \n\\\\\n9305831&3.246732651&$11.96^{+0.77}_{-0.77}$&$1.00^{+0.1}_{-0.1}$&$1.35^{+0.08}_{-0.08}$&0 &Kepler-44b \\citepalias{Bonomo:2012} \n\\\\\n9410930&1.855557540&$11.41^{+0.44}_{-0.44}$&$0.56^{+0.10}_{-0.09}$&$1.02^{+0.03}_{-0.03}$&0 &Kepler-41b \\citepalias{Esteves:2015} \n\\\\\n9631995&7.891448474&$12.62^{+1.21}_{-1.21}$&$0.43^{+0.13}_{-0.13}$&$1.24^{+0.12}_{-0.12}$&0&Kepler-422b \\citepalias{Endl:2014} \n\\\\\n9651668&2.684328485&$13.17^{+0.77}_{-0.77}$&$0.72^{+0.12}_{-0.12}$&$0.99^{+0.05}_{-0.05}$&0&Kepler-423b \\citepalias{Endl:2014} \n\\\\\n9818381&3.024092548&$13.39^{+0.77}_{-0.66}$ &$3.23^{+0.26}_{-0.26}$ &$1.38^{+0.05}_{-0.03}$&0 & Kepler-43b \\citepalias{Esteves:2015,Bonomo:2015} \n\\\\\n10264660&6.790121599&$12.46^{+0.59}_{-0.59}$&$8.4^{+0.19}_{-0.19}$&$2.05^{+0.08}_{-0.08}$&0 & Kepler-14b \\citepalias{Buchhave:2011} \n\\\\\n10619192&1.485710952&$14.59^{+0.44}_{-0.44}$&$2.47^{+0.10}_{-0.10}$&$1.17^{+0.09}_{-0.09}$&0&Kepler-17b \\citepalias{Bonomo:2012} \n\\\\\n10666592&2.204735365&$15.69^{+1.2}_{-1.2}$&$1.741^{+0.028}_{-0.028}$&$2.00^{+0.01}_{-0.02}$&0&HAT-P-7b \\citepalias{Pal:2008,Van:13} \n\\\\\n10874614&3.234699312&$14.26^{+0.22}_{-0.33}$&$0.67^{+0.04}_{-0.04}$&$1.29^{+0.09}_{-0.10}$&0 &Kepler-6b \\citepalias{Esteves:2015} \n\\\\\n11017901&7.794301316&$18.10^{+6.47}_{-6.47}$&$1.37^{+0.48}_{-0.48}$&$1.03^{+0.16}_{-0.16}$&0 &Kepler-447b \\citepalias{Lillo-box:2015} \n\\\\\n11359879&4.942783399&$10.54^{+0.66}_{-0.77}$&$0.66^{+0.08}_{-0.09}$&$0.98^{+0.16}_{-0.06}$&0 &Kepler-15b \\citepalias{Endl:2011} \n\\\\\n11804465&4.437963030&$19.20^{+0.33}_{-0.44}$&$0.43^{+0.05}_{-0.05}$&$1.42^{+0.30}_{-0.24}$&0 &Kepler-12b \\citepalias{Esteves:2015} \n\\\\\n11446443&2.4706133738&$13.05^{+0.27}_{-0.27}$&$1.253^{+0.052}_{-0.052}$&$1.0^{+0.036}_{-0.036}$&0 &Tres-2b \\citepalias{OD:06,Southworth:2010} \n\\\\\n11502867&3.217518593&$11.96^{+0.33}_{-0.33}$&$0.34^{+0.08}_{-0.08}$&$0.92^{+0.02}_{-0.02}$&0 &Kepler-426b \\citepalias{He:14} \n\\\\\n9941662&1.763587569&$16.57^{+0.44}_{-0.44}$&$9.28^{+0.16}_{-0.16}$&$1.74^{+0.04}_{-0.04}$&0 &Kepler-13b \\citepalias{Shporer:2011} \n\\\\\n8359498&3.578780551&$10.53^{+0.22}_{-0.22}$&$0.43^{+0.03}_{-0.03}$&$0.99^{+0.02}_{-0.02}$& 0 &KOI127.01 \\citepalias{Gandolfi:2013} \n\\\\\n\n\\enddata\n\\tablenotetext{a}{The false positive rate for individual system $fp$ is from the NASA Exoplanet Archive Kepler false positive probability table based on Morton et al (in prep).\\footnote{http://exoplanetarchive.ipac.caltech.edu/cgi-bin/TblView/nph-tblView?app=ExoTbls$\\&$config=koifpp} \nWe assign 0 to the confirmed candidates. \n}\n\\tablenotetext{b}{Reference abbreviations used in this table and\n    the next are as follows.\n\\citetalias{Almenara:2015}:\\citet{Almenara:2015};\n\\citetalias{Bonomo:2012}:\\citet{Bonomo:2012};      \n\\citetalias{Bonomo:2015}:\\citet{Bonomo:2015};        \n\\citetalias{Bruno:2015}:\\citet{Bruno:2015};   \n\\citetalias{Buchhave:2011}:\\citet{Buchhave:2011};\n\\citetalias{Cabrera:2013}:\\citet{Cabrera:2013};    \n\\citetalias{Dawson:2012}:\\citet{Dawson:2012};        \n\\citetalias{Deleuil:2014}:\\citet{Deleuil:2014};    \n\\citetalias{Endl:2011}:\\citet{Endl:2011};         \n\\citetalias{Endl:2014}:\\citet{Endl:2014};  \n\\citetalias{Esteves:2015}:\\citet{Esteves:2015};      \n\\citetalias{Faigler:2013}:\\citet{Faigler:2013};     \n\\citetalias{Gandolfi:2013}:\\citet{Gandolfi:2013};      \n\\citetalias{He:14}:\\citet{He:14};\n\\citetalias{Jenkins:2010}:\\citet{Jenkins:2010};\n\\citetalias{Koch:2010}:\\citet{Koch:2010};     \n\\citetalias{Latham:2010}:\\citet{Latham:2010};        \n\\citetalias{Lillo-box:2015}:\\citet{Lillo-box:2015};     \n\\citetalias{Nesvorny:2012}:\\citet{Nesvorny:2012};      \n\\citetalias{OD:06}:\\citet{OD:06};\n\\citetalias{Pal:2008}:\\citet{Pal:2008};           \n\\citetalias{Sanchis:2013}:\\citet{Sanchis:2013};       \n\\citetalias{Santerne:2012}:\\citet{Santerne:2012};      \n\\citetalias{Santerne:2015}:\\citet{Santerne:2015};     \n\\citetalias{Schmitt:2014}:\\citet{Schmitt:2014};   \n\\citetalias{Schmitt:2014b}:\\citet{Schmitt:2014b};      \n\\citetalias{Shporer:2011}:\\citet{Shporer:2011};     \n\\citetalias{Steffen:2010}:\\citet{Steffen:2010};    \n\\citetalias{Southworth:2010}:\\citet{Southworth:2010};    \n\\citetalias{Rowe:2014}:\\citet{Rowe:2014};\n\\citetalias{Van:13}:\\citet{Van:13};   \n\\citetalias{Weiss:2013}:\\citet{Weiss:2013}.\n}\n\\end{deluxetable*}\n\n\n\n\n\n\n\\begin{deluxetable*}{llccccl}\n\\tabletypesize{\\scriptsize}\n\\centering\n\\tablewidth{0pc}\n\\tablecaption{Kepler Warm Jupiter Systems \\label{table:wjplanet}}\n\\tablehead{\\colhead{KIC}&\\colhead{Period}&\\colhead{Rp}&\\colhead{Mp}&\\colhead{Rstar}&\n\\colhead{fp rate} &\\colhead{Other Name/Reference} \\\\\n\\colhead{}&\\colhead{[day]}&\\colhead{$[R_{\\rm\n    Earth}]$}&\\colhead{$[M_{\\rm\n    Jup}]$}&\\colhead{$[R_\\odot]$}&\\colhead{} &\\colhead{} \\\\\n}\n\\startdata\n7984047&77.63425713&$10.09^{+1.35}_{-0.91}$&n/a&$0.755^{+0.101}_{-0.068}$& 8.8e-3 &KOI-1552.01\n\\\\\n7811397 &169.49954 &$9.89^{+2.26}_{-0.81}$ & n/a & $0.719^{+0.164}_{-0.059}$ & 0.71 &KOI-1477.01 \\\\\n8672910&39.64317811&$10.52^{+4.46}_{-0.81}$&n/a&$0.833^{+0.355}_{-0.064}$& 3.6e-4 &KOI-918.01\n\\\\\n7504328&53.71797107&$8.21^{+2.73}_{-1.59}$&n/a&$1.151^{+0.383}_{-0.222}$& 0.46 &KOI-458.01 \n\\\\\n 6471021&125.62887621&$8^{+1.14}_{-0.34}$&n/a&$0.897 ^{+0.128}_{-0.038}$& 2.2e-4 &KOI-372.01 \n\\\\\n6061119&27.807562927&$14.46^{+6.63}_{- 1.08}$&n/a&$0.791^{+0.363}_{- 0.059}$& 7.7e-2 &KOI-846.01\n\\\\\n4760746&15.068059056&$17.65^{+5.88}_{-1.64}$&n/a&$0.96^{+0.32}_{-0.089}$& 0.8 &KOI-1455.01\n \\\\\n10656508&124.03590546&$10.41^{+6.91}_{- 1.14}$&n/a&$1.137^{+0.754}_{-0.125}$&7.9e-3 &KOI-211.01  \\\\\n\n7950644&10.290993755&$13.776\\pm2.35$  & $0.29\\pm0.09$ &$1.35\\pm0.2$ &0&Kepler-427b \\citepalias{He:14} \\\\\n4164994&10.506825646&$9.41^{+1.89}_{-0.64}$&n/a&$0.784^{+0.157}_{-0.054}$&7.5e-4 & KOI-1320.01\n\\\\\n11194032&28.511205250&$8.21^{+6.23}_{-4.56}$&n/a&$1.741^{+1.322}_{-0.966}$& 0 & KOI-348.01  \\\\\n7499398&23.020303180&$8.22^{+3.19}_{-0.68}$&n/a&$0.95^{+0.368}_{-0.079}$&9.4e-3 & KOI-1473.01  \\\\\n7368664&12.874711418&$12.40^{+2.85}_{-1.98}$&$2.86^{+0.35}_{-0.35}$&$1.38^{+0.13}_{-0.13}$& 0 &Kepler-434b \\citepalias{Almenara:2015} \\\\\n7951018&52.75875577&$9.04^{+5.84}_{-1.04}$&n/a&$1.154 ^{+0.746}_{-0.132}$& 8.5e-4 &KOI-1553.01 \n\\\\\n9025971&141.24164672&$10.64^{+4.02}_{-0.85}$&$0.55 ^{+0.02}_{-0.02}$&$0.913^{+0.345}_{- 0.073}$&0&KOI-3680.01 \\citepalias{Santerne:2015}\n\\\\\n 5812701&17.855219698&$15.69^{+1.43}_{-1.43}$&n/a&$1.63^{+0.15}_{-0.15}$& 0 &KOI-12.01 \\citepalias{Bonomo:2015} \\\\\n10723750&50.79034619&$9.16^{+5.55}_{-1.14}$&$1.84^{+ 0.18}_{-0.183}$&$1.183^{+0.716}_{- 0.147}$&0 &Kepler-117c \\citepalias{Rowe:2014,Bruno:2015} \\\\\n &18.795900480&$6.04^{+3.66}_{-0.75}$&$0.094 ^{+0.03}_{-0.03}$& & 0&Kepler-117b \\citepalias{Rowe:2014,Bruno:2015} \\\\\n7109675&33.601220660&$8.83^{+0.46}_{-0.5}$&n/a&$0.93^{+0.048}_{-0.053}$& 0 &Kepler-46b \\citepalias{Nesvorny:2012} \n\\\\\n\n&57.011&n/a&$0.376^{+0.021}_{-0.019}$&\n\n &0&Kepler-46c \\citepalias{Nesvorny:2012}  \n\\\\\n\n&6.76652078&$2.17^{+0.11}_{-0.13}$&n/a&\n\n&0&Kepler-46d \\citepalias{Nesvorny:2012}  \n\\\\\n6462863&22.342969585&$9.77^{+2.03}_{-1.5}$&$0.333^{+ 0.036}_{-0.036}$ & $1.297^{+0.27}_{-0.199}$ &0&Kepler-89d \\citepalias{Weiss:2013}   \\\\\n\n&10.423677765&$3.66^{+0.76}_{-0.56}$&$0.030\\pm 0.015$&\n\n&0&Kepler-89c \\citepalias{Weiss:2013}  \n\n\\\\\n\n&54.31998605&$5.79^{+1.21}_{-0.89}$&$0.1101\\pm0.045 $&\n\n&0&Kepler-89e \\citepalias{Weiss:2013} \n\n\\\\\n\n&3.743175556&$1.55^{+0.32}_{-0.24}$&$0.02\\pm0.02$&\n\n&0&Kepler-89b \\citepalias{Weiss:2013} \n\n\\\\\n5972334&15.358768403&$11.31^{+4.78}_{-1.04}$& n/a&$0.87^{+0.368}_{-0.08}$&4.1e-4 &KOI-191.01 \\citepalias{Steffen:2010} \\\\\n\n&2.418405445&$2.79^{+1.17}_{-0.26}$& n/a&\n\n& 3e-3 &KOI-191.02  \\citepalias{Steffen:2010}  \\\\\n\n&0.708620008 & $1.25^{+0.52}_{-0.12}$&n/a&  \n\n& 1.0 &KOI-191.03 \\citepalias{Steffen:2010}  \\\\\n\n&38.6519976&$2.62^{+1.11}_{-0.24}$&n/a&\n\n& 1.3e-3 \n&KOI-191.04 \\citepalias{Steffen:2010}  \\\\\n5629353&33.319916700&$13.10^{+7.22}_{-3.66}$&n/a& $1.63^{+0.897}_{-0.456}$& 2e-2 &KOI-6132.01 \n\\\\\n\n&7.5844126&$5.49^{+3.03}_{-1.53}$& n/a&\n\n& 3.8e-4&KOI-6132.02\n\n\\\\\n\n&11.8674823&$3.94^{+2.17}_{-1.1}$&n/a& \n\n& 3.7e-3 &KOI-6132.03\n\n\\\\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n9946525&51.84688575&$8.95^{+2.07}_{-0.65}$&n/a&$0.838 ^{+0.252}_{-0.061}$& 4.43-3 &KOI-398.01\n\\\\\n\n&4.18004955&$3.55^{+1.07}_{-0.26}$&n/a&\n\n& 3.8e-7 &Kepler-148c \n \\\\\n\n&1.729366467&$1.87^{+0.56}_{-0.15}$&n/a& \n\n& 0.88 &Kepler-148b  \n\\\\\n\n3832474&143.2063518&$9.36^{+0.99}_{-0.37}$& $0.073 ^{+0.008}_{-0.008}$&$0.867^{+0.092}_{- 0.034}$& 0&Kepler-30d \\citepalias{Sanchis:2013}  \\\\\n\n&60.32488611&$12.88^{+1.36}_{-0.51}$&$2.01 ^{+0.16}_{-0.16}$& \n&0&Kepler-30c \\citepalias{Sanchis:2013} \n\\\\\n\n&29.1598615&$1.91^{+0.2}_{-0.07}$&$0.036^{+0.004}_{-0.004}$&\n\n&0&Kepler-30b \\citepalias{Sanchis:2013}\n \n\n\\\\\n3247268&86.67855186&$9.88^{+4.67}_{-1.02}$&$1.1^{+1.1}_{-0.0}$&$1.043^{+0.494}_{-0.107}$&0&Kepler-418b\\\\\n\n&12.218278&$4.75^{+2.25}_{-0.49}$&n/a& \n\n& 2.0e-4  &KOI-1089.02 \n\\\\\n\n7303287&125.8518&$11.35^{+0.19}_{-0.19}$&$0.41^{+0.05}_{-0.05}$\n&$1.00^{+0.02}_{-0.02}$& 0 &Kepler-289b \\citepalias{Schmitt:2014b}\\\\ \n\n&34.5438464& $2.11^{+0.1}_{-0.1}$&n/a&\n& 0&Kepler-289c \\citepalias{Schmitt:2014b}  \n\\\\\n\n&66.063& $2.62^{+0.16}_{-0.16}$&\n$0.013^{+0.003}_{-0.003}$&\n&0&PH-3c \\citepalias{Schmitt:2014b}  \n\\\\\n\n12365184&69.7546&$10.6^{+1.4}_{-1.3}$& $2.5^{+0.3}_{- 0.3}$&$1.75^{+0.08}_{-0.07}$&0&Kepler-419b \\citepalias{Dawson:2012} \\\\\n\n&675.47&n/a&$7.3^{+0.4}_{-0.4}$&\n\n&0&Kepler-419c \\citepalias{Dawson:2012} \n\n\\\\\n7898352&127.2824031&$9.32^{+3.76}_{-0.77}$&n/a& $0.883^{+0.356}_{-0.073}$& 7.2e-2 &Kepler-302c \\citepalias{Rowe:2014} \\\\ \n\n&30.1836854&$2.88^{+1.15}_{-0.24}$&n/a&\n\n& 3.4e-5 &Kepler-302b \\citepalias{Rowe:2014}\n \n\\\\\n\n\n\n\\enddata\n\\label{tab:table2}\n\\end{deluxetable*}\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{apj_eprint}\n\n\n\\begin{thebibliography}{}\n\n\\bibitem[\\protect\\citeauthoryear{{Almenara} et~al.}{{Almenara}\n  et~al.}{2015}]{Almenara:2015}\n{Almenara}, J.~M., {Damiani}, C., {Bouchy}, F., et~al. 2015, \\aap, 575, A71\n\n\\bibitem[\\protect\\citeauthoryear{{Batygin}, {Bodenheimer}, \\&\n  {Laughlin}}{{Batygin} et~al.}{2015}]{Batygin:2015}\n{Batygin}, K., {Bodenheimer}, P.~H.,  \\& {Laughlin}, G.~P. 2015, ArXiv\n  e-prints, 1511.09157\n\n\\bibitem[\\protect\\citeauthoryear{{Becker} et~al.}{{Becker}\n  et~al.}{2015}]{Becker:2015}\n{Becker}, J.~C., {Vanderburg}, A., {Adams}, F.~C., {Rappaport}, S.~A.,  \\&\n  {Schwengeler}, H.~M. 2015, \\apjl, 812, L18\n\n\\bibitem[\\protect\\citeauthoryear{{Boley}, {Granados Contreras}, \\&\n  {Gladman}}{{Boley} et~al.}{2015}]{Boley:2015}\n{Boley}, A.~C., {Granados Contreras}, A.~P.,  \\& {Gladman}, B. 2015, ArXiv\n  e-prints, 1510.04276\n\n\\bibitem[\\protect\\citeauthoryear{{Bonomo} et~al.}{{Bonomo}\n  et~al.}{2012}]{Bonomo:2012}\n{Bonomo}, A.~S., {H{\\'e}brard}, G., {Santerne}, A., et~al. 2012, \\aap, 538, A96\n\n\\bibitem[\\protect\\citeauthoryear{{Bonomo} et~al.}{{Bonomo}\n  et~al.}{2015}]{Bonomo:2015}\n{Bonomo}, A.~S., {Sozzetti}, A., {Santerne}, A., et~al. 2015, \\aap, 575, A85\n\n\\bibitem[\\protect\\citeauthoryear{{Borucki} et~al.}{{Borucki}\n  et~al.}{2011}]{Borucki:2011}\n{Borucki}, W.~J., {Koch}, D.~G., {Basri}, G., et~al. 2011, \\apj, 736, 19\n\n\\bibitem[\\protect\\citeauthoryear{{Brahm} et~al.}{{Brahm}\n  et~al.}{2015}]{Brahm:2015}\n{Brahm}, R., {Jord{\\'a}n}, A., {Bakos}, G.~{\\'A}., et~al. 2015, ArXiv e-prints,\n  1510.05758\n\n\\bibitem[\\protect\\citeauthoryear{{Bruno} et~al.}{{Bruno}\n  et~al.}{2015}]{Bruno:2015}\n{Bruno}, G., {Almenara}, J.-M., {Barros}, S.~C.~C., et~al. 2015, in European\n  Physical Journal Web of Conferences, Vol. 101, European Physical Journal Web\n  of Conferences, 6014\n\n\\bibitem[\\protect\\citeauthoryear{{Buchhave} et~al.}{{Buchhave}\n  et~al.}{2011}]{Buchhave:2011}\n{Buchhave}, L.~A., {Latham}, D.~W., {Carter}, J.~A., et~al. 2011, \\apjs, 197, 3\n\n\\bibitem[\\protect\\citeauthoryear{{Cabrera} et~al.}{{Cabrera}\n  et~al.}{2014}]{Cabrera:2013}\n{Cabrera}, J., {Csizmadia}, S., {Lehmann}, H., et~al. 2014, \\apj, 781, 18\n\n\\bibitem[\\protect\\citeauthoryear{{Dawson} et~al.}{{Dawson}\n  et~al.}{2012}]{Dawson:2012}\n{Dawson}, R.~I., {Johnson}, J.~A., {Morton}, T.~D., et~al. 2012, \\apj, 761, 163\n\n\\bibitem[\\protect\\citeauthoryear{{Dawson} \\& {Murray-Clay}}{{Dawson} \\&\n  {Murray-Clay}}{2013}]{Dawson:2013}\n{Dawson}, R.~I.,  \\& {Murray-Clay}, R.~A. 2013, \\apjl, 767, L24\n\n\\bibitem[\\protect\\citeauthoryear{{Dawson}, {Murray-Clay}, \\&\n  {Johnson}}{{Dawson} et~al.}{2015}]{Dawson:2015}\n{Dawson}, R.~I., {Murray-Clay}, R.~A.,  \\& {Johnson}, J.~A. 2015, \\apj, 798, 66\n\n\\bibitem[\\protect\\citeauthoryear{{Deleuil} et~al.}{{Deleuil}\n  et~al.}{2014}]{Deleuil:2014}\n{Deleuil}, M., {Almenara}, J.-M., {Santerne}, A., et~al. 2014, \\aap, 564, A56\n\n\\bibitem[\\protect\\citeauthoryear{{Dong}, {Katz}, \\& {Socrates}}{{Dong}\n  et~al.}{2014}]{Dong:2014}\n{Dong}, S., {Katz}, B.,  \\& {Socrates}, A. 2014, \\apjl, 781, L5\n\n\\bibitem[\\protect\\citeauthoryear{{Dong} \\& {Zhu}}{{Dong} \\&\n  {Zhu}}{2013}]{Dong:2013}\n{Dong}, S.,  \\& {Zhu}, Z. 2013, \\apj, 778, 53\n\n\\bibitem[\\protect\\citeauthoryear{{Endl} et~al.}{{Endl}\n  et~al.}{2014}]{Endl:2014}\n{Endl}, M., {Caldwell}, D.~A., {Barclay}, T., et~al. 2014, \\apj, 795, 151\n\n\\bibitem[\\protect\\citeauthoryear{{Endl} et~al.}{{Endl}\n  et~al.}{2011}]{Endl:2011}\n{Endl}, M., {MacQueen}, P.~J., {Cochran}, W.~D., et~al. 2011, \\apjs, 197, 13\n\n\\bibitem[\\protect\\citeauthoryear{{Endl} et~al.}{{Endl} et~al.}{2012}]{Endl:55}\n{Endl}, M., {Robertson}, P., {Cochran}, W.~D., et~al. 2012, \\apj, 759, 19\n\n\\bibitem[\\protect\\citeauthoryear{{Esteves}, {De Mooij}, \\&\n  {Jayawardhana}}{{Esteves} et~al.}{2015}]{Esteves:2015}\n{Esteves}, L.~J., {De Mooij}, E.~J.~W.,  \\& {Jayawardhana}, R. 2015, \\apj, 804,\n  150\n\n\\bibitem[\\protect\\citeauthoryear{{Fabrycky} et~al.}{{Fabrycky}\n  et~al.}{2014}]{Fabrycky:2014}\n{Fabrycky}, D.~C., {Lissauer}, J.~J., {Ragozzine}, D., et~al. 2014, \\apj, 790,\n  146\n\n\\bibitem[\\protect\\citeauthoryear{{Faigler} et~al.}{{Faigler}\n  et~al.}{2013}]{Faigler:2013}\n{Faigler}, S., {Tal-Or}, L., {Mazeh}, T., {Latham}, D.~W.,  \\& {Buchhave},\n  L.~A. 2013, \\apj, 771, 26\n\n\\bibitem[\\protect\\citeauthoryear{{Fang} \\& {Margot}}{{Fang} \\&\n  {Margot}}{2012}]{FangMargot:2012}\n{Fang}, J.,  \\& {Margot}, J.-L. 2012, \\apj, 761, 92\n\n\\bibitem[\\protect\\citeauthoryear{{Figueira} et~al.}{{Figueira}\n  et~al.}{2012}]{Figueira:2012}\n{Figueira}, P., {Marmier}, M., {Bou{\\'e}}, G., et~al. 2012, \\aap, 541, A139\n\n\\bibitem[\\protect\\citeauthoryear{{Fischer} et~al.}{{Fischer}\n  et~al.}{2012}]{Fischer:2012}\n{Fischer}, D.~A., {Gaidos}, E., {Howard}, A.~W., et~al. 2012, \\apj, 745, 21\n\n\\bibitem[\\protect\\citeauthoryear{{Foreman-Mackey} et~al.}{{Foreman-Mackey}\n  et~al.}{2013}]{Foreman-Mackey:2013}\n{Foreman-Mackey}, D., {Hogg}, D.~W., {Lang}, D.,  \\& {Goodman}, J. 2013, \\pasp,\n  125, 306\n\n\\bibitem[\\protect\\citeauthoryear{{Fressin} et~al.}{{Fressin}\n  et~al.}{2013}]{Fressin:2013}\n{Fressin}, F., {Torres}, G., {Charbonneau}, D., et~al. 2013, \\apj, 766, 81\n\n\\bibitem[\\protect\\citeauthoryear{{Gandolfi} et~al.}{{Gandolfi}\n  et~al.}{2013}]{Gandolfi:2013}\n{Gandolfi}, D., {Parviainen}, H., {Fridlund}, M., et~al. 2013, \\aap, 557, A74\n\n\\bibitem[\\protect\\citeauthoryear{{Gibson} et~al.}{{Gibson}\n  et~al.}{2009}]{Gibson:2009}\n{Gibson}, N.~P., {Pollacco}, D., {Simpson}, E.~K., et~al. 2009, \\apj, 700, 1078\n\n\\bibitem[\\protect\\citeauthoryear{{Hadden} \\& {Lithwick}}{{Hadden} \\&\n  {Lithwick}}{2014}]{Lithwick:2014}\n{Hadden}, S.,  \\& {Lithwick}, Y. 2014, \\apj, 787, 80\n\n\\bibitem[\\protect\\citeauthoryear{{H{\\'e}brard} et~al.}{{H{\\'e}brard}\n  et~al.}{2014}]{He:14}\n{H{\\'e}brard}, G., {Santerne}, A., {Montagnier}, G., et~al. 2014, \\aap, 572,\n  A93\n\n\\bibitem[\\protect\\citeauthoryear{{Hellier} et~al.}{{Hellier}\n  et~al.}{2012}]{Hellier:2012}\n{Hellier}, C., {Anderson}, D.~R., {Collier Cameron}, A., et~al. 2012, \\mnras,\n  426, 739\n\n\\bibitem[\\protect\\citeauthoryear{{Howard} et~al.}{{Howard}\n  et~al.}{2012}]{Howard:2012}\n{Howard}, A.~W., {Marcy}, G.~W., {Bryson}, S.~T., et~al. 2012, \\apjs, 201, 15\n\n\\bibitem[\\protect\\citeauthoryear{{Huang}, {Bakos}, \\& {Hartman}}{{Huang}\n  et~al.}{2013}]{Huang:2013}\n{Huang}, X., {Bakos}, G.~{\\'A}.,  \\& {Hartman}, J.~D. 2013, \\mnras, 429, 2001\n\n\\bibitem[\\protect\\citeauthoryear{{Jenkins} et~al.}{{Jenkins}\n  et~al.}{2010}]{Jenkins:2010}\n{Jenkins}, J.~M., {Borucki}, W.~J., {Koch}, D.~G., et~al. 2010, \\apj, 724, 1108\n\n\\bibitem[\\protect\\citeauthoryear{{Koch} et~al.}{{Koch}\n  et~al.}{2010}]{Koch:2010}\n{Koch}, D.~G., {Borucki}, W.~J., {Rowe}, J.~F., et~al. 2010, \\apjl, 713, L131\n\n\\bibitem[\\protect\\citeauthoryear{{Kov{\\'a}cs} et~al.}{{Kov{\\'a}cs}\n  et~al.}{2010}]{Kovacs:2012}\n{Kov{\\'a}cs}, G., {Bakos}, G.~{\\'A}., {Hartman}, J.~D., et~al. 2010, \\apj, 724,\n  866\n\n\\bibitem[\\protect\\citeauthoryear{{Latham} et~al.}{{Latham}\n  et~al.}{2010}]{Latham:2010}\n{Latham}, D.~W., {Borucki}, W.~J., {Koch}, D.~G., et~al. 2010, \\apjl, 713, L140\n\n\\bibitem[\\protect\\citeauthoryear{{Latham} et~al.}{{Latham}\n  et~al.}{2011}]{Latham:2011}\n{Latham}, D.~W., {Rowe}, J.~F., {Quinn}, S.~N., et~al. 2011, \\apjl, 732, L24\n\n\\bibitem[\\protect\\citeauthoryear{{Lee}, {Chiang}, \\& {Ormel}}{{Lee}\n  et~al.}{2014}]{LeeChiang:2014}\n{Lee}, E.~J., {Chiang}, E.,  \\& {Ormel}, C.~W. 2014, \\apj, 797, 95\n\n\\bibitem[\\protect\\citeauthoryear{{Lillo-Box}, {Barrado}, \\& {Bouy}}{{Lillo-Box}\n  et~al.}{2014}]{Lillo-box:2015}\n{Lillo-Box}, J., {Barrado}, D.,  \\& {Bouy}, H. 2014, \\aap, 566, A103\n\n\\bibitem[\\protect\\citeauthoryear{{Lissauer} et~al.}{{Lissauer}\n  et~al.}{2014}]{Lissauer:2014}\n{Lissauer}, J.~J., {Marcy}, G.~W., {Bryson}, S.~T., et~al. 2014, \\apj, 784, 44\n\n\\bibitem[\\protect\\citeauthoryear{{Lissauer} et~al.}{{Lissauer}\n  et~al.}{2011}]{Lissauer:2011}\n{Lissauer}, J.~J., {Ragozzine}, D., {Fabrycky}, D.~C., et~al. 2011, \\apjs, 197,\n  8\n\n\\bibitem[\\protect\\citeauthoryear{{Lithwick}, {Xie}, \\& {Wu}}{{Lithwick}\n  et~al.}{2012}]{Lithwick:2012}\n{Lithwick}, Y., {Xie}, J.,  \\& {Wu}, Y. 2012, \\apj, 761, 122\n\n\\bibitem[\\protect\\citeauthoryear{{Mayor} et~al.}{{Mayor}\n  et~al.}{2011}]{Mayor:2011}\n{Mayor}, M., {Marmier}, M., {Lovis}, C., et~al. 2011, ArXiv e-prints, 1109.2497\n\n\\bibitem[\\protect\\citeauthoryear{{Morton}}{{Morton}}{2012}]{Morton:2012}\n{Morton}, T.~D. 2012, \\apj, 761, 6\n\n\\bibitem[\\protect\\citeauthoryear{{Nesvorn{\\'y}} et~al.}{{Nesvorn{\\'y}}\n  et~al.}{2012}]{Nesvorny:2012}\n{Nesvorn{\\'y}}, D., {Kipping}, D.~M., {Buchhave}, L.~A., et~al. 2012, Science,\n  336, 1133\n\n\\bibitem[\\protect\\citeauthoryear{{Neveu-VanMalle} et~al.}{{Neveu-VanMalle}\n  et~al.}{2015}]{NeveuVanMalle:2015}\n{Neveu-VanMalle}, M., {Queloz}, D., {Anderson}, D.~R., et~al. 2015, ArXiv\n  e-prints, 1509.07750\n\n\\bibitem[\\protect\\citeauthoryear{{O'Donovan} et~al.}{{O'Donovan}\n  et~al.}{2006}]{OD:06}\n{O'Donovan}, F.~T., {Charbonneau}, D., {Mandushev}, G., et~al. 2006, \\apjl,\n  651, L61\n\n\\bibitem[\\protect\\citeauthoryear{{Ofir} \\& {Dreizler}}{{Ofir} \\&\n  {Dreizler}}{2013}]{Ofir:2012}\n{Ofir}, A.,  \\& {Dreizler}, S. 2013, \\aap, 555, A58\n\n\\bibitem[\\protect\\citeauthoryear{{P{\\'a}l} et~al.}{{P{\\'a}l}\n  et~al.}{2008}]{Pal:2008}\n{P{\\'a}l}, A., {Bakos}, G.~{\\'A}., {Torres}, G., et~al. 2008, \\apj, 680, 1450\n\n\\bibitem[\\protect\\citeauthoryear{{Petigura}, {Howard}, \\& {Marcy}}{{Petigura}\n  et~al.}{2013}]{Petigura:2013b}\n{Petigura}, E.~A., {Howard}, A.~W.,  \\& {Marcy}, G.~W. 2013, Proceedings of the\n  National Academy of Science, 110, 19273\n\n\\bibitem[\\protect\\citeauthoryear{{Petigura}, {Marcy}, \\& {Howard}}{{Petigura}\n  et~al.}{2013}]{Petigura:2013}\n{Petigura}, E.~A., {Marcy}, G.~W.,  \\& {Howard}, A.~W. 2013, \\apj, 770, 69\n\n\\bibitem[\\protect\\citeauthoryear{Philip J.~Everson}{Philip\n  J.~Everson}{2002}]{Everson:2002}\nPhilip J.~Everson, E. T.~B. 2002, Journal of Computational and Graphical\n  Statistics, 11, 202\n\n\\bibitem[\\protect\\citeauthoryear{{Rafikov}}{{Rafikov}}{2006}]{Rafikov:2006}\n{Rafikov}, R.~R. 2006, \\apj, 648, 666\n\n\\bibitem[\\protect\\citeauthoryear{{Rivera} et~al.}{{Rivera}\n  et~al.}{2010}]{Rivera:2010}\n{Rivera}, E.~J., {Laughlin}, G., {Butler}, R.~P., et~al. 2010, \\apj, 719, 890\n\n\\bibitem[\\protect\\citeauthoryear{{Rowe} et~al.}{{Rowe}\n  et~al.}{2014}]{Rowe:2014}\n{Rowe}, J.~F., {Bryson}, S.~T., {Marcy}, G.~W., et~al. 2014, \\apj, 784, 45\n\n\\bibitem[\\protect\\citeauthoryear{{Sanchis-Ojeda} et~al.}{{Sanchis-Ojeda}\n  et~al.}{2012}]{Sanchis:2013}\n{Sanchis-Ojeda}, R., {Fabrycky}, D.~C., {Winn}, J.~N., et~al. 2012, \\nat, 487,\n  449\n\n\\bibitem[\\protect\\citeauthoryear{{Santerne} et~al.}{{Santerne}\n  et~al.}{2012}]{Santerne:2012}\n{Santerne}, A., {D{\\'{\\i}}az}, R.~F., {Moutou}, C., et~al. 2012, \\aap, 545, A76\n\n\\bibitem[\\protect\\citeauthoryear{{Santerne} et~al.}{{Santerne}\n  et~al.}{2015}]{Santerne:2015}\n{Santerne}, A., {Moutou}, C., {Tsantaki}, M., et~al. 2015, ArXiv e-prints,\n  1511.00643\n\n\\bibitem[\\protect\\citeauthoryear{{Schmitt} et~al.}{{Schmitt}\n  et~al.}{2014a}]{Schmitt:2014b}\n{Schmitt}, J.~R., {Agol}, E., {Deck}, K.~M., et~al. 2014a, \\apj, 795, 167\n\n\\bibitem[\\protect\\citeauthoryear{{Schmitt} et~al.}{{Schmitt}\n  et~al.}{2014b}]{Schmitt:2014}\n{Schmitt}, J.~R., {Wang}, J., {Fischer}, D.~A., et~al. 2014b, \\aj, 148, 28\n\n\\bibitem[\\protect\\citeauthoryear{{Schneider}}{{Schneider}}{2011}]{Schneider:2011}\n{Schneider}, J. 2011, in EPSC-DPS Joint Meeting 2011, 3\n\n\\bibitem[\\protect\\citeauthoryear{{Seager} \\& {Mall{\\'e}n-Ornelas}}{{Seager} \\&\n  {Mall{\\'e}n-Ornelas}}{2003}]{Seager:2003}\n{Seager}, S.,  \\& {Mall{\\'e}n-Ornelas}, G. 2003, \\apj, 585, 1038\n\n\\bibitem[\\protect\\citeauthoryear{{Shporer} et~al.}{{Shporer}\n  et~al.}{2011}]{Shporer:2011}\n{Shporer}, A., {Jenkins}, J.~M., {Rowe}, J.~F., et~al. 2011, \\aj, 142, 195\n\n\\bibitem[\\protect\\citeauthoryear{{Silburt}, {Gaidos}, \\& {Wu}}{{Silburt}\n  et~al.}{2015}]{Silburt:2015}\n{Silburt}, A., {Gaidos}, E.,  \\& {Wu}, Y. 2015, \\apj, 799, 180\n\n\\bibitem[\\protect\\citeauthoryear{{Southworth}}{{Southworth}}{2011}]{Southworth:2010}\n{Southworth}, J. 2011, \\mnras, 417, 2166\n\n\\bibitem[\\protect\\citeauthoryear{{Steffen} \\& {Agol}}{{Steffen} \\&\n  {Agol}}{2005}]{Steffen:2005}\n{Steffen}, J.~H.,  \\& {Agol}, E. 2005, \\mnras, 364, L96\n\n\\bibitem[\\protect\\citeauthoryear{{Steffen} et~al.}{{Steffen}\n  et~al.}{2010}]{Steffen:2010}\n{Steffen}, J.~H., {Batalha}, N.~M., {Borucki}, W.~J., et~al. 2010, \\apj, 725,\n  1226\n\n\\bibitem[\\protect\\citeauthoryear{{Steffen} et~al.}{{Steffen}\n  et~al.}{2012}]{Steffen:2012}\n{Steffen}, J.~H., {Ragozzine}, D., {Fabrycky}, D.~C., et~al. 2012, Proceedings\n  of the National Academy of Science, 109, 7982\n\n\\bibitem[\\protect\\citeauthoryear{{Tremaine} \\& {Dong}}{{Tremaine} \\&\n  {Dong}}{2012}]{Tremaine:2011}\n{Tremaine}, S.,  \\& {Dong}, S. 2012, \\aj, 143, 94\n\n\\bibitem[\\protect\\citeauthoryear{{Van Eylen} et~al.}{{Van Eylen}\n  et~al.}{2012}]{Van:13}\n{Van Eylen}, V., {Kjeldsen}, H., {Christensen-Dalsgaard}, J.,  \\& {Aerts}, C.\n  2012, Astronomische Nachrichten, 333, 1088\n\n\\bibitem[\\protect\\citeauthoryear{{Wang} et~al.}{{Wang}\n  et~al.}{2013}]{Wang:2013}\n{Wang}, J., {Fischer}, D.~A., {Barclay}, T., et~al. 2013, \\apj, 776, 10\n\n\\bibitem[\\protect\\citeauthoryear{{Weiss} et~al.}{{Weiss}\n  et~al.}{2013}]{Weiss:2013}\n{Weiss}, L.~M., {Marcy}, G.~W., {Rowe}, J.~F., et~al. 2013, \\apj, 768, 14\n\n\\bibitem[\\protect\\citeauthoryear{{Wright} et~al.}{{Wright}\n  et~al.}{2011}]{Wright:2011}\n{Wright}, J.~T., {Fakhouri}, O., {Marcy}, G.~W., et~al. 2011, \\pasp, 123, 412\n\n\\bibitem[\\protect\\citeauthoryear{{Wright} et~al.}{{Wright}\n  et~al.}{2012}]{Wright:2012}\n{Wright}, J.~T., {Marcy}, G.~W., {Howard}, A.~W., et~al. 2012, \\apj, 753, 160\n\n\\bibitem[\\protect\\citeauthoryear{{Wright} et~al.}{{Wright}\n  et~al.}{2009}]{Wright:2009}\n{Wright}, J.~T., {Upadhyay}, S., {Marcy}, G.~W., et~al. 2009, \\apj, 693, 1084\n\n\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 45053, "prevtext": "\n\nFor the probability of the companion occur at a certain orbital period, we use the formalism \nfrom \\citet{Howard:2012} for the HJs. \n\n", "index": 17, "text": "\\begin{equation}\n{\\rm d}f/{\\rm d\\,log} ({\\rm period})\\propto {\\rm period}^{\\beta}(1-e^{-({\\rm period}/7.0 {\\rm day})^{\\gamma}}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"{\\rm d}f/{\\rm d\\,log}({\\rm period})\\propto{\\rm period}^{\\beta}(1-e^{-({\\rm&#10;period%&#10;}/7.0{\\rm day})^{\\gamma}}),\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>f</mi></mrow><mo>/</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">d</mi></mpadded></mrow><mo>⁢</mo><mi>log</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>period</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><msup><mi>period</mi><mi>β</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msup><mi>e</mi><mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>period</mi><mo>/</mo><mn>7.0</mn></mrow><mo>⁢</mo><mi>day</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>γ</mi></msup></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]