[{"file": "1601.00557.tex", "nexttext": "\nwith $\\dot{\\rho}_{\\star}$ the star formation rate density, $\\epsilon_{\\star}=0.02$ the star formation efficiency (constant with redshift), $\\rho$ the density of the gas and $t_{\\rm{ff}}$ the free-fall time of the gas.\nStars are created with a Poisson random process calculating the probability to form $N$ stars with a mass resolution of $m_{\\rm{res,\\star}}=2.3 \\times 10^{2} \\, \\rm{M_{\\odot}}$ for Tiny,  $7.7 \\times 10^{3} \\, \\rm{M_{\\odot}}$ for Chunky, and $2 \\times 10^{6} \\, \\rm{M_{\\odot}}$ for Horizon-noAGN \\citep{rasera&teyssier06}.\nCooling is modeled with  the cooling curves of \\citet{sutherland&dopita93}, the gas cools through H, He, and metals.  Modeling the metallicity as a passive variable makes it easily trackable over the gas flow through redshift evolution. Physical processes, such as SN explosions and star formation, modify and redistribute the metallicity over neighboring cells. An initial zero metallicity is assumed for Chunky.\nHowever, for the smallest box size simulation, as we resolve mini-halos below the threshold for atomic hydrogen cooling, we use a metallicity floor of $10^{-3} \\, \\rm{Z_{\\odot}}$ in order to mimic cooling by molecular hydrogen.\nThe same metallicity background is employed in Horizon-noAGN. The cooling by metals also mimics here cooling by molecular hydrogen, therefore allowing the formation of stars in mini-halos. \nThe gas follow an adiabatic equation-of-state (EoS) for monoatomic gas with adiabatic index $\\gamma=5/3$, except at high gas densities $\\rho>\\rho_0$, where we use a polytropic EoS to increase the gas pressure in dense gas in order to limit excessive gas fragmentation by mimicking heating of the interstellar medium from stars~\\citep{springel&hernquist03}:\n\n", "itemtype": "equation", "pos": 14467, "prevtext": "\n\\maketitle\n\n\n\\begin{abstract}\nSupermassive black holes (BHs) of millions solar masses and above reside in the center of most local galaxies, but they also power active galactic nuclei and quasars, detected up to $z=7$. This observational evidence puts strong constraints on the BH growth and the mass of the first BH seeds.\nThe scenario of ``direct collapse'' is very appealing as it leads to the formation of large mass BH seeds in the range $10^4-10^6 \\rm{M_{\\odot}}$, which eases explaining how quasars at $z=6-7$ are powered by BHs with masses $>10^9 {\\,{\\rm M_\\odot}}$. \nDirect collapse, however, appears to be rare, as the conditions required by the scenario are that gas is metal-free, the presence of a strong photo-dissociating Lyman-Werner flux, and large inflows of gas at the center of the halo, sustained for $10-100$ Myr.  \nWe performed several cosmological hydrodynamical simulations that cover a large range of box sizes and resolutions, thus allowing us to understand the impact of several physical processes on the distribution of direct collapse BHs. We identify halos where direct collapse can happen, and derive the number density of BHs.  We also investigate the discrepancies between hydrodynamical simulations, direct or post-processed, and semi-analytical studies.  We find that for direct collapse to account for BHs in normal galaxies, the critical Lyman-Werner flux required for direct collapse must be much less than predicted by 3D simulations that include detailed chemical models.  However, when supernova feedback is relatively weak, enough direct collapse BHs to explain $z=6-7$ quasars can be obtained for more realistic values of the critical Lyman Werner flux. \n\n\\end{abstract}\n\n\\begin{keywords}\ngalaxies: high-redshift, quasars: supermassive black holes, cosmology: dark ages, reionization, first stars\n\\end{keywords}\n\n\\section{Introduction}\n\\label{sec:intro}\nThe formation of supermassive black holes (BHs) is still an unresolved problem. It is now well established that most local galaxies harbor a supermassive BH in their center, with mass even above $10^{10} \\rm{M_{\\odot}}$ for the most massive ones \\citep{2011Natur.480..215M}.  \nWe observe quasars, the active tail of the BHs distribution, up to redshift $z>6$ \\citep{fan06,jiange09,mortlock11}. These high-redshift quasars essentially grow by direct cold filamentary infall~\\citep{dimatteoetal12,duboisetal12} and suggest that BH seeds must have been formed at very early times in order to acquire $10^{9}\\, \\rm{M_{\\odot}}$ within a span of less than 1 Gyr.\n\nA popular channel to form BH seeds  has been as remnant of the first generation of stars, namely PopIII stars \\citep{Madau2001,Volonteri2003}. BHs are predicted to form in metal-free mini-halos ($M_{\\rm{h}} \\approx 10^{5} \\rm{M_{\\odot}}$) at redshifts $z=20-30$ from the remnants of PopIII stars, which are stars of primordial composition.  Studies suggest that the mass of these PopIII stars could range from 10 to 1000 $\\rm{M_{\\odot}}$ \\citep[e.g.,][]{Bromm_Yoshida_2011,Hirano14}.  A sufficiently massive PopIII star ($> 260 \\, \\rm{M_{\\odot}}$) can collapse and form a BH retaining $\\sim$ half the mass of the star, leading to a population of $\\sim 100\\, \\rm{M_{\\odot}}$ BHs \\citep{Fryer01}. This has been a major criticism of the scenario, because starting from this low-mass seed population, it means that such seed BHs must grow at a rate close to the maximum Eddington rate their entire life to explain the masses of $z>6$ quasars. \n\nOne recent way of solving the problem of the formation of such massive objects is by the  direct collapse of pristine gas triggered by dynamical processes  \\citep{Loeb1994,Eisenstein1995,Koushiappas2003,Begelman2006,Lodato2006,Mayer2010}, or invoking isothermal collapse in primordial halos \\citep{Bromm2003,spaans2006,Dijkstra2008,Latif2013} . This scenario has become very popular, as it can lead to the formation of $10^{4}-10^{6}\\, \\rm{M_{\\odot}}$ seeds, making it easier  to reproduce the quasar population at  $z>6$.\n\nThe physical conditions (listed below) required for isothermal collapse in primordial halos, which has become the most popular version of direct collapse  in the last couple of years, and whose BH seeds are typically referred to as `DCBHs', are numerous, and make the channel a rare event. First, one needs a halo that has reached the atomic cooling threshold, $\\sim 10^7-10^8 {\\,{\\rm M_\\odot}}$, but it is still pristine, i.e., metal-free. Second, one needs that the molecular hydrogen formation has been suppressed throughout the halo's evolution. When these conditions are fulfilled, the gas in the halo can collapse isothermally and without fragmenting in the absence of efficient coolants, namely metals and molecular hydrogen. The latter would strongly decrease the Jeans mass, leading to the fragmentation of the gas cloud, abandoning the formation of only one massive object in favour of the formation of several less massive objects, namely PopIII stars. The destruction and prevention of  molecular hydrogen can be accomplished by strong photo-dissociating radiation (Lyman-Werner, LW, photons with energy between 11.2 eV and  13.6 eV). A large inflow rate of gas at the center of the halo, higher than $0.1\\, \\rm{M_{\\odot}/yr}$, and sustained for at least 10~Myr, is also needed to form a supermassive star-like object in the nucleus \\citep{Begelman2006,Begelman2007b,Begelman2010,Ball2011,Hosokawa12,Hosokawa2013,2013A&A...558A..59S}. The BH mass can be up to 90\\% of the stellar mass. \n\nSeveral aspects, on different physical scales, of the direct collapse scenario have been addressed in the last years.\nHowever, so far, studies have focused either on small scale simulations to capture the physical processes leading to the gas collapse, or on semi-analytical studies to derive a  DCBH number density.\nFor instance, \\citet{Latif2013} used zoomed cosmological hydrodynamical simulations of single halos to show that when all the conditions listed above are met, collapse can happen \\citep[see also][]{Regan2014}. \\citet[][A12 thereafter]{Agarwal2012SAM} and \\citet[][A14 thereafter]{Agarwal2014},  investigated in post-processing spatial variations in the LW radiation and the importance of the clustering of the LW photon sources, using a 4 comoving Mpc (cMpc) cosmological hydrodynamical simulation. In the meanwhile, semi-analytical studies also derived the number densities of DCBHs, for example \\citet[][D08 thereafter]{Dijkstra2008} computed the probability distribution function of the LW radiation that irradiates halos at redshift $z=10$, and showed that a small fraction of halos, $10^{-8}$ to $10^{-6}$, may be exposed to radiation higher than 20 times the background radiation \\citep[see also][D14 thereafter]{Dijkstra2014}.   \\citet{2015MNRAS.450.4350I} include the impact of X-rays, and predict a decrease in the formation rate of DCBHs per unit volume with redshift.\n\\cite{2015arXiv151001733A}  and \\cite{2015arXiv151201111H} use semi-analytical models with merger trees based on the Extended Press \\& Schechter formalism.  \\citet{Habouzit15} develop a hybrid model, where they ``paint\" galaxies, using the prescriptions of D08 and D14, over a dark matter only simulation, in order to include self-consistently the clustering of halos.  \n\nIn this paper, we use a set of three different cosmological hydrodynamical simulations, with increasing box size, allowing us to capture the physical processes on small scales in a small-volume, high-resolution simulation, to derive the number density of BHs and to test the impact of the SN feedback using a larger simulation  with intermediate resolution. Finally, a large-volume simulation, with lower resolution, Horizon-noAGN (Peirani et al, in prep), is also used to test whether the direct collapse scenario is able to explain the population of quasars that we observe at redshift $z=6$. We follow the approach introduced by D08, A12, D14 and A14 and model the LW radiation field on top of all the different simulations. A DCBH region finder code is applied to compute the DCBH number density function on all the simulations, for different redshifts. \n\nThe paper is organized as follows. \nWe first describe, in Section 2, the simulations we use in this work, and the modeling of the LW radiation intensity, in Section 3. In Section 4,  we investigate SN feedback and, in Section 5 how it can alter the number density of DCBH regions derived from simulations.\nSection 6 is dedicated to simulation Horizon-noAGN, for which we derive the number density of DCBH regions, and we investigate the feasibility of the DC scenario in explaining the population of quasars at $z=6$.\nSection 7 explores a comparison between the approaches to derive the DCBH number density (which leads to discrepancies of several orders of magnitude), using either semi-analytical methods, or using hydrodynamical simulations.\nSection 8 summarizes the results of this work.\n\n\n\\section{Simulation set up}\nWe have performed a set of simulations with increasing box sizes from 1 cMpc to 142 cMpc, using the adaptive mesh refinement hydrodynamical cosmological code {\\sc ramses} \\citep{Teyssier02}. \nParticles are projected on the grid with a cloud-in-cell interpolation and the Poisson equation is solved with an adaptive Particle-Mesh solver.\nThe Euler equations are solved with a MUSCL scheme using an approximate Harten-Lax-Van Leer Riemann solver, with a Min-Mod total variation scheme to interpolate the cell-centered values to their edge locations.\nCells are refined (unrefined) based on a quasi-Lagrangian criterion: with more (less) than 8 DM particles in a cell, or with a total baryonic mass higher (smaller) than 8 times the DM mass resolution.  \nWe summarize in the following the main characteristics of these simulations. Table~\\ref{comp_simu} establishes a comparison between all the simulations parameters used in this work.\nFig.~\\ref{fig:density_maps} shows gas density maps of our simulations Tiny, Chunky, and Horizon-noAGN. In the density map of Chunky (middle panel), the white square indicates the size of Tiny, and in the Horizon-noAGN map (bottom panel, only a small part of the simulation box is shown here), we show the size of the simulation Chunky.\n\n\\subsection{Simulation Tiny}\nThe smallest simulation, Tiny, is performed in a periodic box of $\\rm{L}_{\\rm{box}}= 1\\, \\rm{cMpc}$ size length with $256^{3}$ dark matter particles, corresponding to a mass resolution of $M_{\\rm{DM,res}}=2082\\, \\rm{M_{\\odot}}$. The simulation uses a $\\Lambda$ cold dark matter cosmology, with total matter density $\\Omega_{m}=0.276$, dark matter energy density $\\Omega_{\\Lambda}=0.724$, amplitude of the matter power spectrum $\\sigma_{8}=0.811$, spectral index $\\rm{n_{s}}=0.961$, baryon density $\\Omega_{b}=0.045$ and Hubble constant $\\rm{H_{0}}= 70.3 \\, \\rm{km\\,  s^{-1} \\, Mpc^{-1}}$. \nSimulations are run with 10 levels of refinement ($\\ell_{\\rm min}=8$ defines the number of cells on the coarse level, $\\ell_{\\rm max}=17$ defines the finest level of refinement), leading to a spatial resolution of 7.6 pc.  A new refinement level is allowed only when the expansion factor doubles, namely for $\\rm{a_{exp}}=0.1,0.2,0.4$ and so on.\n\n\\subsection{Simulation Chunky}\nTwo intermediate volume simulations, Chunky, are also run, they differ by the model of SN feedback, in one case we use a ``thermal\" SN feedback and in the other a ``delayed cooling'' SN feedback (both SN feedback models are described in Section 2.5.).  They use the same cosmology as Tiny. Simulations are performed in a periodic box of side $\\rm{L}_{\\rm{box}}= 10\\, \\rm{cMpc}$ with $128^{3}$ dark matter particles, corresponding to a mass resolution of $M_{\\rm{DM,res}}=1.6 \\times10^{7} \\rm{M_{\\odot}}$. These simulations are run on 11 levels of refinement ($\\ell_{\\rm min}=7$, $\\ell_{\\rm max}=17$), leading to a spatial resolution of 76.3 pc.\n\n\\subsection{Simulation Horizon-noAGN}\nWe use the Horizon-noAGN simulation (Peirani et al, in prep.), which is a version without BHs and AGN feedback of the Horizon-AGN simulation \\citep{2014MNRAS.444.1453D}. This simulation has $\\Omega_{\\Lambda}=0.728$, $\\Omega_{\\rm{m}}=0.272$, $\\Omega_{\\rm{b}}=0.045$, $\\sigma_{8}=0.81$, $\\rm{n_{s}}=0.967$, and $\\rm{H}_{0}=70.4\\, \\rm{km \\, s^{-1} \\, Mpc^{-1}}$. Simulations were run with $1024^{3}$ dark matter particles in a $\\rm{L}_{\\rm{box}}= 142 \\,\\rm{cMpc}$ size box, leading to a dark matter mass resolution of $\\rm{M}_{\\rm{DM,res}} = 8 \\times 10^{7} \\rm{M}_{\\rm{\\odot}}$.  Simulations are run on 8 levels of refinement ($\\ell_{\\rm min}=10$, $\\ell_{\\rm max}=17$), leading to a spatial resolution of $\\sim 1$ kpc.\n\n\\begin{table}\n\\caption{Simulation parameters for the four simulations used in this paper: Tiny, the two simulations Chunky, and Horizon-noAGN.}\n\\begin{center}\n\\begin{tabular}{llll}\n\\hline\n\\hline\nSimulations & Tiny & Chunky & Horizon-noAGN \\\\\n\\hline\n$\\rm{L}_{\\rm{box}}\\, \\rm{(Mpc)}$& 1 & 10 & 142 \\\\\nParticles & $256^{3}$ & $128^{3}$ & $1024^{3}$ \\\\ \n$M_{\\rm{res,DM}}\\, (\\rm{M_{\\odot}})$ & $2082 $ &  $1.6 \\times 10^{7} $ & $8 \\times 10^{7} $ \\\\\nSpatial res. (proper pc) & 7.63 & 76.3 & 1000 \\\\\n$m_{\\rm{res,\\star}}\\, (\\rm{M_{\\odot}})$ & $2.3 \\times 10^{2}$ &  $7.7 \\times 10^{3}$ & $2 \\times 10^{6}$\\\\\n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_simu}\n\\end{table}\n\n\\begin{figure}\n\\centering\n   \\includegraphics[scale=0.45]{paperpict_bis_box_density_Tiny_out12.png}\n   \\includegraphics[scale=0.45]{paperpict_bis_box_density_RhoThres1_out12.png}\n   \\includegraphics[scale=0.45]{paperpict_bisbis_box_density_HorizonnoAGN_out12.png}\n\\caption{Gas density maps representing the three simulations used in this work: Tiny ($\\rm{L}_{\\rm{box}}= 1$ cMpc, top panel), Chunky ($\\rm{L}_{\\rm{box}}=10$ cMpc, middle panel), and Horizon-noAGN ($\\rm{L}_{\\rm{box}}= 142$ cMpc, here we only show a small part of the simulation, a box of $\\sim$ 40 cMpc side, bottom panel). The white squares mark the size of the previous simulation: in the gas density map of Chunky (middle panel), we show the size of Tiny, and in Horizon-noAGN map (bottom panel), we show the size of Chunky.}\n\\label{fig:density_maps}\n\\end{figure}\n\n\\subsection{Star formation and physical processes}\nIn all simulations, star formation is allowed in cells with a gas density exceeding the threshold $\\rho_0$, which is $30\\, \\rm  H\\, cm^{-3}$ for Tiny, $1 \\, \\rm H\\, cm^{-3}$ for Chunky, and $0.1 \\, \\rm H\\,cm^{-3}$ for Horizon-noAGN, and modeled with a Kennicutt-Schmidt law:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\dot{\\rho}_{\\star}=\\epsilon_{\\star}\\frac{\\rho}{t_{\\rm{ff}}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho}_{\\star}=\\epsilon_{\\star}\\frac{\\rho}{t_{\\rm{ff}}},\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mo>⋆</mo></msub><mo>=</mo><mrow><msub><mi>ϵ</mi><mo>⋆</mo></msub><mo>⁢</mo><mfrac><mi>ρ</mi><msub><mi>t</mi><mi>ff</mi></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwith $T$ the gas temperature, $T_{0}$ the temperature threshold, $\\rho_{0}$ the density threshold, and $\\kappa$ the polytropic index of the gas.\nWe use $\\rm \\kappa = 1.6 $ for the polytropic index, and $\\rm T_{0}=10^{3}\\, K$ for Chunky, and $\\rm T_{0}=10^{2}\\, K$ for Tiny. For Horizon-noAGN, $\\rm \\kappa = 4/3 $ and $\\rm T_{0}=10^{3} \\,K$ have been used.\n\n\n\\subsection{Supernova feedback}\n\\label{sec:sec_SN}\nBecause metallicity and star formation are both a direct product of how SN feedback is modeled in hydrodynamical simulations, and are of the crucial importance when studying the direct collapse scenario, we test two different SN feedback implementations. We model SNe type II assuming a Chabrier initial mass function, where 20\\% of the mass fraction of stars end up their life in type II SNe, and release $10^{50} \\,\\rm{erg\\, M_{\\odot}^{-1}}$, and return metals with a yield of $0.1$.\nWe use a weak ``thermal\" SN feedback which releases only internal energy in the neighboring cells \\citep{2008A&A...477...79D}. We contrast this with a more efficient SN feedback,``delayed cooling\" which accounts for the energy released by the explosion that can be stored by non-thermal processes, such as unresolved turbulence, cosmic rays, magnetic fields, etc.  These processes will dissipate their energy on potentially longer timescales, defined as the dissipative time $t_{diss}$. In order to mimic the energetic and pressure enhancement by the non-thermal component, in the delayed cooling implementation gas cooling is prevented in gas cells where the non-thermal energy component (or non-thermal velocity dispersion~$\\sigma_{\\rm{NT}}$) is larger than some user-defined threshold~\\citep{Stinson2006,2013MNRAS.429.3068T}. We adopt the implementation of \\citet{2015MNRAS.452.1502D} in order to match the values of $t_{\\rm diss}$ and $\\sigma_{\\rm NT}$ to that required for the blast wave to propagate over a Jeans length (4 high-resolution cells).\nFinally, $\\rm{M_{gmc}}$ is the stellar mass exploding in SN, which we take equal to $10 \\times m_{\\rm{res,\\star}}$ for all the simulations.  \nFor Chunky we use the parameters: $\\rm{M_{gmc}}=7.7\\times 10^{4}\\, \\rm{M_{\\odot}}$, $\\rm{\\sigma_{NT}}=4.3 \\times 10^{-4}\\, \\rm{km \\, s^{-1}}$, $\\rm{t_{diss}}=4.6 \\, \\rm{Myr}$. For Tiny we use: $\\rm{M_{gmc}}=2.5 \\times 10^{3} \\, \\rm{M_{\\odot}}$, $\\rm{\\sigma_{NT}}=2.5 \\times 10^{-4}\\, \\rm{km \\, s^{-1}}$, $\\rm{t_{diss}}=0.59\\, \\rm{Myr}$. Horizon-noAGN includes a ``kinetic feedback\" with a strength intermediate between these two implementations.\n\n\n\\subsection{Halo catalog and merger trees}\nWe construct catalogues of halos using the AdaptaHOP halo finder~\\citep{Aubert+04}, which uses an SPH-like kernel to compute densities at the location of each particle and partitions the ensemble of particles into sub-halos based on saddle points in the density field. Halos contain at least 20 particles. We study the individual evolution of halos by building merger trees using the code TreeMaker developed by~\\citet{Tweed+09}.  \n\n\\section{Method}\nWe post-process the identification of all the regions, in a given simulation, which are eligible for the formation of a DCBH. In large cosmological simulations the main difficulty is to capture both large scales to have statistics and very small scales where the collapse of gas and the formation of a massive central object can be resolved. Several physical processes, playing a crucial role for the direct collapse scenario, such as  star formation,  metal-enrichment, depend on the simulation resolution. In order to take this into account, we have run our DCBH finder code on three different simulations. Therefore we are covering a large range of resolutions and volumes.\n\nAccording to the direct collapse scenario, metal-free/metal-poor halos with mass $>10^{7}-10^8 {\\,{\\rm M_\\odot}}$ may host DCBHs under specific conditions. An inflow rate (higher than $0.1\\, \\rm{M_{\\odot}/yr}$) of gas at the center of the halo can lead to the formation of a supermassive star-like object in the nucleus. The star can then collapse and form a $10^{5}-10^{6}\\, \\rm{M_{\\odot}}$ BH.\nIn order for the Jeans mass to remain sufficiently high to form only one very massive object, efficient cooling by molecular hydrogen or metals must be prevented. Therefore metal-free conditions and a strong photo-dissociating flux are required.\n\nA12 and A14 model the Lyman-Werner radiation as the sum of a spatial varying component of the radiation produced by young stars and of a background component. The background component is described by:\n\n\n", "itemtype": "equation", "pos": 16290, "prevtext": "\nwith $\\dot{\\rho}_{\\star}$ the star formation rate density, $\\epsilon_{\\star}=0.02$ the star formation efficiency (constant with redshift), $\\rho$ the density of the gas and $t_{\\rm{ff}}$ the free-fall time of the gas.\nStars are created with a Poisson random process calculating the probability to form $N$ stars with a mass resolution of $m_{\\rm{res,\\star}}=2.3 \\times 10^{2} \\, \\rm{M_{\\odot}}$ for Tiny,  $7.7 \\times 10^{3} \\, \\rm{M_{\\odot}}$ for Chunky, and $2 \\times 10^{6} \\, \\rm{M_{\\odot}}$ for Horizon-noAGN \\citep{rasera&teyssier06}.\nCooling is modeled with  the cooling curves of \\citet{sutherland&dopita93}, the gas cools through H, He, and metals.  Modeling the metallicity as a passive variable makes it easily trackable over the gas flow through redshift evolution. Physical processes, such as SN explosions and star formation, modify and redistribute the metallicity over neighboring cells. An initial zero metallicity is assumed for Chunky.\nHowever, for the smallest box size simulation, as we resolve mini-halos below the threshold for atomic hydrogen cooling, we use a metallicity floor of $10^{-3} \\, \\rm{Z_{\\odot}}$ in order to mimic cooling by molecular hydrogen.\nThe same metallicity background is employed in Horizon-noAGN. The cooling by metals also mimics here cooling by molecular hydrogen, therefore allowing the formation of stars in mini-halos. \nThe gas follow an adiabatic equation-of-state (EoS) for monoatomic gas with adiabatic index $\\gamma=5/3$, except at high gas densities $\\rho>\\rho_0$, where we use a polytropic EoS to increase the gas pressure in dense gas in order to limit excessive gas fragmentation by mimicking heating of the interstellar medium from stars~\\citep{springel&hernquist03}:\n\n", "index": 3, "text": "\\begin{equation}\nT=T_{0}\\left(\\frac{\\rho}{\\rho_{0}}\\right)^{\\kappa-1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"T=T_{0}\\left(\\frac{\\rho}{\\rho_{0}}\\right)^{\\kappa-1}\" display=\"block\"><mrow><mi>T</mi><mo>=</mo><mrow><msub><mi>T</mi><mn>0</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>ρ</mi><msub><mi>ρ</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mi>κ</mi><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\n\n\\noindent in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, with  $\\dot{\\rho}_{\\star,II}=10^{-3}\\, \\rm{M_{\\odot}\\,yr^{-1}Mpc^{-3}}$ for the star formation rate (constant with time). The background radiation intensity, however, is negligible compared to the local radiation intensity: \n\n\n", "itemtype": "equation", "pos": 20929, "prevtext": "\nwith $T$ the gas temperature, $T_{0}$ the temperature threshold, $\\rho_{0}$ the density threshold, and $\\kappa$ the polytropic index of the gas.\nWe use $\\rm \\kappa = 1.6 $ for the polytropic index, and $\\rm T_{0}=10^{3}\\, K$ for Chunky, and $\\rm T_{0}=10^{2}\\, K$ for Tiny. For Horizon-noAGN, $\\rm \\kappa = 4/3 $ and $\\rm T_{0}=10^{3} \\,K$ have been used.\n\n\n\\subsection{Supernova feedback}\n\\label{sec:sec_SN}\nBecause metallicity and star formation are both a direct product of how SN feedback is modeled in hydrodynamical simulations, and are of the crucial importance when studying the direct collapse scenario, we test two different SN feedback implementations. We model SNe type II assuming a Chabrier initial mass function, where 20\\% of the mass fraction of stars end up their life in type II SNe, and release $10^{50} \\,\\rm{erg\\, M_{\\odot}^{-1}}$, and return metals with a yield of $0.1$.\nWe use a weak ``thermal\" SN feedback which releases only internal energy in the neighboring cells \\citep{2008A&A...477...79D}. We contrast this with a more efficient SN feedback,``delayed cooling\" which accounts for the energy released by the explosion that can be stored by non-thermal processes, such as unresolved turbulence, cosmic rays, magnetic fields, etc.  These processes will dissipate their energy on potentially longer timescales, defined as the dissipative time $t_{diss}$. In order to mimic the energetic and pressure enhancement by the non-thermal component, in the delayed cooling implementation gas cooling is prevented in gas cells where the non-thermal energy component (or non-thermal velocity dispersion~$\\sigma_{\\rm{NT}}$) is larger than some user-defined threshold~\\citep{Stinson2006,2013MNRAS.429.3068T}. We adopt the implementation of \\citet{2015MNRAS.452.1502D} in order to match the values of $t_{\\rm diss}$ and $\\sigma_{\\rm NT}$ to that required for the blast wave to propagate over a Jeans length (4 high-resolution cells).\nFinally, $\\rm{M_{gmc}}$ is the stellar mass exploding in SN, which we take equal to $10 \\times m_{\\rm{res,\\star}}$ for all the simulations.  \nFor Chunky we use the parameters: $\\rm{M_{gmc}}=7.7\\times 10^{4}\\, \\rm{M_{\\odot}}$, $\\rm{\\sigma_{NT}}=4.3 \\times 10^{-4}\\, \\rm{km \\, s^{-1}}$, $\\rm{t_{diss}}=4.6 \\, \\rm{Myr}$. For Tiny we use: $\\rm{M_{gmc}}=2.5 \\times 10^{3} \\, \\rm{M_{\\odot}}$, $\\rm{\\sigma_{NT}}=2.5 \\times 10^{-4}\\, \\rm{km \\, s^{-1}}$, $\\rm{t_{diss}}=0.59\\, \\rm{Myr}$. Horizon-noAGN includes a ``kinetic feedback\" with a strength intermediate between these two implementations.\n\n\n\\subsection{Halo catalog and merger trees}\nWe construct catalogues of halos using the AdaptaHOP halo finder~\\citep{Aubert+04}, which uses an SPH-like kernel to compute densities at the location of each particle and partitions the ensemble of particles into sub-halos based on saddle points in the density field. Halos contain at least 20 particles. We study the individual evolution of halos by building merger trees using the code TreeMaker developed by~\\citet{Tweed+09}.  \n\n\\section{Method}\nWe post-process the identification of all the regions, in a given simulation, which are eligible for the formation of a DCBH. In large cosmological simulations the main difficulty is to capture both large scales to have statistics and very small scales where the collapse of gas and the formation of a massive central object can be resolved. Several physical processes, playing a crucial role for the direct collapse scenario, such as  star formation,  metal-enrichment, depend on the simulation resolution. In order to take this into account, we have run our DCBH finder code on three different simulations. Therefore we are covering a large range of resolutions and volumes.\n\nAccording to the direct collapse scenario, metal-free/metal-poor halos with mass $>10^{7}-10^8 {\\,{\\rm M_\\odot}}$ may host DCBHs under specific conditions. An inflow rate (higher than $0.1\\, \\rm{M_{\\odot}/yr}$) of gas at the center of the halo can lead to the formation of a supermassive star-like object in the nucleus. The star can then collapse and form a $10^{5}-10^{6}\\, \\rm{M_{\\odot}}$ BH.\nIn order for the Jeans mass to remain sufficiently high to form only one very massive object, efficient cooling by molecular hydrogen or metals must be prevented. Therefore metal-free conditions and a strong photo-dissociating flux are required.\n\nA12 and A14 model the Lyman-Werner radiation as the sum of a spatial varying component of the radiation produced by young stars and of a background component. The background component is described by:\n\n\n", "index": 5, "text": "\\begin{equation}\n\\rm{J_{LW,bg,II}}=0.3 \\left( \\frac{1+z}{16}\\right)^{3}\\left(\\frac{\\dot{\\rho}_{\\star,II}}{10^{-3}\\,\\rm{M_{\\odot}\\,yr^{-1}Mpc^{-3}}}\\right) \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\rm{J_{LW,bg,II}}=0.3\\left(\\frac{1+z}{16}\\right)^{3}\\left(\\frac{\\dot{\\rho}_{%&#10;\\star,II}}{10^{-3}\\,\\rm{M_{\\odot}\\,yr^{-1}Mpc^{-3}}}\\right)\" display=\"block\"><mrow><msub><mi mathvariant=\"normal\">J</mi><mrow><mi>LW</mi><mo>,</mo><mi>bg</mi><mo>,</mo><mi>II</mi></mrow></msub><mo>=</mo><mrow><mn>0.3</mn><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>+</mo><mi mathvariant=\"normal\">z</mi></mrow><mn>16</mn></mfrac><mo>)</mo></mrow><mn>3</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mrow><mo>⋆</mo><mo>,</mo><mi>II</mi></mrow></msub><mrow><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>3</mn></mrow></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mpadded><mo>⁢</mo><msup><mi>yr</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mi>Mpc</mi><mrow><mo>-</mo><mn>3</mn></mrow></msup></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\n\\noindent in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, with $\\rm{r}$ the distance between the source and the region where we compute the radiation and $\\rm{m}$ the mass of the star. In the following, $\\rm{J_{LW, crit}}$ refers to the critical value of $\\rm{J_{LW,local,II}}$ in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, which we simplify in $\\rm{J_{LW}}$.  In this study, as we will consider radiation intensity thresholds much above the background level, we do not include the background component to the radiation intensity, which would be negligible compared to the spatially varying component. We have also not included radiation produced by Pop~III stars, as their contribution to DCBH formation is highly subdominant compared to the Pop~II population (see A12 and A14). In this work, we do not include self-shielding by molecular hydrogen, self-shielding of halos could decrease the number density of DCBH regions we find in the following sections. \n\nThe critical value required for DCBH depends of the spectrum of the stellar population, \\citet{Wolcott2011} argue a $\\rm{J_{LW, crit}}=1000$ for a Pop III population, \\citet{Shang2010} show that the critical value ranges in $J\\rm{_{LW, crit}}=30-300$ for a Pop II population. A strong radiation is needed in order to not only dissociate the molecular hydrogen in the outer parts of the halo, but also in the center. The critical values cited just above are thought to be sufficient to bring the molecular fraction down to $10^{-8}$ in 1D simulations. We consider a critical value of the radiation intensity of either $\\rm{J_{LW, crit}}=30$ \\citep{Agarwal2012SAM, Agarwal2014}, $\\rm{J_{LW, crit}}=100$ or $\\rm{J_{LW, crit}}=300$. These values are lower compared to those required by high-resolution 3-D cosmological simulations \\citep{Regan2014,Latif2014ApJ,Latif2015a}, which require $\\rm{J_{LW, crit}}>500-1000$. Inclusion of X-rays also increases the critical flux \\citep{2015MNRAS.450.4350I}, but the net effect is still unclear \\citep{LatifXray2015}. It will be clear in the following that if we were to consider such values we would not form any DCBH in our volumes. Therefore, what we obtain is an upper limit to the number of DCBHs.\n\n\n\\section{Impact of SN feedback on metallicity and star formation}\n\n\n\\begin{figure}\n\\centering\n   \\includegraphics[width=6.8cm]{comp_metallicity_stellar_mass_median_1sigma.pdf}\n\\caption{Top panel: Median of the average metallicity of halos in the two Chunky simulations, at redshift $z=7.33$, binned in mass. Bottom panel: median stellar mass enclosed in a sphere with a radius of 350 ckpc around halos (solid lines, red for the simulation with the delayed cooling SN feedback and yellow for the thermal SN feedback). Dashed lines include only stellar mass in young stars (age $\\leqslant  5$~Myr). Shaded areas extend to the $1\\sigma$ values. The spread in the metallicity, as well as in the stellar mass, is due to very isolated halos. thermal feedback decreases the probability of having DCBH regions because the number of halos polluted by metals is higher, but it also favors it because the amount of radiation produced by young stars is higher.}\n\\label{fig:met_stars}\n\\end{figure}\n\nMetals are created by stars and spread by SN explosions. Therefore SN feedback implementation has a strong impact on the metal-enrichment of the intergalactic medium, and on the number density of BH seeds formed. SN feedback also regulates star formation, therefore modulates the formation of the young stars that can provide Lyman-Werner radiation. \n\nThe simulation Tiny allows us to resolve the detailed expansion of the metal-enriched bubbles, but the size of the simulation (1 cMpc) is  too small to see, statistically, the impact of SN metal enrichment on the number density of DCBHs. We use Chunky, a simulation with a side length 10 times larger (10 cMpc), to study metal enrichment and star formation rate for a significant volume of the Universe. We have run two identical simulations where only the prescription for the SN feedback is different, as described in Section 2.6. The thermal SN feedback is weaker, compared to delayed cooling. In fact, the total mass in stars in the box is about one order of magnitude larger for the thermal feedback case, at all redshifts. \n\nThe direct collapse scenario depends on two main quantities: the metallicity of the halo, and the radiation intensity it is exposed to, which in turn depends on the mass in nearby young stars ($<5$ Myr). We compare these two quantities for the two SN feedbacks in Fig.~\\ref{fig:met_stars}. We calculate a halo mean metallicity averaging over all the gas leaf cells enclosed in its virial radius, and show the median of these mean metallicity values for all the halos in the two Chunky simulations, with solid lines in Fig.~\\ref{fig:met_stars} (top panel). The shaded areas represent the $1\\sigma$ values of halos metallicity. Thermal feedback leads to a higher metal enrichment. This is simply due to the larger stellar mass formed when adopting the SN thermal feedback, as evident from the bottom panel of Fig.~\\ref{fig:met_stars}, which represents the median stellar mass in the neighborhood of halos (solid lines), in a sphere with a 350 ckpc radius. This median stellar mass is larger with the thermal feedback.  The stellar mass in young stars ($\\leqslant 5$ Myr), which contribute at a given redshift to the LW radiation, is shown as dashed lines and follows the same trend.\n\nIt is difficult to predict the global effect of SN feedback on the number density of DCBHs in a cosmological box because metal enrichment and the amount of  stellar mass in young stars have opposite effects.  Regarding the former, delayed cooling SN feedback is more favourable to the formation of DCBHs - more halos are metal-poor and therefore eligible for DCBH formation-, regarding  the latter, it is the thermal SN feedback implementation that has the advantage - halos are illuminated by stronger radiation because there are more young stars at any given time.\n\n\n\\section{Number density of direct collapse regions in Chunky}\n\n\\begin{figure}\n\\centering\n   \\includegraphics[width=9cm]{comp_evolution_out12_211.pdf}\n\\caption{ We compare one DCBH candidate halo in the simulation Chunky with the thermal supernova feedback (in orange) and the corresponding halo in the delayed cooling simulation (in red). Top panel:  stellar mass (solid lines),  stellar mass in young stars (dashed lines) in the neighborhood of the candidate (in a sphere of 350 ckpc radius). Bottom panel: the radiation intensity (dots) seen by the candidate halo for the two supernova feedbacks. The critical radiation intensity used in A12, $\\rm{J_{LW,crit}}=30$, is shown as a dashed grey line. Arrows represent the free-fall time used in D08. If a candidate is above the critical LW radiation for the full length of an arrow, it is retained. In this case the orange dot (thermal feedback) remains a candidate, the red dot (delayed cooling feedback) does not.}\n\\label{fig:comp_evolution}\n\\end{figure}\n\n\\begin{table}\n\\caption{Number of direct collapse regions in the simulation Chunky with thermal SN feedback, assuming that collapse requires either 10 Myr, or the full free-fall time of the halo. For reference in Chunky with delayed cooling SN feedback, the only case that gives one candidate, at $z=7.33$,  has $\\rm{J_{LW,crit}}=30$ and a collapse time of 10 Myr.}\n\\begin{center}\n\\begin{tabular}{lcccc}\n\\hline\n\\hline\nCriteria & $z=10.1$ & $9.00$ & $8.09$ & $7.33$\\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$,  10 Myr & 1 & 3 & 6 & 17\\\\\n$\\rm{J_{LW,crit}}=30$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 3 \\\\\n$\\rm{J_{LW,crit}}=100$,  10 Myr & 0 & 0 & 1 & 3\\\\\n$\\rm{J_{LW,crit}}=100$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 0\\\\\n$\\rm{J_{LW,crit}}=300$,  10 Myr & 0 & 0 & 0 & 0 \\\\\n$\\rm{J_{LW,crit}}=300$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 0 \\\\\n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh}\n\\end{table}\n\nWe now turn to identifying the number of regions which are eligible for the direct collapse scenario. These regions must fulfill three criteria: they must be metal-poor, not forming stars, and be illuminated by a LW radiation intensity higher than the threshold $\\rm{J_{LW, crit}}=30$ (we take here the same value as in A12) during the whole time it takes for the collapse and DCBH formation. D08 use a free-fall time defined by:\n\n", "itemtype": "equation", "pos": 21412, "prevtext": "\n\n\\noindent in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, with  $\\dot{\\rho}_{\\star,II}=10^{-3}\\, \\rm{M_{\\odot}\\,yr^{-1}Mpc^{-3}}$ for the star formation rate (constant with time). The background radiation intensity, however, is negligible compared to the local radiation intensity: \n\n\n", "index": 7, "text": "\\begin{equation}\n\\rm{J_{LW,local,II}}=3 \\sum_{i,stars \\leqslant 5Myr}\\left( \\frac{r_{i}}{1\\, \\rm{kpc}}\\right)^{-2}  \\left(\\frac{m_{i}}{10^{3}\\,\\rm{M_{\\odot}}}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\rm{J_{LW,local,II}}=3\\sum_{i,stars\\leqslant 5Myr}\\left(\\frac{r_{i}}{1\\,\\rm{%&#10;kpc}}\\right)^{-2}\\left(\\frac{m_{i}}{10^{3}\\,\\rm{M_{\\odot}}}\\right)\" display=\"block\"><mrow><msub><mi mathvariant=\"normal\">J</mi><mrow><mi>LW</mi><mo>,</mo><mi>local</mi><mo>,</mo><mi>II</mi></mrow></msub><mo>=</mo><mrow><mn>3</mn><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi mathvariant=\"normal\">i</mi><mo>,</mo><mi>stars</mi></mrow><mo>⩽</mo><mrow><mn>5</mn><mo>⁢</mo><mi mathvariant=\"normal\">M</mi><mo>⁢</mo><mi mathvariant=\"normal\">y</mi><mo>⁢</mo><mi mathvariant=\"normal\">r</mi></mrow></mrow></munder><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">r</mi><mi mathvariant=\"normal\">i</mi></msub><mrow><mpadded width=\"+1.7pt\"><mn>1</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">m</mi><mi mathvariant=\"normal\">i</mi></msub><mrow><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mn>3</mn></msup></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwhich assumed $\\rho \\sim 200 \\times \\bar{\\rho}$.\nThis is the free-fall time at the virial radius. \\citet{Visbal14} argue instead that the relevant collapse time is that of the gas, on scales 10\\% of the virial radius, so that the collapse time should be $0.1\\times t_{\\rm{Myr, ff}}$. The length of the collapse in 3D high-resolution simulations of \\citet{Latif2015}, indeed lasts $\\sim$10~Myr. \nIn this study, we consider both the redshift-dependent collapse time, defined in Eq.~\\ref{eq:t_ff} (D14), and a collapse time of 10 Myr, which appears more realistic, according to recent simulation studies.\n\nWe give an example of our technique in the following. We show in Fig.~\\ref{fig:comp_evolution} one concrete example of a DCBH candidate halo, with a mass of $M_{\\rm{h}}=5.2 \\times 10^{8} M_{\\rm{\\odot}}$ at $z=7.33$: the top panel shows the evolution of the stellar mass in the environment of the halo, the total stellar mass is represented with solid lines, the stellar mass in young stars is shown with dashed lines. The corresponding radiation intensity is shown in the bottom panel with dots, the grey dashed line indicates the radiation intensity threshold of $\\rm{J_{LW,crit}}=30$. The simulation with thermal feedback is shown in orange, and the simulation with the delayed cooling feedback in red. Grey arrows give an idea of the free-fall time at that redshift, computed as in D08. \nWe see that when the stellar mass in young stars increases, the radiation intensity also increases, and when it decreases at redshift $z=6.6$, the radiation intensity also decreases. \n\nUsing this technique, only considering the radiation criterion, for the thermal SN feedback case, 17 regions are identified as potential DCBH sites, at $z=7.33$. The maximum value of the radiation intensity at that redshift is $\\rm{J_{LW}}=162.72$. Then we look back in time using merger trees made with TreeMaker \\citep{Tweed09}, in order to check if these candidates have been illuminated by a sufficiently high radiation intensity for at least one collapse time, and how the intensity varies over time. We find that only 4 of the candidates are illuminated by a radiation intensity above the critical value for at least one collapse time, and therefore are still flagged as DCBH candidates. \nFinally we check the metallicity of the candidates, and find that only one region is not polluted by metals, and 2 regions are partially polluted, which leads to a number density $\\rm{n_{DCBH}} \\leqslant 3 \\times 10^{-3} \\rm{cMpc^{-3}}$. Zero candidates are found for $\\rm{J_{LW,crit}}=100$ and $\\rm{J_{LW,crit}}=300$.\n\nIn the previous paragraph, we adopted as collapse time the free-fall time of the halo, defined by Eq.~\\ref{eq:t_ff}. However, if we now use a collapse time of 10 Myr, as suggested by \\citet{Visbal14},  for the same $\\rm{J_{LW, crit}}=30$, we find: 1 halo at $z=10.1$ with  $Z <10^{-3.5} \\,\\rm{Z_{\\odot}}$, 3 regions at $z=9.00$ (all with $Z=0$), 6 regions at $z=8.09$ (3 regions with $Z=0$, and 3 regions with $Z <10^{-3.5} \\,\\rm{Z_{\\odot}}$), 17 regions at $z=7.33$  (7 regions with $Z=0$, and 10 regions with $Z <10^{-3.5}\\, \\rm{Z_{\\odot}}$). All the regions are in halos with $M_{\\rm{h}}>10^{8} \\, \\rm{M_{\\odot}}$.  With a radiation intensity threshold of $\\rm{J_{LW,crit}}=100$, the numbers decrease  to 1 at $8.09$, and 3 at $z=7.33$, no DCBH halo is found at $z=10.1$ or $z=9.00$. Zero candidates are found for $\\rm{J_{LW,crit}}=300$.\n\nWe repeat the same exercise for the simulation with delayed cooling SN feedback, and find only one candidate for the DCBH process, for the case with $\\rm{J_{LW, crit}}=30$, and assuming a collapse time of 10~Myr. No candidates are found in the other cases. The maximum radiation intensity is $\\rm{J_{LW}}=30.33$. In conclusion, the  lower stellar mass in young stars in the delayed cooling simulation directly impacts the direct collapse scenario, by strongly decreasing the number of regions illuminated by a sufficient radiation intensity, and therefore decreasing the number density of DCBHs. The total number density of direct collapse candidates we find in the two Chunky boxes is shown in Fig.~\\ref{fig:number_density}, orange symbols when using for the collapse time the free-fall time of the halo, violet symbols for a collapse time of 10 Myr, and the number of candidates is reported in Table~\\ref{comp_ndcbh}. As a note, no DCBH is found in Tiny, for any subset of criteria. Small simulation boxes only allow us to derive a number density of DCBH regions for $\\rm{J_{LW,crit}}=30$, which appears to be slightly lower than the values derived by D14, and even lower compared to A14. The differences between implementations causing these discrepancies are analysed and discussed in Section 7.  \n\n\n\\section{Horizon-noAGN simulation: Can direct collapse explain the BHs powering $z=6$ quasars?}\n\n\\begin{figure*}\n\\centering\n   \\includegraphics[width=\\textwidth]{number_density_all_mel_6.pdf}\n\\caption{Number density of halos that can host a DCBH. In grey we show the number density from previous studies. Symbols represent different radiation intensity thresholds. Squares:  $\\rm{J_{LW,crit}}=30$, circles:  $\\rm{J_{LW,crit}}=100$, triangles:  $\\rm{J_{LW,crit}}=300$, stars:  $\\rm{J_{LW,crit}}=30$ without considering the metal-pollution from galactic winds coming from star-forming regions. The light grey square is from A14 (post-processing of a hydrodynamical simulation), dark grey are the results of D14 (analytical). Light grey stars are from \\citet{Habouzit15}.  The orange square shows the number density for Chunky  (10 cMpc side box), for the thermal SN feedback (0 regions are identified in the simulation employing the delayed cooling SN feedback). The blue squares,  circle and triangle represent the large-scale cosmological simulation Horizon-noAGN (142 cMpc side box). }\n \\label{fig:number_density}\n\\end{figure*}\n\nWe now turn to exploring the number density of BHs in the Horizon-noAGN simulation. This simulation allows us to look at  DCBH formation without being biased by the feedback of pre-existing BHs, compared to the sister simulation, Horizon-AGN, which includes BH accretion and feedback. The main advantage of the simulation is that the large box (142 cMpc side length) allows some statistics, at the expense of spatial and mass resolution.  We use the same method as for the set of Chunky simulations to compute the radiation intensity illuminating halos. \n\nWe first flag all halos illuminated by a radiation intensity higher than $\\rm{J_{LW,crit}}=30$. We identify 8 regions at redshift $z=9.83$, and 814 regions at $z=7.31$. Since we are trying to estimate whether DCBHs can explain the number density of $z>6$ quasars, we do not need to proceed to lower redshift (the next available output is at $z=5.87$). This simulation includes a metallicity floor, therefore we rescaled the metallicity accordingly. Halos with a mean metallicity lower than $10^{-3.5}\\rm{Z_{\\odot}}$ are kept as DCBH candidates. We are left with 2 regions at redshift $z=9.83$, 373 regions at $z=7.31$. \nFor a radiation intensity of  $\\rm{J_{LW,crit}}=100$  we identify 2 regions at redshift $z=9.83$ and 153 at $z=7.31$.  Including the metallicity criterion ($Z  \\leqslant 10^{-3.5} Z_{\\rm{\\odot}}$), there are 0 regions at redshift $z=9.83$, and 42  at $z=7.31$. \nFor a radiation threshold of $\\rm{J_ {LW,crit}}=300$ we identify 1 region at redshift $z=9.83$ and 13 regions at $z=7.31$.  Including the metallicity criterion, we find 0 regions at redshift $z=9.83$, 2 regions at $z=7.31$ ($Z  \\leqslant 10^{-3.5} Z_{\\rm{\\odot}}$), and no region at $z=9.83$. See Table 2 for a summary. Metallicity appears to be a key parameter in the direct collapse scenario, reducing significantly the number of DCBH candidates (up to 25 \\% at $z=9.83$, 45 \\% at $z=7.31$). \n\n\\begin{table}\n\\caption{Number of direct collapse regions in the simulation Horizon-noAGN.}\n\\begin{center}\n\\begin{tabular}{lcc}\n\\hline\n\\hline\nCriteria & $z=9.83$ & $z=7.31$ \\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$ & 8 & 814\\\\\n$\\rm{J_{LW,crit}}=30$,  $Z \\leqslant10^{-3.5}  Z_{\\rm{\\odot}}$ & 2 & 373 \\\\\n$\\rm{J_{LW,crit}}=100$ & 2 & 153 \\\\\n $\\rm{J_{LW,crit}}=100$,  $Z \\leqslant10^{-3.5} Z_{\\rm{\\odot}}$ & 0 & 42 \\\\\n$\\rm{J_{LW,crit}}=300$ & 1 & 13 \\\\\n$\\rm{J_{LW,crit}}=300$,  $Z \\leqslant10^{-3.5}  Z_{\\rm{\\odot}}$ & 0 & 2 \\\\\n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh2}\n\\end{table}\n\nIt is important to notice here that the time-scale between two outputs in the simulation are larger than the collapse time, either the free-fall time or 10 Myr. Therefore we are missing the time criterion of the direct collapse here: some of the candidates identified could be polluted by metals before the full collapse time has elapsed and therefore before unable to form the DCBH. The radiation intensity could also vary and not be enough to sustain molecular hydrogen dissociation for the full collapse time. Another important caveat is the resolution of the simulation, $\\rm{\\Delta x=1 kpc}$ and $\\rm{M_{DM,res}=8 \\times 10^{7} {\\,{\\rm M_\\odot}}}$, which does not allow us to capture the first metal-enrichment of halos, simply because we do not resolve small halos. Rather than the quantitative numbers, Horizon-noAGN allows us to explore trends in a statistical sense. \n\nFig.~\\ref{fig:number_density} shows the number density obtained for the simulation Chunky (in orange, and violet) and Horizon-noAGN (in light blue). \nAll the grey symbols represent previous studies: the light grey square is for A14, dark grey squares for D14, both for $\\rm{J_{LW,crit}}=30$, dark grey circles are for D14 and $\\rm{J_{LW,crit}}=300$, dark grey triangles for D14 and $\\rm{J_{LW,crit}}=300$.\\\\\n\nIn Horizon-noAGN, considering the metallicity threshold $Z \\leqslant10^{-3.5} \\, Z_{\\rm{\\odot}}$, we find $n_{\\rm{DCBH}} \\simeq 10^{-7} \\, \\rm{cMpc^{-3}}$ at $z=9.83$, and $n_{\\rm{DCBH}} \\simeq 10^{-4}\\, \\rm{cMpc^{-3}}$ at $z=7.31$ (blue squares in Fig.~\\ref{fig:number_density}), for $\\rm{J_{LW,crit}}=30$. At $z=7.31$, for $\\rm{J_{LW,crit}}=100$,  we find $n_{\\rm{DCBH}} \\simeq 10^{-5}\\, \\rm{cMpc^{-3}}$ (blue circle in Fig.~\\ref{fig:number_density}), and $n_{\\rm{DCBH}} \\simeq 10^{-6}\\, \\rm{cMpc^{-3}}$ for $\\rm{J_{LW,crit}}=300$ (blue triangle in Fig.~\\ref{fig:number_density}).\n\nFor Horizon-noAGN, our attempt was to see if the conditions on metallicity and on radiation intensity could be meet in more than few halos. Of course, with this simulation, we do not resolve small halos, nor the early metal-enrichment, but it gives us a first picture of the feasibility of the direct collapse scenario on a cosmological scale. For $\\rm{J_{LW,crit}}=30$, we again find a number density smaller than D14, and A14. However, for the highest thresholds, $\\rm{J_{LW,crit}}=100$, $\\rm{J_{LW,crit}}=300$, the number density of DCBH regions are very similar to those found by D14.\n\nFinally, we investigate the probability for massive halos at $z\\sim6$ to be seeded by a DCBH. A massive halo at $z\\sim6$, will host a DCBH if at least one of its progenitors was a DCBH region (namely metal-poor halos, illuminated by a strong photo-dissociating radiation intensity).  \nWe start by selecting all the most massive halos in the simulation Horizon-noAGN at $z=5.8$, namely the 552 halos with $\\rm{M_{h}}\\geqslant10^{11}\\, \\rm{M_{\\odot}}$. We build the merger history of all these halos with TreeMaker \\citep{Tweed09}, with the two previous snapshots of the simulation, at $z=7.3$ and $z=9.8$. We compute the mean metallicity of all the progenitors of massive halos at $z=5.8$, and the photo-dissociating radiation they are illuminated by.\nOf the 552 halos with $\\rm{M_{h}}>=10^{11}\\, \\rm{M_{\\odot}}$ at $z=5.8$, 155 have at least one DCBH progenitor at $z=7.3$, illuminated by a radiation with an intensity higher than $\\rm{J_{LW,crit}=30}$ and with a metallicity $\\rm{Z}<10^{-3.5} \\, \\rm{Z_{\\odot}}$. We do not identify any DCBH progenitor at $z=9.8$. Therefore the fraction of massive halos which can host a DCBH is 155/552=0.28, so 28\\% of the massive halos. When considering a radiation intensity threshold of  $\\rm{J_{LW,crit}=100}$, only 6.5\\% of the massive halos can host a DCBH, and it drops to 0.36\\% for $\\rm{J_{LW,crit}=300}$.\n\nIn summary, about a third of the most massive halos at $z=6$ have at least one progenitor reaching both the criterion on metallicity ($\\rm{Z}<10^{-3.5} \\, \\rm{Z_{\\odot}}$) and the criterion on radiation intensity ($\\rm{J_{LW,crit}=30}$). However, this fraction drops significantly down to $\\sim 6\\%$ for $\\rm{J_{LW,crit}=100}$, and even more, down to less than 1\\% for a more realistic value of $\\rm{J_{LW,crit}=300}$.\n\n\\begin{table}\n\\caption{Percentage of massive halos with at least one DCBH progenitor, in the simulation Horizon-noAGN.}\n\\begin{center}\n\\begin{tabular}{lc}\n\\hline\n\\hline\nCriteria & $\\rm{Z} \\leqslant10^{-3.5}$ \\\\%& $\\rm{Z} \\leqslant10^{-5}$ \\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$ & 28\\% \\\\%& 28\\%\\\\\n$\\rm{J_{LW,crit}}=100$ & 6.5\\% \\\\%& 6.3\\% \\\\\n$\\rm{J_{LW,crit}}=300$ & 0.36\\% \\\\%& 0.18\\% \\\\ \n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh3}\n\\end{table}\n\n\n\\section{Comparison between hydro-dynamical simulations and (semi-)analytical models}\n\\begin{figure}\n   \\includegraphics[scale=0.4]{dijkstra_2014_radiation.pdf}\n   \\caption{Radiation intensity (in $\\rm{J_{LW}}$ units) provided by a source at a given distance (in proper kpc) for different sources mass at $z=10$ (halo masses of the source from top to bottom: $4 \\times 10^{11}$, $2 \\times 10^{11}$, $10^{11}$, $8 \\times 10^{10}$, $6 \\times 10^{10}$, $4 \\times 10^{10}$, $2 \\times 10^{10}$, $10^{10} \\,\\rm{M_{\\odot}}$), 10 Myr after the star formation burst (left panel), and 83 Myr after the burst (right panel) using the model by  D14.}\n   \\label{fig:radiation_1}\n\\end{figure}\n\n\\begin{figure}\n   \\includegraphics[scale=0.42]{dijkstra_2014_radiation_agarwal.png}\n    \\caption{Radiation intensity (in $\\rm{J_{LW}}$ units) provided by a source at a given distance (in pkpc) for different sources mass, at $z=10$.  The colored curves (colors as in Fig.~\\ref{fig:radiation_1}) show the radiation intensity based on A14, considering a stellar population PopIII (left) or PopII (right) as the radiation source. Halo masses of the source from top to bottom: $4 \\times 10^{11}$, $2 \\times 10^{11}$, $10^{11}$, $8 \\times 10^{10}$, $6 \\times 10^{10}$, $4 \\times 10^{10}$, $2 \\times 10^{10}$, $10^{10}\\, \\rm{M_{\\odot}}$. The model by D14 is shown with filled blue regions, the top region corresponds to 10 Myr after the burst, the bottom region to 83 Myr after the burst) for the same stellar masses.}\n    \\label{fig:radiation_2}\n\\end{figure}\n\n\\indent In this section, we perform a systematic comparison between different models presented in the literature.  Analytical and semi-analytical studies have the advantage of investigating with ease the impact of physical processes.  \\citet{Ahn2008} show that the clustering of halos, which are the sources responsible for the photo-dissociating background, leads to local variations in the LW radiation intensity background. D14 uses a semi-analytical model to investigate the role of galactic outflows, which drive metal-enrichment in the surrounding of star-forming galaxies.  DCBH regions need to be close enough to star-forming galaxies in order to be illuminated by a high radiation intensity, whereas  the proximity with star-forming regions imply a potential metal-pollution by their galactic winds. \\citet{Agarwal2012SAM} and \\citet{Habouzit15} use a hybrid model where they ``paint\" galaxies on dark matter only simulations, so that the clustering of halos is naturally taken into account. \n\nConversely, hydrodynamical simulations have the advantage of tracking the cosmic evolution of  metal-enrichment and star formation in a more self-consistent way, where semi-analytical models need to use approximations.  However, simulations cannot resolve large and small scales at the same time:  small scale simulations allow one to follow the physical processes accurately but suffer from poor statistics (especially considering that the probability of having a DCBH is $10^{-6}$, based on the analytical estimates), while large scale simulations provide statistics but do not capture physical details/processes. For instance, \\citet{LatifXray2015} use zoomed simulations of single halos to investigate different values of $\\rm{J_{LW,crit}}$. A14 use a high resolution simulation with a size of 4 cMpc to estimate the density number of DCBHs. Our work covers the scale of A14, and larger scales up to 142 cMpc box size length, at degrading resolution.\n\nWe start by comparing different models for the radiation intensity coming from star-forming regions, D14 versus A14, and then move on to the probability for halos to have a given stellar mass, the probability of being star-forming, and the probability of being metal-free.\\\\\n\\noindent In D14, the stellar mass of a dark matter halo $M_{\\rm{halo}}$ is assigned as:\n\n", "itemtype": "equation", "pos": 29993, "prevtext": "\n\\noindent in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, with $\\rm{r}$ the distance between the source and the region where we compute the radiation and $\\rm{m}$ the mass of the star. In the following, $\\rm{J_{LW, crit}}$ refers to the critical value of $\\rm{J_{LW,local,II}}$ in units of $10^{-21}\\, \\rm{erg \\, s^{-1}\\, cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$, which we simplify in $\\rm{J_{LW}}$.  In this study, as we will consider radiation intensity thresholds much above the background level, we do not include the background component to the radiation intensity, which would be negligible compared to the spatially varying component. We have also not included radiation produced by Pop~III stars, as their contribution to DCBH formation is highly subdominant compared to the Pop~II population (see A12 and A14). In this work, we do not include self-shielding by molecular hydrogen, self-shielding of halos could decrease the number density of DCBH regions we find in the following sections. \n\nThe critical value required for DCBH depends of the spectrum of the stellar population, \\citet{Wolcott2011} argue a $\\rm{J_{LW, crit}}=1000$ for a Pop III population, \\citet{Shang2010} show that the critical value ranges in $J\\rm{_{LW, crit}}=30-300$ for a Pop II population. A strong radiation is needed in order to not only dissociate the molecular hydrogen in the outer parts of the halo, but also in the center. The critical values cited just above are thought to be sufficient to bring the molecular fraction down to $10^{-8}$ in 1D simulations. We consider a critical value of the radiation intensity of either $\\rm{J_{LW, crit}}=30$ \\citep{Agarwal2012SAM, Agarwal2014}, $\\rm{J_{LW, crit}}=100$ or $\\rm{J_{LW, crit}}=300$. These values are lower compared to those required by high-resolution 3-D cosmological simulations \\citep{Regan2014,Latif2014ApJ,Latif2015a}, which require $\\rm{J_{LW, crit}}>500-1000$. Inclusion of X-rays also increases the critical flux \\citep{2015MNRAS.450.4350I}, but the net effect is still unclear \\citep{LatifXray2015}. It will be clear in the following that if we were to consider such values we would not form any DCBH in our volumes. Therefore, what we obtain is an upper limit to the number of DCBHs.\n\n\n\\section{Impact of SN feedback on metallicity and star formation}\n\n\n\\begin{figure}\n\\centering\n   \\includegraphics[width=6.8cm]{comp_metallicity_stellar_mass_median_1sigma.pdf}\n\\caption{Top panel: Median of the average metallicity of halos in the two Chunky simulations, at redshift $z=7.33$, binned in mass. Bottom panel: median stellar mass enclosed in a sphere with a radius of 350 ckpc around halos (solid lines, red for the simulation with the delayed cooling SN feedback and yellow for the thermal SN feedback). Dashed lines include only stellar mass in young stars (age $\\leqslant  5$~Myr). Shaded areas extend to the $1\\sigma$ values. The spread in the metallicity, as well as in the stellar mass, is due to very isolated halos. thermal feedback decreases the probability of having DCBH regions because the number of halos polluted by metals is higher, but it also favors it because the amount of radiation produced by young stars is higher.}\n\\label{fig:met_stars}\n\\end{figure}\n\nMetals are created by stars and spread by SN explosions. Therefore SN feedback implementation has a strong impact on the metal-enrichment of the intergalactic medium, and on the number density of BH seeds formed. SN feedback also regulates star formation, therefore modulates the formation of the young stars that can provide Lyman-Werner radiation. \n\nThe simulation Tiny allows us to resolve the detailed expansion of the metal-enriched bubbles, but the size of the simulation (1 cMpc) is  too small to see, statistically, the impact of SN metal enrichment on the number density of DCBHs. We use Chunky, a simulation with a side length 10 times larger (10 cMpc), to study metal enrichment and star formation rate for a significant volume of the Universe. We have run two identical simulations where only the prescription for the SN feedback is different, as described in Section 2.6. The thermal SN feedback is weaker, compared to delayed cooling. In fact, the total mass in stars in the box is about one order of magnitude larger for the thermal feedback case, at all redshifts. \n\nThe direct collapse scenario depends on two main quantities: the metallicity of the halo, and the radiation intensity it is exposed to, which in turn depends on the mass in nearby young stars ($<5$ Myr). We compare these two quantities for the two SN feedbacks in Fig.~\\ref{fig:met_stars}. We calculate a halo mean metallicity averaging over all the gas leaf cells enclosed in its virial radius, and show the median of these mean metallicity values for all the halos in the two Chunky simulations, with solid lines in Fig.~\\ref{fig:met_stars} (top panel). The shaded areas represent the $1\\sigma$ values of halos metallicity. Thermal feedback leads to a higher metal enrichment. This is simply due to the larger stellar mass formed when adopting the SN thermal feedback, as evident from the bottom panel of Fig.~\\ref{fig:met_stars}, which represents the median stellar mass in the neighborhood of halos (solid lines), in a sphere with a 350 ckpc radius. This median stellar mass is larger with the thermal feedback.  The stellar mass in young stars ($\\leqslant 5$ Myr), which contribute at a given redshift to the LW radiation, is shown as dashed lines and follows the same trend.\n\nIt is difficult to predict the global effect of SN feedback on the number density of DCBHs in a cosmological box because metal enrichment and the amount of  stellar mass in young stars have opposite effects.  Regarding the former, delayed cooling SN feedback is more favourable to the formation of DCBHs - more halos are metal-poor and therefore eligible for DCBH formation-, regarding  the latter, it is the thermal SN feedback implementation that has the advantage - halos are illuminated by stronger radiation because there are more young stars at any given time.\n\n\n\\section{Number density of direct collapse regions in Chunky}\n\n\\begin{figure}\n\\centering\n   \\includegraphics[width=9cm]{comp_evolution_out12_211.pdf}\n\\caption{ We compare one DCBH candidate halo in the simulation Chunky with the thermal supernova feedback (in orange) and the corresponding halo in the delayed cooling simulation (in red). Top panel:  stellar mass (solid lines),  stellar mass in young stars (dashed lines) in the neighborhood of the candidate (in a sphere of 350 ckpc radius). Bottom panel: the radiation intensity (dots) seen by the candidate halo for the two supernova feedbacks. The critical radiation intensity used in A12, $\\rm{J_{LW,crit}}=30$, is shown as a dashed grey line. Arrows represent the free-fall time used in D08. If a candidate is above the critical LW radiation for the full length of an arrow, it is retained. In this case the orange dot (thermal feedback) remains a candidate, the red dot (delayed cooling feedback) does not.}\n\\label{fig:comp_evolution}\n\\end{figure}\n\n\\begin{table}\n\\caption{Number of direct collapse regions in the simulation Chunky with thermal SN feedback, assuming that collapse requires either 10 Myr, or the full free-fall time of the halo. For reference in Chunky with delayed cooling SN feedback, the only case that gives one candidate, at $z=7.33$,  has $\\rm{J_{LW,crit}}=30$ and a collapse time of 10 Myr.}\n\\begin{center}\n\\begin{tabular}{lcccc}\n\\hline\n\\hline\nCriteria & $z=10.1$ & $9.00$ & $8.09$ & $7.33$\\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$,  10 Myr & 1 & 3 & 6 & 17\\\\\n$\\rm{J_{LW,crit}}=30$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 3 \\\\\n$\\rm{J_{LW,crit}}=100$,  10 Myr & 0 & 0 & 1 & 3\\\\\n$\\rm{J_{LW,crit}}=100$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 0\\\\\n$\\rm{J_{LW,crit}}=300$,  10 Myr & 0 & 0 & 0 & 0 \\\\\n$\\rm{J_{LW,crit}}=300$,  $\\,t_{\\rm{Myr, ff}}$ & 0 & 0 & 0 & 0 \\\\\n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh}\n\\end{table}\n\nWe now turn to identifying the number of regions which are eligible for the direct collapse scenario. These regions must fulfill three criteria: they must be metal-poor, not forming stars, and be illuminated by a LW radiation intensity higher than the threshold $\\rm{J_{LW, crit}}=30$ (we take here the same value as in A12) during the whole time it takes for the collapse and DCBH formation. D08 use a free-fall time defined by:\n\n", "index": 9, "text": "\\begin{equation}\nt_{\\rm{Myr, ff}}\\sim 83 \\left( \\frac{1+z}{11}\\right)^{-3/2},\n\\label{eq:t_ff}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm{Myr,ff}}\\sim 83\\left(\\frac{1+z}{11}\\right)^{-3/2},\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mrow><mi>Myr</mi><mo>,</mo><mi>ff</mi></mrow></msub><mo>∼</mo><mrow><mn>83</mn><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mn>11</mn></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwhere $f_{\\rm{\\star}}=0.05$ is the fraction of gas which turns into stars, $M_{\\rm{halo,gas}}$ the gas mass of the halo,  $M_{\\rm{halo}}$ the total mass of the halo, $\\Omega_{\\rm{b}}$ the baryon density and $\\Omega_{\\rm{m}}$ the total matter density. \nThe mean production rate of LW photons per solar mass of star formation is time-dependent, where time is counted from the time $t_{\\rm{Myr}}$ when a burst of star formation occurs, and expressed as:\n\n", "itemtype": "equation", "pos": 47029, "prevtext": "\nwhich assumed $\\rho \\sim 200 \\times \\bar{\\rho}$.\nThis is the free-fall time at the virial radius. \\citet{Visbal14} argue instead that the relevant collapse time is that of the gas, on scales 10\\% of the virial radius, so that the collapse time should be $0.1\\times t_{\\rm{Myr, ff}}$. The length of the collapse in 3D high-resolution simulations of \\citet{Latif2015}, indeed lasts $\\sim$10~Myr. \nIn this study, we consider both the redshift-dependent collapse time, defined in Eq.~\\ref{eq:t_ff} (D14), and a collapse time of 10 Myr, which appears more realistic, according to recent simulation studies.\n\nWe give an example of our technique in the following. We show in Fig.~\\ref{fig:comp_evolution} one concrete example of a DCBH candidate halo, with a mass of $M_{\\rm{h}}=5.2 \\times 10^{8} M_{\\rm{\\odot}}$ at $z=7.33$: the top panel shows the evolution of the stellar mass in the environment of the halo, the total stellar mass is represented with solid lines, the stellar mass in young stars is shown with dashed lines. The corresponding radiation intensity is shown in the bottom panel with dots, the grey dashed line indicates the radiation intensity threshold of $\\rm{J_{LW,crit}}=30$. The simulation with thermal feedback is shown in orange, and the simulation with the delayed cooling feedback in red. Grey arrows give an idea of the free-fall time at that redshift, computed as in D08. \nWe see that when the stellar mass in young stars increases, the radiation intensity also increases, and when it decreases at redshift $z=6.6$, the radiation intensity also decreases. \n\nUsing this technique, only considering the radiation criterion, for the thermal SN feedback case, 17 regions are identified as potential DCBH sites, at $z=7.33$. The maximum value of the radiation intensity at that redshift is $\\rm{J_{LW}}=162.72$. Then we look back in time using merger trees made with TreeMaker \\citep{Tweed09}, in order to check if these candidates have been illuminated by a sufficiently high radiation intensity for at least one collapse time, and how the intensity varies over time. We find that only 4 of the candidates are illuminated by a radiation intensity above the critical value for at least one collapse time, and therefore are still flagged as DCBH candidates. \nFinally we check the metallicity of the candidates, and find that only one region is not polluted by metals, and 2 regions are partially polluted, which leads to a number density $\\rm{n_{DCBH}} \\leqslant 3 \\times 10^{-3} \\rm{cMpc^{-3}}$. Zero candidates are found for $\\rm{J_{LW,crit}}=100$ and $\\rm{J_{LW,crit}}=300$.\n\nIn the previous paragraph, we adopted as collapse time the free-fall time of the halo, defined by Eq.~\\ref{eq:t_ff}. However, if we now use a collapse time of 10 Myr, as suggested by \\citet{Visbal14},  for the same $\\rm{J_{LW, crit}}=30$, we find: 1 halo at $z=10.1$ with  $Z <10^{-3.5} \\,\\rm{Z_{\\odot}}$, 3 regions at $z=9.00$ (all with $Z=0$), 6 regions at $z=8.09$ (3 regions with $Z=0$, and 3 regions with $Z <10^{-3.5} \\,\\rm{Z_{\\odot}}$), 17 regions at $z=7.33$  (7 regions with $Z=0$, and 10 regions with $Z <10^{-3.5}\\, \\rm{Z_{\\odot}}$). All the regions are in halos with $M_{\\rm{h}}>10^{8} \\, \\rm{M_{\\odot}}$.  With a radiation intensity threshold of $\\rm{J_{LW,crit}}=100$, the numbers decrease  to 1 at $8.09$, and 3 at $z=7.33$, no DCBH halo is found at $z=10.1$ or $z=9.00$. Zero candidates are found for $\\rm{J_{LW,crit}}=300$.\n\nWe repeat the same exercise for the simulation with delayed cooling SN feedback, and find only one candidate for the DCBH process, for the case with $\\rm{J_{LW, crit}}=30$, and assuming a collapse time of 10~Myr. No candidates are found in the other cases. The maximum radiation intensity is $\\rm{J_{LW}}=30.33$. In conclusion, the  lower stellar mass in young stars in the delayed cooling simulation directly impacts the direct collapse scenario, by strongly decreasing the number of regions illuminated by a sufficient radiation intensity, and therefore decreasing the number density of DCBHs. The total number density of direct collapse candidates we find in the two Chunky boxes is shown in Fig.~\\ref{fig:number_density}, orange symbols when using for the collapse time the free-fall time of the halo, violet symbols for a collapse time of 10 Myr, and the number of candidates is reported in Table~\\ref{comp_ndcbh}. As a note, no DCBH is found in Tiny, for any subset of criteria. Small simulation boxes only allow us to derive a number density of DCBH regions for $\\rm{J_{LW,crit}}=30$, which appears to be slightly lower than the values derived by D14, and even lower compared to A14. The differences between implementations causing these discrepancies are analysed and discussed in Section 7.  \n\n\n\\section{Horizon-noAGN simulation: Can direct collapse explain the BHs powering $z=6$ quasars?}\n\n\\begin{figure*}\n\\centering\n   \\includegraphics[width=\\textwidth]{number_density_all_mel_6.pdf}\n\\caption{Number density of halos that can host a DCBH. In grey we show the number density from previous studies. Symbols represent different radiation intensity thresholds. Squares:  $\\rm{J_{LW,crit}}=30$, circles:  $\\rm{J_{LW,crit}}=100$, triangles:  $\\rm{J_{LW,crit}}=300$, stars:  $\\rm{J_{LW,crit}}=30$ without considering the metal-pollution from galactic winds coming from star-forming regions. The light grey square is from A14 (post-processing of a hydrodynamical simulation), dark grey are the results of D14 (analytical). Light grey stars are from \\citet{Habouzit15}.  The orange square shows the number density for Chunky  (10 cMpc side box), for the thermal SN feedback (0 regions are identified in the simulation employing the delayed cooling SN feedback). The blue squares,  circle and triangle represent the large-scale cosmological simulation Horizon-noAGN (142 cMpc side box). }\n \\label{fig:number_density}\n\\end{figure*}\n\nWe now turn to exploring the number density of BHs in the Horizon-noAGN simulation. This simulation allows us to look at  DCBH formation without being biased by the feedback of pre-existing BHs, compared to the sister simulation, Horizon-AGN, which includes BH accretion and feedback. The main advantage of the simulation is that the large box (142 cMpc side length) allows some statistics, at the expense of spatial and mass resolution.  We use the same method as for the set of Chunky simulations to compute the radiation intensity illuminating halos. \n\nWe first flag all halos illuminated by a radiation intensity higher than $\\rm{J_{LW,crit}}=30$. We identify 8 regions at redshift $z=9.83$, and 814 regions at $z=7.31$. Since we are trying to estimate whether DCBHs can explain the number density of $z>6$ quasars, we do not need to proceed to lower redshift (the next available output is at $z=5.87$). This simulation includes a metallicity floor, therefore we rescaled the metallicity accordingly. Halos with a mean metallicity lower than $10^{-3.5}\\rm{Z_{\\odot}}$ are kept as DCBH candidates. We are left with 2 regions at redshift $z=9.83$, 373 regions at $z=7.31$. \nFor a radiation intensity of  $\\rm{J_{LW,crit}}=100$  we identify 2 regions at redshift $z=9.83$ and 153 at $z=7.31$.  Including the metallicity criterion ($Z  \\leqslant 10^{-3.5} Z_{\\rm{\\odot}}$), there are 0 regions at redshift $z=9.83$, and 42  at $z=7.31$. \nFor a radiation threshold of $\\rm{J_ {LW,crit}}=300$ we identify 1 region at redshift $z=9.83$ and 13 regions at $z=7.31$.  Including the metallicity criterion, we find 0 regions at redshift $z=9.83$, 2 regions at $z=7.31$ ($Z  \\leqslant 10^{-3.5} Z_{\\rm{\\odot}}$), and no region at $z=9.83$. See Table 2 for a summary. Metallicity appears to be a key parameter in the direct collapse scenario, reducing significantly the number of DCBH candidates (up to 25 \\% at $z=9.83$, 45 \\% at $z=7.31$). \n\n\\begin{table}\n\\caption{Number of direct collapse regions in the simulation Horizon-noAGN.}\n\\begin{center}\n\\begin{tabular}{lcc}\n\\hline\n\\hline\nCriteria & $z=9.83$ & $z=7.31$ \\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$ & 8 & 814\\\\\n$\\rm{J_{LW,crit}}=30$,  $Z \\leqslant10^{-3.5}  Z_{\\rm{\\odot}}$ & 2 & 373 \\\\\n$\\rm{J_{LW,crit}}=100$ & 2 & 153 \\\\\n $\\rm{J_{LW,crit}}=100$,  $Z \\leqslant10^{-3.5} Z_{\\rm{\\odot}}$ & 0 & 42 \\\\\n$\\rm{J_{LW,crit}}=300$ & 1 & 13 \\\\\n$\\rm{J_{LW,crit}}=300$,  $Z \\leqslant10^{-3.5}  Z_{\\rm{\\odot}}$ & 0 & 2 \\\\\n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh2}\n\\end{table}\n\nIt is important to notice here that the time-scale between two outputs in the simulation are larger than the collapse time, either the free-fall time or 10 Myr. Therefore we are missing the time criterion of the direct collapse here: some of the candidates identified could be polluted by metals before the full collapse time has elapsed and therefore before unable to form the DCBH. The radiation intensity could also vary and not be enough to sustain molecular hydrogen dissociation for the full collapse time. Another important caveat is the resolution of the simulation, $\\rm{\\Delta x=1 kpc}$ and $\\rm{M_{DM,res}=8 \\times 10^{7} {\\,{\\rm M_\\odot}}}$, which does not allow us to capture the first metal-enrichment of halos, simply because we do not resolve small halos. Rather than the quantitative numbers, Horizon-noAGN allows us to explore trends in a statistical sense. \n\nFig.~\\ref{fig:number_density} shows the number density obtained for the simulation Chunky (in orange, and violet) and Horizon-noAGN (in light blue). \nAll the grey symbols represent previous studies: the light grey square is for A14, dark grey squares for D14, both for $\\rm{J_{LW,crit}}=30$, dark grey circles are for D14 and $\\rm{J_{LW,crit}}=300$, dark grey triangles for D14 and $\\rm{J_{LW,crit}}=300$.\\\\\n\nIn Horizon-noAGN, considering the metallicity threshold $Z \\leqslant10^{-3.5} \\, Z_{\\rm{\\odot}}$, we find $n_{\\rm{DCBH}} \\simeq 10^{-7} \\, \\rm{cMpc^{-3}}$ at $z=9.83$, and $n_{\\rm{DCBH}} \\simeq 10^{-4}\\, \\rm{cMpc^{-3}}$ at $z=7.31$ (blue squares in Fig.~\\ref{fig:number_density}), for $\\rm{J_{LW,crit}}=30$. At $z=7.31$, for $\\rm{J_{LW,crit}}=100$,  we find $n_{\\rm{DCBH}} \\simeq 10^{-5}\\, \\rm{cMpc^{-3}}$ (blue circle in Fig.~\\ref{fig:number_density}), and $n_{\\rm{DCBH}} \\simeq 10^{-6}\\, \\rm{cMpc^{-3}}$ for $\\rm{J_{LW,crit}}=300$ (blue triangle in Fig.~\\ref{fig:number_density}).\n\nFor Horizon-noAGN, our attempt was to see if the conditions on metallicity and on radiation intensity could be meet in more than few halos. Of course, with this simulation, we do not resolve small halos, nor the early metal-enrichment, but it gives us a first picture of the feasibility of the direct collapse scenario on a cosmological scale. For $\\rm{J_{LW,crit}}=30$, we again find a number density smaller than D14, and A14. However, for the highest thresholds, $\\rm{J_{LW,crit}}=100$, $\\rm{J_{LW,crit}}=300$, the number density of DCBH regions are very similar to those found by D14.\n\nFinally, we investigate the probability for massive halos at $z\\sim6$ to be seeded by a DCBH. A massive halo at $z\\sim6$, will host a DCBH if at least one of its progenitors was a DCBH region (namely metal-poor halos, illuminated by a strong photo-dissociating radiation intensity).  \nWe start by selecting all the most massive halos in the simulation Horizon-noAGN at $z=5.8$, namely the 552 halos with $\\rm{M_{h}}\\geqslant10^{11}\\, \\rm{M_{\\odot}}$. We build the merger history of all these halos with TreeMaker \\citep{Tweed09}, with the two previous snapshots of the simulation, at $z=7.3$ and $z=9.8$. We compute the mean metallicity of all the progenitors of massive halos at $z=5.8$, and the photo-dissociating radiation they are illuminated by.\nOf the 552 halos with $\\rm{M_{h}}>=10^{11}\\, \\rm{M_{\\odot}}$ at $z=5.8$, 155 have at least one DCBH progenitor at $z=7.3$, illuminated by a radiation with an intensity higher than $\\rm{J_{LW,crit}=30}$ and with a metallicity $\\rm{Z}<10^{-3.5} \\, \\rm{Z_{\\odot}}$. We do not identify any DCBH progenitor at $z=9.8$. Therefore the fraction of massive halos which can host a DCBH is 155/552=0.28, so 28\\% of the massive halos. When considering a radiation intensity threshold of  $\\rm{J_{LW,crit}=100}$, only 6.5\\% of the massive halos can host a DCBH, and it drops to 0.36\\% for $\\rm{J_{LW,crit}=300}$.\n\nIn summary, about a third of the most massive halos at $z=6$ have at least one progenitor reaching both the criterion on metallicity ($\\rm{Z}<10^{-3.5} \\, \\rm{Z_{\\odot}}$) and the criterion on radiation intensity ($\\rm{J_{LW,crit}=30}$). However, this fraction drops significantly down to $\\sim 6\\%$ for $\\rm{J_{LW,crit}=100}$, and even more, down to less than 1\\% for a more realistic value of $\\rm{J_{LW,crit}=300}$.\n\n\\begin{table}\n\\caption{Percentage of massive halos with at least one DCBH progenitor, in the simulation Horizon-noAGN.}\n\\begin{center}\n\\begin{tabular}{lc}\n\\hline\n\\hline\nCriteria & $\\rm{Z} \\leqslant10^{-3.5}$ \\\\%& $\\rm{Z} \\leqslant10^{-5}$ \\\\\n\\hline\n$\\rm{J_{LW,crit}}=30$ & 28\\% \\\\%& 28\\%\\\\\n$\\rm{J_{LW,crit}}=100$ & 6.5\\% \\\\%& 6.3\\% \\\\\n$\\rm{J_{LW,crit}}=300$ & 0.36\\% \\\\%& 0.18\\% \\\\ \n\\hline\n\\end {tabular}\n\\end{center}\n\\label{comp_ndcbh3}\n\\end{table}\n\n\n\\section{Comparison between hydro-dynamical simulations and (semi-)analytical models}\n\\begin{figure}\n   \\includegraphics[scale=0.4]{dijkstra_2014_radiation.pdf}\n   \\caption{Radiation intensity (in $\\rm{J_{LW}}$ units) provided by a source at a given distance (in proper kpc) for different sources mass at $z=10$ (halo masses of the source from top to bottom: $4 \\times 10^{11}$, $2 \\times 10^{11}$, $10^{11}$, $8 \\times 10^{10}$, $6 \\times 10^{10}$, $4 \\times 10^{10}$, $2 \\times 10^{10}$, $10^{10} \\,\\rm{M_{\\odot}}$), 10 Myr after the star formation burst (left panel), and 83 Myr after the burst (right panel) using the model by  D14.}\n   \\label{fig:radiation_1}\n\\end{figure}\n\n\\begin{figure}\n   \\includegraphics[scale=0.42]{dijkstra_2014_radiation_agarwal.png}\n    \\caption{Radiation intensity (in $\\rm{J_{LW}}$ units) provided by a source at a given distance (in pkpc) for different sources mass, at $z=10$.  The colored curves (colors as in Fig.~\\ref{fig:radiation_1}) show the radiation intensity based on A14, considering a stellar population PopIII (left) or PopII (right) as the radiation source. Halo masses of the source from top to bottom: $4 \\times 10^{11}$, $2 \\times 10^{11}$, $10^{11}$, $8 \\times 10^{10}$, $6 \\times 10^{10}$, $4 \\times 10^{10}$, $2 \\times 10^{10}$, $10^{10}\\, \\rm{M_{\\odot}}$. The model by D14 is shown with filled blue regions, the top region corresponds to 10 Myr after the burst, the bottom region to 83 Myr after the burst) for the same stellar masses.}\n    \\label{fig:radiation_2}\n\\end{figure}\n\n\\indent In this section, we perform a systematic comparison between different models presented in the literature.  Analytical and semi-analytical studies have the advantage of investigating with ease the impact of physical processes.  \\citet{Ahn2008} show that the clustering of halos, which are the sources responsible for the photo-dissociating background, leads to local variations in the LW radiation intensity background. D14 uses a semi-analytical model to investigate the role of galactic outflows, which drive metal-enrichment in the surrounding of star-forming galaxies.  DCBH regions need to be close enough to star-forming galaxies in order to be illuminated by a high radiation intensity, whereas  the proximity with star-forming regions imply a potential metal-pollution by their galactic winds. \\citet{Agarwal2012SAM} and \\citet{Habouzit15} use a hybrid model where they ``paint\" galaxies on dark matter only simulations, so that the clustering of halos is naturally taken into account. \n\nConversely, hydrodynamical simulations have the advantage of tracking the cosmic evolution of  metal-enrichment and star formation in a more self-consistent way, where semi-analytical models need to use approximations.  However, simulations cannot resolve large and small scales at the same time:  small scale simulations allow one to follow the physical processes accurately but suffer from poor statistics (especially considering that the probability of having a DCBH is $10^{-6}$, based on the analytical estimates), while large scale simulations provide statistics but do not capture physical details/processes. For instance, \\citet{LatifXray2015} use zoomed simulations of single halos to investigate different values of $\\rm{J_{LW,crit}}$. A14 use a high resolution simulation with a size of 4 cMpc to estimate the density number of DCBHs. Our work covers the scale of A14, and larger scales up to 142 cMpc box size length, at degrading resolution.\n\nWe start by comparing different models for the radiation intensity coming from star-forming regions, D14 versus A14, and then move on to the probability for halos to have a given stellar mass, the probability of being star-forming, and the probability of being metal-free.\\\\\n\\noindent In D14, the stellar mass of a dark matter halo $M_{\\rm{halo}}$ is assigned as:\n\n", "index": 11, "text": "\\begin{equation}\nM_{\\rm{\\star}}=f_{\\rm{\\star}} M_{\\rm{halo,gas}} = f_{\\rm{\\star}} \\frac{\\Omega_{\\rm{b}}}{\\Omega{\\rm{m}}} M_{\\rm{halo}},\n\\label{eq:mstar}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm{\\star}}=f_{\\rm{\\star}}M_{\\rm{halo,gas}}=f_{\\rm{\\star}}\\frac{\\Omega_{\\rm%&#10;{b}}}{\\Omega{\\rm{m}}}M_{\\rm{halo}},\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mo>⋆</mo></msub><mo>=</mo><mrow><msub><mi>f</mi><mo>⋆</mo></msub><mo>⁢</mo><msub><mi>M</mi><mrow><mi>halo</mi><mo>,</mo><mi>gas</mi></mrow></msub></mrow><mo>=</mo><mrow><msub><mi>f</mi><mo>⋆</mo></msub><mo>⁢</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">b</mi></msub><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mi mathvariant=\"normal\">m</mi></mrow></mfrac><mo>⁢</mo><msub><mi>M</mi><mi>halo</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwith $Q_{0}=10^{47}\\,\\rm{s^{-1}} \\, \\rm{M_{\\odot}^{-1}} $.\n\nThe mean LW photon production rate is computed one free-fall time after the star formation burst (Eq.~\\ref{eq:t_ff}). D14 motivate this choice by the requirement that molecular hydrogen is suppressed throughout the collapse.  The expression of $Q_{\\rm{LW}}$ is a fit from STARBURST99 (which used a Salpeter IMF in the range $m_{\\rm{low}},m_{\\rm{up}}=1,100\\,  \\rm{M}_{\\rm{\\odot}}$, an absolute metallicity of $Z=10^{-3}$ (0.05 $\\rm{Z_{\\odot}}$), and a stellar mass of $10^{5} \\,\\rm{M}_{\\rm{\\odot}} $).\nThe mean LW luminosity density $\\left< L_{\\rm{LW}}(M,t) \\right>$ is a function of the mean number of LW photons (given by the mean production rate of LW photons per solar masses times the stellar mass of the halo), their energy and the escape fraction of these photons. \n", "itemtype": "equation", "pos": 47648, "prevtext": "\nwhere $f_{\\rm{\\star}}=0.05$ is the fraction of gas which turns into stars, $M_{\\rm{halo,gas}}$ the gas mass of the halo,  $M_{\\rm{halo}}$ the total mass of the halo, $\\Omega_{\\rm{b}}$ the baryon density and $\\Omega_{\\rm{m}}$ the total matter density. \nThe mean production rate of LW photons per solar mass of star formation is time-dependent, where time is counted from the time $t_{\\rm{Myr}}$ when a burst of star formation occurs, and expressed as:\n\n", "index": 13, "text": "\\begin{equation}\n\\left<Q_{\\rm{LW}} (t) \\right>= Q_{\\rm{0}} \\left(1+\\frac{t_{\\rm{Myr}}}{4}\\right)^{-3/2} \\exp\\left({-\\frac{t_{\\rm{Myr}}}{300}}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\left&lt;Q_{\\rm{LW}}(t)\\right&gt;=Q_{\\rm{0}}\\left(1+\\frac{t_{\\rm{Myr}}}{4}\\right)^{-%&#10;3/2}\\exp\\left({-\\frac{t_{\\rm{Myr}}}{300}}\\right)\" display=\"block\"><mrow><mrow><mo>⟨</mo><mrow><msub><mi>Q</mi><mi>LW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>=</mo><mrow><msub><mi>Q</mi><mn>0</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><msub><mi>t</mi><mi>Myr</mi></msub><mn>4</mn></mfrac></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msub><mi>t</mi><mi>Myr</mi></msub><mn>300</mn></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nWe assume $f_{\\rm{esc}}=1$ in this study to be able to compare with the fiducial model of D14, however $f_{\\rm{esc}}<1$ is more likely, and would depend on halo mass and stellar feedback (using hydrodynamical zoom-in simulations of high-redshift halos, \\citet{Kimm14} find $f_{\\rm{esc}}\\sim 10-20 \\%$ at the epoch of reionization).\\\\\nThe flux at a distance $r$ then becomes:\n\n\n", "itemtype": "equation", "pos": 48643, "prevtext": "\nwith $Q_{0}=10^{47}\\,\\rm{s^{-1}} \\, \\rm{M_{\\odot}^{-1}} $.\n\nThe mean LW photon production rate is computed one free-fall time after the star formation burst (Eq.~\\ref{eq:t_ff}). D14 motivate this choice by the requirement that molecular hydrogen is suppressed throughout the collapse.  The expression of $Q_{\\rm{LW}}$ is a fit from STARBURST99 (which used a Salpeter IMF in the range $m_{\\rm{low}},m_{\\rm{up}}=1,100\\,  \\rm{M}_{\\rm{\\odot}}$, an absolute metallicity of $Z=10^{-3}$ (0.05 $\\rm{Z_{\\odot}}$), and a stellar mass of $10^{5} \\,\\rm{M}_{\\rm{\\odot}} $).\nThe mean LW luminosity density $\\left< L_{\\rm{LW}}(M,t) \\right>$ is a function of the mean number of LW photons (given by the mean production rate of LW photons per solar masses times the stellar mass of the halo), their energy and the escape fraction of these photons. \n", "index": 15, "text": "\\begin{equation}\n\\left< L_{\\rm{LW}}(M,t) \\right>=\\frac{h \\left< \\nu \\right>}{\\Delta \\nu } \\left<Q_{\\rm{LW}} (t) \\right> f_{\\rm{esc,LW}} \\left( \\frac{M_{\\rm{\\star}}}{M_{\\rm{\\odot}}} \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\left&lt;L_{\\rm{LW}}(M,t)\\right&gt;=\\frac{h\\left&lt;\\nu\\right&gt;}{\\Delta\\nu}\\left&lt;Q_{\\rm{%&#10;LW}}(t)\\right&gt;f_{\\rm{esc,LW}}\\left(\\frac{M_{\\rm{\\star}}}{M_{\\rm{\\odot}}}\\right).\" display=\"block\"><mrow><mrow><mrow><mo>⟨</mo><mrow><msub><mi>L</mi><mi>LW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>=</mo><mrow><mfrac><mrow><mi>h</mi><mo>⁢</mo><mrow><mo>⟨</mo><mi>ν</mi><mo>⟩</mo></mrow></mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>⟨</mo><mrow><msub><mi>Q</mi><mi>LW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>⁢</mo><msub><mi>f</mi><mrow><mi>esc</mi><mo>,</mo><mi>LW</mi></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mo>⋆</mo></msub><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwhere the first factor $1/4\\pi$ is needed to express $\\left< J_{\\rm{LW}}(r,M,t_{\\rm{ff}}) \\right>$ in $\\rm{J_{LW}}$ units ($\\rm{erg \\, s^{-1} \\,cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$).\n $ f_{\\rm{mod}}(r)$ is used to correct the radiation intensity for the extra dimming introduced by the LW horizon \\citep{Ahn2008}:\n\n  \n", "itemtype": "equation", "pos": 49224, "prevtext": "\nWe assume $f_{\\rm{esc}}=1$ in this study to be able to compare with the fiducial model of D14, however $f_{\\rm{esc}}<1$ is more likely, and would depend on halo mass and stellar feedback (using hydrodynamical zoom-in simulations of high-redshift halos, \\citet{Kimm14} find $f_{\\rm{esc}}\\sim 10-20 \\%$ at the epoch of reionization).\\\\\nThe flux at a distance $r$ then becomes:\n\n\n", "index": 17, "text": "\\begin{equation}\n\\left< J_{\\rm{LW}}(r,M,t_{\\rm{ff}}) \\right> = \\frac{1}{4 \\pi} \\frac{\\left< L_{\\rm{LW}}(M,t) \\right>}{4 \\pi r^{2}} f_{\\rm{mod}}(r),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\left&lt;J_{\\rm{LW}}(r,M,t_{\\rm{ff}})\\right&gt;=\\frac{1}{4\\pi}\\frac{\\left&lt;L_{\\rm{LW}%&#10;}(M,t)\\right&gt;}{4\\pi r^{2}}f_{\\rm{mod}}(r),\" display=\"block\"><mrow><mrow><mrow><mo>⟨</mo><mrow><msub><mi>J</mi><mi>LW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo>,</mo><mi>M</mi><mo>,</mo><msub><mi>t</mi><mi>ff</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mo>⟨</mo><mrow><msub><mi>L</mi><mi>LW</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><msub><mi>f</mi><mi>mod</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\n\n\\noindent In Fig. ~\\ref{fig:radiation_1} we show the intensity (y axis in units of $\\rm{J_{LW}}$) of the radiation coming from a source at a given distance for  different stellar masses of the source. In the left panel, we consider the radiation emitted 10 Myr after the star formation burst, while in the right one we use one free-fall time after the burst ($\\sim$83 Myr at redshift z=10), as in D14.   In Fig. ~\\ref{fig:radiation_2}, the radiation intensity computed using the model of D14 is shown in blue shades for 10 Myr or 83 Myr, and is compared to the model of  A14 for the same stellar masses as in Fig.~\\ref{fig:radiation_1}. Sources are considered either as Pop III stars (left panel in Fig. ~\\ref{fig:radiation_2}), or PopII stars (right panel). We find that the model of  A14, considering the source either as a population of PopIII or PopII stars, roughly corresponds to the model of D14 for 10 Myr after the star formation burst, but overestimate D14 for a free-fall time (as computed with Eq.~\\ref{eq:t_ff}). \n\nWe then  compare another quantity, the stellar mass per halo. D14 use a linear relation (Eq.~\\ref{eq:mstar}) that overestimates the stellar mass compared to our hydrodynamical simulation. We compare the stellar mass of all halos in the Chunky simulation at $z=9$ to the theoretical stellar mass derived with D14 formalism. On average the masses of D14 are a factor $\\sim 70$  larger than those in Chunky (albeit with a large scatter). On the other hand, in D14, the probability for a halo to be star-forming is set  at $\\rm P_{SF}=0.1$, i.e., 10 \\% of halos experience a starburst at the same given time, and contribute to the radiation intensity seen by all the other halos. This probability has a strong impact on the number density of DCBH regions, as a higher star-forming probability implies a higher radiation intensity seen by the neighboring halos. In our simulation, we define a halo as star-forming if young stars ($\\leqslant 5$ Myr) are found within its virial radius.  The fraction of star-forming halos we find in Chunky is always higher than 10\\%. Depending on the SN feedback model used, the fraction is between 20 and 35\\% for the delayed cooling model, and between 25 and 45\\% in the thermal feedback model.  \n\n\\begin{figure}\n\\centering\n   \n   \n   \n   \\includegraphics[scale=0.4]{SN_out10.png}\n   \\includegraphics[scale=0.4]{SN_out11.png}\n   \\includegraphics[scale=0.4]{SN_out12.png}\n\\caption{Contour plot representing the metallicity (log10 of the absolute metallicity) around the SN explosion in the simulation Tiny at redshift $z=$10.11, 9.00,  8.09 (top to bottom). The black circle marks the analytical estimate by D14.}\n\\label{fig:tiny_SN}\n\\end{figure}\n\n\n\nFinally, we compare the expansion of metal-polluted bubbles in the analytical framework and in simulations, using our highest resolution simulation, Tiny, which has a spatial resolution of 7.6~pc and a dark matter mass resolution of $\\sim 2000 {\\,{\\rm M_\\odot}}$.  Fig.~\\ref{fig:tiny_SN} shows the evolution of one SN bubble over three different snapshots, corresponding respectively to  $z=$10.11, 9.00, 8.09. Overlaid the metallicity contours from the simulation is the analytical estimate by D14: \n\n", "itemtype": "equation", "pos": 49697, "prevtext": "\nwhere the first factor $1/4\\pi$ is needed to express $\\left< J_{\\rm{LW}}(r,M,t_{\\rm{ff}}) \\right>$ in $\\rm{J_{LW}}$ units ($\\rm{erg \\, s^{-1} \\,cm^{-2}\\, Hz^{-1}\\, sr^{-1}}$).\n $ f_{\\rm{mod}}(r)$ is used to correct the radiation intensity for the extra dimming introduced by the LW horizon \\citep{Ahn2008}:\n\n  \n", "index": 19, "text": "\\begin{align}\nf_{\\rm{mod}} (r)&=  1.7 \\exp\\left(-\\left(\\frac{r_{cMpc}}{116.29\\, \\alpha}\\right)^{0.68}\\right)-0.7 &&  \\rm{if}~ r_{\\rm{cMpc}}/\\alpha \\le 97.39\\\\\n&=  0 &&   \\rm{otherwise}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle f_{\\rm{mod}}(r)\" display=\"inline\"><mrow><msub><mi>f</mi><mi>mod</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=1.7\\exp\\left(-\\left(\\frac{r_{cMpc}}{116.29\\,\\alpha}\\right)^{0.68%&#10;}\\right)-0.7\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mn>1.7</mn><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mrow><mpadded width=\"+1.7pt\"><mn>116.29</mn></mpadded><mo>⁢</mo><mi>α</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mn>0.68</mn></msup></mrow><mo>)</mo></mrow></mrow></mrow><mo>-</mo><mn>0.7</mn></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\rm{if}\\leavevmode\\nobreak\\ r_{\\rm{cMpc}}/\\alpha\\leq 97.39\" display=\"inline\"><mrow><mrow><mrow><mpadded width=\"+5pt\"><mi>if</mi></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">r</mi><mi>cMpc</mi></msub></mrow><mo>/</mo><mi>α</mi></mrow><mo>≤</mo><mn>97.39</mn></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=0\" display=\"inline\"><mrow><mi/><mo>=</mo><mn>0</mn></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\rm{otherwise}.\" display=\"inline\"><mrow><mi>otherwise</mi><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00557.tex", "nexttext": "\nwhere $n$ is gas  60 times denser than the mean intergalactic value at redshift z, i.e. $n\\sim 60 \\times \\Omega_b\\,\\rho_{\\rm crit} (1+z)^3/m_p$. The expansion of the metal-polluted bubble is faster in the hydrodynamical simulation, implying that D14 underestimates the size of polluted regions compared to us. However, the bubble becomes quickly highly asymmetric, therefore the geometry of the halo-halo configuration becomes of importance. \n\nIn summary, D14 overestimates the stellar mass, but underestimate the galaxies that can contribute radiation and the extent of metal polluted regions. The net effect is that the effects almost compensate, and explain why our results using hydrodynamical simulations are very close to the results of D14. \n\n\n\\section{Conclusions}\nIn this paper, we have addressed the formation of supermassive BHs by the direct collapse scenario. Isothermal collapse is predicted to happen in halos with minimum mass of $\\sim 10^{7}-10^{8}\\, {\\,{\\rm M_\\odot}}$ that have reached the atomic cooling threshold. To avoid the fragmentation of the gas, all the efficient coolants, namely metals and molecular hydrogen, must be absent. \nThe destruction and the prevention of molecular hydrogen can be done by a strong photo-dissociating radiation coming from nearby star-forming galaxies.\nA large inflow rate of gas at the center of the halo, higher than 0.1 ${\\,{\\rm M_\\odot}}$/yr for at least one free-fall time, is required in order to form a supermassive star-like object. \n\nThe feasibility of the direct collapse mechanism is difficult to investigate. Zoom-in simulations investigate the collapse and the accretion properties \\citep[e.g.,][]{Latif2013,Regan2014,2015MNRAS.452.1233H}, but use an artificial radiation intensity. Larger scale simulations, such as Chunky or FiBY (the simulation used for A14), instead model the spatially varying radiation intensity but are not able to follow the collapse, the accretion rate in the inner part of the halo, neither to model individually the radiation coming from each star. Employing small hydrodynamical simulation boxes has the advantage of resolving in detail different aspects of the problem (chemistry, mini-halos, early metal-enrichment, for example), but fails to present a large diversity of cosmological regions, biasing the derived number density of DC regions. \n\nIn this paper, we use three sizes of simulation box, from a small box of 1 cMpc side length, a medium box of 10 cMpc with a set of two simulations, and a large simulation box of 142 cMpc. We model the radiation intensity coming from nearby star-forming galaxies in a similar way as D14 and A14. Our attempt was to estimate the number density of regions eligible to host a DCBH, based on the absence of efficient coolants criterion: a high enough radiation intensity to destroy molecular hydrogen and a low metallicity. The idea was not to capture all the physical processes at the same time in the same simulation, but to have a larger picture of the direct collapse scenario by using, for the first time, a suite of large scale hydrodynamical simulations. Another aim was to see if some halos were illuminated by a sufficiently high radiation intensity ($\\rm{J_{LW,crit}}=100, 300$), more similar to what is obtained as critical value for collapse in 3D zoom-in simulations. \n\nWe investigated the impact of SN feedback. We use either a weaker thermal feedback or a stronger delayed cooling feedback. Star formation is lower (by one order of magnitude) in the simulation with delayed cooling SN feedback, and more in line with the predictions of halo occupation distribution (Habouzit et  al. in prep.). A weak SN feedback allows for more young stars, but also, consequently, for an earlier metal pollution.  Using our DCBH finder code (with $t_{\\rm{ff}}$ as in D14 and $J_{\\rm{LW,crit}}=30$), we do not find any DCBH regions in the simulation Chunky with the delayed cooling feedback, however we do find 3 regions for the thermal SN feedback. The absence of a strong radiation field, caused by the lower star formation rate, therefore, appears to be more important than metal pollution. Besides, in these 10 cMpc side box, we do not find any halo illuminated by a radiation intensity higher than $162.71$ in $\\rm{J_{LW}}$ units, down to $z=7.33$, so no DCBH can form if $\\rm{J_{LW,crit}} \\gg 100$. For the delayed cooling SN feedback, the maximum value of the radiation intensity is only $\\rm{J_{LW}}=30.33$.\n\nThe simulation Horizon-noAGN allows us to have a more global view of the direct collapse scenario. The simulation box is large enough to have some statistics (box side length of 142 cMpc), at the price of a lower resolution, and it includes a relatively weak SN feedback. The number density of DCBH regions in this simulation varies from $7 \\times 10^{-7}$ to $10^{-4} \\, \\rm{cMpc^{-3}}$. We find similar results as D14, specifically for the two largest thresholds $\\rm{J_{LW,crit}}=100$ and $\\rm{J_{LW,crit}}=300$.\nHowever, the number density of BHs for the threshold $\\rm{J_{LW,crit}}=30$ for the Horizon-noAGN simulation is smaller than what D14 and A14 obtained for the same threshold. We do not consider a radiation background, and this can have an impact when considering low intensity thresholds such as $\\rm{J_{LW,crit}}=30$. Horizon-noAGN  also allows us to investigate whether the DC scenario can explain the presence of BHs in massive galaxies at $z=6$, considered as proxies for the hosts of quasars. We find that 30\\% of the halos more massive than $10^{11} {\\,{\\rm M_\\odot}}$ at $z=5.8$, have at least one progenitor eligible to form a DCBH for $\\rm{J_{LW,crit}}=30$. This probability, however, drops abruptly below 1-10\\% when considering higher thresholds ($\\rm{J_{LW,crit}}=100, 300$) for the radiation intensity. \n\nSeveral approaches have been used in the last few years to determine the number density of direct collapse regions, from post-processing of hydrodynamical simulations to semi-analytical methods. These approaches derive number density which differ by several orders of magnitude (from $10^{-1}$ to $10^{-9}$ $\\rm{Mpc^{-3}}$).  We perform a comparison between some of these approaches, specifically with A14 and D14, in order to understand this discrepancy. We find differences in the probability for halos to be star-forming and metal-free, for the propagation of metals in the gas, and finally in the modeling of the radiation intensity itself, which in some cases compensate to produce similar results in the number density, despite the very different single assumptions. \n\nIn summary, we find that if DC requires $\\rm{J_{LW,crit}}=300$, and a halo must be illuminated by such intense field for its full collapse, the number of DCBHs may be sufficient to explain the number of high-z quasars, based on Horizon-noAGN, but not the presence of BHs in normal galaxies. If instead either $\\rm{J_{LW,crit}} \\sim 30$ or a halo must be illuminated only during the collapse of the central region, then DCBHs may be common also in normal galaxies, provided that SN feedback is not very strong. \n\n\n \\section*{Acknowledgments}\nThe research leading to these results has received funding from the European Research Council under the European Community's Seventh Framework Programme (FP7/2007-2013 Grant Agreement no. 614199, project ``BLACK'').  This work was granted access to the HPC resources of TGCC under the allocations x2014046955, x2015046955 and c2015047012 made by GENCI. We thank St\\'ephane Rouberoul for smoothly running the horizon cluster in IAP, where the post-processing of the simulations has been done.\n\n\\bibliography{biblio,biblio_complete}\n\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 53104, "prevtext": "\n\n\\noindent In Fig. ~\\ref{fig:radiation_1} we show the intensity (y axis in units of $\\rm{J_{LW}}$) of the radiation coming from a source at a given distance for  different stellar masses of the source. In the left panel, we consider the radiation emitted 10 Myr after the star formation burst, while in the right one we use one free-fall time after the burst ($\\sim$83 Myr at redshift z=10), as in D14.   In Fig. ~\\ref{fig:radiation_2}, the radiation intensity computed using the model of D14 is shown in blue shades for 10 Myr or 83 Myr, and is compared to the model of  A14 for the same stellar masses as in Fig.~\\ref{fig:radiation_1}. Sources are considered either as Pop III stars (left panel in Fig. ~\\ref{fig:radiation_2}), or PopII stars (right panel). We find that the model of  A14, considering the source either as a population of PopIII or PopII stars, roughly corresponds to the model of D14 for 10 Myr after the star formation burst, but overestimate D14 for a free-fall time (as computed with Eq.~\\ref{eq:t_ff}). \n\nWe then  compare another quantity, the stellar mass per halo. D14 use a linear relation (Eq.~\\ref{eq:mstar}) that overestimates the stellar mass compared to our hydrodynamical simulation. We compare the stellar mass of all halos in the Chunky simulation at $z=9$ to the theoretical stellar mass derived with D14 formalism. On average the masses of D14 are a factor $\\sim 70$  larger than those in Chunky (albeit with a large scatter). On the other hand, in D14, the probability for a halo to be star-forming is set  at $\\rm P_{SF}=0.1$, i.e., 10 \\% of halos experience a starburst at the same given time, and contribute to the radiation intensity seen by all the other halos. This probability has a strong impact on the number density of DCBH regions, as a higher star-forming probability implies a higher radiation intensity seen by the neighboring halos. In our simulation, we define a halo as star-forming if young stars ($\\leqslant 5$ Myr) are found within its virial radius.  The fraction of star-forming halos we find in Chunky is always higher than 10\\%. Depending on the SN feedback model used, the fraction is between 20 and 35\\% for the delayed cooling model, and between 25 and 45\\% in the thermal feedback model.  \n\n\\begin{figure}\n\\centering\n   \n   \n   \n   \\includegraphics[scale=0.4]{SN_out10.png}\n   \\includegraphics[scale=0.4]{SN_out11.png}\n   \\includegraphics[scale=0.4]{SN_out12.png}\n\\caption{Contour plot representing the metallicity (log10 of the absolute metallicity) around the SN explosion in the simulation Tiny at redshift $z=$10.11, 9.00,  8.09 (top to bottom). The black circle marks the analytical estimate by D14.}\n\\label{fig:tiny_SN}\n\\end{figure}\n\n\n\nFinally, we compare the expansion of metal-polluted bubbles in the analytical framework and in simulations, using our highest resolution simulation, Tiny, which has a spatial resolution of 7.6~pc and a dark matter mass resolution of $\\sim 2000 {\\,{\\rm M_\\odot}}$.  Fig.~\\ref{fig:tiny_SN} shows the evolution of one SN bubble over three different snapshots, corresponding respectively to  $z=$10.11, 9.00, 8.09. Overlaid the metallicity contours from the simulation is the analytical estimate by D14: \n\n", "index": 21, "text": "\\begin{equation}\nr_{\\rm bubble}=3\\times 10^{-2} \\, \\rm{kpc} \\left(\\frac{M_\\star}{M_\\odot} \\right)^{1/5} n^{-1/5} \\left( \\frac{t}{\\rm Myr} \\right)^{2/5},\n\\label{eq:eqbubble}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"r_{\\rm bubble}=3\\times 10^{-2}\\,\\rm{kpc}\\left(\\frac{M_{\\star}}{M_{\\odot}}%&#10;\\right)^{1/5}n^{-1/5}\\left(\\frac{t}{\\rm Myr}\\right)^{2/5},\" display=\"block\"><mrow><mrow><msub><mi>r</mi><mi>bubble</mi></msub><mo>=</mo><mrow><mrow><mn>3</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>2</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><mi>kpc</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">M</mi><mo>⋆</mo></msub><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>5</mn></mrow></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">n</mi><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>5</mn></mrow></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi mathvariant=\"normal\">t</mi><mi>Myr</mi></mfrac><mo>)</mo></mrow><mrow><mn>2</mn><mo>/</mo><mn>5</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]