[{"file": "1601.05182.tex", "nexttext": "\n\n\n\nThis analytic function is empirical but consistent with realistic disk emission in several aspects.  It insures that $I(\\theta)$ goes to zero at infinity. Further, the amplitudes of components associated with unsampled high spatial frequency go to zero quickly, meaning no fine structure information is added.  Because real disk emission never becomes negative, the amplitude of V$(\\rho)$ should gradually decay with spatial frequency.   Thus, adding new visibility data with higher spatial frequency coverage will not change the known structures in $I(\\theta)$ drastically.  This approach is suitable for $I(\\theta)$ functions without hard edges and its utility is supported by the fact that no harmonic features associated with sharply truncated disks are found in the four disks. As the largest recoverable spatial scale (determined by the shortest baseline) is significantly larger than the disk emission, the total flux recovered from the analytic function is conserved. \n\nAfter initial fitting, we find that HD 163296 and DM Tau show a flux decrement inside $\\sim$ 20\\,AU.  To investigate if including a sharp inner edge would change the derived disk structures, we run additional models for the two disks, by adding two extra free parameters to simulate an inner cavity --- a sharp inner edge R$_{\\rm cav}$ and a depletion factor $\\delta$ ($0\\le\\delta\\le1$). We assume the source intensity is flat inside the cavity since fine structures inside 20\\,AU are unresolved. \n\n\nWe use the Levenberg-Marquardt $\\chi^2$ minimization algorithm to search for the optimal value of free parameters. The initial guesses of the \\{$\\rho_i$\\} are the centers of peaks in visibility profiles and values of \\{$a_i$\\} can be either positive or negative. The integral in eq.~(\\ref{eq:i_theta}) is solved using a step size of 0.1\\,AU from 400\\,AU. \n\n\n\\begin{figure*}[htbp]\n\\vspace{-0.4cm}\n\n \\includegraphics[width=7.5in]{f2.eps}\n\n\n\\caption{HL Tau as an example of  the model fitting approach. Panels (a) and (b) show how the derived surface intensity profile $I(\\theta)$ changes when visibilities from larger $uv$-distances are included. The functions $V_2$, $V_3$ and $V_4$ in (a) correspond to the number of Gaussian functions in the model fitting, and the three vertical dashed lines in (b) highlight the centers of three major disk gaps reported by \\citealt{Partnership15}. (c) A comparison of the surface brightness derived from fitting the $\\rho<$2000{\\,${\\rm k\\lambda}$~} visibilities and that resulting from a CLEANed image using all $\\rho<$12000{\\,${\\rm k\\lambda}$~} data. }\n\\label{fig:example}\n\n\\vspace{-0.15cm}\n\\end{figure*}\n\n\n\n Using HL Tau as an example, Figure~\\ref{fig:example}\\,(a-b) show how including more visibilities changes the derived radial intensity distribution.  In particular, by fitting only two Gaussians out to 500\\,k$\\lambda$, we find a broad gap around 60\\,AU. Extending the data to 1000\\,k$\\lambda$ then demands fits with three Gaussians, and a second but narrower gap is found around 30\\,AU. When we include data within 2000\\,k$\\lambda$, an innermost gap is seen at $\\sim$13\\,AU.  \n\n\\subsection{Image approach}\n\nHere we obtain radial intensity profiles from the CLEANed images directly. \nThe visibilities are deprojected using eqs. (1-2), and deconvolved through the CLEAN algorithm using uniform weighting, and restored with a synthesized Gaussian beam. We then derive an azimuthally averaged $I(\\theta)$ from the images. An illustrative comparison of radial intensity profiles of HL Tau is plotted in Figure~2(c).  Clearly, the three major gaps (13, 32 and 63\\,AU) are reproduced nicely by the model fitting approach using the $\\rho\\le 2000$\\,k$\\lambda$ data, as compared with the $I(\\theta)$ derived from a CLEANed image based on visibilities of $\\rho_{\\rm max}\\sim12000$\\,k$\\lambda$. \n\n\n\\subsection{Results}\n\nThe retrieved radial intensity distributions of the four disks from both the image and modeling fitting approaches are presented in Figure~3. Consistent results are found over larger scales, but (as expected by the HL Tau example) the modeling fitting results clearly show more detailed structures. The continuum emission from all four disks is rich in radial structures with a typical length scale of 10-30\\,AU.  For TW Hya, both approaches show that the 349 and 661\\,GHz emission has a turning point in the slope around 25\\,AU, followed by a plateau and then a gradual decay out to $\\sim$70\\,AU.  \\citet{Nomura15} recently reported similar structures in the 336\\,GHz continuum emission of TW Hya.  For HL Tau, its known major gaps at 13, 32 and 63\\,AU are well recovered. HD 163296 and DM Tau are two disks that show signs of central flux decrement in our modeling (see also DM Tau in Andrews et al. 2011). For these two, we show the best fitting results of two analytical models: (1) a smooth disk (no sharp inner edge), and (2) a disk with a sharp inner edge (R$_{\\rm cav}$, $\\delta$). Both types of models retrieve consistent structures beyond $\\sim$ 30\\,AU -- HD 163296 has two depressed zones centered near 55 and 100\\,AU, and  DM Tau has a shallowly depressed emission zone around 70\\,AU. The two depressed zones in HD 163296 are also noticeable in its synthesized image along the beam minor axis. The two types of models give slightly different structures in the central region of HD 163296 and DM Tau, but both suggest that the central regions are probably just shallowly depleted. It is likely that there are unresolved emission from the central regions and the flux decrement is possibly due to gaps rather a central cavity.  \n\nIt is important to note that our proposed solutions are consistent with the data but other disk structures may also be possible. This is a nature of deconvolution that the solution is not unique without a restrictive physical framework, a framework we currently lack in interpolating mm-sized particle distribution in disks. Under this condition, the simplest solutions are preferred.  Our proposed solutions belong to the the simplest group since they are the smoothest models that fit the data (least high spatial frequency components needed).\n\n\n\\begin{figure*}[t]\n\n\\hspace*{-0.25in}\n \\includegraphics[width=8.0in]{f3.eps}\n\n\\caption{Radial surface brightness profiles of the four disks, derived from modeling fitting (upper row) and synthesized images (bottom row). The results of each disk are derived from the same visibilities, except for HL Tau, for which the modeling fitting result uses visibilities with a maximum $uv$ distance that is much shorter than those used in the image ($\\rho_{\\rm max}\\sim2000$\\,k$\\lambda$ v.s. 11843\\,k$\\lambda$). For the modeling fitting results of HD 163296 and DM Tau, we show two $I(\\theta)$ profiles derived from a smooth model as well as a model with a sharply truncated central depletion zone.  The light blue regions highlight the expected mid-plane CO snowline region, including uncertainties.}\n\\label{fig:f_r}\n\n\n\\end{figure*}\n\n\n\\begin{figure*}[!htbp]\n\\vspace{0.4cm}\n\\hspace*{-0.25in}\n \\includegraphics[width=8in]{f4.eps}\n\\caption{Prediction of long-baseline ALMA images (at 0.\\arcsec035 resolution). The surface brightness distributions are based on our best model fitting of observed visibilities (Figure 3, top row). The intensity is normalized to the brightest pixel in each image. }\n\\label{fig:example}\n\\vspace{0.15cm}\n\\end{figure*}\n\n\\section{Discussion}\n\n\n\\subsection{Origin of disk structures}\n\nThe richness of small scale features in the surface brightness profiles shown in Figure~\\ref{fig:f_r} is striking. \nOne possibility is that they are results of pressure bumps in protoplanetary disks. Possible mechanisms proposed for generating pressure bumps include: zonal flows \\citep{Johansen09b, Simon12}, planet-disk interaction \\citep{Lyra09}, or a (water) snowline-induced jump in surface density/ionization degree \\citep{Kretke07}. \n\n\nOn the other hand, disk structures in (sub)mm continuum emission may also be produced by spatial variations in the dust opacity $\\kappa_\\nu(R)$.  For example, grain growth itself, will alter the dust opacity, and if localized, the change in opacity can mirror the effects of a change in the surface density profile.    As but one example of a local effect that dust growth near the water snowline from millimeter to decimeter-sized pebbles is possible on a timescale of only 1000 years \\citep{Ros13}.  \n\n\n\n\\subsection{Commonality of smooth disk structures}\nSo far, ALMA high spatial resolution observations have been only carried out for several well-studied classical T Tauri or Herbig star disks or transition systems (disks with a large central dust cavity). The majority of transition disks observed show some axi-asymmetry and sharp edges \\citep{vanderMarel15}.  The fraction of transition disks is estimated to be $\\sim$10-20\\% in nearby star-forming regions, based on the spectral energy distribution statistics  \\citep{Kim09, Merin10}; a greater fraction of $\\sim$ 30\\% \\citep{Andrews11} is given based on resolved sub-mm imaging. Nevertheless, current statistics indicates that disks with a large cavity ($>$20\\,AU) are probably not the majority of disks.\n\nThe four disks studied here perhaps provide a better match to the structure of the majority of disks, i.e.,  `full' disks or disks with small holes. One prediction from our sample is that circularly symmetric and smoothly varying structures with $\\sim$ 10-30\\,AU scale lengths are likely to be more common in disks in which the central cavity is either small or absent, as compared to structures such as the sharply truncated narrow rings or edges often seen in disks with a large central cavity.\n\n \n\n\\subsection{Correlation between CO snowlines and enhanced continuum emission}\n\n \nWith sufficient spatial resolution to resolve CO snowlines, current ALMA observations have enabled the first direct investigations of the role of condensation fronts in the evolution of solids in nearby protoplanetary disks. \n\nSo far, N$_2$H$^+$ cation and C$^{18}$O emission have been used as two independent tracers of the mid-plane CO snowline.  The two tracers show consistent results in TW Hya, where the mid-plane CO snowline is found to lie at 17--23~AU (\\citealt{Qi13}, Schwarz et al. submitted), and for HD 163296 where R$_{\\rm CO}$=90$^{+8}_{-6}$\\,AU (\\citealt{Qi15}). \nSince no similar observations are available for HL Tau and DM Tau, here we adopt CO snowline radii based on radiative transfer models of the two disks, which yield R$_{\\rm CO clatherate}$ = 63$\\pm$10\\,AU for HL Tau \\citep{Menshchikov99, Zhang15} and R$_{\\rm CO }$ = 70$\\pm$10\\,AU for DM Tau (Bergin, in prep).\n\n\nFigure~3 presents the mid-plane CO snowline locations on top of the surface brightness distributions in the four disks. The data suggest that there is possibly a relationship between the snowline location and enhancements in the continuum emission.\n \n\\subsection{Efficient selection of disk candidates for long baseline ALMA observations }\n\nThe HL Tau observations demonstrate that ALMA long baseline observations are critical to revealing structures within the nominal planet-forming disk radii ($<$30\\,AU). However,  a preliminary selection of sources is desired due to the long integration times and excellent atmospheric stability needed for long baseline observations. The modeling fitting analysis above shows that distinctive features at visibility profiles are useful predictors of fine structures in disks.  To search for 10\\,AU scale structures in disks of nearby star forming regions ($\\sim$140\\,pc),  we propose that an initial survey with $\\sim$ 2000{\\,${\\rm k\\lambda}$~} baseline (e.g. 2.6\\,km at 1.3\\,mm) should be sufficient to select sources with significant features in deprojected visibility profiles to then be imaged with full baseline (16\\,km) ALMA observations. In Figure\\,4, we show simulated long-baseline ALMA images  of our sample. The significant contrast in the HD 163296 image is induced by the visibility null near 450\\,k$\\lambda$. The structures proposed here can easily be confirmed or ruled out in long baseline observations, and similarly the potential association between CO snowlines and continuum emission enhancements.\n\n\n\n\\vspace{0.2in}\nThis work was supported by funding from the National Science Foundation, grants AST-1344133 (INSPIRE) and AST-1514670.\nThe authors thank John Monnier for discussions on model fitting approaches to visibility data. The National Radio Astronomy Observatory is a facility of the National Science\n Foundation operated under cooperative agreement by Associated Universities, Inc.\nThis paper makes use of the following ALMA data sets: ADS/JAO.ALMA\\#2011.0.00015.SV, ADS/JAO.ALMA\\#2013.1.00198.S \\& ADS/JAO.ALMA \\#2013.1.01268.S. ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada), NSC and ASIAA (Taiwan), and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. \n\n\n\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{ALMA Partnership} {et~al.}(2015){ALMA Partnership}, {Brogan},\n  {P{\\'e}rez}, \\& {Hunter}}]{Partnership15}\n{ALMA Partnership}, {Brogan}, C.~L., {P{\\'e}rez}, L.~M., \\& {Hunter}, e.~a.\n  2015, \\apjl, 808, L3\n\n\\bibitem[{{Andrews}(2015)}]{Andrews15}\n{Andrews}, S.~M. 2015, \\pasp, 127, 961\n\n\\bibitem[{{Andrews} {et~al.}(2011){Andrews}, {Wilner}, {Espaillat}, {Hughes},\n  {Dullemond}, {McClure}, {Qi}, \\& {Brown}}]{Andrews11}\n{Andrews}, S.~M., {Wilner}, D.~J., {Espaillat}, C., {et~al.} 2011, \\apj, 732,\n  42\n\n\\bibitem[{Birnstiel {et~al.}(2013)Birnstiel, Dullemond, \\&\n  Pinilla}]{Birnstie13}\nBirnstiel, T., Dullemond, C.~P., \\& Pinilla, P. 2013, \\aap, 550, L8\n\n\\bibitem[{Casassus {et~al.}(2013)Casassus, van~der Plas, M, Dent, Fomalont,\n  Hagelberg, Hales, Jord{\\'a}n, Mawet, M{\\'e}nard, Wootten, Wilner, Hughes,\n  Schreiber, Girard, Ercolano, Canovas, Rom{\\'a}n, \\& Salinas}]{Casassus13}\nCasassus, S., van~der Plas, G., M, S.~P., {et~al.} 2013, Nature, 493, 191\n\n\\bibitem[{{Chiang} \\& {Youdin}(2010)}]{Chiang10}\n{Chiang}, E., \\& {Youdin}, A.~N. 2010, Annual Review of Earth and Planetary\n  Sciences, 38, 493\n\n\\bibitem[{{Clark}(1980)}]{Clark80}\n{Clark}, B.~G. 1980, \\aap, 89, 377\n\n\\bibitem[{{Cornwell} {et~al.}(1999){Cornwell}, {Braun}, \\&\n  {Briggs}}]{Cornwell99}\n{Cornwell}, T., {Braun}, R., \\& {Briggs}, D.~S. 1999, in Astronomical Society\n  of the Pacific Conference Series, Vol. 180, Synthesis Imaging in Radio\n  Astronomy II, ed. G.~B. {Taylor}, C.~L. {Carilli}, \\& R.~A. {Perley}, 151\n\n\\bibitem[{{Dipierro} {et~al.}(2015){Dipierro}, {Price}, {Laibe}, {Hirsh},\n  {Cerioli}, \\& {Lodato}}]{Dipierro15}\n{Dipierro}, G., {Price}, D., {Laibe}, G., {et~al.} 2015, \\mnras, 453, L73\n\n\\bibitem[{{Dong} {et~al.}(2015){Dong}, {Zhu}, \\& {Whitney}}]{Dong15}\n{Dong}, R., {Zhu}, Z., \\& {Whitney}, B. 2015, \\apj, 809, 93\n\n\\bibitem[{{Goldreich} \\& {Ward}(1973)}]{Goldreich73}\n{Goldreich}, P., \\& {Ward}, W.~R. 1973, \\apj, 183, 1051\n\n\\bibitem[{{H{\\\"o}gbom}(1974)}]{Hogbom74}\n{H{\\\"o}gbom}, J.~A. 1974, \\aaps, 15, 417\n\n\\bibitem[{{Hughes} {et~al.}(2011){Hughes}, {Wilner}, {Andrews}, {Qi}, \\&\n  {Hogerheijde}}]{Hughes11}\n{Hughes}, A.~M., {Wilner}, D.~J., {Andrews}, S.~M., {Qi}, C., \\& {Hogerheijde},\n  M.~R. 2011, \\apj, 727, 85\n\n\\bibitem[{Isella {et~al.}(2013)Isella, P{\\'e}rez, Carpenter, Ricci, Andrews, \\&\n  Rosenfeld}]{Isella13}\nIsella, A., P{\\'e}rez, L.~M., Carpenter, J.~M., {et~al.} 2013, \\apj, 775, 30\n\n\\bibitem[{{Johansen} {et~al.}(2009{\\natexlab{a}}){Johansen}, {Youdin}, \\&\n  {Klahr}}]{Johansen09b}\n{Johansen}, A., {Youdin}, A., \\& {Klahr}, H. 2009{\\natexlab{a}}, \\apj, 697,\n  1269\n\n\\bibitem[{{Johansen} {et~al.}(2009{\\natexlab{b}}){Johansen}, {Youdin}, \\& {Mac\n  Low}}]{Johansen09}\n{Johansen}, A., {Youdin}, A., \\& {Mac Low}, M.-M. 2009{\\natexlab{b}}, \\apjl,\n  704, L75\n\n\\bibitem[{{Kim} {et~al.}(2009){Kim}, {Watson}, {Manoj}, {Furlan}, {Najita},\n  {Forrest}, {Sargent}, {Espaillat}, {Calvet}, {Luhman}, {McClure}, {Green}, \\&\n  {Harrold}}]{Kim09}\n{Kim}, K.~H., {Watson}, D.~M., {Manoj}, P., {et~al.} 2009, \\apj, 700, 1017\n\n\\bibitem[{{Kretke} \\& {Lin}(2007)}]{Kretke07}\n{Kretke}, K.~A., \\& {Lin}, D.~N.~C. 2007, \\apjl, 664, L55\n\n\\bibitem[{{Lyra} {et~al.}(2008){Lyra}, {Johansen}, {Klahr}, \\&\n  {Piskunov}}]{Lyra08}\n{Lyra}, W., {Johansen}, A., {Klahr}, H., \\& {Piskunov}, N. 2008, \\aap, 491, L41\n\n\\bibitem[{{Lyra} {et~al.}(2009){Lyra}, {Johansen}, {Klahr}, \\&\n  {Piskunov}}]{Lyra09}\n---. 2009, \\aap, 493, 1125\n\n\\bibitem[{{Men'shchikov} {et~al.}(1999){Men'shchikov}, {Henning}, \\&\n  {Fischer}}]{Menshchikov99}\n{Men'shchikov}, A.~B., {Henning}, T., \\& {Fischer}, O. 1999, \\apj, 519, 257\n\n\\bibitem[{{Mer{\\'{\\i}}n} {et~al.}(2010){Mer{\\'{\\i}}n}, {Brown}, {Oliveira},\n  {Herczeg}, {van Dishoeck}, {Bottinelli}, {Evans}, {Cieza}, {Spezzi},\n  {Alcal{\\'a}}, {Harvey}, {Blake}, {Bayo}, {Geers}, {Lahuis}, {Prusti},\n  {Augereau}, {Olofsson}, {Walter}, \\& {Chiu}}]{Merin10}\n{Mer{\\'{\\i}}n}, B., {Brown}, J.~M., {Oliveira}, I., {et~al.} 2010, \\apj, 718,\n  1200\n\n\\bibitem[{{Nomura} {et~al.}(2015){Nomura}, {Tsukagoshi}, {Kawabe}, {Ishimoto},\n  {Okuzumi}, {Muto}, {Kanagawa}, {Ida}, {Walsh}, {Millar}, \\& {Bai}}]{Nomura15}\n{Nomura}, H., {Tsukagoshi}, T., {Kawabe}, R., {et~al.} 2015, ArXiv e-prints,\n  arXiv:1512.05440\n\n\\bibitem[{{Okuzumi} {et~al.}(2015){Okuzumi}, {Momose}, {Sirono}, {Kobayashi},\n  \\& {Tanaka}}]{Okuzumi15}\n{Okuzumi}, S., {Momose}, M., {Sirono}, S.-i., {Kobayashi}, H., \\& {Tanaka}, H.\n  2015, ArXiv e-prints, arXiv:1510.03556\n\n\\bibitem[{{Pearson}(1999)}]{Pearson99}\n{Pearson}, T.~J. 1999, in Astronomical Society of the Pacific Conference\n  Series, Vol. 180, Synthesis Imaging in Radio Astronomy II, ed. G.~B.\n  {Taylor}, C.~L. {Carilli}, \\& R.~A. {Perley}, 335\n\n\\bibitem[{P{\\'e}rez {et~al.}(2014)P{\\'e}rez, Isella, Carpenter, \\&\n  Chandler}]{Perez14}\nP{\\'e}rez, L.~M., Isella, A., Carpenter, J.~M., \\& Chandler, C.~J. 2014, \\apjl,\n  783, L13\n\n\\bibitem[{{Pi{\\'e}tu} {et~al.}(2007){Pi{\\'e}tu}, {Dutrey}, \\&\n  {Guilloteau}}]{Pietu07}\n{Pi{\\'e}tu}, V., {Dutrey}, A., \\& {Guilloteau}, S. 2007, \\aap, 467, 163\n\n\\bibitem[{{Pinilla} {et~al.}(2012){Pinilla}, {Benisty}, \\&\n  {Birnstiel}}]{Pinilla12a}\n{Pinilla}, P., {Benisty}, M., \\& {Birnstiel}, T. 2012, \\aap, 545, A81\n\n\\bibitem[{{Pinte} {et~al.}(2016){Pinte}, {Dent}, {M{\\'e}nard}, {Hales}, {Hill},\n  {Cortes}, \\& {de Gregorio-Monsalvo}}]{Pinte16}\n{Pinte}, C., {Dent}, W.~R.~F., {M{\\'e}nard}, F., {et~al.} 2016, \\apj, 816, 25\n\n\\bibitem[{{Qi} {et~al.}(2015){Qi}, {{\\\"O}berg}, {Andrews}, \\& {Wilner}}]{Qi15}\n{Qi}, C., {{\\\"O}berg}, K.~I., {Andrews}, S.~M., \\& {Wilner}, D.~J. e.~a. 2015,\n  \\apj, 813, 128\n\n\\bibitem[{Qi {et~al.}(2004)Qi, Ho, Wilner, Takakuwa, Hirano, Ohashi, Bourke,\n  Zhang, Blake, Hogerheijde, Saito, Choi, \\& Yang}]{Qi04}\nQi, C., Ho, P. T.~P., Wilner, D.~J., {et~al.} 2004, \\apj, 616, L11\n\n\\bibitem[{{Qi} {et~al.}(2013){Qi}, {{\\\"O}berg}, {Wilner}, {D'Alessio},\n  {Bergin}, {Andrews}, {Blake}, {Hogerheijde}, \\& {van Dishoeck}}]{Qi13}\n{Qi}, C., {{\\\"O}berg}, K.~I., {Wilner}, D.~J., {et~al.} 2013, Science, 341, 630\n\n\\bibitem[{{Ros} \\& {Johansen}(2013)}]{Ros13}\n{Ros}, K., \\& {Johansen}, A. 2013, \\aap, 552, A137\n\n\\bibitem[{Rosenfeld {et~al.}(2013)Rosenfeld, Andrews, Hughes, Wilner, \\&\n  Qi}]{Rosenfeld13}\nRosenfeld, K.~A., Andrews, S.~M., Hughes, A.~M., Wilner, D.~J., \\& Qi, C. 2013,\n  \\apj, 774, 16\n\n\\bibitem[{{Simon} {et~al.}(2012){Simon}, {Beckwith}, \\& {Armitage}}]{Simon12}\n{Simon}, J.~B., {Beckwith}, K., \\& {Armitage}, P.~J. 2012, \\mnras, 422, 2685\n\n\\bibitem[{{van der Marel} {et~al.}(2015){van der Marel}, {van Dishoeck},\n  {Bruderer}, {P{\\'e}rez}, \\& {Isella}}]{vanderMarel15}\n{van der Marel}, N., {van Dishoeck}, E.~F., {Bruderer}, S., {P{\\'e}rez}, L., \\&\n  {Isella}, A. 2015, \\aap, 579, A106\n\n\\bibitem[{van~der Marel {et~al.}(2013)van~der Marel, van Dishoeck, Bruderer,\n  Birnstiel, Pinilla, Dullemond, van Kempen, Schmalzl, Brown, Herczeg, Mathews,\n  \\& Geers}]{vanderMarel13}\nvan~der Marel, N., van Dishoeck, E. F.~v., Bruderer, S., {et~al.} 2013,\n  Science, 340, 1199\n\n\\bibitem[{Weidenschilling(1997)}]{Weidenschilling97}\nWeidenschilling, S.~J. 1997, Icarus, 127, 290\n\n\\bibitem[{{Whipple}(1972)}]{Whipple72}\n{Whipple}, F.~L. 1972, in From Plasma to Planet, ed. A.~{Elvius}, 211\n\n\\bibitem[{{Zhang} {et~al.}(2015){Zhang}, {Blake}, \\& {Bergin}}]{Zhang15}\n{Zhang}, K., {Blake}, G.~A., \\& {Bergin}, E.~A. 2015, \\apjl, 806, L7\n\n\\bibitem[{{Zhang} {et~al.}(2014){Zhang}, {Isella}, {Carpenter}, \\&\n  {Blake}}]{Zhang14}\n{Zhang}, K., {Isella}, A., {Carpenter}, J.~M., \\& {Blake}, G.~A. 2014, \\apj,\n  791, 42\n\n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 14163, "prevtext": "\n\\title{ On the Commonality of 10-30\\,AU Sized Axisymmetric Dust Structures \\\\\n in  Protoplanetary Disks} \n\n\\author{Ke Zhang\\altaffilmark{1},   Edwin A. Bergin\\altaffilmark{1}, Geoffrey A. Blake\\altaffilmark{2},  L. Ilsedore  Cleeves\\altaffilmark{3},  Michiel Hogerheijde\\altaffilmark{4}, Vachail Salinas\\altaffilmark{4}, Kamber R. Schwarz\\altaffilmark{1}}\n\n\n\\altaffiltext{1}{Department of Astronomy, University of Michigan, 1085 S University Ave, Ann Arbor, MI 48109, USA; kezhang@umich.edu}\n\\altaffiltext{2}{Division of Geological \\& Planetary Sciences, MC 150-21, California Institute of Technology, Pasadena, CA 91125, USA}\n\\altaffiltext{3}{Harvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138, USA}\n\\altaffiltext{4}{Leiden Observatory, Leiden University, P.O. Box 9513, 2300 RA Leiden, The Netherlands}         \n\n  \\begin{abstract}\nAn unsolved problem in step-wise core-accretion planet formation is that rapid radial drift  in gas-rich protoplanetary disks should drive mm-/meter-sized particles inward to the central star before large bodies can form. One promising solution is to confine solids within small scale structures. Here we investigate dust structures in the (sub)mm continuum emission of four disks (TW Hya, HL Tau, HD 163296 and DM Tau), a sample of disks with the highest spatial resolution ALMA observations to date. We retrieve the surface brightness distributions using synthesized images and fitting visibilities with analytical functions. We find that the continuum emission of the four disks is $\\sim$axi-symmetric but rich in 10-30\\,AU-sized radial structures, possibly due to physical gaps, surface density enhancements or localized dust opacity variations within the disks. These results  suggest that small scale axi-symmetric dust structures are likely to be common, as a result of ubiquitous processes in disk evolution and planet formation. Compared with recent spatially resolved observations of CO snowlines in these same disks, all four systems show enhanced continuum emission from regions just beyond the CO condensation fronts, potentially suggesting a causal relationship between dust growth/trapping and snowlines.\n \\end{abstract}\n  \n \n  \n  \n   \\keywords{\n               stars: premain-sequence -- protoplanetary disks -- techniques: interferometric\n               }\n\n   \\maketitle\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\nIn the core-accretion planet formation scenario, planet formation starts with micron-sized interstellar medium grains grow into kilometer-sized planetesimals \\citep{Goldreich73} --\na size interval that poses great challenges since aggregates in this size range experience significant drag from the surrounding gas and thus drift toward the central star on extremely short timescales \\citep{Whipple72, Weidenschilling97}.\n One promising solution is to restrain particles in a confined area, such as a local pressure maximum in the disk \\citep{Lyra08, Johansen09, Pinilla12a, Birnstie13}.  \n\nContinuum emission at (sub)mm wavelengths provides the most direct constraints on spatial distribution of mm-sized dust grains in disks. Recent observations of some transition disks show large scale ($>$40\\,AU) radial and azimuthal inhomogeneities in continuum emission, providing direct evidence of dust trapping in disks \\citep[e.g.][]{Casassus13, vanderMarel13, Isella13, Perez14, Zhang14}. Such extreme inhomogeneities are commonly attributed to pressure bumps excited by giant planet(s) in the disk. However, this poses a chicken-egg dilemma on the planetesimal formation problem. Other mechanism(s) of dust trapping therefore need to be explored with higher spatial resolution observations in larger disk samples. \n\nThe Atacama Large Millimeter/Sub-milimeter Array (ALMA) recently \nimaged the HL Tau protoplanetary disk with a superb spatial resolution of $\\sim$ 5\\,AU, revealing a remarkable series of dark and bright concentric rings in the continuum emission \\citep{Partnership15}. The origin of these rings have been suggested to be gap opening(s) induced by embedded planets \\citep{Dipierro15, Pinte16, Dong15} or changes in the dust properties near condensation fronts of dominant ices and clathrates \\citep{Zhang15, Okuzumi15}. Searching for similar small scale structures in a population of disks is thus critical to study their origin and to ultimately gain an understanding of the planetesimal formation processes during gas-rich stages.\n\nHere we  investigate the commonality of 10-30\\,AU-sized dust structures in a modest sample of four protoplanetary disks with the highest spatial resolution (sub)mm continuum observations to date. \n\n\\section{Observations and Results}\n\\label{sec:obs}\nOur sample is composed of four protoplanetary disks:  TW Hya, DM Tau, HD 163296 and HL Tau. \nData on TW Hya and DM Tau  were acquired out as  part of  the ALMA cycle 2 project  2013.1.00198.S, and those on HD 163296 were obtained in project 2013.1.01268.S (Salinas et al., in prep). \nHere we mainly use the public data on HL Tau \\citep{Partnership15} as a test case for our data analysis methodology. A summary of observations is provided in Table 1. \n\n\n\\begin{deluxetable*}{cllllllll} [!htbp]\n\\tabletypesize{\\scriptsize}\n\n\\tablecaption{Observation log and source properties \\label{tab:logs}}\n\\tablewidth{0pt}\n\\tablehead{\n\\colhead{Source}&\\colhead{$\\nu_{\\rm rest}$}& \\colhead{$\\Delta\\nu$} &  \\colhead{$t_{\\rm int}$}        &\\colhead{Beam}    & \\colhead{Baseline}     &\\colhead{Flux} & \\colhead{Rms} &\\colhead{Obs date}\\\\\n\t \t\t  &\\colhead{(GHz)}          & \\colhead{(GHz)} \t   &\\colhead{(minute)} \t\t&\\colhead{(\\arcsec$\\times$\\arcsec (PA))} & \\colhead{(k$\\lambda$)}              &\\colhead{(mJy)} & \\colhead{(mJy beam$^{-1}$)}&\\colhead{} \n}\n\n\\startdata\nTW Hya\t&\t349\t&\t2.938\t&\t29.0\t&\t0.28$\\times$0.28 (-10)\t&\t25-913\t&\t1415\t&\t0.096\t&\t6/15/2015\t\\\\\n\t&\t661\t&\t1.875\t&\t39.9\t&\t0.35$\\times$0.20 (85)\t&\t33-931\t&\t5586\t&\t1.19\t&\t3/12/2014\t\\\\\nDM Tau\t&\t329\t&\t2.234\t&\t7.7\t&\t0.41$\\times$0.33(24.9)\t&\t24-861\t&\t191\t&\t0.191\t&\t6/14/2015\t\\\\\nHD 163296\t&\t233\t&\t2\t&\t154.5\t&\t0.38$\\times$0.27 (64.7)\t&\t19-638\t&\t710\t&\t0.017\t&\t7/27-29/2014\t\\\\\nHL Tau\t&\t233\t&\t8\t&\t280.2\t&\t0.035$\\times$0.022(11)\t&\t12-11843\t&\t744\t&\t0.01\t&\t10/24-31/2014\t\\\\ [0.1cm]\n\\hline\n\\hline \\[-0.25cm]\nSource     &  Distance &  $M_\\star$     & $L_\\star$        &  $\\dot{M}$    & incl     &PA &   R$_{\\rm CO}$ &  Ref\\[0.1cm]\n\t \t\t  &(pc)         & ($M_\\odot$/yr) &($L_\\odot$) \t&($M_\\odot/yr$) &(deg)    &(deg) &(AU)&\\[0.1cm]\n\\[-0.3cm] \\hline \\[-0.25cm]\nTW Hya\t&\t54\t&\t0.55\t&\t0.23\t&\t4$\\times$10$^{-10}$\t&\t7\t&\t355\t&\t17-23\t&\t1,2,3,4\t\\\\\nDM Tau\t&\t145\t&\t0.5\t&\t0.25\t&\t2$\\times$10$^{-9}$\t&\t35\t&\t155\t&\t70$\\pm$10\t&\t5,6\t\\\\\nHD 163296\t&\t122\t&\t2.3\t&\t27.2\t&\t7.6$\\times$10$^{-8}$\t&\t224\t&\t312\t&\t90$^{+8}_{-6}$\t&\t7,8\t\\\\\nHL Tau\t&\t145\t&\t1.3\t&\t---\t&\t1$\\times$10$^{-6}$\t&\t46.7\t&\t138\t&\t63$\\pm$10\t&\t9\t\t\t  \n\n\\enddata\n\\tablecomments{ References: 1.\\,\\citealt{Qi04}, 2.\\,\\citealt{Hughes11}, 3.\\,\\citealt{Qi13}, 4.\\,Schwarz et al. submitted, 5.\\,\\citealt{Pietu07}, 6.\\,Bergin et al. in prep, 7.\\,\\citealt{Rosenfeld13}, 8.\\,\\citealt{Qi15}, 9.\\,\\citealt{Partnership15} }\n\\end{deluxetable*}\n\n\n\n\nAll visibility data were calibrated in CASA (version 4.2) using scripts provided by the ALMA staff.   \nThe absolute uncertainty of the flux calibration is $\\sim$10\\%.\nWe performed iterative self-calibration on both the continuum emission phase and amplitude to reduce the atmospheric decoherence. \n\n\n\n\n\\label{sec:obs_results}\n\n\n\nFigure~1 presents the continuum visibility profiles from the four disks as a function of the deprojected baseline length.  The baselines are generally $\\sim$700\\,k$\\lambda$, except that those for HL Tau extend to $\\sim$12,000\\,k$\\lambda$.  All of our sources appear to be axi-symmetric in synthesized images, as also suggested by the flat distribution of their imaginary visibility components as a function of deprojected $uv$-distance. The most important feature in the visibility profiles is that they show a wide variety of structures.  TW Hya, for example, shows a bump around 290 and 250{\\,${\\rm k\\lambda}$~} at 349 and 661\\,GHz, respectively; while HD 163296 shows two bumps and a dip below zero. HL Tau has three main bumps and extensive fine structures out to the longest $uv$-distances. In contrast, DM Tau has a smooth decay and, like HD 163296, goes below zero around 400\\,k$\\lambda$. Since an interferometer acts as a spatial frequency filter, these visibility features can be used to reveal the detailed radial structures of the disks. \n\nWe stress that simple disk models widely used in the literature have difficulty in reproducing the visibility features observed here (Figure 1, f-i).  A  disk with a tapered outer edge does not bring any significant visibility features. That with a sharp outer edge (even those that decay over modest radial distances) does yield features in the visibility profile, but involves a series of bumps with similar width and that occur at harmonic spatial frequencies. \nAnother widely used model is a disk with a sharply truncated inner cavity. This model best fits disks that show {\\em significant} negative components in their visibility profiles, and has been successful in modeling many transition disks \\citep[e.g.][]{Andrews11, Zhang14, vanderMarel15}. This model, however, does not work well for the disk sample here. It yields negative components  that are too broad compared to the profiles of DM Tau and HD 163296. More specifically, the second nulls of the observed visibility profiles occur much closer to the first nulls than predicted. Furthermore, a cavity solution yields a visibility profile that monotonically decreases within the first null, while bumps are shown inside the first null in TW Hya and HL Tau. These discrepancies suggest that a sharp truncation alone cannot fit the data, and thus other structure elements are needed to explain the observations of the four disks. \n\n\\begin{figure*}[htbp]\n\\includegraphics[width=7.5in]{f1.eps}\n\\vspace{-0.6cm}\n\\caption{ Panel (a-e): Visibility profiles of continuum emission from TW Hya, HD 163296, DM Tau and HL Tau. The Real (black dots) and Imaginary (light blue diamonds) parts of the visibilities are plotted as a function of deprojected $uv$-distance, and the statistical errors are smaller than the size of symbols.  \nThe red lines are our best fitting models from Section 3. Panel (f,h): model surface density profiles for a disk at 140\\,pc; Panel (g, i):  visibility profiles of the simple disks models in (f,h).  The data of panel (a-e) are available for download from arXiv source. }\n\\label{fig:f_r}\n\\vspace{-0.15cm}\n\\end{figure*}\n\n\n\n\n\n\n\\section{Modeling}\n\n\n\n\nAs discussed above, the simplest physical models fail to characterize the observed visibility profiles. \nMore importantly, there is no coherent physical model available for the surface density profile of mm-sized particles, because it may differ significantly from that of a viscously evolving gas disk due to radial drift and various pressure trapping mechanisms \\citep{Chiang10, Andrews15}. Due to these uncertainties, we employ an empirical approach to characterize spatial structures in the surface brightness distributions and discuss the possible origin of the observed disk structures in Section 4.\n\n\\subsection{Deconvolution in interferometric observations} \n\nThe retrieval of  source intensity distributions from visibilities is essentially a deconvolution process, due to discrete sampling on the $uv$-plane. Critically,\nwithout prior information, the deconvolution has no unique solution because the fine structures in the source intensity distribution correspond to unsampled high spatial frequency components that can have a wide range of amplitudes \\citep{Cornwell99}. \n\n\nThe most widely used deconvolution method in heterodyne interferometry is the CLEAN algorithm \\citep{Hogbom74, Clark80},\nin which the final deconvolved image is a summation of a number of point sources convolved with a CLEAN beam (usually a Gaussian). This approach suppresses the highest spatial frequencies in the data and results in a smeared image. \n\nAnother common way to derive source intensity is the so-called \\textit{modeling fitting} approach \\citep{Pearson99}. Here, the observed visibilities are reproduced with a {\\em parametric} model of the source intensity distribution. Advantages of this method include the utilization of the full spatial frequency information in data and straightforward error estimation. A significant drawback is that the possible form of models that fit the data may not be unique. Thus the choice of a model function requires physical justification.\n\nHere we retrieve the radial surface brightness distributions of our disk sample using both the image (CLEAN) and model fitting approaches. \n\n\\subsection{Model fitting approach}\nFor circularly symmetric disk emission, the link between the deprojected $uv$-distance and radial brightness distribution is a Hankel transform \\citep{Pearson99}: \n\n\\begin{eqnarray}\n\\label{eq:hankel}\nu' &=& (u {\\rm cos}\\phi-v {\\rm sin}\\phi)\\times {\\rm cos}\\,i  \\\\\nv'& =&  u {\\rm sin}\\phi+v {\\rm cos}\\phi\\\\\nV (\\rho) &=& 2\\pi\\int_0^\\infty I_\\nu (\\theta) \\theta J_0(2\\pi\\rho \\theta) d\\theta,\n\\end{eqnarray}\n\n\\vspace{-0.25cm}\n\n\\noindent where $i$ and $\\phi$ are the disk inclination and position angle, $\\rho$=$\\sqrt{u'^2+v'^2}$ is the deprojected $uv$-distance in units of $\\lambda$, $\\theta$ is the radial angular scale from the disk center, and $J_0$ is a zeroth-order Bessel function of the first kind. \n\nHere we adopt an analytical function for $I(\\theta)$ that is inspired by the multi-peak features seen in the visibility profiles (Figure~1). A peak in visibility indicates that some spatial frequencies, corresponding to some particular spatial scales, have more contribution than other scales. Specifically, we model the disk surface intensity distribution $I(\\theta)$ with a group of Gaussian functions, each of which is modulated by a sinusoidal function with a spatial frequency of $\\rho_i$ (eq.~\\ref{eq:i_theta}).  The number of Gaussians is decided by the number of distinctive peaks in the visibility profile, and $\\{ a_0, \\sigma_0, a_i, \\sigma_i, \\rho_i$\\} are free parameters. \nThus, we choose\n\n\n", "index": 1, "text": "\\begin{multline}\n\n\\label{eq:i_theta}\nI(\\theta) = \\frac{a_0}{\\sqrt{2\\pi}\\sigma_0} exp \\left(-\\frac{\\theta^2}{2\\sigma_0^2}\\right) \\\\\n+\\sum_{i} {\\rm cos} (2\\pi\\theta \\rho_i)\\times \\frac{a_i}{\\sqrt{2\\pi}\\sigma_i} exp \\left(-\\frac{\\theta^2}{2\\sigma_i^2}\\right)\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\par&#10; I(\\theta)=\\frac{a_{0}}{\\sqrt{2\\pi}\\sigma_{0}}exp\\left(-%&#10;\\frac{\\theta^{2}}{2\\sigma_{0}^{2}}\\right)\\\\&#10;\\displaystyle+\\sum_{i}{\\rm cos}(2\\pi\\theta\\rho_{i})\\times\\frac{a_{i}}{\\sqrt{2%&#10;\\pi}\\sigma_{i}}exp\\left(-\\frac{\\theta^{2}}{2\\sigma_{i}^{2}}\\right)\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>a</mi><mn>0</mn></msub><mrow><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><mo>⁢</mo><msub><mi>σ</mi><mn>0</mn></msub></mrow></mfrac><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msup><mi>θ</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>σ</mi><mn>0</mn><mn>2</mn></msubsup></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mrow><mrow><mi>cos</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>θ</mi><mo>⁢</mo><msub><mi>ρ</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><mfrac><msub><mi>a</mi><mi>i</mi></msub><mrow><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><mo>⁢</mo><msub><mi>σ</mi><mi>i</mi></msub></mrow></mfrac></mrow><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msup><mi>θ</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>σ</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}]