[{"file": "1601.00834.tex", "nexttext": "\nwith $C$ the average capacity for a MISO configuration (bit/s), $W$ the frequency bandwidth (Hz), $h$ the fading coefficients of the channel, $N0$ the noise spectral density (dBm/Hz), $Nt$ the number of transmit antennas i.e. 2, $PL$ the path loss (dB), $P_{Total}$ the average total power (W) that is consumed by the system and where:\n \n", "itemtype": "equation", "pos": 34174, "prevtext": "\n\n\\conferenceinfo{HIP3ES, 2016}{January 18--20, 2016, Prague, Czech Republic}\n\n\n\n\n\n\n\n\\CopyrightYear{2016}\n\\doi{000.0000}\n\\isbn{000-0-0000-0000-0}\n\n\n\n\n\n\n\n\\title{Fast Power and Energy Efficiency Analysis of FPGA-based Wireless Base-band Processing}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\numberofauthors{1} \n\n\n\n\\author{\n\n\n\n\n\n\n\n\n\n\n\n\\alignauthor\nJordane Lorandel, Jean-Christophe Pr\\'evotet and Maryline H\\'elard\\\\ \n       \\affaddr{INSA of Rennes - Institute for Electronics and Telecommunications of Rennes}\\\\\n       \\affaddr{22 avenue des buttes de coesmes,Rennes, France}\\\\\n       \n       \\email{jordane.lorandel@insa-rennes.fr}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n}\n\n\n\n\n\n\n\n\n\n\n\n\n\\maketitle\n\\begin{abstract}\n\nNowadays, demands for high performance keep on increasing in the wireless communication domain. This leads to a consistent rise of the complexity and designing such systems has become a challenging task. In this context, energy efficiency is considered as a key topic, especially for embedded systems in which design space is often very constrained. \nIn this paper, a fast and accurate power estimation approach for FPGA-based hardware systems is applied to a typical wireless communication system. It aims at providing power estimates of complete systems prior to their implementations. This is made possible by using a dedicated library of high-level models that are representative of hardware IPs. Based on high-level simulations, design space exploration is made a lot faster and easier. The definition of a scenario and the monitoring of IP's time-activities facilitate the comparison of several domain-specific systems. The proposed approach and its benefits are demonstrated through a typical use case in the wireless communication domain.\n\\end{abstract}\n\n\n\n\n\n\n\n\n\n\\category{B.8}{Hardware}{Performance and reliability}[Performance Analysis and Design Aids, General]\\\\\n\\category{C.2.1}{Computer-Communication Networks}{Network Architecture and Design}[Wireless communication]\\\\\n\\category{C.3}{Special-Purpose and Application-based Systems}{Real-time and embedded systems}\\\\\n\n\n\n\\keywords{Design space exploration, embedded systems, energy efficiency, FPGA, modelling, SystemC-TLM, wireless communications }\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}  \\label{sec:intro}\n\nToday, mobile networks continuously evolve to deal with several issues such as the data traffic growth, the increasing number of user equipments, the multiplication of standards, etc. Authors in \\cite{Cisco15} show that almost half a billion (497 million) mobile devices and connections were introduced in 2014. It is also foreseen that global mobile data should have a compound annual growth rate of 57\\% from 2014 to 2019. This clearly underlines the need of perpetual evolution of all the actors dealing with mobile networks.\nThe processing capabilities of such systems will also drastically increase due to the perpetual demand for higher functionality and performance.\n\n\nFor the last decades, power has become one of the most important issue and has been the subject of numerous researches in the wireless communication field \\cite{Earth15,GreenTouch15,5Green15}. Achieving a high level of performance in terms of throughput or low latency, still constitutes a primary objective. \nDesign complexity and the time that is required to develop such systems drastically increase. It is of particular importance for designers to make early design choices to respect their power budget. Consequently, designers have to estimate power as soon as possible in the design process. \nMoreover, decisions that are taken very late in the design flow could lead to important additional costs and generally impose to rerun the design process from scratch.\n\n\nToday, Field Programmable Gate Array (FPGA) devices are widely used as solutions to implement complex designs such as wireless base-band processors. As compared to their ASIC (Application Specific Integrated Circuit) counterparts, which can achieve higher performance at a price of a long and expensive design development, FPGAs can be used for fast and low cost ASIC prototyping or as hardware accelerators for real-time applications. FPGA-based systems can be made of IP (Intellectual Property) which are hardware cores that enhance design reuse and speed-up development time. \n\nFPGAs can offer more flexibility than ASICs to the detriment of a higher silicon area, a decrease in performance and a higher power consumption \\cite{Kuon2007}. \n\n\n\n\\section{Positioning of the approach} \n\nFrom the FPGA description, it seems obvious that estimating power very fast in the design process is a primary objective. However, power estimation usually requires simulations that can be very time consuming depending on the level of abstraction. The higher the level is, the faster power results are obtained. Alternatively, although a good accuracy can be achieved at low-level, simulation times are often prohibitive.\nSince accuracy is decisive during design space exploration, designers generally consider a small set of accurate configuration patterns. They do not have enough time to test an exhaustive set of examples that could lead to a better design solution.\n\nAnother consideration is that there is a lack of methodologies and approaches that enable domain-specific systems comparison in terms of both power and performance in an efficient way. Indeed, system performance are usually evaluated at high-level whereas accurate power information is only available at lower levels when a hardware target is considered. In addition, several teams of designers are usually required from the system's specification to the real hardware implementation. As consequence, there is still a real gap to bridge between high-level and low-level that can be error prone.\n\n\nWireless communication systems are almost made of Power Amplifiers (PA), RF stages and base-band processing (BB). In such system, PA enable data transmission over the air. In fact, the power allocated for data transmission is usually considered as the most significant contributor in a wireless communication system. As a consequence, power consumptions that are related to BB and RF are usually neglected. \nHowever, it has been demonstrated that all power consumption sources have to be taken into account in a wireless system, especially the power consumption related to the base-band processing when low transmission powers are involved \\cite{EarthD2_3}. As an example, the power consumption of BB may represent around half of the total power consumption for a base station of a femto/home cell-environment in the LTE context. Such conclusions advocate an efficient evaluation of the BB power consumption. \n\n\n\n\nThe purpose of this paper is to present a power estimation approach for FPGA-based wireless communication systems. The detailed description of the methodology is not presented in this paper. \nWe rather demonstrate its benefits through a typical wireless communication system. The methodology deliberately focus on hardware designs without taking any software considerations into account. A key contribution consists in taking into account IP-time activities that directly evolve according to the application behaviour. We also demonstrate that power estimates can be thus refined, providing more accurate results than classic approaches. We have also noticed an important speed-up factor. \n\nThis paper is organized as follows: Section \\ref{sect_RW} presents the related works on high level power estimation. Section \\ref{sect_Meth} promotes the main contributions of the proposed methodology. Section \\ref{sect_usecase} provides the results that have been obtained by applying our methodology to a MISO-OFDM 2x1 system in the Long-Term Evolution context. Finally, we conclude and discuss about prospects in section \\ref{sect_conclu}.\n\n\n\n\n\\section{Related Works}\\label{sect_RW}\n\nEstimating power in FPGA devices has been the subject of various research studies. It has been noticed that power estimation techniques may be applied at different level of abstraction, which corresponds to the degree of details to describe a system. As shown in Fig. \\ref{Abstraction_Levels_label}, the lowest level of abstraction is the layout-level which corresponds to a bitstream model in a FPGA design flow.\nAt layout, gate and RTL levels, power estimation can be very accurate due to the prominence of physical and hardware details. However, power estimation can be really costly in time. It also forces designers to take decisions very late in the design flow, which may lead to expensive redesign costs if constraints are not met. Due to the growing complexity of current systems, it is obvious that low-level approaches are not suitable for fast power estimations.\nThe highest abstraction level is the system-level, in which the functionality of a system is modelled using specific languages and dedicated tools. At this level, implementation details are completely hidden or not available. Although the simulation time is highly reduced, power estimation accuracy is usually lower than using low-level approaches. Nevertheless, designers may explore design architectures very fast and make early decisive choices. This is especially true when the primary objective is the design of low-power systems \\cite{ITRS}.\nFor this reason, we deliberately focus our study on system-level power estimation tools and methodologies.\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.6,trim=0.5cm 0cm 0cm 0cm, clip=true]{Abstraction_Level_and_step_RSP.eps}  \n\\caption{Representation of the different abstraction levels from specification to FPGA bitstream generation}\n\\label{Abstraction_Levels_label}\n\\end{figure}\n\n\n\nGeneral power values can be used to estimate the power consumption of wireless communication systems \\cite{Desset12, Deruyck12, Arnold10}. Average power consumption values are associated with different elements in the system. Using such power models, accuracy is generally not the the main purpose and only global performance trends are provided.\n\n\n\nIn the wireless communication domain, designers use to work with high-level modelling tools such as Matlab/Simulink from Mathworks \\cite{Math15}. Some other academic and industrial tools are also utilized to a lesser extent, in the signal processing and in the wireless communication domain \\cite{Pto15,Lab15,System15, Vista_Arch_Mentor}. Basically, such tools do not support power estimation for FPGA-based systems. In fact, an additional tool is required to complete the FPGA design flow before obtaining any information related to the power consumption of their algorithms. As an example, Xilinx System Generator \\cite{SysGen15} enables to realize the FPGA design implementation directly from a Matlab/Simulink description. Accurate hardware details from lower levels can thus be obtained. However, design space exploration is really limited due to the numerous iterations that are required for FPGA design implementation. A similar approach is followed in a Matlab/Simulink add-on tool that is described in \\cite{PyGen06}. With this tool, detailed low-level information based on the synthesis of FPGA designs, is forwarded to higher levels using System Generator.\n\n\n\nSystem modelling is an interesting approach to deal with the increasing complexity of digital systems. Programming languages such as C/C++ or high-level description languages such as SystemC \\cite{Accellera15}, are more and more used in the community. The latter enables both software and hardware description and supports several degrees of design refinement that are well-suited for embedded systems. Moreover, SystemC-Transaction-Level Modelling (TLM) has been successfully standardized by the Open SystemC Initiative (OSCI) \\cite{montoreano2007transaction}.\n\nHowever, estimating power in systems that have been modelled using such languages is basically not supported, as for Matlab. Indeed, designers have to first enrich the language with specific information before performing any estimation.  \nBased on these considerations, several works have contributed to this problem in order to make power estimation possible at system-level. Macro-models can be used to directly link power to the signal statistics of the circuits \\cite{Dama07}. \nPower consumption can also be estimated through the definition of power state machines (PSM) that model each core of the system \\cite{Hsu11}. Power models of each IP are integrated into SystemC models to enable power high-level power estimation. In this work, low-level simulations are first realized to build accurate models and simulations are then performed to evaluate the overall power consumption. Note that IP execution modes are identified using key signals during these simulations. \n\nFunctional power models for IP cores can be built according to the Functional-Level Power Analysis methodology (FLPA) \\cite{Elleouet06}.\nWhen combining with a SystemC-TLM approach, such power models can also be used to estimate the power consumption of MPSoC targets \\cite{Rethinagiri11}.\n\n\n\n\n\n\n\n\n\n\n\n\n\nFPGA vendors have also developed early power estimation tools called spreadsheets \\cite{XPE12,Alt14}. Such sheets represent another way of estimating the average power consumption of a system based on FPGA. Using accurate FPGA hardware details, they provide early power estimates according to user specifications, prior to any implementation. In fact, analytical formulas aim at quantifying power consumption based on user-defined values such as the number of resources, clock frequency, signal activity, voltage, etc. Also, spreadsheet power estimates can be refined all along the design flow. Nevertheless, obtaining accurate power estimations is generally a long and difficult task, especially when large and complex systems are considered.\n\n\n\nAccording to previous studies, numerous techniques are available at different levels of abstraction. At system level, if low-level details are not available, such lack of information may lead to a poor power estimation accuracy. The same conclusion can be drawn using general analytical models when power consumption is estimated using average power consumption values. Such results are very interesting in practice but they may not be appropriated to the design of complex systems. Moreover, such results are not easily scalable since they are usually devoted to a specific and dedicated hardware. Furthermore, functionality is rarely validated with power estimation, which is is an important issue if designers want to evaluate the power and performance trade-off at the same time. In this way, SystemC-TLM approach seems to be a promising technique to deal with these issues. \n\nFrom our knowledge, there is a lack of system-level tools that enable to perform an efficient comparison between several configurations of FPGA-based systems in terms of power consumption and performance, especially in the wireless communication domain. Although, cores power modelling is interesting, it usually does not consider performance and only focus partially on the system. \n \nFrom these considerations, we propose an approach that is dedicated to FPGA-based hardware wireless communication designs. It aims at addressing several points: First, the proposed approach strives to provide a fast feedback of accurate power estimations from low-level components to the system level. To this purpose, the approach is based on the development of a dedicated library of cores and models that will be used by designers. Second, the concept of scenario is introduced to efficiently compare several applications. Third, the simulation time is significantly reduced, while obtaining a satisfactory level of accuracy that is similar to gate-level results. \n\n\n\\section{Power Estimation Approach}\\label{sect_Meth}\n\nThe proposed approach is dedicated to hardware system without any software consideration. Moreover, it is assumed that wireless communication systems can be entirely described using a set of interconnected hardware IP cores that constitute a data-flow architecture. Such IPs are usually dedicated to a specific function e.g. Fast Fourier Transform (FFT), channel encoders, modulators, etc. \n\nFirst, the entry point of the methodology is the innovative definition of a scenario. This term has already been used in \\cite{gheorghita2009system, zompakis2013scenario} but with another sense. In our approach, this concept refers to a set of parameters which are common to several applications in the same domain. A scenario is composed of system and technological parameters which have both an effect on power and/or performance. \nUsing this concept, common features of several applications are clearly identified and other features can be evaluated. In this way, a comparison of several systems can be performed in an efficient way based on the observation of the impact of each parameter over the power and performance trade-off. This is of particular interest regarding the complexity and the high number of user-defined parameters from different levels. \n\n\nFrom this definition, each application corresponds to an instance of a scenario, which also means that a scenario can be seen as a meta-model of an application. As the proposed example given in Table \\ref{Table_example_Scenario_label}, an application refers to a fully parametrized scenario. In the wireless communication domain, this may refer to a modulation type, a specific coding scheme, a frequency bandwidth, and other technological parameters such as the clock frequency, a FPGA target, the data quantization (number of bits to represent a modulated symbol), etc.\n\n\n\\begin{table}[!t]\n\n\\caption{Example of a scenario with two applications}\n\\label{Table_example_Scenario_label}\n\\centering\n\\begin{tabular}{|c|c|c|}\n\\hline\\hline\nScenario Parameters &  Application 1 &  Application 2   \\\\\n\\hline\\hline\n Channel Coding Rate & \\multicolumn{2}{c|}{1/3}  \\\\\n\\hline\n QAM Modulation &  QPSK & 16-QAM \\\\\n\\hline\n Frequency Bandwidth &  5MHz  &  10MHz  \\\\\n\\hline\n Data quantization &  10 bits &  14 bits \\\\\n\\hline\n  Frame Type &  \\multicolumn{2}{c|}{  1 OFDM symbol pilot } \\\\\t\n & \\multicolumn{2}{c|}{ every 10 OFDM symbols of data} \\\\\n\\hline\n FPGA & \\multicolumn{2}{c|}{ Xilinx Virtex-6 LX240T} \\\\\n\\hline\n Clock Frequency & \\multicolumn{2}{c|}{ 100 MHz} \\\\\n\\hline\\hline\n\\end{tabular}\n\\end{table}\n\n\n\n\nThe proposed methodology is realized in two stages: an IP characterization and modelling phase using SystemC, followed by a global system simulation.\n\n\nNote that the first stage is only realized if IPs are not in the library. If a specific IP is not in the library, the first stage of the methodology consists in enriching the library with the associated power values and models. To this purpose, hardware IPs are fully characterized in terms of power and behaviour, at both low and high levels. A gate-level power estimation tool from Xilinx called XPower Analyzer (XPA) has been used to estimate the average power consumption. To obtain accurate power estimation, the implementation design flow has been realized for each IP. A post-place and route VHDL simulation model, including timing properties, has been generated under the Xilinx design software environment (ISE v14.4). This model has then be simulated using the Modelsim SE-64 10.1c \\cite{Mentor15} tool in order to record the internal activity of all elements that constitute the IPs. Based on specific test-benches, two simulations have been performed. The first one was performed when the IP is active and the other one when the IP is idle. Finally, power has been estimated using XPA according to the activity file and additional implementation files i.e. constraint and design netlist files. Note that XPA delivers a complete report on the average power used by the different elements of the FPGA i.e. clock, logic, signals, memories, DSP blocks, etc.\n\n\n\n\n\n\n\n\n\n\nThe characterisation process using XPA and timing simulations have to be re-run several times for each set of parameters. The characterisation process is effective when all power estimation results have been obtained for every IP of the system. This first stage is quite tedious but has been relieved by the use of automated scripts that also spare time and reduce the number of errors.\n\n\n\nAfter performing IP power evaluations for each configuration, information is added to the corresponding SystemC description. Each SystemC model is built with respect to a specific implementation model that is composed of a control part and a data path. \nIn addition, key signals of the corresponding hardware IP are represented at high level to identify if the IP is active or not and thus determine which power values has to be considered. \n\"Clock enable\" and \"read/write\" input signals are common examples of key signals that are shared and used by hardware IPs.\nMoreover, some FPGA vendors provide bit-accurate C-models of their hardware IP. They can be easily integrated with SystemC in order to accurately model the functionality of the hardware IP.  \nEach high-level model is then stored in a dedicated library for further reuse.\n\nThe second stage of the methodology is described in both Fig. \\ref{Scenario_approach_label} and Fig. \\ref{Fig_2nd_step_method_label}. This stage is the entry point for designers. Their systems are built by connecting the SystemC models that have been developed and stored in the library during the first stage. Once the SystemC model of the entire system is described, users can define their applications i.e. instances of scenario, by setting up system and technological parameters. System functionality can also be validated using the SystemC simulation kernel. \n\nFrom the system model, simulations are performed and time-activity coefficients of all IP models are obtained regarding the key signals' evolution. Such coefficients represent the percentage of the simulation time during IPs are active. Indeed, it is of particular importance to take into account the temporal activity of each IP, that highly depends on the application. In fact, for a given circuit, each application behaviour may have a significant impact on the final power estimation results. \nFinally, the power consumption of the entire system is estimated by determining the power contribution of each IP that builds the system and their corresponding time-activity coefficients. \n\n\n \\begin{figure}[!t]\n \\centering\n \\includegraphics[scale=0.47,trim=0cm 25cm 0cm 0cm, clip=true] {Introduction_to_scenario_level_RSP.eps} \n \\caption{Second step of the methodology based on the scenario}\n \\label{Scenario_approach_label}\n \\end{figure}\n\n \\begin{figure}[!t]\n \\centering\n \\includegraphics[scale=0.35,trim=0.5cm 0cm 0cm 0cm, clip=true] {2nd_step_methodology_eng_EPS.eps} \n \\caption{Behavioural modelling and simulation using SystemC}\n \\label{Fig_2nd_step_method_label}\n \\end{figure}\n \n\nTo demonstrate the benefits of the proposed approach, a fully-compliant Long-Term Evolution (LTE) wireless base-band transmitter has been developed. \n\n\\section{Use Cases}\\label{sect_usecase}\n\n \nLong-Term Evolution (LTE) is the fourth generation (4G) of radio technology for mobile wireless communications that has been standardized by the 3rd Generation Partnership Project (3GPP) cooperation. LTE has multiple objectives such as the latency reduction, throughputs improvements or the users management.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn order to achieve high performance, the LTE physical layer combines several technologies such as Orthogonal Frequency Division Multiple Access (OFDMA) for downlink (DL) and Single Carrier Frequency Division Multiple Access (SC-FDMA) for Uplink (UL). It enables to achieve a throughput up to 100 Mbs in DL and up to 50 Mbs in UL. These values can also be improved when considering the last specifications of LTE-A i.e. carrier aggregation and other improvements. \n\nThe main OFDM parameters in LTE \\cite{LTE_norm} are given in Table \\ref{Table_OFDM_Param_label}. As described in this table, LTE uses scalable bandwidths from 1.4 MHz up to 20MHz. It also enables the use of Multiple Inputs Multiple Outputs (MIMO) schemes to improve systems performance. The MIMO strategy increases complexity, while improving spectral efficiency (when combined with OFDM), data throughput, and robustness to interferences. In the LTE standard, several MIMO operating modes are available. Transmit diversity, open-loop and closed-loop spatial multiplexing for a single user (up to 4x4 in Release 9 for DL and up to 8x8 in Release 10) are available techniques for DL \\cite{Li10}.\n\nThe LTE frame has a 10 ms duration. It carries and exchanges specific data based on different physical channels and signals. Two structures of frame are also standardized in LTE. Here, we focus on the type 1 structure that supports Frequency Division Duplex (FDD) whereas type 2 deals with Time Division Duplex (TDD). We also focus on the Physical Downlink Shared CHannel (PDSCH) and its associated processing that is dedicated to user data. Other channels are not studied in this paper.\n\n\\begin{table}[!t] \n\\centering \n\\caption{ Main Downlink OFDM parameters in LTE }\n\\begin{tabular}{|p{2cm}|c|c|c|c|c|c|} \n\\hline\\hline \n Spectral Bandwidth (MHz) & 1.4 & 3& 5& 10 & 15& 20 \\\\\n\\hline\n  Sub-carrier spacing (kHz)  & \\multicolumn{6}{c|}{ 15} \\\\   \n\\hline\n Used sub-carriers & 72 & 180 & 300 & 600 & 900& 1200\\\\  \n\\hline\n Used Resource Blocks  & 6 & 12 & 25 & 50 & 75 & 100 \\\\\n\\hline\n (I)FFT Size  & 128 & 256& 512& 1024& 1536 & 2048 \\\\  \n \\hline\n  OFDM symbol Length  & \\multicolumn{6}{c|}{66.67$\\mu s$ (without Cyclic Prefix)} \\\\\n \\hline \n Cyclic Prefix & \\multicolumn{6}{c|}{normal: 5.21$\\mu s$ (1st symbol) then 4.67$\\mu s$}\\\\\n  Length & \\multicolumn{6}{c|}{extended: 16.67$\\mu s$}  \\\\\n \\hline \\hline\n\\end{tabular} \n\\label{Table_OFDM_Param_label} \n\\end{table}\n\n \\begin{figure*}[!t]\n \\centering\n \\includegraphics[scale=0.45,trim=0.0cm 0cm 0cm 0cm, clip=true]{LTE_SFBC_2x1_chain_3.eps}  \n \\caption{LTE TX Downlink processing for PDSCH channel in MISO2x1 configuration with Alamouti encoding}\n \\label{LTE_MISO2x1_label}\n \\end{figure*}\n\nIn Fig. \\ref{LTE_MISO2x1_label}, the Downlink PDSCH transmitter processing, in a MISO 2x1 OFDM configuration, is shown. This design has been entirely developed using the VHDL Hardware description language in order to efficiently compare the results of our approach with a real system. \n\n\n\n\n \n \n\n\nDuring the development of this system, we have made the assumption that any resources of a LTE frame that are not dedicated to PDSCH channel are deliberately set to 0. \nA first scenario has been defined in order to compare the different applications that are summarized in Table \\ref{lte_scenario_and_app_label}. It can be noticed that IFFT sizes are different for the four studied applications. This parameter has an impact on both power consumption and system performance. \n\n\\begin{table}[!t]\n\n\\caption{Defined scenario and applications}\n\\label{lte_scenario_and_app_label}\n\\centering\n\\begin{tabular}{|c|c|c|c|c|}\n\\hline\\hline\n\\multirow{2}{*}{Scenario} & Appli.  &  Appli. &  Appli.&  Appli. \\\\\n&  1 &  2 &  3&  4 \\\\\n\\hline\\hline\n \\multirow{2}{*}{ Channel Coding } & \\multicolumn{4}{c|}{ Rate=1/3}\\\\ \n &  \\multicolumn{4}{c|}{ Code block size = 1024} \\\\\n\\hline\nQAM Modulation & \\multicolumn{4}{c|}{QPSK} \\\\\n\\hline\n (I)FFT Size &  256  &  512 &  1024 &  2048  \\\\\n\\hline\n TX antenna & \\multicolumn{4}{c|}{2}  \\\\\n\\hline\n Data quantization & \\multicolumn{4}{c|}{14 bits} \\\\\n\\hline\n  FPGA Type & \\multicolumn{4}{c|}{ Xilinx Virtex-6 LX240T} \\\\\n\\hline\n Clock Frequency & \\multicolumn{4}{c|}{ 50 MHz} \\\\\n\\hline\n Simulation time & \\multicolumn{4}{c|}{ Generation of 5 LTE sub-frames} \\\\\n\\hline\\hline\n\\end{tabular}\n\\end{table}\n\n\\subsection{Power estimation}\n\n    \nThe two stages of the approach have been applied to the proposed system. Each IP that composes the hardware system has been characterized independently. Moreover, SystemC models were built according to the proposed methodology. System-level simulations have been performed for the four applications and corresponding IP time-activities have been obtained. Finally, power estimation results have been compared with those obtained using XPA when considering the entire system. Indeed, such results served as reference during the comparison. Moreover, we also compare our approach to a classic cumulative approach. It consists in evaluating the power consumption of the entire system based on the sum of the average dynamic powers of each IP. Results are provided in Table \\ref{Table_Results_MISO_OFDM_Scenario_label} for the different applications.\n    \n\n\\begin{table}[!t]\n\n\\caption{Power estimation results of the 4 applications}\n\\label{Table_Results_MISO_OFDM_Scenario_label}\n\\centering\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\\hline\n &   XPA  &  Our &   Abs.  &  Cumula- &  Abs.\\\\\n &   (Ref.)\\footnotemark[1] &  \\footnotemark[2]&  Error  &   tive \\footnotemark[3] &  Error\\\\ \n & (mW)  & (mW) & \\footnotemark[1]-\\footnotemark[2] (\\%)  &  (mW) & \\footnotemark[1]-\\footnotemark[3](\\%)\\\\\n\\hline\\hline\n Appli.& \\multirow{2}{*}{118.64}  &  \\multirow{2}{*}{122.72} & \\multirow{2}{*}{3.44} & \\multirow{2}{*}{192.47} & \\multirow{2}{*}{62}\\\\\n  1  & & & & & \\\\\n\\hline\n  Appli. & \\multirow{2}{*}{159.01} & \\multirow{2}{*}{163.30} &  \\multirow{2}{*}{2.7} & \\multirow{2}{*}{226.59} & \\multirow{2}{*}{42.5}\\\\\n2 & & & & & \\\\\n\\hline\n  Appli. &  \\multirow{2}{*}{195.07} &   \\multirow{2}{*}{196.22} &   \\multirow{2}{*}{0.59} &  \\multirow{2}{*}{266.25} &  \\multirow{2}{*}{36.5}\\\\\n3  & & & & & \\\\\n\\hline\n  Appli. &  \\multirow{2}{*}{227.01} &   \\multirow{2}{*}{222.11} &   \\multirow{2}{*}{2.16}  &  \\multirow{2}{*}{294.25} &  \\multirow{2}{*}{29.6}\\\\\n4  & & & & &\\\\\n\\hline\\hline\n\\end{tabular}\n\\end{table}\n\n \\begin{figure*}[!t]\n \\centering\n \\includegraphics[scale=0.55,trim=0cm 0cm 0cm 0cm, clip=true]{Power_breakdown_fig_modif.eps}  \n \\caption{LTE TX downlink power breakdown in function of frequency band}\n \\label{LTE_power_breakdown_label}\n \\end{figure*}\n\nIn Table \\ref{Table_Results_MISO_OFDM_Scenario_label}, it can be noticed that a maximal absolute error lower than 4\\% is reached for the four considered applications. Although power estimations are performed at system-level, the obtained accuracy using the proposed approach is really good in comparison to low-level XPA power estimations. Moreover, it can be noted that a very important error is measured using the classic cumulative approach because IP time-activities are not considered. This demonstrates the effectiveness of our approach and the benefits to monitor IP time-activity.\n\nTo go further, our tool also permits users to identify the main sources that have an impact on power consumption. As shown in Fig. \\ref{LTE_power_breakdown_label}, a power breakdown can be provided to designers for the system under study. From this example, it can be noted that the two IFFTs consume the most significant part of the total power as compared to the other elements in the system. Finally, designers can easily investigate other IPs or hardware options. \n\n\n\n\\subsection{Speed-up Comparison}\n\n\\begin{table}[!t]\n\\caption{Approximated times for power estimation}\n\\label{Table_Speed_label}\n\\centering\n\\begin{tabular}{|c|c|c|c|}\n\\hline\\hline\n  &  Proposed &  \\multirow{2}{*}{ XPA\\footnotemark[1]}  & Speed-up \\\\\n &  Methodology & &factor \\\\\n\\hline\\hline\n Appli.1 &  1.25s &  2h25&  x6960\\\\\n\\hline\n  Appli. 2 &  2s &  6h53 &  x12390\\\\\n\\hline\n  Appli. 3 &  3.42s & 14h  &  x14736\\\\\n\\hline\n  Appli. 4 &  6.65s & 27h & x14616\\\\\n\\hline\\hline\n\\multicolumn{4}{l}{\\footnotemark[1] \\footnotesize{Time for timing simulations and XPA analysis} } \\\\ \n\\end{tabular}\n\\end{table}\n\n\\begin{figure*}[t!]\n\\centering\n\\begin{subfigure}[b]{0.45\\textwidth}\n        \\includegraphics[scale=0.45,trim=0.5cm 0cm -1cm 0cm, clip=true]{EE_vs_Total_Power_less_Pc_MISO2x1OFDM.eps} \n        \\caption{Average Energy Efficiency (bit/s) versus Total Power (dBm) when $P_{circuit} =0$}\n        \\label{EE_TX_MISO_OFDM_4applications_less_PC_fig_label}\n \\end{subfigure}\n    ~ \n      \n    \\begin{subfigure}[b]{0.45\\textwidth}\n        \\includegraphics[scale=0.45,trim=0cm 0cm 0cm 0cm, clip=true]{EE_vs_Total_Power_with_Pc_MISO2x1OFDM.eps} \n        \\caption{Average Energy Efficiency (bit/s) versus Total Power (dBm) when $P_{circuit}$ is taken into account}\n        \\label{EE_TX_MISO_OFDM_4applications_with_PC_fig_label}\n    \\end{subfigure}\n \\end{figure*}\n\n    \nOne of the most important benefit of the proposed methodology is the speed-up factor. As indicated in Table \\ref{Table_Speed_label}, the usual method for estimating the power consumption of the overall system, which combines timing simulations and XPA analysis, takes several hours. Using our tool, only few seconds (ranging from 1.25s to 6.65s) are required to simulate and to estimate the overall power consumption of the corresponding application. Such differences are generated by the lot of implementation details during low-level simulations of the system. For a same level of accuracy, a speed-up factor of 3-4 order of magnitude is obtained without considering the time that is required during the creation of the library. In most of the cases, designers will directly start their study from the second stage based on the library (that already contains tenth of cores).\n  \n     \n   \nThe speed-up factor is even more important when many applications have to be tested, especially during design space exploration. In fact, the different steps of the design flow generally have to be rerun from scratch after any parameters modification, such as data quantization, IFFT sizes, etc. Using our approach, only few seconds are required, which corresponds to the compilation of C/C++ files.\n\n\n\\subsection{Energy Efficiency Analysis}\n\nSeveral domain-specific metrics, such as energy efficiency (EE), can also be easily evaluated during high-level simulations. In fact, this metric reflects the capability of a system to transmit a maximum of data with a minimum of energy. This metric is an efficient way to determine the best power-performance trade-off. Using our approach, additional specific metrics of the wireless communication domain can be obtained such as the Bit-Error Rate (BER), etc. \n \nEE is usually evaluated as follows:\n\n", "index": 1, "text": "\\begin{equation} \\label{eq_EE_MISO_label}\nEE (bit/J) = \\frac{C}{P_{Total}}= \\frac{W.E[log2(1+ \\frac{|h|^2 P_{t} PL}{N0 W Nt})]}{P_{Total}} \\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"EE(bit/J)=\\frac{C}{P_{Total}}=\\frac{W.E[log2(1+\\frac{|h|^{2}P_{t}PL}{N0WNt})]}%&#10;{P_{Total}}\\\\&#10;\" display=\"block\"><mrow><mrow><mi>E</mi><mo>⁢</mo><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>b</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow><mo>/</mo><mi>J</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mi>C</mi><msub><mi>P</mi><mrow><mi>T</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>l</mi></mrow></msub></mfrac><mo>=</mo><mfrac><mrow><mi>W</mi><mo>.</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mi>h</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi>P</mi><mi>t</mi></msub><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mi>L</mi></mrow><mrow><mi>N</mi><mo>⁢</mo><mn>0</mn><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><msub><mi>P</mi><mrow><mi>T</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>l</mi></mrow></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.00834.tex", "nexttext": " \nwith $P_{t}$ the power allocated for data transmission and $P_{circuit}$ the average dynamic power that is consumed by the circuit (i.e. the base-band processing in our study).\nFrom Eq. \\ref{eq_EE_MISO_label}, we assume that $PL/N0.W =1$ during this study. This assumption is fully-compliant with a current small-cell (micro or pico) environment in LTE standard (for a frequency of 2.6GHz, $N0 = -174dBm$ and the LTE frequency bands). \n\nEE has been computed and is represented in Figures \\ref{EE_TX_MISO_OFDM_4applications_less_PC_fig_label} and \\ref{EE_TX_MISO_OFDM_4applications_with_PC_fig_label}. Two cases have been considered. First, EE has been evaluated when the power consumption of the circuit was not considered, i.e. $P_{circuit}= 0$. Only $P_{t}$, the power allocated for data transmission, was thus taken into account during the EE computations. Secondly, the power consumption related to the circuit was considered during EE evaluations. \nIt can be noticed that the power consumption of the circuit has a significant impact on the EE. \nMoreover, it is interesting to note that application 4 has the most important power consumption and is also the most energy efficient application. This is because this application has the largest capacity and frequency bandwidth. Note that the energy efficiency of the four applications are really close to each other at low transmit power. Through this example, we demonstrate that all sources of power consumption have to be taken into account in order to provide realistic results. \n \n\\section{Conclusion and Future works} \\label{sect_conclu}\n\n\nIn this paper, a system-level power estimation methodology for FPGA-based hardware designs has been presented. Fast and accurate power estimations of a FPGA-based wireless communication transmitter in LTE context have been described. \nThe innovative concept of scenario was also introduced. This concept is different from the examples found in the literature. It aims at helping designers to efficiently compare several design choices and to observe the impact of a specific parameter on power consumption. Another major contribution was the monitoring of IP time-activities that enable to refine power estimations. We also provide to designers a dedicated library of hardware IPs with their corresponding high-level models. All these contributions enable designers to perform an efficient and fast design space exploration.\nEnergy efficiency of several wireless communication transmitters has also been evaluated. The results highlight the impact of the base-band power consumption and enable designers to choose the most energy efficient system for a given power consumption. To design future wireless communication systems, such power consumption information has to be taken into account by designers in order to satisfy both power and performance requirements. This is of particular importance when low transmission powers are considered.\n\n\nAs future works, the proposed approach will be used to compare several base-band processing schemes of various wireless communication systems. Power and performance metrics as energy efficiency will be evaluated. Moreover, additional wireless communication elements will be included such as the power amplifier or the RF stages. \nThe main limitation of the methodology is currently being investigated. Indeed, we aim at generalizing the power estimation values that have been obtained on a dedicated FPGA to other FPGA families. We will also refine power estimations using real measurements as compared to the current low-level power estimations.\n\n\n\n\n\n\\section*{Acknowledgement}\n\n\nThe authors would like to thank Orange Labs for their financial support.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{abbrv}\n\n\\bibliography{biblio_HIP3ES}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwith $C$ the average capacity for a MISO configuration (bit/s), $W$ the frequency bandwidth (Hz), $h$ the fading coefficients of the channel, $N0$ the noise spectral density (dBm/Hz), $Nt$ the number of transmit antennas i.e. 2, $PL$ the path loss (dB), $P_{Total}$ the average total power (W) that is consumed by the system and where:\n \n", "index": 3, "text": "\\begin{equation}\nP_{Total}= P_{t} + P_{circuit} \\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P_{Total}=P_{t}+P_{circuit}\\\\&#10;\" display=\"block\"><mrow><msub><mi>P</mi><mrow><mi>T</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>=</mo><mrow><msub><mi>P</mi><mi>t</mi></msub><mo>+</mo><msub><mi>P</mi><mrow><mi>c</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}]