[{"file": "1601.00651.tex", "nexttext": "\n\nwhere $n_0$ is the star cluster central number density, $v_\\text{rms,0}$ is the central root-mean-square velocity \n(and we assume $v_\\text{rms,0}=\\sigma_0=\\sqrt{3}\\sigma_\\text{0,1D}$),\n$m$ is the mean mass of a star in the cluster (for which we adopt $m$ $=$ 0.5~{M$_{\\odot}$}), $f_\\text{b}$ is the binary frequency, and $\\pi$$R_\\text{enc}^2$ is the mean gravitationally-focused cross section, where $R_\\text{enc}$ is either the time-averaged separation of the binary undergoing stable MT (for 1+2 encounters) or the orbital separation corresponding to the cluster hard-soft boundary\\footnote{\\footnotesize The hard-soft boundary is a theoretical separation in either semi-major axis or orbital period.  Binaries inside this boundary are dynamically ``hard'', and encounters with other stars in the cluster tend to shrink (i.e., harden) the binary.  Binaries beyond this boundary are dynamically ``soft'', and encounters tend to widen and eventually ionize the binary.  Note that this results in an approximate lower limit for the 2+2 time-scale.  We also calculate a rough upper limit below by adopting instead the mean orbital separation below the hard-soft boundary for $R_\\text{enc}$.} (for 2+2 encounters).  Finally, the total time until a subsequent encounter is given by,\n\n", "itemtype": "equation", "pos": 10508, "prevtext": "\n\n\\title{Interrupted Binary Mass Transfer in Star Clusters}\n\\shorttitle{Interrupted Binary Mass Transfer in Star Clusters}\n\n\\author{Nathan W.\\ C.\\ Leigh$^{a}$}\n\\affil{Department of Astrophysics, American Museum of Natural History, Central Park West and 79th Street, New York, NY 10024}\n\\affil{Department of Physics, University of Alberta, CCIS 4-183, Edmonton, AB T6G 2E1, Canada}\n\\email{$^a$nleigh@amnh.org}\n\n\\author{Aaron M.\\ Geller$^{b,c}$}\n\\affil{Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA) and Department of Physics and Astronomy, Northwestern University, 2145 Sheridan Rd, Evanston, IL 60208, USA}\n\\affil{Department of Astronomy and Astrophysics, University of Chicago, 5640 S. Ellis Avenue, Chicago, IL 60637, USA}\n\\email{$^b$a-geller@northwestern.edu}\n\\thanks{$^c$NSF Astronomy and Astrophysics Postdoctoral Fellow}\n\n\\author{Silvia Toonen$^{d}$}\n\\affil{Leiden Observatory, Leiden University, PO Box 9513, NL-2300 RA Leiden, The Netherlands}\n\\email{$^d$toonen@strw.leidenuniv.nl}\n\n\\shortauthors{Leigh, Geller \\& Toonen}\n\n\\begin{abstract}\n\nBinary mass transfer is at the forefront of some of the most exciting puzzles of modern astrophysics, including Type Ia supernovae, gamma-ray bursts, and the formation of most observed exotic stellar populations.  Typically, the evolution is assumed to proceed in isolation, even in dense stellar environments such as star clusters.  In this paper, we test the validity of this assumption via the analysis of a large grid of binary evolution models simulated with the \\texttt{SeBa} code.  For every binary, we calculate analytically the mean time until another single or binary star comes within the mean separation of the mass-transferring binary, and compare this time-scale to the mean time for stable mass transfer to occur.  We then derive the probability for each respective binary to experience a direct dynamical interruption.  The resulting probability distribution can be integrated to give an estimate for the fraction of binaries undergoing mass transfer that are expected to be disrupted as a function of the host cluster properties.  We find that for lower-mass clusters ($\\lesssim 10^4$~{M$_{\\odot}$}), on the order of a few to a few tens of percent of binaries undergoing mass-transfer are expected to be interrupted by an interloping single, or more often binary, star, over the course of the cluster lifetime, whereas in more massive globular clusters we expect $\\ll$ 1\\% to be interrupted.  Furthermore, using numerical scattering experiments performed with the \\texttt{FEWBODY} code, we show that the probability of interruption increases if perturbative fly-bys are considered as well, by a factor $\\sim 2$.\n\n\n\n\n\\end{abstract}\n\n\\keywords{binaries: general --- galaxies: star clusters: general --- globular clusters: general --- open clusters and associations: general --- stars: kinematics and dynamics ---  binaries: close}\n\n\n\\section{Introduction}\\label{intro}\n\nBinary mass transfer (MT) is thought to be responsible for the production of \nmost observed exotic stellar populations, including blue straggler stars, low-mass X-ray binaries, millisecond pulsars, cataclysmic variables, etc., and the process is thought to contribute significantly to the rate of Type Ia supernovae, gravitational waves, gamma-ray bursts, etc.  A complete understanding of binary evolution is a prerequisite for predicting the rates of these high-energy phenomena.  Many are thought to occur in star clusters, facilitated by their high densities that stimulate direct\\footnote{We use the term, \\textit{direct}, to indicate that the distance of closest approach between an interloping object and a binary undergoing MT is equal to or less than the binary semi-major axis.} gravitational encounters leading to e.g, exchange interactions, fly-bys and/or collisions.  Such strong encounters can modify the binary orbital parameters, and hence \ndirectly affect the course of binary evolution \\citep[e.g.][]{ivanova:05,hurley:07,marks:11,geller:13a,geller:13b,geller:15,leigh:12,leigh:13,leigh:15}.     \n\nBy necessity, full star cluster dynamical simulations, including both direct $N$-body \\citep[e.g., \\texttt{NBODY6}]{aarseth:03} and \nMonte Carlo methods \\citep[e.g.][]{spurzem:96,joshi:00,vasiliev:15}, rely on a number of simplifying assumptions in order to treat binary star evolution.  In particular, binary MT is often parameterized, following a pre-calculated grid of more detailed models that were evolved in isolation.  These models are based on a sophisticated treatment of stellar evolution, with some basic assumptions for the actual MT process (e.g. energy conservation, mass conservation, etc.).  The hydrodynamics involved in the MT process is traditionally not modeled directly within full star cluster simulations.  Moreover, even if the parameterizations are able to approximate the binary evolution accurately, perturbations during MT are rarely treated properly (and are often ignored).  For example, a direct encounter involving a binary undergoing MT could disrupt the binary or exchange a different star into the system, thus halting the MT process.  Scenarios such as these are not accounted for in many star cluster dynamical models.\n\n\nThe assumption that MT occurs in relative isolation (even in star clusters) is often justified by comparing time-scales; in many clusters the duration of MT, particularly for high-mass stars, can be quite short when compared to the single - binary (1+2) encounter time.  However, for lower-mass stars, the typical duration of MT can greatly increase (e.g., due to the longer thermal and nuclear time-scales within the stars).  Furthermore, the binary - binary (2+2) encounter time-scale can be much shorter than the 1+2 encounter time in clusters with large binary frequencies.\\footnote{The exact binary fraction at which the 2+2 encounter rate begins to exceed the 1+2 rate is around $f_\\text{b} \\sim 10\\%$ \\citep[e.g.][]{sigurdsson93,leigh:11}.}\n\nIn this paper, we begin to quantify the validity of the assumption that MT can be treated as an isolated process within star clusters.  Due to mass segregation and dynamical friction, \nmost binaries live in the dense cluster core, where they may not be allowed to evolve fully before being interrupted.  We use the binary evolution code \\texttt{SeBa} \\citep{portegieszwart96,nelemans01,toonen12} \nto simulate the time evolution of the binary orbital parameters of individual binaries undergoing stable MT, as described in Section~\\ref{method}.  We then compare the MT time-scales to analytic estimates for the time-scales over which other single and binary stars in the cluster are expected to encounter, or ``interrupt'', the ongoing MT, as calculated in Section~\\ref{times}.  We show that the fraction of interrupted binaries can reach a few tens of percent, for certain cluster parameters.  Finally, we discuss in Sections~\\ref{discussion} and~\\ref{conc} the implications of our results and offer some concluding remarks.\n\n\\section{Binary Evolution} \\label{method} \n \nWe present results from $\\sim10^6$ individual binary evolution simulations performed using the \n\\texttt{SeBa} code.  \\texttt{SeBa} is a fast stellar and binary evolution code, that parameterizes stars by their mass, radius, luminosity, core mass, etc. as functions of time and initial mass.  The binary evolution includes mass loss, MT, angular momentum loss, common envelope evolution, magnetic braking and gravitational radiation. We consider only stable MT between hydrogen-rich non-degenerate stars. The stability of MT and the MT rate depend mainly on the adiabatic and thermal response of the donor star's radius, and the response of the Roche lobe, to the re-arrangement of mass and angular momentum within the binary. For an overview of the method and a comparison with other methods, see \\citet{toonen14}, Appendix B.  \n\nWe follow a nearly identical method to define the masses and orbital parameters of our initial binary population as in \\citet{geller:15}.  Briefly, primary masses are chosen from a \\citet{kroupa:93} initial mass function between 0.1~{M$_{\\odot}$} and 100~{M$_{\\odot}$}. We draw mass ratios ($q=m_2/m_1$) from a uniform distribution such that $q\\leq1$ and $m_2>0.1$~{M$_{\\odot}$}.  We choose binary orbital periods and eccentricities from the log-normal and flat distributions, respectively, as observed by \\citet{raghavan:10} for binaries with solar-type primary stars in the Galactic field, which are also consistent with observations of solar-type binaries in open clusters (OCs) \\citep[e.g.,][]{geller:10,geller:13a,geller:12}.   \n\nWe initially performed a set of simulations allowing binaries to occupy nearly the entire log-normal period distribution\nand determined that the longest-period binary that will undergo MT in \\texttt{SeBa}\nwithin a Hubble time (over all primary masses) is $\\log(P\\text{[days]}) = 4.16$.  We then imposed this maximum orbital period, along with a minimum orbital period chosen such that the binaries are initially detached, and drew $10^6$ random binaries for \\texttt{SeBa}.\\footnote{This number of binaries is chosen to be sufficiently large to provide reliable statistics.}  Binaries in the contact stage are excluded in our analysis.\n\nWe performed two sets of experiments, one at $\\text{[Fe/H]}=-1.5$, typical for an old globular cluster (GC), and the other at $\\text{[Fe/H]}=0$, appropriate for an OC.  We use the \\texttt{SeBa} code to evolve these binaries for a Hubble time and produce time-averaged orbital parameters (i.e., mean separation, mean binary mass) calculated over the course of stable MT, as well as the cluster age at the onset of MT and the total duration of the MT phase, $t_\\text{d}$, for each binary.  \n\n\n\n\n\\section{Encounter Time-scales} \\label{times}\n\nWe use the output from \\texttt{SeBa} to calculate the expected time-scales for another single or binary star in the cluster to (directly) encounter, or ``interrupt'', each of the binaries while MT is ongoing, which we will call $t_\\text{e}$.  We then compare this time-scale directly to the MT duration, $t_\\text{d}$, which is calculated and outputted by \\texttt{SeBa}.\n\nTo calculate the encounter time-scale, $t_\\text{e}$, we must first find the time for a single ($_1$) or binary ($_2$) star to interrupt an ongoing episode of stable MT, which we will refer to as, respectively, $\\tau_{2+1}$ and  $\\tau_{2+2}$.  As in, \\citet{geller15b}, we define these timescales as follows \\citep{leonard:89,leigh:11}:\n\n\n", "index": 1, "text": "\\begin{align} \\label{eq:tau_enc1}\n\\beta &= \\left(\\frac{10^3\\text{ pc}^{-3}}{n_0}\\right) \\left(\\frac{v_\\text{rms,0}}{5\\text{ km s}^{-1}}\\right) \\left(\\frac{0.5\\text{ M}_{\\odot}}{m}\\right) \\left(\\frac{1\\text{ AU}}{R_\\text{enc}}\\right)\\text{ ,} \\nonumber \\\\\n\\tau_{2+1} &= 1.4 \\times 10^{11} \\left(1 - f_\\text{b}\\right)^{-1} \\beta\\text{ yr ,} \\nonumber \\\\\n\\tau_{2+2} &= 5.4 \\times 10^{10} \\left(f_\\text{b}\\right)^{-1} \\beta\\text{ yr ,} \\nonumber \\\\\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\beta\" display=\"inline\"><mi>β</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left(\\frac{10^{3}\\text{ pc}^{-3}}{n_{0}}\\right)\\left(\\frac{v_{%&#10;\\text{rms,0}}}{5\\text{ km s}^{-1}}\\right)\\left(\\frac{0.5\\text{ M}_{\\odot}}{m}%&#10;\\right)\\left(\\frac{1\\text{ AU}}{R_{\\text{enc}}}\\right)\\text{ ,}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msup><mn>10</mn><mn>3</mn></msup><mo>⁢</mo><msup><mtext> pc</mtext><mrow><mo>-</mo><mn>3</mn></mrow></msup></mrow><msub><mi>n</mi><mn>0</mn></msub></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>v</mi><mtext>rms,0</mtext></msub><mrow><mn>5</mn><mo>⁢</mo><msup><mtext> km s</mtext><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>0.5</mn><mo>⁢</mo><msub><mtext> M</mtext><mo>⊙</mo></msub></mrow><mi>m</mi></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>⁢</mo><mtext> AU</mtext></mrow><msub><mi>R</mi><mtext>enc</mtext></msub></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mtext> ,</mtext></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tau_{2+1}\" display=\"inline\"><msub><mi>τ</mi><mrow><mn>2</mn><mo>+</mo><mn>1</mn></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=1.4\\times 10^{11}\\left(1-f_{\\text{b}}\\right)^{-1}\\beta\\text{ yr ,}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mn>1.4</mn><mo>×</mo><msup><mn>10</mn><mn>11</mn></msup></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mtext>b</mtext></msub></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>β</mi><mo>⁢</mo><mtext> yr ,</mtext></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tau_{2+2}\" display=\"inline\"><msub><mi>τ</mi><mrow><mn>2</mn><mo>+</mo><mn>2</mn></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=5.4\\times 10^{10}\\left(f_{\\text{b}}\\right)^{-1}\\beta\\text{ yr ,}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mn>5.4</mn><mo>×</mo><msup><mn>10</mn><mn>10</mn></msup></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><msub><mi>f</mi><mtext>b</mtext></msub><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>β</mi><mo>⁢</mo><mtext> yr ,</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00651.tex", "nexttext": "\nwhere $\\Gamma=1/\\tau$.\n\nTo calculate the parameters in Equation~\\ref{eq:tau_enc1}, we consider total cluster masses $M_\\text{cl}$ ranging from $10^3$ to $10^6$~{M$_{\\odot}$}\\ in steps of 1 in $\\log_{10}(M_\\text{cl}$~[{M$_{\\odot}$}]~$)$, \nand assume a Plummer model \\citep{plummer:11} with a half-mass radius\\footnote{\\footnotesize Note that for these parameters, the mean orbital separation during MT is much smaller than the hard-soft boundary, independent of $M_\\text{cl}$.} of 3 pc.  See \\citet{geller:15} for specific details.  In general $n_0$ increases with increasing cluster mass, while $f_\\text{b}$ decreases with increasing cluster mass (as is consistent with observations, e.g., \\citealt{leigh:15b}).\n\n\\section{Fraction of Interrupted Binaries Undergoing Stable Mass Transfer} \\label{frac}\n\nWe find from these binary evolution simulations that, the probability that a given binary will be interrupted during MT in a star cluster core ranges from $\\ll$ 1\\% to well over unity.  The main results are plotted in Figures~\\ref{fig:fig1}~and~\\ref{fig:fig2}.  \n\n\n\nAs shown in Figure~\\ref{fig:fig1}, both $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ are sensitive to the total cluster mass, whereas the MT durations $t_\\text{d}$ are not.  The sensitivity of $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ to $M_\\text{cl}$ is due to the dependence of the semi-major axis at the hard-soft boundary on $M_\\text{cl}$, which results (on average) in tighter binaries and lower binary fractions in more massive clusters.  In low-mass clusters, the mean binary separation and binary fraction are both large, causing $\\tau_\\text{2+2}$ to be short.  As $M_\\text{cl}$ increases, both the mean binary separation and binary fraction decrease along with the separation at the hard-soft boundary, causing $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ to decrease and increase, respectively.  Importantly, most binaries undergoing stable MT have time-averaged separations that are on the order of only a few stellar radii, causing $\\tau_\\text{1+2}$ to exceed a Hubble Time nearly independent of $M_\\text{cl}$.  On the other hand, $\\tau_\\text{2+2}$ is always much shorter than a Hubble Time, due to the larger mean separation of the entire cluster binary population.\n\n\nIn Figure~\\ref{fig:fig1}, a bimodality is apparent in the distribution for $\\tau_\\text{1+2}$ at low metallicity (i.e. Z $=$ 0.0006) that is not apparent in either the $\\tau_\\text{1+2}$ distribution at high metallicity (i.e. Z $=$ 0.02) or in either of the $\\tau_\\text{2+2}$ distributions.  This is due to a bimodality that appears in the mean binary separation during mass transfer, which dominates the 1+2 cross-section but not the 2+2 cross-section, since the mean binary separation in the cluster is much larger than the mean binary separation during mass transfer.  The first peak in this bimodal distribution (at small orbital separations) is due to systems for which stable mass transfer is initiated in a relatively tight binary, involving relatively unevolved stars. The second peak is due to systems with asymptotic giant branch (AGB) donors that have lost so much mass that they are less massive than their companion.  Consequently, the resulting mass transfer is stable.  For low metallicities, this second group is bigger, and a second peak becomes clearly visible (relative to high metallicities).  This is because the lifetimes of low metallicity stars are shorter relative to more metal-rich stars.  Therefore, low mass stars are able to evolve off the main sequence, become an AGB star, and hence fill their Roche lobe all within a Hubble time.\n\nIn Figure~\\ref{fig:fig2}, we compare $t_\\text{d}$ and $t_\\text{e}$ for each individual encounter directly, by calculating the cumulative Poisson probability or the probability that a given binary will undergo at least one encounter with another star or binary within a time interval $t_\\text{d}$:\n\n", "itemtype": "equation", "pos": 12245, "prevtext": "\n\nwhere $n_0$ is the star cluster central number density, $v_\\text{rms,0}$ is the central root-mean-square velocity \n(and we assume $v_\\text{rms,0}=\\sigma_0=\\sqrt{3}\\sigma_\\text{0,1D}$),\n$m$ is the mean mass of a star in the cluster (for which we adopt $m$ $=$ 0.5~{M$_{\\odot}$}), $f_\\text{b}$ is the binary frequency, and $\\pi$$R_\\text{enc}^2$ is the mean gravitationally-focused cross section, where $R_\\text{enc}$ is either the time-averaged separation of the binary undergoing stable MT (for 1+2 encounters) or the orbital separation corresponding to the cluster hard-soft boundary\\footnote{\\footnotesize The hard-soft boundary is a theoretical separation in either semi-major axis or orbital period.  Binaries inside this boundary are dynamically ``hard'', and encounters with other stars in the cluster tend to shrink (i.e., harden) the binary.  Binaries beyond this boundary are dynamically ``soft'', and encounters tend to widen and eventually ionize the binary.  Note that this results in an approximate lower limit for the 2+2 time-scale.  We also calculate a rough upper limit below by adopting instead the mean orbital separation below the hard-soft boundary for $R_\\text{enc}$.} (for 2+2 encounters).  Finally, the total time until a subsequent encounter is given by,\n\n", "index": 3, "text": "\\begin{equation}  \\label{eq:tau_enc}\nt_\\text{e} = \\left(\\Gamma_{2+1} + \\Gamma_{2+2}\\right)^{-1} \\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"t_{\\text{e}}=\\left(\\Gamma_{2+1}+\\Gamma_{2+2}\\right)^{-1}\\\\&#10;\" display=\"block\"><mrow><msub><mi>t</mi><mtext>e</mtext></msub><mo>=</mo><msup><mrow><mo>(</mo><mrow><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mn>2</mn><mo>+</mo><mn>1</mn></mrow></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mn>2</mn><mo>+</mo><mn>2</mn></mrow></msub></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></math>", "type": "latex"}, {"file": "1601.00651.tex", "nexttext": " \nEquation~\\ref{eqn:poisson} approximates the probability that a given binary undergoes a \\textit{direct} encounter with another star or binary in the cluster before MT stops (shown on the x-axis in Figure~\\ref{fig:fig2}).\n\n\n\\begin{figure}[!t]\n\\plotone{fig1.eps}\n\\caption{\nDistributions of the total duration of stable MT ($t_\\text{d}$; solid black histograms) and times until the next direct 1+2 ($\\tau_\\text{1+2}$; dotted blue histograms) and 2+2 ($\\tau_\\text{2+2}$; dashed red histograms) encounter, drawn from clusters with half-mass radii of 3 pc and the $M_\\text{cl}$ values indicated in each panel.  The left and right panels distinguish between assumed metallicities of Z $=$ 0.0006 and Z $=$ 0.02, respectively.\n\\label{fig:fig1}\n}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\plotone{fig2.eps}\n\\caption{\nDistributions of the probability for binary MT interruption, as defined in Equation~\\ref{eqn:poisson}.  The binary populations used to calculate these probabilities are the same as in Figure~\\ref{fig:fig1}.\n\\label{fig:fig2}\n}\n\\end{figure}\n\nImportantly, fly-by encounters will also perturb binaries undergoing MT, and this is not accounted for in Figures~\\ref{fig:fig1} and~\\ref{fig:fig2}.  To quantify this effect, we ran simulations of 1+2 encounters using the \\texttt{FEWBODY} code \\citep{fregeau:04}.  We fix the binary orbital parameters and relative velocity at infinity for the encounters, but sample the impact parameter in multiples of 0.5$b_\\text{0}$, where $b_\\text{0}$ is the impact parameter corresponding to a distance of closest approach equal to the binary semi-major axis $a$, or \\citep{leonard:89,leigh:11}:\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $\\Gamma=1/\\tau$.\n\nTo calculate the parameters in Equation~\\ref{eq:tau_enc1}, we consider total cluster masses $M_\\text{cl}$ ranging from $10^3$ to $10^6$~{M$_{\\odot}$}\\ in steps of 1 in $\\log_{10}(M_\\text{cl}$~[{M$_{\\odot}$}]~$)$, \nand assume a Plummer model \\citep{plummer:11} with a half-mass radius\\footnote{\\footnotesize Note that for these parameters, the mean orbital separation during MT is much smaller than the hard-soft boundary, independent of $M_\\text{cl}$.} of 3 pc.  See \\citet{geller:15} for specific details.  In general $n_0$ increases with increasing cluster mass, while $f_\\text{b}$ decreases with increasing cluster mass (as is consistent with observations, e.g., \\citealt{leigh:15b}).\n\n\\section{Fraction of Interrupted Binaries Undergoing Stable Mass Transfer} \\label{frac}\n\nWe find from these binary evolution simulations that, the probability that a given binary will be interrupted during MT in a star cluster core ranges from $\\ll$ 1\\% to well over unity.  The main results are plotted in Figures~\\ref{fig:fig1}~and~\\ref{fig:fig2}.  \n\n\n\nAs shown in Figure~\\ref{fig:fig1}, both $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ are sensitive to the total cluster mass, whereas the MT durations $t_\\text{d}$ are not.  The sensitivity of $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ to $M_\\text{cl}$ is due to the dependence of the semi-major axis at the hard-soft boundary on $M_\\text{cl}$, which results (on average) in tighter binaries and lower binary fractions in more massive clusters.  In low-mass clusters, the mean binary separation and binary fraction are both large, causing $\\tau_\\text{2+2}$ to be short.  As $M_\\text{cl}$ increases, both the mean binary separation and binary fraction decrease along with the separation at the hard-soft boundary, causing $\\tau_\\text{1+2}$ and $\\tau_\\text{2+2}$ to decrease and increase, respectively.  Importantly, most binaries undergoing stable MT have time-averaged separations that are on the order of only a few stellar radii, causing $\\tau_\\text{1+2}$ to exceed a Hubble Time nearly independent of $M_\\text{cl}$.  On the other hand, $\\tau_\\text{2+2}$ is always much shorter than a Hubble Time, due to the larger mean separation of the entire cluster binary population.\n\n\nIn Figure~\\ref{fig:fig1}, a bimodality is apparent in the distribution for $\\tau_\\text{1+2}$ at low metallicity (i.e. Z $=$ 0.0006) that is not apparent in either the $\\tau_\\text{1+2}$ distribution at high metallicity (i.e. Z $=$ 0.02) or in either of the $\\tau_\\text{2+2}$ distributions.  This is due to a bimodality that appears in the mean binary separation during mass transfer, which dominates the 1+2 cross-section but not the 2+2 cross-section, since the mean binary separation in the cluster is much larger than the mean binary separation during mass transfer.  The first peak in this bimodal distribution (at small orbital separations) is due to systems for which stable mass transfer is initiated in a relatively tight binary, involving relatively unevolved stars. The second peak is due to systems with asymptotic giant branch (AGB) donors that have lost so much mass that they are less massive than their companion.  Consequently, the resulting mass transfer is stable.  For low metallicities, this second group is bigger, and a second peak becomes clearly visible (relative to high metallicities).  This is because the lifetimes of low metallicity stars are shorter relative to more metal-rich stars.  Therefore, low mass stars are able to evolve off the main sequence, become an AGB star, and hence fill their Roche lobe all within a Hubble time.\n\nIn Figure~\\ref{fig:fig2}, we compare $t_\\text{d}$ and $t_\\text{e}$ for each individual encounter directly, by calculating the cumulative Poisson probability or the probability that a given binary will undergo at least one encounter with another star or binary within a time interval $t_\\text{d}$:\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eqn:poisson}\nP = 1 - e^{-t_\\text{d}/t_\\text{e}}\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P=1-e^{-t_{\\text{d}}/t_{\\text{e}}}\\par&#10;\" display=\"block\"><mrow><mi>P</mi><mo>=</mo><mrow><mn>1</mn><mo>-</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>t</mi><mtext>d</mtext></msub><mo>/</mo><msub><mi>t</mi><mtext>e</mtext></msub></mrow></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00651.tex", "nexttext": "\nHere, $m$ is the mean single star mass in the cluster and $v_\\text{inf}$ is the relative velocity at infinity.  We perform $10^4$ numerical scattering experiments for every choice of the impact parameter.  All stars are assumed to be point particles with masses of 1{M$_{\\odot}$}.  The initial binary semi-major axis and eccentricity are 1 AU and 0, respectively.  The incoming velocity at infinity is set to $v_\\text{inf} = 5$ km/s.  \n\nThe results of these scattering experiments are illustrated in Figure~\\ref{fig:fig3}, which shows the mean (absolute) change in the binary semi-major axis and eccentricity for all simulations, as a function of the impact parameter.  We assume here that a fly-by encounter ``interrupts'' a given binary undergoing MT if either of the two following criteria are met: 1) the change in semi-major axis $|\\Delta{a}|$ is greater than or equal to the typical stellar radius at the onset of Roche lobe overflow ($\\sim$ 1 R$_{\\odot}$ for most binaries), and/or 2) the change in eccentricity $|\\Delta{e}|$ corresponds to a change in the quantity $r_\\text{p} - r_\\text{a}$ that is greater than or equal to the typical stellar radius at the onset of MT, where $r_\\text{p}$ and $r_\\text{a}$ are the pericenter and apocenter distances, respectively, from the binary center of mass.  We assume that the magnitude of such a perturbation is sufficiently large to at least temporarily halt the MT process (provided $\\Delta{a} > 0$ and/or $\\Delta{e} < 0$).    \n\n\nAs shown in Figure~\\ref{fig:fig3}, the perturbative effects of fly-bys remain significant for b $\\lesssim$ 1.5$b_\\text{0}$.\n\n\nMoreover, both $\\left|\\Delta{a}\\right|$ and $\\left|\\Delta{e}\\right|$ undergo a steep drop-off between b $=$ 1$b_\\text{0}$ and b $=$ 2$b_\\text{0}$, such that neither of our criteria for a ``significant'' perturbation are satisfied \nfor b $\\gtrsim$ 1.5$b_\\text{0}$.  Our analytic estimates for the 1+2 and 2+2 encounter rates are directly proportional to the gravitationally-focused cross-section $\\sigma_\\text{gf} \\propto {\\pi}b^2$, for some \nimpact parameter b.  Hence, if fly-bys are included, the time-scales for 1+2 and 2+2 encounters should each decrease by a factor $\\lesssim 1.5^2 \\sim 2.1$, as should $t_\\text{e}$.  Working from Equation~\\ref{eqn:poisson}, we find that the probabilities typically increase by a corresponding factor of $\\sim$ 2.  That is, the ratio between the probabilities calculated with and without this additional factor of $\\sim$ 2.1 in our estimate for $t_\\text{e}$ peak at a value of $\\sim$ 2 with very little scatter. \n\n\nThe fraction of binaries expected to be interrupted during MT can be estimated from the probability distributions presented in Figure~\\ref{fig:fig2}.  To do so, we integrate the probability distributions in Figure~\\ref{fig:fig2} and divide by the total number of binaries.  The resulting fractions are $f_\\text{i} \\sim$ 0.18, 0.10, 0.03 and 0.01 for our model clusters with $M_\\text{cl}$[{M$_{\\odot}$}] $=$  10$^3$, 10$^4$, 10$^5$ and 10$^6$, respectively, and a metallicity Z $=$ 0.02.  These fractions remain the same to within $\\pm 1$\\% for a metallicity Z $=$ 0.0006.  As shown in Figure~\\ref{fig:fig4}, the mean mass transfer duration is $\\sim$ 10$^{5.5}$ years during the first 1 Gyr of cluster evolution, then quickly increases by roughly an order of magnitude.  After this, the mean MT duration slightly and slowly decreases over the next $\\sim$ 12 Gyr, but remains much larger than during the initial 1 Gyr.  Hence, if the initial 1 Gyr of the cluster lifetime is excluded from our calculation for the fraction of binaries expected to be interrupted during MT, these estimates increase by a factor $\\sim$ 2.\\footnote{Note that the final increase in the mean duration of mass transfer at $\\sim$ 13 Gyr seen for the Z $=$ 0.0006 case should be regarded with caution.  This is due in part to small number statistics, and the presence of a handful of binaries with unusually long MT durations at late times.  This is not visible in the error bars, since we are showing the standard error of the mean here, and the number of binaries included in this calculation is large.  Perhaps more importantly, these error bars do not reflect any inherent uncertainties in the \\texttt{SeBa} code and binary evolution in general, which are certainly non-negligible.}  These fractions correspond approximately to upper limits, since we adopt the mean orbital separation at the hard-soft boundary when calculating the 2+2 encounter time.  If we adopt instead the mean orbital separation \\textit{below} the hard-soft boundary (which does not include the presence of soft binaries), these fractions decrease by a factor of a few (of the same order as the increase from including fly-bys).\n\n\n\nFrom these fractions, we can also estimate the number of binaries that are expected to be directly interrupted during ongoing stable MT:\n\n", "itemtype": "equation", "pos": 17969, "prevtext": " \nEquation~\\ref{eqn:poisson} approximates the probability that a given binary undergoes a \\textit{direct} encounter with another star or binary in the cluster before MT stops (shown on the x-axis in Figure~\\ref{fig:fig2}).\n\n\n\\begin{figure}[!t]\n\\plotone{fig1.eps}\n\\caption{\nDistributions of the total duration of stable MT ($t_\\text{d}$; solid black histograms) and times until the next direct 1+2 ($\\tau_\\text{1+2}$; dotted blue histograms) and 2+2 ($\\tau_\\text{2+2}$; dashed red histograms) encounter, drawn from clusters with half-mass radii of 3 pc and the $M_\\text{cl}$ values indicated in each panel.  The left and right panels distinguish between assumed metallicities of Z $=$ 0.0006 and Z $=$ 0.02, respectively.\n\\label{fig:fig1}\n}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\plotone{fig2.eps}\n\\caption{\nDistributions of the probability for binary MT interruption, as defined in Equation~\\ref{eqn:poisson}.  The binary populations used to calculate these probabilities are the same as in Figure~\\ref{fig:fig1}.\n\\label{fig:fig2}\n}\n\\end{figure}\n\nImportantly, fly-by encounters will also perturb binaries undergoing MT, and this is not accounted for in Figures~\\ref{fig:fig1} and~\\ref{fig:fig2}.  To quantify this effect, we ran simulations of 1+2 encounters using the \\texttt{FEWBODY} code \\citep{fregeau:04}.  We fix the binary orbital parameters and relative velocity at infinity for the encounters, but sample the impact parameter in multiples of 0.5$b_\\text{0}$, where $b_\\text{0}$ is the impact parameter corresponding to a distance of closest approach equal to the binary semi-major axis $a$, or \\citep{leonard:89,leigh:11}:\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eqn:imp0}\nb_\\text{0} = \\Big( \\frac{6Gma}{v_\\text{inf}^2} \\Big)^{1/2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"b_{\\text{0}}=\\Big{(}\\frac{6Gma}{v_{\\text{inf}}^{2}}\\Big{)}^{1/2}\" display=\"block\"><mrow><msub><mi>b</mi><mtext>0</mtext></msub><mo>=</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mfrac><mrow><mn>6</mn><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>a</mi></mrow><msubsup><mi>v</mi><mtext>inf</mtext><mn>2</mn></msubsup></mfrac><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></math>", "type": "latex"}, {"file": "1601.00651.tex", "nexttext": "\nwhere $N_\\text{bin}$ is the total number of initial binaries in the cluster (estimated as $f_\\text{b}N_\\text{stars}$), $f_\\text{MT}$ is the fraction of binaries expected to undergo MT (calculated by \\texttt{SeBa} for our assumed binary orbital parameter distributions) and $f_\\text{i}$ is the fraction of binaries undergoing MT that are expected to be interrupted over a Hubble time of cluster evolution (as calculated above for our four cluster masses).  These parameters are shown in Table~\\ref{table:one}, for all four assumed values of the total cluster mass.\n\n\n\\begin{table}\n\\begin{center}\n\\caption{Parameters adopted in Equation 5 to calculate the numbers of interrupted MT binaries.}\n\\begin{tabular}{|c|c|c|c|c|}\n\\hline\n$M_\\text{cl}$    &     $N_\\text{bin}$   &   $f_\\text{MT}$   &    $f_\\text{i}$    &    $N_\\text{bin,i}$           \\\\\n(in {M$_{\\odot}$})       &                                  &                             &                           &                                           \\\\\n\\hline\n10$^3$              &        665                   &          0.05           &        0.18           &           6                             \\\\\n10$^4$              &        3837                 &          0.07           &        0.10           &          27                             \\\\\n10$^5$              &       16431                &          0.12           &        0.03           &          59                             \\\\\n10$^6$              &       50338                &          0.23           &        0.01           &         116                              \\\\\n\\hline\n\\end{tabular}\n\\label{table:one}\n\\end{center}\n\\end{table}\n\nThe resulting total numbers of binaries expected to be interrupted over the lifetime of the clusters is then $N_\\text{bin,i} \\sim$ 6, 27, 59 and 116 for our model clusters with $M_\\text{cl}$[{M$_{\\odot}$}] $=$  10$^3$, 10$^4$, 10$^5$ and 10$^6$, respectively.  If perturbative fly-bys are included, these values each increase by a factor $\\sim$ 2.  \\textit{The calculated rate of MT interruption for clusters is $\\sim$ 1-10 binary per Gyr, with only a weak tendency for this rate to increase with increasing cluster mass.}\n\n\n\n\n\n\n\n\\begin{figure}[!t]\n\\plotone{fig3.eps}\n\\caption{The (logarithm of the) mean change in eccentricity |${\\Delta}e$| (red triangles) and semi-major axis |$\\Delta{a}$| (black open circles; in AU) for binaries involved in single-binary interactions, as a function of the impact parameter (x-axis).  The impact parameter is sampled in units of 0.5$b_{\\text{0}}$, defined as in Equation~\\ref{eqn:imp0}.  The uncertainties correspond to the standard deviation of the mean. (The distributions for |$\\Delta{a}$| and |$\\Delta{e}$| are not strictly Gaussian, so the uncertainties should formally be asymmetric.  However the differences are negligible for our purposes here.)   The dashed lines correspond to the critical values of $|\\Delta{a}|$ (black) and $|\\Delta{e}|$ (red; in AU) defined by our criteria for a \"significant\" perturbation described in the text. \n\\label{fig:fig3}\n}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\plotone{fig4.eps}\n\\caption{The (logarithm of the) mean duration of mass transfer (shown on the y-axis; in years) as a function of the (logarithm of the) host cluster age (x-axis; in Gyr), for all cluster masses adopted in Figures~\\ref{fig:fig1} and~\\ref{fig:fig2}.  The mean is calculated in 1 Gyr intervals, using all binaries that initiate mass transfer during each 1 Gyr window of the cluster lifetime.  Error bars correspond to the standard error of the mean.  Black and red solid circles correspond to metallicities of, respectively, Z $=$ 0.0006 and Z $=$ 0.02. \n\\label{fig:fig4}\n}\n\\end{figure}\n\n\n\\section{Discussion} \\label{discussion}\n\nWe find that a relatively large fraction $f_\\text{i}$ of binaries undergoing stable MT may encounter another single or binary star in the core of a star cluster before the MT proceeds to completion.  We calculate $f_\\text{i} \\sim$ 0.18, 0.10, 0.03 and 0.01 for our model clusters with $M_\\text{cl}$[{M$_{\\odot}$}] $=$  10$^3$, 10$^4$, 10$^5$ and 10$^6$, respectively, nearly independent of metallicity.  These fractions are only slightly lower than we calculated in \\citet{geller15b} for the fraction of interrupted stellar encounters in star clusters, which ranges from $<$ 0.01 in massive GCs to $>$ 0.4 in low-mass OCs.  The origin of this analogous dependence between the fraction of interrupted \"events\" and the total cluster mass is ultimately the same (see below).  \n\nAs a binary undergoing MT generally has a relatively small geometric cross section, the interloper in these cases are most often binary stars themselves, resulting in 4-body encounters that may dramatically alter the course of the binary evolution.  Interrupted MT is expected to occur most often in massive OCs and low-mass GCs ($\\sim 10^4$~{M$_{\\odot}$}), where in general the binary frequency is larger, and (detached) binaries can have larger orbital separations and therefore larger geometric cross sections.  These larger binary frequencies and geometric cross sections present in the low-mass cluster regime also result in a larger fraction of interrupted stellar encounters.  No publicly available code for star cluster dynamics accounts directly for the hydrodynamics of binary MT needed to accurately model such interrupted/perturbed MT binaries.\n\n\n\nAs discussed in \\citet{geller15b} for interrupted stellar encounters, the dependence of $f_\\text{i}$ on $M_\\text{c}$ is encouraging for numerical models of star clusters, since low-mass clusters such as OCs are most often modeled\nwith direct $N$-body simulations.  Direct $N$-body codes, such as \\texttt{NBODY6}, can in principle apply perturbations to binaries undergoing (parameterized) MT, if the time steps are chosen appropriately.  Given our results, a more detailed study of how often such cases of interrupted MT occur and how accurately they are treated in direct $N$-body codes is warranted.  Massive clusters, on the other hand, are more often modeled with Monte Carlo codes \\citep[e.g.,][]{chatterjee:10,hypki:13}.  Here, binary evolution is assumed to run to completion in isolation.  In massive GCs, we find that this assumption is much more valid than in OCs (albeit not perfect, see Figure~\\ref{fig:fig2}), similar to what was found in \\citet{geller15b} for interrupted stellar encounters.  \n\nThe time-averaged separations of binaries undergoing stable MT are typically on the order of a few solar radii.  However, stable and conservative MT leads to an increase in the binary orbital separation (if the donor is less massive than the accretor).  Generally toward the end of the MT phase,\nafter a mass-ratio inversion, the orbits expand significantly, increasing the binary cross-section and decreasing the 1+2 and 2+2 encounter times.  Hence, the time-scale for interruption decreases markedly at the end of the MT phase and beyond, which is not properly accounted for in our models (since we only use the mean binary separation during MT).  Interestingly, the final separation is on the order of $\\gtrsim$ 1 AU in our models, which is comparable to the hard-soft boundary in old massive ($\\sim 10^6$~{M$_{\\odot}$}) GCs.  Hence, these binaries become subject to ionization due to dynamical encounters with other single and binary stars after MT.  Assuming a MT origin, this could be of particular relevance for blue straggler formation in GCs.  In particular, this naively predicts a rough correlation whereby the fraction of blue stragglers in binaries increases with decreasing $M_\\text{cl}$.\n\n\\section{Conclusions} \\label{conc}\n\n\n\nEven the very intimate dance of binary MT can be interrupted by an interloping single or, more often, binary star in a star cluster.  Up to about a quarter of all binaries undergoing stable MT in the cores of massive OCs and low-mass GCs ($\\sim 10^4$~{M$_{\\odot}$}) may encounter another star (or stars) before completing this phase of evolution (see Figure~\\ref{fig:fig2}).  This fraction decreases towards $<<1$\\% for more massive GCs, primarily because the binary frequency in these clusters is much lower.  Cases of interrupted MT may lead to significantly different outcomes than are assumed for isolated evolution, which in turn may impact the formation rates of MT products in star clusters, from exotic stars like blue stragglers, to SN Ia and gamma-ray burst progenitors. Our results highlight the need for a more detailed treatment of binary evolution in star cluster simulations.\n\n\\acknowledgments\nThe authors would like to thank an anonymous reviewer for useful suggestions for improvement.  N.W.C.L.\\ is grateful for the generous support of an NSERC Postdoctoral Fellowship.  A.M.G.\\ is funded by a National Science Foundation Astronomy and Astrophysics Postdoctoral Fellowship under Award No.\\ AST-1302765.\n\n\n\n\n\\bibliographystyle{apj}\n\\begin{thebibliography}{}\n\n\\bibitem[\\protect\\citeauthoryear{{Aarseth}}{{Aarseth}}{2003}]{aarseth:03}\n{Aarseth}, S.~J. 2003, {Gravitational N-Body Simulations} (Cambridge, UK:\n  Cambridge University Press)\n\n\\bibitem[\\protect\\citeauthoryear{{Chatterjee} et~al.}{{Chatterjee}\n  et~al.}{2010}]{chatterjee:10}\n{Chatterjee}, S., {Fregeau}, J.~M., {Umbreit}, S.,  \\& {Rasio}, F.~A. 2010,\n  \\apj, 719, 915\n\n\\bibitem[\\protect\\citeauthoryear{{Eggleton}}{{Eggleton}}{1983}]{eggleton:83}\n{Eggleton}, P.~P. 1983, \\apj, 268, 368\n\n\\bibitem[\\protect\\citeauthoryear{{Fregeau} et~al.}{{Fregeau}\n  et~al.}{2004}]{fregeau:04}\n{Fregeau}, J.~M., {Cheung}, P., {Portegies Zwart}, S.~F.,  \\& {Rasio}, F.~A.\n  2004, \\mnras, 352, 1\n\n\\bibitem[\\protect\\citeauthoryear{{Geller} et~al.}{{Geller}\n  et~al.}{2013b}]{geller:13b}\n{Geller}, A.~M., {de Grijs}, R., {Li}, C.,  \\& {Hurley}, J.~R. 2013b, \\apj,\n  779, 30\n\n\\bibitem[\\protect\\citeauthoryear{{Geller} et~al.}{{Geller}\n  et~al.}{2015}]{geller:15}\n{Geller}, A.~M., {de Grijs}, R., {Li}, C.,  \\& {Hurley}, J.~R. 2015, \\apj, 805, 11\n\n\\bibitem[\\protect\\citeauthoryear{{Geller}, {Hurley}, \\& {Mathieu}}{{Geller}\n  et~al.}{2013a}]{geller:13a}\n{Geller}, A.~M., {Hurley}, J.~R.,  \\& {Mathieu}, R.~D. 2013a, \\aj, 145, 8\n\n\\bibitem[\\protect\\citeauthoryear{{Geller} \\& {Mathieu}}{{Geller} \\&\n  {Mathieu}}{2012}]{geller:12}\n{Geller}, A.~M.,  \\& {Mathieu}, R.~D. 2012, \\aj, 144, 54\n\n\\bibitem[\\protect\\citeauthoryear{{Geller} \\& {Leigh}}{{Geller} \\&\n  {Leigh}}{2015}]{geller15b}\n{Geller}, A.~M.,  \\& {Leigh}, N.~W.~C. 2015, \\apjl, 808, 25\n\n\\bibitem[\\protect\\citeauthoryear{{Geller} et~al.}{{Geller}\n  et~al.}{2010}]{geller:10}\n{Geller}, A.~M., et al.\\\n\n\n2010, \\aj, 139, 1383\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Heggie}}{{Heggie}}{1975}]{heggie:75}\n{Heggie}, D.~C. 1975, \\mnras, 173, 729\n\n\\bibitem[\\protect\\citeauthoryear{{Hills}}{{Hills}}{1975}]{hills:75}\n{Hills}, J.~G. 1975, \\aj, 80, 809\n\n\\bibitem[\\protect\\citeauthoryear{{Hurley}, {Aarseth}, \\& {Shara}}{{Hurley}\n  et~al.}{2007}]{hurley:07}\n{Hurley}, J.~R., {Aarseth}, S.~J.,  \\& {Shara}, M.~M. 2007, \\apj, 665, 707\n\n\\bibitem[\\protect\\citeauthoryear{{Hut}}{{Hut}}{1983}]{hut:83a}\n{Hut}, P. 1983, \\apjl, 272, L29\n\n\\bibitem[\\protect\\citeauthoryear{{Hut} \\& {Bahcall}}{{Hut} \\&\n  {Bahcall}}{1983}]{hut:83b}\n{Hut}, P.,  \\& {Bahcall}, J.~N. 1983, \\apj, 268, 319\n\n\\bibitem[\\protect\\citeauthoryear{{Hypki} \\& {Giersz}}{{Hypki} \\&\n  {Giersz}}{2013}]{hypki:13}\n{Hypki}, A.,  \\& {Giersz}, M. 2013, \\mnras, 429, 1221\n\n\\bibitem[\\protect\\citeauthoryear{{Ivanova} et~al.}{{Ivanova}\n  et~al.}{2005}]{ivanova:05}\n{Ivanova}, N., {Belczynski}, K., {Fregeau}, J.~M.,  \\& {Rasio}, F.~A. 2005,\n  \\mnras, 358, 572\n\n\\bibitem[\\protect\\citeauthoryear{{Joshi}, {Rasio}, \\& {Portegies\n  Zwart}}{{Joshi} et~al.}{2000}]{joshi:00}\n{Joshi}, K.~J., {Rasio}, F.~A.,  \\& {Portegies Zwart}, S. 2000, \\apj, 540, 969\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Kroupa}, {Tout}, \\& {Gilmore}}{{Kroupa}\n  et~al.}{1993}]{kroupa:93}\n{Kroupa}, P., {Tout}, C.~A.,  \\& {Gilmore}, G. 1993, \\mnras, 262, 545\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Leigh} \\& {Geller}}{{Leigh} \\&\n  {Geller}}{2012}]{leigh:12}\n{Leigh}, N.,  \\& {Geller}, A.~M. 2012, \\mnras, 425, 2369\n\n\\bibitem[\\protect\\citeauthoryear{{Leigh} \\& {Sills}}{{Leigh} \\&\n  {Sills}}{2011}]{leigh:11}\n{Leigh}, N.,  \\& {Sills}, A. 2011, \\mnras, 410, 2370\n\n\\bibitem[\\protect\\citeauthoryear{{Leigh} \\& {Geller}}{{Leigh} \\&\n  {Geller}}{2013}]{leigh:13}\n{Leigh}, N.~W.~C.,  \\& {Geller}, A.~M. 2013, \\mnras, 432, 2474\n\n\\bibitem[\\protect\\citeauthoryear{{Leigh} \\& {Geller}}{{Leigh} \\&\n  {Geller}}{2015}]{leigh:15}\n{Leigh}, N.~W.~C.,  \\& {Geller}, A.~M. 2015, \\mnras, 450, 1724\n\n\\bibitem[\\protect\\citeauthoryear{{Leigh} et~al.}{{Leigh}\n  et~al.}{2015}]{leigh:15b}\n{Leigh}, N.~W.~C., et al.\\\n\n\n2015, \\mnras, 446, 226\n\n\\bibitem[\\protect\\citeauthoryear{{Leonard}}{{Leonard}}{1989}]{leonard:89}\n{Leonard}, P.~J.~T. 1989, \\aj, 98, 217\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Marks}, {Kroupa}, \\& {Oh}}{{Marks}\n  et~al.}{2011}]{marks:11}\n{Marks}, M., {Kroupa}, P.,  \\& {Oh}, S. 2011, \\mnras, 417, 1684\n\n\\bibitem[\\protect\\citeauthoryear{{Nelemans} et~al.}{{Nelemans} \n  et~al.}{2001}]{nelemans01}\n{Nelemans}, G., {Yungelson}, L.~R., {Portegies Zwart}, S.~F., {Verbunt}, F. 2001, A\\&A, 365, 491\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Plummer}}{{Plummer}}{1911}]{plummer:11}\n{Plummer}, H.~C. 1911, \\mnras, 71, 460\n\n\\bibitem[\\protect\\citeauthoryear{{Portegies Zwart} \\& {Verbunt}}{{Portegies Zwart} \\& {Verbunt}}{1996}]{portegieszwart96} \n{Portegies Zwart}, S.~F., {Verbunt}, F. 1996, A\\&A, 309, 179\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{{Raghavan} et~al.}{{Raghavan}\n  et~al.}{2010}]{raghavan:10}\n{Raghavan}, D., et~al. 2010, \\apjs, 190, 1\n\n\\bibitem[\\protect\\citeauthoryear{{Sigurdsson} \\& {Phinney}}{{Sigurdsson} \\& {Phinney}}{1993}]{sigurdsson93} \n{Sigurdsson}, S., {Phinney}, E.~S. 1993, \\apj, 415, 631\n\n\\bibitem[\\protect\\citeauthoryear{{Spurzem} \\& {Giersz}}{{Spurzem} \\&\n  {Giersz}}{1996}]{spurzem:96}\n{Spurzem}, R.,  \\& {Giersz}, M. 1996, \\mnras, 283, 805\n\n\\bibitem[\\protect\\citeauthoryear{{Toonen}, {Nelemans}, \\& {Portegies Zwart}}{{Toonen}, et~al.}{2012}]{toonen12}\n{Toonen}, S., {Nelemans}, G., {Portegies Zwart}, S. 2012, A\\&A, 546, 70\n\n\\bibitem[\\protect\\citeauthoryear{{Toonen} et~al.}{{Toonen}, et~al.}{2014}]{toonen14}\n{Toonen}, S., {Claeys}, J.~S.~W., {Mennekens}, N., {Ruiter}, A.~J. 2014, A\\&A, 562, 14\n\n\\bibitem[\\protect\\citeauthoryear{{Tout} et~al.}{{Tout} et~al.}{1996}]{tout:96}\n{Tout}, C.~A., {Pols}, O.~R., {Eggleton}, P.~P.,  \\& {Han}, Z. 1996, \\mnras,\n  281, 257\n\n\\bibitem[\\protect\\citeauthoryear{{Vasiliev}}{{Vasiliev}}{2015}]{vasiliev:15}\n{Vasiliev}, E. 2015, \\mnras, 446, 3150\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 22955, "prevtext": "\nHere, $m$ is the mean single star mass in the cluster and $v_\\text{inf}$ is the relative velocity at infinity.  We perform $10^4$ numerical scattering experiments for every choice of the impact parameter.  All stars are assumed to be point particles with masses of 1{M$_{\\odot}$}.  The initial binary semi-major axis and eccentricity are 1 AU and 0, respectively.  The incoming velocity at infinity is set to $v_\\text{inf} = 5$ km/s.  \n\nThe results of these scattering experiments are illustrated in Figure~\\ref{fig:fig3}, which shows the mean (absolute) change in the binary semi-major axis and eccentricity for all simulations, as a function of the impact parameter.  We assume here that a fly-by encounter ``interrupts'' a given binary undergoing MT if either of the two following criteria are met: 1) the change in semi-major axis $|\\Delta{a}|$ is greater than or equal to the typical stellar radius at the onset of Roche lobe overflow ($\\sim$ 1 R$_{\\odot}$ for most binaries), and/or 2) the change in eccentricity $|\\Delta{e}|$ corresponds to a change in the quantity $r_\\text{p} - r_\\text{a}$ that is greater than or equal to the typical stellar radius at the onset of MT, where $r_\\text{p}$ and $r_\\text{a}$ are the pericenter and apocenter distances, respectively, from the binary center of mass.  We assume that the magnitude of such a perturbation is sufficiently large to at least temporarily halt the MT process (provided $\\Delta{a} > 0$ and/or $\\Delta{e} < 0$).    \n\n\nAs shown in Figure~\\ref{fig:fig3}, the perturbative effects of fly-bys remain significant for b $\\lesssim$ 1.5$b_\\text{0}$.\n\n\nMoreover, both $\\left|\\Delta{a}\\right|$ and $\\left|\\Delta{e}\\right|$ undergo a steep drop-off between b $=$ 1$b_\\text{0}$ and b $=$ 2$b_\\text{0}$, such that neither of our criteria for a ``significant'' perturbation are satisfied \nfor b $\\gtrsim$ 1.5$b_\\text{0}$.  Our analytic estimates for the 1+2 and 2+2 encounter rates are directly proportional to the gravitationally-focused cross-section $\\sigma_\\text{gf} \\propto {\\pi}b^2$, for some \nimpact parameter b.  Hence, if fly-bys are included, the time-scales for 1+2 and 2+2 encounters should each decrease by a factor $\\lesssim 1.5^2 \\sim 2.1$, as should $t_\\text{e}$.  Working from Equation~\\ref{eqn:poisson}, we find that the probabilities typically increase by a corresponding factor of $\\sim$ 2.  That is, the ratio between the probabilities calculated with and without this additional factor of $\\sim$ 2.1 in our estimate for $t_\\text{e}$ peak at a value of $\\sim$ 2 with very little scatter. \n\n\nThe fraction of binaries expected to be interrupted during MT can be estimated from the probability distributions presented in Figure~\\ref{fig:fig2}.  To do so, we integrate the probability distributions in Figure~\\ref{fig:fig2} and divide by the total number of binaries.  The resulting fractions are $f_\\text{i} \\sim$ 0.18, 0.10, 0.03 and 0.01 for our model clusters with $M_\\text{cl}$[{M$_{\\odot}$}] $=$  10$^3$, 10$^4$, 10$^5$ and 10$^6$, respectively, and a metallicity Z $=$ 0.02.  These fractions remain the same to within $\\pm 1$\\% for a metallicity Z $=$ 0.0006.  As shown in Figure~\\ref{fig:fig4}, the mean mass transfer duration is $\\sim$ 10$^{5.5}$ years during the first 1 Gyr of cluster evolution, then quickly increases by roughly an order of magnitude.  After this, the mean MT duration slightly and slowly decreases over the next $\\sim$ 12 Gyr, but remains much larger than during the initial 1 Gyr.  Hence, if the initial 1 Gyr of the cluster lifetime is excluded from our calculation for the fraction of binaries expected to be interrupted during MT, these estimates increase by a factor $\\sim$ 2.\\footnote{Note that the final increase in the mean duration of mass transfer at $\\sim$ 13 Gyr seen for the Z $=$ 0.0006 case should be regarded with caution.  This is due in part to small number statistics, and the presence of a handful of binaries with unusually long MT durations at late times.  This is not visible in the error bars, since we are showing the standard error of the mean here, and the number of binaries included in this calculation is large.  Perhaps more importantly, these error bars do not reflect any inherent uncertainties in the \\texttt{SeBa} code and binary evolution in general, which are certainly non-negligible.}  These fractions correspond approximately to upper limits, since we adopt the mean orbital separation at the hard-soft boundary when calculating the 2+2 encounter time.  If we adopt instead the mean orbital separation \\textit{below} the hard-soft boundary (which does not include the presence of soft binaries), these fractions decrease by a factor of a few (of the same order as the increase from including fly-bys).\n\n\n\nFrom these fractions, we can also estimate the number of binaries that are expected to be directly interrupted during ongoing stable MT:\n\n", "index": 9, "text": "\\begin{equation}\n\\label{nbin}\nN_\\text{bin,i} = N_\\text{bin}f_\\text{MT}f_\\text{i}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"N_{\\text{bin,i}}=N_{\\text{bin}}f_{\\text{MT}}f_{\\text{i}},\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mtext>bin,i</mtext></msub><mo>=</mo><mrow><msub><mi>N</mi><mtext>bin</mtext></msub><mo>⁢</mo><msub><mi>f</mi><mtext>MT</mtext></msub><mo>⁢</mo><msub><mi>f</mi><mtext>i</mtext></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]