[{"file": "1601.04002.tex", "nexttext": "\nIn the above equation $m_i$, $m_{proj}$ are the rest masses of the breakup products and the projectile respectively.\n$\\beta_i$, $\\beta_j$, $\\gamma_i$, $\\gamma_j$ are the velocities and  Lorentz factors of the reaction products respectively.\n $\\theta_{ij}$ represents the angle between the reaction products i.e. reaction fragment and the breakup neutron in the present experiment.\n$E_{\\gamma}$ is the excitation of the core of the projectile measured with the help of the crystal ball detector.\n\nThe excitation energy $E^*$ of  $^{29,30}$Na were measured  using Pb and C targets.  The background contributions due to the reactions induced  by the\nmaterials of the detectors  and air column were determined from the data taken without any  target and  this background data were subsequently \nsubtracted from the data of Pb and C target. \n Figure \\ref{29na} (top)  shows reaction yields of one neutron breakup against the excitation energy of  $^{29}$Na  using Pb-target (filled circle) and\n without any target (filled triangle).\nSimilarly,  Figure \\ref{30na} (top)  shows the reaction yields of one neutron breakup against $^{30}$Na  using Pb-target (filled circle) and without any target\n (filled triangle). The Coulomb dissociation (CD) cross section  of those neutron-rich nuclei using the $^{208}$Pb  target  (2.0 g/cm$^2$)  was determined  after \nsubtracting the nuclear contribution which was obtained  from the data with a $^{12}C$ target (0.9 g/cm$^2$) with  proper scaling factor \\cite{soft} (1.8).\nWith change of scaling factor of  10$\\%$, the total cross-section of CD would change 1.4$\\%$.\nFilled circle, triangle and square in the lower panel of  Figure \\ref{29na} and  Figure \\ref{30na}, respectively show one neutron breakup reaction cross-section\nof $^{29,30}$Na,  for Pb-target (Coulomb and nuclear),  C-target (nuclear) and  pure Coulomb part from Pb target,  respectively.\nThe CD cross section  for different core excited states can be further differentiated experimentally by the coincidence observation of\nthe characteristic $\\gamma$-ray  of the core fragments with the  fragments and neutron \\cite{ref e}. The excitation energy of the\nexcited  core state can be obtained from  $\\gamma$-energy sum spectra. The detection efficiencies of the NaI detectors  for \n detecting the $\\gamma$-rays under the  experimental conditions were estimated by GEANT simulations.\n\n\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=12cm]{2panel_29na.eps}\n\n\\caption{(Top) The yields of one neutron breakup reaction against excitation energy  of $^{29}$Na  using Pb target and without any target   \nhave been represented by filled circles and  triangles, respectively.\n(bottom) One neutron breakup cross-sections against excitation energy of $^{29}$Na  using  Pb-target (Coulomb+nuclear), C-target(nuclear) and\n pure Coulomb of Pb have been denoted by circles, triangles and squares, respectively.}\n\\label{29na} \n\\end{figure}\n\n\\begin{figure} \n\\centering\n \\includegraphics[width=12cm]{30Na_2panelr.eps}\n\\caption{(Top) The yields of  one neutron breakup reaction against excitation energy of $^{30}$Na for Pb target and without any target   \nhave been represented by filled circles and  triangles, respectively.\n(bottom) One neutron breakup cross-sections against excitation energy of $^{30}$Na using  Pb-target (Coulomb + nuclear), C-target (nuclear) and\n pure Coulomb part have been denoted by circles, triangles and squares, respectively.}\n\\label{30na}\n\\end{figure}\n\nThe measured invariant mass spectra  have been analyzed using the direct breakup model. The neutron-rich nucleus around N = 20,  \nhas been considered as a combination of the  core and a loosely bound valence neutron which may occupy one or more \norbitals e.g. $s$, $d$, $p$ etc.. \nWhen the  projectile passes by a high Z target it  may be excited by absorbing the  virtual photons from the time dependent Coulomb \nfield \\cite{bar88}. The tail part of the wave-function of the  loosely bound neutron is highly sensitive to this virtual photon.   \nHence due to this interaction the valence neutron moves from bound state to the continuum, while core behaves as a spectator.\nThus the nucleus breaks up into a neutron and the core. The electromagnetic breakup of loosely bound nuclei in energetic \nheavy ion collisions is dominated by dipole excitation due to smaller effective charge for higher multi-polarities \\cite{bar01}.\nThus one neutron removal differential Coulomb dissociation cross section (CD)  for dipole excitations d$\\sigma$/dE${^*}$ \ndecomposes into an incoherent sum of components   d$\\sigma (I^{\\pi}_c$)/dE$^{*}$ corresponding to different core states \n$(I^{\\pi}_c)$, populated after one neutron removal.\n For each core state, the cross-section further decomposes into incoherent sum over contribution\nfrom different angular momenta j of the valence neutron in its initial state. Thus differential  cross-section  of  $^{29,30}$Na \ncan be expressed through the following equation \\cite{ref e}:\n\n\n", "itemtype": "equation", "pos": 13386, "prevtext": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\title{Coulomb breakup  of neutron-rich $^{29,30}$Na isotopes near the island of inversion}\n\n\n\\author[1]{A . Rahaman}\n\\author[1,2]{ Ushasi Datta\\thanks{corresponding:ushasi.dattapramanik@saha.ac.in}}\n\\author[2,3]{T. Aumann}\n\\author[4]{S. Beceiro-Novo}\n\\author[2]{K. Boretzky}\n\\author[2]{C. Caesar}\n\\author[5]{B.V. Carlson}\n\\author[6]{W.N. Catford}\n\\author[1]{S. Chakraborty}\n\\author[7]{M. Chartier}\n\\author[4]{D. Cortina-Gil}\n\\author[8]{G. De. Angelis}\n\\author[2,9]{D. Gonzalez-Diaz}\n\\author[2]{H. Emling}\n\\author[4]{P. Diaz Fernandez}\n\\author[10]{L.M. Fraile}\n\\author[2]{O. Ershova}\n\\author[2,11]{H. Geissel}\n\\author[12]{B. Jonson}\n\\author[12]{H. Johansson}\n\\author[13]{N. Kalantar-Nayestanaki}\n\\author[14]{R. Kr\\\"ucken}\n\\author[14]{T. Kr\\\"oll}\n\\author[2]{J. Kurcewicz}\n\\author[2]{C. Langer}\n\\author[14]{T.Le Bleis}\n\\author[2]{Y. Leifels}\n\\author[2]{G. M\\\"unzenberg}\n\\author[2]{J. Marganiec}\n\\author[12]{T. Nilsson}\n\\author[2]{C. Nociforo}\n\\author[15]{F. Nowacki}\n\\author[13]{A. Najafi}\n\\author[2]{V. Panin}\n\\author[3]{S. Paschalis}\n\\author[2]{R. Plag}\n\\author[16]{A. Poves}\n\\author[1]{I. Ray}\n\\author[2]{R. Reifarth}\n\\author[13]{C. Rigollet}\n\\author[2]{V. Ricciardi}\n\\author[2]{D. Rossi}\n\\author[3]{H. Scheit}\n\\author[2]{H. Simon}\n\\author[2,11]{C. Scheidenberger}\n\\author[2]{S. Typel}\n\\author[7]{J. Taylor}\n\\author[17]{Y. Togano}\n\\author[3]{V. Volkov}\n\\author[2]{H. Weick}\n\\author[18]{A. Wagner}\n\\author[2]{F. Wamers}\n\\author[2]{M. Weigand}\n\\author[2]{J.S. Winfield}\n\\author[18]{D. Yakorev}\n\\author[2]{M. Zoric}\n\n\n\\affil[1]{Saha Institute of Nuclear Physics, Kolkata 700064, India}\n\\affil[2]{GSI Helmholtzzentrum fur Schwerionenforschung GmbH, D-64291 Darmstadt, Germany}\n\\affil[3]{Technische Universitat Darmstadt, 64289 Darmstadt, Germany}\n\\affil[4]{Universidade de Santiago de Compostela, 15706 Santiago de Compostela, Spain}\n\\affil[5]{Instituto Tecnologico de Aeronautica, Sao jose dos Campus, Brazil}\n\\affil[6]{University of Surrey, Guildford GU2 5XH, United Kingdom}\n\\affil[7]{University of Liverpool, Liverpool L69 7ZE, United Kingdom}\n\\affil[8]{INFN, Legnaro, Italy}\n\\affil[9]{Zaragoza University, 50009 Zaragoza, Spain}\n\\affil[10]{Universidad Complutense de  Madrid, CEI Moncloa, E-28040 Madrid, Spain}\n\\affil[11]{II. Physikalisches Institut, D-35392 Giessen}\n\\affil[12]{Fundamental Fysik, Chalmers Tekniska Hogskola, S-412 96 Goteborg, Sweden}\n\\affil[13]{KVI-CART, University of Groningen, Groningen, The Netherlands}\n\\affil[14]{Physik Department E12, Technische Universit\\\"at M\\\"unchen, 85748 Garching, Germany}\n\\affil[15]{IN2P3-CNRS et Univ. Luis Pastour, Stasbourg, France}\n\\affil[16]{Universidad Autonoma de Madrid, E-28049 Madrid Spain}\n\\affil[17]{The Institute of Physical and Chemical Research (RIKEN), Japan}\n\\affil[18]{Helmholtz-Zentrum Dresden-Rossendorf, D-01328 Dresden, Germany}\n\n\n\n\n\n\n\\date{\\today}\n\n\\maketitle\n\n\n\\begin{abstract}\nFirst results are reported  on the ground state configurations of the neutron-rich $^{29,30}$Na isotopes, obtained via  \nCoulomb dissociation (CD) measurements as a method of the direct probe. The  invariant mass spectra of those nuclei have been \nobtained through  measurement of  the four-momentum of all decay products after Coulomb excitation on a  $^{208}Pb$ target at\nenergies  of 400-430 MeV/nucleon using FRS-ALADIN-LAND setup at GSI, Darmstadt. Integrated Coulomb-dissociation cross-sections  (CD) \n of  89 $(7)$ mb and 167 $(13)$ mb up to excitation energy of 10 MeV  for one neutron removal from $^{29}$Na and $^{30}$Na respectively,\n have been extracted. The major part of one neutron removal,  CD cross-sections  of those nuclei populate core, in its' ground state.\nA comparison  with the direct breakup model,  suggests the predominant occupation of the valence neutron in the ground state of \n $^{29}$Na${(3/2^+)}$ and $^{30}$Na${(2^+)}$ is  the $d$ orbital with small contribution in the $s$-orbital  which are   coupled with \nground state of the core. The  ground state configurations of these nuclei are  as $^{28}$Na$_{gs}(1^+)\\otimes\\nu_{s,d}$ and \n$^{29}$Na$_{gs}(3/2^+)\\otimes\\nu_{ s,d}$, respectively. The ground state spin and  parity of these nuclei, obtained from this experiment\n are in agreement with earlier reported values. The spectroscopic factors for the valence neutron occupying the $s$ and $d$ \norbitals for these nuclei in the ground state have been  extracted and reported for the first time. A comparison of the experimental \nfindings with the shell model calculation using MCSM suggests a lower limit of around 4.3 MeV of the sd-pf shell gap in $^{30}$Na. \n\\end{abstract}\n\n\n\n\n\\vspace{2pc}\n\\noindent{\\it Keywords}:  neutron-rich nuclei, island of inversion, radioactive ion beam, Coulomb breakup, ground state configuration, spectroscopic factor\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\\label{}\nThe magic numbers  \\cite{my49,jn49} of the nuclei are a benchmark of nuclear structure.\nThe underlying shell gap is the characteristic of the mean nuclear field  which\nconsists of many ingredients of the nucleon-nucleon interactions. \nThe modification in the shell gaps through the effects such as the tensor component of the NN force become \npronounced with large neutron-proton asymmetries in the exotic nuclei far away from stability.\n These lead to the disappearance of established magic numbers and the appearance of new ones.\nThe first observation of the disappearance of the magic number (N=20) was reported,  based on the mass measurements in  \nthe neutron rich $^{31,32}$Na  \\cite{Ref a}. The experimental observation of the higher binding energies \n of these nuclei is a direct consequence of the large deformation \\cite{Ref a}.  Later large deformation was also reported in\nthe ground state of $^{32}$Mg \\cite{Ref b}. This large deformation was explained by considering the intruder effects \nwhich suggests a clear vanishing of the shell gap  between $sd$ and $pf$ shell around  N =$20$. \nThe N=$20$ isotones with Z$\\sim 10-12$ are considered to belong to the ``island of inversion''  \n\\cite{Ref warburton} where the intruder configurations  dominate the ground state wave function.\nOtsuka et al. considered  strongly attractive monopole interaction of the tensor  force  to describe the shell evolution for \nseveral nuclei \\cite{Ref otsuka}.The attractive $T=0$ monopole interaction between the \n$\\pi$$d_{5/2}$ and $\\nu d_{3/2}$ orbits changes the size of the $N =20$ effective energy gap as the protons fill the $d_{5/2}$ orbitals.\\\\\nThe availability of radioactive ion beams provides an unique opportunity to study the evolution  of the shell structure of the nuclei\nfar away from the $\\beta$-stability line and many experimental observations on the non magicity behavior of \nthe neutron-rich nuclei around 'classic' magic number have been reported.   It is of particular interest to\n understand the shell evolution for the nuclei where transition from the normal ground state configuration\nto the intruder dominated  ground state configuration occurs. The experimental studies in this direction may provide a stringent test for\nthe validation of various theoretical predictions of the nucleon-nucleon interactions. In other words, to understand change of\n nucleon-nucleon interaction, with iso-spin quantum number, the key ingredients are experimental information on ground state configuration \nof these transition nuclei.  So far several studies have been performed  using different techniques to investigate this region \n\\cite{Ref utsuno,Ref c,Ref hurst,mach,Ref tripathi1,Ref tripathi2,doo13}. Though it is established that  valence neutron(s) \nin the ground state of the neutron-rich Na, Mg, Ne isotopes at N = 20, are occupying pf intruder orbitals, but it is not well\n established for the neighboring nuclei. The ground state configuration of transitional nuclei from normal \nto ``island of inversion'' and experimental information for  the transitional nuclei  are often contradictory to each other. \nTerry et al. \\cite{terry} observed $pf$ orbital occupation of valence neutron in the ground state of  neutron-rich $^{28,30}$Ne \n(N=18, 20) via  knockout measurements. However, the situation is different  for $^{30}$Mg (N=18). Both knockout \\cite{mg1} and\n Coulomb excitation data \\cite{mg2} are in agreement  with $sd$-shell ground state configuration of this nucleus.\n No detailed ground state configurations of $^{29,30}$Na (N=18,19)  is available in the literature.    \n The low-energy level structure of the exotic   $^{28,29}$Na isotopes have been investigated through \n$\\beta$-delayed $\\gamma$ spectroscopy \\cite{Ref tripathi1} and the authors proposed that around $\\sim$ 42 $\\%$ intruder configuration\n  in the ground state of $^{29}$Na \\cite{Ref utsuno} is necessary to explain experimental data. \nSeveral theoretical model calculations and experimental results \\cite{Ref utsuno, Ref c, Ref hurst, Ref tripathi1,Ref tripathi2,isol} suggest \na significant reduction  of the $sd-pf$ shell gap and the ground state of  $^{29,30}$Na are   dominated by intruder states.\n $^{30}$Na has been investigated using Coulomb excitation at the intermediate energies\n\\cite{Ref c} and  transition probability $B(E2: 2^+\\rightarrow 3^+) = 147(21)$ $e^2$ $fm^4$ was reported.\n The Knockout reaction by Tajes et al. \\cite{taj} showed that the momentum distributions of both $^{29,30}$Na are almost identical  \n(137 MeV/c and 130 MeV/c respectively) although $^{29}$Na (S$_n$ = 4.4 MeV) is much deeply bound than $^{30}$Na (S$_n$ = 2.27 MeV). \nThis unconventional experimental observation  encourage for more experimental investigation.\n An experimental program (GSI:s306) has been initiated to explore the ground state configurations of the  neutron-rich nuclei\n around N $\\sim$ 20 via direct probes at GSI, Darmstadt. The Coulomb break up is a direct method to probe the quantum number \nof the valence nucleon of loosely  bound nuclei \\cite{ref e, Ref f,udp,dat2}. \nIn this letter, first results on wave-function decompositions of  the ground state of $^{29,30}$Na, studied  via Coulomb breakup,   \nare being reported.\n\n\\section{Experiment}\n\\label{}\n\n The secondary beam containing  $^{29,30}$Na isotopes along with others were populated by fragmentation of the $^{40}$Ar\n primary beam with energy 540 MeV/nucleon and separated  at FRS \\cite{frs}.  The incoming projectiles were \n identified event-by-event  by measuring the magnetic rigidity,  time of flight and relative energy loss of the exotic nuclei.\nThe incoming beam-identification plot  is shown in Figure \\ref{inc1}. The beam intensity of $^{29,30}$Na were around 14$\\% , \n5.5\\%$ respectively, of total incoming beam.\n\n \n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=9cm]{inc1.eps}\n\\caption{Identification plot for mixed radioactive beam impinging on secondary targets.}\n\\label{inc1}\n\\end{figure}\n\n The secondary beam  (Figure \\ref{inc1}) was  transported to the experimental site, \na neighboring cave C where the complete kinematic measurements were performed using  the FRS-ALADIN-LAND setup.\n The position of the  incoming beam before the secondary target and  the position of the reaction fragments after the target \n were accurately measured using double sided Silicon strip detectors (DSSD). The target was surrounded by\n162 NaI(Tl) detectors \\cite{metag}, which cover almost $4\\pi$ solid angle. This detector-array was used for detecting the\n $\\gamma$-rays from the excited core of the projectile after the Coulomb breakup.\n After reaction at the secondary target the reaction fragments as well as the unreacted beam were bent by a Large Dipole \nMagnet (ALADIN) and ultimately were detected at the time of flight\nwall detector (TFW) via two scintillator detectors  GFI \\cite{gfi1,gfi}. Out going fragments charge distribution\ncan be obtained  through the energy loss at TOF and silicon strip detector (DSSD). Figure \\ref{outz} shows the charge distribution\nof out going fragments. The decay product, neutrons were forward focused due to Lorentz boost and  detected by the Large Area \nNeutron Detector (LAND) \\cite{land}  for the time of flight and position measurements.\n The reaction fragments were bent at different angles inside ALADIN depending on their  charge to mass ratios.\n This relative deflection angle was measured using the GFI detectors placed at two different distances at an angle of $15^0$ from the\noriginal beam direction after the ALADIN. The mass of  the outgoing reaction fragments was reconstructed\nusing the deflection angles measured from GFI, the energy loss at TFW, and the time of flight measurement\nof the reaction fragments. Figure \\ref{outmass} represents the  mass  of the outgoing fragment against velocity, after one neutron breakup\nof $^{29}$Na.   For details of the experimental setup and detector calibration\n see \\cite{anisur, ceser} and references therein.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=9cm]{SST_TFW_outZ.eps}\n\\caption{Outgoing fragments charge distribution}\n\\label{outz}\n\\end{figure}\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=9cm]{outmass_29na_1.eps}\n\n\\caption{Outgoing fragments mass identification plot after one neutron breakup of $^{29}$Na  beam on a lead target.}\n\\label{outmass}\n\\end{figure}\n\\section{Analysis}\n\\label{}\n\nIn this experiment the excitation energy $E^*$ of  $^{29,30}$Na  are  determined by measuring four momenta of all the decay products\nof those nuclei  after breakup \\cite{ref e, Ref f}.  \n\n\n", "index": 1, "text": "\\begin{equation}\n\nE^*=\\sqrt{\\sum{m_i^2}+\\displaystyle\\sum_{i\\ne j}{\\gamma_i\\gamma_j m_i m_j(1-\\beta_i \\beta_j cos\\theta_{ij})}}+E_\\gamma - m_{proj}\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\par&#10; E^{*}=\\sqrt{\\sum{m_{i}^{2}}+\\displaystyle\\sum_{i\\neq j}{\\gamma_{i}\\gamma%&#10;_{j}m_{i}m_{j}(1-\\beta_{i}\\beta_{j}cos\\theta_{ij})}}+E_{\\gamma}-m_{proj}\\par&#10;\" display=\"block\"><mrow><msup><mi>E</mi><mo>*</mo></msup><mo>=</mo><mrow><mrow><msqrt><mrow><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msubsup><mi>m</mi><mi>i</mi><mn>2</mn></msubsup></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>≠</mo><mi>j</mi></mrow></munder><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>γ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>m</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>m</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>β</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>β</mi><mi>j</mi></msub><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><msub><mi>θ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></msqrt><mo>+</mo><msub><mi>E</mi><mi>γ</mi></msub></mrow><mo>-</mo><msub><mi>m</mi><mrow><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04002.tex", "nexttext": "\n\nHere, $N_{E1}(E^*)$ is the number of virtual photons as a function of excitation energy E* which can be computed\n adapting a semi-classical approximation \\cite{bar88}. $\\psi_{nlj}(r)$ and $<q|$ represent the single-particle wave \nfunction of the valence neutron in the projectile ground state (before breakup) and the final state wave-function of \nthe valence neutron in the continuum (after breakup), respectively. The wave function of the out going neutron\n in the continuum is considered as a plane wave. $C^2S(I^{\\pi}_c,nlj)$ represents the spectroscopic factor of \nthe valence neutron  with respect to a particular core state $I^{\\pi}_c$.\n\n Eq. (2) indicates that the dipole strength distribution is very sensitive to the single-particle wave\nfunction which in turn depends on the orbital angular momentum and the binding energy of the valence neutron.\nThus, by comparing the experimental Coulomb dissociation cross section with the calculated one, information\non the ground state properties such as the orbital angular momentum of the valence nucleon and the corresponding\nspectroscopic factor may be gained. The core state to which the neutron is coupled can be identified by\n the characteristic $\\gamma$ -decay of the core after releasing the valence neutron. The\nCoulomb breakup cross section which leaves the core in its ground state is obtained from the difference\nbetween the total cross section and the excited-state(s) contribution(s).\n\nIn order to compare the experimental result with the  calculated data, one needs to convolute the instrumental\nresponse function with the later. The instrumental response for a given value of E$^*$ has Gaussian distribution to a good\napproximation \\cite{Ref const, Ref noci, pal}. The results of all the calculations,  shown in this article,  are\nconvoluted with the  response function. \\\\\n\n\n\\begin{figure*}[h]\n\\includegraphics[width=16 cm]{fig4_dec15.eps}\n\\caption{\\label{all_fit}\n(a-b)Experimental differential pure Coulomb dissociation cross-section of $^{29}$Na, breakup into $^{28}$Na (gr.) and  one neutron. \n The solid line represents differential CD cross-section using  direct breakup model where valence neutron is occupying p-orbital, \nor combination of s and d-orbital, respectively. The dashed  and dotted-dashed line represent the calculated CD cross-section with valence neutron in $d$\nand $s$ orbital  with respective spectroscopic factors. (c-d) Experimental differential pure Coulomb dissociation cross-section  of $^{30}$Na  \nagainst excitation energy and the solid line represents    differential CD cross-section using  direct breakup model where the \n valence neutron is occupying  $p$-orbital, or combination of $s$ and $d$-orbital, respectively. The dashed  and dotted-dashed line \nrepresent the calculated CD cross-section with  $d$\nand $s$ wave components. The inset of every figures  show \nthe $\\chi^2/N$ of the fitting between experiment and calculated one  against the spectroscopic factor for the\n valence neutron of that orbital.}\n\\end{figure*}\n\n\n\\section{Result}\n\n The total Coulomb dissociation cross section for  $^{29}$Na into  $^{28}$Na and one neutron amounts to \n89 $( 7)$ mb, after  integration up to 10 MeV excitation energy. No resonance-like structure has been observed.\nThe data analysis for $^{29}$Na  shows that the major  part (â\u0088¼ 72$( 11)$ $\\%$) of the breakup cross section leaves \nthe core  $^{28}$Na in its ground state and approximately  ($\\sim$28( 5)$\\%$) of  the  fragments are found in the excited states which  could be \ndeduced from the invariant mass spectra,  obtained through coincidence of the  $\\gamma$-ray sum spectra with the \n core fragment (i.e., $^{28}$Na) and one neutron.  Left panel of the Figure \\ref{all_fit} shows the experimental  \n differential Coulomb dissociation cross section with  respect to the  excitation energy (E$^*$) of $^{29}$Na \n which breaks up into a neutron and a $^{28}$Na fragment in  its ground state  (filled circles). \nThe spectrum was obtained after subtracting  contribution due to the excited states from the total \ndifferential cross-section of pure Coulomb breakup of $^{29}$Na. \nThe valence neutron of $^{29}$Na  is sufficiently loosely bound (S$_n$ = 4.4 MeV) compared to valence \nproton (S$_p$ = 15.9 MeV). This nucleus can be considered as a core and loosely bound neutron and the \ncalculation for CD cross-section using the direct breakup model  \\cite{ref e}  have been performed using various valence\nneutron occupying orbitals. The out going neutron in the continuum is approximated by  a plane-wave.\n To understand the valence  neutron occupation orbital with probability, the experimental \nCoulomb Dissociation cross-section d$\\sigma (I^{\\pi}_c$)/dE$^{*}$ of $^{29}$Na  into  ground state of $^{28}$Na and \none neutron  have been  compared with direct breakup model calculation.  All experimental  d$\\sigma$/dE$^{*}$ distributions are \nshown in figures without  acceptance and efficiency corrections\n for the neutron detector. Instead, the calculated cross  sections were convoluted with the detector response \nobtained from detailed simulations.  \nComparison between the experimental data on Coulomb dissociation with\n direct breakup model calculation  using  $p$,  and combination of $s$ and $d$ orbital, respectively are shown \nin the figure \\ref{all_fit}a, \\ref{all_fit}b, respectively. The experimentally observed shape  of  the spectrum \nis in good agreement with the calculated one considering valence neutron  in $s$ and $d$ orbital. \nThe solid curve in the figure \\ref{all_fit}a, \\ref{all_fit}b represent the calculated d$\\sigma (I^{\\pi}_c$)/dE$^{*}$\n using the direct-breakup model with the valence neutron in the $p$ and  combination of $s$ and $d$ orbitals, respectively. \nThe inset of the  Figures \\ref{all_fit}a show  the $\\chi^2/N$ for fitting against the spectroscopic factors of \nthe valence neutron in p. The inset of the  Figure \\ref{all_fit}b, shows   three dimensional plot  of  the $\\chi^2/N$  \nfor fitting (z-axis in color shade) against the spectroscopic factors of the valence neutron in $s$, $d$ orbital (x and y axis).  \n It is evident from  Figure \\ref{all_fit}b that the best fit of the experimental data can be \nobtained with  calculation where the valence neutron is occupying  \n combination of $s$ and $d$ orbitals. The $\\chi^2/N$ for  the fit suggests that the neutron is \n occupying the  $s$ and $d$ orbitals with the spectroscopic factors 0.14 $(0.08)$ and 2.08 $( 0.3)$, \n respectively. The errors quoted in the spectroscopic factors are obtained from The $\\chi^2$  distribution and \nthe errors  are one sigma  i.e, within 68$\\%$  confidence limit.  \nThe dashed  and dotted-dashed line in Figure  \\ref{all_fit}b represent the calculated CD cross-section with \nvalence neutron in $d$ and $s$ orbital with above mentioned spectroscopic factors.\n\nThe total Coulomb dissociation cross section for  $^{30}$Na into  $^{29}$Na and a neutron amounts to 167 $( 13)$ mb,\nafter  integration  up  to 10 MeV excitation energy. No resonance-like structure has been observed.\n The data analysis for  $^{30}$Na shows that the major  part (â\u0088¼ 75 $( 10)\\%$) of the breakup cross section \nleaves the core  $^{29}$Na in its ground state and approximately  ($\\sim$25 (4)$\\%$) of  the  fragments are \nfound in the excited states.\n Right panel of figure \\ref{all_fit} shows the experimental   differential Coulomb dissociation cross section with \nrespect to the  excitation energy (E$^*$) of $^{30}$Na  breaking up into a neutron and a $^{29}$Na fragment in \nits ground state  (filled circles). This spectra was obtained after subtracting excited state contribution \nfrom the spectra of total differential cross-section of pure Coulomb breakup of $^{30}$Na. \nThe valence neutron of $^{30}$Na  is sufficiently loosely bound (S$_n$ = 2.37 MeV) compared to valence \nproton (S$_p$ = 17.0 MeV).  The experimental Coulomb Dissociation cross-section (d$\\sigma$/dE$^{*}$) of $^{30}$Na into \n ground state of $^{29}$Na and one neutron  have been  compared with direct breakup model \ncalculation   considering the  valence neutron in the $p$,  or combination of  $s$ and $d$ orbitals.\n Inset of the figure shows $\\chi^2$/N obtained  from fitting  with variation of spectroscopic factors.\nThe data can be well reproduced by a fit including contributions from the wave functions involving $l$ = 0 and $l$ = 2\nneutrons, as shown in Figure \\ref{all_fit}d. The inset of the Figure \\ref{all_fit}d shows\nspectroscopic factors  of  $s$ and $d$ orbital occupation of the valence neutron corresponding to\ndistribution  of the $\\chi^2/N$.  The spectroscopic factors obtained from the fit to the\ndata using the plane-wave approximation for the  neutrons occupying the $s$ and $d$ orbitals\nare 0.08 $(0.06)$ and 2.03 $( 0.3)$,  respectively.  The  dashed  and dotted-dashed line in Figure  \\ref{all_fit}d \nrepresent the calculated CD cross-section using the   valence neutron in $d$ and $s$ orbital with \n respective spectroscopic factors.\nThe ground state spin and parity of $^{30}$Na from this experimental results favor\n3/2$^+ \\otimes$1/2$^+$ i.e. either 2$^+$ or  1$^+$. \n\n\\begin{table*} \n\\centering\n \\caption{Coulomb dissociation cross sections of $^{29,30}$Na for  various core state and valence-neutron orbitals. \nCross sections  obtained from the direct-breakup model for neutrons occupying $s$ an $d$ orbitals with a spectroscopic\n factor of one are given for comparison. The cross sections are integrated up to 10 MeV for $^{29}$Na and $^{30}$Na. \nThe corresponding spectroscopic factors from shell-model calculations and the ones derived from the experiment \nare quoted in the last two columns.}\n\\vspace{5mm}\n \\label{tab:1}\n \\begin{tabular}{|cccccccccc|}\n\n \\hline\n&&&&&\\\\\nIsotope & Core  & Neutron  && \\multicolumn{2}{c}{Cross section (mb)} && \\multicolumn{3}{c}{Spectroscopic factor}\\\\\n        &state &   orbital   & & Theo. & Expt. & &Th-I& Th-II& Expt \\\\ \n        & $I^{\\pi}$    &   (E; [MeV])            &        & &         &           &&  USDB &sdpf-M\\\\\n&&&&&&&\\\\\n\\hline\n $^{29}Na$&  $1^+$ (0.0) &  &&&$64(8)$&&\\\\\n& & $1s$ && 89&            && &0.16&$0.14(0.08)$ \\\\\n&  & $0d$&&22& &&2.18&0.05&$2.08(0.3)$ \\\\\n&&&&&&&\\\\\n&1.0-3.2&&&&25($4$)&&\\\\\n\\hline\n&&&&\\\\\n$^{30}Na$&$3/2^+$ (0.0) &&& &$125(14)$ &   \\\\\n& & $1s$ && 205 & && &0.09& $0.08(0.06)$ \\\\\n& &  $0d$&& 56 & & &2.97&0.11 &$2.03(0.3)$\\\\\n&1.0-3.0&&&&42$(6)$&&&\\\\\n\\hline \n\\end{tabular}\n\\end{table*}\n\n\n\n\\section{Discussion}\n\\label{}\n\nThe ground state spin and parity of $^{29,30}$Na were measured by magnetic resonance \\cite{huber}. But no detailed \nmeasurement on  ground state configuration is available.  $\\gamma$-ray spectroscopy data \\cite{Ref hurst, Ref tripathi1,Ref tripathi2,isol}\n were interpreted  as  intruder dominated ground state configuration.  Present experimental \nCD cross sections of $^{29,30}$Na along with the  calculated  one from the direct breakup model\nhave been summarized in the table \\ref{tab:1}. The  Coulomb breakup calculation  are compared with\nthe experimental findings.  The dominant ground state configuration of  $^{29}$Na is $^{28}$Na$_{gs}(1^+)\\otimes\\nu_{s,d}$.\n The ground state spin and parity of $^{29}$Na from this experiment  favor 1$^+ \\otimes$1/2$^+$ i.e, either 3/2$^+$ or  1/2$^+$. \nA comparison between the spectroscopic factors obtained from this experimental data with shell model calculations  using \nvarious interaction have been presented in the   table \\ref{tab:1}. In USD-B calculation the valence space is composed of the \n$sd$ shell for both protons and  neutrons.  For $sdpf$-M,  the valence space is composed of the $sd$ shell for protons  and   \nallows mixing between   $sd$ and $pf$ shell orbitals for neutrons. The Hamiltonian has been recently introduced \\cite{er shell}. \nThe calculated spectroscopic factors are given in table \\ref{tab:1}.  Both USD-B \\cite{brown} shell model calculation, and  \nMCSM shell model calculations \\cite{Ref utsuno} favor 3/2$^+$ as the ground state spin and parity of $^{29}$Na. This is in agreement \nwith the earlier experimentally measured value \\cite{huber}. \nUtsuno et al., \\cite{Ref utsuno} showed that  the measured two neutron separation energy, magnetic and electric moments of\n$^{29}$Na can be  explained by both USD and $sdpf$-M. The excited core contributions in their ground state configuration are \naround $\\sim28(5)\\%$ as per our experimental  observation for  $^{29}$Na isotopes and  the core  excited state \ncontribution above 2.0 MeV is around 12$\\%$.  To a simple approximation, if this amount is considered  wholly due to  $2p-2h$ \nconfigurations, then according to MCSM \\cite{Ref utsuno} calculations, one can obtain  4.8 MeV as lower limit of the $sd-pf$ shell \ngap in $^{29}$Na. It is clear from Figure \\ref{all_fit}b that the experimental spectroscopic factor for the valence neutron in the $d$ \norbital coupled with $^{28}$Na$_{gs}(1^+)$ is  2.08 $( 0.3)$  and this is in good agreement with\nUSD-B shell model calculation (2.18).  Measured mass of $^{29}$Na can be explained by sd-shell model calculation \\cite{wild}.\n\n The ground state spin and parity of $^{30}$Na has been measured earlier as being 2$^+$ \\cite{huber} and this value can be reproduced by both \n USD \\cite{brown} shell model and MCSM shell model calculations \\cite{Ref utsuno}.  No experimental data on ground state configuration of \nthis nucleus is available.  To explain measured reduced matrix element of this isotope, it has been considered that the ground state is pure\ntwo-particle-two-hole deformed ground state \\cite{isol}. But  present experimental data favors  $^{29}Na_{gs}(3/2^+)\\otimes\\nu_{s,d}$ as \nmajor ground state configuration  of $^{30}$Na (N=19)  and  the core $^{29}$Na excited state contribution  i.e, particle hole \nconfigurations in the ground state is around 42 $(6)$ mb (25$(4)\\%$ of total CD cross-section). If it is  approximated that the excited \nstates contributions are  entirely due to  $2p-2h$ configurations then a comparison of our experimental findings with shell-model \ncalculation  using the MCSM  \\cite{Ref utsuno} suggests a  lower limit of $sd-pf$ shell gap, around 4.3 MeV in this nucleus.  \nFor the first time experimental  quantitative spectroscopic  factors of valence neutron in the $s$ and $d$ orbital   have been measured.\nUnlike, $^{29}$Na, for $^{30}$Na, the experimental spectroscopic  factor for occupation of $d$-orbital (2.03)\n deviates from $sd$-shell (USD-B) calculation (2.97).  Hence reduced spectroscopic factor of valence neutron occupying \n$d$-orbital could be due to particle hole configuration across the reduced sd-pf shell gap. \nSince ground state spin and parity of this neutron-rich nucleus is 2$^+$, the valence neutron occupying $pf$ orbital, should be coupled with \nnegative parity excited states of $^{29}$Na. So far very little is  known about the excited states of $^{29}$Na. On the other hand,\n Coulomb breakup cross-section using direct breakup model for valence neutron in f$_{7/2}$ orbital coupled with \ncore excited state of 1.5 MeV is around 21 mb and  it further reduced to 10 mb when coupled with 3.0 MeV \nexcited core state. When valence neutron is occupying $p$ orbital, the direct breakup model calculation for same situation is\n108 mb and 67 mb, respectively. Considering experimental excited state CD cross-section, 42 $( 6 )$mb, it may be possible\n that valence neutron across the shell gap is occupying either pure $f$  or $p$ orbital or mixing of $p$ and $f$ orbital.\n \nIn a nut-shell,  present experimental data of Coulomb breakup suggests that ground state properties of $^{29}$Na can be \nexplained by USD-B shell model calculation. But the situation is different for that of $^{30}$Na. The spectroscopic factor for \nvalence neutron in $d$ orbital is  almost 1/3 reduced compared to USD-B calculation. This could be tentatively, for particle\n hole configuration  across the shell gap and valence neutron may occupy either   $f$ or $p$ orbital or mixing of both $pf$ \norbital. Thus, it may be concluded that boundary of ``island of inversion'' has been started from $^{30}$Na, instead of $^{29}$Na. \nWildenthal et al. \\cite{wild}, showed that measured mass of $^{29}$Na  can be explained by USD shell model calculation  \n  but the same for  $^{30}$Na  was not fully reproduced by sd-shell model calculation.\nThe  measured B(E2; 2$^+ \\rightarrow 3^+)$  value  for  $^{30}$Na \\cite{Ref c, Ref cp} is  around 30$\\%$ lower\nthan the  value calculated by MCSM with the $sdpf$-M interaction.  However more details theoretical calculation is necessary to \nunderstand nucleon-nucleon interaction for this neutron-rich nuclei near ``island of inversion''. \n  \n\\section{Conclusion}\nFirst results on Coulomb breakup measurements of the neutron-rich  $^{29,30}$Na  nuclei, at\nenergies of 400-430 MeV/nucleon has been reported. The observed low-lying dipole strength in these\n neutron-rich Na isotopes can be understood as a direct-breakup mechanism and no resonance like structure has been observed.\nThe shape of the experimental  differential Coulomb dissociation cross section and its comparison with the calculated\ncross section  suggests  the predominant ground-state configuration  as $^{28}$Na${(1^+)}\\otimes\\nu_{s,d}$ and\n$^{29}$Na${(3/2^+)}\\otimes\\nu_{ s,d}$ for $^{29}$Na and $^{30}$Na  respectively. The  ground state spin and \nparity of these nuclei, obtained from present measurement  are in agreement with earlier reported values.\nThus the first results on ground state configurations and qualitative spectroscopic information of valence neutron\n occupying the $s$, $d$ orbitals, obtained via direct method have been reported in this letter. According to this experimental\nresults, the valence neutron is occupying mainly $d$ orbital for both the neutron-rich Na nuclei (N=18,19).\nBut experimentally obtained  spectroscopic factor (2.08 $( 0.3$ for valence neutron in $d$ orbital  of $^{29}$Na  \nis in closer agreement with modified  $sd$-shell (USD-B) calculation (2.18). On the other hand the same for $^{30}$Na  \nis different and experimentally obtained spectroscopic factor for valence neutron in $d$ orbital is much reduced \n2.03 $( 0.3)$  compared to  sd-shell (USD-B) calculation (2.97). This could be due to particle-hole excitation\nof the valence neutron across the shell-gap.  A comparison of our experimental findings on the core \nexcited states contributions in the ground state configuration with the shell-model calculation using the MCSM suggests a \nlower limit of the $sd-pf$ shell gap in $^{30}$Na of around 4.3 MeV. Thus present experimental data  pointed that   $^{30}$Na \n is the boundary of ``island  of inversion'', instead of $^{29}$Na. However more detail theoretical calculation is necessary to \nunderstand the nucleon-nucleon interaction for this neutron-rich nuclei near ``island  of inversion''.\n\n\n\\section*{Acknowledgement}\nWe are thankful to the accelerator people of GSI for their active support during the experiment. Authors are thankful to\n Prof. B.A. Brown, Michigan state University for providing us shell model calculation and \nProf. Sudeb  Bhattacharya, Kolkata for critically reviewing the manuscript and suggestions. Author, Ushasi  Datta  \nacknowledges   Alexander von Humboldt foundation, Germany  and SEND project  grants (PIN:11-R$\\&$D-SIN-5.11-0400) from \n Department of Atomic Energy (DAE), Govt. of India  for   financial support  for work. \n\n\n\n\\begin{thebibliography}{}\n\n\n\n\n\\bibitem{my49} M. Geoppert Mayer,  Phys. Rev. {\\bf 75} (1949)  1969\n\\bibitem{jn49} O. Haxel  et al.,  Phys. Rev. {\\bf 75} (1949) 1766\n\\bibitem{Ref a}C. Thibault et al., Phys. Rev. C {\\bf 12} (1975) 644\n\\bibitem{Ref b}T. Motobayashi et., al 1995 Phys. Lett. B {\\bf 346}(1995) 9\n\\bibitem{Ref warburton} E. K. Warburton et al., Phys. Rev. C {\\bf 41} (1990)1147\n\\bibitem{Ref otsuka} T. Otsuka  et al., Phys. Rev. Lett. {\\bf 87} (2001) 162501\n\\bibitem{Ref otsuka} T. Otsuka  et al., Phys. Rev. Lett. {\\bf 104} (2010) 012501\n\\bibitem{Ref utsuno}Y. Utsuno  et al., Phys. Rev. C {\\bf 70} (2004) 044307\n\\bibitem{Ref c} S. Ettenauer  et al., Phys. Rev. C {\\bf 78} (2008) 017302\n\\bibitem{Ref cp} B. V. Pritychenko  et al., Phys. Rev. C {\\bf 66} (2002) 024325\n\\bibitem{mach} H. Mach  et al., Eur. Phys. J A {\\bf 25} (2005) 105\n\\bibitem{Ref hurst} A. M. Hurst et al., Phys. Lett. B {\\bf 674} (2009) 168\n\\bibitem{Ref tripathi1} V. Tripathi  et al., Phys. Rev. Lett. {\\bf 94} (2005) 162501\n\\bibitem{Ref tripathi2}V. Tripathi  et al., Phys. Rev. C {\\bf 76} (2007) 021301(R)\n\\bibitem{doo13} P. Doornenbal  et al., Phys. Rev. Lett. {\\bf 111} (2013) 212502\n\\bibitem{terry} J. R. Terry  et al., Phys. Lett. B {\\bf 640} (2006) 86\n\\bibitem{mg1} J. R. Terry et al., Phys. Rev. C {\\bf 77} (2008) 014316\n\\bibitem{mg2}O. Niedermaier  et al., Phys. Rev. Lett. {\\bf 94} (2005) 172501\n\\bibitem{isol}M. Seidlitz  et al.,  Phys. Rev. C {\\bf 89} (2014) 024309\n\\bibitem{taj}C. Rodriguez-Tajes  et al., Phys. Rev. C {\\bf 82} (2010) 024305\n\\bibitem{ref e}U. Datta Pramanik et al., Phys. Lett. B {\\bf 551} (2003) 63\n\\bibitem{Ref f} T. Nakamura  et al.,  Phys. Rev. Lett. {\\bf 83} (1999) 1112\n\\bibitem{udp} U. Datta Pramanik  et al., Eur. Phys. J. A  {\\bf  25} (2005) 339\n\\bibitem{dat2}U. Datta Pramanik, Prog. in Particle and Nucl. Phys. {\\bf 59} (2007) 183\n\\bibitem{frs} H. Geissel  et al., Nucl. Instrum. Methods  B {\\bf 70} (1992) 286\n\\bibitem{gfi1}J. Cub  et al.,  Nucl. Instrum. Methods  A {\\bf 402} (1998) 67\n\\bibitem{gfi}K. Mahata  et al., Nucl. Instrum. Methods   A {\\bf 608} (2009) 331\n\\bibitem{land}Th. Blaich et al., Nucl. Instrum. Methods  A {\\bf 314} (1992) 136\n\\bibitem{metag}V. Metag  et al., Nucl. Phys. A {\\bf 409} (1983) 331\n\\bibitem{anisur}A. Rahaman  et al., Eur. Phys. J {\\bf 66} (2014) 02087\n\\bibitem{ceser}C.  Caesar  et al., Phys. Rev. C {\\bf 88} (2013) 034313\n\\bibitem{soft}C. J.  Benesh et al., Phys. Rev. C {\\bf 40} (1989) 1198\n\\bibitem{bar88} C. A. Bertulani and G. Baur, Physics Reports {\\bf 163} (1988) 299\n\\bibitem{bar01} S. Typel  and  G. Baur,  Phys. Rev. C {\\bf 64} (2001) 024601\n\\bibitem{Ref const}K. Boretzky  et al.,  Phys. Rev. C {\\bf 68} (2003) 024317\n\\bibitem{Ref noci}C. Nociforo  et al.,  Phys. Lett. B {\\bf 605} (2005) 79\n\\bibitem{pal}R. Palit R et al., Phys. Rev. C {\\bf 68} (2003) 034318\n\\bibitem{brown} B. A. Brown  and B. H.  Wildenthal, Annu. Rev. Nucl. Part. Sci. {\\bf 38} (1988) 29\n\\bibitem{huber}G.  Huber  et al.,   Phys. Rev. C {\\bf 18}  (1978) 2342\n\\bibitem{er shell}E.  Caurier , F. Nowacki , A. Poves, arxiv:1309.6955\n\\bibitem{tri06} V. Tripathi  et al., Phys. Rev. C  {\\bf 73}  (2006) 054303\n\\bibitem{ree99} A. T. Reed  et al., Phys. Rev. C  {\\bf 60}  (1999) 024311\n\\bibitem{wild} B. H. Wildenthal et al., Phys. Rev. C  {\\bf 22} (1980) 2260\n\\bibitem{alexp} B. A. Brown, Michigan State University private communication\n\\bibitem{alex}B. A. Brown and W. A. Richter,  2006 Phys. Rev. C {\\bf 74} (2006) 034315\n\n\n\n\n \n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 18530, "prevtext": "\nIn the above equation $m_i$, $m_{proj}$ are the rest masses of the breakup products and the projectile respectively.\n$\\beta_i$, $\\beta_j$, $\\gamma_i$, $\\gamma_j$ are the velocities and  Lorentz factors of the reaction products respectively.\n $\\theta_{ij}$ represents the angle between the reaction products i.e. reaction fragment and the breakup neutron in the present experiment.\n$E_{\\gamma}$ is the excitation of the core of the projectile measured with the help of the crystal ball detector.\n\nThe excitation energy $E^*$ of  $^{29,30}$Na were measured  using Pb and C targets.  The background contributions due to the reactions induced  by the\nmaterials of the detectors  and air column were determined from the data taken without any  target and  this background data were subsequently \nsubtracted from the data of Pb and C target. \n Figure \\ref{29na} (top)  shows reaction yields of one neutron breakup against the excitation energy of  $^{29}$Na  using Pb-target (filled circle) and\n without any target (filled triangle).\nSimilarly,  Figure \\ref{30na} (top)  shows the reaction yields of one neutron breakup against $^{30}$Na  using Pb-target (filled circle) and without any target\n (filled triangle). The Coulomb dissociation (CD) cross section  of those neutron-rich nuclei using the $^{208}$Pb  target  (2.0 g/cm$^2$)  was determined  after \nsubtracting the nuclear contribution which was obtained  from the data with a $^{12}C$ target (0.9 g/cm$^2$) with  proper scaling factor \\cite{soft} (1.8).\nWith change of scaling factor of  10$\\%$, the total cross-section of CD would change 1.4$\\%$.\nFilled circle, triangle and square in the lower panel of  Figure \\ref{29na} and  Figure \\ref{30na}, respectively show one neutron breakup reaction cross-section\nof $^{29,30}$Na,  for Pb-target (Coulomb and nuclear),  C-target (nuclear) and  pure Coulomb part from Pb target,  respectively.\nThe CD cross section  for different core excited states can be further differentiated experimentally by the coincidence observation of\nthe characteristic $\\gamma$-ray  of the core fragments with the  fragments and neutron \\cite{ref e}. The excitation energy of the\nexcited  core state can be obtained from  $\\gamma$-energy sum spectra. The detection efficiencies of the NaI detectors  for \n detecting the $\\gamma$-rays under the  experimental conditions were estimated by GEANT simulations.\n\n\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=12cm]{2panel_29na.eps}\n\n\\caption{(Top) The yields of one neutron breakup reaction against excitation energy  of $^{29}$Na  using Pb target and without any target   \nhave been represented by filled circles and  triangles, respectively.\n(bottom) One neutron breakup cross-sections against excitation energy of $^{29}$Na  using  Pb-target (Coulomb+nuclear), C-target(nuclear) and\n pure Coulomb of Pb have been denoted by circles, triangles and squares, respectively.}\n\\label{29na} \n\\end{figure}\n\n\\begin{figure} \n\\centering\n \\includegraphics[width=12cm]{30Na_2panelr.eps}\n\\caption{(Top) The yields of  one neutron breakup reaction against excitation energy of $^{30}$Na for Pb target and without any target   \nhave been represented by filled circles and  triangles, respectively.\n(bottom) One neutron breakup cross-sections against excitation energy of $^{30}$Na using  Pb-target (Coulomb + nuclear), C-target (nuclear) and\n pure Coulomb part have been denoted by circles, triangles and squares, respectively.}\n\\label{30na}\n\\end{figure}\n\nThe measured invariant mass spectra  have been analyzed using the direct breakup model. The neutron-rich nucleus around N = 20,  \nhas been considered as a combination of the  core and a loosely bound valence neutron which may occupy one or more \norbitals e.g. $s$, $d$, $p$ etc.. \nWhen the  projectile passes by a high Z target it  may be excited by absorbing the  virtual photons from the time dependent Coulomb \nfield \\cite{bar88}. The tail part of the wave-function of the  loosely bound neutron is highly sensitive to this virtual photon.   \nHence due to this interaction the valence neutron moves from bound state to the continuum, while core behaves as a spectator.\nThus the nucleus breaks up into a neutron and the core. The electromagnetic breakup of loosely bound nuclei in energetic \nheavy ion collisions is dominated by dipole excitation due to smaller effective charge for higher multi-polarities \\cite{bar01}.\nThus one neutron removal differential Coulomb dissociation cross section (CD)  for dipole excitations d$\\sigma$/dE${^*}$ \ndecomposes into an incoherent sum of components   d$\\sigma (I^{\\pi}_c$)/dE$^{*}$ corresponding to different core states \n$(I^{\\pi}_c)$, populated after one neutron removal.\n For each core state, the cross-section further decomposes into incoherent sum over contribution\nfrom different angular momenta j of the valence neutron in its initial state. Thus differential  cross-section  of  $^{29,30}$Na \ncan be expressed through the following equation \\cite{ref e}:\n\n\n", "index": 3, "text": "\\begin{equation}\n\n\\frac{d\\sigma (I^{\\pi}_c)}{dE^*}=\\ \\frac{16\\pi^3}{9\\hbar c}N_{E1}(E^*)\\displaystyle\\sum_j C^2S(I^{\\pi}_c,nlj)\n \\\\\\times \\displaystyle\\sum_m|<q|(Ze/A)rY^l_m|\\psi_{nlj}(r)>|^2 \\\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;\\frac{d\\sigma(I^{\\pi}_{c})}{dE^{*}}=\\ \\frac{16\\pi^{3}}{9\\hbar c}N_{E1}(E^%&#10;{*})\\displaystyle\\sum_{j}C^{2}S(I^{\\pi}_{c},nlj)\\\\&#10;\\times\\displaystyle\\sum_{m}|&lt;q|(Ze/A)rY^{l}_{m}|\\psi_{nlj}(r)&gt;|^{2}\\ \\par&#10;\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>I</mi><mi>c</mi><mi>π</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>E</mi><mo>*</mo></msup></mrow></mfrac><mo rspace=\"7.5pt\">=</mo><mrow><mfrac><mrow><mn>16</mn><mo>⁢</mo><msup><mi>π</mi><mn>3</mn></msup></mrow><mrow><mn>9</mn><mo>⁢</mo><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi>c</mi></mrow></mfrac><mo>⁢</mo><msub><mi>N</mi><mrow><mi>E</mi><mo>⁢</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>E</mi><mo>*</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi></munder><mrow><mrow><msup><mi>C</mi><mn>2</mn></msup><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>I</mi><mi>c</mi><mi>π</mi></msubsup><mo>,</mo><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>j</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder><mpadded width=\"+5pt\"><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mo>&lt;</mo><mi>q</mi><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>Z</mi><mo>⁢</mo><mi>e</mi></mrow><mo>/</mo><mi>A</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>r</mi><mo>⁢</mo><msubsup><mi>Y</mi><mi>m</mi><mi>l</mi></msubsup></mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>ψ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>&gt;</mo></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}]