[{"file": "1601.05334.tex", "nexttext": "\nwhere here $|i\\rangle$ and $|f\\rangle$ are the initial and final state\nrovibrational wavefunctions of the molecule and $\\mu_\\alpha$ is\ncomponent of the dipole moment surface (DMS).  The requirements for\naccurate linestrengths are therefore high quality nuclear motion\nwavefunctions and DMSs. Lodi and Tennyson \\cite{jt522} developed a\nprocedure which provides estimated uncertainty on a\ntransition-by-transition basis based on the evaluation of multiple\nline lists.  They initially applied this procedure to water vapor\nspectra. Their data were used to replace all H$_2$$^{17}$O and\nH$_2$$^{18}$O intensities for water in the 2012 release of HITRAN\n\\cite{jt557}. These data have since been critically assessed and\nverified empirically for the 6450 to 9400 {cm$^{-1}$}\\ region\n\\cite{14ReOuMiWa}. The present study combines the high accuracy {\\it\n  ab initio} DMS presented by Polyansky {\\textit{et al.}}\\ \\cite{jt613} and the\nmethodology of Lodi and Tennyson, which required some extension for\nthe CO$_2$ problem. This is discussed in the following section.\n\nThe current release of HITRAN \\cite{jt557} takes its CO$_2$ line\nintensities substantially from two sources: the Fourier transform\nmeasurements of Toth {\\textit{et al.}}\\ \\cite{08ToBrMi} and an unpublished version\nof CDSD \\cite{12TaPe}.  The CDSD, whose intensities are\naccurate to about 2 -- 20~\\%\\ depending on the vibrational band, has\nrecently been updated and released as CDSD-296 \\cite{Tashkun2015}.\nThe uncertainty estimate \nis up to 20~\\%\\ for many transitions and is probably rather\nconservative.\nRecently some of\nus computed a new, high accuracy DMS for CO$_2$ which we compared with\nnew high-accuracy experiments \\cite{jt613} and the data in HITRAN. The\ncomparisons suggested that the new DMS is indeed excellent. In this\nwork we construct a new line list for $^{12}$C$^{16}$O$_2$ which we\nsuggest will significantly improve the precision of the intensity\nparameters. Due to considerations associated with the DMS, this line\nlist is restricted to transition wavenumbers below 8000 {cm$^{-1}$}. However,\nin this range the list should be comprehensive and includes\ntransitions which have yet to be quantified experimentally. The next\nsection presents the methodology used to construct the line list.\nSection 3 presents the final line list and compares our results with\nthose from other sources. The final section gives our conclusions and\nplans for future work.\n \n\n\n\\section{Methodology}\n\nThe Lodi-Tennyson method \\cite{jt522} for validating linelists on a\npurely theoretical basis relies on the use of accurate, {\\it ab\ninitio} transition intensity calculations requires\nan accurate procedures for obtaining nuclear motion wavefunctions\ntogether with the use of at least two DMSs and two PESs. \nThese aspects are described below.\n\n\n\\subsection{Ab initio surfaces}\n\nThe first stage in the molecular linelist evaluation process involves\ncomputing energy levels and rotational-vibrational wavefunctions.\nOur approach utilizes an exact nuclear kinetic energy operator\nfollowing the framework proposed by Tennyson and Sutcliffe\n\\cite{jt45,jt96,jt114,jt160} and implemented in DVR3D suite\n\\cite{jt338}; the quality of the electronic\nPES provided is of primary importance. \nEnergy levels and rotational-vibrational wavefunctions\nobtained in this way are further used in intensity calculations,\nrequiring additionally a DMS function as  input. The accuracy of the\nresulting line positions depends strongly on the quality of the PES, while\nline intensities are dependent both on the PES and DMS. Therefore, in\norder to generate high accuracy line intensities, it is necessary to\nprovide those two essential functions with the highest possible accuracy.\nThe present state-of-the-art {\\it ab initio} PESs are capable of\nreproducing experimental energy levels to 1 {cm$^{-1}$}\\ accuracy, which still\nremains insufficient for high resolution spectroscopy purposes.\nHence empirical fitting of {\\it ab initio} surfaces has become a standard\nprocedure. This semi-empirical approach is much less successful in\nthe case of DMSs, partly due to technical difficulties in\nobtaining accurate experimental data, suggesting the use of {\\it ab initio}\nDMSs is a better choice \\cite{jt156}.  It is\nnatural to ask how different PESs and DMSs affect energy levels and\nline intensities. Answering this, in turn, can shed some light on\nthe reliability of line intensities provided by our theoretical scheme.\nAccordingly, the present study involves 6 independent runs of nuclear\nmotion calculations using the inputs presented below. \\\\\n\n\n\\textbf{Ames PES} \n\nAs a primary choice we decided to use the \nsemi-empirical Ames-1 PES from Huang {\\textit{et al.}}\\ \\cite{12HuScTa.CO2}, \nwhich is probably most accurate available. \nThe fit of this PES started from a series of CCSD(T) {\\it ab initio}\ncalculations with scaled averaged coupled-pair function (ACPF)\ncorrections, which also accounts for relativistic effects. No\nnon-Born-Oppenheimer effects were included, resulting in an \nisotope-independent PES. In addition to this a two-step refinement was\nperformed: first using a subset of HITRAN2008 $J=0-4$ energy levels,\nsecond with the use of fully experimental levels for chosen $J$'s up\nto 85.  The resultant PES was then rigorously tested against\nHITRAN2008 and HITRAN2012  as well as against more recent experiments\n\\cite{12HuScTa.CO2,14HuGaFr.CO2}.  The best fit\nroot-mean-square-deviation (RMSD) with respect to purely experimental\nenergy levels for the final Ames-1 PES for the CO$_2$ main isotopologue\nwas equal to 0.0156 {cm$^{-1}$}\\ in $J=0-117$ range. Comparison with HITRAN2012\ndatabase frequencies gave an average overall shift of $-0.0456${cm$^{-1}$}\\ and a\nspread (rms) of 0.0712 {cm$^{-1}$}, which is consistent with our own calculation\nbased on this PES. The relatively large descrepancy between Ames-296 and\nHITRAN2012 was the reason to exclude most of HITRAN energy levels from\nthe fitting procedure.  It also pointed to inconsistencies in the current\nrelease of the database.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\textbf{Ab initio PES} \n\nTo aid the line sensitivity analysis, we independently constructed a fully {\\it ab initio}\nCO$_2$ PES using the energy points used by Polyansky {\\textit{et al.}}\\  \\cite{jt613}\nto compute their DMS. MOLPRO \n\\cite{12WeKnKn.methods} multi-reference configuration\ninteraction theory (MRCI) calculations with the aug-cc-pCVQZ basis \nwere augmented by relativistic corrections at the\none-electron mass-velocity Darwin (MVD1)  level. \nFor more details see the supplementary materials in ref. \\cite{jt613}.\nA fit with 50 constants to the MRCI grid points gave an \nRMSD of 1.54 {cm$^{-1}$}. The\nrelativistic correction surface was fitted separately with 31 \nconstants to yield a RMSD of  0.56 {cm$^{-1}$}.\n\nA comparison with the Ames-1 PES shows a 1.5 {cm$^{-1}$}\\ average discrepancy between the energy\nlevels computed with the\ntwo surfaces for levels below 4000 {cm$^{-1}$}. Above this value some\nenergy levels spoil this\nrelatively good agreement to give a RMSD of 6.2 {cm$^{-1}$}\\ for states below 11 000 {cm$^{-1}$},\nwith 200 (0.5\\%\\ total) levels unmatched. However, for a fully {\\it ab initio}\nprocedure this PES represents roughly the state-of-the-art for CO$_2$. It was therefore\nused as part of the theoretical error estimation procedure.\\\\\n\n\\textbf{Fitted PES} \nHigher quality can be achieved by refining our {\\it ab initio} PES with\nAmes energy levels. This was done for levels with $J= 0, 1$ and 2. \nThis fit resulted in a RMSD of 0.2 {cm$^{-1}$}\\ between respective low $J$\nenergy levels and around 1.4 {cm$^{-1}$}\\ RMSD for states including all $J$'s\n(0-129) below 11 000 {cm$^{-1}$}, leaving only 30 levels above 10 000 {cm$^{-1}$}\\\n(0.1\\%\\ total) unmatched. \n\n\n\n\n\n\n\n\\textbf{Ames DMS} \n\nThe Ames dipole moment surface 'DMS-N2' was based on\n2531 CCSD(T)/aug-cc-pVQZ dipole vectors \\cite{13HuFrTa.CO2}. The linear least-squares fits were performed with 30 000 {cm$^{-1}$}\\\n energy cutoff and  polynomial expansion up to 16-th order with 969 coefficients, which gave a RMDS of \n $3.2\\times10^{-6}$ a.u.\nand $8.0\\times10^{-6}$ a.u. for respective dipole vector components. Comparison with recent experiments  \\cite{13HuFrTa.CO2} and \nCDSD data leads to the general conclusion that the Ames DMS, while reliable,\n still does not meet requiremets for remote sensing accuracy.\n\n\n\n\n\\textbf{UCL DMS} \n\nOur dipole moment surface was calculated using the finite field\nmethod. Both positive and negative electric field vector directions\nwere considered for the $x$ (perpendicular to molecular long axis) and\n$y$ (along molecular long axis) components of the dipole moment,\nrequiring 4 independent runs for each {\\it ab initio} point. Finally\nthe dipole moment was computed as first derivative of electronic\nenergy with respect to a weak uniform external electric field\n($3\\times10^{-4}$ a.u.); a two-point numerical finite difference\napproximation was used.  Previous research suggests that in general\nderivative method yields more reliable dipole moments than those\nobtained from simple expectation value evaluation \\cite{jt475}.\nRandomly distributed {\\it ab initio} points were then fitted with a\npolynomial in symmetry adapted bond-lengths and bond angle\ncoordinates. This resulted in an expansion up to fifth order. Points\nabove 15~000 {cm$^{-1}$}\\ were rejected from the fit, leaving 1963 points for\nthe $x$ component fitted with 17 constants giving a RMSD of\n$2.25\\times 10^{-5}$ a.u.; and 1433 points for the $y$ component\nfitted with 19 constants giving RMSD of $1.85\\times10^{-5}$ a.u. .\n\n\n\\subsection{Nuclear motion calculations}\n\nNuclear-motion calculations were performed using the DVR3D suite\n\\cite{jt338}. Symmetrized Radau coordinates in bisector embedding were\napplied to represent nuclear degrees of freedom.  Rovibrational\nwavefunctions and energy levels were computed utilizing exact kinetic\nenergy operator (in Born-Oppenheimer approximation) with nuclear\nmasses for carbon (11.996709 Da) and oxygen (15.990525 Da).\n\nAs a first preliminary step in our procedure basis set parameters were optimized with respect to \nenergy levels convergence using the Ames-1 PES. The final set of parameters for Morse-like basis functions \\cite{jt338,jt14},\n describing stretching and bending motions, was considered as $r_e=2.95\\; a_0$, $D_e=0.30\\; E_h$ and $\\alpha=0.0085\\; E_h$.\n These values were chosen in a careful scan of parameter space with convergence speed as a criterion.\nThe contracted DVR basis set associated with Gauss-Legendre\nquadrature points consisted of 30 radial and 120 angular functions, respectively. The appropriate choice of basis set parameters \nallowed us to \nreduce the size of the basis needed to converge energy levels, hence speeding up calculations. \nThe same set of parameters was used for \nrovibrational energies evaluation with \\textit{ab initio} and fitted PESs.\n \nAt room temperature the highest initial energy level that can be\npopulated enough to give a transition above the $10^{-30}$ cm/molecule\nintensity threshold is roughly 6500 {cm$^{-1}$}\\ and $J=130$.  Therefore we could\npotentially be interested in upper energy levels up to 14 500 {cm$^{-1}$}\\ to\ncover the 0 -- 8000 {cm$^{-1}$}\\ wavenumber region.  However, the current,\n2012, version of HITRAN only considers upper states up to 11 500 {cm$^{-1}$}\\\nfor wavenumbers below 8000 {cm$^{-1}$}.  As our target is to cover all HITRAN\ntransitions, we keep only energy levels below 11 500 {cm$^{-1}$}, so that the\nHamiltonian matrix in the first (vibrational) step of the calculation\n(program DVR3DRJZ) could be truncated at 1000.  It guaranteed $J=0$\nenergy levels (band origins) below 10 000 {cm$^{-1}$}\\ to be converged at the\n$10^{-6}$ {cm$^{-1}$}\\ level and energy levels around 12 000 {cm$^{-1}$}\\ \n at the $10^{-5}$ {cm$^{-1}$}\\ level.\n\nThe ro-vibrational part of the computation (program ROTLEV3b) took advantage of symmetry adapted symmetric top basis set truncated \nat $600\\times (J+1) $ for $J=0-50 $, $300 \\times (J+1) $ for \n$J=51-86 $ and $100\\times (J+1) $ for $J=87-129 $. \nThis yielded 42~691 relevant\\footnote{contributing to at least one transition with line intensity greater than $10^{-38}$ cm/molecule} energy levels up to 11 500 {cm$^{-1}$}\\ and covered all HITRAN2012 database energy levels\n contributing to transitions up to 8000 {cm$^{-1}$}\\ and $J\\leq 129$.\n\nThe final step involved running the DIPOLE program \\cite{jt338}. \nA uniform $10^{-30} $ cm/molecule cutoff value is sufficient to cover most of \nexperimentally available data and also corresponds to HITRAN2012 standard, facilitating further comparisons. \nThe value for the partition function  at 296~K $Q=286.096$\nwas taken from Huang et al.~\\cite{14HuGaFr.CO2} and coincides with the value $286.095$  \nobtained from the present calculation. \nFor $^{12}$C$^{16}$O$_2$,  half of the possible energy levels do  not exist due to  nuclear spin statistics.\nTransition intensities in cm/molecules were calculated using\n\n\n\n", "itemtype": "equation", "pos": 7093, "prevtext": "\n\n\n\\title{A room temperature CO{$_{2}$} line list with {\\it ab initio} computed intensities}\n\n\n\\author{Emil Zak$^a$, Jonathan Tennyson$^a$\\footnote{To whom correspondence should be addressed; email: j.tennyson@ucl.ac.uk}, \nOleg L. Polyansky$^a$, Lorenzo Lodi$^a$}\n\n\\author{Nikolay F. Zobov$^b$}\n\n\\author{Sergey A. Tashkun$^c$, Valery I. Perevalov$^c$}\n\n\\address{$^a$Department of Physics and Astronomy, University College London,\\\\\nLondon, WC1E 6BT, UK}\n\\address{$^b$Institute of Applied Physics, Russian Academy of Sciences, Ulyanov Street 46, Nizhny Novgorod 603950, Russia } \n\\date{\\today}\n\\address{$^c$V.E. Zuev Institute of Atmospheric Optics, SB RAS, 1, Academician Zuev Square, Tomsk 634021, Russia}\n\\begin{abstract}\n  Atmospheric carbon dioxide concentrations are being closely\n  monitored by remote sensing experiments which rely on knowing line\n  intensities with an uncertainty of 0.5\\% or better.  We report a\n  theoretical study providing rotation-vibration line intensities\n  substantially within the required accuracy based on the use of a\n  highly accurate {\\it ab initio} dipole moment surface (DMS).  The\n  theoretical model developed is used to compute CO$_2$ intensities\n  with uncertainty estimates informed by cross comparing line lists\n  calculated using pairs of potential energy surfaces (PES) and DMSâ\u0080\u0099s\n  of similar high quality.  This yields lines sensitivities which are\n  utilized in reliability analysis of our results.  The final outcome\n  is compared to recent accurate measurements as well as the\n  HITRAN2012 database.  Transition frequencies are obtained from\n  effective Hamiltonian calculations to produce a comprehensive line\n  list covering all $^{12}$C$^{16}$O$_2$ transitions below 8000\n  cm$^{-1}$ and stronger than 10$^{-30}$ cm / molecule at $T=296$~K.\n\n\n\\end{abstract}\n\n\\maketitle\n\n\\newpage\n\n\\section{Introduction}\n\nThe quantity of carbon dioxide (CO$_2$) in Earth's atmosphere is thought to have a key role\nin climate change and is therefore being closely monitored. Several agencies are flying experiments or whole\nmissions, for example\nGOSAT \\cite{GOSAT},  OCO-2 \\cite{OCO} and ASCENDS \\cite{ASCENDS},\nto explicitly monitor the atmospheric CO$_2$ content.\nSimilarly, international ground-based networks such as TCCON \\cite{TCCON} and NDACC \\cite{NDACC} are\nalso dedicated to monitoring atmospheric CO$_2$ content.\nA major aim of this activity is to establish CO$_2$ concentrations\nat the parts per million (ppm) level\nor, preferably, better. These projects will aim not only to look at\noverall CO$_2$ concentration and its variation; it is of particular interest\nto pinpoint where CO$_2$ is being\nproduced (sources) and where it is going (sinks).\nThis activity is clearly vital to monitoring and hopefully\ncontrolling CO$_2$ and hence climate change \\cite{Emmert2012}. \n\nAll CO$_2$ remote sensing activities, both from the ground and space,\nrely on monitoring CO$_2$ vibration-rotation spectra and therefore\nare heavily dependent on laboratory spectroscopy for reliable\nparameters; it is only through these parameters that atmospheric spectroscopic\nmeasurements can be interpreted.  These spectroscopic parameters are of three\ntypes: line centers, line profiles and line intensities. Line\ncenters or positions are established to high accuracy in many \nlaboratory high\nresolution spectroscopy studies and in general do not require significant\nimprovement for studies of Earth's atmosphere. Line profiles are more\ndifficult but significant progress on these has been made in recent\nyears with, for example, the inclusion of line mixing in both the\nHITRAN database \\cite{jt453} and many retrieval models, and the move \nbeyond Voigt profiles \\cite{jt584}. Here we focus on line intensities\nfor the main isotopologue of carbon dioxide, $^{12}$C$^{16}$O$_2$.\n\nIn the laboratory it is much harder to determine accurately line\nintensities than line frequencies.  Typical accuracies for\nexperimental line intensity data used in atmospheric models and\nretrievals is only 3 to 10~\\%\\\n\\cite{Wang2005,Perevalov2008,Song2010,Hashemi2013} and, until\nrecently, the best published measurements, e.g. Boudjaadar {\\textit{et al.}},\n\\cite{06BoMaDa.CO2}, only provide accuracies in the 1 to 3~\\%\\ range,\nstill very significantly worse than the precision of 0.3 to 1~\\%\\\nrequired by the modern remote sensing experiments\n\\cite{OBrien2002,XOCO,Sioris2014}.\n\n\nRecently there have been a number of laboratory measurements aimed\nat measuring absolute CO$_2$ line intensities with the high accuracy needed\nfor remote sensing \\cite{07CaPaCa.CO2,09CaWeCa.CO2,11WuViJo.CO2,Hashemi2013,jt613,Malathy2015,15BrWeSe.CO2}.\nWith the exception of recent work by Devi {\\textit{et al.}}\\ \\cite{Malathy2015},\nthese studies have all focussed on obtaining the highest possible accuracy for a\nfew lines or even a single line. These investigations will be discussed further below. While\nthey\nclearly do not provide the volume of data needed for remote sensing studies, they\ndo provide benchmarks that can be used to assess calculated intensities such\nas those provided here. Approximately 20~000 transitions of $^{12}$C$^{16}$O$_2$ have been measured\nexperimentally; the experiments\nup to 2008 were reviewed by Perevalov {\\textit{et al.}}\\ \\cite{Perevalov2008} and more recently\nby Tashkun {\\textit{et al.}}\\ \\cite{Tashkun2015}. \n\n\nThere have been a number of attempts to use theory to provide\nintensities for CO$_2$. Wattson {\\textit{et al.}}\\\n\\cite{92WaRoxx.CO2,94DaMaBa.CO2} produced line lists using variational\nnuclear motion calculations.  \nMore recently, Huang {\\textit{et al.}}\\ have performed a series\nof quantum mechanical studies giving line positions and intensities for CO$_2$\n\\cite{12HuScTa.CO2,13HuFrTa.CO2,14HuGaFr.CO2}. In particular, Huang {\\textit{et al.}}\\\nprovide the most accurate currently available potential energy surface (PES)\nfor the CO$_2$ system.\nA widely-used alternative theoretical\napproach is based on effective operators for the\nHamiltonian and the spectroscopic dipole moment \\cite{92TeSuPe.CO2}.\nCurrently, the effective Hamiltonian approach achieves one order of\nmagnitude better accuracy for $^{12}$C$^{16}$O$_2$ frequencies than\nthe best-available PES \\cite{12HuScTa.CO2}. Within this framework, the\ncalculation of intensities requires eigenfunctions of an effective\nHamiltonian whose parameters were fitted to observed positions of\nrotation-vibration lines as well as dipole moment operators tuned to\nobserved transition intensities.  This approach has been used to\ncreate dedicated versions of the carbon dioxide spectroscopic databank\n(CDSD) for room-temperature \\cite{Tashkun2015} and high-temperature\n\\cite{02TaPeTe.CO2,11TaPe.CO2} applications.\n\nRecently a number  of studies\nhave shown that it is possible to compute line intensities\nusing dipoles from {\\it ab initio} electronic structure calculations with  an accuracy \ncomparable to, or even better than, available measurements \\cite{jt613,jt509,jt522,jt530,jt587}.\nThe intensity of a line depends on the transition line strength which\nis obtained quantum-mechanically from the integral\n\n", "index": 1, "text": "\\begin{equation}\n S_{if} = \\left|\\sum_\\alpha \\langle i | \\mu_\\alpha| f \\rangle \\right|^2\n\\label{linestrength}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S_{if}=\\left|\\sum_{\\alpha}\\langle i|\\mu_{\\alpha}|f\\rangle\\right|^{2}\" display=\"block\"><mrow><msub><mi>S</mi><mrow><mi>i</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><msup><mrow><mo>|</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mrow><mo stretchy=\"false\">⟨</mo><mi>i</mi><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi>μ</mi><mi>α</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><mi>f</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo>|</mo></mrow><mn>2</mn></msup></mrow></math>", "type": "latex"}, {"file": "1601.05334.tex", "nexttext": "\nwhere $\\omega_{if}$ is the transition frequency between the $i$'th and\n$f$'th state, $g_i=(2J+1)$ is the total degeneracy factor, $Q(T)$ is the\npartition function and $S_{if}$ represents the linestrength, see\neq.(\\ref{linestrength}), for transition $i$ to $f$. Units for line\nintensity are cm/molecule.\n\n\n\\subsection{Estimatation  of  the intensity uncertainties}\n\nThe dominant source of uncertainty in line intensities is given by the\n{\\it ab initio} DMS. The accuracy of the UCL DMS was considered in\ndetail by Polyansky {\\textit{et al.}}\\ \\cite{jt613} who suggested that for the\nvast majority of transitions below 8000 {cm$^{-1}$}\\ it should give\nintensities accurate to better than 0.5~\\%.\n\nA characteristic of an {\\it ab initio} DMSs is that entire\nvibrational bands are reproduced with very similar accuracy.\nThis is because to a significant extent ro-vibrational transitions in a molecule\nlike CO$_2$ can be thought of as the product of\na vibrational band intensity and a H\\\"onl-London factor. Although DVR3D does not\nexplicitly use H\\\"onl-London factors, the use of\nan exact nuclear motion kinetic energy operator ensures that these rotational\nmotion effects are accounted for exactly.\n\nThe nuclear motion wavefunctions give a secondary but, under certain\ncircumstances, important contribution to the uncertainties.\nVariational nuclear motion programs yield very highly converged wavefunctions\nand in situations where the PES is precise the \nintensities show little sensitivity to the details of how they are calculated.\nFor example, our wavefunctions calculated\nusing Radau coordinates give intensities very similar (to within 0.1~\\%) to\nthose computed in the previous study \\cite{jt613}\nusing Jacobi coordinates and different basis set parameters.\n\nWhere the wavefunctions do play an important role\nis in capturing the interaction between different vibrational states. Such\nresonance interactions can lead to intensity stealing\nand, particularly for so-called dark states, huge changes in transition\nintensities.\nThe Lodi-Tennyson methodology was designed to capture\naccidental resonances which were not fully characterized by the underlying PES.\nUnder these circumstances calculations with\ndifferent procedures should give markedly different results. Lodi and Tennyson\nmonitored the effects of changes to the PES and\nfits of the DMS. The procedure does not yield an uncertainty as such, it simply\nestablishes which transition intensities are correctly \ncharacterized by the calculation and hence have an uncertainty reflecting the\nunderlying DMS, and which are not, in which case the\npredictions were deemed as unreliable and alternative sources of intensity\ninformation was recommended.\n\nIn other words, trustworthy lines should be stable under minor PES/DMS\nmodifications.  One problem with this strategy is that if the\nalternate PES (or DMS) differs too much from the best PES then large\nintensity variations can be found which do not reflect problems with\nthe best calculation.  This issue already arose in a study on HDO\n\\cite{jtDown} where the {\\it ab initio} and fitted surfaces showed\nsignificant differences.  For CO$_2$ our {\\it ab initio} PES is\nrelatively inacurate and hence far from the high quality Ames-1 fitted\nPES; it was for this  reason we constructed a third PES by performing our\nown, light-touch fit.\n\nHere we therefore follow the Lodi-Tennyson strategy \\cite{jt522} but\nconstructed and evaluated six linelists utilizing the three different\nPESs and two different DMSs introduced above.  For this purpose\nthree sets of nuclear-motion wavefunctions were produced: the first\nbased on the Ames-1 semi-empirical PES, second based on the UCL {\\it\n  ab initio} PES and the third on our new fitted PES.  Those three\nsets of wavefunctions were combined with the two {\\it ab initio} DMSs\ndescribed above, to give line intensities.  Having six linelists, the\nnext step was to match line-by-line pairs of respective linelists:\n(Ames PES \\& Ames DMS, Ames PES \\& UCL-DMS)=(AA,AU), (UCL-{\\it ab initio} \\&\nAmes DMS, UCL-{\\it ab initio} \\& UCL-DMS)=(UA,UU), (fitted PES \\& Ames DMS,\nfitted PES \\& UCL-DMS)=(FA,FU).  This stage was straightforward,\nyielding almost 100\\%\\ match as the linelists being compared differ\nonly in DMS, which does not affect energy levels.  The second stage\ninvolved matching the Ames-PES based with UCL-PESs based linelists, i.e.\n(AA,AU) vs. (UA,UU) and (AA,AU) vs. (FA,FU). In both cases\nline-by-line matching was preceeded by matching of energy levels.  In\nthe case of Ames vs. UCL we managed to match 90\\%\\ of lines stronger\nthan 10$^{-30}$ cm/molecule, while Ames vs. fitted resulted in high\n99\\%\\ correspondence.  This confirms that reducing the 6.2 {cm$^{-1}$}\\ RMSD\nto 1.4 {cm$^{-1}$}\\ makes a significant difference.  Note that since the (AU)\nline list provides our best estimates of the intensities, there is no\nbenefit in performing a (UA,UU,FA,FU) scatter factor analysis.\n\n\\begin{figure}[H]\n\\begin{center}\n\n\\includegraphics[width=12cm]{Figure1.pdf}\n\\caption{Scatter factor, $\\rho$, statistics for two sets of PES-DMS combination. Inset: cumulative distribution function. See text for further details.}\n\\label{figure:rho_stat}\n\\end{center}\n\\end{figure}\n\nFor each 'matched' line, the ratio of strongest to weakest transition intensity\nwas calculated, yielding a scatter factor $\\rho$. \nFigure \\ref{figure:rho_stat} shows scatter factors statistics for the two sets\nof interest.\n We can clearly see that (AA,AU,UA,UU) set has more uniform and compact\ndistribution of $\\rho$. \nHowever statistics for the {\\it ab initio} UCL PES are based on an\nincomplete match, leaving around 10\\%\\ of unmatched lines with an unknown\nscatter factor. \nOn the other hand, cumulative distribution function for (AA,AU,FA,FU) set reaches plateau at higher percentage of all lines,\nindicating the advantage of fitted PES over UCL-{\\it ab initio}. \n\nThis leaves the \nproblem of the choice of a critical value for the scatter factor. Lodi and\nTennyson chose the arbitrary value of $\\rho = 2$.\nHere we used the\nscatter factor statistics to help inform our choice for this number. \nFigure \\ref{figure:rho_stat} suggests $\\rho=2.5$ \nis a reasonable value for this descriptor. Our more detailed analysis of\nindividual bands, given below, suggests that this is indeed\nan appropriate value.\n\n\n\nDetailed band-by-band comparisons revealed another feature of\n(AA,AU,UA,UU) set: for a number of bands for which the AU intensities\ngave excellent agreement with the measurements for all transitions,\nbut an arbitrary proportion of the transitions were identified as\nbeing unstable. These false negatives are unhelpful and lead to the\nrisk of good results being rejected. For the (AA,AU,FA,FU) set we\nfound that provided the scatter factor was taken to be high enough,\n$\\rho > 2.5$, this problem was not encountered.  Hence we decided to\nuse fitted PES as a working set for further analysis.\n\n\n\n\nFor $J \\geq 25$ it is quite common to have almost degenerate\ntransitions, that is transitions from exactly the same lower energy\nlevel to upper energy levels with same $J$ and e/f symmetries, and as\nclose as 0.1 {cm$^{-1}$}. Therefore sometimes even the energetically best\nmatch is not correct which leads to very inflated scatter factors.  In\nthis case, manual matching based on intensity considerations,\neliminates this problem for stronger bands ($I>10^{-26}$ cm/molecule)\nand leaves only true $J$-localized instabilities.  Due to this issue with\nalmost degenerate transitions, we should note that the numerical\nvalues of $\\rho$ for unstable lines may in some cases be caused by\nmissasignments which leaked through our tests.  In particular, such a\nsituation can occur when  almost degenerate transitions \nhave similar line intensities. \n\n\nThere are two main cases when \\textit{ab initio} based intensities may\nlose their reliability: energy levels crossing and intensity\nborrowing by a weak band from a very strong band via resonance\ninteractions.\n\n\\begin{figure}[H]\n \\begin{flushleft}\n  \\hfill\\includegraphics[width=12cm]{Figure2.pdf}\n\n\\caption{Scatter factor as a function of lower energy level for the \n11102 -- 00001 band. The purple line denotes critical value of\nthe scatter factor ($\\rho=2.5$). }\n\\centering\n\\label{figure:rho_11102}\n \\end{flushleft}\n\\end{figure}\n\nThe latter is just the case for 1110$i$-00001 ($i=1,2,3$) bands.  They\nborrow intensities from very strong asymetric stretching fundamental\nvia second order Coriolis interaction. This appears as a sharp peak\naround 2000 {cm$^{-1}$}\\ (upper energy level) as depicted in\nFig.~\\ref{figure:rho_11102}. In this case, reproducing the line\nintensities with high accuracy requires very precise wavefunctions. We\ndescribe these lines as being associated with a $J$-localized\ninstability.\n\nTogether with bands for which scatter factor has peaks concentrated around certain energetic region\nwe also  encountered entire vibrational bands with\n$\\rho>2.5$, which we shall name as 'sensitive'.\n\nThe 40011-00001 and 40012-00001 bands are good\nexamples of combination of these two effects. Firstly both bands have\ntheir upper energy levels around 8000 {cm$^{-1}$}\\ and the whole bands are\nuniformly unstable.  Moreover we observe peaking of the scatter factor\naround $J= 76$ ($E_i$=2278 {cm$^{-1}$}), which we attribute to a strongly\nmixed lower energy level involved in transition. The 40012-00001 band\nis much stronger, therefore the $J=76$ transitions are still above our\nintensity threshold, and we find a maximum in the scatter factor.\n\nThe Lodi-Tennyson approach was based on\nthe idea of occassional, accidental resonances. However it is well-known that\nCO$_2$ has a series of systematic, Fermi-resonances.\nWe found that some of the bands gave large $\\rho$\nvalues for all transitions. There are two possible causes for this:\nincomplete representation of the resonance interaction in the PESs used or\nthat the compared PESs differ significantly for this band.\nComparisons also suggested\nthat some of the predicted intensities for these bands may not be as reliable as one would\nexpect for the accurate UCL DMS. We therefore adjusted our strategy and introduced an intermediate\ncategory of lines between stable and unstable for which the uncertainty of our intensity predictions\nwas increased. \n\n\n\n\n\\subsection{Line positions}\n\nLodi and Tennyson's water line list was based on the use of\nexperimental energy levels \\cite{jt454,jt482,jt562} based on the\nMARVEL procedure \\cite{jt412,12FuCsi.method}.  For CO$_2$ an effective\nHamiltonian model was able to reproduce all published observed line\npositions with accuracy compatible with measurement uncertainties\n\\cite{Tashkun2015}.  Specifically, the fitted model of $H_{\\rm eff}$\nwas able to reproduce 44~917 observed line positions of\n$^{12}$C$^{16}$O$_2$ having measurement uncertanties in the\n$3.0\\times10^{-9}$ \\cite{04AmViCh.CO2}\nto 0.02 {cm$^{-1}$}\\ range with a dimesionless standard\ndeviation 2.0. This means that, on average, the obs-calc residuals\nexceed the measured uncertainties by only a factor of two.  This makes\nthese calculatied line positions appropriate for our new\n$^{12}$C$^{16}$O$_2$ line list.\n\n\n\\section{Results}\n\nOur final line list given in the supplementary information,  includes the $\\rho$ parameter, determined from\n(AA,AU,FA,FU),\n as one of the fields; $\\rho$ is set to $-1.0$  whenever  it could not be extracted. \nFor the most intense bands this automatic procedure was followed by manual\nmatching and double-check, see Table~\\ref{table:rho}.\n\n\\subsection{Scatter factors}\n\nIn order to appreciate the landscape of scatter factor distributions, it is\ninstructive \nto introduce scatter factor maps as a function of\nlower and upper energy level. Figure \\ref{figure:rho_map} shows a map where\ncolor codes represent \nvalues of the scatter factor for a given transition. \nThe fundamental bands are easily identified as straight lines originating at 0\n{cm$^{-1}$}\\ lower energy. \nThe lowest hot bands originate at around 668 {cm$^{-1}$}, \ncomplicating the whole picture. A general conclusion from  figure \n\\ref{figure:rho_map} is that the higher energy of a level involved in a\ntransition, the higher \ntendency for the transition to be unstable.  The color coding in the figure\ndivides \nscatter factor space into 3 regions of increasing instability, marked blue,\norange and red, \nrespectively. The blue region is considered to be stable\nand corresponding intensities are reliable. The orange region is intermediate\nbetween stable and unstable, \nhence transitions marked orange need careful consideration.\nThe red region contains highly unstable lines whose computed line intensities\nshould not be trusted.  There are\na few super-unstable transitions ($\\rho > 10$) which are not shown on the plots;\nthese lines are usually\nassociated with a strong \nresonance interaction with some other  energetically-close level. \n Analysis of scatter factors for individual bands can yield insight.\nBy zooming in an energetic region of interest it is straightforward to pick up \nentirely unstable bands or single transitions which happen\nto fall into resonance. Altogether we find 5400 transitions we classify\nas unstable.\n\n\n\\begin{figure}[H]\n\n  \\includegraphics[width=10cm,angle=-90]{Figure3.pdf}\n\\caption{Scatter factor map as a function of lower and upper energy level for transitions stronger than $10^{-30}$ cm/molecule. \nThe color code represents the values of scatter factor, $\\rho$. Four regions of \nline stability were determined:  blue-stable, orange-intermediate and red-unstable.  See text for further details}\n\\centering\n\\label{figure:rho_map}\n\\end{figure}\n\n\n\\begin{figure}[H]\n  \\includegraphics[width=14cm]{Figure4.pdf}\n\n\\caption{Scatter factor map as a function of lower and upper energy level for transitions stronger than $10^{-25}$ cm/molecule. Color code represents the values of scatter factor. Four regions of \nline stability were determined: blue-stable, orange-intermediate and red-unstable. }\n\\centering\n\\label{figure:rho_map_25}\n\\end{figure}\n\nFor example, as can be seen from figure \\ref{figure:rho_map_25} (which\nconsiders only lines stronger than $10^{-25}$ cm/molecule) while\nmajority of bands have completely uniform scatter factors below the\ncritical value of 2.5, there are entire bands (marked orange)\nsystematically shifted by change of the underlying PES by a factor of\nmore than 2.5.  Those bands involving vibrational states which appear\nto be influenced by strong resonance interactions are called\n'sensitive' bands below. A completely different behaviour may be\nobserved for example for the 11101, 11102 and 11103 series of bands\n(indicated with arrows). Here a fairly uniform scatter factor is\ndisturbed by $J$-localized peak.  Fig.~\\ref{figure:rho_11102}\nillustrates such behavior, which is explained by inter-band intensity\nborrowing via rotational-vibrational (Coriolis) interaction terms in\nmolecular Hamiltonian.  A summary of stability analysis for selected\nbands is given in table \\ref{table:rho}.\n\n\\begin{table}[H]\n\\caption{Characterization of selected CO$_2$ bands. \nGiven for each band are the band center in {cm$^{-1}$}, the total band strength in cm/molecule, the total number of lines in the band, the number of\nstable lines with scatter factor $\\rho < 2.5$, the number\nof intermediate lines with $2.5 \\geq \\rho < 4.0$, the median of \nthe scatter factor distribution\n$\\tilde{\\rho}$, and the maximum and minimum value of $\\rho$.}\n\n\\footnotesize\n\\begin{tabular}{l r l r r r r r r l}\n\\hline\\hline\nBand & Center & Strength & Total & Stable & Inter.&$\\tilde{\\rho}$ & $\\rho_{max}$ & $\\rho_{min}$& Type\\\\ [0.5ex] \n\\hline \n\n00011-00001 & 2349.949 & $9.20\\times10^{-17}$ &129 & 129 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n01101-00001 & 668.159 & $7.97\\times10^{-18}$ &183 & 183 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n01111-01101 & 2335.133 & $7.09\\times10^{-18}$ &341 & 341 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n10011-00001 & 3715.622 & $1.53\\times10^{-18}$ &119 & 119 & 0 & 1.1 & 1.1 & 1.1  & stable    \\\\ \n10012-00001 & 3613.662 & $1.01\\times10^{-18}$ &119 & 119 & 0 & 1.1 & 1.1 & 1.1  & stable    \\\\ \n02201-01101 & 669.309 & $6.15\\times10^{-19}$ &340 & 340 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n02211-02201 & 2321.865 & $2.71\\times10^{-19}$ &317 & 317 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n10012-10002 & 2328.264 & $1.73\\times10^{-19}$ &115 & 115 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n10001-01101 & 720.044 & $1.57\\times10^{-19}$ &169 & 169 & 0 & 1.0 & 1.0 & 1.0 & stable   \\\\\n10002-01101 & 617.239 & $1.46\\times10^{-19}$ &169 & 169 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11111-01101 & 3721.742 & $1.21\\times10^{-19}$ &310 & 310 & 0 & 1.1 & 1.1 & 1.0 & stable   \\\\\n10011-10001 & 2327.419 & $1.04\\times10^{-19}$ &113 & 113 & 0 & 1.0 & 1.0 & 1.0 & stable   \\\\ \n11112-01101 & 3578.816 & $7.58\\times10^{-20}$ &309 & 309 & 0 & 1.1 & 2.2 & 1.0 & stable   \\\\\n03301-02201 & 670.458 & $3.54\\times10^{-20}$ &316 & 316 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\\n20012-00001 & 4978.659 & $3.40\\times10^{-20}$ &110 & 110& 0 & 1.4 & 1.5 & 1.3 & stable   \\\\ \n11102-10002 & 647.831 & $2.16\\times10^{-20}$ &162 & 162 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11112-11102 & 2313.744 & $1.47\\times10^{-20}$ &294 & 292 & 2 & 1.0 & 3.2 & 1.0  & stable, $J$-local     \\\\ \n11101-10001 & 689.438 & $1.36\\times10^{-20}$ &159 & 159 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n20011-00001 & 5100.494 & $1.10\\times10^{-20}$ &107 & 107 & 0 & 1.4 & 1.5 & 1.3 & stable   \\\\ \n03311-03301 & 2308.597 & $1.03\\times10^{-20}$ &291 & 291 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11111-11101 & 2312.260 & $7.23\\times10^{-21}$ &290 & 290 & 0 & 1.0 & 1.0 & 1.0 & stable   \\\\\n20013-00001 & 4854.447 & $7.13\\times10^{-21}$ &109 & 109 & 0 & 1.5 & 1.5 & 1.5  & stable  \\\\   \n11101-02201 & 740.173 & $6.14\\times10^{-21}$ &308 & 308 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11102-02201 & 595.761 & $5.33\\times10^{-21}$ &304 & 304 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11101-00001 & 2077.641 & $5.17\\times10^{-21}$ &107 & 97& 3 & 1.9 & 1500 & 1.4  & stable, $J$-local    \\\\ \n12212-02201 & 3724.349 & $4.75\\times10^{-21}$ &284 & 284 & 0 & 1.1 & 1.1 & 1.1  & stable    \\\\\n20012-10002 & 3693.261 & $3.69\\times10^{-21}$ &104 & 104 & 0 & 1.1 & 1.1 & 1.0  & stable    \\\\ \n20013-10002 & 3569.048 & $3.12\\times10^{-21}$ &104 & 104 & 0 & 1.1 & 1.1 & 1.0  & stable    \\\\ \n20011-10001 & 3712.291 & $2.96\\times10^{-21}$ &102 & 102 & 0 & 1.1 & 1.1 & 1.0  & stable    \\\\ \n04401-03301 & 671.607 & $1.80\\times10^{-21}$ &290 & 290 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n12202-11102 & 654.112 & $1.57\\times10^{-21}$ &294 & 294 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n00031-00001 & 6973.378 & $1.38\\times10^{-21}$ &101 & 101 & 0 & 2.1 & 2.2 & 2.0  & stable    \\\\ \n00011-10001 & 961.746 & $9.01\\times10^{-22}$ &99 & 99 & 0 & 1.2 & 1.2 & 1.2  & stable    \\\\ \n12201-11101 & 685.423 & $8.03\\times10^{-22}$ &291 & 291 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n11102-00001 & 1933.229 & $6.19\\times10^{-22}$ &156 & 146& 3 & 1.4 & 37 & 1.2  & stable, $J$-local    \\\\ \n30011-00001 & 6503.913 & $5.17\\times10^{-23}$ &24 & 0 & 24 & 2.6 & 2.6 & 2.6  & sensitive   \\\\\n12201-01101 & 2094.904 & $5.01\\times10^{-22}$ & 300 & 271 & 7 & 1.3 & 1200 & 1.1  & stable, $J$-local   \\\\ \n30013-00001 & 6228.740 & $4.54\\times10^{-22}$ &99 & 99& 0 & 2.3 & 2.3 & 2.3  & stable   \\\\ \n30012-00001 & 6348.693 & $4.54\\times10^{-22}$ &99 & 99 & 0 & 2.2 & 2.3 & 2.1  & stable    \\\\ \n20001-11101 & 719.501 & $3.89\\times10^{-22}$ &146 & 146 & 0 & 1.0 & 1.0 & 1.0  & stable    \\\\ \n13311-13302 & 2490.039 & $9.13\\times10^{-24}$ &75 & 10 & 65 & 2.5 & 3.5 & 2.4  & sensitive    \\\\\n40012-00001 & 7735.305 & $3.19\\times10^{-24}$ &24 & 0 & 24 & 2.6 & 2.6 & 2.6  & sensitive \\\\\n40011-00001 & 7921.693 & $2.10\\times10^{-25}$ &24 & 0 & 24 & 2.6 & 2.6 & 2.6  & sensitive \\\\ \n23302-22201 & 481.776 & $9.92\\times10^{-26}$ &90 & 90& 0 & 1.0 & 1.0 & 1.0  & stable     \\\\\n30004-11102 & 1859.407 & $6.77\\times10^{-26}$ &24 & 0 & 24 & 2.6 & 2.6 & 2.6  & stable, $J$-local \\\\ \n\n\n\\hline\\hline\n\\end{tabular}\n\\label{table:rho}\n\\end{table}\n\n108 out of 116 bands stronger than $10^{-25}$ cm/molecule are stable.\nBands involving bending excitations are also very stable.  For some\nbands, such as 32203--03301 and 42201--03301 $J$-localized instabilities\nappear only weakly, generating peaks which do not exceed the critical\nvalue.\n\n\\subsection{Comparison with high-accuracy measurements}\n\nPolyansky {\\textit{et al.}}\\ \\cite{jt613} showed that transition intensities\nbased on the (A,U) model gave excellent agreement with new, high\naccuracy measurements of the 30013 -- 00001 band in the\n6200--6258 {cm$^{-1}$}\\ reported in the same paper. Polyansky {\\textit{et al.}}\\ also\ncompared their predictions with the high accuracy mearurements\nof Casa {\\textit{et al.}}\\ \\cite{07CaPaCa.CO2,09CaWeCa.CO2} and Wuebbeler\n{\\textit{et al.}}\\ \\cite{11WuViJo.CO2} for the 20012 -- 00001 band.\nWhile their results were in excellent agreement with the single line\nintensity measured by  Wuebbeler\n{\\textit{et al.}}, they suggested that the results of Casa {\\textit{et al.}}'s results were\nsignificantly less accurate than claimed. This assertion has since\nbeen confirmed by new high-accuracy\n measurements performed by Brunzendorf {\\textit{et al.}}\\ \\cite{15BrWeSe.CO2} which\nshow almost no systematic shift and average deviation\n of only 0.35\\%\\ with respect to our \n(and Polyansky {\\textit{et al.}}'s) predictions.\n\n\n\nTwo more lines in $\\nu_1+\\nu_3$ band (P34,P36) were measured by Pogany\n{\\textit{et al.}}\\ \\cite{13PoOtWe.CO2} with reported 1.1 and 1.3 \\%\\ uncertainty.\nThe corresponding UCL intensities deviate by 2.0\\% and 2.5\\%\nrespectively. Nevertheless these are on average 1\\% closer to\nexperimental values than the intensities obtained from either Ames-296\nor CDSD-296.\n\n\n\n\n\n\nVery recently Devi {\\textit{et al.}}\\ \\cite{Malathy2015} performed a detailed\nstudy at 1.6 $\\mu$m. The strongest band in this region is\n30013 -- 00001. A comparison between their measured line intensities and our predictions is\ngiven in figure \\ref{figure:Devi}.\n\n\\begin{figure}[H]\n  \\includegraphics[width=12cm]{Figure5.pdf}\n\n\\caption{Comparison of experimental line intensities from Devi {\\textit{et al.}}\\ \\cite{Malathy2015} for the 30013 -- 00001 band with present (UCL) and HITRAN2012 values. Relative deviation is defined as \n$\\left[\\frac{I(x)}{I(Devi)}-1\\right]\\times 100\\% $, where $x=$HITRAN,UCL.}\n\\centering\n\\label{figure:Devi}\n\\end{figure}\n\n\nFrom figure \\ref{figure:Devi}\n it is evident that a majority of our line\nintensities lie within 1 \\%\\ of the new measurements. The bow-like\nbehavior seen particularly  at high $J$'s here, and in other\ncomparisons discussed below, is unlikely to be due\nto our calculations. Instead we expect it is an\nartifact associated with Herman-Wallis factors used to parameterize\nthe experimental data, which tend to\noverestimate\nline intensities for high-$J$ transitions. If this is so, then it is likely\nthat our results match Devi {\\textit{et al.}}'s at the sub-percent level.\n\nLow $J$ HITRAN2012 line intensities for the 30013 -- 00001 band\noriginate from the JPL OCO linelist of Toth {\\textit{et al.}}\\ \\cite{08ToBrMi} and\nlie on average 0.5~\\%\\ above the value of Devi {\\textit{et al.}}. These lines are\nmarked with a 7 as the HITRAN intensity uncertainty code which means\nthat these line lintensities are accurate within 2\\%. The high-$J$\nline intensities ($J > 45$) are all calculated values based on a fitted\neffective dipole moment model \\cite{12TaPe}. They have 3 as\nthe HITRAN intensity uncertainty code but may have errors in the\nintensity greater than 20\\%. The clearly visible jump in HITRAN points\nin figure \\ref{figure:Devi} is located at the meeting point of the two\ndata sources.\n\n\n\n\\subsection{Comparison with other line lists}\n\n\n\\textbf{Ames-296}\n\nHuang {\\textit{et al.}}\\ \\cite{14HuGaFr.CO2} published infrared line lists for 12\nstable and 1 radioactive isotopologues of CO$_2$.  These linelists\nwere calculated with Ames-1 PES \\cite{12HuScTa.CO2} and DMS-N2\n\\cite{13HuFrTa.CO2}, or (A,A) in our notation above.  \n We generated from their data a\n$^{12}$C$^{16}$O$_2$ line list for its natural abundance, \n$T =296$~K and with an intensity cutoff of $10^{-30}$ cm/molecule, which\nwe refer to as Ames-296.  Ames-296 contains 162~558 lines\nin the 0 - 8000 {cm$^{-1}$}\\ range.  To facilitate comparison with other\nline lists we performed a spectroscopic assignment of this line list.\nAs a first step, for the sake of consistency, it was necessary to\ncompare energy levels from original Ames-296 linelist with our DVR3D\nrecalculation.  Energy levels up to 6000 {cm$^{-1}$}\\ gave a RMSD\nof 0.05 {cm$^{-1}$}\\, and 0.06 {cm$^{-1}$}\\ up to 10 000 {cm$^{-1}$}. This is slightly more than\nwe would have expected  on the basis of previous comparisons \\cite{jt309}\nand appears to be due a slightly non-optimal choice integration grids\nin Huang {\\textit{et al.}}'s calculations (Huang and Lee, 2015, private communication).\\\\\n\n\n\n\n\n\\textbf{CDSD-296}\n\n\nThe effective operator approach enables one to reproduce all published\nobserved positions and intensities with accuracies compatible with\nmeasurement uncertainties. Based on fitted $H_{\\rm eff}$ and $D_{\\rm\n  eff}$ models Tashkun et al. \\cite{Tashkun2015} created a high\nresolution spectroscopic databank CDSD-296 aimed at atmospheric\napplications.  The databank contains the calculated line parameters\n(positions, intensities, air-and self-broadened half-widths,\ncoefficients of temperature dependence of air-broadened half-widths\nand air pressure-induced lineshifts) of the twelve stable isotopic\nspecies of CO$_2$. The reference temperature is 296 K and the\nintensity cutoff is $10^{-30}$\ncm/molecule. \\\\\n\n\nFigure \\ref{figure:CDSDrms} compares Ames and UCL line intensities with the\nsemi-empirical CDSD-296 results.  For the sake of clarity only strong\nbands with intensities greater than $10^{-23}$ cm/molecule are\nplotted.\n\n\n\\begin{figure}[H]\n  \\includegraphics[width=12cm]{Figure6.pdf}\n\n\\caption{Root mean square deviation for bands intensities of Ames-296 (red\ntriangles) and the present results (UCL, blue circles) with respect to CDSD-296}\n\\centering\n\\label{figure:CDSDrms}\n\\end{figure}\n\n\nFor the strongest bands UCL linelist agrees much more closely with\nCDSD-296 than Ames-296 does.  The only real exception to this are the\n00031-00001 and 01131-01101 bands. For this family of bands, whose\nintensity derives from the same dipole moment derivative, the\ndeviations from Ames-296 are three times less than UCL ones.\nWe identified 3170 transitions belonging to this family.\n\n\n\\subsection{HITRAN2012}\n\nHITRAN2012 \\cite{jt557} contains 160~292 $^{12}$C$^{16}$O$_2$\nlines in 0 -- 8000 {cm$^{-1}$}\\ region.  \nA matching procedure for our Ames-1 PES\nenergy levels to those originally extracted from HITRAN2012 database\nwas conducted by imposing rigorous restrictions on rotational quantum\nnumbers and rotationless parities as well as 0.3 {cm$^{-1}$}\\ tolerance for\nenergy difference. This scheme matched all 16~777\nunique energy levels present in HITRAN2012 covering $J$ values from 0 to\n129  with RMSD of 0.07 {cm$^{-1}$}.\nThe largest deviation found between two levels was roughly 0.2 {cm$^{-1}$}. \n\nThe next step was to match transition lines between HITRAN2012 and UCL\nlinelists. The procedure relied on a simple algorithm, where\ncorresponding lines were matched using already matched energy\nlevels list. As a result all 160~292 lines up to 8000 {cm$^{-1}$}\\ were matched\nwith a RMSD of 0.08 {cm$^{-1}$}\\ in line positions.\n\n\nThere are two main sources of HITRAN2012 data for CO$_2$ main\nisotopologue: a small set of 605 lines in 4800-6989 {cm$^{-1}$}\\ range\noriginating from experiment (JPL OCO line list) by Toth {\\textit{et al.}}\\\n\\cite{08ToBrMi} and the majority of transitions from a previous\nversion of CDSD.  In general data from latest version\nof CDSD-296 are very close to line positions and intensities given in\nHITRAN2012.\n\nThe estimated uncertainties for all CDSD intensities is given as 20\n\\%\\ or worse in HITRAN (uncertainty code 3). On the other hand, Toth {\\textit{et al.}}'s\nintensities are supposed be accurate to better than 2\\%\\ (uncertainty\ncode 7) or 5\\%\\ (code 6). This reveals two\nissues with current version of HITRAN: \\\\\na) The stated uncertianty estimate\nof all current entries are\ninsufficiently \naccurate for remote sensing applications. Our previous study \\cite{jt613} already\nshowed that for a number of important bands the actual accuracy of the\nintensities in HITRAN is much higher than suggested by their estimated uncertainties.\\\\\n b) line intensity accuracies\nare not uniform throughout the spectral region. \nOur experience from studies on several molecules is that the ratio of observed\nto variational line intensies should be roughly constant for a given unless there\nis an isolated resonance (see below). For CO$_2$,  comparing HITRAN\nintensities with our predictions we would expect the same, but\ndetailed analysis (cf. figure \\ref{figure:Int_20012}), that such jumps\nin accuracy cause artificial patterns in line intensities\nwithin a single vibrational band. \n\nAll HITRAN2012 entries taken from a pre-release version of CDSD have\nbeen tagged with uncertainty code 3 (20\\%\\ or worse). \nHowever, this number does not reflect actual uncertainties of\nthe intensities. Most of the HITRAN intensities have the uncertainties\nmuch better than 20\\%. More detailed information about the actual\nuncertainties can be found in the official release of CDSD\n\\cite{15TaPeGa.CO2}. The reader should use this work in order to get a\nrealistic information about the uncertainties of the line parameters.\n\nFigure \\ref{figure:overview} gives a general overview of the two\nlinelists. Overall the agreement is excellent with more than 98\\%\\ of\nentries common between both lists and very similar intensities. However,\nthere is some incomplete coverage by HITRAN2012\nwith several artificial windows, especially for low intensity\ntransitions. There are also a few missing medium-intensity\ntransitions around 400 {cm$^{-1}$}\\ and 1600 {cm$^{-1}$}. \n\n\\begin{figure}[H]\n\\includegraphics[width=12cm]{Figure7.pdf}\n\n\\caption{General comparison of the HITRAN2012 and UCL CO$_2$ 296~K linelists for the 0 -- 8000 {cm$^{-1}$}\\ region.}\n\\centering\n\\label{figure:overview}\n\\end{figure}\n\n\n\n\nIntensities of all assigned UCL lines relative to HITRAN2012 are\ndepicted in figure ~\\ref{figure:fullcomp}. As expected discrepancies between the two\nlinelists grow as lines get weaker, which results in a funnel-like shape\nin the plot which characteristic of such comparisons (e.g. \\cite{jt285}). \nThe stability of the UCL lines on the scatter factors are\nalso shown; as could be  anticipated stable lines predominate \nat higher intensities.\n\n\\begin{figure}[H]\n\\includegraphics[width=12cm]{Figure8.pdf}\n\n\\caption{Comparison of HITRAN2012 and UCL line intensities: UCL to\n  HITRAN intensity ratio as a function of HITRAN line intensity. Blue\n  points stand for unstable lines according to our sensitivity\n  analysis, while red points are considered to be stable.  There are\n  147 000 stable, 7000 intermediate, 4400 unstable and 1 400 unknown\n  lines which are too weak for a scatter factor to be determined reliably.}\n\\centering\n\\label{figure:fullcomp}\n\\end{figure}\n\n\n\n\n\n\nIt is instructive to divide HITRAN2012 data into subsets of a given\nintensity accuracy code. Each of those sets can be then compared to\nour results separately to provide an estimate for compatibility of two\nlinelists at different levels of accuracy. To achieve that we plotted \nHITRAN intensities with the  accuracy code found for CO$_2$ which is 7 \n(2~\\%\\ or better uncertainty) against the UCL ones.\nThis set of lines encompass the important\n20011, 20012, 20013, 30011, 30012, 30013 and 30014 bands as well as  the asymmetric\nstretching second overtone 00031. All bands except intermediate 30011 band are stable.  Comparisons with high accuracy measurements above have\nalready shown that our results for the 30013 band are accurate to about\n1~\\%\\ or better.\n\n\n\n\n\n\n\nAgain one can see\ncharacteristic bow-like structures corresponding to particular\nrotational transitions within a vibrational band, with the peak of an\narc refers to most intense, low $J$ transition. We suggest that these\nstructures are artifacts which originate from the semi-empirical treatment of the intensities.\n\nA similar situation occurs for bands with HITRAN uncertainty code 6, see \nfigure \\ref{figure:ier6}; here very good agreement is spoiled by\n01131 -- 01101 band.\n\n\\begin{figure}[H]\n\\centering\n\\includegraphics[width=12cm]{Figure9.pdf}\n\n\\caption{Comparison of HITRAN2012 most accurate intensities and UCL line intensities. \nThe dashed line indicates the stated HITRAN uncertainty, i.e. 2\\%. Arrows label vibrational\nbands, which all start from the ground 00001 state.}\n\\label{figure:toth}\n\\end{figure}\n\n\\begin{figure}[H]\n\\centering\n\\includegraphics[width=12cm]{Figure10.pdf}\n\n\\caption{Comparison of HITRAN2012 medium-accuracy intensities and UCL line intensities. \nThe dashed line indicates the stated HITRAN uncertainty, i.e. 5\\%. Arrows label vibrational\nbands.}\n\\label{figure:ier6}\n\\end{figure}\n\n\n\n\n\n\nFigure~\\ref{figure:Int_20012} gives an intensities comparison for the\n20012 band.  HITRAN 2012 used two separate data sources for this band.\nThis is clearly visible which means, despite the overall good\nagreement with present results, there is an abrupt change in intensity\ntrends at $J=64$. This is the point where the experimental data\nfinished and the database had to rely on results from a the CDSD\neffective Hamiltonian calculations.\n\n\n\\begin{figure}[H]\n\\hfill\\includegraphics[width=12cm]{Figure11.pdf}\n\n\\caption{HITRAN2012 vs. UCL line intensities comparison for the 20012 -- 00001 band. Two HITRAN data sources are marked with red circles (CDSD-semiempirical calculations) and blue (Toth {\\textit{et al.}}-experimental)}\n\\centering\n\\label{figure:Int_20012}\n\\end{figure}\n\n\n\n\\subsection{A HITRAN-style line list}\nThe final UCL-296 line list, given as supplementary data, contains\n162~468 line positions, intensities scaled by natural abundance\n(0.98420), quantum numbers and scatter factors taken from our\ncomputation.\n\nOur final recommended line list for $^{12}$C$^{16}$O$_2$ is\nalso given in supplementary data. This list contains\n162~260 lines in HITRAN format\nwith intensities scaled by natural abundance and uniformly cut off at\n10$^{-30}$ cm/molecule. Vibrational quantum numbers were taken from\nCDSD  and cross-checked with HITRAN2012 assignments. \nLine positions were transferred from CDSD-296 with appropriate uncertainties.  \n\nThe majority of line intensities (151~602) were taken from our ``AU``\ncalculations; we assign HITRAN uncertainty code 8 for stable bands\nwith at least one transition stronger than $10^{-23}$ cm/molecule and\n7 for stable bands weaker than $10^{-25}$ cm/molecule together with\n8647 lines from intermediate bands.\n \nWhenever our line intensity turned out to be unreliable (i.e. was either\nunstable and no additional tests confirmed its high accuracy or belonged to \n$3v_3$ family of bands) it was replaced by CDSD-296 value.\nThis was the case for  10 080 (6\\%) lines.\n\n\n\n\n\\section{Conclusion}\n\nWe present a new mixed ab initio-empirical linelist providing reliable\nintensities for $^{12}$C$^{16}$O$_2$  up to 8000 {cm$^{-1}$}. \nWe believe  this line list is more complete and the intensities more\naccurate than in HITRAN2012 \\cite{jt557}. \nA detailed analysis\nshows that our line intensities generally are accurate\nat the  sub-percent level when compared\nto recent, high-accuracy measurements, consequently validating\nour approach; furthermore we find that intensity  uncertainties \nstated in HITRAN2012 are probably too conservative. \nWe believe these improved intensities\nshould assist to improve CO$_2$ monitoring in\n remote atmospheric sensing studies, and in other applications.\nFurthermore this new line lists fills in the small gaps in the\n HITRAN2012 list. Of course for use in atmospheric conditions\nthis line list needs to be supplemented by both line profile\nparameters and consideration of line-mixing \\cite{10LaTrLa.CO2}.\n   \nOne issue that we should raise concerns perpendicular transitions\n(those with $\\Delta \\ell = \\pm 1$ and $\\pm 2$).The majority of the perpendicular\nbands borrow intensity from the considerably stronger parallel\n($\\Delta \\ell=0$) bands via Coriolis resonance or anharmonic plus\n$\\ell$-type interactions.  To describe this process it is necessary to\nhave very precise wavefunctions.  So far, the very high accuracy of\nthe line intensity calculations presented here is confirmed\nexperimentally only for parallel bands. All weaker bands have been\ngiven a lower accuracy rating in our line list; none-the-less it would\nbe very helpful to have some high accuracy experimental measurements\nof perpendicular bands to help to independently validate our results.\n\n\nFuture work will focus on two aspects of the problem. First, it is\napparent that our {\\it ab initio} dipole moment surface is less\naccurate for transitions involving changes of 3 or more quanta in $\\nu_3$.\nThis problem will be the subject of future theoretical investigation which\nwill also aim to extend our model to frequencies higher than 8000 {cm$^{-1}$}.\nSecond, a major advantage of our methodology is that theoretical calculations\ncan be used to give intensities for all isotopologues of CO$_2$ with essentially\nthe same accuracy as the  $^{16}$O$^{12}$C$^{16}$O results presented\nhere. This should be particularly used in providing accurate intensities\nfor trace species such as  $^{16}$O$^{14}$C$^{16}$O, which are important\nfor monitoring purposes \\cite{13LeMiWo.CO2}. Line lists for isotopically\nsubstituted CO$_2$ will be published in the near future.\n\n\n\n\\section*{Acknowledgments}\nThis work is supported by the UK Natural Environment Research Council (NERC) through grant NE/J010316,\nthe ERC under the Advanced Investigator Project\n267219 and the Russian Fund for Fundamental Science.  \nWe would like to thank Jens Brunzendorf and V Malathy Devi for sharing their results with us prior to publication.\n\n\n\n \n\\bibliographystyle{elsarticle-num}\n\n\n\n\\begin{thebibliography}{10}\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\expandafter\\ifx\\csname href\\endcsname\\relax\n  \\def\\href#1#2{#2} \n\\def\\path#1{#1}\\fi\n\n\n\\bibitem{GOSAT}\nA.~Butz, S.~Guerlet, O.~Hasekamp, D.~Schepers, A.~Galli, I.~Aben,\n  C.~Frankenberg, J.~M. Hartmann, H.~Tran, A.~Kuze, G.~Keppel-Aleks, G.~Toon,\n  D.~Wunch, P.~Wennberg, N.~Deutscher, D.~Griffith, R.~Macatangay,\n  J.~Messerschmidt, J.~Notholt, T.~Warneke, {Toward accurate CO$_2$ and CH$_4$\n  observations from GOSAT}, Geophys. Res. Lett. {38} ({2011}) L14812.\n\\newblock \\href {http://dx.doi.org/{10.1029/2011GL047888}}\n  {\\path{doi:{10.1029/2011GL047888}}}.\n\n\\bibitem{OCO}\nD.~Crisp, R.~Atlas, F.~Breon, L.~Brown, J.~Burrows, P.~Ciais, B.~Connor,\n  S.~Doney, I.~Y. Fung, D.~Jacob, C.~Miller, D.~O'Brien, S.~Pawson, J.~T.\n  Randerson, P.~Rayner, R.~Salawitch, S.~Sander, B.~Sen, G.~Stephens, P.~Tans,\n  G.~Toon, P.~Wennberg, S.~Wofsy, Y.~Yung, Z.~Kuang, B.~Chudasama, G.~Sprague,\n  B.~Weiss, R.~Pollock, D.~Kenyon, S.~Schroll, {The Orbiting Carbon Observatory\n  (OCO) mission}, Adv. Space Res. {34} ({2004}) 700--709.\n\\newblock \\href {http://dx.doi.org/{10.1016/j.asr.2003.08.062}}\n  {\\path{doi:{10.1016/j.asr.2003.08.062}}}.\n\n\\bibitem{ASCENDS}\nJ.~B. Abshire, H.~Riris, G.~R. Allan, C.~J. Weaver, J.~Mao, X.~Sun, W.~E.\n  Hasselbrack, A.~Yu, A.~Amediek, Y.~Choi, E.~V. Browell, {A Lidar Approach to\n  Measure CO$_2$ Concentrations from Space for the ASCENDS Mission}, {SPIE}\n  {7832} ({2010}) 78320D.\n\\newblock \\href {http://dx.doi.org/{10.1117/12.868567}}\n  {\\path{doi:{10.1117/12.868567}}}.\n\n\\bibitem{TCCON}\nD.~Wunch, G.~C. Toon, J.-F.~L. Blavier, R.~A. Washenfelder, J.~Notholt, B.~J.\n  Connor, D.~W.~T. Griffith, V.~Sherlock, P.~O. Wennberg, {The Total Carbon\n  Column Observing Network}, Phil. Trans. Royal Soc. London A {369} ({2011})\n  2087--2112.\n\\newblock \\href {http://dx.doi.org/{10.1098/rsta.2010.0240}}\n  {\\path{doi:{10.1098/rsta.2010.0240}}}.\n\n\\bibitem{NDACC}\nF.~Hase, {Improved instrumental line shape monitoring for the ground-based,\n  high-resolution FTIR spectrometers of the Network for the Detection of\n  Atmospheric Composition Change}, Atmos. Meas. Tech. {5} ({2012}) 603--610.\n\n\\bibitem{Emmert2012}\nJ.~T. Emmert, M.~H. Stevens, P.~F. Bernath, D.~P. Drob, C.~D. Boone,\n  Observations of increasing carbon dioxide concentration in earth's\n  thermosphere, Nature Geoscience 5 (2012) 868--871.\n\\newblock \\href {http://dx.doi.org/10.1038/ngeo1626}\n  {\\path{doi:10.1038/ngeo1626}}.\n\n\\bibitem{jt453}\nL.~S. Rothman, I.~E. Gordon, A.~Barbe, D.~C. Benner, P.~F. Bernath, M.~Birk,\n  V.~Boudon, L.~R. Brown, A.~Campargue, J.~P. Champion, K.~Chance, L.~H.\n  Coudert, V.~Dana, V.~M. Devi, S.~Fally, J.~M. Flaud, R.~R. Gamache,\n  A.~Goldman, D.~Jacquemart, I.~Kleiner, N.~Lacome, W.~J. Lafferty, J.~Y.\n  Mandin, S.~T. Massie, S.~N. Mikhailenko, C.~E. Miller, N.~Moazzen-Ahmadi,\n  O.~V. Naumenko, A.~V. Nikitin, J.~Orphal, V.~I. Perevalov, A.~Perrin,\n  A.~Predoi-Cross, C.~P. Rinsland, M.~Rotger, M.~Simeckova, M.~A.~H. Smith,\n  K.~Sung, S.~A. Tashkun, J.~Tennyson, R.~A. Toth, A.~C. Vandaele,\n  J.~Vander~Auwera, {The {\\it HITRAN} 2008 molecular spectroscopic database},\n  J. Quant. Spectrosc. Radiat. Transf. 110 (2009) 533--572.\n\n\\bibitem{jt584}\nJ.~Tennyson, P.~F. Bernath, A.~Campargue, A.~G. Cs\\'asz\\'ar, L.~Daumont, R.~R.\n  Gamache, J.~T. Hodges, D.~Lisak, O.~V. Naumenko, L.~S. Rothman, H.~Tran,\n  N.~F. Zobov, J.~Buldyreva, C.~D. Boone, M.~D. {De Vizia}, L.~Gianfrani, J.-M.\n  Hartmann, R.~McPheat, J.~Murray, N.~H. Ngo, O.~L. Polyansky, D.~Weidmann,\n  {Recommended isolated-line profile for representing high-resolution\n  spectroscopic transitions (IUPAC Technical Report)}, Pure Appl. Chem. 86\n  (2014) 1931--1943.\n\n\\bibitem{Wang2005}\nL.~Wang, V.~I. Perevalov, S.~A. Tashkun, Y.~Ding, S.-M. Hu, {Absolute line\n  intensities of $^{13}$C$^{16}$O$_2$ in the 4200{\\textendash}8500 cm$^{-1}$\n  region}, J. Mol. Spectrosc. 234 (2005) 84--92.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jms.2005.08.008}\n  {\\path{doi:10.1016/j.jms.2005.08.008}}.\n\n\\bibitem{Perevalov2008}\nB.~V. Perevalov, A.~Campargue, B.~Gao, S.~Kassi, S.~A. Tashkun, V.~I.\n  Perevalov, New {CW}-{CRDS} measurements and global modeling of\n  {$^{12}$C$^{16}$O$_2$} absolute line intensities in the 1.6$\\mu$m region, J.\n  Mol. Spectrosc. 252 (2008) 190--197.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jms.2008.08.006}\n  {\\path{doi:10.1016/j.jms.2008.08.006}}.\n\n\\bibitem{Song2010}\nK.~F. Song, S.~Kassi, S.~A. Tashkun, V.~I. Perevalov, A.~Campargue, High\n  sensitivity {CW}-cavity ring down spectroscopy of 12co2 near 1.35$\\mu$m\n  ({II}): New observations and line intensities modeling, J. Quant. Spectrosc.\n  Radiat. Transf. 111 (2010) 332--344.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jqsrt.2009.09.004}\n  {\\path{doi:10.1016/j.jqsrt.2009.09.004}}.\n\n\\bibitem{Hashemi2013}\nR.~Hashemi, H.~Rozario, A.~Ibrahim, A.~Predoi-Cross, {Line shape study of the\n  carbon dioxide laser band I$^1$}, Can. J. Phys. 91 (2013) 924--936.\n\\newblock \\href {http://dx.doi.org/10.1139/cjp-2013-0051}\n  {\\path{doi:10.1139/cjp-2013-0051}}.\n\n\\bibitem{06BoMaDa.CO2}\nD.~Boudjaadar, J.-Y. Mandin, V.~Dana, N.~Picqu{\\'e}, G.~Guelachvili,\n  {$^{12}$C$^{16}$O$_2$ line intensity measurements around 1.6 $\\mu$m}, J. Mol.\n  Spectrosc. 236 (2006) 158 -- 167.\n\\newblock \\href {http://dx.doi.org/http://dx.doi.org/10.1016/j.jms.2006.01.007}\n  {\\path{doi:http://dx.doi.org/10.1016/j.jms.2006.01.007}}.\n\n\\bibitem{OBrien2002}\nD.~M. O'Brien, P.~J. Rayner, {Global observations of the carbon budget, 2,\n  CO$_2$ column from differential absorption of reflected sunlight in the 1.61\n  $\\mu$m band of CO$_2$}, J. Geophys. Res. 107~(D18) (2002) ACH~6.\n\\newblock \\href {http://dx.doi.org/10.1029/2001jd000617}\n  {\\path{doi:10.1029/2001jd000617}}.\n\n\\bibitem{XOCO}\nC.~E. Miller, D.~Crisp, P.~L. DeCola, S.~C. Olsen, J.~T. Randerson, A.~M.\n  Michalak, A.~Alkhaled, P.~Rayner, D.~J. Jacob, P.~Suntharalingam, D.~B.~A.\n  Jones, A.~S. Denning, M.~E. Nicholls, S.~C. Doney, S.~Pawson, H.~Boesch,\n  B.~J. Connor, I.~Y. Fung, D.~O'Brien, R.~J. Salawitch, S.~P. Sander, B.~Sen,\n  P.~Tans, G.~C. Toon, P.~O. Wennberg, S.~C. Wofsy, Y.~L. Yung, R.~M. Law,\n  {Precision requirements for space-based X-CO2 data}, J. Geophys. Res. {112}\n  ({2007}) D10314.\n\\newblock \\href {http://dx.doi.org/{10.1029/2006JD007659}}\n  {\\path{doi:{10.1029/2006JD007659}}}.\n\n\\bibitem{Sioris2014}\nC.~E. Sioris, C.~D. Boone, R.~Nassar, K.~J. Sutton, I.~E. Gordon, K.~A. Walker,\n  P.~F. Bernath, Retrieval of carbon dioxide vertical profiles from solar\n  occultation observations and associated error budgets for {ACE}-{FTS} and\n  {CASS}-{FTS}, Atmos. Meas. Tech. 7 (2014) 2243--2262.\n\\newblock \\href {http://dx.doi.org/10.5194/amt-7-2243-2014}\n  {\\path{doi:10.5194/amt-7-2243-2014}}.\n\n\\bibitem{07CaPaCa.CO2}\nG.~Casa, D.~A. Parretta, A.~Castrillo, R.~Wehr, L.~Gianfrani, Highly accurate\n  determinations of co$_2$ line strengths using intensity-stabilized diode\n  laser absorption spectrometry, J. Chem. Phys. 127 (2007) 084311.\n\\newblock \\href {http://dx.doi.org/http://dx.doi.org/10.1063/1.2759930}\n  {\\path{doi:http://dx.doi.org/10.1063/1.2759930}}.\n\n\\bibitem{09CaWeCa.CO2}\nG.~Casa, R.~Wehr, A.~Castrillo, E.~Fasci, L.~Gianfrani, {The line shape problem\n  in the near-infrared spectrum of self-colliding CO$_2$ molecules:\n  Experimental investigation and test of semiclassical models}, J. Chem. Phys.\n  130 (2009) 184306.\n\\newblock \\href {http://dx.doi.org/http://dx.doi.org/10.1063/1.3125965}\n  {\\path{doi:http://dx.doi.org/10.1063/1.3125965}}.\n\n\\bibitem{11WuViJo.CO2}\nG.~Wuebbeler, G.~J.~P. Viquez, K.~Jousten, O.~Werhahn, C.~Elster, {Comparison\n  and assessment of procedures for calculating the R(12) line strength of the\n  $\\nu_1 +2\\nu_2 + \\nu_3$ band of CO$_2$}, J. Chem. Phys. {135} ({2011})\n  204304.\n\\newblock \\href {http://dx.doi.org/{10.1063/1.3662134}}\n  {\\path{doi:{10.1063/1.3662134}}}.\n\n\\bibitem{jt613}\nO.~L. Polyansky, K.~Bielska, M.~Ghysels, L.~Lodi, N.~F. Zobov, J.~T. Hodges,\n  J.~Tennyson, {High accuracy CO$_2$ line intensities determined from theory\n  and experiment}, Phys. Rev. Lett. 114 (2015) 243001.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRevLett.114.24300}\n  {\\path{doi:10.1103/PhysRevLett.114.24300}}.\n\n\\bibitem{Malathy2015}\nV.~M. Devi, D.~C. Benner, K.~Sung, L.~R. Brown, T.~J. Crawford, C.~E. Miller,\n  B.~J. Drouin, V.~H. Payne, S.~Yu, M.~A.~H. Smith, A.~W. Mantz, Line\n  parameters including temperature dependences of self- and air-broadened line\n  shapes of {$^{12}$C$^{16}$O$_2$}: 1.6-$\\mu$m region, J. Quant. Spectrosc.\n  Radiat. Transf.\\href {http://dx.doi.org/submitted} {\\path{doi:submitted}}.\n\n\\bibitem{15BrWeSe.CO2}\nJ.~Brunzendorf, V.~Werwein, A.~Serduykov, O.~Werhahn, V.~Ebert, {CO$_2$ line\n  strength measurements in the 20012--00001 band near 2 $\\mu$m}, in: The 24th\n  Colloquium on High Resolution Molecular Spectroscopy, 2015, p. O17.\n\n\\bibitem{Tashkun2015}\nS.~A. Tashkun, V.~I. Perevalov, R.~R. Gamache, J.~Lamouroux, {CDSD}-296, high\n  resolution carbon dioxide spectroscopic databank: Version for atmospheric\n  applications, J. Quant. Spectrosc. Radiat. Transf. 152 (2015) 45--73.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jqsrt.2014.10.017}\n  {\\path{doi:10.1016/j.jqsrt.2014.10.017}}.\n\n\\bibitem{92WaRoxx.CO2}\nR.~B. Wattson, L.~S. Rothman, Direct numerical diagonalization - wave of the\n  future, J. Quant. Spectrosc. Radiat. Transf. 48 (1992) 763--780.\n\n\\bibitem{94DaMaBa.CO2}\nV.~Dana, J.~Y. Mandin, A.~Barbe, J.~J. Plateaux, L.~S. Rothman, R.~B. Wattson,\n  {$^{12}$C$^{16}$O$_2$} line-intensities in the 4.8 $\\mu$m spectral region, J.\n  Quant. Spectrosc. Radiat. Transf. {52} ({1994}) 333--340.\n\\newblock \\href {http://dx.doi.org/10.1016/0022-4073(94)90163-5}\n  {\\path{doi:10.1016/0022-4073(94)90163-5}}.\n\n\\bibitem{12HuScTa.CO2}\nX.~Huang, D.~W. Schwenke, S.~A. Tashkun, T.~J. Lee, {An isotopic-independent\n  highly accurate potential energy surface for CO$_2$ isotopologues and an\n  initial $^{12}$C$^{16}$O$_2$ infrared line list}, J. Chem. Phys. 136 (2012)\n  124311.\n\\newblock \\href {http://dx.doi.org/10.1063/1.3697540}\n  {\\path{doi:10.1063/1.3697540}}.\n\n\\bibitem{13HuFrTa.CO2}\nX.~Huang, R.~S. Freedman, S.~A. Tashkun, D.~W. Schwenke, T.~J. Lee,\n  {Semi-empirical $^{12}$C$^{16}$O$_2$ IR line lists for simulations up to 1500\n  K and 20,000 cm$^{-1}$}, J. Quant. Spectrosc. Radiat. Transf. {130} ({2013})\n  134--146.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jqsrt.2013.05.018}\n  {\\path{doi:10.1016/j.jqsrt.2013.05.018}}.\n\n\\bibitem{14HuGaFr.CO2}\nX.~Huang, R.~R. Gamache, R.~S. Freedman, D.~W. Schwenke, T.~J. Lee, {Reliable\n  infrared line lists for 13 CO$_2$ isotopologues up to E =18,000 cm$^{-1}$ and\n  1500 K, with line shape parameters}, J. Quant. Spectrosc. Radiat. Transf.\n  {147} ({2014}) 134--144.\n\\newblock \\href {http://dx.doi.org/{10.1016/j.jqsrt.2014.05.015}}\n  {\\path{doi:{10.1016/j.jqsrt.2014.05.015}}}.\n\n\\bibitem{92TeSuPe.CO2}\nJ.~L. Teffo, O.~N. Sulakshina, V.~I. Perevalov, Effective {H}amiltonian for\n  rovibrational energies and line-intensities of carbon-dioxide, J. Mol.\n  Spectrosc. {156} ({1992}) 48--64.\n\\newblock \\href {http://dx.doi.org/10.1016/0022-2852(92)90092-3}\n  {\\path{doi:10.1016/0022-2852(92)90092-3}}.\n\n\\bibitem{02TaPeTe.CO2}\nS.~A. Tashkun, V.~I. Perevalov, J.~L. Teffo, A.~D. Bykov, N.~N. Lavrentieva,\n  {CDSD-1000, the high-temperature carbon dioxide spectroscopic databank}, J.\n  Quant. Spectrosc. Radiat. Transf. {82} ({2003}) 165--196.\n\\newblock \\href {http://dx.doi.org/{10.1016/S0022-4073(03)00152-3}}\n  {\\path{doi:{10.1016/S0022-4073(03)00152-3}}}.\n\n\\bibitem{11TaPe.CO2}\nS.~A. Tashkun, V.~I. Perevalov, {CDSD-4000: High-resolution, high-temperature\n  carbon dioxide spectroscopic databank}, J. Quant. Spectrosc. Radiat. Transf.\n  112 (2011) 1403--1410.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jqsrt.2011.03.005}\n  {\\path{doi:10.1016/j.jqsrt.2011.03.005}}.\n\n\\bibitem{jt509}\nL.~Lodi, J.~Tennyson, O.~L. Polyansky, A global, high accuracy ab initio dipole\n  moment surface for the electronic ground state of the water molecule, J.\n  Chem. Phys. 135 (2011) 034113.\n\n\\bibitem{jt522}\nL.~Lodi, J.~Tennyson, {Line lists for H$_2$$^{18}$O and H$_2$$^{17}$O based on\n  empirically-adjusted line positions and ab initio intensities}, J. Quant.\n  Spectrosc. Radiat. Transf. 113 (2012) 850--858.\n\n\\bibitem{jt530}\nM.~Grechko, O.~Aseev, T.~R. Rizzo, N.~F. Zobov, L.~Lodi, J.~Tennyson, O.~L.\n  Polyansky, O.~V. Boyarkin, {Stark coefficients for highly excited\n  rovibrational states of H$_2$O}, J. Chem. Phys. 136 (2012) 244308.\n\n\\bibitem{jt587}\nA.~Petrignani, M.~Berg, A.~Wolf, I.~I. Mizus, O.~L. Polyansky, J.~Tennyson,\n  N.~F. Zobov, M.~Pavanello, L.~Adamowicz, Visible intensities of the triatomic\n  hydrogen ion from experiment and theory, J. Chem. Phys. 141 (2014) 241104.\n\\newblock \\href {http://dx.doi.org/10.1063/1.4904440}\n  {\\path{doi:10.1063/1.4904440}}.\n\n\\bibitem{jt557}\nL.~S. Rothman, I.~E. Gordon, Y.~Babikov, A.~Barbe, D.~C. Benner, P.~F. Bernath,\n  M.~Birk, L.~Bizzocchi, V.~Boudon, L.~R. Brown, A.~Campargue, K.~Chance, E.~A.\n  Cohen, L.~H. Coudert, V.~M. Devi, B.~J. Drouin, A.~Fayt, J.-M. Flaud, R.~R.\n  Gamache, J.~J. Harrison, J.-M. Hartmann, C.~Hill, J.~T. Hodges,\n  D.~Jacquemart, A.~Jolly, J.~Lamouroux, R.~J. {Le Roy}, G.~Li, D.~A. Long,\n  O.~M. Lyulin, C.~J. Mackie, S.~T. Massie, S.~Mikhailenko, H.~S.~P.\n  M{\\\"u}ller, O.~V. Naumenko, A.~V. Nikitin, J.~Orphal, V.~Perevalov,\n  A.~Perrin, E.~R. Polovtseva, C.~Richard, M.~A.~H. Smith, E.~Starikova,\n  K.~Sung, S.~Tashkun, J.~Tennyson, G.~C. Toon, V.~G. Tyuterev, G.~Wagner, {The\n  {\\it HITRAN} 2012 molecular spectroscopic database}, J. Quant. Spectrosc.\n  Radiat. Transf. 130 (2013) 4 -- 50.\n\\newblock \\href {http://dx.doi.org/10.1016/jqsrt.2013.07.002}\n  {\\path{doi:10.1016/jqsrt.2013.07.002}}.\n\n\\bibitem{14ReOuMiWa}\nL.~Regalia, C.~Oudot, S.~Mikhailenko, L.~Wang, X.~Thomas, A.~Jenouvrier,\n  P.~Von~der Heyden, Water vapor line parameters from 6450 to 9400 cm$^{-1}$,\n  J. Quant. Spectrosc. Radiat. Transf. {136} ({2014}) 119--136.\n\\newblock \\href {http://dx.doi.org/{10.1016/j.jqsrt.2013.11.019}}\n  {\\path{doi:{10.1016/j.jqsrt.2013.11.019}}}.\n\n\\bibitem{08ToBrMi}\nR.~A., L.~R. Brown, C.~E. Miller, V.~M. Devi, D.~C. Benner, Spectroscopic\n  database of $\\mathrm{CO_2}$ line parameters: 4300-7000 $\\mathrm{cm^{-1}}$, J.\n  Quant. Spectrosc. Radiat. Transf. 109 (2008) 906--921.\n\n\\bibitem{12TaPe}\nS.~A. Tashkun, V.~I. Perevalov (2012).\n\n\\bibitem{jt45}\nB.~T. Sutcliffe, J.~Tennyson, A generalised approach to the calculation of\n  ro-vibrational spectra of triatomic molecules, Mol. Phys. 58 (1986)\n  1053--1066.\n\n\\bibitem{jt96}\nB.~T. Sutcliffe, J.~Tennyson, A general treatment of vibration-rotation\n  coordinates for triatomic molecules, Intern. J. Quantum Chem. 39 (1991)\n  183--196.\n\n\\bibitem{jt114}\nJ.~Tennyson, B.~T. Sutcliffe, Discretisation to avoid singularities in\n  vibration-rotation hamiltonians: a bisector embedding for {AB$_2$}\n  triatomics, Intern. J. Quantum Chem. 42 (1992) 941--952.\n\n\\bibitem{jt160}\nJ.~Tennyson, J.~R. Henderson, N.~G. Fulton, {DVR3D}: programs for fully\n  pointwise calculation of ro-vibrational spectra of triatomic molecules,\n  Comput. Phys. Commun. 86 (1995) 175--198.\n\n\\bibitem{jt338}\nJ.~Tennyson, M.~A. Kostin, P.~Barletta, G.~J. Harris, O.~L. Polyansky,\n  J.~Ramanlal, N.~F. Zobov, {DVR3D: a program suite for the calculation of\n  rotation-vibration spectra of triatomic molecules}, Comput. Phys. Commun. 163\n  (2004) 85--116.\n\n\\bibitem{jt156}\nA.~E. {Lynas-Gray}, S.~Miller, J.~Tennyson, Infra red transition intensities\n  for water: a comparison of {\\it ab initio} and fitted dipole moment surfaces,\n  J. Mol. Spectrosc. 169 (1995) 458--467.\n\n\\bibitem{12WeKnKn.methods}\nH.-J. Werner, P.~J. Knowles, G.~Knizia, F.~R. Manby, M.~Sch\\\"utz, Molpro: a\n  general-purpose quantum chemistry program package, WIREs Comput. Mol. Sci. 2\n  (2012) 242--253.\n\\newblock \\href {http://dx.doi.org/10.1002/wcms.82}\n  {\\path{doi:10.1002/wcms.82}}.\n\n\\bibitem{jt475}\nL.~Lodi, J.~Tennyson, {Theoretical methods for small-molecule ro-vibrational\n  spectroscopy}, J. Phys. B: At. Mol. Opt. Phys. 43 (2010) 133001.\n\n\\bibitem{jt14}\nJ.~Tennyson, B.~T. Sutcliffe, {The ab initio calculation of the\n  vibration-rotation spectrum of triatomic systems in the close-coupling\n  approach with KCN and H$_2$Ne as examples}, J. Chem. Phys. 77 (1982)\n  4061--4072.\n\n\\bibitem{jtDown}\nM.~J. Down, L.~Lodi, J.~Tennyson, {Line lists for HD$^{16}$O, HD$^{18}$O and\n  HD$^{17}$O based on empirical line positions and {\\it ab initio}\n  intensities}, J. Quant. Spectrosc. Radiat. Transf.\n\n\\bibitem{jt454}\nJ.~Tennyson, P.~F. Bernath, L.~R. Brown, A.~Campargue, M.~R. Carleer, A.~G.\n  Cs\\'asz\\'ar, R.~R. Gamache, J.~T. Hodges, A.~Jenouvrier, O.~V. Naumenko,\n  O.~L. Polyansky, L.~S. Rothman, R.~A. Toth, A.~C. Vandaele, N.~F. Zobov,\n  L.~Daumont, A.~Z. Fazliev, T.~Furtenbacher, I.~E. Gordon, S.~N. Mikhailenko,\n  S.~V. Shirin, {IUPAC critical Evaluation of the Rotational-Vibrational\n  Spectra of Water Vapor. Part I. Energy Levels and Transition Wavenumbers for\n  H$_2$$^{17}$O and H$_2$$^{18}$O}, J. Quant. Spectrosc. Radiat. Transf. 110\n  (2009) 573--596.\n\n\\bibitem{jt482}\nJ.~Tennyson, P.~F. Bernath, L.~R. Brown, A.~Campargue, M.~R. Carleer, A.~G.\n  Cs\\'asz\\'ar, L.~Daumont, R.~R. Gamache, J.~T. Hodges, O.~V. Naumenko, O.~L.\n  Polyansky, L.~S. Rothman, R.~A. Toth, A.~C. Vandaele, N.~F. Zobov, A.~Z.\n  Fazliev, T.~Furtenbacher, I.~E. Gordon, S.~N. Mikhailenko, B.~A. Voronin,\n  {IUPAC critical Evaluation of the Rotational-Vibrational Spectra of Water\n  Vapor. Part II. Energy Levels and Transition Wavenumbers for HD$^{16}$O,\n  HD$^{17}$O, and HD$^{18}$O}, J. Quant. Spectrosc. Radiat. Transf. 111 (2010)\n  2160--2184.\n\n\\bibitem{jt562}\nJ.~Tennyson, P.~F. Bernath, L.~R. Brown, A.~Campargue, A.~G. Cs\\'asz\\'ar,\n  L.~Daumont, R.~R. Gamache, J.~T. Hodges, O.~V. Naumenko, O.~L. Polyansky,\n  L.~S. Rothman, A.~C. Vandaele, N.~F. Zobov, {A Database of Water Transitions\n  from Experiment and Theory (IUPAC Technical Report)}, Pure Appl. Chem. 86\n  (2014) 71--83.\n\n\\bibitem{jt412}\nT.~Furtenbacher, A.~G. {Cs\\'asz\\'ar}, J.~Tennyson, {MARVEL: measured active\n  rotational-vibrational energy levels}, J. Mol. Spectrosc. 245 (2007)\n  115--125.\n\n\\bibitem{12FuCsi.method}\nT.~Furtenbacher, A.~G. {Cs\\'asz\\'ar}, {MARVEL: measured active\n  rotational-vibrational energy levels. II. Algorithmic improvements}, J.\n  Quant. Spectrosc. Radiat. Transf. 113 (2012) 929--935.\n\n\\bibitem{04AmViCh.CO2}\nA.~Amy-Klein, H.~Vigu{\\'e}, C.~Chardonnet, {Absolute frequency measurement of\n  $^{12}$C$^{16}$O$_2$ laser lines with a femtosecond laser comb and new\n  determination of the $^{12}$C$^{16}$O$_2$ molecular constants and frequency\n  grid}, J. Mol. Spectrosc. 228 (2004) 206--212.\n\n\\bibitem{13PoOtWe.CO2}\nA.~Pogany, O.~Ott, O.~Werhahn, V.~Ebert, {Towards traceability in CO$_2$ line\n  strength measurements by TDLAS at 2.7 $\\mu m$}, J. Quant. Spectrosc. Radiat.\n  Transf. {130} ({2013}) 147--157.\n\\newblock \\href {http://dx.doi.org/{10.1016/j.jqsrt.2013.07.011}}\n  {\\path{doi:{10.1016/j.jqsrt.2013.07.011}}}.\n\n\\bibitem{jt309}\nO.~L. Polyansky, A.~G. {Cs\\'asz\\'ar}, S.~V. Shirin, N.~F. Zobov, P.~Barletta,\n  J.~Tennyson, D.~W. Schwenke, P.~J. Knowles, {High accuracy ab initio\n  rotation-vibration transitions of water}, Science 299 (2003) 539--542.\n\n\\bibitem{15TaPeGa.CO2}\nS.~A. Tashkun, V.~I. Perevalov, R.~R. Gamache, J.~Lamouroux, {CDSD}-296, high\n  resolution carbon dioxide spectroscopic databank: Version for atmospheric\n  applications, J. Quant. Spectrosc. Radiat. Transf. 152 (2015) 45--73.\n\\newblock \\href {http://dx.doi.org/10.1016/j.jqsrt.2014.10.017}\n  {\\path{doi:10.1016/j.jqsrt.2014.10.017}}.\n\n\\bibitem{jt285}\nR.~Schermaul, R.~C.~M. Learner, A.~A.~D. Canas, J.~W. Brault, O.~L. Polyansky,\n  D.~Belmiloud, N.~F. Zobov, J.~Tennyson, Weak line water vapor spectrum in the\n  regions 13~200 -- 15~000 cm$^{-1}$, J. Mol. Spectrosc. 211 (2002) 169--178.\n\n\\bibitem{10LaTrLa.CO2}\nJ.~Lamouroux, H.~Tran, A.~L. Laraia, R.~R. Gamache, L.~S. Rothman, I.~E.\n  Gordon, J.~M. Hartmann, {Updated database plus software for line-mixing in\n  CO$_2$2 infrared spectra and their test using laboratory spectra in the\n  1.5-2.3 $\\mu$m region}, J. Quant. Spectrosc. Radiat. Transf. {111} ({2010})\n  2321--2331.\n\\newblock \\href {http://dx.doi.org/{10.1016/j.jqsrt.2010.03.006}}\n  {\\path{doi:{10.1016/j.jqsrt.2010.03.006}}}.\n\n\\bibitem{13LeMiWo.CO2}\nS.~J. Lehman, J.~B. Miller, C.~Wolak, J.~Southon, P.~P. Tans, S.~A. Montzka,\n  C.~Sweeney, A.~Andrews, B.~LaFranchi, T.~P. Guilderson, J.~C. Turnbull,\n  Allocation of terrestrial carbon sources using {$^{14}$CO$_2$}: Methods,\n  measurement, and modeling, Radiocarbon {55} ({2013}) 1484--1495.\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 20187, "prevtext": "\nwhere here $|i\\rangle$ and $|f\\rangle$ are the initial and final state\nrovibrational wavefunctions of the molecule and $\\mu_\\alpha$ is\ncomponent of the dipole moment surface (DMS).  The requirements for\naccurate linestrengths are therefore high quality nuclear motion\nwavefunctions and DMSs. Lodi and Tennyson \\cite{jt522} developed a\nprocedure which provides estimated uncertainty on a\ntransition-by-transition basis based on the evaluation of multiple\nline lists.  They initially applied this procedure to water vapor\nspectra. Their data were used to replace all H$_2$$^{17}$O and\nH$_2$$^{18}$O intensities for water in the 2012 release of HITRAN\n\\cite{jt557}. These data have since been critically assessed and\nverified empirically for the 6450 to 9400 {cm$^{-1}$}\\ region\n\\cite{14ReOuMiWa}. The present study combines the high accuracy {\\it\n  ab initio} DMS presented by Polyansky {\\textit{et al.}}\\ \\cite{jt613} and the\nmethodology of Lodi and Tennyson, which required some extension for\nthe CO$_2$ problem. This is discussed in the following section.\n\nThe current release of HITRAN \\cite{jt557} takes its CO$_2$ line\nintensities substantially from two sources: the Fourier transform\nmeasurements of Toth {\\textit{et al.}}\\ \\cite{08ToBrMi} and an unpublished version\nof CDSD \\cite{12TaPe}.  The CDSD, whose intensities are\naccurate to about 2 -- 20~\\%\\ depending on the vibrational band, has\nrecently been updated and released as CDSD-296 \\cite{Tashkun2015}.\nThe uncertainty estimate \nis up to 20~\\%\\ for many transitions and is probably rather\nconservative.\nRecently some of\nus computed a new, high accuracy DMS for CO$_2$ which we compared with\nnew high-accuracy experiments \\cite{jt613} and the data in HITRAN. The\ncomparisons suggested that the new DMS is indeed excellent. In this\nwork we construct a new line list for $^{12}$C$^{16}$O$_2$ which we\nsuggest will significantly improve the precision of the intensity\nparameters. Due to considerations associated with the DMS, this line\nlist is restricted to transition wavenumbers below 8000 {cm$^{-1}$}. However,\nin this range the list should be comprehensive and includes\ntransitions which have yet to be quantified experimentally. The next\nsection presents the methodology used to construct the line list.\nSection 3 presents the final line list and compares our results with\nthose from other sources. The final section gives our conclusions and\nplans for future work.\n \n\n\n\\section{Methodology}\n\nThe Lodi-Tennyson method \\cite{jt522} for validating linelists on a\npurely theoretical basis relies on the use of accurate, {\\it ab\ninitio} transition intensity calculations requires\nan accurate procedures for obtaining nuclear motion wavefunctions\ntogether with the use of at least two DMSs and two PESs. \nThese aspects are described below.\n\n\n\\subsection{Ab initio surfaces}\n\nThe first stage in the molecular linelist evaluation process involves\ncomputing energy levels and rotational-vibrational wavefunctions.\nOur approach utilizes an exact nuclear kinetic energy operator\nfollowing the framework proposed by Tennyson and Sutcliffe\n\\cite{jt45,jt96,jt114,jt160} and implemented in DVR3D suite\n\\cite{jt338}; the quality of the electronic\nPES provided is of primary importance. \nEnergy levels and rotational-vibrational wavefunctions\nobtained in this way are further used in intensity calculations,\nrequiring additionally a DMS function as  input. The accuracy of the\nresulting line positions depends strongly on the quality of the PES, while\nline intensities are dependent both on the PES and DMS. Therefore, in\norder to generate high accuracy line intensities, it is necessary to\nprovide those two essential functions with the highest possible accuracy.\nThe present state-of-the-art {\\it ab initio} PESs are capable of\nreproducing experimental energy levels to 1 {cm$^{-1}$}\\ accuracy, which still\nremains insufficient for high resolution spectroscopy purposes.\nHence empirical fitting of {\\it ab initio} surfaces has become a standard\nprocedure. This semi-empirical approach is much less successful in\nthe case of DMSs, partly due to technical difficulties in\nobtaining accurate experimental data, suggesting the use of {\\it ab initio}\nDMSs is a better choice \\cite{jt156}.  It is\nnatural to ask how different PESs and DMSs affect energy levels and\nline intensities. Answering this, in turn, can shed some light on\nthe reliability of line intensities provided by our theoretical scheme.\nAccordingly, the present study involves 6 independent runs of nuclear\nmotion calculations using the inputs presented below. \\\\\n\n\n\\textbf{Ames PES} \n\nAs a primary choice we decided to use the \nsemi-empirical Ames-1 PES from Huang {\\textit{et al.}}\\ \\cite{12HuScTa.CO2}, \nwhich is probably most accurate available. \nThe fit of this PES started from a series of CCSD(T) {\\it ab initio}\ncalculations with scaled averaged coupled-pair function (ACPF)\ncorrections, which also accounts for relativistic effects. No\nnon-Born-Oppenheimer effects were included, resulting in an \nisotope-independent PES. In addition to this a two-step refinement was\nperformed: first using a subset of HITRAN2008 $J=0-4$ energy levels,\nsecond with the use of fully experimental levels for chosen $J$'s up\nto 85.  The resultant PES was then rigorously tested against\nHITRAN2008 and HITRAN2012  as well as against more recent experiments\n\\cite{12HuScTa.CO2,14HuGaFr.CO2}.  The best fit\nroot-mean-square-deviation (RMSD) with respect to purely experimental\nenergy levels for the final Ames-1 PES for the CO$_2$ main isotopologue\nwas equal to 0.0156 {cm$^{-1}$}\\ in $J=0-117$ range. Comparison with HITRAN2012\ndatabase frequencies gave an average overall shift of $-0.0456${cm$^{-1}$}\\ and a\nspread (rms) of 0.0712 {cm$^{-1}$}, which is consistent with our own calculation\nbased on this PES. The relatively large descrepancy between Ames-296 and\nHITRAN2012 was the reason to exclude most of HITRAN energy levels from\nthe fitting procedure.  It also pointed to inconsistencies in the current\nrelease of the database.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\textbf{Ab initio PES} \n\nTo aid the line sensitivity analysis, we independently constructed a fully {\\it ab initio}\nCO$_2$ PES using the energy points used by Polyansky {\\textit{et al.}}\\  \\cite{jt613}\nto compute their DMS. MOLPRO \n\\cite{12WeKnKn.methods} multi-reference configuration\ninteraction theory (MRCI) calculations with the aug-cc-pCVQZ basis \nwere augmented by relativistic corrections at the\none-electron mass-velocity Darwin (MVD1)  level. \nFor more details see the supplementary materials in ref. \\cite{jt613}.\nA fit with 50 constants to the MRCI grid points gave an \nRMSD of 1.54 {cm$^{-1}$}. The\nrelativistic correction surface was fitted separately with 31 \nconstants to yield a RMSD of  0.56 {cm$^{-1}$}.\n\nA comparison with the Ames-1 PES shows a 1.5 {cm$^{-1}$}\\ average discrepancy between the energy\nlevels computed with the\ntwo surfaces for levels below 4000 {cm$^{-1}$}. Above this value some\nenergy levels spoil this\nrelatively good agreement to give a RMSD of 6.2 {cm$^{-1}$}\\ for states below 11 000 {cm$^{-1}$},\nwith 200 (0.5\\%\\ total) levels unmatched. However, for a fully {\\it ab initio}\nprocedure this PES represents roughly the state-of-the-art for CO$_2$. It was therefore\nused as part of the theoretical error estimation procedure.\\\\\n\n\\textbf{Fitted PES} \nHigher quality can be achieved by refining our {\\it ab initio} PES with\nAmes energy levels. This was done for levels with $J= 0, 1$ and 2. \nThis fit resulted in a RMSD of 0.2 {cm$^{-1}$}\\ between respective low $J$\nenergy levels and around 1.4 {cm$^{-1}$}\\ RMSD for states including all $J$'s\n(0-129) below 11 000 {cm$^{-1}$}, leaving only 30 levels above 10 000 {cm$^{-1}$}\\\n(0.1\\%\\ total) unmatched. \n\n\n\n\n\n\n\n\\textbf{Ames DMS} \n\nThe Ames dipole moment surface 'DMS-N2' was based on\n2531 CCSD(T)/aug-cc-pVQZ dipole vectors \\cite{13HuFrTa.CO2}. The linear least-squares fits were performed with 30 000 {cm$^{-1}$}\\\n energy cutoff and  polynomial expansion up to 16-th order with 969 coefficients, which gave a RMDS of \n $3.2\\times10^{-6}$ a.u.\nand $8.0\\times10^{-6}$ a.u. for respective dipole vector components. Comparison with recent experiments  \\cite{13HuFrTa.CO2} and \nCDSD data leads to the general conclusion that the Ames DMS, while reliable,\n still does not meet requiremets for remote sensing accuracy.\n\n\n\n\n\\textbf{UCL DMS} \n\nOur dipole moment surface was calculated using the finite field\nmethod. Both positive and negative electric field vector directions\nwere considered for the $x$ (perpendicular to molecular long axis) and\n$y$ (along molecular long axis) components of the dipole moment,\nrequiring 4 independent runs for each {\\it ab initio} point. Finally\nthe dipole moment was computed as first derivative of electronic\nenergy with respect to a weak uniform external electric field\n($3\\times10^{-4}$ a.u.); a two-point numerical finite difference\napproximation was used.  Previous research suggests that in general\nderivative method yields more reliable dipole moments than those\nobtained from simple expectation value evaluation \\cite{jt475}.\nRandomly distributed {\\it ab initio} points were then fitted with a\npolynomial in symmetry adapted bond-lengths and bond angle\ncoordinates. This resulted in an expansion up to fifth order. Points\nabove 15~000 {cm$^{-1}$}\\ were rejected from the fit, leaving 1963 points for\nthe $x$ component fitted with 17 constants giving a RMSD of\n$2.25\\times 10^{-5}$ a.u.; and 1433 points for the $y$ component\nfitted with 19 constants giving RMSD of $1.85\\times10^{-5}$ a.u. .\n\n\n\\subsection{Nuclear motion calculations}\n\nNuclear-motion calculations were performed using the DVR3D suite\n\\cite{jt338}. Symmetrized Radau coordinates in bisector embedding were\napplied to represent nuclear degrees of freedom.  Rovibrational\nwavefunctions and energy levels were computed utilizing exact kinetic\nenergy operator (in Born-Oppenheimer approximation) with nuclear\nmasses for carbon (11.996709 Da) and oxygen (15.990525 Da).\n\nAs a first preliminary step in our procedure basis set parameters were optimized with respect to \nenergy levels convergence using the Ames-1 PES. The final set of parameters for Morse-like basis functions \\cite{jt338,jt14},\n describing stretching and bending motions, was considered as $r_e=2.95\\; a_0$, $D_e=0.30\\; E_h$ and $\\alpha=0.0085\\; E_h$.\n These values were chosen in a careful scan of parameter space with convergence speed as a criterion.\nThe contracted DVR basis set associated with Gauss-Legendre\nquadrature points consisted of 30 radial and 120 angular functions, respectively. The appropriate choice of basis set parameters \nallowed us to \nreduce the size of the basis needed to converge energy levels, hence speeding up calculations. \nThe same set of parameters was used for \nrovibrational energies evaluation with \\textit{ab initio} and fitted PESs.\n \nAt room temperature the highest initial energy level that can be\npopulated enough to give a transition above the $10^{-30}$ cm/molecule\nintensity threshold is roughly 6500 {cm$^{-1}$}\\ and $J=130$.  Therefore we could\npotentially be interested in upper energy levels up to 14 500 {cm$^{-1}$}\\ to\ncover the 0 -- 8000 {cm$^{-1}$}\\ wavenumber region.  However, the current,\n2012, version of HITRAN only considers upper states up to 11 500 {cm$^{-1}$}\\\nfor wavenumbers below 8000 {cm$^{-1}$}.  As our target is to cover all HITRAN\ntransitions, we keep only energy levels below 11 500 {cm$^{-1}$}, so that the\nHamiltonian matrix in the first (vibrational) step of the calculation\n(program DVR3DRJZ) could be truncated at 1000.  It guaranteed $J=0$\nenergy levels (band origins) below 10 000 {cm$^{-1}$}\\ to be converged at the\n$10^{-6}$ {cm$^{-1}$}\\ level and energy levels around 12 000 {cm$^{-1}$}\\ \n at the $10^{-5}$ {cm$^{-1}$}\\ level.\n\nThe ro-vibrational part of the computation (program ROTLEV3b) took advantage of symmetry adapted symmetric top basis set truncated \nat $600\\times (J+1) $ for $J=0-50 $, $300 \\times (J+1) $ for \n$J=51-86 $ and $100\\times (J+1) $ for $J=87-129 $. \nThis yielded 42~691 relevant\\footnote{contributing to at least one transition with line intensity greater than $10^{-38}$ cm/molecule} energy levels up to 11 500 {cm$^{-1}$}\\ and covered all HITRAN2012 database energy levels\n contributing to transitions up to 8000 {cm$^{-1}$}\\ and $J\\leq 129$.\n\nThe final step involved running the DIPOLE program \\cite{jt338}. \nA uniform $10^{-30} $ cm/molecule cutoff value is sufficient to cover most of \nexperimentally available data and also corresponds to HITRAN2012 standard, facilitating further comparisons. \nThe value for the partition function  at 296~K $Q=286.096$\nwas taken from Huang et al.~\\cite{14HuGaFr.CO2} and coincides with the value $286.095$  \nobtained from the present calculation. \nFor $^{12}$C$^{16}$O$_2$,  half of the possible energy levels do  not exist due to  nuclear spin statistics.\nTransition intensities in cm/molecules were calculated using\n\n\n\n", "index": 3, "text": "\\begin{equation}\n I(\\omega)=4.162034\\times10^{â\u0088\u009219}~\\omega_{if}g_iQ^{-1}(T)\\left[\\exp\\left(\\frac{E_i}{kT}\\right)-\\exp\\left(\\frac{E_f}{kT}\\right)\\right] S_{if}\n\\label{eq:Int}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"I(\\omega)=4.162034\\times 10^{â\u0088\u009219}~{}\\omega_{if}g_{i}Q^{-1}(T)\\left[\\exp%&#10;\\left(\\frac{E_{i}}{kT}\\right)-\\exp\\left(\\frac{E_{f}}{kT}\\right)\\right]S_{if}\" display=\"block\"><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mn>4.162034</mn><mo>×</mo><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mrow><mi>Ã</mi><mo>⁢</mo><mi mathvariant=\"normal\">¢</mi><mo>⁢</mo><mi>Â</mi><mo>⁢</mo><mi mathvariant=\"normal\">\u0088</mi><mo>⁢</mo><mi>Â</mi><mo>⁢</mo><mi mathvariant=\"normal\">\u0092</mi><mo>⁢</mo><mn>19</mn></mrow></msup></mpadded></mrow><mo>⁢</mo><msub><mi>ω</mi><mrow><mi>i</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>⁢</mo><msub><mi>g</mi><mi>i</mi></msub><mo>⁢</mo><msup><mi>Q</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>E</mi><mi>i</mi></msub><mrow><mi>k</mi><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>)</mo></mrow></mrow><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>E</mi><mi>f</mi></msub><mrow><mi>k</mi><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>S</mi><mrow><mi>i</mi><mo>⁢</mo><mi>f</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}]