[{"file": "1601.03901.tex", "nexttext": "\nwhere $|\\psi\\rangle$ are the hidden heavy mesons and $|\\phi_{M1}\\phi_{M2}\\beta\\rangle$ are the two\nmeson states with $\\beta$ quantum numbers.\n\nThe coupling with $Q\\bar Q$ states induced an effective energy dependent potential between the two mesons\ngiven by\n\n", "itemtype": "equation", "pos": 10437, "prevtext": "\n\n\n\\title{Partners of the $X(3872)$ and HQSS breaking}\n\n\\author[aff1]{D.R. Entem\\corref{cor1}}\n\\author[aff2]{P.G. Ortega}\n\\author[aff1]{F. Fern\\'andez}\n\n\\affil[aff1]{Grupo de F\\'isica Nuclear and IUFFyM, Universidad de Salamanca, E-37008 Salamanca, Spain.}\n\\affil[aff2]{CERN (European Organization for Nuclear Research), CH-1211 Geneva, Switzerland.}\n\\corresp[cor1]{Corresponding author: entem@usal.es}\n\n\\maketitle\n\n\\begin{abstract}\n  Since the discovery of the $X(3872)$ the study of heavy meson molecules has been the subject of many investigations. On the experimental side\n  different experiments have looked for its spin partners and the bottom analogs. On the theoretical side different approaches have been used to\n  understand this state. Some of them are EFT that impose HQSS and so they make predictions for the partners of the $X(3872)$, suggesting the\n  existence of a $J^{PC}=2^{++}$ partner in the charm sector or $J^{PC}=1^{++}$ or $2^{++}$ analogs in the bottom.\n\n  In our work, in order to understand the $X(3872)$, we use a Chiral quark model in which, due to the proximity to the $DD^*$ threshold, we include\n  $c\\bar c$ states coupled to $DD^*$ molecular components. In this coupled channel model the relative position of the bare $c\\bar c$ states with\n  two meson thresholds are very important. We have looked for the $X(3872)$ partners and we don't find a bound state in the $D^*D^*$ $J^{PC}=2^{++}$.\n  In the bottom sector we find the opposite situation where the $B^*B^*$ with $J^{PC}=2^{++}$ is bounded while the $J^{PC}=1^{++}$ is not bounded.\n  These results shows how the coupling with $c\\bar c$ states can induced different results than those expected\n  by HQSS. The reason is that this symmetry is worse in the open heavy meson sector than in the hidden\n  heavy meson sector.\n\\end{abstract}\n\n\n\\section{INTRODUCTION}\n\nThe theoretical study of exotic states, not well accommodated in the naive quark model, has motivated\na great interest since the discovery of the $X(3872)$. This state was discovered by the Belle collaboration\nin 2003~\\cite{PhysRevLett.91.262001} and very soon after confirmed by the \nCDF~\\cite{PhysRevLett.93.072001}, D0~\\cite{PhysRevLett.93.162002} and BaBar~\\cite{PhysRevD.71.071103} collaborations.\nThe state lies well below where the $\\chi_{c1}(2P)$ state is expected by quark models and is very close to the\n$DD^*$ threshold. However it also presents very peculiar decay properties, being the most relevant the decays\ninto $J/\\Psi \\pi\\pi$ through a $\\rho$ and $J/\\Psi \\pi\\pi\\pi$ through an $\\omega$ which implies\nsome kind of isospin violation. These properties rule out completely a $c\\bar c$ interpretation of the state.\nHowever it can be easily understood in the molecular picture as a $DD^*$ molecule. Then the isospin violation can be obtained\ndue to the difference on the mass of different charged states of the charmed mesons without the need\nof introducing isospin violating interactions. \nFor these reasons it is now accepted as the best candidate to be a non $q\\bar q$ state.\n\nThe first consequence of the molecular picture is the existence of other analog states. In fact, if you\nassume heavy flavor symmetry (HFS), which is an approximate good symmetry of QCD and implies that\nthe interactions are the same when you change a $c$ quark (antiquark) by a $b$ quark (antiquark),\nthen a $J^{PC}=1^{++}$ analog in the bottomonium sector should exist due to the reduction of the\nkinetic energy by the bigger mass of the bottom mesons. So you should expect a state with bigger\nbinding energy and probably smaller isospin breaking properties due to the small difference in the masses\nof the bottom mesons.\n\nOther approximate symmetries can be used to study the existence of other analogs like, for instance,\nheavy quark spin symmetry (HQSS) which implies the independence of the interactions on the spin of\nthe heavy quark. This symmetry has been use by the authors of Reference~\\cite{PhysRevD.86.056004} to study the analogs\nin the charmonium sector with other quantum numbers. The strongest conclusion of this work is the\nexistence of a $J^{PC}=2^{++}$ $B^*B^*$ analog which has been called $X(4012)$ since the interaction\nin this channel is the same as in the channel of the $X(3872)$. In order to get conclusions for other\nquantum numbers further assumptions are needed. Assuming that the $X(3915)$ is a $0^{++}$ analog\na total of six molecular states are found in the charmonium sector.\n\nUsing similar ideas and HFS the authors of Reference~\\cite{PhysRevD.88.054007} studied the bottomonium sector\nwhere the $1^{++}$ analog should be found and extended the study to the isovector channels in both sectors.\n\nAlthough the pure molecular picture is very popular one could expect that the molecular states could couple\nto nearby $c\\bar c$ states. We followed this investigation in the framework of the Chiral Quark Model (CQM)\nin Reference~\\cite{PhysRevD.81.054023}. In this work we found that the $J^{PC}=1^{++}$ $DD^*$ channel is unbounded if we do not\ninclude the coupling to $c\\bar c$ states and is bounded once the coupling to the $\\chi_{c1}(2P)$ is included.\nIn a latter work~\\cite{JPhysG.40.651073} we also include other channels like the $J/\\Psi \\omega$ finding it\nirrelevant. The reason is that the coupling of $J/\\Psi\\omega$ and $c\\bar c$ states is an OZI forbidden process and so very suppressed\nand the coupling to $DD^*$ states goes through a rearrangement process which is also very suppressed. So the most\nimportant components are the $DD^*$ and $\\chi_{c1}(2P)$. \n\nThe irrelevance of the $J/\\Psi\\omega$ channel has been confirmed recently in lattice simulations~\\cite{PhysRevLett.111.192001}\nand also the strong coupling between the $DD^*$ components and $c\\bar c$. In this work only the bound $DD^*$ state\nis found and the expected $\\chi_{c1}(2P)$ state is not found. For this reason it has been interpreted as a $c\\bar c$ \nlargely dressed by the $DD^*$ components. This differs from our picture since for us the $X(3872)$ appears as an additional\nstate to the naive quark model expectations.\n\nIf one assumes that the coupling to $c\\bar c$ states can be important one important question is if this coupling\ncan make results deviate from expectations from HQSS and HFS. This is what we analyze in the present work.\n\n\\section{THE CHIRAL QUARK MODEL}\n\nThe present work use the CQM which has been extensively used to study baryon and meson\nphenomenology. The $SU(2)$ version was published in Reference~\\cite{JPhysG.19.2013} and later on was\nextended to the $SU(3)$ version and to the heavy quark sector in Reference~\\cite{JPhysG.31.481}.\nHere we only describe the main ingredients of the model.\n\nQCD has Chiral Symmetry as an approximate good symmetry at the level of the Lagrangian. However\nthis symmetry is not realized in the hadron spectrum and is spontaneously broken\nat the quantum level. This fact implies the existence of massless Goldstone bosons (the pions) with the quantum\nnumbers of the broken symmetry. However the symmetry is not exact and the Goldstone bosons acquire a\ndynamical (small) mass which is the most satisfactory way to understand the smallness of the mass of the\npion meson. When we break the symmetry in the $SU(3)$ version then the kaons and the eta meson appears.\nThese new degrees of freedom generates interactions between quarks as one Goldstone boson exchanges. Multiboson\nexchanges are not included but they are taken into account by the exchange of scalar bosons.\nHowever Chiral Symmetry Breaking also generates a dynamical mass for quarks, the constituent quark mass.\n\nBesides the Chiral Symmetry Breaking another crucial non-perturbative effect of QCD is confinement\nwhich makes all hadrons to appear as color singlets. We include confinement in a phenomenological way\nas a color linear screened interaction between quarks.\n\nQCD perturbative effects are included by the interaction induced by one gluon exchange which is of\nspecial relevance on the description of heavy quark systems.\n\nAll the details of the interactions used can be found in References~\\cite{JPhysG.31.481} and~\\cite{PhysRevD.78.114033}\nwhere the parameters used can be found.\n\n\\section{THE TWO MESON INTERACTION}\n\nOnce we have the interaction between the constituents of mesons we can study the interaction\nbetween mesons generated by them. We obtain this interactions using the Resonating Group Method (RGM)\nconsidering that we know the internal wave functions of the interacting mesons. In our calculation\nthese wave functions are obtained solving the two body ($q\\bar q$) system.\n\nIn the systems considered in this work no antisymmetry effects between quarks in different mesons are\npresent. So the interaction is given by the so called RGM direct kernel\n\\begin{eqnarray}\n    ^{RGM}V_D(\\vec{P}',\\vec{P}) &=& \n    \\sum_{i\\in A,j\\in B} \\int d\\vec{p}_{\\xi '_A}d\\vec{p}_{\\xi '_B}d\\vec{p}_{\\xi_A} d\\vec{p}_{\\xi_B} \n    \\phi ^*_A (\\vec{p}_{\\xi '_A}) \\phi ^*_B (\\vec{p}_{\\xi '_B}) \n    V_{ij}(\\vec{P}',\\vec{P}) \\phi _A (\\vec{p}_{\\xi _A}) \\phi _B (\\vec{p}_{\\xi _B})\n\\end{eqnarray}\nHowever quarks or antiquarks can be exchanged between different mesons coupling different meson states, like,\nfor instance, the $DD^*\\to J/\\Psi\\omega$. This kind of processes are rearrangement diagrams that are suppressed\nby the meson wave functions overlaps.\n\n\\section{COUPLING MOLECULAR AND $Q\\bar Q$ COMPONENTS}\n\nAs mentioned in the introduction the closest $Q\\bar Q$ states to the two meson thresholds can coupled with these\nstates. A measured of this coupling is given by the widths of the $Q\\bar Q$ states decaying to open heavy quark mesons,\nwhich is of the order or tens or hundreds of MeV. \n\nIn order to study this effect we use the $^3P_0$ model to coupled two quark and four quark sectors. It is important to notice\nthat the model only introduces a coupling that can be fitted to any decay and then all the others are given by\nthe meson wave functions and quark symmetries. In order to get an overall good description of two meson decays we\nperformed an analysis of strong decays in different sectors and we allowed the coupling to logarithmically run\nwith the scale of the system given by the reduced mass of the two quarks of the decaying meson. This was done\nin Reference~\\cite{Segovia2012322} where predictions in sectors where the coupling was not fitted were given\nwith very good agreement with the experimental data.\n\nThen we take the hadronic wave function given by\n\n", "index": 1, "text": "\\begin{equation}\n  | \\Psi \\rangle = \\sum_\\alpha c_\\alpha |\\psi\\rangle \n   + \\sum_\\beta \\chi_\\beta(P)|\\phi_{M1}\\phi_{M2}\\beta\\rangle\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"|\\Psi\\rangle=\\sum_{\\alpha}c_{\\alpha}|\\psi\\rangle+\\sum_{\\beta}\\chi_{\\beta}(P)|%&#10;\\phi_{M1}\\phi_{M2}\\beta\\rangle\" display=\"block\"><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mrow><msub><mi>c</mi><mi>α</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>ψ</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>β</mi></munder><mrow><msub><mi>χ</mi><mi>β</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>P</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>ϕ</mi><mrow><mi>M</mi><mo>⁢</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>M</mi><mo>⁢</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mi>β</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03901.tex", "nexttext": "\nWe solve the coupled channel problem following Reference~\\cite{EPJA44.93}. All the details can be found in\nReference~\\cite{JPhysG.40.651073}.\n\n\\section{HEAVY QUARK SPIN SYMMETRY}\n\nSince we want to analyze the discrepancies with HQSS expectations induced in our model by the coupling to $Q\\bar Q$ states\nis important to check if we don't have additional HQSS breaking effects. In our model HQSS breaking is present\nsince we take finite heavy quark masses, however one should expect small effects due to the big values of the\nheavy quark masses.\n\nFor $S$-wave two meson states it is easy to find the following relations between matrix elements\n\\begin{eqnarray}\n\\frac{2}{\\sqrt 3} \\langle D^*D^* (0^{++}) | H |DD (0^{++}) \\rangle &=&\n\\langle DD (0^{++}) | H |DD (0^{++}) \\rangle\n-\\langle D^*D^* (0^{++}) | H |D^*D^* (0^{++}) \\rangle\n\\label{Ec4}\n\\\\\n\\langle DD^* (1^{++}) | H |DD^* (1^{++}) \\rangle &=&\n\\langle D^*D^* (2^{++}) | H |D^*D^* (2^{++}) \\rangle\n\\label{Ec5}\n\\\\ &=&\n\\frac 3 2\n\\bigg[\n\\langle DD (0^{++}) | H |DD (0^{++}) \\rangle\n -\\frac 1 3 \\langle D^*D^* (0^{++}) | H |D^*D^* (0^{++}) \\rangle \\bigg]\n\\label{Ec6}\n\\\\\n2 \\langle DD^* (1^{+-}) | H |DD^* (1^{+-}) \\rangle &=&\n\\langle DD (0^{++}) | H |DD (0^{++}) \\rangle\n+\\langle D^*D^* (0^{++}) | H |D^*D^* (0^{++}) \\rangle\n\\end{eqnarray}\nwhich are given just by recoupling coefficients. These relations are checked in Figures~\\ref{fig1} and~\\ref{fig2}. For\nexact HQSS all the solid lines should be the same, so we see just small HQSS breaking effects in the two meson interaction.\nThe small breaking effects are induced by the small difference in the wave functions of the pseudoscalar and vector heavy mesons which are\nshown in Figure~\\ref{fig3} and for exact HQSS should be the same.\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[width=.47\\textwidth]{PR1cc}\n\\includegraphics[width=.47\\textwidth]{PR1bb}}\n\\caption{Diagonal matrix elements of the two meson interaction in momentum space for the \n  $D^{(*)}D^{(*)}$ sector (left panel)\n  and $B^{(*)}B^{(*)}$ sector (right panel).\n  The dashed blue line gives the $D^*D^*(0^{++})$ matrix element,\n  the dashed red line the $DD(0^{++})$, the solid blue line the right hand side of Equation~\\ref{Ec4} and the\nsolid red line left hand side of the same Equation.}\n\\label{fig1}\n\\end{figure}\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[width=.47\\textwidth]{PR2cc}\n\\includegraphics[width=.47\\textwidth]{PR2bb}}\n\\caption{Diagonal matrix elements of the two meson interaction in momentum space for the \n  $D^{(*)}D^{(*)}$ sector (left panel)\n  and $B^{(*)}B^{(*)}$ sector (right panel).\n  The dashed blue line gives the $D^*D^*(0^{++})$ matrix element,\n  the dashed red line the $DD(0^{++})$, the solid blue line the right hand side of Equation~\\ref{Ec5}, the\n  solid red line left hand side of the same Equation and the solid green line the right hand side of Equation~\\ref{Ec6}.}\n\\label{fig2}\n\\end{figure}\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[width=.47\\textwidth]{wfcc}\n\\includegraphics[width=.47\\textwidth]{wfbb}}\n\\caption{Wave function for the pseudoscalar (red) and vector (blue) heavy mesons. The left\n  panel corresponds to charm mesons ($D^{(*)}$) and the right\n  panel to bottom mesons ($B^{(*)}$).}\n\\label{fig3}\n\\end{figure}\n\n\\section{RESULTS}\n\nAs shown in the previous section the model preserves HQSS in a good approximation although small breaking\neffects are present due to the use of finite heavy quark masses. However it is interesting to\nnotice that the HQSS breaking in the masses of open charm and bottom mesons is bigger than in the\nhidden charm and hidden bottom sectors. For this reason the relations between the two meson\nthresholds and the $Q\\bar Q$ states change when we change the $J^{PC}$ quantum numbers. This can be seen\nin Figure~\\ref{fig4} where we present the predictions of the pure $Q\\bar Q$ states of the model in red\ncompared with the two meson thresholds and the states of the Particle Data Group (PDG) from Reference~\\cite{PDG} in blue.\nFor the PDG states we only include states with well known quantum numbers with some exceptions. In the $1^{+-}$ sector\nalthough the $I^G$ quantum numbers has not been measured it is a well accepted candidate for the $h_c(1P)$ state\nas shown by the agreement with our quark model result. For the $X(3940)$ the put in the $1^{++}$ sector since it\nhas been seen in $DD^*$ decays and so it is a good candidate for the $\\chi_{c1}(2P)$ state.\nIn the bottomonium sector the same applies to the $h_b(1P)$ and $h_b(2P)$ (included in the updated version).\nFor the $\\chi_b(3P)$ only $C=+$ has been measured and we have included as a state covering the three possible\nassignments. We also have included in light blue the candidates for the $\\chi_{b1}(2P)$ and $\\chi_{b2}(2P)$ \nmeasured recently by LHCb~\\cite{JHEP10.088}.\n\nIt is important to consider the following aspects. In the charmonium sector the relevant thresholds, in which an\n$S$-wave two meson state is possible,\nare $DD^*$ and $D^*D^*$ in $1^{+-}$, $DD$ and $D^*D^*$ in $0^{++}$, $DD^*$ in $1^{++}$ and $D^*D^*$ in $2^{++}$.\nThe same occurs in the bottomonium sector changing the $D^{(*)}$ mesons by $B^{(*)}$ mesons.\nThen, a $Q\\bar Q$ state above threshold gives attraction and below gives repulsion. The strength is inversely proportional\nto the difference between the threshold position and the mass of the bare $Q\\bar Q$ state.\n\nOur prescription in the present work is to include the closer state above and below the relevant threshold and\nwe only include two meson states where an $S$-wave is present. The partial waves included for two meson states are\n\\begin{enumerate}\n\\item In the $0^{++}$ sector we include $DD$ ($BB$) and $D^*D^*$ ($B^*B^*$) $^1S_0$ waves\n\\item In the $1^{++}$ sector we include $DD^*$ ($BB^*$) $^3S_1$ and $^3D_1$ waves\n\\item In the $1^{+-}$ sector we include $DD^*$ ($BB^*$) and $D^*D^*$ ($B^*B^*$) $^3S_1$ and $^3D_1$ waves\n\\item In the $2^{++}$ sector we include $D^*D^*$ ($B^*B^*$) $^5S_2$, $^1D_2$ and $^5D_2$ waves\n\\end{enumerate}\n\nThe results are summarized in Table~\\ref{tab1} where we only quote additional states to the dressed $Q\\bar Q$ states that\nwe find as resonances.\n\n\\begin{table}\n\\caption{Additional states to the dressed $Q\\bar Q$ states given by the model.\n  The states predicted using HFS and HQSS symmetries given in References~\\cite{PhysRevD.86.056004,PhysRevD.88.054007}\nare given for comparison.\n\\label{tab1}}\n\\begin{tabular}{lcccc}\n\\hline\nCharmonium              & $1^{+-}$ & $0^{++}$ & $1^{++}$ & $2^{++}$ \\\\\n\\hline\nReference~\\cite{PhysRevD.86.056004}& 3815/3955 & 3710/Input & Input    &  4012    \\\\\nReference~\\cite{PhysRevD.88.054007}&           &            & Input    &  4012     \\\\\nThis work         &           &            & $X(3872)$&      \\\\\n\\hline \n\\hline\nBottomonium       & $1^{+-}$  & $0^{++}$   & $1^{++}$ & $2^{++}$ \\\\\n\\hline\nReference~\\cite{PhysRevD.88.054007}&           &            &  10580   &  10600    \\\\\nThis work         &           &  10621     &    ?     &  10648   \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\nLet's consider first the $1^{++}$ $DD^*$ and $2^{++}$ $D^*D^*$ channels where HQSS tells us that the interaction is\nthe same. In the charm sector we see that in the $1^{++}$ we get more attraction than repulsion while in the\n$2^{++}$ we get repulsion (the state above threshold is an $F$-wave $c\\bar c$ state that is weakly coupled to the\ntwo meson sector). As shown in Reference~\\cite{PhysRevD.81.054023} the two meson interaction is not enough to bind the\nsystem, however the coupling with the $\\chi_{c1}(2P)$ state gives the additional attraction and we get a new state\nthat we assigned to the $X(3872)$. In the $2^{++}$ sector we don't get this additional attraction and for this\nreason no new state is found. However the dressed $c\\bar c(^3F_2)$ state gets dressed and a state close to the predicted\n$X(4012)$ by HQSS is found but not present as an additional state. For this reason although an state with similar mass\nis found we expect different decays properties.\n\nIn the bottomonium we have the opposite situation. Now the two meson interaction is enough to bind the system. \nIn the $1^{++}$ we expect more repulsion\nfrom the state below the $BB^*$ threshold. In Table~\\ref{tab1} we don't give an answer to the existence or not\nexistence of this state since we can find a very shallow bound state or no state when we vary the value of the\nstrength parameter of the $^3P_0$ model within its uncertainties.\nIn the $2^{++}$ we get \nsimilar repulsion and attraction from the\nstates below and above threshold and here we find an additional state. This situation differs completely from the\nmodel independent expectations of HQSS and HFS without coupling to $Q\\bar Q$ states.\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[width=.47\\textwidth]{charmonium}\n\\includegraphics[width=.47\\textwidth]{bottomonium}}\n\\caption{Charm (left panel) and bottom (right panel) spectrum. Blue boxes\n  shows the states in the Particle Data Group~\\cite{PDG}. See comments in the text for\n  the PDG states selected. \n  We also have included in light blue the candidates for the $\\chi_{b1}(2P)$ and $\\chi_{b2}(2P)$ \n  measured recently by LHCb~\\cite{JHEP10.088}.\n  The states\nin red are the pure $Q\\bar Q$ states predicted by the model.}\n\\label{fig4}\n\\end{figure}\n\nFor the other quantum numbers HQSS need some assumptions and the final result depends on these assumptions. In Table~\\ref{tab1}\nwe compare our results in the $0^{++}$ and $1^{+-}$ sectors with the conclusions from \nReferences~\\cite{PhysRevD.86.056004,PhysRevD.88.054007}\nwhere a better agreement is found with Reference~\\cite{PhysRevD.88.054007}.\n\nAs a summary, in this work we only include the closest $Q\\bar Q$ state above and below the relevant thresholds, however a\nmore complete description including all the closest states is necessary to give definite conclusions. This will\nbe presented in a forthcoming paper. However the main conclusion of this work is that the coupling between\ntwo meson states and $Q\\bar Q$ states can modified HQSS and HFS conclusions in the pure molecular picture, and\nwe think that this problem should be address in models at hadron level.\n\n\\section{ACKNOWLEDGMENTS}\nThis work has been partially funded by Ministerio de Ciencia y Tecnolog\\'\\i a\nunder Contract no. FPA2013-47443-C2-2-P, \nby the Spanish Excellence Network on Hadronic Physics\nFIS2014-57026-REDT\nand by the Spanish Ingenio-Consolider 2010\nProgram CPAN (CSD2007-00042). \nP.G. Ortega\nacknowledges the financial support from the European Union's Marie Curie COFUND\ngrant (PCOFUND-GA-2011-291783).\n\n\n\n\n\\nocite{*}\n\\bibliographystyle{aipnum-cp}\n\\bibliography{entem}\n\n\n", "itemtype": "equation", "pos": 10842, "prevtext": "\nwhere $|\\psi\\rangle$ are the hidden heavy mesons and $|\\phi_{M1}\\phi_{M2}\\beta\\rangle$ are the two\nmeson states with $\\beta$ quantum numbers.\n\nThe coupling with $Q\\bar Q$ states induced an effective energy dependent potential between the two mesons\ngiven by\n\n", "index": 3, "text": "\\begin{equation}\n  V_{\\beta'\\beta}^{eff}(P',P) = \\sum_\\alpha \\frac{h_{\\beta'\\alpha}(P')h_{\\alpha\\beta}(P)}{E-M_\\alpha}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"V_{\\beta^{\\prime}\\beta}^{eff}(P^{\\prime},P)=\\sum_{\\alpha}\\frac{h_{\\beta^{%&#10;\\prime}\\alpha}(P^{\\prime})h_{\\alpha\\beta}(P)}{E-M_{\\alpha}}\" display=\"block\"><mrow><mrow><msubsup><mi>V</mi><mrow><msup><mi>β</mi><mo>′</mo></msup><mo>⁢</mo><mi>β</mi></mrow><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>P</mi><mo>′</mo></msup><mo>,</mo><mi>P</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mfrac><mrow><msub><mi>h</mi><mrow><msup><mi>β</mi><mo>′</mo></msup><mo>⁢</mo><mi>α</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>P</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>h</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>P</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>E</mi><mo>-</mo><msub><mi>M</mi><mi>α</mi></msub></mrow></mfrac></mrow></mrow></math>", "type": "latex"}]