[{"file": "1601.06811.tex", "nexttext": "\n\t\n\tNeglecting sheaths is valid for floating probes but a sheath correction remains important for a grounded probe in order to obtain accurate densities, as seen in equation 2. This correction also has a small impact on electron density rise and decay times. The first 5-10 $\\mu s$ will particularly affected by this, since sheath thickness is dependent upon electron temperature, which changes much faster than density. This relationship is investigated further in section III. \n\n\n\n\\subsection{Circuit Considerations}\n\tSince hairpin probes resonate at a characteristic frequency that depends on the permittivity of the medium and the length of the hairpin, and the frequency being used needs to be above the plasma frequency to avoid additional circuit loading, frequencies on the order of 2-5 GHz are typically used. These frequencies can be difficult to work with and attenuate quickly over most cables. This issue can be minimized by using the experimental setup given in Figure 1. Cheap wideband synthesizers are readily obtainable and can be used in conjunction with a directional coupler and a mixer to produce two heterodynes of larger and lower frequencies, given by the sum and difference of the two mixing frequencies. Figure 2 shows how the input waveform changes after each step in the circuit. The lower frequency can be adjusted to be low enough to not attenuate and high enough to provide sufficient time resolution as needed. \n\t\n\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=7cm,clip]{Hairpin_Circuit_Diagram.png}\n\t\\caption{Circuit Diagram for Boxcar Hairpin Probe}\n\t\\label{fig-1}       \n\t\\end{figure}\n\t\t\n\tThe importance of having a well made probe lies in the quality factor of the circuit. The resonance due to the hairpin can become indistinguishable from chamber or cable resonances if the quality factor is not high enough, since the circuit will be loaded when plasma is present.\n\t\n\\subsection{Time Resolution via Boxcar Mode}\n\t\t\t\n\tHairpin probes in constant waveform (CW) mode require a frequency sweep over the range of frequencies near the expected resonant frequency. If this range is not known, then a broad sweep must be taken so the resonance is not missed. These CW mode frequency sweeps must be calibrated to the vacuum case to avoid cable resonances.  It is often easier to use network analyzers in this case instead of a homemade circuit, since network analyzers readily scan multiple frequencies.\n\t\t\n\tFor pulsed operation, Boxcar mode simplifies things greatly. In this mode, frequency is kept constant during a pulse cycle and at some point during the pulse, the density will correspond to a resonant frequency that coincides with the applied frequency. This corresponds to a dip in the reflected signal, seen in Figure 2.\n\t\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=6cm,clip]{Boxcar_example_new.png}\n\t\\caption{Illustration of Boxcar Method}\n\t\\label{fig-2}       \n\t\\end{figure}\n\t\t\t\n\\section{Pure Argon Pulsed Discharges}\n\t\\label{sec-2}\n\t\n\t\n\t\n\t\n\t\n\tAll measurements were taken at the center of a 4 $cm$ diameter, 6 $cm$ long cylindrical quartz housing inductively coupled source over a range of Ar/O$_{2}$ mixtures. The plasma is produced inside the chamber using a 3-turn copper coil wrapped around the quartz housing, with $1$ cm spacing between turns, driven by a pulsing generator at 13.56 MHz. A Pi type matching network with a series variable capacitor connected with RG-8 cables is used for matching. The details of this match are available by request. The vacuum system included one rough pump and one turbo-molecular pump. A pulsing signal generator is connected to the power supply and the power supply is driven in \"slave\" mode. This allows for easy synchronization with the on-off pulse cycles. Mass flow controllers and a butterfly gate valve are also used to easily control pressure and gas content.\n\t\n\tThe parameters varied include pulse frequency, power, gas composition, and pressure. Full pulse profiles for discharges with pure Ar and pure O$_{2}$ are given in Figures 3 and 6, respectively. The pulse  for pure Ar exhibits a typical pulsed RF profile with a time constant similar to those found in literature$^{[3][4]}$. \n\t\t\n\tVariation of the pressure revealed a change in slope, or a \"kink\", when pressure was plotted against decay constant, shown in Figure 4. This kink was found to be near the same pressure the vacuum vessel transitions from the constant diffusion regime to the variable mobility regime. The slopes for both regions are consistent with the slopes expected from both regimes. \n\t\t\n\tThe power was varied at a pressure of 30 mTorr, with a pulse frequency of 500 Hz, duty cycle of 50\\%, and a flow rate of 10 sccm, as seen in Figure 7. The decay constant is relatively independent of power, except for the region around 15-20 $W$. This power coincides with the E-H transition for this chamber at these settings. A plot of the E-H transition at the same settings is shown in Figure 8. The electron temperature at the center of an ICP plasma increases dramatically when it transitions to H mode. Higher electron temperatures suggest a larger diffusion coefficient$^{[3]}$ and thus shorter decay times, so one would expect smaller decay time constants. However, since the electron temperature drops very quickly in the off-phase relative to the electron density, it is important to obtain an accurate estimate or measurement of the temperature. Some sources have electron temperature decay constants on the order of 10-16 $\\mu$s$^{[4]}$, which would be a larger enough timescale to have a noticeable effect on the diffusion in the period that electron density decay time constants are typically taken from ($\\sim$40 $\\mu s$)$^{[7]}$.\n\t\t\n\tThe pulse frequency was also varied at a pressure of 30 mTorr, duty cycle of 50\\%, and a flow rate of 10 sccm, shown in Figure 6. It appears that there is a smaller dependence of decay constant on pulse frequency. The physical reason for this phenomenon is still under investigation .\n\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=7cm]{Pulse_Freq_vs_Decay_Constant_Argon.png}\n\t\\caption{Pulse Frequency vs Decay Time}\n\t\\label{fig-5}       \n\t\\end{figure}\n\t\t\t\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=7cm]{Power_vs_Decay_Constant_Argon.png}\n\t\\caption{Power vs Decay Time}\n\t\\label{fig-6}       \n\t\\end{figure}\n\t\n\t\t\n\tThe steady state on-cycle electron density changed in a nonlinear fashion as pulse frequency increased, initially decreasing and then increasing from $3$-$5$ kHz. One would expect the peak density to decrease because the time averaged power is dropping as pulse frequency is increased. Th small increase from $3$-$5$ kHz may be a result of the difference between the rise and decay constants. As pulse frequency increases, the on and off periods become shorter. Since the plasma reaches a steady state value for the on-phase far quicker than the off-phase reaches steady state, the shorter periods keep the plasma from decaying as much. This produces a larger steady state on-phase electron density for the proceeding cycle, resulting in larger on-phase densities after a few cycles. This phenomenon was also noted by Lieberman et al$^{[5]}$. A time-averaged power measurement will have to be taken to decouple these two competing phenomena.\n\t\t\t\n\t\t\t\n\\section{Argon Oxygen Mixture Discharges}\n\t\\label{sec-3}\n\tArgon and Oxygen discharges are measured over a number of different parameters including pressure, power, pulse frequency, flow, duty cycle, and Ar/O$_{2}$ ratios.\n\t\t\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\t\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=7cm]{Pressure_vs_Decay_Time.png}\n\t\\caption{Pressure vs Decay Time Pulsed at 500 Hz, 50\\% Duty, 30 W, 2.5 sccm}\t\t\\label{fig-4}       \n\t\\end{figure}\n\t\t\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=6cm,clip]{Pure_Oxygen_Pulsed_Discharge.png}\n\t\\caption{Pure Oxygen Pulsed Discharge}\n\t\\label{fig-3}       \n\t\\end{figure}\t\t\t\t\t\n\t\t\n\t\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=7cm]{Gas_comp_vs_decay_constant_argon.png}\n\t\\caption{Argon/Oxygen Ratio vs Decay Time}\n\t\\label{fig-7}       \n\t\\end{figure}\t\n\t\t\n\\section{Acknowledgment}\n\tThis work is supported by the NSF DOE partnership on plasma science, the NSF GOALI program, and MKS Instruments. A special thanks to Lynda Larson at Treasure Isle Jewelers for doing such an excellent job custom making our hairpin probe.\n\t\t\n\\section{References}\n\t\\begin{thebibliography}{9}\n\t\n\t\\bibitem{Time-resolved-interferometry} F. Liu, T. V. Tsankov, and Y. Pu, J. Phys. D: Appl. Phys. 48, 035206 (2015).\n\t\n\t\\bibitem{Mirror Langmuir LaBombard} B. LaBombard and  L. Lyons, Review of Scientific Instruments 78, 073501 (2007).\n\t\n\t\\bibitem{Lieberman-book} M. A.Lieberman and A. J. Lichtenberg, \\emph{Principles of Plasma Discharges and Materials Processing}. S.l.: Wiley VCH, 2005. Print.\n\t\n\t\\bibitem{Lieberman-Ashida-Shim} S. Ashida, M.R. Shim, and M. A. Lieberman, Journal of Vacuum Science \\& Technology A, 14, 391-397 (1996).\n\t\n\t\\bibitem{Lieberman-Ashida} M. A. Lieberman and S. Ashida , Plasma Sources Sci. Technol. 5, 145 (1996).\n\t\n\t\\bibitem{Economou-Review} D. J. Economou , J. Phys. D: Appl. Phys. 47, 303001 (2014).\n\t\n\t\\bibitem{Ahn-Sugai} T. H. Ahn, K. Nakamura, and H Sugai Plasma Sources Sci. Technol. 5 139 (1996).\n\t\n\t\\bibitem{Karkari-Time-resolved-hairpin} S. K. Karkari, C. Gaman,Â A. R. Ellingboe, I. Swindells and J. W. Bradley, Meas. Sci. Technol. 18 2649 (2007).\n\t\n\t\\bibitem{Kullig-Oxygen-detachment-ccp} C. K\\\"{u}llig, K. Dittmann, J. Meichsner, Physics of Plasmas 19 073517 (2012).\n\t\n\t\\bibitem{Brockhaus-Oxygen-detachment-icp} A. Brockhaus, G. F. Leu, V. Selenin, Kh. Tarnev, J. Engemann, Plasma Sources Sci. Technol. 15 171-7 (2006).\n\t\n\t\\bibitem{Andrasch-brief-dip-and-flat-power-profile w/ electron-thermalization} M. Andrasch, J. Ehlbeck, R. Foest, K-D. Weltmann, Plasma Sources Sci. Technol. 21 055032 (2012).\n\t\n\t\\bibitem{Piejak 2004} R.B. Piejak, V.A. Godyak, R. Garner, and B.M. Alexandrovich, Journal of Applied Physics 95, 3785 (2004).\n\t\n\t\\bibitem{Piejak 2005} R.B. Piejak, J. Al-Kuzee, and N. St. J. Braithwaite, Plasma Sources Sci. Technol. 14 734-743 (2005).\n\t\n\t\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 4969, "prevtext": "\n\n\n\n\n\n\n\\title{Microsecond resolved electron density measurements with a hairpin resonator probe in a pulsed ICP discharge} \n\n\n\n\n\n\n\n\n\n\n\\author{David Peterson}\n\\email[]{djpeter5@ncsu.edu}\n\n\n\n\\affiliation{Department of Nuclear Engineering, North Carolina State University, Raleigh, North Carolina 27695, USA}\n\n\\author{David Coumou}\n\\email[]{David$_$Coumou@mksinst.com}\n\\affiliation{MKS Instruments, Rochester, New York 14623, USA}\n\n\\author{Lynda Larson}\n\\affiliation{Treasure Isle Jewelers, Raleigh, North Carolina 27511, USA}\n\n\\author{Steven Shannon}\n\\email[]{scshanno@ncsu.edu}\n\\affiliation{Department of Nuclear Engineering, North Carolina State University, Raleigh, North Carolina 27695, USA}\n\n\n\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\n\tTime resolved electron density measurements in pulsed RF discharges are shown using a hairpin resonance probe using low cost electronics, on par with normal Langmuir probe boxcar mode operation. Time resolution of less than one microsecond has been demonstrated. A signal generator produces the applied microwave frequency; the reflected waveform is passed through a directional coupler and filtered to remove the RF component. The signal is heterodyned with a frequency mixer and read by an oscilloscope. At certain points during the pulse, the plasma density is such that the applied frequency is the same as the resonance frequency of the probe/plasma system, creating a dip in the reflected signal. The applied microwave frequency is shifted in small increments in a frequency boxcar routine to determine the density as a function of time. The system uses a grounded probe to produce low cost, high fidelity, and highly reproducible electron density measurements that can work in harsh chemical environments. Measurements are made in an inductively coupled system, driven by a single frequency pulsing generator driven at 13.56 MHz and are compared to results from literature.\n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle \n\n\n\n\\section{Introduction}\n\tPulsed radio-frequency (RF) discharges are becoming an increasingly important subset of RF plasmas, particularly for industrial applications where ion energy distribution control is important. Pulsed plasmas are often used to mitigate charge build up on surface substrates. Electrons are the species responsible for this mitigation, so time resolved electron density measurements are particularly important. Obtaining these time resolved measurements of transients in RF pulsed discharges can be done through a number of diagnostic methods. However, highly time resolved measurements on the order of 100's of nanoseconds can be considerably more difficult$^{[1,2]}$. Additionally, most diagnostic methods are accompanied by problematic drawbacks. For instance, Langmuir probes perturb the local plasma by drawing current and affect measurements and have trouble working in harsh chemical environments because thin films deposited on their surface can inhibit charge collection. Interferometry suffers from a lack of spatial resolution, can often be costly, and not possible in certain experimental setups, but suffers few other drawbacks. Hairpin probes operated in boxcar mode offer nearly the same time resolution as interferometry but with the added bonus of spatial resolution and have none of the drawbacks inherent to Langmuir probes. \n\n\n\n\n\\section{Hairpin Probe Review}\n\\subsection{Probe design and construction}\n\n\tDesign of a hairpin probe depends on the type of plasma source being measured. The first choice one faces is deciding on the type of probe to employ. There are three choices available: grounded reflection, floating reflection, and grounded transmission. Floating transmission probes are not possible since the hairpin needs to  be connected to an external (and thus grounded) circuit. Transmission probes are a viable option and have the added benefit of not requiring a directional coupler since reflected signal is no longer being measured, but involve more complicated construction. Transmission probes tend ot have a higher Q value$^{[12]}$, which is important for higher pressure plasmas where collisions will negatively influence the signal quality. After deciding this, one needs estimates for the pressure ranges, electron densities, and electron temperatures. The peak electron densities combined with the desired hairpin dimensions will yield the required maximum signal generator frequency required, as seen in equation 1. The hairpin dimensions need to be such that the radii of the hairpin wires must be much less than the electron mean free path and also long enough to keep the resonance frequency low. Further hairpin probe design considerations can be found in literature$^{[12,13]}$ The floating probe has the added benefit of minimizing the effects of the RF sheath oscillations since it is floating with the RF potential. The measurements taken for this work are done using a grounded reflection hairpin probe, which is the simplest to construct. \n\t\n", "index": 1, "text": "\\begin{equation}\n\tn_{e} = \\frac{f_{r}^{2} - f_{0}^{2} }{0.81 \\xi_{c}}\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"n_{e}=\\frac{f_{r}^{2}-f_{0}^{2}}{0.81\\xi_{c}}\" display=\"block\"><mrow><msub><mi>n</mi><mi>e</mi></msub><mo>=</mo><mfrac><mrow><msubsup><mi>f</mi><mi>r</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>f</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mrow><mn>0.81</mn><mo>⁢</mo><msub><mi>ξ</mi><mi>c</mi></msub></mrow></mfrac></mrow></math>", "type": "latex"}]