[{"file": "1601.03044.tex", "nexttext": "\nwhere the incoming proton interacts via its charm constituents described by the parton distribution function (PDF) $c(x_a,Q^2)$. Here, $f(x_t,Q^2)$ is the PDF of the target, $x_a$ is the active charm quark fractional momentum, $x_t$ is the target parton fractional momentum and $\\hat{\\sigma}_{f \\,\\bar{c} \\rightarrow f \\,\\bar{c}}$ is the partonic cross section. We sum over the diagrams involving a charm constituent of the interacting hadrons shown in Fig. \\ref{fig:feyn}. All subprocesses are explicitly given in the appendix. We fix the two free parameters, $Q^2$ and $\\hat{t}_{min}$, to $3~m_c^2$ and $2~m_c^2$, respectively, to match $c \\bar{c}$ cross section data following references~\\cite{Alice:2012,ATLAS:2011fea,Aaij:2013mga,Adare:2006hc,Adamczyk:2012af}. Whereas the charm structure function of the proton could at best be guessed at in reference~\\cite{Halzen:Diff}, the charm partonic distribution function has now been determined by collider experiments. For this paper, we use the PDF set CT10 \\cite{Lai:2010vv}.\n\nWe next focus on the contribution of the charm cross section where the spectator quark bleaches its color by combining with the valence quarks in the incident proton,\n\n\n", "itemtype": "equation", "pos": 8641, "prevtext": "\n\n\\title{Upper Limit on Forward Charm Contribution to Atmospheric Neutrino Flux}\n\n\\author{Francis Halzen\\footnote{francis.halzen@icecube.wisc.edu}}\n\\author{Logan Wille\\footnote{wille3@wisc.edu}}\n\\affiliation{Wisconsin IceCube Particle Astrophysics Center and Department of Physics, University of Wisconsin, Madison, WI 53706, USA} \n\n\\begin{abstract}\n\nWe revisit the calculation of charm particle production in hadron collisions, focusing on the production of charm particles that carry a large fraction of the momentum of the incident proton. In the case of strange particles, such a component is familiar from the abundant production of $K^+\\Lambda$ pairs. Modern collider experiments have no coverage in the very large rapidity region where the forward pair production dominates. While forward charm particles are produced inside the LHC beampipe, they dominate the high-energy atmospheric neutrino flux in underground experiments because long-lived pions and kaons interact before decaying into neutrinos. The fragmentation of the {\\it spectator} quark in the partonic subprocesses $qc \\rightarrow qc$ and $gc \\rightarrow gc$ is responsible for the forward component of charm production in perturbative QCD. We use this phenomenological framework to construct a charm cross section that saturates available accelerator and cosmic ray data, i.e., it represents an upper limit on the normalization of the charm cross section that cannot be reliably calculated because the charm mass is much smaller than the center-of-mass energy. Where the highest energy IceCube observations are concerned, we conclude that the upper limit on the flux of neutrinos from forward charm production may dominate the much-studied central component. It may therefore also represent a significant contribution to the TeV atmospheric neutrino flux but cannot accommodate the PeV flux of high-energy cosmic neutrinos observed by IceCube, or even the excess of events observed in the 30 TeV energy range.\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\\label{sec:intro}\n\nThe production of charm hadrons by cosmic rays interacting in the Earth's atmosphere \\cite{Enberg:2008,Gauld:2015kvh,Gauld:2015yia,Bhattacharya:2015jpa,Garzelli:2015psa,Pasquali:1998ji, Gondolo:1995fq,Gaisser:2013rx,Gelmini:2000wm,Martin:2003bu} is the dominant background for the detection of cosmic neutrinos above an energy that depends on the charm cross section and on its dependence on Feynman $x_F$. Because of their short lifetime, charm hadrons decay promptly into neutrinos in contrast with relatively long-lived high-energy pions and kaons that, at high energies, interact and lose energy before decaying. Although prompt neutrinos may represent the dominant component of the atmospheric neutrino background for the identification of the cosmic neutrino flux at PeV energy, they have not yet been identified as such. IceCube observations \\cite{JVS:2014} indicate that the neutrino flux is dominated by conventional atmospheric neutrinos at low energy and by cosmic neutrinos at high energy; charm neutrinos never dominate the measured spectrum. Obviously, the issue is of great interest because a poor understanding of a potential charm neutrino background interferes with the precise characterization of the cosmic flux measured by IceCube. Neutrinos provide the first unobstrutced view of cosmic accelerators at the highest energies.\n\nIt is important to realize that the production of charm in the atmosphere cannot accommodate the observed flux of high energy neutrinos. We know, independent of theory, that the charm flux tracks the energy dependence of the cosmic ray flux incident on the atmosphere and that it is indipendent of zenith angle. There is no evidence for such a component in any of the multiple IceCube analyses. On the other hand there is accumulating evidence for a steepening of the cosmic neutrino flux with lower threshold; the flux is not a single power. Already the first attempt to lower the threshold \\cite{JVS:2014} revealed an excess of events in 30 TeV energy range raising the possibility of a charm background.\n\nThe hadronic production of charm particles has been extensively studied in the context of perturbative QCD \\cite{Beenakker:1988bq,Ellis:1988sb,Nason:1987xz,Nason:1989zy}. These calculations often use a color dipole description of the target proton \\cite{Arguelles:2015wba,Nikolaev:1995ty,Raufeisen:2002ka,Kopeliovich:2002yv} in order to mitigate the breakdown of the perturbative calculation associated with large $log(1/x)$ where $x=m_c / \\sqrt{s}$. Here $m_c$ is the charm quark mass and $s$ the center-of-mass energy of the colliding hadrons. At high energy, the charm quark is no longer a heavy quark whose mass controls the perturbative expansion. More importantly, these calculations only describe the central production of charm particles with a cross section that peaks at Feynman $x_F \\sim 0$, providing an incomplete picture. For strange particles, the central component of particle production is accompanied by a forward component where the incident proton transfers most of its energy to a $K^+ \\Lambda$ pair with the same quantum numbers \\cite{Edwards:1978mc}. It dominates strange particle production at large Feynman $x_F$. In this paper, we evaluate the corresponding cross section for charm production in perturbative QCD making no attempt to compute its normalization, which is highly uncertain as it is for the central component. However, limits on its magnitude can be derived using IceCube observations of the atmospheric flux of muon and electron neutrinos and data from archival experiments performed at the CERN Intersecting Storage Ring (ISR). We will thus obtain a ``maximal'' contribution of the forward component of charm particle production that, like for strange particles, contributes qualitatively at the same level as the central component to the total charm particle cross section. However, while it dictates the production of the highest energy atmospheric neutrinos in IceCube, we conclude that it cannot accommodate the flux of cosmic neutrinos that dominates the spectrum at the highest neutrino energies. In addition, this forward charm production is unable to explain the 30 TeV excess over the best-fit power law  as seen in a recent IceCube analysis focusing on lower energy neutrinos \\cite{JVS:2014}.\n\nIt has been pointed out some time ago that a perturbative QCD calculation of charm produces a forward component that peaks near $x_F \\sim 1$ where it dominates the central component \\cite{Halzen:Diff}. The forward charm particles are the hadronization product of the spectator quark in the leading-order partonic subprocesses $qc \\rightarrow qc$ and $gc \\rightarrow gc$; see Fig. \\ref{fig:spec}. While the active constituent charm quark carries a momentum fraction $x \\sim0$, the spectator quark hadronizes with the valence quarks of the incoming proton into a charm hadron that carries a large fraction of the proton momentum. The high-momentum charm hadrons thus produced decay leptonically to energetic muons and neutrinos that penetrate into underground detectors. The spectrum of these neutrinos extends higher in energy than predicted by calculations that have neglected the forward component. While this prompt neutrino flux cannot explain the high-energy neutrino flux observed by IceCube, it potentially represents a background to the cosmic neutrino flux and is therefore critical to characterize.\n\n\\begin{figure}[h]\n\\includegraphics[width=0.48\\textwidth]{spec-figure.eps}\n\\caption{A partonic interaction between two protons via a c-$\\bar{c}$ quark pair in one proton and a gluon in the other. We refer to the charm quark that interacts with the gluon as ``active,'' the other as ``spectator.''}\n\\label{fig:spec}\n\\end{figure}\n\nThis paper is organized as follows: in section \\ref{sec:diff}, the differential cross section for production of the spectator charm quark is derived within the conventional framework of perturbative QCD. In section \\ref{sec:flux}, we evaluate the associated upper limit flux of prompt neutrinos. We subsequently discuss in section \\ref{sec:veto} the effect of the IceCube veto routinely imposed in IceCube analyses. It requires that candidate cosmic neutrinos are not accompanied by particles that signal the presence of an air shower. We finally confront our estimates of the charm flux with the data in section \\ref{sec:conclu}.\n\n\\section{The Forward Charm Cross Section}\n\\label{sec:diff}\nWe first perform the leading order calculation of charm quark production including the diagrams involving constituent charm quarks in the interacting hadrons, \n\n\n", "index": 1, "text": "\\begin{equation}\n\\frac{\\partial \\sigma(pp \\rightarrow \\bar{c}_a)}{\\partial x_a} = \\sum_f \\int  \\,dx_t\\, c(x_a,Q^2)\\, f(x_t,Q^2)\\, \\hat{\\sigma}_{f \\,\\bar{c} \\rightarrow f \\,\\bar{c}},\n\\label{eq:dxF}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\sigma(pp\\rightarrow\\bar{c}_{a})}{\\partial x_{a}}=\\sum_{f}\\int\\,%&#10;dx_{t}\\,c(x_{a},Q^{2})\\,f(x_{t},Q^{2})\\,\\hat{\\sigma}_{f\\,\\bar{c}\\rightarrow f%&#10;\\,\\bar{c}},\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mi>σ</mi><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mi>p</mi><mo>→</mo><msub><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">¯</mo></mover><mi>a</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>x</mi><mi>a</mi></msub></mrow></mfrac><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>f</mi></munder><mrow><mo largeop=\"true\" rspace=\"4.2pt\" symmetric=\"true\">∫</mo><mrow><mrow><mo>𝑑</mo><mpadded width=\"+1.7pt\"><msub><mi>x</mi><mi>t</mi></msub></mpadded></mrow><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>a</mi></msub><mo>,</mo><msup><mi>Q</mi><mn>2</mn></msup><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>t</mi></msub><mo>,</mo><msup><mi>Q</mi><mn>2</mn></msup><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mpadded width=\"+1.7pt\"><mi>f</mi></mpadded><mo>⁢</mo><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">¯</mo></mover></mrow><mo>→</mo><mrow><mpadded width=\"+1.7pt\"><mi>f</mi></mpadded><mo>⁢</mo><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">¯</mo></mover></mrow></mrow></msub></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03044.tex", "nexttext": "\nwhere $x_s$ is the spectator charm quark fractional momentum and $x_{u1}, x_{u2}, x_d$ are the valence quarks fractional momenta. We enforce $x_s = 1 - x_a - x_{u_1} - x_{u_2} - x_d$ such that the spectator charm quark carries all momentum not carried by the valence quarks or active charm quark. Finally, $P(x_{u_1},x_{u_2},x_d)$ is the probability distribution of the valence quarks fractional momentums given by the normalized parton distribution functions of the valence quarks,\n\n\n", "itemtype": "equation", "pos": 10049, "prevtext": "\nwhere the incoming proton interacts via its charm constituents described by the parton distribution function (PDF) $c(x_a,Q^2)$. Here, $f(x_t,Q^2)$ is the PDF of the target, $x_a$ is the active charm quark fractional momentum, $x_t$ is the target parton fractional momentum and $\\hat{\\sigma}_{f \\,\\bar{c} \\rightarrow f \\,\\bar{c}}$ is the partonic cross section. We sum over the diagrams involving a charm constituent of the interacting hadrons shown in Fig. \\ref{fig:feyn}. All subprocesses are explicitly given in the appendix. We fix the two free parameters, $Q^2$ and $\\hat{t}_{min}$, to $3~m_c^2$ and $2~m_c^2$, respectively, to match $c \\bar{c}$ cross section data following references~\\cite{Alice:2012,ATLAS:2011fea,Aaij:2013mga,Adare:2006hc,Adamczyk:2012af}. Whereas the charm structure function of the proton could at best be guessed at in reference~\\cite{Halzen:Diff}, the charm partonic distribution function has now been determined by collider experiments. For this paper, we use the PDF set CT10 \\cite{Lai:2010vv}.\n\nWe next focus on the contribution of the charm cross section where the spectator quark bleaches its color by combining with the valence quarks in the incident proton,\n\n\n", "index": 3, "text": "\\begin{equation}\n\\begin{aligned}\n\\frac{\\partial \\sigma(pp \\rightarrow c_s)}{\\partial x_s} =& \\int\\ dx_{u_1} dx_{u_2} dx_d dx_a \\ \\bigg[\\frac{\\partial \\sigma(pp \\rightarrow \\bar{c}_a)}{\\partial x_a} \\\\\n&P(x_{u_1},x_{u_2},x_d) \\delta(1-x_s-x_a-x_{u_1}-x_{u_2}-x_d) \\bigg],\n\\label{eq:dxL}\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{\\partial\\sigma(pp\\rightarrow c_{s})}{\\partial x_{s}}=\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mi>σ</mi><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mi>p</mi><mo>→</mo><msub><mi>c</mi><mi>s</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>x</mi><mi>s</mi></msub></mrow></mfrac></mstyle><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\int\\ dx_{u_{1}}dx_{u_{2}}dx_{d}dx_{a}\\ \\bigg{[}\\frac{\\partial%&#10;\\sigma(pp\\rightarrow\\bar{c}_{a})}{\\partial x_{a}}\" display=\"inline\"><mrow><mpadded width=\"+5pt\"><mstyle displaystyle=\"true\"><mo largeop=\"true\" rspace=\"7.5pt\" symmetric=\"true\">∫</mo></mstyle></mpadded><mi>d</mi><msub><mi>x</mi><msub><mi>u</mi><mn>1</mn></msub></msub><mi>d</mi><msub><mi>x</mi><msub><mi>u</mi><mn>2</mn></msub></msub><mi>d</mi><msub><mi>x</mi><mi>d</mi></msub><mi>d</mi><mpadded width=\"+5pt\"><msub><mi>x</mi><mi>a</mi></msub></mpadded><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mi>σ</mi><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mi>p</mi><mo>→</mo><msub><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">¯</mo></mover><mi>a</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>x</mi><mi>a</mi></msub></mrow></mfrac></mstyle></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle P(x_{u_{1}},x_{u_{2}},x_{d})\\delta(1-x_{s}-x_{a}-x_{u_{1}}-x_{u_%&#10;{2}}-x_{d})\\bigg{]},\" display=\"inline\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><msub><mi>u</mi><mn>1</mn></msub></msub><mo>,</mo><msub><mi>x</mi><msub><mi>u</mi><mn>2</mn></msub></msub><mo>,</mo><msub><mi>x</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><msub><mi>x</mi><mi>s</mi></msub><mo>-</mo><msub><mi>x</mi><mi>a</mi></msub><mo>-</mo><msub><mi>x</mi><msub><mi>u</mi><mn>1</mn></msub></msub><mo>-</mo><msub><mi>x</mi><msub><mi>u</mi><mn>2</mn></msub></msub><mo>-</mo><msub><mi>x</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03044.tex", "nexttext": "\n\n\\begin{figure}[h]\n\\includegraphics[width=0.48\\textwidth]{feyn.eps}\n\\caption{The partonic interaction diagrams that lead to the production of a spectator charm quark in a proton-proton interaction.}\n\\label{fig:feyn}\n\\end{figure}\n\nThe resulting charm  cross section is shown in Fig. \\ref{fig:comparexF} for an incident proton energy $E_p=10^6$ GeV. The forward component is shown along with the central component dominated by the subprocess $gg \\rightarrow c \\bar{c}$, Eq. (\\ref{eq:gg}). While the active charm component represents a subdominant contribution to the central production of charmed particles, the spectator contribution dominates for x-values above 0.2. The spectator charm effectively becomes a valence quark during this interaction, resulting in the forward production. Note that perturbative QCD  generates a forward component of the charm cross section without resorting to intrinsic charm. The subprocess effectively promotes the spectator charm to a valence quark. The phenomenology is therefore similar to that of intrinsic charm quarks in the proton and we do not anticipate that an analysis modeling intrinsic charm will lead to different conclusions.\n\n\\begin{figure}[h]\n\\includegraphics[width=0.5\\textwidth]{Paper1e6xF.eps}\n\\caption{The differential cross sections for producing charm quarks as a function of their longitudinal momentum fraction. The central gluon fusion component is shown along with the contribution of the diagrams with an active charm quark. The spectator charm's differential cross section is peaked at large $x_F$ carrying the majority of the momentum of the proton that produced it.}\n\\label{fig:comparexF}\n\\end{figure}\n\nA caveat at this point is that the spectator charm cross section calculates the production of a charm quark and not a charmed hadron. The hadronization of the spectator charm quark with the valence quarks of the incident proton results in the dominant contribution to forward scattering. The strings linking the charm quark with the other proton constituents into charm hadrons reduce its fractional momentum. We implement a hadronization scheme inspired by reference~\\cite{Martin:2003us} by reducing the charmed baryon momentum, $x_{\\Lambda_c} = {x_s}/{1.1}$. In Fig. \\ref{fig:Hadron}, we show that this procedure actually describes the $x_F$ dependence of the highest energy measurement available from ISR R-422. This archival data represent the strongest constraint on how much momentum can be carried by $\\Lambda_cD$ pairs.\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{PaperHadron092115.eps}\n\\caption{The Feynman $x_F$ dependence for $\\Lambda_c$ production is compared with ISR data \\cite{Bari:1991in} at $\\sqrt{s} = 63$ GeV.}\n\\label{fig:Hadron}\n\\end{figure}\n\nThe calculation described above leads to atmospheric neutrino fluxes that exceed the data. As the normalization of the cross section is sensitive to the scales defining the perturbative QCD expansion, we let it float and obtain a maximal value for a normalization $\\sigma(\\Lambda_c) / \\sigma(c_s) = 0.214$. In other words, there is a tension in normalization between the atmospheric neutrino and ISR data; see also Section \\ref{sec:flux}. We repeat the same procedure for $\\bar{D}^0$ and $D^{-}$ meson hadronization with a shape change of $x_{D} = {3 x_s}/{4}$ and cross section normalization of 0.476 and 0.238 respectively.\n\nAn important note, the hadronization scheme chosen is maximal without exceeding measured neutrino fluxes. We thus obtain an upper limit of the forward charm contribution to the neutrino flux and explore its potential impact on the IceCube events observed. Although it is straightforward to include the higher order diagrams, the changes introduced are well within the uncertainties associated with the hadronization that is poorly constrained by data. \n\n\\section{Prompt Neutrino Flux Upper Limit}\n\\label{sec:flux}\nWe next calculate the neutrino spectrum from the decay of the charmed hadrons using the MCEq atmospheric interaction package \\cite{Fedynitch:2015zma}. We use two parameterizations of the incident cosmic ray flux from Gaisser and collaborators \\cite{ref:Id0,Gaisser:2012,Gaisser:2013}. These fits to the cosmic ray flux assume a very different primary composition, yet they yield very similar results in this context. We use the H3a fit, which assumes a heavy nuclei composition at high energies, for the rest of the paper.\n\nThe neutrino spectrum upper limit resulting from the maximal contribution of the hadronization of the spectator charm described in the previous section is compared to the highest energy measurements \\cite{Aartsen:2015xup} of the atmospheric electron flux in Fig.~\\ref{fig:flux}. It is compared to the one of Enberg et al. referred to as ERS \\cite{Enberg:2008}. Note that our floating normalization spectator charm neutrino flux added to the conventional pion and kaon neutrino flux \\cite{Honda:2006qj} saturates the atmospheric electron neutrino flux measured by IceCube \\cite{Aartsen:2015xup}. A future measurement with higher statistics will be very useful in this context. IceCube has also performed an analysis \\cite{JVS:2014} of neutrino events starting in the detector that has resulted in an upper limit of the prompt neutrino flux. We note however that the flux was modeled after the ERS flux and only the normalization was varied. As seen in Fig.~\\ref{fig:flux}, the spectator charm neutrino spectrum has a different shape, closer to an $E^{-2}$ spectrum below 100 TeV. This allows the model to partially evade the current IceCube limits.\n\n\\begin{figure}[ht!]\n\\includegraphics[width=0.5\\textwidth]{nuFluxWithDataCT10Fixed.eps}\n\\caption{The maximal prompt neutrino spectrum for the spectator charm and Enberg et al. calculations. The spectator $\\nu_e$ flux saturates the 10 TeV atmospheric $\\nu_e$ flux measurement, showing the normalization for the charm meson hadronization cannot be larger. Note, the ERS flux is only shown down to 1 TeV.}\n\\label{fig:flux}\n\\end{figure}\n\nWe also calculated the expected number of $\\nu_\\mu$ events penetrating the Earth; the result is compared to the first two years of IceCube \\cite{Aartsen:2015rwa} in Fig. \\ref{fig:numuevents}. It is also compared to the best fit cosmic neutrino spectrum. An important point about the flux from the spectator charm neutrino is the flavor and neutrino antineutrino ratio: for the astrophysical neutrino flux the flavor ratio is assumed to be 1:1:1 for $\\nu_e : \\nu_\\mu : \\nu_\\tau$ and equal parts neutrino and antineutrino. In contrast, for the spectator neutrino flux the flavor ratio is $\\sim$ 1:1:0 and the neutrino to antineutrino ratio is $\\sim$ 1:10. This is important when comparing the spectator neutrino flux for different analyses as they tend to prefer specific neutrino flavors.\n\nWhile one may be tempted to conclude that the spectator neutrino flux may accommodate the data, this is not the case. The updated analysis using six years of IceCube livetime has revealed a high-energy astrophysical spectrum of $E^{-1.91}$, including a very high energy neutrino event with deposited energy of 2.6 PeV \\cite{Aartsen:2015zva}. The flux of charm origin shown in Fig.~\\ref{fig:numuevents} cannot describe this result.\n\n\\begin{figure}[h!]\n\\includegraphics[width=0.5\\textwidth]{CWeaverEvents.eps}\n\\caption{The expected number of events in two years of IceCube looking for $\\nu_\\mu$ events coming through the Earth. We compare the spectator neutrino expected number of events to the best fit astrophysical spectrum found in \\cite{Aartsen:2015rwa}.}\n\\label{fig:numuevents}\n\\end{figure}\n\n\\section{Comparison to IceCube Observations}\n\\label{sec:veto}\n\nWe have fixed a normalization of our maximal prompt flux that saturates the IceCube measurements of the atmospheric electron neutrino flux in the ten TeV energy range as well as the muon neutrino data in the 100~TeV energy range; see Fig. \\ref{fig:flux} and Fig. \\ref{fig:numuevents}. Atmospheric neutrinos are produced in air showers and are consequently accompanied underground by high-energy muons produced in the same shower. Therefore, IceCube's veto based searches for cosmic neutrinos routinely introduce a so-called self-veto, where an atmospheric neutrino is vetoed when accompanied by atmospheric muons \\cite{PhysRevD.90.023009}. We use the technique of reference \\cite{PhysRevD.90.023009} to calculate the self-veto probability of the spectator charm neutrino flux modulo a modification that we discuss next.\n\n\\begin{figure}[h!]\n\\includegraphics[width=0.5\\textwidth]{PassingCT10Final.eps}\n\\caption{The uncorrelated and correlated self-veto passing rate for the spectator charm neutrino flux in IceCube at three different zenith angles. The uncorrelated passing rate enforces shower energy conservation as described in the text.}\n\\label{fig:passing}\n\\end{figure}\n\nFor spectator charm, the charmed hadron carries a large fraction of the incident proton energy. This reduces the energy of the remaining shower, which reduces the probability for producing an high-energy muon in a second, uncorrelated hadron. We contrast correlated and uncorrelated muons, with the correlated produced in the hadron decay along with the observed neutrino, and the uncorrelated originating from other particles in the air shower. While negligible for central charm production, for spectator charm this effect can be significant in calculating the uncorrelated muon self-veto probability. For the correlated muon, a muon that is produced by the same hadron decay as the neutrino, there is no need to make this modification. The uncorrelated muon and correlated muon self-veto passing rates are shown in Fig.~\\ref{fig:passing}. \n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{nuVetoFluxCT10Final.eps}\n\\caption{The spectator charm neutrino spectrum summed over neutrino flavors is shown for the northern and southern sky, with the self-veto effect added to the southern sky flux. Two IceCube veto-based-analysis best fit spectra summed over neutrino flavor are shown as a reference \\cite{JVS:2014, PhysRevLett.113.101101}.}\n\\label{fig:vetoflux}\n\\end{figure}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=0.95\\textwidth]{MESETwoSkyUpdated.eps}\n\\caption{The expected number of events in both the northern and southern sky for two years in IceCube using a veto-based detection scheme \\cite{JVS:2014}. In the northern sky, the maximal flux from the spectator charm neutrino leaves little room for an additional cosmic neutrino flux without exceeding the observed events. While in the southern sky, an additional cosmic neutrino flux is needed to have agreement between the expected number of events and the observed number of events. Even removing the self-veto effect discussed in section \\ref{sec:veto}, the maximal prompt neutrino flux cannot explain the high-energy events observed in IceCube.}\n\\label{fig:Event}\n\\end{center}\n\\end{figure*}\n\nUsing these results, we obtain Fig. \\ref{fig:vetoflux}, the maximal prompt neutrino spectrum resulting from forward charm along the best fit of IceCube neutrino spectra obtained in veto-imposed analyses. We subsequently compute the corresponding number of events in the 2-year ``MESE'' IceCube analysis \\cite{JVS:2014} separately for the Southern and Northern Hemispheres; see Fig. \\ref{fig:Event}. For the Northern Hemisphere, it may be tempting to conclude that the data can be described by charm. This conclusion is helped by the fact that cosmic neutrinos with PeV energy and above are in any case absorbed by the Earth. However, in the southern sky, there is a significant disagreement between the observed events and the expected number of events for the extreme spectator neutrino flux that we have constructed, both where its normalization and its Feynman $x_F$ distribution are concerned. Clearly an additional astrophysical flux is required to achieve agreement between the expected and observed events. Even after removing the self-veto of the spectator neutrino flux we reach the same conclusion. The basic reason for the disagreement is the softening of the atmospheric neutrino spectrum, which is strongly suppressed above 100 TeV---the prompt flux simply traces the atmospheric cosmic ray spectrum and cannot accommodate the highest energy events.\n\n\\section{Conclusions}\n\\label{sec:conclu}\nWe have used leading-order perturbative QCD to emphasize the fact that one expects a central as well as a forward component of charm production, a fact clearly underscored by the data for strange particle production. We have computed the charm cross section and the Feynman-$x_F$ distribution of the secondary charm particles including both components with the normalization is treated as a parameter. It cannot be reliably predicted because of large logartihms associated with the small value of $m_c/\\sqrt{s}$ at these energies. The normalization was maximized without exceeding the charm measurements at colliders and the high-energy atmospheric neutrino data in underground experiments. We subsequently calculated the upper limit flux of prompt neutrinos from the decay of charmed particles in IceCube, which is clearly dominated by a potential forward component of the flux. Finally, we applied the effect of self-veto on the prompt neutrino flux and showed the expected event distribution for two years of IceCube. We found that the prompt neutrino flux from a forward charm may represent a significant background to the cosmic neutrino flux but cannot explain the high-energy events observed by IceCube at the highest energies.\n\n\\section{Acknowledgments}\n\nDiscussion with collaborators inside and outside the IceCube Collaboration, too many to be listed, have greatly shaped this presentation. We acknowledge the comments of M. Reno and M. Ahlers on an earlier version of the manuscript. We also thank A. Fedynitch and J. van Santen  for assistance in modifying their programs. This research was supported in part by the U.S. National Science Foundation under Grants No.~ANT-0937462 and PHY-1306958 and by the University of Wisconsin Research Committee with funds granted by the Wisconsin Alumni Research Foundation.\n\n\\section{Appendix}\n\\label{sec:appen}\nHere we show the partonic cross sections used in this paper with their respective threshold center of mass energy. These cross sections correspond to the Feynman diagrams shown in Fig.\\ref{fig:feyn}. The cross sections follow in Eqns. \\ref{eq:qc} through \\ref{eq:gg}, with kinematic variables $t_{min} = 2 {m_c}^2$, $y_0 = (\\hat{s}^2 - m^2)^2/\\hat{s}$, $\\hat{t}_0 = min (\\hat{s} - m^2 - \\hat{t}_{min}, y_0)$, $x_0 = (1 - 4 m_c^2/\\hat{s})^{1/2}$ and $\\sigma_0 = 4 \\pi \\alpha_s^2(\\mu_F)/(3 \\hat{s})$.\n\n\\begin{widetext}\n\n", "itemtype": "equation", "pos": 10848, "prevtext": "\nwhere $x_s$ is the spectator charm quark fractional momentum and $x_{u1}, x_{u2}, x_d$ are the valence quarks fractional momenta. We enforce $x_s = 1 - x_a - x_{u_1} - x_{u_2} - x_d$ such that the spectator charm quark carries all momentum not carried by the valence quarks or active charm quark. Finally, $P(x_{u_1},x_{u_2},x_d)$ is the probability distribution of the valence quarks fractional momentums given by the normalized parton distribution functions of the valence quarks,\n\n\n", "index": 5, "text": "\\begin{equation}\nP(x_{u_1},x_{u_2},x_d) = \\frac{u_v(x_{u_1})}{2} \\frac{u_v(x_{u_2})}{2} d_v(x_d). \n\\label{eq:P}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P(x_{u_{1}},x_{u_{2}},x_{d})=\\frac{u_{v}(x_{u_{1}})}{2}\\frac{u_{v}(x_{u_{2}})}%&#10;{2}d_{v}(x_{d}).\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><msub><mi>u</mi><mn>1</mn></msub></msub><mo>,</mo><msub><mi>x</mi><msub><mi>u</mi><mn>2</mn></msub></msub><mo>,</mo><msub><mi>x</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><msub><mi>u</mi><mi>v</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><msub><mi>u</mi><mn>1</mn></msub></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac><mo>⁢</mo><mfrac><mrow><msub><mi>u</mi><mi>v</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><msub><mi>u</mi><mn>2</mn></msub></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>d</mi><mi>v</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03044.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 25638, "prevtext": "\n\n\\begin{figure}[h]\n\\includegraphics[width=0.48\\textwidth]{feyn.eps}\n\\caption{The partonic interaction diagrams that lead to the production of a spectator charm quark in a proton-proton interaction.}\n\\label{fig:feyn}\n\\end{figure}\n\nThe resulting charm  cross section is shown in Fig. \\ref{fig:comparexF} for an incident proton energy $E_p=10^6$ GeV. The forward component is shown along with the central component dominated by the subprocess $gg \\rightarrow c \\bar{c}$, Eq. (\\ref{eq:gg}). While the active charm component represents a subdominant contribution to the central production of charmed particles, the spectator contribution dominates for x-values above 0.2. The spectator charm effectively becomes a valence quark during this interaction, resulting in the forward production. Note that perturbative QCD  generates a forward component of the charm cross section without resorting to intrinsic charm. The subprocess effectively promotes the spectator charm to a valence quark. The phenomenology is therefore similar to that of intrinsic charm quarks in the proton and we do not anticipate that an analysis modeling intrinsic charm will lead to different conclusions.\n\n\\begin{figure}[h]\n\\includegraphics[width=0.5\\textwidth]{Paper1e6xF.eps}\n\\caption{The differential cross sections for producing charm quarks as a function of their longitudinal momentum fraction. The central gluon fusion component is shown along with the contribution of the diagrams with an active charm quark. The spectator charm's differential cross section is peaked at large $x_F$ carrying the majority of the momentum of the proton that produced it.}\n\\label{fig:comparexF}\n\\end{figure}\n\nA caveat at this point is that the spectator charm cross section calculates the production of a charm quark and not a charmed hadron. The hadronization of the spectator charm quark with the valence quarks of the incident proton results in the dominant contribution to forward scattering. The strings linking the charm quark with the other proton constituents into charm hadrons reduce its fractional momentum. We implement a hadronization scheme inspired by reference~\\cite{Martin:2003us} by reducing the charmed baryon momentum, $x_{\\Lambda_c} = {x_s}/{1.1}$. In Fig. \\ref{fig:Hadron}, we show that this procedure actually describes the $x_F$ dependence of the highest energy measurement available from ISR R-422. This archival data represent the strongest constraint on how much momentum can be carried by $\\Lambda_cD$ pairs.\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{PaperHadron092115.eps}\n\\caption{The Feynman $x_F$ dependence for $\\Lambda_c$ production is compared with ISR data \\cite{Bari:1991in} at $\\sqrt{s} = 63$ GeV.}\n\\label{fig:Hadron}\n\\end{figure}\n\nThe calculation described above leads to atmospheric neutrino fluxes that exceed the data. As the normalization of the cross section is sensitive to the scales defining the perturbative QCD expansion, we let it float and obtain a maximal value for a normalization $\\sigma(\\Lambda_c) / \\sigma(c_s) = 0.214$. In other words, there is a tension in normalization between the atmospheric neutrino and ISR data; see also Section \\ref{sec:flux}. We repeat the same procedure for $\\bar{D}^0$ and $D^{-}$ meson hadronization with a shape change of $x_{D} = {3 x_s}/{4}$ and cross section normalization of 0.476 and 0.238 respectively.\n\nAn important note, the hadronization scheme chosen is maximal without exceeding measured neutrino fluxes. We thus obtain an upper limit of the forward charm contribution to the neutrino flux and explore its potential impact on the IceCube events observed. Although it is straightforward to include the higher order diagrams, the changes introduced are well within the uncertainties associated with the hadronization that is poorly constrained by data. \n\n\\section{Prompt Neutrino Flux Upper Limit}\n\\label{sec:flux}\nWe next calculate the neutrino spectrum from the decay of the charmed hadrons using the MCEq atmospheric interaction package \\cite{Fedynitch:2015zma}. We use two parameterizations of the incident cosmic ray flux from Gaisser and collaborators \\cite{ref:Id0,Gaisser:2012,Gaisser:2013}. These fits to the cosmic ray flux assume a very different primary composition, yet they yield very similar results in this context. We use the H3a fit, which assumes a heavy nuclei composition at high energies, for the rest of the paper.\n\nThe neutrino spectrum upper limit resulting from the maximal contribution of the hadronization of the spectator charm described in the previous section is compared to the highest energy measurements \\cite{Aartsen:2015xup} of the atmospheric electron flux in Fig.~\\ref{fig:flux}. It is compared to the one of Enberg et al. referred to as ERS \\cite{Enberg:2008}. Note that our floating normalization spectator charm neutrino flux added to the conventional pion and kaon neutrino flux \\cite{Honda:2006qj} saturates the atmospheric electron neutrino flux measured by IceCube \\cite{Aartsen:2015xup}. A future measurement with higher statistics will be very useful in this context. IceCube has also performed an analysis \\cite{JVS:2014} of neutrino events starting in the detector that has resulted in an upper limit of the prompt neutrino flux. We note however that the flux was modeled after the ERS flux and only the normalization was varied. As seen in Fig.~\\ref{fig:flux}, the spectator charm neutrino spectrum has a different shape, closer to an $E^{-2}$ spectrum below 100 TeV. This allows the model to partially evade the current IceCube limits.\n\n\\begin{figure}[ht!]\n\\includegraphics[width=0.5\\textwidth]{nuFluxWithDataCT10Fixed.eps}\n\\caption{The maximal prompt neutrino spectrum for the spectator charm and Enberg et al. calculations. The spectator $\\nu_e$ flux saturates the 10 TeV atmospheric $\\nu_e$ flux measurement, showing the normalization for the charm meson hadronization cannot be larger. Note, the ERS flux is only shown down to 1 TeV.}\n\\label{fig:flux}\n\\end{figure}\n\nWe also calculated the expected number of $\\nu_\\mu$ events penetrating the Earth; the result is compared to the first two years of IceCube \\cite{Aartsen:2015rwa} in Fig. \\ref{fig:numuevents}. It is also compared to the best fit cosmic neutrino spectrum. An important point about the flux from the spectator charm neutrino is the flavor and neutrino antineutrino ratio: for the astrophysical neutrino flux the flavor ratio is assumed to be 1:1:1 for $\\nu_e : \\nu_\\mu : \\nu_\\tau$ and equal parts neutrino and antineutrino. In contrast, for the spectator neutrino flux the flavor ratio is $\\sim$ 1:1:0 and the neutrino to antineutrino ratio is $\\sim$ 1:10. This is important when comparing the spectator neutrino flux for different analyses as they tend to prefer specific neutrino flavors.\n\nWhile one may be tempted to conclude that the spectator neutrino flux may accommodate the data, this is not the case. The updated analysis using six years of IceCube livetime has revealed a high-energy astrophysical spectrum of $E^{-1.91}$, including a very high energy neutrino event with deposited energy of 2.6 PeV \\cite{Aartsen:2015zva}. The flux of charm origin shown in Fig.~\\ref{fig:numuevents} cannot describe this result.\n\n\\begin{figure}[h!]\n\\includegraphics[width=0.5\\textwidth]{CWeaverEvents.eps}\n\\caption{The expected number of events in two years of IceCube looking for $\\nu_\\mu$ events coming through the Earth. We compare the spectator neutrino expected number of events to the best fit astrophysical spectrum found in \\cite{Aartsen:2015rwa}.}\n\\label{fig:numuevents}\n\\end{figure}\n\n\\section{Comparison to IceCube Observations}\n\\label{sec:veto}\n\nWe have fixed a normalization of our maximal prompt flux that saturates the IceCube measurements of the atmospheric electron neutrino flux in the ten TeV energy range as well as the muon neutrino data in the 100~TeV energy range; see Fig. \\ref{fig:flux} and Fig. \\ref{fig:numuevents}. Atmospheric neutrinos are produced in air showers and are consequently accompanied underground by high-energy muons produced in the same shower. Therefore, IceCube's veto based searches for cosmic neutrinos routinely introduce a so-called self-veto, where an atmospheric neutrino is vetoed when accompanied by atmospheric muons \\cite{PhysRevD.90.023009}. We use the technique of reference \\cite{PhysRevD.90.023009} to calculate the self-veto probability of the spectator charm neutrino flux modulo a modification that we discuss next.\n\n\\begin{figure}[h!]\n\\includegraphics[width=0.5\\textwidth]{PassingCT10Final.eps}\n\\caption{The uncorrelated and correlated self-veto passing rate for the spectator charm neutrino flux in IceCube at three different zenith angles. The uncorrelated passing rate enforces shower energy conservation as described in the text.}\n\\label{fig:passing}\n\\end{figure}\n\nFor spectator charm, the charmed hadron carries a large fraction of the incident proton energy. This reduces the energy of the remaining shower, which reduces the probability for producing an high-energy muon in a second, uncorrelated hadron. We contrast correlated and uncorrelated muons, with the correlated produced in the hadron decay along with the observed neutrino, and the uncorrelated originating from other particles in the air shower. While negligible for central charm production, for spectator charm this effect can be significant in calculating the uncorrelated muon self-veto probability. For the correlated muon, a muon that is produced by the same hadron decay as the neutrino, there is no need to make this modification. The uncorrelated muon and correlated muon self-veto passing rates are shown in Fig.~\\ref{fig:passing}. \n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{nuVetoFluxCT10Final.eps}\n\\caption{The spectator charm neutrino spectrum summed over neutrino flavors is shown for the northern and southern sky, with the self-veto effect added to the southern sky flux. Two IceCube veto-based-analysis best fit spectra summed over neutrino flavor are shown as a reference \\cite{JVS:2014, PhysRevLett.113.101101}.}\n\\label{fig:vetoflux}\n\\end{figure}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=0.95\\textwidth]{MESETwoSkyUpdated.eps}\n\\caption{The expected number of events in both the northern and southern sky for two years in IceCube using a veto-based detection scheme \\cite{JVS:2014}. In the northern sky, the maximal flux from the spectator charm neutrino leaves little room for an additional cosmic neutrino flux without exceeding the observed events. While in the southern sky, an additional cosmic neutrino flux is needed to have agreement between the expected number of events and the observed number of events. Even removing the self-veto effect discussed in section \\ref{sec:veto}, the maximal prompt neutrino flux cannot explain the high-energy events observed in IceCube.}\n\\label{fig:Event}\n\\end{center}\n\\end{figure*}\n\nUsing these results, we obtain Fig. \\ref{fig:vetoflux}, the maximal prompt neutrino spectrum resulting from forward charm along the best fit of IceCube neutrino spectra obtained in veto-imposed analyses. We subsequently compute the corresponding number of events in the 2-year ``MESE'' IceCube analysis \\cite{JVS:2014} separately for the Southern and Northern Hemispheres; see Fig. \\ref{fig:Event}. For the Northern Hemisphere, it may be tempting to conclude that the data can be described by charm. This conclusion is helped by the fact that cosmic neutrinos with PeV energy and above are in any case absorbed by the Earth. However, in the southern sky, there is a significant disagreement between the observed events and the expected number of events for the extreme spectator neutrino flux that we have constructed, both where its normalization and its Feynman $x_F$ distribution are concerned. Clearly an additional astrophysical flux is required to achieve agreement between the expected and observed events. Even after removing the self-veto of the spectator neutrino flux we reach the same conclusion. The basic reason for the disagreement is the softening of the atmospheric neutrino spectrum, which is strongly suppressed above 100 TeV---the prompt flux simply traces the atmospheric cosmic ray spectrum and cannot accommodate the highest energy events.\n\n\\section{Conclusions}\n\\label{sec:conclu}\nWe have used leading-order perturbative QCD to emphasize the fact that one expects a central as well as a forward component of charm production, a fact clearly underscored by the data for strange particle production. We have computed the charm cross section and the Feynman-$x_F$ distribution of the secondary charm particles including both components with the normalization is treated as a parameter. It cannot be reliably predicted because of large logartihms associated with the small value of $m_c/\\sqrt{s}$ at these energies. The normalization was maximized without exceeding the charm measurements at colliders and the high-energy atmospheric neutrino data in underground experiments. We subsequently calculated the upper limit flux of prompt neutrinos from the decay of charmed particles in IceCube, which is clearly dominated by a potential forward component of the flux. Finally, we applied the effect of self-veto on the prompt neutrino flux and showed the expected event distribution for two years of IceCube. We found that the prompt neutrino flux from a forward charm may represent a significant background to the cosmic neutrino flux but cannot explain the high-energy events observed by IceCube at the highest energies.\n\n\\section{Acknowledgments}\n\nDiscussion with collaborators inside and outside the IceCube Collaboration, too many to be listed, have greatly shaped this presentation. We acknowledge the comments of M. Reno and M. Ahlers on an earlier version of the manuscript. We also thank A. Fedynitch and J. van Santen  for assistance in modifying their programs. This research was supported in part by the U.S. National Science Foundation under Grants No.~ANT-0937462 and PHY-1306958 and by the University of Wisconsin Research Committee with funds granted by the Wisconsin Alumni Research Foundation.\n\n\\section{Appendix}\n\\label{sec:appen}\nHere we show the partonic cross sections used in this paper with their respective threshold center of mass energy. These cross sections correspond to the Feynman diagrams shown in Fig.\\ref{fig:feyn}. The cross sections follow in Eqns. \\ref{eq:qc} through \\ref{eq:gg}, with kinematic variables $t_{min} = 2 {m_c}^2$, $y_0 = (\\hat{s}^2 - m^2)^2/\\hat{s}$, $\\hat{t}_0 = min (\\hat{s} - m^2 - \\hat{t}_{min}, y_0)$, $x_0 = (1 - 4 m_c^2/\\hat{s})^{1/2}$ and $\\sigma_0 = 4 \\pi \\alpha_s^2(\\mu_F)/(3 \\hat{s})$.\n\n\\begin{widetext}\n\n", "index": 7, "text": "\\begin{equation}\n\\hat{\\sigma}(qc \\rightarrow  qc) =  \\frac{\\sigma_0}{3}\\bigg[\\bigg( 1 - \\frac{\\hat{t}_{min}}{y_0}\\bigg) \\bigg( 1 +\\frac{2\\hat{s}}{\\hat{t}_{min}} \\bigg) -\\frac{2 \\hat{s}}{y_0} ln\\bigg(\\frac{y_0}{\\hat{t}_{min}}\\bigg)\\bigg], \\hat{s}_{th}=m_c^2+\\hat{t}_{min}/2+(m_c^2\\hat{t}_{min}+\\hat{t}_{min}^2/4)^{1/2}\n\\label{eq:qc}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\sigma}(qc\\rightarrow qc)=\\frac{\\sigma_{0}}{3}\\bigg{[}\\bigg{(}1-\\frac{%&#10;\\hat{t}_{min}}{y_{0}}\\bigg{)}\\bigg{(}1+\\frac{2\\hat{s}}{\\hat{t}_{min}}\\bigg{)}-%&#10;\\frac{2\\hat{s}}{y_{0}}ln\\bigg{(}\\frac{y_{0}}{\\hat{t}_{min}}\\bigg{)}\\bigg{]},%&#10;\\hat{s}_{th}=m_{c}^{2}+\\hat{t}_{min}/2+(m_{c}^{2}\\hat{t}_{min}+\\hat{t}_{min}^{%&#10;2}/4)^{1/2}\" display=\"block\"><mrow><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mi>c</mi><mo>→</mo><mi>q</mi><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><msub><mi>σ</mi><mn>0</mn></msub><mn>3</mn></mfrac><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mn>1</mn><mo>-</mo><mfrac><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><msub><mi>y</mi><mn>0</mn></msub></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mn>1</mn><mo>+</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mrow><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mo>-</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mrow><msub><mi>y</mi><mn>0</mn></msub></mfrac><mi>l</mi><mi>n</mi><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mfrac><msub><mi>y</mi><mn>0</mn></msub><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow><mo>,</mo><msub><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>t</mi><mo>⁢</mo><mi>h</mi></mrow></msub><mo>=</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mo>+</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>/</mo><mn>2</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>+</mo><msubsup><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow><mn>2</mn></msubsup><mo>/</mo><mn>4</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></math>", "type": "latex"}, {"file": "1601.03044.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 25986, "prevtext": "\n\n\n", "index": 9, "text": "\\begin{equation}\n\\begin{aligned}\n\\hat{\\sigma}(gc \\rightarrow  gc) &=  \\frac{3\\sigma_0}{4y_0}\\bigg[\\bigg[ 1 + \\frac{4\\hat{s}}{9 y_0} \\bigg( 1 +\\frac{m_c^2}{\\hat{s}} \\bigg)^2  - \\frac{2(\\hat{t}_0+\\hat{t}_{min}}{9 ( \\hat{s}-m_c^2)}+\\frac{2\\hat{s}y_0}{\\hat{t}_0\\hat{t}_{min}}+\\frac{16 m_c^4}{9(\\hat{s}-m_c^2-\\hat{t}_0)(\\hat{s}-m_c^2-\\hat{t}_{min})}\\bigg](\\hat{t}_0-\\hat{t}_{min})\\\\\n&+2(\\hat{s}+m_c^2) ln \\frac{\\hat{t}_{min}}{\\hat{t}_0}+\\frac{4 (\\hat{s}^2-6m_c^2\\hat{s}+6m_c^4}{9(\\hat{s}-m_c^2)}ln\\frac{\\hat{s}-m_c^2-\\hat{t}_{min}}{\\hat{s}-m^2-\\hat{t}_0}\\bigg], \\hat{s}_{th}=m_c^2+2\\hat{t}_{min}\n\\label{eq:gc}\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\hat{\\sigma}(gc\\rightarrow gc)\" display=\"inline\"><mrow><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mi>c</mi><mo>→</mo><mi>g</mi><mi>c</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{3\\sigma_{0}}{4y_{0}}\\bigg{[}\\bigg{[}1+\\frac{4\\hat{s}}{9y_{%&#10;0}}\\bigg{(}1+\\frac{m_{c}^{2}}{\\hat{s}}\\bigg{)}^{2}-\\frac{2(\\hat{t}_{0}+\\hat{t}%&#10;_{min}}{9(\\hat{s}-m_{c}^{2})}+\\frac{2\\hat{s}y_{0}}{\\hat{t}_{0}\\hat{t}_{min}}+%&#10;\\frac{16m_{c}^{4}}{9(\\hat{s}-m_{c}^{2}-\\hat{t}_{0})(\\hat{s}-m_{c}^{2}-\\hat{t}_%&#10;{min})}\\bigg{]}(\\hat{t}_{0}-\\hat{t}_{min})\" display=\"inline\"><mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>σ</mi><mn>0</mn></msub></mrow><mrow><mn>4</mn><mo>⁢</mo><msub><mi>y</mi><mn>0</mn></msub></mrow></mfrac></mstyle><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>4</mn><mo>⁢</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mrow><mrow><mn>9</mn><mo>⁢</mo><msub><mi>y</mi><mn>0</mn></msub></mrow></mfrac></mstyle><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>2</mn><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub><mo>+</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mrow><mrow><mn>9</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>2</mn><mo>⁢</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><msub><mi>y</mi><mn>0</mn></msub></mrow><mrow><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac></mstyle><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>16</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>c</mi><mn>4</mn></msubsup></mrow><mrow><mn>9</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mo>-</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mo>-</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub><mo>-</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle+2(\\hat{s}+m_{c}^{2})ln\\frac{\\hat{t}_{min}}{\\hat{t}_{0}}+\\frac{4(%&#10;\\hat{s}^{2}-6m_{c}^{2}\\hat{s}+6m_{c}^{4}}{9(\\hat{s}-m_{c}^{2})}ln\\frac{\\hat{s}%&#10;-m_{c}^{2}-\\hat{t}_{min}}{\\hat{s}-m^{2}-\\hat{t}_{0}}\\bigg{]},\\hat{s}_{th}=m_{c%&#10;}^{2}+2\\hat{t}_{min}\" display=\"inline\"><mrow><mo>+</mo><mn>2</mn><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>+</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mo stretchy=\"false\">)</mo></mrow><mi>l</mi><mi>n</mi><mstyle displaystyle=\"true\"><mfrac><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub></mfrac></mstyle><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>4</mn><mrow><mo stretchy=\"false\">(</mo><msup><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msup><mo>-</mo><mn>6</mn><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>+</mo><mn>6</mn><msubsup><mi>m</mi><mi>c</mi><mn>4</mn></msubsup></mrow></mrow><mrow><mn>9</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mi>l</mi><mi>n</mi><mstyle displaystyle=\"true\"><mfrac><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup><mo>-</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><msup><mi>m</mi><mn>2</mn></msup><mo>-</mo><msub><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub></mrow></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">]</mo><mo>,</mo><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><msub><mi/><mrow><mi>t</mi><mo>⁢</mo><mi>h</mi></mrow></msub><mo>=</mo><mi>m</mi><msub><mi/><mi>c</mi></msub><msup><mi/><mn>2</mn></msup><mo>+</mo><mn>2</mn><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">^</mo></mover><msub><mi/><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></math>", "type": "latex"}, {"file": "1601.03044.tex", "nexttext": "\n\\end{widetext}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\clearpage\n\n\n\\bibliographystyle{apsrev}\n\\bibliography{Spectator}\n\n\n", "itemtype": "equation", "pos": 26621, "prevtext": "\n\n\n", "index": 11, "text": "\\begin{equation}\n\\begin{aligned}\n\\hat{\\sigma}(gg \\rightarrow  c\\bar{c}) =  \\frac{\\sigma_0}{4}\\bigg[\\bigg( 1 + \\frac{4 m_c^2}{\\hat{s}} + \\frac{4 m_c^2}{\\hat{s}^2}\\bigg) ln\\bigg(\\frac{1+x_0}{1-x_0} \\bigg) - \\frac{x_0}{16}\\bigg(7+\\frac{31 m_c^2}{\\hat{s}}\\bigg)\\bigg], \\hat{s}_{th}=4m_c^2\n\\label{eq:gg}\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\hat{\\sigma}(gg\\rightarrow c\\bar{c})=\\frac{\\sigma_{0}}{4}\\bigg{[}%&#10;\\bigg{(}1+\\frac{4m_{c}^{2}}{\\hat{s}}+\\frac{4m_{c}^{2}}{\\hat{s}^{2}}\\bigg{)}ln%&#10;\\bigg{(}\\frac{1+x_{0}}{1-x_{0}}\\bigg{)}-\\frac{x_{0}}{16}\\bigg{(}7+\\frac{31m_{c%&#10;}^{2}}{\\hat{s}}\\bigg{)}\\bigg{]},\\hat{s}_{th}=4m_{c}^{2}\" display=\"inline\"><mrow><mover accent=\"true\"><mi>σ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mi>g</mi><mo>→</mo><mi>c</mi><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>σ</mi><mn>0</mn></msub><mn>4</mn></mfrac></mstyle><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mfrac></mstyle><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow><msup><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mn>2</mn></msup></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mi>l</mi><mi>n</mi><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>+</mo><msub><mi>x</mi><mn>0</mn></msub></mrow><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mn>0</mn></msub></mrow></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>x</mi><mn>0</mn></msub><mn>16</mn></mfrac></mstyle><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mn>7</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>31</mn><mo>⁢</mo><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow><mo>,</mo><msub><mover accent=\"true\"><mi>s</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>t</mi><mo>⁢</mo><mi>h</mi></mrow></msub><mo>=</mo><mn>4</mn><msubsup><mi>m</mi><mi>c</mi><mn>2</mn></msubsup></mrow></math>", "type": "latex"}]