[{"file": "1601.00646.tex", "nexttext": "\n\nwhich has been experimentally realized in a range of systems such as $^6$Li~\\cite{Hart2015} and $^{40}$K~\\cite{Jordens2008}. \nOur goal is to design dissipative processes in such a way that the state with an AF order is the dark state of the dissipative dynamics and the time evolution of the open system will drive it towards such a dark state. \n\nThe dynamics of an open quantum system is governed by the master equation for the system's density matrix\n\n", "itemtype": "equation", "pos": 7494, "prevtext": "\n\n\n\\columnseprule = 0 pt\n\n\\title{Dissipative Preparation of Antiferromagnetic Order in the Fermi-Hubbard Model}\n\n\\author{J. Kaczmarczyk}\n\\email{jan.kaczmarczyk@ist.ac.at}\n\\affiliation{Institute of Science and Technology Austria, Am Campus 1, 3400 Klosterneuburg}\n\n\\author{H. Weimer}\n\\email{hweimer@itp.uni-hannover.de}\n\\affiliation{Institut f\\\"ur Theoretische Physik, Leibniz Universit\\\"at Hannover, Appelstr. 2, 30167 Hannover, Germany}\n\n\\author{M. Lemeshko}\n\\email{mikhail.lemeshko@ist.ac.at}\n\\affiliation{Institute of Science and Technology Austria, Am Campus 1, 3400 Klosterneuburg}\n\n\n\\date{\\today}\n\n\n\n\n\\begin{abstract}\nThe Fermi-Hubbard model is one of the key models of condensed matter physics, which holds a potential for explaining the mystery of high-temperature superconductivity. Recent progress in ultracold atoms in optical lattices has paved the way to studying the model's  phase diagram using the tools of quantum simulation, which   emerged as a promising alternative to the numerical calculations plagued by the infamous sign problem. However, the temperatures achieved using elaborate laser cooling protocols so far  have been too high to show the appearance of antiferromagnetic and superconducting quantum phases directly. In this work, we demonstrate that using the machinery of dissipative quantum state engineering, one can efficiently prepare antiferromagnetic order in present-day experiments with ultracold fermions. The core of the approach is to add incoherent laser scattering in such a way that  the antiferromagnetic state emerges as the dark state of the driven-dissipative dynamics. In order to elucidate the development of the antiferromagnetic order we employ two complementary techniques: Monte Carlo wave function simulations for small systems and a recently proposed variational method for open quantum systems, operating in the thermodynamic limit. The controlled dissipation  channels described in this work are  straightforward to add to already existing experimental setups.\n\\end{abstract}\n\n\\pacs{67.85.-d, 75.10.Jm, 71.10.Fd}\n\n\n\n\n\n\\maketitle{}\n\n\\section{\\label{sec:intro}Introduction}\n\nExperimental progress with ultracold fermions in optical lattices~\\cite{Lewenstein2007,RevModPhys.80.885} leads the way to achieving one of the key goals of quantum simulation~\\cite{RevModPhys.86.153} -- mimicking realistic condensed matter systems. To date, the experiments covered a broad range of systems and interaction regimes, from probing the BEC-BCS crossover in lattices \\cite{Chin2006}, to the observation of a fermionic Mott insulator~\\cite{Schneider2008,Jordens2008}, to studying short range magnetism~\\cite{GreifScience13} and multiflavor spin dynamics \\cite{KrauserNatPhys12}, to realizing topological Haldane model~\\cite{JotzuNature14} and artificial graphene sheets~\\cite{UehlingerPRL13}. These discoveries pave the way to use ultracold atoms to reveal the properties of the repulsive Fermi-Hubbard model~\\cite{Esslinger2010, LeHur2009}. The latter is of particular importance since it represents a playground to get insight into  the physics of high-temperature superconductivity and related phenomena observed in the cuprates~\\cite{Keimer2015}. \n\nIn the case of one particle per site and large on-site interaction, $U$, the Fermi-Hubbard model exhibits the transition to the Mott-insulating state~\\cite{Schneider2008,Jordens2008} around the temperature $T \\sim U$. If the temperature is decreased further and reaches the so-called `N\\'{e}el temperature,' $T_{\\rm N} \\sim 4t^2/U$, where $t$ gives the hopping rate between neighboring sites,  the transition to the antiferromagnetic (AF) phase is expected~\\cite{Hart2015,Esslinger2015}.  Currently the  temperatures achievable in experiment are slightly above the N\\'{e}el temperature where AF correlations can already be observed, for instance, $T/T_{\\rm N} \\approx 1.42$ has been reached in Ref.~\\cite{Hart2015}. \nUltimately, in order to study the superconducting phase or other phenomena related to pairing in high-temperature superconductors, the temperature needs to be substantially lower. Therefore, due to the experimental limitations inherent to the standard laser cooling techniques, it is crucial to develop alternative approaches to preparation of quantum phases in optical lattices.\n\n\nIn this work, we propose an efficient scheme for the preparation of antiferromagnetic order in optical lattices of fermionic atoms, based on the ideas of dissipative state engineering which have recently emerged in the context of many-particle systems \\cite{Diehl2008,PhysRevA.78.042307,PhysRevLett.101.200402, Verstraete2009,Weimer2010,Diehl2010, Diehl2011, Yi2012, PhysRevA.82.054103, PhysRevA.84.031402, PhysRevA.85.023604, Kordas2012, PhysRevLett.110.110502, PhysRevLett.111.033606, PhysRevLett.111.033607, Lemeshko2013, Weimer2013, Otterbach2014, PhysRevA.91.040302, PhysRevA.91.042117} and have been implemented experimentally~\\cite{Barreiro2010, PhysRevLett.95.073003, Barreiro2011, KrauterPRL11, Schindler2013b, Lin2013, Shankar2013}. In  such scenarios, a many-body state of interest is prepared as a  steady state of the quantum master equation governing the open system dynamics,\n  as opposed to the ground state of the Hamiltonian. Such steady state can undergo quantum phase transitions to an ordered state of matter,   which can be classified in close analogy to equilibrium systems~\\cite{PhysRevLett.105.015702, PhysRevA.83.013611, PhysRevA.84.031402, PhysRevLett.110.233601, PhysRevLett.110.163605, PhysRevLett.110.195301, PhysRevLett.110.257204, Weimer2015b, Chan2015}.\n  \n  \n  As opposed to the  previously reported coherent and dissipative strategies towards the preparation of antiferromagnetic ordering\n ~\\cite{Ho2009,Bernier2009,Heidrich-Meisner2009, Diehl2010, Williams2010, Medley2011, PhysRevA.84.031402, Colome-Tatche2011, Lemeshko2012, Yi2012, PhysRevLett.115.215301}, in the technique described here  the   dissipative dynamics takes place on top of the unitary evolution   governed by the Fermi-Hubbard model. In particular, fermions remain mobile in the optical lattice system during the entire dissipative preparation stage. Consequently, no adiabatic switching-on of the fermion hopping terms is required. Furthermore, the dissipation channels of our scheme are implemented using the level structure of fermionic $^{40}$K, currently used in several laboratories~\\cite{KrauserNatPhys12, GreifScience13, Esslinger2015, CheukPRL15, HallerNatPhys15, 2015arXiv151004744E}. Consequently, the presented  scheme  can be readily implemented into already existing experimental setups.\n  \nTheoretical description of open many-body quantum systems represents a challenging task and is currently an active field of research~\\cite{PhysRevLett.115.080604,Weimer2015, Weimer2015b, 2015arXiv151001339O, PhysRevB.90.205125, Prosen2008, Dzhioev2015}. In our analysis of the dissipative Fermi-Hubbard model we use two complementary techniques: the Monte Carlo wave function (MCWF)~\\cite{PhysRevLett.68.580,Molmer:93,PhysRevLett.70.2273} and the variational method~\\cite{Weimer2015,Weimer2015b}, which is generalized here to the description of fermionic systems at half-filling. By using these two methods we demonstrate that a substantial AF magnetization is present in the system both for an exact solution on a  $3 \\times 3$ lattice, as well as in the thermodynamic limit.\n\n\n\\section{\\label{sec:model} The dissipative Fermi-Hubbard model}\n\nWe start with the Fermi-Hubbard Hamiltonian\n\n\n", "index": 1, "text": "\\begin{equation}\n\\hat{H} = \\sum_{i, j, {\\sigma}} t_{ij} \\hat{c}^\\dagger_{i {\\sigma}} \\hat{c}_{j {\\sigma}} + U \\sum_i \\hat{n}_{i{\\uparrow}} \\hat{n}_{i{\\downarrow}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\hat{H}=\\sum_{i,j,{\\sigma}}t_{ij}\\hat{c}^{\\dagger}_{i{\\sigma}}\\hat{c}_{j{%&#10;\\sigma}}+U\\sum_{i}\\hat{n}_{i{\\uparrow}}\\hat{n}_{i{\\downarrow}},\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi><mo>,</mo><mi>σ</mi></mrow></munder><mrow><msub><mi>t</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>σ</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><msub><mover accent=\"true\"><mi>c</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>j</mi><mo>⁢</mo><mi>σ</mi></mrow></msub></mrow></mrow><mo>+</mo><mrow><mi>U</mi><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>i</mi><mo>↑</mo><mi/></mrow></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>i</mi><mo>↓</mo><mi/></mrow></msub></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00646.tex", "nexttext": "\nwhere the primed sum runs over nearest-neighbor sites.\nSince we start with a disordered sample, all possible nearest-neighbor configurations, including $| {\\uparrow}; {\\uparrow} {\\rangle}$, $| {\\downarrow}; {\\downarrow} {\\rangle}$, and $| {\\downarrow}{\\uparrow}; 0 {\\rangle}$ will be present. The jump operators, therefore, need to convert the latter into those with the local antiferromagnetic order, $| {\\uparrow}; {\\downarrow} {\\rangle}$. \n\nWe choose the jump operators to be as follows:\n\\begin{eqnarray}\n\\hat{j}^{(1)}_{ij, {\\uparrow}} &=& \\sqrt{\\gamma_1} | {\\downarrow}{\\uparrow}; 0 {\\rangle\\langle} {\\uparrow}; {\\uparrow} | , \\qquad \\hat{j}^{(2)}_{ij, {\\uparrow}} = \\left( \\hat{j}^{(1)}_{ij, {\\uparrow}} \\right){^\\dagger}, \\\\\n\\hat{j}^{(1)}_{ij, {\\downarrow}} &=& \\sqrt{\\gamma_1} | {\\downarrow}{\\uparrow}; 0 {\\rangle\\langle} {\\downarrow}; {\\downarrow} | , \\qquad \\hat{j}^{(2)}_{ij, {\\downarrow}} = \\left( \\hat{j}^{(1)}_{ij, {\\downarrow}} \\right){^\\dagger}, \\\\\n\\hat{j}^{(3)}_{ij} &=& \\sqrt{\\gamma_2} | {\\downarrow}; {\\uparrow} {\\rangle\\langle} 0; {\\downarrow}{\\uparrow} |.\n\\end{eqnarray}\n\nThe two labels of $\\vert \\dots \\rangle$ and $\\langle \\dots \\vert$ refer to the nearest-neighbor sites $i$ and $j$, while $\\gamma_1$, $\\gamma_2$ are the dissipation rates. \nTheir combined action, schematically shown in Fig.~\\ref{fig1}(a), leads to turning the configurations, $| {\\uparrow}; {\\uparrow} {\\rangle}$, $| {\\downarrow}; {\\downarrow} {\\rangle}$, and $|{\\uparrow}{\\downarrow}; 0{\\rangle}$, into those with the AF order, $| {\\uparrow}; {\\downarrow} {\\rangle}$. \nWe note that the jump operators $\\hat{j}^{(3)}_{ij}$ break the SU(2) symmetry, as the down-spin atom becomes more mobile. This, however, does not constitute a limitation of our scheme. Moreover, it is  possible to reestablish the symmetry by using additional auxiliary states to induce hopping of the $|{\\uparrow}{\\rangle}$-state atom away from the double-occupancy configuration.\n\nAs we discuss in the following section, such  choice of the jump operators is straightforward to realize in experiment using incoherent laser scattering.\n\n\\begin{figure*}[t!]\n\\begin{center}\n\\includegraphics[width=2.0\\columnwidth,angle=0]{fig1.pdf}\n\\end{center}\n\\caption{(a) Action of the jump operators on the nearest-neighbor sites; and (b, c) their implementation using Raman-assisted hopping. The Raman beams are labelled as $\\Omega_{r1},...,\\Omega_{r5}$,  the pumping beam by $\\Omega$, and the decay rate is given by  $\\gamma$; $\\Delta_{{\\uparrow} {\\downarrow}}$ gives the hyperfine splitting between the $| {\\uparrow} \\rangle$ and $| {\\downarrow} \\rangle$ states, $\\Delta_{X{\\downarrow}}$ gives the Zeeman splitting between the $| X \\rangle$ and $| {\\downarrow} \\rangle$ states, while $U$ denotes the on-site interaction between the $| {\\uparrow} \\rangle$ and $| {\\downarrow} \\rangle$ states. \n}\n\\label{fig1}\n\\end{figure*}\n\n\n\\section{Experimental implementation of the jump operators}\n\nSimulating the Fermi-Hubbard model requires mapping the two spin states, $| {\\uparrow} {\\rangle}$ and $| {\\downarrow} {\\rangle}$,  onto the fine or hyperfine components of the ground electronic state manifold of an ultracold atom. The on-site interaction between the spin components, $U$, can be tuned  using a Feshbach resonance~\\cite{RevModPhys.82.1225}. We exemplify the scheme using the atomic level structure of fermionic ${}^{40}$K~\\cite{Tiecke} , with the levels $| {\\uparrow} \\rangle \\equiv |F=\\frac{7}{2}; m_F=-\\frac{7}{2}\\rangle$ and $| {\\downarrow} \\rangle \\equiv |\\frac{9}{2}; -\\frac{7}{2}\\rangle$. Furthermore, in order to realize the dissipative part of the dynamics, we introduce an auxiliary state,  $| X \\rangle \\equiv |\\frac{9}{2}; -\\frac{9}{2}\\rangle$, belonging to the ${}^2 S_{1/2}$ manifold, as well as an electronically excited ${}^2 P_{3/2}$ state, $| e \\rangle \\equiv |\\frac{11}{2}; -\\frac{9}{2}\\rangle$. \n\n\nThe first-stage jump operators, $\\hat{j}^{(1)}_{ij, {\\sigma}}$ and $\\hat{j}^{(2)}_{ij, {\\sigma}}$, can be implemented using Raman-assisted hopping, as illustrated in Fig.~\\ref{fig1}(b). If the Raman beams, $\\Omega_{r1,...,r3}$, are not phase-locked such hopping processes are dissipative. Since the Raman-assisted hopping takes place directly between the initial and final states of the jump operators, the related dissipative processes are bidirectional. Therefore, we need to avoid populating the $|{\\uparrow}; {\\downarrow}{\\rangle}$ state at this stage. Otherwise, the jump operators would also lead from the $|{\\uparrow}; {\\downarrow}{\\rangle}$ state back to the $| {\\uparrow}; {\\uparrow} {\\rangle}$ and $| {\\downarrow}; {\\downarrow} {\\rangle}$ states. The on-site interaction energy $U$ (which we assume to be on the order of a few kHz) can be used for this purpose. We note that this step can be implemented in a coherent way as well, however, the required phase-locking of the lasers would introduce an additional complication into the experimental setup.\n\n\n\nIn order to implement the second-stage jump operators, $\\hat{j}^{(3)}_{ij}$, in a one-directional fashion, we use Raman-assisted hopping from the $|{\\uparrow}{\\downarrow}; 0{\\rangle}$ state to the $|{\\uparrow}; X{\\rangle}$ configuration with an auxiliary $|X{\\rangle}$ state. This $|X{\\rangle}$ state is then pumped to an excited $|e{\\rangle}$ state, which can decay to the $|{\\downarrow}{\\rangle}$ state completing the process, as illustrated in Fig.~\\ref{fig1}(c). The $|e{\\rangle}$ state cannot decay to the $|{\\uparrow}{\\rangle}$ state because of selection rules on the $F$ quantum number.\nThe Zeeman splitting, $\\Delta_{X{\\downarrow}}$, and the energy, $U+\\Delta_{X{\\downarrow}}$, differentiate  among the three states from the lower band in Fig.~\\ref{fig1}(c). In order to resolve between these three states it is sufficient to use selection rules. To resolve between the $|{\\uparrow}; X {\\rangle}$ and $|{\\uparrow} X; 0 {\\rangle}$ states as the final states of the Raman-assisted hopping process we need nonzero on-site interaction between the $|{\\uparrow}{\\rangle}$ and $|X{\\rangle}$ states. The typical values of the background scattering lengths, $a = 105 \\, a_0$, in units of the Bohr radius $a_0$~\\cite{PhysRevA.59.3660, Tiecke}, should be sufficient for this purpose. Spontaneous emission from the $| e {\\rangle}$ state ensures that the resulting dissipative processes are unidirectional and take place from the $|{\\uparrow} {\\downarrow}; 0 {\\rangle}$ to the $|{\\uparrow}; {\\downarrow} {\\rangle}$ state with AF ordering.\n\nDue to the hyperfine splitting between the $F=9/2$ and $F=7/2$ levels, the optical trapping potential for the $| {\\uparrow} \\rangle$ state needs to be implemented separately from the one for the $|{\\downarrow} {\\rangle}$ and $|X {\\rangle}$ states. The hoppings of the $|{\\uparrow}{\\rangle}$ and $|{\\downarrow}{\\rangle}$ states can be made equal by adjusting the strengths of the two lattice potentials. For the ${|{\\downarrow}\\rangle}$ and $|X{\\rangle}$ states using a single trapping potential can lead to a state-dependent lattice~\\cite{PhysRevA.70.033603,Lewenstein2007,RevModPhys.80.885,PhysRevLett.91.010407,Soltan-Panahi2011}. This is however not a limitation, since the hopping of the $|X{\\rangle}$ state is not involved in our scheme and the only requirement is its small magnitude as compared to the rate of decaying to the $|{\\downarrow} {\\rangle}$ state.\n\nThe values of $\\gamma_1$ and $\\gamma_2$ are unrelated to the hopping integral $t$, however, all three of them are proportional to certain integrals involving two Wannier functions on the nearest-neighboring sites. Therefore, we consider $t$, $\\gamma_1$, and $\\gamma_2$ to be on the same order of magnitude.\n\n\n\\section{Time evolution and steady-state properties}\n\nIn order to reveal the properties of the system we use two complementary techniques: the Monte Carlo wave function (MCWF) technique~\\cite{PhysRevLett.68.580,Molmer:93,PhysRevLett.70.2273} \non a $3\\times 3$ lattice\nand the variational method~\\cite{Weimer2015,Weimer2015b} in the thermodynamic limit. While the latter was originally formulated for bosons, here  we extend it to fermionic systems. \nIn both methods we start from the Jordan-Wigner transformation in two spatial dimensions~\\cite{Fradkin1989,JWtrafo}. The related Wigner strings restrict the applicability of our variational scheme to the situation with one particle per site (half-filling). Experimentally, this is the most interesting regime as it corresponds to the maximal N\\'{e}el temperature.\n\n\n\\subsection{Monte Carlo wave function}\n\nWe study the dynamics of the driven-dissipative system governed by Eq.~(\\ref{eq:master}) using the MCWF method implemented in the QuTiP numerical library~\\cite{qutip1,qutip2}. \n\nWe consider only the nearest-neighbor hopping $t_{ij} \\equiv -t$ (we use $t$ as the unit of energy hereafter)  and study the time evolution of the half-filled $3 \\times 3$ lattice as a function of the parameters $\\gamma_1$, $\\gamma_2$, and $U$. Since the lattice dimensions are odd numbers, we use the antiperiodic boundary conditions. For example, when the hopping process takes place across the boundary, we introduce an additional spin-flip ($\\hat{c}^\\dagger_{i {\\sigma}} \\hat{c}_{j \\overline{{\\sigma}}}$). \nThe initial states for the MCWF realizations were chosen with randomly-positioned spin-up or spin-down particles (also allowing for double occupancies), however, the steady-state properties were found to be independent on the initial conditions.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{fig2.pdf}\n\\end{center}\n\\caption{(a) Time-evolution of the total number of spin-up, $N_{\\uparrow}$, and  spin-down, $N_{\\downarrow}$, atoms per site, the double occupancy probability, $D$, and the spin-structure factor $I_{\\rm AF}$ for $U = 100$, $\\gamma_1 = 1$, and $\\gamma_2 = 2$. (b) The von Neumann entropy per particle for selected values of $(U, \\gamma_1, \\gamma_2)$, as labelled in the graph.}\n\\label{fig2}\n\\end{figure}\n\nThe time evolution of the system's properties is shown in Fig.~\\ref{fig2}. One can see that the steady state is reached for $\\tau/t \\approx 50-100$, which corresponds to $1-2$ seconds for $t = 50$ Hz.  Even for a large value of the  on-site interaction, $U = 100$, a small number of  double occupancies  is still present in the system, $D \\approx 0.04$, see Fig.~\\ref{fig2}(a). These states are involved in the dissipation processes as an intermediate step towards preparation of the AF ordered phase, cf.\\ Fig.~\\ref{fig1}(a). Non-zero double occupancies can lead to inelastic losses of atoms~\\citep{Esslinger2010}, which however are more problematic for the attractive~\\cite{PhysRevLett.92.040403}, than for the repulsive~\\cite{Jordens2008} potassium gas. In the latter case  the inelastic decay time for atoms on doubly occupied sites was reported~\\cite{Jordens2008} to exceed $850$ ms.  Consequently, such inelastic losses should not constitute a limitation of our scheme.\n\n\nTo quantify  the AF ordering of the system, we evaluate the spin-structure factor, as defined by\n\n\n", "itemtype": "equation", "pos": 8127, "prevtext": "\n\nwhich has been experimentally realized in a range of systems such as $^6$Li~\\cite{Hart2015} and $^{40}$K~\\cite{Jordens2008}. \nOur goal is to design dissipative processes in such a way that the state with an AF order is the dark state of the dissipative dynamics and the time evolution of the open system will drive it towards such a dark state. \n\nThe dynamics of an open quantum system is governed by the master equation for the system's density matrix\n\n", "index": 3, "text": "\\begin{equation}\n\\dot{\\rho} = -i \\left[\\hat{H}, \\rho\\right] + \n\\sum_{i,j, {\\sigma}, \\alpha}{}^{'}\n\\left( \\hat{j}^{(\\alpha)}_{ij, {\\sigma}} \\,\\; \\rho \\,\\; \\hat{j}^{(\\alpha){^\\dagger}}_{ij, {\\sigma}} - \\frac{1}{2} \\left\\{ \\hat{j}^{(\\alpha) {^\\dagger}}_{ij, {\\sigma}} \\,\\; \\hat{j}^{(\\alpha)}_{ij, {\\sigma}}, \\rho \\right\\} \\right),\n\\label{eq:master}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho}=-i\\left[\\hat{H},\\rho\\right]+\\sum_{i,j,{\\sigma},\\alpha}{}^{{}^{%&#10;\\prime}}\\left(\\hat{j}^{(\\alpha)}_{ij,{\\sigma}}\\,\\;\\rho\\,\\;\\hat{j}^{(\\alpha){{}%&#10;^{\\dagger}}}_{ij,{\\sigma}}-\\frac{1}{2}\\left\\{\\hat{j}^{(\\alpha){{}^{\\dagger}}}_%&#10;{ij,{\\sigma}}\\,\\;\\hat{j}^{(\\alpha)}_{ij,{\\sigma}},\\rho\\right\\}\\right),\" display=\"block\"><mrow><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mo>=</mo><mo>-</mo><mi>i</mi><mrow><mo>[</mo><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mo>,</mo><mi>ρ</mi><mo>]</mo></mrow><mo>+</mo><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi><mo>,</mo><mi>σ</mi><mo>,</mo><mi>α</mi></mrow></munder><mmultiscripts><mrow><mo>(</mo><mpadded width=\"+4.5pt\"><msubsup><mover accent=\"true\"><mi>j</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo>,</mo><mi>σ</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mpadded><mpadded width=\"+4.5pt\"><mi>ρ</mi></mpadded><msubsup><mover accent=\"true\"><mi>j</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo>,</mo><mi>σ</mi></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow><msup><mi/><mo>†</mo></msup></mrow></msubsup><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><mrow><mo>{</mo><mpadded width=\"+4.5pt\"><msubsup><mover accent=\"true\"><mi>j</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo>,</mo><mi>σ</mi></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow><msup><mi/><mo>†</mo></msup></mrow></msubsup></mpadded><msubsup><mover accent=\"true\"><mi>j</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo>,</mo><mi>σ</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>,</mo><mi>ρ</mi><mo>}</mo></mrow><mo>)</mo></mrow><mprescripts/><none/><msup><mi/><mo>′</mo></msup></mmultiscripts><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00646.tex", "nexttext": "\nIn the case of the AF ordering, the relevant spin-structure factor is given by $I_{\\rm AF} \\equiv I({\\mathbf{Q}} = [\\pi, \\pi])$.  For the steady-state it can be as large as $I_{\\rm AF} \\approx 0.8$ (cf. also Fig.~\\ref{fig3}), quite close to the fully polarized N\\'eel state.\n\nFigure~\\ref{fig2}(b) illustrates the decrease of the system's entropy per particle, $S \\equiv S_\\text{tot} / N = - 1/N \\, {\\rm Tr} \\rho \\log \\rho$, with time. The resulting steady-state entropy per particle can be as low as $S \\approx 0.1-0.3$ (cf. also Fig.~\\ref{fig3}). Due to the large size of the density matrix $\\rho$, in our numerical calculations we use the equivalent formula, $S_\\text{tot}\n= - {\\rm Tr} A \\log A$. Here $A_{ij} = {\\langle} \\psi_i | \\psi_j {\\rangle}$ is the matrix of overlaps of wave functions obtained from single realizations of the Monte Carlo algorithm.\nThe relaxation time (usually below one second)\n\nincreases with the increasing on-site interaction, $U$.\n\nFor larger systems the relaxation times can be longer, due to possible formation of domains, as it is the case for coherent preparation strategies.\n\n A slightly different number of spin-up, $N_\\uparrow$, and spin-down, $N_\\downarrow$,  atoms in the steady state is related to breaking of the $SU(2)$ symmetry by the jump operators $\\hat{j}^{(3)}_{ij}$. As a result, the spin-down atom becomes more `mobile'. Additionally, in the $3 \\times 3$ lattice the number of sites is odd. Therefore, inherently in the steady state there is a spin-direction imbalance with $N_{\\uparrow} > N_{\\downarrow}$. For a larger system, as well as for a system with even number of sites we would have $N_{\\uparrow} \\approx N_{\\downarrow}$. This, however, does not preclude the formation of the AF order.\n\n\nFig.~\\ref{fig3} shows the steady-state properties: the entropy per particle and spin-structure factor as a function of the parameters. In the employed range of parameters these features turn out to be strongly dependent on $\\gamma_2$ and $U$, cf. Figs.~\\ref{fig3}(b) and~\\ref{fig3}(c), however, only weakly dependent on $\\gamma_1$, cf. Fig.~\\ref{fig3}(a). Furthermore, while $I_{\\rm AF}$ grows substantially with increasing $U$ and $\\gamma_2$,  for $\\gamma_1$ a saturation effect is observed and increasing the magnitude above $\\gamma_1 \\approx 0.5$ does not improve the efficiency of the scheme significantly. These observations can be qualitatively understood from Fig.~\\ref{fig1}(a). Namely, when the system is close to the AF phase most of the nearest-neighbor configurations are of the $|{\\uparrow}; {\\downarrow} {\\rangle}$ type. The processes that drive the system away from the ordered state are related to coherent hopping from the $|{\\uparrow}; {\\downarrow} {\\rangle}$ state to the  $|{\\uparrow} {\\downarrow}; 0 {\\rangle}$ state. In the  large-$U$ limit, the timescale of such processes is given by $4 t^2/U$. Therefore, increasing $U$ reduces the contribution of the processes that destroy AF ordering. Increase of $I_{\\rm AF}$ with $\\gamma_2$ is expected, as the related dissipative processes drive the system directly into the AF ordered state. The saturation effect for $\\gamma_1$ can be due to the bidirectional character of the related dissipative processes. For sufficiently large $\\gamma_1$, the value of the spin-structure factor is determined by an interplay between the dissipative processes related to $\\gamma_2$ and coherent hopping processes with a time scale governed by $4 t^2 / U$.\n\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{L_fig3.pdf} \n\\caption{ Steady-state properties: spin-structure factor, $I_{\\rm AF}$, and entropy per particle, $S$, as a function of magnitudes of jump operators, $\\gamma_1$ and $\\gamma_2$, and the on-site repulsion energy, $U$. The error bars of $I_{\\rm AF}$ are calculated as the standard error for the results of single Monte-Carlo realizations, whereas those of $S$ are obtained using the standard deviation of the Monte-Carlo results averaged over time.}\n\\label{fig3}\n\\end{figure}\n\nWhile the values of $U$ required for an efficient preparation of the\nAF order are quite large, they are within experimental reach, e.g.\\\n$U/t = 180$ was reported in Ref.~\\cite{Jordens2008}. Increasing $U$ even further might lead to appearance of non-standard terms on top of the Fermi-Hubbard\nmodel~\\cite{Dutta2015}.\n\n\n\\subsection{Variational scheme}\n\nIn order to describe the  steady-state properties  in the thermodynamic limit, we use the variational scheme proposed recently~\\cite{Weimer2015,Weimer2015b}.  In this method, we minimize the upper bound of the variational norm of the master equation~(\\ref{eq:master}),\n\n\n", "itemtype": "equation", "pos": 19494, "prevtext": "\nwhere the primed sum runs over nearest-neighbor sites.\nSince we start with a disordered sample, all possible nearest-neighbor configurations, including $| {\\uparrow}; {\\uparrow} {\\rangle}$, $| {\\downarrow}; {\\downarrow} {\\rangle}$, and $| {\\downarrow}{\\uparrow}; 0 {\\rangle}$ will be present. The jump operators, therefore, need to convert the latter into those with the local antiferromagnetic order, $| {\\uparrow}; {\\downarrow} {\\rangle}$. \n\nWe choose the jump operators to be as follows:\n\\begin{eqnarray}\n\\hat{j}^{(1)}_{ij, {\\uparrow}} &=& \\sqrt{\\gamma_1} | {\\downarrow}{\\uparrow}; 0 {\\rangle\\langle} {\\uparrow}; {\\uparrow} | , \\qquad \\hat{j}^{(2)}_{ij, {\\uparrow}} = \\left( \\hat{j}^{(1)}_{ij, {\\uparrow}} \\right){^\\dagger}, \\\\\n\\hat{j}^{(1)}_{ij, {\\downarrow}} &=& \\sqrt{\\gamma_1} | {\\downarrow}{\\uparrow}; 0 {\\rangle\\langle} {\\downarrow}; {\\downarrow} | , \\qquad \\hat{j}^{(2)}_{ij, {\\downarrow}} = \\left( \\hat{j}^{(1)}_{ij, {\\downarrow}} \\right){^\\dagger}, \\\\\n\\hat{j}^{(3)}_{ij} &=& \\sqrt{\\gamma_2} | {\\downarrow}; {\\uparrow} {\\rangle\\langle} 0; {\\downarrow}{\\uparrow} |.\n\\end{eqnarray}\n\nThe two labels of $\\vert \\dots \\rangle$ and $\\langle \\dots \\vert$ refer to the nearest-neighbor sites $i$ and $j$, while $\\gamma_1$, $\\gamma_2$ are the dissipation rates. \nTheir combined action, schematically shown in Fig.~\\ref{fig1}(a), leads to turning the configurations, $| {\\uparrow}; {\\uparrow} {\\rangle}$, $| {\\downarrow}; {\\downarrow} {\\rangle}$, and $|{\\uparrow}{\\downarrow}; 0{\\rangle}$, into those with the AF order, $| {\\uparrow}; {\\downarrow} {\\rangle}$. \nWe note that the jump operators $\\hat{j}^{(3)}_{ij}$ break the SU(2) symmetry, as the down-spin atom becomes more mobile. This, however, does not constitute a limitation of our scheme. Moreover, it is  possible to reestablish the symmetry by using additional auxiliary states to induce hopping of the $|{\\uparrow}{\\rangle}$-state atom away from the double-occupancy configuration.\n\nAs we discuss in the following section, such  choice of the jump operators is straightforward to realize in experiment using incoherent laser scattering.\n\n\\begin{figure*}[t!]\n\\begin{center}\n\\includegraphics[width=2.0\\columnwidth,angle=0]{fig1.pdf}\n\\end{center}\n\\caption{(a) Action of the jump operators on the nearest-neighbor sites; and (b, c) their implementation using Raman-assisted hopping. The Raman beams are labelled as $\\Omega_{r1},...,\\Omega_{r5}$,  the pumping beam by $\\Omega$, and the decay rate is given by  $\\gamma$; $\\Delta_{{\\uparrow} {\\downarrow}}$ gives the hyperfine splitting between the $| {\\uparrow} \\rangle$ and $| {\\downarrow} \\rangle$ states, $\\Delta_{X{\\downarrow}}$ gives the Zeeman splitting between the $| X \\rangle$ and $| {\\downarrow} \\rangle$ states, while $U$ denotes the on-site interaction between the $| {\\uparrow} \\rangle$ and $| {\\downarrow} \\rangle$ states. \n}\n\\label{fig1}\n\\end{figure*}\n\n\n\\section{Experimental implementation of the jump operators}\n\nSimulating the Fermi-Hubbard model requires mapping the two spin states, $| {\\uparrow} {\\rangle}$ and $| {\\downarrow} {\\rangle}$,  onto the fine or hyperfine components of the ground electronic state manifold of an ultracold atom. The on-site interaction between the spin components, $U$, can be tuned  using a Feshbach resonance~\\cite{RevModPhys.82.1225}. We exemplify the scheme using the atomic level structure of fermionic ${}^{40}$K~\\cite{Tiecke} , with the levels $| {\\uparrow} \\rangle \\equiv |F=\\frac{7}{2}; m_F=-\\frac{7}{2}\\rangle$ and $| {\\downarrow} \\rangle \\equiv |\\frac{9}{2}; -\\frac{7}{2}\\rangle$. Furthermore, in order to realize the dissipative part of the dynamics, we introduce an auxiliary state,  $| X \\rangle \\equiv |\\frac{9}{2}; -\\frac{9}{2}\\rangle$, belonging to the ${}^2 S_{1/2}$ manifold, as well as an electronically excited ${}^2 P_{3/2}$ state, $| e \\rangle \\equiv |\\frac{11}{2}; -\\frac{9}{2}\\rangle$. \n\n\nThe first-stage jump operators, $\\hat{j}^{(1)}_{ij, {\\sigma}}$ and $\\hat{j}^{(2)}_{ij, {\\sigma}}$, can be implemented using Raman-assisted hopping, as illustrated in Fig.~\\ref{fig1}(b). If the Raman beams, $\\Omega_{r1,...,r3}$, are not phase-locked such hopping processes are dissipative. Since the Raman-assisted hopping takes place directly between the initial and final states of the jump operators, the related dissipative processes are bidirectional. Therefore, we need to avoid populating the $|{\\uparrow}; {\\downarrow}{\\rangle}$ state at this stage. Otherwise, the jump operators would also lead from the $|{\\uparrow}; {\\downarrow}{\\rangle}$ state back to the $| {\\uparrow}; {\\uparrow} {\\rangle}$ and $| {\\downarrow}; {\\downarrow} {\\rangle}$ states. The on-site interaction energy $U$ (which we assume to be on the order of a few kHz) can be used for this purpose. We note that this step can be implemented in a coherent way as well, however, the required phase-locking of the lasers would introduce an additional complication into the experimental setup.\n\n\n\nIn order to implement the second-stage jump operators, $\\hat{j}^{(3)}_{ij}$, in a one-directional fashion, we use Raman-assisted hopping from the $|{\\uparrow}{\\downarrow}; 0{\\rangle}$ state to the $|{\\uparrow}; X{\\rangle}$ configuration with an auxiliary $|X{\\rangle}$ state. This $|X{\\rangle}$ state is then pumped to an excited $|e{\\rangle}$ state, which can decay to the $|{\\downarrow}{\\rangle}$ state completing the process, as illustrated in Fig.~\\ref{fig1}(c). The $|e{\\rangle}$ state cannot decay to the $|{\\uparrow}{\\rangle}$ state because of selection rules on the $F$ quantum number.\nThe Zeeman splitting, $\\Delta_{X{\\downarrow}}$, and the energy, $U+\\Delta_{X{\\downarrow}}$, differentiate  among the three states from the lower band in Fig.~\\ref{fig1}(c). In order to resolve between these three states it is sufficient to use selection rules. To resolve between the $|{\\uparrow}; X {\\rangle}$ and $|{\\uparrow} X; 0 {\\rangle}$ states as the final states of the Raman-assisted hopping process we need nonzero on-site interaction between the $|{\\uparrow}{\\rangle}$ and $|X{\\rangle}$ states. The typical values of the background scattering lengths, $a = 105 \\, a_0$, in units of the Bohr radius $a_0$~\\cite{PhysRevA.59.3660, Tiecke}, should be sufficient for this purpose. Spontaneous emission from the $| e {\\rangle}$ state ensures that the resulting dissipative processes are unidirectional and take place from the $|{\\uparrow} {\\downarrow}; 0 {\\rangle}$ to the $|{\\uparrow}; {\\downarrow} {\\rangle}$ state with AF ordering.\n\nDue to the hyperfine splitting between the $F=9/2$ and $F=7/2$ levels, the optical trapping potential for the $| {\\uparrow} \\rangle$ state needs to be implemented separately from the one for the $|{\\downarrow} {\\rangle}$ and $|X {\\rangle}$ states. The hoppings of the $|{\\uparrow}{\\rangle}$ and $|{\\downarrow}{\\rangle}$ states can be made equal by adjusting the strengths of the two lattice potentials. For the ${|{\\downarrow}\\rangle}$ and $|X{\\rangle}$ states using a single trapping potential can lead to a state-dependent lattice~\\cite{PhysRevA.70.033603,Lewenstein2007,RevModPhys.80.885,PhysRevLett.91.010407,Soltan-Panahi2011}. This is however not a limitation, since the hopping of the $|X{\\rangle}$ state is not involved in our scheme and the only requirement is its small magnitude as compared to the rate of decaying to the $|{\\downarrow} {\\rangle}$ state.\n\nThe values of $\\gamma_1$ and $\\gamma_2$ are unrelated to the hopping integral $t$, however, all three of them are proportional to certain integrals involving two Wannier functions on the nearest-neighboring sites. Therefore, we consider $t$, $\\gamma_1$, and $\\gamma_2$ to be on the same order of magnitude.\n\n\n\\section{Time evolution and steady-state properties}\n\nIn order to reveal the properties of the system we use two complementary techniques: the Monte Carlo wave function (MCWF) technique~\\cite{PhysRevLett.68.580,Molmer:93,PhysRevLett.70.2273} \non a $3\\times 3$ lattice\nand the variational method~\\cite{Weimer2015,Weimer2015b} in the thermodynamic limit. While the latter was originally formulated for bosons, here  we extend it to fermionic systems. \nIn both methods we start from the Jordan-Wigner transformation in two spatial dimensions~\\cite{Fradkin1989,JWtrafo}. The related Wigner strings restrict the applicability of our variational scheme to the situation with one particle per site (half-filling). Experimentally, this is the most interesting regime as it corresponds to the maximal N\\'{e}el temperature.\n\n\n\\subsection{Monte Carlo wave function}\n\nWe study the dynamics of the driven-dissipative system governed by Eq.~(\\ref{eq:master}) using the MCWF method implemented in the QuTiP numerical library~\\cite{qutip1,qutip2}. \n\nWe consider only the nearest-neighbor hopping $t_{ij} \\equiv -t$ (we use $t$ as the unit of energy hereafter)  and study the time evolution of the half-filled $3 \\times 3$ lattice as a function of the parameters $\\gamma_1$, $\\gamma_2$, and $U$. Since the lattice dimensions are odd numbers, we use the antiperiodic boundary conditions. For example, when the hopping process takes place across the boundary, we introduce an additional spin-flip ($\\hat{c}^\\dagger_{i {\\sigma}} \\hat{c}_{j \\overline{{\\sigma}}}$). \nThe initial states for the MCWF realizations were chosen with randomly-positioned spin-up or spin-down particles (also allowing for double occupancies), however, the steady-state properties were found to be independent on the initial conditions.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{fig2.pdf}\n\\end{center}\n\\caption{(a) Time-evolution of the total number of spin-up, $N_{\\uparrow}$, and  spin-down, $N_{\\downarrow}$, atoms per site, the double occupancy probability, $D$, and the spin-structure factor $I_{\\rm AF}$ for $U = 100$, $\\gamma_1 = 1$, and $\\gamma_2 = 2$. (b) The von Neumann entropy per particle for selected values of $(U, \\gamma_1, \\gamma_2)$, as labelled in the graph.}\n\\label{fig2}\n\\end{figure}\n\nThe time evolution of the system's properties is shown in Fig.~\\ref{fig2}. One can see that the steady state is reached for $\\tau/t \\approx 50-100$, which corresponds to $1-2$ seconds for $t = 50$ Hz.  Even for a large value of the  on-site interaction, $U = 100$, a small number of  double occupancies  is still present in the system, $D \\approx 0.04$, see Fig.~\\ref{fig2}(a). These states are involved in the dissipation processes as an intermediate step towards preparation of the AF ordered phase, cf.\\ Fig.~\\ref{fig1}(a). Non-zero double occupancies can lead to inelastic losses of atoms~\\citep{Esslinger2010}, which however are more problematic for the attractive~\\cite{PhysRevLett.92.040403}, than for the repulsive~\\cite{Jordens2008} potassium gas. In the latter case  the inelastic decay time for atoms on doubly occupied sites was reported~\\cite{Jordens2008} to exceed $850$ ms.  Consequently, such inelastic losses should not constitute a limitation of our scheme.\n\n\nTo quantify  the AF ordering of the system, we evaluate the spin-structure factor, as defined by\n\n\n", "index": 5, "text": "\\begin{equation}\nI({\\mathbf{Q}}) \\equiv \\frac{4}{N^2} \\sum_{\\mathbf{i}, \\mathbf{j}} e^{i(\\mathbf{R_i} - \\mathbf{R_j}){\\mathbf{Q}}} {\\langle} {\\sigma}^{z}_{\\mathbf{i}} {\\sigma}^{z}_{\\mathbf{j}} \\rangle.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"I({\\mathbf{Q}})\\equiv\\frac{4}{N^{2}}\\sum_{\\mathbf{i},\\mathbf{j}}e^{i(\\mathbf{R%&#10;_{i}}-\\mathbf{R_{j}}){\\mathbf{Q}}}{\\langle}{\\sigma}^{z}_{\\mathbf{i}}{\\sigma}^{%&#10;z}_{\\mathbf{j}}\\rangle.\" display=\"block\"><mrow><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐐</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mfrac><mn>4</mn><msup><mi>N</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐢</mi><mo>,</mo><mi>𝐣</mi></mrow></munder><mrow><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐑</mi><mi>𝐢</mi></msub><mo>-</mo><msub><mi>𝐑</mi><mi>𝐣</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>𝐐</mi></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msubsup><mi>σ</mi><mi>𝐢</mi><mi>z</mi></msubsup><mo>⁢</mo><msubsup><mi>σ</mi><mi>𝐣</mi><mi>z</mi></msubsup></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00646.tex", "nexttext": "\n\nHere $\\mathcal{D}$ is the dissipative part as given by Eq.~(\\ref{eq:master}) and \nthe reduced two-site operators are defined as $\\dot{\\rho}_{ij} = {\\rm Tr}_{\\not{i}\\not{j}}{\\,\\dot{\\rho}}$. \nWe perform the Jordan-Wigner transformation to a system of bosons and consider variational states of the product-state type, $\\rho = \\rho_p = \\prod_i \\rho_{i}$.\nIt is sufficient to minimize the norm $||\\dot{\\rho}_{ij}||$ of a single bond, which for the case of an AF order can be expressed as\n\n\\begin{eqnarray}\n||\\dot{\\rho}_{ij}|| & \\equiv & ||\\dot{\\rho}_{AB}|| = {\\rm Tr}|\\dot{\\rho}_{AB}|, \\\\\n\\dot{\\rho}_{AB} &=& -i [H_{AB}, \\rho_{AB}] + \\mathcal{D}_{AB}(\\rho_{AB}) + \\label{eq:norm} \\\\ \n&& \\sum_{A'} {\\rm Tr}_{A'}\\left\\{ -i [H_{BA'}, \\rho_{ABA'}] + \\mathcal{D}_{BA'}(\\rho_{ABA'}) \\right\\}  + \\nonumber \\\\ \n&& \\sum_{B'} {\\rm Tr}_{B'}\\left\\{ -i [H_{B'A}, \\rho_{B'AB}] + \\mathcal{D}_{B'A}(\\rho_{B'AB}) \\right\\}.  \\nonumber\n\\end{eqnarray}\n\nHere A and B label the two sublattices and, e.g., $\\rho_{ABA'} \\equiv \\rho_A \\otimes \\rho_B \\otimes \\rho_{A'}$, while $\\mathcal{D}_{AB}$ gives the dissipative part with the jump operators acting on the sites A and B. The first two terms of Eq. (\\ref{eq:norm}) correspond to an exact treatment of a single bond,  which already goes beyond the mean-field description, whereas the next ones describe interaction with the surrounding sites treated on the mean-field level, as visualized by the dashed lines in Fig.~\\ref{fig4}(a).\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\columnwidth]{L_fig4.pdf}\n\\end{center}\n\\caption{(a) Single link and the surrounding sites in the presence of  AF order. (b) The steady-state magnitude of the AF spin-structure factor, as a function of the magnitude of the jump operators. The variational results (red solid line) are compared to the MCWF method (green dashed line).}\n\\label{fig4}\n\\end{figure}\n\nIn Fig.~\\ref{fig4}(b) we compare the spin-structure factor obtained from our variational scheme and the MCWF method as a function of magnitude of the jump operators (which we set equal here without the loss of generality). \nAccording to the results of both methods, the system exhibits substantial ordering (e.g. with spin-structure factor larger than $0.5$) when $\\gamma_1 = \\gamma_2 \\gtrsim 1$. Although the variational method contains terms going beyond mean field, its results do not depend on the value of $U$, as opposed to the exact approach. This happens due to restriction of the density matrices to the form of product states. Moreover, the variational method overestimates the AF ordering due to the absence of fluctuations in our variational manifold. Therefore, the employed approaches are complementary to each other, and both indicate the formation of an AF order of substantial magnitude in the steady state.\n\n\n\\section{Conclusions}\n\nIn this paper, we proposed a scheme for dissipative preparation of antiferromagnetic order in ultracold fermions trapped in an optical lattice. We demonstrated that by using a combination of  two dissipative processes based on Raman-assisted hopping it is possible to engineer the dissipative dynamics in such a way that the AF phase emerges as  its dark state. By using a combination of an exact and variational approaches, we observed the formation of a strong AF order on the timescales achievable in present-day experiments.\n\nWe note that the technique presented here can be readily implemented in the setups already used to search for the AF order~\\cite{Esslinger2015}, and thereby paves the way to an experimental realization of the AF phase in the Fermi-Hubbard model. While we exemplified the approach using the atomic level structure of $^{40}$K~\\cite{Jordens2008},  the method is general and can  be also applied to other fermionic atoms currently available in laboratory, such as $^6$Li~\\cite{Hart2015}, Er~\\cite{AikawaPRL14}, Dy~\\cite{LuPRL12}, Yb~\\cite{PhysRevLett.105.190401}, and Cr~\\cite{PhysRevA.91.011603}. After preparation of the AF phase with low entropy it should be possible to explore the phase diagram of the Hubbard model, including the pseudogap regime, by coherently removing a fraction of the atoms from the trap thereby introducing hole carriers into the system.\nFinally, extending these ideas to single-site addressable lattices as offered by the fermionic quantum gas microscopes \\cite{CheukPRL15, HallerNatPhys15, ParsonsPRL15, 2015arXiv151004744E}, opens the door to preparation of more sophisticated many-particles states.\n\n\\section*{Acknowledgements}\n\nWe acknowledge stimulating discussions with Ken Brown, Tommaso Calarco, Andrew Daley, Suzanne McEndoo, Tobias Osborne, Cindy Regal, Luis Santos, Micha\\l{} Tomza, and Martin Zwierlein.\nThe work was supported by the People Programme (Marie Curie Actions) of the European Union's Seventh Framework Programme (FP7/2007-2013) under REA grant agreement n$^{\\rm o}$ [291734] and by the Volkswagen Foundation.\n\n\\bibliographystyle{aip.bst}\n\\bibliography{diss.bib}\n\n\n", "itemtype": "equation", "pos": 24330, "prevtext": "\nIn the case of the AF ordering, the relevant spin-structure factor is given by $I_{\\rm AF} \\equiv I({\\mathbf{Q}} = [\\pi, \\pi])$.  For the steady-state it can be as large as $I_{\\rm AF} \\approx 0.8$ (cf. also Fig.~\\ref{fig3}), quite close to the fully polarized N\\'eel state.\n\nFigure~\\ref{fig2}(b) illustrates the decrease of the system's entropy per particle, $S \\equiv S_\\text{tot} / N = - 1/N \\, {\\rm Tr} \\rho \\log \\rho$, with time. The resulting steady-state entropy per particle can be as low as $S \\approx 0.1-0.3$ (cf. also Fig.~\\ref{fig3}). Due to the large size of the density matrix $\\rho$, in our numerical calculations we use the equivalent formula, $S_\\text{tot}\n= - {\\rm Tr} A \\log A$. Here $A_{ij} = {\\langle} \\psi_i | \\psi_j {\\rangle}$ is the matrix of overlaps of wave functions obtained from single realizations of the Monte Carlo algorithm.\nThe relaxation time (usually below one second)\n\nincreases with the increasing on-site interaction, $U$.\n\nFor larger systems the relaxation times can be longer, due to possible formation of domains, as it is the case for coherent preparation strategies.\n\n A slightly different number of spin-up, $N_\\uparrow$, and spin-down, $N_\\downarrow$,  atoms in the steady state is related to breaking of the $SU(2)$ symmetry by the jump operators $\\hat{j}^{(3)}_{ij}$. As a result, the spin-down atom becomes more `mobile'. Additionally, in the $3 \\times 3$ lattice the number of sites is odd. Therefore, inherently in the steady state there is a spin-direction imbalance with $N_{\\uparrow} > N_{\\downarrow}$. For a larger system, as well as for a system with even number of sites we would have $N_{\\uparrow} \\approx N_{\\downarrow}$. This, however, does not preclude the formation of the AF order.\n\n\nFig.~\\ref{fig3} shows the steady-state properties: the entropy per particle and spin-structure factor as a function of the parameters. In the employed range of parameters these features turn out to be strongly dependent on $\\gamma_2$ and $U$, cf. Figs.~\\ref{fig3}(b) and~\\ref{fig3}(c), however, only weakly dependent on $\\gamma_1$, cf. Fig.~\\ref{fig3}(a). Furthermore, while $I_{\\rm AF}$ grows substantially with increasing $U$ and $\\gamma_2$,  for $\\gamma_1$ a saturation effect is observed and increasing the magnitude above $\\gamma_1 \\approx 0.5$ does not improve the efficiency of the scheme significantly. These observations can be qualitatively understood from Fig.~\\ref{fig1}(a). Namely, when the system is close to the AF phase most of the nearest-neighbor configurations are of the $|{\\uparrow}; {\\downarrow} {\\rangle}$ type. The processes that drive the system away from the ordered state are related to coherent hopping from the $|{\\uparrow}; {\\downarrow} {\\rangle}$ state to the  $|{\\uparrow} {\\downarrow}; 0 {\\rangle}$ state. In the  large-$U$ limit, the timescale of such processes is given by $4 t^2/U$. Therefore, increasing $U$ reduces the contribution of the processes that destroy AF ordering. Increase of $I_{\\rm AF}$ with $\\gamma_2$ is expected, as the related dissipative processes drive the system directly into the AF ordered state. The saturation effect for $\\gamma_1$ can be due to the bidirectional character of the related dissipative processes. For sufficiently large $\\gamma_1$, the value of the spin-structure factor is determined by an interplay between the dissipative processes related to $\\gamma_2$ and coherent hopping processes with a time scale governed by $4 t^2 / U$.\n\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{L_fig3.pdf} \n\\caption{ Steady-state properties: spin-structure factor, $I_{\\rm AF}$, and entropy per particle, $S$, as a function of magnitudes of jump operators, $\\gamma_1$ and $\\gamma_2$, and the on-site repulsion energy, $U$. The error bars of $I_{\\rm AF}$ are calculated as the standard error for the results of single Monte-Carlo realizations, whereas those of $S$ are obtained using the standard deviation of the Monte-Carlo results averaged over time.}\n\\label{fig3}\n\\end{figure}\n\nWhile the values of $U$ required for an efficient preparation of the\nAF order are quite large, they are within experimental reach, e.g.\\\n$U/t = 180$ was reported in Ref.~\\cite{Jordens2008}. Increasing $U$ even further might lead to appearance of non-standard terms on top of the Fermi-Hubbard\nmodel~\\cite{Dutta2015}.\n\n\n\\subsection{Variational scheme}\n\nIn order to describe the  steady-state properties  in the thermodynamic limit, we use the variational scheme proposed recently~\\cite{Weimer2015,Weimer2015b}.  In this method, we minimize the upper bound of the variational norm of the master equation~(\\ref{eq:master}),\n\n\n", "index": 7, "text": "\\begin{equation}\n||\\dot{\\rho}|| = ||-i[H,\\rho] + \\mathcal{D}(\\rho)|| \\leq \n   \\sum_{\\langle ij\\rangle} {\\rm Tr}|\\dot{\\rho}_{ij}| \\to \\min. \\label{eq:min}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"||\\dot{\\rho}||=||-i[H,\\rho]+\\mathcal{D}(\\rho)||\\leq\\sum_{\\langle ij\\rangle}{%&#10;\\rm Tr}|\\dot{\\rho}_{ij}|\\to\\min.\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\">||</mo><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mo fence=\"true\">||</mo></mrow><mo>=</mo><mrow><mo fence=\"true\">||</mo><mrow><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>H</mi><mo>,</mo><mi>ρ</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>+</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒟</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ρ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\">||</mo></mrow><mo>≤</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow></munder><mrow><mi>Tr</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><msub><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>→</mo><mi>min</mi></mrow><mo>.</mo></mrow></math>", "type": "latex"}]