[{"file": "1601.00070.tex", "nexttext": "\n\n\n(assuming scanning in $\\alpha\\cos\\,\\delta_{0}$), where $R$ is the scanning rate of the telescope in degrees\\,s$^{-1}$, $\\theta_{int}$ is defined as $\\theta_{FWHM}/n$ ($n$ is the number of times to sample the beam, generally $\\geq 3$) and ${t_{int}}$ is the number of seconds per integration;\n\t\\item  as the telescope continues to slew across the source, the antenna log samples the telescope's position in $a$ and $e$ every 15 seconds.\n\t\\item the telescope will be sent the command to stop when the timer matches the on source time in the schedule file;\n\t\\item once the telescope has stopped, the next line in the schedule file is read.\n\n\\end{enumerate}\n\n\n\n\\subsection{Spectrometer}\n\\label{sec:spec}\nThe Tid-70m is equipped with a Parkes Multibeam correlator block \\footnote{\\url{www.atnf.csiro.au/observers/tidbinbilla}}.\nOTF observations can use the full 64~MHz bandwidth with two polarisation products of up to 2048 channels for each polarisation.\nAs the telescope is being driven, the spectrometer is integrating the spectra over a minimum time interval of three seconds.\nThe data from the spectrometer are then written to an ATNF format file (\\textsc{rpfits}\\footnote{\\url{www.atnf.csiro.au/computing/software/rpfits.defn}}) along with time stamps, positional information, frequencies and summary information of the observation.\nThe summary information contains start and finish time, observation project number, source name, starting position in $\\alpha$ and $\\delta$ as well as {\\it a} and {\\it e}, number of Intermediate Frequencies (IFs), observed frequency, reference frequency and system temperature ($T_{sys}$/K).\nThe spectrometer will only record the starting position of each row of the map into the spectrometer log file through the correlator module, and this starting position is derived from the schedule file, not the telescope encoders.\nThe average position of each sample was therefore derived by cross-checking the \\textsc{nmc} log against the spectrometer log, taking into account slew times and correlator delays.\n\nThis was done by the python data processing scripts \\textsc{fillobservatories.py}\\footnote{\\url{spacescience.uws.edu.au/~honours/Graeme_W/fillobservatories.py}} and \\textsc{fixDirection\\_v2.py}\\footnote{\\url{spacescience.uws.edu.au/~honours/Graeme_W/fixDirection_v2.py}}. \nThese scripts also adjust the sample positions (see section~\\ref{sec:reduction}).\n\n\\subsection{Data processing}\n\\label{sec:reduction}\nData processing of 70m-Tid OTF data uses the Common Astronomy Software Applications \\citep[\\textsc{casa} version 4.1 and 4.2;][]{casa}.\nThe raw file (\\textsc{rpfits}) containing header information, tables and observation data is imported into \\textsc{casa}, with positions converted into radians.\n\nCorrecting the position of each integration is based on converting the recorded velocity taken from \\textsc{nmc} log into radians and compensating for the initial delay caused by the correlator.\n\n\n\n\n\n\n\nThe scan rate ($R$), is then used to correct the position of each integration along the $\\alpha\\cos\\delta_0$ axis:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 8394, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\n\\begin{abstract}\nOn-the-fly mapping of cm-wave spectral lines has been implemented at the \nthe Tidbinbilla 70-m radio antenna.\nWe describe the implementation and data reduction procedure and present new H92$\\alpha$ radio recombination line maps towards Orion\\,A and Sagittarius\\,A.\nComparison of the Orion~A map to previous observations suggests that the lines arise largely from gas with electron density of 100--200\\,cm$^{-3}$.\nOn-the-fly mapping is  very efficient at generating large maps of bright lines (such as radio recombination lines), but will still yield strong efficiency gains for smaller maps of fainter lines, such as the ammonia inversion lines at the 1.3\\,cm wavelength.\n\\end{abstract}\n\n\n\n\\begin{keywords}\nInstruments: miscellaneous -- ISM: {\\sc Hii} regions. -- radio lines: ISM. -- techniques: imaging processing\n\\end{keywords}\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\nThe Deep Space Station 43 (DSS-43) is a 70-m single dish radio telescope that is part of the NASA Canberra Deep Space Communication Complex (CDSCC) located in the Australian Capital Territory (hereafter referred to as `Tid-70m').\nA small fraction of its time is devoted to radio astronomy and it is important to maximise the scientific return on this time. \nAs such developments have been under way to implement On-The-Fly (OTF) mapping capabilities, to allow for an efficient survey option.\nFollowing the preliminary work of \\cite{young}, we present full details of the implementation of OTF mapping at the telescope allowing for greater mapping efficiency.\nMore efficient spatial mapping of the ammonia inversion transitions in the 17--27\\,GHz K-band is a strong driver of the implementation of OTF on the Tid-70m, but the technique may be used to map other radio lines, such as radio recombination lines (RRLs) that fall in\nthe cm-wave bands.\nWe used OTF mapping with Tid-70m to observe the H92$\\alpha$ RRL at 8.3\\,GHz towards the prominent Galactic {\\sc Hii} region Orion\\,A (Ori\\,A) and the Galactic Centre feature Sagittarius\\,A (Sgr\\,A).\n\nOTF mapping involves sampling the sky while the antenna is moving at a constant rate, rather than integrating at a discrete position on the sky, then moving to the next position. The technique is widely used by mm- and submm-wave telescopes to produce large-scale maps in molecular transitions and the greybody continuum, such as CO~3--2 mapping towards M\\,83 \\citep{aste_co}, maps of CO and 1.1\\,mm continuum emission towards Ori\\,A  \\citep{cont}, and 90\\,GHz maps of star-forming clumps \\citep{jackson}. Detailed descriptions of the technique have been presented by \\citet{mang} and \\citet{saw}. \nImplementation of OTF mapping at the Australia Telescope National Facility (ATNF) Mopra telescope has yielded several large mapping surveys \\citep[e.g.][]{magma, jones, mopragal}.\n\n\\cite{2012MNRAS.425.2352P} reviewed the physics of hydrogen RRL emission: the populations depart significantly from local thermodynamic equilibrium (LTE) over frequency ranges that depend on the electron density. \\citeauthor{2012MNRAS.425.2352P} consider ALMA and EVLA observations of compact high-density \\textsc{Hii} regions, but also show that for the larger, less dense \\textsc{Hii} regions that might be mapped with a single-dish telescope, non-LTE effects are important in the centimetre-wavelength range. \\cite{RRL_book} used a non-LTE analysis to show how the line brightness varies with frequency and electron density. We may therefore estimate the electron density from the frequency dependence of line brightness.\nThe line brightness depends on electron temperature and density, so RRL maps can be used to infer the structure of ionised gas \\citep[e.g.][]{1978ApJ...226..869J}.\n\n\\section{Observing process}\n\\label{obs_pro}\n\nWhile many OTF scan patterns can be implemented, we have used the simplest, the raster (Fig.~\\ref{pattern}), which is optimised for mapping rectangular regions.\nRaster scanning moves the telescope on-source, `ON', in a straight line, then offsets by a fraction of a beam, perpendicular to the scan direction, before moving the telescope in the opposite direction.\nAn emission-free reference position, `OFF', is also observed to correct for the bandpass. \nAs the telescope moves across the source, the spectrometer samples data at regular intervals.\n\nOur implementation is a variation of the raster geometry, where the order of observing on-source or reference position is flexible: an OFF can be observed before or after an ON, or after multiple ON scans (see \\S\\ref{sec:ant} and \\ref{sec:spec} for details).\nMaps can be made in either ($\\alpha\\cdot\\cos\\,\\delta_{0}$, $\\delta$) or (\\textit{a}$\\cdot\\cos e_0$, $e$) coordinate systems, with the scan direction parallel to either coordinate axis \\footnote{$a, e$ are azimuth and elevation. $\\delta_{0}$ is the declination of the starting position of the observation. The longitudinal coordinates are referred to as cross-Dec and cross-El in the telescope control system.}.\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth]{OTF_raster_pattern}\n\\caption{\nThe sequence of steps in an OTF observation.\nThe target region to be mapped is shown as a shaded rectangle.  \nThe solid line indicates telescope movement, starting and stopping at the crosshairs, during which the spectrometer is continuously sampling. \nThe dashed line shows telescope movement without spectrometer sampling. \nIn this example, every scan row is observed before making an OFF measurement, shown as a shaded circle.\n}\n\\label{pattern}\n\\end{center}\n\\end{figure}\n\n\n\n\n\\subsection{Software Architecture}\n\\label{sec:ctrl_sw}\nThe OTF observing mode was implemented on the control software \\textsc{auto\\_spec}, a \\textsc{perl} based script that acts as an interface to the telescope and spectrometer.\nThis software sends commands via two \\textsc{perl} modules: network monitor control (\\textsc{nmc.pm}) and correlator (\\textsc{corr.pm}). \nThese commands are sent to the antenna pointing control (\\textsc{apc}) and the user interface (\\textsc{tkcor}) respectively.\nThe \\textsc{nmc} module interacts with NASA controlled modules of the telescope.\nThe commands the \\textsc{nmc} module sends are: setting position; offset; slew rate; stop and stow. \nThe module also retrieves information on the current {\\it a} and {\\it e} coordinates, offsets, slew rate and supplementary information (temperature, pressure, humidity, wind speed, wind direction, precipitation and time).\nThe antenna logs that are generated by the \\textsc{nmc} module contain telescope commands and records of the position.\nThe \\textsc{corr} module interacts with the user interface \\textsc{tkcor}, a \\textsc{Perl/Tk} module that is the interface of the process \\textsc{dummsy}.\n\\textsc{dummsy} sends commands to the physical correlator.\nLogs from the spectrometer are generated from \\textsc{corr.pm}.\nFig.~\\ref{schematic}. is a schematic illustration of the architecture of the software control system.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{OTF_schematic}\n\\caption{Schematic illustration of the telescope system. \nThe rounded rectangles are processes involved with OTF, rectangles are individual instruments and cylinders represent data storage and files.}\n\\label{schematic}\n\\end{center}\n\\end{figure}\n\n\\subsection{Antenna}\n\\label{sec:ant}\n\nThe commands to move the telescope come from the schedule file, setting the parameters of the observation, containing positional information for the reference position and starting position on source, time on source and frequency.\nScanning axis and direction for on-source scanning are programmed into the control software \\textsc{auto\\_spec} before observations begin.\nIn a typical OTF mapping observation, where a reference position is taken, first, then a single on source observation:\n\n\\begin{enumerate}\n\t\\item OTF mapping begins with integrating on an emission-free reference position;\n\t\\item the telescope slews to the start position of the target source;\n\t\\item the OTF scan starts with \\textsc{auto\\_spec} commanding the telescope control to settle on the $\\alpha$ and $\\delta$ starting point before moving the telescope in a set direction at a constant rate with a timer starting;\n\t\\item the scan rate of the telescope is calculated based on the beam size, and sampling rate:\n\n", "index": 1, "text": "\\begin{equation} \nR = \\frac{\\theta_{int}}{t_{int}} = \n\n\\frac{d\\alpha}{dt}\\cos\\,\\delta_0\n\\label{scanRate}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"R=\\frac{\\theta_{int}}{t_{int}}=\\par&#10;\\frac{d\\alpha}{dt}\\cos\\,\\delta_{0}\" display=\"block\"><mrow><mi>R</mi><mo>=</mo><mfrac><msub><mi>θ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi></mrow></msub><msub><mi>t</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mfrac><mo>=</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>α</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mrow><mpadded width=\"+1.7pt\"><mi>cos</mi></mpadded><mo>⁡</mo><msub><mi>δ</mi><mn>0</mn></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00070.tex", "nexttext": "\n\nwhere $\\alpha_{0}$ and $t_0$ are the starting R.A.\\ and time, and $\\alpha_{i}$ and $t_i$ are the R.A.\\ and time of the current integration ($\\delta_{0}$ is the corresponding declination for $\\alpha_{0}$).\nThe new positions are written into the scan table, as well as the recalculated {\\it a} and {\\it e} for each new position.\nThe antenna temperature $T_{A}$ is obtained by bandpass correcting the raw spectrum:\n\n", "itemtype": "equation", "pos": 11597, "prevtext": "\n\n\n(assuming scanning in $\\alpha\\cos\\,\\delta_{0}$), where $R$ is the scanning rate of the telescope in degrees\\,s$^{-1}$, $\\theta_{int}$ is defined as $\\theta_{FWHM}/n$ ($n$ is the number of times to sample the beam, generally $\\geq 3$) and ${t_{int}}$ is the number of seconds per integration;\n\t\\item  as the telescope continues to slew across the source, the antenna log samples the telescope's position in $a$ and $e$ every 15 seconds.\n\t\\item the telescope will be sent the command to stop when the timer matches the on source time in the schedule file;\n\t\\item once the telescope has stopped, the next line in the schedule file is read.\n\n\\end{enumerate}\n\n\n\n\\subsection{Spectrometer}\n\\label{sec:spec}\nThe Tid-70m is equipped with a Parkes Multibeam correlator block \\footnote{\\url{www.atnf.csiro.au/observers/tidbinbilla}}.\nOTF observations can use the full 64~MHz bandwidth with two polarisation products of up to 2048 channels for each polarisation.\nAs the telescope is being driven, the spectrometer is integrating the spectra over a minimum time interval of three seconds.\nThe data from the spectrometer are then written to an ATNF format file (\\textsc{rpfits}\\footnote{\\url{www.atnf.csiro.au/computing/software/rpfits.defn}}) along with time stamps, positional information, frequencies and summary information of the observation.\nThe summary information contains start and finish time, observation project number, source name, starting position in $\\alpha$ and $\\delta$ as well as {\\it a} and {\\it e}, number of Intermediate Frequencies (IFs), observed frequency, reference frequency and system temperature ($T_{sys}$/K).\nThe spectrometer will only record the starting position of each row of the map into the spectrometer log file through the correlator module, and this starting position is derived from the schedule file, not the telescope encoders.\nThe average position of each sample was therefore derived by cross-checking the \\textsc{nmc} log against the spectrometer log, taking into account slew times and correlator delays.\n\nThis was done by the python data processing scripts \\textsc{fillobservatories.py}\\footnote{\\url{spacescience.uws.edu.au/~honours/Graeme_W/fillobservatories.py}} and \\textsc{fixDirection\\_v2.py}\\footnote{\\url{spacescience.uws.edu.au/~honours/Graeme_W/fixDirection_v2.py}}. \nThese scripts also adjust the sample positions (see section~\\ref{sec:reduction}).\n\n\\subsection{Data processing}\n\\label{sec:reduction}\nData processing of 70m-Tid OTF data uses the Common Astronomy Software Applications \\citep[\\textsc{casa} version 4.1 and 4.2;][]{casa}.\nThe raw file (\\textsc{rpfits}) containing header information, tables and observation data is imported into \\textsc{casa}, with positions converted into radians.\n\nCorrecting the position of each integration is based on converting the recorded velocity taken from \\textsc{nmc} log into radians and compensating for the initial delay caused by the correlator.\n\n\n\n\n\n\n\nThe scan rate ($R$), is then used to correct the position of each integration along the $\\alpha\\cos\\delta_0$ axis:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "index": 3, "text": "\\begin{equation} \n\\alpha_{i} = \\alpha_{0} + \\frac{R}{\\cos\\,\\delta_{0}}\\cdot(t_{i}-t_{0})\n\\label{new_pos}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\alpha_{i}=\\alpha_{0}+\\frac{R}{\\cos\\,\\delta_{0}}\\cdot(t_{i}-t_{0})\" display=\"block\"><mrow><msub><mi>α</mi><mi>i</mi></msub><mo>=</mo><mrow><msub><mi>α</mi><mn>0</mn></msub><mo>+</mo><mrow><mfrac><mi>R</mi><mrow><mpadded width=\"+1.7pt\"><mi>cos</mi></mpadded><mo>⁡</mo><msub><mi>δ</mi><mn>0</mn></msub></mrow></mfrac><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mi>i</mi></msub><mo>-</mo><msub><mi>t</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00070.tex", "nexttext": "\n$T_{sys}$ is the system temperature, $ON$ is the on-source spectrum and $OFF$ is the reference spectrum.\n\nThe schedule file contained a reference scan for each on-source scan; the \\textsc{sdcal} task in \\textsc{casa} assumes this format.\nPolynomial baseline subtraction can occur at this stage, or a continuum subtraction can be applied after the imaging stage is completed to preserve the continuum emission.\nSmoothing functions such as the Hanning function can also be applied if the target spectral line is narrow.\nCalibrated data are then exported into a measurement set (MS) format for the imaging stage, which creates a position-position-velocity cube using both circular polarisations.\nThe gridding kernel is the default 2-D top-hat function with a 1-pixel width.\nContinuum subtraction from the image cube can be applied (if baseline subtraction was not applied to the spectra), through the specification of a line-free channel range, resulting in a continuum cube and emission line cube.\nThe data cube can then be exported to \\textsc{fits}.\nThe detailed \\textsc{casa} data reduction procedure is described in Appendix~\\ref{app:casa}.\n\n\n\n\\section{Test Observations}\n\\label{sec:obs}\nThe H{\\sc{ii}} region Ori\\,A and Galactic centre source Sgr\\,A were the targets for our test observations (Table~\\ref{tab:regionInfo}).\nObservations were conducted under Tid-70m project T206, as part of the OTF development programme.\nOur test observations used the 8.2--8.6~GHz X-band receiver and recorded both circular polarisations with 64~MHz bandwidth, sampling at a quarter FWHM with the minimum three second intervals.\nThe beam has FWHM 1.8\\arcmin, and individual scans (map rows) were spaced by 30\\arcsec\\ in Dec, while the telescope scanned along the $\\alpha\\cdot\\cos\\,\\delta_{0}$ axis.\nA schedule file parameter set the time taken for the telescope to complete each scan: \nThese observations used 120s-long scans with 30s integrations on the reference position.\nThe Hanning function was not applied for the maps presented, as RRLs are broad spectral features, so Hanning is not required.\nOpacity correction was not applied to our maps, but attenuation due to opacity would be within 5\\% at the lowest elevation during the 8\\,GHz observations.\nThere was no comparison to a flux calibrator source, but our observations agree within 10\\% with those of \\cite{Cesarsky}.\n\n\\begin{table*}\n\\caption{Table showing the different sources observed, the date observed, the amount of time taken to observe, map size in arcmin, central position of the map and reference position.}\n\\begin{center}\n\\begin{tabular}{lcccccc}\n\\hline\nRegion&Date &Time&Map Size&Map Size& Central map position& Reference position\\\\\n&Observed& Duration& (R.A. $\\times$ Dec)&(Pixels)& R.A. (J2000) Dec (J2000)&R.A. (J2000) Dec (J2000)\\\\\n\\hline\n  Ori\\,A  &  2013-09-24 & 2.4 h & 18.9\\arcmin$\\times$ 17.5\\arcmin\\ & 42 $\\times$ 36 & 05:35:19.2 --05:18:47.7 & 05:40:30.0 --05:16:16.0\\\\\n  Sgr\\,A  &  2013-09-23 & 2.8 h & 20.4\\arcmin$\\times$ 16.0\\arcmin\\ & 42 $\\times$ 42 & 17:45:58.9 --28:58:22.1 & 17:55:00.0 --28:00:00.0\\\\ \n &  2013-09-24 & 1.3 h & 20.4\\arcmin$\\times$ 10.5\\arcmin\\ & 42 $\\times$ 21 & 17:45:58.9 --28:43:28.3 & 17:55:00.0 --28:00:00.0\\\\ \n\\hline\n\\end{tabular}\n\\end{center}\n\\label{tab:regionInfo}\n\\end{table*}\n\nOri\\,A and Sgr\\,A were mapped with the same telescope scan speed of $-2.48$\\,mdeg\\,s$^{-1}$ along $\\alpha\\cdot\\cos\\,\\delta_{0}$; converting the scan speed to $\\alpha$ and using the minimum integration time of 3s, Ori\\,A and Sgr\\,A have cell sizes of \n0.45\\arcmin\\  and 0.51\\arcmin\\ respectively along the scan direction, and 0.5\\arcmin\\ across the scan direction.\nOffsets caused by the delay of the spectrometer were between 0.30\\arcmin\\ and 0.60\\arcmin\\ for Ori\\,A and 0.34\\arcmin\\ and 0.68\\arcmin\\ for Sgr\\,A.\nThe scan speed is taken from the \\textsc{nmc} log which records telescope speed, and the integration time is taken from correlator logs (The negative scanning speed indicates that the telescope was moving in decreasing $\\alpha\\cdot\\cos\\,\\delta_{0}$.). The effect of these corrections is to shift each scan row by a slightly different amount along the scan direction. The resulting Sgr\\,A image has a continuum peak shifted to the position of Sgr\\,A$^{*}$ compared to the uncorrected image which had a 2.5\\arcmin\\ offset from Sgr\\,A$^{*}$.\n\nBoth sources were observed with channels of width 1.13~km\\,s$^{-1}$.\nThe Ori\\,A integrated H92$\\alpha$ emission map is shown in Fig.\\,\\ref{fig:orionA}.\nContinuum subtraction was applied to the Ori\\,A cube after the imaging process, as this correctly produced a flat spectrum.\nSgr\\,A was observed on two separate days; data from each day were processed separately before merging the datasets during the imaging stage.\nH92$\\alpha$ integrated and channel maps towards Sgr\\,A are shown in Figs.\\,\\ref{fig:SGA} and \\ref{fig:SGA_channel} respectively.\nWhile the data cube has a channel width of 1.13~km s$^{-1}$, the channel map in Fig.~\\ref{fig:SGA_channel} uses a channel width of 15~km s$^{-1}$.\n\nBecause of the complex emission structure of the region, an attempt was made to select a line-free channel range to create a polynomial to remove continuum emission from the spectra.\nExamining the attempted continuum subtraction, we see the Northern region with continuum emission successfully removed. \nHowever, around the Southern peak ($\\delta<-28^{\\circ}55\\arcmin$) broadband emission can still be seen.\nContinuum emission is still present within Figs.\\,\\ref{fig:SGA} and \\ref{fig:SGA_channel}.\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[trim = 0cm 0cm 0cm 0cm ,clip=true, width=0.5\\textwidth]{orionA_integrated.pdf}\n\\caption{\nIntegrated H92$\\alpha$ emission map towards Ori\\,A; contours at 20, 40, 60\\dots 140~K\\,km\\,s$ ^{1} $. }\n\\label{fig:orionA}\n\\end{center}\n\\end{figure}\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[trim = 0cm 0cm 0cm 0cm ,clip=true, width=0.5\\textwidth]{SgrA_integrated_contSub}\n\\caption{\nIntegrated H92$\\alpha$ emission map with incomplete continuum subtraction towards Sgr\\,A; contours at 20, 30, 40\\dots 70~K\\,km\\,s$^{-1}$.}\n\\label{fig:SGA}\n\\end{center}\n\\end{figure}\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=1\\textwidth]{SgrA_chan_rrl_v2.pdf}\n\\caption{On-the-fly channel maps with incomplete continuum subtraction of H92$\\alpha$ emission towards Sgr\\,A; \ncontours at 0.3, 0.45, 0.6\\dots 1.2\\,K.} \n\n\\label{fig:SGA_channel}\n\\end{center}\n\\end{figure*}\n\n\n\n\n\\section{Discussion}\n\\label{sec:dis}\n\n\\begin{table*}\n\\caption{Gaussian fits to sample H92$\\alpha$ spectra.}\n\\begin{center}\n\\begin{tabular}{lcccccccc}\n\\hline\nRegion&R.A. &Dec& V$_{LSR}$ &$\\Delta \\nu$ & T$_{A}$ \\\\\n&J2000& J2000& (km\\,s$^{-1}$) & (km\\,s$^{-1}$) & (K)\\\\\n\\hline\n  Ori\\,A  &  05:35:17.8& --05:22:15.0&--2.7$\\pm$0.3&25.0$\\pm$0.7&5.07$\\pm$0.12\\\\\n  Sgr\\,A  &  17:45:41.4& --28:52:14.9& --40.5$\\pm$0.8& 56.2$\\pm$2.0& 0.88$\\pm$0.03\\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\label{tab:guass_para}\n\\end{table*}\n\n\n\\subsection{Orion A}\n\nOur data constitute the first fully-sampled single-dish RRL map of Ori\\,A, though sparsely-sampled maps made up of selected beam positions have previously been published by \\citet{1978ApJ...226..869J} and by \\cite{1988PASJ...40..581};\nthe RRL structure (Fig.~\\ref{fig:orionA}) is similar to that seen in a 23\\,GHz continuum map  \\cite[resolution 42\\arcsec,][]{1984A+A___138__225W}.\nMany hydrogen RRL transitions have been observed with single-dish telescopes towards Ori\\,A, mostly towards similar positions, so that the beams overlap.\nTable~\\ref{tab:lit_ref} lists H(\\textit{n})$\\alpha$ RRL transitions observed towards positions close to the peak brightness that we observe in Ori\\,A.\nThe spectrum corresponding to the peak brightness in our H92$\\alpha$ map (Fig.~\\ref{fig:OrionA_spectra} and Table~\\ref{tab:guass_para}) may be compared to a previous observation of the same transition by \\citet{Cesarsky}, which used the\nDSN Goldstone antenna, then 64\\,m in aperture, with beamwidth of 2.5$\\arcmin$.\nNo pointing coordinates are given, but the published line parameters\n(T$_{A}$ = 4.65~K, V$_{LSR}$ = --2.7$\\pm$2~km\\,s{$^{-1}$}, $\\Delta \\nu$ = 26$\\pm$2~km\\,s{$^{-1}$}), agree with our results (Table~\\ref{tab:guass_para}) within the error intervals,  except for line amplitude; but even here, the discrepancy of 0.42~K is less than 10\\%.\n\n\nFig.~\\ref{fig:OrionA_soro_lit} is replotted from \\cite{soro}, with observational data points added by taking the line brightnesses from Table~\\ref{tab:lit_ref} divided by the emission measure of the {\\sc Hii} region \\citep[EM of $4.0\\times 10^6$\\,cm$^{-6}$\\,pc taken from][]{1981MNRAS.196..889M}, and shows the variation of RRL brightness with electron density. All the lines denoted by pentagons are observed at similar positions, and the filled pentagon is the value taken from our map. Triangles denote observations with no position given. The model curves show that we should expect significant changes in the relative line brightnesses around 10\\,GHz as the electron density increases from \n100~cm$^{-3}$ to 1000~cm$^{-3}$. Observations at these frequencies therefore present an opportunity to probe the electron density directly through RRLs, and large-scale mapping of RRLs at these frequencies may allow us to map electron density structure.\n\nThe data points in Fig.~\\ref{fig:OrionA_soro_lit} generally lie near the model curves for electron densities of 100 and 200~cm$^{-3}$. \nPoints lying significantly away from these tracks are at an uncertain position (7.8\\,GHz) or an upper limit (24.5\\,GHz). Estimates of the electron density towards Ori\\,A generally lie at least an order of magnitude higher:\n\\cite{1984A&A...135..116S} calculated an electron density of (1$\\pm$ 0.3)$\\times 10^{4}$~cm$^{-3}$, based on Stark broadening of RRLs, and \\cite{2007AJ....133..952G} suggest the electron density is generally around 2000~cm$^{-3}$ throughout Ori\\,A, based on optical spectroscopy.\n\n\\citet{2007AJ....133..952G} found a layer of low-electron-density emission towards \nOri\\,A, lying in front of the main ionised region, and blueshifted. Fig.~\\ref{fig:OrionA_soro_lit} shows that low-electron-density gas emits very strongly around 10\\,GHz, so it is possible\nthat much of the H92$\\alpha$ emission that we see arises in lower-density material.\n\\cite{1995ApJ...438..784W} modelled the dense layer of ionised material in Ori\\,A as being 0.1--0.2~pc thick, so the denser gas might account for less than half of the \n$4\\times 10^{6}$\\,cm$^{-6}$pc emission measure; hence there could be a large amount of \nlow-density gas to generate the RRLs.\nTo confirm this possibility,  a full spatial analysis of RRLs across frequencies and comparison to continuum maps would be required, falling outside the scope of this paper.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[trim = 0cm 0cm 0cm 0cm ,clip=true, width=0.5\\textwidth]{OrionA_spectra}\n\\caption{H92$\\alpha$ spectrum towards Ori\\,A at the position of peak $T_L$ (coordinates top right).} \n\\label{fig:OrionA_spectra}\n\\end{center}\n\\end{figure}\n\n\n\\begin{table*}\n\\caption{\nTable containing Hydrogen RRL transition, rest frequency, peak brightness temperature (T$_{A}$), beam efficiency, line brightness temperature corrected for beam efficiency (T$_{L}$) and available publications with single dish observation towards Ori\\,A in the H\\textit{n}{$\\alpha$} RRL.\nThe H109$\\alpha$ T$_{L}$ appears to be have already been corrected for beam efficiency \\citep{1978ApJ...226..869J}. The H64$\\alpha$ T$_{L}$ had already been corrected for beam efficiency and with a smaller beam than our observations (42\\arcsec), the data point in Fig~\\ref{fig:OrionA_soro_lit} is an upper limit \\citep{1997AA...327.1177W}.\nOur 92$\\alpha$ spectrum (R.A. 05:35:14.8, Dec. --05:22:32.4) is towards the overlap of the other H$(n)\\alpha$ transitions.\n}\n\\begin{center}\n\\begin{tabular}{ccccclcl}\n\\hline\nTransition & Rest Frequency & T$_{A}$ & $\\eta$ & T$_{L}$ & Reference\\\\\n& (GHz) & (K) & & (K) \\\\\n\\hline\n50 & 51.07 & 0.67 & 0.65 & 1.03& \\cite{1977ApJ...214..699H} \\\\\n53 & 42.95 & 0.98 & 0.65 $\\pm$ 0.05& 1.97 & \\cite{1988PASJ...40..581} \\\\\n64 & 24.51 & --- & --- & 5.05 & \\cite{1997AA...327.1177W}\\\\\n65 & 25.40 & 1.54 & 0.47 & 3.28 & \\citet{1970ApL.....5..157C} \\\\\n76 & 14.69 & 2.95 & 0.70 & 4.21& \\cite{1981MNRAS.196..889M} \\\\\n91 & 8.67 & 4.28 & 0.70 & 6.11& \\cite{2006ApJS..165..338Q} \\\\ \n92 & 8.31 & 4.65 & 0.70 $\\pm$ 0.2 & 6.64 & \\cite{Cesarsky} \\\\\n92 & 8.31 & 4.57 & 0.70 & 6.53 & This paper \\\\\n94 & 7.79 & 2.04 & 0.53& 3.85 & \\cite{1967ApJ...149L..21G} \\\\ \n109 & 5.01 & --- & 0.65 & 6.45 & \\cite{1978ApJ...226..869J} \\\\\n110 & 4.87 & 5.40 & 0.75& 7.20 & \\cite{1971ApJ...163..479D} \\\\\n126 & 3.24 & 2.70 & 0.70 & 3.86 & \\cite{1968AuJPh..21..149M} \\\\\n134 & 2.70 & 2.20 & 0.75& 2.93 & \\cite{1970AA.....4..244Z} \\\\\n158 & 1.65 & 1.60 & 0.70 & 2.29& \\cite{1969AuJPh..22..631M} \\\\\n166 & 1.42 & 0.56 & 0.67 & 0.84 & \\cite{1972MNRAS.159..129P} \\\\\n192 & 0.92 & 0.17 & 0.67 & 0.25 & \\cite{1972MNRAS.159..129P} \\\\\n198 & 0.84 & 0.10 & 0.55 & 0.18 & \\cite{1974ApJ...190...35Z} \\\\\n220 & 0.61 & 0.17 & 0.67 & 0.25 & \\cite{1972MNRAS.159..129P} \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\label{tab:lit_ref}\n\\end{table*}\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[trim = 1cm 0cm 1.5cm 1cm ,clip=true, width=0.5\\textwidth]{soro_vs_lit.pdf}\n\\caption{\nBrightness temperature at the center of a line as a function of frequency \\citep{soro},\noverlaid with peak antenna temperatures (Table~\\ref{tab:lit_ref}) of Hydrogen RRLs towards Ori\\,A observed at different frequencies.\n}\n\\label{fig:OrionA_soro_lit}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{Sagittarius A}\n\nSgr\\,A has been mapped interferometrically in the H92$\\alpha$ RRL using the VLA \\citep{1993ApJ...418..235Z, 1993ApJS...86..133R, 2001AJ....121.2681L, 1997ApJ...481.1016L}, but the high resolution of these maps rules out simple comparisons to our data.\n\n\\cite{1976A&A....46..407P} and \\cite{1980A&A....85...26P} used the 100-m Effelsberg telescope to map H85$\\alpha$ and H109$\\alpha$ RRL emission towards the Sgr\\,A region. \nContinuum subtraction was applied on the Sgr\\,A data set, although due to the strong Sgr\\,A non-thermal emission affecting the entire band profile, there still remains some continuum emission seen in the maps as broadband emission in the southern peak ($\\delta<-28^{\\circ}55\\arcmin$).\nHowever, we see a `peanut' shape in our H92$\\alpha$ map (Fig~\\ref{fig:SGA}) similar to that seen by \\citet{1976A&A....46..407P} in H85$\\alpha$ (10\\,GHz, 1.3$\\arcmin$ beam);\nour channel map (Fig~\\ref{fig:SGA_channel}) and the spectrum towards the emission peak (Fig.~\\ref{fig:SgrA_spectra}) are consistent with the finding of \\citeauthor{1980A&A....85...26P} that the dominant H109$\\alpha$ (5\\,GHz, 2.6$\\arcmin$ beam) emission occurs at $V_{LSR}\\sim -40$\\,km\\,s$^{-1}$.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[trim = 0cm 0cm 0cm 0cm ,clip=true, width=0.5\\textwidth]{sgrA_peak_rrl_spectra_papPos}\n\\caption{Sample H92$\\alpha$ spectra towards Sgr\\,A.} \n\\label{fig:SgrA_spectra}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{On-the-fly mapping on the 70-m}\n\nOur maps use a 30\\arcsec\\ row spacing, more finely-sampled than the Nyquist row spacing criteria suggested by \\citet{mang}, resulting in oversampling of the rows.\nOur scan rate implies an oversampling factor \\citep[$n_{os}$ in Eq.\\,10,][]{mang} close to 1.5 for Sgr\\,A and 2 for Ori\\,A.\n\n\nMapping a region the size of Ori\\,A (18.9$\\arcmin \\times$17.5$\\arcmin$ map) by position switching would take  about 25~hours, an order of magnitude more than the time taken to map it with OTF (Table~\\ref{tab:regionInfo}).\nThe major contributor to the time requirement for position switching is the telescope motion overhead, as the telescope moves back and forth between the map position and the reference. \nFrom OTF mapping logs, each such movement takes 12--32\\,s, 25\\,s on average. \nMost of this time is required to accelerate, decelerate and settle the telescope, so it is likely not to be strongly dependent on the distance to the reference position.\nBecause mapping of the bright hydrogen RRLs only requires a few seconds' integration (compared to the tens of seconds of movement overhead), RRL mapping probably gains the most efficiency from OTF.\n\nThe ammonia inversion transitions in the 17--27\\,GHz K-band are widely used to probe the temperature of cold dense gas; OTF may be used to map these lines.\nA $10\\arcmin\\times 10\\arcmin$ position-switching map with 60\\,s integration on-source per position, mapped at half-beam spacing will take $\\sim 29$~h and reach rms noise of $\\sim 0.07$\\,K. This sensitivity is likely to be useful for ammonia analysis. To map a similar area with OTF, spacing map rows by half a beam and sampling each row every third of a beam, using the minimum 3\\,s integration time, takes 1.4~hours, achieving an estimated rms noise of 0.3~K.\nCo-adding 12 repeated maps (taking into account that the OTF map is more densely sampled than the position-switched map), will yield an rms of $\\sim 0.07$\\,K in $\\sim 17$~hours, about 0.6 of the time required for the position-switching map. \nEach row of the OTF map takes 150\\,s, so the reference position is checked every 3.5\\,min; 4\\,min is the approximate maximum time between reference spectra at K-band.\nK-band observations will require opacity and gain-curve corrections for the corrected temperature scale (T$_{A}^{*}$) which is applied after importing into \\textsc{casa}. \nSmoothing using the Hanning function can be applied at a later stage.\n\nFor compact ammonia sources, observing efficiency can be increased by averaging the ends of the scan rows as an OFF spectrum in the data processing, removing the need for a reference scan.\nThis approach will require reformatting the raw file to allow \\textsc{casa} to separate on-source spectra from OFF spectra for processing. \n\n\n\n\\section{Conclusions}\n\\label{sec:concl}\nThe 70-m Tidbinbilla radio telescope is now capable of on-the-fly (OTF) spectral line mapping. We have tested the new observing mode by mapping radio recombination line emission towards Orion~A and Sagittarius~A: Our data are consistent with published data towards these regions.\n\nWe have combined our measurement of the peak brightness towards Orion~A with other measurements from the literature over a wide range of frequency, and plotted the line brightnesses over the theoretical curves of \\citet{soro}. The line brightness measurements are most consistent with electron densities of \n100--200\\,cm$^{-3}$, much lower than usual estimates of the electron density of the Orion nebula. This discrepancy may reflect the more efficient RRL emission from lower-density gas. Comparison of RRL brightness over a wide frequency range has the potential to constrain the electron density of large ionised regions, but this requires large-scale mapping to allow different beams to be compared as well as to analyse spatial structure. OTF mapping, which is highly efficient at mapping RRLs, can enable this analysis.\n\nBecause of the long times required for the Tid-70m to switch between source and reference, large maps of bright lines (such as RRLs) are very efficiently mapped by OTF, while smaller maps of fainter lines (requiring longer integration times) do not gain as much. At K-band, the requirement to go to a reference position every $\\sim 4$\\,min sets a limit to the mapping efficiency that can be achieved. Even so, maps of ammonia inversion transitions should be significantly more efficient using OTF.\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\n\nDSS-43 is part of the Canberra Deep Space Communication Complex (CDSCC), which is managed by CSIRO Astronomy and Space Science.\nG.W. thanks the director of CDSCC Dr. E. Kruzins for travel support and hospitality while part of this work was conducted, and Dr. Malte Marquarding for providing information related to \\textsc{asap}.\nCASA is developed at NRAO and under NRAO management with major contributions from ESO and NAOJ.\nThe original \\textsc{auto\\_spec} code was written by J.~E.~J. Lovell.\nWe thank the anonymous referee for the insightful comments, which have led to an improved paper. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem[\\protect\\citeauthoryear{Balser et al.}{2001}]{Balser} {Balser} D.~S., {Goss} W.~M., {De Pree} C.~G., 2001, ApJ, 121, 371\n\\bibitem[\\protect\\citeauthoryear{Bell et al.}{2011}]{2011Ap26SS.333..377B} Bell M. B., Avery L. W., MacLeod J. M., Vallee J. P., 2011, Ap\\&SS, 333, 377\n\\bibitem[\\protect\\citeauthoryear{Braiding et al.}{2015}]{mopragal} Braiding C., et al. 2015, PASA, 32, 20\n\\bibitem[\\protect\\citeauthoryear{Cesarsky}{1973}]{Cesarsky} {Cesarsky} D.~A., 1973, ApJ, 184, 397\n\n\n\\bibitem[\\protect\\citeauthoryear{Churchwell et al.}{1970}]{1970ApL.....5..157C} Churchwell E., {Mezger} P., {Reifenstein} III E., {Rubin} R., {Turner} B., 1970, Aplett, 5, 157\n\\bibitem[\\protect\\citeauthoryear{Davies}{1971}]{1971ApJ...163..479D} Davies R. D., 1971, ApJ, 418, 479\n\n\n\\bibitem[\\protect\\citeauthoryear{{Garc{\\'{\\i}}a-D{\\'{\\i}}az} \\& {Henney}}{2007}]{2007AJ....133..952G} {Garc{\\'{\\i}}a-D{\\'{\\i}}az} M.~T., {Henney} W.~J., 2007, ApJ, 133, 952\n\\bibitem[\\protect\\citeauthoryear{Gordon \\& Meeks}{1967}]{1967ApJ...149L..21G} Gordon M. A., Meeks M. L., 1969, ApJ, 149, 21\n\\bibitem[\\protect\\citeauthoryear{Gordon \\& Sorochenko}{2009}]{RRL_book} Gordon, M. A. \\& Sorochenko, R. L. 2009, Radio Recombination Lines. Springer Publishers Group, USA, NY\n\\bibitem[\\protect\\citeauthoryear{Hollis \\& Ulich}{1977}]{1977ApJ...214..699H} Hollis J. M., Ulich B. L., 1977, ApJ, 214, 699\n\\bibitem[\\protect\\citeauthoryear{Jackson et al.}{2013}]{jackson} {Jackson} J.~M. et al., 2013, PASA, 30, 57\n\\bibitem[\\protect\\citeauthoryear{Jaffe \\& Pankonin}{1978}]{1978ApJ...226..869J} Jaffe D. T. Pankonin V., 1978, ApJ, 226, 869\n\\bibitem[\\protect\\citeauthoryear{Jones et al.}{2013}]{jones} {{Jones} P.~A., {Burton} M.~G., {Cunningham} M.~R., {Tothill} N.~F.~H., {Walsh} A.~J.}, 2013, MNRAS, 433, 221\n\\bibitem[\\protect\\citeauthoryear{Lang, Goss \\& Morris}{2001}]{2001AJ....121.2681L} {Lang} C.~C., {Goss} W.~M., {Morris} M., 2001, ApJ, 121, 2681\n\\bibitem[\\protect\\citeauthoryear{Lang, Goss \\& Wood}{1997}]{1997ApJ...481.1016L} {Lang} C.~C.~L., {Goss} W.~M., {Wood} D.~O.~S., 1997, ApJ, 481, 1016\n\\bibitem[\\protect\\citeauthoryear{Lockman \\& Brown}{1975}]{orionA_sum} {{Lockman} F.~J., {Brown} R.~L.}, 1975, ApJ, 201, 134\n\\bibitem[\\protect\\citeauthoryear{Mangum et al.}{2007}]{mang} {{Mangum} J.~G., {Emerson} D.~T., {Greisen} E.~W.,} 2007, A\\&A, 474, 679\n\\bibitem[\\protect\\citeauthoryear{McGee et al.}{1969}]{1969AuJPh..22..631M} McGee R. X., Batchelor R. A., Brooks J. W., Sinclair M. W., 1969, AuJPhys, 22, 631\n\\bibitem[\\protect\\citeauthoryear{McGee \\& Gardner}{1968}]{1968AuJPh..21..149M} McGee R. X., Gardner F. F., 1968, AuJPhys, 21, 149\n\\bibitem[\\protect\\citeauthoryear{McGee \\& Newton}{1981}]{1981MNRAS.196..889M} McGee R. X., Newton L. M., 1981, MNRAS, 196, 889\n\\bibitem[\\protect\\citeauthoryear{McMullin et al.}{2007}]{casa} McMullin J. P., Waters B., Schiebel D., Young W., Golap K., 2007, ASP Conf. Ser,  376, 127\n\\bibitem[\\protect\\citeauthoryear{Muraoka et al.}{2009}]{aste_co} Muraoka~K., et al, 2009, ApJ,  706, 1213\n\n\\bibitem[\\protect\\citeauthoryear{Pauls et al.}{1976}]{1976A&A....46..407P} {Pauls} T., {Downes} D., {Mezger} P.~G., {Churchwell} E., 1976, A\\&A, 46, 407\n\\bibitem[\\protect\\citeauthoryear{Pauls \\& Mezger}{1980}]{1980A&A....85...26P} {Pauls} T., {Mezger} P.~G., 1980, A\\&A, 85, 26\n\\bibitem[\\protect\\citeauthoryear{Pedlar \\& Davies}{1972}]{1972MNRAS.159..129P} Pedlar A., Davies. R. D., 1972, MNRAS, 159, 129\n\\bibitem[\\protect\\citeauthoryear{Peimbert et al.}{1988}]{1988PASJ...40..581} Peimbert, M., Ukita N., Hasegawa T., Jugaku J., 1988, PASJ, 40, 581\n\\bibitem[\\protect\\citeauthoryear{Peters et al.}{2012}]{2012MNRAS.425.2352P} {Peters} T., {Longmore} S.~N., {Dullemond} C.~P., 2012, MNRAS, 425, 2352\n\\bibitem[\\protect\\citeauthoryear{Quireza et al.}{2006}]{2006ApJS..165..338Q} Quireza C, Rood R. T., Balser D. S., Bania  T. M., 2006, ApJS, 165, 228\n\\bibitem[\\protect\\citeauthoryear{Roberts \\& Goss}{1993}]{1993ApJS...86..133R} {Roberts} D.~A., {Goss} W.~M., 1993, ApJS, 86, 113\n\\bibitem[\\protect\\citeauthoryear{Sawada et al.}{2008}]{saw} {Sawada} T., et al., 2008, PASJ, 60, 445\n\n\\bibitem[\\protect\\citeauthoryear{Shimajiri et al.}{2011}]{cont} Shimajiri~Y. et al., 2011, PASJ, 63, 105\n\\bibitem[\\protect\\citeauthoryear{Smirnov et al.}{1984}]{1984A&A...135..116S} {Smirnov}, G.~T., {Sorochenko} R.~L., {Pankonin} V., 1984, A\\&A, 135, 116\n\n\\bibitem[\\protect\\citeauthoryear{Sorochenko}{1965}]{soro} Sorochenko R. L., 1965, Trudy Fiz. Inst., P. N. Lebedeva Akad. Nauk USSR 28, 90\n\\bibitem[\\protect\\citeauthoryear{Wen \\& O'Dell}{1995}]{1995ApJ...438..784W} {Wen} Z., {O'Dell} C.~R., 1995, ApJ, 438, 784\n\\bibitem[\\protect\\citeauthoryear{Wilson et al.}{1997}]{1997AA...327.1177W} Wilson, T. L.; Filges L., Codella C., Reich W., Reich P., 1997, A\\&A, 327, 1177\n\\bibitem[\\protect\\citeauthoryear{Wilson \\& Pauls}{1984}]{1984A+A___138__225W} {{Wilson} T.~L., {Pauls} T.}, 1984, A\\&A, 138, 225\n\n\\bibitem[\\protect\\citeauthoryear{Wong et al.}{2011}]{magma} {Wong} T., 2011, ApJ, 197, 16\n\\bibitem[\\protect\\citeauthoryear{Young et al.}{2013}]{young} {{Young} T., {Horiuchi} S., {Green} J.~A., {Jerjen} H.,} 2013, MNRAS, 435, 3568\n\\bibitem[\\protect\\citeauthoryear{Zhao et al.}{1993}]{1993ApJ...418..235Z} {Zhao} J.-H. et al., 1993, ApJ, 418, 235\n\\bibitem[\\protect\\citeauthoryear{Zuckerman \\& Ball}{1974}]{1974ApJ...190...35Z} Zuckerman B., Ball J.~A., 1974, ApJ, 190, 35\n\\bibitem[\\protect\\citeauthoryear{Zuckerman \\& Palmer}{1970}]{1970AA.....4..244Z} Zuckerman B., Palmer P., 1970, A\\&A, 4, 244\n\\end{thebibliography}\n\n\n\n\n\n\\appendix\n\n\\section{CASA process steps}\n\\label{app:casa}\nThe raw file from Tid-70m OTF is in \\textsc{rpfits} format, imported by the \\textsc{casa} task \\textsc{sdsave}.\n\\textsc{sdlist} creates a list summary of the observations.\nA plot of pointings before position correction can be generated by \\textsc{sdplot} using parameter \\textsc{pointing} in argument \\textsc{plottype}.\nAn experimental script (\\textsc{fixDirection\\_v2.py}; see section \\ref{sec:spec}), corrects the OTF pointings using the velocity taken from the \\textsc{nmc} log files.\n$a$ and $e$ are calculated for the new positions with the \\textsc{asap} \n\\textsc{recalc\\_azel()} method on the scantable.\nOpacity correction can be applied on the scantable through the \\textsc{asap} \\textsc{opacity} method.\n\\textsc{sdplot} is used again to confirm adjustments made to the pointings.\nCalibration is completed by task \\textsc{sdcal}, with the parameter \\textsc{calmode} set to \\textsc{quotient}.\nBaseline subtraction can be applied through the command \\textsc{sdbaseline}.\nSpectra can be smoothed through the \\textsc{sdsmooth} task, using the Hanning function by default.\nTo view the spectra, the task \\textsc{sdplot} is used, setting parameter \\textsc{plot type} to \\textsc{grid}.\nAfter calibration is completed, \\textsc{sdsave} exports the data into a measurement set (MS) file.\n\n\\textsc{casa} task \\textsc{sdimaging} generates the position-position-velocity cube, setting parameter \\textsc{dochannel} to \\textsc{true}.\nThe expandable parameters of \\textsc{dochannel} are also required: \\textsc{start}, \\textsc{step} and \\textsc{nchan}.\n\\textsc{start} gives the beginning of the cube in the velocity axis; \\textsc{step} is the value for each channel; \\textsc{nchan} is the number of channels in the velocity range.\nValues for \\textsc{start}, \\textsc{step} and \\textsc{nchan} are in units of \\textsc{specunit}.\n\\textsc{Cell} is the size of each pixel: Values for the OTF maps are spacing between each scan (in Dec) and cell size along the scan derived by converting the scan rate (from the \\textsc{nmc} log) from milli degree s$^{-1}$ to arc seconds s$^{-1}$, by the number of seconds per integration.\nImage size is set by parameter \\textsc{imsize}, based on the number of samples taken per scan and number of scans across source.\n\\textsc{sdimaging} by default averages both polarisations during the imaging process.\n\nIf baseline subtraction has not been applied, continuum subtraction can be used through task \\textsc{imcont}.\nA line free channel range must be specified, before running the command.\nIntegrated intensity images can be created by using the task \\textsc{immoments}.\nThe image can be exported to a \\textsc{fits} file by task \\textsc{exportfits}.\n\n\n\n\n\n\n\\bsp\t\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 12130, "prevtext": "\n\nwhere $\\alpha_{0}$ and $t_0$ are the starting R.A.\\ and time, and $\\alpha_{i}$ and $t_i$ are the R.A.\\ and time of the current integration ($\\delta_{0}$ is the corresponding declination for $\\alpha_{0}$).\nThe new positions are written into the scan table, as well as the recalculated {\\it a} and {\\it e} for each new position.\nThe antenna temperature $T_{A}$ is obtained by bandpass correcting the raw spectrum:\n\n", "index": 5, "text": "\\begin{equation} \nT_{A}  = T_{sys}\\cdot \\frac{ON-OFF}{OFF}\n\\label{cal_quotient}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"T_{A}=T_{sys}\\cdot\\frac{ON-OFF}{OFF}\" display=\"block\"><mrow><msub><mi>T</mi><mi>A</mi></msub><mo>=</mo><mrow><msub><mi>T</mi><mrow><mi>s</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>⋅</mo><mfrac><mrow><mrow><mi>O</mi><mo>⁢</mo><mi>N</mi></mrow><mo>-</mo><mrow><mi>O</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>F</mi></mrow></mrow><mrow><mi>O</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>F</mi></mrow></mfrac></mrow></mrow></math>", "type": "latex"}]