[{"file": "1601.02370.tex", "nexttext": "\nwhere $I_f^{\\sigma}$ is the spectral emission intensity of the wave mode $\\sigma$ (either ordinary or extraordinary) and $l$ is the distance along the line of sight. The spectral emissivity $j_f^{\\sigma}$ and the absorption coefficient $\\varkappa^{\\sigma}$ for the thermal bremsstrahlung process are given by the equations \\citep[][etc.]{dul85, asc05, shi11, fle14}\n\n", "itemtype": "equation", "pos": 25590, "prevtext": "\n\\begin{article}\n\\begin{opening}\n\\title{Synthetic radio views on simulated solar flux ropes}\n\\author{A.A.~\\surname{Kuznetsov}$^{1}$\\sep\n        R.~\\surname{Keppens}$^{2}$\\sep\n\t\t\t\tC.~\\surname{Xia}$^{2}$}\n\\runningtitle{Synthetic radio views on simulated solar flux ropes}\n\\runningauthor{Kuznetsov, Keppens, and Xia}        \n\\institute{$^{1}$ Institute of Solar-Terrestrial Physics, Irkutsk 664033, Russia\n                  e-mail: \\url{a_kuzn@iszf.irk.ru}\\\\\n           $^{2}$ CmPA, Department of Mathematics, KU Leuven, BE-3001 Leuven, Belgium\n\t\t\t\t\t        e-mail: \\url{Rony.Keppens@wis.kuleuven.be} \\url{Chun.Xia@wis.kuleuven.be}}\n\\begin{abstract}\nIn this paper, we produce synthetic radio views on simulated flux ropes in the solar corona, where finite-beta magnetohydrodynamic (MHD) simulations serve to mimic the flux rope formation stages, as well as their stable endstates. These endstates represent twisted flux ropes where balancing Lorentz forces, gravity and pressure gradients determine the full thermodynamic variation throughout the flux rope. The obtained models are needed to quantify radiative transfer in radio bands, and allow us to contrast weak to strong magnetic field conditions. Field strengths of up to 100 G in the flux rope yield the radio views dominated by optically thin free-free emission. The forming flux rope shows clear morphological changes in its emission structure as it deforms from an arcade to a flux rope, both on disk and at the limb. For an active region filament channel with a field strength of up to 680 G in the flux rope, gyroresonance emission (from the third-fourth gyrolayers) can be detected and even dominates over free-free emission at the frequencies of up to 7 GHz. Finally, we also show synthetic views on a simulated filament embedded within a (weak-field) flux rope, resulting from an energetically consistent MHD simulation. For this filament, synthetic views at the limb show clear similarities with actual observations, and the transition from optically thick (below 10 GHz) to optically thin emission can be reproduced. On the disk, its dimension and temperature conditions are as yet not realistic enough to yield the observed radio brightness depressions.\n\\end{abstract} \n\\keywords{Radio Emission, Prominences $\\cdot$ Radio Emission, Active Regions $\\cdot$ Prominences, Formation and Evolution $\\cdot$ Prominences, Models $\\cdot$ Magnetohydrodynamics}\n\\end{opening}\n\n\\section{Introduction}\nThe solar corona is intricately structured magnetically, and hosts myriads of magnetic arcades, loops and twisted flux ropes. Flux ropes are vital ingredients in many dynamical models of solar eruptions, where their internal as well as external magnetic field variation can render them unstable to kink \\citep{torok05}, torus \\citep{kliem06}, or even tilt-kink \\citep{keppens14} ideal MHD instability routes. Twisted flux ropes, and the concave upward parts of their field topology, are also the preferred sites to host solar filaments.\n\nSolar filaments (also known as prominences when observed above the limb) are large masses of relatively cool ($\\lesssim 10\\,000$ K) and dense (about $10^9-10^{11}$ $\\textrm{cm}^{-3}$) plasma suspended in the hot corona \\citep{hir85, zir89, tan95, lab10, mac10, par14}. Although the filaments have been studied since the end of the XIX century, their formation and stability are not fully understood yet \\citep[e.g.,][]{par14, pri14}. Many filaments end up with a final eruption; the filament eruptions are often associated with the coronal mass ejections \\citep{mun79, gil00, sub01, gop03}, although it is not clear which of these phenomena is primary and which one is secondary. In addition, filament eruptions in active regions can play an important role in the initiation and development of, at least, some types of solar flares \\citep{ura02, gre06, gre14}.\n\nSolar flux ropes and the filaments/prominences that reside within them show distinctive emission at radio frequencies. In particular, the microwave emission bands (frequencies of about $1-30$ GHz) are well covered by the current and upcoming radio observing facilities. Radio views at these frequencies allow us to study the free-free emission and absorption properties in the solar flux ropes and filaments, or even identify gyrolayers in sufficiently strong magnetic field concentrations. Flux ropes, with or without embedded prominences, can exist in quiescent as well as in active solar regions, and can thus be characterized by very different thermodynamic and magnetic properties. In this paper, we use magnetohydrodynamic models of solar flux ropes to generate synthetic radio images at centimetric radio wavelengths.\nSimulating the thermal bremsstrahlung and gyroresonance emissions requires the knowledge of density, temperature and magnetic field variation throughout the flux rope structures. In practice, this requires using flux rope models that go beyond simplified force-free, or zero plasma beta assumptions, which by construction ignore the thermodynamic variation altogether. Nevertheless, zero-beta modeling is able to provide insight into the dominant flux rope dynamics, e.g., when studying sympathetic eruptions due to removal of overlying stabilizing flux in multiple flux rope configurations \\citep{torok11}, or in reproducing the slow rise and partial eruption phase of split filament systems using a double flux rope configuration \\citep{kliem14}. The same zero beta paradigm has been used to study how magnetic field arcades can be deformed into helical flux ropes by means of flux cancellation on the solar surface \\citep{Amari99, Mackay06, Lione02}.\n\nIn this work, we use a modern variant of these early studies, where either isothermal, finite-beta MHD, or full thermodynamically consistent MHD simulations provide density-temperature-magnetic field conditions that represent force-balanced configurations. A brief survey of current observational findings on the solar filaments/prominences and their filament channels as seen at radio wavelengths is presented in Section \\ref{s-review}. The MHD models are discussed in Section \\ref{s-mhd}, and the way to generate synthetic radio views from them is presented in Section \\ref{s-radio}. The obtained radio views on the virtual flux ropes and filaments are presented in Sections \\ref{res-isothermal} and \\ref{res-filament}, respectively. The conclusions and outlook for future work are given in Section \\ref{conclusion}.\n\n\\section{Microwave observations of filaments and flux ropes}\\label{s-review}\n\\subsection{Filaments}\nThe filaments can be observed in a broad range of wavelengths. In the H$\\alpha$ spectral line, they are seen as bright structures (prominences) above the limb or as dark filaments when observed against the solar disk. In the Extreme Ultraviolet (EUV) emission, the appearance of the filaments is wavelength-dependent as it reflects the formation temperatures of the EUV lines \\citep{par14}. In radio observations, the filaments were firstly detected at millimetric and centimetric wavelengths \\citep{kha64, kun70, kun72, dra70}, and later at lower and higher frequencies as well \\citep{kun86, bas93, mar04, per13}. To date, the most comprehensive observations have been performed in the microwave range using the Nobeyama Radioheliograph and Siberian Solar Radio Telescope, with a particular focus on the eruptive processes \\citep[etc.]{han94, gop97, gop98, han99, hor02, ura02, gop03, kun04, gre06, ali13, gop13}.\n\nThe dominant mechanism of generation/absorption of the radio emission in filaments is thermal bremsstrahlung (free-free emission and absorption); in addition, dense cores of the filaments block propagation of radio emission at the frequencies below the local plasma frequency. As a result, the appearance of the filaments in the microwave range (at the frequencies of ${\\gtrsim 1}$ GHz) is usually similar to that in H$\\alpha$: they look like dark structures (brightness depressions) when observed on the solar disk and like bright prominences when observed above the limb. \n\nAt the same time, the quantitative characteristics of the microwave emission from the filaments depend on many factors and, first of all, on the considered emission frequency. At the frequencies of about $1-30$ GHz the filaments are expected to be optically thick, i.e., their observed brightness temperatures $T_{\\mathrm{b}}$ should be nearly equal to their kinetic temperatures $T$. This has been confirmed by observations: the typical observed brightness temperatures of the filaments in the mentioned frequency range are of order of $5\\,000-15\\,000$ K both for the filaments on the disk and above the limb \\citep[etc.]{but75, rao77, kun78, rao79, kun85, kun86, han94, gop97, gop98, ura02, gop03, kun04, gre06, gol08, ali13}. When multi-frequency observations of a particular filament are available, the brigthness temperature seems to be independent on the frequency. The filaments on the disk look dark because they absorb the emission from the underlying hotter layers of the solar atmosphere (the quiet Sun emission). Since the brightness temperature of the quiet Sun $T_{\\mathrm{qS}}$ decreases with frequency, the on-disk filaments at lower frequencies, as a rule, demonstrate a higher contrast \\citep{gre06}. Another important factor is the filament temperature: e.g., at the frequency of 17 GHz the filaments on the solar disk become invisible when heated to ${\\sim 10\\,000}$ K (the quiet Sun temperature at this frequency), although they remain visible (and even become brighter) above the limb \\citep{han99, gop13}.\n\nAt higher frequencies, the free-free emission/absorption mechanism becomes less effective and at the frequencies of ${\\gtrsim 30}$ GHz the filaments can become optically thin. As a result, we obtain $T_{\\mathrm{b}}<T$ for the filaments above the limb and $T<T_{\\mathrm{b}}<T_{\\mathrm{qS}}$ (partial absorption of the quiet Sun emission) for the filaments on the solar disk. In this frequency range, the observed brightness temperatures of the filaments above the limb vary from the typical filament temperatures of $5\\,000-10\\,000$ K to much lower values. Similarly, the observed filaments on the disk vary in appearance from well-defined dark stripes to barely noticeable brightness depressions (relative to the quiet Sun level). Both the brightness temperature of the filaments above the limb and the relative brightness depression of the filaments on the disk tend to decrease with the frequency \\citep[see][etc.]{kun70, kun72, but75, kun78, rao79, iri95, kun04, gre06}. The frequency dependence of the observed brightness temperature can be used to diagnose the temperature and density of the filaments \\citep[e.g.,][]{iri95, chi01, gre06}.\n\nSince the angular resolution in the radio range is in most cases insufficient to resolve directly the filament widths, these widths are estimated using deconvolution or forward-fitting when the observations are compared with the model images convolved with the instrument beam. The filament widths inferred from the microwave observations are variable: sometimes they are nearly the same as the widths observed in H$\\alpha$ \\citep[etc.]{but75, rao79, sch81, han94}, while sometimes they exceed the widths of the H$\\alpha$ filaments by a factor of about $1-5$ \\citep[etc.]{kun72a, chi75, rao77, kun78, kun86, iri95}; the observed widths of the radio filaments tend to decrease with the frequency. Most likely, this is caused by inhomogeneous structure of the filaments, since the radio emission can be affected not only by the dense and cool filament core, but also by the transition region between the filament and the surrounding corona, where the plasma density gradually decreases and the temperature increases \\citep[e.g.,][]{kun78}; this transition in different events can be more or less sharp.\n\n\\subsection{Neutral-line associated sources}\nThe previous Section summarizes the microwave observations of well developed filaments with a cool dense core; the low temperature is the key factor affecting appearance of these filaments in the observations. At the same time, the hot overdense flux ropes (i.e., with the same temperature as the surrounding coronal plasma) are also likely to exist. For example, in the study of \\citet{xiaiso14} evolution of a helical magnetic flux rope simulated in isothermal MHD model have led to concentration of plasma and magnetic field within the flux rope. Such simulations confirm that overdense flux ropes can be formed even in completely isothermal models, i.e., the isothermal approximation is well justified during most stages of the flux rope evolution; a nearly constant temperature is maintained due to the fast thermal conduction in the lower solar corona and slow change of magnetic field there. On the other hand, formation of a cool filament requires development of the thermal instability; once the threshold for this instability is reached (which can take a long time), the filament cooling happens very quickly \\citep{xia14, kan15}. Therefore we conclude that the isothermal (or nearly isothermal) flux ropes with enhanced plasma density and magnetic field strength may be a common phenomenon in the solar corona.\n\nThe forming filament channels without filaments inside can be difficult to identify in observations. Since all filaments are located above the neutral lines of the photospheric magnetic field (although not all neutral lines give rise to filaments), we can expect some specific features associated with the neutral lines. Indeed, the so-called neutral-line-associated microwave sources (NLS) are a common phenomenon \\citep[see, e.g., the papers of][and references therein]{ura08, yas14, bak15}. As the name implies, NLS occur in the vicinity of magnetic neutral lines in active regions; they are bright, compact and relatively stationary (can live up to several days). The NLS have typical brightness temperatures of a few MK (up to $\\sim 10$ MK). The spectral observations reveal a sharp spectrum with the peak at $\\sim 5-7$ GHz and a steep decrease at higher frequencies \\citep{akh86, ali93, bog12, abramax15}; nevertheless, the brightness temperature can reach $\\sim 1-2$ MK at the frequencies of $\\sim 17-34$ GHz as well \\citep{ura00, ura08, ura06, bak15}. Such spectra cannot be explained by the free-free emission mechanism; they are consistent with the thermal gyroresonance emission in a very hot plasma (and strong magnetic field) or with the nonthermal gyrosynchrotron emission.\n\nThe physical nature and formation mechanism of the NLS are yet unknown. According to the most popular explanation, the emission is produced in the arcade of magnetic loops overarching the filament channel \\citep[][etc.]{kun81, str84, kor94}; this model is supported by observations of the NLS associated with the H$\\alpha$ filaments \\citep[][etc.]{kun77, kun80, kun81, ali82, str84, kun84, akh86, kor94}. On the other hand, the thermal free-free and/or gyroresonance emission from the flux rope (which is characterized by high plasma density and strong magnetic field) can make a significant or even dominant contribution. \\citet{akh86, sych93, ura06} have concluded that the magnetic field strength in the NLS (estimated using the photospheric magnetograms and their force-free extrapolations) is insufficient to produce the gyroresonance emission at the observed GHz frequencies; the nonthermal gyrosynchrotron emission mechanism has been proposed (although it requires a stable long-living source of accelerated electrons). However, we note that the force-free approximation is essentially inapplicable to the flux ropes. As will be shown below, the MHD processes driven by the footpoint motions of a magnetic arcade can result in formation of strong magnetic fields in the corona. Obviously, making more definite conclusions about the nature of NLS and their relation to the filament channels requires observations with higher spatial resolution than now.\n\n\\section{Simulating radio views for flux ropes and filaments}\n\\subsection{MHD models}\\label{s-mhd} \nIn the remainder of this paper, we use three-dimensional magnetohydrodynamic (MHD) models of flux ropes, without and with actual filaments embedded, to create virtual radio views at varying radio frequencies. We should note that the MHD simulations are computationally expensive and take a long time; the choice of the simulation parameters is restricted by the technical considerations as well. Therefore we have studied only a limited number of MHD models, which illustrate different regimes of the flux rope formation. The model parameters have not been chosen to fit any particular observed event, but represent several general cases; therefore, a direct quantitative comparison of our results with observations would be difficult. Nevertheless, our results demonstrate qualitatively how the flux rope evolution affects the radio emission, and how the observable features are linked to the different source parameters.\n\nThe isothermal MHD models of helical magnetic flux ropes follow the approach presented in \\citet{xiaiso14}, where they demonstrated the formation process of a large-scale flux rope in a quiet Sun region with finite plasma beta from an initially bipolar arcade. The initial arcade was extrapolated as linear force-free field from an artificial photospheric magnetogram. The deformation from a pure arcade to a flux rope configuration with overarching arcade was implemented by a combination of photospheric vortical and converging flow patterns enforced by the bottom boundary prescriptions. This ultimately led to a flux rope configuration with the magnetic field and plasma concentration within the flux rope.\n\nOur first model (the ``low-field'' model corresponding to a quiet-Sun filament channel) is the same as in the study of \\citet{xiaiso14}. In this model, the photospheric magnetogram had the extrema of $\\pm 20$ G, the computational box dimensions were 240 Mm (length), 180 Mm (width), and 120 Mm (height), and the spatial grid resolution was 0.47 Mm. The simulations were performed until the maximum plasma velocity in the domain dropped below a certain threshold \\citep[3.8 km $\\textrm{s}^{-1}$, see][]{xiaiso14}, which was considered as the endstate. The evolution of the magnetic field and plasma in this model is shown in Fig. 4 in the paper of \\citet{xiaiso14}. The resulting flux rope configuration is characterized by a low magnetic field strength typical for quiescent filament conditions: the vertical field component at the bottom of our domain, which is located at 3 Mm above the photosphere, attains values of up to $\\pm 13$ G, while the field strength in the centre of the flux rope reaches 10 G. Together with the isothermal $T=1$ MK assumption and the plasma densities of $n=10^9$ $\\textrm{cm}^{-3}$ and $1.8\\times10^9$ $\\textrm{cm}^{-3}$ at the bottom boundary and in the flux rope, respectively, this implies that free-free emission and absorption is the only relevant mechanism for the radio emission. Therefore the synthetic radio views in this case reflect only the plasma density structure from the MHD data. The isothermal MHD evolution self-consistently incorporates density changes and ultimately results in a delicate force-balance between Lorentz force, pressure gradient and gravity throughout the flux rope structure. This flux rope represents the magnetic structure of the filament channel of a quiescent filament. By taking snapshots corresponding to the times $t=27$, 53 and 80 (with the time unit chosen to be 86 seconds throughout this paper), we then obtain successive radio views on the forming flux ropes where the frames are about 38 minutes apart in real time; these radio views are presented in Section \\ref{s-quiet}.\n\nBesides the low-field case from \\citet{xiaiso14} targeting quiescent filaments, we also analyse two more cases that represent smaller flux rope configurations at increased field strengths to mimic the magnetic structure of active region filaments. A medium field strength case has been generated by a procedure analogous to the low-field one, with magnetic field strength at the photosphere level reaching $\\pm 100$ G, ultimately attaining about $60$ G in the flux rope centre. In this case, the bottom plane of the simulation box is located at 4 Mm above the photosphere representing the low corona where the field strength then reaches $\\pm 54$ G; the (constant) temperature and density are similar to the low-field model. Finally, a high field strength case has been computed as well. In this case, the magnetic field strength reaches $\\pm 1000$ G at the photosphere level, $\\pm 520$ G at the bottom plane of the simulation box (in the low corona), and about 680 G in the flux rope; the density and temperature conditions are set to $n=2\\times 10^9$ $\\textrm{cm}^{-3}$ (at the bottom plane) and $T=1.5$ MK, respectively.\n\nAs said above, the simulations setup in the medium-field and high-field cases is similar to that in the study of \\citet{xiaiso14}, but the computational box size is reduced to 120 Mm (length), 100 Mm (width), and 60 Mm (height), and the spatial resolution is reduced to 1 Mm. The reason is that the MHD simulations for an increased magnetic field strength (and the same spatial resolution) would require much shorter time steps to satisfy the stability criterion \\citep{kep03, vdH07}. Due to the limited computational resources, we choose to reduce the resolution of the stronger field cases, although this increases the numerical resistivity and reduces the spatial accuracy. Ultimately, the main difference among the three models is in the \nattained maximum field strength, while the magnetic topologies (important for later filament formation) are very similar, despite of the differences in the box size, resolution, and thermodynamic conditions. Although the flux rope formation timescales differ in the considered three cases, here we are mainly concerned with the endstates obtained. In contrast to the low-field case \\citep{xiaiso14}, the endstate in the medium- and high-field models is defined more qualitatively: as a state when the overall magnetic structure does not change anymore.\n\n\\begin{figure}\n\\centerline{\\resizebox{10.2cm}{!}{\\includegraphics{Fig-AR-FieldLines.eps}}}\n\\caption{Magnetic field lines of the medium (a) and the high (b) field\nstrength cases in their final endstates. In each panel, the red lines depict the flux rope and the yellow ones show the overlying arcade. The bottom horizontal plane of the simulation box is colored by vertical magnetic field strength and the central vertical plane shows the density distribution in units of $10^9$ $\\textrm{cm}^{-3}$.}\n\\label{figchunMH}\n\\end{figure}\n\nFigure \\ref{figchunMH} gives an impression of both the medium- and high-field strength magnetic topologies and the corresponding plasma density distributions in their final stable flux rope endstates. In the adopted numerical time units these endstates are reached at $t=50$ and $t=14$ for the medium- and high-field cases, respectively. The MHD simulation results are used below to produce typical radio views for the flux ropes located either on the solar disk or at the limb; the synthetic radio views are presented in Sections \\ref{ARMF} and \\ref{ARHF} for the medium- and high-field models, respectively.\n\nWe should note that our models are based on the full set of MHD equations and thus go beyond the oft-used force-free approximation for the coronal magnetic field. This allows formation of strong magnetic fields in the corona; in particular, in the high-field model of an active region the magnetic field in the flux rope can become stronger than at the bottom of the simulation box. In turn, strong magnetic fields can result in formation of coronal gyroresonance emission sources.\n\nThe final synthetic radio maps we present are based on the endstate of the fully thermodynamically consistent MHD study \\citep{xia14}. In this case the low-field isothermal model was used as an input to study how optically thin radiative losses could trigger a full prominence formation within the dipped magnetic field region of the flux rope. A stable prominence structure with overall dimensions of $46.4\\times 13.1\\times 4.8$ Mm was established with the average density of $4.7 \\times 10^9$ $\\mathrm{cm}^{-3}$, i.e., well above the surrounding coronal density of $1.6\\times 10^8$ $\\mathrm{cm}^{-3}$. Although the structure is relatively small and low in mass, its temperature contrast with the corona is realistic with a $\\sim 20\\,000$ K filament embedded in a 1 MK corona. The magnetic topology and plasma distribution corresponding to the final state of the filament evolution are shown in Figure \\ref{filamentxc}. In this work, this low-field model with embedded prominence is used to generate the first synthetic views on simulated filaments (see Section \\ref{res-filament}).\n\n\\begin{figure}\n\\resizebox{12cm}{!}{\\includegraphics{Fig-Filament-FieldLines.eps}}\n\\caption{A filament embedded in a flux rope. The representative field lines are colored by temperature from blue to red. The filament is colored by density in a rainbow of colors and is presented by edges of grid cells where density exceeds $10^9$ $\\textrm{cm}^{-3}$. The bottom plane is colored by vertical magnetic field in grayscale.}\n\\label{filamentxc}\n\\end{figure}\n\n\\subsection{Emission mechanism}\\label{s-radio}\nAs has been said above, the dominant mechanism determining the appearance of the solar filaments at radio wavelengths is the free-free emission and absorption. This process can be described by the radiation transfer equation\n\n", "index": 1, "text": "\\begin{equation}\\label{transfer}\n\\frac{\\mathrm{d}I_f^{\\sigma}}{\\mathrm{d}l}=j_f^{\\sigma}-\\varkappa^{\\sigma}I_f^{\\sigma},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\mathrm{d}I_{f}^{\\sigma}}{\\mathrm{d}l}=j_{f}^{\\sigma}-\\varkappa^{\\sigma}%&#10;I_{f}^{\\sigma},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msubsup><mi>I</mi><mi>f</mi><mi>σ</mi></msubsup></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>l</mi></mrow></mfrac><mo>=</mo><mrow><msubsup><mi>j</mi><mi>f</mi><mi>σ</mi></msubsup><mo>-</mo><mrow><msup><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\varkappa</mtext></merror><mi>σ</mi></msup><mo>⁢</mo><msubsup><mi>I</mi><mi>f</mi><mi>σ</mi></msubsup></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02370.tex", "nexttext": "\nwhere $f$ is the emission frequency, $N_\\sigma$ is the refraction index (under the considered conditions, it is close to unity for both wave modes), $T$ is the plasma temperature, $n_{\\mathrm{e}}$ is the electron concentration, the factor $\\left<Z^2\\right>$ describes the average ion charge and $\\ln\\Lambda$ is the Coulomb logarithm. In the solar corona, the ion charge factor can be taken to be $\\left<Z^2\\right>=1.146$ at the temperatures above $35\\,000$ K (the helium ionization temperature) or $\\left<Z^2\\right>=1$ below that temperature. The Coulomb logarithm (in the CGS units) equals approximately\n\n", "itemtype": "equation", "pos": 26092, "prevtext": "\nwhere $I_f^{\\sigma}$ is the spectral emission intensity of the wave mode $\\sigma$ (either ordinary or extraordinary) and $l$ is the distance along the line of sight. The spectral emissivity $j_f^{\\sigma}$ and the absorption coefficient $\\varkappa^{\\sigma}$ for the thermal bremsstrahlung process are given by the equations \\citep[][etc.]{dul85, asc05, shi11, fle14}\n\n", "index": 3, "text": "\\begin{equation}\n\\varkappa^{\\sigma}=\\frac{8e^6}{3\\sqrt{2\\pi}c(m_{\\mathrm{e}}k_{\\mathrm{B}})^{3/2}}\\frac{n_{\\mathrm{e}}^2\\left<Z^2\\right>\\ln\\Lambda}{N_{\\sigma}f^2T^{3/2}},\\qquad\nj_f^{\\sigma}=\\varkappa^{\\sigma}k_{\\mathrm{B}}T\\frac{N_{\\sigma}^2f^2}{c^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\varkappa^{\\sigma}=\\frac{8e^{6}}{3\\sqrt{2\\pi}c(m_{\\mathrm{e}}k_{\\mathrm{B}})^{%&#10;3/2}}\\frac{n_{\\mathrm{e}}^{2}\\left&lt;Z^{2}\\right&gt;\\ln\\Lambda}{N_{\\sigma}f^{2}T^{3%&#10;/2}},\\qquad j_{f}^{\\sigma}=\\varkappa^{\\sigma}k_{\\mathrm{B}}T\\frac{N_{\\sigma}^{%&#10;2}f^{2}}{c^{2}},\" display=\"block\"><mrow><mrow><mrow><msup><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\varkappa</mtext></merror><mi>σ</mi></msup><mo>=</mo><mrow><mfrac><mrow><mn>8</mn><mo>⁢</mo><msup><mi>e</mi><mn>6</mn></msup></mrow><mrow><mn>3</mn><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><mo>⁢</mo><mi>c</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mi mathvariant=\"normal\">e</mi></msub><mo>⁢</mo><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mfrac><mo>⁢</mo><mfrac><mrow><msubsup><mi>n</mi><mi mathvariant=\"normal\">e</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo>⟨</mo><msup><mi>Z</mi><mn>2</mn></msup><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mi mathvariant=\"normal\">Λ</mi></mrow></mrow><mrow><msub><mi>N</mi><mi>σ</mi></msub><mo>⁢</mo><msup><mi>f</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>T</mi><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mfrac></mrow></mrow><mo rspace=\"22.5pt\">,</mo><mrow><msubsup><mi>j</mi><mi>f</mi><mi>σ</mi></msubsup><mo>=</mo><mrow><msup><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\varkappa</mtext></merror><mi>σ</mi></msup><mo>⁢</mo><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mfrac><mrow><msubsup><mi>N</mi><mi>σ</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>f</mi><mn>2</mn></msup></mrow><msup><mi>c</mi><mn>2</mn></msup></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02370.tex", "nexttext": "\nNote that the emission does not propagate (its absorption coefficient $\\varkappa^{\\sigma}$ goes to infinity) at the frequencies below the plasma frequency\\footnote{More exactly, the cutoff frequency of the extraordinary mode slightly exceeds the plasma frequency. However, under the considered conditions this difference is negligible.}.\n\nAnother mechanism that can be responsible for the radio emission of solar filaments and filament channels is the gyroresonance emission of the thermal electrons gyrating in magnetic field \\citep[e.g.,][]{zhe70, fle14}. In this case, the emission (and/or absorption) takes place at narrow resonance layers where the emission frequency coincides with a harmonic of the local electron cyclotron frequency $f_{\\mathrm{B}}$ (i.e., $f=sf_{\\mathrm{B}}$, $s=1, 2, 3,\\ldots$). The change of the emission intensity at a given gyrolayer can be described by the equation\n\n", "itemtype": "equation", "pos": 26964, "prevtext": "\nwhere $f$ is the emission frequency, $N_\\sigma$ is the refraction index (under the considered conditions, it is close to unity for both wave modes), $T$ is the plasma temperature, $n_{\\mathrm{e}}$ is the electron concentration, the factor $\\left<Z^2\\right>$ describes the average ion charge and $\\ln\\Lambda$ is the Coulomb logarithm. In the solar corona, the ion charge factor can be taken to be $\\left<Z^2\\right>=1.146$ at the temperatures above $35\\,000$ K (the helium ionization temperature) or $\\left<Z^2\\right>=1$ below that temperature. The Coulomb logarithm (in the CGS units) equals approximately\n\n", "index": 5, "text": "\\begin{equation}\n\\ln\\Lambda\\simeq\\left\\{\\begin{array}{ll}\n18.2+1.5\\ln T-\\ln f, & T<2\\times 10^5~\\textrm{K},\\\\\n24.573+\\ln T-\\ln f, & T>2\\times 10^5~\\textrm{K}.\n\\end{array}\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\ln\\Lambda\\simeq\\left\\{\\begin{array}[]{ll}18.2+1.5\\ln T-\\ln f,&amp;T&lt;2\\times 10^{5%&#10;}~{}\\textrm{K},\\\\&#10;24.573+\\ln T-\\ln f,&amp;T&gt;2\\times 10^{5}~{}\\textrm{K}.\\end{array}\\right.\" display=\"block\"><mrow><mrow><mi>ln</mi><mo>⁡</mo><mi mathvariant=\"normal\">Λ</mi></mrow><mo>≃</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mn>18.2</mn><mo>+</mo><mrow><mn>1.5</mn><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mi>T</mi></mrow></mrow></mrow><mo>-</mo><mrow><mi>ln</mi><mo>⁡</mo><mi>f</mi></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>T</mi><mo>&lt;</mo><mrow><mrow><mn>2</mn><mo>×</mo><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mn>5</mn></msup></mpadded></mrow><mo>⁢</mo><mtext>K</mtext></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mn>24.573</mn><mo>+</mo><mrow><mi>ln</mi><mo>⁡</mo><mi>T</mi></mrow></mrow><mo>-</mo><mrow><mi>ln</mi><mo>⁡</mo><mi>f</mi></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>T</mi><mo>&gt;</mo><mrow><mrow><mn>2</mn><mo>×</mo><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mn>5</mn></msup></mpadded></mrow><mo>⁢</mo><mtext>K</mtext></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02370.tex", "nexttext": "\nwhere $(I_f^{\\sigma})_{\\mathrm{in}}$ and $(I_f^{\\sigma})_{\\mathrm{out}}$ are the emission intensities before and after the gyrolayer, and $\\tau^{\\sigma}_s$ is the gyrolayer's optical depth:\n\n", "itemtype": "equation", "pos": 28055, "prevtext": "\nNote that the emission does not propagate (its absorption coefficient $\\varkappa^{\\sigma}$ goes to infinity) at the frequencies below the plasma frequency\\footnote{More exactly, the cutoff frequency of the extraordinary mode slightly exceeds the plasma frequency. However, under the considered conditions this difference is negligible.}.\n\nAnother mechanism that can be responsible for the radio emission of solar filaments and filament channels is the gyroresonance emission of the thermal electrons gyrating in magnetic field \\citep[e.g.,][]{zhe70, fle14}. In this case, the emission (and/or absorption) takes place at narrow resonance layers where the emission frequency coincides with a harmonic of the local electron cyclotron frequency $f_{\\mathrm{B}}$ (i.e., $f=sf_{\\mathrm{B}}$, $s=1, 2, 3,\\ldots$). The change of the emission intensity at a given gyrolayer can be described by the equation\n\n", "index": 7, "text": "\\begin{equation}\\label{GR}\n(I_f^{\\sigma})_{\\mathrm{out}}=(I_f^{\\sigma})_{\\mathrm{in}}\\exp(-\\tau^{\\sigma}_s)+\\frac{N_{\\sigma}^2f^2}{c^2}k_{\\mathrm{B}}T\\left[1-\\exp(-\\tau^{\\sigma}_s)\\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"(I_{f}^{\\sigma})_{\\mathrm{out}}=(I_{f}^{\\sigma})_{\\mathrm{in}}\\exp(-\\tau^{%&#10;\\sigma}_{s})+\\frac{N_{\\sigma}^{2}f^{2}}{c^{2}}k_{\\mathrm{B}}T\\left[1-\\exp(-%&#10;\\tau^{\\sigma}_{s})\\right],\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>I</mi><mi>f</mi><mi>σ</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mi>out</mi></msub><mo>=</mo><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>I</mi><mi>f</mi><mi>σ</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mi>in</mi></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><msubsup><mi>τ</mi><mi>s</mi><mi>σ</mi></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mrow><msubsup><mi>N</mi><mi>σ</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>f</mi><mn>2</mn></msup></mrow><msup><mi>c</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><msubsup><mi>τ</mi><mi>s</mi><mi>σ</mi></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02370.tex", "nexttext": "\nIn the above equation, $\\theta$ is the viewing angle (the angle between the local magnetic field and the line of sight), $T_{\\sigma}$ and $L_{\\sigma}$ are the components of the wave polarization vector \\citep[see, e.g.,][]{fle10}, and $L_{\\mathrm{B}}$ is the inhomogeneity scale of the magnetic field in the direction along the line of sight. Evidently, the gyroresonance emission requires a sufficiently strong magnetic field; in our simulations, it has been found to be important only in the high-field active region model (see Section \\ref{ARHF}). Under the conditions typical of the solar corona, the gyrolayers corresponding to the harmonics with $s\\le 3$ or $s>3$ are expected to be optically thick ($\\tau_s^{\\sigma}\\gg 1$) or optically thin ($\\tau_s^{\\sigma}\\ll 1$), respectively. As a result, the observed emission (with the brightness temperature equal to the local plasma temperature) is expected to be produced at the third gyrolayer, although under certain conditions other cyclotron harmonics can become dominant.\n\nWe calculate the two-dimensional emission maps by numerical integration of the radiation transfer equations (\\ref{transfer}, \\ref{GR}) along the selected lines of sight (corresponding to the image pixels). The initial intensity (at the far boundary of the simulation box) is set either to zero (for the filaments and flux ropes located at the limb) or to the typical emission intensity of the quiet Sun (for the sources on the solar disk); the average radio spectrum of the quiet Sun is taken from the paper of \\citet{lan08}. The radio emission is calculated using the numerical code developed by \\citet{fle14}, which takes into account the contributions of both the free-free and gyroresonance emission mechanisms. In addition to the above mentioned factors, this code automatically calculates the local tem\\-pe\\-ra\\-tu\\-re-dependent ionization degree (which affects the electron concentration $n_{\\mathrm{e}}$) using the Saha equation \\citep{saha20}; for the typical densities in the solar corona ($n\\simeq 10^8-10^{11}$ $\\textrm{cm}^{-3}$), the ionization degree rises steeply from nearly zero to nearly 100\\% at the temperature of about $(5-7)\\times 10^3$ K.\n\n\\section{Synthetic images}\nAs follows from observations and is supported by theory, the appearance of the filaments and filament channels in radio emission is frequency-dependent. On the other hand, the angular resolution of the radio telescopes is also frequency-dependent; in particular, in the decimetric/metric range both the existing instruments (e.g., the Nan\\c{c}ay Radioheliograph) and the instruments expected soon will be unable to resolve any source structure for the considered MHD models. Therefore we consider here only the microwave emission (at the frequencies of about $3-30$ GHz). This frequency range is covered by such imaging instruments as the Siberian Solar Radio Telescope (5.7 GHz) and Nobeyama Radioheliograph (17 and 34 GHz); several instruments are currently under construction, such as the Expanded Owens Valley Solar Array ($1-18$ GHz), Upgraded Siberian Solar Radio Telescope ($3-24$ GHz) and Chinese Spectral Radioheliograph ($0.4-15$ GHz).\n\n\\begin{figure}\n\\includegraphics{Fig-Quiet-17GHz.eps}\n\\caption{Simulated radio images (at the frequency of 17 GHz) of the quiet-Sun filament channel at different times. Top row: the source region is located at the center of the solar disk; the dashed line represents the neutral line of the photospheric magnetic field. Bottom row: the source region is located at the limb. The brighthess temperature in each image varies from $T_{\\mathrm{b}\\,\\min}$ (black) to $T_{\\mathrm{b}\\,\\max}$ (white); the corresponding range of brightness temperatures $T_{\\mathrm{b}}=[T_{\\mathrm{b}\\,\\min}, T_{\\mathrm{b}\\,\\max}]$ is given at the right side of each panel.}\n\\label{QuietEvol}\n\\end{figure}\n\n\\subsection{Emission from an isothermal filament channel}\\label{res-isothermal}\n\\subsubsection{Quiet-Sun filament channel (low magnetic field)}\\label{s-quiet}\nFigure \\ref{QuietEvol} demonstrates the simulation results for the quiet-Sun filament channel model. In this model, the magnetic field is weak (less than 20 G), the plasma density varies from $10^8$ to $3\\times 10^9$ $\\textrm{cm}^{-3}$; the plasma temperature is set to 1 MK. Three time moments illustrating different stages of the flux rope evolution are shown, in the simulation they are about 38 minutes apart. We have found that the free-free emission at the frequencies above 1 GHz is optically thin see the spectra in Figure \\ref{SpectraFinalState}); the contribution of the gyroresonance emission is negligible. Therefore the computed images at all considered frequencies are nearly the same (except of different values of the brightness temperature) and coincide with the EUV images as well. In Figure \\ref{QuietEvol}, the frequency of 17 GHz (one of the working frequencies of the Nobeyama Radioheliograph) is chosen.\n\nIf the filament channel is observed from above (i.e., located at the center of the solar disk) then at the beginning of the evolution process we see a bright stripe aligned along the photospheric neutral line and two darker areas to right and left from it. Later, the strongest emission gradually concentrates in two bright spots located at some distance from the neutral line; note an increase of the maximum radio brightness with time. However, the emission intensity is still relatively low: the relative radio brightening (after subtraction of the quiet Sun emission level) does not exceed 7500 K at 17 GHz and 90\\,000 K at 5 GHz. Although such brightenings can be detectable, they are too weak in comparison with the observed neutral-line-associated sources in active regions.\n\nIf the source region is located at the solar limb then the images are dominated by two bright spots at the footpoints of the flux rope. The coronal emission is much weaker, which makes it hard to detect. Nevertheless, one can notice a faint arc-like structure that slowly ascends with time.\n\n\\begin{figure}\n\\includegraphics{Fig-AR-MF-17GHz.eps}\n\\caption{Simulated radio images (at the frequency of 17 GHz) of the active-region filament channel (the medium-field model, with the magnetic field of up to 100 G) at different times. Top row: the source region is located at the center of the solar disk; the dashed line represents the neutral line of the photospheric magnetic field. Bottom row: the source region is located at the limb. At the right side of each panel, the range of brightness temperatures in the image is given.}\n\\label{ARMFevol}\n\\end{figure}\n\n\\subsubsection{Active-region filament channels: medium to high field cases}\n\\paragraph{Medium-field model}\\label{ARMF}\nFigure \\ref{ARMFevol} demonstrates the evolution of an active-region filament channel. The magnetic field strength in the considered model can reach 100 G, which exceeds the typical values for the quiet Sun, but is still relatively weak for the solar active regions. The plasma density varies from $2\\times 10^8$ to $5\\times 10^9$ $\\textrm{cm}^{-3}$; the plasma temperature is set to 1 MK. Like in the previous case, the free-free emission at the frequencies above 1 GHz is optically thin and the contribution of the gyroresonance emission is negligible; therefore we show only the 17 GHz images. The frames are taken at times $t=33$, 66 and 100, i.e., they also cover the deformation phase before the flux rope formation (the flux rope reaches a stable configuration at $t=50$, as shown in Figure \\ref{figchunMH}, top panel).\n\nAlthough the simulation box is now smaller than in the previous model, the source structure and evolution are qualitatively similar. Initially, the emission is produced mainly in a narrow stripe along the photospheric neutral line (when seen from above), and later concentrates in two bright spots corresponding to the footpoints of the forming flux rope. The brightness temperatures are also similar to the previous model, i.e., much lower than in the observed neutral-line-associated microwave sources. The limb view demonstrates a gradually rising arc-like structure.\n\n\\paragraph{High-field model}\\label{ARHF}\nFigures \\ref{ARHFevol17}--\\ref{ARHFfinal3} correspond to the high-field model of the active-region filament channel (Figure \\ref{figchunMH}, bottom panel). Now, the magnetic field is stronger (up to 1000 G at the solar surface and up to 680 G within the flux rope). The plasma density varies from $6\\times 10^7$ to $2\\times 10^{10}$ $\\textrm{cm}^{-3}$; the plasma temperature is set to 1.5 MK.\n\n\\begin{figure}\n\\centerline{\\includegraphics{Fig-AR-HF-17GHz.eps}}\n\\caption{Simulated radio images (at the frequency of 17 GHz) of the active-region filament channel (the high-field model, with the magnetic field of up to 1000 G) at different times. Top row: the source region is located at the center of the solar disk; the dashed line represents the neutral line of the photospheric magnetic field. Bottom row: the source region is located at the limb. At the right side of each panel, the range of brightness temperatures in the image is given.}\n\\label{ARHFevol17}\n\\end{figure}\n\nFigure \\ref{ARHFevol17} demonstrates the evolution of the microwave emission at the frequency of 17 GHz, where the contribution of the gyroresonance emission is negligible (i.e., only the free-free emission is present). Like in the previous cases, the microwave images reflect the spatial distribution of the plasma within the simulated active region. The top view also reveals some similarity to the models with lower magnetic field: initially, the emission is concentrated in a short bright stripe aligned approximately along the photospheric neutral line; later, this stripe turns slowly with respect to the photospheric neutral line, and its ends gradually become brighter. In the limb view, we can see that the emission is produced mainly at some height above the solar surface; the evolution of the microwave images reflects the formation of an overdense region in the corona. As the plasma is accumulated within the flux rope, the emission brightness temperature gradually increases. This increase is much faster than in the previous (low-field and medium-field) cases, and the resulting brightness temperature is much higher as well: it can exceed 0.15 MK. Evidently, this is caused by the higher concentration of plasma within the flux rope (up to $2\\times 10^{10}$ $\\textrm{cm}^{-3}$). As a result, the free-free emission (although still optically thin, with $T_{\\mathrm{b}}\\ll T$) becomes much brighter. Our simulations indicate that, at least, some of the observed neutral-line associated sources with moderate brightness temperatures \\citep[see, e.g.,][]{akh86, ura00, ura06, gre13} can be explained by the purely thermal free-free emission from overdense flux ropes.\n\nThe simulated images at higher frequencies (above 17 GHz) are not shown because they are nearly the same as in Figure \\ref{ARHFevol17}, except of different values of the brightness temperature; this behaviour is typical of the optically thin free-free emission.\n\n\\begin{figure}\n\\centerline{\\includegraphics{Fig-AR-HF-5GHz.eps}}\n\\caption{Same as in Figure \\protect\\ref{ARHFevol17}, for the emission frequency of 5 GHz.}\n\\label{ARHFevol5}\n\\end{figure}\n\nThe contribution of the gyroresonance emission becomes noticeable (or even dominant) at the frequencies below $7-8$ GHz (see the spectra in Figure \\ref{SpectraFinalState}), which affects the microwave images dramatically. Figure \\ref{ARHFevol5} demonstrates the evolution of the microwave emission at the frequency of 5 GHz. Initially (at $t=5$ and 10), when the magnetic field in the core region of the forming flux rope is relatively weak, the emission at the considered frequency is produced mainly at the fourth gyrolayer. This gyrolayer is optically thin, i.e., the emission brightness temperature is lower than the plasma temperature; nevertheless, the contribution of the gyroresonance emission far exceeds that of the free-free emission. As a result, the microwave images reflect mainly the structure of the magnetic field in the active region. As the flux rope grows and its magnetic field strength increases, the third gyrolayer becomes the dominant emission source at the considered frequency; this gyrolayer is optically thick, i.e., the emission brightness temperature approaches the plasma temperature of 1.5 MK. At the final stage of the filament channel evolution (at $t=14$), the brightest (saturated) areas in the simulated microwave images represent the projections of the third gyrolayer, i.e., of the corresponding magnetic field strength isosurface ($B=595$ G for the emission frequency of 5 GHz). Note that, as can be seen in the limb view at $t=14$, this isosurface is located at some height in the corona and separated from the bottom of the simulation box. Such geometry reflects the above-mentioned fact that the considered model is not force-free; as a result, concentration of the magnetic field within the flux rope can create field strengths higher than in the lower layers. This effect enables generation of the neutral-line-associated sources due to the gyroresonance emission mechanism even in the active regions where the photospheric magnetic fields seem to be insufficient for that \\citep[cf.][]{akh86, sych93, ura06}.\n\n\\begin{figure}\n\\centerline{\\includegraphics{Fig-AR-HF-3GHz.eps}}\n\\caption{Simulated radio images of the active-region filament channel (the high-field model, same as in Figures \\protect\\ref{ARHFevol17}--\\protect\\ref{ARHFevol5}, at $t=14$) at the frequency of 3 GHz. Left: the source region is located at the center of the solar disk; right: the source region is located at the limb.}\n\\label{ARHFfinal3}\n\\end{figure}\n\nFigure \\ref{ARHFfinal3} shows the simulated radio images at the frequency of 3 GHz (only the final state of the simulation at $t=14$ is shown). Again, the emission is produced mainly at the third gyrolayer. The brightest (saturated) areas in the images reflect the shape of this gyrolayer that corresponds now to the $B=357$ G isosurface; the brightness temperature reaches the plasma temperature of 1.5 MK.\n\nThe above simulations demonstrate that the gyroresonance emission from a hot dense flux rope with a strong magnetic field can be responsible, at least, for some of the observed neutral-line-associated microwave sources in the solar active regions. The brightness temperature of the emission in our simulations reaches 1.5 MK, which equals the assumed plasma temperature in the considered model. Such brightness temperatures are quite common for the observed neutral-line-associated sources, as reported, e.g., by \\citet{kun80, kun81, kun84, akh86, ali92, ura08, bak15}. On the other hand, some observations have reported considerably higher brightness temperatures of the neutral-line-associated sources: up to $\\sim 6-8$ MK \\citep[][etc.]{ali82, akh86, sych93}. Evidently, such sources would require a higher plasma temperature, which seems to be feasible in the active regions \\citep{yas14}.\n\nAs said above, the magnetic field strength in the considered model (in the flux rope) can reach 680 G. Therefore the gyroresonance emission mechanism is limited by the frequencies of up to $5.7-7.6$ GHz (for the emission at the third-fourth cyclotron harmonic). To produce emission at higher frequencies, we need a stronger magnetic field. For example, the emission at 17 GHz requires the field strength of $2024-1518$ G (again, for the emission at the third-fourth cyclotron harmonic), which is quite typical of the solar active regions. \n\n\\subsection{Emission from a non-isothermal filament}\\label{res-filament}\n\\citet{xia14} reported the formation of a simulated filament by in situ condensation in a pre-existing flux rope using thermodynamic MHD simulations. The final stable state is shown in Figure \\ref{filamentxc}. We have calculated the radio emission from this model filament, and Figures \\ref{FilamentFinal}--\\ref{FilamentFinalSM} demonstrate the simulated radio images at three frequencies; the final stage of the filament evolution is shown. The plasma density in the filament reaches $10^{10}$ $\\textrm{cm}^{-3}$ and the temperature can drop to about $20\\,000$ K. The magnetic field in the simulation box does not exceed 11 G; therefore the contribution of the gyroresonance emission is negligible. The chosen frequencies correspond to the working frequencies of the Siberian Solar Radio Telescope (5.7 GHz) and the Nobeyama Radioheliograph (17 and 34 GHz).\n\n\\begin{figure}\n\\includegraphics{Fig-Filament.eps}\n\\caption{Simulated radio images of the filament at three frequencies. Top row: the source region is located at the center of the solar disk. Bottom row: the source region is located at the limb. At the right side of each panel, the range of brightness temperatures in the image is given.}\n\\label{FilamentFinal}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics{Fig-Filament-Smooth.eps}\n\\caption{Simulated radio images of the filament (same as in Figure \\protect\\ref{FilamentFinal}) convolved with the instrumental response functions at different frequencies. At the right side of each panel, the range of brightness temperatures in the image is given.}\n\\label{FilamentFinalSM}\n\\end{figure}\n\nFigure \\ref{FilamentFinal} shows the non-smoothed images. In addition, to account for a limited resolution of the existing radio telescopes, the calculated emission maps were convolved with the model (symmetric Gaussian-shaped) instrumental response functions. For the filaments at the limb, the image smoothing procedure takes into account the contribution of the solar disk (with the typical intensity of the quiet Sun) at the corresponding (left) boundary of the image. The beam widths are taken to be 21'', 10'' and 5'' at the frequencies of 5.7, 17 and 34 GHz, respectively. The resulting (smoothed) radio maps are shown in Figure \\ref{FilamentFinalSM}.\n\nSince the model filament is hotter than real ones ($T>20\\,000$ K), the filament on the disk looks brighter than the underlying chromosphere. In addition, the estimation of $T\\sim 20\\,000$ K refers only to the central part of the filament, while the plasma in the transition region between the filament and the surrounding corona is much hotter and still has a sufficiently high density. As a result, this transition region makes a dominant contribution to the radio emission, which is seen especially well in the non-smoothed image at 5.7 GHz in Figure \\ref{FilamentFinal}; the brightness temperature reaches 49\\,000 K. Smoothing due to the limited spatial resolution removes this fine filament structure and lowers the image contrast (see Figure \\ref{FilamentFinalSM}). In general, the simulated radio images at the disk center look qualitatively different from the observed ones due to the higher filament temperature. Nevertheless, if the filament is observed against a bright active region \\citep[like, e.g., in the event reported by][]{gop13}, it will appear as a darker stripe.\n\nIn contrast, the filament above the limb looks qualitatively similar to the observed ones, i.e., like a bright prominence (although the brightness temperatures are higher than in real observations). At the frequencies of $\\lesssim 10$ GHz, the filament is optically thick and its brightness temperature (in the non-smoothed images) reflects an effective temperature of the transition region between the filament and corona ($\\sim 42\\,000$ K at 5.7 GHz). At higher frequencies, the filament becomes optically thin. From the non-smoothed images at 17 and 34 GHz we can conclude that its brightness temperature decreases with frequency $f$ approximately as $T_{\\mathrm{b}}\\propto f^{-2}$; this behaviour is typical of the optically thin free-free emission and has been detected in the multi-frequency observations of solar filaments. The visible structure of the filament at 17 and 34 GHz (again, in non-smoothed images) reflects the plasma and temperature distribution. Since the considered model filament is relatively small, convolving the simulated images with the instrument response functions removes any fine structure (see Figure \\ref{FilamentFinalSM}); at lower frequencies, the filament merges with the solar disk.\n\n\\subsection{Comparison of the models}\nAs has been said above, the parameters of our MHD models have been chosen to illustrate different regimes of the flux rope formation. Besides the different magnetic field strengths, these models can have (due to the numerical restrictions) different simulation box sizes and different initial plasma parameters. Therefore a direct quantitative comparison of the models is hardly possible. Nevertheless, we summarize here some representative quantities in order to provide a more comprehensive picture of our simulations and to analyze general trends.\n\n\\begin{figure}\n\\centerline{\\includegraphics{Fig-LC-a1.eps}\\includegraphics{Fig-LC-a2.eps}}\n\\centerline{\\includegraphics{Fig-LC-b.eps}}\n\\centerline{\\includegraphics{Fig-LC-c.eps}}\n\\caption{Temporal evolution of the radio emission from the simulated flux ropes (located at the center of the solar disk). The relative radio brightening is shown, where the background level $T_{\\mathrm{b0}}$ corresponds to an unperturbed unmagnetized corona. a) The quiet-Sun filament channel (low-field model); a$'$) the simulated filament (no time dependence); b) the medium-field active-region filament channel model; c) the high-field active-region filament channel model. Solid lines: emission from a flux rope footpoint; dashed lines: emission from the flux rope center. In panel (a$'$), the asterisks ($\\ast$) show the emission from the center of the simulated filament in its final stable state.}\n\\label{LightCurves}\n\\end{figure}\n\nFigure \\ref{LightCurves} demonstrates the temporal evolution of the flux ropes. Namely, we plot here the microwave light curves at two frequencies (5 and 17 GHz) for two chosen locations (pixels) in the image plane; the flux ropes are assumed to be located at the center of the solar disk. The flux rope center corresponds to the coordinates $x=0$, $y=0$ in Figures \\ref{QuietEvol}--\\ref{FilamentFinalSM} (top views), while the tentative flux rope footpoint location at each time is defined as the point of the brightest optically thin radio emission. The light curves for three isothermal models are shown; in the top row of Figure \\ref{LightCurves} we show also the corresponding brightness temperatures for the non-isothermal filament model (the endstate and the central pixel only). The background (initial) emission is subtracted, i.e., the values in Figure \\ref{LightCurves} represent the relative microwave brightening caused by the plasma and magnetic field concentration.\n\nEvidently, different models have different evolution timescales: in the models with stronger magnetic field, the flux ropes are developing faster. As has been said above, the microwave emission in the low- and medium-field models is produced due to the free-free mechanism in the optically thin regime; as a result, the 5 and 17 GHz light curves mimic each other (they differ by a constant factor). The emissions from the flux rope center and from the footpoints demonstrate different dynamics; at later stages of the evolution, the emission from the footpoints region becomes considerably brighter due to larger projected column density (for the considered orientation). In contrast, in the high-field model at low frequencies the gyroresonance emission mechanism becomes increasingly dominant with time; at later stages of the evolution, the emission brightness temperature at $\\lesssim 5$ GHz approaches the plasma temperature (both at the flux rope center and at the footpoints). The intensity of the optically thin free-free emission (e.g., at 17 GHz) in this model steadily increases with time, with a relatively low contrast between the flux rope center and the footpoints. Finally, the emision brightness temperatures for the filament core are higher than the corresponding values for the isothermal low-field flux rope, due to both the higher plasma density and the lower temperature in the filament.\n\n\\begin{figure}\n\\includegraphics{Fig-Spectra-a.eps}\n\\includegraphics{Fig-Spectra-b.eps}\n\\caption{\\bf Spectra of the radio emission from the simulated flux ropes (located at the center of the solar disk) in their endstates. a) Emission from the flux rope center (emission from the center of the simulated filament is also shown); b) emission from a flux rope footpoint.}\n\\label{SpectraFinalState}\n\\end{figure}\n\nFigure \\ref{SpectraFinalState} demonstrates several examples of broadband microwave spectra of the simulated flux ropes and the filament (in their endstates). Like in the previous Figure, the flux ropes are assumed to be located at the center of the solar disk; the emissions from the flux rope center and footpoint are considered. The typical spectrum of the quiet Sun \\citep{lan08} is plotted for reference. We can see that the spectra for the low- and high-field models almost coincide; they look as the typical isothermal free-free spectra (although the plasma densities can be somewhat different in different models and parts of the flux rope). In the high-field model, the spectra include the optically thick gyroresonance part corresponding to the third gyrolayer (at the frequencies of up to $5-6$ GHz), the optically thin gyroresonance part corresponding to the fourth gyrolayer (up to $7-8$ GHz) and the optically thin free-free part (at higher frequencies); such spectral structure can be potentially used for diagnosing the coronal magnetic field, provided that we have observations with sufficiently high spectral and spatial resolutions. Finally, the filament spectrum reflects the dominant emission mechanism in that model, i.e., the free-free emission in a multi-thermal source.\n\n\\section{Conclusions and outlook}\\label{conclusion}\nWe have demonstrated the ability to generate virtual radio views on solar flux ropes from MHD simulations, where full thermodynamic information is available. They can be contrasted with the actual radio views at different frequencies, and may serve to verify inversions (i.e., estimates of the field strengths and density-tem\\-pe\\-ra\\-tu\\-re conditions) made from the radio data. We have shown how the views for different orientations (either on the disk or at the limb) can be produced, with (possibly) taking into account the instrument-specific viewing conditions.\n\nThe flux ropes with low to medium magnetic field strengths produce radio emission due to the thermal bremsstrahlung process; a deformation from an arcade to a flux rope configuration is seen as a clear change from a photospheric-inversion-line-aligned emission feature to a footpoint-dominated double-spot pattern. At higher field strengths, the gyroresonance emission mechanism dominates at $\\lesssim 7$ GHz; the resulting radio views can be associated with the frequently observed neutral-line-associated microwave sources. The medium-field model representing the intermediate case (with the field strength of the order of 100 G) provides the results qualitatively similar to the low-field model; nevertheless, it is an important illustration of the transition from the low-field to high-field MHD models.\n\nFor the virtual filament studied, our on-disk images show emission instead of the expected brightness depression. In the limb views, the filament can clearly be seen above the limb, especially at higher frequencies ($\\gtrsim 17$ GHz). We conclude that the approach to simulating the filaments seems correct, although the simulation parameters (i.e., the filament temperature and dimensions) still differ from the typical parameters of the observed filaments. \n\nSince only a few MHD models have been analyzed (because, as said above, the MHD simulations are very expensive computationally), our results are by no means comprehensive. Instead, this study should be considered as a first attempt to combine the MHD simulations of the flux ropes and filaments with the 3D simulations of the radio emission. The results obtained, although somewhat qualitative, demonstrate how the flux rope evolution affects the radio emission; they show the directions for further, more advanced and realistic simulations.\n\n\\begin{acks}\nThis work was supported in part by the Russian Foundation of Basic Research (grants 14-02-91157, 15-02-03717 and 15-32-51171) and by a Marie Curie International Research Staff Exchange Scheme ``Radiosun'' (PEOPLE-2011-IRSES-295272). RK and CX acknowledge support from the project GOA/2015/014 (KU Leuven), the Interuniversity Attraction Poles Programme initiated by the Belgian Science Policy Office (IAP P7/08 CHARM), and the FWO. Part of the simulations used the VSC (Flemish Supercomputer Center) funded by the Hercules foundation and the Flemish Government.\n\\end{acks}\n\n\\begin{thebibliography}{81}\n\n\\ifx\\bisbn     \\undefined \\def\\bisbn  #1{ISBN #1}\\fi\n\\ifx\\binits    \\undefined \\def\\binits#1{#1}\\fi\n\\ifx\\bauthor   \\undefined \\def\\bauthor#1{#1}\\fi\n\\ifx\\batitle   \\undefined \\def\\batitle#1{#1}\\fi\n\\ifx\\bjtitle   \\undefined \\def\\bjtitle#1{\\textit{#1}}\\fi\n\\ifx\\bvolume   \\undefined \\def\\bvolume#1{\\textbf{#1}}\\fi\n\\ifx\\byear     \\undefined \\def\\byear#1{#1}\\fi\n\\ifx\\bissue    \\undefined \\def\\bissue#1{#1}\\fi\n\\ifx\\bfpage    \\undefined \\def\\bfpage#1{#1}\\fi\n\\ifx\\blpage    \\undefined \\def\\blpage #1{#1}\\fi\n\\ifx\\burl      \\undefined \\def\\burl#1{\\textsf{#1}}\\fi\n\\ifx\\href      \\undefined \\def\\href#1#2{\\textsf{#2}}\\fi\n\\ifx\\betal     \\undefined \\def\\betal{\\textit{et al.}}\\fi\n\\ifx\\bctitle   \\undefined \\def\\bctitle#1{#1}\\fi\n\\ifx\\beditor   \\undefined \\def\\beditor#1{#1}\\fi\n\\ifx\\bbtitle   \\undefined \\def\\bbtitle#1{\\textit{#1}}\\fi\n\\ifx\\bedition  \\undefined \\def\\bedition#1{#1}\\fi\n\\ifx\\bseriesno \\undefined \\def\\bseriesno#1{\\textbf{#1}}\\fi\n\\ifx\\blocation \\undefined \\def\\blocation#1{#1}\\fi\n\\ifx\\bsertitle \\undefined \\def\\bsertitle#1{\\textit{#1}}\\fi\n\\ifx\\bsnm      \\undefined \\def\\bsnm#1{#1}\\fi\n\\ifx\\bsuffix   \\undefined \\def\\bsuffix#1{#1}\\fi\n\\ifx\\bparticle \\undefined \\def\\bparticle#1{#1}\\fi\n\\ifx\\barticle  \\undefined \\def\\barticle#1{}\\fi\n\\ifx\\binstitute  \\undefined \\def\\binstitute#1{#1}\\fi\n\\ifx\\bpublisher  \\undefined \\def\\bpublisher#1{#1}\\fi\n\\ifx\\doiurl    \\undefined\n  \\def\\doiurl#1{\\href{http://dx.doi.org/#1}{\\textsf{DOI}}}\\fi\n\\ifx\\arxivurl  \\undefined\n  \\def\\arxivurl#1{\\href{http://arxiv.org/abs/#1}{\\textsf{arXiv}}}\\fi\n\\ifx\\adsurl    \\undefined\n  \\def\\adsurl#1{\\href{http://adsabs.harvard.edu/abs/#1}{\\textsf{ADS}}}\\fi\n\\ifx\\botherref \\undefined \\def\\botherref#1{}\\fi\n\\ifx\\url       \\undefined \\def\\url#1{\\textsf{#1}}\\fi\n\\ifx\\bchapter  \\undefined \\def\\bchapter#1{}\\fi\n\\ifx\\bbook     \\undefined \\def\\bbook#1{}\\fi\n\\ifx\\bcomment  \\undefined \\def\\bcomment#1{#1}\\fi\n\\ifx\\oauthor   \\undefined \\def\\oauthor#1{#1}\\fi\n\\ifx\\citeauthoryear \\undefined\\def \\citeauthoryear#1{#1}\\fi\n\\ifx\\endbibitem\\undefined \\def\\endbibitem{}\\fi\n\\ifx\\bconflocation  \\undefined \\def\\bconflocation#1{#1} \\fi\n\n\\bibitem[\\protect\\citeauthoryear{{Abramov-Maximov}\n  \\textit{et~al.}}{2015}]{abramax15}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Abramov-Maximov}}, \\binits{V.E.}},\n\\bauthor{\\bsnm{{Borovik}}, \\binits{V.N.}},\n\\bauthor{\\bsnm{{Opeikina}}, \\binits{L.V.}},\n\\bauthor{\\bsnm{{Tlatov}}, \\binits{A.G.}}:\n\\byear{2015},\n\\batitle{{Dynamics of Microwave Sources Associated with the Neutral Line and\n  the Magnetic-Field Parameters of Sunspots as a Factor in Predicting Large\n  Flares}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{290},\n\\bfpage{53}.\n\\doiurl{10.1007/s11207-014-0605-8}.\n\\adsurl{2015SoPh..290...53A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Akhmedov} \\textit{et~al.}}{1986}]{akh86}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Akhmedov}}, \\binits{S.B.}},\n\\bauthor{\\bsnm{{Borovik}}, \\binits{V.N.}},\n\\bauthor{\\bsnm{{Gelfreikh}}, \\binits{G.B.}},\n\\bauthor{\\bsnm{{Bogod}}, \\binits{V.M.}},\n\\bauthor{\\bsnm{{Korzhavin}}, \\binits{A.N.}},\n\\bauthor{\\bsnm{{Petrov}}, \\binits{Z.E.}},\n\\bauthor{\\bsnm{{Dikij}}, \\binits{V.N.}},\n\\bauthor{\\bsnm{{Lang}}, \\binits{K.R.}},\n\\bauthor{\\bsnm{{Willson}}, \\binits{R.F.}}:\n\\byear{1986},\n\\batitle{{Structure of a solar active region from RATAN 600 and very large\n  array observations}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{301},\n\\bfpage{460}.\n\\doiurl{10.1086/163914}.\n\\adsurl{1986ApJ...301..460A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Alissandrakis} and {Kundu}}{1982}]{ali82}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1982},\n\\batitle{{Observations of ring structure in a sunspot associated source at 6\n  centimeter wavelength}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{253},\n\\bfpage{L49}.\n\\doiurl{10.1086/183734}.\n\\adsurl{1982ApJ...253L..49A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Alissandrakis} \\textit{et~al.}}{1992}]{ali92}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Lubyshev}}, \\binits{B.I.}},\n\\bauthor{\\bsnm{{Smol'Kov}}, \\binits{G.I.}},\n\\bauthor{\\bsnm{{Krissinel'}}, \\binits{B.B.}},\n\\bauthor{\\bsnm{{Treskov}}, \\binits{T.A.}},\n\\bauthor{\\bsnm{{Miller}}, \\binits{V.G.}},\n\\bauthor{\\bsnm{{Kardapolova}}, \\binits{N.N.}}:\n\\byear{1992},\n\\batitle{{Two-dimensional solar mapping at 5.2 CM with the Siberian Solar Radio\n  Telescope}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{142},\n\\bfpage{341}.\n\\doiurl{10.1007/BF00151458}.\n\\adsurl{1992SoPh..142..341A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Alissandrakis} \\textit{et~al.}}{1993}]{ali93}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Gel'Frejkh}}, \\binits{G.B.}},\n\\bauthor{\\bsnm{{Borovik}}, \\binits{V.N.}},\n\\bauthor{\\bsnm{{Korzhavin}}, \\binits{A.N.}},\n\\bauthor{\\bsnm{{Bogod}}, \\binits{V.M.}},\n\\bauthor{\\bsnm{{Nindos}}, \\binits{A.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1993},\n\\batitle{{Spectral observations of active region sources with RATAN-600 and\n  WSRT}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{270},\n\\bfpage{509}.\n\\adsurl{1993A\\%26A...270..509A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Alissandrakis} \\textit{et~al.}}{2013}]{ali13}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Kochanov}}, \\binits{A.A.}},\n\\bauthor{\\bsnm{{Patsourakos}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Altyntsev}}, \\binits{A.T.}},\n\\bauthor{\\bsnm{{Lesovoi}}, \\binits{S.V.}},\n\\bauthor{\\bsnm{{Lesovoya}}, \\binits{N.N.}}:\n\\byear{2013},\n\\batitle{{Microwave and EUV Observations of an Erupting Filament and Associated\n  Flare and Coronal Mass Ejections}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{65},\n\\bfpage{8}.\n\\doiurl{10.1093/pasj/65.sp1.S8}.\n\\adsurl{2013PASJ...65S...8A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Amari} \\textit{et~al.}}{1999}]{Amari99}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Amari}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Luciani}}, \\binits{J.F.}},\n\\bauthor{\\bsnm{{Mikic}}, \\binits{Z.}},\n\\bauthor{\\bsnm{{Linker}}, \\binits{J.}}:\n\\byear{1999},\n\\batitle{{Three-dimensional Solutions of Magnetohydrodynamic Equationsfor\n  Prominence Magnetic Support: Twisted Magnetic Flux Rope}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{518},\n\\bfpage{L57}.\n\\doiurl{10.1086/312053}.\n\\adsurl{1999ApJ...518L..57A}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Aschwanden}}{2005}]{asc05}\n\\begin{bbook}\n\\bauthor{\\bsnm{{Aschwanden}}, \\binits{M.J.}}:\n\\byear{2005},\n\\bbtitle{{Physics of the Solar Corona. An Introduction with Problems and\n  Solutions (2nd edition)}}.\n\\adsurl{2005psci.book.....A}.\n\\end{bbook}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Bakunina} \\textit{et~al.}}{2015}]{bak15}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Bakunina}}, \\binits{I.A.}},\n\\bauthor{\\bsnm{{Melnikov}}, \\binits{V.F.}},\n\\bauthor{\\bsnm{{Solov'ev}}, \\binits{A.A.}},\n\\bauthor{\\bsnm{{Abramov-Maximov}}, \\binits{V.E.}}:\n\\byear{2015},\n\\batitle{{Intersunspot Microwave Sources}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{290},\n\\bfpage{37}.\n\\doiurl{10.1007/s11207-014-0614-7}.\n\\adsurl{2015SoPh..290...37B}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Bastian}, {Ewell}, and {Zirin}}{1993}]{bas93}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Bastian}}, \\binits{T.S.}},\n\\bauthor{\\bsnm{{Ewell}}, \\binits{M.W.} \\bsuffix{Jr.}},\n\\bauthor{\\bsnm{{Zirin}}, \\binits{H.}}:\n\\byear{1993},\n\\batitle{{A Study of Solar Prominences near $\\lambda=1$ Millimeter}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{418},\n\\bfpage{510}.\n\\doiurl{10.1086/173413}.\n\\adsurl{1993ApJ...418..510B}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Bogod}, {Kaltman}, and\n  {Yasnov}}{2012}]{bog12}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Bogod}}, \\binits{V.M.}},\n\\bauthor{\\bsnm{{Kaltman}}, \\binits{T.I.}},\n\\bauthor{\\bsnm{{Yasnov}}, \\binits{L.V.}}:\n\\byear{2012},\n\\batitle{{On properties of microwave sources located above the neutral line of\n  radial magnetic field}}.\n\\bjtitle{Astrophysical Bulletin}\n\\bvolume{67},\n\\bfpage{425}.\n\\doiurl{10.1134/S1990341312040062}.\n\\adsurl{2012AstBu..67..425B}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Butz} \\textit{et~al.}}{1975}]{but75}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Butz}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Fuerst}}, \\binits{E.}},\n\\bauthor{\\bsnm{{Hirth}}, \\binits{W.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1975},\n\\batitle{{On the structure of filaments from centimeter and millimeter\n  observations}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{45},\n\\bfpage{125}.\n\\doiurl{10.1007/BF00152224}.\n\\adsurl{1975SoPh...45..125B}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Chiuderi-Drago}\n  \\textit{et~al.}}{1975}]{chi75}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Chiuderi-Drago}}, \\binits{F.}},\n\\bauthor{\\bsnm{{Furst}}, \\binits{E.}},\n\\bauthor{\\bsnm{{Hirth}}, \\binits{W.}},\n\\bauthor{\\bsnm{{Lantos}}, \\binits{P.}}:\n\\byear{1975},\n\\batitle{{Limb Brightening and Dark Features Observed at 6cm Wavelength}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{39},\n\\bfpage{429}.\n\\adsurl{1975A\\%26A....39..429C}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Chiuderi Drago}\n  \\textit{et~al.}}{2001}]{chi01}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Chiuderi Drago}}, \\binits{F.}},\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Bastian}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Bocchialini}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Harrison}}, \\binits{R.A.}}:\n\\byear{2001},\n\\batitle{{Joint EUV/Radio Observations of a Solar Filament}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{199},\n\\bfpage{115}.\n\\doiurl{10.1023/A:1010390726242}.\n\\adsurl{2001SoPh..199..115C}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Drago} and {Felli}}{1970}]{dra70}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Drago}}, \\binits{F.C.}},\n\\bauthor{\\bsnm{{Felli}}, \\binits{M.}}:\n\\byear{1970},\n\\batitle{{Radio Maps of the Sun at {$\\lambda$} = 1.95 cm}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{14},\n\\bfpage{171}.\n\\doiurl{10.1007/BF00240175}.\n\\adsurl{1970SoPh...14..171D}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Dulk}}{1985}]{dul85}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Dulk}}, \\binits{G.A.}}:\n\\byear{1985},\n\\batitle{{Radio emission from the sun and stars}}.\n\\bjtitle{{\t\t{\\it Ann. Rev. Astron. Astrophys.}}}\n\\bvolume{23},\n\\bfpage{169}.\n\\doiurl{10.1146/annurev.aa.23.090185.001125}.\n\\adsurl{1985ARA\\%26A..23..169D}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Fleishman} and {Kuznetsov}}{2010}]{fle10}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Fleishman}}, \\binits{G.D.}},\n\\bauthor{\\bsnm{{Kuznetsov}}, \\binits{A.A.}}:\n\\byear{2010},\n\\batitle{{Fast Gyrosynchrotron Codes}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{721},\n\\bfpage{1127}.\n\\doiurl{10.1088/0004-637X/721/2/1127}.\n\\adsurl{2010ApJ...721.1127F}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Fleishman} and {Kuznetsov}}{2014}]{fle14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Fleishman}}, \\binits{G.D.}},\n\\bauthor{\\bsnm{{Kuznetsov}}, \\binits{A.A.}}:\n\\byear{2014},\n\\batitle{{Theory of Gyroresonance and Free-Free Emissions from Non-Maxwellian\n  Quasi-steady-state Electron Distributions}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{781},\n\\bfpage{77}.\n\\doiurl{10.1088/0004-637X/781/2/77}.\n\\adsurl{2014ApJ...781...77F}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Gilbert} \\textit{et~al.}}{2000}]{gil00}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Gilbert}}, \\binits{H.R.}},\n\\bauthor{\\bsnm{{Holzer}}, \\binits{T.E.}},\n\\bauthor{\\bsnm{{Burkepile}}, \\binits{J.T.}},\n\\bauthor{\\bsnm{{Hundhausen}}, \\binits{A.J.}}:\n\\byear{2000},\n\\batitle{{Active and Eruptive Prominences and Their Relationship to Coronal\n  Mass Ejections}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{537},\n\\bfpage{503}.\n\\doiurl{10.1086/309030}.\n\\adsurl{2000ApJ...537..503G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Golubchina} \\textit{et~al.}}{2008}]{gol08}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Golubchina}}, \\binits{O.A.}},\n\\bauthor{\\bsnm{{Bogod}}, \\binits{V.M.}},\n\\bauthor{\\bsnm{{Korzhavin}}, \\binits{A.N.}},\n\\bauthor{\\bsnm{{Bursov}}, \\binits{N.N.}},\n\\bauthor{\\bsnm{{Tokhchukova}}, \\binits{S.K.}}:\n\\byear{2008},\n\\batitle{{Centimeter-wave radio emission of a high-latitude prominence}}.\n\\bjtitle{Astrophysical Bulletin}\n\\bvolume{63},\n\\bfpage{34}.\n\\doiurl{10.1007/s11755-008-1004-8}.\n\\adsurl{2008AstBu..63...34G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Gopalswamy} and {Hanaoka}}{1998}]{gop98}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Gopalswamy}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Hanaoka}}, \\binits{Y.}}:\n\\byear{1998},\n\\batitle{{Coronal Dimming Associated with a Giant Prominence Eruption}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{498},\n\\bfpage{L179}.\n\\doiurl{10.1086/311330}.\n\\adsurl{1998ApJ...498L.179G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Gopalswamy} and {Yashiro}}{2013}]{gop13}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Gopalswamy}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Yashiro}}, \\binits{S.}}:\n\\byear{2013},\n\\batitle{{Obscuration of Flare Emission by an Eruptive Prominence}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{65},\n\\bfpage{11}.\n\\doiurl{10.1093/pasj/65.sp1.S11}.\n\\adsurl{2013PASJ...65S..11G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Gopalswamy} \\textit{et~al.}}{1997}]{gop97}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Gopalswamy}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Hanaoka}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Enome}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Lemen}}, \\binits{J.R.}},\n\\bauthor{\\bsnm{{Akioka}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Lara}}, \\binits{A.}}:\n\\byear{1997},\n\\batitle{{Radio and X-Ray Studies of a Coronal Mass Ejection Associated with a\n  Very Slow Prominence Eruption}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{475},\n\\bfpage{348}.\n\\adsurl{1997ApJ...475..348G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Gopalswamy} \\textit{et~al.}}{2003}]{gop03}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Gopalswamy}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Shimojo}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Lu}}, \\binits{W.}},\n\\bauthor{\\bsnm{{Yashiro}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Shibasaki}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Howard}}, \\binits{R.A.}}:\n\\byear{2003},\n\\batitle{{Prominence Eruptions and Coronal Mass Ejection: A Statistical Study\n  Using Microwave Observations}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{586},\n\\bfpage{562}.\n\\doiurl{10.1086/367614}.\n\\adsurl{2003ApJ...586..562G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Grechnev} \\textit{et~al.}}{2006}]{gre06}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}},\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Zandanov}}, \\binits{V.G.}},\n\\bauthor{\\bsnm{{Baranov}}, \\binits{N.Y.}},\n\\bauthor{\\bsnm{{Shibasaki}}, \\binits{K.}}:\n\\byear{2006},\n\\batitle{{Observations of Prominence Eruptions with Two Radioheliographs, SSRT,\n  and NoRH}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{58},\n\\bfpage{69}.\n\\doiurl{10.1093/pasj/58.1.69}.\n\\adsurl{2006PASJ...58...69G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Grechnev} \\textit{et~al.}}{2013}]{gre13}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}},\n\\bauthor{\\bsnm{{Kiselev}}, \\binits{V.I.}},\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Meshalkina}}, \\binits{N.S.}},\n\\bauthor{\\bsnm{{Kochanov}}, \\binits{A.A.}}:\n\\byear{2013},\n\\batitle{{An Updated View of Solar Eruptive Flares and the Development of\n  Shocks and CMEs: History of the 2006 December 13 GLE-Productive Extreme\n  Event}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{65},\n\\bfpage{9}.\n\\doiurl{10.1093/pasj/65.sp1.S9}.\n\\adsurl{2013PASJ...65S...9G}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Grechnev} \\textit{et~al.}}{2014}]{gre14}\n\\begin{botherref}\n\\oauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}},\n\\oauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\oauthor{\\bsnm{{Kuzmenko}}, \\binits{I.V.}},\n\\oauthor{\\bsnm{{Kochanov}}, \\binits{A.A.}},\n\\oauthor{\\bsnm{{Chertok}}, \\binits{I.M.}},\n\\oauthor{\\bsnm{{Kalashnikov}}, \\binits{S.S.}}:\n2014,\n{Responsibility of a Filament Eruption for the Initiation of a Flare, CME, and\n  Blast Wave, and its Possible Transformation into a Bow Shock}.\n\\textit{{\\it Solar Phys.}}.\n\\doiurl{10.1007/s11207-014-0621-8}.\n\\adsurl{2014SoPh..tmp..141G}.\n\\end{botherref}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Hanaoka} and {Shinkawa}}{1999}]{han99}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Hanaoka}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Shinkawa}}, \\binits{T.}}:\n\\byear{1999},\n\\batitle{{Heating of Erupting Prominences Observed at 17 GHZ}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{510},\n\\bfpage{466}.\n\\doiurl{10.1086/306572}.\n\\adsurl{1999ApJ...510..466H}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Hanaoka} \\textit{et~al.}}{1994}]{han94}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Hanaoka}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Kurokawa}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Enome}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Nakajima}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Shibasaki}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Nishio}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Takano}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Torii}}, \\binits{C.}},\n\\bauthor{\\bsnm{{Sekiguchi}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Kawashima}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Bushimata}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Shinohara}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Irimajiri}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Koshiishi}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Shiomi}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Nakai}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Funakoshi}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Kitai}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Ishiura}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Kimura}}, \\binits{G.}}:\n\\byear{1994},\n\\batitle{{Simultaneous observations of a prominence eruption followed by a\n  coronal arcade formation in radio, soft X-rays, and H(alpha)}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{46},\n\\bfpage{205}.\n\\adsurl{1994PASJ...46..205H}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Hirayama}}{1985}]{hir85}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Hirayama}}, \\binits{T.}}:\n\\byear{1985},\n\\batitle{{Modern observations of solar prominences}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{100},\n\\bfpage{415}.\n\\doiurl{10.1007/BF00158439}.\n\\adsurl{1985SoPh..100..415H}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Hori} and {Culhane}}{2002}]{hor02}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Hori}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Culhane}}, \\binits{J.L.}}:\n\\byear{2002},\n\\batitle{{Trajectories of microwave prominence eruptions}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{382},\n\\bfpage{666}.\n\\doiurl{10.1051/0004-6361:20011658}.\n\\adsurl{2002A\\%26A...382..666H}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Irimajiri} \\textit{et~al.}}{1995}]{iri95}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Irimajiri}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Takano}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Nakajima}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Shibasaki}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Hanaoka}}, \\binits{Y.}},\n\\bauthor{\\bsnm{{Ichimoto}}, \\binits{K.}}:\n\\byear{1995},\n\\batitle{{Simultaneous multifrequency observations of an eruptive prominence at\n  millimeter wavelengths}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{156},\n\\bfpage{363}.\n\\doiurl{10.1007/BF00670232}.\n\\adsurl{1995SoPh..156..363I}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kaneko} and {Yokoyama}}{2015}]{kan15}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kaneko}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Yokoyama}}, \\binits{T.}}:\n\\byear{2015},\n\\batitle{{Numerical Study on In-Situ Prominence Formation by Radiative\n  Condensation in the Solar Corona}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{806},\n\\bfpage{115}.\n\\doiurl{10.1088/0004-637X/806/1/115}.\n\\adsurl{2015ApJ...806..115K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Keppens}, {Porth}, and\n  {Xia}}{2014}]{keppens14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Keppens}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Porth}}, \\binits{O.}},\n\\bauthor{\\bsnm{{Xia}}, \\binits{C.}}:\n\\byear{2014},\n\\batitle{{Interacting Tilt and Kink Instabilities in Repelling Current\n  Channels}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{795},\n\\bfpage{77}.\n\\doiurl{10.1088/0004-637X/795/1/77}.\n\\adsurl{2014ApJ...795...77K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Keppens} \\textit{et~al.}}{2003}]{kep03}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Keppens}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Nool}}, \\binits{M.}},\n\\bauthor{\\bsnm{{T{\\'o}th}}, \\binits{G.}},\n\\bauthor{\\bsnm{{Goedbloed}}, \\binits{J.P.}}:\n\\byear{2003},\n\\batitle{{Adaptive Mesh Refinement for conservative systems: multi-dimensional\n  efficiency evaluation}}.\n\\bjtitle{Computer Physics Communications}\n\\bvolume{153},\n\\bfpage{317}.\n\\doiurl{10.1016/S0010-4655(03)00139-5}.\n\\adsurl{2003CoPhC.153..317K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Khangil'din}}{1964}]{kha64}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Khangil'din}}, \\binits{U.V.}}:\n\\byear{1964},\n\\batitle{{Characteristics of Solar Active Regions Obtained from Observations on\n  Millimeter Wavelengths}}.\n\\bjtitle{{ {\\it Soviet  Astron.}}}\n\\bvolume{8},\n\\bfpage{234}.\n\\adsurl{1964SvA.....8..234K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kliem} and {T{\\\"o}r{\\\"o}k}}{2006}]{kliem06}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kliem}}, \\binits{B.}},\n\\bauthor{\\bsnm{{T{\\\"o}r{\\\"o}k}}, \\binits{T.}}:\n\\byear{2006},\n\\batitle{{Torus Instability}}.\n\\bjtitle{Physical Review Letters}\n\\bvolume{96}(\\bissue{25}),\n\\bfpage{255002}.\n\\doiurl{10.1103/PhysRevLett.96.255002}.\n\\adsurl{2006PhRvL..96y5002K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kliem} \\textit{et~al.}}{2014}]{kliem14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kliem}}, \\binits{B.}},\n\\bauthor{\\bsnm{{T{\\\"o}r{\\\"o}k}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Titov}}, \\binits{V.S.}},\n\\bauthor{\\bsnm{{Lionello}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Linker}}, \\binits{J.A.}},\n\\bauthor{\\bsnm{{Liu}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Liu}}, \\binits{C.}},\n\\bauthor{\\bsnm{{Wang}}, \\binits{H.}}:\n\\byear{2014},\n\\batitle{{Slow Rise and Partial Eruption of a Double-decker Filament. II. A\n  Double Flux Rope Model}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{792},\n\\bfpage{107}.\n\\doiurl{10.1088/0004-637X/792/2/107}.\n\\adsurl{2014ApJ...792..107K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Korzhavin} \\textit{et~al.}}{1994}]{kor94}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Korzhavin}}, \\binits{A.N.}},\n\\bauthor{\\bsnm{{Bogod}}, \\binits{V.M.}},\n\\bauthor{\\bsnm{{Borovik}}, \\binits{V.N.}},\n\\bauthor{\\bsnm{{Gelfreikh}}, \\binits{G.B.}},\n\\bauthor{\\bsnm{{Makarov}}, \\binits{V.I.}}:\n\\byear{1994},\n\\batitle{{Coronal loops and prominences as observed with RATAN 600}}.\n\\bjtitle{{    {\\it Space Sci. Rev.}}}\n\\bvolume{70},\n\\bfpage{193}.\n\\doiurl{10.1007/BF00777867}.\n\\adsurl{1994SSRv...70..193K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu}}{1970}]{kun70}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1970},\n\\batitle{{Solar Active Regions at Millimeter Wavelengths}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{13},\n\\bfpage{348}.\n\\doiurl{10.1007/BF00153556}.\n\\adsurl{1970SoPh...13..348K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu}}{1972}]{kun72}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1972},\n\\batitle{{Observations of Prominences at 3.5 Millimeter Wavelength}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{25},\n\\bfpage{108}.\n\\doiurl{10.1007/BF00155749}.\n\\adsurl{1972SoPh...25..108K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu}}{1985}]{kun85}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1985},\n\\batitle{{High spatial resolution microwave observations of the sun}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{100},\n\\bfpage{491}.\n\\doiurl{10.1007/BF00158442}.\n\\adsurl{1985SoPh..100..491K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} and {Alissandrakis}}{1984}]{kun84}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}}:\n\\byear{1984},\n\\batitle{{Structure and polarization of active region microwave emission}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{94},\n\\bfpage{249}.\n\\doiurl{10.1007/BF00151317}.\n\\adsurl{1984SoPh...94..249K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} and {McCullough}}{1972}]{kun72a}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{McCullough}}, \\binits{T.P.}}:\n\\byear{1972},\n\\batitle{{Polarization of Solar Active Regions at 9.5 mm Wavelength}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{24},\n\\bfpage{133}.\n\\doiurl{10.1007/BF00231091}.\n\\adsurl{1972SoPh...24..133K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} and {Velusamy}}{1980}]{kun80}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Velusamy}}, \\binits{T.}}:\n\\byear{1980},\n\\batitle{{Observation with the VLA of a stationary loop structure on the sun at\n  6 centimeter wavelength}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{240},\n\\bfpage{L63}.\n\\doiurl{10.1086/183324}.\n\\adsurl{1980ApJ...240L..63K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu}, {Melozzi}, and\n  {Shevgaonkar}}{1986}]{kun86}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Melozzi}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Shevgaonkar}}, \\binits{R.K.}}:\n\\byear{1986},\n\\batitle{{A study of solar filaments from high resolution microwave\n  observations}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{167},\n\\bfpage{166}.\n\\adsurl{1986A\\%26A...167..166K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu}, {Schmahl}, and {Rao}}{1981}]{kun81}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Schmahl}}, \\binits{E.J.}},\n\\bauthor{\\bsnm{{Rao}}, \\binits{A.P.}}:\n\\byear{1981},\n\\batitle{{VLA observations of solar active regions at 6 CM wavelength}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{94},\n\\bfpage{72}.\n\\adsurl{1981A\\%26A....94...72K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} \\textit{et~al.}}{1977}]{kun77}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Bregman}}, \\binits{J.D.}},\n\\bauthor{\\bsnm{{Hin}}, \\binits{A.C.}}:\n\\byear{1977},\n\\batitle{{6 centimeter observations of solar active regions with 6 SEC\n  resolution}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{213},\n\\bfpage{278}.\n\\doiurl{10.1086/155155}.\n\\adsurl{1977ApJ...213..278K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} \\textit{et~al.}}{1978}]{kun78}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{Fuerst}}, \\binits{E.}},\n\\bauthor{\\bsnm{{Hirth}}, \\binits{W.}},\n\\bauthor{\\bsnm{{Butz}}, \\binits{M.}}:\n\\byear{1978},\n\\batitle{{Multifrequency observations of solar filaments at centimeter\n  wavelengths}}.\n\\bjtitle{{    {\\it Astron. Astrophys.}}}\n\\bvolume{62},\n\\bfpage{431}.\n\\adsurl{1978A\\%26A....62..431K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Kundu} \\textit{et~al.}}{2004}]{kun04}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}},\n\\bauthor{\\bsnm{{White}}, \\binits{S.M.}},\n\\bauthor{\\bsnm{{Garaimov}}, \\binits{V.I.}},\n\\bauthor{\\bsnm{{Manoharan}}, \\binits{P.K.}},\n\\bauthor{\\bsnm{{Subramanian}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Ananthakrishnan}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Janardhan}}, \\binits{P.}}:\n\\byear{2004},\n\\batitle{{Radio Observations of Rapid Acceleration in a Slow Filament\n  Eruption/Fast Coronal Mass Ejection Event}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{607},\n\\bfpage{530}.\n\\doiurl{10.1086/383217}.\n\\adsurl{2004ApJ...607..530K}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Labrosse} \\textit{et~al.}}{2010}]{lab10}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Labrosse}}, \\binits{N.}},\n\\bauthor{\\bsnm{{Heinzel}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Vial}}, \\binits{J.-C.}},\n\\bauthor{\\bsnm{{Kucera}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Parenti}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Gun{\\'a}r}}, \\binits{S.}},\n\\bauthor{\\bsnm{{Schmieder}}, \\binits{B.}},\n\\bauthor{\\bsnm{{Kilper}}, \\binits{G.}}:\n\\byear{2010},\n\\batitle{{Physics of Solar Prominences: I -- Spectral Diagnostics and Non-LTE\n  Modelling}}.\n\\bjtitle{{    {\\it Space Sci. Rev.}}}\n\\bvolume{151},\n\\bfpage{243}.\n\\doiurl{10.1007/s11214-010-9630-6}.\n\\adsurl{2010SSRv..151..243L}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Landi} and {Chiuderi Drago}}{2008}]{lan08}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Landi}}, \\binits{E.}},\n\\bauthor{\\bsnm{{Chiuderi Drago}}, \\binits{F.}}:\n\\byear{2008},\n\\batitle{{The Quiet-Sun Differential Emission Measure from Radio and UV\n  Measurements}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{675},\n\\bfpage{1629}.\n\\doiurl{10.1086/527285}.\n\\adsurl{2008ApJ...675.1629L}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Lionello} \\textit{et~al.}}{2002}]{Lione02}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Lionello}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Miki{\\'c}}}, \\binits{Z.}},\n\\bauthor{\\bsnm{{Linker}}, \\binits{J.A.}},\n\\bauthor{\\bsnm{{Amari}}, \\binits{T.}}:\n\\byear{2002},\n\\batitle{{Magnetic Field Topology in Prominences}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{581},\n\\bfpage{718}.\n\\doiurl{10.1086/344222}.\n\\adsurl{2002ApJ...581..718L}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Mackay} and {van\n  Ballegooijen}}{2006}]{Mackay06}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Mackay}}, \\binits{D.H.}},\n\\bauthor{\\bsnm{{van Ballegooijen}}, \\binits{A.A.}}:\n\\byear{2006},\n\\batitle{{Models of the Large-Scale Corona. I. Formation, Evolution, and\n  Liftoff of Magnetic Flux Ropes}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{641},\n\\bfpage{577}.\n\\doiurl{10.1086/500425}.\n\\adsurl{2006ApJ...641..577M}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Mackay} \\textit{et~al.}}{2010}]{mac10}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Mackay}}, \\binits{D.H.}},\n\\bauthor{\\bsnm{{Karpen}}, \\binits{J.T.}},\n\\bauthor{\\bsnm{{Ballester}}, \\binits{J.L.}},\n\\bauthor{\\bsnm{{Schmieder}}, \\binits{B.}},\n\\bauthor{\\bsnm{{Aulanier}}, \\binits{G.}}:\n\\byear{2010},\n\\batitle{{Physics of Solar Prominences: II -- Magnetic Structure and\n  Dynamics}}.\n\\bjtitle{{    {\\it Space Sci. Rev.}}}\n\\bvolume{151},\n\\bfpage{333}.\n\\doiurl{10.1007/s11214-010-9628-0}.\n\\adsurl{2010SSRv..151..333M}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Marqu{\\'e}}}{2004}]{mar04}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Marqu{\\'e}}}, \\binits{C.}}:\n\\byear{2004},\n\\batitle{{Radio Metric Observations of Quiescent Filament Cavities}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{602},\n\\bfpage{1037}.\n\\doiurl{10.1086/381085}.\n\\adsurl{2004ApJ...602.1037M}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Munro} \\textit{et~al.}}{1979}]{mun79}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Munro}}, \\binits{R.H.}},\n\\bauthor{\\bsnm{{Gosling}}, \\binits{J.T.}},\n\\bauthor{\\bsnm{{Hildner}}, \\binits{E.}},\n\\bauthor{\\bsnm{{MacQueen}}, \\binits{R.M.}},\n\\bauthor{\\bsnm{{Poland}}, \\binits{A.I.}},\n\\bauthor{\\bsnm{{Ross}}, \\binits{C.L.}}:\n\\byear{1979},\n\\batitle{{The association of coronal mass ejection transients with other forms\n  of solar activity}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{61},\n\\bfpage{201}.\n\\doiurl{10.1007/BF00155456}.\n\\adsurl{1979SoPh...61..201M}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Parenti}}{2014}]{par14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Parenti}}, \\binits{S.}}:\n\\byear{2014},\n\\batitle{{Solar Prominences: Observations}}.\n\\bjtitle{Living Reviews in Solar Physics}\n\\bvolume{11},\n\\bfpage{1}.\n\\doiurl{10.12942/lrsp-2014-1}.\n\\adsurl{2014LRSP...11....1P}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{P{\\'e}rez-Le{\\'o}n}, {Hiriart}, and\n  {Mendoza-Torres}}{2013}]{per13}\n\\begin{barticle}\n\\bauthor{\\bsnm{{P{\\'e}rez-Le{\\'o}n}}, \\binits{J.E.}},\n\\bauthor{\\bsnm{{Hiriart}}, \\binits{D.}},\n\\bauthor{\\bsnm{{Mendoza-Torres}}, \\binits{J.E.}}:\n\\byear{2013},\n\\batitle{{Millimeter and Submillimeter Counterparts of the 2009 September 26\n  Solar Prominence}}.\n\\bjtitle{Revista Mexicana de Astronom\\'ia y Astrof\\'isica}\n\\bvolume{49},\n\\bfpage{3}.\n\\adsurl{2013RMxAA..49....3P}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Priest}}{2014}]{pri14}\n\\begin{bchapter}\n\\bauthor{\\bsnm{{Priest}}, \\binits{E.R.}}:\n\\byear{2014},\n\\bctitle{{Prominences: Conference Summary and Suggestions for the Future}}.\nIn: \\beditor{\\bsnm{{Schmieder}}, \\binits{B.}},\n\\beditor{\\bsnm{{Malherbe}}, \\binits{J.-M.}},\n\\beditor{\\bsnm{{Wu}}, \\binits{S.T.}} (eds.)\n\\bbtitle{IAU Symposium},\n\\bsertitle{IAU Symposium}\n\\bseriesno{300},\n\\bfpage{379}.\n\\doiurl{10.1017/S1743921313011228}.\n\\adsurl{2014IAUS..300..379P}.\n\\end{bchapter}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Rao} and {Kundu}}{1977}]{rao77}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Rao}}, \\binits{A.P.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1977},\n\\batitle{{A study of filament transition sheath from radio observations}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{55},\n\\bfpage{161}.\n\\doiurl{10.1007/BF00150882}.\n\\adsurl{1977SoPh...55..161R}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Raoult}, {Lantos}, and\n  {Fuerst}}{1979}]{rao79}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Raoult}}, \\binits{A.}},\n\\bauthor{\\bsnm{{Lantos}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Fuerst}}, \\binits{E.}}:\n\\byear{1979},\n\\batitle{{Prominences at centimetric and millimetric wavelengths. I - Size and\n  spectrum of the radio filaments}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{61},\n\\bfpage{335}.\n\\doiurl{10.1007/BF00150418}.\n\\adsurl{1979SoPh...61..335R}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{Saha}{1920}]{saha20}\n\\begin{barticle}\n\\bauthor{\\bsnm{Saha}, \\binits{M.N.}}:\n\\byear{1920},\n\\batitle{Liii. ionization in the solar chromosphere}.\n\\bjtitle{The London, Edinburgh, and Dublin Philosophical Magazine and Journal\n  of Science}\n\\bvolume{40}(\\bissue{238}),\n\\bfpage{472}.\n\\doiurl{10.1080/14786441008636148}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Schmahl}, {Bobrowsky}, and\n  {Kundu}}{1981}]{sch81}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Schmahl}}, \\binits{E.J.}},\n\\bauthor{\\bsnm{{Bobrowsky}}, \\binits{M.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1981},\n\\batitle{{Observations of solar filaments at 8, 15, 22 and 43 GHz}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{71},\n\\bfpage{311}.\n\\doiurl{10.1007/BF00167554}.\n\\adsurl{1981SoPh...71..311S}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Shibasaki}, {Alissandrakis}, and\n  {Pohjolainen}}{2011}]{shi11}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Shibasaki}}, \\binits{K.}},\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Pohjolainen}}, \\binits{S.}}:\n\\byear{2011},\n\\batitle{{Radio Emission of the Quiet Sun and Active Regions (Invited\n  Review)}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{273},\n\\bfpage{309}.\n\\doiurl{10.1007/s11207-011-9788-4}.\n\\adsurl{2011SoPh..273..309S}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Strong}, {Alissandrakis}, and\n  {Kundu}}{1984}]{str84}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Strong}}, \\binits{K.T.}},\n\\bauthor{\\bsnm{{Alissandrakis}}, \\binits{C.E.}},\n\\bauthor{\\bsnm{{Kundu}}, \\binits{M.R.}}:\n\\byear{1984},\n\\batitle{{Interpretation of microwave active region structures using SMM soft\n  X-ray observations}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{277},\n\\bfpage{865}.\n\\doiurl{10.1086/161757}.\n\\adsurl{1984ApJ...277..865S}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Subramanian} and {Dere}}{2001}]{sub01}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Subramanian}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Dere}}, \\binits{K.P.}}:\n\\byear{2001},\n\\batitle{{Source Regions of Coronal Mass Ejections}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{561},\n\\bfpage{372}.\n\\doiurl{10.1086/323213}.\n\\adsurl{2001ApJ...561..372S}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Sych}, {Uralov}, and\n  {Korzhavin}}{1993}]{sych93}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Sych}}, \\binits{R.A.}},\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Korzhavin}}, \\binits{A.N.}}:\n\\byear{1993},\n\\batitle{{Radio observations of compact solar sources located between\n  sunspots}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{144},\n\\bfpage{59}.\n\\doiurl{10.1007/BF00667982}.\n\\adsurl{1993SoPh..144...59S}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Tandberg-Hanssen}}{1995}]{tan95}\n\\begin{bbook}\n\\beditor{\\bsnm{{Tandberg-Hanssen}}, \\binits{E.}} (ed.):\n\\byear{1995},\n\\bbtitle{{The nature of solar prominences}},\n\\bsertitle{Astrophysics and Space Science Library}\n\\bseriesno{199}.\n\\adsurl{1995ASSL..199.....T}.\n\\end{bbook}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{T{\\\"o}r{\\\"o}k} and {Kliem}}{2005}]{torok05}\n\\begin{barticle}\n\\bauthor{\\bsnm{{T{\\\"o}r{\\\"o}k}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Kliem}}, \\binits{B.}}:\n\\byear{2005},\n\\batitle{{Confined and Ejective Eruptions of Kink-unstable Flux Ropes}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{630},\n\\bfpage{L97}.\n\\doiurl{10.1086/462412}.\n\\adsurl{2005ApJ...630L..97T}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{T{\\\"o}r{\\\"o}k}\n  \\textit{et~al.}}{2011}]{torok11}\n\\begin{barticle}\n\\bauthor{\\bsnm{{T{\\\"o}r{\\\"o}k}}, \\binits{T.}},\n\\bauthor{\\bsnm{{Chandra}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Pariat}}, \\binits{E.}},\n\\bauthor{\\bsnm{{D{\\'e}moulin}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Schmieder}}, \\binits{B.}},\n\\bauthor{\\bsnm{{Aulanier}}, \\binits{G.}},\n\\bauthor{\\bsnm{{Linton}}, \\binits{M.G.}},\n\\bauthor{\\bsnm{{Mandrini}}, \\binits{C.H.}}:\n\\byear{2011},\n\\batitle{{Filament Interaction Modeled by Flux Rope Reconnection}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{728},\n\\bfpage{65}.\n\\doiurl{10.1088/0004-637X/728/1/65}.\n\\adsurl{2011ApJ...728...65T}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Uralov}, {Rudenko}, and\n  {Rudenko}}{2006}]{ura06}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Rudenko}}, \\binits{G.V.}},\n\\bauthor{\\bsnm{{Rudenko}}, \\binits{I.G.}}:\n\\byear{2006},\n\\batitle{{17GHz Neutral Line Associated Sources: Birth, Motion, and Projection\n  Effect}}.\n\\bjtitle{{   {\\it Pub. Astron. Soc. Japan}}}\n\\bvolume{58},\n\\bfpage{21}.\n\\doiurl{10.1093/pasj/58.1.21}.\n\\adsurl{2006PASJ...58...21U}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Uralov} \\textit{et~al.}}{2000}]{ura00}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Nakajima}}, \\binits{H.}},\n\\bauthor{\\bsnm{{Zandanov}}, \\binits{V.G.}},\n\\bauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}}:\n\\byear{2000},\n\\batitle{{Current-sheet-associated radio sources and development of the\n  magnetosphere of an active region revealed from 17 GHz and Yohkoh data}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{197},\n\\bfpage{275}.\n\\doiurl{10.1023/A:1026582416968}.\n\\adsurl{2000SoPh..197..275U}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Uralov} \\textit{et~al.}}{2002}]{ura02}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Lesovoi}}, \\binits{S.V.}},\n\\bauthor{\\bsnm{{Zandanov}}, \\binits{V.G.}},\n\\bauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}}:\n\\byear{2002},\n\\batitle{{Dual-filament initiation of a Coronal Mass Ejection: Observations and\n  Model}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{208},\n\\bfpage{69}.\n\\doiurl{10.1023/A:1019610614255}.\n\\adsurl{2002SoPh..208...69U}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Uralov} \\textit{et~al.}}{2008}]{ura08}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Uralov}}, \\binits{A.M.}},\n\\bauthor{\\bsnm{{Grechnev}}, \\binits{V.V.}},\n\\bauthor{\\bsnm{{Rudenko}}, \\binits{G.V.}},\n\\bauthor{\\bsnm{{Rudenko}}, \\binits{I.G.}},\n\\bauthor{\\bsnm{{Nakajima}}, \\binits{H.}}:\n\\byear{2008},\n\\batitle{{Microwave Neutral Line Associated Source and a Current Sheet}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{249},\n\\bfpage{315}.\n\\doiurl{10.1007/s11207-008-9183-y}.\n\\adsurl{2008SoPh..249..315U}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{van der Holst} and {Keppens}}{2007}]{vdH07}\n\\begin{barticle}\n\\bauthor{\\bsnm{{van der Holst}}, \\binits{B.}},\n\\bauthor{\\bsnm{{Keppens}}, \\binits{R.}}:\n\\byear{2007},\n\\batitle{{Hybrid block-AMR in cartesian and curvilinear coordinates: MHD\n  applications}}.\n\\bjtitle{Journal of Computational Physics}\n\\bvolume{226},\n\\bfpage{925}.\n\\doiurl{10.1016/j.jcp.2007.05.007}.\n\\adsurl{2007JCoPh.226..925V}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Xia}, {Keppens}, and {Guo}}{2014}]{xiaiso14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Xia}}, \\binits{C.}},\n\\bauthor{\\bsnm{{Keppens}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Guo}}, \\binits{Y.}}:\n\\byear{2014},\n\\batitle{{Three-dimensional Prominence-hosting Magnetic Configurations:\n  Creating a Helical Magnetic Flux Rope}}.\n\\bjtitle{{    {\\it Astrophys. J.}}}\n\\bvolume{780},\n\\bfpage{130}.\n\\doiurl{10.1088/0004-637X/780/2/130}.\n\\adsurl{2014ApJ...780..130X}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Xia} \\textit{et~al.}}{2014}]{xia14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Xia}}, \\binits{C.}},\n\\bauthor{\\bsnm{{Keppens}}, \\binits{R.}},\n\\bauthor{\\bsnm{{Antolin}}, \\binits{P.}},\n\\bauthor{\\bsnm{{Porth}}, \\binits{O.}}:\n\\byear{2014},\n\\batitle{{Simulating the in Situ Condensation Process of Solar Prominences}}.\n\\bjtitle{{   {\\it Astrophys. J. Lett.}}}\n\\bvolume{792},\n\\bfpage{L38}.\n\\doiurl{10.1088/2041-8205/792/2/L38}.\n\\adsurl{2014ApJ...792L..38X}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Yasnov}}{2014}]{yas14}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Yasnov}}, \\binits{L.V.}}:\n\\byear{2014},\n\\batitle{{On the Nature of Neutral-Line-Associated Radio Sources}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{289},\n\\bfpage{1215}.\n\\doiurl{10.1007/s11207-013-0396-3}.\n\\adsurl{2014SoPh..289.1215Y}.\n\\end{barticle}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Zheleznyakov}}{1970}]{zhe70}\n\\begin{bbook}\n\\bauthor{\\bsnm{{Zheleznyakov}}, \\binits{V.V.}}:\n\\byear{1970},\n\\bbtitle{{Radio emission of the sun and planets}}.\n\\adsurl{1970resp.book.....Z}.\n\\end{bbook}\n\\endbibitem\n\n\\bibitem[\\protect\\citeauthoryear{{Zirker}}{1989}]{zir89}\n\\begin{barticle}\n\\bauthor{\\bsnm{{Zirker}}, \\binits{J.B.}}:\n\\byear{1989},\n\\batitle{{Quiescent prominences}}.\n\\bjtitle{{\\it Solar Phys.}}\n\\bvolume{119},\n\\bfpage{341}.\n\\doiurl{10.1007/BF00146183}.\n\\adsurl{1989SoPh..119..341Z}.\n\\end{barticle}\n\\endbibitem\n\n\\end{thebibliography}\n\\end{article}\n\n", "itemtype": "equation", "pos": 28449, "prevtext": "\nwhere $(I_f^{\\sigma})_{\\mathrm{in}}$ and $(I_f^{\\sigma})_{\\mathrm{out}}$ are the emission intensities before and after the gyrolayer, and $\\tau^{\\sigma}_s$ is the gyrolayer's optical depth:\n\n", "index": 9, "text": "\\begin{equation}\n\\tau^{\\sigma}_s\\simeq\\frac{\\pi e^2n_{\\mathrm{e}}}{fmc}\\left(\\frac{k_{\\mathrm{B}}T}{mc^2}\\right)^{s-1}\\frac{s^{2s}N_{\\sigma}^{2s-3}\\sin^{2s-2}\\theta}{2^{s-1}s!}\\frac{(T_{\\sigma}\\cos\\theta+L_{\\sigma}\\sin\\theta+1)^2}{1+T_{\\sigma}^2}L_{\\mathrm{B}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\tau^{\\sigma}_{s}\\simeq\\frac{\\pi e^{2}n_{\\mathrm{e}}}{fmc}\\left(\\frac{k_{%&#10;\\mathrm{B}}T}{mc^{2}}\\right)^{s-1}\\frac{s^{2s}N_{\\sigma}^{2s-3}\\sin^{2s-2}%&#10;\\theta}{2^{s-1}s!}\\frac{(T_{\\sigma}\\cos\\theta+L_{\\sigma}\\sin\\theta+1)^{2}}{1+T%&#10;_{\\sigma}^{2}}L_{\\mathrm{B}}.\" display=\"block\"><mrow><mrow><msubsup><mi>τ</mi><mi>s</mi><mi>σ</mi></msubsup><mo>≃</mo><mrow><mfrac><mrow><mi>π</mi><mo>⁢</mo><msup><mi>e</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>n</mi><mi mathvariant=\"normal\">e</mi></msub></mrow><mrow><mi>f</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>c</mi></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub><mo>⁢</mo><mi>T</mi></mrow><mrow><mi>m</mi><mo>⁢</mo><msup><mi>c</mi><mn>2</mn></msup></mrow></mfrac><mo>)</mo></mrow><mrow><mi>s</mi><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mfrac><mrow><msup><mi>s</mi><mrow><mn>2</mn><mo>⁢</mo><mi>s</mi></mrow></msup><mo>⁢</mo><msubsup><mi>N</mi><mi>σ</mi><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>s</mi></mrow><mo>-</mo><mn>3</mn></mrow></msubsup><mo>⁢</mo><mrow><msup><mi>sin</mi><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>s</mi></mrow><mo>-</mo><mn>2</mn></mrow></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow><mrow><msup><mn>2</mn><mrow><mi>s</mi><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mi>s</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mrow></mfrac><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>T</mi><mi>σ</mi></msub><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><mo>+</mo><mrow><msub><mi>L</mi><mi>σ</mi></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>1</mn><mo>+</mo><msubsup><mi>T</mi><mi>σ</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><msub><mi>L</mi><mi mathvariant=\"normal\">B</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]