[{"file": "1601.00659.tex", "nexttext": " \nThis implies that disks with high surface densities {\\it must} develop significant turbulent motions even if stars are \nunable to stir the disks sufficiently to stabilize them, because gravitational instabilities will lead to the formation of \nclumps moving at typical velocities $\\sigma \\approx \\pi\\,G\\,\\Sigma/\\kappa.$\n\nBased on these ideas, \\citet{SGP12} conducted simulations of turbulently stirred, radiatively cooled media. These \nsimulations modeled a local patch of the galaxy as a stratified medium in which turbulence was  driven at a rate \nthat matched the overall cooling rate.  At low velocity dispersions, such as occur in the Milky Way, this configuration \nwas stable for many dynamical times. On the other hand, the critical star-formation rate density for galaxy outflows \ncorresponds to a gas surface density of $\\Sigma_{\\rm g} \\approx 100\\,{\\rm M}_\\odot\\,{\\rm pc}^{-2}$, which assuming \ntypical values of $\\Sigma \\approx 2\\,\\Sigma_{\\rm g},$ $c_s\\approx10\\,{\\rm km\\,s^{-1}}, $ and $\\kappa^{-1}\\approx 15\\,{\\rm Myr}$ \ngives one-dimensional turbulent velocity dispersion of $\\sigma \\approx 35\\,{\\rm km\\,s^{-1}}$ to have $Q_{\\rm eff} \\approx 1$.\nAt these high dispersions, \\citet{SGP12} discovered  the onset of a thermal runaway, where multiphase material moved \nupward from the disk and out of  the simulation domain, implying the absence of a stable equilibrium beyond this critical \nvalue. \n\nIn this paper, we examine effects of turbulence in Toomre-critical disks more closely by conducting three-dimensional \nnumerical simulations of a local patch of the ISM for a range of values of the total surface density $\\Sigma$  and the \nepicyclic frequency, $\\kappa$. Our goal is to better understand the varying environments in galaxies of different surface \ndensities, and the extent to which these variations lead to the direct driving of  galaxy-scale outflows and to conditions \nthat are favorable to the driving of outflows by supernovae. Motivated by the idea that large-scale gravitational instabilities \nmaintain a level of turbulence in which $Q_{\\rm eff}\\approx 1$, \nand that these instabilities primarily involve in-plane motions, we apply driven turbulence at a forcing level that \nresults in a horizontal velocity dispersion\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\pagestyle{plain}\n\\pagenumbering{arabic}\n\n\\title{Galaxy Outflows Without Supernovae}\n\\author{Sharanya Sur\\altaffilmark{1,2}, Evan Scannapieco\\altaffilmark{2}, Eve C. Ostriker\\altaffilmark{3}}\n\\altaffiltext{1}{Indian Institute of Astrophysics, 2nd Block, Koramangala, Bangalore 560034, INDIA}\n\\altaffiltext{2}{School of Earth and Space Exploration, Arizona State University, \nPO Box 876004, Tempe - 85287, USA}\n\\altaffiltext{3}{Department of Astrophysical Sciences, Princeton University, Princeton, NJ 08544, USA}\n\\email{sharanya.sur@iiap.res.in}\n\n\n\\begin{abstract}\n\nHigh surface density, rapidly star-forming galaxies are observed to have $\\approx 50-100\\,{\\rm km\\,s^{-1}}$ \nline-of-sight velocity dispersions, which are much higher than expected from supernova driving alone, but \nmay arise from large-scale gravitational instabilities. Using three-dimensional simulations of local regions of \nthe interstellar medium, we explore the impact of high velocity dispersions that arise from these disk instabilities. \nParametrizing disks by their surface densities and  epicyclic frequencies, we conduct a series of simulations \nthat probe a broad range of conditions. Turbulence is driven purely horizontally and on large scales, neglecting \nany energy input from supernovae. We find that such motions lead to strong global outflows in the highly-compact \ndisks that were common at high redshifts, but weak or negligible mass loss in the more diffuse disks that are \nprevalent today. Substantial outflows are generated  if the one-dimensional horizontal velocity dispersion exceeds \n$\\approx 35\\,{\\rm km\\,s^{-1}},$ as occurs in the dense disks that have star formation rate densities above  \n$\\approx 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}.$ These outflows are triggered by a thermal \nrunaway, arising from the inefficient cooling of  hot material coupled with successive heating from turbulent driving. \nThus, even in the absence of  stellar feedback, a critical value of the star-formation rate density for outflow generation \ncan arise due to a turbulent heating instability. This suggests that in strongly self-gravitating disks, outflows may be \nenhanced by, but need not caused by, energy input from supernovae.\n\n\\end{abstract}\n\n\\keywords{galaxies : evolution - galaxies : starburst - ISM : structure}\n\n\n\\section{Introduction}\\label{intro}\n\nMulti-wavelength observations reveal the existence of massive, galaxy-scale outflows of multiphase material, \ndriven from rapidly star-forming galaxies  \\citep{HAM90, Bomans+97, Pettini+01, Weiner+09, Martin+13, Rubin+14}. \nSuch outflows  are thought to play a fundamental role in galaxy evolution: enriching the intergalactic medium (IGM) \n\\citep{SC96, SSR02, Pichon+03, Schaye+03, Ferrara+05, Scann+06, Steidel+10, Martin+10}, shaping the galaxy \nmass-metallicity  relation \\citep{DS86, Tremonti+04, Erb+06, KE08, Mannucci10}, and affecting the baryonic content \nand number density  of dwarf galaxies \\citep{SP99, CLBF00, SFM02, Bens+03}. Outflows also aid in eliminating \nsmall-scale random magnetic fields from galactic disks \\citep{SSSB06, SSS07, CSSS14}, thereby preventing the \nlarge-scale dynamo from undergoing catastrophic quenching. Yet despite their  importance, understanding the \ndynamical and microphysical processes that control the evolution of galaxy outflows remains a challenge. \n\nOne difficulty in understanding these processes stems from the complex physics of the interstellar medium (ISM),\nwhere heating by UV photons, cosmic rays, and supernova shocks operate  in combination with \nradiative cooling processes, leading to a multiphase, supersonic medium. Given the extremely short cooling times \nand the importance of small physical scales, simulations with $\\approx$ parsec resolution are required to model the \nmultiphase gas distribution and expansion of supernova remnants directly \\citep[e.g.,][]{dAB04, Hill+12, HI14, Walch+14, \nGiri+15, KO15}.  In particular, neither the correct mass of hot gas nor the correct momentum injected to the ISM by \nsupernovae can be captured unless both the Sedov and shell formation stages are sufficiently well resolved \\citep{KO15}. \nThus, galaxy-scale numerical simulations have instead relied on a number of approximations, including: temporarily \nlowering the densities and cooling rates of heated particles \\citep{GI97, TC00,  Stinson+06, Governato+07}, using an \nempirical heating function \\citep{MMN89, MF99}, imposing an artificial  temperature floor \\citep{Suchkov+94, TT98, \nFujita+04}, and implementing exaggerated momentum kicks  \\citep{NW93, MH94}, and in the case of feedback from \nactive galactic nuclei, storing the energy until it is sufficient to raise the temperature of the surrounding gas above a \nthreshold value \\citep{VS12}.\n\nThe connection to observations is further complicated by recent claims that instead of supernovae, outflows could \nprimarily  be driven by radiation pressure on dust \\citep{TQM05, MMT11,Hopkins+11,Hopkins+12} or by \nnon-thermal pressure contributed by  cosmic rays \\citep{Soc+08, SSS10, U+12, Booth+13, Han+13, SB14}. \nIn addition, the typically high ISM Reynolds numbers of  ${\\rm Re} \\approx 10^{5}$ or greater, imply that a complete \nunderstanding of these massive outflows cannot be obtained by ignoring small-scale turbulent structures. \nInterestingly, using a numerical sub-grid model for the unresolved turbulent velocities and length scales, \n\\citet{SB10} showed that it was  possible to produce outflows of multiphase material arising from simultaneous \nturbulent heating and radiative cooling in the disk. Notwithstanding the approximate nature of the scheme \nemployed, this offers support to the standard picture that massive, galaxy scale outflows can indeed be \nproduced from  turbulence in the disk. \n\nOne hint as to the physics of galaxy outflows may lie in the properties of the galaxies that host them.  \nOutflows are observed over a wide range of galaxy masses, but in a smaller range of galaxy surface densities. \nLarge outflows are ubiquitous in galaxies in which the star-formation rate density per \nunit area exceeds a critical value of $\\dot{\\Sigma}_\\star^{\\rm cr} \\approx 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$ \n\\citep{Heckman02, H03}, while the ejection of material is more sporadic for \n$\\dot{\\Sigma}_\\star < \\dot{\\Sigma}_\\star^{\\rm cr}$ values \\citep{Chen+10}. \nRecent observations also show that disks with strong outflows are characterized by velocity dispersions between\n$\\sigma_{\\rm v}^{\\rm 1D} \\approx 50-100\\,{\\rm km\\,s^{-1}}$ \\citep{Genzel+11,Swinbank+11}. Such high  \nvelocities are difficult to obtain from supernovae acting alone, as high-resolution simulations of the ISM with a wide \nrange of SN rates show that such explosions can only drive velocities to\n$\\approx 10-20\\,{\\rm km\\,s^{-1}}$ \n\\citep{DBB06,JM06,JMB09,KKO11,KOK13, SO12, HI14, Gatto+15, Martizzi+15}. Therefore, how does \none account for such high velocity dispersions in these disks?\n\nA possible solution lies in the gravitationally-driven motions that occur in high surface density disks. The Toomre \nstability criterion \\citep{T64} relates the total disk surface density $\\Sigma$, the epicyclic frequency $\\kappa$, and \nthe sound speed $c_s$ in infinitesimally thin disks that are marginally unstable to axisymmetric modes as\n$Q \\equiv \\kappa\\,c_{s}/\\pi\\,G\\,\\Sigma = 1$, where $G$ is the gravitational constant. Allowing for \nnon-axisymmetric instabilities, magnetic fields, and interaction with a stellar disk increases the critical $Q$ value, \nwhile thick disk effects decrease it \\citep[e.g.,][]{Romeo92, KO01, KOS02, KO07, RF13}. \nIn the real ISM, turbulent velocities are comparable to the thermal sound speed of the \nwarm medium and are greater than the thermal sound speed of the cold medium. Thus any characterization of the \neffective $Q$ should depend on the total (thermal plus scale-dependent turbulent) velocity dispersion \\citep{RBA10,HR12}.\nIn addition, ISM turbulence is driven by a combination of feedback from star formation and gravitational instabilities, \nand characterizing stability in realistic disks is therefore quite complex \\citep{ARG15}. However, both Milky-Way \ntype galaxies simulations \\citep{WMN02, Agertz+09, ARG15} and high-redshift galaxy simulations\n\\citep[e.g.,][]{Imm+04, CDB10, Genel+12, GDC12} show that at sufficiently large scales \ngravitational instabilities promote an increase of the velocity dispersion, $\\sigma,$ until \n\n", "index": 1, "text": "\\begin{equation}\nQ_{\\rm eff} \\equiv [\\sigma^{2} + c_{s}^{2}]^{1/2} \\kappa/\\pi G\\Sigma \\approx 1.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"Q_{\\rm eff}\\equiv[\\sigma^{2}+c_{s}^{2}]^{1/2}\\kappa/\\pi G\\Sigma\\approx 1.\" display=\"block\"><mrow><mrow><msub><mi>Q</mi><mi>eff</mi></msub><mo>≡</mo><mrow><mrow><mrow><msup><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><msubsup><mi>c</mi><mi>s</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">]</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mi>κ</mi></mrow><mo>/</mo><mi>π</mi></mrow><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi></mrow><mo>≈</mo><mn>1</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nAs we shall show, the horizontally-driven turbulence also leads to vertical motions (at a lower amplitude), and the shocks \nfrom both horizontal and vertical motions heat the gas. Thermal pressure gradients and vertical turbulence combine to \ndrive outflows from the disk. To focus on the driving of turbulence purely by gravitational instabilities, we do not \ninclude any vertical mechanical or thermal energy input from supernovae in this study, such that all outflows obtained \nrepresent a lower limit over which stellar processes will lead to additional contributions.\n\nBecause our study is focused on obtaining a better understanding of the role of gravitational instabilities in \nchanging the nature of the medium in which stellar processes operate, we deliberately do not attempt to re-create \na full model of the ISM, in which feedback from supernovae \\citep{DBB06,KKO11,SO12}, ionization fronts\n\\citep{Matz02,Walch+12}, chemical transitions \\citep{KI00,Walch+11,dAB12}, radiation pressure \n\\citep{KT12,Sales+14}, cosmic rays \\citep{Zirak+96, Boett+13, Booth+13} and magnetic fields \n\\citep{Gressel+08, Gent+13} all play a role.  Although simulations that include this physics would be closer to \nreal galaxies, they would also be much more difficult to interpret, as we could never be sure \nhow to connect causes and effects unambiguously. \nIn this sense, simulations that start from simpler initial conditions \nand explore the role of a few free parameters are complementary to more complex ISM simulations \nin the science they are able to target.\n\nThe structure of this paper is as follows.  In Section 2 we discuss our numerical methodology. In Section\n3 we describe our results, focusing on outflow rates and phase distribution of the gas, turbulent properties, and \nthe cooling and free-fall times in the media. Conclusions are  presented in Section~4.\n\n\n\n\\section{Numerical Modeling}\\label{num}\n\nOur simulations contain only four components: (i) the equations of \ncompressible fluid dynamics; (ii) a continuously updated average  vertical gravitational acceleration \n to capture the evolution of the disk scale height in response to thermal  pressure and vertical turbulence; \n(iii) radiative cooling of atomic gas in the optically-thin limit; and (iv) purely horizontally-driven turbulence \nthat approximates the impact of gravitational instabilities in a rotating disk in the absence of stellar feedback. \n\nA self-gravitating disk with velocity dispersion $\\sigma$ has a scale height\n$H=\\sigma^2/(\\pi G \\Sigma)$. Taking this as a characteristic turbulent \nforcing scale $\\lambda_{\\rm f}$ and assuming that the effective Toomre parameter is unity so that \neq.\\ (\\ref{horzvel}) holds, we have\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nThis implies that disks with high surface densities {\\it must} develop significant turbulent motions even if stars are \nunable to stir the disks sufficiently to stabilize them, because gravitational instabilities will lead to the formation of \nclumps moving at typical velocities $\\sigma \\approx \\pi\\,G\\,\\Sigma/\\kappa.$\n\nBased on these ideas, \\citet{SGP12} conducted simulations of turbulently stirred, radiatively cooled media. These \nsimulations modeled a local patch of the galaxy as a stratified medium in which turbulence was  driven at a rate \nthat matched the overall cooling rate.  At low velocity dispersions, such as occur in the Milky Way, this configuration \nwas stable for many dynamical times. On the other hand, the critical star-formation rate density for galaxy outflows \ncorresponds to a gas surface density of $\\Sigma_{\\rm g} \\approx 100\\,{\\rm M}_\\odot\\,{\\rm pc}^{-2}$, which assuming \ntypical values of $\\Sigma \\approx 2\\,\\Sigma_{\\rm g},$ $c_s\\approx10\\,{\\rm km\\,s^{-1}}, $ and $\\kappa^{-1}\\approx 15\\,{\\rm Myr}$ \ngives one-dimensional turbulent velocity dispersion of $\\sigma \\approx 35\\,{\\rm km\\,s^{-1}}$ to have $Q_{\\rm eff} \\approx 1$.\nAt these high dispersions, \\citet{SGP12} discovered  the onset of a thermal runaway, where multiphase material moved \nupward from the disk and out of  the simulation domain, implying the absence of a stable equilibrium beyond this critical \nvalue. \n\nIn this paper, we examine effects of turbulence in Toomre-critical disks more closely by conducting three-dimensional \nnumerical simulations of a local patch of the ISM for a range of values of the total surface density $\\Sigma$  and the \nepicyclic frequency, $\\kappa$. Our goal is to better understand the varying environments in galaxies of different surface \ndensities, and the extent to which these variations lead to the direct driving of  galaxy-scale outflows and to conditions \nthat are favorable to the driving of outflows by supernovae. Motivated by the idea that large-scale gravitational instabilities \nmaintain a level of turbulence in which $Q_{\\rm eff}\\approx 1$, \nand that these instabilities primarily involve in-plane motions, we apply driven turbulence at a forcing level that \nresults in a horizontal velocity dispersion\n\n", "index": 3, "text": "\\begin{equation}\n\\sigma_{\\rm H}\\approx \\pi\\,G\\,\\Sigma/\\kappa.  \n\\label{horzvel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm H}\\approx\\pi\\,G\\,\\Sigma/\\kappa.\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mi mathvariant=\"normal\">H</mi></msub><mo>≈</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>G</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi></mrow><mo>/</mo><mi>κ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nfor the turbulent {\\it stirring} scale. In reality, power may be driven by gravitational instabilities over \na range of scales and will cascade to smaller scales via nonlinear interactions.  Here, we chose \na characteristic spatial scale for simplicity.  We note that the adopted stirring scale is comparable \nto the range where the turbulent power spectrum reaches its maximum in the shearing-box simulations \nof \\citet{KO07}, who found that the power is flat above $\\lambda_x \\approx 8 G \\Sigma/\\kappa^2$.\n\nThe simulations were conducted with the multidimensional, grid-based (magneto)-hydrodynamic \ncode FLASH  (version 4.2) \\citep{Fryxell+00}. While FLASH is capable of incorporating dynamical grids of \nvarying resolution by virtue of the adaptive mesh-refinement (AMR) technique, we chose to perform our \nsimulations  on a uniform grid with the unsplit hydrodynamic solver \\citep{Lee+09,Lee+12}, in a box of size \n$3R$ in the $x$ and $y$ directions and $-3R$ to $+3R$ in the vertical direction, where $R$ is defined by \neq.\\ (\\ref{stirscale}). \nWe adopted a $256^{2} \\times 512$ grid for the majority of our simulations, and, for the purpose \nof a resolution study,  we also conducted simulations at resolutions of $64^{2} \\times 128$, $128^{2} \\times 256$ \nand $512^{2} \\times 1024$ (see Appendix). Furthermore, we chose periodic boundary conditions in $x$ and $y$ \nand `diode' boundary conditions in the $z$ direction, which allow for outflows of material from the simulation \ndomain, but prevent inflows. \n\nThe initial conditions were characterized by two free parameters: the total matter  surface density, $\\Sigma$ \nand the epicyclic frequency, $\\kappa$. We further assumed that the gas surface density was given by\n$\\Sigma_{\\rm g} = f_{\\rm g}\\,\\Sigma$, where  the gas fraction, $f_{\\rm g},$  was fixed at 1/2 for all our \nsimulations. Because we do not know {\\em a priori} what vertical distribution the medium will take at late \ntimes, we adopted an initial density distribution that maintained the desired surface density and \napproximated the vertical distribution as an exponential profile:\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nAs we shall show, the horizontally-driven turbulence also leads to vertical motions (at a lower amplitude), and the shocks \nfrom both horizontal and vertical motions heat the gas. Thermal pressure gradients and vertical turbulence combine to \ndrive outflows from the disk. To focus on the driving of turbulence purely by gravitational instabilities, we do not \ninclude any vertical mechanical or thermal energy input from supernovae in this study, such that all outflows obtained \nrepresent a lower limit over which stellar processes will lead to additional contributions.\n\nBecause our study is focused on obtaining a better understanding of the role of gravitational instabilities in \nchanging the nature of the medium in which stellar processes operate, we deliberately do not attempt to re-create \na full model of the ISM, in which feedback from supernovae \\citep{DBB06,KKO11,SO12}, ionization fronts\n\\citep{Matz02,Walch+12}, chemical transitions \\citep{KI00,Walch+11,dAB12}, radiation pressure \n\\citep{KT12,Sales+14}, cosmic rays \\citep{Zirak+96, Boett+13, Booth+13} and magnetic fields \n\\citep{Gressel+08, Gent+13} all play a role.  Although simulations that include this physics would be closer to \nreal galaxies, they would also be much more difficult to interpret, as we could never be sure \nhow to connect causes and effects unambiguously. \nIn this sense, simulations that start from simpler initial conditions \nand explore the role of a few free parameters are complementary to more complex ISM simulations \nin the science they are able to target.\n\nThe structure of this paper is as follows.  In Section 2 we discuss our numerical methodology. In Section\n3 we describe our results, focusing on outflow rates and phase distribution of the gas, turbulent properties, and \nthe cooling and free-fall times in the media. Conclusions are  presented in Section~4.\n\n\n\n\\section{Numerical Modeling}\\label{num}\n\nOur simulations contain only four components: (i) the equations of \ncompressible fluid dynamics; (ii) a continuously updated average  vertical gravitational acceleration \n to capture the evolution of the disk scale height in response to thermal  pressure and vertical turbulence; \n(iii) radiative cooling of atomic gas in the optically-thin limit; and (iv) purely horizontally-driven turbulence \nthat approximates the impact of gravitational instabilities in a rotating disk in the absence of stellar feedback. \n\nA self-gravitating disk with velocity dispersion $\\sigma$ has a scale height\n$H=\\sigma^2/(\\pi G \\Sigma)$. Taking this as a characteristic turbulent \nforcing scale $\\lambda_{\\rm f}$ and assuming that the effective Toomre parameter is unity so that \neq.\\ (\\ref{horzvel}) holds, we have\n\n", "index": 5, "text": "\\begin{equation}\n\\lambda_{\\rm f} \\approx R \\equiv \\pi\\,G\\,\\Sigma/\\kappa^{2},\n\\label{stirscale}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{\\rm f}\\approx R\\equiv\\pi\\,G\\,\\Sigma/\\kappa^{2},\" display=\"block\"><mrow><mrow><msub><mi>λ</mi><mi mathvariant=\"normal\">f</mi></msub><mo>≈</mo><mi>R</mi><mo>≡</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>G</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi></mrow><mo>/</mo><msup><mi>κ</mi><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nwhere $C$ is a `compression' factor that relates $R$ and the initial scale height such that $H(t=0) =R/C,$\nand the  $1- \\exp(-3C)$ insures that the total surface density within the finite domain is equal to $\\Sigma.$\nIn the gradual course of the simulation, and in the absence of any other feedback processes, the scale height, \n$H$, the vertical velocity dispersion, $\\sigma_{\\rm z}$, and the disk thermal structure adjusted automatically to \nthe most compact and coldest distribution available for a given choice of $\\Sigma$ and $\\kappa$. If the \nturbulent motions were isotropic and thermal pressure support were minimal, then we would expect our \nsimulations to reach a state-state density distribution similar to eq.\\ (\\ref{eq:densityprofile}) with $C \\approx 1.$ \nHowever, if vertical turbulent motions remain smaller than horizontal ones, as we shall see is the case, then \nwe would expect much more compact distributions, corresponding to eq. (\\ref{eq:densityprofile}) with larger \n$C$ values. For the simulations presented in this paper, we have used $C = (5 - 7)$ at $t=0$. In general, this \nis somewhat more compact than the final steady-state distributions described below, \nbut because our gas distribution collapses while the turbulence is developing, we find that smaller choices \nof $C$ lead to longer delays in reaching the same  quasi-steady state. In addition, in all our simulations, we \nemployed an ideal gas equation of state with $\\gamma = 5/3$ and an atomic mass of one, an initial constant \ntemperature of $T= 2\\times10^{5}\\,{\\rm K},$ and zero initial velocities.\n \nBecause our simulations were not conducted in a shearing-box in which large scale gravitational \nforces are opposed by centrifugal and Coriolis forces, and because we do not incorporate sink particles to \nhandle the collapse of Jeans-unstable gas, we cannot simply implement self-gravity in our simulations.\nThus we adopted an idealized approach. First, to include the impact of gravity on the overall vertical profile of \nthe gas, we computed a vertical acceleration that was a time-dependent function of $z$, and did not depend on \n$x$ and $y$. The time dependence ensures that the system finds its own vertical scale-height in course of the \nsimulation, rather than having the user guess a scale-height a priori, as would be the case if the user were to \nspecify a gravitational profile at runtime. Second, we added a horizontal stochastic driving term, to include the \nimpact of large-scale horizontal turbulent motions driven by gravity. \n\nTo compute the vertical gravity, at every time step we calculated a vertical acceleration \nprofile, $g(z),$ directly from the average vertical mass profile as\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nfor the turbulent {\\it stirring} scale. In reality, power may be driven by gravitational instabilities over \na range of scales and will cascade to smaller scales via nonlinear interactions.  Here, we chose \na characteristic spatial scale for simplicity.  We note that the adopted stirring scale is comparable \nto the range where the turbulent power spectrum reaches its maximum in the shearing-box simulations \nof \\citet{KO07}, who found that the power is flat above $\\lambda_x \\approx 8 G \\Sigma/\\kappa^2$.\n\nThe simulations were conducted with the multidimensional, grid-based (magneto)-hydrodynamic \ncode FLASH  (version 4.2) \\citep{Fryxell+00}. While FLASH is capable of incorporating dynamical grids of \nvarying resolution by virtue of the adaptive mesh-refinement (AMR) technique, we chose to perform our \nsimulations  on a uniform grid with the unsplit hydrodynamic solver \\citep{Lee+09,Lee+12}, in a box of size \n$3R$ in the $x$ and $y$ directions and $-3R$ to $+3R$ in the vertical direction, where $R$ is defined by \neq.\\ (\\ref{stirscale}). \nWe adopted a $256^{2} \\times 512$ grid for the majority of our simulations, and, for the purpose \nof a resolution study,  we also conducted simulations at resolutions of $64^{2} \\times 128$, $128^{2} \\times 256$ \nand $512^{2} \\times 1024$ (see Appendix). Furthermore, we chose periodic boundary conditions in $x$ and $y$ \nand `diode' boundary conditions in the $z$ direction, which allow for outflows of material from the simulation \ndomain, but prevent inflows. \n\nThe initial conditions were characterized by two free parameters: the total matter  surface density, $\\Sigma$ \nand the epicyclic frequency, $\\kappa$. We further assumed that the gas surface density was given by\n$\\Sigma_{\\rm g} = f_{\\rm g}\\,\\Sigma$, where  the gas fraction, $f_{\\rm g},$  was fixed at 1/2 for all our \nsimulations. Because we do not know {\\em a priori} what vertical distribution the medium will take at late \ntimes, we adopted an initial density distribution that maintained the desired surface density and \napproximated the vertical distribution as an exponential profile:\n\n", "index": 7, "text": "\\begin{equation}\n\\rho = \\frac{\\Sigma}{2 R/C} \\exp\\left( \\frac{-|z|}{R/C}\\right) \\frac{1}{1- \\exp(-3C)},\n\\label{eq:densityprofile}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\rho=\\frac{\\Sigma}{2R/C}\\exp\\left(\\frac{-|z|}{R/C}\\right)\\frac{1}{1-\\exp(-3C)},\" display=\"block\"><mrow><mrow><mi>ρ</mi><mo>=</mo><mrow><mfrac><mi mathvariant=\"normal\">Σ</mi><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>R</mi></mrow><mo>/</mo><mi>C</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mo>-</mo><mrow><mo stretchy=\"false\">|</mo><mi>z</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mrow><mi>R</mi><mo>/</mo><mi>C</mi></mrow></mfrac><mo>)</mo></mrow></mrow><mo>⁢</mo><mfrac><mn>1</mn><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><mn>3</mn><mo>⁢</mo><mi>C</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nwhere we approximate $d\\Sigma/dz$ as $(1/f)d\\Sigma_{\\rm g}/dz$. \nBecause this acceleration is a function of height and not of horizontal position, it does not directly drive turbulence.\nTo implement turbulent driving as would be induced by large-scale gravitational instability,\nwe used a version of the stirring module in FLASH, adapted from \none of our recent studies \\citep{Sur+14}, which models  turbulent driving random motions as a stochastic \nOrnstein-Uhlenbeck (OU) process  \\citep{EP88, Benzi+08}. Specifically, this corresponds to a Gaussian random \nvector field, ${\\mbox{\\boldmath $F$} {}}$, with an exponential  temporal correlation, $t_{\\rm f}$, in the momentum equation. \n\nWe drove turbulence  in the range of wavenumbers $2\\leq |{\\bf{k}}|\\,L/2\\pi \\leq 3$, such that the average forcing \nwavenumber was $k_{\\rm f}\\,L/2\\pi\\simeq2.5$.  Here $L = 3R$ is the horizontal extent of the box and the wave \nvector $|{\\bf k}| = \\sqrt{(k_{x}^2 + k_{y}^2 + k_{z}^2)}$. This corresponds to a turbulent driving scale, \n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nwhere $C$ is a `compression' factor that relates $R$ and the initial scale height such that $H(t=0) =R/C,$\nand the  $1- \\exp(-3C)$ insures that the total surface density within the finite domain is equal to $\\Sigma.$\nIn the gradual course of the simulation, and in the absence of any other feedback processes, the scale height, \n$H$, the vertical velocity dispersion, $\\sigma_{\\rm z}$, and the disk thermal structure adjusted automatically to \nthe most compact and coldest distribution available for a given choice of $\\Sigma$ and $\\kappa$. If the \nturbulent motions were isotropic and thermal pressure support were minimal, then we would expect our \nsimulations to reach a state-state density distribution similar to eq.\\ (\\ref{eq:densityprofile}) with $C \\approx 1.$ \nHowever, if vertical turbulent motions remain smaller than horizontal ones, as we shall see is the case, then \nwe would expect much more compact distributions, corresponding to eq. (\\ref{eq:densityprofile}) with larger \n$C$ values. For the simulations presented in this paper, we have used $C = (5 - 7)$ at $t=0$. In general, this \nis somewhat more compact than the final steady-state distributions described below, \nbut because our gas distribution collapses while the turbulence is developing, we find that smaller choices \nof $C$ lead to longer delays in reaching the same  quasi-steady state. In addition, in all our simulations, we \nemployed an ideal gas equation of state with $\\gamma = 5/3$ and an atomic mass of one, an initial constant \ntemperature of $T= 2\\times10^{5}\\,{\\rm K},$ and zero initial velocities.\n \nBecause our simulations were not conducted in a shearing-box in which large scale gravitational \nforces are opposed by centrifugal and Coriolis forces, and because we do not incorporate sink particles to \nhandle the collapse of Jeans-unstable gas, we cannot simply implement self-gravity in our simulations.\nThus we adopted an idealized approach. First, to include the impact of gravity on the overall vertical profile of \nthe gas, we computed a vertical acceleration that was a time-dependent function of $z$, and did not depend on \n$x$ and $y$. The time dependence ensures that the system finds its own vertical scale-height in course of the \nsimulation, rather than having the user guess a scale-height a priori, as would be the case if the user were to \nspecify a gravitational profile at runtime. Second, we added a horizontal stochastic driving term, to include the \nimpact of large-scale horizontal turbulent motions driven by gravity. \n\nTo compute the vertical gravity, at every time step we calculated a vertical acceleration \nprofile, $g(z),$ directly from the average vertical mass profile as\n\n", "index": 9, "text": "\\begin{equation}\ng(|z|) = 2\\pi G\\int_{-|z|}^{|z|}\\left|\\frac{d\\Sigma}{dz}\\right | dz,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"g(|z|)=2\\pi G\\int_{-|z|}^{|z|}\\left|\\frac{d\\Sigma}{dz}\\right|dz,\" display=\"block\"><mrow><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mi>z</mi><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">|</mo><mi>z</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mrow><mo stretchy=\"false\">|</mo><mi>z</mi><mo stretchy=\"false\">|</mo></mrow></msubsup><mrow><mrow><mo>|</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>z</mi></mrow></mfrac><mo>|</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>z</mi></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nSince we wish to restrict driving of turbulence to a two-dimensional plane (to simulate the effect of self-gravity within a disk), we modified our routines to force only the \nhorizontal component of the velocity.\nThe correlation time  of turbulence, $t_{\\rm f},$ was chosen to be  $\\approx 0.1\\,t_{\\rm ed}$, where \n\n", "itemtype": "equation", "pos": 19804, "prevtext": " \nwhere we approximate $d\\Sigma/dz$ as $(1/f)d\\Sigma_{\\rm g}/dz$. \nBecause this acceleration is a function of height and not of horizontal position, it does not directly drive turbulence.\nTo implement turbulent driving as would be induced by large-scale gravitational instability,\nwe used a version of the stirring module in FLASH, adapted from \none of our recent studies \\citep{Sur+14}, which models  turbulent driving random motions as a stochastic \nOrnstein-Uhlenbeck (OU) process  \\citep{EP88, Benzi+08}. Specifically, this corresponds to a Gaussian random \nvector field, ${\\mbox{\\boldmath $F$} {}}$, with an exponential  temporal correlation, $t_{\\rm f}$, in the momentum equation. \n\nWe drove turbulence  in the range of wavenumbers $2\\leq |{\\bf{k}}|\\,L/2\\pi \\leq 3$, such that the average forcing \nwavenumber was $k_{\\rm f}\\,L/2\\pi\\simeq2.5$.  Here $L = 3R$ is the horizontal extent of the box and the wave \nvector $|{\\bf k}| = \\sqrt{(k_{x}^2 + k_{y}^2 + k_{z}^2)}$. This corresponds to a turbulent driving scale, \n\n", "index": 11, "text": "\\begin{equation}\nL_{\\rm f} = 2\\,\\pi/k_{\\rm f} = 1.2\\,R. \n\\label{fscale}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"L_{\\rm f}=2\\,\\pi/k_{\\rm f}=1.2\\,R.\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mi mathvariant=\"normal\">f</mi></msub><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mi>π</mi></mrow><mo>/</mo><msub><mi>k</mi><mi mathvariant=\"normal\">f</mi></msub></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mn>1.2</mn></mpadded><mo>⁢</mo><mi>R</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nis the eddy-turnover time. For a given value of $\\Sigma$ and $\\kappa$, \nthe amplitude of the forcing was adjusted  to get the desired value of $\\sigma_{\\rm H}=\\pi\\,G\\,\\Sigma/\\kappa$. \nNote that choosing a different value  of $t_{\\rm f}$ would require re-adjusting the forcing amplitude \nso as to obtain the correct value of $\\sigma_{\\rm H}$. \n\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig1.pdf}\n\\caption{Total   atomic, ionic, and Bremsstrahlung\ncooling rate (top panel) and the cooling time (bottom panel) as a function of the temperature for solar \nmetallicity material. Note that the cooling rate drops above $T\\approx 2.5\\times 10^{5}\\,{\\rm K}$, leading \nto an increase in the cooling timescale.}\n\\label{cool_curve}\n\\end{figure}\n\n\nThe majority of the energy input from turbulent driving in our simulations leaves the system through radiative cooling, \nas it does in a real galaxy. Following the prescription of \\citet{GS10}, we implemented  \natomic, ionic, and Bremsstrahlung cooling\nin the optically thin limit, assuming local collisional equilibrium with, \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nSince we wish to restrict driving of turbulence to a two-dimensional plane (to simulate the effect of self-gravity within a disk), we modified our routines to force only the \nhorizontal component of the velocity.\nThe correlation time  of turbulence, $t_{\\rm f},$ was chosen to be  $\\approx 0.1\\,t_{\\rm ed}$, where \n\n", "index": 13, "text": "\\begin{equation}\nt_{\\rm ed} = L_{\\rm f}/\\sigma_{\\rm H} = 1.2\\,\\kappa^{-1},\n\\label{teddy}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm ed}=L_{\\rm f}/\\sigma_{\\rm H}=1.2\\,\\kappa^{-1},\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>ed</mi></msub><mo>=</mo><mrow><msub><mi>L</mi><mi mathvariant=\"normal\">f</mi></msub><mo>/</mo><msub><mi>σ</mi><mi mathvariant=\"normal\">H</mi></msub></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mn>1.2</mn></mpadded><mo>⁢</mo><msup><mi>κ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nHere $\\dot E_{\\rm cool}$ is the radiated energy per unit mass, $\\rho$ is the density in the cell, $m_p$ is the \nproton mass, $Y$ is the helium mass fraction, $\\mu$ the mean atomic mass, and $\\Lambda(T,Z)$ is the cooling \nrate as a function of temperature and metallicity.  For the cooling source terms, we implemented a sub-cycling \nscheme \\citep{GS10}, such that $T$ and $\\Lambda(T,Z)$  were recalculated every time \n$E_{\\rm cool}/E > 0.1$. This is equivalent to an integral formalism that assumes a constant density over each \nhydrodynamic time step \\citep{TC92, STD01}. Furthermore, in order to help the simulations reach quasi steady-state \nconditions more quickly, cooling is disabled for the first $0.5\\,R/\\sigma_{\\rm H}$ time of the simulation, to avoid \nexcessive vertical collapse while the disk gains an initial level of turbulence. \n\nThe cooling rates were calculated using the tables compiled by \\citet{WSS09} making the simplifying \napproximation that the metallicity is always solar and that the abundance ratios of the metals \nalways occurs in solar proportions.\nIn the upper panel of Figure~\\ref{cool_curve}, we show the total radiative cooling \nrate as a function of the temperature. The lower panel shows the behavior of the local \ncooling timescale defined as the ratio of the energy per unit volume to the radiative cooling rate per \nunit volume, \n\n", "itemtype": "equation", "pos": 21404, "prevtext": " \nis the eddy-turnover time. For a given value of $\\Sigma$ and $\\kappa$, \nthe amplitude of the forcing was adjusted  to get the desired value of $\\sigma_{\\rm H}=\\pi\\,G\\,\\Sigma/\\kappa$. \nNote that choosing a different value  of $t_{\\rm f}$ would require re-adjusting the forcing amplitude \nso as to obtain the correct value of $\\sigma_{\\rm H}$. \n\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig1.pdf}\n\\caption{Total   atomic, ionic, and Bremsstrahlung\ncooling rate (top panel) and the cooling time (bottom panel) as a function of the temperature for solar \nmetallicity material. Note that the cooling rate drops above $T\\approx 2.5\\times 10^{5}\\,{\\rm K}$, leading \nto an increase in the cooling timescale.}\n\\label{cool_curve}\n\\end{figure}\n\n\nThe majority of the energy input from turbulent driving in our simulations leaves the system through radiative cooling, \nas it does in a real galaxy. Following the prescription of \\citet{GS10}, we implemented  \natomic, ionic, and Bremsstrahlung cooling\nin the optically thin limit, assuming local collisional equilibrium with, \n\n", "index": 15, "text": "\\begin{equation}\n\\dot E_{\\rm cool}  =  (1-Y)(1-Y/2) \\frac{\\rho \\Lambda(T,Z)}{(\\mu m_p)^2}. \n\\label{eq:ecool}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\dot{E}_{\\rm cool}=(1-Y)(1-Y/2)\\frac{\\rho\\Lambda(T,Z)}{(\\mu m_{p})^{2}}.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>E</mi><mo>˙</mo></mover><mi>cool</mi></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>Y</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>Y</mi><mo>/</mo><mn>2</mn></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>ρ</mi><mo>⁢</mo><mi mathvariant=\"normal\">Λ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>Z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>μ</mi><mo>⁢</mo><msub><mi>m</mi><mi>p</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nwhere $k_{B}$ is the Boltzmann constant and $n = \\rho/\\mu\\,m_{p}$ is the number density of the gas. \n\n \nFollowing the nomenclature introduced by \\citet{Wolf+95, Wolf+03}, much of the interstellar medium can be described \nas comprised of a cold neutral medium (CNM) with $T  \\approx 100{\\rm K}$, a warm neutral medium (WNM) with \ntemperatures in the range, $T \\approx 6\\times 10^{3} - 10^{4}\\,{\\rm K}$ and a hot ionized medium (HIM) with \n$T \\geq 10^{6}\\,{\\rm K}$. As Figure~\\ref{cool_curve} shows, we have only considered cooling in the temperature \nrange $T \\approx 10^{3} - 10^{7}\\,{\\rm K}$ and up to a maximum density of $n_{\\rm max} = 6.0 \\times 10^{7}\\,{\\rm cm^{-3}}$.\nWe note that the colder parts of the ISM occupy a small fraction of the volume (only a few percent), and while they \nare important for star formation, they interact much less strongly with the hot medium than the warm gas that occupies\nmost of the volume. \nSince our goal is to capture the formation of galaxy outflows which are mainly comprised of hot gas in the temperature \nrange $T \\approx 10^{6} - 10^{7}\\,{\\rm K}$, we to lowest order neglect the inclusion of the cold dense phases of the \nISM in our simulations. We therefore do not include low-temperature cooling instead placing a temperature floor at \n1000 K throughout the simulations. This therefore amounts to adopting a simplified description of the multi-phase ISM, \nwhich as we shall show in later sections is sufficient for the physical problem at hand. In a test case, we \nlowered the temperature floor to $300$ K and found the mass outflow rates to remain unchanged (see Appendix). \n\nAt temperatures $T \\approx 10^{4}-10^{6.5}\\,{\\rm K}$, cooling results mainly from  line emission, \nwhile cooling due to bremsstrahlung (free-free emission) becomes important at temperatures \n$\\geqslant 10^{7}\\,{\\rm K}$. \nBelow $10^{4}\\,{\\rm K}$, collisions are not energetic enough to excite atomic transitions, \nleading to a drop in the cooling rate. \nThe atomic cooling rate attains a  peak value of $\\Lambda\\approx 10^{-21}\\,{\\rm ergs\\,cm^{3}\\,s^{-1}}$ in the \ntemperature range $T \\approx (1 - 2.5)\\times10^{5}\\,{\\rm K}$. In this regime, the cooling time is \nroughly constant as seen in the lower panel of the plot. The peak at $T\\approx 2.5\\times10^{5}\\,{\\rm K}$ is \ndominated by line emission from metal ions, whose atomic energy levels are easily excited by collisions \nat this temperature. However, beyond $T\\approx 2.5\\times10^{5}\\,{\\rm K}$, most of the atoms become fully \nionized, the effectiveness of the line cooling decreases, and the cooling rate drops, leading to a \ngradual increase in the cooling time. What this implies for the nature of the multiphase medium will be \ndiscussed in the next section. \n\n\n\n\\section{Results}\\label{results}\n\n\\subsection{Outflow Rates}\n\nAs our goal is to obtain a better understanding of the turbulent ISM as a function of galaxy properties, we conducted\n a suite of simulations with different values of the gas surface \ndensity, $\\Sigma_{\\rm g},$ and the epicyclic frequency, $\\kappa$. In Table~\\ref{sumsim}, we present a summary of \nthe properties of these simulations, including the run parameters ($\\Sigma_{\\rm g}$, $\\kappa$),\nthe key quantities for each model that can be directly derived from these parameters - the forcing scale $L_{\\rm f}$, \nbox size above the midplane, $z_{\\rm max} = 3R$, the resolution $dz= z_{\\rm max} /256$, \nthe horizontal velocity dispersion $\\sigma_{\\rm H}$, and the escape velocity $v_{\\rm es}$,\nand the quantities that can only be measured from \nthe full simulations - the vertical velocity dispersion $\\sigma_{\\rm z}$, the scale-height $H$, and the mass loss \nrate $\\dot{\\Sigma}_{\\rm g}$.\nThe idealized nature of our simulations  enables us to probe a wide parameter space, with \n$\\Sigma_{\\rm g} \\in [50, 500]\\,{\\rm M_\\odot\\,pc^{-2}}$ and  $\\kappa^{-1} \\in [6.5, 30]\\,{\\rm Myr}.$ \nNote however that for runs with $\\kappa^{-1}=30\\,{\\rm Myr}$, simulations with an initial \n$\\Sigma_{\\rm g} > 75\\,{\\rm M}_\\odot\\,{\\rm pc}^{-2}$ result in box sizes that are larger than the typical size of entire\ndisk galaxies, and we have therefore chosen to omit such simulations from our study.\n\n\n\\begin{table*}[ht!]\n\\begin{minipage}{170mm}\n\\begin{center}\n\\resizebox{\\textwidth}{!}{\n\\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|} \\hline \\hline \nSimulation & $\\Sigma_{\\rm g}$ & $\\kappa^{-1}$ & $L_{\\rm f}$ & $z_{\\rm max}$ & $dz$ & $H$ & \n$\\bar{\\sigma}_{\\rm H}^{\\rm 1D}$ & $\\bar{\\sigma}_{\\rm z}$ & $v_{\\rm es}$ & $\\dot{\\Sigma_{\\rm g}}$ \\\\\nName & $[{\\rm M}_{\\odot}\\,{\\rm pc^{-2}}]$ & $[\\rm {Myr}]$ & [pc] & [kpc] & [pc] & \n[pc] & $[\\rm km\\,s^{-1}]$ & $[\\rm {km\\,s^{-1}}]$ & $[{\\rm km\\,s^{-1}}]$ & $[{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}] $ \\\\ \\hline \\hline\nS500K6.5* & $500$ & $6.5$ &  $723$ & $1.80$ & $7.03$ & $7.0$ & $68$ & $5.0$ & $309$ & $0.22$ \\\\ \\hline\nS250K6.5* & $250$ & $6.5$ & $362$ & $0.9$ & $3.50$ & $9.4$ & $35$ & $5.5$ & $155$ & $0.073$ \\\\ \\hline\nS150K6.5* & $150$ & $6.5$ & $217$ & $0.53$ & $2.10$ & $17$ & $21$ & $6.3$ & $92$ & $0.04$ \\\\ \\hline\nS250K10* & $250$ & $10$ & $856$ & $2.13$ & $8.32$ & $11$ & $50$ & $5.5$ & $238$ & $0.06$ \\\\ \\hline\nS150K10* & $150$ & $10$ & $514$ & $1.27$ & $4.96$ & $20$ & $32$ & $6.0$ & $142$ & $0.03$ \\\\ \\hline\nS100K10 & $100$ & $10$ &  $342$ & $0.85$ & $3.32$ & $27$ & $21$ & $6.2$ & $95$ & $0.017$ \\\\ \\hline\nS150K20* & $150$ & $20$ & $2054$ & $5.12$ & $20.0$ & $22$ & $60$ & $5.0$ & $285$ & $0.03$ \\\\ \\hline\nS100K20* & $100$ & $20$ &  $1369$ & $3.40$ & $13.2$ & $26$ & $53$ & $5.0$ & $190$ & $0.02$ \\\\ \\hline\nS75K20 & $75$ & $20$ & $1027$ & $2.56$ & $10.0$ & $35$ & $30$ & $6.0$ & $143$ & $0.009$ \\\\ \\hline\nS50K20 & $50$ & $20$ & $685$  & $1.70$ & $6.64$ & $53$ & $21$ & $6.3$ & $95$ & $0.004$ \\\\ \\hline\nS75K30 & $75$ & $30$ &  $2311$ & $5.74$ & $22.4$ & $33$ & $45$ & $5.8$ & $214$ & 0.005 \\\\ \\hline\nS50K30 & $50$ & $30$ &  $1541$ & $3.83$ & $15.0$ & $50$ & $30$ & $6.0$ & $143$ & $0.004$ \\\\ \\hline \\hline \n\\end{tabular}\n}\n\\end{center}\n\\caption{  \nSummary of the simulation runs at a uniform grid resolution of \n$256^{2} \\times 512$. The different columns from the left to the right are - 1) Simulation name, 2) Gas surface density, \n3) Inverse of the epicyclic frequency, 4) the horizontal forcing scale, $L_{\\rm f} = 1.2R$, 5) box size above \nthe midplane, 6) the resolution, 7) vertical scale height obtained from equation~(\\ref{vertscale}), 8) time-averaged \nmass-weighted 1D horizontal velocity dispersion, 9) time-averaged mass-weighted vertical velocity dispersion, \n10) escape velocity of the gas as defined by equation~(\\ref{ves}), and 11) the mass loss rate. Simulations that\nshow persistent outflows for many eddy-turnover times are marked by an *. }\n\\label{sumsim}\n\\end{minipage}\n\\end{table*}\n\n\nOur motivation for using a broad range of values is to capture the properties of high surface density galaxies over \na broad range of masses and redshifts.\nSeveral attempts have been made to make  predictions about the evolution of \nthe galaxy size with redshift \\citep[see][for recent reviews]{Shapley11, SM12, Con14}, and \nobservational studies  have shown that distant galaxies are \nmore compact than those of the same mass in the nearby Universe \n\\citep[e.g.,][]{Daddi+05, Trujillo+07, Buitrago+08, vanDok+10}. From these studies, the dependence of  \ngalaxy size with redshift selected at a constant stellar mass can be roughly characterized as a power \nlaw of the form $R \\propto (1+z)^{-\\alpha},$ although \\citet{Ferg+04} find $ R \\propto H^{-1}(z)$ from $z \\approx 1-5$,  \nwhere $H(z)$ is the Hubble parameter. \nAssuming, for simplicity, a power law relation between the galaxy size and redshift,   it can be \nshown that the epicyclic frequency for a fixed mass, scales as $\\kappa\\propto \\Sigma_{\\rm g}^{1/2}\\,(1+z)^{\\alpha/2},$ \nwhile the surface density at fixed mass scales as $\\Sigma_{\\rm g}\\propto(1+z)^{2\\alpha}$. \nThese scalings imply that star-forming galaxies at higher redshifts are both more compact \n(i.e., have larger values of $\\Sigma_{\\rm g}$) and are more rapidly rotating (i.e., have lower values of $\\kappa^{-1}$) \nthan their local counterparts.  As we show below, this allows us to make some quantitative statements \nabout the role of gravity-driven turbulence in powering outflows in distant galaxies. This is all the more important as \nthe integrated star-formation rate peaks at $z\\approx 2$ \\citep[see][for a review]{MD14}. \n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig2.pdf} \n\\caption{(color online). The upper panel shows the averaged gas mass loss rate as a function of\n$\\Sigma_{\\rm g}$ for different values of $\\kappa^{-1}$. Filled symbols denote runs where the computed \ngas mass loss rate $\\geqslant 0.02 \\,{\\rm M_\\odot\\,yr^{-1}\\,kpc^{-2}}$ (horizontal dashed line). The lower \npanel shows the ratio $\\eta$ of the gas mass loss rate and the star formation rate (where the star formation \nrate is obtained from equation~\\ref{kenlaw}). The inset panel shows the adopted variation of the star \nformation rate as a function of the gas surface density while the dashed line denotes the `Heckman limit'. \nThe filled (open) symbols in these panels follow the convention of those in panel 2(a). }\n\\label{starform}\n\\end{figure}\n\n\nIn the top panel of Figure~\\ref{starform}, we show the variation of the averaged gas mass loss rate as a function of \n$\\Sigma_{\\rm g}$ for different values of $\\kappa^{-1}$. The filled symbols denote runs where we find outflows with\n$\\dot{\\Sigma}_{\\rm g} \\geqslant 0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2},$ persisting over many \neddy-turnover times in disks. Below this threshold, outflows appear to be sporadic or absent with negligible values of \n$\\dot{\\Sigma}_{\\rm g}$ (denoted by open symbols), as \nobserved in lower surface density galaxies  \\citep{Chen+10}. In panel 2(b) we show the variation of the ratio of\n $\\eta = \\dot{\\Sigma}_{\\rm g}/\\dot{\\Sigma}_{\\star}$, \nwhereas the inset figure shows the variation of the star-formation rate alone;   for this purpose we have adopted\nthe \\cite{Ken98} fit to the  star-formation rate density as a function of $(\\Sigma_{\\rm g}, \\kappa^{-1})$\n\n", "itemtype": "equation", "pos": 22896, "prevtext": "\nHere $\\dot E_{\\rm cool}$ is the radiated energy per unit mass, $\\rho$ is the density in the cell, $m_p$ is the \nproton mass, $Y$ is the helium mass fraction, $\\mu$ the mean atomic mass, and $\\Lambda(T,Z)$ is the cooling \nrate as a function of temperature and metallicity.  For the cooling source terms, we implemented a sub-cycling \nscheme \\citep{GS10}, such that $T$ and $\\Lambda(T,Z)$  were recalculated every time \n$E_{\\rm cool}/E > 0.1$. This is equivalent to an integral formalism that assumes a constant density over each \nhydrodynamic time step \\citep{TC92, STD01}. Furthermore, in order to help the simulations reach quasi steady-state \nconditions more quickly, cooling is disabled for the first $0.5\\,R/\\sigma_{\\rm H}$ time of the simulation, to avoid \nexcessive vertical collapse while the disk gains an initial level of turbulence. \n\nThe cooling rates were calculated using the tables compiled by \\citet{WSS09} making the simplifying \napproximation that the metallicity is always solar and that the abundance ratios of the metals \nalways occurs in solar proportions.\nIn the upper panel of Figure~\\ref{cool_curve}, we show the total radiative cooling \nrate as a function of the temperature. The lower panel shows the behavior of the local \ncooling timescale defined as the ratio of the energy per unit volume to the radiative cooling rate per \nunit volume, \n\n", "index": 17, "text": "\\begin{equation}\nt_{\\rm cool} \\equiv 1.5 nk_{B}T/(\\rho\\,\\dot{E}_{\\rm cool}) \\propto \\rho^{-1}, \n\\label{tcool}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm cool}\\equiv 1.5nk_{B}T/(\\rho\\,\\dot{E}_{\\rm cool})\\propto\\rho^{-1},\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>cool</mi></msub><mo>≡</mo><mrow><mrow><mn>1.5</mn><mo>⁢</mo><mi>n</mi><mo>⁢</mo><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mpadded width=\"+1.7pt\"><mi>ρ</mi></mpadded><mo>⁢</mo><msub><mover accent=\"true\"><mi>E</mi><mo>˙</mo></mover><mi>cool</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><msup><mi>ρ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": " \nwhere $\\Omega$ is the angular velocity and in the last equality, we have assumed $\\kappa = \\sqrt{2}\\Omega$, as \nappropriate for a flat rotation curve. The symbols (open and filled) follow the convention of those in panel 2(a). \n\nWe recall that large-scale outflows are most likely to occur in systems in which the star-formation \nrate, $\\dot{\\Sigma}_\\star \\geqslant 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$. This implies that for each pair of values \nof $\\Sigma_{\\rm g}$ and $\\kappa^{-1}$, massive outflows are expected for all runs except for: S50K30, S75K30, S50K20, \nS75K20, S100K20 and S150K20. Comparing with the gas mass loss rate plotted in panel 2(a), we find that runs S50K30, \nS75K30, S50K20 and S75K20 show very weak outflows (i.e. below the threshold value of \n$0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$).\nAmong the other two runs, the mass loss rates in S100K20 and S150K20 are on and above the threshold \nvalue respectively. Run S100K10  lies above the `Heckman limit,' but shows only a weak outflow. The \nratio ($\\eta$) of the gas mass loss rate and the star formation rate for runs with $\\kappa^{-1} = 6.5$ and $10\\,{\\rm Myr}$ \nstays nearly constant, {\\bf $\\eta \\approx 0.1$}. However, for $\\kappa^{-1} = 20\\,{\\rm Myr}$, $\\eta$ varies weakly with \n$\\Sigma_{\\rm g}$ for runs both above and below the Heckman limit. The trend for $\\kappa^{-1} = 30\\,{\\rm Myr}$ is \nunclear due to our choice of simulation parameters of $\\Sigma_{\\rm g}$. \n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig3.pdf}\n\\caption{(color online). A 3D rendering of the density in the run S250K10, showing the gradual evolution of\nthe outflow at four different times starting from $t = 312$ to $319\\,{\\rm Myr}$ (left to right). For clarity of \nthe color contrast, we have restricted the density range from ${\\rm log}\\,\\rho = -30.50$ to $-24\\,[{\\rm g\\,cm^{-3}}]$. \nPlumes of gas move away from the disk mid plane and leave the simulation domain through the vertical boundaries.}\n\\label{3drend}\n\\end{figure*}\n\n\nIn Figure~\\ref{3drend}, we show a three-dimensional rendering of the density at four different times, in a run \nwith $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$ and $\\kappa^{-1} = 10\\,{\\rm Myr}$. These volume \nrenderings show the evolution of an outflow with plumes moving gradually both upwards and downwards from \nthe midplane, eventually leaving the simulation domain.\nNote that the question of whether the ejected material is able to leave the simulation domain depends on \nwhether the outflow velocity exceeds the escape velocity, which varies from simulation to simulation in our study.\nSpecifically, given the vertical extent of the box above the \nmidplane and the gas surface density, the critical velocity required to escape the gravitational potential of the \nhost galaxy is given by \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $k_{B}$ is the Boltzmann constant and $n = \\rho/\\mu\\,m_{p}$ is the number density of the gas. \n\n \nFollowing the nomenclature introduced by \\citet{Wolf+95, Wolf+03}, much of the interstellar medium can be described \nas comprised of a cold neutral medium (CNM) with $T  \\approx 100{\\rm K}$, a warm neutral medium (WNM) with \ntemperatures in the range, $T \\approx 6\\times 10^{3} - 10^{4}\\,{\\rm K}$ and a hot ionized medium (HIM) with \n$T \\geq 10^{6}\\,{\\rm K}$. As Figure~\\ref{cool_curve} shows, we have only considered cooling in the temperature \nrange $T \\approx 10^{3} - 10^{7}\\,{\\rm K}$ and up to a maximum density of $n_{\\rm max} = 6.0 \\times 10^{7}\\,{\\rm cm^{-3}}$.\nWe note that the colder parts of the ISM occupy a small fraction of the volume (only a few percent), and while they \nare important for star formation, they interact much less strongly with the hot medium than the warm gas that occupies\nmost of the volume. \nSince our goal is to capture the formation of galaxy outflows which are mainly comprised of hot gas in the temperature \nrange $T \\approx 10^{6} - 10^{7}\\,{\\rm K}$, we to lowest order neglect the inclusion of the cold dense phases of the \nISM in our simulations. We therefore do not include low-temperature cooling instead placing a temperature floor at \n1000 K throughout the simulations. This therefore amounts to adopting a simplified description of the multi-phase ISM, \nwhich as we shall show in later sections is sufficient for the physical problem at hand. In a test case, we \nlowered the temperature floor to $300$ K and found the mass outflow rates to remain unchanged (see Appendix). \n\nAt temperatures $T \\approx 10^{4}-10^{6.5}\\,{\\rm K}$, cooling results mainly from  line emission, \nwhile cooling due to bremsstrahlung (free-free emission) becomes important at temperatures \n$\\geqslant 10^{7}\\,{\\rm K}$. \nBelow $10^{4}\\,{\\rm K}$, collisions are not energetic enough to excite atomic transitions, \nleading to a drop in the cooling rate. \nThe atomic cooling rate attains a  peak value of $\\Lambda\\approx 10^{-21}\\,{\\rm ergs\\,cm^{3}\\,s^{-1}}$ in the \ntemperature range $T \\approx (1 - 2.5)\\times10^{5}\\,{\\rm K}$. In this regime, the cooling time is \nroughly constant as seen in the lower panel of the plot. The peak at $T\\approx 2.5\\times10^{5}\\,{\\rm K}$ is \ndominated by line emission from metal ions, whose atomic energy levels are easily excited by collisions \nat this temperature. However, beyond $T\\approx 2.5\\times10^{5}\\,{\\rm K}$, most of the atoms become fully \nionized, the effectiveness of the line cooling decreases, and the cooling rate drops, leading to a \ngradual increase in the cooling time. What this implies for the nature of the multiphase medium will be \ndiscussed in the next section. \n\n\n\n\\section{Results}\\label{results}\n\n\\subsection{Outflow Rates}\n\nAs our goal is to obtain a better understanding of the turbulent ISM as a function of galaxy properties, we conducted\n a suite of simulations with different values of the gas surface \ndensity, $\\Sigma_{\\rm g},$ and the epicyclic frequency, $\\kappa$. In Table~\\ref{sumsim}, we present a summary of \nthe properties of these simulations, including the run parameters ($\\Sigma_{\\rm g}$, $\\kappa$),\nthe key quantities for each model that can be directly derived from these parameters - the forcing scale $L_{\\rm f}$, \nbox size above the midplane, $z_{\\rm max} = 3R$, the resolution $dz= z_{\\rm max} /256$, \nthe horizontal velocity dispersion $\\sigma_{\\rm H}$, and the escape velocity $v_{\\rm es}$,\nand the quantities that can only be measured from \nthe full simulations - the vertical velocity dispersion $\\sigma_{\\rm z}$, the scale-height $H$, and the mass loss \nrate $\\dot{\\Sigma}_{\\rm g}$.\nThe idealized nature of our simulations  enables us to probe a wide parameter space, with \n$\\Sigma_{\\rm g} \\in [50, 500]\\,{\\rm M_\\odot\\,pc^{-2}}$ and  $\\kappa^{-1} \\in [6.5, 30]\\,{\\rm Myr}.$ \nNote however that for runs with $\\kappa^{-1}=30\\,{\\rm Myr}$, simulations with an initial \n$\\Sigma_{\\rm g} > 75\\,{\\rm M}_\\odot\\,{\\rm pc}^{-2}$ result in box sizes that are larger than the typical size of entire\ndisk galaxies, and we have therefore chosen to omit such simulations from our study.\n\n\n\\begin{table*}[ht!]\n\\begin{minipage}{170mm}\n\\begin{center}\n\\resizebox{\\textwidth}{!}{\n\\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|} \\hline \\hline \nSimulation & $\\Sigma_{\\rm g}$ & $\\kappa^{-1}$ & $L_{\\rm f}$ & $z_{\\rm max}$ & $dz$ & $H$ & \n$\\bar{\\sigma}_{\\rm H}^{\\rm 1D}$ & $\\bar{\\sigma}_{\\rm z}$ & $v_{\\rm es}$ & $\\dot{\\Sigma_{\\rm g}}$ \\\\\nName & $[{\\rm M}_{\\odot}\\,{\\rm pc^{-2}}]$ & $[\\rm {Myr}]$ & [pc] & [kpc] & [pc] & \n[pc] & $[\\rm km\\,s^{-1}]$ & $[\\rm {km\\,s^{-1}}]$ & $[{\\rm km\\,s^{-1}}]$ & $[{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}] $ \\\\ \\hline \\hline\nS500K6.5* & $500$ & $6.5$ &  $723$ & $1.80$ & $7.03$ & $7.0$ & $68$ & $5.0$ & $309$ & $0.22$ \\\\ \\hline\nS250K6.5* & $250$ & $6.5$ & $362$ & $0.9$ & $3.50$ & $9.4$ & $35$ & $5.5$ & $155$ & $0.073$ \\\\ \\hline\nS150K6.5* & $150$ & $6.5$ & $217$ & $0.53$ & $2.10$ & $17$ & $21$ & $6.3$ & $92$ & $0.04$ \\\\ \\hline\nS250K10* & $250$ & $10$ & $856$ & $2.13$ & $8.32$ & $11$ & $50$ & $5.5$ & $238$ & $0.06$ \\\\ \\hline\nS150K10* & $150$ & $10$ & $514$ & $1.27$ & $4.96$ & $20$ & $32$ & $6.0$ & $142$ & $0.03$ \\\\ \\hline\nS100K10 & $100$ & $10$ &  $342$ & $0.85$ & $3.32$ & $27$ & $21$ & $6.2$ & $95$ & $0.017$ \\\\ \\hline\nS150K20* & $150$ & $20$ & $2054$ & $5.12$ & $20.0$ & $22$ & $60$ & $5.0$ & $285$ & $0.03$ \\\\ \\hline\nS100K20* & $100$ & $20$ &  $1369$ & $3.40$ & $13.2$ & $26$ & $53$ & $5.0$ & $190$ & $0.02$ \\\\ \\hline\nS75K20 & $75$ & $20$ & $1027$ & $2.56$ & $10.0$ & $35$ & $30$ & $6.0$ & $143$ & $0.009$ \\\\ \\hline\nS50K20 & $50$ & $20$ & $685$  & $1.70$ & $6.64$ & $53$ & $21$ & $6.3$ & $95$ & $0.004$ \\\\ \\hline\nS75K30 & $75$ & $30$ &  $2311$ & $5.74$ & $22.4$ & $33$ & $45$ & $5.8$ & $214$ & 0.005 \\\\ \\hline\nS50K30 & $50$ & $30$ &  $1541$ & $3.83$ & $15.0$ & $50$ & $30$ & $6.0$ & $143$ & $0.004$ \\\\ \\hline \\hline \n\\end{tabular}\n}\n\\end{center}\n\\caption{  \nSummary of the simulation runs at a uniform grid resolution of \n$256^{2} \\times 512$. The different columns from the left to the right are - 1) Simulation name, 2) Gas surface density, \n3) Inverse of the epicyclic frequency, 4) the horizontal forcing scale, $L_{\\rm f} = 1.2R$, 5) box size above \nthe midplane, 6) the resolution, 7) vertical scale height obtained from equation~(\\ref{vertscale}), 8) time-averaged \nmass-weighted 1D horizontal velocity dispersion, 9) time-averaged mass-weighted vertical velocity dispersion, \n10) escape velocity of the gas as defined by equation~(\\ref{ves}), and 11) the mass loss rate. Simulations that\nshow persistent outflows for many eddy-turnover times are marked by an *. }\n\\label{sumsim}\n\\end{minipage}\n\\end{table*}\n\n\nOur motivation for using a broad range of values is to capture the properties of high surface density galaxies over \na broad range of masses and redshifts.\nSeveral attempts have been made to make  predictions about the evolution of \nthe galaxy size with redshift \\citep[see][for recent reviews]{Shapley11, SM12, Con14}, and \nobservational studies  have shown that distant galaxies are \nmore compact than those of the same mass in the nearby Universe \n\\citep[e.g.,][]{Daddi+05, Trujillo+07, Buitrago+08, vanDok+10}. From these studies, the dependence of  \ngalaxy size with redshift selected at a constant stellar mass can be roughly characterized as a power \nlaw of the form $R \\propto (1+z)^{-\\alpha},$ although \\citet{Ferg+04} find $ R \\propto H^{-1}(z)$ from $z \\approx 1-5$,  \nwhere $H(z)$ is the Hubble parameter. \nAssuming, for simplicity, a power law relation between the galaxy size and redshift,   it can be \nshown that the epicyclic frequency for a fixed mass, scales as $\\kappa\\propto \\Sigma_{\\rm g}^{1/2}\\,(1+z)^{\\alpha/2},$ \nwhile the surface density at fixed mass scales as $\\Sigma_{\\rm g}\\propto(1+z)^{2\\alpha}$. \nThese scalings imply that star-forming galaxies at higher redshifts are both more compact \n(i.e., have larger values of $\\Sigma_{\\rm g}$) and are more rapidly rotating (i.e., have lower values of $\\kappa^{-1}$) \nthan their local counterparts.  As we show below, this allows us to make some quantitative statements \nabout the role of gravity-driven turbulence in powering outflows in distant galaxies. This is all the more important as \nthe integrated star-formation rate peaks at $z\\approx 2$ \\citep[see][for a review]{MD14}. \n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig2.pdf} \n\\caption{(color online). The upper panel shows the averaged gas mass loss rate as a function of\n$\\Sigma_{\\rm g}$ for different values of $\\kappa^{-1}$. Filled symbols denote runs where the computed \ngas mass loss rate $\\geqslant 0.02 \\,{\\rm M_\\odot\\,yr^{-1}\\,kpc^{-2}}$ (horizontal dashed line). The lower \npanel shows the ratio $\\eta$ of the gas mass loss rate and the star formation rate (where the star formation \nrate is obtained from equation~\\ref{kenlaw}). The inset panel shows the adopted variation of the star \nformation rate as a function of the gas surface density while the dashed line denotes the `Heckman limit'. \nThe filled (open) symbols in these panels follow the convention of those in panel 2(a). }\n\\label{starform}\n\\end{figure}\n\n\nIn the top panel of Figure~\\ref{starform}, we show the variation of the averaged gas mass loss rate as a function of \n$\\Sigma_{\\rm g}$ for different values of $\\kappa^{-1}$. The filled symbols denote runs where we find outflows with\n$\\dot{\\Sigma}_{\\rm g} \\geqslant 0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2},$ persisting over many \neddy-turnover times in disks. Below this threshold, outflows appear to be sporadic or absent with negligible values of \n$\\dot{\\Sigma}_{\\rm g}$ (denoted by open symbols), as \nobserved in lower surface density galaxies  \\citep{Chen+10}. In panel 2(b) we show the variation of the ratio of\n $\\eta = \\dot{\\Sigma}_{\\rm g}/\\dot{\\Sigma}_{\\star}$, \nwhereas the inset figure shows the variation of the star-formation rate alone;   for this purpose we have adopted\nthe \\cite{Ken98} fit to the  star-formation rate density as a function of $(\\Sigma_{\\rm g}, \\kappa^{-1})$\n\n", "index": 19, "text": "\\begin{equation}\n\\dot{\\Sigma}_{\\star} \\approx 0.017\\Sigma_{\\rm g}\\Omega = 0.012\\Sigma_{\\rm g}\\kappa, \n\\label{kenlaw}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\Sigma}_{\\star}\\approx 0.017\\Sigma_{\\rm g}\\Omega=0.012\\Sigma_{\\rm g}\\kappa,\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Σ</mi><mo>˙</mo></mover><mo>⋆</mo></msub><mo>≈</mo><mrow><mn>0.017</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>=</mo><mrow><mn>0.012</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><mi>κ</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nwhere $g = 4\\pi\\,G\\,\\Sigma_{\\rm g}$ is the acceleration due to gravity (assuming $\\Sigma = 2\\Sigma_{\\rm g}$) and \n$z_{\\rm max}$ is the vertical extent of the simulation volume. However,  since the vertical extent is three times the \ndriving scale $R,$ which in turn would be related to the typical radial scale length, $R_{l}$ \n (as $G\\pi\\Sigma\\,R_{l}^{2} \\approx \\Omega^{2}\\,R_{l}$, which implies $R_{l} \\approx \\pi\\,G\\Sigma/\\Omega^{2} \\approx R$)\nin a more complete model disk evolution, \nwe can reasonably expect that in a real disk as material travels to heights approaching $z_{\\rm max}$, $g(z)$ would \nbe falling rapidly, resulting in escape velocities similar to those in our simulations.\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig4.pdf}\n\\caption{(color online). \nTime evolution of the mass-weighted one-dimensional\nhorizontal velocity dispersion (black) and the vertical velocity dispersion (red) in panel 4a), the \nrms Mach number (blue) in panel 4b), and the gas mass surface density (dark green) in panel 4c) \nfor run SK250K10 with $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$, $\\kappa^{-1} = 10\\,{\\rm Myr}$, \nand $t_{\\rm ed} = 12\\,{\\rm Myr}$. The dashed vertical line depicts the duration of the initial transient \nphase. The values of $\\sigma^{\\rm 1D}_{\\rm H}$, $\\sigma_{\\rm z},$ and $\\dot{\\Sigma}_{\\rm g}$ \npresented in Table~\\ref{sumsim} are thus computed from 60 Myr onwards. Notice that there is \nsignificant mass loss at times well after the initial transient phase.}\n\\label{ts500k10}\n\\end{figure}\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig5.pdf}\n\\caption{(color online).\nSame as in Fig.~\\ref{ts500k10} for run SK50K30 with\n$\\Sigma_{\\rm g} = 50\\,{\\rm M_\\odot\\,pc^{-2}}$, $\\kappa^{-1} = 30\\,{\\rm Myr},$ and \n$t_{\\rm ed} = 36\\,{\\rm Myr}$. In this case these is negligible mass loss over a 400 Myr long period.}\n\\label{ts100k30}\n\\end{figure}\n\n\n\n\\subsection{Time Series, Vertical structure, and Thermal Phases}\n\\label{tseries_2dplots}\n\nBefore we delve further into the dependence of the outflows on the disk properties, we show \nthe time evolution of two runs that illustrate the range of behaviors seen in our simulations.\nFigure~\\ref{ts500k10}  shows the evolution of\nS250K10, a high surface density, rapidly-rotating case with $\\Sigma_{\\rm g} = 250 {\\rm M_\\odot\\,pc^{-2}}$ \nand $\\kappa^{-1} = 10$ Myr, and Figure~\\ref{ts100k30} show the evolution of \nS50K30, a moderate surface density, slowly-rotating case with \n$\\Sigma_{\\rm g} = 50 {\\rm M_\\odot\\,pc^{-2}}$ and \n$\\kappa^{-1} = 30$ Myr. In both figures, we plot the mass-weighted one-dimensional horizontal velocity dispersion, \n{\\bf $\\sigma^{\\rm 1D}_{\\rm H} = \\sigma_{\\rm H}/\\sqrt{2}$}, the vertical velocity dispersion, $\\sigma_{\\rm z}$,\n the mass-weighted rms Mach number, and the gas mass surface density.  \nIn both of these runs, the initial time evolution is marked by a transient phase, which lasts for $60$ Myr and \n$200$ Myr respectively (denoted by the dashed vertical lines), after which the system reaches a steady state.\nIn this stage, the action of gravity in the absence of turbulent support causes \nthe material to move downwards towards the mid plane and become compressed. Then as turbulence \ndevelops, pressure support also increases, puffing the layer back up, and causing a rapid expansion \nthat drives a small fraction of the material out of the simulation volume. During these rearrangements, our results \nare strongly dependent on the particulars of our initial conditions, and so we avoid making measurements or \ndrawing conclusions from this phase of the simulations. \n\nOn the other hand, after the initial phase has passed, the simulations settle into a quasi-steady state that depends \nalmost purely on $\\Sigma_{\\rm g} $ and $\\kappa.$  We thus evaluate the time-averaged values in Table~\\ref{sumsim} \nonly in this quasi-steady state. By this time, the medium in the S250K10 run settles into a roughly constant \nmass-weighted 1D horizontal velocity dispersion of $\\bar{\\sigma}_{\\rm H}^{\\rm 1D} = 50\\,{\\rm km\\,s^{-1}}$ while the \nmedium in the SK50K30 run reaches $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}  = 30\\,{\\rm km\\,s^{-1}}$. While the higher surface \ndensity run is somewhat hotter than the moderate surface density case, in both runs the sound speed is well below \nthe average velocity dispersion.  This implies that the turbulent motions are supersonic in nature. \nIn fact, the mass weighted rms Mach number $\\approx 6$ for the higher surface density run and \n$\\approx 4$ in the lower surface density run, signifying the occurrence of strong shocks in both runs.\nThus, although the driving in these simulations is purely \nhorizontal, it also causes substantial pressure and density perturbations, which vary both horizontally and vertically. \nThese lead in turn to vertical velocity fluctuations, which are roughly constant in time at \n$\\bar{\\sigma}_{\\rm z} = 5.5\\,{\\rm km\\,s^{-1}}$ in the S250K10 case and $\\bar{\\sigma}_{\\rm z}  = 6\\,{\\rm km\\,s^{-1}}$ in \nthe S50K30 case. This shows that the presence of supernova energy input is not required for high-density disks to \ndevelop significant turbulent motions perpendicular to the plane of the galaxy, provided large-scale self-gravitating \ninstabilities are able to maintain horizontal motions of several tens of ${\\rm km\\,s^{-1}}$.\nQuite remarkably, as Table~\\ref{sumsim} shows, the value of the time averaged mass-weighted vertical velocity \ndispersion is consistently within the range from $5 - 6.3\\,{\\rm km\\,s^{-1}}$ in our simulations, which we discuss in \nmore detail below.\n\nA closer look at these plots also reveals that for the S250K10 run, a distinct outflow occurs throughout the full \nquasi-steady state evolution (see panel 4c), persisting over many eddy-turnover times until the simulation is \nterminated at $t =  330\\, {\\rm Myr.}$  This is also evident from the two-dimensional $x-z$ slices of the density, \nvertical component of the velocity, and temperature in Figure~\\ref{s500k10}. Here we see that, in course \nof the evolution, the combined action of turbulent heating, radiative cooling, and gravitational collapse leads to \nstrong density and temperature contrasts throughout the simulation. Furthermore, the slices of the density plotted \nin the first row of this figure, together with the vertical velocity plotted in the second row, clearly show an outflow \nof material.\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=1.8\\columnwidth]{fig6.pdf}\n\\caption{(color online). Two-dimensional slices in the $x-z$ plane showing the \ntime evolution of the logarithm of the density (upper row) and the vertical component \nof the velocity (middle row) and the logarithm of the temperature (lower row) in a \nlocal patch of the turbulent ISM for a run with $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$, \n$\\kappa^{-1} = 10\\,{\\rm Myr}$ and $t_{\\rm ed} = 12\\,{\\rm Myr}$. The total vertical extent \nof the simulation domain is $2z = 4.26\\,{\\rm kpc}$ while the horizontal extent is \n$x=y=2.13\\,{\\rm kpc}.$ }\n\\label{s500k10}\n\\end{figure*}\n\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=1.8\\columnwidth]{fig7.pdf}\n\\caption{(color online). Two-dimensional slices in the $x-z$ plane showing the \ntime evolution of the logarithm of the density (upper row) and the vertical component \nof the velocity (middle row) and the logarithm of the temperature (lower row) in a local \npatch of the turbulent ISM for a run with $\\Sigma_{\\rm g} = 50\\,{\\rm M_\\odot\\,pc^{-2}}$,  \n$\\kappa^{-1} = 30\\,{\\rm Myr}$ and $t_{\\rm ed} = 36\\,{\\rm Myr}$. The total vertical \nextent of the simulation domain is $2z = 7.66\\,{\\rm kpc}$ while the horizontal \nextent is $x=y=3.83\\,{\\rm kpc}.$}\n\\label{s100k30}\n\\end{figure*}\n\n\nAt this point, it is worth describing in greater detail how such outflows are generated. To answer this question, we \nreturn to the  total atomic, ionic, and Bremsstrahlung cooling curve in Figure~\\ref{cool_curve}. The temperature \nslices in Figure~\\ref{s500k10} show that by $t=311\\,{\\rm Myr}$, the initial constant temperature distribution has \nevolved into a multiphase structure. In particular, material in certain regions close to the mid plane is heated to \n$T\\approx 10^{6}\\,{\\rm K}$ and higher, while some patches of gas are still close to a few times $10^{5}\\,{\\rm K}$.  \nAt the same time, Figure~\\ref{cool_curve}, shows that beyond $T\\approx 2.5\\times10^{5}\\,{\\rm K}$, the radiative \ncooling rate decreases. This implies that these regions would take many dynamical times to cool to the mean \ntemperature of the medium. But by then, successive heating resulting from turbulent driving would further heat the \nmaterial. \n\nThis behavior is also expected from a linear stability analysis of a temperature perturbation in a medium in which \nthe cooling rate per unit mass is $\\propto \\rho \\Lambda(T)$, and the heating rate per unit mass is roughly constant, \nas is the case with turbulent heating \\citep{PP09}.\nIn this case, the the condition for such a perturbation to grow exponentially (at constant pressure) is simply\n\n", "itemtype": "equation", "pos": 36130, "prevtext": " \nwhere $\\Omega$ is the angular velocity and in the last equality, we have assumed $\\kappa = \\sqrt{2}\\Omega$, as \nappropriate for a flat rotation curve. The symbols (open and filled) follow the convention of those in panel 2(a). \n\nWe recall that large-scale outflows are most likely to occur in systems in which the star-formation \nrate, $\\dot{\\Sigma}_\\star \\geqslant 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$. This implies that for each pair of values \nof $\\Sigma_{\\rm g}$ and $\\kappa^{-1}$, massive outflows are expected for all runs except for: S50K30, S75K30, S50K20, \nS75K20, S100K20 and S150K20. Comparing with the gas mass loss rate plotted in panel 2(a), we find that runs S50K30, \nS75K30, S50K20 and S75K20 show very weak outflows (i.e. below the threshold value of \n$0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$).\nAmong the other two runs, the mass loss rates in S100K20 and S150K20 are on and above the threshold \nvalue respectively. Run S100K10  lies above the `Heckman limit,' but shows only a weak outflow. The \nratio ($\\eta$) of the gas mass loss rate and the star formation rate for runs with $\\kappa^{-1} = 6.5$ and $10\\,{\\rm Myr}$ \nstays nearly constant, {\\bf $\\eta \\approx 0.1$}. However, for $\\kappa^{-1} = 20\\,{\\rm Myr}$, $\\eta$ varies weakly with \n$\\Sigma_{\\rm g}$ for runs both above and below the Heckman limit. The trend for $\\kappa^{-1} = 30\\,{\\rm Myr}$ is \nunclear due to our choice of simulation parameters of $\\Sigma_{\\rm g}$. \n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig3.pdf}\n\\caption{(color online). A 3D rendering of the density in the run S250K10, showing the gradual evolution of\nthe outflow at four different times starting from $t = 312$ to $319\\,{\\rm Myr}$ (left to right). For clarity of \nthe color contrast, we have restricted the density range from ${\\rm log}\\,\\rho = -30.50$ to $-24\\,[{\\rm g\\,cm^{-3}}]$. \nPlumes of gas move away from the disk mid plane and leave the simulation domain through the vertical boundaries.}\n\\label{3drend}\n\\end{figure*}\n\n\nIn Figure~\\ref{3drend}, we show a three-dimensional rendering of the density at four different times, in a run \nwith $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$ and $\\kappa^{-1} = 10\\,{\\rm Myr}$. These volume \nrenderings show the evolution of an outflow with plumes moving gradually both upwards and downwards from \nthe midplane, eventually leaving the simulation domain.\nNote that the question of whether the ejected material is able to leave the simulation domain depends on \nwhether the outflow velocity exceeds the escape velocity, which varies from simulation to simulation in our study.\nSpecifically, given the vertical extent of the box above the \nmidplane and the gas surface density, the critical velocity required to escape the gravitational potential of the \nhost galaxy is given by \n\n", "index": 21, "text": "\\begin{equation}\nv_{\\rm es} = \\sqrt{2\\,g\\,z_{\\rm max}} \\approx \\left(\\frac{103}{{\\rm km\\,s^{-1}}}\\right)\\,\\left(\\frac{\\Sigma_{\\rm g}}\n{100\\,{\\rm M}_{\\odot}\\,{\\rm pc^{-2}}}\\right)^{1/2}\\,\\left(\\frac{z}{\\rm kpc}\\right)^{1/2}, \n\\label{ves}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"v_{\\rm es}=\\sqrt{2\\,g\\,z_{\\rm max}}\\approx\\left(\\frac{103}{{\\rm km\\,s^{-1}}}%&#10;\\right)\\,\\left(\\frac{\\Sigma_{\\rm g}}{100\\,{\\rm M}_{\\odot}\\,{\\rm pc^{-2}}}%&#10;\\right)^{1/2}\\,\\left(\\frac{z}{\\rm kpc}\\right)^{1/2},\" display=\"block\"><mrow><mrow><msub><mi>v</mi><mi>es</mi></msub><mo>=</mo><msqrt><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>g</mi></mpadded><mo>⁢</mo><msub><mi>z</mi><mi>max</mi></msub></mrow></msqrt><mo>≈</mo><mrow><mrow><mo>(</mo><mfrac><mn>103</mn><mrow><mpadded width=\"+1.7pt\"><mi>km</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mfrac><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mrow><mpadded width=\"+1.7pt\"><mn>100</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mpadded><mo>⁢</mo><msup><mi>pc</mi><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mpadded><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>z</mi><mi>kpc</mi></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\n\\citep{Field65,Def70,MSQP12}. In a steadily-heated thermally-unstable medium, high density regions condense \nand cool, while low density regions expand and heat. When $\\sigma$ is large,  \nthe temperature is high and  ${\\partial \\ln \\Lambda}/{\\partial \\ln T} \\lesssim 0$ \nthroughout much of the medium.  This will result in an {\\it unstable} state in which rapid, runaway heating \nof the hot, low density medium will lead to the significant removal of the gas from the simulation domain \n\\citep[see also][]{SMQP12, SGP12}. Thus, from  $t=311\\,{\\rm Myr}$ onwards, Figure~\\ref{s500k10} shows \nthe continuing impact of this hot gas, which pushes its way outward both through the top and bottom boundaries.\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig8.pdf} \n\\caption{(color online). \nVolume-weighted phase diagrams of the temperature and the number \ndensity of all the gas (first column) and the mass-weighted temperature and the vertical component of the velocity PDFs \nof the high-latitude gas at different times (from second to the fourth column) for runs: S50K30 with \n$\\sigma_{\\rm H}^{\\rm 1D}=30$ km/s and  $v_{\\rm esc}=143$ km/s (top row), S250K10 with \n$\\sigma_{\\rm H}^{\\rm 1D}=50$ km/s and $v_{\\rm esc}=238$ km/s  (middle row) and S500K6.5 with \n$\\sigma_{\\rm H}^{\\rm 1D}=68$ km/s $v_{\\rm esc}=309$ km/s  (bottom row). The $T-n$ phase diagrams\nshow $\\log_{10}$ contours of the probability density function, \ncomputed over the entire simulation domain, and normalized to 1 when integrated over $\\ln T$ and $\\ln n$. \nThe  $T-v_{\\rm z}$ phase plots show $\\log_{10}$ contours of the probability density function, computed over the range \n$(z_{\\rm max}/2 - z_{\\rm max})$ for each of the three runs, and normalized to 1 when integrated in $\\ln T$ \nand $v_{\\rm z}$ in km/s. In all panels two contour lines are plotted per decade.\n}\n\\label{phaseplots}\n\\end{figure*}\n\n\nIn contrast, for a slowly-rotating, moderate surface density disk, the temperature slices in Figure~\\ref{s100k30} show \nthat the majority of the material away from the midplane is at temperatures $\\leqslant 2.5\\times 10^{5}\\,{\\rm K}$. \nIn this phase, ${\\partial \\ln \\Lambda}/{\\partial \\ln T} \\geq 1$ and the cooling time is roughly constant or dropping as \na function of temperature, leading to a stable configuration with less significant mass loss through the \nvertical boundaries.   \n\nSuch multiphase outflowing material is also detected in observed high surface density \nstarbursting galaxies, which contain both $10^{7}-10^{8}\\,{\\rm K}$ emitting material \\citep{Martin99, SH07, SH09} \nand $\\approx 10^{4}\\,{\\rm K}$ material detectable in a variety of optical and near UV absorption and emission \nlines \\citep{Pettini+01, Tremonti+07}. Certainly, in real galaxies, much of the hottest of these phases is in fact material \nfrom supernovae. On the other hand, the presence of $\\approx10^{6}\\,{\\rm K}$ gas may provide pockets in which the \ncooling of material shocked by supernova remnants is minimal, making such galaxies particularly prone to outflows. \nOr in other words, gravitationally-driven turbulence is likely to both drive a baseline outflow as well as provide an \nISM distribution in which supernova driving is particularly efficient. \n \nFigure~\\ref{phaseplots} shows the phase distributions of the gas for three different runs, including  \nthe temperature-density distribution over the whole simulation volume and the temperature-velocity distribution\nof the gas at high latitudes. In the $T-n$ plots, $T = 2.5 \\times 10^{5}\\,{\\rm K}$ is denoted by the horizontal line, \nabove which the cooling rate starts to decrease. The vertical lines in the plots denote the densities at which\nthe cooling time at $T = 2.5\\times 10^{5}\\,{\\rm K}$ is equal to the eddy turnover time. To the left of this line \nand for $T > 2.5\\times 10^{5}\\,{\\rm K}$, the cooling time is greater than $t_{\\rm ed},$ while to the right, \n$t_{\\rm cool} < t_{\\rm ed}$. In all three plots, we find the existence of a horizontal, high density tail at \n$T \\approx 10^{4}\\,{\\rm K}$; a feature commonly seen in phase diagrams in ISM simulations. \nIn the S50K30 case, corresponding to a slowly rotating, moderate surface density galaxy, \na majority of material is below the threshold temperature of $2.5\\times 10^{5}\\,{\\rm K}$. This run has only negligible \nmass loss, and the $T-v_{\\rm z}$ plots show that the vertical component of the velocity corresponding to the gas \nnear the top boundary is $50-100\\,{\\rm km\\,s^{-1}},$ as compared to the escape velocity of 143 km/s.\n\nOn the other hand, in both S250K10 with $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}=50$ ${\\rm km\\,s^{-1}}$ and S500K6.5 \nwith $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}=68$ ${\\rm km\\,s^{-1}}$, more of the low density gas above the disk mid plane is \nat considerably higher temperatures than the temperature at which the cooling time is equal to the eddy turnover time. \nDue to the longer cooling time, this gas becomes thermally unstable and leads to a rapid, runaway heating\nresulting in an eventual expulsion of the gas from the host galaxy, dragging along additional material with it. \nThus, such high density, faster spinning disks are more likely to host galaxy outflows than their slow rotating less \ndenser counterparts. The mass-weighted phase plots of the temperature and the vertical component of the velocity \nfor S250K10 and S500K6.5 show that the outflowing gas is made up of a combination of phases with most of the \nmass in the hot phase at $T\\approx 10^{6}-10^{7}\\,{\\rm K}$ which also drags along some relatively low temperature \ngas as it escapes the galaxy. In both cases the vertical velocities range from $\\approx 100\\,{\\rm km\\,s^{-1}}$ to close \nto the escape velocity, which is 238 ${\\rm km\\,s^{-1}}$ in the S250K10 case and 309 ${\\rm km\\,s^{-1}}$ in the \nS500K6.5 case.\n\n\n\\subsection{Turbulent Parameters and Vertical Scale Heights} \n\nTo further explore the connection between the mass loss rate and the structure of the disk, we measured \nhow  turbulent velocities and vertical scale-heights vary with our  input parameters, $\\Sigma_{\\rm g}$ \nand $\\kappa.$  In Figure \\ref{veldis}, the filled (open) symbols follow the classification of disks hosting\noutflows above (below) $0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$, similar to those in panel \n2(a) of Figure~\\ref{starform}. Comparing the mass loss rate with the one-dimensional horizontal velocity \ndispersion, we find that with the exception of S75K30, strong outflows are ubiquitous \nin systems where $\\bar{\\sigma}^{\\rm 1D}_{\\rm H} \\geqslant 32\\,{\\rm km\\,s^{-1}}$.  \nThis is in agreement with \nthe earlier numerical \\citep{SGP12} and analytical predictions \\citep{Scann13}, which argued that \nprovided turbulent velocities can be maintained\nabove this threshold value (about $35\\,{\\rm km\\,s^{-1}}$ in \ntheir paper), the material is shocked into the thermally unstable regime, leading to runaway heating and \neventual expulsion from the galaxy.\nA compilation of a large sample of high-redshift data by \\citet{Genzel+11} also shows that galaxies with \n$\\dot{\\Sigma}_{\\star}\\geqslant \\dot{\\Sigma}_{\\star}^{\\rm cr}$ have \n$\\sigma_{\\rm H\\alpha}^{\\rm 1D}\\geqslant 35\\,{\\rm km\\,s^{-1}}$. \nOn the other hand, the vertical velocity dispersion varies \nonly weakly across the entire parameter space with a mean value of $5.7\\,{\\rm km\\,s^{-1}}$.\n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig9.pdf} \n\\caption{(color online).\nThe different panels shows the variation of the following quantities as a function of the gas surface density \nfor different ranges of the epicyclic frequency. Panel 9(a) - computed one-dimensional horizontal velocity \ndispersion, panel 9(b) - vertical velocity dispersion, panel 9(c) - the ratio of the horizontal to the vertical \nvelocities, panel 9(d) - the horizontal forcing scale, $L_{\\rm f}$, panel 9(e) - the scale-height, $H$ \nas computed in equation~(\\ref{vertscale}) and the ratio of $L_{\\rm f}/H$ in panel 9(f). Note that while \n$\\sigma_{\\rm H} \\propto \\Sigma\\,\\kappa^{-1}$ and $L_{\\rm f} \\propto \\Sigma\\,\\kappa^{-2}$ are both controlled \nby the imposed turbulent driving, the rest of the quantities represent the natural  response to horizontally \ndriven motions.\n}\n\\label{veldis}\n\\end{figure*}\n\n \nWe note here that the vertical velocity dispersion arises only in response to the horizontal turbulent motions. \nEven though only the horizontal turbulent velocity is stirred externally at a velocity proportional to $\\Sigma_{\\rm g}$\nto model gravitational driving in an unstable disk, panel 9(b) shows that the vertical velocity dispersion decreases \nonly weakly with increasing gas surface density with $\\sigma_{\\rm z} = 5.0 - 6.3\\,{\\rm km\\,s^{-1}}$. Intriguingly, \nthe small and nearly constant value of $\\sigma_{\\rm z}$ with the gas surface density is quite similar to the results \nfrom simulations in which turbulence is driven by supernovae, with a star formation rate set self-consistently by \nlocal gravitational collapse \\citep{KKO11, SO12, KOK13}. \nHowever, for turbulence driven by gravitational instability, the plot of $\\bar{\\sigma}^{\\rm 1D}_{\\rm H}/\\bar{\\sigma}_{\\rm z}$ \nin panel 9(c) suggests that turbulent velocities become increasingly {\\it anisotropic} with increasing gas surface density. \nFor a constant $\\Sigma_{\\rm g}$, the anisotropy increases for slowly rotating disks. \n\nThe variation of the imposed horizontal forcing scale, $L_{\\rm f}\\approx R \\propto \\Sigma_{\\rm g}/\\kappa^2$ \nis shown for reference in panel 9(d). At constant $\\kappa^{-1}$, the forcing scale is directly proportional to the gas \nsurface density, while at constant $\\Sigma_{\\rm g}$, slower rotating disks have a larger forcing scale. The vertical \nscale-height, $H$ shown in the panel 9(e) is measured directly from our simulations as the mass-weighted mean \nheight of the gas, \n\n", "itemtype": "equation", "pos": 45442, "prevtext": "\nwhere $g = 4\\pi\\,G\\,\\Sigma_{\\rm g}$ is the acceleration due to gravity (assuming $\\Sigma = 2\\Sigma_{\\rm g}$) and \n$z_{\\rm max}$ is the vertical extent of the simulation volume. However,  since the vertical extent is three times the \ndriving scale $R,$ which in turn would be related to the typical radial scale length, $R_{l}$ \n (as $G\\pi\\Sigma\\,R_{l}^{2} \\approx \\Omega^{2}\\,R_{l}$, which implies $R_{l} \\approx \\pi\\,G\\Sigma/\\Omega^{2} \\approx R$)\nin a more complete model disk evolution, \nwe can reasonably expect that in a real disk as material travels to heights approaching $z_{\\rm max}$, $g(z)$ would \nbe falling rapidly, resulting in escape velocities similar to those in our simulations.\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig4.pdf}\n\\caption{(color online). \nTime evolution of the mass-weighted one-dimensional\nhorizontal velocity dispersion (black) and the vertical velocity dispersion (red) in panel 4a), the \nrms Mach number (blue) in panel 4b), and the gas mass surface density (dark green) in panel 4c) \nfor run SK250K10 with $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$, $\\kappa^{-1} = 10\\,{\\rm Myr}$, \nand $t_{\\rm ed} = 12\\,{\\rm Myr}$. The dashed vertical line depicts the duration of the initial transient \nphase. The values of $\\sigma^{\\rm 1D}_{\\rm H}$, $\\sigma_{\\rm z},$ and $\\dot{\\Sigma}_{\\rm g}$ \npresented in Table~\\ref{sumsim} are thus computed from 60 Myr onwards. Notice that there is \nsignificant mass loss at times well after the initial transient phase.}\n\\label{ts500k10}\n\\end{figure}\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{fig5.pdf}\n\\caption{(color online).\nSame as in Fig.~\\ref{ts500k10} for run SK50K30 with\n$\\Sigma_{\\rm g} = 50\\,{\\rm M_\\odot\\,pc^{-2}}$, $\\kappa^{-1} = 30\\,{\\rm Myr},$ and \n$t_{\\rm ed} = 36\\,{\\rm Myr}$. In this case these is negligible mass loss over a 400 Myr long period.}\n\\label{ts100k30}\n\\end{figure}\n\n\n\n\\subsection{Time Series, Vertical structure, and Thermal Phases}\n\\label{tseries_2dplots}\n\nBefore we delve further into the dependence of the outflows on the disk properties, we show \nthe time evolution of two runs that illustrate the range of behaviors seen in our simulations.\nFigure~\\ref{ts500k10}  shows the evolution of\nS250K10, a high surface density, rapidly-rotating case with $\\Sigma_{\\rm g} = 250 {\\rm M_\\odot\\,pc^{-2}}$ \nand $\\kappa^{-1} = 10$ Myr, and Figure~\\ref{ts100k30} show the evolution of \nS50K30, a moderate surface density, slowly-rotating case with \n$\\Sigma_{\\rm g} = 50 {\\rm M_\\odot\\,pc^{-2}}$ and \n$\\kappa^{-1} = 30$ Myr. In both figures, we plot the mass-weighted one-dimensional horizontal velocity dispersion, \n{\\bf $\\sigma^{\\rm 1D}_{\\rm H} = \\sigma_{\\rm H}/\\sqrt{2}$}, the vertical velocity dispersion, $\\sigma_{\\rm z}$,\n the mass-weighted rms Mach number, and the gas mass surface density.  \nIn both of these runs, the initial time evolution is marked by a transient phase, which lasts for $60$ Myr and \n$200$ Myr respectively (denoted by the dashed vertical lines), after which the system reaches a steady state.\nIn this stage, the action of gravity in the absence of turbulent support causes \nthe material to move downwards towards the mid plane and become compressed. Then as turbulence \ndevelops, pressure support also increases, puffing the layer back up, and causing a rapid expansion \nthat drives a small fraction of the material out of the simulation volume. During these rearrangements, our results \nare strongly dependent on the particulars of our initial conditions, and so we avoid making measurements or \ndrawing conclusions from this phase of the simulations. \n\nOn the other hand, after the initial phase has passed, the simulations settle into a quasi-steady state that depends \nalmost purely on $\\Sigma_{\\rm g} $ and $\\kappa.$  We thus evaluate the time-averaged values in Table~\\ref{sumsim} \nonly in this quasi-steady state. By this time, the medium in the S250K10 run settles into a roughly constant \nmass-weighted 1D horizontal velocity dispersion of $\\bar{\\sigma}_{\\rm H}^{\\rm 1D} = 50\\,{\\rm km\\,s^{-1}}$ while the \nmedium in the SK50K30 run reaches $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}  = 30\\,{\\rm km\\,s^{-1}}$. While the higher surface \ndensity run is somewhat hotter than the moderate surface density case, in both runs the sound speed is well below \nthe average velocity dispersion.  This implies that the turbulent motions are supersonic in nature. \nIn fact, the mass weighted rms Mach number $\\approx 6$ for the higher surface density run and \n$\\approx 4$ in the lower surface density run, signifying the occurrence of strong shocks in both runs.\nThus, although the driving in these simulations is purely \nhorizontal, it also causes substantial pressure and density perturbations, which vary both horizontally and vertically. \nThese lead in turn to vertical velocity fluctuations, which are roughly constant in time at \n$\\bar{\\sigma}_{\\rm z} = 5.5\\,{\\rm km\\,s^{-1}}$ in the S250K10 case and $\\bar{\\sigma}_{\\rm z}  = 6\\,{\\rm km\\,s^{-1}}$ in \nthe S50K30 case. This shows that the presence of supernova energy input is not required for high-density disks to \ndevelop significant turbulent motions perpendicular to the plane of the galaxy, provided large-scale self-gravitating \ninstabilities are able to maintain horizontal motions of several tens of ${\\rm km\\,s^{-1}}$.\nQuite remarkably, as Table~\\ref{sumsim} shows, the value of the time averaged mass-weighted vertical velocity \ndispersion is consistently within the range from $5 - 6.3\\,{\\rm km\\,s^{-1}}$ in our simulations, which we discuss in \nmore detail below.\n\nA closer look at these plots also reveals that for the S250K10 run, a distinct outflow occurs throughout the full \nquasi-steady state evolution (see panel 4c), persisting over many eddy-turnover times until the simulation is \nterminated at $t =  330\\, {\\rm Myr.}$  This is also evident from the two-dimensional $x-z$ slices of the density, \nvertical component of the velocity, and temperature in Figure~\\ref{s500k10}. Here we see that, in course \nof the evolution, the combined action of turbulent heating, radiative cooling, and gravitational collapse leads to \nstrong density and temperature contrasts throughout the simulation. Furthermore, the slices of the density plotted \nin the first row of this figure, together with the vertical velocity plotted in the second row, clearly show an outflow \nof material.\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=1.8\\columnwidth]{fig6.pdf}\n\\caption{(color online). Two-dimensional slices in the $x-z$ plane showing the \ntime evolution of the logarithm of the density (upper row) and the vertical component \nof the velocity (middle row) and the logarithm of the temperature (lower row) in a \nlocal patch of the turbulent ISM for a run with $\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$, \n$\\kappa^{-1} = 10\\,{\\rm Myr}$ and $t_{\\rm ed} = 12\\,{\\rm Myr}$. The total vertical extent \nof the simulation domain is $2z = 4.26\\,{\\rm kpc}$ while the horizontal extent is \n$x=y=2.13\\,{\\rm kpc}.$ }\n\\label{s500k10}\n\\end{figure*}\n\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=1.8\\columnwidth]{fig7.pdf}\n\\caption{(color online). Two-dimensional slices in the $x-z$ plane showing the \ntime evolution of the logarithm of the density (upper row) and the vertical component \nof the velocity (middle row) and the logarithm of the temperature (lower row) in a local \npatch of the turbulent ISM for a run with $\\Sigma_{\\rm g} = 50\\,{\\rm M_\\odot\\,pc^{-2}}$,  \n$\\kappa^{-1} = 30\\,{\\rm Myr}$ and $t_{\\rm ed} = 36\\,{\\rm Myr}$. The total vertical \nextent of the simulation domain is $2z = 7.66\\,{\\rm kpc}$ while the horizontal \nextent is $x=y=3.83\\,{\\rm kpc}.$}\n\\label{s100k30}\n\\end{figure*}\n\n\nAt this point, it is worth describing in greater detail how such outflows are generated. To answer this question, we \nreturn to the  total atomic, ionic, and Bremsstrahlung cooling curve in Figure~\\ref{cool_curve}. The temperature \nslices in Figure~\\ref{s500k10} show that by $t=311\\,{\\rm Myr}$, the initial constant temperature distribution has \nevolved into a multiphase structure. In particular, material in certain regions close to the mid plane is heated to \n$T\\approx 10^{6}\\,{\\rm K}$ and higher, while some patches of gas are still close to a few times $10^{5}\\,{\\rm K}$.  \nAt the same time, Figure~\\ref{cool_curve}, shows that beyond $T\\approx 2.5\\times10^{5}\\,{\\rm K}$, the radiative \ncooling rate decreases. This implies that these regions would take many dynamical times to cool to the mean \ntemperature of the medium. But by then, successive heating resulting from turbulent driving would further heat the \nmaterial. \n\nThis behavior is also expected from a linear stability analysis of a temperature perturbation in a medium in which \nthe cooling rate per unit mass is $\\propto \\rho \\Lambda(T)$, and the heating rate per unit mass is roughly constant, \nas is the case with turbulent heating \\citep{PP09}.\nIn this case, the the condition for such a perturbation to grow exponentially (at constant pressure) is simply\n\n", "index": 23, "text": "\\begin{equation}\n\\frac{\\partial \\ln \\Lambda}{\\partial \\ln T} < 1,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\ln\\Lambda}{\\partial\\ln T}&lt;1,\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ln</mi></mrow><mo>⁡</mo><mi mathvariant=\"normal\">Λ</mi></mrow><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ln</mi></mrow><mo>⁡</mo><mi>T</mi></mrow></mfrac><mo>&lt;</mo><mn>1</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nSince $\\sigma_{\\rm z}$ remains more or less constant with $\\Sigma_{\\rm g}$, and $H \\propto \\sigma_z^2/(G \\Sigma)$, \nthis results in a decrease of the scale height with increasing $\\Sigma_{\\rm g}$ independent \nof the value of $\\kappa^{-1}$. On the other hand, for a given value of $\\Sigma_{\\rm g}$, the scale height is \nidentical for different values of $\\kappa^{-1}$.\n\n\nFinally, we find that the ratio of the forcing scale to the disk scale-height in panel 9(f) again increases with \nincreasing $\\Sigma_{\\rm g}$ and for a given surface density of the disk.  It is also larger for more slowly \nrotating disks.  For all models, we obtain $L_{\\rm f}/H > 10$. Thus, even in cases with large $H$, the forcing is still \nat large scales compared to the disk thickness as would be expected for gravitationally-driven instabilities.\n\n\n\\subsection{Timescales} \n\nThe vertically stratified medium in our simulations is constantly heated by turbulent driving \nand simultaneously cooled by atomic, ionic, and Bremsstrahlung, optically-thin radiative cooling. In the context of \ngalaxy clusters, earlier works by \\citet{MSQP12} and \\citet{SMQP12} showed that such a medium only develops \na multiphase structure if the free-fall timescale is longer than the average cooling time, where \nthe local cooling time is given by equation~(\\ref{tcool}). Note, however, that \\citet{MSQP12} employed  \na cooling function that was dominated by  thermal bremsstrahlung  while \\citet{SMQP12} included a cooling function \nsimilar to ours \\citep{SD93}, but focused on a higher range of temperatures. More importantly, cluster turbulence is \nincompressible \\citep[e.g.,][]{Churazov+12, SF12}, in contrast to our simulations, in which turbulence is supersonic, \nand the majority of the energy is kinetic rather than thermal. \n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig10.pdf} \n\\caption{(color online). Variation of the eddy-turnover time (panel 10a), the free-fall time (panel 10b), the average \ncooling time (panel 10c), and the ratio of the free-fall to the cooling time (panel 10d) with the gas surface density \nfor simulations with different values of $\\kappa^{-1}$. \n}\n\\label{tscales}\n\\end{figure*}\n\n\nIn Figure~\\ref{tscales}, we show the variation of the free-fall time, the eddy-turnover time, the cooling time, and \nthe ratio of the free-fall to the cooling timescale in our simulations as a function of surface density and rotation rate. \nIncluding constant factors, the eddy-turnover time in our simulations is, $t_{\\rm ed} \\approx 1.2\\,\\kappa^{-1},$ \ni.e., independent of $\\Sigma$.\nHowever, we must analyse our simulation results to obtain the free-fall timescale defined as\n\\begin{eqnarray}\nt_{\\rm ff} &\\equiv&\n\\left(\\frac{H}{2\\pi\\,G\\,\\Sigma_{\\rm g}}\\right)^{1/2} \\\\ \\nonumber\n&=& 5.9\\,{\\rm Myr}\\,\\left(\\frac{H}{100\\,{\\rm pc}} \\right)^{1/2} \n\\left( \\frac{\\Sigma_{\\rm g}}{100\\,{\\rm M}_\\odot {\\rm pc}^{-2}}\\right)^{-1/2},\n\\label{tff}\n\\end{eqnarray}\nwhere \nwe quote $t_{\\rm ff}$ in the plane in which $z = H,$ the vertical scale height defined in eq.\\  (\\ref{vertscale}). \nUsing the values of $H$ from \nFigure~\\ref{veldis} in the above equation, we find that $t_{\\rm ff}$ steadily decreases with $\\Sigma_{\\rm g}$ \nfor a given value of the epicyclic frequency. Moreover, at a constant $\\Sigma_{\\rm g}$, the free-fall time scales \nare similar due to identical values of the scale height.\nThe ratio of the free-fall time to the eddy-turnover time can also be written as\n\n", "itemtype": "equation", "pos": 55357, "prevtext": "\n\\citep{Field65,Def70,MSQP12}. In a steadily-heated thermally-unstable medium, high density regions condense \nand cool, while low density regions expand and heat. When $\\sigma$ is large,  \nthe temperature is high and  ${\\partial \\ln \\Lambda}/{\\partial \\ln T} \\lesssim 0$ \nthroughout much of the medium.  This will result in an {\\it unstable} state in which rapid, runaway heating \nof the hot, low density medium will lead to the significant removal of the gas from the simulation domain \n\\citep[see also][]{SMQP12, SGP12}. Thus, from  $t=311\\,{\\rm Myr}$ onwards, Figure~\\ref{s500k10} shows \nthe continuing impact of this hot gas, which pushes its way outward both through the top and bottom boundaries.\n\n\n\\begin{figure*}[ht!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig8.pdf} \n\\caption{(color online). \nVolume-weighted phase diagrams of the temperature and the number \ndensity of all the gas (first column) and the mass-weighted temperature and the vertical component of the velocity PDFs \nof the high-latitude gas at different times (from second to the fourth column) for runs: S50K30 with \n$\\sigma_{\\rm H}^{\\rm 1D}=30$ km/s and  $v_{\\rm esc}=143$ km/s (top row), S250K10 with \n$\\sigma_{\\rm H}^{\\rm 1D}=50$ km/s and $v_{\\rm esc}=238$ km/s  (middle row) and S500K6.5 with \n$\\sigma_{\\rm H}^{\\rm 1D}=68$ km/s $v_{\\rm esc}=309$ km/s  (bottom row). The $T-n$ phase diagrams\nshow $\\log_{10}$ contours of the probability density function, \ncomputed over the entire simulation domain, and normalized to 1 when integrated over $\\ln T$ and $\\ln n$. \nThe  $T-v_{\\rm z}$ phase plots show $\\log_{10}$ contours of the probability density function, computed over the range \n$(z_{\\rm max}/2 - z_{\\rm max})$ for each of the three runs, and normalized to 1 when integrated in $\\ln T$ \nand $v_{\\rm z}$ in km/s. In all panels two contour lines are plotted per decade.\n}\n\\label{phaseplots}\n\\end{figure*}\n\n\nIn contrast, for a slowly-rotating, moderate surface density disk, the temperature slices in Figure~\\ref{s100k30} show \nthat the majority of the material away from the midplane is at temperatures $\\leqslant 2.5\\times 10^{5}\\,{\\rm K}$. \nIn this phase, ${\\partial \\ln \\Lambda}/{\\partial \\ln T} \\geq 1$ and the cooling time is roughly constant or dropping as \na function of temperature, leading to a stable configuration with less significant mass loss through the \nvertical boundaries.   \n\nSuch multiphase outflowing material is also detected in observed high surface density \nstarbursting galaxies, which contain both $10^{7}-10^{8}\\,{\\rm K}$ emitting material \\citep{Martin99, SH07, SH09} \nand $\\approx 10^{4}\\,{\\rm K}$ material detectable in a variety of optical and near UV absorption and emission \nlines \\citep{Pettini+01, Tremonti+07}. Certainly, in real galaxies, much of the hottest of these phases is in fact material \nfrom supernovae. On the other hand, the presence of $\\approx10^{6}\\,{\\rm K}$ gas may provide pockets in which the \ncooling of material shocked by supernova remnants is minimal, making such galaxies particularly prone to outflows. \nOr in other words, gravitationally-driven turbulence is likely to both drive a baseline outflow as well as provide an \nISM distribution in which supernova driving is particularly efficient. \n \nFigure~\\ref{phaseplots} shows the phase distributions of the gas for three different runs, including  \nthe temperature-density distribution over the whole simulation volume and the temperature-velocity distribution\nof the gas at high latitudes. In the $T-n$ plots, $T = 2.5 \\times 10^{5}\\,{\\rm K}$ is denoted by the horizontal line, \nabove which the cooling rate starts to decrease. The vertical lines in the plots denote the densities at which\nthe cooling time at $T = 2.5\\times 10^{5}\\,{\\rm K}$ is equal to the eddy turnover time. To the left of this line \nand for $T > 2.5\\times 10^{5}\\,{\\rm K}$, the cooling time is greater than $t_{\\rm ed},$ while to the right, \n$t_{\\rm cool} < t_{\\rm ed}$. In all three plots, we find the existence of a horizontal, high density tail at \n$T \\approx 10^{4}\\,{\\rm K}$; a feature commonly seen in phase diagrams in ISM simulations. \nIn the S50K30 case, corresponding to a slowly rotating, moderate surface density galaxy, \na majority of material is below the threshold temperature of $2.5\\times 10^{5}\\,{\\rm K}$. This run has only negligible \nmass loss, and the $T-v_{\\rm z}$ plots show that the vertical component of the velocity corresponding to the gas \nnear the top boundary is $50-100\\,{\\rm km\\,s^{-1}},$ as compared to the escape velocity of 143 km/s.\n\nOn the other hand, in both S250K10 with $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}=50$ ${\\rm km\\,s^{-1}}$ and S500K6.5 \nwith $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}=68$ ${\\rm km\\,s^{-1}}$, more of the low density gas above the disk mid plane is \nat considerably higher temperatures than the temperature at which the cooling time is equal to the eddy turnover time. \nDue to the longer cooling time, this gas becomes thermally unstable and leads to a rapid, runaway heating\nresulting in an eventual expulsion of the gas from the host galaxy, dragging along additional material with it. \nThus, such high density, faster spinning disks are more likely to host galaxy outflows than their slow rotating less \ndenser counterparts. The mass-weighted phase plots of the temperature and the vertical component of the velocity \nfor S250K10 and S500K6.5 show that the outflowing gas is made up of a combination of phases with most of the \nmass in the hot phase at $T\\approx 10^{6}-10^{7}\\,{\\rm K}$ which also drags along some relatively low temperature \ngas as it escapes the galaxy. In both cases the vertical velocities range from $\\approx 100\\,{\\rm km\\,s^{-1}}$ to close \nto the escape velocity, which is 238 ${\\rm km\\,s^{-1}}$ in the S250K10 case and 309 ${\\rm km\\,s^{-1}}$ in the \nS500K6.5 case.\n\n\n\\subsection{Turbulent Parameters and Vertical Scale Heights} \n\nTo further explore the connection between the mass loss rate and the structure of the disk, we measured \nhow  turbulent velocities and vertical scale-heights vary with our  input parameters, $\\Sigma_{\\rm g}$ \nand $\\kappa.$  In Figure \\ref{veldis}, the filled (open) symbols follow the classification of disks hosting\noutflows above (below) $0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$, similar to those in panel \n2(a) of Figure~\\ref{starform}. Comparing the mass loss rate with the one-dimensional horizontal velocity \ndispersion, we find that with the exception of S75K30, strong outflows are ubiquitous \nin systems where $\\bar{\\sigma}^{\\rm 1D}_{\\rm H} \\geqslant 32\\,{\\rm km\\,s^{-1}}$.  \nThis is in agreement with \nthe earlier numerical \\citep{SGP12} and analytical predictions \\citep{Scann13}, which argued that \nprovided turbulent velocities can be maintained\nabove this threshold value (about $35\\,{\\rm km\\,s^{-1}}$ in \ntheir paper), the material is shocked into the thermally unstable regime, leading to runaway heating and \neventual expulsion from the galaxy.\nA compilation of a large sample of high-redshift data by \\citet{Genzel+11} also shows that galaxies with \n$\\dot{\\Sigma}_{\\star}\\geqslant \\dot{\\Sigma}_{\\star}^{\\rm cr}$ have \n$\\sigma_{\\rm H\\alpha}^{\\rm 1D}\\geqslant 35\\,{\\rm km\\,s^{-1}}$. \nOn the other hand, the vertical velocity dispersion varies \nonly weakly across the entire parameter space with a mean value of $5.7\\,{\\rm km\\,s^{-1}}$.\n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig9.pdf} \n\\caption{(color online).\nThe different panels shows the variation of the following quantities as a function of the gas surface density \nfor different ranges of the epicyclic frequency. Panel 9(a) - computed one-dimensional horizontal velocity \ndispersion, panel 9(b) - vertical velocity dispersion, panel 9(c) - the ratio of the horizontal to the vertical \nvelocities, panel 9(d) - the horizontal forcing scale, $L_{\\rm f}$, panel 9(e) - the scale-height, $H$ \nas computed in equation~(\\ref{vertscale}) and the ratio of $L_{\\rm f}/H$ in panel 9(f). Note that while \n$\\sigma_{\\rm H} \\propto \\Sigma\\,\\kappa^{-1}$ and $L_{\\rm f} \\propto \\Sigma\\,\\kappa^{-2}$ are both controlled \nby the imposed turbulent driving, the rest of the quantities represent the natural  response to horizontally \ndriven motions.\n}\n\\label{veldis}\n\\end{figure*}\n\n \nWe note here that the vertical velocity dispersion arises only in response to the horizontal turbulent motions. \nEven though only the horizontal turbulent velocity is stirred externally at a velocity proportional to $\\Sigma_{\\rm g}$\nto model gravitational driving in an unstable disk, panel 9(b) shows that the vertical velocity dispersion decreases \nonly weakly with increasing gas surface density with $\\sigma_{\\rm z} = 5.0 - 6.3\\,{\\rm km\\,s^{-1}}$. Intriguingly, \nthe small and nearly constant value of $\\sigma_{\\rm z}$ with the gas surface density is quite similar to the results \nfrom simulations in which turbulence is driven by supernovae, with a star formation rate set self-consistently by \nlocal gravitational collapse \\citep{KKO11, SO12, KOK13}. \nHowever, for turbulence driven by gravitational instability, the plot of $\\bar{\\sigma}^{\\rm 1D}_{\\rm H}/\\bar{\\sigma}_{\\rm z}$ \nin panel 9(c) suggests that turbulent velocities become increasingly {\\it anisotropic} with increasing gas surface density. \nFor a constant $\\Sigma_{\\rm g}$, the anisotropy increases for slowly rotating disks. \n\nThe variation of the imposed horizontal forcing scale, $L_{\\rm f}\\approx R \\propto \\Sigma_{\\rm g}/\\kappa^2$ \nis shown for reference in panel 9(d). At constant $\\kappa^{-1}$, the forcing scale is directly proportional to the gas \nsurface density, while at constant $\\Sigma_{\\rm g}$, slower rotating disks have a larger forcing scale. The vertical \nscale-height, $H$ shown in the panel 9(e) is measured directly from our simulations as the mass-weighted mean \nheight of the gas, \n\n", "index": 25, "text": "\\begin{equation}\nH \\equiv \\int_{z_{\\rm min}}^{z_{\\rm max}} |z|\\rho\\,dV / \\int_{z_{\\rm min}}^{z_{\\rm max}}\\rho\\,dV. \n\\label{vertscale}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"H\\equiv\\int_{z_{\\rm min}}^{z_{\\rm max}}|z|\\rho\\,dV/\\int_{z_{\\rm min}}^{z_{\\rm&#10;max%&#10;}}\\rho\\,dV.\" display=\"block\"><mrow><mrow><mi>H</mi><mo>≡</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mi>min</mi></msub><msub><mi>z</mi><mi>max</mi></msub></msubsup><mrow><mrow><mrow><mo stretchy=\"false\">|</mo><mi>z</mi><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>ρ</mi></mpadded><mo>⁢</mo><mrow><mo>𝑑</mo><mi>V</mi></mrow></mrow><mo>/</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>z</mi><mi>min</mi></msub><msub><mi>z</mi><mi>max</mi></msub></msubsup><mrow><mpadded width=\"+1.7pt\"><mi>ρ</mi></mpadded><mo>⁢</mo><mrow><mo>𝑑</mo><mi>V</mi></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nwhere in the last equality we have substituted $\\Sigma_{\\rm g} = \\kappa^{2}\\,R/2\\pi\\,G,$ where $R$ is the size of the \neddy at the forcing scale $L_{\\rm f}$. Since the scale-height $H \\ll L_{\\rm f}$ in our simulations (see figure~9f), the \nfree-fall timescale is in general smaller than the eddy-turnover time. This is also evident by comparing panels 10 (a) \nand (b) in the above figure. \nEquation~(\\ref{tffoverted}) can also be expressed as the ratio of the vertical to horizontal \nvelocity dispersion by noting that $\\sigma_{\\rm z} \\approx \n(2\\pi\\,G\\,\\Sigma_{\\rm g}\\,H)^{1/2}$ and \n$R = \\sigma_{\\rm H}/\\kappa$ such that\n\n", "itemtype": "equation", "pos": 58982, "prevtext": "\nSince $\\sigma_{\\rm z}$ remains more or less constant with $\\Sigma_{\\rm g}$, and $H \\propto \\sigma_z^2/(G \\Sigma)$, \nthis results in a decrease of the scale height with increasing $\\Sigma_{\\rm g}$ independent \nof the value of $\\kappa^{-1}$. On the other hand, for a given value of $\\Sigma_{\\rm g}$, the scale height is \nidentical for different values of $\\kappa^{-1}$.\n\n\nFinally, we find that the ratio of the forcing scale to the disk scale-height in panel 9(f) again increases with \nincreasing $\\Sigma_{\\rm g}$ and for a given surface density of the disk.  It is also larger for more slowly \nrotating disks.  For all models, we obtain $L_{\\rm f}/H > 10$. Thus, even in cases with large $H$, the forcing is still \nat large scales compared to the disk thickness as would be expected for gravitationally-driven instabilities.\n\n\n\\subsection{Timescales} \n\nThe vertically stratified medium in our simulations is constantly heated by turbulent driving \nand simultaneously cooled by atomic, ionic, and Bremsstrahlung, optically-thin radiative cooling. In the context of \ngalaxy clusters, earlier works by \\citet{MSQP12} and \\citet{SMQP12} showed that such a medium only develops \na multiphase structure if the free-fall timescale is longer than the average cooling time, where \nthe local cooling time is given by equation~(\\ref{tcool}). Note, however, that \\citet{MSQP12} employed  \na cooling function that was dominated by  thermal bremsstrahlung  while \\citet{SMQP12} included a cooling function \nsimilar to ours \\citep{SD93}, but focused on a higher range of temperatures. More importantly, cluster turbulence is \nincompressible \\citep[e.g.,][]{Churazov+12, SF12}, in contrast to our simulations, in which turbulence is supersonic, \nand the majority of the energy is kinetic rather than thermal. \n\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=2.0\\columnwidth]{fig10.pdf} \n\\caption{(color online). Variation of the eddy-turnover time (panel 10a), the free-fall time (panel 10b), the average \ncooling time (panel 10c), and the ratio of the free-fall to the cooling time (panel 10d) with the gas surface density \nfor simulations with different values of $\\kappa^{-1}$. \n}\n\\label{tscales}\n\\end{figure*}\n\n\nIn Figure~\\ref{tscales}, we show the variation of the free-fall time, the eddy-turnover time, the cooling time, and \nthe ratio of the free-fall to the cooling timescale in our simulations as a function of surface density and rotation rate. \nIncluding constant factors, the eddy-turnover time in our simulations is, $t_{\\rm ed} \\approx 1.2\\,\\kappa^{-1},$ \ni.e., independent of $\\Sigma$.\nHowever, we must analyse our simulation results to obtain the free-fall timescale defined as\n\\begin{eqnarray}\nt_{\\rm ff} &\\equiv&\n\\left(\\frac{H}{2\\pi\\,G\\,\\Sigma_{\\rm g}}\\right)^{1/2} \\\\ \\nonumber\n&=& 5.9\\,{\\rm Myr}\\,\\left(\\frac{H}{100\\,{\\rm pc}} \\right)^{1/2} \n\\left( \\frac{\\Sigma_{\\rm g}}{100\\,{\\rm M}_\\odot {\\rm pc}^{-2}}\\right)^{-1/2},\n\\label{tff}\n\\end{eqnarray}\nwhere \nwe quote $t_{\\rm ff}$ in the plane in which $z = H,$ the vertical scale height defined in eq.\\  (\\ref{vertscale}). \nUsing the values of $H$ from \nFigure~\\ref{veldis} in the above equation, we find that $t_{\\rm ff}$ steadily decreases with $\\Sigma_{\\rm g}$ \nfor a given value of the epicyclic frequency. Moreover, at a constant $\\Sigma_{\\rm g}$, the free-fall time scales \nare similar due to identical values of the scale height.\nThe ratio of the free-fall time to the eddy-turnover time can also be written as\n\n", "index": 27, "text": "\\begin{equation}\n\\frac{t_{\\rm ff}}{t_{\\rm ed}} = \\frac{\\kappa}{1.2\\,\\sqrt{2\\pi\\,G}}\\left(\\frac{H}{\\Sigma_{\\rm g}}\\right)^{1/2} \n= 0.83\\left(\\frac{H}{R}\\right)^{1/2},\n\\label{tffoverted}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\frac{t_{\\rm ff}}{t_{\\rm ed}}=\\frac{\\kappa}{1.2\\,\\sqrt{2\\pi\\,G}}\\left(\\frac{H}%&#10;{\\Sigma_{\\rm g}}\\right)^{1/2}=0.83\\left(\\frac{H}{R}\\right)^{1/2},\" display=\"block\"><mrow><mrow><mfrac><msub><mi>t</mi><mi>ff</mi></msub><msub><mi>t</mi><mi>ed</mi></msub></mfrac><mo>=</mo><mrow><mfrac><mi>κ</mi><mrow><mpadded width=\"+1.7pt\"><mn>1.2</mn></mpadded><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mi>G</mi></mrow></msqrt></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>H</mi><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>=</mo><mrow><mn>0.83</mn><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>H</mi><mi>R</mi></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00659.tex", "nexttext": "\nwhere $Q = 2\\pi\\,G\\,\\Sigma_{\\rm g}/\\kappa\\,\\sigma_{\\rm H}$ is the Toomre parameter. Thus for $Q=1$, the ratio of the \nfree-fall to the eddy-turnover time can be interpreted as the ratio of the vertical to the horizontal velocity dispersions \nand therefore as a measure of the isotropy of the velocities. \n\nUsing the scale height and the vertical velocity dispersion, one could construct a vertical mixing time scale, \n$t_{\\rm mix} = H/\\sigma_{\\rm z} = \\sigma_{\\rm z}/2\\,\\pi\\,G\\,\\Sigma_{\\rm g}$, where we have substituted, \n$H \\approx \\sigma_{\\rm z}^{2}/2\\,\\pi\\,G\\,\\Sigma_{\\rm g}$. Using the values of $\\sigma_{\\rm z}$ and $\\Sigma_{\\rm g}$\nfrom Table~\\ref{sumsim}, we find that the mixing time scale is similar to the free fall time scale with high surface \ndensity, rapidly rotating disks having smaller mixing time scales compared to low surface density, slowly rotating \ndisks. \n\n\nIn Panel 10(c) we show the mass-weighted average cooling time, $\\bar{t}_{\\rm cool}$, defined as the ratio of \nthe total thermal energy to the total cooling rate. \nWe find that the cooling times are particularly short in high surface density disks. We note here that in our simulations, \nthe turbulence (modeling motions driven by gravitational instabilities) is converted into thermal energy and then radiated \naway. Thus one could in principle also estimate the cooling time as the time taken to radiate away both the thermal \nenergy and the kinetic energy from the system. While both these times are similar in a subsonic medium such as studied \nby \\citet{MSQP12} and \\citet{SMQP12}, in a supersonic medium the time to radiate away the total energy would be \nmuch longer than the time to radiate only the thermal energy.\n\n\nThe ratio of the free-fall time to the average cooling time calculated from the thermal energy plotted in panel 10(d) \nshows that $t_{\\rm ff}/\\bar{t}_{\\rm cool} > 1$  for all the runs in this paper, even though $t_{\\rm ff}/t_{\\rm eddy}<1$ \nmeaning that material will collapse vertically faster then gravitational driving will form clumps horizontally.\nThus, in agreement  with the earlier results of \\citep{MSQP12} and \\citet{SMQP12}, we expect a multiphase distribution.  \nOn the other hand, as Table~\\ref{sumsim} shows, not all of these runs harbor strong outflows. Within the realm of our \nnumerical setup,  horizontal driving always allows for $t_{\\rm ff}/\\bar{t}_{\\rm cool} > 1$ and a multiphase medium, \nbut this is not a sufficient condition for the existence of sustainable outflows.\n\n\n\\section{Conclusions}\n\nGlobal outflows occur across a wide range of galaxy masses and redshifts, and \nobservations suggest that they are most prominent in galaxies in which  the star-formation rate \ndensity exceeds $\\dot{\\Sigma}_\\star \\geqslant 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$. \nFurthermore,  recent observations show that the ISM in such galaxies has internal velocity dispersions \nof $\\approx 50-100\\,{\\rm km\\,s^{-1}}$ \\citep{SH09, West+09, Law+09, Green+10, Genzel+11, Swinbank+11}.\nHowever, typically numerical simulations with supernova \ndriving attain velocity dispersions of only $\\approx 7-20\\,{\\rm km\\,s^{-1}}.$ \nAs current observations are unable to resolve the disk scale height or cleanly determine the orientation of\nrandom velocities  with respect to the plane, it is thus possible that the \nlarge observed velocity dispersions arise not from stellar feedback but from large-scale gravitational instabilities \nin the disk. These will occur on scales $R\\gg H$ and tap into macroscopic differences in the rotation rate and the \ngravitational potential, rather than nuclear processes, to drive large, anisotropic random motions.  \n\nHere we have carried out a first exploration of the possible role of gravitational instabilities in driving\noutflows from high surface-density disk galaxies. \nTo focus on the effect of instabilities rather than the growth and maintenance of these modes, \nwe drive turbulence to a level expected for a Toomre critical disk. \nWithin this framework, we examine the role of two key parameters, namely the gas surface density, $\\Sigma_{\\rm g}$ \nand the epicyclic frequency, $\\kappa$. Crucially, only the horizontal turbulence is driven, consistent with \nexpectations for disk instabilities. \nThe advantage of this parametrization, in which $\\sigma_{\\rm H} = \\pi\\,G\\,\\Sigma/\\kappa$, \nis that we are able to control the velocity dispersion by simply adjusting the surface \ndensity of the medium. This allows us to probe a wide variety of disk conditions. \nMoreover as Figures~\\ref{starform}, \\ref{veldis} and \\ref{tscales}\nshow, our approach also enables us to probe the variation of turbulent velocities, \ngas mass loss rates and the various timescales with the gas surface density and \nthe epicyclic frequency. \n\nThe key result arising from our study is that turbulence of the amplitude expected from gravitational \ninstabilities can indeed drive galaxy outflows at a level $\\dot{\\Sigma}_{\\rm g}/\\dot{\\Sigma}_{\\star} \\gtrsim 0.1$,\neven in absence of additional energy input from supernovae. Our models show that global outflows of \nthis kind are likely to be present in the highly compact and rapidly rotating disks that were common at \nhigh redshift, while they are more likely to be weak or completely absent in less compact and slowly \nrotating disks such as our Milky Way. Within the range of the parameter space of \n$\\Sigma_{\\rm g}$ and $\\kappa^{-1}$ that we probed, \n$\\dot{\\Sigma}_{\\rm g}\\geqslant 0.02\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$\n outflows occured in galaxies where the gas surface densities exceeded \n$100 \\,{\\rm M}_{\\odot}\\,{\\rm pc^{-2}}$ with a lower bound of $\\kappa^{-1}=20\\,{\\rm Myr}$. \nInterestingly, this threshold values is very close to the value of the critical star-formation rate \ndensities  of $\\dot{\\Sigma}_{\\star} > 0.1\\,{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}$. \n\nOur results also indicate that outflows arise if the one-dimensional horizontal velocity dispersion \nexceeds a critical value of $\\approx 35\\,{\\rm km\\,s^{-1}}$.   \nWe find that the vertical velocity dispersion has a mean value of $5.7\\,{\\rm km\\,s^{-1}}$, \nlargely independent of the parameters of our simulation. Such low values are also obtained in ISM simulations \nwhere supernovae feedback is explicitly included \\citep[e.g.,][]{SO12, KOK13}.\nFurthermore, two-dimensional slices in the $x-z$ plane show their disks to be thin and quasi-steady\nover many eddy-turnover times.  \nIn an additional test run, we lowered the temperature floor to 300 K for the S250K10 run and found \nthat the mass outflow rate and the estimate of the mass-weighted $\\sigma_{\\rm z}$ are similar to the \nestimates from the fiducial S250K10 run (see Appendix for a comparison between the two runs). \nThis implies that lowering the temperature floor to capture the dynamics of the cold dense medium is not \ncrucial for outflow generation.\n\nThe occurrence of outflows in our study can be further explained from the thermodynamic properties of the \nISM in these disks. As Figure~\\ref{s500k10} shows, even if one starts with a constant temperature distribution, \nthe ISM in these galaxies soon evolves into a multiphase distribution. Certain regions attain temperatures \nhigher than the critical temperature beyond which the radiative cooling rate progressively \ndecreases. Over the course of the evolution, this results in a runaway arising from inefficient cooling of these \nhot regions coupled with successive heating from turbulent driving. The combined action of these two effects \nleads to the motion of the gas outward through the simulation domain. In a nutshell, the above arguments \nsuggest that in the absence of stellar feedback, outflows from high redshift galaxies can arise from\na turbulent heating instability due to the progressive  decline in the efficiency of radiative cooling beyond \n$T\\approx 2.5\\times 10^{5}\\,{\\rm K}$. \n\nAs a caveat, we note that the results of this study {\\it assume} that turbulence can be sustained at a steady \nlevel $\\sigma_{\\rm H} \\approx \\pi\\,G\\,\\Sigma_{\\rm g}/\\kappa$ over many local dynamical times, via horizontal \ninstabilities at scales $R\\approx \\pi\\,G\\,\\Sigma_{\\rm g}/\\kappa^{2}$ between the disk \nthickness $(\\sigma_{\\rm z}/\\sigma_{\\rm H})^2R/2 $ and the Toomre wavelength \n$4 \\pi R$. However, previous simulations have shown that without small-scale feedback, gravitationally unstable \ndisks may have SFRs high enough to deplete the local gas within a few orbital times \\citep[e.g.,][]{Hopkins+11, Agertz+13}. \nThis would reduce the spatial scale ($\\propto R$ if Q remains $\\approx 1$) of gravitational instabilities and \nthe corresponding rotational velocity differences that these instabilities can tap, leading to lower \n$\\sigma_{\\rm H} \\approx\\pi\\,G\\,\\Sigma_{\\rm g}/\\kappa$. Thus, a state in which high amplitude turbulence is \nmaintained over many orbital times may require significant accretion of gas from larger scales and/or suppression \nof local collapse by stellar feedback.  We also note here that turbulent driving as implemented in our \nsimulations is insensitive to hot or cold gas in the sense that it is likely to drive both the high density cold \ngas and the low density hot gas in a similar fashion. However, in a realistic environment self-gravity could \ndrive high density and low density gases very differently. The resulting effect on the generation of outflows \nin such systems merits a careful analysis.\n\n\nAn important limitation of our work is the neglect of cold dense phases of the ISM. An accurate modeling of \nthe CNM requires the inclusion of cooling due to both fine structure atomic lines and CO rotational line emission. \nHowever, this would lead to the development of small, very dense structures that would not be spatially resolved \nin some of our present simulations. It would be interesting to include these low temperature processes in the \ncooling routines in a future study with the aim to understand its effect on the generation of galaxy outflows. \n\nAn additional issue with the simulations reported here relates the number of cells by which the length scale \n$l_{\\rm sg} \\approx c_s^{2}/g(z)$,  corresponding to the gravity source term in the momentum equation, is resolved. \nBecause the present  simulations do not follow 3D self-gravitating fragmentation at small scales, the usual \nTruelove criterion ($l_{\\rm J} > 4\\,dx$) for avoiding unphysical excitation of small-scale noise in AMR simulations \ndoes not directly apply. Here, we have  only vertical gravity associated with the integrated surface density of gas, \nwhich is not substantially altered  by grid-scale noise. However, we note that in our simulations we only just \nresolve the Jeans scale for low surface density disks. Thus, fully self-gravitating simulations that seek to \naddress the issues considered in this paper would require substantially higher resolution than we have adopted \nhere.\n\nOur results also raise the question of how energy input from supernovae and gravitational instabilities might  \nwork in conjunction in rapidly star forming galaxies. The outflow rates obtained in our study should be \nthought of as lower limits; stellar processes may or may not lead to additional mass loss. \nInterestingly, the high-surface density disk simulations of \\citet{WN07} showed that the inclusion \nof supernova feedback did not lead to any appreciable change in the morphology or in the density PDF \n(see Figs.~18 and 19 in their paper)  compared to the case where turbulence in the disk solely arose \nfrom gravitational instabilities. However, these simulations only spanned a region $0.32\\,{\\rm kpc}$ in the \nvertical direction which may not be sufficient to draw any immediate conclusions about the combined impact \nof stellar feedback and gravitational instabilities. Among other questions, it will be interesting to explore how \nturbulent velocities resulting from the combined effect of gravitational instabilities and supernova driving scale \nwith disk properties. \nCorrespondingly, it would be interesting to test how star formation rates differ when turbulence is \ndriven by both supernovae and large-scale instabilities. Finally, magnetic fields are an important component \nof the ISM where they play a variety of roles ranging from controlling star formation, influencing turbulent \nmixing \\citep{Sur+14, SPS14}, to the confinement and propagation of cosmic rays. How such fields will affect \nthe conclusions of this study is an open question. These are some of the issues we intend to address in \nforthcoming papers. \n\n\\acknowledgments\n\nWe would like to thank William Gray, Christopher Matzner, Prateek Sharma and Robert Thacker for helpful \ndiscussions and the anonymous referee for his/her comments. S.~S \\& E.~S were supported by National \nScience Foundation grant AST11-03608 and NASA theory grants NNX09AD106 and NNX15AK82G. E.~S gratefully \nacknowledges the Simons Foundation for funding the workshop  {\\em Galactic Winds: Beyond Phenomenology} \nwhich helped to inspire this work.  He also gratefully acknowledges Joanne Cohn, Eliot Quataert, and the UC Berkeley \nTheoretical Astronomy  Center, and Uro\\v{s} Seljak and the Lawrence  Berkeley National Lab Cosmology group, for \nhosting him during the period when much of this work was carried out.  Part of this research was carried out during the \nvisit of E.~S and E.~C.~O at the KITP in U.~C. Santa Barbara, which  is supported by the National Science \nFoundation under grant PHY-1125915. The work of E.~C.~O on this project was supported by the National \nScience Foundation under grant AST-1312006. The authors would like to thank the  Texas Advanced Computing \nCenter (TACC) at The University of Texas at Austin (URL: http://www.tacc.utexas.edu),  and the Extreme \nScience and Engineering Discovery Environment (XSEDE) for providing HPC resources via grant \nTG-AST140004 that have contributed to the results reported within this paper. The FLASH code is developed \nin part by the DOE-supported Alliances Center for Astrophysical Thermonuclear Flashes (ASC) at the \nUniversity of Chicago.\n\n\\bibliographystyle{apj}\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Agertz} {et~al.}(2013){Agertz}, {Kravtsov}, {Leitner}, \\&\n  {Gnedin}}]{Agertz+13}\n{Agertz}, O., {Kravtsov}, A.~V., {Leitner}, S.~N., \\& {Gnedin}, N.~Y. 2013,\n  \\apj, 770, 25\n\n\\bibitem[{{Agertz} {et~al.}(2009){Agertz}, {Lake}, {Teyssier}, {Moore},\n  {Mayer}, \\& {Romeo}}]{Agertz+09}\n{Agertz}, O., {Lake}, G., {Teyssier}, R., {et~al.} 2009, \\mnras, 392, 294\n\n\\bibitem[{{Agertz} {et~al.}(2015){Agertz}, {Romeo}, \\& {Grisdale}}]{ARG15}\n{Agertz}, O., {Romeo}, A.~B., \\& {Grisdale}, K. 2015, \\mnras, 449, 2156\n\n\\bibitem[{{Benson} {et~al.}(2003){Benson}, {Bower}, {Frenk}, {Lacey}, {Baugh},\n  \\& {Cole}}]{Bens+03}\n{Benson}, A.~J., {Bower}, R.~G., {Frenk}, C.~S., {et~al.} 2003, \\apj, 599, 38\n\n\\bibitem[{{Benzi} {et~al.}(2008){Benzi}, {Biferale}, {Fisher}, {Kadanoff},\n  {Lamb}, \\& {Toschi}}]{Benzi+08}\n{Benzi}, R., {Biferale}, L., {Fisher}, R.~T., {et~al.} 2008, Physical Review\n  Letters, 100, 234503\n\n\\bibitem[{{Boettcher} {et~al.}(2013){Boettcher}, {Zweibel}, {Yoast-Hull}, \\&\n  {Gallagher}}]{Boett+13}\n{Boettcher}, E., {Zweibel}, E.~G., {Yoast-Hull}, T.~M., \\& {Gallagher}, III,\n  J.~S. 2013, \\apj, 779, 12\n\n\\bibitem[{{Bomans} {et~al.}(1997){Bomans}, {Chu}, \\& {Hopp}}]{Bomans+97}\n{Bomans}, D.~J., {Chu}, Y.-H., \\& {Hopp}, U. 1997, \\aj, 113, 1678\n\n\\bibitem[{{Booth} {et~al.}(2013){Booth}, {Agertz}, {Kravtsov}, \\&\n  {Gnedin}}]{Booth+13}\n{Booth}, C.~M., {Agertz}, O., {Kravtsov}, A.~V., \\& {Gnedin}, N.~Y. 2013,\n  \\apjl, 777, L16\n\n\\bibitem[{{Buitrago} {et~al.}(2008){Buitrago}, {Trujillo}, {Conselice},\n  {Bouwens}, {Dickinson}, \\& {Yan}}]{Buitrago+08}\n{Buitrago}, F., {Trujillo}, I., {Conselice}, C.~J., {et~al.} 2008, \\apjl, 687,\n  L61\n\n\\bibitem[{{Ceverino} {et~al.}(2010){Ceverino}, {Dekel}, \\& {Bournaud}}]{CDB10}\n{Ceverino}, D., {Dekel}, A., \\& {Bournaud}, F. 2010, \\mnras, 404, 2151\n\n\\bibitem[{{Chamandy} {et~al.}(2014){Chamandy}, {Shukurov}, {Subramanian}, \\&\n  {Stoker}}]{CSSS14}\n{Chamandy}, L., {Shukurov}, A., {Subramanian}, K., \\& {Stoker}, K. 2014,\n  \\mnras, 443, 1867\n\n\\bibitem[{{Chen} {et~al.}(2010){Chen}, {Helsby}, {Gauthier}, {Shectman},\n  {Thompson}, \\& {Tinker}}]{Chen+10}\n{Chen}, H.-W., {Helsby}, J.~E., {Gauthier}, J.-R., {et~al.} 2010, \\apj, 714,\n  1521\n\n\\bibitem[{{Churazov} {et~al.}(2012){Churazov}, {Vikhlinin}, {Zhuravleva},\n  {Schekochihin}, {Parrish}, {Sunyaev}, {Forman}, {B{\\\"o}hringer}, \\&\n  {Randall}}]{Churazov+12}\n{Churazov}, E., {Vikhlinin}, A., {Zhuravleva}, I., {et~al.} 2012, \\mnras, 421,\n  1123\n\n\\bibitem[{{Cole} {et~al.}(2000){Cole}, {Lacey}, {Baugh}, \\& {Frenk}}]{CLBF00}\n{Cole}, S., {Lacey}, C.~G., {Baugh}, C.~M., \\& {Frenk}, C.~S. 2000, \\mnras,\n  319, 168\n\n\\bibitem[{{Conselice}(2014)}]{Con14}\n{Conselice}, C.~J. 2014, \\araa, 52, 291\n\n\\bibitem[{{Daddi} {et~al.}(2005){Daddi}, {Renzini}, {Pirzkal}, {Cimatti},\n  {Malhotra}, {Stiavelli}, {Xu}, {Pasquali}, {Rhoads}, {Brusa}, {di Serego\n  Alighieri}, {Ferguson}, {Koekemoer}, {Moustakas}, {Panagia}, \\&\n  {Windhorst}}]{Daddi+05}\n{Daddi}, E., {Renzini}, A., {Pirzkal}, N., {et~al.} 2005, \\apj, 626, 680\n\n\\bibitem[{{Dalla Vecchia} \\& {Schaye}(2012)}]{VS12}\n{Dalla Vecchia}, C., \\& {Schaye}, J. 2012, \\mnras, 426, 140\n\n\\bibitem[{{de Avillez} \\& {Breitschwerdt}(2004)}]{dAB04}\n{de Avillez}, M.~A., \\& {Breitschwerdt}, D. 2004, \\aap, 425, 899\n\n\\bibitem[{{de Avillez} \\& {Breitschwerdt}(2012)}]{dAB12}\n---. 2012, \\apjl, 756, L3\n\n\\bibitem[{{Defouw}(1970)}]{Def70}\n{Defouw}, R.~J. 1970, \\apj, 160, 659\n\n\\bibitem[{{Dekel} \\& {Silk}(1986)}]{DS86}\n{Dekel}, A., \\& {Silk}, J. 1986, \\apj, 303, 39\n\n\\bibitem[{{Dib} {et~al.}(2006){Dib}, {Bell}, \\& {Burkert}}]{DBB06}\n{Dib}, S., {Bell}, E., \\& {Burkert}, A. 2006, \\apj, 638, 797\n\n\\bibitem[{{Erb} {et~al.}(2006){Erb}, {Shapley}, {Pettini}, {Steidel}, {Reddy},\n  \\& {Adelberger}}]{Erb+06}\n{Erb}, D.~K., {Shapley}, A.~E., {Pettini}, M., {et~al.} 2006, \\apj, 644, 813\n\n\\bibitem[{{Eswaran} \\& {Pope}(1988)}]{EP88}\n{Eswaran}, V., \\& {Pope}, S.~B. 1988, Physics of Fluids, 31, 506\n\n\\bibitem[{{Ferguson} {et~al.}(2004){Ferguson}, {Dickinson}, {Giavalisco},\n  {Kretchmer}, {Ravindranath}, {Idzi}, {Taylor}, {Conselice}, {Fall},\n  {Gardner}, {Livio}, {Madau}, {Moustakas}, {Papovich}, {Somerville},\n  {Spinrad}, \\& {Stern}}]{Ferg+04}\n{Ferguson}, H.~C., {Dickinson}, M., {Giavalisco}, M., {et~al.} 2004, \\apjl,\n  600, L107\n\n\\bibitem[{{Ferrara} {et~al.}(2005){Ferrara}, {Scannapieco}, \\&\n  {Bergeron}}]{Ferrara+05}\n{Ferrara}, A., {Scannapieco}, E., \\& {Bergeron}, J. 2005, \\apjl, 634, L37\n\n\\bibitem[{{Field}(1965)}]{Field65}\n{Field}, G.~B. 1965, \\apj, 142, 531\n\n\\bibitem[{{Fryxell} {et~al.}(2000){Fryxell}, {Olson}, {Ricker}, {Timmes},\n  {Zingale}, {Lamb}, {MacNeice}, {Rosner}, {Truran}, \\& {Tufo}}]{Fryxell+00}\n{Fryxell}, B., {Olson}, K., {Ricker}, P., {et~al.} 2000, \\apjs, 131, 273\n\n\\bibitem[{{Fujita} {et~al.}(2004){Fujita}, {Mac Low}, {Ferrara}, \\&\n  {Meiksin}}]{Fujita+04}\n{Fujita}, A., {Mac Low}, M.-M., {Ferrara}, A., \\& {Meiksin}, A. 2004, \\apj,\n  613, 159\n\n\\bibitem[{{Gatto} {et~al.}(2015){Gatto}, {Walch}, {Low}, {Naab}, {Girichidis},\n  {Glover}, {W{\\\"u}nsch}, {Klessen}, {Clark}, {Baczynski}, {Peters},\n  {Ostriker}, {Ib{\\'a}{\\~n}ez-Mej{\\'{\\i}}a}, \\& {Haid}}]{Gatto+15}\n{Gatto}, A., {Walch}, S., {Low}, M.-M.~M., {et~al.} 2015, \\mnras, 449, 1057\n\n\\bibitem[{{Genel} {et~al.}(2012{\\natexlab{a}}){Genel}, {Dekel}, \\&\n  {Cacciato}}]{GDC12}\n{Genel}, S., {Dekel}, A., \\& {Cacciato}, M. 2012{\\natexlab{a}}, \\mnras, 425,\n  788\n\n\\bibitem[{{Genel} {et~al.}(2012{\\natexlab{b}}){Genel}, {Naab}, {Genzel},\n  {F{\\\"o}rster Schreiber}, {Sternberg}, {Oser}, {Johansson}, {Dav{\\'e}},\n  {Oppenheimer}, \\& {Burkert}}]{Genel+12}\n{Genel}, S., {Naab}, T., {Genzel}, R., {et~al.} 2012{\\natexlab{b}}, \\apj, 745,\n  11\n\n\\bibitem[{{Gent} {et~al.}(2013){Gent}, {Shukurov}, {Sarson}, {Fletcher}, \\&\n  {Mantere}}]{Gent+13}\n{Gent}, F.~A., {Shukurov}, A., {Sarson}, G.~R., {Fletcher}, A., \\& {Mantere},\n  M.~J. 2013, \\mnras, 430, L40\n\n\\bibitem[{{Genzel} {et~al.}(2011){Genzel}, {Newman}, {Jones}, {F{\\\"o}rster\n  Schreiber}, {Shapiro}, {Genel}, {Lilly}, {Renzini}, {Tacconi}, {Bouch{\\'e}},\n  {Burkert}, {Cresci}, {Buschkamp}, {Carollo}, {Ceverino}, {Davies}, {Dekel},\n  {Eisenhauer}, {Hicks}, {Kurk}, {Lutz}, {Mancini}, {Naab}, {Peng},\n  {Sternberg}, {Vergani}, \\& {Zamorani}}]{Genzel+11}\n{Genzel}, R., {Newman}, S., {Jones}, T., {et~al.} 2011, \\apj, 733, 101\n\n\\bibitem[{{Gerritsen} \\& {Icke}(1997)}]{GI97}\n{Gerritsen}, J.~P.~E., \\& {Icke}, V. 1997, \\aap, 325, 972\n\n\\bibitem[{{Girichidis} {et~al.}(2015){Girichidis}, {Walch}, {Naab}, {Gatto},\n  {W{\\\"u}nsch}, {Glover}, {Klessen}, {Clark}, {Peters}, {Derigs}, \\&\n  {Baczynski}}]{Giri+15}\n{Girichidis}, P., {Walch}, S., {Naab}, T., {et~al.} 2015, ArXiv e-prints,\n  arXiv:1508.06646\n\n\\bibitem[{{Governato} {et~al.}(2007){Governato}, {Willman}, {Mayer}, {Brooks},\n  {Stinson}, {Valenzuela}, {Wadsley}, \\& {Quinn}}]{Governato+07}\n{Governato}, F., {Willman}, B., {Mayer}, L., {et~al.} 2007, \\mnras, 374, 1479\n\n\\bibitem[{{Gray} \\& {Scannapieco}(2010)}]{GS10}\n{Gray}, W.~J., \\& {Scannapieco}, E. 2010, \\apj, 718, 417\n\n\\bibitem[{{Green} {et~al.}(2010){Green}, {Glazebrook}, {McGregor}, {Abraham},\n  {Poole}, {Damjanov}, {McCarthy}, {Colless}, \\& {Sharp}}]{Green+10}\n{Green}, A.~W., {Glazebrook}, K., {McGregor}, P.~J., {et~al.} 2010, \\nat, 467,\n  684\n\n\\bibitem[{{Gressel} {et~al.}(2008){Gressel}, {Elstner}, {Ziegler}, \\&\n  {R{\\\"u}diger}}]{Gressel+08}\n{Gressel}, O., {Elstner}, D., {Ziegler}, U., \\& {R{\\\"u}diger}, G. 2008, \\aap,\n  486, L35\n\n\\bibitem[{{Hanasz} {et~al.}(2013){Hanasz}, {Lesch}, {Naab}, {Gawryszczak},\n  {Kowalik}, \\& {W{\\'o}lta{\\'n}ski}}]{Han+13}\n{Hanasz}, M., {Lesch}, H., {Naab}, T., {et~al.} 2013, \\apjl, 777, L38\n\n\\bibitem[{{Heckman}(2002)}]{Heckman02}\n{Heckman}, T.~M. 2002, in Astronomical Society of the Pacific Conference\n  Series, Vol. 254, Extragalactic Gas at Low Redshift, ed. J.~S. {Mulchaey} \\&\n  J.~T. {Stocke}, 292\n\n\\bibitem[{{Heckman}(2003)}]{H03}\n{Heckman}, T.~M. 2003, in Revista Mexicana de Astronomia y Astrofisica, vol.\n  27, Vol.~17, Revista Mexicana de Astronomia y Astrofisica Conference Series,\n  ed. V.~{Avila-Reese}, C.~{Firmani}, C.~S. {Frenk}, \\& C.~{Allen}, 47--55\n\n\\bibitem[{{Heckman} {et~al.}(1990){Heckman}, {Armus}, \\& {Miley}}]{HAM90}\n{Heckman}, T.~M., {Armus}, L., \\& {Miley}, G.~K. 1990, \\apjs, 74, 833\n\n\\bibitem[{{Hennebelle} \\& {Iffrig}(2014)}]{HI14}\n{Hennebelle}, P., \\& {Iffrig}, O. 2014, \\aap, 570, A81\n\n\\bibitem[{{Hill} {et~al.}(2012){Hill}, {Joung}, {Mac Low}, {Benjamin},\n  {Haffner}, {Klingenberg}, \\& {Waagan}}]{Hill+12}\n{Hill}, A.~S., {Joung}, M.~R., {Mac Low}, M.-M., {et~al.} 2012, \\apj, 750, 104\n\n\\bibitem[{{Hoffmann} \\& {Romeo}(2012)}]{HR12}\n{Hoffmann}, V., \\& {Romeo}, A.~B. 2012, \\mnras, 425, 1511\n\n\\bibitem[{{Hopkins} {et~al.}(2011){Hopkins}, {Quataert}, \\&\n  {Murray}}]{Hopkins+11}\n{Hopkins}, P.~F., {Quataert}, E., \\& {Murray}, N. 2011, \\mnras, 417, 950\n\n\\bibitem[{{Hopkins} {et~al.}(2012){Hopkins}, {Quataert}, \\&\n  {Murray}}]{Hopkins+12}\n---. 2012, \\mnras, 421, 3522\n\n\\bibitem[{{Immeli} {et~al.}(2004){Immeli}, {Samland}, {Gerhard}, \\&\n  {Westera}}]{Imm+04}\n{Immeli}, A., {Samland}, M., {Gerhard}, O., \\& {Westera}, P. 2004, \\aap, 413,\n  547\n\n\\bibitem[{{Joung} \\& {Mac Low}(2006)}]{JM06}\n{Joung}, M.~K.~R., \\& {Mac Low}, M.-M. 2006, \\apj, 653, 1266\n\n\\bibitem[{{Joung} {et~al.}(2009){Joung}, {Mac Low}, \\& {Bryan}}]{JMB09}\n{Joung}, M.~R., {Mac Low}, M.-M., \\& {Bryan}, G.~L. 2009, \\apj, 704, 137\n\n\\bibitem[{{Kennicutt}(1998)}]{Ken98}\n{Kennicutt}, Jr., R.~C. 1998, \\araa, 36, 189\n\n\\bibitem[{{Kewley} \\& {Ellison}(2008)}]{KE08}\n{Kewley}, L.~J., \\& {Ellison}, S.~L. 2008, \\apj, 681, 1183\n\n\\bibitem[{{Kim} {et~al.}(2011){Kim}, {Kim}, \\& {Ostriker}}]{KKO11}\n{Kim}, C.-G., {Kim}, W.-T., \\& {Ostriker}, E.~C. 2011, \\apj, 743, 25\n\n\\bibitem[{{Kim} \\& {Ostriker}(2015)}]{KO15}\n{Kim}, C.-G., \\& {Ostriker}, E.~C. 2015, \\apj, 802, 99\n\n\\bibitem[{{Kim} {et~al.}(2013){Kim}, {Ostriker}, \\& {Kim}}]{KOK13}\n{Kim}, C.-G., {Ostriker}, E.~C., \\& {Kim}, W.-T. 2013, \\apj, 776, 1\n\n\\bibitem[{{Kim} \\& {Ostriker}(2001)}]{KO01}\n{Kim}, W.-T., \\& {Ostriker}, E.~C. 2001, \\apj, 559, 70\n\n\\bibitem[{{Kim} \\& {Ostriker}(2007)}]{KO07}\n---. 2007, \\apj, 660, 1232\n\n\\bibitem[{{Kim} {et~al.}(2002){Kim}, {Ostriker}, \\& {Stone}}]{KOS02}\n{Kim}, W.-T., {Ostriker}, E.~C., \\& {Stone}, J.~M. 2002, \\apj, 581, 1080\n\n\\bibitem[{{Koyama} \\& {Inutsuka}(2000)}]{KI00}\n{Koyama}, H., \\& {Inutsuka}, S.-I. 2000, \\apj, 532, 980\n\n\\bibitem[{{Krumholz} \\& {Thompson}(2012)}]{KT12}\n{Krumholz}, M.~R., \\& {Thompson}, T.~A. 2012, \\apj, 760, 155\n\n\\bibitem[{{Law} {et~al.}(2009){Law}, {Steidel}, {Erb}, {Larkin}, {Pettini},\n  {Shapley}, \\& {Wright}}]{Law+09}\n{Law}, D.~R., {Steidel}, C.~C., {Erb}, D.~K., {et~al.} 2009, \\apj, 697, 2057\n\n\\bibitem[{{Lee} {et~al.}(2009){Lee}, {Deane}, \\& {Federrath}}]{Lee+09}\n{Lee}, D., {Deane}, A.~E., \\& {Federrath}, C. 2009, in Astronomical Society of\n  the Pacific Conference Series, Vol. 406, Numerical Modeling of Space Plasma\n  Flows: ASTRONUM-2008, ed. N.~V. {Pogorelov}, E.~{Audit}, P.~{Colella}, \\&\n  G.~P. {Zank}, 243\n\n\\bibitem[{{Lee} {et~al.}(2012){Lee}, {Gopal}, \\& {Mohapatra}}]{Lee+12}\n{Lee}, D., {Gopal}, S., \\& {Mohapatra}, P. 2012, in Astronomical Society of the\n  Pacific Conference Series, Vol. 459, Numerical Modeling of Space Plasma Slows\n  (ASTRONUM 2011), ed. N.~V. {Pogorelov}, J.~A. {Font}, E.~{Audit}, \\& G.~P.\n  {Zank}, 334\n\n\\bibitem[{{Mac Low} \\& {Ferrara}(1999)}]{MF99}\n{Mac Low}, M.-M., \\& {Ferrara}, A. 1999, \\apj, 513, 142\n\n\\bibitem[{{Mac Low} {et~al.}(1989){Mac Low}, {McCray}, \\& {Norman}}]{MMN89}\n{Mac Low}, M.-M., {McCray}, R., \\& {Norman}, M.~L. 1989, \\apj, 337, 141\n\n\\bibitem[{{Madau} \\& {Dickinson}(2014)}]{MD14}\n{Madau}, P., \\& {Dickinson}, M. 2014, \\araa, 52, 415\n\n\\bibitem[{{Mannucci} {et~al.}(2010){Mannucci}, {Cresci}, {Maiolino}, {Marconi},\n  \\& {Gnerucci}}]{Mannucci10}\n{Mannucci}, F., {Cresci}, G., {Maiolino}, R., {Marconi}, A., \\& {Gnerucci}, A.\n  2010, \\mnras, 408, 2115\n\n\\bibitem[{{Martin}(1999)}]{Martin99}\n{Martin}, C.~L. 1999, \\apj, 513, 156\n\n\\bibitem[{{Martin} {et~al.}(2010){Martin}, {Scannapieco}, {Ellison}, {Hennawi},\n  {Djorgovski}, \\& {Fournier}}]{Martin+10}\n{Martin}, C.~L., {Scannapieco}, E., {Ellison}, S.~L., {et~al.} 2010, \\apj, 721,\n  174\n\n\\bibitem[{{Martin} {et~al.}(2013){Martin}, {Shapley}, {Coil}, {Kornei},\n  {Murray}, \\& {Pancoast}}]{Martin+13}\n{Martin}, C.~L., {Shapley}, A.~E., {Coil}, A.~L., {et~al.} 2013, \\apj, 770, 41\n\n\\bibitem[{{Martizzi} {et~al.}(2015){Martizzi}, {Faucher-Gigu{\\`e}re}, \\&\n  {Quataert}}]{Martizzi+15}\n{Martizzi}, D., {Faucher-Gigu{\\`e}re}, C.-A., \\& {Quataert}, E. 2015, \\mnras,\n  450, 504\n\n\\bibitem[{{Matzner}(2002)}]{Matz02}\n{Matzner}, C.~D. 2002, \\apj, 566, 302\n\n\\bibitem[{{McCourt} {et~al.}(2012){McCourt}, {Sharma}, {Quataert}, \\&\n  {Parrish}}]{MSQP12}\n{McCourt}, M., {Sharma}, P., {Quataert}, E., \\& {Parrish}, I.~J. 2012, \\mnras,\n  419, 3319\n\n\\bibitem[{{Mihos} \\& {Hernquist}(1994)}]{MH94}\n{Mihos}, J.~C., \\& {Hernquist}, L. 1994, \\apj, 437, 611\n\n\\bibitem[{{Murray} {et~al.}(2011){Murray}, {M{\\'e}nard}, \\& {Thompson}}]{MMT11}\n{Murray}, N., {M{\\'e}nard}, B., \\& {Thompson}, T.~A. 2011, \\apj, 735, 66\n\n\\bibitem[{{Navarro} \\& {White}(1993)}]{NW93}\n{Navarro}, J.~F., \\& {White}, S.~D.~M. 1993, \\mnras, 265, 271\n\n\\bibitem[{{Pan} \\& {Padoan}(2009)}]{PP09}\n{Pan}, L., \\& {Padoan}, P. 2009, \\apj, 692, 594\n\n\\bibitem[{{Pettini} {et~al.}(2001){Pettini}, {Shapley}, {Steidel}, {Cuby},\n  {Dickinson}, {Moorwood}, {Adelberger}, \\& {Giavalisco}}]{Pettini+01}\n{Pettini}, M., {Shapley}, A.~E., {Steidel}, C.~C., {et~al.} 2001, \\apj, 554,\n  981\n\n\\bibitem[{{Pichon} {et~al.}(2003){Pichon}, {Scannapieco}, {Aracil},\n  {Petitjean}, {Aubert}, {Bergeron}, \\& {Colombi}}]{Pichon+03}\n{Pichon}, C., {Scannapieco}, E., {Aracil}, B., {et~al.} 2003, \\apjl, 597, L97\n\n\\bibitem[{{Romeo}(1992)}]{Romeo92}\n{Romeo}, A.~B. 1992, \\mnras, 256, 307\n\n\\bibitem[{{Romeo} {et~al.}(2010){Romeo}, {Burkert}, \\& {Agertz}}]{RBA10}\n{Romeo}, A.~B., {Burkert}, A., \\& {Agertz}, O. 2010, \\mnras, 407, 1223\n\n\\bibitem[{{Romeo} \\& {Falstad}(2013)}]{RF13}\n{Romeo}, A.~B., \\& {Falstad}, N. 2013, \\mnras, 433, 1389\n\n\\bibitem[{{Rubin} {et~al.}(2014){Rubin}, {Prochaska}, {Koo}, {Phillips},\n  {Martin}, \\& {Winstrom}}]{Rubin+14}\n{Rubin}, K.~H.~R., {Prochaska}, J.~X., {Koo}, D.~C., {et~al.} 2014, \\apj, 794,\n  156\n\n\\bibitem[{{Salem} \\& {Bryan}(2014)}]{SB14}\n{Salem}, M., \\& {Bryan}, G.~L. 2014, \\mnras, 437, 3312\n\n\\bibitem[{{Sales} {et~al.}(2014){Sales}, {Marinacci}, {Springel}, \\&\n  {Petkova}}]{Sales+14}\n{Sales}, L.~V., {Marinacci}, F., {Springel}, V., \\& {Petkova}, M. 2014, \\mnras,\n  439, 2990\n\n\\bibitem[{{Samui} {et~al.}(2010){Samui}, {Subramanian}, \\& {Srianand}}]{SSS10}\n{Samui}, S., {Subramanian}, K., \\& {Srianand}, R. 2010, \\mnras, 402, 2778\n\n\\bibitem[{{Sanders} \\& {Fabian}(2012)}]{SF12}\n{Sanders}, J.~S., \\& {Fabian}, A.~C. 2012, \\mnras, 421, 726\n\n\\bibitem[{{Scannapieco}(2013)}]{Scann13}\n{Scannapieco}, E. 2013, \\apjl, 763, L31\n\n\\bibitem[{{Scannapieco} \\& {Br{\\\"u}ggen}(2010)}]{SB10}\n{Scannapieco}, E., \\& {Br{\\\"u}ggen}, M. 2010, \\mnras, 405, 1634\n\n\\bibitem[{{Scannapieco} {et~al.}(2002){Scannapieco}, {Ferrara}, \\&\n  {Madau}}]{SFM02}\n{Scannapieco}, E., {Ferrara}, A., \\& {Madau}, P. 2002, \\apj, 574, 590\n\n\\bibitem[{{Scannapieco} {et~al.}(2012){Scannapieco}, {Gray}, \\& {Pan}}]{SGP12}\n{Scannapieco}, E., {Gray}, W.~J., \\& {Pan}, L. 2012, \\apj, 746, 57\n\n\\bibitem[{{Scannapieco} {et~al.}(2006){Scannapieco}, {Pichon}, {Aracil},\n  {Petitjean}, {Thacker}, {Pogosyan}, {Bergeron}, \\& {Couchman}}]{Scann+06}\n{Scannapieco}, E., {Pichon}, C., {Aracil}, B., {et~al.} 2006, \\mnras, 365, 615\n\n\\bibitem[{{Scannapieco} {et~al.}(2001){Scannapieco}, {Thacker}, \\&\n  {Davis}}]{STD01}\n{Scannapieco}, E., {Thacker}, R.~J., \\& {Davis}, M. 2001, \\apj, 557, 605\n\n\\bibitem[{{Schaye} {et~al.}(2003){Schaye}, {Aguirre}, {Kim}, {Theuns}, {Rauch},\n  \\& {Sargent}}]{Schaye+03}\n{Schaye}, J., {Aguirre}, A., {Kim}, T.-S., {et~al.} 2003, \\apj, 596, 768\n\n\\bibitem[{{Shapley}(2011)}]{Shapley11}\n{Shapley}, A.~E. 2011, \\araa, 49, 525\n\n\\bibitem[{{Sharma} {et~al.}(2012){Sharma}, {McCourt}, {Quataert}, \\&\n  {Parrish}}]{SMQP12}\n{Sharma}, P., {McCourt}, M., {Quataert}, E., \\& {Parrish}, I.~J. 2012, \\mnras,\n  420, 3174\n\n\\bibitem[{{Shetty} \\& {Ostriker}(2012)}]{SO12}\n{Shetty}, R., \\& {Ostriker}, E.~C. 2012, \\apj, 754, 2\n\n\\bibitem[{{Shukurov} {et~al.}(2006){Shukurov}, {Sokoloff}, {Subramanian}, \\&\n  {Brandenburg}}]{SSSB06}\n{Shukurov}, A., {Sokoloff}, D., {Subramanian}, K., \\& {Brandenburg}, A. 2006,\n  \\aap, 448, L33\n\n\\bibitem[{{Silk} \\& {Mamon}(2012)}]{SM12}\n{Silk}, J., \\& {Mamon}, G.~A. 2012, Research in Astronomy and Astrophysics, 12,\n  917\n\n\\bibitem[{{Simcoe} {et~al.}(2002){Simcoe}, {Sargent}, \\& {Rauch}}]{SSR02}\n{Simcoe}, R.~A., {Sargent}, W.~L.~W., \\& {Rauch}, M. 2002, \\apj, 578, 737\n\n\\bibitem[{{Socrates} {et~al.}(2008){Socrates}, {Davis}, \\&\n  {Ramirez-Ruiz}}]{Soc+08}\n{Socrates}, A., {Davis}, S.~W., \\& {Ramirez-Ruiz}, E. 2008, \\apj, 687, 202\n\n\\bibitem[{{Somerville} \\& {Primack}(1999)}]{SP99}\n{Somerville}, R.~S., \\& {Primack}, J.~R. 1999, \\mnras, 310, 1087\n\n\\bibitem[{{Songaila} \\& {Cowie}(1996)}]{SC96}\n{Songaila}, A., \\& {Cowie}, L.~L. 1996, \\aj, 112, 335\n\n\\bibitem[{{Steidel} {et~al.}(2010){Steidel}, {Erb}, {Shapley}, {Pettini},\n  {Reddy}, {Bogosavljevi{\\'c}}, {Rudie}, \\& {Rakic}}]{Steidel+10}\n{Steidel}, C.~C., {Erb}, D.~K., {Shapley}, A.~E., {et~al.} 2010, \\apj, 717, 289\n\n\\bibitem[{{Stinson} {et~al.}(2006){Stinson}, {Seth}, {Katz}, {Wadsley},\n  {Governato}, \\& {Quinn}}]{Stinson+06}\n{Stinson}, G., {Seth}, A., {Katz}, N., {et~al.} 2006, \\mnras, 373, 1074\n\n\\bibitem[{{Strickland} \\& {Heckman}(2007)}]{SH07}\n{Strickland}, D.~K., \\& {Heckman}, T.~M. 2007, \\apj, 658, 258\n\n\\bibitem[{{Strickland} \\& {Heckman}(2009)}]{SH09}\n---. 2009, \\apj, 697, 2030\n\n\\bibitem[{{Suchkov} {et~al.}(1994){Suchkov}, {Balsara}, {Heckman}, \\&\n  {Leitherer}}]{Suchkov+94}\n{Suchkov}, A.~A., {Balsara}, D.~S., {Heckman}, T.~M., \\& {Leitherer}, C. 1994,\n  \\apj, 430, 511\n\n\\bibitem[{{Sur} {et~al.}(2014{\\natexlab{a}}){Sur}, {Pan}, \\&\n  {Scannapieco}}]{SPS14}\n{Sur}, S., {Pan}, L., \\& {Scannapieco}, E. 2014{\\natexlab{a}}, \\apjl, 790, L9\n\n\\bibitem[{{Sur} {et~al.}(2014{\\natexlab{b}}){Sur}, {Pan}, \\&\n  {Scannapieco}}]{Sur+14}\n---. 2014{\\natexlab{b}}, \\apj, 784, 94\n\n\\bibitem[{{Sur} {et~al.}(2007){Sur}, {Shukurov}, \\& {Subramanian}}]{SSS07}\n{Sur}, S., {Shukurov}, A., \\& {Subramanian}, K. 2007, \\mnras, 377, 874\n\n\\bibitem[{{Sutherland} \\& {Dopita}(1993)}]{SD93}\n{Sutherland}, R.~S., \\& {Dopita}, M.~A. 1993, \\apjs, 88, 253\n\n\\bibitem[{{Swinbank} {et~al.}(2011){Swinbank}, {Papadopoulos}, {Cox}, {Krips},\n  {Ivison}, {Smail}, {Thomson}, {Neri}, {Richard}, \\& {Ebeling}}]{Swinbank+11}\n{Swinbank}, A.~M., {Papadopoulos}, P.~P., {Cox}, P., {et~al.} 2011, \\apj, 742,\n  11\n\n\\bibitem[{{Tenorio-Tagle} \\& {Munoz-Tunon}(1998)}]{TT98}\n{Tenorio-Tagle}, G., \\& {Munoz-Tunon}, C. 1998, \\mnras, 293, 299\n\n\\bibitem[{{Thacker} \\& {Couchman}(2000)}]{TC00}\n{Thacker}, R.~J., \\& {Couchman}, H.~M.~P. 2000, \\apj, 545, 728\n\n\\bibitem[{{Thomas} \\& {Couchman}(1992)}]{TC92}\n{Thomas}, P.~A., \\& {Couchman}, H.~M.~P. 1992, \\mnras, 257, 11\n\n\\bibitem[{{Thompson} {et~al.}(2005){Thompson}, {Quataert}, \\& {Murray}}]{TQM05}\n{Thompson}, T.~A., {Quataert}, E., \\& {Murray}, N. 2005, \\apj, 630, 167\n\n\\bibitem[{{Toomre}(1964)}]{T64}\n{Toomre}, A. 1964, \\apj, 139, 1217\n\n\\bibitem[{{Tremonti} {et~al.}(2007){Tremonti}, {Moustakas}, \\&\n  {Diamond-Stanic}}]{Tremonti+07}\n{Tremonti}, C.~A., {Moustakas}, J., \\& {Diamond-Stanic}, A.~M. 2007, \\apjl,\n  663, L77\n\n\\bibitem[{{Tremonti} {et~al.}(2004){Tremonti}, {Heckman}, {Kauffmann},\n  {Brinchmann}, {Charlot}, {White}, {Seibert}, {Peng}, {Schlegel}, {Uomoto},\n  {Fukugita}, \\& {Brinkmann}}]{Tremonti+04}\n{Tremonti}, C.~A., {Heckman}, T.~M., {Kauffmann}, G., {et~al.} 2004, \\apj, 613,\n  898\n\n\\bibitem[{{Trujillo} {et~al.}(2007){Trujillo}, {Conselice}, {Bundy}, {Cooper},\n  {Eisenhardt}, \\& {Ellis}}]{Trujillo+07}\n{Trujillo}, I., {Conselice}, C.~J., {Bundy}, K., {et~al.} 2007, \\mnras, 382,\n  109\n\n\\bibitem[{{Uhlig} {et~al.}(2012){Uhlig}, {Pfrommer}, {Sharma}, {Nath},\n  {En{\\ss}lin}, \\& {Springel}}]{U+12}\n{Uhlig}, M., {Pfrommer}, C., {Sharma}, M., {et~al.} 2012, \\mnras, 423, 2374\n\n\\bibitem[{{van Dokkum} {et~al.}(2010){van Dokkum}, {Whitaker}, {Brammer},\n  {Franx}, {Kriek}, {Labb{\\'e}}, {Marchesini}, {Quadri}, {Bezanson},\n  {Illingworth}, {Muzzin}, {Rudnick}, {Tal}, \\& {Wake}}]{vanDok+10}\n{van Dokkum}, P.~G., {Whitaker}, K.~E., {Brammer}, G., {et~al.} 2010, \\apj,\n  709, 1018\n\n\\bibitem[{{Wada} {et~al.}(2002){Wada}, {Meurer}, \\& {Norman}}]{WMN02}\n{Wada}, K., {Meurer}, G., \\& {Norman}, C.~A. 2002, \\apj, 577, 197\n\n\\bibitem[{{Wada} \\& {Norman}(2007)}]{WN07}\n{Wada}, K., \\& {Norman}, C.~A. 2007, \\apj, 660, 276\n\n\\bibitem[{{Walch} {et~al.}(2011){Walch}, {W{\\\"u}nsch}, {Burkert}, {Glover}, \\&\n  {Whitworth}}]{Walch+11}\n{Walch}, S., {W{\\\"u}nsch}, R., {Burkert}, A., {Glover}, S., \\& {Whitworth}, A.\n  2011, \\apj, 733, 47\n\n\\bibitem[{{Walch} {et~al.}(2012){Walch}, {Whitworth}, {Bisbas}, {W{\\\"u}nsch},\n  \\& {Hubber}}]{Walch+12}\n{Walch}, S.~K., {Whitworth}, A.~P., {Bisbas}, T., {W{\\\"u}nsch}, R., \\&\n  {Hubber}, D. 2012, \\mnras, 427, 625\n\n\\bibitem[{{Walch} {et~al.}(2014){Walch}, {Girichidis}, {Naab}, {Gatto},\n  {Glover}, {W{\\\"u}nsch}, {Klessen}, {Clark}, {Peters}, \\&\n  {Baczynski}}]{Walch+14}\n{Walch}, S.~K., {Girichidis}, P., {Naab}, T., {et~al.} 2015, \\mnras, 454, 238\n\n\\bibitem[{{Weiner} {et~al.}(2009){Weiner}, {Coil}, {Prochaska}, {Newman},\n  {Cooper}, {Bundy}, {Conselice}, {Dutton}, {Faber}, {Koo}, {Lotz}, {Rieke}, \\&\n  {Rubin}}]{Weiner+09}\n{Weiner}, B.~J., {Coil}, A.~L., {Prochaska}, J.~X., {et~al.} 2009, \\apj, 692,\n  187\n\n\\bibitem[{{Westmoquette} {et~al.}(2009){Westmoquette}, {Smith}, {Gallagher},\n  {Trancho}, {Bastian}, \\& {Konstantopoulos}}]{West+09}\n{Westmoquette}, M.~S., {Smith}, L.~J., {Gallagher}, III, J.~S., {et~al.} 2009,\n  \\apj, 696, 192\n\n\\bibitem[{{Wiersma} {et~al.}(2009){Wiersma}, {Schaye}, \\& {Smith}}]{WSS09}\n{Wiersma}, R.~P.~C., {Schaye}, J., \\& {Smith}, B.~D. 2009, \\mnras, 393, 99\n\n\\bibitem[{{Wolfire} {et~al.}(1995){Wolfire}, {Hollenbach}, {McKee}, {Tielens},\n  \\& {Bakes}}]{Wolf+95}\n{Wolfire}, M.~G., {Hollenbach}, D., {McKee}, C.~F., {Tielens}, A.~G.~G.~M., \\&\n  {Bakes}, E.~L.~O. 1995, \\apj, 443, 152\n\n\\bibitem[{{Wolfire} {et~al.}(2003){Wolfire}, {McKee}, {Hollenbach}, \\&\n  {Tielens}}]{Wolf+03}\n{Wolfire}, M.~G., {McKee}, C.~F., {Hollenbach}, D., \\& {Tielens}, A.~G.~G.~M.\n  2003, \\apj, 587, 278\n\n\\bibitem[{{Zirakashvili} {et~al.}(1996){Zirakashvili}, {Breitschwerdt},\n  {Ptuskin}, \\& {Voelk}}]{Zirak+96}\n{Zirakashvili}, V.~N., {Breitschwerdt}, D., {Ptuskin}, V.~S., \\& {Voelk}, H.~J.\n  1996, \\aap, 311, 113\n\n\\end{thebibliography}\n\n\n\n\\begin{appendix}\n\n\\section{Resolution Dependence}\\label{Res}\n\n\n\\begin{table*}[h]\n\\begin{minipage}{170mm}\n\\begin{center}\n\\resizebox{0.6\\textwidth}{!}{\n\\begin{tabular}{|c|c|c|c|c|c|} \\hline \\hline \nSimulation & $dz$ & $H$ & $\\bar{\\sigma}_{\\rm H}^{\\rm 1D}$ & $\\bar{\\sigma}_{\\rm z}$ & $\\dot{\\Sigma_{\\rm g}}$ \\\\\nResolution & [pc] & [pc] & $[\\rm km\\,s^{-1}]$ & $[\\rm {km\\,s^{-1}}]$ & $[{\\rm M}_\\odot\\,{\\rm yr}^{-1}\\,{\\rm kpc}^{-2}] $ \\\\ \\hline \\hline\n$512^{2} \\times 1024$ & 4.16 & 10 & $54$ & $5.5$ & $0.062$ \\\\ \\hline\n$256^{2} \\times 512$   & 8.32 & 11 & $50$ & $5.5$ & $0.06$ \\\\ \\hline \n$128^{2} \\times 256$   & 16.6 & 14  & $51$ & $5.0$ & $0.057$ \\\\ \\hline \n$64^{2} \\times 128$     & 33.3 & $15.5$ & $47$ & $7.1$ & $0.054$ \\\\ \\hline \\hline \n\\end{tabular}\n}\n\\end{center}\n\\caption{Study of resolution dependence for run S250K10. }\n\\label{resdep}\n\\end{minipage}\n\\end{table*}\n\n\n\nTo explore the impact of resolution effects, we performed a resolution study for our fiducial high surface density \ncase: S250K10, with $\\Sigma_{\\rm g}$ = 250 ${\\rm M}_\\odot$ pc$^{-2}$ and $\\kappa^{-1}$ = 10 Myr.  This  \ninvolved a single high-resolution $512^{2}\\times 1024$ run, with $dz$ half that of our standard, $256^{2}\\times 512$ \nrun, and two low-resolution runs with $128^{2} \\times 256$ and  $64^{2}\\times 128$ cells, and $dz$ twice and four \ntimes as large as in our standard runs, respectively. In Table~\\ref{resdep}, we show a comparison of the computed \nscale-height, one-dimensional horizontal and vertical velocity dispersions, and gas mass loss rate obtained in these \nfour simulations. We also show the time evolution of $\\Sigma_{\\rm g}$ for each of the runs in Figure~\\ref{mloss_resdep}. \n\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=0.8\\columnwidth]{fig11.pdf} \n\\caption{(color online). Time evolution of the gas surface density at four different resolutions for initial \n$\\Sigma_{\\rm g} = 250\\,{\\rm M_\\odot\\,pc^{-2}}$, and $\\kappa^{-1} = 10\\,{\\rm Myr}$. \nNote that the gas mass loss rate nears convergence from a resolution of $256^{2}\\times 512,$ with $dz=8.32$ \npc as compared to a vertical scale-height of 11 pc. It is also clear that the run with a temperature floor of \n$300$ K has the same gas mass loss rate as our fiducial S250K10 run. \n}\n\\label{mloss_resdep}\n\\end{figure}\n\n\nIn all four runs, our turbulent driving results in a similar 1D horizontal vertical dispersion $\\approx 50$ km/s.\nTable  \\ref{resdep} also shows that the scale-heights, vertical velocity dispersion, and\ngas mass loss rate are very similar between the standard, $256^{2}\\times 512$  run and the high-resolution, \n$512^{2}\\times 1024$ run in which the scale-heights were resolved by $\\approx 10$ and $20$ cells, respectively.  \nFor the high-resolution run, the gas mass loss rate is computed from $84$ Myr to the end of the simulation. \nHowever, as evident from Figure \\ref{mloss_resdep}, the above two runs differ in their evolution in the initial \ntransient phase. While the $256^{2}\\times 512$ loses about $8.7\\%$ of its initial mass during this phase, the \n$512^{2}\\times 1024$ run loses much less mass during its initial rearrangements. Therefore, barring the estimates \nduring the transient phase, the gas mass loss rate is similar in both the runs. This gives us confidence that \nthe results reported in the paper are not strongly influenced by resolution effects, and that even larger and \nmore expensive simulations are not required to reach reliable conclusions. \nMoreover, by comparing the \ngreen dash-dotted line with the black line, it appears that lowering the temperature floor to $300$ K does not \nresult in any change in the mass outflow rate. Thus, our conclusions regarding the mass outflow rates are \nnot likely to be affected by modeling the low temperature ISM.\n\nMoving to the lower resolution $128^{2} \\times 256$ run, we find that the estimates of the horizontal velocity dispersion, \nvertical  velocity dispersion, and gas mass loss rate is very close to those of the two higher resolution runs. However, \nthe estimate of the scale height falls below the resolution limit and the gas mass loss rate in the transient phase\nis more than the higher resolution runs. For the lowest resolution $64^{2} \\times 128$ run, as Figure~\\ref{mloss_resdep} \nshows, the gas mass loss rate undergoes an extremely sharp decline for about $100$ Myr followed by a steep \ndecline from about $120-160$ Myr. During this phase, the temperature also drops sharply from \n$1.13\\times 10^{6}\\,{\\rm K}$ to $7.8\\times 10^{5}\\,{\\rm K}$, after which the system reaches a steady state. \nThe mass loss rate shown in the table is computed from $350$ Myr onwards.  \nIn this case, the computed value of the scale height is well below the resolution limit. \n\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=1.02\\columnwidth]{fig12.pdf} \n\\caption{(color online). Volume-weighted phase diagrams of the temperature and the number \ndensity of all the gas at four different resolutions for the S250K10 run. The vertical and the \nhorizontal lines have the same meaning as in Figure~\\ref{phaseplots}. At both $256^{2}\\times 512$\nand $512^{2}\\times 1024$ resolutions, the phase plots show an accumulation of low density gas \nat $1000$ K as compared to the $128^{2}\\times 256$ run. \n}\n\\label{phase_resdep}\n\\end{figure}\n\n\nIn Figure~\\ref{phase_resdep}, we show the volume-weighted $T-n$ phase plots over the whole simulation domain \nat different resolutions.  The phase  plots are shown at $101$ Myr,\nexcept for the lowest resolution run, which takes much longer to reach a steady-state, and whose phase plot\n is shown at $401$ Myr. From these diagrams it appears that the phase plots are similar for the \n $256^{2}\\times 512$ and the $512^{2}\\times 1024$ resolutions. However compared to the $128^{2}\\times 256$ \nrun, both of these runs show an accumulation of low density gas at $1000$ K. The $128^{2}\\times 256$ \nresolution run also shows some gas at $T = 2.5\\times 10^{5}\\,{\\rm K}$ being dragged along with the hot outflowing gas. \nOn the other hand, the phase plot at $64^{2}\\times 128$ is very different from the other three, the most significant \nbeing the accumulation of high density gas at the temperature floor.\n\n\nThus, while the results presented here are not likely to suffer from resolution effects, they appear to be close to the lowest \nresolution allowable to achieve reliable results, even in the absence of additional physical processes such as stellar feedback, \nmolecular chemistry, cosmic ray heating, and magnetohydrodynamic effects. This means that  cosmological simulations that \nare unable to achieve $\\approx 10$ pc resolutions  will not be able to properly handle the evolution of the ISM in high-surface \ndensity galaxies similar to the S250K10 case, and may instead either over or under-represent gas mass loss depending on the \nparticulars of the numerical method being used.  Furthermore, even higher resolutions are likely to be required to model \noutflows from higher surface density disks with smaller vertical scale heights, even in the case without supernovae.\n\n\\end{appendix}\n\n\n\n", "itemtype": "equation", "pos": 59805, "prevtext": "\nwhere in the last equality we have substituted $\\Sigma_{\\rm g} = \\kappa^{2}\\,R/2\\pi\\,G,$ where $R$ is the size of the \neddy at the forcing scale $L_{\\rm f}$. Since the scale-height $H \\ll L_{\\rm f}$ in our simulations (see figure~9f), the \nfree-fall timescale is in general smaller than the eddy-turnover time. This is also evident by comparing panels 10 (a) \nand (b) in the above figure. \nEquation~(\\ref{tffoverted}) can also be expressed as the ratio of the vertical to horizontal \nvelocity dispersion by noting that $\\sigma_{\\rm z} \\approx \n(2\\pi\\,G\\,\\Sigma_{\\rm g}\\,H)^{1/2}$ and \n$R = \\sigma_{\\rm H}/\\kappa$ such that\n\n", "index": 29, "text": "\\begin{equation}\n\\frac{t_{\\rm ff}}{t_{\\rm ed}} = \\frac{0.8\\,\\sigma_{\\rm z}}{(2\\pi\\,G\\,\\Sigma_{\\rm g})^{1/2}}\\left(\\frac{\\kappa}{\\sigma_{\\rm H}}\\right)^{1/2}\n= \\frac{0.8}{Q^{1/2}}\\left(\\frac{\\sigma_{\\rm z}}{\\sigma_{\\rm H}}\\right), \n\\label{teff_vel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\frac{t_{\\rm ff}}{t_{\\rm ed}}=\\frac{0.8\\,\\sigma_{\\rm z}}{(2\\pi\\,G\\,\\Sigma_{\\rm&#10;g%&#10;})^{1/2}}\\left(\\frac{\\kappa}{\\sigma_{\\rm H}}\\right)^{1/2}=\\frac{0.8}{Q^{1/2}}%&#10;\\left(\\frac{\\sigma_{\\rm z}}{\\sigma_{\\rm H}}\\right),\" display=\"block\"><mrow><mrow><mfrac><msub><mi>t</mi><mi>ff</mi></msub><msub><mi>t</mi><mi>ed</mi></msub></mfrac><mo>=</mo><mrow><mfrac><mrow><mpadded width=\"+1.7pt\"><mn>0.8</mn></mpadded><mo>⁢</mo><msub><mi>σ</mi><mi mathvariant=\"normal\">z</mi></msub></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>G</mi></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>κ</mi><msub><mi>σ</mi><mi mathvariant=\"normal\">H</mi></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>=</mo><mrow><mfrac><mn>0.8</mn><msup><mi>Q</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mfrac><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi>σ</mi><mi mathvariant=\"normal\">z</mi></msub><msub><mi>σ</mi><mi mathvariant=\"normal\">H</mi></msub></mfrac><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]