[{"file": "1601.03735.tex", "nexttext": "\nwhere $r$ is the distance between the element $ds$ of $S(t)$ and the observer. \n\nThe intensity is related to the comoving one (primed quantities throughout the paper will always refer to the comoving frame) through $I = \\delta^4 I'$ (or $I_\\nu(\\nu) = \\delta^3 I_\\nu'(\\nu/\\delta)$ for the specific intensity) where $\\delta = \\Gamma^{-1} (1-\\beta\\cos\\theta)^{-1}$ is the relativistic Doppler factor \\citep{Rybicki1979,ghisellini_book_2013}. The constant luminosity assumption implies $I'\\propto R^{-2}$: this is consistent if the number of emitting particles is constant despite the increase of the surface area with the expansion (it would not be appropriate {e.\\,g.\\xspace} for external shocks, where the number of emitting particles instead increases with increasing surface area).\n\nThe spectrum emitted by any shell fluid element is assumed to be the same for a locally comoving observer.\n\n\\subsection{Equal arrival time surfaces}\n\n\\subsubsection{A sphere}\\label{sec:eats-sphere}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig1.pdf} \n \\end{center}\n \\caption{\\label{fig:geom1} A sphere starts emitting radiation at $t=t_0$ and stops at $t=t_0+T$. The line of sight of a distant observer is parallel to the z axis. \\textbf{Left:} a time $t < T$ after the arrival of the first photon, the observer has received radiation from the portion of the sphere with $z>R-c t=R\\cos\\theta_{\\rm on}$; \\textbf{Right:} later when $t > T$, the observer has stopped receiving radiation from the portion of the sphere with $z>R-c(t-T)=R\\cos\\theta_{\\rm off}$. Thus the effective emitting surface is the portion of the sphere with $R\\cos\\theta_{\\rm on} < z < R\\cos\\theta_{\\rm off}$. }\n\\end{figure}\n\n\nConsider a sphere of radius $R$. The surface of the sphere starts emitting electromagnetic radiation at $t=t_0$ and stops suddenly at $t=t_0+T$ (as measured in the inertial frame at rest with respect to the centre of the sphere). Emitted photons reach a distant observer at different arrival times. Let the line of sight be parallel to the $z$ axis (as in Fig.~\\ref{fig:geom1}). The first photon to reach the observer is the one emitted at $t=t_0$ from the tip of the sphere at $z = R$. Let $t = 0$ be its arrival time as measured by the observer. A photon emitted at the same time $t=t_0$ by a point of the surface at $z = R\\cos\\theta_{\\rm on}$ reaches the observer at a later time $t = R(1-\\cos\\theta_{\\rm on})/c$. Thus, despite the surface turned on all at the same time $t=t_0$, at a given time $t$ the observer has received radiation only from the portion with $z/R > \\cos\\theta_{\\rm on} = 1-c t/R$ (left panel of Fig.~\\ref{fig:geom1}). This can be visualized as each point on the sphere being turned on by the passage of a plane traveling in the $-z$ direction with speed $c$, starting from $z = R$ at $t=0$. The same reasoning applies to the turning-off of the sphere: each point is turned off by the passage of a plane traveling in the $-z$ direction with speed $c$, starting from $z=R$ at $t=T$. As a result, if $T<R/c$, at some time $t$ the observer will ``see'' only the portion of sphere comprised between $\\cos\\theta_{\\rm on} = 1-c t/R$ and $\\cos\\theta_{\\rm off}=1-c (t-T)/R$ (right part of Fig.~\\ref{fig:geom1}). Thus, the EATS at time $t$ is this portion of the sphere.\n\n\n\\subsubsection{An expanding sphere}\\label{sec:eats-exp-sphere}\n\n\\begin{figure}\n \\includegraphics{fig2.pdf}\n \\caption{\\label{fig:geometry-eats} The shaded regions represent the equal arrival time surface (EATS) of the expanding sphere at $t>t_{\\rm off}$. The line of sight is parallel to the $z$-axis. The sphere started emitting when its radius was $R$, and stopped when it was $R+\\Delta R$. }\n\\end{figure}\n\n\nIf the sphere is expanding, the above argument is still valid, with some modification. The radius now is $R(t) = R + \\beta c (t-t_0)$ so that the lighting up takes place at $R(0)=R$ and the turning-off at $R(T)=R+\\beta c T\\equiv R + \\Delta R$. Since the lighting up happens all at the same radius, the angle $\\theta_{\\rm on}$ up to which the observer sees the surface on is still given by $\\cos\\theta_{\\rm on} = 1 - c t/R$ (the photons emitted at $t=t_0$ all come from the sphere with radius $R$). Since the sphere is expanding, its surface ``runs after'' the emitted photons, causing the arrival time difference between the first and the last photon to contract. In particular, for the first and last photon emitted from $z=R(t)$, the arrival time difference is ${t_{\\mathrm{off}}} = T(1-\\beta)=T/(1+\\beta)\\Gamma^2$ where $\\Gamma=(1-\\beta^2)^{-1/2}$ is the Lorentz factor of the expansion. For this reason, the angle up to which the observer sees the surface turned off is given by $\\cos\\theta_{\\rm off} = 1 - c(t-{t_{\\mathrm{off}}})/(R + \\Delta R)$.\n\nThe resulting geometry is not spherical (see Fig.~\\ref{fig:geometry-eats}), but the assumption of constant luminosity simplifies the mathematical treatment (see \\S\\ref{sec:exp-sphere}) in that it allows one to perform all integrations over angular coordinates only.\n\n\\subsection{On-axis jet}\\label{sec:onaxis-jet}\n\n\\begin{figure}\n \\includegraphics[width=\\columnwidth]{fig3.pdf}\n \\caption{\\label{fig:sphere-pulse} Bolometric light curves of three pulses from an expanding sphere. The flux is normalized to $F_{\\rm max}$ and the observer time is in units of $\\tau$ (see the text for the definition of these quantities). The ratio of $\\Delta R$ to $R$ is given near each curve. The black dashed line represents the saturation flux, which is reached if $T\\gg R/c$, or equivalently if $\\Delta R \\gg R$.}\n\\end{figure}\n\n\\begin{figure}\n \\includegraphics[width=\\columnwidth]{fig4.pdf}\n \\caption{\\label{fig:pulse-thj} Bolometric light curves of three pulses from an on-axis jet with ${\\theta_\\mathrm{jet}} = 1/\\Gamma$. The ratio of $\\Delta R$ to $R$  is reported near each curve. The black dashed line represents the time $t_{\\rm jet}$ at which the jet border first comes into sight. In this case $t_{\\rm jet}$ equals $\\tau$.}\n\\end{figure}\n\nA radially expanding (homogeneous) jet seen on-axis is indistinguishable from an expanding sphere as long as its half opening angle ${\\theta_\\mathrm{jet}}$ is much larger than $1/\\Gamma$ \\citep[{e.\\,g.\\xspace}][]{rhoads-balloon97}. As a corollary, the same holds if the viewing angle ${\\theta_\\mathrm{v}}$ is small enough so that the angular distance ${\\theta_\\mathrm{jet}}-{\\theta_\\mathrm{v}}$ of the line of sight from the jet border is still much larger than $1/\\Gamma$. Since the typical expected Lorentz factor of GRB jets is $\\Gamma\\sim 100$, this means that a viewing angle a few $0.01$ radians smaller than ${\\theta_\\mathrm{jet}}$ allows one to consider the jet practically on-axis. On the other hand, if the jet is very narrow, or if the Lorentz factor is low enough ({i.\\,e.\\xspace} if ${\\theta_\\mathrm{jet}}$ is comparable with $1/\\Gamma$), then the finite half opening angle must come into play. Figure~\\ref{fig:sphere-pulse} shows light curves (Eqs. \\ref{eq:spherepulse1} \\& \\ref{eq:spherepulse2}) of pulses from an expanding sphere, or equivalently from a jet with ${\\theta_\\mathrm{jet}}\\gg 1/\\Gamma$; Figure~\\ref{fig:pulse-thj} instead shows light curves (Eqs.~\\ref{eq:pulse-thj-1}~\\&~\\ref{eq:pulse-thj-2}) of pulses from an on-axis jet with ${\\theta_\\mathrm{jet}}=1/\\Gamma$. \n\nSuch light curves can be computed analytically within the assumptions stated in \\S\\ref{sec:assumptions} (see \\S\\ref{sec:exp-sphere} and \\S\\ref{sec:onaxis-jet-appendix}). Some natural scales emerge during the derivation: \n\\begin{enumerate}\n \\item the angular time scale \n \n", "itemtype": "equation", "pos": 12625, "prevtext": "\n \n \\date{Draft version, \\today}\n \n \\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2015}\n \n \\maketitle\n \n \\label{firstpage}\n \n\\begin{abstract}\nWe set up a simple model to compute the bolometric light curve and time dependent spectrum of a single pulse of a {Gamma-Ray Burst\\xspace} under the assumption that the pulse rise and decay are dominated by the shell curvature effect. For the first time, our model includes the effect of an arbitrary off-axis viewing angle. We show that a pulse observed off-axis is (i) longer, (ii) softer and (iii) displays a different hardness-intensity correlation with respect to the same pulse seen on-axis. For each of these effects, we provide an intuitive physical explanation. We then show how a synthetic light curve made by a superposition of pulses changes with increasing viewing angle. We find that many observed properties found in time-resolved spectral analysis of {Gamma-Ray Burst\\xspace} light curves are reproduced in curves with a slightly off-axis viewing angle. Such properties include the fact that the spectral peak energy evolution tracks the variations in flux, leading them slightly. Based on these results, we argue that low luminosity {Gamma-Ray Bursts\\xspace} are consistent with being ordinary bursts seen off-axis.\n\\end{abstract}\n\n \\begin{keywords}\n    relativistic processes - gamma-ray burst: general - gamma-ray burst:individual (GRB980425, GRB031203, GRB060218, GRB100316D) - methods: analytical\n\\end{keywords}\n\n\\section{Introduction}\n\nDespite more than 40 years of observation and modelling, many features of {Gamma-Ray Bursts\\xspace} (GRBs hereafter) still lack firm and unanimous explanations. \nThe diversity and complexity of GRB prompt emission light curves is often used to illustrate the difficulty in the classification of these sources and in the unification of their properties. A natural approach to get insight into such complexity is to look for global and average properties, like flux time integral ({i.\\,e.\\xspace} \\textit{fluence}), total duration, average spectrum, peak flux. Alternatively, one can try to break down the light curve into simpler parts following some pattern. If a fundamental building block was identified, the analysis of single blocks could be the key to the unification and disentanglement of properties of the underlying processes. Many authors \\citep[{e.\\,g.\\xspace}][]{Imhof1974,Norris1986,Link1993,Ford1995,Kargatis1995,Liang1996,Preece1998,Ramirez-Ruiz1999,Lee2000,Ghirlanda2002,Lu2012,Basak2014} performed careful analyses of light curves and time resolved spectra looking for patterns and for hints about such fundamental building blocks. \\citet{Norris1986} was presumably the first to systematically decompose the light curves into pulses and to look for patterns in the properties of these putative building blocks. Interest in such an approach grew in the following years, with a jump after \\citet{Liang1996} established the existence of a clear correlation between spectral peak energy and flux during the decay of a pulse (usually referred to as the \\textit{hardness-intensity correlation} \\citep{Ryde1998}). \\citet{Ryde2002} first set up a physical model of the decay phase of the pulse based on the idea that the emission comes from a relativistically expanding, spherical shell, which gives a simple explanation of the hardness-intensity correlation. The bottom line of such model is that the pulse decay is due to the arrival delay of photons emitted by high latitude parts of the shell, which are at a greater distance from the observer at the time of emission with respect to lower latitudes, due to the curvature of the emitting surface. Such effect is often referred to as the \\textit{(relativistic) curvature effect}. In the following years, other authors \\citep[{e.\\,g.\\xspace}][]{Dermer2004,Genet2009} proposed increasingly refined physical models of the pulse that include this effect. One overlooked aspect in all models so far, though, is the possibility that the pulse comes from a jet which is observed off-axis. In this work, we set up a simple version of the pulse model based on the curvature effect only, including for the first time the possibility of an off-axis viewing angle. \n\nThe viewing angle, {i.\\,e.\\xspace} the angle between the jet axis and the line of sight, is usually assumed to be smaller than the jet semi-aperture, in which case the jet is said to be \\textit{on-axis}. For larger viewing angles, {i.\\,e.\\xspace} for off-axis jets, the flux is severely suppressed because of relativistic beaming. Nevertheless, it can be still above detection threshold if the viewing angle is not much larger than the jet semi-aperture, especially if the burst is at low redshift. In \\citet{2015MNRAS.447.1911P} we have shown that detectable off-axis jets might in fact dominate the low luminosity end of the observed population. \n\nThe idea that nearby low luminosity GRBs could be off-axis events has been a subject of debate since the observation of GRB980425. \\citet{Soderberg2004} rejected such possibility, based on radio observations of GRB980425 and GRB031203, but soon later \\citet{Ramirez-Ruiz2005} presented an off-axis model for the afterglow of GRB031203 which seems to fit better the observations (including radio) with respect to the usual on-axis modelling. Using the same off-axis afterglow model, \\citet{Granot2005a} extended the argument to two X-Ray Flashes, thus including them in the category of off-axis GRBs. \\citet{2006MNRAS.372.1699G} argued that the off-axis interpretation of GRB031203 and GRB980425 is not practicable, because their true energy would then be on the very high end of the distribution, implying a very low likelihood when combined with the low redshift of these two events. More recently, the idea that such events are members of a separate class \\citep[{e.\\,g.\\xspace}][]{Liang2007,Zhang2008,He2009,2011ApJ...739L..55B,Nakar2015} has gained popularity. Our results about the GRB luminosity function \\citep{2015MNRAS.447.1911P}, though, still point towards the unification of these events together with ordinary GRBs based on the off-axis viewing angle argument. With the present work we address the issue from another point of view, by focusing on the apparently single pulsed, smooth behaviour of prompt emission light curves of these bursts, trying to figure out if such behaviour is expected in the case of an off-axis viewing angle.\n\nThe structure of the paper is as follows: in section \\S\\ref{sec:pulses-building-blocks} we briefly review some of the main arguments supporting the idea that the main driver of the pulse rise and decay is the curvature effect; in \\S\\ref{sec:pulse-light-curves} we discuss the main assumptions of our simple model and we present the predictions for a single pulse from an on-axis (\\S\\ref{sec:onaxis-jet}) and an off-axis jet (\\S\\ref{sec:offaxis-jet}), deferring detailed derivations to the appendix. In \\S\\ref{sec:multipulse} we build a superposition of pulses (to represent a synthetic prompt emission light curve) and show how its properties change with increasing off-axis viewing angle, comparing them with those found in light curve time resolved spectral analysis. Based on the obtained results, we conclude (\\S\\ref{sec:low-lum-grbs}) that light curves of low luminosity GRBs are consistent with the off-axis hypothesis. We then summarize and draw our conclusions in \\S\\ref{sec:conclusions}.\n\n\n\\section{Pulses: building blocks of GRB light curves}\\label{sec:pulses-building-blocks}\n\n\\subsection{Pulses in the internal shock scenario}\n\n\nThe pulse width in GRB light curves is roughly constant throughout the burst duration \\citep{Ramirez-Ruiz1999}. The internal shock scenario \\citep{Rees1994} provides a natural framework for the understanding of this kind of behaviour. In this scenario, discontinuous activity in the central engine  produces a sequence of shells with random Lorentz factors. When faster shells catch up with slower ones, shocks develop and particles are heated. If the plasma is optically thin and some magnetic field is present, the energy gained by the electrons is promptly and efficiently radiated away by synchrotron (and inverse Compton) emission. Each pulse is thus the result of the merger of two shells beyond the photospheric radius $R_{ph}$. The strength of the shock, and thus the efficiency of the electron heating, depend strongly on the relative Lorentz factor of the merging shells (a radiative efficiency of a few percent is achieved only for $\\Gamma_{\\rm rel}\\gtrsim 3$, \\citet{Lazzati1999}). Shell pairs with small relative Lorentz factors merge later (they need more time to catch up with each other), thus the highest efficiency is achieved for shells merging just after the photospheric radius. This explains, within this framework, why the typical pulse width is not seen to grow with time: the bulk of the emission happens at a fixed radius, regardless of the expansion of the jet head.\n\n\\subsection{Angular time scale: a lower bound}\n\\label{sec:timescales}\nThree main time scales arise in the internal shock scenario:\n\\begin{itemize}\n \\item the shell crossing time $\\tau_{sc}$, {i.\\,e.\\xspace} the time needed for the two shells to merge;\n \\item the electron cooling time $\\tau_{cool}$, {i.\\,e.\\xspace} the time needed by the electrons to radiate away most of the energy gained from the shock;\n \\item the angular time scale $\\tau_{ang}$, explained below.\n\\end{itemize}\n\nThe shell crossing time is $\\tau_{sc}\\sim w/\\Gamma c$, where $w$ is the typical shell width. Being linked to the central engine activity, usually $w$ is assumed to be of the order of a few Schwarzschild radii. The Schwarzschild radius of a $5\\,M_{\\odot}$ black hole is $R_{s}\\approx 1.5\\times 10^{6}$~cm, thus $\\tau_{sc}\\sim 3\\times 10^{-7}$~s~$w_6/\\Gamma_2$, where we adopted the notation $Q_x = (Q/10^x)$ in cgs units. \nThe electron cooling time scale, assuming synchrotron and/or Compton emission, is $\\tau_{\\rm cool} \\sim 10^{-7}$~s for typical parameters\\footnote{by typical parameters we mean $\\Gamma = 100$, $\\Gamma_{\\rm rel} = 3$, $U_{\\rm rad}=U_B$, a typical synchrotron frequency of $1$ MeV and we assume equipartition. See \\citet{Ghisellini2000} and references therein for a complete treatment.} \\citep{Ghisellini2000}. Both these time scales are far shorter than the angular time scale, which arises when one takes into account the arrival time difference of photons emitted at the same time by parts of the shell at different latitudes. Given that the typical photospheric radius $R_{ph}\\gtrsim 10^{13}$~cm, this difference can be large: indeed $\\tau_{ang} \\sim R/\\Gamma^2 c \\approx 3 \\times 10^{-2}$~s~$R_{13}/\\Gamma_2^{2}$ and thus dominates over the other two.\n\nThis suggests that the rise and decay of the flux due to a single shell merger, {i.\\,e.\\xspace} the pulse, can not happen on a time scale smaller than $\\tau_{ang}$, and can thus be dominated by the effect of shell curvature. \n\n\\subsection{Independence from the internal shock scenario}\n\nBeing based solely on geometry and relativity, the above argument does not rely specifically on the (somewhat old fashioned) internal shock scenario. Any alternative model in which photons are produced at a large enough radius, being the photospheric radius \\citep[{e.\\,g.\\xspace} subphotospheric dissipation models like those described in][]{2005ApJ...628..847R,Giannios2006,Beloborodov2010} or beyond \\citep[{e.\\,g.\\xspace} magnetic reconnection models,][]{Lazarian2003,Zhang2011} eventually must take into account the arrival time delay of photons emitted by high latitude parts of the jet, and thus the angular time scale remains a lower bound on the light curve variability time scale.\n\n\\section{Pulse light curves and time dependent spectra}\\label{sec:pulse-light-curves}\n\n\\subsection{Main assumptions}\\label{sec:assumptions}\nBased on the arguments outlined in \\S\\ref{sec:timescales}, we assume that the variation of the flux seen by the observer during a single pulse is due only to the angular time delay described above. The luminosity $L$ of the shell is assumed constant during an emission time $T$ and zero before and after this time interval. The emitting region is assumed geometrically and optically thin. The radius of the shell is $R$ at the beginning of the emission and $R+\\Delta R$ at the end of it. The bolometric flux $F(t)$ (specific flux $F_\\nu(t)$) is computed by integration of the intensity $I$ (specific intensity $I_\\nu$) over the appropriate equal arrival time surface $S(t)$ (see the Appendix for a detailed derivation of all light curves and spectra used in this work), namely\n\n", "index": 1, "text": "\\begin{equation}\n F(t) = \\int_{S(t)}I(s)\\,ds/r^2\n \\label{eq:flux-moving-source-text}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"F(t)=\\int_{S(t)}I(s)\\,ds/r^{2}\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>s</mi></mrow></mrow><mo>/</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n \\item the pulse peak time\n \n", "itemtype": "equation", "pos": 20276, "prevtext": "\nwhere $r$ is the distance between the element $ds$ of $S(t)$ and the observer. \n\nThe intensity is related to the comoving one (primed quantities throughout the paper will always refer to the comoving frame) through $I = \\delta^4 I'$ (or $I_\\nu(\\nu) = \\delta^3 I_\\nu'(\\nu/\\delta)$ for the specific intensity) where $\\delta = \\Gamma^{-1} (1-\\beta\\cos\\theta)^{-1}$ is the relativistic Doppler factor \\citep{Rybicki1979,ghisellini_book_2013}. The constant luminosity assumption implies $I'\\propto R^{-2}$: this is consistent if the number of emitting particles is constant despite the increase of the surface area with the expansion (it would not be appropriate {e.\\,g.\\xspace} for external shocks, where the number of emitting particles instead increases with increasing surface area).\n\nThe spectrum emitted by any shell fluid element is assumed to be the same for a locally comoving observer.\n\n\\subsection{Equal arrival time surfaces}\n\n\\subsubsection{A sphere}\\label{sec:eats-sphere}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig1.pdf} \n \\end{center}\n \\caption{\\label{fig:geom1} A sphere starts emitting radiation at $t=t_0$ and stops at $t=t_0+T$. The line of sight of a distant observer is parallel to the z axis. \\textbf{Left:} a time $t < T$ after the arrival of the first photon, the observer has received radiation from the portion of the sphere with $z>R-c t=R\\cos\\theta_{\\rm on}$; \\textbf{Right:} later when $t > T$, the observer has stopped receiving radiation from the portion of the sphere with $z>R-c(t-T)=R\\cos\\theta_{\\rm off}$. Thus the effective emitting surface is the portion of the sphere with $R\\cos\\theta_{\\rm on} < z < R\\cos\\theta_{\\rm off}$. }\n\\end{figure}\n\n\nConsider a sphere of radius $R$. The surface of the sphere starts emitting electromagnetic radiation at $t=t_0$ and stops suddenly at $t=t_0+T$ (as measured in the inertial frame at rest with respect to the centre of the sphere). Emitted photons reach a distant observer at different arrival times. Let the line of sight be parallel to the $z$ axis (as in Fig.~\\ref{fig:geom1}). The first photon to reach the observer is the one emitted at $t=t_0$ from the tip of the sphere at $z = R$. Let $t = 0$ be its arrival time as measured by the observer. A photon emitted at the same time $t=t_0$ by a point of the surface at $z = R\\cos\\theta_{\\rm on}$ reaches the observer at a later time $t = R(1-\\cos\\theta_{\\rm on})/c$. Thus, despite the surface turned on all at the same time $t=t_0$, at a given time $t$ the observer has received radiation only from the portion with $z/R > \\cos\\theta_{\\rm on} = 1-c t/R$ (left panel of Fig.~\\ref{fig:geom1}). This can be visualized as each point on the sphere being turned on by the passage of a plane traveling in the $-z$ direction with speed $c$, starting from $z = R$ at $t=0$. The same reasoning applies to the turning-off of the sphere: each point is turned off by the passage of a plane traveling in the $-z$ direction with speed $c$, starting from $z=R$ at $t=T$. As a result, if $T<R/c$, at some time $t$ the observer will ``see'' only the portion of sphere comprised between $\\cos\\theta_{\\rm on} = 1-c t/R$ and $\\cos\\theta_{\\rm off}=1-c (t-T)/R$ (right part of Fig.~\\ref{fig:geom1}). Thus, the EATS at time $t$ is this portion of the sphere.\n\n\n\\subsubsection{An expanding sphere}\\label{sec:eats-exp-sphere}\n\n\\begin{figure}\n \\includegraphics{fig2.pdf}\n \\caption{\\label{fig:geometry-eats} The shaded regions represent the equal arrival time surface (EATS) of the expanding sphere at $t>t_{\\rm off}$. The line of sight is parallel to the $z$-axis. The sphere started emitting when its radius was $R$, and stopped when it was $R+\\Delta R$. }\n\\end{figure}\n\n\nIf the sphere is expanding, the above argument is still valid, with some modification. The radius now is $R(t) = R + \\beta c (t-t_0)$ so that the lighting up takes place at $R(0)=R$ and the turning-off at $R(T)=R+\\beta c T\\equiv R + \\Delta R$. Since the lighting up happens all at the same radius, the angle $\\theta_{\\rm on}$ up to which the observer sees the surface on is still given by $\\cos\\theta_{\\rm on} = 1 - c t/R$ (the photons emitted at $t=t_0$ all come from the sphere with radius $R$). Since the sphere is expanding, its surface ``runs after'' the emitted photons, causing the arrival time difference between the first and the last photon to contract. In particular, for the first and last photon emitted from $z=R(t)$, the arrival time difference is ${t_{\\mathrm{off}}} = T(1-\\beta)=T/(1+\\beta)\\Gamma^2$ where $\\Gamma=(1-\\beta^2)^{-1/2}$ is the Lorentz factor of the expansion. For this reason, the angle up to which the observer sees the surface turned off is given by $\\cos\\theta_{\\rm off} = 1 - c(t-{t_{\\mathrm{off}}})/(R + \\Delta R)$.\n\nThe resulting geometry is not spherical (see Fig.~\\ref{fig:geometry-eats}), but the assumption of constant luminosity simplifies the mathematical treatment (see \\S\\ref{sec:exp-sphere}) in that it allows one to perform all integrations over angular coordinates only.\n\n\\subsection{On-axis jet}\\label{sec:onaxis-jet}\n\n\\begin{figure}\n \\includegraphics[width=\\columnwidth]{fig3.pdf}\n \\caption{\\label{fig:sphere-pulse} Bolometric light curves of three pulses from an expanding sphere. The flux is normalized to $F_{\\rm max}$ and the observer time is in units of $\\tau$ (see the text for the definition of these quantities). The ratio of $\\Delta R$ to $R$ is given near each curve. The black dashed line represents the saturation flux, which is reached if $T\\gg R/c$, or equivalently if $\\Delta R \\gg R$.}\n\\end{figure}\n\n\\begin{figure}\n \\includegraphics[width=\\columnwidth]{fig4.pdf}\n \\caption{\\label{fig:pulse-thj} Bolometric light curves of three pulses from an on-axis jet with ${\\theta_\\mathrm{jet}} = 1/\\Gamma$. The ratio of $\\Delta R$ to $R$  is reported near each curve. The black dashed line represents the time $t_{\\rm jet}$ at which the jet border first comes into sight. In this case $t_{\\rm jet}$ equals $\\tau$.}\n\\end{figure}\n\nA radially expanding (homogeneous) jet seen on-axis is indistinguishable from an expanding sphere as long as its half opening angle ${\\theta_\\mathrm{jet}}$ is much larger than $1/\\Gamma$ \\citep[{e.\\,g.\\xspace}][]{rhoads-balloon97}. As a corollary, the same holds if the viewing angle ${\\theta_\\mathrm{v}}$ is small enough so that the angular distance ${\\theta_\\mathrm{jet}}-{\\theta_\\mathrm{v}}$ of the line of sight from the jet border is still much larger than $1/\\Gamma$. Since the typical expected Lorentz factor of GRB jets is $\\Gamma\\sim 100$, this means that a viewing angle a few $0.01$ radians smaller than ${\\theta_\\mathrm{jet}}$ allows one to consider the jet practically on-axis. On the other hand, if the jet is very narrow, or if the Lorentz factor is low enough ({i.\\,e.\\xspace} if ${\\theta_\\mathrm{jet}}$ is comparable with $1/\\Gamma$), then the finite half opening angle must come into play. Figure~\\ref{fig:sphere-pulse} shows light curves (Eqs. \\ref{eq:spherepulse1} \\& \\ref{eq:spherepulse2}) of pulses from an expanding sphere, or equivalently from a jet with ${\\theta_\\mathrm{jet}}\\gg 1/\\Gamma$; Figure~\\ref{fig:pulse-thj} instead shows light curves (Eqs.~\\ref{eq:pulse-thj-1}~\\&~\\ref{eq:pulse-thj-2}) of pulses from an on-axis jet with ${\\theta_\\mathrm{jet}}=1/\\Gamma$. \n\nSuch light curves can be computed analytically within the assumptions stated in \\S\\ref{sec:assumptions} (see \\S\\ref{sec:exp-sphere} and \\S\\ref{sec:onaxis-jet-appendix}). Some natural scales emerge during the derivation: \n\\begin{enumerate}\n \\item the angular time scale \n \n", "index": 3, "text": "$$\n \\tau \\equiv \\dfrac{R}{\\beta c(1+\\beta)\\Gamma^2}\n $$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\tau\\equiv\\dfrac{R}{\\beta c(1+\\beta)\\Gamma^{2}}\" display=\"block\"><mrow><mi>τ</mi><mo>≡</mo><mfrac><mi>R</mi><mrow><mi>β</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n \\item the pulse saturation flux \n \n", "itemtype": "equation", "pos": 20360, "prevtext": "\n \\item the pulse peak time\n \n", "index": 5, "text": "$$\n t_{\\rm peak} \\equiv \\dfrac{\\Delta R}{\\beta c(1+\\beta)\\Gamma^2} = t_{\\rm off}\n $$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm peak}\\equiv\\dfrac{\\Delta R}{\\beta c(1+\\beta)\\Gamma^{2}}=t_{\\rm off}\" display=\"block\"><mrow><msub><mi>t</mi><mi>peak</mi></msub><mo>≡</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>R</mi></mrow><mrow><mi>β</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mrow></mfrac><mo>=</mo><msub><mi>t</mi><mi>off</mi></msub></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n\\end{enumerate}\n where $I_0'$ is the comoving bolometric intensity and $d$ is the distance of the jet from the observer.\n\n\\noindent\nIn the spherical case, before the peak ($t\\leq t_{\\rm peak}$), the bolometric flux rises as\n\n", "itemtype": "equation", "pos": 20480, "prevtext": "\n \\item the pulse saturation flux \n \n", "index": 7, "text": "$$\n F_{\\rm max} \\equiv \\dfrac{2\\pi\\,R^2}{ 3 d^2}\\dfrac{(1+\\beta)^3}{\\beta}\\Gamma^2\\,I_0'\n $$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"F_{\\rm max}\\equiv\\dfrac{2\\pi\\,R^{2}}{3d^{2}}\\dfrac{(1+\\beta)^{3}}{\\beta}\\Gamma%&#10;^{2}\\,I_{0}^{\\prime}\" display=\"block\"><mrow><msub><mi>F</mi><mi>max</mi></msub><mo>≡</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><mrow><mn>3</mn><mo>⁢</mo><msup><mi>d</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup><mi>β</mi></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nthen ($t > t_{\\rm peak}$)  it decreases as\n\n", "itemtype": "equation", "pos": 20797, "prevtext": "\n\\end{enumerate}\n where $I_0'$ is the comoving bolometric intensity and $d$ is the distance of the jet from the observer.\n\n\\noindent\nIn the spherical case, before the peak ($t\\leq t_{\\rm peak}$), the bolometric flux rises as\n\n", "index": 9, "text": "\\begin{equation}\n \\dfrac{F(t)}{F_{\\rm max}} =  1 - \\dfrac{1}{\\left(1+\\dfrac{t}{\\tau} \\right)^3}\n \\label{eq:spherepulse1}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{F(t)}{F_{\\rm max}}=1-\\dfrac{1}{\\left(1+\\dfrac{t}{\\tau}\\right)^{3}}\" display=\"block\"><mrow><mfrac><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>F</mi><mi>max</mi></msub></mfrac><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>t</mi><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n\n\n\n\\subsubsection{Spectra and hardness-intensity correlation}\n\n\\begin{figure}\n \\includegraphics{fig5.pdf}\n \\caption{\\label{fig:on-axis-spectra} Spectra at different times of a pulse from a jet seen on-axis, with $\\Gamma = 100$ and $\\Delta R = R$. The comoving spectral shape is given in Eq.~\\ref{eq:comov-spec-shape}. The coloured circles in the inset show at which point in the pulse each spectrum (identified by the colour) was calculated. }\n\\end{figure}\n\n\\begin{figure}\n \\includegraphics{fig6.pdf}\n \\caption{\\label{fig:yone-time-res} Peak of the observed spectrum versus the bolometric flux, for a pulse with $\\Gamma = 100$ and $\\Delta R = R$. A clear hardness-intensity correlation is present. The slope of the black dashed line is $1/3$. The inset is the same as in Fig.~\\ref{fig:on-axis-spectra}.}\n\\end{figure}\n\nSince we are mainly interested in how the peak of the observed spectrum evolves with time, we assume a simple form of the comoving spectral shape, namely\n\n", "itemtype": "equation", "pos": 20977, "prevtext": "\nthen ($t > t_{\\rm peak}$)  it decreases as\n\n", "index": 11, "text": "\\begin{equation}\n   \\dfrac{F(t)}{F_{\\rm max}} = \\dfrac{1}{\\left(1+\\dfrac{t-t_{\\rm peak}}{\\tau + t_{\\rm peak}} \\right)^3} - \\dfrac{1}{\\left(1+\\dfrac{t}{\\tau} \\right)^3}\n   \\label{eq:spherepulse2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{F(t)}{F_{\\rm max}}=\\dfrac{1}{\\left(1+\\dfrac{t-t_{\\rm peak}}{\\tau+t_{\\rm&#10;peak%&#10;}}\\right)^{3}}-\\dfrac{1}{\\left(1+\\dfrac{t}{\\tau}\\right)^{3}}\" display=\"block\"><mrow><mfrac><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>F</mi><mi>max</mi></msub></mfrac><mo>=</mo><mrow><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mi>peak</mi></msub></mrow><mrow><mi>τ</mi><mo>+</mo><msub><mi>t</mi><mi>peak</mi></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>t</mi><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhere $n(a,b)$ is a normalization constant which depends upon the high and low spectral indices $a$ and $b$; clearly $I_\\nu' \\propto \\nu'^{a}$ for $\\nu'\\ll \\nu_0'$ and $I_\\nu' \\propto \\nu'^{b}$ for $\\nu'\\gg \\nu_0'$. If $a>0$ and $b<-1$, the normalization $n(a,b)$ can be defined so that\n\n", "itemtype": "equation", "pos": 22159, "prevtext": "\n\n\n\n\\subsubsection{Spectra and hardness-intensity correlation}\n\n\\begin{figure}\n \\includegraphics{fig5.pdf}\n \\caption{\\label{fig:on-axis-spectra} Spectra at different times of a pulse from a jet seen on-axis, with $\\Gamma = 100$ and $\\Delta R = R$. The comoving spectral shape is given in Eq.~\\ref{eq:comov-spec-shape}. The coloured circles in the inset show at which point in the pulse each spectrum (identified by the colour) was calculated. }\n\\end{figure}\n\n\\begin{figure}\n \\includegraphics{fig6.pdf}\n \\caption{\\label{fig:yone-time-res} Peak of the observed spectrum versus the bolometric flux, for a pulse with $\\Gamma = 100$ and $\\Delta R = R$. A clear hardness-intensity correlation is present. The slope of the black dashed line is $1/3$. The inset is the same as in Fig.~\\ref{fig:on-axis-spectra}.}\n\\end{figure}\n\nSince we are mainly interested in how the peak of the observed spectrum evolves with time, we assume a simple form of the comoving spectral shape, namely\n\n", "index": 13, "text": "\\begin{equation}\n I_\\nu'(\\nu') = n(a,b)\\dfrac{I_0'}{\\nu_0'}\\left[\\left(\\dfrac{\\nu'}{\\nu_0'}\\right)^{-a} + \\left(\\dfrac{\\nu'}{\\nu_0'}\\right)^{-b}\\right]^{-1}\n \\label{eq:comov-spec-shape}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"I_{\\nu}^{\\prime}(\\nu^{\\prime})=n(a,b)\\dfrac{I_{0}^{\\prime}}{\\nu_{0}^{\\prime}}%&#10;\\left[\\left(\\dfrac{\\nu^{\\prime}}{\\nu_{0}^{\\prime}}\\right)^{-a}+\\left(\\dfrac{%&#10;\\nu^{\\prime}}{\\nu_{0}^{\\prime}}\\right)^{-b}\\right]^{-1}\" display=\"block\"><mrow><mrow><msubsup><mi>I</mi><mi>ν</mi><mo>′</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ν</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>a</mi><mo>,</mo><mi>b</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mfrac><msup><mi>ν</mi><mo>′</mo></msup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>a</mi></mrow></msup><mo>+</mo><msup><mrow><mo>(</mo><mfrac><msup><mi>ν</mi><mo>′</mo></msup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>b</mi></mrow></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nThe break frequency $\\nu_0'$ is related to the comoving $\\nu' F_\\nu'$ peak energy $E_{\\rm peak}'$ through\n\n", "itemtype": "equation", "pos": 22647, "prevtext": "\nwhere $n(a,b)$ is a normalization constant which depends upon the high and low spectral indices $a$ and $b$; clearly $I_\\nu' \\propto \\nu'^{a}$ for $\\nu'\\ll \\nu_0'$ and $I_\\nu' \\propto \\nu'^{b}$ for $\\nu'\\gg \\nu_0'$. If $a>0$ and $b<-1$, the normalization $n(a,b)$ can be defined so that\n\n", "index": 15, "text": "\\begin{equation}\n I_0' = \\int_0^\\infty I_\\nu'(\\nu')\\,d\\nu'\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"I_{0}^{\\prime}=\\int_{0}^{\\infty}I_{\\nu}^{\\prime}(\\nu^{\\prime})\\,d\\nu^{\\prime}\" display=\"block\"><mrow><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><msubsup><mi>I</mi><mi>ν</mi><mo>′</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ν</mi><mo>′</mo></msup><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhere $h$ is Planck's constant.\nAll the examples in this paper will assume the above comoving spectral shape, with $a=0.2$ and $b=-1.3$, which represent average high and low spectral indices of Fermi GRB spectra \\citep{2011A&A...530A..21N}.\n\nFigure~\\ref{fig:on-axis-spectra} shows computed spectra from an on-axis jet at six representative times. The evolution is clearly hard-to-soft ({i.\\,e.\\xspace} the peak energy decreases monotonically with time), and the low and high energy spectral indices are the same as those of the comoving spectrum. Figure~\\ref{fig:yone-time-res} shows that after the peak of the light curve the peak energy ${E_\\mathrm{peak}}$ of the observed $\\nu F_\\nu$ spectrum varies with the bolometric flux $F$ following roughly ${E_\\mathrm{peak}} \\propto F^{1/3}$, {i.\\,e.\\xspace} the model predicts a hardness intensity correlation with index $1/3$ during the decay of the pulse.\nLet us interpret these results:\n\\begin{enumerate}\n \\item \\textit{Pulse rise:}\nthe maximum of ${E_\\mathrm{peak}}(t)$ is at the very beginning of the pulse, when only a small area pointing directly towards the observer (the ``tip'' of the jet) is visible. As the visible area increases, less beamed contributions from parts at increasing latitude come into sight, reducing ${E_\\mathrm{peak}}$ slightly. \n\n\\item \\textit{Pulse decay:}\nafter the pulse peak, the tip of the jet turns off, causing ${E_\\mathrm{peak}}$ to drop. At this time the visible part of the jet is an annulus (see Fig.~\\ref{fig:geometry-eats}): the spectral peak is determined mainly by the maximum Doppler factor $\\delta_{\\rm max}(t) = \\Gamma^{-1}\\left[1-\\beta\\cos\\theta_{\\rm off}(t)\\right]^{-1}$ of the visible area, which corresponds to the innermost circle of the annulus, so that ${E_\\mathrm{peak}} \\sim \\delta_{\\rm max} E_{\\rm peak}'$. The flux $F$ in turn decreases approximately as $\\delta_{\\rm max}^4$ times the angular size of the annulus. The latter is proportional to $\\cos\\theta_{\\rm off}-\\cos\\theta_{\\rm on}$, which can be shown to be\n\n", "itemtype": "equation", "pos": 22827, "prevtext": "\nThe break frequency $\\nu_0'$ is related to the comoving $\\nu' F_\\nu'$ peak energy $E_{\\rm peak}'$ through\n\n", "index": 17, "text": "\\begin{equation}\n E_{\\rm peak}' = \\left(-\\dfrac{a+1}{b+1}\\right)^\\frac{1}{a-b} h\\nu_0'\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"E_{\\rm peak}^{\\prime}=\\left(-\\dfrac{a+1}{b+1}\\right)^{\\frac{1}{a-b}}h\\nu_{0}^{\\prime}\" display=\"block\"><mrow><msubsup><mi>E</mi><mi>peak</mi><mo>′</mo></msubsup><mo>=</mo><mrow><msup><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><mrow><mi>a</mi><mo>+</mo><mn>1</mn></mrow><mrow><mi>b</mi><mo>+</mo><mn>1</mn></mrow></mfrac></mrow><mo>)</mo></mrow><mfrac><mn>1</mn><mrow><mi>a</mi><mo>-</mo><mi>b</mi></mrow></mfrac></msup><mo>⁢</mo><mi>h</mi><mo>⁢</mo><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nAs a result, we have that $F\\propto \\delta_{\\rm max}^3$, which explains why ${E_\\mathrm{peak}} \\propto F^{1/3}$.\n\n\\end{enumerate}\n\n\n\n\\subsection{Off-axis jet}\\label{sec:offaxis-jet}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig7.pdf} \n \\end{center}\n \\caption{\\label{fig:geom6}  The off-axis jet can be thought of as being part of an expanding sphere. For simplicity, the EATS of the expanding sphere (hatched area) is represented as in Figure~\\ref{fig:geom1}, but it is actually the same as in Figure~\\ref{fig:geometry-eats}. The actual EATS of the jet is the interception between the jet surface and the sphere EATS.}\n\\end{figure}\n\n\n The off-axis jet (${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$) can be thought of as being part of an expanding sphere, as in Fig.~\\ref{fig:geom6}. The proper equal arrival time surfaces are then just the interception between the jet surface and the expanding sphere EATS (see \\S\\ref{sec:offaxis-appendix} for the complete mathematical treatment).\n \n \\subsubsection{A longer pulse duration}\\label{sec:longer-duration}\n If the jet is off-axis, relativistic beaming of the emitted radiation causes both the flux and ${E_\\mathrm{peak}}$ to be much lower than the on-axis counterparts. For the same reason, the duration of the pulse becomes longer. This can be understood intuitively as follows: as in the on-axis case, the jet surface is not seen to turn on all at the same time, but progressively from the nearest-to-the-observer point (point $A$ in Fig.~\\ref{fig:geom6}) down to the farthest. The same holds for the turning off. Thus point $A$ is the first to turn on, and also the first to turn off. As a consequence, the effective emitting area increases as long as point $A$ is seen emitting, then it decreases. In other words, the peak time equals the emission time of point $A$, which is given by\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $h$ is Planck's constant.\nAll the examples in this paper will assume the above comoving spectral shape, with $a=0.2$ and $b=-1.3$, which represent average high and low spectral indices of Fermi GRB spectra \\citep{2011A&A...530A..21N}.\n\nFigure~\\ref{fig:on-axis-spectra} shows computed spectra from an on-axis jet at six representative times. The evolution is clearly hard-to-soft ({i.\\,e.\\xspace} the peak energy decreases monotonically with time), and the low and high energy spectral indices are the same as those of the comoving spectrum. Figure~\\ref{fig:yone-time-res} shows that after the peak of the light curve the peak energy ${E_\\mathrm{peak}}$ of the observed $\\nu F_\\nu$ spectrum varies with the bolometric flux $F$ following roughly ${E_\\mathrm{peak}} \\propto F^{1/3}$, {i.\\,e.\\xspace} the model predicts a hardness intensity correlation with index $1/3$ during the decay of the pulse.\nLet us interpret these results:\n\\begin{enumerate}\n \\item \\textit{Pulse rise:}\nthe maximum of ${E_\\mathrm{peak}}(t)$ is at the very beginning of the pulse, when only a small area pointing directly towards the observer (the ``tip'' of the jet) is visible. As the visible area increases, less beamed contributions from parts at increasing latitude come into sight, reducing ${E_\\mathrm{peak}}$ slightly. \n\n\\item \\textit{Pulse decay:}\nafter the pulse peak, the tip of the jet turns off, causing ${E_\\mathrm{peak}}$ to drop. At this time the visible part of the jet is an annulus (see Fig.~\\ref{fig:geometry-eats}): the spectral peak is determined mainly by the maximum Doppler factor $\\delta_{\\rm max}(t) = \\Gamma^{-1}\\left[1-\\beta\\cos\\theta_{\\rm off}(t)\\right]^{-1}$ of the visible area, which corresponds to the innermost circle of the annulus, so that ${E_\\mathrm{peak}} \\sim \\delta_{\\rm max} E_{\\rm peak}'$. The flux $F$ in turn decreases approximately as $\\delta_{\\rm max}^4$ times the angular size of the annulus. The latter is proportional to $\\cos\\theta_{\\rm off}-\\cos\\theta_{\\rm on}$, which can be shown to be\n\n", "index": 19, "text": "\\begin{equation}\n \\cos\\theta_{\\rm off}-\\cos\\theta_{\\rm on} \\approx \\frac{\\Delta R}{R}\\frac{1}{\\beta \\Gamma \\delta_{\\rm max}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\cos\\theta_{\\rm off}-\\cos\\theta_{\\rm on}\\approx\\frac{\\Delta R}{R}\\frac{1}{%&#10;\\beta\\Gamma\\delta_{\\rm max}}\" display=\"block\"><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>off</mi></msub></mrow><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>on</mi></msub></mrow></mrow><mo>≈</mo><mrow><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>R</mi></mrow><mi>R</mi></mfrac><mo>⁢</mo><mfrac><mn>1</mn><mrow><mi>β</mi><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><msub><mi>δ</mi><mi>max</mi></msub></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nthus its ratio to the on-axis peak time is\n\n", "itemtype": "equation", "pos": 26951, "prevtext": " \nAs a result, we have that $F\\propto \\delta_{\\rm max}^3$, which explains why ${E_\\mathrm{peak}} \\propto F^{1/3}$.\n\n\\end{enumerate}\n\n\n\n\\subsection{Off-axis jet}\\label{sec:offaxis-jet}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig7.pdf} \n \\end{center}\n \\caption{\\label{fig:geom6}  The off-axis jet can be thought of as being part of an expanding sphere. For simplicity, the EATS of the expanding sphere (hatched area) is represented as in Figure~\\ref{fig:geom1}, but it is actually the same as in Figure~\\ref{fig:geometry-eats}. The actual EATS of the jet is the interception between the jet surface and the sphere EATS.}\n\\end{figure}\n\n\n The off-axis jet (${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$) can be thought of as being part of an expanding sphere, as in Fig.~\\ref{fig:geom6}. The proper equal arrival time surfaces are then just the interception between the jet surface and the expanding sphere EATS (see \\S\\ref{sec:offaxis-appendix} for the complete mathematical treatment).\n \n \\subsubsection{A longer pulse duration}\\label{sec:longer-duration}\n If the jet is off-axis, relativistic beaming of the emitted radiation causes both the flux and ${E_\\mathrm{peak}}$ to be much lower than the on-axis counterparts. For the same reason, the duration of the pulse becomes longer. This can be understood intuitively as follows: as in the on-axis case, the jet surface is not seen to turn on all at the same time, but progressively from the nearest-to-the-observer point (point $A$ in Fig.~\\ref{fig:geom6}) down to the farthest. The same holds for the turning off. Thus point $A$ is the first to turn on, and also the first to turn off. As a consequence, the effective emitting area increases as long as point $A$ is seen emitting, then it decreases. In other words, the peak time equals the emission time of point $A$, which is given by\n\n", "index": 21, "text": "\\begin{equation}\n t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}}) = T\\left[1-\\beta\\cos({\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}})\\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm peak}({\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})=T\\left[1-\\beta\\cos%&#10;({\\theta_{\\mathrm{v}}}-{\\theta_{\\mathrm{jet}}})\\right]\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>peak</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>-</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nFigure~\\ref{fig:tpeak} shows a plot of this ratio as a function of ${\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}$ for different values of $\\Gamma$. In general, a pulse seen off-axis can be much longer than on-axis.\n\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig8.pdf} \n \\end{center}\n \\caption{\\label{fig:tpeak}  Ratio of the off-axis pulse peak time $t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$ to the on-axis pulse peak time $t_{\\rm peak}$. The jet half opening angle is ${\\theta_\\mathrm{jet}}=5^\\circ$. Each curve refers to a different value of the Lorentz factor, from $\\Gamma=50$ to $\\Gamma = 300$ with a step of $50$.}\n\\end{figure}\n\n\n\\subsubsection{A lower peak flux}\\label{sec:lower-flux}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig9.pdf} \n \\end{center}\n \\caption{\\label{fig:peakflux}  Peak fluxes of pulses from jets with five different half opening angles, namely ${\\theta_\\mathrm{jet}} = 1^\\circ$, $2^\\circ$, $4^\\circ$, $8^\\circ$ and $16^\\circ$ (indicated by the thin vertical dotted lines). The orange dashed curves represent the corresponding empirical parametrization given in Eq.~\\ref{eq:peakflux-empirical}.}\n\\end{figure}\n\nThe decrease of the pulse peak flux $F_{\\rm p}$ with increasing viewing angle can be understood as follows:\n\\begin{enumerate}\n \\item when the jet is observed on axis, the bulk of the flux comes from a ring of angular radius $1/\\Gamma$ centred on the line of sight. Let us indicate this peak flux with $F^{*}$;\n \\item as long as ${\\theta_\\mathrm{v}} < {\\theta_\\mathrm{jet}} - 1/\\Gamma$, we have that $F_{\\rm p}$ is essentially equal to $F^{*}$;\n \\item if ${\\theta_\\mathrm{v}} = {\\theta_\\mathrm{jet}}$, about half of the ring is still visible, thus $F_{\\rm p}$ is reduced to about $F^{*}/2$;\n \\item if ${\\theta_\\mathrm{v}}$ is only slightly larger than ${\\theta_\\mathrm{jet}}$, the flux is dominated by the contribution of the jet border, whose Doppler factor is $\\delta_{\\rm B} = \\Gamma^{-1}\\left[1-\\beta\\cos\\left({\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}\\right)\\right]^{-1}$, thus $F_{\\rm p} \\propto \\delta_B^4\\,F^{*}$;\n \\item as ${\\theta_\\mathrm{v}}$ increases towards ${\\theta_\\mathrm{v}} \\gg {\\theta_\\mathrm{jet}}$, the relative difference in Doppler factor between different parts of the jet is reduced, and the flux contributions of parts other than the border become increasingly important. This compensates in part the de-beaming of the jet border, the effect being more pronounced for larger jets, because the effective emitting surface area is larger.\n\\end{enumerate}\n Based on these considerations, an empirical analytical formula can be constructed to describe how the peak flux depends on the viewing angle ${\\theta_\\mathrm{v}}$ and on the jet half opening angle ${\\theta_\\mathrm{jet}}$. An example of such an empirical formula is\n \n", "itemtype": "equation", "pos": -1, "prevtext": "\nthus its ratio to the on-axis peak time is\n\n", "index": 23, "text": "\\begin{equation}\n \\frac{t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})}{t_{\\rm peak}} = \\frac{1-\\beta\\cos({\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}})}{1-\\beta}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\frac{t_{\\rm peak}({\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})}{t_{\\rm peak%&#10;}}=\\frac{1-\\beta\\cos({\\theta_{\\mathrm{v}}}-{\\theta_{\\mathrm{jet}}})}{1-\\beta}\" display=\"block\"><mrow><mfrac><mrow><msub><mi>t</mi><mi>peak</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>t</mi><mi>peak</mi></msub></mfrac><mo>=</mo><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>-</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mrow><mn>1</mn><mo>-</mo><mi>β</mi></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \n where ${\\theta_\\mathrm{jet}}^* = {\\theta_\\mathrm{jet}} - 1/\\Gamma$. The definition for ${\\theta_\\mathrm{jet}}^* < {\\theta_\\mathrm{v}} \\leq {\\theta_\\mathrm{jet}}$ is just a linear decrease from $F^*$ to $F^*/2$; the exponent of $\\delta_B$ in the definition for ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$ is $4$ reduced by an amount\\footnote{The coefficient and exponent of ${\\theta_\\mathrm{jet}}$ in Eq.~\\ref{eq:peakflux-empirical} have been chosen to get a good agreement with the results from the semi-analytical formulation developed in the Appendix.} which depends on ${\\theta_\\mathrm{jet}}$, in order to take into account the flux loss compensation explained in point (v) above.\n \n In the Appendix (\\S\\ref{sec:offaxis-appendix}) we show that the flux at time $t$ of the pulse from an off-axis jet is given by the integral in Eq.~\\ref{eq:flux-offaxis}, which however has no analytical solution for ${\\theta_\\mathrm{v}}>0$.  The coloured solid lines in Figure~\\ref{fig:peakflux} represent $F_{\\rm p}$ as computed by numerical integration of Eq.~\\ref{eq:flux-offaxis} at $t=t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$, for five jets with different half opening angles. The orange dashed lines are plots of Eq.~\\ref{eq:peakflux-empirical} for the corresponding parameter values, showing that the best agreement is for half opening angles $4^\\circ \\lesssim {\\theta_\\mathrm{jet}} \\lesssim 10^\\circ$.\n\n\n\\subsubsection{Spectral peak energy, hardness-intensity correlation}\\label{sec:lower-epeak}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig10.pdf} \n \\end{center}\n \\caption{\\label{fig:epeak-thv} ${E_\\mathrm{peak}}$ at the pulse peak time for three jets with $R=10^{13}$ cm, ${\\theta_\\mathrm{jet}}=5^\\circ$ and three values of $\\Gamma$, namely (from red to green) $\\Gamma = 30$, $100$ and $300$. The black dashed lines are plots of $\\delta_B/2\\Gamma$ for the corresponding values of $\\Gamma$.  }\n\\end{figure}\n\nWith the same assumptions as in the on-axis case, we computed the spectra from the off-axis pulse at different times. The spectrum at each time is dominated by the part of the EATS with the strongest beaming. At time $t_{\\rm peak}$, such part is the border of the jet nearest to the observer, thus one expects ${E_\\mathrm{peak}}(t_{\\rm peak})$ to decrease with ${\\theta_\\mathrm{v}}$ as the Doppler factor of the jet border, {i.\\,e.\\xspace} ${E_\\mathrm{peak}}(t_{\\rm peak})\\propto \\delta_B$. Figure~\\ref{fig:epeak-thv} is a plot of ${E_\\mathrm{peak}}(t_{\\rm peak})$ for three values of $\\Gamma$, obtained by using Eq.~\\ref{eq:off-axis-spectrum} to compute the spectra, and it shows that indeed ${E_\\mathrm{peak}}$ is approximately proportional to $\\delta_B$. In general, ${E_\\mathrm{peak}}$ is a little lower than $\\delta_B {E_\\mathrm{peak}}'$ because of the ``blending in'' of softer spectra from less beamed parts of the jet.      \n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig11.pdf} \n \\end{center}\n \\caption{\\label{fig:epeak-off-axis} Logarithmic plot of ${E_\\mathrm{peak}}$ versus Flux of the same pulse seen at different off-axis viewing angles. The jet has ${\\theta_\\mathrm{jet}} = 5^\\circ$, $\\Gamma = 100$ and $R=10^{13}$ cm. The four series of points (from green to red) correspond to ${\\theta_\\mathrm{v}} = 5.1^\\circ$, $5.5^\\circ$, $6^\\circ$ and $7^\\circ$. The inset shows the slope of the relation during the decay of the pulse for each viewing angle.  }\n\\end{figure}\n\n\nFigure~\\ref{fig:epeak-off-axis} shows the evolution of ${E_\\mathrm{peak}}$ as a function of the flux $F$ during the pulse, for four different off-axis viewing angles. A ``hardness-intensity'' correlation during the pulse decay is still apparent, with a slightly steeper slope ($\\sim 0.5$) just after the pulse peak, getting shallower as the flux decreases and eventually reaching $\\sim 1/3$  as in the on-axis case. This slope difference is potentially a diagnostic of the viewing angle, whenever a sufficiently fine time resolved analysis is possible (there are other effects, though, which can affect this slope, as suggested {e.\\,g.\\xspace} in \\citet{Genet2009} and \\citet{Uhm2015}).\n\n\n\\subsubsection{Light curves}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig12.pdf} \n \\end{center}\n \\caption{\\label{fig:homogeneous-off-axis-lcs}  Light curves of a pulse from a homogeneous jet with ${\\theta_\\mathrm{jet}} = 5^o$ and $\\Gamma = 100$. Each curve refers to a different viewing angle in the sequence (from green to red) ${\\theta_\\mathrm{v}} = 5^o$, $5.2^o$,  $5.4^o$, $5.6^o$, $5.8^o$ and $6^o$.  $F_{\\rm max}$ refers to the on-axis jet. The inset shows the same curves plotted with logarithmic axes.}\n\\end{figure}\n\nFigure~\\ref{fig:homogeneous-off-axis-lcs} shows plots of bolometric light curves of the same pulse seen at different viewing angles, computed by numerical integration of Eq.~\\ref{eq:flux-offaxis} using a Runge-Kutta IV order scheme. Both the peak flux decrease and the duration increase discussed in \\S\\ref{sec:longer-duration} and \\S\\ref{sec:lower-flux} are apparent. The overall shape is qualitatively insensitive of the viewing angle, apart from the peak being sharper in the on-axis case.\n\n\n\\section{Multi-pulse light curves}\\label{sec:multipulse}\n\nSome non-trivial features emerge from the superposition of multiple pulses. Figure~\\ref{fig:offaxis-multi-lcs} shows four light curves of the same series of $N=100$ pulses seen at four different viewing angles. All pulses are equal in duration and peak flux. Their starting times have been sampled from a uniform distribution within a $2$ seconds time span. The jet parameters are $\\Gamma=100$, ${\\theta_\\mathrm{jet}}=5^\\circ$, $R=10^{13}$ cm and $\\Delta R = R$. The viewing angles are ${\\theta_\\mathrm{v}}=5.2^\\circ$, $5.6^\\circ$, $6.2^\\circ$ and $6.5^\\circ$. The comoving spectral shape is the same as before (Eq.~\\ref{eq:comov-spec-shape}). The resulting light curves have been binned at $32$ ms resolution for a better comparison with actual GRB light curves. For each light curve, the ${E_\\mathrm{peak}}$ of the spectrum in each time bin is also given (thin orange histograms). The following features should be apparent:\n\\begin{enumerate}\n \\item as the viewing angle increases, the variability is smeared out by the pulse width increase;\n \\item the shape of the overall light curve tends to resemble a (long) single pulse when the viewing angle is large enough;\n \\item the superposition of pulses masks the hard-to-soft spectral evolution of the single pulses, turning it into an intensity tracking behaviour;\n \\item the variation of ${E_\\mathrm{peak}}$ leads slightly the variation in flux;\n \\item there is a general softening of ${E_\\mathrm{peak}}$ in time over the entire light curve.\n\\end{enumerate}\nThese features are strikingly similar to those found in time resolved spectral analysis of real {Gamma-Ray Bursts\\xspace} \\citep[{e.\\,g.\\xspace}][]{Ford1995,Ghirlanda2002}. We do not advocate this as a proof of the correctness of our model, which is certainly oversimplified, but rather as a further indication that some features of GRB light curves might be explained admitting that the jet is seen at least slightly off-axis. The off-axis viewing angle would favour the broadening and superposition of pulses, which is the necessary ingredient to some of the features enumerated above, and would also explain in a simple way why the slope of the hardness-intensity correlation changes from burst to burst, being influenced by the viewing angle (\\S\\ref{sec:lower-epeak}).\n\n\\subsection{Single pulses \\textit{versus} pulse superposition}\nPoint (ii) above suggests that single broad pulses in GRB light curves might be actually the superposition of shorter pulses. Such a \\textit{caveat} has been pointed out before by \\citet{Genet2009}. Within our simple model, there is actually a very simple way to discern between the two cases: a true single pulse always displays a hard-to-soft spectral behaviour, while a pulse superposition results in an intensity-tracking behaviour. This is a potential diagnostic to distinguish real single pulsed GRBs.\n\n\\begin{figure*}\n \\begin{center}\n \\includegraphics[width=\\textwidth]{fig13.pdf} \n \\end{center}\n \\caption{\\label{fig:offaxis-multi-lcs}  Light curves (thick histograms) and spectral peak evolution (thin orange histograms) of a sequence of $100$ pulses from a homogeneous jet with ${\\theta_\\mathrm{jet}} = 5^o$, $\\Gamma = 100$ and $R=10^{13}$ cm. The peak of the $\\nu F_\\nu$ comoving spectrum is $E_{\\rm p}'=1$ keV. The pulse start times are randomly distributed within the first $2$ s of the observer time. Each panel refers to a different viewing angle in the sequence ${\\theta_\\mathrm{v}} = 5.2^o$, $5.6^o$, $6.2^o$, $6.5^o$ (from left to right, top to bottom).}\n\\end{figure*}\n\n\n\\subsection{Low luminosity GRBs}\\label{sec:low-lum-grbs}\nRecently, some authors \\citep[{e.\\,g.\\xspace}][]{Liang2007,Zhang2008,He2009,2011ApJ...739L..55B} argued that a unique population of low luminosity {Gamma-Ray Bursts\\xspace} exists, based on some common features of GRB060218, GRB980425, GRB031203 and GRB100316D. These features include, apart from the low inferred isotropic equivalent luminosity, an apparently single pulsed, smooth light curve (low variability), and a low average ${E_\\mathrm{peak}}$. Since all such bursts were at a low redshift, the rate of like events per unit comoving volume in the Universe is very high (higher that that of ``normal'' GRBs), but we do not see the majority of these events because of selection effects.\nThe results discussed in this paper suggest that the apparently peculiar features of these GRBs can be interpreted instead as being just the indication that they were observed off-axis: figure~\\ref{fig:offaxis-multi-lcs} together with results from the preceding sections show that their features are expected in the case of a jet seen off-axis. Moreover, in \\cite{2015MNRAS.447.1911P} we have shown that the observed rate of low luminosity GRBs is consistent with what one would expect if they were just ordinary bursts seen off-axis (taking into account the fact that the de-beamed flux can still be above the instrument sensitivity if the off-axis viewing angle is not too large). Based on these considerations, we argue that there is no need to invoke a new separate population of low luminosity GRBs.\n\n\\section{Discussion and Conclusions}\\label{sec:conclusions}\n\n\nIn this work we set up a simple physical model of a single GRB pulse based on shell curvature and relativistic effects only. Compared to other similar (and more refined) models \\citep{Ryde2002,Dermer2004,Genet2009}, our model includes for the first time the effect of an off-axis viewing angle. The inclusion of such effect is of primary importance, because the probability to observe GRBs (slightly) off-axis is very high, given the typically narrow opening angle of their jets. Admittedly, the assumptions behind the model are at best a very rough approximation of reality: for example, the surface of a real jet is unlikely to be perfectly spherical; the jet borders are certainly not sharp; the emitting region is a volume, not a surface; the turning-on and turning-off of the emitting region can not be as sudden as assumed. Nevertheless, there are at least two reasons to take seriously the results of this simplified treatment: (i) all predictions are based on solid arguments which can be understood intuitively, and (ii) the general trend of the effect of the off-axis viewing angle does not depend on the simplifications adopted.\n\nGiven the above considerations, we divide our conclusions in two parts: those which are solid and do not depend much on the assumptions behind the model, and those which could change significantly if more realistic assumptions were made.\n\n\\begin{enumerate}\n \\item Solid conclusions:\n    \\begin{enumerate}\n    \\item if the GRB jet is seen off-axis, single pulses appear longer and their spectrum appears softer than in the on-axis case;\n    \\item during the decay of the pulse, flux and spectral peak energy decrease in a correlated way, and the correlation is influenced by the viewing angle;\n    \\item if a burst is made up of a superposition of pulses, its variability is smeared out by pulse broadening if the jet is observed off-axis, with respect to the on-axis case;\n    \\end{enumerate}\n\n \\item Conclusions that might be affected significantly by a change in the assumptions:\n    \\begin{enumerate}\n    \\item the spectral evolution during a single pulse is always hard-to-soft. An ``intensity-tracking'' behaviour can be obtained by superposition of pulses, especially if the viewing angle is off-axis, so that broadening of pulses favours their superposition;\n    \\item the shape of a pulse is qualitatively insensitive of the viewing angle.\n    \\end{enumerate}\n\\end{enumerate}\n\nWe plan to explore the effect of including an axisymmetric jet structure in the model (Salafia et al., in preparation) to test to which extent our results can be extended to the more realistic case of a jet with smooth borders.\n\nAs discussed in \\S\\ref{sec:low-lum-grbs}, the results support the idea that prompt emission properties of so-called low luminosity GRBs can be interpreted as indications that they are just ordinary bursts seen off-axis.\n\n\n\\section*{Acknowledgements}\n\nO. S. Salafia thanks the \\textit{Swift} group at the Astronomical Observatory of Brera - Merate for useful discussions.  \n \n\\section*{References}\n\n\\footnotesize{\n\\bibliographystyle{mn2e}\n\\bibliography{journals,bibtex}}\n\n\\appendix\n\n\\section{Derivation of the pulse light curve and spectrum}\n\nIn what follows, we give a detailed derivation of the general formulas for the pulse light curve and time dependent spectrum. A generalization for an axisymmetric, structured jet is possible, as we will show in a following work (Salafia et al., in preparation).\n\n\n\\subsection{Light curve of the pulse from an expanding sphere}\\label{sec:exp-sphere}\nIn general, the flux from a time-varying source can be defined as\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nFigure~\\ref{fig:tpeak} shows a plot of this ratio as a function of ${\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}$ for different values of $\\Gamma$. In general, a pulse seen off-axis can be much longer than on-axis.\n\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig8.pdf} \n \\end{center}\n \\caption{\\label{fig:tpeak}  Ratio of the off-axis pulse peak time $t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$ to the on-axis pulse peak time $t_{\\rm peak}$. The jet half opening angle is ${\\theta_\\mathrm{jet}}=5^\\circ$. Each curve refers to a different value of the Lorentz factor, from $\\Gamma=50$ to $\\Gamma = 300$ with a step of $50$.}\n\\end{figure}\n\n\n\\subsubsection{A lower peak flux}\\label{sec:lower-flux}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig9.pdf} \n \\end{center}\n \\caption{\\label{fig:peakflux}  Peak fluxes of pulses from jets with five different half opening angles, namely ${\\theta_\\mathrm{jet}} = 1^\\circ$, $2^\\circ$, $4^\\circ$, $8^\\circ$ and $16^\\circ$ (indicated by the thin vertical dotted lines). The orange dashed curves represent the corresponding empirical parametrization given in Eq.~\\ref{eq:peakflux-empirical}.}\n\\end{figure}\n\nThe decrease of the pulse peak flux $F_{\\rm p}$ with increasing viewing angle can be understood as follows:\n\\begin{enumerate}\n \\item when the jet is observed on axis, the bulk of the flux comes from a ring of angular radius $1/\\Gamma$ centred on the line of sight. Let us indicate this peak flux with $F^{*}$;\n \\item as long as ${\\theta_\\mathrm{v}} < {\\theta_\\mathrm{jet}} - 1/\\Gamma$, we have that $F_{\\rm p}$ is essentially equal to $F^{*}$;\n \\item if ${\\theta_\\mathrm{v}} = {\\theta_\\mathrm{jet}}$, about half of the ring is still visible, thus $F_{\\rm p}$ is reduced to about $F^{*}/2$;\n \\item if ${\\theta_\\mathrm{v}}$ is only slightly larger than ${\\theta_\\mathrm{jet}}$, the flux is dominated by the contribution of the jet border, whose Doppler factor is $\\delta_{\\rm B} = \\Gamma^{-1}\\left[1-\\beta\\cos\\left({\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}\\right)\\right]^{-1}$, thus $F_{\\rm p} \\propto \\delta_B^4\\,F^{*}$;\n \\item as ${\\theta_\\mathrm{v}}$ increases towards ${\\theta_\\mathrm{v}} \\gg {\\theta_\\mathrm{jet}}$, the relative difference in Doppler factor between different parts of the jet is reduced, and the flux contributions of parts other than the border become increasingly important. This compensates in part the de-beaming of the jet border, the effect being more pronounced for larger jets, because the effective emitting surface area is larger.\n\\end{enumerate}\n Based on these considerations, an empirical analytical formula can be constructed to describe how the peak flux depends on the viewing angle ${\\theta_\\mathrm{v}}$ and on the jet half opening angle ${\\theta_\\mathrm{jet}}$. An example of such an empirical formula is\n \n", "index": 25, "text": "\\begin{equation}\n  F_{\\rm p}/F^* \\approx \\left\\lbrace\\begin{array}{lr}\n                            1 & {\\theta_\\mathrm{v}} \\leq {\\theta_\\mathrm{jet}}^* \\vspace{12pt}\\\\\n                            1 - \\Gamma({\\theta_\\mathrm{v}} - {\\theta_\\mathrm{jet}}^*)/2 & {\\theta_\\mathrm{jet}}^* < {\\theta_\\mathrm{v}} \\leq {\\theta_\\mathrm{jet}} \\vspace{4pt}\\\\\n                            \\dfrac{1}{2}\\left(\\dfrac{\\delta_B}{(1+\\beta)\\Gamma}\\right)^{(4 - \\sqrt{2}{\\theta_\\mathrm{jet}}^{1/3})} & {\\theta_\\mathrm{v}} > {\\theta_\\mathrm{jet}}\n                           \\end{array}\\right.\\label{eq:peakflux-empirical}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"F_{\\rm p}/F^{*}\\approx\\left\\{\\begin{array}[]{lr}1&amp;{\\theta_{\\mathrm{v}}}\\leq{%&#10;\\theta_{\\mathrm{jet}}}^{*}\\\\&#10;1-\\Gamma({\\theta_{\\mathrm{v}}}-{\\theta_{\\mathrm{jet}}}^{*})/2&amp;{\\theta_{\\mathrm%&#10;{jet}}}^{*}&lt;{\\theta_{\\mathrm{v}}}\\leq{\\theta_{\\mathrm{jet}}}\\\\&#10;\\dfrac{1}{2}\\left(\\dfrac{\\delta_{B}}{(1+\\beta)\\Gamma}\\right)^{(4-\\sqrt{2}{%&#10;\\theta_{\\mathrm{jet}}}^{1/3})}&amp;{\\theta_{\\mathrm{v}}}&gt;{\\theta_{\\mathrm{jet}}}%&#10;\\end{array}\\right.\" display=\"block\"><mrow><mrow><msub><mi>F</mi><mi mathvariant=\"normal\">p</mi></msub><mo>/</mo><msup><mi>F</mi><mo>*</mo></msup></mrow><mo>≈</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mn>1</mn></mtd><mtd columnalign=\"right\"><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>≤</mo><mmultiscripts><mi>θ</mi><mi>jet</mi><none/><none/><mo>*</mo></mmultiscripts></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>-</mo><mmultiscripts><mi>θ</mi><mi>jet</mi><none/><none/><mo>*</mo></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mn>2</mn></mrow></mrow></mtd><mtd columnalign=\"right\"><mrow><mmultiscripts><mi>θ</mi><mi>jet</mi><none/><none/><mo>*</mo></mmultiscripts><mo>&lt;</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>≤</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>δ</mi><mi>B</mi></msub><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Γ</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>4</mn><mo>-</mo><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><mmultiscripts><mi>θ</mi><mi>jet</mi><none/><none/><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></mmultiscripts></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup></mrow></mtd><mtd columnalign=\"right\"><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>&gt;</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nwhere $S(t)$ is the ``$t$-equal arrival time surface'' (EATS hereafter), {i.\\,e.\\xspace} the locus of points of the source whose emitted photons reach the observer at $t$,  $r$ is the distance between the observer and the element $ds$ of the EATS, and $\\alpha$ is the angle between the normal to the detector surface and the direction of the photon incoming from the $ds$ surface element. For most astrophysical applications $\\cos\\alpha\\sim 1$, because the source is sufficiently far away to have a negligible angular size in the sky. Here the intensity $I(s)$ is allowed to vary both in time and in space ($s$ indicates the coordinates of a point on the EATS, which is a surface in spacetime), so this formulation is applicable to inhomogeneous sources as well.\n\nIn our situation, it is convenient to use spherical coordinates centered on the emitting sphere, so that (assuming cylindrical symmetry of the intensity) we have $ds = 2\\pi\\sin\\theta\\,d\\theta\\,R(t_e)^2$, where $t_e=t-r/c$ is the emission time. The distance $r$ of the point $(\\theta,\\phi,t_e)$ from the detector is $r\\approx d-R(t_e)\\cos\\theta$ where $d$ is the distance of the sphere center from the detector, thus\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \n where ${\\theta_\\mathrm{jet}}^* = {\\theta_\\mathrm{jet}} - 1/\\Gamma$. The definition for ${\\theta_\\mathrm{jet}}^* < {\\theta_\\mathrm{v}} \\leq {\\theta_\\mathrm{jet}}$ is just a linear decrease from $F^*$ to $F^*/2$; the exponent of $\\delta_B$ in the definition for ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$ is $4$ reduced by an amount\\footnote{The coefficient and exponent of ${\\theta_\\mathrm{jet}}$ in Eq.~\\ref{eq:peakflux-empirical} have been chosen to get a good agreement with the results from the semi-analytical formulation developed in the Appendix.} which depends on ${\\theta_\\mathrm{jet}}$, in order to take into account the flux loss compensation explained in point (v) above.\n \n In the Appendix (\\S\\ref{sec:offaxis-appendix}) we show that the flux at time $t$ of the pulse from an off-axis jet is given by the integral in Eq.~\\ref{eq:flux-offaxis}, which however has no analytical solution for ${\\theta_\\mathrm{v}}>0$.  The coloured solid lines in Figure~\\ref{fig:peakflux} represent $F_{\\rm p}$ as computed by numerical integration of Eq.~\\ref{eq:flux-offaxis} at $t=t_{\\rm peak}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$, for five jets with different half opening angles. The orange dashed lines are plots of Eq.~\\ref{eq:peakflux-empirical} for the corresponding parameter values, showing that the best agreement is for half opening angles $4^\\circ \\lesssim {\\theta_\\mathrm{jet}} \\lesssim 10^\\circ$.\n\n\n\\subsubsection{Spectral peak energy, hardness-intensity correlation}\\label{sec:lower-epeak}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig10.pdf} \n \\end{center}\n \\caption{\\label{fig:epeak-thv} ${E_\\mathrm{peak}}$ at the pulse peak time for three jets with $R=10^{13}$ cm, ${\\theta_\\mathrm{jet}}=5^\\circ$ and three values of $\\Gamma$, namely (from red to green) $\\Gamma = 30$, $100$ and $300$. The black dashed lines are plots of $\\delta_B/2\\Gamma$ for the corresponding values of $\\Gamma$.  }\n\\end{figure}\n\nWith the same assumptions as in the on-axis case, we computed the spectra from the off-axis pulse at different times. The spectrum at each time is dominated by the part of the EATS with the strongest beaming. At time $t_{\\rm peak}$, such part is the border of the jet nearest to the observer, thus one expects ${E_\\mathrm{peak}}(t_{\\rm peak})$ to decrease with ${\\theta_\\mathrm{v}}$ as the Doppler factor of the jet border, {i.\\,e.\\xspace} ${E_\\mathrm{peak}}(t_{\\rm peak})\\propto \\delta_B$. Figure~\\ref{fig:epeak-thv} is a plot of ${E_\\mathrm{peak}}(t_{\\rm peak})$ for three values of $\\Gamma$, obtained by using Eq.~\\ref{eq:off-axis-spectrum} to compute the spectra, and it shows that indeed ${E_\\mathrm{peak}}$ is approximately proportional to $\\delta_B$. In general, ${E_\\mathrm{peak}}$ is a little lower than $\\delta_B {E_\\mathrm{peak}}'$ because of the ``blending in'' of softer spectra from less beamed parts of the jet.      \n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig11.pdf} \n \\end{center}\n \\caption{\\label{fig:epeak-off-axis} Logarithmic plot of ${E_\\mathrm{peak}}$ versus Flux of the same pulse seen at different off-axis viewing angles. The jet has ${\\theta_\\mathrm{jet}} = 5^\\circ$, $\\Gamma = 100$ and $R=10^{13}$ cm. The four series of points (from green to red) correspond to ${\\theta_\\mathrm{v}} = 5.1^\\circ$, $5.5^\\circ$, $6^\\circ$ and $7^\\circ$. The inset shows the slope of the relation during the decay of the pulse for each viewing angle.  }\n\\end{figure}\n\n\nFigure~\\ref{fig:epeak-off-axis} shows the evolution of ${E_\\mathrm{peak}}$ as a function of the flux $F$ during the pulse, for four different off-axis viewing angles. A ``hardness-intensity'' correlation during the pulse decay is still apparent, with a slightly steeper slope ($\\sim 0.5$) just after the pulse peak, getting shallower as the flux decreases and eventually reaching $\\sim 1/3$  as in the on-axis case. This slope difference is potentially a diagnostic of the viewing angle, whenever a sufficiently fine time resolved analysis is possible (there are other effects, though, which can affect this slope, as suggested {e.\\,g.\\xspace} in \\citet{Genet2009} and \\citet{Uhm2015}).\n\n\n\\subsubsection{Light curves}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig12.pdf} \n \\end{center}\n \\caption{\\label{fig:homogeneous-off-axis-lcs}  Light curves of a pulse from a homogeneous jet with ${\\theta_\\mathrm{jet}} = 5^o$ and $\\Gamma = 100$. Each curve refers to a different viewing angle in the sequence (from green to red) ${\\theta_\\mathrm{v}} = 5^o$, $5.2^o$,  $5.4^o$, $5.6^o$, $5.8^o$ and $6^o$.  $F_{\\rm max}$ refers to the on-axis jet. The inset shows the same curves plotted with logarithmic axes.}\n\\end{figure}\n\nFigure~\\ref{fig:homogeneous-off-axis-lcs} shows plots of bolometric light curves of the same pulse seen at different viewing angles, computed by numerical integration of Eq.~\\ref{eq:flux-offaxis} using a Runge-Kutta IV order scheme. Both the peak flux decrease and the duration increase discussed in \\S\\ref{sec:longer-duration} and \\S\\ref{sec:lower-flux} are apparent. The overall shape is qualitatively insensitive of the viewing angle, apart from the peak being sharper in the on-axis case.\n\n\n\\section{Multi-pulse light curves}\\label{sec:multipulse}\n\nSome non-trivial features emerge from the superposition of multiple pulses. Figure~\\ref{fig:offaxis-multi-lcs} shows four light curves of the same series of $N=100$ pulses seen at four different viewing angles. All pulses are equal in duration and peak flux. Their starting times have been sampled from a uniform distribution within a $2$ seconds time span. The jet parameters are $\\Gamma=100$, ${\\theta_\\mathrm{jet}}=5^\\circ$, $R=10^{13}$ cm and $\\Delta R = R$. The viewing angles are ${\\theta_\\mathrm{v}}=5.2^\\circ$, $5.6^\\circ$, $6.2^\\circ$ and $6.5^\\circ$. The comoving spectral shape is the same as before (Eq.~\\ref{eq:comov-spec-shape}). The resulting light curves have been binned at $32$ ms resolution for a better comparison with actual GRB light curves. For each light curve, the ${E_\\mathrm{peak}}$ of the spectrum in each time bin is also given (thin orange histograms). The following features should be apparent:\n\\begin{enumerate}\n \\item as the viewing angle increases, the variability is smeared out by the pulse width increase;\n \\item the shape of the overall light curve tends to resemble a (long) single pulse when the viewing angle is large enough;\n \\item the superposition of pulses masks the hard-to-soft spectral evolution of the single pulses, turning it into an intensity tracking behaviour;\n \\item the variation of ${E_\\mathrm{peak}}$ leads slightly the variation in flux;\n \\item there is a general softening of ${E_\\mathrm{peak}}$ in time over the entire light curve.\n\\end{enumerate}\nThese features are strikingly similar to those found in time resolved spectral analysis of real {Gamma-Ray Bursts\\xspace} \\citep[{e.\\,g.\\xspace}][]{Ford1995,Ghirlanda2002}. We do not advocate this as a proof of the correctness of our model, which is certainly oversimplified, but rather as a further indication that some features of GRB light curves might be explained admitting that the jet is seen at least slightly off-axis. The off-axis viewing angle would favour the broadening and superposition of pulses, which is the necessary ingredient to some of the features enumerated above, and would also explain in a simple way why the slope of the hardness-intensity correlation changes from burst to burst, being influenced by the viewing angle (\\S\\ref{sec:lower-epeak}).\n\n\\subsection{Single pulses \\textit{versus} pulse superposition}\nPoint (ii) above suggests that single broad pulses in GRB light curves might be actually the superposition of shorter pulses. Such a \\textit{caveat} has been pointed out before by \\citet{Genet2009}. Within our simple model, there is actually a very simple way to discern between the two cases: a true single pulse always displays a hard-to-soft spectral behaviour, while a pulse superposition results in an intensity-tracking behaviour. This is a potential diagnostic to distinguish real single pulsed GRBs.\n\n\\begin{figure*}\n \\begin{center}\n \\includegraphics[width=\\textwidth]{fig13.pdf} \n \\end{center}\n \\caption{\\label{fig:offaxis-multi-lcs}  Light curves (thick histograms) and spectral peak evolution (thin orange histograms) of a sequence of $100$ pulses from a homogeneous jet with ${\\theta_\\mathrm{jet}} = 5^o$, $\\Gamma = 100$ and $R=10^{13}$ cm. The peak of the $\\nu F_\\nu$ comoving spectrum is $E_{\\rm p}'=1$ keV. The pulse start times are randomly distributed within the first $2$ s of the observer time. Each panel refers to a different viewing angle in the sequence ${\\theta_\\mathrm{v}} = 5.2^o$, $5.6^o$, $6.2^o$, $6.5^o$ (from left to right, top to bottom).}\n\\end{figure*}\n\n\n\\subsection{Low luminosity GRBs}\\label{sec:low-lum-grbs}\nRecently, some authors \\citep[{e.\\,g.\\xspace}][]{Liang2007,Zhang2008,He2009,2011ApJ...739L..55B} argued that a unique population of low luminosity {Gamma-Ray Bursts\\xspace} exists, based on some common features of GRB060218, GRB980425, GRB031203 and GRB100316D. These features include, apart from the low inferred isotropic equivalent luminosity, an apparently single pulsed, smooth light curve (low variability), and a low average ${E_\\mathrm{peak}}$. Since all such bursts were at a low redshift, the rate of like events per unit comoving volume in the Universe is very high (higher that that of ``normal'' GRBs), but we do not see the majority of these events because of selection effects.\nThe results discussed in this paper suggest that the apparently peculiar features of these GRBs can be interpreted instead as being just the indication that they were observed off-axis: figure~\\ref{fig:offaxis-multi-lcs} together with results from the preceding sections show that their features are expected in the case of a jet seen off-axis. Moreover, in \\cite{2015MNRAS.447.1911P} we have shown that the observed rate of low luminosity GRBs is consistent with what one would expect if they were just ordinary bursts seen off-axis (taking into account the fact that the de-beamed flux can still be above the instrument sensitivity if the off-axis viewing angle is not too large). Based on these considerations, we argue that there is no need to invoke a new separate population of low luminosity GRBs.\n\n\\section{Discussion and Conclusions}\\label{sec:conclusions}\n\n\nIn this work we set up a simple physical model of a single GRB pulse based on shell curvature and relativistic effects only. Compared to other similar (and more refined) models \\citep{Ryde2002,Dermer2004,Genet2009}, our model includes for the first time the effect of an off-axis viewing angle. The inclusion of such effect is of primary importance, because the probability to observe GRBs (slightly) off-axis is very high, given the typically narrow opening angle of their jets. Admittedly, the assumptions behind the model are at best a very rough approximation of reality: for example, the surface of a real jet is unlikely to be perfectly spherical; the jet borders are certainly not sharp; the emitting region is a volume, not a surface; the turning-on and turning-off of the emitting region can not be as sudden as assumed. Nevertheless, there are at least two reasons to take seriously the results of this simplified treatment: (i) all predictions are based on solid arguments which can be understood intuitively, and (ii) the general trend of the effect of the off-axis viewing angle does not depend on the simplifications adopted.\n\nGiven the above considerations, we divide our conclusions in two parts: those which are solid and do not depend much on the assumptions behind the model, and those which could change significantly if more realistic assumptions were made.\n\n\\begin{enumerate}\n \\item Solid conclusions:\n    \\begin{enumerate}\n    \\item if the GRB jet is seen off-axis, single pulses appear longer and their spectrum appears softer than in the on-axis case;\n    \\item during the decay of the pulse, flux and spectral peak energy decrease in a correlated way, and the correlation is influenced by the viewing angle;\n    \\item if a burst is made up of a superposition of pulses, its variability is smeared out by pulse broadening if the jet is observed off-axis, with respect to the on-axis case;\n    \\end{enumerate}\n\n \\item Conclusions that might be affected significantly by a change in the assumptions:\n    \\begin{enumerate}\n    \\item the spectral evolution during a single pulse is always hard-to-soft. An ``intensity-tracking'' behaviour can be obtained by superposition of pulses, especially if the viewing angle is off-axis, so that broadening of pulses favours their superposition;\n    \\item the shape of a pulse is qualitatively insensitive of the viewing angle.\n    \\end{enumerate}\n\\end{enumerate}\n\nWe plan to explore the effect of including an axisymmetric jet structure in the model (Salafia et al., in preparation) to test to which extent our results can be extended to the more realistic case of a jet with smooth borders.\n\nAs discussed in \\S\\ref{sec:low-lum-grbs}, the results support the idea that prompt emission properties of so-called low luminosity GRBs can be interpreted as indications that they are just ordinary bursts seen off-axis.\n\n\n\\section*{Acknowledgements}\n\nO. S. Salafia thanks the \\textit{Swift} group at the Astronomical Observatory of Brera - Merate for useful discussions.  \n \n\\section*{References}\n\n\\footnotesize{\n\\bibliographystyle{mn2e}\n\\bibliography{journals,bibtex}}\n\n\\appendix\n\n\\section{Derivation of the pulse light curve and spectrum}\n\nIn what follows, we give a detailed derivation of the general formulas for the pulse light curve and time dependent spectrum. A generalization for an axisymmetric, structured jet is possible, as we will show in a following work (Salafia et al., in preparation).\n\n\n\\subsection{Light curve of the pulse from an expanding sphere}\\label{sec:exp-sphere}\nIn general, the flux from a time-varying source can be defined as\n\n", "index": 27, "text": "\\begin{equation}\n F(t) = \\int_{S(t)}I(s)\\cos\\alpha\\,ds/r^2\n \\label{eq:flux-moving-source}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"F(t)=\\int_{S(t)}I(s)\\cos\\alpha\\,ds/r^{2}\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mi>α</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow><mo>/</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nSince $d\\gg R(t_e)$, the last term is well approximated by $R(t_e)^2/d^2$, thus we can write\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nwhere $S(t)$ is the ``$t$-equal arrival time surface'' (EATS hereafter), {i.\\,e.\\xspace} the locus of points of the source whose emitted photons reach the observer at $t$,  $r$ is the distance between the observer and the element $ds$ of the EATS, and $\\alpha$ is the angle between the normal to the detector surface and the direction of the photon incoming from the $ds$ surface element. For most astrophysical applications $\\cos\\alpha\\sim 1$, because the source is sufficiently far away to have a negligible angular size in the sky. Here the intensity $I(s)$ is allowed to vary both in time and in space ($s$ indicates the coordinates of a point on the EATS, which is a surface in spacetime), so this formulation is applicable to inhomogeneous sources as well.\n\nIn our situation, it is convenient to use spherical coordinates centered on the emitting sphere, so that (assuming cylindrical symmetry of the intensity) we have $ds = 2\\pi\\sin\\theta\\,d\\theta\\,R(t_e)^2$, where $t_e=t-r/c$ is the emission time. The distance $r$ of the point $(\\theta,\\phi,t_e)$ from the detector is $r\\approx d-R(t_e)\\cos\\theta$ where $d$ is the distance of the sphere center from the detector, thus\n\n", "index": 29, "text": "\\begin{equation}\n F(t) = 2\\pi\\int_{S(t)} I(\\theta,t_e)\\sin\\theta\\,d\\theta \\dfrac{R(t_e)^2}{(d-R(t_e)\\cos\\theta)^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"F(t)=2\\pi\\int_{S(t)}I(\\theta,t_{e})\\sin\\theta\\,d\\theta\\dfrac{R(t_{e})^{2}}{(d-%&#10;R(t_{e})\\cos\\theta)^{2}}\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi><mo>⁢</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>d</mi><mo>-</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n\nLet us now assume that the luminosity $L$ of the sphere is constant in the time interval $t_0<t<t_0+T$ (this is the case, {e.\\,g.\\xspace}, if there is a fixed number of emitters per unit solid angle, and they emit a constant luminosity each). This is different from assuming that the intensity is constant, in that it prevents the expansion of the surface area from causing a rise in the luminosity (this alternative assumption would be more appropriate in the description of an external shock). In terms of intensity, this assumption implies that $I\\propto R^{-2}$, which we write as\n\n", "itemtype": "equation", "pos": 46329, "prevtext": " \nSince $d\\gg R(t_e)$, the last term is well approximated by $R(t_e)^2/d^2$, thus we can write\n\n", "index": 31, "text": "\\begin{equation}\n F(t) = \\dfrac{2\\pi}{d^2}\\int_{S(t)} I(\\theta,t_e)\\,R(t_e)^2\\,\\sin\\theta\\,d\\theta\n \\label{eq:flux-partial}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"F(t)=\\dfrac{2\\pi}{d^{2}}\\int_{S(t)}I(\\theta,t_{e})\\,R(t_{e})^{2}\\,\\sin\\theta\\,d\\theta\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>t</mi><mi>e</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mpadded><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nInserting this definition into Eq.~\\ref{eq:flux-partial} allows us to bring the radius outside the integral. In sections \\S\\ref{sec:eats-sphere} and \\S\\ref{sec:eats-exp-sphere}, we found that the EATS are the portions of the sphere comprised between $\\cos\\theta_{\\rm on}$ and $\\cos\\theta_{\\rm off}$, so that we have, for $t>0$\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nLet us now assume that the luminosity $L$ of the sphere is constant in the time interval $t_0<t<t_0+T$ (this is the case, {e.\\,g.\\xspace}, if there is a fixed number of emitters per unit solid angle, and they emit a constant luminosity each). This is different from assuming that the intensity is constant, in that it prevents the expansion of the surface area from causing a rise in the luminosity (this alternative assumption would be more appropriate in the description of an external shock). In terms of intensity, this assumption implies that $I\\propto R^{-2}$, which we write as\n\n", "index": 33, "text": "\\begin{equation}\n I(\\theta,t_e) = I_0(\\theta)\\,\\dfrac{R^2}{R^2(t_e)}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"I(\\theta,t_{e})=I_{0}(\\theta)\\,\\dfrac{R^{2}}{R^{2}(t_{e})}\" display=\"block\"><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>I</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><msup><mi>R</mi><mn>2</mn></msup><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nNow, since the sphere is expanding, the intensity is related to the comoving one by $I_0(\\theta)=\\delta^4(\\theta)\\,I_0'$, where $\\delta(\\theta)=\\left[\\Gamma (1-\\beta\\cos\\theta)\\right]^{-1}$ is the Doppler factor, and $I_0'$ is the comoving intensity, assumed isotropic.\nThe flux is then\n\n", "itemtype": "equation", "pos": 47467, "prevtext": " \nInserting this definition into Eq.~\\ref{eq:flux-partial} allows us to bring the radius outside the integral. In sections \\S\\ref{sec:eats-sphere} and \\S\\ref{sec:eats-exp-sphere}, we found that the EATS are the portions of the sphere comprised between $\\cos\\theta_{\\rm on}$ and $\\cos\\theta_{\\rm off}$, so that we have, for $t>0$\n\n\n", "index": 35, "text": "\\begin{equation}\n  F(t) = \\dfrac{2\\pi\\,R^2}{d^2}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(t)} I_0(\\theta)\\,\\sin\\theta\\,d\\theta\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"F(t)=\\dfrac{2\\pi\\,R^{2}}{d^{2}}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(t)}%&#10;I_{0}(\\theta)\\,\\sin\\theta\\,d\\theta\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>θ</mi><mi>off</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>θ</mi><mi>on</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup><mrow><msub><mi>I</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhich yields, after substitution of the expressions for $\\cos\\theta_{\\rm on}$ and $\\cos\\theta_{\\rm off}$ derived above, the light curve of the pulse\n\n", "itemtype": "equation", "pos": 47898, "prevtext": "\nNow, since the sphere is expanding, the intensity is related to the comoving one by $I_0(\\theta)=\\delta^4(\\theta)\\,I_0'$, where $\\delta(\\theta)=\\left[\\Gamma (1-\\beta\\cos\\theta)\\right]^{-1}$ is the Doppler factor, and $I_0'$ is the comoving intensity, assumed isotropic.\nThe flux is then\n\n", "index": 37, "text": "\\begin{equation}\n  F(t) = \\dfrac{2\\pi\\,R^2}{d^2}\\dfrac{I_0'}{\\Gamma^4}\\int_{\\cos\\theta_{\\rm on}(t)}^{\\cos\\theta_{\\rm off}(t)} \\dfrac{d\\cos\\theta}{\\left(1-\\beta\\cos\\theta\\right)^4}\n  \\label{eq:sphere-flux-integral}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"F(t)=\\dfrac{2\\pi\\,R^{2}}{d^{2}}\\dfrac{I_{0}^{\\prime}}{\\Gamma^{4}}\\int_{\\cos%&#10;\\theta_{\\rm on}(t)}^{\\cos\\theta_{\\rm off}(t)}\\dfrac{d\\cos\\theta}{\\left(1-\\beta%&#10;\\cos\\theta\\right)^{4}}\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msup><mi mathvariant=\"normal\">Γ</mi><mn>4</mn></msup></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>on</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>off</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow><mn>4</mn></msup></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhere\n\n", "itemtype": "equation", "pos": 48276, "prevtext": "\nwhich yields, after substitution of the expressions for $\\cos\\theta_{\\rm on}$ and $\\cos\\theta_{\\rm off}$ derived above, the light curve of the pulse\n\n", "index": 39, "text": "\\begin{equation}\n F(t) = F_{\\rm max} \\times \\left\\lbrace \\begin{array}{lr}\n                                    1 - \\dfrac{1}{\\left(1+\\dfrac{t}{\\tau} \\right)^3} & t\\leq {t_{\\mathrm{off}}}\\\\\n                                    \\dfrac{1}{\\left(1+\\dfrac{t-{t_{\\mathrm{off}}}}{\\tau + t_{\\rm off}} \\right)^3} - \\dfrac{1}{\\left(1+\\dfrac{t}{\\tau} \\right)^3} & t>{t_{\\mathrm{off}}}\n                                    \\end{array}\\right.\\label{eq:pulse-sphere}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"F(t)=F_{\\rm max}\\times\\left\\{\\begin{array}[]{lr}1-\\dfrac{1}{\\left(1+\\dfrac{t}{%&#10;\\tau}\\right)^{3}}&amp;t\\leq{t_{\\mathrm{off}}}\\\\&#10;\\dfrac{1}{\\left(1+\\dfrac{t-{t_{\\mathrm{off}}}}{\\tau+t_{\\rm off}}\\right)^{3}}-%&#10;\\dfrac{1}{\\left(1+\\dfrac{t}{\\tau}\\right)^{3}}&amp;t&gt;{t_{\\mathrm{off}}}\\end{array}\\right.\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>F</mi><mi>max</mi></msub><mo>×</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>t</mi><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mtd><mtd columnalign=\"right\"><mrow><mi>t</mi><mo>≤</mo><msub><mi>t</mi><mi>off</mi></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mi>off</mi></msub></mrow><mrow><mi>τ</mi><mo>+</mo><msub><mi>t</mi><mi>off</mi></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>t</mi><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mtd><mtd columnalign=\"right\"><mrow><mi>t</mi><mo>&gt;</mo><msub><mi>t</mi><mi>off</mi></msub></mrow></mtd></mtr></mtable><mi/></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nis the (saturation) peak flux if the pulse lasts $T\\gg R/c$,\n\n", "itemtype": "equation", "pos": 48748, "prevtext": "\nwhere\n\n", "index": 41, "text": "\\begin{equation}\n F_{\\rm max}=\\dfrac{2\\pi\\,R^2}{3 d^2}\\dfrac{(1+\\beta)^3\\,\\Gamma^2\\,I_0'}{\\beta}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"F_{\\rm max}=\\dfrac{2\\pi\\,R^{2}}{3d^{2}}\\dfrac{(1+\\beta)^{3}\\,\\Gamma^{2}\\,I_{0}%&#10;^{\\prime}}{\\beta}\" display=\"block\"><mrow><msub><mi>F</mi><mi>max</mi></msub><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><mrow><mn>3</mn><mo>⁢</mo><msup><mi>d</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup></mrow><mi>β</mi></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nand \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nis the (saturation) peak flux if the pulse lasts $T\\gg R/c$,\n\n", "index": 43, "text": "\\begin{equation}\n \\tau = \\dfrac{R}{\\beta c(1+\\beta)\\Gamma^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\tau=\\dfrac{R}{\\beta c(1+\\beta)\\Gamma^{2}}\" display=\"block\"><mrow><mi>τ</mi><mo>=</mo><mfrac><mi>R</mi><mrow><mi>β</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nThe fluence, {i.\\,e.\\xspace} integral of the flux over time, from $t=0$ to $t\\to \\infty$ is\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nand \n\n", "index": 45, "text": "\\begin{equation}\n {t_{\\mathrm{off}}}  = \\dfrac{T}{(1+\\beta)\\Gamma^2} = \\dfrac{\\Delta R}{\\beta c(1+\\beta)\\Gamma^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"{t_{\\mathrm{off}}}=\\dfrac{T}{(1+\\beta)\\Gamma^{2}}=\\dfrac{\\Delta R}{\\beta c(1+%&#10;\\beta)\\Gamma^{2}}\" display=\"block\"><mrow><msub><mi>t</mi><mi>off</mi></msub><mo>=</mo><mfrac><mi>T</mi><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mrow></mfrac><mo>=</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>R</mi></mrow><mrow><mi>β</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>2</mn></msup></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \n\nIt is worth noting that the light curve parameters are three, {i.\\,e.\\xspace} $\\tau$, ${t_{\\mathrm{off}}}$ and $F_{\\rm max}$, while the underlying physical parameters are four, namely $R$, $T$, $\\Gamma$ and $I_0'$. This degeneration leads to the impossibility to determine all the physical parameters by fitting the pulse shape to an observed light curve.\n\n\n\n\\subsection{Light curve of the pulse from an on-axis jet with ${\\theta_\\mathrm{jet}}\\lesssim1/\\Gamma$}\\label{sec:onaxis-jet-appendix}\n\nTo compute the pulse light curve of a homogeneous jet of semiaperture $\\theta_{jet}$, we can just take the pulse of the sphere and ``trim'' the unwanted part. If the jet is seen on-axis, this amounts to limit the integral of Eq.~\\ref{eq:sphere-flux-integral} to angles $\\theta < \\theta_{jet}$. It is straightforward to work out at what time the EATS borders reach the jet border, {i.\\,e.\\xspace}\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nThe fluence, {i.\\,e.\\xspace} integral of the flux over time, from $t=0$ to $t\\to \\infty$ is\n\n", "index": 47, "text": "\\begin{equation}\n\\mathcal{F} = F_{\\rm max}\\times\\dfrac{3}{2}t_{\\rm off} = \\dfrac{\\pi\\,R^2}{d^2}\\dfrac{(1+\\beta)^2}{\\beta}\\,I_0'T \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{F}=F_{\\rm max}\\times\\dfrac{3}{2}t_{\\rm off}=\\dfrac{\\pi\\,R^{2}}{d^{2}}%&#10;\\dfrac{(1+\\beta)^{2}}{\\beta}\\,I_{0}^{\\prime}T\" display=\"block\"><mrow><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mo>=</mo><mrow><mrow><msub><mi>F</mi><mi>max</mi></msub><mo>×</mo><mfrac><mn>3</mn><mn>2</mn></mfrac></mrow><mo>⁢</mo><msub><mi>t</mi><mi>off</mi></msub></mrow><mo>=</mo><mrow><mfrac><mrow><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mi>β</mi></mfrac></mpadded><mo>⁢</mo><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><mo>⁢</mo><mi>T</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nand similarly \n\n", "itemtype": "equation", "pos": -1, "prevtext": " \n\nIt is worth noting that the light curve parameters are three, {i.\\,e.\\xspace} $\\tau$, ${t_{\\mathrm{off}}}$ and $F_{\\rm max}$, while the underlying physical parameters are four, namely $R$, $T$, $\\Gamma$ and $I_0'$. This degeneration leads to the impossibility to determine all the physical parameters by fitting the pulse shape to an observed light curve.\n\n\n\n\\subsection{Light curve of the pulse from an on-axis jet with ${\\theta_\\mathrm{jet}}\\lesssim1/\\Gamma$}\\label{sec:onaxis-jet-appendix}\n\nTo compute the pulse light curve of a homogeneous jet of semiaperture $\\theta_{jet}$, we can just take the pulse of the sphere and ``trim'' the unwanted part. If the jet is seen on-axis, this amounts to limit the integral of Eq.~\\ref{eq:sphere-flux-integral} to angles $\\theta < \\theta_{jet}$. It is straightforward to work out at what time the EATS borders reach the jet border, {i.\\,e.\\xspace}\n\n", "index": 49, "text": "\\begin{equation}\n \\theta_{\\rm on}(t) = \\theta_{jet} \\implies t = R(1-\\cos\\theta_{jet})/c \\equiv t_{\\rm jet}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\theta_{\\rm on}(t)=\\theta_{jet}\\implies t=R(1-\\cos\\theta_{jet})/c\\equiv t_{\\rm&#10;jet}\" display=\"block\"><mrow><mrow><msub><mi>θ</mi><mi>on</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msub><mi>θ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⟹</mo><mi>t</mi><mo>=</mo><mrow><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mi>c</mi></mrow><mo>≡</mo><msub><mi>t</mi><mi>jet</mi></msub></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhere $R_{\\rm off} \\equiv R + \\Delta R$.\nIt is then easy to see that the light curve becomes\n\n", "itemtype": "equation", "pos": 50401, "prevtext": " \nand similarly \n\n", "index": 51, "text": "\\begin{equation}\n \\theta_{\\rm off}(t) = \\theta_{jet} \\implies t = {t_{\\mathrm{off}}} + R_{\\rm off}(1-\\cos\\theta_{jet})/c \\equiv t_{\\rm jet,off}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\theta_{\\rm off}(t)=\\theta_{jet}\\implies t={t_{\\mathrm{off}}}+R_{\\rm off}(1-%&#10;\\cos\\theta_{jet})/c\\equiv t_{\\rm jet,off}\" display=\"block\"><mrow><mrow><msub><mi>θ</mi><mi>off</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msub><mi>θ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⟹</mo><mi>t</mi><mo>=</mo><mrow><msub><mi>t</mi><mi>off</mi></msub><mo>+</mo><mrow><mrow><msub><mi>R</mi><mi>off</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mi>c</mi></mrow></mrow><mo>≡</mo><msub><mi>t</mi><mrow><mi>jet</mi><mo>,</mo><mi>off</mi></mrow></msub></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nfor $t\\leq {t_{\\mathrm{off}}}$, then\n\n", "itemtype": "equation", "pos": 50653, "prevtext": "\nwhere $R_{\\rm off} \\equiv R + \\Delta R$.\nIt is then easy to see that the light curve becomes\n\n", "index": 53, "text": "\\begin{equation}\n \\dfrac{F(t)}{F_{\\rm max}} =  1 - \\dfrac{1}{\\left(1+\\dfrac{\\min(t,t_{\\rm jet})}{\\tau} \\right)^3}\n \\label{eq:pulse-thj-1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{F(t)}{F_{\\rm max}}=1-\\dfrac{1}{\\left(1+\\dfrac{\\min(t,t_{\\rm jet})}{\\tau%&#10;}\\right)^{3}}\" display=\"block\"><mrow><mfrac><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>F</mi><mi>max</mi></msub></mfrac><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>min</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>,</mo><msub><mi>t</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nfor ${t_{\\mathrm{off}}}<t<t_{\\rm jet,off}$, and zero for $t\\geq t_{\\rm jet,off}$.\nThis light curve is the same as that of the expanding sphere up to $t=t_{\\rm jet}$. After that, if $t_{\\rm jet}<{t_{\\mathrm{off}}}$ the flux saturates (the whole jet is visible) until $t={t_{\\mathrm{off}}}$, then it drops and reaches zero at $t=t_{\\rm jet,off}$. If $t_{\\rm jet}\\geq {t_{\\mathrm{off}}}$ no saturation is reached. The difference between the expanding sphere and the on-axis homogeneous jet is relevant only if $t_{\\rm jet}\\lesssim \\tau$, {i.\\,e.\\xspace} if ${\\theta_\\mathrm{jet}}\\lesssim 1/\\Gamma$, as expected.\n\n\\subsection{Off-axis jet}\\label{sec:offaxis-appendix}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig14.pdf} \n \\end{center}\n \\caption{\\label{fig:geom4}  The off-axis jet can be thought of as being part of an expanding sphere. The axes in the figures above are chosen so that the jet axis lies on the $z$-$x$ plane.  Jet surface elements in the $S$ shaded part all share the same Doppler factor $\\delta$, and thus they all give the same contribution (per unit emitting area) to the flux. For this reason, the ratio of the flux from the annulus to the flux from $S$ is just equal to the ratio of the corresponding surface areas. \\textbf{Left:} the jet is seen from the $z$-axis. The $y$-coordinate $y_i$ of the interceptions between the annulus and the jet border is shown. \\textbf{Right:} the jet is seen from the $x$-axis. Angles ${\\theta_\\mathrm{v}}$, ${\\theta_\\mathrm{jet}}$ and $\\theta$ are reported.}\n\\end{figure}\n\nIf the jet is off-axis, it is still possible to compute an expression for the light curve, with a little geometrical reasoning. Let us call ${\\theta_\\mathrm{v}}$ the angle between the jet axis and the line of sight, ${\\theta_\\mathrm{jet}}$ the jet half-opening angle, and let us set the coordinate system so that the jet axis lies in the $z-x$ plane, as in Fig.~\\ref{fig:geom4}. This is what one would obtain by taking an on-axis jet and rotating it counter-clockwise by an angle ${\\theta_\\mathrm{v}}$ around the $x$ axis.\nLet us now consider the ring-shaped part of the sphere surface (``annulus'' hereafter) comprised between $\\theta$ and $\\theta+d\\theta$. If $\\theta > |{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}|$, a portion $S$ of the annulus lies on the jet surface (shaded part in Fig.~\\ref{fig:geom4}). Since the annulus width $d\\theta$ is infinitesimal, the ratio of the area of $S$ to the total annulus area is equal to the ratio between the length $l$ of $S$ and the total annulus length $2\\pi\\,R\\cos\\theta$. Moreover, this is also equal to the ratio of the flux $dF_S$ from $S$ to the flux $dF_a$ from the whole annulus, namely\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nfor $t\\leq {t_{\\mathrm{off}}}$, then\n\n", "index": 55, "text": "\\begin{equation}\n   \\dfrac{F(t)}{F_{\\rm max}} = \\dfrac{1}{\\left(1+\\dfrac{t-{t_{\\mathrm{off}}}}{\\tau_{\\rm off}} \\right)^3} - \\dfrac{1}{\\left(1+\\dfrac{\\min(t,t_{\\rm jet})}{\\tau} \\right)^3}\n   \\label{eq:pulse-thj-2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{F(t)}{F_{\\rm max}}=\\dfrac{1}{\\left(1+\\dfrac{t-{t_{\\mathrm{off}}}}{\\tau_%&#10;{\\rm off}}\\right)^{3}}-\\dfrac{1}{\\left(1+\\dfrac{\\min(t,t_{\\rm jet})}{\\tau}%&#10;\\right)^{3}}\" display=\"block\"><mrow><mfrac><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>F</mi><mi>max</mi></msub></mfrac><mo>=</mo><mrow><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mi>off</mi></msub></mrow><msub><mi>τ</mi><mi>off</mi></msub></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>min</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>,</mo><msub><mi>t</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \n\nThe flux due to the annulus is easily obtained by deriving the flux of the sphere, Eq.~\\ref{eq:sphere-flux-integral}, with respect to $\\theta$, which gives\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nfor ${t_{\\mathrm{off}}}<t<t_{\\rm jet,off}$, and zero for $t\\geq t_{\\rm jet,off}$.\nThis light curve is the same as that of the expanding sphere up to $t=t_{\\rm jet}$. After that, if $t_{\\rm jet}<{t_{\\mathrm{off}}}$ the flux saturates (the whole jet is visible) until $t={t_{\\mathrm{off}}}$, then it drops and reaches zero at $t=t_{\\rm jet,off}$. If $t_{\\rm jet}\\geq {t_{\\mathrm{off}}}$ no saturation is reached. The difference between the expanding sphere and the on-axis homogeneous jet is relevant only if $t_{\\rm jet}\\lesssim \\tau$, {i.\\,e.\\xspace} if ${\\theta_\\mathrm{jet}}\\lesssim 1/\\Gamma$, as expected.\n\n\\subsection{Off-axis jet}\\label{sec:offaxis-appendix}\n\n\\begin{figure}\n \\begin{center}\n \\includegraphics[width=\\columnwidth]{fig14.pdf} \n \\end{center}\n \\caption{\\label{fig:geom4}  The off-axis jet can be thought of as being part of an expanding sphere. The axes in the figures above are chosen so that the jet axis lies on the $z$-$x$ plane.  Jet surface elements in the $S$ shaded part all share the same Doppler factor $\\delta$, and thus they all give the same contribution (per unit emitting area) to the flux. For this reason, the ratio of the flux from the annulus to the flux from $S$ is just equal to the ratio of the corresponding surface areas. \\textbf{Left:} the jet is seen from the $z$-axis. The $y$-coordinate $y_i$ of the interceptions between the annulus and the jet border is shown. \\textbf{Right:} the jet is seen from the $x$-axis. Angles ${\\theta_\\mathrm{v}}$, ${\\theta_\\mathrm{jet}}$ and $\\theta$ are reported.}\n\\end{figure}\n\nIf the jet is off-axis, it is still possible to compute an expression for the light curve, with a little geometrical reasoning. Let us call ${\\theta_\\mathrm{v}}$ the angle between the jet axis and the line of sight, ${\\theta_\\mathrm{jet}}$ the jet half-opening angle, and let us set the coordinate system so that the jet axis lies in the $z-x$ plane, as in Fig.~\\ref{fig:geom4}. This is what one would obtain by taking an on-axis jet and rotating it counter-clockwise by an angle ${\\theta_\\mathrm{v}}$ around the $x$ axis.\nLet us now consider the ring-shaped part of the sphere surface (``annulus'' hereafter) comprised between $\\theta$ and $\\theta+d\\theta$. If $\\theta > |{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}|$, a portion $S$ of the annulus lies on the jet surface (shaded part in Fig.~\\ref{fig:geom4}). Since the annulus width $d\\theta$ is infinitesimal, the ratio of the area of $S$ to the total annulus area is equal to the ratio between the length $l$ of $S$ and the total annulus length $2\\pi\\,R\\cos\\theta$. Moreover, this is also equal to the ratio of the flux $dF_S$ from $S$ to the flux $dF_a$ from the whole annulus, namely\n\n", "index": 57, "text": "\\begin{equation}\n \\dfrac{dF_{S}(\\theta)}{dF_{a}(\\theta)} = \\dfrac{l(\\theta)}{2\\pi\\,R\\cos\\theta}\n \\label{eq:ratios}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{dF_{S}(\\theta)}{dF_{a}(\\theta)}=\\dfrac{l(\\theta)}{2\\pi\\,R\\cos\\theta}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>F</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>F</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mfrac><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n\nTo compute the length $l(\\theta)$, we must first find the interceptions between the annulus and the jet border. Both are circles on the sphere surface, {i.\\,e.\\xspace} they lie on the surface $x^2+y^2+z^2=R^2$. The annulus is the circle given by the interception between the plane $z=R\\cos\\theta$ and the sphere; in a coordinate system $K'$ where the $z'$ axis coincides with the jet axis, the jet border is the circle given by the interception between the plane $z'=R\\cos{\\theta_\\mathrm{jet}}$ and the sphere. Applying a rotation of an angle ${\\theta_\\mathrm{v}}$ around the $x$ axis, this plane becomes $z\\cos{\\theta_\\mathrm{v}} - y\\sin{\\theta_\\mathrm{v}} = R\\cos{\\theta_\\mathrm{jet}}$. The interceptions between the two circles are then found by solving the linear system\n\n", "itemtype": "equation", "pos": 54054, "prevtext": " \n\nThe flux due to the annulus is easily obtained by deriving the flux of the sphere, Eq.~\\ref{eq:sphere-flux-integral}, with respect to $\\theta$, which gives\n\n", "index": 59, "text": "\\begin{equation}\n dF_{a}(\\theta)=\\dfrac{dF}{d\\theta}d\\theta=\\dfrac{2\\pi\\,R^2}{d^2}\\dfrac{I_0'}{\\Gamma^4}\\dfrac{\\sin\\theta\\,d\\theta}{\\left(1-\\beta\\cos\\theta\\right)^4}\n \\label{eq:fannulus}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"dF_{a}(\\theta)=\\dfrac{dF}{d\\theta}d\\theta=\\dfrac{2\\pi\\,R^{2}}{d^{2}}\\dfrac{I_{%&#10;0}^{\\prime}}{\\Gamma^{4}}\\dfrac{\\sin\\theta\\,d\\theta}{\\left(1-\\beta\\cos\\theta%&#10;\\right)^{4}}\" display=\"block\"><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>F</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msup><mi mathvariant=\"normal\">Γ</mi><mn>4</mn></msup></mfrac><mo>⁢</mo><mfrac><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow><mn>4</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nThe $y$ coordinate of the interceptions (see Fig.~\\ref{fig:geom4}) is found to be\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nTo compute the length $l(\\theta)$, we must first find the interceptions between the annulus and the jet border. Both are circles on the sphere surface, {i.\\,e.\\xspace} they lie on the surface $x^2+y^2+z^2=R^2$. The annulus is the circle given by the interception between the plane $z=R\\cos\\theta$ and the sphere; in a coordinate system $K'$ where the $z'$ axis coincides with the jet axis, the jet border is the circle given by the interception between the plane $z'=R\\cos{\\theta_\\mathrm{jet}}$ and the sphere. Applying a rotation of an angle ${\\theta_\\mathrm{v}}$ around the $x$ axis, this plane becomes $z\\cos{\\theta_\\mathrm{v}} - y\\sin{\\theta_\\mathrm{v}} = R\\cos{\\theta_\\mathrm{jet}}$. The interceptions between the two circles are then found by solving the linear system\n\n", "index": 61, "text": "\\begin{equation}\n \\left\\lbrace\\begin{array}{l}\n              x^2+y^2+z^2=R^2\\\\\n              z=R\\cos\\theta\\\\\n              z\\cos{\\theta_\\mathrm{v}} - y\\sin{\\theta_\\mathrm{v}} = R\\cos{\\theta_\\mathrm{jet}}\\\\\n             \\end{array}\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\left\\{\\begin{array}[]{l}x^{2}+y^{2}+z^{2}=R^{2}\\\\&#10;z=R\\cos\\theta\\\\&#10;z\\cos{\\theta_{\\mathrm{v}}}-y\\sin{\\theta_{\\mathrm{v}}}=R\\cos{\\theta_{\\mathrm{%&#10;jet}}}\\\\&#10;\\end{array}\\right.\" display=\"block\"><mrow><mo>{</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msup><mi>x</mi><mn>2</mn></msup><mo>+</mo><msup><mi>y</mi><mn>2</mn></msup><mo>+</mo><msup><mi>z</mi><mn>2</mn></msup></mrow><mo>=</mo><msup><mi>R</mi><mn>2</mn></msup></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mi>z</mi><mo>=</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mi>z</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow><mo>-</mo><mrow><mi>y</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mrow><mo>=</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow></mrow></mrow></mtd></mtr></mtable><mi/></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nConsider now the annulus as a circle whose center lies on the $z=R\\cos\\theta$ plane. Its radius is $R\\sin\\theta$, and the angle $\\alpha$ that subtends S is $\\alpha = 2\\arccos\\left(-y_i/R\\sin\\theta\\right)$.  The length $l(\\theta)$ is then\n\n", "itemtype": "equation", "pos": 55368, "prevtext": " \nThe $y$ coordinate of the interceptions (see Fig.~\\ref{fig:geom4}) is found to be\n\n", "index": 63, "text": "\\begin{equation}\n y_i = \\dfrac{\\cos\\theta\\cos{\\theta_\\mathrm{v}}-\\cos{\\theta_\\mathrm{jet}}}{\\sin{\\theta_\\mathrm{v}}}R\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"y_{i}=\\dfrac{\\cos\\theta\\cos{\\theta_{\\mathrm{v}}}-\\cos{\\theta_{\\mathrm{jet}}}}{%&#10;\\sin{\\theta_{\\mathrm{v}}}}R\" display=\"block\"><mrow><msub><mi>y</mi><mi>i</mi></msub><mo>=</mo><mrow><mfrac><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow></mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mfrac><mo>⁢</mo><mi>R</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nSubstituting Eqs.~\\ref{eq:fannulus} and \\ref{eq:l} into Eq.~\\ref{eq:ratios}, we conclude that\n\n", "itemtype": "equation", "pos": 55739, "prevtext": "\nConsider now the annulus as a circle whose center lies on the $z=R\\cos\\theta$ plane. Its radius is $R\\sin\\theta$, and the angle $\\alpha$ that subtends S is $\\alpha = 2\\arccos\\left(-y_i/R\\sin\\theta\\right)$.  The length $l(\\theta)$ is then\n\n", "index": 65, "text": "\\begin{equation}\n l(\\theta) = 2 R \\sin\\theta \\arccos\\left(\\dfrac{\\cos{\\theta_\\mathrm{jet}} - \\cos\\theta\\cos{\\theta_\\mathrm{v}}}{\\sin\\theta\\sin{\\theta_\\mathrm{v}}}\\right)\n \\label{eq:l}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"l(\\theta)=2R\\sin\\theta\\arccos\\left(\\dfrac{\\cos{\\theta_{\\mathrm{jet}}}-\\cos%&#10;\\theta\\cos{\\theta_{\\mathrm{v}}}}{\\sin\\theta\\sin{\\theta_{\\mathrm{v}}}}\\right)\" display=\"block\"><mrow><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mi>θ</mi><mo>⁢</mo><mrow><mi>arccos</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo>-</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nThis is valid as long as the interceptions between the annulus and S exist, {i.\\,e.\\xspace} for $|{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}|<\\theta<{\\theta_\\mathrm{v}}+{\\theta_\\mathrm{jet}}$. Let us work out the remaining cases:\n\\begin{itemize}\n \\item if ${\\theta_\\mathrm{v}}<{\\theta_\\mathrm{jet}}$, {i.\\,e.\\xspace} if line of sight is inside the jet border, then for $\\theta<{\\theta_\\mathrm{jet}}-{\\theta_\\mathrm{v}}$ also the annulus is inside the jet border, thus $dF_S(\\theta) = dF_a(\\theta)$;\n \\item if ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$, {i.\\,e.\\xspace} if line of sight is outside the jet border, then for $\\theta<{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}$ the annulus is too small to intercept the jet border, thus $dF_S(\\theta)=0$;\n in either case, if $\\theta>{\\theta_\\mathrm{v}}+{\\theta_\\mathrm{jet}}$ the annulus is too large to intercept the jet border, thus again $dF_S(\\theta)=0$.\n\\end{itemize}\n\nSumming up, we can define the function $a(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$ by\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nSubstituting Eqs.~\\ref{eq:fannulus} and \\ref{eq:l} into Eq.~\\ref{eq:ratios}, we conclude that\n\n", "index": 67, "text": "\\begin{equation}\n dF_S(\\theta) = \\dfrac{dF}{d\\theta}d\\theta\\times\\dfrac{1}{\\pi}\\arccos\\left(\\dfrac{\\cos{\\theta_\\mathrm{jet}} - \\cos\\theta\\cos{\\theta_\\mathrm{v}}}{\\sin\\theta\\sin{\\theta_\\mathrm{v}}}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"dF_{S}(\\theta)=\\dfrac{dF}{d\\theta}d\\theta\\times\\dfrac{1}{\\pi}\\arccos\\left(%&#10;\\dfrac{\\cos{\\theta_{\\mathrm{jet}}}-\\cos\\theta\\cos{\\theta_{\\mathrm{v}}}}{\\sin%&#10;\\theta\\sin{\\theta_{\\mathrm{v}}}}\\right)\" display=\"block\"><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>F</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow><mo>×</mo><mfrac><mn>1</mn><mi>π</mi></mfrac></mrow><mo>⁢</mo><mrow><mi>arccos</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo>-</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nwhere $H(x)$ is the Heaviside function, {i.\\,e.\\xspace}\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nThis is valid as long as the interceptions between the annulus and S exist, {i.\\,e.\\xspace} for $|{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}|<\\theta<{\\theta_\\mathrm{v}}+{\\theta_\\mathrm{jet}}$. Let us work out the remaining cases:\n\\begin{itemize}\n \\item if ${\\theta_\\mathrm{v}}<{\\theta_\\mathrm{jet}}$, {i.\\,e.\\xspace} if line of sight is inside the jet border, then for $\\theta<{\\theta_\\mathrm{jet}}-{\\theta_\\mathrm{v}}$ also the annulus is inside the jet border, thus $dF_S(\\theta) = dF_a(\\theta)$;\n \\item if ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$, {i.\\,e.\\xspace} if line of sight is outside the jet border, then for $\\theta<{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}$ the annulus is too small to intercept the jet border, thus $dF_S(\\theta)=0$;\n in either case, if $\\theta>{\\theta_\\mathrm{v}}+{\\theta_\\mathrm{jet}}$ the annulus is too large to intercept the jet border, thus again $dF_S(\\theta)=0$.\n\\end{itemize}\n\nSumming up, we can define the function $a(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})$ by\n\n", "index": 69, "text": "\\begin{equation}\n a = \\left\\lbrace\\begin{array}{lr}\n                          H({\\theta_\\mathrm{jet}}-{\\theta_\\mathrm{v}}) & \\theta\\leq|{\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}}|\\\\\n                          0 & \\theta\\geq{\\theta_\\mathrm{v}}+{\\theta_\\mathrm{jet}}\\\\\n                          \\dfrac{1}{\\pi}\\arccos\\left(\\dfrac{\\cos{\\theta_\\mathrm{jet}} - \\cos\\theta\\cos{\\theta_\\mathrm{v}}}{\\sin\\theta\\sin{\\theta_\\mathrm{v}}}\\right) & \\rm otherwise\\\\\n                         \\end{array}\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32.m1\" class=\"ltx_Math\" alttext=\"a=\\left\\{\\begin{array}[]{lr}H({\\theta_{\\mathrm{jet}}}-{\\theta_{\\mathrm{v}}})&amp;%&#10;\\theta\\leq|{\\theta_{\\mathrm{v}}}-{\\theta_{\\mathrm{jet}}}|\\\\&#10;0&amp;\\theta\\geq{\\theta_{\\mathrm{v}}}+{\\theta_{\\mathrm{jet}}}\\\\&#10;\\dfrac{1}{\\pi}\\arccos\\left(\\dfrac{\\cos{\\theta_{\\mathrm{jet}}}-\\cos\\theta\\cos{%&#10;\\theta_{\\mathrm{v}}}}{\\sin\\theta\\sin{\\theta_{\\mathrm{v}}}}\\right)&amp;\\rm otherwise%&#10;\\\\&#10;\\end{array}\\right.\" display=\"block\"><mrow><mi>a</mi><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mi>jet</mi></msub><mo>-</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"right\"><mrow><mi>θ</mi><mo>≤</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>-</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"right\"><mrow><mi>θ</mi><mo>≥</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>+</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mfrac><mn>1</mn><mi>π</mi></mfrac><mo>⁢</mo><mrow><mi>arccos</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo>-</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub></mrow></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mtd><mtd columnalign=\"right\"><mi>otherwise</mi></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nand write\n\n", "itemtype": "equation", "pos": 57831, "prevtext": " \nwhere $H(x)$ is the Heaviside function, {i.\\,e.\\xspace}\n\n", "index": 71, "text": "\\begin{equation}\n H(x) = \\left\\lbrace\\begin{array}{lr}\n         0 & x<0\\\\\n         1 & x\\geq 0\\\\\n        \\end{array}\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"H(x)=\\left\\{\\begin{array}[]{lr}0&amp;x&lt;0\\\\&#10;1&amp;x\\geq 0\\\\&#10;\\end{array}\\right.\" display=\"block\"><mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"right\"><mrow><mi>x</mi><mo>&lt;</mo><mn>0</mn></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>1</mn></mtd><mtd columnalign=\"right\"><mrow><mi>x</mi><mo>≥</mo><mn>0</mn></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nThe light curve of the pulse from the off-axis homogeneous jet is then obtained by integration of this expression between $\\theta_{\\rm on}(t)$ and $\\theta_{\\rm off}(t)$, namely\n\n", "itemtype": "equation", "pos": 57980, "prevtext": "\nand write\n\n", "index": 73, "text": "\\begin{equation}\n dF_S(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}}) = a(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})\\dfrac{dF}{d\\theta}d\\theta\n \\label{eq:dF_S}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m1\" class=\"ltx_Math\" alttext=\"dF_{S}(\\theta,{\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})=a(\\theta,{\\theta_%&#10;{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})\\dfrac{dF}{d\\theta}d\\theta\" display=\"block\"><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>F</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>a</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nNote that here $t=0$ is the arrival time of the first photon from the sphere, thus if ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$ the actual light curve of the off-axis homogeneous jet starts a little later. The actual start time of the off-axis light curve is\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nThe light curve of the pulse from the off-axis homogeneous jet is then obtained by integration of this expression between $\\theta_{\\rm on}(t)$ and $\\theta_{\\rm off}(t)$, namely\n\n", "index": 75, "text": "\\begin{equation}\n F(t,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}}) = \\dfrac{2\\pi\\,R^2}{d^2}\\dfrac{I_0'}{\\Gamma^4}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(t)}a(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})\\dfrac{\\sin\\theta\\,d\\theta}{\\left(1-\\beta\\cos\\theta\\right)^4}\n \\label{eq:flux-offaxis}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m1\" class=\"ltx_Math\" alttext=\"F(t,{\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})=\\dfrac{2\\pi\\,R^{2}}{d^{2}}%&#10;\\dfrac{I_{0}^{\\prime}}{\\Gamma^{4}}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(%&#10;t)}a(\\theta,{\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})\\dfrac{\\sin\\theta\\,d%&#10;\\theta}{\\left(1-\\beta\\cos\\theta\\right)^{4}}\" display=\"block\"><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>,</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msup><mi mathvariant=\"normal\">Γ</mi><mn>4</mn></msup></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>θ</mi><mi>off</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>θ</mi><mi>on</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup><mrow><mi>a</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow><mn>4</mn></msup></mfrac></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nEquation~\\ref{eq:flux-offaxis} can be easily integrated with a simple numerical procedure. Some example light curves computed using a RK4 integration scheme are given in Fig.~\\ref{fig:homogeneous-off-axis-lcs}. \n\n\\subsection{Spectra}\nAll the above arguments can be also applied to the derivation of the observed spectrum. All we need to do is to compute the flux density\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nNote that here $t=0$ is the arrival time of the first photon from the sphere, thus if ${\\theta_\\mathrm{v}}>{\\theta_\\mathrm{jet}}$ the actual light curve of the off-axis homogeneous jet starts a little later. The actual start time of the off-axis light curve is\n\n", "index": 77, "text": "\\begin{equation}\n t_{\\rm start}({\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}}) = \\dfrac{R}{c}\\left(1-\\cos({\\theta_\\mathrm{v}}-{\\theta_\\mathrm{jet}})\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36.m1\" class=\"ltx_Math\" alttext=\"t_{\\rm start}({\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})=\\dfrac{R}{c}\\left%&#10;(1-\\cos({\\theta_{\\mathrm{v}}}-{\\theta_{\\mathrm{jet}}})\\right)\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>start</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mi>R</mi><mi>c</mi></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>-</mo><msub><mi>θ</mi><mi>jet</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nover the same EATS as before, using the transformation\n\n", "itemtype": "equation", "pos": 59454, "prevtext": " \nEquation~\\ref{eq:flux-offaxis} can be easily integrated with a simple numerical procedure. Some example light curves computed using a RK4 integration scheme are given in Fig.~\\ref{fig:homogeneous-off-axis-lcs}. \n\n\\subsection{Spectra}\nAll the above arguments can be also applied to the derivation of the observed spectrum. All we need to do is to compute the flux density\n\n", "index": 79, "text": "\\begin{equation}\n \\dfrac{dF}{d\\nu}(\\nu,t) \\equiv F_{\\nu}(\\nu,t)=  \\int_{S(t)} \\dfrac{dI}{d\\nu}(\\nu,t)\\cos\\alpha\\,ds/r^2\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{dF}{d\\nu}(\\nu,t)\\equiv F_{\\nu}(\\nu,t)=\\int_{S(t)}\\dfrac{dI}{d\\nu}(\\nu,t%&#10;)\\cos\\alpha\\,ds/r^{2}\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><msub><mi>F</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>I</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mi>α</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow><mo>/</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nto express the intensity density in terms of the comoving one.\nIt is convenient to write $dI'/d\\nu'$ as follows\n\n", "itemtype": "equation", "pos": 59644, "prevtext": "\nover the same EATS as before, using the transformation\n\n", "index": 81, "text": "\\begin{equation}\n \\dfrac{dI}{d\\nu}(\\nu) = \\delta^3\\,\\dfrac{dI'}{d\\nu'}(\\nu/\\delta)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{dI}{d\\nu}(\\nu)=\\delta^{3}\\,\\dfrac{dI^{\\prime}}{d\\nu^{\\prime}}(\\nu/\\delta)\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>I</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msup><mi>δ</mi><mn>3</mn></msup></mpadded><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>I</mi><mo>′</mo></msup></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ν</mi><mo>/</mo><mi>δ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nwhere $I_0'$ is the total intensity, $\\nu_0'$ is some frequency, and $f(x)$ is a function which describes the comoving spectral shape, and whose integral is normalized to unity. As an example, we can set a power law spectral shape\n\n", "itemtype": "equation", "pos": 59854, "prevtext": "\nto express the intensity density in terms of the comoving one.\nIt is convenient to write $dI'/d\\nu'$ as follows\n\n", "index": 83, "text": "\\begin{equation}\n \\dfrac{dI'}{d\\nu'}(\\nu') = \\dfrac{I_0'}{\\nu_0'}f(\\nu'/\\nu_0')\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{dI^{\\prime}}{d\\nu^{\\prime}}(\\nu^{\\prime})=\\dfrac{I_{0}^{\\prime}}{\\nu_{0%&#10;}^{\\prime}}f(\\nu^{\\prime}/\\nu_{0}^{\\prime})\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>I</mi><mo>′</mo></msup></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ν</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ν</mi><mo>′</mo></msup><mo>/</mo><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nfor $\\nu'>\\nu_0'$ and zero otherwise, with $\\alpha>1$. Since the integral of $f(x)$ is normalized to unity, we have\n\n", "itemtype": "equation", "pos": 60180, "prevtext": "\nwhere $I_0'$ is the total intensity, $\\nu_0'$ is some frequency, and $f(x)$ is a function which describes the comoving spectral shape, and whose integral is normalized to unity. As an example, we can set a power law spectral shape\n\n", "index": 85, "text": "\\begin{equation}\n f(\\nu'/\\nu_0') = \\left(1-\\alpha\\right)\\left( \\dfrac{\\nu'}{\\nu_0'} \\right)^{-\\alpha}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"f(\\nu^{\\prime}/\\nu_{0}^{\\prime})=\\left(1-\\alpha\\right)\\left(\\dfrac{\\nu^{\\prime%&#10;}}{\\nu_{0}^{\\prime}}\\right)^{-\\alpha}\" display=\"block\"><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ν</mi><mo>′</mo></msup><mo>/</mo><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msup><mi>ν</mi><mo>′</mo></msup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>α</mi></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\nThe equation for the observed spectrum of a homogeneous off-axis jet is then\n\n", "itemtype": "equation", "pos": 60413, "prevtext": "\nfor $\\nu'>\\nu_0'$ and zero otherwise, with $\\alpha>1$. Since the integral of $f(x)$ is normalized to unity, we have\n\n", "index": 87, "text": "\\begin{equation}\n \\int_{0}^{\\infty}\\dfrac{dI'}{d\\nu'}(\\nu')d\\nu' = \\dfrac{I_0'}{\\nu_0'}\\int_{0}^{\\infty}f(\\nu'/\\nu_0')d\\nu'=I_0'\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"\\int_{0}^{\\infty}\\dfrac{dI^{\\prime}}{d\\nu^{\\prime}}(\\nu^{\\prime})d\\nu^{\\prime}%&#10;=\\dfrac{I_{0}^{\\prime}}{\\nu_{0}^{\\prime}}\\int_{0}^{\\infty}f(\\nu^{\\prime}/\\nu_{%&#10;0}^{\\prime})d\\nu^{\\prime}=I_{0}^{\\prime}\" display=\"block\"><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>I</mi><mo>′</mo></msup></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>ν</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ν</mi><mo>′</mo></msup><mo>/</mo><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msup><mi>ν</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow><mo>=</mo><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": "\n\nFor the simplest case of an on-axis jet, with power law comoving spectral shape, the integral is analytic and it gives\n\n", "itemtype": "equation", "pos": 60634, "prevtext": "\nThe equation for the observed spectrum of a homogeneous off-axis jet is then\n\n", "index": 89, "text": "\\begin{equation}\n \\dfrac{dF}{d\\nu}(\\nu,t) = \\dfrac{2\\pi\\,R^2}{d^2}\\dfrac{I_0'}{\\nu_0'\\Gamma^3}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(t)}a(\\theta,{\\theta_\\mathrm{v}},{\\theta_\\mathrm{jet}})\\dfrac{f(\\nu/\\delta\\,\\nu_0')\\sin\\theta\\,d\\theta}{\\left(1-\\beta\\cos\\theta\\right)^3}\n \\label{eq:off-axis-spectrum}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{dF}{d\\nu}(\\nu,t)=\\dfrac{2\\pi\\,R^{2}}{d^{2}}\\dfrac{I_{0}^{\\prime}}{\\nu_{%&#10;0}^{\\prime}\\Gamma^{3}}\\int_{\\theta_{\\rm off}(t)}^{\\theta_{\\rm on}(t)}a(\\theta,%&#10;{\\theta_{\\mathrm{v}}},{\\theta_{\\mathrm{jet}}})\\dfrac{f(\\nu/\\delta\\,\\nu_{0}^{%&#10;\\prime})\\sin\\theta\\,d\\theta}{\\left(1-\\beta\\cos\\theta\\right)^{3}}\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>π</mi></mpadded><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><mrow><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>θ</mi><mi>off</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>θ</mi><mi>on</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup><mrow><mi>a</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">v</mi></msub><mo>,</mo><msub><mi>θ</mi><mi>jet</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ν</mi><mo>/</mo><mpadded width=\"+1.7pt\"><mi>δ</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>ν</mi><mn>0</mn><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow></mrow></mrow><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03735.tex", "nexttext": " \nIn general, a numerical approach is necessary to compute the integral in Eq.~\\ref{eq:off-axis-spectrum}. For this paper, in most cases a IV order Runge-Kutta method has been used to compute separately the specific flux light curve at a number of frequencies. The values of the specific fluxes at a certain time then constitute the spectrum at that time.\n\n\n\n\n\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nFor the simplest case of an on-axis jet, with power law comoving spectral shape, the integral is analytic and it gives\n\n", "index": 91, "text": "\\begin{equation}\n\\begin{array}{l}\n\\dfrac{dF}{d\\nu}(\\nu,t) = \\dfrac{2\\pi R^2}{d^2}\\dfrac{I_0'\\left( 1+\\beta \\right)^{2+\\alpha}\\Gamma^{1+\\alpha}}{\\beta\\,\\nu_0'^{1-\\alpha}}\\left( 1-\\alpha \\right)\\nu^{-\\alpha}\\times \\\\\n\\times \\left\\lbrace \\dfrac{1}{\\left( 1 + \\dfrac{t-{t_{\\mathrm{off}}}}{\\tau + {t_{\\mathrm{off}}}} \\right)^{2+\\alpha}} - \\dfrac{1}{\\left(1+\\dfrac{t}{\\tau}\\right)^{2+\\alpha}} \\right\\rbrace\\\\\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{l}\\dfrac{dF}{d\\nu}(\\nu,t)=\\dfrac{2\\pi R^{2}}{d^{2}}\\dfrac{I_{0%&#10;}^{\\prime}\\left(1+\\beta\\right)^{2+\\alpha}\\Gamma^{1+\\alpha}}{\\beta\\,\\nu_{0}^{%&#10;\\prime 1-\\alpha}}\\left(1-\\alpha\\right)\\nu^{-\\alpha}\\times\\\\&#10;\\times\\left\\{\\dfrac{1}{\\left(1+\\dfrac{t-{t_{\\mathrm{off}}}}{\\tau+{t_{\\mathrm{%&#10;off}}}}\\right)^{2+\\alpha}}-\\dfrac{1}{\\left(1+\\dfrac{t}{\\tau}\\right)^{2+\\alpha}%&#10;}\\right\\}\\\\&#10;\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>ν</mi></mrow></mfrac><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac><mfrac><mrow><msubsup><mi>I</mi><mn>0</mn><mo>′</mo></msubsup><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mi>β</mi></mrow><mo>)</mo></mrow><mrow><mn>2</mn><mo>+</mo><mi>α</mi></mrow></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Γ</mi><mrow><mn>1</mn><mo>+</mo><mi>α</mi></mrow></msup></mrow><mrow><mpadded width=\"+1.7pt\"><mi>β</mi></mpadded><mo>⁢</mo><msubsup><mi>ν</mi><mn>0</mn><mrow><mi mathsize=\"142%\" mathvariant=\"normal\">′</mi><mo>⁣</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow></mrow></msubsup></mrow></mfrac><mrow><mo>(</mo><mn>1</mn><mo>-</mo><mi>α</mi><mo>)</mo></mrow><msup><mi>ν</mi><mrow><mo>-</mo><mi>α</mi></mrow></msup><mo>×</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mi/><mo>×</mo><mrow><mo>{</mo><mrow><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mi>off</mi></msub></mrow><mrow><mi>τ</mi><mo>+</mo><msub><mi>t</mi><mi>off</mi></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow><mrow><mn>2</mn><mo>+</mo><mi>α</mi></mrow></msup></mfrac><mo>-</mo><mfrac><mn>1</mn><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>t</mi><mi>τ</mi></mfrac></mstyle></mrow><mo>)</mo></mrow><mrow><mn>2</mn><mo>+</mo><mi>α</mi></mrow></msup></mfrac></mrow><mo>}</mo></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}]