[{"file": "1601.01388.tex", "nexttext": "\nIn this expression, the first term on the right hand side corresponds to the usual goodness-of-fit $\\chi^2$, and the second term corresponds to a prior on the model parameters $\\bm{p}$.  \n${\\ensuremath{{\\bf C}_N}}$ is the noise covariance matrix and ${\\ensuremath{{\\bf C}_{\\rm p}}}$ is the prior covariance matrix describing our assumed multi-variate Gaussian prior PDF for source parameters.  We assume that the covariance matrix is block diagonal, ${\\ensuremath{{\\bf C}_{\\rm p}}} = {\\rm diag}({\\bf C}_\\eta, {\\ensuremath{{\\bf C}_s}}, {\\bf C}_\\phi)$\ni.e., we assume no prior covariance between lens parameters, source parameters, and phase parameters.  In the second line of Equation~\\eqref{chi2}, and for the rest of this paper, we set ${\\bf C}_\\eta^{-1} = 0$, i.e., we assume no prior on the lens model parameters.\n\nOf particular importance is the prior on source pixel parameters $\\bm{S}$.  We denote that block within {\\ensuremath{{\\bf C}_{\\rm p}}}\\ as {\\ensuremath{{\\bf C}_s}},  the source prior covariance matrix, which gives a term $\\bm{S}^{\\sf T}{\\ensuremath{{\\bf C}_s}}^{-1}\\bm{S}$ in Equation~\\eqref{chi2}.  This matrix is often written as ${\\ensuremath{{\\bf C}_s}}=\\lambda \\hat{{\\ensuremath{{\\bf C}_s}}}$, where $\\lambda$ is a scaling parameter \\citep{suyu:06}. We describe our procedure for determining the strength of the source prior, $\\lambda$, in Section~\\ref{sec:prior}.\nIn Equation~\\eqref{chi2}, the parameter vector $\\bm{S}$ is defined without loss of generality so that the Gaussian prior is centered at $\\bm{S}=0$.  More generally, if we define $\\bm{S}$ so that the prior is centered at some $\\bm{S}_c$, then we replace $\\bm{S} \\to \\bm{S}-\\bm{S}_c$ in the second to last term in Equation~\\eqref{chi2}.\n\nWe note that the number of source parameters $\\bm{S}$ is quite large, and as noted in previous works \\citep[e.g.,][]{suyu:06}, the source prior will act to regularize the reconstruction of the source parameters and avoid over-fitting the data. \nThis Gaussian prior, described by covariance matrix {\\ensuremath{{\\bf C}_s}},  is discussed below in Section~\\ref{sec:prior}. \nFor visibility data, the noise covariance {\\ensuremath{{\\bf C}_N}}\\ is diagonal, and its amplitude can be determined from the data, using a method described in detail in Section~\\ref{sec:implement}. \n\nFor ALMA observations, the data vector $\\bm{D}$ consists of the real and imaginary parts of complex visibilities. We can write our model visibilities as\n\n", "itemtype": "equation", "pos": 11973, "prevtext": "\n\n\\title{Detection of lensing substructure using ALMA observations of the dusty galaxy SDP.81}\n\n\\author{Yashar~D.~Hezaveh\\altaffilmark{1,12},\nNeal~Dalal\\altaffilmark{2,3,4,5}, \nDaniel~P.~Marrone\\altaffilmark{6},   \nYao-Yuan~Mao\\altaffilmark{1,7},\nWarren~Morningstar\\altaffilmark{1}, \nDi~Wen\\altaffilmark{2},\nRoger~D.~Blandford\\altaffilmark{1,7},\nJohn~E.~Carlstrom\\altaffilmark{8}, \nChristopher~D.~Fassnacht\\altaffilmark{9},\nGilbert~P.~Holder\\altaffilmark{10}, \nAthol~Kemball\\altaffilmark{2},\nPhilip~J.~Marshall\\altaffilmark{7},\nNorman~Murray\\altaffilmark{11,13},\nLaurence~Perreault~Levasseur\\altaffilmark{1},\nJoaquin~D.~Vieira\\altaffilmark{2},\nRisa~H.~Wechsler\\altaffilmark{1,7}\n}\n\n\\altaffiltext{1}{Kavli Institute for Particle Astrophysics and Cosmology and Department of Physics, Stanford University, 452 Lomita Mall, Stanford, CA 94305-4085, USA}\n\\altaffiltext{2}{Astronomy Department, University of Illinois at Urbana-Champaign, 1002 W.\\ Green Street, Urbana IL 61801, USA}\n\\altaffiltext{3}{School of Natural Sciences, Institute for Advanced Study, 1 Einstein Drive, Princeton, NJ 08540, USA}\n\\altaffiltext{4}{Kavli Institute for the Physics and Mathematics of the Universe, TODIAS, The University of Tokyo, Chiba, 277-8583, Japan}\n\\altaffiltext{5}{Department of Chemistry and Physics, University of Kwa-Zulu Natal, University Road, Westville, KZN, South Africa}\n\\altaffiltext{6}{Steward Observatory, University of Arizona, 933 North Cherry Avenue, Tucson, AZ 85721, USA}\n\\altaffiltext{7}{Kavli Institute for Particle Astrophysics and Cosmology and Department of Particle Physics and Astrophysics; SLAC National Accelerator Laboratory, Menlo Park, CA 94305, USA}\n\\altaffiltext{8}{Kavli Institute for Cosmological Physics, University of Chicago, 5640 South Ellis Avenue, Chicago, IL 60637, USA}\n\\altaffiltext{9}{Department of Physics, University of California, One Shields Avenue, Davis, CA 95616, USA}\n\\altaffiltext{10}{Department of Physics, McGill University, 3600 Rue University, Montreal, Quebec H3A 2T8, Canada}\n\\altaffiltext{11}{CITA, University of Toronto, 60 St.\\ George St., Toronto ON M5S 3H8, Canada}\n\\altaffiltext{12}{Hubble Fellow}\n\\altaffiltext{13}{Canada Research Chair in Astrophysics}\n\n\n\n\\begin{abstract}\n\\noindent\nWe study the abundance of substructure in the matter density near galaxies using ALMA Science Verification observations of the strong lensing system SDP.81. We present a method to measure the abundance of subhalos around galaxies using interferometric observations of gravitational lenses.  Using simulated ALMA observations, we explore the effects of various systematics, including antenna phase errors and source priors, and show how such errors may be measured or marginalized.  We apply our formalism to ALMA observations of SDP.81.  We find evidence for the presence of a $M=10^{8.96\\pm 0.12} M_{\\odot}$  subhalo near one of the images, with a significance of $6.9\\sigma$ in a joint fit to data from bands 6 and 7; the effect of the subhalo is also detected in both bands individually. We also derive constraints on the abundance of dark matter subhalos down to $M\\sim 2\\times 10^7 M_{\\odot}$, pushing down to the mass regime of the smallest detected satellites in the Local Group, where there are significant discrepancies between the observed population of luminous galaxies and predicted dark matter subhalos.  We find hints of additional substructure, warranting further study using the full SDP.81 dataset (including, for example, the spectroscopic imaging of the lensed carbon monoxide emission).  We compare the results of this search to the predictions of $\\Lambda$CDM halos, and find that given current uncertainties in the host halo properties of SDP.81, our measurements of  substructure are consistent with theoretical expectations.  Observations of larger samples of gravitational lenses with ALMA should be able to improve the constraints on the abundance of galactic substructure.\n\\end{abstract}\n\n\n\n\\keywords{gravitational lensing: strong --- dark matter}\n\n\n\n\\section{Introduction}\n\n\nOver the past few decades, multiple probes of the large-scale structure of the universe have established a clear picture of our cosmology that is described well by a simple model, the $\\Lambda$CDM model \\citep[e.g.,][]{Dodelson03}.  This model predicts that structures including galaxies arise through a process of hierarchical structure formation, driven by gravitational instability of cold dark matter (CDM) density perturbations seeded by quantum fluctuations generated during an early epoch of exponential expansion called inflation.  On large scales ($\\gtrsim$ megaparsecs) and across all epochs, the predictions of this model agree remarkably well with a wide variety of observations, including cosmic microwave background (CMB) anisotropies \\citep{Planck2015}, galaxy clustering \\citep{BOSS2014}, and weak gravitational lensing \\citep{CFHTLens}.  On smaller, sub-galactic scales where structure has become highly nonlinear (e.g., $\\lesssim$ 10 kpc) at low redshift, the agreement between CDM predictions and observations of galactic structure has been less clear.\n\nOne of the most famous examples of CDM's small scale difficulties is the Missing Satellite Problem \\citep[e.g.,][and references therein]{kravtsov:10}. Numerical simulations of the formation of galactic dark matter halos robustly predict the presence of a large population of bound subhalos orbiting within all virialized objects such as the Milky Way.  These subhalos span a broad spectrum of masses, from objects like the Magellanic Clouds, extending down to the resolution limits of the simulations $M\\sim 10^3 M_\\odot$ \\citep{ViaLactea2,GHalo,Aquarius}.\nObservations of dwarf galaxies in the Local Group find an almost factor of 10 deficit of satellites compared to $\\Lambda$CDM predictions, at masses corresponding to $V_{\\rm circ} \\sim 10\\,$km/s \\citep{kravtsov:10}.\n\n\nTwo main classes of solutions have been proposed to resolve this discrepancy.  The first solution involves modifying the microphysics of dark matter particles, in a manner that would suppress the abundance of low mass substructure while remaining consistent with existing bounds on structure at $k \\lesssim 10 \\,h\\, {\\rm Mpc}^{-1}$ from the  Lyman $\\alpha$ forest \\citep{seljak:06,markovic:14}.  Examples of proposed modifications to CDM include warm dark matter (WDM), in which the thermal streaming motions of dark matter (DM) particles wipe out small scale structure \\citep{Bode01,Abazajian06}, or self-interacting dark matter, in which DM particles can have non-gravitational interactions \\citep{Spergel00}.  In principle, fluid descriptions of dark matter could also suppress satellites \\citep{khoury:15}.\n\nAlternatively, the solution to the Missing Satellite Problem may lie within baryonic astrophysics.  Numerous processes have been suggested for suppressing the efficiency of star formation within low mass halos and subhalos, such as photoevaporation during reionization, or feedback from massive stars, supernovae or black holes \\citep[see][for a review]{kravtsov:10}.\nIn this scenario, a large number of dark matter subhalos should exist around most galaxies, however most of them would be devoid of stars and therefore difficult to detect using conventional means.\n\nGravitational lensing has long been suggested as a method of distinguishing between these possibilities \\citep[various properties of tidal streams and their disruption have also been suggested as a method to detect subhalos in the Milky Way, e.g.,][]{Siegal-Gaskins:08, Carlberg:09, Erkal:15a,Erkal:15b}.  Strong gravitational lensing is sensitive to galactic substructure, even if that substructure is completely devoid of baryons \\citep[e.g.,][]{Mao:98,Metcalf01,dalal:02,Moustakas03,KochDalal04,Koopmans:05, Keeton06,Vegetti:09,vegetti:12,Nierenberg:14,Xu:15A,Cyr-Racine:15}.  \\cite{dalal:02} analyzed a sample of strongly lensed quasars and found that the lenses must have a large abundance of substructure: they found that the fraction of projected mass within $\\sim 10\\,$kpc of lens galaxies in the form of substructure was $0.3\\% < f_{\\rm sub} < 3.5\\%$, at 90\\% confidence.  \\cite{vegetti:14} analyzed a sample of strongly lensed galaxies observed using Hubble Space Telescope (HST) and Keck AO data and found  $0.2\\% < f_{\\rm sub} < 2.8\\%$, at 68\\% confidence, with two detections reported in \\citet{vegetti:10} and \\citet{vegetti:12}.   These measurements of projected substructure are in broad agreement with expectations for the  massive elliptical galaxies that are typical of strong lenses (see Section~\\ref{sec:lcdm}), but the large uncertainties do not yet allow for a discriminating test of dark matter models.\n\nRecently, \\citet{Hezaveh13A} proposed that ALMA observations of the large population of strongly lensed dusty galaxies discovered in sub-mm surveys like the South Pole Telescope \\citep{vieira:13,hezaveh:13b}, Atacama Cosmology Telescope \\citep{marsden:14} or Herschel \\citep[][]{negrello:10,wardlow:13, Bussmann:13} could significantly improve constraints on dark matter substructure.  Towards that end, in this paper we present a method for detecting dark matter subhalos using interferometric data, show a few examples of the performance of the pipeline on mock data and finally, we apply our formalism to the recent ALMA Science Verification observations of the strongly lensed dusty galaxy SDP.81 \\citep{SDP81}.\n\n                \nThe outline of the paper is as follows.\nIn Section~\\ref{sec:framework}, we present a formalism for modeling extended lensed sources using interferometric observations. In Section~\\ref{sec:subhalofinding_method} we present a perturbative method for searching for subhalos using interferometric observations. Section~\\ref{sec:implement} describes our implementation of this method and presents the results of various tests and analysis of mock data used to test the pipeline. \nIn Section~\\ref{sec:results} we analyze ALMA observations of SDP.81 using this pipeline, quantifying the abundance of subhalos in the lensing galaxy.\nIn Section~\\ref{sec:lcdm} we compare the constraints obtained in the previous section to the predictions of the $\\Lambda$CDM model and finally discuss the results in Section~\\ref{sec:discuss}.\nFor all of the modeling presented in this paper, we assume a flat $\\Lambda$CDM expansion history with mean matter density $\\Omega_M = 0.267$ and current expansion rate $H_0 = 71$ km Mpc$^{-1}$ s$^{-1}$.\n\n\\section{Framework: fitting visibilities with a pixelated source}\n\\label{sec:framework}\n\nData from interferometric observations consist of a large number of complex visibilities.  \nWe fit these data using a model for the distribution of matter in the lensing galaxy, the background source emission, and certain aspects of the measurements such as time-varying antenna phase errors.  To describe the source emission, we use a pixelated source map containing many pixels for each observed channel. We can think of the source map pixels as parameters in our lens model, along with parameters describing the lens mass distribution, and other nuisance parameters like antenna phase errors.  Below, we will use the notation $\\bm{\\eta}$ to denote lens mass parameters (see Table~\\ref{lens_pars}), $\\bm{S}$ to denote source pixel parameters, $\\bm{\\phi}$ to denote other parameters like phase errors, and $\\bm{p}$ to denote the full set of parameters, i.e., $\\bm{p} = \\{\\bm{\\eta}, \\bm{S}, \\bm{\\phi} \\}$.  \n\n\nThe general framework of fitting strongly lensed images with pixelated sources is described in detail in \\citet{warren:03} and \\citet{suyu:06}.  In general, given data vector $\\bm{D}$, model predictions $\\bm{M}(\\bm{p})$, which depend on lensing parameters $\\bm{\\eta}$ (e.g., lensing mass) and source parameters $\\bm{S}$ (i.e., pixel values), we can write  the posterior probability distribution (PDF) for the parameters as ${\\cal L} \\propto e^{-{\\ensuremath{{\\cal  E} }}/2}$, where {\\ensuremath{{\\cal  E} }} \\ is defined as\n\n", "index": 1, "text": "\\begin{align}\n\\label{chi2}\n{\\ensuremath{{\\cal  E} }}(\\bm{p}) &=  (\\bm{D} - \\bm{M}(\\bm{p}))^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} (\\bm{D} - \\bm{M}(\\bm{p})) + \\bm{p}^{\\sf T} {\\ensuremath{{\\bf C}_{\\rm p}}}^{-1} \\bm{p} \\\\\n & = (\\bm{D} - \\bm{M})^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} (\\bm{D} - \\bm{M}) \n+ \\bm{S}^{\\sf T} {\\ensuremath{{\\bf C}_s}}^{-1} \\bm{S} + \\bm{\\phi}^{\\sf T} {\\bf C}_\\phi^{-1} \\bm{\\phi}. \\nonumber\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{{\\cal E}}(\\bm{p})\" display=\"inline\"><mrow><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=(\\bm{D}-\\bm{M}(\\bm{p}))^{\\sf T}{{\\bf C}_{N}}^{-1}(\\bm{D}-\\bm{M}(%&#10;\\bm{p}))+\\bm{p}^{\\sf T}{{\\bf C}_{\\rm p}}^{-1}\\bm{p}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝑫</mi><mo>-</mo><mrow><mi>𝑴</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝑫</mi><mo>-</mo><mrow><mi>𝑴</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msup><mi>𝒑</mi><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi mathvariant=\"normal\">p</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mi>𝒑</mi></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=(\\bm{D}-\\bm{M})^{\\sf T}{{\\bf C}_{N}}^{-1}(\\bm{D}-\\bm{M})+\\bm{S}^%&#10;{\\sf T}{{\\bf C}_{s}}^{-1}\\bm{S}+\\bm{\\phi}^{\\sf T}{\\bf C}_{\\phi}^{-1}\\bm{\\phi}.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝑫</mi><mo>-</mo><mi>𝑴</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝑫</mi><mo>-</mo><mi>𝑴</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msup><mi>𝑺</mi><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>s</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mi>𝑺</mi></mrow><mo>+</mo><mrow><msup><mi mathvariant=\"bold-italic\">ϕ</mi><mi>𝖳</mi></msup><mo>⁢</mo><msubsup><mi>𝐂</mi><mi>ϕ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo>⁢</mo><mi mathvariant=\"bold-italic\">ϕ</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $\\bm{S}$ is a vector of source pixel values, ${\\bf L}$ is a lensing operator that maps the brightness of each source pixel to the image pixels (sky emission),  ${\\bf B}$ is a diagonal primary beam operator that multiplies the sky emission with the primary beam, and ${\\bf F}$ is a dense Fourier operator, whose $ij$-th element is equal to $e^{-i (\\bm{k}_i\\cdot\\bm{r}_j + \\phi_{l1}-\\phi_{l2})}$, corresponding to a visibility at $uv$-coordinate $\\bm{k}_i$ from baseline $l$ (composed of two antennas, labeled $l1$ and $l2$), and an image pixel located at $\\bm{r}_j$. Note that rows of ${\\bf F}$ with equal values of $l$ have a common phase error (e.g., visibilities from the same baseline within the segmentation time of the antenna phase corruption parameters). \nTo calculate ${\\bf L}$ for a set of lens parameters ${\\bm \\eta}$ (e.g., mass and ellipticity) we solve the non-linear lensing equation using a ray-tracing approach. \nNote that ${\\bf L}$, ${\\bf B}$, and ${\\bf F}$ are all linear operators, and that $\\bm{S}$ is a subset of the model parameter vector $\\bm{p}=\\{\\bm{\\eta , S, \\phi}\\}$.   \nApplication of ${\\bf F\\, B}$ to a sky emission model produces $\\bm{M}$, the vector of the model visibilities. \n\n\nWe treat the source parameters ${\\bm S}$ (the source pixel intensities) as nuisance parameters, and marginalize over them.  \nOur goal is then to compute the lensing parameter posterior described by Equation~\\eqref{chi2}, marginalized over source parameters.\nBecause the observables are linear in the source pixels, and {\\ensuremath{{\\cal  E} }} \\  is quadratic in the observables, then the likelihood is a Gaussian function of the source pixels.  Since our assumed source prior is also Gaussian, the posterior is Gaussian.  This allows us to analytically marginalize over the source nuisance parameters using Gaussian integrals, to determine the posterior PDF for the remaining parameters.  \n\nThe difference in marginalized log-posterior between two models is then\n\n", "itemtype": "equation", "pos": 14846, "prevtext": "\nIn this expression, the first term on the right hand side corresponds to the usual goodness-of-fit $\\chi^2$, and the second term corresponds to a prior on the model parameters $\\bm{p}$.  \n${\\ensuremath{{\\bf C}_N}}$ is the noise covariance matrix and ${\\ensuremath{{\\bf C}_{\\rm p}}}$ is the prior covariance matrix describing our assumed multi-variate Gaussian prior PDF for source parameters.  We assume that the covariance matrix is block diagonal, ${\\ensuremath{{\\bf C}_{\\rm p}}} = {\\rm diag}({\\bf C}_\\eta, {\\ensuremath{{\\bf C}_s}}, {\\bf C}_\\phi)$\ni.e., we assume no prior covariance between lens parameters, source parameters, and phase parameters.  In the second line of Equation~\\eqref{chi2}, and for the rest of this paper, we set ${\\bf C}_\\eta^{-1} = 0$, i.e., we assume no prior on the lens model parameters.\n\nOf particular importance is the prior on source pixel parameters $\\bm{S}$.  We denote that block within {\\ensuremath{{\\bf C}_{\\rm p}}}\\ as {\\ensuremath{{\\bf C}_s}},  the source prior covariance matrix, which gives a term $\\bm{S}^{\\sf T}{\\ensuremath{{\\bf C}_s}}^{-1}\\bm{S}$ in Equation~\\eqref{chi2}.  This matrix is often written as ${\\ensuremath{{\\bf C}_s}}=\\lambda \\hat{{\\ensuremath{{\\bf C}_s}}}$, where $\\lambda$ is a scaling parameter \\citep{suyu:06}. We describe our procedure for determining the strength of the source prior, $\\lambda$, in Section~\\ref{sec:prior}.\nIn Equation~\\eqref{chi2}, the parameter vector $\\bm{S}$ is defined without loss of generality so that the Gaussian prior is centered at $\\bm{S}=0$.  More generally, if we define $\\bm{S}$ so that the prior is centered at some $\\bm{S}_c$, then we replace $\\bm{S} \\to \\bm{S}-\\bm{S}_c$ in the second to last term in Equation~\\eqref{chi2}.\n\nWe note that the number of source parameters $\\bm{S}$ is quite large, and as noted in previous works \\citep[e.g.,][]{suyu:06}, the source prior will act to regularize the reconstruction of the source parameters and avoid over-fitting the data. \nThis Gaussian prior, described by covariance matrix {\\ensuremath{{\\bf C}_s}},  is discussed below in Section~\\ref{sec:prior}. \nFor visibility data, the noise covariance {\\ensuremath{{\\bf C}_N}}\\ is diagonal, and its amplitude can be determined from the data, using a method described in detail in Section~\\ref{sec:implement}. \n\nFor ALMA observations, the data vector $\\bm{D}$ consists of the real and imaginary parts of complex visibilities. We can write our model visibilities as\n\n", "index": 3, "text": "\\begin{equation}\n\\bm{M}({\\bm {\\eta,S,\\phi}}) = {\\bf F}(\\bm{\\phi})\\, {\\bf B \\, L({\\bm \\eta})\\,} \\bm{S}\\,,\n\\label{linearsource}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\bm{M}({\\bm{\\eta,S,\\phi}})={\\bf F}(\\bm{\\phi})\\,{\\bf B\\,L({\\bm{\\eta}})\\,}\\bm{S}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>𝑴</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝜼</mi><mo mathvariant=\"bold\">,</mo><mi>𝑺</mi><mo mathvariant=\"bold\">,</mo><mi mathvariant=\"bold-italic\">ϕ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>𝐅</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"bold-italic\">ϕ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>𝐁</mi></mpadded><mo>⁢</mo><mi>𝐋</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝜼</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>𝑺</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere ${\\ensuremath{{\\bf A}}} = ({\\bf FBL})^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} ({\\bf FBL})+{\\ensuremath{{\\bf C}_s}}^{-1}$ and ${\\ensuremath{{\\bf B}}}~=~{\\bf (L B F)}^{{\\sf T}} {\\ensuremath{{\\bf C}_N}}^{-1} {\\bm D}$ \\citep{Suyu:10}. \nThe source reconstruction that maximizes the unmarginalized posterior (at fixed lens model) is also analytic, and is given by \\citep{warren:03,suyu:06}\n\n", "itemtype": "equation", "pos": 16969, "prevtext": "\nwhere $\\bm{S}$ is a vector of source pixel values, ${\\bf L}$ is a lensing operator that maps the brightness of each source pixel to the image pixels (sky emission),  ${\\bf B}$ is a diagonal primary beam operator that multiplies the sky emission with the primary beam, and ${\\bf F}$ is a dense Fourier operator, whose $ij$-th element is equal to $e^{-i (\\bm{k}_i\\cdot\\bm{r}_j + \\phi_{l1}-\\phi_{l2})}$, corresponding to a visibility at $uv$-coordinate $\\bm{k}_i$ from baseline $l$ (composed of two antennas, labeled $l1$ and $l2$), and an image pixel located at $\\bm{r}_j$. Note that rows of ${\\bf F}$ with equal values of $l$ have a common phase error (e.g., visibilities from the same baseline within the segmentation time of the antenna phase corruption parameters). \nTo calculate ${\\bf L}$ for a set of lens parameters ${\\bm \\eta}$ (e.g., mass and ellipticity) we solve the non-linear lensing equation using a ray-tracing approach. \nNote that ${\\bf L}$, ${\\bf B}$, and ${\\bf F}$ are all linear operators, and that $\\bm{S}$ is a subset of the model parameter vector $\\bm{p}=\\{\\bm{\\eta , S, \\phi}\\}$.   \nApplication of ${\\bf F\\, B}$ to a sky emission model produces $\\bm{M}$, the vector of the model visibilities. \n\n\nWe treat the source parameters ${\\bm S}$ (the source pixel intensities) as nuisance parameters, and marginalize over them.  \nOur goal is then to compute the lensing parameter posterior described by Equation~\\eqref{chi2}, marginalized over source parameters.\nBecause the observables are linear in the source pixels, and {\\ensuremath{{\\cal  E} }} \\  is quadratic in the observables, then the likelihood is a Gaussian function of the source pixels.  Since our assumed source prior is also Gaussian, the posterior is Gaussian.  This allows us to analytically marginalize over the source nuisance parameters using Gaussian integrals, to determine the posterior PDF for the remaining parameters.  \n\nThe difference in marginalized log-posterior between two models is then\n\n", "index": 5, "text": "\\begin{equation}\n\\Delta {\\ensuremath{{\\cal  E} }} = \\Delta \\left[ {\\ensuremath{{\\bf B}}}^{{\\sf T}} {\\ensuremath{{\\bf A}}}^{-1} {\\ensuremath{{\\bf B}}} - \\log(\\det[{\\ensuremath{{\\bf A}}}]) \\right]\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\Delta{{\\cal E}}=\\Delta\\left[{{\\bf B}}^{{\\sf T}}{{\\bf A}}^{-1}{{\\bf B}}-\\log(%&#10;\\det[{{\\bf A}}])\\right]\\,,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi></mrow><mo>=</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msup><mi>𝐁</mi><mi>𝖳</mi></msup><mo>⁢</mo><msup><mi>𝐀</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝐁</mi></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo movablelimits=\"false\">det</mo><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mi>𝐀</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\n\n\nWe note that the above formalism is general to multi-frequency data. Vectors $\\bm{D}$ and $\\bm{S}$ can be concatenations of multiple data and reconstructed source vectors in different frequencies, while matrices {\\ensuremath{{\\bf C}_N}} \\ and {\\ensuremath{{\\bf C}_s}} \\ could be formed as block diagonal matrices including the noise and source prior in each channel. It is also possible to include regularization between different frequencies by allowing non-zero elements in {\\ensuremath{{\\bf C}_s}} \\ in off-block-diagonal elements.\n\n\n\n\\subsection{Source Structural Prior}\n\\label{sec:prior}\n\nAs Equation~\\eqref{chi2} makes explicit, the posterior PDF depends on our choice of the source prior, {\\ensuremath{{\\bf C}_s}}.  Various forms of source priors are explored in the literature, including so-called gradient and curvature priors \\citep{warren:03,suyu:06}. More generally, we could employ more physically motivated priors that are based on the expected morphology of the specific sources under investigation.\n\nThe dust and molecular line morphologies of early star forming galaxies are expected to be well represented by a number of star forming clumps embedded in a larger structure, such as an exponential disk.  One can  use this structure to construct a source prior by calculating the power spectrum and covariance of such a clustered source model. Suppose that we have $N_c$ clumps in our source galaxy, whose distribution within the galaxy has profile $U_c(r)$.  We normalize $U_c$ to have unit integral, $\\int U_c (r) d^2r =1$.  Its Fourier transform is $U_c(k)$.  Clump $i$ has luminosity $L_i$ and profile $u_i(r)$, normalized to have unit integral, $\\int u_i(r)d^2r = 1$. Then the power spectrum of the source emission is proportional to \n\n\n", "itemtype": "equation", "pos": 17570, "prevtext": "\nwhere ${\\ensuremath{{\\bf A}}} = ({\\bf FBL})^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} ({\\bf FBL})+{\\ensuremath{{\\bf C}_s}}^{-1}$ and ${\\ensuremath{{\\bf B}}}~=~{\\bf (L B F)}^{{\\sf T}} {\\ensuremath{{\\bf C}_N}}^{-1} {\\bm D}$ \\citep{Suyu:10}. \nThe source reconstruction that maximizes the unmarginalized posterior (at fixed lens model) is also analytic, and is given by \\citep{warren:03,suyu:06}\n\n", "index": 7, "text": "\\begin{equation}\n\\bm{S} = {{\\ensuremath{{\\bf A}}}}^{-1} {\\ensuremath{{\\bf B}}}.\n\\label{reconstruct}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\bm{S}={{{\\bf A}}}^{-1}{{\\bf B}}.\" display=\"block\"><mrow><mrow><mi>𝑺</mi><mo>=</mo><mrow><msup><mi>𝐀</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝐁</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "  \n\nThe Fourier transform of this power spectrum gives the correlation function of the source emission, and the source covariance {\\ensuremath{{\\bf C}_s}}\\ is determined from this correlation function.  Note that the normalization of the power spectrum (and hence the normalization of {\\ensuremath{{\\bf C}_s}}) has not been specified.  In principle, we could normalize {\\ensuremath{{\\bf C}_s}}\\  using the observed intensity, but this has been magnified by an (a priori) unknown lensing magnification.  \n\nInstead, we normalize {\\ensuremath{{\\bf C}_s}}\\ by maximizing the marginalized likelihood (Bayesian evidence) for the fixed-parameter lens model, as discussed in \\citet{suyu:06}.  We can scale an arbitrarily normalized source covariance matrix $\\hat{{\\ensuremath{{\\bf C}_s}}}$ (which in essence only defines the form of the prior), to get an appropriately scaled matrix ${\\ensuremath{{\\bf C}_s}}=\\lambda \\hat{{\\ensuremath{{\\bf C}_s}}}$, where $\\lambda$ is a scaling parameter which can be determined by solving\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\nWe note that the above formalism is general to multi-frequency data. Vectors $\\bm{D}$ and $\\bm{S}$ can be concatenations of multiple data and reconstructed source vectors in different frequencies, while matrices {\\ensuremath{{\\bf C}_N}} \\ and {\\ensuremath{{\\bf C}_s}} \\ could be formed as block diagonal matrices including the noise and source prior in each channel. It is also possible to include regularization between different frequencies by allowing non-zero elements in {\\ensuremath{{\\bf C}_s}} \\ in off-block-diagonal elements.\n\n\n\n\\subsection{Source Structural Prior}\n\\label{sec:prior}\n\nAs Equation~\\eqref{chi2} makes explicit, the posterior PDF depends on our choice of the source prior, {\\ensuremath{{\\bf C}_s}}.  Various forms of source priors are explored in the literature, including so-called gradient and curvature priors \\citep{warren:03,suyu:06}. More generally, we could employ more physically motivated priors that are based on the expected morphology of the specific sources under investigation.\n\nThe dust and molecular line morphologies of early star forming galaxies are expected to be well represented by a number of star forming clumps embedded in a larger structure, such as an exponential disk.  One can  use this structure to construct a source prior by calculating the power spectrum and covariance of such a clustered source model. Suppose that we have $N_c$ clumps in our source galaxy, whose distribution within the galaxy has profile $U_c(r)$.  We normalize $U_c$ to have unit integral, $\\int U_c (r) d^2r =1$.  Its Fourier transform is $U_c(k)$.  Clump $i$ has luminosity $L_i$ and profile $u_i(r)$, normalized to have unit integral, $\\int u_i(r)d^2r = 1$. Then the power spectrum of the source emission is proportional to \n\n\n", "index": 9, "text": "\\begin{equation}\nP_{\\rm src}(k) \\propto \\left[ \\sum_i^{N_c}  L^2_i |u_i(k)|^2 + \\sum_{i\\neq j}^{Nc} L_iL_j |U_c(k)|^2 u^{*}_i(k) u_j (k) \\right]\\,.\n\\label{sourcePk}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"P_{\\rm src}(k)\\propto\\left[\\sum_{i}^{N_{c}}L^{2}_{i}|u_{i}(k)|^{2}+\\sum_{i\\neq&#10;j%&#10;}^{Nc}L_{i}L_{j}|U_{c}(k)|^{2}u^{*}_{i}(k)u_{j}(k)\\right]\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mi>src</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><mo>[</mo><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mi>c</mi></msub></munderover><mrow><msubsup><mi>L</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>≠</mo><mi>j</mi></mrow><mrow><mi>N</mi><mo>⁢</mo><mi>c</mi></mrow></munderover><mrow><msub><mi>L</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>L</mi><mi>j</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>U</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>u</mi><mi>i</mi><mo>*</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>u</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "  \nwhere $N_s$ is the number of source pixels and $\\bm{S}$ is determined using Equation~\\eqref{reconstruct}. This equation can then be solved non-linearly. \n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 0 0 0 0, clip, width=0.90\\textwidth]{fig1.pdf}\n\\centering\n\\end{center}\n\\caption{Posterior PDF for the lens model parameters for a mock dataset of a 2-hour long observation of a 50 mJy source with an antenna configuration with maximum baselines of $\\sim2$ km. The different colors correspond to different regularization schemes: gray contours are for a gradient prior, and red contours are for a curvature prior \\citep{warren:03}.  We see no evidence of systematic biases in the reconstructed parameters. The results shown here are typical of the mocks we have simulated. \n\\label{fig:Warrens_Sim_Post}}\n\\end{figure*}\n\n\n\\section{Searching for subhalos}\n\\label{sec:subhalofinding_method}\n\n\nEquation~\\eqref{chi2} tells us how well any lens model fits the data.  That model can contain a smooth potential of the main lens, and a number of subhalos.  As we add subhalos to the mass model, the model parameter space grows considerably in dimensionality, and searching that high-dimensional parameter space can become computationally expensive.  In this section, we describe a simple approach towards expediting that search.  Our method relies on first making a linear approximation to the effect of subhalos on the model predictions, in order to identify promising points in parameter space where subhalos could significantly improve the fit.  Once we have identified those promising parameter values using the linearized search, we then conduct searches using the full nonlinear lens equations, starting at those points in parameter space.\n\n\nAs discussed above, lens model predictions are in general highly nonlinear functions of most of the lens parameters, and are linear only in the source parameters.\nIn this section, we show that once a maximum posterior model is found using the procedure described above, we can linearize the model predictions in a small local neighborhood of these fiducial parameters, even when substructure is added to the mass model.  The key aspect of low mass substructure that permits a linearized treatment, even approximately, is that the effects of substructure are perturbative when expanded in the deflection angle.\n\nFor the purpose of our discussion below, it will be useful to separate the subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}\\ from the rest of the parameters $\\bm{p}$ in our notation.  The parameter set $\\bm{p}$ therefore consists of macro-lens density parameters, background source parameters, and other nuisance parameter (e.g., antenna phases), while we reserve the subhalo parameters as {\\ensuremath{\\bm{p}_{\\rm sub}}}.  \n\nTo infer the presence of subhalos, we study the posterior PDF for the subhalo parameters, {\\ensuremath{\\bm{p}_{\\rm sub}}},  marginalized over all the rest of the parameters $\\bm{p}$, and we compare to the marginalized posterior PDFs in models with different numbers of subhalos. In particular, the ratio of the marginalized posterior of a subhalo model with mass $M_{\\rm sub}>0$ to that of a model without subhalos (or equivalently, with $M_{\\rm sub}=0$)  provides a route to the marginal posterior for the presence of the given subhalo. \n\nIn our approach, we first find the maximum posterior smooth model using the procedure described in Section~\\ref{sec:framework}. Next, we consider the effect of subhalos.  Note that the effects of low-mass subhalos on the lensing deflection angles entering the matrix ${\\bf L}$ are quite small in general.  More precisely, low-mass substructure produces only a small perturbation to the deflection angle at every location.  This suggests a linearized treatment of subhalos \\citep{dalal:02,Hezaveh13A}.\nFor a given subhalo (which could be parameterized by its location and mass), we add the subhalo deflections to the deflections arising from the best-fit smooth lensing potential model.\nWe write the marginalized posterior, ${\\ensuremath{{\\cal L}}}_m$, for the subhalo of that mass and that location as\n\n", "itemtype": "equation", "pos": -1, "prevtext": "  \n\nThe Fourier transform of this power spectrum gives the correlation function of the source emission, and the source covariance {\\ensuremath{{\\bf C}_s}}\\ is determined from this correlation function.  Note that the normalization of the power spectrum (and hence the normalization of {\\ensuremath{{\\bf C}_s}}) has not been specified.  In principle, we could normalize {\\ensuremath{{\\bf C}_s}}\\  using the observed intensity, but this has been magnified by an (a priori) unknown lensing magnification.  \n\nInstead, we normalize {\\ensuremath{{\\bf C}_s}}\\ by maximizing the marginalized likelihood (Bayesian evidence) for the fixed-parameter lens model, as discussed in \\citet{suyu:06}.  We can scale an arbitrarily normalized source covariance matrix $\\hat{{\\ensuremath{{\\bf C}_s}}}$ (which in essence only defines the form of the prior), to get an appropriately scaled matrix ${\\ensuremath{{\\bf C}_s}}=\\lambda \\hat{{\\ensuremath{{\\bf C}_s}}}$, where $\\lambda$ is a scaling parameter which can be determined by solving\n\n", "index": 11, "text": "\\begin{equation}\nN_s - \\lambda \\mathrm{Tr}([{\\bf FL} +  \\hat{{\\ensuremath{{\\bf C}_s}}} ]^{-1}\\hat{{\\ensuremath{{\\bf C}_s}}}^{-1}) - \\lambda \\bm{S}^{\\sf T}  \\hat{{\\ensuremath{{\\bf C}_s}}}\\bm{S} = 0\\,,\n\\label{lambda_norm}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"N_{s}-\\lambda\\mathrm{Tr}([{\\bf FL}+\\hat{{{\\bf C}_{s}}}]^{-1}\\hat{{{\\bf C}_{s}}%&#10;}^{-1})-\\lambda\\bm{S}^{\\sf T}\\hat{{{\\bf C}_{s}}}\\bm{S}=0\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>N</mi><mi>s</mi></msub><mo>-</mo><mrow><mi>λ</mi><mo>⁢</mo><mi>Tr</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mi>𝐅𝐋</mi><mo>+</mo><mover accent=\"true\"><msub><mi>𝐂</mi><mi>s</mi></msub><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mover accent=\"true\"><msub><mi>𝐂</mi><mi>s</mi></msub><mo stretchy=\"false\">^</mo></mover><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>λ</mi><mo>⁢</mo><msup><mi>𝑺</mi><mi>𝖳</mi></msup><mo>⁢</mo><mover accent=\"true\"><msub><mi>𝐂</mi><mi>s</mi></msub><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mi>𝑺</mi></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere {\\ensuremath{{\\cal L}}}\\ is the joint posterior PDF and {\\ensuremath{{\\cal  E} }}\\  is given by Equation~\\eqref{chi2}, which we rewrite as\n\n", "itemtype": "equation", "pos": 25016, "prevtext": "  \nwhere $N_s$ is the number of source pixels and $\\bm{S}$ is determined using Equation~\\eqref{reconstruct}. This equation can then be solved non-linearly. \n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 0 0 0 0, clip, width=0.90\\textwidth]{fig1.pdf}\n\\centering\n\\end{center}\n\\caption{Posterior PDF for the lens model parameters for a mock dataset of a 2-hour long observation of a 50 mJy source with an antenna configuration with maximum baselines of $\\sim2$ km. The different colors correspond to different regularization schemes: gray contours are for a gradient prior, and red contours are for a curvature prior \\citep{warren:03}.  We see no evidence of systematic biases in the reconstructed parameters. The results shown here are typical of the mocks we have simulated. \n\\label{fig:Warrens_Sim_Post}}\n\\end{figure*}\n\n\n\\section{Searching for subhalos}\n\\label{sec:subhalofinding_method}\n\n\nEquation~\\eqref{chi2} tells us how well any lens model fits the data.  That model can contain a smooth potential of the main lens, and a number of subhalos.  As we add subhalos to the mass model, the model parameter space grows considerably in dimensionality, and searching that high-dimensional parameter space can become computationally expensive.  In this section, we describe a simple approach towards expediting that search.  Our method relies on first making a linear approximation to the effect of subhalos on the model predictions, in order to identify promising points in parameter space where subhalos could significantly improve the fit.  Once we have identified those promising parameter values using the linearized search, we then conduct searches using the full nonlinear lens equations, starting at those points in parameter space.\n\n\nAs discussed above, lens model predictions are in general highly nonlinear functions of most of the lens parameters, and are linear only in the source parameters.\nIn this section, we show that once a maximum posterior model is found using the procedure described above, we can linearize the model predictions in a small local neighborhood of these fiducial parameters, even when substructure is added to the mass model.  The key aspect of low mass substructure that permits a linearized treatment, even approximately, is that the effects of substructure are perturbative when expanded in the deflection angle.\n\nFor the purpose of our discussion below, it will be useful to separate the subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}\\ from the rest of the parameters $\\bm{p}$ in our notation.  The parameter set $\\bm{p}$ therefore consists of macro-lens density parameters, background source parameters, and other nuisance parameter (e.g., antenna phases), while we reserve the subhalo parameters as {\\ensuremath{\\bm{p}_{\\rm sub}}}.  \n\nTo infer the presence of subhalos, we study the posterior PDF for the subhalo parameters, {\\ensuremath{\\bm{p}_{\\rm sub}}},  marginalized over all the rest of the parameters $\\bm{p}$, and we compare to the marginalized posterior PDFs in models with different numbers of subhalos. In particular, the ratio of the marginalized posterior of a subhalo model with mass $M_{\\rm sub}>0$ to that of a model without subhalos (or equivalently, with $M_{\\rm sub}=0$)  provides a route to the marginal posterior for the presence of the given subhalo. \n\nIn our approach, we first find the maximum posterior smooth model using the procedure described in Section~\\ref{sec:framework}. Next, we consider the effect of subhalos.  Note that the effects of low-mass subhalos on the lensing deflection angles entering the matrix ${\\bf L}$ are quite small in general.  More precisely, low-mass substructure produces only a small perturbation to the deflection angle at every location.  This suggests a linearized treatment of subhalos \\citep{dalal:02,Hezaveh13A}.\nFor a given subhalo (which could be parameterized by its location and mass), we add the subhalo deflections to the deflections arising from the best-fit smooth lensing potential model.\nWe write the marginalized posterior, ${\\ensuremath{{\\cal L}}}_m$, for the subhalo of that mass and that location as\n\n", "index": 13, "text": "\\begin{equation}\n{\\ensuremath{{\\cal L}}}_m({\\ensuremath{\\bm{p}_{\\rm sub}}}) = \\int {\\ensuremath{{\\cal L}}} (\\bm{p},{\\ensuremath{\\bm{p}_{\\rm sub}}}) {\\rm d}\\bm{p} \\propto \\int e^{-\\frac{1}{2} {\\ensuremath{{\\cal  E} }}}  {\\rm d}\\bm{p}\n\\label{marg}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{{\\cal L}}_{m}({\\bm{p}_{\\rm sub}})=\\int{{\\cal L}}(\\bm{p},{\\bm{p}_{\\rm sub}}){%&#10;\\rm d}\\bm{p}\\propto\\int e^{-\\frac{1}{2}{{\\cal E}}}{\\rm d}\\bm{p}\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo>,</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>𝒑</mi></mrow></mrow></mrow><mo>∝</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo>d</mo><mi>𝒑</mi></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nin order to make the dependence on {\\ensuremath{\\bm{p}_{\\rm sub}}}\\ explicit.\nHere, {\\ensuremath{{\\bf C}_{\\rm p}}}\\ is the prior covariance matrix of all parameters  ${\\bm p}$, and {\\ensuremath{{\\bf C}_{\\rm p}}}\\ contains the block {\\ensuremath{{\\bf C}_s}}\\, as described in the previous section.\nNote that as in Equation~\\eqref{chi2}, our expression for {\\ensuremath{{\\cal  E} }}\\  still includes a prior term, so that it does not solely reflect the goodness-of-fit.   The integral in Equation~\\eqref{marg} is analytic when we can use a linearized treatment of parameters, i.e.,\\ when subhalos are perturbative \\citep{hezaveh:14a}  (also known as the Laplace approximation). To leading order, we can write \n\n", "itemtype": "equation", "pos": 25422, "prevtext": "\nwhere {\\ensuremath{{\\cal L}}}\\ is the joint posterior PDF and {\\ensuremath{{\\cal  E} }}\\  is given by Equation~\\eqref{chi2}, which we rewrite as\n\n", "index": 15, "text": "\\begin{equation} \\label{chi2linear}\n\\begin{split}\n{\\ensuremath{{\\cal  E} }}(\\bm{p}, {\\ensuremath{\\bm{p}_{\\rm sub}}}) =&  [\\bm{D} - \\bm{M}(\\bm{p}, {\\ensuremath{\\bm{p}_{\\rm sub}}})]^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} [\\bm{D} - \\bm{M}(\\bm{p}, {\\ensuremath{\\bm{p}_{\\rm sub}}})] \\\\ &  + \\  \\bm{p}^{\\sf T} {\\ensuremath{{\\bf C}_{\\rm p}}}^{-1} \\bm{p} \\,, \n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle{{\\cal E}}(\\bm{p},{\\bm{p}_{\\rm sub}})=&amp;\\displaystyle%&#10;[\\bm{D}-\\bm{M}(\\bm{p},{\\bm{p}_{\\rm sub}})]^{\\sf T}{{\\bf C}_{N}}^{-1}[\\bm{D}-%&#10;\\bm{M}(\\bm{p},{\\bm{p}_{\\rm sub}})]\\\\&#10;&amp;\\displaystyle+\\ \\bm{p}^{\\sf T}{{\\bf C}_{\\rm p}}^{-1}\\bm{p}\\,,\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo>,</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mi/></mrow></mtd><mtd columnalign=\"left\"><mrow><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mi>𝑫</mi><mo>-</mo><mrow><mi>𝑴</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo>,</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>𝑫</mi><mo>-</mo><mrow><mi>𝑴</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo>,</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mrow><mo rspace=\"7.5pt\">+</mo><mrow><msup><mi>𝒑</mi><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi mathvariant=\"normal\">p</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>𝒑</mi></mpadded></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nfor some fiducial parameter set $\\bm{p}_0$, which we take to be the smooth model parameters from the maximum posterior model without substructure.  Substituting this expression for $\\bm{M}$ into {\\ensuremath{{\\cal  E} }} \\  gives us a quadratic expression in the parameter shift $\\Delta\\bm{p}$,\n\n", "itemtype": "equation", "pos": 26508, "prevtext": "\nin order to make the dependence on {\\ensuremath{\\bm{p}_{\\rm sub}}}\\ explicit.\nHere, {\\ensuremath{{\\bf C}_{\\rm p}}}\\ is the prior covariance matrix of all parameters  ${\\bm p}$, and {\\ensuremath{{\\bf C}_{\\rm p}}}\\ contains the block {\\ensuremath{{\\bf C}_s}}\\, as described in the previous section.\nNote that as in Equation~\\eqref{chi2}, our expression for {\\ensuremath{{\\cal  E} }}\\  still includes a prior term, so that it does not solely reflect the goodness-of-fit.   The integral in Equation~\\eqref{marg} is analytic when we can use a linearized treatment of parameters, i.e.,\\ when subhalos are perturbative \\citep{hezaveh:14a}  (also known as the Laplace approximation). To leading order, we can write \n\n", "index": 17, "text": "\\begin{equation}\n\\bm{M}(\\bm{p}=\\bm{p}_0+\\Delta\\bm{p}) = \\bm{M}(\\bm{p}_0) + \n\\frac{\\partial \\bm{M}}{\\partial \\bm{p}}       \\Delta \\bm{p}\n\\label{MP_linear}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\bm{M}(\\bm{p}=\\bm{p}_{0}+\\Delta\\bm{p})=\\bm{M}(\\bm{p}_{0})+\\frac{\\partial\\bm{M}%&#10;}{\\partial\\bm{p}}\\Delta\\bm{p}\" display=\"block\"><mrow><mi>𝑴</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝒑</mi><mo>=</mo><msub><mi>𝒑</mi><mn>0</mn></msub><mo>+</mo><mi mathvariant=\"normal\">Δ</mi><mi>𝒑</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>𝑴</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝑴</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒑</mi></mrow></mfrac><mi mathvariant=\"normal\">Δ</mi><mi>𝒑</mi></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere\n\n", "itemtype": "equation", "pos": 26972, "prevtext": "\nfor some fiducial parameter set $\\bm{p}_0$, which we take to be the smooth model parameters from the maximum posterior model without substructure.  Substituting this expression for $\\bm{M}$ into {\\ensuremath{{\\cal  E} }} \\  gives us a quadratic expression in the parameter shift $\\Delta\\bm{p}$,\n\n", "index": 19, "text": "\\begin{equation}\n{\\ensuremath{{\\cal  E} }}(\\bm{p}_0+\\Delta\\bm{p},{\\ensuremath{\\bm{p}_{\\rm sub}}}) = {\\ensuremath{{\\cal  E} }}_0 + \n2{\\ensuremath{{\\bm{W}}}}^{\\sf T} \\Delta\\bm{p} + \\Delta\\bm{p}^{\\sf T} {\\ensuremath{{\\bf R}}}^{-1} \\Delta\\bm{p},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"{{\\cal E}}(\\bm{p}_{0}+\\Delta\\bm{p},{\\bm{p}_{\\rm sub}})={{\\cal E}}_{0}+2{{\\bm{W%&#10;}}}^{\\sf T}\\Delta\\bm{p}+\\Delta\\bm{p}^{\\sf T}{{\\bf R}}^{-1}\\Delta\\bm{p},\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝒑</mi><mn>0</mn></msub><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝒑</mi></mrow></mrow><mo>,</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mn>0</mn></msub><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msup><mi>𝑾</mi><mi>𝖳</mi></msup><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝒑</mi></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>𝒑</mi><mi>𝖳</mi></msup><mo>⁢</mo><msup><mi>𝐑</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝒑</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nand $\\Delta\\bm{D}=\\bm{D} - \\bm{M}(\\bm{p}_0,{\\ensuremath{\\bm{p}_{\\rm sub}}})$ consists of the residuals between the data and the predictions of the {\\em unadjusted} smooth model plus subhalo.  Performing the integral in Equation \\eqref{marg} then gives the likelihood for the subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}, marginalized over all nuisance parameters $\\bm{p}$,\n\n", "itemtype": "equation", "pos": 27235, "prevtext": "\nwhere\n\n", "index": 21, "text": "\\begin{align}\n{\\ensuremath{{\\cal  E} }}_0 &= \\Delta\\bm{D}^{\\sf T} {\\ensuremath{{\\bf C}_N}}^{-1} \\Delta\\bm{D}+ \\bm{p}_0^{\\sf T} {\\ensuremath{{\\bf C}_{\\rm p}}}^{-1} \\bm{p}_0 \\\\\n{\\ensuremath{{\\bf R}}} &= \\left[{\\frac{\\partial \\bm{M}}{\\partial \\bm{p}}}^{\\sf T}  {\\ensuremath{{\\bf C}_N}}^{-1}  {\\frac{\\partial \\bm{M}}{\\partial \\bm{p}}} + {\\ensuremath{{\\bf C}_{\\rm p}}}^{-1} \\right]^{-1} \\\\\n{\\ensuremath{{\\bm{W}}}} &= {\\frac{\\partial \\bm{M}}{\\partial \\bm{p}}}^{\\sf T}  {\\ensuremath{{\\bf C}_N}}^{-1} \\Delta\\bm{D}  -  {\\ensuremath{{\\bf C}_{\\rm p}}}^{-1} \\bm{p}_0\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{{\\cal E}}_{0}\" display=\"inline\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mn>0</mn></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\Delta\\bm{D}^{\\sf T}{{\\bf C}_{N}}^{-1}\\Delta\\bm{D}+\\bm{p}_{0}^{%&#10;\\sf T}{{\\bf C}_{\\rm p}}^{-1}\\bm{p}_{0}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>𝑫</mi><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝑫</mi></mrow><mo>+</mo><mrow><msubsup><mi>𝒑</mi><mn>0</mn><mi>𝖳</mi></msubsup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi mathvariant=\"normal\">p</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><msub><mi>𝒑</mi><mn>0</mn></msub></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{{\\bf R}}\" display=\"inline\"><mi>𝐑</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left[{\\frac{\\partial\\bm{M}}{\\partial\\bm{p}}}^{\\sf T}{{\\bf C}_{N%&#10;}}^{-1}{\\frac{\\partial\\bm{M}}{\\partial\\bm{p}}}+{{\\bf C}_{\\rm p}}^{-1}\\right]^{%&#10;-1}\" display=\"inline\"><mrow><mi/><mo>=</mo><msup><mrow><mo>[</mo><mrow><mrow><msup><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝑴</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒑</mi></mrow></mfrac></mstyle><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝑴</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒑</mi></mrow></mfrac></mstyle></mrow><mo>+</mo><mmultiscripts><mi>𝐂</mi><mi mathvariant=\"normal\">p</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{{\\bm{W}}}\" display=\"inline\"><mi>𝑾</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle={\\frac{\\partial\\bm{M}}{\\partial\\bm{p}}}^{\\sf T}{{\\bf C}_{N}}^{-1%&#10;}\\Delta\\bm{D}-{{\\bf C}_{\\rm p}}^{-1}\\bm{p}_{0}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msup><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝑴</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒑</mi></mrow></mfrac></mstyle><mi>𝖳</mi></msup><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>N</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝑫</mi></mrow><mo>-</mo><mrow><mmultiscripts><mi>𝐂</mi><mi mathvariant=\"normal\">p</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>⁢</mo><msub><mi>𝒑</mi><mn>0</mn></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere we define an effective marginalized ${\\ensuremath{{\\cal  E} }}_m({\\ensuremath{\\bm{p}_{\\rm sub}}})$ in terms of the log of the marginalized likelihood,\n\n", "itemtype": "equation", "pos": 28181, "prevtext": "\nand $\\Delta\\bm{D}=\\bm{D} - \\bm{M}(\\bm{p}_0,{\\ensuremath{\\bm{p}_{\\rm sub}}})$ consists of the residuals between the data and the predictions of the {\\em unadjusted} smooth model plus subhalo.  Performing the integral in Equation \\eqref{marg} then gives the likelihood for the subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}, marginalized over all nuisance parameters $\\bm{p}$,\n\n", "index": 23, "text": "\\begin{equation}\n{\\ensuremath{{\\cal L}}}_m({\\ensuremath{\\bm{p}_{\\rm sub}}}) \\propto |{\\ensuremath{{\\bf R}}}|^{-1} e^{-\\frac{1}{2}{\\ensuremath{{\\cal  E} }}_0} \\, e^{\\frac{1}{2} {\\ensuremath{{\\bm{W}}}}^{\\sf T} {\\ensuremath{{\\bf R}}}^{-1} {\\ensuremath{{\\bm{W}}}}} \\equiv e^{-\\frac{1}{2}{\\ensuremath{{\\cal  E} }}_m({\\ensuremath{\\bm{p}_{\\rm sub}}})},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"{{\\cal L}}_{m}({\\bm{p}_{\\rm sub}})\\propto|{{\\bf R}}|^{-1}e^{-\\frac{1}{2}{{\\cal&#10;E%&#10;}}_{0}}\\,e^{\\frac{1}{2}{{\\bm{W}}}^{\\sf T}{{\\bf R}}^{-1}{{\\bm{W}}}}\\equiv e^{-%&#10;\\frac{1}{2}{{\\cal E}}_{m}({\\bm{p}_{\\rm sub}})},\" display=\"block\"><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝐑</mi><mo stretchy=\"false\">|</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mn>0</mn></msub></mrow></mrow></msup></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msup><mi>𝑾</mi><mi>𝖳</mi></msup><mo>⁢</mo><msup><mi>𝐑</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝑾</mi></mrow></msup></mrow><mo>≡</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nAgain, $e^{-0.5 \\ {\\ensuremath{{\\cal  E} }}_0}$ is proportional to the posterior if  we assign uniform priors to the subhalo parameters and we add a subhalo to our best-fit smooth model without adjusting the parameters (i.e., for $\\bm{p}=\\bm{p}_0$): the ${\\ensuremath{{\\bm{W}}}}^{\\sf T}{\\ensuremath{{\\bf R}}}{\\ensuremath{{\\bm{W}}}}$ term accounts for the marginalization over the smooth model parameters $\\bm{p}$.\nSince {\\ensuremath{{\\bf R}}}\\ does not depend on subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}, we can write the difference of log posterior for two models as \n\n", "itemtype": "equation", "pos": 28699, "prevtext": "\nwhere we define an effective marginalized ${\\ensuremath{{\\cal  E} }}_m({\\ensuremath{\\bm{p}_{\\rm sub}}})$ in terms of the log of the marginalized likelihood,\n\n", "index": 25, "text": "\\begin{equation}\n{\\ensuremath{{\\cal  E} }}_m = {\\ensuremath{{\\cal  E} }}_0 - {\\ensuremath{{\\bm{W}}}}^{\\sf T}{\\ensuremath{{\\bf R}}}{\\ensuremath{{\\bm{W}}}} + {\\rm const}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"{{\\cal E}}_{m}={{\\cal E}}_{0}-{{\\bm{W}}}^{\\sf T}{{\\bf R}}{{\\bm{W}}}+{\\rm const}.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>m</mi></msub><mo>=</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mn>0</mn></msub><mo>-</mo><mrow><msup><mi>𝑾</mi><mi>𝖳</mi></msup><mo>⁢</mo><mi>𝐑</mi><mo>⁢</mo><mi>𝑾</mi></mrow></mrow><mo>+</mo><mi>const</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere ${\\ensuremath{{\\cal  E} }}_{m0}$ corresponds to the marginalized likelihood for the model with no subhalos.  \n\nBecause we parametrize the source emission using pixel brightnesses on a fixed grid, rather than using parameters like the locations of source clumps that can freely move, one subtlety that arises in the above expressions is that the matrix $\\partial \\bm{M} / \\partial \\bm{p}$ must involve {\\em convective} derivatives rather than partial derivatives.  These convective derivatives introduce certain nonlinear terms which naively might appear to be small, but in practice we have found that neglecting the distinction between convective derivatives and partial derivatives can lead to significant errors in estimating the ability of the smooth (macro) model to compensate for the effects of substructure, in particular for the most massive subhalos.  To calculate the required convective derivatives, we evaluate the derivative $\\partial \\bm{M} / \\partial \\bm{p}$ in Equation~\\eqref{MP_linear} using a deflection field that includes deflection from the subhalo model under consideration.  \n\nUsing the procedure described above, we can map out the marginalized posterior of models as a function of the subhalo parameters (e.g., location and mass).  If we find any locations within the substructure parameter space that appear to significantly improve the fit, we then initiate an optimization of the model parameters using the full nonlinear lens equations, starting from the most promising points found using the linearized search.\n\nIt is worth stressing that the linearized lens model is very accurate over most of the subhalo parameter space, as long as subhalo effects are small.  The only locations where the linearized model predictions differ noticeably from fully nonlinear model predictions are where subhalos produce significant changes to the posterior, i.e., where $|\\Delta{\\ensuremath{{\\cal  E} }}| \\gtrsim 20$, which in general only occurs within a small fraction of the possible parameter space.  Thanks to the high accuracy of the linearized approximation, we can use the maps of ${\\ensuremath{{\\cal  E} }}_m$ not only to identify promising starting points for our nonlinear search, but {\\em also} to exclude subhalos over much of the possible parameter space where subhalos are ruled out.  In other words, we can use the maps of ${\\ensuremath{{\\cal  E} }}_m$ to derive constraints on the presence of subhalos, and in principle, derive constraints on the mean abundance of subhalos.  To derive bounds on the abundance, we would similarly need to map out ${\\ensuremath{{\\cal  E} }}_m$ for models that have 2 subhalos, 3 subhalos, and so on, for all possible subhalo locations.  However, because we are considering subhalos of low mass, their effects on the observables are perturbative and restricted to localized regions on the sky.  We will argue below that this allows us to derive approximate constraints on the subhalo abundance from maps of ${\\ensuremath{{\\cal  E} }}_m$ from models containing one subhalo. \n\n\\section{implementation, simulations, and tests}\n\\label{sec:implement}\n\nPerhaps the most challenging aspect of this analysis is the sheer volume of the visibility data provided by interferometers such as ALMA. For ALMA long-baseline campaign observations of SDP.81  \\citep{Fomalont:15}, visibilities were typically recorded every 0.5 seconds for hundreds of baselines, each with more than 1000 spectral channels. This results in about $10^8$ visibilities for a four-hour long observation. For a reasonable pixel size, the size of the resulting Fourier operator alone can exceed a few terabytes, and fitting many models to such matrices is beyond the capabilities of medium-size clusters. Fortunately, careful binning of the visibilities can make the problem tractable. Because of the non-zero antenna size, each visibility actually samples a range of spatial frequencies around its nominal $uv$ location and visibilities within an antenna diameter of each other are highly correlated. Binning visibilities within antenna-sized patches of the $uv$-plane can reduce the size of the data dramatically (to fewer than $10^6$ visibilities per spectral channel) without significantly decreasing the information content of the data.\n\n\n\nEven after binning, this is still a computationally challenging task: the matrices are still too large to fit in the memory of single processors, but they can fit across distributed memory on large clusters.  This requires the use of distributed linear-algebra libraries to store and manipulate these matrices. \nIt is also important to note that unlike the blurring matrices used in analyzing CCD images of gravitational lenses, which are extremely sparse, the Fourier operator here is fully dense and does not permit the application of sparse libraries.\nFor these reasons, we take advantage of the ``\\emph{Elemental}'' dense linear algebra library, which efficiently performs linear algebra operations over distributed cores \\citep{Poulson:2013,PSP}.\n\nOur pipeline includes a ``pre-processing'' part, in which the visibilities are binned according to their position in the $uv$-plane and the noise covariance matrix {\\ensuremath{{\\bf C}_N}}\\ is determined. The result of this pre-processing is a vector of binned visibilities which can be modeled as described in Section~\\ref{sec:framework}.  \n\nThe datasets provided by ALMA contain information about the standard deviation of noise for each visibility which are proportional to the system temperature $T_{\\rm sys}$. This information, however, is intended to be used for weighting of the visibilities for imaging purposes and is not adequately scaled to provide accurate root mean square (rms) noise in appropriate units (e.g., Jy).\nThe noise variance cannot be taken directly from the visibilities because their variation contains a significant contribution from the sky signal, which must be removed.\nWe achieve this by first grouping the visibilities into bins that probe the same signal, and then taking differences between visibilities that null the sky within those groups, leaving only noise. \nWe can then either find the best overall scaling for the provided system temperature, $T_{\\rm sys}$, to maximize the likelihood of the observed noise, or alternatively we can simply assume that the variance in the subtracted visibilities is equal to twice the noise variance. We try both methods and find that they provide consistent results.  \n\n\nExplicitly, if we assume that the noise rms is proportional to $T_{\\rm sys}$, we can write ${\\ensuremath{{\\bf C}_N}} = A^2 {\\bf T}^{\\sf T} {\\bf T}$, where ${\\bf T}$ is a diagonal matrix of system temperatures, and $A$ is an unknown scaling factor.  Assuming Gaussian noise gives\n\n", "itemtype": "equation", "pos": 29462, "prevtext": "\nAgain, $e^{-0.5 \\ {\\ensuremath{{\\cal  E} }}_0}$ is proportional to the posterior if  we assign uniform priors to the subhalo parameters and we add a subhalo to our best-fit smooth model without adjusting the parameters (i.e., for $\\bm{p}=\\bm{p}_0$): the ${\\ensuremath{{\\bm{W}}}}^{\\sf T}{\\ensuremath{{\\bf R}}}{\\ensuremath{{\\bm{W}}}}$ term accounts for the marginalization over the smooth model parameters $\\bm{p}$.\nSince {\\ensuremath{{\\bf R}}}\\ does not depend on subhalo parameters {\\ensuremath{\\bm{p}_{\\rm sub}}}, we can write the difference of log posterior for two models as \n\n", "index": 27, "text": "\\begin{equation}\n\\Delta{\\ensuremath{{\\cal  E} }}({\\ensuremath{\\bm{p}_{\\rm sub}}}) \\equiv {\\ensuremath{{\\cal  E} }}_m({\\ensuremath{\\bm{p}_{\\rm sub}}}) - {\\ensuremath{{\\cal  E} }}_{m0}\n\\label{dchi2}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\Delta{{\\cal E}}({\\bm{p}_{\\rm sub}})\\equiv{{\\cal E}}_{m}({\\bm{p}_{\\rm sub}})-{%&#10;{\\cal E}}_{m0}\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒑</mi><mi>sub</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mrow><mi>m</mi><mo>⁢</mo><mn>0</mn></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $\\ensuremath{{\\cal L}}(A)$ is the likelihood of a certain value of $A$,  $\\bm{N}$ is the vector of noise (the residual after subtracting half of visibilities from the other half), and $C$ is the sum of other terms that do not depend on $A$. By solving $\\partial \\log(\\ensuremath{{\\cal L}}(A)) / \\partial A = 0$ for $A$ we get the most likely $A$,\n\n", "itemtype": "equation", "pos": 36427, "prevtext": "\nwhere ${\\ensuremath{{\\cal  E} }}_{m0}$ corresponds to the marginalized likelihood for the model with no subhalos.  \n\nBecause we parametrize the source emission using pixel brightnesses on a fixed grid, rather than using parameters like the locations of source clumps that can freely move, one subtlety that arises in the above expressions is that the matrix $\\partial \\bm{M} / \\partial \\bm{p}$ must involve {\\em convective} derivatives rather than partial derivatives.  These convective derivatives introduce certain nonlinear terms which naively might appear to be small, but in practice we have found that neglecting the distinction between convective derivatives and partial derivatives can lead to significant errors in estimating the ability of the smooth (macro) model to compensate for the effects of substructure, in particular for the most massive subhalos.  To calculate the required convective derivatives, we evaluate the derivative $\\partial \\bm{M} / \\partial \\bm{p}$ in Equation~\\eqref{MP_linear} using a deflection field that includes deflection from the subhalo model under consideration.  \n\nUsing the procedure described above, we can map out the marginalized posterior of models as a function of the subhalo parameters (e.g., location and mass).  If we find any locations within the substructure parameter space that appear to significantly improve the fit, we then initiate an optimization of the model parameters using the full nonlinear lens equations, starting from the most promising points found using the linearized search.\n\nIt is worth stressing that the linearized lens model is very accurate over most of the subhalo parameter space, as long as subhalo effects are small.  The only locations where the linearized model predictions differ noticeably from fully nonlinear model predictions are where subhalos produce significant changes to the posterior, i.e., where $|\\Delta{\\ensuremath{{\\cal  E} }}| \\gtrsim 20$, which in general only occurs within a small fraction of the possible parameter space.  Thanks to the high accuracy of the linearized approximation, we can use the maps of ${\\ensuremath{{\\cal  E} }}_m$ not only to identify promising starting points for our nonlinear search, but {\\em also} to exclude subhalos over much of the possible parameter space where subhalos are ruled out.  In other words, we can use the maps of ${\\ensuremath{{\\cal  E} }}_m$ to derive constraints on the presence of subhalos, and in principle, derive constraints on the mean abundance of subhalos.  To derive bounds on the abundance, we would similarly need to map out ${\\ensuremath{{\\cal  E} }}_m$ for models that have 2 subhalos, 3 subhalos, and so on, for all possible subhalo locations.  However, because we are considering subhalos of low mass, their effects on the observables are perturbative and restricted to localized regions on the sky.  We will argue below that this allows us to derive approximate constraints on the subhalo abundance from maps of ${\\ensuremath{{\\cal  E} }}_m$ from models containing one subhalo. \n\n\\section{implementation, simulations, and tests}\n\\label{sec:implement}\n\nPerhaps the most challenging aspect of this analysis is the sheer volume of the visibility data provided by interferometers such as ALMA. For ALMA long-baseline campaign observations of SDP.81  \\citep{Fomalont:15}, visibilities were typically recorded every 0.5 seconds for hundreds of baselines, each with more than 1000 spectral channels. This results in about $10^8$ visibilities for a four-hour long observation. For a reasonable pixel size, the size of the resulting Fourier operator alone can exceed a few terabytes, and fitting many models to such matrices is beyond the capabilities of medium-size clusters. Fortunately, careful binning of the visibilities can make the problem tractable. Because of the non-zero antenna size, each visibility actually samples a range of spatial frequencies around its nominal $uv$ location and visibilities within an antenna diameter of each other are highly correlated. Binning visibilities within antenna-sized patches of the $uv$-plane can reduce the size of the data dramatically (to fewer than $10^6$ visibilities per spectral channel) without significantly decreasing the information content of the data.\n\n\n\nEven after binning, this is still a computationally challenging task: the matrices are still too large to fit in the memory of single processors, but they can fit across distributed memory on large clusters.  This requires the use of distributed linear-algebra libraries to store and manipulate these matrices. \nIt is also important to note that unlike the blurring matrices used in analyzing CCD images of gravitational lenses, which are extremely sparse, the Fourier operator here is fully dense and does not permit the application of sparse libraries.\nFor these reasons, we take advantage of the ``\\emph{Elemental}'' dense linear algebra library, which efficiently performs linear algebra operations over distributed cores \\citep{Poulson:2013,PSP}.\n\nOur pipeline includes a ``pre-processing'' part, in which the visibilities are binned according to their position in the $uv$-plane and the noise covariance matrix {\\ensuremath{{\\bf C}_N}}\\ is determined. The result of this pre-processing is a vector of binned visibilities which can be modeled as described in Section~\\ref{sec:framework}.  \n\nThe datasets provided by ALMA contain information about the standard deviation of noise for each visibility which are proportional to the system temperature $T_{\\rm sys}$. This information, however, is intended to be used for weighting of the visibilities for imaging purposes and is not adequately scaled to provide accurate root mean square (rms) noise in appropriate units (e.g., Jy).\nThe noise variance cannot be taken directly from the visibilities because their variation contains a significant contribution from the sky signal, which must be removed.\nWe achieve this by first grouping the visibilities into bins that probe the same signal, and then taking differences between visibilities that null the sky within those groups, leaving only noise. \nWe can then either find the best overall scaling for the provided system temperature, $T_{\\rm sys}$, to maximize the likelihood of the observed noise, or alternatively we can simply assume that the variance in the subtracted visibilities is equal to twice the noise variance. We try both methods and find that they provide consistent results.  \n\n\nExplicitly, if we assume that the noise rms is proportional to $T_{\\rm sys}$, we can write ${\\ensuremath{{\\bf C}_N}} = A^2 {\\bf T}^{\\sf T} {\\bf T}$, where ${\\bf T}$ is a diagonal matrix of system temperatures, and $A$ is an unknown scaling factor.  Assuming Gaussian noise gives\n\n", "index": 29, "text": "\\begin{equation}\n\\log(\\ensuremath{{\\cal L}}(A)) = -\\frac{1}{2} \\log(|A {\\bf T}|) - \\frac{1}{2}  \\bm{N} A{\\bf T} \\bm{N} + C\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\log({\\cal L}(A))=-\\frac{1}{2}\\log(|A{\\bf T}|)-\\frac{1}{2}\\bm{N}A{\\bf T}\\bm{N}%&#10;+C\\,,\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>A</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>A</mi><mo>⁢</mo><mi>𝐓</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>𝑵</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mi>𝐓</mi><mo>⁢</mo><mi>𝑵</mi></mrow></mrow><mo>+</mo><mpadded width=\"+1.7pt\"><mi>C</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $n$ is the number of visibilities used to estimate $A$ (half of all visibilities, since one half is subtracted from the other to remove the signal). We build the noise covariance matrix ${\\ensuremath{{\\bf C}_N}}$ by scaling the system temperatures with this scaling. \nWith appropriate variances in hand, we fit the visibilities with a smooth lens model, and search for subhalos perturbatively using the procedure described in Section~\\ref{sec:subhalofinding_method}. \n\n\n\n\\subsection{Mock observations}\n\nWe have performed a large number of tests, described below, using mock data, to ensure that the pipeline provides accurate results. We have tested for errors in the noise estimation and for biases in the smooth lens model.  These simulations also quantify our false positive detection rate and subhalo detection efficiency. \n\n\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_1.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_2.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_3.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_4.pdf}\n\\centering\n\\end{center}\n\\caption{ Maps of $\\Delta {\\ensuremath{{\\cal  E} }}$ (Equation \\ref{dchi2}) as a function of location, for a subhalo of mass $M=4\\times 10^8 M_\\odot$, using simulated data. Positive $\\Delta{\\ensuremath{{\\cal  E} }}$ corresponds to subhalos excluded at that location, while negative $\\Delta{\\ensuremath{{\\cal  E} }}$ corresponds to subhalos improving the log-posterior.  The mock data for the top left panel are for a simulation without any substructure, and our analysis excludes the presence of subhalos of this mass over the area of sensitivity.  The simulated arcs have been overlaid with white contours. In the remaining panels, the mocks contain a subhalo at the location of the blue circled cross. The simulation for the top right panel does not include phase errors in the measurements, the lower left panel includes such errors but does not compensate for them, and the lower right panel includes phase errors and marginalizes over them.  All four panels have the same noise realization and a model subhalo mass of $M=4\\times 10^8 M_\\odot$.\n\\label{fig:Mars}}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig3_1.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig3_2.pdf}\n\\centering\n\\end{center}\n\\caption{$\\Delta {\\ensuremath{{\\cal  E} }}$ maps for mock data including a massive ($M_{\\rm sub} = 10^9 M_{\\odot}$) subhalo, showing multiple islands where the addition of a subhalo could produce a better fit. We find that the island producing the lowest $\\Delta {\\ensuremath{{\\cal  E} }}$ corresponds to the true position of the subhalo (blue cross). After adding the detected subhalo to the macro model and searching for a second subhalo the other islands disappear, confirming that they arise from the inability of the smooth model to fit perturbed observations at various locations on the arc. The position of the subhalo is marked with a circled cross.\n\\label{fig:Titan}}\n\\end{figure*}\n\n\n\nThe mock observations for these tests were produced using a fully independent code in order to reduce the chances of duplicating errors. For each mock dataset, a complex background source composed of tens to hundreds of smaller clumps was lensed, and the lensed images were used to simulate ALMA observations using the Common Astronomy Software Applications package (CASA). The data pre-processing steps described above (visibility binning and noise estimation) were applied to the mock data and the binned visibilities were modeled to find a best-fit smooth model.  \n\nTo explore the lens parameter space, we have implemented the Markov chain Monte Carlo (MCMC) algorithm proposed by \\cite{mcmchammer}. We follow the procedure described in \\cite{emcee}. Our implementation allows sampling the posterior in parallel, over many cores, taking advantage of the MPI message-passing system.  On the large computing resources that we have used \\citep[e.g.,][]{XSEDE}, this allows much faster parameter explorations by evaluating multiple models simultaneously on different cores.\n\n\n\n\nFigure~\\ref{fig:Warrens_Sim_Post} shows the one and two dimensional marginal posterior PDFs for all lens model parameters given a mock data set. The gray shaded contours show the recovered posterior when using a gradient covariance matrix as the source prior. The red contours show the posterior for the same data, but using a curvature prior on the source parameters. The black dashed crosses show the true parameters which were used to generate the mock data. As can be seen, in both cases we successfully manage to recover the parameters with no apparent biases.\n\n\n\nHowever, in the course of our tests, we encountered two issues that could result in biased parameters. The first resulted from using the power-spectrum prior as defined in Equation~\\eqref{sourcePk}. Since the power spectrum does not diverge at $k\\to 0$, this prior tries to minimize the total emission of the unlensed source, i.e., it biases against low magnification. This bias towards high magnification favors shallow radial density slopes. To fix this issue, we removed the DC mode from this covariance matrix, which (similar to the gradient and curvature priors) renders it insensitive to the total sum of source pixel intensities.  We can remove the zero mode of the covariance matrix by replacing\n\n", "itemtype": "equation", "pos": 36921, "prevtext": "\nwhere $\\ensuremath{{\\cal L}}(A)$ is the likelihood of a certain value of $A$,  $\\bm{N}$ is the vector of noise (the residual after subtracting half of visibilities from the other half), and $C$ is the sum of other terms that do not depend on $A$. By solving $\\partial \\log(\\ensuremath{{\\cal L}}(A)) / \\partial A = 0$ for $A$ we get the most likely $A$,\n\n", "index": 31, "text": "\\begin{equation}\nA = \\frac{n}{\\bm{N} {\\bf T} \\bm{N}}\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"A=\\frac{n}{\\bm{N}{\\bf T}\\bm{N}}\\,,\" display=\"block\"><mrow><mrow><mi>A</mi><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mi>n</mi><mrow><mi>𝑵</mi><mo>⁢</mo><mi>𝐓</mi><mo>⁢</mo><mi>𝑵</mi></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhich follows from the Sherman-Morrison theorem.  Here $\\bm{a}$ is a column vector containing only ones (i.e., the zero mode) and $\\bar{{\\ensuremath{{\\bf C}_s}}}$ is the modified covariance matrix with no DC sensitivity. Removing the zero mode removes the bias towards high magnification and small source sizes.\n\n\n\n\nAnother potential source of bias was the choice of the area covered by  source pixels. For a given lens model, if an image pixel is mapped outside the area covered by the source grid, it will automatically be assigned a value of zero. \nA model which maps more image pixels to the defined source area may have more freedom in fitting the data compared to a model with fewer in-source-grid mappings. Therefore under equal conditions, lens models which map all image pixels to some source pixel are  preferred to models which do not. This can result in significant biases in lensing parameters (e.g., ellipticity and slope). To avoid this bias, the size of the source grid should be chosen to be large enough to cover the lensing models during the fitting process \\citep{suyu:06,Vegetti:09}.\n\n\n\\subsection{Phase corruption}\n\nOnce a best-fit model is determined, we start the subhalo search by mapping $\\Delta{\\ensuremath{{\\cal  E} }}$ over the subhalo parameter space (position and mass).  \nAs mentioned earlier, in addition to lens and source parameters, we marginalize over other nuisance parameters in the linear subhalo finder, such as antenna phase errors. This is similar to the procedure described in \\cite{hezaveh:13b}, with the addition of the possibility of imposing a prior on the antenna phase errors and allowing for time-segmented phase errors.\n\nFigure~\\ref{fig:Mars} shows maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ as a function of subhalo position for various cases of simulated data. \nFor a simulation with no subhalo present (top left), the analysis correctly excludes the presence of a subhalo over the region of sensitivity.\nIn the remaining panels, the mocks contain a subhalo at the location of the blue circled cross. The simulation for the top right panel does not include phase errors in the measurements. The subhalo is correctly detected at $\\sim 5\\sigma$ with no false positives. The mocks for the two bottom panels include antenna phase errors. In the bottom left panel we have not corrected for these phase errors, resulting in numerous false positives. The bottom right panel shows the results for the same mock data, when phase errors are marginalized over appropriately, resulting in the disappearance of the false detections. All four panels have the same noise realization.\n\nThis test illustrates one of the reasons why a careful analysis of the visibilities is essential to search for substructure using interferometric data.  Given the  challenges of analyzing large interferometric data sets, one might be tempted to simply analyze CLEAN images instead of visibilities.  \nCLEAN images fix the value of the antenna phases and do not allow them to be marginalized over when comparing different models, which, as illustrated here, could result in spurious detections.  \nIn addition, CLEAN images are produced through a non-linear deconvolution procedure whose effects on the data and the correlated noise properties can not be well quantified. \n It is worth stressing that the effects of low-mass substructure on the lensed images can be quite subtle, and so approximations and assumptions which may not lead to serious errors in other contexts could introduce significant errors for a substructure lensing analysis.  This is why we adopt the approach of explicitly modeling the visibilities and marginalizing over the nuisance parameters.\n\n\nFinally, we note that although in the two right panels of Figure~\\ref{fig:Mars} we only observe a single region with significant negative $\\Delta {\\ensuremath{{\\cal  E} }}$ (where the subhalo is detected), subhalos with larger masses can result in multiple islands. Figure~\\ref{fig:Titan} shows a mock generated using a simulation with a subhalo of mass $M_{\\rm sub}=10^{9}M_{\\odot}$. The left panel shows the $\\Delta {\\ensuremath{{\\cal  E} }}$ map when searching for this subhalo. As can be seen, there are multiple islands  where a subhalo can produce a better fit, however the true position of the subhalo corresponds to the lowest $\\Delta {\\ensuremath{{\\cal  E} }}$. The right panel of Figure~\\ref{fig:Titan} shows the $\\Delta {\\ensuremath{{\\cal  E} }}$ map when the detected subhalo is added to the macro parameters and a search for an additional subhalo is performed, showing that all corresponding islands disappear.\n\n\\section{Results for SDP.81}\n\\label{sec:results}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 0 90 10, clip, width=0.5\\textwidth]{fig4.png}\n\\centering\n\\end{center}\n\\caption{The SDP.81 system.  Grayscale shows HST/WFC3 F160W data, while red contours show ALMA continuum emission in band 6. \n\\label{fig:SDP81ALMAHST}}\n\\end{figure}\n\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 125 50 85 70, clip, width=1.0\\textwidth]{fig5.pdf}\n\\centering\n\\end{center}\n\\caption{Initial subhalo search using ALMA Science Verification observations of SDP.81.  Depicted are maps of linearized  $\\Delta{\\ensuremath{{\\cal  E} }}$ from Equation~\\eqref{dchi2}, showing twice the difference in log marginalized posterior probability density  between a smooth model without substructure, and a model with a subhalo of mass $M=10^{8.6} M_\\odot$, as a function of location of that subhalo.  The three panels correspond to analysis of Band 6 only (left), Band 7 only (middle), and joint Bands 6 and 7 (right).  Based on the significant improvement to the fit provided by substructure (as indicated by the map), we subsequently added one subhalo to our lens model, and re-optimized the model parameters (see Table~\\ref{lens_pars}). The contours in the insets show the 1-, 2-, and $3-\\sigma$ confidence regions for the position of the subhalo from a non-linear joint fit to the data.\n\\label{initial_search}}\n\\end{figure*}\n\n\n\\begin{figure*}[ht]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 110 50 100 50, clip, width=0.90\\textwidth]{fig6.pdf}\n\\centering\n\\end{center}\n\\caption{ The top left panel shows the sky emission model in band 6 for the best-fit smooth lens parameters for the SDP.81 data. The top middle panel shows the same for the perturbed model and the top right panel the difference between the two models. The bottom panels show the same for band 7. The bright feature in the difference plots is mainly caused by the astrometric anomaly of the arc.\n\\label{fig:model_res}}\n\\end{figure*}\n\n\n\n\\begin{figure*}[t]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 50 80 70 70, clip, width=1.0\\textwidth]{fig7.pdf}\n\\centering\n\\end{center}\n\\caption{ Contours show the 1-, 2-, and $3-\\sigma$ (68.3, 95.5, and 99.7\\%) confidence regions for the parameters in our lens model for a joint analysis of bands 6 and 7 data. \n\\label{MCMC_errors}}\n\\end{figure*}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 20 20 10 70, clip, width=0.5\\textwidth]{fig8.pdf}\n\\centering\n\\end{center}\n\\caption{Reconstructed source continuum emission from Band 6 (top panel) and Band 7 (bottom panel) data on a 10 milli-arcsec pixel grid.  The white dashed curve shows the tangential caustic predicted by our best-fit smooth model. \n\\label{fig:rec_src}}\n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 20 20 20 20, clip, width=0.48\\textwidth]{fig9_1.pdf}\n\\includegraphics[trim= 20 20 20 20, clip, width=0.48\\textwidth]{fig9_2.pdf}\n\\centering\n\\end{center}\n\\caption{Search for additional substructure.  Top panel shows a map of linearized $\\Delta{\\ensuremath{{\\cal  E} }}$ for a second subhalo, of mass $M=10^{8.6} M_\\odot$, following the inclusion of one subhalo of mass $M\\approx10^9 M_{\\odot}$ at the location of the blue circled cross, using a joint analysis of bands 6 and 7.  After adding the subhalo to the main lens model, no additional subhalos of this mass are found. The bottom panel shows a similar analysis for a lower mass subhalo, showing a marginal improvement of  ${\\ensuremath{{\\cal  E} }}$ at another point near the first detection.\n\\label{secondpass}}\n\\end{figure}\n\nWe use the recent ALMA Science Verification observations of the strongly lensed system SDP.81 \\citep{SDP81} to illustrate the application of this method to real data. Our analysis shows that this dataset is highly sensitive to the effects of low mass subhalos.  In the analysis presented here, We used only the calibrated continuum data from bands 6 and 7. In future work we will present our analysis of the full dataset, including CO line data.  Figure \\ref{fig:SDP81ALMAHST} shows the lensing galaxy observed by the \\emph{Hubble Space Telescope} (greyscale) superimposed on the lensed arcs observed by ALMA.\n\n\nWe estimate the noise variance for each visibility using the procedure described above and bin the visibilities in 12 meter cells. However, we only bin visibilities that share the same baseline and are taken within a short ($\\lesssim 20$ min) observing period. This allows us to assign a separate antenna phase error to each baseline at different time intervals (since the phase errors could slowly change during the course of an observation). This results in $\\sim0.5$ million binned visibilities, a factor of $\\sim 20$ fewer than the original $\\sim10$ million. We note that the shorter ($\\lesssim 2$ km) baselines in the binned visibilities have significantly higher signal-to-noise compared to the longer baselines because (a) for resolved sources, the signal diminishes on the longest baselines, and (b) the visibilities are sampled more densely on short baselines, meaning that the short-baseline bins contain a larger number of  visibilities. This allows us to speed up our search for the best-fitting parameters using the following approach.  We first use only the subset of baselines shorter than 2 km in our initial MCMC analysis to localize the neighborhood of the best fit.  \nThis approach greatly expedites our MCMC optimization, since many evaluations of the likelihood are required to fully search the highly multidimensional parameter space of our smooth model.\nOnce this initial localization has been achieved, we can use the full dataset. We note, however, that the observations of SDP.81 are performed on various dates which span many weeks, with significantly variable observational conditions, giving rise to a large range in noise properties. We, therefore, decide to model binned visibilities with noise lower than 5.0 and 5.5 mJy in bands 6 and 7 respectively, which contain about 40\\% of the total number of unbinned visibilities. \n\nOur smooth density model consists of the following terms.  First, the main lens is described by a singular elliptical power law surface density profile of the form $\\kappa(x,y) \\propto [x^2+y^2/(1-\\epsilon)^2]^{-\\alpha/2}$ where $\\alpha$ is the radial power-law index, and $x$ and $y$ are measured relative to the lens centroid $x_{\\rm lens}, y_{\\rm lens}$ \\citep{Barkana:98}. To avoid degeneracy of the orientation angle when ellipticity is close to zero, we use fitting parameters $\\epsilon_x$ and $\\epsilon_y$, defined so that $\\epsilon = (\\epsilon_x^2+\\epsilon_y^2)^{1/2}$ and the orientation angle is given by the arctangent of these components. Additionally, we allow for low order angular multipoles in the main lens, of the form $\\kappa_m(r,\\phi) =[A_{m} \\cos(m\\phi) + B_m \\sin(m\\phi)](r/r_s)^{-\\alpha}$ for $m=3,4$, where $r_s = 1^{\\prime\\prime}$. Note that the same radial slope $\\alpha$ and centroid $(x_{\\rm lens}, y_{\\rm lens})$ are used for the multipoles and for the ellipsoidal piece. Finally, we also allow for external shear, parameterized by the usual components $\\gamma_1$ and $\\gamma_2$.  Overall, therefore, our primary lens model contains 12 freely adjustable parameters. \n  \n\n\n\\subsection{Initial subhalo search}\n\nOnce a smooth model is obtained, we use the best-fit parameters to perform a linearized search for subhalos. As we have mentioned above, these lens parameters, source parameters, antenna parameters, etc., all become nuisance parameters that we marginalize over for every different model when we search for subhalos.  We follow \\citet{Hezaveh13A} and model the subhalo deflection field using a truncated isothermal surface density profile, also called a pseudo-Jaffe profile \\citep{Munoz01}.  This profile is characterized by a velocity dispersion $\\sigma_v$ and truncation radius $r_t$, and the total mass of the subhalo is given by $M_{\\rm sub} = \\pi \\sigma_v^2 r_t/G$.  To reduce the dimensionality of the subhalo parameter space, we assume that $r_t$ is related to $\\sigma_v$ by $r_t = (\\sigma_v/\\sqrt{2}\\sigma_G)r_{\\rm E}$, where $\\sigma_G$ is the velocity dispersion of the main lens, determined from its observed Einstein radius $r_{\\rm E}$.  We search for subhalos over a range of subhalo masses, over a $8\\times8$ arcsec area around the lens center. Figure~\\ref{initial_search} shows the results of our initial search.  The figure plots $\\Delta{\\ensuremath{{\\cal  E} }}$, twice the difference in marginalized log posterior between a model with a subhalo compared to our smooth model, as a function of subhalo location for a subhalo mass $M=10^{8.6} M_\\odot$.  As the figure indicates, there are several locations where adding a subhalo improves the posterior considerably, with the most significant having $\\Delta{\\ensuremath{{\\cal  E} }}=-22.2$. \n\nAs discussed above in Section~\\ref{sec:implement}, improper modeling of systematics and unknown errors can lead to spurious detections of substructure.  We have attempted to mitigate these effects by marginalizing over many potential systematics, including time-varying antenna phase errors.  Nevertheless, it is possible that the apparent detection of substructure indicated in Figure~\\ref{initial_search} could be due to an unknown interferometric data corruption, such as visibility decorrelation or rapidly varying antenna phase errors.  \nGiven that such errors are temporally variable, an analysis of multiple datasets observed at different times can reveal if our analysis is affected by them.\nAs a test of this, we analyzed bands 6 and 7 data separately, noting that they were obtained on different dates.\nOur analysis reveals a consistent pattern between the two bands (see Figure~\\ref{initial_search}), giving us confidence that the level of unknown systematics from such effects is below our statistical uncertainties. Figure~\\ref{fig:model_res} illustrates the difference between our best-fitting model without substructure and the best-fitting model with substructure for bands 6 and 7. As expected, the subhalo's effect is largely localized to its immediate vicinity and the counter-images of that region.\n\nBased on the results of this initial linearized search, we then expanded our lens model to include a subhalo, with 3 adjustable parameters: mass $M_{\\rm sub}$, and 2-D location $\\bm{x}_{\\rm sub}$.  We then re-fit the joint data set, re-optimizing all the parameters fully nonlinearly.  We find that a model with a subhalo of mass $M=10^{8.96} M_\\odot$ improves the marginalized log posterior fit by $\\Delta{\\ensuremath{{\\cal  E} }} = -47.3$ in the joint fit (note that the initial linear search was performed at $ M_{\\rm sub}=10^{8.6} M_{\\odot}$).  \nBased upon this result, we conclude that the ALMA Science Verification observations of SDP.81 detect a subhalo in the projected mass distribution. Having found the best-fit parameters for the detected subhalo, we then sample the full parameter space  (smooth lens and subhalo parameters) non-linearly using our Markov Chain Monte Carlo sampler. Figure~\\ref{MCMC_errors} shows the error covariance of the reconstructed lens parameters for the joint fit to bands 6 and 7.\nWe do not find evidence for significant degeneracies between the subhalo parameters and the parameters of the smooth lens model, including low-order multipoles in the gravitational potential.  This confirms  findings that such multipoles cannot mimic the effects of small-scale substructure for lenses with high-quality arcs \\citep{KochDalal04}.  \n\nThe full set of best-fit lens model parameters are presented in Table~\\ref{lens_pars}. Many previous works have modeled the lens potential in SDP.81, using HST data \\citep{Dye:14}, Submillimeter Array data \\citep{Bussmann:13}, and ALMA data \\citep{Dye2015,rybak:2015a,wong2015,tamura2015,hatsukade2015,rybak2015b}. \nOur smooth model has a larger ellipticity compared to these models. We note however that our model has more degrees of freedom (e.g., angular multipoles) and phase errors, and that the degeneracy of some of these additional parameters with ellipticity may shift its value. We do find that models with parameters given by these authors produce reasonable fits to the data. We also performed the linear subhalo search for these parameters, finding that they produce similar results and that the conclusion of the presence of the subhalo is robust against these variations. Figure~\\ref{fig:rec_src} shows the reconstructed source using this model with pixel size of 10 milli-arcsec in band 6 (top panel) and band 7 (bottom panel). \n\nThis model appears to be a good fit to the data, when we fit the entire data set.  The full data set, however, includes emission unrelated to SDP.81.  The ALMA primary beam covers approximately $\\sim 25^{\\prime\\prime}$, of which only the central few arcseconds are relevant for strong lens modeling.  If we model the sky emission only over a $5\\times 5$ arccsec area centered on the lens,  our model obtains $\\chi^2 = 2\\times 10^5$ for $1.7\\times 10^5$ degrees of freedom, suggesting that not all the signal in the data has been modeled. However, if we expand our source-plane image to cover the entire primary beam, additional flux is indicated away from the lensed galaxy and the $\\chi^2$ decreases to $1.7\\times 10^5$. \nSince this emission originates from regions well separated from the lensed images (far beyond the correlation length of the dirty beam), it has no model covariance with the lens parameters, and we therefore neglect it in the remainder of our analysis.\n\n\\begin{table}[tp]\n\\begin{centering}\n\\caption{Best-fit lens parameters with 68\\% uncertainties}\n\\label{lens_pars}\n\\begin{tabular}{lll}\n{\\bf Parameter}    &  {\\bf Definition}     & {\\bf Value}       \\\\ \\hline\n$\\alpha$            &  radial slope      & $1.06  \\pm 0.03$    \\\\\n$\\log_{10} (M_{\\rm 10 kpc})$ & mass within 10 kpc ($M_\\odot$)    & $11.60 \\pm 0.006$   \\\\\n$\\epsilon_x$              & ellipticity  x  & $0.371 \\pm 0.019$     \\\\\n$\\epsilon_y$              & ellipticity  y & $-0.046 \\pm 0.008$     \\\\\n$x_{\\rm lens}$              & lens x ($^{\\prime\\prime}$)  & $0.481 \\pm 0.006$     \\\\\n$y_{\\rm lens}$              & lens y ($^{\\prime\\prime}$)  & $0.154 \\pm 0.005$     \\\\\n$\\gamma_1$                 & external shear   & $0.0004 \\pm 0.006$ \\\\\n$\\gamma_2$                 & external shear   & $0.0017 \\pm 0.006$ \\\\\n$A_{3}$          & m=3 multipole   & $[5.90 \\pm 6.26]\\times 10^{-3}$ \\\\\n$B_{3}$          & m=3 multipole   & $[25.44 \\pm 6.00]\\times 10^{-3}$ \\\\\n$A_{4}$          & m=4 multipole   & $[12.53 \\pm 10.10]\\times 10^{-3}$ \\\\\n$B_{4}$          & m=4 multipole   & $[6.52 \\pm 11.20]\\times 10^{-3}$ \\\\\n$\\log_{10} (M_{\\rm sub})$          & subhalo mass ($M_\\odot$) & $8.96 \\pm 0.12$ \\\\\n$x_{\\rm sub}$          & subhalo position x ($^{\\prime\\prime}$) & $-0.694 \\pm 0.025$ \\\\\n$y_{\\rm sub}$          & subhalo position y ($^{\\prime\\prime}$) & $0.749 \\pm 0.044$ \n\\end{tabular}\\par\n\\end{centering}\n\\medskip\n\\textsc{Table}~\\ref{lens_pars}.--- Table of best-fit parameter values from a joint fit to bands 6 and 7 data.  Positions are in arcseconds relative to the ALMA phase center.\n\\end{table}\n\n\n\\subsection{Search for additional substructure}\n\n\\begin{figure*}[ht]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 30 40 0 0, clip, width=1.00\\textwidth]{fig10.pdf}\n\\centering\n\\end{center}\n\\caption{ Maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ for a 3rd subhalo. When two subhalos are included in our main lens model, no significant evidence for any additional substructure is found in the joint band 6 and 7 analysis.  \n\\label{fig:subhalo_chi2_maps}}\n\\end{figure*}\n\nALMA observations of SDP.81 allow us to search for additional substructure besides the subhalo detected in the previous subsection.  Given our lens model (including one subhalo of $M_{\\rm sub}=10^{8.96} M_{\\odot}$), we next searched for additional substructure using the linearized treatment discussed in Section~\\ref{sec:subhalofinding_method}.  We repeated our search for a second subhalo, by linearly expanding about a smooth model now containing a subhalo of mass $M_{\\rm sub}=10^{8.96} M_{\\odot}$.  As before, we marginalize over all parameters of the smooth model, including the mass and location of the detected subhalo discussed above.\n\nThe inclusion of the subhalo in our main lens model removes any improvement to the marginalized posterior from additional subhalos of mass $M_{\\rm sub}\\ge 10^{8.6} M_\\odot$, as illustrated in top panel of Figure~\\ref{secondpass}.  Instead, additional subhalos of this mass are excluded from occurring near the observed arcs.  For lower subhalo masses, however, we find that there are certain locations where addition of a second subhalo can improve the marginalized posterior.  The lower panel of Figure~\\ref{secondpass} illustrates this for $M=10^{8} M_\\odot$.  The red regions in the map depict the locations where a subhalo of this mass can improve the marginalized posterior.  Based on the improvement suggested in this figure, we attempted adding a second subhalo to our main lens model.  Our nonlinear fit found that a subhalo of mass $M\\approx 10^8 M_\\odot$ could improve the fit marginally, with $\\Delta{\\ensuremath{{\\cal  E} }} \\approx -22$, compared to the 1-subhalo model.  \n\nWe are hesitant to consider this a detection of a second object, however.  First, the detection is marginal $(<5\\sigma)$.  Also, the second object is spatially near the $M_{\\rm sub}=10^{8.96} M_\\odot$ subhalo.  This suggests that the second object may possibly be an artifact of our modeling.  We have assumed an extremely simple mass profile for the subhalos, a spherical tidally truncated pseudo-Jaffe model, which is unlikely to describe realistic subhalos in great detail.  Small deviations in the actual mass profile compared to our model could show up as residuals that could be fitted by lower mass substructure.  On the other hand, this object could be real.  The close proximity to the first subhalo might arise simply because our area of sensitivity to detecting subhalos is relatively narrow.  Given these ambiguities, we do not label the second object as a detection, however we do include it in our main lens model.  Inclusion of additional data, in particular the CO lines which we have not used in this analysis, may be able to determine conclusively whether a lower mass subhalo is present.  To avoid biases arising from assuming a specific subhalo profile, it may be advantageous to reconstruct  the substructure density field with more flexible models.  For example,  a pixelated substructure map \\citep[e.g.,][]{Vegetti:09} would allow more freedom in the inferred substructure density field.  Given the quality of the ALMA SDP.81 data set,  such an approach may be warranted.\n\n\nFollowing the inclusion of this second subhalo in our lens model, no significant evidence for additional substructure is found in the dataset (see figure\\ \\ref{fig:subhalo_chi2_maps}).  \n\n\n\\subsection{Bounds on the subhalo mass function}\n\nOur modeling of the mass distribution around SDP.81 tells us where subhalos appear to be present, as well as where subhalos appear to be excluded, and by combining those two constraints we can derive bounds on the mean abundance $n(M)$ of dark matter subhalos in the vicinity of SDP.81.  Specifically, we use our nonlinear mass model to tell us the number and masses of the detected subhalos, as well as the area over which those subhalos are found, and we use our linearized $\\Delta {\\ensuremath{{\\cal  E} }}$  \\ maps to determine the area on the sky where subhalos are excluded.  Each piece (detections and exclusions) gives a likelihood for the mean number density of subhalos, $P[n(M)]$, and by multiplying the likelihoods derived from the detections and from exclusions, we derive our full constraints on the mass function.\n\nCalculation of the constraints from significantly detected subhalos is a straightforward application of Poisson statistics.  The constraints from non-detections are slightly more complicated, due to our spatially varying sensitivity.  If we had a well-defined area over which subhalos were definitively excluded, then computing the Poisson statistics from that area would be straightforward.  Instead, our sensitivity to substructure varies considerably over the area of interest.  There are many pixels in our $\\Delta {\\ensuremath{{\\cal  E} }}$ maps that slightly disfavor the presence of subhalos, and collectively those weak constraints over many pixels can combine to permit interesting bounds on the abundance.  Below, we describe the method we use to determine upper limits on the subhalo abundance from our linearized $\\Delta {\\ensuremath{{\\cal  E} }}$ maps.\n\nWe assume that the incidence of subhalos is a Poisson process with mean projected number density $n(M)$ that is spatially uniform across the region over which we are sensitive to the effects of subhalos.\nIn principle, this allows us to use Bayes' theorem to derive the likelihood of abundance $n(M)$ given our observed data, $P(n|{\\rm data}) \\propto P({\\rm data}|n)$.  To estimate $P({\\rm data}|n)$, we can sum over all possible realizations of subhalo positions and masses, weighted by the Poisson probabilities for realizing each possible configuration.  For clarity, we will first derive the likelihood of density $n(M)$ for indistinguishable subhalos of a single mass $M$; subsequently we show how our expressions generalize for a spectrum of subhalo masses.\n\nThe likelihood to observe the measured data for abundance of subhalos in a narrow mass bin, $n = dn/dM \\times dM$, is given by \n\n", "itemtype": "equation", "pos": 42546, "prevtext": "\nwhere $n$ is the number of visibilities used to estimate $A$ (half of all visibilities, since one half is subtracted from the other to remove the signal). We build the noise covariance matrix ${\\ensuremath{{\\bf C}_N}}$ by scaling the system temperatures with this scaling. \nWith appropriate variances in hand, we fit the visibilities with a smooth lens model, and search for subhalos perturbatively using the procedure described in Section~\\ref{sec:subhalofinding_method}. \n\n\n\n\\subsection{Mock observations}\n\nWe have performed a large number of tests, described below, using mock data, to ensure that the pipeline provides accurate results. We have tested for errors in the noise estimation and for biases in the smooth lens model.  These simulations also quantify our false positive detection rate and subhalo detection efficiency. \n\n\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_1.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_2.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_3.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig2_4.pdf}\n\\centering\n\\end{center}\n\\caption{ Maps of $\\Delta {\\ensuremath{{\\cal  E} }}$ (Equation \\ref{dchi2}) as a function of location, for a subhalo of mass $M=4\\times 10^8 M_\\odot$, using simulated data. Positive $\\Delta{\\ensuremath{{\\cal  E} }}$ corresponds to subhalos excluded at that location, while negative $\\Delta{\\ensuremath{{\\cal  E} }}$ corresponds to subhalos improving the log-posterior.  The mock data for the top left panel are for a simulation without any substructure, and our analysis excludes the presence of subhalos of this mass over the area of sensitivity.  The simulated arcs have been overlaid with white contours. In the remaining panels, the mocks contain a subhalo at the location of the blue circled cross. The simulation for the top right panel does not include phase errors in the measurements, the lower left panel includes such errors but does not compensate for them, and the lower right panel includes phase errors and marginalizes over them.  All four panels have the same noise realization and a model subhalo mass of $M=4\\times 10^8 M_\\odot$.\n\\label{fig:Mars}}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig3_1.pdf}\n\\includegraphics[trim= 80 20 80 20, clip, width=0.48\\textwidth]{fig3_2.pdf}\n\\centering\n\\end{center}\n\\caption{$\\Delta {\\ensuremath{{\\cal  E} }}$ maps for mock data including a massive ($M_{\\rm sub} = 10^9 M_{\\odot}$) subhalo, showing multiple islands where the addition of a subhalo could produce a better fit. We find that the island producing the lowest $\\Delta {\\ensuremath{{\\cal  E} }}$ corresponds to the true position of the subhalo (blue cross). After adding the detected subhalo to the macro model and searching for a second subhalo the other islands disappear, confirming that they arise from the inability of the smooth model to fit perturbed observations at various locations on the arc. The position of the subhalo is marked with a circled cross.\n\\label{fig:Titan}}\n\\end{figure*}\n\n\n\nThe mock observations for these tests were produced using a fully independent code in order to reduce the chances of duplicating errors. For each mock dataset, a complex background source composed of tens to hundreds of smaller clumps was lensed, and the lensed images were used to simulate ALMA observations using the Common Astronomy Software Applications package (CASA). The data pre-processing steps described above (visibility binning and noise estimation) were applied to the mock data and the binned visibilities were modeled to find a best-fit smooth model.  \n\nTo explore the lens parameter space, we have implemented the Markov chain Monte Carlo (MCMC) algorithm proposed by \\cite{mcmchammer}. We follow the procedure described in \\cite{emcee}. Our implementation allows sampling the posterior in parallel, over many cores, taking advantage of the MPI message-passing system.  On the large computing resources that we have used \\citep[e.g.,][]{XSEDE}, this allows much faster parameter explorations by evaluating multiple models simultaneously on different cores.\n\n\n\n\nFigure~\\ref{fig:Warrens_Sim_Post} shows the one and two dimensional marginal posterior PDFs for all lens model parameters given a mock data set. The gray shaded contours show the recovered posterior when using a gradient covariance matrix as the source prior. The red contours show the posterior for the same data, but using a curvature prior on the source parameters. The black dashed crosses show the true parameters which were used to generate the mock data. As can be seen, in both cases we successfully manage to recover the parameters with no apparent biases.\n\n\n\nHowever, in the course of our tests, we encountered two issues that could result in biased parameters. The first resulted from using the power-spectrum prior as defined in Equation~\\eqref{sourcePk}. Since the power spectrum does not diverge at $k\\to 0$, this prior tries to minimize the total emission of the unlensed source, i.e., it biases against low magnification. This bias towards high magnification favors shallow radial density slopes. To fix this issue, we removed the DC mode from this covariance matrix, which (similar to the gradient and curvature priors) renders it insensitive to the total sum of source pixel intensities.  We can remove the zero mode of the covariance matrix by replacing\n\n", "index": 33, "text": "\\begin{equation}\n\\bar{{\\ensuremath{{\\bf C}_s}}}^{-1} = {\\ensuremath{{\\bf C}_s}}^{-1} - \\frac{{\\ensuremath{{\\bf C}_s}}^{-1} \\, \\bm{a}\\, \\bm{a}^{\\sf T} \\,{\\ensuremath{{\\bf C}_s}}^{-1}}{\\bm{a}^{\\sf T}{\\ensuremath{{\\bf C}_s}} \\bm{a}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\bar{{{\\bf C}_{s}}}^{-1}={{\\bf C}_{s}}^{-1}-\\frac{{{\\bf C}_{s}}^{-1}\\,\\bm{a}\\,%&#10;\\bm{a}^{\\sf T}\\,{{\\bf C}_{s}}^{-1}}{\\bm{a}^{\\sf T}{{\\bf C}_{s}}\\bm{a}},\" display=\"block\"><mrow><mrow><msup><mover accent=\"true\"><msub><mi>𝐂</mi><mi>s</mi></msub><mo stretchy=\"false\">¯</mo></mover><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>=</mo><mrow><mmultiscripts><mi>𝐂</mi><mi>s</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>-</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><mmultiscripts><mi>𝐂</mi><mi>s</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>𝒂</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>𝒂</mi><mi>𝖳</mi></msup></mpadded><mo>⁢</mo><mmultiscripts><mi>𝐂</mi><mi>s</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts></mrow><mrow><msup><mi>𝒂</mi><mi>𝖳</mi></msup><mo>⁢</mo><msub><mi>𝐂</mi><mi>s</mi></msub><mo>⁢</mo><mi>𝒂</mi></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nEach term in this sum represents an integral over the relevant parameter space for 0 subhalos, 1 subhalo, and so on.  The 0 subhalo term is simply the marginalized posterior of our smooth model.  The 1 subhalo term is\n\n", "itemtype": "equation", "pos": 69025, "prevtext": "\nwhich follows from the Sherman-Morrison theorem.  Here $\\bm{a}$ is a column vector containing only ones (i.e., the zero mode) and $\\bar{{\\ensuremath{{\\bf C}_s}}}$ is the modified covariance matrix with no DC sensitivity. Removing the zero mode removes the bias towards high magnification and small source sizes.\n\n\n\n\nAnother potential source of bias was the choice of the area covered by  source pixels. For a given lens model, if an image pixel is mapped outside the area covered by the source grid, it will automatically be assigned a value of zero. \nA model which maps more image pixels to the defined source area may have more freedom in fitting the data compared to a model with fewer in-source-grid mappings. Therefore under equal conditions, lens models which map all image pixels to some source pixel are  preferred to models which do not. This can result in significant biases in lensing parameters (e.g., ellipticity and slope). To avoid this bias, the size of the source grid should be chosen to be large enough to cover the lensing models during the fitting process \\citep{suyu:06,Vegetti:09}.\n\n\n\\subsection{Phase corruption}\n\nOnce a best-fit model is determined, we start the subhalo search by mapping $\\Delta{\\ensuremath{{\\cal  E} }}$ over the subhalo parameter space (position and mass).  \nAs mentioned earlier, in addition to lens and source parameters, we marginalize over other nuisance parameters in the linear subhalo finder, such as antenna phase errors. This is similar to the procedure described in \\cite{hezaveh:13b}, with the addition of the possibility of imposing a prior on the antenna phase errors and allowing for time-segmented phase errors.\n\nFigure~\\ref{fig:Mars} shows maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ as a function of subhalo position for various cases of simulated data. \nFor a simulation with no subhalo present (top left), the analysis correctly excludes the presence of a subhalo over the region of sensitivity.\nIn the remaining panels, the mocks contain a subhalo at the location of the blue circled cross. The simulation for the top right panel does not include phase errors in the measurements. The subhalo is correctly detected at $\\sim 5\\sigma$ with no false positives. The mocks for the two bottom panels include antenna phase errors. In the bottom left panel we have not corrected for these phase errors, resulting in numerous false positives. The bottom right panel shows the results for the same mock data, when phase errors are marginalized over appropriately, resulting in the disappearance of the false detections. All four panels have the same noise realization.\n\nThis test illustrates one of the reasons why a careful analysis of the visibilities is essential to search for substructure using interferometric data.  Given the  challenges of analyzing large interferometric data sets, one might be tempted to simply analyze CLEAN images instead of visibilities.  \nCLEAN images fix the value of the antenna phases and do not allow them to be marginalized over when comparing different models, which, as illustrated here, could result in spurious detections.  \nIn addition, CLEAN images are produced through a non-linear deconvolution procedure whose effects on the data and the correlated noise properties can not be well quantified. \n It is worth stressing that the effects of low-mass substructure on the lensed images can be quite subtle, and so approximations and assumptions which may not lead to serious errors in other contexts could introduce significant errors for a substructure lensing analysis.  This is why we adopt the approach of explicitly modeling the visibilities and marginalizing over the nuisance parameters.\n\n\nFinally, we note that although in the two right panels of Figure~\\ref{fig:Mars} we only observe a single region with significant negative $\\Delta {\\ensuremath{{\\cal  E} }}$ (where the subhalo is detected), subhalos with larger masses can result in multiple islands. Figure~\\ref{fig:Titan} shows a mock generated using a simulation with a subhalo of mass $M_{\\rm sub}=10^{9}M_{\\odot}$. The left panel shows the $\\Delta {\\ensuremath{{\\cal  E} }}$ map when searching for this subhalo. As can be seen, there are multiple islands  where a subhalo can produce a better fit, however the true position of the subhalo corresponds to the lowest $\\Delta {\\ensuremath{{\\cal  E} }}$. The right panel of Figure~\\ref{fig:Titan} shows the $\\Delta {\\ensuremath{{\\cal  E} }}$ map when the detected subhalo is added to the macro parameters and a search for an additional subhalo is performed, showing that all corresponding islands disappear.\n\n\\section{Results for SDP.81}\n\\label{sec:results}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 80 0 90 10, clip, width=0.5\\textwidth]{fig4.png}\n\\centering\n\\end{center}\n\\caption{The SDP.81 system.  Grayscale shows HST/WFC3 F160W data, while red contours show ALMA continuum emission in band 6. \n\\label{fig:SDP81ALMAHST}}\n\\end{figure}\n\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 125 50 85 70, clip, width=1.0\\textwidth]{fig5.pdf}\n\\centering\n\\end{center}\n\\caption{Initial subhalo search using ALMA Science Verification observations of SDP.81.  Depicted are maps of linearized  $\\Delta{\\ensuremath{{\\cal  E} }}$ from Equation~\\eqref{dchi2}, showing twice the difference in log marginalized posterior probability density  between a smooth model without substructure, and a model with a subhalo of mass $M=10^{8.6} M_\\odot$, as a function of location of that subhalo.  The three panels correspond to analysis of Band 6 only (left), Band 7 only (middle), and joint Bands 6 and 7 (right).  Based on the significant improvement to the fit provided by substructure (as indicated by the map), we subsequently added one subhalo to our lens model, and re-optimized the model parameters (see Table~\\ref{lens_pars}). The contours in the insets show the 1-, 2-, and $3-\\sigma$ confidence regions for the position of the subhalo from a non-linear joint fit to the data.\n\\label{initial_search}}\n\\end{figure*}\n\n\n\\begin{figure*}[ht]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 110 50 100 50, clip, width=0.90\\textwidth]{fig6.pdf}\n\\centering\n\\end{center}\n\\caption{ The top left panel shows the sky emission model in band 6 for the best-fit smooth lens parameters for the SDP.81 data. The top middle panel shows the same for the perturbed model and the top right panel the difference between the two models. The bottom panels show the same for band 7. The bright feature in the difference plots is mainly caused by the astrometric anomaly of the arc.\n\\label{fig:model_res}}\n\\end{figure*}\n\n\n\n\\begin{figure*}[t]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 50 80 70 70, clip, width=1.0\\textwidth]{fig7.pdf}\n\\centering\n\\end{center}\n\\caption{ Contours show the 1-, 2-, and $3-\\sigma$ (68.3, 95.5, and 99.7\\%) confidence regions for the parameters in our lens model for a joint analysis of bands 6 and 7 data. \n\\label{MCMC_errors}}\n\\end{figure*}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 20 20 10 70, clip, width=0.5\\textwidth]{fig8.pdf}\n\\centering\n\\end{center}\n\\caption{Reconstructed source continuum emission from Band 6 (top panel) and Band 7 (bottom panel) data on a 10 milli-arcsec pixel grid.  The white dashed curve shows the tangential caustic predicted by our best-fit smooth model. \n\\label{fig:rec_src}}\n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 20 20 20 20, clip, width=0.48\\textwidth]{fig9_1.pdf}\n\\includegraphics[trim= 20 20 20 20, clip, width=0.48\\textwidth]{fig9_2.pdf}\n\\centering\n\\end{center}\n\\caption{Search for additional substructure.  Top panel shows a map of linearized $\\Delta{\\ensuremath{{\\cal  E} }}$ for a second subhalo, of mass $M=10^{8.6} M_\\odot$, following the inclusion of one subhalo of mass $M\\approx10^9 M_{\\odot}$ at the location of the blue circled cross, using a joint analysis of bands 6 and 7.  After adding the subhalo to the main lens model, no additional subhalos of this mass are found. The bottom panel shows a similar analysis for a lower mass subhalo, showing a marginal improvement of  ${\\ensuremath{{\\cal  E} }}$ at another point near the first detection.\n\\label{secondpass}}\n\\end{figure}\n\nWe use the recent ALMA Science Verification observations of the strongly lensed system SDP.81 \\citep{SDP81} to illustrate the application of this method to real data. Our analysis shows that this dataset is highly sensitive to the effects of low mass subhalos.  In the analysis presented here, We used only the calibrated continuum data from bands 6 and 7. In future work we will present our analysis of the full dataset, including CO line data.  Figure \\ref{fig:SDP81ALMAHST} shows the lensing galaxy observed by the \\emph{Hubble Space Telescope} (greyscale) superimposed on the lensed arcs observed by ALMA.\n\n\nWe estimate the noise variance for each visibility using the procedure described above and bin the visibilities in 12 meter cells. However, we only bin visibilities that share the same baseline and are taken within a short ($\\lesssim 20$ min) observing period. This allows us to assign a separate antenna phase error to each baseline at different time intervals (since the phase errors could slowly change during the course of an observation). This results in $\\sim0.5$ million binned visibilities, a factor of $\\sim 20$ fewer than the original $\\sim10$ million. We note that the shorter ($\\lesssim 2$ km) baselines in the binned visibilities have significantly higher signal-to-noise compared to the longer baselines because (a) for resolved sources, the signal diminishes on the longest baselines, and (b) the visibilities are sampled more densely on short baselines, meaning that the short-baseline bins contain a larger number of  visibilities. This allows us to speed up our search for the best-fitting parameters using the following approach.  We first use only the subset of baselines shorter than 2 km in our initial MCMC analysis to localize the neighborhood of the best fit.  \nThis approach greatly expedites our MCMC optimization, since many evaluations of the likelihood are required to fully search the highly multidimensional parameter space of our smooth model.\nOnce this initial localization has been achieved, we can use the full dataset. We note, however, that the observations of SDP.81 are performed on various dates which span many weeks, with significantly variable observational conditions, giving rise to a large range in noise properties. We, therefore, decide to model binned visibilities with noise lower than 5.0 and 5.5 mJy in bands 6 and 7 respectively, which contain about 40\\% of the total number of unbinned visibilities. \n\nOur smooth density model consists of the following terms.  First, the main lens is described by a singular elliptical power law surface density profile of the form $\\kappa(x,y) \\propto [x^2+y^2/(1-\\epsilon)^2]^{-\\alpha/2}$ where $\\alpha$ is the radial power-law index, and $x$ and $y$ are measured relative to the lens centroid $x_{\\rm lens}, y_{\\rm lens}$ \\citep{Barkana:98}. To avoid degeneracy of the orientation angle when ellipticity is close to zero, we use fitting parameters $\\epsilon_x$ and $\\epsilon_y$, defined so that $\\epsilon = (\\epsilon_x^2+\\epsilon_y^2)^{1/2}$ and the orientation angle is given by the arctangent of these components. Additionally, we allow for low order angular multipoles in the main lens, of the form $\\kappa_m(r,\\phi) =[A_{m} \\cos(m\\phi) + B_m \\sin(m\\phi)](r/r_s)^{-\\alpha}$ for $m=3,4$, where $r_s = 1^{\\prime\\prime}$. Note that the same radial slope $\\alpha$ and centroid $(x_{\\rm lens}, y_{\\rm lens})$ are used for the multipoles and for the ellipsoidal piece. Finally, we also allow for external shear, parameterized by the usual components $\\gamma_1$ and $\\gamma_2$.  Overall, therefore, our primary lens model contains 12 freely adjustable parameters. \n  \n\n\n\\subsection{Initial subhalo search}\n\nOnce a smooth model is obtained, we use the best-fit parameters to perform a linearized search for subhalos. As we have mentioned above, these lens parameters, source parameters, antenna parameters, etc., all become nuisance parameters that we marginalize over for every different model when we search for subhalos.  We follow \\citet{Hezaveh13A} and model the subhalo deflection field using a truncated isothermal surface density profile, also called a pseudo-Jaffe profile \\citep{Munoz01}.  This profile is characterized by a velocity dispersion $\\sigma_v$ and truncation radius $r_t$, and the total mass of the subhalo is given by $M_{\\rm sub} = \\pi \\sigma_v^2 r_t/G$.  To reduce the dimensionality of the subhalo parameter space, we assume that $r_t$ is related to $\\sigma_v$ by $r_t = (\\sigma_v/\\sqrt{2}\\sigma_G)r_{\\rm E}$, where $\\sigma_G$ is the velocity dispersion of the main lens, determined from its observed Einstein radius $r_{\\rm E}$.  We search for subhalos over a range of subhalo masses, over a $8\\times8$ arcsec area around the lens center. Figure~\\ref{initial_search} shows the results of our initial search.  The figure plots $\\Delta{\\ensuremath{{\\cal  E} }}$, twice the difference in marginalized log posterior between a model with a subhalo compared to our smooth model, as a function of subhalo location for a subhalo mass $M=10^{8.6} M_\\odot$.  As the figure indicates, there are several locations where adding a subhalo improves the posterior considerably, with the most significant having $\\Delta{\\ensuremath{{\\cal  E} }}=-22.2$. \n\nAs discussed above in Section~\\ref{sec:implement}, improper modeling of systematics and unknown errors can lead to spurious detections of substructure.  We have attempted to mitigate these effects by marginalizing over many potential systematics, including time-varying antenna phase errors.  Nevertheless, it is possible that the apparent detection of substructure indicated in Figure~\\ref{initial_search} could be due to an unknown interferometric data corruption, such as visibility decorrelation or rapidly varying antenna phase errors.  \nGiven that such errors are temporally variable, an analysis of multiple datasets observed at different times can reveal if our analysis is affected by them.\nAs a test of this, we analyzed bands 6 and 7 data separately, noting that they were obtained on different dates.\nOur analysis reveals a consistent pattern between the two bands (see Figure~\\ref{initial_search}), giving us confidence that the level of unknown systematics from such effects is below our statistical uncertainties. Figure~\\ref{fig:model_res} illustrates the difference between our best-fitting model without substructure and the best-fitting model with substructure for bands 6 and 7. As expected, the subhalo's effect is largely localized to its immediate vicinity and the counter-images of that region.\n\nBased on the results of this initial linearized search, we then expanded our lens model to include a subhalo, with 3 adjustable parameters: mass $M_{\\rm sub}$, and 2-D location $\\bm{x}_{\\rm sub}$.  We then re-fit the joint data set, re-optimizing all the parameters fully nonlinearly.  We find that a model with a subhalo of mass $M=10^{8.96} M_\\odot$ improves the marginalized log posterior fit by $\\Delta{\\ensuremath{{\\cal  E} }} = -47.3$ in the joint fit (note that the initial linear search was performed at $ M_{\\rm sub}=10^{8.6} M_{\\odot}$).  \nBased upon this result, we conclude that the ALMA Science Verification observations of SDP.81 detect a subhalo in the projected mass distribution. Having found the best-fit parameters for the detected subhalo, we then sample the full parameter space  (smooth lens and subhalo parameters) non-linearly using our Markov Chain Monte Carlo sampler. Figure~\\ref{MCMC_errors} shows the error covariance of the reconstructed lens parameters for the joint fit to bands 6 and 7.\nWe do not find evidence for significant degeneracies between the subhalo parameters and the parameters of the smooth lens model, including low-order multipoles in the gravitational potential.  This confirms  findings that such multipoles cannot mimic the effects of small-scale substructure for lenses with high-quality arcs \\citep{KochDalal04}.  \n\nThe full set of best-fit lens model parameters are presented in Table~\\ref{lens_pars}. Many previous works have modeled the lens potential in SDP.81, using HST data \\citep{Dye:14}, Submillimeter Array data \\citep{Bussmann:13}, and ALMA data \\citep{Dye2015,rybak:2015a,wong2015,tamura2015,hatsukade2015,rybak2015b}. \nOur smooth model has a larger ellipticity compared to these models. We note however that our model has more degrees of freedom (e.g., angular multipoles) and phase errors, and that the degeneracy of some of these additional parameters with ellipticity may shift its value. We do find that models with parameters given by these authors produce reasonable fits to the data. We also performed the linear subhalo search for these parameters, finding that they produce similar results and that the conclusion of the presence of the subhalo is robust against these variations. Figure~\\ref{fig:rec_src} shows the reconstructed source using this model with pixel size of 10 milli-arcsec in band 6 (top panel) and band 7 (bottom panel). \n\nThis model appears to be a good fit to the data, when we fit the entire data set.  The full data set, however, includes emission unrelated to SDP.81.  The ALMA primary beam covers approximately $\\sim 25^{\\prime\\prime}$, of which only the central few arcseconds are relevant for strong lens modeling.  If we model the sky emission only over a $5\\times 5$ arccsec area centered on the lens,  our model obtains $\\chi^2 = 2\\times 10^5$ for $1.7\\times 10^5$ degrees of freedom, suggesting that not all the signal in the data has been modeled. However, if we expand our source-plane image to cover the entire primary beam, additional flux is indicated away from the lensed galaxy and the $\\chi^2$ decreases to $1.7\\times 10^5$. \nSince this emission originates from regions well separated from the lensed images (far beyond the correlation length of the dirty beam), it has no model covariance with the lens parameters, and we therefore neglect it in the remainder of our analysis.\n\n\\begin{table}[tp]\n\\begin{centering}\n\\caption{Best-fit lens parameters with 68\\% uncertainties}\n\\label{lens_pars}\n\\begin{tabular}{lll}\n{\\bf Parameter}    &  {\\bf Definition}     & {\\bf Value}       \\\\ \\hline\n$\\alpha$            &  radial slope      & $1.06  \\pm 0.03$    \\\\\n$\\log_{10} (M_{\\rm 10 kpc})$ & mass within 10 kpc ($M_\\odot$)    & $11.60 \\pm 0.006$   \\\\\n$\\epsilon_x$              & ellipticity  x  & $0.371 \\pm 0.019$     \\\\\n$\\epsilon_y$              & ellipticity  y & $-0.046 \\pm 0.008$     \\\\\n$x_{\\rm lens}$              & lens x ($^{\\prime\\prime}$)  & $0.481 \\pm 0.006$     \\\\\n$y_{\\rm lens}$              & lens y ($^{\\prime\\prime}$)  & $0.154 \\pm 0.005$     \\\\\n$\\gamma_1$                 & external shear   & $0.0004 \\pm 0.006$ \\\\\n$\\gamma_2$                 & external shear   & $0.0017 \\pm 0.006$ \\\\\n$A_{3}$          & m=3 multipole   & $[5.90 \\pm 6.26]\\times 10^{-3}$ \\\\\n$B_{3}$          & m=3 multipole   & $[25.44 \\pm 6.00]\\times 10^{-3}$ \\\\\n$A_{4}$          & m=4 multipole   & $[12.53 \\pm 10.10]\\times 10^{-3}$ \\\\\n$B_{4}$          & m=4 multipole   & $[6.52 \\pm 11.20]\\times 10^{-3}$ \\\\\n$\\log_{10} (M_{\\rm sub})$          & subhalo mass ($M_\\odot$) & $8.96 \\pm 0.12$ \\\\\n$x_{\\rm sub}$          & subhalo position x ($^{\\prime\\prime}$) & $-0.694 \\pm 0.025$ \\\\\n$y_{\\rm sub}$          & subhalo position y ($^{\\prime\\prime}$) & $0.749 \\pm 0.044$ \n\\end{tabular}\\par\n\\end{centering}\n\\medskip\n\\textsc{Table}~\\ref{lens_pars}.--- Table of best-fit parameter values from a joint fit to bands 6 and 7 data.  Positions are in arcseconds relative to the ALMA phase center.\n\\end{table}\n\n\n\\subsection{Search for additional substructure}\n\n\\begin{figure*}[ht]\n\\begin{center}\n\\centering\n\\includegraphics[trim= 30 40 0 0, clip, width=1.00\\textwidth]{fig10.pdf}\n\\centering\n\\end{center}\n\\caption{ Maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ for a 3rd subhalo. When two subhalos are included in our main lens model, no significant evidence for any additional substructure is found in the joint band 6 and 7 analysis.  \n\\label{fig:subhalo_chi2_maps}}\n\\end{figure*}\n\nALMA observations of SDP.81 allow us to search for additional substructure besides the subhalo detected in the previous subsection.  Given our lens model (including one subhalo of $M_{\\rm sub}=10^{8.96} M_{\\odot}$), we next searched for additional substructure using the linearized treatment discussed in Section~\\ref{sec:subhalofinding_method}.  We repeated our search for a second subhalo, by linearly expanding about a smooth model now containing a subhalo of mass $M_{\\rm sub}=10^{8.96} M_{\\odot}$.  As before, we marginalize over all parameters of the smooth model, including the mass and location of the detected subhalo discussed above.\n\nThe inclusion of the subhalo in our main lens model removes any improvement to the marginalized posterior from additional subhalos of mass $M_{\\rm sub}\\ge 10^{8.6} M_\\odot$, as illustrated in top panel of Figure~\\ref{secondpass}.  Instead, additional subhalos of this mass are excluded from occurring near the observed arcs.  For lower subhalo masses, however, we find that there are certain locations where addition of a second subhalo can improve the marginalized posterior.  The lower panel of Figure~\\ref{secondpass} illustrates this for $M=10^{8} M_\\odot$.  The red regions in the map depict the locations where a subhalo of this mass can improve the marginalized posterior.  Based on the improvement suggested in this figure, we attempted adding a second subhalo to our main lens model.  Our nonlinear fit found that a subhalo of mass $M\\approx 10^8 M_\\odot$ could improve the fit marginally, with $\\Delta{\\ensuremath{{\\cal  E} }} \\approx -22$, compared to the 1-subhalo model.  \n\nWe are hesitant to consider this a detection of a second object, however.  First, the detection is marginal $(<5\\sigma)$.  Also, the second object is spatially near the $M_{\\rm sub}=10^{8.96} M_\\odot$ subhalo.  This suggests that the second object may possibly be an artifact of our modeling.  We have assumed an extremely simple mass profile for the subhalos, a spherical tidally truncated pseudo-Jaffe model, which is unlikely to describe realistic subhalos in great detail.  Small deviations in the actual mass profile compared to our model could show up as residuals that could be fitted by lower mass substructure.  On the other hand, this object could be real.  The close proximity to the first subhalo might arise simply because our area of sensitivity to detecting subhalos is relatively narrow.  Given these ambiguities, we do not label the second object as a detection, however we do include it in our main lens model.  Inclusion of additional data, in particular the CO lines which we have not used in this analysis, may be able to determine conclusively whether a lower mass subhalo is present.  To avoid biases arising from assuming a specific subhalo profile, it may be advantageous to reconstruct  the substructure density field with more flexible models.  For example,  a pixelated substructure map \\citep[e.g.,][]{Vegetti:09} would allow more freedom in the inferred substructure density field.  Given the quality of the ALMA SDP.81 data set,  such an approach may be warranted.\n\n\nFollowing the inclusion of this second subhalo in our lens model, no significant evidence for additional substructure is found in the dataset (see figure\\ \\ref{fig:subhalo_chi2_maps}).  \n\n\n\\subsection{Bounds on the subhalo mass function}\n\nOur modeling of the mass distribution around SDP.81 tells us where subhalos appear to be present, as well as where subhalos appear to be excluded, and by combining those two constraints we can derive bounds on the mean abundance $n(M)$ of dark matter subhalos in the vicinity of SDP.81.  Specifically, we use our nonlinear mass model to tell us the number and masses of the detected subhalos, as well as the area over which those subhalos are found, and we use our linearized $\\Delta {\\ensuremath{{\\cal  E} }}$  \\ maps to determine the area on the sky where subhalos are excluded.  Each piece (detections and exclusions) gives a likelihood for the mean number density of subhalos, $P[n(M)]$, and by multiplying the likelihoods derived from the detections and from exclusions, we derive our full constraints on the mass function.\n\nCalculation of the constraints from significantly detected subhalos is a straightforward application of Poisson statistics.  The constraints from non-detections are slightly more complicated, due to our spatially varying sensitivity.  If we had a well-defined area over which subhalos were definitively excluded, then computing the Poisson statistics from that area would be straightforward.  Instead, our sensitivity to substructure varies considerably over the area of interest.  There are many pixels in our $\\Delta {\\ensuremath{{\\cal  E} }}$ maps that slightly disfavor the presence of subhalos, and collectively those weak constraints over many pixels can combine to permit interesting bounds on the abundance.  Below, we describe the method we use to determine upper limits on the subhalo abundance from our linearized $\\Delta {\\ensuremath{{\\cal  E} }}$ maps.\n\nWe assume that the incidence of subhalos is a Poisson process with mean projected number density $n(M)$ that is spatially uniform across the region over which we are sensitive to the effects of subhalos.\nIn principle, this allows us to use Bayes' theorem to derive the likelihood of abundance $n(M)$ given our observed data, $P(n|{\\rm data}) \\propto P({\\rm data}|n)$.  To estimate $P({\\rm data}|n)$, we can sum over all possible realizations of subhalo positions and masses, weighted by the Poisson probabilities for realizing each possible configuration.  For clarity, we will first derive the likelihood of density $n(M)$ for indistinguishable subhalos of a single mass $M$; subsequently we show how our expressions generalize for a spectrum of subhalo masses.\n\nThe likelihood to observe the measured data for abundance of subhalos in a narrow mass bin, $n = dn/dM \\times dM$, is given by \n\n", "index": 35, "text": "\\begin{align}\nP({\\rm data}|n) =& P({\\rm data}|\\mbox{0 subhalos}) P(\\mbox{0 subhalos}|n) \\nonumber \\\\\n& + P({\\rm data}|\\mbox{1 subhalo}) P(\\mbox{1 subhalo}|n)\\nonumber \\\\\n& + P({\\rm data}|\\mbox{2 subhalos}) P(\\mbox{2 subhalos}|n) \\nonumber \\\\\n& + \\ldots\n\\label{eqn:decomp}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P({\\rm data}|n)=\" display=\"inline\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle P({\\rm data}|\\mbox{0 subhalos})P(\\mbox{0 subhalos}|n)\" display=\"inline\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mtext>0 subhalos</mtext><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mtext>0 subhalos</mtext><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle+P({\\rm data}|\\mbox{1 subhalo})P(\\mbox{1 subhalo}|n)\" display=\"inline\"><mrow><mo>+</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mtext>1 subhalo</mtext><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mtext>1 subhalo</mtext><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle+P({\\rm data}|\\mbox{2 subhalos})P(\\mbox{2 subhalos}|n)\" display=\"inline\"><mrow><mo>+</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mtext>2 subhalos</mtext><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mtext>2 subhalos</mtext><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle+\\ldots\" display=\"inline\"><mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nThe two factors in the integrand on the right hand side are given by the marginalized posterior and by Poisson statistics, respectively.  The first factor, representing the marginalized posterior for a subhalo at position $x,y$, is $P({\\rm data}|x,y)=P({\\rm data}|\\mbox{0 subhalos}) \\exp(-\\Delta{\\ensuremath{{\\cal  E} }}(x,y)/2)$.  The second factor $\\frac{dP}{dA}(x,y|n) dxdy$ represents the Poisson probability to find 1 subhalo within area $dx\\,dy$ at position $x,y$, and is independent of $x,y$ because we assume Poisson statistics with uniform mean density.  Indeed, the Poisson probability of finding 1 subhalo at location $x,y$, given mean number density $n$, is $P(1|n) = \\exp(-\\nu) \\nu$, where the expected number $\\nu =  n\\, dx dy$.  The Poisson likelihood to observe 0 subhalos instead is $P(0|n) = \\exp(-\\nu)$, so that $P(1|n)=P(0|n) n\\,dxdy$. Therefore, we see that  \n\n", "itemtype": "equation", "pos": 69527, "prevtext": "\nEach term in this sum represents an integral over the relevant parameter space for 0 subhalos, 1 subhalo, and so on.  The 0 subhalo term is simply the marginalized posterior of our smooth model.  The 1 subhalo term is\n\n", "index": 37, "text": "\\begin{multline}\nP({\\rm data}|\\mbox{1 subhalo}) P(\\mbox{1 subhalo}|n) \\\\\n= \\int P({\\rm data}|x,y) \\frac{dP}{dA}(x,y | n) dx dy.\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P({\\rm data}|\\mbox{1 subhalo})P(\\mbox{1 subhalo}|n)\\\\&#10;\\displaystyle=\\int P({\\rm data}|x,y)\\frac{dP}{dA}(x,y|n)dxdy.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mtext>1 subhalo</mtext><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mtext>1 subhalo</mtext><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mo>=</mo><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>P</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>A</mi></mrow></mfrac><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>x</mi><mi>d</mi><mi>y</mi><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $\\Delta{\\ensuremath{{\\cal  E} }}(\\bm{x})$ is given by Equation~\\eqref{dchi2}, and represents the improvement in log-posterior between a model with a subhalo at location $\\bm{x}$ and a model with no subhalos.  \n\nTo compute the 2-subhalo, 3-subhalo, and higher terms in Equation~\\eqref{eqn:decomp}, we need analogous $\\Delta{\\ensuremath{{\\cal  E} }}$ maps for all possible configurations and masses of 2 subhalos, 3 subhalos, and so on.  This is an onerous calculation, and typically such integrals are performed using Monte Carlo.  However, since our 1-subhalo maps do not reveal any significant detections (by construction), we can use the 1-subhalo maps to approximate the higher order terms.  Specifically, we assume that each subhalo makes only a perturbative correction to the fit, i.e., $\\Delta{\\ensuremath{{\\cal  E} }} \\ll {\\ensuremath{{\\cal  E} }}_0$, so that the $\\Delta{\\ensuremath{{\\cal  E} }}$ from each subhalo adds linearly to the $\\Delta{\\ensuremath{{\\cal  E} }}$ from any other subhalos.  For example, we assume \n\n", "itemtype": "equation", "pos": 70551, "prevtext": "\nThe two factors in the integrand on the right hand side are given by the marginalized posterior and by Poisson statistics, respectively.  The first factor, representing the marginalized posterior for a subhalo at position $x,y$, is $P({\\rm data}|x,y)=P({\\rm data}|\\mbox{0 subhalos}) \\exp(-\\Delta{\\ensuremath{{\\cal  E} }}(x,y)/2)$.  The second factor $\\frac{dP}{dA}(x,y|n) dxdy$ represents the Poisson probability to find 1 subhalo within area $dx\\,dy$ at position $x,y$, and is independent of $x,y$ because we assume Poisson statistics with uniform mean density.  Indeed, the Poisson probability of finding 1 subhalo at location $x,y$, given mean number density $n$, is $P(1|n) = \\exp(-\\nu) \\nu$, where the expected number $\\nu =  n\\, dx dy$.  The Poisson likelihood to observe 0 subhalos instead is $P(0|n) = \\exp(-\\nu)$, so that $P(1|n)=P(0|n) n\\,dxdy$. Therefore, we see that  \n\n", "index": 39, "text": "\\begin{multline}\nP({\\rm data}|1) P(1|n) = P({\\rm data}|0) P(0|n) \\\\ \n\\times n \\int \\exp\\left(-\\frac{1}{2}\\Delta{\\ensuremath{{\\cal  E} }}(\\bm{x})\\right) d\\bm{x}, \n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P({\\rm data}|1)P(1|n)=P({\\rm data}|0)P(0|n)\\\\&#10;\\displaystyle\\times n\\int\\exp\\left(-\\frac{1}{2}\\Delta{{\\cal E}}(\\bm{x})\\right)%&#10;d\\bm{x},\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>data</mi><mo stretchy=\"false\">|</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mi/><mo>×</mo><mrow><mi>n</mi><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>𝒙</mi></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nThis assumption of linear addition means that we can approximate the $N$-subhalo term in Equation~\\eqref{eqn:decomp} using an $N$-fold integral of our 1-subhalo ${\\ensuremath{{\\cal  E} }}$ maps.  More precisely, the assumption that each subhalo just adds linearly to ${\\ensuremath{{\\cal  E} }}$ means that every pixel in our ${\\ensuremath{{\\cal  E} }}$ map is assumed to be independent of every other pixel, which implies that we can construct the total likelihood for number density $n$ by multiplying together the individual constraints on $n$ from all the separate pixels.  For a pixel of area $dA$ with $\\Delta{\\ensuremath{{\\cal  E} }}$ from one subhalo, the constraint on $n$ is\n\n", "itemtype": "equation", "pos": 71762, "prevtext": "\nwhere $\\Delta{\\ensuremath{{\\cal  E} }}(\\bm{x})$ is given by Equation~\\eqref{dchi2}, and represents the improvement in log-posterior between a model with a subhalo at location $\\bm{x}$ and a model with no subhalos.  \n\nTo compute the 2-subhalo, 3-subhalo, and higher terms in Equation~\\eqref{eqn:decomp}, we need analogous $\\Delta{\\ensuremath{{\\cal  E} }}$ maps for all possible configurations and masses of 2 subhalos, 3 subhalos, and so on.  This is an onerous calculation, and typically such integrals are performed using Monte Carlo.  However, since our 1-subhalo maps do not reveal any significant detections (by construction), we can use the 1-subhalo maps to approximate the higher order terms.  Specifically, we assume that each subhalo makes only a perturbative correction to the fit, i.e., $\\Delta{\\ensuremath{{\\cal  E} }} \\ll {\\ensuremath{{\\cal  E} }}_0$, so that the $\\Delta{\\ensuremath{{\\cal  E} }}$ from each subhalo adds linearly to the $\\Delta{\\ensuremath{{\\cal  E} }}$ from any other subhalos.  For example, we assume \n\n", "index": 41, "text": "\\begin{equation}\n\\Delta{\\ensuremath{{\\cal  E} }}(M_1,\\bm{x}_1; M_2, \\bm{x}_2) \\approx \\Delta{\\ensuremath{{\\cal  E} }}(M_1,\\bm{x}_1) + \\Delta{\\ensuremath{{\\cal  E} }}(M_2,\\bm{x}_2).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\Delta{{\\cal E}}(M_{1},\\bm{x}_{1};M_{2},\\bm{x}_{2})\\approx\\Delta{{\\cal E}}(M_{%&#10;1},\\bm{x}_{1})+\\Delta{{\\cal E}}(M_{2},\\bm{x}_{2}).\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mn>1</mn></msub><mo>,</mo><msub><mi>𝒙</mi><mn>1</mn></msub><mo>;</mo><msub><mi>M</mi><mn>2</mn></msub><mo>,</mo><msub><mi>𝒙</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mn>1</mn></msub><mo>,</mo><msub><mi>𝒙</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mn>2</mn></msub><mo>,</mo><msub><mi>𝒙</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nMultiplying all the pixels, we obtain\n\n", "itemtype": "equation", "pos": 72642, "prevtext": "\nThis assumption of linear addition means that we can approximate the $N$-subhalo term in Equation~\\eqref{eqn:decomp} using an $N$-fold integral of our 1-subhalo ${\\ensuremath{{\\cal  E} }}$ maps.  More precisely, the assumption that each subhalo just adds linearly to ${\\ensuremath{{\\cal  E} }}$ means that every pixel in our ${\\ensuremath{{\\cal  E} }}$ map is assumed to be independent of every other pixel, which implies that we can construct the total likelihood for number density $n$ by multiplying together the individual constraints on $n$ from all the separate pixels.  For a pixel of area $dA$ with $\\Delta{\\ensuremath{{\\cal  E} }}$ from one subhalo, the constraint on $n$ is\n\n", "index": 43, "text": "\\begin{align}\nP(n) &\\propto e^{-n\\,dA} \\left[1 + n\\,dA\\, e^{-\\Delta{\\ensuremath{{\\cal  E} }}/2} + \\ldots\\right] \\nonumber \\\\\n&= e^{-n\\,dA} \\sum_N\\left[\\left(n\\,dA\\, e^{-\\Delta{\\ensuremath{{\\cal  E} }}/2}\\right)^N /\\, N! \\right] \\nonumber \\\\\n&= \\exp\\left[n\\,dA \\left(e^{-\\Delta{\\ensuremath{{\\cal  E} }}/2}-1\\right) \\right].\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P(n)\" display=\"inline\"><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\propto e^{-n\\,dA}\\left[1+n\\,dA\\,e^{-\\Delta{{\\cal E}}/2}+\\ldots\\right]\" display=\"inline\"><mrow><mi/><mo>∝</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>A</mi></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi></mrow><mo>]</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=e^{-n\\,dA}\\sum_{N}\\left[\\left(n\\,dA\\,e^{-\\Delta{{\\cal E}}/2}%&#10;\\right)^{N}/\\,N!\\right]\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>N</mi></munder></mstyle><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>A</mi></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow><mo>)</mo></mrow><mi>N</mi></msup><mo rspace=\"4.2pt\">/</mo><mrow><mi>N</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\exp\\left[n\\,dA\\left(e^{-\\Delta{{\\cal E}}/2}-1\\right)\\right].\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\n\nWe use Equation~\\eqref{bound} to determine the constraints on the subhalo abundance from non-detections of subhalos in our $\\Delta{\\ensuremath{{\\cal  E} }}$ maps. \nThe assumption of linearity underlying this equation clearly becomes invalid in the limit of large numbers of subhalos that in combination can produce $\\Delta{\\ensuremath{{\\cal  E} }}\\,\\sim\\,{\\ensuremath{{\\cal  E} }}_0$, or where subhalos overlap with each other.  \nBecause our 1-subhalo maps do not reveal any significant detections of subhalos, such configurations are probabilistically disfavored, and hence should not lead to significant errors in our approximation. In cases where subhalos do overlap, our tests indicate that our assumption of linear addition tends to underestimate the decrease in posterior probability density, suggesting that our bounds below are (slightly) conservative.  \n\nSo far, our discussion has focused on constraining the number density of identical subhalos in a narrow mass bin $dM$.  It is straightforward to generalize Equation~\\eqref{bound} to allow for distinguishable subhalos of different masses.  Repeating the same argument used to derive Equation~\\eqref{bound} when there are subhalos of varying masses, it is straightforward to see that the likelihood for a mass function $dn/dM$ factorizes into a product of terms from each mass bin,\n\n", "itemtype": "equation", "pos": 73015, "prevtext": "\nMultiplying all the pixels, we obtain\n\n", "index": 45, "text": "\\begin{equation}\nP(n) = P_0\\,\\exp\\left[n\\,dA \\sum_i\\left(e^{-\\Delta{\\ensuremath{{\\cal  E} }}_i/2}-1\\right) \\right].\n\\label{bound}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"P(n)=P_{0}\\,\\exp\\left[n\\,dA\\sum_{i}\\left(e^{-\\Delta{{\\cal E}}_{i}/2}-1\\right)%&#10;\\right].\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>P</mi><mn>0</mn></msub></mpadded><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mo>(</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>i</mi></msub></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $i$ runs over angular pixels on the sky, $j$ runs over subhalo mass bins, and we have written the number density of subhalos in bin $j$ as $n_j=dn/dM(M_j)\\,dM$.\n\nTo summarize, Equation~\\eqref{bound1} tells us the effective area over which subhalos are excluded.  Our main lens model tells us the number of subhalos that were detected, and the area over which they were found to occur.  Combining those two measurements, we derive Poisson constraints on the underlying subhalo abundance.\n\nFigure~\\ref{fig:subhalo_95_limits} shows the resulting constraints on the differential subhalo mass function, $dn/d\\log M(M_{\\rm sub})$, derived from the maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ shown in Figure~\\ref{fig:subhalo_chi2_maps}.  In mass bins where no subhalos were detected, the downward arrows indicate 95\\% upper limits.  For the mass bin at $M_{\\rm sub}= 10^{9} M_\\odot$ where we have a detected subhalo, the central 95\\% confidence region is $0.012\\ {\\rm arcsec}^{-2} < n < 0.2\\ {\\rm arcsec}^{-2}$. \nIf we instead define the confidence region in terms of levels of equal posterior encompassing 95\\% of the posterior, we obtain $0.003\\ {\\rm arcsec}^{-2} < n < 0.1806\\ {\\rm arcsec}^{-2}$. The reason these two ranges are somewhat different is that the likelihood is asymmetric. \n\nCombining the bounds from the different mass bins, we can derive constraints on the subhalo mass function, using Equation~\\eqref{bound1}.  We describe the  mass function using a simple parametrization, $dn/d\\log M = A\\,(M/M_{\\rm pivot})^{-\\eta}$, and show in Figure~\\ref{fig:SDP81MassFunction} the constraints on these parameters.  \nIn the next section we compare these constraints to the amount of substructure expected for lens galaxies like SDP.81 in $\\Lambda$CDM cosmologies.\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 21 0 0 0, clip, width=0.5\\textwidth]{fig11.pdf}\n\\centering\n\\end{center}\n\\caption{The errorbars indicate the 95\\% confidence limits on the projected differential number density of subhalos around SDP.81, derived using the non-detection regions shown in Figure~\\ref{fig:subhalo_chi2_maps} and the detection of the $10^9$ M$_{\\odot}$ subhalo. For comparison, the shaded band shows the 90\\% confidence region from \\citet{dalal:02}. \n\\label{fig:subhalo_95_limits}}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 34 0 0 0, clip, width=0.52\\textwidth]{fig12.pdf}\n\\centering\n\\end{center}\n\\caption{Limits  on  the normalization (A) and slope ($\\eta$) of the mass function $dn/d\\log M = A (M/M_{\\rm pivot})^{-\\eta}$, using the bounds in Figure~\\ref{fig:subhalo_95_limits}. Here we use $M_{\\rm pivot}=10^9 M_\\odot$.  The grey contours show constraints derived using Equation~\\eqref{bound1}, while the red contours show how the constraints change if we neglect the marginally detected subhalo with $M\\approx 10^8 M_\\odot$. The top panel shows the probability at $\\eta=0.9$. The red and black curves simply show a slice of the probability of the lower panel at $\\eta=0.9$. For comparison, the histograms show the distribution of $A$ using assumptions based on $\\Lambda$CDM simulations assuming two different values of $c_\\text{subs}/c_\\text{host}$, which are intended to be representative. These values assume  $\\eta=0.9$  and a distribution of host halo masses and concentrations given by abundance matching.  See Section~\\ref{sec:lcdm} for details.\n\\label{fig:SDP81MassFunction}}\n\\end{figure}\n\n\n\\section{Comparison to \\texorpdfstring{$\\Lambda$}{L}CDM Predictions}\n\\label{sec:lcdm}\n\nIn this section, we compare the constraints on the subhalo abundance in SDP.81 found above, with predictions from $\\Lambda$CDM simulations, and also discuss the neighboring environment of this system. To predict the subhalo mass function down to the small masses probed while fully accounting for the halo-to-halo scatter, we follow the methodology presented in \\citet{Mao:15},  which captures the dominant source of the halo-to-halo scatter by considering both mass and concentration of host halos. The model is able to reproduce the subhalo abundance found in high-resolution zoom-in simulations~\\citep[e.g.,][]{Xu:15} as well as larger statistical samples of halos.\n\nWe assume the cumulative subhalo mass function has the form of \n\n", "itemtype": "equation", "pos": 74505, "prevtext": "\n\nWe use Equation~\\eqref{bound} to determine the constraints on the subhalo abundance from non-detections of subhalos in our $\\Delta{\\ensuremath{{\\cal  E} }}$ maps. \nThe assumption of linearity underlying this equation clearly becomes invalid in the limit of large numbers of subhalos that in combination can produce $\\Delta{\\ensuremath{{\\cal  E} }}\\,\\sim\\,{\\ensuremath{{\\cal  E} }}_0$, or where subhalos overlap with each other.  \nBecause our 1-subhalo maps do not reveal any significant detections of subhalos, such configurations are probabilistically disfavored, and hence should not lead to significant errors in our approximation. In cases where subhalos do overlap, our tests indicate that our assumption of linear addition tends to underestimate the decrease in posterior probability density, suggesting that our bounds below are (slightly) conservative.  \n\nSo far, our discussion has focused on constraining the number density of identical subhalos in a narrow mass bin $dM$.  It is straightforward to generalize Equation~\\eqref{bound} to allow for distinguishable subhalos of different masses.  Repeating the same argument used to derive Equation~\\eqref{bound} when there are subhalos of varying masses, it is straightforward to see that the likelihood for a mass function $dn/dM$ factorizes into a product of terms from each mass bin,\n\n", "index": 47, "text": "\\begin{align}\nP\\left(\\frac{dn}{dM}\\right)&=P_0 \\prod_j \\exp\\left[n_j\\,dA \\sum_i\\left(e^{-\\Delta{\\ensuremath{{\\cal  E} }}_{ji}/2}-1\\right) \\right] \\label{bound1} \\\\\n&= P_0 \\exp\\left[\\sum_{i,j} \\frac{dn}{dM}(M_j) dM\\,dA \\left(e^{-\\Delta{\\ensuremath{{\\cal  E} }}_{ji}/2}-1\\right)   \\right] \\nonumber \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P\\left(\\frac{dn}{dM}\\right)\" display=\"inline\"><mrow><mi>P</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>n</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>M</mi></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=P_{0}\\prod_{j}\\exp\\left[n_{j}\\,dA\\sum_{i}\\left(e^{-\\Delta{{\\cal E%&#10;}}_{ji}/2}-1\\right)\\right]\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><msub><mi>P</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mi>j</mi></munder></mstyle><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>n</mi><mi>j</mi></msub></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder></mstyle><mrow><mo>(</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>i</mi></mrow></msub></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=P_{0}\\exp\\left[\\sum_{i,j}\\frac{dn}{dM}(M_{j})dM\\,dA\\left(e^{-%&#10;\\Delta{{\\cal E}}_{ji}/2}-1\\right)\\right]\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><msub><mi>P</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></munder></mstyle><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>n</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>M</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>M</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>M</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>i</mi></mrow></msub></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nwhere $M_\\text{host}$ is the host halo mass, $M_0$ and $\\eta$ are the normalization and the log--log slope, respectively, of the subhalo mass function.  We then use $\\Lambda$CDM simulations to calibrate the relation between the parameter $M_0$ and the mass and concentration of the host halo. To calibrate this relation, we use the same set of high-resolution zoom-in simulations described in \\cite{Mao:15}\nwith the addition of a very high-resolution cosmological box, ($4096^3$ particles in a $400~\\text{Mpc}/h$ box, {\\tt ds14\\_i}) from the Dark Sky Simulations~\\citep{Skillman:14}\\footnote{{\\tt http://darksky.slac.stanford.edu}}.\nThis calibration is done by first assuming a constant log--log slope ($\\eta$),  then finding the best-fit $M_0$ for each host halo in the simulations, and finally for all host halos, finding the best-fit values of $(\\alpha, \\beta, \\gamma)$ in\n\n", "itemtype": "equation", "pos": 79085, "prevtext": "\nwhere $i$ runs over angular pixels on the sky, $j$ runs over subhalo mass bins, and we have written the number density of subhalos in bin $j$ as $n_j=dn/dM(M_j)\\,dM$.\n\nTo summarize, Equation~\\eqref{bound1} tells us the effective area over which subhalos are excluded.  Our main lens model tells us the number of subhalos that were detected, and the area over which they were found to occur.  Combining those two measurements, we derive Poisson constraints on the underlying subhalo abundance.\n\nFigure~\\ref{fig:subhalo_95_limits} shows the resulting constraints on the differential subhalo mass function, $dn/d\\log M(M_{\\rm sub})$, derived from the maps of $\\Delta{\\ensuremath{{\\cal  E} }}$ shown in Figure~\\ref{fig:subhalo_chi2_maps}.  In mass bins where no subhalos were detected, the downward arrows indicate 95\\% upper limits.  For the mass bin at $M_{\\rm sub}= 10^{9} M_\\odot$ where we have a detected subhalo, the central 95\\% confidence region is $0.012\\ {\\rm arcsec}^{-2} < n < 0.2\\ {\\rm arcsec}^{-2}$. \nIf we instead define the confidence region in terms of levels of equal posterior encompassing 95\\% of the posterior, we obtain $0.003\\ {\\rm arcsec}^{-2} < n < 0.1806\\ {\\rm arcsec}^{-2}$. The reason these two ranges are somewhat different is that the likelihood is asymmetric. \n\nCombining the bounds from the different mass bins, we can derive constraints on the subhalo mass function, using Equation~\\eqref{bound1}.  We describe the  mass function using a simple parametrization, $dn/d\\log M = A\\,(M/M_{\\rm pivot})^{-\\eta}$, and show in Figure~\\ref{fig:SDP81MassFunction} the constraints on these parameters.  \nIn the next section we compare these constraints to the amount of substructure expected for lens galaxies like SDP.81 in $\\Lambda$CDM cosmologies.\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 21 0 0 0, clip, width=0.5\\textwidth]{fig11.pdf}\n\\centering\n\\end{center}\n\\caption{The errorbars indicate the 95\\% confidence limits on the projected differential number density of subhalos around SDP.81, derived using the non-detection regions shown in Figure~\\ref{fig:subhalo_chi2_maps} and the detection of the $10^9$ M$_{\\odot}$ subhalo. For comparison, the shaded band shows the 90\\% confidence region from \\citet{dalal:02}. \n\\label{fig:subhalo_95_limits}}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\centering\n\\includegraphics[trim= 34 0 0 0, clip, width=0.52\\textwidth]{fig12.pdf}\n\\centering\n\\end{center}\n\\caption{Limits  on  the normalization (A) and slope ($\\eta$) of the mass function $dn/d\\log M = A (M/M_{\\rm pivot})^{-\\eta}$, using the bounds in Figure~\\ref{fig:subhalo_95_limits}. Here we use $M_{\\rm pivot}=10^9 M_\\odot$.  The grey contours show constraints derived using Equation~\\eqref{bound1}, while the red contours show how the constraints change if we neglect the marginally detected subhalo with $M\\approx 10^8 M_\\odot$. The top panel shows the probability at $\\eta=0.9$. The red and black curves simply show a slice of the probability of the lower panel at $\\eta=0.9$. For comparison, the histograms show the distribution of $A$ using assumptions based on $\\Lambda$CDM simulations assuming two different values of $c_\\text{subs}/c_\\text{host}$, which are intended to be representative. These values assume  $\\eta=0.9$  and a distribution of host halo masses and concentrations given by abundance matching.  See Section~\\ref{sec:lcdm} for details.\n\\label{fig:SDP81MassFunction}}\n\\end{figure}\n\n\n\\section{Comparison to \\texorpdfstring{$\\Lambda$}{L}CDM Predictions}\n\\label{sec:lcdm}\n\nIn this section, we compare the constraints on the subhalo abundance in SDP.81 found above, with predictions from $\\Lambda$CDM simulations, and also discuss the neighboring environment of this system. To predict the subhalo mass function down to the small masses probed while fully accounting for the halo-to-halo scatter, we follow the methodology presented in \\citet{Mao:15},  which captures the dominant source of the halo-to-halo scatter by considering both mass and concentration of host halos. The model is able to reproduce the subhalo abundance found in high-resolution zoom-in simulations~\\citep[e.g.,][]{Xu:15} as well as larger statistical samples of halos.\n\nWe assume the cumulative subhalo mass function has the form of \n\n", "index": 49, "text": "\\begin{equation}\n\\langle n (>M_\\text{sub}) \\rangle = \\left(\\frac{M_\\text{sub}}{M_0}\\right)^{-\\eta} - \\left(\\frac{M_\\text{host}}{M_0}\\right)^{-\\eta},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\langle n(&gt;M_{\\text{sub}})\\rangle=\\left(\\frac{M_{\\text{sub}}}{M_{0}}\\right)^{-%&#10;\\eta}-\\left(\\frac{M_{\\text{host}}}{M_{0}}\\right)^{-\\eta},\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi>n</mi><mspace width=\"veryverythickmathspace\"/><mrow><mo stretchy=\"false\">(</mo><mrow><mi/><mo>&gt;</mo><msub><mi>M</mi><mtext>sub</mtext></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mtext>sub</mtext></msub><msub><mi>M</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>η</mi></mrow></msup><mo>-</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mtext>host</mtext></msub><msub><mi>M</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>η</mi></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01388.tex", "nexttext": "\nWith this model, we can then predict the subhalo mass function given \nthe host halo mass and concentration and the log--log slope. \n\nThe subhalo abundance predicted in the procedure described above is for all subhalos within the virial radius of the host halo.\nTo convert our prediction to the relevant quantity probed by strong lensing measurements, we need to assume a spatial distribution for the subhalos. Here we make three simplifying assumptions: \n(1) the subhalo spatial distribution is \\emph{independent} from \nthe subhalo mass function (i.e., subhalos of different mass halos have the same spatial distribution);\n(2) the angular distribution of subhalos is isotropic \\citep[see, however,][]{Nierenberg:11a}; \nand (3) the radial distribution of subhalos within their host halos follows an NFW profile with a characteristic concentration $c_\\text{subs}$. In other words, we assume the subhalo abundance factorizes into a mass dependence and radial dependence, $n(M,r) = n(M)\\,f(r)$, where the radial dependence $f(r)$ is an NFW profile of concentration $c_\\text{subs}$.\n\nTo predict the projected abundance of substructure, our model requires a prescription for the concentration of the subhalo distribution, $c_{\\rm subs}$.  In $\\Lambda$CDM simulations, generally the radial distribution of subhalos is less centrally concentrated than the dark matter distribution of the host halo (i.e., $c_\\text{subs}/c_\\text{host} < 1$)~\\citep[e.g.,][]{Nagai:05,Phoenix}, and at small radii the subhalo distribution may become shallower than an NFW profile~\\citep[e.g.,][]{Xu:15}. Observational results for real galaxies are less clear: some are consistent with  $c_\\text{subs}/c_\\text{host} \\simeq 1$ \\citep[e.g.,][]{Guo:12,Yniguez:14}, while others imply that galaxies are less concentrated~\\citep[e.g.,][]{Hansen:05} than the total mass distribution in their hosts. Also note that our assumption of spherical symmetry might lead us to underestimate the average substructure abundance around lenses, since strong lenses are preferentially viewed along the major axis of their host halos \\citep{rozo:07,hennawi:07}. \n\nGiven the uncertainty in predictions for $c_\\text{subs}$, we treat it as a free parameter, along with other parameters describing the lens halo: the host halo mass and concentration ($M_\\text{host}$, $c_\\text{host}$), and the log--log slope ($\\eta$) of the subhalo mass function.  Using these model ingredients, we can predict $dn/d\\log M$ projected at the Einstein radius.  \nThe histograms in the top panel of Figure~\\ref{fig:SDP81MassFunction} show an example, the distribution of $A$, i.e., $dn/d\\log M$ at $M=10^9 M_\\odot$ computed with this model.  For this figure, we assume the mass function slope is $\\eta=0.9$, and we show two possible values for the subhalo concentration, $c_\\text{subs}/c_\\text{host}=0.2$ and 1.0, which should span the range of uncertainty described above.\nFor the other two parameters,\nwe marginalize over possible values of the host halo mass and concentration using the following prior.  \nWe first assign galaxy luminosity to dark matter halos and subhalos with the abundance matching technique~\\citep[e.g.,][]{Conroy:06,Reddick:13}, and find the joint distribution of mass and concentration corresponding to the luminosity of the lens galaxy, which is $M_r = -21.88 \\pm 0.015$ using the SDSS DR10 magnitudes, $k$-corrected to $z=0.1$ using a red galaxy template. \nFor the abundance matching procedure, we assume the AGES luminosity function~\\citep{Kochanek:12}, and use the maximal circular velocity ($v_{\\rm max}$) of the halo at its peak value along its trajectory as the matching proxy, and also apply a constant scatter of 0.2 dex on the luminosity. This gives us the allowed spread of halo mass and concentration typical for galaxies of luminosity similar to the lensing galaxy in SDP.81.  The typical halo mass we found with this procedure is roughly $ 8.7 \\times 10^{12} M_\\odot h^{-1}$, with an approximate uncertainty of a factor of 3.5. \n\nComparing the lines and the histograms in the top panel of Figure~\\ref{fig:SDP81MassFunction}, we can see that substructure limits from SDP.81 are currently consistent with theoretical predictions. The result does hint at a lower normalization of $dn/d\\log M$, or equivalently, a smaller value of $c_\\text{subs}/c_\\text{host}$.\nHowever, the four parameters used here are highly degenerate, because all of them affect the normalization of the projected central density in similar fashions.   \nFigure~\\ref{fig:theory_all} illustrates this degeneracy by varying only \\emph{one} of the four parameters in the model at a time, and shows how each of these four parameters affects the predicted projected density over reasonable ranges in parameters space. \nGiven this degeneracy, at this stage it is difficult to jointly constrain these parameters from the observed limits. \nThe comparison shown in Figure~\\ref{fig:theory_all} also demonstrates, however, that the bounds from this Science Verification dataset are already in an interesting regime that can rule out some portion of the parameter space.\nWe also note that our estimates for substructure around strong lensing galaxies appear consistent with independent estimates from other high resolution simulations (Fiacconi et al., in prep.). \n\n\\begin{figure*} \n\\centering\n\\includegraphics[trim= 0 0 0 0, clip, width=1.00\\textwidth]{fig13.pdf}\n\\caption{ Comparison between the 95\\% confidence limits (black squares) \n  on the projected density of substructures, $dn/d\\log M$,\n  and the predictions (lines) for various properties of the host halo \n  and its substructure distribution.  \n  The thick line in each panel assumes  $M_\\text{host} = 10^{13} M_\\odot h^{-1}$, \n  a median halo concentration for that mass ($c_\\text{host}=6.615$), \n  a typical log--log slope ($\\eta=0.9$) for the subhalo mass function, \n  and that the radial distribution of subhalos matches that of dark matter\n  ($c_\\text{subs}/c_\\text{host}=1$).   Each panel varies only \\emph{one} of the four assumptions listed above.  The varying assumption is showed on the upper right corner of each panel.} \n\\label{fig:theory_all}\n\\end{figure*}\n\nThe environment of the host halo can also affect the subhalo population.\nFortuitously, SDP.81 is in the SDSS footprint, allowing us to examine its immediate environment.  This system appears to be in close proximity to a massive galaxy cluster in the SDSS DR8 RedMaPPer cluster catalog~\\citep{Rykoff:14}.  Here we use RedMaPPer v6.3  (Rykoff et al, in preparation). In the RedMaPPer catalog, this galaxy is a member (with 87\\% probability) of a more massive system, with richness $\\lambda$ = 32, where $\\lambda$ corresponds to the number of red sequence galaxies brighter than $0.4~L_\\star$.  Assuming the mass--richness relationship of \\cite{Rykoff:14}, this corresponds to a mass of $\\sim 2.6\\times 10^{14} M_{\\odot}$. According to the cluster catalog, SDP.81 is a member galaxy of this system, $640~\\text{kpc}~h^{-1}$ away from the most likely central galaxy (in projection). \n\nThe proximity of SDP.81 to a galaxy cluster has the potential to cloud our predictions for its abundance of substructure.  In principle, small subhalos unbound to SDP.81 but within the cluster could project into the strong lensing region.   For the current configuration, we have calculated the expected number of subhalos from such a cluster, at the measured distance (using the same model described in the previous section), and find that these subhalos are subdominant to those expected from the halo of SDP.81.  However, this underscores the importance of determining reliable estimates of lens halo masses and nearby environments before deriving any bounds on cosmological models from observed lensing systems.  \n\n\\section{Discussion}\n\\label{sec:discuss}\n\n\nIn this paper, we present  a method to analyze interferometric measurements of strong gravitational lenses to constrain the abundance of dark matter substructure.  We apply this method to ALMA Science Verification observations of the lens system SDP.81, and we report the detection of a subhalo with mass $M_{\\rm sub}\\approx 10^9 M_\\odot$.  We also find hints for additional substructure at lower mass, but defer a detailed analysis of additional substructure for future work.  We compare our measurements of substructure abundance to previous measurements and to theoretical predictions from CDM, and find that our results are consistent with both.\n\n\nAlthough the subhalo analysis presented in this paper only used the continuum data, the method is directly applicable to observations of molecular lines. For example, in this work our joint analysis of bands 6 and 7 treats the two bands as two distinct frequency channels. Analysis of molecular lines, therefore, only differ in the larger number of frequency channels used.\nThe computational cost of such an analysis, however would be higher. Given the strong hints of lower mass substructure that we find in the continuum data, an analysis of the line data would appear to be quite worthwhile.\n\n\nThe simulations and the analysis of independently generated mock data show that our pipeline can successfully quantify the lensing effects of  $\\gtrsim  10^7 M_{\\odot}$ subhalos. This framework is designed to be able to marginalize over many nuisance parameters to avoid false detections. We have studied the effects of complex source morphologies, source priors, visibility binning, antenna phase errors, pixel sizes, and grid width, finding that the current pipeline is a reliable tool to quantify the lensing effects of these subhalos, with systematic errors that are below our current statistical uncertainties. \nAs we push to lower subhalo masses and lower significance detection or non-detection regimes, however, we will need to quantify more subtle systematic effects. In particular, more detailed studies of weaker interferometric data corruption effects  should be carefully studied. The effects of decorrelation, visibility smearing due to frequency averaging,  choice of parameterization for antenna phase error corrections, and antenna amplitude errors are among these effects.\n\n\n\nAs Figures~\\ref{fig:subhalo_chi2_maps} and \\ref{fig:subhalo_95_limits} illustrate, the SDP.81 data set loses sensitivity for detecting individual subhalos at masses $\\lesssim 10^7 M_\\odot$. Large numbers of subhalos at low masses are expected in all CDM cosmologies, and the deflections from this population of objects combine to form an effectively stochastic field.  Even though the objects generating this random field cannot be individually detected, the collective effects of the population may be significantly detected.  For example, \\citet{hezaveh:14a} showed that the power spectrum of density fluctuations of low-mass substructure may be accurately measured using observations of lenses like SDP.81, allowing us to probe the subhalo mass function below our nominal detection limits for individual subhalos.  \n\nRecently, \\citet{Inoue2015} published an independent substructure lensing analysis of SDP.81, and it is interesting to compare their conclusions to ours.  \\citeauthor{Inoue2015} analyze CLEAN images from continuum band 7, as well as CO 8-7 line data from band 6, and report evidence for substructure at a similar location to our reported detection.  However, the properties of the substructure reported by \\citeauthor{Inoue2015} are significantly different than what we find.  In particular, it appears that their results require the presence of a compact, highly underdense region next to one of the arcs.  Underdensities are rarely compact in standard cosmologies, so this result appears puzzling.  Our analysis does not confirm this finding: we find that compact regions of overdensity explain the SDP.81 data far better than adding compact regions of underdensity (or negative density).  One possible origin for the discrepancy, as noted in Section~\\ref{sec:implement}, is that analyses of CLEANed images are subject to systematic biases arising from phase errors, which can lead to a host of spurious artifacts in substructure reconstructions (see Figure~\\ref{fig:Mars}).  Given the subtlety of the lensing effects of low-mass subhalos, we recommend that substructure analyses operate on the visibilities, and thereby fully extract the information encoded in the interferometric measurements.\n\nIn summary, the Science Verification observations of SDP.81 demonstrate the potential of ALMA for probing dark matter structures. Our joint analysis of the bands 6 and 7 data detects a  $M=10^{8.96\\pm 0.12} M_{\\odot}$ subhalo with a significance of $6.9\\sigma$ and produces substructure bounds that are consistent with previous lensing measurements of other systems \\citep{dalal:02,vegetti:14}, and also consistent with theoretical expectations as described in Section~\\ref{sec:lcdm}. However, the constraints from this one single lens are already interesting, near the abundances expected for halos of this mass.  More importantly, the analysis shows that ALMA data are sensitive to low mass substructure, in a regime that can constrain the properties of dark matter models.  Larger samples of similar lenses have the potential to put tight constraints on the mass function of dark matter substructures. \nFortunately, large samples of similar lenses are already known from existing submillimeter surveys, suggesting that future ALMA observations have the potential to significantly advance our understanding of the abundance of dark matter substructure. \n\n\n\n\n\\acknowledgements{\nWe are grateful to the \\emph{Elemental} team, Jack Poulson and Jeff Hammond,  for their continued help and tremendous support throughout this project. We thank Eli Rykoff for helpful discussions about the environment of SDP.81 in relation to the SDSS ReDMaPPer cluster sample, and Piero Madau for helpful discussions of substructure abundance in simulations.  \nSupport for this work was provided by NASA through Hubble Fellowship grant HST-HF2-51358.001-A  awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Inc., for NASA, under contract NAS 5-26555 and by the NSF under Grant No. AST-1212195.\nND is supported by NASA under grant NNX12AD02G, by a Sloan Fellowship, by the Institute for Advanced Study, by the Ambrose Monell Foundation, and by the Center for Advanced Study at UIUC. DM and JV are supported by the U.S. National Science Foundation under award AST-1312950. JEC is supported by NSF awards PLR-1248097 and PHY-0114422. RHW and PJM received support from the U.S. Department of Energy under contract number DE-AC02- 76SF00515. YYM is supported by a Weiland Family Stanford Graduate Fellowship. \n This research used one of the Dark Sky Simulations, which was run under the INCITE 2014 program using resources of the Oak Ridge Leadership Computing Facility at Oak Ridge National Laboratory,  supported by the Office of Science of the Department of Energy under Contract DE-AC05-00OR22725. Calculations presented in this work were performed on computational facilities provided by the Extreme Science and Engineering Discovery Environment (XSEDE), which is supported by National Science Foundation grant number ACI-1053575, as well as the Blue Waters sustained-petascale computing project, which is supported by the National Science Foundation (awards OCI-0725070 and ACI-1238993) and the state of Illinois. Blue Waters is a joint effort of the University of Illinois at Urbana-Champaign and its National Center for Supercomputing Applications.\nThis paper makes use of the following ALMA data: ADS/JAO.ALMA\\#2011.0.00016.SV. \nALMA is a partnership of ESO (representing its member states), NSF (USA) and \nNINS (Japan), together with NRC (Canada) and NSC and ASIAA (Taiwan), and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. The National Radio Astronomy Observatory is a facility of the National Science Foundation operated under cooperative agreement by Associated Universities, Inc.}\n\n\\bibliographystyle{yahapj}\n\\bibliography{references}\n\n\n", "itemtype": "equation", "pos": 80125, "prevtext": "\nwhere $M_\\text{host}$ is the host halo mass, $M_0$ and $\\eta$ are the normalization and the log--log slope, respectively, of the subhalo mass function.  We then use $\\Lambda$CDM simulations to calibrate the relation between the parameter $M_0$ and the mass and concentration of the host halo. To calibrate this relation, we use the same set of high-resolution zoom-in simulations described in \\cite{Mao:15}\nwith the addition of a very high-resolution cosmological box, ($4096^3$ particles in a $400~\\text{Mpc}/h$ box, {\\tt ds14\\_i}) from the Dark Sky Simulations~\\citep{Skillman:14}\\footnote{{\\tt http://darksky.slac.stanford.edu}}.\nThis calibration is done by first assuming a constant log--log slope ($\\eta$),  then finding the best-fit $M_0$ for each host halo in the simulations, and finally for all host halos, finding the best-fit values of $(\\alpha, \\beta, \\gamma)$ in\n\n", "index": 51, "text": "\\begin{equation}\nM_0 = \\alpha M_\\text{host}^\\beta c_\\text{host}^\\gamma.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"M_{0}=\\alpha M_{\\text{host}}^{\\beta}c_{\\text{host}}^{\\gamma}.\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mn>0</mn></msub><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><msubsup><mi>M</mi><mtext>host</mtext><mi>β</mi></msubsup><mo>⁢</mo><msubsup><mi>c</mi><mtext>host</mtext><mi>γ</mi></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]