[{"file": "1601.06911.tex", "nexttext": "\n}\n\nunder the constraints\n\n\\begin{enumerate}\n\n\\item[1)] $\\displaystyle \\sum_{j=1}^k \\alpha_{ij} = 1$ with $\\alpha_{ij} \\geq 0$ and $i=1,\\ldots,n$ {and}\n\n\\item[2)] $\\displaystyle \\sum_{l=1}^n \\beta_{jl} = 1$ with $\\beta_{jl} \\geq 0$ and $j=1,\\ldots,k${.}\n\n\\end{enumerate}\n\nConstraint 1) means that the predictors of $\\bold{x}_i$ are a convex combination of archetypes, $\\bold{\\hat{x}}_i = \\displaystyle \\sum_{j=1}^k \\alpha_{ij} \\bold{z}_j$. Each $\\alpha_{ij}$ is the weight of the archetype $j$ for the observation $i$; that is to say, the $\\alpha$ coefficients indicate how much each archetype contributes to the approximation of each observation. Constraint 2) means that archetypes $\\bold{z}_j$ are a mixture of the observations, $\\bold{z}_j = \\displaystyle \\sum_{l=1}^n \\beta_{jl} \\bold{x}_l$.\n\n\n\nNote that archetypes are not necessarily concrete cases of the data. This would happen if $\\bold{z}_j$ is a case of the data, i.e., if only one $\\beta_{jl}$ is equal to $1$ in constraint 2) for each $j$. This implies that $\\beta_{jl}$ can only take on the values 0 or 1, since $\\beta_{jl} \\geq 0$ and the sum of constraint 2) is 1. In ADA, the continuous optimization problem of AA transforms into the following mixed-integer optimization problem:\n\n\n", "itemtype": "equation", "pos": 8220, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\title{Functional archetype and archetypoid analysis \\tnoteref{label1}}\n\\tnotetext[label1]{{The code and data for reproducing the examples  are available at \\href{http://www3.uji.es/~epifanio/RESEARCH/faa.rar}{http://www3.uji.es/$\\sim$epifanio/RESEARCH/faa.rar}.} }\n\n\n\n\n\n\n\n\\author{Irene Epifanio\\corref{cor1}}\n\\address{Dept. Matem\\`atiques and Institut de Matem\\`atiques i Aplicacions de Castell\\'o. Campus del Riu Sec. Universitat Jaume I, 12071 Castell\\'o, Spain}\n\\cortext[cor1]{Tel.: +34 964728390; fax: +34 964728429.}\n\n\\ead{epifanio@uji.es}\n\n\n\n\n\n\\begin{abstract}\n\nArchetype and archetypoid analysis can be extended to functional data.\nEach function is represented as a mixture of actual observations (functional archetypoids) or functional archetypes, which are a mixture of observations in the data set. Well-known Canadian temperature data are used to illustrate\nthe analysis developed.\n Computational methods are proposed for performing these analyses, based on the coefficients of a basis. They are compared with other alternatives in a simulation study using a well-known curve discrimination problem, achieving better or similar performance. Unlike a previous attempt to compute functional archetypes, which was only valid for an orthogonal basis, the proposed methodology can be used for any basis. It is computationally less demanding than the simple approach of discretizing the functions. Multivariate functional archetype and archetypoid analysis are also introduced and applied in an interesting problem about the study of human development around the world over the last 50 years.\nThese tools can contribute to the understanding of a functional data set, as in the multivariate case.\n\\end{abstract}\n\n\\begin{keyword}\n\nArchetype analysis  \\sep Functional data analysis  \\sep Unsupervised learning  \\sep Extreme point  \\sep Global human development\n\n\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\\section{Introduction}\n\\label{introduccion}\nArchetype analysis (AA) is a statistical technique that seeks to represents data as a convex combination of pure or extremal types called archetypes. Archetypes are built as a convex combination of the observations. AA was first introduced by \\citet*{Cutler1994}. More recently, archetypoid analysis (ADA) was introduced by \\citet*{Vinue15}. Unlike AA, the pure types in ADA are not a mixture of observations, but real observations.\nIt has been shown that human understanding and interpretation of data is made easier when they are represented by their extreme constituents \\citep{Davis2010} by the principle of opposites \\citep{Thurau12}. In other words, extremes are better than central points for human interpretation.\nTheir applications have been growing in the recent years, especially after the AA algorithm was implemented in the R package {\\bf archetypes} (\\citet*{Eugster2009}). ADA is available in the R package {\\bf Anthropometry} (\\citet*{VinueR}). The fields of application include, for instance, market research (\\cite{Li2003}, \\cite{Porzio2008}, {\\cite{Midgley2013}}), biology (\\cite{Esposito2012}), genetics (\\cite{Morup2013}), sports (\\cite{Eugster2012}), industrial engineering (\\cite{EpiVinAle,Vinue15}), the evaluation of scientists (\\cite{Seiler2013}), astrophysics (\\cite{Chan2003}, \\cite{Richards2012}), {e-learning (\\cite{Theodosiou})}, multi-document summarization (\\cite{Canhasi13,Canhasi14}) and different machine learning problems (\\cite{Morup2012}, \\cite{Stone2002}).\n\n\nIn the seminal paper by \\cite{Cutler1994}, one of the illustrative examples worked with functional observations, i.e, data consisting of a set of functions, although they converted them into a matrix by considering a set of values of each curve (after being smoothed) at certain points. Functional data analysis (FDA) groups statistical procedures for functional\nobservations (a whole function is a datum).\nThe  objectives of FDA are essentially the same as those of any\nother branch of statistics. Although FDA is relatively new field, some classic references in this field include: \\citet{Ramsay05}, who provide an excellent overview, \\citet{Ferraty06}, with new methodologies for studying functional data nonparametrically, and \\citet{Ramsay02}, who offer interesting applications in different fields, and \\cite{Ramsay09} regarding software in this field. More recent advances and interesting applications of FDA comprise a variety of fields such as aviation safety  \\citep{Gregorutti201515}, chromatography \\citep{Raket2014227},  the quality of cookies and the relationship with the flour kneading process \\citep{Jacques201492}, the relationship between the geometry of the internal carotid artery and the presence or absence of an aneurysm \\citep{Usset2015,Sangalli09} and\nthe analysis of hippocampal differences in\nAlzheimer's disease \\citep{Epifanio11,Epifanio14}.\n\n\nA first attempt to extend AA to functional data was made by \\citet{Constatini2012}. Functions were expressed in a functional basis, and multivariate (standard) AA was applied to the coefficients in this basis. In the same way as computing multivariate principal component analysis (PCA) of the basis coefficients for carrying out functional principal component analysis (FPCA) is only valid when the basis is orthonormal, the same occurs if we seek functional archetypes, as we will see. In this paper, I develop the methodology for obtaining functional archetypes and archetypoids, whatever the basis used for approximating the functions.\n\nInterest in describing and displaying the important features of a set of curves is not recent. \\citet{JonesRice}  considered curves with extreme scores of principal components. This could be viewed as searching the archetypoid functions. However, unlike PCA, the goal of AA is to obtain extreme individuals, and curves with extreme PCA scores do not necessarily returns archetypical observations. This is explained in \\cite{Cutler1994} and shown in \\cite{EpiVinAle} through a problem where  archetypes could not be recovered with PCA even if all the components\nhad been considered.\n\n\n\nIn this paper, AA and ADA are extended to univariate and multivariate functional data (more than one function is available per individual). Section \\ref{methodology} presents a review of archetype and archetypoid analysis in the multivariate case, and their respective extensions to FDA are introduced and illustrated through a well-studied data set in the field of FDA. The location of functional archetypes and archetypoids is also analyzed. In Section \\ref{simu} a simulation study is carried out, using a well-known problem in functional classification. Human development is a topic of considerable political and public interest, suffice it to say that all United Nations member states committed to help achieve the Millennium Development Goals established in 2000, by 2015 \\citep{onu}. In Section \\ref{aplicaciones}, my proposal is applied to understanding statistics about human development for all countries, in order to obtain the big picture of global development. This can make it easier to  interpret the large amount of data about sustainable development even\n for non-experts. The code in R (\\cite{R}) and data for reproducing the results are available at \\href{http://www3.uji.es/~epifanio/RESEARCH/faa.rar}{http://www3.uji.es/$\\sim$epifanio/RESEARCH/faa.rar}. Conclusions and future work are discussed in Section \\ref{conclusiones}.\n\n\n\\section{Definition of functional AA and ADA}\n\\label{methodology}\n\\subsection{AA and ADA for multivariate data}\\label{AAmult}\nLet $\\bold{X}$ be an $n \\times m$ matrix that contains a multivariate dataset with $n$ observations and $m$ variables. The objective of AA is to find a $k \\times m$ matrix $\\bold{Z}$, which are the $k$ archetypes in those data, in such a way that data can be expressed as mixtures of those archetypes. To obtaine the archetypes, AA computes two $n \\times k$ matrices $\\bold{\\alpha}$ and $\\bold{\\beta}$ which minimize the residual sum of squares (RSS) {that arises from combining the equation where $\\bold{x}_i$ is approximated by a mixture of $\\bold{z}_j$'s (archetypes) and the equation where $\\bold{z}_j$'s is expressed as a mixture of the data:}\n\n{\n\n", "index": 1, "text": "\\begin{equation} \\label{RSSar}\n\\left. \\begin{array}{l}\n\\hspace{0.2cm} \\| \\bold{x}_i - \\sum_{j=1}^k \\alpha_{ij} \\bold{z}_j\\|^2\\\\\n\\\\\n\\hspace{0.2cm} \\bold{z}_j = \\displaystyle \\sum_{l=1}^n \\beta_{jl} \\bold{x}_l\\\\\n\\end{array} \\right\\}\n\\Rightarrow RSS = \\displaystyle \\sum_{i=1}^n \\| \\bold{x}_i - \\sum_{j=1}^k \\alpha_{ij} \\bold{z}_j\\|^2 = \\sum_{i=1}^n \\| \\bold{x}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{x}_l\\|^2{,}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\left.\\begin{array}[]{l}\\hskip 5.690551pt\\|\\mathbb{x}_{i}-\\sum_{j=1}^{k}\\alpha%&#10;_{ij}\\mathbb{z}_{j}\\|^{2}\\\\&#10;\\\\&#10;\\hskip 5.690551pt\\mathbb{z}_{j}=\\displaystyle\\sum_{l=1}^{n}\\beta_{jl}\\mathbb{x%&#10;}_{l}\\\\&#10;\\end{array}\\right\\}\\Rightarrow RSS=\\displaystyle\\sum_{i=1}^{n}\\|\\mathbb{x}_{i}%&#10;-\\sum_{j=1}^{k}\\alpha_{ij}\\mathbb{z}_{j}\\|^{2}=\\sum_{i=1}^{n}\\|\\mathbb{x}_{i}-%&#10;\\sum_{j=1}^{k}\\alpha_{ij}\\sum_{l=1}^{n}\\beta_{jl}\\mathbb{x}_{l}\\|^{2}{,}\" display=\"block\"><mrow><mrow><mrow><mi/><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><msup><mrow><mo lspace=\"8.2pt\">∥</mo><mrow><msub><mi>𝕩</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕫</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mtd></mtr><mtr><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><msub><mpadded lspace=\"5.7pt\" width=\"+5.7pt\"><mi>𝕫</mi></mpadded><mi>j</mi></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕩</mi><mi>l</mi></msub></mrow></mrow></mrow></mtd></mtr></mtable><mo>}</mo></mrow><mo>⇒</mo><mrow><mi>R</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>S</mi></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>𝕩</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕫</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>𝕩</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕩</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06911.tex", "nexttext": "\n\nunder the constraints\n\n\\begin{enumerate}\n\n\\item[1)] $\\displaystyle \\sum_{j=1}^k \\alpha_{ij} = 1$ with $\\alpha_{ij} \\geq 0$ and $i=1,\\ldots,n$ {and}\n\n{\\item[2)] $\\displaystyle \\sum_{l=1}^n \\beta_{jl} = 1$ with $\\beta_{jl} \\in \\{0,1\\}$ and $j=1,\\ldots,k$ i.e. $\\beta_{jl}=1$ \\mbox{for one and only one $l$} and $\\beta_{jl}=0$ otherwise.}\n\n\\end{enumerate}\n\nArchetypes and archetypoids are extremal (pure types) representatives of the data. Archetypes belong to the boundary of the convex hull of data if $k$ $>$ 1 (see \\cite{Cutler1994}), whereas archetypoids do not necessarily (see \\cite{Vinue15}). For $k$ = 1, the archetype is the mean, and the archetypoid is the medoid (with one cluster) (\\citet*{Kaufman90}).\n\nIn order to solve AA, \\citet{Cutler1994} proposed an alternating minimizing algorithm, which was implemented in R by \\cite{Eugster2009}. To solve  the convex least squares problems, they used  a penalized version of\nthe non-negative least squares algorithm by \\citet*{Lawson74}. As explained by \\cite{Eugster2009}, the problems to solve are of the  $\\| \\bf{u} - \\bf{Tw} \\|$ kind, where $\\bf{u}$ and $\\bf{w}$ are\nvectors and $\\bf{T}$ is a matrix, all of appropriate dimensions, and with the non-negativity and equality restrictions. In the penalized version an extra element $H$ called huge is added to $\\bf{u}$ and to each observation of $\\bf{T}$, minimizing under non-negativity constraints $\\| \\bf{u} - \\bf{Tw} \\|$ + $H \\| 1 - \\bf{w} \\|$. The larger $H$ is, the more dominant the second term is, which means that the equality restrictions are fulfilled.\nThe penalized non-negative least squares method is quite slow, but it is attractive since it can be used if the number of variables\nis larger than the number of cases (according to \\cite{Cutler1994}).\nNote that in the R library {\\bf archetypes}, data are standardized by default. \n\n\n To solve ADA, \\cite{Vinue15} proposed an algorithm, which was implemented in R by \\cite{VinueR}, based on the Partitioning Around Medoids (PAM) clustering algorithm (\\cite{Kaufman90}).\nThat algorithm consists of two phases{, a BUILD step and a SWAP step. An initial set of archetypoids is computed in the BUILD phase}. The SWAP step seeks to improve the set of archetypoids by exchanging chosen observations for unselected cases and by checking if these replacements reduce the RSS.\nIn the R implementation, the initial candidates are determined in three different ways. The first are the nearest observations in Euclidean distance to the $k$ archetypes, the so-called $cand_{ns}$ set. The second candidates, referred to as the  {$cand_{\\alpha}$} set, are the observations with the maximum $\\alpha$ value for each archetype, i.e., the observations with the largest relative share for the respective archetype. The third initial candidates, the $cand_{\\beta}$ set, consist of the cases with the maximum $\\beta$ value for each archetype, i.e., those whose contribution to the generation of archetypes is largest.\n\n\n\nNeither archetypes nor archetypoids are necessarily nested. In order to select the value $k$ the user can decide how many representatives are to be considered or the elbow criterion can be used as in \\cite{Cutler1994,Eugster2009,Vinue15} (the value $k$ is chosen as the point where the elbow on the RSS representation for a series of different $k$ values is found).\n\n\n\n\\subsection{AA and ADA for functional data}\\label{FAA}\nThe first consideration is that in the functional context, the values of the $m$ variables in the multivariate context are replaced by function values with a continuous index $t$. Similarly, summations are replaced by integration to define the inner product.\nLet $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$ be a set of univariate observed functions with argument $t$ defined in the interval $[a,b]$. It is always assumed that these functions satisfy reasonable\nsmoothness conditions and are square-integrable functions on\nthat interval, a Hilbert space.\nThe objective of functional archetype analysis (FAA) is to find $k$ archetype functions, in such a way that our  functional data sample can be expressed as mixtures of those archetypes. Analogously, FAA computes two $n \\times k$ matrices $\\bold{\\alpha}$ and $\\bold{\\beta}$ which minimize the residual sum of squares (RSS) as in equation \\ref{RSSar}, taking into account that now $\\| . \\|$ stands for a functional norm instead of a vector norm and that the vectors $\\bold{x}_i$ and $\\bold{z}_j$ correspond to the functions ${x_i}$ and ${z_j}$. The meaning of $\\bold{\\alpha}$ and $\\bold{\\beta}$ in the functional case is identical to the multivariate case.\n\nIn the same manner, functional archetypoid analysis (FADA) seeks $k$ functions of the sample (archetypoids), in such a way that our  functional data sample can be expressed as mixtures of those archetypoids. As before, the vectorial norms are replaced by functional norms in equation \\ref{arche_adapt}, and the interpretation is identical, changing only vectors for functions.\n\nThe same proofs developed by \\cite{Cutler1994} can be used to demonstrate that the functional archetype for $k$ = 1 is the functional mean, whereas for $k$ $>$ 1, functional archetypes belong to the boundary of the convex hull generated by the set $S$ = $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$, $conv(S)$. In the archetypoid case, for $k$ = 1, as in the multivariate case, archetypoid would be the functional medoid (with one cluster) of $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$,\nsince the minimization of RSS coincides with the definition of functional medoid, if the vectorial norms are replaced by functional norms in its definition (the medoid\nis that case of the cluster for which the average dissimilarity to all the cases of the cluster is minimal \\cite{Kaufman90}). For $k$ $>$ 1, archetypoids are not necessarily vertices in the multivariate case or in the functional case. A vertex of the convex hull of $S$ is a case $x_i$ of $S$ for which $x_i$ does not belong to $conv(S \\backslash \\{x_i\\})$. For example, let us consider the following functions defined in $[0, 1]$, $x_1(t)$ = 0, $x_2(t)$ = 1 if $t$ in $[0, 0.5]$ and 0.8 in $(0.5, 1]$, $x_3(t)$ = 0.8 if $t$ in $[0, 0.5]$ and 1 in $(0.5, 1]$ and $x_4(t)$ = 0.9. For $k$ = 2, the functional archetypoids are $x_1$ and $x_4$, and $x_4$ is not a vertex, since $x_4$ = 0.5$x_2$ + 0.5$x_3$.\n\n\n\n\\subsubsection{Computational details}\nAfter defining the problem, computational methods for FAA and FADA have to be determined. The $L^2$-norm ($\\|f\\|^2= <f,f> = \\int_a^b f(t)^2 dt$) is considered for RSS computation. Note that, in practice, the functions are not observed continuously,\nbut rather in a finite set of points. Suppose that preliminary steps such as smoothing have been carried out. A naive approach is to discretize the observed functions to a fine grid of $m$ equally spaced values from $a$ to $b$. This gives an $n \\times m$ $\\bold{X}$ matrix that can be used with standard multivariate AA and ADA. This was the strategy followed by \\cite{Cutler1994} in their seminal paper for working with functional observations. Depending on the features of the functions, the number $m$ may have to be large to capture them, which increases the computational time (in the computational complexity study by \\cite{Eugster2009}, increasing the number of variables implied a polynomial increase of the\ncomputation time per iteration in AA). It should also be noted that this approach uses a fairly crude approximation of the integral $\\int_a^b f(t)^2 dt$ as the simple sum of discrete values. It would be similar to the trapezoidal rule; in fact, both methods are the same if periodic boundary conditions are considered. Other more sophisticated numerical integration techniques could be used to obtain a higher accuracy for approximating the integrals, at the expense of increasing the computational complexity. Rather, the basis function expansion of the functions will be used. In this way, a high accuracy will be kept without increasing the computational cost. In fact, as the number of basis functions used is usually smaller than the number of sampling points, the computational time will be decreased with respect to the strategy of discretizing the functions.\n\nFirst, each function $x_i$ is expressed as a linear combination of known basis functions $B_h$ with $h$ = 1, ..., $m$: $x_i(t)$ = $\\sum_{h=1}^m b_i^h B_h(t)$ = ${\\bold{b_i'B}}$, where $'$ stands for transpose and $\\bold{b_i}$  indicates the vector of length $m$ of the coefficients and $\\bold{B}$ the functional vector whose elements are the basis functions. (See \\cite{Ramsay05} for a good explanation about smoothing functional data). Along with this, RSS can be expressed (with the corresponding constraints for FAA and FADA) as:\n\n\n\n", "itemtype": "equation", "pos": 9913, "prevtext": "\n}\n\nunder the constraints\n\n\\begin{enumerate}\n\n\\item[1)] $\\displaystyle \\sum_{j=1}^k \\alpha_{ij} = 1$ with $\\alpha_{ij} \\geq 0$ and $i=1,\\ldots,n$ {and}\n\n\\item[2)] $\\displaystyle \\sum_{l=1}^n \\beta_{jl} = 1$ with $\\beta_{jl} \\geq 0$ and $j=1,\\ldots,k${.}\n\n\\end{enumerate}\n\nConstraint 1) means that the predictors of $\\bold{x}_i$ are a convex combination of archetypes, $\\bold{\\hat{x}}_i = \\displaystyle \\sum_{j=1}^k \\alpha_{ij} \\bold{z}_j$. Each $\\alpha_{ij}$ is the weight of the archetype $j$ for the observation $i$; that is to say, the $\\alpha$ coefficients indicate how much each archetype contributes to the approximation of each observation. Constraint 2) means that archetypes $\\bold{z}_j$ are a mixture of the observations, $\\bold{z}_j = \\displaystyle \\sum_{l=1}^n \\beta_{jl} \\bold{x}_l$.\n\n\n\nNote that archetypes are not necessarily concrete cases of the data. This would happen if $\\bold{z}_j$ is a case of the data, i.e., if only one $\\beta_{jl}$ is equal to $1$ in constraint 2) for each $j$. This implies that $\\beta_{jl}$ can only take on the values 0 or 1, since $\\beta_{jl} \\geq 0$ and the sum of constraint 2) is 1. In ADA, the continuous optimization problem of AA transforms into the following mixed-integer optimization problem:\n\n\n", "index": 3, "text": "\\begin{equation}\\label{arche_adapt}\nRSS = \\displaystyle \\sum_{i=1}^n \\| \\bold{x}_i - \\sum_{j=1}^k \\alpha_{ij} \\bold{z}_j\\|^2 = \\sum_{i=1}^n \\| \\bold{x}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{x}_l\\|^2 {,}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"RSS=\\displaystyle\\sum_{i=1}^{n}\\|\\mathbb{x}_{i}-\\sum_{j=1}^{k}\\alpha_{ij}%&#10;\\mathbb{z}_{j}\\|^{2}=\\sum_{i=1}^{n}\\|\\mathbb{x}_{i}-\\sum_{j=1}^{k}\\alpha_{ij}%&#10;\\sum_{l=1}^{n}\\beta_{jl}\\mathbb{x}_{l}\\|^{2}{,}\" display=\"block\"><mrow><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>S</mi></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>𝕩</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕫</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>𝕩</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>𝕩</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06911.tex", "nexttext": "\nwhere $\\bold{a'}_i$ = $\\bold{b'}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b'}_l$ and $\\bold{W}$ is the order $m$ symmetric matrix with elements $w_{m_1,m_2}$ = $\\int B_{m_1}B_{m_2}$, i.e.  the matrix containing the inner products of the pairs of basis functions. In the case of an orthonormal basis such as Fourier, $\\bold{W}$ is the order $m$ identity matrix, and\nFAA (FADA, respectively) is reduced to AA (ADA, respectively) of the basis coefficients. But, in other cases, we may have to resort to numerical integration to evaluate $\\bold{W}$, but once $\\bold{W}$ is computed, no more numerical integrations are necessary.\n\nAs we can see, the first attempt to define FAA made by \\cite{Constatini2012} is only valid if the basis is orthonormal, but not otherwise.\n\nTo illustrate the concepts, a database heavily analyzed in FDA that appeared in \\cite{Ramsay05} to illustrate FPCA is used, so that readers who are interested can appreciate the differences in the analysis. The  mean monthly temperatures for 35 Canadian weather stations averaged over 1960 to 1994 are considered. As in \\cite{Ramsay05}, the data are approximated with a 12-term Fourier series. \nAs there are four climate zones, four archetypes and archetypoids are chosen. Fig. \\ref{canada} shows the solution of FAA and FADA (the same archetypoids are obtained from the three initial candidates). The FADA solution corresponds to the following weather station (each of them belongs to a different climate zone): Montreal (Atlantic), Resolute (Arctic), Dawson (Continental) and Victoria (Pacific), in black, red, green and blue, respectively. If we bring to mind a map of Canada, these stations are located near the borders (extreme zones) of the country.\n\n\n\n\n\n\\subsection{Multivariate FAA and FADA}\nWe often wish to study more than one function at the same time. For the shake of clarity, the extension of FAA and FADA to deal\nwith bivariate functional data is discussed. The key is to define an inner product between bivariate\nfunctions, which is computed simply as the sum of the inner products of the two components.\nTherefore, the squared norm of a bivariate function is simply\nthe sum of the squared norms of the two component functions.  What all this amounts to is that FAA or FADA for $M$ multivariate functions is equivalent to $M$ independent FAA or FADA, respectively, with shared parameters $\\bold{\\alpha}$ and $\\bold{\\beta}$. In practice, a composite function is formed by\n stringing the $M$ functions\ntogether.\n\n\n\n\nLet $f_i(t)$ = $(x_i(t), y_i(t))$ be a bivariate function. Its squared  norm  is $\\|f_i\\|^2= \\int_a^b x_i(t)^2 dt + \\int_a^b y_i(t)^2 dt$. To compute FAA and FADA, let us consider $\\bold{b^x_i}$ and  $\\bold{b^y_i}$, which are the vectors of length $m$ of the coefficients for $x_i$ and $y_i$ respectively for the basis functions $B_h$. Therefore,\n\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=.8\\textwidth]{canadian.eps}\n\\end{tabular}\n\\caption{Four functional archetypes (solid lines) and archetypoids (dashed lines) for Canadian weather stations.\\label{canada}}\n\\end{figure}\n\n\n\n", "itemtype": "equation", "pos": 18864, "prevtext": "\n\nunder the constraints\n\n\\begin{enumerate}\n\n\\item[1)] $\\displaystyle \\sum_{j=1}^k \\alpha_{ij} = 1$ with $\\alpha_{ij} \\geq 0$ and $i=1,\\ldots,n$ {and}\n\n{\\item[2)] $\\displaystyle \\sum_{l=1}^n \\beta_{jl} = 1$ with $\\beta_{jl} \\in \\{0,1\\}$ and $j=1,\\ldots,k$ i.e. $\\beta_{jl}=1$ \\mbox{for one and only one $l$} and $\\beta_{jl}=0$ otherwise.}\n\n\\end{enumerate}\n\nArchetypes and archetypoids are extremal (pure types) representatives of the data. Archetypes belong to the boundary of the convex hull of data if $k$ $>$ 1 (see \\cite{Cutler1994}), whereas archetypoids do not necessarily (see \\cite{Vinue15}). For $k$ = 1, the archetype is the mean, and the archetypoid is the medoid (with one cluster) (\\citet*{Kaufman90}).\n\nIn order to solve AA, \\citet{Cutler1994} proposed an alternating minimizing algorithm, which was implemented in R by \\cite{Eugster2009}. To solve  the convex least squares problems, they used  a penalized version of\nthe non-negative least squares algorithm by \\citet*{Lawson74}. As explained by \\cite{Eugster2009}, the problems to solve are of the  $\\| \\bf{u} - \\bf{Tw} \\|$ kind, where $\\bf{u}$ and $\\bf{w}$ are\nvectors and $\\bf{T}$ is a matrix, all of appropriate dimensions, and with the non-negativity and equality restrictions. In the penalized version an extra element $H$ called huge is added to $\\bf{u}$ and to each observation of $\\bf{T}$, minimizing under non-negativity constraints $\\| \\bf{u} - \\bf{Tw} \\|$ + $H \\| 1 - \\bf{w} \\|$. The larger $H$ is, the more dominant the second term is, which means that the equality restrictions are fulfilled.\nThe penalized non-negative least squares method is quite slow, but it is attractive since it can be used if the number of variables\nis larger than the number of cases (according to \\cite{Cutler1994}).\nNote that in the R library {\\bf archetypes}, data are standardized by default. \n\n\n To solve ADA, \\cite{Vinue15} proposed an algorithm, which was implemented in R by \\cite{VinueR}, based on the Partitioning Around Medoids (PAM) clustering algorithm (\\cite{Kaufman90}).\nThat algorithm consists of two phases{, a BUILD step and a SWAP step. An initial set of archetypoids is computed in the BUILD phase}. The SWAP step seeks to improve the set of archetypoids by exchanging chosen observations for unselected cases and by checking if these replacements reduce the RSS.\nIn the R implementation, the initial candidates are determined in three different ways. The first are the nearest observations in Euclidean distance to the $k$ archetypes, the so-called $cand_{ns}$ set. The second candidates, referred to as the  {$cand_{\\alpha}$} set, are the observations with the maximum $\\alpha$ value for each archetype, i.e., the observations with the largest relative share for the respective archetype. The third initial candidates, the $cand_{\\beta}$ set, consist of the cases with the maximum $\\beta$ value for each archetype, i.e., those whose contribution to the generation of archetypes is largest.\n\n\n\nNeither archetypes nor archetypoids are necessarily nested. In order to select the value $k$ the user can decide how many representatives are to be considered or the elbow criterion can be used as in \\cite{Cutler1994,Eugster2009,Vinue15} (the value $k$ is chosen as the point where the elbow on the RSS representation for a series of different $k$ values is found).\n\n\n\n\\subsection{AA and ADA for functional data}\\label{FAA}\nThe first consideration is that in the functional context, the values of the $m$ variables in the multivariate context are replaced by function values with a continuous index $t$. Similarly, summations are replaced by integration to define the inner product.\nLet $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$ be a set of univariate observed functions with argument $t$ defined in the interval $[a,b]$. It is always assumed that these functions satisfy reasonable\nsmoothness conditions and are square-integrable functions on\nthat interval, a Hilbert space.\nThe objective of functional archetype analysis (FAA) is to find $k$ archetype functions, in such a way that our  functional data sample can be expressed as mixtures of those archetypes. Analogously, FAA computes two $n \\times k$ matrices $\\bold{\\alpha}$ and $\\bold{\\beta}$ which minimize the residual sum of squares (RSS) as in equation \\ref{RSSar}, taking into account that now $\\| . \\|$ stands for a functional norm instead of a vector norm and that the vectors $\\bold{x}_i$ and $\\bold{z}_j$ correspond to the functions ${x_i}$ and ${z_j}$. The meaning of $\\bold{\\alpha}$ and $\\bold{\\beta}$ in the functional case is identical to the multivariate case.\n\nIn the same manner, functional archetypoid analysis (FADA) seeks $k$ functions of the sample (archetypoids), in such a way that our  functional data sample can be expressed as mixtures of those archetypoids. As before, the vectorial norms are replaced by functional norms in equation \\ref{arche_adapt}, and the interpretation is identical, changing only vectors for functions.\n\nThe same proofs developed by \\cite{Cutler1994} can be used to demonstrate that the functional archetype for $k$ = 1 is the functional mean, whereas for $k$ $>$ 1, functional archetypes belong to the boundary of the convex hull generated by the set $S$ = $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$, $conv(S)$. In the archetypoid case, for $k$ = 1, as in the multivariate case, archetypoid would be the functional medoid (with one cluster) of $\\{x_1(t),$\n$\\dots,$ $x_n(t)\\}$,\nsince the minimization of RSS coincides with the definition of functional medoid, if the vectorial norms are replaced by functional norms in its definition (the medoid\nis that case of the cluster for which the average dissimilarity to all the cases of the cluster is minimal \\cite{Kaufman90}). For $k$ $>$ 1, archetypoids are not necessarily vertices in the multivariate case or in the functional case. A vertex of the convex hull of $S$ is a case $x_i$ of $S$ for which $x_i$ does not belong to $conv(S \\backslash \\{x_i\\})$. For example, let us consider the following functions defined in $[0, 1]$, $x_1(t)$ = 0, $x_2(t)$ = 1 if $t$ in $[0, 0.5]$ and 0.8 in $(0.5, 1]$, $x_3(t)$ = 0.8 if $t$ in $[0, 0.5]$ and 1 in $(0.5, 1]$ and $x_4(t)$ = 0.9. For $k$ = 2, the functional archetypoids are $x_1$ and $x_4$, and $x_4$ is not a vertex, since $x_4$ = 0.5$x_2$ + 0.5$x_3$.\n\n\n\n\\subsubsection{Computational details}\nAfter defining the problem, computational methods for FAA and FADA have to be determined. The $L^2$-norm ($\\|f\\|^2= <f,f> = \\int_a^b f(t)^2 dt$) is considered for RSS computation. Note that, in practice, the functions are not observed continuously,\nbut rather in a finite set of points. Suppose that preliminary steps such as smoothing have been carried out. A naive approach is to discretize the observed functions to a fine grid of $m$ equally spaced values from $a$ to $b$. This gives an $n \\times m$ $\\bold{X}$ matrix that can be used with standard multivariate AA and ADA. This was the strategy followed by \\cite{Cutler1994} in their seminal paper for working with functional observations. Depending on the features of the functions, the number $m$ may have to be large to capture them, which increases the computational time (in the computational complexity study by \\cite{Eugster2009}, increasing the number of variables implied a polynomial increase of the\ncomputation time per iteration in AA). It should also be noted that this approach uses a fairly crude approximation of the integral $\\int_a^b f(t)^2 dt$ as the simple sum of discrete values. It would be similar to the trapezoidal rule; in fact, both methods are the same if periodic boundary conditions are considered. Other more sophisticated numerical integration techniques could be used to obtain a higher accuracy for approximating the integrals, at the expense of increasing the computational complexity. Rather, the basis function expansion of the functions will be used. In this way, a high accuracy will be kept without increasing the computational cost. In fact, as the number of basis functions used is usually smaller than the number of sampling points, the computational time will be decreased with respect to the strategy of discretizing the functions.\n\nFirst, each function $x_i$ is expressed as a linear combination of known basis functions $B_h$ with $h$ = 1, ..., $m$: $x_i(t)$ = $\\sum_{h=1}^m b_i^h B_h(t)$ = ${\\bold{b_i'B}}$, where $'$ stands for transpose and $\\bold{b_i}$  indicates the vector of length $m$ of the coefficients and $\\bold{B}$ the functional vector whose elements are the basis functions. (See \\cite{Ramsay05} for a good explanation about smoothing functional data). Along with this, RSS can be expressed (with the corresponding constraints for FAA and FADA) as:\n\n\n\n", "index": 5, "text": "\\begin{equation}\\label{RSSfar}\n\\begin{split}\n\n RSS = \\displaystyle \\sum_{i=1}^n \\| {x}_i - \\sum_{j=1}^k \\alpha_{ij} {z}_j\\|^2 = \\sum_{i=1}^n \\| {x}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} {x}_l\\|^2 = \\\\\n\\sum_{i=1}^n \\| \\bold{b'}_i\\bold{B} - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b'}_l \\bold{B}\\|^2 =\n \\sum_{i=1}^n \\| (\\bold{b'}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b'}_l) \\bold{B}\\|^2 =\\\\  \\sum_{i=1}^n \\| \\bold{a'}_i \\bold{B}\\|^2 = \\sum_{i=1}^n <\\bold{a'}_i \\bold{B}, \\bold{a'}_i \\bold{B}> = \n \\sum_{i=1}^n \\bold{a'}_i \\bold{W} \\bold{a}_i\n {,}\n\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\par&#10; RSS=\\displaystyle\\sum_{i=1}^{n}\\|{x}_{i}-\\sum_%&#10;{j=1}^{k}\\alpha_{ij}{z}_{j}\\|^{2}=\\sum_{i=1}^{n}\\|{x}_{i}-\\sum_{j=1}^{k}\\alpha%&#10;_{ij}\\sum_{l=1}^{n}\\beta_{jl}{x}_{l}\\|^{2}=\\\\&#10;\\displaystyle\\sum_{i=1}^{n}\\|\\mathbb{b^{\\prime}}_{i}\\mathbb{B}-\\sum_{j=1}^{k}%&#10;\\alpha_{ij}\\sum_{l=1}^{n}\\beta_{jl}\\mathbb{b^{\\prime}}_{l}\\mathbb{B}\\|^{2}=%&#10;\\sum_{i=1}^{n}\\|(\\mathbb{b^{\\prime}}_{i}-\\sum_{j=1}^{k}\\alpha_{ij}\\sum_{l=1}^{%&#10;n}\\beta_{jl}\\mathbb{b^{\\prime}}_{l})\\mathbb{B}\\|^{2}=\\\\&#10;\\displaystyle\\sum_{i=1}^{n}\\|\\mathbb{a^{\\prime}}_{i}\\mathbb{B}\\|^{2}=\\sum_{i=1%&#10;}^{n}&lt;\\mathbb{a^{\\prime}}_{i}\\mathbb{B},\\mathbb{a^{\\prime}}_{i}\\mathbb{B}&gt;=%&#10;\\sum_{i=1}^{n}\\mathbb{a^{\\prime}}_{i}\\mathbb{W}\\mathbb{a}_{i}{,}\\par&#10;\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>S</mi></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>z</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>x</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><mrow><mmultiscripts><mi>𝕓</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝔹</mi></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><mmultiscripts><mi>𝕓</mi><none/><mo>′</mo><mi>l</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝔹</mi></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>𝕓</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><mmultiscripts><mi>𝕓</mi><none/><mo>′</mo><mi>l</mi><none/></mmultiscripts></mrow></mrow></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>𝔹</mi></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><mmultiscripts><mi>𝕒</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝔹</mi></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mo>&lt;</mo><mrow><mmultiscripts><mi>𝕒</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝔹</mi></mrow></mrow><mo>,</mo><mrow><mrow><mmultiscripts><mi>𝕒</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝔹</mi></mrow><mo>≥</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><mmultiscripts><mi>𝕒</mi><none/><mo>′</mo><mi>i</mi><none/></mmultiscripts><mo>⁢</mo><mi>𝕎</mi><mo>⁢</mo><msub><mi>𝕒</mi><mi>i</mi></msub></mrow></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06911.tex", "nexttext": "\nwhere $\\bold{a^x}_i'$ = $\\bold{b^x}_i' - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b^x}_l'$ and $\\bold{a^y}_i'$ = $\\bold{b^y}_i' - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b^y}_l'$, with the corresponding constraints for $\\bold{\\alpha}$ and $\\bold{\\beta}$. As before, a penalized version of\nthe non-negative least squares algorithm is used to solve the minimization, but note that  the observations are now formed by joining\n$\\bold{b^x_i}$ and  $\\bold{b^y_i}$. If the basis is orthonormal, FAA and FADA can be computed by applying the multivariate (classical) version to the $n \\times 2m$ coefficient matrix composed by joining the coefficient matrix for $x$ and $y$ components.\n\n\n\n\n\\section{Simulation study}\\label{simu}\nA simulation study is carried out in order to check the correctness of the procedures and test their performance. A  functional version proposed by \\citet{Ferraty} of well-known simulated\ndata, namely waveform data \\citep{Breiman}, is used.\nThis  functional version of waveform data has been widely used in functional classification problems. In order to evaluate the results of the simulation study, misclassification errors with the curve discrimination methodologies proposed in \\citet{Ferraty,RossiConan05,Epifanio08}, which used those functional waveforms in the same experimental setup, will be  compared with those obtained by modeling the waveforms with functional archetypes.\n\nFirstly, let us define the experimental setup.\nFunctions $x$ are discretized\n at 101\npoints ($t$ = 1, 1.2, 1.4, ..., 21) such that\n\\begin{itemize}\n    \\item $x(t) = uh_1(t) + (1 - u)h_2(t) + \\epsilon(t)$ for class 1,\n    \\item\n $x(t) = uh_1(t) + (1\n- u)h_3(t) + \\epsilon(t)$ for class 2, and\n    \\item $x(t) = uh_2(t) + (1 - u)h_3(t) + \\epsilon(t)$ for class 3,\n\\end{itemize}\nwhere $u$ is uniform on $[0, 1]$, $\\epsilon(t)$ are standard\nnormal variables, and  $h_i$ are the shifted triangular\nwaveforms: $h_1(t)$ = $max(6 - |t - 11|, 0)$,  $h_2(t)$ = $h_1(t -\n4)$ and $h_3(t)$ = $h_1(t + 4)$.\n\n\nA total of 50 data sets are built with the same sample sizes as in \\cite{Ferraty}. In each data set, the training\nsample has 150 waveforms in each of the 3 classes, while each\ntest sample contains 250 waveforms in each class, 750 waveforms in total.\nNote that $x$ are convex combinations of $h_j$ ($j$ = 1, 2, 3), and therefore $h_j$ are archetype functions by definition. For the first class, the mixture does not involve the function $h_3$, so therefore the coefficient for $h_3$ in the mixture is zero for the first class samples. Analogously, it is zero for $h_2$ and $h_1$ for the second and third class samples, respectively. Therefore, the assignment to a class criterion will be based on determining for which $h_j$ its coefficient in the mixture is smallest.  For example, if the smallest coefficient in the mixture is for $h_1$ ($h_2$, $h_3$), then the observation will be assigned to class 3 (2, 1, respectively).\n\nFor FAA, functions are smoothed by 32 basis functions\nof B-splines of order 6, the knots are equally spaced, and the\nroughness penalty is the integrated squared second derivative, as in \\cite{Epifanio08}. The value of the smoothing parameter $\\lambda$ is chosen with the generalized cross-validation (GCV) criterion implemented in the function smooth.basisPar of the  {\\bf fda} library \\citep{fda}. For possible $\\lambda$s = 0.01 , 0.1, 1, 10 and 100, GCV is minimized with $\\lambda$ = 10 for the 50 training sets, and therefore this value is chosen. Three functional archetypes, the estimated $h_j$, are computed using the basis expansion in each training set. The matrices $\\bf{\\alpha}$, which give the mixtures with respect to those three functional archetypes obtained with the training set, are calculated for both the training set and the test set.  Taking into account the explanation given in the previous paragraph, the minimum value (the nearest to zero) of the three $\\alpha_{ij}$ for each observation $x_i$ in the training set is computed. However, it is not known a priori which archetype corresponds to each $h_j$, so before an assignation to a class can be made, it is necessary to determine which archetype corresponds to each $h_j$. For that reason, all the permutations in the columns of the matrix $\\bf{\\alpha}$ of the training set is carried out, and the one which gives the smallest number of misclassification in the training set is selected. Columns of matrix $\\bf{\\alpha}$ for each test set are permuted according to the permutation determined with the training set. Then, for an observation $x_i$ in the test set, the minimum value of the three $\\alpha_{ij}$ is determined, and the observation is assigned to the corresponding class, as previously explained. This procedure is repeated for each of the 50 data sets, and the misclassification errors in the test sets are obtained and summarized in Table \\ref{wavetabla}, in the row called FAA-Basis.\n\n\n\nThis procedure is also applied to the discretized functions, without smoothing them (with the raw data), and previously smoothing them as explained before, and evaluating the functions at the 101 points. The misclassification errors for them are shown in Table \\ref{wavetabla} in the FAA-Raw and FAA-Discretizing rows, respectively. Out of interest, the results obtained using the methodology considered in \\cite{Constatini2012}, applying AA to the basis coefficients, without taking into account that this basis is not orthonormal, can be read in the FAA-Cos row.\nIn this table, the misclassification errors for the methodologies proposed by \\cite{Ferraty,RossiConan05,Epifanio08} with the best results are also shown.  Specifically, for \\cite{Ferraty} it was their nonparametric method that includes\nthe MPLSR method in its semimetrics,  NPCD/MPLSR ($q_{opt} = 3$). For \\cite{RossiConan05}, their functional multilayer\nperceptron approach, called FMLP. For \\cite{Epifanio08}, the methodology based on the ICA coefficients with 3 components, called ICA (3 characteristics). \\cite{Ferraty} offered a comparison with other methodologies, which gave worse results, as can be seen.\n\n\\begin{table}[H]\n  \\centering\n  \\caption{Waveform data as in \\cite{Ferraty}: test error rates averaged over 50\n  simulations.\n \\label{wavetabla}}\n  \\begin{tabular}{lcc}\\hline\nMethod & Test error rates & Standard deviation\\\\\\hline\nNPCD/MPLSR ($q_{opt} = 3$)& 0.072& 0.012\\\\\nFMLP & 0.065 & 0.010\\\\\nICA (3 characteristics) & 0.065 & 0.011\\\\\nFAA-Basis & 0.064 & 0.010\\\\\nFAA-Raw &  0.070& 0.011\\\\\nFAA-Discretizing & 0.064 & 0.011 \\\\\nFAA-Cos & 0.067& 0.012\\\\\n\\hline\n  \\end{tabular}\n\\end{table}\n\nThe best results are for FAA-Basis and FAA-Discretizing, although the standard deviation is smaller for FAA-Basis. The medians are 0.062 and 0.064 for FAA-Basis and FAA-Discretizing, respectively.\n\nFig. \\ref{wavfig} displays the functional archetypes returned with FAA-Basis for the first training database, together with the original $h_j$'s. Note that $h_j$'s are not smooth but as the waveforms had been smoothed, the functional archetypes are. Archetypes are recovered, except for the peaks (breaks) due to the smoothing.\n\n\n\n\n\n\\section{Applications and results}\n\\label{aplicaciones} World Bank Open Data is a free and open access database about development in countries around the globe. Two indicators from the database World Development Indicators \\citep{wbdata} are considered here. These indicators are the same as those selected by Rosling in one of his legendary presentations: ``The best stats you've ever seen'' in TED Talks \\citep{RoslingTED}, which dispelled myths about the world.\nOne of the  indicators considered is  total fertility rate (births per woman). Total fertility rate (TFR) represents the number of children that would be born to a woman if she were to live to the end of her childbearing years and bear children in accordance with current age-specific fertility rates.\nThe other is life expectancy at birth (LEB),  i.e.,  the number of years a newborn infant would live if prevailing patterns of mortality at the time of its birth were to stay the same throughout its life.\nThe series of each country goes from 1960 to 2013.\n\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=.7\\textwidth]{waveformfaa.eps}\n\\end{tabular}\n\\caption{Three functional archetypes (dashed lines) and $h_j$ (solid lines) for the first waveform training set.\\label{wavfig}}\n\\end{figure}\n\n\nInstead of using the motion charts developed by Rosling, I consider the use of functional archetypoids for representing the big picture of global development. As data are represented as a convex combination of the archetypoids, this encourages interpretation in contrast with techniques that express data as a linear combination (not restricted to be between 0 and 1) of certain important latent components \\citep{Thurau12}. Archetypoids and archetypes accommodates human cognition, by focusing\non extreme opposites \\citep{Thurau12}.\nUsing functional archetypoids instead of functional archetypes facilitates an intuitive understanding of the results even for non-experts \\citep{Vinue15,Thurau12}, as FADA represents the data as mixtures of extreme\ncountries, and not as mixtures of mixtures, as FAA does.\n\n\n For some small countries (many of them small islands) data are missing for the majority of years. Only information for the last few years is available. These countries have not been considered. Three countries with missing values for only some of the years have not been erased from the database. In total 190 countries have been considered. All functions (those with or without missing years) are expressed with 32 B-spline basis functions of order 4 (cubic splines) from 1960 to 2013, with equally spaced knots. Having a different number of argument values is not a problem with FDA.\n\nNote that TFR and LEB  \n are measured\nin non-compatible units, then each functional variable should be standardized. Functional means and variances are defined point-wisely across replications \\citep{Ramsay05}.  The averages are subtracted from the respective functions, then functions are divided by the respective standard deviation functions. Computationally, this can be done by standardizing the coefficients in the basis. Bivariate FADA is computed after standardization.\n\nThe number of archetypoids can be chosen according to the level of detail that we want to consider to explain our data. With few (2 or 3) archetypoids, we can achieve a broad vision, but with a larger number of archetypoids we will discover interesting and finer patterns, at the expense of increasing the number of graphs to achieve a complete global vision.  In the interests of brevity\nand as an illustrative example we examine the results of 5 functional archetypoids, an intermediate number (not too small or too large).  Functional archetypoids (the same solution is obtained from the three initial candidates) are (the continent to which each country belongs appears between parentheses): 1) Lesotho (Southern Africa),      2) the  Channel Islands (Western Europe), 3) Niger (Western Africa),        4)  Qatar (Southwest Asia) and 5) Bhutan (South Asia). Figure \\ref{arworld} shows the TFR and LEB functions for these countries, plotted by their respective digits.\n\n\n\\begin{figure}[h]\n\\centering\n\\begin{tabular}{cc}\n\\includegraphics[width=0.5\\textwidth]{an5tfr.eps} & \\includegraphics[width=0.5\\textwidth]{an5leb.eps}\n\\end{tabular}\n\\caption{TFR (a) and LEB (b) archetypoid functions for $k$ = 5.\\label{arworld}}\n\\end{figure}\n\nTFR in Lesotho has decreased from nearly 6 children in 1960  to 3. The LEB curve reflects a significant problem in Southern Africa: HIV/AIDS. Southern Africa is the worst affected region on the continent, with a very high prevalence (in Lesotho nearly one quarter of the population lives with HIV). We can see how life expectancy was growing from 1960, until the 1990s when the AIDs crisis began. Nowadays LEB in Lesotho is below 50 years. On the other hand, the Channel Islands is representative of countries with low TFR (2.5 in the 1960s and 1.5 now) and high LEB over the years (LEB has risen from 71 to 80 years since the 1960s). On the contrary, Niger is representative of countries with high TFR (around 7) over the years, but low LEB (36 years) in the 1960s, which has increased to nearly 60 years nowadays. TFR in Qatar and Bhutan has decreased spectacularly in this period, from nearly 7 in the 1960s to 2 nowadays. Nevertheless, this decrease has taken place in different times. The decline in TFR in Qatar began in the 1970s, whereas in Bhutan it began in 1980s. As regards LEB, in both cases the life expectancy has increased considerably. In the case of Qatar it has increased from 61 years in 1960 to 78 (close to the Channel Islands figure) in 2013. For Bhutan the rise has been more pronounced, since LEB was only 32 years in 1960 (less than that of Niger in 1960), but is now 68 years.\n\nFunctional archetypoids are representative  of extreme patterns. The interest lies in seeing how the patterns of other countries are expressed in terms of those archetypoids, as a mixture. For that reason, $\\bf \\alpha$ is computed and represented in the following maps. Each map in Figs. \\ref{map51}, \\ref{map52}, \\ref{map53}, \\ref{map54}, \\ref{map55} shows the share with the respective functional archetypoid for each country, i.e., it basically shows how well the indicators for each country  are explained by the corresponding functional archetypoid.\n These maps are called abundance maps in the hyperspectral imaging field. The contributions go from 0 to 1. In Figs. \\ref{map51}, \\ref{map52}, \\ref{map53}, \\ref{map54}, \\ref{map55} these contributions are gradually divided into 10 categories with equally-spaced breaks. The darker the color, the greater the value $\\alpha_{ij}$ is, for country $j$ in the functional archetypoid $i$, according to the heat color palette (light yellow indicates low values, whereas red indicates high values). Territories with no information are displayed in green.\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=1\\textwidth]{al1.eps}\n\\end{tabular}\n\\caption{Visualization of the ${\\bf \\alpha}$\n coefficients using abundance maps for archetypoid function 1 of the 5 bivariate (TFR and LEB) archetypoid functions.\\label{map51}}\n\\end{figure}\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=1\\textwidth]{al2.eps}\n\\end{tabular}\n\\caption{Visualization of the ${\\bf \\alpha}$\n coefficients using abundance maps for archetypoid function 2 of the 5 bivariate (TFR and LEB) archetypoid functions.\\label{map52}}\n\\end{figure}\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=1\\textwidth]{al3.eps}\n\\end{tabular}\n\\caption{Visualization of the ${\\bf \\alpha}$\n coefficients using abundance maps for archetypoid function 3 of the 5 bivariate (TFR and LEB) archetypoid functions.\\label{map53}}\n\\end{figure}\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=1\\textwidth]{al4.eps}\n\\end{tabular}\n\\caption{Visualization of the ${\\bf \\alpha}$\n coefficients using abundance maps for archetypoid function 4 of the 5 bivariate (TFR and LEB) archetypoid functions.\\label{map54}}\n\\end{figure}\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=1\\textwidth]{al5.eps}\n\\end{tabular}\n\\caption{Visualization of the ${\\bf \\alpha}$\n coefficients using abundance maps for archetypoid function 5 of the 5 bivariate (TFR and LEB) archetypoid functions.\\label{map55}}\n\\end{figure}\n\n\n\n\n\n\nAccording to the maps, we can make the following observations. The countries with indicator curves similar to Lesotho are their neighboring countries, which are the countries most affected by HIV/AIDS. The countries whose indicator functions coincide with those of the Channel Islands are Japan, Australia, North America and most European countries, and to a lesser extent, countries such as Russia and Argentina. With respect to Niger, countries which mainly share  their indicator functions are those in Central Africa and Afghanistan. Countries with a similar behavior to Qatar as regards those indicators are the majority of countries in the Arabian peninsula and neighboring countries, many countries in Central America and several in South America, several in Asia and countries in  North Africa. Although, those North African countries also share characteristics with Bhutan. They are a mixture of these two extreme countries with regard to the evolution of those indicators. Other countries are also a mixture of two or three profiles, indicating that they share some of the characteristics of the series. For example, for Turkey the indicators are explained as a mixture between 30\\% the Channel Islands, 20\\% Qatar and 50\\% Bhutan.\n\n\n\nAlthough archetypoids are not necessarily nested, in this problem when the number of functional archetypoids has been increased, the patterns discovered with smaller $k$ has been kept, and increasing $k$ has led to the discovery of new finer patterns. In other words, although sometimes the archetypoid name is not maintained, and other countries with similar profiles are chosen by the algorithm, the results are nested in this problem.\nTable \\ref{arkmayor} provides the names of bivariate functional archetypoids for different $k$ values (if different solutions are obtained from the three initial candidates, the one with the lowest RSS is chosen). Countries with similar TFR and LEB series appear in the same row.\n\n\n \n  \n \n  \n\n\n\n\n\n\n\n \n\n\n\\begin{table}[h]\n  \\centering\n  \\caption{Functional archetypoids for different $k$ values. $A_j$ denotes the archetypoid number $j$.\n \\label{arkmayor}}\n \\begin{scriptsize}\n  \\begin{tabular}{lcccccc}\\hline\n$k$ = & 5 & 6 & 7 & 8 & 9 & 10\\\\\\hline\n$A_1$ & Lesotho & Botswana& Botswana & Botswana & Botswana &Botswana\\\\\n$A_2$& Channel Islands & Channel Islands& Sweden &  Switzerland  &  Switzerland  & Switzerland \\\\\n$A_3$& Niger & Angola & Angola& Niger  & Niger  &Niger \\\\\n$A_4$& Qatar & Jordan & Jordan & Qatar & Qatar & Qatar\\\\\n$A_5$& Bhutan & Bhutan & Bhutan & Maldives & Oman & Oman \\\\\n$A_6$ & & Hong Kong & Hong Kong & Korea, Rep. & Korea, Rep. & Korea, Rep.\\\\\n$A_7$ & & & Russian Federation & Ukraine & Ukraine & Ukraine\\\\\n$A_8$ & & & & Sierra Leone & Sierra Leone &Sierra Leone \\\\\n$A_9$ & & & & &Cambodia &Cambodia \\\\\n$A_{10}$ & & & & & &Rwanda \\\\\n\\hline\n  \\end{tabular}\n   \\end{scriptsize}\n\\end{table}\n\n\n\n\nFor $k$ = 6, the new pattern incorporated is that corresponding to countries such as Hong Kong SAR, China. Its TFR has fallen dramatically from 5 in 1960 to even less than 1 or around 1 in recent years (a TFR smaller than that of the Channel Islands). On the other hand, its LEB increased from 67 in 1960 to nearly 84 years in 2013 (a higher LEB  than that of the Channel Islands).\nFor $k$ = 7, the Russia Federation is included, whose TFR profile  was similar to that of other European countries, although with some key differences. In 1960  TFR in Russia was 2.5 and decreased until 1999, when it was 1.17; it then began to increase until now, and it currently has a TFR of 1.7 (remember that the USSR was dissolved in 1991, with an economic crisis in the 1990s). However, LEB is quite different from most western Europe countries. LEB was 66 years in 1960 and is now 71. Not only  has it not increased very much, but it was below 65 years in 1993 and 1994. With $k$ = 8, 9 and 10, three specific profiles are revealed due to the particularities of these countries, which suffered bloody conflicts that obviously decreased their TFR and LEB very considerably for a time, although at different times: Sierra Leone, Cambodia and Rwanda. In Cambodia the LEB was below 20 years in 1977, and was 26.7 years in Rwanda in 1993.\n\nSolutions are also obtained without considering these three countries, but no very revealing new patterns appear. The same profiles are obtained until $k$ =7, and for $k$ = 8 the new profile that appears is that corresponding to the Central African Republic. This country had a high $\\alpha_{ij}$ corresponding to the Sierra Leone archetypoid, both of which share similar features.\n\n\n\n\n\n\\section{Conclusions}\n\\label{conclusiones}\nThis paper introduces functional archetype and archetypoid analysis. These techniques can facilitate the understanding of functional data, in the same way that it does with multivariate data. Computational methods are proposed of performing these analyses  based on the coefficients of a basis, and they are compared with other alternatives in a simulation study. Unlike the previous attempt to compute FAA made by \\cite{Constatini2012}, which was only valid for an orthogonal basis, the proposed methodology can be used for any basis. It is computationally less demanding than the naive approach of discretizing the functions. Multivariate FAA and FADA are also introduced.\n\nBivariate FADA has been applied to an interesting problem: the study of human development around the world over the last 50 years. The information contained in two series, TFR and LEB, for each of 190 countries has been shown in maps. These maps  can be easily understood  even by non-experts. The use of FAA and FADA can be an interesting tool for making data easier to interpret, since they are based on the principle of opposites which accommodates human cognition.\nWith these maps, human development behavior over the last 50 years has been clearly revealed. Figures speak by themselves and tell the story of what has happened in the world in these last 50 years. Firstly, we see the evolution of TFR and LEB. In \\citep{RoslingTED}, Rosling explained that ``Swedish top students knew statistically significantly less about the world than chimpanzees''. They thought that nowadays the world was divided into the western world and the third world, i.e.,  small family and long life for the western world and large families with short lives for the third world. However, we have seen that now almost all countries are within the same range (although with a different evolution of curves) with the exception of a few countries. With the maps, the data themselves have also told us about the main historical events, such as a serious health crisis (the HIV pandemic in Sub-Saharan Africa), the breakup of the Soviet Union or bloody wars.\n\n\n\n\n\n\n\n\n\n\nAs regards future work, some immediate open problems to address are weighted and robust functional versions, and the definition of AA and ADA for mixed data (functional and vector parts). To work with mixed data, an appropriate interior product could be defined.\nAnother outstanding issue is to consider FAA and FADA when multivariate arguments are involved. In another vein, instead of AA or ADA, other techniques for non-negative matrix factorization could be extended to the functional case. However, applications will be the main direction of the work. In the same way that AA and ADA have only recently begun  to be used in very diverse fields, FAA and FADA have a very great potential for applications. The most immediate could be along the same lines as the application of this paper, human development. Only TFR and LEB have been considered here, but the number of indicators in the World Bank Open Data is very high (more than 5000), including different and important topics such as Climate Change, Economy, Education, etc., which are of great importance for knowing about development in countries around the globe. As in the case of AA and ADA, FDA applications are growing every day. Both fields are quite new, and therefore there is no doubt plenty of scope for combining them (FAA and FADA).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Acknowledgements}\nThis work has been partially supported by Grant DPI2013- 47279-C2-1-R. \n\n \\bibliographystyle{elsarticle-harv}\n\n\n\n\\begin{thebibliography}{45}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\n\\bibitem[{Breiman et~al.(1984)Breiman, Friedman, Olshen, and Stone}]{Breiman}\nBreiman, L., Friedman, J., Olshen, R., Stone, C., 1984. Classification and\n  Regression Trees. Wadsworth.\n\n\\bibitem[{Canhasi and Kononenko(2013)}]{Canhasi13}\nCanhasi, E., Kononenko, I., 2013. Multi-document summarization via archetypal\n  analysis of the content-graph joint model (doi: 10.1007/s10115-013-0689-8).\n  Knowledge and Information Systems, 1--22.\n\n\\bibitem[{Canhasi and Kononenko(2014)}]{Canhasi14}\nCanhasi, E., Kononenko, I., 2014. Weighted archetypal analysis of the\n  multi-element graph for query-focused multi-document summarization. Expert\n  Systems with Applications 41~(2), 535 -- 543.\n\n\\bibitem[{Chan et~al.(2003)Chan, Mitchell, and Cram}]{Chan2003}\nChan, B., Mitchell, D., Cram, L., 2003. {Archetypal analysis of galaxy\n  spectra}. Monthly Notices of the Royal Astronomical Society 338.\n\n\\bibitem[{Costantini et~al.(2012)Costantini, Porzio, Ragozini, and\n  Romo}]{Constatini2012}\nCostantini, P., Porzio, G.~C., Ragozini, G., Romo, J., 2012. Archetypal\n  functions. In: Analysis and Modeling of Complex Data in Behavioural and\n  Social Sciences. JCS \u0096 CLADAG, Anacapri, Italy, pp. 1--4.\n\n\\bibitem[{Cutler and Breiman(1994)}]{Cutler1994}\nCutler, A., Breiman, L., November 1994. {Archetypal Analysis}. Technometrics\n  36~(4), 338--347.\n\n\\bibitem[{Davis and Love(2010)}]{Davis2010}\nDavis, T., Love, B., 2010. Memory for category information is idealized through\n  contrast with competing options. Psychological Science 21~(2), 234--242.\n\n\\bibitem[{D'Esposito et~al.(2012)D'Esposito, Palumbo, and\n  Ragozini}]{Esposito2012}\nD'Esposito, M.~R., Palumbo, F., Ragozini, G., 2012. {Interval Archetypes: A New\n  Tool for Interval Data Analysis}. Statistical Analysis and Data Mining 5~(4),\n  322--335.\n\n\\bibitem[{Epifanio(2008)}]{Epifanio08}\nEpifanio, I., 2008. Shape descriptors for classification of functional data.\n  Technometrics 50~(3), 284--294.\n\n\\bibitem[{Epifanio and Ventura-Campos(2011)}]{Epifanio11}\nEpifanio, I., Ventura-Campos, N., 2011. Functional data analysis in shape\n  analysis. Computational Statistics {\\&} Data Analysis 55~(9), 2758--2773.\n\n\\bibitem[{Epifanio and Ventura-Campos(2014)}]{Epifanio14}\nEpifanio, I., Ventura-Campos, N., 2014. Hippocampal shape analysis in\n  {A}lzheimer's disease using functional data analysis. Statistics in Medicine\n  33~(5), 867--880.\n\n\\bibitem[{Epifanio et~al.(2013)Epifanio, Vinu{\\'e}, and Alemany}]{EpiVinAle}\nEpifanio, I., Vinu{\\'e}, G., Alemany, S., 2013. Archetypal analysis:\n  contributions for estimating boundary cases in multivariate accommodation\n  problem. Computers \\& Industrial Engineering 64~(3), 757--765.\n\n\\bibitem[{Eugster and Leisch(2009)}]{Eugster2009}\nEugster, M.~J., Leisch, F., April 2009. {From Spider-Man to Hero - Archetypal\n  Analysis in R}. Journal of Statistical Software 30~(8), 1--23.\n\\newline\\urlprefix\\url{http://www.jstatsoft.org/}\n\n\\bibitem[{Eugster(2012)}]{Eugster2012}\nEugster, M. J.~A., 2012. Performance profiles based on archetypal athletes.\n  International Journal of Performance Analysis in Sport 12~(1), 166--187.\n\n\\bibitem[{Ferraty and Vieu(2003)}]{Ferraty}\nFerraty, F., Vieu, P., 2003. Curves discrimination: a nonparametric functional\n  approach. Computational Statistics and Data Analysis 44, 161--173.\n\n\\bibitem[{Ferraty and Vieu(2006)}]{Ferraty06}\nFerraty, F., Vieu, P., 2006. Nonparametric Functional Data Analysis: Theory and\n  Practice. Springer.\n\n\\bibitem[{Gregorutti et~al.(2015)Gregorutti, Michel, and\n  Saint-Pierre}]{Gregorutti201515}\nGregorutti, B., Michel, B., Saint-Pierre, P., 2015. Grouped variable importance\n  with random forests and application to multiple functional data analysis.\n  Computational Statistics \\& Data Analysis 90, 15 -- 35.\n\n\\bibitem[{Jacques and Preda(2014)}]{Jacques201492}\nJacques, J., Preda, C., 2014. Model-based clustering for multivariate\n  functional data. Computational Statistics \\& Data Analysis 71, 92 -- 106.\n\n\\bibitem[{Jones and Rice(1992)}]{JonesRice}\nJones, M.~C., Rice, J.~A., 1992. Displaying the important features of large\n  collections of similar curves. The American Statistician 46~(2), 140--145.\n\n\\bibitem[{Kaufman and Rousseeuw(1990)}]{Kaufman90}\nKaufman, L., Rousseeuw, P.~J., 1990. Finding Groups in Data: An Introduction to\n  Cluster Analysis. John Wiley, New York.\n\n\\bibitem[{Lawson and Hanson(1974)}]{Lawson74}\nLawson, C.~L., Hanson, R.~J., 1974. Solving Least Squares Problems. Prentice\n  Hall.\n\n\\bibitem[{Li et~al.(2003)Li, Wang, Louviere, and Carson}]{Li2003}\nLi, S., Wang, P., Louviere, J., Carson, R., December 2003. {Archetypal\n  Analysis: A New Way To Segment Markets Based On Extreme Individuals}. In:\n  ANZMAC 2003 Conference Proceedings. pp. 1674--1679.\n\n\\bibitem[{Midgley and Venaik(2013)}]{Midgley2013}\nMidgley, D., Venaik, S., 2013. Marketing strategy in {MNC} subsidiaries: pure\n  versus hybrid archetypes. In: P. McDougall-Covin and T. Kiyak, Proceedings of\n  the 55th Annual Meeting of the Academy of International Business. pp.\n  215--216.\n\n\\bibitem[{M{\\o}rup and Hansen(2012)}]{Morup2012}\nM{\\o}rup, M., Hansen, L.~K., 2012. Archetypal analysis for machine learning and\n  data mining. Neurocomputing 80, 54--63.\n\n\\bibitem[{Porzio et~al.(2008)Porzio, Ragozini, and Vistocco}]{Porzio2008}\nPorzio, G.~C., Ragozini, G., Vistocco, D., 2008. {On the use of archetypes as\n  benchmarks}. Applied Stochastic Models in Business and Industry 24, 419--437.\n\n\\bibitem[{{R Development Core Team}(2015)}]{R}\n{R Development Core Team}, 2015. R: A Language and Environment for Statistical\n  Computing. R Foundation for Statistical Computing, Vienna, Austria, {ISBN}\n  3-900051-07-0.\n\\newline\\urlprefix\\url{http://www.R-project.org}\n\n\\bibitem[{Rak{\\^e}t and Markussen(2014)}]{Raket2014227}\nRak{\\^e}t, L.~L., Markussen, B., 2014. Approximate inference for spatial\n  functional data on massively parallel processors. Computational Statistics \\&\n  Data Analysis 72, 227 -- 240.\n\n\\bibitem[{Ramsay et~al.(2009)Ramsay, Hooker, and Graves}]{Ramsay09}\nRamsay, J.~O., Hooker, G., Graves, S., 2009. Functional Data Analysis with R\n  and MATLAB. Springer.\n\n\\bibitem[{Ramsay and Silverman(2002)}]{Ramsay02}\nRamsay, J.~O., Silverman, B.~W., 2002. Applied Functional Data Analysis.\n  Springer.\n\n\\bibitem[{Ramsay and Silverman(2005)}]{Ramsay05}\nRamsay, J.~O., Silverman, B.~W., 2005. Functional Data Analysis, 2nd Edition.\n  Springer.\n\n\\bibitem[{Ramsay et~al.(2014)Ramsay, Wickham, Graves, and Hooker}]{fda}\nRamsay, J.~O., Wickham, H., Graves, S., Hooker, G., 2014. fda: Functional Data\n  Analysis. R package version 2.4.4.\n\\newline\\urlprefix\\url{http://CRAN.R-project.org/package=fda}\n\n\\bibitem[{Richards et~al.(2012)Richards, Lee, Schafer, and\n  Freeman}]{Richards2012}\nRichards, J., Lee, A., Schafer, C., Freeman, P., 2012. Prototype selection for\n  parameters in complex models. The Annals of Applied Statistics 6~(1),\n  383--408.\n\n\\bibitem[{Rosling(2006)}]{RoslingTED}\nRosling, H., 2006. The best stats you've ever seen. In:\n  https://www.ted.com/talks/hans{\\_}rosling{\\_}shows{\\_}the{\\_}best{\\_}stat{s}\n{\\_}you{\\_}ve{\\_}ever{\\_}seen.\n\n\\bibitem[{Rossi and Conan-Guez(2005)}]{RossiConan05}\nRossi, F., Conan-Guez, B., January 2005. Functional multi-layer perceptron: a\n  nonlinear tool for functional data analysis. Neural Networks 18~(1), 45--60.\n\n\\bibitem[{Sangalli et~al.(2009)Sangalli, Secchi, Vantini, and\n  Veneziani}]{Sangalli09}\nSangalli, L.~M., Secchi, P., Vantini, S., Veneziani, A., 2009. A case study in\n  exploratory functional data analysis: Geometrical features of the internal\n  carotid artery. Journal of the American Statistical Association 104~(485),\n  37--48.\n\n\\bibitem[{Seiler and Wohlrabe(2013)}]{Seiler2013}\nSeiler, C., Wohlrabe, K., 2013. {Archetypal scientists}. Journal of\n  Informetrics 7~(2), 345--356.\n\n\\bibitem[{Stone(2002)}]{Stone2002}\nStone, E., 2002. Exploring archetypal dynamics of pattern formation in cellular\n  flames. Physica D 161, 163--186.\n\n\\bibitem[{{The World Bank}(2015)}]{wbdata}\n{The World Bank}, 2015. Data from database: World development indicators.\n  http://data.worldbank.org/.\n\n\\bibitem[{Theodosiou et~al.(2013)Theodosiou, Kazanidis, Valsamidis, and\n  Kontogiannis}]{Theodosiou}\nTheodosiou, T., Kazanidis, I., Valsamidis, S., Kontogiannis, S., 2013.\n  Courseware usage archetyping. In: Proceedings of the 17th Panhellenic\n  Conference on Informatics. PCI '13. ACM, New York, NY, USA, pp. 243--249.\n\n\\bibitem[{Th{\\o}gersen et~al.(2013)Th{\\o}gersen, M{\\o}rup, Damki{\\ae}r, Molin,\n  and Jelsbak}]{Morup2013}\nTh{\\o}gersen, J.~C., M{\\o}rup, M., Damki{\\ae}r, S., Molin, S., Jelsbak, L.,\n  2013. Archetypal analysis of diverse pseudomonas aeruginosa transcriptomes\n  reveals adaptation in cystic fibrosis airways. BMC Bioinformatics 14, 279.\n\n\\bibitem[{Thurau et~al.(2012)Thurau, Kersting, Wahabzada, and\n  Bauckhage}]{Thurau12}\nThurau, C., Kersting, K., Wahabzada, M., Bauckhage, C., 2012. Descriptive\n  matrix factorization for sustainability adopting the principle of opposites.\n  Data Mining and Knowledge Discovery 24~(2), 325--354.\n\n\\bibitem[{{United Nations}(2015)}]{onu}\n{United Nations}, 2015. Millennium development goals.\n  http://www.un.org/millenniumgoals/.\n\n\\bibitem[{Usset et~al.(2016)Usset, Staicu, and Maity}]{Usset2015}\nUsset, J., Staicu, A.-M., Maity, A., 2016. Interaction models for functional\n  regression. Computational Statistics \\& Data Analysis 94, 317\u0096--329.\n\n\\bibitem[{Vinu{\\'e} et~al.(2015{\\natexlab{a}})Vinu{\\'e}, Epifanio, and\n  Alemany}]{Vinue15}\nVinu{\\'e}, G., Epifanio, I., Alemany, S., 2015{\\natexlab{a}}. Archetypoids: A\n  new approach to define representative archetypal data. Computational\n  Statistics \\& Data Analysis 87, 102 -- 115.\n\n\\bibitem[{Vinu{\\'e} et~al.(2015{\\natexlab{b}})Vinu{\\'e}, Epifanio, Sim{\\'o},\n  {Ib\\'{a}\\~nez}, Domingo, and Ayala}]{VinueR}\nVinu{\\'e}, G., Epifanio, I., Sim{\\'o}, A., {Ib\\'{a}\\~nez}, M., Domingo, J.,\n  Ayala, G., 2015{\\natexlab{b}}. Anthropometry: An R Package for Analysis of\n  Anthropometric Data. R package version 1.5.\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 22609, "prevtext": "\nwhere $\\bold{a'}_i$ = $\\bold{b'}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} \\bold{b'}_l$ and $\\bold{W}$ is the order $m$ symmetric matrix with elements $w_{m_1,m_2}$ = $\\int B_{m_1}B_{m_2}$, i.e.  the matrix containing the inner products of the pairs of basis functions. In the case of an orthonormal basis such as Fourier, $\\bold{W}$ is the order $m$ identity matrix, and\nFAA (FADA, respectively) is reduced to AA (ADA, respectively) of the basis coefficients. But, in other cases, we may have to resort to numerical integration to evaluate $\\bold{W}$, but once $\\bold{W}$ is computed, no more numerical integrations are necessary.\n\nAs we can see, the first attempt to define FAA made by \\cite{Constatini2012} is only valid if the basis is orthonormal, but not otherwise.\n\nTo illustrate the concepts, a database heavily analyzed in FDA that appeared in \\cite{Ramsay05} to illustrate FPCA is used, so that readers who are interested can appreciate the differences in the analysis. The  mean monthly temperatures for 35 Canadian weather stations averaged over 1960 to 1994 are considered. As in \\cite{Ramsay05}, the data are approximated with a 12-term Fourier series. \nAs there are four climate zones, four archetypes and archetypoids are chosen. Fig. \\ref{canada} shows the solution of FAA and FADA (the same archetypoids are obtained from the three initial candidates). The FADA solution corresponds to the following weather station (each of them belongs to a different climate zone): Montreal (Atlantic), Resolute (Arctic), Dawson (Continental) and Victoria (Pacific), in black, red, green and blue, respectively. If we bring to mind a map of Canada, these stations are located near the borders (extreme zones) of the country.\n\n\n\n\n\n\\subsection{Multivariate FAA and FADA}\nWe often wish to study more than one function at the same time. For the shake of clarity, the extension of FAA and FADA to deal\nwith bivariate functional data is discussed. The key is to define an inner product between bivariate\nfunctions, which is computed simply as the sum of the inner products of the two components.\nTherefore, the squared norm of a bivariate function is simply\nthe sum of the squared norms of the two component functions.  What all this amounts to is that FAA or FADA for $M$ multivariate functions is equivalent to $M$ independent FAA or FADA, respectively, with shared parameters $\\bold{\\alpha}$ and $\\bold{\\beta}$. In practice, a composite function is formed by\n stringing the $M$ functions\ntogether.\n\n\n\n\nLet $f_i(t)$ = $(x_i(t), y_i(t))$ be a bivariate function. Its squared  norm  is $\\|f_i\\|^2= \\int_a^b x_i(t)^2 dt + \\int_a^b y_i(t)^2 dt$. To compute FAA and FADA, let us consider $\\bold{b^x_i}$ and  $\\bold{b^y_i}$, which are the vectors of length $m$ of the coefficients for $x_i$ and $y_i$ respectively for the basis functions $B_h$. Therefore,\n\n\n\n\\begin{figure}[H]\n\\centering\n\\begin{tabular}{c}\n\\includegraphics[width=.8\\textwidth]{canadian.eps}\n\\end{tabular}\n\\caption{Four functional archetypes (solid lines) and archetypoids (dashed lines) for Canadian weather stations.\\label{canada}}\n\\end{figure}\n\n\n\n", "index": 7, "text": "\\begin{equation}\\label{RSSfarb}\n\\begin{split}\n\n RSS = \\displaystyle \\sum_{i=1}^n \\| {f}_i - \\sum_{j=1}^k \\alpha_{ij} {z}_j\\|^2 = \\sum_{i=1}^n \\| {f}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} {f}_l\\|^2 = \\\\\n \\sum_{i=1}^n \\| {x}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} {x}_l\\|^2 + \\sum_{i=1}^n \\| {y}_i - \\sum_{j=1}^k \\alpha_{ij} \\sum_{l=1}^n \\beta_{jl} {y}_l\\|^2 = \\\\ \\sum_{i=1}^n \\bold{a^x}_i' \\bold{W} \\bold{a^x}_i + \\sum_{i=1}^n \\bold{a^y}_i' \\bold{W} \\bold{a^y}_i\n {,}\n\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\par&#10; RSS=\\displaystyle\\sum_{i=1}^{n}\\|{f}_{i}-\\sum_%&#10;{j=1}^{k}\\alpha_{ij}{z}_{j}\\|^{2}=\\sum_{i=1}^{n}\\|{f}_{i}-\\sum_{j=1}^{k}\\alpha%&#10;_{ij}\\sum_{l=1}^{n}\\beta_{jl}{f}_{l}\\|^{2}=\\\\&#10;\\displaystyle\\sum_{i=1}^{n}\\|{x}_{i}-\\sum_{j=1}^{k}\\alpha_{ij}\\sum_{l=1}^{n}%&#10;\\beta_{jl}{x}_{l}\\|^{2}+\\sum_{i=1}^{n}\\|{y}_{i}-\\sum_{j=1}^{k}\\alpha_{ij}\\sum_%&#10;{l=1}^{n}\\beta_{jl}{y}_{l}\\|^{2}=\\\\&#10;\\displaystyle\\sum_{i=1}^{n}\\mathbb{a^{x}}_{i}^{\\prime}\\mathbb{W}\\mathbb{a^{x}}%&#10;_{i}+\\sum_{i=1}^{n}\\mathbb{a^{y}}_{i}^{\\prime}\\mathbb{W}\\mathbb{a^{y}}_{i}{,}%&#10;\\par&#10;\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>S</mi></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>z</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>f</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>x</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><msup><mrow><mo>∥</mo><mrow><msub><mi>y</mi><mi>i</mi></msub><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>k</mi></munderover><mrow><msub><mi>α</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>j</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>y</mi><mi>l</mi></msub></mrow></mrow></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><mmultiscripts><mi>𝕒</mi><none/><mi>𝕩</mi><mi>i</mi><mo>′</mo></mmultiscripts><mo>⁢</mo><mi>𝕎</mi><mo>⁢</mo><mmultiscripts><mi>𝕒</mi><none/><mi>𝕩</mi><mi>i</mi><none/></mmultiscripts></mrow></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><mmultiscripts><mi>𝕒</mi><none/><mi>𝕪</mi><mi>i</mi><mo>′</mo></mmultiscripts><mo>⁢</mo><mi>𝕎</mi><mo>⁢</mo><mmultiscripts><mi>𝕒</mi><none/><mi>𝕪</mi><mi>i</mi><none/></mmultiscripts></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}]