[{"file": "1601.07112.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 39950, "prevtext": "\n\n\\title{\\boldmath Science with the space-based interferometer eLISA.\\\\III: Probing the expansion of the Universe using gravitational wave standard sirens} \n\n\\author[a]{Nicola Tamanini}\n\\affiliation[a]{Institut de Physique Th\\'eorique, CEA-Saclay, CNRS UMR 3681, Universit\\'e Paris-Saclay, F-91191 Gif-sur-Yvette, France}\n\\emailAdd{nicola.tamanini@cea.fr}\n\n\\author[a]{Chiara Caprini}\n\\emailAdd{chiara.caprini@cea.fr}\n\n\\author[b,c]{Enrico Barausse}\n\\affiliation[b]{Sorbonne Universit\\'es, UPMC Univesit\\'e Paris 6, UMR 7095, Institut d'Astrophysique de Paris, 98 bis Bd Arago, 75014 Paris, France}\n\\affiliation[c]{CNRS, UMR 7095, Institut d'Astrophysique de Paris, 98 bis Bd Arago, 75014 Paris, France}\n\\emailAdd{barausse@iap.fr}\n\n\\author[d]{Alberto Sesana}\n\\affiliation[d]{School of Physics and Astronomy, The University of Birmingham, \nEdgbaston, Birmingham B15 2TT, UK}\n\\emailAdd{asesana@star.sr.bham.ac.uk}\n\n\\author[e]{Antoine Klein}\n\\affiliation[e]{Department of Physics and Astronomy, The University of Mississippi, University, MS 38677, USA}\n\\emailAdd{aklein@physics.montana.edu}\n\n\\author[f]{Antoine Petiteau}\n\\affiliation[f]{APC, Universit\\'e Paris Diderot, Observatoire de Paris, Sorbonne Paris Cit\\'e, 10 rue Alice Domon et L\\'eonie Duquet, 75205 Paris Cedex 13, France}\n\\emailAdd{antoine.petiteau@apc.univ-paris7.fr}\n\n\\date{\\today}\n\n\\abstract{\nWe investigate the capability of various configurations of the space interferometer eLISA to probe the late-time background expansion of the universe using gravitational wave standard sirens.\nWe simulate catalogues of standard sirens composed by massive black hole binaries whose gravitational radiation is detectable by eLISA, and which are likely to produce an electromagnetic counterpart observable by future surveys.\nThe main issue for the identification of a counterpart resides in the capability of obtaining an accurate enough sky localisation with eLISA.\nThis seriously challenges the capability of four-link (2 arm) configurations to successfully constrain the cosmological parameters.\nConversely, six-link (3 arm) configurations have the potential to provide a test of the expansion of the universe up to $z\\sim 8$ which is complementary to other cosmological probes based on electromagnetic observations only.\nIn particular, in the most favourable scenarios, they can provide a significant constraint on $H_0$ at the level of 0.5\\%.\nFurthermore, $(\\Omega_M, \\Omega_\\Lambda)$ can be constrained to a level competitive with present SNIa results.\nOn the other hand, the lack of massive black hole binary standard sirens at low redshift allows to constrain dark energy only at the level of few percent.\n}\n\n\\maketitle\n\n\\section{Introduction}\n\nGravitational waves (GWs) are potentially a very powerful probe of the universe: they can bring information from a wide variety of phenomena, ranging from stellar processes to the collision of galaxies and the formation of structures, up to the very early stages of the evolution of the universe. Several frequency windows of gravitational radiation are now being targeted by different detectors. Present and near-future ground-based interferometers target the frequency window $10-1000$ Hz: the network of second-generation detectors includes the two advanced LIGO interferometers in the United States \\cite{ligo} and the advanced VIRGO interferometer in Italy \\cite{virgo}, and will be joined in the future by KAGRA \\cite{kagra} in Japan and LIGO India \\cite{indigo}. With the third-generation ground-based interferometer Einstein Telescope \\cite{ET}, it will be possible to reach frequencies of the order of $1$ Hz, since going underground helps to partially overcome the seismic noise. On the other hand, timing of ultra-stable millisecond pulsars and mapping of the Cosmic Microwave Background (CMB) can probe much lower frequencies. Three Pulsar Timing Arrays are currently in operation -- the EPTA in Europe \\cite{epta},  NANOGrav in the US \\cite{nanograv} and PPTA in Australia \\cite{ppta} -- sharing data under the aegis of the International Pulsar Timing Array (IPTA) \\cite{2010CQGra..27h4013H}: they monitor the frequency window $10^{-8}$ to $10^{-9}$ Hz and have already placed interesting bounds on the stochastic GW background produced by  massive black-hole binaries (MBHBs)  \\cite{2010CQGra..27h4013H,Shannon:2015ect}. The B-mode polarisation of the CMB gives access to the very low frequency band $10^{-18}-10^{-16}$ Hz \\cite{Ade:2015tva}, targeting the GW background sourced during inflation, or similar scenarios where GWs are generated (non-causally) outside the horizon at recombination. \n\nThe advantage of a space-based GW interferometer resides in its capability to \nreach high sensitivity in the intermediate frequency band below  $1$ Hz. This \nfrequency band is unexplored so far, and very rich with both astrophysical and \ncosmological sources (for a summary, see \\cite{Seoane:2013qna,Binetruy:2012ze}). \nIn particular, the main target is the GW signal from MBHBs with high signal to \nnoise ratio (SNR) and up to high redshift. The Laser Interferometer Space \nAntenna (LISA) program has been pursuing the goal of detecting GWs in the \n$10^{-4}-0.1$ Hz band for many years as a joint venture between the European \nSpace Agency (ESA) and the United States' National Aeronautics and Space \nAdministration (NASA). In 2013, ESA has approved a GW observer in space as the \nL3 mission for launch in 2034, for which the ``evolved LISA'' (eLISA) \nspace-based interferometer is the main candidate \\cite{elisaweb}. For this \nreason, a design study is currently in progress within ESA to define the best \neLISA configuration from the point of view of science return and costs. \n\nSome characteristics of the eLISA configuration that are still \nundecided are the low-frequency noise level, soon to be tested by LISA \nPathfinder \\cite{pathfinderweb}, the number of laser links (four or six), the \nlength of the interferometer arm (between one and five million km), and the \nduration of the mission (between two and five years). In the context of the \ndesign study, the scientific potential of each possible eLISA configuration \nobtained by varying these characteristics is under analysis. The present work is \npart of a series of papers that analyse the impact of these four key design \nchoices on the scientific performance of eLISA. {\\it Here, we address \nspecifically the scientific goal of probing the expansion of the universe \nusing MBHB GW sources as standard sirens}. The first paper of this series \n\\cite{PaperI} has dealt with the cosmological evolution of MBHBs. We will refer \nto this as Paper~I in the following. The second paper \\cite{Caprini:2015zlo} has \nanalysed the GW stochastic background from phase transitions occurring in the \nearly universe.  \n\nThe GWs emitted by a compact binary directly encode the luminosity distance of \nthe system. An additional measurement of the redshift would then permit probing \nthe distance-redshift relation. Binary systems emitting GWs can therefore \nconstitute a very valuable tool for cosmology. Indeed, they can be thought of as \n``standard sirens'', i.e.~the gravitational analogue of standard candles such as \ntype Ia supernovae (SNIa), as first pointed out in \\cite{schutz} (see \nalso e.g.~\\cite{Holz:2005df,Cutler:2009qv}). One advantage of standard sirens \nover SNIa is that they allow for a direct measurement of the luminosity distance \nup to large redshift, unlike optical measurements, which require \ncross-calibrations of successive distance indicators at different scales. For \nthis reason, they can be used in conjunction with optical observations to \ndirectly measure the Hubble constant, which \ncannot be obtained by SNIa observations, which are calibrated in the local Hubble flow \\cite{Weinberg:2012es}. Furthermore, the luminosity of a GW source is mostly determined by \ngravitational physics (in fact, for binaries of black holes the GW luminosity depends \\textit{only} on gravitational physics). As a result, GW sources present \nessentially no luminosity scatter, unlike SNIa.\nStill, MBHBs have the big disadvantage that they cannot probe the distance-redshift relation by themselves.\nIndeed, exactly because MBHB waveforms only depend on gravitational physics -- i.e.~on General Relativity, which has no built-in length-scale -- the two masses $m_{1,2}$ and the redshift $z$ enter\nthe waveforms only through the redshifted masses $m_{z 1,2}=(1+z) m_{1,2}$. Therefore, the redshift needs to be measured independently, e.g.~by optically identifying the host galaxy. This limits the capability of standard sirens to probe cosmology, as we will see in the following.  \n\nThe aim of the present analysis is to forecast the potential of several proposed eLISA configurations to measure the distance-redshift relation, \nin combination with independent redshift measurements by future optical telescopes (here, we will consider the Large Synoptic Survey Telescope (LSST) \\cite{LSSTweb} and the Extremely Large Telescope (ELT) \\cite{EELTweb}),\naided for the source localisation by future radio telescopes such as the Square Kilometre Array (SKA)~\\cite{SKAweb}. We analyse twelve configurations, listed in the first column of Table~\\ref{tab:ss} at the end of the paper: six with four laser links (L4), and six with six laser links (L6). For each configuration, the length of the arm is chosen to be one, two or five million km (A1, A2, A5), and we set the low-frequency noise level to either the LISA Pathfinder expected one (N2), or the LISA Pathfinder required one, which is ten times worse (N1). These possibilities correspond to those under investigation by ESA, except the mission duration, which we have decided to fix to five years (M5). \n\nFirst of all, one needs to model realistically the expected sources for each of the above mentioned configurations. As a starting point, following Paper~I, we use the results of semi-analytical simulations of the evolution of the BH masses and spins during the hierarchical galaxy formation and evolution~\\cite{mymodel,spin_model,letter,newpaper}. This allows one to predict the rate and redshift distribution of MBHB merger events. We produce several variants of our semi-analytical model by\nconsidering competing scenarios for the initial conditions for the massive BH population at high redshift --\n namely, a ``light-seed'' scenario in which the first massive BHs form from the \nremnants of population III (popIII) stars~\\cite{MadauRees2001,volonteri_haardt_madau},\nand a ``heavy-seed'' one where massive BHs form from the collapse of\nprotogalactic disks~\\cite{2004MNRAS.354..292K,2006MNRAS.370..289B,\n  2006MNRAS.371.1813L,2008MNRAS.383.1079V} --\nand for the delays with which massive BHs merge after their host galaxies \ncoalesce~\\cite{newpaper}. \nFor each variant of our model, our simulations \nallow us to produce synthetic catalogues of MBHB merger events, including all \ninformation about the MBHBs (masses, spins, redshift, etc.) and their host \ngalaxies (mass in gas, mass in stars, etc.). In order to have enough statistics, especially at low redshift,\nwe produce 118 catalogues for each BH formation model and each eLISA configuration (see sections~\\ref{sec:BHbinaries} and \\ref{sec:statistic} for more details).\n\nThe parameters of the  MBHB systems of each catalogue are then inserted as input \ninto a code that simulates the GW signal induced in the detector by the \nbinaries' inspirals (cf.~section \\ref{sec:detection}). For every one of the \ntwelve eLISA configurations that we consider, \nthe code computes the SNR of each merger event and the Fisher matrix of the \ncorresponding waveform parameters. In particular, since we are to use the \nsources as standard sirens, we are most interested in the $1\\sigma$ error on the \nluminosity distance $\\Delta d_L$, and on the sky location $\\Delta \\Omega$. Among \nthe MBHB merger events, we select those that have ${\\rm SNR}>8$ and $\\Delta \n\\Omega <10\\,{\\rm deg}^2$. This guarantees that the events are measured with a \nsky location error sufficiently small to allow one to detect a counterpart, if \nit is present. We choose 10 ${\\rm deg}^2$ because it corresponds to the field of \nview of the LSST survey \\cite{LSSTweb}. \n\nThe following step is to select, among these events, those that are likely to provide a detectable optical counterpart (for the redshift determination). We consider a two-case scenario. On the one hand, the optical emission from the counterpart may be bright enough to be directly detectable by an optical survey such as LSST. In this case, we have a direct determination of the GW source redshift. On the other hand, the counterpart may take the form of a radio jet or flare. In this case, the counterpart may first be detected in the radio band by the SKA \\cite{SKAweb}. When the counterpart has been localised in the radio, the host galaxy can be identified and its redshift estimated either spectroscopically or photometrically (depending on the galaxy's luminosity) using an optical telescope such as the ELT \\cite{EELTweb} (or possibly the James Webb Space Telescope, JWST \\cite{JWSTweb}). \n\nSeveral authors (see, e.g.,~\\cite{2002ApJ...567L...9A,2010Sci...329..927P}) suggested that optical/radio emission is likely to happen at merger in a transient fashion (see however \\cite{2014PhRvD..90j4030G,2015MNRAS.447L..80F} for models in which the electromagnetic emission can take place also continuously during the inspiral phase). The most conservative procedure would therefore be to select the events with ${\\rm SNR}>8$ and $\\Delta \\Omega <10\\,{\\rm deg}^2$ on the basis of the eLISA detection and parameter estimation {\\it during the inspiral phase only}. However, {\\it adding the merger and ringdown portions of the waveforms} in the determination of the SNR and in the estimate of the sky location to be provided to the telescopes would substantially enhance the possibility of detecting the counterpart.\nIndeed, new events would be included, which would be otherwise left out when performing the ${\\rm SNR}>8$ and $\\Delta \\Omega <10\\,{\\rm deg}^2$ cuts considering the inspiral phase only. This happens in particular for the most massive binaries, or for those merging at higher redshift. \n\nWhether one can actually take advantage of the merger and ringdown in the sky localisation depends both on the latency of the eLISA analysis and on the nature of the counterpart. Ideally, by the time eLISA flies, real-time data analysis should be feasible, allowing to pin down the sky location of the MBHB as it spirals in. Therefore, on the one hand we can envisage a strategy whereby, \nif close to coalescence the sky location accuracy is better than $10\\, {\\rm \ndeg}^2$, telescopes are alerted and point in that direction, looking for a \ndistinctive flare occurring at merger. On the other hand, several more events \nmight be located in the sky with this accuracy when merger and ringdown are \nalso included in the analysis. When this is the case, telescopes can be pointed \n{\\it after} the merger to look for distinctive signatures. Whether this second \nclass of events can be used as standard sirens depends on the nature and timing \nof the counterpart. If there is a delay between the merger and the flare, or if \nthe electromagnetic signal is persistent and peculiar enough that it can be \nconfidently identified also minutes to hours after merger, then also these \nlatter events add to the standard sirens number. \n\nWe therefore consider both a  ``conservative scenario'', in which the selection of the events with ${\\rm SNR}>8$ and $\\Delta \\Omega <10\\,{\\rm deg}^2$ is performed using only the inspiral phase, and an ``optimistic scenario'', in which we include the merger and ringdown phases for the selection of these events.\nIn the latter case, we also include a de-lensing of a factor of two, since by the time eLISA flies one might be able to rely on quite accurate lensing maps (for details, see section \\ref{sec:statistic}). As we will see, in this optimistic scenario the number of useful standard sirens substantially increases (especially for the heavy-seed models), thereby greatly improving the precision with which the cosmological parameters can be measured. \n\nNote that once the optical/radio counterpart has been identified at merger, the exact sky location of the binary is known. As a consequence, the error on the luminosity distance $\\Delta d_L$ is significantly reduced by repeating the Fisher matrix analysis after the merger, when two parameters (the sky location angles) can be fixed and the merger and ringdown parts of the waveform can be added to the Fisher matrix analysis. This procedure improves the measurement of the cosmological parameters.\n\nIn summary, our catalogues of sources that can be used to investigate the distance-redshift relation are composed by MBHBs that can be detected by a given eLISA configuration \nwith ${\\rm SNR}>8$ and $\\Delta \\Omega <10\\,{\\rm deg}^2$, either with or without merger and ringdown, and whose counterpart is furthermore visible either directly in the optical by \nLSST, or in the radio by SKA (with follow-up optical observations of the host galaxy by ELT). \n\nEach MBHB is a point in the plane $(z, d_L(z))$, with a 1$\\sigma$ error on the luminosity distance $\\Delta d_L$ comprising of different components. First, the ``experimental'' error of the eLISA measurement, either with or without merger and ringdown, further reduced by the exact localisation of the source allowed by the counterpart detection. Second, we add to this ``experimental\" error those due to weak-lensing and peculiar velocities, $\\sigma_{\\rm lens}(z)$ and $\\sigma_v(z)$ \\cite{Holz:2005df,camille}. As mentioned, in the optimistic scenario (which accounts for merger and ringdown), we further reduce the weak-lensing error by a factor of two. This is to mimic the effect of a certain amount of de-lensing, which we assume will be feasible in 2034 (see discussion in section \\ref{sec:statistic}). Third, we add the error on the redshift determination as follows: if the redshift can be determined spectroscopically, we assume that the error is negligible for the purpose of our analysis; however, if the host galaxy is faint and the measurement has to be done photometrically, we propagate a non negligible redshift error on the luminosity distance error, as explained in section \\ref{sec:statistic}. An example of simulated data points with their error bars is given in Fig.~\\ref{fig:data}. \n\nEquipped with the catalogues of standard sirens, in order to assess the capability of eLISA to probe cosmology we use a Fisher matrix technique. We assume that the luminosity distance $d_L(z)$ depends on five cosmological parameters: the matter density parameter $\\Omega_M$ at $z=0$, the cosmological constant/dark energy density parameter $\\Omega_\\Lambda$ at $z=0$, the Hubble constant $H_0$ at $z=0$, the equation of state of dark energy $w_0$ at $z=0$, and its evolution rate $w_a$ (for details, see section \\ref{sec:cosmology}). For each catalogue  of simulated eLISA observations, we calculate the five-dimensional Fisher matrix for these parameters. \nFor each Fisher matrix, we calculate a Figure of Merit (FoM), as defined in section \\ref{sec:statistic}. We therefore have a distribution of FoM, from which we can extract a representative FoM, for each MBHB formation model and each eLISA configuration.  \n\nWe analyse five cosmological models. The first one is the full five-parameter \nmodel, and we find that no eLISA configuration is sensitive enough to provide \nmeaningful constraints on it (note that also other current cosmological probes, if not combined together, are unable to give interesting constraints on a five-parameter cosmological model). This is mainly because of two \nreasons: first, all the simulated catalogues are poor in low-redshift events, \nwhere the effect of the cosmological constant/dark energy is the largest. \nSecond, there are strong degeneracies among these parameters in the way they \nenter the distance-redshift relation, in particular among the triplet \n$({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,H_0)$ and the couple $(w_0,\\,w_a)$. Therefore, in the same \nspirit as in previous analyses utilising standard sirens \\cite{Zhao:2010sz}, \nSNIa \\cite{Betoule:2014frx} or BAO \\cite{Aubourg:2014yra}, we consider other \ncosmological models where some of the parameters are fixed. For instance, we fix \n$w_0=-1\\,,~w_a=0$ (pure cosmological constant) and assess the capability of the \ndifferent eLISA configurations to test the presence of a cosmological constant \nin a universe with curvature (i.e.~with ${\\Omega_{M}}+{\\Omega_\\Lambda}\\neq1$). Furthermore, we also \nfix the curvature to zero (${\\Omega_{M}}+{\\Omega_\\Lambda}=1$) and test the standard $\\Lambda$CDM \nscenario. Also, to test the presence of a dynamical dark energy (DDE) component, \nwe fix $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,H_0)$ and study the ability of several eLISA \nconfigurations to constrain $(w_0,\\,w_a)$. All the results are presented in \nsection \\ref{sec:results} for the two scenarios: conservative, without \naccounting for merger and ringdown, and optimistic, accounting for merger and \nringdown plus a de-lensing of a factor of two. \n\nThe rest of the paper is organised as follows: in section \\ref{sec2} we present \nthe different detector configurations; in section \\ref{sec:BHbinaries},\nwe present the model that we use to simulate the MBHB population and its cosmological evolution; \nin section \\ref{sec:detection}, we explain how we analyse the detectability of the GW emission from MBHBs and estimate their parameters; in section \\ref{sec:counterparts}, we present our assumptions for modelling the electromagnetic counterparts; in section \\ref{sec:cosmology}, we present the cosmological theory underpinning our study; in section \\ref{sec:statistic}, we review our statistical methods; in section \\ref{sec:results}, \nwe present our results for the projected eLISA constraints on the cosmological parameters; finally, in section \\ref{sec:FoM} we compare the performance of the different eLISA configurations. We conclude in section \\ref{sec:conclusions}.\n\n\\begin{figure}[tbp]\n\\centering\n\\includegraphics[width=.65\\textwidth]{data_example}\n\\caption{Example of data points in the distance-redshift diagram coming from MBHB standard sirens simultaneously detectable with eLISA and an electromagnetic telescope as described in the introduction (here we choose one random catalogue for N2A5M5L6 in the model ``heavy seeds no delay''). Note that the eLISA mission will be able to map the expansion of the universe in the range $z \\gtrsim 2$, which cannot be tested by SNIa or other current probes. On the other hand, few standard sirens will be available at lower redshift.}\n\\label{fig:data}\n\\end{figure}\n\n\n\\section{Detector configurations}\n\\label{sec2}\n\nAs mentioned in the introduction, following Paper~I we analyse \ntwelve detector configurations, corresponding to considering \\textit{(i)}\npossible arm lengths of $1,2,5$ Gm (A1, A2, A5 respectively);\n\\textit{(ii)} possible low frequency noise levels corresponding either\nto the LISA Pathfinder expected noise (N2) or ten times worse (N1), and \\textit{(iii)} four (L4) or six (L6) links in the satellite constellation, corresponding to a single or two (virtually) independent Michelson interferometers. In more detail,\nlaser powers are fixed to 0.7W (2W) for the A1 (A2 and A5) configurations, while\nthe telescope mirror diameter is chosen to be 25, 28 and 40 cm for A1, A2, and A5 respectively.\nAnalytic fits for the corresponding sensitivity curves are provided in Paper~I, \nand have been tested\nagainst the numerical sensitivity curves produced with the {\\rm LISACode}\nsimulator. \n\nIn addition to the instrumental noise, we also account for the astrophysical\nforeground from compact white dwarf binaries in our Galaxy. These binaries are\nexpected to be of the order of millions and to emit almost monochromatic GW signals with\nuncorrelated phases. As such, these sources produce  an\nunresolved stochastic foreground at frequencies $\\sim$ mHz, and\nonly sufficiently loud sources can be extracted singularly~\\cite{Blaut:2009si,Littenberg:2011zg,Crowder:2007ft}. A fit (based on population synthesis models~\\cite{Nelemans:2003ha}) to\nthis unresolvable stochastic foreground noise is presented in Paper~I.\n\n\n\\section{Catalogues of BH binaries}\n\\label{sec:BHbinaries}\n\nOur models for the population of MBHB are the same as those of Paper~I, which\nare in turn based on the semi-analytical galaxy formation model of \\cite{mymodel} (with later incremental improvements described in \\cite{spin_model,letter,newpaper}).\nWe refer to those papers for more details, and here we limit ourselves to\nreviewing the main features of our models.\n\nOur semi-analytical galaxy formation model allows us to track the cosmological evolution of the galactic baryonic structures (e.g.~the hot, primordial intergalactic medium;\nthe cold, chemically enriched interstellar medium -- in both its disk and bulge components; the galaxy's stellar disk and spheroid; the gas in the nuclear region; the nuclear star cluster and the\nmassive BH) along dark matter merger trees produced with an extended Press-Schechter formalism, modified to match the results of N-body simulations~\\cite{mergertree}.\nOur model accounts for a plethora of gravitational and non-gravitational interactions between these components, as represented schematically in Fig.~\\ref{fig:model}.\nTwo aspects of our model that are key to making reliable predictions for the number of massive BH mergers observable by eLISA are\nhighlighted in red boxes in Fig.~\\ref{fig:model}: the black hole seeding\nat high redshift, and the delays between the merger of two galaxies and that of the massive BHs they host. \nAlso shown in red circles are other aspects of our model that we will use in this paper to assess the presence or absence of an electromagnetic counterpart, and\nthe possibility of measuring the redshift.\n\n\nIn more detail, we assume two competing models for the high-redshift seeds from which massive BHs grow, namely a ``light-seed'' scenario, and a ``heavy-seed'' one.\nIn the former, the massive BHs are assumed to grow from \nthe remnants of population III (popIII) stars forming at\n$z\\approx 15-20$~\\cite{MadauRees2001,volonteri_haardt_madau} in the most massive, rarest dark matter halos. \nWe assume that these remnants have mass of roughly $2/3$ of that of the progenitor popIII star. The latter is drawn from a log-normal initial  mass function centred at $300 M_\\odot$ (with a r.m.s.~of 0.2 dex\nand an exclusion region\nbetween 140 and 260 $M_\\odot$,\nwhere popIII stars are subject to the electron-positron pair instability\nand thus do not form a BH as they explode as supernovae)~\\cite{2002ApJ...567..532H}.\n\nIn the latter, heavy-seed model, the massive BHs are instead assumed \nto form from the collapse (driven for instance by bar instabilities) of\nprotogalactic disks. \nThis process could produce a large influx of gas to the galactic nucleus, as a result of which\nBH seeds with masses $\\sim 10^5 M_\\odot$ might form at $z\\sim 15-20$.\nSeveral versions of this heavy-seed scenario \nhave been proposed~\\cite{2004MNRAS.354..292K,2006MNRAS.370..289B,\n  2006MNRAS.371.1813L,2008MNRAS.383.1079V}, but here we\nfollow Paper~I\nand adopt the model of~\\cite{2008MNRAS.383.1079V}.\nThis model has in particular a tuneable parameter $Q_c$ (which is the critical Toomre \nparameter regulating the onset of the bar instability of the protogalactic disks), which\nregulates the fraction of halos hosting a BH seed at high redshift, and whose plausible values are $2\\lesssim Q_c\\lesssim 3$.\n\nAs mentioned above, also crucial for predicting the number of massive BH mergers is the time (``delay'')\nat which they take place after a galaxy merger. Indeed, when two galaxies coalesce, the massive BHs do not yet\nform a bound binary, but rather interact separately with the stellar background via dynamical friction,\nas a result of which they slowly fall toward the center of the newly formed galaxy. When their relative velocity exceeds \nthe velocity dispersion of the stellar background, the two BHs form a ``bound'' (or ``hard'') binary. At this\nstage of the system's evolution, dynamical friction becomes ineffective, and the binary's evolution starts being driven by\nthree-body interactions with the stars of the galactic nucleus.\n\n\nIt is currently still unclear if these three-body interactions are enough to bring the massive BHs to merger. \nIndeed the BH binary may stall at separations much larger than those ($\\lesssim 10^{-3}$ pc)\nat which GW emission drives the system to coalescence within a Hubble time. \nThis is known as the ``final-parsec problem''~\\cite{begelman}. Recent work seems however \nto suggest that a triaxial galactic potential (arising e.g.~from a recent galaxy merger)~\\cite{yu,lastPc1,2014CQGra..31x4002V,lastPc2,2015arXiv150505480V} or galaxy rotation~\\cite{2015arXiv150506203H}\ncould enhance the effect of three-body interactions, thus causing the binary to merge in a few Gyr.\nThe presence of gas also has a strong impact on the evolution of MBHBs. Indeed,\nif sufficient gas is present in the nuclear region, planet-like migration\nmay drive the BH binary to coalescence within  $\\sim 10^7-10^8$ yr~\\cite{bence,2014SSRv..183..189C}\n(although this scenario is not immune from possible complications, see e.g.~\\cite{2009MNRAS.398.1392L}).\nFurthermore, if a BH binary stalls for too long after the galaxy merger that originally formed it, \na new galaxy merger may take place, which may bring a third massive BH to the system. Kozai resonances\nmay then trigger the merger of the two heaviest BHs (and ejection of the lightest) in $\\sim 10^8$ yr~\\cite{hoffman}, at least \nfor BH masses $\\gtrsim 10^6-10^7 M_\\odot$. Below this threshold, this\nprocess might be ineffective at causing mergers, especially if the third BH\nis much lighter than the inner binary (in which case it would be ejected before it can trigger\nthe merger of the inner binary).\n\n\\begin{figure*}[th]\n\\centering\n\\includegraphics[width=14cm,angle=0.]{model.pdf}\n\\caption{Graphical representation of the model of~\\cite{mymodel} (with the improvements described in~\\cite{spin_model,letter,newpaper}). The red boxes on the left \nhighlight the prescriptions (BH seeds and delays) for which multiple options are considered in this work. Also marked in red are the\nelements of the model that will be used to predict the presence of electromagnetic counterparts in Sec. \\ref{sec:counterparts}.\nThis figure has been adapted from Paper~I.\n\\label{fig:model}}\n\\end{figure*}\n\nA more detailed description of the implementation of these delays in our model is beyond the scope of the present paper, and we refer \nthe interested reader to~\\cite{newpaper}. In order to highlight their impact on our results, in this paper we will consider both models in which these delays\nare included, and one in which these delays are absent (i.e.~the massive BHs coalescences take place at the same time as galaxy mergers). More specifically, we\nfollow Paper~I and work with the following representative models:\n\n\\noindent {\\bf 1)~Model popIII}:\nA ``realistic'' light-seed model with delays included. As mentioned in Paper~I, \nthe corresponding light-seed model with no delays included would \npresent BH merger rates differing only by a factor $\\sim 2$.\n\n\\noindent {\\bf 2)~Model Q3d}: \nA ``realistic'' heavy-seed model with delays included. The critical\nToomre parameter is set to $Q_c=3$. As mentioned in Paper~I, choosing $Q_c=2$\nwould only decrease the BH merger rates by a a factor $\\sim 2$.\n\n\\noindent {\\bf 3)~Model Q3nod}: The same as model {Q3d}, but\nwith no delays. Paper~I showed indeed that unlike in the light-seed scenario,\nneglecting the delays dramatically increases the BH merger rates in the heavy seed\nscenario with $Q_c=3$. As such, this model is to be considered an ``optimistic''\n(upper bound) scenario for eLISA merger rates.\n\nWe utilise the set of simulations of Paper~I, which describe, for each of these three models, the \ncosmological evolution of about 1300\ngalaxies/galaxy clusters, with dark matter halo masses from $10^{10} M_\\odot$ to $10^{16} M_\\odot$\nat $z=0$.\nThese simulations are used to produce synthetic catalogues of eLISA \nobservations, i.e.~for each of the three models above we\nproduce $580$ years worth of data, \ni.e.~$118$ five-year catalogues.\n\nFinally, we note\nthat by tracking self-consistently the various baryonic\ncomponents of a galaxy  -- including the masses, spin magnitudes and orientations\nfor the massive BHs --, as well as their interactions (e.g.~feedback, accretion, etc.; cf.~Fig.~\\ref{fig:model})\n{\\it our model allows us to predict whether a BH merger takes place\nin a gas-rich or gas-poor nuclear environment, and whether it is likely to have an\nelectromagnetic counterpart or not}. More details about our prescriptions for these counterparts will\nbe presented in section~\\ref{sec:counterparts} below.\n\n\\section{eLISA detection and waveform parameter estimation}\n\\label{sec:detection}\n\n\nOur analysis of the GW signal is the same as in Paper~I, and here we only provide a brief review of our approach. \n\nThe response of the detector is modelled as in \\cite{cutler-98}, and we utilise a gravitational waveform model with generic precessing spins for the inspiral phase. This is\nthe ``shifted uniform asymptotics'' (SUA) waveform of \\cite{kcy-14}, which also includes higher-order modes besides the dominant one.\n\nThis waveform model is used both to calculate  the signal-to-noise ratio (SNR) of each MBHB in our catalogues, \nand for the parameter estimation, i.e.~to calculate, via a Fisher matrix approach, the errors on the binary's intrinsic parameters (redshifted masses $m_{1z}$ and $m_{2z}$,\nspin magnitudes $\\chi_{1}$ and $\\chi_2$, the four angles defining the spin orientations, and the luminosity distance $d_L$)\nand on the extrinsic ones (sky position, inclination, polarization angle, time \nand GW phase at coalescence).\nWhenever appropriate to account for the effect of the merger and ringdown (i.e.,\nin the optimistic scenario described in the introduction; or  after a counterpart has been identified based on the inspiral alone, in the conservative scenario)\nwe further correct the results of this analysis by using results \nobtained with aligned (or anti-aligned) spin inspiral-merger-ringdown (IMR) ``PhenomC'' \nwaveforms~\\cite{santamaria-et-al-10} and a set of dedicated precessing-spin IMR \nhybrid waveforms (cf.~the Appendix of Paper~I).\nThis correction becomes increasingly significant for heavier MBHBs. In fact, a more massive binary emits at lower frequencies, with the net result that only a small portion of the late inspiral falls within the eLISA band. In this case the largest contribution to the total SNR comes from the merger and ringdown portion of the signal, which therefore becomes critical for a good estimate of the parameters of the system.\n\nIn more detail, the merger and ringdown correction is implemented as follows. \nThe ``PhenomC'' waveforms are used to rescale the inspiral-only SNR obtained from the SUA waveforms, which results in an SNR gain $\\cal R$ due to the merger and ringdown. This gain can be as high as ${\\cal R}\\sim10-20$ at high masses $m_{1z}+m_{2z}\\sim10^7 M_\\odot$. Since the ``PhenomC'' waveforms assume aligned (anti-aligned) spins, \n we take the projection of the spins of our catalogues (which have generic orientations) along the orbital angular momentum, and identify these projections\nwith the spins appearing in the ``PhenomC'' waveforms. We stress that this is a good approximation at least for almost aligned/anti-aligned spins, or for small spin magnitudes.\nIndeed, most of the events in our catalogues involve binaries with almost aligned spins.\n\nIn order to correct our Fisher matrix analysis for the merger and ringdown effects,  one can again utilise the SNR gain $\\cal R$. In more detail, a reduced Fisher matrix analysis applied to the  dedicated precessing-spin IMR hybrid waveforms mentioned above shows that the errors in the luminosity distance ($\\Delta d_L/d_L$) and the sky location ($\\Delta \\Omega$) scale as $\\Delta d_L/d_L\\propto {\\cal R}^{-1}$ and  $\\Delta \\Omega\\propto {\\cal R}^{-2}$ for six-link configurations, while for four-link configurations parameter-estimation degeneracies limit the gain to $\\Delta \\Omega\\propto {\\cal R}^{-1}$ and \nto a factor $\\sim 2$ improvement (roughly independent of $\\cal R$) for  $\\Delta d_L/d_L$.\nWe note that because the masses and spins are fixed in our hybrid waveforms, we cannot determine how the errors on these parameters are\naffected by the inclusion of the merger and ringdown. Nevertheless, since the \nmerger and ringdown phase\nis characterised by the mass and spin of the final BH remnant (and \\textit{not} by the masses and spin of the binary's components),\nwe do not expect the inclusion of merger and ringdown effects to improve \nsignificantly our estimation of $m_{z1,2}$ and $\\chi_{1,2}$.\n\n\n\\section{Observation of electromagnetic counterparts}\n\\label{sec:counterparts}\n\nWe first consider a conservative scenario, in which we select all the events \nwith ${\\rm SNR} > 8$ (eLISA detections) and $\\Delta\\Omega < 10\\,{\\rm deg}^2$, \nboth obtained by analysing only the inspiral part of the waveform. Therefore,\nthis choice selects events with potential for a coincident detection by electromagnetic probes planned to be in operation at the same time as eLISA, on the basis of the sky location obtained by the inspiral waveforms alone. It also assumes that an electromagnetic counterpart is promptly triggered at the merger, and that the eLISA data analysis can be performed in real time or with low latency compared to the counterpart trigger.\nOn the other hand, we also consider an optimistic scenario, in which we assume that the counterpart's trigger is either sufficiently delayed to\nallow for the merger and ringdown parameter estimation be completed first, or that the counterpart still has distinctive features and/or variability \nby the time the merger and ringdown have been analysed. \nIn practice, in the optimistic scenario we include the effect of the merger and ringdown \nalready in the selection of the events \nwith ${\\rm SNR} > 8$ and $\\Delta\\Omega < 10\\,{\\rm deg}^2$.\n\nBy the time eLISA is launched, there will be electromagnetic telescopes with adequately large field of view and sensitive enough to possibly detect faint signals coming from relatively low-mass systems merging at cosmological distances. We consider here two observing strategies: the first involving the Large Synoptic Survey Telescope (LSST \\cite{LSSTweb}) and the second leveraging on the Square Kilometre Array (SKA \\cite{SKAweb}) in combination to the Extremely Large Telescope (ELT \\cite{EELTweb}). \n\n\\subsection{LSST}\n\nLSST is an optical $8.4\\,$m telescope, covering the $u,g,r,i,z,y$ photometric bands, currently scheduled to be operational by 2022. Its field of view of 9.6 deg$^{2}$ makes it particularly suitable to observe sky regions comparable with potential GW sky-error boxes. Little is known about optical signatures potentially associated to a MBHB merger, one of the main uncertainties being the availability of gas in the vicinity of the system in the standard circumbinary disk picture (see, e.g., \\cite{2012AdAst2012E...3D} and references therein). Without invoking a specific model, we just assume\nthat in the presence of a sufficient amount of gas, a quasar-like luminosity flare (at some fraction of the Eddington luminosity) is powered during a merger. \n\nOur galaxy evolution model quantifies the gas reservoir surrounding the binary at the moment of merger, from which we can consistently compute a plausible accretion rate and a bolometric flare luminosity (details are presented in Appendix \\ref{app:luminosity}). The bolometric luminosity is then converted into apparent magnitude $m$, in a given observed band, via \\cite{1990hsaa.book.....Z}\n\n", "index": 1, "text": "\\begin{equation}\n\tL_{\\rm bol} = 3.02 \\times 10^{35-\\frac{2}{5} M}\\, {\\rm erg}/{\\rm sec} \\,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{\\rm bol}=3.02\\times 10^{35-\\frac{2}{5}M}\\,{\\rm erg}/{\\rm sec}\\,\" display=\"block\"><mrow><msub><mi>L</mi><mi>bol</mi></msub><mo>=</mo><mrow><mrow><mrow><mn>3.02</mn><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mn>35</mn><mo>-</mo><mrow><mfrac><mn>2</mn><mn>5</mn></mfrac><mo>⁢</mo><mi>M</mi></mrow></mrow></msup></mpadded></mrow><mo>⁢</mo><mi>erg</mi></mrow><mo>/</mo><mpadded width=\"+1.7pt\"><mi>sec</mi></mpadded></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $d_L$ is the luminosity distance (obtained with a fiducial cosmology), $M$ is the absolute magnitude and $BC$ is the bolometric correction (which depends on the observed band \\cite{1968ApJ...154...21O}). For standard quasars, a (linear) bolometric correction of 3-to-10 applies to single filter bands ranging from 145nm to 510nm \\cite{2012MNRAS.422..478R}. For a given rest-frame band, the correction obviously depends on the redshift. We notice, however, that LSST has a comparable sensitivity in different bands, which narrows the gap between observed and bolometric light. Without entering in cumbersome details which are beyond the scope of this study, we adopt a simple fiducial correction of $BC=1$.\n\nWith a $30\\,$s exposure, LSST will reach a limiting (5$\\sigma$) apparent magnitude of $m\\sim24.5$ in the $u, g, r$ bands, roughly covering the 300nm-700nm wavelength range \\cite{2008arXiv0805.2366I}. However, the merger of a fiducial $10^6{\\,{\\rm M_\\odot}}$ MBHB lasts for several minutes. One can therefore observe in subsequent pointings of 10 minutes around the time of the merger, to see if a flare occurs in one of the galaxies in the field of view at the right time. This roughly brings an improvement to the limiting magnitude of log$_{2.5}\\sqrt{600/30}\\approx1.5$.  We therefore set $m_{\\rm LSST}=26$ as a fiducial detection limit.\nCombining the equations above we obtain the detection condition \n\n", "itemtype": "equation", "pos": 40056, "prevtext": "\n\n", "index": 3, "text": "\\begin{equation}\n\tm = BC + M - 5 + 5 \\log_{10} \\left(\\frac{d_L}{\\rm pc}\\right) \\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"m=BC+M-5+5\\log_{10}\\left(\\frac{d_{L}}{\\rm pc}\\right)\\,,\" display=\"block\"><mrow><mrow><mi>m</mi><mo>=</mo><mrow><mrow><mrow><mrow><mi>B</mi><mo>⁢</mo><mi>C</mi></mrow><mo>+</mo><mi>M</mi></mrow><mo>-</mo><mn>5</mn></mrow><mo>+</mo><mrow><mn>5</mn><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>d</mi><mi>L</mi></msub><mi>pc</mi></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nThe identified sources can then be followed-up with a spectrograph to get a virtually exact (for our purposes) spectroscopic redshift.\n\n\n\\subsection{SKA+ELT}\n\nAs a second example, we consider the observability of merging MBHBs in the radio band. Performing  force free simulations of\n merging MBHBs in an external magnetic field, \\cite{2010Sci...329..927P} found dual jets being launched close to merger, with luminosity \n\n", "itemtype": "equation", "pos": 41572, "prevtext": "\nwhere $d_L$ is the luminosity distance (obtained with a fiducial cosmology), $M$ is the absolute magnitude and $BC$ is the bolometric correction (which depends on the observed band \\cite{1968ApJ...154...21O}). For standard quasars, a (linear) bolometric correction of 3-to-10 applies to single filter bands ranging from 145nm to 510nm \\cite{2012MNRAS.422..478R}. For a given rest-frame band, the correction obviously depends on the redshift. We notice, however, that LSST has a comparable sensitivity in different bands, which narrows the gap between observed and bolometric light. Without entering in cumbersome details which are beyond the scope of this study, we adopt a simple fiducial correction of $BC=1$.\n\nWith a $30\\,$s exposure, LSST will reach a limiting (5$\\sigma$) apparent magnitude of $m\\sim24.5$ in the $u, g, r$ bands, roughly covering the 300nm-700nm wavelength range \\cite{2008arXiv0805.2366I}. However, the merger of a fiducial $10^6{\\,{\\rm M_\\odot}}$ MBHB lasts for several minutes. One can therefore observe in subsequent pointings of 10 minutes around the time of the merger, to see if a flare occurs in one of the galaxies in the field of view at the right time. This roughly brings an improvement to the limiting magnitude of log$_{2.5}\\sqrt{600/30}\\approx1.5$.  We therefore set $m_{\\rm LSST}=26$ as a fiducial detection limit.\nCombining the equations above we obtain the detection condition \n\n", "index": 5, "text": "\\begin{equation}\n  m = 82.5 + BC - \\frac{5}{2} \\log_{10} \\left( \\frac{L_{\\rm bol}}{3.02} \\frac{\\rm sec}{\\rm erg} \\right) + 5 \\log_{10}\\left(\\frac{d_L}{\\rm pc}\\right) \\leq m_{\\rm LSST}\n\t\\label{eq:LSST_cond}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"m=82.5+BC-\\frac{5}{2}\\log_{10}\\left(\\frac{L_{\\rm bol}}{3.02}\\frac{\\rm sec}{\\rm&#10;erg%&#10;}\\right)+5\\log_{10}\\left(\\frac{d_{L}}{\\rm pc}\\right)\\leq m_{\\rm LSST}\" display=\"block\"><mrow><mi>m</mi><mo>=</mo><mrow><mrow><mrow><mn>82.5</mn><mo>+</mo><mrow><mi>B</mi><mo>⁢</mo><mi>C</mi></mrow></mrow><mo>-</mo><mrow><mfrac><mn>5</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>(</mo><mrow><mfrac><msub><mi>L</mi><mi>bol</mi></msub><mn>3.02</mn></mfrac><mo>⁢</mo><mfrac><mi>sec</mi><mi>erg</mi></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>+</mo><mrow><mn>5</mn><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>d</mi><mi>L</mi></msub><mi>pc</mi></mfrac><mo>)</mo></mrow></mrow></mrow></mrow><mo>≤</mo><msub><mi>m</mi><mi>LSST</mi></msub></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nHere, the factor $(v/v_{\\rm max})^2$ describes the luminosity evolution as the MBHB inspirals ($v_{\\rm max}=c/\\sqrt{3}$ -- where $c$ is the speed of light -- is the circular speed at the innermost stable circular orbit for a binary of non-spinning BHs), $q=M_2/M_1\\leq 1$ is the binary's mass ratio, $\\epsilon_{\\rm radio}$ (which we set to a fiducial value of 0.1, cf.~\\cite{2011ApJ...743..136O}) is the fraction of electromagnetic radiation emitted in the radio band (i.e.~a radio-to-bolometric luminosity correction), and the Eddington ratio is defined as $\\epsilon_{\\rm edd} = L_{\\rm bol}/L_{\\rm edd}$. Although \\cite{2010Sci...329..927P} found $\\epsilon_{\\rm edd}=0.002$, a subsequent investigation \\cite{2012ApJ...749L..32M} additionally identified a brighter quadrupolar contribution to the emission implying $\\epsilon_{\\rm edd}=0.02$. Moreover, as noted in \\cite{2011ApJ...734L..37K}, the magnetic field strength $B=6\\times10^4$G$m_8^{1/2}$ ($m_8$ being the mass of the MBHB normalized to $10^8 M_\\odot$) adopted in the aforementioned studies is smaller than the maximum field strength $B=10^6$G$(\\alpha m_8)^{-7/20}$ created by magneto-rotational instabilities at the inner edge of the circumbinary disk.\nThe radio luminosity of the resulting jet can therefore be correspondingly larger. Given the uncertainties, we simply compute $\\epsilon_{\\rm edd}$ from the gas accretion rate at merger (directly provided by our model, see Appendix \\ref{app:luminosity}), but we impose a floor at $\\epsilon_{\\rm edd}=0.02$.\n\nBesides this effect, which is due to the twisting of magnetic field lines by the rapidly inspiralling MBHB, \naccretion also powers standard radio jets\nthrough the Blandford-Znajeck effect~\\citep{1977MNRAS.179..433B}, \nwith luminosity dependent on the mass accretion rate. Closely following \\cite{mymodel,2001ApJ...548L...9M} we use the jet luminosity \n\n\n", "itemtype": "equation", "pos": 42215, "prevtext": "\nThe identified sources can then be followed-up with a spectrograph to get a virtually exact (for our purposes) spectroscopic redshift.\n\n\n\\subsection{SKA+ELT}\n\nAs a second example, we consider the observability of merging MBHBs in the radio band. Performing  force free simulations of\n merging MBHBs in an external magnetic field, \\cite{2010Sci...329..927P} found dual jets being launched close to merger, with luminosity \n\n", "index": 7, "text": "\\begin{equation}\n\tL_{\\rm flare} = \\epsilon_{\\rm edd} \\epsilon_{\\rm radio} (v/v_{\\rm max})^2 q^2 L_{\\rm edd} \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"L_{\\rm flare}=\\epsilon_{\\rm edd}\\epsilon_{\\rm radio}(v/v_{\\rm max})^{2}q^{2}L_%&#10;{\\rm edd}\\,.\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mi>flare</mi></msub><mo>=</mo><mrow><msub><mi>ϵ</mi><mi>edd</mi></msub><mo>⁢</mo><msub><mi>ϵ</mi><mi>radio</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>v</mi><mo>/</mo><msub><mi>v</mi><mi>max</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>q</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>L</mi><mi>edd</mi></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nHere, $\\alpha$ is the disk's viscosity parameter (which we assume $\\alpha=0.1$ hereafter); $m_9=M_1/(10^9 M_{\\odot}$), where $M_1$ is the mass of the primary BH in the pair; $\\dot{m} = \\dot{M}/ (22 \\,  m_9 \\,  M_\\odot \\,  {\\rm yr}^{-1})$ is the central accretion rate in units of the Eddington limit; $a_1$ is the spin parameter of the primary BH; $f$ and $g$ are dimensionless quantities regulating the angular velocity and azimuthal magnetic field of the system, which we set to $f = 1$ and $g = 2.3$ following \\cite{2001ApJ...548L...9M}. Equation (\\ref{eq:Ljet}) distinguishes between different accretion regimes, defined by the Eddington factor $\\epsilon_{\\rm edd}$. Indeed, while outflows/jets may occur in optically thick, geometrically thin accretion disks (top row), more powerful jets are produced by advection dominated accretion flows or slim disks (bottom row)~\\cite{2001ApJ...548L...9M}. The use of Eq.~\\eqref{eq:Ljet}, however, should be accepted with a note of caution. Indeed, the jet powers given by that equation also apply to massive BHs\n accreting steadily, while we are interested here in transient counterparts triggered by a binary merger. \n It seems reasonable to assume, however, that in the presence of a BH merger the jet should experience\nsome degree of variability on the system's dynamical time (which is typically of the order of several minutes for eLISA sources), as a consequence of the variability of the gas supply, accretion rate and magnetic field induced by the merger event. Therefore, it seems plausible to assume that the transient's power is also given (at least as an order of magnitude) \nby Eq.~\\eqref{eq:Ljet}.\n\nThe total luminosity that we will then consider in the radio frequencies is given by $L_{\\rm radio} = L_{\\rm flare} + L_{\\rm jet}$. For a detection of a counterpart by SKA we require \\cite{2011ApJ...743..136O}\n\n", "itemtype": "equation", "pos": 44215, "prevtext": "\nHere, the factor $(v/v_{\\rm max})^2$ describes the luminosity evolution as the MBHB inspirals ($v_{\\rm max}=c/\\sqrt{3}$ -- where $c$ is the speed of light -- is the circular speed at the innermost stable circular orbit for a binary of non-spinning BHs), $q=M_2/M_1\\leq 1$ is the binary's mass ratio, $\\epsilon_{\\rm radio}$ (which we set to a fiducial value of 0.1, cf.~\\cite{2011ApJ...743..136O}) is the fraction of electromagnetic radiation emitted in the radio band (i.e.~a radio-to-bolometric luminosity correction), and the Eddington ratio is defined as $\\epsilon_{\\rm edd} = L_{\\rm bol}/L_{\\rm edd}$. Although \\cite{2010Sci...329..927P} found $\\epsilon_{\\rm edd}=0.002$, a subsequent investigation \\cite{2012ApJ...749L..32M} additionally identified a brighter quadrupolar contribution to the emission implying $\\epsilon_{\\rm edd}=0.02$. Moreover, as noted in \\cite{2011ApJ...734L..37K}, the magnetic field strength $B=6\\times10^4$G$m_8^{1/2}$ ($m_8$ being the mass of the MBHB normalized to $10^8 M_\\odot$) adopted in the aforementioned studies is smaller than the maximum field strength $B=10^6$G$(\\alpha m_8)^{-7/20}$ created by magneto-rotational instabilities at the inner edge of the circumbinary disk.\nThe radio luminosity of the resulting jet can therefore be correspondingly larger. Given the uncertainties, we simply compute $\\epsilon_{\\rm edd}$ from the gas accretion rate at merger (directly provided by our model, see Appendix \\ref{app:luminosity}), but we impose a floor at $\\epsilon_{\\rm edd}=0.02$.\n\nBesides this effect, which is due to the twisting of magnetic field lines by the rapidly inspiralling MBHB, \naccretion also powers standard radio jets\nthrough the Blandford-Znajeck effect~\\citep{1977MNRAS.179..433B}, \nwith luminosity dependent on the mass accretion rate. Closely following \\cite{mymodel,2001ApJ...548L...9M} we use the jet luminosity \n\n\n", "index": 9, "text": "\\begin{equation}\n\tL_{\\rm jet} = \\begin{cases}\n\t\t 10^{42.7} {\\rm erg}\\ {\\rm s}^{-1} \n\\left(\\frac{\\alpha}{0.01} \\right)^{-0.1} m_9^{0.9}\n\\left(\\frac{\\dot{m}}{0.1}\\right)^{6/5}(1 + 1.1 a_1 + 0.29 a_1^2),  &\\text{if } 10^{-2} \\leq \\epsilon_{\\rm edd} \\leq 0.3  \\,, \\\\\n\t\t 10^{45.1} {\\rm erg}\\ {\\rm s}^{-1}\n\\left(\\frac{\\alpha}{0.3}\\right)^{-1} m_9 \n\\left(\\frac{\\dot{m}}{0.1}\\right) g^2(0.55 f^2 + 1.5 f a_1 + a_1^2) &\\text{otherwise. }\n\t\\end{cases}\n        \\label{eq:Ljet}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"L_{\\rm jet}=\\begin{cases}10^{42.7}{\\rm erg}\\ {\\rm s}^{-1}\\left(\\frac{\\alpha}{0%&#10;.01}\\right)^{-0.1}m_{9}^{0.9}\\left(\\frac{\\dot{m}}{0.1}\\right)^{6/5}(1+1.1a_{1}%&#10;+0.29a_{1}^{2}),&amp;\\text{if }10^{-2}\\leq\\epsilon_{\\rm edd}\\leq 0.3\\,,\\\\&#10;10^{45.1}{\\rm erg}\\ {\\rm s}^{-1}\\left(\\frac{\\alpha}{0.3}\\right)^{-1}m_{9}\\left%&#10;(\\frac{\\dot{m}}{0.1}\\right)g^{2}(0.55f^{2}+1.5fa_{1}+a_{1}^{2})&amp;\\text{%&#10;otherwise. }\\end{cases}\" display=\"block\"><mrow><msub><mi>L</mi><mi>jet</mi></msub><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msup><mn>10</mn><mn>42.7</mn></msup><mo>⁢</mo><mpadded width=\"+5pt\"><mi>erg</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"false\"><mfrac><mi>α</mi><mn>0.01</mn></mfrac></mstyle><mo>)</mo></mrow><mrow><mo>-</mo><mn>0.1</mn></mrow></msup><mo>⁢</mo><msubsup><mi>m</mi><mn>9</mn><mn>0.9</mn></msubsup><mo>⁢</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"false\"><mfrac><mover accent=\"true\"><mi>m</mi><mo>˙</mo></mover><mn>0.1</mn></mfrac></mstyle><mo>)</mo></mrow><mrow><mn>6</mn><mo>/</mo><mn>5</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>1.1</mn><mo>⁢</mo><msub><mi>a</mi><mn>1</mn></msub></mrow><mo>+</mo><mrow><mn>0.29</mn><mo>⁢</mo><msubsup><mi>a</mi><mn>1</mn><mn>2</mn></msubsup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext>if </mtext><mo>⁢</mo><msup><mn>10</mn><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow><mo>≤</mo><msub><mi>ϵ</mi><mi>edd</mi></msub><mo>≤</mo><mpadded width=\"+1.7pt\"><mn>0.3</mn></mpadded></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><msup><mn>10</mn><mn>45.1</mn></msup><mo>⁢</mo><mpadded width=\"+5pt\"><mi>erg</mi></mpadded><mo>⁢</mo><msup><mi mathvariant=\"normal\">s</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"false\"><mfrac><mi>α</mi><mn>0.3</mn></mfrac></mstyle><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msub><mi>m</mi><mn>9</mn></msub><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"false\"><mfrac><mover accent=\"true\"><mi>m</mi><mo>˙</mo></mover><mn>0.1</mn></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><msup><mi>g</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>0.55</mn><mo>⁢</mo><msup><mi>f</mi><mn>2</mn></msup></mrow><mo>+</mo><mrow><mn>1.5</mn><mo>⁢</mo><mi>f</mi><mo>⁢</mo><msub><mi>a</mi><mn>1</mn></msub></mrow><mo>+</mo><msubsup><mi>a</mi><mn>1</mn><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise. </mtext></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\n$F_{\\rm min}^{\\rm SKA}$ being the detector's flux limit. Equation (\\ref{Eq:LFradio}) assumes that radio waves are emitted isotropically. This is generally not the case, since synchrotron emission due to particle acceleration within the jet should be beamed along the jet, resulting in a loss of sources depending \non the jet's opening angle. However, collimation also implies a larger flux for a given source \nluminosity (if the jet points toward the Earth), resulting in intrinsically \nfainter sources being observable. We avoid these complications here, \nand take the isotropic radio flux as a simple approximation.\n\nWe assume that the bulk of the emission takes place in the SKA band, and write $F_{\\rm min}^{SKA} = \\nu_{\\rm SKA} F_{\\nu,{\\rm min}}^{\\rm SKA}$ with $\\nu_{\\rm SKA} \\simeq 1.4\\,{\\rm GHz}$. The current goal of SKA-mid in the phase 1 implementation of SKA is a flux limit of $F_{\\nu,{\\rm min}}^{\\rm SKA} \\simeq 2\\, \\mu{\\rm Jy}$ on a 0.5 deg$^2$ field of view, assuming an integration time of 10 minutes\\footnote{cf.~Table 1 in the October 2015 SKA baseline description document, \\url{https://www.skatelescope.org/wp-content/uploads/2014/03/SKA-TEL-SKO-0000308\\_SKA1_System\\_Baseline\\_v2\\_DescriptionRev01-part-1-signed.pdf}}. Full SKA should provide an order of magnitude leap in performance \\cite{Lazio}, and we therefore assume that it will be possible to reach $F_{\\nu,{\\rm min}}^{\\rm SKA} \\simeq 1\\, \\mu{\\rm Jy}$ on approximately 10 deg$^2$, in the same integration time. Therefore, we select all the events that meet the requirement\n\n\n", "itemtype": "equation", "pos": 46564, "prevtext": "\nHere, $\\alpha$ is the disk's viscosity parameter (which we assume $\\alpha=0.1$ hereafter); $m_9=M_1/(10^9 M_{\\odot}$), where $M_1$ is the mass of the primary BH in the pair; $\\dot{m} = \\dot{M}/ (22 \\,  m_9 \\,  M_\\odot \\,  {\\rm yr}^{-1})$ is the central accretion rate in units of the Eddington limit; $a_1$ is the spin parameter of the primary BH; $f$ and $g$ are dimensionless quantities regulating the angular velocity and azimuthal magnetic field of the system, which we set to $f = 1$ and $g = 2.3$ following \\cite{2001ApJ...548L...9M}. Equation (\\ref{eq:Ljet}) distinguishes between different accretion regimes, defined by the Eddington factor $\\epsilon_{\\rm edd}$. Indeed, while outflows/jets may occur in optically thick, geometrically thin accretion disks (top row), more powerful jets are produced by advection dominated accretion flows or slim disks (bottom row)~\\cite{2001ApJ...548L...9M}. The use of Eq.~\\eqref{eq:Ljet}, however, should be accepted with a note of caution. Indeed, the jet powers given by that equation also apply to massive BHs\n accreting steadily, while we are interested here in transient counterparts triggered by a binary merger. \n It seems reasonable to assume, however, that in the presence of a BH merger the jet should experience\nsome degree of variability on the system's dynamical time (which is typically of the order of several minutes for eLISA sources), as a consequence of the variability of the gas supply, accretion rate and magnetic field induced by the merger event. Therefore, it seems plausible to assume that the transient's power is also given (at least as an order of magnitude) \nby Eq.~\\eqref{eq:Ljet}.\n\nThe total luminosity that we will then consider in the radio frequencies is given by $L_{\\rm radio} = L_{\\rm flare} + L_{\\rm jet}$. For a detection of a counterpart by SKA we require \\cite{2011ApJ...743..136O}\n\n", "index": 11, "text": "\\begin{equation}\n  L_{\\rm radio} \\geq  4\\pi d_L^2 F_{\\rm min}^{\\rm SKA} \\,,\n  \\label{Eq:LFradio}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"L_{\\rm radio}\\geq 4\\pi d_{L}^{2}F_{\\rm min}^{\\rm SKA}\\,,\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mi>radio</mi></msub><mo>≥</mo><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>d</mi><mi>L</mi><mn>2</mn></msubsup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msubsup><mi>F</mi><mi>min</mi><mi>SKA</mi></msubsup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\n\nRadio identification alone, however, does not allow the measurement of the source redshift. We therefore need to follow up the source with optical/IR facilities, looking for spectral features useful for redshift determination. The spectrograph MICADO on the extremely large telescope (ELT) will cover the wavelength range 1000-2400nm ($J$ to $K$ band) \\cite{2010SPIE.7735E..2AD}. Spectroscopic observations will be possible down to an apparent magnitude of $m_{\\rm ELT,sp}=27.2$ for five hours of integration. This will allow the identification of lines such H$\\alpha$ (656nm) to $z\\approx 2.6$, [OIII] (500nm) to $z\\approx 3.8$, and [OII] (373nm) to $z\\approx 5.4$. In addition to that, the Lyman break detection will enable precise photometric redshifts down to an apparent magnitude $m_{\\rm ELT,ph}=31.3$ in $J$ and $H$ bands. Moreover, NIRCam \\cite{2004SPIE.5487..653W} (mounted on JWST) will have comparable performances down to lower wavelengths (600nm) in less than three hours of integration time. We therefore assume an essentially exact (for our purposes) redshift determination for host galaxies with $m_{\\rm gal} \\leq m_{\\rm ELT,sp}$ and a photometric redshift determination with a conservative uncertainty $\\Delta{z}=0.03(1+z)$ (see, e.g., \\cite{2013ApJ...775...93D,2013A&A...556A..55I}) for host galaxies with $m_{\\rm ELT,sp} < m_{\\rm gal} \\leq m_{\\rm ELT,ph}$.\n\n$m_{\\rm gal}$ is computed directly from the host galaxy luminosity through an equation analogue to Eq. (\\ref{eq:LSST_cond}):   \n\n", "itemtype": "equation", "pos": 48230, "prevtext": "\n$F_{\\rm min}^{\\rm SKA}$ being the detector's flux limit. Equation (\\ref{Eq:LFradio}) assumes that radio waves are emitted isotropically. This is generally not the case, since synchrotron emission due to particle acceleration within the jet should be beamed along the jet, resulting in a loss of sources depending \non the jet's opening angle. However, collimation also implies a larger flux for a given source \nluminosity (if the jet points toward the Earth), resulting in intrinsically \nfainter sources being observable. We avoid these complications here, \nand take the isotropic radio flux as a simple approximation.\n\nWe assume that the bulk of the emission takes place in the SKA band, and write $F_{\\rm min}^{SKA} = \\nu_{\\rm SKA} F_{\\nu,{\\rm min}}^{\\rm SKA}$ with $\\nu_{\\rm SKA} \\simeq 1.4\\,{\\rm GHz}$. The current goal of SKA-mid in the phase 1 implementation of SKA is a flux limit of $F_{\\nu,{\\rm min}}^{\\rm SKA} \\simeq 2\\, \\mu{\\rm Jy}$ on a 0.5 deg$^2$ field of view, assuming an integration time of 10 minutes\\footnote{cf.~Table 1 in the October 2015 SKA baseline description document, \\url{https://www.skatelescope.org/wp-content/uploads/2014/03/SKA-TEL-SKO-0000308\\_SKA1_System\\_Baseline\\_v2\\_DescriptionRev01-part-1-signed.pdf}}. Full SKA should provide an order of magnitude leap in performance \\cite{Lazio}, and we therefore assume that it will be possible to reach $F_{\\nu,{\\rm min}}^{\\rm SKA} \\simeq 1\\, \\mu{\\rm Jy}$ on approximately 10 deg$^2$, in the same integration time. Therefore, we select all the events that meet the requirement\n\n\n", "index": 13, "text": "\\begin{equation}\n\t\\left(\\frac{L_{\\rm radio}}{\\rm erg/s}\\right) \\left(\\frac{d_L}{\\rm cm}\\right)^{-2} \\geq 4\\pi\\, 10^{-18}\\, \\left(\\frac{F_{\\nu,{\\rm min}}^{\\rm SKA}}{\\rm\\mu Jy}\\right) \\left(\\frac{\\nu_{\\rm SKA}}{\\rm GHz}\\right) \\,.\n\t\\label{eq:SKA_cond}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\left(\\frac{L_{\\rm radio}}{\\rm erg/s}\\right)\\left(\\frac{d_{L}}{\\rm cm}\\right)^%&#10;{-2}\\geq 4\\pi\\,10^{-18}\\,\\left(\\frac{F_{\\nu,{\\rm min}}^{\\rm SKA}}{\\rm\\mu Jy}%&#10;\\right)\\left(\\frac{\\nu_{\\rm SKA}}{\\rm GHz}\\right)\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><mo>(</mo><mfrac><msub><mi>L</mi><mi>radio</mi></msub><mrow><mi>erg</mi><mo>/</mo><mi mathvariant=\"normal\">s</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>d</mi><mi>L</mi></msub><mi>cm</mi></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow><mo>≥</mo><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mn> 10</mn><mrow><mo>-</mo><mn>18</mn></mrow></msup></mpadded><mo>⁢</mo><mrow><mo>(</mo><mfrac><msubsup><mi>F</mi><mrow><mi>ν</mi><mo>,</mo><mi>min</mi></mrow><mi>SKA</mi></msubsup><mrow><mi>μ</mi><mo>⁢</mo><mi>Jy</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi>ν</mi><mi>SKA</mi></msub><mi>GHz</mi></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $L_k$ is the galaxy luminosity in the $K$-band (i.e., with bolometric correction already included), and is computed by converting the host total stellar mass (disk plus bulge), accessible thanks to our galaxy formation model, into luminosity by assuming a fiducial mass-to-light ratio $M/L_k=0.03$. The precise number depends on several factors (including source redshift, dust extinction, etc.). However, for young stellar populations at moderate redshift, $M/L_k$ is quite small, falling in the range 0.01-0.05 \\cite{2003MNRAS.344.1000B}. A relatively young stellar population has to be expected, since the merger producing the observed MBHB also triggers intense star formation.\n\n\\subsection{Counterpart detection}\n\\label{sec:counter}\n\nAny electromagnetic counterpart satisfying either Eq.~(\\ref{eq:LSST_cond}) or Eqs.~(\\ref{eq:SKA_cond}) and (\\ref{eq:ELT_cond}) will likely be detectable (and its redshift measurable), and can be used to populate the $d_L-z$ diagram. The number of sources meeting those conditions are reported in Table~\\ref{tab:ss} for the conservative scenario and in Table~\\ref{tab:ss2} for the optimistic scenario, according to the following structure:\n\\begin{itemize}\n\\item For each eLISA configuration, the first row shows the numbers for the light-seed model\n (popIII), the second row for the heavy-seed model with delays (Q3d), and the third row for the \n heavy-seed model with no delays (Q3nod).\n\\item The 3rd column shows the number of counterparts directly detected by LSST.\n\\item The 4th to 6th columns show the number of radio counterparts detected by SKA, respectively from the flare and jet emission and from either of the two.\n\\item The 7th to 9th columns show the number of SKA detections for which an optical counterpart can be measured by ELT with a five-hour observation. In more detail, the 7th and 8th columns show the number of \ncounterparts whose redshift can be measured spectroscopically ($m\\leq 27.2=m_{\\rm ELT,sp}$) and photometrically ($27.2<m\\leq 31.3m_{\\rm ELT,ph}$), respectively. The 9th column shows the total detection rate by ELT (sum of the previous two columns).\n\\item The last column reports the total number of standard sirens available for each configuration (the counterparts being detected either by LSST or by SKA+ELT). These numbers are also displayed in Fig.~\\ref{fig:ss}.\n\\end{itemize}\n\nNote that the numbers in the last two columns of Tables~\\ref{tab:ss} and \\ref{tab:ss2} always coincide: in fact the counterparts detectable by LSST are always detectable also by SKA+ELT.\nNevertheless, the LSST detections are not completely useless in our analysis:\nin fact for some counterparts that are detected by both telescopes, ELT can only measure the redshift photometrically, while LSST is able to measure it spectroscopically.\nFor these events, the contribution of LSST will thus permit to get rid of the error on the photometric redshift, possibly reducing the overall uncertainty on the determination of the luminosity distance.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=0.7\\textwidth]{SS_numbers}\n\\end{center}\n\\caption{Total number of standard sirens available in the conservative (empty markers) \nand optimistic (filled markers) scenarios for each eLISA configuration (corresponding \nto the last columns of Table~\\ref{tab:ss} and Table~\\ref{tab:ss2}, respectively).}\n\\label{fig:ss}\n\\end{figure}\n\nFrom Fig.~\\ref{fig:ss} it is clear that in the optimistic scenario the number of standard sirens increases dramatically for configurations with six links, while the situation does not substantially improve for four links, except in the best configurations.\nIt is also clear that heavy-seed models benefit more than light-seed ones from the addition of the merger and ringdown phases in the search for the counterpart.\nThis is due to the specific mass distribution in the different models. In the popIII model, most of the eLISA events \nhave low mass. For these events the merger and ringdown are not visible by the detector, and adding them to the analysis does not significantly improve the sky localisation. The opposite is true for the Q3d and Q3nod models, for which the addition of the merger and ringdown greatly increases the average SNR of the events, therefore improving sky localisation and ultimately increasing the number of usable standard sirens.\nFig.~\\ref{fig:ss} also anticipates what will be confirmed later (see section~\\ref{sec:results} and \\ref{sec:FoM}) by the Fisher matrix analysis of the cosmological parameters: \nconfigurations with four links will not provide enough standard sirens to consistently constrain the cosmological parameters.\nIn fact, among the four-link configurations, only two will detect more than a few standard sirens over a five-year mission period in both scenarios,\nnamely\nN2A5M5L4 and (barely and only in the popIII and Q3nod models) N2A2M5L4.\nThis might thus prevent an independent cosmological analysis based on a four-link eLISA mission, although the few collected data might turn out useful for integrating other datasets, e.g.~SNIa.\nOn the other hand, except for the configuration N1A1M5L6 in the conservative scenario, six-link configurations always present a sufficient number of standard sirens to allow for an independent cosmological analysis of the data (see section~\\ref{sec:results}), even though Q3d gives systematically fewer counterparts than the other models in the conservative scenario.\n\n\n\\section{Cosmological models}\n\\label{sec:cosmology}\n\nWe consider a Friedmann-Lema\\^itre-Robertson-Walker (FLRW) universe with background metric (in polar coordinates and allowing for spatial curvature)\n\n", "itemtype": "equation", "pos": 50001, "prevtext": "\n\nRadio identification alone, however, does not allow the measurement of the source redshift. We therefore need to follow up the source with optical/IR facilities, looking for spectral features useful for redshift determination. The spectrograph MICADO on the extremely large telescope (ELT) will cover the wavelength range 1000-2400nm ($J$ to $K$ band) \\cite{2010SPIE.7735E..2AD}. Spectroscopic observations will be possible down to an apparent magnitude of $m_{\\rm ELT,sp}=27.2$ for five hours of integration. This will allow the identification of lines such H$\\alpha$ (656nm) to $z\\approx 2.6$, [OIII] (500nm) to $z\\approx 3.8$, and [OII] (373nm) to $z\\approx 5.4$. In addition to that, the Lyman break detection will enable precise photometric redshifts down to an apparent magnitude $m_{\\rm ELT,ph}=31.3$ in $J$ and $H$ bands. Moreover, NIRCam \\cite{2004SPIE.5487..653W} (mounted on JWST) will have comparable performances down to lower wavelengths (600nm) in less than three hours of integration time. We therefore assume an essentially exact (for our purposes) redshift determination for host galaxies with $m_{\\rm gal} \\leq m_{\\rm ELT,sp}$ and a photometric redshift determination with a conservative uncertainty $\\Delta{z}=0.03(1+z)$ (see, e.g., \\cite{2013ApJ...775...93D,2013A&A...556A..55I}) for host galaxies with $m_{\\rm ELT,sp} < m_{\\rm gal} \\leq m_{\\rm ELT,ph}$.\n\n$m_{\\rm gal}$ is computed directly from the host galaxy luminosity through an equation analogue to Eq. (\\ref{eq:LSST_cond}):   \n\n", "index": 15, "text": "\\begin{equation}\n\tm_{\\rm gal} = 82.5 - \\frac{5}{2} \\log_{10} \\left(\\frac{L_k}{3.02} \\frac{\\rm s}{\\rm erg} \\right) + 5 \\log_{10}\\left(\\frac{d_L}{\\rm pc}\\right)\\,, \n\t\\label{eq:ELT_cond}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"m_{\\rm gal}=82.5-\\frac{5}{2}\\log_{10}\\left(\\frac{L_{k}}{3.02}\\frac{\\rm s}{\\rm&#10;erg%&#10;}\\right)+5\\log_{10}\\left(\\frac{d_{L}}{\\rm pc}\\right)\\,,\" display=\"block\"><mrow><mrow><msub><mi>m</mi><mi>gal</mi></msub><mo>=</mo><mrow><mrow><mn>82.5</mn><mo>-</mo><mrow><mfrac><mn>5</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>(</mo><mrow><mfrac><msub><mi>L</mi><mi>k</mi></msub><mn>3.02</mn></mfrac><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">s</mi><mi>erg</mi></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>+</mo><mrow><mn>5</mn><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>d</mi><mi>L</mi></msub><mi>pc</mi></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nFrom the Friedmann equations, the Hubble rate $H=\\dot a/a$ in the late universe can be expressed in terms \nof the redshift $z=a_0/a-1$ as (see e.g.~\\cite{ruth})\n\n", "itemtype": "equation", "pos": 55841, "prevtext": "\nwhere $L_k$ is the galaxy luminosity in the $K$-band (i.e., with bolometric correction already included), and is computed by converting the host total stellar mass (disk plus bulge), accessible thanks to our galaxy formation model, into luminosity by assuming a fiducial mass-to-light ratio $M/L_k=0.03$. The precise number depends on several factors (including source redshift, dust extinction, etc.). However, for young stellar populations at moderate redshift, $M/L_k$ is quite small, falling in the range 0.01-0.05 \\cite{2003MNRAS.344.1000B}. A relatively young stellar population has to be expected, since the merger producing the observed MBHB also triggers intense star formation.\n\n\\subsection{Counterpart detection}\n\\label{sec:counter}\n\nAny electromagnetic counterpart satisfying either Eq.~(\\ref{eq:LSST_cond}) or Eqs.~(\\ref{eq:SKA_cond}) and (\\ref{eq:ELT_cond}) will likely be detectable (and its redshift measurable), and can be used to populate the $d_L-z$ diagram. The number of sources meeting those conditions are reported in Table~\\ref{tab:ss} for the conservative scenario and in Table~\\ref{tab:ss2} for the optimistic scenario, according to the following structure:\n\\begin{itemize}\n\\item For each eLISA configuration, the first row shows the numbers for the light-seed model\n (popIII), the second row for the heavy-seed model with delays (Q3d), and the third row for the \n heavy-seed model with no delays (Q3nod).\n\\item The 3rd column shows the number of counterparts directly detected by LSST.\n\\item The 4th to 6th columns show the number of radio counterparts detected by SKA, respectively from the flare and jet emission and from either of the two.\n\\item The 7th to 9th columns show the number of SKA detections for which an optical counterpart can be measured by ELT with a five-hour observation. In more detail, the 7th and 8th columns show the number of \ncounterparts whose redshift can be measured spectroscopically ($m\\leq 27.2=m_{\\rm ELT,sp}$) and photometrically ($27.2<m\\leq 31.3m_{\\rm ELT,ph}$), respectively. The 9th column shows the total detection rate by ELT (sum of the previous two columns).\n\\item The last column reports the total number of standard sirens available for each configuration (the counterparts being detected either by LSST or by SKA+ELT). These numbers are also displayed in Fig.~\\ref{fig:ss}.\n\\end{itemize}\n\nNote that the numbers in the last two columns of Tables~\\ref{tab:ss} and \\ref{tab:ss2} always coincide: in fact the counterparts detectable by LSST are always detectable also by SKA+ELT.\nNevertheless, the LSST detections are not completely useless in our analysis:\nin fact for some counterparts that are detected by both telescopes, ELT can only measure the redshift photometrically, while LSST is able to measure it spectroscopically.\nFor these events, the contribution of LSST will thus permit to get rid of the error on the photometric redshift, possibly reducing the overall uncertainty on the determination of the luminosity distance.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=0.7\\textwidth]{SS_numbers}\n\\end{center}\n\\caption{Total number of standard sirens available in the conservative (empty markers) \nand optimistic (filled markers) scenarios for each eLISA configuration (corresponding \nto the last columns of Table~\\ref{tab:ss} and Table~\\ref{tab:ss2}, respectively).}\n\\label{fig:ss}\n\\end{figure}\n\nFrom Fig.~\\ref{fig:ss} it is clear that in the optimistic scenario the number of standard sirens increases dramatically for configurations with six links, while the situation does not substantially improve for four links, except in the best configurations.\nIt is also clear that heavy-seed models benefit more than light-seed ones from the addition of the merger and ringdown phases in the search for the counterpart.\nThis is due to the specific mass distribution in the different models. In the popIII model, most of the eLISA events \nhave low mass. For these events the merger and ringdown are not visible by the detector, and adding them to the analysis does not significantly improve the sky localisation. The opposite is true for the Q3d and Q3nod models, for which the addition of the merger and ringdown greatly increases the average SNR of the events, therefore improving sky localisation and ultimately increasing the number of usable standard sirens.\nFig.~\\ref{fig:ss} also anticipates what will be confirmed later (see section~\\ref{sec:results} and \\ref{sec:FoM}) by the Fisher matrix analysis of the cosmological parameters: \nconfigurations with four links will not provide enough standard sirens to consistently constrain the cosmological parameters.\nIn fact, among the four-link configurations, only two will detect more than a few standard sirens over a five-year mission period in both scenarios,\nnamely\nN2A5M5L4 and (barely and only in the popIII and Q3nod models) N2A2M5L4.\nThis might thus prevent an independent cosmological analysis based on a four-link eLISA mission, although the few collected data might turn out useful for integrating other datasets, e.g.~SNIa.\nOn the other hand, except for the configuration N1A1M5L6 in the conservative scenario, six-link configurations always present a sufficient number of standard sirens to allow for an independent cosmological analysis of the data (see section~\\ref{sec:results}), even though Q3d gives systematically fewer counterparts than the other models in the conservative scenario.\n\n\n\\section{Cosmological models}\n\\label{sec:cosmology}\n\nWe consider a Friedmann-Lema\\^itre-Robertson-Walker (FLRW) universe with background metric (in polar coordinates and allowing for spatial curvature)\n\n", "index": 17, "text": "\\begin{equation}\nds^2=-c^2 d t^2 +a^2(t)\\left(\\frac{dr^2}{1-k\\,r^2}+r^2d\\Omega\\right)\\qquad\\text{with}\\quad k=0, 1, -1 \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"ds^{2}=-c^{2}dt^{2}+a^{2}(t)\\left(\\frac{dr^{2}}{1-k\\,r^{2}}+r^{2}d\\Omega\\right%&#10;)\\qquad\\text{with}\\quad k=0,1,-1\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>s</mi><mn>2</mn></msup></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><msup><mi>c</mi><mn>2</mn></msup><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msup><mi>t</mi><mn>2</mn></msup></mrow></mrow><mo>+</mo><mrow><msup><mi>a</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mi>k</mi></mpadded><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mrow></mfrac><mo>+</mo><mrow><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mtext>with</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mi>k</mi><mo>=</mo><mrow><mn>0</mn><mo>,</mo><mn>1</mn><mo>,</mo><mrow><mo>-</mo><mpadded width=\"+1.7pt\"><mn>1</mn></mpadded></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $H_0 = h\\times 100$ km/(s$\\,$Mpc) is the Hubble constant today, and the constituents of the late universe \nare the relative energy density of matter today (dark + baryonic),  \n$\\Omega_M=8\\pi\\,G \\rho_M^0 /(3H_0^2)$, and the cosmological constant or dark energy energy density today, \n$\\Omega_\\Lambda=\\Lambda c^2/(3H_0^2)$ or $\\Omega_\\Lambda=8\\pi\\,G \\rho_{DE}^0 /(3H_0^2)$. \nWhen we consider dark energy, we model its equation of state as $w(z) = w_0 + (1-a) w_a = w_0 + w_a\\, z/(z+1)$ \\cite{Chevallier:2000qy}, and we therefore have $w_0$ and $w_a$ as extra parameters. In the most general case, we do not assume that the universe is spatially flat: defining an effective relative energy density for the curvature, $\\Omega_k=-k c^2/(a_0H_0)^2$, we have $\\Omega_k+{\\Omega_{M}}+{\\Omega_\\Lambda}=1$. The fiducial cosmological model we have adopted has parameter values $\\Omega_M = 0.3$, $\\Omega_\\Lambda = 0.7$, $h = 0.67$ ($H_0 = 67$ km/s/Mpc), $w_0 = -1$, $w_a=0$. \n\t\nThe luminosity distance is $d_L=\\sqrt{L/(4\\pi\\,F)}$, where $L$ is the intrinsic luminosity of a source and $F$ the flux received by the observer. Accounting for the redshift and expansion effects one gets the distance-redshift relation (see e.g.~\\cite{ruth,weinberg})\n\n", "itemtype": "equation", "pos": 56140, "prevtext": "\nFrom the Friedmann equations, the Hubble rate $H=\\dot a/a$ in the late universe can be expressed in terms \nof the redshift $z=a_0/a-1$ as (see e.g.~\\cite{ruth})\n\n", "index": 19, "text": "\\begin{equation}\n\tH(z) = H_0 \\sqrt{\\Omega_M \\left(z+1\\right)^3 + \\left(1-\\Omega_\\Lambda -\\Omega_M\\right) \\left(z+1\\right)^2\n\t  +\\Omega_\\Lambda\\, \\exp\\left[-\\frac{3 w_a z}{z+1}\\right] \\left(z+1\\right)^{3 (1+w_0+w_a)}\t} \\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"H(z)=H_{0}\\sqrt{\\Omega_{M}\\left(z+1\\right)^{3}+\\left(1-\\Omega_{\\Lambda}-\\Omega%&#10;_{M}\\right)\\left(z+1\\right)^{2}+\\Omega_{\\Lambda}\\,\\exp\\left[-\\frac{3w_{a}z}{z+%&#10;1}\\right]\\left(z+1\\right)^{3(1+w_{0}+w_{a})}}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msqrt><mrow><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>M</mi></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mi>z</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow><mn>3</mn></msup></mrow><mo>+</mo><mrow><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>M</mi></msub></mrow><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mi>z</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mpadded><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>w</mi><mi>a</mi></msub><mo>⁢</mo><mi>z</mi></mrow><mrow><mi>z</mi><mo>+</mo><mn>1</mn></mrow></mfrac></mrow><mo>]</mo></mrow></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mi>z</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow><mrow><mn>3</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi>w</mi><mn>0</mn></msub><mo>+</mo><msub><mi>w</mi><mi>a</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup></mrow></mrow></msqrt></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nWhen measuring the distance-redshift relation $d_L(z)$ with observations, one can in principle constrain the values of all the five parameters $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h,\\,w_0,\\,w_a)$. However, there is a strong degeneracy between the parameters $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$ and the dark energy equation of state parameters $(w_0,\\,w_a)$, which makes the simultaneous determination of the five parameters very difficult in practice. Because of this, in the following we analyse the capability of eLISA standard sirens to constrain more specific models of the universe, in analogy with what done e.g.~for the Einstein Telescope in \\cite{Zhao:2010sz}, for SNIa in \\cite{Betoule:2014frx}, and for BAO in \\cite{Aubourg:2014yra}. We consider three subclasses of the full five-parameter model:\n\\begin{itemize}\n\\item {\\bf $\\Lambda$CDM + curvature}: a three-parameter model $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$, where we fix $w_0=-1$ and $w_a=0$, corresponding to a universe with cosmological constant (CC), dark matter and spatial curvature;\n\\item {\\bf $\\Lambda$CDM}: the standard concordance model, where we fix ${\\Omega_{M}}+{\\Omega_\\Lambda}=1$ and $w_0=-1$, $w_a=0$;\n\\item {\\bf DDE}: a DDE scenario characterised by $(w_0,\\,w_a)$, where we fix ${\\Omega_{M}}=0.3\\,,~{\\Omega_\\Lambda}=0.7\\,,~h=0.67$.\n\\end{itemize}\nMoreover, we briefly analyse the case where only ${\\Omega_{M}}$ and ${\\Omega_\\Lambda}$ are taken as free parameters, with the remaining ones being fixed to their fiducial values.\nThis model is useful to test the curvature and acceleration of the universe, and is mainly considered for comparison with SNIa probes, which are unable to constrain the Hubble constant. We also provide the errors with which eLISA could determine ${\\Omega_{M}}$ with all other parameters fixed (to be compared with the SNIa measurement in the $\\Lambda$CDM scenario), and $H_0$ with all other parameters fixed (to be compared with cosmic-distance ladder tests, if one assumes the $\\Lambda$CDM scenario and fixes the value of ${\\Omega_{M}}$).\n\n\\section{Statistical method}\n\\label{sec:statistic}\n\nIn order to estimate the errors on the cosmological parameters, \nwe adopt a Fisher matrix technique. We simulated a total of 118 five-year catalogues for each MBHB formation scenario \n(popIII, Q3d, Q3nod). This was crucial to get the necessary statistics, since there is a significant scatter in the characteristics of the MBHB population in different catalogues (see Appendix~\\ref{app:statistics}).\n\nFor each event in each catalogue, we estimate the measurement error on the \nluminosity distance $(\\Delta d_L)_n$  for all the twelve eLISA configurations (see section \\ref{sec2}), \nby applying a Fisher matrix analysis on the waveforms as\n  described in section~\\ref{sec:detection}. We then construct the Fisher matrix for the \n  parameters of the cosmological model as\n\n", "itemtype": "equation", "pos": 57616, "prevtext": "\nwhere $H_0 = h\\times 100$ km/(s$\\,$Mpc) is the Hubble constant today, and the constituents of the late universe \nare the relative energy density of matter today (dark + baryonic),  \n$\\Omega_M=8\\pi\\,G \\rho_M^0 /(3H_0^2)$, and the cosmological constant or dark energy energy density today, \n$\\Omega_\\Lambda=\\Lambda c^2/(3H_0^2)$ or $\\Omega_\\Lambda=8\\pi\\,G \\rho_{DE}^0 /(3H_0^2)$. \nWhen we consider dark energy, we model its equation of state as $w(z) = w_0 + (1-a) w_a = w_0 + w_a\\, z/(z+1)$ \\cite{Chevallier:2000qy}, and we therefore have $w_0$ and $w_a$ as extra parameters. In the most general case, we do not assume that the universe is spatially flat: defining an effective relative energy density for the curvature, $\\Omega_k=-k c^2/(a_0H_0)^2$, we have $\\Omega_k+{\\Omega_{M}}+{\\Omega_\\Lambda}=1$. The fiducial cosmological model we have adopted has parameter values $\\Omega_M = 0.3$, $\\Omega_\\Lambda = 0.7$, $h = 0.67$ ($H_0 = 67$ km/s/Mpc), $w_0 = -1$, $w_a=0$. \n\t\nThe luminosity distance is $d_L=\\sqrt{L/(4\\pi\\,F)}$, where $L$ is the intrinsic luminosity of a source and $F$ the flux received by the observer. Accounting for the redshift and expansion effects one gets the distance-redshift relation (see e.g.~\\cite{ruth,weinberg})\n\n", "index": 21, "text": "\\begin{equation}\n\td_L (z) =\n\t\\begin{cases}\n\t\t\\frac{c}{H_0} \\frac{1+z}{\\sqrt{|\\Omega_k|}} \\sin \\left[ \\sqrt{|\\Omega_k|} \\int_0^z \\frac{H_0}{H(z')} dz' \\right] \\,, &\\text{ if } \\Omega_k = 1 - \\Omega_M -\\Omega_\\Lambda >0 \\,, \\\\\t\n\tc \\left(1+z\\right) \\int_0^z \\frac{1}{H(z')} dz' \\,, &\\text{ if } \\Omega_k = 1 - \\Omega_M -\\Omega_\\Lambda =0 \\,, \\\\\n\t\\frac{c}{H_0} \\frac{1+z}{\\sqrt{|\\Omega_k|}} \\sinh \\left[ \\sqrt{|\\Omega_k|} \\int_0^z \\frac{H_0}{H(z')} dz' \\right] \\,, &\\text{ if } \\Omega_k = 1 - \\Omega_M -\\Omega_\\Lambda <0 \\,.\n\t\\end{cases}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"d_{L}(z)=\\begin{cases}\\frac{c}{H_{0}}\\frac{1+z}{\\sqrt{|\\Omega_{k}|}}\\sin\\left[%&#10;\\sqrt{|\\Omega_{k}|}\\int_{0}^{z}\\frac{H_{0}}{H(z^{\\prime})}dz^{\\prime}\\right]\\,%&#10;,&amp;\\text{ if }\\Omega_{k}=1-\\Omega_{M}-\\Omega_{\\Lambda}&gt;0\\,,\\\\&#10;c\\left(1+z\\right)\\int_{0}^{z}\\frac{1}{H(z^{\\prime})}dz^{\\prime}\\,,&amp;\\text{ if }%&#10;\\Omega_{k}=1-\\Omega_{M}-\\Omega_{\\Lambda}=0\\,,\\\\&#10;\\frac{c}{H_{0}}\\frac{1+z}{\\sqrt{|\\Omega_{k}|}}\\sinh\\left[\\sqrt{|\\Omega_{k}|}%&#10;\\int_{0}^{z}\\frac{H_{0}}{H(z^{\\prime})}dz^{\\prime}\\right]\\,,&amp;\\text{ if }\\Omega%&#10;_{k}=1-\\Omega_{M}-\\Omega_{\\Lambda}&lt;0\\,.\\end{cases}\" display=\"block\"><mrow><mrow><msub><mi>d</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"false\"><mfrac><mi>c</mi><msub><mi>H</mi><mn>0</mn></msub></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><msqrt><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub><mo stretchy=\"false\">|</mo></mrow></msqrt></mfrac></mstyle><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><msqrt><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub><mo stretchy=\"false\">|</mo></mrow></msqrt><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>z</mi></msubsup></mstyle><mrow><mstyle displaystyle=\"false\"><mfrac><msub><mi>H</mi><mn>0</mn></msub><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>z</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>𝑑</mo><msup><mi>z</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext> if </mtext><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>M</mi></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mrow><mo>&gt;</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mi>c</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>z</mi></msubsup></mstyle><mrow><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>z</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>𝑑</mo><mpadded width=\"+1.7pt\"><msup><mi>z</mi><mo>′</mo></msup></mpadded></mrow></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext> if </mtext><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>M</mi></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"false\"><mfrac><mi>c</mi><msub><mi>H</mi><mn>0</mn></msub></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><msqrt><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub><mo stretchy=\"false\">|</mo></mrow></msqrt></mfrac></mstyle><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><msqrt><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub><mo stretchy=\"false\">|</mo></mrow></msqrt><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>z</mi></msubsup></mstyle><mrow><mstyle displaystyle=\"false\"><mfrac><msub><mi>H</mi><mn>0</mn></msub><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>z</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>𝑑</mo><msup><mi>z</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext> if </mtext><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>M</mi></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mrow><mo>&lt;</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere the sum runs over all MBHB events in each catalogue, the derivatives of $d_L$ \n(evaluated at the redshift $z_n$ of each event) are performed with respect to the five cosmological parameters\n $\\theta_i = (\\Omega_M, \\Omega_\\Lambda, h, w_0, w_a)$ evaluated at their fiducial values, \n and $C$ identifies the catalogue. To define the typical detector performance,\n  we need a suitable combination of the covariance matrices of the 118 catalogues to \n  obtain a unique Fisher/covariance matrix for each MBHB formation scenario and eLISA design.\n  This procedure is described at the end of this section, and in more detail in \nAppendix \\ref{app:statistics}. Let us here first discuss the uncertainty on the \nluminosity distance, which is given by three terms as shown by \nEq.~\\eqref{fisher}. \n\nWe start with $\\sigma_n$, which has several components. First, it contains the eLISA experimental error \n$(\\Delta {d_L})_n$, obtained by the Fisher matrix analysis of the waveforms described in section \\ref{sec:detection}.\nIn more detail, the experimental error is determined using both the inspiral and merger and ringdown parts of the waveform, \nfor both the conservative and the optimistic scenarios. In fact, whether the counterpart is detected with \n(optimistic scenario) or without (conservative scenario) the help of the merger and ringdown contribution, \nthe parameter estimation can be repeated after the merger, when that contribution can always be added.\nMoreover, to account for the reduction in this error due to the perfect sky localisation of the system once the counterpart has been detected, we\nput an exact prior on the sky position, i.e.~we eliminate the Fisher matrix rows and columns corresponding to the two sky location angles, \n and then invert the Fisher matrix to obtain the covariance matrix and thus the error on the luminosity distance $(\\Delta {d_L})_n$.\nMoreover, $\\sigma_n$ also includes the error due to the redshift measurement. For all the sources \nwhose redshift can be determined  spectroscopically, we assume that this error is negligible for the \npurpose of the present analysis. However, this assumption does not hold for the most distant binaries, \nwhose redshift is measured photometrically by ELT. For these sources, \nwe estimate the redshift uncertainty approximately \nas $(\\Delta z)_n\\simeq 0.03(1+z_n)$ \n\\cite{2013ApJ...775...93D,2013A&A...556A..55I}. To account for this, \nwe propagate this error on the luminosity distance in the standard way, i.e.~we \nassume\n\\begin{eqnarray}\n\t \\sigma_n =  \\left\\{\\begin{array}{ll}\n\t  (\\Delta d_L)_n & ~~~{\\rm for~spectroscopic~redshift} \\,, \\\\\n\t  \\sqrt{ (\\Delta d_L)_n^2 + \\left(\\frac{\\partial d_L}{\\partial z} \n(\\Delta z)_n\\right)^2 } & ~~~{\\rm for~photometric~redshift} \\,.\n\\end{array}\\right.\n\\end{eqnarray}\n\nFurthermore, we must account for the systematic error due to weak-lensing. \nWeak-lensing has been estimated as a major source of error on $d_L(z)$ for \nhigh-redshift standard sirens, degrading the measurement by approximately 5\\% \n\\cite{Holz:2005df}. In the present analysis, we use the fitting formula of \n\\cite{Hirata:2010ba} to estimate the weak lensing error (see also \n\\cite{camille}):\n\n", "itemtype": "equation", "pos": 61040, "prevtext": "\nWhen measuring the distance-redshift relation $d_L(z)$ with observations, one can in principle constrain the values of all the five parameters $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h,\\,w_0,\\,w_a)$. However, there is a strong degeneracy between the parameters $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$ and the dark energy equation of state parameters $(w_0,\\,w_a)$, which makes the simultaneous determination of the five parameters very difficult in practice. Because of this, in the following we analyse the capability of eLISA standard sirens to constrain more specific models of the universe, in analogy with what done e.g.~for the Einstein Telescope in \\cite{Zhao:2010sz}, for SNIa in \\cite{Betoule:2014frx}, and for BAO in \\cite{Aubourg:2014yra}. We consider three subclasses of the full five-parameter model:\n\\begin{itemize}\n\\item {\\bf $\\Lambda$CDM + curvature}: a three-parameter model $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$, where we fix $w_0=-1$ and $w_a=0$, corresponding to a universe with cosmological constant (CC), dark matter and spatial curvature;\n\\item {\\bf $\\Lambda$CDM}: the standard concordance model, where we fix ${\\Omega_{M}}+{\\Omega_\\Lambda}=1$ and $w_0=-1$, $w_a=0$;\n\\item {\\bf DDE}: a DDE scenario characterised by $(w_0,\\,w_a)$, where we fix ${\\Omega_{M}}=0.3\\,,~{\\Omega_\\Lambda}=0.7\\,,~h=0.67$.\n\\end{itemize}\nMoreover, we briefly analyse the case where only ${\\Omega_{M}}$ and ${\\Omega_\\Lambda}$ are taken as free parameters, with the remaining ones being fixed to their fiducial values.\nThis model is useful to test the curvature and acceleration of the universe, and is mainly considered for comparison with SNIa probes, which are unable to constrain the Hubble constant. We also provide the errors with which eLISA could determine ${\\Omega_{M}}$ with all other parameters fixed (to be compared with the SNIa measurement in the $\\Lambda$CDM scenario), and $H_0$ with all other parameters fixed (to be compared with cosmic-distance ladder tests, if one assumes the $\\Lambda$CDM scenario and fixes the value of ${\\Omega_{M}}$).\n\n\\section{Statistical method}\n\\label{sec:statistic}\n\nIn order to estimate the errors on the cosmological parameters, \nwe adopt a Fisher matrix technique. We simulated a total of 118 five-year catalogues for each MBHB formation scenario \n(popIII, Q3d, Q3nod). This was crucial to get the necessary statistics, since there is a significant scatter in the characteristics of the MBHB population in different catalogues (see Appendix~\\ref{app:statistics}).\n\nFor each event in each catalogue, we estimate the measurement error on the \nluminosity distance $(\\Delta d_L)_n$  for all the twelve eLISA configurations (see section \\ref{sec2}), \nby applying a Fisher matrix analysis on the waveforms as\n  described in section~\\ref{sec:detection}. We then construct the Fisher matrix for the \n  parameters of the cosmological model as\n\n", "index": 23, "text": "\\begin{equation}\n\t\tF_{ij}^C = \\sum_n \\frac{1}{\\sigma^2_n + \\sigma^2_{\\rm lens}(z_n)+ \\sigma^2_v(z_n)} \\left.\\frac{\\partial d_L(z_n)}{\\partial\\theta_i}\\right|_{\\rm fid} \\left.\\frac{\\partial d_L(z_n)}{\\partial\\theta_j}\\right|_{\\rm fid}\n\t\t\\label{fisher}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"F_{ij}^{C}=\\sum_{n}\\frac{1}{\\sigma^{2}_{n}+\\sigma^{2}_{\\rm lens}(z_{n})+\\sigma%&#10;^{2}_{v}(z_{n})}\\left.\\frac{\\partial d_{L}(z_{n})}{\\partial\\theta_{i}}\\right|_%&#10;{\\rm fid}\\left.\\frac{\\partial d_{L}(z_{n})}{\\partial\\theta_{j}}\\right|_{\\rm fid}\" display=\"block\"><mrow><msubsup><mi>F</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mi>C</mi></msubsup><mo>=</mo><msub><mrow><mrow><msub><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><mfrac><mn>1</mn><mrow><msubsup><mi>σ</mi><mi>n</mi><mn>2</mn></msubsup><mo>+</mo><mrow><msubsup><mi>σ</mi><mi>lens</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msubsup><mi>σ</mi><mi>v</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>d</mi><mi>L</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>θ</mi><mi>i</mi></msub></mrow></mfrac></mrow></mrow><mo fence=\"true\">|</mo></mrow><mi>fid</mi></msub><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>d</mi><mi>L</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>z</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>θ</mi><mi>j</mi></msub></mrow></mfrac></mrow><mo fence=\"true\">|</mo></mrow><mi>fid</mi></msub></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nWhen we consider the optimistic scenario, we divide $\\sigma_{\\rm lens}(z)$ by a factor two. The weak lensing magnification uncertainty can in principle be reduced by directly measuring the inhomogeneities in the mass distribution along the line of sight to the source \\cite{Dalal:2002wh,Gunnarsson:2005qu,Jonsson:2006vc,2011MNRAS.412.1023H}. Moreover, it has been pointed out that the errors due to weak lensing could be reduced with respect to Eq.~(\\ref{eq:propag_error}), \naccounting for the non-Gaussianity of the r.m.s.~of the kappa-distribution \\cite{Hirata:2010ba,Shang:2010ta}.\nCombining this latter effect with a certain amount of de-lensing, which we assume will be feasible in 2034, we forecast that a de-lensing factor of two\n can be taken into account by the time eLISA is launched. \n\nFinally the last term in Eq.~\\eqref{fisher} is the error due to the peculiar velocities of the GW sources.\nIn our analysis we use the fitting formula that appears in \\cite{Kocsis:2005vv}, namely\n\n", "itemtype": "equation", "pos": 64485, "prevtext": "\nwhere the sum runs over all MBHB events in each catalogue, the derivatives of $d_L$ \n(evaluated at the redshift $z_n$ of each event) are performed with respect to the five cosmological parameters\n $\\theta_i = (\\Omega_M, \\Omega_\\Lambda, h, w_0, w_a)$ evaluated at their fiducial values, \n and $C$ identifies the catalogue. To define the typical detector performance,\n  we need a suitable combination of the covariance matrices of the 118 catalogues to \n  obtain a unique Fisher/covariance matrix for each MBHB formation scenario and eLISA design.\n  This procedure is described at the end of this section, and in more detail in \nAppendix \\ref{app:statistics}. Let us here first discuss the uncertainty on the \nluminosity distance, which is given by three terms as shown by \nEq.~\\eqref{fisher}. \n\nWe start with $\\sigma_n$, which has several components. First, it contains the eLISA experimental error \n$(\\Delta {d_L})_n$, obtained by the Fisher matrix analysis of the waveforms described in section \\ref{sec:detection}.\nIn more detail, the experimental error is determined using both the inspiral and merger and ringdown parts of the waveform, \nfor both the conservative and the optimistic scenarios. In fact, whether the counterpart is detected with \n(optimistic scenario) or without (conservative scenario) the help of the merger and ringdown contribution, \nthe parameter estimation can be repeated after the merger, when that contribution can always be added.\nMoreover, to account for the reduction in this error due to the perfect sky localisation of the system once the counterpart has been detected, we\nput an exact prior on the sky position, i.e.~we eliminate the Fisher matrix rows and columns corresponding to the two sky location angles, \n and then invert the Fisher matrix to obtain the covariance matrix and thus the error on the luminosity distance $(\\Delta {d_L})_n$.\nMoreover, $\\sigma_n$ also includes the error due to the redshift measurement. For all the sources \nwhose redshift can be determined  spectroscopically, we assume that this error is negligible for the \npurpose of the present analysis. However, this assumption does not hold for the most distant binaries, \nwhose redshift is measured photometrically by ELT. For these sources, \nwe estimate the redshift uncertainty approximately \nas $(\\Delta z)_n\\simeq 0.03(1+z_n)$ \n\\cite{2013ApJ...775...93D,2013A&A...556A..55I}. To account for this, \nwe propagate this error on the luminosity distance in the standard way, i.e.~we \nassume\n\\begin{eqnarray}\n\t \\sigma_n =  \\left\\{\\begin{array}{ll}\n\t  (\\Delta d_L)_n & ~~~{\\rm for~spectroscopic~redshift} \\,, \\\\\n\t  \\sqrt{ (\\Delta d_L)_n^2 + \\left(\\frac{\\partial d_L}{\\partial z} \n(\\Delta z)_n\\right)^2 } & ~~~{\\rm for~photometric~redshift} \\,.\n\\end{array}\\right.\n\\end{eqnarray}\n\nFurthermore, we must account for the systematic error due to weak-lensing. \nWeak-lensing has been estimated as a major source of error on $d_L(z)$ for \nhigh-redshift standard sirens, degrading the measurement by approximately 5\\% \n\\cite{Holz:2005df}. In the present analysis, we use the fitting formula of \n\\cite{Hirata:2010ba} to estimate the weak lensing error (see also \n\\cite{camille}):\n\n", "index": 25, "text": "\\begin{equation}\n\t\\sigma_{\\rm lens}(z) = d_L(z) \\times 0.066 \\left( \\frac{1-(1+z)^{-0.25}}{0.25} \\right)^{1.8} \\,.\n\t\\label{eq:propag_error}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm lens}(z)=d_{L}(z)\\times 0.066\\left(\\frac{1-(1+z)^{-0.25}}{0.25}%&#10;\\right)^{1.8}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>σ</mi><mi>lens</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>d</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><mn>0.066</mn></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>0.25</mn></mrow></msup></mrow><mn>0.25</mn></mfrac><mo>)</mo></mrow><mn>1.8</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $\\sqrt{\\left< v^2 \\right>}$ is the r.m.s.~peculiar velocity of the host galaxy with respect to the Hubble flow, which we fix at 500 km/s, as a rough estimate.\n\nWe now discuss how to combine the information of all the catalogues pertaining to a given MBHB formation model. In more detail, we\n aim at quantifying the capability of a given eLISA configuration to constrain cosmology with a unified indicator for each of the cosmological models listed in section \\ref{sec:cosmology}. We therefore define a figure of merit (FoM), valid for any cosmological model irrespective of its number of parameters, as\n\n", "itemtype": "equation", "pos": 65632, "prevtext": "\nWhen we consider the optimistic scenario, we divide $\\sigma_{\\rm lens}(z)$ by a factor two. The weak lensing magnification uncertainty can in principle be reduced by directly measuring the inhomogeneities in the mass distribution along the line of sight to the source \\cite{Dalal:2002wh,Gunnarsson:2005qu,Jonsson:2006vc,2011MNRAS.412.1023H}. Moreover, it has been pointed out that the errors due to weak lensing could be reduced with respect to Eq.~(\\ref{eq:propag_error}), \naccounting for the non-Gaussianity of the r.m.s.~of the kappa-distribution \\cite{Hirata:2010ba,Shang:2010ta}.\nCombining this latter effect with a certain amount of de-lensing, which we assume will be feasible in 2034, we forecast that a de-lensing factor of two\n can be taken into account by the time eLISA is launched. \n\nFinally the last term in Eq.~\\eqref{fisher} is the error due to the peculiar velocities of the GW sources.\nIn our analysis we use the fitting formula that appears in \\cite{Kocsis:2005vv}, namely\n\n", "index": 27, "text": "\\begin{equation}\n\t\\sigma_v(z) = d_L(z) \\left[ 1 + \\frac{c\\ (1+z)}{H(z) d_L(z)} \\right] \\frac{\\sqrt{\\left< v^2 \\right>}}{c} \\,,\n\t\\label{eq:pv_error}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{v}(z)=d_{L}(z)\\left[1+\\frac{c\\ (1+z)}{H(z)d_{L}(z)}\\right]\\frac{\\sqrt{%&#10;\\left&lt;v^{2}\\right&gt;}}{c}\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>σ</mi><mi>v</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>d</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><mpadded width=\"+5pt\"><mi>c</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>d</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>]</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><msqrt><mrow><mo>⟨</mo><msup><mi>v</mi><mn>2</mn></msup><mo>⟩</mo></mrow></msqrt><mi>c</mi></mfrac></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $C_{ij}^C=(F_{ij}^C)^{-1}$ is the covariance matrix of the $C$th-catalogue, \nand $N$ is the number of parameters of the cosmological model. The FoM  defined in this way \nis the inverse of the $2N$th-root of the volume of the $N$-dimensional parallelepiped whose sides are the 1$\\sigma$ \nerrors on a suitable combination of the parameters for which there are no correlations. If the errors on the actual cosmological parameters were all equal and uncorrelated, \nthe FoM would give the inverse of their value. In the two-parameter case, the above formula is proportional to \nthe inverse of the square-root of the area of the ellipse whose axes are given, again, by the 1$\\sigma$ error on combinations of the parameters with zero correlation. \nThis coincides with the square-root of the FoM defined in the Euclid Study \nReport \\cite{Laureijs:2011gra} for the parameters $w_p$ and $w_a$ (see sections \\ref{sub:inspiral_only_scenario_} \nand \\ref{sub:merger_and_ring_down_scenario}). Note that the FoM as defined by the \nDark Energy Task Force is different, since it involves the 2$\\sigma$ errors of $w_p$ and $w_a$ \\cite{Albrecht:2006um}. \n\nThe FoM of the Euclid Study Report conveys consistent information on the errors on $w_p$ and $w_a$, because the two parameters are not degenerate. The FoM defined above in the $N$-parameter case cannot be directly related to the errors on the $N$ parameters, except in the unrealistic case in which these are all exactly equal and uncorrelated. However, it is a useful estimator to compare different eLISA configurations among each other and different cosmological models, irrespective of the number of parameters\\footnote{Note that the FoM (\\ref{FoM}) does convey some amount of information on the errors, provided that the degeneracies on the cosmological parameters are the same for each eLISA configuration. In this case, by knowing the FoM and the errors on the cosmological parameters for one configuration as well as\n the FoM for another configuration, we could infer the errors on the cosmological parameters given by the second configuration by applying an appropriate scaling.}. \n\nThe FoM in Eq.~\\eqref{FoM} is calculated for each of the 118 catalogues of the three MBHB formation scenarios, \nand for each eLISA configuration and each cosmological model. \nThe probability distribution function (PDF) of the FoM over the 118 catalogues, for each MBHB formation scenario, \ntwo eLISA configurations and two cosmological models ($\\Lambda$CDM and DDE) \nis shown in Fig.~\\ref{fig:PDF}, which will be discussed in Appendix~\\ref{app:statistics}, considering both the conservative and optimistic scenario.\nIn the following, we want to provide a FoM for the capability of a given eLISA configuration to probe a given cosmological model within a given MBHB formation scenario, i.e.~we need to define one single FoM per configuration, cosmological model and MBHB formation scenario. We choose as representative FoM {\\it the median of the PDF of the FoM of all the catalogues}. When we compare the different eLISA configurations in section~\\ref{sec:FoM}, we will always utilise this median FoM, together with its 10th and 90th percentiles (cf.~Fig.~\\ref{fig:FoM}). This will provide an idea of the statistical uncertainty that we can expect in real measurements. \n\nAs explained above, the FoM in Eq.~\\eqref{FoM} cannot be directly related to the errors on the cosmological parameters for a given configuration: the\n information on the errors is given by the covariance matrix $C_{ij}$, in particular by (the square root of) its diagonal entries. We thus need to combine the covariance matrices of the 118 catalogues, $C_{ij}^C$, in order to have an estimate of the expected errors of a real measurement with a given eLISA configuration (for a given cosmological model and MBHB formation scenario).\nFor an estimate of the expected eLISA $1\\sigma$ errors on the cosmological parameters, we select \n{\\it the median values among the (square roots of the) diagonal entries of the 118 covariance matrices} \n(cf.~Table~\\ref{tab:standard_errors}, which will be discussed in section~\\ref{sec:results}).\nIn this estimate, we discard the cases where the low number of data points does not allow to constrain the \ncosmological parameters\\footnote{See Appendix~\\ref{app:statistics} for more details.}.\nIn these cases, the expected errors on the parameters are formally infinite, corresponding to useless measurements.\nFor each eLISA configuration, cosmological model and MBHB formation model, we provide also the percentage $P$ of catalogues for which this does not happen, i.e.~for which it is possible to constrain the cosmological parameters (cf.~Fig~\\ref{fig:PoM} in Appendix~\\ref{app:statistics}).\nThis ``probability of measurement'' should be considered as a piece of additional \ninformation on the ability to constrain a given cosmological model by a given eLISA configuration. \nThis is indeed because the standard 1$\\sigma$-error estimates provided below are computed by using only the cases where \nfitting of the data is actually possible.\nThe errors on the cosmological parameters provided in the following should therefore \nbe always evaluated {\\it in combination with the corresponding probability $P$} (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).\n\nAlthough an estimate for the standard errors might be defined in this way, in order to plot likelihood contours (``ellipses''), \nwe need a consistent Fisher matrix representative of all the 118 catalogues (for a given cosmological model, MBHB formation model, and eLISA design).\nWe cannot simply take the median of all the covariance matrices entry by entry, \nbecause some of these entries (i.e., those associated with infinite errors) may be ill-defined, and there is no way to access their information on the degeneracies among the parameters.\nFor this reason, to combine the covariance matrices $C_{ij}^C$, we have decided to adopt the following criterion: {\\it we pick as representative covariance matrix the one that gives the closest FoM to the median of the FoM PDF}. This provides us with well-defined covariance matrices, which can be taken to represent both the estimated median errors and the degeneracies among the cosmological parameters.\nNote that instead of taking the median value of the errors, as explained above, we could have used the covariance matrix defined in this way to provide representative errors for each combination of configuration, MBHB formation model and cosmological model.\nHowever this covariance matrix, although well representative of the FoM distribution, still corresponds to a unique realisation of the eLISA data, and is characterised by all its entries and not only by its FoM.\nFor example, two Fisher matrices with a similar FoM might actually present quite different entries, thus giving quite different errors and degeneracies among the parameters, especially if they are in the tails of the FoM distribution.\nFor this reason, we have chosen to use the medians of the errors in all catalogues as their representative, \ninstead of the errors provided by the covariance matrix closest to the median of the FoM PDF.\nIn any case, thanks to the large statistics provided by our catalogues, \nwe have verified that the two procedures give comparable results (see Appendix~\\ref{app:statistics}, in particular~Table~\\ref{tab:errors_scatter}).\n\nTo have an idea of the possible scatter of the cosmological constraints that we can place,\n we refer to Fig.~\\ref{fig:LCDM_percentile} of appendix~\\ref{app:statistics}, where we plot the 2$\\sigma$ likelihood contours in the $\\Lambda$CDM scenario (for the configuration N2A5M5L6 and  the PopIII model) derived from the covariance matrix closest to the median of the FoM PDF, together with those derived from its 20th and 80th percentile. \n\n\n\n\\section{Constraints on cosmological models}\n \\label{sec:results}\n\nWe consider the four cosmological models described at the end of section \\ref{sec:cosmology} (five-parameter, $\\Lambda$CDM with curvature, $\\Lambda$CDM, DDE), and for each of them we present results for two representative configurations: N2A5M5L6 (the old LISA) and N2A2M5L4.\nThe first one gives the best possible result achievable by the eLISA mission (within the considered MBHB models), while the second one represents the worst possible configuration for which independent constraints on the cosmological parameters can be obtained. Worse four-link configurations are unable to constrain cosmology at any level due to the low number of standard sirens (cf.~Fig.~\\ref{fig:ss}).\nWe first discuss the conservative case, in which the sky localisation error is derived using the inspiral phase only. We then move to the optimistic case, in which we also account for merger and ringdown, and we reduce the lensing error by a factor two to mimic de-lensing (see discussion in section \\ref{sec:statistic}). The discussion on the FoM and the comparison among all eLISA configurations is presented in section~\\ref{sec:FoM}.\n\n\\subsection{Conservative scenario (inspiral only)} \n\\label{sub:inspiral_only_scenario_}\n\nTable~\\ref{tab:standard_errors} summarises the standard $1\\sigma$ errors on the cosmological parameters for N2A5M5L6 and N2A2M5L4, for all MBHB formation scenarios and for all cosmological models considered. We also show the errors on $\\Omega_M$ and $\\Omega_\\Lambda$ derived for the case of $\\Lambda$CDM with curvature once we fix the Hubble rate to its fiducial value: this is the relevant case to be compared with SNIa (which probe curvature and acceleration), and we discuss it in section \\ref{sub:compa}. Moreover, we provide the errors\non ${\\Omega_{M}}$, $h$ and $w_0$ once all other parameters but the one under consideration are held fixed: this helps quantify the capability of the given eLISA configuration to constrain these single parameters with respect to other probes; again see section \\ref{sub:compa}.\n\n\\begin{table}\n\\hspace{-0.5cm}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c||c|c|c|c|c|c||c|c|c|c|c|c|}\n\\hline\nModel & \\multicolumn{6}{|c||}{N2A5M5L6} & \\multicolumn{6}{|c|}{N2A2M5L4} \\\\\n\\hline\n\\text{} & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ \\\\\n\\hline\n \\multirow{2}{*}{5} & 100 & 4.31 & 7.16 & 1.58 & 13.2 & 92.3 & 67.8 & 320 & 799 & 47.7 & 344 & 5530 \\\\\n \\multirow{2}{*}{param.} & 100 & 18.0 & 24.9 & 9.95 & 88.6 & 392 & 2.54 & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ \\\\\n & 100 & 2.80 & 5.15 & 0.681 & 4.66 & 55.7 & 68.6 & 138 & 306 & 13.3 & 127 & 2400 \\\\\n\\hline\n \\multirow{2}{*}{$\\Lambda$CDM} & 100 & 0.0819 & 0.281 & 0.0521 & \\text{} & \\text{} & 91.5 & 0.471 & 2.66 & 0.429 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{+ curv.} & 100 & 0.220 & 0.541 & 0.136 & \\text{} & \\text{} & 12.7 & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & \\text{} & \\text{} \\\\\n & 100 & 0.0473 & 0.207 & 0.0316 & \\text{} & \\text{} & 90.7 & 0.174 & 1.26 & 0.145 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & 0.0473 & 0.0473 & 0.0210 & \\text{} & \\text{} & 97.5 & 0.275 & 0.275 & 0.0910 & \\text{} & \\text{} \\\\\n \\text{$\\Lambda$CDM} & 100 & 0.0917 & 0.0917 & 0.0480 & \\text{} & \\text{} & 32.2 & 0.543 & 0.543 & 0.220 & \\text{} & \\text{} \\\\\n & 100 & 0.0371 & 0.0371 & 0.0146 & \\text{} & \\text{} & 99.2 & 0.126 & 0.126 & 0.0400 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & \\text{} & \\text{} & \\text{} & 0.253 & 1.32 & 97.5 & \\text{} & \\text{} & \\text{} & 1.03 & 6.36 \\\\\n \\text{DDE} & 100 & \\text{} & \\text{} & \\text{} & 0.584 & 2.78 & 37.3 & \\text{} & \\text{} & \\text{} & 4.96 & 26.1 \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.176 & 1.00 & 95.8 & \\text{} & \\text{} & \\text{} & 0.427 & 2.87 \\\\\n\\hline\n \\text{Accel.} & 100 & 0.0190 & 0.0735 & \\text{} & \\text{} & \\text{} & 99.2 & 0.211 & 0.396 & \\text{} & \\text{} & \\text{} \\\\\n \\& curv. & 100 & 0.0280 & 0.105 & \\text{} & \\text{} & \\text{} & 37.3 & 0.977 & 1.30 & \\text{} & \\text{} & \\text{} \\\\\n test & 100 & 0.0213 & 0.0631 & \\text{} & \\text{} & \\text{} & 94.1 & 0.116 & 0.202 & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & 0.0173 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0670 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $\\Omega_M$} & 100 & 0.0238 & \\text{} & \\text{} & \\text{} & \\text{} & 53.4 & 0.0755 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n & 100 & 0.0172 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0437 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & 0.00712 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.0146 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $h$} & 100 & \\text{} & \\text{} & 0.00996 & \\text{} & \\text{} & 53.4 & \\text{} & \\text{} & 0.0175 & \\text{} & \\text{} \\\\\n & 100 & \\text{} & \\text{} & 0.00531 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00853 & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & \\text{} & 0.0590 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.121 & \\text{} \\\\\n \\multirow{2}{*}{on $w_0$} & 100 & \\text{} & \\text{} & \\text{} & 0.0786 & \\text{} & 53.4 & \\text{} & \\text{} & \\text{} & 0.146 & \\text{} \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.0467 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0734 & \\text{} \\\\\n\\hline\n\\end{tabular}}\n\\end{center}\n\\caption{Standard 1$\\sigma$ errors on the cosmological parameters in the conservative scenario (inspiral only), for two eLISA configurations and in the four cosmological models considered (five-parameter, $\\Lambda$CDM with curvature, $\\Lambda$CDM, DDE) plus the case $\\Lambda$CDM with curvature in which the Hubble parameter $h$ has been fixed to its fiducial value. We add this case here since it provides the relevant tests of acceleration and curvature to be compared with SNIa; cf.~Fig.~\\ref{fig:SNe_like} and the associated discussion in section~\\ref{sub:compa}. We also add the errors on $\\Omega_M$, $h$ and $w_0$ alone, in order to compare them with SNIa and CMB constraints (section~\\ref{sub:compa}). The fiducial values are $\\Omega_M = 0.3$, $\\Omega_\\Lambda = 0.7$, $h = 0.67$ ($H_0 = 67$ km/s/Mpc), $w_0 = -1$, $w_a=0$. In each row of the table, the top sub-row shows the errors for light seeds (popIII), the central sub-row for heavy seeds with delays (Q3d) and the bottom sub-row for heavy seeds without delays (Q3nod). Blank entries mean that the corresponding parameter has been fixed to its fiducial value (exact prior). To get the errors in the $\\Lambda$CDM model, we impose the flatness constraint $\\Omega_M+\\Omega_\\Lambda =1$, and consequently $\\Delta \\Omega_\\Lambda$ corresponds to $\\Delta \\Omega_M$. The probability $P$ corresponds to the percentage of catalogues with which it is actually possible to measure the parameters.\nThe errors in the table are indeed given only by the median among the catalogues providing a measurement, while in the other cases one obtains infinite errors (see the discussion in section~\\ref{sec:statistic} and in appendix~\\ref{app:statistics}).}\n\\label{tab:standard_errors}\n\\end{table}\n\nIn each entry of Table~\\ref{tab:standard_errors}, the top row shows the errors for light seeds (popIII), the central row for heavy seeds with delays (Q3d) and the bottom row for heavy seeds without delays (Q3nod). Q3nod systematically gives worse results than the other two scenarios -- which are roughly comparable -- due to the lower number of detectable standard sirens, as shown in Fig.~\\ref{fig:ss}. In the following, whenever we need to restrict to one MBHB formation model, we always choose popIII, since it is the intermediate scenario (as far as the number of standard sirens is concerned) among those we consider. The constraints would be comparable or slightly better for model Q3nod. \n\nFrom Table~\\ref{tab:standard_errors}, it appears that even the best eLISA configuration N2A5M5L6 (corresponding to old LISA) is incapable of independently constraining the full five-parameter cosmological model, for which  $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h,\\,w_0,\\,w_a)$ are all free to vary simultaneously. Using eLISA alone, we can only get meaningful constraints on cosmological models described by fewer parameters. This  is indeed also true for all present cosmological probes\\footnote{The errors on the full five parameters model are huge compared to present constraints obtained from the combination of other cosmological probes. Therefore we can speculate that marginalising and combining with other probes would not help improving the present constraints. However, we have not performed the analysis yet, here we present results for eLISA only.}. We therefore need to reduce the number of cosmological parameters, by fixing one or more of them to their fiducial value: from the point of view of the statistical analysis, this is equivalent to imposing an exact prior on those parameters.\n\nThe reduced Fisher matrices for the three-parameter case of $\\Lambda$CDM plus curvature are obtained by removing from the $5 \\times 5$ Fisher matrices the rows and columns corresponding to the parameters that are being fixed: in this case, the dark energy EoS parameters, which take the values $w_0 = -1$ and $w_a = 0$. Similarly, the reduced Fisher matrices for the DDE model are obtained by removing from the $5 \\times 5$ Fisher matrices the rows and columns corresponding to $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$. On the other hand, for the $\\Lambda$CDM scenario we need first to change variables (from $\\Omega_\\Lambda$ to $\\Omega_k = 1- \\Omega_M -\\Omega_\\Lambda$) to impose the flatness constraint $\\Omega_M+\\Omega_\\Lambda =1$ (corresponding to fix $\\Omega_k = 0$), and get the Fisher matrices for the 2-parameters $({\\Omega_{M}},\\,\\,h)$.\n\nNote that the four-link configuration N2A2M5L4 does not provide useful constraints on any cosmological model. This is because for this configuration the number of standard sirens with ${\\rm SNR}>8$ and $\\Delta\\Omega<10~{\\rm deg}^2$ is small in the conservative scenario under analysis here (cf.~Fig.~\\ref{fig:ss} and the discussion in section \\ref{sec:counter}). The situation will change in the optimistic scenario discussed in section \\ref{sub:merger_and_ring_down_scenario}.\n\n\\subsubsection*{$\\Lambda$CDM plus curvature $(\\Omega_M, \\Omega_\\Lambda, h)$} \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{3p_ellipses.pdf}\n\\end{center}\n\\caption{Marginalised likelihood contours (1 and 2$\\sigma$) for the three-parameter cosmological model ($\\Lambda$CDM plus curvature)  in the conservative scenario, with configuration N2A5M5L6. We show all three MBHB formation models. }\n\\label{fig:Ellipses_3_parameters}\n\\end{figure}\n\nThe first cosmological model that we consider describes a universe with dark matter, dark energy fixed to a CC, and non-vanishing spatial curvature.\nThe free parameters of the model are $\\Omega_M$, $\\Omega_\\Lambda$ and $h$ and their standard 1$\\sigma$ errors can be read from the second row of Table~\\ref{tab:standard_errors}, for each MBHB formation scenario.\nIn Fig.~\\ref{fig:Ellipses_3_parameters} we plot the likelihood contours (ellipses) for N2A5M5L6 and for all three MBHB formation scenarios. \nTo find the $2 \\times 2$ marginalised Fisher matrices used in this plot, we remove from the $3\\times 3$ ``representative'' covariance matrix (i.e., the one that gives the closest FoM to the median of the FoM PDF) the row and column of the parameter over which we are marginalising, and then invert the $2\\times 2$ matrix obtained in this way to get the new Fisher matrices from which the ellipses are drawn. \n\nIn the $\\Lambda$CDM model plus curvature (also called sometimes the $o$CDM model, see e.g.~\\cite{Betoule:2014frx}), it is customary to provide the errors on the curvature rather than on $\\Omega_\\Lambda$. In Table~\\ref{tab:Omk} we therefore give the errors on the parameter $\\Omega_k$, which are orders of magnitude higher than those obtained by CMB analysis (cf.~for example \\cite{Ade:2015xua}). \n\nIt is clear that not even the best eLISA configuration will be able to constrain the cosmological model $\\Lambda$CDM plus curvature to a degree comparable with present constraints: these, according to \\cite{Betoule:2014frx}, are at the level of 1-3\\% by combining SNIa+Planck+BAO. \nOn the other hand, once combined with other probes, eLISA in its best configuration may help break the degeneracies among the parameters, in the most favourable scenarios of MBHB formation. eLISA constraints can also naturally complement present electromagnetic measurements, since the redshift range tested by MBHB standard sirens will be much larger (up to $z\\sim 8$) and thus affected by different degeneracies in the parameter space.\nThe combination of eLISA results with other cosmological probes may thus provide new interesting information. \n\nMoreover, eLISA could give a fully independent constraint on the Hubble parameter, complementary to other direct (optical) measurements. Even though the errors on $h$ are quite high ($\\sim 5$\\%) compared to other cosmological probes, also in the most favourable MBHB formation models/configurations, \nit is still remarkable that the eLISA mission may potentially measure this parameter, which cannot be independently measured by SNIa observations.\nAs we will see, the errors on $h$ are even lower for cosmological models with fewer parameters. \n\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c|}\n\\hline\n \\text{} & N2A5M5L6 & N2A5M5L4 \\\\\n\\hline\n \\text{} \t\t  & 0.202 & 2.23 \\\\\n $\\Delta\\Omega_k$ & 0.349 & $\\gg 10^4$ \\\\\n  \\text{} \t\t  & 0.172 & 1.25 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Errors on the curvature $\\Omega_k$ in the three parameter model $\\Lambda$CDM model plus curvature, in the conservative scenario. The fiducial value is zero. The top row shows the error for popIII, the central row for Q3d and the bottom row for Q3nod. }\n\\label{tab:Omk}\n\\end{table}\n\n\n\\subsubsection*{$\\Lambda$CDM $(\\Omega_M, h)$} \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{LCDM.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for $\\Lambda$CDM cosmology in the conservative scenario, with N2A5M5L6, for the three MBHB formation models. We have imposed flatness through $\\Omega_\\Lambda+ \\Omega_M=1$ and fixed $w_0=-1$, $w_a=0$.}\n\\label{fig:LCDM}\n\\end{figure}\n\nThe standard 1$\\sigma$ uncertainties in the $\\Lambda$CDM model, characterised by the two parameters $\\Omega_M$ and $h$, are given in the third row of Table~\\ref{tab:standard_errors}. The $\\Lambda$CDM model is evidently much better constrained than the three-parameter one: in the popIII MBHB formation model, N2A5M5L6 gives constraints at the level of 16\\% on $\\Omega_M$ and 3\\% on $h$. \nN2A2M5L4 still does not provide useful constraints, even though the measurement of $h$ starts to become slightly more significant.\nFig.~\\ref{fig:LCDM} shows the likelihood contours in the $(\\Omega_M, h)$ parameter space for N2A5M5L6. Again, it is apparent that the constraints are much weaker in model Q3d, but in the other two scenarios they are tighter. \n\n\\subsubsection*{DDE $(w_0, w_a)$} \n\nThe ability of any eLISA configuration to constrain DDE is severely limited by the small expected number of MBHBs detected at low redshift (see Fig.~\\ref{fig:data} for an example). This is even more true for the conservative scenario under analysis here. \nThe best we can expect, using N2A5M5L6 alone, is a FoM as defined by the Euclid Study Report of about 9 (which corresponds to FoM=3 in our definition, cf.~Fig.~\\ref{fig:FoM}).\nAs can be seen from Table~\\ref{tab:standard_errors}, in this best situation, eLISA can provide an independent constrain on $w_0$ of 18\\%, while the standard 1$\\sigma$ deviation on $w_a$ cannot be better than 1.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{DE.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model $(w_0, w_a)$, in the conservative scenario, for the three MBHB formation models, with N2A5M5L6 (the other cosmological parameters being fixed to their fiducial values).}\n\\label{fig:DE}\n\\end{figure}\n\nIn Fig.~\\ref{fig:DE} we have plotted the likelihood contours in the $(w_0, w_a)$ parameter space for N2A5M5L6 (while those for N2A2M5L4 are considerably worse and are not shown).\nFrom this figure, it appears that a strong degeneracy is present between the two parameters $(w_0, w_a)$.\nTo get rid of this degeneracy, a usual approach is to change variable from $w_0$ to $w_p = w_0 + z_p/(z_p+1)\\, w_a$, that is not correlated with $w_a$\nfor a suitable choice of the pivot redshift $z_p$ \\cite{Albrecht:2006um}. Physically, $w_p$ is the DE equation of state parameter at the pivot redshift, i.e.~the redshift at which one can make the best measurement of $w$, defined by $z_p=-[1+\\Delta w_a/(\\rho \\Delta w_0)]^{-1}$ where $\\rho$ is the correlation coefficient of $w_0$ and $w_a$. Fig.~\\ref{fig:wp} shows the likelihood contours in the uncorrelated variables $(w_p,\\,w_a)$. From Table~\\ref{tab:pivot} it appears that N2A5M5L6 can measure $w_p$ at the level of 4-6\\%, while $\\Delta w_a=1$ for the most favourable MBHB formation model\\footnote{Note that the errors on $w_a$ given in Table~\\ref{tab:pivot} slightly differ from those given in Table~\\ref{tab:standard_errors}: this is because they are taken from the covariance matrix used to make the plots in Fig.~\\ref{fig:wp} (the one giving the FoM closest to the median of the FoM PDF), while Table~\\ref{tab:standard_errors} reports the median of the errors in all catalogues.}.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{wp_3.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model with N2A5M5L6 in the $w_p$ and $w_a$ variables, in the conservative scenario, for the three MBHB formation models (the other cosmological parameters being fixed to their fiducial values). }\n\\label{fig:wp}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c||c|c|c|}\n\\hline\n \\multicolumn{3}{|c||}{N2A5M5L6} & \\multicolumn{3}{|c|}{N2A2M5L4} \\\\\n\\hline\n $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ & $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ \\\\\n\\hline\n 0.206 & 0.0617 & 1.30 & 0.203 & 0.138 & 5.57 \\\\\n 0.249 & 0.0824 & 2.60 & 0.227 & 0.162 & 32.9 \\\\\n 0.200 & 0.0423 & 1.09 & 0.104 & 0.0881 & 2.29 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Pivot redshift and errors on $(w_p,\\,w_a)$  for the conservative scenario. For both eLISA configurations, the top row shows the case of popIII, the central row Q3d and the bottom row Q3nod. }\n\\label{tab:pivot}\n\\end{table}\n\nNote that constraining the evolution of $w$ is notoriously difficult. The above quoted errors are in line with those of other present cosmological probes: see for example \\cite{Betoule:2014frx} and \\cite{Aubourg:2014yra}. In these references the other parameters of the $\\Lambda$CDM model ($\\Omega_M,\\, h$) are not fixed as we do here, but the analysis is done in combination  with the Planck data: this practically amounts to set a very stringent prior on them.\nWe therefore forecast that eLISA in its best configurations with six links, when combined with other cosmological probes, will be able to help reducing the errors on $w_p$ and $w_a$ in the DDE scenario. The combined analysis will be the subject of future studies, although by the time eLISA is launched, Euclid may already have provided constraints at the level of $\\Delta w_a=0.1$ \\cite{Laureijs:2011gra}.  \n\n\n\\subsection{Optimistic scenario (with merger \\& ringdown and de-lensing)} \n\\label{sub:merger_and_ring_down_scenario}\n\nTable~\\ref{tab:standard_errors_opt} summarises the standard $1\\sigma$ errors on the cosmological parameters for N2A5M5L6 and N2A2M5L4, for all MBHB formation scenarios and for all cosmological models considered, exactly as in section \\ref{sub:inspiral_only_scenario_} (cf.~Table~\\ref{tab:standard_errors}). As before, even the best configuration N2A5M5L6 cannot constrain the full five-parameter cosmological model. Conversely, the situation improves significantly for the other models with respect to the conservative scenario: in particular, the most striking improvement is with configuration N2A2M5L4 in model Q3d. \n\nIn the $\\Lambda$CDM plus curvature model, the errors improve by about a factor of two for N2A5M5L6. In particular, $h$ can be measured with a 2.7\\% accuracy in the best-case scenario of Q3nod, and this goes down to about 1\\% in pure $\\Lambda$CDM when ${\\Omega}_k= 0$. This level of precision is comparable to the one of present {\\it combined} probes SNIa+Planck+BAO \\cite{Betoule:2014frx}. The 1 and 2-$\\sigma$ contours are shown in Fig.~\\ref{fig:Ellipses_3_parameters_opt} for the $\\Lambda$CDM plus curvature model (Table~\\ref{tab:Omk_opt} shows the errors on $\\Omega_k$) and in Fig.~\\ref{fig:LCDM_opt} for the $\\Lambda$CDM model. Here we show also the contours for N2A2M5L4, since in the optimistic scenario the situation considerably improves for this four-link configuration: in almost 100\\% of catalogues, N2A2M5L4 can constrain ${\\Omega_{M}}$ to about 50\\% and $h$ to about 10\\% in the most unfavourable model of MBHB formation, Q3d. These errors are still very large, but compared to the conservative case, in which there was no possibility of measurement, they show {\\it the high improvement that can be obtained if a few more standard sirens are available} (thanks to the addition of merger and ringdown in the sky localisation). \n\nThe precision in the measurement of DDE also raises substantially. The 1 and 2-$\\sigma$ contours are shown in Fig.~\\ref{fig:DE_opt} for $w_0$ and $w_a$, and in Fig.~\\ref{fig:wpMR} for the uncorrelated variables $w_p$ and $w_a$ at the pivot redshift. Table~\\ref{tab:pivot_opt} gives the errors on $w_p$ and $w_a$.\nAgain the limitation in constraining the dark energy EoS derives from the low number of data points at low redshift.\nNevertheless, in the optimistic scenario it might be possible to reach FoM$\\sim 7$ with the best six-link configurations (cf.~Fig.~\\ref{fig:FoM}), corresponding to a FoM as defined by the Euclid Study report of about 50.\nFrom Table~\\ref{tab:standard_errors_opt} we see that in the best situation (Q3nod and N2A5M5L6) one can now reach 10\\% errors on $w_0$ and a 1$\\sigma$ uncertainty on $w_a$ around 0.5, roughly corresponding to a factor 2 improvement with respect to the conservative scenario (cf.~section~\\ref{sub:inspiral_only_scenario_}).\nSimilarly, from Table~\\ref{tab:pivot_opt} one can see that N2A5M5L6 might be able to constrain $w_p$ at the level of 2-4\\%.\nThese errors are comparable to the ones obtained by other present cosmological probes (see e.g.~\\cite{Betoule:2014frx,Aubourg:2014yra}), meaning that eLISA, at least in its best configurations, may prove useful to reduce the uncertainty on the cosmological parameters if a combined analysis is performed. By the time eLISA is launched, much stronger constraints are expected from Euclid \\cite{Laureijs:2011gra}; on the other hand, the eLISA mission will be capable of providing constraints which do not solely depend on EM observations.\n\n\\begin{table}\n\\hspace{-0.5cm}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c||c|c|c|c|c|c||c|c|c|c|c|c|}\n\\hline\nModel & \\multicolumn{6}{|c||}{N2A5M5L6} & \\multicolumn{6}{|c|}{N2A2M5L4} \\\\\n\\hline\n\\text{} & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ \\\\\n\\hline\n \\multirow{2}{*}{5} & 100 & 2.51 & 4.40 & 0.951 & 8.01 & 55.2 & 80.5 & 120 & 253 & 24.8 & 177 & 2230 \\\\\n \\multirow{2}{*}{param.} & 100 & 4.64 & 6.90 & 2.58 & 22.4 & 103 & 44.1 & 1480 & 3250 & 371 & 2350 & $\\gg 10^4$ \\\\\n & 100 & 1.05 & 1.97 & 0.265 & 2.07 & 21.2 & 93.2 & 12.6 & 27.8 & 2.08 & 15.9 & 227 \\\\\n\\hline\n \\multirow{2}{*}{$\\Lambda$CDM} & 100 & 0.0467 & 0.155 & 0.0299 & \\text{} & \\text{} & 96.6 & 0.315 & 1.51 & 0.228 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{+ curv.} & 100 & 0.0875 & 0.209 & 0.0527 & \\text{} & \\text{} & 77.1 & 0.396 & 1.61 & 0.306 & \\text{} & \\text{} \\\\\n & 100 & 0.0265 & 0.0914 & 0.0161 & \\text{} & \\text{} & 99.2 & 0.0610 & 0.342 & 0.0520 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & 0.0267 & 0.0267 & 0.0121 & \\text{} & \\text{} & 99.2 & 0.121 & 0.121 & 0.0445 & \\text{} & \\text{} \\\\\n \\text{$\\Lambda$CDM} & 100 & 0.0368 & 0.0368 & 0.0199 & \\text{} & \\text{} & 90.7 & 0.151 & 0.151 & 0.0681 & \\text{} & \\text{} \\\\\n & 100 & 0.0186 & 0.0186 & 0.00803 & \\text{} & \\text{} & 100 & 0.0464 & 0.0464 & 0.0159 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & \\text{} & \\text{} & \\text{} & 0.149 & 0.798 & 98.3 & \\text{} & \\text{} & \\text{} & 0.507 & 3.09 \\\\\n \\text{DDE} & 100 & \\text{} & \\text{} & \\text{} & 0.241 & 1.14 & 89.0 & \\text{} & \\text{} & \\text{} & 0.777 & 4.06 \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.101 & 0.544 & 99.2 & \\text{} & \\text{} & \\text{} & 0.201 & 1.20 \\\\\n\\hline\n \\text{Accel.} & 100 & 0.0105 & 0.0412 & \\text{} & \\text{} & \\text{} & 99.2 & 0.0660 & 0.174 & \\text{} & \\text{} & \\text{} \\\\\n \\& curv. & 100 & 0.00972 & 0.0429 & \\text{} & \\text{} & \\text{} & 84.7 & 0.0544 & 0.161 & \\text{} & \\text{} & \\text{} \\\\\n test & 100 & 0.00887 & 0.0310 & \\text{} & \\text{} & \\text{} & 99.2 & 0.0381 & 0.0804 & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & 0.00966 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0319 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $\\Omega_M$} & 100 & 0.00935 & \\text{} & \\text{} & \\text{} & \\text{} & 94.1 & 0.0283 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n & 100 & 0.00788 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0199 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & 0.00412 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00850 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $h$} & 100 & \\text{} & \\text{} & 0.00446 & \\text{} & \\text{} & 94.1 & \\text{} & \\text{} & 0.00937 & \\text{} & \\text{} \\\\\n & 100 & \\text{} & \\text{} & 0.00307 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00485 & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & \\text{} & 0.0342 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0678 & \\text{} \\\\\n \\multirow{2}{*}{on $w_0$} & 100 & \\text{} & \\text{} & \\text{} & 0.0368 & \\text{} & 94.1 & \\text{} & \\text{} & \\text{} & 0.0729 & \\text{} \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.0254 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0416 & \\text{} \\\\\n\\hline\n\\end{tabular}}\n\\end{center}\n\\caption{Same as Table~\\ref{tab:standard_errors}, but in the optimistic scenario (merger ad ringdown plus de-lensing). }\n\\label{tab:standard_errors_opt}\n\\end{table}\n\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{3p_ellipses_opt.pdf}\n\\end{center}\n\\caption{Marginalised likelihood contours (1 and 2$\\sigma$) for the three-parameter cosmological model ($\\Lambda$CDM plus curvature) in the optimistic scenario, with configuration N2A5M5L6. We show all three MBHB formation models. }\n\\label{fig:Ellipses_3_parameters_opt}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c|}\n\\hline\n \\text{} & N2A5M5L6 & N2A5M5L4 \\\\\n\\hline\n \\text{} \t\t  & 0.109  & 1.38 \\\\\n $\\Delta\\Omega_k$ & 0.125  & 1.10 \\\\\n  \\text{} \t\t  & 0.0713 & 0.305 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Errors on the curvature $\\Omega_k$ in the three parameter model $\\Lambda$CDM model plus curvature, for the optimistic scenario. The fiducial value is zero. For both eLISA configurations, the top row shows the error for popIII, the central row forQ3d and the bottom row for Q3nod. }\n\\label{tab:Omk_opt}\n\\end{table}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{LCDM_opt_with_L4.pdf} \n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for $\\Lambda$CDM cosmology in the optimistic scenario, with both N2A5M5L6 and N2A2M5L4, for the three MBHB formation models. We have imposed flatness through $\\Omega_\\Lambda+ \\Omega_M=1$ and fixed $w_0=-1$, $w_a=0$.}\n\\label{fig:LCDM_opt}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{DE_opt.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model ($w_0, w_a$), in the optimistic scenario, for the three MBHB formation models, with N2A5M5L6 (the other cosmological parameters being fixed to their fiducial values).}\n\\label{fig:DE_opt}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{wp_3_opt.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model with N2A5M5L6 in the $w_p$ and $w_a$ variables, in the optimistic scenario, for the three MBHB formation models (the other cosmological parameters being fixed to their fiducial values). }\n\\label{fig:wpMR}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c||c|c|c|}\n\\hline\n \\multicolumn{3}{|c||}{N2A5M5L6} & \\multicolumn{3}{|c|}{N2A2M5L4} \\\\\n\\hline\n $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ & $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ \\\\\n\\hline\n 0.244 & 0.0413 & 0.665 & 0.193 & 0.0626 & 3.34 \\\\\n 0.264 & 0.0401 & 1.06 & 0.239 & 0.0830 & 3.30 \\\\\n 0.228 & 0.0248 & 0.559 & 0.194 & 0.0455 & 1.14 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Pivot redshift and errors on $(w_p,\\,w_a)$ for the optimistic scenario. For both eLISA configurations, the top row shows the case popIII, the central row the case Q3d and the bottom row the case Q3nod. }\n\\label{tab:pivot_opt}\n\\end{table}\n\n\n\\subsection{Comparison with other probes and constraints on single parameters} \n\\label{sub:compa}\n\nWe end the discussion on the constraints on cosmological parameters by analysing some cases which are instructive for direct comparison with other probes. We use as reference analyses those of \\cite{Betoule:2014frx} for SNIa and of \\cite{Ade:2015xua} for CMB. \n\nLet us first analyse the case of $\\Lambda$CDM with curvature, once we fix the Hubble rate to its fiducial value; cf.~row five of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}. This is the usual test of acceleration and curvature, to be compared with the results of SNIa (see for example the discussion in section 6 of \\cite{Betoule:2014frx}).\nIn the conservative scenario, from Table~\\ref{tab:standard_errors} it appears that  N2A5M5L6 may constrain $\\Omega_M$ at the level of 7-8\\% and $\\Omega_\\Lambda$ at the level of 10-11\\% in the popIII and Q3nod models, while in Q3d one obtains slightly worse results. \nN2A2M5L4 worsens these constraints by about one order of magnitude: in the most favourable case (Q3d) one can only achieve uncertainties around 40\\% for $\\Omega_M$ and around 70\\% for $\\Omega_\\Lambda$, highlighting the difficulties encountered with four-link configurations in the conservative scenario. \nOn the other hand, in the optimistic scenario, from Table~\\ref{tab:standard_errors_opt} one can notice that N2A5M5L6 manages to constrain $\\Omega_M$ at the level of 3\\% and $\\Omega_\\Lambda$ at the level of 5-6\\% in all models, while N2A5M5L6 can only reach 13\\% for $\\Omega_M$ and 11\\% for $\\Omega_\\Lambda$ in Q3nod. These values become respectively 22\\% and 25\\% for the least favourable MBHB formation model, Q3d.\n\nIf one excludes four-link configurations in the conservative scenario, these errors are competitive to, if not better than, the SNIa results as given e.g.~in \\cite{Betoule:2014frx}, especially in the case of the best eLISA configuration and the most favourable MBHB formation models. Likelihood contours for the PopIII model are shown in Fig.~\\ref{fig:SNe_like}, for both the conservative and optimistic scenarios.\nThese contours are much better than the ones obtained with present SNIa data, as one can realise by comparing for example with Fig.~15 of \\cite{Betoule:2014frx}.\nAn important point here is that the degeneracy among $({\\Omega}_M,\\,{\\Omega}_\\Lambda)$ is different from the one of SNIa. Since MBHB standard sirens are visible at higher redshift than SNIa, the likelihood contours for eLISA are less tilted than those for SNIa, as explained in \\cite{Goobar:1995af}. Moreover, the degeneracy among these parameters for the CMB combined with BAO measurements is in the opposite direction: cf.~for example Fig.~15 of \\cite{Betoule:2014frx}. This means that {\\it combining eLISA measurements with SNIa, CMB and BAO will help break the degeneracy in $({\\Omega}_M,\\,{\\Omega}_\\Lambda)$ and will provide even stronger constraints on the acceleration of the universe}.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=.8\\textwidth]{SNe_like.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours in the $\\Lambda$CDM with curvature model but with fixed Hubble rate $h=0.67$ (its fiducial value). This contours can be compared directly with the results of SNIa.}\n\\label{fig:SNe_like}\n\\end{figure}\n\nAnother comparison that can be done with SNIa concerns the value of ${\\Omega}_M$. Ref.~\\cite{Betoule:2014frx} gives the measurement ${\\Omega}_M=0.294\\pm0.034$ from SNIa only in the $\\Lambda$CDM case. This has to be compared with the errors in row six of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}, i.e.~the $\\Lambda$CDM case fixing the Hubble constant to its fiducial value (SNIa in fact do not provide a measurement of the Hubble constant, cf.~section 6 of \\cite{Betoule:2014frx}). It appears that {\\it eLISA can always constrain ${\\Omega}_M$ at a better level than present SNIa}, except in the conservative scenario with N2A2M5L4, where the error is roughly twice the SNIa one. \nMore quantitatively, in model Q3nod with N2A5M5L6, one can reach an error of 5.7\\% in the conservative scenario and 2.6\\% in the optimistic one, thus performing much better than the 11.5\\% obtained by present SNIa alone, though not competitive with Planck results \\cite{Ade:2015xua}.\n\nConcerning dark energy, the comparison with present observations is discussed at the end of sections \\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}. Since many cosmological studies, especially previous LISA forecasts \\cite{VanDenBroeck:2010fp,Petiteau:2011we}, also consider models in which the EoS of dark energy is a single parameter (without running), in Tables~\\ref{tab:standard_errors} and \\ref{tab:standard_errors_opt} we have provided the errors that eLISA can obtain once all parameters, except $w_0$, are fixed to their fiducial values. For N2A5M5L6, these are of the order of 5-8\\% in the conservative scenario and 2.5-4\\% in the optimistic one, in agreement with what found in \\cite{Petiteau:2011we}.\n\nFinally, we want to asses the capability of eLISA to constrain the Hubble constant. We consider the $\\Lambda$CDM model with ${\\Omega}_M$ fixed: the errors are given in row seven of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}.\nIn the conservative scenario, N2A5M5L6 can constrain $h$ to 0.8\\% in the  Q3nod model and to 1.5\\% in the Q3d model, while for N2A2M5L4 the constraints worsen to 1.3\\% in Q3nod and to 2.6\\% Q3d. On the other hand, for the optimistic scenario, N2A5M5L6 can constrain $h$ up to 0.45\\% in Q3nod and to 0.67\\% in Q3d, while for N2A2M5L4 the constraints worsen to the range 0.7-1.4\\%.\n\nThese errors are better than, or at least competitive with, the last CMB measurement (Planck 2015), which is at the level of 1.3\\%: from Ref.~\\cite{Ade:2015xua}, $h=0.678\\pm 0.009$. Note, however, that the quoted Planck measurement is derived by marginalising over all other parameters of the $\\Lambda$CDM model (which are six for the CMB), while here we fix them. The marginalised $\\Lambda$CDM constraints for eLISA are slightly worse than the CMB one, except in the optimistic scenario for N2A5M5L6; see sections \\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}.\nThe relevant point is that {\\it eLISA can provide a competitive constraint on $h$, fully independent from other cosmological probes since it does not relies solely on optical measurements}. This will be particularly important given the present tension on the value of $h$ between the CMB, BAO, and cosmic distance ladder data sets (see e.g.~the discussions in \\cite{Ade:2015xua} and in \\cite{Bennett:2014tka}).\n\n\n\\section{Figures of merit and comparison of eLISA configurations}\n\\label{sec:FoM}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{FoMs.pdf}\n\\end{center}\n\\caption{Figures of merit as defined in Eq.~\\eqref{FoM}, for each eLISA configuration, the three MBHB formation scenarios and two of the considered cosmological models: $\\Lambda$CDM and DDE. We show the representative FoM (which corresponds to the median of the PDF of the FoM, see section \\ref{sec:statistic}), together with the 10th and 90th percentile (respectively, the lower and upper (grey) points for each configuration). On the left panels we present the FoM for the inspiral only scenario (conservative), while on the right ones we present the FoM for the merger \\& ringdown scenario (optimistic).}\n\\label{fig:FoM}\n\\end{figure} \n\nThe FoM as defined in section \\ref{sec:statistic} can be used as an estimator to compare possible eLISA configurations in their capability to test cosmology. In Fig.~\\ref{fig:FoM} we show the FoM for each eLISA configuration, two cosmological models ($\\Lambda$CDM and DDE), the three MBHB formation models and both the conservative and optimistic scenarios. As explained in section \\ref{sec:statistic}, our simulated catalogues have a considerable scatter: we thus choose as representative the FoM that corresponds to the median of the PDF of the FoMs, but in Fig.~\\ref{fig:FoM} we also show the 10th and 90th percentiles to give an idea of the scatter.\n\nThe absolute value of the FoMs in Fig.~\\ref{fig:FoM} cannot be directly related to the error on the cosmological parameters, because of the well known degeneracies among them. However, their relative values can be used as indicators of the ability of eLISA configurations to constrain different cosmological models.\nIt is clear from Fig.~\\ref{fig:FoM} that $\\Lambda$CDM is always better constrained than the DDE model. In fact, this latter model is better tested by sources at low redshift, which are rare for the MBHB standard sirens considered in our analysis. Note that this is the only cosmological model for which the FoM can be directly compared with the errors on $w_p$ and $w_a$, and corresponds to the square root of the FoM defined in the Euclid Study Report \\cite{Laureijs:2011gra} (cf.~sections~\\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}).\n\nRegarding the MBHB formation scenarios, we see from Fig.~\\ref{fig:FoM} that in general the Q3nod model systematically gives the best results, while the Q3d model always gives the worse results (although in the optimistic scenario, the results provided by Q3d are comparable with the ones provided by popIII). The reason for this resides in the fact that the three scenarios predict quite different numbers of detectable MBHB events, and therefore of useful standard sirens, as clearly shown in Fig.~\\ref{fig:ss} (cf.~section~\\ref{sec:counter}).\n\nFor what concerns the different eLISA configurations, Fig.~\\ref{fig:FoM} shows that the trend does not depend much on the cosmological model. All eLISA configurations with six links, apart from N1A1M5L6 and perhaps N1A2M5L6, have roughly similar FoMs, especially in the optimistic scenario, and therefore have on average the same constraining power on cosmology. In addition, the best configuration with four links (N2A5M5L4) is at the same level as these; note however that this configuration is technically very challenging, due to the length of the arms.\nThe results that one can obtain with N2A2M5L4 depend on the MBHB formation model: in Q3d, this configuration has no constraining power, while it improves for the other MBHB formation models. Moreover, in the popIII and Q3nod scenarios, the constraining power of N2A2M5L4 is roughly similar to that of the worst configuration with six links (N1A1M5L6), implying that the errors of the latter are expected to be comparable to the ones presented in Table~\\ref{tab:standard_errors} (though slightly worse) and Table~\\ref{tab:standard_errors_opt} (though slightly better).\nAll other L4 configurations give basically no constraints on cosmology: the resulting errors on the parameters are always worse than 100\\% and formally infinite in most cases, corresponding to no constraints (cf.~Fig.~\\ref{fig:PoM}).\nThis is mainly due to the low number of standard sirens detected with these configurations (cf.~Fig.~\\ref{fig:ss}), as a result of their low sensitivity and, critically, lack of angular resolution.\n\nWhen we analysed detector performances in the previous section, we focused on N2A5M5L6 and N2A2M5L4, having in mind that they respectively provide the best and worst possible cosmological constraints (other four-link configurations being unable to constrain cosmology at any level).\nFig.~\\ref{fig:FoM} confirms this statement, but also shows that in both the conservative and optimistic scenarios, the best four six-link configurations and the best four-link one all provide comparable constraints, being their FoMs approximately similar.\nN1A2M5L6 instead yields slightly worse constraints, especially in the Q3d case and in the conservative scenario, while the results obtained with N1A1M5L6 and N2A2M5L6 are even worse.\nWith all remaining four-link configurations it is impossible to do cosmology.\nFocusing on N2A5M5L6 and N2A2M5L4 we therefore provide results that are representative of almost all possible eLISA configurations, as summarised in Table~\\ref{tab:eLISA_configurations}. Moreover, the choice of N2A5M5L6 is motivated by the fact that it corresponds to the old LISA configuration (namely the best possible one), while N2A2M5L4 is a reasonable design for a de-scoped mission (as mentioned before, N2A5M5L4 is technically much more challenging).\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|}\n\\hline\nN2A5M5L6 & \\multirow{5}{7.5cm}{Constraints comparable to or slightly worse than N2A5M5L6 (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).} \\\\\nN2A2M5L6 & \\\\\nN2A1M5L6 & \\\\\nN1A5M5L6 & \\\\\nN2A5M5L4 & \\\\\n\\hline\n\\multirow{2}{*}{N1A2M5L6} & \\multirow{1}{7.5cm}{Constraints worse than N2A5M5L6, but better than N2A2M5L4.} \\\\\n& \\\\\n\\hline\nN1A1M5L6 & \\multirow{2}{7.5cm}{Constraints comparable to or slightly better than N2A2M5L4 (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).} \\\\\nN2A2M5L4 & \\\\\n\\hline\nN2A1M5L4 & \\multirow{4}{7.5cm}{Constraints worse than N2A2M5L4 or no constraints at all.} \\\\\nN1A5M5L4 & \\\\\nN1A2M5L4 & \\\\\nN1A1M5L4 & \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Comparison of different eLISA configurations in constraining cosmology (see section~\\ref{sec:FoM}).}\n\\label{tab:eLISA_configurations}\n\\end{table}\n\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nThis work has been devoted to the investigation of one of the possible cosmological implications of the eLISA mission, namely the constraints that can be put on the cosmological parameters by using GW standard sirens. Considering three models for the MBHB formation (heavy seeds without delays, heavy seeds with delays and popIII stars), we have produced catalogues of MBHB events and selected those for which a counterpart may realistically be observed, according to the procedure outlined in section~\\ref{sec:counterparts}. The main issue for the identification of a counterpart resides in the capability of obtaining a sufficiently accurate sky localisation: in this respect, we have considered both a conservative and an optimistic scenario. In the first one the sky localisation error is assumed to be determined only by the analysis of the inspiral waveforms; in the second one, by \nanalysing the whole waveforms including also the merger and ringdown phases. In this latter scenario we have also assumed a de-lensing by a factor of two (see discussion in section \\ref{sec:statistic}). \n\nIf only the inspiral phase can be used to localise the counterpart, fewer standard siren events are available to constrain cosmology. In this case, we have found that meaningful constraints can be provided only by the six-link configurations with best noise level (N2), or by N1A5M5L6 and N2A5M5L4. This is true in all the three MBHB formation models, though Q3d gives slightly worse results. For all cosmological models considered, the constraints on the parameters by eLISA alone are systematically worse than the current ones, obtained by combining different cosmological probes (SNIa, CMB and BAO). However, even in this conservative scenario, eLISA can be used to set an independent (i.e., not relying exclusively on electromagnetic measurements) constraint on the Hubble parameter at the level of 1-2\\%, depending on the mission configuration (with all other parameters fixed to their best fit value). On the other hand, due to the small number of low redshift events, the constraints in the conservative scenario on DDE are not competitive with present combined constraints, and will therefore not be relevant by the time eLISA is launched, i.e.~after Euclid.  \n\nIf the error on the sky location can be reduced by including the merger and ringdown phases, and a de-lensing by a factor two can be taken into account, the power of eLISA to constrain cosmological parameters considerably improves. All six-link configurations can provide significant constraints, together with the best two four-link configurations (N2A5M5L4 and N2A2M5L4). Therefore, besides improving the overall constraining power of the configurations that were relevant in the conservative scenario, one also gains three other potentially useful configurations: N1A2M5L6, N1A1M5L6 and N2A2M5L4. The measurement of the Hubble parameter can reach a precision of 1-3\\% depending on the MBHB formation model in the $\\Lambda$CDM scenario, i.e.~without fixing $\\Omega_M$, for all six-link configurations with the best noise level, plus N1A5M5L6 and N2A5M5L4. This goes down to 0.45-0.7\\% if one fixes $\\Omega_M$ to its fiducial value, providing therefore a measurement of $h$ far more precise than current constraints. For the remaining interesting configurations (N1A2M5L6, N1A1M5L6 and N2A2M5L4) these errors degrade by a factor $\\sim 2$--3.\nMoreover, DDE can be probed in the optimistic scenario to a level comparable with present constraints: down to 2-4\\% for $w_p$ with $\\Delta w_a=$0.5--1, depending on the MBHB formation model, for all six-link configurations with the best noise level, plus N1A5M5L6 and N2A5M5L4. The remaining N1A2M5L6, N1A1M5L6 and N2A2M5L4 configurations give 4-8\\% accuracy on $w_p$ and $\\Delta w_a=$1--3. \n\nAs for the constraints on $\\Omega_M$, even in the best case scenario, namely with the N2A5M5L6 configuration, the Q3nod model, and fixing all other cosmological parameters, one can at most reach a precision of 2.6\\%: yet not comparable to the one of CMB measurements (which is at the level of 0.4\\%), but better than the one reached by present SNIa catalogues (which is at the level of 11\\%).\nThe constraints in the $(\\Omega_M, \\Omega_\\Lambda)$ parameter space are also better than those provided by SNIa (cf.~Fig.~\\ref{fig:SNe_like}), and they are characterised by a different degeneracy, since MBHB standard sirens are visible at higher redshift.\nIndeed, the novelty with respect to the CMB and SNIa measurements resides in the fact that eLISA has the potential to probe the expansion of the universe in the redshift range $1\\lesssim z\\lesssim 8$, which has not yet been tested by present observations. Although in the $\\Lambda$CDM model, for this redshift range, the universe is supposed to be simply dominated by dark matter and decelerate accordingly, eLISA could prove useful to constrain alternative cosmological models predicting a different expansion rate at very high redshift: for example, early or interacting dark energy, decaying dark matter, unified dark matter models and so on (see e.g.~\\cite{Aubourg:2014yra,Ade:2015rim} where a similar analysis has been done with BAO and CMB data).\nThe investigation of these alternative cosmological models will be considered in a future study.\n\nIt has been pointed out that a well-identified electromagnetic counterpart may not be necessary to measure the cosmological parameters with eLISA: \na statistical method for the  identification of a source's redshift can be used, as described in \\cite{MacLeod:2007jd,Babak:2010ej,Petiteau:2011we}. For eLISA, this method has the advantage of exploiting not only MBHBs as standard sirens, but also extreme mass ratio inspirals (EMRIs), which should be detected in large numbers (see \\cite{AmaroSeoane:2012je} and references therein). EMRIs are expected to be more abundant than MBHBs at low redshift, and might therefore provide a better way to probe the late time acceleration and DDE models, improving in this way the constraints obtained in the present analysis. This study is currently under investigation within the eLISA consortium.\n\nIn summary, standard sirens with eLISA {\\it in its best configurations} have the potential to provide a complementary and calibration-free way to test the expansion of the universe (and in particular $H_0$) with entirely different systematics than present probes (e.g. SNIa), which rely on electromagnetic observations only. This would constitute an important additional scientific gain for a mission that has been designed to detect the gravitational signal of MBHBs. \n\n\n\n\n\\acknowledgments\n\nWe would like to thank Volker Beckmann, Emanuele Berti, Marc Betoule, Marco Cirelli, Zoltan Haiman, Daniel Holz, Bradley Kavanagh, Joseph Lazio, Camilla Pacifici and Daniela Paoletti for providing us with very valuable informations that were used in this analysis.\nE.~Barausse acknowledges support from the European\nUnion's Seventh Framework Programme (FP7/PEOPLE-2011-CIG) through the\nMarie Curie Career Integration Grant GALFORMBHS PCIG11-GA-2012-321608, and\nfrom the H2020-MSCA-RISE-2015 Grant No. StronGrHEP-690904.\n\nA.~Sesana is supported by a University Research Fellowship of the Royal\nSociety.\n\nA.~Klein is supported by NSF CAREER Grant\nNo.~PHY-1055103.\n\n\nComputations were\nperformed on the gpc supercomputer at the SciNet HPC Consortium, as well as on the ``Projet Horizon Cluster'' at the Institut d'astrophysique de Paris.\n\n\n\\appendix\n\\section*{Appendix}\n\\section{Quasar bolometric luminosity}\n\\label{app:luminosity}\nOur semi-analytical galaxy formation model tracks the evolution of the ``reservoir'' of nuclear gas \navailable for accretion onto the central massive BH under a variety of physical processes, represented schematically in \nFig.~\\ref{fig:model}. In more detail, we follow \\cite{mymodel,spin_model,letter,newpaper} and assume that accretion takes place on a ``viscous'' timescale\n\n", "itemtype": "equation", "pos": 66404, "prevtext": "\nwhere $\\sqrt{\\left< v^2 \\right>}$ is the r.m.s.~peculiar velocity of the host galaxy with respect to the Hubble flow, which we fix at 500 km/s, as a rough estimate.\n\nWe now discuss how to combine the information of all the catalogues pertaining to a given MBHB formation model. In more detail, we\n aim at quantifying the capability of a given eLISA configuration to constrain cosmology with a unified indicator for each of the cosmological models listed in section \\ref{sec:cosmology}. We therefore define a figure of merit (FoM), valid for any cosmological model irrespective of its number of parameters, as\n\n", "index": 29, "text": "\\begin{equation}\n\t{\\rm FoM} = \\det(F_{ij}^C)^{\\frac{1}{2N}} = \\frac{1}{\\det(C_{ij}^C)^{\\frac{1}{2N}}} \\,,\n\\label{FoM}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"{\\rm FoM}=\\det(F_{ij}^{C})^{\\frac{1}{2N}}=\\frac{1}{\\det(C_{ij}^{C})^{\\frac{1}{%&#10;2N}}}\\,,\" display=\"block\"><mrow><mrow><mi>FoM</mi><mo>=</mo><mrow><mo movablelimits=\"false\">det</mo><mo>⁡</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>F</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mi>C</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi></mrow></mfrac></msup></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><mrow><mo>det</mo><mo>⁡</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mi>C</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi></mrow></mfrac></msup></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere ${\\rm Re}\\approx 10^3$ is the critical Reynolds number marking the onset of turbulence, and\n$t_{\\rm dyn}=G M_{\\rm bh}/\\sigma^3$ ($M_{\\rm bh}$ and $\\sigma$ being the BH mass and the stellar velocity dispersion) is the dynamical time at the BH's influence radius.\nAs such, the mass accretion rate $\\dot{M}_{\\rm bh,\\,QSO}$ onto the massive BH is computed as\n\n", "itemtype": "equation", "pos": 125249, "prevtext": "\nwhere $C_{ij}^C=(F_{ij}^C)^{-1}$ is the covariance matrix of the $C$th-catalogue, \nand $N$ is the number of parameters of the cosmological model. The FoM  defined in this way \nis the inverse of the $2N$th-root of the volume of the $N$-dimensional parallelepiped whose sides are the 1$\\sigma$ \nerrors on a suitable combination of the parameters for which there are no correlations. If the errors on the actual cosmological parameters were all equal and uncorrelated, \nthe FoM would give the inverse of their value. In the two-parameter case, the above formula is proportional to \nthe inverse of the square-root of the area of the ellipse whose axes are given, again, by the 1$\\sigma$ error on combinations of the parameters with zero correlation. \nThis coincides with the square-root of the FoM defined in the Euclid Study \nReport \\cite{Laureijs:2011gra} for the parameters $w_p$ and $w_a$ (see sections \\ref{sub:inspiral_only_scenario_} \nand \\ref{sub:merger_and_ring_down_scenario}). Note that the FoM as defined by the \nDark Energy Task Force is different, since it involves the 2$\\sigma$ errors of $w_p$ and $w_a$ \\cite{Albrecht:2006um}. \n\nThe FoM of the Euclid Study Report conveys consistent information on the errors on $w_p$ and $w_a$, because the two parameters are not degenerate. The FoM defined above in the $N$-parameter case cannot be directly related to the errors on the $N$ parameters, except in the unrealistic case in which these are all exactly equal and uncorrelated. However, it is a useful estimator to compare different eLISA configurations among each other and different cosmological models, irrespective of the number of parameters\\footnote{Note that the FoM (\\ref{FoM}) does convey some amount of information on the errors, provided that the degeneracies on the cosmological parameters are the same for each eLISA configuration. In this case, by knowing the FoM and the errors on the cosmological parameters for one configuration as well as\n the FoM for another configuration, we could infer the errors on the cosmological parameters given by the second configuration by applying an appropriate scaling.}. \n\nThe FoM in Eq.~\\eqref{FoM} is calculated for each of the 118 catalogues of the three MBHB formation scenarios, \nand for each eLISA configuration and each cosmological model. \nThe probability distribution function (PDF) of the FoM over the 118 catalogues, for each MBHB formation scenario, \ntwo eLISA configurations and two cosmological models ($\\Lambda$CDM and DDE) \nis shown in Fig.~\\ref{fig:PDF}, which will be discussed in Appendix~\\ref{app:statistics}, considering both the conservative and optimistic scenario.\nIn the following, we want to provide a FoM for the capability of a given eLISA configuration to probe a given cosmological model within a given MBHB formation scenario, i.e.~we need to define one single FoM per configuration, cosmological model and MBHB formation scenario. We choose as representative FoM {\\it the median of the PDF of the FoM of all the catalogues}. When we compare the different eLISA configurations in section~\\ref{sec:FoM}, we will always utilise this median FoM, together with its 10th and 90th percentiles (cf.~Fig.~\\ref{fig:FoM}). This will provide an idea of the statistical uncertainty that we can expect in real measurements. \n\nAs explained above, the FoM in Eq.~\\eqref{FoM} cannot be directly related to the errors on the cosmological parameters for a given configuration: the\n information on the errors is given by the covariance matrix $C_{ij}$, in particular by (the square root of) its diagonal entries. We thus need to combine the covariance matrices of the 118 catalogues, $C_{ij}^C$, in order to have an estimate of the expected errors of a real measurement with a given eLISA configuration (for a given cosmological model and MBHB formation scenario).\nFor an estimate of the expected eLISA $1\\sigma$ errors on the cosmological parameters, we select \n{\\it the median values among the (square roots of the) diagonal entries of the 118 covariance matrices} \n(cf.~Table~\\ref{tab:standard_errors}, which will be discussed in section~\\ref{sec:results}).\nIn this estimate, we discard the cases where the low number of data points does not allow to constrain the \ncosmological parameters\\footnote{See Appendix~\\ref{app:statistics} for more details.}.\nIn these cases, the expected errors on the parameters are formally infinite, corresponding to useless measurements.\nFor each eLISA configuration, cosmological model and MBHB formation model, we provide also the percentage $P$ of catalogues for which this does not happen, i.e.~for which it is possible to constrain the cosmological parameters (cf.~Fig~\\ref{fig:PoM} in Appendix~\\ref{app:statistics}).\nThis ``probability of measurement'' should be considered as a piece of additional \ninformation on the ability to constrain a given cosmological model by a given eLISA configuration. \nThis is indeed because the standard 1$\\sigma$-error estimates provided below are computed by using only the cases where \nfitting of the data is actually possible.\nThe errors on the cosmological parameters provided in the following should therefore \nbe always evaluated {\\it in combination with the corresponding probability $P$} (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).\n\nAlthough an estimate for the standard errors might be defined in this way, in order to plot likelihood contours (``ellipses''), \nwe need a consistent Fisher matrix representative of all the 118 catalogues (for a given cosmological model, MBHB formation model, and eLISA design).\nWe cannot simply take the median of all the covariance matrices entry by entry, \nbecause some of these entries (i.e., those associated with infinite errors) may be ill-defined, and there is no way to access their information on the degeneracies among the parameters.\nFor this reason, to combine the covariance matrices $C_{ij}^C$, we have decided to adopt the following criterion: {\\it we pick as representative covariance matrix the one that gives the closest FoM to the median of the FoM PDF}. This provides us with well-defined covariance matrices, which can be taken to represent both the estimated median errors and the degeneracies among the cosmological parameters.\nNote that instead of taking the median value of the errors, as explained above, we could have used the covariance matrix defined in this way to provide representative errors for each combination of configuration, MBHB formation model and cosmological model.\nHowever this covariance matrix, although well representative of the FoM distribution, still corresponds to a unique realisation of the eLISA data, and is characterised by all its entries and not only by its FoM.\nFor example, two Fisher matrices with a similar FoM might actually present quite different entries, thus giving quite different errors and degeneracies among the parameters, especially if they are in the tails of the FoM distribution.\nFor this reason, we have chosen to use the medians of the errors in all catalogues as their representative, \ninstead of the errors provided by the covariance matrix closest to the median of the FoM PDF.\nIn any case, thanks to the large statistics provided by our catalogues, \nwe have verified that the two procedures give comparable results (see Appendix~\\ref{app:statistics}, in particular~Table~\\ref{tab:errors_scatter}).\n\nTo have an idea of the possible scatter of the cosmological constraints that we can place,\n we refer to Fig.~\\ref{fig:LCDM_percentile} of appendix~\\ref{app:statistics}, where we plot the 2$\\sigma$ likelihood contours in the $\\Lambda$CDM scenario (for the configuration N2A5M5L6 and  the PopIII model) derived from the covariance matrix closest to the median of the FoM PDF, together with those derived from its 20th and 80th percentile. \n\n\n\n\\section{Constraints on cosmological models}\n \\label{sec:results}\n\nWe consider the four cosmological models described at the end of section \\ref{sec:cosmology} (five-parameter, $\\Lambda$CDM with curvature, $\\Lambda$CDM, DDE), and for each of them we present results for two representative configurations: N2A5M5L6 (the old LISA) and N2A2M5L4.\nThe first one gives the best possible result achievable by the eLISA mission (within the considered MBHB models), while the second one represents the worst possible configuration for which independent constraints on the cosmological parameters can be obtained. Worse four-link configurations are unable to constrain cosmology at any level due to the low number of standard sirens (cf.~Fig.~\\ref{fig:ss}).\nWe first discuss the conservative case, in which the sky localisation error is derived using the inspiral phase only. We then move to the optimistic case, in which we also account for merger and ringdown, and we reduce the lensing error by a factor two to mimic de-lensing (see discussion in section \\ref{sec:statistic}). The discussion on the FoM and the comparison among all eLISA configurations is presented in section~\\ref{sec:FoM}.\n\n\\subsection{Conservative scenario (inspiral only)} \n\\label{sub:inspiral_only_scenario_}\n\nTable~\\ref{tab:standard_errors} summarises the standard $1\\sigma$ errors on the cosmological parameters for N2A5M5L6 and N2A2M5L4, for all MBHB formation scenarios and for all cosmological models considered. We also show the errors on $\\Omega_M$ and $\\Omega_\\Lambda$ derived for the case of $\\Lambda$CDM with curvature once we fix the Hubble rate to its fiducial value: this is the relevant case to be compared with SNIa (which probe curvature and acceleration), and we discuss it in section \\ref{sub:compa}. Moreover, we provide the errors\non ${\\Omega_{M}}$, $h$ and $w_0$ once all other parameters but the one under consideration are held fixed: this helps quantify the capability of the given eLISA configuration to constrain these single parameters with respect to other probes; again see section \\ref{sub:compa}.\n\n\\begin{table}\n\\hspace{-0.5cm}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c||c|c|c|c|c|c||c|c|c|c|c|c|}\n\\hline\nModel & \\multicolumn{6}{|c||}{N2A5M5L6} & \\multicolumn{6}{|c|}{N2A2M5L4} \\\\\n\\hline\n\\text{} & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ \\\\\n\\hline\n \\multirow{2}{*}{5} & 100 & 4.31 & 7.16 & 1.58 & 13.2 & 92.3 & 67.8 & 320 & 799 & 47.7 & 344 & 5530 \\\\\n \\multirow{2}{*}{param.} & 100 & 18.0 & 24.9 & 9.95 & 88.6 & 392 & 2.54 & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ \\\\\n & 100 & 2.80 & 5.15 & 0.681 & 4.66 & 55.7 & 68.6 & 138 & 306 & 13.3 & 127 & 2400 \\\\\n\\hline\n \\multirow{2}{*}{$\\Lambda$CDM} & 100 & 0.0819 & 0.281 & 0.0521 & \\text{} & \\text{} & 91.5 & 0.471 & 2.66 & 0.429 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{+ curv.} & 100 & 0.220 & 0.541 & 0.136 & \\text{} & \\text{} & 12.7 & $\\gg 10^4$ & $\\gg 10^4$ & $\\gg 10^4$ & \\text{} & \\text{} \\\\\n & 100 & 0.0473 & 0.207 & 0.0316 & \\text{} & \\text{} & 90.7 & 0.174 & 1.26 & 0.145 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & 0.0473 & 0.0473 & 0.0210 & \\text{} & \\text{} & 97.5 & 0.275 & 0.275 & 0.0910 & \\text{} & \\text{} \\\\\n \\text{$\\Lambda$CDM} & 100 & 0.0917 & 0.0917 & 0.0480 & \\text{} & \\text{} & 32.2 & 0.543 & 0.543 & 0.220 & \\text{} & \\text{} \\\\\n & 100 & 0.0371 & 0.0371 & 0.0146 & \\text{} & \\text{} & 99.2 & 0.126 & 0.126 & 0.0400 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & \\text{} & \\text{} & \\text{} & 0.253 & 1.32 & 97.5 & \\text{} & \\text{} & \\text{} & 1.03 & 6.36 \\\\\n \\text{DDE} & 100 & \\text{} & \\text{} & \\text{} & 0.584 & 2.78 & 37.3 & \\text{} & \\text{} & \\text{} & 4.96 & 26.1 \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.176 & 1.00 & 95.8 & \\text{} & \\text{} & \\text{} & 0.427 & 2.87 \\\\\n\\hline\n \\text{Accel.} & 100 & 0.0190 & 0.0735 & \\text{} & \\text{} & \\text{} & 99.2 & 0.211 & 0.396 & \\text{} & \\text{} & \\text{} \\\\\n \\& curv. & 100 & 0.0280 & 0.105 & \\text{} & \\text{} & \\text{} & 37.3 & 0.977 & 1.30 & \\text{} & \\text{} & \\text{} \\\\\n test & 100 & 0.0213 & 0.0631 & \\text{} & \\text{} & \\text{} & 94.1 & 0.116 & 0.202 & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & 0.0173 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0670 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $\\Omega_M$} & 100 & 0.0238 & \\text{} & \\text{} & \\text{} & \\text{} & 53.4 & 0.0755 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n & 100 & 0.0172 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0437 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & 0.00712 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.0146 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $h$} & 100 & \\text{} & \\text{} & 0.00996 & \\text{} & \\text{} & 53.4 & \\text{} & \\text{} & 0.0175 & \\text{} & \\text{} \\\\\n & 100 & \\text{} & \\text{} & 0.00531 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00853 & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & \\text{} & 0.0590 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.121 & \\text{} \\\\\n \\multirow{2}{*}{on $w_0$} & 100 & \\text{} & \\text{} & \\text{} & 0.0786 & \\text{} & 53.4 & \\text{} & \\text{} & \\text{} & 0.146 & \\text{} \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.0467 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0734 & \\text{} \\\\\n\\hline\n\\end{tabular}}\n\\end{center}\n\\caption{Standard 1$\\sigma$ errors on the cosmological parameters in the conservative scenario (inspiral only), for two eLISA configurations and in the four cosmological models considered (five-parameter, $\\Lambda$CDM with curvature, $\\Lambda$CDM, DDE) plus the case $\\Lambda$CDM with curvature in which the Hubble parameter $h$ has been fixed to its fiducial value. We add this case here since it provides the relevant tests of acceleration and curvature to be compared with SNIa; cf.~Fig.~\\ref{fig:SNe_like} and the associated discussion in section~\\ref{sub:compa}. We also add the errors on $\\Omega_M$, $h$ and $w_0$ alone, in order to compare them with SNIa and CMB constraints (section~\\ref{sub:compa}). The fiducial values are $\\Omega_M = 0.3$, $\\Omega_\\Lambda = 0.7$, $h = 0.67$ ($H_0 = 67$ km/s/Mpc), $w_0 = -1$, $w_a=0$. In each row of the table, the top sub-row shows the errors for light seeds (popIII), the central sub-row for heavy seeds with delays (Q3d) and the bottom sub-row for heavy seeds without delays (Q3nod). Blank entries mean that the corresponding parameter has been fixed to its fiducial value (exact prior). To get the errors in the $\\Lambda$CDM model, we impose the flatness constraint $\\Omega_M+\\Omega_\\Lambda =1$, and consequently $\\Delta \\Omega_\\Lambda$ corresponds to $\\Delta \\Omega_M$. The probability $P$ corresponds to the percentage of catalogues with which it is actually possible to measure the parameters.\nThe errors in the table are indeed given only by the median among the catalogues providing a measurement, while in the other cases one obtains infinite errors (see the discussion in section~\\ref{sec:statistic} and in appendix~\\ref{app:statistics}).}\n\\label{tab:standard_errors}\n\\end{table}\n\nIn each entry of Table~\\ref{tab:standard_errors}, the top row shows the errors for light seeds (popIII), the central row for heavy seeds with delays (Q3d) and the bottom row for heavy seeds without delays (Q3nod). Q3nod systematically gives worse results than the other two scenarios -- which are roughly comparable -- due to the lower number of detectable standard sirens, as shown in Fig.~\\ref{fig:ss}. In the following, whenever we need to restrict to one MBHB formation model, we always choose popIII, since it is the intermediate scenario (as far as the number of standard sirens is concerned) among those we consider. The constraints would be comparable or slightly better for model Q3nod. \n\nFrom Table~\\ref{tab:standard_errors}, it appears that even the best eLISA configuration N2A5M5L6 (corresponding to old LISA) is incapable of independently constraining the full five-parameter cosmological model, for which  $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h,\\,w_0,\\,w_a)$ are all free to vary simultaneously. Using eLISA alone, we can only get meaningful constraints on cosmological models described by fewer parameters. This  is indeed also true for all present cosmological probes\\footnote{The errors on the full five parameters model are huge compared to present constraints obtained from the combination of other cosmological probes. Therefore we can speculate that marginalising and combining with other probes would not help improving the present constraints. However, we have not performed the analysis yet, here we present results for eLISA only.}. We therefore need to reduce the number of cosmological parameters, by fixing one or more of them to their fiducial value: from the point of view of the statistical analysis, this is equivalent to imposing an exact prior on those parameters.\n\nThe reduced Fisher matrices for the three-parameter case of $\\Lambda$CDM plus curvature are obtained by removing from the $5 \\times 5$ Fisher matrices the rows and columns corresponding to the parameters that are being fixed: in this case, the dark energy EoS parameters, which take the values $w_0 = -1$ and $w_a = 0$. Similarly, the reduced Fisher matrices for the DDE model are obtained by removing from the $5 \\times 5$ Fisher matrices the rows and columns corresponding to $({\\Omega_{M}},\\,{\\Omega_\\Lambda},\\,h)$. On the other hand, for the $\\Lambda$CDM scenario we need first to change variables (from $\\Omega_\\Lambda$ to $\\Omega_k = 1- \\Omega_M -\\Omega_\\Lambda$) to impose the flatness constraint $\\Omega_M+\\Omega_\\Lambda =1$ (corresponding to fix $\\Omega_k = 0$), and get the Fisher matrices for the 2-parameters $({\\Omega_{M}},\\,\\,h)$.\n\nNote that the four-link configuration N2A2M5L4 does not provide useful constraints on any cosmological model. This is because for this configuration the number of standard sirens with ${\\rm SNR}>8$ and $\\Delta\\Omega<10~{\\rm deg}^2$ is small in the conservative scenario under analysis here (cf.~Fig.~\\ref{fig:ss} and the discussion in section \\ref{sec:counter}). The situation will change in the optimistic scenario discussed in section \\ref{sub:merger_and_ring_down_scenario}.\n\n\\subsubsection*{$\\Lambda$CDM plus curvature $(\\Omega_M, \\Omega_\\Lambda, h)$} \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{3p_ellipses.pdf}\n\\end{center}\n\\caption{Marginalised likelihood contours (1 and 2$\\sigma$) for the three-parameter cosmological model ($\\Lambda$CDM plus curvature)  in the conservative scenario, with configuration N2A5M5L6. We show all three MBHB formation models. }\n\\label{fig:Ellipses_3_parameters}\n\\end{figure}\n\nThe first cosmological model that we consider describes a universe with dark matter, dark energy fixed to a CC, and non-vanishing spatial curvature.\nThe free parameters of the model are $\\Omega_M$, $\\Omega_\\Lambda$ and $h$ and their standard 1$\\sigma$ errors can be read from the second row of Table~\\ref{tab:standard_errors}, for each MBHB formation scenario.\nIn Fig.~\\ref{fig:Ellipses_3_parameters} we plot the likelihood contours (ellipses) for N2A5M5L6 and for all three MBHB formation scenarios. \nTo find the $2 \\times 2$ marginalised Fisher matrices used in this plot, we remove from the $3\\times 3$ ``representative'' covariance matrix (i.e., the one that gives the closest FoM to the median of the FoM PDF) the row and column of the parameter over which we are marginalising, and then invert the $2\\times 2$ matrix obtained in this way to get the new Fisher matrices from which the ellipses are drawn. \n\nIn the $\\Lambda$CDM model plus curvature (also called sometimes the $o$CDM model, see e.g.~\\cite{Betoule:2014frx}), it is customary to provide the errors on the curvature rather than on $\\Omega_\\Lambda$. In Table~\\ref{tab:Omk} we therefore give the errors on the parameter $\\Omega_k$, which are orders of magnitude higher than those obtained by CMB analysis (cf.~for example \\cite{Ade:2015xua}). \n\nIt is clear that not even the best eLISA configuration will be able to constrain the cosmological model $\\Lambda$CDM plus curvature to a degree comparable with present constraints: these, according to \\cite{Betoule:2014frx}, are at the level of 1-3\\% by combining SNIa+Planck+BAO. \nOn the other hand, once combined with other probes, eLISA in its best configuration may help break the degeneracies among the parameters, in the most favourable scenarios of MBHB formation. eLISA constraints can also naturally complement present electromagnetic measurements, since the redshift range tested by MBHB standard sirens will be much larger (up to $z\\sim 8$) and thus affected by different degeneracies in the parameter space.\nThe combination of eLISA results with other cosmological probes may thus provide new interesting information. \n\nMoreover, eLISA could give a fully independent constraint on the Hubble parameter, complementary to other direct (optical) measurements. Even though the errors on $h$ are quite high ($\\sim 5$\\%) compared to other cosmological probes, also in the most favourable MBHB formation models/configurations, \nit is still remarkable that the eLISA mission may potentially measure this parameter, which cannot be independently measured by SNIa observations.\nAs we will see, the errors on $h$ are even lower for cosmological models with fewer parameters. \n\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c|}\n\\hline\n \\text{} & N2A5M5L6 & N2A5M5L4 \\\\\n\\hline\n \\text{} \t\t  & 0.202 & 2.23 \\\\\n $\\Delta\\Omega_k$ & 0.349 & $\\gg 10^4$ \\\\\n  \\text{} \t\t  & 0.172 & 1.25 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Errors on the curvature $\\Omega_k$ in the three parameter model $\\Lambda$CDM model plus curvature, in the conservative scenario. The fiducial value is zero. The top row shows the error for popIII, the central row for Q3d and the bottom row for Q3nod. }\n\\label{tab:Omk}\n\\end{table}\n\n\n\\subsubsection*{$\\Lambda$CDM $(\\Omega_M, h)$} \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{LCDM.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for $\\Lambda$CDM cosmology in the conservative scenario, with N2A5M5L6, for the three MBHB formation models. We have imposed flatness through $\\Omega_\\Lambda+ \\Omega_M=1$ and fixed $w_0=-1$, $w_a=0$.}\n\\label{fig:LCDM}\n\\end{figure}\n\nThe standard 1$\\sigma$ uncertainties in the $\\Lambda$CDM model, characterised by the two parameters $\\Omega_M$ and $h$, are given in the third row of Table~\\ref{tab:standard_errors}. The $\\Lambda$CDM model is evidently much better constrained than the three-parameter one: in the popIII MBHB formation model, N2A5M5L6 gives constraints at the level of 16\\% on $\\Omega_M$ and 3\\% on $h$. \nN2A2M5L4 still does not provide useful constraints, even though the measurement of $h$ starts to become slightly more significant.\nFig.~\\ref{fig:LCDM} shows the likelihood contours in the $(\\Omega_M, h)$ parameter space for N2A5M5L6. Again, it is apparent that the constraints are much weaker in model Q3d, but in the other two scenarios they are tighter. \n\n\\subsubsection*{DDE $(w_0, w_a)$} \n\nThe ability of any eLISA configuration to constrain DDE is severely limited by the small expected number of MBHBs detected at low redshift (see Fig.~\\ref{fig:data} for an example). This is even more true for the conservative scenario under analysis here. \nThe best we can expect, using N2A5M5L6 alone, is a FoM as defined by the Euclid Study Report of about 9 (which corresponds to FoM=3 in our definition, cf.~Fig.~\\ref{fig:FoM}).\nAs can be seen from Table~\\ref{tab:standard_errors}, in this best situation, eLISA can provide an independent constrain on $w_0$ of 18\\%, while the standard 1$\\sigma$ deviation on $w_a$ cannot be better than 1.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{DE.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model $(w_0, w_a)$, in the conservative scenario, for the three MBHB formation models, with N2A5M5L6 (the other cosmological parameters being fixed to their fiducial values).}\n\\label{fig:DE}\n\\end{figure}\n\nIn Fig.~\\ref{fig:DE} we have plotted the likelihood contours in the $(w_0, w_a)$ parameter space for N2A5M5L6 (while those for N2A2M5L4 are considerably worse and are not shown).\nFrom this figure, it appears that a strong degeneracy is present between the two parameters $(w_0, w_a)$.\nTo get rid of this degeneracy, a usual approach is to change variable from $w_0$ to $w_p = w_0 + z_p/(z_p+1)\\, w_a$, that is not correlated with $w_a$\nfor a suitable choice of the pivot redshift $z_p$ \\cite{Albrecht:2006um}. Physically, $w_p$ is the DE equation of state parameter at the pivot redshift, i.e.~the redshift at which one can make the best measurement of $w$, defined by $z_p=-[1+\\Delta w_a/(\\rho \\Delta w_0)]^{-1}$ where $\\rho$ is the correlation coefficient of $w_0$ and $w_a$. Fig.~\\ref{fig:wp} shows the likelihood contours in the uncorrelated variables $(w_p,\\,w_a)$. From Table~\\ref{tab:pivot} it appears that N2A5M5L6 can measure $w_p$ at the level of 4-6\\%, while $\\Delta w_a=1$ for the most favourable MBHB formation model\\footnote{Note that the errors on $w_a$ given in Table~\\ref{tab:pivot} slightly differ from those given in Table~\\ref{tab:standard_errors}: this is because they are taken from the covariance matrix used to make the plots in Fig.~\\ref{fig:wp} (the one giving the FoM closest to the median of the FoM PDF), while Table~\\ref{tab:standard_errors} reports the median of the errors in all catalogues.}.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{wp_3.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model with N2A5M5L6 in the $w_p$ and $w_a$ variables, in the conservative scenario, for the three MBHB formation models (the other cosmological parameters being fixed to their fiducial values). }\n\\label{fig:wp}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c||c|c|c|}\n\\hline\n \\multicolumn{3}{|c||}{N2A5M5L6} & \\multicolumn{3}{|c|}{N2A2M5L4} \\\\\n\\hline\n $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ & $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ \\\\\n\\hline\n 0.206 & 0.0617 & 1.30 & 0.203 & 0.138 & 5.57 \\\\\n 0.249 & 0.0824 & 2.60 & 0.227 & 0.162 & 32.9 \\\\\n 0.200 & 0.0423 & 1.09 & 0.104 & 0.0881 & 2.29 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Pivot redshift and errors on $(w_p,\\,w_a)$  for the conservative scenario. For both eLISA configurations, the top row shows the case of popIII, the central row Q3d and the bottom row Q3nod. }\n\\label{tab:pivot}\n\\end{table}\n\nNote that constraining the evolution of $w$ is notoriously difficult. The above quoted errors are in line with those of other present cosmological probes: see for example \\cite{Betoule:2014frx} and \\cite{Aubourg:2014yra}. In these references the other parameters of the $\\Lambda$CDM model ($\\Omega_M,\\, h$) are not fixed as we do here, but the analysis is done in combination  with the Planck data: this practically amounts to set a very stringent prior on them.\nWe therefore forecast that eLISA in its best configurations with six links, when combined with other cosmological probes, will be able to help reducing the errors on $w_p$ and $w_a$ in the DDE scenario. The combined analysis will be the subject of future studies, although by the time eLISA is launched, Euclid may already have provided constraints at the level of $\\Delta w_a=0.1$ \\cite{Laureijs:2011gra}.  \n\n\n\\subsection{Optimistic scenario (with merger \\& ringdown and de-lensing)} \n\\label{sub:merger_and_ring_down_scenario}\n\nTable~\\ref{tab:standard_errors_opt} summarises the standard $1\\sigma$ errors on the cosmological parameters for N2A5M5L6 and N2A2M5L4, for all MBHB formation scenarios and for all cosmological models considered, exactly as in section \\ref{sub:inspiral_only_scenario_} (cf.~Table~\\ref{tab:standard_errors}). As before, even the best configuration N2A5M5L6 cannot constrain the full five-parameter cosmological model. Conversely, the situation improves significantly for the other models with respect to the conservative scenario: in particular, the most striking improvement is with configuration N2A2M5L4 in model Q3d. \n\nIn the $\\Lambda$CDM plus curvature model, the errors improve by about a factor of two for N2A5M5L6. In particular, $h$ can be measured with a 2.7\\% accuracy in the best-case scenario of Q3nod, and this goes down to about 1\\% in pure $\\Lambda$CDM when ${\\Omega}_k= 0$. This level of precision is comparable to the one of present {\\it combined} probes SNIa+Planck+BAO \\cite{Betoule:2014frx}. The 1 and 2-$\\sigma$ contours are shown in Fig.~\\ref{fig:Ellipses_3_parameters_opt} for the $\\Lambda$CDM plus curvature model (Table~\\ref{tab:Omk_opt} shows the errors on $\\Omega_k$) and in Fig.~\\ref{fig:LCDM_opt} for the $\\Lambda$CDM model. Here we show also the contours for N2A2M5L4, since in the optimistic scenario the situation considerably improves for this four-link configuration: in almost 100\\% of catalogues, N2A2M5L4 can constrain ${\\Omega_{M}}$ to about 50\\% and $h$ to about 10\\% in the most unfavourable model of MBHB formation, Q3d. These errors are still very large, but compared to the conservative case, in which there was no possibility of measurement, they show {\\it the high improvement that can be obtained if a few more standard sirens are available} (thanks to the addition of merger and ringdown in the sky localisation). \n\nThe precision in the measurement of DDE also raises substantially. The 1 and 2-$\\sigma$ contours are shown in Fig.~\\ref{fig:DE_opt} for $w_0$ and $w_a$, and in Fig.~\\ref{fig:wpMR} for the uncorrelated variables $w_p$ and $w_a$ at the pivot redshift. Table~\\ref{tab:pivot_opt} gives the errors on $w_p$ and $w_a$.\nAgain the limitation in constraining the dark energy EoS derives from the low number of data points at low redshift.\nNevertheless, in the optimistic scenario it might be possible to reach FoM$\\sim 7$ with the best six-link configurations (cf.~Fig.~\\ref{fig:FoM}), corresponding to a FoM as defined by the Euclid Study report of about 50.\nFrom Table~\\ref{tab:standard_errors_opt} we see that in the best situation (Q3nod and N2A5M5L6) one can now reach 10\\% errors on $w_0$ and a 1$\\sigma$ uncertainty on $w_a$ around 0.5, roughly corresponding to a factor 2 improvement with respect to the conservative scenario (cf.~section~\\ref{sub:inspiral_only_scenario_}).\nSimilarly, from Table~\\ref{tab:pivot_opt} one can see that N2A5M5L6 might be able to constrain $w_p$ at the level of 2-4\\%.\nThese errors are comparable to the ones obtained by other present cosmological probes (see e.g.~\\cite{Betoule:2014frx,Aubourg:2014yra}), meaning that eLISA, at least in its best configurations, may prove useful to reduce the uncertainty on the cosmological parameters if a combined analysis is performed. By the time eLISA is launched, much stronger constraints are expected from Euclid \\cite{Laureijs:2011gra}; on the other hand, the eLISA mission will be capable of providing constraints which do not solely depend on EM observations.\n\n\\begin{table}\n\\hspace{-0.5cm}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c||c|c|c|c|c|c||c|c|c|c|c|c|}\n\\hline\nModel & \\multicolumn{6}{|c||}{N2A5M5L6} & \\multicolumn{6}{|c|}{N2A2M5L4} \\\\\n\\hline\n\\text{} & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ & $P$(\\%) & $\\Delta\\Omega _M$ & $\\Delta\\Omega _{\\Lambda }$ & $\\Delta h$ & $\\Delta w_0$ & $\\Delta w_a$ \\\\\n\\hline\n \\multirow{2}{*}{5} & 100 & 2.51 & 4.40 & 0.951 & 8.01 & 55.2 & 80.5 & 120 & 253 & 24.8 & 177 & 2230 \\\\\n \\multirow{2}{*}{param.} & 100 & 4.64 & 6.90 & 2.58 & 22.4 & 103 & 44.1 & 1480 & 3250 & 371 & 2350 & $\\gg 10^4$ \\\\\n & 100 & 1.05 & 1.97 & 0.265 & 2.07 & 21.2 & 93.2 & 12.6 & 27.8 & 2.08 & 15.9 & 227 \\\\\n\\hline\n \\multirow{2}{*}{$\\Lambda$CDM} & 100 & 0.0467 & 0.155 & 0.0299 & \\text{} & \\text{} & 96.6 & 0.315 & 1.51 & 0.228 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{+ curv.} & 100 & 0.0875 & 0.209 & 0.0527 & \\text{} & \\text{} & 77.1 & 0.396 & 1.61 & 0.306 & \\text{} & \\text{} \\\\\n & 100 & 0.0265 & 0.0914 & 0.0161 & \\text{} & \\text{} & 99.2 & 0.0610 & 0.342 & 0.0520 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & 0.0267 & 0.0267 & 0.0121 & \\text{} & \\text{} & 99.2 & 0.121 & 0.121 & 0.0445 & \\text{} & \\text{} \\\\\n \\text{$\\Lambda$CDM} & 100 & 0.0368 & 0.0368 & 0.0199 & \\text{} & \\text{} & 90.7 & 0.151 & 0.151 & 0.0681 & \\text{} & \\text{} \\\\\n & 100 & 0.0186 & 0.0186 & 0.00803 & \\text{} & \\text{} & 100 & 0.0464 & 0.0464 & 0.0159 & \\text{} & \\text{} \\\\\n\\hline\n & 100 & \\text{} & \\text{} & \\text{} & 0.149 & 0.798 & 98.3 & \\text{} & \\text{} & \\text{} & 0.507 & 3.09 \\\\\n \\text{DDE} & 100 & \\text{} & \\text{} & \\text{} & 0.241 & 1.14 & 89.0 & \\text{} & \\text{} & \\text{} & 0.777 & 4.06 \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.101 & 0.544 & 99.2 & \\text{} & \\text{} & \\text{} & 0.201 & 1.20 \\\\\n\\hline\n \\text{Accel.} & 100 & 0.0105 & 0.0412 & \\text{} & \\text{} & \\text{} & 99.2 & 0.0660 & 0.174 & \\text{} & \\text{} & \\text{} \\\\\n \\& curv. & 100 & 0.00972 & 0.0429 & \\text{} & \\text{} & \\text{} & 84.7 & 0.0544 & 0.161 & \\text{} & \\text{} & \\text{} \\\\\n test & 100 & 0.00887 & 0.0310 & \\text{} & \\text{} & \\text{} & 99.2 & 0.0381 & 0.0804 & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & 0.00966 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0319 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $\\Omega_M$} & 100 & 0.00935 & \\text{} & \\text{} & \\text{} & \\text{} & 94.1 & 0.0283 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n & 100 & 0.00788 & \\text{} & \\text{} & \\text{} & \\text{} & 100 & 0.0199 & \\text{} & \\text{} & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & 0.00412 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00850 & \\text{} & \\text{} \\\\\n \\multirow{2}{*}{on $h$} & 100 & \\text{} & \\text{} & 0.00446 & \\text{} & \\text{} & 94.1 & \\text{} & \\text{} & 0.00937 & \\text{} & \\text{} \\\\\n & 100 & \\text{} & \\text{} & 0.00307 & \\text{} & \\text{} & 100 & \\text{} & \\text{} & 0.00485 & \\text{} & \\text{} \\\\\n\\hline\n \\multirow{2}{*}{Error} & 100 & \\text{} & \\text{} & \\text{} & 0.0342 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0678 & \\text{} \\\\\n \\multirow{2}{*}{on $w_0$} & 100 & \\text{} & \\text{} & \\text{} & 0.0368 & \\text{} & 94.1 & \\text{} & \\text{} & \\text{} & 0.0729 & \\text{} \\\\\n & 100 & \\text{} & \\text{} & \\text{} & 0.0254 & \\text{} & 100 & \\text{} & \\text{} & \\text{} & 0.0416 & \\text{} \\\\\n\\hline\n\\end{tabular}}\n\\end{center}\n\\caption{Same as Table~\\ref{tab:standard_errors}, but in the optimistic scenario (merger ad ringdown plus de-lensing). }\n\\label{tab:standard_errors_opt}\n\\end{table}\n\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{3p_ellipses_opt.pdf}\n\\end{center}\n\\caption{Marginalised likelihood contours (1 and 2$\\sigma$) for the three-parameter cosmological model ($\\Lambda$CDM plus curvature) in the optimistic scenario, with configuration N2A5M5L6. We show all three MBHB formation models. }\n\\label{fig:Ellipses_3_parameters_opt}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c|}\n\\hline\n \\text{} & N2A5M5L6 & N2A5M5L4 \\\\\n\\hline\n \\text{} \t\t  & 0.109  & 1.38 \\\\\n $\\Delta\\Omega_k$ & 0.125  & 1.10 \\\\\n  \\text{} \t\t  & 0.0713 & 0.305 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Errors on the curvature $\\Omega_k$ in the three parameter model $\\Lambda$CDM model plus curvature, for the optimistic scenario. The fiducial value is zero. For both eLISA configurations, the top row shows the error for popIII, the central row forQ3d and the bottom row for Q3nod. }\n\\label{tab:Omk_opt}\n\\end{table}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{LCDM_opt_with_L4.pdf} \n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for $\\Lambda$CDM cosmology in the optimistic scenario, with both N2A5M5L6 and N2A2M5L4, for the three MBHB formation models. We have imposed flatness through $\\Omega_\\Lambda+ \\Omega_M=1$ and fixed $w_0=-1$, $w_a=0$.}\n\\label{fig:LCDM_opt}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{DE_opt.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model ($w_0, w_a$), in the optimistic scenario, for the three MBHB formation models, with N2A5M5L6 (the other cosmological parameters being fixed to their fiducial values).}\n\\label{fig:DE_opt}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{wp_3_opt.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours for the DDE model with N2A5M5L6 in the $w_p$ and $w_a$ variables, in the optimistic scenario, for the three MBHB formation models (the other cosmological parameters being fixed to their fiducial values). }\n\\label{fig:wpMR}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|c||c|c|c|}\n\\hline\n \\multicolumn{3}{|c||}{N2A5M5L6} & \\multicolumn{3}{|c|}{N2A2M5L4} \\\\\n\\hline\n $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ & $z_p$ & $\\Delta w_p$ & $\\Delta w_a$ \\\\\n\\hline\n 0.244 & 0.0413 & 0.665 & 0.193 & 0.0626 & 3.34 \\\\\n 0.264 & 0.0401 & 1.06 & 0.239 & 0.0830 & 3.30 \\\\\n 0.228 & 0.0248 & 0.559 & 0.194 & 0.0455 & 1.14 \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Pivot redshift and errors on $(w_p,\\,w_a)$ for the optimistic scenario. For both eLISA configurations, the top row shows the case popIII, the central row the case Q3d and the bottom row the case Q3nod. }\n\\label{tab:pivot_opt}\n\\end{table}\n\n\n\\subsection{Comparison with other probes and constraints on single parameters} \n\\label{sub:compa}\n\nWe end the discussion on the constraints on cosmological parameters by analysing some cases which are instructive for direct comparison with other probes. We use as reference analyses those of \\cite{Betoule:2014frx} for SNIa and of \\cite{Ade:2015xua} for CMB. \n\nLet us first analyse the case of $\\Lambda$CDM with curvature, once we fix the Hubble rate to its fiducial value; cf.~row five of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}. This is the usual test of acceleration and curvature, to be compared with the results of SNIa (see for example the discussion in section 6 of \\cite{Betoule:2014frx}).\nIn the conservative scenario, from Table~\\ref{tab:standard_errors} it appears that  N2A5M5L6 may constrain $\\Omega_M$ at the level of 7-8\\% and $\\Omega_\\Lambda$ at the level of 10-11\\% in the popIII and Q3nod models, while in Q3d one obtains slightly worse results. \nN2A2M5L4 worsens these constraints by about one order of magnitude: in the most favourable case (Q3d) one can only achieve uncertainties around 40\\% for $\\Omega_M$ and around 70\\% for $\\Omega_\\Lambda$, highlighting the difficulties encountered with four-link configurations in the conservative scenario. \nOn the other hand, in the optimistic scenario, from Table~\\ref{tab:standard_errors_opt} one can notice that N2A5M5L6 manages to constrain $\\Omega_M$ at the level of 3\\% and $\\Omega_\\Lambda$ at the level of 5-6\\% in all models, while N2A5M5L6 can only reach 13\\% for $\\Omega_M$ and 11\\% for $\\Omega_\\Lambda$ in Q3nod. These values become respectively 22\\% and 25\\% for the least favourable MBHB formation model, Q3d.\n\nIf one excludes four-link configurations in the conservative scenario, these errors are competitive to, if not better than, the SNIa results as given e.g.~in \\cite{Betoule:2014frx}, especially in the case of the best eLISA configuration and the most favourable MBHB formation models. Likelihood contours for the PopIII model are shown in Fig.~\\ref{fig:SNe_like}, for both the conservative and optimistic scenarios.\nThese contours are much better than the ones obtained with present SNIa data, as one can realise by comparing for example with Fig.~15 of \\cite{Betoule:2014frx}.\nAn important point here is that the degeneracy among $({\\Omega}_M,\\,{\\Omega}_\\Lambda)$ is different from the one of SNIa. Since MBHB standard sirens are visible at higher redshift than SNIa, the likelihood contours for eLISA are less tilted than those for SNIa, as explained in \\cite{Goobar:1995af}. Moreover, the degeneracy among these parameters for the CMB combined with BAO measurements is in the opposite direction: cf.~for example Fig.~15 of \\cite{Betoule:2014frx}. This means that {\\it combining eLISA measurements with SNIa, CMB and BAO will help break the degeneracy in $({\\Omega}_M,\\,{\\Omega}_\\Lambda)$ and will provide even stronger constraints on the acceleration of the universe}.\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=.8\\textwidth]{SNe_like.pdf}\n\\end{center}\n\\caption{1 and 2$\\sigma$ likelihood contours in the $\\Lambda$CDM with curvature model but with fixed Hubble rate $h=0.67$ (its fiducial value). This contours can be compared directly with the results of SNIa.}\n\\label{fig:SNe_like}\n\\end{figure}\n\nAnother comparison that can be done with SNIa concerns the value of ${\\Omega}_M$. Ref.~\\cite{Betoule:2014frx} gives the measurement ${\\Omega}_M=0.294\\pm0.034$ from SNIa only in the $\\Lambda$CDM case. This has to be compared with the errors in row six of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}, i.e.~the $\\Lambda$CDM case fixing the Hubble constant to its fiducial value (SNIa in fact do not provide a measurement of the Hubble constant, cf.~section 6 of \\cite{Betoule:2014frx}). It appears that {\\it eLISA can always constrain ${\\Omega}_M$ at a better level than present SNIa}, except in the conservative scenario with N2A2M5L4, where the error is roughly twice the SNIa one. \nMore quantitatively, in model Q3nod with N2A5M5L6, one can reach an error of 5.7\\% in the conservative scenario and 2.6\\% in the optimistic one, thus performing much better than the 11.5\\% obtained by present SNIa alone, though not competitive with Planck results \\cite{Ade:2015xua}.\n\nConcerning dark energy, the comparison with present observations is discussed at the end of sections \\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}. Since many cosmological studies, especially previous LISA forecasts \\cite{VanDenBroeck:2010fp,Petiteau:2011we}, also consider models in which the EoS of dark energy is a single parameter (without running), in Tables~\\ref{tab:standard_errors} and \\ref{tab:standard_errors_opt} we have provided the errors that eLISA can obtain once all parameters, except $w_0$, are fixed to their fiducial values. For N2A5M5L6, these are of the order of 5-8\\% in the conservative scenario and 2.5-4\\% in the optimistic one, in agreement with what found in \\cite{Petiteau:2011we}.\n\nFinally, we want to asses the capability of eLISA to constrain the Hubble constant. We consider the $\\Lambda$CDM model with ${\\Omega}_M$ fixed: the errors are given in row seven of Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}.\nIn the conservative scenario, N2A5M5L6 can constrain $h$ to 0.8\\% in the  Q3nod model and to 1.5\\% in the Q3d model, while for N2A2M5L4 the constraints worsen to 1.3\\% in Q3nod and to 2.6\\% Q3d. On the other hand, for the optimistic scenario, N2A5M5L6 can constrain $h$ up to 0.45\\% in Q3nod and to 0.67\\% in Q3d, while for N2A2M5L4 the constraints worsen to the range 0.7-1.4\\%.\n\nThese errors are better than, or at least competitive with, the last CMB measurement (Planck 2015), which is at the level of 1.3\\%: from Ref.~\\cite{Ade:2015xua}, $h=0.678\\pm 0.009$. Note, however, that the quoted Planck measurement is derived by marginalising over all other parameters of the $\\Lambda$CDM model (which are six for the CMB), while here we fix them. The marginalised $\\Lambda$CDM constraints for eLISA are slightly worse than the CMB one, except in the optimistic scenario for N2A5M5L6; see sections \\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}.\nThe relevant point is that {\\it eLISA can provide a competitive constraint on $h$, fully independent from other cosmological probes since it does not relies solely on optical measurements}. This will be particularly important given the present tension on the value of $h$ between the CMB, BAO, and cosmic distance ladder data sets (see e.g.~the discussions in \\cite{Ade:2015xua} and in \\cite{Bennett:2014tka}).\n\n\n\\section{Figures of merit and comparison of eLISA configurations}\n\\label{sec:FoM}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{FoMs.pdf}\n\\end{center}\n\\caption{Figures of merit as defined in Eq.~\\eqref{FoM}, for each eLISA configuration, the three MBHB formation scenarios and two of the considered cosmological models: $\\Lambda$CDM and DDE. We show the representative FoM (which corresponds to the median of the PDF of the FoM, see section \\ref{sec:statistic}), together with the 10th and 90th percentile (respectively, the lower and upper (grey) points for each configuration). On the left panels we present the FoM for the inspiral only scenario (conservative), while on the right ones we present the FoM for the merger \\& ringdown scenario (optimistic).}\n\\label{fig:FoM}\n\\end{figure} \n\nThe FoM as defined in section \\ref{sec:statistic} can be used as an estimator to compare possible eLISA configurations in their capability to test cosmology. In Fig.~\\ref{fig:FoM} we show the FoM for each eLISA configuration, two cosmological models ($\\Lambda$CDM and DDE), the three MBHB formation models and both the conservative and optimistic scenarios. As explained in section \\ref{sec:statistic}, our simulated catalogues have a considerable scatter: we thus choose as representative the FoM that corresponds to the median of the PDF of the FoMs, but in Fig.~\\ref{fig:FoM} we also show the 10th and 90th percentiles to give an idea of the scatter.\n\nThe absolute value of the FoMs in Fig.~\\ref{fig:FoM} cannot be directly related to the error on the cosmological parameters, because of the well known degeneracies among them. However, their relative values can be used as indicators of the ability of eLISA configurations to constrain different cosmological models.\nIt is clear from Fig.~\\ref{fig:FoM} that $\\Lambda$CDM is always better constrained than the DDE model. In fact, this latter model is better tested by sources at low redshift, which are rare for the MBHB standard sirens considered in our analysis. Note that this is the only cosmological model for which the FoM can be directly compared with the errors on $w_p$ and $w_a$, and corresponds to the square root of the FoM defined in the Euclid Study Report \\cite{Laureijs:2011gra} (cf.~sections~\\ref{sub:inspiral_only_scenario_} and \\ref{sub:merger_and_ring_down_scenario}).\n\nRegarding the MBHB formation scenarios, we see from Fig.~\\ref{fig:FoM} that in general the Q3nod model systematically gives the best results, while the Q3d model always gives the worse results (although in the optimistic scenario, the results provided by Q3d are comparable with the ones provided by popIII). The reason for this resides in the fact that the three scenarios predict quite different numbers of detectable MBHB events, and therefore of useful standard sirens, as clearly shown in Fig.~\\ref{fig:ss} (cf.~section~\\ref{sec:counter}).\n\nFor what concerns the different eLISA configurations, Fig.~\\ref{fig:FoM} shows that the trend does not depend much on the cosmological model. All eLISA configurations with six links, apart from N1A1M5L6 and perhaps N1A2M5L6, have roughly similar FoMs, especially in the optimistic scenario, and therefore have on average the same constraining power on cosmology. In addition, the best configuration with four links (N2A5M5L4) is at the same level as these; note however that this configuration is technically very challenging, due to the length of the arms.\nThe results that one can obtain with N2A2M5L4 depend on the MBHB formation model: in Q3d, this configuration has no constraining power, while it improves for the other MBHB formation models. Moreover, in the popIII and Q3nod scenarios, the constraining power of N2A2M5L4 is roughly similar to that of the worst configuration with six links (N1A1M5L6), implying that the errors of the latter are expected to be comparable to the ones presented in Table~\\ref{tab:standard_errors} (though slightly worse) and Table~\\ref{tab:standard_errors_opt} (though slightly better).\nAll other L4 configurations give basically no constraints on cosmology: the resulting errors on the parameters are always worse than 100\\% and formally infinite in most cases, corresponding to no constraints (cf.~Fig.~\\ref{fig:PoM}).\nThis is mainly due to the low number of standard sirens detected with these configurations (cf.~Fig.~\\ref{fig:ss}), as a result of their low sensitivity and, critically, lack of angular resolution.\n\nWhen we analysed detector performances in the previous section, we focused on N2A5M5L6 and N2A2M5L4, having in mind that they respectively provide the best and worst possible cosmological constraints (other four-link configurations being unable to constrain cosmology at any level).\nFig.~\\ref{fig:FoM} confirms this statement, but also shows that in both the conservative and optimistic scenarios, the best four six-link configurations and the best four-link one all provide comparable constraints, being their FoMs approximately similar.\nN1A2M5L6 instead yields slightly worse constraints, especially in the Q3d case and in the conservative scenario, while the results obtained with N1A1M5L6 and N2A2M5L6 are even worse.\nWith all remaining four-link configurations it is impossible to do cosmology.\nFocusing on N2A5M5L6 and N2A2M5L4 we therefore provide results that are representative of almost all possible eLISA configurations, as summarised in Table~\\ref{tab:eLISA_configurations}. Moreover, the choice of N2A5M5L6 is motivated by the fact that it corresponds to the old LISA configuration (namely the best possible one), while N2A2M5L4 is a reasonable design for a de-scoped mission (as mentioned before, N2A5M5L4 is technically much more challenging).\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|c|}\n\\hline\nN2A5M5L6 & \\multirow{5}{7.5cm}{Constraints comparable to or slightly worse than N2A5M5L6 (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).} \\\\\nN2A2M5L6 & \\\\\nN2A1M5L6 & \\\\\nN1A5M5L6 & \\\\\nN2A5M5L4 & \\\\\n\\hline\n\\multirow{2}{*}{N1A2M5L6} & \\multirow{1}{7.5cm}{Constraints worse than N2A5M5L6, but better than N2A2M5L4.} \\\\\n& \\\\\n\\hline\nN1A1M5L6 & \\multirow{2}{7.5cm}{Constraints comparable to or slightly better than N2A2M5L4 (cf.~Table~\\ref{tab:standard_errors} and Table~\\ref{tab:standard_errors_opt}).} \\\\\nN2A2M5L4 & \\\\\n\\hline\nN2A1M5L4 & \\multirow{4}{7.5cm}{Constraints worse than N2A2M5L4 or no constraints at all.} \\\\\nN1A5M5L4 & \\\\\nN1A2M5L4 & \\\\\nN1A1M5L4 & \\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Comparison of different eLISA configurations in constraining cosmology (see section~\\ref{sec:FoM}).}\n\\label{tab:eLISA_configurations}\n\\end{table}\n\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nThis work has been devoted to the investigation of one of the possible cosmological implications of the eLISA mission, namely the constraints that can be put on the cosmological parameters by using GW standard sirens. Considering three models for the MBHB formation (heavy seeds without delays, heavy seeds with delays and popIII stars), we have produced catalogues of MBHB events and selected those for which a counterpart may realistically be observed, according to the procedure outlined in section~\\ref{sec:counterparts}. The main issue for the identification of a counterpart resides in the capability of obtaining a sufficiently accurate sky localisation: in this respect, we have considered both a conservative and an optimistic scenario. In the first one the sky localisation error is assumed to be determined only by the analysis of the inspiral waveforms; in the second one, by \nanalysing the whole waveforms including also the merger and ringdown phases. In this latter scenario we have also assumed a de-lensing by a factor of two (see discussion in section \\ref{sec:statistic}). \n\nIf only the inspiral phase can be used to localise the counterpart, fewer standard siren events are available to constrain cosmology. In this case, we have found that meaningful constraints can be provided only by the six-link configurations with best noise level (N2), or by N1A5M5L6 and N2A5M5L4. This is true in all the three MBHB formation models, though Q3d gives slightly worse results. For all cosmological models considered, the constraints on the parameters by eLISA alone are systematically worse than the current ones, obtained by combining different cosmological probes (SNIa, CMB and BAO). However, even in this conservative scenario, eLISA can be used to set an independent (i.e., not relying exclusively on electromagnetic measurements) constraint on the Hubble parameter at the level of 1-2\\%, depending on the mission configuration (with all other parameters fixed to their best fit value). On the other hand, due to the small number of low redshift events, the constraints in the conservative scenario on DDE are not competitive with present combined constraints, and will therefore not be relevant by the time eLISA is launched, i.e.~after Euclid.  \n\nIf the error on the sky location can be reduced by including the merger and ringdown phases, and a de-lensing by a factor two can be taken into account, the power of eLISA to constrain cosmological parameters considerably improves. All six-link configurations can provide significant constraints, together with the best two four-link configurations (N2A5M5L4 and N2A2M5L4). Therefore, besides improving the overall constraining power of the configurations that were relevant in the conservative scenario, one also gains three other potentially useful configurations: N1A2M5L6, N1A1M5L6 and N2A2M5L4. The measurement of the Hubble parameter can reach a precision of 1-3\\% depending on the MBHB formation model in the $\\Lambda$CDM scenario, i.e.~without fixing $\\Omega_M$, for all six-link configurations with the best noise level, plus N1A5M5L6 and N2A5M5L4. This goes down to 0.45-0.7\\% if one fixes $\\Omega_M$ to its fiducial value, providing therefore a measurement of $h$ far more precise than current constraints. For the remaining interesting configurations (N1A2M5L6, N1A1M5L6 and N2A2M5L4) these errors degrade by a factor $\\sim 2$--3.\nMoreover, DDE can be probed in the optimistic scenario to a level comparable with present constraints: down to 2-4\\% for $w_p$ with $\\Delta w_a=$0.5--1, depending on the MBHB formation model, for all six-link configurations with the best noise level, plus N1A5M5L6 and N2A5M5L4. The remaining N1A2M5L6, N1A1M5L6 and N2A2M5L4 configurations give 4-8\\% accuracy on $w_p$ and $\\Delta w_a=$1--3. \n\nAs for the constraints on $\\Omega_M$, even in the best case scenario, namely with the N2A5M5L6 configuration, the Q3nod model, and fixing all other cosmological parameters, one can at most reach a precision of 2.6\\%: yet not comparable to the one of CMB measurements (which is at the level of 0.4\\%), but better than the one reached by present SNIa catalogues (which is at the level of 11\\%).\nThe constraints in the $(\\Omega_M, \\Omega_\\Lambda)$ parameter space are also better than those provided by SNIa (cf.~Fig.~\\ref{fig:SNe_like}), and they are characterised by a different degeneracy, since MBHB standard sirens are visible at higher redshift.\nIndeed, the novelty with respect to the CMB and SNIa measurements resides in the fact that eLISA has the potential to probe the expansion of the universe in the redshift range $1\\lesssim z\\lesssim 8$, which has not yet been tested by present observations. Although in the $\\Lambda$CDM model, for this redshift range, the universe is supposed to be simply dominated by dark matter and decelerate accordingly, eLISA could prove useful to constrain alternative cosmological models predicting a different expansion rate at very high redshift: for example, early or interacting dark energy, decaying dark matter, unified dark matter models and so on (see e.g.~\\cite{Aubourg:2014yra,Ade:2015rim} where a similar analysis has been done with BAO and CMB data).\nThe investigation of these alternative cosmological models will be considered in a future study.\n\nIt has been pointed out that a well-identified electromagnetic counterpart may not be necessary to measure the cosmological parameters with eLISA: \na statistical method for the  identification of a source's redshift can be used, as described in \\cite{MacLeod:2007jd,Babak:2010ej,Petiteau:2011we}. For eLISA, this method has the advantage of exploiting not only MBHBs as standard sirens, but also extreme mass ratio inspirals (EMRIs), which should be detected in large numbers (see \\cite{AmaroSeoane:2012je} and references therein). EMRIs are expected to be more abundant than MBHBs at low redshift, and might therefore provide a better way to probe the late time acceleration and DDE models, improving in this way the constraints obtained in the present analysis. This study is currently under investigation within the eLISA consortium.\n\nIn summary, standard sirens with eLISA {\\it in its best configurations} have the potential to provide a complementary and calibration-free way to test the expansion of the universe (and in particular $H_0$) with entirely different systematics than present probes (e.g. SNIa), which rely on electromagnetic observations only. This would constitute an important additional scientific gain for a mission that has been designed to detect the gravitational signal of MBHBs. \n\n\n\n\n\\acknowledgments\n\nWe would like to thank Volker Beckmann, Emanuele Berti, Marc Betoule, Marco Cirelli, Zoltan Haiman, Daniel Holz, Bradley Kavanagh, Joseph Lazio, Camilla Pacifici and Daniela Paoletti for providing us with very valuable informations that were used in this analysis.\nE.~Barausse acknowledges support from the European\nUnion's Seventh Framework Programme (FP7/PEOPLE-2011-CIG) through the\nMarie Curie Career Integration Grant GALFORMBHS PCIG11-GA-2012-321608, and\nfrom the H2020-MSCA-RISE-2015 Grant No. StronGrHEP-690904.\n\nA.~Sesana is supported by a University Research Fellowship of the Royal\nSociety.\n\nA.~Klein is supported by NSF CAREER Grant\nNo.~PHY-1055103.\n\n\nComputations were\nperformed on the gpc supercomputer at the SciNet HPC Consortium, as well as on the ``Projet Horizon Cluster'' at the Institut d'astrophysique de Paris.\n\n\n\\appendix\n\\section*{Appendix}\n\\section{Quasar bolometric luminosity}\n\\label{app:luminosity}\nOur semi-analytical galaxy formation model tracks the evolution of the ``reservoir'' of nuclear gas \navailable for accretion onto the central massive BH under a variety of physical processes, represented schematically in \nFig.~\\ref{fig:model}. In more detail, we follow \\cite{mymodel,spin_model,letter,newpaper} and assume that accretion takes place on a ``viscous'' timescale\n\n", "index": 31, "text": "\\begin{equation}\nt_{\\nu}\\approx {\\rm Re}\\, t_{\\rm dyn}\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"t_{\\nu}\\approx{\\rm Re}\\,t_{\\rm dyn}\\,,\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>ν</mi></msub><mo>≈</mo><mrow><mpadded width=\"+1.7pt\"><mi>Re</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>t</mi><mi>dyn</mi></msub></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07112.tex", "nexttext": "\nwhere $M_{\\rm res}$ is the reservoir's mass, $L_{\\rm Edd}=1.26\\times 10^{38} \\left( {M}/{M_\\odot} \\right)\\,{\\rm erg/s} $ is the Eddington luminosity, and\n$\\eta(a_{\\rm bh})$ is the BH's radiative efficiency (which is in turn a function of the spin parameter $a_{\\rm bh}$).\nAlso, the accretion rate is limited to a multiple \nof the  Eddington mass accretion rate $\\dot{M}_{\\rm Edd}$\nby a free parameter $A_{\\rm Edd}$, which we set to $A_{\\rm Edd}=1$ for heavy seeds, and to $A_{\\rm Edd}\\approx2.2$ for light seeds (so as to allow for mildly super-Eddington accretion~\\cite{supereddington}). \nThe bolometric quasar luminosity is then simply determined via $ L_{\\rm bol}=\\dot{M}_{\\rm bh,\\,QSO} c^2$.\n\n\\section{Details of the statistical method}\n\\label{app:statistics}\n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=.9\\textwidth]{LCDM_percentile.pdf}\n\\end{center}\n\\caption{2$\\sigma$ likelihood contours derived from the Fisher matrix which gives an FoM closest to the median of the FoM PDF (used in all previous results), and to the Fisher matrices which give FoMs closest to its 20th and 80th percentile. The plot is for $\\Lambda$CDM, the configuration N2A5M5L6, and the popIII model.}\n\\label{fig:LCDM_percentile}\n\\end{figure}\n\nAs discussed in section \\ref{sec:statistic}, when drawing likelihood contour plots for the cosmological parameters, \nwe have always shown the results obtained from the Fisher matrix that gives the closest FoM \nto the median of the FoM PDF. The models of MBHB formation discussed in \nsection~\\ref{sec:BHbinaries} provide source catalogues with an intrinsic, unavoidable scatter \ndue to the stochastic nature of galaxy and massive BH formation and evolution. \nWe have therefore made a choice for the Fisher matrix that in our opinion could best \nrepresent the performance of a given eLISA design. \nTo have an idea of the possible scatter of the constraints on the cosmological parameters, \nin Fig.~\\ref{fig:LCDM_percentile} we plot the likelihood contours \nderived from the Fisher matrix that gives the closest FoM to the median of the FoM PDF, and from the Fisher \nmatrices that give the closest FoM to the 20th and 80th percentiles. \nThe plots are for the configuration N2A5M5L6 and for the PopIII model in both the conservative\n (inspiral only) and optimistic (inspiral, merger and ringdown) scenarios. \n We have decided to show this figure for the $\\Lambda$CDM case, \n since it is the most representative of the present situation in cosmology.\nAs  can be seen from Fig.~\\ref{fig:LCDM_percentile}, the constraints on the parameter space might be either\nslightly better or slightly worse than those obtained with the median Fisher matrix.\nNote that the degeneracy between $\\Omega_M$ and $h$ changes when going \nfrom worse to better measurements, implying that catalogues with higher FoM \n(which better constrain the parameter space) are more efficient at measuring \nsome of the parameters (e.g.~$h$ for $\\Lambda$CDM) than others (e.g.~$\\Omega_M$).\n\nAlthough we have simulated 118 catalogues for each MBHB formation scenario in order to improve our statistics,\nthe scatter of the properties of the MBHB population across the catalogues is still quite high. \nThis can be understood by looking at the probability distribution of the FoM. In Fig.~\\ref{fig:PDF} we plot the PDFs \n of the FoM of the 118 catalogues, for each MBHB formation scenario, \n two eLISA configurations and two cosmological models ($\\Lambda$CDM and DDE), \n in both the optimistic and conservative scenarios. The FoM is defined as in Eq.~\\eqref{FoM}.\nNaturally, the distributions are more peaked (and their peaks are centred on higher values of the FoM) \nfor the cosmological models characterised by fewer parameters.\nThe Q3d model gives systematically the worst FoM for any eLISA configuration and any cosmological model, because\n fewer BH binaries are formed in this model than in the other two (see Fig.~\\ref{fig:ss}). \n The 90th and 10th percentiles of the FoM PDF \n capture essentially all the scatter in the FoM, and we therefore quote these values \n when presenting the results in section~\\ref{sec:FoM}. \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=\\textwidth]{Prob_of_measure.pdf}\n\\end{center}\n\\caption{Percentage of catalogues giving finite errors (i.e.~the probability of constraining at some finite level the cosmological parameters) in the $\\Lambda$CDM model for the different eLISA configurations.}\n\\label{fig:PoM}\n\\end{figure} \n\n\\begin{figure}\n\\begin{center}\n\t\\includegraphics[width=.85\\textwidth]{PDF.pdf}\n\\end{center}\n\\caption{Probability distribution functions for the FoM of N2A5M5L6 and N2A2M5L4. The three curves show the three astrophysical models of MBHB formation and evolution: popIII in blue, Q3d in red and Q3nod in yellow. We show the results for the $\\Lambda$CDM and DDE cosmological models (two-parameter models) in both the conservative (inspiral only) and optimistic (inspiral plus merger and ringdown) scenarios.}\n\\label{fig:PDF}\n\\end{figure}\n  \nAs discussed above, when we define one single FoM per configuration, \ncosmological model and MBHB formation scenario, we choose the median of the FoM PDF (shown in Fig.~\\ref{fig:PDF}). \nThis is useful to compare different eLISA configurations. However, when we need to plot likelihood contours, \nwe select a single covariance matrix for each eLISA configuration/MBHB formation scenario/cosmological model, namely \nthe one that gives the closest FoM to the median of the FoM PDF. This is done first \nin the five-parameter cosmological model. When we reduce \nto the three-parameter model of $\\Lambda$CDM with curvature, \nwe re-calculate the  FoM PDF by using all the Fisher matrices $F_{ij}^C$, in which we\nimpose an exact prior on $w_0$ and $w_a$ by deleting the corresponding\nrows and columns, and then find again the median. The same procedure is used\n for each two-parameter model analysed, i.e.~we always re-calculate the FoM PDF, \n starting from the complete set of the Fisher matrices with the relevant rows and columns removed.\n\nTo provide instead an estimate of the 1$\\sigma$ standard errors on the cosmological parameters, \nwe consider the median of the errors resulting from all the 118 catalogues pertaining to a given\nMBHB formation model and cosmological model (and for a given eLISA design), as explained in section~\\ref{sec:statistic}.\nFor some of the eLISA configurations (notably the L4 ones), the number of standard sirens is not \nenough to constrain the parameters of the cosmological model.\nThese cases are characterised by ill-defined Fisher matrices (with negative eigenvalues), \nand usually appear when the number of data points is lower than the number of cosmological parameters.\nIn these situations, the covariance matrix cannot be defined in a consistent manner,\n and the standard errors cannot be derived in the usual way.\nFor this reason, as mentioned in section~\\ref{sec:statistic}, when the low number of standard sirens does not allow one to \nconstrain the cosmological parameters, we simply assume infinite errors on them, and we do not take  \ninto account the corresponding catalogues when calculating the median FoM.\nThe resulting representative errors (cf.~Table~\\ref{tab:standard_errors} \nand Table~\\ref{tab:standard_errors_opt}) must thus always be considered in combination \nwith the probability of measurement $P$, i.e.~the percentage of catalogues that actually provide non-infinite errors.\nA comparison between the probability of measurement $P$ of all the different eLISA configurations is shown \nin Fig.~\\ref{fig:PoM}, for both the conservative and optimistic scenarios.\nLooking at Fig.~\\ref{fig:PoM}, on the one hand it is clear that for six-link\n configurations, especially in the optimistic scenario, there are few catalogues \n for which the cosmological parameters cannot be constrained.\nOn the other hand, in the worst four-link configurations the majority of catalogues cannot provide any constraints\n on the cosmological parameters, while the situation improves for the best designs, which have \n  comparable performance to six-link configurations in the optimistic scenario.\nAs expected, the\nQ3d model always gives systematically lower probability $P$ than the other two models, \ndue to the lower number of detectable standard sirens (cf.~Fig.~\\ref{fig:ss}).\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{|c|cc|cc|cc|}\n\t\\hline\n\t& \\multicolumn{2}{|c|}{20th perc.} & \\multicolumn{2}{|c|}{50th perc.} & \\multicolumn{2}{|c|}{80th perc.} \\\\\n\t\\hline\n\t& $\\Delta \\Omega_M$ & $\\Delta h$ & $\\Delta \\Omega_M$ & $\\Delta h$ & $\\Delta \\Omega_M$ & $\\Delta h$ \\\\\n\t\\hline\n\t\\multirow{2}{*}{INSPIRAL} & 0.0784 & 0.0438 & 0.0489 & 0.0220 & 0.0313 & 0.0123 \\\\\n\t\\multirow{2}{*}{ONLY} & 0.152 & 0.0900 & 0.0971 & 0.0478 & 0.0478 & 0.0201 \\\\\n\t& 0.0606 & 0.0280 & 0.0339 & 0.0128 & 0.0284 & 0.00968 \\\\\n \t\\hline\n \t\\multirow{2}{*}{MERGER \\&} & 0.0450 & 0.0247 & 0.0251 & 0.0122 & 0.0213 & 0.00896 \\\\\n \t\\multirow{2}{*}{RINGDOWN} & 0.0535 & 0.0337 & 0.0338 & 0.0186 & 0.0184 & 0.00829 \\\\\n \t& 0.0250 & 0.0127 & 0.0168 & 0.00737 & 0.0162 & 0.00688 \\\\\n \t\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Scatter of the errors of the parameters of the $\\Lambda$CDM model for both conservative (inspiral only) and optimistic (merger \\& ringdown) scenarios with N2A5M5L6 (cf.~Fig.~\\ref{fig:LCDM_percentile}). The errors in the middle column (50\\% percentile, given inverting the covariance matrix which provides an FoM closest to the median of the FoM PDF) are only slightly different from the median errors, those of the fourth column of Table~\\ref{tab:standard_errors}.}\n\\label{tab:errors_scatter}\n\\end{table}\n\nFinally, in order to compare the median of the errors and the errors obtained from the covariance matrix whose \nFoM is closest to the median of the FoM distribution (i.e.~the one used to plot likelihood contours), \nin Table~\\ref{tab:errors_scatter} we show the errors obtained from \nthe covariance matrices used in Fig.~\\ref{fig:LCDM_percentile}.\nComparing the 50th percentile (central column) values in Table~\\ref{tab:errors_scatter} with the corresponding ones \nin Table~\\ref{tab:standard_errors}, one can see that the former well represent the latter, \nat least for the $\\Lambda$CDM cosmological model.\nFurthermore, Table~\\ref{tab:errors_scatter} gives an \nidea of the possible scatter that we can obtain within the same cosmological model and MBHB formation scenario.\nIn fact, the errors obtained from the nearest covariance matrix to the 20th and 80th percentile of the \nFoM distribution are presented together with the 50th percentile (i.e.~the median).\nWe see from Table~\\ref{tab:errors_scatter} that the errors vary at most by a factor of 5 in both conservative and optimistic scenarios.\n\n\n\\bibliographystyle{unsrt}\n\\bibliography{COSMO_paper}\n\n\n\n\\newpage\n\n\\begin{table}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c|c|c|c|ccc|ccc|c|}\n\t\\hline\n\t & SNR & $\\Delta\\Omega<$ & \\multirow{2}{*}{LSST} & \\multicolumn{3}{c|}{SKA (radio only)} & \\multicolumn{3}{c|}{SKA + ELT} & \\multirow{2}{*}{Total} \\\\\n\t & $>$ 8 & $10\\,{\\rm deg}^2$ &  & Flare & Jet & Total & Spec & Photo & Total & \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A1M5L4} \n\t\t\t\t\t\t\t  & 28.8 & 0.569 & 0.0259 & 0.534 & 0.431 & 0.534 & 0.388 & 0.147 & 0.534 & 0.534 \\\\\n\t\t\t\t\t\t\t  & 11.9 & 0.0517 & 0.0172 & 0.0517 & 0.0259 & 0.0517 & 0.0517 & 0 & 0.0517 & 0.0517 \\\\\n\t\t\t\t\t\t\t  & 90.9 & 0.431 & 0 & 0.319 & 0.00862 & 0.319 & 0.259 & 0.0603 & 0.319 & 0.319 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A2M5L4} \n\t\t\t\t\t\t\t  & 69.0 & 1.54 & 0.0431 & 1.44 & 1.23 & 1.44 & 0.836 & 0.526 & 1.36 & 1.36 \\\\\n\t\t\t\t\t\t\t  & 21.8 & 0.0517 & 0.0172 & 0.0517 & 0.0172 & 0.0517 & 0.0517 & 0 & 0.0517 & 0.0517 \\\\\n\t\t\t\t\t\t\t  & 178 & 1.39 & 0.00862 & 0.914 & 0.0259 & 0.914 & 0.655 & 0.259 & 0.914 & 0.914 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A5M5L4} \n\t\t\t\t\t\t\t  & 150 & 2.96 & 0.0948 & 2.67 & 2.35 & 2.72 & 1.42 & 1.14 & 2.56 & 2.56 \\\\\n\t\t\t\t\t\t\t  & 33.7 & 0.181 & 0.0603 & 0.181 & 0.129 & 0.181 & 0.172 & 0.00862 & 0.181 & 0.181 \\\\\n\t\t\t\t\t\t\t  & 336 & 3.61 & 0.0172 & 2.01 & 0.103 & 2.02 & 1.40 & 0.586 & 1.98 & 1.98 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A1M5L4} \n\t\t\t\t\t\t\t  & 93.7 & 2.92 & 0.112 & 2.60 & 2.09 & 2.62 & 1.68 & 0.871 & 2.55 & 2.55 \\\\\n\t\t\t\t\t\t\t  & 37.4 & 0.328 & 0.112 & 0.328 & 0.181 & 0.328 & 0.319 & 0.00862 & 0.328 & 0.328 \\\\\n\t\t\t\t\t\t\t  & 415 & 4.39 & 0.0517 & 2.63 & 0.164 & 2.64 & 1.83 & 0.733 & 2.56 & 2.56 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A2M5L4} \n\t\t\t\t\t\t\t  & 229 & 5.87 & 0.224 & 5.16 & 4.63 & 5.39 & 2.65 & 2.35 & 5.00 & 5.00 \\\\\n\t\t\t\t\t\t\t  & 39.4 & 0.836 & 0.353 & 0.836 & 0.543 & 0.836 & 0.793 & 0.0345 & 0.828 & 0.828 \\\\\n\t\t\t\t\t\t\t  & 497 & 8.97 & 0.155 & 5.25 & 0.474 & 5.29 & 3.28 & 1.82 & 5.10 & 5.10 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A5M5L4} \n\t\t\t\t\t\t\t  & 520 & 12.9 & 0.371 & 11.1 & 11.3 & 12.3 & 4.61 & 5.83 & 10.4 & 10.4 \\\\\n\t\t\t\t\t\t\t  & 40.6 & 2.77 & 1.03 & 2.75 & 1.91 & 2.77 & 2.22 & 0.534 & 2.75 & 2.75 \\\\\n\t\t\t\t\t\t\t  & 557 & 18.7 & 0.534 & 11.1 & 1.39 & 11.2 & 5.95 & 4.15 & 10.1 & 10.1 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A1M5L6} \n\t\t\t\t\t\t\t  & 48.2 & 2.90 & 0.155 & 2.72 & 2.26 & 2.73 & 1.84 & 0.845 & 2.68 & 2.68 \\\\\n\t\t\t\t\t\t\t  & 17.1 & 0.741 & 0.267 & 0.741 & 0.543 & 0.741 & 0.612 & 0.129 & 0.741 & 0.741 \\\\\n\t\t\t\t\t\t\t  & 133.8 & 5.27 & 0.0776 & 4.42 & 0.241 & 4.42 & 2.10 & 1.71 & 3.81 & 3.81 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A2M5L6} \n\t\t\t\t\t\t\t  & 116 & 7.38 & 0.216 & 6.84 & 6.29 & 7.03 & 3.05 & 3.24 & 6.29 & 6.29 \\\\\n\t\t\t\t\t\t\t  & 27.7 & 1.98 & 0.569 & 1.97 & 1.47 & 1.98 & 1.36 & 0.560 & 1.92 & 1.92 \\\\\n\t\t\t\t\t\t\t  & 245 & 14.0 & 0.0862 & 9.67 & 0.612 & 9.68 & 3.36 & 4.10 & 7.47 & 7.47 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A5M5L6} \n\t\t\t\t\t\t\t  & 244 & 17.4 & 0.379 & 14.7 & 15.8 & 16.8 & 5.55 & 8.69 & 14.2 & 14.2 \\\\\n\t\t\t\t\t\t\t  & 37.7 & 4.91 & 1.09 & 4.84 & 3.79 & 4.91 & 2.66 & 1.94 & 4.59 & 4.59 \\\\\n\t\t\t\t\t\t\t  & 417 & 39.2 & 0.224 & 21.9 & 2.45 & 22.0 & 5.53 & 8.96 & 14.5 & 14.5 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A1M5L6} \n\t\t\t\t\t\t\t  & 152 & 13.6 & 0.543 & 12.1 & 11.8 & 13.0 & 5.67 & 6.22 & 11.9 & 11.9 \\\\\n\t\t\t\t\t\t\t  & 39.9 & 7.18 & 1.51 & 7.13 & 5.34 & 7.18 & 4.00 & 2.71 & 6.71 & 6.71 \\\\\n\t\t\t\t\t\t\t  & 499 & 49.2 & 0.431 & 27.8 & 3.55 & 27.9 & 6.92 & 10.9 & 17.8 & 17.8 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A2M5L6} \n\t\t\t\t\t\t\t  & 359 & 30.8 & 0.724 & 24.1 & 28.7 & 30.1 & 8.34 & 15.3 & 23.7 & 23.7 \\\\\n\t\t\t\t\t\t\t  & 40.8 & 11.9 & 1.97 & 11.7 & 8.54 & 11.9 & 5.59 & 5.31 & 10.9 & 10.9 \\\\\n\t\t\t\t\t\t\t  & 561 & 85.7 & 0.603 & 39.9 & 5.43 & 40.1 & 8.82 & 15.0 & 23.8 & 23.8 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A5M5L6} \n\t\t\t\t\t\t\t  & 682 & 71.5 & 0.940 & 46.9 & 69.1 & 70.7 & 12.1 & 30.0 & 42.1 & 42.1 \\\\\n\t\t\t\t\t\t\t  & 41.0 & 16.8 & 2.78 & 16.4 & 12.4 & 16.8 & 7.68 & 7.42 & 15.1 & 15.1 \\\\\n\t\t\t\t\t\t\t  & 595 & 149. & 1.03 & 60.8 & 9.16 & 61.2 & 11.6 & 20.8 & 32.4 & 32.4 \\\\\n\t\\hline\n\\end{tabular}}\n\n\\end{center}\n\\captionsetup{width=1.12\\textwidth}\n\\caption{In the conservative scenario (inspiral only), average values (5 years) of counterpart detections for all eLISA configurations and all three MBHB formation models: popIII, Q3d and Q3nod (respectively from top to bottom in each cell). From left to right the table shows: the eLISA detections (inspiral only), the eLISA detections with sky location error below 10 deg$^2$ (inspiral only), the optical counterparts observed with LSST, the radio counterparts observed with SKA (respectively from the flare, jet and both emissions combined), the optical observations with ELT of SKA counterparts hosts (with redshift measured spectroscopically and photometrically) and the total useful standard sirens (LSST + ELT).}\n\\label{tab:ss}\n\\end{table}\n\n\\newpage\n\n\\begin{table}\n\\begin{center}\n\\centerline{\\begin{tabular}{|c|c|c|c|ccc|ccc|c|}\n\t\\hline\n\t & SNR & $\\Delta\\Omega<$ & \\multirow{2}{*}{LSST} & \\multicolumn{3}{c|}{SKA (radio only)} & \\multicolumn{3}{c|}{SKA + ELT} & \\multirow{2}{*}{Total} \\\\\n\t & $>$ 8 & $10\\,{\\rm deg}^2$ &  & Flare & Jet & Total & Spec & Photo & Total & \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A1M5L4} \n\t\t\t\t\t\t\t  & 39.1 & 0.759 & 0.0431 & 0.664 & 0.448 & 0.664 & 0.517 & 0.147 & 0.664 & 0.664 \\\\\n\t\t\t\t\t\t\t  & 37.8 & 0.0776 & 0.0259 & 0.0776 & 0.0345 & 0.0776 & 0.0776 & 0 & 0.0776 & 0.0776 \\\\\n\t\t\t\t\t\t\t  & 370.6 & 0.681 & 0 & 0.466 & 0.00862 & 0.466 & 0.405 & 0.0603 & 0.466 & 0.466 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A2M5L4} \n\t\t\t\t\t\t\t  & 75.7 & 1.85 & 0.0862 & 1.63 & 1.28 & 1.63 & 1.03 & 0.526 & 1.55 & 1.55 \\\\\n\t\t\t\t\t\t\t  & 39.9 & 0.129 & 0.0776 & 0.129 & 0.0776 & 0.129 & 0.129 & 0 & 0.129 & 0.129 \\\\\n\t\t\t\t\t\t\t  & 488 & 2.23 & 0.0517 & 1.34 & 0.0948 & 1.34 & 1.08 & 0.259 & 1.34 & 1.34 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A5M5L4} \n\t\t\t\t\t\t\t  & 152 & 3.47 & 0.233 & 2.98 & 2.56 & 3.07 & 1.77 & 1.15 & 2.91 & 2.91 \\\\\n\t\t\t\t\t\t\t  & 40.7 & 0.647 & 0.267 & 0.647 & 0.414 & 0.647 & 0.586 & 0.0603 & 0.647 & 0.647 \\\\\n\t\t\t\t\t\t\t  & 566 & 5.33 & 0.181 & 3.11 & 0.362 & 3.14 & 2.37 & 0.716 & 3.09 & 3.09 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A1M5L4} \n\t\t\t\t\t\t\t  & 95.8 & 3.52 & 0.302 & 3.06 & 2.37 & 3.11 & 2.16 & 0.879 & 3.04 & 3.04 \\\\\n\t\t\t\t\t\t\t  & 40.7 & 1.16 & 0.534 & 1.16 & 0.767 & 1.16 & 1.05 & 0.112 & 1.16 & 1.16 \\\\\n\t\t\t\t\t\t\t  & 573 & 6.75 & 0.328 & 4.29 & 0.690 & 4.34 & 3.33 & 0.905 & 4.23 & 4.23 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A2M5L4} \n\t\t\t\t\t\t\t  & 230 & 7.03 & 0.638 & 6.10 & 5.46 & 6.47 & 3.69 & 2.40 & 6.09 & 6.09 \\\\\n\t\t\t\t\t\t\t  & 40.9 & 3.45 & 1.54 & 3.44 & 2.35 & 3.45 & 2.91 & 0.500 & 3.41 & 3.41 \\\\\n\t\t\t\t\t\t\t  & 595 & 13.7 & 0.690 & 8.66 & 1.71 & 8.79 & 5.87 & 2.54 & 8.41 & 8.41 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A5M5L4} \n\t\t\t\t\t\t\t  & 520 & 15.7 & 1.00 & 13.0 & 13.6 & 15.0 & 6.98 & 6.11 & 13.1 & 13.1 \\\\\n\t\t\t\t\t\t\t  & 41.0 & 14.7 & 3.47 & 14.6 & 10.3 & 14.7 & 8.82 & 5.48 & 14.3 & 14.3 \\\\\n\t\t\t\t\t\t\t  & 608 & 43.8 & 1.25 & 27.0 & 5.57 & 27.3 & 11.2 & 10.6 & 21.9 & 21.9 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A1M5L6} \n\t\t\t\t\t\t\t  & 57.7 & 8.15 & 0.862 & 6.71 & 6.36 & 7.52 & 5.59 & 1.88 & 7.47 & 7.47 \\\\\n\t\t\t\t\t\t\t  & 39.9 & 10.0 & 2.09 & 10.0 & 7.66 & 10.0 & 5.34 & 4.36 & 9.70 & 9.70 \\\\\n\t\t\t\t\t\t\t  & 461 & 32.2 & 0.724 & 24.7 & 4.07 & 24.8 & 7.49 & 9.30 & 16.8 & 16.8 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A2M5L6} \n\t\t\t\t\t\t\t  & 121 & 13.9 & 1.04 & 11.3 & 11.8 & 13.2 & 7.56 & 4.92 & 12.5 & 12.5 \\\\\n\t\t\t\t\t\t\t  & 40.8 & 15.1 & 2.71 & 15.0 & 11.1 & 15.1 & 7.33 & 6.85 & 14.2 & 14.2 \\\\\n\t\t\t\t\t\t\t  & 555 & 72.9 & 0.966 & 43.3 & 6.68 & 43.5 & 10.1 & 14.9 & 25.0 & 25.0 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N1A5M5L6} \n\t\t\t\t\t\t\t  & 246 & 24.3 & 1.17 & 18.8 & 22.1 & 23.6 & 10.2 & 10.8 & 21.0 & 21.0 \\\\\n\t\t\t\t\t\t\t  & 41.0 & 21.0 & 3.71 & 20.8 & 15.3 & 21.0 & 9.70 & 9.70 & 19.4 & 19.4 \\\\\n\t\t\t\t\t\t\t  & 599 & 142. & 1.28 & 64.5 & 10.2 & 65.2 & 12.7 & 20.4 & 33.1 & 33.1 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A1M5L6} \n\t\t\t\t\t\t\t  & 153 & 18.5 & 1.18 & 15.1 & 16.2 & 17.7 & 9.29 & 7.28 & 16.6 & 16.6 \\\\\n\t\t\t\t\t\t\t  & 41.0 & 23.4 & 4.16 & 23.2 & 17.1 & 23.4 & 11.1 & 10.6 & 21.7 & 21.7 \\\\\n\t\t\t\t\t\t\t  & 602 & 151. & 1.54 & 68.5 & 11.1 & 69.1 & 13.7 & 20.8 & 34.5 & 34.5 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A2M5L6} \n\t\t\t\t\t\t\t  & 360 & 35.4 & 1.24 & 26.8 & 32.9 & 34.7 & 11.7 & 16.6 & 28.2 & 28.2 \\\\\n\t\t\t\t\t\t\t  & 41.1 & 28.9 & 4.37 & 28.5 & 20.4 & 28.9 & 12.6 & 13.8 & 26.4 & 26.4 \\\\\n\t\t\t\t\t\t\t  & 610 & 214. & 1.79 & 84.5 & 13.5 & 85.3 & 15.3 & 25.1 & 40.5 & 40.5 \\\\\n\t\\hline\n\t\\multirow{3}{*}{N2A5M5L6} \n\t\t\t\t\t\t\t  & 683 & 75.2 & 1.28 & 49.0 & 72.7 & 74.5 & 14.6 & 31.2 & 45.8 & 45.8 \\\\\n\t\t\t\t\t\t\t  & 41.1 & 35.3 & 4.50 & 34.7 & 25.1 & 35.3 & 13.6 & 17.6 & 31.2 & 31.2 \\\\\n\t\t\t\t\t\t\t  & 611 & 385. & 1.88 & 127. & 18.5 & 128. & 16.7 & 33.3 & 50.0 & 50.0 \\\\\n\t\\hline\n\\end{tabular}}\n\n\\end{center}\n\\captionsetup{width=1.12\\textwidth}\n\\caption{The same as Table \\ref{tab:ss}, but in the optimistic scenario (with merger and ringdown and de-lensing of a factor of two).}\n\\label{tab:ss2}\n\\end{table}\n\n\n\n", "itemtype": "equation", "pos": 125683, "prevtext": "\nwhere ${\\rm Re}\\approx 10^3$ is the critical Reynolds number marking the onset of turbulence, and\n$t_{\\rm dyn}=G M_{\\rm bh}/\\sigma^3$ ($M_{\\rm bh}$ and $\\sigma$ being the BH mass and the stellar velocity dispersion) is the dynamical time at the BH's influence radius.\nAs such, the mass accretion rate $\\dot{M}_{\\rm bh,\\,QSO}$ onto the massive BH is computed as\n\n", "index": 33, "text": "\\begin{gather}\n\\dot{M}_{\\rm bh,\\,QSO}=\\min\\left(\\frac{M_{\\rm res}}{t_{ \\nu}},A_{\\rm Edd} \\dot{M}_{\\rm Edd}\\right)\\,,\\\\\n\\dot{M}_{\\rm Edd}=\\frac{L_{\\rm Edd}}{\\eta(a_{\\rm bh}) c^2}\\,,\n\\end{gather}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{M}_{\\rm bh,\\,QSO}=\\min\\left(\\frac{M_{\\rm res}}{t_{\\nu}},A_{%&#10;\\rm Edd}\\dot{M}_{\\rm Edd}\\right)\\,,\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mrow><mi>bh</mi><mo rspace=\"4.2pt\">,</mo><mi>QSO</mi></mrow></msub><mo>=</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mi>res</mi></msub><msub><mi>t</mi><mi>ν</mi></msub></mfrac><mo>,</mo><mrow><msub><mi>A</mi><mi>Edd</mi></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mi>Edd</mi></msub></mrow><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{M}_{\\rm Edd}=\\frac{L_{\\rm Edd}}{\\eta(a_{\\rm bh})c^{2}}\\,,\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mi>Edd</mi></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><msub><mi>L</mi><mi>Edd</mi></msub><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>a</mi><mi>bh</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>c</mi><mn>2</mn></msup></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}]