[{"file": "1601.00315.tex", "nexttext": "\n where $g\\left(\\omega\\right)$ is the plasmonic spectrum, and $\\left|I_{\\omega}\\right|^{2}$\nis the power spectrum of the generator current, which can be expressed\nas $\\left|I_{\\omega}\\right|^{2}=\\sum_{i,f}\\left|\\langle f|\\hat{T}|i\\rangle\\right|^{2}\\delta\\left(\\hbar\\omega-\\left(E_{f}-E_{i}\\right)\\right)$,\nwhere $\\hat{T}$ represents the tunneling matrix element operator.\nIt is evident that at the limit of energy independent tunneling and\nzero temperature one can approximate this expression by\\cite{Hone1978,Rendell1981,Persson1992,Uehara1992}\n\n\n", "itemtype": "equation", "pos": 3037, "prevtext": "\n\n\n\\begin{abstract}\nWe present an electrically driven plasmonic device consisting of a gold nanoparticle trapped in a gap between\ntwo electrodes. The tunneling current in the device generates plasmons,\nwhich decay radiatively. The emitted spectrum extends up to an energy that depends on the applied voltage.\nCharacterization of the electrical conductance at low temperatures allows us to extract the voltage drop on each tunnel barrier\nand the corresponding emitted spectrum. In several devices we find a pronounced sharp asymmetrical dip in the spectrum,\nwhich we identify as a Fano resonance.\nFinite-difference time-domain (FDTD) calculations reveal that this resonance is due to interference between the nanoparticle and electrodes\ndipolar fields, and can be conveniently controlled by the structural parameters.\n\nKeywords: Electrically driven plasmon; Plasmonics; Single Electron Transistor; Metallic nanoparticles; Fano Resonance; Photonic devices;\n\n\\end{abstract}\n\nElectrically driven plasmonic devices may offer unique opportunities\nas a research tool and for practical applications\\cite{GarciadeAbajo2010,Fan2012,Li2013,Rai2013,Sheldon2014}.\nIn such devices, current that flows across a metallic tunnel junction\nexcites a plasmon, which gives rise to light emission. The generation\nof the plasmon at the tunnel junction\\cite{Savage2012} is equivalent\nto feeding an antenna at its source. In that sense, it is different\nfrom regular optical excitation of plasmons, where the far field illumination\nis coupled to the plasmonic antenna, and then coupled out. This local\nnature of the excitation allows easy access into evanescent (or \"dark\")\nmodes, which are not easily excited by far field illumination\\cite{Hao2008,Savage2012}.\nFrom a more practical point of view, such devices may pave the way\nfor easy realization of on-chip optical communication and sensors\\cite{Bendana2011,Jeong2013,Huang2014,Sheldon2014,Cox2014,Tielrooij2015}.\n\nThe possibility to generate light in tunnel junctions was first suggested\nand demonstrated more than four decades ago. Light emission in metal-oxide-metal\nplanar tunnel junctions was observed and was attributed to plasmon\nmediated tunneling\\cite{Lambe1976,Hansma1978,Hone1978,Rendell1981}.\nA renewed interest in this phenomenon occurred in the early nineties,\nwhen light emission was reported in STM experiments\\cite{Coombs1988,Gimzewski1989,Berndt1991}.\nThe excellent control over the tunneling barrier in this system allowed\ndetailed investigation of the light emission process. Recently, this\nconcept was implemented in planar plasmonic structure, consisting\nof a metallic nanoparticle between two larger electrodes\\cite{Kern2015}.\n\nThe mechanism of light emission in such structures is well understood.\nConsider a metallic tunnel junction, biased by a voltage $V$, as\ndepicted in Figure~\\ref{fig1}(a). During the tunneling process electrons\nmay lose a fraction or all of their initial energy $eV$, exciting\na plasmon, and consequently emitting photons. One may express the\nemitted power as\n\n", "index": 1, "text": "\\begin{equation}\nS\\left(\\omega\\right)=\\left|I_{\\omega}\\right|^{2}*g\\left(\\omega\\right)\\label{eq:general_emission_spectrum}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S\\left(\\omega\\right)=\\left|I_{\\omega}\\right|^{2}*g\\left(\\omega\\right)\" display=\"block\"><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo>(</mo><mi>ω</mi><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mrow><mo>|</mo><msub><mi>I</mi><mi>ω</mi></msub><mo>|</mo></mrow><mn>2</mn></msup><mo>*</mo><mi>g</mi></mrow><mo>⁢</mo><mrow><mo>(</mo><mi>ω</mi><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00315.tex", "nexttext": "\nwhere $R_{0}$ is the DC junction resistance, and the applied voltage\n$V$ determines the maximal emitted photon energy. In practice, the\ntunneling rate does depend on energy, and the linear dependence on\nvoltage is a good approximation only for $\\hbar\\omega\\sim eV$.\nFurthermore, it was shown that photon emission at energies larger than $eV$ can also be obtained.\nThis is attributed to high order processes, in which an electron relaxation is accompanied by an excitation\nof another electron to an energy above the Fermi level\\cite{Schneider2013,Kaasbjerg2015,Buret2015}.\n\n\\begin{figure}\n\\includegraphics[width=1\\columnwidth]{system_diagram_combined}\n\\caption{(a) Energy scheme for tunneling across a single metallic tunnel junction\nwith a bias voltage $V$. Light emission at energy $\\hbar\\omega$\nis generated from tunneling electrons with energy $\\hbar\\omega<E<eV$.\n(b) Scanning electron microscope image (false color) of the SET -\na trapped gold nanoparticle between source (S) and drain (D) electrodes.\nTunneling current produces light emission. The scale bar corresponds\nto $\\unit[25]{nm}$.}\n\\label{fig1}\n\n\\end{figure}\n\nIn this paper we use a single electron transistor (SET) as a light\nemitting device. The general structure of the device is shown in Figure~\\ref{fig1}(b):\nelectrons tunnel from the source electrode (S) to the nanoparticle\n(NP) and then into the drain electrode (D). We show that the use of\nthis structure allows us to properly characterize the electrical properties\nof the two tunnel barriers, and determine their role in the light\nemission process. In some devices we find a Fano resonance, resulting\nfrom interference between the nanoparticle and electrodes dipolar fields.\nThis resonance is seen due to the local nature of the excitation,\nand is manifested as a sharp asymmetrical spectral dip. We show that\nthe spectral position of this resonance can be conveniently controlled\nby the design of the structural parameters.\n\nWe have previously demonstrated a technique of preparing metallic\nNP-based SET devices\\cite{Guttman2011,Vardi2014}. A bow-tie electrode\nstructure is patterned by e-beam lithography on n-doped silicon substrate\ncovered by a $\\unit[100]{nm}$ SiO$_{2}$ layer. Gold NPs of $\\unit[55]{nm}$\ndiameter are chemically synthesized\\cite{Cohen-Hoshen2012} and covered\nby a dense capping layer of mercaptosuccinic acid. The thickness of\nthis layer is $\\sim\\unit[0.5]{nm}$, defining a sub-nanometer tunnel\nbarrier between the NP and the electrodes. The NPs are brought into\na gap of $\\unit[30-35]{nm}$ between the two electrodes by means of\nelectrostatic trapping\\bibnotemark[2]. This provides an easy process,\nby which several devices can be simultaneously prepared. Optical and\nelectrical measurements were conducted in vacuum inside an optical\ncryostat (Janis Research ST-500HT), both at room temperature and at\ncryogenic temperatures ($T=\\unit[4.2]{K}-\\unit[6]{K}$).\n\nFigure \\ref{fig2}(a) shows the measured differential conductance\nof a typical device at the $V_{SD}-V_{G}$\nplane, where $V_{SD}$ and $V_{G}$ are the source-drain and gate\nvoltages, respectively. The characteristic diamonds structure consisting\nof low conductance Coulomb blockade regions is clearly seen near $V_{SD}=0$.\nAs we move along the $V_{G}$ axis, each diamond corresponds to charging\nthe NP by an additional electron. It is evident that this structure\nis highly asymmetric: strong conductance peaks appear at the upper\nleft and lower right boundaries of the diamonds, and they are much\nweaker at the opposite sides. This asymmetry becomes more visible\nat higher voltages, where it is seen as parallel conductance lines.\nThe origin of this asymmetry is the difference in tunnel conductance\nbetween the two barriers. By fitting the measurement to a conductance\nmodel\\cite{Guttman2011,Vardi2014} we could extract the relevant parameters\ncharacterizing each barrier\\bibnotemark[2], and in particular the\ntunnel conductance $g_{1}$ and $g_{2}$ of the two barriers. We note\nthat the ratio between these two conductances determines the division\nof $V_{SD}$ between the two barriers. In this particular device we\nobtain that $g_{1}=\\unit[0.3]{nS}$ and $g_{2}=\\unit[20.1]{nS}$,\nimplying that more than $98\\%$ of the voltage falls on barrier $1$.\nWe shall later see the implications of this asymmetry on the emission\nspectrum in these devices, as compared to symmetric devices.\n\nLight emission in the visible range occurs for $V_{SD}>\\unit[1.5]{V}$,\nmuch larger than the charging energy of our devices ($\\sim\\unit[8]{meV}$).\nIn this regime multiple transmission channels are possible and the\ndevice functions as a simple tunnel junction. The current-voltage\nrelation at this regime is shown in Figure~\\ref{fig2}(b), where we\nuse the Fowler-Nordheim representation. One can see that at $V_{SD}^{-1}<\\unit[0.8]{V^{-1}}$\nthe curve follows the Fowler-Nordheim equation, $I\\sim V_{SD}^{2}\\exp\\left(-\\alpha/V_{SD}\\right)$,\nwhich describes tunneling through a trapezoidal barrier ($\\alpha$\nreflects the barrier parameters). While the high voltage limit is\nfar beyond the Coulomb blockade regime, the characteristic conductances\nvalues, $g_{1}$ and $g_{2}$, measured at the low voltage still characterize\nthe voltage division between the two barriers.\n\n\\begin{figure}\n\\includegraphics[width=0.9\\columnwidth]{conductance_combined}\n\\caption{(a) Measurement of the differential conductance ($G=dI/dV_{SD}$)\nof a device as a function of the back-gate voltage $V_{G}$ and the\nsource-drain bias voltage $V_{SD}$, at temperature of $\\unit[4.2]{K}$.\n(b) Measured current-voltage ($I-V_{SD}$) relation presented at the\nFowler-Nordheim representation, where the natural logarithm of $I/V_{SD}^{2}$\nis plotted as a function of the inverse voltage $V_{SD}^{-1}$.}\n\\label{fig2}\n\\end{figure}\n\nOptical measurements were performed using a Nikon Eclipse Ti-E optical\nmicroscope with a $50$X objective (NA=$0.6$), equipped with an Andor\nShamrock $303$i Imaging Spectrograph and a Andor iXon $897$ EMCCD\ncamera. We find that as $V_{SD}$ increases above $\\sim\\unit[1.5]{V}$\na bright spot appears at the center of the bow-tie structure, and\nbecomes brighter as the voltage is further increased. This behavior\nis summarized in Figure~\\ref{fig3}(a), where the total number of counts\n$P$ is plotted as a function of the applied voltage $V_{SD}$ .\n\nThe observed rise of $P$ at $V_{SD}>\\unit[1.5]{V}$ is due to two\nfactors: (i) Enhanced tunneling rate, which is linear in $V$, as\ngiven by the current power spectrum $\\left|I_{\\omega}\\right|^{2}$\nin eq.~(2). (ii) Plasmonic enhancement\n- moving the cutoff voltage across the plasmonic spectrum, $g\\left(\\omega\\right)$.\n\nIt is interesting to note that this measurement of $P(V)=\\intop_{0}^{eV/\\hbar}S(\\omega)d\\omega$\ncan directly provide the plasmonic spectrum. It can be easily shown\\cite{Lambe1976}\nthat $\\partial^{2}P/\\partial V^{2}=g(V)$, hence, by simply measuring\nthe total emitted light intensity as a function of voltage one can\nobtain the plasmonic spectrum of such a structure. Figure~\\ref{fig3}(a)\ndemonstrates the strength of this technique by comparing the spectrum\nobtained through this procedure to an independent measurement of the\nlight scattering spectrum (in order to minimize the numerical noise\nwe first performed a fit to the curve and then took its numerical\nderivative). By performing this procedure on different structures,\nwith different plasmonic resonances, we have verified that this procedure\nindeed yields the correct spectrum\\bibnotemark[2]. Clearly, to obtain\nfine features in the spectrum one needs to conduct measurements with\nhigh signal-to-noise ratio.\n\n\\begin{figure}\n\\includegraphics[width=1\\columnwidth]{Light_emission_fig_combined}\n\\caption{(a) Total emitted light intensity, $P\\left(V\\right)$ (blue circles),\nas a function of the applied voltage. The plasmonic spectrum, $g\\left(V\\right)$,\nobtained from the \\nth{2} derivative of $P\\left(V\\right)$ (red line),\nand from an independent measurement of the light scattering (blue\ndots, shifted) are shown. Error bars are represented by the circles size.\nMeasurement was done at $T=\\unit[6]{K}$.\n(b) Spectral evolution of the emitted light\nof another device as a function of voltage (logarithmic scale), at\n$\\unit[50-100]{mV}$ intervals. The gradual build-up of the high energy\npart of the plasmonic spectrum is clearly seen, until the cutoff energy\nat $\\hbar\\omega=eV_{SD}$ (white dashed line). (c) Top: emitted light\nspectra at $V_{SD}=\\unit[1.7,1.8,1.9,2]{V}$ (magenta, green, red\nand cyan circles, respectively), fitted to a common plasmonic spectrum\n$g\\left(\\omega\\right)$ and different linear excitation power spectra\n$\\left|I_{\\omega}\\right|^{2}$ (solid gray lines). Bottom: the common\nplasmonic spectrum $g\\left(\\omega\\right)$ used to fit all emitted\nspectra (black solid line), and the linear excitation power spectra\nwith different energy cutoffs at $\\hbar\\omega=eV_{SD}$ (dashed lines,\ncolors as in top). The Measurements of b and c were done at $T=\\unit[4.5]{K}$.}\n\\label{fig3}\n\\end{figure}\n\n\nLet us now turn to study the evolution of the emitted spectrum with\nvoltage. As the voltage increases, the emitted spectrum evolves due\nto an increased tunneling rate and a larger overlap of the excitation\nenergies with the plasmonic spectrum. Figure \\ref{fig3}(b) shows\na compilation of $10$ spectra, at $\\unit[50-100]{mV}$ intervals\nbetween $\\unit[1.6]{V}$ and $\\unit[2.15]{V}$, measured by dispersing\nthe emitted light into a spectrometer (the intensity is presented\non a logarithmic scale). Indeed, one can clearly observe how the high\nenergy part of the plasmonic spectrum builds up with increasing voltage\nand the overall intensity becomes higher. The cutoff energy exactly\nat $\\hslash\\omega=eV_{SD}$ can be clearly seen in the figure. We\nfind that we could use eq.~(2) to fit all\nthe spectra, using the same plasmonic spectrum, $g(\\omega)$, and\nlinear excitation power spectrum, $\\left|I_{\\omega}\\right|^{2}$.\nThis is demonstrated for four spectra in Figure~\\ref{fig3}(c).\n\nAn implicit assumption that we used in the fits of Figure~\\ref{fig3}(c)\nwas that $V=V_{SD}$, namely - all the voltage that is applied on\nthe device falls on one barrier. As was shown in Figure~\\ref{fig2}(a)\nthis is indeed the case for very asymmetric devices, where $g_{2}/g_{1}\\gg10$,\nbut is not generally true. Measurements of different, more symmetric\ndevices, where $g_{2}/g_{1}\\thickapprox1$, show a cutoff energy which\nis significantly lower than $V_{SD}$, up to a factor of two\\bibnotemark[2].\nWe find that such symmetric devices experience large temporal fluctuations\nin the spectral lineshape, and in particular in the cutoff energy.\nIn these devices small changes in the tunnel junction conductances\nmay result in a significant different voltage division, and consequently\n- different cutoff energy. This emphasizes the importance of the low\nvoltage characterization at low temperatures.\n\nAn important feature of electrically driven plasmon is the local nature\nof the excitation. Contrary to a scattering measurement, in which\nplasmons are excited over a macroscopic area, here the plasmons are\ngenerated at the tunnel barrier over which the voltage drops. In that\nsense, this method is similar to electron energy loss spectroscopy\n(EELS), where a focused beam of electron excites a plasmon locally\\cite{Coenen2015}.\nThe implication is that we are able to probe local features of the\nplasmonic spectrum $g(\\omega)$. This is well manifested in our bow-tie\nstructure: while the far field scattering spectrum is dominated by\ncontributions of the large size electrodes, the local excitation emphasizes\nfine features arising from plasmonic interactions in the gap region.\nIndeed, in several devices ($3$ out of the $10$ measured) we find a peculiar spectrum, characterized\nby two adjacent peaks, with an asymmetric dip between them, as shown\nin Figure~\\ref{fig4}(a). We obtain a good fit of this spectrum to\na Fano behavior $\\left(F\\gamma+\\omega-\\omega_{0}\\right)^{2}/\\left[\\left(\\omega-\\omega_{0}\\right)^{2}+\\gamma^{2}\\right]$,\nwith a Fano factor $F=0.22$, indicating a strong interference between\ntwo resonances.\n\n\\begin{figure}\n\\includegraphics[width=1\\columnwidth]{Fano_fig_combined_edited}\n\\caption{(a) Measurement of light emission spectrum in a device demonstrating\na Fano spectral lineshape (blue circles), and a fit with a Fano factor\n$F=0.22$ and cutoff energy $\\unit[1.74]{eV}$ (red solid line). Measurement was done at $T=\\unit[4.5]{K}$.\n(b) FDTD simulation of the bow-tie electrodes and a trapped nano-disk.\nTop: sketch of the simulated geometry. Bottom: scattering spectra\nof electrodes with (blue) and without (red) nano-disk, and of an emitting dipole localized at the nano-disk center (green).\nThe insets show the spatial charge distribution at the different regimes, represented\nby the normal electric field component. (c) FDTD simulation of bow-tie\nelectrodes and a trapped nano-disk with different eccentricity ($R_{1}$,$R_{2}$\nare the major and minor axes of the ellipse), presenting the ability\nto control the Fano resonance in our structure.}\n\\label{fig4}\n\\end{figure}\n\nTo explain the appearance of a Fano resonance\\cite{Fano1961,Miroshnichenko2010}\nin our structure we use a simple toy-model, consisting of infinite\nelectrodes and a metal NP disk between them (top of Figure~\\ref{fig4}(b)).\nWe calculate the plasmonic spectrum of this structure using Finite-difference\ntime-domain (FDTD) method\\bibnotemark[2]. Figure \\ref{fig4}(b)\nshows the calculated scattering spectrum obtained by exciting a small\nregion around the disk. This excitation scheme is a simple way to\nrepresent the local nature of the excitation in our experiments. Remarkably, one\nobtains in this simple toy-model the clear Fano hallmarks: strong\nasymmetry and a pronounced interference dip between the peaks. As\nseen, these features appear only when the disk is present. We have\nverified that similar spectra are obtained when the disk is replaced\nby a sphere.\nOur calculations clearly demonstrate the importance of the local nature of the excitation\nin the observation of the Fano resonance.\nWe find that when we expand the illumination area the Fano feature gradually\ndisappears, and a simple single broad peak remains.\nIt is seen that the experimental spectral features (scattering and emission, Figures~\\ref{fig3},\\ref{fig4}(a)) are narrower than those obtained in the simulation.\nThis difference is explained in detail in the Supporting Information.\n\nTo understand how the Fano spectrum is created here it is instructive\nto examine the spatial charge distribution at the surface (represented\nby the normal electric field component), as shown in Figure~\\ref{fig4}(b).\nIt is seen that without the NP we obtain a simple dipolar distribution\naround the gap. This is manifested as a broad spectral lineshape,\nwhich serves as the continuum in the Fano representation\\cite{Giannini2011}.\nThe introduction of the NP radically changes this charge distribution:\nthe induced dipolar field at the NP forces an overall quadrupole-like\ndistribution in the structure, which suppresses the far field emission\\cite{Hao2008,Wu2011a}.\n\nIn order to demonstrate that the dip is indeed due to destructive interference between the NP and the electrodes resonances, we \"turn off\" this interference by exciting the structure with a dipole, localized at the NP center. This way of excitation affects mainly the NP, and the electrodes are only weakly excited.\nThe calculated spectrum under this excitation condition shows a clear peak, which is located at exactly the same spectral position as the Fano dip (Figure~\\ref{fig4}(b)).\nThis proves that indeed the electrodes play the role of a continuum, and the NP - of the narrow resonance.\n\nThe particle in a bow-tie structure allows easy control of the Fano resonance. This is\ndemonstrated in Figure~\\ref{fig4}(c), where the eccentricity of\nthe NP is gradually changed, from a circular disk to a narrow ellipse,\nwhile keeping the other structural parameters fixed. Remarkably, the\nFano dip moves to lower energy and becomes narrower, following the corresponding changes\nin the NP resonance spectral position and width. On the other hand, the Fano resonance\nis relatively insensitive to the details of the electrodes design:\nwhen changing the angle of the bow-tie electrodes we find that the\nFano dip remains at approximately the same spectral position\\bibnotemark[2].\nIt is important to note, however, that as the NP is moved down towards the bow-tie center,\nthe Fano resonance disappears\\cite{Hao2008}. This could explain the fact that the resonance is observed only in some of the devices: we believe\nthat in these devices the NP was trapped off the bow-tie center.\n\nFano resonances in plasmonic structures are of great recent interest\\cite{Hao2008,Neubrech2008,Aizpurua2008,Verellen2009,Fan2010,Lukyanchuk2010,Miroshnichenko2010,Pryce2010,Giannini2011,Wu2011a}.\nIt is suggested that their sharp characteristic spectral features\nand sensitivity to the sample parameters may turn them into efficient\nsensors. In that sense, the ability to generate such resonances in\nelectrically driven devices may amplify their potential. Furthermore,\nthe separate control of the interfering broad and narrow modes in\nthese devices offers an easy way of engineering the Fano resonance.\nSuch devices may be a step toward the realization of an on-chip, controllable\nnano-optical emitters and sensors, and be of a great interest to the\nnear-field microscopy community.\n\n\\begin{suppinfo}\nNanoparticle synthesis and device fabrication methods; Single dot\nsimulation; Symmetrical and asymmetrical conductance devices; FDTD\nsimulation details; Fano resonance measurements;\n\\end{suppinfo}\n\nThe authors declare no competing financial interest.\n\n\\begin{acknowledgement}\nWe would like to thank D. Mahalu and O. Raslin for their help in the\nelectron beam lithography.\n\\end{acknowledgement}\n\n\\bibnotetext[2]{See Supporting Information}\n\n\\bibliography{ElectricalDrivenPlasmon}\n\n\n", "itemtype": "equation", "pos": 3721, "prevtext": "\n where $g\\left(\\omega\\right)$ is the plasmonic spectrum, and $\\left|I_{\\omega}\\right|^{2}$\nis the power spectrum of the generator current, which can be expressed\nas $\\left|I_{\\omega}\\right|^{2}=\\sum_{i,f}\\left|\\langle f|\\hat{T}|i\\rangle\\right|^{2}\\delta\\left(\\hbar\\omega-\\left(E_{f}-E_{i}\\right)\\right)$,\nwhere $\\hat{T}$ represents the tunneling matrix element operator.\nIt is evident that at the limit of energy independent tunneling and\nzero temperature one can approximate this expression by\\cite{Hone1978,Rendell1981,Persson1992,Uehara1992}\n\n\n", "index": 3, "text": "\\begin{equation}\nS\\left(\\omega\\right)=\\begin{cases}\n\\left(\\frac{1}{2\\pi R_{0}}\\right)\\left(eV-\\hbar\\omega\\right)g\\left(\\omega\\right) & 0<\\hbar\\omega<eV\\\\\n0 & eV<\\hbar\\omega\n\\end{cases}\\label{eq:emission_spectrum}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"S\\left(\\omega\\right)=\\begin{cases}\\left(\\frac{1}{2\\pi R_{0}}\\right)\\left(eV-%&#10;\\hbar\\omega\\right)g\\left(\\omega\\right)&amp;0&lt;\\hbar\\omega&lt;eV\\\\&#10;0&amp;eV&lt;\\hbar\\omega\\end{cases}\" display=\"block\"><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo>(</mo><mi>ω</mi><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>R</mi><mn>0</mn></msub></mrow></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow><mo>-</mo><mrow><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi>ω</mi></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo>(</mo><mi>ω</mi><mo>)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mn>0</mn><mo>&lt;</mo><mrow><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi>ω</mi></mrow><mo>&lt;</mo><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow><mo>&lt;</mo><mrow><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi>ω</mi></mrow></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}]