[{"file": "1601.01407.tex", "nexttext": "\n where $p_{\\rm br}$ is the break momentum, $s_{\\rm L}$ is the spectral index below the break\nand $s_{\\rm H}$ above the break.\nNote that here we consider a minimum momenta\nof 100~MeV~$c^{-1}$ since the details of the proton/electron injection process are poorly known.\n\nElectrons suffer energy losses due to ionization, Coulomb scattering, bremsstrahlung,\nsynchrotron\nemission and inverse Compton~(IC) scattering.\nWe calculated the evolution of the electron momenta spectrum by the following equation:\n\n", "itemtype": "equation", "pos": 18461, "prevtext": "\n\n\n\n\n\\author{\nH.~Katagiri\\altaffilmark{1,2},\nK.~Yoshida\\altaffilmark{1,2},\nJ.~Ballet\\altaffilmark{3},\nM.-H.~Grondin\\altaffilmark{4},\nY.~Hanabata\\altaffilmark{5},\nJ.W.~Hewitt\\altaffilmark{6,7}, \nH.~Kubo\\altaffilmark{8},\nM.~Lemoine-Goumard\\altaffilmark{4}\n}\n\\altaffiltext{1}{College of Science, Ibaraki University, 2-1-1, Bunkyo, Mito 310-8512, Japan}\n\\altaffiltext{2}{Corresponding author: H.~Katagiri, hideaki.katagiri.sci@vc.ibaraki.ac.jp; K.~Yoshida, 13nm169s@gmail.com}\n\\altaffiltext{3}{Laboratoire AIM, CEA-IRFU/CNRS/Universit\\'e Paris Diderot, \nService d'Astrophysique, CEA Saclay, 91191 Gif sur Yvette, France}\n\\altaffiltext{4}{Centre d'\\'Etudes Nucl\\'eaires de Bordeaux Gradignan, \nIN2P3/CNRS, Universit\\'e Bordeaux 1, BP120, F-33175 Gradignan Cedex, France}\n\\altaffiltext{5}{Institute for Cosmic-Ray Research, University of Tokyo, \n5-1-5 Kashiwanoha, Kashiwa, Chiba, 277-8582, Japan}\n\\altaffiltext{6}{Department of Physics and Center for Space Sciences and Technology, University of Maryland Baltimore County, Baltimore, MD 21250, USA}\n\\altaffiltext{7}{Center for Research and Exploration in Space Science and Technology (CRESST) and NASA Goddard Space Flight Center, Greenbelt, MD 20771, USA}\n\\altaffiltext{8}{Department of Physics, Graduate School of Science, Kyoto \nUniversity, Kyoto, Japan}\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\n\nWe report the discovery of extended gamma-ray emission measured by the Large Area Telescope~(LAT) onboard the \\textit{Fermi Gamma-ray Space Telescope} in the region of the supernova remnant~(SNR) HB~3~(G132.7$+$1.3) and the W3 {H$\\,\\scriptstyle{\\rm II}$~} complex adjacent to the southeast of the remnant.\nW3 is spatially associated with bright $^{12}$CO~(J=1-0) emission. \nThe gamma-ray emission is spatially correlated with this gas and the SNR. \n\n\nWe discuss the possibility that gamma rays originate in interactions between particles accelerated in the SNR and interstellar gas or radiation fields.\nThe decay of neutral pions produced in nucleon-nucleon interactions between accelerated hadrons and interstellar gas provides a reasonable explanation \nfor the gamma-ray emission. \nThe emission from W3 is consistent with irradiation of the CO clouds by the cosmic rays accelerated in HB~3.\n\n\\end{abstract}\n\n\\keywords{cosmic rays --- acceleration of particles --- ISM: individual objects (HB~3, W3)\n--- ISM: supernova remnants --- gamma rays: ISM } \n\n\n\\section{Introduction}\nDiffusive acceleration by supernova shock waves can  \naccelerate particles to very high energies~\\citep[e.g.,][]{blandford87}.\nHowever, the processes of acceleration, release from the shock region, and diffusion in the interstellar medium of such particles has not been well understood so far.\nGamma-ray observations in the GeV regime are a powerful probe of these mechanisms.\nThe Large Area Telescope~(LAT) on board the \\textit{Fermi Gamma-ray Space Telescope} has recently detected GeV gamma rays from SNRs~\\citep[e.g., ][and references therein]{SNRref}. \n\n\n HB~3~(G132.7$+$1.3) is a well-known middle-aged SNR.\nThe 1.$\\!\\!^\\circ$3 diameter~\\citep{newRadioShape} makes it a good candidate\nfor detailed morphological studies in high-energy gamma rays since it is larger than the LAT angular resolution above \n\n{\\bf 1~GeV (smaller than 1$^\\circ$)}.\n\n\nThe W3 {H$\\,\\scriptstyle{\\rm II}$~} complex is adjacent and to the southeast of the remnant.\nBright $^{12}$CO(J=1-0) line emission near $-$43~km~s$^{-1}$ around W3 is partly surrounded by a region of enhanced radio continuum emission from HB~3, suggesting that HB~3 is interacting with this gas~\\citep{COint}.\nThe distance to the SNR is therefore considered to be that of W3, estimated to be 2.0--2.4~kpc~\\citep[see e.g.][]{COint, dist4}. \nIn this paper, we adopt 2.2~kpc.\n\nThe age was estimated to be $\\sim$~$3 \\times 10^4$~yr based on X-ray data and applying different evolutionary models to the SNR~\\citep{age}. \n\n{\\bf The X-ray spectrum was well described by a thermal plasma model~\\citep{age}.}\n\n\nIn the COS B era, W3 was associated with the gamma-ray source CG135$+$1~\\citep{COSB} and during the EGRET era it was associated with 3EG~J0229$+$6151~\\citep{3eg}.  However, detailed spatial association and extension measurements could not be made due to the limited angular resolution of COS B and EGRET.\n\nFive LAT sources positionally associated with HB~3 and W3 are listed in the 2FGL catalog~\\citep{2yrCatalog}.\nIn this paper, we report a detailed analysis of \\emph{Fermi} LAT observations around HB~3.\nFirst, we briefly describe the observations and data selection in\nSection~\\ref{sec:obs}.\nThe analysis procedure and the results are presented in Section~\\ref{sec:ana}, \nwith the study of the morphology and spectrum of the emission associated with HB~3 and W3. \nResults are then discussed in Section~\\ref{sec:discuss} \nand our conclusions are presented in Section~\\ref{sec:conclusion}.\n\n\n\\section{OBSERVATIONS AND DATA SELECTION}\n\\label{sec:obs}\nThe LAT is the main instrument on \\emph{Fermi}, detecting gamma rays from\n$\\sim$~20~MeV to $>$~300~GeV.\n\nIt is an electron-positron pair production telescope, built with tungsten foils and silicon microstrip detectors to measure the arrival directions of incoming gamma rays, and a hodoscopic cesium iodide calorimeter to determine the gamma-ray energies.\nThey are surrounded by 89 segmented  plastic scintillators that serve as an anticoincidence detector to reject charged particle events.\nThe on-orbit calibration, event classification and instrument performance are described in \\cite{onorbit_cal} and \\cite{IRFs}.\nCompared to earlier high-energy gamma-ray telescopes, the LAT has a larger field of view~($\\sim$~2.4~sr), a larger effective area~($\\sim$~8000~cm$^2$ for $>$~1~GeV on-axis) and improved point-spread function~(PSF; the 68\\% containment angle above 1~GeV is smaller than 1$^\\circ$). \n\n\n\n\nRoutine science operations with the LAT began on August 4, 2008.\nWe have analyzed events in the region of the HB~3 SNR collected from August 4, 2008, to January 30, 2014.\n\n\nThe LAT was operated in sky-survey mode for almost the entire period.\nIn this observing mode the LAT scans the whole sky, obtaining complete sky coverage\nevery 2\norbits~($\\sim$~3~hr) and approximately uniform exposure.\n\nThe analysis was performed over a square\nregion of 14$^\\circ \\times$14$^\\circ$ with a pixel size of 0${\\hbox{$.\\!\\!^\\circ$}}$1.\n\nWe set the centroid of the region to the SNR center: (R.A., Dec.)~$=$~(34\\ddeg42,62\\ddeg75)~(J2000).\n\n\nWe used the standard LAT analysis software, the \\emph{ScienceTools} version 09-32-05,\npublicly available from the \\emph{Fermi} Science Support Center (FSSC)\\footnote{Software and\ndocumentation of the \\emph{Fermi} \\emph{ScienceTools} are distributed by \\emph{Fermi} Science\nSupport Center at http://fermi.gsfc.nasa.gov/ssc}.\nWe used the post-launch instrument response functions~(IRFs) \\texttt{P7REP\\_SOURCE\\_V15}~\\citep{IRFs}\n and applied the following event selection\ncriteria: \n1) events should be classified as reprocessed Pass 7 \\emph{Source} class \\citep{Atwood09}, \n2) events have a reconstructed zenith angle less than 100$^\\circ$, \nto minimize the contamination from Earth-limb gamma-ray emission,\n and \n3) only time intervals when the center of the LAT field of view is within 52$^\\circ$ of the local zenith are accepted to further reduce the contamination by Earth's atmospheric emission.\nWe also eliminated a short period of time (06:25:45 to 06:42:25 UTC on 2012 September 11) during which the LAT detected the bright GeV-emitting GRB~120911B~\\citep{GRB} within 15$^\\circ$ of HB~3.\n{\\bf The resulting total exposure was $\\sim$~2~$\\times$~10$^{11}$~cm$^2$~s~(at 1~GeV).}\n\nWe restricted the analysis to the energy range $>200$~MeV to avoid\npossible large systematics due to the rapidly varying effective area and much broader PSF at lower energies.\n\n\n\\section{ANALYSIS AND RESULTS}\n\\label{sec:ana}\n\\subsection{Morphological analysis}\n\\label{subsec:spatial}\nIn order to study the morphology of gamma-ray emission associated with the HB~3 SNR \nwe performed a binned likelihood analysis based on Poisson statistics\\footnote{As implemented in the publicly available\n\\emph{Fermi} \\emph{Science Tools}.\nThe documentation concerning the analysis tools and the likelihood fitting procedure is available from\nhttp://fermi.gsfc.nasa.gov/ssc/data/analysis/documentation/Cicerone/.}~\\citep[see e.g.][]{Mattox96}.\nThe likelihood is the product of the probabilities of observing the gamma-ray counts within each spatial and energy bin for a specified emission model.\nThe probability density function for the likelihood analysis includes (1)~individual sources detected in the 2FGL catalog within 20$^\\circ$ of the SNR,\n(2)~the Galactic diffuse emission resulting from CR interactions with the interstellar medium and radiation based on the LAT standard diffuse background model, \\texttt{gll\\_iem\\_v05\\_rev1.fit} available from the FSSC, \nand (3)~an isotropic component to represent gamma rays and residual CR background using a tabulated spectrum written in \\texttt{iso\\_source\\_v05\\_rev1.txt} also available from the FSSC.\nWe set the spectral parameters of the 2FGL catalog sources located within the SNR~(2FGL J0214.5$+$6251c and 2FGL J0221.4$+$6257c) and within W3~(2FGL J0224.0$+$6204 , 2FGL J0218.7$+$6208c and 2FGL J0225.9$+$6154c) free.  Additionally, the normalizations of the Galactic diffuse and isotropic component were left free.  All other background sources had their indices fixed to the 2FGL values and normalizations set free.\n\n\nWe used only events above 1~GeV~(compared to the 0.2~GeV used in the spectral analysis) for the morphological study to take advantage of the narrower PSF at higher energies.\n\n\n\n\n\n\n\n\n\n\n\nFigure~\\ref{fig:subtract_cmap} shows the counts map in a 4$^\\circ~\\times$~4$^\\circ$ region centered on HB~3, \nafter subtracting the Galactic emission, the isotropic component and all the sources from the 2FGL catalog but the five ones spatially coincident with HB~3 and W3.\n\n\nThe image in the {\\bf $^{12}$CO~(J=1-0) \n\nline~\\citep{CO}} is overlaid, where the CO line intensities were integrated for velocities with respect to the local standard of rest $-44.2$~km~s$^{-1}$~$<V<-33.8$~km~s$^{-1}$, corresponding to the clouds associated with W3~\\citep{COint}.\n\nThe correlation between gamma rays and the CO line emission around W3 is evident. \n\n\nTo quantitatively evaluate the correlation with the CO line emission, \nwe fitted the LAT counts with the spatial template of the CO line emission instead of the three 2FGL sources within W3.\nThe shape of CO emission was extracted only around W3. \nSince the edge of the CO emission was unclear due to due to the noise of the spectral measurements,\n\nwe varied the threshold value of the CO intensity to extract the shape to maximize the likelihood value with a penalty for one additional parameter.\nThe spectral shape of W3 was assumed to be a log-parabola function, which is used for the sources corresponding to W3~\\citep{2yrCatalog}.\nThe resulting maximum likelihood values with respect to the maximum likelihood for the null hypothesis~(no emission associated with the SNR and W3) are summarized in Table~\\ref{tab:likeratio1}.\nA test statistic~(TS) value is defined as $2\\ln (L/L_{\\rm 0})$, where $L$ and $L_{\\rm 0}$ are the maximum likelihoods for the model with/without the source component, respectively~\\citep[e.g.][]{Mattox96}.\n\nAlthough the spatial models are not nested so there is no rigorous way to directly compare them,\nthe TS value for the CO image is significantly larger than for the three 2FGL sources and is physically motivated.\n\n\nWe further characterized the morphology of gamma-ray emission associated \nwith the SNR. Figure~\\ref{fig:subtract_cmap2} shows the counts map in a 4$^\\circ~\\times$~4$^\\circ$ region centered on HB~3,\nafter subtracting the Galactic emission, the isotropic component, the 2FGL point sources except for the 2 sources associated with the SNR, and W3 modeled by the CO template.\nThis highlights the diffuse emission around the SNR.\nTo quantitatively evaluate the detection significance of the diffuse emission from HB~3,\nwe adopted a uniform disk as a spatial template assuming a simple power-law spectrum.\nWe varied the radius and location of the disk and evaluated the maximum likelihood values.\n\nThe best-fit disk has the radius of $0{\\hbox{$.\\!\\!^\\circ$}} 80^{+0.18}_{-0.17}$ centered on (R.A., Dec.)~$=$~(35\\ddeg36, 62\\ddeg69)~(J2000).\nThe error of the centroid is 0${\\hbox{$.\\!\\!^\\circ$}}$06 at 68\\% confidence level.\nWe note that the maximum likelihood value for a 408~MHz radio template with suppression of emission from W3 was significantly worse than the best-fit disk model, indicating that the gamma-ray emission around HB~3 is not strongly spatially associated with the shock region of HB~3 as traced by radio.\n{\\bf The best-fit disk is offset from the SNR center (R.A., Dec.) $=$ (34\\ddeg51, 62\\ddeg79)~(J2000) \\citep{SNRcenter} by 0\\ddeg40, and the offset is significant at the 4.2$\\sigma$ level.}\n\nThe TS value for the best-fit disk is larger than for the two 2FGL sources. \n\nIn addition, the detection significance for the disk with energies of $>$~1~GeV is at the $\\sim$~12~$\\sigma$ level.\nTherefore we finally adopted the uniform disk template with maximum likelihood parameters for the whole SNR in the following spectral analysis.\n\n\\subsection{Spectral analysis} \nTo measure the spectra for the HB~3 SNR and W3, we performed maximum likelihood fits in logarithmically-spaced energy bands from 0.2~GeV to 300~GeV, \nusing the spatial model described above with the spectral indices in each bin fit to 2.\n\nFigure~\\ref{fig:spec} and \\ref{fig:spec_w3} show the resulting spectral energy distributions~(SEDs).\nUpper limits at the 2 sigma confidence level are calculated assuming a photon\nindex of 2 if the detection is not significant in an energy bin, i.e., the TS value with respect to the null hypothesis is less than 4~(corresponding to 2~$\\sigma$\nfor one additional degree of freedom).\n\n\n\nWe identify at least four different sources of systematic uncertainties affecting the\nestimate of the fluxes. Uncertainties in the LAT effective area are evaluated by comparing the efficiencies of analysis cuts for data and simulation of observations of \nVela and the limb of the Earth, among other consistency checks~\\citep{IRFs}. For \\texttt{P7REP\\_SOURCE\\_V15}, these studies suggest a 10\\% \nsystematic uncertainty below 100~MeV, decreasing linearly with the logarithm of energy to 5\\% in the range between 316~MeV and 10~GeV and \nincreasing linearly with the logarithm of energy up to 15\\% at 1~TeV~\\citep{IRFs}.\nWe estimated the systematic errors by changing the effective area of the IRFs energy-dependently considering the above uncertainties.\n\n\n\nWe adopted the strategy described in \\cite{diffusesys1} and \\cite{diffusesys2} to evaluate the systematic uncertainties due to the modeling of interstellar emission.\nWe compared the results obtained using the standard model in Section~\\ref{subsec:spatial} with the results based on eight alternative interstellar emission models. We varied the uniform spin temperature used to estimate the column densities of interstellar atomic hydrogen, the vertical height of the CR propagation halo, and the CR source distribution in the Galaxy.\n\n\n\n\n\n\nWe similarly gauged the uncertainties due to the morphological template by comparing the results with those obtained by changing the radius of the disk template by $\\pm$~1$\\sigma$.\nLastly, we obtained the uncertainties due to the assumption of the photon indices. \nWe changed the indices from 0 to 4.\nThe total systematic errors shown in Figure~\\ref{fig:spec} and \\ref{fig:spec_w3} are set by adding the above uncertainties in quadrature. \n\n\nWe probed for a spectral break in the LAT energy band by comparing the likelihood values of a spectral fit over the whole energy range considered based on a simple power law and a log parabola function.\n\nThe TS values and best-fit parameters are summarized in Table~\\ref{tab:spectral_shape}.\n\nThe TS values for the log-parabola function correspond to improvements at the $> 4$~$\\sigma$ confidence level for the SNR and $> 16$~$\\sigma$ for W3, respectively.\nAssuming the spectral shape can be described by a log parabola function,\n\nthe gamma-ray energy fluxes between 0.2--300~GeV inferred from our analysis are $3.7 \\times 10^{-11}$erg~cm$^{-2}$~s$^{-1}$ for the SNR and $1.0 \\times 10^{-10}$erg~cm$^{-2}$~s$^{-1}$ for W3, respectively.\nThe gamma-ray luminosities between 0.2--300~GeV assuming the distance is 2.2~kpc are $2.1 \\times 10^{34}$erg~s$^{-1}$ for the SNR and $5.9 \\times 10^{34}$erg~s$^{-1}$ for W3, respectively.\n\n\\section{DISCUSSION}\n\\label{sec:discuss}\nThere is a correspondence between gamma-ray emission and the SNR.\n{\\bf\nThe gamma-ray emission around HB 3 is extended, located off the Galactic plane and far from the Galactic center, so the probability of chance superposition of other Galactic sources is small.\nAlso, the spectral shape of gamma rays around HB~3 is similar to other gamma-ray sources associated with old SNRs, i.e. a soft spectrum with a spectral break at energies of around 1--10~GeV~\\citep[e.g.,][]{W51C,W44,IC443,W28}.\nThese facts suggest the association between the gamma-ray emission and HB~3.\n}\nAssuming this, enhancement of gamma-ray emission from W3, which contains the molecular clouds traced by CO line emission, can be reasonably explained by interaction between high-energy particles and the dense material in the clouds.\nThus we argue that the bulk of gamma-ray emission comes from interactions of high-energy particles accelerated at the shocks of HB~3 with interstellar matter or fields in the regions.\nFirst, we discuss the gamma-ray spectrum of the SNR which was obtained by using the disk spatial template.\nTo model the broadband emission from the entire SNR we adopt the simplest possible assumption that gamma rays are emitted by a population of accelerated protons and electrons distributed in the same region \nand characterized by constant matter density and magnetic field strength. \nWe assume the injected electrons to have the same momentum distribution as protons.\nThis assumption requires a break in the momentum spectrum\nbecause the spectral index in the radio domain, corresponding to lower\nparticle momenta, is much harder than for gamma rays, which\ncorrespond to higher particle momenta.\nTherefore, we use the following functional form to model the momentum distribution of injected\nparticles:\n\n", "index": 1, "text": "\\begin{equation}\nQ_{e, p}(p) = a_{e,p} \\left( \\frac{p}{1~{\\rm GeV}~c^{-1}} \\right)^{-s_{\\rm L}} \\left\\{ 1+\\left(\\frac{p}{p_{\\rm br}} \\right)^2 \\right\\} ^{-(s_{\\rm H}-s_{\\rm L})/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"Q_{e,p}(p)=a_{e,p}\\left(\\frac{p}{1~{}{\\rm GeV}~{}c^{-1}}\\right)^{-s_{\\rm L}}%&#10;\\left\\{1+\\left(\\frac{p}{p_{\\rm br}}\\right)^{2}\\right\\}^{-(s_{\\rm H}-s_{\\rm L})%&#10;/2},\" display=\"block\"><mrow><mrow><mrow><msub><mi>Q</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>a</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>p</mi><mrow><mpadded width=\"+3.3pt\"><mn>1</mn></mpadded><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>GeV</mi></mpadded><mo>⁢</mo><msup><mi>c</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><msub><mi>s</mi><mi mathvariant=\"normal\">L</mi></msub></mrow></msup><mo>⁢</mo><msup><mrow><mo>{</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>(</mo><mfrac><mi>p</mi><msub><mi>p</mi><mi>br</mi></msub></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow><mo>}</mo></mrow><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>s</mi><mi mathvariant=\"normal\">H</mi></msub><mo>-</mo><msub><mi>s</mi><mi mathvariant=\"normal\">L</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01407.tex", "nexttext": "\nwhere $b_{e,p} = -dp/dt$ is the momentum loss rate, and $Q_{e,p}$ is the particle injection rate.\nWe assume $Q_{e,p}$ to be constant, i.e., that the  \nshock produces a constant number of particles \nuntil the SNR enters the radiative phase, at which time the source turns off. \nThis prescription approximates the weakening of the shock and the reduction in the particle acceleration efficiency, which would be properly treated by using a time-dependent shock compression ratio~\\citep{SNRaccelerationTime}. \nTo derive the remnant emission spectrum we calculated $N_{e,p}(p,T_{\\rm 0})$\nnumerically, where $T_{\\rm 0}$ is the SNR age assumed to be $3 \\times 10^4$~yr.\nNote that we neglected the momentum losses for protons since the timescale of neutral pion production is $\\sim$~10$^7/{\\bar{n}_{\\rm H}}$~yr where ${\\bar{n}_{\\rm H}}$ is the gas density averaged over the entire SNR shell and is much longer than the SNR age.\nAlso we neglect the gamma-ray emission by secondary positrons and electrons from\ncharged pion decay, \nbecause the emission from secondaries is generally faint compared to that from primary electrons unless the gas density is as high as that in dense molecular clouds \nand the SNR evolution reaches the later stages,\nor the injected electron-to-proton ratio is much lower than locally observed.\nThe gamma-ray spectrum from $\\pi^0$ decay produced by the interactions of protons with\nambient hydrogen is calculated based on \\cite{Dermer86}\nusing a scaling factor of 1.68 to account for helium and heavier nuclei in target\nmaterial and cosmic rays~\\citep{Mori09}. \nContributions from bremsstrahlung and inverse Compton scattering by accelerated electrons\nare computed based on \\cite{Blumenthal70}, whereas synchrotron radiation is based on \\cite{Crusius86}.\n\n\nFirst, we consider a $\\pi^0$-decay dominated model.\nThe number index of protons in the high-energy regime\n is constrained to be $s_{\\rm H} \\approx 4.0$   from the gamma-ray spectral slope.\n$s_{\\rm L} \\approx 1.5$ by modeling the radio spectrum as synchrotron radiation by relativistic\nelectrons (under the assumption that protons and electrons have identical injection spectra). The spectral index $\\alpha$ of the radio continuum emission is $\\sim$~0.34~\\citep{RadioSpectrum}, where $\\alpha$ is defined as $S_\\nu \\propto \\nu^{-\\alpha}$ where $S_\\nu$ and $\\nu$ are the flux density and the frequency, respectively.\n\n\nThe gamma-ray spectrum provides an upper bound for the momentum break at $\\sim$~ 13~GeV~$c^{-1}$.\n\nWe adopt a break at the best-fit value, 10~GeV~$c^{-1}$.\nThe gas density is fixed to $2.0~\\mathrm{cm}^{-3}$ based on the {H$\\,\\scriptstyle{\\rm I}$~} observations~\\citep{density}.\nThe resulting total proton energy,  $W_{p}\\sim 5.2~\\times~10^{49}~\\cdot~(2.0~\\mathrm{cm}^{-3}/{\\bar{n}_{\\rm H}})\\cdot(d/2.2 \\mathrm{kpc})^{2}$~erg, is less than 10~\\% \nof the typical kinetic energy of a supernova explosion.\nFor an electron-to-proton ratio $K_{ep} = 0.01$ at 1~GeV~$c^{-1}$, which\nis the ratio measured at the Earth,\nthe magnetic field strength is constrained to be $B \\sim 25\\;\\upmu$G by radio data.\nUsing the parameters summarized in Table~\\ref{tab:model}, \nwe obtained the SEDs shown in Figure~\\ref{fig:spec_multi}~(a).\n\n \n\n\n\nThe gamma-ray spectrum can be reproduced by an electron bremsstrahlung dominated model \nin Figure~\\ref{fig:spec_multi}~(b), although it is not easy to fit the data in the radio band simultaneously.\nThe density used in this model is the same as that for the $\\pi^0$-decay dominated model, while $K_{ep}$ is set to 1 so that the leptonic emission dominates.\n\n\n\nAn inverse Compton dominated model can also reproduce the gamma-ray spectrum as shown in Figure~\\ref{fig:spec_multi}~(c).\nGamma-ray emission of IC origin is\n due to interactions of high-energy electrons with optical and infrared radiation fields and the cosmic microwave background~(CMB).\nWe used in our calculations the first two components as they are modeled in~\\citet{Porter08} at the location of HB~3.\nSince their spectra are very complex, they are approximated by two\ninfrared blackbody components~($T_{\\rm IR} = 33.3, 1.00 \\times 10^3$~K, $U_{\\rm IR} = 0.17, 0.04$~eV~cm$^{-3}$, respectively),\nand \ntwo optical blackbody components~($T_{\\rm opt} = 4.02 \\times 10^3, 1.34 \\times 10^4$~K, $U_{\\rm opt} = 2.71 \\times 10^{-1}, 8.80 \\times 10^{-2}$~eV~cm$^{-3}$, respectively). \nThe flux ratio between the IC and the synchrotron components \nconstrains the magnetic field to be less than 1~$\\upmu$G\nand requires a low gas density of \n ${\\bar{n}_{\\rm H}} \\sim 2.0 \\times 10^{-3}~\\mathrm{cm}^{-3}$ to suppress the electron bremsstrahlung,\n\nwhich is unlikely.\nIncreasing the intensity of the interstellar radiation field other than CMB\nwould loosen the constraint on the magnetic field and the gas density.\n\nA radiation field about 100 times more intense is required to satisfy the above assumption on the magnetic field and the gas density.\n\n\n\n\nAssuming that $\\pi^0$-decay produced by the interactions of protons with ambient hydrogen is responsible for the bulk of the gamma-ray emission from the SNR,\nthe gamma-ray spectrum of W3 can be reasonably explained by a $\\pi^0$-decay dominated model. If the protons are accelerated in the whole SNR in the same manner and are not largely affected by spectral deformation due to cosmic-ray diffusion process, the gamma-ray spectrum of W3 is expected to be modeled with a similar proton spectrum. \nThe curved lines in Figure~\\ref{fig:spec_w3} show the gamma-ray spectrum of W3 with the $\\pi^0$-decay dominated model assuming the density in the molecular clouds is $100~\\mathrm{cm}^{-3}$. \nThe spectrum can be reproduced without any change from the proton momentum spectrum of the SNR.\nThe resulting total proton energy,  $W_{p}\\sim 0.29~\\times~10^{49}~\\cdot~(100~\\mathrm{cm}^{-3}/{\\bar{n}_{\\rm H}})\\cdot(d/2.2 \\mathrm{kpc})^{2}$~erg, is about 5.5~\\% \nof that for the $\\pi^0$-decay model of the SNR, which is likely considering the solid angle of W3 from the center of the SNR.\n\n{\\bf We also estimated the energy density of cosmic rays in W3 in order to confirm the enhancement of the energy density due to the SNR\ncompared to that from the local cosmic rays. The mass of the whole clouds of W3 is $4.4 \\times 10^5~{\\mathrm{M_\\odot}}$~\\citep{W3COmass}. \nWe assume the cloud mass related to the gamma-ray emission to be about $10^4~{\\mathrm{M_\\odot}}$ since the gamma-ray emission only comes from a small part of the W3 giant molecular cloud.\nThe resulting density is $15\\cdot(10^4 {\\mathrm{M_\\odot}}/ {\\mathrm{M}})$~eV~cm$^{-3}$, where ${\\mathrm{M}}$ is the cloud mass related to the gamma-ray emission. This is much higher than the energy density of the local cosmic rays, indicating a strong association between the gamma-ray emission and the SNR.\n}\nTo summarize, it is most natural to assume that gamma-ray emission from HB~3 is dominated by decay of $\\pi^0$ produced in nucleon-nucleon interactions of hadronic cosmic rays with interstellar matter.\n\nIt should be emphasized that our observations around HB~3 provide a rare and valuable example where there are detections of gamma rays from both the adjacent interacting molecular cloud and the SNR itself.\n{\\bf \nThis differs from W44~\\citep{W44second} and W28~\\citep{W28second} where the adjacent gamma-ray emitting clouds are thought to be outside the SNRs.}\n\n\n\n\n\n\n\\section{CONCLUSIONS}\n\\label{sec:conclusion}\nWe detected extended gamma-ray emissions by using the LAT data in the region of the SNR HB~3 and the W3 {H$\\,\\scriptstyle{\\rm II}$~} complex.\n\nThe decay of $\\pi^0$ produced by interactions of hadrons accelerated\nby the remnant with interstellar gas naturally explains the gamma-ray emission around HB~3. \n\nAssuming this, the gamma-ray emission from W3 is also reasonably explained by the interaction of cosmic rays accelerated by the SNR with the dense gas in the clouds associated with W3.\n\n\n\n\\acknowledgments\n\nThe \\textit{Fermi} LAT Collaboration acknowledges generous ongoing support\nfrom a number of agencies and institutes that have supported both the\ndevelopment and the operation of the LAT as well as scientific data analysis.\nThese include the National Aeronautics and Space Administration and the\nDepartment of Energy in the United States, the Commissariat \\`a l'Energie Atomique\nand the Centre National de la Recherche Scientifique / Institut National de Physique\nNucl\\'eaire et de Physique des Particules in France, the Agenzia Spaziale Italiana\nand the Istituto Nazionale di Fisica Nucleare in Italy, the Ministry of Education,\nCulture, Sports, Science and Technology (MEXT), High Energy Accelerator Research\nOrganization (KEK) and Japan Aerospace Exploration Agency (JAXA) in Japan, and\nthe K.~A.~Wallenberg Foundation, the Swedish Research Council and the\nSwedish National Space Board in Sweden.\n \nAdditional support for science analysis during the operations phase is gratefully\nacknowledged from the Istituto Nazionale di Astrofisica in Italy and the Centre National d'\\'Etudes Spatiales in France.\n\nThe research presented in this paper has used data from the Canadian Galactic Plane Survey, a Canadian project with international partners, supported by the Natural Sciences and Engineering Research Council.\n\n{\\bf We wish to thank Dave Green~(University of Cambridge) for advising us about the reference for the position of the SNR.\n\n}\n\n\\begin{thebibliography}{}\n\n\n\n\\bibitem[Abdo et al.(2009a)]{onorbit_cal} Abdo, A.~A., Ackermann, M., Ajello, M., et al.\\ 2009, Astroparticle Physics, 32, 193 \n\n\\bibitem[Abdo et al.(2009b)]{W51C} Abdo, A.~A., Ackermann, M., Ajello, M., et al.\\ 2009, \\apjl, 706, L1 \n\n\\bibitem[Abdo et al.(2010a)]{W44} Abdo, A.~A., Ackermann, M., Ajello, M., et al.\\ 2010, Science, 327, 1103 \n\n\\bibitem[Abdo et al.(2010b)]{IC443} Abdo, A.~A., Ackermann, M., Ajello, M., et al.\\ 2010, \\apj, 712, 45\n\n\\bibitem[Abdo et al.(2010c)]{W28} Abdo, A.~A., Ackermann, M., Ajello, M., et al.\\ 2010, \\apj, 718, 348\n\n\n\\bibitem[Ackermann et al.(2012)]{IRFs} Ackermann, M., Ajello, M., Albert, A., et al.\\ 2012, \\apjs, 203, 4 \n\n\n\\bibitem[Ackermann et al.(2013)]{diffusesys1} Ackermann, M., \nAjello, M., Allafort, A., et al.\\ 2013, Science, 339, 807 \n\n\\bibitem[Atwood et al.(2009)]{Atwood09} Atwood, W. B., et al. (The \\emph{Fermi} LAT Collaboration) 2009, \\apj, 697, 1071 \n\n\n\n\\bibitem[Blandford \\& Eichler(1987)]{blandford87} Blandford, R. D. \\& Eichler, D. 1987, Phys. Rep., 154, 1\n\n\\bibitem[Blumenthal \\& Gould(1970)]{Blumenthal70} Blumenthal, G.~R., \\& Gould, R.~J.\\ 1970, Reviews of Modern Physics, 42, 237 \n\n\\bibitem[Crusius \\& Schlickeiser(1986)]{Crusius86} Crusius, A., \\& Schlickeiser, R.\\ 1986, \\aap, 164, L16\n\n\\bibitem[Dame et al.(2001)]{CO} Dame, T.~M., Hartmann, D., \\& Thaddeus, P.\\ 2001, \\apj, 547, 792 \n\n\\bibitem[de Palma et al.(2013)]{diffusesys2}\nde Palma, F., Brandt, T. J., Johannesson, G., \\& Tibaldo, L. Fermi LAT Collaboration 2013, Proc. of 4th International Fermi Symposium Proc., ed. N. Omodei, G. Senatore, T. Brandt, \\& C. Wilson-Hodge (Stanford, CA: Stanford Univ.), 172\n\n\\bibitem[Dermer(1986)]{Dermer86} Dermer, C.~D.\\ 1986, \\aap, 157, 223 \n\n\\bibitem[Gosachinskii(2005)]{density} Gosachinskii, I.~V.\\ 2005, Astronomy Letters, 31, 179\n\n\\bibitem[Hanabata et al.(2014)]{W28second} Hanabata, Y., Katagiri, H., Hewitt, J.~W., et al.\\ 2014, \\apj, 786, 145 \n\n\\bibitem[Hartman et al.(1999)]{3eg} Hartman, R.~C., \nBertsch, D.~L., Bloom, S.~D., et al.\\ 1999, \\apjs, 123, 79 \n\n\n\n\\bibitem[Green(2014)]{newRadioShape} Green, D.~A.\\ 2014, Bulletin of the Astronomical Society of India, 42, 47 \n\n\n\\bibitem[Hartman et al.(1999)]{3eg} Hartman, R.~C., Bertsch, D.~L., Bloom, S.~D., et al.\\ 1999, \\apjs, 123, 79 \n\n\\bibitem[Kothes et al.(2006)]{SNRcenter} Kothes, R., Fedotov, K., Foster, T.~J., \\& Uyan{\\i}ker, B.\\ 2006, \\aap, 457, 1081 \n\n\n\\bibitem[Lazendic \\& Slane(2006)]{age} Lazendic, J.~S., \\& Slane, P.~O.\\ 2006, \\apj, 647, 350 \n\n\\bibitem[Mattox et al.(1996)]{Mattox96} Mattox, J. R., et al. , 1996, \\apj, 461, 396\n\n\\bibitem[Moraal \\& Axford(1983)]{SNRaccelerationTime} Moraal, H., \\& Axford, W.~I.\\ 1983, \\aap, 125, 204 \n\n\n\\bibitem[Mori(2009)]{Mori09} Mori, M., 2009, Astropart. Phys., 31, 341\n\n\n\\bibitem[Nolan et al.(2012)]{2yrCatalog} Nolan, P.~L., Abdo, A.~A., Ackermann, M., et al. (The \\emph{Fermi} LAT Collaboration) 2012, \\apjs, 199, 31 \n\n\n\n\n\n\n\n\n\n\\bibitem[Protassov et al.(2002)]{TSconversion} Protassov, R., van Dyk, D.~A., Connors, A., Kashyap, V.~L., \\& Siemiginowska, A.\\ 2002, \\apj, 571, 545\n\n\n\\bibitem[Routledge et \nal.(1991)]{COint} Routledge, D., Dewdney, P.~E., Landecker, T.~L., \\& Vaneldik, J.~F.\\ 1991, \\aap, 247, 529 \n\n\\bibitem[Polychroni et al.(2012)]{W3COmass} Polychroni, D., \nMoore, T.~J.~T., \\& Allsopp, J.\\ 2012, \\mnras, 422, 2992 \n\n\\bibitem[Porter et al.(2008)]{Porter08} Porter, T., et al. 2008, \\apj, 682, 400\n\n\n\\bibitem[Racusin et al.(2012)]{GRB} Racusin, J.~L., Vianello, G., Kocevski, D., Omodei, N., \\& Ohno, M.\\ 2012, GRB Coordinates Network, 13756, 1 \n\n\n\n\\bibitem[Strong(1977)]{COSB} Strong, A.~W.\\ 1977, \\nat, 269, 394 \n\n\n\n\\bibitem[Taylor et al.(2003)]{RadioTemplate} Taylor, A.~R., Gibson, S.~J., Peracaula, M., et al.\\ 2003, \\aj, 125, 3145 \n\n\\bibitem[Tian \\& Leahy(2005)]{RadioSpectrum} Tian, W.~W., \\& Leahy, D.\\ 2005, \\aap, 436, 187 \n\n\\bibitem[Thompson et al.(2012)]{SNRref} Thompson, D.~J., Baldini, L., \\& Uchiyama, Y.\\ 2012, Astroparticle Physics, 39, 22 \n\n\\bibitem[Uchiyama et al.(2012)]{W44second} Uchiyama, Y., Funk, S., Katagiri, H., et al.\\ 2012, \\apjl, 749, L35 \n\n\\bibitem[Xu et al.(2006)]{dist4} Xu, Y., Reid, M.~J., Zheng, X.~W., \\& Menten, K.~M.\\ 2006, Science, 311, 54 \n\n\n\n\\end{thebibliography}\n\n\\begin{figure}\n\n\n\n \\plotone{figs/fig1/fig1_151215.eps}\n\\caption{\n\\small\nBackground-subtracted LAT counts map in the 1--10~GeV energy range around the HB~3 SNR.\nThe five 2FGL point sources associated with HB~3~(cyan squares) and W3~(cyan crosses) are not included in the background model. \n{\\bf The red pluses are the other 2FGL point sources.}\n\nThe counts map is binned using a grid of $0\\ddeg1$ and smoothed with a Gaussian kernel of $\\sigma$ $=$0${\\hbox{$.\\!\\!^\\circ$}}$25.\nThe inset of the figure shows the simulated LAT PSF with a photon index\nof 2.5 in the same energy range, adopting the same smoothing.\n\nNote that throughout the paper the analysis is conducted on unsmoothed data taking into account the instrument PSF in the likelihood analysis.\n\n\n\n{\\bf The white contours are 408~MHz radio data~\\citep{RadioTemplate} excluding the region around W3, where the emission is predominantly thermal. The contour interval is 2~K from 2~K.\n}\n\n\n\nContours of integrated intensity of the  $^{12}$CO~(J=1-0)  line~\\citep{CO} are in green.\nThe contour interval is 2.7~K$\\cdot$km~s$^{-1}$ from 2.7~K$\\cdot$km~s$^{-1}$.\nThe CO image was smoothed using a Gaussian kernel with $\\sigma$ $=$~0${\\hbox{$.\\!\\!^\\circ$}}$125.\n\\label{fig:subtract_cmap}\n}\n\\end{figure}\n\n\\begin{figure}\n\n\n\n\n \\plotone{figs/fig2/fig2_151216.eps}\n\\caption{\nBackground-subtracted LAT counts map in the 1--10~GeV energy range.\nThe two LAT point sources associated with HB~3 are not included in the background model, but the CO template for W3 is. \nThe counts map is binned using a grid of $0\\ddeg1$ and smoothed with a Gaussian kernel of sigma $=$~0${\\hbox{$.\\!\\!^\\circ$}}$40.\nThe green circle indicates the best-fit disk for HB~3 used for the analysis as a spatial template.\nThe details of the other overlays are described in the caption of Figure~\\ref{fig:subtract_cmap}.\n\\label{fig:subtract_cmap2}\n}\n\\end{figure}\n\n\\begin{figure}\n\n\n\\plotone{figs/HB3_LogParabola_AllowedRegion_sys_fit_150629.eps}\n\n\\caption{ Spectral energy distribution of the gamma-ray emission measured by the LAT for the HB~3 SNR.\nRed squares are LAT flux points.\nHorizontal bars indicate the energy range the flux refers to.\nVertical bars show statistical errors in red and systematic errors\n\n in black.\nIn energy bins where\nthe detection is not significant (TS $<$~4) we show upper limits at the 2 sigma confidence level.\nThe blue region is the 68~\\% confidence range~(no systematic error) of the LAT spectrum assuming that the spectral shape is a log parabola.\n \\label{fig:spec}}\n\\end{figure}\n\n\n\\begin{figure}\n\n\n\n\n \\plotone{figs/spec_PlotFlux_LogParabola_sys_fit_line_151003.eps}\n\n\\caption{ Spectral energy distribution of the gamma-ray emission measured by the LAT for W3. \nThe details of the plots and bars are described in the caption of Figure~\\ref{fig:spec}.\nThe blue region is the 68~\\% confidence range~(no systematic error) of the LAT spectrum assuming that the spectral shape is a log parabola.\nThe lines shows a $\\pi^0$-decay dominated model.\nThe details of the model lines are described in the caption of Figure~\\ref{fig:spec_multi}.\n \\label{fig:spec_w3}}\n\\end{figure}\n\n\n\n\n\\begin{figure}\n \\plotone{figs/spec_multi_rev1_20150325.eps}\n\\caption{Multi-band spectrum of the HB~3 SNR.\n \\label{fig:spec_multi}\nIn the GeV band LAT measurements are reported as in Figure~\\ref{fig:spec}.\nThe radio continuum emission~\\citep{RadioSpectrum} is shown by black dots. Radio emission is modeled as synchrotron radiation, \nwhile gamma-ray emission is modeled by different combinations of $\\pi^0$-decay~(long-dashed curve),\nbremsstrahlung~(dashed curve), and inverse Compton~(IC) scattering~(dotted curve). \nDetails of the models are\ndescribed in the text and numerical values are given in Table~\\ref{tab:model}: a) $\\pi^0$-decay dominated model, b)\nbremsstrahlung dominated model, c) IC dominated model.}\n\\end{figure}\n\n\n\n\n\\begin{table}\n\\begin{center}\n\\caption{ Test Statistics for Different Spatial Models Compared with the \nNull hypothesis~(no gamma-ray emission associated neither with HB~3 nor W3) in the 1--300~GeV energy range.\n\n\\label{tab:likeratio1}}\n\\begin{tabular}{lccc}\n\\tableline\\tableline\n Model   & Test Statistic &  Additional Degrees of Freedom  \\\\\n\\tableline\n   3 point sources $+$ 2 point sources\\tablenotemark{a} & 2025.5 &  13 \\\\\n   CO image  \\tablenotemark{b} $+$ 2 point sources\\tablenotemark{c} & 2115.8 &  9 \\\\\n   CO image $+$ Uniform disk\\tablenotemark{d} & 2142.2 &  9 \\\\\n   CO image $+$ Radio template\\tablenotemark{e} & 2111.8 & 6 \\\\\n\\tableline\n\\end{tabular}\n\n\\tablenotetext{\\rm a}{The five sources listed in the 2FGL source list associated with the HB~3 SNR and the W3~\\citep{2yrCatalog}.\nThe spectral shapes are a power-law function for 2 sources, a log parabola function for 3 sources.  }\n\\tablenotetext{\\rm b}{The additional degrees of freedom for the CO image are 2 for the spectral shape, 1 for the threshold value of the CO intensity to extract the shape.\n\nThe threshold value to maximize the likelihood value is 3~K$\\cdot$km~s$^{-1}$.\nThe details are shown in the text. }\n\\tablenotetext{\\rm c}{The two sources listed in the 2FGL source list associated with HB~3.}\n\\tablenotetext{\\rm d}{The additional degrees of freedom for the uniform disk are 5, 2 for the spectral shape~(a power law), 3 for the disk radius and position.\n\n}\n\\tablenotetext{\\rm e}{The radio template was obtained from 408~MHz radio data~\\citep{RadioTemplate} by excluding the region around W3, where the emission is predominantly thermal.\n\nThe additional degrees of freedom for the uniform disk are 2 for the spectral shape (a power law).}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}\n\\begin{center}\n\\caption{Test Statistics and Parameters for Spectral Models~(0.2--300~\nGeV) \\label{tab:spectral_shape}}\n\\begin{tabular}{lcccc}\n\\tableline\\tableline\n Spectral Model  & Test Statistic\\tablenotemark{a}  &  Degrees  & Spectral Parameters  \\\\  &  &   of Freedom & \\\\\n\\tableline\\tableline\nHB~3 &   &  &  \\\\\n\\tableline\nPower Law  & 0  & 2 & $E^{-p}$; $p=2.39\\pm0.05$ \\\\\n\\tableline\nLog Parabola  & 18 &  3 &   $\\left(\\frac{E}{1~{\\rm GeV}}\\right)^{-p_1-p_2\\log{\\left(\\frac{E}{1~{\\rm GeV}}\\right)}}$ \\\\\n & & &  $p_1=2.29 \\pm 0.09$ \\\\\n & & &  $p_2=0.30 \\pm 0.11$ \\\\\n\\tableline\\tableline\nW3 &   &  &  \\\\\n\\tableline\nPower Law  & 0  & 2 & $E^{-p}$; $p=2.42\\pm0.02$ \\\\\n\\tableline\nLog Parabola  & 267 &  3 &   $\\left(\\frac{E}{1~{\\rm GeV}}\\right)^{-p_1-p_\n2\\log{\\left(\\frac{E}{1~{\\rm GeV}}\\right)}}$ \\\\\n & & &  $p_1=2.40 \\pm 0.03$ \\\\\n & & &  $p_2=0.33 \\pm 0.03$ \\\\\n\\tableline\\tableline\n\\end{tabular}\n\\tablenotetext{\\rm a}{$2\\ln (L/L_{\\rm 0})$, where $L$ and $L_{\\rm 0}$ are the maximum likelihood values for the \nmodel under consideration and the power-law model, respectively.}\n\n\n\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}\n\\begin{center}\n\\caption{Model parameters for the HB~3 SNR and W3.\\label{tab:model}}\n\\begin{tabular}{lccccccccc}\n\\tableline\\tableline\n HB~3 Model  & {$K_{ep}$}\\tablenotemark{a} &  $s_{\\rm L}$\\tablenotemark{b} & $p_{\\rm br}$\\tablenotemark{c} & $s_{\\rm H}$\\tablenotemark{d} & $B$ &\n ${\\bar{n}_{\\rm H}}$\\tablenotemark{e} & $W_{p}$\\tablenotemark{f} & $W_{e}$\\tablenotemark{f} \\\\\n   &    &  & (GeV~$c^{-1}$) & &  ($\\upmu$G) & (cm$^{-3}$) & ($10^{49}$~erg) & ($10^{49}$~erg) \\\\\n\\tableline\n(a)~Pion & 0.01  & 1.5 & 10 & 4.0 & 25 & 2.0 & 5.2 & 0.074 \\\\\n(b)~Bremsstrahlung & 1 & 1.5 & 4.0 & 4.0 & 5.0 & 2.0  & 0.46 & 0.84  \\\\\n(c)~Inverse Compton & 1 & 1.5 & 60 & 40 & 0.64 & $2.0 \\times 10^{-3}$ & 12 & 18 \\\\\n(d)~Inverse Compton & 1 & 1.5 & 60 & 40 & 15 & 2.0 & 0.11 & 0.16 \\\\\n~~(photon field $\\times$ 100) & & & & & & & & \\\\\n\\tableline\\tableline\n W3 Model & & & & & & & & \\\\\n\\tableline\nPion & 0.01  & 1.5 & 10 & 4.0 & $\\verb|<|$ 200\\tablenotemark{g} & 100 & 0.29 & $3.4 \\times 10^{-3}$ \\\\\n\\tableline\n\\end{tabular}\n\\tablenotetext{\\rm a}{The ratio electrons-to-protons at 1~GeV~$c^{-1}$.}\n\\tablenotetext{\\rm b}{The momentum distribution of particles is assumed to be a smoothly broken power law, where the indices and the break\n momentum are identical for both accelerated protons and electrons. $s_{\\rm L}$ is the spectral index in momentum below the break.}\n\\tablenotetext{\\rm c}{$p_{\\rm br}$ is the break momentum.}\n\\tablenotetext{\\rm d}{Spectral index in momentum above the break.}\n\n\\tablenotetext{\\rm e}{Average hydrogen number density of ambient medium.}\n\\tablenotetext{\\rm f}{\n\nThe total energy is calculated for particles $>$~100~MeV~$c^{-1}$.}\n\n\n\\tablenotetext{\\rm g}{This upper limit was obtained by assuming the flux of the non-thermal radio emission around W3 is the same as that from the whole SNR since the radio emission from W3 is predominantly thermal.}\n\\end{center}\n\\end{table}\n\n\n\n", "itemtype": "equation", "pos": 19158, "prevtext": "\n where $p_{\\rm br}$ is the break momentum, $s_{\\rm L}$ is the spectral index below the break\nand $s_{\\rm H}$ above the break.\nNote that here we consider a minimum momenta\nof 100~MeV~$c^{-1}$ since the details of the proton/electron injection process are poorly known.\n\nElectrons suffer energy losses due to ionization, Coulomb scattering, bremsstrahlung,\nsynchrotron\nemission and inverse Compton~(IC) scattering.\nWe calculated the evolution of the electron momenta spectrum by the following equation:\n\n", "index": 3, "text": "\\begin{equation}\n  \\frac{\\partial N_{e,p}}{\\partial t} = \\frac{\\partial}{\\partial p} \\left( b_{e,p}N_{e,p} \\right) + Q_{e,p} ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial N_{e,p}}{\\partial t}=\\frac{\\partial}{\\partial p}\\left(b_{e,p}N_%&#10;{e,p}\\right)+Q_{e,p},\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>N</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>p</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>b</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub><mo>⁢</mo><msub><mi>N</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow><mo>+</mo><msub><mi>Q</mi><mrow><mi>e</mi><mo>,</mo><mi>p</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]