[{"file": "1601.06272.tex", "nexttext": "\n\n\n\n\\smallskip\nIf the motion of the interface is assumed to be directed towards the front normal ${\\widehat{\\bm{n}}}$\n\n", "itemtype": "equation", "pos": 20353, "prevtext": "\n\n\\begin{frontmatter}\n\n\\title{Turbulence and fire-spotting effects\\\\ into wild-land fire simulators}\n\n\\author[BCAM]{Inderpreet KAUR\\corref{mycorrespondingauthor}}\n\\ead{ikaur@bcamath.org}\n\\author[UNIBO,BCAM]{Andrea MENTRELLI}\n\\author[SPE]{Fr\\'ed\\'eric BOSSEUR}\n\\author[SPE]{Jean-Baptiste FILIPPI}\n\\author[BCAM,IKER]{Gianni PAGNINI}\n\n\\cortext[mycorrespondingauthor]{Corresponding author}\n\n\\address[BCAM]{\nBCAM--Basque Center for Applied Mathematics\\\\\nAlameda de Mazarredo 14, E-48009 Bilbao, Basque Country -- Spain}\n\\address[UNIBO]{\nDepartment of Mathematics \\&\\\\(AM)$^2$--Alma Mater Research Center on Applied Mathematics\\\\\nUniversity of Bologna, via Saragozza 8, I-40123 Bologna, Italy}\n\\address[SPE]{Laboratoire SPE--Sciences Pour l'Environnement CNRS - UMR6134\\\\\nUniversity of Corsica, BP 52, F-20250 Corte, Corsica -- France}\n\\address[IKER]{\nIkerbasque--Basque Foundation for Science\\\\ Calle de Mar\\'a D\\'iaz de Haro 3, E-48013 Bilbao, \nBasque Country -- Spain}\n\n\\begin{abstract}\nThis paper presents a mathematical approach to model the effects and the role of phenomena with random nature such as turbulence and fire-spotting \ninto the existing wildfire simulators. The formulation proposes that the propagation of the fire-front is the sum of a drifting component \n(obtained from an existing wildfire simulator without turbulence and fire-spotting) and a random fluctuating component. \nThe modelling of the random effects is embodied in a probability density function accounting for the fluctuations around the \nfire perimeter given by the drifting component. \nIn past, this formulation has been applied to include these random effects into a wildfire simulator based on an Eulerian moving interface method,\nnamely the Level Set Method (LSM), \nbut in this paper the same formulation is adapted for a wildfire simulator based \non a Lagrangian front tracking technique, namely the Discrete Event System Specification (DEVS). \nSimple idealised numerical experiments are used to compare the performances of the LSM and the DEVS based wildfire simulators. \nThe results show that these two existing wildfire simulators qualitatively improve their performances \n(e.g. reproducing flank and back fire, \nincrease in fire spread due to pre-heating of the fuel by hot air and firebrands,\nfire propagation across no fuel zones, secondary fire generation, \\dots)\nwhen random effects are included according to the proposed formulation,\nand the only differences which arise among the two are due to the differences in the geometrical construction of the direction of propagation. \nThough the results presented here are devoid of any validation exercise and provide only a proof of concept, they show a strong inclination towards an intended operational use. \nThe existing LSM or DEVS based operational simulators like WRF-SFIRE and ForeFire respectively can serve as an ideal basis for the same.\n\\end{abstract}\n\n\n\n\n\n\n\n\\end{frontmatter}\n\n\n\n\\section{Introduction and motivations}\nModelling of wild-land fire propagation serves as a crucial tool to combat the high economic and environmental damage associated with the wildfires. \nAn effective and swift modelling can aid in building up an efficient plan for fire suppression and restrict the damage to the life and property to a minimum. Modelling of the propagation of the wild-land fire is a complex, multi-scale, multi-physics and multi-discipline process, \nand the crux of the simulation lies in delivering either a versatile or a specialised model which is easy to implement and is capable of providing timely information. With the availability of higher computational power, various new and improved modelling approaches have been developed over the last decade. An extensive review by Sullivan \\cite{sullivan-ijwf-2009a,sullivan-ijwf-2009b,sullivan-ijwf-2009c} provides a comprehensive overview of the wide spectrum of physical, \nempirical, statistical and mathematical analogue models available in literature. \n\n\\smallskip\nWild-land fire propagation involves the heat transport to the surroundings in accordance with the atmospheric wind, \nand other factors like fuel distribution, elevation, and orography. \nDifferent statistical and mathematical models utilized for wild-fire propagation in operational simulators\ninclude a part of the physical processes based on the experimental data \nor its mathematical analogues, but are usually limited to the average value without taking into account the random fluctuations. \nThese models accommodate the variability introduced by the changes in fuel type, \nwind conditions or orography but fail in quantifying a sudden erratic output of the fire due to random effects,\ne.g. due to turbulence or fire-spotting. \nThe generation of heat introduces a turbulent flow in the vicinity of \nthe fire which in turn allows a wider contact of the hot air with the unburned fuel \n\\cite{clark_etal-jam-1996,potter-ijwf-2002,potter-ijwf-2012a,potter-ijwf-2012b,clements_etal-jgr-2008,mandel_etal-gmd-2011}. \nThis convective and radiative transfer of heat causes a rapid ignition of the unburned fuel bed and leads to a faster spread of the fire. \nTurbulence can also facilitate the generation of spot fires when the firebrands are transported away from the main fire due to \nadvection \\cite{sardoy_etal-cf-2007,sardoy_etal-cf-2008,kortas_etal-fsj-2009,perryman-2009,perryman_etal-ijwf-2013}. \nThe effect of such random phenomena can range from subdued to catastrophic depending upon the concurrent weather conditions and fuel characteristics. \nExisting operational wildfire simulators are limited by their formulation to decipher these random phenomena, \nand require implementation of additional schemes/variables to represent such processes.\n\n\\smallskip\nIn past, few approaches have been proposed to model different random processes within the wildfire propagation \n\\cite{favier-pla-2004,hunt-c-2007,boychuk_etal-ees-2009,perryman_etal-ijwf-2013} in order to provide a more realistic fire spread. \nIn Ref. \\cite{boychuk_etal-ees-2009}, the authors incorporate the stochastic fire-spotting phenomenon based on a continuous-time Markov chain on a lattice. \nThe state of the lattice site is controlled according to the local transition rate functions, where the physical processes like - fire spread, \nspotting and burnout compete against each other. In Ref. \\cite{perryman_etal-ijwf-2013},\nthe authors integrate the mathematical models with a cellular automata \nscheme to demonstrate the variability in the landing patterns of firebrands. \nIn Ref. \\cite{ntaimo_etal-sim-2004}, the authors discuss a Discrete Event System Specification (DEVS) based model which incorporates the uncertainty \nby sampling certain variables from arbitrary probability distributions. \n\n\\smallskip\nThe present authors in a number of their recent works \n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012,pagnini-cedyacma-2013,pagnini-semasimai-2014,pagnini_etal-nhess-2014,\npagnini_etal-ecmi-2014} \nhave proposed a new approach to include the effects of random processes in some wildfire operational simulators. \nThey derive a formulation to modify the modelled position of the fire-front to include random processes. \nThe motion of the propagating fire-front is randomised by the addition of a random displacement\ndistributed according to a probability density function (PDF) corresponding to the turbulent transport of heat and to the fire-spotting landing distance.  \nThe driving equation of the resulting averaged process is analogous to an evolution equation of the reaction-diffusion type, \nwhere the Rate Of Spread (ROS) controls the source term. If the motion is considered without such random processes, \nthe diffusive part disappears, and the spread of the fire-line is identical to the one given by the chosen operational simulator and driven only by the ROS. The proposed formulation to include random processes holds true for any method of determination of the ROS and the statistical spread is determined by the PDF of displacements of the random contour points marked as active burning points. The ensemble averaging of the displacements smoothens out of the noisy fluctuations and results in a smooth fire-line contour. The efficacy of this formulation by using a Level Set Method (LSM) based fire propagation model has already been shown \n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012,pagnini-semasimai-2014,pagnini_etal-nhess-2014,pagnini_etal-ecmi-2014}. \n\n\\smallskip\nThe Eulerian LSM has been used extensively in literature to simulate moving interfaces,\ne.g. \\cite{sethian_etal-arfm-2003,mallet_etal-cma-2009,mandel_etal-gmd-2011}. \nLSM is a scheme which represents a moving interface on a simple Cartesian grid. \nThis method is particularly appropriate for wildfire simulations, as it permits an accurate computation of the front normal vector which is \nused to propagate the front. \nOther approaches available in literature which focus on wildfire propagation modelling include the Lagrangian DEVS \n\\cite{karimabadi_etal-jcp-2005,omelchenko_etal-jcp-2012,filippi_etal-s-2009,filippi_etal-nhess-2014} \nand Huygens' principle \\cite{anderson_etal-jams-1982,richards-ijnme-1990,richards-cst-1993,richards-ijwf-1995,glasa_etal-mcs-2008,rios_etal-nhess-2014}.\nThe Lagrangian DEVS approach allows the simulation of wildfire without defining any underlying mesh to represent the burning state. \nDEVS being an event driven simulation considers time as a continuous variable and permits faster simulations over higher resolution. \nOn the other hand, wildfire models based on Huygens' principle utilise an elliptical spread at each point of the fire-front\nand in some cases also benefit from the analytical results\n\\cite{anderson_etal-jams-1982,richards-ijnme-1990,richards-cst-1993,richards-ijwf-1995,glasa_etal-mcs-2008,rios_etal-nhess-2014}.\n\n\\smallskip\nIn this study, we proceed with our preliminary attempt \\cite{kaur_etal-praga-2015}\nto include the proposed formalism for random processes (turbulence and fire-spotting),\nalready discussed and implemented into an Eulerian LSM based wildland fire simulator \n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012,pagnini-cedyacma-2013,pagnini-semasimai-2014,pagnini_etal-nhess-2014,\npagnini_etal-ecmi-2014}, \ninto a Lagrangian DEVS based wildland fire simulation model: ForeFire (\\url {https://github.com/forefireAPI/firefront} ; \\url{ \nhttp://forefire.univ-corse.fr/sim/dev/}) \\cite{filippi_etal-s-2009}. \nForeFire is an open-source wildfire simulator developed by University of Corsica, France \\cite{filippi_etal-affr-2014} \nto serve as a basis for an operational simulator and also provides flexibility to include new physics options. \nForeFire is based on a Lagrangian technique which integrates the so-called Balbi model for the ROS \\cite{balbi_etal-cf-2009} \nwith a Discrete Event Simulation (DES) \\cite{zeigler-ths-2000} \nbased front tracking method to simulate the wildfire propagation. \nCoupling the front tracking method with DES permits the utilisation of time as a continuous variable; and hence removes the limitation of establishing \na trade off between the temporal resolution and scale of the simulation according to the Courant--Friedrichs--Lewy (CFL) condition. \nVarious formalisms exist to define DES, and among those DEVS \\cite{zeigler-ths-2000} is used to study the discrete, continuous and hybrid systems. \nThe DEVS formulation in respect to wildfire propagation is developed devoid of any description of random processes such\nas turbulent heat transfer and fire-spotting and therefore restricts the evolution of the fire to zones with non-zero ROS. \nThe aim of this article is to include the effects of such random phenomena in the DEVS scheme and provides motivation for analysing the propagation of fire across no fuel zones in agreement with the realistic situations. \nSince the formulation for including random processes is independent of the front tracking method and the definition of ROS, \nthis inclusion is performed according to the active fire-front generated by DEVS based front tracking method. \nThis investigation also provides a scope to compare the two moving interface methods (LSM and DEVS) \nwith an emphasis on their performance in simulating the wildfire spread. \n\n\\smallskip\nThe remaining paper is organised as follows. \nThe salient features of DEVS and LSM based wildfire simulators are described in section \\ref{overview}. \nThe description of the formulation for random effects is provided in section \\ref{formulation} and\nthe numerical set-up to include this formulation into the DEVS based simulator is described in section \\ref{devs}.\nSection \\ref{setup} describes the different simulation set-ups for evaluation. \nThe results are presented and discussed in section \\ref{discussion}. \nA brief sensitivity analysis of the spatial distribution of the fire-brand landing patterns is also presented in section \\ref{firebrand}. \nConcluding remarks are provided in section \\ref{conclusions}. \n\n\\section{Overview of wildfire simulators}\n\\label{overview}\nModelling of wildfire spread focusses on the development of a phenomenological and theoretical formula for a suitable representation of the ROS of fire and the simulation of the propagation of the fire perimeter to reconstruct the shape of fire over time. Various ROS models available in literature \\cite{rothermel-1972,balbi_etal-cf-2009,mallet_etal-cma-2009,finney-cjfr-2002,finney-ijwf-2003} \nprovide an analytical formulation of the ROS for given wind conditions, slope and fuel characteristics. \nThe available ROS models are usually developed independent of the moving interface methods and \nuser discretion is advised to select one in according to the requirements. \nSince this study aims at studying the effect of the random processes using wildfire simulators based over different moving interface methods, an analysis of different ROS models is not presented in this article. \n\n\\smallskip\nWildfire simulators based on the DEVS or the LSM techniques are inherently different, but the concept of Lagrangian markers and the constant perimeter resolution in the DEVS front tracking method can be considered analogous to the concept of active fuel points and constant action arc length in LSM tracking method as discussed in Ref. \\cite{pagnini_etal-nhess-2014}. This section provides a brief overview of the salient features of the DEVS and LSM based wildfire simulators.\n\\subsection{DEVS based wildfire simulator}\n\n\n\n\n\n\n\n\n\n\n\n\nThe tracking method used to simulate the fire perimeter in wildland fire simulator ForeFire is based on the DEVS \\cite{zeigler-s-1987}. \nDEVS handles the time advancement in terms of the increment of physical quantities instead of a discrete time step. \nThe resulting front is a polygon whose vertices have real coordinates instead of being located on nodes of a regular mesh or grid. \nThis computationally in-expensive Lagrangian technique simulates the evolution of an interface without any underlying grid \nrepresenting the state of the system. Each fire-front is discretised into a series of markers connected to the next marker by a piecewise linear segment.\nThe fire-break zones like roads and rivers are also represented as arbitrary shaped polygons. Each marker is associated with a propagation speed and direction, and each time a marker moves, \nthe intersection with the neighbourhood is checked to take care of the topological changes. \n\nThe propagation speed of the marker is defined by the ROS, while the propagation direction is defined as the bisector \nthe angle made by the marker with its immediate left and right neighbours. \nThis angle bisector is also considered as an approximation of the outward normal. \n\n\\smallskip\nIn DEVS, time is treated as a continuous parameter and each marker evolves according to its own independent time step. \nThe time advancement of the markers is event based and all markers do not share the same time step. \nDue to different time advances for each marker, the CFL condition applies only locally and the markers move asynchronously. \nThis self adjusting temporal resolution in Lagrangian formulation is computationally efficient and provides an efficient way to simulate \nthe spatially in-homogeneous problem. \nThe simulation in DEVS advances as new events are generated; and the generation of new events is managed by the following two \ncriteria:\n\\begin{description}\n\\item[Collision criterion:]  \nA collision happens when an agent moves into a different area, \ne.g. from an unburned to a burned area or from an active fire to a fuel break. Each collision generates a modification of the shape.\n\\item[Quantum distance criterion:]  \nQuantum distance $\\Delta q$ is defined as the maximum distance each marker is allowed to cover during advancement. \nThe actual resolution of the simulation is limited by this parameter and details smaller than the quantum distance \n$\\Delta q$ may not be accounted for.  \n\\end{description}\n\n\\smallskip\nThree type of collision events can be defined to control the front propagation: {\\it decomposition}, {\\it regeneration} and {\\it coalescence}. \nThe {\\it decomposition} function is activated when a marker enters a different area (e.g. from a burned to an unburned zone). \nAs soon as the marker enters a new area, two new markers are created on the boundary of the new area. \nIn {\\it regeneration}, the markers are redistributed to refine the shape; if two markers are separated by a distance greater \nthan the perimeter resolution $\\Delta c$, a new marker is generated between the two markers.  \nThe {\\it coalescence} function handles the markers with the separation distance lower than $\\Delta r$. \nMarkers with separation less than $\\Delta r$ leads to the merging of the markers. For stability and to avoid cross over of two markers, \nthe approximation $\\Delta r = \\Delta c/2$ and the condition $\\Delta c \\geq 2\\Delta q$ should be respected. \nThe precision of the method is highly dependent on the choice of $\\Delta q$ and $\\Delta c$. Quantum distance $\\Delta q$, should be of a much higher resolution \nthan the wind data for minimal error. A detailed description of the DEVS front tracking method can be found in Ref. \\cite{filippi_etal-s-2009}.\n\n\\smallskip\nIn this study, the ForeFire open source code developed for research and development purposes (\\url {https://github.com/forefireAPI/firefront}) has\\\\ been utilized. ForeFire library is developed with C/C++/Java and Fortran bindings for a UNIX compatible environment and compiled using a SWIG (\\url{ http://swig.org/}) build platform. \nNetCDF library with legacy C++ interface is required to build ForeFire, and SCons (\\url{http://www.scons.org/}) python tool is used to make the library. \nA python based interface is used to launch the simulations with software calls to the main code. \nA command line mode interpreter is also available for running the simulations.\n\n\\subsection{LSM based wildfire simulator}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLSM is one of the widely used and successful tools for tracking fronts in any dimension \\cite{osher_fedkiw-2003,sethian_etal-arfm-2003}. \nIt is particularly suitable for problems where the speed of the evolving interface is dependent on the interface properties \nand the boundary conditions at the interface. \nWild-land fire propagation is one of problems where LSM finds a frequent application to represent the evolving fire-fronts\n\\cite{mallet_etal-cma-2009,rehm_etal-nist-2009,mandel_etal-gmd-2011}. \nIn particular, it is the basis for the operational software WRF-SFIRE (\\url {http://github.com/jbeezley/wrf-fire/}).\n\n\n\\smallskip\nLet $\\Gamma$ be a simple closed curve representing the fire-front interface in two-dimensions, \nand let $\\Omega$ be the region bounded by the fire-front $\\Gamma$. If the interface is made up of more than one closed surface, \nthe domain $\\Omega$ is not simply connected and represents more than one independently evolving bounded areas.\nLet $\\gamma : S \\times [0,+ \\infty[\\rightarrow R$ be an {\\it implicit} function defined on the domain of interest $S \\subseteq R^{2}$ \nsuch that the level set $\\gamma(x,t) = \\gamma_{*}$ coincides with the evolving front, i.e. $\\Gamma(t) = \\{x \\in S \\mid \\gamma(x,t) = \\gamma_{*}\\}$. \nIf $\\Gamma$ is an ensemble of $n$ surfaces, the ensemble of the $n$ interfaces is considered as an {\\it interface}. \nThe evolution of the isocontour $\\gamma_*$ in time is governed by \n\n", "index": 1, "text": "\\begin{equation}\n\\frac{D\\gamma}{Dt}=\\frac{\\partial\\gamma}{\\partial t} + \\frac{d {\\bm{x}} }{dt}\\cdot \\nabla\\gamma = \\frac{D\\gamma_*}{Dt}= 0 \\,.\n\\label{hamilton_jacobi}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{D\\gamma}{Dt}=\\frac{\\partial\\gamma}{\\partial t}+\\frac{d{\\bm{x}}}{dt}\\cdot%&#10;\\nabla\\gamma=\\frac{D\\gamma_{*}}{Dt}=0\\,.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>D</mi><mo>⁢</mo><mi>γ</mi></mrow><mrow><mi>D</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>γ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>+</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>𝒙</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>γ</mi></mrow></mrow></mrow><mo>=</mo><mfrac><mrow><mi>D</mi><mo>⁢</mo><msub><mi>γ</mi><mo>*</mo></msub></mrow><mrow><mi>D</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": " \nthen, Eq. \\eqref{hamilton_jacobi} reduces to \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\n\n\\smallskip\nIf the motion of the interface is assumed to be directed towards the front normal ${\\widehat{\\bm{n}}}$\n\n", "index": 3, "text": "\\begin{equation}\n{\\widehat{\\bm{n}}} = - \\frac{\\nabla\\gamma}{\\parallel\\nabla\\gamma\\parallel} \\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\widehat{\\bm{n}}}=-\\frac{\\nabla\\gamma}{\\parallel\\nabla\\gamma\\parallel}\\,,\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>𝒏</mi><mo>^</mo></mover><mo>=</mo><mrow><mo>-</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mo>∇</mo><mo>⁡</mo><mi>γ</mi></mrow><mrow><mo>∥</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>γ</mi></mrow><mo>∥</mo></mrow></mfrac></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\n\n\n\\smallskip\nIn application to wild-land fire modelling, an indicator function $\\phi({\\bm{x}},t)$ is introduced to allow a convenient identification \nof the burned area and the fire perimeter\n\n", "itemtype": "equation", "pos": 20810, "prevtext": " \nthen, Eq. \\eqref{hamilton_jacobi} reduces to \n\n", "index": 5, "text": "\\begin{equation}\n\\frac{\\partial\\gamma}{\\partial t} = \\mathcal{V}({\\bm{x}},t)\\parallel\\nabla\\gamma\\parallel \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\gamma}{\\partial t}=\\mathcal{V}({\\bm{x}},t)\\parallel\\nabla\\gamma%&#10;\\parallel\\,.\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>γ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒱</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>∥</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>γ</mi></mrow><mo rspace=\"4.2pt\">∥</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nThe boundary of $\\Omega$ can be identified as the front-line contour of the wildfire\nand $\\mathcal{V}$ denotes the ROS of the fire-front. \n\n\\smallskip\nThe LSM code makes use of a general-purpose library which aims at providing a robust and efficient tool for studying the evolution \nof co-dimensional fronts propagating in one-, two- and three-dimensional system. \nThe library, written in Fortran2008/OpenMP, \nalong with standard algorithms useful for the calculation of the front evolution by means of the classical LSM, \nincludes Fast Marching Method algorithms.\nAll the results presented in this paper are obtained by making use of the above-mentioned software; \nMatlab \\url{(www.mathworks.com/products/matlab/)} \nand open source softwares such as \\texttt{SciPy} \\cite{SciPy} and \\texttt{Matplotlib} \\cite{Matplotlib} in the IPython framework \\cite{IPython} \nhave been used in post-processing for visualisation purposes. \n\n\\section{Random effects formulation}\n\\label{formulation}\nThe proposed approach is based on the idea to split the motion of the front position into a drifting part and a fluctuating part\n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012,pagnini-cedyacma-2013,pagnini-semasimai-2014,pagnini_etal-nhess-2014,\npagnini_etal-ecmi-2014,mentrelli_etal-caim-2015,mentrelli_etal-jcp-2015}. \nThis splitting allows specific numerical and physical choices which can be useful to improve the algorithms and the models. \nIn particular, the drifting part can be related to existing methods for moving interfaces, \nfor example the Eulerian LSM \\cite{sethian_etal-arfm-2003} or the Lagrangian DEVS \\cite{karimabadi_etal-jcp-2005,omelchenko_etal-jcp-2012}. \nThe fluctuating part is the result of a comprehensive statistical description of the system which includes the random effects in agreement \nwith the physical properties of the system. \nAs a consequence, the fluctuating part can have a non-zero mean, implying that the drifting part does not correspond to the average motion. \nDue to this fact, the present splitting is distinct from the well-known Reynolds decomposition frequently adopted in turbulence flows. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\smallskip\nThe motion of the each burning point can be random due to the effect of turbulence and/or fire-spotting. \nLet ${\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}}_0)$ be the $\\omega$ realisation of the random trajectory of an active burning point at time $t$ \nwith the initial condition ${\\bm{X}}^{\\omega}(0,{\\overline{\\bm{x}}}_0)={\\overline{\\bm{x}}}_0$. The trajectory of a single interface particle can be described by \nthe one-particle PDF $f^{\\omega}({\\bm{x}};t)=\\delta({\\bm{x}}-X^{\\omega}(t,{\\overline{\\bm{x}}}_0))$, where $\\delta({\\bm{x}})$ is the Dirac delta function. \nThe random front contour can be derived by using the sifting property of the Dirac delta function peaking at a random position. \nThis random position represents the stochastic trajectory which describes the random motion of the front line and includes both \ndrifting and fluctuating part of the front position.  \n\n\n\n\n\nIn the $\\omega$ realisation, the evolution in time of the function $\\gamma^{\\omega}({\\bm{x}},t)$, \nwhich embeds the random fire-line $\\Gamma^{\\omega}$ is given by\n\\cite{pagnini_etal-crs4-2012,pagnini_etal-nhess-2014,mentrelli_etal-caim-2015,mentrelli_etal-jcp-2015} \n\n", "itemtype": "equation", "pos": 21128, "prevtext": "\n\n\n\\smallskip\nIn application to wild-land fire modelling, an indicator function $\\phi({\\bm{x}},t)$ is introduced to allow a convenient identification \nof the burned area and the fire perimeter\n\n", "index": 7, "text": "\\begin{equation}\n\\phi({\\bm{x}},t)=\n\\begin{cases}\n1, & {\\bm{x}} \\in \\Omega(t) \\,, \\\\\n0, & {\\bm{x}} \\not\\in \\Omega(t) \\,.\n\\end{cases} \n\\label{indicatorphi}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\phi({\\bm{x}},t)=\\begin{cases}1,&amp;{\\bm{x}}\\in\\Omega(t)\\,,\\\\&#10;0,&amp;{\\bm{x}}\\not\\in\\Omega(t)\\,.\\end{cases}\" display=\"block\"><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>𝒙</mi><mo>∈</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mn>0</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>𝒙</mi><mo>∉</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "  \nThe effective indicator of the burned area enclosed by the random front $\\phi_{e}({\\bm{x}},t):S \\times [0,+\\infty[ \\rightarrow [0,1]$ \nmay be defined as \n\\begin{eqnarray} \n\\phi_{e}({\\bm{x}},t) &=& \\left\\langle  \\int_{\\Omega(t)}\\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}})) \\, d{\\overline{\\bm{x}}} \\right\\rangle \\nonumber \\\\\n&=& \\int_{\\Omega(t)} \\langle \\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}})) \\rangle \\, d{\\overline{\\bm{x}}} \\nonumber \\\\\n&=& \\int_{\\Omega(t)}f({\\bm{x}};t|{\\overline{\\bm{x}}}) \\, d{\\overline{\\bm{x}}} \\\\\n&=& \\int_S \\phi({\\overline{\\bm{x}}},t) f({\\bm{x}};t|{\\overline{\\bm{x}}}) \\, d{\\overline{\\bm{x}}} \\,,\n\\label{phi_e}\n\\end{eqnarray}\nwhere $ f({\\bm{x}};t|{\\overline{\\bm{x}}}) = \\left\\langle \\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}}))\\right\\rangle$ is the PDF of the displacement \nof the active burning points around the position ${\\overline{\\bm{x}}}$ obtained from existing wildfire simulators. \n\n\nAn arbitrary threshold value $\\phi_{e}^{th}$ is chosen to serve as the criterion to mark the region as burned or unburned, \ni.e. $\\Omega_{e}({\\bm{x}},t)=\\left\\lbrace {\\bm{x}} \\in S \\mid \\phi_{e}({\\bm{x}},t) > \\phi_{e}^{th}\\right\\rbrace$.\n\n\\smallskip\nThe evolution of the effective indicator $\\phi_{e}({\\bm{x}},t)$ can be obtained by using the Reynold transport theorem to Eq. (\\ref{phi_e}) \n\\cite{pagnini_etal-prl-2011,pagnini_etal-crs4-2012}\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nThe boundary of $\\Omega$ can be identified as the front-line contour of the wildfire\nand $\\mathcal{V}$ denotes the ROS of the fire-front. \n\n\\smallskip\nThe LSM code makes use of a general-purpose library which aims at providing a robust and efficient tool for studying the evolution \nof co-dimensional fronts propagating in one-, two- and three-dimensional system. \nThe library, written in Fortran2008/OpenMP, \nalong with standard algorithms useful for the calculation of the front evolution by means of the classical LSM, \nincludes Fast Marching Method algorithms.\nAll the results presented in this paper are obtained by making use of the above-mentioned software; \nMatlab \\url{(www.mathworks.com/products/matlab/)} \nand open source softwares such as \\texttt{SciPy} \\cite{SciPy} and \\texttt{Matplotlib} \\cite{Matplotlib} in the IPython framework \\cite{IPython} \nhave been used in post-processing for visualisation purposes. \n\n\\section{Random effects formulation}\n\\label{formulation}\nThe proposed approach is based on the idea to split the motion of the front position into a drifting part and a fluctuating part\n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012,pagnini-cedyacma-2013,pagnini-semasimai-2014,pagnini_etal-nhess-2014,\npagnini_etal-ecmi-2014,mentrelli_etal-caim-2015,mentrelli_etal-jcp-2015}. \nThis splitting allows specific numerical and physical choices which can be useful to improve the algorithms and the models. \nIn particular, the drifting part can be related to existing methods for moving interfaces, \nfor example the Eulerian LSM \\cite{sethian_etal-arfm-2003} or the Lagrangian DEVS \\cite{karimabadi_etal-jcp-2005,omelchenko_etal-jcp-2012}. \nThe fluctuating part is the result of a comprehensive statistical description of the system which includes the random effects in agreement \nwith the physical properties of the system. \nAs a consequence, the fluctuating part can have a non-zero mean, implying that the drifting part does not correspond to the average motion. \nDue to this fact, the present splitting is distinct from the well-known Reynolds decomposition frequently adopted in turbulence flows. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\smallskip\nThe motion of the each burning point can be random due to the effect of turbulence and/or fire-spotting. \nLet ${\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}}_0)$ be the $\\omega$ realisation of the random trajectory of an active burning point at time $t$ \nwith the initial condition ${\\bm{X}}^{\\omega}(0,{\\overline{\\bm{x}}}_0)={\\overline{\\bm{x}}}_0$. The trajectory of a single interface particle can be described by \nthe one-particle PDF $f^{\\omega}({\\bm{x}};t)=\\delta({\\bm{x}}-X^{\\omega}(t,{\\overline{\\bm{x}}}_0))$, where $\\delta({\\bm{x}})$ is the Dirac delta function. \nThe random front contour can be derived by using the sifting property of the Dirac delta function peaking at a random position. \nThis random position represents the stochastic trajectory which describes the random motion of the front line and includes both \ndrifting and fluctuating part of the front position.  \n\n\n\n\n\nIn the $\\omega$ realisation, the evolution in time of the function $\\gamma^{\\omega}({\\bm{x}},t)$, \nwhich embeds the random fire-line $\\Gamma^{\\omega}$ is given by\n\\cite{pagnini_etal-crs4-2012,pagnini_etal-nhess-2014,mentrelli_etal-caim-2015,mentrelli_etal-jcp-2015} \n\n", "index": 9, "text": "\\begin{equation}\n\\gamma^{\\omega}({\\bm{x}},t) = \\int_S \\gamma({\\overline{\\bm{x}}},t) \\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}}) \\, d{\\overline{\\bm{x}}} \\,. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\gamma^{\\omega}({\\bm{x}},t)=\\int_{S}\\gamma({\\overline{\\bm{x}}},t)\\delta({\\bm{x%&#10;}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}})\\,d{\\overline{\\bm{x}}}\\,.\" display=\"block\"><mrow><msup><mi>γ</mi><mi>ω</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>S</mi></msub><mi>γ</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>-</mo><msup><mi>𝑿</mi><mi>ω</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>,</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></mpadded><mo>.</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nAssuming that $f({\\bm{x}};t|{\\overline{\\bm{x}}})$ satisfies an evolution equation of the type\n\n", "itemtype": "equation", "pos": 26189, "prevtext": "  \nThe effective indicator of the burned area enclosed by the random front $\\phi_{e}({\\bm{x}},t):S \\times [0,+\\infty[ \\rightarrow [0,1]$ \nmay be defined as \n\\begin{eqnarray} \n\\phi_{e}({\\bm{x}},t) &=& \\left\\langle  \\int_{\\Omega(t)}\\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}})) \\, d{\\overline{\\bm{x}}} \\right\\rangle \\nonumber \\\\\n&=& \\int_{\\Omega(t)} \\langle \\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}})) \\rangle \\, d{\\overline{\\bm{x}}} \\nonumber \\\\\n&=& \\int_{\\Omega(t)}f({\\bm{x}};t|{\\overline{\\bm{x}}}) \\, d{\\overline{\\bm{x}}} \\\\\n&=& \\int_S \\phi({\\overline{\\bm{x}}},t) f({\\bm{x}};t|{\\overline{\\bm{x}}}) \\, d{\\overline{\\bm{x}}} \\,,\n\\label{phi_e}\n\\end{eqnarray}\nwhere $ f({\\bm{x}};t|{\\overline{\\bm{x}}}) = \\left\\langle \\delta({\\bm{x}}-{\\bm{X}}^{\\omega}(t,{\\overline{\\bm{x}}}))\\right\\rangle$ is the PDF of the displacement \nof the active burning points around the position ${\\overline{\\bm{x}}}$ obtained from existing wildfire simulators. \n\n\nAn arbitrary threshold value $\\phi_{e}^{th}$ is chosen to serve as the criterion to mark the region as burned or unburned, \ni.e. $\\Omega_{e}({\\bm{x}},t)=\\left\\lbrace {\\bm{x}} \\in S \\mid \\phi_{e}({\\bm{x}},t) > \\phi_{e}^{th}\\right\\rbrace$.\n\n\\smallskip\nThe evolution of the effective indicator $\\phi_{e}({\\bm{x}},t)$ can be obtained by using the Reynold transport theorem to Eq. (\\ref{phi_e}) \n\\cite{pagnini_etal-prl-2011,pagnini_etal-crs4-2012}\n\n", "index": 11, "text": "\\begin{equation}\n\\frac{\\partial \\phi_{e}}{\\partial t} = \\int_{\\Omega(t)} \\frac{\\partial f}{\\partial t} d {\\overline{\\bm{x}}} \n+ \\int_{\\Omega(t)} \\nabla_{{\\overline{\\bm{x}}}} \\cdot [V({\\overline{\\bm{x}}},t) f({\\bm{x}};t|{\\overline{\\bm{x}}})] \\, d{\\overline{\\bm{x}}} \\,. \n\\label{evolution_phi_e}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\phi_{e}}{\\partial t}=\\int_{\\Omega(t)}\\frac{\\partial f}{\\partial&#10;t%&#10;}d{\\overline{\\bm{x}}}+\\int_{\\Omega(t)}\\nabla_{{\\overline{\\bm{x}}}}\\cdot[V({%&#10;\\overline{\\bm{x}}},t)f({\\bm{x}};t|{\\overline{\\bm{x}}})]\\,d{\\overline{\\bm{x}}}\\,.\" display=\"block\"><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>ϕ</mi><mi>e</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>=</mo><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mi>d</mi><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo>+</mo><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><msub><mo>∇</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">[</mo><mi>V</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mi>f</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>;</mo><mi>t</mi><mo stretchy=\"false\">|</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow><mi>d</mi><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "       \nwhere $\\varepsilon= \\varepsilon({\\bm{x}})$ is a generic evolution operator not acting on ${\\overline{\\bm{x}}}$ and $t$, \nEq. (\\ref{evolution_phi_e}) becomes  \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nAssuming that $f({\\bm{x}};t|{\\overline{\\bm{x}}})$ satisfies an evolution equation of the type\n\n", "index": 13, "text": "\\begin{equation}\n\\frac{\\partial f}{\\partial t} = \\varepsilon f \\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial f}{\\partial t}=\\varepsilon f\\,,\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mi>ε</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>f</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": " \nThe velocity of the fire-line propagation is controlled by the ROS $\\mathcal{V}$ and defined through $V = \\mathcal{V}({\\overline{\\bm{x}}}, t) {\\widehat{\\bm{n}}}$, \nwhile turbulence and fire-spotting phenomena are modelled by modifying the PDF function. \nThis method is compatible with the estimation of the ROS by any technique. \n\n\\smallskip \nThe modelling of the effects of the random processes is handled by the PDF $f({\\bm{x}};t|{\\overline{\\bm{x}}})$, \naccounting for the two independent random variables representing turbulence and fire-spotting respectively. \nIt should be noted that for brevity, here fire-spotting is assumed to be an independent downwind phenomenon; \nhence the effect of fire-spotting is accounted only for the leeward part of the fire-line. \nTaking into account these assumptions the PDF for the random processes can be defined as\n\n", "itemtype": "equation", "pos": -1, "prevtext": "       \nwhere $\\varepsilon= \\varepsilon({\\bm{x}})$ is a generic evolution operator not acting on ${\\overline{\\bm{x}}}$ and $t$, \nEq. (\\ref{evolution_phi_e}) becomes  \n\n", "index": 15, "text": "\\begin{equation}\n\\frac{\\partial \\phi_{e}}{\\partial t} = \\varepsilon \\phi_{e} + \\int_{\\Omega(t)} \\nabla_{{\\overline{\\bm{x}}}} \\cdot \n[V({\\overline{\\bm{x}}},t) f({\\bm{x}};t|{\\overline{\\bm{x}}})] \\, d{\\overline{\\bm{x}}} \\,. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\phi_{e}}{\\partial t}=\\varepsilon\\phi_{e}+\\int_{\\Omega(t)}\\nabla%&#10;_{{\\overline{\\bm{x}}}}\\cdot[V({\\overline{\\bm{x}}},t)f({\\bm{x}};t|{\\overline{%&#10;\\bm{x}}})]\\,d{\\overline{\\bm{x}}}\\,.\" display=\"block\"><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>ϕ</mi><mi>e</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mi>ε</mi><msub><mi>ϕ</mi><mi>e</mi></msub><mo>+</mo><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><msub><mo>∇</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">[</mo><mi>V</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mi>f</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>;</mo><mi>t</mi><mo stretchy=\"false\">|</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow><mi>d</mi><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere ${\\widehat{\\bm{n}}}_U$ is the unit vector aligned with the mean wind direction.\n\n\\smallskip\nTurbulent diffusion is assumed to be isotropic and modelled by a bi-variate Gaussian PDF\n\n", "itemtype": "equation", "pos": 27934, "prevtext": " \nThe velocity of the fire-line propagation is controlled by the ROS $\\mathcal{V}$ and defined through $V = \\mathcal{V}({\\overline{\\bm{x}}}, t) {\\widehat{\\bm{n}}}$, \nwhile turbulence and fire-spotting phenomena are modelled by modifying the PDF function. \nThis method is compatible with the estimation of the ROS by any technique. \n\n\\smallskip \nThe modelling of the effects of the random processes is handled by the PDF $f({\\bm{x}};t|{\\overline{\\bm{x}}})$, \naccounting for the two independent random variables representing turbulence and fire-spotting respectively. \nIt should be noted that for brevity, here fire-spotting is assumed to be an independent downwind phenomenon; \nhence the effect of fire-spotting is accounted only for the leeward part of the fire-line. \nTaking into account these assumptions the PDF for the random processes can be defined as\n\n", "index": 17, "text": "\\begin{equation}\nf({\\bm{x}};t|{\\overline{\\bm{x}}}) = \n\\begin{cases}\n\\displaystyle\n\\int_{0}^{\\infty} G({\\bm{x}}-{\\overline{\\bm{x}}}- \\ell \\, {\\widehat{\\bm{n}}}_{U};t) q(\\ell;t) \\, d\\ell \\,, &  {\\widehat{\\bm{n}}} \\cdot {\\widehat{\\bm{n}}}_{U} \\geq 0 \\,,\\\\\n\\\\\nG({\\bm{x}}-{\\overline{\\bm{x}}};t), & otherwise \\,,\n\\end{cases}\n\\label{pdf}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"f({\\bm{x}};t|{\\overline{\\bm{x}}})=\\begin{cases}\\displaystyle\\int_{0}^{\\infty}G%&#10;({\\bm{x}}-{\\overline{\\bm{x}}}-\\ell\\,{\\widehat{\\bm{n}}}_{U};t)q(\\ell;t)\\,d\\ell%&#10;\\,,&amp;{\\widehat{\\bm{n}}}\\cdot{\\widehat{\\bm{n}}}_{U}\\geq 0\\,,\\\\&#10;\\\\&#10;G({\\bm{x}}-{\\overline{\\bm{x}}};t),&amp;otherwise\\,,\\end{cases}\" display=\"block\"><mrow><mi>f</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>;</mo><mi>t</mi><mo stretchy=\"false\">|</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒙</mi><mo>-</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">ℓ</mi></mpadded><mo>⁢</mo><msub><mover accent=\"true\"><mi>𝒏</mi><mo>^</mo></mover><mi>U</mi></msub></mrow></mrow><mo>;</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">ℓ</mi><mo>;</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">ℓ</mi></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mover accent=\"true\"><mi>𝒏</mi><mo>^</mo></mover><mo>⋅</mo><msub><mover accent=\"true\"><mi>𝒏</mi><mo>^</mo></mover><mi>U</mi></msub></mrow><mo>≥</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi/></mtd><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒙</mi><mo>-</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></mrow><mo>;</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>o</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>e</mi></mpadded></mrow><mo>,</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere $D$ is the turbulent diffusion coefficient  \nsuch that $\\left\\langle (x-{\\overline{x}})^{2}\\right\\rangle = \n\\left\\langle (y-{\\overline{y}})^{2}\\right\\rangle = 2Dt$. \nIn the present model, the whole effect of the turbulent processes over different scales is assumed to be parametrised only by the turbulent diffusion coefficient.\n\n\\smallskip\nThe jump length of the firebrands varies according to the meteorological conditions, \nthe intensity of the fire and the fuel characteristics \\cite{albini-usafs-1983, morris-usafs-1987, catchpole-2002}. \nA precise formulation of the landing distributions is difficult due to the limited small scale experimental results \\cite{houssami_etal-ft-2015} \nand the complexities involved in characterising the detailed aspect of firebrand generation and landing. The firebrands land only in the positive direction and their landing distribution increases with distance to reach a maximum before dropping to zero \\cite{hage-jam-1961,manzello_etal-fsj-2008}. In past, researchers have utilized different statistical distributions to fit/reproduce the distribution pattern of particles deposited on ground from a given source, e.g. The lognormal distribution is used to depict the distribution of the short-range firebrands (up to $4500 \\, \\rm{m}$) \\cite{sardoy_etal-cf-2008} \nwhile other studies also indicate the use of a Rayleigh distribution \\cite{wang-ft-2011} or a Weibull distribution \\cite{kortas_etal-fsj-2009} to describe the landing distributions. \n\n\\smallskip\nIn this study, a lognormal distribution is used to describe the downwind distribution of the firebrands: \n\n", "itemtype": "equation", "pos": 28467, "prevtext": "\nwhere ${\\widehat{\\bm{n}}}_U$ is the unit vector aligned with the mean wind direction.\n\n\\smallskip\nTurbulent diffusion is assumed to be isotropic and modelled by a bi-variate Gaussian PDF\n\n", "index": 19, "text": "\\begin{equation}\nG({\\bm{x}}-{\\overline{\\bm{x}}};t)=\\frac{1}{4\\pi D t}\n\\exp{\\left\\lbrace \\frac{(x-{\\overline{x}})^{2}+(y-{\\overline{y}})^{2}}{4 D t}\\right\\rbrace} \\,, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"G({\\bm{x}}-{\\overline{\\bm{x}}};t)=\\frac{1}{4\\pi Dt}\\exp{\\left\\{\\frac{(x-{%&#10;\\overline{x}})^{2}+(y-{\\overline{y}})^{2}}{4Dt}\\right\\}}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒙</mi><mo>-</mo><mover accent=\"true\"><mi>𝒙</mi><mo>¯</mo></mover></mrow><mo>;</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>{</mo><mfrac><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><mover accent=\"true\"><mi>x</mi><mo>¯</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>y</mi><mo>-</mo><mover accent=\"true\"><mi>y</mi><mo>¯</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo rspace=\"4.2pt\">}</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere $\\mu(t) = \\left\\langle \\ln \\ell/\\ell_0\\right\\rangle $ and $\\sigma(t)=\\left\\langle (\\ln \\ell/\\ell_0 -\\mu(t))^{2}\\right\\rangle$ \nare the mean and the standard deviation of $\\ln \\ell/\\ell_0$ respectively, and $\\ell_0$\nis a unit reference length.\n\n\\smallskip\nSince the fuel ignition due to hot air and firebrands is not an instantaneous process, a suitable criterion related to an ignition delay \nis introduced for application to wildfire modelling. This ignition delay was previously considered as a heating-before-burning mechanism due to the hot air \nby \\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012} and generalised to include fire-spotting by \\cite{pagnini_etal-nhess-2014}.\nIn particular, since the fuel can burn because of two pathways, i.e. hot-air heating and firebrand landing, \nthe resistance analogy suggests that the resulting ignition delay can be approximately computed as resistances acting in parallel. \nHence, representing $\\tau_h$ and $\\tau_f$ as the ignition delay due to hot air and firebrands respectively, the joint ignition delay $\\tau$ is\n\n", "itemtype": "equation", "pos": 30262, "prevtext": "\nwhere $D$ is the turbulent diffusion coefficient  \nsuch that $\\left\\langle (x-{\\overline{x}})^{2}\\right\\rangle = \n\\left\\langle (y-{\\overline{y}})^{2}\\right\\rangle = 2Dt$. \nIn the present model, the whole effect of the turbulent processes over different scales is assumed to be parametrised only by the turbulent diffusion coefficient.\n\n\\smallskip\nThe jump length of the firebrands varies according to the meteorological conditions, \nthe intensity of the fire and the fuel characteristics \\cite{albini-usafs-1983, morris-usafs-1987, catchpole-2002}. \nA precise formulation of the landing distributions is difficult due to the limited small scale experimental results \\cite{houssami_etal-ft-2015} \nand the complexities involved in characterising the detailed aspect of firebrand generation and landing. The firebrands land only in the positive direction and their landing distribution increases with distance to reach a maximum before dropping to zero \\cite{hage-jam-1961,manzello_etal-fsj-2008}. In past, researchers have utilized different statistical distributions to fit/reproduce the distribution pattern of particles deposited on ground from a given source, e.g. The lognormal distribution is used to depict the distribution of the short-range firebrands (up to $4500 \\, \\rm{m}$) \\cite{sardoy_etal-cf-2008} \nwhile other studies also indicate the use of a Rayleigh distribution \\cite{wang-ft-2011} or a Weibull distribution \\cite{kortas_etal-fsj-2009} to describe the landing distributions. \n\n\\smallskip\nIn this study, a lognormal distribution is used to describe the downwind distribution of the firebrands: \n\n", "index": 21, "text": "\\begin{equation}\nq(\\ell;t) = \\frac{1}{\\sqrt{2\\pi} \\, \\sigma(t) \\, \\ell}\\exp\\left\\lbrace -\\frac{(\\ln \\ell/\\ell_0 -\\mu(t))^{2}}{2 \\, \\sigma(t)^{2}} \\right\\rbrace \\,, \n\\label{lognormal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"q(\\ell;t)=\\frac{1}{\\sqrt{2\\pi}\\,\\sigma(t)\\,\\ell}\\exp\\left\\{-\\frac{(\\ln\\ell/%&#10;\\ell_{0}-\\mu(t))^{2}}{2\\,\\sigma(t)^{2}}\\right\\}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">ℓ</mi><mo>;</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mpadded width=\"+1.7pt\"><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt></mpadded><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">ℓ</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>{</mo><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ln</mi><mo>⁡</mo><mrow><mi mathvariant=\"normal\">ℓ</mi><mo>/</mo><msub><mi mathvariant=\"normal\">ℓ</mi><mn>0</mn></msub></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow><mo rspace=\"4.2pt\">}</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\n\n\\smallskip\nSuch delay effect can be portrayed as a heating-before-burning mechanism \nand described by an accumulative process of the effective fire-front over time, i.e.\n\n", "itemtype": "equation", "pos": 31532, "prevtext": "\nwhere $\\mu(t) = \\left\\langle \\ln \\ell/\\ell_0\\right\\rangle $ and $\\sigma(t)=\\left\\langle (\\ln \\ell/\\ell_0 -\\mu(t))^{2}\\right\\rangle$ \nare the mean and the standard deviation of $\\ln \\ell/\\ell_0$ respectively, and $\\ell_0$\nis a unit reference length.\n\n\\smallskip\nSince the fuel ignition due to hot air and firebrands is not an instantaneous process, a suitable criterion related to an ignition delay \nis introduced for application to wildfire modelling. This ignition delay was previously considered as a heating-before-burning mechanism due to the hot air \nby \\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012} and generalised to include fire-spotting by \\cite{pagnini_etal-nhess-2014}.\nIn particular, since the fuel can burn because of two pathways, i.e. hot-air heating and firebrand landing, \nthe resistance analogy suggests that the resulting ignition delay can be approximately computed as resistances acting in parallel. \nHence, representing $\\tau_h$ and $\\tau_f$ as the ignition delay due to hot air and firebrands respectively, the joint ignition delay $\\tau$ is\n\n", "index": 23, "text": "\\begin{equation}\n\\frac{1}{\\tau}=\\frac{1}{\\tau_h} + \\frac{1}{\\tau_f} = \\frac{\\tau_h + \\tau_f}{\\tau_h \\tau_f} \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{\\tau}=\\frac{1}{\\tau_{h}}+\\frac{1}{\\tau_{f}}=\\frac{\\tau_{h}+\\tau_{f}}{%&#10;\\tau_{h}\\tau_{f}}\\,.\" display=\"block\"><mrow><mrow><mfrac><mn>1</mn><mi>τ</mi></mfrac><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>τ</mi><mi>h</mi></msub></mfrac><mo>+</mo><mfrac><mn>1</mn><msub><mi>τ</mi><mi>f</mi></msub></mfrac></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>τ</mi><mi>h</mi></msub><mo>+</mo><msub><mi>τ</mi><mi>f</mi></msub></mrow><mrow><msub><mi>τ</mi><mi>h</mi></msub><mo>⁢</mo><msub><mi>τ</mi><mi>f</mi></msub></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere, $\\psi(x,0)=0$ corresponds to the initial unburned fuel. \n\n\nThis accumulation can be understood as an accumulation of heat that results in an increase of the fuel temperature $T({\\bm{x}},t)$. \nFinally, the function $\\psi({\\bm{x}},t)$ may be related to the fuel temperature $T({\\bm{x}},t)$ as follows:\n\n", "itemtype": "equation", "pos": 31830, "prevtext": "\n\n\\smallskip\nSuch delay effect can be portrayed as a heating-before-burning mechanism \nand described by an accumulative process of the effective fire-front over time, i.e.\n\n", "index": 25, "text": "\\begin{equation}\n\\psi(x,t) =\\int_{0}^{t} \\phi_{e}(x,\\eta)\\frac{d\\eta}{\\tau} \\,, \n\\label{psi}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\psi(x,t)=\\int_{0}^{t}\\phi_{e}(x,\\eta)\\frac{d\\eta}{\\tau}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></msubsup><mrow><msub><mi>ϕ</mi><mi>e</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>η</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>η</mi></mrow><mi>τ</mi></mfrac></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere $T_{ign}$ is the ignition temperature, $T(({\\bm{x}}),0) = T_a({\\bm{x}})$  and $T({\\bm{x}},t)\\leq T_{ign}$. \n\n\\smallskip\nLet $\\Delta t$ be the ignition delay due to the effects of the random processes, then after the elapse of the ignition delay time  \n$T({\\bm{x}},\\Delta t) = T_{ign}$, and with the assumptions $T_a \\ll T_{ign}$ and the constant of proportionality equal to $1$,\nEq. \\eqref{psi_temp} reduces to \n\n", "itemtype": "equation", "pos": 32245, "prevtext": "\nwhere, $\\psi(x,0)=0$ corresponds to the initial unburned fuel. \n\n\nThis accumulation can be understood as an accumulation of heat that results in an increase of the fuel temperature $T({\\bm{x}},t)$. \nFinally, the function $\\psi({\\bm{x}},t)$ may be related to the fuel temperature $T({\\bm{x}},t)$ as follows:\n\n", "index": 27, "text": "\\begin{equation}\n\\psi({\\bm{x}},t)\\propto\\frac{T({\\bm{x}},t)-T_a({\\bm{x}})}{T_{ign}-T_a({\\bm{x}})} \\,,\n\\label{psi_temp} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\psi({\\bm{x}},t)\\propto\\frac{T({\\bm{x}},t)-T_{a}({\\bm{x}})}{T_{ign}-T_{a}({\\bm%&#10;{x}})}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>T</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mi>T</mi><mrow><mi>i</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>-</mo><mrow><msub><mi>T</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": " \nHence, as a cumulative effect of hot air and firebrands on the unburned fuel, an ignition point ${\\bm{x}}$ at time $t$ is created when $\\psi({\\bm{x}},t) = 1$, and the condition $\\phi({\\bm{x}}, t)=1$ is also imposed.\n\n\\section{Turbulence and fire-spotting effects into DEVS based wildfire simulator}\n\\label{devs}\nDEVS based wild-land fire tracker developed in the context of ForeFire  \nis bereft of any additional terms or parameters to model turbulence or fire-spotting. When the evolving fire-front in DEVS encounters a fire break zone, new markers are generated at the interface between the two regions, and a null propagation velocity in the fuel break zone inhibits their further propagation. \nThe steps of the numerical procedure to include the effects of random processes within the DEVS formulation of ForeFire are described as follows:\n\n\\begin{enumerate}[Step 1.]\n\\item Beginning with an initial fire-line at time $t = 0$, the DEVS front tracking method is used to estimate the propagation of the markers to build up \na new fire perimeter valid at time $t$. Any ROS specification can be selected according to the user requirements. \n\n\\item The information from the active burning points at time $t$ is used to construct the indicator function $\\phi({\\bm{x}},t)$ (\\ref{indicatorphi}), \nwhich is equal to $0$ over the region of the available fuel and $1$ over the burned area. \nThe fire perimeter from DEVS is not over a mesh/grid, but instead comprises of discrete values spread all over the domain. \nFor brevity, the effective indicator function $\\phi_e({\\bm{x}},t)$ (\\ref{phi_e}) is generated over a Cartesian grid\nto facilitate the computation of the function $\\psi({\\bm{x}},t)$ (\\ref{psi}) over the same grid. \nPoint in polygon is used to generate the indicator function $\\phi({\\bm{x}},t)$ from the locus of points representing the fire perimeter in DEVS. \nIt is remarked that $\\phi({\\bm{x}},t)$, and $\\phi_e({\\bm{x}},t)$ can also be computed from the real coordinates representing the fire perimeter in DEVS, but the inherent construction of the function $\\psi({\\bm{x}},t)$ mandates its computation over a regular grid.\n\n\\item The value of the effective indicator $\\phi_{e}({\\bm{x}},t)$ is computed through the numerical integration of the product of \nthe indicator function $\\phi({\\bm{x}},t)$ and the PDF of fluctuations according to Eq. (\\ref{phi_e}). \nThe occurring random phenomenon (turbulence or fire-spotting) is included by choosing the corresponding PDF (\\ref{pdf}). \n\n\\item The function $\\psi({\\bm{x}},t)$ is updated for each grid point by integration in time with the current value of $\\phi_{e}({\\bm{x}},t)$ (Eq. \\ref{psi}). \n\n\\item All points which satisfy the condition $\\psi({\\bm{x}},t) \\geq 1$ are labelled as new ignition points and are updated in the DEVS framework as new markers eligible for propagation at time $t+1$.\n\n\\item The DEVS models time as a continuous parameter and updates the system in accordance with the events. The system is updated at user defined ``event times\". \nIn between the consecutive events, no change in the system occurs and a list of pending events is maintained in chronological order. \nThe event list is updated at the next ``event time\". Since, DEVS provides freedom to select an ``event time\", it is chosen to coincide with the maximum allowable time step according to the CFL criterion. It is remarked  that this choice of ``event time\" limits the efficiency of DEVS computation (increase in the computation time due to excessive computations), but is indispensable in order to introduce the heating-before-burning mechanism in the current formulation.\n\n\\item At the next time step, the new markers progress according to the DEVS front tracking method, and the updated perimeter at time $t=t+1$ \nis again enriched with the random fluctuations. The sequence is repeated till the final ``event time\" step or till the fire reaches the end of the domain. \n\\end{enumerate}\n \n\\smallskip\nIt is remarked that the direction of the propagation vector for DEVS is decided by the bisector of the angle formed between \na marker and its immediate neighbouring markers \non left and right. This direction vector is a weak approximation of the normal and can be very different from the actual normal direction in the case of a non-circular profile.\n \n\\section{Simulation set-up}\n\\label{setup}\nTo estimate the performance of the DEVS front tracking method with the inclusion of the random processes, a series of numerical experiments are performed. Similar set of experiments are also carried out with the LSM based simulator to enable a fair comparison between the two techniques. \nFor what concerns the use of the LSM, a formulation developed in Ref. \\cite{mallet_etal-cma-2009} and Ref. \\cite{mandel_etal-gmd-2011} is followed, \nwhile for the DEVS method, \nForeFire fire simulator \\cite{filippi_etal-s-2009} is used. \nTo allow a direct comparison between the two, both models are parametrised in an identical set-up. \n\n\\smallskip\nIn the present study, for brevity, no particular type of vegetation is defined and simulations are carried out with a pre-defined constant value of ROS. \nIt is assumed that the ROS remains constant for a particular domain. It is emphasised that these are simplified and idealised test cases and no attempt has been made to choose the parameters representing a realistic set-up.  \nThe present scope of this work is to provide a first look into the investigation of the performance of LSM and DEVS based fire simulators in the context of inclusion of the effects due to random processes.\n\n\\smallskip\nA flat area of hypothetical homogeneous vegetation spread over a domain size of $5000\\, \\rm m \\times 5000\\, \\rm m $ is selected for simulations. \nDifferent values of the ROS are utilised for different test cases. The ROS is assumed to be $0.05 \\, \\rm ms^{-1}$ along the normal direction ${\\widehat{\\bm{n}}}$\nin no wind conditions, while in the presence of wind, it is estimated by the $3\\%$ ROS model \\cite{filippi_etal-nhess-2014}, i.e.\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $T_{ign}$ is the ignition temperature, $T(({\\bm{x}}),0) = T_a({\\bm{x}})$  and $T({\\bm{x}},t)\\leq T_{ign}$. \n\n\\smallskip\nLet $\\Delta t$ be the ignition delay due to the effects of the random processes, then after the elapse of the ignition delay time  \n$T({\\bm{x}},\\Delta t) = T_{ign}$, and with the assumptions $T_a \\ll T_{ign}$ and the constant of proportionality equal to $1$,\nEq. \\eqref{psi_temp} reduces to \n\n", "index": 29, "text": "\\begin{equation}\n\\psi({\\bm{x}},\\Delta t) = 1 \\,. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\psi({\\bm{x}},\\Delta t)=1\\,.\" display=\"block\"><mrow><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>,</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mn>1</mn></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere ${\\bm{U}}$ is the mean wind velocity. Since, $3\\%$ ROS limits the propagation towards the mean wind direction, \na ROS formulation provided by Mallet {\\it et al.} \\cite{mallet_etal-cma-2009} is followed to prescribe non-zero spread velocities for the flank and rear fires:\n\n", "itemtype": "equation", "pos": 38879, "prevtext": " \nHence, as a cumulative effect of hot air and firebrands on the unburned fuel, an ignition point ${\\bm{x}}$ at time $t$ is created when $\\psi({\\bm{x}},t) = 1$, and the condition $\\phi({\\bm{x}}, t)=1$ is also imposed.\n\n\\section{Turbulence and fire-spotting effects into DEVS based wildfire simulator}\n\\label{devs}\nDEVS based wild-land fire tracker developed in the context of ForeFire  \nis bereft of any additional terms or parameters to model turbulence or fire-spotting. When the evolving fire-front in DEVS encounters a fire break zone, new markers are generated at the interface between the two regions, and a null propagation velocity in the fuel break zone inhibits their further propagation. \nThe steps of the numerical procedure to include the effects of random processes within the DEVS formulation of ForeFire are described as follows:\n\n\\begin{enumerate}[Step 1.]\n\\item Beginning with an initial fire-line at time $t = 0$, the DEVS front tracking method is used to estimate the propagation of the markers to build up \na new fire perimeter valid at time $t$. Any ROS specification can be selected according to the user requirements. \n\n\\item The information from the active burning points at time $t$ is used to construct the indicator function $\\phi({\\bm{x}},t)$ (\\ref{indicatorphi}), \nwhich is equal to $0$ over the region of the available fuel and $1$ over the burned area. \nThe fire perimeter from DEVS is not over a mesh/grid, but instead comprises of discrete values spread all over the domain. \nFor brevity, the effective indicator function $\\phi_e({\\bm{x}},t)$ (\\ref{phi_e}) is generated over a Cartesian grid\nto facilitate the computation of the function $\\psi({\\bm{x}},t)$ (\\ref{psi}) over the same grid. \nPoint in polygon is used to generate the indicator function $\\phi({\\bm{x}},t)$ from the locus of points representing the fire perimeter in DEVS. \nIt is remarked that $\\phi({\\bm{x}},t)$, and $\\phi_e({\\bm{x}},t)$ can also be computed from the real coordinates representing the fire perimeter in DEVS, but the inherent construction of the function $\\psi({\\bm{x}},t)$ mandates its computation over a regular grid.\n\n\\item The value of the effective indicator $\\phi_{e}({\\bm{x}},t)$ is computed through the numerical integration of the product of \nthe indicator function $\\phi({\\bm{x}},t)$ and the PDF of fluctuations according to Eq. (\\ref{phi_e}). \nThe occurring random phenomenon (turbulence or fire-spotting) is included by choosing the corresponding PDF (\\ref{pdf}). \n\n\\item The function $\\psi({\\bm{x}},t)$ is updated for each grid point by integration in time with the current value of $\\phi_{e}({\\bm{x}},t)$ (Eq. \\ref{psi}). \n\n\\item All points which satisfy the condition $\\psi({\\bm{x}},t) \\geq 1$ are labelled as new ignition points and are updated in the DEVS framework as new markers eligible for propagation at time $t+1$.\n\n\\item The DEVS models time as a continuous parameter and updates the system in accordance with the events. The system is updated at user defined ``event times\". \nIn between the consecutive events, no change in the system occurs and a list of pending events is maintained in chronological order. \nThe event list is updated at the next ``event time\". Since, DEVS provides freedom to select an ``event time\", it is chosen to coincide with the maximum allowable time step according to the CFL criterion. It is remarked  that this choice of ``event time\" limits the efficiency of DEVS computation (increase in the computation time due to excessive computations), but is indispensable in order to introduce the heating-before-burning mechanism in the current formulation.\n\n\\item At the next time step, the new markers progress according to the DEVS front tracking method, and the updated perimeter at time $t=t+1$ \nis again enriched with the random fluctuations. The sequence is repeated till the final ``event time\" step or till the fire reaches the end of the domain. \n\\end{enumerate}\n \n\\smallskip\nIt is remarked that the direction of the propagation vector for DEVS is decided by the bisector of the angle formed between \na marker and its immediate neighbouring markers \non left and right. This direction vector is a weak approximation of the normal and can be very different from the actual normal direction in the case of a non-circular profile.\n \n\\section{Simulation set-up}\n\\label{setup}\nTo estimate the performance of the DEVS front tracking method with the inclusion of the random processes, a series of numerical experiments are performed. Similar set of experiments are also carried out with the LSM based simulator to enable a fair comparison between the two techniques. \nFor what concerns the use of the LSM, a formulation developed in Ref. \\cite{mallet_etal-cma-2009} and Ref. \\cite{mandel_etal-gmd-2011} is followed, \nwhile for the DEVS method, \nForeFire fire simulator \\cite{filippi_etal-s-2009} is used. \nTo allow a direct comparison between the two, both models are parametrised in an identical set-up. \n\n\\smallskip\nIn the present study, for brevity, no particular type of vegetation is defined and simulations are carried out with a pre-defined constant value of ROS. \nIt is assumed that the ROS remains constant for a particular domain. It is emphasised that these are simplified and idealised test cases and no attempt has been made to choose the parameters representing a realistic set-up.  \nThe present scope of this work is to provide a first look into the investigation of the performance of LSM and DEVS based fire simulators in the context of inclusion of the effects due to random processes.\n\n\\smallskip\nA flat area of hypothetical homogeneous vegetation spread over a domain size of $5000\\, \\rm m \\times 5000\\, \\rm m $ is selected for simulations. \nDifferent values of the ROS are utilised for different test cases. The ROS is assumed to be $0.05 \\, \\rm ms^{-1}$ along the normal direction ${\\widehat{\\bm{n}}}$\nin no wind conditions, while in the presence of wind, it is estimated by the $3\\%$ ROS model \\cite{filippi_etal-nhess-2014}, i.e.\n\n", "index": 31, "text": "\\begin{equation}\nROS = 0.03 \\, {\\bm{U}} \\cdot {\\widehat{\\bm{n}}} \\,, \n\\label{three_percent} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"ROS=0.03\\,{\\bm{U}}\\cdot{\\widehat{\\bm{n}}}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>O</mi><mo>⁢</mo><mi>S</mi></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mn>0.03</mn></mpadded><mo>⁢</mo><mi>𝑼</mi></mrow><mo>⋅</mo><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>𝒏</mi><mo>^</mo></mover></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere $U^2={\\bm{U}} \\cdot {\\bm{U}}$, $\\varepsilon_{o}$ is the flank velocity,  \n($\\varepsilon_{o}\\alpha$) is the rear velocity with $\\alpha\\in[0,1]$, \nand $\\theta$ is defined as the angle between the normal to the front and the wind direction. \nIn the present set-up, the parameters are defined as \n$\\alpha = 0.8$, $n = 3$, $a=0.5 \\, \\rm m^{1/2}s^{-1/2}$, $\\varepsilon_{o}=0.2 \\, \\rm ms^{-1}$, and $U = 3\\, \\rm ms^{-1}$ \\cite{mallet_etal-cma-2009}. \n\n\\smallskip\nIn the case of the LSM based simulator, \nthe domain is discretised with a Cartesian grid of $20\\, \\rm m$ both in $x$ and $y$ directions, \nwhile for DEVS the resolution of the simulation is established in the terms of quantum distance $\\Delta q$ and perimeter resolution $\\Delta c$ \\cite{filippi_etal-s-2009}. Quantum distance $\\Delta q$ is defined as the maximum allowable distance to be covered by a particle at each advance, \nwhile a measure of $\\Delta c$ is used to decompose/regenerate/coalesce two particles on propagation. \nThe choice of $\\Delta q$ and $\\Delta c$ is {\\it dependent on the type of problem}, and in the present study, two sets of values are utilized. \nThe simulations are performed with $\\Delta q = 4\\, \\rm m $, $\\Delta c = 18\\, \\rm m $ for zero wind conditions, and $\\Delta q = 0.3\\,\\rm m $, $\\Delta c = 8\\,\\rm m$ in the presence of wind. \nTo avoid instability in the presence of wind, $\\Delta q$ is chosen to be of a much higher resolution than the wind data ($20 \\,\\rm m$ in this set-up). \nIn DEVS based simulator, the locus of the points constituting the initial front are wind up in the clockwise direction to represent an expanding front (anticlockwise order represents a contracting front). \n\n\\smallskip\nThe mean wind, wherever used, is assumed to be constant in magnitude and direction. \nThe turbulent diffusion coefficient $D$, and ignition delays corresponding to hot air and firebrands heating are also assumed to be constant throughout the simulations. \nIn particular, the ignition delay corresponding to the hot air $\\tau_h$ and to the firebrand $\\tau_f$ are assumed to be \n$10 \\, \\rm min$ and $1\\,\\rm min$ respectively.\nMoreover, with reference to the lognormal distribution (\\ref{lognormal}), \nthe unit reference length $\\ell_0$ is fixed equal to $0.30\\,\\rm m$.\n\n\\smallskip\nMultiple idealised simulation tests are performed both in the presence and the absence of wind by neglecting and considering the effects of the random phenomena.\nThe {\\it first} case evaluates an isotropic growth of the fire-line in the absence of wind by neglecting all the random processes. \nIn the {\\it second} test, the spread of fire-line for different ROS in different directions is studied. \nThe {\\it third} test discusses the propagation of the fire-line with wind when the ROS is defined according to the $3\\%$ of the mean wind,\nformula (\\ref{three_percent}), and when it is defined according to formula (\\ref{Mallet}). \nThe random processes are neglected for the first three test cases. The pure LSM and pure DEVS based wildfire models fail while managing the realistic cases of fire propagation across the fire-break zones, \nhence the {\\it fourth} test evaluates the performance of DEVS when turbulent processes are also considered in the model. The effect of turbulent processes is studied both in the presence and the absence of the wind. \n\nThe {\\it fifth} test evaluates the performance of the two simulators when fire-spotting is also included along with turbulence. \nFire-break zones are also introduced in the last two tests (the fourth and the fifth) to observe the propagation of the fire-line while encountering areas of null fuel. \nTo simplify the simulation and maintain equivalence between the two simulators, the region across and behind the centre of the initial fire-line is demarcated as the leeward side and the windward side respectively. \n\n\\smallskip\nAs an extension of the study, a brief analysis of the firebrand landing distribution is also made. \nWith reference to the lognormal distribution (\\ref{lognormal}) for firebrand landing,\ndifferent values of $\\mu$ and $\\sigma$ are chosen motivated by a possible correlation with some physical aspects of wildfire like changing fire intensity and meteorological conditions.  \nFor these simulations, only the LSM based simulator is used and the wind speed is assumed to be $3\\,\\rm ms^{-1}$, while the ROS is given by the Rothermel model\n\\cite{rothermel-1972,mandel_etal-gmd-2011}. \n\n\\smallskip\nAll the simulations have been performed at BCAM--Basque Center for Applied Mathematics (\\url {www.bcamath.org}) in Bilbao, Basque Country -- Spain.\n\n\\section{Discussion}       \n\\label{discussion}\nIn the first three test scenarios, the evolution of the fire-line without the impact of random processes in both LSM and DEVS approaches is analysed. Fig.~\\ref{fig:FF_LSM_no_wind} presents the propagation of the fire-line in no wind conditions for both the simulators. \nThe advancement of the initial circular fire-line follows an isotropic growth and with identical initial conditions the two different moving interface schemes provide a similar evolution of the fire-line. \nA cross section of the indicator function $\\phi({\\bm{x}},t)$, at $y=2500$ and $t =140\\,\\rm min$ is analysed for a quantitative comparison of the fronts \nfrom the two simulators (Fig.~\\ref{fig:phi_circle}). \nThe $\\phi({\\bm{x}},t)$ function from the two models shows a perfect overlap. \n\n\n\n\nModelling real situations of fire involves presence of zones without fuel where the ROS is zero. In case of fire-break zones, pure LSM and DEVS based simulators are inherently unable to simulate the realistic situations of fire overcoming the fire break zones. \nFig.~\\ref{fig:FF_LSM_no_wind_firebreak} shows that in no wind conditions, the fire-line fails to propagate across the fire-break when no random processes are included. The evolution is shown only up to $140\\,\\rm min$, but an extended run up to $250\\,\\rm min$ (not shown) indicates the limitation of the two approaches to reproduce the fire jump across the no fuel zone. \n\n\\smallskip \nFig.~\\ref{fig:FF_LSM_nowind_inhomo} presents the growth of an initial spot fire but with a non-homogeneous ROS in absence of any wind. \nThe different values of the ROS can be attributed to different fuel types, but here no effort has been made to describe the fuel type. \nThe fire-line propagates with different speed in the three different directions, but the isotropy is preserved. The results from the first three test cases indicate that in the absence of wind, the two advancing schemes: LSM and DEVS, show an identical behaviour in simulating situations with constant ROS and hence, this observation provides a crucial background and scope for the comparison of situations with increasing variability and complexity.\n\n\\smallskip \nFig.~\\ref{fig:FF_LSM_wind_circle} shows the  evolution of the fire-front of a circular initial profile with radius $300 \\, \\rm m$\nin case of a weak wind of $3 \\, \\rm m s^{-1}$ \ndirected in the east direction. The isochronous fronts are plotted at every $20\\,\\rm min$ and follow an oval shape for both the simulators. \nDEVS fire contours diverge slightly from the mean wind direction \nand develop into an increasing flanking fire over time. This divergence in the evolution of fire-front occurs due to differences in the computation of \nthe normal between the two approaches. This fact can be very well appreciated when an initial square profile is considered.  Fig.~\\ref{fig:FF_LSM_wind_square} shows the progress of the fire when the initial fire perimeter is considered to be a square with side $600 \\,\\rm m$. \nUnder the effect of a constant zonal wind and restricted $3\\%$ ROS model (\\ref{three_percent}), the evolution in LSM strictly follows the initial square shape, \nbut in DEVS the active burning markers at the corners advance spuriously to provide an additional flanking spread. \nA cross section of the indicator function $\\phi({\\bm{x}},t)$ at $y=2500 \\, \\rm m$ shows that though the head fire in both the simulators arrives to the same distance in $160 \\, \\rm  min$, but considerable differences are observed in the lateral cross section at $x=3500 \\, \\rm m$ (Fig.~\\ref{fig:phi_square}). \nThe flank fires generated by the approximate construction of the normal seem to be in a more qualitative agreement with a realistic case, but \nwithin the stated analytical formulation of the ROS (\\ref{three_percent}), the lateral progress of the flank fires is an anomalous behaviour. \n\n\\smallskip\nThe ROS formulation developed by Mallet {\\it et al.} \\cite{mallet_etal-cma-2009},\nhere formula (\\ref{Mallet}), provides a simple way to study the evolution of flank fire by introducing different ROS for \nthe head, flank and rear directions. In the original paper, $\\theta$ is defined as the angle between the normal to the front and the wind direction. \nSince, the normal computation in DEVS approach is approximate, two separate tests are performed to evaluate the effect of such\napproximation on the spread: \n{\\it firstly} when $\\theta$ is computed according to the original definition \\cite{mallet_etal-cma-2009}, \nand {\\it secondly} when $\\theta$ is assumed to be the angle between \nthe line joining the front and the wind direction to enforce an identical definition of $\\theta$ in both the methods. \nFig.~\\ref{fig:FF_LSM_Mallet_with_normal} shows the evolution of fire when $\\theta$ is computed according to the original definition;\nthe advancement of the head and rear fires are identical, but the flank fire spread is spuriously larger in DEVS because of the approximate computation of the front normal direction. \nOn the other hand, it is evident from Fig.~\\ref{fig:FF_LSM_Mallet_no_normal} that in the second case, \nwhen the computation of $\\theta$ is not affected by the approximate computation of the front normal in DEVS, the fire-line advancement is identical to LSM in all directions.\n\n\\smallskip \nAs shown in Fig.~\\ref{fig:FF_LSM_no_wind_firebreak}, in case of fire-break zones, pure LSM and DEVS based simulators are inherently \nunable to simulate the realistic situations of fire overcoming a fire break. \nBut Fig.~\\ref{fig:FF_LSM_no_wind_turb_100} shows that with the introduction of turbulence, the simulators can model the effect of hot air \nto overcome fire-break zones. Here the value of turbulent diffusion coefficient $D$ is assumed to be $0.15\\,\\rm m^{2}s^{-1}$. \nThe evolution of the fire-line is almost similar for both the simulators, though a slight underestimation can be visibly observed in the DEVS approach.  \n\n\n\n\nA cross section of $\\phi({\\bm{x}},t)$ and $\\phi_e({\\bm{x}},t)$ at $y=2500\\,\\rm m$ (Fig.~\\ref{fig:phi_phieff_turb_100}) \nprovides a more detailed illustration of the differences in the evolution of the fire-line between the two approaches. The introduction of marginal differences with the inclusion of turbulence can be explained by the contrast in the construction of the indicator function between the two simulators. In LSM, the indicator function is inherently defined over a Cartesian grid, while on the other hand, in DEVS, a gridded indicator function is derived from the original real coordinates. The point in polygon technique is used to transform the real coordinates to a Cartesian grid. This technique provides only an approximate measure of the same; small errors can be introduced by the improper classification of the points lying very close to the boundary \\cite{hormann_etal-cgta-2001}, \nand can lead to a slight underestimation/overestimation of the original fire-line.\n\n\\smallskip\nFig.~\\ref{fig:FF_LSM_no_wind_turb_200} shows the results for the two simulators when the turbulent diffusion coefficient is $D=0.30\\,\\rm m^{2} s^{-1}$. \nStronger turbulence causes a rapid propagation of the fire-line and an earlier ignition across the fire-break zone. \nA detailed analysis of the effect of varying turbulence over {\\it long-term propagation} with the LSM can be found in \n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012}. \n\n\\smallskip\nFig.~\\ref{fig:FF_LSM_with_wind_turb_100} presents the effect of inclusion of turbulence with a non-zero wind profile  \nand $3\\%$ ROS model (\\ref{three_percent}). The effect of turbulence is most pronounced in the direction of the wind and it can be clearly observed that with turbulence, the spread over the head, flank and back fire-lines is faster and the head fire is also able to overcome the fuel break. The quantum of increase in the fire spread can also be appreciated in comparison to Fig.~\\ref{fig:FF_LSM_wind_circle}, \nwhich presents the ideal case with the same initial conditions. Both simulators show almost similar characteristics in the spread of fire, though the flank fire has a slightly larger spread in DEVS.\n\n\\smallskip\nAnother aspect contributing towards the increase in the fire spread due to new fire ignitions generated by the firebrands \nis presented in Fig.~\\ref{fig:FF_LSM_with_wind_firespot_100}. With the inclusion of fire-spotting along with turbulence, the evolution of the fire-front is faster in comparison to the effect of turbulence alone (Fig.~\\ref{fig:FF_LSM_with_wind_turb_100}). \n\n\n\nThe flank fire and the head fire are also well simulated in both the approaches, and again a larger spread out the flanking fires is observed for the DEVS one. \nThe proposed mathematical formulation of spot-fires along with turbulence is effective in mimicking the rapid advancement of the fire-line due to the generation of new ignition points by the firebrands. It is also effective in simulating the new ignition points developed across the no fuel zones. Within the current parametrisation, the firebrand landing distances lie close to the main fire and are not long enough to develop a new secondary fire, but in the next section, a sensitivity study of the spatial pattern of the firebrand landing distances is also presented. \n \n\\smallskip\nFig.~\\ref{fig:FF_LSM_with_wind_turb_two_break} shows the time evolution of the fire-front in presence of a mean wind velocity of $3 \\,\\rm m s^{-1}$ \nand two fire-break zones. The results are obtained when only the effects of turbulence are included in the formulation. \nSimilarly, Fig.~\\ref{fig:FF_LSM_with_wind_firespot_two_break} shows the time evolution of fire-front but when both turbulence and fire-spotting are included in the \nformulation. Both approaches follow an identical evolution pattern as observed in other cases. \nAs expected, the spread of the fire-front is faster and is able to overcome both the fire-break zones when turbulence is included; \nbut inclusion of fire-spotting along with turbulence causes the fire to propagate at a much faster rate and results in a larger spread. Again, the major differences which arise in the evolution of flank fires between the two methods are due to the dissimilarity in the construction of the direction of the propagation of the active burning point.\n\n\\section{Insight on firebrand distribution}\n\\label{firebrand}\nIn the simulations discussed previously, \nthe phenomenon of fire-spotting contributes towards an increase in the burning area and a faster propagation of fire,\nbut the landing distances are not sufficiently long enough to develop new secondary fires detached from the primary fire. \n\n\\smallskip\nGenerally, the firebrands generated in low intensity fires fall close to the primary fire and although they contribute \ntowards a faster fire spread, the separation from the primary fire is not large enough for the new ignitions to develop a new secondary fire. \nBut high intensity fires and extreme meteorological conditions such as strong wind/extremely high temperatures/low humidity can facilitate \nthe transport of embers over longer distances and the area under firebrand attack can be sufficiently far away from the primary fire \n\\cite{wilson-1962,permin-twmh-1971, pagni-fsj-1993, trelles_etal-1997, quintiere-1998}. \nIn Ref. \\cite{koo_etal-ijwf-2010} and references therein, a brief account of the impact of various historical forest fires is provided emphasising the importance of strong winds, and extreme meteorological conditions \non the fire-spotting phenomenon. They describe different historical fires where low intensity fires coupled with strong winds and low relative humidity caused a large scale fire-spotting, while on the other hand, fires with high intensities in calm meteorological conditions had a negligible contribution from the firebrands.\n\n\\smallskip\nIn lognormal distribution (\\ref{lognormal}), \na suitable choice of the parameters $\\mu$ and $\\sigma$ can be utilized to modify the firebrand landing distributions to represent different fire intensities and wind conditions. In this study, the main interest lies in the mathematical modelling of the firebrands landing distributions, hence constant meteorological conditions are assumed for all the simulations presented here. \nIt is also assumed that each active ignition point is capable of generating firebrands and all embers are controlled by identical transport forces.  \n\n\\smallskip\nFig.~\\ref{fig:Firebrand_increasing_mu} and Fig.~\\ref{fig:Firebrand_increasing_sigma} show the variation of the area under the firebrand attack \nwith different values of $\\mu$ and $\\sigma$. A constant $\\sigma$ and an increasing $\\mu$ points towards a decrease in the effectiveness of the firebrands, \nand slows down the fire propagation. A slight deviation from the pattern is observed for $\\mu = 15$ and $\\sigma = 5$, \nwhen the firebrands travel far enough to create a new secondary fire. \n\n\\smallskip\nFor an increasing value of $\\sigma$ (Fig.~\\ref{fig:Firebrand_increasing_sigma}a-c) with constant $\\mu$, \nthe fire evolution increases as larger number of firebrands land away from the source, but the landing distances are still not long enough to delineate the new ignitions from the main fire. With further increase in $\\sigma$, a secondary fire emerges away from the main source. \nEqual contribution to the firebrands by each flaming point leads to a regular distribution pattern of the secondary fire. As time progresses, the primary fire also advances and covers up the gap with the secondary fire. \nWith further increase in $\\sigma$, the probability of the firebrands landing at farther distances increases, and this can lead to a potentially explosive firebrands attack. Fig.~\\ref{fig:Firebrand_increasing_sigma}f shows the effect of fire-spotting at shorter scales contributing to a faster rate of spread, but the development of new secondary fires is not observed. For this particular value of $\\sigma$ the statistical distribution of the long range landing distances lies outside the domain and is impossible to resolve them in the limited time and spatial scales considered in this simulation.  \n\n\\smallskip\nAs a consequence of the idealised set-up for simulations, the new secondary fires evolve with the same intensity as the primary fire and  also serve as a source of generation of newer fire brands and henceforth the tertiary fires. Fig.~\\ref{fig:Firebrand_secondary_fires}a-f demonstrates the generation of new secondary fires by the primary fire, and tertiary fires by the secondary fires. As time progresses, the each of the fire-line evolves independently along with a small contribution from its parent fire-line, and eventually they merge among each other.\n\n\\smallskip  \nIn a lognormal distribution, an increasing value of the $\\mu$ causes a right shift of the maximum, \nindicating towards a larger jump length, but the simulations suggest a decreasing trend in the landing distance. \nThis can be explained by the fact that the ignition of the unburned fuel is not an instantaneous, but rather an accumulative process. \nThe fuel starts burning only when the temperature is high enough to allow spontaneous combustion. \nThough a larger $\\mu$ allows the firebrands to fall at larger distances but it limits the frequency of landing. \nInsufficient number of firebrands landing at farther distances diminishes the efficacy of their attack to cause combustion; hence leads to a smaller contribution from fire-spotting. \nFor an effective combustion, sufficient number of firebrands should be available for an adequate heat exchange with the unburned fuel. \nOn the contrary, an increasing $\\sigma$ causes the lognormal distribution to have a lower maximum \nand an elongated right tail of the distribution, but with a high probability of landing. \nThe increase in the number of firebrands landing at away from the maximum leads to a rapid ignition of the unburned fuel and a faster propagation of the fire. \n\n\\smallskip\nAccording to the increasing and decreasing trend of the landing distance with respect to increasing $\\sigma$ and decreasing $\\mu$ respectively, \nwithin the lognormal characterisation assumed here for the firebrand landing distribution, the reference lengthscale $\\mathcal{L}$ of the landing distance can be stated as:\n\n", "itemtype": "equation", "pos": 39265, "prevtext": "\nwhere ${\\bm{U}}$ is the mean wind velocity. Since, $3\\%$ ROS limits the propagation towards the mean wind direction, \na ROS formulation provided by Mallet {\\it et al.} \\cite{mallet_etal-cma-2009} is followed to prescribe non-zero spread velocities for the flank and rear fires:\n\n", "index": 33, "text": "\\begin{equation} \nROS(U,\\theta)=\n\\begin{cases}\n\\varepsilon_{o}+a\\sqrt{U\\cos^{n}\\theta}, & \\text{if  } |\\theta|\\leq \\frac{\\pi}{2}\\,, \\\\\n\\varepsilon_{o}(\\alpha+(1-\\alpha)|\\sin\\theta|),& \\text{if  } |\\theta| > \\frac{\\pi}{2}\\,,\n\\end{cases}\n\\label{Mallet}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"ROS(U,\\theta)=\\begin{cases}\\varepsilon_{o}+a\\sqrt{U\\cos^{n}\\theta},&amp;\\text{if }%&#10;|\\theta|\\leq\\frac{\\pi}{2}\\,,\\\\&#10;\\varepsilon_{o}(\\alpha+(1-\\alpha)|\\sin\\theta|),&amp;\\text{if }|\\theta|&gt;\\frac{\\pi}{%&#10;2}\\,,\\end{cases}\" display=\"block\"><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>O</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>U</mi><mo>,</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>ε</mi><mi>o</mi></msub><mo>+</mo><mrow><mi>a</mi><mo>⁢</mo><msqrt><mrow><mi>U</mi><mo>⁢</mo><mrow><msup><mi>cos</mi><mi>n</mi></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow></msqrt></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext>if </mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>θ</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>≤</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"false\"><mfrac><mi>π</mi><mn>2</mn></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>ε</mi><mi>o</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>α</mi><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mtext>if </mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>θ</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>&gt;</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"false\"><mfrac><mi>π</mi><mn>2</mn></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06272.tex", "nexttext": "\nwhere $\\alpha >0$ and $\\beta >0$ are exponents to be established.\n\n\\smallskip\nFrom relation (\\ref{L}) it can be deduced that neither the maximum nor the mean of the lognormal distribution can be considered as an estimation of the landing distance length scale $\\mathcal{L}$. \nFurther analysis towards a physical parametrisation of fire-spotting is postponed for a future paper,\nwhere firebrand distributions different from the lognormal will be also considered.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Conclusions}\n\\label{conclusions}\nThis paper describes a mathematical formulation to model the effects of random processes into the propagation of the wild-land fires. \nThe propagation of the fire can be split into a drifting part and a fluctuating part. \nThe drifting part is given by the fire-front position determined from one of the various simulators that exist in literature for \nthe propagation of moving interfaces without random phenomena; \nwhile the fluctuating part is generated by a comprehensive statistical description of the system and includes the effects of random processes \nin agreement with the physical properties of the process. \nThe proposed formulation is developed independent of the choice of the method used to ascertain the drifting part and \nserves as a versatile addition to the existing fire spread simulators to include the effects of random spread. \nThis fact provides a unique opportunity for the comparison of two simple wildfire simulators based on the Eulerian LSM and on the Lagrangian DEVS scheme.\n\n\\smallskip\nA series of idealised numerical simulations show that the proposed approach for random effects\nemerges to be suitable for both LSM and DEVS based simulators to manage the real world situations related to random character of fire, e.g. \nincrease in fire spread due to pre-heating of the fuel by hot air,  vertical lofting and transporting of firebrands, fire overcoming no fuel zones, and development of new isolated secondary fires. \n\n\\smallskip\nThe simulations from both  LSM and DEVS techniques follow nearly identical patterns, \nand the only difference which distinguishes the outputs from the two techniques is due to the distinction in the treatment of the direction of propagation. \nIn DEVS, the active burning points propagate in a direction given by the bisector of the angle made by each marker with its immediate left and right markers, in contrast to the normal direction of propagation used in LSM. Such differences result in ``spurious\" flanking fires in DEVS, which \nare anomalous with respect to the definition of the ROS, but qualitatively provide a more ``realistic\" representation of the fire contour. Due to this fact, the two methods can be considered complementary to each other for simple situations, but with increasing complexity and the introduction of random processes a validation exercise is necessary to single out the best representation of the fire propagation. \n\n\\smallskip\nA brief study on the sensitivity of the firebrand landing distribution to the changes in the shape of the lognormal distribution indicates that \nthe modelled firebrands can generate new secondary fires. \nThe formulation for the firebrand landing distance can be modified to include information about the wind speed, \nfire intensity, radius of the firebrands and fuel characteristics. \n\n\\smallskip\nThough without a validation test case, \nthese simulations do provide an insight into the flexibility of this formulation to incorporate \neffects of random processes such as the turbulent heat diffusion and fire-spotting,\nspecially while characterising the landing distance of firebrands. \nThe results from this study provide a support to the implementation of the proposed approach for the effects of random phenomena\ninto operational softwares such as WRF-SFIRE and ForeFire. The source code utilized for all the simulations in this article is hosted at \\url{ https://github.com/forefireAPI/firefront}.\n\n\\section*{Acknowledgement}\nThis research is supported by MINECO under Grant MTM2013-40824-P, \nby Bizkaia Talent and European Commission through COFUND programme under Grant AYD-000-226, \nand also by the Basque Government through the BERC 2014-2017 program and \nby the Spanish Ministry of Economy and Competitiveness MINECO: BCAM Severo Ochoa accreditation SEV-2013-0323. \n\n\\section*{References}\n|\n\n\n\\begin{thebibliography}{10}\n\n \n\n\n \n\\bibitem{sullivan-ijwf-2009a}\nA.~L. Sullivan, Wildland surface fire spread modelling, 1990--2007. 1:\n  {Physical} and quasi-physical models, Int. J. Wildland Fire 18 (2009)\n  349--368.\n\n\\bibitem{sullivan-ijwf-2009b}\nA.~L. Sullivan, Wildland surface fire spread modelling, 1990--2007. 2:\n  {Empirical} and quasi-empirical models, Int. J. Wildland Fire 18 (2009)\n  369--386.\n\n\\bibitem{sullivan-ijwf-2009c}\nA.~L. Sullivan, Wildland surface fire spread modelling, 1990--2007. 3:\n  {Simulation} and mathematical analogue models, Int. J. Wildland Fire 18\n  (2009) 387--403.\n\n\\bibitem{clark_etal-jam-1996}\nT.~L. Clark, M.~A. Jenkins, J.~Coen, D.~Packham, A coupled atmospheric-fire\n  model: convective feedback on fire-line dynamics, J. Appl. Meteor. 35 (1996)\n  875--901.\n\n\\bibitem{potter-ijwf-2002}\nB.~E. Potter, A dynamics based view of atmosphere-fire interactions, Int. J.\n  Wildland Fire 11 (2002) 247--255.\n\n\\bibitem{potter-ijwf-2012a}\nB.~E. Potter, Atmospheric interactions with wildland fire behaviour {- I.\n  Basic} surface interactions, vertical profiles and synoptic structures, Int.\n  J. Wildland Fire 21 (2012) 779--801.\n\n\\bibitem{potter-ijwf-2012b}\nB.~E. Potter, Atmospheric interactions with wildland fire behaviour {- II.\n  Plume} and vortex dynamics, Int. J. Wildland Fire 21 (2012) 802--817.\n\n\\bibitem{clements_etal-jgr-2008}\nC.~B. Clements, S.~Zhong, X.~Bian, W.~E. Heilman, D.~W. Byun, First\n  observations of turbulence generated by grass fires, J. Geophys. Res. 113\n  (2008) D22102.\n\n\\bibitem{mandel_etal-gmd-2011}\nJ.~Mandel, J.~D. Beezley, A.~K. Kochanski, Coupled atmosphere-wildland fire\n  modeling with {WRF 3.3 and SFIRE 2011}, Geosci. Model. Dev. 4 (2011)\n  591--610.\n\n\\bibitem{sardoy_etal-cf-2007}\nN.~Sardoy, J.~L. Consalvi, B.~Porterie, A.~C. Fernandez-Pello, Modeling\n  transport and combustion of firebrands from burning trees, Combust. Flame 150\n  (2007) 151--169.\n\n\\bibitem{sardoy_etal-cf-2008}\nN.~Sardoy, J.~L. Consalvi, A.~Kaiss, A.~C. Fernandez-Pello, B.~Porterie,\n  Numerical study of ground-level distribution of firebrands generated by line\n  fires, Combust. Flame 154 (2008) 478--488.\n\n\\bibitem{kortas_etal-fsj-2009}\nS.~Kortas, P.~Mindykowski, J.~L. Consalvi, H.~Mhiri, B.~Porterie, Experimental\n  validation of a numerical model for the transport of firebrands, Fire Safety\n  J. 44 (2009) 1095--1102.\n\n\\bibitem{perryman-2009}\nH.~A. Perryman, A mathematical model of spot fires and their management\n  implications, Master's thesis, Humboldt State University, Arcata, CA (2009).\n\n\\bibitem{perryman_etal-ijwf-2013}\nH.~A. Perryman, C.~J. Dugaw, J.~M. Varner, D.~L. Johnson, A cellular automata\n  model to link surface fires to firebrand lift-off and dispersal, Int. J.\n  Wildland Fire 22 (2013) 428--439.\n\n\\bibitem{favier-pla-2004}\nC.~Favier, Percolation model of fire dynamic, Phys. Lett. A 330 (2004)\n  396--401.\n\n\\bibitem{hunt-c-2007}\nH.~Hunt, A new conceptual model for forest fires based on percolation theory,\n  Complexity 13 (2007) 12--17.\n\n\\bibitem{boychuk_etal-ees-2009}\nD.~Boychuk, W.~J. Braun, R.~J. Kulperger, Z.~L. Krougly, D.~A. Stanford, A\n  stochastic forest fire growth model, Environ. Ecol. Stat. 16 (2009) 133--151.\n\n\\bibitem{ntaimo_etal-sim-2004}\nL.~Ntaimo, B.~P. Zeigler, M.~J. Vasconcelos, B.~Khargharia, Forest fire spread\n  and supression in {DEVS}, Simulation 80 (2004) 479--500.\n\n\\bibitem{pagnini_etal-crs4-2012}\nG.~Pagnini, L.~Massidda, Modelling turbulence effects in wildland fire\n  propagation by the randomized level-set method, Tech. Rep. 2012/PM12a, CRS4,\n  Pula (CA), Sardinia, Italy, revised version: August 2014, available at:\n  http://publications.crs4.it/pubdocs/2012/PM12a/pagnini\\_massidda-levelset.pdf\n  and arXiv:1408.6129 (July 2012).\n\n\\bibitem{pagnini_etal-mfbr-2012}\nG.~Pagnini, L.~Massidda, The randomized level-set method to model turbulence\n  effects in wildland fire propagation, in: D.~Spano, V.~Bacciu, M.~Salis,\n  C.~Sirca (Eds.), Modelling Fire Behaviour and Risk. Proceedings of the\n  International Conference on Fire Behaviour and Risk. ICFBR 2011, Alghero,\n  Italy, October 4--6 2011, 2012, pp. 126--131, {ISBN} 978-88-904409-7-7.\n\n\\bibitem{pagnini-cedyacma-2013}\nG.~Pagnini, A model of wildland fire propagation including random effects by\n  turbulence and fire spotting, in: Proceedings of XXIII Congreso de Ecuaciones\n  Diferenciales y Aplicaciones XIII Congreso de Matem\\'atica Aplicada.\n  Castell\\'o, Spain, 9--13 September 2013, 2013, pp. 395--403.\n\n\\bibitem{pagnini-semasimai-2014}\nG.~Pagnini, Fire spotting effects in wildland fire propagation, in: F.~Casas,\n  V.~Mart\\'inez (Eds.), Advances in Differential Equations and Applications,\n  Vol.~4 of SEMA SIMAI Springer Series, Springer International Publishing\n  Switzerland, 2014, pp. 203--214, dOI 10.1007/978-3-319-06953-1\\_20. ISBN:\n  978-3-319-06952-4 (eBook: 978-3-319-06953-1).\n\n\\bibitem{pagnini_etal-nhess-2014}\nG.~Pagnini, A.~Mentrelli, Modelling wildland fire propagation by tracking\n  random fronts, Nat. Hazards Earth Syst. Sci. 14 (2014) 2249--2263.\n\n\\bibitem{pagnini_etal-ecmi-2014}\nG.~Pagnini, A.~Mentrelli, The randomized level set method and an associated\n  reaction-diffusion equation to model wildland fire propagation, in:\n  Proceedings of The 18th European Conference on Mathematics for Industry, ECMI\n  2014, Taormina, Italy, June 9--13, 2014, ECMI book subseries of Mathematics\n  in Industry, Springer Heidelberg, accepted.\n\n\\bibitem{sethian_etal-arfm-2003}\nJ.~A. Sethian, P.~Smereka, Level set methods for fluid interfaces, Ann. Rev.\n  Fluid Mech. 35 (2003) 341--372.\n\n\\bibitem{mallet_etal-cma-2009}\nV.~Mallet, D.~E. Keyes, F.~E. Fendell, Modeling wildland fire propagation with\n  level set methods, Comput. Math. Appl. 57 (2009) 1089--1101.\n\n\\bibitem{karimabadi_etal-jcp-2005}\nH.~Karimabadi, J.~Driscoll, Y.~A. Omelchenko, N.~Omidi, A new asynchronous\n  methodology for modeling of physical systems: breaking the curse of {Courant}\n  condition, J. Comp. Phys. 205 (2005) 755--775.\n\n\\bibitem{omelchenko_etal-jcp-2012}\nY.~A. Omelchenko, H.~Karimabadi, {HYPERS: A unidimensional asynchronous\n  framework for multiscale hybrid simulations}, J. Comp. Phys. 231 (2012)\n  1766--1780.\n\n\\bibitem{filippi_etal-s-2009}\nJ.~B. Filippi, F.~Morandini, J.~H. Balbi, D.~Hill, Discrete event front\n  tracking simulator of a physical fire spread model, Simulation 86 (2009)\n  629--646.\n\n\\bibitem{filippi_etal-nhess-2014}\nJ.~B. Filippi, V.~Mallet, B.~Nader, Evaluation of forest fire models on a large\n  observation database, Nat. Hazards Earth Syst. Sci. 14 (2014) 3077--3091.\n\n\\bibitem{anderson_etal-jams-1982}\nD.~Anderson, E.~Catchpole, N.~de~Mestre, T.~Parkes, Modelling the spread of\n  grass fires., J. Aus. Math. Soc. 23 (1982) 451--466.\n\n\\bibitem{richards-ijnme-1990}\nG.~D. Richards, An elliptical growth model of forest fire fronts and its\n  numerical solution, Int. J. Numer. Meth. Eng. 30 (1990) 1163--1179.\n\n\\bibitem{richards-cst-1993}\nG.~D. Richards, The properties of elliptical wildfire growth for time dependent\n  fuel and meteorological conditions, Combust. Sci. Technol. 95 (1993)\n  357--383.\n\n\\bibitem{richards-ijwf-1995}\nG.~D. Richards, A general mathematical framework for modelling two-dimensional\n  wildland fire spread, Int. J. Wildland Fire 5 (1995) 63--72.\n\n\\bibitem{glasa_etal-mcs-2008}\nJ.~Glasa, L.~Halada, On elliptical model for forest fire spread modeling and\n  simulation, Math. Comput. Simulat. 78 (2008) 76--88.\n\n\\bibitem{rios_etal-nhess-2014}\nO.~Rios, W.~Jahn, G.~Rein, Forecasting wind-driven wildfires using an inverse\n  modelling approach, Nat. Hazards Earth Syst. Sci. 14 (2014) 1491--1503.\n\n\\bibitem{kaur_etal-praga-2015}\nI.~Kaur, A.~Mentrelli, F.~Bosseur, J.~B. Filippi, G.~Pagnini, Wildland fire\n  propagation modelling: A novel approach reconciling models based on moving\n  interface methods and on reaction-diffusion equations, in: J.~Brandts,\n  S.~Korotov, M.~K{\\v r}{\\'\\i}{\\v z}ek, K.~Segeth, J.~{\\v S}{\\'\\i}stek,\n  T.~Vejchodsk{\\'y} (Eds.), Proceedings of the International Conference on\n  Applications of Mathematics 2015; Prague, Czech Republic, 18--21 November\n  (2015), Institute of Mathematics -- Academy of Sciences, Czech Academy of\n  Sciences, Prague, Czech Republic, 2015, pp. 85--99.\n\n\\bibitem{filippi_etal-affr-2014}\nJ.~B. Filippi, F.~Bosseur, D.~Grandi,\n  \\href{https://digitalis.uc.pt/handle/10316.2/34013}{Fore{F}ire: open-source\n  code for wildland fire spread models}, in: D.~X. Viegas (Ed.), Advances in\n  forest fire research, Imprensa da Universidade de Coimbra, 2014, pp.\n  275--282.\\\\\n\\url{https://digitalis.uc.pt/handle/10316.2/34013}\n\n\\bibitem{balbi_etal-cf-2009}\nJ.~H. Balbi, F.~Morandini, X.~Silvani, J.~B. Filippi, F.~Rinieri, A physical\n  model for wildland fires, Combust. Flame 156 (2009) 2217--2230.\n\n\\bibitem{zeigler-ths-2000}\nB.~P. Zeigler, T.~G. Kim, H.~Praehofer, Theory of Modeling and Simulation, 2nd\n  Edition, Academic Press, Inc., Orlando, FL, USA, 2000.\n\n\\bibitem{rothermel-1972}\nR.~C. Rothermel, A mathematical model for predicting fire spread in wildland\n  fires, Research Paper INT-115, USDA Forest Service, Intermountain Forest and\n  Range Experiment Station, Ogden, Utah 84401, available at:\n  http://www.treesearch.fs.fed.us/pubs/32533 (1972).\n\n\\bibitem{finney-cjfr-2002}\nM.~Finney, Fire growth using minimum travel time methods, Can. J. For. Res. 32\n  (2002) 420--1424.\n\n\\bibitem{finney-ijwf-2003}\nM.~Finney, Calculation of fire spread rates across random landscapes, Int. J.\n  Wildland Fire 12 (2003) 167--174.\n\n\\bibitem{zeigler-s-1987}\nB.~P. Zeigler, Hierarchical, modular discrete-event modelling in an\n  object-oriented environment, Simulation 49 (1987) 219--230.\n\n\\bibitem{osher_fedkiw-2003}\nS.~Osher, R.~Fedkiw, Level Set Methods and Dynamic Implicit Surfaces,\n  Springer--Verlag, New York, Berlin, Heidelberg, 2003.\n\n\\bibitem{rehm_etal-nist-2009}\nR.~G. Rehm, R.~J. McDermott, Fire-front propagation using the level set method,\n  Tech. Note 1611, Natl. Inst. Stand. Technol. (April 2009).\n\n\\bibitem{SciPy}\nE.~Jones, T.~Oliphant, P.~Peterson, et~al.,\n  \\href{http://www.scipy.org/}{{SciPy}: {Open} source scientific tools for\n  {Python}} (2001--).\\\\\n\\url{http://www.scipy.org/}\n\n\\bibitem{Matplotlib}\nJ.~D. Hunter, Matplotlib: A {2D} graphics environment, Comput. Sci. Eng. 9~(3)\n  (2007) 90--95.\n\n\\bibitem{IPython}\nF.~P\\'erez, B.~E. Granger, \\href{http://ipython.org}{{IP}ython: a system for\n  interactive scientific computing}, Comput. Sci. Eng. 9~(3) (2007) 21--29.\\\\\n\\url{http://ipython.org}\n\n\\bibitem{mentrelli_etal-caim-2015}\nA.~Mentrelli, G.~Pagnini, Random front propagation in fractional diffusive\n  systems, Commun. Appl. Ind. Math. 6~(2) (2015) e--504.\n\n\\bibitem{mentrelli_etal-jcp-2015}\nA.~Mentrelli, G.~Pagnini, Front propagation in anomalous diffusive media\n  governed by time-fractional diffusion, J. Comp. Phys. 293 (2015) 427--441.\n\n\\bibitem{pagnini_etal-prl-2011}\nG.~Pagnini, E.~Bonomi, Lagrangian formulation of turbulent premixed combustion,\n  Phys. Rev. Lett. 107 (2011) 044503.\n\n\\bibitem{albini-usafs-1983}\nF.~A. Albini, Potential spotting distance from wind-driven surface fires,\n  Research Paper INT-309, U.S. Department of Agriculture Forest Service\n  Intermountain Forest and Range Experiment Station (1983).\n\n\\bibitem{morris-usafs-1987}\nG.~A. Morris, A simple method for computing spotting distances from wind-driven\n  surface fires, Research Note INT-374, U.S. Department of Agriculture Forest\n  Service Intermountain Forest and Range Experiment Station (1987).\n\n\\bibitem{catchpole-2002}\nW.~Catchpole, Fire properties and burn patterns in heterogeneous landscapes,\n  in: R.~A. Bradstock, J.~E. Williams, M.~A. Gill (Eds.), Flammable Australia:\n  The Fire Regimes and Biodiversity of a Continent, Cambridge University Press,\n  2002, Ch.~3, pp. 49--75.\n\n\\bibitem{houssami_etal-ft-2015}\nM.~E. Houssami, E.~Mueller, J.~C. Thomas, A.~Simeoni, A.~Filkov, N.~Skowronski,\n  M.~R. Gallagher, K.~Clark, R.~Kremens, Experimental procedures characterising\n  firebrand generation in wildfires, Fire Technol.(Available online).\n\\newblock \\href {http://dx.doi.org/10.1007/s10694-015-0492-z.}\n  {\\path{doi:10.1007/s10694-015-0492-z.}}\n\n\\bibitem{hage-jam-1961}\nK.~D. Hage, On the dispersion of large particles from a 15-m source in the\n  atmosphere, J. Appl. Meteor. 18 (1961) 534--539.\n\n\\bibitem{manzello_etal-fsj-2008}\nS.~L. Manzello, J.~R. Shields, T.~G. Cleary, A.~Maranghides, W.~E. Mell, J.~C.\n  Yang, Y.~Hayashi, D.~Nii, T.~Kurita, On the development and characterization\n  of a firebrand generator, Fire Safety J. 43 (2008) 258--268.\n\n\\bibitem{wang-ft-2011}\nH.~H. Wang, Analysis on downwind distribution of firebrands sourced from a\n  wildland fire, Fire Technol. 47 (2011) 321--340.\n\n\\bibitem{hormann_etal-cgta-2001}\nK.~Hormann, A.~Agathos, The point in polygon problem for arbitrary polygons,\n  Comp. Geom.-Theo. Appl. 20 (2001) 131--144.\n\n\\bibitem{wilson-1962}\nR.~Wilson, \\href{https://books.google.es/books?id=bWFCywAACAAJ}{The Devil Wind\n  and Wood Shingles: {T}he {L}os {A}ngeles Conflagration of 1961}, National\n  Fire Protection Assn., 1962. \\\\\n\\url{https://books.google.es/books?id=bWFCywAACAAJ}\n\n\\bibitem{permin-twmh-1971}\nP.~Pernin, \\href{http://www.jstor.org/stable/4634648}{The great {P}eshtigo\n  fire: {A}n eyewitness account}, The Wisconsin Magazine of History 54 (1971)\n  246--272.\\\\\n\\url{http://www.jstor.org/stable/4634648}\n\n\\bibitem{pagni-fsj-1993}\nP.~J. Pagni, Causes of the {20 October 1991 Oakland Hills} conflagration, Fire\n  Safety J. 21 (1993) 331--339.\n\n\\bibitem{trelles_etal-1997}\nJ.~Trelles, P.~J. Pagni, Fire-induced winds in the 20 {O}ctober 1991 {O}akland\n  {H}ills fire, in: Y.~Hasemi (Ed.), Proc. of Fifth International Symposium on\n  Fire Safety Science, Melbourne, Australia, International Association of Fire\n  Safety Science: Boston, MA, 1997, pp. 911--922.\n\n\\bibitem{quintiere-1998}\nJ.~G. Quintiere, Principles of Fire Behavior, Career Education Series, Delmar\n  Publishers, Albany, N.Y., 1998.\n\n\\bibitem{koo_etal-ijwf-2010}\nE.~Koo, P.~J. Pagni, D.~R. Weise, J.~P. Woycheese, Firebrands and spotting\n  ignition in large-scale fires, Int. J. Wildland Fire 19 (2010) 818--843.\n\n\\end{thebibliography}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.43]{LSM_nowind1.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1.5cm 8cm 4cm 8cm, clip=true, scale = 0.52]{FF_nowind.pdf}\n    \n    \\end{subfigure}\n      \\caption{Evolution in time of the fire-line contour without random processes in absence of wind for the a) LSM and b) DEVS based simulators.\nThe initial fire-line is a circle of radius $300\\,\\rm m$.}\n      \\label{fig:FF_LSM_no_wind}\n\\end{figure}\n\n\n\\begin{figure}[p]\n\t\\centering\n    \\includegraphics[trim = 4cm 8cm 4cm 8cm, clip=true, scale = 0.5]{phieff_no_wind_circle_160min.pdf}\n    \\caption{Cross section of the indicator function $\\phi({\\bm{x}},t)$ for the front evolution shown in Fig.~\\ref{fig:FF_LSM_no_wind}\nat $t = 160\\,\\rm min$ and $y =2500\\,\\rm m$.}\n    \\label{fig:phi_circle}\n\\end{figure}\n\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_nowind_firebreak.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_nowind_firebreak.pdf}\n    \n    \\end{subfigure}\n         \\caption{Same as Fig.~\\ref{fig:FF_LSM_no_wind}, but in the presence of a fire break zone.}\n   \\label{fig:FF_LSM_no_wind_firebreak}\n\\end{figure}\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.37]{LSM_nowind_inhomo.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1.5cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_nowind_inhomo.pdf}\n    \n    \\end{subfigure}\n     \\caption{Evolution in time of the fire-line contour without random processes in absence of wind with a non-homogeneous ROS for a) LSM and b) DEVS based simulators.\nThe initial fire-line is a circle of radius $30\\,\\rm m$.}\n   \\label{fig:FF_LSM_nowind_inhomo}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.38]{LSM_with_wind_circle.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1.5cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_circle.pdf}\n    \n    \\end{subfigure}\n            \\caption{Evolution in time of the fire-line contour without random processes with a north wind of $3\\, \\rm m s^{-1}$ for a) LSM and b) DEVS\nbased simulators. The initial fire-line is a circle of radius $300\\, \\rm m$.}\n   \\label{fig:FF_LSM_wind_circle}\n\\end{figure}\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.38]{LSM_with_wind_square.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1.5cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_square.pdf}\n    \n    \\end{subfigure}\n     \\caption{Same as Fig.~\\ref{fig:FF_LSM_wind_circle}, but when the initial fire-line is a square of side $600\\, \\rm m$.}\n   \\label{fig:FF_LSM_wind_square}\n\\end{figure}\n\n   \\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{phieff_wind_square_160min_xdir.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{phieff_wind_square_160min_ydir.pdf}\n    \n    \\end{subfigure}\n         \\caption{Cross section of the indicator function $\\phi({\\bm{x}},t)$ \nfor the front evolution shown in Fig.~\\ref{fig:FF_LSM_wind_square} at $t = 180 \\,\\rm min$ for (a) $y=2500 \\,\\rm m$ and (b) $x=3500 \\,\\rm m$.}\n   \\label{fig:phi_square}\n\\end{figure}\n\n\n\n \\begin{figure}[th]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ width = 4.5cm, height =4cm]{LSM_Mallet_ROS_with_normal.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 2cm 8cm 4cm 8cm, clip=true, width = 5.5cm, height =4cm]{FF_Mallet_ROS_with_normal.pdf}\n    \n    \\end{subfigure}\n      \\caption{Evolution in time of the fire-line contour without random processes with ROS given by formula (\\ref{Mallet}) \nand when $\\theta$ is the angle between the outward normal in a contour point and the mean wind direction for a) LSM and b) DEVS based simulators. \nThe mean wind velocity is $3 \\, \\rm ms^{-1}$ in the positive $x$-direction.}\n      \\label{fig:FF_LSM_Mallet_with_normal}\n\\end{figure}\n\n\n\\begin{figure}[th]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[width = 4.5cm, height =4cm]{LSM_Mallet_ROS_no_normal.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 2cm 8cm 4cm 8cm, clip=true, width = 5.5cm, height =4cm]{FF_Mallet_ROS_no_normal.pdf}\n    \n    \\end{subfigure}\n      \\caption{Same as Fig. \\ref{fig:FF_LSM_Mallet_with_normal}, but when $\\theta$ is the angle between the line joining a contour point and the mean wind direction.}\n      \\label{fig:FF_LSM_Mallet_no_normal}\n\\end{figure}\n\n\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_nowind_turb_100.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_nowind_turb_100.pdf}\n    \n    \\end{subfigure}\n         \\caption{Evolution in time of the fire-line contour with turbulence in absence of wind for a) LSM and b) DEVS based simulators. \nThe initial fire-line is a circle of radius $300\\,\\rm m$. The turbulent diffusion coefficient is $D=0.15 \\,\\rm m^{2} s^{-1}$.}\n   \\label{fig:FF_LSM_no_wind_turb_100}\n\\end{figure}\n\n\n\\begin{figure}[p]\n\t\\centering\n    \\includegraphics[trim = 4cm 8cm 4cm 8cm, clip=true, scale = 0.5]{phieff_no_wind_140min_turb_100.pdf}\n    \\caption{Cross section of the indicator function $\\phi({\\bm{x}},t)$ and $\\phi_{e}({\\bm{x}},t)$ at $y =2500\\,\\rm  m$ and $t = 140\\,\\rm min$, \ncorresponding to the front evolution showed in Fig.~\\ref{fig:FF_LSM_no_wind_turb_100}.}\n    \\label{fig:phi_phieff_turb_100}\n\\end{figure}    \n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_nowind_turb_200.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_nowind_turb_200.pdf}\n    \n    \\end{subfigure}\n     \\caption{Same as Fig.~\\ref{fig:FF_LSM_no_wind_turb_100}, but with turbulent diffusion coefficient $D=0.30 \\,\\rm m^{2} s^{-1}$.}\n     \\label{fig:FF_LSM_no_wind_turb_200}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_with_wind_turb_100.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_turb_100.pdf}\n    \n    \\end{subfigure}\n     \\caption{Evolution in time of the fire-line contour with turbulence and a north wind of $3\\,\\rm m s^{-1}$ for a) LSM and b) DEVS based simulators. \nThe turbulent diffusion coefficient is $D=0.15\\,\\rm m^{2} s^{-1}$.}\n     \\label{fig:FF_LSM_with_wind_turb_100}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_with_wind_firespot_100.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_firespot_100.pdf}\n    \n    \\end{subfigure}\n     \\caption{Same as Fig.~\\ref{fig:FF_LSM_no_wind_turb_100}, but when both turbulence and fire-spotting are included\nwith $D=0.15\\,\\rm m^{2} s^{-1}$, $\\mu=2.69$ and $\\sigma=1.25$.}\n     \\label{fig:FF_LSM_with_wind_firespot_100}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_with_wind_turb_two_break.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_turb_two_break.pdf}\n    \n    \\end{subfigure}\n     \\caption{Evolution in time of the fire-line contour with turbulence, a north wind of $3 \\,\\rm m s^{-1}$ and two fire-break zones \nfor a) LSM and b) DEVS based simulators. The initial fire-line is a circle of radius $300\\,\\rm m$. The turbulent diffusion coefficient is $D=0.075\\,\\rm m^{2} s^{-1}$.}\n     \\label{fig:FF_LSM_with_wind_turb_two_break}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{LSM_with_wind_firespot_two_break.pdf}\n    \n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[trim = 1cm 8cm 4cm 8cm, clip=true, scale = 0.4]{FF_with_wind_firespot_two_break.pdf}\n    \n    \\end{subfigure}\n     \\caption{Same as Fig.~\\ref{fig:FF_LSM_with_wind_turb_two_break}, but \nwhen both turbulence and fire-spotting are included with $D=0.075\\,\\rm m^{2} s^{-1}$, $\\mu=2.69$ and $\\sigma=1.25$.}\n     \\label{fig:FF_LSM_with_wind_firespot_two_break}\n\\end{figure}\n\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_13_5.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_14_5.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{LSM_15_5.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_16_5.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{LSM_17_5.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{LSM_18_5.pdf}\n    \\caption{}\n    \\end{subfigure}\n     \\caption{Series of figures showing the variation in the fire propagation due to increasing value of $\\mu$. From a-f, $\\mu$ varies from $13$ to $18$, \nin increments of $1$, while $\\sigma = 5$.}\n     \\label{fig:Firebrand_increasing_mu}\n\\end{figure}\n\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_15_4.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_15_4-5.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{LSM_15_5.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{LSM_15_5-5.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[width = 5.3cm,height = 5cm]{LSM_15_6.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[width = 5.3cm,height = 5cm]{LSM_15_6-5.pdf}\n    \\caption{}\n    \\end{subfigure}\n     \\caption{Series of figures showing the variation in the fire propagation due to increasing value of $\\sigma$. \nFrom a-f, $\\sigma$ varies from $4$ to $6.5$, in increments of $0.5$, while $\\mu = 15$.}\n     \\label{fig:Firebrand_increasing_sigma}\n\\end{figure}\n\n\n\\clearpage\n\\begin{figure}[p]\n   \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{fig_1.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{fig_2.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{fig_3.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[ scale = 0.40]{fig_4.pdf}\n    \\caption{}\n    \\end{subfigure}\\\\\n       \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{fig_5.pdf}\n    \\caption{}\n       \\end{subfigure}\n    \\begin{subfigure}{0.5\\textwidth}\n\t\\centering\n    \\includegraphics[scale = 0.40]{fig_6.pdf}\n    \\caption{}\n    \\end{subfigure}\n     \\caption{Series of figures showing the generation of secondary fires due to fire-spotting and their subsequent merging with the primary fire  \nwhen $\\mu = 15$ and $\\sigma = 5$.}\n     \\label{fig:Firebrand_secondary_fires}\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 60382, "prevtext": "\nwhere $U^2={\\bm{U}} \\cdot {\\bm{U}}$, $\\varepsilon_{o}$ is the flank velocity,  \n($\\varepsilon_{o}\\alpha$) is the rear velocity with $\\alpha\\in[0,1]$, \nand $\\theta$ is defined as the angle between the normal to the front and the wind direction. \nIn the present set-up, the parameters are defined as \n$\\alpha = 0.8$, $n = 3$, $a=0.5 \\, \\rm m^{1/2}s^{-1/2}$, $\\varepsilon_{o}=0.2 \\, \\rm ms^{-1}$, and $U = 3\\, \\rm ms^{-1}$ \\cite{mallet_etal-cma-2009}. \n\n\\smallskip\nIn the case of the LSM based simulator, \nthe domain is discretised with a Cartesian grid of $20\\, \\rm m$ both in $x$ and $y$ directions, \nwhile for DEVS the resolution of the simulation is established in the terms of quantum distance $\\Delta q$ and perimeter resolution $\\Delta c$ \\cite{filippi_etal-s-2009}. Quantum distance $\\Delta q$ is defined as the maximum allowable distance to be covered by a particle at each advance, \nwhile a measure of $\\Delta c$ is used to decompose/regenerate/coalesce two particles on propagation. \nThe choice of $\\Delta q$ and $\\Delta c$ is {\\it dependent on the type of problem}, and in the present study, two sets of values are utilized. \nThe simulations are performed with $\\Delta q = 4\\, \\rm m $, $\\Delta c = 18\\, \\rm m $ for zero wind conditions, and $\\Delta q = 0.3\\,\\rm m $, $\\Delta c = 8\\,\\rm m$ in the presence of wind. \nTo avoid instability in the presence of wind, $\\Delta q$ is chosen to be of a much higher resolution than the wind data ($20 \\,\\rm m$ in this set-up). \nIn DEVS based simulator, the locus of the points constituting the initial front are wind up in the clockwise direction to represent an expanding front (anticlockwise order represents a contracting front). \n\n\\smallskip\nThe mean wind, wherever used, is assumed to be constant in magnitude and direction. \nThe turbulent diffusion coefficient $D$, and ignition delays corresponding to hot air and firebrands heating are also assumed to be constant throughout the simulations. \nIn particular, the ignition delay corresponding to the hot air $\\tau_h$ and to the firebrand $\\tau_f$ are assumed to be \n$10 \\, \\rm min$ and $1\\,\\rm min$ respectively.\nMoreover, with reference to the lognormal distribution (\\ref{lognormal}), \nthe unit reference length $\\ell_0$ is fixed equal to $0.30\\,\\rm m$.\n\n\\smallskip\nMultiple idealised simulation tests are performed both in the presence and the absence of wind by neglecting and considering the effects of the random phenomena.\nThe {\\it first} case evaluates an isotropic growth of the fire-line in the absence of wind by neglecting all the random processes. \nIn the {\\it second} test, the spread of fire-line for different ROS in different directions is studied. \nThe {\\it third} test discusses the propagation of the fire-line with wind when the ROS is defined according to the $3\\%$ of the mean wind,\nformula (\\ref{three_percent}), and when it is defined according to formula (\\ref{Mallet}). \nThe random processes are neglected for the first three test cases. The pure LSM and pure DEVS based wildfire models fail while managing the realistic cases of fire propagation across the fire-break zones, \nhence the {\\it fourth} test evaluates the performance of DEVS when turbulent processes are also considered in the model. The effect of turbulent processes is studied both in the presence and the absence of the wind. \n\nThe {\\it fifth} test evaluates the performance of the two simulators when fire-spotting is also included along with turbulence. \nFire-break zones are also introduced in the last two tests (the fourth and the fifth) to observe the propagation of the fire-line while encountering areas of null fuel. \nTo simplify the simulation and maintain equivalence between the two simulators, the region across and behind the centre of the initial fire-line is demarcated as the leeward side and the windward side respectively. \n\n\\smallskip\nAs an extension of the study, a brief analysis of the firebrand landing distribution is also made. \nWith reference to the lognormal distribution (\\ref{lognormal}) for firebrand landing,\ndifferent values of $\\mu$ and $\\sigma$ are chosen motivated by a possible correlation with some physical aspects of wildfire like changing fire intensity and meteorological conditions.  \nFor these simulations, only the LSM based simulator is used and the wind speed is assumed to be $3\\,\\rm ms^{-1}$, while the ROS is given by the Rothermel model\n\\cite{rothermel-1972,mandel_etal-gmd-2011}. \n\n\\smallskip\nAll the simulations have been performed at BCAM--Basque Center for Applied Mathematics (\\url {www.bcamath.org}) in Bilbao, Basque Country -- Spain.\n\n\\section{Discussion}       \n\\label{discussion}\nIn the first three test scenarios, the evolution of the fire-line without the impact of random processes in both LSM and DEVS approaches is analysed. Fig.~\\ref{fig:FF_LSM_no_wind} presents the propagation of the fire-line in no wind conditions for both the simulators. \nThe advancement of the initial circular fire-line follows an isotropic growth and with identical initial conditions the two different moving interface schemes provide a similar evolution of the fire-line. \nA cross section of the indicator function $\\phi({\\bm{x}},t)$, at $y=2500$ and $t =140\\,\\rm min$ is analysed for a quantitative comparison of the fronts \nfrom the two simulators (Fig.~\\ref{fig:phi_circle}). \nThe $\\phi({\\bm{x}},t)$ function from the two models shows a perfect overlap. \n\n\n\n\nModelling real situations of fire involves presence of zones without fuel where the ROS is zero. In case of fire-break zones, pure LSM and DEVS based simulators are inherently unable to simulate the realistic situations of fire overcoming the fire break zones. \nFig.~\\ref{fig:FF_LSM_no_wind_firebreak} shows that in no wind conditions, the fire-line fails to propagate across the fire-break when no random processes are included. The evolution is shown only up to $140\\,\\rm min$, but an extended run up to $250\\,\\rm min$ (not shown) indicates the limitation of the two approaches to reproduce the fire jump across the no fuel zone. \n\n\\smallskip \nFig.~\\ref{fig:FF_LSM_nowind_inhomo} presents the growth of an initial spot fire but with a non-homogeneous ROS in absence of any wind. \nThe different values of the ROS can be attributed to different fuel types, but here no effort has been made to describe the fuel type. \nThe fire-line propagates with different speed in the three different directions, but the isotropy is preserved. The results from the first three test cases indicate that in the absence of wind, the two advancing schemes: LSM and DEVS, show an identical behaviour in simulating situations with constant ROS and hence, this observation provides a crucial background and scope for the comparison of situations with increasing variability and complexity.\n\n\\smallskip \nFig.~\\ref{fig:FF_LSM_wind_circle} shows the  evolution of the fire-front of a circular initial profile with radius $300 \\, \\rm m$\nin case of a weak wind of $3 \\, \\rm m s^{-1}$ \ndirected in the east direction. The isochronous fronts are plotted at every $20\\,\\rm min$ and follow an oval shape for both the simulators. \nDEVS fire contours diverge slightly from the mean wind direction \nand develop into an increasing flanking fire over time. This divergence in the evolution of fire-front occurs due to differences in the computation of \nthe normal between the two approaches. This fact can be very well appreciated when an initial square profile is considered.  Fig.~\\ref{fig:FF_LSM_wind_square} shows the progress of the fire when the initial fire perimeter is considered to be a square with side $600 \\,\\rm m$. \nUnder the effect of a constant zonal wind and restricted $3\\%$ ROS model (\\ref{three_percent}), the evolution in LSM strictly follows the initial square shape, \nbut in DEVS the active burning markers at the corners advance spuriously to provide an additional flanking spread. \nA cross section of the indicator function $\\phi({\\bm{x}},t)$ at $y=2500 \\, \\rm m$ shows that though the head fire in both the simulators arrives to the same distance in $160 \\, \\rm  min$, but considerable differences are observed in the lateral cross section at $x=3500 \\, \\rm m$ (Fig.~\\ref{fig:phi_square}). \nThe flank fires generated by the approximate construction of the normal seem to be in a more qualitative agreement with a realistic case, but \nwithin the stated analytical formulation of the ROS (\\ref{three_percent}), the lateral progress of the flank fires is an anomalous behaviour. \n\n\\smallskip\nThe ROS formulation developed by Mallet {\\it et al.} \\cite{mallet_etal-cma-2009},\nhere formula (\\ref{Mallet}), provides a simple way to study the evolution of flank fire by introducing different ROS for \nthe head, flank and rear directions. In the original paper, $\\theta$ is defined as the angle between the normal to the front and the wind direction. \nSince, the normal computation in DEVS approach is approximate, two separate tests are performed to evaluate the effect of such\napproximation on the spread: \n{\\it firstly} when $\\theta$ is computed according to the original definition \\cite{mallet_etal-cma-2009}, \nand {\\it secondly} when $\\theta$ is assumed to be the angle between \nthe line joining the front and the wind direction to enforce an identical definition of $\\theta$ in both the methods. \nFig.~\\ref{fig:FF_LSM_Mallet_with_normal} shows the evolution of fire when $\\theta$ is computed according to the original definition;\nthe advancement of the head and rear fires are identical, but the flank fire spread is spuriously larger in DEVS because of the approximate computation of the front normal direction. \nOn the other hand, it is evident from Fig.~\\ref{fig:FF_LSM_Mallet_no_normal} that in the second case, \nwhen the computation of $\\theta$ is not affected by the approximate computation of the front normal in DEVS, the fire-line advancement is identical to LSM in all directions.\n\n\\smallskip \nAs shown in Fig.~\\ref{fig:FF_LSM_no_wind_firebreak}, in case of fire-break zones, pure LSM and DEVS based simulators are inherently \nunable to simulate the realistic situations of fire overcoming a fire break. \nBut Fig.~\\ref{fig:FF_LSM_no_wind_turb_100} shows that with the introduction of turbulence, the simulators can model the effect of hot air \nto overcome fire-break zones. Here the value of turbulent diffusion coefficient $D$ is assumed to be $0.15\\,\\rm m^{2}s^{-1}$. \nThe evolution of the fire-line is almost similar for both the simulators, though a slight underestimation can be visibly observed in the DEVS approach.  \n\n\n\n\nA cross section of $\\phi({\\bm{x}},t)$ and $\\phi_e({\\bm{x}},t)$ at $y=2500\\,\\rm m$ (Fig.~\\ref{fig:phi_phieff_turb_100}) \nprovides a more detailed illustration of the differences in the evolution of the fire-line between the two approaches. The introduction of marginal differences with the inclusion of turbulence can be explained by the contrast in the construction of the indicator function between the two simulators. In LSM, the indicator function is inherently defined over a Cartesian grid, while on the other hand, in DEVS, a gridded indicator function is derived from the original real coordinates. The point in polygon technique is used to transform the real coordinates to a Cartesian grid. This technique provides only an approximate measure of the same; small errors can be introduced by the improper classification of the points lying very close to the boundary \\cite{hormann_etal-cgta-2001}, \nand can lead to a slight underestimation/overestimation of the original fire-line.\n\n\\smallskip\nFig.~\\ref{fig:FF_LSM_no_wind_turb_200} shows the results for the two simulators when the turbulent diffusion coefficient is $D=0.30\\,\\rm m^{2} s^{-1}$. \nStronger turbulence causes a rapid propagation of the fire-line and an earlier ignition across the fire-break zone. \nA detailed analysis of the effect of varying turbulence over {\\it long-term propagation} with the LSM can be found in \n\\cite{pagnini_etal-crs4-2012,pagnini_etal-mfbr-2012}. \n\n\\smallskip\nFig.~\\ref{fig:FF_LSM_with_wind_turb_100} presents the effect of inclusion of turbulence with a non-zero wind profile  \nand $3\\%$ ROS model (\\ref{three_percent}). The effect of turbulence is most pronounced in the direction of the wind and it can be clearly observed that with turbulence, the spread over the head, flank and back fire-lines is faster and the head fire is also able to overcome the fuel break. The quantum of increase in the fire spread can also be appreciated in comparison to Fig.~\\ref{fig:FF_LSM_wind_circle}, \nwhich presents the ideal case with the same initial conditions. Both simulators show almost similar characteristics in the spread of fire, though the flank fire has a slightly larger spread in DEVS.\n\n\\smallskip\nAnother aspect contributing towards the increase in the fire spread due to new fire ignitions generated by the firebrands \nis presented in Fig.~\\ref{fig:FF_LSM_with_wind_firespot_100}. With the inclusion of fire-spotting along with turbulence, the evolution of the fire-front is faster in comparison to the effect of turbulence alone (Fig.~\\ref{fig:FF_LSM_with_wind_turb_100}). \n\n\n\nThe flank fire and the head fire are also well simulated in both the approaches, and again a larger spread out the flanking fires is observed for the DEVS one. \nThe proposed mathematical formulation of spot-fires along with turbulence is effective in mimicking the rapid advancement of the fire-line due to the generation of new ignition points by the firebrands. It is also effective in simulating the new ignition points developed across the no fuel zones. Within the current parametrisation, the firebrand landing distances lie close to the main fire and are not long enough to develop a new secondary fire, but in the next section, a sensitivity study of the spatial pattern of the firebrand landing distances is also presented. \n \n\\smallskip\nFig.~\\ref{fig:FF_LSM_with_wind_turb_two_break} shows the time evolution of the fire-front in presence of a mean wind velocity of $3 \\,\\rm m s^{-1}$ \nand two fire-break zones. The results are obtained when only the effects of turbulence are included in the formulation. \nSimilarly, Fig.~\\ref{fig:FF_LSM_with_wind_firespot_two_break} shows the time evolution of fire-front but when both turbulence and fire-spotting are included in the \nformulation. Both approaches follow an identical evolution pattern as observed in other cases. \nAs expected, the spread of the fire-front is faster and is able to overcome both the fire-break zones when turbulence is included; \nbut inclusion of fire-spotting along with turbulence causes the fire to propagate at a much faster rate and results in a larger spread. Again, the major differences which arise in the evolution of flank fires between the two methods are due to the dissimilarity in the construction of the direction of the propagation of the active burning point.\n\n\\section{Insight on firebrand distribution}\n\\label{firebrand}\nIn the simulations discussed previously, \nthe phenomenon of fire-spotting contributes towards an increase in the burning area and a faster propagation of fire,\nbut the landing distances are not sufficiently long enough to develop new secondary fires detached from the primary fire. \n\n\\smallskip\nGenerally, the firebrands generated in low intensity fires fall close to the primary fire and although they contribute \ntowards a faster fire spread, the separation from the primary fire is not large enough for the new ignitions to develop a new secondary fire. \nBut high intensity fires and extreme meteorological conditions such as strong wind/extremely high temperatures/low humidity can facilitate \nthe transport of embers over longer distances and the area under firebrand attack can be sufficiently far away from the primary fire \n\\cite{wilson-1962,permin-twmh-1971, pagni-fsj-1993, trelles_etal-1997, quintiere-1998}. \nIn Ref. \\cite{koo_etal-ijwf-2010} and references therein, a brief account of the impact of various historical forest fires is provided emphasising the importance of strong winds, and extreme meteorological conditions \non the fire-spotting phenomenon. They describe different historical fires where low intensity fires coupled with strong winds and low relative humidity caused a large scale fire-spotting, while on the other hand, fires with high intensities in calm meteorological conditions had a negligible contribution from the firebrands.\n\n\\smallskip\nIn lognormal distribution (\\ref{lognormal}), \na suitable choice of the parameters $\\mu$ and $\\sigma$ can be utilized to modify the firebrand landing distributions to represent different fire intensities and wind conditions. In this study, the main interest lies in the mathematical modelling of the firebrands landing distributions, hence constant meteorological conditions are assumed for all the simulations presented here. \nIt is also assumed that each active ignition point is capable of generating firebrands and all embers are controlled by identical transport forces.  \n\n\\smallskip\nFig.~\\ref{fig:Firebrand_increasing_mu} and Fig.~\\ref{fig:Firebrand_increasing_sigma} show the variation of the area under the firebrand attack \nwith different values of $\\mu$ and $\\sigma$. A constant $\\sigma$ and an increasing $\\mu$ points towards a decrease in the effectiveness of the firebrands, \nand slows down the fire propagation. A slight deviation from the pattern is observed for $\\mu = 15$ and $\\sigma = 5$, \nwhen the firebrands travel far enough to create a new secondary fire. \n\n\\smallskip\nFor an increasing value of $\\sigma$ (Fig.~\\ref{fig:Firebrand_increasing_sigma}a-c) with constant $\\mu$, \nthe fire evolution increases as larger number of firebrands land away from the source, but the landing distances are still not long enough to delineate the new ignitions from the main fire. With further increase in $\\sigma$, a secondary fire emerges away from the main source. \nEqual contribution to the firebrands by each flaming point leads to a regular distribution pattern of the secondary fire. As time progresses, the primary fire also advances and covers up the gap with the secondary fire. \nWith further increase in $\\sigma$, the probability of the firebrands landing at farther distances increases, and this can lead to a potentially explosive firebrands attack. Fig.~\\ref{fig:Firebrand_increasing_sigma}f shows the effect of fire-spotting at shorter scales contributing to a faster rate of spread, but the development of new secondary fires is not observed. For this particular value of $\\sigma$ the statistical distribution of the long range landing distances lies outside the domain and is impossible to resolve them in the limited time and spatial scales considered in this simulation.  \n\n\\smallskip\nAs a consequence of the idealised set-up for simulations, the new secondary fires evolve with the same intensity as the primary fire and  also serve as a source of generation of newer fire brands and henceforth the tertiary fires. Fig.~\\ref{fig:Firebrand_secondary_fires}a-f demonstrates the generation of new secondary fires by the primary fire, and tertiary fires by the secondary fires. As time progresses, the each of the fire-line evolves independently along with a small contribution from its parent fire-line, and eventually they merge among each other.\n\n\\smallskip  \nIn a lognormal distribution, an increasing value of the $\\mu$ causes a right shift of the maximum, \nindicating towards a larger jump length, but the simulations suggest a decreasing trend in the landing distance. \nThis can be explained by the fact that the ignition of the unburned fuel is not an instantaneous, but rather an accumulative process. \nThe fuel starts burning only when the temperature is high enough to allow spontaneous combustion. \nThough a larger $\\mu$ allows the firebrands to fall at larger distances but it limits the frequency of landing. \nInsufficient number of firebrands landing at farther distances diminishes the efficacy of their attack to cause combustion; hence leads to a smaller contribution from fire-spotting. \nFor an effective combustion, sufficient number of firebrands should be available for an adequate heat exchange with the unburned fuel. \nOn the contrary, an increasing $\\sigma$ causes the lognormal distribution to have a lower maximum \nand an elongated right tail of the distribution, but with a high probability of landing. \nThe increase in the number of firebrands landing at away from the maximum leads to a rapid ignition of the unburned fuel and a faster propagation of the fire. \n\n\\smallskip\nAccording to the increasing and decreasing trend of the landing distance with respect to increasing $\\sigma$ and decreasing $\\mu$ respectively, \nwithin the lognormal characterisation assumed here for the firebrand landing distribution, the reference lengthscale $\\mathcal{L}$ of the landing distance can be stated as:\n\n", "index": 35, "text": "\\begin{equation}\n\\mathcal{L} \\propto \\frac{\\sigma^{\\alpha}}{\\mu^{\\beta}} \\,,\n\\label{L}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}\\propto\\frac{\\sigma^{\\alpha}}{\\mu^{\\beta}}\\,,\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>∝</mo><mpadded width=\"+1.7pt\"><mfrac><msup><mi>σ</mi><mi>α</mi></msup><msup><mi>μ</mi><mi>β</mi></msup></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}]