[{"file": "1601.05810.tex", "nexttext": "\nThis minimum brightness temperature is achieved when $F_{B}/F_0 = 1/e$. Note that this estimate does not correct for scatter-broadening.\n\n\nWhen the scattering properties along a given line of sight can be estimated a priori, a single long-baseline measurement that is dominated by refractive noise likewise determines a lower limit on brightness temperature, even when $F_0$ is not known. This lower limit occurs when the source becomes large so that the refractive noise is quenched as $\\sigma_{\\rm ref} \\propto \\theta_{\\rm src}^{-2}$ (see \\S\\ref{sec::Substructure}). \nBecause $\\sigma_{\\rm ref} \\sim F_{B}/F_0$, this then implies that $\\theta_{\\rm src} \\propto \\sqrt{F_0}$ and so $T_{\\rm b} \\propto F_0/\\theta_{\\rm src}^2 = {\\rm constant}$. Thus, the inferred brightness temperature asymptotes to a constant value as $F_{B}/F_0$ becomes small. Taking the Kolmogorov scattering index $\\alpha=5/3$ and scaling with median values of the galactic scattering parameters at $\\lambda=18~{\\rm cm}$ \\citep[see][]{Johnson_Gwinn_2015}, we obtain\n\n", "itemtype": "equation", "pos": 13691, "prevtext": "\n\n\n\\title{ Extreme Brightness Temperatures and Refractive Substructure in 3C\\,273 with \\textit{RadioAstron} }\n\\shorttitle{Refractive Substructure in 3C\\,273}\n\n\n\\author{Michael D.~Johnson\\altaffilmark{1}, Yuri~Y.~Kovalev\\altaffilmark{2,3}, Carl R.~Gwinn\\altaffilmark{4}, Leonid I.~Gurvits\\altaffilmark{5,6}, Ramesh Narayan\\altaffilmark{1}, Jean-Pierre Macquart\\altaffilmark{7,8}, David L.~Jauncey\\altaffilmark{9,10}, Peter~A.~Voitsik\\altaffilmark{2}, James M.~Anderson\\altaffilmark{3,12}, Kirill V.~Sokolovsky\\altaffilmark{2,11}, and Mikhail M.~Lisakov\\altaffilmark{2}}\n\\shortauthors{Johnson et al.}\n\\altaffiltext{1}{Harvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA}\n\\altaffiltext{2}{Astro Space Center of Lebedev Physical Institute, Profsoyuznaya 84/32, 117997 Moscow, Russia}\n\\altaffiltext{3}{Max-Planck-Institute for Radio Astronomy, Auf dem H\\\"{u}gel 69, D-53121, Germany}\n\\altaffiltext{4}{Department of Physics, University of California, Santa Barbara, CA 93106, USA}\n\\altaffiltext{5}{Joint Institute for VLBI ERIC, P.O.\\ Box 2, 7990 AA Dwingeloo, The Netherlands}\n\\altaffiltext{6}{Department of Astrodynamics \\& Space Missions, Delft University of Technology, 2629 HS Delft, Delft, The Netherlands}\n\\altaffiltext{7}{ICRAR/Curtin University, Curtin Institute of Radio Astronomy, Perth, WA 6845, Australia}\n\\altaffiltext{8}{ARC Centre of Excellence for All-Sky Astrophysics (CAASTRO), Australia}\n\\altaffiltext{9}{CSIRO Astronomy and Space Sciences, Epping, NSW 1710, Australia, Australia}\n\\altaffiltext{10}{Research School of Astronomy and Astrophysics, Australian National University, Canberra, ACT, 2611, Australia}\n\\altaffiltext{11}{Sternberg Astronomical Institute, Moscow State University, Universitetskii~pr.\\ 13, 119992 Moscow, Russia}\n\\altaffiltext{12}{Helmholtz-Zentrum Potsdam, Deutsches Geo-ForschungsZentrum, Department 1: Geodesy and Remote Sensing, Telegrafenberg, 14473, Potsdam, Germany}\n\\email{mjohnson@cfa.harvard.edu} \n\n\\keywords{ quasars: individual (3C273) --- ISM: structure --- scattering --- techniques: high angular resolution --- techniques: interferometric --- turbulence  }\n\n\n\\begin{abstract}\nEarth--space interferometry with \\textit{RadioAstron} provides the highest direct angular resolution ever achieved in astronomy at any wavelength. \\textit{RadioAstron} detections of the classic quasar 3C\\,273 on interferometric baselines up to 171{,}000~km suggest brightness temperatures exceeding expected limits from the ``inverse-Compton catastrophe'' by two orders of magnitude. We show that at 18~cm, these estimates most probably arise from refractive substructure introduced by scattering in the interstellar medium. We use the scattering properties to estimate an intrinsic brightness temperature of $7{\\times}10^{12}~{\\rm K}$, which is consistent with expected theoretical limits, but which is ${\\sim}15$ times lower than estimates that neglect substructure. At 6~cm, the substructure influences the measured values appreciably but gives an estimated brightness temperature that is comparable to models that do not account for the substructure. At $1.3~{\\rm cm}$, the substructure does not affect the extremely high inferred brightness temperatures, in excess of $10^{13}~{\\rm K}$. We also demonstrate that for a source having a Gaussian surface brightness profile, a single long-baseline estimate of refractive substructure determines an absolute minimum brightness temperature, if the scattering properties along a given line of sight are known, and that this minimum accurately approximates the apparent brightness temperature over a wide range of total flux densities. \n\\end{abstract}\n\n\n\\section{Introduction}\n\nEarth--space interferometry with \\textit{RadioAstron} extends available interferometric baselines up to ${\\sim}360{,}000~{\\rm km}$, offering unprecedented angular resolution at radio wavelengths and new techniques to study emission processes of the most compact active galactic nuclei (AGN) via direct imaging \\citep{Kardashev_2013}. In particular, because the radio emission from AGN is thought to be incoherent synchrotron radiation, the maximum intrinsic brightness temperature is expected to be ${\\mathrel{\\raise.3ex\\hbox{$<$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} 10^{10.5}~{\\rm K}$ if there is equipartition of energy among the particles and fields \\citep{Readhead_1994}, or $T_{\\rm b} < 10^{11-12}~{\\rm K}$ if the particle energies greatly exceed the field energies, set by the ``inverse Compton catastrophe'' \\citep{Kellermann_1969}. Even the angular resolution of very-long-baseline interferometry (VLBI) with stations spanning the globe is insufficient to identify brightness temperatures that significantly violate these expected limits.   \n\nVLBI with \\textit{RadioAstron} is also sensitive to effects from scattering in the ionized interstellar medium (ISM) that are not detectable on shorter baselines. \nWhen averaged over long timescales -- days to months -- the scattering blurs compact features in the image, resulting in lower apparent brightness temperatures. However, on shorter timescales, including individual observing epochs, scattering exaggerates image gradients and introduces spurious compact features, or ``refractive substructure,'' within the scattered image \\citep{Johnson_Gwinn_2015}. \n\nIn this letter, we study implications of refractive substructure for \\textit{RadioAstron} observations of the bright, nearby, $z\\approx 0.158$, quasar 3C\\,273 at wavelengths of $\\lambda=18$, 6, and 1.3~cm reported by \\citet{Kovalev_2015}. \n\n\n\\section{Scattering Theory}\n\\label{sec::Scattering}\n\n\\subsection{Interstellar Scattering}\n\n\nDensity inhomogeneities in the ionized ISM scatter radio waves, causing scintillation of compact sources, temporal broadening of sharp pulses, and angular broadening of images. The inhomogeneities are often well-described as being localized to a thin ``screen'' between the observer and the source, with a Kolmogorov-like turbulent cascade on scales ranging from ${{\\mathrel{\\raise.3ex\\hbox{$>$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}}}100~{\\rm AU}$ to ${{\\mathrel{\\raise.3ex\\hbox{$<$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}}}1000~{\\rm km}$ \\citep{Armstrong_1995}. The three-dimensional power spectrum of the density fluctuations is $P(\\mathbf{q}) \\sim C_{\\rm N}^2 |\\mathbf{q}|^{-(\\alpha+2)}$, where $\\alpha=5/3$ for Kolmogorov turbulence. \nFor reviews of interstellar scattering and scintillation, see \\citet{Rickett_1990} or \\citet{Narayan_1992}; \\citet{Gurvits_1993}, \\citet{Shishov_2006}, and \\citet{Koay_Macquart_2015} specifically address some of the effects of scattering for space VLBI.\n\nThis simple but effective scattering model then depends on two characteristic length scales in addition to the power-law exponent $\\alpha$:\n\\begin{enumerate}\n \\item The phase coherence length, $r_0 \\propto \\lambda^{-2/\\alpha}$, is given by the lateral displacement on the scattering screen over which the root-mean-square difference in the random scattering phase is one radian.\n\\item The Fresnel scale, $r_{\\rm F} = \\sqrt{\\lambda D/(2\\pi)}$, depends on the distance $D$ from the observer to the scattering material and gives the lateral displacement at which the extra path length relative to the direct path introduces a half radian of phase. \n \\end{enumerate}\n \nAt $\\lambda=18~{\\rm cm}$, the scattering along most lines of sight through the Galaxy is ``strong'': $r_0 \\ll r_{\\rm F}$  \\citep{Walker_1998}. In this regime, the scattered image of a point source extends over a few times the refractive scale, $r_{\\rm R} = r_{\\rm F}^2/r_0 \\propto \\lambda^{1+2/\\alpha}$, and so the stochastic phase introduced by scattering varies by many turns across the scattered image. At $\\lambda=1.3~{\\rm cm}$, the scattering along most lines of sight through the Galaxy is ``weak'': $r_0 \\gg r_{\\rm F}$. In this regime, the scattered image extends over a few times the Fresnel scale, and so the stochastic phase introduced by scattering varies by less than a radian across the scattered image.  \n\nHistorically for VLBI, the telltale signature of strong scattering has been smearing of images with a scattering kernel of size $r_{\\rm R} {\\mathrel{\\raise.3ex\\hbox{$\\propto$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} \\lambda^{2}$, resulting in \\emph{lower} apparent brightness temperatures. \nThis effect of scattering is an ensemble-average property -- it assumes averaging a scattered image over an infinite time and is therefore deterministic \\citep{Fish_2014}.\n\nWhen averaged over shorter timescales, the scattering imparts stochastic signatures, collectively referred to as ``scintillation.'' Point sources such as pulsars commonly show dramatic 100\\% modulation of intensity in frequency and time from ``diffractive'' scintillation. The sizes of larger sources, such as AGN, typically quench the diffractive scintillation, just as stars twinkle but planets do not, and the degree to which the scintillation is quenched can provide estimates of intrinsic source size \\citep[see, e.g.,][]{Readhead_Hewish_1972,Narayan_1992,Gwinn_1998}. \nHowever, ``refractive'' scattering effects, reflecting fluctuations on larger scales, can persist for AGN.  \n\n\n\nRefractive effects are wideband and typically evolve on timescales of days to weeks, although in some sources the timescale can be as short as hours or less, e.g., PKS\\,0405-385 \\citep{Kedziora-Chudczer_1997}. Moreover, while diffractive effects such as scatter broadening become weaker at higher frequencies in the strong-scattering regime, refractive effects become stronger until the transition to weak scattering. The most familiar example of refractive scintillation for AGN is flux modulation \\citep{RCB_1984}, and monitoring programs have now systematically studied the flux modulation of hundreds of AGN at frequencies of ${\\sim}2{-}8~{\\rm GHz}$ \\citep[e.g.,][]{Rickett_2006,Lovell_2008}. \n\n\n\\subsection{Refractive Substructure}\n\\label{sec::Substructure}\n\n\\citet{NarayanGoodman89} and \\citet{GoodmanNarayan89} discovered another effect from refractive scattering: substructure within the scattered image of a point source. \\citet{Johnson_Gwinn_2015} showed that this substructure would persist for an extended source, even producing features on angular scales much finer than those intrinsic to the source. \nRefractive substructure is most easily understood in the geometrical optics limit, where scattering ``shuffles'' brightness elements of the image, with individual elements being magnified and demagnified across the image but with unchanged brightness. \n\nRefractive substructure thereby produces fluctuations -- ``refractive noise'' -- in measured interferometric visibilities. The effects are especially apparent on long baselines, which are sensitive to the introduced power at small angular scales \\citep[see, e.g.,][]{Gwinn_2014}. Approximate expressions for the refractive noise on long baselines in the strong scattering regime are given by Eq.~19 of \\citet{Johnson_Gwinn_2015}. Eq.~32 from  \\citet{Johnson_Gwinn_2015} provides a more general expression that is accurate on all baselines and in both the weak and strong scattering regimes but requires numerical integration to evaluate. \n\n\nFor comparison with observations of AGN at wavelengths shorter than 20 cm, we consider the case in which the typical scattering angle is smaller than the intrinsic source size. In this case, $\\theta_{\\rm img} \\approx \\theta_{\\rm src}$, where $\\theta_{\\rm src}$ is the intrinsic angular size of the source and $\\theta_{\\rm img}$ is the ensemble-average angular size (i.e., the scatter-broadened size). Throughout this paper, we use the full width at half maximum (FWHM) to define the angular size of a source. On a long baseline\\footnote{Specifically, the baseline must have $B {\\mathrel{\\raise.3ex\\hbox{$>$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} r_0$; namely, the baseline would resolve the scatter-broadened image of a point source.} of length $B$, the fractional root-mean-square fluctuations from substructure are then $\\sigma_{\\rm ref} \\propto B^{-\\alpha/2} \\lambda^{2+\\alpha/2} \\theta_{\\rm img}^{-2}$. For a source with the same brightness temperature at all wavelengths, $\\theta_{\\rm src} \\propto \\lambda$; this is the typical scaling for a self-absorbed jet \\citep{Blandford_Konigl_1979}. In this case, the refractive noise on a given baseline increases with wavelength, $\\sigma_{\\rm ref} \\propto \\lambda^{\\alpha/2} {\\mathrel{\\raise.3ex\\hbox{$\\propto$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} \\lambda^{5/6}$, because although refractive effects become stronger at shorter wavelengths as noted above, quenching of the refractive scintillation by finite source size dominates the wavelength scaling.\n\n\nIn short, refractive scattering exaggerates image gradients and introduces small-scale features into images. When interpreted in the context of a smooth source model, these features may suggest high brightness temperatures, although a perfect image reconstruction would show no brightness temperatures higher than those of the unscattered source. \n\n\n\n\n\n\n\n\n\n\\subsection{Minimum Brightness Temperature Inferred from Substructure}\n\\label{sec::Tb_min}\n\nWhen estimating the brightness temperature with sparse baseline coverage, images cannot be reliably formed so the total flux density $F_0$ of a compact component may not be securely estimated (for simplicity, we will henceforth refer to $F_0$ as the ``core'' flux density). Nevertheless, for an assumed Gaussian source with a central brightness temperature $T_{\\rm b}$, a single estimate of the correlated flux density $F_{B}$ on a long baseline $B$ determines an absolute minimum for the apparent brightness temperature, even without knowledge of $F_0$ \\citep{Lobanov_2015}: \n\n", "index": 1, "text": "\\begin{align}\n\\label{eq::Tb_min_intrinsic}\nT_{\\rm b, min} \\approx 6.18 \\times 10^{11}~{\\rm K} \\left( \\frac{ B}{{10^5}\\,{\\rm km}} \\right)^2 \\left( \\frac{F_{B}}{\\rm 20~mJy} \\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle T_{\\rm b,min}\\approx 6.18\\times 10^{11}~{}{\\rm K}\\left(\\frac{B}{%&#10;{10^{5}}\\,{\\rm km}}\\right)^{2}\\left(\\frac{F_{B}}{\\rm 20~{}mJy}\\right).\" display=\"inline\"><mrow><mrow><msub><mi>T</mi><mrow><mi mathvariant=\"normal\">b</mi><mo>,</mo><mi>min</mi></mrow></msub><mo>≈</mo><mrow><mrow><mn>6.18</mn><mo>×</mo><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mn>11</mn></msup></mpadded></mrow><mo>⁢</mo><mi mathvariant=\"normal\">K</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>B</mi><mrow><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mn>5</mn></msup></mpadded><mo>⁢</mo><mi>km</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>F</mi><mi>B</mi></msub><mrow><mpadded width=\"+3.3pt\"><mn>20</mn></mpadded><mo>⁢</mo><mi>mJy</mi></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05810.tex", "nexttext": "\nNote that this estimate corrects for scatter-broadening.\n\nFigure~\\ref{fig_Tb_vs_F0} compares the inferred brightness temperatures from intrinsic structure and from refractive substructure for the \\textit{RadioAstron} 18~cm observations (described below) as a function of the core flux density, $F_0$. \n\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=0.47\\textwidth]{f1.pdf}\n\\caption\n{ \nInferred brightness temperature as a function of the core flux density, $F_0$, using the average correlated flux density for \\textit{RadioAstron} detections at $\\lambda=18~{\\rm cm}$ ($F_{B} = 47~{\\rm mJy}$ on a baseline $B=164{,}000~{\\rm km}$). The red solid line shows the inferred brightness temperature for a Gaussian model with no scattering (Eq.~\\ref{eq::Tb_min_intrinsic}); the blue dashed line shows the inferred brightness temperature if the \\textit{RadioAstron} detections are refractive noise (Eq.~\\ref{eq::Tb_min_scattering}). The lower of the two curves determines whether intrinsic structure or scattering dominates $F_{B}$. \n$T_{\\rm b}$ from intrinsic structure diverges when the core is completely unresolved ($F_{B} = F_0$), while $T_{\\rm b}$ from refractive substructure diverges when the normalized visibility $F_{B}/F_0$ is equal to the expected refractive noise for a point source. For any core flux density $F_0$ greater than ${\\sim}1~{\\rm Jy}$, the measurements will be dominated by refractive noise with an inferred $T_{\\rm b} \\approx 7\\times 10^{12}~{\\rm K}$ that only weakly depends on the unknown core flux density. For 3C\\,273, $F_0 \\approx 5.0~{\\rm Jy}$. \n}\n\\label{fig_Tb_vs_F0}\n\\end{figure}\n\n\n\n\n\\begin{figure*}[t]\n\\centering\n\\includegraphics*[width=1.0\\textwidth]{f2.pdf}\n\\caption\n{ \nSimulated images showing the effects of refractive substructure at $\\lambda=18~{\\rm cm}$, 6~cm, and 1.3~cm. For each wavelength two cases are shown, peak brightness temperatures of ({\\it top}) $T_{\\rm b} = 10^{13}~{\\rm K}$ and ({\\it bottom}) $T_{\\rm b} = 10^{14}~{\\rm K}$. To simplify the comparison, a 5~Jy circular Gaussian intrinsic source is assumed in all cases. Brightness is shown on a linear scale and is scaled so that the maximum image brightness is identical across each panel. The angular range in each panel is scaled linearly with wavelength so that the unscattered source would appear identical across each panel (hence, a fixed physical observing array would have the same beam size across each panel horizontally) with an equal angular scale in the top and bottom panels. The scattering parameters correspond to the NE2001 estimates for 3C\\,273 (see \\S\\ref{sec::Analysis}). The effects of substructure at 18~cm and 6~cm are readily apparent even when the typical scattering angle is smaller than the intrinsic angular structure. \n}\n\\label{fig_Scattering_Example}\n\\end{figure*}\n\n\n\n\\section{Observations}\n\\label{sec::Observations}\n\nThe observations of 3C\\,273 reported by \\citet{Kovalev_2015} were made in December 2012 to February 2013 with \\textit{RadioAstron} in concert with the Green Bank Telescope (GBT), the phased Karl G.~Jansky Very Large Array (VLA), the 100-meter Effelsberg radio telescope, and the 305-meter Arecibo Telescope at $\\lambda{=}18$, 6, and 1.35~cm. 3C\\,273 was detected on baselines exceeding $100{,}000~{\\rm km}$ at each of the 3 observing wavelengths. \nAt 18~cm, detections on two epochs had correlated flux densities of $42\\pm 7~{\\rm mJy}$ and $52\\pm 9~{\\rm mJy}$ on baselines of $157{,}000~{\\rm km}$ and $171{,}000~{\\rm km}$, respectively. At 6~cm, detections on two epochs had correlated flux densities of $125\\pm 17~{\\rm mJy}$ and $123\\pm 19~{\\rm mJy}$ on baselines of $90{,}000~{\\rm km}$ and $103{,}000~{\\rm km}$, respectively. At 1.3~cm, the single epoch with a detection found a correlated flux density of $125\\pm 22~{\\rm mJy}$ on a baseline of $103{,}000~{\\rm km}$. These errors include amplitude calibration uncertainties; the fringe amplitude had a signal-to-noise ratio ${{\\mathrel{\\raise.3ex\\hbox{$>$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}}}10$ in all cases. \\citet{Kovalev_2015} estimate the core flux densities to be $F_0 = 5.0~{\\rm Jy}$ at 18~cm, $4.3~{\\rm Jy}$ at 6~cm, and $3.4~{\\rm Jy}$ at 1.3~cm. \n\n\n\\section{Scattering and Substructure of 3C\\,273}\n\\label{sec::Analysis}\n\n\n\n\n\\begin{figure*}[t]\n\\centering\n\\includegraphics*[width=\\textwidth]{f3.pdf}\n\\caption\n{ Visibility amplitude vs.\\ baseline length for circular Gaussian source models; the solid line shows the ensemble-average visibility amplitude (``signal'') while the dashed line shows the root-mean-square refractive fluctuations (``noise''). \nAt each baseline, the higher of the two curves determines whether intrinsic structure or refractive noise will dominate measured visibilities. \\textit{RadioAstron} detections are shown as black points with ${\\pm}1\\sigma$ error bars that include calibration uncertainties.  Three Gaussian models are also shown: brightness temperatures of $10^{12}~{\\rm K}$ (blue), $10^{14}~{\\rm K}$ (red), and wavelength-dependent best-fit models to the \\textit{RadioAstron} long-baseline detections (green). At $\\lambda{=}18~{\\rm cm}$, the \\textit{RadioAstron} detections are dominated by refractive noise, and the noise level provides an estimate of the apparent brightness temperature; at $6~{\\rm cm}$, the detections reflect a combination of ensemble-average visibility and refractive noise; and at $1.3~{\\rm cm}$, the detections are dominated by the ensemble-average visibility. The center figure also shows the middle 68\\% range of refractive noise amplitudes expected for the middle model as a shaded region. The range is highly asymmetric -- within individual epochs, null detections are much more likely than amplitudes significantly higher than the root-mean-square noise. \n}\n\\label{fig_Models_wData}\n\\end{figure*}\n\n\n\nBecause 3C\\,273 lies at galactic coordinates $\\ell = 289.95^\\circ$ and $b=+64.36^\\circ$, the scattering properties along its line of sight are typical of extragalactic sources that are well away from the Galactic plane. Moreover, because angular broadening preferentially weights nearby material \\citep{Blandford_Narayan_1985}, the substructure for extragalactic sources is overwhelmingly dominated by scattering within the Milky Way \\citep[see, e.g.,][]{Koay_Macquart_2015}.  \nFor 3C\\,273, the NE2001 model of the Galactic distribution of free electrons predicts an angular broadening of $\\theta_{\\rm scatt} \\approx 0.75~{\\rm mas}$ at an observing frequency of $1~{\\rm GHz}$ \\citep{NE2001}. We scale this estimate to other wavelengths assuming that $\\theta_{\\rm scatt} \\propto \\lambda^2$ (a Kolmogorov scaling, $\\theta_{\\rm scatt} \\propto \\lambda^{11/5}$, gives similar results). Figure~\\ref{fig_Scattering_Example} shows simulated images of the refractive scattering in each \\textit{RadioAstron} observing band. \n\n\nAt $\\lambda=18~{\\rm cm}$, detections with \\textit{RadioAstron} imply a brightness temperature of $T_{\\rm b} {\\mathrel{\\raise.3ex\\hbox{$>$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} 10^{14}~{\\rm K}$ for Gaussian source models with no refractive substructure (after accounting for scatter broadening). However, the expected refractive noise on these baselines would then be ${\\sim}5$ times larger than the observed signal (see Figure~\\ref{fig_Models_wData}). Thus, these Earth--space visibilities are most likely the first detections of refractive substructure in an extragalactic source. To reproduce the observed long-baseline detections via refractive noise requires a source size of approximately $570~\\mu{\\rm as}$ with a corresponding brightness temperature of $T_{\\rm b} \\sim 6.8 \\times 10^{12}~{\\rm K}$ if the core flux density is $F_0 = 5.0~{\\rm Jy}$. This estimate is rather insensitive to the assumed core flux density (see Figure~\\ref{fig_Tb_vs_F0}).\n\nAt $\\lambda=6.2~{\\rm cm}$, estimates from intrinsic structure and from substructure both give $T_{\\rm b} \\sim 1.4 \\times 10^{13}~{\\rm K}$ (see Figure~\\ref{fig_Models_wData}).  With additional observations, one could determine whether substructure is dominant by examining the variation in the correlated flux density on different observing epochs; because the contribution of refractive noise is stochastic, measurements that are dominated by refractive noise will be drawn from a Rayleigh distribution. The absence of such variation would be a secure indication that long-baseline measurements are not the result of substructure. \n\n\nAt $\\lambda=1.35~{\\rm cm}$, the expected refractive noise for a Gaussian source that matches the long-baseline detections ($\\theta_{\\rm src} = 26~\\mu{\\rm as}$) is a factor of ${\\sim}4$ smaller than the observed signal, showing that these detections are likely signal-dominated for a source with brightness temperature $T_{\\rm b} \\approx 1.3 \\times 10^{13}~{\\rm K}$. The detections also determine an upper limit, $T_{\\rm b} {\\mathrel{\\raise.3ex\\hbox{$<$\\kern-.75em\\lower1ex\\hbox{$\\sim$}}}} 7 \\times 10^{13}~{\\rm K}$, for the brightness temperature, since the refractive noise of a significantly more compact source would exceed the measured visibilities. \n\nAlthough we have assumed specific parameters to describe the scattering, the inferred brightness temperature is not sensitive to changes in these parameters. For example, the inferred $T_{\\rm b}$ varies by only 10\\% for $\\alpha$ ranging between 1.66 and 1.9 while fixing $\\theta_{\\rm scatt}$. Likewise, a scattering screen placed at $10~{\\rm kpc}$ rather than $1~{\\rm kpc}$ would have a corresponding refractive noise that is $10^{-1/6}\\approx 0.68$ times the current estimates, so the estimated brightness temperature from substructure would be \\emph{higher} by a factor of $10^{1/6} \\approx 1.47$. Our estimates of $T_{\\rm b}$ also depend on $\\theta_{\\rm scatt}$ (see, e.g., Eq.~\\ref{eq::Tb_min_scattering}), which we have estimated using the NE2001 model. Previous observations have found tolerable agreement with this model, often to within a factor of ${\\sim}2$ \\citep{Lazio_2008}, although more detailed study is essential and it remains difficult to confidently identify the weak angular broadening of high-latitude sources. \n\nThe stochastic nature of refractive noise also contributes uncertainty to estimates of $T_{\\rm b}$. A measured set of long-baseline visibilities determines an estimate of $\\sigma_{\\rm ref}$, and for measurements that are dominated by refractive noise, $\\sigma_{\\rm ref} \\propto T_{\\rm b}$. Because the Rayleigh distribution contains significant power for samples below the root-mean-square, the posterior distribution of $\\sigma_{\\rm ref}$ may be weakly constrained: for a single measurement, the middle $\\pm1\\sigma$ range for the posterior distribution of $\\sigma_{\\rm ref}$ spans a factor of ${\\approx}7$, while for two measurements, the inner $\\pm 1\\sigma$ range spans a factor of ${\\approx}2.5$. In each case, the range is highly asymmetric about the root-mean-square, primarily extending to larger values of $\\sigma_{\\rm ref}$. Thus, the true brightness temperatures may be up to a few times higher than what we have inferred but could not be significantly lower. Conversely, since our measurements only address the detections with \\textit{RadioAstron} on long baselines, and there were other observing epochs with no detections on comparable baselines, these measurements may be biased by sampling only the high end of the Rayleigh distribution. In this case, the root-mean-square refractive noise may be up to a factor of ${\\sim}2$ smaller than our estimates implying a \\emph{lower} $T_{\\rm b}$ by a factor of ${\\sim}2$. \n\n\n\\section{Summary}\n\\label{sec::Summary}\n\nOn long baselines, refractive noise from interstellar scattering likely dominates \\textit{RadioAstron} detections of 3C\\,273 at $\\lambda{=}18~{\\rm cm}$, is probably comparable to the observed signal at $6.2~{\\rm cm}$, and is likely insignificant at $1.35~{\\rm cm}$. At 18~cm, the brightness temperature estimate after accounting for refractive noise is $T_{\\rm b} \\sim 7 \\times 10^{12}~{\\rm K}$. This brightness temperature at 18~cm is 15 times lower than the estimate for a smooth, scatter-broadened Gaussian source. \n\nOur results, the first detection of refractive substructure in an extragalactic source, demonstrate the importance of refractive substructure for Earth--space VLBI in general. \nTraditionally, refractive flux modulation has been proposed as the most promising signature of scattering to study in parallel with space VLBI \\citep[e.g.,][]{Dennison_1993}. However, studies of flux modulation require regular monitoring of the total and correlated flux, they cannot always unambiguously disentangle the scattering fluctuations from those that are intrinsic to the source, and the results can be sensitive to the unknown fraction of the total flux density in the compact, scintillating component. In contrast, studies of refractive scintillation through Earth--space VLBI can obtain meaningful information about the source and scattering with individual observing epochs, and the results are insensitive to the total flux density. Consequently, estimates of brightness temperature with sparse baseline coverage can be \\emph{improved} by refractive scattering. \nIf multiple epochs are combined, then additional detailed information can be derived, including the scattering timescales involved. For instance, the dependence of refractive noise on baseline length determines the power-law exponent $\\alpha$ for large-scale turbulence in the scattering region, which we have simply assumed to be the Kolmogorov value ($\\alpha=5/3$). Thus, our discovery of refractive substructure in AGN offers a new, robust pathway for estimating the brightness temperatures of compact sources with sparse baseline coverage and for studies of large-scale scattering.\n\n\n\\acknowledgements{MDJ thanks the Gordon and Betty Moore Foundation for financial support of this work through grant GBMF-3561 to Sheperd Doeleman. The \\textit{RadioAstron} project is led by the Astro Space Center of the Lebedev Physical Institute of the Russian Academy of Sciences and the Lavochkin Association of the Russian Federal Space Agency, and is a collaboration with partner institutions in Russia and other countries. This project was supported by the Russian Foundation for Basic Research\ngrant 13-02-12103.\nThe Arecibo Observatory is operated by SRI International under a cooperative\nagreement with the National Science Foundation (AST-1100968), and in alliance with Ana G.~Mendez-Universidad Metropolitana, and the Universities Space Research Association. The\nNational Radio Astronomy Observatory is a facility of the National Science Foundation operated\nunder cooperative agreement by Associated Universities, Inc. This research is partly based on\nobservations with the 100-meter telescope of the MPIfR (Max-Planck-Institute for Radio\nAstronomy) at Effelsberg. \n}\n\n{\\it Facilities:} \\facility{RadioAstron Space Radio Telescope (Spektr-R)}, \\facility{Arecibo}, \\facility{GBT}, \\facility{VLA}, \\facility{Effelsberg}\\\\ \\ \\\\\n\n\n\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Armstrong} {et~al.}(1995){Armstrong}, {Rickett}, \\&\n  {Spangler}}]{Armstrong_1995}\n{Armstrong}, J.~W., {Rickett}, B.~J., \\& {Spangler}, S.~R. 1995, \\apj, 443, 209\n\n\\bibitem[{{Blandford} \\& {Narayan}(1985)}]{Blandford_Narayan_1985}\n{Blandford}, R., \\& {Narayan}, R. 1985, \\mnras, 213, 591\n\n\\bibitem[{{Blandford} \\& {K{\\\"o}nigl}(1979)}]{Blandford_Konigl_1979}\n{Blandford}, R.~D., \\& {K{\\\"o}nigl}, A. 1979, \\apj, 232, 34\n\n\\bibitem[{{Cordes} \\& {Lazio}(2002)}]{NE2001}\n{Cordes}, J.~M., \\& {Lazio}, T.~J.~W. 2002, arXiv:astro-ph/0207156\n\n\\bibitem[{{Dennison} {et~al.}(1993){Dennison}, {Fiedler}, {Johnston}, \\&\n  {Simon}}]{Dennison_1993}\n{Dennison}, B., {Fiedler}, R.~L., {Johnston}, K.~J., \\& {Simon}, R.~L. 1993, in\n  Propagation Effects in Space VLBI, ed. L.~I. {Gurvits}, 23\n\n\\bibitem[{{Fish} {et~al.}(2014){Fish}, {Johnson}, {Lu}, {Doeleman}, {Bouman},\n  {Zoran}, {Freeman}, {Psaltis}, {Narayan}, {Pankratius}, {Broderick}, {Gwinn},\n  \\& {Vertatschitsch}}]{Fish_2014}\n{Fish}, V.~L., {Johnson}, M.~D., {Lu}, R.-S., {et~al.} 2014, \\apj, 795, 134\n\n\\bibitem[{{Goodman} \\& {Narayan}(1989)}]{GoodmanNarayan89}\n{Goodman}, J., \\& {Narayan}, R. 1989, \\mnras, 238, 995\n\n\\bibitem[{{Gurvits}(1993)}]{Gurvits_1993}\n{Gurvits}, L.~I., ed. 1993, {Propagation Effects in Space VLBI}\n\n\\bibitem[{{Gwinn} {et~al.}(1998){Gwinn}, {Britton}, {Reynolds}, {Jauncey},\n  {King}, {McCulloch}, {Lovell}, \\& {Preston}}]{Gwinn_1998}\n{Gwinn}, C.~R., {Britton}, M.~C., {Reynolds}, J.~E., {et~al.} 1998, \\apj, 505,\n  928\n\n\\bibitem[{{Gwinn} {et~al.}(2014){Gwinn}, {Kovalev}, {Johnson}, \\&\n  {Soglasnov}}]{Gwinn_2014}\n{Gwinn}, C.~R., {Kovalev}, Y.~Y., {Johnson}, M.~D., \\& {Soglasnov}, V.~A. 2014,\n  \\apjl, 794, L14\n\n\\bibitem[{{Johnson} \\& {Gwinn}(2015)}]{Johnson_Gwinn_2015}\n{Johnson}, M.~D., \\& {Gwinn}, C.~R. 2015, \\apj, 805, 180\n\n\\bibitem[{{Kardashev} {et~al.}(2013){Kardashev}, {Khartov}, {Abramov},\n  {Avdeev}, {Alakoz}, {Aleksandrov}, {Ananthakrishnan}, {Andreyanov},\n  {Andrianov}, {Antonov}, {Artyukhov}, {Arkhipov}, {Baan}, {Babakin},\n  {Babyshkin}, {Bartel'}, {Belousov}, {Belyaev}, {Berulis}, {Burke},\n  {Biryukov}, {Bubnov}, {Burgin}, {Busca}, {Bykadorov}, {Bychkova},\n  {Vasil'kov}, {Wellington}, {Vinogradov}, {Wietfeldt}, {Voitsik},\n  {Gvamichava}, {Girin}, {Gurvits}, {Dagkesamanskii}, {D'Addario},\n  {Giovannini}, {Jauncey}, {Dewdney}, {D'yakov}, {Zharov}, {Zhuravlev},\n  {Zaslavskii}, {Zakhvatkin}, {Zinov'ev}, {Ilinen}, {Ipatov}, {Kanevskii},\n  {Knorin}, {Casse}, {Kellermann}, {Kovalev}, {Kovalev}, {Kovalenko}, {Kogan},\n  {Komaev}, {Konovalenko}, {Kopelyanskii}, {Korneev}, {Kostenko}, {Kotik},\n  {Kreisman}, {Kukushkin}, {Kulishenko}, {Cooper}, {Kut'kin}, {Cannon},\n  {Larionov}, {Lisakov}, {Litvinenko}, {Likhachev}, {Likhacheva}, {Lobanov},\n  {Logvinenko}, {Langston}, {McCracken}, {Medvedev}, {Melekhin}, {Menderov},\n  {Murphy}, {Mizyakina}, {Mozgovoi}, {Nikolaev}, {Novikov}, {Novikov},\n  {Oreshko}, {Pavlenko}, {Pashchenko}, {Ponomarev}, {Popov}, {Pravin-Kumar},\n  {Preston}, {Pyshnov}, {Rakhimov}, {Rozhkov}, {Romney}, {Rocha}, {Rudakov},\n  {R{\\\"a}is{\\\"a}nen}, {Sazankov}, {Sakharov}, {Semenov}, {Serebrennikov},\n  {Schilizzi}, {Skulachev}, {Slysh}, {Smirnov}, {Smith}, {Soglasnov},\n  {Sokolovskii}, {Sondaar}, {Stepan'yants}, {Turygin}, {Turygin}, {Tuchin},\n  {Urpo}, {Fedorchuk}, {Finkel'shtein}, {Fomalont}, {Fejes}, {Fomina},\n  {Khapin}, {Tsarevskii}, {Zensus}, {Chuprikov}, {Shatskaya}, {Shapirovskaya},\n  {Sheikhet}, {Shirshakov}, {Schmidt}, {Shnyreva}, {Shpilevskii}, {Ekers}, \\&\n  {Yakimov}}]{Kardashev_2013}\n{Kardashev}, N.~S., {Khartov}, V.~V., {Abramov}, V.~V., {et~al.} 2013,\n  Astronomy Reports, 57, 153\n\n\\bibitem[{{Kedziora-Chudczer} {et~al.}(1997){Kedziora-Chudczer}, {Jauncey},\n  {Wieringa}, {Walker}, {Nicolson}, {Reynolds}, \\&\n  {Tzioumis}}]{Kedziora-Chudczer_1997}\n{Kedziora-Chudczer}, L., {Jauncey}, D.~L., {Wieringa}, M.~H., {et~al.} 1997,\n  \\apjl, 490, L9\n\n\\bibitem[{{Kellermann} \\& {Pauliny-Toth}(1969)}]{Kellermann_1969}\n{Kellermann}, K.~I., \\& {Pauliny-Toth}, I.~I.~K. 1969, \\apjl, 155, L71\n\n\\bibitem[{{Koay} \\& {Macquart}(2015)}]{Koay_Macquart_2015}\n{Koay}, J.~Y., \\& {Macquart}, J.-P. 2015, \\mnras, 446, 2370\n\n\\bibitem[{{Kovalev} {et~al.}(2016){Kovalev}, {Kardashev}, {Kellermann},\n  {Lobanov}, {Johnson}, {Gurvits}, \\& {others}}]{Kovalev_2015}\n{Kovalev}, Y.~Y., {Kardashev}, N.~S., {Kellermann}, K.~I., {et~al.} 2016, ApJL,\n  submitted\n\n\\bibitem[{{Lazio} {et~al.}(2008){Lazio}, {Ojha}, {Fey}, {Kedziora-Chudczer},\n  {Cordes}, {Jauncey}, \\& {Lovell}}]{Lazio_2008}\n{Lazio}, T.~J.~W., {Ojha}, R., {Fey}, A.~L., {et~al.} 2008, \\apj, 672, 115\n\n\\bibitem[{{Lobanov}(2015)}]{Lobanov_2015}\n{Lobanov}, A. 2015, \\aap, 574, A84\n\n\\bibitem[{{Lovell} {et~al.}(2008){Lovell}, {Rickett}, {Macquart}, {Jauncey},\n  {Bignall}, {Kedziora-Chudczer}, {Ojha}, {Pursimo}, {Dutka}, {Senkbeil}, \\&\n  {Shabala}}]{Lovell_2008}\n{Lovell}, J.~E.~J., {Rickett}, B.~J., {Macquart}, J.-P., {et~al.} 2008, \\apj,\n  689, 108\n\n\\bibitem[{{Narayan}(1992)}]{Narayan_1992}\n{Narayan}, R. 1992, Royal Society of London Philosophical Transactions Series\n  A, 341, 151\n\n\\bibitem[{{Narayan} \\& {Goodman}(1989)}]{NarayanGoodman89}\n{Narayan}, R., \\& {Goodman}, J. 1989, \\mnras, 238, 963\n\n\\bibitem[{{Readhead}(1994)}]{Readhead_1994}\n{Readhead}, A.~C.~S. 1994, \\apj, 426, 51\n\n\\bibitem[{{Readhead} \\& {Hewish}(1972)}]{Readhead_Hewish_1972}\n{Readhead}, A.~C.~S., \\& {Hewish}, A. 1972, \\nat, 236, 440\n\n\\bibitem[{{Rickett}(1990)}]{Rickett_1990}\n{Rickett}, B.~J. 1990, \\araa, 28, 561\n\n\\bibitem[{{Rickett} {et~al.}(1984){Rickett}, {Coles}, \\& {Bourgois}}]{RCB_1984}\n{Rickett}, B.~J., {Coles}, W.~A., \\& {Bourgois}, G. 1984, \\aap, 134, 390\n\n\\bibitem[{{Rickett} {et~al.}(2006){Rickett}, {Lazio}, \\&\n  {Ghigo}}]{Rickett_2006}\n{Rickett}, B.~J., {Lazio}, T.~J.~W., \\& {Ghigo}, F.~D. 2006, \\apjs, 165, 439\n\n\\bibitem[{{Shishov} {et~al.}(2006){Shishov}, {Coles}, {Rickett}, {Bird},\n  {Efimov}, {Samoznaev}, {Rudash}, {Chashei}, {Plettemeier}, {Spangler},\n  {Tokarev}, {Belov}, {Boiko}, {Komrakov}, {Chau}, {Harmon}, {Sulzer},\n  {Kojima}, {Tokumaru}, {Fujiki}, {Janardhan}, {Jackson}, {Hick}, {Buffington},\n  {Olyak}, {Fallows}, {Nechaeva}, {Gavrilenko}, {Gorshenkov}, {Alimov},\n  {Molotov}, {Pushkarev}, {Shanks}, {Tuccari}, {Lotova}, {Vladimirski},\n  {Obridko}, {Gubenko}, {Andreev}, {Stinebring}, {Gwinn}, {Lovell}, {Jauncey},\n  {Senkbeil}, {Shabala}, {Bignall}, {Macquart}, {Rickett}, {Kedziora-Chudczer},\n  {Smirnova}, {Rickett}, {Malofeev}, {Malov}, {Tyulbashev}, {Jessner},\n  {Sieber}, \\& {Wielebinski}}]{Shishov_2006}\n{Shishov}, V.~I., {Coles}, W.~A., {Rickett}, B.~J., {et~al.} 2006, {The Journal\n  of the Eurasian Astronomical Society}, astro-ph/0609517\n\n\\bibitem[{{Walker}(1998)}]{Walker_1998}\n{Walker}, M.~A. 1998, \\mnras, 294, 307\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 14919, "prevtext": "\nThis minimum brightness temperature is achieved when $F_{B}/F_0 = 1/e$. Note that this estimate does not correct for scatter-broadening.\n\n\nWhen the scattering properties along a given line of sight can be estimated a priori, a single long-baseline measurement that is dominated by refractive noise likewise determines a lower limit on brightness temperature, even when $F_0$ is not known. This lower limit occurs when the source becomes large so that the refractive noise is quenched as $\\sigma_{\\rm ref} \\propto \\theta_{\\rm src}^{-2}$ (see \\S\\ref{sec::Substructure}). \nBecause $\\sigma_{\\rm ref} \\sim F_{B}/F_0$, this then implies that $\\theta_{\\rm src} \\propto \\sqrt{F_0}$ and so $T_{\\rm b} \\propto F_0/\\theta_{\\rm src}^2 = {\\rm constant}$. Thus, the inferred brightness temperature asymptotes to a constant value as $F_{B}/F_0$ becomes small. Taking the Kolmogorov scattering index $\\alpha=5/3$ and scaling with median values of the galactic scattering parameters at $\\lambda=18~{\\rm cm}$ \\citep[see][]{Johnson_Gwinn_2015}, we obtain\n\n", "index": 3, "text": "\\begin{align}\n\\label{eq::Tb_min_scattering}\n\\nonumber T_{\\rm b,min} &= 1.2 \\times 10^{12}~{\\rm K} \\left( \\frac{B}{10^5~{\\rm km}} \\right)^{5/6} \\left( \\frac{F_{B}}{20~{\\rm mJy}} \\right) \\\\ \n& \\quad \\times \\left( \\frac{ D }{ 1~{\\rm kpc}} \\right)^{1/6}  \\left( \\frac{\\lambda}{18~{\\rm cm}} \\right) \\left( \\frac{\\theta_{\\rm scatt}}{300~\\mu{\\rm as}} \\right)^{-5/6}\\!\\!\\!.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle T_{\\rm b,min}\" display=\"inline\"><msub><mi>T</mi><mrow><mi mathvariant=\"normal\">b</mi><mo>,</mo><mi>min</mi></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=1.2\\times 10^{12}~{}{\\rm K}\\left(\\frac{B}{10^{5}~{}{\\rm km}}%&#10;\\right)^{5/6}\\left(\\frac{F_{B}}{20~{}{\\rm mJy}}\\right)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mn>1.2</mn><mo>×</mo><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mn>12</mn></msup></mpadded></mrow><mo>⁢</mo><mi mathvariant=\"normal\">K</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>B</mi><mrow><mpadded width=\"+3.3pt\"><msup><mn>10</mn><mn>5</mn></msup></mpadded><mo>⁢</mo><mi>km</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mrow><mn>5</mn><mo>/</mo><mn>6</mn></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>F</mi><mi>B</mi></msub><mrow><mpadded width=\"+3.3pt\"><mn>20</mn></mpadded><mo>⁢</mo><mi>mJy</mi></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\quad\\times\\left(\\frac{D}{1~{}{\\rm kpc}}\\right)^{1/6}\\left(\\frac{%&#10;\\lambda}{18~{}{\\rm cm}}\\right)\\left(\\frac{\\theta_{\\rm scatt}}{300~{}\\mu{\\rm as%&#10;}}\\right)^{-5/6}\\!\\!\\!.\" display=\"inline\"><mrow><mrow><mrow><mi mathvariant=\"normal\"> </mi><mo>×</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>D</mi><mrow><mpadded width=\"+3.3pt\"><mn>1</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>6</mn></mrow></msup></mrow><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>λ</mi><mrow><mpadded width=\"+3.3pt\"><mn>18</mn></mpadded><mo>⁢</mo><mi>cm</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mpadded width=\"-5.1pt\"><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>θ</mi><mi>scatt</mi></msub><mrow><mpadded width=\"+3.3pt\"><mn>300</mn></mpadded><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><mi>as</mi></mrow></mfrac></mstyle><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>5</mn><mo>/</mo><mn>6</mn></mrow></mrow></msup></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}]