[{"file": "1601.04594.tex", "nexttext": " \nwhere $\\mu_{\\pm}$ represents the mean mobility of positive or negative\nions present, $n_{\\pm}$ the associated bipolar ion number\nconcentrations and $e$ is the elementary charge. Ions are removed by\nattachment to aerosol particles and water droplets, reducing the\nconductivity in these regions.  Both the mobility and concentration\nvary with atmospheric properties and composition. The mobility of ions\ndepends on the environmental temperature and pressure and the ion\nconcentration is strongly affected by attachment to aerosol particles\nand water droplets, reducing the conductivity accordingly where the\naerosol is abundant. This means that, in the earth's environment,\nwhere aerosols are generated both naturally and through human\nactivities, the local air conductivity can show an anthropogenic\ninfluence (\\citealt{harrison2006,hugo2014}), allowing early indirect\nconductivity measurements to provide an insight into historical air\npollution (\\citealt{harrison2006, aplin2012A}). Together with\nvariations in the source rate, $q_{\\rm STP}$, these lead to a\nvariation in the conductivity with height\n(e.g. \\citealt{harrison2003}). In the heights of the lower ionosphere,\nwhere photo-ionisation also contributes appreciably, the conductivity\nbecomes substantially larger than the lower\natmosphere. Figure~\\ref{fig:GH3} shows a vertical profile of the air's\nconductivity, and a calculation of the relaxation timescale,\ndefined by $\\epsilon_0 / \\sigma_{\\rm t}$. This is the e-folding timescale for\nthe discharge of an isolated particle in a conductive medium. This\nprovides an indication of how active (in terms of the rate of charge\nseparation) a charging process needs to be at different heights in the\natmosphere. In comparison with lower troposphere air with a\ntypical conductivity of $\\approx 10^{-14}$ S\\,m$^{-1}$ as reviewed\nby \\cite{rycroft2008}, the planetary surface has a greater electrical\nconductivity, of at least $10^{-8}$ Sm$^{-1}$. This means the air\nrepresents a low conductivity region sandwiched between upper and\nlower boundaries having much greater conductivity.\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.4}{\\includegraphics[angle=0]{GH_Fig3.png}}\n\\caption{Vertical variation in electrical conductivity, $\\sigma_{\\rm t}$, of the terrestrial atmosphere, as represented in the model of \\cite{rycroft2007}. The dashed line indicates the change of conductivity due to clouds. The equivalent electrical relaxation time is found from $\\epsilon_0/\\sigma_{\\rm t}$,  where  $\\epsilon_0$ is the permittivity of free space.}\n\\label{fig:GH3}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\\subsection{Thundercloud electrification, lightning and transient luminous events}\\label{ss:Ute}\n\n\\paragraph{Ionic conductivity and ionic plasmas in the terrestrial atmosphere:}\nMost electric phenomena in the terrestrial atmosphere are carried by\nions and aerosols; only in the strong transient electric fields of an\nevolving discharge or in the ionosphere are more electrons free and\nnot attached to electronegative atoms, molecules or larger compounds\n consisting, e.g., of water molecules clustering around ions,\nother aerosols, up to droplets from micro- to millimeter size.\nCosmic rays and radioactivity are external sources of ionization\n(Sect.~\\ref{s:eldis_solsys}\\ref{ss:ionization}); they first\ncreate electron ion pairs, then the electrons rapidly attach to\nelectronegative molecules (mostly to oxygen) leaving the positive and negative ions\nin the atmosphere behind which carry the fair weather currents\n(Sect.~\\ref{s:eldis_solsys}\\ref{ss:globcirc}).\n\n\n\\paragraph{The electric field in thunderclouds} \nbuilds up in two stages.\nIn the first stage macroscopic particles are\nelectrically charged, and in the second stage particles of different\npolarity are separated by gravitation or other (mechanical) forces; in\norder to separate particles with different polarities, these forces\nneed to be stronger than the electric attraction between charges of\ndifferent polarity, since otherwise the electric forces would\ncounteract the growth of the electric field. The possible charging\nmechanisms at work within normal terrestrial thunderclouds are\nreviewed, e.g., by \\cite{jay1983} and \\cite{sau2008}. An important\nconclusion of these reviews is that charge is efficiently separated\nbetween particles only in direct collisions.\n\nLiquid droplets cannot experience collisions or fracture as charging\nprocess as they would typically merge on contact, hence they do not\ncharge easily. However, frozen particles can collide and exchange\ncharge. Therefore, terrestrial water clouds get electrified mostly in\nregions below the freezing temperature (\\citealt{mas1953}), more\nprecisely at temperatures between 0 and $-40^o$C.  The dominant\ncharging mechanism is thought to occur when graupel and ice particles\ncollide. \\cite{sau2008} reviews the evidence from Krehbiel's cloud\nmeasurements in 1986 ''that ice crystals rebounding from riming\ngraupel\\footnote{Riming graupel is a graupel particle coated with\nwater droplets that froze immediately when they collided with the ice\nsurface of the graupel. The surface structure of graupel deviates from\na perfect crystalline structure (e.g. \\citealt{bl2009}).} in the\npresence of super-cooled water is a requirement of the charge transfer\nprocess''. This observation is consistent with lab measurements of\nSaunders et al. that during collision essentially ''fast growing ice\nsurfaces charge positively, and conversely, sublimating (graupel)\nsurfaces charge negatively''. However, further dependencies on growth\nvelocities etc. need to be taken into account. The particle collisions\nare mediated by gravity acting on large particles and by turbulent\nconvection within the cloud. Gravity will also move the heavy\npositively charged graupel particles downward while the light positive\nice crystals move upward with the convective flow of the cloud air,\ncreating charge centers and electric fields within the cloud.  This\nparticular charging mechanism is based on the intrinsic polarization\nof water molecules.  Macroscopic particles of different material can\ncharge quite efficiently, too, and create electric fields and\ndischarges. Both volcanic ash plumes, so-called dust devils in\nterrestrial deserts and various granular media in the lab support\ndischarges, as is discussed further in\nSect.~\\ref{s:eldis_solsys}\\ref{ss:volc}.  The understanding of\ncharging processes in volcanic ash plumes might inspire further\nprogress on the long standing question of charging normal\nthunderclouds (\\citealt{yair2008}). Such normal water clouds mixed\nwith dust have recently been observed to exhibit particularly strong\nand exceptional discharges (\\citealt{fuellekrugebeam2013}).\n\nDue to the attachment of ions to water droplets, electric charges in clouds are particularly immobile. The conductivity in the remaining gas phase\nis therefore low before lightning activity starts.  This low\nconductivity (hence low degree of ionization, see also\nFig.~\\ref{tab:comp}) supports a high electric field up to the moment\nof discharging.\n\n\\paragraph{The stages of lightning:}\nLightning is the sudden release of the electric potential energy\nthrough the fast growth of a disperse network of ionized channels.  On\naverage, $44\\pm 5$ lightning flashes (intracloud and cloud-to-ground\ncombined) occur around the globe every second\n(\\citealt{chr2003}). Moreover, according to OTD (Optical Transient\nDetector) measurements, lightning occurs mainly over land areas with\nan average land/ocean ratio of aproximately 10:1\n(\\citealt{chr2003}). The visible growing channels are called lightning\nleaders; their path is prepared by streamer coronae. While streamers\nare space charge driven ionization fronts, leaders maintain their\ninternal conductivity by increased temperature, molecular excitations\nand ionization reactions in the discharge channel. If a\nconducting channel connects cloud and ground, the return stroke\ncarries the largest current and is visible and audible as the\nlightning stroke; but intra- and intercloud lightning are much\nmore likely. The stages of lightning have been described in many articles,\nwith varying emphasis on phenomena or physical mechanisms. A few\nrecent ones are by \\cite{bara2000, coo2003, RakovUman2003, betz2009,\nDwyerUman2014, coo2015}.\n\nA long standing question is how lightning can be initiated because the\nobserved electric fields are below the classical break-down field\n(where electron impact ionization overcomes electron attachment to\noxygen in the Earth atmosphere;\ne.g. \\citealt{treumann2008,hellingjsd2013}), and free electrons are\nnot available anywhere in the atmosphere.  \\cite{Gurevich1992}\nsuggested that cosmic particle showers could supply free electrons,\nand that relativistic run--away electron avalanches could develop in\nan electric field below the classical breakdown\nvalue. \\cite{Gurevich2013} recently suggested that the interplay of a\ncloud particle with Cosmic Rays could start the discharge.  A\nquantitative analysis confirming this scenario is presented\nby \\cite{dubinova2015}.\n\nLightning occurs not only between cloud and ground, but also within\nand between clouds. Also the 'bolt from the blue' is a phenomenon\nwhere a lightning strike seems to appear out of a blue sky next\nto a thundercloud. These strikes are an indication that lightning\nleaders can leave the cloud also at its upper edge or in the sideward\ndirection and then turn downwards.\n\n\\paragraph{Transient Luminous Events:}\nThe full scale discharge activity associated with terrestrial water\nclouds became known in the scientific literature only after 1989 when\nthe first Transient Luminous Events were described (for article\ncollections, see \\cite{full2006,es2008}). Basically, electric\npotential stored in a cloud can also discharge in the upward direction\nas a jet up into the stratosphere or as a gigantic jet that\nextends into the mesosphere. The primary  lightning can drive\nsecondary discharges, namely elves, halos and sprites in the E layer\nof the ionosphere, and in the night time mesosphere (where the D layer\nof the ionosphere is located during day time)\\footnote{The electron\ndensity at these altitudes is an important parameter for discharge\nmodeling. Only recently a method was developed to determine it\npartially and indirectly (\\citealt{Lay2010,Lay2013}).}. Elves and\nhalos are responses of the lower edge of the ionospheric E layer to\nthe electromagnetic pulse and the quasi-static potential of the parent\nlightning stroke, while sprites propagate downward from the ionosphere\ninto the mesosphere (so-called column sprites) and sometimes back up\nagain (carrot\nsprites; \\citealt{Nielsen2008}, \\citealt{luque2009}). Due to\nsimilarity relations between discharges at different atmospheric\ndensities (\\citealt{pasko2007,EbertJGR2010}), tens of kilometers long\nsprite discharge channels in the thin upper atmosphere are physically\nsimilar to cm size streamer discharges at normal temperature and\npressure - up to corrections due to different electron attachment and\ndetachment reactions that can explain long-delayed sprites\n(\\citealt{luque2012}).  Sprites are  pure streamer discharges\n(\\citealt{liu2004a,liu2004b}), and therefore are less complex than lightning\nstrokes with their streamer, leader and return stroke stages, \nevolving on very different scales of space, time and energy. Due to\nthe efforts of many authors in the past 20 years, the models for\nstreamer discharges are now becoming more quantitative, so that we now\napproach the quantitative understanding  of sprite discharges\nthrough detailed modelling and experimental efforts (\\citealt{nij2014a})\n\n\n\\paragraph{Gamma-Ray Flashes and other high energy emissions from thunderstorms:}\nIn 1994, the BATSE\\footnote{http://gammaray.nsstc.nasa.gov/batse/}\nsatellite detected gamma radiation from earth, and it was recognized\nthat this radiation came from thunderstorms\n(\\citealt{fish1994,fish1995}).  Later also beams of electrons (\\citealt{dwyer2008}) and even\npositrons (\\citealt{Briggs2011}) were discovered from satellites . The\nFermi Gamma-Ray Space Telescope detected a clear positron annihilation\nsignal over Egypt from a thunderstorm over Zambia where the two events\nwere connected in space and time through a geomagnetic fields line\n(that electrons and positrons follow sufficiently high in the\nionosphere where collisions with air molecules is\nnegligible; \\citealt{Briggs2011}). High energy X-rays were also\ndetected from lightning leaders approaching ground and from long\nsparks in the laboratory, see, e.g. \\cite{Kochkin2012}. We refer to\nthe review by \\cite{DwyerUman2014}.  It is clear that electrons are\naccelerated into the run-away regime within the electric fields inside\nand above the thunderstorm, where they continuously gain more energy\nfrom the field than they can lose in collisions with neutral air\nmolecules. These collisions with molecules result in X- or gamma ray\nemission (Bremsstrahlung). The gamma-rays are ionizing radiation and\ngenerate electron positron pairs, or liberate neutrons or protons in\nphotonuclear reactions (\\citealt{Babich2014}).\n\nThere are two basic mechanisms discussed in the literature for the\nprimary electron acceleration: either Galactic Cosmic Rays with\nsufficient energy to penetrate deep into the atmosphere and to\ngenerate relativistic run-away electrons avalanches (RREAs) in the\nelectric fields inside the thundercloud, or the acceleration of low\nenergy free electrons into the high-energy run-away regime at the tip\nof a lightning leader where electric fields are very high. The review\nby \\cite{DwyerUman2014} favors the RREA mechanism, in agreement with\nthe previous model development by the first author. The alternative is\nthe runaway of thermal electrons at the leader tip suggested\nby \\cite{Xu2012}. Such detailed models depend on the model parameters\nfor the background cloud field and its geometry, on the altitude of the\nlightning leader, but also on the collision cross-sections at the\nrequired energies that are  not reliably available.\n\n\\cite{fuellekrugebeam2013} reported on the observation of two consecutive positive lightning discharges\nwhere the first positive lightning discharge initiates sprite\nstreamers which discharge the lightning electromagnetic field above\nthe thundercloud. This was seen as a pulsed discharge event followed\nby a high-energy electron beam. A small number of stratospheric,\ncharged aerosols was likely present as result of a Sahara dust storm\nand forest fires in Spain providing a collimating electric field\ngeometry that accelerated the electrons.  This is the first\nsimultaneous detection of radio signatures from electrons accelerated\nto thermal and relativistic energies above thunderclouds. \n\n\n\n\n\n\\subsection{The Wilson Global Circuit}\\label{ss:globcirc}\n\nThe vertical structure of conductivity in the atmosphere, with the\nupper and lower conducting regions each able to sustain a local\npotential, allows a vertical potential difference to exist between the\ntwo regions. Investigations using balloon measurements from the late\n1800s showed a variation in potential with atmospheric  height (\\citealt{nicoll2012}), with\nthe upper conducting region being about 250kV positive with respect to\nthe lower conducting region. The finite conductivity of the\nintermediate atmosphere between these charged regions allows a\nvertical current to flow. This current was observed directly by CTR\nWilson (\\citealt{wilson1906}) in fair weather conditions with no local charge\nseparation. CTR Wilson concluded that the current flow was likely to\nbe sustained by charge separation in distant disturbed weather\nregions. Evidence supporting this is that the diurnal variation in\nUniversal Time (UT) near-surface electric field, measured under fair\nweather conditions, is independent of where it is measured globally,\nand shows strong similarities with the diurnal variation in active\nglobal thunderstorm area (\\citealt{whipple1936}). This diurnal\nvariation in surface atmospheric electric field is known as the\nCarnegie curve, after the sailing vessel on which the original\ndefining measurements were made (\\citealt{harr2013}).\n\nThe conceptual model that described the electrical transport across the\nplanet between disturbed weather and fair weather zones - the global\natmospheric electric circuit (\\citealt{wilson1921, wilson1929}) - has provided a\nfruitful description for investigation of terrestrial atmospheric\nelectrification, which may offer useful insights for other atmospheres\n(\\citealt{aplinh2008}). Although the original reasoning used to identify\nthe global circuit was based on current flow considerations, the wide\nrange of timescales of the contributing processes leads to a\ndistinction being made conventionally between the AC and DC global\ncircuit (\\citealt{rycroft2012}).\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.7}{\\includegraphics[angle=0]{GH_fig4.png}}\n\\caption{Schematic depiction of the role of ionization from Solar Energetic Particles (SEP), Relativistic Electron Precipitation (REP) and Galactic Cosmic Rays (GCR), in facilitating the current flow within the global atmospheric electric circuit. Natural sources of radioactivity include isotopes within the soil and the release of radon (from \\cite{nicoll2014}).}\n\\label{fig:GH4}\n\\end{center}\n\\end{figure}\n\\paragraph{The AC global circuit:}\nThe upper and lower conducting regions of the terrestrial atmosphere\nform a simple waveguide, in which electromagnetic waves can propagate,\nas originally predicted by Schumann\n(\\citealt{schumann1952}). Lightning provides a source of such\nelectromagnetic radiation to excite waves in this cavity oscillator,\nand natural resonances with a fundamental mode at about 8Hz as\npredicted were first observed at the earth's surface in the 1960s\n(\\citealt{balser1960, rycroft1965}). These natural resonances in the\nearth-ionosphere cavity (Q resonator) constitute the AC global\nelectric circuit. Somewhat surprisingly, resonances at 8, 14, 20 Hz\nare also observed on satellites at altitudes of several hundred km,\nabove the ionosphere (\\citealt{simoes2011,dudkin2014}). Although\nthe electric field measured is much smaller at a satellite platform\ncompared with ground based measurements (three orders of magnitude\nsmaller for the first Schumann peak), the fact that it is detectable\nat all offers the possibility for fly-by measurements at other\nplanetary bodies.\n\n\n\\paragraph{The DC global circuit:}\nFigure~\\ref{fig:GH4} summarizes the DC current flow in the Wilson\nglobal circuit. Charge separation in disturbed weather regions leads\nto current flow within the ionosphere, fair weather regions and\nthe planetary surface. The vertical conduction current density,\n$J_{\\rm c}$, in fair weather regions is  $\\sim$2pA m$^{-2}$,\nwhere the resistance of a unit area column of atmosphere, $R_{\\rm c}$,\nis about 100 to 300 P$\\Omega$m$^2$ (\\citealt{rycroft2000}). If\nhorizontal layers of cloud or particles are present, the electrical\nconductivity is reduced because of the removal of the ions providing\nthe conductivity by the particles. Hence, for a passive particle\nlayer, this means that the layer also defines a region of reduced\nconductivity. If a current passes vertically through the passive\nparticle layer (PPL), charging will result at the step change in\nconductivity at the upper and lower layer boundaries. The charging can\nbe derived by assuming no horizontal divergence of the current (as is\nobserved, \\citealt{gring1986}), and assuming Ohm's Law and Gauss' Law\nin one dimension. For a conductivity $\\sigma_{\\rm t}(z)$ varying with\nheight $z$, the charge per unit volume $\\rho_{\\rm e}$ is given\nby \n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\maketitle\n\\tableofcontents\n\n{\\bf Abstract:} Detailed observations of the solar system planets\nreveal a wide variety of local atmospheric conditions. Astronomical\nobservations have revealed a variety of extrasolar planets none of\nwhich resembles any of the solar system planets in full.  Instead, the\nmost massive amongst the extrasolar planets, the gas giants, appear\nvery similar to the class of (young) Brown Dwarfs which are amongst\nthe oldest objects in the universe.  Despite of this diversity, solar\nsystem planets, extrasolar planets and Brown Dwarfs have broadly\nsimilar global temperatures between 300K and 2500K. In consequence,\nclouds of different chemical species form in their atmospheres.  While\nthe details of these clouds differ, the fundamental physical processes\nare the same. Further to this, all these objects were observed to\nproduce radio and X-ray emission. While both kinds of radiation are\nwell studied on Earth and to a lesser extent on the solar system\nplanets, the occurrence of emission that potentially originate from\naccelerated electrons on Brown Dwarfs, extrasolar planets and\nprotoplanetary disks is not well understood yet.  This paper offers an\ninterdisciplinary view on electrification processes and their feedback\non their hosting environment in meteorology, volcanology, planetology\nand research on extrasolar planets and planet formation.\n\n\\begin{figure}[ht]\n\n\\centerline{\n\\includegraphics[width=\\textwidth]{SunMBDwarfJupiter_crop.pdf}}\n\\caption{The large context: Planets are the coldest and smallest objects in the universe\n  known to possess a cloud-forming and potential life protecting\n  atmosphere. Brown Dwarfs are as cool as planets but\n  they form like stars (like the Sun) through the collapse of a\n  gravitational unstable interstellar cloud. Planets (like Jupiter and\n  Earth) form as by-product of star formation in protoplanetary\n  disks. Note that the lower temperature boundary is not yet well determined.}\n\n\\label{fig:SMDP}\n\\end{figure}\n\n\\newpage\n\n\\section{Introduction}\nThe Earth and the solar system planets were the only planetary\nobjects known until the discovery of the first brown dwarf GD165B\n(\\citealt{1988Natur.336..656B}) and the first extrasolar planet in\n1992 (orbiting the pulsar PSR1257+12,\n\\cite{1992Natur.355..145W}). Earth, Jupiter, and Saturn are cloudy\nsolar system planets for which atmospheric discharges in form of\nlightning is confirmed observationally in radio and in optical\nwavelengths. Space exploration and ground based observations have\nshown that lightning is a process universal in the solar system, but\nalso that charge and discharge processes occur in a large diversity on\nsolar system planets. Charging and discharging  processes are\nessential for our understanding of the origin of our planet and maybe\neven for the origin of life: It is believed that charged dust is\nrequired to form planets and that lightning opens chemical paths to\nthe formation of biomolecules. The purpose of this paper is \nto point out overlapping interests in electrifying media that\ncontain liquid and solid particles in meteorology, volcanology, solar\nsystem objects, extrasolar planets, brown dwarfs and protoplanetary\ndisks. We therefore provide a selective overview of atmospheric\nelectrification processes and related electrical phenomena based on\nknowledge from solar system and Earth observations, and on lab-based\nresearch in combination with relevant findings and development in\nresearch on extrasolar planets, brown dwarfs and protoplanetary\ndisks. We hope to stimulate a closer interaction between these\ncommunities.\n\nThe last few decades have taken us from a Universe with only a single\nplanetary system known, to one with thousands, and maybe millions, of\nsuch systems.  We are now entering the time when we explore theories\nand results derived for the solar system and for Earth in application\nto unknown worlds.  Figure~\\ref{fig:SMDP} places Jupiter, one of the\nsolar system giant gas planets, into the astrophysical context:\nJupiter (right) is compared to the coolest stellar objects (M-dwarfs\nand Brown Dwarfs).  Brown Dwarfs bridge the stellar (represented by\nthe Sun in Fig.~\\ref{fig:SMDP}) and the planetary regime as their\natmospheres can be as cold as those of planets but they form like\nstars. The Sun (left) is surrounded by hot plasma (corona) while\nplanets are enveloped in a cold cloud forming atmosphere some of which\nexhibit electrical phenomena as part of a global electric circuit. The\nSun is intensively studied by satellites like\nSOHO\\footnote{http://sci.esa.int/soho/} and\nHINODE\\footnote{http://www.nasa.gov/mission$\\_$pages/hinode} leading\nto efforts like SWIFF for space weather forecasting\n(\\citealt{lapenta2013}). Comparable high-resolution monitoring is\nneither feasible for solar system planets, moons or comets nor for\nextrasolar objects. Instead, experimental work on Earth, Earth\nobservation, modelling and comparative studies for the solar system\nand extrasolar objects need to be combined; examples for Earth studied\nas extrasolar planet are e.g. in \\cite{kitzmann2010,kaltenegger2013}\nand \\cite{hod2016}.\n\n\n\\begin{figure}\n{\\ }\\\\*[-4cm]\n\n\\begin{tabular}{p{4.0cm} p{4.5cm} p{4.0cm}}\n\\centering  Earth (NASA) & \\centering Saturn (ESA) & \\begin{minipage}{3.7cm}\\centering Brown Dwarfs \\end{minipage}\\\\\n\\begin{minipage}{3.7cm}\n\\centering\n\\includegraphics[width=3.2cm]{NASA_Earth_Eastern_Hemisphere.pdf} \n\\end{minipage}\n&\n\\begin{minipage}{4.0cm}\n\\centering\n \\includegraphics[width=3.2cm]{ESA_Hubble_Saturn.pdf}\n\\end{minipage}\n&  \n\\begin{minipage}{3.7cm}\n\\centering\n\\includegraphics[width=4.2cm]{T-dwarf-nasa-hurt.pdf}\n\\end{minipage}\\\\\n\n\\multicolumn{3}{c}{\\ }\\\\*[-0.2cm]\n\\multicolumn{3}{c}{radiation fluxes $F(\\lambda)$:}\\\\*[-0.2cm]\n\\begin{minipage}{3.7cm}\n\\centering\n\\hspace*{-1cm}\\includegraphics[width=4.6cm]{EarthSpec.pdf}\n\\end{minipage}\n& \n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{-0.2cm}\n\\hspace*{-0.5cm}\\includegraphics[width=4.65cm]{SaturnSpectrumPlot.pdf} \n\\end{minipage}\n&\n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{-0.2cm}\n\\hspace*{-2.0cm}\\includegraphics[width=7.5cm]{dwarfs3.pdf}\n\\end{minipage}\n\\\\%*[0.5cm]\n\\multicolumn{3}{c}{\\ }\\\\*[-0.7cm]\n\\multicolumn{3}{c}{atmospheric ($T_{\\rm gas}$, p$_{\\rm gas}$)-structures:}\\\\*[0.2cm]\n\\begin{minipage}{3.7cm}\n\\centering\n\\hspace*{-1.3cm}\\includegraphics[width=4.6cm]{ComparativePlot_Earth_TgasPgas.pdf}\n\\end{minipage}\n&\n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{-0.2cm}\n\\hspace*{-0.8cm}\\includegraphics[width=5.3cm]{Saturn_temperatureALuque.pdf} \n\\end{minipage}\n&\n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{0.25cm}\n\\hspace*{-0.6cm}\\includegraphics[width=5.0cm]{BD_T-p_magenta.pdf}\n\\end{minipage}\n\\\\\n\\multicolumn{3}{c}{\\ }\\\\*[-0.3cm]\n\\multicolumn{3}{c}{local degree of ionization $f_{\\rm e}=\\frac{p_{\\rm e}}{p_{\\rm gas}}$}\\\\*[0.1cm]\n\\begin{minipage}{3.7cm}\n\\vspace*{0.3cm}\n\\centering \\hspace*{-1.3cm}\\includegraphics[width=4.6cm]{ComparativePlot_Earth_fe.pdf}\n\\end{minipage}\n&\n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{-0.2cm}\n\\hspace*{-0.8cm}\\includegraphics[width=5.3cm]{Saturn_ionizationALuque.pdf} \n\\end{minipage}\n& \n\\begin{minipage}{4.0cm}\n\\centering\n\\vspace*{0.25cm}\n\\hspace*{-0.6cm}\\includegraphics[width=5cm]{BD_fe-p_magenta.pdf}\n\\end{minipage}\n\\end{tabular}\n\\caption{This figure shows the spectrum of emitted radiation, $F(\\lambda)$, \nthe temperature profile as a function of pressure going up into the\n  atmosphere, ($T_{\\rm gas}$, p$_{\\rm gas}$), and the degree of\n  ionisation, $f_{\\rm e}$, as a function of pressure for planet Earth, for Saturn\n  and for two brown dwarfs. The Saturn thermodynamical data are\n  from \\cite{moses2000}, \\cite{moore2004}\n  (solid line) and \\cite{galand2009} (dashed line) were used to derive\n  the degree of ionization [courtesy: Alejandro Luque]. Saturn's\n  disc-integrated spectrum is based on the latest profiles of atmospheric\n  temperature and gaseous composition derived from analysis of Cassini\n  Composite Infrared Spectrometer spectra (\\citealt{irwin2008,\n  fletcher2012}; courtesy: Leigh Fletcher).  The brown dwarf spectra\n   are from \\cite{cushing2005} [courtesy: Sarah Casewell], the\n  atmosphere models from \\cite{witte2011} [courtesy: Isabel\n  Rodrigues-Barrera].}\\\n\\label{tab:comp}\n\\end{figure}\nFigure~\\ref{tab:comp}\n\n\n\n\n\n\n\n\n\n\n\n\n\ncompares images, spectra (disk-integrated radiation flux), atmospheric\n(T$_{\\rm gas}$, p$_{\\rm gas}$)-structures, and the local degrees of\ngas ionization for Earth, Saturn and two types of Brown Dwarfs (L-type\n(pink) -- hotter, and T-type (purple) -- cooler).  All data for Earth\nare from observations, the Saturn data are derived from\nCassini\\footnote{http://sci.esa.int/cassini-huygens/} spacecraft\nobservation, the brown dwarf spectra are observed with SpeX on\nIRTF\\footnote{http://irtfweb.ifa.hawaii.edu/~spex/}\n(\\citealt{cushing2005}), and the (T$_{\\rm gas}$, p$_{\\rm gas}$)- and\nthe $f_e$-structure are results from atmosphere simulations. \n$f_e$ refers to the local degree of ionisation and is defined as\n$f_{\\rm e}=p_{\\rm e}/p_{\\rm gas}$ with $p_{\\rm e}$ and $p_{\\rm\ngas}$ the local electron and the local gas pressure, respectively.\nThe Earth image is a photograph taken from the International Space\nStation. The Saturn image is a visible light image taken by the\nCassini space craft, and the brown dwarf image is an artist's\nimpression based on atmosphere simulations. No direct image exists for\nany brown dwarf because the nearest brown dwarfs (the binary system\nLuhman 16) is 6.59 light years away from Earth.  All three classes of\nobjects have chemically and dynamically active atmospheres that form\nclouds and that  may be undergoing local charge and discharge\nevents. Their local atmospheric conditions differ, including the\nchemical composition, as result of their formation history and the\nirradiation received from a host star.  Interdisciplinary research\ncombining plasma physics, meteorology, volcanology, solar\nsystem exploration and astrophysics as suggested in\n(\\citealt{fuelle2013}) is required to study weather phenomena on\nEarth, solar system planets and on extrasolar planetary objects also\nin view of upcoming space missions like\nCHEOPS\\footnote{http://sci.esa.int/cheops/}, \nPLATO\\footnote{http://sci.esa.int/plato/} and JWST\\footnote{http://jwst.nasa.gov/}.\n\n\nPlasma and discharge experiments are essential in providing a controlled environment\nin contrast to observation of atmospheric phenomena. Such experiments can involve the\nthree different mass components constituting an atmospheric gas:\nelectrons, ions, and dust particles with their masses $m_{\\rm\ne-}<m_{\\rm ion}<m_{\\rm d}$. The mass differences result in different\nspatial effects like ion acoustic waves and plasma crystals. An\natmospheric environment that is only partially ionized may show plasma\ncharacter on only local scales compared to the global scale of the\ncomet, moon, planet, brown dwarfs or protoplanetary disk. One\npotentially far reaching example for the origin of life on Earth are\nvolcanoes (\\citealt{johnsons2008}) which can produce significant\nelectrostatic charging and subsequent lightning during eruption\n(Sect.~\\ref{s:eldis_solsys}\\ref{ss:volc}) on Earth and maybe also on\nJupiter's moon Io for example.  In volcanoes but also in terrestrial\nclouds, particles of similar mass govern the charge and discharge\nprocesses and plasmas form during violent discharge\nonly. Understanding dust charging processes is important for space\nexploration because the local ionization changes as result of the\nvariability of the solar wind hitting the moon's or an asteroid's\nsurface. A spacecraft landing, like Philae, the Rosetta lander, has a\nvery similar effect (Sect.~\\ref{s:solsys}). In situ measurements from\nthe chemically active Earth atmosphere offer insight in charge and\ndischarge processes, their local properties and their global changes\n(Sect~\\ref{s:eldis_solsys}\\ref{ss:ionization}). While plasma\nexperiments are conducted in a controlled laboratory environment,\nmeasurements inside the uncontrollable Earth's natural atmospheric\nenvironment lead to an understanding of the vertical and horizontal\nionization where the relative importance of electrons, ions and dust,\nhence their total mass relation, changes with atmospheric height. For\nexample, the fair weather current is carried by ions only due to the\nlack of free electrons between 0--60\\,km. Understanding the {\\it\nWilson Global circuit} (Sect.~\\ref{s:eldis_solsys}\\ref{ss:globcirc})\nhelps the understanding of the Earth weather and climate.  Such\nobservations allow an understanding of atmospheric processes on Earth\nthat can only be gained for solar system and extrasolar bodies by\nintensive modelling efforts guided by observations and experiments.\n\nSection~\\ref{s:FCI} provides a short background summary on charge\nprocesses of discrete solid or liquid surfaces in atmospheric gases,\nthe link to laboratory works and an example of related  plasma technology\ndevelopment. Section~\\ref{s:FCI} further sets the stage for this\ninterdisciplinary paper by defining terms used in later\nsections.\n\n Section~\\ref{s:eldis_solsys} summarizes charging and discharging\n processes in the terrestrial atmosphere, including processes in the\n atmospheres of other solar system planets.  Section~\\ref{s:solsys}\n reviews charging processes on moon and asteroids in the presence of\n solar wind and space plasmas, but without substantial neutral\n atmospheres. Section~\\ref{s:exopl} provides insight into astronomical\n observations that suggest that mineral-cloud forming atmospheres of\n brown dwarfs and extrasolar planets are also electrically active,\n that different ionization processes will electrically activate\n different parts of such atmospheres, and that similar processes are\n expected to act in protoplanetary disks. Section~\\ref{s:concl}\n concludes this paper. Each section ends with a list of future works/\n open questions when suitable.\n\n\n\n\\section{Setting the stage for interdisciplinary exchange}\\label{s:FCI}\n\n\nThis section outlines the key concept of this interdisciplinary paper\nand it provides definitions of terms used in\nSects.~\\ref{s:eldis_solsys}\\,-~\\ref{s:exopl}. This section links to\nlaboratory experiments which have driven the understanding of ionised\natmosphere gases that contain or form dust particles or liquid\ndroplets. One example of plasma technology development is included to\ndemonstrate the impact of this paper's theme also beyond academic\nresearch. This section deals with the smallest scales where charge\nprocesses act, later sections will address topics related to\nsuccessively larger-scale charge processes in the terrestrial\natmosphere, on the Moon and asteroids, and also outside the solar\nsystem in extrasolar planets, brown dwarfs and protoplanetary disks.\n\n\n\\subsection{Fundamental charging  processes}\\label{ss:FCP}\n\n\n\n\n\n\n\n\n\n The key concepts in this paper depend on the accumulation and\n  dissipation of electrical charge on discrete solid or liquid\n  surfaces suspended in atmospheric gases. The free charge on the\n  surfaces can arise from two primary mechanisms (in the planetary\n  atmosphere context): processes involving (i) friction (triboelectric\n  charging); and (ii) the transport of free charge (plasma\n  processes). More details on processes specific to various\n  environments like Earth atmosphere, volcanoes or extrasolar planets\n  are provided in the respective subsections\n  (e.g. Sects.~\\ref{s:eldis_solsys}\\ref{ss:ionization},~\\ref{ss:Ute} and ~\\ref{ss:volc}).\n\n\n\\subsubsection{Classical frictional charging}\\label{ss:FCPa}\nTransiently contacting surfaces can lead to charge accumulation, by\nproducing either a surplus or a deficit of electrons compared to\nthe neutral case. Indeed, there is evidence that fragments\nof polymer chains can be exchanged by colliding particles\n(\\citealt{sau2008}), leaving net charges on the\nsurfaces. This process is termed triboelectric charging, and has a\nvery long history of practical application (\\citealt{C4RA09604E}),\neven if the underlying processes are still not entirely resolved. \nOriginally, {\\it contact electrification} was used to refer to electrostatic charge transfer resulting from contact, including contact modes such as detachment, sliding, rolling, impact, etc. The specific charge processes related to rubbing was only later termed as tribo-electrification.\nSuch charging is an inevitable consequence of the frictional interaction\nbetween hard surfaces: electrons transfer (by some process) from one\nsurface to the other, leading to charged surfaces. For example, dust\nentrained in strong, collisional flows (such as volcanic eruptions or\nmineral clouds in extrasolar planets,\nSects.~\\ref{s:eldis_solsys}\\ref{ss:volc} and~\\ref{s:exopl}) will\nacquire charges of different polarity (negative and positive) directly\nfrom the inter-grain collisions themselves. Such macroscopic particles\ncan include ice crystals in atmospheric clouds, where the diversity of\ngrowth rates (and consequent dynamics) of crystals influences the\npolarity of charge transfer, and leads to such clouds becoming charge\nseparated by the relative drift of the charged particles\n(\\citealt{sau2008}). Charge accumulation and\nseparation can lead to energetic relaxation, in the form of lightning.\n\n\\subsubsection{Plasma charging}\\label{ss:FCPb}\nThere is an additional mechanism for forcing charge onto a surface, in\npossibly much larger quantities than can be acquired by triboelectric or contact\nprocesses: plasma charging. A plasma is a gas in which a fraction of\nthe molecules are ionised, leading to an abundance of free charge\nexisting as an additional `gas' component. Though neutral overall,\nthere is a natural scale-length over which the plasma can create large\npotential differences caused by charge population fluctuations: this\nis because free electrons are light and mobile compared to the heavier\npositive ions, and therefore the electrons can temporarily escape\ntheir charged counterparts, leading to charge densities appearing for\nshort intervals, and over restricted distances (this is explained in\ndetail in subsequent sections below). Should an isolated solid (dust\nor crystal) or liquid (aerosol) surface be introduced into this\nplasma, these natural fluctuations in the charge distribution will\ncause such surfaces to acquire surplus free charge, forced onto it by\nthe action of the plasma itself. Isolated surfaces exposed to plasma\nwill quickly (typically on a microsecond timescale or less) charge up\nto reach the plasma or floating potential (\\citealt{Khrapak_etal_2012,\n  Khrapak_Morfill_2008, Hutchinson_Patacchini_2007}), by the action of\na continuous electron current to the surface from the ambient plasma,\nwhich rapidly establishes a negative charge before the compensating\npositive ion current can respond. Ultimately there is a balance\nreached, but one that reflects the relative electron mobility over the\nions.  Since there is so much more free charge available in a plasma\ncompared to triboelectric processes, then there is an enhanced\ncapacity for dust exposed to plasma discharges to store considerable\nsurface charge in comparison to purely collisional interactions\nbetween grains: since the plasma surface charge reflects the plasma\nconditions, and not just the grain chemistry and collisionality, then\nthe plasma is an independent and effective agent for creating charged\nparticles.\n\n\\subsubsection{Defining general terms}\n\n After a summary of the principal mechanisms for charging surfaces in\n gases in Sects.~\\ref{ss:FCPa} and~\\ref{ss:FCPb}, the most important vocabulary used\n throughout the paper is defined below to allow a better understanding\n of the links between the interdisciplinary topics in\n Sects.~\\ref{s:eldis_solsys}\\,-~\\ref{s:exopl}.  Appendix~\\ref{s:AGl}\n provides a glossary.\n\n\n{\\it Dust particles, aerosols, droplets:} An important feature in many\ncharging processes is the presence of macroscopic particles such\n  as dust, aerosols or droplet.  These are macroscopic particles\nlarge enough to move under the influence of gravity. The particle\nsizes can vary by orders of magnitude. They can be liquid or\nsolid. They can be composed of a mix of different materials that\nchanges with temperature.  {\\it Aerosols} are suspended particles\n  of either phase.  Dust is predominant on moon and asteroids, in\nvolcanic lightning and mineral clouds of extrasolar planets and brown dwarfs,\nand as building blocks for planets in protoplanetary disks. Also\nhydrometeors (droplets, graupel and ice particles, snowflakes\n$\\ldots$) could fall into this category, but are considered aerosols\nin geoscience. Macroscopic particles as dust and aerosols can be\nelectrically charged which de-mobilizes the charge that previously\nresided in the gas in form of electrons or ions. Dust, for example,\nwill acquire a negative total charge in the absence of external\ninfluence like stellar UV radiation.\n\n\n\n\n\n\n\n{\\it Ionization} is the process of dissociating neutrals into charged\nspecies, due to a variety of mechanisms: electron impact ionization,\nPenning ionization (ionization through chemical reactions), direct\ndissociation by strong electric fields, UV-photo-ionization.  The\ntotal electric charge is conserved during ionization, but once the\ncharges are free they can move independently.  In air (the atmospheric\ngas on Earth with its electronegative oxygen component) free electrons\nare very short lived in the absence of strong electric fields. Ionized\nair in the Earth troposphere and stratosphere consists of positive and\nnegative ions. The fair weather currents on Earth are ion currents\n(see Sect.~\\ref{s:eldis_solsys}\\ref{ss:globcirc}).\n\n{\\it Plasma} is a gas consisting of charged particles. It is often\nrestricted to charged particle gases where collective phenomena, like\nplasma oscillations, are more important than collisional phenomena. A\n{\\it plasma} is created if there is sufficient ionization of neutrals\nthat charged particle density becomes significant.\n\nA plasma is characterized by the capacity to produce a collective\nself-field that is significant when compared to any imposed field\n(such as that produced by external electrodes, or induced by\ncollapsing magnetic fields, or by impinging electromagnetic\nradiation). An electrically neutral medium is created that can respond\nto an external electromagnetic field, but there is no spontaneous\ncharge separation in equilibrium on scale-lengths greater than the\nDebye length\\footnote{The Debye length is the length beyond which the\n  Coulomb force of a charge can not affect other charges. Strictly,\n  the Debye length is the e-folding distance within which charge\n  neutrality is not guaranteed, because thermal fluctuations can\n  displace electrons relative to positive ions, leaving a small net\n  charge.}.  There is a significant distinction between plasmas which\nare collisionless, and those which are collisional\\footnote{These\n  terms refer to approximations made in the plasma kinetic gas theory\n  where the Boltzmann equation describes the evolution of the particle\n  distribution function $f(\\vec{x}, \\vec{v}, t)$. Neglecting the\n  collisional source term of the Boltzmann equation leads to the {\\it\n    collisionless Boltzmann equation} ({\\it Vlasov equation}) from\n  which then the MHD equations are derived, and the electric and\n  magnetic field strength are derived as macroscopic quantities. In a\n  collisional plasma, the full Boltzman equation is to be solved.}:\n1) Collisionless plasmas consist mainly of positively charged ions and\nof electrons or negatively charged ions, depending on the\nelectronegativity of the ionized gas. They interact through\nelectromagnetic fields rather than through mechanical collisions.\nExamples are the magnetosphere and the interplanetary plasma\n(Sect.~\\ref{s:solsys}) where the assumption of ideal MHD holds.  2) In\na collision dominated plasma, the motion of charged particles is\ndominated by collisions with neutral atoms and molecules, rather than\nby the direct electromagnetic interaction with other charged\nparticles.  The transiently existing plasmas in the terrestrial\ntropo-, strato- and mesosphere up to the E layer of the ionosphere\nare mostly collision dominated plasmas, except for the highly ionized\nand hot lightning return stroke channel.\n\n\n\n\n\n\n\n\n{\\it Charging or Charge separation} will be used for the process where\nmacroscopic particles like dust or aerosols are charged. This can\noccur in particle collisions (in thundercloud electrification,\ndust devils in deserts, volcanic lighting) in non-ionized atmospheres\nor in vacuum, or by attaining charge from a plasma (e.g. in dusty\nplasmas) spontaneously due the different mobility of the charged\nspecies, in ambipolar diffusion, for example.\n\n\n\n\n\n\n\n\nIf mechanical forces (gravity, convection) that act on the charged\ndust particles are stronger than the electric forces, charges can be\nseparated over a certain distance. An electric potential builds up\nthat can discharge by lightning and the related transient luminous\nevents.\n\n\n{\\it Electrification} is understood as the processes leading to\ncharging of dust or other macroscopic particles obeying both polarity\nand charge conservation. As a result, a macroscopic electric field\ncan build up. Sometimes used synonymously with {\\it Charging or Charge separation}.\n\n\n\n\n\n\n\n\n\n\n\n\n\n{\\it Discharging} is the process where the electric potential is\nreleased by electric currents. This can happen continuously, or\nthrough a rapid transition like the rapid growth of discharge channels\nin lightning discharges. Emission of high energy radiation can be\nassociated with the rapid channel growth. \n\n\n\n\\subsection{Charged dust in experimental work}\\label{s:exp}\n\nDust in plasmas has a long history - one which is even more relevant\nin contemporary planetary exploration. This section explores the\nphenomena associated with dust interacting with ionization in the\nambient atmosphere to ensure non-equilibrium processes (both physics\nand chemistry) have a significant and enduring influence on the\nevolution of the atmosphere in general, including the dust itself. The\ndiscussion here ranges over the impact of charged dust imposing a\nlong-range order in confined plasmas, through to micro-discharges\narising from binary encounters between freely-floating charged\naerosols, releasing low-energy free electrons into the ambient\natmosphere, with all the possibilities that this entails for molecular\nactivation by dissociative attachment and radical formation. The\ncommon theme throughout is the capacity - literally - for dust to\nretain the electrostatic memory of ambient discharges via free-charge\nacquisition, and for that discharge legacy to be reshaped and realised\nin potent form by harnessing hydrodynamical forces on fluid\ntimescales, rather plasma ones. In this way, transient plasma effects\ncan be stored, reconfigured and released on meaningful scales in such\na way as to have a tangible influence on large-scale evolution of\nplanetary atmospheres. The following sections discuss dust-plasma\ninteractions in  (i) laboratory plasma dust, where floating\nparticulates can be a help or a hazard in plasma applications,\nincluding plasma crystals, and in  (ii) the dynamic evolution of charged aerosols,\nwhere fluid deformation and evaporation can moderate the evolution of\nencapsulated targets.\n\n\n\n\n\n\n\n\\subsubsection{The plasma laboratory: Dusty plasmas and plasma crystals}\\label{ss:plph}\n\n\\input{2Dusty_Plasma}\n\n\\input{2Bacteria}\n\n\n\n\\section{Electrification and discharging in terrestrial and planetary atmospheres}\\label{s:eldis_solsys}\n\n When we aim to understand electrification and electric phenomena in\n weakly ionized atmospheres of extrasolar planets, a characterization of the\n phenomena on Earth and in the atmospheres of solar system planets can\n provide guideline and inspiration. This section therefore starts with\n an overview of the main electrical processes in the terrestrial atmosphere\n up to the ionosphere, the fair weather currents and the thunderstorms\n with transient luminous events and terrestrial gamma-ray flashes.\n Then we continue with  lightning phenomena in volcanic\n ash plumes and review a few processes in the atmospheres of other\n solar system planets. For more details see  \\cite{RakovUman2003, Planets2008} and \\cite{DwyerUman2014, betz2009, full2006, es2008}.\n\n Ionization and electric currents in the terrestrial atmosphere are\n driven by two main mechanisms: a) The atmosphere is very weakly\n ionized by external sources like Cosmic Rays and radioactivity\n (Sect.~\\ref{s:eldis_solsys}\\ref{ss:ionization}).  The resulting\n conductivity supports the fair weather currents that relax electric\n potentials in atmospheric regions far from thunderstorms.  b)\n Thunderclouds play a particular role in separating electric charges\n and in building up large electric potentials\n (Sect.~\\ref{s:eldis_solsys}\\ref{ss:Ute}). Cloud particles first\n exchange charge during collisions, and are then separated due to\n mechanical forces (such as gravity and convection) larger\n than the attractive electric forces between particles of opposite\n polarity.  For this reason, meteorologists use lightning flashes as\n indicators for strong turbulent convection in the atmosphere.  When\n these electric potentials suddenly discharge, a variety of ionized\n and conducting channels is formed through localized ionization\n processes (collisional, thermally driven or photon impact). In the\n first stage of a discharge, these ionization reactions are driven by\n strong electric fields and local field enhancement and are dominated\n by the impact of fast electrons on neutral atoms or molecules, while at later\n stages Ohmic heating and thermal equilibration create\n temperature driven ionization reactions.\n\n\n\\subsection{Ionization of the terrestrial atmosphere outside thunderstorm regions}\\label{ss:ionization}\n\nIn common with other solar system atmospheres\n(\\citealt{harrison2008}), the earth's lower atmosphere outside\nthunderstorm regions is made electrically conductive by the ionising\naction of high energy particles generated within the heliosphere\n(e.g. solar energetic particles, SEPs) and beyond (e.g. galactic\ncosmic rays, GCRs). A consequence of the terrestrial atmosphere's\nsmall but finite conductivity ($\\approx 10^{-14}$ S\\,m$^{-1}$ in\nsurface air, see also Fig.~\\ref{fig:GH3}) is that current flow can\noccur through the atmosphere, between disturbed weather and fair\nweather regions. Similar circumstances occur in other atmospheres,\ndepending on the existence of charge separation processes and the\natmospheric conductivity.\n\nIon production in the earth's lower atmosphere (i.e. the troposphere\nand stratosphere) results from a combination of terrestrial and\nextra-terrestrial sources. Near the planet's continental surfaces, the\neffects of natural radioactivity contained within the soil and rocks,\nor released in the form of radioactive gases such as radon, provide\nthe dominant source of ion production. At heights from 3 to 5 km above\nthe continents (i.e. above the boundary layer where eddy diffusion of\nradon isotopes occurs which depend on orography), or over the oceans,\nextra-terrestrial sources, principally GCR, dominate the ion\nproduction, while SEPs and UV irradiation dominate the ionisation in\nthe ionosphere, but typically do not have sufficient energy to reach\nthe troposphere.\n\n\\begin{figure}\n{\\ }\\\\*[-4cm]\n\\begin{center}\n\\scalebox{0.6}{\\includegraphics[angle=0]{GH_Fig1.pdf}}\\\\*[-2cm]\n\\caption{Vertical profile of the ionisation rate, $q_{\\rm STP}$ [cm$^{-3}$s$^{-1}$], \nper volume of terrestrial atmosphere normalised to standard\ntemperature and pressure, as (a) originally obtained by Hess (7th\nAugust 1912), with the ionisation rate at each height shown relative\nto the measured surface ionisation rate at sea level and, (b) from a\nseries of balloon flights (colours used to identify individual\nflights) made from Reading, UK during 2013.\n\n\n\n}\n\\label{fig:GH1}\n\\end{center}\n\\end{figure}\n\n\\paragraph{Balloon-borne measurements:} \nVertical soundings of the ion production rate in the troposphere and\nstratosphere (i.e. to about 35km) can be made using balloon-carried\ninstruments\\footnote{The atmosphere above this altitude is sometimes\ncalled ignorosphere, because above balloon and below satellite\naltitudes it is very difficult to explore. In particular, the density\nof free electrons in the lower ionosphere can now be measured only\nindirectly through the pattern of electromagnetic radiation that is\nemitted by lightning strokes and reflected by the ionosphere\n(\\citealt{Lay2010,Lay2013}).}.  Historically this was the original\nairborne platform through which the existence of the cosmic source of\nionisation was confirmed, in a manned balloon flight made by Victor\nHess on 7th August 1912 (\\citealt{hess1912}). This flight carried\nionisation chambers and fibre electrometers, in which the rate of\ndecay of the charged fibre was recorded visually and the ion\nproduction rate inferred (\\citealt{pfotzer1972}). Hess found that the\nion production rate initially diminished with height, but then began\nto increase (Fig.~\\ref{fig:GH1} (a)). This subsequent increase\nindicated that ionisation was originating from\nabove. Figure~\\ref{fig:GH1} (b) shows a profile of the ion production\nrate per unit volume at standard temperature and pressure, $q_{\\rm\nSTP}$, made using a modern balloon-carried Geiger counter (or\nGeigersonde) launched from a mid-latitude site (details are given\nin \\citealt{harr2014}). This shows the same increase in ionisation\nobserved by Hess at the lower altitudes, but the modern balloons\nextend the measurements to greater altitudes. A characteristic feature\nis the maximum in ionisation at about 20km, first\nobserved \\cite{regener1935}. The presence of the Regner-Pfotzer\nmaximum results from a balance between the energy of the incoming\nparticles, and the density of the atmosphere.\n\nA long series of regular Geigersonde measurements has been made by the\nLebedev Institute in Moscow, using a variety of sites including\nMoscow, Murmansk and Mirny (Antarctica). The value of this stable\nlong-term measurement series is considerable, as, by taking advantage\nof the different geomagnetic latitudes of the sites concerned, it\nallows features of the cosmic ray ionisation to be established. Cosmic\nrays\\footnote{'Cosmic rays' here also referes to energetic particles\noriginating from the solar wind and from outside the solar system\n(galalctic cosmic rays). For more information on the astrophysical\ncontext, on the origin of cosmic rays, the energy-dependent cosmic ray\nflux, and their effect on atmospheric chemistry see,\ne.g. \\cite{rimmer2013, rimmer2014}, Rimmer, Helling \\& Bilger (2014)  and for the solar\nsystem see, e.g. \\cite{baz2015} and referenes therein. See,\ne.g. \\cite{Ihongo2016} for the effect of the solar wind onto the galactic\ncosmic ray flux at Earth.} follow the geomagnetic field lines, and the\nlower energy particles are able to enter at higher latitudes (which is\nexpressed as a lower geomagnetic rigidity). The high energy CR\nparticles survive for longer (i.e. penetrate deeper in the atmosphere)\nin the Earth atmosphere, while the low energy CR particles are\ncompletely absorbed soon after they enter the atmosphere.\nFigure~\\ref{fig:GH2} shows a long times series of Geigersonde\nmeasurements made at the Regner-Pfotzer maximum, from sites with\ndifferent rigidity (\\citealt{stozhkov2013}). The 11 year (Schwabe)\ncycle in solar activity is clearly present through the inverse\nresponse in GCRs, and, at the high latitude sites, the exceptional\nnature of the cosmic ray maximum in 2010/11 associated with the deep\nsolar minimum, is particularly apparent.\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.4}{\\includegraphics[angle=0]{GH_Fig2.png}}\n\\caption{Time series of monthly averages of cosmic ray fluxes, $N_{\\rm m}$ [cm$^{-2}$s$^{-1}$], measured at the height of the Regner-Pfotzer maximum. Curves show measurements made at northern polar latitude (geomagnetic rigidity $R_{\\rm c} =$ 0.6 GV, green curve), southern polar latitude in Antarctica ($R_{\\rm c} =$ 0.04 GV, blue curve) and at the mid-latitude location of Moscow ($R_{\\rm c} =$ 2.4 GV, red curve). The  CR flux increase since 2010 can be seen from the comparison provided by the dashed lines, which mark the cosmic ray levels in1965\n(from \\citealt{stozhkov2013}).}\n\\label{fig:GH2}\n\\end{center}\n\\end{figure}\n\n\n\\paragraph{Atmospheric conductivity:}\nCosmic ray ionisation in the terrestrial atmosphere sustains a steady source of cluster ions, which provide the finite conductivity of air. The total conductivity, $\\sigma_{\\rm t}$, is given by\n\n", "index": 1, "text": "\\begin{equation} \n\\sigma_{\\rm t} = e \\, (\\mu_+n_+ +\\mu_- n_-)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm t}=e\\,(\\mu_{+}n_{+}+\\mu_{-}n_{-})\" display=\"block\"><mrow><msub><mi>σ</mi><mi mathvariant=\"normal\">t</mi></msub><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mi>e</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>μ</mi><mo>+</mo></msub><mo>⁢</mo><msub><mi>n</mi><mo>+</mo></msub></mrow><mo>+</mo><mrow><msub><mi>μ</mi><mo>-</mo></msub><mo>⁢</mo><msub><mi>n</mi><mo>-</mo></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04594.tex", "nexttext": " where $J_{\\rm c}$ is the vertical current density and\n$\\epsilon_0$ is the permittivity of free space. Figure~\\ref{fig:GH5}\nshows calculations of the charging for a PPL of prescribed\nconcentration and size. This leads to a reduction in the concentration\nof positive and negative ions in the same region. The gradients in\nconductivity at the PPL boundaries allow the charge density to be\nderived, either in terms of the mean charge calculated across the\nparticles, or as a particle charge distribution\n(Fig.~\\ref{fig:GH5}). The charging expected at the PPL edges is\nclearly evident and similar charging effects have been observed at the\nboundaries of layer clouds in the terrestrial atmosphere\n(\\citealt{nicoll2010}).\n\\begin{figure}\n\\hspace*{-2cm}\\scalebox{0.8}{\\includegraphics[angle=0]{GH_fig5.pdf}}\\\\*[-9cm]\n\\caption{Simulated effect of a horizontal layer of particles through which a current flows. The panel show profile of: (upper left panel) prescribed particle size and concentrations, (upper right panel) number concentrations of positive ($n_+$, dashed red line) and negative ($n_-$, solid blue line) small ions, (lower left panel) mean charge on particles and (lower right panel) particle charge distribution evaluated at the three positions marked on the lower left panel with dashed lines. (Assumptions: ion production rate 10 ions cm$^{-3}$s$^{-1}$, vertical conduction current density 2 pA m$^{-2}$.)}\n\\label{fig:GH5}\n\\end{figure}\n\\paragraph{Conditions for global circuits:}\nThe existence of global circuits in planetary atmospheres has been\nsuggested through possible analogies with the earth system, in which\ncurrent flows between charge-separating and non-charge-separating (or\n''fair weather'') regions, through the enhanced conductivity zones\nprovided by the planetary surface and the upper atmosphere\n(\\citealt{aplin2006, aplin2013}). Entirely different electrical\nprocesses may be involved, such as in the global circuit suggested for\nMars (\\citealt{filling86,farrell2001}) which is driven by dust, or be\nassociated with volcanic dust electrification\n(\\citealt{houghton2013}).  The basic electrical requirements for a\nplanetary global circuit have been discussed by \\cite{aplinh2008},\nwhich are\n\\begin{itemize}\n\\item upper and lower conductive regions\n\\item charge-separating processes\n\\item current flow\n\\end{itemize}\nImplied necessary conditions are (1) a sufficiently strong\ngravitational field to retain a gaseous atmosphere, and (2) proximity\nto energetic sources of radiation (e.g. a host star or a binary\ncompanion) which can form ionized layers in the atmosphere \nultraviolet and X-ray regions of the spectrum to create an\nionosphere. Table~\\ref{tab:GH} summarizes the possible approaches\nwhich might be used to detect these necessary requirements.\n\n\\begin{table}\n\\caption{Possible detection methods for the key requirements of a global circuit in a planetary atmosphere.}\n\\begin{tabular}{l|c|c|c|c}\n\\hline\n{\\it  Requirements:} & \\multicolumn{2}{c|}{\\bf Charge generation} & {\\bf Lower conductive} & {\\bf Upper conductive} \\\\\n&Electrical     & Precipitation & {\\bf  surface or region} &  {\\bf  region}\\\\\n& discharges &                       &                & \\\\\n\\hline\n{\\bf Schumann} & $\\checkmark$         &               &       $\\checkmark$   & $\\checkmark$  \\\\\n{\\bf resonances} & & & \\\\\n\\hline\n{\\bf Radar} &  & $\\checkmark$ & $\\checkmark$ & \\\\\n\\hline\n{\\bf Broadband} & $\\checkmark$ & & \\\\\n{\\bf radio emission} & & & \\\\\n\\hline\n{\\bf Optical} & $\\checkmark$ & & \\\\\n\\hline\n\\end{tabular}\n\\label{tab:GH}\n\\end{table}\n \n\nOf these requirements, providing evidence in a planetary atmosphere of\ncurrent flow is a particularly key aspect. In the terrestrial\natmosphere, current flow was originally established using a surface\nelectrode with an appreciable collecting area\n(\\citealt{wilson1906}). Use of similar surface mounted electrodes is\nunlikely to be practical in space missions, hence other approaches\nsuitable to the single burst of measurements made by descent probes\nentering an atmosphere need consideration.  If horizontal layers of\ncloud or particles are present in an atmosphere, which are passive\nelectrically, (i.e. not able to generate electrification internally),\nEq.~\\ref{eq:GH2} indicates that seeking charging at the edges of\nparticle layers provides an opportunity for the existence of vertical\ncurrent flow. PPL edge charging can, in principle, be determined using\na descent probe able to measure charge and detect the presence of\nparticles, for example using the combination of electrical\n(\\citealt{nicoll2013}) and optical (\\citealt{harrison2014}) detectors\nused in the terrestrial atmosphere. Through deploying such sensing\ntechnology on a suitable platform, vertical current flow in a\nplanetary atmosphere in the solar system may be inferred without the\nneed for surface measurements.\n   \n\nIn summary, the bigger picture here concerns the relationship between\nphysical processes external to an atmosphere and active processes\nwithin it. Future work in this area therefore needs to consider: \n\n\\begin{itemize}\n\\item The range of charge separation processes which can occur in different\nplanetary environments and the controlling influences on current flow,\nwhich may be internal or external in origin. Charge separation occurs\nbetween the same material (e.g. the dust electrification on Mars),\ndifferent phases of the same substance (e.g. water-ice-hail\ninteractions on Earth), or between different substances and phases. \n\\item \nIn the last set of circumstances, account of the local atmospheric\nchemistry and its influence on charging will be needed. Some\nconsideration should be given to the nature of the charge separation,\nand whether simple electrical analogies in terms of constant current\nor voltage sources are appropriate. \n\\item In terms of the current flow,\nthere may be significant external influences, including the triggering\nof lightning-like discharges by external variations (e.g. Owens et al,\n2014). For some planetary body configurations, there may also be\ndirect tidal effects on the conductive regions in the atmosphere or\nother coupled interactions such as those between Saturn's\nmagnetosphere and Titan.\n\\end{itemize}\n\n\n\n\n\\subsection{Electrical charging in volcanic plumes \\& Volcanic Lightning Experiments}\\label{ss:volc}\n\n\n\n\n\n\n\n\\paragraph{Electrical charging in volcanic plumes:}\nVolcanoes generate some of the most violent forces in nature, and are\nnot only present on Earth but on several of the planets and moons in\nour solar system, e.g. on Venus and Io (\\citealt{shal2015}), or more\ngenerally, volcanism can occur on rocky planetary objects with a hot\ncore. The set of presently known extrasolar planets contains also\nplanets (e.g. 55 Cancri e, \\citealt{dem2011}) that may be classified as volcanic due to\ntheir proximity to their host star and their high bulk density that\nindicates a rocky bulk composition. On Earth, volcanic lightning is\noften present during eruptions (see \\citealt{2006AGUFMAE53A0286H,\n2010BVol...72.1153M} for reviews), providing strong evidence for the\nelectrical charging of volcanic ash as well as demonstrating that\ncharge separation sufficiently large to initiate breakdown within the\nvolcanic plume environment.  Numerous mechanisms have been suggested\nby which volcanic ash in Earth-based volcanoes can become electrified\nincluding fractoemission (\\citealt{2000JGR...10516641J}), contact or\ntriboelectrification (\\citealt{houghton2013}), and\nthunderstorm-style ice-contact charging ('dirty thunderstorm'\nmechanism;\n\\citealt{pontikis2}), each of which may occur at different altitudes\nthroughout the plume (Fig.~\\ref{kan2pic}). Understanding the\nrelative importance of these mechanisms in generating volcanic\nlightning during an eruption is required in order to explain\nobservations of volcanic lightning and why some eruptions produce\nlightning and not others.  On Earth, volcanic lightning provides the\nability to detect explosive volcanic plumes remotely, as well as\nestimates of the minimum plume height to be made in the absence of\nother observational methods such as radar and lidar\n(\\citealt{2010ERL.....5d4013B}).  Electrostatic forces may also play\nan important role in modulating the dry fallout of ash from volcanic\nplumes, potentially important for modelling of ash transport downwind\nof volcanic eruptions (\\citealt{2010ERL.....5b4004H}), although much\nfuture research is required in this area.\n\\begin{figure}[h]\n\\centering\n{\\ }\\\\*[-1.5cm]\n\\includegraphics[width=.8\\textwidth]{KAN2fig.pdf}\\\\*[-6cm]\n\\caption{Sketch \n\nof volcanic charge generation mechanisms thought to be active in volcanoes on Earth.  Fractoemission, caused by the fragmentation of magma, is thought to occur close to the vent,  whereas triboelectric charging (frictional contact charging) can occur throughout the plume, wherever particles are present.  The dirty thunderstorm mechanism requires ice particles in the plume and  is only likely to be important for plumes which reach altitudes with temperature that allow freezing to occur.}\n\\label{kan2pic}\n\\end{figure}\n\nAway from Earth, active volcanism exists on several bodies in our\nsolar system.  Volcanic eruptions on Venus are typically associated\nwith fluid lava flows - there is no evidence of the explosive ash\neruptions that occur frequently on Earth which are often associated\nwith active volcanic lightning.  Conversely, Io, one of Jupiter's many\nmoons often exhibits signs of explosive eruptions. Io's eruptive\ncolumns reach to hundreds of km altitude in contrast to Earth based\nplumes which may reach up to up to 40km in rare circumstances\n(\\citealt{opp2003}).  The existence of volcanoes on\nother bodies in the solar system (e.g. Venus, \\citealt{airey2015}) suggests the possibility of charging\nmechanisms associated with such volcanic activity, which may or may\nnot be similar to those on Earth.  This leads to the possibility that\nstudying volcanic lightning on Earth may provide insight into dust\ncharging processes in environments where mineral dust is common such\nas in the atmospheres of brown dwarfs or extrasolar planets as\ndetailed in Sect.~\\ref{s:exopl}.\n\n\\begin{figure}[h]\n\\centering\n{\\ }\\\\*[-2cm]\n\\includegraphics[width=1.0\\textwidth]{cimarellifig.pdf}\\\\*[-12.5cm]\n\\caption{Results of a rapid decompression experiment with volcanic ash (250 $\\mu$m). {\\bf Panel A:} Electric potential recorded by the antennas, pressure at the nozzle and angle of the core of the flow ($\\beta$) and the surrounding turbulent shell ($\\alpha$) with respect to the vertical. Shaded area indicates the time window of lightning occurrence. {\\bf Panel B:} Rest-frame of the high-speed videos showing the particle-laden jet is well-constrained and surrounded by the turbulent sheath of finer ash and lightning flashes are recorded. {\\bf Panel C:} Schematic section of the jet showing the main flow core (coarser particles; dark grey shadow), the turbulent shell (finer particles; light grey shadow) and the respective opening angles ($\\beta$ and $\\alpha$) to the vertical. {\\bf Panel D:} Number of discharges > 0.2 V recorded at the lower antenna in experiments with bimodal glass beads (500 and 50 m) as a function of the wt.\\% of finer particles.}\n\\label{cimarellipic}\n\\end{figure}\n\n\n\n\n\\paragraph{Volcanic Lightning Experiments:}\nExplosive volcanic eruptions are commonly associated with intense\nelectrical activity and lightning. A number of techniques have been\nused to study the electrical activity of volcanic plumes including\nclose range VHF lightning mapping arrays\n(e.g. \\citealt{2007Sci...315.1097T,2013JVGR..259..214B}), long range\nVLF lightning observations (e.g. \\citealt{2010ERL.....5d4013B}) and\noptical lightning detection using high speed cameras\n(\\citealt{2014EGUGA..16.9004C}). Direct measurement of the electric\nfield near the vent, where the electrical activity in the volcanic\nplume is first observed is difficult, but a handful of \nstudies exist including those by\n\\cite{1965Sci...148.1179A,1991Natur.349..598G,1998James,2002BVol...64...75M}. Lab based\nexperiments are also essential to studying volcanic charge generation\nmechanisms in a controlled environment, and can allow different charge\nmechanisms to be examined individually. Laboratory experiments by\n\\cite{2000JGR...105.2819B} and \\cite{2000JGR...10516641J} have studied the\nfractoemission mechanism, whereby James et al. generated silicate\nparticles by fracture during collisions between pumice samples. During\nthe experiments there was evidence of ion release during the fracture\nprocess. Triboelectrification processes have also been studied in the\nlab using both silica beads (\\citealt{2009PhRvL.102b8001F}) and volcanic ash\n(\\citealt{houghton2013}), where it has been demonstrated that the\nparticle size distribution has important effect on the magnitude of\nthe charge generated.\n\n\n\\cite{cim2013} have achieved an analog of volcanic\nlightning in the laboratory during rapid decompression (shock-tube)\nexperiments of gas-particle (both natural volcanic ash and glass\nbeads) mixtures under controlled conditions.\nExperiments show that more discharges are generated for finer starting\nmaterial and that there is no correlation between the number of\ndischarges and the sample chemistry (\\citealt{2011Geo....39..891T}).\nThe experiments highlight that clustering of particles trapped in the\nturbulent eddies of the jet provides an efficient mechanism for both\ncharge generation (tribocharging) and lightning discharge as observed\nin volcanic plumes. Clusters form and break-up by densification and\nrarefaction of the particle-laden jet. A cluster's lifetime is\nregulated by the turbulence time scale and its modification during the\nevolution of the jet flow. Cluster generation and disruption provide\nthe necessary conditions for electrification of particles by\ncollision, local condensation of electrical charges and its consequent\nseparation, thus creating the electric potential gradient necessary to\ngenerate lightning discharges. Clustering can be particularly\neffective in the presence of prevalently fine ash-laden jets exiting\nvolcanic conduits\\footnote{The volcano conduit is the pipe that\ncarries magma from the magma chamber, up through the crust and through\nthe volcano itself until it reaches the surface.} thus facilitating\nash aggregation in the plume (\\citealt{2011Geo....39..891T}). Further\ncharging by the formation of hydrometeors (i.e. water droplets or ice\nparticles) in the upper regions of the plume\n(\\citealt{2012BVol...74.1963V}) could provide additional mechanisms of\nplume electrification, although the presence of ice particles in the\nplume (from low latitude volcanoes where surface temperatures are\nhigh (\\citealt{aiz2010})) can be ruled out in\nmany monitored eruptions that produced electrical discharges, thus\nconfirming the primary role of particle self-charging in the\ngeneration of volcanic lightning.  The experiments show the direct\nrelation between the number of lightning discharges and the abundance\nof fine particles in the plume as observed in the case of 2010\nEyjafjallaj\\\"{o}kull eruption in Iceland, as well as in many other\nash-rich eruptions or explosive episodes, independently from their\neruption magnitude and magmatic composition. Improved lightning\nmonitoring at active volcanoes may provide first-hand information not\nonly on the location of the eruption but more importantly on the\npresence and amount of fine ash ejected during an eruption, which is a\nfundamental input in ash-dispersion forecast models. Multiparametric\nobservations of volcanic plumes are therefore needed to fully\nunderstand the favourable conditions for volcanic lightning generation\nand to correctly interpret electrification and discharge phenomena to\nunderstand plume properties. Newly designed shock-tube experiments\nopen new perspectives in the investigation of self-charging mechanism\nof particles that are relevant for atmospheric phenomena on Earth\n(such as dust storms and mesocyclones) and other planetary bodies, as\nwell as industrial processes involving granular materials.\n\n\n\n\\subsection{Kinetic gas-chemistry during discharges in solar-system planet atmospheres}\n\n\n\n\nAtmospheric discharges have been detected in all gaseous giants of our\nSolar System (\\citealt{yair2012}) and are therefore likely to be\npresent in extrasolar planets as suggested\nin \\citep{helling2011a,aplin2013,hellingjsd2013,bailey2014}.\nTransient Luminous Events (TLEs) occur in the Earth atmosphere (see\nSect.~\\ref{s:eldis_solsys}\\ref{ss:Ute}) where they influence the local\ngas composition, and with that, potential observational features.\n\nA number of models to study in detail the non-equilibrium kinetic chemistry of\nTLEs have been developed (\\citealt{gordillo-vazquez2008,gordillo-vazquez2009, \ngrodillo-vazquez2010a, parra-rojas2013a,parra2015}). These studies have allowed the optical signatures\nand spectra of TLE optical emissions (from the UV to the NIR) to be\nquantified as should be seen from ground, balloons, planes and from\nspace (e.g. \\citealt{\n\ngordillo-vazquez2012}) illustrating good agreement with available\nobserved spectra.\n\nKinetic gas-chemistry models have been developed to calculate the TLE-induced\nchanges in the electrical conductivity\n(\\citealt{grodillo-vazquez2010a}) of the Earth upper atmosphere\nshowing good agreement with available measurements. The importance of\nsome key kinetic mechanisms (electron detachment from O$^-$) has been\nshown to explain the inception of delayed sprites\n(\\citealt{luque2012}). The impact of lightning on the lower ionosphere\nof Saturn and the possible generation of halos and sprites has been\nmodelled by \\cite{dubrovin2014}. This allowed to study the coupling between\natmospheric layers in Saturn and Jupiter due to lightning-generated\nelectromagnetic pulses and to predict \ndifferent possible optical emissions from elve-like events\ntriggered by lightning in the giant planets (\\citealt{luque2014}).\nThe extension of such an approach to extrasolar atmospheres\nrequires a dedicated kinetic gas-chemistry network which is able to\nhandle a considerably wider range of chemical compositions and\ntemperatures than for the solar system planets\n(see, e.g. the STAND2015 network from \\citealt{rimmer2015}).\n\n\\subsection{Future Studies}\nOn Earth the quasi-static and the radiation components of the\nlightning electric field have comparable effects on the secondary\nTLE-discharges in the upper atmosphere. However, in planets with\nlarger typical distances, the radiation field can be stronger than the\nquasi-static field (\\citealt{luque2014}). The radiation field is\nresponsible for ring-shaped expanding emissions of light at the lower\nedge of the ionosphere. It is therefore speculated that giant TLEs may\nexist in giant planets. This new area of research has introduced many\nopen questions, such as:\n\\begin{itemize}\n\n\n\n\n\\item \n\nCan lightning-related TLEs occur on Saturn and Jupiter? What kind of TLE could be observable, what would be the required sensitivity and appropriate wavelength range? \n\nCould the optical flash emission on Saturn and Jupiter originate from other discharge processes than conventional lightning discharges? \n\n\\item\n\nCan lightning-related TLEs take place in the upper layer of the Venusian atmosphere? \n\nHow would lightning influence  the chemical composition and electrical properties of the Venusian upper atmosphere?\n\n\\item\nNo direct optical lightning observation is available for the atmospheres of Neptune and Uranus, only indirect radio detection possibly associated to electric discharge events. What could be the lightning mechanisms in Neptune and Uranus?\n\n\n\n\n\n\\item What would be the possible atmospheric optical and chemical signatures in the case that lightning activity exists in extrasolar planets and brown dwarfs atmospheres? \n\\end{itemize}\n\n\n \n\n\n\n\n\n\n\\section{Electrification on the Moon and on asteroids}\\label{s:solsys}\n \n\n\nCharged dust grains and dusty plasmas are known to constitute the\nnear-surface environment of airless bodies such as the Moon,\nasteroids, comets, Saturn's rings and many planetary moons.  Our solar\nsystem, being exposed to a variety of plasma conditions and solar\nactivity, provides a natural laboratory to study dust charging and\ndynamics. Charging of neutral dust particles occurs when dust grains\nare exposed to space plasma, for example, through interactions with\nthe solar wind. These plasma interactions are believed to be the\nreason for many of the observations reported in the literature\n(e.g. spokes in Saturn's B ring and dust streams ejected from\nJupiter \\cite{honary2004}).\n \nIn dusty plasmas, dust particles have the ability to alter the\nproperties of various plasma waves and instabilities\n(e.g. \\citealt{dangelo1993, kopnin2009, rao1993, rao1995}). In some\ncases the presence of dust can affect the instability\n(e.g.  \\citealt{sen2010}), whereas in other cases the presence of dust\ncan drive new unstable modes (\\citealt{rao1990}).  Both high and low\nfrequency modes can be excited. High frequency modes are excited\nbecause the dust can modify the relative drift between the plasma\nspecies (electrons and ions) or simply reduce the electron\ndensity. Low frequency modes (both electrostatic and electromagnetic)\noccur when the dust dynamics are considered. One of the interesting\nmodes is dust-ion acoustic instability which is driven by the relative\ndrift between the dust and the plasma (\\citealt{rao1993}). An example\nof such a scenario exists in Saturn's E-ring where the plasma\nco-rotates with the planet while the dust follows Keplerian\norbits. \\cite{rosenberg1993} has shown that the relative speed between\nthe dust and the plasma to drive the instability is of the order of\nthe ion thermal speed. By introducing the magnetic field new modes\ncalled dust-magneto-acoustic waves are excited according to the theory\n(e.g. \\citealt{rao1995}) which is the generalisation of the\nelectrostatic dust-ion acoustic wave, first reported\nby \\cite{shukla1992}.\n \nBeyond the macroscopic behaviour of dusty plasmas, understanding dust\ncharging in the space environment is important for several\nreasons. The variable exposure of the moon to solar wind, UV\nradiation, terrestrial magnetospheric plasmas, and meteoroid impacts results in a\ntime-dependent, complex plasma environment. The charging, possible\nsubsequent mobilization, and transport of fine lunar dust have\nremained a controversial issue since the Apollo era, and have been\nsuggested to lead to the formation of a dusty exosphere, extending\ntens to hundreds of kilometres above the surface. Recent international\ninterest and potential return to the moon in the near future has been\ndeclared by major space agencies around the world (NASA, ESA, JAXA,\nRussia, China). The success of these missions depends largely on the\nability to understand and predict the effects of dust on the lunar\nenvironment in order to prepare crews and equipment to withstand such\na harsh environment. Whilst NASA's Lunar Atmosphere and Dust\nEnvironment Explorer (LADEE) (launched on 6th Sept. 2013) is the first\ndedicated mission to make measurements of lunar dust composition,\nother missions are planned. For example, there are dust detectors on\nthe Russian lander mission to the moon's South pole (Luna Glob, 2016)\nand a joint Russian-Indian (Lunar-Resurs) mission in 2017/18.\n \nAsteroids and comets are similarly complex environments, of interest\nbecause they are formed from material originating from the time when\nthe Solar System was formed.\n\nPrecise isotope ratio measurements give insights into the formation of\nour planetary system. Carbonaceous compounds from some primitive\nasteroid, that have not been affected by weathering other than in\ninterplanetary space, could have contributed to the origins of life\nthrough delivery of organic compounds to Earth.\nThere is therefore substantial scientific interest in measuring the surface\nmaterial of asteroids and comets.  Examples of successful missions\ninclude NASA Deep Impact and Stardust (see review\nby \\citealt{verv2013}) and the European Rosetta mission's Philae\nlander touched down on the comet 67P/Churyumov-Gerasimenko in November\n2014 (e.g. \\citealt{todd2007}). The mass spectrometry needed to\nunderstand the rocky particles on the surface of asteroids (regolith:\ndust, soil, broken rock, and other related materials and is present on\nEarth, the Moon, Mars, some asteroids, and other terrestrial planets\nand moons) is too sophisticated for comparatively simple\nspacecraft-borne instrumentation, and this has motivated several\nsample return missions aiming to return regolith to Earth for more\ndetailed analysis. The Japanese Hayabusa mission collected a sample\nfrom asteroid Itokawa in 2005, NASA's Osiris-Rex mission \nvisits asteroid Bennu in 2016, and a European mission, Marco Polo-R\nwas also recently studied in detail (\\citealt{michel2014}).\n \n\n\\subsection{Charge effects on the Moon}\n\n\nIn its orbit, the moon is exposed to the incoming solar wind when it\nis not in the Earth's magnetosheath where most of the plasma interacts\nwith the moon surface, forming a wake region behind the lunar\nobstacle. The exposed (sunlit) surface is charged positively to about\n+5V due to high photoelectron current but on the shadow side, the\ninability of ions to fill in the plasma void results in regions with\nenergetic electrons, which will subsequently charge the surface\nnegatively to few hundred volts in normal conditions or up to few\nthousand volts in extreme cases.  The charging from galactic cosmic\nrays is negligible in comparison to the effects of the solar\nwind. Like the Moon, asteroids have dusty plasma environments, with\nsimilar charging mechanisms such as from space plasmas or the solar UV\nflux (\\citealt{lee1996}).\n \nAt midpoint between the sunlit and the night side of the moon, the\nsolar wind passes through almost parallel to the surface. At much\nlower negative potential compared to the night side, this lunar\nterminator region has been found to be the source of 'streamers' or\n'horizon glow' as observed by astronauts during the Apollo mission.\nIt is found that the glow is produced by the scattering of sunlight by\ndust particles originating from the surface, a result to be confirmed\nby LADEE. It is thought that the dust on the lunar surface is charged\nby the Sun's UV radiation and that other processes can contribute, such as\nsolar wind plasma, secondary electron emission and triboelectric\ncharging.  The repulsive electric field between the dust and the\nsurface causes the dust to levitate from the surface. Similar\nmechanisms are expected to act on asteroids.  Although dust charging\nand levitation have been extensively discussed\n(e.g \\citealt{whipple1981, goertz1989}), these processes are not yet\nfully understood for the complex lunar surface where both the topology\nand orbital configurations of the moon add to the complexity. Recent\ndevelopment of 3D dusty plasma code based on Space Plasma Interaction\nSoftware (SPIS) (\\citealt{anuar2013, hess2014}) has provided a useful\ntool to simulate many possible scenarios on lunar surface such as\nlunar surface charging, shadowing phenomena and dust levitation.\nFigure~\\ref{fig:moon} presents time-sequence simulations of the\nrelease of dust outside the rim of a lunar crater. At the terminator\n(top panels) the presence of strong negative electric fields repels\ndust particles, preventing them from reaching the basin of the crater.\nOn the dayside (bottom panels) dust is attracted towards the middle of\nthe crater basin due to the basin having a lower surface potential\nthan the rim surface.\n\n In the lunar environment a controversial and an open question is the\nhigh altitude component of the lunar dust: what is the maximum height\nthat dust can be observed? The topology and the orbit of the moon\nitself pose interesting questions such as:\n\\begin{itemize}\n\\item What is the charge density distribution on the surface as a function of local time and how does it change along the orbit as the Moon enters the earth's magnetosphere?\n\\item What is the plasma density distribution above the moon surface, and how does it change with height and time as a result of interaction with dust particles? \n\\item What is the configuration of the local small-scale electric fields? How do the vertical and horizontal components of the surface electric fields evolve during the passage of the lit - dark boundary, and along the lunar orbit? \n\\item How do magnetic anomalies alter the surface electric fields and plasma?\n\\end{itemize}\n\n\n\\begin{figure}\n\\begin{center}\n\\hspace*{-0.5cm}\\scalebox{0.6}{\\includegraphics[angle=0]{FH_fig1.png}}\n\\caption{ Time-sequence simulations of the release of dust outside the rim of a lunar crater For two regions: terminator (top panels) and dayside (bottom panels). The crater of 5m diameter is modelled as a opening in the bottom of the panels which represents the surface of\nthe moon. The x and y axes represent the lunar surface and the height\nof the simulation which are 45m and 60m respectively.}\n\\label{fig:moon}\n\\end{center}\n\\end{figure}\n\n\n\n\\subsection{Charge effects on asteroids}\n\nIn the case of an asteroid, there are possible electrostatic effects\non, firstly, surface material, and, secondly, through the\nelectrostatic effects of a spacecraft visiting an asteroid, which\ncould influence the outcomes of sample return missions. Asteroids\nbecome charged by cosmic rays, the solar wind and photoelectron\nemission. For asteroids in the solar system, the charging effects of\ncosmic rays are negligible in comparison to the solar wind's effect,\non the nightside, and photoelectron charging on the dayside. The most\ndirect mechanism for charging effects on asteroids views electrostatic\nprocesses as one type of ``space weathering''\n\n\n\nwhich is a broad term for surface modification of these bodies.  Space\nweathering is relevant for asteroid sample return missions since it\nrefers to processes that could physically and chemically modify the\nsample from its ``pristine'' state, thought to be representative of the\nearly Solar System. As photoelectric levitation of dust particles on\nthe surfaces of asteroids is expected to occur, charging effects could\nmodulate the size distribution, by redistribution of  regolith,\nfor example, through ''ponding'' in craters. Modification of the size\ndistribution could also have more complex effects for the asteroid's\ndensity and orbital evolution (\\citealt{aplin2014}).\n\nRecent models (Aplin et al, 2014) considered the electrostatic\nimplications of a spacecraft visiting an asteroid, and found that\nphotoelectric shadowing from the spacecraft itself was\nsubstantial. This shadowing will generate electric fields in the\nsampling region, a hitherto neglected process that could modify the\nsample to be collected. \\cite{aplin2014} demonstrated that simple\nisolated electrodes mounted on a spacecraft could measure the\nscreening from the spacecraft, and, with careful choice of position,\nthese electrodes could also measure the minimally disturbed electrical\nenvironment.  Figure~\\ref{f:Itokawa} shows modelled electric fields at\nthe surface of the asteroid Itokawa. The dayside is assumed to be at\n+5V, and the nightside at -1000V (\\citealt{aplin2011}) resulting in\nhigh electric fields at the terminator. Further work is needed to\nconsider other electrostatic effects of a sample return mission, for\nexample the mechanical lofting of particles from spacecraft touchdown,\nwhich would become charged. Triboelectric (frictional charging)\neffects could also be significant. Although both Martian analogue and\nlunar material tribo-charge efficiently (e.g. \\citealt{aplin2012,\nforward2009}), triboelectric effects have not been considered in the\nasteroidal (like in Fig.~\\ref{f:Itokawa}) or lunar\nenvironment. Triboelectric charging could occur both from collisional\nprocesses between lofted regolith, and potentially more significantly\nfor human exploration and sample return, from interactions between\nspacecraft and the environment, such as sampling mechanisms or rovers.\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.5}{\\includegraphics[angle=0]{FH_fig2.png}}\n\\caption{Four viewing angles of 3D electrostatic modelling of the surface electric field for the asteroid Itokawa (after \\citealt{aplin2011}). The highest electric fields exist at the terminator region. Effects of surface topography on the electric field can also be seen.}\n\\label{f:Itokawa}\n\\end{center}\n\\end{figure}\n\n\nThere is clearly much work to be done in understanding the mechanisms\ninvolved in dust charging and their effects. For the asteroid case,\ndust needs to be included in the simulations as well as more realistic\nrepresentations of the spacecraft geometry, so that shadowing effects\ncan be studied more carefully.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Charge processes in Extrasolar atmospheric environments}\\label{s:exopl}\nCharge processes and their effects occur in many astrophysical\nenvironments. This section focuses on extrasolar objects where charge\nand discharge processes introduce feedback cycles similar to those\ndiscussed previously.  This section summarises a field\nof research on cool extrasolar objects which starts to emerge as the\nresult of recent progress in X-ray and radio observations of brown\ndwarfs.  Brown dwarfs are objects with mass intermediate between stars\nand planets (Fig.~\\ref{fig:SMDP}; for a review\nsee \\citealt{hell2014}).  Since they are not sufficiently massive for\nhydrogen burning in their core, they cool during their entire life time. Brown\ndwarf atmospheres therefore evolve from the state of a warm stellar\natmosphere into an atmosphere as cool as the atmospheres of solar\nsystem planets. The oldest brown dwarfs are amongst the oldest objects\nin our Universe. Very-low mass stars and brown dwarfs are collectively\nknown as ultracool dwarfs.\n\n\nCharge processes are important also in star and during planet\nformation in protoplanetary disks. Ionisation processes are suggested\nto help the first steps of planet formation as demonstrated by\nmicrogravity coagulation experiments at the International Space\nStation (\\citealt{konop2005}; see also\nSect.~\\ref{s:eldis_solsys}\\ref{ss:volc}), and to allow the star to\ncontinue to accrete mass through the propolanetary disk.\n\nPlanets and stars do have magnetic fields. The magnetic field strength\nand geometry differ for different stars (\\citealt{donati2009}) which\nhas implications for e.g. the size of a planetary magnetopause or the\nhigh-energy radiation impact into a planetary atmospheres\n(\\citealt{vid2014, see2014}). Stellar magnetism changes with mass and\nrotation (as indicator for age for some stars) of the objects\n(\\citealt{donati2008,morin2008,morin2010,vid2014b}) introducing an\nadditional complexity in the astrophysical context of atmospheric\nelectrification. Brown dwarfs can have magnetic field strengths of\n~1000G (= 0.1 T).\n\n\nThis section first summarises recent multi-wavelength observation of\nbrown dwarfs as the best detectable ultra-cool and planet-like objects\n(Sect.~\\ref{s:exopl}\\ref{ss:littlef}). Section~\\ref{s:exopl}\\ref{ss:BDion}\naddresses ionisation mechanisms in ultra-cool atmospheres, and\nSect.~\\ref{s:exopl}\\ref{ss:inuts} summarised recent ideas for ionising\nprotoplanetary disks through which stars grow and planets\nform.\n\n\n\\input{ChristianesSection/littlefair_1page.tex}\n\\input{ChristianesSection/sorahana_proceeding.tex}\n\\input{ChristianesSection/Casewell.tex}\n\n\\input{ChristianesSection/BD_ionisation.tex}\n\\input{ChristianesSection/dobbs-dixon.tex}\n\n\\subsection{Discharges  in protoplanetary disks}\\label{ss:disks}\n\n\\input{ChristianesSection/inutsuka.tex}\n\n\\input{ChristianesSection/muranushi.tex}\n\n\\bigskip\n\n\n\n\\subsection{Future studies}\n\nCombining the expertise available on solar system and terrestrial\natmosphere research and electrical phenomena therein will help\nanswering some of the following question, but might also be inspired by these questions:\n\n\\begin{itemize}\n\\item In how far can terrestrial and solar system lightning statistics guide our expectation for extrasolar environments like on extrasolar planets, brown dwarfs and in proroplanetary disks? \n\\item How are brown dwarf (and extrasolar planet) atmospheres affected by the irradiation of their companion (or host star)? \n\\item Going beyond the Solar System, clouds are present in brown dwarf and exoplanetary atmospheres. What kind or which combination of atmospheric electricity phenomena could explain the required levels of ionized atmosphere to provide an explanation for the continuous radio emissions, the 656 nm and X-ray emissions?\n\n\\item What would be the possible atmospheric optical and chemical signatures in the case that lightning activity exists in exoplanetary and brown dwarfs atmospheres? \n\n\\end{itemize}\n\n\n\n\n\\section{Conclusion}\\label{s:concl}\n\nElectrification processes and electrical phenomena are ubiquitous:\ndust charging and discharging is linked to electric gas breakdown in\nplanetary atmospheres inside and beyond the solar system where it is\ninvolved in global circuits and the occurrence of plasma\nprocesses. Charge processes play a major role in modifying the ambient\nchemical composition and the transport properties of neutral gas also\nin protoplanetary disks where planets form. Charged relativistic\ngrains are suggested as potential primary particles for ultrahigh\nenergy Cosmic Rays (\\citealt{2014arXiv1412.0578H}). The following set\nof challenges has emerged as common for the themes of this paper\n which have been guided by the\nworkshop 'Electrification in dusty atmospheres inside and outside the\nsolar system' held in September\n2014\\footnote{http://leap1.sciencesconf.org/}:\n\n\\begin{itemize}\n\\item[(a)] An increased population of ion, free electron and radicals\n  lowers the chemical potential for gas-species reactions, leading to\n  potentially observable spectroscopic fingerprints, and\n\\item[(b)] also increases the thermal and electrical conductivity of\n  the gas to a certain threshold, enabling more energetic phenomena such as lightning to take\n  place or accretion to proceed during star- and planet formation.n\n\\item[(c)] The presence of free charge may be transient (as in\n  lightning) but the electrostatic influence can endure:\n  Charging of dust and aerosols can influence electrostatic character\n  of the ambient atmosphere on longer length and time scales to\n  produce small non-thermal populations of energetic particles.\n\\item[(d)] Finite enhanced electrical conductivity can allow magnetic\n  relaxation, and access to stored magnetic energy as a general source\n  of excitation which in unavailable to neutral gases.\n\\item[(e)] Non-thermal electrons may facilitate\n  chemical reactions in ways that are classically (i.e.\n  gas-thermodynamically) unlikely: For example, dissociative\n  electron attachment can produce oxygen radicals at little energetic\n  cost, leading to oxidative reactions proceeding at a rate\n  inconsistent with ambient temperatures, or the formation for complex carbohydrates. \n\\item[(f)] Charged dust may evolve differently compared to neutral dust:\n  Long-range organization produced by \n  electrostatic effects could produce coherent dust dynamics that\n  would not be possible if only fluid mechanics dominates.\n  \n  surface charging, leading to elongated growth (non-zero\n  eccentricity: polarization of light is observable), or destruction\n  of part of the grain population by Coulomb explosion.\n\\end{itemize}\n\nThese themes lead to the need of \n\\begin{itemize}\n\\item Further research in dust charging mechanisms in the context of volcano lightning, atmospheres of Brown Dwarfs and exoplanets, and protoplanetary disks.\n\\item New instruments in future space missions to test new findings about electrical activity in Solar System Planets. Result would provide models that  could mimic  electrical activity in Brown Dwarfs and exoplanets.\n\\item Further research about the role of dust in electrical discharges in the upper atmosphere of the Earth.\n\\item New key insights in charge mechanisms of the Moon and asteroid\n  fine dust grains by interacting with the solar wind and UV\n  flux. This contributes to the fundamental knowledge of the Moon\n  electric environment and will be very useful for further man\n  missions to the Moon and unmanned missions to the asteroids.\n\\item 3D simulations of extrasolar atmospheres including chemical and\n  electrical feedback of clouds in a magnetised gas.\n\\end{itemize}\n\n\n\n\\bigskip\n{\\bf Acknowledgment} ChH highlight financial support of the European\nCommunity under the FP7 by an ERC starting grant 25743. DAD gratefully\nacknowledges support from EPSRC via grant numbers EP/K006142/1 and\nEP/K006088/1.  FJGV thanks the Spanish Ministry of Economy and\nCompetitiveness (MINECO) under projects FIS2014-61774-EXP and\nESP2013-48032-C5-5-R and the EU through the FEDER program.  We thank\nall the participants to the workshop {\\it Electrification in dusty\n  atmospheres inside and outside the solar system} held in September\n2014 in the Scottish Highlands for their input and inspiration. We\nthank the Royal Astronomical Society, the ERC and the IoP\nElectrostatics Group for financial support. We thanks Sarah Casewell\nand Alejando Luque for their help in preparing Table 1. Gabriella\nHodos{\\'a}n is thanked for helping with the literature\ncollection. Keri Nicoll is thanked for her inspiring feedback on\nSect.~\\ref{s:eldis_solsys}\\ref{ss:volc}.  Most of the literature\nsearch has been performed using ADS.\n\n\\appendix\n\n\\section{Glossary}\\label{s:AGl}\n\n\\textbf{asteroid}: small rocky bodies of inner solar system, ranging in size from 10m to 900m in diameter \\\\\n\\textbf{aurora}:  large diffuse light-emitting structures in the lower ionosphere (> 90 km) generated when energetic particles displaced from the ionosphere collide with ground state neutral species and excite them. The excited species (oxygen atoms and nitrogen molecules) emit light when returning to ground state\\\\\n\n\\textbf{carbonaceous compound}: material rich in Carbon; in an astrophysical context, such compounds usually are associated with primitive solar system remnants \\\\\n\\textbf{conduit, volcano conduit}:  the pipe that carries magma from the magma chamber, up through the crust and through the volcano itself until it reaches the surface.\\\\\n\\textbf{chondrule}: molten or partially molten droplets that appear as spherical, solid  inclusions of different chemical composition than  the matrix of their parent asteroid. They represent one of the oldest solid materials within the solar system.\\\\\n\\textbf{cosmic rays}: Ionized nuclei and electrons that are distinguished by their high energies. The ionized nuclei have energies ranging from 10$^6$ eV to greater than 10$^{20}$ eV and comprise 99\\% of cosmic rays. They originating either from the Sun or outside the Solar System likely from Super Novae or Gamma Ray Bursts.\\\\\n\\textbf{cyclotron maser instability}: the mechanism whereby a population of relativistic electrons drift along an ambient magnetic fields, producing coherent radiation that reflects the magnetic field strength. \\\\\n\\textbf{DC}: direct current\\\\\n\\textbf{Debye length}: the scale-length associated with the violation of charge neutrality in a plasma, due to thermal fluctuations causing charge separation \\\\\n\\textbf{double diffusive convection}: a form of convection (i.e. hydrodynamic bulk motion) that is driven by two distinct gradients in fluid composition arising from two different species abundances. \\\\\n\\textbf{Druyvesteyn distribution}: a driven-equilibrium distribution function that takes into account the presence of large-scale electric fields in a plasma, as well as interactions with neutrals \\\\\n\\textbf{effective temperature, T$_{\\rm eff}$ [K]} is a measure for the total radiation flux emitted at all wavelength $\\lambda$ [\\AA] (T$_{\\rm eff}=F_{\\rm tot}/\\sigma$ with $F_{\\rm tot}=\\int F_\\lambda d\\lambda$; $F_\\lambda$ [erg/s/cm$^2$/\\AA] -- radiative flux; $\\sigma$ [erg cm$^{-2}$s$^{-1}$K$^{-4}$] - Stefan-Bolzmann constant)\\\\\n\\textbf{electrical conductivity}: a material property that characterises the ease with which electricity can be passed through it \\\\\n\\textbf{extrasolar}: outside or beyond the Solar System \\\\\n\\textbf{fair weather current}: atmospheric current of ions present during undisturbed weather condition\\\\ \n\\textbf{floating potential}: the electric potential (or voltage) that spontaneously arises on a surface immersed in a plasma, due to the difference in mobility between electrons and heavier ions  \\\\\n\\textbf{fractoemission}: the emission of particles (charged, neutral and photons) during and after fracturing of surfaces \\\\\n\\textbf{Geiger counter}: an instrument for measuring ionizing radiation,  detects alpha particles, beta particles and gamma rays using the ionization produced in a Geiger-M\\\"uller tube\\\\\n\\textbf{Hydrometeors}:  water droplets or ice particles\\\\\n\\textbf{ion acoustic wave}: a sound wave carried by the motion of plasma ions, as opposed to the electrons \\\\\n\\textbf{isotope ratio}: means of quantifying the relative abundance of isotopes (which are elements which have nuclei that differ in the number of neutrons, but which are otherwise chemically identical).  \\\\\n\\textbf{jet}: directed and confined stream of fluid or gas \\\\\n\\textbf{Jy}: Janskys (symbol: Jy) are the unit for the observed spectral flux density: 1 Jy = $10^{â\u0088\u009226}$ W m$^{â\u0088\u00922}$ Hz$^{â\u0088\u00921}$. The unit is named after Karl G. Jansky, an US radio astronomer. His discovery of  the radio waves emitted by the Milkyway initiated radio astronomy as new research field.\\\\\n\\textbf{M-dwarfs}: the lowest mass (0.075-0.5M$_{\\rm Sun}$), main sequence  stars; most common type of stars in the milky way\\\\\n\\textbf{magma}: fluid mixture of molten and semi-molten rock and volatiles produced by volcanism\\\\\n\\textbf{magnetic Reynolds number}: a dimensionless number equal to the ratio of advective to diffusive effects, where the latter are characteristic of the magnetic field. Hence a large magnetic Reynolds number ($\\gg$1) means that the magnetic field plays a dominant role in the fluid evolution as diffusion is unimportant and the magnetic field is advected with the fluid flow.\\\\\n\\textbf{M (spectral type)}: Stars are grouped into spectral classes which link to their effective temperature, luminosity, evolutionary state. The spectral class M indicates the coolest stars on the main sequence where hydrogen burning assures the most stable phase in a star's life. Brown dwarfs are cooler than M-dwarfs and were classified as L, T and Y with Y being the coolest and most planet like.\\\\\n\\textbf{mesocyclone}: a rapidly rotating column of air, typically a few miles in diameter, readily identified by its characteristic radar signal and consistent with storm conditions\\\\\n\\textbf{mobility}: the drift  speed of a charged particle produced when subjected to a steady electric field \\\\\n\\textbf{near-IR}: electromagnetic radiation in the wavelength range 800nm to 5 microns \\\\\n\\textbf{Ohm's law}: relates the electrical current flowing between two points to the potential difference between those same points\\\\\n\\textbf{plasma void}: a finite region in a dusty plasma which is dust-free \\\\\nprotoplanetary disk: a region of dust and rocks orbiting a young star from which planets could be formed \\\\\n\\textbf{regolith}: layer of unconsolidated dust and fragmented rock that covers a terrestrial planet  \\\\\n\\textbf{shock tube}: a device designed to create shocks (i.e. sharp density and pressure discontinuities) in gases, usually in order to produce ionization fronts \\\\\n\\textbf{sounding}: a method to measure local temperature, humidity, wind etc. in the Earth atmosphere by means of radio sonds, laser beams (optical) or sound waves\\\\\n\\textbf{sprite}: a large (50 km high and 10-20 km wide) electrical discharge that occurs above thunderclouds at altitudes around 50-85 km  with a diffuse region (above 70-75 km) and a filamentary (streamer-like) region (below 70-75 km) [values are given for Earth]\n\n\\textbf{stratosphere}: major layer of the Earth's atmosphere, lying above the troposphere (0-11 km) and below the mesosphere (50-90 km) \\\\\n\\textbf{thunderstorm}: storm characterised by the presence of lightning \\\\\n\\textbf{triboelectrification}: the process whereby two surfaces can acquire or lose charges by mutual collision \\\\\n\\textbf{troposphere}: lowest layer of the earth's atmosphere, lying between 0 and 11km, in which most of the weather phenomena occur  \\\\\n\\textbf{turbulence}: chaotic flow in which the pressure and gas velocity change rapidly in space and time  \\\\\n\\textbf{volcanic ash}: fragments of rock created during a volcanic eruption, usually 2mm or less in diameter\\\\\n\\textbf{volcanic conduit}: passage or tube created by the flow of magma in a volcano \\\\\n\\textbf{volcanic plume}: the gas and ash cloud ejected into the atmosphere by a volcanic eruption \n\\newpage\n\n\n\n\\newpage\n\n\\bibliographystyle{mn2e}\n\\bibliography{bib_master}\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nwhere $\\mu_{\\pm}$ represents the mean mobility of positive or negative\nions present, $n_{\\pm}$ the associated bipolar ion number\nconcentrations and $e$ is the elementary charge. Ions are removed by\nattachment to aerosol particles and water droplets, reducing the\nconductivity in these regions.  Both the mobility and concentration\nvary with atmospheric properties and composition. The mobility of ions\ndepends on the environmental temperature and pressure and the ion\nconcentration is strongly affected by attachment to aerosol particles\nand water droplets, reducing the conductivity accordingly where the\naerosol is abundant. This means that, in the earth's environment,\nwhere aerosols are generated both naturally and through human\nactivities, the local air conductivity can show an anthropogenic\ninfluence (\\citealt{harrison2006,hugo2014}), allowing early indirect\nconductivity measurements to provide an insight into historical air\npollution (\\citealt{harrison2006, aplin2012A}). Together with\nvariations in the source rate, $q_{\\rm STP}$, these lead to a\nvariation in the conductivity with height\n(e.g. \\citealt{harrison2003}). In the heights of the lower ionosphere,\nwhere photo-ionisation also contributes appreciably, the conductivity\nbecomes substantially larger than the lower\natmosphere. Figure~\\ref{fig:GH3} shows a vertical profile of the air's\nconductivity, and a calculation of the relaxation timescale,\ndefined by $\\epsilon_0 / \\sigma_{\\rm t}$. This is the e-folding timescale for\nthe discharge of an isolated particle in a conductive medium. This\nprovides an indication of how active (in terms of the rate of charge\nseparation) a charging process needs to be at different heights in the\natmosphere. In comparison with lower troposphere air with a\ntypical conductivity of $\\approx 10^{-14}$ S\\,m$^{-1}$ as reviewed\nby \\cite{rycroft2008}, the planetary surface has a greater electrical\nconductivity, of at least $10^{-8}$ Sm$^{-1}$. This means the air\nrepresents a low conductivity region sandwiched between upper and\nlower boundaries having much greater conductivity.\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.4}{\\includegraphics[angle=0]{GH_Fig3.png}}\n\\caption{Vertical variation in electrical conductivity, $\\sigma_{\\rm t}$, of the terrestrial atmosphere, as represented in the model of \\cite{rycroft2007}. The dashed line indicates the change of conductivity due to clouds. The equivalent electrical relaxation time is found from $\\epsilon_0/\\sigma_{\\rm t}$,  where  $\\epsilon_0$ is the permittivity of free space.}\n\\label{fig:GH3}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\\subsection{Thundercloud electrification, lightning and transient luminous events}\\label{ss:Ute}\n\n\\paragraph{Ionic conductivity and ionic plasmas in the terrestrial atmosphere:}\nMost electric phenomena in the terrestrial atmosphere are carried by\nions and aerosols; only in the strong transient electric fields of an\nevolving discharge or in the ionosphere are more electrons free and\nnot attached to electronegative atoms, molecules or larger compounds\n consisting, e.g., of water molecules clustering around ions,\nother aerosols, up to droplets from micro- to millimeter size.\nCosmic rays and radioactivity are external sources of ionization\n(Sect.~\\ref{s:eldis_solsys}\\ref{ss:ionization}); they first\ncreate electron ion pairs, then the electrons rapidly attach to\nelectronegative molecules (mostly to oxygen) leaving the positive and negative ions\nin the atmosphere behind which carry the fair weather currents\n(Sect.~\\ref{s:eldis_solsys}\\ref{ss:globcirc}).\n\n\n\\paragraph{The electric field in thunderclouds} \nbuilds up in two stages.\nIn the first stage macroscopic particles are\nelectrically charged, and in the second stage particles of different\npolarity are separated by gravitation or other (mechanical) forces; in\norder to separate particles with different polarities, these forces\nneed to be stronger than the electric attraction between charges of\ndifferent polarity, since otherwise the electric forces would\ncounteract the growth of the electric field. The possible charging\nmechanisms at work within normal terrestrial thunderclouds are\nreviewed, e.g., by \\cite{jay1983} and \\cite{sau2008}. An important\nconclusion of these reviews is that charge is efficiently separated\nbetween particles only in direct collisions.\n\nLiquid droplets cannot experience collisions or fracture as charging\nprocess as they would typically merge on contact, hence they do not\ncharge easily. However, frozen particles can collide and exchange\ncharge. Therefore, terrestrial water clouds get electrified mostly in\nregions below the freezing temperature (\\citealt{mas1953}), more\nprecisely at temperatures between 0 and $-40^o$C.  The dominant\ncharging mechanism is thought to occur when graupel and ice particles\ncollide. \\cite{sau2008} reviews the evidence from Krehbiel's cloud\nmeasurements in 1986 ''that ice crystals rebounding from riming\ngraupel\\footnote{Riming graupel is a graupel particle coated with\nwater droplets that froze immediately when they collided with the ice\nsurface of the graupel. The surface structure of graupel deviates from\na perfect crystalline structure (e.g. \\citealt{bl2009}).} in the\npresence of super-cooled water is a requirement of the charge transfer\nprocess''. This observation is consistent with lab measurements of\nSaunders et al. that during collision essentially ''fast growing ice\nsurfaces charge positively, and conversely, sublimating (graupel)\nsurfaces charge negatively''. However, further dependencies on growth\nvelocities etc. need to be taken into account. The particle collisions\nare mediated by gravity acting on large particles and by turbulent\nconvection within the cloud. Gravity will also move the heavy\npositively charged graupel particles downward while the light positive\nice crystals move upward with the convective flow of the cloud air,\ncreating charge centers and electric fields within the cloud.  This\nparticular charging mechanism is based on the intrinsic polarization\nof water molecules.  Macroscopic particles of different material can\ncharge quite efficiently, too, and create electric fields and\ndischarges. Both volcanic ash plumes, so-called dust devils in\nterrestrial deserts and various granular media in the lab support\ndischarges, as is discussed further in\nSect.~\\ref{s:eldis_solsys}\\ref{ss:volc}.  The understanding of\ncharging processes in volcanic ash plumes might inspire further\nprogress on the long standing question of charging normal\nthunderclouds (\\citealt{yair2008}). Such normal water clouds mixed\nwith dust have recently been observed to exhibit particularly strong\nand exceptional discharges (\\citealt{fuellekrugebeam2013}).\n\nDue to the attachment of ions to water droplets, electric charges in clouds are particularly immobile. The conductivity in the remaining gas phase\nis therefore low before lightning activity starts.  This low\nconductivity (hence low degree of ionization, see also\nFig.~\\ref{tab:comp}) supports a high electric field up to the moment\nof discharging.\n\n\\paragraph{The stages of lightning:}\nLightning is the sudden release of the electric potential energy\nthrough the fast growth of a disperse network of ionized channels.  On\naverage, $44\\pm 5$ lightning flashes (intracloud and cloud-to-ground\ncombined) occur around the globe every second\n(\\citealt{chr2003}). Moreover, according to OTD (Optical Transient\nDetector) measurements, lightning occurs mainly over land areas with\nan average land/ocean ratio of aproximately 10:1\n(\\citealt{chr2003}). The visible growing channels are called lightning\nleaders; their path is prepared by streamer coronae. While streamers\nare space charge driven ionization fronts, leaders maintain their\ninternal conductivity by increased temperature, molecular excitations\nand ionization reactions in the discharge channel. If a\nconducting channel connects cloud and ground, the return stroke\ncarries the largest current and is visible and audible as the\nlightning stroke; but intra- and intercloud lightning are much\nmore likely. The stages of lightning have been described in many articles,\nwith varying emphasis on phenomena or physical mechanisms. A few\nrecent ones are by \\cite{bara2000, coo2003, RakovUman2003, betz2009,\nDwyerUman2014, coo2015}.\n\nA long standing question is how lightning can be initiated because the\nobserved electric fields are below the classical break-down field\n(where electron impact ionization overcomes electron attachment to\noxygen in the Earth atmosphere;\ne.g. \\citealt{treumann2008,hellingjsd2013}), and free electrons are\nnot available anywhere in the atmosphere.  \\cite{Gurevich1992}\nsuggested that cosmic particle showers could supply free electrons,\nand that relativistic run--away electron avalanches could develop in\nan electric field below the classical breakdown\nvalue. \\cite{Gurevich2013} recently suggested that the interplay of a\ncloud particle with Cosmic Rays could start the discharge.  A\nquantitative analysis confirming this scenario is presented\nby \\cite{dubinova2015}.\n\nLightning occurs not only between cloud and ground, but also within\nand between clouds. Also the 'bolt from the blue' is a phenomenon\nwhere a lightning strike seems to appear out of a blue sky next\nto a thundercloud. These strikes are an indication that lightning\nleaders can leave the cloud also at its upper edge or in the sideward\ndirection and then turn downwards.\n\n\\paragraph{Transient Luminous Events:}\nThe full scale discharge activity associated with terrestrial water\nclouds became known in the scientific literature only after 1989 when\nthe first Transient Luminous Events were described (for article\ncollections, see \\cite{full2006,es2008}). Basically, electric\npotential stored in a cloud can also discharge in the upward direction\nas a jet up into the stratosphere or as a gigantic jet that\nextends into the mesosphere. The primary  lightning can drive\nsecondary discharges, namely elves, halos and sprites in the E layer\nof the ionosphere, and in the night time mesosphere (where the D layer\nof the ionosphere is located during day time)\\footnote{The electron\ndensity at these altitudes is an important parameter for discharge\nmodeling. Only recently a method was developed to determine it\npartially and indirectly (\\citealt{Lay2010,Lay2013}).}. Elves and\nhalos are responses of the lower edge of the ionospheric E layer to\nthe electromagnetic pulse and the quasi-static potential of the parent\nlightning stroke, while sprites propagate downward from the ionosphere\ninto the mesosphere (so-called column sprites) and sometimes back up\nagain (carrot\nsprites; \\citealt{Nielsen2008}, \\citealt{luque2009}). Due to\nsimilarity relations between discharges at different atmospheric\ndensities (\\citealt{pasko2007,EbertJGR2010}), tens of kilometers long\nsprite discharge channels in the thin upper atmosphere are physically\nsimilar to cm size streamer discharges at normal temperature and\npressure - up to corrections due to different electron attachment and\ndetachment reactions that can explain long-delayed sprites\n(\\citealt{luque2012}).  Sprites are  pure streamer discharges\n(\\citealt{liu2004a,liu2004b}), and therefore are less complex than lightning\nstrokes with their streamer, leader and return stroke stages, \nevolving on very different scales of space, time and energy. Due to\nthe efforts of many authors in the past 20 years, the models for\nstreamer discharges are now becoming more quantitative, so that we now\napproach the quantitative understanding  of sprite discharges\nthrough detailed modelling and experimental efforts (\\citealt{nij2014a})\n\n\n\\paragraph{Gamma-Ray Flashes and other high energy emissions from thunderstorms:}\nIn 1994, the BATSE\\footnote{http://gammaray.nsstc.nasa.gov/batse/}\nsatellite detected gamma radiation from earth, and it was recognized\nthat this radiation came from thunderstorms\n(\\citealt{fish1994,fish1995}).  Later also beams of electrons (\\citealt{dwyer2008}) and even\npositrons (\\citealt{Briggs2011}) were discovered from satellites . The\nFermi Gamma-Ray Space Telescope detected a clear positron annihilation\nsignal over Egypt from a thunderstorm over Zambia where the two events\nwere connected in space and time through a geomagnetic fields line\n(that electrons and positrons follow sufficiently high in the\nionosphere where collisions with air molecules is\nnegligible; \\citealt{Briggs2011}). High energy X-rays were also\ndetected from lightning leaders approaching ground and from long\nsparks in the laboratory, see, e.g. \\cite{Kochkin2012}. We refer to\nthe review by \\cite{DwyerUman2014}.  It is clear that electrons are\naccelerated into the run-away regime within the electric fields inside\nand above the thunderstorm, where they continuously gain more energy\nfrom the field than they can lose in collisions with neutral air\nmolecules. These collisions with molecules result in X- or gamma ray\nemission (Bremsstrahlung). The gamma-rays are ionizing radiation and\ngenerate electron positron pairs, or liberate neutrons or protons in\nphotonuclear reactions (\\citealt{Babich2014}).\n\nThere are two basic mechanisms discussed in the literature for the\nprimary electron acceleration: either Galactic Cosmic Rays with\nsufficient energy to penetrate deep into the atmosphere and to\ngenerate relativistic run-away electrons avalanches (RREAs) in the\nelectric fields inside the thundercloud, or the acceleration of low\nenergy free electrons into the high-energy run-away regime at the tip\nof a lightning leader where electric fields are very high. The review\nby \\cite{DwyerUman2014} favors the RREA mechanism, in agreement with\nthe previous model development by the first author. The alternative is\nthe runaway of thermal electrons at the leader tip suggested\nby \\cite{Xu2012}. Such detailed models depend on the model parameters\nfor the background cloud field and its geometry, on the altitude of the\nlightning leader, but also on the collision cross-sections at the\nrequired energies that are  not reliably available.\n\n\\cite{fuellekrugebeam2013} reported on the observation of two consecutive positive lightning discharges\nwhere the first positive lightning discharge initiates sprite\nstreamers which discharge the lightning electromagnetic field above\nthe thundercloud. This was seen as a pulsed discharge event followed\nby a high-energy electron beam. A small number of stratospheric,\ncharged aerosols was likely present as result of a Sahara dust storm\nand forest fires in Spain providing a collimating electric field\ngeometry that accelerated the electrons.  This is the first\nsimultaneous detection of radio signatures from electrons accelerated\nto thermal and relativistic energies above thunderclouds. \n\n\n\n\n\n\\subsection{The Wilson Global Circuit}\\label{ss:globcirc}\n\nThe vertical structure of conductivity in the atmosphere, with the\nupper and lower conducting regions each able to sustain a local\npotential, allows a vertical potential difference to exist between the\ntwo regions. Investigations using balloon measurements from the late\n1800s showed a variation in potential with atmospheric  height (\\citealt{nicoll2012}), with\nthe upper conducting region being about 250kV positive with respect to\nthe lower conducting region. The finite conductivity of the\nintermediate atmosphere between these charged regions allows a\nvertical current to flow. This current was observed directly by CTR\nWilson (\\citealt{wilson1906}) in fair weather conditions with no local charge\nseparation. CTR Wilson concluded that the current flow was likely to\nbe sustained by charge separation in distant disturbed weather\nregions. Evidence supporting this is that the diurnal variation in\nUniversal Time (UT) near-surface electric field, measured under fair\nweather conditions, is independent of where it is measured globally,\nand shows strong similarities with the diurnal variation in active\nglobal thunderstorm area (\\citealt{whipple1936}). This diurnal\nvariation in surface atmospheric electric field is known as the\nCarnegie curve, after the sailing vessel on which the original\ndefining measurements were made (\\citealt{harr2013}).\n\nThe conceptual model that described the electrical transport across the\nplanet between disturbed weather and fair weather zones - the global\natmospheric electric circuit (\\citealt{wilson1921, wilson1929}) - has provided a\nfruitful description for investigation of terrestrial atmospheric\nelectrification, which may offer useful insights for other atmospheres\n(\\citealt{aplinh2008}). Although the original reasoning used to identify\nthe global circuit was based on current flow considerations, the wide\nrange of timescales of the contributing processes leads to a\ndistinction being made conventionally between the AC and DC global\ncircuit (\\citealt{rycroft2012}).\n\n\\begin{figure}\n\\begin{center}\n\\scalebox{0.7}{\\includegraphics[angle=0]{GH_fig4.png}}\n\\caption{Schematic depiction of the role of ionization from Solar Energetic Particles (SEP), Relativistic Electron Precipitation (REP) and Galactic Cosmic Rays (GCR), in facilitating the current flow within the global atmospheric electric circuit. Natural sources of radioactivity include isotopes within the soil and the release of radon (from \\cite{nicoll2014}).}\n\\label{fig:GH4}\n\\end{center}\n\\end{figure}\n\\paragraph{The AC global circuit:}\nThe upper and lower conducting regions of the terrestrial atmosphere\nform a simple waveguide, in which electromagnetic waves can propagate,\nas originally predicted by Schumann\n(\\citealt{schumann1952}). Lightning provides a source of such\nelectromagnetic radiation to excite waves in this cavity oscillator,\nand natural resonances with a fundamental mode at about 8Hz as\npredicted were first observed at the earth's surface in the 1960s\n(\\citealt{balser1960, rycroft1965}). These natural resonances in the\nearth-ionosphere cavity (Q resonator) constitute the AC global\nelectric circuit. Somewhat surprisingly, resonances at 8, 14, 20 Hz\nare also observed on satellites at altitudes of several hundred km,\nabove the ionosphere (\\citealt{simoes2011,dudkin2014}). Although\nthe electric field measured is much smaller at a satellite platform\ncompared with ground based measurements (three orders of magnitude\nsmaller for the first Schumann peak), the fact that it is detectable\nat all offers the possibility for fly-by measurements at other\nplanetary bodies.\n\n\n\\paragraph{The DC global circuit:}\nFigure~\\ref{fig:GH4} summarizes the DC current flow in the Wilson\nglobal circuit. Charge separation in disturbed weather regions leads\nto current flow within the ionosphere, fair weather regions and\nthe planetary surface. The vertical conduction current density,\n$J_{\\rm c}$, in fair weather regions is  $\\sim$2pA m$^{-2}$,\nwhere the resistance of a unit area column of atmosphere, $R_{\\rm c}$,\nis about 100 to 300 P$\\Omega$m$^2$ (\\citealt{rycroft2000}). If\nhorizontal layers of cloud or particles are present, the electrical\nconductivity is reduced because of the removal of the ions providing\nthe conductivity by the particles. Hence, for a passive particle\nlayer, this means that the layer also defines a region of reduced\nconductivity. If a current passes vertically through the passive\nparticle layer (PPL), charging will result at the step change in\nconductivity at the upper and lower layer boundaries. The charging can\nbe derived by assuming no horizontal divergence of the current (as is\nobserved, \\citealt{gring1986}), and assuming Ohm's Law and Gauss' Law\nin one dimension. For a conductivity $\\sigma_{\\rm t}(z)$ varying with\nheight $z$, the charge per unit volume $\\rho_{\\rm e}$ is given\nby \n", "index": 3, "text": "\\begin{equation}\n\\rho_{\\rm e} = \\epsilon_0 J_{\\rm c} \\frac{d}{dz}\\big(\\frac{1}{\\sigma_{\\rm t}(z)}\\big)\n\\label{eq:GH2}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\rho_{\\rm e}=\\epsilon_{0}J_{\\rm c}\\frac{d}{dz}\\big{(}\\frac{1}{\\sigma_{\\rm t}(z%&#10;)}\\big{)}\" display=\"block\"><mrow><msub><mi>ρ</mi><mi mathvariant=\"normal\">e</mi></msub><mo>=</mo><mrow><msub><mi>ϵ</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>J</mi><mi mathvariant=\"normal\">c</mi></msub><mo>⁢</mo><mfrac><mi>d</mi><mrow><mi>d</mi><mo>⁢</mo><mi>z</mi></mrow></mfrac><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mfrac><mn>1</mn><mrow><msub><mi>σ</mi><mi mathvariant=\"normal\">t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}]