[{"file": "1601.07549.tex", "nexttext": "\n\n\\noindent where $\\Delta v_{\\rm FWHM}$ is the width of the integrated [CII] line of each component and $R_{\\rm 1/2}$ is the radius of the size of the [CII] emission. Since the size of the [CII] emission in SMG1 and SMG2 was derived by assuming elliptical gaussian profiles (see \\S \\ref{CII_morphology}), $R_{\\rm 1/2}$ is assumed to be the average value of the semi major and minor axis (measured from FWHM). The derived dynamical masses with this method for SMG1 and SMG2 ($M_{\\rm dyn}^{\\rm SMG1} \\sim 3.6 \\times 10^{11} M_\\odot$ and $M_{\\rm dyn}^{\\rm SMG2} \\sim 2.3 \\times 10^{11} M_\\odot$) are then higher than the molecular gas masses. As pointed out in \\cite{Engel2010ApJ...724..233E}, the scaling factor appropriate for a rotating disk at an average inclination is a factor of $\\sim 1.5$ smaller \\citep{Bothwell2010MNRAS.405..219B}. Applying this correction to our measurements, the derived dynamical masses would be still higher than the molecular gas masses. In any case, to carry out a meaningful comparison between the molecular gas and dynamical mass and put constraints in the $\\alpha_{\\rm CO}$ conversion factor, low-$J$ CO observations would be needed.\n\nWe now examine whether the two disks in SGP38326 are stable by using the Toomre parameter $Q$ \\citep{Toomre1964ApJ...139.1217T}. It characterizes the stability of a disk against gravitational fragmentation. In this sense, a disk is stable is $Q > 1$. We calculate the Toomre parameter by following \\cite{Swinbank2015ApJ...806L..17S}: $Q = \\sigma_r \\kappa / \\pi G \\Sigma_{\\rm gas}$, where $\\kappa = a V_{\\rm max} / R$ is the epicyclic frequency (with $a = \\sqrt{3}$), $\\sigma_r$ is the velocity dispersion (that we obtain from the [CII] emission line), and $\\Sigma_{\\rm gas}$ is the gas mass surface density. Using that equation we obtain $Q^{\\rm SMG1} = 0.57 \\pm 0.10$ and $Q^{\\rm SMG2} = 0.19 \\pm 0.10$. These results indicate that the two disks are not stable. For comparison, \\cite{Swinbank2015ApJ...806L..17S} obtained $Q = 0.30 \\pm 0.10$ for SDP.81, a strongly lensed galaxy at $z \\sim 3$ observed with ALMA at very high spatial resolution \\citep{Vlahakis2015ApJ...808L...4A,Dye2015MNRAS.452.2258D}. This value is in between the ones derived for SGP38326, which are also lower than the average values found for the gas in local ULIRGs \\citep{Downes1998ApJ...507..615D} and on gas-rich star-forming disks at $z \\sim 2$ \\citep{Genzel2014ApJ...785...75G}, although their sample also include galaxies with values as low as the one found for SMG2.\n\n\n\n\n\\subsection{The spatially resolved $L_{\\rm [CII]} / L_{\\rm IR}$ ratio}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.44\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/ciidust_map.eps}\n\\caption{Resolved $L_{\\rm [CII]} / L_{\\rm IR}$ ratio map for our pair of SMGs. The $L_{\\rm IR}$ for each pixel has been calculated from the observed flux density and using an extrapolation based on the median SED of SMGs in the ALESS survey \\citep{Swinbank2014MNRAS.438.1267S}, which produces a good fit to our photometric data points. The different morphology of dust and [CII] means that the [CII]/FIR ratio is higher in the outer parts of the galaxies and lower in the centre (where the peak of dust continuum emission is located). It should be noted that the yellow regions actually represent a lower limit of the $L_{\\rm [CII]} / L_{\\rm IR}$ ratio, since they correspond to regions where dust emission is not detected at $> 3\\sigma$.\n              }\n\\label{cii_dust_ratio_map}\n\\end{figure}\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=0.52\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/ciidust.eps}\n\\hspace{-15mm}\n\\includegraphics[width=0.52\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/sigma_LIR.eps}\n\\caption{[CII] to $L_{\\rm IR}$ ratio for our pair of interacting starbursts as a function of their total IR luminosity (\\emph{left}) and their IR surface density (\\emph{right}). On the left panel, the values for the two SMGs (SMG1 being [1] and SMG2 being [2]) in SGP38326 are shown with orange filled dots and compared with previous results (grey dots) for submm galaxies at similar or higher redshifts \\citep{Swinbank2012MNRAS.427.1066S,Walter2012Natur.486..233W,Riechers2013Natur.496..329R,Rawle2014ApJ...783...59R,DeBreuck2014A&A...565A..59D,Riechers2014ApJ...796...84R,Tanio2015arXiv151104079D} and with local IR-bright galaxies \\citep{DiazSantos2013ApJ...774...68D}. For lensed sources, the values included in the Figure has been corrected for amplification. We also represent the individual pixel values on the $L_{\\rm [CII]} / L_{\\rm IR}$ map (brown dots) after resampling the pixels to make them match with the size of the synthesized beam (see text for details). Red dots with arrows indicate upper limits of the $L_{\\rm [CII]} / L_{\\rm IR}$ and correspond to regions where there is [CII] emission but no dust continuum detection at $3 \\sigma$. The IR luminosities in \\cite{DiazSantos2013ApJ...774...68D} have been converted to $L_{\\rm 8 - 1000 \\mu m}$ by multiplying by a 1.8 factor. Our SMGs are on the bright side of the brightness distribution of previous SMGs with [CII] detections, and they also have amongst the lowest $L_{\\rm [CII]} / L_{\\rm IR}$ ratios. In the right panel, the black curve represents the best-fit for local galaxies in \\cite{Lutz2015arXiv151102075L}, with the dashed curves representing the scatter of the local relation. We compare the location of our two SMGs with dusty starbursts at similar or higher redshifts. Despite the small number of galaxies, there is an indication that galaxies with the highest SFR and star formation surface density (SMG1, AzTEC-3 and HFLS3) tend to depart from the local relation towards higher values of the $L_{\\rm [CII]} / L_{\\rm IR}$ ratio.\n              }\n\\label{cii_dust_ratio_integrated_values}\n\\end{figure*}\n\nOur high-spatial resolution observations also allow us to obtain the first resolved $L_{\\rm [CII]}/L_{\\rm IR}$ ratio map in a dusty starburst at $z > 4$. We have obtained the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio map by simply dividing the $L_{\\rm [CII]}$ and $L_{\\rm IR}$ maps. It should be noted that no convolution is required since the spatial resolution of the [CII] and dust continuum map is the same. The $L_{\\rm [CII]}$ map has been obtained from the [CII] moment-0 map by converting the line intensities on each pixel into line luminosities. The $L_{\\rm IR}$ map has been derived from the observed 870$\\mu$m dust continuum map by assuming the conversion from flux density to total IR luminosity at $z = 4.425$ derived from the average FIR SED of SMGs in ALESS \\citep{Swinbank2014MNRAS.438.1267S}, which is a good representation of the FIR SED of SGP38326.\n\nThe distinct dust and [CII] morphology leads to a complex spatial distribution for the [CII] to $L_{\\rm IR}$ ratio (Fig.~\\ref{cii_dust_ratio_map}), which is higher in the outer parts of the two starbursts and lower in their centres, in agreement with what is observed for local LIRGs \\citep{Tanio2014ApJ...788L..17D}. It should be noted that the yellow regions in Figure \\ref{cii_dust_ratio_map} indicate a lower limit for the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio since they correspond to regions where dust continuum has not been detected under the depth of the observations, but there is detectable [CII] emission (recall that [CII] is extended over larger regions than the dust, \\S \\ref{CII_morphology}). Explaining the irregular morphology of the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio is challenging due to the many phases of the ISM the [CII] is affected by (see \\S \\ref{CII_morphology}). The most likely explanations might be different excitations conditions and dust optical depth across the disks. The presence of an AGN can also lower the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio \\citep{DiazSantos2013ApJ...774...68D}. The effect of an AGN could therefore be responsible for the low values of the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio in the center of the galaxies and in their integrated values (see below). We cannot rule out AGN activity, but its influence would not be surprising since AGNs seem to be ubiquitous in the strongest starbursts at lower redshifts \\citep{Ivison2013ApJ...772..137I}. The presence of significant gradients in the resolved $L_{\\rm [CII]}/L_{\\rm IR}$ map indicates that dust and gas does not necessarily have to be coupled, and their geometry and spatial extend differ. This is the first time that a resolved $L_{\\rm [CII]}/L_{\\rm IR}$ map has been presented for a $z > 4$ SMG. Larger samples of galaxies would be needed to explore at high resolution whether this different morphology is present in most of the population of dusty starbursts at $z > 4$ and also in less extreme star forming systems.\n\nFigure \\ref{cii_dust_ratio_integrated_values} compares the integrated values of the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio with sources at similar redshifts and in the local Universe. The left panel of Figure \\ref{cii_dust_ratio_integrated_values} shows that the values found for the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio in SMG1 and SMG2 are typically lower than those found in other IR bright galaxies at similar and higher redshifts \\citep{Swinbank2012MNRAS.427.1066S,Walter2012Natur.486..233W,DeBreuck2014A&A...565A..59D,Riechers2014ApJ...796...84R,Tanio2015arXiv151104079D} and in the local Universe \\citep{DiazSantos2013ApJ...774...68D}. Our two interacting starbursts have $L_{\\rm IR}$ on the bright end of the $L_{\\rm IR}$ distribution of $z > 4$ galaxies, suggesting that the anti-correlation between $L_{\\rm [CII]}/L_{\\rm IR}$ ratio and $L_{\\rm IR}$ seen in the local Universe holds up to $z \\sim 4$, but with an offset in $L_{\\rm IR}$.\n\nWe also present in Figure \\ref{cii_dust_ratio_integrated_values} the individual pixel values of the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio for SMG1 and SMG2. Since the synthesized beam is sampled by approximately 5 pixels on each size, we have re-binned the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio map every 5 pixels, so each new pixel approximately samples the area of one synthesized beam. Average values across contiguous pixels are taken during map re-sizing. For those regions with [CII] but no dust continuum detection we have given lower limits instead. The individual pixel values suggest that galaxy regions associated with higher star formation have lower $L_{\\rm [CII]}/L_{\\rm IR}$ ratios.\n\nA tight correlation between the $L_{\\rm [CII]}/L_{\\rm IR}$ ratio and the IR surface density has been reported in local galaxies \\citep{Lutz2015arXiv151102075L}. This relation and its typical scatter is represented in the right panel of Figure \\ref{cii_dust_ratio_integrated_values} along with the derived values for SMG1 and SMG2 and other $z > 4$ starbursts with measured sizes. We have defined the IR surface density as $\\Sigma_{\\rm IR} = L_{\\rm IR} / (\\pi R_{\\rm a} R_{\\rm b})$, where $R_{\\rm a}$ and $R_{\\rm b}$ are the major and minor axis radii (derived by ${\\rm FWHM / 2}$ from a elliptical gaussian profile) of the continuum dust emission of each galaxy. Interestingly, the local relation holds, within the uncertainties, for SMG2 and also for other sources at $z > 4$. However, SMG1 and the most extreme sources at high redshift such as AzTEC-3 or HFLS3 depart from that relation, having $L_{\\rm [CII]}/L_{\\rm IR}$ ratios higher than the local relation for a given IR surface density. SMG1, AzTEC-3 and HFLS3 are close to the Eddington limit. This might indicate that the [CII] emission in those galaxies might be excited by an outflow. In fact, strong OH 163$\\mu$m emission has been detected in AzTEC-3 and HFLS3 \\citep{Riechers2013Natur.496..329R,Riechers2014ApJ...796...84R}, supporting the presence of outflowing material. However, no clear signature of OH 163$\\mu$m emission or outflowing material (apart from the extended $^{12}$CO(5--4) emission shown in Figure \\ref{dust_CO_morph_3comp}) has been detected in SMG1 (see \\S \\ref{lack_OH_emission}), leaving unknown the reason of its enhanced $L_{\\rm [CII]}/L_{\\rm IR}$ ratio with respect to its IR surfaced density. \n\n\n\n\n\n\n\n\n\n\n\\section{Conclusions}\\label{concluuuuu}\n\nIn this work we have presented ALMA high-spatial resolution ($\\sim 0.1''$ or $\\sim 800 \\,{\\rm pc}$) imaging of the gas and dust in SGP38326, an interacting pair of IR-bright starburst at $z = 4.425$. Despite the redshift of the two galaxies being unknown when the ALMA 870$\\mu$m continuum observations were defined, the [CII] and OH emission lines were luckily covered by the continuum spectral setup. This offered the opportunity of studying at high resolution the properties of the ISM in the likely progenitor of a massive, elliptical galaxy at $z \\sim 3$. The main conclusions of our work are:\n\n\\begin{itemize}\n\n\\item The dust continuum emission (rest-frame 160$\\mu$m) in our pair of interacting starbursts at $z = 4.425$ presents a relatively smooth distribution at the resolution of our data and is distributed over an area of $2.2 \\pm 0.2 \\,{\\rm kpc} \\times 2.0 \\pm 0.2 \\,{\\rm kpc}$ in SMG1 and $2.1 \\pm 0.2 \\,{\\rm kpc} \\times 1.5 \\pm 0.1 \\,{\\rm kpc}$ in SMG2 (values quote FWHM of a 2D gaussian elliptical profile). However, the gas traced by [CII] emission has a more irregular morphology and is more extended than the gas, being extended over an area of $3.8 \\pm 0.1 \\, {\\rm kpc} \\times 2.9 \\pm 0.1 \\, {\\rm kpc}$ in SMG1 and $2.7 \\pm 0.1 \\, {\\rm kpc} \\times 2.1 \\pm 0.1 \\, {\\rm kpc}$ in SMG2.\n\n\\item  A dynamical analysis of the resolved [CII] emission revealed that the velocity fields of the two interacting components of SGP38326 are compatible with disk-like ordered ration, in contrast with other extreme IR-bright starburst in the early Universe. The velocity field of the two interacting starbursts does not show any clear sign of outflowing material. In fact, the 163 $\\mu$m emission line (a tracer of molecular outflows), if present, is much fainter and narrower than in other extreme starbursts in the early Universe.\n\n\\item Our high-resolution observations allowed us to build the first resolved $L_{\\rm [CII]} / L_{\\rm IR}$ map of a dusty starburst at $z > 4$. Due to the different morphologies of the dust and gas, the $L_{\\rm [CII]} / L_{\\rm IR}$ ratio is lower in the center of the galaxies and higher in the outer parts, where there is [CII] emission but no continuum is detected at $>3\\sigma$. This is consistent with what has been reported in the local Universe. The pixel values on the $L_{\\rm [CII]} / L_{\\rm IR}$ map suggest that regions with higher star formation have lower associated $L_{\\rm [CII]} / L_{\\rm IR}$ values.\n\n\\item Our results support a scenario where the most distant starbursts were formed in the same highly dissipative mergers of gas-rich galaxies that seem ubiquitous amongst SMGs at $z < 3$, in contrast with recent simulations that invoke the need of cold flows to trigger extreme star formation.\n\n\\end{itemize}\n\nSystems like SGP38326 are truly important to understand early massive galaxy formation. The SFR of SGP38326 will decline with an $e$-folding timescale of $\\tau_{\\rm gas} \\sim 100 \\, {\\rm Myr}$. This assumes a Salpeter IMF and $\\tau_{\\rm gas} = 2 \\times M({\\rm H_2})/{\\rm SFR}$, where the factor of two accounts for the 50\\% gas recycling in stellar evolution \\citep{Fu2013Natur.498..338F}. This is a simplistic approach since it does not include the possible effect of gas outflow and inflow, but we can assume that they roughly compensate each other during galaxy growth (if there are strong outflows, $\\tau_{\\rm gas}$ would be even lower). With that timescale, all the gas would have been consumed in $\\sim 0.5\\,{\\rm Gyr}$ (or $\\sim 1$ Gyr if Chabrier IMF was assumed). Therefore, our extremely bright interacting starbursts are the likely progenitor of a massive elliptical at $z \\sim 3$. We are, consequently, witnessing the formation of the red sequence of galaxies \\citep{Kriek2008ApJ...682..896K}.\n\n\\begin{acknowledgements}\nIO, RJI, ZYZ, LD, and SM acknowledge support from the European Research Council in the form of the Advanced Investigator Programme, 321302, {\\sc cosmicism}. IRS acknowledges support from STFC (ST/L00075X/1), the ERC Advanced Investigator programme DUSTYGAL 321334 and a Royal Society/Wolfson Merit Award. This paper makes use of the following ALMA data: ADS/JAO.ALMA\\#2013.1.00001.S and ADS/JAO.ALMA\\#2013.1.00449.S. ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada) and NSC and ASIAA (Taiwan) and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ.\" The {\\it H}-ATLAS is a project with {\\it Herschel}, which is an ESA space observatory with science instruments provided by European-led Principal Investigator consortia and with important participation from NASA. The {\\it H}-ATLAS website is http://www.h-atlas.org/.\n\\end{acknowledgements}\n\n\n\n\n\\bibliographystyle{mn2e}\n\n\\bibliography{cii_references}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 45171, "prevtext": "\n\n\n\n\n\n\\title{Witnessing the birth of the red sequence: ALMA high-resolution imaging of [CII] and dust in two interacting ultra-red starbursts at $z = 4.425$}\n\n\n\n\n\n\n\n\n\n\n\\author{I. Oteo\\altaffilmark{1,2},\nR. J. Ivison\\altaffilmark{2,1},\nL. Dunne\\altaffilmark{1,3}, \nI. Smail\\altaffilmark{4},\nM. Swinbank\\altaffilmark{4,5},\nZ-Y. Zhang\\altaffilmark{1,2},\nA. Lewis\\altaffilmark{1},\nS. Maddox\\altaffilmark{1,3},\nD. Riechers\\altaffilmark{6},\nS. Serjeant\\altaffilmark{7},\nP. Van der Werf\\altaffilmark{8},\nM. Bremer\\altaffilmark{9},\nP. Cigan\\altaffilmark{3},\nD. L. Clements\\altaffilmark{10},\nA. Cooray\\altaffilmark{11},\nH. Dannerbauer\\altaffilmark{12},\nS. Eales\\altaffilmark{3},\nE. Ibar\\altaffilmark{13},\nH. Messias\\altaffilmark{14},\nM.~J.~Micha{\\l}owski\\altaffilmark{1}\n}\n\n\n\\affil{$^1$Institute for Astronomy, University of Edinburgh, Royal Observatory, Blackford Hill, Edinburgh EH9 3HJ UK}\n\\affil{$^2$European Southern Observatory, Karl-Schwarzschild-Str. 2, 85748 Garching, Germany}\n\\affil{$^3$School of Physics and Astronomy, Cardiff University, The Parade, Cardiff CF24 3AA, UK}\n\\affil{$^4$Centre for Extragalactic Astronomy, Department of Physics, Durham University, South Road, Durham DH1 3LE UK}\n\\affil{$^5$Institute for Computational Cosmology, Department of Physics, Durham University, South Road, Durham DH1 3LE, UK}\n\\affil{$^6$2Department of Astronomy, Cornell University, Ithaca, NY 14853, USA}\n\\affil{$^7$Department of Physical Sciences, The Open University, Milton Keynes, MK7 6AA, UK}\n\\affil{$^8$Leiden Observatory, Leiden University, P.O. Box 9513, NL-2300 RA Leiden, The Netherlands}\n\\affil{$^9$H.H. Wills Physics Laboratory, University of Bristol, Tyndall Avenue, Bristol BS8 1TL, UK}\n\\affil{$^{10}$Physics Department, Blackett Lab, Imperial College, Prince Consort Road, London SW7 2AZ, UK}\n\\affil{$^{11}$Department of Physics and Astronomy, University of California, Irvine, CA 92697}\n\\affil{$^{12}$Universit{\\\"a}t Wien, Institut f{\\\"u}r Astrophysik, T{\\\"u}rkenschanzstrasse 17, 1180 Wien, Austria}\n\\affil{$^{13}$Instituto de Física y Astronomía, Universidad de Valparaíso, Avda. Gran Bretaña 1111, Valparaiso, Chile}\n\\affil{$^{14}$Centro de Astronomia e Astrof\\'isica da Universidade de Lisboa, Observat\\'orio Astronómico de Lisboa, Tapada da Ajuda, 1349-018, Lisbon, Portugal}\n\n\\email{ivanoteogomez@gmail.com}\n\n\n\n\n\n\n\n  \n\\begin{abstract}\n\nExploiting the sensitivity and spatial resolution of the Atacama Large Millimeter/submillimeter Array (ALMA), we have studied the morphology and the physical scale of the interstellar medium - both gas and dust - in SGP38326, an unlensed pair of two interacting starbursts at $z = 4.425$. SGP38326 is the brightest star bursting system ever found at $z > 4$ with an IR-derived ${\\rm SFR \\sim 4300 \\,} M_\\odot \\, {\\rm yr}^{-1}$. SGP38326 also contains a molecular gas reservoir among the most massive ever found in the early Universe, and it is the likely progenitor of a massive, red-and-dead elliptical galaxy at $z \\sim 3$. Probing scales of $\\sim 0.1''$ or $\\sim 800 \\, {\\rm pc}$ we find that the smooth distribution of the continuum emission from cool dust grains contrasts with the more irregular morphology of the gas, as traced by the [CII] fine structure emission. The gas is also extended over larger physical scales than the dust. The velocity information provided by the resolved [CII] emission reveals that the dynamics of the two components of SGP38326 is compatible with disk-like, ordered rotation. Our observations support a scenario where at least a subset of the most distant extreme starbursts are highly dissipative mergers of gas-rich galaxies, in contrast with recent models claiming the need of cold flows to trigger extreme star formation.\n\n\\end{abstract}\n\n\\keywords{galaxy evolution; sub--mm galaxies; dust emission; number counts}\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\\label{intro}\n\nNear-IR imaging surveys have uncovered a significant number of galaxies at $z > 8.5$ \\citep{Bouwens2014ApJ...795..126B}, perhaps as high as $z \\sim 11.9$ \\citep{Ellis2013ApJ...763L...7E}. Complementary to this work, ground-based (sub)mm surveys have revolutionized our understanding of the formation and evolution of galaxies, revealing a population of dusty starbursts at $z > 1$ that are forming stars at tremendous rates \\citep{Blain2002PhR...369..111B,Chapman2005ApJ...622..772C,Weiss2009ApJ...707.1201W,Geach2013MNRAS.432...53G,Casey2013MNRAS.436.1919C}. At $z > 4$ these starbursts can be linked to the formation of the so-called red-sequence -- passively evolving, early type galaxies which dominate the cores of clusters out to at least $z \\sim 1.5$ \\citep[e.g.][]{Stanford2006ApJ...646L..13S,Rosati2009A&A...508..583R,Mei2009ApJ...690...42M,Strazzullo2010A&A...524A..17S,Tozzi2015ApJ...799...93T}. While the bulk of star formation in the {\\it general} population of galaxies occurred in the period since $z \\sim 2$ \\citep{Sobral2013MNRAS.428.1128S}, red-sequence galaxies at $z > 1.5$ formed the bulk of their stellar population at much earlier times and over a brief time interval \\citep{Thomas2005ApJ...621..673T,Thomas2010MNRAS.404.1775T}. Therefore, analysing strong starbursts at $z > 4$ is a way to study the likely progenitors of the most massive elliptical galaxies at $z > 1.5$ and, consequently, the birth of the galaxy red sequence, which might have appeared as early as $z > 2$ \\citep{Kodama2007MNRAS.377.1717K,Zirm2008ApJ...680..224Z,Kriek2008ApJ...682..896K,Gabor2012MNRAS.427.1816G,Hartley2013MNRAS.431.3045H}.\n\n{\\it Herschel} extragalactic imaging surveys such as H-ATLAS \\citep[][Valiante et al. in prep]{Eales2010PASP..122..499E} and HerMES \\citep{Oliver2010A&A...518L..21O} have covered about $1000 \\, {\\rm deg}^2$ to the SPIRE confusion limit. As a consequence, the number of known dusty starburst has increased from several hundred to several hundred thousand. Most of these are at $z < 3$, but there is also a population of sources at $z > 4$. Dusty starbursts at $z > 4$ can be found by looking for galaxies whose far-IR (FIR) spectral energy distributions (SEDs) rise from 250$\\mu$m to 500$\\mu$m, so their thermal dust emission peak is redshifted close or beyond 500$\\mu$m. These are called 500$\\mu$m risers. By using {\\it H}-ATLAS data we have built a sample of dusty starbursts at $z > 4$ whose SPIRE flux densities satisfy $S_{\\rm 500\\mu m} / S_{\\rm 250 \\mu m} > 2$ and $S_{\\rm 500\\mu m} / S_{\\rm 350 \\mu m} > 1$. The resulting population was inspected by eye in each SPIRE band to exclude blended sources, checked for contamination by radio-loud AGN and correlated with deep WHT/VISTA/Gemini optical/NIR imaging to reject any lenses that might have crept in despite our low median $S_{\\rm 500\\mu m}$ of $\\sim 50 \\, {\\rm mJy}$. Over 150 of these 500$\\mu$m risers were followed up with SCUBA-2 \\citep{Holland2013MNRAS.430.2513H} and LABOCA \\citep{Siringo2009A&A...497..945S} to improve FIR photometric redshifts and select only those whose colors are consistent with $z > 4$ by imposing $S_{\\rm 870 \\mu m} / S_{\\rm 500 \\mu m} > 0.4$. These are called {\\it ultra-red starbursts} (Ivison et al. in prep.).\n\nIn this paper we present ALMA high-spatial resolution ($\\sim 0.1''$) observations of dust and gas (traced by [CII] emission) in SGP38326, one of our selected ultra-red starbursts confirmed to be at $z = 4.425$ via multi-CO line detection. The total IR luminosities ($L_{\\rm IR}$) reported in this work refer to the integrated luminosities between rest-frame 8 and 1000$\\mu$m. Throughout this paper, the reported SFRs are derived from the total IR luminosities ($L_{\\rm IR, 8-1000\\mu m}$) assuming a Salpeter IMF and the \\cite{Kennicutt1998ARA&A..36..189K} calibration. When needed, the values taken from the literature have been re-scaled accordingly. We assume a flat universe with $(\\Omega_m, \\Omega_\\Lambda, h_0)=(0.3, 0.7, 0.7)$, and all magnitudes are listed in the AB system \\citep{Oke1983}. For this cosmology, the sky scale is $\\sim 6.6\\,{\\rm kpc}/''$ at $z = 4.425$, the redshift of SGP38326.\n\n\\section{ALMA data}\\label{sec_desctiption_ALMA_data}\n\nThis work makes use of ALMA data from two different projects. Project 2013.1.00449.S was aimed at deriving redshifts via spectral scans in the ALMA 3mm window (PI. A. Conley) of a sample of ultra-red starburst at $z > 4$ of which SGP38326 was part of. Project 2013.1.00001.S was aimed at studying at high-spatial resolution the dust continuum morphology at 870$\\mu$m of a subsample of our ultra-red starburst (PI. R.J. Ivison) of which SGP38326 was also part of. The details of the calibration of the ALMA data will be presented elsewhere. Briefly, the ALMA data corresponding to the two projects were calibrated by using the ALMA pipeline and by executing different ALMA calibration scripts depending on the date when the data were released. The calibrated visibilities for the calibrators and science target were visually inspected and only very minor further flagging was required. The calibrated visibilities of the science target were then imaged in CASA by using a {\\sc natural} weighting scheme to maximize sensitivity. The different tunings of the ALMA 3mm spectral scan were carried out at different dates with the array in different configurations. Therefore, the beam size is different for each tuning. In this work we only use the ALMA 3mm data corresponding to the tunings where the $^{12}$CO(4--3) and $^{12}$CO(5--4) lines were detected. The beam sizes were $1.5'' \\times 1.2''$ and $1.1'' \\times 1.0''$ for the $^{12}$CO(4--3) and $^{12}$CO(5--4) transitions, respectively. The r.m.s. of the $^{12}$CO(4--3) and $^{12}$CO(5--4) observations are $0.54 \\, {\\rm mJy \\, beam^{-1}}$ and $0.64 \\, {\\rm mJy \\, beam^{-1}}$, respectively, in $50 \\, {\\rm km/s}$ channels. The beam size of the 870$\\mu$m observations is $0.16'' \\times 0.12''$, which corresponds to a physical scale of about $1.0 \\, {\\rm kpc} \\times 790 \\, {\\rm pc}$. The r.m.s. of the 870$\\mu$m continuum map is $0.11 \\, {\\rm mJy \\, beam^{-1}}$, while the r.m.s. in the spectral window where [CII] is detected is $0.66 \\, {\\rm mJy \\, beam^{-1}}$ in $100 \\, {\\rm km/s}$ channels.\n\n\\section{SGP38326: a pair of interacting starbursts at $z = 4.425$}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/CII_spec_SMG1.eps}\\\\\n\\vspace{-9mm} \n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/CII_spec_SMG2.eps}\\\\\n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/OH_spec.eps}\n\\caption{\\emph{Upper and middle}: Unambiguous confirmation that SGP38326 lies at $z = 4.425$ via detection of $^{12}$CO(5--4) and $^{12}$CO(4--3) in an ALMA 3mm spectral scan. The [CII] emission of the two interacting components of SGP38326 (see text for more details) are also shown. The CO spectra have been re-scaled (multiply by 3 for $^{12}$CO(5--4) and 6 for $^{12}$CO(4--3)) to match the flux scale of the [CII] line. \\emph{Bottom}: Faint (or absent) OH 163$\\mu$m emission in SMG1. The green curve represents the spectrum in the center of SMG1 (extracted from an aperture equal to one synthesized beam), where dust emission is at its maximum. The brown spectrum has been extracted using an aperture enclosing the whole area where [CII] emission is detected. Small vertical grey lines represent where the two components of the OH 163$\\mu$m would be located assuming the redshift derived from the detected CO and [CII] lines. There is a narrow ($ 81 \\pm 16 \\, {\\rm km \\, s^{-1}}$, FWHM) emission line at $\\sim -400\\,{\\rm km \\, s^{-1}}$ at the center of SMG1 (where the dust continuum emission is at its maximum) that we tentatively associate to OH 163$\\mu$m emission (see details in \\S \\ref{lack_OH_emission}). No OH 163 $\\mu$m emission or absorption is detected in SMG2 either (spectrum not shown for the sake of representation clarity). We note that the nearby $^{12}$CO(16--15) line is not covered by the spectral setup. In all panels, the spectra shown were extracted after continuum subtraction.\n              }\n\\label{spec_CO_CII_lines}\n\\end{figure}\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/dust_CO.eps}\\\\\n\\vspace{-7mm}\n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/velomap_CO54}\n\\caption{\\emph{Upper}: ALMA 870$\\mu$m continuum map of SGP38326. The three detected SMGs are indicated. The grey contours represent the integrated $^{12}$CO(5--4) emission. This line is clearly detected in both SMG1 and SMG2, but there is no $^{12}$CO(5--4) detection in SMG3. The separation between SMG1 and SMG3 is $2.2''$. There is no detection of $^{12}$CO(4--3) or [CII] in SMG3. This suggests that SMG3 is at different redshift, although the non detection cannot confirm whether this is true. Therefore, we focus our work on SMG1 and SMG2. The beam sizes of the $^{12}$CO(5--4) (grey ellipse, $1.1'' \\times 1.0''$) and dust continuum (white ellipse, $0.16'' \\times 0.12''$) observations are shown, and clearly highlight the impressive increase in spatial resolution. \\emph{Bottom}: Velocity map of SMG1 derived from the $^{12}$CO(5--4) emission using moment masking \\citep{Dame2011arXiv1101.1499D}. It can be seen that, despite the lack of spatial resolution, the $^{12}$CO(5--4) observations already indicate that SMG1 presents a disk-like rotation. In both panels, north is up and east is left.\n              }\n\\label{dust_CO_morph_3comp}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.48\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/velo_dust.eps} \\\\\n\\includegraphics[width=0.22\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/profile_majoraxis.eps} \n\\hspace{-2mm}\n\\includegraphics[width=0.22\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/profile_minoraxis.eps}\\\\\n\\vspace{-6mm}\n\\includegraphics[width=0.22\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/profile_majoraxis_SMG2.eps} \n\\hspace{-2mm}\n\\includegraphics[width=0.22\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/profile_minoraxis_SMG2.eps}\\\\\n\\caption{Morphology and spatial extent of the gas and dust in our two distant interacting starbursts. In the top panel, the background image is the integrated [CII] emission created by using moment masking \\citep{Dame2011arXiv1101.1499D}, while grey contours represent dust emission at rest-frame 160$\\mu$m. Contours are plotted from 3$\\sigma$ to 7$\\sigma$ in steps of 2$\\sigma$ and from 10$\\sigma$ to 25$\\sigma$ in steps of 5$\\sigma$, where $\\sigma = 0.11 \\, {\\rm mJy \\, beam^{-1}}$. The two interacting galaxies are separated by a physical distance of $\\sim 10 \\, {\\rm kpc}$. The beam size is also included. It can be seen that the dust continuum is smooth at the resolution of these data. However, the gas reservoir (as traced by [CII] emission) has an irregular morphology and is extended over larger physical scales. In this panel, north is up and east is left. The bottom panels shows the radial profiles (normalized units) of dust and gas along the [CII] major and minor axes of each starburst. It can be seen that the profiles are significantly different, with [CII] emission being more extended than dust, especially in SMG1.\n              }\n\\label{radial_profiles_dust_CII_figure}\n\\end{figure}\n\nSGP38326 was selected in the {\\it Herschel} ATLAS \\citep{Eales2010PASP..122..499E} as a 500$\\mu$m riser (see \\S \\ref{intro}). Its SPIRE flux densities of SGP38326 are $S_{\\rm 250 \\mu m} = 28.6 \\pm 5.2 \\, {\\rm mJy}$, $S_{\\rm 350 \\mu m} = 28.6 \\pm 5.8 \\, {\\rm mJy}$, $S_{\\rm 500 \\mu m} = 46.2 \\pm 6.8 \\, {\\rm mJy}$. As it was done for a subset of the 500$\\mu$m risers, SGP38326 was subsequently observed with SCUBA-2 at 870 $\\mu$m to confirm its far-infrared (FIR) redness and improve the photometric redshift estimate (Ivison et al. in prep). By fitting a set of FIR templates to its SPIRE and SCUBA-2 ($S_{\\rm 870 \\mu m} = 32.5 \\pm 4.1 \\, {\\rm mJy}$) flux densities we determined a best-fit photometric redshift $z_{\\rm phot} \\sim 4.5$ for SGP38326. \n\nThe ALMA spectral scan in the 3mm window confirmed its redshift to be $z = 4.425 \\pm 0.001$ via detection of the $^{12}$CO(4--3) and $^{12}$CO(5--4) emission lines (Fig.~\\ref{spec_CO_CII_lines}). The total IR luminosity of SGP38326, obtained from SED fit to {\\it Herschel} and LABOCA flux densities, is then $L_{\\rm IR} / L_\\odot \\sim 2.5 \\times 10^{13}$, implying a staggering IR-derived ${\\rm SFR} \\sim 4300 \\, M_\\odot \\, {\\rm yr}^{-1}$, among the strongest starbursts in the early Universe found so far (see Table \\ref{table_comparison_sources}). The detected CO emission lines are extremely wide, ${\\rm FWHM_{^{12}CO(4-3)} = 1081 \\pm 91 \\, {\\rm km \\, s^{-1}}}$ and ${\\rm FWHM_{^{12}CO(5-4)} = 1278 \\pm 84 \\, {\\rm km \\, s^{-1}}}$, from gaussian fits. This is compatible with SGP38326 being formed by at least two starburst in the process of interaction as already seen in extreme starburst at lower redshifts with similarly wide CO lines \\citep{Fu2013Natur.498..338F,Ivison2013ApJ...772..137I}. In fact, the $^{12}$CO(5--4) observations resolved SGP38326 into two interacting components, SMG1 and SMG2 (see Figure \\ref{dust_CO_morph_3comp}). The $^{12}$CO(5--4) emission in SMG1 presents an elongated extention towards the south. This can be interpreted as a faint and relatively dust poor CO emitter interacting with SMG1 and SMG2, a CO bridge connecting the two interacting components (see also later in the text), or an outflow. The depth and resolution of the data are insufficient to fully discriminate between the two possible scenarios. As it will be explained later in the text, the [CII] velocity map shows no evidence of outflowing atomic gas and the OH 163$\\mu$m emission (a tracer of molecular outflows) is not clearly detected in SMG1 despite the detection of the continuum at the line frequency. The existence of the CO bridge is supported by the detection of similar structures in other systems of interacting starbursts at lower redshifts \\citep{Fu2013Natur.498..338F} and QSOs \\citep{Carilli2013ApJ...763..120C}. The velocity map of SMG1 obtained from the $^{12}$CO(5--4) emission is compatible with an ordered rotation (see Figure \\ref{dust_CO_morph_3comp}). As it will be shown in \\S \\ref{dynamics_from_CII_line}, this velocity structure is in agreement with that obtained from the [CII] emission at $\\sim 10$x times better spatial resolution (see \\S \\ref{dynamics_from_CII_line}).\n\nSGP38326 is resolved into three 870$\\mu$m components (see Figure \\ref{dust_CO_morph_3comp}), as are many bright SMGs \\citep{Karim2013MNRAS.432....2K,Hodge2013ApJ...768...91H,Simpson2015ApJ...799...81S,Simpson2015ApJ...807..128S,Bussmann2015ApJ...812...43B}. SMG1 and SMG2 (Fig.~\\ref{radial_profiles_dust_CII_figure}) are the brightest components (see flux densities in Table \\ref{table_values_individual_sources}) are both at the same redshift, $z = 4.425$. There is no [CII] or CO emission detected in SMG3 ($S_{\\rm 870 \\mu m}^{\\rm SMG3} = 1.7 \\pm 0.4 \\, {\\rm mJy}$), located $2.2''$ away from SMG1. This might indicate that SMG3 has a different redshift than SMG1 and SMG2. However, SMG3 is about 14 times fainter than the SMG1 and SMG2 combined. If we assume that the CO luminosity scales with the total IR luminosity, the peak flux of the CO lines would be much lower than the r.m.s. of the observations. The same happens to [CII] assuming again that its luminosity scales with the total IR luminosity. Therefore, with the current data, is not possible to clarify whether SMG3 is also interacting with SMG1 and SMG2. From now on, we focus out study on SMG1 and SMG2, the two clear components of the merging system. These are separated by $\\sim$10 kpc in the plane of the sky and their properties are summarized in Table \\ref{table_values_individual_sources}. \n\nDue to the high brightness of SGP38326, we should wonder whether it emission has been amplified by gravitational lensing. SGP38326 has no near-IR counterpart on the VIKING survey (the closest VIKING-detected source is $\\sim7.5''$ away). The $5 \\sigma$ limiting magnitudes of the VIKING survey is range from $23.1 \\, {\\rm mag}$ in $Z$ band to $21.2 \\, {\\rm mag}$ in $K_s$ band. Assuming that lens galaxies are ellipticals, the limiting magnitude in $Z$ would imply $I < 23.1 \\, {\\rm mag}$. Therefore, the lack of VIKING detection would imply that any potential lensing galaxy would be significantly fainter than the lenses in the H-ATLAS survey discovered so far \\citep{Bussmann2013ApJ...779...25B}. Additionally, the dust continuum emission does not show any evidence of lensing, as it does in some ultra-red starburst at $z > 4$ (Oteo et al. in prep). Therefore, neither of the two merging components is lensed, in contrast with other high-$z$ extremely bright galaxies reported in the literature, such as HFLS3 \\citep{Riechers2013Natur.496..329R,Cooray2014ApJ...790...40C}, HDF\\,850.1 \\citep{Walter2012Natur.486..233W}, HXMM01 \\citep{Fu2013Natur.498..338F} or HATLAS\\,J084933 \\citep{Ivison2013ApJ...772..137I}.  \n\n\\begin{table}\n\\caption{Observed properties of our two interacting dusty starbursts}\\label{table_values_individual_sources}\n\\centering\n\\begin{tabular}{ccc}\n\\hline\n& SMG1 & SMG2 \\\\\n\\hline\n\\hline\n$z_{\\rm spec}$ & $4.4237 \\pm 0.0004$ & $4.4289 \\pm 0.0004$ \\\\\n$S_{\\rm 870 \\mu m}$\\tablenotemark{a}& $16.3 \\pm 1.1 \\, {\\rm mJy}$ & $7.3 \\pm 0.5 \\, {\\rm mJy}$ \\\\\n$I_{\\rm CO(5-4)} \\, [{\\rm Jy \\, km \\, s^{-1}}]$ & $3.8 \\pm 0.5$ & $1.9 \\pm 0.2$ \\\\\n$I_{\\rm [CII]} \\, [{\\rm Jy \\, km \\, s^{-1}}]$ & $13.9 \\pm 1.1$ & $5.3 \\pm 0.6$ \\\\\n$\\Delta v_{\\rm [CII]} \\, [{\\rm km \\, s^{-1}}]$ & $626 \\pm 60$ & $585 \\pm 95$ \\\\\n$L_{\\rm IR}\\,[L_\\odot]$ & $(1.6 \\pm 0.3) \\times 10^{13}$ & $(7.9 \\pm 0.3) \\times 10^{12}$ \\\\\n${\\rm SFR \\, [M_\\odot \\, yr^{-1}]}$ & $\\sim 2900$ & $\\sim 1400$\\\\\n$A_{\\rm dust}\\,[{\\rm kpc^2}]$\\tablenotemark{b} & $\\rm 2.2\\pm0.2 \\times 2.0\\pm0.2$ & $2.1\\pm0.2 \\times 1.5\\pm0.1$ \\\\\n$A_{\\rm [CII]}\\,[{\\rm kpc^2}]$\\tablenotemark{b} & $3.8\\pm0.1 \\times 2.9\\pm0.1$ & $2.7\\pm0.1 \\times 2.1\\pm0.1$ \\\\\n$\\Sigma_{\\rm SFR}\\,[{\\rm M_\\odot \\, yr^{-1} \\, kpc^{-2}}]$ & $\\sim 840$ & $\\sim 420$ \\\\\n$M_{\\rm H_2} \\, [M_\\odot]$ & $ \\sim 2.3 \\times 10^{11}$ & $ \\sim 1.2 \\times 10^{11}$ \\\\\n$M_{\\rm dust} \\, [M_\\odot]$ &  $\\sim 1.9 \\times 10^{9}$ & $\\sim 6.9 \\times 10^{8}$ \\\\\n$T_{\\rm dust}$ [K] & $\\sim 33$ & $\\sim 34$\\\\\n$L_{\\rm [CII]} \\, [L_\\odot]$ &  $(8.3 \\pm 0.2) \\times 10^9$ & $(2.9 \\pm 0.2) \\times 10^9$\\\\\n\\hline\n\\hline\n\\end{tabular}\n\\tablenotetext{1}{Flux densities derived from the ALMA 870$\\mu$m observations (\\S \\ref{sec_desctiption_ALMA_data}) after primary beam attenuation correction. At the high signal to noise of the 870$\\mu$m detections, the effect of flux boosting is negligible \\citep{Oteo2015arXiv150805099O}.}\n\\tablenotetext{2}{The reported values are ${\\rm FWHM_{major} \\times FWHM_{minor}}$, where ${\\rm FWHM_{major}}$ and ${\\rm FWHM_{minor}}$ are obtained from a two-dimensional elliptical gaussian profile fit to the observed emission.}\n\n\\end{table}\n\n\\subsection{A massive molecular gas reservoir}\\label{section_massive_mol_gas_reser}\n\nThe integrated $^{12}$CO(5--4) emission shown in Figure \\ref{dust_CO_morph_3comp} can be used to estimate the total mass of the molecular gas reservoir in SGP38326, as well as the molecular gas mass of each interacting component. The $^{12}$CO(1--0) transition is a better tracer of the total molecular gas mass than mid-$J$ CO lines, which trace only a relatively dense component. In order to convert the derived $^{12}$CO(5--4) luminosities (see the line intensities in Table \\ref{table_values_individual_sources}) to the $^{12}$CO(1--0) luminosities we have assumed the CO line ratio for SMGs \\citep{Carilli2013ARA&A..51..105C}, $L'_{\\rm CO(5-4)} / L'_{\\rm CO(1-0)} = 0.39$. Then the molecular gas masses are calculated by using $\\alpha_{\\rm CO} = 0.8 M_\\odot \\, ({\\rm K \\, km \\, s^{-1} \\, pc^2})$, a value typically assumed for high-$z$ starbursts and local ULIRGs \\citep{Downes1998ApJ...507..615D}. The derived values are shown in Table \\ref{table_values_individual_sources}. The total molecular gas of SGP38326 ($M_{\\rm g, \\, total} = M_{\\rm g}^{\\rm SMG1} + M_{\\rm g}^{\\rm SMG2}$ -- see also Table \\ref{table_comparison_sources}) is higher than that in any other system so far studied at similar redshifts (see Table \\ref{table_comparison_sources}). However, we note that the calculation of the molecular gas mass from a single mid-$J$ transition might be highly uncertain due to the effect that variation in excitation has on the CO line ratios. Actually, for SMGs, the distribution of $L'_{\\rm CO(5-4)} / L'_{\\rm CO(1-0)}$ has a relative wide spread \\citep{Carilli2013ARA&A..51..105C}. Further observations will be thus need to confirm if the high luminosity of the $^{12}$CO(5--4) transition is due to the presence of a very massive molecular gas reservoirs and not a highly excited gas component.\n\nDespite the synthesized beam of the $^{12}$CO(5--4) observations is relatively large (although comparable to most of the beams in pre-ALMA observations) we have estimated the size of the CO emission in the two components of SGP38326 in order to derive their molecular gas mass density. Carrying out a elliptical gaussian profile fits, we have derived values $A_{\\rm g}^{\\rm SMG1} = 9.5 \\pm 1.3 \\, {\\rm kpc} \\times 3.4 \\pm 2.11 \\, {\\rm kpc}$ and $A_{\\rm g}^{\\rm SMG2} = 9.2 \\pm 1.4 \\, {\\rm kpc} \\times 4.1 \\pm 1.3 \\, {\\rm kpc}$. {\\bf The quoted values correspond to the major and minor axes, respectively, of the best-fitted ellipse}. The large values of the CO extension are largely due to the unresolved, diffuse CO emission between the two components of the merger. These values are actually considerably smaller than the extension of the dust and the gas traced by [CII] at much higher spatial resolution (see \\S \\ref{dust_morph_size} and \\S \\ref{CII_morphology}). The derived sized in combination with the molecular gas max give gas mass surface densities of $\\Sigma_{\\rm g}^{\\rm SMG1} \\sim 0.9 \\times 10^4 \\, M_\\odot \\, {\\rm pc^{-2}}$ and $\\Sigma_{\\rm g}^{\\rm SMG2} \\sim 0.4 \\times 10^4 \\, M_\\odot \\, {\\rm pc^{-2}}$. These values are among the highest ever found for high-redshift starburtsts \\citep{Daddi2010ApJ...714L.118D,Magdis2012ApJ...760....6M,Hodge2015ApJ...798L..18H}\n\n\n\n\n\n\\begin{table*}[!t]\n\\begin{center}\n\\caption{Properties of SGP38326 compared to other IR-bright starbursts in the distant Universe.}\n\\label{table_comparison_sources}\n\\begin{tabular}{l c c c c c c c c}\n\\hline\nSource\t&\tredshift\t& $S_{\\rm 870 \\mu m} \\, [{\\rm mJy}]$\t\t& SFR [$M_\\odot \\, yr^{-1}$] & $M_{\\rm H_2} \\, [M_\\odot]$\\tablenotemark{a} & $\\Sigma_{\\rm SFR} \\, [M_\\odot \\, {\\rm yr}^{-1} \\, {\\rm kpc}^{-2}]$ & Lensed?\\tablenotemark{b} & Reference \\\\\n\\hline\nSGP38326\t\t\t&\t4.425\t& $32.5 \\pm 4.1$ &\t$\\sim 4300$\\tablenotemark{c}\t&\t$\\sim 3.5 \\times 10^{11}$\t&  $\\sim 840$ / $\\sim 420$\\tablenotemark{d} & No\t\t\t& This work\t\t\t\t\\\\\nGN20\t\t\t\t&\t4.055\t& $20.3 \\pm 2.1$ &\t$\\sim 3000$\t&\t$\\sim 1.3 \\times 10^{11}$\t&\t$\\sim 100$\t & No & \t\\cite{Hodge2012ApJ...760...11H}\t\\\\\nHDF\\,850.1\t\t\t&\t5.183\t& $7.0 \\pm 0.4$&\t$\\sim 850$\t\t&\t$\\sim 3.5 \\times 10^{10}$\t& \t$\\sim 35$\t& Yes & \t\\cite{Walter2012Natur.486..233W}\t\t\t\t\t\\\\\nHLS0918\t\t&\t5.243\t& $14.0 \\pm 0.9$&\t$\\sim 2100$\t&\t$\\sim 8.3 \\times 10^{9} $\t& $\\sim 500$\t\t\t\t& Yes & \\cite{Rawle2014ApJ...783...59R} \\\\\nAzTEC-3\t\t\t&\t5.299\t& $6.20 \\pm 0.25$\\tablenotemark{e}&\t$\\sim 1980$\t&\t$\\sim 5.3 \\times 10^{10}$\t& $\\sim 850$\t\t& No & \\cite{Riechers2014ApJ...796...84R}\t\t\t\t\t\\\\\nHFLS3\t\t\t\t&\t6.337\t& $14.3 \\pm 1.1$&\t$\\sim 2100$\t&\t$\\sim 3.6 \\times 10^{10}$ \t& $\\sim 600$\t& Yes\t\t& \\cite{Riechers2013Natur.496..329R}\t\t\t\t\t\\\\\n\n\n\n\\hline\n\\end{tabular}\n\\tablenotetext{1}{Molecular gas masses reported assume an $\\alpha_{\\rm CO} = M_{\\rm gas} / L^{'}_{\\rm CO} = 0.8 \\, {\\rm K \\, km \\, s^{-1} \\, pc^{2}}$, typical for high-redshift starbursts and local ULIRGs \\citep{Downes1998ApJ...507..615D}. Values taken from the literature have been scaled accordingly.}\n\\tablenotetext{2}{For lensed galaxies, de-magnified values are listed.}\n\\tablenotetext{3}{Total SFR in SGP38326: ${\\rm SFR = SFR_{SMG1} + SFR_{SMG2}}$.}\n\\tablenotetext{4}{Values for SMG1 and SMG2 are given.}\n\\tablenotetext{5}{Measured at 1mm.}\n\\end{center}\n\\end{table*}\n\n\n\n\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan4_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan5_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan6_velo.eps} \\\\\n\\vspace{-0.5mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan7_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan8_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan9_velo.eps}\\\\\n\\vspace{-0.5mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan10_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan11_velo.eps} \n\\hspace{-2.4mm}\n\\includegraphics[width=0.32\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/chan12_velo.eps} \n\\caption{Dynamics of SGP38326 at high-spatial resolution from [CII] emission: [CII] velocity channel contours are overlaid on the [CII] moment-0 map. The velocity channels have been averaged over 100 ${\\rm km \\, s^{-1}}$. Contours in the velocity channels start at $\\pm 3\\sigma$ and are represented in steps of 1$\\sigma$ (1$\\sigma = 0.66 \\, {\\rm mJy \\, beam^{-1}}$). Green arrows and associated numbers indicate the velocity gradients identified in the continuum-subtracted [CII] data cube.\n              }\n\\label{velocity_map_CII_channels}\n\\end{figure*}\n\n\n\n\n\n\n\\subsection{Dust continuum morphology}\\label{dust_morph_size}\n\nAlthough SGP38326 is resolved into two interacting galaxies, each of them is an extremely luminous starburst in its own right. The dust continuum emission of SMG1 and SMG2 (rest-frame 160 $\\mu$m) is relatively smooth (see grey contours in Fig.~\\ref{radial_profiles_dust_CII_figure}). At this spatial resolution, there is no clear evidence of clumpy emission in SMG1 and SMG2. Therefore, we interpret that the enormous star formation in SMG1 and SMG2 has been powered by their interaction. The physical extent of the dust emission has been measured from the FWHM of a two-dimensional elliptical gaussian profile fit. Table \\ref{table_values_individual_sources} shows the FWHM of the major and minor axis (values shown are ${\\rm FWHM_{major} \\times FWHM_{\\rm minor}}$) of each components of SGP38326. These values are at the high-end of the size distribution of lower-redshift SMGs \\citep{Simpson2015ApJ...799...81S} and larger than found in other samples of SMGs at $z > 3$ \\citep{Ikarashi2015ApJ...810..133I}. SMG1 and SMG2 are, however, considerably smaller than the dust emission in GN20: $\\sim 5.3\\, {\\rm kpc} \\times 2.3 \\, {\\rm kpc}$ \\citep{Hodge2015ApJ...798L..18H}. \n\nTheir size in combination with their IR-derived SFR (see Table \\ref{table_values_individual_sources}) imply that SMG1 and SMG2 have median SFR surface densities of $\\Sigma_{\\rm SFR} \\sim 840\\, {\\rm M_\\odot \\, yr^{-1} \\, kpc^{-2}}$ and $\\Sigma_{\\rm SFR} \\sim 420\\, {\\rm M_\\odot \\, yr^{-1} \\, kpc^{-2}}$, respectively. The $\\Sigma_{\\rm SFR}$ of SMG1 is very close to the theoretically predicted Eddington limit for starburst disks that are supported by radiation pressure \\citep{Andrews2011ApJ...727...97A,Simpson2015ApJ...807..128S}. Such high $\\Sigma_{\\rm SFR}$ values have been only found in the $z = 6.42$ quasar host galaxy J1148+5251 \\citep{Walter2009Natur.457..699W} and the dusty starbursts HFLS3 at $z = 6.34$ and AzTEC-3 \\citep{Riechers2013Natur.496..329R,Riechers2014ApJ...796...84R} and are considerably higher than the $\\Sigma_{\\rm SFR}$ found in other starbursts at similar redshifts (see Table \\ref{table_comparison_sources}). The values found for the SFR surface density, in combination with the derived gas mass surfaces densities (see \\S \\ref{section_massive_mol_gas_reser}) place SMG1 and SMG2 in the sequence of starbursts in the $\\Sigma_{\\rm SFR}-\\Sigma_{\\rm H_2}$ plane, with gas depletion time scales between 10 and 100 Myr \\citep{Hodge2015ApJ...798L..18H}.\n\nUsing the 870$\\mu$m positions for SMG1 and SMG2 obtained from the ALMA high-resolution imaging we have deconvolved their SPIRE and SCUBA-2 flux densities. They were then fitted by using optically thin models of dust emission to derive dust temperatures and dust masses shown in Table \\ref{table_comparison_sources}. The derived gas and dust masses imply gas to dust ratios of $M_{\\rm g} / M_{\\rm d} \\sim 120$ and $\\sim 170$ for SMG1 and SMG2, respectively. These values are compatible with those found for starbursts at similar redshifts \\citep{Magdis2011ApJ...740L..15M}, $z \\sim 0.5 - 1.5$ main-sequence galaxies and classical SMGs \\citep{Magdis2012ApJ...760....6M}, galaxies in the local group \\citep{Leroy2011ApJ...737...12L} and local ULIRGs \\citep{Solomon1997ApJ...478..144S}.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.44\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/velomap} \\\\\n\\vspace{-11mm}\n\\includegraphics[width=0.44\\textwidth]{/Users/ioteo/Documents/ESO/morph/analysis/dispmap}\n\\caption{Resolved velocity (\\emph{upper}) and velocity dispersion (\\emph{bottom}) maps of the two interacting components in SGP38326 obtained from their [CII] emission by using moment masking \\citep{Dame2011arXiv1101.1499D}. As Figure \\ref{velocity_map_CII_channels} suggests, all velocity gradients found in SMG1 and SMG2 are compatible with ordered rotation although with some perturbations, likely due to the effect of the ongoing merger.\n              }\n\\label{fig_velo_moments12}\n\\end{figure}\n\n\n\n\\subsection{Morphology of [CII] emission}\\label{CII_morphology}\n\nThe redshift of SGP38326 was unknown when the 870$\\mu$m continuum ALMA observations were performed. Fortunately, its redshifted [CII] emission was covered by the default continuum setup, offering a unique opportunity to study the ISM of bright starbursts at $z > 4$ at unprecedented spatial resolution. \n\nThe [CII] spectrum of the two merging components of SGP38326 are shown in Figure \\ref{spec_CO_CII_lines}. SMG1 has a broad [CII] line (${\\rm 626 \\pm 60 km \\, s^{-1}}$ FWHM, $L_{\\rm [CII]}/L_\\odot = (8.3 \\pm 0.2) \\times 10^9$), considerably broader than the [CII] emission in other SMGs at similar redshifts \\citep{Swinbank2012MNRAS.427.1066S,Walter2012Natur.486..233W,DeBreuck2014A&A...565A..59D,Riechers2014ApJ...796...84R} and also broader than local ULIRGs \\citep{Farrah2013ApJ...776...38F}. The [CII] emission from SMG2 is slightly narrower (${\\rm 585 \\pm 95 \\, km \\, s^{-1}}$ FWHM, $L_{\\rm [CII]}/L_\\odot = (2.9 \\pm 0.2) \\times 10^9$), with its center shifted $\\sim 300 \\, {\\rm km \\, s^{-1}}$ with respect to SMG1. The detected [CII] emission in SMG1 and SMG2 imply that their redshifts are $z_{\\rm SMG1} = 4.4237 \\pm 0.0004$ and $z_{\\rm SMG2} = 4.4289 \\pm 0.0004$, respectively. The escape velocity of the system (assuming a mass at least as high as the molecular gas mass) is significantly greater than the velocity offset between SMG1 and SMG2, meaning that the systems are destined to merge, in contrast to multiple HyLIRGs seen at lower redshifts \\citep{Ivison2013ApJ...772..137I}. Therefore, our results support a scenario where a subset of the most distant starbursts formed in the same highly dissipative mergers of gas-rich galaxies that seem ubiquitous amongst SMGs at $z < 3$ and local ULIRGs \\citep{Engel2010ApJ...724..233E}. Therefore, we argue that cold flows are not always needed to explain the triggering of extreme star formation in the early Universe \\citep{Narayanan2015Natur.525..496N}.\n\nThe smooth dust morphology contrasts with the more irregular [CII] emission (Fig.~\\ref{radial_profiles_dust_CII_figure}). [CII] can be associated with many ISM phases, such as photodissociation regions associated with star formation \\citep{Stacey1999ESASP.427..973S}, the diffuse or dense molecular medium \\citep{Wolfire2010ApJ...716.1191W} and atomic and ionized gas \\citep{Madden1997ApJ...483..200M}. Additionally, [CII] can be enhanced by shocks \\citep{Appleton2013ApJ...777...66A} and altered by outflows \\citep{Cicone2015A&A...574A..14C}. In the [CII] velocity maps shown in Figure \\ref{velocity_map_CII_channels} there is no evidence for atomic outflows. Therefore, shock enhancing, local star formation conditions and tidal forces triggered by the interaction between the components, coupled with local excitation differences are the most likely explanations of the different morphologies of [CII] and dust. \n\nFigure \\ref{radial_profiles_dust_CII_figure} also shows the profiles of the [CII] and dust emission along the major and minor axis of the [CII] emission of each starburst. In addition to their different morphology, the gas traced by [CII] is extended over larger physical scales than the dust \\citep{Tacconi2006ApJ...640..228T,Ivison2011MNRAS.412.1913I} and also has significantly different radial profiles. This is further supported by the same 2D gaussian fitted used to determine the size of the dust emission. The size of the [CII] emission is $3.8 \\pm 0.1 \\, {\\rm kpc} \\times 2.9 \\pm 0.1 \\, {\\rm kpc}$ in SMG1 and $2.7 \\pm 0.1 \\, {\\rm kpc} \\times 2.1 \\pm 0.1 \\, {\\rm kpc}$ in SMG2, larger than the found for dust (\\S \\ref{dust_morph_size}). This has been reported in other $z > 4$ sources, such as AzTEC-3 \\citep{Riechers2014ApJ...796...84R}, HFLS3 \\citep{Riechers2013Natur.496..329R}, or W2246-0526 \\citep{Tanio2015arXiv151104079D}, but at lower spatial resolution compared with the extention of the emission. Interestingly, some faint, tidal [CII] emission seems to be flowing from SMG1 to SMG2 as a consequence of their interaction. If confirmed, this would be similar to the CO and [CII] bridges that have been previously seen in other extreme starbursting systems \\citep{Fu2013Natur.498..338F,Carilli2013ApJ...763..120C}.\n\nIt should be pointed out that the extension of the [CII] emission is considerably smaller than the extention of the CO emission derived in \\S \\ref{section_massive_mol_gas_reser}. Furthermore, the size of the [CII] emission has lower uncertainties than the CO-based calculations. This is a consequence of the difference in the synthesized beam size of the observations. It can be seen in Figure \\ref{dust_CO_morph_3comp} that the resolution of the [CII] observations is around 10x times better than that of the CO observations, thus providing much more accurate size determinations. This clearly highlights the importance of high-spatial resolution observation in unlensed startbursts, not only at $z > 4$ but also at lower redshifts, to really understand early massive galaxy formation and evolution. \n\n\\subsection{OH 163$\\mu$m emission}\\label{lack_OH_emission}\n\nThe default continuum observations also covered the 163 $\\mu$m OH($^{2}\\Pi_{1/2} J=3/2 \\rightarrow 1/2$) doublet (whose components are at $\\nu_{\\rm rest} = 1834.74735$ and $1834.74735 \\, {\\rm GHz}$). We note that, however, the nearby $^{12}$CO(16--15) emission line is out of the spectral range covered. We present in Figure \\ref{spec_CO_CII_lines} the OH spectrum of SMG1 extracted in the area where dust emission is detected (brown spectrum). We also show (blue spectrum) the OH spectrum of SMG1 extracted on the position where the dust emission peaks and using an aperture of the size of the synthesized beam. Assuming the redshift determined by the CO lines, the two components of the OH doublet should be located at the velocities marked by the short vertical grey lines. Despite the continuum is clearly detected, no OH emission is detected at the expected velocities. However, there is an emission line in the blue spectrum shifted by $\\sim 200 \\, {\\rm km \\, s^{-1}}$ blue-ward that might be associated with the OH doublet since there is no other emission line that could lie at that frequency. An absorption line is apparent in the spectrum of SMG1 about $100 \\, {\\rm km \\, s^{-1}}$ redward of the expected position of any OH emission. However, the centers of the emission and the absorption do not match with the redshifted components of the OH doublet. After continuum subtraction, \\citep{Riechers2014ApJ...796...84R} derived a [CII] peak flux of about $18 \\, {\\rm mJy}$ and a [OH] peak flux of about $2 \\, {\\rm mJy}$ for AzTEC-3. This means a ratio of ${\\rm [CII]/OH \\sim 10}$. The peak flux in SMG1 is $\\sim 20\\,{\\rm mJy}$. Assuming the same ${[CII]/OH}$ ratio than in AzTEC-3, the OH emission would have a line peak of $\\sim 2\\,{\\rm mJy}$, in agreement with the peak flux of the emission line seen in the bottom panel of Figure \\ref{spec_CO_CII_lines}. If the detected emission line was actually one of the OH components, its width ($\\sim 85 \\, {\\rm km} \\, {\\rm s}^{-1}$) is lower than that previously found in strong starbursts in the distant Universe \\citep{Riechers2013Natur.496..329R,Riechers2014ApJ...796...84R}. We note that these are the only two cases where OH 163$\\mu$m emission has been clearly detected in $z > 4$ starbursts. The likely detected OH emission in SMG1 is also very compact, being spatially coincident with the maximum of the dust continuum emission. It should be pointed out that the OH emission is only seen where the dust emission is maximum. In contrast, the absorption is seen across the whole disk (brown spectrum in Figure \\ref{spec_CO_CII_lines}).\n\n\n\n\\subsection{Dynamics at high resolution from [CII] emission}\\label{dynamics_from_CII_line}\n\nThe signal-to-noise of the [CII] detection allows us to study the dynamics of SMG1 and SMG2 lo a level of detail never previously achieved for any $z > 4$ unlensed starburst. We present in Figure \\ref{velocity_map_CII_channels} the [CII] emission in all the velocity channels where it is detected. We have identified six different velocity gradients in SMG1 and two in SMG2, which reveal that both components of SGP38326 are ordered-rotating disks, as corroborated by the [CII] velocity and velocity dispersion maps shown in Figure \\ref{fig_velo_moments12}. It should be noted that the velocity field derived in SMG1 from [CII] is very similar to that obtained from the $^{12}$CO(5--4) transition (see Figure \\ref{dust_CO_morph_3comp}), but with about 10x times better spatial resolution. We have fitted the observed velocity field by using a disk plus dark matter halo model. We should note that, since the rotation curve does not turn over, the disk+halo model is degenerated. In any case, if it is a settled disk, it must be massive, with $v_{\\rm c} \\sim 300 \\, {\\rm km \\, s^{-1}}$ and with a best-fit inclination of $\\sim 65 \\, {\\rm deg}$. This suggests a dynamical mass  $M_{\\rm dyn,\\, SMG1} \\sim 5 \\times 10^{10} \\, M_\\odot$. The dynamical analysis from [CII] emission at high-spatial resolution indicates that the wide, unresolved CO emissions in SGP38326 (see Figure \\ref{spec_CO_CII_lines}) are driven by the interaction of two disks separated by $\\sim 200\\, {\\rm km/s}$ in velocity space. This is contrary, for example, to AzTEC-3, where the [CII] emission (which has half the width of the [CII] emission in SMG1) is supported by emission from a highly dispersed gas \\citep{Riechers2014ApJ...796...84R}.\n\nIt should be pointed out that the derived dynamical mass is lower than the derived molecular gas mass. This contradiction can be explained by the uncertainties involved in the calculation of both of these quantities. The dynamical mass estimate is affected at least by a factor of $\\sim$2 due to the uncertainty in the inclination of the disk and the merger state. The estimation of the molecular gas mass assumes an $\\alpha_{\\rm CO}$ factor (we used the value typically assumed for ULIRGs, see above) and a ratio between the $^{12}$CO(5--4) and $^{12}$CO(1--0) transitions. The derived molecular gas mass would be lower than the obtained value if $\\alpha_{CO}$ is actually lower or if the mid-$J$ CO lines are more excited than the average SMG. As an example, if the CO SLED of our interacting starbursts followed the median trend for QSOs, the derived molecular gas mass would be a factor of $\\sim 2$ lower. Additionally, the ratio between the CO(5--4) and CO(1--0) transitions has a large spread for SMGs \\citep{Carilli2013ARA&A..51..105C} which greatly adds to the uncertainties of the molecular gas mass estimation. Furthermore, the molecular gas mass was determined from the integrated CO emission shown in Figure \\ref{dust_CO_morph_3comp}. As it was commented above, the integrated $^{12}$CO(5--4) showed an extention towards the south. This extended emission was included in the determination of the molecular mass, but it has no clear [CII] counterpart, so it has not been included in the dynamical mass determination. Observations of the $^{12}$CO(1--0) transition would be needed to put a better constraint on the total molecular gas mass of our system. \n\nWe have also determined the dynamical mass of SMG1 and SMG2 by using the isotropic virial estimator \\citep{Tacconi2008ApJ...680..246T,Forster2009ApJ...706.1364F,Engel2010ApJ...724..233E}:\n\n\n", "index": 1, "text": "\\begin{equation}\nM_{\\rm dyn, \\, vir} = 2.8 \\times 10^5 \\Delta v_{\\rm FWHM}^2 R_{\\rm 1/2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm dyn,\\,vir}=2.8\\times 10^{5}\\Delta v_{\\rm FWHM}^{2}R_{\\rm 1/2}\" display=\"block\"><mrow><msub><mi>M</mi><mrow><mi>dyn</mi><mo rspace=\"4.2pt\">,</mo><mi>vir</mi></mrow></msub><mo>=</mo><mrow><mrow><mn>2.8</mn><mo>×</mo><msup><mn>10</mn><mn>5</mn></msup></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>v</mi><mi>FWHM</mi><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>R</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msub></mrow></mrow></math>", "type": "latex"}]