[{"file": "1601.01695.tex", "nexttext": "\n\n\n where, $J_\\alpha$'s are dimensionless coupling constants, $\\sigma^{\\alpha}_k$ is the $\\alpha$-component of Pauli \nmatrices and spin operators are defined as $\\vec{s}_k= \\frac{1}{2} \\vec{\\sigma}_k$. Following  Kitaev \n~\\cite{kitaev-2006}, we introduce a set of four Majorana fermions $\\{ b^x_k, b^y_k, b^z_k, c\\}$ at a given site \n`$k$' to represent the Pauli operators as, $\\sigma_k^{\\alpha}= i b^{\\alpha}_k c^{\\phantom{\\dagger}}_k$ ($\\alpha=x,y,z$). Notice that this \ndefinition implies that the spin operators live in an enlarged Hilbert space. To get the physical spin operators \none has  to enforce the projection in the physical Hilbert space using the operator,  \n$D_k= i b^{x}_k b^y_k b^z_k c=1$, at a given site. However as the $\\sigma^{\\alpha}_k$ operators commutes with  $D_k$, \nwe can use $\\sigma^{\\alpha}_k$ to represent the physical spin operators itself. Substituting the above definition, \nwe can rewrite the  Hamiltonian in Eq. (\\ref{spin-hamiltonian}) as\n\\begin{eqnarray}\nH &=&  \\frac{i}{2} \\sum_{\\langle j,k \\rangle} J_{\\alpha_{jk}} \\hat{u}_{jk} c_j c_k,\n\\label{majorana-hamiltonian}\n\\end{eqnarray}\n\nwhere $ \\hat{u}_{jk}=i b^{\\alpha_{jk}}_j b^{\\alpha_{jk}}_k $ are the link operators  defined on a given link $<jk>$.\nThe remarkable fact which makes Kitaev model an integrable system is that these $ \\hat{u}_{jk}$ operators defined\non each link mutually commute with each other and also commute with the Hamiltonian in Eq.(\\ref{majorana-hamiltonian}). \nThey play the role of  static $Z_2$ gauge field operators as one can readily check that $ \\hat{u}^2_{jk}=1$. \nHere we have  $\\alpha_{jk} = x, y, z$ depending on whether the `$j$' and `$k$' indices form a $x, y$ or $z$ link.  The \noriginal Hamiltonian as given in Eq.(\\ref{spin-hamiltonian}) transforms into an equivalent problem as depicted in \nEq.(\\ref{majorana-hamiltonian}) where one has to solve for a free Majorana fermion hopping problem in the presence of\nstatic $Z_2$ gauge field. For the detail solution and the phase diagram we refer the reader to the original work \nby A. Kitaev ~\\cite{kitaev-2006}; a pictorial summary is presented in the lower panel of Fig. \\ref{Fig1}.  \nWorking in the extended Hilbert space of the spin operators, a general eigenstate \nof the  Hamiltonian in Eq. (\\ref{majorana-hamiltonian}) can be written as,\n\\begin{eqnarray}\n| \\Psi \\rangle = \\frac{1}{2^{N+1}} \\sum_g \\mathcal{D}_g |\\phi(u) \\rangle |u \\rangle,\n\\end{eqnarray}\n\nwhere $N$ is the total number of sites, $|u \\rangle $ describes the $Z_2$ gauge field configurations on each link and $|\\phi(u) \\rangle$ describes\nthe free Majorana fermion wave functions for a given $|u \\rangle $ . $\\mathcal{D}_g= \\prod_k D_k $  and the product \nruns over all the site `$k$'.  The sum $\\frac{1}{2^{N+1}} \\sum_g \\mathcal{D}_g$  represents the gauge average \nover equivalent copies the  physical Hilbert space.  In Yao and Qi's work ~\\cite{yao-qi2010} it has been shown that due to the \nspecial structure of the Hamiltonian in Eq.(\\ref{majorana-hamiltonian}), the  entanglement entropy ($S_A$) of a \nsubsystem `$A$' for a given eigenstate $| \\psi \\rangle$ consists of two contributions and may be written as\n\\begin{eqnarray}\n\\label{gauge-fermi}\nS_A=  S_{A,F} + S_{A,G} -\\rm{ log } 2\n\n\\end{eqnarray}\n\nIn the above expression, the contribution $S_{A,G} $  comes exclusively from the $Z_2$ gauge field and equals  \n$L~{\\rm log }2$  when the subsystem shares  $L$ number of bonds with the rest of the system.  The quantity \n$-\\rm{log\\;} 2$ is a topological quantity dubbed the topological entanglement entropy which is same for both the gapless \nand gapped phases of the Kitaev model.  \n$S_{A,F}$  is the contribution from the free Majorana fermions and can be calculated \nby considering the Hamiltonian identical to Eq. (\\ref{majorana-hamiltonian}) with $\\hat{u}_{jk}$ replaced\n by $\\mathbb{I}_{2\\times2}$. This leads to an enormous simplification for the calculation\nof entanglement entropy of a given subsystem as one needs simply to consider the two point correlation function for a given \nsubsystem `$A$' to get the eigenvalues of the reduced density matrix ~\\cite{peschel-2003}. For a subsystem with boundary of linear size $L$,  \nit can been shown \\cite{yao-qi2010, zanardi-2005} that in the limit $L \\rightarrow \\infty$, an area law~\\cite{Luigi-Amico} $ S_{A,F} \\sim \\alpha L$ holds, \nwhere $\\alpha$ is a \nnon-universal constant that contains necessary information of the entanglement between the subsystem and the rest. \\\\\n\nWe note here, that the entanglement entropy can be written as Eq. (\\ref{gauge-fermi}) for any shape and size of the subsystem and \nthus the entanglement entropy of a given subsystem can in principle be calculated by applying the formalism of Ref. \\onlinecite{peschel-2003}. \nAs mentioned earlier, one of the main aim of this article is to investigate\nthe behaviour of $\\alpha$ in the  parameter space of Kitaev model. Specifically, we are interested to know apart from area \nlaw what additional information might be extracted from the entanglement entropy of the system.\nFor this we examine the entanglement entropy and entanglement gap as a function of the model parameters $J_x,J_y,J_z$. \nFor simplicity we choose certain particular contours in the phase space of Kitaev model to ascertain how the entanglement property \nvaries along these paths. Henceforth, we now consider only the free Majorana fermion Hamiltonian  \ngiven by Eq. (\\ref{majorana-hamiltonian}) with the gauge field $\\hat{u}_{i,j}$  replaced by unity. The \nresulting Hamiltonian can easily be diagonalized by Fourier transform and the ground state correlation function can be\nsubsequently calculated. The free Majorana fermion hopping Hamiltonian has two different topological phases, gapless and gapped \nphases as shown in lower panel of Fig. \\ref{Fig1}. Following Ref. \\onlinecite{peschel-2003} the von-Neumann entanglement entropy \nfor a Majorana fermion can be calculated from the eigenvalues of the correlation matrix of a given subsystem as follows. \\\\\n\nThe correlation matrix of the full system has elements given by\n\n", "itemtype": "equation", "pos": 13164, "prevtext": "\n\\title{Entanglement and Majorana edge states in the Kitaev model}\n\\author{Saptarshi Mandal}\\email{saptarshi@iopb.res.in}\\affiliation{Institute of Physics, Bhubaneswar-751005, Orissa, India}\n\\author{Moitri Maiti }\\email{maiti@theor.jinr.ru}\\affiliation{BLTP, JINR, Dubna, Moscow region, 141980, Russia}\n\\author{Vipin Kerala Varma }\\email{vvarma@ictp.it}\\affiliation{The Abdus Salam ICTP, Strada Costiera 11, 34151, Trieste, Italy}\n\n\\begin{abstract}\nWe investigate the von Neumann entanglement entropy and Schmidt gap in the ground state of the Kitaev model \non the honeycomb lattice for square and cylindrical subsystems.\nWe find that, for both the subsystems, the free-fermionic contribution to the entanglement entropy $S_E$ \nexhibits signatures of the phase transitions between the gapless and gapped phases.\nHowever, we find that $S_E$ does not show an expected monotonic behaviour as a function \nof the coupling $J_z$ between the suitably defined one-dimensional chains within the gapless phase for either geometry; moreover the system \ngenerically reaches a point of minimum entanglement within the \ngapless phase before the entanglement saturates or increases again until the gapped phase is reached. This may be attributed to the competition \nbetween the nearest neighbour correlation functions of the $x-x$ and $z-z$ bonds, and to the onset of gapless $\\vec{k}$-modes in the bulk spectrum. \nOn the other hand $S_E$ always \nmonotonically varies with $J_z$ in the gapped phase independent of the subregion size or shape.\nFinally, further confirming the Li-Haldane conjecture, we find that the Schmidt gap $\\Delta$ defined from the entanglement spectrum also signals the \ntopological transitions but only if there are corresponding zero energy Majorana edge states that \nsimultaneously appear or disappear across the transitions. We analytically corroborate some\nof our results on entanglement entropy, Schmidt gap and the bulk-edge correspondence using perturbation theory. \n\\end{abstract}\n\n\\date{\\today}\n\n\\pacs{\n75.10.Jm \t\n71.10.Pm \t\n03.65.Ud \t\n}\n\\maketitle\n\\section{Introduction}\nEntanglement of quantum states is a non-local phenomena which is a manifestation of the superposition principle of quantum states. \nIn a quantum many body system entanglement of constituting particles or states essentially dictates its\nmacroscopic properties, \\textit{viz.} superconductivity, superfluidity, quantum phase\ntransitions, and suchlike. Recently there has been an active interest to characterize and quantify\nthe notion of entanglement due to its fundamental applicability in quantum information\ntheory, topological quantum computations, and also to various physical system such as\nblack hole physics and generic quantum many body systems ~\\cite{Luigi-Amico, Eisert, \nNishiyoka-2009}. The usual method to measure the entanglement of a part (called subsystem)\nof a composite system (called full system) is to examine the reduced density matrix \nof the subsystem. To this end various definitions have been introduced for characterizing \nthe entanglement \\textit{viz.}  von-Neumann entropy, Renyi entropy \n~\\cite{Renyi-1960, Renyi-1965}, entanglement spectra, Schmidt gap ~\\cite{haldane-2008, konik-2013, berkovits-2015}. \nThese various measures of entanglement are seen to characterize various  physical \nsystems according to their universality classes, follow certain scaling laws and also \ndetect topological orders.  For example, entanglement entropy of one dimensional critical \nsystems with size $L$ is found to vary $\\sim$ $\\log L$ ~\\cite{calabrese-2008,calabrese-2004}.\nFor gapped systems in one dimension scaling of the predictions of the massive field theory \n~\\cite{calabrese-2004} has also been recently verified in dimerized free fermionic models\nhosting topological phases ~\\cite{maiti-2014} and in spin systems ~\\cite{levi-2013}.\nIn two and higher dimensions bosons and fermions are seen to follow different\narea laws ~\\cite{bombelli-1986,plenio-2005,wolf-2006}. Entanglement entropy has also been \nfound to characterize quantum phase transitions ~\\cite{cirac-2005,latorre-2005}.\nFurthermore it has been found that for two dimensions and above entanglement entropy can characterize \nthe topological properties of the system as well \n~\\cite{kitaev-topo, levin-topo}. For non interacting systems, there are well defined prescriptions \nto compute the various entanglement measures discussed above; however, investigation of entanglement\nproperties for interacting systems are severely challenged by the complexity and the \nsize of the Hilbert space as the system size is increased. Evaluating\nthe entanglement entropy is not straightforward in general and powerful numerical algorithms exists \nmostly for one dimensional systems ~\\cite{cirac-2004,murg-2005,zwolak-2004,g-vidal-2004,sirker-2012}. \\\\\n\nThis motivates us to investigate entanglement entropy in an  exactly solvable 2D quantum spin \nmodel, namely, Kitaev model \\cite{kitaev-2003, kitaev-2006} which has attracted a lot of attention \nof the researchers from condensed matter, quantum information theory and specific high energy \ntheorists alike.\nThe model realizes an unusual quantum spin-liquid ground state with short-range \nand bond dependent correlation function ~\\cite{smandal-prl}, topological degeneracies for all \neigenstates \\cite{smandal} and shows a tunable phase transition from topologically trivial phase \nto a non-trivial phase as the parameters of the model Hamiltonian is varied. It is known that this \nmodel reduces to non-interacting Majorana fermion hopping problem in the presence of a background \n$Z_2$ gauge field, thus reducing an otherwise quartic fermionic interaction to an effective quadratic \nfermionic interactions exactly \\cite{kitaev-2006}. All of these intriguing facts motivated a series \nof important studies taking the Kitaev model as a test bed for understanding many fundamental theoretical \nconcepts such as quenching and defect production \\cite{krishnendu-quench-2008}, phase transitions \n\\cite{vidal1-2008}, braiding statistics \\cite{delgado-2007,saptarshi-2014}, dynamics of hole vacancy \n\\cite{gabor-2014}, to name a select few. \\\\\n\nStudies of the entangelment entropy in a particular limit of this model were undertaken early on \\cite{zanardi-2005, castelnovo-2007}. \nZanardi and coauthors verified the area law for the model and by taking \ndifferent partitions of spin configurations had argued that entanglement entropy can be used as \na probe to detect topological order. However this work lacks detailed study on possible subsystem \nconfigurations quite possibly due to the numerical complexities associated with a quantum spin model. \nThis issue has been recently circumvented in an interesting work by \nYao and Qi \\cite{yao-qi2010} where they have shown that for the Kitaev model \nthe entanglement entropy of a given subsystem can be separated into two parts: one part due \nto the $Z_2$ gauge field and the other due to the free Majorana fermions. Following Yao and Qi's work,\n in this paper, we calculate the eigenvalues of reduced density matrix for a system of free \nMajorana fermions in the two dimensional \\textit{viz.} Kitaev model  \nand investigate the entanglement properties in detail for this system which has not been reported before. \n\nMoreover for the \\textit{extended} Kitaev model, a recent density matrix renormalization group study concluded that the \nentanglement entropy and Schmidt gap may only be occasionally employed as a good indicator of the phase transitions between the various phases harboured in the \nextended system, such as the Kitaev spin-liquid phase and certain magnetic phases \\cite{shinjo-2015}.\n\\\\\n\nIn this study, we  present results of entanglement entropy and Schmidt gap for subsystems \nwith square or rectangular block geometry, and one half of the torus (herein called the half-region). For \nsquare block subsystem, the full system is chosen as a torus of $N_x \\times N_y$ (with $ N_x  = N_y $); \nfor the half region the dimension of the torus is taken such that  $ N_x  <  N_y $ and the half-region \nis defined by dividing the torus in y-direction  \ni.e choosing a length $\\frac{N_y}{2}$ in y direction. The subsystems under consideration are sketched in the upper panels of Fig. \\ref{Fig1}\\\\\n\n We first consider the entanglement properties for a coupled chain system\n in the Kitaev model following the geometrical setup adopted in the study of a transverse field Ising model ~\\cite{konik-2013}.\n We view our 2D system as $N$ coupled one dimensional periodic chain and\n consider the subsystem as the first $N/2$ chains. \n For the transverse field Ising model the Schmidt gap shows logarithmic scaling with system size \n $\\Delta \\sim \\textrm{const.}/\\ln{(N/\\pi)}$ ~\\cite{konik-2013}.  \n However for the Kitaev model on a similar geometry Schmidt gap shows a first order jump from a finite value in the gapped weakly coupled chain limit  \n to zero in the gapless phase; the finite size effect in $\\Delta$ is almost absent for this topological phase transition (in contrast to the case of the 2D transverse field Ising \n model) and provides a clear signature of the same.\n Moreover as we increase the inter-coupling chain further and reach the large $J_z$ gapped regime i.e the \n Toric code limit, the entanglement gap \\textit{still} remains zero. Thus we find that although the \n two gapped phases are topologically identical, the Schmidt gaps of a given subsystem are different in \n the two gapped phases indicating that other properties of the subsystem compared with the full system \n plays an important role. In particular we ascribe this to the presence or absence of Majorana edge states in the two gapped phases of the system \n i.e. a vanishing Schmidt gap does not necessarily imply topological order.\\\\\n\n\\begin{figure}\n\\includegraphics[width=0.4\\textwidth]{Fig1.eps}\n\\caption{(Color online) Top panel: geometry of subsystems chosen with square/rectangular block (plot A) and cylindrical/half \nregion (plot B); periodic boundary conditions are imposed on the full system so that a torus is formed. While considering the entanglement entropy and \ngap for the square block, we have chosen the torus such that $N_x = N_y$; on the other hand for the half region $N_y > N_x$. Bottom panel: \nthe real space links of the honeycomb lattice that correspond to the $J_x, J_y, J_z$ couplings (plot C); \nphase diagram of the Kitaev model showing the three gapped phases surrounding the central gapless phase, with the vertical lines \nillustrating the contours we study in this paper (plot D).\n}\n\\label{Fig1}\n\\end{figure}\nFor the square block, even the qualitative behaviour of the entanglement entropy \n depends crucially on the details of the connectivity of the system and shows nonmonotonic behaviour within the gapless phase.\n However at the gapless-gapped transition a cusp in the entanglement entropy is generically visible.\n Within the gapless phase the Schmidt gap is vanishingly small and shows minute nonmonotonic variations, especially close to the conformal critical point; \n in the gapped phases, where the entanglement entropy satisfies the area law  i.e  $(S \\sim \\alpha L^{d-1})$, these variations are proportionally washed away \n and the coefficient $\\alpha$ depends nontrivially on the underlying system parameters.\\\\\nThe organization of the rest of the paper is as follows. In Sec.\\ref{section-1}, we briefly \ndiscuss the Kitaev model and its phase diagram. \nWe also outline the formalism we employ to investigate the\nentanglement properties for this model following Ref. \\onlinecite{peschel-2003}. In Sec.\\ref{section-2}, \nwe present the results of the entanglement entropy and Schmidt gap for the half region which \nhas a cylindrical geometry; in Sec.\\ref{section-3} we discuss the case of square and rectangular blocks. \nIn Sec.\\ref{section-4} we present some analytical \nperturbative calculations to corroborate some of our numerical findings presented in Secs.\\ref{section-2} \nand \\ref{section-3}.  We summarize our primary results in Sec.\\ref{section-5}.\n\n\\section{Kitaev model and entanglement properties}\n\\label{section-1}\nDue to the recent interest in the Kitaev model, a vast literature is already available on\nvarious aspects of this model. However, in this section, we introduce the model briefly for \ncompleteness and self-sufficiency of this article. The original model is defined on a hexagonal \nlattice with each site associated with a spin $\\frac{1}{2}$  object. \nEach spin interacts with its nearest neighbour and the coupling strength depends on the \ndirectionality which is in contrast to the Heisenberg interaction ~$\\vec{s}_i \\ldotp \\vec{s}_j$.\nIn the hexagonal lattice, \nthere are three different orientation of the bonds and we label them as \"$x$-bonds\", \"$y$-bonds\" \nand \"$z$-bonds\". Two nearest-neighbour spins joined by an $\\alpha$ ($\\alpha =x,y,z $) bond \ninteract with the $\\alpha$ component of their spins contributing a term $\\sigma^\\alpha_j\\,\\sigma^\\alpha_k$ \nto the Hamiltonian. Here $j$ and $k$ represent the site indices for two nearest neighbour spins \nsituated at the two ends of the bond. The model Hamiltonian ~\\cite{kitaev-2006} is \ngiven below\n\n\n\n", "index": 1, "text": "\\begin{multline}\nH = -J_{\\alpha} \\sum_{<j,k>_{\\alpha}}\\sigma^{\\alpha}_j\\,\\sigma^{\\alpha}_k,~~~~(\\alpha=x,~y,~z)\n\n\\label{spin-hamiltonian}\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle H=-J_{\\alpha}\\sum_{&lt;j,k&gt;_{\\alpha}}\\sigma^{\\alpha}_{j}\\,\\sigma^{%&#10;\\alpha}_{k},~{}~{}~{}~{}(\\alpha=x,~{}y,~{}z)\\par&#10;\" display=\"block\"><mtable displaystyle=\"true\"><mtr><mtd columnalign=\"left\"><mrow><mi>H</mi><mo>=</mo><mo>-</mo><msub><mi>J</mi><mi>α</mi></msub><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>&lt;</mo><mi>j</mi></mrow><mo>,</mo><mrow><mi>k</mi><msub><mo>&gt;</mo><mi>α</mi></msub><mi/></mrow></mrow></munder><mpadded width=\"+1.7pt\"><msubsup><mi>σ</mi><mi>j</mi><mi>α</mi></msubsup></mpadded><msubsup><mi>σ</mi><mi>k</mi><mi>α</mi></msubsup><mo rspace=\"15.7pt\">,</mo><mrow><mo stretchy=\"false\">(</mo><mi>α</mi><mo>=</mo><mi>x</mi><mo rspace=\"5.8pt\">,</mo><mi>y</mi><mo rspace=\"5.8pt\">,</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.01695.tex", "nexttext": "\n. This can be rewritten as \n\\begin{eqnarray}\nP = iQ\n\\begin{bmatrix}\n0  & -1     &       &        &      &   \\\\\n1  & 0 & \\ddots & \\ddots &        &  \\\\\n  &        & \\ddots & \\ddots & 0 & -1 \\\\\n &       &        &      & 1      & 0\n\\end{bmatrix}\nQ^{T},\n\\end{eqnarray}\n\nwhere $Q$ is the matrix whose columns are composed alternatively of the real and imaginary parts of the eigenvectors of the Majorana Hamiltonian. \nThe eigenvalues $\\lambda_1,...,\\lambda_i,...\\lambda_N$ of $\\tilde{P} \\subset P$ lie between $[-1,1]$, where $\\tilde{P}$ denotes the correlation matrix restricted to the subsystem and \n$N$ denotes the total number of the sites inside the subsystem; then the eigenvalues of the reduced density matrix can be written as \\cite{calabrese-2010,vidal-2004},\n\n\\begin{eqnarray}\n\\Gamma(s_1,...s_i,...s_N)= \\prod_{i=1,N} \\frac{1+ s_i \\lambda_i}{2}\n\\label{density-eigvl}\n\\end{eqnarray}\n\n$s_i$ can take values $\\pm 1$ and thus we obtain in total $2^N$ eigenvalues of the density matrix. The von-Neumann entanglement entropy is thus given by ~\\cite{yao-qi2010},\n\\begin{eqnarray}\n\\label{final-ent}\nS_A = \\sum \\frac{1+ \\lambda_i}{2} {\\rm log} \\frac{1+ \\lambda_i}{2} + \\frac{1- \\lambda_i}{2} {\\rm log} \\frac{1- \\lambda_i}{2} \n\\end{eqnarray}  \n \nEntanglement gap or Schmidt gap is another useful quantity to characterize the entanglement properties and in particular has been conjectured to detect topological order \n\\cite{haldane-2008} and phase transitions \\cite{konik-2013}.\n The entanglement gap may be defined as ~\\cite{haldane-2008, konik-2013}\n\\begin{eqnarray}\n\\Delta_A= - (\\rm{log} \\Gamma_M - \\rm{log} \\Gamma_M^{\\prime}),\n\\end{eqnarray}\nwhere $\\Gamma_M$ and $\\Gamma_M^{\\prime} $ are the largest and the second largest eigenvalues of the density matrix.\n\nFrom Eq. (\\ref{density-eigvl}), it is clear that the $\\Gamma_M$ is obtained when the contribution $\\frac{1+ s_i \\lambda_i}{2}$ \nis maximized i.e one has to consider the contribution $\\textrm{Max} \\Big(\\frac{1+ \\lambda_i}{2}, \\frac{1- \\lambda_i}{2}\\Big)$ for a \ngiven $\\lambda_i$. The second largest eigenvalue is obtained by changing  $(1+ \\lambda)/2$ to $(1-\\lambda)/2$ for the  smallest \nvalue of $|\\lambda|$. With this, entanglement gap can be simplified to\n\\begin{eqnarray}\n\\label{final-gap}\n\\Delta_A= {\\rm log} \\frac{(1+ |\\lambda|_{min})}{(1- |\\lambda|_{min})} \n\\end{eqnarray}\nWe evaluate the quantities given by Eq. (\\ref{final-ent}) and Eq.(\\ref{final-gap}) numerically and discuss the results \nin Sec.\\ref{section-2}. \\\\\n\nBefore we end this section we show how the spectrum, eigenvalues and eigenvectors of the Hamiltonian given in Eq. \n(\\ref{majorana-hamiltonian}) where the $Z_2$ gauge fields are replaced by unity, may be constructed, required for our analytical computations in Sec. \\ref{section-5}. \nThis Hamiltonian can be easily \ndiagonalised by using a Fourier transformation, $c_j= \\frac{1}{N} \\sum_{\\vec{k}} e^{i \\vec{k} \\cdot \\vec{r}_j} c^{\\phantom{\\dagger}}_{\\vec{k}} $ with $c_{\\vec{k}}=c^{\\dagger}_{-\\vec{k}}$ \nwhich ensures that $c_j$'s are Majorana fermions. The Hamiltonian then reduces to\n\\begin{eqnarray}\n&& H= \\sum_{k_x,k_y \\geq 0} i f(\\vec{k}) c^{\\dagger}_{\\vec{k},a} c^{\\phantom{\\dagger}}_{\\vec{k},b} + {\\rm h.c}\\\\\n&& H=\\sum_{k_x,k_y \\geq 0} \\psi^{\\dagger} \\tilde{H} \\psi^{\\phantom{\\dagger}}_{\\vec{k}}, \\psi^{\\dagger}_{\\vec{k}}= (c^{\\dagger}_{\\vec{k},a}, c^{\\phantom{\\dagger}}_{\\vec{k},b}) \\\\\n&& \\tilde{H}= \\left( \\begin{array}{cc}\n 0&if(\\vec{k}) \\\\\n-if^*(\\vec{k})&0 \\end{array} \\right).\n\\label{kspace-hamiltonian}\n\\end{eqnarray}\n\n$a$ and $b$ correspond to the two sublattice points. The dispersion $f(\\vec{k})$ is given by\n\n", "itemtype": "equation", "pos": 19389, "prevtext": "\n\n\n where, $J_\\alpha$'s are dimensionless coupling constants, $\\sigma^{\\alpha}_k$ is the $\\alpha$-component of Pauli \nmatrices and spin operators are defined as $\\vec{s}_k= \\frac{1}{2} \\vec{\\sigma}_k$. Following  Kitaev \n~\\cite{kitaev-2006}, we introduce a set of four Majorana fermions $\\{ b^x_k, b^y_k, b^z_k, c\\}$ at a given site \n`$k$' to represent the Pauli operators as, $\\sigma_k^{\\alpha}= i b^{\\alpha}_k c^{\\phantom{\\dagger}}_k$ ($\\alpha=x,y,z$). Notice that this \ndefinition implies that the spin operators live in an enlarged Hilbert space. To get the physical spin operators \none has  to enforce the projection in the physical Hilbert space using the operator,  \n$D_k= i b^{x}_k b^y_k b^z_k c=1$, at a given site. However as the $\\sigma^{\\alpha}_k$ operators commutes with  $D_k$, \nwe can use $\\sigma^{\\alpha}_k$ to represent the physical spin operators itself. Substituting the above definition, \nwe can rewrite the  Hamiltonian in Eq. (\\ref{spin-hamiltonian}) as\n\\begin{eqnarray}\nH &=&  \\frac{i}{2} \\sum_{\\langle j,k \\rangle} J_{\\alpha_{jk}} \\hat{u}_{jk} c_j c_k,\n\\label{majorana-hamiltonian}\n\\end{eqnarray}\n\nwhere $ \\hat{u}_{jk}=i b^{\\alpha_{jk}}_j b^{\\alpha_{jk}}_k $ are the link operators  defined on a given link $<jk>$.\nThe remarkable fact which makes Kitaev model an integrable system is that these $ \\hat{u}_{jk}$ operators defined\non each link mutually commute with each other and also commute with the Hamiltonian in Eq.(\\ref{majorana-hamiltonian}). \nThey play the role of  static $Z_2$ gauge field operators as one can readily check that $ \\hat{u}^2_{jk}=1$. \nHere we have  $\\alpha_{jk} = x, y, z$ depending on whether the `$j$' and `$k$' indices form a $x, y$ or $z$ link.  The \noriginal Hamiltonian as given in Eq.(\\ref{spin-hamiltonian}) transforms into an equivalent problem as depicted in \nEq.(\\ref{majorana-hamiltonian}) where one has to solve for a free Majorana fermion hopping problem in the presence of\nstatic $Z_2$ gauge field. For the detail solution and the phase diagram we refer the reader to the original work \nby A. Kitaev ~\\cite{kitaev-2006}; a pictorial summary is presented in the lower panel of Fig. \\ref{Fig1}.  \nWorking in the extended Hilbert space of the spin operators, a general eigenstate \nof the  Hamiltonian in Eq. (\\ref{majorana-hamiltonian}) can be written as,\n\\begin{eqnarray}\n| \\Psi \\rangle = \\frac{1}{2^{N+1}} \\sum_g \\mathcal{D}_g |\\phi(u) \\rangle |u \\rangle,\n\\end{eqnarray}\n\nwhere $N$ is the total number of sites, $|u \\rangle $ describes the $Z_2$ gauge field configurations on each link and $|\\phi(u) \\rangle$ describes\nthe free Majorana fermion wave functions for a given $|u \\rangle $ . $\\mathcal{D}_g= \\prod_k D_k $  and the product \nruns over all the site `$k$'.  The sum $\\frac{1}{2^{N+1}} \\sum_g \\mathcal{D}_g$  represents the gauge average \nover equivalent copies the  physical Hilbert space.  In Yao and Qi's work ~\\cite{yao-qi2010} it has been shown that due to the \nspecial structure of the Hamiltonian in Eq.(\\ref{majorana-hamiltonian}), the  entanglement entropy ($S_A$) of a \nsubsystem `$A$' for a given eigenstate $| \\psi \\rangle$ consists of two contributions and may be written as\n\\begin{eqnarray}\n\\label{gauge-fermi}\nS_A=  S_{A,F} + S_{A,G} -\\rm{ log } 2\n\n\\end{eqnarray}\n\nIn the above expression, the contribution $S_{A,G} $  comes exclusively from the $Z_2$ gauge field and equals  \n$L~{\\rm log }2$  when the subsystem shares  $L$ number of bonds with the rest of the system.  The quantity \n$-\\rm{log\\;} 2$ is a topological quantity dubbed the topological entanglement entropy which is same for both the gapless \nand gapped phases of the Kitaev model.  \n$S_{A,F}$  is the contribution from the free Majorana fermions and can be calculated \nby considering the Hamiltonian identical to Eq. (\\ref{majorana-hamiltonian}) with $\\hat{u}_{jk}$ replaced\n by $\\mathbb{I}_{2\\times2}$. This leads to an enormous simplification for the calculation\nof entanglement entropy of a given subsystem as one needs simply to consider the two point correlation function for a given \nsubsystem `$A$' to get the eigenvalues of the reduced density matrix ~\\cite{peschel-2003}. For a subsystem with boundary of linear size $L$,  \nit can been shown \\cite{yao-qi2010, zanardi-2005} that in the limit $L \\rightarrow \\infty$, an area law~\\cite{Luigi-Amico} $ S_{A,F} \\sim \\alpha L$ holds, \nwhere $\\alpha$ is a \nnon-universal constant that contains necessary information of the entanglement between the subsystem and the rest. \\\\\n\nWe note here, that the entanglement entropy can be written as Eq. (\\ref{gauge-fermi}) for any shape and size of the subsystem and \nthus the entanglement entropy of a given subsystem can in principle be calculated by applying the formalism of Ref. \\onlinecite{peschel-2003}. \nAs mentioned earlier, one of the main aim of this article is to investigate\nthe behaviour of $\\alpha$ in the  parameter space of Kitaev model. Specifically, we are interested to know apart from area \nlaw what additional information might be extracted from the entanglement entropy of the system.\nFor this we examine the entanglement entropy and entanglement gap as a function of the model parameters $J_x,J_y,J_z$. \nFor simplicity we choose certain particular contours in the phase space of Kitaev model to ascertain how the entanglement property \nvaries along these paths. Henceforth, we now consider only the free Majorana fermion Hamiltonian  \ngiven by Eq. (\\ref{majorana-hamiltonian}) with the gauge field $\\hat{u}_{i,j}$  replaced by unity. The \nresulting Hamiltonian can easily be diagonalized by Fourier transform and the ground state correlation function can be\nsubsequently calculated. The free Majorana fermion hopping Hamiltonian has two different topological phases, gapless and gapped \nphases as shown in lower panel of Fig. \\ref{Fig1}. Following Ref. \\onlinecite{peschel-2003} the von-Neumann entanglement entropy \nfor a Majorana fermion can be calculated from the eigenvalues of the correlation matrix of a given subsystem as follows. \\\\\n\nThe correlation matrix of the full system has elements given by\n\n", "index": 3, "text": "\\begin{equation}\nP_{ij} = \\langle \\Psi| c_jc_i |\\Psi \\rangle - \\delta_{ij}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P_{ij}=\\langle\\Psi|c_{j}c_{i}|\\Psi\\rangle-\\delta_{ij}\" display=\"block\"><mrow><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">⟨</mo><mi mathvariant=\"normal\">Ψ</mi><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mi>c</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>i</mi></msub></mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>-</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01695.tex", "nexttext": "\nwith $k_x$ and $k_y$ being the components of $\\vec{k}$\nalong the $x$ and $y$ bonds respectively. $k_x$ and $k_y$ can be rewritten as the Cartesian components of $\\vec{k}$\nalong $x$ and $y$ axes as $k_x=\\frac{q_x}{2} + \\frac{\\sqrt{3} q_y}{2}$ and  $k_y= -\\frac{q_x}{2} + \\frac{\\sqrt{3} q_y}{2}$.\nWith the unitary transformations \n\\begin{eqnarray}\nc_{\\vec{k},a}&=&\\frac{i \\exp{i \\theta_{\\vec{k}}}}{\\sqrt{2}}(\\alpha_{\\vec{k}}+\\beta_{\\vec{k}}), \\nonumber \\\\\nc_{\\vec{k},b}&=&\\frac{1}{\\sqrt{2}}(\\alpha_{\\vec{k}} - \\beta_{\\vec{k}}),\n\\end{eqnarray}\nthe Hamiltonian in Eq.(\\ref{kspace-hamiltonian}) may be diagonalised as \n\\begin{eqnarray}\nH= \\sum_{k_x,k_y \\geq 0} |f(\\vec{k})| \\Big( \\alpha^{\\dagger}_{\\vec{k}} \\alpha_{\\vec{k}} -  \\beta^{\\dagger}_{\\vec{k}} \\beta_{\\vec{k}} \\Big)\n\\end{eqnarray}\nWe mention that all the $c_{\\vec{k}}$ are defined in the first half of the Brillouin zone (HBZ) and \n$e^{i \\theta_{\\vec{k}}}= \\frac{f(\\vec{k})}{|f(\\vec{k})|}$. The ground state $|\\mathcal{G} \\rangle$ is obtained by filling \nall the $\\beta_{\\vec{k}}$ modes,  i.e, $|\\mathcal{G} \\rangle= \\prod_{\\vec{k} \\in HBZ} \\beta^{\\dagger}_{\\vec{k}} |0 \\rangle$\nwhere $|0 \\rangle$ denotes the fermionic vacuum. \\\\\n\nTo complete the discussion we briefly discuss the discretization of $k_x$\nand $k_y$ employed here for a finite size lattice. For the hexagonal lattice unit vectors are chosen as\n$\\vec{a}_1= \\vec{e}_x,~~ \\vec{a}_2= \\frac{1}{2} \\vec{e}_x + \\frac{\\sqrt{3}}{2}  \\vec{e}_y $. These yield the\nreciprocal vectors as $\\vec{G}_1=2 \\pi \\left( \\vec{e}_x -\\frac{1}{\\sqrt{3}} \\vec{e}_y \\right),~~~\\vec{G}_2= \\frac{4 \\pi}{\\sqrt{3}} \\vec{e}_y$. Any $\\vec{k}$ vector \nhas been discretized as $\\vec{k}= \\frac{n_x}{N_x} \\vec{G}_1 + \\frac{n_y}{N_y} \\vec{G}_2$. \n$k_{x/y}= \\vec{k} \\cdot \\vec{a}_{x/y}$ with $\\vec{a}_{x/y}= \\pm \\frac{1}{2} \\vec{e}_x + \\frac{\\sqrt{3}}{2} \\vec{e}_y$. \nHere $\\vec{a}_{x/y}$ are the unit vectors joining two z-bonds by x and y interactions respectively, and $\\vec{e}_{x/y}$ are the unit vectors along x and y-directions respectively. \nTherefore one obtains $k_x= \\frac{2 \\pi n_y}{N_y}$ and $k_y=-\\frac{2 \\pi n_x}{N_x} + \\frac{2 \\pi n_y}{N_y}$. Here $N_x$ and $N_y$ denote the unit cells taken in the x and y-direction \nrespectively, and $n_{x/y}$ varies from $1$ to $N_{x/y}$.\n\\begin{figure*}\n\\includegraphics[width=18cm]{Fig2.eps}\n\\caption{(Colour online) Entanglement properties of cylindrical subregions for $J_y/J_x=0.3$ as a function of $J_z$ in the Kitaev system; gapless phase is shaded blue. \n\nLeft panel: top plot shows the entanglement entropy for various \nsizes of the full system with the aspect ratio fixed at $N_y/N_x = 10$; bottom plot shows derivative of correlation functions obtained analytically showing oscillations at \nthe same values of $J_z$ as the entangelment entropy, the former resulting in the latter. \n\nMiddle panel: Schmidt gap for the half region is plotted against $J_z$. Initially when the \n system is in the gapped phase, the entanglement gap gradually decreases as $J_z$ increases, \n but it goes to zero in a first order jump when it enters the gapless regime. However entanglement gap remains zero when \n $J_z$ is increased further and the system transits to the large $J_z$ gapped phase, consistent with zero energy edge-modes in the latter two phases; \n inset shows the variation of entanglement gap for different number of chains in the subregion $n_y$ as indicated. We have taken\n a system with $N_x=6, N_y=60$. The gap is a generic feature of a subsystem comprising any number of parallel chains. \n However the first order jump becomes sharper as $n_y$ is increased.\n \n Right panel: positive spectrum of the Majorana Hamiltonian for the half region with $J_y/J_x=0.3$ as a function of $J_z$ for a $10 \\times 100$ system. \n Energy modes become zero energy modes at the transition from the gapped to gapless phase; we have checked that these are indeed edge states localized on the boundary. However in \n the large $J_z$ limit where the system again becomes gapped, the edge modes persist and remain gapless.\n}\n\\label{Fig2}\n\\end{figure*}\n\\section{Entanglement in cylindrical subregions}\n\\label{section-2}\nIn this section we discuss the entanglement entropy and gap for the half region which has a cylindrical geometry.\nHere we have taken a torus of $N_x \\times N_y$ unit cell which can be thought \nof as $N_y$ coupled one dimensional chains where each chain has $N_x$ sites such that \n$N_x\\neq N_y$ \\cite{konik-2013}. We have kept the aspect \nratio $N_y/N_x=10$; our qualitative results are independent of this ratio. \nThe subsystem is defined such that it contains $N_y/2$ coupled one dimensional \nchains. This is because the system is periodic in \n$x$-direction, hence one can employ a Fourier transform in $x$-direction and then the entanglement \nstudy reduces to that of decoupled one-dimensional chains for each $k_x$-mode in $y$-direction. \nIn the upper left panel of Fig. \\ref{Fig2}, we have plotted the entanglement entropy for the half region as a function of $J_z$. \nIt may be worthwhile to note \nthat a similar region on a torus had previously been considered for studying the entanglement properties \n~\\cite{yao-qi2010}, where the entanglement entropy was studied for each $k_x$-mode for a given set \nof parameter values in the gapless and gapped regime; however that work lacked a comprehensive analysis of the \nentanglement entropy, in particular the physics contained in the non-universal parameter $\\alpha$ appearing in the area law, \nwith the variation of the system parameters which we provide in this work.$J_x \\neq J_y$ and various values of $N_y$ as indicated. \\\\\n\nAs may be seen from the plot, for each of these systems a cusp is prominent at $J_z=J_x+J_y$ \nwhich is the transition point from gapless to gapped phase; moreover within the gapped phases the area law is clearly validated. \nHowever, inside the gapless phase, \nentanglement entropy has intermittent peaks whose number increases with increasing system size for \na given aspect ratio. The entanglement entropy for the half region with $J_x=J_y$ is similar to that \nshown for $J_x \\neq J_y$ with the initial monotonic increase for $J_x \\neq J_y$ being absent. We note  \nthat the intermittent peaks we find in the gapless phase for the entanglement entropy is very similar \nto what has been reported  earlier for the fidelity-susceptibility~\\cite{gu-2008}. The number of peaks  \nincreases linearly as the number of chains in the total system increases. \\\\\n\n\\begin{figure*}[ttp]\n\\label{Rec-JxJy}\n\\includegraphics[width=18cm]{Fig3.eps}\n\\caption{(Colour online) Entanglement properties of general square and rectangular subregions as a function of coupling $J_z$ in a $36 \\times 36$ Kitaev system; \ngapless phase is shaded blue as in Fig. \\ref{Fig2}.\nLeft panel: Entanglement entropy of various subregions across the phase transitions for $J_y/J_x = 1$ (top) and $J_y/J_x = 0.3$ (bottom); \nat the transition to/from the gapless phase there is a cusp in the free fermion entanglement entropy. However within the gapless phase the entropy does not monotonically change with varying $J_z$, and depends \non the transverse coupling and geometry of the subregion.\nMiddle panel: nearest-neighbour correlations for $x-x$ and $z-z$ bonds in the ground state for $J_y/J_x = 0.3\\textrm{ (closed symbols)}, 1.0\\textrm{ (open symbols)}$, \n the nonmonotonicity of which in turn suggests the nonmonotonicity of the entanglement entropy in the left panel.\n Right panel: Schmidt gap $\\Delta$ for various subsystem geometries with $J_y/J_x=0.3$. Within the gapless phase there are stronger variations in $\\Delta$ than when within or \n closer to the transition to the gapped phases. Inset displays similar results for $J_y/J_x=1$ (left y-axis corresponds to the largest subsystem $30 \\times 18$). \n The Majorana edge states (not shown) are not strongly localized along the \n boundaries in this case  having finite extension in the bulk as well. Thus the putative correspondence between the gapless edge mode and the \ngapless entanglement spectrum might not be straightforward here.} \n\\label{Fig3}\n\\end{figure*}\nWe now provide a possible explanation for the oscillations of the entanglement entropy in this half-region. \nWe know that the fundamental quantity which determines the entanglement entropy in a free-fermion system \nis the two point correlation function \\cite{peschel-2003}. \nHere we consider nearest neighbour correlation function to elucidate its connection to the oscillations present in the entanglement \nentropy. \nWe consider the nearest neighbour $z-z$ correlation function $\\mathcal{C}_{zz} \\equiv \\langle c^z_ic^z_{i+1}\\rangle$, \nwith the expectation value taken in the half-filled Majorana system\nfor various system sizes keeping the aspect ratio identical in accordance with the upper left panel of Fig. \\ref{Fig3}. \nThis may be seen to be expressed analytically as\n\\begin{eqnarray}\n&&\\mathcal{C}_{zz}=\\sum_k \\cos \\theta_k=\\frac{Re(f(k_x,k_y))}{|f(k_x,k_y)|}\n\\label{eq:corr1}\n\\end{eqnarray}\nwhere $|f(k_x,k_y)|$ is the dispersion of the Kitaev model given in Eq. (\\ref{eq:dispersion}).\nIn the lower left panel of  Fig. \\ref{Fig3} we have plotted the derivative of $C_{zz}$ with respect to $J_z$, where we may observe the \nappearance of similar oscillations.\nThe oscillations in the correlation function produces the oscillations in the derivative of it as well (but of higher magnitude) and explain the oscillations in the entanglement \nentropy. The oscillations in $C_{zz}$ may also be understood directly from the form of Eq. (\\ref{eq:corr1}).In the gapless phase the dispersion $f(\\vec{k})$ vanishes at \ncertain $\\vec{k}$ points in the Brillouin zone; \nhowever due to the discrete numerical evaluation of $\\vec{k}$-points, the dispersion may or may not be exactly zero, \nbut takes values that are arbitrarily close to zero depending on the system size and the value of the model parameters. This can occur only in the absence of a bulk gap, eventually \nresulting in the oscillations of the entanglement entropy depending on the full system size; we point out that this is not a violation of the area law, the fulfillment of which \nis more conspicuously visible in the gapped phase for the same reason. \nThe oscillations in the derivative of correlation function is more pronunced than the oscillations in the correlation function itself due to the presence of an additional \nfactor $|f(k_x,k_y)|$ in the denominator which becomes vanishingly small for some values of $k_x, k_y$. \\\\\n\nLet us turn now to the entanglement gap. In the middle panel of Fig. \\ref{Fig3}, we have plotted Schmidt gap for the half region for $J_x \\neq J_y$. We have found that \nas long as we are in the weakly coupled chain limit and in the gapped phase the Schmidt gap is finite but it \nabruptly goes to zero when it enters the gapless region. The gap continues to remain zero even in the large \n$J_z$ limit as the system enters the other gapped regime. This is a new result as an earlier study \\cite{yao-qi2010} \nassociated the zero Schmidt gap only with the gapless phase.  \nTo ascertain the origin of the zero gap, we have investigated the edge mode spectrum of the half region because \nthe presence of topological order and edge states are intimately linked to the entanglement spectrum \\cite{haldane-2008,lukasz-2010}\nWe have found that for the half-region geometry, which has zig-zag $x-y$ chains at the ends, the system \nharbours gapless edge modes in the large $J_z$ phase as well \nas in the gapless phase. This has been shown in the right panel of Fig. \\ref{Fig3}. However \nthe system has gapped edge spectrum in the weakly coupled gapped phase. Our findings of the Majorana edge mode spectrum  \nagrees with earlier analytical results on the same \\cite{diptiman} which, together with our findings on the Schmidt gap, \ncorroborates the previous observation \\cite{lukasz-2010,turner} that a gapless edge state is associated with the gapless entanglement spectrum.\\\\\n\nOur result for entanglement entropy and Schmidt gap may be compared with that of a previous study \\cite{konik-2013}, \nwhere the authors studied the entanglement entropy and Schmidt gap of the two-dimensional transverse field Ising model. Both the entanglement entropy and \nthe gap have different behaviour than what we have found here. The characteristic scaling of entanglement gap and the crossing \nof entanglement gap at the transition point when the system goes from gapped to gapless regime is absent in the Kitaev model. \nThis may be attributed to the fact that the transition in the transverse model is continuous and for the Kitaev model\nthe transition from gapless to gapped one is a topological one.\nThus we can see that the entanglement gap does not depend on\nthe gapless or gapped nature of the bulk spectrum but rather it is a property of the gapless edge mode and when such gapless edge mode\nis exist entanglement gap is zero. \nHowever entanglment gap can can also be zero without the presence of a gapless edge mode, for instance by breaking time reversal symmetry but preserving the inversion \nsymmetry \\cite{turner}.\\\\\n\nWe would like to mention that the above behaviour of entanglement entropy and gap as presented in Fig. \\ref{Fig3}  is also true for any number of chains taken periodic \nin the $x$-direction. We demonstrate this in the inset of the middle panel of  \nFig. \\ref{Fig3} where we have ploted the entanglement gap for different number of chains $n_y$; it is evident that the overall \nnature of the entanglement gap remains unchanged except that the change from a finite gap to a zero gap becomes sharper \nas the number of chains in the subsystem increases. \\\\\n\n\\section{Entanglement in rectangular subregions}\n\\label{section-3}\n\nIn this section we present numerical results for the entanglement entropy and gap of a finite block of square or rectangular geometry as \nshown in Fig.\\ref{Fig1}. Our motivation is twofold: first we analyze the variation of the entanglement entropy and gap as we \nvary $J_z$ for fixed values of $J_x, J_y$ (i) along the contour $J_x=J_y$ when the system changes from the gapless to the gapped phase \nand (ii) along the $J_x\\neq J_y$ line when the system changes from the gapped to gapless and again to gapped phase. \nAnd second, we study the variation of the entanglement entropy and gap as a function of system size and shapes, mainly from\nsquare to rectangular geometry, in order to discern signatures of the transitions, individual phases, and Majorana edge states from the \nnon-universal constant $\\alpha$. \\\\\n\nIn the left panels of Fig. \\ref{Fig3} we plot the variation of the entanglement entropy as a function of $J_z$ for various subsystem\nsizes for $J_x=J_y$ (upper plot) and for $J_y/J_x=0.3$ (lower plot). The results are scaled by the length of the boundary in each case. \nIn the first case we observe that initially as we increase $J_z$, the entanglement entropy decreases for\nall  subsystem sizes. However  depending on the subsystem shapes, the entanglement entropy either start to increase\nafter  some  values of $J_z$ (the  particular value of $J_z$ depends on the shapes of the subsystem) or remains almost constant\nbefore entering into the gapped phase where the entanglement entropy decreases uniformly irrespective of subsystem size and shapes.\nThus we find that entanglement entropy may be  nonmonotonic or monotonic depending on the system parameter. We believe that that there is a nonmonotonic variation \nof the entanglement entropy not just across phase transitions but also within the given gapless phase (implying that there is point of minimal entanglement in the gapless phase \nwhich depends on the subregion geometry) is a fact worth highlighting. Indeed an oscillatory nonmonotonicity was also observed for the entanglement entropy in the half region geometry \nwithin the gapless phase; this was however attributed to the onset of gapless $\\vec{k}$ modes in the bulk. \\\\ \n\nWe explain the above variation\nof entanglement entropy qualitatively with the correlation function. We note that an exact quantitative determination\nof entanglement entropy requires an analytical diagonalization of correlation matrix which is beyond the scope\nof any known technique to our knowledge. However we can expect that it is the boundary bonds shared between the subsystem and the system  which\nlargely determine the entanglement entropy. In the middle panel of Fig. \\ref{Fig3}, we have plotted the  two point\nMajorana fermionic correlation function for x-bonds and z-bonds. Any rectangular or square block shares x-bonds with the\nsystem at left and right boundary. On the other hand it shares z-bonds as the boundary bonds at the upper and lower\nboundary. As we see from the middle panel of Fig. \\ref{Fig3}, the bond correlation function behaves differently\nas we increase the value of $J_z$. As the ratio of number of z-bonds and x-bonds are different for different subsystems,\nthe entanglement entropy in turn shows a nonmonotonic behaviour. Thus we see that by  manipulating the ratio of length to breadth\nof a rectangular subsystem, one can go from monotonic to nonmonotonic dependence of the entanglement entropy within the gapless phase.\\\\\n\nFor $J_y/J_x=0.3$ which is been plotted at the lower left panel of Fig. \\ref{Fig3},\nwe observe similar behaviour: irrespective of the subsystem size, the entanglement entropy shows monotonic behaviour in the gapped phases. However in the\ngapless behaviour, as in the previous paragraph and the half-region of the previous section, here too it may or may not show monotonic behaviour depending on the \nvalues of $J_y/J_x$ and $J_z/J_x$. Indeed for a given $n_x/n_z$ ratio (where $n_x$ and $n_z$ are the number of $x$-bonds and $z$-bonds  \nshared between a square/rectangular subsystem with the system) the \nscaled entanglement entropy curves seem to collapse on top of each other both for $J_y = J_x$ and $J_y \\neq J_x$. \nThis is may be explained as follows: the primary contribution to the entanglement entropy comes from the nearest neighbour bond-correlation between the system and the subsystem;\n Then let $S(n_x, n_z)$  denote the entanglement entropy of a certain rectangular subsystem geometry having a total of $n_x$ and $n_z$  boundary $x$-bonds and $z$-bonds respectively. \n For simplicity we may assume $S(n_x,n_z)= \\kappa_x n_x + \\kappa_z n_z$ where $\\kappa_x$ and $\\kappa_z$ are the contributions due to a boundary  $x$-bond  and $z$-bond; \n then $S(n_x,n_z)/(n_x+ n_z)$ takes on a given value for a given $n_x/n_z$. \n However deviations from this qualitative argument are expected as contributions arise from all correlation function beyond the \n nearest-neighbour. \\\\\n\nNow we turn to the  right panel of Fig. \\ref{Fig3}, where we have plotted the entanglement gap or Schmidt gap ($\\Delta$) for $J_y/J_x=0.3$. We find that\nin the gapped region, the entanglement entropy is vanishingly small but in the gapless regime the entanglement entropy\nfluctuates as a function of $J_z$. However given the small value of $\\Delta$, we can assume that it is essentially zero. We have also\nlooked at the lowest energy eigenmode and found that they are always confined at the edge: the zero Schmidt gap\nis in confirmation of  Refs. \\onlinecite{haldane-2008,lukasz-2010} which posit that for a system with a gapped bulk,\nthe Schmidt gap depends on the low energy edge modes. Though the system is gapless in the bulk for the shaded region, we think\nthat it is the gapless edge mode which is the cause of vanishingly small $\\Delta$. In the inset of right panel of Fig. \\ref{Fig3},\nwe have plotted the Schmidt gap for $J_x=J_y$. We find a strong dependence of $\\Delta$ on the subsystem geometry.\nBut they are more or less finite in the small $J_z$ where the system is gapless and gradually becomes smaller as\n$J_z$ approaches deep within the gapless phase, and remains zero thereafter. We have checked the lowest\neigenfunctions and found that although it is primarily localized at the edge it has considerable extension in the bulk\nas well; in this case the precise relation between the edge mode and the entangelment gap $\\Delta$ becomes complicated and is unclear to us.\n\\section{Analytical insights}\n\\label{section-4}\nIn this section we provide an analytical insight to corroborate our numerical findings in Secs. \\ref{section-2} and \\ref{section-3}.\nIt might be noted here that the results presented in the previous sections are exact\nbecause in the derivation of Eqs. (\\ref{final-ent}) and (\\ref{final-gap}), no approximations have been used \n\\cite{peschel-2003}. However, following the complexity to obtain an analytic expression of the correlation matrix, one has to \nresort to numerical diagonalization of the same.\nHowever, we can obtain analytical insight for the nature of the entanglement entropy and gap using \nperturbative approximations in certain regimes of $J_z$ \nand may thus better understand the numerical results. \\\\\n\nFor completeness we first enlist our key results. \nFirstly, in case of half region, we have found that \nentanglement entropy increases parabolically with $J_z$ in the gapped phase (where $J_z$ is small i.e in \nthe weakly coupled chain limit) and becomes oscillatory in the gapless regime.  \nThe entanglement gap is finite in the weakly coupled chain limit where the system \nis gapped. It goes to zero once the system enters the gapless regime and remains gapless in the large $J_z$ gapped \nphase. Secondly, we found that for $J_x=J_y$, the square block entanglement entropy shows a critical values of $J_z=J_c$, upto \nwhich the entanglement entropy decreases and then either increases or remains constant. Thirdly, for the square block we found \nthe entanglement gap shows small fluctuations for small $J_z$. \nWe begin our discussion in the small $J_z$ limit i.e weakly coupled chain limit in Sec. \\ref{weak-lim} \nwhere we qualitatively explain the behaviour of the entanglement gap for the half region. The \nbehaviour of the entanglement entropy and gap in the large $J_z$ limit will be explained in Sec. \\ref{large-lim}.\n\n\n\\subsection{Weakly coupled chain limit: small $J_z$}\n\\label{weak-lim}\nThe weakly coupled chain limit \ncan be addressed by perturbation theory where the unperturbed\nHamiltonian consists of one dimensional chains. The complete two dimensional system is treated as composition\nof many one dimensional chains coupled by small $J_z$.  Here we consider $N$ coupled chain with periodic boundary\nso that $N^{\\textrm{th}}$ chain is connected to the first chain. The complete Hamiltonian for the two-dimensional \nlattice is written as the following,\n\\begin{eqnarray}\n&&\\mathcal{H}= \\mathcal{H}_0 + \\mathcal{H}^{\\prime} \\\\\n&&\\mathcal{H}_0= \\sum^{N}_{m} \\mathcal{H}^m_0, ~~~~\\mathcal{H}^{\\prime}= \\sum_m \\mathcal{H}^{\\prime}_{m,m+1} \\\\\n&&\\mathcal{H}^m_0= \\sum_{n} \\Big( i J_x c^m_{n ,a} c^m_{n ,b}  + i J_y c^{m}_{n ,b} c^{m}_{n +1,a} \\Big) \\\\\n&&\\mathcal{H}^{\\prime}_{m,m+1}= \\sum_{n}  i J_z c^{m}_{n ,a} c^{m-1}_{n ,b}\n\\end{eqnarray}\nHere  $\\mathcal{H}^m_0$ is the unperturbed Hamiltonian for the $m^{th}$ one dimensional chain and $\\mathcal{H}^{\\prime}$ \ndenotes the interchain coupling and forms the perturbation to the unperturbed Hamiltonian $\\mathcal{H}_0$. \nUsing Fourier transform, $c^m_{n , \\gamma} = \\sum_{\\vec{k}}\\textrm{e}^{i\\vec{k}.\\vec{r}_{i, \\gamma}}c^m_{n ,\\gamma}$ \nfor the $m^{\\textrm{th}}$ chain where $\\gamma = a, b$ and the $\\vec{k}-$ summation is over $(-\\pi,\\pi)$. Notice that for $c^m_{n }$ to be Majorana fermions, we must \nhave $c^m_{-k,\\gamma}= c^{m\\dagger}_{k,\\gamma}$ which implies that \nin momentum space only the fermion operators belonging to first Brillouin zone are independent. Using this definition \nand after subsequent diagonalization we can write, \n\\begin{eqnarray}\n\\mathcal{H}^m_0 = \\sum |\\epsilon_k| \\Big( \\alpha^{m \\dagger}_k \\alpha^m_k - \\beta^{m \\dagger}_k \\beta^m_k \\Big)\n\\end{eqnarray}\nwith $\\epsilon_k = |J_x + J_y e^{i k} |$. The new fermionic modes are defined as,\n\\begin{eqnarray}\n\\label{eq: substitution}\n\\left( \\begin{array}{c}\nc^m_{k,a} \\\\\nc^m_{k,b} \\end{array} \\right)= \\frac{1}{\\sqrt{2}} \\left( \\begin{array}{cc}\ni e^{i \\theta_k} & i e^{i \\theta_k} \\\\\n1 & -1\\end{array}  \\right)\n \\left( \\begin{array}{c}\n\\alpha^m_k \\\\\n\\beta^m_k \\end{array} \\right)\n\\end{eqnarray}\nwhere $ \\theta_k =  \\tan^{-1}\\left( \\frac{J_y\\sin{k}}{J_x + J_y\\cos{k}} \\right)$. Using \\eqref{eq: substitution}, the interchain \nperturbation  governed by $J_z$  can be written as,\n\\begin{eqnarray}\n \\label{eq: perturbation}\n\\mathcal{H}^{m,m+1}_p &=&  \\sum_{k \\geq 0} \\frac{J_z e^{i \\theta_k}}{4} \\Big( \\alpha^{m \\dagger}_{k} \\alpha^{m-1}_{k} - \\alpha^{m \\dagger}_{k} \\beta^{m-1}_{k} \\nonumber \\\\\n&& + \\beta^{m \\dagger}_{k} \\alpha^{m-1}_{k} - \\beta^{m\\dagger}_{k} \\beta^{m-1}_{k} \\Big) + {\\rm h.c}\n \\end{eqnarray}\nwhere the summation is over all the $m$ chains. \n\nGround state of the system can be written as the product of the  individual ground states of each chain. Let $| g,m\\rangle$\ndenote the ground state of $m^{th}$ chain and $| \\mathcal{G} \\rangle$ denote the  ground state for the complete\nsystem, then we can write,\n\\begin{eqnarray}\n| \\mathcal{G} \\rangle = \\prod^{N}_{m=1} | g,m\\rangle, ~~~~| g,m\\rangle= \\prod_k \\beta^{m \\dagger}_k |0 \\rangle\n\\end{eqnarray}\n\nNext, our task is to find the perturbed ground state when we take into account Eq. (\\ref{eq: perturbation}), as the perturbation. \nFor simplicity, we limit ourselves upto to second order in $J_z$ for the corrections in the entanglement entropy and gap \nand neglect subsequent higher order corrections.\nFor this purpose it is sufficient to limit upto the first order corrections of the ground state which is given as,\n\n\\begin{eqnarray}\n\\label{1stcorr}\n|\\mathcal{G}_1 \\rangle &&= |\\mathcal{G} \\rangle \\Big( 1- N\\sum_k  \\frac{J^2_z}{64} \\frac{1}{\\epsilon^2_k} \\Big) \\nonumber \\\\\n-\\sum_m  &&\\frac{(-1)^{N-m}J_z}{8 \\epsilon_k}  \\Big(e^{-i \\theta_k} | 0,0;m-1 \\rangle  | 1,1;m \\rangle |\\mathcal{G}:m,m-1 \\rangle \\nonumber \\\\\n&& - e^{i \\theta_k} | 0,0;m+1 \\rangle  | 1,1;m \\rangle |\\mathcal{G}:m+1,m \\rangle \\Big)\n\\end{eqnarray}\n \nWhere, $|\\mathcal{G}:a,b,c,...\\rangle = \\prod_{m \\neq a,b,c,..} | g,m \\rangle$ and   $| p,q;m \\rangle = (\\alpha^{\\dagger}_m)^p (\\beta^{\\dagger}_m)^q |0 \\rangle$, \nwhere $p,~ q$ can only take values $0$ or $1$. Reduced density matrix of the half region can be calculated easily by considering the first order correction to the ground state wavefunction itself. \nThe reduced density matrix contains two diagonal terms, first comes from the 1st term of Eq. (\\ref{1stcorr}) and is proportional to unity. \nThe second term of Eq. (\\ref{1stcorr}) yields another diagonal terms proportional to $J^2_z$. \nThe off-diagonal terms are of two types, terms which are proportional to $J_z$ and is obtained from the product of first and second terms of Eq. (\\ref{1stcorr}). \nThese off-diagonal terms can be treated as perturbation to the first diagonal terms of the reduced density matrix which is proportional to unity. \nWhile the other off-diagonal terms coming from the second term yields a correction $\\sim J^4_z$. Thus considering only the terms upto $J^2_z$, we get the following expressions for \nthe largest and second largest eigenvalues of the reduced density matrix,\n\n\\begin{eqnarray}\n\\label{eq:red-eig-value}\n&&\\lambda_{1}= \\lambda_0 + \\sum_k\\frac{(N^{\\prime}-1)J^2_z}{32 \\epsilon^2_k} \\Big(\\lambda_0- \\frac{J^2_z}{64 \\epsilon^2_k} \\Big)^{-1} ,\\\\\n&&\\lambda_2= \\Big( \\frac{J^2_z}{64 \\epsilon^2_{k}} \\Big)_{\\rm min}=\\frac{J^2_z}{64 (J_x-J_y)^2}\n\\end{eqnarray}\nwhere $\\lambda_0=1- N\\sum_k \\frac{J^2_z}{32 \\epsilon^2_k}$. \nIn the above $N^{\\prime}$ \nis the number of chains in the subsystem. From the expression of Eq. (\\ref{eq:red-eig-value}), we find that for small values of $J_z$, the \nentanglement entropy has a parabolic dependence on $J_z$ as is found in Fig: \\ref{Fig2}.\n\n\\subsection{Dimer limit: strong $J_z$}\n\\label{large-lim}\n\\label{half-chain2}\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{Fig4.eps}\n\\caption{(Colour online) \nIn the large $J_z$ limit we associate each $z$-bond with a $\\psi$ fermion in order to compute the reduced density matrix.\nThe boundary is composed of the upper, lower and the two side boundaries. \nFor the upper and lower boundaries a $\\psi$ fermion is shared between the system and the subsystem. For this reason we regrouped the two adjacent $\\psi$ fermions to define \ntwo $\\chi$ fermions (as shown at the right side of the figure) such that $\\chi_1$ belongs to the system and $\\chi_2$ belongs to the subsystem.}\n\\label{majo-group}\n\\end{figure}\nThe value of the entanglement entropy at large $J_z$ limit is easy to calculate. Here we present the perturbative results\nfor entanglement entropy and gap in the large $J_z$ limit for the half region. In the limit $J_z \\rightarrow \\infty$  the Hamiltonian \nconsists of isolated $z$-bonds only and the Hamiltonian for each z-bond is $J_z i c_{i,1} c_{i,2}$ where $i$ denotes a particular $z$-bond \nand `1' and `2' refer to the sites inside and the outside of the subsystem. It is straightforward to see that integrating out one Majorana fermion \nyields a contribution $ {\\rm log} 2$  to the entropy. Thus if there are in total $N_z$ number of $J_z$ bonds shared between the subsystem \nand the system, we obtain the limiting values of the entanglement entropy as $N_z {\\rm log} 2$. The perturbation here amounts to switching on the hopping of Majorana fermions \nbetween nearest neighbour dimers. The Hamiltonian can then be written as\n\n", "itemtype": "equation", "pos": 23091, "prevtext": "\n. This can be rewritten as \n\\begin{eqnarray}\nP = iQ\n\\begin{bmatrix}\n0  & -1     &       &        &      &   \\\\\n1  & 0 & \\ddots & \\ddots &        &  \\\\\n  &        & \\ddots & \\ddots & 0 & -1 \\\\\n &       &        &      & 1      & 0\n\\end{bmatrix}\nQ^{T},\n\\end{eqnarray}\n\nwhere $Q$ is the matrix whose columns are composed alternatively of the real and imaginary parts of the eigenvectors of the Majorana Hamiltonian. \nThe eigenvalues $\\lambda_1,...,\\lambda_i,...\\lambda_N$ of $\\tilde{P} \\subset P$ lie between $[-1,1]$, where $\\tilde{P}$ denotes the correlation matrix restricted to the subsystem and \n$N$ denotes the total number of the sites inside the subsystem; then the eigenvalues of the reduced density matrix can be written as \\cite{calabrese-2010,vidal-2004},\n\n\\begin{eqnarray}\n\\Gamma(s_1,...s_i,...s_N)= \\prod_{i=1,N} \\frac{1+ s_i \\lambda_i}{2}\n\\label{density-eigvl}\n\\end{eqnarray}\n\n$s_i$ can take values $\\pm 1$ and thus we obtain in total $2^N$ eigenvalues of the density matrix. The von-Neumann entanglement entropy is thus given by ~\\cite{yao-qi2010},\n\\begin{eqnarray}\n\\label{final-ent}\nS_A = \\sum \\frac{1+ \\lambda_i}{2} {\\rm log} \\frac{1+ \\lambda_i}{2} + \\frac{1- \\lambda_i}{2} {\\rm log} \\frac{1- \\lambda_i}{2} \n\\end{eqnarray}  \n \nEntanglement gap or Schmidt gap is another useful quantity to characterize the entanglement properties and in particular has been conjectured to detect topological order \n\\cite{haldane-2008} and phase transitions \\cite{konik-2013}.\n The entanglement gap may be defined as ~\\cite{haldane-2008, konik-2013}\n\\begin{eqnarray}\n\\Delta_A= - (\\rm{log} \\Gamma_M - \\rm{log} \\Gamma_M^{\\prime}),\n\\end{eqnarray}\nwhere $\\Gamma_M$ and $\\Gamma_M^{\\prime} $ are the largest and the second largest eigenvalues of the density matrix.\n\nFrom Eq. (\\ref{density-eigvl}), it is clear that the $\\Gamma_M$ is obtained when the contribution $\\frac{1+ s_i \\lambda_i}{2}$ \nis maximized i.e one has to consider the contribution $\\textrm{Max} \\Big(\\frac{1+ \\lambda_i}{2}, \\frac{1- \\lambda_i}{2}\\Big)$ for a \ngiven $\\lambda_i$. The second largest eigenvalue is obtained by changing  $(1+ \\lambda)/2$ to $(1-\\lambda)/2$ for the  smallest \nvalue of $|\\lambda|$. With this, entanglement gap can be simplified to\n\\begin{eqnarray}\n\\label{final-gap}\n\\Delta_A= {\\rm log} \\frac{(1+ |\\lambda|_{min})}{(1- |\\lambda|_{min})} \n\\end{eqnarray}\nWe evaluate the quantities given by Eq. (\\ref{final-ent}) and Eq.(\\ref{final-gap}) numerically and discuss the results \nin Sec.\\ref{section-2}. \\\\\n\nBefore we end this section we show how the spectrum, eigenvalues and eigenvectors of the Hamiltonian given in Eq. \n(\\ref{majorana-hamiltonian}) where the $Z_2$ gauge fields are replaced by unity, may be constructed, required for our analytical computations in Sec. \\ref{section-5}. \nThis Hamiltonian can be easily \ndiagonalised by using a Fourier transformation, $c_j= \\frac{1}{N} \\sum_{\\vec{k}} e^{i \\vec{k} \\cdot \\vec{r}_j} c^{\\phantom{\\dagger}}_{\\vec{k}} $ with $c_{\\vec{k}}=c^{\\dagger}_{-\\vec{k}}$ \nwhich ensures that $c_j$'s are Majorana fermions. The Hamiltonian then reduces to\n\\begin{eqnarray}\n&& H= \\sum_{k_x,k_y \\geq 0} i f(\\vec{k}) c^{\\dagger}_{\\vec{k},a} c^{\\phantom{\\dagger}}_{\\vec{k},b} + {\\rm h.c}\\\\\n&& H=\\sum_{k_x,k_y \\geq 0} \\psi^{\\dagger} \\tilde{H} \\psi^{\\phantom{\\dagger}}_{\\vec{k}}, \\psi^{\\dagger}_{\\vec{k}}= (c^{\\dagger}_{\\vec{k},a}, c^{\\phantom{\\dagger}}_{\\vec{k},b}) \\\\\n&& \\tilde{H}= \\left( \\begin{array}{cc}\n 0&if(\\vec{k}) \\\\\n-if^*(\\vec{k})&0 \\end{array} \\right).\n\\label{kspace-hamiltonian}\n\\end{eqnarray}\n\n$a$ and $b$ correspond to the two sublattice points. The dispersion $f(\\vec{k})$ is given by\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:dispersion}\n|f(\\vec{k})|= J_x e^{i  k_x} + J_y e^{i k_y} + J_z,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"|f(\\vec{k})|=J_{x}e^{ik_{x}}+J_{y}e^{ik_{y}}+J_{z},\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mo>=</mo><mrow><mrow><msub><mi>J</mi><mi>x</mi></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><msub><mi>k</mi><mi>x</mi></msub></mrow></msup></mrow><mo>+</mo><mrow><msub><mi>J</mi><mi>y</mi></msub><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><msub><mi>k</mi><mi>y</mi></msub></mrow></msup></mrow><mo>+</mo><msub><mi>J</mi><mi>z</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01695.tex", "nexttext": " \n\nIn the above expression $n +\\delta_{\\alpha}$ refers to the  nearest neighbour dimer connected by an $\\alpha$-bond with the $n^{\\textrm{th}}$\ndimer. \nWe may now define a $\\psi$ fermionic basis using the substitution $c_{n ,1}= \\psi_{n}  + \\psi^{\\dagger}_{n} ,~~~~ c_{n ,2}= -i (\\psi_{n}  - \\psi^{\\dagger}_{n}  )$, \nsuch that $\\psi_n |0\\rangle_n = 0$, with $|0\\rangle_n$ being the vacuum state of the dimer at site `$n$'; \nthe ground state of the full system is then obtained as $|\\mathcal{G}_0 \\rangle=|\\mathcal{O}\\rangle$ where $|\\mathcal{O}\\rangle= \\prod_i|0\\rangle_i$.  \nTo calculate the reduced density matrix, as in the weak $J_z$ limit,\nwe begin with the  perturbed ground state. The perturbed ground state to second order in $J = J_{\\alpha},~~\\alpha=x,y$, is then given by\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwith $k_x$ and $k_y$ being the components of $\\vec{k}$\nalong the $x$ and $y$ bonds respectively. $k_x$ and $k_y$ can be rewritten as the Cartesian components of $\\vec{k}$\nalong $x$ and $y$ axes as $k_x=\\frac{q_x}{2} + \\frac{\\sqrt{3} q_y}{2}$ and  $k_y= -\\frac{q_x}{2} + \\frac{\\sqrt{3} q_y}{2}$.\nWith the unitary transformations \n\\begin{eqnarray}\nc_{\\vec{k},a}&=&\\frac{i \\exp{i \\theta_{\\vec{k}}}}{\\sqrt{2}}(\\alpha_{\\vec{k}}+\\beta_{\\vec{k}}), \\nonumber \\\\\nc_{\\vec{k},b}&=&\\frac{1}{\\sqrt{2}}(\\alpha_{\\vec{k}} - \\beta_{\\vec{k}}),\n\\end{eqnarray}\nthe Hamiltonian in Eq.(\\ref{kspace-hamiltonian}) may be diagonalised as \n\\begin{eqnarray}\nH= \\sum_{k_x,k_y \\geq 0} |f(\\vec{k})| \\Big( \\alpha^{\\dagger}_{\\vec{k}} \\alpha_{\\vec{k}} -  \\beta^{\\dagger}_{\\vec{k}} \\beta_{\\vec{k}} \\Big)\n\\end{eqnarray}\nWe mention that all the $c_{\\vec{k}}$ are defined in the first half of the Brillouin zone (HBZ) and \n$e^{i \\theta_{\\vec{k}}}= \\frac{f(\\vec{k})}{|f(\\vec{k})|}$. The ground state $|\\mathcal{G} \\rangle$ is obtained by filling \nall the $\\beta_{\\vec{k}}$ modes,  i.e, $|\\mathcal{G} \\rangle= \\prod_{\\vec{k} \\in HBZ} \\beta^{\\dagger}_{\\vec{k}} |0 \\rangle$\nwhere $|0 \\rangle$ denotes the fermionic vacuum. \\\\\n\nTo complete the discussion we briefly discuss the discretization of $k_x$\nand $k_y$ employed here for a finite size lattice. For the hexagonal lattice unit vectors are chosen as\n$\\vec{a}_1= \\vec{e}_x,~~ \\vec{a}_2= \\frac{1}{2} \\vec{e}_x + \\frac{\\sqrt{3}}{2}  \\vec{e}_y $. These yield the\nreciprocal vectors as $\\vec{G}_1=2 \\pi \\left( \\vec{e}_x -\\frac{1}{\\sqrt{3}} \\vec{e}_y \\right),~~~\\vec{G}_2= \\frac{4 \\pi}{\\sqrt{3}} \\vec{e}_y$. Any $\\vec{k}$ vector \nhas been discretized as $\\vec{k}= \\frac{n_x}{N_x} \\vec{G}_1 + \\frac{n_y}{N_y} \\vec{G}_2$. \n$k_{x/y}= \\vec{k} \\cdot \\vec{a}_{x/y}$ with $\\vec{a}_{x/y}= \\pm \\frac{1}{2} \\vec{e}_x + \\frac{\\sqrt{3}}{2} \\vec{e}_y$. \nHere $\\vec{a}_{x/y}$ are the unit vectors joining two z-bonds by x and y interactions respectively, and $\\vec{e}_{x/y}$ are the unit vectors along x and y-directions respectively. \nTherefore one obtains $k_x= \\frac{2 \\pi n_y}{N_y}$ and $k_y=-\\frac{2 \\pi n_x}{N_x} + \\frac{2 \\pi n_y}{N_y}$. Here $N_x$ and $N_y$ denote the unit cells taken in the x and y-direction \nrespectively, and $n_{x/y}$ varies from $1$ to $N_{x/y}$.\n\\begin{figure*}\n\\includegraphics[width=18cm]{Fig2.eps}\n\\caption{(Colour online) Entanglement properties of cylindrical subregions for $J_y/J_x=0.3$ as a function of $J_z$ in the Kitaev system; gapless phase is shaded blue. \n\nLeft panel: top plot shows the entanglement entropy for various \nsizes of the full system with the aspect ratio fixed at $N_y/N_x = 10$; bottom plot shows derivative of correlation functions obtained analytically showing oscillations at \nthe same values of $J_z$ as the entangelment entropy, the former resulting in the latter. \n\nMiddle panel: Schmidt gap for the half region is plotted against $J_z$. Initially when the \n system is in the gapped phase, the entanglement gap gradually decreases as $J_z$ increases, \n but it goes to zero in a first order jump when it enters the gapless regime. However entanglement gap remains zero when \n $J_z$ is increased further and the system transits to the large $J_z$ gapped phase, consistent with zero energy edge-modes in the latter two phases; \n inset shows the variation of entanglement gap for different number of chains in the subregion $n_y$ as indicated. We have taken\n a system with $N_x=6, N_y=60$. The gap is a generic feature of a subsystem comprising any number of parallel chains. \n However the first order jump becomes sharper as $n_y$ is increased.\n \n Right panel: positive spectrum of the Majorana Hamiltonian for the half region with $J_y/J_x=0.3$ as a function of $J_z$ for a $10 \\times 100$ system. \n Energy modes become zero energy modes at the transition from the gapped to gapless phase; we have checked that these are indeed edge states localized on the boundary. However in \n the large $J_z$ limit where the system again becomes gapped, the edge modes persist and remain gapless.\n}\n\\label{Fig2}\n\\end{figure*}\n\\section{Entanglement in cylindrical subregions}\n\\label{section-2}\nIn this section we discuss the entanglement entropy and gap for the half region which has a cylindrical geometry.\nHere we have taken a torus of $N_x \\times N_y$ unit cell which can be thought \nof as $N_y$ coupled one dimensional chains where each chain has $N_x$ sites such that \n$N_x\\neq N_y$ \\cite{konik-2013}. We have kept the aspect \nratio $N_y/N_x=10$; our qualitative results are independent of this ratio. \nThe subsystem is defined such that it contains $N_y/2$ coupled one dimensional \nchains. This is because the system is periodic in \n$x$-direction, hence one can employ a Fourier transform in $x$-direction and then the entanglement \nstudy reduces to that of decoupled one-dimensional chains for each $k_x$-mode in $y$-direction. \nIn the upper left panel of Fig. \\ref{Fig2}, we have plotted the entanglement entropy for the half region as a function of $J_z$. \nIt may be worthwhile to note \nthat a similar region on a torus had previously been considered for studying the entanglement properties \n~\\cite{yao-qi2010}, where the entanglement entropy was studied for each $k_x$-mode for a given set \nof parameter values in the gapless and gapped regime; however that work lacked a comprehensive analysis of the \nentanglement entropy, in particular the physics contained in the non-universal parameter $\\alpha$ appearing in the area law, \nwith the variation of the system parameters which we provide in this work.$J_x \\neq J_y$ and various values of $N_y$ as indicated. \\\\\n\nAs may be seen from the plot, for each of these systems a cusp is prominent at $J_z=J_x+J_y$ \nwhich is the transition point from gapless to gapped phase; moreover within the gapped phases the area law is clearly validated. \nHowever, inside the gapless phase, \nentanglement entropy has intermittent peaks whose number increases with increasing system size for \na given aspect ratio. The entanglement entropy for the half region with $J_x=J_y$ is similar to that \nshown for $J_x \\neq J_y$ with the initial monotonic increase for $J_x \\neq J_y$ being absent. We note  \nthat the intermittent peaks we find in the gapless phase for the entanglement entropy is very similar \nto what has been reported  earlier for the fidelity-susceptibility~\\cite{gu-2008}. The number of peaks  \nincreases linearly as the number of chains in the total system increases. \\\\\n\n\\begin{figure*}[ttp]\n\\label{Rec-JxJy}\n\\includegraphics[width=18cm]{Fig3.eps}\n\\caption{(Colour online) Entanglement properties of general square and rectangular subregions as a function of coupling $J_z$ in a $36 \\times 36$ Kitaev system; \ngapless phase is shaded blue as in Fig. \\ref{Fig2}.\nLeft panel: Entanglement entropy of various subregions across the phase transitions for $J_y/J_x = 1$ (top) and $J_y/J_x = 0.3$ (bottom); \nat the transition to/from the gapless phase there is a cusp in the free fermion entanglement entropy. However within the gapless phase the entropy does not monotonically change with varying $J_z$, and depends \non the transverse coupling and geometry of the subregion.\nMiddle panel: nearest-neighbour correlations for $x-x$ and $z-z$ bonds in the ground state for $J_y/J_x = 0.3\\textrm{ (closed symbols)}, 1.0\\textrm{ (open symbols)}$, \n the nonmonotonicity of which in turn suggests the nonmonotonicity of the entanglement entropy in the left panel.\n Right panel: Schmidt gap $\\Delta$ for various subsystem geometries with $J_y/J_x=0.3$. Within the gapless phase there are stronger variations in $\\Delta$ than when within or \n closer to the transition to the gapped phases. Inset displays similar results for $J_y/J_x=1$ (left y-axis corresponds to the largest subsystem $30 \\times 18$). \n The Majorana edge states (not shown) are not strongly localized along the \n boundaries in this case  having finite extension in the bulk as well. Thus the putative correspondence between the gapless edge mode and the \ngapless entanglement spectrum might not be straightforward here.} \n\\label{Fig3}\n\\end{figure*}\nWe now provide a possible explanation for the oscillations of the entanglement entropy in this half-region. \nWe know that the fundamental quantity which determines the entanglement entropy in a free-fermion system \nis the two point correlation function \\cite{peschel-2003}. \nHere we consider nearest neighbour correlation function to elucidate its connection to the oscillations present in the entanglement \nentropy. \nWe consider the nearest neighbour $z-z$ correlation function $\\mathcal{C}_{zz} \\equiv \\langle c^z_ic^z_{i+1}\\rangle$, \nwith the expectation value taken in the half-filled Majorana system\nfor various system sizes keeping the aspect ratio identical in accordance with the upper left panel of Fig. \\ref{Fig3}. \nThis may be seen to be expressed analytically as\n\\begin{eqnarray}\n&&\\mathcal{C}_{zz}=\\sum_k \\cos \\theta_k=\\frac{Re(f(k_x,k_y))}{|f(k_x,k_y)|}\n\\label{eq:corr1}\n\\end{eqnarray}\nwhere $|f(k_x,k_y)|$ is the dispersion of the Kitaev model given in Eq. (\\ref{eq:dispersion}).\nIn the lower left panel of  Fig. \\ref{Fig3} we have plotted the derivative of $C_{zz}$ with respect to $J_z$, where we may observe the \nappearance of similar oscillations.\nThe oscillations in the correlation function produces the oscillations in the derivative of it as well (but of higher magnitude) and explain the oscillations in the entanglement \nentropy. The oscillations in $C_{zz}$ may also be understood directly from the form of Eq. (\\ref{eq:corr1}).In the gapless phase the dispersion $f(\\vec{k})$ vanishes at \ncertain $\\vec{k}$ points in the Brillouin zone; \nhowever due to the discrete numerical evaluation of $\\vec{k}$-points, the dispersion may or may not be exactly zero, \nbut takes values that are arbitrarily close to zero depending on the system size and the value of the model parameters. This can occur only in the absence of a bulk gap, eventually \nresulting in the oscillations of the entanglement entropy depending on the full system size; we point out that this is not a violation of the area law, the fulfillment of which \nis more conspicuously visible in the gapped phase for the same reason. \nThe oscillations in the derivative of correlation function is more pronunced than the oscillations in the correlation function itself due to the presence of an additional \nfactor $|f(k_x,k_y)|$ in the denominator which becomes vanishingly small for some values of $k_x, k_y$. \\\\\n\nLet us turn now to the entanglement gap. In the middle panel of Fig. \\ref{Fig3}, we have plotted Schmidt gap for the half region for $J_x \\neq J_y$. We have found that \nas long as we are in the weakly coupled chain limit and in the gapped phase the Schmidt gap is finite but it \nabruptly goes to zero when it enters the gapless region. The gap continues to remain zero even in the large \n$J_z$ limit as the system enters the other gapped regime. This is a new result as an earlier study \\cite{yao-qi2010} \nassociated the zero Schmidt gap only with the gapless phase.  \nTo ascertain the origin of the zero gap, we have investigated the edge mode spectrum of the half region because \nthe presence of topological order and edge states are intimately linked to the entanglement spectrum \\cite{haldane-2008,lukasz-2010}\nWe have found that for the half-region geometry, which has zig-zag $x-y$ chains at the ends, the system \nharbours gapless edge modes in the large $J_z$ phase as well \nas in the gapless phase. This has been shown in the right panel of Fig. \\ref{Fig3}. However \nthe system has gapped edge spectrum in the weakly coupled gapped phase. Our findings of the Majorana edge mode spectrum  \nagrees with earlier analytical results on the same \\cite{diptiman} which, together with our findings on the Schmidt gap, \ncorroborates the previous observation \\cite{lukasz-2010,turner} that a gapless edge state is associated with the gapless entanglement spectrum.\\\\\n\nOur result for entanglement entropy and Schmidt gap may be compared with that of a previous study \\cite{konik-2013}, \nwhere the authors studied the entanglement entropy and Schmidt gap of the two-dimensional transverse field Ising model. Both the entanglement entropy and \nthe gap have different behaviour than what we have found here. The characteristic scaling of entanglement gap and the crossing \nof entanglement gap at the transition point when the system goes from gapped to gapless regime is absent in the Kitaev model. \nThis may be attributed to the fact that the transition in the transverse model is continuous and for the Kitaev model\nthe transition from gapless to gapped one is a topological one.\nThus we can see that the entanglement gap does not depend on\nthe gapless or gapped nature of the bulk spectrum but rather it is a property of the gapless edge mode and when such gapless edge mode\nis exist entanglement gap is zero. \nHowever entanglment gap can can also be zero without the presence of a gapless edge mode, for instance by breaking time reversal symmetry but preserving the inversion \nsymmetry \\cite{turner}.\\\\\n\nWe would like to mention that the above behaviour of entanglement entropy and gap as presented in Fig. \\ref{Fig3}  is also true for any number of chains taken periodic \nin the $x$-direction. We demonstrate this in the inset of the middle panel of  \nFig. \\ref{Fig3} where we have ploted the entanglement gap for different number of chains $n_y$; it is evident that the overall \nnature of the entanglement gap remains unchanged except that the change from a finite gap to a zero gap becomes sharper \nas the number of chains in the subsystem increases. \\\\\n\n\\section{Entanglement in rectangular subregions}\n\\label{section-3}\n\nIn this section we present numerical results for the entanglement entropy and gap of a finite block of square or rectangular geometry as \nshown in Fig.\\ref{Fig1}. Our motivation is twofold: first we analyze the variation of the entanglement entropy and gap as we \nvary $J_z$ for fixed values of $J_x, J_y$ (i) along the contour $J_x=J_y$ when the system changes from the gapless to the gapped phase \nand (ii) along the $J_x\\neq J_y$ line when the system changes from the gapped to gapless and again to gapped phase. \nAnd second, we study the variation of the entanglement entropy and gap as a function of system size and shapes, mainly from\nsquare to rectangular geometry, in order to discern signatures of the transitions, individual phases, and Majorana edge states from the \nnon-universal constant $\\alpha$. \\\\\n\nIn the left panels of Fig. \\ref{Fig3} we plot the variation of the entanglement entropy as a function of $J_z$ for various subsystem\nsizes for $J_x=J_y$ (upper plot) and for $J_y/J_x=0.3$ (lower plot). The results are scaled by the length of the boundary in each case. \nIn the first case we observe that initially as we increase $J_z$, the entanglement entropy decreases for\nall  subsystem sizes. However  depending on the subsystem shapes, the entanglement entropy either start to increase\nafter  some  values of $J_z$ (the  particular value of $J_z$ depends on the shapes of the subsystem) or remains almost constant\nbefore entering into the gapped phase where the entanglement entropy decreases uniformly irrespective of subsystem size and shapes.\nThus we find that entanglement entropy may be  nonmonotonic or monotonic depending on the system parameter. We believe that that there is a nonmonotonic variation \nof the entanglement entropy not just across phase transitions but also within the given gapless phase (implying that there is point of minimal entanglement in the gapless phase \nwhich depends on the subregion geometry) is a fact worth highlighting. Indeed an oscillatory nonmonotonicity was also observed for the entanglement entropy in the half region geometry \nwithin the gapless phase; this was however attributed to the onset of gapless $\\vec{k}$ modes in the bulk. \\\\ \n\nWe explain the above variation\nof entanglement entropy qualitatively with the correlation function. We note that an exact quantitative determination\nof entanglement entropy requires an analytical diagonalization of correlation matrix which is beyond the scope\nof any known technique to our knowledge. However we can expect that it is the boundary bonds shared between the subsystem and the system  which\nlargely determine the entanglement entropy. In the middle panel of Fig. \\ref{Fig3}, we have plotted the  two point\nMajorana fermionic correlation function for x-bonds and z-bonds. Any rectangular or square block shares x-bonds with the\nsystem at left and right boundary. On the other hand it shares z-bonds as the boundary bonds at the upper and lower\nboundary. As we see from the middle panel of Fig. \\ref{Fig3}, the bond correlation function behaves differently\nas we increase the value of $J_z$. As the ratio of number of z-bonds and x-bonds are different for different subsystems,\nthe entanglement entropy in turn shows a nonmonotonic behaviour. Thus we see that by  manipulating the ratio of length to breadth\nof a rectangular subsystem, one can go from monotonic to nonmonotonic dependence of the entanglement entropy within the gapless phase.\\\\\n\nFor $J_y/J_x=0.3$ which is been plotted at the lower left panel of Fig. \\ref{Fig3},\nwe observe similar behaviour: irrespective of the subsystem size, the entanglement entropy shows monotonic behaviour in the gapped phases. However in the\ngapless behaviour, as in the previous paragraph and the half-region of the previous section, here too it may or may not show monotonic behaviour depending on the \nvalues of $J_y/J_x$ and $J_z/J_x$. Indeed for a given $n_x/n_z$ ratio (where $n_x$ and $n_z$ are the number of $x$-bonds and $z$-bonds  \nshared between a square/rectangular subsystem with the system) the \nscaled entanglement entropy curves seem to collapse on top of each other both for $J_y = J_x$ and $J_y \\neq J_x$. \nThis is may be explained as follows: the primary contribution to the entanglement entropy comes from the nearest neighbour bond-correlation between the system and the subsystem;\n Then let $S(n_x, n_z)$  denote the entanglement entropy of a certain rectangular subsystem geometry having a total of $n_x$ and $n_z$  boundary $x$-bonds and $z$-bonds respectively. \n For simplicity we may assume $S(n_x,n_z)= \\kappa_x n_x + \\kappa_z n_z$ where $\\kappa_x$ and $\\kappa_z$ are the contributions due to a boundary  $x$-bond  and $z$-bond; \n then $S(n_x,n_z)/(n_x+ n_z)$ takes on a given value for a given $n_x/n_z$. \n However deviations from this qualitative argument are expected as contributions arise from all correlation function beyond the \n nearest-neighbour. \\\\\n\nNow we turn to the  right panel of Fig. \\ref{Fig3}, where we have plotted the entanglement gap or Schmidt gap ($\\Delta$) for $J_y/J_x=0.3$. We find that\nin the gapped region, the entanglement entropy is vanishingly small but in the gapless regime the entanglement entropy\nfluctuates as a function of $J_z$. However given the small value of $\\Delta$, we can assume that it is essentially zero. We have also\nlooked at the lowest energy eigenmode and found that they are always confined at the edge: the zero Schmidt gap\nis in confirmation of  Refs. \\onlinecite{haldane-2008,lukasz-2010} which posit that for a system with a gapped bulk,\nthe Schmidt gap depends on the low energy edge modes. Though the system is gapless in the bulk for the shaded region, we think\nthat it is the gapless edge mode which is the cause of vanishingly small $\\Delta$. In the inset of right panel of Fig. \\ref{Fig3},\nwe have plotted the Schmidt gap for $J_x=J_y$. We find a strong dependence of $\\Delta$ on the subsystem geometry.\nBut they are more or less finite in the small $J_z$ where the system is gapless and gradually becomes smaller as\n$J_z$ approaches deep within the gapless phase, and remains zero thereafter. We have checked the lowest\neigenfunctions and found that although it is primarily localized at the edge it has considerable extension in the bulk\nas well; in this case the precise relation between the edge mode and the entangelment gap $\\Delta$ becomes complicated and is unclear to us.\n\\section{Analytical insights}\n\\label{section-4}\nIn this section we provide an analytical insight to corroborate our numerical findings in Secs. \\ref{section-2} and \\ref{section-3}.\nIt might be noted here that the results presented in the previous sections are exact\nbecause in the derivation of Eqs. (\\ref{final-ent}) and (\\ref{final-gap}), no approximations have been used \n\\cite{peschel-2003}. However, following the complexity to obtain an analytic expression of the correlation matrix, one has to \nresort to numerical diagonalization of the same.\nHowever, we can obtain analytical insight for the nature of the entanglement entropy and gap using \nperturbative approximations in certain regimes of $J_z$ \nand may thus better understand the numerical results. \\\\\n\nFor completeness we first enlist our key results. \nFirstly, in case of half region, we have found that \nentanglement entropy increases parabolically with $J_z$ in the gapped phase (where $J_z$ is small i.e in \nthe weakly coupled chain limit) and becomes oscillatory in the gapless regime.  \nThe entanglement gap is finite in the weakly coupled chain limit where the system \nis gapped. It goes to zero once the system enters the gapless regime and remains gapless in the large $J_z$ gapped \nphase. Secondly, we found that for $J_x=J_y$, the square block entanglement entropy shows a critical values of $J_z=J_c$, upto \nwhich the entanglement entropy decreases and then either increases or remains constant. Thirdly, for the square block we found \nthe entanglement gap shows small fluctuations for small $J_z$. \nWe begin our discussion in the small $J_z$ limit i.e weakly coupled chain limit in Sec. \\ref{weak-lim} \nwhere we qualitatively explain the behaviour of the entanglement gap for the half region. The \nbehaviour of the entanglement entropy and gap in the large $J_z$ limit will be explained in Sec. \\ref{large-lim}.\n\n\n\\subsection{Weakly coupled chain limit: small $J_z$}\n\\label{weak-lim}\nThe weakly coupled chain limit \ncan be addressed by perturbation theory where the unperturbed\nHamiltonian consists of one dimensional chains. The complete two dimensional system is treated as composition\nof many one dimensional chains coupled by small $J_z$.  Here we consider $N$ coupled chain with periodic boundary\nso that $N^{\\textrm{th}}$ chain is connected to the first chain. The complete Hamiltonian for the two-dimensional \nlattice is written as the following,\n\\begin{eqnarray}\n&&\\mathcal{H}= \\mathcal{H}_0 + \\mathcal{H}^{\\prime} \\\\\n&&\\mathcal{H}_0= \\sum^{N}_{m} \\mathcal{H}^m_0, ~~~~\\mathcal{H}^{\\prime}= \\sum_m \\mathcal{H}^{\\prime}_{m,m+1} \\\\\n&&\\mathcal{H}^m_0= \\sum_{n} \\Big( i J_x c^m_{n ,a} c^m_{n ,b}  + i J_y c^{m}_{n ,b} c^{m}_{n +1,a} \\Big) \\\\\n&&\\mathcal{H}^{\\prime}_{m,m+1}= \\sum_{n}  i J_z c^{m}_{n ,a} c^{m-1}_{n ,b}\n\\end{eqnarray}\nHere  $\\mathcal{H}^m_0$ is the unperturbed Hamiltonian for the $m^{th}$ one dimensional chain and $\\mathcal{H}^{\\prime}$ \ndenotes the interchain coupling and forms the perturbation to the unperturbed Hamiltonian $\\mathcal{H}_0$. \nUsing Fourier transform, $c^m_{n , \\gamma} = \\sum_{\\vec{k}}\\textrm{e}^{i\\vec{k}.\\vec{r}_{i, \\gamma}}c^m_{n ,\\gamma}$ \nfor the $m^{\\textrm{th}}$ chain where $\\gamma = a, b$ and the $\\vec{k}-$ summation is over $(-\\pi,\\pi)$. Notice that for $c^m_{n }$ to be Majorana fermions, we must \nhave $c^m_{-k,\\gamma}= c^{m\\dagger}_{k,\\gamma}$ which implies that \nin momentum space only the fermion operators belonging to first Brillouin zone are independent. Using this definition \nand after subsequent diagonalization we can write, \n\\begin{eqnarray}\n\\mathcal{H}^m_0 = \\sum |\\epsilon_k| \\Big( \\alpha^{m \\dagger}_k \\alpha^m_k - \\beta^{m \\dagger}_k \\beta^m_k \\Big)\n\\end{eqnarray}\nwith $\\epsilon_k = |J_x + J_y e^{i k} |$. The new fermionic modes are defined as,\n\\begin{eqnarray}\n\\label{eq: substitution}\n\\left( \\begin{array}{c}\nc^m_{k,a} \\\\\nc^m_{k,b} \\end{array} \\right)= \\frac{1}{\\sqrt{2}} \\left( \\begin{array}{cc}\ni e^{i \\theta_k} & i e^{i \\theta_k} \\\\\n1 & -1\\end{array}  \\right)\n \\left( \\begin{array}{c}\n\\alpha^m_k \\\\\n\\beta^m_k \\end{array} \\right)\n\\end{eqnarray}\nwhere $ \\theta_k =  \\tan^{-1}\\left( \\frac{J_y\\sin{k}}{J_x + J_y\\cos{k}} \\right)$. Using \\eqref{eq: substitution}, the interchain \nperturbation  governed by $J_z$  can be written as,\n\\begin{eqnarray}\n \\label{eq: perturbation}\n\\mathcal{H}^{m,m+1}_p &=&  \\sum_{k \\geq 0} \\frac{J_z e^{i \\theta_k}}{4} \\Big( \\alpha^{m \\dagger}_{k} \\alpha^{m-1}_{k} - \\alpha^{m \\dagger}_{k} \\beta^{m-1}_{k} \\nonumber \\\\\n&& + \\beta^{m \\dagger}_{k} \\alpha^{m-1}_{k} - \\beta^{m\\dagger}_{k} \\beta^{m-1}_{k} \\Big) + {\\rm h.c}\n \\end{eqnarray}\nwhere the summation is over all the $m$ chains. \n\nGround state of the system can be written as the product of the  individual ground states of each chain. Let $| g,m\\rangle$\ndenote the ground state of $m^{th}$ chain and $| \\mathcal{G} \\rangle$ denote the  ground state for the complete\nsystem, then we can write,\n\\begin{eqnarray}\n| \\mathcal{G} \\rangle = \\prod^{N}_{m=1} | g,m\\rangle, ~~~~| g,m\\rangle= \\prod_k \\beta^{m \\dagger}_k |0 \\rangle\n\\end{eqnarray}\n\nNext, our task is to find the perturbed ground state when we take into account Eq. (\\ref{eq: perturbation}), as the perturbation. \nFor simplicity, we limit ourselves upto to second order in $J_z$ for the corrections in the entanglement entropy and gap \nand neglect subsequent higher order corrections.\nFor this purpose it is sufficient to limit upto the first order corrections of the ground state which is given as,\n\n\\begin{eqnarray}\n\\label{1stcorr}\n|\\mathcal{G}_1 \\rangle &&= |\\mathcal{G} \\rangle \\Big( 1- N\\sum_k  \\frac{J^2_z}{64} \\frac{1}{\\epsilon^2_k} \\Big) \\nonumber \\\\\n-\\sum_m  &&\\frac{(-1)^{N-m}J_z}{8 \\epsilon_k}  \\Big(e^{-i \\theta_k} | 0,0;m-1 \\rangle  | 1,1;m \\rangle |\\mathcal{G}:m,m-1 \\rangle \\nonumber \\\\\n&& - e^{i \\theta_k} | 0,0;m+1 \\rangle  | 1,1;m \\rangle |\\mathcal{G}:m+1,m \\rangle \\Big)\n\\end{eqnarray}\n \nWhere, $|\\mathcal{G}:a,b,c,...\\rangle = \\prod_{m \\neq a,b,c,..} | g,m \\rangle$ and   $| p,q;m \\rangle = (\\alpha^{\\dagger}_m)^p (\\beta^{\\dagger}_m)^q |0 \\rangle$, \nwhere $p,~ q$ can only take values $0$ or $1$. Reduced density matrix of the half region can be calculated easily by considering the first order correction to the ground state wavefunction itself. \nThe reduced density matrix contains two diagonal terms, first comes from the 1st term of Eq. (\\ref{1stcorr}) and is proportional to unity. \nThe second term of Eq. (\\ref{1stcorr}) yields another diagonal terms proportional to $J^2_z$. \nThe off-diagonal terms are of two types, terms which are proportional to $J_z$ and is obtained from the product of first and second terms of Eq. (\\ref{1stcorr}). \nThese off-diagonal terms can be treated as perturbation to the first diagonal terms of the reduced density matrix which is proportional to unity. \nWhile the other off-diagonal terms coming from the second term yields a correction $\\sim J^4_z$. Thus considering only the terms upto $J^2_z$, we get the following expressions for \nthe largest and second largest eigenvalues of the reduced density matrix,\n\n\\begin{eqnarray}\n\\label{eq:red-eig-value}\n&&\\lambda_{1}= \\lambda_0 + \\sum_k\\frac{(N^{\\prime}-1)J^2_z}{32 \\epsilon^2_k} \\Big(\\lambda_0- \\frac{J^2_z}{64 \\epsilon^2_k} \\Big)^{-1} ,\\\\\n&&\\lambda_2= \\Big( \\frac{J^2_z}{64 \\epsilon^2_{k}} \\Big)_{\\rm min}=\\frac{J^2_z}{64 (J_x-J_y)^2}\n\\end{eqnarray}\nwhere $\\lambda_0=1- N\\sum_k \\frac{J^2_z}{32 \\epsilon^2_k}$. \nIn the above $N^{\\prime}$ \nis the number of chains in the subsystem. From the expression of Eq. (\\ref{eq:red-eig-value}), we find that for small values of $J_z$, the \nentanglement entropy has a parabolic dependence on $J_z$ as is found in Fig: \\ref{Fig2}.\n\n\\subsection{Dimer limit: strong $J_z$}\n\\label{large-lim}\n\\label{half-chain2}\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{Fig4.eps}\n\\caption{(Colour online) \nIn the large $J_z$ limit we associate each $z$-bond with a $\\psi$ fermion in order to compute the reduced density matrix.\nThe boundary is composed of the upper, lower and the two side boundaries. \nFor the upper and lower boundaries a $\\psi$ fermion is shared between the system and the subsystem. For this reason we regrouped the two adjacent $\\psi$ fermions to define \ntwo $\\chi$ fermions (as shown at the right side of the figure) such that $\\chi_1$ belongs to the system and $\\chi_2$ belongs to the subsystem.}\n\\label{majo-group}\n\\end{figure}\nThe value of the entanglement entropy at large $J_z$ limit is easy to calculate. Here we present the perturbative results\nfor entanglement entropy and gap in the large $J_z$ limit for the half region. In the limit $J_z \\rightarrow \\infty$  the Hamiltonian \nconsists of isolated $z$-bonds only and the Hamiltonian for each z-bond is $J_z i c_{i,1} c_{i,2}$ where $i$ denotes a particular $z$-bond \nand `1' and `2' refer to the sites inside and the outside of the subsystem. It is straightforward to see that integrating out one Majorana fermion \nyields a contribution $ {\\rm log} 2$  to the entropy. Thus if there are in total $N_z$ number of $J_z$ bonds shared between the subsystem \nand the system, we obtain the limiting values of the entanglement entropy as $N_z {\\rm log} 2$. The perturbation here amounts to switching on the hopping of Majorana fermions \nbetween nearest neighbour dimers. The Hamiltonian can then be written as\n\n", "index": 7, "text": "\\begin{equation}\nH= \\sum_{n}  J_z i c_{n ,1} c_{n ,2} +  \\sum_{n } J_{\\alpha} i c_{n ,1} c_{n +\\delta_\\alpha,2},~\\alpha=x,y\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"H=\\sum_{n}J_{z}ic_{n,1}c_{n,2}+\\sum_{n}J_{\\alpha}ic_{n,1}c_{n+\\delta_{\\alpha},%&#10;2},~{}\\alpha=x,y\" display=\"block\"><mrow><mrow><mi>H</mi><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><msub><mi>J</mi><mi>z</mi></msub><mo>⁢</mo><mi>i</mi><mo>⁢</mo><msub><mi>c</mi><mrow><mi>n</mi><mo>,</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msub><mi>c</mi><mrow><mi>n</mi><mo>,</mo><mn>2</mn></mrow></msub></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><msub><mi>J</mi><mi>α</mi></msub><mo>⁢</mo><mi>i</mi><mo>⁢</mo><msub><mi>c</mi><mrow><mi>n</mi><mo>,</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msub><mi>c</mi><mrow><mrow><mi>n</mi><mo>+</mo><msub><mi>δ</mi><mi>α</mi></msub></mrow><mo>,</mo><mn>2</mn></mrow></msub></mrow></mrow></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><mi>α</mi><mo>=</mo><mrow><mi>x</mi><mo>,</mo><mi>y</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01695.tex", "nexttext": "\nwhere $|1_{n}, 1_m \\rangle= |1\\rangle_{n}  \\times |1\\rangle_{m} $ and denotes the filled states at the dimer `$n $' and `$m $'.\nWe retain the expansion of the ground state upto first order as we intend to find the reduced density matrix upto second\norder in $J$.  We see that the two Majorana fermions\nmay be grouped together to define a single complex fermion at a given $z$-bonds. While calculating the reduced density matrix one\nneeds to integrate out the Majorana fermion outside the subsystem. To this end we introduce a pair of $\\chi$ fermions out of the\ntwo adjacent $\\psi$ fermions as shown in the Fig. \\ref{majo-group} and then calculate the reduced density matrix of\nan extended subsystem which includes both the sites of the boundary $z$-bonds. \nThe reduced density matrix for the half region can then be obtained easily by taking \na trace of the $\\chi_1$ fermions. The detailed mapping between the Fock space of\nof $\\psi_{1,2}$ and $\\chi_{1,2}$ fermions is as follows: \n\\begin{eqnarray}\n\\label{eq: mapping}\n |0,0\\rangle_{\\psi}&=& \\frac{1}{\\sqrt{2}} (|1,0\\rangle_{\\chi} + i|0,1\\rangle_{\\chi} ), \\nonumber \\\\\n |1,0\\rangle_{\\psi}&=& \\frac{1}{\\sqrt{2}} (|0,0\\rangle_{\\chi} - i|1,1\\rangle_{\\chi} ), \\nonumber \\\\\n |0,1\\rangle_{\\psi}&=&- \\frac{1}{\\sqrt{2}} (i |0,0\\rangle_{\\chi} - i|1,1\\rangle_{\\chi} ),\\nonumber \\\\\n |1,1\\rangle_{\\psi}&=& \\frac{1}{\\sqrt{2}} (|0,1\\rangle_{\\chi} + i|1,0\\rangle_{\\chi} ).\n\\end{eqnarray}\n\nWe can now write down the reduced density matrix of the extended subsystem in the $\\psi$ basis as follows:\n\\begin{eqnarray}\n\\rho_E&&= \\left(1- N \\frac{J^2}{4J^2_z}\\right) |\\mathcal{O}\\rangle \\langle \\mathcal{O}| + \\sum_{i,j} \\Big( \\frac{J^2}{4 J^2_z} |\\tilde{\\mathcal{O}},1_i\\rangle \\langle \\tilde{\\mathcal{O}},1_i|  +\\nonumber \\\\\n&& \\frac{J^2}{4 J^2_z} |\\tilde{\\mathcal{O}},1_i, 1_j\\rangle \\langle \\tilde{\\mathcal{O}},1_i,1_j| + \\frac{J}{2 J_z} |\\mathcal{O}\\rangle \\langle \\tilde{\\mathcal{O}},1_i,1_j|  \\Big).\n\\label{red-extnd}\n\\end{eqnarray}\nIn the above expression $|\\mathcal{O}\\rangle $ denotes the vacuum of the  extended subsystem only \nand $|\\tilde{\\mathcal{O}},1_i,1_j...\\rangle $ denotes a state with filled dimer on sites $i,~j,$ etc. \nIn the second term, the index `$i$' refers only the boundary $z$-bonds. \nIn third and fourth term `$i$' and `$j$' denotes nearest neighbours.  Now employing the transformation in Eq. (\\ref{eq: mapping}) between  $\\psi$ and $\\chi$\nbasis, we immediately see that first term of Eq. (\\ref{red-extnd}) yields $N_z$ number of degenerate eigenvalues \n$\\frac{1}{2} (1-N \\frac{J^2}{4J^2_z})$ where $N_z$ is the number of boundary z-bonds. This is a vital point and corroborates the vanishing Schmidt gap observed in the dimer \nlimit. This result, taken together with the analytical computations of Ref. \\onlinecite{diptiman} where zig-zag Majorana edge states are unveiled in this limit, provides \nan analytical confirmation of the bulk-edge correspondence \\cite{haldane-2008, lukasz-2010}.\\\\\n\nFurthermore these eigenvalues are \nobtained from the diagonal part of the reduced density matrix and the fourth term in Eq. (\\ref{red-extnd}) is the perturbation acting on these \nterms. The second and third term of Eq. (\\ref{red-extnd}) yields the second largest eigenvalues and they are \nalso diagonal. After some straightforward algebra we find the largest and the second largest eigenvalues to be given by\n\\begin{eqnarray}\n\\label{eq:half-eig-value}\n&&\\lambda_{1}= \\lambda_0 + \\frac{\\tilde{N} J^2}{64 J^2_z} \\Big(\\lambda_0- \\frac{J^2}{64 J^2_z} \\Big)^{-1} ,\\\\\n&&\\lambda_2=  \\frac{J^2}{8 J^2_z}\n\\end{eqnarray}\nwhere $\\lambda_0=1- {\\tilde N} \\frac{J^2}{2 J^2_z}$. In the above $\\tilde{N}$ denote the total number of $z$-bonds in the system. \n\n\\section{Conclusions}\n\\label{section-5}\n\nWe have presented an extensive study of the entanglement entropy and Schmidt gap for the Kitaev model\nand showed its variation along specific contours in the phase space of parameters. The separation of the contributions of the entanglement entropy into a free (Majorana) \nfermionic part and a gauge field part allowed us to treat large systems. We have considered\nmainly two  specific geometries \\textit{viz.} \na square/rectangular block and the half region, the latter being defined as one half of the torus. For both geometries of the subsystem, the free fermionic \nentanglement entropy is found to capture the presence of phase transitions in the Kitaev model. \\\\\n\nFor the half-region the entangelment entropy was found to be an oscillating function\nin the gapless phase due to the long range correlation that exists in the gapless phase and the presence of gapless $\\vec{k}$-modes. However, the entanglement gap\nis finite in the weakly coupled gapped phase and drops to zero as soon as the system enters the gapless phase.\nThe entanglement gap remains zero even when the interchain coupling $J_z$ is increased further \nand the system enters the Toric code limit which is also gapped. Thus we have shown although both the \ngapped regions are of the same topological character, the entanglement\n gap is finite in one phase and zero in the other. We have demonstrated how this may be attributed to the presence or absence of zero energy edge modes in the system; \n the latter's connection with the entanglement gap is further confirmation of the bulk-edge correspondence.\\\\\n\nFor the square block the entanglement entropy was seen to exhibit nonmonotonic \nbehaviour as a function of interchain coupling $J_z$ while within in the gapless phase, \ngenerically reaching a point of minimum entanglement within the gapless phase before the entanglement starts increasing again with the coupling. We explained that this is due\nto the competition between correlation functions in different kind of bonds that are shared between the subsystem\nand rest of the system. In the weakly coupled chain limit, the entanglement gap is a mildly fluctuating function of the interchain\ncoupling parameter $J_z$ due, possibly, to the finite extent of edge modes into the bulk.  \\\\\n\nWe have corroborated our numerical findings by perturbative \nanalytical calculations in the appropriate regimes, in particular corroborating the bulk-edge correspondence for the half-region. \nA more detailed analytical study of the entanglement gap for the two regions deserves further attention, especially close to the transitions, which we leave for future work.\n\nOne of the authors (VKV) thanks F. Franchini and T. Grover for discussions.\n\n\\begin{thebibliography}{100}\n\n\\bibitem{Luigi-Amico} Luigi Amico, Rosario Fazio, Andreas Osterloh, Vlatko Vedral, Rev. Mod. Phys {\\bf 80}, 517 (2008).\n\n\n\\bibitem{Eisert} J. Eisert, M. Cramer and M. B. Plenio, Rev. Mod. Phys {\\bf 82}, 277 (2010).\n\n\n\\bibitem{Nishiyoka-2009} T. Nishioka, S. Ryu and T. Takayanagi, J Phys. A {\\bf 42}, 504008 (2009).\n\n\n\\bibitem{Renyi-1960} A. R\\'{e}nyi, Proceedings of the $\\rm{4^{th}}$ Berkley Symposium on Mathematics, Statistics and Probability,  {\\bf 1}, 547-561 (1960).\n\n\n\\bibitem{Renyi-1965} A. R\\'{e}nyi,Rev. Int. Stat. Inst. {\\bf 33}, 1 (1965).\n\n\n\\bibitem{haldane-2008} Hui Li and F. D. M. Haldane, Phys. Rev. Lett {\\bf 101}, 010504 (2008).\n\n\n\\bibitem{konik-2013} Andrew J. A. James and Robert M. Konik, Phys. Rev. B {\\bf 87}, 241103(R), (2013).\n\n\n\\bibitem{berkovits-2015} Shaul Leiman, Ariel Eisenbach, Richard Berkovits, arXiv:1507.06177 (2015).\n\n\\bibitem{calabrese-2008} P. Calabrese and A. Lefevre, Phys. Rev. A {\\bf 78}, 032329 (2008).\n\n\n\\bibitem{calabrese-2004} P. Calabrese and J. Cardy  J. Stat. Mech. {\\bf P06002} (2004).\n\n\n\\bibitem{maiti-2014} J Sirker, M Maiti, N P Konstantinidis1, N Sedlmayr, J. Stat. Mech. {\\bf 14}, 1742-5468 (2014).\n\n\n\\bibitem{levi-2013} E. Levi, O. Castro-Alvaredo and B. Doyon, Phys. Rev. B {\\bf 88}, 094439 (2013).\n\n\n\\bibitem{bombelli-1986} L. Bombelli, R. K. Koul, J. Lee, and R. D. Sorkin, Phys. Rev. D {\\bf 34}, 373 (1986); M. Srednicki,  Phys. Rev. Lett. {\\bf 71}, 666 (1993).\n\n\n\\bibitem{plenio-2005} M. B. Plenio, J. Eisert, J. Dreissig, and M. Cramer, Phys. Rev. Lett. {\\bf 94}, 060503 (2005).\n\n\n\\bibitem{wolf-2006} Michael M. Wolf, Phys. Rev. Lett.  {\\bf 96}, 010404 (2006).\n\n\n\\bibitem{cirac-2005} F. Verstraete, J. I. Cirac, J. I. Latorre, E. Rico, and M. M. Wolf, Phys. Rev. Lett. {\\bf 94}, 140601 (2005).\n\n\n\\bibitem{latorre-2005} J. I. Latorre, C. A. Lutken, E. Rico, and G. Vidal, Phys. Rev. A {\\bf 71}, 034301 (2005).\n\n\n\\bibitem{kitaev-topo} A. Kitaev and J. Preskill, Phys. Rev. Lett. {\\bf 96}, 110404, (2006).\n\n\n\\bibitem{levin-topo} M. Levin and X. G. Wen, Phys. Rev. Lett. {\\bf 96}, 110405, (2006).\n\n\n\\bibitem{cirac-2004} F. Verstraete, D. Porras, and J. I. Cirac, Phys. Rev. Lett. {\\bf 93}, 227205 (2004); \n\n\n\\bibitem{murg-2005} V. Murg, F. Verstraete, and J. I. Cirac, Phys. Rev. Lett. {\\bf 95}, 057206 (2005); \n\n\n\\bibitem{zwolak-2004} M. Zwolak and G. Vidal, Phys. Rev. Lett. {\\bf 93}, 207205 (2004); \n\n\n\\bibitem{g-vidal-2004} G. Vidal, Phys. Rev. Lett. {\\bf 93}, 040502 (2004).\n\n\n\\bibitem{sirker-2012} J.Sirker, J. Stat. Mech.  P12012 (2012).\n\n\n\\bibitem{kitaev-2003} A.Y Kitaev, Ann. Phys. {\\bf 303}, 2 (2003).\n\n\n\\bibitem{kitaev-2006} A. Y Kitaev, Ann. Phys. {\\bf 321}, 2 (2006).\n\n\n\\bibitem{smandal-prl} G. Baskaran, S. Mandal, and R. Shankar, Phys. Rev. Lett. {\\bf 98 }, 247201 (2007).\n\n\n\\bibitem{smandal} S. Mandal, R. Shankar and G. Baskaran, J. Phys. A: Math. Theor. {\\bf 45} 335304 (2012).\n\n\n\\bibitem{krishnendu-quench-2008} K. Sengupta, D. Sen, and S. Mondal, Phys. Rev. Lett {\\bf 100}, 077204 (2008).\n\n\n\\bibitem{vidal1-2008} S. Dusuel, Kai Phillip Schmidt, and Julien Vidal, Phys. Rev. Lett {\\bf 100}, 177204 (2008).\n\n\n\\bibitem{delgado-2007} H. Bombin and M. A. Martin-Delgado, Phys. Rev. B {\\bf 75}, 075103 (2007).\n\n\n\\bibitem{saptarshi-2014} Saptarshi Mandal, and Naveen Surendran, Phys. Rev. B {\\bf 90}, 104424 (2014).\n\n\n\\bibitem{gabor-2014} Gabor B. Halasz, J. T. Chalker, and R. Moessner, Phys. Rev. B {\\bf 90}, 035145 (2014).\n\n\n\\bibitem{zanardi-2005} A. Hamma, R. Ionicioiu, and P. Zanardi, Phys. Lett. A {\\bf 337}, 22 (2005).\n\n\n\\bibitem{castelnovo-2007} Claudio Castelnovo and Claudio Chamin, Phys. Rev. B {\\bf 76}, 184442 (2007).\n\n\n\\bibitem{yao-qi2010} Hong Yao and Xiao-Liang Qi, Phys. Rev. Lett. {\\bf 105}, 080501 (2010).\n\n\\bibitem{shinjo-2015} Kazuya Shinjo, Shigetoshi Sota, and Takami Tohyama, Phys. Rev. B {\\bf 91}, 054401 (2015).\n\n\\bibitem{peschel-2003} Ingo Peschel, J. Phys. A: Math. Gen. {\\bf 36}  L205-208 (2003).\n\n\n\\bibitem{calabrese-2010} Maurizio Fagotti, Pasquale Calabrese, J. Stat. Mech. (2010) P04016.\n\n\n\\bibitem{vidal-2004} J. I. Latorre, E. Rico, G. Vidal, Quant.Inf.Comput. {\\bf 4}, 48-92 (2004).\n\n\n\\bibitem{gu-2008} Shuo Yang, Shi-Jian Gu, Chang-Pu Sun and Hai-Qing Lin, Phys. Rev. A {\\bf 78}, 012304 (2008).\n\n\n\\bibitem{lukasz-2010} Lukasz Fidkowski, Phys. Rev. Lett, {\\bf 104 }, 130502 (2010).\n\n\n\\bibitem{diptiman} Manisha Thakurathi, K. Sengupta, Diptiman Sen, Phys. Rev. B {\\bf 89}, 235434 (2014).\n\n\n\\bibitem{turner} Ari M. Turner, Yi Zhang, and Ashvin Vishhwanath, Phys. Rev. B {\\bf 82} (R), 241102 (2010).\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 53578, "prevtext": " \n\nIn the above expression $n +\\delta_{\\alpha}$ refers to the  nearest neighbour dimer connected by an $\\alpha$-bond with the $n^{\\textrm{th}}$\ndimer. \nWe may now define a $\\psi$ fermionic basis using the substitution $c_{n ,1}= \\psi_{n}  + \\psi^{\\dagger}_{n} ,~~~~ c_{n ,2}= -i (\\psi_{n}  - \\psi^{\\dagger}_{n}  )$, \nsuch that $\\psi_n |0\\rangle_n = 0$, with $|0\\rangle_n$ being the vacuum state of the dimer at site `$n$'; \nthe ground state of the full system is then obtained as $|\\mathcal{G}_0 \\rangle=|\\mathcal{O}\\rangle$ where $|\\mathcal{O}\\rangle= \\prod_i|0\\rangle_i$.  \nTo calculate the reduced density matrix, as in the weak $J_z$ limit,\nwe begin with the  perturbed ground state. The perturbed ground state to second order in $J = J_{\\alpha},~~\\alpha=x,y$, is then given by\n\n", "index": 9, "text": "\\begin{equation}\n|\\mathcal{G}_1 \\rangle= \\left(1- N \\frac{J^2}{8J^2_z}\\right)|\\mathcal{O}\\rangle + \\sum_{<i,i+\\delta_{\\alpha}>} \\frac{J_{\\alpha}}{2 J_z}|1_{n} , 1_{{n} +\\delta_{\\alpha}} \\rangle,  \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"|\\mathcal{G}_{1}\\rangle=\\left(1-N\\frac{J^{2}}{8J^{2}_{z}}\\right)|\\mathcal{O}%&#10;\\rangle+\\sum_{&lt;i,i+\\delta_{\\alpha}&gt;}\\frac{J_{\\alpha}}{2J_{z}}|1_{n},1_{{n}+%&#10;\\delta_{\\alpha}}\\rangle,\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mn>1</mn></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mrow><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>N</mi><mo>⁢</mo><mfrac><msup><mi>J</mi><mn>2</mn></msup><mrow><mn>8</mn><mo>⁢</mo><msubsup><mi>J</mi><mi>z</mi><mn>2</mn></msubsup></mrow></mfrac></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow><mo>,</mo><mrow><mrow><mi>i</mi><mo>+</mo><msub><mi>δ</mi><mi>α</mi></msub></mrow><mo>&gt;</mo><mi/></mrow></mrow></munder><mrow><mfrac><msub><mi>J</mi><mi>α</mi></msub><mrow><mn>2</mn><mo>⁢</mo><msub><mi>J</mi><mi>z</mi></msub></mrow></mfrac><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mn>1</mn><mi>n</mi></msub><mo>,</mo><msub><mn>1</mn><mrow><mi>n</mi><mo>+</mo><msub><mi>δ</mi><mi>α</mi></msub></mrow></msub></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]