[{"file": "1601.07697.tex", "nexttext": "\nThe first term on the left-hand side accounts for inertial forces while the second one introduces\nviscous forces. The term on the right-hand side is due to capillary forces. \n$z$ designates the position of the invading front, $r$ is the radius of the channel and $L$ its length.\nWhen inertial forces are neglected, for a shrinking radius as $r(t)=r_{0}-kt$ ($r_{0}$ is the initial radius and $k$\nis the reaction-rate constant) a solution to the above equation is given by\n\n", "itemtype": "equation", "pos": 10929, "prevtext": "\n\n\\title{Simulation of capillary infiltration into packing structures by the Lattice-Boltzmann method for the optimization of ceramic materials}\n\n\\author{Danilo Sergi}\n\\affiliation{University of Applied Sciences SUPSI, \nThe iCIMSI Research Institute, \nGalleria 2, CH-6928 Manno, Switzerland}\n\\author{Loris Grossi}\n\\affiliation{University of Applied Sciences SUPSI, \nThe iCIMSI Research Institute, \nGalleria 2, CH-6928 Manno, Switzerland}\n\\author{Tiziano Leidi}\n\\affiliation{University of Applied Sciences SUPSI, \nThe iCIMSI Research Institute, \nGalleria 2, CH-6928 Manno, Switzerland}\n\\author{Alberto Ortona}\n\\affiliation{University of Applied Sciences SUPSI, \nThe iCIMSI Research Institute, \nGalleria 2, CH-6928 Manno, Switzerland}\n\n\\date{\\today}\n\n\\keywords{Lattice-Boltzmann method, Pore-scale simulations for capillary infiltration, Packing structures, Reaction-bonded ceramics}\n\n\n\\begin{abstract}\nIn this work we want to simulate with the Lattice-Boltzmann method in 2D the capillary infiltration into porous structures obtained\nfrom the packing of particles. The experimental problem motivating our work is the densification of carbon preforms by reactive\nmelt infiltration. The aim is to determine optimization principles for the manufacturing of high-performance ceramics. Simulations\nfor packings with varying structural properties demonstrate that the infiltration tends to proceed through the formation of fluid\nfingers rather than the advancement of a compact front. The effective radii are in line with the results reported in previous studies.\nOur analysis suggests that the resulting slow infiltrations can be ascribed to interface dynamics. It is verified that in this process\nthe role of inertia remains of secondary importance. Pinning represents the primary factor retarding fluid penetration. The mechanism\nresponsible for this phenomenon is analyzed in detail. Bimodal size distributions appear as a candidate for generating the best\nconfiguration for the porosity. When surface growth is allowed, it is found that the phenomenon of pinning becomes stronger. The\nretardation effects are more detrimental for fast infiltrations with higher orientation disorder. Again, bimodal size distributions\noffer advantages for optimal infiltration. Systems trying to reproduce typical experimental conditions are investigated. It turns\nout that the standard for accurate simulations is challenging. The relative strength of capillary forces is weaker than required.\nThis means that the details of the infiltration dynamics are not reproduced exhaustively, even though the macroscopic behavior can be\nrecovered almost properly. The primary obstacle to overcome for enhanced accuracy seems to be the over-occurrence of pinning.\n\\end{abstract}\n\n\\maketitle\n\n\n\\section*{1.~~~INTRODUCTION}\n\nPorous media are ubiquitous in science and engineering. \nTypical examples ripple across a number of disciplines such as hydrology, oil recovery, materials science,\nprinting and solar technology, to cite but a few (Bear, 1972; Dullien, 1992; Furler et al., 2012; Goodall\nand Mortensen, 2013; Koponen et al., 1998).\nIn simulations, their structures are investigated according to a variety of properties (mechanical, thermal and\nfluid dynamics) mainly through finite elements methods (FEM) (Alawadhi, 2010; Bohn and Garboczi, 2003).\nCapillarity is the spontaneous infiltration of a fluid into a porous medium (Alava et al., 2004; Washburn, 1921).\nThe adhesive forces between the liquid and solid phases are responsible for this phenomenon. Indicatively, its characteristic\nlength scale is the micron (de Gennes et al., 2004). Our interest is in the role of the porous structure for capillary\ninfiltration. Simulations are carried out by using the Lattice Boltzmann (LB) method\n(Benzi et al., 1992; Chen and Doolen, 1998; Succi, 2009; \nSukop and Thorne, 2010; Wolf-Gladrow, 2005). This is a numerical scheme for approximating\nthe hydrodynamic behavior, especially suited for problems involving complex boundaries and interface phenomena.\nIts main advantage over other approaches resides in the discretization of the velocity space and a statistical\ntreatment of particle motion and collisions. Applications encompass disparate critical systems \n(Bao et al, 2014; Ghosh et al., 2012; Haghani et al., 2013; Joshi and Sun, 2010; Liu et al., 2012;\nWang and Pan, 2008). The accuracy is in general comparable with that of studies in computational fluid dynamics\n(CFD) based on FEM (Succi, 2009).\n\nThe actual problem motivating our research is the reactive infiltration of molten silicon (Si) into carbon (C) preforms\n(Bougiouri et al., 2006; Dezellus and Eustathopoulos, 2010; Dezellus et al., 2003; Einset, 1996 and 1998; Eustathopoulos, 2015;\nEustathopoulos et al., 1999; Hillig et al., 1975; Israel et al., 2010; Liu et al., 2010; Messner and Chiang, 1990;\nMortensen et al., 1997; Voytovych et al., 2008). This is a complex phenomenon associated with a wetting transition\nand surface growth. A feature of this process is that Si reacts with C to form silicon carbide (SiC). Si wets SiC but\ndoes not wet C (Bougiouri et al., 2006). Furthermore, the reaction-formed phase causes the thickening of the surface\nbehind the invading front (Bougiouri et al., 2006; Einset, 1996 and 1998; Israel et al., 2010; Messner and Chiang, 1990).\nThe interaction with the fluid\nflow results in a retardation of the infiltration up to its interruption because of pore clogging. This research gains\nincreasing attention also in industrial practice. Liquid Si infiltration (LSI) is a common manufacturing route to\nhigh-performance ceramics. Prominent advanced applications include armor and brake systems (Fan et al., 2008; \nKrenkel and Berndt, 2005; Roberson and Hazell, 2003).\nSignificant engineering efforts concentrate on the control of the effects of reactivity. Indeed, SiC formation provides\nadditional hardness to the resulting ceramic material, reducing also the amount  of residual unreacted Si detrimental\nfor high-temperature functioning. On the other hand, pore closure can stop infiltration before full densification\nis attained. The microstructure of the C preform is of course of importance for optimal impregnation, besides for the\noperating behavior of the final ceramic product in specific applications (e.g., the length of reinforced C fibers) \n(Aghajanian et al., 2013; Gadow, 2000; Gadow and Speicher, 2000; Israel et al., 2010; Paik et al., 2002; Salamone et\nal., 2008).\n\nIn previous works we have studied the effects of surface growth for systems composed of single capillaries both \nuniform and structured in 2D (Sergi et al., 2014 and 2015). The focus of the present investigation is on making more precise\nthe pore configurations of particular relevance for the industrial application of LSI. The strategy consists in first\nrealizing porous structures approximating real porous preforms. To this end, we generate packing systems\nby using particles differing in basic attributes (size, shape and distribution). In principle, these parameters\ncan be controlled by the selection and processing of powders. The packing structures are assembled by means of\nthe random sequential addition (Sherwood, 1997; Widom, 1966). This is a simple and effective algorithm allowing to reach\nreasonable volume fractions for random packings. The simulations for capillary infiltration aim at highlighting the function\nof specific pore and structural characteristics. The systems of this work display enhanced randomness with pores\nand channels of different size and orientation inducing complex dynamics for the invading front. The significance of\nthis investigation resides in the possibility to translate the findings into inputs for preform preparation in order\nto improve the quality of ceramic materials.\n\nOur simulations indicate that the interface dynamics can be assumed to be responsible for small effective radii. Pinning\nof the contact line is the primary process affecting capillary infiltration. Our work allows to give evidence for the mechanism\ndetermining pinning in random systems.  Packings of particles based on bimodal size distributions turn out to provide features\nreducing the strong retardation of liquid invasion associated with pinning. Larger particles introduce walls creating channels\nthat are filled faster while smaller particles make the pore structure more uniform. As a result, the interface travels longer\ndistances before the loss of its curvature. Furthermore, the probability to encounter the surface of other particles is higher.\nOur data also show that the inertia effects induced by accelerations remain of secondary importance. With surface growth, it is\nfound that pore closure can be effective\nand pinning turns out to be enhanced. The retardation effects are stronger for fast infiltrations (higher degree of orientation disorder),\nthat remain nevertheless more advantageous. Also with surface growth, bimodal size distributions lead to better results.\nSimulations with higher resolution for the porous structure are also performed for a direct comparison with experimental\nexpectations. In this case, the effect of surface growth on pore closure is mainly indirect because pinning is\nstronger. Furthermore, the relative strength of capillary forces is too weak. This means that the details of\nthe infiltration process suffers from discrepancies with real conditions. For example, this implies that the ratio of the\ninfiltrated distance to the thickness of the growing surface is too small in simulations. Progress seem possible especially\nby reducing the phenomenon of pinning. In that respect, 2D simulations exhibit some limitations.\n\n\n\n\\section*{2.~~~MODELS AND ANALYSIS}\n\nFor the formalism of the LB models the interested reader is addressed to Sergi et al.~(2014). In the sequel,\nthe same notation and terminology are employed.  We recall that in experiments with molten Si and some alloys\nthe invading front exhibits a kinetics linear with time (Israel et al., 2010; Voytovych et al., 2008). The\nstandard Washburn law for capillary infiltration in vacuum predicts a parabolic time dependence. The observed\nexperimental behavior can be reproduced with the simulations by assuming that the systems are composed by two\nfluid components (Chibbaro, 2008; Chibbaro et al., 2009b; Diotallevi et al., 2009a and 2009b). This means that\nthe effect of the reaction at the contact line is equivalent to the resistance due to the presence of a second\nnon-wetting component as dense and viscous as the wetting one (Sergi et al., 2014). This approach does not\nexplain the origin of the linear behavior for the infiltration kinetics generally ascribed to effects of the\nreactivity (Israel et al., 2010; Voytovych et al., 2008).\n\nThe differential equation describing capillary infiltration for two fluids with the same density $\\rho$ and\ndynamic viscosity $\\mu$ into a single channel in 2D reads (Chibbaro et al., 2009b)\n\n", "index": 1, "text": "\\begin{equation}\n\\frac{\\mathrm{d}^{2}z(t)}{\\mathrm{d}t^{2}}+\\frac{3\\mu}{r^{2}\\rho}\\frac{\\mathrm{d}z(t)}{\\mathrm{d}t}\n=\\frac{\\gamma\\cos\\theta}{r\\rho L}\\ .\n\\label{eq:diff}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\mathrm{d}^{2}z(t)}{\\mathrm{d}t^{2}}+\\frac{3\\mu}{r^{2}\\rho}\\frac{\\mathrm%&#10;{d}z(t)}{\\mathrm{d}t}=\\frac{\\gamma\\cos\\theta}{r\\rho L}\\ .\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><msup><mi mathvariant=\"normal\">d</mi><mn>2</mn></msup><mo>⁢</mo><mi>z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msup><mi>t</mi><mn>2</mn></msup></mrow></mfrac><mo>+</mo><mrow><mfrac><mrow><mn>3</mn><mo>⁢</mo><mi>μ</mi></mrow><mrow><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mi>ρ</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow></mrow><mo>=</mo><mpadded width=\"+5pt\"><mfrac><mrow><mi>γ</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><mrow><mi>r</mi><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07697.tex", "nexttext": "\n$z_{0}$ is the initial position. For completeness, in the absence of reaction, a solution to Eq.~\\ref{eq:diff}\ntaking into account also inertial forces is obtained by (Chibbaro et al., 2009b)\n\n", "itemtype": "equation", "pos": 11586, "prevtext": "\nThe first term on the left-hand side accounts for inertial forces while the second one introduces\nviscous forces. The term on the right-hand side is due to capillary forces. \n$z$ designates the position of the invading front, $r$ is the radius of the channel and $L$ its length.\nWhen inertial forces are neglected, for a shrinking radius as $r(t)=r_{0}-kt$ ($r_{0}$ is the initial radius and $k$\nis the reaction-rate constant) a solution to the above equation is given by\n\n", "index": 3, "text": "\\begin{equation}\nz(t)=\\frac{\\gamma\\cos\\theta}{6\\mu k L}\\big[r_{0}^{2}-(r_{0}-kt)^{2}\\big]+z_{0}\\ .\n\\label{eq:reac}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"z(t)=\\frac{\\gamma\\cos\\theta}{6\\mu kL}\\big{[}r_{0}^{2}-(r_{0}-kt)^{2}\\big{]}+z_%&#10;{0}\\ .\" display=\"block\"><mrow><mrow><mrow><mi>z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mrow><mi>γ</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><mrow><mn>6</mn><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><msubsup><mi>r</mi><mn>0</mn><mn>2</mn></msubsup><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>r</mi><mn>0</mn></msub><mo>-</mo><mrow><mi>k</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo maxsize=\"120%\" minsize=\"120%\">]</mo></mrow></mrow><mo>+</mo><mpadded width=\"+5pt\"><msub><mi>z</mi><mn>0</mn></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07697.tex", "nexttext": "\nwhere $V_{\\mathrm{cap}}=\\gamma/\\mu$ and $t_{\\mathrm{d}}=\\rho r^{2}/3\\mu$.\nFor more general porous systems, the radius of the channel is replaced with the effective radius.\nRelevant studies for reactive infiltration based on dynamics can be found in Asthana et al.~(2005), Gern and\nKochend\\a{\"}orfer (1997), Martins et al.~(1988), Messner and Chiang (1990), Sangsuwan et al.~(2001),\nYang and Ilegbusi (2000).\n\nThe simulations output is in model units. For the units of the basic quantities of mass, length and\ntime we use the symbols mu, lu and ts, respectively. The data obtained from simulations can be expressed\nin regular units of the SI system after suitable transformations\n(Chibbaro et al., 2009a and 2009c; Gross et al., 2010; Joshi and Sun, 2010; Komnik et al., 2004). For\ncomparisons with experimental data we apply the approach based on dimensionless numbers like the Reynolds or capillary\nnumbers (Landau and Lifshitz, 2008). For example, these numbers compare the relative strength between the\neffects of inertial, viscous and capillary forces. Two systems are assumed to be equivalent when the dimensionless\nnumbers for the dominating forces have the same values. For our purposes, we also need dimensionless numbers\ninvolving the characteristic time set by the surface reaction (Sergi et al., 2016):\n\n", "itemtype": "equation", "pos": 11908, "prevtext": "\n$z_{0}$ is the initial position. For completeness, in the absence of reaction, a solution to Eq.~\\ref{eq:diff}\ntaking into account also inertial forces is obtained by (Chibbaro et al., 2009b)\n\n", "index": 5, "text": "\\begin{equation}\nz(t)=\\frac{V_{\\mathrm{cap}}r\\cos\\theta}{3L}t_{\\mathrm{d}}\\big[\\exp\\big(-t/t_{\\mathrm{d}}\\big)+t/t_{\\mathrm{d}}\n-1\\big]+z_{0}\\ ,\n\\label{eq:linear}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"z(t)=\\frac{V_{\\mathrm{cap}}r\\cos\\theta}{3L}t_{\\mathrm{d}}\\big{[}\\exp\\big{(}-t/%&#10;t_{\\mathrm{d}}\\big{)}+t/t_{\\mathrm{d}}-1\\big{]}+z_{0}\\ ,\" display=\"block\"><mrow><mrow><mrow><mi>z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mrow><msub><mi>V</mi><mi>cap</mi></msub><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow><mrow><mn>3</mn><mo>⁢</mo><mi>L</mi></mrow></mfrac><mo>⁢</mo><msub><mi>t</mi><mi mathvariant=\"normal\">d</mi></msub><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mrow><mo>-</mo><mrow><mi>t</mi><mo>/</mo><msub><mi>t</mi><mi mathvariant=\"normal\">d</mi></msub></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>t</mi><mo>/</mo><msub><mi>t</mi><mi mathvariant=\"normal\">d</mi></msub></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo maxsize=\"120%\" minsize=\"120%\">]</mo></mrow></mrow><mo>+</mo><mpadded width=\"+5pt\"><msub><mi>z</mi><mn>0</mn></msub></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07697.tex", "nexttext": "\n$v$ indicates a characteristic velocity for the system.\n$Q_{1}$ compares the reaction with surface tension, $Q_{2}$ the reaction with viscosity, $Q_{3}$ the reaction\nwith inertia. For completeness, $Q_{4}=\\rho rv^{2}/\\gamma$ compares inertia with capillary forces.\nIn our terminology, the first force becomes more important as the dimensionless number increases.\nIn our notation, the Reynolds and capillary numbers are given by $Re=\\rho vr/\\mu$ and $Ca=v\\mu/\\gamma$.\nIn the onset of pore closure, $Q_{1}$ tends toward zero faster and thus surface tension is the\ndominant force. Instead, inertia has the weakest effects since $Q_{3}$ diverges while $Q_{1}$ and $Q_{2}$\ntend to $0$. By using for the time-varying effective radius the average value $r_{0}/2$, we arrive at \nthe same conclusions.\n\nAnother quantity that we take into account is the tortuosity (Bear, 1972). It is defined as the ratio\nof the actual length of the capillary paths to the corresponding length of the sample. For the computations\nwe use the formula $<u>/<u_{x}>$ (Duda et al., 2011; Matyka and Koza, 2012), where $u$ is the magnitude\nof the fluid velocity of components $u_{x}$ and $u_{y}$. It is worth recalling that at the interface\nthere are spurious currents (Wagner, 2003).\n\n\n\n\\begin{table}[t]\n\\begin{ruledtabular}\n\\begin{tabular}{lccccc}\nType  & Diameter & Volume ($10^{-3}$) & Filling\\\\\n\\hline\nbimodal1  & $0.2/0.16$ & $4.2/2.1$ & $0.46$\\\\\nbimodal2  & $0.2/0.12$ & $4.2/0.9$ & $0.46$\\\\\nbimodal3  & $0.2/0.08$ & $4.2/0.3$ & $0.46$\\\\\nmultimodal& $0.2/0.16/0.12/0.08$ & $4.2/2.1/0.9/0.3$ & $0.46$\\\\\ngranular1 & $0.2$      & $4.2$ & $0.46$\\\\\ngranular2 & $0.16$     & $2.1$ & $0.46$\\\\\nfine1     & $0.12$     & $0.9$ & $0.46$\\\\\nfine2     & $0.08$     & $0.3$ & $0.44$\\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\caption{\\label{tab:sphere}\nRelevant data for the packing structures composed of spheres. Multiple values for their\naverage size are given in the case of bimodal and multimodal mixtures. Figure\n\\ref{fig:section} visualizes some examples in 2D.}\n\\end{table}\n\n\n\\begin{table}[t]\n\\begin{ruledtabular}\n\\begin{tabular}{lccccc}\nType  & Side & Volume ($10^{-3}$) & Filling\\\\\n\\hline\nbimodal1  & $0.2/0.16$ & $9/3.9$ & $0.44/0.45/0.38$\\\\\nbimodal2  & $0.2/0.13$ & $9/1.9$ & $0.45/0.46/0.40$\\\\\nbimodal3  & $0.2/0.08$ & $9/0.6$ & $0.44/0.46/0.45$\\\\\nmultimodal& $0.2/0.16/0.13/0.08$ & $9/3.9/1.9/0.6$ & $0.47/0.44/0.45$\\\\\ngranular1 & $0.2$      & $9$   & $0.44/0.43/0.34$\\\\\ngranular2 & $0.16$     & $3.9$ & $0.43/0.44/0.33$\\\\\nfine1     & $0.13$     & $1.9$ & $0.41/0.42/0.33$\\\\\nfine2     & $0.08$     & $0.6$ & $0.39/0.38/0.34$\\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\caption{\\label{tab:rhomb}\nBasic information for the porous systems obtained from the packing of rhombs. The height of\nthe rhombs is comparable to the length of their four equal sides, i.e.~$h=0.2,0.16,0.12,0.08$. Bimodal\nand multimodal mixtures are characterized by multiple data for the size of the particles. The values\nfor the filling fraction correspond to different orientations of the particles: aligned, misaligned,\nmisaligned and tilted, respectively. Examples for the porous structures in 2D are shown in\nFig.~\\ref{fig:section}.}\n\\end{table}\n\n\n\\begin{table}[b]\n\\begin{ruledtabular}\n\\begin{tabular}{lccccc}\nType   & Side & Volume ($10^{-3}$) & Filling\\\\\n\\hline\nfiber1 & $0.28/0.2$  & $1/9$     & $0.39/0.40/0.41$\\\\\nfiber2 & $0.28/0.16$ & $1/3.9$   & $0.40/0.41/0.39$\\\\\nfiber3 & $0.28/0.13$ & $1/1.9$   & $0.41/0.40/0.37$\\\\\nfiber4 & $0.24/0.2$  & $0.9/9$   & $0.39/0.40/0.41$\\\\\nfiber5 & $0.24/0.16$ & $0.9/3.9$ & $0.40/0.41/0.39$\\\\\nfiber6 & $0.24/0.13$ & $0.9/1.9$ & $0.41/0.42/0.37$\\\\\nfiber7 & $0.2/0.2$   & $0.7/9$   & $0.40/0.40/0.41$\\\\\nfiber8 & $0.2/0.16$  & $0.7/3.9$ & $0.40/0.41/0.40$\\\\\nfiber9 & $0.2/0.13$  & $0.7/1.9$ & $0.41/0.41/0.37$\\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\caption{\\label{tab:fiber}\nData for the packing structures obtained with fibers and rhombs. For the side and the\nvolume, the first value refers to the sticks and the second to the rhombs. For fibers,\nthe side of the square base is $0.06$ long. The height of the rhombs is $h=0.2,0.16,0.12,0.08$,\nthat is, similar to the length of the four equal sides. The reported filling fractions are\nassociated with different orientations of the particles: aligned, misaligned, misaligned and\ntilted, respectively. Figure \\ref{fig:section} shows examples of porous configurations in 2D.}\n\\end{table}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=4cm]{fig1a.pdf}\\hspace{0.4cm}\n\\includegraphics[width=4cm]{fig1b.pdf}\\\\\n\\includegraphics[width=4cm]{fig1c.pdf}\\hspace{0.4cm}\n\\includegraphics[width=4cm]{fig1d.pdf}\\\\\n\\includegraphics[width=4cm]{fig1e.pdf}\\hspace{0.4cm}\n\\includegraphics[width=4cm]{fig1f.pdf}\\\\\n\\includegraphics[width=8.4cm]{fig1g.pdf}\n\\caption{\\label{fig:section}\n\n\n\n2D sections for packing structures; in dark the filler particles. Information on the whole structures\ncan be found in Tabs.~\\ref{tab:sphere}-\\ref{tab:fiber}. (a) System bimodal1 for spheres; \n(b) system fine1 for spheres; (c) system multimodal for blocks; (d) system bimodal3 with\nmisalignment for blocks; (e) system fiber1 for misalignment; (f) system fiber6\nfor misalignment and tilt. (g) Microstructure of a typical preform.}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig2a.pdf}\\\\\n\\includegraphics[width=8.4cm]{fig2b.pdf}\\\\\n\\includegraphics[width=8.4cm]{fig2c.pdf}\\\\\n\\includegraphics[width=8.4cm]{fig2d.pdf}\n\\caption{\\label{fig:front}\n\nFluid invasion for selected packing structures after $10^{6}$ ts. Red is used for the wetting fluid and blue for the non-wetting component.\nThe initial solid phase is represented in dark and the growing surface from the reaction in yellow. More details on the properties of the packing\nsystems can be found in Tabs.~\\ref{tab:sphere}-\\ref{tab:fiber}. More details on the results of infiltrations are reported in\nTabs.~\\ref{tab:sphere_result}-\\ref{tab:reaction_result}. (a) Simulation for the system bimodal1 with spherical particles. The formation of a\nfinger can be recognized. (b) Infiltration for the system bimodal2 with rhombs in the presence of misalignment. The front will further advance because\nit can hit the corner of another particle before loosing its curvature. (c) Visualization of the system with fibers of type fiber2 with misalignment and\ntilt. Tilted fibers result in the presence of small grains in 2D sections favoring infiltration as for bimodal size distributions. (d) Simulation for the\nsystem bimodal2 for rhombs with misalignment and surface reaction enabled (cf.~panel b). Infiltration stops because of pore closure.}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig3a.pdf}\\\\\n\\includegraphics[width=8.4cm]{fig3b.pdf}\n\\caption{\\label{fig:filling1}\n\nInfiltrated distance with chemical inertness for the solid surface. \nPoints represent simulation results. The solid lines are fits to the\ndata using Eq.~\\ref{eq:linear}. (a) Packing structures obtained from spheres;\n(b) packing structures realized with aligned rhombs. Basic properties of the\npacking systems are listed in Tabs.~\\ref{tab:sphere} and \\ref{tab:rhomb}.}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig4.pdf}\n\\caption{\\label{fig:q4}\nRelationship between the fluctuations of characteristic numbers $Q_{4}$ and $Ca$ for packing systems with\nspheres and rhombs in the absence of surface reaction. Yellow markers are used for spheres, blue for aligned\nrhombs, red for rhombs with misalignment and green for rhombs with misalignment and tilt\n(see Tabs.~\\ref{tab:sphere} and \\ref{tab:rhomb}).}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig5.pdf}\n\\caption{\\label{fig:lambda2}\nRelationship between the capillary number and the tortuosity as obtained from the process of capillary\ninfiltration in the absence of reactivity. The packing structures are composed of spheres for yellow\nmarkers and of aligned rhombs for blue markers. The properties of the packing systems are summarized\nin Tabs.~\\ref{tab:sphere} and \\ref{tab:rhomb}.}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig6.pdf}\n\\caption{\\label{fig:zmax}\nAverage maximum of the invading front as time goes on for infiltrations with surface reaction. The porous\nstructures are obtained from the packing of rhombs with aligned particles (see Tab.~\\ref{tab:rhomb}).\nPoints represent simulation results. The solid lines are fits to the data by means of Eq.~\\ref{eq:reac}.}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=8.4cm]{fig7.pdf}\n\\caption{\\label{fig:zexp}\nLB simulations for experimental results with surface growth. Average maximum for the infiltrated length\nas a function of time. Points are used for results from simulations. The solid line is a fit to the data\nwith Eq.~\\ref{eq:reac}.}\n\\end{figure}\n\n\n\n\\begin{sidewaystable*}[b]\\vspace{7.5cm}\n\\begin{tabular}{lccccccccc}\n\\hline\\hline\nType  & $z\\pm\\Delta z$ [lu] & $v_{\\mathrm{inf},1}$ $(10^{-4})$ [lu/ts] & $v_{\\mathrm{inf},2}$ $(10^{-4})$ [lu/ts] & $r_{\\mathrm{eff}}$ [lu] & $\\lambda_{1}$ & $\\lambda_{2}$ $(10^{3})$ & $Ca$ $(10^{-4})$ & $Q_{4}$ $(10^{-8})$ & $Re$ $(10^{-4})$\\\\\n\\hline\nbimodal1  & $915\\pm 53$  & $0.71$ & $0.83$ & $0.44$ & $1.17$ & $2.07$ & $1.40$ & $2.59$ & $1.85$\\\\\nbimodal2  & $851\\pm 60$  & $0.65$ & $0.51$ & $0.27$ & $1.26$ & $0.56$ & $1.28$ & $1.35$ & $1.05$\\\\\nbimodal3  & $842\\pm 142$ & $0.65$ & $0.45$ & $0.24$ & $1.22$ & $0.34$ & $1.29$ & $1.19$ & $0.92$\\\\\nmultimodal& $852\\pm 70$  & $0.79$ & $0.52$ & $0.27$ & $1.24$ & $0.26$ & $1.58$ & $2.06$ & $1.30$\\\\\ngranular1 & $814\\pm 52$  & $1.09$ & $0.33$ & $0.17$ & $1.34$ & $0.11$ & $2.16$ & $2.46$ & $1.14$\\\\\ngranular2 & $838\\pm 107$ & $0.75$ & $0.41$ & $0.21$ & $1.17$ & $0.19$ & $1.49$ & $1.44$ & $0.97$\\\\\nfine1     & $790\\pm 73$  & $0.41$ & $0.18$ & $0.09$ & $1.30$ & $0.90$ & $0.82$ & $0.19$ & $0.23$\\\\\nfine2     & $827\\pm 100$ & $0.74$ & $0.34$ & $0.18$ & $1.18$ & $0.27$ & $1.46$ & $1.17$ & $0.80$\\\\\n\\hline\\hline\n\\end{tabular}\n\\caption{\\label{tab:sphere_result}\nSpheres composing the packing structures infiltrated without surface growth (see Tab.~\\ref{tab:sphere}).}\\vspace{0.5cm}\n\n\\begin{tabular}{lccccccccccc}\n\\hline\\hline\nType      & \\multicolumn{3}{c}{$z\\pm\\Delta z$ [lu]} & $v_{\\mathrm{inf},1}$ $(10^{-4})$ [lu/ts] & $v_{\\mathrm{inf},2}$ $(10^{-4})$ [lu/ts] & $r_{\\mathrm{eff}}$ [lu] & $\\lambda_{1}$ & $\\lambda_{2}$ $(10^{3})$ & $Ca$ $(10^{-4})$ & $Q_{4}$ $(10^{-8})$ & $Re$ $(10^{-4})$\\\\\n\\hline\nbimodal1  & $878\\pm 65 $ & $784\\pm 99 $ & $876\\pm  117$ & $0.73/0.72/1.04$ & $0.70/0.26/0.74$ & $0.37/0.14/0.39$ & $1.15/1.18/1.20$ & $0.19/0.15/0.14$ & $1.45/1.41/2.06$ & $2.34/0.84/5.04$ & $1.62/0.60/2.45$\\\\\nbimodal2  & $815\\pm 76 $ & $901\\pm 154$ & $849\\pm  31$  & $1.29/1.27/0.64$ & $0.31/0.82/0.55$ & $0.16/0.43/0.29$ & $1.31/1.29/1.34$ & $0.09/0.09/0.22$ & $2.56/2.52/1.27$ & $3.26/8.28/1.40$ & $1.27/3.28/1.11$\\\\\nbimodal3  & $805\\pm 74 $ & $835\\pm 97 $ & $931\\pm  151$ & $0.73/0.79/1.08$ & $0.26/0.44/0.95$ & $0.14/0.23/0.50$ & $1.24/1.20/1.21$ & $0.27/0.15/0.20$ & $1.45/1.56/2.14$ & $0.87/1.70/6.96$ & $0.60/1.09/3.26$\\\\\nmultimodal& $789\\pm 75 $ & $920\\pm 72 $ & $840\\pm  57$  & $0.76/0.99/0.44$ & $0.22/0.90/0.60$ & $0.12/0.47/0.31$ & $1.22/1.18/1.32$ & $0.13/0.18/2.93$ & $1.51/1.96/0.88$ & $0.80/5.48/0.74$ & $0.53/2.80/0.84$\\\\\ngranular1 & $813\\pm 93 $ & $815\\pm 105$ & $811\\pm  80$  & $0.70/0.64/0.57$ & $0.17/0.37/0.29$ & $0.09/0.19/0.15$ & $1.26/1.10/1.28$ & $0.17/0.19/0.26$ & $1.38/1.28/1.13$ & $0.51/0.96/0.58$ & $0.37/0.75/0.52$\\\\\ngranular2 & $759\\pm 91 $ & $835\\pm 155$ & $1014\\pm 213$ & $0.68/0.48/1.24$ & $0.13/0.39/1.19$ & $0.07/0.21/0.63$ & $1.21/1.22/1.22$ & $0.19/0.35/0.20$ & $1.34/0.95/2.45$ & $0.37/0.56/1.14$ & $0.27/0.59/4.66$\\\\\nfine1     & $799\\pm 100$ & $801\\pm 56 $ & $873\\pm  62$  & $0.56/0.79/0.65$ & $0.27/0.26/0.57$ & $0.14/0.14/0.30$ & $1.22/1.23/1.19$ & $0.32/0.17/0.43$ & $1.10/1.56/1.29$ & $0.53/1.03/1.51$ & $0.48/0.66/1.17$\\\\\nfine2     & $799\\pm 59 $ & $781\\pm 99 $ & $818\\pm  134$ & $0.84/0.29/0.43$ & $0.28/0.18/0.25$ & $0.15/0.10/0.13$ & $1.21/1.21/1.20$ & $0.13/0.68/3.71$ & $1.65/0.58/0.85$ & $1.25/0.10/0.29$ & $0.76/0.17/0.35$\\\\\n\\hline\\hline\n\\end{tabular}\n\\caption{\\label{tab:rhomb_result}\nRhombs composing the packing systems infiltrated with inert boundaries (see Tab.~\\ref{tab:rhomb}).\nFor every quantity, multiple values corresponding to different orientations of fillers: aligned, misaligned, misaligned\nand tilted (see Fig.~\\ref{fig:section}).}\\vspace{0.5cm}\n\n\\begin{tabular}{lccccccccccc}\n\\hline\\hline\nType  & \\multicolumn{3}{c}{$z\\pm\\Delta z$ [lu]} & $v_{\\mathrm{inf},1}$ $(10^{-4})$ [lu/ts] & $v_{\\mathrm{inf},2}$ $(10^{-4})$ [lu/ts] & $r_{\\mathrm{eff}}$ [lu] & $\\lambda_{1}$ & $\\lambda_{2}$ $(10^{3})$ & $Ca$ $(10^{-4})$ & $Q_{4}$ $(10^{-8})$ & $Re$ $(10^{-4})$\\\\\n\\hline\nfiber1 & $920\\pm 224$ & $828\\pm 180$ & $1013\\pm 124$ & $0.75/1.13/1.64$ & $0.81/0.42/1.38$ & $0.43/0.22/0.73$ & $1.18/1.38/1.15$ & $0.52/0.08/0.07$ & $1.48/2.21/3.27$ & $2.83/3.32/23.5$ & $1.91/1.51/7.19$\\\\\nfiber2 & $909\\pm 79$  & $817\\pm 101$ & $973\\pm  138$ & $1.27/0.75/1.09$ & $0.78/0.39/1.01$ & $0.41/0.21/0.54$ & $1.19/1.23/1.18$ & $0.10/0.16/0.16$ & $2.53/1.49/2.16$ & $7.96/1.40/7.55$ & $3.15/0.94/3.50$\\\\\nfiber3 & $945\\pm 326$ & $791\\pm 125$ & $851\\pm  64$  & $1.01/0.53/0.61$ & $0.92/0.24/0.60$ & $0.49/0.13/0.31$ & $1.10/1.28/1.21$ & $0.15/0.25/7.13$ & $1.99/1.04/1.21$ & $5.84/0.42/1.39$ & $2.93/0.40/1.15$\\\\\nfiber4 & $910\\pm 278$ & $783\\pm 59$  & $846\\pm  48$  & $0.58/0.22/0.60$ & $0.86/0.12/0.32$ & $0.46/0.06/0.17$ & $1.18/1.09/1.12$ & $1.10/0.50/0.97$ & $1.14/0.43/1.18$ & $1.79/0.04/0.72$ & $1.57/0.08/0.61$\\\\\nfiber5 & $851\\pm 204$ & $801\\pm 91$  & $780\\pm  98$  & $0.45/0.41/0.52$ & $0.48/0.32/0.18$ & $0.25/0.17/0.10$ & $1.15/1.19/1.22$ & $0.38/0.57/0.27$ & $0.89/0.79/1.03$ & $0.61/0.33/0.31$ & $0.69/0.41/0.30$\\\\\nfiber6 & $966\\pm 205$ & $765\\pm 77$  & $823\\pm  57$  & $1.41/0.17/0.53$ & $1.12/0.09/0.29$ & $0.59/0.05/0.15$ & $1.07/1.33/1.21$ & $0.15/4.29/2.12$ & $2.80/0.33/1.05$ & $14.1/0.02/0.50$ & $5.02/0.05/0.48$\\\\\nfiber7 & $834\\pm 75$  & $817\\pm 78$  & $796\\pm  88$  & $0.72/0.47/0.73$ & $0.37/0.37/0.23$ & $0.20/0.20/0.12$ & $1.23/1.23/1.19$ & $0.18/0.33/0.19$ & $1.43/0.91/1.45$ & $1.21/0.50/0.77$ & $0.85/0.55/0.53$\\\\\nfiber8 & $778\\pm 81$  & $943\\pm 188$ & $850\\pm  53$  & $0.92/1.81/1.25$ & $0.17/0.87/0.61$ & $0.09/0.46/0.32$ & $1.13/1.09/1.17$ & $0.12/0.07/0.08$ & $1.82/3.58/2.44$ & $0.92/17.8/5.86$ & $0.51/4.96/2.40$\\\\\nfiber9 & $810\\pm 133$ & $978\\pm 160$ & $783\\pm  150$ & $0.83/1.33/0.26$ & $0.33/1.04/0.15$ & $0.17/0.55/0.08$ & $1.20/1.20/1.19$ & $0.15/0.09/3.10$ & $1.66/2.65/0.52$ & $1.44/11.6/0.06$ & $0.87/4.37/0.12$\\\\\n\\hline\\hline\n\\end{tabular}\n\\caption{\\label{tab:fiber_result}\nFibers added to the packing systems infiltrated without reactive boundaries (see Tab.~\\ref{tab:fiber}).\nFor every quantity, multiple values refer to different orientations of fillers: aligned, misaligned, misaligned and tilted (see Fig.~\\ref{fig:section}).}\n\n\\end{sidewaystable*}\n\n\\begin{sidewaystable*}[b]\\vspace{7.5cm}\n\\begin{tabular}{lccccccccccc}\n\\hline\\hline\nType      & $z_{\\mathrm{max}}$ [lu] & $v_{\\mathrm{inf},1}$ $(10^{-4})$ [lu/ts] & $r_{\\mathrm{eff}}$ [lu] & $Q_{1}$ $(10^{-8})$ & $Q_{2}$ $(10^{-5})$ & $Q_{3}$ $(10^{-2})$ & $Ca$ $(10^{-4})$ & $Q_{4}$ $(10^{-8})$ & $Re$ $(10^{-4})$\\\\\n\\hline                    \nbimodal1  & $810/781/793$ & $0.73/0.91/1.33$ & $0.83/0.54/0.77$ & $0.36/0.29/0.61$ & $2.48/1.61/2.32$ & $6.82/5.47/3.77$ & $1.45/1.78/2.61$ & $5.28/5.22/16.1$ & $3.63/2.94/6.16$\\\\\nbimodal2  & $812/839/804$ & $1.57/1.08/0.54$ & $0.98/1.38/0.91$ & $0.91/0.88/0.29$ & $2.94/4.14/2.73$ & $3.19/4.65/9.24$ & $3.10/2.11/1.05$ & $28.7/18.8/3.10$ & $9.23/8.91/2.96$\\\\\nbimodal3  & $815/810/846$ & $1.46/1.13/1.15$ & $1.03/1.00/1.49$ & $0.89/0.67/1.02$ & $3.08/3.01/4.47$ & $3.44/4.43/4.33$ & $2.89/2.23/2.28$ & $25.9/15.2/23.5$ & $8.96/6.79/10.3$\\\\\nmultimodal& $778/848/780$ & $0.99/1.88/0.70$ & $0.63/1.18/0.69$ & $0.37/1.32/0.29$ & $1.89/3.53/2.06$ & $5.05/2.65/7.18$ & $1.94/3.75/1.38$ & $7.27/49.9/3.97$ & $3.75/13.3/2.87$\\\\\ngranular1 & $822/827/826$ & $1.32/1.15/1.37$ & $1.00/0.82/1.12$ & $0.78/0.56/0.91$ & $3.00/2.45/3.35$ & $3.78/4.34/3.64$ & $2.61/2.30/2.72$ & $20.6/13.0/25.1$ & $7.92/5.65/9.21$\\\\\ngranular2 & $763/783/855$ & $0.88/0.61/1.04$ & $0.47/0.61/1.52$ & $0.25/0.22/0.94$ & $1.42/1.83/4.56$ & $5.67/8.21/4.82$ & $1.74/1.20/2.06$ & $4.36/2.69/19.5$ & $2.51/2.23/9.47$\\\\\nfine1     & $788/789/863$ & $0.99/1.16/1.27$ & $0.71/0.82/1.25$ & $0.41/0.57/0.93$ & $2.12/2.47/3.74$ & $5.07/4.31/3.94$ & $1.93/2.29/2.49$ & $8.06/13.1/23.6$ & $4.18/5.73/9.48$\\\\\nfine2     & $774/781/833$ & $0.89/0.66/1.05$ & $0.64/0.64/1.19$ & $0.32/0.25/0.74$ & $1.91/1.92/3.57$ & $5.63/7.61/4.78$ & $1.70/1.30/2.07$ & $5.76/3.27/15.5$ & $3.39/2.52/7.47$\\\\\n\\hline\\hline\n\\end{tabular}\n\\caption{\\label{tab:reaction_result}\nSurface reaction enabled for the infiltration of packing systems obtained from rhombs (see Tabs.~\\ref{tab:rhomb} and \\ref{tab:rhomb_result}). For every quantity, multiple\nvalues are associated with different orientations of the fillers: aligned, misaligned, misaligned and tilted (see Fig.~\\ref{fig:section}).}\n\\vspace{0.5cm}\n\\end{sidewaystable*}\n\n\\begin{table*}[t]\n\\begin{ruledtabular}\n\\begin{tabular}{lcccccc}\n                 & $Q_{1}$             & $Q_{2}$             & $Q_{3}$            & $Ca$               & $Q_{4}$             & $Re$ \\\\\n\\hline\nLB systems       & $2.55\\cdot10^{-9}$  & $1.45\\cdot 10^{-5}$ & $2.81\\cdot 10^{-2}$ & $1.76\\cdot 10^{-4}$ & $9.06\\cdot 10^{-8}$ & $5.16\\cdot 10^{-4}$ \\\\\nreal systems     & $1.48\\cdot10^{-16}$ & $2.71\\cdot 10^{-8}$ & $0.80\\cdot 10^{-2}$ & $5.47\\cdot 10^{-9}$ & $1.85\\cdot 10^{-14}$ & $3.39\\cdot 10^{-6}$\n\\end{tabular}\n\\end{ruledtabular}\n\\caption{\\label{tab:exp_result}\nCharacteristic dimensionless numbers for infiltrations in the presence of surface growth. The results for LB simulations are obtained from the\nsystems with higher resolution leading to Fig.~\\ref{fig:zexp}. In the case of real systems, typical experimental parameters are used\n(see Sec.~5.2).}\n\\end{table*}\n\n\n\\section*{3.~~~PACKING SYSTEMS}\n\nIt is standard practice to reproduce the microstructure of composite materials with random packings\n(Scocchi et al., 2013; Torquato, 2002). The problem consists in filling the empty space with particles arranged in\na disordered way. The realization of high volume fractions can also be quite challenging (Donev et al., 2004).\nThe principle of the algorithm for the random sequential addition is to place one particle after the other\nin the simulation domain (Sherwood, 1997; Widom, 1966). In case of overlapping between a test particle and an\nexisting one, the trial is not accepted and a new particle is considered. This procedure is iterated up to the\ndesired filling fraction. With this algorithm it is not easy to exceed values beyond $0.6$.\n\nIn order to generate the packing systems for the LB simulations we employ the algorithm proposed in the\narticle by Sergi et al.~(2011). The method consists in decomposing the particles into small cubes.\nThe lengths are measured in units of the small cubes composing the particles according to the rule\n$\\ell=(n+1)r$. $n$ is the number of cubes and $2r$ their side length. Here, we consider spheres, rhombs and sticks\nwith a certain degree of randomness for their size. For a given value of $n$, the associated lengths are\nchosen with a Gauss distribution of average $\\ell$ and standard deviation $\\sigma=\\ell/4$. When the rotation\nof the particles is allowed, the rotation angles around the three axes are at most  \n$\\theta_{x}=\\theta_{y}=\\pi/2$ and $\\theta_{z}=\\pi/4$.\nThe domain is a cube of side $1$ divided into $N=256$ bins. The porous medium for the LB simulations is\nobtained by suitably replicating the packing systems. The minimal distance between two small cubes is\n$d_{\\mathrm{min}}=2/N$. An external pressure is applied toward the center of the domain in order to obtain\nmore compact structures when necessary, as it is the case for higher degrees of disorder, for example.\nThe other parameters for the pressure are the same as in Sergi et al.~(2011).\n\nThe packing systems aim at reproducing basic characteristics resulting from the use of common commercial\npowders for preform preparation. In order to make the distinction between round-shaped and sharp-edged\nmorphologies for the particles, we consider spheres and rhombs. For example, the latter geometry can approximate\nthe elongated shape of SiC particles. Fibers are also used as an attempt to understand the role of long walls.\nConcerning the size, the distribution is bimodal, multimodal or monomodal (coarse and fine particles).\nThe properties of the packing systems are summarized in Tabs.~\\ref{tab:sphere}-\\ref{tab:fiber}. Figure\n\\ref{fig:section} shows the section for some systems. \n\n\n\n\\section*{4.~~~SETTINGS FOR LB SIMULATIONS}\\label{sec:sim}\n\nThe domain for simulations is $N_{x}=1500$ lu long and $N_{y}=255$ lu wide. The porous structure has a length of $L=N_{x}/2$ and\nthe solid-liquid interface starts at $x=2N_{x}/5$. The total number of timesteps is given by $N_{t}=2\\cdot10^{6}$ ts. In the region\noccupied by the porous structure the boundaries of the simulation domain are solid; elsewhere they are periodic. This is done\nin order to reduce the phenomenon of pinning near narrow-to-wide parts (Blow et al., 2009; Chibbaro et al., 2009a and 2009c;\nKusumaatmaja et al., 2008; Mognetti and Yeomans, 2009; Wiklund and Uesaka, 2012 and 2013). \nThe reason is that pinning can result in a significant slowdown of infiltration or even stop the flow.\nAs explained before, the problem is studied with a two-component system (Chibbaro, 2008; Chibbaro et al., 2009b).\nThe viscosity is kept fixed with a relaxation\ntime of $\\tau=1$ ts for both components. In the initial condition, half of the simulation domain is filled with \nthe wetting fluid and the remaining with the non-wetting one. At start, the density for the main component is $\\rho=1.95$\nmu/lu$^{2}$ and that for the dissolved component $\\rho=0.05$ mu/lu$^{2}$. The parameter for fluid-fluid interactions\n(cohesive forces) is set to $G_{\\mathrm{c}}=0.9$ lu/mu/ts$^{2}$ (Martys and Chen, 1996), resulting in a surface tension of\n$\\gamma=0.16403$ lu$\\cdot$mu/ts$^{2}$ (Sergi et al., 2014). Solid-fluid interactions (adhesive forces) are determined by\nthe parameters $G_{\\mathrm{ads},1}=-G_{\\mathrm{ads},2}=-0.35$ lu/ts$^{2}$ (Martys and Chen, 1996). With this choice the equilibrium\ncontact angle turns out to be $\\theta=30^{\\circ}$ (Sergi et al., 2014). This value is typical for Si droplets on SiC\n(Bougiouri et al., 2006; Voytovych et al., 2008). \n\nThe process of surface growth from the reaction is introduced by relying on a purely heuristic treatment. A description based\non solute transport as in Sergi et al.~(2014 and 2015) exhibits limitations related to the interface for solute transport. Namely,\ninside the porous structures the interface can form, leading to the diffusion of solute in the whole system. Therefore, in this\nwork the reaction is implemented by making grow the surface of the solid phase behind the contact line at regular intervals\nof time. Precisely, the first layer around the solid boundaries is converted to solid phase after every $N_{t}/10$\ntimesteps. The reaction-rate constant is thus given by $k=5\\cdot10^{-6}$ lu/ts. This framework has the advantage to be suitable\nfor a critical volume of simulations allowing to observe effects of pore structure and surface growth on fluid flow. Unless\nstated otherwise, these settings are maintained in the sequel.\n\n\n\n\\section*{5.~~~RESULTS AND DISCUSSION}\n\n\\subsection*{5.1~~~Packing systems}\n\nIn Tab.~\\ref{tab:sphere_result} we report the results of simulations for systems obtained from the packing of spheres\nin the absence of surface reaction. Here $z$ indicates the penetration attained on average at the end of the process.\n$\\Delta z$ is an estimate of the deviations from the average. This quantity is determined from the maximum and the minimum\nof the front displacement. It is to be noted that the error $\\Delta z$ is comparable to the infiltrated distance. This means\nthat the fluid advances into the porous medium through selected pathways (see Fig.~\\ref{fig:front}). It can be expected that these fingers\nthen contribute to fill the pores left behind. It is worth noticing that the average error is $82$ lu while the size of\nthe largest particles is on average of $51$ lu. In Fig.~\\ref{fig:filling1} is shown the kinetics of invasion. \nIt turns out that the infiltration is slower for a monomodal distribution of the particle size. By fitting the data with\nEq.~\\ref{eq:linear}, we derive the infiltration velocity $v_{\\mathrm{inf},2}$ and the effective radius $r_{\\mathrm{eff}}$ (see\nTab.~\\ref{tab:sphere_result}). It can be seen that the effective radius is one to two orders of magnitude smaller than\nthe average particle size, as stressed in previous works (Einset, 1996; Patro et al., 2007). In order to assess the role\nof interface dynamics, the tortuosity is computed in two different ways. $\\lambda_{1}$ is determined under the conditions\nusually employed to reproduce Poiseuille flow, i.e.~with a single fluid, periodic boundaries and an external acceleration\n(Sukop and Thorne, 2010). $\\lambda_{2}$ is instead obtained from the process of infiltration driven by capillary forces.\nThe results of Tab.~\\ref{tab:sphere_result} show that $\\lambda_{2}$ is two orders of magnitude higher. As a consequence,\nthe interface dynamics induced by the pore structure plays a prominent role. $v_{\\mathrm{inf},1}$ is obtained by an average\nover the velocities inside the porous media in the direction of infiltration, i.e.~$x$. The difference with $v_{\\mathrm{inf},2}$\nis more marked when the process is slower. For a proper basis of comparison with systems including the reaction, the\ncharacteristic dimensionless numbers are calculated by means of $v_{\\mathrm{inf},1}$ (see Tab.~\\ref{tab:sphere_result}). \n\nThe results of simulations without reactivity for packings of particles with the shape of rhombs are reported in\nTab.~\\ref{tab:rhomb_result}. Figure \\ref{fig:filling1} shows the kinetics in the case of aligned rhombs. Comparison with\nthe outcome for packings of spheres indicates that the structure arising from rhombs is more subject to pinning. It turns\nout that, as the degree of disorder increases, the infiltration becomes faster. The fastest infiltrations are obtained with\ntilt and misalignment, even though the tortuosity $\\lambda_{2}$ attains a larger value on average. The dynamics with spheres\nremain still faster or at least comparable. A possible explanation for this observation is that the arrangement of rhombs can\ngive rise to channels that are filled easily. The shortcoming is that the phenomenon of pinning becomes more frequent. In 3D\nin a real preform, we expect that the advantages should prevail since\nthe connectivity of the pore chambers is higher. Figure \\ref{fig:q4} shows the range of variation of $Ca$. The same behavior\nholds for $Re$: the same relation between $Re$ and $Ca$ is of course an identity. More marked variations are observed for $Q_{4}$.\nThe increase can amount to one order of magnitude. It is interesting to note that the deviations from the average values\nare stronger for rhombs since the filling of distinct channels and depinning introduce more accelerations. From the order of magnitude\nof the average values of $Ca$, $Q_{4}$ and $Re$, we conclude that the effects of inertia are weak and capillary forces remain\nthe dominant ones. Furthermore, in Fig.~\\ref{fig:lambda2} it can be seen that for a given capillary number, the tortuosity seems to be\nslightly lower for aligned rhombs in a comparison with spheres. This tendency is recognized also in the presence of orientation\ndisorder and for fluctuations of $Ca$. For clarity, this suggests that, when the fluid accelerates, the tortuosity is not higher and\nthus the resistance of inertia has a weak effect. So, in this case the averages of dimensionless numbers still provide\nan exhaustive description. As expected, it follows that the interface dynamics induced by the pore structure seems to\nplay a more important role for the pronounced difference between $\\lambda_{1}$ and $\\lambda_{2}$.\nSpurious currents at the interface should average out since we could verify that, when the fits allowing\nto obtain $v_{\\mathrm{inf},2}$ are more precise, the discrepancies with $v_{\\mathrm{inf,1}}$ are smaller. Again, for aligned rhombs,\nit arises that liquid penetration tends to be better with a bimodal distribution. This trend is less clear with misalignment\nand tilt. It should be said that, in this case, 2D sections loose to a large extent the specific characteristics of the particles\ncomposing the packings. For this reason, it might be presumed that, in 3D, bimodal distributions should remain more advantageous.\nExamination of the data associated with the maxima and minima for infiltration reveals that pinning is the discriminating factor\ncoming into play. The basic mechanism at the origin of pinning is that the meniscus advances slowly while loosing its curvature,\nresulting in a drop of capillary pressure. In the presence of channel walls, the front can travel a longer distance since the\npinning sites are not vertically aligned. As a consequence, the meniscus can encounter the surface of new particles with higher\nprobability before halting (see Fig.~\\ref{fig:front}). In the packings with small particles the pinning sites are instead generally separated by small\ndistances. The probability that the invading front stops moving is thus higher. It is also interesting to note that rhombs\nwith bimodal distributions pack more efficiently. On average the filling fraction of their 2D sections is $14\\%$ higher than\nin the case of monomodal distributions. However, their infiltrations remain faster on average of $3\\%$. It can be seen that\nthe results are more sensitive to specific porous configurations than to the porosity. For more clarity, test simulations are\nperformed for different porosities for the three bimodal systems  composed of rhombs with particles aligned and misaligned.\nFor filling fractions of $36\\%-50\\%$ the penetration depth varies within a narrow range on average. This is partly in line with our discussion\nfor the conditions helping the advancement of fluid. The porosity seems to start becoming detrimental for a filling fraction\napproaching $60\\%$.\n\nPacking structures with sticks are also considered in order to make clearer the role of channels arising from the \narrangement of particles introducing long walls. Table \\ref{tab:fiber_result} summarizes the results of simulations. \nIt is manifest that the systems with alignment lead to the fastest infiltrations. Furthermore, within this group\nthe dynamics tend to be faster in the presence of longer sticks. These results show that fibers favor the formation\nof preferential infiltration paths. This comes out also from the high values of the error $\\Delta z$ on the average\npenetration depth. With orientation disorder, results of rhombs and fibers are still comparable (cf.~Tab.~\\ref{tab:rhomb_result}).\nSticks introduce more channels that are filled easily, inducing\nstronger accelerations. This appears also from the fluctuations of $Ca$ and $Re$ that turn out to be more marked, displaying\nalso higher peaks (results not shown for brevity). Nevertheless, also for this set of data, capillary forces remain the dominant\nones. It is interesting to note that the simulations with misalignment and tilt can lead to quite fast infiltrations, even though\nthe number of channels is lower. A possible explanation is that orientation disorder for fibers can be regarded as equivalent\nto the presence of small particles when 2D cross-sections are considered (see Fig.~\\ref{fig:front}). As a consequence, when the meniscus slides along\nthe walls introduced by fibers, it is likely to encounter the surface of other particles before the interface becomes flat\nand pinning occurs. So, the results for fibers confirm the advantages identified for pore configurations associated with\nbimodal size distributions. It is also interesting to consider the influence of the surface area of the solid phase (Bear, 1972), i.e. the length\nof its boundary for 2D structures. In principle, for a given volume, spherical shapes tend to minimize the surface area\nwhile thin oblate spheroids mazimize it. It is found that for systems obtained from spheres and rhombs, the boundary\nlength of the solid phase is higher for the systems composed of small particles, in particular for spheres.\nThe boundary of the solid phase is longer in the case of aligned fibers. With orientation disorder, the length of the\nsolid boundary is still longer than that of systems with rhombs. By considering for the solid phase its surface area divided\nby its volume, known as specific surface (Bear, 1972), it is found that the systems with fibers exhibits higher values than\nbimodal systems on average. The specific surface is in use for the characterization of powders. For our systems, the specific\nsurface is lower for rhombs because it is easier to realize compact packings with coarse particles. The highest values are\nobtained with fibers that have however the advantage to favor the formation of channels.\n\nSimulations in the presence of surface growth are performed for packing structures composed of rhombs (see Tabs.~\\ref{tab:rhomb}\nand \\ref{tab:rhomb_result}). A typical configuration is shown in Fig.~\\ref{fig:front}. Figure \\ref{fig:zmax} shows examples of\ninfiltration kinetics. At the interface between the solid and the wetting fluid the front retreats as the surface grows. This effect\nis more important when agglomerates of particles merge. In the analysis of the data, we thus consider an average over the highest\nvalues for the position of the front. Fits to Eq.~\\ref{eq:reac} allow to obtain the initial effective radius $r_{0}$. The effective\nradius used in order to determine the characteristic numbers is set to the average value: $r_{\\mathrm{eff}}=r_{0}/2$. The question arises whether\ninfiltrations stop because of pore closure or pinning. Examination of the fastest dynamics indicates that the cause due to\npore closure is as frequent as that for the barrier introduced by pinning. This implies that surface growth enhances the phenomenon\nof pinning. Indeed, it is found that in the period considered for the fits, the infiltrations without surface reaction \nare on average $5.7\\%$ faster. The resistance of surface growth is more marked for the fastest dynamics, i.e.~with higher\norientation disorder. At the point where infiltration stops according to the theoretical model of Eq.~\\ref{eq:reac}, the\nresults with surface growth are comparable to that with inert boundaries. But it is to be noted that $r_{0}$ turns out to\nbe underestimated in particular for the longer infiltrations where the front can overcome pinning barriers. More details for\nthe results are summarized in Tab.~\\ref{tab:reaction_result}. It can be seen that orientation disorder is associated with\nfaster infiltrations. Bimodal size distributions lead to better results for aligned and misaligned particles. This is no\nmore true with the addition of tilt. In any case, it can be expected that, in 3D porous structures, bimodal size distributions\nstill present more advantages. In Tab.~\\ref{tab:reaction_result}, the infiltration velocities are higher than in\nTab.~\\ref{tab:rhomb_result}. With surface reaction, the dynamics is shorter and the initial fast infiltration has more weight.\nIt should be kept in mind that now the dominant effect is the infiltration interruption directly caused or induced by\nsurface growth. With surface growth allowed, $Ca$, $Q_{4}$ and $Re$ increase appreciably (see Tab.~\\ref{tab:rhomb_result}).\nFurthermore, their fluctuations are by a factor of $2$ smaller than for inert boundaries. $Q_{4}$ gains on average one order\nof magnitude, but the effects of capillary and viscous forces remain more significant. This arises also from the characteristic\nnumbers involving the properties of surface reaction $Q_{1}$, $Q_{2}$ and $Q_{3}$. These quantities describe better the systems\nbecause infiltration stops under the action of surface growth. $Q_{1}$ is more accurate because the effects of capillary forces\nare second in importance even though their relevance weakens with respect to viscosity and inertia in the presence of surface\ngrowth. Only the fluctuations of $Q_{3}$ in a few cases can deviate from the average value more than one order of magnitude.\n\n\\subsection*{5.2~~~Comparison with experiments}\n\nWe now want to carry out simulations for typical experimental results with pure Si (Eustathopoulos, 2015; Israel et al., 2010).\nThe initial porosity of the preform can be assumed to be $0.3$ with initial average pore diameter of $d=10$ $\\mu$m. The pore size\ndistribution is assumed to be quite narrow, with pores mainly in the range $7-13$ $\\mu$m (diameters). The preform is composed of\ngraphite particles with average size of $70$ $\\mu$m. The reaction-rate constant is $k=4\\cdot10^{-8}$ m/s (Messner and Chiang, 1990). \nThe other parameters of Si are $\\rho=2.53\\cdot10^{3}$ kg/m$^{3}$ for the density, $\\mu=0.94\\cdot10^{-3}$ N$\\cdot$s/m$^{2}$ for the\nviscosity and $\\gamma=0.86$ N/m for the surface tension (Einset, 1996).\nFor the infiltration velocity we use $v=5$ $\\mu$m/s (Eustathopoulos, 2015). Thus, the holding time for the experiment can\nbe estimated to be $t_{\\mathrm{pc}}=125$ sec. From the average pore radius it follows that at this time, indicated by $t_{\\mathrm{pc}}$, pore\nclosure occurs and the infiltration stops. The maximal infiltration depth results to be $z_{\\mathrm{max}}=0.625$ mm. \nThe effective radius is estimated using Dullien model as in the article by Einset (1996). By taking into account the thickening\nof the surface of $2.5$ $\\mu$m leading to the average pore diameter $d/2$, it is found that an estimate for the effective radius\nis $r_{\\mathrm{eff}}=0.25$ $\\mu$m. For simulations, we consider systems $N_{x}=1500$ lu long and $N_{y}=511$ lu wide. Since the width\nis twice longer than before, roughly speaking the infiltration velocity may double, as suggested by Eqs.~\\ref{eq:reac} and\n\\ref{eq:linear}. The length of the samples is again $L=N_{x}/2$, placed in the simulation domain as described in Sec.~4. The total\nnumber of timesteps is now set to $N_{\\mathrm{t}}=4\\cdot10^{6}$ ts. The surface grows after every $N_{\\mathrm{t}}/10$ timesteps. In\nsimulations, the reaction-rate constant is thus given by $k=2.5\\cdot10^{-6}$ lu/ts. All the other parameters for the LB simulations\nremain unchanged. The porous structures are obtained from the packing of rhombs with average side and height corresponding to $36$ lu\nand $31$ lu. Both misalignment and tilt are allowed. The porosity of the resulting system is $0.64$. In this case, the sides of the\nunit cube defining the porous structure are subdivided into $512$ bins. Simulations are performed for $30$ sections in 2D. The\ncorrespondence with experimental results is established by imposing the experimental values for $z_{\\mathrm{max}}$ and $t_{\\mathrm{pc}}$.\n\nFigure \\ref{fig:zexp} shows the kinetics of infiltration as obtained from simulations. As done before, an average is taken over\nthe highest values for the positions of the fronts. It can be seen that the model predicts a more abrupt behavior for the interruption\nof penetration, as observed also in experiments (Israel et al., 2010). It turns out that after an initial fast dynamics, the infiltration\nvelocity decreases and in the last stage the maximal depth is attained slowly. For the sake of clarity, we consider suitable averages\nin the neighborhood of the point where pore closure occurs and in the ensuing interval of time where a plateau is expected to form. It\nis found that for $63\\%$ of the systems the infiltrated distance increases more than $10\\%$ after the time $t_{\\mathrm{pc}}$ where pore\nclosure is predicted by the model for the data of Fig.~\\ref{fig:zexp}. On average, the further advancement amounts to $45\\%$. For the\nremaining $37\\%$ of the systems after the time $t_{\\mathrm{pc}}$ the fronts travel on average an additional distance corresponding to\n$0.6\\%$. It is verified that in this case the flow interruption can be ascribed to pinning. As a result, the value of $t_{\\mathrm{pc}}$\ndetermined by the model is practically associated with the first pinning barrier. When the plateau start forming the effect of surface\ngrowth seems to remain mainly indirect. It is to be noted that the simulations reveal the tendency that the interruption of invasion\nis affected by the combination of the effects of surface growth, tortuosity and interface dynamics. In principle, it is reasonable to\npresume that the infiltration may stop before the time required for the obstruction of the average radius since the process of\ninfiltration is described by an effective radius. However, we find that in the simulations the effect of pinning is more critical\nthan expected in experiments. In order to elucidate the role of the effective radius more experiments are also needed for given\nwell-known reaction-rate constants (Israel et al., 2010).\nIn Tab.~\\ref{tab:exp_result} the characteristic numbers of simulations and experiments are compared. It appears that\nthe effects of capillary forces are too weak with respect to the effects of surface growth and viscous forces. For the capillary\nnumber it is well known that high\nvalues satisfy $Ca>10^{-2}$. For this reason, it could be questioned if the difference for the orders of magnitude of $Q_{1}$ is of\nparticular relevance. For sure, our approach allows to establish an equivalence for the dynamics of the average penetration depth.\nInstead, the details of the invasion process can not be taken for granted. For example, for estimates based on the average \nradius of the porous structure, in experiments, when the infiltration stops because of pore closure, the ratio of the infiltrated\ndistance to the thickness of the reaction-formed SiC is $125$. In simulations, it is obtained $75$.\nAs discussed above, the relation between the average and effective radii deserve attention but a major hurdle in order to achieve\nbetter results is represented by the phenomenon of pinning. These simulations also prove that a higher resolution is not sufficient\nin order to reduce pinning. Again, we see that the structure is more important than the average radius, of course increasing with\na higher resolution. Under the conditions of these simulations, the average size of the particles is $150$ $\\mu$m while the target\nwas $70$ $\\mu$m for an equivalence with a stronger direct correspondence for the porous structure. It is not easy to improve the\ncomparison because with packings composed of smaller particles, pinning would become even more important. Furthermore, if we use\nthe data associated with the first point in Fig.~\\ref{fig:zexp} exceeding the average of $z_{\\mathrm{max}}$ over the last $10$\nframes taken into account for the fit, the improvement is relative. The reason is that the velocity decreases but the initial\neffective radius $r_{0}$ increases. The result is that $Q_{1}$ and $Ca$ remain of the same order. Thus, it is not straightforward\nin the simulations to reduce the velocity, to keep $r_{0}$ small and to weaken the phenomenon of pinning at the same time. As a\nconsequence, significant improvements could stem especially from 3D simulations, that are in any case much more time-consuming.\n\n\n\n\\section*{6.~~~CONCLUSIONS}\n\nIn this work, LB simulations are proposed for the study of capillary infiltration into porous structures. Optimization principles\nfor the manufacturing of ceramic materials through reactive melt infiltration are at the center of our attention. In this aim, \nfirst are considered porous systems realized with the packing of particles with different properties (shape, size distribution,\norientation disorder). Without surface growth, our analysis shows that the invading front tend to select preferential pathways.\nThis can result in the formation of fingers. The data also indicate that bimodal size distributions display better infiltrations\nthan monomodal distributions. The improvement is found to be $4.1\\%$ on average (see Tabs.~\\ref{tab:sphere_result} and \\ref{tab:rhomb_result}).\nPinning of the contact line appears as the primary factor affecting liquid penetration. Structural disorder can reduce its effect.\nInterestingly, bimodal size distributions present advantages in order to limit pinning. Larger faceted particles introduce walls\ngiving rise to channels. As a result, the meniscus travels longer distances before the loss of its curvature. The probability to\nencounter the surface of other particles is even higher with the addition of smaller particles. The results for packings with fibers\nsupport this view. It is also verified that inertia effects induced by transient accelerations remain of secondary importance.\nSurface growth results in a clear interruption of the flow. This can occur because pinning turns out to be enhanced or for\nthe pore-closing phenomenon. The retardation effects are more marked for the fast dynamics with a higher degree of orientation\ndisorder. Again, the results point out that bimodal size distributions appear to be able of accommodating optimal infiltration.\nSimulations with higher resolution are also performed for a comparison with experiments. The relative strength of capillary\nforces turns out not to be strong enough. As a result, the infiltration dynamics is not reproduced in full details. \nFurthermore, the effects of surface growth for the interruption of infiltration are basically indirect in this case. We identify two\naspects significant for further advances. First, the relation for the interruption of infiltration with the physical (e.g., average\nand minimum) and effective radii needs to be elucidated. Second, longer infiltrated lengths should be realized in simulations.\nA major obstacle to improvements resides in the over-occurrence of pinning. There appears that 2D simulations are not especially\nsuited for direct accurate simulations of experiments. Finally, our study develops a simulation work relevant for increasing the\nquality of ceramics obtained from LSI. Despite a poor statistics and noisy results, operational guidelines are highlighted. Further\nresearch is necessary in order to sharpen the conditions determining the optimal configuration for the porosity. Experimental tests\nwould also allow to understand the robustness of our findings based on simplified systems.\n\n\n\n\\acknowledgments\n\nThe research leading to these results has received funding from the European Union Seventh Framework Programme \n(FP7/2007-2013) under grant agreement n$^{\\circ}$ 280464, project \"High-frequency ELectro-Magnetic technologies\nfor advanced processing of ceramic matrix composites and graphite expansion'' (HELM).\n\n\n\n\\begin{thebibliography}{1}\n\n\\bibitem{sic_optics} Aghajanian M, Emmons C, Rummel S, Barber P, Robb C, Hibbard D (2013).\nEffect of grain size on microstructure, properties and surface roughness of reaction\nbonded SiC ceramics. \\textit{Proceedings of SPIE 8837 on Material Technologies and Applications\nto Optics, Structures, Components and Sub-Systems}. September 30, San Diego, California, USA, 88370-88378.\n\n\\bibitem{alava}Alava M, Dube M, Rost M (2004). Imbibition in disordered media. \\textit{Advances in Physics} 53(2):83-175.\n\n\\bibitem{ansys}Alawadhi EM (2010). \\textit{Finite Element Simulations Using ANSYS}, Taylor \\& Francis.\n\n\\bibitem{korean}Asthana R, Singh M, Sobczak N (2005). Infiltration processing of ceramic-metal\ncomposites: the role of wettability, reaction, and capillary flow. \n\\textit{Journal of the Korean Ceramic Society} 42(11):703-717.\n\n\\bibitem{membrane}Bao N, Yibo Z, Jiao K, Yin Y, Du Q, Chen J (2014).\nEffect of gas diffusion layer deformation on liquid water transport in proton\nexchange membrane fuel cell. \\textit{Engineering Applications of Computational Fluid Mechanics}\n8(1):26-43.\n\n\\bibitem{bear}Bear J (1972). \\textit{Dynamics of Fluids in Porous Media}, Elsevier.\n\n\\bibitem{benzi}Benzi R, Succi S, Vergassola M (1992). \nThe lattice Boltzmann equation: theory and applications.\n\\textit{Physics Reports} 222(3):145-197.\n\n\\bibitem{pinning_yeomans2}Blow ML, Kusumaatmaja H, Yeomans JM (2009).\nImbibition through an array of triangular posts.\n\\textit{Journal of Physics: Condensed Matter} 21(46):464125.\n\n\\bibitem{garbo}Bohn RB, Garboczi EJ (2003). User manual for finite element and\nfinite difference programs: A parallel version of NISTIR-6269. \\textit{NIST Internal\nReport} 6997:1-275.\n\n\\bibitem{nisi}\nBougiouri V, Voytovych R, Rojo-Calderon N, Narciso J, Eustathopoulos N (2006). \nThe role of the chemical reaction in the infiltration of porous carbon by NiSi alloys.\n\\textit{Scripta Materialia} 54(11):1875-1878.\n\n\\bibitem{review}\nChen S, Doolen GD (1998). Lattice Boltzmann method for fluid flows.\n\\textit{Annual Review of Fluid Mechanics} 30:329-364.\n\n\\bibitem{chibarro}Chibbaro S (2008). Capillary filling with pseudo-potential binary\nLattice-Boltzmann model. \\textit{The European Physical Journal E} 27(1):99-106.\n\n\\bibitem{pinning_succi1}Chibbaro S, Biferale L, Binder K, Dimitrov D, Diotallevi F, Milchev A, \nSucci S (2009a). Hydrokinetic simulations of nanoscopic precursor films in rough channels.\n\\textit{Journal of Statistical Mechanics: Theory and Experiments}:6007-6021.\n\n\\bibitem{succi2}\nChibbaro S, Biferale L, Diotallevi F, Succi S (2009b).\nCapillary filling for multicomponent fluid using the pseudo-potential Lattice Boltzmann method.\n\\textit{The European Physical Journal Special Topics} 171(1):223-228.\n\n\\bibitem{pinning_succi2}\nChibbaro S, Costa E, Dimitrov DI, Diotallevi F, Milchev A, Palmieri D, Pontrelli G, Succi S (2009c).\nCapillary filling in microchannels with wall corrugations: A comparative study of the Concus-Finn\ncriterion by continuum, kinetic, and atomistic approaches. \\textit{Langmuir} 25(21):12653-12660.\n\n\\bibitem{dezellus2}\nDezellus O, Eustathopoulos N (2010). Fundamental issues of reactive wetting by liquid metals.\n\\textit{Journal of Materials Science} 45(16):4256-4264.\n\n\\bibitem{dezellus}Dezellus O, Hodaj F, Eustathopoulos N (2003). \nProgress in modelling of chemical-reaction limited wetting.\n\\textit{Journal of the European Ceramic Society} 23(15):2797-2803.\n\n\\bibitem{succi1}\nDiotallevi F, Biferale L, Chibbaro S, Lamura A, \nPontrelli G, Sbragaglia M, Succi S, Toschi T (2009a).\nCapillary filling using lattice Boltzmann equations: The case of multi-phase flows.\n\\textit{The European Physical Journal Special Topics} 166(1):111-116.\n\n\\bibitem{succi3}\nDiotallevi F, Biferale L, Chibbaro S, Pontrelli G, Toschi F, Succi S (2009b). \nLattice Boltzmann simulations of capillary filling: Finite vapour density effects.\n\\textit{The European Physical Journal Special Topics} 171(1):237-243.\n\n\\bibitem{packing}Donev A, Cisse I, Sachs D, Variano EA, Stillinger FH, Connelly R,\nTorquato S, Chaikin PM (2004). Improving the density of jammed disordered packings\nusing ellipsoids. \\textit{Science} 303(5660):990-993.\n\n\\bibitem{tortuosity1}Duda A, Koza Z, Matyka M (2011). Hydraulic tortuosity in arbitrary\nporous media flow. \\textit{Physical Review E} 84(3):36319-36326.\n\n\\bibitem{dullien}\nDullien FAL (1992). \\textit{Porous Media: Fluid Transport and Pore Structure}, Academic Press.\n\n\\bibitem{einset1}\nEinset EO (1996). Capillary infiltration rates into porous media with application to \nsilcomp processing. \\textit{Journal of the American Ceramic Society} 79(2):333-338.\n\n\\bibitem{einset2}\nEinset EO (1998). Analysis of reactive melt infiltration in the processing of ceramics \nand ceramic composites. \\textit{Chemical Engineering Science} 53(5):1027-1039.\n\n\\bibitem{metals}\nEustathopoulos N (2015). Wetting by liquid metals-Application in materials processing: The\ncontribution of the Grenoble Group. \\textit{metals} 5:350-370.\n\n\\bibitem{highT}\nEustathopoulos N, Nicholas MG, Drevet B (1999). \\textit{Wettability at High Temperatures}, Pergamon.\n\n\\bibitem{fan}Fan S, Zhang L, Xu Y, Cheng L, Tian G, Ke S, Xu F, Liu H (2008). Microstructure and\ntribological properties of advanced carbon/silicon carbide aircraft brake materials. \n\\textit{Composites Science and Technology} 68(14):3002-3009.\n\n\\bibitem{solar2}Furler P, Scheffe J, Gorbar M, Moes L, Vogt U, Steinfeld A (2012).\nSolar thermochemical CO$_{2}$ splitting utilizing a reticulated porous ceria redox system.\n\\textit{Energy and Fuels} 26(11):7051-7059.\n\n\\bibitem{brake}Gadow R (2000). Current status and future prospects of CMC brake components\nand their manufacturing technologies.\n\\textit{Proceedings of the 24th Annual Conference on Composites, Advanced Ceramics, Materials,\nand Structures A}. January 23-28, Cocoa Beach, Florida, USA, 15-29.\n\n\\bibitem{gadow}Gadow R, Speicher M (2000).\nOptimized morphological design for silicon infiltrated microporous carbon preforms. \n\\textit{Proceedings of the 24th Annual Conference on Composites, Advanced Ceramics, Materials,\nand Structures A}. January 23-28, Cocoa Beach, Florida, USA, 485-492.\n\n\\bibitem{gennes}de Gennes PG, Brochard-Wyart F, Qu\\a{'}er\\a{'}e D (2004).\n\\textit{Capillarity and Wetting Phenomena: Drops, Bubbles, Pearls, Waves}, Springer.\n\n\\bibitem{gern}Gern FH, Kochend\\a{\"}orfer R (1997). Liquid silicon infiltration: description\nof infiltration dynamics and silicon carbide formation. \\textit{Composites Part A: Applied\nScience and Manufacturing} 28(4):355-364.\n\n\\bibitem{inclined}Ghosh S, Patil P, Mishra SC, Das AK, Das PK (2012). 3-D lattice Boltzmann\nmodel for asymmetric Taylor bubble and Taylor drop in inclined channel. \\textit{Engineering\nApplications of Computational Fluid Mechanics} 6(3):383-394.\n\n\\bibitem{mortensen_porous}Goodall R, Mortensen A (2013).\nPorous metals. \\textit{Physical Metallurgy}, Elsevier.\n\n\\bibitem{raabe}Gross M, Varnik F, Raabe D, Steinbach I (2010). Small droplets on superhydrophobic\nsubstrates. \\textit{Physical Review E} 81(5):51606-51619.\n\n\\bibitem{hole}Hahani R, Rahimian MH, Tahilou M (2013). LBM simulation of a droplet dripping\ndown a hole. \\textit{Engineering Applications of Computational Fluid Mechanics} 7(4):461-470.\n\n\\bibitem{hillig}\nHillig WB, Mehan RL, Morelock CR, DeCarlo VJ, Laskow W (1975).\nSilicon/silicon carbide composites.\n\\textit{American Ceramic Society Bulletin} 54(12):1054-1056.\n\n\\bibitem{htc09}\nIsrael R, Voytovych R, Protsenko P, Drevet B, Camel D, Eustathopoulos N (2010). \nCapillary interaction between molten silicon and porous graphite.\n\\textit{Journal of Materials Science} 45(8):2210-2217.\n\n\\bibitem{suspension}Joshi AS, Sun Y (2010). Wetting dynamics and particle deposition for an\nevaporating colloidal drop: A lattice Boltzmann study.\n\\textit{Physical Review E} 82(4):41401-41417.\n\n\\bibitem{komnik}Komnik A, Harting J, Herrmann HJ (2004). Transport phenomena and structuring\nin shear flow of suspensions near solid walls. \\textit{Journal of Statistical Mechanics: Theory\nand Experiment} 2004(12):12003.\n\n\\bibitem{paper}Koponen A, Kandhai D, Hell\\a{'}en, Alava M, Hoekstra A, Kataja M, Niskanen K,\nSloot P, Timonen J (1998). Permeability of three-dimensional random fiber webs. \n\\textit{Physical Review Letters} 80(4):716-719. \n\n\\bibitem{friction}Krenkel W, Berndt F (2005). C/C-SiC composites for space applications and\nadvanced friction systems. \\textit{Materials Science and Engineering A} 412(1-2):177-181.\n\n\\bibitem{pinning_yeomans3}Kusumaatmaja H, Pooley CM, Girardo S, Pisignano D, Yeomans JM (2008). \nCapillary filling in pattern channels.\n\\textit{Physical Review E} 77(6):67301-67304.\n\n\\bibitem{landau}Landau LD, Lifshitz EM (2008). \\textit{Fluid Mechanics}, Elsevier.\n\n\\bibitem{passerone}\nLiu GW, Muolo ML, Valenza F, Passerone A (2010). Survey on wetting of SiC by molten metals.\n\\textit{Ceramics International} 36(4):1177-1188.\n\n\\bibitem{valocchi}Liu H, Valocchi AJ, Kang Q (2012). Three-dimensional lattice Boltzmann model\nfor immiscible two-phase flow simulations. \\textit{Physical Review E} 85(4):46309-46322.\n\n\\bibitem{martins}Martins GP, Olson DL, Edwards GR (1988). Modeling of infiltration kinetics for\nliquid metal processing of composites. \\textit{Metallurgical Transactions B} 19(1):95-101.\n\n\\bibitem{martys}\nMartys NW, Chen HD (1996). Simulation of multicomponent fluids in complex three-dimensional \ngeometries by lattice Boltzmann method. \\textit{Physical Review E} 53(1):743-750.\n\n\\bibitem{tortuosity2}\nMatyka M, Koza Z (2012). How to calculate tortuosity easily?\n\\textit{American Institute of Physics Conference Proceedings} 1453, 17-22.\n\n\\bibitem{messner}\nMessner RP, Chiang YM (1990). Liquid-phase reaction-bonding of silicon carbide using alloyed \nsilicon-molybdenum melts. \\textit{Journal of the American Ceramic Society} 73(5):1193-1200.\n\n\\bibitem{pinning_yeomans1}\nMognetti BM, Yeomans JM (2009). Capillary filling in microchannels patterned by posts.\n\\textit{Physical Review E} 80(5):56309-56316.\n\n\\bibitem{mortensen}\nMortensen A, Drevet B, Eustathopoulos N (1997).\nKinetics of diffusion-limited spreading of sessile drops in reactive wetting.\n\\textit{Scripta Materialia} 36(6):645-651.\n\n\\bibitem{paik}\nPaik U, Park HC, Choi SC, Ha CG, Kim JW, Jung YG (2002).\nEffect of particle dispersion on microstructure and strength of reaction-bonded silicon carbide.\n\\textit{Materials Science and Engineering: A} 334(1-2):267-274.\n\n\\bibitem{india}Patro D, Bhattacharyya S, Jayram V (2007). \nFlow kinetics in porous ceramics: understanding with non-uniform capillary models.\n\\textit{Journal of the American Ceramic Society} 90(10):3040-3046.\n\n\\bibitem{armor}Roberson C, Hazell PJ (2003). Resistance of silicon carbide to penetration\nby a tungsten carbide cored projectile. \\textit{Proceedings of the 105th Annual Meeting\nof the American Ceramic Society on Ceramic Armor and Armor Systems}.\nApril 27-30, Nashville, Tennessee, USA, 165-174.\n\n\\bibitem{salamone}Salamone S, Karandikar P, Marshall A, Marchant DD, Sennett M (2008). \nEffects of Si:SiC ratio and SiC grain size on properties for RBSC.\n\\textit{Mechanical Properties and Performance of Engineering Ceramics and Composites III},\nWiley, 101-109.\n\n\\bibitem{sangsuwan}Sangsuwan P, Orejas JA, Gatica JE, Tewari SN, Singh M (2001).\nReaction-bonded silicon carbide by reactive infiltration. \\textit{Industrial \\& Engineering\nChemistry Research} 40(23):5191-5198.\n\n\\bibitem{supsi4}Scocchi G, Ortona A, Grossi L, Bianchi G, D'Angelo C, Leidi T, Gilardi R (2013).\nEvaluation of a simple finite element method for the calculation of effective electrical\nconductivity of compression moulded polymer-graphite composites. \\textit{Composites: Part A} 48:15-25.\n\n\\bibitem{supsi3}Sergi D, D'Angelo C, Scocchi G, Ortona A (2012). Random packing of small blocks:\npressure effects, orientational correlations and application to polymer-based composites.\n\\textit{Particle \\& Particle Systems Characterization} 29(1):24-34.\n\n\\bibitem{alicante}Sergi D, Camarano A, Molina JM, Ortona A, Narciso J (2016).\nSurface growth for molten silicon infiltration into carbon millimeter-sized channels:\nLattice-Boltzmann simulations, experiments and models. \\textit{International Journal\nof Modern Physics C}, accepted for publication.\n\n\\bibitem{supsi1}Sergi D, Grossi L, Leidi T, Ortona A (2014). Surface growth effects on \nreactive capillary-driven flow: Lattice Boltzmann investigation. \\textit{Engineering\nApplications of Computational Fluid Mechanics} 8(4):549-561.\n\n\\bibitem{supsi2}Sergi D, Grossi L, Leidi T, Ortona A (2015). Lattice Boltzmann simulations\non the role of channel structure for reactive capillary infiltration. \\textit{Engineering\nApplications of Computational Fluid Mechanics} 9(1):301-323.\n\n\\bibitem{rsa2}Sherwood JD (1997). Packing of spheroids in three-dimensional space by \nrandom sequential addition. \\textit{Journal of Physics A: Mathematical and General}\n30(24):839-843.\n\n\\bibitem{book2}\nSucci S (2009). \\textit{The Lattice Boltzmann Equation for Fluid Dynamics and Beyond}, \nOxford University Press.\n\n\\bibitem{book1}\nSukop MC, Thorne Jr DT (2010). \\textit{Lattice Boltzmann Modeling:\nAn Introduction for Geoscientists and Engineers}, Springer.\n\n\\bibitem{torquato}Torquato S (2002). \\textit{Random Heterogeneous Materials: Microstructures\nand Macroscopic Properties}, Springer.\n\n\\bibitem{nisi2}\nVoytovych R, Bougiouri V, Calderon NR, Narciso J, Eustathopoulos N (2008). \nReactive infiltration of porous graphite by NiSi alloys.\n\\textit{Acta Materialia} 56(10):2237-2246.\n\n\\bibitem{heat}Wang M, Pan N (2008). Modeling and prediction of the effective thermal\nconductivity of random open-cell porous foams. \\textit{International Journal of Heat and\nMass Transfer} 51(5-6):1325-1331.\n\n\\bibitem{washburn}\nWashburn EW (1921). The dynamics of capillary rise. \\textit{Physical Review} 27(3):273-283.\n\n\\bibitem{spurious_wagner}Wagner AJ (2003). \nThe origin of spurious velocities in lattice Boltzmann.\n\\textit{International Journal of Modern Physics B} 17(1-2):193-196.\n\n\\bibitem{rsa1}Widom B (1966). Random sequential addition of hard spheres to a volume.\n\\textit{The Journal of Chemical Physics} 44:3888-3894.\n\n\\bibitem{pinning_uesaka2}Wiklund H, Uesaka T (2012). \nEdge-wicking: micro-fluidics of two-dimensional liquid penetration into porous structures.\n\\textit{Nordic Pulp and Paper Research Journal} 27(2):403-408.\n\n\\bibitem{pinning_uesaka1}Wiklund HS, Uesaka T (2013). \nMicrofluidics of imbibition in random porous media.\n\\textit{Physical Review E} 87(2):23006-23014.\n\n\\bibitem{wolfram}\nWolf-Gladrow DA (2005). \\textit{Lattice-Gas Cellular Automata\nand Lattice Boltzmann Models - An Introduction}, Springer.\n\n\\bibitem{ilegbusi}Yang J, Ilegbusi OJ (2000). Kinetics of silicon-metal alloy infiltration\ninto porous carbon. \\textit{Composites Part A: Applied Science and Manufacturing} 31(6):617-625.\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 13400, "prevtext": "\nwhere $V_{\\mathrm{cap}}=\\gamma/\\mu$ and $t_{\\mathrm{d}}=\\rho r^{2}/3\\mu$.\nFor more general porous systems, the radius of the channel is replaced with the effective radius.\nRelevant studies for reactive infiltration based on dynamics can be found in Asthana et al.~(2005), Gern and\nKochend\\a{\"}orfer (1997), Martins et al.~(1988), Messner and Chiang (1990), Sangsuwan et al.~(2001),\nYang and Ilegbusi (2000).\n\nThe simulations output is in model units. For the units of the basic quantities of mass, length and\ntime we use the symbols mu, lu and ts, respectively. The data obtained from simulations can be expressed\nin regular units of the SI system after suitable transformations\n(Chibbaro et al., 2009a and 2009c; Gross et al., 2010; Joshi and Sun, 2010; Komnik et al., 2004). For\ncomparisons with experimental data we apply the approach based on dimensionless numbers like the Reynolds or capillary\nnumbers (Landau and Lifshitz, 2008). For example, these numbers compare the relative strength between the\neffects of inertial, viscous and capillary forces. Two systems are assumed to be equivalent when the dimensionless\nnumbers for the dominating forces have the same values. For our purposes, we also need dimensionless numbers\ninvolving the characteristic time set by the surface reaction (Sergi et al., 2016):\n\n", "index": 7, "text": "\\begin{equation*}\nQ_{1}=\\frac{\\rho rvk}{\\gamma}\\ ,\\quad Q_{2}=\\frac{\\rho rk}{\\mu}\\ ,\\quad Q_{3}=\\frac{k}{v}\\ .\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"Q_{1}=\\frac{\\rho rvk}{\\gamma}\\ ,\\quad Q_{2}=\\frac{\\rho rk}{\\mu}\\ ,\\quad Q_{3}=%&#10;\\frac{k}{v}\\ .\" display=\"block\"><mrow><mrow><mrow><msub><mi>Q</mi><mn>1</mn></msub><mo>=</mo><mpadded width=\"+5pt\"><mfrac><mrow><mi>ρ</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>v</mi><mo>⁢</mo><mi>k</mi></mrow><mi>γ</mi></mfrac></mpadded></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><msub><mi>Q</mi><mn>2</mn></msub><mo>=</mo><mpadded width=\"+5pt\"><mfrac><mrow><mi>ρ</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>k</mi></mrow><mi>μ</mi></mfrac></mpadded></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msub><mi>Q</mi><mn>3</mn></msub><mo>=</mo><mpadded width=\"+5pt\"><mfrac><mi>k</mi><mi>v</mi></mfrac></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]