[{"file": "1601.00873.tex", "nexttext": "\nTherefore, the resulting SINR $\\gamma_i$ corresponding to the $i^{th}$ transmitter is given by \\cite{LeTreust2010,Mhiri2013}:\n\n", "itemtype": "equation", "pos": 12685, "prevtext": "\n\n\n\\title{Cross-layer distributed power control: A repeated games formulation to improve the sum energy-efficiency}\n\n\n\n\n\n\n\n\\titlerunning{Cross-layer distributed power control: A RG formulation to improve the sum EE}        \n\n\\author{Mariem Mhiri,          \n        Vineeth S. Varma,      \n\t\t\t\tKarim Cheikhrouhou,    \n\t\t\t\tSamson Lasaulce       and\n\t\t\t\tAbdelaziz Samet\n}\n\n\\authorrunning{M. Mhiri, V. S. Varma, K. Cheikhrouhou, S. Lasaulce and A. Samet} \n\n\n\\institute{M. Mhiri \\at\n             SERCOM Laboratory, Tunisia Polytechnic School, P.B. 743-2078, La Marsa, Tunisia \\\\\n             \\email{mariem.mhiri@gmail.com}          \n\n          \\and\n           V. S. Varma \\at\n              Singapore University of Technology and Design, Singapore \\\\\n\t\t\t\t\t\t\t\\email{vineethsvarma@gmail.com}\n\t\t\t\t\t\\and\n\t\t\t\t\t K. Cheikhrouhou \\at\n              SERCOM Laboratory, Tunisia Polytechnic School, P.B. 743-2078, La Marsa, Tunisia \\\\\n              \\email{karim.cheikhrouhou@gmail.com}           \n          \\and\n\t\t\t\t\t S. Lasaulce \\at\n              L2S - CNRS - SUPELEC, 91192 Gif-sur-Yvette, University of Paris-Sud, France \\\\\n              \\email{samson.lasaulce@lss.supelec.fr}    \n\t\t\t\t  \\and\n\t\t\t\t\t A. Samet \\at\n              EMT Centre - INRS University, Ouest Montr\\'{e}al (Qu\\'{e}bec), H5A 1K6, Canada \\\\\n              \\email{samet@emt.inrs.ca}    \t\t\t\t\t\t\n}\n\n\n\\date{Received: date / Accepted: date}\n\n\n\\maketitle\n\n\\begin{abstract}\nThe main objective of this work is to improve the energy-efficiency (EE) of a multiple access channel (MAC) system, through power control, in a distributed manner. In contrast with many existing works on energy-efficient power control, which ignore the possible presence of a queue at the transmitter, we consider a new generalized cross-layer EE metric. This approach is relevant when the transmitters have a non-zero energy cost even when the radiated power is zero and takes into account the presence of a finite packet buffer and packet arrival at the transmitter. As the Nash equilibrium (NE) is an energy-inefficient solution, the present work aims at overcoming this deficit by improving the global energy-efficiency. Indeed, as the considered system has multiple agencies each with their own interest, the performance metric reflecting the individual interest of each decision maker is the global energy-efficiency defined then as the sum over individual energy-efficiencies. Repeated games (RG) are investigated through the study of two dynamic games (finite RG and discounted RG), whose equilibrium is defined when introducing a new operating point (OP), Pareto-dominating the NE and relying only on individual channel state information (CSI). Accordingly, closed-form expressions of the minimum number of stages of the game for finite RG (FRG) and the maximum discount factor of the discounted RG (DRG) were established. Our contributions consist of improving the system performances in terms of powers and utilities when using the new OP compared to the NE and the Nash bargaining (NB) solution. Moreover, the cross-layer model in the RG formulation leads to achieving a shorter minimum number of stages in the FRG even for higher number of users. In addition, the social welfare (sum of utilities) in the DRG decreases slightly with the cross-layer model when the number of users increases while it is reduced considerably with the Goodman model. Finally, we show that in real systems with random packet arrivals, the cross-layer power control algorithm outperforms the Goodman algorithm.\n\n\\keywords{Distributed power control \\and Cross-layer energy-efficiency \\and Repeated games \\and Channel state information.}\n\\end{abstract}\n\n\\section{Introduction}\n\n\\subsection{Motivation}\n\nThe design and management of green wireless networks \\cite{lister-09,palicot-2005,greentouch-10} has become increasingly important for modern wireless networks, in particular, to manage operating costs. Futuristic (beyond 5G) cellular networks face the dual challenges of being able to respond to the explosion of data rates and also to manage network energy consumption. Due to the limited spectrum and large number of active users in modern networks, energy-efficient distributed power control is an important issue. Sensor networks, which have multiple sensors sending information to a common receiver with a limited energy, capacity have also recently surged in popularity. Energy minimization in sensor networks has been analysed in many recent works \\cite{Yu2006,Bandyopadhyay2003,Cardei2005}.\\\\\nSeveral of the above described systems have some common features:\n\\begin{enumerate}\n\\item Multiple transmitters connected to a common receiver.\n\\item Lack of centralization or coordination, i.e., a distributed and de-centralized network.\n\\item Relevance of minimizing energy consumption or maximizing energy-efficiency (EE).\n\\item Transmitters that have arbitrary data transmission.\n\\end{enumerate}\nThese features are present in many modern systems like a sensor network which has multiple sensors with limited energy connected in a distributed manner to a common receiver. These sensors don't always have information to transmit, resulting in sporadic data transmission. Another example would be several mobile devices connected to a hot-spot (via wifi or even Bluetooth). Due to these features of the network, inter-transmitter communication is not possible and the transmitters are independent decision makers. Therefore, implementing frequency or time division multiple access becomes harder and a MAC protocol (with single carrier) is often the preferred or natural method of channel access.\n\n\\subsection{Novelty}\n\nIn many existing works, both network-centric and user-centric approaches have been studied. In a network-centric approach, the global energy-efficiency (GEE) is defined as the ratio between the system benefit (sum-throughput or sum-rate) over the total cost in terms of consumed power \\cite{Zappone2015,Isheden2012}. However, when targeting an efficient solution in an user-centric problem, the GEE becomes not ideal as it has no significance to any of the decision makers. In this case, other metrics are required to reflect the individual interest of each decision maker. Therefore, we redefine the GEE to be the sum over individual energy-efficiencies as a suitable metric of interest \\cite{LasaulceTWC2009}.\\\\\nThe major novelty of this work is in improving the \\textbf{sum of energy-efficiencies} for a communication system with \\textbf{all the listed features above}. In such a \\textbf{decentralized and distributed network}, as each transmitter operates independently, implementing a frequency division or a time division multiple access is not trivial. Therefore, we are interested in looking at a \\textbf{MAC system} where all transmitters operate on the same band. Additionally, \\textbf{EE} will be our preferred metric due to its relevance. This metric has been defined in \\cite{Goodman2000} as the ratio between the average net data rate and the transmitted power. In \\cite{Betz2008,Zappone2013}, the total power consumed by the transmitter was taken into account in the EE expression to design distributed power control which is one of the most well known techniques for improving EE. However, many of the works available on energy-efficient power control consider the EE defined in \\cite{Goodman2000} where the possible presence of a queue at the transmitter is ignored. In contrast with the existing works, we consider a new generalized EE based on a cross-layer approach developed recently in \\cite{VarmaICC2012,VarmaTVT2014}. This approach is important since it takes into account: 1) a fixed cost in terms of power namely, a cost which does not depend on the radiated power; and 2) \\textbf{the presence of a finite packet buffer and sporadic packet arrival} at the transmitter (which corresponds to including the 4th feature mentioned above).\nAlthough providing a more general model, the distributed system in \\cite{VarmaTVT2014} may operate at a point which is energy-inefficient. Indeed, the point at which the system operates is a Nash equilibrium (NE) of a certain non-cooperative static game. The present work aims at filling this gap by not only considering a cross-layer approach of energy-efficient power control but also improving the system performance in terms of sum of energy-efficiencies.\n\n\\subsection{State of the art}\n\nNash bargaining (NB) solution in a cooperative game can provide a possible efficient solution concept for the problem of interest as it is Pareto-efficient. However, it generally requires global channel state information (CSI) \\cite{MhiriNov2012}. Therefore, we are interested in improving the average performance of the system by considering long-term utilities. We focus then on repeated games (RG) where repetition allows efficient equilibrium points to be implemented. Unlike static games which are played in one shot, RG are a special case of dynamic games which consider a cooperation plan and consist in repeating at each step the same static game and the utilities result from averaging the static game utilities over time \\cite{Lasaulce2009}. There are two relevant dynamic RG models: finite (FRG) and discounted (DRG). The FRG is defined when the number of stages during which the players interact is finite. For the DRG model, the discount factor is seen as the stopping probability at each stage \\cite{Lasaulce2011}. The power control problem using the classic EE developed by Goodman et al in \\cite{Goodman2000} has been solved with RG only in \\cite{LeTreust2010} where authors developed an operating point (OP) relying on individual CSI and showed that RG lead to efficient distributed solution. Here, we investigate the power control problem of a MAC system by referring to RG (finite and discounted) where the utility function is based on a cross-layer approach. Accordingly, we contribute to:\n\\begin{enumerate}\n\\item determine the closed-form expressions of the minimum number of stages for the FRG and the maximum discount factor for the DRG. These two parameters identify the two considered RG.\n\\item determine a distributed solution Pareto-dominating the NE and improving the system performances in terms of powers and utilities compared not only to the NE but also to the NB solution even for high number of users.\n\\item show that the RG formulation when using the new EE and the new OP leads to significant gains in terms of social welfare (sum of utilities of all the users) compared to the NE. \n\\item show that the following aspects of the cross-layer model improve considerably the system performances when comparing to the Goodman model even for large number of users:\n\\begin{itemize}\n\t\\item the minimum number of stages in the cross-layer EE model can always be shorter than the minimum number of stages in the Goodman EE formulation.\n\t\\item the social welfare for the DRG in the cross-layer model decreases slightly when the number of users increases while it decreases considerably in the Goodman model.\n\t\\end{itemize}\n\t\\item show that in real systems with random packet arrivals, the cross-layer power control algorithm outperforms the Goodman algorithm and then the new OP with the cross-layer approach is more efficient.\n\\end{enumerate}\n\n\n\\subsection{Structure}\n\nThis paper is structured as follows. In section \\ref{sec:ProblemStatement}, we define the system model under study, introduce the generalized EE metric and define the non-cooperative static game. This is followed (section \\ref{sec:NashBargainingSolution}) by the study of the NB solution. In section \\ref{sec:RepeatedGamesFormulation}, we introduce the new OP, give the formulation of both RG models (FRG and DRG) and determine the closed-form expressions of the minimum number of stages and the maximum discount factor as well. Numerical results are presented in section \\ref{sec:NumericalResults} and finally we draw several concluding remarks.\n\n\\section{Problem statement}\n\\label{sec:ProblemStatement}\n\n\\subsection{System model}\n\\label{sec:SystemModel}\n\nWe consider a MAC system composed of $N$ small transmitters communicating with a receiver. The $i^{th}$ transmitter transmits a signal $x_i$ with a power $p_i \\in [0, P_{i}^{\\max}]$ where $P_{i}^{\\max}$ is the maximum transmit power assumed identical for all users ($P_{i}^{\\max}=P^{\\max}$). The additive noise, which is the same for all users, is an additive white Gaussian noise denoted as $n$ with zero mean and variance $\\sigma^{2}$. We assume that the users transmit their data over block fading channels. The channel gain between user $i$ and the receiver is given by $g_{i}$. Thus, the baseband signal received at the receiver is written as:  \n\n", "index": 1, "text": "\\begin{equation}\ny = \\sum_{\\substack{i=1}}^{N} x_{i}|g_{i}|^2 + n. \n\\label{1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"y=\\sum_{\\begin{subarray}{c}i=1\\end{subarray}}^{N}x_{i}|g_{i}|^{2}+n.\" display=\"block\"><mrow><mrow><mi>y</mi><mo>=</mo><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mtable class=\"ltx_align_c\"><mtr><mtd><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow></mtd></mtr></mtable><mi>N</mi></munderover><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>+</mo><mi>n</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwhere $\\mathbf{p}=(p_1,p_2,\\ldots,p_N)$ defines the power vector of all users and can be written as $\\mathbf{p}=(p_i,\\mathbf{p_{-i}})$ with $\\mathbf{p_{-i}}=(p_1,\\ldots,p_{i-1},p_{i+1},\\ldots,p_N)$.\n\nThe purpose of this work is to determine how each user is going to control its power in an optimum way. Game theory, as a powerful mathematical tool, helps to solve such an optimization problem where the utility function is the EE which is a function of the users powers. Since the system under study has multiple agencies each with individual interest, the sum over individual energy-efficiencies will be considered as the performance metric reflecting the individual interest of each decision maker.\n\n\n\\subsection{Energy-efficiency metric}\n\\label{sec:EnergyEfficiencyMetric}\n\nThe EE is defined in \\cite{Goodman2000} as a ratio of the net data rate to the transmit power level and is given by:\n\n", "itemtype": "equation", "pos": 12904, "prevtext": "\nTherefore, the resulting SINR $\\gamma_i$ corresponding to the $i^{th}$ transmitter is given by \\cite{LeTreust2010,Mhiri2013}:\n\n", "index": 3, "text": "\\begin{equation}\n\\gamma_{i}(\\mathbf{p}) = \\displaystyle{\\frac{p_{i}|g_{i}|^2}{\\sigma^{2}+\\sum_{j \\neq i} p_{j}|g_{j}|^2 }},\n\\label{2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\gamma_{i}(\\mathbf{p})=\\displaystyle{\\frac{p_{i}|g_{i}|^{2}}{\\sigma^{2}+\\sum_{%&#10;j\\neq i}p_{j}|g_{j}|^{2}}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mi>p</mi><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msub><mi>p</mi><mi>j</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwhere $R$ is the transmission rate (in bit/s) while $f : \\left[0, +\\infty \\right) \\rightarrow [0,1]$ denotes the efficiency function which is sigmoidal and corresponds to the packet success rate verifying $f(0)=0$ and $\\lim\\limits_{x \\rightarrow +\\infty} f(x)=1$. Authors of \\cite{Betz2008} were the first to consider a total transmission cost of the type \\emph{radiated power} ($p_i$) $+$ \\emph{consumed power} ($b$) to design distributed power control strategies for multiple access channels \\cite{VarmaICC2012,VarmaTVT2014} as follows:\n\n", "itemtype": "equation", "pos": 13948, "prevtext": "\nwhere $\\mathbf{p}=(p_1,p_2,\\ldots,p_N)$ defines the power vector of all users and can be written as $\\mathbf{p}=(p_i,\\mathbf{p_{-i}})$ with $\\mathbf{p_{-i}}=(p_1,\\ldots,p_{i-1},p_{i+1},\\ldots,p_N)$.\n\nThe purpose of this work is to determine how each user is going to control its power in an optimum way. Game theory, as a powerful mathematical tool, helps to solve such an optimization problem where the utility function is the EE which is a function of the users powers. Since the system under study has multiple agencies each with individual interest, the sum over individual energy-efficiencies will be considered as the performance metric reflecting the individual interest of each decision maker.\n\n\n\\subsection{Energy-efficiency metric}\n\\label{sec:EnergyEfficiencyMetric}\n\nThe EE is defined in \\cite{Goodman2000} as a ratio of the net data rate to the transmit power level and is given by:\n\n", "index": 5, "text": "\\begin{equation} \n\\chi_{i}(\\mathbf{p})=\\frac{Rf(\\gamma_{i}(\\mathbf{p}))}{p_{i}},\n\\label{3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\chi_{i}(\\mathbf{p})=\\frac{Rf(\\gamma_{i}(\\mathbf{p}))}{p_{i}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>χ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>p</mi><mi>i</mi></msub></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": " \nIn \\cite{VarmaICC2012,VarmaTVT2014}, a more generalized EE metric has been developed by considering a packet arrival process following a Bernoulli process with a constant probability $q$ and a finite memory buffer of size $K$. The new EE expression is given by:\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $R$ is the transmission rate (in bit/s) while $f : \\left[0, +\\infty \\right) \\rightarrow [0,1]$ denotes the efficiency function which is sigmoidal and corresponds to the packet success rate verifying $f(0)=0$ and $\\lim\\limits_{x \\rightarrow +\\infty} f(x)=1$. Authors of \\cite{Betz2008} were the first to consider a total transmission cost of the type \\emph{radiated power} ($p_i$) $+$ \\emph{consumed power} ($b$) to design distributed power control strategies for multiple access channels \\cite{VarmaICC2012,VarmaTVT2014} as follows:\n\n", "index": 7, "text": "\\begin{equation}\n\\chi_i(\\mathbf{p}) = \\frac{Rf(\\gamma_i(\\mathbf{p}))}{b+p_i}.\n\\label{eqchi}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\chi_{i}(\\mathbf{p})=\\frac{Rf(\\gamma_{i}(\\mathbf{p}))}{b+p_{i}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>χ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>b</mi><mo>+</mo><msub><mi>p</mi><mi>i</mi></msub></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwhere the function $\\Phi$ identifies the packet loss due to both bad channel conditions and the finiteness of the packet buffer and is expressed as follows: \n\n", "itemtype": "equation", "pos": 14963, "prevtext": " \nIn \\cite{VarmaICC2012,VarmaTVT2014}, a more generalized EE metric has been developed by considering a packet arrival process following a Bernoulli process with a constant probability $q$ and a finite memory buffer of size $K$. The new EE expression is given by:\n\n", "index": 9, "text": "\\begin{equation}\n\\chi_i(\\mathbf{p}) = \\displaystyle{\\frac{Rq(1-\\Phi(\\gamma_i(\\mathbf{p})))}{b+\\displaystyle {\\frac{qp_i(1-\\Phi(\\gamma_i(\\mathbf{p})))}{f(\\gamma_i(\\mathbf{p}))}}}},\n\\label{eqEEgen}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\chi_{i}(\\mathbf{p})=\\displaystyle{\\frac{Rq(1-\\Phi(\\gamma_{i}(\\mathbf{p})))}{b%&#10;+\\displaystyle{\\frac{qp_{i}(1-\\Phi(\\gamma_{i}(\\mathbf{p})))}{f(\\gamma_{i}(%&#10;\\mathbf{p}))}}}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>χ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>b</mi><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><msub><mi>p</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwhere $\\Pi_K(\\gamma_i)$ is the stationary probability that the buffer is full and is given by:\n\n", "itemtype": "equation", "pos": 15332, "prevtext": "\nwhere the function $\\Phi$ identifies the packet loss due to both bad channel conditions and the finiteness of the packet buffer and is expressed as follows: \n\n", "index": 11, "text": "\\begin{equation}\n\\Phi(\\gamma_i)=(1-f(\\gamma_i))\\Pi_K(\\gamma_i), \n\\label{5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\Phi(\\gamma_{i})=(1-f(\\gamma_{i}))\\Pi_{K}(\\gamma_{i}),\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Π</mi><mi>K</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith:\n\n", "itemtype": "equation", "pos": 15517, "prevtext": "\nwhere $\\Pi_K(\\gamma_i)$ is the stationary probability that the buffer is full and is given by:\n\n", "index": 13, "text": "\\begin{equation}\n\\Pi_K(\\gamma_i)=\\displaystyle {\\frac{\\rho^K(\\gamma_i)}{1+\\rho(\\gamma_i)+\\ldots+\\rho^K(\\gamma_i)}},\n\\label{6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Pi_{K}(\\gamma_{i})=\\displaystyle{\\frac{\\rho^{K}(\\gamma_{i})}{1+\\rho(\\gamma_{i%&#10;})+\\ldots+\\rho^{K}(\\gamma_{i})}},\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">Π</mi><mi>K</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msup><mi>ρ</mi><mi>K</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi><mo>+</mo><mrow><msup><mi>ρ</mi><mi>K</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nIt is important to highlight that this new generalized EE given by (\\ref{eqEEgen}) includes the conventional case of (\\ref{eqchi}) when making $q\\rightarrow 1$. \\\\\n\n\\subsection{Static cross-layer power control game}\n\\label{sec:StaticCrossLayerPowerControlGame}\n\nThe static cross-layer power control game is a non-cooperative game which can be defined as a strategic form game \\cite{Lasaulce2011}.\n\\begin{definition}\n\\textit{The game is defined by the ordered triplet $\\mathcal{G} = \\bigl(\\mathcal{N}, (\\mathcal{S}_i)_{i \\in \\mathcal{N}}, \\allowbreak (u_i)_{i \\in \\mathcal{N}} \\bigr)$ where $\\mathcal{N}$ is the set of players (the $N$ transmitters), $\\mathcal{S}_1,\\ldots,\\mathcal{S}_N$ are the corresponding sets of strategies with $\\mathcal{S}_i=[0, P_i^{\\max}]$ and $u_1,\\ldots,u_N$ are the utility functions given by:}\n\n", "itemtype": "equation", "pos": 15664, "prevtext": "\nwith:\n\n", "index": 15, "text": "\\begin{equation}\n\\rho(\\gamma_i)=\\displaystyle{\\frac{q(1-f(\\gamma_i))}{(1-q)f(\\gamma_i)}}.\n\\label{7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\rho(\\gamma_{i})=\\displaystyle{\\frac{q(1-f(\\gamma_{i}))}{(1-q)f(\\gamma_{i})}}.\" display=\"block\"><mrow><mrow><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>q</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\\end{definition}\n\\textit{where $\\chi_i(\\mathbf{p})$ is given by equation (\\ref{eqEEgen}).}\n\nIn a non-cooperative game, each user (player) seeks to maximize selfishly its individual utility function. The optimum solution results then by setting $\\partial u_i/\\partial p_i$ to zero as follows:\n\n", "itemtype": "equation", "pos": 16602, "prevtext": "\nIt is important to highlight that this new generalized EE given by (\\ref{eqEEgen}) includes the conventional case of (\\ref{eqchi}) when making $q\\rightarrow 1$. \\\\\n\n\\subsection{Static cross-layer power control game}\n\\label{sec:StaticCrossLayerPowerControlGame}\n\nThe static cross-layer power control game is a non-cooperative game which can be defined as a strategic form game \\cite{Lasaulce2011}.\n\\begin{definition}\n\\textit{The game is defined by the ordered triplet $\\mathcal{G} = \\bigl(\\mathcal{N}, (\\mathcal{S}_i)_{i \\in \\mathcal{N}}, \\allowbreak (u_i)_{i \\in \\mathcal{N}} \\bigr)$ where $\\mathcal{N}$ is the set of players (the $N$ transmitters), $\\mathcal{S}_1,\\ldots,\\mathcal{S}_N$ are the corresponding sets of strategies with $\\mathcal{S}_i=[0, P_i^{\\max}]$ and $u_1,\\ldots,u_N$ are the utility functions given by:}\n\n", "index": 17, "text": "\\begin{equation}\nu_i(\\mathbf{p}) = \\chi_i(\\mathbf{p}),\n\\label{8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"u_{i}(\\mathbf{p})=\\chi_{i}(\\mathbf{p}),\" display=\"block\"><mrow><mrow><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>χ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwhere $\\gamma_i^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}{{\\mathop{}\\mathopen{}\\mathrm{d}} p_i}} = \\displaystyle{\\frac{\\gamma_i}{p_i}}$, $f^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} f}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i} }$ and $\\Phi^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\Phi}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}}$. \\\\\n\nAuthors in \\cite{VarmaICC2012,VarmaTVT2014} proved that such equation has a unique best response. In the game $\\mathcal{G}$, this best response defines the NE and is denoted as $\\mathbf{p}^{\\ast}=(p_1^{\\ast},p_2^{\\ast},\\ldots,p_N^{\\ast})$. However, the NE solution is not always Pareto-efficient for many scenarios. We highlight in Fig. \\ref{fig:achievableregion} that the NE is not on the Pareto frontier (the outer boundary of the achievable utilities region). Therefore, we are motivated to design a more efficient solution than the NE. For this, as a first step we investigate the NB solution.\n\n\n\\section{Nash bargaining solution}\n\\label{sec:NashBargainingSolution}\n\nDue to the inefficiency of the NE, a Pareto-efficient solution can be achieved by introducing the cooperation between the players. The resulting solution is called NB solution whose determination requires two elements \\cite{Abidi2007}:\n\\begin{itemize}\n\\item the region of achievable utilities formed by the set of the feasible utilities of all the players should be compact and convex \\cite{Hossain2009};\n\\item the threat point is defined by the NE of the one-shot game \\cite{Larsson2008}.\n\\end{itemize}\n\\subsection{Compactness and convexity of the achievable utilities region}\n\\label{sec:CompactnessAndConvexityOfTheAchievableUtilitiesRegion}\n\nWe denote $\\mathcal{R}$ the achievable utilities region defined as follows:\n\n", "itemtype": "equation", "pos": 16974, "prevtext": "\n\\end{definition}\n\\textit{where $\\chi_i(\\mathbf{p})$ is given by equation (\\ref{eqEEgen}).}\n\nIn a non-cooperative game, each user (player) seeks to maximize selfishly its individual utility function. The optimum solution results then by setting $\\partial u_i/\\partial p_i$ to zero as follows:\n\n", "index": 19, "text": "\\begin{equation}\nb\\gamma_i^\\prime\\Phi^\\prime(\\gamma_i)+q\\left(\\frac{1-\\Phi(\\gamma_i)}{f(\\gamma_i)}\\right)^2\\left[f(\\gamma_i)-p_i\\gamma_i^\\prime f^\\prime(\\gamma_i)\\right]=0,\n\\label{9}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"b\\gamma_{i}^{\\prime}\\Phi^{\\prime}(\\gamma_{i})+q\\left(\\frac{1-\\Phi(\\gamma_{i})}%&#10;{f(\\gamma_{i})}\\right)^{2}\\left[f(\\gamma_{i})-p_{i}\\gamma_{i}^{\\prime}f^{%&#10;\\prime}(\\gamma_{i})\\right]=0,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>γ</mi><mi>i</mi><mo>′</mo></msubsup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>q</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>p</mi><mi>i</mi></msub><mo>⁢</mo><msubsup><mi>γ</mi><mi>i</mi><mo>′</mo></msubsup><mo>⁢</mo><msup><mi>f</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nAs the strategies sets $\\mathcal{S}_1,\\ldots,\\mathcal{S}_N$ are compact since $\\mathcal{S}_i = [0,P_i^{\\max}]$ and the utility function $u_{i}$ is continuous, the region $\\mathcal{R}$ is compact for a given channel configuration \\cite{Larsson2008}. Since it is generally not convex, time-sharing has been a solution to convexify it. In order to illustrate the main idea of this technique applied to our problem, let us consider a system of 2 users \\cite{Larsson2008}. During a time fraction $\\tau$, the users use the powers $(p_1,p_2)$ to have utilities $(u_{1},u_{2})$. During a time fraction $(1-\\tau)$, they use another combination of powers $(p_1',p_2')$ to have $(u_{1}',u_{2}')$ \\cite{MhiriNov2012,Larsson2008}. Thus, the new achievable utilities region (for the 2-users system) is:\n\n", "itemtype": "equation", "pos": 18973, "prevtext": "\nwhere $\\gamma_i^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}{{\\mathop{}\\mathopen{}\\mathrm{d}} p_i}} = \\displaystyle{\\frac{\\gamma_i}{p_i}}$, $f^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} f}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i} }$ and $\\Phi^\\prime = \\displaystyle{\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\Phi}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}}$. \\\\\n\nAuthors in \\cite{VarmaICC2012,VarmaTVT2014} proved that such equation has a unique best response. In the game $\\mathcal{G}$, this best response defines the NE and is denoted as $\\mathbf{p}^{\\ast}=(p_1^{\\ast},p_2^{\\ast},\\ldots,p_N^{\\ast})$. However, the NE solution is not always Pareto-efficient for many scenarios. We highlight in Fig. \\ref{fig:achievableregion} that the NE is not on the Pareto frontier (the outer boundary of the achievable utilities region). Therefore, we are motivated to design a more efficient solution than the NE. For this, as a first step we investigate the NB solution.\n\n\n\\section{Nash bargaining solution}\n\\label{sec:NashBargainingSolution}\n\nDue to the inefficiency of the NE, a Pareto-efficient solution can be achieved by introducing the cooperation between the players. The resulting solution is called NB solution whose determination requires two elements \\cite{Abidi2007}:\n\\begin{itemize}\n\\item the region of achievable utilities formed by the set of the feasible utilities of all the players should be compact and convex \\cite{Hossain2009};\n\\item the threat point is defined by the NE of the one-shot game \\cite{Larsson2008}.\n\\end{itemize}\n\\subsection{Compactness and convexity of the achievable utilities region}\n\\label{sec:CompactnessAndConvexityOfTheAchievableUtilitiesRegion}\n\nWe denote $\\mathcal{R}$ the achievable utilities region defined as follows:\n\n", "index": 21, "text": "\\begin{equation}\n\\mathcal{R} = \\{\\left(u_{1},u_{2},\\ldots,u_N \\right)|\\left(p_{1},p_{2},\\ldots,p_N \\right)\\in \\left[0,P_i^{\\max}\\right]^N\\}.\n\\label{19}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{R}=\\{\\left(u_{1},u_{2},\\ldots,u_{N}\\right)|\\left(p_{1},p_{2},\\ldots,p%&#10;_{N}\\right)\\in\\left[0,P_{i}^{\\max}\\right]^{N}\\}.\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo>=</mo><mrow><mo stretchy=\"false\">{</mo><mrow><mo>(</mo><msub><mi>u</mi><mn>1</mn></msub><mo>,</mo><msub><mi>u</mi><mn>2</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>u</mi><mi>N</mi></msub><mo>)</mo></mrow><mo stretchy=\"false\">|</mo><mrow><mrow><mo>(</mo><msub><mi>p</mi><mn>1</mn></msub><mo>,</mo><msub><mi>p</mi><mn>2</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>p</mi><mi>N</mi></msub><mo>)</mo></mrow><mo>∈</mo><msup><mrow><mo>[</mo><mn>0</mn><mo>,</mo><msubsup><mi>P</mi><mi>i</mi><mi>max</mi></msubsup><mo>]</mo></mrow><mi>N</mi></msup></mrow><mo stretchy=\"false\">}</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nWe define $\\bar{\\mathcal{R}}^{\\ast}$ the Pareto boundary (the outer frontier) of the convex hull of $\\bar{\\mathcal{R}}$. Fig. \\ref{fig:achievableregion} shows the convexified achievable utilities region with the NE point, the NB solution and the Nash curve (both will be defined next).\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{Region1.eps}\n\\caption{Pareto-efficiency of the NB solution vs the NE.}\n\\label{fig:achievableregion}\n\\end{figure}\n\\subsection{Existence and uniqueness of the NB solution}\n\\label{sec:ExistenceAndUniquenessOfTheNBSolution}\n\nLet $\\mathcal{R}^{NB}$ define the improvement region of utilities versus the NE and it is given by:\n\n", "itemtype": "equation", "pos": 19929, "prevtext": "\nAs the strategies sets $\\mathcal{S}_1,\\ldots,\\mathcal{S}_N$ are compact since $\\mathcal{S}_i = [0,P_i^{\\max}]$ and the utility function $u_{i}$ is continuous, the region $\\mathcal{R}$ is compact for a given channel configuration \\cite{Larsson2008}. Since it is generally not convex, time-sharing has been a solution to convexify it. In order to illustrate the main idea of this technique applied to our problem, let us consider a system of 2 users \\cite{Larsson2008}. During a time fraction $\\tau$, the users use the powers $(p_1,p_2)$ to have utilities $(u_{1},u_{2})$. During a time fraction $(1-\\tau)$, they use another combination of powers $(p_1',p_2')$ to have $(u_{1}',u_{2}')$ \\cite{MhiriNov2012,Larsson2008}. Thus, the new achievable utilities region (for the 2-users system) is:\n\n", "index": 23, "text": "\\begin{equation}\n\\begin{aligned}\n\\bar{\\mathcal{R}} = &\\{\\left(\\tau u_{1}+(1-\\tau)u_{1}',\\tau u_{2}+(1-\\tau)u_{2}'\\right)\\\\\n&|0 \\leq \\tau \\leq 1,\\; \\left(u_{1},u_{2}\\right)\\in \\mathcal{R},\\; \\left(u_{1}',u_{2}'\\right)\\in \\mathcal{R}\\}.\n\\end{aligned}\n\\label{20}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\bar{\\mathcal{R}}=\" display=\"inline\"><mrow><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">¯</mo></mover><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\{\\left(\\tau u_{1}+(1-\\tau)u_{1}^{\\prime},\\tau u_{2}+(1-\\tau)u_{2%&#10;}^{\\prime}\\right)\" display=\"inline\"><mrow><mo stretchy=\"false\">{</mo><mrow><mo>(</mo><mi>τ</mi><msub><mi>u</mi><mn>1</mn></msub><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><msubsup><mi>u</mi><mn>1</mn><mo>′</mo></msubsup><mo>,</mo><mi>τ</mi><msub><mi>u</mi><mn>2</mn></msub><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><msubsup><mi>u</mi><mn>2</mn><mo>′</mo></msubsup><mo>)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle|0\\leq\\tau\\leq 1,\\;\\left(u_{1},u_{2}\\right)\\in\\mathcal{R},\\;\\left%&#10;(u_{1}^{\\prime},u_{2}^{\\prime}\\right)\\in\\mathcal{R}\\}.\" display=\"inline\"><mrow><mo stretchy=\"false\">|</mo><mn>0</mn><mo>≤</mo><mi>τ</mi><mo>≤</mo><mn>1</mn><mo rspace=\"5.3pt\">,</mo><mrow><mo>(</mo><msub><mi>u</mi><mn>1</mn></msub><mo>,</mo><msub><mi>u</mi><mn>2</mn></msub><mo>)</mo></mrow><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo rspace=\"5.3pt\">,</mo><mrow><mo>(</mo><msubsup><mi>u</mi><mn>1</mn><mo>′</mo></msubsup><mo>,</mo><msubsup><mi>u</mi><mn>2</mn><mo>′</mo></msubsup><mo>)</mo></mrow><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo stretchy=\"false\">}</mo><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nThe NB solution belongs to the region $\\mathcal{R}^{NB}$. Here, in the power control game $\\mathcal{G}$, there exists a unique NB solution denoted as $\\mathbf{u}^{NB}=(u_1^{NB},u_2^{NB},\\ldots,u_N^{NB})$ and is given by \\cite{Hossain2009}:\n\n", "itemtype": "equation", "pos": 20870, "prevtext": "\nWe define $\\bar{\\mathcal{R}}^{\\ast}$ the Pareto boundary (the outer frontier) of the convex hull of $\\bar{\\mathcal{R}}$. Fig. \\ref{fig:achievableregion} shows the convexified achievable utilities region with the NE point, the NB solution and the Nash curve (both will be defined next).\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{Region1.eps}\n\\caption{Pareto-efficiency of the NB solution vs the NE.}\n\\label{fig:achievableregion}\n\\end{figure}\n\\subsection{Existence and uniqueness of the NB solution}\n\\label{sec:ExistenceAndUniquenessOfTheNBSolution}\n\nLet $\\mathcal{R}^{NB}$ define the improvement region of utilities versus the NE and it is given by:\n\n", "index": 25, "text": "\\begin{equation}\n\\mathcal{R}^{NB} = \\{u_{i}\\geq u_{i}^{NE} | i \\in [1,\\ldots,N]\\}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{R}^{NB}=\\{u_{i}\\geq u_{i}^{NE}|i\\in[1,\\ldots,N]\\}.\" display=\"block\"><mrow><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mrow><mi>N</mi><mo>⁢</mo><mi>B</mi></mrow></msup><mo>=</mo><mrow><mo stretchy=\"false\">{</mo><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>≥</mo><msubsup><mi>u</mi><mi>i</mi><mrow><mi>N</mi><mo>⁢</mo><mi>E</mi></mrow></msubsup></mrow><mo stretchy=\"false\">|</mo><mrow><mi>i</mi><mo>∈</mo><mrow><mo stretchy=\"false\">[</mo><mn>1</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mi>N</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo stretchy=\"false\">}</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nSince the NE can always be reached and the achievable utility region is a compact convex set, the NB solution exists. It is unique since it verifies certain axioms: individual rationality and feasibility, independence of irrelevant alternatives, symmetry, Pareto optimality (efficiency) and independence of linear transformations \\cite{Hossain2009}. \nThe NB solution results from the intersection of the Pareto boundary ($\\bar{\\mathcal{R}}^{\\ast}$) with the Nash curve whose form is $m=\\prod_{i=1}^{N}(u_{i}-u_{i}^{NE})$ where $m$ is a constant chosen such that there is precisely one intersection point \\cite{Larsson2008} (see Fig. \\ref{fig:achievableregion}). \nAlthough the NB solution is Pareto-efficient, it generally requires global CSI at the transmitters due to the Nash product $(m)$ introducing all the users utilities \\cite{MhiriNov2012}. For this reason, we are looking for another efficient solution through the study of the dynamic RG.\n\n\\section{Repeated games formulation}\n\\label{sec:RepeatedGamesFormulation}\n\n\nRG consist in their standard formulation, in repeating the same static game at every time instance and the players seek to maximize their utility averaged over the whole game duration \\cite{Lasaulce2009}. Repetition allows efficient equilibrium points to be implemented and which can be predicted from the one-shot static game according to the Folk theorem, which provides the set of possible Nash equilibria of the repeated game \\cite{LeTreust2010,Friedman1971}. In a repeated game, certain agreements between players on a common cooperation plan and a punishment policy can be implemented to punish the deviators \\cite{Lasaulce2009}. In what follows, we introduce the new OP and characterize the two RG models. \n\n\\subsection{New OP}\n\\label{sec:NewOP}\n\nThe new OP consists in setting $p_i|g_{i}|^2$ to a constant $\\alpha$ which is unique when maximizing the expected sum utility over all the channel states. It is given by \\cite{Mhiri2013}:\n\n", "itemtype": "equation", "pos": 21208, "prevtext": "\nThe NB solution belongs to the region $\\mathcal{R}^{NB}$. Here, in the power control game $\\mathcal{G}$, there exists a unique NB solution denoted as $\\mathbf{u}^{NB}=(u_1^{NB},u_2^{NB},\\ldots,u_N^{NB})$ and is given by \\cite{Hossain2009}:\n\n", "index": 27, "text": "\\begin{equation}\n\\mathbf{u}^{NB}=\\max_{\\substack{u_{i} \\in \\mathcal{R}^{NB} \\\\ i \\in [1,\\ldots,N]}} \\prod_{i=1}^{N}{(u_{i}-u_{i}^{NE})},\n\\label{30}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{u}^{NB}=\\max_{\\begin{subarray}{c}u_{i}\\in\\mathcal{R}^{NB}\\\\&#10;i\\in[1,\\ldots,N]\\end{subarray}}\\prod_{i=1}^{N}{(u_{i}-u_{i}^{NE})},\" display=\"block\"><mrow><mrow><msup><mi>𝐮</mi><mrow><mi>N</mi><mo>⁢</mo><mi>B</mi></mrow></msup><mo>=</mo><mrow><munder><mi>max</mi><mtable class=\"ltx_align_c\" rowspacing=\"0.0pt\"><mtr><mtd><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>∈</mo><msup><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mrow><mi>N</mi><mo>⁢</mo><mi>B</mi></mrow></msup></mrow></mtd></mtr><mtr><mtd><mrow><mi>i</mi><mo>∈</mo><mrow><mo stretchy=\"false\">[</mo><mn>1</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mi>N</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr></mtable></munder><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>u</mi><mi>i</mi><mrow><mi>N</mi><mo>⁢</mo><mi>E</mi></mrow></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": " \nThe power of the $i^{th}$ player is then deduced as follows:\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nSince the NE can always be reached and the achievable utility region is a compact convex set, the NB solution exists. It is unique since it verifies certain axioms: individual rationality and feasibility, independence of irrelevant alternatives, symmetry, Pareto optimality (efficiency) and independence of linear transformations \\cite{Hossain2009}. \nThe NB solution results from the intersection of the Pareto boundary ($\\bar{\\mathcal{R}}^{\\ast}$) with the Nash curve whose form is $m=\\prod_{i=1}^{N}(u_{i}-u_{i}^{NE})$ where $m$ is a constant chosen such that there is precisely one intersection point \\cite{Larsson2008} (see Fig. \\ref{fig:achievableregion}). \nAlthough the NB solution is Pareto-efficient, it generally requires global CSI at the transmitters due to the Nash product $(m)$ introducing all the users utilities \\cite{MhiriNov2012}. For this reason, we are looking for another efficient solution through the study of the dynamic RG.\n\n\\section{Repeated games formulation}\n\\label{sec:RepeatedGamesFormulation}\n\n\nRG consist in their standard formulation, in repeating the same static game at every time instance and the players seek to maximize their utility averaged over the whole game duration \\cite{Lasaulce2009}. Repetition allows efficient equilibrium points to be implemented and which can be predicted from the one-shot static game according to the Folk theorem, which provides the set of possible Nash equilibria of the repeated game \\cite{LeTreust2010,Friedman1971}. In a repeated game, certain agreements between players on a common cooperation plan and a punishment policy can be implemented to punish the deviators \\cite{Lasaulce2009}. In what follows, we introduce the new OP and characterize the two RG models. \n\n\\subsection{New OP}\n\\label{sec:NewOP}\n\nThe new OP consists in setting $p_i|g_{i}|^2$ to a constant $\\alpha$ which is unique when maximizing the expected sum utility over all the channel states. It is given by \\cite{Mhiri2013}:\n\n", "index": 29, "text": "\\begin{equation}\n\\tilde{\\alpha} = \\arg \\max_{\\alpha} \\mathbb{E}_{g} \\left[\\sum_{i=1}^{N}{u_i(\\mathbf{p})}\\right].\n\\label{14}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\tilde{\\alpha}=\\arg\\max_{\\alpha}\\mathbb{E}_{g}\\left[\\sum_{i=1}^{N}{u_{i}(%&#10;\\mathbf{p})}\\right].\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>=</mo><mrow><mrow><mi>arg</mi><mo>⁡</mo><mrow><munder><mi>max</mi><mi>α</mi></munder><mo>⁡</mo><msub><mi>𝔼</mi><mi>g</mi></msub></mrow></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": " \n\nThe new OP Pareto-dominates the NE and relies on individual CSI at the transmitter. In order to implement a cooperation plan between the players, we assume in addition to the individual CSI assumption, that every player is able to know the power of the received signal at each game stage, which is denoted by \\cite{LeTreust2010}:\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nThe power of the $i^{th}$ player is then deduced as follows:\n\n", "index": 31, "text": "\\begin{equation}\n\\tilde{p}_i = \\displaystyle{\\frac{\\tilde{\\alpha}}{|g_{i}|^2}}.\n\\label{15}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\tilde{p}_{i}=\\displaystyle{\\frac{\\tilde{\\alpha}}{|g_{i}|^{2}}}.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>p</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo>=</mo><mfrac><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nWhen assuming that $p_{i}|g_{i}|^2$ is set to the constant $\\alpha$, the received signal power can be written as:\n\n", "itemtype": "equation", "pos": 23980, "prevtext": " \n\nThe new OP Pareto-dominates the NE and relies on individual CSI at the transmitter. In order to implement a cooperation plan between the players, we assume in addition to the individual CSI assumption, that every player is able to know the power of the received signal at each game stage, which is denoted by \\cite{LeTreust2010}:\n\n", "index": 33, "text": "\\begin{equation}\nP_y = \\sigma^{2} + \\sum_{\\substack{i=1}}^{N} p_{i}|g_{i}|^2. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"P_{y}=\\sigma^{2}+\\sum_{\\begin{subarray}{c}i=1\\end{subarray}}^{N}p_{i}|g_{i}|^{%&#10;2}.\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mi>y</mi></msub><mo>=</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mtable class=\"ltx_align_c\"><mtr><mtd><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow></mtd></mtr></mtable><mi>N</mi></munderover><mrow><msub><mi>p</mi><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nAccordingly, each transmitter needs only its individual SINR and the constant $\\alpha$ (depending only on $p_i$ and $|g_{i}|^2$) to establish the received signal power $P_y$. We assume that the data transmission is over block fading channels and that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}. Thus, the interval to which the received signal power belongs, is $\\displaystyle{\\Delta = \\bigg[\\sigma^2, \\sigma^2 + \\sum_{\\substack{i=1}}^{N} p_{i}\\nu_i^{\\max}\\bigg]}$. Since the players detect a variation of the received signal power, a deviation from the cooperation plan has occurred. Indeed, when playing at the new OP, the received signal power is constant and equal to $\\displaystyle{\\frac{\\sigma^2(\\tilde{\\gamma}+1)}{1-(N-1)\\tilde{\\gamma}}}$. Consequently, when any player deviates from the new OP, the latter quantity changes and the deviation is then detected \\cite{LeTreust2010}.\n\n\\subsection{Repeated games characterization}\n\\label{sec:RepeatedGamesCharacterization}\n\nA RG is a long-term interaction game where players react to past experience by taking into account what happened in all previous stages and make decisions about their future choices \\cite{Hart2006,Sorin1992}. The resulting payoff is an average over all the stage payoffs. \nWe denote by $t$, the game stage which corresponds to the instant in which all players choose their actions. Accordingly, a profile of actions can be defined for all players as $\\mathbf{p}(t)=(p_1(t),\\allowbreak p_2(t),\\ldots,p_N(t))$. A history $\\mathbf{h}(t)$ of player $i$ at time $t$ is the pair of vectors $(P_{y,t},p_{i,t}) = (P_y(1),P_y(2), \\allowbreak  \\ldots,P_y(t-1),p_i(1),p_i(2),\\ldots,p_i(t-1))$ and which lies in the set $\\mathcal{H}_t = (\\Delta^{t-1},\\mathcal{P}_i^{t-1})$ with $\\mathcal{P}_i = [0,P_i^{\\max}] = [0,P^{\\max}]$ (as all the users have the same maximum power) \\cite{LeTreust2010}. Histories are fundamental in RG as they allow players to coordinate their behavior at each stage so that previous histories are known by all the players \\cite{Sorin1992}. We denote $\\delta_{i,t}$ the pure strategy of the $i^{th}$ player. It defines the action to select after each history \\cite{LeTreust2010,Sorin1992}: \n\n", "itemtype": "equation", "pos": 24188, "prevtext": "\nWhen assuming that $p_{i}|g_{i}|^2$ is set to the constant $\\alpha$, the received signal power can be written as:\n\n", "index": 35, "text": "\\begin{equation}\nP_y = \\alpha\\frac{\\gamma_i + 1}{\\gamma_i}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"P_{y}=\\alpha\\frac{\\gamma_{i}+1}{\\gamma_{i}}.\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mi>y</mi></msub><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><mfrac><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>+</mo><mn>1</mn></mrow><msub><mi>γ</mi><mi>i</mi></msub></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nIn RG literature, there are two important models \\cite{Lasaulce2011}:\n\\begin{itemize}\n\\item the finite RG where the number of stages of the game (denoted as $T\\geq 1$) during which the players interact is finite; \n\\item the discounted RG where the discount factor (denoted as $\\lambda \\in ]0,1[$) is seen as the stopping probability at each stage. \n\\end{itemize}\nThe utility function of each player results from averaging over the instantaneous utilities over all the game stages in the FRG while it is a geometric average of the instantaneous utilities during the game stages in the DRG \\cite{LeTreust2010,Sorin1992,Aumann1994}. We denote $\\boldsymbol{\\delta}=(\\delta_1,\\delta_2,\\ldots,\\delta_N)$ the joint strategy of all players.\n\n\\begin{definition}\n\\textit{A joint strategy $\\boldsymbol{\\delta}$ satisfies the equilibrium condition for the repeated game defined by $\\bigl(\\mathcal{N}, (\\mathcal{S}_i)_{i \\in \\mathcal{N}}, (v_i)_{i \\in \\mathcal{N}} \\bigr)$ if $\\forall i \\in \\mathcal{N}$, $\\forall \\delta'_i$, $v_i(\\boldsymbol{\\delta}) \\geq v_i(\\delta'_i, \\boldsymbol{\\delta}_{-i})$ with $v_i = v_i^T$ for the FRG or $v_i = v_i^{\\lambda}$ for the DRG such that:}\n\n", "itemtype": "equation", "pos": 26494, "prevtext": "\nAccordingly, each transmitter needs only its individual SINR and the constant $\\alpha$ (depending only on $p_i$ and $|g_{i}|^2$) to establish the received signal power $P_y$. We assume that the data transmission is over block fading channels and that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}. Thus, the interval to which the received signal power belongs, is $\\displaystyle{\\Delta = \\bigg[\\sigma^2, \\sigma^2 + \\sum_{\\substack{i=1}}^{N} p_{i}\\nu_i^{\\max}\\bigg]}$. Since the players detect a variation of the received signal power, a deviation from the cooperation plan has occurred. Indeed, when playing at the new OP, the received signal power is constant and equal to $\\displaystyle{\\frac{\\sigma^2(\\tilde{\\gamma}+1)}{1-(N-1)\\tilde{\\gamma}}}$. Consequently, when any player deviates from the new OP, the latter quantity changes and the deviation is then detected \\cite{LeTreust2010}.\n\n\\subsection{Repeated games characterization}\n\\label{sec:RepeatedGamesCharacterization}\n\nA RG is a long-term interaction game where players react to past experience by taking into account what happened in all previous stages and make decisions about their future choices \\cite{Hart2006,Sorin1992}. The resulting payoff is an average over all the stage payoffs. \nWe denote by $t$, the game stage which corresponds to the instant in which all players choose their actions. Accordingly, a profile of actions can be defined for all players as $\\mathbf{p}(t)=(p_1(t),\\allowbreak p_2(t),\\ldots,p_N(t))$. A history $\\mathbf{h}(t)$ of player $i$ at time $t$ is the pair of vectors $(P_{y,t},p_{i,t}) = (P_y(1),P_y(2), \\allowbreak  \\ldots,P_y(t-1),p_i(1),p_i(2),\\ldots,p_i(t-1))$ and which lies in the set $\\mathcal{H}_t = (\\Delta^{t-1},\\mathcal{P}_i^{t-1})$ with $\\mathcal{P}_i = [0,P_i^{\\max}] = [0,P^{\\max}]$ (as all the users have the same maximum power) \\cite{LeTreust2010}. Histories are fundamental in RG as they allow players to coordinate their behavior at each stage so that previous histories are known by all the players \\cite{Sorin1992}. We denote $\\delta_{i,t}$ the pure strategy of the $i^{th}$ player. It defines the action to select after each history \\cite{LeTreust2010,Sorin1992}: \n\n", "index": 37, "text": "\\begin{equation}\n\\delta_{i,t} = \\left | \\begin{array}{rcl}\n\\mathcal{H}_t & \\rightarrow & [0, P_i^{\\max}]\\\\\n\\mathbf{h}(t) & \\mapsto & p_i(t)\n\\end{array} \\right.\n\\label{8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\delta_{i,t}=\\left|\\begin{array}[]{rcl}\\mathcal{H}_{t}&amp;\\rightarrow&amp;[0,P_{i}^{%&#10;\\max}]\\\\&#10;\\mathbf{h}(t)&amp;\\mapsto&amp;p_{i}(t)\\end{array}\\right.\" display=\"block\"><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><mi>t</mi></mrow></msub><mo>=</mo><mo>|</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mi>t</mi></msub></mtd><mtd columnalign=\"center\"><mo>→</mo></mtd><mtd columnalign=\"left\"><mrow><mo stretchy=\"false\">[</mo><mn>0</mn><mo>,</mo><msubsup><mi>P</mi><mi>i</mi><mi>max</mi></msubsup><mo stretchy=\"false\">]</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>𝐡</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"center\"><mo>↦</mo></mtd><mtd columnalign=\"left\"><mrow><msub><mi>p</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\\end{definition}\n\nIn RG with complete information and full monitoring, the Folk theorem characterizes the set of possible equilibrium utilities. It ensures that the set of NE in a RG is precisely the set of feasible and individually rational outcomes of the one-shot game \\cite{Hart2006,Sorin1992}. A cooperation/punishment plan is established between the players before playing \\cite{LeTreust2010}. The players cooperate by always transmitting at the new OP with powers $\\tilde{p}_i$. When the power of the received signal changes, a deviation is then detected and the players punish the deviator by transmitting with their maximum transmit power $P_i^{\\max}$ in the FRG and by playing at the one-shot game in the DRG. In what follows, we give the equilibrium solution of each repeated game model and mention the corresponding algorithm \\cite{Xu2012,Li2010,Song2011}. It is important to note that in contrast with iterative algorithms (e.g., iterative water-filling type algorithms), there is no convergence problem in repeated games (FRG and DRG). Indeed, the transmitters implement an equilibrium strategy (referred to as the operating point) at every stage of the repeated game.\n\n\n\\subsubsection{Finite RG}\n\\label{sec:FiniteRG}\n\nThe FRG is characterized by the minimum number of stages ($T_{\\min}$). If the number of stages in the game $T$ verifies $T>T_{\\min}$, a more efficient equilibrium point can be reached. However, if it is less than $T_{\\min}$, the NE is then played. Assuming that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}, we have the following proposition \\cite{Mhiri2013}:\n\n\\begin{proposition}[FRG equilibrium]:\nWhen supposing the following condition is met: $T\\geq T_{\\min}$ with:\n\n", "itemtype": "equation", "pos": 27845, "prevtext": "\nIn RG literature, there are two important models \\cite{Lasaulce2011}:\n\\begin{itemize}\n\\item the finite RG where the number of stages of the game (denoted as $T\\geq 1$) during which the players interact is finite; \n\\item the discounted RG where the discount factor (denoted as $\\lambda \\in ]0,1[$) is seen as the stopping probability at each stage. \n\\end{itemize}\nThe utility function of each player results from averaging over the instantaneous utilities over all the game stages in the FRG while it is a geometric average of the instantaneous utilities during the game stages in the DRG \\cite{LeTreust2010,Sorin1992,Aumann1994}. We denote $\\boldsymbol{\\delta}=(\\delta_1,\\delta_2,\\ldots,\\delta_N)$ the joint strategy of all players.\n\n\\begin{definition}\n\\textit{A joint strategy $\\boldsymbol{\\delta}$ satisfies the equilibrium condition for the repeated game defined by $\\bigl(\\mathcal{N}, (\\mathcal{S}_i)_{i \\in \\mathcal{N}}, (v_i)_{i \\in \\mathcal{N}} \\bigr)$ if $\\forall i \\in \\mathcal{N}$, $\\forall \\delta'_i$, $v_i(\\boldsymbol{\\delta}) \\geq v_i(\\delta'_i, \\boldsymbol{\\delta}_{-i})$ with $v_i = v_i^T$ for the FRG or $v_i = v_i^{\\lambda}$ for the DRG such that:}\n\n", "index": 39, "text": "\\begin{align}\nv_i^{T}(\\boldsymbol{\\delta})=   & \\frac{1}{T}\\sum_{t=1}^{T}u_i(\\mathbf{p}(t)) & \\mbox{  for the FRG}\\\\\nv_i^{\\lambda}(\\boldsymbol{\\delta})= &\\sum_{t=1}^{+\\infty}\\lambda(1-\\lambda)^{t-1}u_i(\\mathbf{p}(t)) & \\mbox{  for the DRG}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle v_{i}^{T}(\\bm{\\delta})=\" display=\"inline\"><mrow><mrow><msubsup><mi>v</mi><mi>i</mi><mi>T</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{1}{T}\\sum_{t=1}^{T}u_{i}(\\mathbf{p}(t))\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>T</mi></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>=</mo><mn>1</mn></mrow><mi>T</mi></munderover></mstyle><mrow><msub><mi>u</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle v_{i}^{\\lambda}(\\bm{\\delta})=\" display=\"inline\"><mrow><mrow><msubsup><mi>v</mi><mi>i</mi><mi>λ</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{t=1}^{+\\infty}\\lambda(1-\\lambda)^{t-1}u_{i}(\\mathbf{p}(t))\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>=</mo><mn>1</mn></mrow><mrow><mo>+</mo><mi mathvariant=\"normal\">∞</mi></mrow></munderover></mstyle><mrow><mi>λ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>t</mi><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msub><mi>u</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nsuch that:\n\n", "itemtype": "equation", "pos": 29850, "prevtext": "\n\\end{definition}\n\nIn RG with complete information and full monitoring, the Folk theorem characterizes the set of possible equilibrium utilities. It ensures that the set of NE in a RG is precisely the set of feasible and individually rational outcomes of the one-shot game \\cite{Hart2006,Sorin1992}. A cooperation/punishment plan is established between the players before playing \\cite{LeTreust2010}. The players cooperate by always transmitting at the new OP with powers $\\tilde{p}_i$. When the power of the received signal changes, a deviation is then detected and the players punish the deviator by transmitting with their maximum transmit power $P_i^{\\max}$ in the FRG and by playing at the one-shot game in the DRG. In what follows, we give the equilibrium solution of each repeated game model and mention the corresponding algorithm \\cite{Xu2012,Li2010,Song2011}. It is important to note that in contrast with iterative algorithms (e.g., iterative water-filling type algorithms), there is no convergence problem in repeated games (FRG and DRG). Indeed, the transmitters implement an equilibrium strategy (referred to as the operating point) at every stage of the repeated game.\n\n\n\\subsubsection{Finite RG}\n\\label{sec:FiniteRG}\n\nThe FRG is characterized by the minimum number of stages ($T_{\\min}$). If the number of stages in the game $T$ verifies $T>T_{\\min}$, a more efficient equilibrium point can be reached. However, if it is less than $T_{\\min}$, the NE is then played. Assuming that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}, we have the following proposition \\cite{Mhiri2013}:\n\n\\begin{proposition}[FRG equilibrium]:\nWhen supposing the following condition is met: $T\\geq T_{\\min}$ with:\n\n", "index": 41, "text": "\\begin{equation}\nT_{\\min} = \\left\\lceil \\frac{\\Theta}{\\Lambda-\\Omega}\\right\\rceil,\n\\label{17}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"T_{\\min}=\\left\\lceil\\frac{\\Theta}{\\Lambda-\\Omega}\\right\\rceil,\" display=\"block\"><mrow><mrow><msub><mi>T</mi><mi>min</mi></msub><mo>=</mo><mrow><mo>⌈</mo><mfrac><mi mathvariant=\"normal\">Θ</mi><mrow><mi mathvariant=\"normal\">Λ</mi><mo>-</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mfrac><mo>⌉</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nThen, the NE corresponding to the $T$-stage FRG is given by the following action plan for any $(T,T_{\\min})$ and $\\forall t \\geq 1$:\n\n", "itemtype": "equation", "pos": 29970, "prevtext": "\nsuch that:\n\n", "index": 43, "text": "\\begin{equation*}\n\\begin{array}{lcl}\n\\Theta & = & \\displaystyle{\\frac{A\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\bar{\\gamma}_i\\sigma^2B}}- \\frac{G\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\tilde{\\alpha}H}}}\\\\\n\n\\Lambda & = & \\displaystyle{\\frac{E\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\gamma_i^{\\ast}\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\ast} \\nu_i^{\\max}}\\right)F}}}\\\\\n\n\\Omega & = & \\displaystyle{\\frac{C\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\widehat{\\gamma}_i\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\max} \\nu_i^{\\max}}\\right)D}}}\\\\\n\\end{array}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}\\Theta&amp;=&amp;\\displaystyle{\\frac{A\\nu_{i}^{\\max}}{{b\\nu_{i}^{%&#10;\\min}+\\bar{\\gamma}_{i}\\sigma^{2}B}}-\\frac{G\\nu_{i}^{\\max}}{{b\\nu_{i}^{\\min}+%&#10;\\tilde{\\alpha}H}}}\\\\&#10;\\par&#10;\\Lambda&amp;=&amp;\\displaystyle{\\frac{E\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\gamma_{i%&#10;}^{\\ast}\\left(\\sigma^{2}+\\sum_{j\\neq i}{p_{j}^{\\ast}\\nu_{i}^{\\max}}\\right)F}}}%&#10;\\\\&#10;\\par&#10;\\Omega&amp;=&amp;\\displaystyle{\\frac{C\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\widehat{%&#10;\\gamma}_{i}\\left(\\sigma^{2}+\\sum_{j\\neq i}{p_{j}^{\\max}\\nu_{i}^{\\max}}\\right)D%&#10;}}}\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Θ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>A</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mi>B</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Λ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>E</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mo>∗</mo></msubsup><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>F</mi></mrow></mrow></mfrac></mtd></mtr><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Ω</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>C</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo>^</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mi>max</mi></msubsup><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>D</mi></mrow></mrow></mfrac></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\\end{proposition} \n\nThe quantities $A$, $B$, $C$, $D$, $E$, $F$, $G$ and $H$ are defined in App. A and $\\gamma_i^{\\ast}$ is the SINR at the NE while $\\bar{\\gamma}_i$ and $\\widehat{\\gamma_i}$ are the SINRs related to the maximal utility and the utility min-max respectively (the proof of this proposition is detailed in \\cite{Mhiri2013}). The corresponding algorithm is as follows.\n\\vspace{0.3cm}\\\\\n\\begin{tabular*}{1\\textwidth}{l}\n  \\hline\n  \\makebox[\\linewidth][l]{\\textbf{Algorithm $1$:} FRG Algorithm}\\\\\n  \\hline\n$1)$  Each user transmits at the new OP with power $\\tilde{p}_i$ during the first phase \\\\\n\\hspace{0.28cm} of the game $t \\in \\{1,2,\\ldots,T-T_{\\min}\\}$.\\\\\n$2)$ In the second phase $t \\in \\{T-T_{\\min}+1,\\ldots,T\\}$, each user plays the NE. \\\\\n\\hspace{0.28cm} As the FRG has a finite number of stages, this phase ensures the \\\\\n\\hspace{0.28cm} punishment of the deviator for two reasons \\cite{LeTreust2010}:\\\\\n\n\\hspace{0.58cm} $\\diamond$ if it deviates at the last stage, it cannot therefore be punished;\\\\\n\\hspace{0.58cm} $\\diamond$ if it deviates earlier, the punishment can be not sufficiently severe.\\\\\n\n$3)$ The power of the received signal is assumed to be constant during the \\\\\n\\hspace{0.28cm} first phase. When it changes, a deviation is then detected.\\\\\n$4)$ The deviator is punished by other transmitters by playing at their \\\\\n\\hspace{0.28cm} maximum transmit power $P_i^{\\max}$.\\\\\n\\hline\n\\end{tabular*}\n\n\\subsubsection{Discounted RG}\n\\label{sec:DiscountedRG}\n\nIn the DRG, the probability that the game stops at stage $t$ is $\\lambda(1-\\lambda)^{t-1}$ with $\\lambda \\in ]0,1[$ defines the discount factor \\cite{Lasaulce2011}. Accordingly, we can express the analytic form of the maximum discount factor in a DRG when assuming that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}.\n\n\\begin{proposition}[DRG equilibrium]:\nWhen assuming the following condition is met: \n\n", "itemtype": "equation", "pos": 30615, "prevtext": "\nThen, the NE corresponding to the $T$-stage FRG is given by the following action plan for any $(T,T_{\\min})$ and $\\forall t \\geq 1$:\n\n", "index": 45, "text": "\\begin{equation}\n\\delta_{i,t} : \\left | \\begin{array}{ll}\n\\tilde{p}_i & \\mbox{ for }t \\in \\{1,2,\\ldots,T-T_{\\min}\\}\\\\\np_i^{\\ast} & \\mbox{ for }t \\in \\{T-T_{\\min}+1,\\ldots,T\\}\\\\\nP_i^{\\max} & \\mbox{ for any deviation detection}\n\\end{array} \\right.\n\\label{18}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\delta_{i,t}:\\left|\\begin{array}[]{ll}\\tilde{p}_{i}&amp;\\mbox{ for }t\\in\\{1,2,%&#10;\\ldots,T-T_{\\min}\\}\\\\&#10;p_{i}^{\\ast}&amp;\\mbox{ for }t\\in\\{T-T_{\\min}+1,\\ldots,T\\}\\\\&#10;P_{i}^{\\max}&amp;\\mbox{ for any deviation detection}\\end{array}\\right.\" display=\"block\"><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><mi>t</mi></mrow></msub><mo>:</mo><mo>|</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><msub><mover accent=\"true\"><mi>p</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext> for </mtext><mo>⁢</mo><mi>t</mi></mrow><mo>∈</mo><mrow><mo stretchy=\"false\">{</mo><mn>1</mn><mo>,</mo><mn>2</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><mi>T</mi><mo>-</mo><msub><mi>T</mi><mi>min</mi></msub></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><msubsup><mi>p</mi><mi>i</mi><mo>∗</mo></msubsup></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext> for </mtext><mo>⁢</mo><mi>t</mi></mrow><mo>∈</mo><mrow><mo stretchy=\"false\">{</mo><mrow><mrow><mi>T</mi><mo>-</mo><msub><mi>T</mi><mi>min</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">}</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><msubsup><mi>P</mi><mi>i</mi><mi>max</mi></msubsup></mtd><mtd columnalign=\"left\"><mtext> for any deviation detection</mtext></mtd></mtr></mtable></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith:\n\n", "itemtype": "equation", "pos": 32828, "prevtext": "\n\\end{proposition} \n\nThe quantities $A$, $B$, $C$, $D$, $E$, $F$, $G$ and $H$ are defined in App. A and $\\gamma_i^{\\ast}$ is the SINR at the NE while $\\bar{\\gamma}_i$ and $\\widehat{\\gamma_i}$ are the SINRs related to the maximal utility and the utility min-max respectively (the proof of this proposition is detailed in \\cite{Mhiri2013}). The corresponding algorithm is as follows.\n\\vspace{0.3cm}\\\\\n\\begin{tabular*}{1\\textwidth}{l}\n  \\hline\n  \\makebox[\\linewidth][l]{\\textbf{Algorithm $1$:} FRG Algorithm}\\\\\n  \\hline\n$1)$  Each user transmits at the new OP with power $\\tilde{p}_i$ during the first phase \\\\\n\\hspace{0.28cm} of the game $t \\in \\{1,2,\\ldots,T-T_{\\min}\\}$.\\\\\n$2)$ In the second phase $t \\in \\{T-T_{\\min}+1,\\ldots,T\\}$, each user plays the NE. \\\\\n\\hspace{0.28cm} As the FRG has a finite number of stages, this phase ensures the \\\\\n\\hspace{0.28cm} punishment of the deviator for two reasons \\cite{LeTreust2010}:\\\\\n\n\\hspace{0.58cm} $\\diamond$ if it deviates at the last stage, it cannot therefore be punished;\\\\\n\\hspace{0.58cm} $\\diamond$ if it deviates earlier, the punishment can be not sufficiently severe.\\\\\n\n$3)$ The power of the received signal is assumed to be constant during the \\\\\n\\hspace{0.28cm} first phase. When it changes, a deviation is then detected.\\\\\n$4)$ The deviator is punished by other transmitters by playing at their \\\\\n\\hspace{0.28cm} maximum transmit power $P_i^{\\max}$.\\\\\n\\hline\n\\end{tabular*}\n\n\\subsubsection{Discounted RG}\n\\label{sec:DiscountedRG}\n\nIn the DRG, the probability that the game stops at stage $t$ is $\\lambda(1-\\lambda)^{t-1}$ with $\\lambda \\in ]0,1[$ defines the discount factor \\cite{Lasaulce2011}. Accordingly, we can express the analytic form of the maximum discount factor in a DRG when assuming that channel gains $|g_i|^2$ lie in a compact set $[\\nu_i^{\\min}, \\nu_i^{\\max}]$ \\cite{LeTreust2010}.\n\n\\begin{proposition}[DRG equilibrium]:\nWhen assuming the following condition is met: \n\n", "index": 47, "text": "\\begin{equation}\n{\\lambda \\leq \\frac{\\Psi}{\\Gamma+\\Psi}},\n\\label{17}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"{\\lambda\\leq\\frac{\\Psi}{\\Gamma+\\Psi}},\" display=\"block\"><mrow><mrow><mi>λ</mi><mo>≤</mo><mfrac><mi mathvariant=\"normal\">Ψ</mi><mrow><mi mathvariant=\"normal\">Γ</mi><mo>+</mo><mi mathvariant=\"normal\">Ψ</mi></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nThen, the NE corresponding to the DRG is given by the following action plan $\\forall t \\geq 1$:\n\n", "itemtype": "equation", "pos": 32918, "prevtext": "\nwith:\n\n", "index": 49, "text": "\\begin{equation*}\n\\begin{array}{lcl}\n\\Gamma & = & \\displaystyle{\\frac{A\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\bar{\\gamma}_i\\sigma^2B}} - \\frac{G\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\tilde{\\alpha}H}}}\\\\\n\\Psi & = & \\displaystyle{\\frac{G\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\tilde{\\alpha}H}}-\\frac{E\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\gamma_i^{\\ast}\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\ast} \\nu_i^{\\max}}\\right)F}}}\n\\end{array}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}\\Gamma&amp;=&amp;\\displaystyle{\\frac{A\\nu_{i}^{\\max}}{{b\\nu_{i}^{%&#10;\\min}+\\bar{\\gamma}_{i}\\sigma^{2}B}}-\\frac{G\\nu_{i}^{\\max}}{{b\\nu_{i}^{\\min}+%&#10;\\tilde{\\alpha}H}}}\\\\&#10;\\Psi&amp;=&amp;\\displaystyle{\\frac{G\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\tilde{\\alpha}H}}%&#10;-\\frac{E\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\gamma_{i}^{\\ast}\\left(\\sigma^{2}+%&#10;\\sum_{j\\neq i}{p_{j}^{\\ast}\\nu_{i}^{\\max}}\\right)F}}}\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Γ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>A</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mi>B</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Ψ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>E</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mo>∗</mo></msubsup><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>F</mi></mrow></mrow></mfrac></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\\end{proposition} \n For the proof, see App. A. The corresponding algorithm is as follows.\n\\vspace{0.3cm}\\\\\n\\begin{tabular*}{1\\textwidth}{l}\n  \\hline\n  \\makebox[\\linewidth][l]{\\textbf{Algorithm $2$:} DRG Algorithm}\\\\\n  \\hline\n$1)$ Each user transmits at the new OP with power $\\tilde{p}_i$. \\\\\n\n$2)$ When the power of the received signal changes, a deviation is detected.\\\\\n\n$3)$ The other transmitters punish the deviator by transmitting at the one-shot \\\\\n\\hspace{0.28cm} game with power $p_i^{\\ast}$.\\\\\n\\hline\n\\end{tabular*}\n\n\\section{Numerical results}\n\\label{sec:NumericalResults}\n\nIn this section, we consider the efficiency function $f(x)=e^{-c/x}$ with $c=2^{\\frac{R}{R_0}}-1$. It has be proven in \\cite{Belmega2009,Belmega2011} that such a function is sigmoidal as it is convex on the open interval $(0,c/2]$ and concave on $(c/2,+\\infty)$. The throughput $R$ and the used bandwidth $R_0$ are equal to 1 Mbps and 1 MHz respectively. The maximum power $P^{\\max}$ is set to 0.1 Watt while the noise variance is set to $10^{-3}$ Watt. The buffer size $K$, the packet arrival rate $q$ and the consumed power $b$ are fixed to 10, 0.5 and $5\\times 10^{-3}$ Watt respectively. We consider Rayleigh fading channels and a spreading factor $L$ introducing an interference processing ($1/L$) in the interference term of the SINR. \n\nIn Fig. \\ref{REG2}, we present the achievable utility region, the new OP, the NE and the NB solution. We stress that the new OP and the NB solution dominate both the NE in the sense of Pareto. The region between the Pareto frontier and the min-max level is the possible set of equilibrium utilities of the RG according to the Folk theorem.\n\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{Region2.eps}\n\\caption{Pareto-dominance of the new OP and the NB solution vs the NE ($L=2$).}\n\\label{REG2}\n\\end{figure}\n\nIn order to study the efficiency of the new OP versus the NB solution and the NE, we are interested in comparing powers and utilities of the three equilibria by averaging over channel gains for different scenarios (different number of users $N$ in the system). In Fig. \\ref{REG4}, we plot the power and the utility that a user (in a system of $N$ users) can reach for each equilibrium. Thus, we highlight that the new OP and the NB solution have better performances than the NE as they Pareto-dominate it. When $N=2$, we notice that the new OP and the NB solution are more efficient than the NE. It is clear that the NB solution requires less power and provides higher utility compared to the new OP, but it is important to stress that values, in terms of powers and utilities, are slightly different for both equilibria (new OP and NB solution). When $N>2$, we highlight that lower powers are provided with the new OP which leads also to higher values of the utilities. Thus, we notice that the new OP gives better performances than the NE and the NB solution. Therefore, the new OP contributes not only to improve the system performances better than the NE for any given scenario but also enables important gains in terms of powers and utilities when compared to the NB solution for a system with a large number of users ($N>2$).\n\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{CrossLayerAveragedNewdBm.eps}\n\\caption{Better performances in terms of power and utility with the new OP for different number of users $N$.}\n\\label{REG4}\n\\end{figure}\n\nWe are interested in studying the performances of the social welfare ($\\sum_i u_i$) according to the FRG versus the NE in a multi-users system. The corresponding expression is given by:\n\n", "itemtype": "equation", "pos": 33424, "prevtext": "\nThen, the NE corresponding to the DRG is given by the following action plan $\\forall t \\geq 1$:\n\n", "index": 51, "text": "\\begin{equation}\n\\delta_{i,t} = \\left | \\begin{array}{ll}\n\\tilde{p}_i & \\mbox{ when all other players play }\\tilde{\\mathbf{p}}_{-i}\\\\\np_i^{\\ast} & \\mbox{ else }\n\\end{array} \\right.\n\\label{19}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\delta_{i,t}=\\left|\\begin{array}[]{ll}\\tilde{p}_{i}&amp;\\mbox{ when all other %&#10;players play }\\tilde{\\mathbf{p}}_{-i}\\\\&#10;p_{i}^{\\ast}&amp;\\mbox{ else }\\end{array}\\right.\" display=\"block\"><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><mi>t</mi></mrow></msub><mo>=</mo><mo>|</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><msub><mover accent=\"true\"><mi>p</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mtext> when all other players play </mtext><mo>⁢</mo><msub><mover accent=\"true\"><mi>𝐩</mi><mo stretchy=\"false\">~</mo></mover><mrow><mo>-</mo><mi>i</mi></mrow></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><msubsup><mi>p</mi><mi>i</mi><mo>∗</mo></msubsup></mtd><mtd columnalign=\"left\"><mtext> else </mtext></mtd></mtr></mtable></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nIn Fig. \\ref{REG5}, we present the ratio of the social welfare corresponding to the FRG ($\\omega_{FRG}$) vs the NE social welfare ($\\omega_{NE}$). We proceed by averaging over channel gains lying in a compact set such that $10\\log_{10}(\\nu^{\\max}/\\nu^{\\min})=20$. We highlight that the social welfare of the FRG reaches higher values than the NE ($\\omega_{FRG}>\\omega_{NE}$). In addition, we notice that the social welfare ratio increases with the number of users for both models (Goodman and cross-layer). The minimum number of stages $T_{\\min}$ according to the cross-layer model is much lower compared to the one related to the Goodman model. To illustrate this, when $N=3$, $T_{\\min}$ for the Goodman model is equal to 4600 while it is 3700 for the cross-layer model. This difference becomes considerable with the increase of the number of users. Indeed, when $N=4$, the minimum number of stages for the Goodman EE is 14300 while it is equal to 10900 for the cross-layer approach. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWFRG.eps}\n\\caption{Improvement of the social welfare in FRG vs the NE as a function of the number of stages of the game $T$ ($L=5$).}\n\\label{REG5}\n\\end{figure}\n\nWe are interested in plotting the minimum number of stages as a function of the consumed power $b$ and the packet arrival rate $q$ according to both EE models. Results, obtained by averaging over channel realizations, are drawn in figures \\ref{REG6} and \\ref{REG11}. According to Fig. \\ref{REG6}, we stress that $T_{\\min}$ increases with the number of users while it decreases with the spreading factor. It is clear that for any values of $N$ and $L$, it exists a consumed power $b\\neq 0$ for which $T_{\\min}$ is less than $T_{\\min}$ when $b=0$. Thus, a good choice of the fixed consumed power leads to a lower minimum number of stages for the cross-layer model compared to the Goodman model. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{Tminb.eps}\n\\caption{Existence of $T_{\\min}$ for the cross-layer model ($b\\neq 0$) lower than $T_{\\min}$ of Goodman model ($b=0$).}\n\\label{REG6}\n\\end{figure}\n\nIn Fig. \\ref{REG11}, we highlight that the minimum number of stages is an increasing function of the packet arrival rate $q$ according to the cross-layer model while it is a constant function for the Goodman model since the latter does not take into account the packet arrival process. One can confirm that the minimum number of stages is an increase function of the number of users as deduced previously. Simulations show that it exists a packet arrival rate $q_0$ before which $T_{\\min}$ of the cross-layer model is much lower than $T_{\\min}$ of the Goodman model for different number of users. Simulations show that $q_0 \\approx 0.6$ and for $q\\geq q_0$, $T_{\\min}$ of the cross-layer model converges to $T_{\\min}$ corresponding to the Goodman model. It is important to highlight that when $N=3$ and $q\\geq q_0$, $T_{\\min}$ of the cross-layer model takes higher values than $T_{\\min}$ corresponding to the Goodman model but values are quite similar. With the increase of the number of users, the difference between the minimum number of stages for both models becomes noticeable. According to figures \\ref{REG6} and \\ref{REG11}, one can conclude that the cross-layer model can be exploited for short games.\n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{Tminq.eps}\n\\caption{Lower values of $T_{\\min}$ of the cross-layer model when comparing to Goodman model ($L=5$).}\n\\label{REG11}\n\\end{figure}\n\nFor the DRG model, we plot in a first step the improvement of the social welfare ($\\omega_{DRG}$) versus the one-shot game ($\\omega_{NE}$) for Goodman  and cross-layer models ($b=0$ and $b=5\\times 10^{-3}$ respectively) as a function of the spectral efficiency $\\eta=N/L$. We simulated our algorithm by averaging over channel gains for different number of users. Results are given in Fig. \\ref{REG7}. It is important to highlight that the DRG social welfare reaches higher values than the NE social welfare ($\\omega_{DRG}>\\omega_{NE}$). For low values of the spectral efficiency, the social welfare ratio is quite similar for both models while the difference becomes noticeable when the spectral efficiency takes higher values. The social welfare ratio increases with the number of users for both EE models. For each model, when $N$ takes high values, the social welfare ratios become closer (for the cross-layer model, the curves corresponding to $N=3$ and $N=4$ are closer than with the curve of $N=2$). \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWDRG.eps}\n\\caption{Improvement of the social welfare in DRG vs the NE for Goodman and cross-layer models as a function of the spectral efficiency $\\eta$ for different number of users $N$.}\n\\label{REG7}\n\\end{figure}\n\nFor this reason, we studied the variation of $\\lambda_{\\max}$ as a function of $\\eta$ and $q$ for both EE models and for different number of users. Results are given in figures \\ref{REG8} and \\ref{REG10}. According to Fig. \\ref{REG8}, we deduce how $\\lambda_{\\max}$ decreases with the number of users for both EE models. In addition, we stress that the values reached by $\\lambda_{\\max}$ becomes closer when $N$ takes higher values. This can explain Fig. \\ref{REG7}. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{lambdaeta.eps}\n\\caption{Variation of $\\lambda_{\\max}$ for Goodman and cross-layer models as a function of the spectral efficiency $\\eta$ with different number of users $N$.}\n\\label{REG8}\n\\end{figure}\nThe study of the variation of $\\lambda_{\\max}$ versus the packet arrival rate $q$ (in Fig. \\ref{REG10}) shows that the maximum discount factor $\\lambda_{\\max}$ decreases with the number of users and with the packet arrival rate $q$ as well. Simulations show that it exists a packet arrival rate $q_1$ before which the $\\lambda_{\\max}$ corresponding to the cross-layer model takes higher values than the maximum discount factor of the Goodman model for different number of users. We notice that starting from $q_1$, the maximum discount factor of the cross-layer model converges to $\\lambda_{\\max}$ corresponding to the Goodman model. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{lamdamaxq.eps}\n\\caption{Variation of $\\lambda_{\\max}$ as a function of the packet arrival rate $q$ ($L=2$).}\n\\label{REG10}\n\\end{figure}\nIn a second step, we plotted in Fig. \\ref{REG9} the variation of the DRG social welfare as a function of $\\lambda \\leq \\lambda_{\\max}$. We notice that $\\omega_{DRG}$ is an increase function of $\\lambda$. Thus, when $\\lambda=\\lambda_{\\max}$, $\\omega_{DRG}$ reaches highest value. However, we stress that $\\omega_{DRG}$ decreases with the number of users especially for the Goodman model while it is quite similar for the cross-layer model. This confirms that the proposed new OP is still quite efficient and can be utilized for games with high number of users.  \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWLamdanew.eps}\n\\caption{Increase of $\\omega_{DRG}$ as a function of $\\lambda$ ($L=2$).}\n\\label{REG9}\n\\end{figure}\n\nFinally, we plot for both RG models (FRG and DRG) the social welfare when using the cross-layer approach against the constant power $b$ for two different values of the packet arrival rate $q$ ($0.5$ and $0.7$). The considered system is composed of $2$ users and the spreading factor $L$ is fixed to $4$. The idea consists in studying the efficiency of the cross-layer approach regarding the Goodman power control algorithm. Accordingly, for each packet arrival rate, we plot the social welfare with the cross-layer approach (powers at the equilibrium are determined normally according to $q$) and the social welfare with the cross-layer power control but when powers at the equilibrium are determined by the Goodman algorithm $(p[q\\rightarrow1])$. Indeed, the packet arrival rate is assumed constant in the Goodman model and equal to 1 (packets arrive with probability $q=1$). For both RG models, we stress that the cross-layer power control approach outperforms the Goodman algorithm for both values of the packet arrival rate $q$. Important (relative) gains are reached. To illustrate this, for $q=0.5$ and $b=0.045$ Watt the relative gain is higher than $50\\%$ in the FRG and the DRG as well. Therefore, we conclude that the OP with the cross-layer approach provides better performances and is more efficient than the OP with the Goodman power control approach.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{FINALSWFRG.eps}\n\\caption{Variations of the FRG social welfare against $b$ for $q=0.5$ and $q=0.7$: the cross-layer power control approach outperforms the Goodman algorithm. }\n\\label{FRG}\n\\end{figure}\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{FINALSWDRG.eps}\n\\caption{Plotting the DRG social welfare against $b$ for $q=0.5$ and $q=0.7$: the cross-layer approach improves the power control when compared to the Goodman algorithm.}\n\\label{DRG}\n\\end{figure}\n\n\n\n\\section{Conclusion}\n\\label{sec:Conclusion}\n\nIn this paper, we have investigated RG for distributed power control in a MAC system. As the NE is not always energy-efficient, the NB solution might be a possible efficient solution since it is Pareto-efficient. However, the latter, in general, requires global CSI at each transmitter node. Thus, we were motivated to investigate using the repeated game formulation and develop a new OP, that simultaneously is both more efficient than the NE and achievable with only individual CSI being required at the transmitter. Also, we consider a new EE metric taking into account the presence of a queue at the transmitter with an arbitrary packet arrivals. \n\nCooperation plans are proposed where the new OP is considered and closed-form expressions of the minimum number of stages for the FRG and the maximum discount factor for the DRG have been established. The study of the social welfare (sum of utilities of all the users) shows that considerable gains are reached compared to the NE (for the FRG and DRG). Moreover, our model proves that even with a high number of users, the FRG can always be played with a minimum number of stages shorter than when using the Goodman model. In addition, the social welfare in the DRG decreases slightly with the number of users with the cross-layer approach while it decreases considerably with the Goodman model. Finally, the comparison of the cross-layer algorithm versus the Goodman algorithm, shows that in real systems with random packet arrivals, the cross-layer power control algorithm outperforms the Goodman algorithm. Thus, the new OP with the cross-layer approach is more efficient. An interesting extension to this work would be to consider the interference channel instead of the MAC channel and generalize the framework applied here. Another possible extension would be to consider the multi-carrier case and the resulting repeated game.\n\n\\begin{appendices}\n\\section{(Proof of $\\lambda_{max}$)}\n\\label{sec:Proof}\n\\subsection{Determination of the maximal utility}\n\\label{sec:DeterminationOfTheMaximalUtility}\n\nLet us determine the maximal utility that a player can get and which is denoted as follows: \n\n", "itemtype": "equation", "pos": 37226, "prevtext": "\n\\end{proposition} \n For the proof, see App. A. The corresponding algorithm is as follows.\n\\vspace{0.3cm}\\\\\n\\begin{tabular*}{1\\textwidth}{l}\n  \\hline\n  \\makebox[\\linewidth][l]{\\textbf{Algorithm $2$:} DRG Algorithm}\\\\\n  \\hline\n$1)$ Each user transmits at the new OP with power $\\tilde{p}_i$. \\\\\n\n$2)$ When the power of the received signal changes, a deviation is detected.\\\\\n\n$3)$ The other transmitters punish the deviator by transmitting at the one-shot \\\\\n\\hspace{0.28cm} game with power $p_i^{\\ast}$.\\\\\n\\hline\n\\end{tabular*}\n\n\\section{Numerical results}\n\\label{sec:NumericalResults}\n\nIn this section, we consider the efficiency function $f(x)=e^{-c/x}$ with $c=2^{\\frac{R}{R_0}}-1$. It has be proven in \\cite{Belmega2009,Belmega2011} that such a function is sigmoidal as it is convex on the open interval $(0,c/2]$ and concave on $(c/2,+\\infty)$. The throughput $R$ and the used bandwidth $R_0$ are equal to 1 Mbps and 1 MHz respectively. The maximum power $P^{\\max}$ is set to 0.1 Watt while the noise variance is set to $10^{-3}$ Watt. The buffer size $K$, the packet arrival rate $q$ and the consumed power $b$ are fixed to 10, 0.5 and $5\\times 10^{-3}$ Watt respectively. We consider Rayleigh fading channels and a spreading factor $L$ introducing an interference processing ($1/L$) in the interference term of the SINR. \n\nIn Fig. \\ref{REG2}, we present the achievable utility region, the new OP, the NE and the NB solution. We stress that the new OP and the NB solution dominate both the NE in the sense of Pareto. The region between the Pareto frontier and the min-max level is the possible set of equilibrium utilities of the RG according to the Folk theorem.\n\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{Region2.eps}\n\\caption{Pareto-dominance of the new OP and the NB solution vs the NE ($L=2$).}\n\\label{REG2}\n\\end{figure}\n\nIn order to study the efficiency of the new OP versus the NB solution and the NE, we are interested in comparing powers and utilities of the three equilibria by averaging over channel gains for different scenarios (different number of users $N$ in the system). In Fig. \\ref{REG4}, we plot the power and the utility that a user (in a system of $N$ users) can reach for each equilibrium. Thus, we highlight that the new OP and the NB solution have better performances than the NE as they Pareto-dominate it. When $N=2$, we notice that the new OP and the NB solution are more efficient than the NE. It is clear that the NB solution requires less power and provides higher utility compared to the new OP, but it is important to stress that values, in terms of powers and utilities, are slightly different for both equilibria (new OP and NB solution). When $N>2$, we highlight that lower powers are provided with the new OP which leads also to higher values of the utilities. Thus, we notice that the new OP gives better performances than the NE and the NB solution. Therefore, the new OP contributes not only to improve the system performances better than the NE for any given scenario but also enables important gains in terms of powers and utilities when compared to the NB solution for a system with a large number of users ($N>2$).\n\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{CrossLayerAveragedNewdBm.eps}\n\\caption{Better performances in terms of power and utility with the new OP for different number of users $N$.}\n\\label{REG4}\n\\end{figure}\n\nWe are interested in studying the performances of the social welfare ($\\sum_i u_i$) according to the FRG versus the NE in a multi-users system. The corresponding expression is given by:\n\n", "index": 53, "text": "\\begin{equation}\n\\frac{w_{FRG}}{w_{NE}}=\\frac{\\sum_{i=1}^{N}( \\sum_{t=1}^{T-T_{\\min}}\\tilde{u}_i{(\\mathbf{p}(t))}  + \\sum_{t=T-T_{\\min}+1}^{T}u^{\\ast}_i{(\\mathbf{p}(t))})}{\\sum_{i=1}^{N}\\sum_{t=1}^{T}u^{\\ast}_i{(\\mathbf{p}(t))}}.\n\\label{wfeqn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\frac{w_{FRG}}{w_{NE}}=\\frac{\\sum_{i=1}^{N}(\\sum_{t=1}^{T-T_{\\min}}\\tilde{u}_{%&#10;i}{(\\mathbf{p}(t))}+\\sum_{t=T-T_{\\min}+1}^{T}u^{\\ast}_{i}{(\\mathbf{p}(t))})}{%&#10;\\sum_{i=1}^{N}\\sum_{t=1}^{T}u^{\\ast}_{i}{(\\mathbf{p}(t))}}.\" display=\"block\"><mrow><mrow><mfrac><msub><mi>w</mi><mrow><mi>F</mi><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mi>G</mi></mrow></msub><msub><mi>w</mi><mrow><mi>N</mi><mo>⁢</mo><mi>E</mi></mrow></msub></mfrac><mo>=</mo><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>=</mo><mn>1</mn></mrow><mrow><mi>T</mi><mo>-</mo><msub><mi>T</mi><mi>min</mi></msub></mrow></msubsup><mrow><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>=</mo><mrow><mrow><mi>T</mi><mo>-</mo><msub><mi>T</mi><mi>min</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></mrow><mi>T</mi></msubsup><mrow><msubsup><mi>u</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>=</mo><mn>1</mn></mrow><mi>T</mi></msubsup><mrow><msubsup><mi>u</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nWe denote $\\dot{p}_i$ the power maximizing the utility function $u_i$ and which is the solution of the following equation:\n\n", "itemtype": "equation", "pos": 48714, "prevtext": "\n\nIn Fig. \\ref{REG5}, we present the ratio of the social welfare corresponding to the FRG ($\\omega_{FRG}$) vs the NE social welfare ($\\omega_{NE}$). We proceed by averaging over channel gains lying in a compact set such that $10\\log_{10}(\\nu^{\\max}/\\nu^{\\min})=20$. We highlight that the social welfare of the FRG reaches higher values than the NE ($\\omega_{FRG}>\\omega_{NE}$). In addition, we notice that the social welfare ratio increases with the number of users for both models (Goodman and cross-layer). The minimum number of stages $T_{\\min}$ according to the cross-layer model is much lower compared to the one related to the Goodman model. To illustrate this, when $N=3$, $T_{\\min}$ for the Goodman model is equal to 4600 while it is 3700 for the cross-layer model. This difference becomes considerable with the increase of the number of users. Indeed, when $N=4$, the minimum number of stages for the Goodman EE is 14300 while it is equal to 10900 for the cross-layer approach. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWFRG.eps}\n\\caption{Improvement of the social welfare in FRG vs the NE as a function of the number of stages of the game $T$ ($L=5$).}\n\\label{REG5}\n\\end{figure}\n\nWe are interested in plotting the minimum number of stages as a function of the consumed power $b$ and the packet arrival rate $q$ according to both EE models. Results, obtained by averaging over channel realizations, are drawn in figures \\ref{REG6} and \\ref{REG11}. According to Fig. \\ref{REG6}, we stress that $T_{\\min}$ increases with the number of users while it decreases with the spreading factor. It is clear that for any values of $N$ and $L$, it exists a consumed power $b\\neq 0$ for which $T_{\\min}$ is less than $T_{\\min}$ when $b=0$. Thus, a good choice of the fixed consumed power leads to a lower minimum number of stages for the cross-layer model compared to the Goodman model. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{Tminb.eps}\n\\caption{Existence of $T_{\\min}$ for the cross-layer model ($b\\neq 0$) lower than $T_{\\min}$ of Goodman model ($b=0$).}\n\\label{REG6}\n\\end{figure}\n\nIn Fig. \\ref{REG11}, we highlight that the minimum number of stages is an increasing function of the packet arrival rate $q$ according to the cross-layer model while it is a constant function for the Goodman model since the latter does not take into account the packet arrival process. One can confirm that the minimum number of stages is an increase function of the number of users as deduced previously. Simulations show that it exists a packet arrival rate $q_0$ before which $T_{\\min}$ of the cross-layer model is much lower than $T_{\\min}$ of the Goodman model for different number of users. Simulations show that $q_0 \\approx 0.6$ and for $q\\geq q_0$, $T_{\\min}$ of the cross-layer model converges to $T_{\\min}$ corresponding to the Goodman model. It is important to highlight that when $N=3$ and $q\\geq q_0$, $T_{\\min}$ of the cross-layer model takes higher values than $T_{\\min}$ corresponding to the Goodman model but values are quite similar. With the increase of the number of users, the difference between the minimum number of stages for both models becomes noticeable. According to figures \\ref{REG6} and \\ref{REG11}, one can conclude that the cross-layer model can be exploited for short games.\n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{Tminq.eps}\n\\caption{Lower values of $T_{\\min}$ of the cross-layer model when comparing to Goodman model ($L=5$).}\n\\label{REG11}\n\\end{figure}\n\nFor the DRG model, we plot in a first step the improvement of the social welfare ($\\omega_{DRG}$) versus the one-shot game ($\\omega_{NE}$) for Goodman  and cross-layer models ($b=0$ and $b=5\\times 10^{-3}$ respectively) as a function of the spectral efficiency $\\eta=N/L$. We simulated our algorithm by averaging over channel gains for different number of users. Results are given in Fig. \\ref{REG7}. It is important to highlight that the DRG social welfare reaches higher values than the NE social welfare ($\\omega_{DRG}>\\omega_{NE}$). For low values of the spectral efficiency, the social welfare ratio is quite similar for both models while the difference becomes noticeable when the spectral efficiency takes higher values. The social welfare ratio increases with the number of users for both EE models. For each model, when $N$ takes high values, the social welfare ratios become closer (for the cross-layer model, the curves corresponding to $N=3$ and $N=4$ are closer than with the curve of $N=2$). \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWDRG.eps}\n\\caption{Improvement of the social welfare in DRG vs the NE for Goodman and cross-layer models as a function of the spectral efficiency $\\eta$ for different number of users $N$.}\n\\label{REG7}\n\\end{figure}\n\nFor this reason, we studied the variation of $\\lambda_{\\max}$ as a function of $\\eta$ and $q$ for both EE models and for different number of users. Results are given in figures \\ref{REG8} and \\ref{REG10}. According to Fig. \\ref{REG8}, we deduce how $\\lambda_{\\max}$ decreases with the number of users for both EE models. In addition, we stress that the values reached by $\\lambda_{\\max}$ becomes closer when $N$ takes higher values. This can explain Fig. \\ref{REG7}. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{lambdaeta.eps}\n\\caption{Variation of $\\lambda_{\\max}$ for Goodman and cross-layer models as a function of the spectral efficiency $\\eta$ with different number of users $N$.}\n\\label{REG8}\n\\end{figure}\nThe study of the variation of $\\lambda_{\\max}$ versus the packet arrival rate $q$ (in Fig. \\ref{REG10}) shows that the maximum discount factor $\\lambda_{\\max}$ decreases with the number of users and with the packet arrival rate $q$ as well. Simulations show that it exists a packet arrival rate $q_1$ before which the $\\lambda_{\\max}$ corresponding to the cross-layer model takes higher values than the maximum discount factor of the Goodman model for different number of users. We notice that starting from $q_1$, the maximum discount factor of the cross-layer model converges to $\\lambda_{\\max}$ corresponding to the Goodman model. \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{lamdamaxq.eps}\n\\caption{Variation of $\\lambda_{\\max}$ as a function of the packet arrival rate $q$ ($L=2$).}\n\\label{REG10}\n\\end{figure}\nIn a second step, we plotted in Fig. \\ref{REG9} the variation of the DRG social welfare as a function of $\\lambda \\leq \\lambda_{\\max}$. We notice that $\\omega_{DRG}$ is an increase function of $\\lambda$. Thus, when $\\lambda=\\lambda_{\\max}$, $\\omega_{DRG}$ reaches highest value. However, we stress that $\\omega_{DRG}$ decreases with the number of users especially for the Goodman model while it is quite similar for the cross-layer model. This confirms that the proposed new OP is still quite efficient and can be utilized for games with high number of users.  \n\n\n\n\\begin{figure}[htbp]\n\\centering\n\\includegraphics[scale=0.6]{SWLamdanew.eps}\n\\caption{Increase of $\\omega_{DRG}$ as a function of $\\lambda$ ($L=2$).}\n\\label{REG9}\n\\end{figure}\n\nFinally, we plot for both RG models (FRG and DRG) the social welfare when using the cross-layer approach against the constant power $b$ for two different values of the packet arrival rate $q$ ($0.5$ and $0.7$). The considered system is composed of $2$ users and the spreading factor $L$ is fixed to $4$. The idea consists in studying the efficiency of the cross-layer approach regarding the Goodman power control algorithm. Accordingly, for each packet arrival rate, we plot the social welfare with the cross-layer approach (powers at the equilibrium are determined normally according to $q$) and the social welfare with the cross-layer power control but when powers at the equilibrium are determined by the Goodman algorithm $(p[q\\rightarrow1])$. Indeed, the packet arrival rate is assumed constant in the Goodman model and equal to 1 (packets arrive with probability $q=1$). For both RG models, we stress that the cross-layer power control approach outperforms the Goodman algorithm for both values of the packet arrival rate $q$. Important (relative) gains are reached. To illustrate this, for $q=0.5$ and $b=0.045$ Watt the relative gain is higher than $50\\%$ in the FRG and the DRG as well. Therefore, we conclude that the OP with the cross-layer approach provides better performances and is more efficient than the OP with the Goodman power control approach.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{FINALSWFRG.eps}\n\\caption{Variations of the FRG social welfare against $b$ for $q=0.5$ and $q=0.7$: the cross-layer power control approach outperforms the Goodman algorithm. }\n\\label{FRG}\n\\end{figure}\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[scale=0.6]{FINALSWDRG.eps}\n\\caption{Plotting the DRG social welfare against $b$ for $q=0.5$ and $q=0.7$: the cross-layer approach improves the power control when compared to the Goodman algorithm.}\n\\label{DRG}\n\\end{figure}\n\n\n\n\\section{Conclusion}\n\\label{sec:Conclusion}\n\nIn this paper, we have investigated RG for distributed power control in a MAC system. As the NE is not always energy-efficient, the NB solution might be a possible efficient solution since it is Pareto-efficient. However, the latter, in general, requires global CSI at each transmitter node. Thus, we were motivated to investigate using the repeated game formulation and develop a new OP, that simultaneously is both more efficient than the NE and achievable with only individual CSI being required at the transmitter. Also, we consider a new EE metric taking into account the presence of a queue at the transmitter with an arbitrary packet arrivals. \n\nCooperation plans are proposed where the new OP is considered and closed-form expressions of the minimum number of stages for the FRG and the maximum discount factor for the DRG have been established. The study of the social welfare (sum of utilities of all the users) shows that considerable gains are reached compared to the NE (for the FRG and DRG). Moreover, our model proves that even with a high number of users, the FRG can always be played with a minimum number of stages shorter than when using the Goodman model. In addition, the social welfare in the DRG decreases slightly with the number of users with the cross-layer approach while it decreases considerably with the Goodman model. Finally, the comparison of the cross-layer algorithm versus the Goodman algorithm, shows that in real systems with random packet arrivals, the cross-layer power control algorithm outperforms the Goodman algorithm. Thus, the new OP with the cross-layer approach is more efficient. An interesting extension to this work would be to consider the interference channel instead of the MAC channel and generalize the framework applied here. Another possible extension would be to consider the multi-carrier case and the resulting repeated game.\n\n\\begin{appendices}\n\\section{(Proof of $\\lambda_{max}$)}\n\\label{sec:Proof}\n\\subsection{Determination of the maximal utility}\n\\label{sec:DeterminationOfTheMaximalUtility}\n\nLet us determine the maximal utility that a player can get and which is denoted as follows: \n\n", "index": 55, "text": "\\begin{equation}\n\\begin{array}{lcl}\n\\displaystyle{\\bar{u}_i }&= &\\displaystyle{\\max_{\\mathbf{p}_{-i}}\\max_{p_i}u_i({p_i,\\mathbf{p}_{-i}})}.\\\\\n\\end{array}\n\\label{A1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}\\displaystyle{\\bar{u}_{i}}&amp;=&amp;\\displaystyle{\\max_{\\mathbf{p%&#10;}_{-i}}\\max_{p_{i}}u_{i}({p_{i},\\mathbf{p}_{-i}})}.\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\"><mtr><mtd columnalign=\"left\"><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><munder><mi>max</mi><msub><mi>𝐩</mi><mrow><mo>-</mo><mi>i</mi></mrow></msub></munder><mo>⁡</mo><mrow><munder><mi>max</mi><msub><mi>p</mi><mi>i</mi></msub></munder><mo>⁡</mo><msub><mi>u</mi><mi>i</mi></msub></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo>,</mo><msub><mi>𝐩</mi><mrow><mo>-</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith $\\displaystyle{\\gamma_i^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}{{\\mathop{}\\mathopen{}\\mathrm{d}} p_i}} = {\\frac{\\gamma_i}{p_i}}}$, $\\displaystyle{f^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} f}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i} }}$ and $\\displaystyle{\\Phi^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\Phi}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}}}$. Therefore, the expression of the maximum utility function writes as:\n\n", "itemtype": "equation", "pos": 49018, "prevtext": "\n\nWe denote $\\dot{p}_i$ the power maximizing the utility function $u_i$ and which is the solution of the following equation:\n\n", "index": 57, "text": "\\begin{equation}\n\\displaystyle{b\\frac{\\gamma_i}{p_i}\\Phi^\\prime(\\gamma_i)+q\\left(\\frac{1-\\Phi(\\gamma_i)}{f(\\gamma_i)}\\right)^2 \\left[f(\\gamma_i)-\\gamma_i f^\\prime(\\gamma_i)\\right]=0},\n\\label{A3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{b\\frac{\\gamma_{i}}{p_{i}}\\Phi^{\\prime}(\\gamma_{i})+q\\left(\\frac{%&#10;1-\\Phi(\\gamma_{i})}{f(\\gamma_{i})}\\right)^{2}\\left[f(\\gamma_{i})-\\gamma_{i}f^{%&#10;\\prime}(\\gamma_{i})\\right]=0},\" display=\"block\"><mrow><mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><mfrac><msub><mi>γ</mi><mi>i</mi></msub><msub><mi>p</mi><mi>i</mi></msub></mfrac><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>q</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><msup><mi>f</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith: \n\n", "itemtype": "equation", "pos": 49694, "prevtext": "\nwith $\\displaystyle{\\gamma_i^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}{{\\mathop{}\\mathopen{}\\mathrm{d}} p_i}} = {\\frac{\\gamma_i}{p_i}}}$, $\\displaystyle{f^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} f}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i} }}$ and $\\displaystyle{\\Phi^\\prime = {\\frac{{\\mathop{}\\mathopen{}\\mathrm{d}} \\Phi}{{\\mathop{}\\mathopen{}\\mathrm{d}} \\gamma_i}}}$. Therefore, the expression of the maximum utility function writes as:\n\n", "index": 59, "text": "\\begin{equation}\n\\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}}) = \\displaystyle{\\frac{Rq(1-\\phi(\\dot{\\gamma}_{i}))}{{b+\\displaystyle{\\frac{\\dot{p}_{i}q(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}}}}},\n\\label{A4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"\\dot{u}_{i}({\\dot{p}_{i},\\mathbf{p}_{-i}})=\\displaystyle{\\frac{Rq(1-\\phi(\\dot{%&#10;\\gamma}_{i}))}{{b+\\displaystyle{\\frac{\\dot{p}_{i}q(1-\\phi(\\dot{\\gamma}_{i}))}{%&#10;f(\\dot{\\gamma}_{i})}}}}},\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>u</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>,</mo><msub><mi>𝐩</mi><mrow><mo>-</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>b</mi><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nWe have to study then the behavior of $\\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})$ regarding $p_j$ for $j\\neq i$ and then we determine the sign of $\\displaystyle{\\frac{\\partial \\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})}{\\partial p_j}}$ which is given by:\n\n", "itemtype": "equation", "pos": 49926, "prevtext": "\nwith: \n\n", "index": 61, "text": "\\begin{equation}\n\\displaystyle{\\dot{\\gamma}_{i} = \\frac{\\dot{p}_i|g_i|^2}{\\sigma^2+\\sum_{j \\neq i}{p_j |g_j|^2}}}.\n\\label{A5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\dot{\\gamma}_{i}=\\frac{\\dot{p}_{i}|g_{i}|^{2}}{\\sigma^{2}+\\sum_{%&#10;j\\neq i}{p_{j}|g_{j}|^{2}}}}.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>=</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msub><mi>p</mi><mi>j</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nWe are interested to study the sign of the numerator:\n\n", "itemtype": "equation", "pos": 50320, "prevtext": "\n\nWe have to study then the behavior of $\\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})$ regarding $p_j$ for $j\\neq i$ and then we determine the sign of $\\displaystyle{\\frac{\\partial \\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})}{\\partial p_j}}$ which is given by:\n\n", "index": 63, "text": "\\begin{equation}\n\\displaystyle{\\frac{\\partial \\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})}{\\partial p_j}} = \\displaystyle{Rq\\frac{\\displaystyle{\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial p_j}+ \\dot{p}_i q   \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{{\\partial p_j}}}}{\\displaystyle{\\bigg(b+\\frac{\\dot{p}_i q(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2}}}.\n\\label{5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\frac{\\partial\\dot{u}_{i}({\\dot{p}_{i},\\mathbf{p}_{-i}})}{%&#10;\\partial p_{j}}}=\\displaystyle{Rq\\frac{\\displaystyle{\\frac{-b\\partial\\phi(\\dot%&#10;{\\gamma}_{i})}{\\partial p_{j}}+\\dot{p}_{i}q\\bigg{(}\\frac{(1-\\phi(\\dot{\\gamma}_%&#10;{i}))}{f(\\dot{\\gamma}_{i})}\\bigg{)}^{2}\\frac{\\partial f(\\dot{\\gamma}_{i})}{{%&#10;\\partial p_{j}}}}}{\\displaystyle{\\bigg{(}b+\\frac{\\dot{p}_{i}q(1-\\phi(\\dot{%&#10;\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg{)}^{2}}}}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mover accent=\"true\"><mi>u</mi><mo>˙</mo></mover><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>,</mo><msub><mi>𝐩</mi><mrow><mo>-</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac><mo>=</mo><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mfrac><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mo>-</mo><mrow><mi>b</mi><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac></mstyle><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mi>q</mi><mo>⁢</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac></mstyle></mrow></mrow><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mi>b</mi><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith: \n\n", "itemtype": "equation", "pos": 50833, "prevtext": "\n\nWe are interested to study the sign of the numerator:\n\n", "index": 65, "text": "\\begin{multline}\n\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial p_j}+ \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial p_j} = \\\\\n\\bigg(\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}+ \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}\\bigg)\\frac{\\partial \\dot{\\gamma}_{i}}{\\partial p_j},\n\\label{6}\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{-b\\partial\\phi(\\dot{\\gamma}_{i})}{\\partial p_{j}}+\\dot{p}_{%&#10;i}q\\bigg{(}\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg{)}^{2}%&#10;\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial p_{j}}=\\\\&#10;\\displaystyle\\bigg{(}\\frac{-b\\partial\\phi(\\dot{\\gamma}_{i})}{\\partial\\dot{%&#10;\\gamma}_{i}}+\\dot{p}_{i}q\\bigg{(}\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{%&#10;\\gamma}_{i})}\\bigg{)}^{2}\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial\\dot{%&#10;\\gamma}_{i}}\\bigg{)}\\frac{\\partial\\dot{\\gamma}_{i}}{\\partial p_{j}},\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mfrac><mrow><mo>-</mo><mrow><mi>b</mi><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mi>q</mi><mo>⁢</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac></mrow></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mfrac><mrow><mo>-</mo><mrow><mi>b</mi><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub></mrow></mfrac><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><mi>q</mi><mo>⁢</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub></mrow></mfrac></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nThe next step would be to determine the sign of the expression\\\\\n$\\displaystyle {\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}} \\allowbreak + \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}$. \nIt is obvious that $\\displaystyle {\\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}>0}$ since $f$ is an increasing function of the SINR. Therefore, we need to determine the sign of $\\displaystyle{\\frac{\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}$. We have: \n\n", "itemtype": "equation", "pos": 51344, "prevtext": "\nwith: \n\n", "index": 67, "text": "\\begin{equation}\n\\frac{\\partial \\dot{\\gamma}_{i}}{\\partial p_j} = \\frac{-\\dot{p}_i|g_i|^2|g_j|^2}{\\bigg(\\sigma^2+\\sum_{j \\neq i}{p_j |g_j|^2\\bigg)^2}}<0.\n\\label{7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\dot{\\gamma}_{i}}{\\partial p_{j}}=\\frac{-\\dot{p}_{i}|g_{i}|^{2}|%&#10;g_{j}|^{2}}{\\bigg{(}\\sigma^{2}+\\sum_{j\\neq i}{p_{j}|g_{j}|^{2}\\bigg{)}^{2}}}&lt;0.\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>˙</mo></mover><mi>i</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>p</mi><mi>j</mi></msub></mrow></mfrac><mo>=</mo><mfrac><mrow><mo>-</mo><mrow><msub><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msub><mi>p</mi><mi>j</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup></mfrac><mo>&lt;</mo><mn>0</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nThe sign of the first term is negative while the sign of the second term is the same as $\\partial \\Pi(\\gamma_i)/\\partial \\gamma_i$ since $(1-f(\\gamma_i))>0$ and we have:\n\n", "itemtype": "equation", "pos": 52203, "prevtext": "\n\nThe next step would be to determine the sign of the expression\\\\\n$\\displaystyle {\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}} \\allowbreak + \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}$. \nIt is obvious that $\\displaystyle {\\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}>0}$ since $f$ is an increasing function of the SINR. Therefore, we need to determine the sign of $\\displaystyle{\\frac{\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}$. We have: \n\n", "index": 69, "text": "\\begin{equation}\n\\begin{array}{lcl}\n\\displaystyle {\\frac{\\partial \\phi(\\gamma_i)}{\\partial \\gamma_i}} & = & \\displaystyle {\\frac{\\partial ((1-f(\\gamma_i))\\Pi(\\gamma_i))}{\\partial \\gamma_i}}\\\\\n& = & \\displaystyle {-\\frac{\\partial f(\\gamma_i)}{\\partial \\gamma_i}\\Pi(\\gamma_i)+(1-f(\\gamma_i))\\frac{\\partial \\Pi(\\gamma_i)}{\\partial \\gamma_i}}.\n\\end{array}\n\\label{8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}\\displaystyle{\\frac{\\partial\\phi(\\gamma_{i})}{\\partial%&#10;\\gamma_{i}}}&amp;=&amp;\\displaystyle{\\frac{\\partial((1-f(\\gamma_{i}))\\Pi(\\gamma_{i}))}%&#10;{\\partial\\gamma_{i}}}\\\\&#10;&amp;=&amp;\\displaystyle{-\\frac{\\partial f(\\gamma_{i})}{\\partial\\gamma_{i}}\\Pi(\\gamma_%&#10;{i})+(1-f(\\gamma_{i}))\\frac{\\partial\\Pi(\\gamma_{i})}{\\partial\\gamma_{i}}}.\\end%&#10;{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac></mtd></mtr><mtr><mtd/><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mo>-</mo><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac><mo>⁢</mo><mi mathvariant=\"normal\">Π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi mathvariant=\"normal\">Π</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nHowever $\\rho(\\gamma_i)=\\displaystyle{\\frac{q(1-f(\\gamma_i))}{(1-q)f(\\gamma_i)}}$ and then:\n\n", "itemtype": "equation", "pos": 52751, "prevtext": "\n\nThe sign of the first term is negative while the sign of the second term is the same as $\\partial \\Pi(\\gamma_i)/\\partial \\gamma_i$ since $(1-f(\\gamma_i))>0$ and we have:\n\n", "index": 71, "text": "\\begin{equation}\n\\displaystyle {\\frac{\\partial \\Pi(\\gamma_i)}{\\partial \\gamma_i}} =  \\displaystyle {\\frac{\\partial \\rho(\\gamma_i)}{\\partial \\gamma_i}\\frac{\\partial \\Pi(\\gamma_i))}{\\partial \\rho}}.\n\\label{9}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\frac{\\partial\\Pi(\\gamma_{i})}{\\partial\\gamma_{i}}}=%&#10;\\displaystyle{\\frac{\\partial\\rho(\\gamma_{i})}{\\partial\\gamma_{i}}\\frac{%&#10;\\partial\\Pi(\\gamma_{i}))}{\\partial\\rho}}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi mathvariant=\"normal\">Π</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac><mo>=</mo><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ρ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mi mathvariant=\"normal\">Π</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ρ</mi></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nAs shown in \\cite{VarmaICC2012}, we have: \n\n", "itemtype": "equation", "pos": 53065, "prevtext": "\nHowever $\\rho(\\gamma_i)=\\displaystyle{\\frac{q(1-f(\\gamma_i))}{(1-q)f(\\gamma_i)}}$ and then:\n\n", "index": 73, "text": "\\begin{equation}\n\\displaystyle {\\frac{\\partial \\rho(\\gamma_i)}{\\partial \\gamma_i}} = \\displaystyle {\\frac{-q}{(1-q)f^2(\\gamma_i)}\\frac{\\partial f(\\gamma_i)}{\\partial \\gamma_i}<0}.\n\\label{10}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\frac{\\partial\\rho(\\gamma_{i})}{\\partial\\gamma_{i}}}=%&#10;\\displaystyle{\\frac{-q}{(1-q)f^{2}(\\gamma_{i})}\\frac{\\partial f(\\gamma_{i})}{%&#10;\\partial\\gamma_{i}}&lt;0}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ρ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac><mo>=</mo><mrow><mfrac><mrow><mo>-</mo><mi>q</mi></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>q</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>f</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>γ</mi><mi>i</mi></msub></mrow></mfrac></mrow><mo>&lt;</mo><mn>0</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nThe latter quantity can be expressed as:\n\n", "itemtype": "equation", "pos": 53314, "prevtext": "\nAs shown in \\cite{VarmaICC2012}, we have: \n\n", "index": 75, "text": "\\begin{equation}\n\\Pi(\\gamma_i) = \\frac{\\rho^K}{1+\\rho+\\rho^2+\\ldots+\\rho^K}.\n\\label{11}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37.m1\" class=\"ltx_Math\" alttext=\"\\Pi(\\gamma_{i})=\\frac{\\rho^{K}}{1+\\rho+\\rho^{2}+\\ldots+\\rho^{K}}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msup><mi>ρ</mi><mi>K</mi></msup><mrow><mn>1</mn><mo>+</mo><mi>ρ</mi><mo>+</mo><msup><mi>ρ</mi><mn>2</mn></msup><mo>+</mo><mi mathvariant=\"normal\">…</mi><mo>+</mo><msup><mi>ρ</mi><mi>K</mi></msup></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nConsequently, we have: \n\n", "itemtype": "equation", "pos": 53458, "prevtext": "\nThe latter quantity can be expressed as:\n\n", "index": 77, "text": "\\begin{equation}\n\\frac{1}{\\Pi(\\gamma_i)} = 1+\\frac{1}{\\rho}+\\frac{1}{\\rho^2}+\\ldots+\\frac{1}{\\rho^K}.\n\\label{12}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{\\Pi(\\gamma_{i})}=1+\\frac{1}{\\rho}+\\frac{1}{\\rho^{2}}+\\ldots+\\frac{1}{%&#10;\\rho^{K}}.\" display=\"block\"><mrow><mrow><mfrac><mn>1</mn><mrow><mi mathvariant=\"normal\">Π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mn>1</mn><mi>ρ</mi></mfrac><mo>+</mo><mfrac><mn>1</mn><msup><mi>ρ</mi><mn>2</mn></msup></mfrac><mo>+</mo><mi mathvariant=\"normal\">…</mi><mo>+</mo><mfrac><mn>1</mn><msup><mi>ρ</mi><mi>K</mi></msup></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nTherefore, $\\displaystyle {\\frac{\\partial \\Pi(\\gamma_i)}{\\partial \\gamma_i}<0}$ and hence $\\displaystyle {\\frac{\\partial \\phi(\\gamma_i)}{\\partial \\gamma_i}}<0$. In particular, we have $\\displaystyle{\\frac{\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}<0$. Thus, we have $\\displaystyle { \\bigg(\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}+ \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}\\bigg)}>0$ and finally $\\displaystyle{\\frac{\\partial \\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})}{\\partial p_j}}<0$. We deduce then that $\\dot{u}_{i}$ is a decreasing function of $p_j$. It reaches its maximum when $p_j=0$ and it is minimum when $p_j=p_j^{\\max}$ (for all $j\\neq i$). When substituting $p_j=0$ in the SINR expression, this allows the determination of the optimal power:\n\n", "itemtype": "equation", "pos": 53610, "prevtext": "\nConsequently, we have: \n\n", "index": 79, "text": "\\begin{equation}\n\\frac{\\partial \\Pi(\\gamma_i)}{\\partial \\rho} = \\Pi^2(\\gamma_i)\\bigg[\\frac{1}{\\rho^2}+\\frac{2}{\\rho^3}+\\ldots+\\frac{K}{\\rho^{K+1}}\\bigg]>0.\n\\label{13}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial\\Pi(\\gamma_{i})}{\\partial\\rho}=\\Pi^{2}(\\gamma_{i})\\bigg{[}\\frac{%&#10;1}{\\rho^{2}}+\\frac{2}{\\rho^{3}}+\\ldots+\\frac{K}{\\rho^{K+1}}\\bigg{]}&gt;0.\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi mathvariant=\"normal\">Π</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ρ</mi></mrow></mfrac><mo>=</mo><mrow><msup><mi mathvariant=\"normal\">Π</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>γ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mfrac><mn>1</mn><msup><mi>ρ</mi><mn>2</mn></msup></mfrac><mo>+</mo><mfrac><mn>2</mn><msup><mi>ρ</mi><mn>3</mn></msup></mfrac><mo>+</mo><mi mathvariant=\"normal\">…</mi><mo>+</mo><mfrac><mi>K</mi><msup><mi>ρ</mi><mrow><mi>K</mi><mo>+</mo><mn>1</mn></mrow></msup></mfrac></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow></mrow><mo>&gt;</mo><mn>0</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nwith: $\\displaystyle{\\gamma_{i} = \\frac{p_i|g_i|^2}{\\sigma^2}}$.\\\\\nThe latter equation is a function of the SINR. We determine then the solution in terms of SINR which we denote $\\bar{\\gamma}_i$ and for which the optimal power is $\\displaystyle{\\bar{p}_i=\\frac{\\bar{\\gamma}_i\\sigma^2}{|g_i|^2}}$. This SINR exists due to the quasi-concavity of $u_i$ in $(p_i,\\mathbf{p}_{-i})$ \\cite{VarmaICC2012,VarmaTVT2014}. Then, we have: \n\n", "itemtype": "equation", "pos": 54692, "prevtext": "\nTherefore, $\\displaystyle {\\frac{\\partial \\Pi(\\gamma_i)}{\\partial \\gamma_i}<0}$ and hence $\\displaystyle {\\frac{\\partial \\phi(\\gamma_i)}{\\partial \\gamma_i}}<0$. In particular, we have $\\displaystyle{\\frac{\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}}<0$. Thus, we have $\\displaystyle { \\bigg(\\frac{-b\\partial \\phi(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}+ \\dot{p}_i q \\bigg(\\frac{(1-\\phi(\\dot{\\gamma}_{i}))}{f(\\dot{\\gamma}_{i})}\\bigg)^2\\frac{\\partial f(\\dot{\\gamma}_{i})}{\\partial \\dot{\\gamma}_{i}}\\bigg)}>0$ and finally $\\displaystyle{\\frac{\\partial \\dot{u}_{i}({\\dot{p}_i,\\mathbf{p}_{-i}})}{\\partial p_j}}<0$. We deduce then that $\\dot{u}_{i}$ is a decreasing function of $p_j$. It reaches its maximum when $p_j=0$ and it is minimum when $p_j=p_j^{\\max}$ (for all $j\\neq i$). When substituting $p_j=0$ in the SINR expression, this allows the determination of the optimal power:\n\n", "index": 81, "text": "\\begin{equation}\nb\\frac{|g_i|^2}{\\sigma^2}\\Phi^\\prime(\\gamma_i(p_i))+ q\\bigg(\\frac{(1-\\Phi(\\gamma_i(p_i)))}{f(\\gamma_i(p_i))}\\bigg)^2 \\bigg [f(\\gamma_i(p_i))-\\gamma_i f^\\prime(\\gamma_i(p_i))\\bigg]=0,\n\\label{17}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"b\\frac{|g_{i}|^{2}}{\\sigma^{2}}\\Phi^{\\prime}(\\gamma_{i}(p_{i}))+q\\bigg{(}\\frac%&#10;{(1-\\Phi(\\gamma_{i}(p_{i})))}{f(\\gamma_{i}(p_{i}))}\\bigg{)}^{2}\\bigg{[}f(%&#10;\\gamma_{i}(p_{i}))-\\gamma_{i}f^{\\prime}(\\gamma_{i}(p_{i}))\\bigg{]}=0,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><msup><mi>σ</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>q</mi><mo>⁢</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><msup><mi>f</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\n\\subsection{Determination of $\\lambda_{\\max}$}\n\\label{sec:DeterminationOfLambdaMax}\n\nThe SINR $\\tilde{\\gamma}_i$ refers to the SINR when playing the new OP while $\\gamma_i^{\\ast}$, $\\bar{\\gamma}_i$ and $\\widehat{\\gamma_i}$ are the SINRs at the NE, at the maximal utility and at the utility min-max respectively. In order to simplify expressions, we define the following notations: \n\n", "itemtype": "equation", "pos": 55345, "prevtext": "\nwith: $\\displaystyle{\\gamma_{i} = \\frac{p_i|g_i|^2}{\\sigma^2}}$.\\\\\nThe latter equation is a function of the SINR. We determine then the solution in terms of SINR which we denote $\\bar{\\gamma}_i$ and for which the optimal power is $\\displaystyle{\\bar{p}_i=\\frac{\\bar{\\gamma}_i\\sigma^2}{|g_i|^2}}$. This SINR exists due to the quasi-concavity of $u_i$ in $(p_i,\\mathbf{p}_{-i})$ \\cite{VarmaICC2012,VarmaTVT2014}. Then, we have: \n\n", "index": 83, "text": "\\begin{equation}\n\\bar{u}_i = \\max_{\\mathbf{p}}u_i(\\mathbf{p}) = \\displaystyle{\\frac{Rq(1-\\phi(\\bar{\\gamma}_i))}{\\displaystyle{b+\\frac{\\bar{\\gamma}_i\\sigma^2}{|g_i|^2}\\frac{q(1-\\phi(\\bar{\\gamma}_i))}{f(\\bar{\\gamma}_i)}}}}.\n\\label{18}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"\\bar{u}_{i}=\\max_{\\mathbf{p}}u_{i}(\\mathbf{p})=\\displaystyle{\\frac{Rq(1-\\phi(%&#10;\\bar{\\gamma}_{i}))}{\\displaystyle{b+\\frac{\\bar{\\gamma}_{i}\\sigma^{2}}{|g_{i}|^%&#10;{2}}\\frac{q(1-\\phi(\\bar{\\gamma}_{i}))}{f(\\bar{\\gamma}_{i})}}}}.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>=</mo><mrow><mrow><munder><mi>max</mi><mi>𝐩</mi></munder><mo>⁡</mo><msub><mi>u</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐩</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>b</mi><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nAt a stage $t$, the equilibrium condition is \\cite{LeTreust2010}:\n\n", "itemtype": "equation", "pos": 55976, "prevtext": "\n\n\\subsection{Determination of $\\lambda_{\\max}$}\n\\label{sec:DeterminationOfLambdaMax}\n\nThe SINR $\\tilde{\\gamma}_i$ refers to the SINR when playing the new OP while $\\gamma_i^{\\ast}$, $\\bar{\\gamma}_i$ and $\\widehat{\\gamma_i}$ are the SINRs at the NE, at the maximal utility and at the utility min-max respectively. In order to simplify expressions, we define the following notations: \n\n", "index": 85, "text": "\\begin{equation*}\n\\begin{array}{lcl}\nA & = & Rq(1-\\phi(\\bar{\\gamma}_i))\\\\\nB & = & \\displaystyle{\\frac{q(1-\\phi(\\bar{\\gamma}_i))}{f(\\bar{\\gamma}_i)}}\\\\\nC & = & Rq(1-\\phi(\\widehat{\\gamma}_i))\\\\\nD & = & \\displaystyle{\\frac{q(1-\\phi(\\widehat{\\gamma}_i))}{f(\\widehat{\\gamma}_i)}}\\\\\nE & = & Rq(1-\\phi(\\gamma_i^{\\ast}))\\\\\nF & = & \\displaystyle{\\frac{q(1-\\phi(\\gamma_i^{\\ast}))}{f(\\gamma_i^{\\ast})}}\\\\\nG & = & Rq(1-\\phi(\\tilde{\\gamma}_i))\\\\\nH & = & \\displaystyle{\\frac{q(1-\\phi(\\tilde{\\gamma}_i))}{f(\\tilde{\\gamma}_i)}}\n\\end{array}\n\\label{B3}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}A&amp;=&amp;Rq(1-\\phi(\\bar{\\gamma}_{i}))\\\\&#10;B&amp;=&amp;\\displaystyle{\\frac{q(1-\\phi(\\bar{\\gamma}_{i}))}{f(\\bar{\\gamma}_{i})}}\\\\&#10;C&amp;=&amp;Rq(1-\\phi(\\widehat{\\gamma}_{i}))\\\\&#10;D&amp;=&amp;\\displaystyle{\\frac{q(1-\\phi(\\widehat{\\gamma}_{i}))}{f(\\widehat{\\gamma}_{i%&#10;})}}\\\\&#10;E&amp;=&amp;Rq(1-\\phi(\\gamma_{i}^{\\ast}))\\\\&#10;F&amp;=&amp;\\displaystyle{\\frac{q(1-\\phi(\\gamma_{i}^{\\ast}))}{f(\\gamma_{i}^{\\ast})}}\\\\&#10;G&amp;=&amp;Rq(1-\\phi(\\tilde{\\gamma}_{i}))\\\\&#10;H&amp;=&amp;\\displaystyle{\\frac{q(1-\\phi(\\tilde{\\gamma}_{i}))}{f(\\tilde{\\gamma}_{i})}}%&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mi>A</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>B</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>C</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>^</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>D</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>^</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo>^</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>E</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>F</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>G</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mi>R</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi>H</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mfrac><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nKnowing that $\\sum_{s\\geq t+1}{(1-\\lambda)^{s-t}} = (1-\\lambda)/\\lambda$, we have: \n\n", "itemtype": "equation", "pos": 56593, "prevtext": "\nAt a stage $t$, the equilibrium condition is \\cite{LeTreust2010}:\n\n", "index": 87, "text": "\\begin{equation}\n\\begin{array}{c}\n\\lambda \\bar{u}_i(\\mathbf{p}(t)) + \\sum_{s\\geq t+1}{\\lambda (1-\\lambda)^{s-t}\\mathbb{E}_{g}[u_i^{\\ast}(\\mathbf{p}(s))]} \\\\\n\\leq \\lambda \\tilde{u}_i(\\mathbf{p}(t)) + \\sum_{s\\geq t+1}{\\lambda (1-\\lambda)^{s-t}\\mathbb{E}_{g}[\\tilde{u}_i(\\mathbf{p}(s))]}\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{c}\\lambda\\bar{u}_{i}(\\mathbf{p}(t))+\\sum_{s\\geq t+1}{\\lambda(1%&#10;-\\lambda)^{s-t}\\mathbb{E}_{g}[u_{i}^{\\ast}(\\mathbf{p}(s))]}\\\\&#10;\\leq\\lambda\\tilde{u}_{i}(\\mathbf{p}(t))+\\sum_{s\\geq t+1}{\\lambda(1-\\lambda)^{s%&#10;-t}\\mathbb{E}_{g}[\\tilde{u}_{i}(\\mathbf{p}(s))]}\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>s</mi><mo>≥</mo><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow></mrow></munder><mrow><mi>λ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>s</mi><mo>-</mo><mi>t</mi></mrow></msup><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msubsup><mi>u</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi/><mo>≤</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>s</mi><mo>≥</mo><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow></mrow></munder><mrow><mi>λ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>s</mi><mo>-</mo><mi>t</mi></mrow></msup><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 56989, "prevtext": "\nKnowing that $\\sum_{s\\geq t+1}{(1-\\lambda)^{s-t}} = (1-\\lambda)/\\lambda$, we have: \n\n", "index": 89, "text": "\\begin{equation}\n\\lambda \\bar{u}_i + (1-\\lambda)\\mathbb{E}_{g}[u_i^{\\ast}] \\leq \\lambda \\tilde{u}_i+(1-\\lambda)\\mathbb{E}_{g}[\\tilde{u}_i]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"\\lambda\\bar{u}_{i}+(1-\\lambda)\\mathbb{E}_{g}[u_{i}^{\\ast}]\\leq\\lambda\\tilde{u}%&#10;_{i}+(1-\\lambda)\\mathbb{E}_{g}[\\tilde{u}_{i}]\" display=\"block\"><mrow><mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msubsup><mi>u</mi><mi>i</mi><mo>∗</mo></msubsup><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>≤</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msub><mover accent=\"true\"><mi>u</mi><mo stretchy=\"false\">~</mo></mover><mi>i</mi></msub><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 57144, "prevtext": "\n\n\n", "index": 91, "text": "\\begin{equation}\n\\begin{array}{c}\n\\Longleftrightarrow \\lambda {\\frac{A|g_i|^2}{{b|g_i|^2+\\bar{\\gamma}_i\\sigma^2B}}} + (1-\\lambda)\\mathbb{E}_{g}\\left[{\\frac{E|g_i|^2}{{b|g_i|^2+\\gamma_i^{\\ast}\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\ast} |g_j|^2}\\right)F}}}\\right] \\\\\n \\leq \\lambda {\\frac{G|g_i|^2}{{b|g_i|^2+\\tilde{\\alpha}H}}}+(1-\\lambda)\\mathbb{E}_{g}\\left[ {\\frac{G|g_i|^2}{{b|g_i|^2+\\tilde{\\alpha}H}}}\\right]\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E44.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{c}\\Longleftrightarrow\\lambda{\\frac{A|g_{i}|^{2}}{{b|g_{i}|^{2}%&#10;+\\bar{\\gamma}_{i}\\sigma^{2}B}}}+(1-\\lambda)\\mathbb{E}_{g}\\left[{\\frac{E|g_{i}|%&#10;^{2}}{{b|g_{i}|^{2}+\\gamma_{i}^{\\ast}\\left(\\sigma^{2}+\\sum_{j\\neq i}{p_{j}^{%&#10;\\ast}|g_{j}|^{2}}\\right)F}}}\\right]\\\\&#10;\\leq\\lambda{\\frac{G|g_{i}|^{2}}{{b|g_{i}|^{2}+\\tilde{\\alpha}H}}}+(1-\\lambda)%&#10;\\mathbb{E}_{g}\\left[{\\frac{G|g_{i}|^{2}}{{b|g_{i}|^{2}+\\tilde{\\alpha}H}}}%&#10;\\right]\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mi/><mo>⟺</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><mfrac><mrow><mi>A</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mi>B</mi></mrow></mrow></mfrac></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mfrac><mrow><mi>E</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mo>∗</mo></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>F</mi></mrow></mrow></mfrac><mo>]</mo></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi/><mo>≤</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝔼</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac><mo>]</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\nLet $\\Psi$ and $\\Gamma$ define the following quantities : \n\n", "itemtype": "equation", "pos": 57580, "prevtext": "\n\n\n", "index": 93, "text": "\\begin{equation}\n\\begin{array}{c}\n\\Rightarrow \\lambda \\left[{\\frac{A\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\bar{\\gamma}_i\\sigma^2B}} - \\frac{G\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\tilde{\\alpha}H}}} \\right] \\\\\n\\leq (1-\\lambda)\\left[{\\frac{G\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\tilde{\\alpha}H}} - \\frac{E\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\gamma_i^{\\ast}\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\ast} \\nu_i^{\\max}}\\right)F}}}\\right].\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E45.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{c}\\Rightarrow\\lambda\\left[{\\frac{A\\nu_{i}^{\\max}}{{b\\nu_{i}^{%&#10;\\min}+\\bar{\\gamma}_{i}\\sigma^{2}B}}-\\frac{G\\nu_{i}^{\\max}}{{b\\nu_{i}^{\\min}+%&#10;\\tilde{\\alpha}H}}}\\right]\\\\&#10;\\leq(1-\\lambda)\\left[{\\frac{G\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\tilde{\\alpha}H}%&#10;}-\\frac{E\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\gamma_{i}^{\\ast}\\left(\\sigma^{2}+%&#10;\\sum_{j\\neq i}{p_{j}^{\\ast}\\nu_{i}^{\\max}}\\right)F}}}\\right].\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mi/><mo>⇒</mo><mrow><mi>λ</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><mrow><mi>A</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mi>B</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mrow><mi/><mo>≤</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>λ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>E</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mo>∗</mo></msubsup><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>F</mi></mrow></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\nThen, the NE corresponding to the DRG is given by the following action plan $\\forall t \\geq 1$:\n\n", "itemtype": "equation", "pos": 32918, "prevtext": "\nwith:\n\n", "index": 49, "text": "\\begin{equation*}\n\\begin{array}{lcl}\n\\Gamma & = & \\displaystyle{\\frac{A\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\bar{\\gamma}_i\\sigma^2B}} - \\frac{G\\nu_i^{\\max}}{{b\\nu_i^{\\min}+\\tilde{\\alpha}H}}}\\\\\n\\Psi & = & \\displaystyle{\\frac{G\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\tilde{\\alpha}H}}-\\frac{E\\nu_i^{\\min}}{{b\\nu_i^{\\max}+\\gamma_i^{\\ast}\\left(\\sigma^2+\\sum_{j \\neq i}{p_j^{\\ast} \\nu_i^{\\max}}\\right)F}}}\n\\end{array}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lcl}\\Gamma&amp;=&amp;\\displaystyle{\\frac{A\\nu_{i}^{\\max}}{{b\\nu_{i}^{%&#10;\\min}+\\bar{\\gamma}_{i}\\sigma^{2}B}}-\\frac{G\\nu_{i}^{\\max}}{{b\\nu_{i}^{\\min}+%&#10;\\tilde{\\alpha}H}}}\\\\&#10;\\Psi&amp;=&amp;\\displaystyle{\\frac{G\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\tilde{\\alpha}H}}%&#10;-\\frac{E\\nu_{i}^{\\min}}{{b\\nu_{i}^{\\max}+\\gamma_{i}^{\\ast}\\left(\\sigma^{2}+%&#10;\\sum_{j\\neq i}{p_{j}^{\\ast}\\nu_{i}^{\\max}}\\right)F}}}\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Γ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>A</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>γ</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup><mo>⁢</mo><mi>B</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mi mathvariant=\"normal\">Ψ</mi></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mfrac><mrow><mi>G</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>α</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mi>H</mi></mrow></mrow></mfrac><mo>-</mo><mfrac><mrow><mi>E</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>min</mi></msubsup></mrow><mrow><mrow><mi>b</mi><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>γ</mi><mi>i</mi><mo>∗</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>σ</mi><mn>2</mn></msup><mo>+</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>≠</mo><mi>i</mi></mrow></msub><mrow><msubsup><mi>p</mi><mi>j</mi><mo>∗</mo></msubsup><mo>⁢</mo><msubsup><mi>ν</mi><mi>i</mi><mi>max</mi></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>F</mi></mrow></mrow></mfrac></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00873.tex", "nexttext": "\n\n\\end{appendices}\n\n\n\n\\section*{Competing interests}\n\nThe authors declare that they have no competing interests.\n\t\n\n\n\n\\begin{thebibliography}{100}\n\n\\bibitem{lister-09} \nD. Lister, An operators view on green radio, Proc. IEEE Internet. Conf. on Comm. Workshops (ICC Workshops 2009), 1st Int. Workshop on Green Comm. (GreenComm 09), (2009).\n\n\\bibitem{palicot-2005} \nJ. Palicot and C. Roland, On the use of cognitive radio for decreasing the electromagnetic radiations, URSI 05, XXVIII General Assembly, (Oct. 2005).\n\n\\bibitem{greentouch-10} \nGreenTouch, Communications turns totally green, Press Release, (Jan. 2010).\n\n\\bibitem{Yu2006}  \nY. Yu, V. K. Prasanna and B. Krishnamachari, Energy minimization for real-time data gathering in wireless sensor networks, IEEE Transactions on Wireless Communications, 5(11):3087-3096, (Nov. 2006).\n\n\\bibitem{Bandyopadhyay2003} \nS. Bandyopadhyay and E. J. Coyle, An energy efficient hierarchical clustering algorithm for wireless sensor networks, INFOCOM 2003. 22nd Annual Joint Conference of the IEEE Computer and Communications. IEEE Societies, 3:1713-1723, (2003).\n\n\n\\bibitem{Cardei2005} \nM. Cardei, M. T. Thai, Y. Li and W. Wu,  Energy-efficient target coverage in wireless sensor networks, INFOCOM 2005. 24th Annual Joint Conference of the IEEE Computer and Communications Societies. Proceedings IEEE, 3:1976-1984, (Mar. 2005).\n\n\\bibitem{Zappone2015} \nA. Zappone and E. Jorswieck, Energy Efficiency in Wireless Networks via Fractional Programming Theory, Foundations and Trends in Communications and Information Theory, 11(3-4):185-396, (Jun. 2015).\n\n\\bibitem{Isheden2012} \nC. Isheden, Z. Chong, E. Jorswieck and G. Fettweis, Framework for Link-Level Energy Efficiency Optimization with Informed Transmitter, IEEE Transactions on Wireless Communications, 11(8):2946-2957, (Aug. 2012).\n\n\\bibitem{LasaulceTWC2009} \nS. Lasaulce, Y. Hayel, R. E. Azouzi and M. Debbah, Introducing hierarchy in energy games, IEEE Transactions on Wireless Communications, 8(7):3833-3843, (Jul. 2009).\n\n\\bibitem{Goodman2000} \nD. J. Goodman and N. B. Mandayam, Power control for wireless data, IEEE Personal Communications, 7(2):48-54, (Apr. 2000).\n\n\\bibitem{Betz2008} \nS. M. Betz and H. V. Poor, Energy efficient communications in \\textsc{CDMA} networks: \\textsc{A} game theoretic analysis considering operating costs, IEEE Transactions on Signal Processing, 56(10):5181-5190, (Sep. 2008).\n\n\\bibitem{Zappone2013} \nA. Zappone, Z. Chong, E. Jorswieck and S. Buzzi, Energy-aware competitive power control in relay-assisted interference wireless networks, IEEE Transactions on Wireless Communications, 12(4):1860-1871, (Apr. 2013).\n\n\\bibitem{VarmaICC2012} \nV. S. Varma, S. Lasaulce, Y. Hayel, S. E. Elayoubi and M. Debbah, Cross-layer design for green power control, IEEE International Conference on Communications (ICC), 4021-4026, (Jun. 2012).\n\n\\bibitem{VarmaTVT2014} \nV. S. Varma, S. Lasaulce, Y. Hayel and S. E. Elayoubi, A cross-layer approach for distributed energy-efficient power control in interference networks, IEEE Transactions on Vehicular Technology, (Aug. 2014).\n\n\\bibitem{MhiriNov2012} \nM. Mhiri, K. Cheikhrouhou, A. Samet, F. M\\'eriaux and Samson Lasaulce, Energy-efficient spectrum sharing in relay-assisted cognitive radio systems, IEEE Proceedings of the 6th International Conference on Network Games, Control and Optimization (NETGCOOP), 86-91, (Nov. 2012).\n\n\\bibitem{Lasaulce2009} \nS. Lasaulce, M. Debbah and E. Altman, Methodologies for analyzing equilibria in wireless games: a look at pure, mixed, and correlated equilibria, IEEE Signal Processing Magazine, 26(5):41-52, (Sep. 2009).\n\n\n\\bibitem{Lasaulce2011}\nS. Lasaulce and H. Tembine, Game theory and learning for wireless networks: fundamentals and applications. Academic Press, Elsevier, (Jul. 2011).\n\n\\bibitem{LeTreust2010} \nM. Le Treust and S. Lasaulce, A repeated game formulation of energy-efficient decentralized power control, IEEE Transactions on Wireless Communications, 9(9):2860-2869, (Sep. 2010).\n\n\\bibitem{Mhiri2013} \nM. Mhiri, V. S. Varma, M. Le Treust, S. Lasaulce and A. Samet, On the benefits of repeated game models for green cross-layer power control in small cells, 1st International Black Sea Conference on Communications and Networking (BlackSeaCom), 137-141, (Jul. 2013).\n\n\\bibitem{Abidi2007} \nM. Abidi and V. T. Vakili, A game theoretic approach for SINR-constrained power control in 3G cellular CDMA communication systems, IEEE 18th International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC), 1-5, (Sep. 2007).\n\n\\bibitem{Hossain2009}\nE. Hossain, D. Niyato and Z. Han, Dynamic spectrum access and management in cognitive radio networks. Cambridge University Press, (Jul. 2009).\n\n\\bibitem{Larsson2008} \nE. G. Larsson and E. A. Jorswieck, Competition versus cooperation on the MISO interference channel, IEEE Journal on Selected Areas in Communications, 26(7):1059-1069, (Sep. 2008).\n\n\\bibitem{Friedman1971}  \nJ. Friedman, A non-cooperative equilibrium for supergames, Review of Economic Studies, 38(1):1-12, (1971).\n\n\\bibitem{Hart2006} \nS. Hart, Robert Aumann's game and economic theory, Scandinavian Journal of Economics, 108(2):185-211, (2006).\n\n\\bibitem{Sorin1992} \nS. Sorin, Repeated games with complete information, in \\emph{Handbook of game theory}, R. J. Aumann and S. Hart, Eds. Elsevier Science Publishers, 1:72-107, (1992).\n\n\\bibitem{Aumann1994} \nR. J. Aumann and L. S. Shapley, Long-term competition-A game-theoretic analysis, 1-26, preprint, (1976).\n\n\n\\bibitem{Xu2012} \nY. Xu, J. Wang, Q. Wu, A. Anpalagan and Y. D. Yao, Opportunistic spectrum access in unknown dynamic environment: A game-theoretic stochastic learning solution, IEEE Transactions on Wireless Communications, 11(4):1380-1391, (Apr. 2012).\n\n\\bibitem{Li2010} \nH. Li, Multi-agent Q-learning for Aloha-like spectrum access in cognitive radio systems, EURASIP Journal on Wireless Communications and Networking, 2010:1-15, (Apr. 2010).\n\n\\bibitem{Song2011} \nY. Song, S. H. Y. Wong and K. W. Lee, Optimal gateway selection in multidomain wireless networks: A potential game perspective, MobiCom'11 Proceedings of the 17th annual international conference on mobile computing and networking, 325-336, (2011).\n\n\\bibitem{Belmega2009}  \nE. V. Belmega and S. Lasaulce, An information-theoretic look at MIMO energy-efficient communications, VALUETOOLS'09 Proceedings of the 4th International ICST Conference on Performance Evaluation Methodologies and Tools, (Oct. 2009).\n\n\\bibitem{Belmega2011}  \nE. V. Belmega and S. Lasaulce, Energy-efficient precoding for multiple-antenna terminals, IEEE Transactions on Signal Processing, 59(1):329-340, (Jan. 2011).\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 58481, "prevtext": "\n\nThus: \n\n", "index": 97, "text": "\\begin{equation}\n\\displaystyle{{\\lambda_{\\max} = \\frac{\\Psi}{\\Gamma+\\Psi}}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E46.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{{\\lambda_{\\max}=\\frac{\\Psi}{\\Gamma+\\Psi}}}.\" display=\"block\"><mrow><mrow><msub><mi>λ</mi><mi>max</mi></msub><mo>=</mo><mfrac><mi mathvariant=\"normal\">Ψ</mi><mrow><mi mathvariant=\"normal\">Γ</mi><mo>+</mo><mi mathvariant=\"normal\">Ψ</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]