[{"file": "1601.03040.tex", "nexttext": "\nwhere  $F_{\\nu}$, $d$, $\\kappa_{\\nu}$, and $B_{\\nu}(T_d)$, are respectively the total observed flux, distance, grain opacity,\nand blackbody intensity at dust temperature $T_d$.\nWe estimate $\\kappa_{\\nu}$ at 8.1 mm by normalizing to \\citet{oh94} at 1.3 mm using a dust to gas ratio of $1/100$: \n$\\kappa_{\\nu}$ = $(1/100)(\\nu/231\\mathrm{GHz}))^{\\beta}$ cm$^{2}$~g$^{-1}$. $\\beta$ = 1 is typically assumed for protostellar disks \\citep{an09}, giving $\\kappa_{\\nu}=0.00146$ cm$^{2}$~g$^{-1}$.\n Mass estimates are inherently ambiguous within an order of magnitude due to uncertainties in the dust-to-gas ratio, $T_d$, and $\\beta$; \nrather than compute a single mass estimate, we calculate lower and upper mass estimates for each source\nby varying $T_d$. \nLower masses were estimated by assuming $T_d$ = 40 K, and we determined upper estimates using $T_d$ = 20 K. \nThese candidate disks range in flux from 867.5 $\\mu$Jy to 1664.9 $\\mu$Jy, providing \n estimated masses of 0.09--0.36 {M$_\\odot$}~(Table 2).\\\\\n \n\n \n  \n\\section{Modeling}\n\nWe modeled the 8~mm A+B array continuum data  by fitting a symmetric disk intensity profile to the continuum emission of each source.\nIn this modeling, we deprojected the 8 mm \nvisibility data to a fixed position angle (P.A.)\nand fixed inclination as determined through image-plane 2D Gaussian \nfitting of the disk candidates and assumed the disks are circularly symmetric (Table 2). We  \nazimuthally averaged the visibility data in the {\\it u,v}-plane and binned the data in linearly spaced bins of width 50 k$\\lambda$  \nfrom 0 to 1500 k$\\lambda$, switching to 30 log-spaced bins from 1500 to 4000 k$\\lambda$ \nwhere the data becomes noisier in order to boost the signal-to-noise level at large {\\it u,v}-distances.\nWe accounted for a lower-limit free-free point source component emanating from shocks in the protostellar jets \\citep{an98}.  Because point sources in the image domain have constant flux density at all {\\it u,v}-distances, we account for the free-free component by calculating the average real component of the binned data with {\\it u,v}-distance \n$>$1700 k$\\lambda$ and include the average as a flat, linear component of the model (Table 2); the profiles become flat at values $>$1700 k$\\lambda$ in all seven sources (e.g., Figure 2).  \n\nWe fitted the real components of the deprojected, averaged, and binned profile to a simple\ndisk model using a C-based implementation of \\texttt{emcee}, an affine-invariant Markov chain Monte Carlo ensemble sampler \\citep{gw10,fm13}. The imaginary components were assumed to be zero in the model\nsince the disk is positioned at the phase center and assumed to be symmetric.\n The model mimics  a Shakura-Sunyaev \ndisk \\citep{ss73} with a power law temperature profile; the resultant model disk surface brightness profile is\n\n\n", "itemtype": "equation", "pos": 13043, "prevtext": "\n\n\n\n\n\\title{The VLA Nascent Disk and Multiplicity Survey: First Look at\nResolved Candidate Disks around Class 0 and I Protostars in the Perseus Molecular Cloud}\n\n\\author{Dominique M. Segura-Cox\\altaffilmark{1}, Robert J. Harris\\altaffilmark{1},  John J. Tobin\\altaffilmark{2}, Leslie W. Looney\\altaffilmark{1}, Zhi-Yun Li\\altaffilmark{3}, Claire Chandler\\altaffilmark{4}, Kaitlin Kratter\\altaffilmark{5}, Michael M. Dunham\\altaffilmark{6}, Sarah Sadavoy\\altaffilmark{7}, Laura Perez\\altaffilmark{4}, Carl Melis\\altaffilmark{8}}\n\\altaffiltext{1}{Department of Astronomy, University of Illinois, Urbana, IL 61801, USA; segurac2@illinois.edu}\n\\altaffiltext{2}{Leiden Observatory, Leiden University, P.O. Box 9513, 2000-RA Leiden, The Netherlands}\n\\altaffiltext{3}{Department of Astronomy, University of Virginia, Charlottesville, VA 22903, USA}\n\\altaffiltext{4}{National Radio Astronomy Observatory, Socorro, NM 87801, USA}\n\\altaffiltext{5}{Steward Observatory, University of Arizona, Tucson, AZ 85721, USA}\n\\altaffiltext{6}{Harvard-Smithsonian Center for Astrophysics, Cambridge, MA 02138, USA}\n\\altaffiltext{7}{Max-Planck-Institut f{\\\"u}r Astronomie, D-69117 Heidelberg, Germany}\n\\altaffiltext{8}{Center for Astrophysics and Space Sciences, University of California, San Diego, CA 92093, USA}\n\n    \n\\begin{abstract}\nWe present the first dust emission results toward a sample of seven protostellar disk candidates around Class 0 and I sources in the Perseus molecular cloud from the VLA Nascent Disk and Multiplicity (VANDAM) survey with $\\sim$0.05$^{\\prime\\prime}$ or 12 AU resolution. \n To examine the surface brightness profiles of these sources, we fit the Ka-band 8 mm dust-continuum data in the \\textit{u,v}-plane to a simple, parametrized model based on the Shakura-Sunyaev disk model. The candidate disks are well-fit by a model with a disk-shaped profile and have masses consistent with known Class 0 and I disks.  The inner-disk surface densities of the VANDAM candidate disks have shallower density profiles compared to disks around more evolved Class II systems.  The best-fit model radii of the seven early-result candidate disks are $R_{c}$ $>$ 10 AU; at 8 mm, the radii reflect lower limits on the disk size since dust continuum emission is tied to grain size and large grains radially drift inwards. These relatively large disks, if confirmed kinematically, are inconsistent with theoretical models where the disk size is limited by strong magnetic braking to $<$ 10 AU at early times. \n\\end{abstract}\n\\keywords{protoplanetary disks --- stars: protostars}\n\n\n\\section{Introduction}\n\n\nDisks around young protostars are intrinsically linked to planet formation, binary formation, and protostellar mass \naccretion \\citep{wc11,ar11}.  \nIn spite of their importance in star formation, when and how disks form--and their properties at early times--are poorly constrained. Hence, whether large and massive disks can form in young protostars \\citep[i.e.~Class 0/I stages,][]{an00,du14} is subject to debate \\citep[e.g.,][respectively]{jg09,ch08,ma10}.  Theoretical studies demonstrate magnetic fields can affect the formation timescales and properties of disks.  In particular, strong magnetic fields can remove angular momentum from a collapsing envelope via magnetic braking, reducing forming disks to $R$ $<$ 10 AU \\citep[e.g.,][]{ml08,db10,ma11,li11,dbk12}.  \nComplicating the issue, several mechanisms can lessen the effects of magnetic braking, leading to larger disks: misalignment between the rotation axis and magnetic field of the system \\citep[e.g.,][]{jo12,li13}, turbulence \\citep[e.g.,][]{se13,jo13}, and initial conditions \\citep[e.g.,][]{ma14}.\nThe protostellar stage represents the stage with the largest mass reservoir available to form disks, therefore understanding the properties of disks at early epochs is crucial to determine the formation mechanism behind these structures.\n\nProtostellar disks, however, are difficult to observe.\nClass 0 protostars and disks are so enshrouded that $\\gtrsim$90\\% of their  \nmillimeter emission comes from\nthe envelope \\citep{lo00}.  \nThe three Class 0 protostars that have been observed with \nenough resolution and sensitivity to determine their disk properties and detect Keplerian rotation (L1527, VLA 1623, and HH212) have $R$ $>$ 30 AU disks, larger than expected \nfrom strong magnetic braking models \\citep{oh14,to12,mu13,cd14}.\nObservational limitations prevent smaller disks from being detected; these Class 0 disks may not represent typical disks at this stage of evolution.\nClass I protostars are less embedded and have cleared enough of their mass reservoir that more disks have been detected than in Class 0 systems \\citep[e.g.,][]{ha14}, though not as many disks have been revealed as in more-evolved Class II sources \\citep[e.g.,][]{an09,an10}.\nWithout detection and study of more disks around \n the youngest protostellar systems, we cannot characterize early \nconditions of mass accretion onto the central protostar and planet formation because evolutionary mechanisms can change disk properties by the Class II phase \\citep{wc11}.\n\n \\begin{figure*}[t]\n        \\centering\n                \\includegraphics[width=0.495\\textwidth]{mJy_SVS13B_dmr_025_color_bigfont.eps}\n                \\label{fig1a}\n                \\includegraphics[width=0.495\\textwidth]{mJy_Per50_dmr_025_color_bigfont.eps}\n                \\label{fig1b}\n                \\includegraphics[width=0.495\\textwidth]{mJy_IRAS4C_dmr_025_color_bigfont.eps}\n                \\label{fig1c} \n                \\includegraphics[width=0.495\\textwidth]{mJy_Per30_dmr_025_color_bigfont.eps}\n                \\label{fig1d} \n\n\n\n\n\n\n\n\n\n                \\includegraphics[width=0.495\\textwidth]{mJy_HH211_dmr_025_color_bigfont.eps}\n                \\label{fig1e}\n                \\includegraphics[width=0.495\\textwidth]{mJy_IC348_dmr_025_color_bigfont.eps}\n                \\label{fig1f}\n                \\includegraphics[width=0.495\\textwidth]{mJy_PerEmb8_dmr_025_color_bigfont.eps}\n                \\label{fig1g}\n        \\caption{VLA A+B array data (left), $q=0.25$ model from {\\it u,v}-plane best-fit (center), and\nresidual (right). Images were produced with robust = 0.25 weighting. Contours start at 3$\\sigma$ ($\\sigma$ $\\sim$ 15$\\mu$Jy) with a factor of $\\sqrt{2}$ spacing. The synthesized beam is in the lower left.\n        }\\label{fig1}\n\\end{figure*}\n\n\\begin{table*}[t!]\n\\caption{Observations}\n        \\vspace{-0.5cm}\n\\begin{center}\n\\begin{tabular}{lcccccc}\n\\hline\nSource & $\\alpha$ & $\\delta$ & A-array  & B-array & Combined Beam & Beam P.A.\\\\\n& (J2000) & (J2000) & Obs. Date  &  Obs. Date & (mas$\\times$mas) & ($^{\\circ}$)\\\\\n\\hline\nSVS13B & 03:29:03.078 & +31:15:51.740 & 03 May 2014  & 22 Oct 2013 & 105 $\\times$ 83  & -74.8\\\\\nPer-emb-50 & 03:29:07.768 & +31:21:57.125 & 01 Jun 2014 & 26 Oct 2013 &  97 $\\times$ 94 & 54.0 \\\\\nPer-emb-14 & 03:29:13.548 & +31:13:58.153 & 25 Feb 2014 & 22 Oct 2013 & 91  $\\times$ 75 & 82.4 \\\\\nPer-emb-30 & 03:33:27.303 & +31:07:10.161 &  16 May 2014 & 23 Oct 2013  & 99   $\\times$ 92 & -71.5\\\\\nHH211-mms & 03:43:56.805 & +32:00:50.202 & 24 Feb 2014 & 21 Oct 2013 &  96 $\\times$ 77 & 85.4\\\\\nIC348 MMS & 03:43:57.064 & +32:03:04.789 & 23 Mar 2014  & 22 Oct 2013  &  89 $\\times$ 80 & -57.7 \\\\\nPer-emb-8 & 03:44:43.982 & +32:01:35.209 & 22 Feb 2014 & 01 Oct 2013  & 82 $\\times$ 72 & -71.6 \\\\\n\\hline\n\\end{tabular}\\\\\n\\end{center}\n\\tablecomments{Observation dates mark the start of the observations.  Combined beam sizes reflect robust = 0.25 weighting.}\n\\label{tab1} \n\\end{table*}\n\nTo characterize the properties of the youngest disks and binaries, we are using  the Karl G. Jansky Very Large Array (VLA) to conduct the VLA Nascent Disk and Multiplicity (VANDAM) continuum survey at $\\lambda\\sim8, 10 ,40 , 64$ mm toward all identified protostars in the\nPerseus molecular cloud \\citep{to15a}.\nThe Perseus molecular cloud is relatively close \\citep[d $\\sim$ 230 pc;][]{hi08,hi11} and  \n has a significant number of Class 0\nand I protostars \\citep[43 and 37 systems, respectively;][]{to15p}. \nThe early results of the VANDAM survey have already revealed several candidate disk sources \nin both Class 0 and I sources at 10 AU scales.\nWe consider these to be candidate\ndisks because we lack kinematic data on small scales to determine whether these structures are rotationally supported.  Nevertheless, so little is known about this early stage of disk evolution that even continuum-only imaging of young disks provides useful constraints on their properties.\n\nIn this Letter, we present the first results toward some of the protostellar disk candidates \naround Class 0 and \nClass I sources from the VANDAM survey.  We show the observed structures are \nconsistent with disks by fitting \nthe 8 mm dust-continuum data in the {\\it u,v}-plane to a simple, parameterized\nemission model based on the Shakura-Sunyaev disk model.  \nVANDAM survey data provide an unparalleled opportunity to study the youngest disks: the unsurpassed  resolution, sample size, and sensitivity for Class 0 and I protostars, permit a detailed examination of typical continuum properties of young disks.\\\\\n\n\n \\begin{table*}[t!]\n\\caption{Source Data}\n        \\vspace{-0.5cm}\n\\begin{center}\n\\begin{tabular}{lccccccc}\n\\hline\nSource & Class  & Deconvolved Size & Disk P.A. & Disk Inclination  & $F_{8mm}$ & $M_{d}$ & $F_{>1700k\\lambda}$\\\\\n&   &  (mas$\\times$mas) & ($^{\\circ}$) & ($^{\\circ}$)  & ($\\mu$Jy) & (M$_{\\odot}$) & ($\\mu$Jy)\\\\\n\\hline\nSVS13B &  0 & 163$\\times$80 & 71.4$\\pm$2.5 & 61 & 1352.7$\\pm$11.6 & 0.14 - 0.29 & 82.0 \\\\ \nPer-emb-50 &  I &  137$\\times$53 & 170.0$\\pm$0.3  & 67 &1664.9$\\pm$12.5 &  0.18 - 0.36 & 133.2 \\\\ \nPer-emb-14 &  0 &  174$\\times$76 & 12.7$\\pm$0.9  & 64 & 882.1$\\pm$13.0 & 0.09 - 0.19 & 68.8\\\\ \nPer-emb-30 &  0 &  87$\\times$74 & 40.0$\\pm$23.0  &31 & 957.0$\\pm$9.4 &  0.10 - 0.21 & 130.9 \\\\ \nHH211-mms &  0 &  93$\\times$59 & 34.8$\\pm$9.6  & 51& 867.5$\\pm$8.1 &  0.09 - 0.19 & 42.9 \\\\ \nIC348 MMS & 0 &  145$\\times$105 & 70.8$\\pm$2.2  & 44 & 1126.5$\\pm$10.3 & 0.12 - 0.24 & 0.0\\\\ \nPer-emb-8 &  0 &  111$\\times$84 & 116.1$\\pm$2.8  & 41 & 1120.7$\\pm$10.3 &  0.12 - 0.24 & 126.5\\\\ \n\\hline\n\\end{tabular}\\\\\n\\end{center}\n\\tablecomments{Sizes and angles are measured from image-plane 2D Gaussian fits.  Angles are measured counterclockwise from north.  Uncertainties on the deconvolved sizes are $\\sim$5.0 mas. Uncertainties on inclinations are $\\sim$10$^{\\circ}$.}\n\\label{tab2} \n\\end{table*}\n\n\n\\section{Observations}\n\n\n\nThe VANDAM survey includes Ka-band\n lower-resolution ($\\sim$0.28$^{\\prime\\prime}$ or 65 AU) B-array data\n and high-resolution ($\\sim$0.05$^{\\prime\\prime}$ or 12 AU) \nA-array data. \nWe detected 16 protostellar candidate disk sources in the\n Perseus molecular cloud with the data collected in 2013, 2014, and 2015\n(Segura-Cox et al. in prep).\n Here we focus on seven of the candidate disks (Table 1; Figure 1, left) which were\nobserved with A-array prior to 2015 and can be well modeled with the prescription described in Section 4.\n The observations were made in three-bit correlator mode, with a bandwidth of 8 GHz divided into 64 sub-bands. \n Each sub-band has 128 MHz bandwidth, 2 MHz channels, and full polarization products.  \n The two 4 GHz basebands are centered at 36.9 GHz ($\\sim$8.1~mm) and 29.0 GHz ($\\sim$10.5~mm).  \n Three sources were observed in each 3.5 hour block, and two sources were observed in each 2.75 hour block.  Some observations were conducted as 1.5 hour blocks.\n  3C48 served as the flux calibrator, and 3C84 was the bandpass calibrator. \n The observations were taken in fast-switching mode to account for rapid atmospheric phase variations, \n with a 2.5 minute total cycle time to switch between the target source and the complex gain calibrator, \n J0336+3218.  The total integration time on each source was $\\sim$30 minutes for both A-array and B-array.  \n We reduced the data with CASA 4.1.0 and the VLA pipeline (version 1.2.2). \n We executed additional flagging beyond pipeline flagging by inspecting the phase, gain and bandpass\n  calibration solutions.  VLA Ka-band data sets have an estimated amplitude \n  calibration uncertainty of $\\sim$10\\%, but only statistical uncertainties are considered in our \n  analysis.  \\\\\n \n\n\n \\begin{figure*}[t!]\n        \\centering\n                \\includegraphics[width=1.0\\textwidth]{PerEmb14_x25_ffs_visprof_resid_30logbinsAB.eps}\n                \\label{fig1a}               \n        \\caption{Sample real vs {\\it u,v}-distance plot of 8 mm data. Top:  real component of data. The blue dashed line indicates real component of zero.  The red solid line is the best-fit\n        model.    Bottom: residual of real component minus model.\n        }\\label{fig2}  \n\\end{figure*}\n\n \n   \n\\section{Estimated Masses}\n  \n \n\nTwo key quantities that describe disks are their masses and radii.  While accurately determining disk radii requires modeling, \n masses are estimated from flux measurements (Table 2).\nBy assuming optically thin emission, we estimate disk masses from the 8~mm dust continuum flux with the relation \\citep{hl83}:\n\n", "index": 1, "text": "\\begin{equation}\nM=\\frac{d^{2}F_{\\nu}}{B(T_{d})\\kappa_{\\nu}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M=\\frac{d^{2}F_{\\nu}}{B(T_{d})\\kappa_{\\nu}},\" display=\"block\"><mrow><mrow><mi>M</mi><mo>=</mo><mfrac><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>F</mi><mi>ν</mi></msub></mrow><mrow><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>T</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>κ</mi><mi>ν</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03040.tex", "nexttext": " \n\nwhere $I(r)$ is the radial \nsurface brightness distribution, $q$ is the temperature exponent, $\\gamma$ is the power-law of the inner-disk surface density, and\n$r$ is radius.  $R_{c}$ is a characteristic radius at which there is significant\n optical depth and disk material, making it a proxy for outer disk radius. \nThis flux density profile is appropriate here because \nthe 8~mm data is expected to be in the Rayleigh-Jeans tail of the dust emission.  \nFlux is given by $F = \\int_{0}^{\\infty} I(r)~2\\pi r~dr$.\nFlux, disk radius, and gradient were free parameters in the fitting.  We fitted a model disk for values of \n$q=[0.25,0.50,0.75,1.00]$ to the observations in order to avoid over-fitting the data\nwhile exploring reasonable physical values of $q$. \\\\\n\n\n\n\n\n\\section{Results}\n\n\nOnce model fitting was completed on the candidate disks, \nwe generated disk model visibilities corresponding to the best-fit parameters.\nThe best-fit model and residuals for each source were Fourier transformed, \n  sampled at the same {\\it u,v}-points as the data, and imaged using the \n same weighting as the data (Figure 1, center). \n We subtracted the model visibility from the data to produce a residual visibility set.  \n  Synthetic maps were created of the best-fit model disks. Residual maps were made by imaging the Fourier transformed visibilities after subtracting the model from the data in the {\\it u,v}-plane (Figure 1, right).  \nAn example of the binned observational data, model fits, and residuals is also shown in Figure 2.\n \n\n\n\nFit results are shown in Table 3.  The $\\chi^{2}_{\\mathrm{reduced}}$ values near one and the nearly empty residual maps indicate the \n seven candidate disk sources were well-modeled by our simple-shaped disk profile and are hence likely \n to be Class 0 and young Class I disks rather than inner envelope structure \\citep{ch08}.  \n All candidate disks have modeled $R_{c}$ $>$ 10 AU, and except for HH211-mms the disks are large\n compared to the $R$ = 10 AU upper limit predicted by magnetic braking models of \\citet{db10} at the Class 0 stage.   \n\n\nThe model includes a disk and point-source component but does not take into account envelope emission.  \nThe observations filter out the majority of the contaminating envelope emission, demonstrated by \nthe visibility profiles corresponding to $R^{-1.5}$ and $R^{-2.0}$ envelope surface density profiles \nplotted in Figure 2.  These envelope density profiles represent, respectively, free-fall collapse and the singular \nisothermal sphere \\citep{sh77}. \nThe best-fit models were determined from the maximum likelihood, i.e.~the lowest $\\chi^{2}$ value, of \nall models fit to the data.  Values of $q$ near 0.5 are predicted by theory \\citep[e.g.,][]{cg97} for Class II protostars, which are more evolved than the protostars in our sample.\nLower values of $q$ result in lower values of $\\chi^{2}_{\\mathrm{reduced}}$ for six candidate disks.  Values of $q$ $<$ 0.5 for Class 0 and younger Class I sources are  favored since the envelope mass reservoir is still large, and radiation is reprocessed from the protostar and directed back onto the disk, increasing the brightness of the outer disk relative to the inner regions of the disk and flattening the brightness distribution  \\citep{da96}.  Compared to the other modeled protostars,\n$\\chi^{2}_{\\mathrm{reduced}}$ is notably higher for SVS13B\nwhich may be a more complicated source and not well described by the model. \\\\\n\n\\begin{table}[t!]\n\\caption{8mm Best-fit Modeling Results}\n        \\vspace{-0.5cm}\n\\begin{center}\n\\begin{tabular}{lcccc}\n\\hline\nSource & $q$ & $\\gamma$ & $R_{c}$  & $\\chi^{2}_{\\mathrm{reduced}}$  \\\\\n&  &  & (AU)  &   \\\\\n\\hline\nSVS13B & 0.25 & 0.21$^{+0.23}_{-0.20}$ & 24.28$_{-1.7}^{+2.1}$ & 2.194 \\\\\n & 0.50& 0.42$^{+0.25}_{-0.21}$  &  25.50$_{-1.5}^{+1.9}$  & 2.185  \\\\\n & 0.75& 0.63$^{+0.24}_{-0.22}$ & 26.46$_{-1.4}^{+1.6}$  & 2.175  \\\\\n & 1.00& 0.85$^{+0.26}_{-0.23}$ & 27.28$_{-1.2}^{+1.4}$  & 2.164  \\\\\n\\cline{1-5}\nPer-emb-50 & 0.25& 0.08$^{+0.02}_{-0.16}$ & 21.9$_{-0.9}^{+0.8}$ & 1.556  \\\\\n & 0.50&  0.26$^{+0.15}_{-0.17}$ & 23.3$_{-1.0}^{+1.1}$ & 1.558 \\\\\n & 0.75& 0.44$^{+0.16}_{-0.17}$  & 24.6$_{-1.1}^{+1.4}$ & 1.560 \\\\\n & 1.00&  0.64$^{+0.16}_{-0.18}$ & 25.7$_{-1.3}^{+1.4}$& 1.563 \\\\\n\\cline{1-5}\nPer-emb-14 & 0.25& -0.11$^{+0.16}_{-0.00}$ &28.5$_{-2.1}^{+2.3}$ & 1.110  \\\\\n  & 0.50& 0.09$^{+0.08}_{-0.21}$ &  30.6$_{-2.3}^{+2.8}$& 1.114  \\\\\n  & 0.75& 0.27$^{+0.17}_{-0.24}$ & 32.5$_{-2.8}^{+2.2}$ & 1.119  \\\\\n  & 1.00& 0.48$^{+0.19}_{-0.23}$ & 33.9$_{-3.1}^{+3.6}$ & 1.123  \\\\\n\\cline{1-5}\nPer-emb-30 & 0.25&0.02$^{+0.18}_{-0.31}$  & 14.0$_{-0.9}^{+1.0}$& 1.100 \\\\\n & 0.50& 0.20$^{+0.04}_{-0.32}$  & 14.9$_{-1.1}^{+1.9}$ &1.102  \\\\\n & 0.75& 0.39$^{+0.30}_{-0.34}$  & 15.8$_{-1.3}^{+1.9}$  &1.104  \\\\\n & 1.00&0.59$^{+0.14}_{-0.33}$  & 16.5$_{-1.6}^{+31.3}$ &1.107  \\\\\n\\cline{1-5}\nHH211-mms & 0.25& 0.48$^{+0.40}_{-0.78}$ & 10.5$_{-0.8}^{+0.8}$& 1.009  \\\\\n & 0.50& 0.65$^{+0.43}_{-0.82}$  & 11.0$_{-0.9}^{+1.0}$ & 1.009  \\\\\n & 0.75& 0.81$^{+0.42}_{-0.79}$ &11.5$_{-1.2}^{+1.2}$ & 1.009  \\\\\n & 1.00& 1.01$^{+0.44}_{-0.81}$  &11.9$_{-1.3}^{+1.4}$ & 1.009  \\\\\n\\cline{1-5}\nIC348 MMS & 0.25& -0.58$^{+0.11}_{-0.11}$ & 25.7$_{-2.2}^{+2.8}$ & 1.085  \\\\\n  & 0.50& -0.39$^{+0.19}_{-0.11}$ & 29.0$_{-2.6}^{+3.2}$& 1.096  \\\\\n  & 0.75&  -0.19$^{+0.11}_{-0.27}$ & 31.6$_{-2.9}^{+4.1}$  & 1.107  \\\\\n  & 1.00& 0.02$^{+0.07}_{-0.11}$ & 33.7$_{-3.1}^{+4.3}$  & 1.118  \\\\\n\\cline{1-5}\nPer-emb-8 & 0.25& 0.01$^{+0.16}_{-0.19}$  &19.0$_{-1.1}^{+1.2}$ & 1.099  \\\\\n & 0.50&   0.20$^{+0.17}_{-0.20}$   & 20.2$_{-1.3}^{+1.4}$&  1.107  \\\\\n & 0.75&   0.40$^{+0.17}_{-0.21}$  &21.2$_{-1.4}^{+1.6}$  & 1.114  \\\\\n & 1.00& 0.61$^{+0.17}_{-0.20}$ & 22.1$_{-1.6}^{+1.8}$ & 1.122  \\\\\n\\hline\n\\end{tabular}\\\\\n\\end{center}\n\\tablecomments{Values of $q$ are fixed.  Values of $\\gamma$ and $R_{c}$ are determined from best-fit models.  Uncertainties reflect 90\\% confidence intervals.  }\n\\label{tab3} \n\\end{table}\n\n\n\n\n\\section{Discussion}\n\nThe estimated masses of the candidate disks are consistent with known disks around Class 0 and I protostars. \nThe seven VANDAM candidate Class 0 and I disks range in estimated masses of 0.09--0.36 {M$_\\odot$}. \nScaling to our value of $\\kappa_{\\nu}$, Class 0 protostar L1527's disk is 0.013 {M$_\\odot$}~\\citep{to13} with $T_d$ = 30 K. \nA recent interferometric study of Class I disks in Taurus \\citep{ha14} revealed the disks around TMC1A, \nTMC1, TMR1 and L1536 to have masses of 0.4--3.3$\\times$10$^{-2}$ {M$_\\odot$}~with $T_d$ = 30 K and \\citet{oh94} opacities.\nAll mass estimates have uncertainties of a factor of $\\sim$10 due to the unknown gas-to-dust ratio, $T_d$, $\\beta$, and varying choices of $\\kappa_{\\nu}$.\n\nValues of $\\gamma$, the power-law of the inner-disk surface density, for the VANDAM sources \ncan be compared to values found for older Class II sources.   The best-fit models for our seven sources yield $-0.58<\\gamma<0.45$. Negative values of $\\gamma$ indicate increasing surface density with radius, inconsistent with disks, yet for all sources at least one value of $q$ exists which produces a positive best-fit $\\gamma$ (Table 3).  \\citet{an10} determined $\\gamma$ at 880 $\\mu$m for disks around Class II \nobjects using a two-dimensional parametric model with a prescription of the surface density profile similar to\n the radial surface brightness distribution applied in this Letter.   The Class II sources have values of \n$0.4<\\gamma<1.1$, larger than VANDAM results.  \n The modeled, surface density profiles of the Class 0 and I systems  \n taper off less quickly with radius compared to the Class II systems inside the characteristic radius $R_c$.\n\nThe best-fit model radii of \nthe candidate Class 0  disks are between $\\sim$15-30 AU, except HH211-mms with $R_{c}$ $\\sim$ 10 AU.   These are smaller \nthan the Keplerian disks found in L1527 and VLA 1623 at 1.3 mm\n  \\citep[$R$ $\\sim$ 54 AU and $R$ $\\sim$ 189 AU respectively]{oh14,mu13} \n  but consistent with the size of HH212  \\citep[R $>$ 30 AU]{cd14}.  The modeled radii (Table 3) are a factor of 1 to 1.5 times larger than the deconvolved sizes (Table 2). \n  The radii of the new candidate\ndisks may represent lower limits on disk sizes because continuum emission from dust is biased by dust\ngrain size.  Radial drift \\citep{bi10,we77} sends large grains inward in the disk, and so the long wavelength observations\n preferentially trace\ninner disk emission \\citep{pe12}.  We expect the 8 mm dust-modeled radii to be less than the gas disk radius, and so the 8 mm \nradii are lower-limits on disk size; multi-wavelength observations that include gas tracers are required to further constrain disk radii.\nPer-emb-14 was resolved at 1.3 mm by \\citet{to15b} with $R$ $\\sim$ 100 AU; thus the disk is indeed likely larger than the 8 mm radius quoted here.\n In all cases, the previously known disks and new candidate Class 0 disks are larger than the expected \n upper limit of 10 AU from  strong magnetic braking models \\citep[e.g.,][]{db10}.\n\nThe seven VANDAM candidate disks are well-fit by a disk-shaped model and have disk\nmasses, values of $\\gamma$, and radii consistent with known disks.  These candidate disks can be\ncompared to the well-studied Class 0 systems with disks: L1527 \\citep{to12} and VLA 1623 \n\\citep{ml13}.  L1527 and VLA 1623 have large Keplerian disks \\citep[$R$ $\\sim$ 50 AU,][]{oh14,mu13}  as well as misaligned magnetic fields and rotation axes \\citep{hu14}, suggesting that misaligned fields and large disks may be linked \\citep{sc15}.   \n The discrepancy between theoretical and observed disk sizes could be due to misalignment between the magnetic field and rotation axis, which changes the strength of magnetic braking, allowing disks to grow at early times  \\citep{hc09,jo12,li13,ku13}.  \n Similarly, aligned orientations would strengthen magnetic braking and limit disk size, as seen in Class 0 source B335 with a disk of $R$ $<$ 5 AU \\citep{ye15,hu14}.\nThe large Keplerian Class 0 disks and new  candidate disks indicate significant magnetic braking either has already occurred, has not happened, or the magnetic field is weak enough for disks with $R$ $>$ 10 AU around these Class 0 protostars to form, though other configurations are possible.\n\nIt is illustrative to compare the presence of VANDAM candidate disks to the magnetic field morphology of the systems. The TADPOL survey examines protostellar dust polarization and hence plane-of-sky magnetic field orientation. \\citep{hu14}.  For sources with detected magnetic fields,\n we are able to determine\n which systems have misaligned \n orientations between the outflow  (a proxy for rotation axis) and the average \n magnetic field orientation.\nThe magnetic field morphologies of two of the seven VANDAM sources in this Letter (HH211-mms and SVS13B) were also examined as a part of the TADPOL survey.  \n  A qualitative \ncomparison between the VANDAM data and the TADPOL magnetic field orientation reveals that   \nHH211-mms and SVS13B morphologies agree with\nthe tentative link between $R$ $>$ 10 AU disks and misaligned orientations \\citep{sc15}. \nHH211-mms has a clearly misaligned orientation \\citep{hu14}, agreeing with theoretical predictions that disks with $R$ $>$ 10 AU disks form at early times in systems with non-parallel orientations.\nSVS13B has a more complicated magnetic field morphology with an average aligned orientation \\citep{hu14} with the outflow \\citep{ba98}, however the TADPOL data has lower resolution than our data ($\\sim$3$^{\\prime\\prime}$, or 700 AU), and the innermost regions of the magnetic field has misaligned orientation near the candidate disk.  The small-scale, misaligned orientation in SVS13B could be caused by magnetic fields being wrapped up with the rotating disk, and the aligned magnetic field lines further from the disk are  less influenced by the disk wrapping.\\\\\n\n\n\n\\section{Conclusions}\n\nThe first results of the VANDAM survey revealed new candidate Class 0 and I disks in continuum \nemission in the Perseus molecular cloud and is the most sensitive, most complete, and highest resolution survey of young protostellar disks to-date.  \n For seven of the VANDAM systems, we fit the deprojected, averaged, and binned \ndata in the {\\it u,v}-plane to a disk-shaped profile, accounting for a free-free point source potentially contaminating the dust emission, \nto affirm the disk candidacy of the sources and to begin to model disk properties.  To confirm that these disks are true, rotationally-supported disks, kinematic follow-up observations are\nrequired.   The seven VANDAM candidate disks are well-fit by a model with a disk-shaped profile and have masses comparable to known disks. The inner-disk surface densities of the Class 0 and I candidate disks taper off less quickly with radius than their Class II counterparts. \n\n The best-fit model radii of the new candidate disks are $R_{c}$ $>$ 15 AU, except HH211-mms with $R_{c}$ $\\sim$ 10 AU.\nSince magnetic braking is expected to suppress Class 0 disks to $R$ $<$ 10 AU, this\nsuggests that magnetic braking has already ended or is inconsequential in some Class 0 sources.  At\n8 mm, the modeled radii are lower limits on the disk size since dust continuum emission is tied to grain\nsize and large grains radially drift inwards in the disk; the actual sizes of the disks may be larger.  \nMulti-wavelength observations are needed to put added constraints on disk radii.  Furthermore, \ntheory predicts larger disk growth in systems with misaligned outflow axes and magnetic field \norientations, and the early VANDAM candidate disk results combined with polarization data for two of \nthe sources indicate that indeed $R$ $>$ 10 AU disks have formed in systems with misaligned \norientations.\n\n\n\n\n\n\\acknowledgments\nThis research made use of APLpy, an open-source plotting package for Python hosted at http://aplpy.github.com. \n\nDMSC is currently supported by  NRAO Student Observing Support grant SBC NRAO 2015-06997.  JJT is currently supported by grant 639.041.439 from the Netherlands\nOrganisation for Scientific Research (NWO). ZYL is supported by NASA NNX14AB38G and NSF AST-1313083.\n\n The National Radio Astronomy\nObservatory is a facility of the National Science Foundation\noperated under cooperative agreement by Associated Universities, Inc.\n\\\\\n\\\\\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{}\n\n\n\\bibitem[Andr\\'e et al.(2000)]{an00} Andr\\'e, P., Ward-Thompson, D., \\& Barsony, M. 2000, in Protostars and Planets IV, 59\n\\bibitem[Andrews et al.(2009)]{an09} Andrews, S. M., Wilner, D. J., Hughes, A. M., et al. 2009, ApJ, 700, 1502\n\\bibitem[Andrews et al.(2010)]{an10} Andrews, S. M., Wilner, D. J., Hughes, A. M., et al. 2010, ApJ, 723, 1241\n\\bibitem[Anglada et al.(1998)]{an98} Anglada, G., Villuendas, E., Estalella, R., et al. 1998, AJ, 116, 2953\n\\bibitem[Armitage(2011)]{ar11} Armitage, P. J., 2011, ARA\\&A, 49, 195\n\\bibitem[Bachiller et al.(1998)]{ba98}\tBachiller, R., Guilloteau, S., Gueth, F., et al. 1998, A\\&A, 339, 49\n\n\\bibitem[Birnstiel et al.(2010)]{bi10} Birnstiel, T., Ricci, L., Trotta, F., et al. 2010, A\\&A, 516, 14\n\n\\bibitem[Chiang \\& Goldreich(1997)]{cg97} Chiang, E. I. \\& Goldreich, P. 1997, ApJ, 490, 368\n\\bibitem[Chiang et al.(2008)]{ch08} Chiang, H.-F., Looney, L. W., Tassis, K., et al. 2008, ApJ, 680, 474\n\\bibitem[Codella et al.(2014)]{cd14} \tCodella, C., Cabrit, S., Gueth, F., et al. 2014, A\\&A, 568, 5\n\\bibitem[D'Alessio (1996)]{da96} D'Alessio, P. 1996, PhD thesis, Univ. Nacional Ast\\'onoma de M\\'exico\n\\bibitem[Dapp \\& Basu(2010)]{db10}  Dapp, W. B., \\& Basu, S. 2010, A\\&A, 521, L56\n\\bibitem[Dapp et al.(2012)]{dbk12}  Dapp, W. B., Basu, S., \\& Kunz, M. W.,  2012, A\\&A, 541, A35\n\\bibitem[Dunham et al.(2014)]{du14} Dunham, M. M., Stutz, A. M., Allen, L. E., et al. 2014, Protostars and Planets VI, 195\n\\bibitem[Foreman-Mackey et al.(2013)]{fm13} Foreman-Mackey, D., Hogg, D. W., Lang, D., Goodman, J. 2013 PASP, 125, 306\n\\bibitem[Goodman \\& Weare(2010)]{gw10} Goodman, J. \\& Weare, J., 2010, Comm. App. Math. Comp. Sci., 5, 65\n\\bibitem[Harsono et al.(2014)]{ha14} Harsono, D., J\\o rgensen, J. K., van Dishoeck, E. F., et al. 2014, A\\&A, 562, 77\n\\bibitem[Hennebelle \\& Ciardi(2009)]{hc09} Hennebelle, P., \\& Ciardi, A. 2009, A\\&A, 506, 29\n\n\\bibitem[Hildebrand(1983)]{hl83} Hildebrand, R. H. 1983, QJRAS, 24, 267\n\\bibitem[Hirota et al.(2008)]{hi08} Hirota, T., Bushimata, T., Choi, Y. K., et al. 2008, PASJ, 60, 37\n\\bibitem[Hirota et al.(2011)]{hi11} Hirota, T., Honma, M., Imai, H., et al. 2011, PASJ, 63, 1\n\n\\bibitem[Hull et al.(2014)]{hu14} Hull, C. L. H., Plambeck, R. L., Kwon, W., et al. 2014, ApJS, 213, 13\n\\bibitem[Joos et al.(2012)]{jo12} Joos, M., Hennebelle, P., \\& Ciardi, A. 2012, A\\&A, 543, A128\n\\bibitem[Joos et al.(2013)]{jo13} Joos, M., Hennebelle, P., Ciardi, A. \\& Fromang, S. 2013, A\\&A, 554, A17\n\\bibitem[J\\o rgensen et al.(2009)]{jg09} J\\o rgensen, J. K., van Dishoeck, E. F., Visser, R., et al. 2009, A\\&A, 507, 861\n\\bibitem[Krumholz et al.(2013)]{ku13} Krumholz, M. R., Crutcher, R. M., \\& Hull, C. L. H. 2013, ApJ, 767, L11\n\n\n\\bibitem[Li et al.(2011)]{li11} Li, Z.-Y., Krasnopolsky, R., \\& Shang, H. 2011, ApJ, 738, 180\n\\bibitem[Li et al.(2013)]{li13} Li, Z.-Y., Krasnopolsky, R., \\& Shang, H. 2013, ApJ, 774, 82\n\n\\bibitem[Looney et al.(2000)]{lo00} Looney, L. W., Mundy, L. G., \\& Welch, W. J. 2000, ApJ, 529, 477\n\\bibitem[Machida et al.(2011)]{ma11} Machida, M. N., Inutsuka, S.-I., \\& Matsumoto, T. 2011, PASJ, 63, 555\n\\bibitem[Machida et al.(2014)]{ma14} Machida, M. N., Inutsuka, S.-I., \\& Matsumoto, T. 2014, MNRAS, 438, 2278\n\\bibitem[Maury et al.(2010)]{ma10} Maury, A. J., Andr\\'{e}, P., Hennebelle, P., et al. 2010, A\\&A, 512, 40\n\\bibitem[Mellon \\& Li(2008)]{ml08} Mellon, R. R., \\& Li, Z.-Y. 2008, ApJ, 681, 1356\n\n\\bibitem[Murillo \\& Lai(2013)]{ml13} Murillo, N. M., \\& Lai, S.-P. 2013, ApJL, 764, L15\n\\bibitem[Murillo et al.(2013)]{mu13} Murillo, N. M., Lai, S.-P., Bruderer, S., et al. 2013, A\\&A, 560, 103\n\\bibitem[Ohashi et al.(2014)]{oh14}Ohashi, N., Saigo, K., Aso, Y., et al. 2014, ApJ, 796, 131\n\\bibitem[Ossenkopf \\& Henning(1994)]{oh94}Ossenkopf, V., \\& Henning, T. 1994, A\\&A, 291, 943\n\\bibitem[P\\'{e}rez et al.(2012)]{pe12} P\\'{e}rez, L. M., Carpenter, J. M., Chandler, C. J., et a., 2012, ApJL, 760, L17\n\n\\bibitem[Segura-Cox et al.(2015)]{sc15} Segura-Cox, D. M., Looney, L. W., Stephens, I. W., et al. 2015, ApJ, 798, L2\n\\bibitem[Seifried et al.(2013)]{se13} Seifried, D., Banerjee, R., Pudritz, R. E., \\& Klessen, R. S. 2013, MNRAS, 432, 3320\n\\bibitem[Shakura \\& Sunyaev(1973)]{ss73} Shakura, N. I., Sunyaev, R. A. 1973, A\\&A, 24, 337\n\\bibitem[Shu(1977)]{sh77} Shu, F. H.1977, ApJ, 214, 488\n\\bibitem[Tobin et al.(2013)]{to13} Tobin, J. J., Bergin, E. A., Hartmann, L., et al. 2013, ApJ, 765, 18 \n\n\\bibitem[Tobin et al.(2012)]{to12} Tobin, J. J., Hartmann, L., Chiang, H.-F., et al. 2012, Nature, 492, 83\n\\bibitem[Tobin et al.(2016, in press)]{to15p} Tobin, J. J., Looney, L. W., Li, Z.-Y., et al. 2016, ApJ, in press\n\\bibitem[Tobin et al.(2015a)]{to15a} Tobin, J. J., Dunham, M. M., Looney, L. W, et al. 2015a, ApJ, 798, 61\n\\bibitem[Tobin et al.(2015b)]{to15b} Tobin, J. J., Looney, L. W., Wilner, D. J., et al. 2015b, ApJ, 805, 125\n\n\\bibitem[Weidenschilling(1977)]{we77} Weidenschilling, S. J. 1977, MNRAS, 180, 57\n\\bibitem[Williams \\& Cieza(2011)]{wc11} Williams, J. P. \\& Cieza L. A., 2011, ARA\\&A, 49, 67\n\\bibitem[Yen et al.(2015)]{ye15} Yen, H.-W., Koch, P. M., Takakuwa, S., et al. 2015, ApJ, 799, 193\n\n\\end{thebibliography}\n\n\\clearpage\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere  $F_{\\nu}$, $d$, $\\kappa_{\\nu}$, and $B_{\\nu}(T_d)$, are respectively the total observed flux, distance, grain opacity,\nand blackbody intensity at dust temperature $T_d$.\nWe estimate $\\kappa_{\\nu}$ at 8.1 mm by normalizing to \\citet{oh94} at 1.3 mm using a dust to gas ratio of $1/100$: \n$\\kappa_{\\nu}$ = $(1/100)(\\nu/231\\mathrm{GHz}))^{\\beta}$ cm$^{2}$~g$^{-1}$. $\\beta$ = 1 is typically assumed for protostellar disks \\citep{an09}, giving $\\kappa_{\\nu}=0.00146$ cm$^{2}$~g$^{-1}$.\n Mass estimates are inherently ambiguous within an order of magnitude due to uncertainties in the dust-to-gas ratio, $T_d$, and $\\beta$; \nrather than compute a single mass estimate, we calculate lower and upper mass estimates for each source\nby varying $T_d$. \nLower masses were estimated by assuming $T_d$ = 40 K, and we determined upper estimates using $T_d$ = 20 K. \nThese candidate disks range in flux from 867.5 $\\mu$Jy to 1664.9 $\\mu$Jy, providing \n estimated masses of 0.09--0.36 {M$_\\odot$}~(Table 2).\\\\\n \n\n \n  \n\\section{Modeling}\n\nWe modeled the 8~mm A+B array continuum data  by fitting a symmetric disk intensity profile to the continuum emission of each source.\nIn this modeling, we deprojected the 8 mm \nvisibility data to a fixed position angle (P.A.)\nand fixed inclination as determined through image-plane 2D Gaussian \nfitting of the disk candidates and assumed the disks are circularly symmetric (Table 2). We  \nazimuthally averaged the visibility data in the {\\it u,v}-plane and binned the data in linearly spaced bins of width 50 k$\\lambda$  \nfrom 0 to 1500 k$\\lambda$, switching to 30 log-spaced bins from 1500 to 4000 k$\\lambda$ \nwhere the data becomes noisier in order to boost the signal-to-noise level at large {\\it u,v}-distances.\nWe accounted for a lower-limit free-free point source component emanating from shocks in the protostellar jets \\citep{an98}.  Because point sources in the image domain have constant flux density at all {\\it u,v}-distances, we account for the free-free component by calculating the average real component of the binned data with {\\it u,v}-distance \n$>$1700 k$\\lambda$ and include the average as a flat, linear component of the model (Table 2); the profiles become flat at values $>$1700 k$\\lambda$ in all seven sources (e.g., Figure 2).  \n\nWe fitted the real components of the deprojected, averaged, and binned profile to a simple\ndisk model using a C-based implementation of \\texttt{emcee}, an affine-invariant Markov chain Monte Carlo ensemble sampler \\citep{gw10,fm13}. The imaginary components were assumed to be zero in the model\nsince the disk is positioned at the phase center and assumed to be symmetric.\n The model mimics  a Shakura-Sunyaev \ndisk \\citep{ss73} with a power law temperature profile; the resultant model disk surface brightness profile is\n\n\n", "index": 3, "text": "\\begin{equation}\nI(r)\\propto\\left(\\frac{r}{R_{c}}\\right)^{-\\left(\\gamma+q\\right)}\\exp{\\bigg\\{\\left(\\frac{r}{R_{c}}\\right)^{\\left(2-\\gamma\\right)}}\\bigg\\},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"I(r)\\propto\\left(\\frac{r}{R_{c}}\\right)^{-\\left(\\gamma+q\\right)}\\exp{\\bigg{\\{}%&#10;\\left(\\frac{r}{R_{c}}\\right)^{\\left(2-\\gamma\\right)}}\\bigg{\\}},\" display=\"block\"><mrow><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><msup><mrow><mo>(</mo><mfrac><mi>r</mi><msub><mi>R</mi><mi>c</mi></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mo>(</mo><mrow><mi>γ</mi><mo>+</mo><mi>q</mi></mrow><mo>)</mo></mrow></mrow></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">{</mo><msup><mrow><mo>(</mo><mfrac><mi>r</mi><msub><mi>R</mi><mi>c</mi></msub></mfrac><mo>)</mo></mrow><mrow><mo>(</mo><mrow><mn>2</mn><mo>-</mo><mi>γ</mi></mrow><mo>)</mo></mrow></msup><mo maxsize=\"210%\" minsize=\"210%\">}</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]