[{"file": "1601.07178.tex", "nexttext": ">$(r$<$r$_h$)                  & $30.9 \\pm 0.4$           & $\\rm{mag}\\,\\rm{arcsec}^{-2}$ \\\\\n\\hline\n    \\end{tabular}\n\\end{table}\n\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{DiscoveryCMD.eps}\n    \\caption{Colour-Magnitude Diagram. The left panel shows the\n      comparison Hess CMD constructed using stars between 3 and 5\n      degrees away from Crater~2. The middle panel shows the Hess\n      difference between the stars within 31\\arcmin of the center and\n      the comparison displayed in the left panel.  The RGB and the HB\n      of Crater~2 are now unmistakable. The right panel shows a\n      contrast enhanced version of the middle panel and highlights the\n      possible existence of a blue horizontal branch. The red line\n      correspond to a PARSEC isochrone with [Fe/H]=-1.7, age $10$ Gyr\n      and m$-$M=20.35. The associated mask is shown with the red\n      dashed line. For comparison, isochrones with $[$Fe/H$]$= -1.4\n      and -2 are also overlaid in green and orange color respectively.\n      The blue lines show the M92's BHB ridge-line shifted to the\n      distance modulus of $m-M20.35$.}\n    \\label{fig:DiscoveryCMD}\n\\end{figure*}\n\n\nWe applied the above method to the ATLAS data using a grid of inner\nkernel sizes (from 1\\arcmin\\ to 10\\arcmin) and isochrone masks to\ncreate a list of stellar overdensity candidates across a range of\nstellar and structural parameters. Our isochrone masks are based on\nthe most recent PARSEC evolutionary models \\citep{Bressan2012}, which\nare convolved with the appropriate ATLAS photometric error. We have\nprobed $15<m-M<23$ in distance modulus (DM), from 9.5 to 10.1 in\nlogarithm of age, and $-2<[$Fe/H$]<-1$ in metallicity. Once the known\noverdensities (previously detected Galactic satellites, Local Volume\ngalaxies etc.) are culled, in the detections list, a large object in\nthe constellation of Crater stands out at the highest significance of\n$10.7\\,\\sigma$. As shown in Figure \\ref{fig:DiscoveryRaw}, Crater~2\nreveals itself rather unambiguously in both stellar spatial\ndistribution - even before any isochrone filtering is applied - and\nthe Color Magnitude Diagram (CMD). The left panel of the Figure shows\nCrater~2 as an extended overdensity at the edge of the ATLAS footprint\non top of a noticeably non-uniform background. The Figure's right\npanel shows the CMD of all stars within $\\sim30\\arcmin$ of the\ncenter of the detection (see Section~\\ref{sec:spatpar} for details of the\nmeasurement of Crater~2 position, distance and size), where a\nprominent Red Horizontal Branch (RHB) as well as an obvious Red Giant\nBranch (RGB) can be seen. The well-defined RHB is a decent distance\nindicator: Crater~2 is $\\sim$120\\,kpc away from the Sun. Note that\ncuriously, Crater 2's CMD is remarkably similar to that of Sextans\n\\citep[see Figure~3 of][]{Sextans}.\n\nFigure \\ref{fig:DiscoverySpatial} shows the density distribution of\nstars selected using a mask based on a PARSEC isochrone with\n[Fe/H]=$-1.7$, age $10$ Gyr offset to $m-M=20.35$ (see Section\n\\ref{sec:isopar} for details on the selection of the isochrone\nparameters, and the right panel of Figure \\ref{fig:DiscoveryCMD}). The\nmask's width is defined by the ATLAS photometric error above the\nminimum width of 0.1 mag. The CMD selection enhances the stellar\noverdensity associated with Crater~2 as revealed in the left panel of\nFigure \\ref{fig:DiscoverySpatial}.  According to the middle and right\npanels of the Figure, no obvious galaxy overdensity or strong\nextinction variation can be seen overlapping with the new satellite's\nlocation. Crater~2's angular diameter of $\\sim$ 1 degree corresponds\nto $\\sim$ 2\\,kpc at the distance of 120\\,kpc, which places it firmly in\nthe class of dwarf galaxies.\n\nDue to the substantial size of Crater~2, and hence the large aperture\nrequired to create the CMD, the details of the satellite's stellar\npopulation distribution are buried in the Galactic\nbackground/foreground. As a simple but efficient way of\ndecontaminating the CMD, Figure~\\ref{fig:DiscoveryCMD} (middle panel) presents the\nHess difference diagram of the stars within 31\\arcmin\\ of the center of\nCrater~2, in which both the RGB and HB are now evident. For\ncomparison, on left panel we also show the Hess diagram of the background, which is\nconstructed with the stars that lie between 3 and 5 degrees away from\nCrater~2. The right panel of the Figure gives an alternative, highly\ncontrasted version of the Hess difference which highlights hints of a\nfaint Blue HB.  Also shown is the best-fit isochrone with its\nassociated mask in red solid line and red dashed line,\nrespectively. For comparison, models with higher and lower metallicity\nare given. Additionally, the M92 BHB ridge-line shifted to the\nfiducial DM of $m-M=20.35$ and the BHB mask are displayed in blue.\n\n\\section{Properties of Crater~2}\\label{sec:prop}\n\\subsection{Stellar populations}\\label{sec:isopar}\n\nTo estimate the age, metallicity and distance of Crater~2 we model the\ndistribution of the stars in the color and magnitude space with a\ncombination of an empirical background CMD density and a single\nstellar population model from the PARSEC isochrone set with the\nappropriate photometric errors applied. The probability of observing a\nstar with colour $g-r$ and apparent magnitude $r$ in the vicinity of\nCrater~2 is:\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2015}\n\n\\maketitle\n\n\\label{firstpage}\n\n\\begin{abstract}\n\nWe announce the discovery of the Crater~2 dwarf galaxy, identified in\nimaging data of the VST ATLAS survey. Given its half-light radius of\n$\\sim$1100 pc, Crater~2 is the fourth largest dwarf in the Milky Way,\nsurpassed only by the LMC, SMC and the Sgr dwarf. With a total\nluminosity of $M_V\\approx-8$, this satellite galaxy is also one of the\nlowest surface brightness dwarfs. Falling under the nominal detection\nboundary of 30 mag arcsec$^{-2}$, it compares in nebulosity to the\nrecently discovered Tuc~2 and Tuc~IV and UMa~II.  Crater~2 is located\n$\\sim$120\\,kpc from the Sun and appears to be aligned in 3-D with the\nenigmatic globular cluster Crater, the pair of ultra-faint dwarfs\nLeo~IV and Leo~V and the classical dwarf Leo~II. We argue that such\narrangement is probably not accidental and, in fact, can be viewed as\nthe evidence for the accretion of the Crater-Leo group.\n\\end{abstract}\n\n\\begin{keywords}\nGalaxy: halo, galaxies: dwarf\n\\end{keywords}\n\n\\section{Introduction}\\label{sec:INTRO}\n\nThe size and the luminosity of a dwarf galaxy satellite today are\nstipulated by the star-formation efficiency at birth and the\namount of host harassment it endures during the rest of its\nlife. Therefore, local dwarfs can only be used to scrutinize the\nhigh-redshift structure formation in the low-mass regime if the\neffects of the host influence can be singled out. In principle, such\ninference should be possible if the satellite's orbital history is\nknown. In practice, unfortunately, this is easier said than done, both\ndue to the challenging nature of the proper motion measurement, as\nwell as the unexplored effects of dynamical friction and orbital\nfanning. It might, however, be possible to decode the satellite's\norbital history if it was accreted as part of a group, thus linking\nits observed properties to the environment at the origin.\n\nSimulations suggest that half of all satellites at $z=0$ were in groups \nbefore falling into Milky Way-like hosts \\citep{Wetzel2015}. Therefore, in\nany realistic Galactic assembly history, it is unlikely that the\ncurrent satellite distribution will look isotropic. Indeed,\nthe apparent spatial anisotropy of the Galactic satellite population\nhas been pointed out on a number of occasions \\citep[see\n  e.g.][]{Lyndenbell1976, Kroupa2005,Pawlowski2012}, as well as its\nalignment with the Magellanic Clouds orbit \\citep[see\n  e.g.][]{LyndenBell1995}. As \\citet{Deason2015} point out,\nthe spatial extent of an accreted\ngroup depends on its mass and the time of its in-fall into the Milky\nWay, with the least massive (and hence the coldest) and the latest\nevents standing out the most. In this picture, the discovery last year\nof a large number of faint satellites near the Magellanic Clouds\n\\citep[see][]{Koposov2015,Bechtol2015,DrlicaWagner2015} is naturally\nexplained with a relatively recent accretion of a massive Magellanic system.\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{DiscoveryRaw.eps}\n    \\caption{Crater~2 as seen in the ATLAS data. The left panel shows\n      the density map on the sky of all the stars in a\n      10 $\\times$ 10 degree area around the center of the detection. The\n      overdensity, which is easily visible at the center, is at the\n      border of the ATLAS footprint embedded in a non-uniform\n      background. In the right panel, we show the CMD of all the stars\n      within 31\\arcmin\\ (the half-light radius) of the center of the\n      detection.  Even with the strong background gradient, a\n      prominent red giant branch and red horizontal branch stand out.}\n    \\label{fig:DiscoveryRaw}\n\\end{figure*}\n\n\nHowever, it remains unclear if the hypothesis of a recent Magellanic\naccretion can explain both the satellites in the immediate vicinity of\nthe Magellanic Clouds, such as those picked out by the Dark Energy\nSurvey (DES), {\\it as well as} satellites like Draco and Ursa Minor\nwhich are hundreds of degrees, and kpc, away.  One possibility is that\nthe group was a lax association initially and fell in earlier, losing\nsome of its outer parts to the Milky Way tides before the LMC-SMC and\nits entourage were eventually captured. It is curious, nonetheless,\nthat given the stipulated ubiquity of group environments, apart from\nthe obvious LMC-SMC connection and their likely bond with many of the\nDES dwarfs, very few other satellite associations are known in the\nMilky Way. For example, it is quite possible that, being the third\nmost massive satellite galaxy, the Sgr dSph\n\\citep[][]{Ibata1994,MNO2010} could have had smaller dwarf companions,\nbut only one possible candidate was found in its propinquity\n\\citep[][]{Laevens2015}. Another plausible satellite pair are two of\nthe Leos, IV and V \\citep[][]{Belokurov2007,Belokurov2008}.  What\nmakes their connection conceivable is the combination of their\nproximity on the sky, i.e.$<3^{\\circ}$ and small differences in their\nline-of-sight distances and velocity, $<$20\\,kpc and $<$40\\,km\ns$^{-1}$ respectively. Such closeness is striking given that the outer\nhalo of the Milky Way is mostly empty, with only $\\sim$20\\% of all\ncurrently known dwarfs inside a 400\\,kpc radius located beyond\n150\\,kpc from the Galactic centre.\n\nFor most accretion event architectures, the satellites that fell into\nthe Galaxy together would share the orbital motion and hence should be\nfound near a great circle\n\\citep[see][]{LyndenBell1995}. Interestingly, a peculiar globular\ncluster, Crater lies very close to the great circle passing through\nLeo~IV and Leo~V \\citep[][]{Belokurov2014}. Crater holds the record for\nthe most distant Milky Way cluster, at 145\\,kpc. It is also surprisingly young\nwith an age of 7.5 Gyr, and possesses a Horizontal Branch that is\natypically red and short for its metallicity of [Fe/H]=-1.65\n\\citep[][]{Weisz2015}. Finally, Crater is one of the largest globular\nclusters in the Galaxy. When compared to the rest of the Galactic GCs,\nCrater peels off as an obvious outlier. \\citet{Weisz2015} conjecture\nthat Crater could possibly originate in the SMC, even though it would\nnot have been the most representative cluster in its former host. The\nfact that the Crater-Leo~IV/V great circle with the pole at\n$(\\alpha,\\delta)=(83^{\\circ}.1, â\u0088\u00925^{\\circ}.3)$\n\\citep[][]{Belokurov2014} passes only few degrees away from the\nMagellanic Stream $(\\alpha,\\delta)=(84^{\\circ}.3,\n17^{\\circ}.8)$\\citep[][]{Nidever2008} lends further support to a possible\nMagellanic origin hypothesis.\n\nIn this paper we present the discovery of a new dwarf galaxy in the\nconstellation of Crater detected using the most recent VST ATLAS\ndata. Crater~2 appears to be one of the lowest surface brightness\nMilky Way dwarfs, as well as one of the largest. Moreover, there\nexists a great circle passing through Crater~2, Crater, Leo~IV, Leo~V\nand Leo~II with a standard deviation of only 0.5 degrees. This paper\nis organized as follows. Section \\ref{sec:Discovery} introduces the\nVST ATLAS survey and gives the details of the discovery of the\nsatellite. Section \\ref{sec:prop} describes the in-depth stellar\npopulations and structural properties modelling of the\nsystem. Finally, Section \\ref{sec:CONCL} puts the discovery into\ncontext and assesses the plausibility of the Crater-Leo group's\nexistence.\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{DiscoverySpatial.eps}\n    \\caption{Density maps of the region\n      around Crater~2. The left panel shows the distribution of stars\n      filtered by an isochrone mask with [Fe/H]=-1.7, age of 10\\,Gyr\n      and m$-$M=20.35, which shows a significant enhancement of the\n      overdensity when compared to Figure~\\ref{fig:DiscoveryRaw}. The\n      middle panel shows the density map of objects morphologically\n      classified as galaxies in the same area, and the right panel\n      shows the extinction map from \\citet{SFD}. It is reassuring to\n      see that there is neither an overdensity in galaxies nor strong\n      extinction variation associated with Crater~2.}\n    \\label{fig:DiscoverySpatial}\n\\end{figure*}\n\n\n\\section{Discovery of Crater~2}\\label{sec:Discovery}\n\n\\subsection{VST ATLAS}\n\nATLAS \\citep{Shanks2015} is one of the three public ESO surveys\ncurrently being carried out by the a 2.6m VLT Survey Telescope (VST)\nat the Paranal observatory. The VST is equipped with the 16k $\\times$\n16k pixels CCD camera OmegaCAM, which provides 1-degree field of view\nwith a resolution of 0.\\arcsec21 per pixel. ATLAS aims to survey 4500\nsquare degrees of the Southern celestial hemisphere in 5 photometric\nbands, $ugriz$, with depths comparable to the Sloan Digital Sky Survey\n(SDSS). The median limiting magnitudes, corresponding to the $5\\sigma$\nsource detection limits, are approximately 21.99, 23.14, 22.67, 21.99,\n20.87 for each of the $ugriz$, respectively. Image reduction and\ninitial catalog generation are performed by the Cambridge Astronomical\nSurvey Unit (CASU) \\citep[see][for details]{Koposov2014}. The\nband-merging and selection of primary sources were performed as\nseparate steps using a local SQL database. To improve the uniformity\nof the photometric calibration of the survey, on top of the nightly\nzero-points measured relative to APASS survey, we also applied an\nadditional global calibration step\n\\citep[a.k.a. uber-calibration;][]{Padma08}.  In this work, we use the\nphotometric catalogs provided by CASU, which include the entirety of\nthe ATLAS data taken up to September 2015 covering $\\sim$ 4500 square\ndegrees in at least one band, and with $\\sim$3500 square degrees\nhaving both $g$ and $r$ band observations. In the analysis that\nfollows we correct ATLAS photometry for the effects of Galactic\nextinction using the \\citet{SFD} maps and the extinction coefficients\nfrom \\citet{Yuan2013}.\n\n\\subsection{Discovery}\n\nWe trawled through the ATLAS data using a version of the systematic\noverdensity detection algorithm \\citep[see e.g.][]{Koposov2008,\n  Koposov2015}. Briefly, the satellite detection algorithm starts by\nfiltering stars using an isochrone mask for a given age, metallicity\nand distance.  The local density of the thus selected stars is then\nmeasured and compared to the density level on much larger scales,\ni.e. the Galactic background/foreground. In practice, the overdensity\nestimate is performed by convolving the masked stellar number count\ndistribution with a ``Mexican hat'' kernel: a difference between a\nnarrow inner kernel (for the local density estimation) and a wide\nouter kernel (to gauge the background density). In our implementation,\nboth kernels are two-dimensional Gaussians and the significance of the\ndetection at each pixel is calculated by comparing the result of the\nconvolution with the expected variance.\n\n\\begin{table}\n    \\caption{Properties of Crater~2}\n    \\centering\n    \\label{tab:Properties}\n    \\begin{tabular}{@{}lrl}\n        \\hline\n        Property               & Value                    & Unit\\\\\n        \\hline\n        $\\alpha ({\\rm J2000})$   & $177.310  \\pm 0.03$      & deg \\\\ \n        $\\delta ({\\rm J2000})$   & $-18.413 \\pm 0.03$       & deg  \\\\ \n        m$-$M                  & $20.35 \\pm 0.02$         & mag\\\\ \n        D$_\\odot$              & $117.5 \\pm 1.1$          & kpc\\\\ \n        r$_{h}$                & $31.2 \\pm 2.5$           & arcmin\\\\ \n        r$_{h}$                & $1066 \\pm 86$            & pc\\\\ \n        M$_{\\rm V}$            & $-7.8 \\pm 0.1$           & mag\\\\ \n        1$-$b/a                & $<$0.1 (95\\%)            &\\\\\n        age                    & $10 \\pm 1$               & Gyr \\\\\n        $[$Fe/H$]$                 & $-1.7 \\pm 0.1$           & dex \\\\\n        $<\n", "index": 1, "text": "$$\\mu$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\mu\" display=\"block\"><mi>μ</mi></math>", "type": "latex"}, {"file": "1601.07178.tex", "nexttext": "\n\n\\noindent Here $\\phi$ are the three isochrone parameters, i.e., age,\nmetallicity and the distance modulus, $f$ is the fraction of stars belonging \nto the object, $P_{obj}$ the probability distribution of the satellite stars,\nand $P_{bg}$ the probability distribution of the background stars. Note that \nthe background model, $P_{bg}$, does not depend on any model parameters and is \ndetermined empirically using the stellar distribution far from the center of \nthe satellite. The satellite model, $P_{obj}$, is a convolution of the expected \nnumber of stars at each point along the isochrone with the typical observed \nphotometric error of the ATLAS survey at the given magnitude . \n\nFor stars within 31\\arcmin\\ of the center of Crater~2, the likelihood is \nsampled using the affine invariant ensemble sampler {\\it emcee} \n\\citep{GoodmanWeare2010,ForemanMackey2013} with flat priors on all three \nisochrone parameters. Given the strong RGB and RHB of Crater~2, all three are \nwell constrained: [Fe/H]=$-1.7\\pm0.1$; age=$10\n\\pm 1$ Gyr and m$-$M=$20.35\\pm0.02$ (also see Table\n\\ref{tab:Properties}). Note, however, that these numbers, and in\nparticular the formal error on the distance, should be taken with\ncaution, given that the behavior of HB stars is still not well\nunderstood, therefore rendering the models somewhat uncertain \n\\citep[see e.g.][]{Gratton2010}.\n\n\\subsection{Structural parameters}\\label{sec:spatpar}\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{SpatialZoom.eps}\n    \\caption{Close-up of the spatial distribution of Crater~2.\n   The left panel shows the density map of\n      all stars that fall within the isochrone mask, i.e. RGB +\n      RHB. The middle panel shows RHB stars only - these are the most\n      numerous stars above the limiting magnitude of the ATLAS\n      survey. The rightmost panel gives the distribution of the BHB\n      candidate stars as selected using the blue box shown in the\n      right panel of Figure~\\ref{fig:DiscoveryCMD}.  The red solid\n      (dashed) line indicates the half-light radius (twice the\n      half-light radius).}\n    \\label{fig:SpatialZoom}\n\\end{figure*}\n\n\nThe structural parameters of Crater~2 are determined by maximising the\nlikelihood of a model describing the distribution of stars in the\nvicinity of the object \\citep[similar to\n  e.g.,][]{Martin2008,Koposov2015}. To reduce Galactic contamination,\nwe only use stars with $g<22$ and $r<22$ that fall inside the\nisochrone mask shown in the right panel of\nFigure~\\ref{fig:DiscoveryCMD}. The spatial density model is a\ncombination of a linearly varying background and a 2-dimensional\nelliptical Plummer profile, defined as:\n\n\n\n", "itemtype": "equation", "pos": 16998, "prevtext": ">$(r$<$r$_h$)                  & $30.9 \\pm 0.4$           & $\\rm{mag}\\,\\rm{arcsec}^{-2}$ \\\\\n\\hline\n    \\end{tabular}\n\\end{table}\n\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{DiscoveryCMD.eps}\n    \\caption{Colour-Magnitude Diagram. The left panel shows the\n      comparison Hess CMD constructed using stars between 3 and 5\n      degrees away from Crater~2. The middle panel shows the Hess\n      difference between the stars within 31\\arcmin of the center and\n      the comparison displayed in the left panel.  The RGB and the HB\n      of Crater~2 are now unmistakable. The right panel shows a\n      contrast enhanced version of the middle panel and highlights the\n      possible existence of a blue horizontal branch. The red line\n      correspond to a PARSEC isochrone with [Fe/H]=-1.7, age $10$ Gyr\n      and m$-$M=20.35. The associated mask is shown with the red\n      dashed line. For comparison, isochrones with $[$Fe/H$]$= -1.4\n      and -2 are also overlaid in green and orange color respectively.\n      The blue lines show the M92's BHB ridge-line shifted to the\n      distance modulus of $m-M20.35$.}\n    \\label{fig:DiscoveryCMD}\n\\end{figure*}\n\n\nWe applied the above method to the ATLAS data using a grid of inner\nkernel sizes (from 1\\arcmin\\ to 10\\arcmin) and isochrone masks to\ncreate a list of stellar overdensity candidates across a range of\nstellar and structural parameters. Our isochrone masks are based on\nthe most recent PARSEC evolutionary models \\citep{Bressan2012}, which\nare convolved with the appropriate ATLAS photometric error. We have\nprobed $15<m-M<23$ in distance modulus (DM), from 9.5 to 10.1 in\nlogarithm of age, and $-2<[$Fe/H$]<-1$ in metallicity. Once the known\noverdensities (previously detected Galactic satellites, Local Volume\ngalaxies etc.) are culled, in the detections list, a large object in\nthe constellation of Crater stands out at the highest significance of\n$10.7\\,\\sigma$. As shown in Figure \\ref{fig:DiscoveryRaw}, Crater~2\nreveals itself rather unambiguously in both stellar spatial\ndistribution - even before any isochrone filtering is applied - and\nthe Color Magnitude Diagram (CMD). The left panel of the Figure shows\nCrater~2 as an extended overdensity at the edge of the ATLAS footprint\non top of a noticeably non-uniform background. The Figure's right\npanel shows the CMD of all stars within $\\sim30\\arcmin$ of the\ncenter of the detection (see Section~\\ref{sec:spatpar} for details of the\nmeasurement of Crater~2 position, distance and size), where a\nprominent Red Horizontal Branch (RHB) as well as an obvious Red Giant\nBranch (RGB) can be seen. The well-defined RHB is a decent distance\nindicator: Crater~2 is $\\sim$120\\,kpc away from the Sun. Note that\ncuriously, Crater 2's CMD is remarkably similar to that of Sextans\n\\citep[see Figure~3 of][]{Sextans}.\n\nFigure \\ref{fig:DiscoverySpatial} shows the density distribution of\nstars selected using a mask based on a PARSEC isochrone with\n[Fe/H]=$-1.7$, age $10$ Gyr offset to $m-M=20.35$ (see Section\n\\ref{sec:isopar} for details on the selection of the isochrone\nparameters, and the right panel of Figure \\ref{fig:DiscoveryCMD}). The\nmask's width is defined by the ATLAS photometric error above the\nminimum width of 0.1 mag. The CMD selection enhances the stellar\noverdensity associated with Crater~2 as revealed in the left panel of\nFigure \\ref{fig:DiscoverySpatial}.  According to the middle and right\npanels of the Figure, no obvious galaxy overdensity or strong\nextinction variation can be seen overlapping with the new satellite's\nlocation. Crater~2's angular diameter of $\\sim$ 1 degree corresponds\nto $\\sim$ 2\\,kpc at the distance of 120\\,kpc, which places it firmly in\nthe class of dwarf galaxies.\n\nDue to the substantial size of Crater~2, and hence the large aperture\nrequired to create the CMD, the details of the satellite's stellar\npopulation distribution are buried in the Galactic\nbackground/foreground. As a simple but efficient way of\ndecontaminating the CMD, Figure~\\ref{fig:DiscoveryCMD} (middle panel) presents the\nHess difference diagram of the stars within 31\\arcmin\\ of the center of\nCrater~2, in which both the RGB and HB are now evident. For\ncomparison, on left panel we also show the Hess diagram of the background, which is\nconstructed with the stars that lie between 3 and 5 degrees away from\nCrater~2. The right panel of the Figure gives an alternative, highly\ncontrasted version of the Hess difference which highlights hints of a\nfaint Blue HB.  Also shown is the best-fit isochrone with its\nassociated mask in red solid line and red dashed line,\nrespectively. For comparison, models with higher and lower metallicity\nare given. Additionally, the M92 BHB ridge-line shifted to the\nfiducial DM of $m-M=20.35$ and the BHB mask are displayed in blue.\n\n\\section{Properties of Crater~2}\\label{sec:prop}\n\\subsection{Stellar populations}\\label{sec:isopar}\n\nTo estimate the age, metallicity and distance of Crater~2 we model the\ndistribution of the stars in the color and magnitude space with a\ncombination of an empirical background CMD density and a single\nstellar population model from the PARSEC isochrone set with the\nappropriate photometric errors applied. The probability of observing a\nstar with colour $g-r$ and apparent magnitude $r$ in the vicinity of\nCrater~2 is:\n\n\n", "index": 3, "text": "\\begin{equation}\\label{cmdPDF}\nP(g-r,r|\\phi)=f\\,P_{obj}(g-r,r|\\phi)+(1-f)\\,P_{bg}(g-r,r)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"P(g-r,r|\\phi)=f\\,P_{obj}(g-r,r|\\phi)+(1-f)\\,P_{bg}(g-r,r)\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo>-</mo><mi>r</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">|</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mi>f</mi></mpadded><msub><mi>P</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo>-</mo><mi>r</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">|</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>f</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><msub><mi>P</mi><mrow><mi>b</mi><mo>⁢</mo><mi>g</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>g</mi><mo>-</mo><mi>r</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07178.tex", "nexttext": "\n\n\n\\noindent where $x$ and $y$ are the coordinates of the stars on the\nsky in the tangential projection at the center of the object. $\\Theta$\nis a shorthand for all model parameters, namely the elliptical radius\n$\\tilde {r}$, the coordinates of the the center of Crater~2 $x_0$,\n$y_0$, the positional angle of the major axis $\\theta$ and the\nellipticity of the object $e$:\n\n\n\\begin{figure}\n    \\includegraphics[width=0.98\\columnwidth]{RadialProfile.eps}\n    \\caption{Radial number density profile of Crater~2 as probed by\n      the stars inside the isochrone mask shown in\n      Figure~\\ref{fig:DiscoveryCMD}. The red line shows the best fit\n        model which includes a Plummer profile with\n        $r_h=31\\arcmin$. The small bump at $R\\sim100\\arcmin$ is\n        probably associated with the small overdensity of\n        mis-classified galaxies located close to Crater~2.}\n    \\label{fig:RadialProfile}\n\\end{figure}\n\n\n\n\\begin{eqnarray}\n\\tilde{r}&=&\\sqrt{\\tilde{x}^2+\\tilde{y}^2} \\\\\n\\tilde{x}&=&\\cos\\theta\\,\\left(x-x_0\\right)/\\left(1-e\\right)+\\sin\\theta\\left(y-y_0\\right)/\\left(1-e\\right) \\nonumber\\\\\n\\tilde{y}&=&-\\sin\\theta\\,\\left(x-x_0\\right)+\\cos\\theta\\left(y-y_0\\right)\\nonumber.\n\\end{eqnarray}\n\n\n\\noindent The background/foreground density is a bilinear\ndistribution of the form:\n\n\n\\begin{eqnarray}\nP_{bg}(x,y|\\Theta)=\\frac{1}{N_{bg}}\\left(p_1\\,x+p_2\\,y+1\\right),\n\\end{eqnarray}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{SizeLuminosity.eps}\n\\caption{Absolute magnitude versus half-light radius. Local galaxies\n  from \\citet{McConnachie2012} (updated September 2015) are shown with\n  different symbols. Dwarf galaxy satellites of the Milky Way are\n  shown with red open circles, the M31 dwarfs with black unfilled\n  triangles, and other nearby galaxies with gray crosses.  Black dots\n  are the MW globular clusters measurements from\n  \\citep{Harris2010,Belokurov2010,Munoz2012,Balbinot2013,Kim2015a,Kim2015b,Kim2015c,Laevens2015,Weisz2015}  and gray dots\n  are extended objects smaller than 100\\,pc from\n  \\citep{Brodie2011}. As the half-light radii of LMC and SMC are\n  unavailable in \\citet{McConnachie2012}, we measured these ourselves\n  using the 2MASS point source catalogue \\citep{Skrutskie2006}.  The\n  black solid (dashed) line corresponds to the constant level surface\n  brightness within half-light radius of $\\mu=31$ (30)\n  $\\rm{mag}\\,\\rm{arcsec}^{-2}$, which is approximately the surface\n  brightness limit of the searches for resolved stellar systems in the\n  SDSS \\citep{Koposov2008}. The position of Crater~2 is marked with a\n  a filled red circle. Apart from the only three MW dwarfs exceeding\n  Crater~2 in size, i.e. the LMC, the SMC and the Sgr, we also label\n  the following systems. UMa~I, UMa~II, Tuc~2 and Tuc~IV are the\n  ultra-faint dwarfs with surface brightness levels similar to that of\n  Crater 2. Leo T, Dra, Pho, Sex and CVn I all have similar (or\n  slightly higher luminosity) but are smaller in size. Fornax is\n  overwhelmingly more luminous compared to Crater 2, yet not as\n  extended. Finally, there are three systems in the M31 that are\n  comparable (or even larger!) in size to Crater~2: And XIX, And XXIII\n  and And XXXII. The position of the peculiar and extended globular\n  cluster Crater is also marked.}\n\\label{fig:SizeLuminosity}\n\\end{figure*}\n\n\n\\noindent with $p_1$ and $p_2$ the two parameters that define the plane, and $N_{bg}$ a normalization constant so the integral of $P_{bg}$ over the modeled area is 1. Analogously to Eq~\\ref{cmdPDF}, the probability of observing a star at $x,y$ is:\n\n\n\n", "itemtype": "equation", "pos": 19757, "prevtext": "\n\n\\noindent Here $\\phi$ are the three isochrone parameters, i.e., age,\nmetallicity and the distance modulus, $f$ is the fraction of stars belonging \nto the object, $P_{obj}$ the probability distribution of the satellite stars,\nand $P_{bg}$ the probability distribution of the background stars. Note that \nthe background model, $P_{bg}$, does not depend on any model parameters and is \ndetermined empirically using the stellar distribution far from the center of \nthe satellite. The satellite model, $P_{obj}$, is a convolution of the expected \nnumber of stars at each point along the isochrone with the typical observed \nphotometric error of the ATLAS survey at the given magnitude . \n\nFor stars within 31\\arcmin\\ of the center of Crater~2, the likelihood is \nsampled using the affine invariant ensemble sampler {\\it emcee} \n\\citep{GoodmanWeare2010,ForemanMackey2013} with flat priors on all three \nisochrone parameters. Given the strong RGB and RHB of Crater~2, all three are \nwell constrained: [Fe/H]=$-1.7\\pm0.1$; age=$10\n\\pm 1$ Gyr and m$-$M=$20.35\\pm0.02$ (also see Table\n\\ref{tab:Properties}). Note, however, that these numbers, and in\nparticular the formal error on the distance, should be taken with\ncaution, given that the behavior of HB stars is still not well\nunderstood, therefore rendering the models somewhat uncertain \n\\citep[see e.g.][]{Gratton2010}.\n\n\\subsection{Structural parameters}\\label{sec:spatpar}\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{SpatialZoom.eps}\n    \\caption{Close-up of the spatial distribution of Crater~2.\n   The left panel shows the density map of\n      all stars that fall within the isochrone mask, i.e. RGB +\n      RHB. The middle panel shows RHB stars only - these are the most\n      numerous stars above the limiting magnitude of the ATLAS\n      survey. The rightmost panel gives the distribution of the BHB\n      candidate stars as selected using the blue box shown in the\n      right panel of Figure~\\ref{fig:DiscoveryCMD}.  The red solid\n      (dashed) line indicates the half-light radius (twice the\n      half-light radius).}\n    \\label{fig:SpatialZoom}\n\\end{figure*}\n\n\nThe structural parameters of Crater~2 are determined by maximising the\nlikelihood of a model describing the distribution of stars in the\nvicinity of the object \\citep[similar to\n  e.g.,][]{Martin2008,Koposov2015}. To reduce Galactic contamination,\nwe only use stars with $g<22$ and $r<22$ that fall inside the\nisochrone mask shown in the right panel of\nFigure~\\ref{fig:DiscoveryCMD}. The spatial density model is a\ncombination of a linearly varying background and a 2-dimensional\nelliptical Plummer profile, defined as:\n\n\n\n", "index": 5, "text": "\\begin{equation}\nP_{obj}(x,y|\\Theta)=\\frac{1}{\\pi a^2 \\left(1-e\\right)}\\left(1+\\frac{\\tilde{r}^2}{a^2}\\right)^ {-2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P_{obj}(x,y|\\Theta)=\\frac{1}{\\pi a^{2}\\left(1-e\\right)}\\left(1+\\frac{\\tilde{r}%&#10;^{2}}{a^{2}}\\right)^{-2},\" display=\"block\"><mrow><msub><mi>P</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><mi>π</mi><mo>⁢</mo><msup><mi>a</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mi>e</mi></mrow><mo>)</mo></mrow></mrow></mfrac><msup><mrow><mo>(</mo><mn>1</mn><mo>+</mo><mfrac><msup><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">~</mo></mover><mn>2</mn></msup><msup><mi>a</mi><mn>2</mn></msup></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07178.tex", "nexttext": "\n\n\n\\noindent where $f$ is the fraction of stars belonging to the object.\n\nAs in the case of the CMD modelling, flat priors are assumed for all\nparameters, and the posterior distribution is sampled with {\\it\n  emcee}. Here we report the best fit parameters and their\nuncertainties corresponding to the 15.9, 50, and 84.1 percentiles of\nthe posterior distribution (see Table \\ref{tab:Properties}).\nInterestingly, we find that in projection on the sky, Crater~2 appears\nto be completely circular with e$<$0.1 at 95\\% confidence. Its\nhalf-light radius is $31'\\pm2.5'$, corresponding to the physical size\nof 1.07$\\pm$0.08\\,kpc at the measured distance of 117\\,kpc\n(m$-$M=20.35). A zoom-in on the spatial distribution of stars in the\nproximity of Crater~2 is shown in Figure \\ref{fig:SpatialZoom}. The\nleft panel displays the density map of stars that belong to both the\nRHB and the RGB, the middle panel presents the RHB candidates only, while\nthe right panel deals with BHB density. The BHB candidate stars are\nselected to lie within the blue dashed box shown in the right panel of\nFigure~\\ref{fig:DiscoveryCMD}. The red solid (dashed) circle shows the\nhalf-light radius $r_h$ ($2r_h$) of the best-fit model. An overdensity\nof stars is visible in both middle and right panel of Figure\n\\ref{fig:SpatialZoom}, with the RHB signal being clearly stronger. The\nradial profile of Crater~2 is shown in Figure~\\ref{fig:RadialProfile}\ntogether with the best fit model (red line), which clearly provides an\nadequate fit to the data. The small bump at $R\\sim100'$ is probably\ncaused by the contamination from mis-classified galaxies residing in\nthe galaxy overdensity seen in Figure \\ref{fig:DiscoverySpatial}.\n\nThe total number of Crater~2 stars with $g,r<22$ inside the isochrone\nmask can be obtained from the measurement of the fraction of Crater~2\nmember stars in the field $f$. Using the total number of stars $822\\pm\n79$, we compute the absolute magnitude of Crater~2 by assuming a\nChabrier initial mass function \\citep{Chabrier2003} and the best-fit\nPARSEC isochrone described in the previous section. The above\ncalculation gives the intrinsic luminosity of the satellite of $M_V =\n-7.8\\pm 0.1$.\n\n\\section{Discussion and Conclusions}\\label{sec:CONCL}\n\\subsection{The feeble giant}\n\nFigure \\ref{fig:SizeLuminosity} compares the structural properties of\nCrater~2 to those of known satellite systems. Estimates of half-light\nradius are shown against the values of absolute magnitude for all\ncurrently known Milky Way globular clusters (black dots) and dwarf\ngalaxies (open circles) as well as the dwarfs of the M31 (triangles)\n\\citep[][updated Sep 2015]{McConnachie2012}; this is complemented by\nmeasurements collected for various extended companion objects around\nnearby galaxies \\citep[grey dots,][]{Brodie2011}. To guide the eye,\nthe lines of constant surface brightness of 30 and\n31\\,mag\\,arcsec$^{-2}$ is drawn. This level - as deduced by\ne.g. \\citet{Koposov2008} - approximately corresponds to the surface\nbrightness detection limit of the current dwarf satellite searches.\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{Crater2wholesky.eps}\n    \\caption{Positions of Milky Way satellites with heliocentric\n      distances between 100\\,kpc and 400\\,kpc. Open circles are dwarf\n      galaxies from \\citet{McConnachie2012}, filled black circles are\n      globular clusters, filled blue circles show the positions of the\n      LMC and the SMC, and the filled red circle gives the position of\n      Crater~2. The red (grey) contour delimits the ATLAS (SDSS)\n      footprint.  The black line shows the segment of the best fit\n      orbit, which passes very close to the 3-D positions of Crater~2,\n      Crater, Leo~IV, Leo~V and Leo~II. The great circle defined by\n      \\citet{Nidever2008} which aligns with the Magellanic stream is\n      also shown with the black dashed line.}\n    \\label{fig:Crater2wholesky}\n\\end{figure*}\n\n\nThe location of the Crater~2 in the size-luminosity plane is rather\nremarkable.  First, it is one of the lowest surface brightness dwarfs\ndiscovered so far, hovering just above the 31 mag\\,arcsec$^{-2}$\nmark. Comparably diffuse are the recently found Tuc~2 and IV as well as\nthe pair of dwarfs in the constellation of Ursa Major. Second, the new\ndwarf appears to be the largest ultra-faint satellite known in the\nGalaxy, and the fourth largest overall: only the disrupting\nSagittarius dwarf and the Magellanic Clouds - both with significantly\nlarger stellar masses - are bigger than Crater~2.  In Andromeda on the\nother hand, it has long been suspected that there exists a\nsub-population of oversized dwarfs simply not present in the Milky\nWay. These would for example include And~XIX with the half-light\nradius of 1.7\\,kpc \\citep{Mcconnachie2008} and a somewhat brighter And\nXXXII with the half-light radius of 1.4\\,kpc \\citep{Martin2013}. At\nlast, with the discovery of Crater~2 some semblance of parity has been\nestablished!\n\nIt is now being gradually acknowledged that a substantial number of\nvery low surface brightness systems might have been avoiding\ndetection. For example, recently, a discovery of an entire population\nof ultra diffuse galaxies (UDGs) was reported by \\citet{vanDokkum2015}\nin the Coma cluster. Compared to Crater~2, the Coma UDGs are typically\nmore extended, with sizes between 1.5 and ~4\\,kpc. Most importantly,\nthey reach much higher levels of surface brightness of $\\sim$ 25\nmag\\,arcsec$^{-2}$, i.e. two orders of magnitude brighter than Crater~\n2 or Andromeda XIX.  It is therefore difficult to claim an unambiguous\nevolutionary connection between the UDGs and dwarfs similar to\nCrater~2. For the UDGs, tides seem to be the likely culprit. However,\nas far as possible Crater~2 formation scenarios are concerned, we can\nconfidently exclude interactions with the Galaxy. The two primary\nreasons being the near perfect circular shape of Crater~2 iso-density\ncontours and its likely very long orbital period.\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{LeoCrater.eps}\n    \\caption{The Crater-Leo group. The left panel shows the positions\n      of Crater, Crater~2, Leo~IV, Leo~V and Leo~II on the sky. Black\n      dashed line indicates the great circle with the pole at\n      $(\\alpha,\\delta)=(83.\\degr2,-11.\\degr8)$ that passes close to\n      all five satellites. The middle panel shows the run of the\n      satellites' heliocentric distance versus declination, and the\n      right panel shows the heliocentric radial velocity (corrected\n      for the Solar reflex motion) versus declination. The red line\n      shows an orbit obtained by modelling the 3-D positions and the\n      velocities of the four satellites with known radial velocities,\n      i.e., Leo~II, Leo~IV, Leo~V and Crater.}\n    \\label{fig:LeoCrater}\n\\end{figure*}\n\n\nPerhaps the following simple, if mundane, genesis hypothesis is worth \nconsidering.  Do systems like Crater~2 and And~XIX represent a\nnatural continuation of the dwarf galaxy distribution in size and\nsurface brightness?  This could be the missing part of the dwarf\nfamily that only now comes into view helped by data from ever more\nambitious wide-area surveys. Additionally, it is not very difficult to\nimagine that the bulk of the dwarf spheroidals were somewhat larger to\nbegin with.  Falling into the potential well of the Milky Way would lead\nto them experiencing varying amounts of tidal truncation\n\\citep[see][]{Penarrubia2008}.  If so then there should be a correlation\nbetween the size (and surface brightness) of a dwarf and the time\nsince its in-fall, with the likes of Crater~2 representing the largely\nunaffected, recently accreted population. The question, however,\nremains whether the size and/or the surface brightness of a dwarf\ncould be linked to the physical conditions at the birthplace. This\nargument can only be developed further if the orbital history of the\nsatellite can be better constrained.\n\n\\subsection{The Crater-Leo group}\n\nFigure \\ref{fig:Crater2wholesky} shows the distribution on the sky (in\nequatorial coordinates) of all satellites (both dwarfs and globulars)\nlocated further than 100\\,kpc from the Galactic\ncenter. \\citet{Belokurov2010,Belokurov2014} have already pointed out\nthe close alignment between Leo~IV, Leo~V and Crater. Not only are these\npositioned almost precisely along a great circle, they also\npossess very similar radial velocities and distances, suggestive of a\ncommon origin in a galaxy group prior to infall into the\nMilky Way. Surprisingly, as the Figure demonstrates, the newly discovered\nCrater~2 and the classical satellite Leo~II could also be part of this\ngroup: all five lie close to the great circle with the pole at\n$(\\alpha,\\delta)=(83.\\degr2,-11.\\degr8)$. In 3-D, as the middle panel\nof Figure~\\ref{fig:LeoCrater} shows, the location of the satellites is\nconsistent with a monotonic distance increase, moving up in\ndeclination from Crater~2 to Leo~II (bear in mind, though, that the\nheliocentric distance errors are considerable, i.e. around 10-15\\%).\n\nLet us investigate further the significance of the alignment between\nthese distant satellites. We start by considering the Northern\nGalactic Cap (NGC) area (b$>$30\\degr) as observed by both the VST ATLAS and the SDSS\n- together the two surveys have covered $\\sim$9000 square degrees in\nthis part of the sky. Around the NGC, the total number of satellites\n(globular clusters and dwarf galaxies) outside 100\\,kpc radius is\n10. Therefore, we create random Monte-Carlo realizations of satellite\ndistribution on the sky within the northern SDSS and VST ATLAS footprints\nassuming uniform distribution on the sky,\nwhere the number of satellites is dictated by the Poisson\ndistribution with $\\lambda=10$. For each random realization, we determine the maximum\nnumber of satellites that are strongly aligned, similarly to what is\nobserved for the Crater-Leo group. More specifically, we find the\nmaximum number of satellites in an elongated great circle box with the size 2\\degr\n$\\times$ 45\\degr. The probability of having 5 or more satellites align\nin such a way is $\\sim$ 0.0045 which corresponds to $\\sim$ 2.6 sigma\nsignificance. Even though the significance appears rather modest, note\nthat this calculation already takes into account the\n``look-elsewhere'' effect.\n\nThe true significance of the orbital synchronization is probably still\nhigher given that both their distances (radial velocities) are similar\nfor the 5 (4) objects in the Leo/Crater group. To assess the\nplausibility of the group accretion hypothesis we attempt to model the\npositions and the kinematics of the Crater-Leo satellites with a\nsingle orbit. We used a Navarro-Frenk-White (NFW) halo with a virial\nmass of 10$^{12}$\\,M$_\\odot$ and concentration $c=10$. The best-fitting orbit that reproduces the 3-D positions and\ngoes close to the radial velocities of the satellites is given in\nFigure~\\ref{fig:LeoCrater}. It is, however, immediately clear from the\ninspection of the Figure, that although a single orbit can\ndescribe the 3-D positions well, it can not simultaneously match the\nobserved kinematics.\n\nThe poor kinematics fit is not surprising: low amplitude of radial\nmotion (as manifested in all four satellites with known velocities)\ncorresponds to the orbital extrema, the pericentre and the\napocentre. The kinematics would therefore require these four group\nmembers to cluster in the vicinity of either apo or peri, while in\nreality their distances cover an impressive range of at least 100\\,kpc. \nIt is, however, well known that tidal debris do not follow orbits\nexactly. There exists strong energy sorting of debris along the\nstream, imprinted at the time of stripping. The energy offset between\nthe debris and the progenitor is a function of orbital phase\n\\citep[see e.g.][]{Gibbons2014} - the widest energy distribution\navailable around the peri crossing, with the objects unbound closer to\nthe apo-centre characterized by energies more similar to that of the\nprogenitor. Thus, it is not unreasonable to conjecture that the\nsatellites stripped from the common group and that are now\nobserved at different phases along the stream, follow distinct orbits,\ncorresponding to the energy at the time of un-binding, each with its\nown apo-centre. \n\nAs a matter of fact, long and approximately linear tidal\n``streamlets'' reaching well beyond the average stream apo-centre are\na ubiquitous feature in simulations of the Sgr dwarf disruption.\nThese, as discussed above, are composed of high energy particles torn\noff the progenitor at the penultimate peri-centre crossing. If\nCrater~2 indeed came from the same progenitor, to which we assume\nCrater, Leo IV, V and II all one day belonged, and the group is\ncurrently near the apo-centre, the amplitude of the line-of-sight\nvelocity of Crater~2 should be low. Ultimately, to confirm this\nhypothesis one would require accurate proper motion measurements for\nas many members of the tentative group as possible. So far, such\nmeasurement only exists for the Leo~II dwarf \\citep{Lepine2011}.\nUnfortunately, the measurement error is prohibitively large, thus\nleaving the satellite's direction of motion completely unconstrained.\n\nNote that there are further, perhaps rather circumstantial, pieces of\nevidence in favor of the Crater-Crater~2 connection. Both objects are\namongst the most extended in the corresponding satellite category:\nCrater~2 amongst the Milky Way dwarfs, and Crater amongst the Milky Way\nglobular\nclusters. Both are highly spherical. Finally, in terms of stellar\npopulations, both have red and short horizontal branches, whose\nappearance is somewhat unusual given the objects' low metallicity.\n\n\\subsection{Summary}\n\nHere we have presented the discovery of the Crater~2 dwarf galaxy,\nidentified in the data of the VST ATLAS survey. The luminosity of\nCrater~2 is $M_V\\approx-8$, i.e. in the range where it could be\nclassified both as a bright ultra-faint dwarf or as a faint classical\none. With the half-light radius of $\\sim$1.1\\,kpc, Crater~2 would be\nthe largest amongst the UFDs, and is the fourth largest amongst the\nMilky Way satellites overall - only the LMC, the SMC and the Sgr are\nmore extended. Consequently, Crater~2 is also one of the lowest\nsurface brightness stellar systems in the Universe ever\ndiscovered. Additionally, there is a mounting body of evidence that\nCrater~2 could have belonged to the satellite group, whose members\nalso included the peculiar globular cluster Crater, UFDs Leo~IV and V,\nas well as the classical dwarf Leo~II. We hypothesize that the\nCrater-Leo group is now dissolved into a narrow tidal debris stream\nwhose apo-centre is between 100 and 200\\,kpc. The stellar overdensity\ncorresponding to Crater~2 was detected at comfortably high levels of\nstatistical significance. If similar size objects with lower\nluminosity - and hence lower surface brightness - exist, they should\nbe uncovered in the nearest future.\n\n\\section*{Acknowledgments} \n\nThe authors wish to acknowledge many useful discussions with the\nmembers of the Cambridge STREAMS club in general, and Wyn Evans, Denis\nErkal and Simon Gibbons in particular. We also are grateful to Filippo\nFraternali for his advice on the HI data available. Support for\nG.T. is provided by CONICYT Chile. The research leading to these\nresults has received funding from the European Research Council under\nthe European Union's Seventh Framework Programme (FP/2007-2013)/ERC\nGrant Agreement no. 308024. This research was made possible through\nthe use of the AAVSO Photometric All-Sky Survey (APASS), funded by the\nRobert Martin Ayers Sciences Fund.\n\n\n\\bibliographystyle{mn2e}\n\\bibliography{biblio}\n\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": 23469, "prevtext": "\n\n\n\\noindent where $x$ and $y$ are the coordinates of the stars on the\nsky in the tangential projection at the center of the object. $\\Theta$\nis a shorthand for all model parameters, namely the elliptical radius\n$\\tilde {r}$, the coordinates of the the center of Crater~2 $x_0$,\n$y_0$, the positional angle of the major axis $\\theta$ and the\nellipticity of the object $e$:\n\n\n\\begin{figure}\n    \\includegraphics[width=0.98\\columnwidth]{RadialProfile.eps}\n    \\caption{Radial number density profile of Crater~2 as probed by\n      the stars inside the isochrone mask shown in\n      Figure~\\ref{fig:DiscoveryCMD}. The red line shows the best fit\n        model which includes a Plummer profile with\n        $r_h=31\\arcmin$. The small bump at $R\\sim100\\arcmin$ is\n        probably associated with the small overdensity of\n        mis-classified galaxies located close to Crater~2.}\n    \\label{fig:RadialProfile}\n\\end{figure}\n\n\n\n\\begin{eqnarray}\n\\tilde{r}&=&\\sqrt{\\tilde{x}^2+\\tilde{y}^2} \\\\\n\\tilde{x}&=&\\cos\\theta\\,\\left(x-x_0\\right)/\\left(1-e\\right)+\\sin\\theta\\left(y-y_0\\right)/\\left(1-e\\right) \\nonumber\\\\\n\\tilde{y}&=&-\\sin\\theta\\,\\left(x-x_0\\right)+\\cos\\theta\\left(y-y_0\\right)\\nonumber.\n\\end{eqnarray}\n\n\n\\noindent The background/foreground density is a bilinear\ndistribution of the form:\n\n\n\\begin{eqnarray}\nP_{bg}(x,y|\\Theta)=\\frac{1}{N_{bg}}\\left(p_1\\,x+p_2\\,y+1\\right),\n\\end{eqnarray}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure*}\n    \\includegraphics[width=\\textwidth]{SizeLuminosity.eps}\n\\caption{Absolute magnitude versus half-light radius. Local galaxies\n  from \\citet{McConnachie2012} (updated September 2015) are shown with\n  different symbols. Dwarf galaxy satellites of the Milky Way are\n  shown with red open circles, the M31 dwarfs with black unfilled\n  triangles, and other nearby galaxies with gray crosses.  Black dots\n  are the MW globular clusters measurements from\n  \\citep{Harris2010,Belokurov2010,Munoz2012,Balbinot2013,Kim2015a,Kim2015b,Kim2015c,Laevens2015,Weisz2015}  and gray dots\n  are extended objects smaller than 100\\,pc from\n  \\citep{Brodie2011}. As the half-light radii of LMC and SMC are\n  unavailable in \\citet{McConnachie2012}, we measured these ourselves\n  using the 2MASS point source catalogue \\citep{Skrutskie2006}.  The\n  black solid (dashed) line corresponds to the constant level surface\n  brightness within half-light radius of $\\mu=31$ (30)\n  $\\rm{mag}\\,\\rm{arcsec}^{-2}$, which is approximately the surface\n  brightness limit of the searches for resolved stellar systems in the\n  SDSS \\citep{Koposov2008}. The position of Crater~2 is marked with a\n  a filled red circle. Apart from the only three MW dwarfs exceeding\n  Crater~2 in size, i.e. the LMC, the SMC and the Sgr, we also label\n  the following systems. UMa~I, UMa~II, Tuc~2 and Tuc~IV are the\n  ultra-faint dwarfs with surface brightness levels similar to that of\n  Crater 2. Leo T, Dra, Pho, Sex and CVn I all have similar (or\n  slightly higher luminosity) but are smaller in size. Fornax is\n  overwhelmingly more luminous compared to Crater 2, yet not as\n  extended. Finally, there are three systems in the M31 that are\n  comparable (or even larger!) in size to Crater~2: And XIX, And XXIII\n  and And XXXII. The position of the peculiar and extended globular\n  cluster Crater is also marked.}\n\\label{fig:SizeLuminosity}\n\\end{figure*}\n\n\n\\noindent with $p_1$ and $p_2$ the two parameters that define the plane, and $N_{bg}$ a normalization constant so the integral of $P_{bg}$ over the modeled area is 1. Analogously to Eq~\\ref{cmdPDF}, the probability of observing a star at $x,y$ is:\n\n\n\n", "index": 7, "text": "\\begin{equation}\nP(x,y|\\Theta)=f\\,P_{obj}(x,y|\\Theta)+(1-f)\\,P_{bg}(x,y|\\Theta),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P(x,y|\\Theta)=f\\,P_{obj}(x,y|\\Theta)+(1-f)\\,P_{bg}(x,y|\\Theta),\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mi>f</mi></mpadded><msub><mi>P</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>f</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><msub><mi>P</mi><mrow><mi>b</mi><mo>⁢</mo><mi>g</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}]