[{"file": "1601.02082.tex", "nexttext": "\nThe channel outputs at the $n$-th BS antenna over $Q$ channel uses can be collectively written as\n\n", "itemtype": "equation", "pos": 14817, "prevtext": "\n\n\\title{Mixed-ADC Massive MIMO Uplink in Frequency-Selective Channels}\n\\author{Ning Liang, Wenyi Zhang\n\\thanks{\nN. Liang and W. Zhang are with Key Laboratory of Wireless-Optical Communications, Chinese Academy of Sciences, Department of Electronic Engineering and Information Science, University of Science and Technology of China, Hefei, China (Emails: liangn@mail.ustc.edu.cn, wenyizha@ustc.edu.cn).\n}\n}\n\\maketitle\n\\thispagestyle{empty}\n\\begin{abstract}\nThe aim of this paper is to investigate the recently developed mixed-ADC architecture for frequency-selective channels. Multi-carrier techniques such as orthogonal frequency division multiplexing (OFDM) are employed to handle inter-symbol interference (ISI). A frequency-domain equalizer is designed for mitigating the inter-carrier interference (ICI) introduced by the strong nonlinearity of coarse quantization. For static single-input-multiple-output (SIMO) channels, a closed-form expression of the generalized mutual information (GMI) is derived, and based on which the linear frequency-domain equalizer is optimized. The analysis is then extended to ergodic time-varying SIMO channels, where numerically tight lower and upper bounds of the GMI are derived. The analytical results are naturally applicable to the multi-user scenario, for both static and time-varying fading channels. Extensive numerical studies reveal that the mixed-ADC architecture with a small proportion of high-resolution ADCs is sufficient to achieve a large portion of the capacity of ideal conventional architecture, and that it is effective in eliminating the error floor encountered by receivers with coarse quantization only.\n\\end{abstract}\n\\begin{IEEEkeywords}\nAnalog-to-digital converter (ADC), frequency-selective fading, generalized mutual information, inter-carrier interference, linear frequency-domain equalization, massive multiple-input-multiple-output (MIMO), mixed-ADC architecture, orthogonal frequency division multiplexing (OFDM).\n\\end{IEEEkeywords}\n\\setcounter{page}{1}\n\n\n\\section{Introduction}\nBy deploying tens to hundreds of antennas at the base station (BS) and simultaneously serving multiple users in the same time-frequency resource block, massive multiple-input-multiple-output (MIMO) achieves unprecedented gain in both spectral efficiency and radiated energy efficiency, accommodating the stringent requirements of future 5G systems \\cite{marzetta2010noncooperative}-\\cite{ngo2013energy}. The performance gains, however, come at the expense of a linear increase in hardware cost as well as circuitry power consumption, and therefore massive MIMO can realize these profits in practice only if low-cost, energy-efficient solutions are available.\n\n\\subsection{Related Work}\nBasically, if each BS antenna is configured with an unabridged radio frequency (RF) chain, then the only way to alleviate hardware cost and circuitry power consumption is to use economical low-power components when building the RF chains. These components, however, generally have to tolerate severe impairments, such as nonlinearity of power amplifier, phase noise of oscillator, and I/Q imbalance. Modeling the aggregate effect of the impairments as an additional Gaussian noise independent of the desired signal, the authors of \\cite{bjornson2014hardware} investigated the impact of hardware impairments on the system spectral efficiency and radiated energy efficiency, and concluded that massive MIMO exhibits some degree of resilience against hardware impairments. Further, employing a similar model the authors of \\cite{bjornson2015massive} derived a scaling law that reveals the tradeoff between hardware cost, circuitry power consumption, and the level of impairments. Although the adopted stochastic impairment models are not rigorous theoretically, the analytical results in \\cite{bjornson2014hardware}-\\cite{bjornson2015massive} closely match those obtained by a more accurate hardware-specific deterministic model, as demonstrated by \\cite{gustavsson2014impact}.\n\nAmong all the components in a RF chain, high-resolution ADC (typically with a bit-width exceeding 10) is particularly power-hungry, since the power consumption of an ADC scales exponentially with the bit-width \\cite{murmann2014adc}. Lowering the bit-width of the adopted ADC will therefore bring in considerable energy saving. This fact has motivated extensive research on low-cost, energy-efficient design of wireless communication systems through employing low-resolution or even one-bit ADCs to build the RF chain, e.g., \\cite{singh2009limits} for additive white Gaussian noise (AWGN) channels, \\cite{yin2010monobit} for ultra-wideband channels, and \\cite{mezghani2008analysis}-\\cite{mo2014high} for MIMO channels.\n\nRegarding massive MIMO, the impact of coarse quantization has been investigated only recently. In \\cite{risi2014massive}, the authors examined the performance of an uplink one-bit massive MIMO system adopting QPSK constellation, pilot-aided least-squares (LS) channel estimation, and maximum ratio combining (MRC) or zero-forcing (ZF) reception. The authors of \\cite{jacobsson2015one} further revealed that enhancement of the achievable data rate can be attained by high-order modulation such as 16-QAM. The underlying reason is that, even for one-bit massive MIMO, the amplitude of the transmit signal can be recovered provided that the signal-to-noise ratio (SNR) is not too high. In addition, the authors of \\cite{wen2015bayes} quantified the bit error rate (BER) of a Bayes-optimal joint channel-and-data (JCD) estimator for massive MIMO with low-resolution ADCs. Particularly, a variant of approximate message passing algorithm was adopted to relieve the computational burden of the Bayes-optimal estimator. Similarly, the authors of \\cite{zhang2015mixed} analyzed the BER performance of mixed-ADC massive MIMO that adopts a Bayes-optimal detector (and its relaxtion), assuming perfect channel state information (CSI) at the BS. The performance of quantized massive MIMO under frequency-selective fading was investigated in \\cite{studer2015quantized}, where the attention was mainly focused on data detection algorithms and the corresponding error-rate performance. In general, \\cite{risi2014massive}-\\cite{studer2015quantized} conclude that massive MIMO is somewhat robust to coarse quantization, validating the potential of building massive MIMO by low-resolution ADCs\\footnote{From an engineering perspective, coase quantization actually subverts almost every aspect of the system design, including the acquisition of CSI, time-frequency synchronization, data detection algorithms, among others. In this paper, however, we primarily focus on the fundamental performance evaluation of such system, and leave the other practically important aspects for future research.}.\n\n\\subsection{Superiority of Mixed-ADC Architecture}\nExcept \\cite{zhang2015mixed}, all the aforementioned works have assumed a uniform-ADC architecture; that is, all the antennas at the BS are equipped with low-resolution ADCs of the same bit-width. Although it appears that such an architecture is feasible in terms of achievable data rate or BER, several issues due to coarse quantization may prevent it from realizing the promised profits, including data rate loss in the high SNR regime \\cite{mo2014high}, error floor for linear multi-user (or multi-stream) detection with 1-3 bit quantized outputs \\cite{zhang2015mixed}-\\cite{shah2013optimal}, overhead and challenge of channel estimation \\cite{yin2010monobit}, \\cite{risi2014massive}, \\cite{ivrlac2007mimo} and of time-frequency synchronization from quantized outputs. From this perspective, high-resolution ADCs still appear practically indispensable in the effective design of massive MIMO receivers.\n\nMotivated by such consideration, in early works \\cite{liang2015mixed}-\\cite{liang2015a} we have proposed a mixed-ADC architecture for massive MIMO (termed as \\emph{mixed-ADC massive MIMO}), where a small proportion of the high-resolution ADCs are reserved while the others are replaced by one-bit ADCs. For frequency-flat channels, the mixed-ADC architecture has been shown to be promising to achieve an attractive tradeoff between spectral efficiency and energy efficiency. Moreover, compared with the uniform-ADC architecture, the mixed-ADC architecture is inherently immune to most of the aforementioned concerns. For example, the simulation in \\cite{zhang2015mixed} suggests that, with merely 5\\% high-resolution ADCs, the mixed-ADC architecture can effectively eliminate the error floor of a relaxed Bayes-optimal detector. Besides, channel estimation and time-frequency synchronization in the mixed-ADC architecture are more tractable than those in the uniform-ADC architecture \\cite{sezginer2008asymptotically}.\n\n\\subsection{Contributions}\nIn this paper, we leverage the information-theoretical tool of generalized mutual information (GMI) to quantify the achievable data rate of the mixed-ADC architecture in frequency-selective channels\\footnote{Due to the nonlinearity of coarse quantization, the frequency-selective fading channel cannot be decomposed into multiple parallel subchannels by simply applying orthogonal frequency division multiplexing (OFDM). In this situation, some form of equalization may be employed to alleviate the inter-carrier interference (ICI) induced in time-frequency conversion.}. The main contributions of this paper are summarized as follows:\n\\begin{itemize}\n  \\item We modify the mixed-ADC architecture to make it suitable for frequency-selective channels, adopting OFDM to handle inter-symbol interference (ISI) and a linear frequency-domain equalizer to mitigate ICI.\n  \\item For static channels, we derive a closed-form expression of the GMI, and based on which further optimize the linear frequency-domain equalizer. The analytical results are then extended to ergodic time-varying channels, where we derive tight lower and upper bounds of the GMI. The impact of frequency diversity on the performance is discussed in detail.\n  \\item We propose a reduced-complexity algorithm, by which the computational complexity of the linear frequency-domain equalizer is reduced from $O(N^3Q^3)$ to $O(\\max\\{N^3Q,N^2Q^2\\log_2 Q\\})$, where $N$ is the number of BS antennas and $Q$ is the number of subcarriers.\n\\end{itemize}\n\nExtensive numerical studies under various setups reveal that, with only a small proportion of high-resolution ADCs, the mixed-ADC architecture attains a large portion of the capacity of ideal conventional architecture, and significantly outperforms antenna selection with the same number of high-resolution ADCs. In addition, the mixed-ADC architecture in the multi-user scenario is effective in eliminating the error floor encountered by the uniform-ADC architecture. These observations validate the superiority of mixed-ADC architecture for effective design of massive MIMO receivers.\n\n\\subsection{Notation}\nThroughout this paper, vectors and matrices are given in bold typeface, e.g., $\\mathbf{x}$ and $\\mathbf{X}$, respectively, while scalars are given in regular typeface, e.g., $x$. We let $\\mathbf{X}^{*}$, $\\mathbf{X}^{t}$ and $\\mathbf{X}^{\\dag}$ denote the conjugate, transpose and conjugate transpose of $\\mathbf{X}$, respectively. The $q$-th element of vector $\\mathbf{x}$ is symbolized as $(\\mathbf{x})_q$, and in the meantime, the $(p,q)$-th element of matrix $\\mathbf{X}$ is symbolized as $(\\mathbf{X})_{pq}$. Notation $\\mathrm{diag}(\\cdot)$ denotes a diagonal matrix, with the diagonal elements numerated in the bracket. For a positive integer $N$, we use $\\mathbb{N}$ to represent the set of positive integers no larger than $N$, i.e., $\\mathbb{N}=\\{1,...,N\\}$. Notation $\\mathcal{CN}(\\bm{\\mu},\\mathbf{C})$ stands for the distribution of a circularly symmetric complex Gaussian random vector with mean vector $\\bm{{\\mu}}$ and covariance matrix $\\mathbf{C}$. Subscripts $\\mathrm{R}$ and $\\mathrm{I}$ are used to indicate the real and imaginary parts of a complex number, respectively, e.g., $x=x_{\\mathrm{R}}+j x_{\\mathrm{I}}$, with $j$ being the imaginary unit. We further use $\\mathrm{sgn}(x)=\\frac{1}{\\sqrt{2}}[\\mathrm{sgn}(x_{\\mathrm{R}})+j\\mathrm{sgn}(x_{\\mathrm{I}})]$ to denote the sign function of a complex number $x$, and  $\\log(x)$ to denote the natural logarithm of a positive real number $x$.\n\n\\subsection{Outline}\nThe remaining part of this paper is organized as follows. Section \\ref{sect:model} describes the system model in the single-user scenario. For static SIMO-OFDM channels, Section \\ref{sect:single-user} derives a closed-form expression of the GMI and then optimizes the linear frequency-domain equalizer. Besides, properties of the GMI in several special cases are explored and the analytical results are further extended to ergodic time-varying SIMO-OFDM channels. Section \\ref{sect:multi-user} applies the theoretical framework to the multi-user scenario. A reduced-complexity algorithm is proposed in Section \\ref{sect:complexity} for efficiently designing the linear frequency-domain equalizer. Numerical results are presented in Section \\ref{sect:numerical} to corroborate the analysis. Finally, Section \\ref{sect:conclusion} concludes this paper. Auxiliary technical derivations are collected in the appendix.\n\n\n\\section{System model}\n\\label{sect:model}\nA single-antenna user communicates to an $N$-antenna BS through a frequency-selective SIMO channel, of which each branch consists of $T$ taps. We start by focusing on static channels and assuming perfect CSI at the BS. Particularly, OFDM is adopted to handle ISI. Each OFDM symbol is a $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_\\mathrm{s}\\mathbf{I}_{Q})$ distributed vector $\\tilde{\\mathbf{x}}$, with $\\mathcal{E}_s$ representing the energy per element of $\\tilde{\\mathbf{x}}$ and $Q$ denoting the number of subcarriers\\footnote{Due to the channel hardening effect of massive MIMO, power allocation over the subcarriers is supposed to be less beneficial.}. Before transmission, we apply an inverse discrete Fourier transform (IDFT) to $\\tilde{\\mathbf{x}}$ and obtain the actual channel input $\\mathbf{x}=\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}$. Here $\\mathbf{F}\\mathbf{F}^{\\dag}=\\mathbf{F}^{\\dag}\\mathbf{F}=\\mathbf{I}_{Q}$, and it is easy to verify that $\\mathbf{x}$ is also $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_\\mathrm{s}\\mathbf{I}_{Q})$ distributed.\n\nFor the branch related to the $n$-th BS antenna, we denote it by $\\mathbf{h}_n\\triangleq[h_{n1},...,h_{nT},0,...,0]^t\\in\\mathbb{C}^{Q\\times 1}$, and accordingly, its circulant matrix form by $\\mathbf{C}_n$ (with cyclic prefix removed). Note that $\\mathbf{C}_n$ can be decomposed as $\\mathbf{C}_n=\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n\\mathbf{F}$, with the diagonal matrix $\\bm{\\Lambda}_n\\triangleq\\mathrm{diag}(\\lambda_{n1},...,\\lambda_{nQ})$ given by\n\n", "index": 1, "text": "\\begin{equation}\n\\lambda_{nq}=\\big(\\sqrt{Q}\\mathbf{F}\\mathbf{h}_n\\big)_q,\\ \\ q\\in\\mathbb{Q}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{nq}=\\big{(}\\sqrt{Q}\\mathbf{F}\\mathbf{h}_{n}\\big{)}_{q},\\ \\ q\\in%&#10;\\mathbb{Q}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><msub><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mrow><msqrt><mi>Q</mi></msqrt><mo>⁢</mo><msub><mi>𝐅𝐡</mi><mi>n</mi></msub></mrow><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow><mi>q</mi></msub></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>q</mi><mo>∈</mo><mi>ℚ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\mathbf{y}_n\\triangleq[y_{n1},...,y_{nQ}]^t$, and $\\mathbf{z}_n\\sim\\mathcal{CN}(\\mathbf{0},\\sigma^2\\mathbf{I}_{Q})$ collects the independent and identically distributed (i.i.d.) noise. We define SNR as $\\mathrm{SNR}\\triangleq\\mathcal{E}_{\\mathrm{s}}/\\sigma^2$, and hereafter let $\\sigma^2=1$ for concision.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.9 \\textwidth]{Model.eps}\n  \\caption{Illustration of the mixed-ADC architecture for frequency-selective SIMO channels. We note that the ADC switch module can also be placed before the RF chains. In this manner, the RF chain followed by a pair of one-bit ADCs can be manufactured with lower quality requirements and consequently we can further reduce the power consumption and hardware cost \\cite{studer2015quantized}. On the other hand, switch at radio frequency may be more challenging and costly than at baseband. Which choice is favorable will be determined by practical engineering.}\n  \\label{fig:system model}\n\\end{figure}\nTo fulfill signal processing in the digital domain, $\\mathbf{y}_n$ is quantized by either a pair of high-resolution ADCs or a pair of one-bit ADCs; that is\n\n", "itemtype": "equation", "pos": 15023, "prevtext": "\nThe channel outputs at the $n$-th BS antenna over $Q$ channel uses can be collectively written as\n\n", "index": 3, "text": "\\begin{equation}\n\\mathbf{y}_n=\\mathbf{C}_n\\mathbf{x}+\\mathbf{z}_n,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{y}_{n}=\\mathbf{C}_{n}\\mathbf{x}+\\mathbf{z}_{n},\" display=\"block\"><mrow><mrow><msub><mi>𝐲</mi><mi>n</mi></msub><mo>=</mo><mrow><mrow><msub><mi>𝐂</mi><mi>n</mi></msub><mo>⁢</mo><mi>𝐱</mi></mrow><mo>+</mo><msub><mi>𝐳</mi><mi>n</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwith $\\mathbf{r}_n\\triangleq[r_{n1},...,r_{nQ}]^t$. Here we let $\\bar{\\delta}_n\\triangleq 1-\\delta_n\\in\\{0,1\\}$, and $\\delta_n=1$ means that the $n$-th antenna employs a pair of high-resolution ADCs, whereas $\\delta_n=0$ indicates that they are one-bit ADCs. We define an ADC switch vector $\\bm{\\delta}\\triangleq[\\delta_1,...,\\delta_N]^t$, which should be optimized according to the channel state to maximize the user's data rate.\n\nThen we employ a DFT to $\\mathbf{r}_n$. Due to the nonlinearity of one-bit quantization, ICI is introduced in the time-frequency conversion. To handle this, we propose a linear frequency-domain equalizer as illustrated in Figure \\ref{fig:system model}. Accordingly, the processed output is\n\n", "itemtype": "equation", "pos": 16258, "prevtext": "\nwhere $\\mathbf{y}_n\\triangleq[y_{n1},...,y_{nQ}]^t$, and $\\mathbf{z}_n\\sim\\mathcal{CN}(\\mathbf{0},\\sigma^2\\mathbf{I}_{Q})$ collects the independent and identically distributed (i.i.d.) noise. We define SNR as $\\mathrm{SNR}\\triangleq\\mathcal{E}_{\\mathrm{s}}/\\sigma^2$, and hereafter let $\\sigma^2=1$ for concision.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.9 \\textwidth]{Model.eps}\n  \\caption{Illustration of the mixed-ADC architecture for frequency-selective SIMO channels. We note that the ADC switch module can also be placed before the RF chains. In this manner, the RF chain followed by a pair of one-bit ADCs can be manufactured with lower quality requirements and consequently we can further reduce the power consumption and hardware cost \\cite{studer2015quantized}. On the other hand, switch at radio frequency may be more challenging and costly than at baseband. Which choice is favorable will be determined by practical engineering.}\n  \\label{fig:system model}\n\\end{figure}\nTo fulfill signal processing in the digital domain, $\\mathbf{y}_n$ is quantized by either a pair of high-resolution ADCs or a pair of one-bit ADCs; that is\n\n", "index": 5, "text": "\\begin{equation}\n\\mathbf{r}_n=\\delta_n\\mathbf{y}_n+\\bar{\\delta}_n\\mathrm{sgn}(\\mathbf{y}_n),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{r}_{n}=\\delta_{n}\\mathbf{y}_{n}+\\bar{\\delta}_{n}\\mathrm{sgn}(\\mathbf{y%&#10;}_{n}),\" display=\"block\"><mrow><mrow><msub><mi>𝐫</mi><mi>n</mi></msub><mo>=</mo><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⁢</mo><msub><mi>𝐲</mi><mi>n</mi></msub></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⁢</mo><mi>sgn</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐲</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\mathbf{W}_n\\triangleq\\mathrm{diag}(w_{n1},...,w_{nQ})$ is a $Q$-dimensional diagonal matrix\\footnote{In this paper, we restrict $\\mathbf{W}_n$ to diagonal matrix, and for the simplicity of analysis, the weight for each BS antenna is absorbed into $\\mathbf{W}_n$. In the following we may stack the diagonal elements of $\\mathbf{W}_n$ as a vector $\\mathbf{w}_n$, and accordingly define $\\mathbf{w}\\triangleq[\\mathbf{w}_1^t,...,\\mathbf{w}_N^t]^t$.} and should be optimized according to $\\{\\mathbf{h}_n\\}_{n=1}^N$ and $\\bm{\\delta}$ to maximize the user's achievable data rate.\n\nThe decoder adopts a generalized nearest-neighbor decoding rule; that is, upon observing $\\{\\hat{\\tilde{\\mathbf{x}}}[l]\\}_{l=1}^{L}$, it computes, for each possible input message $m$, the distance metric\n\n", "itemtype": "equation", "pos": 17088, "prevtext": "\nwith $\\mathbf{r}_n\\triangleq[r_{n1},...,r_{nQ}]^t$. Here we let $\\bar{\\delta}_n\\triangleq 1-\\delta_n\\in\\{0,1\\}$, and $\\delta_n=1$ means that the $n$-th antenna employs a pair of high-resolution ADCs, whereas $\\delta_n=0$ indicates that they are one-bit ADCs. We define an ADC switch vector $\\bm{\\delta}\\triangleq[\\delta_1,...,\\delta_N]^t$, which should be optimized according to the channel state to maximize the user's data rate.\n\nThen we employ a DFT to $\\mathbf{r}_n$. Due to the nonlinearity of one-bit quantization, ICI is introduced in the time-frequency conversion. To handle this, we propose a linear frequency-domain equalizer as illustrated in Figure \\ref{fig:system model}. Accordingly, the processed output is\n\n", "index": 7, "text": "\\begin{equation}\n\\hat{\\tilde{\\mathbf{x}}}=\\sum_{n=1}^N \\mathbf{W}_n\\mathbf{F}\\mathbf{r}_n,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\tilde{\\mathbf{x}}}=\\sum_{n=1}^{N}\\mathbf{W}_{n}\\mathbf{F}\\mathbf{r}_{n},\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>𝐖</mi><mi>n</mi></msub><mo>⁢</mo><msub><mi>𝐅𝐫</mi><mi>n</mi></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand determines $\\hat{m}$ as the one that minimizes $D(m)$. Here $\\mathcal{M}$ denotes the set of all the possible messages, $\\{\\tilde{\\mathbf{x}}[m,l]\\}_{l=1}^L$ denotes the codeword for message $m$, and $L$ is the codeword length measured in OFDM symbol. For tractability consideration, the scaling parameter for each subcarrier is designated an identical value $a$. Although this choice is generally suboptimal, we note that the resulting performance lose is supposed to be marginal, benefiting from the channel hardening effect of massive MIMO.\n\n\n\\section{Performance in the Single-User Scenario}\n\\label{sect:single-user}\nFor the mixed-ADC architecture, since there is no closed-form expression for the capacity, in this paper, we leverage GMI to evaluate its achievable data rates. GMI characterizes the achievable data rate of specific codebook ensemble (Gaussian ensemble here) and specific decoding rule (generalized nearest-neighbor decoding here), and usually leads to manageable analytical results. As a performance metric, it has proven convenient and useful in several important scenarios, such as fading channel with imperfect CSI at the receiver \\cite{lapidoth2002fading} and channels with transceiver distortion \\cite{liang2015mixed}-\\cite{liang2015a}, \\cite{zhang2012general}-\\cite{vehkapera2015asymptotic}.\n\n\\subsection{GMI and the Optimal Linear Frequency-Domain Equalizer}\nWe apply the analytical framework developed in \\cite{liang2015mixed} and \\cite{zhang2012general} to derive the GMI of the mixed-ADC architecture. Following essentially the same steps as \\cite[App. C]{zhang2012general}, we obtain an explicit expression of the GMI as follows.\n\n\\begin{prop}\n\\label{prop:prop_3}\nAssuming Gaussian codebook ensemble and generalized nearest-neighbor decoding, the GMI for given $\\mathbf{w}$ and $\\bm{\\delta}$ is\n\n", "itemtype": "equation", "pos": 17980, "prevtext": "\nwhere $\\mathbf{W}_n\\triangleq\\mathrm{diag}(w_{n1},...,w_{nQ})$ is a $Q$-dimensional diagonal matrix\\footnote{In this paper, we restrict $\\mathbf{W}_n$ to diagonal matrix, and for the simplicity of analysis, the weight for each BS antenna is absorbed into $\\mathbf{W}_n$. In the following we may stack the diagonal elements of $\\mathbf{W}_n$ as a vector $\\mathbf{w}_n$, and accordingly define $\\mathbf{w}\\triangleq[\\mathbf{w}_1^t,...,\\mathbf{w}_N^t]^t$.} and should be optimized according to $\\{\\mathbf{h}_n\\}_{n=1}^N$ and $\\bm{\\delta}$ to maximize the user's achievable data rate.\n\nThe decoder adopts a generalized nearest-neighbor decoding rule; that is, upon observing $\\{\\hat{\\tilde{\\mathbf{x}}}[l]\\}_{l=1}^{L}$, it computes, for each possible input message $m$, the distance metric\n\n", "index": 9, "text": "\\begin{equation}\nD(m)=\\frac{1}{L}\\sum_{l=1}^L\\|\\hat{\\tilde{\\mathbf{x}}}[l]-a\\tilde{\\mathbf{x}}[m,l]\\|^2,\\ \\ m\\in\\mathcal{M},\n\\label{equ:equ_14}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"D(m)=\\frac{1}{L}\\sum_{l=1}^{L}\\|\\hat{\\tilde{\\mathbf{x}}}[l]-a\\tilde{\\mathbf{x}%&#10;}[m,l]\\|^{2},\\ \\ m\\in\\mathcal{M},\" display=\"block\"><mrow><mrow><mrow><mrow><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>L</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>L</mi></munderover><msup><mrow><mo>∥</mo><mrow><mrow><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>l</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>-</mo><mrow><mi>a</mi><mo>⁢</mo><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>m</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>m</mi><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere the performance indicator $\\Delta(\\mathbf{w},\\bm{\\delta})$ is\n\n", "itemtype": "equation", "pos": 19971, "prevtext": "\nand determines $\\hat{m}$ as the one that minimizes $D(m)$. Here $\\mathcal{M}$ denotes the set of all the possible messages, $\\{\\tilde{\\mathbf{x}}[m,l]\\}_{l=1}^L$ denotes the codeword for message $m$, and $L$ is the codeword length measured in OFDM symbol. For tractability consideration, the scaling parameter for each subcarrier is designated an identical value $a$. Although this choice is generally suboptimal, we note that the resulting performance lose is supposed to be marginal, benefiting from the channel hardening effect of massive MIMO.\n\n\n\\section{Performance in the Single-User Scenario}\n\\label{sect:single-user}\nFor the mixed-ADC architecture, since there is no closed-form expression for the capacity, in this paper, we leverage GMI to evaluate its achievable data rates. GMI characterizes the achievable data rate of specific codebook ensemble (Gaussian ensemble here) and specific decoding rule (generalized nearest-neighbor decoding here), and usually leads to manageable analytical results. As a performance metric, it has proven convenient and useful in several important scenarios, such as fading channel with imperfect CSI at the receiver \\cite{lapidoth2002fading} and channels with transceiver distortion \\cite{liang2015mixed}-\\cite{liang2015a}, \\cite{zhang2012general}-\\cite{vehkapera2015asymptotic}.\n\n\\subsection{GMI and the Optimal Linear Frequency-Domain Equalizer}\nWe apply the analytical framework developed in \\cite{liang2015mixed} and \\cite{zhang2012general} to derive the GMI of the mixed-ADC architecture. Following essentially the same steps as \\cite[App. C]{zhang2012general}, we obtain an explicit expression of the GMI as follows.\n\n\\begin{prop}\n\\label{prop:prop_3}\nAssuming Gaussian codebook ensemble and generalized nearest-neighbor decoding, the GMI for given $\\mathbf{w}$ and $\\bm{\\delta}$ is\n\n", "index": 11, "text": "\\begin{equation}\nI_{\\mathrm{GMI}}(\\mathbf{w},\\bm{\\delta})=\\log\\left(1+\\frac{\\Delta(\\mathbf{w},\\bm{\\delta})}{1-\\Delta(\\mathbf{w},\\bm{\\delta})}\\right),\n\\label{equ:equ_16}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"I_{\\mathrm{GMI}}(\\mathbf{w},\\bm{\\delta})=\\log\\left(1+\\frac{\\Delta(\\mathbf{w},%&#10;\\bm{\\delta})}{1-\\Delta(\\mathbf{w},\\bm{\\delta})}\\right),\" display=\"block\"><mrow><mrow><mrow><msub><mi>I</mi><mi>GMI</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThe corresponding optimal scaling parameter is\n\n", "itemtype": "equation", "pos": 20223, "prevtext": "\nwhere the performance indicator $\\Delta(\\mathbf{w},\\bm{\\delta})$ is\n\n", "index": 13, "text": "\\begin{equation}\n\\Delta(\\mathbf{w},\\bm{\\delta})=\\frac{|\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]|^2}\n{Q\\mathcal{E}_s\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]}.\n\\label{equ:equ_17}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w},\\bm{\\delta})=\\frac{|\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{{%&#10;\\dagger}}\\tilde{\\mathbf{x}}]|^{2}}{Q\\mathcal{E}_{s}\\mathbb{E}[\\hat{\\tilde{%&#10;\\mathbf{x}}}^{{\\dagger}}\\hat{\\tilde{\\mathbf{x}}}]}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>s</mi></msub><mo>⁢</mo><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nWe note that here the expectation operation $\\mathbb{E}[\\cdot]$ is taken with respect to $\\tilde{\\mathbf{x}}$ and $\\mathbf{z}_n,n\\in\\mathbb{N}$.\n\\end{prop}\n\nWe notice that $\\Delta(\\mathbf{w},\\bm{\\delta})$ is lower bounded by zero, and that from Cauchy-Schwartz's inequality, it is upper bounded by one. Moreover, $I_{\\mathrm{GMI}}(\\mathbf{w},\\bm{\\delta})$ is a strictly increasing function of $\\Delta(\\mathbf{w},\\bm{\\delta})$ for $\\Delta(\\mathbf{w},\\bm{\\delta})\\in[0,1)$, and thus in the following, we only need to maximize $\\Delta(\\mathbf{w},\\bm{\\delta})$ by optimizing the design of $\\mathbf{w}$ and $\\bm{\\delta}$. The optimal linear frequency-domain equalizer is given by the proposition below.\n\n\\begin{prop}\n\\label{prop:prop_1}\nFor given $\\{\\mathbf{h}_n\\}_{n=1}^N$ and $\\bm{\\delta}$, the optimal linear frequency-domain equalizer $\\mathbf{w}_{\\mathrm{opt}}$ is\n\n", "itemtype": "equation", "pos": 20510, "prevtext": "\nThe corresponding optimal scaling parameter is\n\n", "index": 15, "text": "\\begin{equation}\na_{\\mathrm{opt}}(\\mathbf{w},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}\\mathbb{E}[\\tilde{\\mathbf{x}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}].\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"a_{\\mathrm{opt}}(\\mathbf{w},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}%&#10;\\mathbb{E}[\\tilde{\\mathbf{x}}^{{\\dagger}}\\hat{\\tilde{\\mathbf{x}}}].\" display=\"block\"><mrow><mrow><mrow><msub><mi>a</mi><mi>opt</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac><mo>⁢</mo><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nAccordingly, the maximized $\\Delta(\\mathbf{w},\\bm{\\delta})$ and the optimal choice of $a_{\\mathrm{opt}}(\\mathbf{w},\\bm{\\delta})$ are given by\n\n", "itemtype": "equation", "pos": 21546, "prevtext": "\nWe note that here the expectation operation $\\mathbb{E}[\\cdot]$ is taken with respect to $\\tilde{\\mathbf{x}}$ and $\\mathbf{z}_n,n\\in\\mathbb{N}$.\n\\end{prop}\n\nWe notice that $\\Delta(\\mathbf{w},\\bm{\\delta})$ is lower bounded by zero, and that from Cauchy-Schwartz's inequality, it is upper bounded by one. Moreover, $I_{\\mathrm{GMI}}(\\mathbf{w},\\bm{\\delta})$ is a strictly increasing function of $\\Delta(\\mathbf{w},\\bm{\\delta})$ for $\\Delta(\\mathbf{w},\\bm{\\delta})\\in[0,1)$, and thus in the following, we only need to maximize $\\Delta(\\mathbf{w},\\bm{\\delta})$ by optimizing the design of $\\mathbf{w}$ and $\\bm{\\delta}$. The optimal linear frequency-domain equalizer is given by the proposition below.\n\n\\begin{prop}\n\\label{prop:prop_1}\nFor given $\\{\\mathbf{h}_n\\}_{n=1}^N$ and $\\bm{\\delta}$, the optimal linear frequency-domain equalizer $\\mathbf{w}_{\\mathrm{opt}}$ is\n\n", "index": 17, "text": "\\begin{equation}\n\\mathbf{w}_{\\mathrm{opt}}=\\mathbf{D}^{-1}\\mathbf{g}.\n\\label{equ:prop_1.1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{w}_{\\mathrm{opt}}=\\mathbf{D}^{-1}\\mathbf{g}.\" display=\"block\"><mrow><mrow><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>=</mo><mrow><msup><mi>𝐃</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝐠</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nIn both equations, $\\mathbf{g}\\triangleq[\\mathbf{g}_1^t,...,\\mathbf{g}_N^t]^t\\in\\mathbb{C}^{NQ\\times 1}$ and the $n$-th segment $\\mathbf{g}_n$ is\n\n", "itemtype": "equation", "pos": 21794, "prevtext": "\nAccordingly, the maximized $\\Delta(\\mathbf{w},\\bm{\\delta})$ and the optimal choice of $a_{\\mathrm{opt}}(\\mathbf{w},\\bm{\\delta})$ are given by\n\n", "index": 19, "text": "\\begin{equation}\n\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=a_{\\mathrm{opt}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}\\mathbf{g}^{\\dag}\\mathbf{D}^{-1}\\mathbf{g}.\n\\label{equ:prop_1.2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=a_{\\mathrm{opt}}(\\mathbf{w}_{%&#10;\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}\\mathbf{g}^{{%&#10;\\dagger}}\\mathbf{D}^{-1}\\mathbf{g}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>a</mi><mi>opt</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac><mo>⁢</mo><msup><mi>𝐠</mi><mo>†</mo></msup><mo>⁢</mo><msup><mi>𝐃</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝐠</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\bm{\\lambda}_n\\triangleq[\\lambda_{n1},...,\\lambda_{nQ}]^t$ is made up of $\\bm{\\Lambda}_n$'s diagonal elements. $\\mathbf{D}\\in\\mathbb{C}^{NQ\\times NQ}$ is a block matrix\n\n", "itemtype": "equation", "pos": 22174, "prevtext": "\nIn both equations, $\\mathbf{g}\\triangleq[\\mathbf{g}_1^t,...,\\mathbf{g}_N^t]^t\\in\\mathbb{C}^{NQ\\times 1}$ and the $n$-th segment $\\mathbf{g}_n$ is\n\n", "index": 21, "text": "\\begin{equation}\n\\mathbf{g}_n=\\delta_n\\cdot\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}_n^*+\\bar{\\delta}_n\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\bm{\\lambda}_n^*}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_n\\|^2/Q}},\n\\label{equ:prop_1.3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{g}_{n}=\\delta_{n}\\cdot\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}_{n}^{*}+%&#10;\\bar{\\delta}_{n}\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\bm{%&#10;\\lambda}_{n}^{*}}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_{n}\\|^{2}/Q}},\" display=\"block\"><mrow><mrow><msub><mi>𝐠</mi><mi>n</mi></msub><mo>=</mo><mrow><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⋅</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><mo>+</mo><mrow><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt></mrow><mo>⁢</mo><mfrac><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></msqrt></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nin which each block $\\mathbf{D}_{nm}$ is a $Q$-dimensional diagonal matrix defined as\n\n", "itemtype": "equation", "pos": 22616, "prevtext": "\nwhere $\\bm{\\lambda}_n\\triangleq[\\lambda_{n1},...,\\lambda_{nQ}]^t$ is made up of $\\bm{\\Lambda}_n$'s diagonal elements. $\\mathbf{D}\\in\\mathbb{C}^{NQ\\times NQ}$ is a block matrix\n\n", "index": 23, "text": "\\begin{equation}\n\\mathbf{D}\\triangleq\n\\begin{pmatrix}\n    \\mathbf{D}_{11} & \\mathbf{D}_{21} & \\cdots & \\mathbf{D}_{N1} \\\\\n    \\mathbf{D}_{12} & \\mathbf{D}_{22} & \\cdots & \\mathbf{D}_{N2} \\\\\n    \\vdots  & \\vdots  & \\ddots & \\vdots  \\\\\n    \\mathbf{D}_{1N} & \\mathbf{D}_{2N} & \\cdots & \\mathbf{D}_{NN}\n\\end{pmatrix},\n\\label{equ:prop_1.4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{D}\\triangleq\\begin{pmatrix}\\mathbf{D}_{11}&amp;\\mathbf{D}_{21}&amp;\\cdots&amp;%&#10;\\mathbf{D}_{N1}\\\\&#10;\\mathbf{D}_{12}&amp;\\mathbf{D}_{22}&amp;\\cdots&amp;\\mathbf{D}_{N2}\\\\&#10;\\vdots&amp;\\vdots&amp;\\ddots&amp;\\vdots\\\\&#10;\\mathbf{D}_{1N}&amp;\\mathbf{D}_{2N}&amp;\\cdots&amp;\\mathbf{D}_{NN}\\end{pmatrix},\" display=\"block\"><mrow><mrow><mi>𝐃</mi><mo>≜</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mn>11</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mn>21</mn></msub></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mn>1</mn></mrow></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mn>12</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mn>22</mn></msub></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mn>2</mn></mrow></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋱</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mrow><mn>1</mn><mo>⁢</mo><mi>N</mi></mrow></msub></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi></mrow></msub></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msub><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mi>N</mi></mrow></msub></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwith $\\mathbf{R}_{nm}\\triangleq\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]$ being the correlation matrix between $\\mathbf{r}_n$ and $\\mathbf{r}_m$.\n\\end{prop}\n\\begin{proof}\nSee Appendix-A.\n\\end{proof}\n\n\\subsection{Two Corollaries from Proposition \\ref{prop:prop_1}}\nIn the previous subsection, we derived the optimal linear frequency-domain equalizer. Now we are ready to examine the performance of the mixed-ADC architecture. When $\\bm{\\delta}=\\mathbf{1}$, i.e., all the BS antennas are equipped with high-resolution ADCs, the next corollary gives a comparison between the GMI and the channel capacity.\n\\begin{cor}\n\\label{cor:cor_1}\nWhen $\\bm{\\delta}=\\mathbf{1}$, $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ yields a simplified expression as\n\n", "itemtype": "equation", "pos": 23052, "prevtext": "\nin which each block $\\mathbf{D}_{nm}$ is a $Q$-dimensional diagonal matrix defined as\n\n", "index": 25, "text": "\\begin{equation}\n(\\mathbf{D}_{nm})_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag})_{qq},\\ q\\in\\mathbb{Q},\n\\label{equ:prop_1.5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{D}_{nm})_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{{\\dagger}})_{qq},%&#10;\\ q\\in\\mathbb{Q},\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐃</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐅𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mrow><mo rspace=\"7.5pt\">,</mo><mrow><mi>q</mi><mo>∈</mo><mi>ℚ</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nOn the other hand, the channel capacity (MRC over the $N$ antennas at each subcarrier) is given by\n\n", "itemtype": "equation", "pos": 23953, "prevtext": "\nwith $\\mathbf{R}_{nm}\\triangleq\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]$ being the correlation matrix between $\\mathbf{r}_n$ and $\\mathbf{r}_m$.\n\\end{prop}\n\\begin{proof}\nSee Appendix-A.\n\\end{proof}\n\n\\subsection{Two Corollaries from Proposition \\ref{prop:prop_1}}\nIn the previous subsection, we derived the optimal linear frequency-domain equalizer. Now we are ready to examine the performance of the mixed-ADC architecture. When $\\bm{\\delta}=\\mathbf{1}$, i.e., all the BS antennas are equipped with high-resolution ADCs, the next corollary gives a comparison between the GMI and the channel capacity.\n\\begin{cor}\n\\label{cor:cor_1}\nWhen $\\bm{\\delta}=\\mathbf{1}$, $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ yields a simplified expression as\n\n", "index": 27, "text": "\\begin{equation}\nI_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=-\\log\\left(\\frac{1}{Q}\\sum_{q=1}^Q\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^N|\\lambda_{nq}|^2}\\right).\n\\label{equ:equ_7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=-\\log\\left(\\frac{1}{Q}%&#10;\\sum_{q=1}^{Q}\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{nq}|^%&#10;{2}}\\right).\" display=\"block\"><mrow><mrow><mrow><msub><mi>I</mi><mi>GMI</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mfrac><mn>1</mn><mi>Q</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>q</mi><mo>=</mo><mn>1</mn></mrow><mi>Q</mi></munderover><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\\end{cor}\n\nThe proof is given in Appendix-B. Since $-\\log(x)$ is a convex function of positive real number $x$, $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})\\leq C$ holds even when $\\bm{\\delta}=\\mathbf{1}$. We note that this rate loss is due to the identical choice of the scaling parameter $a_{\\mathrm{opt}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ over all the subcarriers in the decoding metric \\eqref{equ:equ_14}, and that benefiting from the channel hardening effect of massive MIMO, the performance loss is supposed to be marginal, as will be verified by the numerical study in Section \\ref{sect:numerical}.\n\nThe next corollary draws some connection between the frequency-flat channel scenario investigated in \\cite{liang2015mixed} and the frequency-selective channel scenario addressed in this paper.\n\\begin{cor}\n\\label{cor:cor_2}\nWhen $T=1$, the analytical results in Proposition 2 reduce to those for frequency-flat channels obtained in \\cite{liang2015mixed}.\n\n\\end{cor}\n\nSee Appendix-C for its proof. The impact of frequency diversity on the system performance will be revealed by a body of numerical studies in Section \\ref{sect:numerical}.\n\n\\subsection{Asymptotic Behavior of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in Low or High SNR Regime}\nIn the following, we first examine the asymptotic behavior of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the low SNR regime, and then for the special case of $\\bm{\\delta}=\\mathbf{0}$, explore the limit of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime.\n\\begin{cor}\n\\label{cor:cor_3}\nAs $\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0$, for a given ADC switch vector $\\bm{\\delta}$ we have\n\n", "itemtype": "equation", "pos": 24265, "prevtext": "\nOn the other hand, the channel capacity (MRC over the $N$ antennas at each subcarrier) is given by\n\n", "index": 29, "text": "\\begin{equation}\nC=-\\frac{1}{Q}\\sum_{q=1}^Q\\log\\left(\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^N|\\lambda_{nq}|^2}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"C=-\\frac{1}{Q}\\sum_{q=1}^{Q}\\log\\left(\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_%&#10;{n=1}^{N}|\\lambda_{nq}|^{2}}\\right).\" display=\"block\"><mrow><mrow><mi>C</mi><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mi>Q</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>q</mi><mo>=</mo><mn>1</mn></mrow><mi>Q</mi></munderover><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand on the other hand, the channel capacity for $\\bm{\\delta}=\\mathbf{1}$ approaches\n\n", "itemtype": "equation", "pos": 26120, "prevtext": "\n\\end{cor}\n\nThe proof is given in Appendix-B. Since $-\\log(x)$ is a convex function of positive real number $x$, $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})\\leq C$ holds even when $\\bm{\\delta}=\\mathbf{1}$. We note that this rate loss is due to the identical choice of the scaling parameter $a_{\\mathrm{opt}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ over all the subcarriers in the decoding metric \\eqref{equ:equ_14}, and that benefiting from the channel hardening effect of massive MIMO, the performance loss is supposed to be marginal, as will be verified by the numerical study in Section \\ref{sect:numerical}.\n\nThe next corollary draws some connection between the frequency-flat channel scenario investigated in \\cite{liang2015mixed} and the frequency-selective channel scenario addressed in this paper.\n\\begin{cor}\n\\label{cor:cor_2}\nWhen $T=1$, the analytical results in Proposition 2 reduce to those for frequency-flat channels obtained in \\cite{liang2015mixed}.\n\n\\end{cor}\n\nSee Appendix-C for its proof. The impact of frequency diversity on the system performance will be revealed by a body of numerical studies in Section \\ref{sect:numerical}.\n\n\\subsection{Asymptotic Behavior of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in Low or High SNR Regime}\nIn the following, we first examine the asymptotic behavior of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the low SNR regime, and then for the special case of $\\bm{\\delta}=\\mathbf{0}$, explore the limit of $I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime.\n\\begin{cor}\n\\label{cor:cor_3}\nAs $\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0$, for a given ADC switch vector $\\bm{\\delta}$ we have\n\n", "index": 31, "text": "\\begin{equation}\nI_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q}\\sum_{n=1}^N\\left(\\delta_n+\\bar{\\delta}_n\\cdot\\frac{2}{\\pi}\\right)\\|\\bm{\\lambda}_n\\|^2\\mathcal{E}_{\\mathrm{s}}+o(\\mathcal{E}_{\\mathrm{s}}),\n\\label{equ:equ_12}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"I_{\\mathrm{GMI}}(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q}\\sum_{n=1}^%&#10;{N}\\left(\\delta_{n}+\\bar{\\delta}_{n}\\cdot\\frac{2}{\\pi}\\right)\\|\\bm{\\lambda}_{n%&#10;}\\|^{2}\\mathcal{E}_{\\mathrm{s}}+o(\\mathcal{E}_{\\mathrm{s}}),\" display=\"block\"><mrow><mrow><mrow><msub><mi>I</mi><mi>GMI</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mi>Q</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mrow><mo>(</mo><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><mfrac><mn>2</mn><mi>π</mi></mfrac></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow></mrow><mo>+</mo><mrow><mi>o</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\\end{cor}\n\nThe proof is given in Appendix-D. Comparing \\eqref{equ:equ_12} and \\eqref{equ:equ_18}, we can make two observations. First, due to one-bit quantization, part of the achievable data rate is degraded by a factor $\\frac{2}{\\pi}$. Second, to achieve the maximum data rate, high-resolution ADCs should be switched to the antennas with the maximum $\\|\\bm{\\lambda}_n\\|^2$ or $\\|\\mathbf{h}_n\\|^2$, equivalently.\n\nFor a general $\\bm{\\delta}$, $\\mathbf{D}^{-1}$ in the high SNR regime is still too complicated to yield any simplification. In light of this, we derive the limit of $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime for the special case of $\\bm{\\delta}=\\mathbf{0}$. The subsequent corollary gives our result.\n\\begin{cor}\n\\label{cor:cor_4}\nFor the special case of $\\bm{\\delta}=\\mathbf{0}$, $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime is guarded by the following limit\n\n", "itemtype": "equation", "pos": 26462, "prevtext": "\nand on the other hand, the channel capacity for $\\bm{\\delta}=\\mathbf{1}$ approaches\n\n", "index": 33, "text": "\\begin{equation}\nC=\\frac{1}{Q}\\sum_{n=1}^N\\|\\bm{\\lambda}_n\\|^2\\mathcal{E}_{\\mathrm{s}}+o(\\mathcal{E}_{\\mathrm{s}}).\n\\label{equ:equ_18}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"C=\\frac{1}{Q}\\sum_{n=1}^{N}\\|\\bm{\\lambda}_{n}\\|^{2}\\mathcal{E}_{\\mathrm{s}}+o(%&#10;\\mathcal{E}_{\\mathrm{s}}).\" display=\"block\"><mrow><mrow><mi>C</mi><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mi>Q</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow></mrow><mo>+</mo><mrow><mi>o</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\bar{\\bm{\\lambda}}\\triangleq[\\bm{\\lambda}_1^t/\\|\\bm{\\lambda}_1\\|,...,\\bm{\\lambda}_N^t/\\|\\bm{\\lambda}_N\\|]^t$, and $\\bar{\\mathbf{D}}\\triangleq\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D}$ is explained in the proof.\n\\end{cor}\n\nThe proof is given in Appendix-E. Since both $\\bar{\\bm{\\lambda}}$ and $\\bar{\\mathbf{D}}$ are irrelevant to $\\mathcal{E}_{\\mathrm{s}}$, \\eqref{equ:equ_19} implies that, if all the BS antennas are equipped with one-bit ADCs, the effective SNR $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})/(1-\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta}))$ will ultimately approach a positive constant, as $\\mathcal{E}_{\\mathrm{s}}$ grows large. On the other hand, even if there are only one pair of high-resolution ADCs available at the BS, the effective SNR will always increase unboundedly with increasing $\\mathcal{E}_{\\mathrm{s}}$. From this perspective, the contribution of antennas equipped with one-bit ADCs may be negligible in the high-SNR regime, and this in turn suggests us to switch the high-resolution ADCs to the antennas with the maximum $\\|\\bm{\\lambda}_n\\|^2$ or $\\|\\mathbf{h}_n\\|^2$, equivalently.\n\n\\subsection{Extension to Ergodic Time-Varying Channels}\n\\label{subsect:ergodic_single}\nApplying a similar argument as \\cite[Prop. 4]{liang2015mixed}, we extend the analytical results in Section III-A to ergodic time-varying channels and obtain lower and upper bounds of the GMI. Numerical results will be given in Section \\ref{sect:numerical} to confirm the tightness of the bounds.\n\\begin{prop}\nFor ergodic time-varying SIMO-OFDM channels, the lower and upper bounds of $I_{\\mathrm{GMI}}$ follow from\n\\begin{eqnarray}\nI_{\\mathrm{GMI}}^{\\mathrm{lower}}&=&\\log\\left(1+\\frac{\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})]}{1-\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})]}\\right),\\\\\nI_{\\mathrm{GMI}}^{\\mathrm{upper}}&=&\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}\\left[\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}\\right)\\right],\n\\end{eqnarray}\nrespectively. Here $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ is also given by \\eqref{equ:prop_1.2}, for each sample of the ergodic time-varying channel.\n\\end{prop}\n\n\\section{Multi-user scenario}\n\\label{sect:multi-user}\n\\subsection{System Description}\nA total of $U$ users communicate to the BS simultaneously. Again we start by focusing on the static channels with perfect CSI at the BS. The $u$-th user's OFDM symbol is $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_{\\mathrm{s}}\\mathbf{I}_Q)$ distributed and is denoted by $\\tilde{\\mathbf{x}}^u$. Before transmission, an IDFT is applied to $\\tilde{\\mathbf{x}}^u$ and the actual transmit symbol of user $u$ is $\\mathbf{x}^u=\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}^u$, which is also $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_{\\mathrm{s}}\\mathbf{I}_Q)$ distributed. We further assume that the OFDM symbols from different users are independently distributed, since typically the users do not cooperate with each other.\n\nRegarding user $u$, we denote its multipath channel associated with the $n$-th BS antenna by $\\mathbf{h}_n^u\\triangleq[h_{n1}^u,...,h_{nT^u}^u,0,...,0]^t\\in\\mathbb{C}^{Q\\times 1}$ and further its circulant matrix form by $\\mathbf{C}_n^u$. Then, $\\mathbf{C}_n^u$ can be decomposed as $\\mathbf{C}_n^u=\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n^u\\mathbf{F}$, with the eigenvalue matrix $\\bm{\\Lambda}_n^u\\triangleq\\mathrm{diag}(\\lambda_{n1}^u,...,\\lambda_{nQ}^u)$ given by\n\n", "itemtype": "equation", "pos": 27542, "prevtext": "\n\\end{cor}\n\nThe proof is given in Appendix-D. Comparing \\eqref{equ:equ_12} and \\eqref{equ:equ_18}, we can make two observations. First, due to one-bit quantization, part of the achievable data rate is degraded by a factor $\\frac{2}{\\pi}$. Second, to achieve the maximum data rate, high-resolution ADCs should be switched to the antennas with the maximum $\\|\\bm{\\lambda}_n\\|^2$ or $\\|\\mathbf{h}_n\\|^2$, equivalently.\n\nFor a general $\\bm{\\delta}$, $\\mathbf{D}^{-1}$ in the high SNR regime is still too complicated to yield any simplification. In light of this, we derive the limit of $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime for the special case of $\\bm{\\delta}=\\mathbf{0}$. The subsequent corollary gives our result.\n\\begin{cor}\n\\label{cor:cor_4}\nFor the special case of $\\bm{\\delta}=\\mathbf{0}$, $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in the high SNR regime is guarded by the following limit\n\n", "index": 35, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{2}{\\pi}\\bar{\\bm{\\lambda}}^t\\bar{\\mathbf{D}}^{-1}\\bar{\\bm{\\lambda}}^*,\n\\label{equ:equ_19}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\Delta(\\mathbf{w}_{\\mathrm{opt%&#10;}},\\bm{\\delta})=\\frac{2}{\\pi}\\bar{\\bm{\\lambda}}^{t}\\bar{\\mathbf{D}}^{-1}\\bar{%&#10;\\bm{\\lambda}}^{*},\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝝀</mi><mo stretchy=\"false\">¯</mo></mover><mi>t</mi></msup><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝐃</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝝀</mi><mo stretchy=\"false\">¯</mo></mover><mo>*</mo></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nNote that we allow $T^u$ to be different for different users since they may be located in various environments. Besides, it is perhaps worth noting that typically $Q\\gg\\max_{u=1,...,U} T^u$, to keep the overhead of cyclic prefix relatively low.\n\nWe make the ideal assumption that all the users are perfectly synchronized. Then, the received OFDM symbol at the $n$-th BS antenna, with user $u$ considered, is\n\n", "itemtype": "equation", "pos": 31311, "prevtext": "\nwhere $\\bar{\\bm{\\lambda}}\\triangleq[\\bm{\\lambda}_1^t/\\|\\bm{\\lambda}_1\\|,...,\\bm{\\lambda}_N^t/\\|\\bm{\\lambda}_N\\|]^t$, and $\\bar{\\mathbf{D}}\\triangleq\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D}$ is explained in the proof.\n\\end{cor}\n\nThe proof is given in Appendix-E. Since both $\\bar{\\bm{\\lambda}}$ and $\\bar{\\mathbf{D}}$ are irrelevant to $\\mathcal{E}_{\\mathrm{s}}$, \\eqref{equ:equ_19} implies that, if all the BS antennas are equipped with one-bit ADCs, the effective SNR $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})/(1-\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta}))$ will ultimately approach a positive constant, as $\\mathcal{E}_{\\mathrm{s}}$ grows large. On the other hand, even if there are only one pair of high-resolution ADCs available at the BS, the effective SNR will always increase unboundedly with increasing $\\mathcal{E}_{\\mathrm{s}}$. From this perspective, the contribution of antennas equipped with one-bit ADCs may be negligible in the high-SNR regime, and this in turn suggests us to switch the high-resolution ADCs to the antennas with the maximum $\\|\\bm{\\lambda}_n\\|^2$ or $\\|\\mathbf{h}_n\\|^2$, equivalently.\n\n\\subsection{Extension to Ergodic Time-Varying Channels}\n\\label{subsect:ergodic_single}\nApplying a similar argument as \\cite[Prop. 4]{liang2015mixed}, we extend the analytical results in Section III-A to ergodic time-varying channels and obtain lower and upper bounds of the GMI. Numerical results will be given in Section \\ref{sect:numerical} to confirm the tightness of the bounds.\n\\begin{prop}\nFor ergodic time-varying SIMO-OFDM channels, the lower and upper bounds of $I_{\\mathrm{GMI}}$ follow from\n\\begin{eqnarray}\nI_{\\mathrm{GMI}}^{\\mathrm{lower}}&=&\\log\\left(1+\\frac{\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})]}{1-\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})]}\\right),\\\\\nI_{\\mathrm{GMI}}^{\\mathrm{upper}}&=&\\mathbb{E}_{\\mathbf{h}_n,n\\in\\mathbb{N}}\\left[\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}\\right)\\right],\n\\end{eqnarray}\nrespectively. Here $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ is also given by \\eqref{equ:prop_1.2}, for each sample of the ergodic time-varying channel.\n\\end{prop}\n\n\\section{Multi-user scenario}\n\\label{sect:multi-user}\n\\subsection{System Description}\nA total of $U$ users communicate to the BS simultaneously. Again we start by focusing on the static channels with perfect CSI at the BS. The $u$-th user's OFDM symbol is $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_{\\mathrm{s}}\\mathbf{I}_Q)$ distributed and is denoted by $\\tilde{\\mathbf{x}}^u$. Before transmission, an IDFT is applied to $\\tilde{\\mathbf{x}}^u$ and the actual transmit symbol of user $u$ is $\\mathbf{x}^u=\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}^u$, which is also $\\mathcal{CN}(\\mathbf{0},\\mathcal{E}_{\\mathrm{s}}\\mathbf{I}_Q)$ distributed. We further assume that the OFDM symbols from different users are independently distributed, since typically the users do not cooperate with each other.\n\nRegarding user $u$, we denote its multipath channel associated with the $n$-th BS antenna by $\\mathbf{h}_n^u\\triangleq[h_{n1}^u,...,h_{nT^u}^u,0,...,0]^t\\in\\mathbb{C}^{Q\\times 1}$ and further its circulant matrix form by $\\mathbf{C}_n^u$. Then, $\\mathbf{C}_n^u$ can be decomposed as $\\mathbf{C}_n^u=\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n^u\\mathbf{F}$, with the eigenvalue matrix $\\bm{\\Lambda}_n^u\\triangleq\\mathrm{diag}(\\lambda_{n1}^u,...,\\lambda_{nQ}^u)$ given by\n\n", "index": 37, "text": "\\begin{equation}\n\\lambda_{nq}^u=\\big(\\sqrt{Q}\\mathbf{F}\\mathbf{h}_n^u\\big)_q,\\ \\ q\\in\\mathbb{Q}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{nq}^{u}=\\big{(}\\sqrt{Q}\\mathbf{F}\\mathbf{h}_{n}^{u}\\big{)}_{q},\\ \\ q%&#10;\\in\\mathbb{Q}.\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow><mi>u</mi></msubsup><mo>=</mo><msub><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mrow><msqrt><mi>Q</mi></msqrt><mo>⁢</mo><msubsup><mi>𝐅𝐡</mi><mi>n</mi><mi>u</mi></msubsup></mrow><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow><mi>q</mi></msub></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>q</mi><mo>∈</mo><mi>ℚ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\sum_{v\\neq u}\\mathbf{C}_n^v\\mathbf{x}^v+\\mathbf{z}_n\n\\sim\\mathcal{CN}(\\mathbf{0},\\sigma^2\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\sum_{v\\neq u}\\mathbf{C}_n^v(\\mathbf{C}_n^{v})^{\\dag})$ summarizes the co-channel interference and Gaussian noise experienced by user $u$. Noticing that $\\mathbf{y}_n^u$ is actually identical for any $u\\in\\mathbb{U}$, here the superscript $u$ is simply for distinction with the single-user scenario. The SNR is defined as $\\mathrm{SNR}\\triangleq \\mathcal{E}_{\\mathrm{s}}/\\sigma^2$, and without loss of generality, hereafter we let $\\sigma^2=1$. $\\mathbf{y}_n^u$ is then quantized by either a pair of high-resolution ADCs or a pair of one-bit ADCs, obtaining the quantized output\n\n", "itemtype": "equation", "pos": 31831, "prevtext": "\nNote that we allow $T^u$ to be different for different users since they may be located in various environments. Besides, it is perhaps worth noting that typically $Q\\gg\\max_{u=1,...,U} T^u$, to keep the overhead of cyclic prefix relatively low.\n\nWe make the ideal assumption that all the users are perfectly synchronized. Then, the received OFDM symbol at the $n$-th BS antenna, with user $u$ considered, is\n\n", "index": 39, "text": "\\begin{equation}\n\\mathbf{y}_n^u=\\mathbf{C}_n^u\\mathbf{x}^u+\\sum_{v\\neq u}\\mathbf{C}_n^v\\mathbf{x}^v+\\mathbf{z}_n,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{y}_{n}^{u}=\\mathbf{C}_{n}^{u}\\mathbf{x}^{u}+\\sum_{v\\neq u}\\mathbf{C}_{%&#10;n}^{v}\\mathbf{x}^{v}+\\mathbf{z}_{n},\" display=\"block\"><mrow><mrow><msubsup><mi>𝐲</mi><mi>n</mi><mi>u</mi></msubsup><mo>=</mo><mrow><mrow><msubsup><mi>𝐂</mi><mi>n</mi><mi>u</mi></msubsup><mo>⁢</mo><msup><mi>𝐱</mi><mi>u</mi></msup></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>≠</mo><mi>u</mi></mrow></munder><mrow><msubsup><mi>𝐂</mi><mi>n</mi><mi>v</mi></msubsup><mo>⁢</mo><msup><mi>𝐱</mi><mi>v</mi></msup></mrow></mrow><mo>+</mo><msub><mi>𝐳</mi><mi>n</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nWe assume that there are still $K$ pairs of high-resolution ADCs available at the BS.\n\nThe quantized output $\\mathbf{r}_n^u$ is then transformed to the frequency domain and later processed by user-specific frequency-domain equalization, leading to\n\n", "itemtype": "equation", "pos": 32673, "prevtext": "\nwhere $\\sum_{v\\neq u}\\mathbf{C}_n^v\\mathbf{x}^v+\\mathbf{z}_n\n\\sim\\mathcal{CN}(\\mathbf{0},\\sigma^2\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\sum_{v\\neq u}\\mathbf{C}_n^v(\\mathbf{C}_n^{v})^{\\dag})$ summarizes the co-channel interference and Gaussian noise experienced by user $u$. Noticing that $\\mathbf{y}_n^u$ is actually identical for any $u\\in\\mathbb{U}$, here the superscript $u$ is simply for distinction with the single-user scenario. The SNR is defined as $\\mathrm{SNR}\\triangleq \\mathcal{E}_{\\mathrm{s}}/\\sigma^2$, and without loss of generality, hereafter we let $\\sigma^2=1$. $\\mathbf{y}_n^u$ is then quantized by either a pair of high-resolution ADCs or a pair of one-bit ADCs, obtaining the quantized output\n\n", "index": 41, "text": "\\begin{equation}\n\\mathbf{r}_n^u=\\delta_n\\mathbf{y}_n^u+\\bar{\\delta}_n\\mathrm{sgn}(\\mathbf{y}_n^u).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{r}_{n}^{u}=\\delta_{n}\\mathbf{y}_{n}^{u}+\\bar{\\delta}_{n}\\mathrm{sgn}(%&#10;\\mathbf{y}_{n}^{u}).\" display=\"block\"><mrow><mrow><msubsup><mi>𝐫</mi><mi>n</mi><mi>u</mi></msubsup><mo>=</mo><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝐲</mi><mi>n</mi><mi>u</mi></msubsup></mrow><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⁢</mo><mi>sgn</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐲</mi><mi>n</mi><mi>u</mi></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nAt the decoder, a generalized nearest-neighbour decoding rule is adopted to decode the $u$-th user's transmit signal. That is, upon observing $\\{\\hat{\\tilde{\\mathbf{x}}}^u[l]\\}_{l=1}^{L^u}$, the decoder computes, for each possible input message $m^u$ of user $u$, the following distance metric\n\n", "itemtype": "equation", "pos": 33035, "prevtext": "\nWe assume that there are still $K$ pairs of high-resolution ADCs available at the BS.\n\nThe quantized output $\\mathbf{r}_n^u$ is then transformed to the frequency domain and later processed by user-specific frequency-domain equalization, leading to\n\n", "index": 43, "text": "\\begin{equation}\n\\hat{\\tilde{\\mathbf{x}}}^u=\\sum_{n=1}^N\\mathbf{W}_n^u\\mathbf{F}\\mathbf{r}_n^u.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\tilde{\\mathbf{x}}}^{u}=\\sum_{n=1}^{N}\\mathbf{W}_{n}^{u}\\mathbf{F}\\mathbf%&#10;{r}_{n}^{u}.\" display=\"block\"><mrow><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mi>u</mi></msup><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msubsup><mi>𝐖</mi><mi>n</mi><mi>u</mi></msubsup><mo>⁢</mo><msubsup><mi>𝐅𝐫</mi><mi>n</mi><mi>u</mi></msubsup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand determines $\\hat{m}^u$ as the one that minimizes $D(m^u)$. Here $\\mathcal{M}^u$ denotes the set of all the possible messages for user $u$, $\\{\\tilde{\\mathbf{x}}^u[m^u,l]\\}_{l=1}^{L^u}$ is the corresponding codeword for message $m^u$, and $L^u$ is the codeword length of user $u$. It is perhaps worth noting that $L^u$ may be different for different users.\n\n\n\\subsection{GMI and the Optimal Equalizer}\nIn the multi-user scenario, if we take the co-channel interference as an additional colored Gaussian noise, then there is no essential difference with the single-user scenario, and the resulting equalizer can effectively handle this noise term by exploiting its statistic characteristics. The subsequent proposition summarizes our main results.\n\\begin{prop}\nFor given $\\bm{\\delta}$ and each user's channel realization $\\{\\mathbf{h}_n^v\\}_{n=1}^N$, $v\\in\\mathbb{U}$, the conditional GMI of user $u$ is given by\n\n", "itemtype": "equation", "pos": 33440, "prevtext": "\nAt the decoder, a generalized nearest-neighbour decoding rule is adopted to decode the $u$-th user's transmit signal. That is, upon observing $\\{\\hat{\\tilde{\\mathbf{x}}}^u[l]\\}_{l=1}^{L^u}$, the decoder computes, for each possible input message $m^u$ of user $u$, the following distance metric\n\n", "index": 45, "text": "\\begin{equation}\nD(m^u)=\\frac{1}{L^u}\\sum_{l=1}^{L^u}\\|\\hat{\\tilde{\\mathbf{x}}}^u[l]-a^u\\tilde{\\mathbf{x}}^u[m^u,l]\\|^2,\\ \\ m^u\\in\\mathcal{M}^u,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"D(m^{u})=\\frac{1}{L^{u}}\\sum_{l=1}^{L^{u}}\\|\\hat{\\tilde{\\mathbf{x}}}^{u}[l]-a^%&#10;{u}\\tilde{\\mathbf{x}}^{u}[m^{u},l]\\|^{2},\\ \\ m^{u}\\in\\mathcal{M}^{u},\" display=\"block\"><mrow><mrow><mrow><mrow><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>m</mi><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msup><mi>L</mi><mi>u</mi></msup></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><msup><mi>L</mi><mi>u</mi></msup></munderover><msup><mrow><mo>∥</mo><mrow><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mi>u</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>l</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>-</mo><mrow><msup><mi>a</mi><mi>u</mi></msup><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mi>u</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>m</mi><mi>u</mi></msup><mo>,</mo><mi>l</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>∥</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msup><mi>m</mi><mi>u</mi></msup><mo>∈</mo><msup><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mi>u</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThe performance indicator $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ and the optimal scaling parameter $a_{\\mathrm{opt}}^u(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ satisfy\n\n", "itemtype": "equation", "pos": 34515, "prevtext": "\nand determines $\\hat{m}^u$ as the one that minimizes $D(m^u)$. Here $\\mathcal{M}^u$ denotes the set of all the possible messages for user $u$, $\\{\\tilde{\\mathbf{x}}^u[m^u,l]\\}_{l=1}^{L^u}$ is the corresponding codeword for message $m^u$, and $L^u$ is the codeword length of user $u$. It is perhaps worth noting that $L^u$ may be different for different users.\n\n\n\\subsection{GMI and the Optimal Equalizer}\nIn the multi-user scenario, if we take the co-channel interference as an additional colored Gaussian noise, then there is no essential difference with the single-user scenario, and the resulting equalizer can effectively handle this noise term by exploiting its statistic characteristics. The subsequent proposition summarizes our main results.\n\\begin{prop}\nFor given $\\bm{\\delta}$ and each user's channel realization $\\{\\mathbf{h}_n^v\\}_{n=1}^N$, $v\\in\\mathbb{U}$, the conditional GMI of user $u$ is given by\n\n", "index": 47, "text": "\\begin{equation}\nI_{\\mathrm{GMI}}^u=\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}\\right).\n\\label{equ:prop_2.1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"I_{\\mathrm{GMI}}^{u}=\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}}^{u},%&#10;\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}}^{u},\\bm{\\delta})}\\right).\" display=\"block\"><mrow><mrow><msubsup><mi>I</mi><mi>GMI</mi><mi>u</mi></msubsup><mo>=</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐰</mi><mi>opt</mi><mi>u</mi></msubsup><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐰</mi><mi>opt</mi><mi>u</mi></msubsup><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand are achieved by the optimal linear frequency-domain equalizer\n\n", "itemtype": "equation", "pos": 34893, "prevtext": "\nThe performance indicator $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ and the optimal scaling parameter $a_{\\mathrm{opt}}^u(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ satisfy\n\n", "index": 49, "text": "\\begin{equation}\n\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})=a_{\\mathrm{opt}}^u(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})\n=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\mathbf{g}^{u})^{\\dag}(\\mathbf{D}^{u})^{-1}\\mathbf{g}^u,\n\\label{equ:prop_2.2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w}_{\\mathrm{opt}}^{u},\\bm{\\delta})=a_{\\mathrm{opt}}^{u}(\\mathbf%&#10;{w}_{\\mathrm{opt}}^{u},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(%&#10;\\mathbf{g}^{u})^{{\\dagger}}(\\mathbf{D}^{u})^{-1}\\mathbf{g}^{u},\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐰</mi><mi>opt</mi><mi>u</mi></msubsup><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mi>a</mi><mi>opt</mi><mi>u</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐰</mi><mi>opt</mi><mi>u</mi></msubsup><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝐠</mi><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝐃</mi><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mi>𝐠</mi><mi>u</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nIn the above, $\\mathbf{g}^u\\triangleq[(\\mathbf{g}_1^{u})^t,...,(\\mathbf{g}_N^{u})^t]^t\\in\\mathbb{C}^{NQ\\times 1}$, of which the $n$-th segment $\\mathbf{g}_n^u$ is given by\n\n", "itemtype": "equation", "pos": 35214, "prevtext": "\nand are achieved by the optimal linear frequency-domain equalizer\n\n", "index": 51, "text": "\\begin{equation}\n\\mathbf{w}_{\\mathrm{opt}}^u=(\\mathbf{D}^{u})^{-1}\\mathbf{g}^u.\n\\label{equ:prop_2.3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{w}_{\\mathrm{opt}}^{u}=(\\mathbf{D}^{u})^{-1}\\mathbf{g}^{u}.\" display=\"block\"><mrow><mrow><msubsup><mi>𝐰</mi><mi>opt</mi><mi>u</mi></msubsup><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝐃</mi><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mi>𝐠</mi><mi>u</mi></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwith $\\bm{\\lambda}_n^u\\triangleq[\\lambda_{n1}^u,...,\\lambda_{nQ}^u]^t$. The block matrix $\\mathbf{D}^u\\in\\mathbb{C}^{NQ\\times NQ}$ is identical for all the users\n\n", "itemtype": "equation", "pos": 35502, "prevtext": "\nIn the above, $\\mathbf{g}^u\\triangleq[(\\mathbf{g}_1^{u})^t,...,(\\mathbf{g}_N^{u})^t]^t\\in\\mathbb{C}^{NQ\\times 1}$, of which the $n$-th segment $\\mathbf{g}_n^u$ is given by\n\n", "index": 53, "text": "\\begin{equation}\n\\mathbf{g}_n^u=\\delta_n\\cdot\\mathcal{E}_{\\mathrm{s}}(\\bm{\\lambda}_n^{u})^*+\\bar{\\delta}_n\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{(\\bm{\\lambda}_n^{u})^*}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\sum_{v=1}^U\\|\\bm{\\lambda}_n^v\\|^2/Q}},\n\\label{equ:prop_2.4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{g}_{n}^{u}=\\delta_{n}\\cdot\\mathcal{E}_{\\mathrm{s}}(\\bm{\\lambda}_{n}^{u%&#10;})^{*}+\\bar{\\delta}_{n}\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{%&#10;(\\bm{\\lambda}_{n}^{u})^{*}}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\sum_{v=1}^{U}\\|%&#10;\\bm{\\lambda}_{n}^{v}\\|^{2}/Q}},\" display=\"block\"><mrow><mrow><msubsup><mi>𝐠</mi><mi>n</mi><mi>u</mi></msubsup><mo>=</mo><mrow><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⋅</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝝀</mi><mi>n</mi><mi>u</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>*</mo></msup></mrow><mo>+</mo><mrow><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt></mrow><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝝀</mi><mi>n</mi><mi>u</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>*</mo></msup><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>=</mo><mn>1</mn></mrow><mi>U</mi></msubsup><mrow><msup><mrow><mo>∥</mo><msubsup><mi>𝝀</mi><mi>n</mi><mi>v</mi></msubsup><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></mrow></msqrt></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand each of its blocks is a $Q$-dimensional diagonal matrix defined as\n\n", "itemtype": "equation", "pos": 35958, "prevtext": "\nwith $\\bm{\\lambda}_n^u\\triangleq[\\lambda_{n1}^u,...,\\lambda_{nQ}^u]^t$. The block matrix $\\mathbf{D}^u\\in\\mathbb{C}^{NQ\\times NQ}$ is identical for all the users\n\n", "index": 55, "text": "\\begin{equation}\n\\mathbf{D}^u\\triangleq\n\\begin{pmatrix}\n    \\mathbf{D}_{11}^u & \\mathbf{D}_{21}^u & \\cdots & \\mathbf{D}_{N1}^u \\\\\n    \\mathbf{D}_{12}^u & \\mathbf{D}_{22}^u & \\cdots & \\mathbf{D}_{N2}^u \\\\\n    \\vdots  & \\vdots  & \\ddots & \\vdots  \\\\\n    \\mathbf{D}_{1N}^u & \\mathbf{D}_{2N}^u & \\cdots & \\mathbf{D}_{NN}^u\n\\end{pmatrix},\n\\label{equ:prop_2.5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{D}^{u}\\triangleq\\begin{pmatrix}\\mathbf{D}_{11}^{u}&amp;\\mathbf{D}_{21}^{u}%&#10;&amp;\\cdots&amp;\\mathbf{D}_{N1}^{u}\\\\&#10;\\mathbf{D}_{12}^{u}&amp;\\mathbf{D}_{22}^{u}&amp;\\cdots&amp;\\mathbf{D}_{N2}^{u}\\\\&#10;\\vdots&amp;\\vdots&amp;\\ddots&amp;\\vdots\\\\&#10;\\mathbf{D}_{1N}^{u}&amp;\\mathbf{D}_{2N}^{u}&amp;\\cdots&amp;\\mathbf{D}_{NN}^{u}\\end{pmatrix},\" display=\"block\"><mrow><mrow><msup><mi>𝐃</mi><mi>u</mi></msup><mo>≜</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mn>11</mn><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mn>21</mn><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mn>1</mn></mrow><mi>u</mi></msubsup></mtd></mtr><mtr><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mn>12</mn><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mn>22</mn><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mn>2</mn></mrow><mi>u</mi></msubsup></mtd></mtr><mtr><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋱</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd></mtr><mtr><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mrow><mn>1</mn><mo>⁢</mo><mi>N</mi></mrow><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mrow><mn>2</mn><mo>⁢</mo><mi>N</mi></mrow><mi>u</mi></msubsup></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><msubsup><mi>𝐃</mi><mrow><mi>N</mi><mo>⁢</mo><mi>N</mi></mrow><mi>u</mi></msubsup></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nHere $\\mathbf{R}_{nm}^u\\triangleq\\mathbb{E}[\\mathbf{r}_n^u(\\mathbf{r}_m^{u})^\\dag]$ is the correlation matrix of $\\mathbf{r}_n^u$ and $\\mathbf{r}_m^u$, and is also identical for all the users.\n\\end{prop}\n\n\\begin{proof}\nAs aforementioned, there is no fundamental difference between the single-user and the multi-user scenarios. Therefore, in this proof we only need to outline the sketch. For user $u$, the conditional GMI also follows from \\eqref{equ:equ_16}, except that we need to replace \\eqref{equ:equ_17} by\n\n", "itemtype": "equation", "pos": 36399, "prevtext": "\nand each of its blocks is a $Q$-dimensional diagonal matrix defined as\n\n", "index": 57, "text": "\\begin{equation}\n(\\mathbf{D}_{nm}^u)_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}^u\\mathbf{F}^{\\dag})_{qq},\\ q\\in\\mathbb{Q}.\n\\label{equ:prop_2.6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{D}_{nm}^{u})_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}^{u}\\mathbf{F}^{{\\dagger}%&#10;})_{qq},\\ q\\in\\mathbb{Q}.\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐃</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mi>u</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>𝐅𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mi>u</mi></msubsup><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mrow><mo rspace=\"7.5pt\">,</mo><mrow><mi>q</mi><mo>∈</mo><mi>ℚ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThe computation of $\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\tilde{\\mathbf{x}}^u]$ and $\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\hat{\\tilde{\\mathbf{x}}}^u]$ is similar as that in the single-user scenario, only if we replace $\\mathbf{Y}_{nm}$ in \\eqref{equ:equ_9} with\n\n", "itemtype": "equation", "pos": 37060, "prevtext": "\nHere $\\mathbf{R}_{nm}^u\\triangleq\\mathbb{E}[\\mathbf{r}_n^u(\\mathbf{r}_m^{u})^\\dag]$ is the correlation matrix of $\\mathbf{r}_n^u$ and $\\mathbf{r}_m^u$, and is also identical for all the users.\n\\end{prop}\n\n\\begin{proof}\nAs aforementioned, there is no fundamental difference between the single-user and the multi-user scenarios. Therefore, in this proof we only need to outline the sketch. For user $u$, the conditional GMI also follows from \\eqref{equ:equ_16}, except that we need to replace \\eqref{equ:equ_17} by\n\n", "index": 59, "text": "\\begin{equation}\n\\Delta(\\mathbf{w}^u,\\bm{\\delta})=\\frac{|\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\tilde{\\mathbf{x}}^u]|^2}\n{Q\\mathcal{E}_s\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\hat{\\tilde{\\mathbf{x}}}^u]}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w}^{u},\\bm{\\delta})=\\frac{|\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}%&#10;^{u})^{{\\dagger}}\\tilde{\\mathbf{x}}^{u}]|^{2}}{Q\\mathcal{E}_{s}\\mathbb{E}[(%&#10;\\hat{\\tilde{\\mathbf{x}}}^{u})^{{\\dagger}}\\hat{\\tilde{\\mathbf{x}}}^{u}]}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝐰</mi><mi>u</mi></msup><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mi>u</mi></msup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi>s</mi></msub><mo>⁢</mo><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mi>u</mi></msup><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup><mo>⁢</mo><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mi>u</mi></msup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThen following essentially the same line as Appendix-A, one may easily formulate $\\Delta(\\mathbf{w}^u,\\bm{\\delta})$ as a generalized Rayleigh quotient of $\\mathbf{w}^u$, and based on which obtain the optimal linear frequency-domain equalizer $\\mathbf{w}_{\\mathrm{opt}}^u$ as well as the corresponding $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$.\n\\end{proof}\n\n\\subsection{ADC Switch Scheme}\nIn the multi-user scenario, there is no generally convincing ADC switch scheme. Moreover, the high-dimensional property of the problem calls for efficient ADC switch scheme, and time-consuming schemes such as greedy algorithm and exhaustive search are practically infeasible. Therefore, in the numerical study we will consider the following heuristic schemes.\n\\begin{itemize}\n  \\item Random ADC switch: high-resolution ADCs are switched randomly, say, to the first $K$ antennas.\n  \\item Norm-based ADC switch: switch the high-resolution ADCs to the antennas with the maximum $\\sum_{v=1}^U\\|\\bm{\\lambda}_n^v\\|^2$ or $\\sum_{v=1}^U\\|\\mathbf{h}_n^v\\|^2$, equivalently. It is asymptotically optimal in the low SNR regime.\n\\end{itemize}\nNumerical result will be presented in Section \\ref{sect:numerical} to compare the performance of both switch schemes.\n\n\\subsection{GMI Lower and Upper Bounds for Ergodic Time-Varying Channels}\nAnalogously, we extend the analytical results to ergodic time-varying channels. Lower and upper bounds of the GMI are given by the following proposition, and numerical study will be conducted in Section \\ref{sect:numerical} to verify their tightness.\n\\begin{prop}\nFor ergodic time-varying MU-MIMO-OFDM channels, the lower and upper bounds of $I_{\\mathrm{GMI}}^u$ are given by\n\\begin{eqnarray}\nI_{\\mathrm{GMI}}^{u,\\mathrm{l}}&=&\\log\\left(1+\\frac{\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})]}{1-\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})]}\\right),\\\\\nI_{\\mathrm{GMI}}^{u,\\mathrm{u}}&=&\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}\\left[\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}\\right)\\right],\n\\end{eqnarray}\nrespectively. Here $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ follows from \\eqref{equ:prop_2.2}, for each sample of the ergodic time-varying channel.\n\\end{prop}\n\n\\section{Discussion on Computational Complexity}\n\\label{sect:complexity}\nSince the computational complexity of matrix inversion grows cubically with the dimension of the matrix, directly inverting the $NQ\\times NQ$ matrix $\\mathbf{D}$ may impose great computational burden on the receiver. In the following, we exploit the specific structure of $\\mathbf{D}$, and propose a reduced-complexity algorithm to efficiently compute $\\mathbf{D}^{-1}$. With the proposed algorithm, the computational complexity of $\\mathbf{D}^{-1}$ can be reduced from $O(N^3Q^3)$ to $O(N^3Q)$, thus significantly alleviating the computational burden of the receiver.\n\\begin{prop}\n\\label{prop:complexity}\nThe block matrix $\\mathbf{D}$ consists of $N\\times N$ blocks, of which each block is a $Q$-dimensional diagonal matrix. Exploiting this structure, the evaluation of $\\mathbf{D}^{-1}$ can be simplified by applying $\\mathbf{D}^{-1}=\\mathbf{P}(\\mathbf{P}^t\\mathbf{DP})^{-1}\\mathbf{P}^t$, where $\\mathbf{P}$ is a specific permutation matrix that makes $\\mathbf{P}^t\\mathbf{DP}$ a block diagonal matrix\\footnote{Noticing that the permutation matrix $\\mathbf{P}$ has exactly one element of 1 in each row and each column and 0s elsewhere, the computational complexity of $\\mathbf{P}^t\\mathbf{DP}$ is virtually negligible.}.\n\\end{prop}\n\\begin{proof}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8 \\textwidth]{Permutation.eps}\\\\\n  \\caption{Transform the matrix $\\mathbf{D}$ into a block diagonal matrix by row and column permutations: an example for $N=Q=2$.}\n  \\label{fig:permutation}\n\\end{figure}\nObserving the structure of $\\mathbf{D}$, one may notice that $\\mathbf{D}$ can be transformed into a block diagonal matrix by some specific row-permutation matrix $\\mathbf{P}_{\\mathrm{r}}$ and some specific column-permutation matrix $\\mathbf{P}_{\\mathrm{c}}$. Besides, it is straightforward that $\\mathbf{P}_{\\mathrm{r}}^t=\\mathbf{P}_{\\mathrm{c}}\\triangleq\\mathbf{P}$, due to the symmetry of $\\mathbf{D}$. Figure \\ref{fig:permutation} gives an example for $N=Q=2$, where the zero elements of $\\mathbf{D}$ are left blank and the nonzero entries belong to the same subcarrier are marked by the same color.\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8 \\textwidth]{Training_v2.eps}\\\\\n  \\caption{Illustration of the training program.}\n  \\label{fig:training}\n\\end{figure}\n\nThen we need to determine $\\mathbf{P}$ for given system parameter $(N,Q)$. We note that this can be accomplished by a simple training program. To this end, we create a training matrix $\\mathbf{G}$ that shares the same structure as $[\\mathbf{D}_{11},...,\\mathbf{D}_{N1}]$; that is, $\\mathbf{G}\\triangleq [\\mathbf{G}_1,...,\\mathbf{G}_N]$, and $\\mathbf{G}_n$ is a $Q$-dimensional diagonal matrix for any $n\\in\\mathbb{N}$. Moreover, the value of each nonzero element of $\\mathbf{G}$ indicates its column index after performing the column permutation $\\mathbf{P}$. Exploiting these inherent marks we are able to transform $\\mathbf{G}$ into $\\mathbf{GP}$ by no more than $NQ$ times of pair-wise column permutations and obtain $\\mathbf{P}$ along the training process. An illustration of the training program is given by Figure \\ref{fig:training}, where row permutation is omitted since $\\mathbf{P}_{\\mathrm{r}}=\\mathbf{P}_{\\mathrm{c}}^t$ as explained before.\n\\end{proof}\n\nBefore inverting $\\mathbf{D}$, evaluating $\\mathbf{D}$ itself also incurs a computational complexity of $O(N^2Q^2\\log_2 Q)$. Beyond that, the computational burden of $\\mathbf{g}$ and $\\mathbf{D}^{-1}\\mathbf{g}$ is negligible. Therefore, with Proposition \\ref{prop:complexity}, the computational complexity of $\\mathbf{w}_{\\mathrm{opt}}$ is reduced from $O(N^3 Q^3)$ to $O(\\max\\{N^3 Q, N^2 Q^2\\log_2 Q\\})$, significantly alleviating the computational burden of the receiver.\n\n\n\\section{Numerical Study}\n\\label{sect:numerical}\nIn this section, we validate our previous analysis through extensive numerical studies. In the single-user scenario, the high-resolution ADCs are switched to the antennas with the strongest $K$ link magnitude gains, as suggested by Corollary \\ref{cor:cor_3} and Corollary \\ref{cor:cor_4}. All the figures\\footnote{In these figures, CA and AS represent ideal conventional architecture (all the BS antennas are equipped with high-resolution ADCs) and antenna selection (only a subset of the BS antennas are active), respectively.} in this section are for ergodic time-varying channels, and the channel coefficients are drawn independently from Rayleigh fading. Besides, we deem the $\\mathrm{SNR}$ that achieves 6 bits/s/Hz in the single-user scenario or 2.5 bits/s/Hz per user in the multi-user scenario as a moderate SNR \\cite{TR36.912}.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Rectangular.eps}\\\\\n  \\caption{GMI for different numbers of high-resolution ADC pairs: $N=64$, $Q=32$, and $T=5$. We assume rectangular power delay profile, i.e., $h_{nt}\\sim\\mathcal{CN}(0,1/T)$, for any $n\\in\\mathbb{N}$ and $t\\in\\mathbb{T}$.}\n  \\label{fig:fig_2}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Exponential.eps}\\\\\n  \\caption{GMI for different numbers of high-resolution ADC pairs: $N=64$, $Q=32$, and $T=5$. We assume exponential power delay profile with 3 dB decay between two contiguous taps; that is $h_{nt}\\sim\\mathcal{CN}(0,2^{T-t}/(2^T-1))$, for any $n\\in\\mathbb{N}$ and $t\\in\\mathbb{T}$.}\n  \\label{fig:fig_3}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Comparison.eps}\\\\\n  \\caption{GMI lower bound for different numbers of high-resolution ADC pairs: comparison between rectangular power delay profile and exponential power delay profile, $N=64$, $Q=32$, and $T=5$.}\n  \\label{fig:fig_4}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_VaryingT.eps}\\\\\n  \\caption{GMI lower bound for different numbers of high-resolution ADC pairs: $N=64$ and $Q=32$. Three different choices of $T$ are made for rectangular power delay profile, of which $T=1$ means frequency-flat fading, $T=8$ corresponds to frequency-selective fading in a rich-scattering environment, and $T=4$ accounts for a mediate scenario.}\n  \\label{fig:fig_5}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{GMI_SNR_64_32_Rectangular.eps}\\\\\n  \\caption{GMI lower bound for various $\\mathrm{SNR}$s: rectangular power delay profile, $N=64$, $Q=32$, and $T=5$.}\n  \\label{fig:fig_6}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_MultiUser_K_64_32.eps}\\\\\n  \\caption{GMI of the considered user for different numbers of high-resolution ADC pairs: norm-based ADC switch, $N=64$, $Q=32$, $U=10$, and $T^v=5$ for any $v\\in\\mathbb{U}$.}\n  \\label{fig:fig_7}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_MultiUser_K_64_32_Comparison.eps}\\\\\n  \\caption{GMI lower bound of the considered user for different numbers of high-resolution ADC pairs: comparison between random and norm-based ADC switch schemes when $N=64$, $Q=32$, $U=10$, $\\mathrm{SNR}=-10\\mathrm{dB}$, and $T^v=5$ for any $v\\in\\mathbb{U}$.}\n  \\label{fig:fig_8}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{BER_SingleUser.eps}\\\\\n  \\caption{BER performance in the single-user scenario when $N=64$, $Q=32$, and $T=5$. In the simulation, we adopt QPSK modulation, (2,1,3) convolutional coding and hard-decision Viterbi decoding to evaluate the BER.}\n  \\label{fig:fig_9}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{BER_MultiUser.eps}\\\\\n  \\caption{BER performance in the multi-user scenario when $N=64$, $Q=32$, $U=10$, and $T^v=5$ for any $v\\in\\mathbb{U}$. Particularly, QPSK modulation, (2,1,3) convolutional coding and hard-decision Viterbi decoding are adopted in the BER evaluation.}\n  \\label{fig:fig_10}\n\\end{figure}\n\n\\subsection{The Single-user Scenario}\nFigure \\ref{fig:fig_2} and Figure \\ref{fig:fig_3} display the GMI of the mixed-ADC architecture under rectangular or exponential power delay profile, respectively. Several observations can be made from both figures. First, we notice that the GMI lower and upper bounds are very tight, and thus we are allowed to only use the GMI lower bound in the subsequent spectral efficiency evaluation. In addition, for the special case of $K=N$, there is a barely visible gap between $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ and the capacity of the ideal conventional architecture, as predicted by Corollary \\ref{cor:cor_1}. Moreover, the mixed-ADC architecture with a small proportion of high-resolution ADCs does achieve a dominant portion of the capacity of ideal conventional architecture, and significantly outperform antenna selection with the same number of high-resolution ADCs.\n\nFurther, Figure \\ref{fig:fig_4} gives a comparison of the GMI lower bounds under two different power delay profiles. In general, the gap is marginal for various $K$ and $\\mathrm{SNR}$ in consideration. Therefore in the following we may confine ourselves to the rectangular power delay profile. Besides, we notice that for each given SNR, there is an intersection between the curves. This will be explained detailedly in the following.\n\nThe impact of $T$ on $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ is addressed by Figure \\ref{fig:fig_5}, where three different choices of $T$ are made. For each given SNR, we notice that there is also an intersection between two of the curves. Particularly, if $K$ lays at the left side of the intersection, a larger $T$ would achieve a higher $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$. Because in this situation, there are few high-resolution ADCs and, hence, frequency diversity becomes crucial for signal recovery at the receiver. If $K$ lays at the right side of the intersection, on the other hand, a larger $T$ would lead to a lower $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$, and this may be attributed to the limitation of the linear frequency-domain equalizer in mitigating ICI.\n\nFigure \\ref{fig:fig_6} further investigates the impact of SNR on $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$, focusing on little $K$ particularly. Red dashed line corresponds to the limit of $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ in the high SNR regime. We observe a similar phenomenon\\footnote{For one-bit massive SIMO, the GMI (or achievable data rate) increases first and then turns down as the SNR grows large, since the amplitude of the transmit signal can barely be recovered at the receiver when the SNR is sufficient large. For more details, please refer to \\cite{jacobsson2015one} and \\cite{liang2015mixed}.} as that in frequency-flat SIMO channel scenario \\cite[Fig. 6]{liang2015mixed}, except that when $K=0$, the degradation of $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ in the high SNR regime tends to level off now. This again may be attributed to the frequency diversity for signal recovery when the SNR is high but there are only one-bit ADCs available.\n\\subsection{The Multi-user Scenario}\nHere we assume rectangular power delay profile, and therefore each tap of the multipath channel from user $v$ to an arbitrary BS antenna is independently $\\mathcal{CN}(0,1/T^v)$ distributed.\n\nFigure \\ref{fig:fig_7} shows the numerical result for norm-based ADC switch scheme. Several observations are in order. First, we notice that the GMI lower and upper bounds again virtually coincide with each other. Second, due to not applying successive interference cancellation (SIC) at the receiver, there is a visible but marginal performance lose at $K=N$ when compared with the per-user capacity\\footnote{The per-user capacity is obtained through dividing the users' sum-capacity by the number of users.} of ideal conventional architecture. Finally, the mixed-ADC architecture with a small proportion of high-resolution ADCs still achieves a large portion of the per-user capacity of ideal conventional architecture, while overwhelms antenna selection with the same number of high-resolution ADCs.\n\nFurthermore, Figure \\ref{fig:fig_8} gives a comparison between the random and norm-based ADC switch schemes, choosing $\\mathrm{SNR}=-10\\mathrm{dB}$ as an example. It implies that the norm-based scheme does achieve slightly better performance than the random switch scheme.\n\\subsection{BER Performance}\nFinally, we examine the BER performance of the mixed-ADC architecture when employing a (2,1,3) convolutional coder and Viterbi hard-decision decoding. We adopt QPSK modulation to map the coded bits into system input $\\tilde{\\mathbf{x}}$.\\footnote{Noting that the optimal linear frequency-domain equalizer in Proposition \\ref{prop:prop_1} is dedicated to Gaussian distributed channel inputs, it is mismatched with QPSK modulation and is therefore suboptimal in this situation. Nevertheless, benefiting from the central-limit theorem, the actual channel inputs, $\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}$, asymptotically approach Gaussian distribution as $Q$ grows large. As a result, the performance loss due to the mismatch is supposed to be marginal.} In this manner, one information bit is first encoded into a couple of codeword bits and then mapped into a QPSK symbol. As a result, $E_{\\mathrm{b}}/N_0$ under this setup coincides with $\\mathrm{SNR}$.\n\nNumerical results for single-user and multi-user scenarios are given by Figure \\ref{fig:fig_9} and Figure \\ref{fig:fig_10}, respectively. We notice that with a small proportion of high-resolution ADCs, the mixed-ADC architecture achieves remarkable gain over one-bit massive MIMO. Moreover, in the multi-user scenario, the mixed-ADC architecture with $K=16$ is able to eliminate the error floor encountered by one-bit massive MIMO. These observations again validate the superiority of the mixed-ADC architecture over the uniform-ADC architecture.\n\n\\section{Conclusion}\n\\label{sect:conclusion}\nIn this paper, we leverage the information-theoretical tool of GMI to analyze the performance of the mixed-ADC architecture under frequency-selective fading. Extensive numerical studies demonstrate that the mixed-ADC architecture with a relatively small number of high-resolution ADCs suffices to achieve data rate close to that of ideal conventional architecture, in both single-user scenario and multi-user scenario. Besides, the mixed-ADC architecture in the multi-user scenario is effective in mitigating the error floor encountered by one-bit massive MIMO. Thus we envision the mixed-ADC architecture as a promising option for effective design of massive MIMO receivers.\n\nBeyond the scope of this paper, several important problems remain unsolved. First, channel estimation and time-frequency synchronization in the mixed-ADC architecture are more challenging than those in ideal conventional architecture, especially in the multi-user scenario, and thus efficient channel estimation and time-frequency synchronization algorithms are urgent for the mixed-ADC architecture to realize the promised profits. In addition, joint channel estimation and time-frequency synchronization is also an interesting and important topic for future research.\n\n\n\\section{Appendix}\n\\label{sect:appendix}\n\\subsection{Proof of Proposition 2}\n\\label{subsect:proposition_1}\nWe first introduce a lemma, with which we are able to derive a closed-form expression of $\\Delta(\\mathbf{w},\\bm{\\delta})$. The proof is similar as those for \\cite[Lem. 1\\&2]{liang2015mixed}, and thus is omitted due to space limitation.\n\\begin{lem}\n\\label{lem:lem_1}\nFor bivariate circularly-symmetric complex Gaussian vector\n\n", "itemtype": "equation", "pos": 37583, "prevtext": "\nThe computation of $\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\tilde{\\mathbf{x}}^u]$ and $\\mathbb{E}[(\\hat{\\tilde{\\mathbf{x}}}^{u})^{\\dag}\\hat{\\tilde{\\mathbf{x}}}^u]$ is similar as that in the single-user scenario, only if we replace $\\mathbf{Y}_{nm}$ in \\eqref{equ:equ_9} with\n\n", "index": 61, "text": "\\begin{equation}\n\\mathbf{Y}_{nm}^u=\n\\begin{cases}\n\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\sum_{v=1}^{U}\\mathbf{C}_n^v(\\mathbf{C}_n^{v})^{\\dag}, & n=m\\in\\mathbb{N} \\\\\n\\mathcal{E}_{\\mathrm{s}}\\sum_{v=1}^{U}\\mathbf{C}_n^v(\\mathbf{C}_m^{v})^{\\dag}, & n\\neq m\\in\\mathbb{N}.\n\\end{cases}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{Y}_{nm}^{u}=\\begin{cases}\\mathbf{I}_{Q}+\\mathcal{E}_{\\mathrm{s}}\\sum_{%&#10;v=1}^{U}\\mathbf{C}_{n}^{v}(\\mathbf{C}_{n}^{v})^{{\\dagger}},&amp;n=m\\in\\mathbb{N}\\\\&#10;\\mathcal{E}_{\\mathrm{s}}\\sum_{v=1}^{U}\\mathbf{C}_{n}^{v}(\\mathbf{C}_{m}^{v})^{%&#10;{\\dagger}},&amp;n\\neq m\\in\\mathbb{N}.\\end{cases}\" display=\"block\"><mrow><msubsup><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mi>u</mi></msubsup><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>𝐈</mi><mi>Q</mi></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>=</mo><mn>1</mn></mrow><mi>U</mi></msubsup></mstyle><mrow><msubsup><mi>𝐂</mi><mi>n</mi><mi>v</mi></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐂</mi><mi>n</mi><mi>v</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup></mrow></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mi>n</mi><mo>=</mo><mi>m</mi><mo>∈</mo><mi>ℕ</mi></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>=</mo><mn>1</mn></mrow><mi>U</mi></msubsup></mstyle><mrow><msubsup><mi>𝐂</mi><mi>n</mi><mi>v</mi></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>𝐂</mi><mi>m</mi><mi>v</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup></mrow></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>n</mi><mo>≠</mo><mi>m</mi><mo>∈</mo><mi>ℕ</mi></mrow><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwe have\n\n", "itemtype": "equation", "pos": 55935, "prevtext": "\nThen following essentially the same line as Appendix-A, one may easily formulate $\\Delta(\\mathbf{w}^u,\\bm{\\delta})$ as a generalized Rayleigh quotient of $\\mathbf{w}^u$, and based on which obtain the optimal linear frequency-domain equalizer $\\mathbf{w}_{\\mathrm{opt}}^u$ as well as the corresponding $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$.\n\\end{proof}\n\n\\subsection{ADC Switch Scheme}\nIn the multi-user scenario, there is no generally convincing ADC switch scheme. Moreover, the high-dimensional property of the problem calls for efficient ADC switch scheme, and time-consuming schemes such as greedy algorithm and exhaustive search are practically infeasible. Therefore, in the numerical study we will consider the following heuristic schemes.\n\\begin{itemize}\n  \\item Random ADC switch: high-resolution ADCs are switched randomly, say, to the first $K$ antennas.\n  \\item Norm-based ADC switch: switch the high-resolution ADCs to the antennas with the maximum $\\sum_{v=1}^U\\|\\bm{\\lambda}_n^v\\|^2$ or $\\sum_{v=1}^U\\|\\mathbf{h}_n^v\\|^2$, equivalently. It is asymptotically optimal in the low SNR regime.\n\\end{itemize}\nNumerical result will be presented in Section \\ref{sect:numerical} to compare the performance of both switch schemes.\n\n\\subsection{GMI Lower and Upper Bounds for Ergodic Time-Varying Channels}\nAnalogously, we extend the analytical results to ergodic time-varying channels. Lower and upper bounds of the GMI are given by the following proposition, and numerical study will be conducted in Section \\ref{sect:numerical} to verify their tightness.\n\\begin{prop}\nFor ergodic time-varying MU-MIMO-OFDM channels, the lower and upper bounds of $I_{\\mathrm{GMI}}^u$ are given by\n\\begin{eqnarray}\nI_{\\mathrm{GMI}}^{u,\\mathrm{l}}&=&\\log\\left(1+\\frac{\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})]}{1-\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}[\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})]}\\right),\\\\\nI_{\\mathrm{GMI}}^{u,\\mathrm{u}}&=&\\mathbb{E}_{\\mathbf{h}_n^v,n\\in\\mathbb{N},v\\in\\mathbb{U}}\\left[\\log\\left(1+\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}{1-\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})}\\right)\\right],\n\\end{eqnarray}\nrespectively. Here $\\Delta(\\mathbf{w}_{\\mathrm{opt}}^u,\\bm{\\delta})$ follows from \\eqref{equ:prop_2.2}, for each sample of the ergodic time-varying channel.\n\\end{prop}\n\n\\section{Discussion on Computational Complexity}\n\\label{sect:complexity}\nSince the computational complexity of matrix inversion grows cubically with the dimension of the matrix, directly inverting the $NQ\\times NQ$ matrix $\\mathbf{D}$ may impose great computational burden on the receiver. In the following, we exploit the specific structure of $\\mathbf{D}$, and propose a reduced-complexity algorithm to efficiently compute $\\mathbf{D}^{-1}$. With the proposed algorithm, the computational complexity of $\\mathbf{D}^{-1}$ can be reduced from $O(N^3Q^3)$ to $O(N^3Q)$, thus significantly alleviating the computational burden of the receiver.\n\\begin{prop}\n\\label{prop:complexity}\nThe block matrix $\\mathbf{D}$ consists of $N\\times N$ blocks, of which each block is a $Q$-dimensional diagonal matrix. Exploiting this structure, the evaluation of $\\mathbf{D}^{-1}$ can be simplified by applying $\\mathbf{D}^{-1}=\\mathbf{P}(\\mathbf{P}^t\\mathbf{DP})^{-1}\\mathbf{P}^t$, where $\\mathbf{P}$ is a specific permutation matrix that makes $\\mathbf{P}^t\\mathbf{DP}$ a block diagonal matrix\\footnote{Noticing that the permutation matrix $\\mathbf{P}$ has exactly one element of 1 in each row and each column and 0s elsewhere, the computational complexity of $\\mathbf{P}^t\\mathbf{DP}$ is virtually negligible.}.\n\\end{prop}\n\\begin{proof}\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8 \\textwidth]{Permutation.eps}\\\\\n  \\caption{Transform the matrix $\\mathbf{D}$ into a block diagonal matrix by row and column permutations: an example for $N=Q=2$.}\n  \\label{fig:permutation}\n\\end{figure}\nObserving the structure of $\\mathbf{D}$, one may notice that $\\mathbf{D}$ can be transformed into a block diagonal matrix by some specific row-permutation matrix $\\mathbf{P}_{\\mathrm{r}}$ and some specific column-permutation matrix $\\mathbf{P}_{\\mathrm{c}}$. Besides, it is straightforward that $\\mathbf{P}_{\\mathrm{r}}^t=\\mathbf{P}_{\\mathrm{c}}\\triangleq\\mathbf{P}$, due to the symmetry of $\\mathbf{D}$. Figure \\ref{fig:permutation} gives an example for $N=Q=2$, where the zero elements of $\\mathbf{D}$ are left blank and the nonzero entries belong to the same subcarrier are marked by the same color.\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.8 \\textwidth]{Training_v2.eps}\\\\\n  \\caption{Illustration of the training program.}\n  \\label{fig:training}\n\\end{figure}\n\nThen we need to determine $\\mathbf{P}$ for given system parameter $(N,Q)$. We note that this can be accomplished by a simple training program. To this end, we create a training matrix $\\mathbf{G}$ that shares the same structure as $[\\mathbf{D}_{11},...,\\mathbf{D}_{N1}]$; that is, $\\mathbf{G}\\triangleq [\\mathbf{G}_1,...,\\mathbf{G}_N]$, and $\\mathbf{G}_n$ is a $Q$-dimensional diagonal matrix for any $n\\in\\mathbb{N}$. Moreover, the value of each nonzero element of $\\mathbf{G}$ indicates its column index after performing the column permutation $\\mathbf{P}$. Exploiting these inherent marks we are able to transform $\\mathbf{G}$ into $\\mathbf{GP}$ by no more than $NQ$ times of pair-wise column permutations and obtain $\\mathbf{P}$ along the training process. An illustration of the training program is given by Figure \\ref{fig:training}, where row permutation is omitted since $\\mathbf{P}_{\\mathrm{r}}=\\mathbf{P}_{\\mathrm{c}}^t$ as explained before.\n\\end{proof}\n\nBefore inverting $\\mathbf{D}$, evaluating $\\mathbf{D}$ itself also incurs a computational complexity of $O(N^2Q^2\\log_2 Q)$. Beyond that, the computational burden of $\\mathbf{g}$ and $\\mathbf{D}^{-1}\\mathbf{g}$ is negligible. Therefore, with Proposition \\ref{prop:complexity}, the computational complexity of $\\mathbf{w}_{\\mathrm{opt}}$ is reduced from $O(N^3 Q^3)$ to $O(\\max\\{N^3 Q, N^2 Q^2\\log_2 Q\\})$, significantly alleviating the computational burden of the receiver.\n\n\n\\section{Numerical Study}\n\\label{sect:numerical}\nIn this section, we validate our previous analysis through extensive numerical studies. In the single-user scenario, the high-resolution ADCs are switched to the antennas with the strongest $K$ link magnitude gains, as suggested by Corollary \\ref{cor:cor_3} and Corollary \\ref{cor:cor_4}. All the figures\\footnote{In these figures, CA and AS represent ideal conventional architecture (all the BS antennas are equipped with high-resolution ADCs) and antenna selection (only a subset of the BS antennas are active), respectively.} in this section are for ergodic time-varying channels, and the channel coefficients are drawn independently from Rayleigh fading. Besides, we deem the $\\mathrm{SNR}$ that achieves 6 bits/s/Hz in the single-user scenario or 2.5 bits/s/Hz per user in the multi-user scenario as a moderate SNR \\cite{TR36.912}.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Rectangular.eps}\\\\\n  \\caption{GMI for different numbers of high-resolution ADC pairs: $N=64$, $Q=32$, and $T=5$. We assume rectangular power delay profile, i.e., $h_{nt}\\sim\\mathcal{CN}(0,1/T)$, for any $n\\in\\mathbb{N}$ and $t\\in\\mathbb{T}$.}\n  \\label{fig:fig_2}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Exponential.eps}\\\\\n  \\caption{GMI for different numbers of high-resolution ADC pairs: $N=64$, $Q=32$, and $T=5$. We assume exponential power delay profile with 3 dB decay between two contiguous taps; that is $h_{nt}\\sim\\mathcal{CN}(0,2^{T-t}/(2^T-1))$, for any $n\\in\\mathbb{N}$ and $t\\in\\mathbb{T}$.}\n  \\label{fig:fig_3}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_Comparison.eps}\\\\\n  \\caption{GMI lower bound for different numbers of high-resolution ADC pairs: comparison between rectangular power delay profile and exponential power delay profile, $N=64$, $Q=32$, and $T=5$.}\n  \\label{fig:fig_4}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_SingleUser_K_64_32_VaryingT.eps}\\\\\n  \\caption{GMI lower bound for different numbers of high-resolution ADC pairs: $N=64$ and $Q=32$. Three different choices of $T$ are made for rectangular power delay profile, of which $T=1$ means frequency-flat fading, $T=8$ corresponds to frequency-selective fading in a rich-scattering environment, and $T=4$ accounts for a mediate scenario.}\n  \\label{fig:fig_5}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{GMI_SNR_64_32_Rectangular.eps}\\\\\n  \\caption{GMI lower bound for various $\\mathrm{SNR}$s: rectangular power delay profile, $N=64$, $Q=32$, and $T=5$.}\n  \\label{fig:fig_6}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_MultiUser_K_64_32.eps}\\\\\n  \\caption{GMI of the considered user for different numbers of high-resolution ADC pairs: norm-based ADC switch, $N=64$, $Q=32$, $U=10$, and $T^v=5$ for any $v\\in\\mathbb{U}$.}\n  \\label{fig:fig_7}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{Ergodic_MultiUser_K_64_32_Comparison.eps}\\\\\n  \\caption{GMI lower bound of the considered user for different numbers of high-resolution ADC pairs: comparison between random and norm-based ADC switch schemes when $N=64$, $Q=32$, $U=10$, $\\mathrm{SNR}=-10\\mathrm{dB}$, and $T^v=5$ for any $v\\in\\mathbb{U}$.}\n  \\label{fig:fig_8}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{BER_SingleUser.eps}\\\\\n  \\caption{BER performance in the single-user scenario when $N=64$, $Q=32$, and $T=5$. In the simulation, we adopt QPSK modulation, (2,1,3) convolutional coding and hard-decision Viterbi decoding to evaluate the BER.}\n  \\label{fig:fig_9}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=0.65 \\textwidth]{BER_MultiUser.eps}\\\\\n  \\caption{BER performance in the multi-user scenario when $N=64$, $Q=32$, $U=10$, and $T^v=5$ for any $v\\in\\mathbb{U}$. Particularly, QPSK modulation, (2,1,3) convolutional coding and hard-decision Viterbi decoding are adopted in the BER evaluation.}\n  \\label{fig:fig_10}\n\\end{figure}\n\n\\subsection{The Single-user Scenario}\nFigure \\ref{fig:fig_2} and Figure \\ref{fig:fig_3} display the GMI of the mixed-ADC architecture under rectangular or exponential power delay profile, respectively. Several observations can be made from both figures. First, we notice that the GMI lower and upper bounds are very tight, and thus we are allowed to only use the GMI lower bound in the subsequent spectral efficiency evaluation. In addition, for the special case of $K=N$, there is a barely visible gap between $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ and the capacity of the ideal conventional architecture, as predicted by Corollary \\ref{cor:cor_1}. Moreover, the mixed-ADC architecture with a small proportion of high-resolution ADCs does achieve a dominant portion of the capacity of ideal conventional architecture, and significantly outperform antenna selection with the same number of high-resolution ADCs.\n\nFurther, Figure \\ref{fig:fig_4} gives a comparison of the GMI lower bounds under two different power delay profiles. In general, the gap is marginal for various $K$ and $\\mathrm{SNR}$ in consideration. Therefore in the following we may confine ourselves to the rectangular power delay profile. Besides, we notice that for each given SNR, there is an intersection between the curves. This will be explained detailedly in the following.\n\nThe impact of $T$ on $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ is addressed by Figure \\ref{fig:fig_5}, where three different choices of $T$ are made. For each given SNR, we notice that there is also an intersection between two of the curves. Particularly, if $K$ lays at the left side of the intersection, a larger $T$ would achieve a higher $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$. Because in this situation, there are few high-resolution ADCs and, hence, frequency diversity becomes crucial for signal recovery at the receiver. If $K$ lays at the right side of the intersection, on the other hand, a larger $T$ would lead to a lower $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$, and this may be attributed to the limitation of the linear frequency-domain equalizer in mitigating ICI.\n\nFigure \\ref{fig:fig_6} further investigates the impact of SNR on $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$, focusing on little $K$ particularly. Red dashed line corresponds to the limit of $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ in the high SNR regime. We observe a similar phenomenon\\footnote{For one-bit massive SIMO, the GMI (or achievable data rate) increases first and then turns down as the SNR grows large, since the amplitude of the transmit signal can barely be recovered at the receiver when the SNR is sufficient large. For more details, please refer to \\cite{jacobsson2015one} and \\cite{liang2015mixed}.} as that in frequency-flat SIMO channel scenario \\cite[Fig. 6]{liang2015mixed}, except that when $K=0$, the degradation of $I_{\\mathrm{GMI}}^{\\mathrm{lower}}$ in the high SNR regime tends to level off now. This again may be attributed to the frequency diversity for signal recovery when the SNR is high but there are only one-bit ADCs available.\n\\subsection{The Multi-user Scenario}\nHere we assume rectangular power delay profile, and therefore each tap of the multipath channel from user $v$ to an arbitrary BS antenna is independently $\\mathcal{CN}(0,1/T^v)$ distributed.\n\nFigure \\ref{fig:fig_7} shows the numerical result for norm-based ADC switch scheme. Several observations are in order. First, we notice that the GMI lower and upper bounds again virtually coincide with each other. Second, due to not applying successive interference cancellation (SIC) at the receiver, there is a visible but marginal performance lose at $K=N$ when compared with the per-user capacity\\footnote{The per-user capacity is obtained through dividing the users' sum-capacity by the number of users.} of ideal conventional architecture. Finally, the mixed-ADC architecture with a small proportion of high-resolution ADCs still achieves a large portion of the per-user capacity of ideal conventional architecture, while overwhelms antenna selection with the same number of high-resolution ADCs.\n\nFurthermore, Figure \\ref{fig:fig_8} gives a comparison between the random and norm-based ADC switch schemes, choosing $\\mathrm{SNR}=-10\\mathrm{dB}$ as an example. It implies that the norm-based scheme does achieve slightly better performance than the random switch scheme.\n\\subsection{BER Performance}\nFinally, we examine the BER performance of the mixed-ADC architecture when employing a (2,1,3) convolutional coder and Viterbi hard-decision decoding. We adopt QPSK modulation to map the coded bits into system input $\\tilde{\\mathbf{x}}$.\\footnote{Noting that the optimal linear frequency-domain equalizer in Proposition \\ref{prop:prop_1} is dedicated to Gaussian distributed channel inputs, it is mismatched with QPSK modulation and is therefore suboptimal in this situation. Nevertheless, benefiting from the central-limit theorem, the actual channel inputs, $\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}$, asymptotically approach Gaussian distribution as $Q$ grows large. As a result, the performance loss due to the mismatch is supposed to be marginal.} In this manner, one information bit is first encoded into a couple of codeword bits and then mapped into a QPSK symbol. As a result, $E_{\\mathrm{b}}/N_0$ under this setup coincides with $\\mathrm{SNR}$.\n\nNumerical results for single-user and multi-user scenarios are given by Figure \\ref{fig:fig_9} and Figure \\ref{fig:fig_10}, respectively. We notice that with a small proportion of high-resolution ADCs, the mixed-ADC architecture achieves remarkable gain over one-bit massive MIMO. Moreover, in the multi-user scenario, the mixed-ADC architecture with $K=16$ is able to eliminate the error floor encountered by one-bit massive MIMO. These observations again validate the superiority of the mixed-ADC architecture over the uniform-ADC architecture.\n\n\\section{Conclusion}\n\\label{sect:conclusion}\nIn this paper, we leverage the information-theoretical tool of GMI to analyze the performance of the mixed-ADC architecture under frequency-selective fading. Extensive numerical studies demonstrate that the mixed-ADC architecture with a relatively small number of high-resolution ADCs suffices to achieve data rate close to that of ideal conventional architecture, in both single-user scenario and multi-user scenario. Besides, the mixed-ADC architecture in the multi-user scenario is effective in mitigating the error floor encountered by one-bit massive MIMO. Thus we envision the mixed-ADC architecture as a promising option for effective design of massive MIMO receivers.\n\nBeyond the scope of this paper, several important problems remain unsolved. First, channel estimation and time-frequency synchronization in the mixed-ADC architecture are more challenging than those in ideal conventional architecture, especially in the multi-user scenario, and thus efficient channel estimation and time-frequency synchronization algorithms are urgent for the mixed-ADC architecture to realize the promised profits. In addition, joint channel estimation and time-frequency synchronization is also an interesting and important topic for future research.\n\n\n\\section{Appendix}\n\\label{sect:appendix}\n\\subsection{Proof of Proposition 2}\n\\label{subsect:proposition_1}\nWe first introduce a lemma, with which we are able to derive a closed-form expression of $\\Delta(\\mathbf{w},\\bm{\\delta})$. The proof is similar as those for \\cite[Lem. 1\\&2]{liang2015mixed}, and thus is omitted due to space limitation.\n\\begin{lem}\n\\label{lem:lem_1}\nFor bivariate circularly-symmetric complex Gaussian vector\n\n", "index": 63, "text": "\\begin{equation}\n\\begin{pmatrix}\nu_1\\\\\nu_2\n\\end{pmatrix}\n\\sim\\mathcal{CN}\n\\left(\\mathbf{0},\n\\begin{pmatrix}\n\\sigma_1^2 & \\sigma_{12} \\\\\n\\sigma_{12}^{\\dag} & \\sigma_2^2\n\\end{pmatrix}\n\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32.m1\" class=\"ltx_Math\" alttext=\"\\begin{pmatrix}u_{1}\\\\&#10;u_{2}\\end{pmatrix}\\sim\\mathcal{CN}\\left(\\mathbf{0},\\begin{pmatrix}\\sigma_{1}^{%&#10;2}&amp;\\sigma_{12}\\\\&#10;\\sigma_{12}^{{\\dagger}}&amp;\\sigma_{2}^{2}\\end{pmatrix}\\right),\" display=\"block\"><mrow><mrow><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>u</mi><mn>1</mn></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>u</mi><mn>2</mn></msub></mtd></mtr></mtable><mo>)</mo></mrow><mo>∼</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>⁢</mo><mrow><mo>(</mo><mn/><mo>,</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msubsup><mi>σ</mi><mn>1</mn><mn>2</mn></msubsup></mtd><mtd columnalign=\"center\"><msub><mi>σ</mi><mn>12</mn></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msubsup><mi>σ</mi><mn>12</mn><mo>†</mo></msubsup></mtd><mtd columnalign=\"center\"><msubsup><mi>σ</mi><mn>2</mn><mn>2</mn></msubsup></mtd></mtr></mtable><mo>)</mo></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 56149, "prevtext": "\nwe have\n\n", "index": 65, "text": "\\begin{equation}\n\\mathbb{E}[\\mathrm{sgn}^{\\dag}(u_1)u_2]=\\sigma_{12}^{\\dag}\\sqrt{\\frac{2}{\\pi\\sigma_1^2}},\n\\label{equ:lemma_1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\mathrm{sgn}^{{\\dagger}}(u_{1})u_{2}]=\\sigma_{12}^{{\\dagger}}\\sqrt{%&#10;\\frac{2}{\\pi\\sigma_{1}^{2}}},\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>u</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>u</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mi>σ</mi><mn>12</mn><mo>†</mo></msubsup><mo>⁢</mo><msqrt><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><msubsup><mi>σ</mi><mn>1</mn><mn>2</mn></msubsup></mrow></mfrac></msqrt></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\theta_{\\mathrm{R}}$ and $\\theta_{\\mathrm{I}}$ are the real and imaginary parts of the correlation coefficient $\\theta=\\sigma_{12}/\\sqrt{\\sigma_1^2\\sigma_2^2}$ respectively, and $\\sigma_{12}$ is defined as $\\sigma_{12}\\triangleq\\mathbb{E}[u_1u_2^{\\dag}]$.\n\\end{lem}\n\nHereafter we denote by $\\mathbb{N}_{\\mathrm{1}}$ the set of indexes that make $\\delta_n=1$ while by $\\mathbb{N}_{\\mathrm{0}}$ the set of indexes that make $\\delta_n=0$. For the numerator $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]$, with some manipulation we have\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]\n&=&\\sum_{n\\in\\mathbb{N}}\\mathbb{E}[\\mathbf{r}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\sum_{n\\in\\mathbb{N}_{\\mathrm{0}}}\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\sum_{n\\in\\mathbb{N}_{\\mathrm{0}}}\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}],\n\\label{equ:equ_1}\n\\end{eqnarray}\nwhere the first term is contributed by the antennas equipped with high-resolution ADCs, and the second term comes from the antennas with one-bit ADCs. In the following, we need to evaluate them separately.\n\nFirst let us look at $\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]$. For the convenience of analysis, we stack the diagonal elements of $\\mathbf{W}_n$ as a $Q\\times 1$ vector $\\mathbf{w}_n$, i.e., $(\\mathbf{w}_n)_{q}=(\\mathbf{W}_n)_{qq}=w_{nq}$, for $q\\in\\mathbb{Q}$, and accordingly define $\\mathbf{w}\\triangleq[\\mathbf{w}_1^t,...,\\mathbf{w}_N^t]^t$. Similarly, we squish matrix $\\bm{\\Lambda}_n$ as a $Q\\times 1$ vector $\\bm{\\lambda}_n$, and define $\\bm{\\lambda}\\triangleq[\\bm{\\lambda}_1^t,...,\\bm{\\lambda}_N^t]^t$. Then we have\n\\begin{eqnarray}\n\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n&=&\\mathbb{E}[\\mathbf{x}^{\\dag}\\mathbf{C}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\mathbb{E}[\\mathbf{z}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&\\overset{(a)}{=}&\\mathbb{E}[\\tilde{\\mathbf{x}}^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\mathrm{tr}\\left(\\bm{\\Lambda}_n^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbb{E}[\\tilde{\\mathbf{x}}\\tilde{\\mathbf{x}}^{\\dag}]\\right)\\nonumber\\\\\n&=&\\mathcal{E}_{\\mathrm{s}}\\mathrm{tr}\\left(\\bm{\\Lambda}_n^{\\dag}\\mathbf{W}_n^{\\dag}\\right)\n=\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*,\n\\label{equ:equ_2}\n\\end{eqnarray}\nwhere (a) follows from the independence of $\\tilde{\\mathbf{x}}$ and $\\mathbf{z}_n$, $\\mathbf{x}=\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}$, and the decomposition $\\mathbf{C}_n=\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n\\mathbf{F}$.\n\nNext, we turn to $\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}]$; that is\n\n", "itemtype": "equation", "pos": 56295, "prevtext": "\nand\n\n", "index": 67, "text": "\\begin{equation}\n\\mathbb{E}[\\mathrm{sgn}(u_1)\\mathrm{sgn}^{\\dag}(u_2)]=\\frac{2}{\\pi}[\\arcsin(\\theta_{\\mathrm{R}})+j\\arcsin(\\theta_{\\mathrm{I}})],\n\\label{equ:lemma_2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\mathrm{sgn}(u_{1})\\mathrm{sgn}^{{\\dagger}}(u_{2})]=\\frac{2}{\\pi}[%&#10;\\arcsin(\\theta_{\\mathrm{R}})+j\\arcsin(\\theta_{\\mathrm{I}})],\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>sgn</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>u</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>u</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>arcsin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">R</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>j</mi><mo>⁢</mo><mrow><mi>arcsin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>θ</mi><mi mathvariant=\"normal\">I</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nNoticing that\n\n", "itemtype": "equation", "pos": 59753, "prevtext": "\nwhere $\\theta_{\\mathrm{R}}$ and $\\theta_{\\mathrm{I}}$ are the real and imaginary parts of the correlation coefficient $\\theta=\\sigma_{12}/\\sqrt{\\sigma_1^2\\sigma_2^2}$ respectively, and $\\sigma_{12}$ is defined as $\\sigma_{12}\\triangleq\\mathbb{E}[u_1u_2^{\\dag}]$.\n\\end{lem}\n\nHereafter we denote by $\\mathbb{N}_{\\mathrm{1}}$ the set of indexes that make $\\delta_n=1$ while by $\\mathbb{N}_{\\mathrm{0}}$ the set of indexes that make $\\delta_n=0$. For the numerator $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]$, with some manipulation we have\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]\n&=&\\sum_{n\\in\\mathbb{N}}\\mathbb{E}[\\mathbf{r}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\sum_{n\\in\\mathbb{N}_{\\mathrm{0}}}\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\sum_{n\\in\\mathbb{N}_{\\mathrm{0}}}\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}],\n\\label{equ:equ_1}\n\\end{eqnarray}\nwhere the first term is contributed by the antennas equipped with high-resolution ADCs, and the second term comes from the antennas with one-bit ADCs. In the following, we need to evaluate them separately.\n\nFirst let us look at $\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]$. For the convenience of analysis, we stack the diagonal elements of $\\mathbf{W}_n$ as a $Q\\times 1$ vector $\\mathbf{w}_n$, i.e., $(\\mathbf{w}_n)_{q}=(\\mathbf{W}_n)_{qq}=w_{nq}$, for $q\\in\\mathbb{Q}$, and accordingly define $\\mathbf{w}\\triangleq[\\mathbf{w}_1^t,...,\\mathbf{w}_N^t]^t$. Similarly, we squish matrix $\\bm{\\Lambda}_n$ as a $Q\\times 1$ vector $\\bm{\\lambda}_n$, and define $\\bm{\\lambda}\\triangleq[\\bm{\\lambda}_1^t,...,\\bm{\\lambda}_N^t]^t$. Then we have\n\\begin{eqnarray}\n\\mathbb{E}[\\mathbf{y}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n&=&\\mathbb{E}[\\mathbf{x}^{\\dag}\\mathbf{C}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\n+\\mathbb{E}[\\mathbf{z}_n^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&\\overset{(a)}{=}&\\mathbb{E}[\\tilde{\\mathbf{x}}^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n^{\\dag}\\mathbf{F}\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\tilde{\\mathbf{x}}]\\nonumber\\\\\n&=&\\mathrm{tr}\\left(\\bm{\\Lambda}_n^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbb{E}[\\tilde{\\mathbf{x}}\\tilde{\\mathbf{x}}^{\\dag}]\\right)\\nonumber\\\\\n&=&\\mathcal{E}_{\\mathrm{s}}\\mathrm{tr}\\left(\\bm{\\Lambda}_n^{\\dag}\\mathbf{W}_n^{\\dag}\\right)\n=\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*,\n\\label{equ:equ_2}\n\\end{eqnarray}\nwhere (a) follows from the independence of $\\tilde{\\mathbf{x}}$ and $\\mathbf{z}_n$, $\\mathbf{x}=\\mathbf{F}^{\\dag}\\tilde{\\mathbf{x}}$, and the decomposition $\\mathbf{C}_n=\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n\\mathbf{F}$.\n\nNext, we turn to $\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}]$; that is\n\n", "index": 69, "text": "\\begin{equation}\n\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}]\n=\\sum_{q=1}^Q\\mathbb{E}[\\mathrm{sgn}^{\\dag}(y_{nq})(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x})_q].\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\mathrm{sgn}^{{\\dagger}}(\\mathbf{y}_{n})\\mathbf{F}^{{\\dagger}}%&#10;\\mathbf{W}_{n}^{{\\dagger}}\\mathbf{F}\\mathbf{x}]=\\sum_{q=1}^{Q}\\mathbb{E}[%&#10;\\mathrm{sgn}^{{\\dagger}}(y_{nq})(\\mathbf{F}^{{\\dagger}}\\mathbf{W}_{n}^{{%&#10;\\dagger}}\\mathbf{F}\\mathbf{x})_{q}].\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐲</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅𝐱</mi></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>q</mi><mo>=</mo><mn>1</mn></mrow><mi>Q</mi></munderover><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>q</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand moreover\n\n", "itemtype": "equation", "pos": 60015, "prevtext": "\nNoticing that\n\n", "index": 71, "text": "\\begin{equation}\ny_{nq}\\sim\\mathcal{CN}(0,1+\\mathcal{E}_{\\mathrm{s}}(\\mathbf{C}_n\\mathbf{C}_n^{\\dag})_{qq}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36.m1\" class=\"ltx_Math\" alttext=\"y_{nq}\\sim\\mathcal{CN}(0,1+\\mathcal{E}_{\\mathrm{s}}(\\mathbf{C}_{n}\\mathbf{C}_{%&#10;n}^{{\\dagger}})_{qq}),\" display=\"block\"><mrow><mrow><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>∼</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo>,</mo><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐂</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝐂</mi><mi>n</mi><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\mathbf{f}_q$ represents the $q$-th column of the DFT matrix $\\mathbf{F}$, we obtain the distribution of $y_{nq}$ as\n\n", "itemtype": "equation", "pos": 60152, "prevtext": "\nand moreover\n\n", "index": 73, "text": "\\begin{equation}\n(\\mathbf{C}_n\\mathbf{C}_n^{\\dag})_{qq}=(\\mathbf{F}^{\\dag}\\bm{\\Lambda}_n\\bm{\\Lambda}_n^{\\dag}\\mathbf{F})_{qq}=\\mathbf{f}_q^{\\dag}\\bm{\\Lambda}_n\\bm{\\Lambda}_n^{\\dag}\\mathbf{f}_q=\\|\\bm{\\lambda}_n\\|^2/Q,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{C}_{n}\\mathbf{C}_{n}^{{\\dagger}})_{qq}=(\\mathbf{F}^{{\\dagger}}\\bm{%&#10;\\Lambda}_{n}\\bm{\\Lambda}_{n}^{{\\dagger}}\\mathbf{F})_{qq}=\\mathbf{f}_{q}^{{%&#10;\\dagger}}\\bm{\\Lambda}_{n}\\bm{\\Lambda}_{n}^{{\\dagger}}\\mathbf{f}_{q}=\\|\\bm{%&#10;\\lambda}_{n}\\|^{2}/Q,\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐂</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝐂</mi><mi>n</mi><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msub><mi>𝚲</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝚲</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><msubsup><mi>𝐟</mi><mi>q</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>𝚲</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝚲</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>𝐟</mi><mi>q</mi></msub></mrow><mo>=</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nFurther, $y_{nq}$ and $(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x})_q$ are jointly circularly symmetric complex Guassian, with their covariance being\n\n", "itemtype": "equation", "pos": 60508, "prevtext": "\nwhere $\\mathbf{f}_q$ represents the $q$-th column of the DFT matrix $\\mathbf{F}$, we obtain the distribution of $y_{nq}$ as\n\n", "index": 75, "text": "\\begin{equation}\ny_{nq}\\sim\\mathcal{CN}\\left(0,1+\\mathcal{E}_{\\mathrm{s}}\\|\\bm{\\lambda}_n\\|^2/Q\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"y_{nq}\\sim\\mathcal{CN}\\left(0,1+\\mathcal{E}_{\\mathrm{s}}\\|\\bm{\\lambda}_{n}\\|^{%&#10;2}/Q\\right).\" display=\"block\"><mrow><mrow><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>∼</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>⁢</mo><mrow><mo>(</mo><mn>0</mn><mo>,</mo><mrow><mn>1</mn><mo>+</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup></mrow><mo>/</mo><mi>Q</mi></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThen, exploiting \\eqref{equ:lemma_1} we arrive at\n\n", "itemtype": "equation", "pos": 60791, "prevtext": "\nFurther, $y_{nq}$ and $(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x})_q$ are jointly circularly symmetric complex Guassian, with their covariance being\n\n", "index": 77, "text": "\\begin{equation}\n\\mathbb{E}[y_{nq}^{\\dag}(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x})_q]\n=(\\mathbb{E}[\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}\\mathbf{y}_n^{\\dag}])_{qq}\n=\\mathcal{E}_{\\mathrm{s}}(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\bm{\\Lambda}_n^{\\dag}\\mathbf{F})_{qq}\n=\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*/Q.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[y_{nq}^{{\\dagger}}(\\mathbf{F}^{{\\dagger}}\\mathbf{W}_{n}^{{\\dagger}}%&#10;\\mathbf{F}\\mathbf{x})_{q}]=(\\mathbb{E}[\\mathbf{F}^{{\\dagger}}\\mathbf{W}_{n}^{{%&#10;\\dagger}}\\mathbf{F}\\mathbf{x}\\mathbf{y}_{n}^{{\\dagger}}])_{qq}=\\mathcal{E}_{%&#10;\\mathrm{s}}(\\mathbf{F}^{{\\dagger}}\\mathbf{W}_{n}^{{\\dagger}}\\bm{\\Lambda}_{n}^{%&#10;{\\dagger}}\\mathbf{F})_{qq}=\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}_{n}^{{\\dagger}}%&#10;\\bm{\\lambda}_{n}^{*}/Q.\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msubsup><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>q</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝐅𝐱𝐲</mi><mi>n</mi><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝚲</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msubsup><mi>𝐰</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><mo>/</mo><mi>Q</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand consequently, we have\n\n", "itemtype": "equation", "pos": 61219, "prevtext": "\nThen, exploiting \\eqref{equ:lemma_1} we arrive at\n\n", "index": 79, "text": "\\begin{equation}\n\\mathbb{E}[\\mathrm{sgn}^{\\dag}(y_{nq})(\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x})_q]\n=\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*/Q}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_n\\|^2/Q}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\mathrm{sgn}^{{\\dagger}}(y_{nq})(\\mathbf{F}^{{\\dagger}}\\mathbf{W}_{%&#10;n}^{{\\dagger}}\\mathbf{F}\\mathbf{x})_{q}]=\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}%&#10;}{\\pi}}\\frac{\\mathbf{w}_{n}^{{\\dagger}}\\bm{\\lambda}_{n}^{*}/Q}{\\sqrt{1/%&#10;\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_{n}\\|^{2}/Q}},\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅𝐱</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>q</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt><mo>⁢</mo><mfrac><mrow><mrow><msubsup><mi>𝐰</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><mo>/</mo><mi>Q</mi></mrow><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></msqrt></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nNow, we are allowed to combine \\eqref{equ:equ_1} \\eqref{equ:equ_2} and \\eqref{equ:equ_3} to obtain $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]$, given as\n\n", "itemtype": "equation", "pos": 61526, "prevtext": "\nand consequently, we have\n\n", "index": 81, "text": "\\begin{equation}\n\\mathbb{E}[\\mathrm{sgn}^{\\dag}(\\mathbf{y}_n)\\mathbf{F}^{\\dag}\\mathbf{W}_n^{\\dag}\\mathbf{F}\\mathbf{x}]\n=\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_n\\|^2/Q}}.\n\\label{equ:equ_3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\mathrm{sgn}^{{\\dagger}}(\\mathbf{y}_{n})\\mathbf{F}^{{\\dagger}}%&#10;\\mathbf{W}_{n}^{{\\dagger}}\\mathbf{F}\\mathbf{x}]=\\sqrt{\\frac{2\\mathcal{E}_{%&#10;\\mathrm{s}}}{\\pi}}\\frac{\\mathbf{w}_{n}^{{\\dagger}}\\bm{\\lambda}_{n}^{*}}{\\sqrt{%&#10;1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_{n}\\|^{2}/Q}}.\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐲</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><msubsup><mi>𝐖</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><mi>𝐅𝐱</mi></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt><mo>⁢</mo><mfrac><mrow><msubsup><mi>𝐰</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></msqrt></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nFor the convenience of further investigation, we rewrite \\eqref{equ:equ_4} as\n\n", "itemtype": "equation", "pos": 61999, "prevtext": "\n\nNow, we are allowed to combine \\eqref{equ:equ_1} \\eqref{equ:equ_2} and \\eqref{equ:equ_3} to obtain $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]$, given as\n\n", "index": 83, "text": "\\begin{equation}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]\n=\\mathcal{E}_{\\mathrm{s}}\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*\n+\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\sum_{n\\in\\mathbb{N}_{\\mathrm{0}}}\\frac{\\mathbf{w}_n^{\\dag}\\bm{\\lambda}_n^*}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_n\\|^2/Q}}.\n\\label{equ:equ_4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{{\\dagger}}\\tilde{\\mathbf{x}}]=\\mathcal{E}%&#10;_{\\mathrm{s}}\\sum_{n\\in\\mathbb{N}_{\\mathrm{1}}}\\mathbf{w}_{n}^{{\\dagger}}\\bm{%&#10;\\lambda}_{n}^{*}+\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\sum_{n\\in\\mathbb%&#10;{N}_{\\mathrm{0}}}\\frac{\\mathbf{w}_{n}^{{\\dagger}}\\bm{\\lambda}_{n}^{*}}{\\sqrt{1%&#10;/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_{n}\\|^{2}/Q}}.\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>∈</mo><msub><mi>ℕ</mi><mn>1</mn></msub></mrow></munder><mrow><msubsup><mi>𝐰</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow></mrow></mrow><mo>+</mo><mrow><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>∈</mo><msub><mi>ℕ</mi><mn>0</mn></msub></mrow></munder><mfrac><mrow><msubsup><mi>𝐰</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></msqrt></mfrac></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\mathbf{g}\\triangleq[\\mathbf{g}_1^t,...,\\mathbf{g}_N^t]^t\\in\\mathbb{C}^{NQ\\times 1}$ can be easily obtained from \\eqref{equ:equ_4}; that is\n\n", "itemtype": "equation", "pos": 62465, "prevtext": "\nFor the convenience of further investigation, we rewrite \\eqref{equ:equ_4} as\n\n", "index": 85, "text": "\\begin{equation}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\tilde{\\mathbf{x}}]=\\mathbf{w}^{\\dag}\\mathbf{g},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{{\\dagger}}\\tilde{\\mathbf{x}}]=\\mathbf{w}^%&#10;{{\\dagger}}\\mathbf{g},\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msup><mi>𝐰</mi><mo>†</mo></msup><mo>⁢</mo><mi>𝐠</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nIn order to evaluate $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$, we define $\\mathbf{R}_{nm}\\triangleq\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]$ and consequently have\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]\n&=&\\sum_{m=1}^N\\sum_{n=1}^N\\mathbb{E}[\\mathbf{r}_m^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbf{r}_n]\\nonumber\\\\\n&=&\\sum_{m=1}^N\\sum_{n=1}^N\\mathrm{tr}\\left(\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]\\mathbf{F}^{\\dag}\\right)\n=\\sum_{m=1}^N\\sum_{n=1}^N\\mathrm{tr}\\left(\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag}\\right).\n\\end{eqnarray}\nNoticing that $\\mathbf{W}_n, n\\in\\mathbb{N}$ are all diagonal matrices, we may define diagonal matrix $\\mathbf{D}_{nm}$ as\n\n", "itemtype": "equation", "pos": 62735, "prevtext": "\nwhere $\\mathbf{g}\\triangleq[\\mathbf{g}_1^t,...,\\mathbf{g}_N^t]^t\\in\\mathbb{C}^{NQ\\times 1}$ can be easily obtained from \\eqref{equ:equ_4}; that is\n\n", "index": 87, "text": "\\begin{equation}\n\\mathbf{g}_n=\\delta_n\\cdot\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}_n^*+\\bar{\\delta}_n\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\bm{\\lambda}_n^*}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_n\\|^2/Q}},\\ \\ n\\in\\mathbb{N}.\n\\label{equ:equ_15}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E44.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{g}_{n}=\\delta_{n}\\cdot\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}_{n}^{*}+%&#10;\\bar{\\delta}_{n}\\cdot\\sqrt{\\frac{2\\mathcal{E}_{\\mathrm{s}}}{\\pi}}\\frac{\\bm{%&#10;\\lambda}_{n}^{*}}{\\sqrt{1/\\mathcal{E}_{\\mathrm{s}}+\\|\\bm{\\lambda}_{n}\\|^{2}/Q}%&#10;},\\ \\ n\\in\\mathbb{N}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>𝐠</mi><mi>n</mi></msub><mo>=</mo><mrow><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⋅</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow><mo>+</mo><mrow><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mi>π</mi></mfrac></msqrt></mrow><mo>⁢</mo><mfrac><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup><msqrt><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow><mn>2</mn></msup><mo>/</mo><mi>Q</mi></mrow></mrow></msqrt></mfrac></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>n</mi><mo>∈</mo><mi>ℕ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand then $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$ can be reformed as\n\n", "itemtype": "equation", "pos": 63854, "prevtext": "\n\nIn order to evaluate $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$, we define $\\mathbf{R}_{nm}\\triangleq\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]$ and consequently have\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]\n&=&\\sum_{m=1}^N\\sum_{n=1}^N\\mathbb{E}[\\mathbf{r}_m^{\\dag}\\mathbf{F}^{\\dag}\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbf{r}_n]\\nonumber\\\\\n&=&\\sum_{m=1}^N\\sum_{n=1}^N\\mathrm{tr}\\left(\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbb{E}[\\mathbf{r}_n\\mathbf{r}_m^{\\dag}]\\mathbf{F}^{\\dag}\\right)\n=\\sum_{m=1}^N\\sum_{n=1}^N\\mathrm{tr}\\left(\\mathbf{W}_m^{\\dag}\\mathbf{W}_n\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag}\\right).\n\\end{eqnarray}\nNoticing that $\\mathbf{W}_n, n\\in\\mathbb{N}$ are all diagonal matrices, we may define diagonal matrix $\\mathbf{D}_{nm}$ as\n\n", "index": 89, "text": "\\begin{equation}\n(\\mathbf{D}_{nm})_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag})_{qq}=\\mathbf{f}_q^{\\dag}\\mathbf{R}_{nm}\\mathbf{f}_q,\n\\label{equ:equ_8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E45.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{D}_{nm})_{qq}=(\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{{\\dagger}})_{qq}=%&#10;\\mathbf{f}_{q}^{{\\dagger}}\\mathbf{R}_{nm}\\mathbf{f}_{q},\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐃</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐅𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><msubsup><mi>𝐟</mi><mi>q</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>𝐟</mi><mi>q</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThis further motivates us to rewrite $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$ in a compact manner; that is\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]\n&=&[\\mathbf{w}_1^{\\dag},\\mathbf{w}_2^{\\dag},...,\\mathbf{w}_{N}^{\\dag}]\n\\begin{pmatrix}\n    \\mathbf{D}_{11} & \\mathbf{D}_{21} & \\cdots & \\mathbf{D}_{N1} \\\\\n    \\mathbf{D}_{12} & \\mathbf{D}_{22} & \\cdots & \\mathbf{D}_{N2} \\\\\n    \\vdots  & \\vdots  & \\ddots & \\vdots  \\\\\n    \\mathbf{D}_{1N} & \\mathbf{D}_{2N} & \\cdots & \\mathbf{D}_{NN}\n\\end{pmatrix}\n\\begin{pmatrix}\n    \\mathbf{w}_1 \\\\\n    \\mathbf{w}_2 \\\\\n    \\vdots \\\\\n    \\mathbf{w}_N\n\\end{pmatrix}\\nonumber\\\\\n&\\triangleq&\\mathbf{w}^{\\dag}\\mathbf{D}\\mathbf{w}.\n\\end{eqnarray}\nIt is perhaps worth noting that the block matrix $\\mathbf{D}\\in\\mathbb{C}^{NQ\\times NQ}$ is a Hermitian matrix and moreover each of its blocks is a $Q$-dimensional diagonal matrix.\n\nNow, we are allowed to formulate $\\Delta(\\mathbf{w},\\bm{\\delta})$ as a generalized Rayleigh quotient of $\\mathbf{w}$, given as\n\n", "itemtype": "equation", "pos": 64123, "prevtext": "\nand then $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$ can be reformed as\n\n", "index": 91, "text": "\\begin{equation}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]=\\sum_{m=1}^N\\sum_{n=1}^N\\mathbf{w}_m^{\\dag}\\mathbf{D}_{nm}\\mathbf{w}_n.\n\\label{equ:equ_5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E46.m1\" class=\"ltx_Math\" alttext=\"\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{{\\dagger}}\\hat{\\tilde{\\mathbf{x}}}]=\\sum_%&#10;{m=1}^{N}\\sum_{n=1}^{N}\\mathbf{w}_{m}^{{\\dagger}}\\mathbf{D}_{nm}\\mathbf{w}_{n}.\" display=\"block\"><mrow><mrow><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover><mo>†</mo></msup><mo>⁢</mo><mover accent=\"true\"><mover accent=\"true\"><mi>𝐱</mi><mo stretchy=\"false\">~</mo></mover><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msubsup><mi>𝐰</mi><mi>m</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>𝐃</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>𝐰</mi><mi>n</mi></msub></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThen, exploiting a similar argument as that adopted in \\cite[Prop. 3]{liang2015mixed}, we may easily obtain the optimal linear equalizer $\\mathbf{w}_{\\mathrm{opt}}$ and the corresponding $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$, as illustrated by Proposition \\ref{prop:prop_1}.\n\nThe evaluation of matrix $\\mathbf{D}$ remains unaccomplished. To this end, we first define $\\mathbf{Y}_{nm}\\triangleq\\mathbb{E}[\\mathbf{y}_n\\mathbf{y}_m^{\\dag}]$, and it is easy to verify that\n\n", "itemtype": "equation", "pos": 65367, "prevtext": "\nThis further motivates us to rewrite $\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]$ in a compact manner; that is\n\\begin{eqnarray}\n\\mathbb{E}[\\hat{\\tilde{\\mathbf{x}}}^{\\dag}\\hat{\\tilde{\\mathbf{x}}}]\n&=&[\\mathbf{w}_1^{\\dag},\\mathbf{w}_2^{\\dag},...,\\mathbf{w}_{N}^{\\dag}]\n\\begin{pmatrix}\n    \\mathbf{D}_{11} & \\mathbf{D}_{21} & \\cdots & \\mathbf{D}_{N1} \\\\\n    \\mathbf{D}_{12} & \\mathbf{D}_{22} & \\cdots & \\mathbf{D}_{N2} \\\\\n    \\vdots  & \\vdots  & \\ddots & \\vdots  \\\\\n    \\mathbf{D}_{1N} & \\mathbf{D}_{2N} & \\cdots & \\mathbf{D}_{NN}\n\\end{pmatrix}\n\\begin{pmatrix}\n    \\mathbf{w}_1 \\\\\n    \\mathbf{w}_2 \\\\\n    \\vdots \\\\\n    \\mathbf{w}_N\n\\end{pmatrix}\\nonumber\\\\\n&\\triangleq&\\mathbf{w}^{\\dag}\\mathbf{D}\\mathbf{w}.\n\\end{eqnarray}\nIt is perhaps worth noting that the block matrix $\\mathbf{D}\\in\\mathbb{C}^{NQ\\times NQ}$ is a Hermitian matrix and moreover each of its blocks is a $Q$-dimensional diagonal matrix.\n\nNow, we are allowed to formulate $\\Delta(\\mathbf{w},\\bm{\\delta})$ as a generalized Rayleigh quotient of $\\mathbf{w}$, given as\n\n", "index": 93, "text": "\\begin{equation}\n\\Delta(\\mathbf{w},\\bm{\\delta})=\\frac{\\mathbf{w}^{\\dag}\\mathbf{g}\\mathbf{g}^{\\dag}\\mathbf{w}}{Q\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}^{\\dag}\\mathbf{D}\\mathbf{w}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E47.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w},\\bm{\\delta})=\\frac{\\mathbf{w}^{{\\dagger}}\\mathbf{g}\\mathbf{g%&#10;}^{{\\dagger}}\\mathbf{w}}{Q\\mathcal{E}_{\\mathrm{s}}\\mathbf{w}^{{\\dagger}}%&#10;\\mathbf{D}\\mathbf{w}}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐰</mi><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msup><mi>𝐰</mi><mo>†</mo></msup><mo>⁢</mo><msup><mi>𝐠𝐠</mi><mo>†</mo></msup><mo>⁢</mo><mi>𝐰</mi></mrow><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msup><mi>𝐰</mi><mo>†</mo></msup><mo>⁢</mo><mi>𝐃𝐰</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nFurther, we introduce a series of matrices $\\bm{\\Theta}_{nm}$, $n,m\\in\\mathbb{N}_{\\mathrm{0}}$, of which $\\bm{\\Theta}_{nm}$ corresponds to the correlation coefficient matrix between $\\mathbf{y}_n$ and $\\mathbf{y}_m$, with its $(p,q)$-th element given by\n\\begin{eqnarray}\n(\\bm{\\Theta}_{nm})_{pq}=\\frac{(\\mathbf{Y}_{nm})_{pq}}{\\sqrt{(\\mathbf{Y}_{nn})_{pp}}\\sqrt{(\\mathbf{Y}_{mm})_{qq}}},\\ \\ p,q\\in\\mathbb{Q}.\n\\label{equ:equ_6}\n\\end{eqnarray}\nDue to the mixed nature of $\\mathbf{r}$, the computation of $\\mathbf{R}_{nm}$ for different $(n,m)$ may follow different routes, and therefore in the following, we need to evaluate them case by case.\n\nCase 1: $n,m\\in\\mathbb{N}_{\\mathrm{1}}$. In this case, $\\mathbf{r}_n=\\mathbf{y}_n$, $\\mathbf{r}_m=\\mathbf{y}_m$, and thus we have\n\n", "itemtype": "equation", "pos": 66036, "prevtext": "\nThen, exploiting a similar argument as that adopted in \\cite[Prop. 3]{liang2015mixed}, we may easily obtain the optimal linear equalizer $\\mathbf{w}_{\\mathrm{opt}}$ and the corresponding $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$, as illustrated by Proposition \\ref{prop:prop_1}.\n\nThe evaluation of matrix $\\mathbf{D}$ remains unaccomplished. To this end, we first define $\\mathbf{Y}_{nm}\\triangleq\\mathbb{E}[\\mathbf{y}_n\\mathbf{y}_m^{\\dag}]$, and it is easy to verify that\n\n", "index": 95, "text": "\\begin{equation}\n\\mathbf{Y}_{nm}=\n\\begin{cases}\n\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\mathbf{C}_n\\mathbf{C}_n^{\\dag},\\ &\\ n=m\\in\\mathbb{N},\\\\\n\\mathcal{E}_{\\mathrm{s}}\\mathbf{C}_n\\mathbf{C}_m^{\\dag},\\ &\\ n\\neq m\\in\\mathbb{N}.\n\\end{cases}\n\\label{equ:equ_9}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E48.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{Y}_{nm}=\\begin{cases}\\mathbf{I}_{Q}+\\mathcal{E}_{\\mathrm{s}}\\mathbf{C}%&#10;_{n}\\mathbf{C}_{n}^{{\\dagger}},&amp;\\ n=m\\in\\mathbb{N},\\\\&#10;\\mathcal{E}_{\\mathrm{s}}\\mathbf{C}_{n}\\mathbf{C}_{m}^{{\\dagger}},&amp;\\ n\\neq m\\in%&#10;\\mathbb{N}.\\end{cases}\" display=\"block\"><mrow><msub><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>𝐈</mi><mi>Q</mi></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mi>𝐂</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝐂</mi><mi>n</mi><mo>†</mo></msubsup></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mpadded lspace=\"5pt\" width=\"+5pt\"><mi>n</mi></mpadded><mo>=</mo><mi>m</mi><mo>∈</mo><mi>ℕ</mi></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mi>𝐂</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝐂</mi><mi>m</mi><mo>†</mo></msubsup></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mpadded lspace=\"5pt\" width=\"+5pt\"><mi>n</mi></mpadded><mo>≠</mo><mi>m</mi><mo>∈</mo><mi>ℕ</mi></mrow><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nCase 2: $n,m\\in\\mathbb{N}_{\\mathrm{0}}$. In this situation, $\\mathbf{r}_n=\\mathrm{sgn}(\\mathbf{y}_n)$ and $\\mathbf{r}_m=\\mathrm{sgn}(\\mathbf{y}_m)$. Exploiting \\eqref{equ:lemma_2} we get\n\\begin{eqnarray}\n(\\mathbf{R}_{nm})_{pq}&=&\\mathbb{E}[\\mathrm{sgn}(y_{np})\\mathrm{sgn}^{\\dag}(y_{mq})]\\nonumber\\\\\n&=&\\frac{2}{\\pi}[\\arcsin((\\bm{\\Theta}_{nm})_{pq,\\mathrm{R}})+j\\arcsin((\\bm{\\Theta}_{nm})_{pq,\\mathrm{I}})].\n\\label{equ:equ_11}\n\\end{eqnarray}\n\nCase 3: $n\\in\\mathbb{N}_{\\mathrm{1}}$ and $m\\in\\mathbb{N}_{\\mathrm{0}}$. Now, $\\mathbf{r}_n=\\mathbf{y}_n$ and $\\mathbf{r}_m=\\mathrm{sgn}(\\mathbf{y}_m)$. Applying \\eqref{equ:lemma_1} we obtain\n\n", "itemtype": "equation", "pos": 67077, "prevtext": "\nFurther, we introduce a series of matrices $\\bm{\\Theta}_{nm}$, $n,m\\in\\mathbb{N}_{\\mathrm{0}}$, of which $\\bm{\\Theta}_{nm}$ corresponds to the correlation coefficient matrix between $\\mathbf{y}_n$ and $\\mathbf{y}_m$, with its $(p,q)$-th element given by\n\\begin{eqnarray}\n(\\bm{\\Theta}_{nm})_{pq}=\\frac{(\\mathbf{Y}_{nm})_{pq}}{\\sqrt{(\\mathbf{Y}_{nn})_{pp}}\\sqrt{(\\mathbf{Y}_{mm})_{qq}}},\\ \\ p,q\\in\\mathbb{Q}.\n\\label{equ:equ_6}\n\\end{eqnarray}\nDue to the mixed nature of $\\mathbf{r}$, the computation of $\\mathbf{R}_{nm}$ for different $(n,m)$ may follow different routes, and therefore in the following, we need to evaluate them case by case.\n\nCase 1: $n,m\\in\\mathbb{N}_{\\mathrm{1}}$. In this case, $\\mathbf{r}_n=\\mathbf{y}_n$, $\\mathbf{r}_m=\\mathbf{y}_m$, and thus we have\n\n", "index": 97, "text": "\\begin{equation}\n\\mathbf{R}_{nm}=\\mathbf{Y}_{nm}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E49.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{R}_{nm}=\\mathbf{Y}_{nm}.\" display=\"block\"><mrow><mrow><msub><mi>𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>=</mo><msub><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nCase 4: $n\\in\\mathbb{N}_{\\mathrm{0}}$ and $m\\in\\mathbb{N}_{\\mathrm{1}}$. This last case is similar to the former one, and with some manipulation we find out that\n\n", "itemtype": "equation", "pos": 67778, "prevtext": "\n\nCase 2: $n,m\\in\\mathbb{N}_{\\mathrm{0}}$. In this situation, $\\mathbf{r}_n=\\mathrm{sgn}(\\mathbf{y}_n)$ and $\\mathbf{r}_m=\\mathrm{sgn}(\\mathbf{y}_m)$. Exploiting \\eqref{equ:lemma_2} we get\n\\begin{eqnarray}\n(\\mathbf{R}_{nm})_{pq}&=&\\mathbb{E}[\\mathrm{sgn}(y_{np})\\mathrm{sgn}^{\\dag}(y_{mq})]\\nonumber\\\\\n&=&\\frac{2}{\\pi}[\\arcsin((\\bm{\\Theta}_{nm})_{pq,\\mathrm{R}})+j\\arcsin((\\bm{\\Theta}_{nm})_{pq,\\mathrm{I}})].\n\\label{equ:equ_11}\n\\end{eqnarray}\n\nCase 3: $n\\in\\mathbb{N}_{\\mathrm{1}}$ and $m\\in\\mathbb{N}_{\\mathrm{0}}$. Now, $\\mathbf{r}_n=\\mathbf{y}_n$ and $\\mathbf{r}_m=\\mathrm{sgn}(\\mathbf{y}_m)$. Applying \\eqref{equ:lemma_1} we obtain\n\n", "index": 99, "text": "\\begin{equation}\n(\\mathbf{R}_{nm})_{pq}=\\mathbb{E}[\\mathrm{sgn}^{\\dag}(y_{mq})y_{np}]=(\\mathbf{Y}_{nm})_{pq}\\sqrt{\\frac{2}{\\pi(\\mathbf{Y}_{mm})_{qq}}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E50.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{R}_{nm})_{pq}=\\mathbb{E}[\\mathrm{sgn}^{{\\dagger}}(y_{mq})y_{np}]=(%&#10;\\mathbf{Y}_{nm})_{pq}\\sqrt{\\frac{2}{\\pi(\\mathbf{Y}_{mm})_{qq}}}.\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>sgn</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>y</mi><mrow><mi>m</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>⁢</mo><msqrt><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐘</mi><mrow><mi>m</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>q</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mrow></mfrac></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nIn summary, we numerate $\\mathbf{R}_{nm}$ for different kinds of $(n,m)$ in the above. Combining them with \\eqref{equ:equ_8}, we are able to obtain the matrix $\\mathbf{D}$ and further evaluate $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ according to \\eqref{equ:prop_1.2}. Thus we conclude the proof.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_1}}\n\\label{subsect:corollary_1}\nWhen $\\bm{\\delta}=\\mathbf{1}_Q$, we have $\\mathbf{g}=\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}^*$ and, on the other hand, $\\mathbf{R}_{nm}=\\mathbf{Y}_{nm}$, for any $n,m\\in\\mathbb{N}$. As a result,\n\n", "itemtype": "equation", "pos": 68108, "prevtext": "\n\nCase 4: $n\\in\\mathbb{N}_{\\mathrm{0}}$ and $m\\in\\mathbb{N}_{\\mathrm{1}}$. This last case is similar to the former one, and with some manipulation we find out that\n\n", "index": 101, "text": "\\begin{equation}\n(\\mathbf{R}_{nm})_{pq}=\\mathbb{E}[\\mathrm{sgn}(y_{np})y_{mq}^{\\dag}]=(\\mathbf{Y}_{nm})_{pq}\\sqrt{\\frac{2}{\\pi(\\mathbf{Y}_{nn})_{pp}}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E51.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{R}_{nm})_{pq}=\\mathbb{E}[\\mathrm{sgn}(y_{np})y_{mq}^{{\\dagger}}]=(%&#10;\\mathbf{Y}_{nm})_{pq}\\sqrt{\\frac{2}{\\pi(\\mathbf{Y}_{nn})_{pp}}}.\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><mi>𝔼</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>sgn</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>y</mi><mrow><mi>n</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>y</mi><mrow><mi>m</mi><mo>⁢</mo><mi>q</mi></mrow><mo>†</mo></msubsup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>⁢</mo><msqrt><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐘</mi><mrow><mi>n</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mrow></mfrac></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nare all diagonal matrices, thus making $\\mathbf{D}_{nm}$ exactly equal $\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag}$, for any $n,m\\in\\mathbb{N}$. Letting $\\bm{\\Lambda}\\triangleq[\\bm{\\Lambda}_1,...,\\bm{\\Lambda}_N]$, we have $\\mathbf{D}$ in this situation given as\n\n", "itemtype": "equation", "pos": 68850, "prevtext": "\n\nIn summary, we numerate $\\mathbf{R}_{nm}$ for different kinds of $(n,m)$ in the above. Combining them with \\eqref{equ:equ_8}, we are able to obtain the matrix $\\mathbf{D}$ and further evaluate $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ according to \\eqref{equ:prop_1.2}. Thus we conclude the proof.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_1}}\n\\label{subsect:corollary_1}\nWhen $\\bm{\\delta}=\\mathbf{1}_Q$, we have $\\mathbf{g}=\\mathcal{E}_{\\mathrm{s}}\\bm{\\lambda}^*$ and, on the other hand, $\\mathbf{R}_{nm}=\\mathbf{Y}_{nm}$, for any $n,m\\in\\mathbb{N}$. As a result,\n\n", "index": 103, "text": "\\begin{equation}\n\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag}=\n\\begin{cases}\n\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}_n\\bm{\\Lambda}_n^{\\dag},\\ \\ &n=m,\\\\\n\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}_n\\bm{\\Lambda}_m^{\\dag},\\ \\ &n\\neq m,\n\\end{cases}\n\\label{equ:equ_10}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E52.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{{\\dagger}}=\\begin{cases}\\mathbf{I}_{Q}+%&#10;\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}_{n}\\bm{\\Lambda}_{n}^{{\\dagger}},&amp;n=m,\\\\&#10;\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}_{n}\\bm{\\Lambda}_{m}^{{\\dagger}},&amp;n\\neq m,%&#10;\\end{cases}\" display=\"block\"><mrow><mrow><msub><mi>𝐅𝐑</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup></mrow><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>𝐈</mi><mi>Q</mi></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mi>𝚲</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝚲</mi><mi>n</mi><mo>†</mo></msubsup></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>n</mi><mo>=</mo><mi>m</mi></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msub><mi>𝚲</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>𝚲</mi><mi>m</mi><mo>†</mo></msubsup></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>n</mi><mo>≠</mo><mi>m</mi></mrow><mo>,</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThen, exploiting Woodbury formula \\cite{horn2012matrix}, we get its inversion as follows\n\n", "itemtype": "equation", "pos": 69392, "prevtext": "\nare all diagonal matrices, thus making $\\mathbf{D}_{nm}$ exactly equal $\\mathbf{F}\\mathbf{R}_{nm}\\mathbf{F}^{\\dag}$, for any $n,m\\in\\mathbb{N}$. Letting $\\bm{\\Lambda}\\triangleq[\\bm{\\Lambda}_1,...,\\bm{\\Lambda}_N]$, we have $\\mathbf{D}$ in this situation given as\n\n", "index": 105, "text": "\\begin{equation}\n\\mathbf{D}=\\mathbf{I}_{NQ}+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}^{\\dag}\\bm{\\Lambda}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E53.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{D}=\\mathbf{I}_{NQ}+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}^{{\\dagger}}\\bm%&#10;{\\Lambda}.\" display=\"block\"><mrow><mrow><mi>𝐃</mi><mo>=</mo><mrow><msub><mi>𝐈</mi><mrow><mi>N</mi><mo>⁢</mo><mi>Q</mi></mrow></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msup><mi>𝚲</mi><mo>†</mo></msup><mo>⁢</mo><mi>𝚲</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nParticularly, $(\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{\\dag})^{-1}$ turns out to be a diagonal matrix; that is\n\n", "itemtype": "equation", "pos": 69597, "prevtext": "\nThen, exploiting Woodbury formula \\cite{horn2012matrix}, we get its inversion as follows\n\n", "index": 107, "text": "\\begin{equation}\n\\mathbf{D}^{-1}=\\mathbf{I}_{NQ}-\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}^{\\dag}\\left(\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{\\dag}\\right)^{-1}\\bm{\\Lambda}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E54.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{D}^{-1}=\\mathbf{I}_{NQ}-\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}^{{\\dagger%&#10;}}\\left(\\mathbf{I}_{Q}+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{{%&#10;\\dagger}}\\right)^{-1}\\bm{\\Lambda}.\" display=\"block\"><mrow><mrow><msup><mi>𝐃</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>=</mo><mrow><msub><mi>𝐈</mi><mrow><mi>N</mi><mo>⁢</mo><mi>Q</mi></mrow></msub><mo>-</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><msup><mi>𝚲</mi><mo>†</mo></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msub><mi>𝐈</mi><mi>Q</mi></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mi>𝚲</mi><mo>⁢</mo><msup><mi>𝚲</mi><mo>†</mo></msup></mrow></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝚲</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nMoreover, it is easy to verify that $\\bm{\\Lambda}\\bm{\\lambda}^*$ in this situation is\n\n", "itemtype": "equation", "pos": 69939, "prevtext": "\nParticularly, $(\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{\\dag})^{-1}$ turns out to be a diagonal matrix; that is\n\n", "index": 109, "text": "\\begin{equation}\n\\left(\\mathbf{I}_Q+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{\\dag}\\right)^{-1}=\n\\begin{pmatrix}\n\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{n1}|^2} & 0 & \\cdots & 0 \\\\\n0 & \\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{n2}|^2} & \\cdots & 0 \\\\\n\\vdots & \\vdots & \\ddots & \\vdots \\\\\n0 & 0 & \\cdots & \\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{nQ}|^2}\n\\end{pmatrix}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E55.m1\" class=\"ltx_Math\" alttext=\"\\left(\\mathbf{I}_{Q}+\\mathcal{E}_{\\mathrm{s}}\\bm{\\Lambda}\\bm{\\Lambda}^{{%&#10;\\dagger}}\\right)^{-1}=\\begin{pmatrix}\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{%&#10;n=1}^{N}|\\lambda_{n1}|^{2}}&amp;0&amp;\\cdots&amp;0\\\\&#10;0&amp;\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{n2}|^{2}}&amp;\\cdots&amp;%&#10;0\\\\&#10;\\vdots&amp;\\vdots&amp;\\ddots&amp;\\vdots\\\\&#10;0&amp;0&amp;\\cdots&amp;\\frac{1}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{nQ}|^{2}%&#10;}\\end{pmatrix}.\" display=\"block\"><mrow><mrow><msup><mrow><mo>(</mo><mrow><msub><mi>𝐈</mi><mi>Q</mi></msub><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mi>𝚲</mi><mo>⁢</mo><msup><mi>𝚲</mi><mo>†</mo></msup></mrow></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>=</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup></mstyle><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mn>1</mn></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mstyle></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup></mstyle><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mn>2</mn></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mstyle></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋱</mi></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋮</mi></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mi mathvariant=\"normal\">⋯</mi></mtd><mtd columnalign=\"center\"><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"false\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup></mstyle><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>Q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mstyle></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nThen with all the above results and some further manipulations, we arrive at\n\n", "itemtype": "equation", "pos": 70471, "prevtext": "\nMoreover, it is easy to verify that $\\bm{\\Lambda}\\bm{\\lambda}^*$ in this situation is\n\n", "index": 111, "text": "\\begin{equation}\n\\bm{\\Lambda}\\bm{\\lambda}^*=\\left[\\sum_{n=1}^N|\\lambda_{n1}|^2,...,\\sum_{n=1}^N|\\lambda_{nQ}|^2\\right]^t.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E56.m1\" class=\"ltx_Math\" alttext=\"\\bm{\\Lambda}\\bm{\\lambda}^{*}=\\left[\\sum_{n=1}^{N}|\\lambda_{n1}|^{2},...,\\sum_{%&#10;n=1}^{N}|\\lambda_{nQ}|^{2}\\right]^{t}.\" display=\"block\"><mrow><mrow><mrow><mi>𝚲</mi><mo>⁢</mo><msup><mi>𝝀</mi><mo>*</mo></msup></mrow><mo>=</mo><msup><mrow><mo>[</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mn>1</mn></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>Q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>]</mo></mrow><mi>t</mi></msup></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nand then, it is straightforward to verify \\eqref{equ:equ_7}.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_2}}\n\\label{subsect:corollary_2}\nWhen $T=1$, we simply use $h_n$ to denote the channel coefficient corresponding to the $n$-th BS antenna. In this situation, the circulant matrix $\\mathbf{C}_n$ reduces to a scaled identity matrix $h_n\\mathbf{I}_Q$ and the diagonal matrix $\\bm{\\Lambda}_n$ turns out to be $\\bm{\\Lambda}_n=\\mathbf{F}\\mathbf{C}_n\\mathbf{F}^{\\dag}=h_n\\mathbf{I}_Q$. As a result, $\\mathbf{g}_n$ in \\eqref{equ:equ_15} becomes\n\n", "itemtype": "equation", "pos": 70685, "prevtext": "\nThen with all the above results and some further manipulations, we arrive at\n\n", "index": 113, "text": "\\begin{equation}\n\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}\\mathbf{g}^{\\dag}\\mathbf{D}^{-1}\\mathbf{g}\n=\\frac{1}{Q}\\sum_{q=1}^Q\\frac{\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^N|\\lambda_{nq}|^2}{1+\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^N|\\lambda_{nq}|^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E57.m1\" class=\"ltx_Math\" alttext=\"\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})=\\frac{1}{Q\\mathcal{E}_{\\mathrm{s%&#10;}}}\\mathbf{g}^{{\\dagger}}\\mathbf{D}^{-1}\\mathbf{g}=\\frac{1}{Q}\\sum_{q=1}^{Q}%&#10;\\frac{\\mathcal{E}_{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{nq}|^{2}}{1+\\mathcal{E}_%&#10;{\\mathrm{s}}\\sum_{n=1}^{N}|\\lambda_{nq}|^{2}},\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐰</mi><mi>opt</mi></msub><mo>,</mo><mi>𝜹</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>Q</mi><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac><mo>⁢</mo><msup><mi>𝐠</mi><mo>†</mo></msup><mo>⁢</mo><msup><mi>𝐃</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mi>𝐠</mi></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>Q</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>q</mi><mo>=</mo><mn>1</mn></mrow><mi>Q</mi></munderover><mfrac><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>λ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nIf we let $\\bm{\\nu}\\in\\mathbb{C}^{N\\times 1}$ collect the coefficients before $\\mathbf{1}_Q$, i.e.,\n\n", "itemtype": "equation", "pos": 71524, "prevtext": "\nand then, it is straightforward to verify \\eqref{equ:equ_7}.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_2}}\n\\label{subsect:corollary_2}\nWhen $T=1$, we simply use $h_n$ to denote the channel coefficient corresponding to the $n$-th BS antenna. In this situation, the circulant matrix $\\mathbf{C}_n$ reduces to a scaled identity matrix $h_n\\mathbf{I}_Q$ and the diagonal matrix $\\bm{\\Lambda}_n$ turns out to be $\\bm{\\Lambda}_n=\\mathbf{F}\\mathbf{C}_n\\mathbf{F}^{\\dag}=h_n\\mathbf{I}_Q$. As a result, $\\mathbf{g}_n$ in \\eqref{equ:equ_15} becomes\n\n", "index": 115, "text": "\\begin{equation}\n\\mathbf{g}_n=h_n^*\\mathcal{E}_{\\mathrm{s}}\\left[\\delta_n+\\bar{\\delta}_n\\cdot\\sqrt{\\frac{2}{\\pi(|h_n|^2\\mathcal{E}_{\\mathrm{s}}+1)}}\\right]\\mathbf{1}_Q.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E58.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{g}_{n}=h_{n}^{*}\\mathcal{E}_{\\mathrm{s}}\\left[\\delta_{n}+\\bar{\\delta}_%&#10;{n}\\cdot\\sqrt{\\frac{2}{\\pi(|h_{n}|^{2}\\mathcal{E}_{\\mathrm{s}}+1)}}\\right]%&#10;\\mathbf{1}_{Q}.\" display=\"block\"><mrow><mrow><msub><mi>𝐠</mi><mi>n</mi></msub><mo>=</mo><mrow><msubsup><mi>h</mi><mi>n</mi><mo>*</mo></msubsup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><msqrt><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></msqrt></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mn>𝟏</mn><mi>Q</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nthen we have\n\n", "itemtype": "equation", "pos": 71808, "prevtext": "\nIf we let $\\bm{\\nu}\\in\\mathbb{C}^{N\\times 1}$ collect the coefficients before $\\mathbf{1}_Q$, i.e.,\n\n", "index": 117, "text": "\\begin{equation}\n(\\bm{\\nu})_n=h_n^*\\mathcal{E}_{\\mathrm{s}}\\left[\\delta_n+\\bar{\\delta}_n\\cdot\\sqrt{\\frac{2}{\\pi(|h_n|^2\\mathcal{E}_{\\mathrm{s}}+1)}}\\right],\\ \\ n\\in\\mathbb{N},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E59.m1\" class=\"ltx_Math\" alttext=\"(\\bm{\\nu})_{n}=h_{n}^{*}\\mathcal{E}_{\\mathrm{s}}\\left[\\delta_{n}+\\bar{\\delta}_%&#10;{n}\\cdot\\sqrt{\\frac{2}{\\pi(|h_{n}|^{2}\\mathcal{E}_{\\mathrm{s}}+1)}}\\right],\\ %&#10;\\ n\\in\\mathbb{N},\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mi>𝝂</mi><mo stretchy=\"false\">)</mo></mrow><mi>n</mi></msub><mo>=</mo><mrow><msubsup><mi>h</mi><mi>n</mi><mo>*</mo></msubsup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><msqrt><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></msqrt></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>n</mi><mo>∈</mo><mi>ℕ</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nwhere $\\otimes$ denotes right Kronecker product.\n\nAs for the matrix $\\mathbf{D}$, with patient examination we find out that each of its blocks, $\\mathbf{D}_{nm}$, is also a scaled identity matrix, for any $n,m\\in\\mathbb{N}$. Then letting $\\mathbf{E}\\in\\mathbb{C}^{N\\times N}$ collect the scaling factors before $\\mathbf{I}_Q$ we have\n\n", "itemtype": "equation", "pos": 72012, "prevtext": "\nthen we have\n\n", "index": 119, "text": "\\begin{equation}\n\\mathbf{g}=\\bm{\\nu}\\otimes\\mathbf{1}_Q,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E60.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{g}=\\bm{\\nu}\\otimes\\mathbf{1}_{Q},\" display=\"block\"><mrow><mrow><mi>𝐠</mi><mo>=</mo><mrow><mi>𝝂</mi><mo>⊗</mo><msub><mn>𝟏</mn><mi>Q</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nin which $\\mathbf{E}$ is given without detailed proof as\n\n", "itemtype": "equation", "pos": 72418, "prevtext": "\nwhere $\\otimes$ denotes right Kronecker product.\n\nAs for the matrix $\\mathbf{D}$, with patient examination we find out that each of its blocks, $\\mathbf{D}_{nm}$, is also a scaled identity matrix, for any $n,m\\in\\mathbb{N}$. Then letting $\\mathbf{E}\\in\\mathbb{C}^{N\\times N}$ collect the scaling factors before $\\mathbf{I}_Q$ we have\n\n", "index": 121, "text": "\\begin{equation}\n\\mathbf{D}=\\mathbf{E}\\otimes\\mathbf{I}_Q,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E61.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{D}=\\mathbf{E}\\otimes\\mathbf{I}_{Q},\" display=\"block\"><mrow><mrow><mi>𝐃</mi><mo>=</mo><mrow><mi>𝐄</mi><mo>⊗</mo><msub><mi>𝐈</mi><mi>Q</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nComparing $\\bm{\\nu}^*$ and $\\mathbf{E}^*$ with \\cite[Equ. (13) (14)]{liang2015mixed}, we notice that they are virtually the same except for some little differences due to the different definitions of $\\mathrm{sgn}(x)$.\n\nWe proceed by evaluating $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in this situation; that is\n\\begin{eqnarray}\n\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}\\otimes\\mathbf{1}_Q)^{\\dag}(\\mathbf{E}\\otimes\\mathbf{I}_Q)^{-1}(\\bm{\\nu}\\otimes\\mathbf{1}_Q)\\nonumber\\\\\n&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}^{\\dag}\\otimes\\mathbf{1}_Q^{\\dag})(\\mathbf{E}^{-1}\\otimes\\mathbf{I}_Q)(\\bm{\\nu}\\otimes\\mathbf{1}_Q)\\nonumber\\\\\n&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}^{\\dag}\\mathbf{E}^{-1}\\bm{\\nu})\\otimes(\\mathbf{1}_Q^{\\dag}\\mathbf{I}_Q\\mathbf{1}_Q)\n=\\frac{1}{\\mathcal{E}_{\\mathrm{s}}}\\bm{\\nu}^{\\dag}\\mathbf{E}^{-1}\\bm{\\nu}.\n\\end{eqnarray}\nThen we immediately find out that it is virtually the same as that we obtained for frequency-flat SIMO channels in \\cite[Prop. 3]{liang2015mixed}, and thus conclude the proof.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_3}}\n\\label{subsect:corollary_3}\nLetting $\\mathcal{E}_{\\mathrm{s}}$ tend to zero, we have\n\n", "itemtype": "equation", "pos": 72549, "prevtext": "\nin which $\\mathbf{E}$ is given without detailed proof as\n\n", "index": 123, "text": "\\begin{equation}\n(\\mathbf{E})_{nm}=\n\\begin{cases}\n1+\\delta_n\\cdot|h_n|^2\\mathcal{E}_{\\mathrm{s}}, & \\text{if}\\ n=m,\\\\\nh_n^* h_m\\mathcal{E}_\\mathrm{s}\\bigg[\\delta_n\\delta_m+\n\\delta_n\\bar{\\delta}_m\\cdot\\sqrt{\\frac{2}{\\pi(|h_m|^2\\mathcal{E}_\\mathrm{s}+1)}}+\\\\\n\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\bar{\\delta}_n\\delta_m\\cdot\\sqrt{\\frac{2}{\\pi(|h_n|^2\\mathcal{E}_\\mathrm{s}+1)}}\\bigg]+\\\\\n\\bar{\\delta}_n\\bar{\\delta}_m\\!\\cdot\\!\\frac{2}{\\pi}\\bigg[\n\\mathrm{arcsin}\\Big(\\frac{(h_n^*h_m)_{\\mathrm{R}}\\mathcal{E}_\\mathrm{s}}\n{\\sqrt{|h_n|^2\\mathcal{E}_\\mathrm{s}+1}\\sqrt{|h_m|^2\\mathcal{E}_\\mathrm{s}+1}}\\Big)+\\\\\n\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ j\\mathrm{arcsin}\\Big(\\frac{(h_n^*h_m)_{\\mathrm{I}}\\mathcal{E}_\\mathrm{s}}\n{\\sqrt{|h_n|^2\\mathcal{E}_\\mathrm{s}+1}\\sqrt{|h_m|^2\\mathcal{E}_\\mathrm{s}+1}}\\Big)\n\\bigg], & \\text{if}\\ n\\neq m.\n\\end{cases}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E62.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{E})_{nm}=\\begin{cases}1+\\delta_{n}\\cdot|h_{n}|^{2}\\mathcal{E}_{%&#10;\\mathrm{s}},&amp;\\text{if}\\ n=m,\\\\&#10;h_{n}^{*}h_{m}\\mathcal{E}_{\\mathrm{s}}\\bigg{[}\\delta_{n}\\delta_{m}+\\delta_{n}%&#10;\\bar{\\delta}_{m}\\cdot\\sqrt{\\frac{2}{\\pi(|h_{m}|^{2}\\mathcal{E}_{\\mathrm{s}}+1)%&#10;}}+\\\\&#10;\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\bar{\\delta}_{n}\\delta_{m}\\cdot\\sqrt{\\frac{2}{\\pi(|h_{n}|^%&#10;{2}\\mathcal{E}_{\\mathrm{s}}+1)}}\\bigg{]}+\\\\&#10;\\bar{\\delta}_{n}\\bar{\\delta}_{m}\\!\\cdot\\!\\frac{2}{\\pi}\\bigg{[}\\mathrm{arcsin}%&#10;\\Big{(}\\frac{(h_{n}^{*}h_{m})_{\\mathrm{R}}\\mathcal{E}_{\\mathrm{s}}}{\\sqrt{|h_{%&#10;n}|^{2}\\mathcal{E}_{\\mathrm{s}}+1}\\sqrt{|h_{m}|^{2}\\mathcal{E}_{\\mathrm{s}}+1}%&#10;}\\Big{)}+\\\\&#10;\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ j\\mathrm{arcsin}\\Big{(}\\frac{(h_{n}^{*}h_{m})_{\\mathrm{I}}%&#10;\\mathcal{E}_{\\mathrm{s}}}{\\sqrt{|h_{n}|^{2}\\mathcal{E}_{\\mathrm{s}}+1}\\sqrt{|h%&#10;_{m}|^{2}\\mathcal{E}_{\\mathrm{s}}+1}}\\Big{)}\\bigg{]},&amp;\\text{if}\\ n\\neq m.\\end{cases}\" display=\"block\"><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mi>𝐄</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mn>1</mn><mo>+</mo><mrow><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>⋅</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mpadded width=\"+5pt\"><mtext>if</mtext></mpadded><mo>⁢</mo><mi>n</mi></mrow><mo>=</mo><mi>m</mi></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><msubsup><mi>h</mi><mi>n</mi><mo>*</mo></msubsup><msub><mi>h</mi><mi>m</mi></msub><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><msub><mi>δ</mi><mi>n</mi></msub><msub><mi>δ</mi><mi>m</mi></msub><mo>+</mo><msub><mi>δ</mi><mi>n</mi></msub><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>m</mi></msub><mo>⋅</mo><msqrt><mstyle displaystyle=\"false\"><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>m</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></msqrt><mo>+</mo></mrow></mrow></mtd><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><msub><mpadded lspace=\"50pt\" width=\"+50pt\"><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover></mpadded><mi>n</mi></msub><msub><mi>δ</mi><mi>m</mi></msub><mo>⋅</mo><msqrt><mstyle displaystyle=\"false\"><mfrac><mn>2</mn><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></msqrt><mo maxsize=\"210%\" minsize=\"210%\">]</mo><mo>+</mo></mrow></mtd><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mpadded width=\"-1.7pt\"><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>m</mi></msub></mpadded><mo rspace=\"0.8pt\">⋅</mo><mstyle displaystyle=\"false\"><mfrac><mn>2</mn><mi>π</mi></mfrac></mstyle><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mi>arcsin</mi><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mstyle displaystyle=\"false\"><mfrac><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>h</mi><mi>n</mi><mo>*</mo></msubsup><mo>⁢</mo><msub><mi>h</mi><mi>m</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">R</mi></msub><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mrow><msqrt><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></msqrt><mo>⁢</mo><msqrt><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>m</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></msqrt></mrow></mfrac></mstyle><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mo>+</mo></mrow></mrow></mtd><mtd/></mtr><mtr><mtd columnalign=\"left\"><mrow><mpadded lspace=\"50pt\" width=\"+50pt\"><mi>j</mi></mpadded><mi>arcsin</mi><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mstyle displaystyle=\"false\"><mfrac><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>h</mi><mi>n</mi><mo>*</mo></msubsup><mo>⁢</mo><msub><mi>h</mi><mi>m</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">I</mi></msub><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mrow><msqrt><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>n</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></msqrt><mo>⁢</mo><msqrt><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>h</mi><mi>m</mi></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></msqrt></mrow></mfrac></mstyle><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mpadded width=\"+5pt\"><mtext>if</mtext></mpadded><mo>⁢</mo><mi>n</mi></mrow><mo>≠</mo><mi>m</mi></mrow><mo>.</mo></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nTo simplify the invertible block matrix $\\mathbf{D}$, we need to examine each of its blocks. First let us look at an arbitrary nondiagonal block, e.g., $\\mathbf{D}_{nm}$ with $n\\neq m\\in\\mathbb{N}$. From \\eqref{equ:equ_9}, we observe that $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0} \\mathbf{Y}_{nm}=\\mathbf{O}_{Q}$, for any $n\\neq m$, and on the other hand, $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0} \\mathbf{Y}_{nn}=\\mathbf{I}_Q$. As a result, $\\mathbf{R}_{nm}$ for $n\\neq m$ always approaches a zero matrix no matter which case it falls into, and consequently $\\mathbf{F}^{\\dag}\\mathbf{R}_{nm}\\mathbf{F}$ tends to be a zero matrix as well, since the unitary transformation $\\mathbf{F}$ does not change the Frobenius norm of a matrix. In summary,\n\n", "itemtype": "equation", "pos": 74590, "prevtext": "\nComparing $\\bm{\\nu}^*$ and $\\mathbf{E}^*$ with \\cite[Equ. (13) (14)]{liang2015mixed}, we notice that they are virtually the same except for some little differences due to the different definitions of $\\mathrm{sgn}(x)$.\n\nWe proceed by evaluating $\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})$ in this situation; that is\n\\begin{eqnarray}\n\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}\\otimes\\mathbf{1}_Q)^{\\dag}(\\mathbf{E}\\otimes\\mathbf{I}_Q)^{-1}(\\bm{\\nu}\\otimes\\mathbf{1}_Q)\\nonumber\\\\\n&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}^{\\dag}\\otimes\\mathbf{1}_Q^{\\dag})(\\mathbf{E}^{-1}\\otimes\\mathbf{I}_Q)(\\bm{\\nu}\\otimes\\mathbf{1}_Q)\\nonumber\\\\\n&=&\\frac{1}{Q\\mathcal{E}_{\\mathrm{s}}}(\\bm{\\nu}^{\\dag}\\mathbf{E}^{-1}\\bm{\\nu})\\otimes(\\mathbf{1}_Q^{\\dag}\\mathbf{I}_Q\\mathbf{1}_Q)\n=\\frac{1}{\\mathcal{E}_{\\mathrm{s}}}\\bm{\\nu}^{\\dag}\\mathbf{E}^{-1}\\bm{\\nu}.\n\\end{eqnarray}\nThen we immediately find out that it is virtually the same as that we obtained for frequency-flat SIMO channels in \\cite[Prop. 3]{liang2015mixed}, and thus conclude the proof.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_3}}\n\\label{subsect:corollary_3}\nLetting $\\mathcal{E}_{\\mathrm{s}}$ tend to zero, we have\n\n", "index": 125, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}_n}{\\mathcal{E}_{\\mathrm{s}}}=\\left(\\delta_n+\\bar{\\delta}_n\\cdot\\frac{2}{\\pi}\\right)\\bm{\\lambda}_n^*.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E63.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}_{n}}{\\mathcal{E}_%&#10;{\\mathrm{s}}}=\\left(\\delta_{n}+\\bar{\\delta}_{n}\\cdot\\frac{2}{\\pi}\\right)\\bm{%&#10;\\lambda}_{n}^{*}.\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mn>0</mn></mrow></munder><mo>⁡</mo><mfrac><msub><mi>𝐠</mi><mi>n</mi></msub><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></mfrac></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mrow><msub><mi>δ</mi><mi>n</mi></msub><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>δ</mi><mo stretchy=\"false\">¯</mo></mover><mi>n</mi></msub><mo>⋅</mo><mfrac><mn>2</mn><mi>π</mi></mfrac></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nFor the diagonal blocks, if $n\\in\\mathbb{N}_{\\mathrm{1}}$, we have $\\mathbf{R}_{nn}=\\mathbf{Y}_{nn}$, and from \\eqref{equ:equ_10} it is obvious that\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{F}^{\\dag}\\mathbf{R}_{nn}\\mathbf{F}=\\mathbf{I}_Q$.\nIn other word, we have\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nn}=\\mathbf{I}_Q$, for any $n\\in\\mathbb{N}_{\\mathrm{1}}$.\nIf $n\\in\\mathbb{N}_{\\mathrm{0}}$, on the other hand, from \\eqref{equ:equ_9} and \\eqref{equ:equ_6} we obtain\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\bm{\\Theta}_{nn}=\\mathbf{I}_Q$.\nThen, applying \\eqref{equ:equ_11} it is straightforward to verify that\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{R}_{nn}=\\mathbf{I}_Q$.\nAgain, we have $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nn}=\\mathbf{I}_Q$, for any $n\\in\\mathbb{N}_{\\mathrm{0}}$. In summary,\n\n", "itemtype": "equation", "pos": 75538, "prevtext": "\n\nTo simplify the invertible block matrix $\\mathbf{D}$, we need to examine each of its blocks. First let us look at an arbitrary nondiagonal block, e.g., $\\mathbf{D}_{nm}$ with $n\\neq m\\in\\mathbb{N}$. From \\eqref{equ:equ_9}, we observe that $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0} \\mathbf{Y}_{nm}=\\mathbf{O}_{Q}$, for any $n\\neq m$, and on the other hand, $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0} \\mathbf{Y}_{nn}=\\mathbf{I}_Q$. As a result, $\\mathbf{R}_{nm}$ for $n\\neq m$ always approaches a zero matrix no matter which case it falls into, and consequently $\\mathbf{F}^{\\dag}\\mathbf{R}_{nm}\\mathbf{F}$ tends to be a zero matrix as well, since the unitary transformation $\\mathbf{F}$ does not change the Frobenius norm of a matrix. In summary,\n\n", "index": 127, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nm}=\\mathbf{O}_{Q},\\ \\ \\forall\\ n\\neq m\\in\\mathbb{N}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E64.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nm}=\\mathbf{O}_{Q},\\ %&#10;\\ \\forall\\ n\\neq m\\in\\mathbb{N}.\" display=\"block\"><mrow><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mn>0</mn></mrow></munder><mo>⁡</mo><msub><mi>𝐃</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>=</mo><msub><mi>𝐎</mi><mi>Q</mi></msub></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mo rspace=\"7.5pt\">∀</mo><mi>n</mi></mrow><mo>≠</mo><mi>m</mi><mo>∈</mo><mi>ℕ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nWith all the above results, we have\n\\begin{eqnarray}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}{\\mathcal{E}_{\\mathrm{s}}}\n&=&\\frac{1}{Q}\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\n\\left(\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\mathbf{D}^{-1}\n\\left(\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&\\overset{(a)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}^{-1}\\right)\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&\\overset{(b)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}\\right)^{-1}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&=&\\frac{1}{Q}\\sum_{n=1}^N\\left(\\delta_n+\\bar{\\delta}_n\\cdot\\frac{2}{\\pi}\\right)\\|\\bm{\\lambda}_n\\|^2,\n\\end{eqnarray}\nwhere (a) is obtained by applying the algebraic limit theorem since the limits of $\\mathbf{g}/\\mathcal{E}_{\\mathrm{s}}$ and $\\mathbf{D}^{-1}$ exist, and (b) comes from the fact that the inverse of a nonsingular matrix is a continuous function of the elements of the matrix, i.e., $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}^{-1}=(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D})^{-1}$ \\cite{stewart1969continuity}. Noting that $\\log(1+x/(1-x))=x+o(x)$, as $x\\rightarrow 0$, we immediately have \\eqref{equ:equ_12}.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_4}}\n\\label{subsect:corollary_4}\nFor the special case of $\\bm{\\delta}=\\mathbf{0}$, when $\\mathcal{E}_{\\mathrm{s}}$ grows without bound we have\n\n", "itemtype": "equation", "pos": 76545, "prevtext": "\n\nFor the diagonal blocks, if $n\\in\\mathbb{N}_{\\mathrm{1}}$, we have $\\mathbf{R}_{nn}=\\mathbf{Y}_{nn}$, and from \\eqref{equ:equ_10} it is obvious that\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{F}^{\\dag}\\mathbf{R}_{nn}\\mathbf{F}=\\mathbf{I}_Q$.\nIn other word, we have\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nn}=\\mathbf{I}_Q$, for any $n\\in\\mathbb{N}_{\\mathrm{1}}$.\nIf $n\\in\\mathbb{N}_{\\mathrm{0}}$, on the other hand, from \\eqref{equ:equ_9} and \\eqref{equ:equ_6} we obtain\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\bm{\\Theta}_{nn}=\\mathbf{I}_Q$.\nThen, applying \\eqref{equ:equ_11} it is straightforward to verify that\n$\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{R}_{nn}=\\mathbf{I}_Q$.\nAgain, we have $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}_{nn}=\\mathbf{I}_Q$, for any $n\\in\\mathbb{N}_{\\mathrm{0}}$. In summary,\n\n", "index": 129, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}=\\mathbf{I}_{NQ}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E65.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}=\\mathbf{I}_{NQ}.\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mn>0</mn></mrow></munder><mo>⁡</mo><mi>𝐃</mi></mrow><mo>=</mo><msub><mi>𝐈</mi><mrow><mi>N</mi><mo>⁢</mo><mi>Q</mi></mrow></msub></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nFor expositional concision, we denote the normalization of $\\bm{\\lambda}_n$ by $\\bar{\\bm{\\lambda}}_n\\triangleq\\bm{\\lambda}_n/\\|\\bm{\\lambda}_n\\|$, and accordingly $\\bar{\\bm{\\lambda}}\\triangleq[\\bar{\\bm{\\lambda}}_1^t,...,\\bar{\\bm{\\lambda}}_N^t]^t$. As a result, $\\mathbf{g}/\\sqrt{\\mathcal{E}_{\\mathrm{s}}}$ in this situation approaches\n\n", "itemtype": "equation", "pos": 78514, "prevtext": "\n\nWith all the above results, we have\n\\begin{eqnarray}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})}{\\mathcal{E}_{\\mathrm{s}}}\n&=&\\frac{1}{Q}\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\n\\left(\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\mathbf{D}^{-1}\n\\left(\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&\\overset{(a)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}^{-1}\\right)\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&\\overset{(b)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)^{\\dag}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}\\right)^{-1}\n\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\frac{\\mathbf{g}}{\\mathcal{E}_{\\mathrm{s}}}\\right)\\nonumber\\\\\n&=&\\frac{1}{Q}\\sum_{n=1}^N\\left(\\delta_n+\\bar{\\delta}_n\\cdot\\frac{2}{\\pi}\\right)\\|\\bm{\\lambda}_n\\|^2,\n\\end{eqnarray}\nwhere (a) is obtained by applying the algebraic limit theorem since the limits of $\\mathbf{g}/\\mathcal{E}_{\\mathrm{s}}$ and $\\mathbf{D}^{-1}$ exist, and (b) comes from the fact that the inverse of a nonsingular matrix is a continuous function of the elements of the matrix, i.e., $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D}^{-1}=(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow 0}\\mathbf{D})^{-1}$ \\cite{stewart1969continuity}. Noting that $\\log(1+x/(1-x))=x+o(x)$, as $x\\rightarrow 0$, we immediately have \\eqref{equ:equ_12}.\n\n\\subsection{Proof of Corollary \\ref{cor:cor_4}}\n\\label{subsect:corollary_4}\nFor the special case of $\\bm{\\delta}=\\mathbf{0}$, when $\\mathcal{E}_{\\mathrm{s}}$ grows without bound we have\n\n", "index": 131, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}_n}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}=\\sqrt{\\frac{2Q}{\\pi}}\\frac{\\bm{\\lambda}_n^*}{\\|\\bm{\\lambda}_n\\|}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E66.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}_{n}}{\\sqrt{%&#10;\\mathcal{E}_{\\mathrm{s}}}}=\\sqrt{\\frac{2Q}{\\pi}}\\frac{\\bm{\\lambda}_{n}^{*}}{\\|%&#10;\\bm{\\lambda}_{n}\\|}.\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><msub><mi>𝐠</mi><mi>n</mi></msub><msqrt><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></msqrt></mfrac></mrow><mo>=</mo><mrow><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>Q</mi></mrow><mi>π</mi></mfrac></msqrt><mo>⁢</mo><mfrac><msubsup><mi>𝝀</mi><mi>n</mi><mo>*</mo></msubsup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\n\nOn the other hand, $\\mathbf{D}_{nm}$ in this situation is given by the combination of \\eqref{equ:equ_8}, \\eqref{equ:equ_6} and \\eqref{equ:equ_11}, for any $n,m\\in\\mathbb{N}$. Particularly, as $\\mathcal{E}_{\\mathrm{s}}$ tends to infinity we have\n\n", "itemtype": "equation", "pos": 79047, "prevtext": "\nFor expositional concision, we denote the normalization of $\\bm{\\lambda}_n$ by $\\bar{\\bm{\\lambda}}_n\\triangleq\\bm{\\lambda}_n/\\|\\bm{\\lambda}_n\\|$, and accordingly $\\bar{\\bm{\\lambda}}\\triangleq[\\bar{\\bm{\\lambda}}_1^t,...,\\bar{\\bm{\\lambda}}_N^t]^t$. As a result, $\\mathbf{g}/\\sqrt{\\mathcal{E}_{\\mathrm{s}}}$ in this situation approaches\n\n", "index": 133, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}=\\sqrt{\\frac{2Q}{\\pi}}\\bar{\\bm{\\lambda}}^*.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E67.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{%&#10;\\mathcal{E}_{\\mathrm{s}}}}=\\sqrt{\\frac{2Q}{\\pi}}\\bar{\\bm{\\lambda}}^{*}.\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><mi>𝐠</mi><msqrt><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub></msqrt></mfrac></mrow><mo>=</mo><mrow><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>Q</mi></mrow><mi>π</mi></mfrac></msqrt><mo>⁢</mo><msup><mover accent=\"true\"><mi>𝝀</mi><mo stretchy=\"false\">¯</mo></mover><mo>*</mo></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02082.tex", "nexttext": "\nDenoting the induced $\\mathbf{D}_{nm}$ as $\\bar{\\mathbf{D}}_{nm}$, and further the induced $\\mathbf{D}$ as $\\bar{\\mathbf{D}}$, where $\\bar{\\mathbf{D}}_{nm}$ is given by \\eqref{equ:equ_8}, \\eqref{equ:equ_11} and \\eqref{equ:equ_13}, we arrive at\n\\begin{eqnarray}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\Delta(\\mathbf{w}_{\\mathrm{opt}},\\bm{\\delta})\n&=&\\frac{1}{Q}\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\left(\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)^{\\dag}\\mathbf{D}^{-1}\\left(\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)\\nonumber\\\\\n&\\overset{(a)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)^{\\dag}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D}^{-1}\\right)\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)\\nonumber\\\\\n&\\overset{(b)}{=}&\\frac{1}{Q}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)^{\\dag}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D}\\right)^{-1}\\left(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\frac{\\mathbf{g}}{\\sqrt{\\mathcal{E}_{\\mathrm{s}}}}\\right)\\nonumber\\\\\n&=&\\frac{2}{\\pi}\\bar{\\bm{\\lambda}}^t\\bar{\\mathbf{D}}^{-1}\\bar{\\bm{\\lambda}}^*,\n\\end{eqnarray}\nwhere (a) is obtained by applying the algebraic limit theorem since the limits of $\\mathbf{g}/\\sqrt{\\mathcal{E}_{\\mathrm{s}}}$ and $\\mathbf{D}^{-1}$ exist, and (b) comes from the fact that the inverse of a nonsingular matrix is a continuous function of the elements of the matrix, i.e., $\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D}^{-1}=(\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\mathbf{D})^{-1}$ \\cite{stewart1969continuity}.\n\n\\begin{thebibliography}{1}\n\\bibitem{marzetta2010noncooperative}\nT. L. Marzetta, ``Noncooperative cellular wireless with unlimited numbers of base station antennas,\" \\emph{IEEE Trans. Wireless Commun.}, vol. 9, no. 11, pp. 3590-3600, 2010.\n\n\\bibitem{larsson2014massive}\nE. G. Larsson, O. Edfors, F. Tufvesson, and T. L. Marzetta, ``Massive MIMO for next generation wireless systems,\" \\emph{IEEE Commun. Mag.}, vol. 52, no. 2, pp. 186-195, 2014.\n\n\\bibitem{andrews2014will}\nJ. G. Andrews, S. Buzzi, W. Choi, S. V. Hanly, A. Lozano, A. C. K. Soong, and J. C. Zhang, ``What will 5G be?\" \\emph{IEEE J. Sel. Areas Commun.}, vol. 32, no. 6, pp. 1065-1082, 2014.\n\n\\bibitem{ngo2013energy}\nH. Q. Ngo, E. G. Larsson, and T. L. Marzetta, ``Energy and spectral efficiency of very large multiuser MIMO systems,\" \\emph{IEEE Trans. Commun.}, vol. 61, no. 4, pp. 1436-1449, 2013.\n\n\\bibitem{bjornson2014hardware}\nE. Bj\\\"{o}rnson, J. Hoydis, M. Kountouris, and M. Debbah, ``Massive MIMO systems with non-ideal hardware: Energy efficiency, estimation, and capacity limits,\" \\emph{IEEE Trans. Inf. Theory}, vol. 60, no. 11, pp. 7112-7139, 2014.\n\n\\bibitem{bjornson2015massive}\nE. Bj\\\"{o}rnson, M. Matthaiou, and M. Debbah, ``Massive MIMO with non-ideal arbitrary arrays: Hardware scaling laws and circuit-aware design,\" \\emph{IEEE Trans. Wireless Commun.}, vol. 14, no. 8, pp. 4353-4368, 2015.\n\n\\bibitem{gustavsson2014impact}\nU. Gustavsson, C. Sanch\\'{e}z-Perez, T. Eriksson, F. Athley, G. Durisi, P. Landin, K. Hausmair, C. Fager, and L. Svensson, ``On the impact of hardware impairments on massive MIMO,\" in \\emph{Proc. IEEE Global Telecommun. Conf. (GLOBECOM) Workshops}, 2014.\n\n\\bibitem{murmann2014adc}\nB. Murmann, ``ADC Performance Survey 1997-2015,\"  [Online]. Available: \\url{http://web.stanford.edu/~murmann/adcsurvey.html}.\n\n\\bibitem{singh2009limits}\nJ. Singh, O. Dabeer, and U. Madhow, ``On the limits of communication with low-precision analog-to-digital conversion at the receiver,\" \\emph{IEEE Trans. Commun.}, vol. 57, no. 12, pp. 3629-3639, 2009.\n\n\\bibitem{yin2010monobit}\nH. Yin, Z. Wang, L. Ke, and J. Wang, ``Monobit digital receivers: Design, performance, and application to impulse radio,\" \\emph{IEEE Trans. Commun.}, vol. 58, no. 6, pp. 1695-1704, 2010.\n\n\\bibitem{mezghani2008analysis}\nA. Mezghani and J. A. Nossek, ``Analysis of Rayleigh-fading channels with 1-bit quantized output,\" in \\emph{Proc. IEEE Int. Symp. Inf. Theory (ISIT)}, 2008.\n\n\\bibitem{mezghani2012capacity}\nA. Mezghani and J. A. Nossek, ``Capacity lower bound of MIMO channels with output quantization and correlated noise,\" in \\emph{Proc. IEEE Int. Symp. Inf. Theory (ISIT)}, 2012.\n\n\\bibitem{mo2014high}\nJ. Mo and R. Heath, ``High SNR capacity of millimeter wave MIMO systems with one-bit quantization,\" in \\emph{Proc. of Information Theory and Applications (ITA) Workshop}, 2014.\n\n\\bibitem{risi2014massive}\nC. Risi, D. Persson, and E. G. Larsson, ``Massive MIMO with 1-bit ADC,\" \\emph{arXiv:1404.7736}, 2014.\n\n\\bibitem{jacobsson2015one}\nS. Jacobsson, G. Durisi, M. Coldrey, U. Gustavsson, and C. Studer, ``One-bit massive MIMO: Channel estimation and high-order modulations,\" in \\emph{Proc. IEEE Int. Conf. Commun. (ICC) Workshop }, 2015.\n\n\\bibitem{wen2015bayes}\nC.-K. Wen, C.-J. Wang, S. Jin, K.-K. Wong, and P. Ting, ``Bayes-optimal joint channel-and-data estimation for massive MIMO with low-precision ADCs,\" \\emph{arXiv:1507.07766}, 2015.\n\n\\bibitem{zhang2015mixed}\nT. Zhang, C.-K. Wen, S. Jin, and T. Jiang, ``Mixed-ADC massive MIMO detectors: Performance analysis and design optimization,\" \\emph{arXiv:1509.07950}, 2015.\n\n\\bibitem{studer2015quantized}\nC. Studer and G. Durisi, ``Quantized massive MU-MIMO-OFDM uplink,\" \\emph{arXiv:1509.07928}, 2015.\n\n\\bibitem{shah2013optimal}\nT. Shah and O. Dabeer, ``Optimal subcarrier power allocation for OFDM with low precision ADC at receiver,\" \\emph{IEEE Trans. Commun.}, vol. 61, no. 11, pp. 4591-4601, 2013.\n\n\\bibitem{ivrlac2007mimo}\nM. T. Ivrla\\v{c} and J. A. Nossek, ``On MIMO channel estimation with single-bit signal-quantization,\" in \\emph{ITG Smart Antenna Workshop}, 2007.\n\n\\bibitem{liang2015mixed}\nN. Liang and W. Zhang, ``Mixed-ADC massive MIMO,\" to appear in \\emph{IEEE J. Sel. Areas Commun.}, 2016. [Online]. Available: \\url{http://arxiv.org/abs/1504.03516}.\n\n\\bibitem{liang2015a}\nN. Liang and W. Zhang, ``A mixed-ADC receiver architecture for massive MIMO systems,\" in \\emph{Proc. IEEE Information Theory Workshop}, 2015.\n\n\\bibitem{sezginer2008asymptotically}\nS. Sezginer and P. Bianchi, ``Asymptotically efficient reduced complexity frequency offset and channel estimators for uplink MIMO-OFDMA systems,\" \\emph{IEEE Trans. Signal Processing}, vol. 56, no. 3, pp. 964-979, 2008.\n\n\\bibitem{lapidoth2002fading}\nA. Lapidoth and S. Shamai, ``Fading channels: How perfect need 'perfect side information' be?\" \\emph{IEEE Trans. Inf. Theory}, vol. 48, no. 5, pp. 1118-1134, 2002.\n\n\\bibitem{zhang2012general}\nW. Zhang, ``A general framework for transmission with transceiver distortion and some applications,\" \\emph{IEEE Trans. Commun.}, vol. 60, no. 2, pp. 384-399, 2012.\n\n\\bibitem{vehkapera2015asymptotic}\nM. Vehkaper\\\"{a}, T. Riihonen, M. Girnyk, E. Bj\\\"{o}rnson, M. Debbah, L. K. Rasmussen, and R. Wichman, ``Asymptotic analysis of SU-MIMO channels with transmitter noise and mismatched joint decoding,\" \\emph{IEEE Trans. Commun.}, vol. 63, no. 3, 749-765, 2015.\n\n\\bibitem{TR36.912}\n\\emph{Feasibility study for Further Advancements for E-UTRA (LTE-Advanced)}, 3GPP TR 36.912-v12.0.0, 2014.\n\n\n\n\n\n\n\n\n\n\n\\bibitem{horn2012matrix}\nR. Horn and C. R. Johnson, \\emph{Matrix Analysis}, Cambridge University Press, 2012.\n\n\\bibitem{stewart1969continuity}\nG. W. Stewart, ``On the continuity of the generalized inverse,\" \\emph{SIAM J. Appl. Math.}, vol. 17, no. 1, pp. 33-45, 1969.\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 79467, "prevtext": "\n\nOn the other hand, $\\mathbf{D}_{nm}$ in this situation is given by the combination of \\eqref{equ:equ_8}, \\eqref{equ:equ_6} and \\eqref{equ:equ_11}, for any $n,m\\in\\mathbb{N}$. Particularly, as $\\mathcal{E}_{\\mathrm{s}}$ tends to infinity we have\n\n", "index": 135, "text": "\\begin{equation}\n\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\bm{\\Theta}_{nm}=Q\\mathbf{F}^{\\dag}\\frac{\\bm{\\Lambda}_n}{\\|\\bm{\\lambda}_n\\|}\\frac{\\bm{\\Lambda}_m^{\\dag}}{\\|\\bm{\\lambda}_m\\|}\\mathbf{F}.\n\\label{equ:equ_13}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E68.m1\" class=\"ltx_Math\" alttext=\"\\lim_{\\mathcal{E}_{\\mathrm{s}}\\rightarrow\\infty}\\bm{\\Theta}_{nm}=Q\\mathbf{F}^{%&#10;{\\dagger}}\\frac{\\bm{\\Lambda}_{n}}{\\|\\bm{\\lambda}_{n}\\|}\\frac{\\bm{\\Lambda}_{m}^%&#10;{{\\dagger}}}{\\|\\bm{\\lambda}_{m}\\|}\\mathbf{F}.\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℰ</mi><mi mathvariant=\"normal\">s</mi></msub><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><msub><mi>𝚯</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>=</mo><mrow><mi>Q</mi><mo>⁢</mo><msup><mi>𝐅</mi><mo>†</mo></msup><mo>⁢</mo><mfrac><msub><mi>𝚲</mi><mi>n</mi></msub><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>n</mi></msub><mo>∥</mo></mrow></mfrac><mo>⁢</mo><mfrac><msubsup><mi>𝚲</mi><mi>m</mi><mo>†</mo></msubsup><mrow><mo>∥</mo><msub><mi>𝝀</mi><mi>m</mi></msub><mo>∥</mo></mrow></mfrac><mo>⁢</mo><mi>𝐅</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]