[{"file": "1601.03421.tex", "nexttext": "\nIf the increment $\\Delta M_* \\rightarrow 0$, we obtain the classical Newtonian equation of motion for bodies of fixed mass. When the object mass changes, ${\\Delta M_*} \\neq 0$, the concept of a \"steady-moving\" body in absence of external actions (${\\mathbf w} = 0$) is not a precise one. Eq.~\\ref{m1b} is the basis of equations describing the rocket motion. The elementary work of the \"accretion\" force which is proportional to $\\Delta M_*$, is\n$    \\Delta {A} = - ( {1}/{2} ) {\\mathbf v}^2 \\,  \\Delta {M}$.  This work is negative when $\\Delta {M} > 0$ and therefore, the reduction of kinetic energy takes place (deceleration occurs). Obviously, this expression must be statistically averaged with respect to all possible values of velocities ${\\mathbf v}$ of the accreting particles  for the given $\\Delta M$ (see the main text of the paper). The part of this work is transformed into heat received by the object.\nThis quantity (per unit time) can be estimated as $\\dot{Q} \\simeq \\dot{M} \\langle {\\mathbf v} \\rangle^2 $ (to within a factor of the unit order).\n\nEq.~(\\ref{m1b}) must be statistically averaged with respect to all possible values of velocities ${\\mathbf v}$ of the accreting particles  for the given $\\Delta M_*$. After the averaging, the velocity  ${\\mathbf v}$ of accreting fragment $\\Delta M_*$ in Eq.~(\\ref{m1b}) which contains a large number of accreting particles is replaced by averaged $\\langle {\\mathbf v} \\rangle$, and transition $\\Delta t \\rightarrow dt$ is performed to write Eq.~(\\ref{m1b}) in terms of derivatives.\n\n\n\n{\\bf Calculation of averaged velocity of accreting particles.} The following step is to find the expression for $\\langle \\mathbf{v} \\rangle$  which obviously is not zero for the moving body in accordance with the simple philosophy that the body will collide with particles flying in face more often than with particles that are catching up him.\n\nWe assume the spherical symmetry of the velocity distribution of the gas particles and their spatial homogeneity, so that distribution function $f ({\\mathbf v}) = f (v)$ is a function of velocity module. The probability that any gas particle occupies element $d w = dv_x dv_y d v_z$ in the space of velocities is proportional to $d w \\, f (v).$ The probability of the object to capture the gas particle with velocity ${\\mathbf v}$ is proportional to the cross--section of interaction, i.e. to the product of the module of relative velocity of the particle with respect to the object ($|{\\mathbf v} - {\\mathbf V}|$) and $d w \\, f ( v )$. Thus, the average velocity is\n\\begin{eqnarray}\n\\label{vm1}\n\\langle {\\mathbf v} \\rangle =\n{\\int d w \\, {\\mathbf v} \\, |{\\mathbf v} - {\\mathbf V}| \\, f (v)} \\bigg/ {\\int d w \\, |{\\mathbf v} - {\\mathbf V}| \\, f (v)}\n\\end{eqnarray}\nDue to the axial symmetry of the problem, $\\langle {\\mathbf v} \\rangle$ is co-linear with ${\\mathbf V}.$ In the spherical coordinate system with\n$d w = $ $2 \\pi d \\theta \\, \\sin \\theta \\, d v \\, v^2$ where $\\theta$ is the angle between ${\\mathbf v}$ and ${\\mathbf V},$\n\\begin{eqnarray*}\n\\langle v \\rangle = \\nonumber \\\\\n\\frac{ 2 \\pi \\int_0^{\\infty} \\int_0^{\\pi} d v \\, v^2 \\, d \\theta \\, \\sin \\theta \\, f (v) v \\, \\cos\n\\theta \\, \\sqrt{v^2 + V^2 - 2 v V \\cos \\theta} }{ 2 \\pi \\int_0^{\\infty} \\int_0^{\\pi} d v \\, v^2 \\, d\n\\theta \\, \\sin \\theta \\, f (v) \\, \\sqrt{v^2 + V^2 - 2 v V \\cos \\theta} } ,\n\\end{eqnarray*}\nwhich, after integrating with respect to angle $\\theta, $ produces the following expression:\n\\begin{eqnarray*}\n\\langle v \\rangle = \\nonumber \\\\\n\\frac{\\int_0^V d v \\, v^3 f (v) [\\frac{2}{3} v - \\frac{2}{15}\n\\frac{v^3}{V^2}] + \\int_V^{\\infty} d v \\, v^3 f (v) [\\frac{2}{3} V - \\frac{2}{15}\n\\frac{V^3}{v^2}]}{\\int_0^V d v \\, v^2 f (v) [2 V + \\frac{2}{3} \\frac{v^2}{V}] + \\int_V^{\\infty} d v \\,\nv^2 f (v) [2 v + \\frac{2}{3} \\frac{V^3}{v^2}]} .\n\\end{eqnarray*}\n\nThe obtained expression permits the use of any distribution function, both the Maxwell-Boltzmann $f (v) \\sim \\exp (- v^2 m / 2 k T)$ for high temperatures and the Fermi one for low temperatures. Technically, both distributions give similar results (Fig.~\\ref{averv}).\n\nWe assume that the surrounding gas is composed purely of ionized hydrogen--degenerate electron--proton plasma. Since $m_p \\gg m_e$, only the proton component is significant for the object mass change.\n\nWe consider in more detail  the distribution for the full degenerate Fermi gas of proton component  which is valid when the temperature of medium $T \\ll T_{Fp}$.\nFor the distribution with respect to velocities of fully degenerate non--relativistic Fermi gas of protons/nuclei\n\\citep{f62},\n\\citep{f29},\n$f (v) \\sim H ( v_{Fp} - v)$, where $v_{Fp}$ is the local Fermi boundary velocity of the nebula heavy particles and $H ( \\xi )$ is the Heaviside step function. Parameter $v_{Fp}$ is defined as $v_{Fp} = (6 \\pi^2 /2)^{1/3} (\\hbar / m_p ) (\\rho / m_p )^{1/3} = (m_e / m_p) v_{Fe} \\ll v_{Fe}$. Numerically this gives $v_{Fp} = 1.643 \\times 10^2 \\rho^{1/3} \\; m \\, s^{-1}$ where $\\rho$ is measured in $kg \\, m^{-3}$. Even for rather large densities of accreting medium (for example, for a white dwarf near the boundary of stability $\\rho = 10^9 \\, kg \\, m^{-3}$) when $v_{Fe}$ becomes relativistic, for proton component $v_{Fp}  \\ll c = 2.99 \\times 10^8 \\, m \\, s^{-1}$. When temperatures of $p-$ and $e$--components of the medium are of the same order, parameter $v_{Fp}$ is of the same order as the speed of sound in the medium. To simplify the subsequent analysis, we introduce dimensionless velocity, $V / v_{Fp} \\rightarrow V$, and\nexpress $\\langle v \\rangle$ as $\\langle v \\rangle \\equiv  v_F \\Phi (V)$ with function\n\\begin{eqnarray}\n\\Phi (V) =  \\frac{-4 + 28 V^2 + \\alpha_1(V) H(1 - V)}{7 V (-4 (1 + 5 V^2) + \\alpha_2 (V) H(1 - V))} < 0.\n\\quad \\label{v-m2}\n\\end{eqnarray}\nHere, $\\alpha_1 (V)=(-1 + V)^4 (4 + 16 V + 12 V^2 + 3 V^3)$, $\\alpha_2 (V) = (-1 + V)^4 (4 + V)$ and $H (s)$ is the Heaviside function.\nBehavior of $\\Phi (V)$  is given in Fig.~\\ref{averv}.\nA good polynomial approximation of $\\Phi (V)$ is\n$\n\\Phi (V) \\simeq  (- 0.333 V  + 0.318 V^3 - 0.135 V^5 )H(0.795 - V) + \\\\\n( - 0.2 V^{-1}\n+ 0.067 V^{-3} - 0.009V^{-5}) H(V - 0.785).\n$\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig1.eps}\n\\caption{\nVelocity correction $\\Phi (V) \\sim - \\langle v \\rangle$ calculated as a functional of different functions of distribution:\nthe Fermi distribution (where function $f (v)$ is proportional to the Heaviside function, $f (v) \\sim H (v_F - v)$) (base line),\nand the Maxwell distribution (where $f (v) \\sim \\exp (- v^2 / \\beta v_{Fp}^2)$) shown for $\\beta = 1, \\, 2, \\, 2.5, \\, 3$ (lower to upper lines).\nIn the presented example, both Fermi and Maxwell distributions are similar when $\\beta = 2.5$.\n}\n\\label{averv}\n\\end{figure}\n\n\n{\\bf Mass accumulation.} Then Eq.~(\\ref{m1b})  takes form suitable for our analysis:\n$\\label{eqm1b}\n{d {V}} / {(V - \\Phi (V))} =  - {d M_*} /{M_*} $.\nThe mass and the time-derivative of the mass of the object are expressed in terms of $V$  as\n\\begin{eqnarray}\n\\label{eqm1e1}\nM_* (t) = M_0 \\exp \\int_{V(t)}^{V (0)} \\frac{d \\xi}{\\xi - \\Phi (\\xi)}\n\\equiv M_0 \\exp J(t) .\n\\end{eqnarray}\nFurther, we transition to dimensionless variables and express the object mass $M_*(t)$ in terms of (constant) $M_0$ (which from this point on will be called the \\emph{initial} mass of the object) and the normalized variable  $m(t)$, so that  $M_*(t) = M_0 m(t)$. We assume for simplicity the density of the accreting medium to be constant $\\rho_F$.\nThe dimensionless mass of the object evolves as\n\\begin{eqnarray}\n\\label{eqm1e2}\n \\dot{m} =  - (V - \\Phi (V)^{-1} \\exp J (t) \\dot{V} .\n\\end{eqnarray}\nshowing that when $\\dot{V}  < 0$, deceleration, mass $m (t)$ is increasing, $\\dot{m}  > 0$.\n\n\n{\\bf Regimes of motion and results of calculation.}\nTo close  the system of the equations, we have to propose an evolution equation for the mass of the object,  \ni.e. $\\dot{M}_* = \\dot{M}_* (M_*, V, ...)$.\n\nThe simplest model is to assume that the object \nmass increases due to the simple \"adhesion\" of the surrounding particles and  that its mass increases proportionally to the effective surface area, \ni.e.  $\\dot{M}_* \\sim 4 \\pi R^2 (t)$ (Appendix~\\ref{ap:2}).\n\nA more complex model includes  \nthe traditional interpolation  for $ \\dot{M}_*$ (proposed in  \\citet{b52}  for accretion onto both  a resting and  a moving object)\n(see also,\n\\citet{st83}, p.~420).\n\nBondi--Hoyle--Lyttleton (BHL) accretion, in its simplest form, considers a point mass moving through a gas cloud \nthat is presumed to be non-self-gravitating and uniform at infinity.\nGravity focuses the gas cloud particles behind the point mass. \nGas particles then accrete to the mass.\n\n\n\n\n(See \\citet{ec04} and Refs therein.)\n\nThis expression can be presented (with a small reformulation) in form\n\\begin{eqnarray}\n\\frac{\\dot{M}_* }{M_*} = 4 \\pi \\kappa G^2  M_*  \\frac{ \\rho^{5/2} }{ (\\rho V^2 + P)^{3/2}}\n\\label{b0f}\n\\end{eqnarray}\nHere, the left part of equation represents the rate of mass change of the object,  \nthe right one is defined by factors which governs the accretion process, $\\rho$ is a characteristic medium density, $V$ is the velocity of the object with respect to medium, $s$ is the (isothermical) sound speed in the medium  (at large distance from the object), $P = \\rho s^2$, numerical coefficient $\\kappa$ is of the order of unity. \n(See Appendix~B.)\n\nThe BHL formula written in the form of Eq.~(\\ref{b0f}) shows that it can be obtained from simple arguments based on the dimensional analysis. In fact, the rate of accretion ${\\dot{M}_* } / {M_*}$ has to be faster when the object \nis massive, i.e. ${\\dot{M}_* } / {M_*} \\sim {M_*}$. The process is governed by the gravity, $G$, and by the principal properties of the medium: density, $\\rho$, and pressure $P (\\rho, ...)$ which determines the equation of state. The only dimensional combination of $G$, $\\rho$ and $P$ which produces the necessary dimension, is $M_* \\times G^2 \\rho^{5/2} P^{-3/2} $. In a moving medium, the pressure must be replaced by the dynamical pressure $P + \\rho V^2$. From here, Eq.~(\\ref{b0f})  is obtained.\n\nIn such case (and with $M_* \\rightarrow M_0 m (t)$ , $P = \\rho s^2$  and $V \\rightarrow v_{Fp} V$) the dimensionless form of the equation takes a simple form.\nBy combining Eq.~(\\ref{b0f}) with Eqs.~(\\ref{m1b}), (\\ref{eqm1e1}) and (\\ref{eqm1e2}), we obtain\n\\begin{eqnarray}\n\\frac{d V}{d t} = - \\bigg( 4 \\pi \\kappa \\frac{\\rho G^2 M_0}{s^3}  \\bigg) \\frac{V - \\Phi (V)}{(\\epsilon V^2 + 1)^{3/2}} \\, \\exp (-J (t)) .\n\\label{b1f}\n\\end{eqnarray}\nHere $\\epsilon = m_e / m_p \\ll 1$. Coefficient $\\beta$  (expression in parentheses)\ncan be written as  $\\beta \\equiv \\tau^{-1} = (4 \\pi \\kappa ) \\rho G^2 M_0 /s^3 = 1.995 \\times 10^3 (4 \\pi \\kappa ) (M_0 / M_{\\odot})$,\nwhere\n$M_{\\odot} = 1.989 \\times 10^{30} \\, kg$ is the Sun mass, $\\tau$ is the characteristic time scale. Function $J (t)$ is defined by Eq.~(\\ref{eqm1e1}). Eqs.~(\\ref{v-m2})--(\\ref{b1f})  complete the system of necessary equations.  Eq.~(\\ref{b1f}) establishes the time scale $\\tau^{-1} = (4 \\pi \\kappa) (\\rho G^2 M_0 / s^3) $, which depends on the initial mass of the object and the properties of the target medium. By expressing the physical parameters of the problem in units $\\tau$ (for time) and $v_{Fp}$ (for velocity), we obtain the universal solution for the basic set of equations.\n\n\n\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig2.eps}\n\\caption{\nEvolution of the colliding object's velocity,\nfor initial velocities $V_0 = 0.3$ (lower line),  $V_0 = 1$ and $V_0 = 3$ (upper line).\n}\n\\label{velocities}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig3.eps}\n\\caption{\nEvolution of the colliding object's (dimensionless) deceleration,\nfor initial velocities $V_0 = 3$ (lower line),  $V_0 = 1$ and $V_0 = 0.3$ (upper line).\n}\n\\label{decelerations}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig5.eps}\n\\caption{\nNormalized (by $M_0$) total mass of the colliding object as function of time for different initial velocities: $V_0 = 3, \\; 1, \\; 0.3$ (from lower line to upper line).\nWhen the object stops, $V \\rightarrow 0$, the accreted mass $M \\rightarrow \\infty$.\nIn such situation, the used approximations are no longer valid, and the general relativity approximation has to be taken into consideration.\n}\n\\label{mass}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig4.eps}\n\\caption{\nThe dimensionless path of\nthe object\nas function of time for different initial velocities: $V_0 = 0.3, \\; 1, \\; 3$ (from lower line to upper line).\n}\n\\label{distances}\n\\end{figure}\n\n\nThe greater is the density of the surrounding medium, the stronger is the deceleration effect.\n\nFigs~\\ref{velocities}--\\ref{distances} illustrate the model results for several initial conditions.\nThe figures show the evolution of each scenario (characterized by the initial dimensionless velocities $V_0 = 0.3, \\; 1, \\; 3$) until the object decelerates to a stop. Note that the state of full stop is an asymptotic state. Neither the Bondi formula, nor the modified version of it presented in this analysis, properly describe the process in the vicinity of such state. It implies that the entire (infinite) mass of the accreted medium is captured by the object within the finite period of time. In reality, of course, the target has a finite mass, and once it is captured no further accretion (and therefore deceleration) occurs.\n\n\nHowever, in the domain of parameters where the model is reasonably accurate and valid, it appears that in all three scenarios the object significantly decelerates (approaches its full stop) once it accretes the amount of mass equal to several times its initial mass. Which means that if the relative sizes of the object and the target are such that the entire accreted mass is \"small\" (not sufficient to decelerate the object to a full stop), the deceleration would vanish once the entire target mass is accreted or once the object exits the zone of influence.\n\nFig.~\\ref{decelerations} also reveals that the magnitude of deceleration is the greatest at the beginning of the process and can be quite non-negligible.\n\nSpecific evolution scenarios depend on the \nrelationship between several characteristic times: time-of-flight $\\tau_p \\simeq R/V_0$, or $\\simeq (\\rho_{object}/\\rho_{target})^{1/3}R/V_0$, time of hydrodynamical ï¿½unloadingï¿½ $\\tau_h \\simeq R/s$ inside of target, and characteristic time of accretion $\\tau_a$. Here, $R$ is the characteristic size of the target. \nDepending on the combination of these parameters, different outcomes occur affecting the states of the involved bodies. However, the comprehensive analysis of such scenarios is beyond the scope of this publication.\n\n\n\n\\section{Conclusion}\n\nAccretion-caused deceleration occurs when a gravitationally-powerful object moves through a medium, captures the surrounding particles, and decreases its kinetic energy and momentum as its mass increases. \n\nIn this article, we presented an analysis of such scenario for \na compact (small in size), \nnon-rotating and non-magnetized,  \ngravitationally-powerful object \ncolliding head-on (simple model geometry) \nwith \na high-density medium (a white or black dwarf, for example). \n\nBy describing the motion of the variable-mass body,\nwe demonstrated that the magnitude of the deceleration \n(caused only by accretion and no other mechanisms) \nmay indeed be substantial depending on the initial conditions. \n\nThere are several implications stemming from this result.\n\nFirst, \nas mentioned earlier, \none of the hypothesized scenarios for the formation of a Thorne-Zytkow object \n(a red giant or supergiant containing a neutron star at its core) \nis a collision of the two objects, the giant and the neutron star. \nIn our demonstration, despite its intentional simplicity, \nthe results at the qualitative level \nappear to be consistent with such scenario.  \nAs shown in Fig.~\\ref{distances}, \nthe neutron star may be completely captured by the target (the full-stop case), \nor the neutron star may accrete mass from the target without stopping.  \nIn both cases, \nthe resulting object may be described as a neutron star surrounded by a gigantic envelope.\nThe exact outcome would depend on the  initial characteristics of the involved objects,\nproducing a TZO with   \na larger-sized giant in the first case and a TZO with a smaller-sized giant in the second.\nTherefore, \naccretion may play an important role in the formation of the Thorne-Zytkow objects, \neven if taken as a stand-alone mechanism, \nand thus its contribution should not be neglected in  complex and more realistic multi-mechanism models. \n\n\nIn this article, we derived the proper mathematical description \nfor the highly dense medium (degenerate Fermi-gas) \nthat is better suited for targets like white or black dwarfs, whose densities exceed $10^7 \\, kg/m^3$. \n\nPrior studies of accretion considered only low or medium density media. \n\n\nSecond, \nwhile the accretion-caused deceleration effect is interesting on its own, \nwhen it is applied to the stellar objects composed of nuclear matter  \nwith particular equations of state (EOS),  \nthe situation deserves a special attention.\n As well known, \njust like  traditional matter, \n nuclear matter  \n has its critical state with its critical temperature and density. \n(See, for example,  \\citet{j83}, \\citet{j84}, \\citet{apr98}, \\citet{k06} and \n\\citet{k-a11} \nand references therein.) \n\nThis means that if the matter of the elastic stellar object is in the state close to the boundary of liquid/gas phase transition \n(near the spinodal zone where the matter can transition into the state of \"nuclear fog\"), \nthen speed of density perturbation propagation is close to zero. \n\nThen even relatively small deceleration may lead to strong stratification of the interior matter of the compact object. \nThe space scale of this stratification is defined by the ratio of sound speed square and deceleration magnitude.    \nZones of compression and decompression appear throughout the compact object interior.   \n\nWithin the decompression zones, \nin the environment of the nuclear fog, \nexplosive nuclear reactions (fusion and fission of fragments) may start. \n(\\cite{tp13}  examine this in more detail.)\n\n\nTo conclude, while accretion onto neutron stars (and other compact gravitationally-powerful stellar objects \nsuch as fragments of a neutron star, \nquark star, strange stars, etc.)  \nwould rarely occur as a stand-alone process, \nin some cases \nit may meaningfully contribute to the aggregate deceleration experienced by the stellar objects. \nFor non/low-magnetized objects, accretion may actually play the dominant role in the deceleration \nof the objects when they collide with other stellar bodies or traverse an encountered medium. \nIn this article, we provided a new model for the treatment of dense accreting medium.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\appendix\n\n\\section{Deceleration due to adhesion}\n\\label{ap:2}\n\nConsider a body moving in a dense medium. We suppose that the interaction of the surrounding particles with the body is governed by short-range  forces. Such interaction is modeled by the adhesion mechanism where particles of the environment simply adhere to the body.  Consequently, the mass and the volume of the moving body increase.  We suppose that the rate of mass increase is proportional to the surface of the body and density of environment., i.e. $\\dot{M} (t) \\sim \\rho_e \\, 4 \\pi r^2 (t)$. Here, $r (t)$ is the radius of the body, $\\rho_e$  is the density of the medium  (a classical example is of the  drop which is moving in a saturated vapor of water).\n\nWe suppose that the density of the body stays constant during the process at least in leading approximation.  The mass is $M = \\rho_b (4 \\pi /3) r^3 $. From $d / dt [ \\rho_b (4 \\pi /3)  r^3 ]= v_* \\rho_e \\, 4 \\pi r^2 $, we can find  that the rate of radius increase is constant $\\dot{r} = v_* (\\rho_e / \\rho_b)$.  Parameter $v_*$ has the dimension of velocity.  The meaning of this parameter is the characteristic velocity of adhesion of particles of the environment to the surface of the body. This parameter is determined by the regime of plasma-dynamical flow in the surrounding medium which is not a trivial problem because the process of adhesion depends strongly on the model of the environment,  for example on the equation of state of the surrounding matter.\n\nThe classical equation of motion of the body of variable mass in presence of the traditional hydrodynamical  drag is  $M \\dot{\\mathbf v} = - C \\rho_e r^2 v^2  {\\mathbf n}_v +  {\\mathbf c} \\dot{M}$,  where ${\\mathbf c} = {\\mathbf V} - {\\mathbf v}$. Here, $\\mathbf V$ is the velocity of the medium particle adhered to the body in an inertial frame, $\\mathbf v$   is the body velocity in the same frame, the drag is proportional to square of the body velocity, dimensionless parameter $C$ is of order unity.\n\nWe suppose for simplicity that all particles of the environment are immobile in the initial non--perturbed state, ${\\mathbf V} = 0$. This is assumed to simplify the consideration and to obtain an analytical solution.  The equation of motion becomes\n\n", "itemtype": "equation", "pos": 11766, "prevtext": "\n\n\\title{\nAccretion-caused deceleration of a gravitationally \\\\ powerful compact stellar object moving within a dense Fermi gas\n}\n\n\n\n\\author{E. P. Tito}\n\\affil{Scientific Advisory Group, Pasadena, CA 91125, USA}\n\\author{V. I. Pavlov}\n\\affil{UFR des Math\\'{e}matiques Pures et Appliqu\\'{e}es,\n\n Universit\\'{e} de Lille 1,\n59655 Villeneuve d'Ascq, France\n\n\n}\n\n\n\\begin{abstract}\nWe consider accretion-caused deceleration of a gravitationally-powerful compact stellar object traveling within a cold Fermi-gas medium. We provide analytical and numerical estimates of the effect manifestation.\n\\end{abstract}\n\n\\keywords{\ncollision,  Fermi gas,  accretion,  deceleration\n}\n\n\\maketitle\n\n\\section{Introduction} \\label{S:Introduction}\n\n\n\nNumerous fast-moving solitary stellar objects, called the \"wandering stars\", have been astronomically detected  \ninside and outside our Galaxy.\nThe speeds of these objects sometimes reach as high as $1200  \\, km \\, s^{-1} $ \\citep{g15}, \ngreater than even the galactic escape velocity ($v_e \\simeq 500 - 600 \\, km \\, s^{-1} $).\n The exact nature of these stellar bodies is uncertain, and a variety of hypotheses and formation scenarios have been proposed. \n \\citet{h88}, \\citet{ree90}, \\citet{knp93a}, \\citet{knp93b}\nMost of these scenarios involve dramatic acceleration of the object -- whether a star, a neutron star, or possibly a piece of the torn apart debris -- \nby the super-massive black hole located at the galactic core.\nIndeed, the gravitational might of the black hole is such that many objects, \neven those that are deemed essentially indestructible in other circumstances, can be torn apart \nby tidal forces \ninto pieces and flung out with enormous speeds. \n\nWhile a  collision of such a fast-moving object with another stellar object is, generally speaking, a low probability event, \nit is not impossible, especially when considering densely populated areas of the Galaxy and when taking a long historical perspective. \n\nMoreover,  a collision of a neutron star with a star -- a red giant, a supergiant, or a white dwarf --  \nis proposed as one of the leading scenarios for the formation of a Thorne-Zytkow object,  \ntheoretically hypothesized in 1977 and potentially discovered in 2014. (\\citet{tz77}, \\citet{lmzm14})\n\nWhile over the years much focus has been given in such scenario to various critical aspects of the phenomenon, \nto our knowledge  \nthe mechanism of accretion-caused deceleration of the neutron star has never been considered. \nFurthermore, this mechanism has never been considered in any scenarios of compact and expansive objects collisions.\n\nIn this paper, we specifically focus on the mechanism of deceleration resulting from the accretion of the dense surrounding medium \nonto a rapidly moving gravitationally-powerful compact object. \nWe consider a generalized and intentionally simplified scenario, involving not specifically a formation of a Thorne-Zytkow object, \nbut rather a head-on collision of a neutron star-like, but non-rotating and non-magnetized, compact object \nwith  a dense white dwarf-like medium. \n\n\nGenerally speaking, in such a deceleration scenario different mechanisms can be responsible for the kinetic energy decrease of the moving object:\nclassical hydrodynamical drag\n\\citep{d64},\ngravitational drag in collisionless systems\n\\citep{ch43} \nwhich is called \ndynamical friction \nin astrophysics \n\\citep{o99},\nCherenkov's radiation of various waves (related to collective hydrodynamical motions) which are generated inside the medium\n\\citep{ps85},\n\\citep{pk90},\n\\citep{pt09},\ninteraction of proper magnetic field for strongly magnetized object with surrounding plasma\n(see  \\citet{t-a12} and Refs therein),\nas well as other more complex possibilities.\n\n\nAnalytically, the relative importance of these various mechanisms contributing simultaneously to the aggregate deceleration, \ncan be assessed using the dimension-analysis approach.\n\n\nThe classical hydrodynamical drag (passive resistance of the surrounding medium) for a blunt object \nmoving fast enough (large Reynolds number) \nto produce a turbulent wake,\nis proportional to its cross--section, i.e. $k_d  \\rho R^2 V ^2 $. \\citep{ll87} \nHere \n$\\rho$ is the medium density, \n$R$  is the characteristic (transversal) size of the object, \n$V$ is the velocity of the object relative to the surrounding medium.   \nThe dimensionless drag coefficient, $k_d$, \ntakes into account both  skin friction and  form factor. \nThe characteristic time of deceleration due to hydrodynamical drag, $\\tau_d$, is then \n$\\tau_d^{-1} \\sim  \\rho R^2 V / M $, where $M$ is the object's mass.\n\nDynamic friction, called gravitational drag in astrophysics, also contributes to the loss of momentum and kinetic energy \nwhen a moving object gravitationally interacts with the surrounding matter (rarefied cloud). \n\\citep{ch43}\nThe essence of the effect is that small cloud particles are pulled by gravity  toward the object, thus increasing the cloud density.  \nBut if the object already moved forward, the density increase actually occurs in its wake. \nTherefore, it is the gravitational attraction of the wake that pulls the object backward and slows it down.  \n\nA simplified equation for the force from dynamical friction has the form\n$M dV / dt = F_{Ch} = - C \\rho G^2 M^2 / V^2$.\nThe dimensionless numerical factor $C$  depends on the so--called Coulomb logarithm  \nand on how velocity of the object $V$ compares to the velocity dispersion $\\sim \\sqrt{\\langle v^2 \\rangle}$ \nof the cloud particles, \ni.e. on the argument $\\xi = V / \\sqrt{\\langle v^2 \\rangle}$. \nThe characteristic time of the process obtained from the Chandrasekhar equation written above,\nis  $ \\tau_{Ch}^{-1} \\sim \\rho G^2 M  ( \\sqrt{\\langle v^2 \\rangle })^{-3}$.  \n\nFor gravitationally-powerful moving objects  \nthat are capable of capturing the surrounding medium particles onto its surface (not just pulling them into its wake), \nwhen the increase of the object's mass due to the accretion is non-negligible, \nthe constant-mass-body equations of motion commonly used in celestial dynamics, no longer apply. \nTo our knowledge, at present there are no qualitative or numerical considerations of this effect. \nThe aim of this article is to fill this void. \n\n\n\nThe characteristic time $\\tau_a $ for the accretion deceleration is such that \n$\\tau_a^{-1} \\sim  M$: \nthe more massive the body is, the faster the accretion onto it occurs. \n\nIn this consideration, we focus on the accretion onto an object with {\\em small size} but significant mass, \nand the one that moves with trans- or super-sonic speed through an non-perturbed, uniform at infinity medium that is free of self-gravity.\n\nThen the remaining  apparent characteristics of the process are the  \ngravity constant $G$, and  \ndensity $\\rho$ and pressure $P$ of the accreting medium.\n\nThe combination of these parameters that matches the dimension of (the inverse of) $\\tau_a $ is \n$\\tau_a^{-1} \\sim \\rho G^2 M (\\rho / P )^{3/2}$, or $\\tau_a^{-1} \\sim \\rho G^2 M s^{-3}$ \nwhere $s^2$ characterizes \nthe square of speed of propagation of small density perturbations within the medium. \n(The exact analytical derivation follows in the subsequent section.) \nDespite the fact that $\\tau_a^{-1} \\sim  G^2$, the presence of other parameters makes $\\tau_a $ range widely, \nthus indicating that the accretion effect may be negligible or dominant depending on the specific parameters at the moment. \n\n\n\nThe mathematical treatment of the deceleration process becomes significantly more complex if\nproper rotation,  and/or  magnetic fields of magnetized stars, and/or  interaction with surrounding plasma \nare included. \n\nIf the velocity, magnetic moment and angular velocity vectors \npoint in different directions, \nthe results are strongly dependent on the model configuration.\n\nMagnetosphere acts as an obstacle for the incoming accreting flow, \nthus reducing the accretion rate onto magnetized objects.  \nWhen the magnetic impact parameter $R_m$ is greater than the accretion radius $R_{ac}$ \ncalculated from the classical model \nto define the region of the surrounding medium involved in the accretion process, \naccretion is not important. \nIf $R_m < R_{ac}$, \nthe accreted mass accumulates near magnetic poles the most. \n(See \\citet{t-a12} and references therein.) \n\nAt the dimension-analysis level, \ncomparison of the characteristic time scales of all the mechanisms involved, performed for the specific circumstances of the problem at hand, \nreveals whether any of the mechanisms may be considered negligible and thus omitted. \nObviously, the more dominant process is the one with the smaller  $\\tau$.\n\nIn the following analysis, we focus exclusively on the accretion mechanism, \nand will ignore all other types of drag, magnetic and rotational effects. \n\n\n\\section{Accretion model}\n\nAs a physical phenomenon, accretion has been studied for a variety of settings. \nThe rate of accretion for moving stars is estimated from the expression $\\dot{M} = \\rho V \\times \\pi R_{ac}^2$.  \nHere $R_{ac}$ is the characteristic capture radius - the principal quantity.\nThe early works\n(\\citet{hl39} and\n\\citet{b52})\nconsidered the accretion onto a stellar body moving at a constant velocity through an infinite gas nebula. Subsequently, a variety of media has been considered:\ninterstellar medium, a stellar wind, or a common envelope (where two stellar cores become embedded in a large gas envelope formed when one member of the binary system swells).  \nSee, among others,  \n\\citet{p78},\n\\citet{r94},\n\\citet{ra94},\n\\citet{r96},\n\\citet{bkp97},\n\\citet{p00},\n\\citet{ts00},\n\\citet{b01},\n\\citet{ec04},\n\\citet{t-a12}.\nAccretion onto a neutron star from the supernova ejecta has also been extensively researched -- for a radially-outflowing ejecta\n\\citep{c71},\n\\citep{zin72},\nfor an in-falling ejecta\n\\citep{c89},\n\\citep{csw96}\nand when the object is moving at a high speed across the supernova ejecta\n\\citep{z-a07}.\n\nThese prior studies have considered media with low or moderate density.  \n\nIn this article, we provide an analysis for high density medium, \nsuch as the degenerate dense Fermi gas, examples of which are \nwhite or black dwarfs. \nThese dwarfs are the final stages in the evolution of stars not massive enough ($M<9 \\, M_{\\odot}$) to collapse into a neutron star or undergo a Type II supernova.  \nThey are composed of electron-degenerate matter with densities exceeding $10^7 \\, kg/m^3$. \nA black dwarf is a white dwarf that has sufficiently cooled to no longer emit visible light. \n\n\n{\\bf Equation of motion for body of variable mass.} The equation of motion for a body of variable mass follows from the law of conservation of linear momentum of the {\\it entire} system  composed of the object and the surrounding mass captured by the object.\nThus, when an object enters a dense gaseous \"cloud\", and surrounding nebula particles accrete onto the gravitationally powerful object, the motion of the object will be described by\n$ \\Delta ( M_* {\\mathbf V} ) - {\\mathbf v} \\, \\Delta M_* = \\Delta {\\mathbf I}$\n\\citep{m97}.\nHere $M_* (t)$ and  ${\\mathbf V} (t)$  denote, respectively, the mass and  velocity of the moving object in an inertial frame at instance $t$, ${\\mathbf v}(t)$ is the velocity (in the same frame) of the accreting nebula particles which compose mass $\\Delta M_*$), and $\\Delta (...)$ denotes change of quantities over the small finite interval of time $\\Delta t$. Qualitatively, this is the simplest model when particles of environment \"stick\" to the \"attractor\". Quantity $\\Delta {\\mathbf I} = M_* {\\mathbf w} \\, \\Delta t$  is the impulse of an external force ${\\mathbf F} = M_* \\, {\\mathbf w}$. Here, ${\\mathbf w}(t)$ is acceleration of the object in an inertial frame. Then it follows (in form of increments):\n\n", "index": 1, "text": "\\begin{equation}\n\\label{m1b}\n\\Delta {\\mathbf V} + ({\\mathbf V} - {\\mathbf v}) \\, {\\Delta M_*} / {M_*}  = {\\mathbf w} \\Delta t.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Delta{\\mathbf{V}}+({\\mathbf{V}}-{\\mathbf{v}})\\,{\\Delta M_{*}}/{M_{*}}={%&#10;\\mathbf{w}}\\Delta t.\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>𝐕</mi></mrow><mo>+</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐕</mi><mo>-</mo><mi>𝐯</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>M</mi><mo>*</mo></msub></mrow><mo>/</mo><msub><mi>M</mi><mo>*</mo></msub></mrow></mrow><mo>=</mo><mrow><mi>𝐰</mi><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03421.tex", "nexttext": "\nSince $(d / d t) ... = (d r / dt) (d / dr) ... = v_* (\\rho_e / \\rho_b) (d / dr) ...$ and $\\xi = r^3 v$, we obtain the simple equation\n\n", "itemtype": "equation", "pos": 33131, "prevtext": "\nIf the increment $\\Delta M_* \\rightarrow 0$, we obtain the classical Newtonian equation of motion for bodies of fixed mass. When the object mass changes, ${\\Delta M_*} \\neq 0$, the concept of a \"steady-moving\" body in absence of external actions (${\\mathbf w} = 0$) is not a precise one. Eq.~\\ref{m1b} is the basis of equations describing the rocket motion. The elementary work of the \"accretion\" force which is proportional to $\\Delta M_*$, is\n$    \\Delta {A} = - ( {1}/{2} ) {\\mathbf v}^2 \\,  \\Delta {M}$.  This work is negative when $\\Delta {M} > 0$ and therefore, the reduction of kinetic energy takes place (deceleration occurs). Obviously, this expression must be statistically averaged with respect to all possible values of velocities ${\\mathbf v}$ of the accreting particles  for the given $\\Delta M$ (see the main text of the paper). The part of this work is transformed into heat received by the object.\nThis quantity (per unit time) can be estimated as $\\dot{Q} \\simeq \\dot{M} \\langle {\\mathbf v} \\rangle^2 $ (to within a factor of the unit order).\n\nEq.~(\\ref{m1b}) must be statistically averaged with respect to all possible values of velocities ${\\mathbf v}$ of the accreting particles  for the given $\\Delta M_*$. After the averaging, the velocity  ${\\mathbf v}$ of accreting fragment $\\Delta M_*$ in Eq.~(\\ref{m1b}) which contains a large number of accreting particles is replaced by averaged $\\langle {\\mathbf v} \\rangle$, and transition $\\Delta t \\rightarrow dt$ is performed to write Eq.~(\\ref{m1b}) in terms of derivatives.\n\n\n\n{\\bf Calculation of averaged velocity of accreting particles.} The following step is to find the expression for $\\langle \\mathbf{v} \\rangle$  which obviously is not zero for the moving body in accordance with the simple philosophy that the body will collide with particles flying in face more often than with particles that are catching up him.\n\nWe assume the spherical symmetry of the velocity distribution of the gas particles and their spatial homogeneity, so that distribution function $f ({\\mathbf v}) = f (v)$ is a function of velocity module. The probability that any gas particle occupies element $d w = dv_x dv_y d v_z$ in the space of velocities is proportional to $d w \\, f (v).$ The probability of the object to capture the gas particle with velocity ${\\mathbf v}$ is proportional to the cross--section of interaction, i.e. to the product of the module of relative velocity of the particle with respect to the object ($|{\\mathbf v} - {\\mathbf V}|$) and $d w \\, f ( v )$. Thus, the average velocity is\n\\begin{eqnarray}\n\\label{vm1}\n\\langle {\\mathbf v} \\rangle =\n{\\int d w \\, {\\mathbf v} \\, |{\\mathbf v} - {\\mathbf V}| \\, f (v)} \\bigg/ {\\int d w \\, |{\\mathbf v} - {\\mathbf V}| \\, f (v)}\n\\end{eqnarray}\nDue to the axial symmetry of the problem, $\\langle {\\mathbf v} \\rangle$ is co-linear with ${\\mathbf V}.$ In the spherical coordinate system with\n$d w = $ $2 \\pi d \\theta \\, \\sin \\theta \\, d v \\, v^2$ where $\\theta$ is the angle between ${\\mathbf v}$ and ${\\mathbf V},$\n\\begin{eqnarray*}\n\\langle v \\rangle = \\nonumber \\\\\n\\frac{ 2 \\pi \\int_0^{\\infty} \\int_0^{\\pi} d v \\, v^2 \\, d \\theta \\, \\sin \\theta \\, f (v) v \\, \\cos\n\\theta \\, \\sqrt{v^2 + V^2 - 2 v V \\cos \\theta} }{ 2 \\pi \\int_0^{\\infty} \\int_0^{\\pi} d v \\, v^2 \\, d\n\\theta \\, \\sin \\theta \\, f (v) \\, \\sqrt{v^2 + V^2 - 2 v V \\cos \\theta} } ,\n\\end{eqnarray*}\nwhich, after integrating with respect to angle $\\theta, $ produces the following expression:\n\\begin{eqnarray*}\n\\langle v \\rangle = \\nonumber \\\\\n\\frac{\\int_0^V d v \\, v^3 f (v) [\\frac{2}{3} v - \\frac{2}{15}\n\\frac{v^3}{V^2}] + \\int_V^{\\infty} d v \\, v^3 f (v) [\\frac{2}{3} V - \\frac{2}{15}\n\\frac{V^3}{v^2}]}{\\int_0^V d v \\, v^2 f (v) [2 V + \\frac{2}{3} \\frac{v^2}{V}] + \\int_V^{\\infty} d v \\,\nv^2 f (v) [2 v + \\frac{2}{3} \\frac{V^3}{v^2}]} .\n\\end{eqnarray*}\n\nThe obtained expression permits the use of any distribution function, both the Maxwell-Boltzmann $f (v) \\sim \\exp (- v^2 m / 2 k T)$ for high temperatures and the Fermi one for low temperatures. Technically, both distributions give similar results (Fig.~\\ref{averv}).\n\nWe assume that the surrounding gas is composed purely of ionized hydrogen--degenerate electron--proton plasma. Since $m_p \\gg m_e$, only the proton component is significant for the object mass change.\n\nWe consider in more detail  the distribution for the full degenerate Fermi gas of proton component  which is valid when the temperature of medium $T \\ll T_{Fp}$.\nFor the distribution with respect to velocities of fully degenerate non--relativistic Fermi gas of protons/nuclei\n\\citep{f62},\n\\citep{f29},\n$f (v) \\sim H ( v_{Fp} - v)$, where $v_{Fp}$ is the local Fermi boundary velocity of the nebula heavy particles and $H ( \\xi )$ is the Heaviside step function. Parameter $v_{Fp}$ is defined as $v_{Fp} = (6 \\pi^2 /2)^{1/3} (\\hbar / m_p ) (\\rho / m_p )^{1/3} = (m_e / m_p) v_{Fe} \\ll v_{Fe}$. Numerically this gives $v_{Fp} = 1.643 \\times 10^2 \\rho^{1/3} \\; m \\, s^{-1}$ where $\\rho$ is measured in $kg \\, m^{-3}$. Even for rather large densities of accreting medium (for example, for a white dwarf near the boundary of stability $\\rho = 10^9 \\, kg \\, m^{-3}$) when $v_{Fe}$ becomes relativistic, for proton component $v_{Fp}  \\ll c = 2.99 \\times 10^8 \\, m \\, s^{-1}$. When temperatures of $p-$ and $e$--components of the medium are of the same order, parameter $v_{Fp}$ is of the same order as the speed of sound in the medium. To simplify the subsequent analysis, we introduce dimensionless velocity, $V / v_{Fp} \\rightarrow V$, and\nexpress $\\langle v \\rangle$ as $\\langle v \\rangle \\equiv  v_F \\Phi (V)$ with function\n\\begin{eqnarray}\n\\Phi (V) =  \\frac{-4 + 28 V^2 + \\alpha_1(V) H(1 - V)}{7 V (-4 (1 + 5 V^2) + \\alpha_2 (V) H(1 - V))} < 0.\n\\quad \\label{v-m2}\n\\end{eqnarray}\nHere, $\\alpha_1 (V)=(-1 + V)^4 (4 + 16 V + 12 V^2 + 3 V^3)$, $\\alpha_2 (V) = (-1 + V)^4 (4 + V)$ and $H (s)$ is the Heaviside function.\nBehavior of $\\Phi (V)$  is given in Fig.~\\ref{averv}.\nA good polynomial approximation of $\\Phi (V)$ is\n$\n\\Phi (V) \\simeq  (- 0.333 V  + 0.318 V^3 - 0.135 V^5 )H(0.795 - V) + \\\\\n( - 0.2 V^{-1}\n+ 0.067 V^{-3} - 0.009V^{-5}) H(V - 0.785).\n$\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig1.eps}\n\\caption{\nVelocity correction $\\Phi (V) \\sim - \\langle v \\rangle$ calculated as a functional of different functions of distribution:\nthe Fermi distribution (where function $f (v)$ is proportional to the Heaviside function, $f (v) \\sim H (v_F - v)$) (base line),\nand the Maxwell distribution (where $f (v) \\sim \\exp (- v^2 / \\beta v_{Fp}^2)$) shown for $\\beta = 1, \\, 2, \\, 2.5, \\, 3$ (lower to upper lines).\nIn the presented example, both Fermi and Maxwell distributions are similar when $\\beta = 2.5$.\n}\n\\label{averv}\n\\end{figure}\n\n\n{\\bf Mass accumulation.} Then Eq.~(\\ref{m1b})  takes form suitable for our analysis:\n$\\label{eqm1b}\n{d {V}} / {(V - \\Phi (V))} =  - {d M_*} /{M_*} $.\nThe mass and the time-derivative of the mass of the object are expressed in terms of $V$  as\n\\begin{eqnarray}\n\\label{eqm1e1}\nM_* (t) = M_0 \\exp \\int_{V(t)}^{V (0)} \\frac{d \\xi}{\\xi - \\Phi (\\xi)}\n\\equiv M_0 \\exp J(t) .\n\\end{eqnarray}\nFurther, we transition to dimensionless variables and express the object mass $M_*(t)$ in terms of (constant) $M_0$ (which from this point on will be called the \\emph{initial} mass of the object) and the normalized variable  $m(t)$, so that  $M_*(t) = M_0 m(t)$. We assume for simplicity the density of the accreting medium to be constant $\\rho_F$.\nThe dimensionless mass of the object evolves as\n\\begin{eqnarray}\n\\label{eqm1e2}\n \\dot{m} =  - (V - \\Phi (V)^{-1} \\exp J (t) \\dot{V} .\n\\end{eqnarray}\nshowing that when $\\dot{V}  < 0$, deceleration, mass $m (t)$ is increasing, $\\dot{m}  > 0$.\n\n\n{\\bf Regimes of motion and results of calculation.}\nTo close  the system of the equations, we have to propose an evolution equation for the mass of the object,  \ni.e. $\\dot{M}_* = \\dot{M}_* (M_*, V, ...)$.\n\nThe simplest model is to assume that the object \nmass increases due to the simple \"adhesion\" of the surrounding particles and  that its mass increases proportionally to the effective surface area, \ni.e.  $\\dot{M}_* \\sim 4 \\pi R^2 (t)$ (Appendix~\\ref{ap:2}).\n\nA more complex model includes  \nthe traditional interpolation  for $ \\dot{M}_*$ (proposed in  \\citet{b52}  for accretion onto both  a resting and  a moving object)\n(see also,\n\\citet{st83}, p.~420).\n\nBondi--Hoyle--Lyttleton (BHL) accretion, in its simplest form, considers a point mass moving through a gas cloud \nthat is presumed to be non-self-gravitating and uniform at infinity.\nGravity focuses the gas cloud particles behind the point mass. \nGas particles then accrete to the mass.\n\n\n\n\n(See \\citet{ec04} and Refs therein.)\n\nThis expression can be presented (with a small reformulation) in form\n\\begin{eqnarray}\n\\frac{\\dot{M}_* }{M_*} = 4 \\pi \\kappa G^2  M_*  \\frac{ \\rho^{5/2} }{ (\\rho V^2 + P)^{3/2}}\n\\label{b0f}\n\\end{eqnarray}\nHere, the left part of equation represents the rate of mass change of the object,  \nthe right one is defined by factors which governs the accretion process, $\\rho$ is a characteristic medium density, $V$ is the velocity of the object with respect to medium, $s$ is the (isothermical) sound speed in the medium  (at large distance from the object), $P = \\rho s^2$, numerical coefficient $\\kappa$ is of the order of unity. \n(See Appendix~B.)\n\nThe BHL formula written in the form of Eq.~(\\ref{b0f}) shows that it can be obtained from simple arguments based on the dimensional analysis. In fact, the rate of accretion ${\\dot{M}_* } / {M_*}$ has to be faster when the object \nis massive, i.e. ${\\dot{M}_* } / {M_*} \\sim {M_*}$. The process is governed by the gravity, $G$, and by the principal properties of the medium: density, $\\rho$, and pressure $P (\\rho, ...)$ which determines the equation of state. The only dimensional combination of $G$, $\\rho$ and $P$ which produces the necessary dimension, is $M_* \\times G^2 \\rho^{5/2} P^{-3/2} $. In a moving medium, the pressure must be replaced by the dynamical pressure $P + \\rho V^2$. From here, Eq.~(\\ref{b0f})  is obtained.\n\nIn such case (and with $M_* \\rightarrow M_0 m (t)$ , $P = \\rho s^2$  and $V \\rightarrow v_{Fp} V$) the dimensionless form of the equation takes a simple form.\nBy combining Eq.~(\\ref{b0f}) with Eqs.~(\\ref{m1b}), (\\ref{eqm1e1}) and (\\ref{eqm1e2}), we obtain\n\\begin{eqnarray}\n\\frac{d V}{d t} = - \\bigg( 4 \\pi \\kappa \\frac{\\rho G^2 M_0}{s^3}  \\bigg) \\frac{V - \\Phi (V)}{(\\epsilon V^2 + 1)^{3/2}} \\, \\exp (-J (t)) .\n\\label{b1f}\n\\end{eqnarray}\nHere $\\epsilon = m_e / m_p \\ll 1$. Coefficient $\\beta$  (expression in parentheses)\ncan be written as  $\\beta \\equiv \\tau^{-1} = (4 \\pi \\kappa ) \\rho G^2 M_0 /s^3 = 1.995 \\times 10^3 (4 \\pi \\kappa ) (M_0 / M_{\\odot})$,\nwhere\n$M_{\\odot} = 1.989 \\times 10^{30} \\, kg$ is the Sun mass, $\\tau$ is the characteristic time scale. Function $J (t)$ is defined by Eq.~(\\ref{eqm1e1}). Eqs.~(\\ref{v-m2})--(\\ref{b1f})  complete the system of necessary equations.  Eq.~(\\ref{b1f}) establishes the time scale $\\tau^{-1} = (4 \\pi \\kappa) (\\rho G^2 M_0 / s^3) $, which depends on the initial mass of the object and the properties of the target medium. By expressing the physical parameters of the problem in units $\\tau$ (for time) and $v_{Fp}$ (for velocity), we obtain the universal solution for the basic set of equations.\n\n\n\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig2.eps}\n\\caption{\nEvolution of the colliding object's velocity,\nfor initial velocities $V_0 = 0.3$ (lower line),  $V_0 = 1$ and $V_0 = 3$ (upper line).\n}\n\\label{velocities}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig3.eps}\n\\caption{\nEvolution of the colliding object's (dimensionless) deceleration,\nfor initial velocities $V_0 = 3$ (lower line),  $V_0 = 1$ and $V_0 = 0.3$ (upper line).\n}\n\\label{decelerations}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig5.eps}\n\\caption{\nNormalized (by $M_0$) total mass of the colliding object as function of time for different initial velocities: $V_0 = 3, \\; 1, \\; 0.3$ (from lower line to upper line).\nWhen the object stops, $V \\rightarrow 0$, the accreted mass $M \\rightarrow \\infty$.\nIn such situation, the used approximations are no longer valid, and the general relativity approximation has to be taken into consideration.\n}\n\\label{mass}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\centering\n\\includegraphics[width=7.0cm]{SDCO-Fig4.eps}\n\\caption{\nThe dimensionless path of\nthe object\nas function of time for different initial velocities: $V_0 = 0.3, \\; 1, \\; 3$ (from lower line to upper line).\n}\n\\label{distances}\n\\end{figure}\n\n\nThe greater is the density of the surrounding medium, the stronger is the deceleration effect.\n\nFigs~\\ref{velocities}--\\ref{distances} illustrate the model results for several initial conditions.\nThe figures show the evolution of each scenario (characterized by the initial dimensionless velocities $V_0 = 0.3, \\; 1, \\; 3$) until the object decelerates to a stop. Note that the state of full stop is an asymptotic state. Neither the Bondi formula, nor the modified version of it presented in this analysis, properly describe the process in the vicinity of such state. It implies that the entire (infinite) mass of the accreted medium is captured by the object within the finite period of time. In reality, of course, the target has a finite mass, and once it is captured no further accretion (and therefore deceleration) occurs.\n\n\nHowever, in the domain of parameters where the model is reasonably accurate and valid, it appears that in all three scenarios the object significantly decelerates (approaches its full stop) once it accretes the amount of mass equal to several times its initial mass. Which means that if the relative sizes of the object and the target are such that the entire accreted mass is \"small\" (not sufficient to decelerate the object to a full stop), the deceleration would vanish once the entire target mass is accreted or once the object exits the zone of influence.\n\nFig.~\\ref{decelerations} also reveals that the magnitude of deceleration is the greatest at the beginning of the process and can be quite non-negligible.\n\nSpecific evolution scenarios depend on the \nrelationship between several characteristic times: time-of-flight $\\tau_p \\simeq R/V_0$, or $\\simeq (\\rho_{object}/\\rho_{target})^{1/3}R/V_0$, time of hydrodynamical ï¿½unloadingï¿½ $\\tau_h \\simeq R/s$ inside of target, and characteristic time of accretion $\\tau_a$. Here, $R$ is the characteristic size of the target. \nDepending on the combination of these parameters, different outcomes occur affecting the states of the involved bodies. However, the comprehensive analysis of such scenarios is beyond the scope of this publication.\n\n\n\n\\section{Conclusion}\n\nAccretion-caused deceleration occurs when a gravitationally-powerful object moves through a medium, captures the surrounding particles, and decreases its kinetic energy and momentum as its mass increases. \n\nIn this article, we presented an analysis of such scenario for \na compact (small in size), \nnon-rotating and non-magnetized,  \ngravitationally-powerful object \ncolliding head-on (simple model geometry) \nwith \na high-density medium (a white or black dwarf, for example). \n\nBy describing the motion of the variable-mass body,\nwe demonstrated that the magnitude of the deceleration \n(caused only by accretion and no other mechanisms) \nmay indeed be substantial depending on the initial conditions. \n\nThere are several implications stemming from this result.\n\nFirst, \nas mentioned earlier, \none of the hypothesized scenarios for the formation of a Thorne-Zytkow object \n(a red giant or supergiant containing a neutron star at its core) \nis a collision of the two objects, the giant and the neutron star. \nIn our demonstration, despite its intentional simplicity, \nthe results at the qualitative level \nappear to be consistent with such scenario.  \nAs shown in Fig.~\\ref{distances}, \nthe neutron star may be completely captured by the target (the full-stop case), \nor the neutron star may accrete mass from the target without stopping.  \nIn both cases, \nthe resulting object may be described as a neutron star surrounded by a gigantic envelope.\nThe exact outcome would depend on the  initial characteristics of the involved objects,\nproducing a TZO with   \na larger-sized giant in the first case and a TZO with a smaller-sized giant in the second.\nTherefore, \naccretion may play an important role in the formation of the Thorne-Zytkow objects, \neven if taken as a stand-alone mechanism, \nand thus its contribution should not be neglected in  complex and more realistic multi-mechanism models. \n\n\nIn this article, we derived the proper mathematical description \nfor the highly dense medium (degenerate Fermi-gas) \nthat is better suited for targets like white or black dwarfs, whose densities exceed $10^7 \\, kg/m^3$. \n\nPrior studies of accretion considered only low or medium density media. \n\n\nSecond, \nwhile the accretion-caused deceleration effect is interesting on its own, \nwhen it is applied to the stellar objects composed of nuclear matter  \nwith particular equations of state (EOS),  \nthe situation deserves a special attention.\n As well known, \njust like  traditional matter, \n nuclear matter  \n has its critical state with its critical temperature and density. \n(See, for example,  \\citet{j83}, \\citet{j84}, \\citet{apr98}, \\citet{k06} and \n\\citet{k-a11} \nand references therein.) \n\nThis means that if the matter of the elastic stellar object is in the state close to the boundary of liquid/gas phase transition \n(near the spinodal zone where the matter can transition into the state of \"nuclear fog\"), \nthen speed of density perturbation propagation is close to zero. \n\nThen even relatively small deceleration may lead to strong stratification of the interior matter of the compact object. \nThe space scale of this stratification is defined by the ratio of sound speed square and deceleration magnitude.    \nZones of compression and decompression appear throughout the compact object interior.   \n\nWithin the decompression zones, \nin the environment of the nuclear fog, \nexplosive nuclear reactions (fusion and fission of fragments) may start. \n(\\cite{tp13}  examine this in more detail.)\n\n\nTo conclude, while accretion onto neutron stars (and other compact gravitationally-powerful stellar objects \nsuch as fragments of a neutron star, \nquark star, strange stars, etc.)  \nwould rarely occur as a stand-alone process, \nin some cases \nit may meaningfully contribute to the aggregate deceleration experienced by the stellar objects. \nFor non/low-magnetized objects, accretion may actually play the dominant role in the deceleration \nof the objects when they collide with other stellar bodies or traverse an encountered medium. \nIn this article, we provided a new model for the treatment of dense accreting medium.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\appendix\n\n\\section{Deceleration due to adhesion}\n\\label{ap:2}\n\nConsider a body moving in a dense medium. We suppose that the interaction of the surrounding particles with the body is governed by short-range  forces. Such interaction is modeled by the adhesion mechanism where particles of the environment simply adhere to the body.  Consequently, the mass and the volume of the moving body increase.  We suppose that the rate of mass increase is proportional to the surface of the body and density of environment., i.e. $\\dot{M} (t) \\sim \\rho_e \\, 4 \\pi r^2 (t)$. Here, $r (t)$ is the radius of the body, $\\rho_e$  is the density of the medium  (a classical example is of the  drop which is moving in a saturated vapor of water).\n\nWe suppose that the density of the body stays constant during the process at least in leading approximation.  The mass is $M = \\rho_b (4 \\pi /3) r^3 $. From $d / dt [ \\rho_b (4 \\pi /3)  r^3 ]= v_* \\rho_e \\, 4 \\pi r^2 $, we can find  that the rate of radius increase is constant $\\dot{r} = v_* (\\rho_e / \\rho_b)$.  Parameter $v_*$ has the dimension of velocity.  The meaning of this parameter is the characteristic velocity of adhesion of particles of the environment to the surface of the body. This parameter is determined by the regime of plasma-dynamical flow in the surrounding medium which is not a trivial problem because the process of adhesion depends strongly on the model of the environment,  for example on the equation of state of the surrounding matter.\n\nThe classical equation of motion of the body of variable mass in presence of the traditional hydrodynamical  drag is  $M \\dot{\\mathbf v} = - C \\rho_e r^2 v^2  {\\mathbf n}_v +  {\\mathbf c} \\dot{M}$,  where ${\\mathbf c} = {\\mathbf V} - {\\mathbf v}$. Here, $\\mathbf V$ is the velocity of the medium particle adhered to the body in an inertial frame, $\\mathbf v$   is the body velocity in the same frame, the drag is proportional to square of the body velocity, dimensionless parameter $C$ is of order unity.\n\nWe suppose for simplicity that all particles of the environment are immobile in the initial non--perturbed state, ${\\mathbf V} = 0$. This is assumed to simplify the consideration and to obtain an analytical solution.  The equation of motion becomes\n\n", "index": 3, "text": "\\begin{equation}\nM \\frac{d v}{dt} = - C \\rho_e r^2 v^2  - v \\frac{d M}{dt} ,  \\quad  \\rightarrow \\quad\n\n\n\n\\frac{d }{dt} (\\frac{4 \\pi}{3} r^3 v) =   - C \\frac{\\rho_e}{\\rho_b} r^2 v^2.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"M\\frac{dv}{dt}=-C\\rho_{e}r^{2}v^{2}-v\\frac{dM}{dt},\\quad\\rightarrow\\quad\\par&#10;%&#10;\\par&#10;\\par&#10;\\frac{d}{dt}(\\frac{4\\pi}{3}r^{3}v)=-C\\frac{\\rho_{e}}{\\rho_{b}}r^{2}v%&#10;^{2}.\" display=\"block\"><mrow><mrow><mrow><mrow><mi>M</mi><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>v</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><mi>C</mi><mo>⁢</mo><msub><mi>ρ</mi><mi>e</mi></msub><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>v</mi><mn>2</mn></msup></mrow></mrow><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>M</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mo>→</mo></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><mfrac><mi>d</mi><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow><mn>3</mn></mfrac><mo>⁢</mo><msup><mi>r</mi><mn>3</mn></msup><mo>⁢</mo><mi>v</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mi>C</mi><mo>⁢</mo><mfrac><msub><mi>ρ</mi><mi>e</mi></msub><msub><mi>ρ</mi><mi>b</mi></msub></mfrac><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>v</mi><mn>2</mn></msup></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03421.tex", "nexttext": "\nwhich can be resolved analytically :\n\n\n\n", "itemtype": "equation", "pos": 33463, "prevtext": "\nSince $(d / d t) ... = (d r / dt) (d / dr) ... = v_* (\\rho_e / \\rho_b) (d / dr) ...$ and $\\xi = r^3 v$, we obtain the simple equation\n\n", "index": 5, "text": "\\begin{equation}\n\\frac{d \\xi }{\\xi^2} = - ( \\frac{3 C}{4 \\pi v_*} )  \\frac{d r}{r^4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\frac{d\\xi}{\\xi^{2}}=-(\\frac{3C}{4\\pi v_{*}})\\frac{dr}{r^{4}}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>ξ</mi></mrow><msup><mi>ξ</mi><mn>2</mn></msup></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mfrac><mrow><mn>3</mn><mo>⁢</mo><mi>C</mi></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>v</mi><mo>*</mo></msub></mrow></mfrac><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>r</mi></mrow><msup><mi>r</mi><mn>4</mn></msup></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03421.tex", "nexttext": "\nHere, argument  $s = (r_0 + v_* (\\rho_e / \\rho_b) t) / r_0$,  $\\alpha = C / 4 \\pi v_*$ and  $r = r_0$ and $v = v_0$ at $t =0$.  It follows from here that the characteristic time of the process of deceleration is $\\tau \\sim r_0 / v_* (\\rho_b / \\rho_e) $. For $t \\gg \\tau$ and $v \\gg v_*$, the regime of deceleration becomes the universal one and independent on an initial velocity of the body. Obviously, Eq.~(\\ref{sol})  should be regarded only as the zero--approximation in the averaged on all possible values of parameter $\\langle {\\mathbf V} \\rangle$, which is obviously not zero  for the moving body in accordance with the simple observation that the body will collide with the particles flying in its face more often than with the particles that are catching up to it.\n\nThe deceleration can be written now as\n\\begin{eqnarray}\na = - \\frac{3 C}{4 \\pi} \\frac{\\rho_e}{\\rho_b} \\frac{v^2}{r}  - 3  \\frac{ \\rho_e}{\\rho_b} \\frac{v_* v}{r},\n\\end{eqnarray}\nor\n\\begin{eqnarray}\na = - \\frac{3 C}{4 \\pi} ( \\frac{\\rho_e}{\\rho_b} ) \\frac{v_0^2}{r_0}  \\frac{1}{s (s^3 + \\alpha  v_0  ( s^3 -  1 ))^2}  -\n\n3 (\\frac{\\rho_e}{\\rho_b}) \\frac{v_* v_0}{r_0} \\frac{1}{s (s^3 + \\alpha  v_0  ( s^3 -  1 ))} ,\n\\end{eqnarray}\n\nIf parameter $v_* \\sim v_0$, the mechanism of deceleration due to adhesion may be comparable in magnitude with the mechanism of deceleration due to drag.\n\n\n\\section{Interpolating expression for pressure in medium.}\n\nTo assess  the form of the EoS of the target medium, we consider here the simplest plasma composed from protons\n and electrons.\n\nThe form of equation of state depends on how the temperature of the medium $T$ compares to characteristic temperatures.\nOne can introduce the following characteristic temperature parameters:\ntemperature of ionization $T_i \\sim 10 \\, ev$,\nFermi temperature for proton component $T_{Fp} (\\rho )$,\nFermi temperature for electron component $T_{Fe} (\\rho ) \\sim (m_p / m_e) T_{F p} \\sim 10^{3} T_{F p}$ for non-relativistic electrically neutral plasma,\nand temperature $T_r \\sim m_e c^2 \\simeq 0.5 \\, Mev$ when relativistic effects must be taken into consideration.\nObviously,  $T_i \\ll T_{Fp} \\ll T_{Fe} \\ll T_r$. We consider the case when  $T > T_i$.\n\nWe assume for simplicity  that temperatures of the two components of plasma are of the same order: $T_e \\simeq T_p = T$. Electrical neutrality of plasma signifies  $n_p = n_e =n$.  Here, $n_{e,p}$ is the number of free electrons/protons per unit volume. Masses of protons and electrons satisfy $m_p \\gg m_e$. The density of plasma is $\\rho = m_p n_p + m_e n_e \\simeq m_p n$. The form of pressure depends on the level of temperature $T$ relative to the Fermi temperatures $T_{Fp}$ and $T_{Fe}$.\n\nFor high  temperatures, $T > T_{Fe} = E_{Fe} $ where $E_{Fe}$ is the Fermi energy for electron component,\n both components of the plasma can be considered as classical gas, i.e. the equation of state is $P =  T( n_p + n_e)  \\simeq ( {2  T }/{m_p}) \\rho $. For low  temperatures, $T < T_{Fp}$, the pressure is essentially determined by the degenerate electron component, because of $m_p \\gg m_e$, for which the electron degeneracy pressure in a medium can be computed as\n\\begin{eqnarray*}\nP = \\frac{2}{3} \\frac{E_{tot}}{V} =\n\\frac{(3 \\pi^2)^{2/3} \\hbar^2}{5 m_e} n_e^{5/3} \\equiv  \\frac{2}{5} n E_F= \\frac{(3 \\pi^2)^{2/3} \\hbar^2}{5 m_e m_p^{5/3}} \\rho^{5/3} .\n\\end{eqnarray*}\nHere, $\\hbar $ is the reduced Planck constant.\n\nWhen electron energies reach relativistic levels (white dwarf with mass $0.3  M_{\\odot}< M <  M_{Ch}$; the Chandrasekhar limit $ M_{Ch} \\sim 1.4 M_{\\odot}$), a modified formula is required, $P \\sim \\rho^{4/3}$: for the relativistic degenerated matter, the equation of state is \"softer\" and $E_{Fe} = \\hbar c (3 \\pi^2 n_e)^{1/3} $ for the ultra--relativistic case. In fact, pressure scales with density as $n^{5/3}$ provided that the electrons remain non--relativistic (speeds $v \\ll c$). This approximation breaks down when the white dwarf mass is close to the boundary of stability to become a neutron star. The relativistic and non--relativistic expressions for electron degeneracy pressure are approximately equal at about\n$n_e =10^{36} \\, m^{-3}$, about that of the core of a $0.3 \\, M_{\\odot}$ white dwarf. As long as the star is not too massive, the Fermi pressure prevents it from collapsing under gravity and becoming a black hole.\n\nSo, we can use the simple interpolation expression for qualitative estimation of EoS in domain $T_{Fp} < T < T_{Fe}$ when one can neglect the relativistic effects:\n\\begin{eqnarray}\nP \\simeq \\frac{2 T }{m_p} \\rho + \\frac{(3 \\pi^2)^{2/3} \\hbar^2}{5 m_e m_p^{5/3}} \\rho^{5/3}\n\\end{eqnarray}\nQuantity  $P / \\rho$ has the dimension of the square of velocity \nand determines the order of  square of speed of propagation of small density perturbations in a medium.\n\nIn domain $T < T_{Fp}$, both components of plasma are degenerated, and we obtain\n\\begin{eqnarray}\nP \\simeq  \\frac{(3 \\pi^2)^{2/3} \\hbar^2}{5 m_p^{5/3}} (\\frac{1}{m_p} + \\frac{1}{m_e} ) \\rho^{5/3}\n \\simeq \\frac{(3 \\pi^2)^{2/3} \\hbar^2}{5 m_e m_p^{5/3}} \\rho^{5/3}\n\\end{eqnarray}\n\n\n\n\n\\section{Conflict of Interests}\n\nThe authors declare that there is no conflict of interests regarding the publication of this paper.\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{299} \n\n\n\n\\bibitem[\\protect\\citeauthoryear{Akmal et al.}{1998}]{apr98}\nAkmal,~A., Pandharipande,~V.R., \\& Ravenhall,~D.G. 1998,\n\nPhys. Rev. C, 58, 1804\n\n\n\\bibitem[\\protect\\citeauthoryear{Bisnovatyi-Kogan \\& Pogorelov}{1997}]{bkp97}\nBisnovatyi-Kogan, G.~S., \\& Pogorelov, N.~V. 1997,\n\nAstronomical and Astrophysical Transactions, 12, 263\n\n\\bibitem[\\protect\\citeauthoryear{Bondi}{1952}]{b52}\nBondi, H. 1952, \\mnras, 112, 195\n\n\\bibitem[\\protect\\citeauthoryear{Bonnel et al.}{2001}]{b01}\nBonnell, I.~A., Bate, M.~R., Clarke, C.~J., \\& Pringle, J.~E. 2001, \\mnras, 323, 785\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Chandrasekhar}{1943}]{ch43}\nChandrasekhar, S. 1943, \\apj, 97, 255\n\n\\bibitem[\\protect\\citeauthoryear{Chevalier}{1989}]{c89}\nChevalier, R.~A. 1989, \\apj, 346, 847\n\n\\bibitem[\\protect\\citeauthoryear{Colgate}{1971}]{c71}\nColgate, S.~A. 1971, \\apj,  63, 221\n\n\\bibitem[\\protect\\citeauthoryear{Colpi et al.}{1996}]{csw96}\nColpi, M., Shapiro, S.~L., \\& Wasserman, I. 1996, \\apj, 470, 1075\n\n\\bibitem[\\protect\\citeauthoryear{Dokuchaev}{1964}]{d64}\nDokuchaev, V.~P. 1964,\n\n\\sovast, 8, 23\n\n\\bibitem[\\protect\\citeauthoryear{Edgar \\& Clarke}{2004}]{ec04}\nEdgar, R., \\& Clarke, C. 2004,\n\n\\mnras, 349, 678\n\n\n\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Fermi}{1946}]{f62}\nFermi, E. 1965, A course in Neutron Physics (document LADC-225, 5 February 1946), in Collected Papers of Enrico Fermi (Chicago: Univ. Chicago Press)\n\n\\bibitem[\\protect\\citeauthoryear{Fermi}{1929}]{f29} Fermi, E.:\na) 1929, Rend. Lincei \\textbf{9}, 984;\nb) in Pontecorvo B., Pokrovskii V., eds, \\emph{Scientific Works of E. Fermi}, Nauka, Moscow (1972) [p.588, in Russian ]; see also \\emph{Collected Papers of Enrico Fermi}, Univ. Chicago Press, Chicago (1965)\n\n\\bibitem[\\protect\\citeauthoryear{Geier et al.}{2015}]{g15}\nS. Geier, F. Furst, E. Ziegerer, T. Kupfer, U. Heber, A. Irrgang, B. Wang, Z. Liu, Z. Han, B. Sesar, D. Levitan, R. Kotak, E. Magnier, K. Smith, W. S. Burgett, K. Chambers, H. Flewelling, N. Kaiser, R. Wainscoat, C. Waters, 2015,\n\nScience 347, no. 6226, pp. 1126-1128\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Hills}{1988}]{h88}\nHills, J. G. 1988,\n\nNature 331, 687-689\n\\url{doi:10.1038/331687a0}\n\n\\bibitem[\\protect\\citeauthoryear{Hoyle \\&  Lyttleton}{1939}]{hl39}\nHoyle, F., \\&  Lyttleton, R. A. 1939, Proc. Cambridge Philos. Soc., 36, 323\n\n\\bibitem[\\protect\\citeauthoryear{Jaqaman at al.}{1983}]{j83}  Jaqaman, H., Mekjian, A. Z., \\& Zamick, L. 1983, Phys. Rev., 27, 2782\n\n\\bibitem[\\protect\\citeauthoryear{Jaqaman et al.}{1984}]{j84} Jaqaman, H.R., et al. 1984, Phys. Rev. C, 29,  2067\n\n\\bibitem[\\protect\\citeauthoryear{Karnaukhov}{2006}]{k06} Karnaukhov, V. A. 2006,\n\nPhys. elem. particles, 37 (2), 313\n\n\\bibitem[\\protect\\citeauthoryear{ Karnaukhov et al.}{2011}]{k-a11}\nKarnaukhov,~V.A., Avdeyev, S.P., Botvina, A.S., Cherepa- nov, E.A., Karzc, W., Kirakosyan, V., Kuzmin, E.A., Oeschler, H., Rukoyatkin, P.A., \\& Skwirczynska, I. 2011, Properties of Hot Nuclei Produced in Relativistic Collisions;\npreprint(\\url{http://fias.uni-frankfurt.de/historical/nufra2011/talks/Karna-NUFRA.pdf})\n\n\\bibitem[\\protect\\citeauthoryear{Khokhlov et al.}{1993a}]{knp93a}\nKhokhlov, A.~M., Novikov, I.~D., \\& Pethick, C.~J. 1993,\n\n\\apj, 418, 163\n\n\\bibitem[\\protect\\citeauthoryear{Khokhlov et al.}{1993b}]{knp93b}\nKhokhlov, A.~M., Novikov, I.~D., \\& Pethick, C.~J. 1993,\n\n\\apj, 418, 181\n\n\n\n\n\n\t\t\n\\bibitem[\\protect\\citeauthoryear{Landau \\& Lifshitz}{1987}]{ll87}\nLandau, L. D., \\& Lifshitz, E. M. 1987, Fluid Mechanics (Oxford: Pergamon) \n\n\\bibitem[\\protect\\citeauthoryear{Levesque et al.}{2014}]{lmzm14}\nLevesque, E.M., Massey, Ph., Zytkow, A. \\& Morrell, N. 2014,\n\nMonthly Notices of the Royal Astronomical Society: Letters 443: L94. arXiv:1406.0001.\n\t\t\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Meshcherski}{1897}]{m97}\nMeshcherskii, I.~V. 1897, PhD thesis, Univ. S-Peterburg\n\nThe basic equation obtained in this work follows from an elementary calculation of difference of linear moments in final and initial states of the full system. In modern notation, this is\n$\\Delta ( M_* {\\mathbf V} ) = (M_* + \\Delta M_*) ({\\mathbf V} + \\Delta {\\mathbf V}) +\n(- \\Delta M_*) ({\\mathbf V} + \\Delta {\\mathbf V} + {\\mathbf V}_{rel}) - M_* {\\mathbf V} = {\\mathbf F} \\,\n\\Delta t ,$\nwhere $M = M_* + \\Delta M_* + (- \\Delta M_*)$, ${\\mathbf V}_{rel}$ is a relative velocity of mass\n$(-\\Delta M_*)$ with respect to $M_* (t).$\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Ostriker}{1999}]{o99}\nOstriker, E. 1999,\n\n\\apj, 513, 252\n\n\n\\bibitem[\\protect\\citeauthoryear{Pavlov \\& Sukhorukov}{1985}]{ps85}\nPavlov, V. I., \\& Sukhorukov, A. I. 1985,\n\nSov. Phys. Usp., 28 (9), 784\n\n\\bibitem[\\protect\\citeauthoryear{Pavlov \\& Kharin}{1990}]{pk90}\nPavlov, V. I., \\& Kharin, O. A. 1990,\n\nZh. Eksp. Teor. Fiz., 98, 377  [Sov. Phys. - JETP, 71 (2), 211--216 (1990)]\n\n\n\\bibitem[\\protect\\citeauthoryear{Pavlov \\& Tito}{2009}]{pt09}\nPavlov, V. I., \\& Tito, E. P. 2009,\n\nJ. Acoust. Soc. Am., 125 (2), 676\n\n\\bibitem[\\protect\\citeauthoryear{Petterson}{1978}]{p78}\nPetterson, J. A. 1978, \\apj, 224, 625\n\n\\bibitem[\\protect\\citeauthoryear{Pogorelov}{2000}]{p00}\nPogorelov, N., et al. 2000,\n\n\n\\apss, 274, Issue 1/2, 115\n\n\\bibitem[\\protect\\citeauthoryear{Rees}{1990}]{ree90}\nRees M. J., 1990,\n\nScience 247, 4944 (Feb. 16, 1990), pp. 817-823\n\n\\bibitem[\\protect\\citeauthoryear{Ruffert}{1994}]{r94}\n\nRuffert, M. 1994, \\apj, 427, 342\n\n\\bibitem[\\protect\\citeauthoryear{Ruffert  \\& Arnett}{1994}]{ra94}  Ruffert M. \\& Arnett D., 1994, \\apj, 427, 351\n\n\n\\bibitem[\\protect\\citeauthoryear{Ruffert}{1996}]{r96} Ruffert M., 1996, A \\& A, 311, 817\n\n\\bibitem[\\protect\\citeauthoryear{Shapiro \\& Teukolsky}{1983}]{st83}\nShapiro, S.~L., \\& Teukolsky, S.~A. 1983, Black Holes, White Dwarfs and\nNeutron Stars (NY: John Wiley \\& Sons)\n\n\\bibitem[\\protect\\citeauthoryear{Taam \\& Sandquist}{2000}]{ts00}\nTaam, R.~E., \\& Sandquist, E.~L. 2000, \\araa, 38, 113\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Tito \\& Pavlov}{2013}]{tp13}\nTito, E.~P., \\& Pavlov, V.~I. 2013,\n\narXiv:1311.4207v2 [astro-ph.EP] (27 November 2013)\n\n\\bibitem[\\protect\\citeauthoryear{Thorne \\& Zytkow}{1977}]{tz77}  Thorne, K. \\& Zytkow, A. 1977,\n\nThe Astrophysical Journal 212 (1), 832-858.\n\n\\bibitem[\\protect\\citeauthoryear{Toropina et al.}{2012}]{t-a12}\nToropina, O.~D., Romanova, M.~M., \\& Lovelace, R.~V.~E. 2012,\n\n\\mnras, 420, 810\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Zeldovich et al.}{1972}]{zin72}\nZeldovich, Ya.~B., Ivanova, L.~N., \\& Nadezhin, D.~K. 1972, Soviet Ast. - AJ, 16, 209\n\n\t\t\\bibitem[\\protect\\citeauthoryear{}{}]{zn96}\n\t\tZeldovich, Ya.~B., \\& Novikov, I.~D. 1996,\n\t\tRelativistic Astrophysics, Vol. 1: Stars and Relativity (NY: Dover)\n\n\\bibitem[\\protect\\citeauthoryear{Zhang et al.}{2007}]{z-a07}\nZhang, X., Lu, Y., \\& Zhao, Y.~H. 2007, Chin. J. Astron. Astrophys (ChJAA), 7, 91\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 33602, "prevtext": "\nwhich can be resolved analytically :\n\n\n\n", "index": 7, "text": "\\begin{equation}\nv (t) = \\frac{v_0}{s^3 + \\alpha  v_0  ( s^3 -  1 )}  .\n\\label{sol}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"v(t)=\\frac{v_{0}}{s^{3}+\\alpha v_{0}(s^{3}-1)}.\" display=\"block\"><mrow><mrow><mrow><mi>v</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msub><mi>v</mi><mn>0</mn></msub><mrow><msup><mi>s</mi><mn>3</mn></msup><mo>+</mo><mrow><mi>α</mi><mo>⁢</mo><msub><mi>v</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>s</mi><mn>3</mn></msup><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]