[{"file": "1601.03389.tex", "nexttext": "\n\nThese equations have four parameters, one of which is a forcing $J$ that \\citet{Massaro2014}\n proposed to be related to the mass accretion rate in the disk.\nThey demonstrated that changes of its value affect both the recurrence time of the bursts and the mean level of intensity.\nMoreover, a change of the same parameter can also move the system to a stable equilibrium point with a transition to a non-bursting behaviour, for example, as observed in the $\\chi$ class\n\\citep{Belloni2000}.\nThe present finding of the two branches of the $T_{rec}$-$BL$ rate plot shown in Fig.~\\ref{HXDTrec} suggests that in addition to $J,$  at least one of the other structural parameters, for instance $\\chi$ or $\\gamma,$ should be considered as variable in the burst modelling.\nA further development of this mathematical model and the physical interpretation of these changes is beyond the goals of this article, however.\n\n\\begin{acknowledgements}\nThe authors thank the anonymous referee for improving the paper with constructive comments and suggestions. They also thank the personnel of ASI Science Data Center,  particularly M. Capalbi, for help in retrieving {{\\it Beppo}SAX } archive data. \n\\end{acknowledgements}\n\n\\bibliographystyle{aa}\n\\bibliography{grs1915_1}\n\n\n", "itemtype": "equation", "pos": 17824, "prevtext": "\n\n\\title{Time properties of the  the $\\rho$ -class burst of the microquasar GRS~1915+105 observed \nwith {\\it Beppo}SAX in April 1999. }\n\\author{T.~Mineo\\inst{1}\n\\and F.~Massa\\inst{2,}\\thanks{retired}\n\\and E.~Massaro\\inst{3,4}\n\\and A.~D'A\\`{i}\\inst{1}}\n\\institute{INAF, IASF Palermo,via U. La Malfa 153, I-90146 Palermo, Italy\n\\and INFN, Sezione Roma 1, Piazzale A. Moro 2, I-00185 Roma, Italy \n\\and INAF, IAPS, via del Fosso del Cavaliere 100, I-00113 Roma, Italy\n\\and In Unam Sapientiam, Piazzale A. Moro 2, I-00185 Roma, Italy \n}\n\\offprints{mineo@ifc.inaf.it}\n\\date{Received ....; accepted ....}\n\\markboth{F.~Massa et al.: Timing properties of the microquasar GRS~1915+105 in the $\\rho$ class}\n{F.~Massa et al.: Timing properties of the microquasar GRS~1915+105 in the $\\rho$ class}\n\n\\abstract{We present a temporal analysis of a {{\\it Beppo}SAX }  observation of {GRS 1915+105~} performed on April 13, 1999 when the  source was in the $\\rho$  class, which is  characterised by quasi-regular bursting activity. \nThe aim of the present work is to confirm and extend the validity of  the results obtained with\na {{\\it Beppo}SAX } observation performed on October 2000 on the recurrence time of the burst and on \nthe hard X-ray delay. \nWe divided the entire data set into several series, each corresponding to a satellite\norbit, and performed the Fourier and wavelet analysis and the limit cycle mapping technique using  \nthe count rate and the average energy as independent variables. \nWe found that the count rates correlate  with the recurrence time of bursts \nand with hard X-ray delay, confirming the results previously obtained.\nIn this observation,    however,   the recurrence times are distributed along two parallel branches\nwith a constant difference of 5.2$\\pm$0.5 s. }\n\n\\keywords{stars: binaries: close - stars: accretion - stars: individual: \nGRS 1915+105 - X-rays: stars}\n\n\\authorrunning{T.~Mineo et al.}\n\\titlerunning{Timing properties of the microquasar GRS~1915+105 in the $\\rho$ class}\n\n\\maketitle\n\n\\section{Introduction}\n\nThe bursting behaviour \\citep[see the review paper by][]{Fender2004} characterises the $\\rho$ class of {GRS 1915+105~} X-ray emission \\citep{Belloni2000}. It  was discovered in 1996 with Rossi-XTE \\citep{Taam1997} and interpreted as the result of instabilities in an accretion disk, as expected by some previous theoretical calculations \\citep{Taam1984}.\nThis particular behaviour of {GRS 1915+105},  known in the literature  as {\\it \\textup{heartbeat}}, exhibits the properties of  a limit cycle \\citep[e.g.][]{Szuszkiewicz1998, Janiuk2005} that has been  extensively studied \nunder many  aspects \\citep[see, for instance,][]{Neilsen2011, Neilsen2012}.\nThe discovery of  a similar phenomenon in  IGR J17091$-$3624  \\citep{Altamirano2011}\nand MXB 1730-335 \\citep[Rapid Burster,][]{Bagnoli2015}  \nmakes the interest in these studies more general, and comparative analyses can be useful \nto obtain a more complete picture of the physics  underlying these cycles.\n\nIn  some previous papers \\citep[][hereafter Papers I,  II, and III, respectively]{Massaro2010, Mineo2012, Massa2013},  we investigated the properties of the burst series emitted  by the micro-quasar {GRS 1915+105~} in the $\\rho$ class. \nIn particular, using the data of a long {{\\it Beppo}SAX } observation performed in October 2000, \nwe reported several interesting correlations between the mean burst recurrence time \n$T_{rec}$ and the X-ray photon count rate.\nWe developed a method for measuring the hard X-ray delay ({\\it HXD}) \nbased on the loop trajectories described in the  count rate -- mean photon energy ($CR$-$E$) plane \nduring the bursts (Paper III). We found that HXD, which basically\nis the time separation between the midpoints of the count rate and mean photon energy  curves of each burst (see Sect.~\\ref{HXD}), is  related to the brightness level of the  source.\nThe aim of the present analysis is to confirm and extend the validity of our previous results with\ndifferent independent data and to explore to which extent these correlations are stable.\nWe considered another observation of  {\\it Beppo}SAX, performed in April 1999, whose analysis has never been published. \n We applied the same methods as used in the previous studies,\nwhich we do not describe here for the sake of brevity.\n\n\\section{Observation and data reduction}\n\\label{observation}\n\nWe analysed the {{\\it Beppo}SAX }  observation of {GRS 1915+105~} performed on April 13, 1999. \nWe used data obtained with the Medium Energy Concentrator Spectrometer (MECS)  in the 1.6--10~keV energy band \\citep{Boella1997}, which\nwere retrieved from the {\\it Beppo}SAX archive at the ASI Science Data Center (ASDC).\nData were reduced and selected following the standard procedure and using the SAXDAS \nv. 2.3.3 package. MECS events were selected within a circle of 8$'$ radius that contains about 95\\% of the point source signal. \nNo background  was considered because the source  rate is two orders of magnitude higher than the contemporary background level evaluated in a region far from the source. \nIts subtraction is then irrelevant in the analysis.\n\nWe divided the entire data set into several series, each corresponding to a satellite\norbit, and named them according to the same criterion as adopted in Paper I for the 2000 data.\nEach series corresponds to a continuous observing period and is tagged with the \nletter P followed by the orbit sequential number; if a particular series is interrupted because of telemetry gaps, a letter is added to the series' numbers.  \nThe analysis is performed over segments with exposures longer than 1000 s to have sufficient statistics. Table~\\ref{log99} lists the codes of the considered 18 series,  the starting times, the exposure lengths,  the number of bursts, and other quantities derived from our analysis.\n\n\\begin{table*}\n\\caption{Observation log of the 1999 observation: ObsId 20985001.\nThe columns report the labels of the time series, the starting times of each series from \nT$_0$=13 April 1999 2:11:34 UT, the exposures, the average \nrates, and the parameters derived from our analysis. } \n\\label{log99}\n\\begin{center}\n\\begin{tabular}{lrccccccc}\n\\hline\\hline\n Series  &  Tstart (s)  & Exposure & \\multicolumn{2}{c}{Average MECS rate } & N bursts & $T_{rec}$ & {\\it HXD} & Type$^*$ \\\\\n         &   \\multicolumn{1}{c}{s}    & \\multicolumn{1}{c}{s}  &   burst   & $BL$  &    &  s & s & \\\\\n\\hline\n    P1    &  0.0       & 2417.6  &  232.4 & 147.1 & 48 & 51.1 & 6.3 & S \\\\\n    P2b   &  6215.3    & 2011.5  &  226.0 & 141.6 & 41 & 50.0 & 5.9 & S \\\\ \n    P3b   &  12443.3   & 1600.1  &  211.0 & 132.5 & 35 & 46.9 & 5.5 & S \\\\ \n    P4a   &  16654.2   & 1135.2  &  207.2 & 132.5 & 25 & 46.8 & 5.1 & S \\\\\n    P4b   &  18666.3   & 1019.9  &  214.9 & 134.1 & 22 & 47.8 & 5.5 & S \\\\                    \n    P5a   &  22484.0   & 1436.5  &  205.8 & 129.2 & 32 & 45.7 & 5.1 & T \\\\\n    P6a   &  28254.5   & 1785.1  &  209.0 & 127.1 & 43 & 42.3 & 3.9 & S \\\\\n    P7    &  34019.3   & 2162.4  &  209.9 & 125.2 & 53 & 41.3 & 3.7 & S \\\\\n    P8    &  39785.6   & 2496.2  &  203.7 & 117.9 & 60 & 42.1 & 3.3 & T \\\\\n    P9    &  51343.3   & 3104.6  &  206.3 & 122.3 & 73 & 43.0 & 3.7 & S \\\\\n    P10   &  56973.5   & 3255.2  &  198.3 & 115.9 & 78 & 42.1 & 3.3 & S \\\\\n    P11   &  62746.5   & 3246.8  &  197.6 & 118.5 & 77 & 42.5 & 3.8 & S \\\\                     \n    P12a  &  68722.5   & 1530.2  &  198.7 & 119.4 & 57 & 44.4 & 4.0 & S \\\\\n    P12b  &  69926.5   & 1914.0  &  198.7 & 119.4 & 57 & 44.5 & 4.0 & S \\\\\n    P13   &  74448.7   & 3127.2  &  196.6 & 119.9 & 71 & 44.5 & 4.2 & S \\\\\n    P14a  &  80451.5   & 1150.2  &  200.3 & 122.5 & 26 & 45.7 & 4.3 & S \\\\                 \n    P15   &  86617.5   & 2467.3  &  204.2 & 125.5 & 53 & 47.3 & 4.9 & S \\\\\n    P16b  &  92842.4   & 1587.3  &  207.3 & 132.1 & 25 & 51.9 & 5.3 & S \\\\\n\\hline \n\\end{tabular}\n\\end{center} \n$^*$ This parameter is related to the Fourier power spectrum of the series: S only one peak is present, T two peaks are detected.\n\\end{table*}\n\n\\section{Data analysis and results of the 1999 $\\rho$ -class observation}\n\\label{romode}\n\nThe temporal analysis of data in $\\rho$ mode,  performed taking into account the results \npresented in Papers I and III, was focused on evaluating the recurrence \ntime of the bursts and of the HXD. \n\n\\begin{figure}[ht]\n\\vspace{0.2 cm}\n\\centerline{\n\\includegraphics[width=8.0cm,angle=0]{fig1.ps}\n}\n\\caption{Time evolution of the series P3b.\nThe top panel shows a short portion of the light curve in the \nentire MECS energy range; the bottom panel presents the relative mean energy.\nBlack curves are the rates with 1 s integration time, while red curves are averaged\nin a 5 s interval.}\n\\label{curvesP3}\n\\end{figure}\n\n\\begin{figure}[ht]\n\\hspace{-0.5 cm}\n\\centerline{\n\\includegraphics[width=6.6cm,angle=-90]{fig2.ps}\n}\n\\caption{Time evolution  (left scale)  of the average burst (open black circle) and mean $BL$ (black circle) count rate  and  of  $T_{rec}$ of bursts (red points, right scale) during the observation in April 1999. \n}\n\\label{timeCRTrec}\n\\end{figure}\n\n\\subsection{Recurrence time of bursts}\n\nAll  data series present regular sequences of bursts typical of the $\\rho$ class, \ncharacterised by a slow leading trail ({\\it SLT}), a {\\it \\textup{pulse,}} and a final decaying \ntrail ({\\it FDT}) (see Paper I) superposed onto a baseline level ($BL$) that remains \nremarkably constant in each series. The $BL$  rate was evaluated in the three seconds after the minimum between two consecutive bursts.\nA 300 s long segment of the series P3b is shown in the upper panel of Fig.~\\ref{curvesP3}. \n\n\n\\begin{figure}[ht]\n\\vspace{0.2 cm}\n\n\\includegraphics[width=6.7cm,angle=-90]{fig3.ps} \n\\caption{T$_{rec}$ vs the $BL$ rate during the April 1999\nobservation.\nThe dot-dashed blue lines are the linear best fits to the data of the two\nbranches with the same slope.\nThe initial point is marked by a red  circle.\nThe dotted lines connecting the points describe the time sequence of data. \n}\n\\label{DcrTrec}\n\\end{figure}\n\nA small but significant variation of the total brightness with a relative amplitude of \n$\\sim$18\\%, from a mean count rate of 232.4 ct/s at the beginning of the observation \nto 196.6 ct/s in the middle, is clearly visible (see Fig.~\\ref{timeCRTrec}).  \nA similar trend is also detected in the $BL$ light curve, but with higher  amplitude  \n($\\sim$27\\%).\nWe note that the dynamical range of  the observed variability remains within the range \ndetected in October 2000 (see Paper I). \n\nAs in Paper I, we evaluated the recurrence time of bursts by means of Fourier power spectra\nof each series. These periodograms generally presented a single sharp dominant peak\n(S type, according to the definition given in \\citet{Massaro2010}) with the exception of only two series that presented two peaks (T type) with a quite small separation (see Table~\\ref{log99}).\nThe values of $T_{rec}$,  also given in Table~\\ref{log99},  follow \nthe same trend as the count rate, as shown in Fig.~\\ref{timeCRTrec}, in agreement \nwith our findings in the October 2000 observation. We note, however, that its variation ($\\sim$26\\%)\nhas an amplitude that is almost identical to those of  the $BL$ rate. \n\nThe plot in  Fig.~\\ref{DcrTrec} shows the relation between \n$T_{rec}$ and the $BL$ count rate  starting from the first series marked by a red point. \nIt is interesting to note that  points are located in two clearly separated \nbranches: the lower branch corresponds to the initial decreasing rate time\ninterval, and the upper branch occurred during the subsequent increasing\nsource count rate. \nNo effect like this was detected in the observation of October 2000 because the count \nrate never decreased (Paper I).\n\nTo quantify the systematic difference in  $T_{rec}$ between the two branches, we computed the linear fits to the  data  (excluding the first point) and obtained similar  values for the slopes;\n we then fixed both values to the mean value.  The constant difference\nbetween the two lines (see  Fig.~\\ref{DcrTrec})  is 5.2$\\pm$0.5 s, about 11\\% of the mean $T_{rec}$ in the pointing.\n\n\\begin{figure}[ht]\n\\vspace{0.2 cm}\n\\centerline{\n\\includegraphics[width=6.7cm,angle=-90]{fig4.ps}}\n\\caption{Comparison of the $T_{rec}$ vs $BL$ count rate between\nobservations made in April 1999 \n(black filled circles) and October 2000 (blue diamonds).}\n\\label{T_rec}\n\\end{figure}\n\nWe found that $T_{rec}$ is proportional to the third power of the $BL$ count rate, as shown in Fig.~\\ref{T_rec}.\nFor comparison, the values relative to the October 2000 observation \nare also plotted in the same figure: the upper branch of the 1999 data agrees well with the \n2000 data, while the decreasing branch lies systematically below these points.\nWhen we fitted all data (1999 and 2000) with a power law, we obtained an exponent equal to \n3.1$\\pm$0.1. \n\n\n\\subsection{Mapping in the {\\it CR-E} plane and the HXD}\n\\label{HXD}\nApplying the same approach as described in Paper III, we computed \nthe data series of the mean photon energy (see the lower panel in Fig.~\\ref{curvesP3}), \nwhich were used to construct the curves in the {\\it CR-E} plane.\nAgain we found that each series describes a well-defined loop of approximately \nelliptical shape.\nAn example that is useful for illustrating the limit cycle typical \nof the $\\rho$ class  is given in Fig.~\\ref{loopCRE_P3} for the P3b data; the other series \nexhibit very similar trajectories.\nThe structure of the limit cycle is related to a delay between the count rate \n(photon luminosity) and the mean photon energy (temperature) curves.\nThis delay of high-energy photons is clearly apparent from the mean burst \nshape and energy curve plotted in Fig.~\\ref{meanpulsesP3P16} for the two data \nseries P3b (black curves) and P16 (red curves), which  correspond to points in the \ndecreasing and increasing branch that have  similar $BL$  rates but average $T_{rec}$ equal to 46.0 s and 51.9 s, respectively.\nWe computed these mean curves  by means of the algorithm applied to the {\\it CR-E}\ntrajectories; this is explained in detail in \\citet{Massaro2014}.\n\nThe definition of {\\it HXD} used in our works (see Paper III) is graphically explained  in Fig.~\\ref{meanpulsesP3P16} with the vertical lines: it measures\n the time separation  between the corresponding midpoints of the two curves for each bursts.\nThe resulting mean values {\\it HXD} for each series are also given in Table~\\ref{log99}: \nsimilar as for the 2000 data, a positive correlation between the delay and $T_{rec}$ was \nfound, as shown in Fig.~\\ref{HXDTrec}, where a two-branch path is also clearly apparent.\n\n\\begin{figure}[ht]\n\\centerline{\n\\vbox{\n\\includegraphics[width=7.0cm,angle=-90]{fig5.ps}\n}}\n\\caption{Trajectory in the  CR-E plane for 1 s integration time (black curve) and 5 s integration time (red curve).\n}\n\\label{loopCRE_P3}\n\\end{figure}\n\n\\begin{figure}[ht]\n\n\\centerline{\n\\includegraphics[width=8.0cm,angle=0]{fig6.ps}\n}\n\\caption{Comparison between the average burst profiles (top panel) in the series P3b \n(black) and P16b (red) and between the relative mean energies (bottom panel).\nVertical lines show how {\\it HXD} is measured from the midpoints times of the two data\nseries.} \n\\label{meanpulsesP3P16}\n\\end{figure}\n\n\\begin{figure}[ht]\n\\vspace{0.2 cm}\n\\includegraphics[width=6.7cm,angle=-90]{fig7.ps}\n\\caption{ T$_{rec}$ vs {\\it HXD} the  during the April 1999 observation.\nThe initial point is marked by the red  circle.\nThe dotted lines connecting the points describe the temporal evolution of data. \n}\n\\label{HXDTrec}\n\\end{figure}\n\nIn Paper III we found that HXD is proportional to the third power of the $BL$ count rate;\na relation similar to that of  $T_{rec}$  .  \nWe verified that the correlation between {\\it HXD} and the cube of the $BL$ \nrates  also holds for these data. \n\n\n\\section{Summary and conclusion}\n\\label{conclusion}\n\nWe analysed a {{\\it Beppo}SAX } observation of  {GRS 1915+105~} performed in April 1999 when it was in the $\\rho$ -variability class and compared the results with those of another previously studied longer pointing of October 2000.\nThe main properties of the $\\rho$ class were confirmed: the positive correlation between the recurrence time of bursts and the $BL$ rate, the closed trajectories in the $CR$-$E$ plane, and the occurrence of an {\\it HXD} that was also correlated with both $T_{rec}$ and rate. \nIn this observation, however,  the recurrence times $T_{rec}$ are distributed along two parallel branches with a constant difference  of 5.2$\\pm$0.5 s.\nThe peaks' structure does not show any significant change between the two branches, as clearly apparent in Fig.~\\ref{P5a_vs_P15}, where two segments of the series P5a and P15 are plotted.\n\n\\begin{figure}[ht]\n\\vspace{0.2 cm}\n\\includegraphics[width=6.7cm,angle=-90]{fig8.ps}\n\\caption{Segments of the 1-6--10 keV series P5a (top panel) and P15 (bottom panel)\nin the decreasing and increasing branch, respectively.\nNo change of the burst structure is apparent.}\n\\label{P5a_vs_P15}\n\\end{figure}\n\nA physical explanation for this double branch effect is unclear, as is the mechanism producing the class bursting.   \\citet{Taam1997}  proposed for the first time that the bursting originates from a non-linear thermal-viscous instability in the accretion disk. However, a  dynamical approach \nto reproduce the observed general structures has not been developed so far. \nIn a first attempt,  \\citet{Massaro2014} applied the well-known FitzHugh-Nagumo dynamical\nequations in two non-dimensional variables $x$ and $y$, which was found to be proportional to the photon flux and disk temperature, respectively.\nTheir time evolution is given by two differential equations, one of which contains a 'cooling' term in $x^3$, which is necessary to achieve an unstable equilibrium point around which a limit cycle can be established:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\left\\{\n\\begin{array}{lcl}\ndx/dt &=& - \\rho x^3 + \\chi x - \\gamma y -  J  \\\\\ndy/dt &=& x - y  \n\\end{array}\\right.\n.\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\left\\{\\begin{array}[]{lcl}dx/dt&amp;=&amp;-\\rho x^{3}+\\chi x-\\gamma y-J\\\\&#10;dy/dt&amp;=&amp;x-y\\end{array}\\right..\" display=\"block\"><mrow><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow><mo>/</mo><mi>d</mi></mrow><mo>⁢</mo><mi>t</mi></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mo>-</mo><mrow><mi>ρ</mi><mo>⁢</mo><msup><mi>x</mi><mn>3</mn></msup></mrow></mrow><mo>+</mo><mrow><mi>χ</mi><mo>⁢</mo><mi>x</mi></mrow></mrow><mo>-</mo><mrow><mi>γ</mi><mo>⁢</mo><mi>y</mi></mrow><mo>-</mo><mi>J</mi></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mi>y</mi></mrow><mo>/</mo><mi>d</mi></mrow><mo>⁢</mo><mi>t</mi></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mi>x</mi><mo>-</mo><mi>y</mi></mrow></mtd></mtr></mtable><mi/></mrow><mo>.</mo></mrow></math>", "type": "latex"}]