[{"file": "1601.04843.tex", "nexttext": "\nis the SQUID parameter and loss coefficient, respectively. \n\n\n\nThe corresponding single SQUID equation is obtained from Eq. (\\ref{06}) for $\\lambda_0=0$,\nso that ${\\bf \\hat{\\Lambda}} ={\\bf \\hat{\\Lambda}}^{-1} ={\\bf I_N}$, where ${\\bf I_N}$ is \nthe $N\\times N$ unit matrix, and by dropping the subscript $n$, as \n\\begin{eqnarray}\n\\label{99}\n  \\ddot{\\phi} +\\gamma \\dot{\\phi} +\\phi +\\beta \\sin\\left( 2\\pi \\phi \\right) \n    =\\phi_{dc}+\\phi_{ac} \\cos(\\Omega \\tau ) .\n\\end{eqnarray}\nThe current $I$ in the SQUID ring is given by the flux-balance condition \\cite{Lazarides2013b}\n\\begin{eqnarray}\n\\label{98}\n  \\phi =\\phi_{ext} +\\beta i , \n\\end{eqnarray}\nwhere $i=I/I_c$. For fixed rescaled SQUID parameter $\\beta$, the nonlinear effects become\nstronger with increasing amplitude of the ac field, $\\phi_{ac}$. In that case, the current \namplitude $i_{max}$ - driving frequency $\\Omega$ characteristic (resonance curve) becomes \nstrongly hysteretic and several simultaneously stable branches appear. This multistability \neffect is illustrated in Fig. \\ref{fig999}, in which two such characteristics are shown in \n(a) and (b) for weak and strong nonlinearity, respectively. \n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.48\\textwidth,angle=0]{rev-squid-afc-rand-fig02.png}\n\\caption{(Color online)\nCurrent amplitude $(I/I_c)_{max}$ - driving frequency $\\Omega$ characteristics for a single\nrf SQUID with $\\beta_L =0.88$, $\\gamma=0.024$, $\\phi_{dc}=0$, and (a) $\\phi_{ac}=0.005$;\n(b) $\\phi_{ac}=0.05$. The red arrows indicate the position of an anti-resonance (see text).\n\\label{fig999} }\n\\end{figure}\n\nIn Fig. \\ref{fig999}(a), the SQUID is close to the linear regime, in which the resonance\ncurve is single-valued, in the sense that each value of $\\Omega$ corresponds to only one \nvalue of $(I/I_c)_{max}$. Hysteretic effects are not visible, however the curve is not \nsymmetric as it should be in the truly linear regime. Note that from Eq, (\\ref{99}),\nlinearized around $\\phi \\simeq 0$, we get for the single SQUID resonance frequency the \nexpression $\\Omega_{SQ}= \\sqrt{1 +\\beta_L}$, which gives $\\Omega_{SQ}= 1.37$ for the \nparameters of Fig. \\ref{fig999}. In Fig. \\ref{fig999}(b), in which the ac field amplitude\nhas been increased by an order of magnitude, strongly nonlinear effects become readily \napparent. At least five stable branches can be identified in a narrow frequency region \naround unity, i.e., around the geometrical (inductive-capacitive, $LC$) resonance frequency.\nThe upper branches, which are extremely sensitive to perturbations, correspond to very\nhigh values of the current amplitude, which leads the Josephson junction of the SQUID to\nits normal state. Although the``resonance'' region in the strongly nonlinear regime has \nbeen shifted to the left, as compared with that in the weakly, almost linear regime,\nthe location of the anti-resonance has not been changed. This can be observed clearly in\nFig. \\ref{fig998}, where the anti-resonance frequency region has been enlarged in both\nregimes. The current amplitude anti-resonance makes itself apparent as a well defined dip\nin the characteristics, with a minimum that almost reaches zero. The effect of \nanti-resonance has been observed in nonlinearly coupled oscillators subjected to a periodic \ndriving force \\cite{Woafo1998} and in parametrically driven nonlinear oscillators \n\\cite{Chakraborty2013}. However, it has never before been observed in a single, periodically \ndriven nonlinear oscillator. The knowledge of the location of anti-resonance(s) as well as \nthe resonance(s) of an oscillator or a system of oscillators, beyond their theoretical \ninterest, they are of importance in device applications.\nCertainly they have significant implications for the SQUID metamaterials which properties \nare determined by those of their elements (i.e., the SQUIDs). When the SQUIDs are in an \nanti-resonant state, in which the induced current is zero, they do not absorb energy from \nthe applied field which can transpass the metamaterial almost unaffected. Thus, in such \na state, the SQUID metamaterial is transparent to the applied magnetic flux as has been \nalready observed experimentally \\cite{Zhang2015}. Moreover, since the anti-resonance \nfrequency is not affected by the amplitude of the ac field, the transparency can be \nobserved for a wide range of applied rf flux. In the strongly nonlinear regime, the \nanti-resonance lies in the multistability region (see Fig. \\ref{fig999}b), due to the frequency \nshift of the SQUID resonance because of the strong nonlinearity.\nIn that case, the transparency of the metamaterial may be turned on and off as it has \nbeen already discussed in Ref. \\cite{Zhang2015}. Thus, the concept of the anti-resonance \nserves for making a connection between an important SQUID metamaterial property and a \nfundamental nonlinear dynamical property of oscillators.        \n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.48\\textwidth,angle=0]{rev-squid-afc-rand-fig02-Enlarge.png}\n\\caption{(Color online)\nEnlargement of Figs. \\ref{fig999}(a) and (b) around the region of the anti-resonance.\nSame parameters as in Fig. \\ref{fig999}.\n\\label{fig998} } \n\\end{figure}\n\n\n\n\n\nFor the time integration of Eq. (\\ref{99}) of the single SQUID, a fourth-order Runge-Kutta\nalgorithm with constant time-step has been used. The same algorithm is also used for the \nsimulation of the SQUID metamaterial which is modeled by Eq. (\\ref{06}). The latter are  \nimplemented with the following boundary conditions\n\n", "itemtype": "equation", "pos": 10369, "prevtext": "\n\n\\title{Chimera states and synchronization in magnetically driven SQUID metamaterials}\n\n\\abstract{\nOne-dimensional arrays of Superconducting QUantum Interference Devices (SQUIDs) form\nmagnetic metamaterials exhibiting extraordinary properties, including tunability, \ndynamic multistability, negative magnetic permeability, and broadband transparency. \nThe SQUIDs in a metamaterial\ninteract through non-local, magnetic dipole-dipole forces, that makes it possible for\nmultiheaded chimera states and coexisting patterns, including solitary states, to appear.\nThe spontaneous emergence of chimera states and the role of multistability\nis demonstrated numerically for a SQUID metamaterial driven by an alternating magnetic \nfield. The spatial synchronization and temporal complexity are discussed and the\nparameter space for the global synchronization reveals the areas of coherence-incoherence\ntransition. Given that both one- and two-dimensional SQUID metamaterials\nhave been already fabricated and investigated in the lab, the presence of a chimera state \ncould in principle be detected with presently available experimental set-ups.} \n\n\n\n\n\n\\author{\nJ. Hizanidis\\inst{1} \\and N. Lazarides\\inst{1,2,3} \\and G. Neofotistos\\inst{1,3} \\and \nG. P. Tsironis\\inst{1,2,3}\n}\n\\institute{\n\\inst{1}Crete Center for Quantum Complexity and Nanotechnology, Department of Physics,\n      University of Crete, P. O. Box 2208, 71003 Heraklion, Greece. \\\\\n\\inst{2}Institute of Electronic Structure and Laser,\n      Foundation for Research and Technology--Hellas, P.O. Box 1527, 71110 Heraklion,\n      Greece. \\\\\n\\inst{3}National University of Science and Technology MISiS, Leninsky prosp. 4, Moscow,\n      119049, Russia\n}\n\n\n\n\\maketitle\n\n\\section{Introduction} \n\\label{sec:sec1}\nSuperconducting QUantum Interference Device (SQUID) metamaterials are superconducting\nartificial media whose function relies both on their geometry and the extraordinary\nproperties of superconductivity and the Josephson effect \\cite{Anlage2011,Jung2014}.\nRecent experiments on one- and two-dimensional radio-frequency (rf) SQUID metamaterials \nhave revealed their wide-band tuneability, significantly reduced losses, dynamic\nmultistability, and tunable broadband transpare- ncy \n\\cite{Jung2014,Jung2013,Butz2013a,Trepanier2013,Jung2014b,Zhang2015}. The simplest \nversion of an rf SQUID involves a superconducting ring interrupted by a Josephson junction \n\\cite{Josephson1962} (Fig. \\ref{fig1}a); this device is a highly nonlinear resonator with \na strong response to applied magnetic fields. SQUID metamaterials exhibit peculiar magnetic\nproperties such as negative diamagnetic permeability, predicted both for the quantum \n\\cite{Du2006} and the classical \\cite{Lazarides2007} regime. The applied alternating\nfields induce (super)currents in the SQUID rings, which are therefore coupled through\ndipole-dipole magnetic forces. This interaction is weak due to its magnetic nature.\nHowever, it couples the SQUIDs non-locally since it falls-off as the inverse cube of their\ncenter-to-center distance.\n\n\n  \nNonlocal coupling in systems of interacting oscillators is capable of producing \ncounter-intuitive space-time patterns, called chimera states\\cite{KUR02a,ABR04}. Chimera\nstates are characterized by the coexistence of synchronous and asynchronous clusters of \noscillators. They were first observed over a decade ago, in systems of identical phase\noscillators with  symmetric  coupling \\cite{KUR02a,ABR04}, and have been intensively\nstudied both theoretically\n\\cite{Omelchenko2008,Abrams2008,Pikovsky2008b,Ott2009,Martens2010,Omelchenko2011,Yao2013,Omelchenko2013,vuellings:2014,Hizanidis2014,Zakharova2014,Bountis2014,Yeldesbay2014,hizanidis:2015}\nand experimentally, in chemical \\cite{tinsley:2012}, optical \\cite{hagerstrom:2012},\nmechanical \\cite{martens:2013}, electronic \\cite{larger:2013}, and electrochemical\n\\cite{schmidt:2014,wickramasinghe:2013} oscillator systems (for further reading refer \nto \\cite{panaggio:2015}). Recent works also report on the issue of robustness of chimera\nstates \\cite{omelchenko:2015} as well as on the emergence of chimera states in systems\nwith global \\cite{BOE15} and local coupling schemes \\cite{LAI15}. Chimera-like states\nin modular networks \\cite{SHA10,HIZ15} have also been investigated, expanding our\nunderstanding on the role of topology and dynamics for their occurrence. Recent research\nefforts aim to stabilize chimera states by feedback schemes \\cite{SIE14} and to control \nthe localization of the different regimes \\cite{BIC15,ISE15}. In \\cite{LAZ15}, chimera \nstates with very long life-times were numerically demonstrated in SQUID metamaterials\nwith weak dissipation and non-local magnetic interactions due to an alternating external \nmagnetic field. The SQUID metamaterial model had been previously used in the weak and\nnearest neighbor coupling regime, for the  investigation of intrinsic localization and\ntuneability effects \\cite{Lazarides2008a,Lazarides2012,Lazarides2013b}. Moreover, the \nsynchronization and metastability levels of the chimera states were discussed in terms \nof appropriate measures \\cite{LAZ15}.\n\n\\begin{figure}[h!]\n\\includegraphics[angle=0, width=0.85 \\linewidth]{Chimera-SQUID-Fig01ab.png} \n\\includegraphics[angle=0, width=0.88 \\linewidth]{Chimera-SQUID-Fig01c.png} \n\\caption{(Color online)\nSchematic of an rf SQUID in an alternating magnetic field ${\\bf H}(t)$ (a), and equivalent \nelectrical circuit (b). The real Josephson junction is represented by the circuit elements\nthat are in the brown-dashed box. (c) A one-dimensional SQUID metamaterial is formed by \nrepetition of the squared unit cell of side $d$ shown in (a). \n\\label{fig1}\n}\n\\end{figure}\n\n\n\n\nIn the present work we extend this study and focus on the multistability of the system \nwhere different patterns coexist. Chimera states with single and multiple coherent \nregions of different sizes as well as other patterns will be demonstrated. In addition, \nby quantifying the spatial synchronization in the SQUID array we reveal the detailed \nstructure of coherence and incoherence in the device. Finally, the parameter space for \nglobal synchronization transitions will be analyzed, providing insight into the role of \nthe external driving field. Our results will help to provide further understanding to the \nimplications of the second derivative term (inertia) in the occurrence of chimera states\n\\cite{Bountis2014,LAZ15,Jaros2015,Olmi2015}, which has not been sufficiently studied. \n\nIn the next Section, we present the non-locally coupled SQUID metamaterial model and the \nmeasures for quantifying spatial and global synchronization. Current amplitude-driving \nfrequency diagrams for a single SQUID which reveal its multistability property in the \nstrongly nonlinear regime is also presented. In Section~\\ref{sec:sec3}, \nthe numerically obtained space-time evolution of several coexisting patterns are shown for \ndifferent initial conditions. The magnitude of the \nspatial synchronization parameter is monitored in time for the non-locally coupled SQUID \nmetamaterials and the temporal complexity is discussed in terms of phase portraits of the \nindividual SQUID oscillators. In Section~\\ref{sec:sec4}, the possibility that the SQUID \nmetamaterial may undergo a synchronization-desynchronization transition is explored. \nAppropriate density plots mapping the order parameter on the dc flux bias - driving \nperiod plane unveil the relevant parameter regions in which such a transition may occur.\nIn the concluding section (Section~\\ref{sec:sec5}) we summarize our results.\n\n\n\n\n\\section{SQUID Metamaterial Modelling and Measure of Synchronization}\n\\label{sec:sec2}\nThe model under consideration involves a one-dimensional linear array of $N$ identical \nrf SQUIDs coupled together magnetically through dipole-dipole forces. The magnetic flux \n$\\Phi_n$ threading the $n-$th SQUID loop is given by the following equation:\n\\begin{eqnarray}\n\\label{01}\n  \\Phi_n =\\Phi_{ext} +L\\, I_n +L\\, \\sum_{m\\neq n} \\lambda_{|m-n|} I_m ,\n\\end{eqnarray}\nwhere the indices $n$ and $m$ run from $1$ to $N$, $\\Phi_{ext}$ is the external flux in \neach SQUID, $\\lambda_{|m-n|} =M_{|m-n|}/L$ is the dimensionless coupling coefficient \nbetween the SQUIDs at positions $m$ and $n$, with $M_{|m-n|}$ being their corresponding \nmutual inductance, and\n\\begin{eqnarray}\n\\label{02}\n    -I_n =C\\frac{d^2\\Phi_n}{dt^2} +\\frac{1}{R} \\frac{d\\Phi_n}{dt} \n                                +I_c\\, \\sin\\left(2\\pi\\frac{\\Phi_n}{\\Phi_0}\\right) \n\\end{eqnarray}\nis the current in the $n-$th SQUID given by the resistively and capacitively shunted \njunction (RCSJ) model \\cite{Likharev1986}, with  $\\Phi_0$ and $I_c$ being the flux quantum \nand the critical current of the Josephson junctions, respectively.  Within the RCSJ \nframework, $R$, $C$, and $L$ are the resistance, capacitance, and self-inductance of the \nSQUIDs' equivalent circuit (Fig. \\ref{fig1}b). From Eqs. (\\ref{01}) and (\\ref{02}) we obtain \nthe equation:\n\\begin{eqnarray}\n\\label{05}\n  C\\frac{d^2\\Phi_n}{dt^2} +\\frac{1}{R} \\frac{d\\Phi_n}{dt}\n    +\\frac{1}{L} \\sum_{m=1}^N  \\left( {\\bf \\hat{\\Lambda}}^{-1} \\right)_{nm} \n         \\left( \\Phi_m -\\Phi_{ext} \\right) \n   \\nonumber \\\\\n   +I_c\\, \\sin\\left(2\\pi\\frac{\\Phi_n}{\\Phi_0}\\right) =0 ,\n\\end{eqnarray}\nwhere ${\\bf \\hat{\\Lambda}}^{-1}$ is the inverse of the $N\\times N$ coupling matrix \n\\begin{eqnarray}\n\\label{04}\n  {\\bf \\hat{\\Lambda}} = \\left\\{ \\begin{array}{ll}\n        1, & \\mbox{if $m= n$};\\\\\n        \\lambda_{|m-n|} =\\lambda_0 \\, |m-n|^{-3}, & \\mbox{if $m\\neq n$},\\end{array} \\right.   \n\\end{eqnarray}\nwith $\\lambda_0$ being the coupling coefficient between nearest neighboring SQUIDs.\n\n\n\n\nNormalizing the frequency and time to $\\omega_0 =1/\\sqrt{LC}$ and its inverse \n$\\omega_0^{-1}$, respectively, and the fluxes and currents to $\\Phi_0$ and $I_c$, \nrespectively, Eq. (\\ref{05}) reads ($n=1,...,N$)\n\\begin{eqnarray}\n\\label{06}\n  \\ddot{\\phi}_n +\\gamma \\dot{\\phi}_n +\\beta \\sin\\left( 2\\pi \\phi_n \\right) \n    =\\sum_{m=1}^N \\left( {\\bf \\hat{\\Lambda}}^{-1} \\right)_{nm} \n         \\left( \\phi_{ext} -\\phi_m \\right) ,\n\\end{eqnarray}\nwhere the overdots denote derivation with respect to the normalized temporal variable, \n$\\tau$, $\\phi_{ext} =\\phi_{dc}+\\phi_{ac} \\cos(\\Omega \\tau )$, with $\\phi_{dc}$ being the\ndc flux component, $\\Omega=\\omega/\\omega_0$ the normalized driving frequency, and \n\n", "index": 1, "text": "\\begin{equation}\n\\label{14}\n   \\beta=\\frac{I_c L}{\\Phi_0} =\\frac{\\beta_L}{2\\pi}, \\qquad\n   \\gamma=\\frac{1}{R} \\sqrt{ \\frac{L}{C} } , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\beta=\\frac{I_{c}L}{\\Phi_{0}}=\\frac{\\beta_{L}}{2\\pi},\\qquad\\gamma=\\frac{1}{R}%&#10;\\sqrt{\\frac{L}{C}},\" display=\"block\"><mrow><mrow><mrow><mi>β</mi><mo>=</mo><mfrac><mrow><msub><mi>I</mi><mi>c</mi></msub><mo>⁢</mo><mi>L</mi></mrow><msub><mi mathvariant=\"normal\">Φ</mi><mn>0</mn></msub></mfrac><mo>=</mo><mfrac><msub><mi>β</mi><mi>L</mi></msub><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mi>γ</mi><mo>=</mo><mrow><mfrac><mn>1</mn><mi>R</mi></mfrac><mo>⁢</mo><msqrt><mfrac><mi>L</mi><mi>C</mi></mfrac></msqrt></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04843.tex", "nexttext": "\nto account for the termination of the structure in a finite system. \nThe parameter values used in the simulations of the single SQUID and the SQUID \nmetamaterial are in the region in which the relevant experiments were carried out\n\\cite{Trepanier2013,Zhang2015}. \nIn Ref. \\cite{Trepanier2013}, the values of the SQUIDs' inductance, resistance, and \ncapacitance are $L=0.12~nH$, $R=840~\\Omega$, and $C=0.65~pF$, respectively, while the \ncritical current is $3.7~\\mu A$ and $1.2~\\mu A$ at temperature $T=4.2~K$ and $6.5~K$, \nrespectively. Inserting these values in the first of Eqs. (\\ref{14}), we get for $\\beta_L$ \nthe values $0.44$ and $1.3$ at $T=4.2~K$ and $6.5~K$, respectively. For the SQUID \nmetamaterial we use \n$\\beta_L =0.7$, which lies in between those values, while our value of the amplitude of \nthe alternating field $\\phi_{ac}=0.015$ lies within the range of values used in the \nexperiments ($\\phi_{ac} \\simeq 0.006 - 0.05$). The coupling coefficient between nearest \nneighbors in Ref. \\cite{Trepanier2013} has been estimated to be $\\lambda_0 \\simeq-0.02$, \nusing a simple approximation scheme in which the SQUIDs are regarded as thin rings. \nHowever, a large part of the area of the actual SQUID metamaterial is filled by \nsuperconducting material that the field cannot penetrate; it is thus expected that more \nmagnetic flux than that predicted by the simple approximation will find its way through \nthe SQUID rings, increasing thus considerably $\\lambda_0$ (we use $\\lambda_0=-0.05$). \nThe value of the loss coefficient in our simulations for the SQUID metamaterial is \n$\\gamma \\simeq 0.002$ (for the single SQUID $\\gamma \\simeq 0.024$), while \nfrom the second of Eqs. (\\ref{14}) and the values given in Ref. \\cite{Trepanier2013} we get\n$\\sim 0.02$. Although the losses in the SQUIDs can be reduced considerably by lowering the\ntemperature without affecting much the critical currents of the junctions, we have checked \nthat chimera states also exist for $\\gamma$ of the order of $\\sim 0.02$ when compensated\nby a larger ac field amplitude $\\phi_{ac}$.\nNote that the parameters used in the simulations of the one-dimensional SQUID metamaterial \nare compared with those in Ref. \\cite{Trepanier2013}, in which the experiments have been \ncarried out on two-dimensional arrays, merely to show that these are realistic. In this work, \nwe do not attempt to simulate a particular SQUID metamaterial. Moreover, the dimensionality \nof the system does not affect significantly the estimation of the parameters that are \nnecessary for the simulations, since they can be estimated either by the individual SQUID \nproperties (i.e., $\\beta$, $\\gamma$) or by a pair of SQUIDs (i.e., $\\lambda_0$).  \n\n\n\n\nThe spatial coherence and incoherence of the chimera state can be characterized by a \nreal-valued local order parameter \\cite{Omelchenko2011}\n\n", "itemtype": "equation", "pos": 16015, "prevtext": "\nis the SQUID parameter and loss coefficient, respectively. \n\n\n\nThe corresponding single SQUID equation is obtained from Eq. (\\ref{06}) for $\\lambda_0=0$,\nso that ${\\bf \\hat{\\Lambda}} ={\\bf \\hat{\\Lambda}}^{-1} ={\\bf I_N}$, where ${\\bf I_N}$ is \nthe $N\\times N$ unit matrix, and by dropping the subscript $n$, as \n\\begin{eqnarray}\n\\label{99}\n  \\ddot{\\phi} +\\gamma \\dot{\\phi} +\\phi +\\beta \\sin\\left( 2\\pi \\phi \\right) \n    =\\phi_{dc}+\\phi_{ac} \\cos(\\Omega \\tau ) .\n\\end{eqnarray}\nThe current $I$ in the SQUID ring is given by the flux-balance condition \\cite{Lazarides2013b}\n\\begin{eqnarray}\n\\label{98}\n  \\phi =\\phi_{ext} +\\beta i , \n\\end{eqnarray}\nwhere $i=I/I_c$. For fixed rescaled SQUID parameter $\\beta$, the nonlinear effects become\nstronger with increasing amplitude of the ac field, $\\phi_{ac}$. In that case, the current \namplitude $i_{max}$ - driving frequency $\\Omega$ characteristic (resonance curve) becomes \nstrongly hysteretic and several simultaneously stable branches appear. This multistability \neffect is illustrated in Fig. \\ref{fig999}, in which two such characteristics are shown in \n(a) and (b) for weak and strong nonlinearity, respectively. \n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.48\\textwidth,angle=0]{rev-squid-afc-rand-fig02.png}\n\\caption{(Color online)\nCurrent amplitude $(I/I_c)_{max}$ - driving frequency $\\Omega$ characteristics for a single\nrf SQUID with $\\beta_L =0.88$, $\\gamma=0.024$, $\\phi_{dc}=0$, and (a) $\\phi_{ac}=0.005$;\n(b) $\\phi_{ac}=0.05$. The red arrows indicate the position of an anti-resonance (see text).\n\\label{fig999} }\n\\end{figure}\n\nIn Fig. \\ref{fig999}(a), the SQUID is close to the linear regime, in which the resonance\ncurve is single-valued, in the sense that each value of $\\Omega$ corresponds to only one \nvalue of $(I/I_c)_{max}$. Hysteretic effects are not visible, however the curve is not \nsymmetric as it should be in the truly linear regime. Note that from Eq, (\\ref{99}),\nlinearized around $\\phi \\simeq 0$, we get for the single SQUID resonance frequency the \nexpression $\\Omega_{SQ}= \\sqrt{1 +\\beta_L}$, which gives $\\Omega_{SQ}= 1.37$ for the \nparameters of Fig. \\ref{fig999}. In Fig. \\ref{fig999}(b), in which the ac field amplitude\nhas been increased by an order of magnitude, strongly nonlinear effects become readily \napparent. At least five stable branches can be identified in a narrow frequency region \naround unity, i.e., around the geometrical (inductive-capacitive, $LC$) resonance frequency.\nThe upper branches, which are extremely sensitive to perturbations, correspond to very\nhigh values of the current amplitude, which leads the Josephson junction of the SQUID to\nits normal state. Although the``resonance'' region in the strongly nonlinear regime has \nbeen shifted to the left, as compared with that in the weakly, almost linear regime,\nthe location of the anti-resonance has not been changed. This can be observed clearly in\nFig. \\ref{fig998}, where the anti-resonance frequency region has been enlarged in both\nregimes. The current amplitude anti-resonance makes itself apparent as a well defined dip\nin the characteristics, with a minimum that almost reaches zero. The effect of \nanti-resonance has been observed in nonlinearly coupled oscillators subjected to a periodic \ndriving force \\cite{Woafo1998} and in parametrically driven nonlinear oscillators \n\\cite{Chakraborty2013}. However, it has never before been observed in a single, periodically \ndriven nonlinear oscillator. The knowledge of the location of anti-resonance(s) as well as \nthe resonance(s) of an oscillator or a system of oscillators, beyond their theoretical \ninterest, they are of importance in device applications.\nCertainly they have significant implications for the SQUID metamaterials which properties \nare determined by those of their elements (i.e., the SQUIDs). When the SQUIDs are in an \nanti-resonant state, in which the induced current is zero, they do not absorb energy from \nthe applied field which can transpass the metamaterial almost unaffected. Thus, in such \na state, the SQUID metamaterial is transparent to the applied magnetic flux as has been \nalready observed experimentally \\cite{Zhang2015}. Moreover, since the anti-resonance \nfrequency is not affected by the amplitude of the ac field, the transparency can be \nobserved for a wide range of applied rf flux. In the strongly nonlinear regime, the \nanti-resonance lies in the multistability region (see Fig. \\ref{fig999}b), due to the frequency \nshift of the SQUID resonance because of the strong nonlinearity.\nIn that case, the transparency of the metamaterial may be turned on and off as it has \nbeen already discussed in Ref. \\cite{Zhang2015}. Thus, the concept of the anti-resonance \nserves for making a connection between an important SQUID metamaterial property and a \nfundamental nonlinear dynamical property of oscillators.        \n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.48\\textwidth,angle=0]{rev-squid-afc-rand-fig02-Enlarge.png}\n\\caption{(Color online)\nEnlargement of Figs. \\ref{fig999}(a) and (b) around the region of the anti-resonance.\nSame parameters as in Fig. \\ref{fig999}.\n\\label{fig998} } \n\\end{figure}\n\n\n\n\n\nFor the time integration of Eq. (\\ref{99}) of the single SQUID, a fourth-order Runge-Kutta\nalgorithm with constant time-step has been used. The same algorithm is also used for the \nsimulation of the SQUID metamaterial which is modeled by Eq. (\\ref{06}). The latter are  \nimplemented with the following boundary conditions\n\n", "index": 3, "text": "\\begin{equation}\n\\label{11} \n   \\phi_0 (\\tau) =0 , \\qquad \\phi_{N+1} (\\tau) =0 ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\phi_{0}(\\tau)=0,\\qquad\\phi_{N+1}(\\tau)=0,\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mi>ϕ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mrow><msub><mi>ϕ</mi><mrow><mi>N</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04843.tex", "nexttext": "\nWe use a spatial average with a window size of $\\delta=10$ elements. A local order parameter \n$Z_n=1$ indicates that the $n_{th}$ unit belongs to the coherent part of the chimera state, \nwhile $Z_n$ is less than 1 for incoherent parts. Note that in our system we have no periodic \nboundary conditions like in \\cite{Omelchenko2011}; therefore Eq.~\\ref{eq:locord} holds for \nthe SQUIDs with indices running from $n=\\delta+1,\\dots, N-\\delta$. For the SQUIDs close to \nboundaries \nof the structure, the calculation of the local order parameter is modified as follows:\n$Z_n=\\frac{1}{\\delta} \\sum\\limits_{m=n}^{n+\\delta} e^{i2\\pi \\phi_m}$ for $n=1,\\dots,\\delta$ and\n$Z_n=\\frac{1}{\\delta} \\sum\\limits_{m=n-\\delta}^{n} e^{i2\\pi \\phi_m}$ for $n=N-\\delta+1,\\dots,N$.\nA measure for the synchronization level in the whole metamaterial is given by magnitude of\nthe global Kuramoto order parameter $|\\Psi(\\tau)|$, where $\\Psi(\\tau)$ is defined as\n\n", "itemtype": "equation", "pos": 18958, "prevtext": "\nto account for the termination of the structure in a finite system. \nThe parameter values used in the simulations of the single SQUID and the SQUID \nmetamaterial are in the region in which the relevant experiments were carried out\n\\cite{Trepanier2013,Zhang2015}. \nIn Ref. \\cite{Trepanier2013}, the values of the SQUIDs' inductance, resistance, and \ncapacitance are $L=0.12~nH$, $R=840~\\Omega$, and $C=0.65~pF$, respectively, while the \ncritical current is $3.7~\\mu A$ and $1.2~\\mu A$ at temperature $T=4.2~K$ and $6.5~K$, \nrespectively. Inserting these values in the first of Eqs. (\\ref{14}), we get for $\\beta_L$ \nthe values $0.44$ and $1.3$ at $T=4.2~K$ and $6.5~K$, respectively. For the SQUID \nmetamaterial we use \n$\\beta_L =0.7$, which lies in between those values, while our value of the amplitude of \nthe alternating field $\\phi_{ac}=0.015$ lies within the range of values used in the \nexperiments ($\\phi_{ac} \\simeq 0.006 - 0.05$). The coupling coefficient between nearest \nneighbors in Ref. \\cite{Trepanier2013} has been estimated to be $\\lambda_0 \\simeq-0.02$, \nusing a simple approximation scheme in which the SQUIDs are regarded as thin rings. \nHowever, a large part of the area of the actual SQUID metamaterial is filled by \nsuperconducting material that the field cannot penetrate; it is thus expected that more \nmagnetic flux than that predicted by the simple approximation will find its way through \nthe SQUID rings, increasing thus considerably $\\lambda_0$ (we use $\\lambda_0=-0.05$). \nThe value of the loss coefficient in our simulations for the SQUID metamaterial is \n$\\gamma \\simeq 0.002$ (for the single SQUID $\\gamma \\simeq 0.024$), while \nfrom the second of Eqs. (\\ref{14}) and the values given in Ref. \\cite{Trepanier2013} we get\n$\\sim 0.02$. Although the losses in the SQUIDs can be reduced considerably by lowering the\ntemperature without affecting much the critical currents of the junctions, we have checked \nthat chimera states also exist for $\\gamma$ of the order of $\\sim 0.02$ when compensated\nby a larger ac field amplitude $\\phi_{ac}$.\nNote that the parameters used in the simulations of the one-dimensional SQUID metamaterial \nare compared with those in Ref. \\cite{Trepanier2013}, in which the experiments have been \ncarried out on two-dimensional arrays, merely to show that these are realistic. In this work, \nwe do not attempt to simulate a particular SQUID metamaterial. Moreover, the dimensionality \nof the system does not affect significantly the estimation of the parameters that are \nnecessary for the simulations, since they can be estimated either by the individual SQUID \nproperties (i.e., $\\beta$, $\\gamma$) or by a pair of SQUIDs (i.e., $\\lambda_0$).  \n\n\n\n\nThe spatial coherence and incoherence of the chimera state can be characterized by a \nreal-valued local order parameter \\cite{Omelchenko2011}\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:locord}\n   Z_n=\\frac{1}{2\\delta} \\sum_{|m-n| \\le \\delta} e^{i2\\pi \\phi_m} , \n       \\quad n=\\delta+1,\\dots, N-\\delta .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"Z_{n}=\\frac{1}{2\\delta}\\sum_{|m-n|\\leq\\delta}e^{i2\\pi\\phi_{m}},\\quad n=\\delta+%&#10;1,\\dots,N-\\delta.\" display=\"block\"><mrow><mrow><mrow><msub><mi>Z</mi><mi>n</mi></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>δ</mi></mrow></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>m</mi><mo>-</mo><mi>n</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mo>≤</mo><mi>δ</mi></mrow></munder><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>m</mi></msub></mrow></msup></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>n</mi><mo>=</mo><mrow><mrow><mi>δ</mi><mo>+</mo><mn>1</mn></mrow><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><mi>N</mi><mo>-</mo><mi>δ</mi></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04843.tex", "nexttext": "\nThis measure will be used in Sec.~\\ref{sec:sec4} where the transition from global \nsynchronization to desynchronization will be discussed.\n\n\\begin{figure}[t!]\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2a.png}\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2b.png}\\\\\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2c.png}\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2d.png}\\\\\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2e.png}\n\\includegraphics[clip,width=0.31\\textwidth,angle=-90]{fig2f.png}\n\\caption{(Color online)\nSpace-time plots for the flux $\\phi_n$ over the whole SQUID metamaterial for different \ninitial conditions. (a), (c) States with one incoherent region, (b), (d) States with two \nincoherent regions, (e) Travelling incoherent state, (f) Solitary state.\nParameter values are: $T=5.9$, $N=256$, $\\gamma=0.0021$, $\\lambda_0=-0.05$, $\\beta = 0.1114$ \n($\\beta_L\\simeq 0.7$), $\\phi_{ac}=0.015$, $\\phi_{dc}=0.0$.\n\\label{fig2} }\n\\end{figure}\n\n\n\n\n\n\\begin{figure}[t!]\n\\includegraphics[clip,width=0.45\\linewidth,angle=0]{fig3a.png}\n\\hspace{0.4cm}\n\\includegraphics[clip,width=0.45\\linewidth,angle=0]{fig3b.png}\n\\caption{(Color online) \nSnapshots of the spatial profile of the fluxes $\\phi_n$ corresponding to Fig.~\\ref{fig2} \n(left panel) and derivative of the phases $\\dot{\\phi}_n$ averaged over one period of the \ndriving force $T$. Parameters as in Fig.~\\ref{fig2}.\n\\label{fig3}}\n\\end{figure}\n\n\n\n\\section{Multistability and Synchronization}\n\\label{sec:sec3}\nThe individual SQUID is a highly nonlinear oscillator exhibiting multistability in a \ncertain parameter regime. This is very crucial for the occurrence of the chimera states\nwhen considering the coupled system under investigation. The number of possible states in \na SQUID metamaterial is not merely the sum of the combinations of individual SQUID states, \nsince their collective behavior may provide many more possibilities.\nDepending on the choice of initial conditions, various space-time flux patterns may be \nobtained, shown in Fig.~\\ref{fig2}, where the evolution of the $\\phi_n$s is monitored \nat times equal to multiples of one driving period $T=2\\pi/\\Omega$. In particular, \nFig.~\\ref{fig2}(a) corresponds to a typical pattern with two distinct domains: \na cluster of SQUIDS located around $n=150$ in which the fluxes oscillating with high \namplitude coexists with the rest of the array which oscillates with low-flux amplitude. \nThe latter part of the array is not completely homogeneous since small clusters and \nindividual SQUIDs perform slightly higher amplitude oscillations, which manifest themselves \nthrough the thin green lines. In Fig.~\\ref{fig2}(b) a similar pattern with two clusters \nof high amplitude oscillations is depicted. Single and double-headed chimera states with \nlarger sizes of incoherent clusters may also be achieved, as shown in Fig.~\\ref{fig2}(c)\nand (d), respectively. A coexisting traveling pattern can be seen in Fig.~\\ref{fig2}(e), \nwhere the largest part of the metamaterial is occupied by an incoherent cluster with \nvarying size and position in time. Finally Fig.~\\ref{fig2}(f) demonstrates a pattern \nof low-amplitude oscillations with multiple so-called solitary states \\cite{Maistrenko2014}, \nwhere many SQUIDs \nhave escaped from the main synchronized cluster and perform oscillations of slightly \nhigher amplitudes (depicted by the light green stripes in the otherwise orange background).\n\n\n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4a.png}\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4b.png}\\\\\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4c.png}\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4d.png}\\\\\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4e.png}\n\\includegraphics[clip,width=0.3\\textwidth,angle=-90]{fig4f.png}\n\\caption{(Color online) \nSpace-time plots for magnitude of the local order parameter $|Z_n|$ of the corresponding \nstates of Figure~\\ref{fig2}. Parameters as in Fig.~\\ref{fig2}.\n\\label{fig4} }\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\\includegraphics[clip,width=0.48\\textwidth,angle=0]{fig5a.png}\n\\includegraphics[clip,width=.5\\textwidth,angle=0]{fig5b.png}\n\\caption{(Color online)\nUpper panel: phase portraits of SQUID oscillators at nodes $110$ (a); $140$ (b); $150$ (c). \nLower panel: \nCorresponding time series of magnetic flux $\\phi$. Parameters as in Fig.~\\ref{fig2}.\n\\label{fig5} }\n\\end{figure}\n\nThe corresponding snapshots of $\\phi_n$ and the time-derivatives of the fluxes averaged over $T$,\n$\\langle \\dot{\\phi}_n (\\tau) \\rangle_T \\equiv \\langle v_n (\\tau)\\rangle_T$, at the end of \nthe integration time ($\\sim 5\\times10^4$ time units) are shown in the \nleft and right panels of Figs.~\\ref{fig3}, respectively. Note that $v_n (\\tau)$ is \nthe instantaneous voltage across the Josephson junction of the $n-$th rf SQUID. From the \nprofiles of $\\langle v_n (\\tau)\\rangle_T$ it can be seen that the coherent nodes have \nvalues very close to zero, which means that the SQUIDS in the coherent part are dominated \nby the driving force, while the incoherent nodes exhibit small deviations around the \nexternal driving frequency.\nThe synchronization within the aforementioned states can be visualized through the \nspace-time plots of the local order parameter (Eq.~\\ref{eq:locord}), shown in \nFig.~\\ref{fig4}. Red-orange colors denote the coherent regions and blue-green colors \nthe incoherent ones. These plots reveal the complexity of the synchronization levels in \nthe SQUID metamaterial: For example in Fig.~\\ref{fig4}(a) it can be seen that the \nincoherent region located in the center of the system {\\em periodically} achieves high \nvalues of \nsynchronization demonstrated by the orange ``islands'' within the cluster. This is related \nto metastability, which was extensively studied in \\cite{LAZ15}. In the coherent cluster, \non the other hand, we observe blue stripes of low synchronization which are evident for \nsolitary states that have escaped. Note that {\\em periodic synchronization}, characterized \nby periodic variation of the order parameter, has been previously observed in phase oscillator\nmodels with external periodic driving both with and without an inertial term \n\\cite{Choi1994,Hong1999}. \n\n\n\n\nAs already pointed out, a very crucial element for the formation of chimera states in our \nsystem is the multistability of periodic solutions in the single SQUID. For a certain set \nof parameter values, the single SQUID may reach either a high or a low flux amplitude \nstate, from basins of attraction typically smaller in the first case. Nonlocal coupling of \nSQUIDS can lead to stabilization of high flux amplitude states coexisting with low flux \namplitude ones. Typical phase portraits and the corresponding time series for such periodic \nsolutions are shown in Fig.~\\ref{fig5} for three SQUID oscillators of Fig.~\\ref{fig2}(a).\nFigure~\\ref{fig5}(a) corresponds to the SQUID at node $10$ which belongs to the \ncoherent cluster of the chimera states of Fig.~\\ref{fig2}(a), while Figs.~\\ref{fig2}(b) \nand (c) refer to nodes on the incoherent cluster, showing high amplitude oscillations. \nThe corresponding time series in Fig.~\\ref{fig5}(a')-(c') show highly modulated \nquasiperiodic behavior. Additional investigations have shown evidence of chaotic dynamics \nwhich requires further study beyond the scope of this paper.\n \n\n\n\n\\section{Synchronization-desynchronization transition}\n\\label{sec:sec4}\nIn the previous sections we have seen how chimera states occur as a result of the high\nmultistability in the SQUID metamaterial. Moreover, it has been demonstrated that the external \ndriving field dominates the frequency of the oscillations and therefore the level of \nsynchronization in the entire device. The external driving field has three control parameters, \nwhich would be easily accessible in an experiment: the dc ($\\phi_{dc}$) and ac ($\\phi_{ac}$)\nflux components and the driving period $T$ or equivalently the driving frequency $\\Omega$. \nIn Fig.~\\ref{fig6} the magnitude of the \nglobal order parameter (Eq.~\\ref{eq:globord}) averaged over the driving period \n$T=2\\pi/\\Omega$ is shown, in the parameter space of the $\\phi_{dc}$ and $T$, for three\ndifferent values of $\\phi_{ac}$. For very low values of ac component (Fig.~\\ref{fig6}(a)) \nthe level of synchronization is relatively high in the whole parameter space with distinct \nspots of lower coherence illustrated by their corresponding red color. Increasing $\\phi_{ac}$ \nto the value used in the previous sections (Fig.~\\ref{fig6}(b)), we observe that for \n$T<6$ the device is almost always synchronous. Above this critical value an area of \ndesynchronization is formed, including within it a smaller ``island'' of high synchronization.\nThe blue colored thin areas mark the border between synchronization and desynchronization.\nNote that the values for which chimera states were found in the previous sections ($T=5.9$ \nand $\\phi_{dc}=0$) the system finds itself in an area very close to this transition, which \nintuitively is logical. For further increase of the ac component (Fig.~\\ref{fig6}(c))\nthe synchronization areas shrink while the regions with less and lower coherence become \nlarger. This is interesting because it shows that even though the driving field is \nstronger, it doesn't necessarily force all the SQUID oscillators to synchronize.\nIn any case, the order parameter cannot be zero, except in the thermodynamic limit;\nfor a finite system such as the SQUID metamaterial considered here, the order parameter\nwill reach a lower bound in the desynchronized state that depends on the size of the \nsystem $N$. Density plots like those shown in Fig.~\\ref{fig6} may be useful for the \nconstruction of devices like parametric amplifiers that incorporate SQUID metamaterials\n\\cite{Castellanos2007,Castellanos2008} for which it is essential to avoid all types of \nnoise, chaos, etc.\n\n\\begin{figure*}\n\\includegraphics[clip,width=0.28\\textwidth,angle=-90]{fig6a.png}\n\\includegraphics[clip,width=0.28\\textwidth,angle=-90]{fig6b.png}\n\\includegraphics[clip,width=0.28\\textwidth,angle=-90]{fig6c.png}\n\\caption{(Color online) \nThe magnitude of the synchronization parameter (Eq.~\\ref{eq:globord}) in the parameter \nspace $(T,\\phi_{dc})$. where the brackets indicate averaging over the driving period \n$T=2\\pi/\\Omega$, with $\\Omega$ being the normalized driving frequency. \n(a) $\\phi_{ac}=0.003$, (b) $\\phi_{ac}=0.015$, and (c) $\\phi_ac=0.05$.\nOther parameters as in Fig.~\\ref{fig2}.\n\\label{fig6}}\n\\end{figure*}\n\n\n\n\n\n\\section{Conclusions}\n\\label{sec:sec5}\nIt has been demonstrated that single and double-headed chimera states coexist with \nsolitary states and patterns of travelling incoherence in nonlocally coupled SQUID \nmetamaterials. These coexisting patterns are a result of the high multistability of the \nindividual SQUID oscillator which tenders the dynamics even more complex when we consider\nan array of coupled elements. The spatial coherence was calculated through a local order \nparameter which reveals that the incoherent cluster periodically becomes coherent,\na sign of metastability previously studied.\n\n\nApart from the spatial complexity with coexisting high and low-flux amplitude oscillators,\nthe dynamics of the coupled system exhibit also temporal complexity. This is demonstrated \nthrough the phase portraits and time series of the individual SQUID oscillators, which\npresent a highly modulated quasiperiodic behavior. Evidence of chaos requires further \nstudies which will be included in a future publication. Finally, by scanning the control \nparameter space of the external dc driving field and the driving period for various values of \nthe ac field amplitude, we were able to locate the regions  where the transition from \ncoherence to incoherence occurs. This is relevant for locating chimera states in the \navailable parameter space which may also be useful in device applications. \n\n\nOur numerical simulations rely on a realistic model, which is capable of reproducing \nseveral experimental findings such as the tunability patterns of two-dimensional SQUID \nmetamaterials which are obtained by varying an applied dc flux and the driving frequency\n\\cite{Tsironis2014b}. Since several experiments in one- and two-dimensional SQUID \nmetamaterials have been already carried out, revealing very interesting properties peculiar\nto them, we believe that chimera states could in principle be detected with the presently\navailable set-ups. Thus, SQUID metamaterials may serve as a prototype, test-bed system\nto check and/or confirm theories and concepts of nonlinear dynamics of coupled oscillators.\n\\newline\n\n\n\n\n\t\n\n{\\bf Acknowledgements}\n\nThis work was partially supported by\nthe European Union Seventh Framework Programme (FP7-REGPOT-2012-2013-1)\nunder grant agreement no 316165,\nthe Ministry of Education and Science of the Russian Federation in the\nframework of the Increase Competitiveness Program of NUST ``MISiS'' (No. K2-2015-007),\nand the Thales Project MACOMSYS, cofinanced by the European Union (European\nSocial Fund ESF) and Greek national funds through the\nOperational Program ``Education and Lifelong Learning'' of\nthe National Strategic Reference Framework (NSRF) Research\nFunding Program: THALES Investing in Knowledge Society\nvia the European Social Fund.\n\n\n\n\\begin{thebibliography}{99}\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n\\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\expandafter\\ifx\\csname href\\endcsname\\relax\n\\def\\href#1#2{#2} \n\\def\\path#1{#1}\\fi\n\n\n \n\\bibitem{Anlage2011} \n  S. M. Anlage, J. Opt. \\textbf{13}, 024001 (2011).\n\n\\bibitem{Jung2014} \n  P. Jung, A.~V. Ustinov, and S.~M. Anlage, \n  Supercond. Sci. Technol. \\textbf{27}, 073001 (2014).\n\n\\bibitem{Jung2013} \n  P. Jung, S. Butz, S.~V. Shitov, and A.~V. Ustinov, \n  Appl. Phys. Lett. \\textbf{102}, 062601 (2013).\n\n\\bibitem{Butz2013a} \n  S. Butz, P. Jung, L.~V. Filippenko, V.~P. Koshelets, and A.~V. Ustinov, \n  Opt. Express \\textbf{21}, 22540 (2013).\n\n\\bibitem{Trepanier2013} \n  M. Trepanier, D. Zhang, O. Mukhanov, and S.~M. Anlage, \n  Phys. Rev. X \\textbf{3}, 041029 (2013).\n\n\\bibitem{Jung2014b} \n  P. Jung, S. Butz, M. Marthaler, M.~V. Fistul, J. Lepp\\\"akangas, V.~P. Koshelets, \n  and A.~V. Ustinov, \n  Nat. Commun. \\textbf{5}, 3730 (2014).\n\n\\bibitem{Zhang2015}\n  D. Zhang, M. Trepanier, O. Mukhanov, and S. M. Anlage,\n  Phys. Rev. X \\textbf{5}, 041045 (2015).\n\n\\bibitem{Josephson1962} \n  B. Josephson, Phys. Lett. A \\textbf{1}, 251 (1962).\n\n\\bibitem{Du2006} \n  C. Du, H. Chen, and S. Li, Phys. Rev. B \\textbf{74}, 113105 (2006).\n\n\\bibitem{Lazarides2007} \n  N. Lazarides and G.~P. Tsironis, Appl. Phys. Lett. \\textbf{90}, 163501 (2007).\n\n\\bibitem{KUR02a} \n  Y. Kuramoto and D. Battogtokh, \n  Nonlinear Phenom. Complex Syst. \\textbf{5}, 380 (2002).\n\n\\bibitem{ABR04} \n  D.~M. Abrams and S. H. Strogatz, Phys. Rev. Lett. \\textbf{93}, 174102 (2004).\n\n\\bibitem{Omelchenko2008} \n  O.~E. Omelâ\u0080\u0099chenko, Y.~L. Maistrenko, and P. A. Tass, \n  Phys. Rev. Lett. \\textbf{100}, 044105 (2008).\n\n\\bibitem{Abrams2008} \n  D. M. Abrams, R. Mirollo, S.~H. Strogatz, and D.~A. Wiley, \n  Phys. Rev. Lett. \\textbf{101}, 084103 (2008).\n\n\\bibitem{Pikovsky2008b} \n  A. Pikovsky and M. Rosenblum, \n  Phys. Rev. Lett. \\textbf{101}, 264103 (2008).\n\n\\bibitem{Ott2009} \n  E. Ott and T.~M. Antonsen, Chaos \\textbf{19}, 023117 (2009).\n\n\\bibitem{Martens2010} \n  A. Martens, C.~R. Laing, and S.~H. Strogatz, \n  Phys. Rev. Lett. \\textbf{104}, 044101 (2010).\n\n\\bibitem{Omelchenko2011} \n  I. Omelchenko, Y. Maistrenko, P. H\\\"ovel, and E. Sch\\\"oll, \n\n  Phys. Rev. Lett. \\textbf{106}, 234102 (2011).\n\n\\bibitem{Yao2013} \n  N. Yao, Z.-G. Huang, Y.-C. Lai, and Z.-G. Zheng, \n  Sci. Rep. \\textbf{3}, 3522 (2013).\n\n\\bibitem{Omelchenko2013} \n  I. Omelchenko, O. E. Omel'chenko, P. H{\\\"o}vel, and E. Sch{\\\"o}ll,\n  Phys. Rev. Lett. \\textbf{110}, 224101 (2013).\n\n\\bibitem{vuellings:2014}\n  A.~V{\\\"u}llings, J.~Hizanidis, I.~Omelchenko, and P.~H{\\\"o}vel, \n  New J.~Phys. \\textbf{16}, 123039 (2014).\n\n\\bibitem{Hizanidis2014} \n  J. Hizanidis, V. Kanas, A. Bezerianos, and T. Bountis, \n  Int. J. Bifurcation Chaos \\textbf{24}, 1450030 (2014).\n\n\\bibitem{Zakharova2014} \n  A. Zakharova, M. Kapeller, and E. Sch\\\"oll, \n  Phys. Rev. Lett. \\textbf{112}, 154101 (2014).\n\n\\bibitem{Bountis2014} \n  T. Bountis, V. Kanas, J. Hizanidis, and A. Bezerianos, \n  Eur. Phys. J.-Spec. Top. \\textbf{223}, 721 (2014).\n\n\\bibitem{Yeldesbay2014} \n  A. Yeldesbay, A. Pikovsky, and M. Rosenblum, \n  Phys. Rev. Lett. \\textbf{112}, 144103 (2014).\n\n\\bibitem{hizanidis:2015} \n  J. Hizanidis, E. Panagakou, E. Sch\\\"oll, P. H\\\"ovel, and A. Provata,\n  Phys. Rev. E  \\textbf{92}, 012915 (2015).\n\n\\bibitem{tinsley:2012} \n  M. R. Tinsley and K. Showalter, \n  Nature Phys. \\textbf{ 8}, 662 (2012).\n\n\\bibitem{hagerstrom:2012}\n  A.~M.Hagerstrom, T.~E. Murphy, R.~Roy, P.~H{\\\"o}vel, I.~Omelchenko, and E.~Sch{\\\"o}ll, \n  Nature Phys. \\textbf{8}, 658 (2012).\n\n\\bibitem{martens:2013}\n  E.~A. Martens, S.~Thutupalli, A.~Fourri{\\`e}re, and O.~Hallatschek, \n  Proc. Nat. Acad. Sciences \\textbf{110}, 10563 (2013).\n\n\\bibitem{larger:2013}\n  L.~Larger, B.~Penkovsky, and Y.~Maistrenko, \n  Phys. Rev. Lett. \\textbf{111}, 054103 (2013).\n\n\\bibitem{schmidt:2014}\n  L. Schmidt, K. Sch\\\"onleber, K. Krischer, and V. Garc\\'Ä±a-Morales,\n  Chaos \\textbf{24}, 013102 (2014).\n\n\\bibitem{wickramasinghe:2013}\n  M.~Wickramasinghe and I.~Z. Kiss, \n  PLoS ONE \\textbf{8}, e80586 (2013).\n\n\\bibitem{panaggio:2015}\n  M.~J. Pannagio and D.~Abrams,  \n  Nonlinearity \\textbf{28}, R67 (2015).\n\n\\bibitem{omelchenko:2015}\n  I.~Omelchenko, A.~Provata, J.~Hizanidis, E.~Sch{\\\"o}ll, and P.~H{\\\"o}vel,\n  Phys. Rev. E \\textbf{91}, 022917 (2015).\n\n\n\\bibitem{BOE15} \n  F. B\\\"ohm, A. Zakharova, E. Sch\\\"oll, and K. L\\\"udge,\n  Phys. Rev. E \\textbf{91}, 040901(R) (2015). \n\n\\bibitem{LAI15} \n  C. Laing, \n  Phys. Rev. E \\textbf{92}, 050904(R) (2015).\n\n\\bibitem{SHA10} \n  M. Shanahan, Chaos \\textbf{20}, 013108 (2010). \n\n\\bibitem{HIZ15} \n  J. Hizanidis, N.~E. Kouvaris, G. Zamora-L\\'opez, A. D\\'iaz-Guilera, and C. G. Antonopoulos, \n  Sci. Rep. (2015) (in print).\n\n\\bibitem{SIE14} \n  J. Sieber, O. E. Omel'chenko, and M. Wolfrum, \n  Phys. Rev. Lett. \\textbf{112}, 054102 (2014).\n\n\\bibitem{BIC15} \n  C. Bick and E.~A. Martens, New J. Phys. \\textbf{17}, 033030 (2015).\n\n\\bibitem{ISE15}\n  T. Isele, J. Hizanidis, A. Provata, and P. H\\\"ovel,\n  Phys. Rev. E (2015) (in print).\n\n\\bibitem{LAZ15} \n  N. Lazarides, G. Neofotistos, and G.~P. Tsironis,\n  Phys. Rev. B \\textbf{91}, 054303 (2015).\n\n\\bibitem{Lazarides2008a} \n  N. Lazarides, G.~P. Tsironis, and M. Eleftheriou, \n  Nonlinear Phenom. Complex Syst. \\textbf{11}, 250 (2008).\n\n\\bibitem{Lazarides2012} \n  N. Lazarides and G.~P. Tsironis, \n  Proc. SPIE \\textbf{8423}, 84231K (2012).\n\n\\bibitem{Lazarides2013b} \n  N. Lazarides and G. P. Tsironis, \n  Supercond. Sci. Technol. \\textbf{26}, 084006 (2013).\n\n\\bibitem{Jaros2015} \n  P. Jaros, Y. Maistrenko, and T. Kapitaniak,\n  Phys. Rev. E \\textbf{91}, 022907 (2015).\n\n\\bibitem{Olmi2015}\n  S. Olmi, Chaos \\textbf{25}, 123125 (2015).\n\n\n\\bibitem{Likharev1986}\n  K. K. Likharev,\n  {\\em Dynamics of Josephson Junctions and Circuits},\n  Gordon and Breach, Philadelphia (1986).\n\n\\bibitem{Woafo1998}\n  P. Woafo, H. B. Fotsin, and J. C. Chedjou,\n\n  Physica Scripta \\textbf{57}, 195 (1998).\n\n\\bibitem{Chakraborty2013}\n  S. Chakraborty and A. Sarkar,\n\n  Physica D \\textbf{254}, 24 (2013).\n\n\\bibitem{Maistrenko2014}\n  Yu. Maistrenko, B. Penkovsky, and M. Rosenblum, \n\n  Phys. Rev. E  \\textbf{89}, 060901(R) (2014).\n\n\\bibitem{Choi1994}\n  M. Y. Choi, Y. W. Kim, and D. C. Hong, \n  Phys. Rev. E \\textbf{49}, 3825 (1994).\n\n\\bibitem{Hong1999}\n  H. Hong, M. Y. Choi, J. Yi, and K.-S. Soh,\n  Phys. Rev. E \\textbf{59}, 353 (1999).\n\n\\bibitem{Castellanos2007}\n  M. A. Castellanos-Beltran and K. W. Lehnert,\n\n  Appl. Phys. Lett. \\textbf{91}, 083509 (2007).\n\n\\bibitem{Castellanos2008}\n  M. A. Castellanos-Beltran, K. D. Irwin, G. C. Hilton, L. R. Vale, and K. W. Lehnert, \n  Nature Physics \\textbf{4}, 928 (2008).\n\n\\bibitem{Tsironis2014b}\n  G. P. Tsironis, N. Lazarides, and I. Margaris,\n  Appl. Phys. A \\textbf{117}, 579 (2014).\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 20052, "prevtext": "\nWe use a spatial average with a window size of $\\delta=10$ elements. A local order parameter \n$Z_n=1$ indicates that the $n_{th}$ unit belongs to the coherent part of the chimera state, \nwhile $Z_n$ is less than 1 for incoherent parts. Note that in our system we have no periodic \nboundary conditions like in \\cite{Omelchenko2011}; therefore Eq.~\\ref{eq:locord} holds for \nthe SQUIDs with indices running from $n=\\delta+1,\\dots, N-\\delta$. For the SQUIDs close to \nboundaries \nof the structure, the calculation of the local order parameter is modified as follows:\n$Z_n=\\frac{1}{\\delta} \\sum\\limits_{m=n}^{n+\\delta} e^{i2\\pi \\phi_m}$ for $n=1,\\dots,\\delta$ and\n$Z_n=\\frac{1}{\\delta} \\sum\\limits_{m=n-\\delta}^{n} e^{i2\\pi \\phi_m}$ for $n=N-\\delta+1,\\dots,N$.\nA measure for the synchronization level in the whole metamaterial is given by magnitude of\nthe global Kuramoto order parameter $|\\Psi(\\tau)|$, where $\\Psi(\\tau)$ is defined as\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eq:globord} \n \\Psi(\\tau) = \\frac{1}{N} \\sum_{m=1}^N e^{i [2\\pi \\phi_m (\\tau)]} .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\Psi(\\tau)=\\frac{1}{N}\\sum_{m=1}^{N}e^{i[2\\pi\\phi_{m}(\\tau)]}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>N</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]