[{"file": "1601.07995.tex", "nexttext": "\n\\end{subequations}\nwhere $\\rho(t)$ is the fraction of adopters in the network, $\\nu(t)$ is the probability that a randomly chosen neighbour of a susceptible node is an adopter, and the initial conditions are $\\rho(0) = \\nu(0) = 0$. Here,\n\n", "itemtype": "equation", "pos": 20437, "prevtext": "\n\n\\title{\\textbf{Local cascades induced global contagion: \\\\ How heterogeneous thresholds, exogenous effects, and unconcerned behaviour govern online adoption spreading}}\n\n\\author[1]{M\\'arton Karsai\n\\thanks{Corresponding author: marton.karsai@ens-lyon.fr}}\n\\affil[1]{\\normalsize{Laboratoire de l'Informatique du Parall\\'elisme, INRIA-UMR 5668, IXXI, ENS de Lyon, 69364 Lyon, France}}\n\n\\author[2,3]{Gerardo I\\~niguez}\n\\affil[2]{\\normalsize{Department of Computer Science, School of Science, Aalto University, 00076, Finland}}\n\\affil[3]{\\normalsize{Centro de Investigaci{\\'o}n y Docencia Econ{\\'o}micas, CONACYT, 01210 M{\\'e}xico D.F., Mexico}}\n\n\\author[4,5]{Riivo Kikas}\n\\affil[4]{\\normalsize{Institute of Computer Science, University of Tartu, 50409 Tartu, Estonia}}\n\\affil[5]{\\normalsize{Software Technology and Applications Competence Center (STACC), 51003 Tartu, Estonia}}\n\n\\author[2]{Kimmo Kaski}\n\n\\author[6,7]{J\\'anos Kert\\'esz}\n\\affil[6]{\\normalsize{Center for Network Science, Central European University, 1051 Budapest, Hungary}}\n\\affil[7]{\\normalsize{Institute of Physics, Budapest University of Technology and Economics, 1111 Budapest, Hungary}}\n\n\\date{}\n\n\\maketitle\n\n\\textbf{keywords:} cascading behaviour, social spreading phenomena, complex contagion, adoption thresholds\n\n\n\\begin{abstract}\nAdoption of innovations, products or online services is commonly interpreted as a spreading process driven to large extent by social influence and conditioned by the needs and capacities of individuals. To model this process one usually introduces behavioural threshold mechanisms, which can give rise to the evolution of global cascades if the system satisfies a set of conditions. However, these models do not address temporal aspects of the emerging cascades, which in real systems may evolve through various pathways ranging from slow to rapid patterns. Here we fill this gap through the analysis and modelling of product adoption in the world's largest voice over internet service, the social network of Skype. We provide empirical evidence about the heterogeneous distribution of fractional behavioural thresholds, which appears to be independent of the degree of adopting egos. We show that the structure of real-world adoption clusters is radically different from previous theoretical expectations, since vulnerable adoptions---induced by a single adopting neighbour---appear to be important only locally, while spontaneous adopters arriving at a constant rate and the involvement of unconcerned individuals govern the global emergence of social spreading.\n\\end{abstract}\n\n\\section*{Introduction}\n\nSpreading of opinions, frauds, behavioural patterns, and product adoptions are all examples of social contagion phenomena where collective patterns emerge due to correlated decisions of a large number of individuals. Although these choices are personal, they are not independent but potentially driven by several processes such as social influence \\cite{Centola2010Spread}, homophily \\cite{McPherson2001}, and information arriving from external sources like news or mass media \\cite{Toole2011Modeling}. Social contagion evolves over networks of interconnected individuals, where links associated with social ties transfer influence between peers \\cite{RevModPhys.81.591}. Several earlier studies aimed to identify the dominant mechanisms at play in social contagion processes \\cite{Rogers2003Diffusion, Granovetter1978Threshold,schelling1969models,Axelrod1997Dissemination}. One key element, termed behavioural threshold by Granovetter \\cite{Granovetter1978Threshold}, is defined as \\textit{``the number or proportion of others who must make one decision before a given actor does so''}. Following this idea various network models have been introduced \\cite{Watts2002Simple,Handjani1997Survival,valente-thresholds-1996,Watts2007Influentials,Melnik2013Multistage,Gomez2010Modeling} to understand the threshold-driven spreading, commonly known as \\textit{complex contagion} \\cite{Centola2007Complex}. Although these models are related to a larger set of collective dynamics, they are particularly different from \\textit{simple contagion} where the exposure of nodes is driven by independent contagion stimuli \\cite{Barrat2008Dynamical, Bass1969}. In addition, collective adoption patterns may appear as a consequence of homophilic structural correlations, where connected individuals adopt due to their similar interests and not due to direct social influence. Distinguishing between the effects of social influence and homophily at the individual level remains as a challenge \\cite{Aral2009,Shalizi2011}. Furthermore, in real social spreading phenomena all these mechanisms are arguably present. However, while in the case of homophily the  \nadoption behaviour is only seemingly correlated, and for simple contagion only the number of exposures matters, in complex contagion the fraction of adopting neighbours relative to the total number of partners determines whether a node adopts or not, capturing the natural mechanisms involved in individuals' decision makings \\cite{Holt06,bikhchandani-hirshleifer-welch-92, Karsai2014Complex}. Due to this additional complexity, threshold models are able to emulate system-wide adoption patterns known as global cascades.\n\nBehavioural cascades are rare but potentially stupendous social spreading phenomena, where collective patterns of exposure emerge as a consequence of small initial perturbations. Some examples are the rapid emergence of political and grass-root movements \\cite{GonzalezBailon2011Dynamics,BorgeHolthoefer2011Structural,EllisInformation}, fast spreading of information \\cite{Dow2013Anatomy,Gruhl2004Information,Banos2013Role, Watts2007Influentials,Hale2013Regime,Leskovec2005Patterns,Leskovec2007Dynamics,Goel2012Structure} or behavioural patterns \\cite{Fowler2009Cooperative}, etc. The characterisation \\cite{Goel2012Structure, BorgeHolthoefer2013Cascading,Hackett2013Cascades,Gleeson2008Cascades,Brummitt2011,GhoshCascadesArxiv2010} and modelling \\cite{Watts2002Simple,Hurd2013Watts, Singh2013Thresholdlimited,Gleeson2007Seed} of such processes have received plenty of attention and provide some basic understanding of the conditions and structure of empirical and synthetic cascades. However, these studies commonly fail in addressing the temporal dynamics of the emerging cascades, which may vary considerably between different cases of social contagion. Moreover, they have not answered why real-world cascades can evolve through various dynamic pathways ranging from slow to rapid patterning, especially in systems where the threshold mechanisms play a role and social phenomena spread globally. Besides the case of rapid cascading mentioned above, an example of the other extreme is the propagation of products in social networks \\cite{Bass1969}, where adoption evolves gradually even if it is driven by threshold mechanisms and may cover a large fraction of the total population \\cite{Karsai2014Complex}. This behaviour characterises the adoption of online services such as Facebook, Twitter, LinkedIn and Skype (Fig.\\ref{fig:1}a), since their yearly maximum relative growth of cumulative adoption \\cite{SocialMedia} (for definition see Material and Methods (MM)) is lower than in the case of rapid cascades as suggested e.g. by the Watts threshold (WT) model.\n\nTo fill this gap in the modelling of social diffusion, here we will analyse and model real-world examples of social contagion phenomena. Our aim is to identify the crucial mechanisms necessary to consider in models of complex contagion to match them better with reality, and define a model that incorporates these mechanisms and captures the possible dynamics leading to the emergence of real-world global cascades. We follow the adoption dynamics of the Skype paid service ``buy credit'' for $89$ months since 2004, which evolves over the social network of one of the largest voice over internet providers in the world. Data includes the time of first payment of each user, an individual and conscious action that tracks adoption behaviour. In addition we follow the ``subscription\" service over $42$ months since 2008 (for results see Supplementary Information [SI]). In contrast to other empirical studies where incomplete knowledge about the underlying social network leads to unavoidable bias \\cite{Karsai2014Complex},  we use here the largest connected component of the aggregated free Skype service as the underlying structure, where nodes are Skype users and links confirmed contacts between them. This is a good approximation since it maps all connections in the Skype social network without sampling, and the paid service is only available for individuals already enrolled in the Skype network. The underlying structure is an aggregate from September 2003 to November 2011 (i.e. over $99$ months) and contains roughly 4.4 billion links and 510 million registered users worldwide \\cite{SkypeIPO}. The data is fully anonymised and considers only confirmed connections between users (for more data details see SI).\n\nIn what follows we first provide empirical evidence of the distribution of individual adoption thresholds and other structural and dynamical features of a worldwide adoption cluster. We incorporate the observed structural and threshold heterogeneities into a dynamical threshold model where multiple nodes adopting spontaneously (i.e. firstly among their neighbours) are allowed \\cite{Ruan2015}. We find that if the fraction of users who reject to adopt the product is large, the system enters a quenched state where the evolution and structure of the global adoption cluster is very similar to our empirical observations. Model calculations and the analysis of the real social contagion process suggest that the evolving structure of an adoption cluster differs radically from what has been proposed earlier \\cite{Watts2002Simple}, since it is triggered by several spontaneous adoptions arriving at a constant rate, while stable adopters who are initially resisting exposure, are actually responsible for the emergence of global social adoption (Fig.~\\ref{fig:1}b and c).\n\n\\section*{Results}\n\nSocial contagion phenomena can be modelled as binary-state processes evolving on networks and driven by threshold mechanisms. In these systems individuals are represented by nodes, each being either in a susceptible (0) or adopter (1) state and influencing each other by transferring information via social ties \\cite{Granovetter1978Threshold}. Nodes are connected in a network with degree distribution $P(k)$ and average degree $z = \\langle k \\rangle$. In addition, each node has an individual threshold $\\phi \\in [0, 1]$ drawn from a distribution $P(\\phi)$ with average $w = \\langle \\phi \\rangle$. This threshold determines the minimum fraction of exposed neighbours that triggers adoption and captures the resistance of an individual against engaging in spreading behaviour. Once a node reaches its threshold, it switches state from $0$ to $1$ and keeps it until the end of the dynamics. In his seminal paper about threshold dynamics, Watts \\cite{Watts2002Simple} classified nodes into three categories based on their threshold and degree. He identified {\\it innovator} nodes that spontaneously change state to $1$, thus starting the process. Such nodes have a trivial threshold $\\phi=0$. Then there are nodes with threshold $0 < \\phi \\leq 1/k$, called {\\it vulnerable}, which need one adopting neighbour before their own adoption. Finally, there are more resilient nodes with threshold $\\phi>1/k$, denoted as {\\it stable}, referring to individuals in need of strong social influence to follow the actions of their acquaintances.\n\nIn the WT model \\cite{Watts2002Simple}, small perturbations (like the spontaneous adoption of a single seed node) can trigger global cascading patterns.  However, their emergence is subject to the so-called {\\it cascade condition}: the innovator seed has to be linked to a percolating vulnerable cluster, which adopts immediately afterwards and further triggers a global cascade (i.e. a set of adopters larger than a fixed fraction of the finite network). The cascade condition is satisfied if the network is inside a bounded regime in $(w, z)$-space \\cite{Watts2002Simple}. This regime depends on degree and threshold heterogeneities \\cite{Watts2002Simple} and may change its shape if several innovators start the process \\cite{Singh2013Thresholdlimited}.\n\n\\subsection*{Empirical observations}\n\nDegree and threshold heterogeneities are indeed present in the social network of Skype. The degree distribution $P(k)$ is well approximated by a lognormal function $P(k) \\propto k^{-1} e^{-(\\ln k - \\mu_D)^2/(2\\sigma_D^2)}$ ($k \\geq {k_{\\mathrm{min}}}$) with parameters $\\mu_D=1.2$, $\\sigma_D=1.39$ and ${k_{\\mathrm{min}}}=1$ (Fig.~\\ref{fig:1}d), giving an average degree $z = 8.56$ (for goodness of fit see SI). Moreover, at the time of adoption we can measure the threshold $\\phi=\\Phi_k/k$ of a user by counting the number $\\Phi_k$ of its neighbours who have adopted the service earlier. We then group users by degree and calculate the distribution $P(\\Phi_k)$ of the integer threshold $\\Phi_k$ \\cite{Gleeson2008Cascades} (Fig.~\\ref{fig:1}e). By using the scaling relation $P(\\Phi_k, k) = k P(\\Phi_k/k)$ all distributions collapse to a master curve well approximated by a lognormal function $P(\\phi) \\propto \\phi^{-1} e^{-(\\ln\\phi - \\mu_T)^2/(2\\sigma_T^2)}$, with parameters $\\mu_T=-2$ and $\\sigma_T=1$ as constrained by the average threshold $w = 0.19$ (see MM and SI). Note that we observe qualitatively the same scaling and lognormal shape of the threshold distribution for another service (see SI). These empirical observations, in addition to the broad degree distribution, provide quantitative evidence about the heterogeneous nature of adoption thresholds.\n\n\\begin{figure*}[t]\n\\centering\n\\includegraphics[width=0.9\\textwidth,angle=0]{Fig1.pdf}\n\\caption{\\textbf{Structure and dynamics of online service adoption.} \\textbf{(a)} Yearly maximum relative growth rate (RGR) of cumulative adoption (see MM) for several online social-communication services \\cite{SocialMedia}, including three Skype paid services (s1 - \"subscription\", s2  - \"voicemail\", and s3 - \"buy credit\"). The red bar corresponds to a rapid cascade of adoption suggested by the Watts threshold (WT) model, while the green bar is the model prediction for Skype s3. \\textbf{(b-c)} Snowball sample of the Skype social network (gray links) with nodes and links coloured according to their adoption state: multiple innovators (green nodes), induced small vulnerable trees (red nodes and links), and the triggered connected stable cluster (blue nodes and links). Note that some vulnerable and stable clusters seemingly appear without an innovator seed due to the finite distance used in the snowball sampling method. \\textbf{(d)} Degree distribution $P(k)$ of the Skype network (gray/blue circles for raw/binned data) on double log-scale with arbitrary base $n$. $P(k)$ is fitted by a lognormal distribution (see MM and SI) with parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$, and average $z = 8.56$ (red line). \\textbf{(e)} Distribution $P(\\Phi_k)$ of integer thresholds $\\Phi_k$ for several degree groups in Skype s3 (inset). By using $P(\\Phi_k, k) = k P(\\Phi_k/k)$, these curves collapse to a master curve approximated by a lognormal function (dashed line in main panel) with parameters $\\mu_T=-2$ and $\\sigma_T=1$, as constrained by the average threshold $w = 0.19$ (see MM and SI). \\textbf{(f)} Adoption rate of innovators [$R_i(t)$], vulnerable nodes [$R_v(t)$], and stable nodes [$R_s(t)$], as well as net service adoption rate [$R(t)$]. Rates are measured with a 1-month time window, while $q$ and $\\tau$ are arbitrary constants. The shaded area indicates the regime where innovators adopt approximately with constant rate.\n\\label{fig:1}}\n\\end{figure*}\n\nSince we know the complete structure of the online social network, as well as the first time of service usage for all adopters, we can follow the temporal evolution of the adoption dynamics. By counting the number of adopting neighbours of an ego, we identify innovators ($\\Phi_k=0$), and vulnerable ($\\Phi_k=1$) or stable ($\\Phi_k>1$) nodes. The adoption rates for these categories behave rather differently from previous suggestions \\cite{Watts2002Simple} (Fig.~\\ref{fig:1}f). First, there is not only one seed but an increasing fraction of innovators in the system who, after an initial period, adopt approximately at a constant rate. Second, vulnerable nodes adopt approximately with the same rate as innovators suggesting a strong correlation between these types of adoption. Third, the overall adoption process accelerates due to the increasing rate of stable adoptions induced by social influence. At the same time a giant adoption cluster grows and percolates through the whole network (Fig.~\\ref{fig:3}a, main panel). Despite of this expansion dynamics and connected structure of the service adoption cluster, the service reaches less than $6\\%$ of the total number of active Skype users over a period of $7$ years \\cite{SkypeIPO}. Therefore we ask whether one can refer to these adoption clusters as cascades. They are not triggered by a small perturbation but induced by several innovators; their evolution is not instantaneous but ranges through several years; and although they involve millions of individuals, they reach only a reduced fraction of the whole network. To answer we incorporate the above mentioned features into a dynamical threshold model \\cite{Ruan2015} with a growing group of innovators and investigate their effect on the evolution of global social adoption. Note that we also perform a null model study to demonstrate, on the system level, that social influence dominates the contagion process, but not homophily (see section S3 of the SI, together with another empirical spreading scenario in S7.1).\n\n\\subsection*{Model}\n\nOur modelling framework is an extension to conventional threshold dynamics on networks studied by Watts, Gleeson, Singh, and others, where all nodes are initially susceptible and innovators are only introduced as an initial seed of arbitrary size~\\cite{Watts2002Simple,Gleeson2007Seed,Singh2013Thresholdlimited}. Apart from the threshold rule discussed above, our model considers two additional features: (i) a fraction $r$ of `immune' nodes that never adopt, indicating lack of interest in the service; (ii) due to external influence, susceptible nodes adopt the innovation spontaneously (i.e. become innovators) throughout time with constant rate $p_n$, rather than only at the beginning of the dynamics. In this way, the dynamical evolution of the system is completely defined by the online social network, the distribution $P(\\phi)$ and the parameters $r$, $p_n$. For the sake of simplicity we consider a configuration-model network, i.e., we ignore correlations in the social network and characterise it solely by its degree distribution $P(k)$. Furthermore, node degrees and thresholds are considered to be independent \\cite{Gleeson2008Cascades,gleeson2013binary,gleeson2011high}.\n\nOur threshold model, which has also been introduced in \\cite{Ruan2015}, can be studied analytically by extending the framework of approximate master equations (AMEs) for monotone binary-state dynamics recently developed by Gleeson~\\cite{Gleeson2008Cascades,gleeson2013binary,gleeson2011high}, where the transition rate between susceptible and adoption states only depends on the number $m$ of network neighbours that have already adopted. We describe a node by the property vector ${\\mathbf{k}} = (k, c)$, where $k = k_0, k_1, \\ldots k_{M-1}$ is its degree and $c = 0, 1, \\ldots, M$ its type, i.e. $c = 0$ is the type of the fraction $r$ of immune nodes, while $c \\neq 0$ is the type of all non-immune nodes that have threshold $\\phi_c$. In this way $P(\\phi)$ is substituted by the discrete distribution of types $P(c)$ (for $c > 0$). The integer $M$ is the maximum number of degrees (or non-zero types) considered in the AME framework, which can be increased to improve the accuracy of the analytical approximation at the expense of speed in its numerical computation (see S4.2). Under these conditions, the AME system describing the dynamics of the threshold model is reduced to the pair of ordinary differential equations (see SI),\n\\begin{subequations}\n\\label{eq:reducedAMEs}\n\n", "index": 1, "text": "\\begin{align}\n\\dot{\\rho} &= h(\\nu, t) - \\rho, \\\\\n\\dot{\\nu} &= g(\\nu, t) - \\nu,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{\\rho}\" display=\"inline\"><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=h(\\nu,t)-\\rho,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mi>h</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>ρ</mi></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{\\nu}\" display=\"inline\"><mover accent=\"true\"><mi>ν</mi><mo>˙</mo></mover></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=g(\\nu,t)-\\nu,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>ν</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nand,\n\n", "itemtype": "equation", "pos": 20766, "prevtext": "\n\\end{subequations}\nwhere $\\rho(t)$ is the fraction of adopters in the network, $\\nu(t)$ is the probability that a randomly chosen neighbour of a susceptible node is an adopter, and the initial conditions are $\\rho(0) = \\nu(0) = 0$. Here,\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq:hTerm}\nh = (1 - r) \\Big[ {f_t} + (1 - {f_t}) \\sum_{{\\mathbf{k}} | c \\neq 0} P(k) P(c) \\sum_{m \\geq k\\phi_c} {B_{k, m}}(\\nu) \\Big],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"h=(1-r)\\Big{[}{f_{t}}+(1-{f_{t}})\\sum_{{\\mathbf{k}}|c\\neq 0}P(k)P(c)\\sum_{m%&#10;\\geq k\\phi_{c}}{B_{k,m}}(\\nu)\\Big{]},\" display=\"block\"><mrow><mrow><mi>h</mi><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">[</mo><mrow><msub><mi>f</mi><mi>t</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>t</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder><mrow><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo maxsize=\"160%\" minsize=\"160%\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere ${f_t} = 1 - (1 - {p_r}) e^{-{p_r} t}$, ${p_r} = p_n / (1 - r)$, and ${B_{k, m}}(\\nu) = \\binom{k}{m} \\nu^m (1 - \\nu)^{k - m}$ is the binomial distribution. The fraction of adopters $\\rho$ is then obtained by solving Eq.~(\\ref{eq:reducedAMEs}) numerically. Since susceptible nodes adopt spontaneously with rate $p_n$, the fraction of innovators $\\rho_0(t)$ in the network is given by (see S4.3),\n\n", "itemtype": "equation", "pos": 20944, "prevtext": "\nand,\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:gTerm}\ng = (1 - r) \\Big[ {f_t} + (1 - {f_t}) \\sum_{{\\mathbf{k}} | c \\neq 0} \\frac{k}{z} P(k) P(c) \\sum_{m \\geq k\\phi_c} {B_{k-1, m}}(\\nu) \\Big],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"g=(1-r)\\Big{[}{f_{t}}+(1-{f_{t}})\\sum_{{\\mathbf{k}}|c\\neq 0}\\frac{k}{z}P(k)P(c%&#10;)\\sum_{m\\geq k\\phi_{c}}{B_{k-1,m}}(\\nu)\\Big{]},\" display=\"block\"><mrow><mrow><mi>g</mi><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo maxsize=\"160%\" minsize=\"160%\">[</mo><mrow><msub><mi>f</mi><mi>t</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>t</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder><mrow><mfrac><mi>k</mi><mi>z</mi></mfrac><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder><mrow><msub><mi>B</mi><mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo maxsize=\"160%\" minsize=\"160%\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig2.pdf}\n\\caption{{\\bf Threshold model for the adoption of online services.} {\\bf (a-b)} Surface plot of the normalised fraction of adopters $\\rho / (1 - r)$ in $(w, z)$-space, for $r = 0.73$ and $t = 89$. Contour lines signal parameter values for which $20\\%$ of non-immune nodes have adopted, for fixed $r$ and varying time (a), and for fixed time and varying $r$ (b). The continuous contour line and dot indicate parameter values in the last observation of Skype s3. A regime of maximal adoption ($\\rho \\approx 1 - r$) grows as time goes by, and shrinks for larger $r$. {\\bf (c)} Time series of the fraction of adopters $\\rho$ for fixed $p_n = 0.00019$ and varying $r$ (main), and for fixed $r = 0$ and varying $p_n$ (inset). These curves are well approximated by the solution of Eq.~(\\ref{eq:reducedAMEs}) for $k_0 = 3$, $k_{M-1} = 150$ and $M = 25$ (dashed lines). The dynamics is clearly faster for larger $p_n$. As $r$ increases, the system enters a regime where the dynamics is slowed down and adopters are mostly innovators. {\\bf (d)} Final fraction of innovators $\\rho_0(\\infty)$ and time $t_c$ when $50\\%$ of non-immune nodes have adopted as a function of $r$, both simulated and theoretical. The crossover to a regime of slow adoption is characterised by a maximal fraction of innovators and time $t_c$. Unless otherwise stated, $p_n=0.00019$ and we use $N=10^4$, $\\mu_D=1.09$, $\\sigma_D=1.39$, ${k_{\\mathrm{min}}}=1$, $\\mu_T=-2$, and $\\sigma_T=1$ to obtain $z = 8.56$ and $w = 0.19$ as in Skype s3. The difference in $\\mu_D$ between data and model is due to finite-size effects (see Materials and Methods). Numerical results are averages over $10^2$ (a-b) and $10^3$ (c-d) realisations.\n\\label{fig:2}}\n\\end{figure}\n\nWe also implement the threshold model numerically via a Monte Carlo simulation in a network of size $N$, with a lognormal degree distribution and a lognormal threshold distribution as observed empirically. Thus, we can explore the behaviour of $\\rho$ and $\\rho_0$ as a function of $z$, $w$, $p_n$ and $r$, both in the numerical simulation and in the theoretical approximation given by Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}). For $p_n > 0$ some nodes adopt spontaneously as time passes by, leading to a frozen state characterised by a final fraction $\\rho(\\infty) = 1 - r$ of adopters. However, the time needed to reach such state depends heavily on the distribution of degrees and thresholds, as signalled by a region of large adoption ($\\rho \\approx 1 - r$) that grows in $(w, z)$-space with time (contour lines in Fig.~\\ref{fig:2}a). If we fix a time in the dynamics and vary the fraction of immune nodes instead, this region shrinks as $r$ increases (contour lines in Fig.~\\ref{fig:2}b). In other words, the set of networks (defined by their average degree and threshold) that allow the spread of adoption is larger at later times in the dynamics, or when the fraction of immune nodes is small. When both $t$ and $r$ are fixed, the normalised fraction of adopters $\\rho / (1 - r)$ gradually decreases for less connected networks with larger thresholds (surface plot in Fig.~\\ref{fig:2}a and b).\n\nFor $r \\approx 0$ the critical fraction of innovators necessary to trigger a cascade of fast adoption throughout all susceptible nodes may be identified as the inflection point in the time series of $\\rho$ (Fig.~\\ref{fig:2}c, inset). The adoption cascade appears sooner for larger $p_n$, since this parameter regulates how quickly the critical fraction of innovators is reached. Yet as we increase $r$ above a threshold $r_c$, the system enters a regime where rapid cascades disappear and adoption is slowed down. The crossover between these regimes is gradual, as seen in the shape of $\\rho$ for increasing $r$ (Fig.~\\ref{fig:2}c, main panel). We may identify $r_c$ in various ways: by the maximum in both the final fraction of innovators $\\rho_0(\\infty)$ and the critical time $t_c$ when $\\rho = (1-r)/2$ (Fig.~\\ref{fig:2}d), or as the $r$ value where the inflection point in $\\rho$ disappears. These measures indicate $r_c \\approx 0.8$ for the chosen parameters. All global properties of the dynamics (like the functional dependence of $\\rho$ and $\\rho_0$) are very well approximated by the solution of Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}) (dashed lines in Fig.~\\ref{fig:2}c and d). Indeed, the AME framework is able to capture the shape of the $\\rho$ time series, the crossover between regimes of fast and slow adoption, as well as the maximum in $\\rho_0(\\infty)$ and $t_c$.\n\n\\subsection*{Validation} \n\nTo better understand how innovation spreads throughout real social networks, we take a closer look at the internal structure of the service adoption process. By taking into account individual adoption times we construct an evolving adoption network with links between users who have adopted the service before time $t$ and are connected in the social structure. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. This way links in the adoption graph indicate ties where social influence among individuals could have existed. The size distribution $P(s_a)$ of connected components in the adoption network shows the emergence of a giant percolating component over time (Fig.~\\ref{fig:3}a), along with several other small clusters. Moreover, after decomposition we observe that the giant cluster does not consist of a single innovator seed and percolating vulnerable tree~\\cite{Watts2002Simple}, but builds up from several innovator seeds that induce small vulnerable trees locally (Fig.~\\ref{fig:3}b), each with small depth (Fig.~\\ref{fig:3}d) \\cite{Bakshy11,Goel2012Structure}. At the same time the stable adoption network (considering connections between all stable adopters at the time) has a giant connected component, indicating the emergence of a percolating stable cluster with size comparable to the largest adoption cluster (Fig.~\\ref{fig:3}a, inset). These observations suggest a scenario for the evolution of the global adoption component different from earlier threshold models ~\\cite{Watts2002Simple}. It appears that here multiple innovators adopt at different times and trigger local vulnerable trees (Fig.\\ref{fig:1}b), which in turn induce a percolating component of connected stable nodes that holds the global adoption cluster together (Fig.\\ref{fig:1}c). Consequently, in the structure of the adoption network primary triggering effects are important only locally, while external and secondary triggering mechanisms seem to be responsible for the emergence of global-scale adoption. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig3.pdf}\n\\caption{\\textbf{Empirical cluster statistics and simulation results.} \\textbf{(a)} Empirical connected-component size distribution at different times for the adoption [$P(s_a)$, main panel] and stable adoption [$P(s_s)$, inset] networks, with $s_a$ and $s_s$ relative to system size. \\textbf{(b)} Empirical connected-component size distribution $P(s_v)$ for the relative size of innovator-induced vulnerable trees at different times. \\textbf{(c)} Average size of the largest ($LC$) and 2nd largest ($LC^{2nd}$) components of the model network (`Net'), adoption network (`Casc'), stable network (`Stab'), and induced vulnerable trees (`Vuln') as a function of $r$. Dashed lines show the observed relative size of the real $LC$ of the adopter network in $2011$ [see main panel in (a)] and the predicted $r$ value. \\textbf{(d)} Distribution $P(d)$ of depths of induced vulnerable trees in both data and model for several $r$ values, showing a good fit with the data for $r=0.73$. The difference in the tail is due to finite-size effects. \\textbf{(e)} Correlation $\\langle s_v \\rangle (k)$ between innovator degree and average size of vulnerable trees in both data and model with the same $r$ values as in (e). Model calculations for (d) and (e) correspond to networks of size $N=10^6$ and are averaged over $10^2$ realisations.\n\\label{fig:3}}\n\\end{figure}\n\nTo model the observed dynamics and explore the effect of immune nodes, we perform extensive numerical simulations of the threshold model with parameters determined directly from the data (see MM and SI). We use a network structure with empirical degree and threshold distributions and fix $p_n=0.00019$ as the constant rate of innovators, implying that the time scale of a Monte Carlo iteration in the model is 1 month. We measure the average size of the largest ($LC$) and second largest ($LC^{2nd}$) connected components of the background social network, and of the stable, vulnerable and global adoption networks, as a function of the fraction of immune nodes $r$. After $T=89$ iterations (matching the length of the real observation period) we identify three regimes of the dynamics (Fig.~\\ref{fig:3}c): if $0<r<0.6$ (dark-shaded area) the spreading process is very rapid and evolves in a global cascade, which reaches most of the nodes of the shrinking susceptible network in a few iteration steps. About $10\\%$ of adopters are connected in a percolating stable cluster, while vulnerable components remain very small in accordance with empirical observations. In the crossover regime $0.6<r<0.8$ (light-shaded area), the adoption process slows down considerably (Fig.~\\ref{fig:2}d, lower panel), as stable adoptions become less likely due to the quenching effect of immune nodes. The adoption process becomes the slowest at $r_c=0.8$ (Fig.~\\ref{fig:2}d, lower panel) when the percolating stable cluster falls apart, as demonstrated by a peak in the corresponding $LC^{2nd}$ curve (Fig.~\\ref{fig:3}c, lower panel). Finally, around $r=0.9$ the adoption network becomes fragmented and no global diffusion takes place. We repeat the same calculations for another service and find qualitatively the same picture, but with the crossover regime shifted towards larger $r$ values due to the different parametrisation of the model process. Note that another possible reason for the slow adoption could be the time users wait between their threshold has been reached and actual adoption. We test for the effect of this potential scenario on the empirical curves but find no qualitative change in the dynamics (see SI).\n\n\nWe can use these calculations to estimate the only unknown parameter (the fraction $r$ of immune nodes in Skype) by matching the size of the largest component ($LC_{Net}$) between real and model adoption networks at time $T$. Empirically, this value is the relative size corresponding to the last point on the right-hand side of the distribution for $2011$ (Fig.~\\ref{fig:3}a, main panel). The corresponding value in the model is $r = 0.73$ (dashed lines in Fig.~\\ref{fig:3}c; also Fig.~\\ref{fig:2}a and b), suggesting that the real adoption process lies in the crossover regime. The other analysed service turns out to lie right of the crossover regime, which explains its large innovator adoption rate and reduced size of stable and vulnerable adoption clusters (see SI).\n\nTo test the validity of the prediction of $r$ we perform three different calculations. First we measure the maximum relative growth rate of cumulative adoption and find a good match between model and data (Skype s3 and Model Skype s3 in Fig.~\\ref{fig:1}a). In other words, the model correctly estimates the speed of the adoption process. Second, we measure the distribution $P(d)$ of depths of induced vulnerable trees (Fig.~\\ref{fig:3}d). Finally, in order to verify earlier theoretical suggestions \\cite{Singh2013Thresholdlimited}, we look at the correlation $\\langle s_v \\rangle (k)$ between the degree of innovators and the average size of vulnerable trees induced by them (Fig.~\\ref{fig:3}e). We perform the last two measurements on the real data and in the model process for $r=0.6$ and $0.9$, as  well as for the predicted value $r=0.73$. In the case of $\\langle s_v \\rangle (k)$, we find a strong positive correlation in the data, explained partially by degree heterogeneities in the underlying social network, but surprisingly well emulated by the model. More importantly, although both quantities appear to scale with $r$, measures for the estimated $r$ value fit the empirical data remarkably well, confirming our earlier validation based on the matching of relative component sizes (for further discussion see SI).\n\n\\section*{Discussion}\n\nAlthough some products and innovations diffusing in society may cover a large fraction of the population, their spreading tends to follow slow cascading patterns, the dynamics of which have been modelled before by simple diffusion models like that of Bass \\cite{Bass1969}. However, this approach neglects threshold mechanisms that arguably drive the decision making of single individuals. On the other hand, threshold models study the conditions for cascades in global diffusion but do not address their temporal evolution, which is clearly a relevant factor in real-world adoption processes. These models are commonly used to predict rapid cascading patterns of adoption, which is a more realistic scenario for the spreading of information, opinions, or behavioural patterns but are not observed in the case of product or innovation diffusion where adoption requires additional efforts, e.g., free or paid registration. Here we provide a solution for this conundrum by analysing and modelling the worldwide spread of an online service in the techno-social communication network of Skype. Beyond the novel empirical evidence about heterogeneous adoption thresholds and non-linear dynamics of the adoption process, we identify two additional components necessary to introduce in the modelling of product adoption, namely: (a) a constant flow of innovators, which may induce rapid adoption cascades even if the system is initially out of the cascading regime; and (b) a fraction of immune nodes that forces the system into a quenched state where adoption slows down. These features are responsible for a critical structure of empirical adoption components that radically differs from previous theoretical expectations. We incorporate these mechanisms into a threshold model controlled by the rate of innovators and the fraction of immune nodes. The model is able to reproduce several pathways ranging from cascading behaviour to more realistic dynamics of innovation adoption. By constraining the model with empirically determined parameters, we provide an estimate for the real fraction of susceptible agents in the social network of Skype, and validate this prediction through correlated structural features matching empirical observations.\n\nOur aim in this study was to provide empirical observations as well as methods and tools to model the dynamics of social contagion phenomena with the hope it will foster thoughts for future research. One possible direction would be the observation of the reported structure and evolution of the global adoption cluster in other systems similar to the ones studied in \\cite{BorgeHolthoefer2011Structural,Dow2013Anatomy,Gruhl2004Information,Goel2012Structure,BorgeHolthoefer2013Cascading,Bakshy11}. Other promising directions could be the consideration of homophilic or assortative structural correlations, the evolving nature of the underpinning social structure as studied in \\cite{Karsai2014Complex}, interpersonal influence, or the effects of leader-follower mechanisms on the social contagion process. Finally, we hope that the reported results may improve efficiency in the strategies of enhancing the diffusion of products and innovations, by shifting attention from the creation of short-lived perturbations to the sustenance of external input.\n\n\\subsubsection*{Competing interest statement}\nThe authors have no competing interests.\n\n\\subsubsection*{Authors' contributions statement}\nM.K., G.I., R.K., K.K, and J.K designed the research and participated in writing the manuscript. R.K. and M.K. analysed the empirical data, G.I. made the analytical calculations, and M.K. and G.I. performed the numerical simulations.\n\n\\subsubsection*{Acknowledgements}\nThe authors gratefully acknowledge the support of M. Dumas, A. Saabas, and A. Dumitras from STACC and Microsoft/Skype Labs as well as constructive comments by J. Saram\\\"aki and T. N{\\\"a}si.\n\n\\subsubsection*{Funding statement}\nG.I. acknowledges the Academy of Finland, and J.K. the CIMPLEX FET Open H2020 EU project for support. This research was partly funded by Microsoft/Skype Labs.\n\n\\section*{Material and Methods}\n\n\\section*{Data description}\n\nWe use a static representation of the Skype social network aggregated over 99 months between September 2003 and November 2011. We follow the adoption of the ``buy credit'' paid service for $89$ months starting from 2004, and the paid service ``subscription'' for $42$ months starting from 2008 (for further details about the network and service see SI). By considering the online social structure and adoption times, we identify users as innovator, vulnerable, or stable nodes based on the number $\\Phi_k$ of adopting neighbours at the time of exposure. Thresholds are calculated as $\\phi=\\Phi_k/k$ for users with $k$ contacts. The adoption network is constructed by considering confirmed social links between users who adopted the service earlier than $t$. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. Note that for the categorisation of nodes we use only the adoption time and the state of their peers, and thus real categories may differ slightly. For example, an innovator may appear as a vulnerable or stable node, even if its decision was not driven by social influence but some of its peers adopted earlier. To consider this bias we measure effective rates of adoption for the model process as well, just like for the empirical case (Fig.\\ref{fig:1}) and section S3.\n\n\\section*{Maximum relative growth rate}\n\nThis measure is obtained by taking the maximum of the yearly adoption rate (yearly count of adoptions) normalised by the final observed adoption number of a given service. It characterises the maximum speed of adoption a service experienced during its history and takes values between 0 (no cascade) and 1 (instantaneous cascade). We repeat this measurement for the estimated number of registered users of Facebook, Twitter, and LinkedIn \\cite{SocialMedia}, as well as for the number of active users of Skype and three paid Skype services. Adoption rates for Facebook, Twitter, and LinkedIn correspond to the period between 2006 and 2012, and for Skype and its services to the interval from release date until 2011.\n\n\\section*{Empirical parameter estimation}\n\nWe use the Skype data to directly determine all model parameters, apart from the fraction $r$ of immune nodes. To best approximate the degree distribution of the real network, after testing different candidate functions (see SI) we select a lognormal function $P(k) = e^{ -(\\ln k-\\mu_D)^2 / (2\\sigma_D^2) } / (k\\sigma_D\\sqrt{2\\pi})$ with parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$ and minimum degree ${k_{\\mathrm{min}}} = 1$, leading to the average degree $z = 8.56$. To account for finite-size effects in the model results for low $N$ (Fig.~\\ref{fig:2}), we decrease $\\mu_D$ slightly to obtain the same value of $z$ as in the real network.\n\nThe threshold distribution of each degree group collapses to a master curve after normalisation by using the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$. This master curve can be well approximated by the lognormal distribution $P(\\phi) = e^{ -(\\ln \\phi-\\mu_T)^2 / (2\\sigma_T^2) } / (\\phi\\sigma_T\\sqrt{2\\pi})$, with parameters $\\mu_T=-2$ and $\\sigma_T=1$ as determined by the empirical average threshold $w = 0.19$ and standard deviation $0.233$ (for further details see SI). We estimate a rate of innovators $p_n = 0.00019$ by fitting a constant function to $R_i(t)$ for $t > 2\\tau$ (Fig.~\\ref{fig:1}f). The fit to ${p_n}$ also matches the time scale of a Monte Carlo iteration in the model to 1 month. Model results (Fig.~\\ref{fig:3}d and e) are calculated with $r = 0.73$ and $p_n = 0.00019$. Simulation results in Fig.~\\ref{fig:3}c (d and e) are averaged over $100$ configuration-model networks of size $N=10^5$ ($10^6$) after $T=89$ iterations, matching the length of the observation period in Skype.\n\n\\section*{Model description}\n\nWe characterise the static social network by the extended distribution ${P({{\\mathbf{k}}})}$, where ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$. Non-immune, susceptible nodes with property vector ${\\mathbf{k}}$ adopt spontaneously at a constant rate ${p_n}$, else they adopt only if a fraction $\\phi_c$ of their $k$ neighbours have adopted before. These rules are condensed in the probability ${F_{{\\mathbf{k}}, m}} dt$ that a node will adopt in a small time interval $dt$, given that $m$ of its neighbours are already adopters,\n\n", "itemtype": "equation", "pos": 21532, "prevtext": "\nwhere ${f_t} = 1 - (1 - {p_r}) e^{-{p_r} t}$, ${p_r} = p_n / (1 - r)$, and ${B_{k, m}}(\\nu) = \\binom{k}{m} \\nu^m (1 - \\nu)^{k - m}$ is the binomial distribution. The fraction of adopters $\\rho$ is then obtained by solving Eq.~(\\ref{eq:reducedAMEs}) numerically. Since susceptible nodes adopt spontaneously with rate $p_n$, the fraction of innovators $\\rho_0(t)$ in the network is given by (see S4.3),\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eq:innovFrac}\n\\rho_0 = {p_r} \\int_0^t (1 - r - \\rho) dt.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\rho_{0}={p_{r}}\\int_{0}^{t}(1-r-\\rho)dt.\" display=\"block\"><mrow><mrow><msub><mi>ρ</mi><mn>0</mn></msub><mo>=</mo><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></msubsup><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi><mo>-</mo><mi>ρ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwith $F_{(k,0),m} = 0$ $\\forall k, m$ and $F_{(0,c),0} = {p_r}$ $\\forall c \\neq 0$ (for immune and isolated nodes, respectively). The dynamics of adoption is well described by an AME for the fraction ${s_{{\\mathbf{k}}, m}}(t)$ of ${\\mathbf{k}}$-nodes that are susceptible at time $t$ and have $m=0,\\ldots,k$ adopting neighbours~\\cite{porter2014,gleeson2013binary,gleeson2011high},\n\n", "itemtype": "equation", "pos": 42941, "prevtext": "\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig2.pdf}\n\\caption{{\\bf Threshold model for the adoption of online services.} {\\bf (a-b)} Surface plot of the normalised fraction of adopters $\\rho / (1 - r)$ in $(w, z)$-space, for $r = 0.73$ and $t = 89$. Contour lines signal parameter values for which $20\\%$ of non-immune nodes have adopted, for fixed $r$ and varying time (a), and for fixed time and varying $r$ (b). The continuous contour line and dot indicate parameter values in the last observation of Skype s3. A regime of maximal adoption ($\\rho \\approx 1 - r$) grows as time goes by, and shrinks for larger $r$. {\\bf (c)} Time series of the fraction of adopters $\\rho$ for fixed $p_n = 0.00019$ and varying $r$ (main), and for fixed $r = 0$ and varying $p_n$ (inset). These curves are well approximated by the solution of Eq.~(\\ref{eq:reducedAMEs}) for $k_0 = 3$, $k_{M-1} = 150$ and $M = 25$ (dashed lines). The dynamics is clearly faster for larger $p_n$. As $r$ increases, the system enters a regime where the dynamics is slowed down and adopters are mostly innovators. {\\bf (d)} Final fraction of innovators $\\rho_0(\\infty)$ and time $t_c$ when $50\\%$ of non-immune nodes have adopted as a function of $r$, both simulated and theoretical. The crossover to a regime of slow adoption is characterised by a maximal fraction of innovators and time $t_c$. Unless otherwise stated, $p_n=0.00019$ and we use $N=10^4$, $\\mu_D=1.09$, $\\sigma_D=1.39$, ${k_{\\mathrm{min}}}=1$, $\\mu_T=-2$, and $\\sigma_T=1$ to obtain $z = 8.56$ and $w = 0.19$ as in Skype s3. The difference in $\\mu_D$ between data and model is due to finite-size effects (see Materials and Methods). Numerical results are averages over $10^2$ (a-b) and $10^3$ (c-d) realisations.\n\\label{fig:2}}\n\\end{figure}\n\nWe also implement the threshold model numerically via a Monte Carlo simulation in a network of size $N$, with a lognormal degree distribution and a lognormal threshold distribution as observed empirically. Thus, we can explore the behaviour of $\\rho$ and $\\rho_0$ as a function of $z$, $w$, $p_n$ and $r$, both in the numerical simulation and in the theoretical approximation given by Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}). For $p_n > 0$ some nodes adopt spontaneously as time passes by, leading to a frozen state characterised by a final fraction $\\rho(\\infty) = 1 - r$ of adopters. However, the time needed to reach such state depends heavily on the distribution of degrees and thresholds, as signalled by a region of large adoption ($\\rho \\approx 1 - r$) that grows in $(w, z)$-space with time (contour lines in Fig.~\\ref{fig:2}a). If we fix a time in the dynamics and vary the fraction of immune nodes instead, this region shrinks as $r$ increases (contour lines in Fig.~\\ref{fig:2}b). In other words, the set of networks (defined by their average degree and threshold) that allow the spread of adoption is larger at later times in the dynamics, or when the fraction of immune nodes is small. When both $t$ and $r$ are fixed, the normalised fraction of adopters $\\rho / (1 - r)$ gradually decreases for less connected networks with larger thresholds (surface plot in Fig.~\\ref{fig:2}a and b).\n\nFor $r \\approx 0$ the critical fraction of innovators necessary to trigger a cascade of fast adoption throughout all susceptible nodes may be identified as the inflection point in the time series of $\\rho$ (Fig.~\\ref{fig:2}c, inset). The adoption cascade appears sooner for larger $p_n$, since this parameter regulates how quickly the critical fraction of innovators is reached. Yet as we increase $r$ above a threshold $r_c$, the system enters a regime where rapid cascades disappear and adoption is slowed down. The crossover between these regimes is gradual, as seen in the shape of $\\rho$ for increasing $r$ (Fig.~\\ref{fig:2}c, main panel). We may identify $r_c$ in various ways: by the maximum in both the final fraction of innovators $\\rho_0(\\infty)$ and the critical time $t_c$ when $\\rho = (1-r)/2$ (Fig.~\\ref{fig:2}d), or as the $r$ value where the inflection point in $\\rho$ disappears. These measures indicate $r_c \\approx 0.8$ for the chosen parameters. All global properties of the dynamics (like the functional dependence of $\\rho$ and $\\rho_0$) are very well approximated by the solution of Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}) (dashed lines in Fig.~\\ref{fig:2}c and d). Indeed, the AME framework is able to capture the shape of the $\\rho$ time series, the crossover between regimes of fast and slow adoption, as well as the maximum in $\\rho_0(\\infty)$ and $t_c$.\n\n\\subsection*{Validation} \n\nTo better understand how innovation spreads throughout real social networks, we take a closer look at the internal structure of the service adoption process. By taking into account individual adoption times we construct an evolving adoption network with links between users who have adopted the service before time $t$ and are connected in the social structure. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. This way links in the adoption graph indicate ties where social influence among individuals could have existed. The size distribution $P(s_a)$ of connected components in the adoption network shows the emergence of a giant percolating component over time (Fig.~\\ref{fig:3}a), along with several other small clusters. Moreover, after decomposition we observe that the giant cluster does not consist of a single innovator seed and percolating vulnerable tree~\\cite{Watts2002Simple}, but builds up from several innovator seeds that induce small vulnerable trees locally (Fig.~\\ref{fig:3}b), each with small depth (Fig.~\\ref{fig:3}d) \\cite{Bakshy11,Goel2012Structure}. At the same time the stable adoption network (considering connections between all stable adopters at the time) has a giant connected component, indicating the emergence of a percolating stable cluster with size comparable to the largest adoption cluster (Fig.~\\ref{fig:3}a, inset). These observations suggest a scenario for the evolution of the global adoption component different from earlier threshold models ~\\cite{Watts2002Simple}. It appears that here multiple innovators adopt at different times and trigger local vulnerable trees (Fig.\\ref{fig:1}b), which in turn induce a percolating component of connected stable nodes that holds the global adoption cluster together (Fig.\\ref{fig:1}c). Consequently, in the structure of the adoption network primary triggering effects are important only locally, while external and secondary triggering mechanisms seem to be responsible for the emergence of global-scale adoption. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig3.pdf}\n\\caption{\\textbf{Empirical cluster statistics and simulation results.} \\textbf{(a)} Empirical connected-component size distribution at different times for the adoption [$P(s_a)$, main panel] and stable adoption [$P(s_s)$, inset] networks, with $s_a$ and $s_s$ relative to system size. \\textbf{(b)} Empirical connected-component size distribution $P(s_v)$ for the relative size of innovator-induced vulnerable trees at different times. \\textbf{(c)} Average size of the largest ($LC$) and 2nd largest ($LC^{2nd}$) components of the model network (`Net'), adoption network (`Casc'), stable network (`Stab'), and induced vulnerable trees (`Vuln') as a function of $r$. Dashed lines show the observed relative size of the real $LC$ of the adopter network in $2011$ [see main panel in (a)] and the predicted $r$ value. \\textbf{(d)} Distribution $P(d)$ of depths of induced vulnerable trees in both data and model for several $r$ values, showing a good fit with the data for $r=0.73$. The difference in the tail is due to finite-size effects. \\textbf{(e)} Correlation $\\langle s_v \\rangle (k)$ between innovator degree and average size of vulnerable trees in both data and model with the same $r$ values as in (e). Model calculations for (d) and (e) correspond to networks of size $N=10^6$ and are averaged over $10^2$ realisations.\n\\label{fig:3}}\n\\end{figure}\n\nTo model the observed dynamics and explore the effect of immune nodes, we perform extensive numerical simulations of the threshold model with parameters determined directly from the data (see MM and SI). We use a network structure with empirical degree and threshold distributions and fix $p_n=0.00019$ as the constant rate of innovators, implying that the time scale of a Monte Carlo iteration in the model is 1 month. We measure the average size of the largest ($LC$) and second largest ($LC^{2nd}$) connected components of the background social network, and of the stable, vulnerable and global adoption networks, as a function of the fraction of immune nodes $r$. After $T=89$ iterations (matching the length of the real observation period) we identify three regimes of the dynamics (Fig.~\\ref{fig:3}c): if $0<r<0.6$ (dark-shaded area) the spreading process is very rapid and evolves in a global cascade, which reaches most of the nodes of the shrinking susceptible network in a few iteration steps. About $10\\%$ of adopters are connected in a percolating stable cluster, while vulnerable components remain very small in accordance with empirical observations. In the crossover regime $0.6<r<0.8$ (light-shaded area), the adoption process slows down considerably (Fig.~\\ref{fig:2}d, lower panel), as stable adoptions become less likely due to the quenching effect of immune nodes. The adoption process becomes the slowest at $r_c=0.8$ (Fig.~\\ref{fig:2}d, lower panel) when the percolating stable cluster falls apart, as demonstrated by a peak in the corresponding $LC^{2nd}$ curve (Fig.~\\ref{fig:3}c, lower panel). Finally, around $r=0.9$ the adoption network becomes fragmented and no global diffusion takes place. We repeat the same calculations for another service and find qualitatively the same picture, but with the crossover regime shifted towards larger $r$ values due to the different parametrisation of the model process. Note that another possible reason for the slow adoption could be the time users wait between their threshold has been reached and actual adoption. We test for the effect of this potential scenario on the empirical curves but find no qualitative change in the dynamics (see SI).\n\n\nWe can use these calculations to estimate the only unknown parameter (the fraction $r$ of immune nodes in Skype) by matching the size of the largest component ($LC_{Net}$) between real and model adoption networks at time $T$. Empirically, this value is the relative size corresponding to the last point on the right-hand side of the distribution for $2011$ (Fig.~\\ref{fig:3}a, main panel). The corresponding value in the model is $r = 0.73$ (dashed lines in Fig.~\\ref{fig:3}c; also Fig.~\\ref{fig:2}a and b), suggesting that the real adoption process lies in the crossover regime. The other analysed service turns out to lie right of the crossover regime, which explains its large innovator adoption rate and reduced size of stable and vulnerable adoption clusters (see SI).\n\nTo test the validity of the prediction of $r$ we perform three different calculations. First we measure the maximum relative growth rate of cumulative adoption and find a good match between model and data (Skype s3 and Model Skype s3 in Fig.~\\ref{fig:1}a). In other words, the model correctly estimates the speed of the adoption process. Second, we measure the distribution $P(d)$ of depths of induced vulnerable trees (Fig.~\\ref{fig:3}d). Finally, in order to verify earlier theoretical suggestions \\cite{Singh2013Thresholdlimited}, we look at the correlation $\\langle s_v \\rangle (k)$ between the degree of innovators and the average size of vulnerable trees induced by them (Fig.~\\ref{fig:3}e). We perform the last two measurements on the real data and in the model process for $r=0.6$ and $0.9$, as  well as for the predicted value $r=0.73$. In the case of $\\langle s_v \\rangle (k)$, we find a strong positive correlation in the data, explained partially by degree heterogeneities in the underlying social network, but surprisingly well emulated by the model. More importantly, although both quantities appear to scale with $r$, measures for the estimated $r$ value fit the empirical data remarkably well, confirming our earlier validation based on the matching of relative component sizes (for further discussion see SI).\n\n\\section*{Discussion}\n\nAlthough some products and innovations diffusing in society may cover a large fraction of the population, their spreading tends to follow slow cascading patterns, the dynamics of which have been modelled before by simple diffusion models like that of Bass \\cite{Bass1969}. However, this approach neglects threshold mechanisms that arguably drive the decision making of single individuals. On the other hand, threshold models study the conditions for cascades in global diffusion but do not address their temporal evolution, which is clearly a relevant factor in real-world adoption processes. These models are commonly used to predict rapid cascading patterns of adoption, which is a more realistic scenario for the spreading of information, opinions, or behavioural patterns but are not observed in the case of product or innovation diffusion where adoption requires additional efforts, e.g., free or paid registration. Here we provide a solution for this conundrum by analysing and modelling the worldwide spread of an online service in the techno-social communication network of Skype. Beyond the novel empirical evidence about heterogeneous adoption thresholds and non-linear dynamics of the adoption process, we identify two additional components necessary to introduce in the modelling of product adoption, namely: (a) a constant flow of innovators, which may induce rapid adoption cascades even if the system is initially out of the cascading regime; and (b) a fraction of immune nodes that forces the system into a quenched state where adoption slows down. These features are responsible for a critical structure of empirical adoption components that radically differs from previous theoretical expectations. We incorporate these mechanisms into a threshold model controlled by the rate of innovators and the fraction of immune nodes. The model is able to reproduce several pathways ranging from cascading behaviour to more realistic dynamics of innovation adoption. By constraining the model with empirically determined parameters, we provide an estimate for the real fraction of susceptible agents in the social network of Skype, and validate this prediction through correlated structural features matching empirical observations.\n\nOur aim in this study was to provide empirical observations as well as methods and tools to model the dynamics of social contagion phenomena with the hope it will foster thoughts for future research. One possible direction would be the observation of the reported structure and evolution of the global adoption cluster in other systems similar to the ones studied in \\cite{BorgeHolthoefer2011Structural,Dow2013Anatomy,Gruhl2004Information,Goel2012Structure,BorgeHolthoefer2013Cascading,Bakshy11}. Other promising directions could be the consideration of homophilic or assortative structural correlations, the evolving nature of the underpinning social structure as studied in \\cite{Karsai2014Complex}, interpersonal influence, or the effects of leader-follower mechanisms on the social contagion process. Finally, we hope that the reported results may improve efficiency in the strategies of enhancing the diffusion of products and innovations, by shifting attention from the creation of short-lived perturbations to the sustenance of external input.\n\n\\subsubsection*{Competing interest statement}\nThe authors have no competing interests.\n\n\\subsubsection*{Authors' contributions statement}\nM.K., G.I., R.K., K.K, and J.K designed the research and participated in writing the manuscript. R.K. and M.K. analysed the empirical data, G.I. made the analytical calculations, and M.K. and G.I. performed the numerical simulations.\n\n\\subsubsection*{Acknowledgements}\nThe authors gratefully acknowledge the support of M. Dumas, A. Saabas, and A. Dumitras from STACC and Microsoft/Skype Labs as well as constructive comments by J. Saram\\\"aki and T. N{\\\"a}si.\n\n\\subsubsection*{Funding statement}\nG.I. acknowledges the Academy of Finland, and J.K. the CIMPLEX FET Open H2020 EU project for support. This research was partly funded by Microsoft/Skype Labs.\n\n\\section*{Material and Methods}\n\n\\section*{Data description}\n\nWe use a static representation of the Skype social network aggregated over 99 months between September 2003 and November 2011. We follow the adoption of the ``buy credit'' paid service for $89$ months starting from 2004, and the paid service ``subscription'' for $42$ months starting from 2008 (for further details about the network and service see SI). By considering the online social structure and adoption times, we identify users as innovator, vulnerable, or stable nodes based on the number $\\Phi_k$ of adopting neighbours at the time of exposure. Thresholds are calculated as $\\phi=\\Phi_k/k$ for users with $k$ contacts. The adoption network is constructed by considering confirmed social links between users who adopted the service earlier than $t$. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. Note that for the categorisation of nodes we use only the adoption time and the state of their peers, and thus real categories may differ slightly. For example, an innovator may appear as a vulnerable or stable node, even if its decision was not driven by social influence but some of its peers adopted earlier. To consider this bias we measure effective rates of adoption for the model process as well, just like for the empirical case (Fig.\\ref{fig:1}) and section S3.\n\n\\section*{Maximum relative growth rate}\n\nThis measure is obtained by taking the maximum of the yearly adoption rate (yearly count of adoptions) normalised by the final observed adoption number of a given service. It characterises the maximum speed of adoption a service experienced during its history and takes values between 0 (no cascade) and 1 (instantaneous cascade). We repeat this measurement for the estimated number of registered users of Facebook, Twitter, and LinkedIn \\cite{SocialMedia}, as well as for the number of active users of Skype and three paid Skype services. Adoption rates for Facebook, Twitter, and LinkedIn correspond to the period between 2006 and 2012, and for Skype and its services to the interval from release date until 2011.\n\n\\section*{Empirical parameter estimation}\n\nWe use the Skype data to directly determine all model parameters, apart from the fraction $r$ of immune nodes. To best approximate the degree distribution of the real network, after testing different candidate functions (see SI) we select a lognormal function $P(k) = e^{ -(\\ln k-\\mu_D)^2 / (2\\sigma_D^2) } / (k\\sigma_D\\sqrt{2\\pi})$ with parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$ and minimum degree ${k_{\\mathrm{min}}} = 1$, leading to the average degree $z = 8.56$. To account for finite-size effects in the model results for low $N$ (Fig.~\\ref{fig:2}), we decrease $\\mu_D$ slightly to obtain the same value of $z$ as in the real network.\n\nThe threshold distribution of each degree group collapses to a master curve after normalisation by using the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$. This master curve can be well approximated by the lognormal distribution $P(\\phi) = e^{ -(\\ln \\phi-\\mu_T)^2 / (2\\sigma_T^2) } / (\\phi\\sigma_T\\sqrt{2\\pi})$, with parameters $\\mu_T=-2$ and $\\sigma_T=1$ as determined by the empirical average threshold $w = 0.19$ and standard deviation $0.233$ (for further details see SI). We estimate a rate of innovators $p_n = 0.00019$ by fitting a constant function to $R_i(t)$ for $t > 2\\tau$ (Fig.~\\ref{fig:1}f). The fit to ${p_n}$ also matches the time scale of a Monte Carlo iteration in the model to 1 month. Model results (Fig.~\\ref{fig:3}d and e) are calculated with $r = 0.73$ and $p_n = 0.00019$. Simulation results in Fig.~\\ref{fig:3}c (d and e) are averaged over $100$ configuration-model networks of size $N=10^5$ ($10^6$) after $T=89$ iterations, matching the length of the observation period in Skype.\n\n\\section*{Model description}\n\nWe characterise the static social network by the extended distribution ${P({{\\mathbf{k}}})}$, where ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$. Non-immune, susceptible nodes with property vector ${\\mathbf{k}}$ adopt spontaneously at a constant rate ${p_n}$, else they adopt only if a fraction $\\phi_c$ of their $k$ neighbours have adopted before. These rules are condensed in the probability ${F_{{\\mathbf{k}}, m}} dt$ that a node will adopt in a small time interval $dt$, given that $m$ of its neighbours are already adopters,\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:thresRule}\n{F_{{\\mathbf{k}}, m}} =\n\\begin{cases}\n{p_r} & \\text{if} \\quad m < k \\phi_c \\\\\n1 & \\text{if} \\quad m \\geq k \\phi_c\n\\end{cases}, \\quad \\forall m \\; \\text{and} \\; k, c \\neq 0,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{F_{{\\mathbf{k}},m}}=\\begin{cases}{p_{r}}&amp;\\text{if}\\quad m&lt;k\\phi_{c}\\\\&#10;1&amp;\\text{if}\\quad m\\geq k\\phi_{c}\\end{cases},\\quad\\forall m\\;\\text{and}\\;k,c%&#10;\\neq 0,\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><msub><mi>p</mi><mi>r</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo mathsize=\"70%\" mathvariant=\"italic\" separator=\"true\" stretchy=\"false\"> </mo><mi>m</mi></mrow><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>1</mn></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo mathsize=\"70%\" mathvariant=\"italic\" separator=\"true\" stretchy=\"false\"> </mo><mi>m</mi></mrow><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></mtd></mtr></mtable></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mo>∀</mo><mrow><mpadded width=\"+2.8pt\"><mi>m</mi></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><mi>k</mi></mrow></mrow></mrow></mrow><mo>,</mo><mrow><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere ${\\beta_s}(t) = \\frac{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}}(t)}{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {s_{{\\mathbf{k}}, m}}(t)}$. To reduce the dimensionality of Eq.~(\\ref{eq:AMEsThres}) we consider the ansatz ${s_{{\\mathbf{k}}, m}} = {B_{k, m}} (\\nu) e^{-{p_r} t}$ for $m < k\\phi_c$, leading to the condition $\\dot{\\nu} = {\\beta_s} (1 - \\nu)$. With $\\rho = 1 - {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {s_{{\\mathbf{k}}, m}}$ and some algebra, this condition is reduced to Eq.~(\\ref{eq:reducedAMEs}) (see SI).\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{Centola2010Spread}\nCentola, D.\n\\newblock{The spread of behavior in an online social network experiment}.\n\\newblock {\\em Science} {\\bf 329}, 1194--1197 (2010).\n\n\\bibitem{McPherson2001}\nMcPherson, M., Smith-Lovin, L. \\& Cook, JM.\n\\newblock{Birds of a Feather: Homophily in Social Networks}.\n\\newblock {\\em Ann. Rev. Sociol.} {\\bf 27}, 415-444 (2001).\n\n\\bibitem{Toole2011Modeling}\nToole. J. L., Cha. M. \\& Gonz{\\'a}lez, M. C.\n\\newblock{Modeling the adoption of innovations in the presence of geographic and media influences}.\n\\newblock {\\em PLoS ONE} {\\bf 7}, e29528 (2012).\n\n\\bibitem{RevModPhys.81.591}\nCastellano, C., Fortunato, S. \\& Loreto, V.\n\\newblock{Statistical physics of social dynamics}.\n\\newblock {\\em Rev. Mod. Phys.} {\\bf 81}, 591--646 (2009).\n\n\\bibitem{Rogers2003Diffusion}\nRogers, E. M.\n\\newblock {\\textit{Diffusion of Innovations}}.\n\\newblock (Simon \\& Schuster), 5th edition (2003).\n\n\\bibitem{Granovetter1978Threshold}\nGranovetter, M.\n\\newblock{Threshold models of collective behavior}.\n\\newblock {\\em Am. J. Sociol.} {\\bf 83}, 1420--1443 (1978).\n\n\\bibitem{schelling1969models}\nSchelling, T. C.\n\\newblock{Models of segregation}.\n\\newblock {\\em Am. Econ. Rev.} {\\bf 59}, 488--493 (1969).\n\n\\bibitem{Axelrod1997Dissemination}\nAxelrod, R.\n\\newblock{The dissemination of culture}.\n\\newblock {\\em J. Conflict Resolut.} {\\bf 41}, 203--226 (1997).\n\n\\bibitem{Watts2002Simple}\nWatts, D. J.\n\\newblock{A simple model of global cascades on random networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 99}, 5766--5771 (2002).\n\n\\bibitem{Handjani1997Survival}\nHandjani, S.\n\\newblock{Survival of threshold contact processes}.\n\\newblock {\\em J. Theo. Probab.} {\\bf 10}, 737--746 (1997).\n\n\\bibitem{valente-thresholds-1996}\nValente, T. W.\n\\newblock{Social network thresholds in the diffusion of innovations}.\n\\newblock {\\em Social Networks} {\\bf 18}, 69--89 (1996).\n\n\\bibitem{Watts2007Influentials}\nWatts, D. J. \\& Dodds, P. S.\n\\newblock{Influentials, networks, and public opinion formation}.\n\\newblock {\\em J. Consum. Res.} {\\bf 34}, 441--458 (2007).\n\n\\bibitem{Melnik2013Multistage}\nMelnik, S., Ward, J. A., Gleeson, J. P. \\& Porter, M. A.\n\\newblock{Multi-stage complex contagions}.\n\\newblock {\\em Chaos} {\\bf 23}, 013124 (2013).\n\n\\bibitem{Gomez2010Modeling}\nG\\'{o}mez, V., Kappen, H. J., \\& Kaltenbrunner, A.\n\\newblock{Modeling the structure and evolution of discussion cascades}.\n\\newblock (HT'11, ACM, New York, NY, USA), pp. 181--190 (2010).\n\n\\bibitem{Centola2007Complex}\nCentola, D. \\& Macy, M.\n\\newblock{Complex contagions and the weakness of long ties}.\n\\newblock {\\em Am. J. Sociol.} {\\bf 113}, 702--734 (2007).\n\n\\bibitem{Barrat2008Dynamical}\nBarrat A., Barth\\'{e}lemy, M. \\&  Vespignani, V.\n\\newblock {\\textit{Dynamical Processes on Complex Networks}}.\n\\newblock (Cambridge University Press, 2008).\n\n\\bibitem{Bass1969}\nBass, F. M.\n\\newblock{A new product growth for model consumer durables}.\n\\newblock {\\em Manage. Sci.} {\\bf 15}, 215--227 (1969).\n\n\\bibitem{Aral2009}\nAral, S., Muchnika, L., Sundararajana, A.\n\\newblock{Distinguishing influence-based contagion from homophily-driven diffusion in dynamic networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 106}, 21544--21549 (2009).\n\n\\bibitem{Shalizi2011}\nShalizi, C. R., Thomas, A. C.\n\\newblock{Homophily and Contagion Are Generically Confounded in Observational Social Network Studies}.\n\\newblock {\\em Sociol Methods Res.} {\\bf 40}, 211--239 (2011).\n\n\\bibitem{Holt06}\nHolt, C. A.\n\\newblock {\\em {Markets, Games,  Strategic Behavior}}.\n\\newblock (Addison Wesley, 2006).\n\n\\bibitem{bikhchandani-hirshleifer-welch-92}\nBikhchandani, S., Hirshleifer D. \\& Welch, I.\n\\newblock{A theory of fads, fashion, custom, and cultural change as informational cascades}.\n\\newblock {\\em J. Polit. Econ.} {\\bf 100}, 992--1026 (1992).\n\n\\bibitem{Karsai2014Complex}\nKarsai, M., I\\~{n}iguez, G., Kaski, K. \\& Kert\\'{e}sz, J.\n\\newblock{Complex contagion process in spreading of online innovation}.\n\\newblock {\\em J. Roy. Soc. Interface} {\\bf 11}, 20140694 (2014).\n\n\\bibitem{Ruan2015}\nRuan, Z., I\\~{n}iguez, G., Karsai, M. \\& Kert\\'{e}sz, J.\n\\newblock{Kinetics of social contagion}.\n\\newblock {\\em Phys. Rev. Lett.} {\\bf 115}, 218702 (2015).\n\n\\bibitem{GonzalezBailon2011Dynamics}\nGonz\\'{a}lez-Bail\\'{o}n, S., Borge-Holthoefer, J., Rivero, A. \\& Moreno, Y.\n\\newblock{The dynamics of protest recruitment through an online network}.\n\\newblock {\\em Sci. Rep.} {\\bf 1}, 197 (2011).\n\n\\bibitem{BorgeHolthoefer2011Structural}\nBorge-Holthoefer, J., et. al.\n\\newblock{Structural and dynamical patterns on online social networks: The Spanish May 15th movement as a case study}.\n\\newblock {\\em PLoS ONE} {\\bf 6}, e23883 (2011).\n\n\\bibitem{EllisInformation}\nEllis, C. J. \\& Fender, J.\n\\newblock{Information cascades and revolutionary regime transitions}.\n\\newblock {\\em Econ. J.} {\\bf 121}, 763--792 (2011).\n\n\\bibitem{Dow2013Anatomy}\nDow, P. A., Adamic, L. A. \\& Friggeri, A.\n\\newblock{The anatomy of large Facebook cascades}.\n\\newblock (ICWSM, AAAI, Boston, MA, USA), pp. 145--154 (2013).\n\n\\bibitem{Gruhl2004Information}\nGruhl, D., Guha, R., Nowell, D. L. \\& Tomkins, A.\n\\newblock{Information diffusion through blogspace}.\n\\newblock (WWW '04, ACM, New York, NY, USA), pp. 491--501 (2004).\n\n\\bibitem{Banos2013Role}\nBa\\~{n}os, R. A., Borge-Holthoefer, J. \\& Moreno, Y.\n\\newblock{The role of hidden influentials in the diffusion of online information cascades}.\n\\newblock {\\em EPJ Data Sci.} {\\bf 2}, 6 (2013).\n\n\\bibitem{Hale2013Regime}\nHale, H. E.\n\\newblock{Regime change cascades: What we have learned from the 1848 revolutions to the 2011 Arab uprisings}.\n\\newblock {\\em Annu. Rev. Polit. Sci.} {\\bf 16}, 331--353 (2013).\n\n\\bibitem{Leskovec2005Patterns}\nLeskovec, J., Singh, A. \\& Kleinberg, J.\n\\newblock{Patterns of influence in a recommendation network}.\n\\newblock (PAKDD '06, Singapore), pp. 380--389 (2006).\n\n\\bibitem{Leskovec2007Dynamics}\nLeskovec, J., Adamic, L. A. \\& Huberman, B. A.\n\\newblock{The dynamics of viral marketing}.\n\\newblock (TWEB, ACM, New York, NY, USA), vol. 1, pp. 5 (2007).\n\n\\bibitem{Goel2012Structure}\nGoel, S., Watts, D. J. \\& Goldstein, D. G.\n\\newblock{The structure of online diffusion networks}.\n\\newblock (EC '12, ACM, New York, NY, USA), pp. 623--638 (2012).\n\n\\bibitem{Fowler2009Cooperative}\nFowler, J. H. \\& Christakis, N. A.\n\\newblock{Cooperative behavior cascades in human social networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 107}, 5334--5338 (2009).\n\n\\bibitem{BorgeHolthoefer2013Cascading}\nBorge-Holthoefer, J., Ba\\~{n}os, R. A., Gonz\\'{a}lez-Bail\\'{o}n, S. \\& Moreno, Y.\n\\newblock{Cascading behaviour in complex socio-technical networks}.\n\\newblock {\\em J. Complex Net.} {\\bf 1}, 1--22 (2013).\n\n\\bibitem{Hackett2013Cascades}\nHackett, A. \\& Gleeson, J. P.\n\\newblock{Cascades on clique-based graphs}.\n\\newblock {\\em Phys. Rev. E} {\\bf 87}, 062801 (2013).\n\n\\bibitem{Gleeson2008Cascades}\nGleeson, J. P.\n\\newblock{Cascades on correlated and modular random networks}.\n\\newblock {\\em Phys. Rev. E} {\\bf 77}, 046117 (2008).\n\n\\bibitem{Brummitt2011}\nBrummitt, C. D., D'Souza, R. M. \\& E. A. Leicht,\n\\newblock{Suppressing cascades of load in interdependent networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 109}, E680--E689 (2011).\n\n\\bibitem{GhoshCascadesArxiv2010}\nGhosh, R. \\&Lerman, K.\n\\newblock{A framework for quantitative analysis of cascades on networks}, WSDM '11.\n\\newblock (WSDM '11, ACM, New York, NY, USA), pp. 665--674 (2010).\n\n\\bibitem{Hurd2013Watts}\nHurd, T. R. \\& Gleeson, J. P.\n\\newblock{On Watts' cascade model with random link weights}.\n\\newblock {\\em J. Complex Net.} {\\bf 1}, 25-43 (2013).\n\n\\bibitem{Singh2013Thresholdlimited}\nSingh, P., Sreenivasan, S., Szymanski, B. K. \\& Korniss, Gy.\n\\newblock{Threshold-limited spreading in social networks with multiple initiators}.\n\\newblock {\\em Sci. Rep.} {\\bf 3}, 2330 (2013).\n\n\\bibitem{Gleeson2007Seed}\nGleeson, J. P.  \\& Cahalane, D. J.\n\\newblock{Seed size strongly affects cascades on random networks}.\n\\newblock {\\em Phys. Rev. E} {\\bf 75}, 050101(R) (2007).\n\n\\bibitem{SocialMedia}\nWhite, D. S.\n\\newblock {Social Media Growth 2006 to 2012} (2013).\n\\newblock Date of access: 2015.01.29.\n\n\\bibitem{SkypeIPO}\nMorrissey, R. C., Goldman, N. D. \\& Kennedy, K. P.\n\\newblock {Skype S.A. United States Security Registration Statement, Amendment 3, Reg.No. 333-168646} (2011).\n\\newblock Date of access: 2014.10.14.\n\n\\bibitem{porter2014}\nPorter, M. A. \\& Gleeson, J. P. \n\\newblock{Dynamical systems on networks: A tutorial}.\n\\newblock{Eprint arXiv 1403.7663 (2014).}\n\n\\bibitem{gleeson2013binary}\nGleeson, J. P.\n\\newblock{Binary-state dynamics on complex networks: Pair approximation and beyond}.\n\\newblock {\\em Phys. Rev. X} {\\bf 3}, 021004 (2013).\n\n\\bibitem{gleeson2011high}\nGleeson, J. P.\n\\newblock{High-accuracy approximation of binary-state dynamics on networks}.\n\\newblock {\\em Phys. Rev. Lett.} {\\bf 107}, 068701 (2011).\n\n\\bibitem{Bakshy11}\nBakshy, E., Hofman, J. M., Mason, W. A. \\& Watts, D. J.\n\\newblock{Everyone's an influencer: Quantifying influence on Twitter}.\n\\newblock (WSDM '11, ACM, New York, NY, USA), pp. 65--74 (2011).\n\n\\end{thebibliography}\n\n\n\\newpage\n\n\\section*{\\LARGE{Supplementary Information}}\n\n\n\n\n\n\\section{Detailed data description}\n\\label{sec:ddescr}\n\nThis study has been conducted on a dataset of the social network of Skype. The centrepiece of the dataset is the \\emph{contact network}, where nodes represent users and edges between pairs of users exist if they are in each other's contact lists. A user's contact list is composed of \\emph{friends}. If user $u$ wants to add another user $v$ to his/her contact list, $u$ sends $v$ a contact request, and the edge is established at the moment $v$ approves the request (or not, if the contact request is rejected). Each edge is labelled with a time stamp indicating the moment the contact request was approved. As the underpinning social structure we consider the static representation of the Skype social network, aggregated for $99$ months between September 2003 and November 2011. The largest connected component of this structure includes roughly 510 million users and 4.4 billion edges.\n\nAs the chosen service evolving on the Skype network, we follow how users purchase ``credits'' for calling phones. For each user, the dataset includes the date when he/she first adopted the paid product ``buy credit'' (first credit purchase, for all purposes). We select this service since its lifetime of $89$ months is considerably long (it was introduced in 2004), and it can be adopted by registered Skype users only. This way the aggregated Skype network provides a complete description of the mediating social structure, which allows us to calculate the correct degree and adoption threshold for all individuals. To make additional observations and to further test our model, we perform calculations on a second paid service called ``subscription'', which was introduced in April 2008, lasts for over $42$ months, and can also be adopted by registered Skype users only. Results regarding this service are presented in Section \\ref{sec:addserv}.\n\nBy considering the online social structure and the adoption times we identify users as innovator, vulnerable, or stable nodes based on the number $\\Phi_k$ of adopting neighbours at the time of exposure. Thresholds are calculated as $\\phi=\\Phi_k/k$ for users with $k$ contacts. The adoption network is constructed by considering confirmed social links between users who adopted the service earlier than the time of observation $t$. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. Note that for the categorization of nodes we use only the adoption time and the state of their peers, and thus `real' categories may differ slightly. For example, an innovator may appear as a vulnerable or stable node, even if its decision was not driven by social influence but some of its peers adopted earlier. To consider this bias we also measure `effective' rates of adoption for the model process, just like for the empirical case (Fig.1, main text) and section S3.\n\nThe dataset does not include identity information. All usernames are anonymized and there is no way of inferring a user's identity solely from the profile. The dataset does not contain any information about interpersonal interactions, apart from the contact list.\n\n\n\\section{Empirical determination of model parameters}\n\\label{sec:pars}\n\nParameters in the model are the rate of innovators $p_{n}$, the degree distribution $P(k)$, the threshold distribution $P(\\phi)$, and the fraction of immune nodes $r$. Other than $r$, all of them can be estimated from the data as follows.\n\n\\subsection{Rate of innovators}\n\nAs discussed in the main text, the rate of spontaneous adoption saturates approximately to a constant value after an initial transition period, which allows us to determine the rate of innovators by fitting a constant function on the curve after time $2\\tau$. We estimate this rate to be $p_{n} = 0.00019$, as demonstrated in Fig.~S\\ref{fig:NullModelRate}a where the dashed line assigns the fitted constant function.\n\n\\subsection{Degree distribution}\n\\label{sec:degDistrFit}\n\nDegrees in the aggregated Skype network are broadly distributed with a fat tail corresponding to strong degree heterogeneities. To characterize this distribution analytically we select two candidate distribution functions. The first is a shifted power-law distribution function of the form,\n\n", "itemtype": "equation", "pos": 43548, "prevtext": "\nwith $F_{(k,0),m} = 0$ $\\forall k, m$ and $F_{(0,c),0} = {p_r}$ $\\forall c \\neq 0$ (for immune and isolated nodes, respectively). The dynamics of adoption is well described by an AME for the fraction ${s_{{\\mathbf{k}}, m}}(t)$ of ${\\mathbf{k}}$-nodes that are susceptible at time $t$ and have $m=0,\\ldots,k$ adopting neighbours~\\cite{porter2014,gleeson2013binary,gleeson2011high},\n\n", "index": 11, "text": "\\begin{equation}\n\\label{eq:AMEsThres}\n{\\dot{s}_{{\\mathbf{k}}, m}} = -{F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}} -{\\beta_s} (k - m) {s_{{\\mathbf{k}}, m}} + {\\beta_s} (k - m + 1) {s_{{\\mathbf{k}}, m-1}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\dot{s}_{{\\mathbf{k}},m}}=-{F_{{\\mathbf{k}},m}}{s_{{\\mathbf{k}},m}}-{\\beta_{s%&#10;}}(k-m){s_{{\\mathbf{k}},m}}+{\\beta_{s}}(k-m+1){s_{{\\mathbf{k}},m-1}},\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>s</mi><mo>˙</mo></mover><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>-</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>+</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere $k$ denotes the degree, $\\gamma$ is the power-law exponent scaling the tail of the distribution, and $k_{min}$ is the minimum degree (in our case 1). $C$ is a constant scaling the shift of the distribution, which can be determined as $C=z(\\gamma-2)-k_{min}(\\gamma-1)$ since we know the average degree $z = 8.56$ of the empirical network. This way our only free parameter during the fit is the degree exponent $\\gamma$. After fitting this function by using the non-linear least-square method, we obtain a relatively good match with the empirical distribution (Fig.~S\\ref{fig:degdistr}a) for exponent $\\gamma=3.61$.\n\n\\begin{figure}[t] \\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{DegreeDistr_ww_fit_shpwl}\n}\n\\subfigure[]{\n  \\includegraphics[width=76mm]{DegreeDistr_ww_fit_lognorm}\n} \\\\\n\\caption{\\small{\\bf Fitted degree distribution.} {\\bf (a)} Empirical degree distribution $P(k)$ fitted with a shifted power-law distribution function [Eq.~(\\ref{eq:shSF})] with parameters described in the text. {\\bf (b)} $P(k)$ fitted by a lognormal distribution function [Eq.~(\\ref{eq:logn})] with parameters determined in the text. Grey symbols are the degree distribution, blue symbols the log-binned distribution, and solid lines the fitted analytical distribution.}\n\\label{fig:degdistr}\n\\end{figure}\n\nOur second candidate function is a lognormal distribution function of the form,\n\n", "itemtype": "equation", "pos": 58005, "prevtext": "\nwhere ${\\beta_s}(t) = \\frac{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}}(t)}{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {s_{{\\mathbf{k}}, m}}(t)}$. To reduce the dimensionality of Eq.~(\\ref{eq:AMEsThres}) we consider the ansatz ${s_{{\\mathbf{k}}, m}} = {B_{k, m}} (\\nu) e^{-{p_r} t}$ for $m < k\\phi_c$, leading to the condition $\\dot{\\nu} = {\\beta_s} (1 - \\nu)$. With $\\rho = 1 - {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {s_{{\\mathbf{k}}, m}}$ and some algebra, this condition is reduced to Eq.~(\\ref{eq:reducedAMEs}) (see SI).\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{Centola2010Spread}\nCentola, D.\n\\newblock{The spread of behavior in an online social network experiment}.\n\\newblock {\\em Science} {\\bf 329}, 1194--1197 (2010).\n\n\\bibitem{McPherson2001}\nMcPherson, M., Smith-Lovin, L. \\& Cook, JM.\n\\newblock{Birds of a Feather: Homophily in Social Networks}.\n\\newblock {\\em Ann. Rev. Sociol.} {\\bf 27}, 415-444 (2001).\n\n\\bibitem{Toole2011Modeling}\nToole. J. L., Cha. M. \\& Gonz{\\'a}lez, M. C.\n\\newblock{Modeling the adoption of innovations in the presence of geographic and media influences}.\n\\newblock {\\em PLoS ONE} {\\bf 7}, e29528 (2012).\n\n\\bibitem{RevModPhys.81.591}\nCastellano, C., Fortunato, S. \\& Loreto, V.\n\\newblock{Statistical physics of social dynamics}.\n\\newblock {\\em Rev. Mod. Phys.} {\\bf 81}, 591--646 (2009).\n\n\\bibitem{Rogers2003Diffusion}\nRogers, E. M.\n\\newblock {\\textit{Diffusion of Innovations}}.\n\\newblock (Simon \\& Schuster), 5th edition (2003).\n\n\\bibitem{Granovetter1978Threshold}\nGranovetter, M.\n\\newblock{Threshold models of collective behavior}.\n\\newblock {\\em Am. J. Sociol.} {\\bf 83}, 1420--1443 (1978).\n\n\\bibitem{schelling1969models}\nSchelling, T. C.\n\\newblock{Models of segregation}.\n\\newblock {\\em Am. Econ. Rev.} {\\bf 59}, 488--493 (1969).\n\n\\bibitem{Axelrod1997Dissemination}\nAxelrod, R.\n\\newblock{The dissemination of culture}.\n\\newblock {\\em J. Conflict Resolut.} {\\bf 41}, 203--226 (1997).\n\n\\bibitem{Watts2002Simple}\nWatts, D. J.\n\\newblock{A simple model of global cascades on random networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 99}, 5766--5771 (2002).\n\n\\bibitem{Handjani1997Survival}\nHandjani, S.\n\\newblock{Survival of threshold contact processes}.\n\\newblock {\\em J. Theo. Probab.} {\\bf 10}, 737--746 (1997).\n\n\\bibitem{valente-thresholds-1996}\nValente, T. W.\n\\newblock{Social network thresholds in the diffusion of innovations}.\n\\newblock {\\em Social Networks} {\\bf 18}, 69--89 (1996).\n\n\\bibitem{Watts2007Influentials}\nWatts, D. J. \\& Dodds, P. S.\n\\newblock{Influentials, networks, and public opinion formation}.\n\\newblock {\\em J. Consum. Res.} {\\bf 34}, 441--458 (2007).\n\n\\bibitem{Melnik2013Multistage}\nMelnik, S., Ward, J. A., Gleeson, J. P. \\& Porter, M. A.\n\\newblock{Multi-stage complex contagions}.\n\\newblock {\\em Chaos} {\\bf 23}, 013124 (2013).\n\n\\bibitem{Gomez2010Modeling}\nG\\'{o}mez, V., Kappen, H. J., \\& Kaltenbrunner, A.\n\\newblock{Modeling the structure and evolution of discussion cascades}.\n\\newblock (HT'11, ACM, New York, NY, USA), pp. 181--190 (2010).\n\n\\bibitem{Centola2007Complex}\nCentola, D. \\& Macy, M.\n\\newblock{Complex contagions and the weakness of long ties}.\n\\newblock {\\em Am. J. Sociol.} {\\bf 113}, 702--734 (2007).\n\n\\bibitem{Barrat2008Dynamical}\nBarrat A., Barth\\'{e}lemy, M. \\&  Vespignani, V.\n\\newblock {\\textit{Dynamical Processes on Complex Networks}}.\n\\newblock (Cambridge University Press, 2008).\n\n\\bibitem{Bass1969}\nBass, F. M.\n\\newblock{A new product growth for model consumer durables}.\n\\newblock {\\em Manage. Sci.} {\\bf 15}, 215--227 (1969).\n\n\\bibitem{Aral2009}\nAral, S., Muchnika, L., Sundararajana, A.\n\\newblock{Distinguishing influence-based contagion from homophily-driven diffusion in dynamic networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 106}, 21544--21549 (2009).\n\n\\bibitem{Shalizi2011}\nShalizi, C. R., Thomas, A. C.\n\\newblock{Homophily and Contagion Are Generically Confounded in Observational Social Network Studies}.\n\\newblock {\\em Sociol Methods Res.} {\\bf 40}, 211--239 (2011).\n\n\\bibitem{Holt06}\nHolt, C. A.\n\\newblock {\\em {Markets, Games,  Strategic Behavior}}.\n\\newblock (Addison Wesley, 2006).\n\n\\bibitem{bikhchandani-hirshleifer-welch-92}\nBikhchandani, S., Hirshleifer D. \\& Welch, I.\n\\newblock{A theory of fads, fashion, custom, and cultural change as informational cascades}.\n\\newblock {\\em J. Polit. Econ.} {\\bf 100}, 992--1026 (1992).\n\n\\bibitem{Karsai2014Complex}\nKarsai, M., I\\~{n}iguez, G., Kaski, K. \\& Kert\\'{e}sz, J.\n\\newblock{Complex contagion process in spreading of online innovation}.\n\\newblock {\\em J. Roy. Soc. Interface} {\\bf 11}, 20140694 (2014).\n\n\\bibitem{Ruan2015}\nRuan, Z., I\\~{n}iguez, G., Karsai, M. \\& Kert\\'{e}sz, J.\n\\newblock{Kinetics of social contagion}.\n\\newblock {\\em Phys. Rev. Lett.} {\\bf 115}, 218702 (2015).\n\n\\bibitem{GonzalezBailon2011Dynamics}\nGonz\\'{a}lez-Bail\\'{o}n, S., Borge-Holthoefer, J., Rivero, A. \\& Moreno, Y.\n\\newblock{The dynamics of protest recruitment through an online network}.\n\\newblock {\\em Sci. Rep.} {\\bf 1}, 197 (2011).\n\n\\bibitem{BorgeHolthoefer2011Structural}\nBorge-Holthoefer, J., et. al.\n\\newblock{Structural and dynamical patterns on online social networks: The Spanish May 15th movement as a case study}.\n\\newblock {\\em PLoS ONE} {\\bf 6}, e23883 (2011).\n\n\\bibitem{EllisInformation}\nEllis, C. J. \\& Fender, J.\n\\newblock{Information cascades and revolutionary regime transitions}.\n\\newblock {\\em Econ. J.} {\\bf 121}, 763--792 (2011).\n\n\\bibitem{Dow2013Anatomy}\nDow, P. A., Adamic, L. A. \\& Friggeri, A.\n\\newblock{The anatomy of large Facebook cascades}.\n\\newblock (ICWSM, AAAI, Boston, MA, USA), pp. 145--154 (2013).\n\n\\bibitem{Gruhl2004Information}\nGruhl, D., Guha, R., Nowell, D. L. \\& Tomkins, A.\n\\newblock{Information diffusion through blogspace}.\n\\newblock (WWW '04, ACM, New York, NY, USA), pp. 491--501 (2004).\n\n\\bibitem{Banos2013Role}\nBa\\~{n}os, R. A., Borge-Holthoefer, J. \\& Moreno, Y.\n\\newblock{The role of hidden influentials in the diffusion of online information cascades}.\n\\newblock {\\em EPJ Data Sci.} {\\bf 2}, 6 (2013).\n\n\\bibitem{Hale2013Regime}\nHale, H. E.\n\\newblock{Regime change cascades: What we have learned from the 1848 revolutions to the 2011 Arab uprisings}.\n\\newblock {\\em Annu. Rev. Polit. Sci.} {\\bf 16}, 331--353 (2013).\n\n\\bibitem{Leskovec2005Patterns}\nLeskovec, J., Singh, A. \\& Kleinberg, J.\n\\newblock{Patterns of influence in a recommendation network}.\n\\newblock (PAKDD '06, Singapore), pp. 380--389 (2006).\n\n\\bibitem{Leskovec2007Dynamics}\nLeskovec, J., Adamic, L. A. \\& Huberman, B. A.\n\\newblock{The dynamics of viral marketing}.\n\\newblock (TWEB, ACM, New York, NY, USA), vol. 1, pp. 5 (2007).\n\n\\bibitem{Goel2012Structure}\nGoel, S., Watts, D. J. \\& Goldstein, D. G.\n\\newblock{The structure of online diffusion networks}.\n\\newblock (EC '12, ACM, New York, NY, USA), pp. 623--638 (2012).\n\n\\bibitem{Fowler2009Cooperative}\nFowler, J. H. \\& Christakis, N. A.\n\\newblock{Cooperative behavior cascades in human social networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 107}, 5334--5338 (2009).\n\n\\bibitem{BorgeHolthoefer2013Cascading}\nBorge-Holthoefer, J., Ba\\~{n}os, R. A., Gonz\\'{a}lez-Bail\\'{o}n, S. \\& Moreno, Y.\n\\newblock{Cascading behaviour in complex socio-technical networks}.\n\\newblock {\\em J. Complex Net.} {\\bf 1}, 1--22 (2013).\n\n\\bibitem{Hackett2013Cascades}\nHackett, A. \\& Gleeson, J. P.\n\\newblock{Cascades on clique-based graphs}.\n\\newblock {\\em Phys. Rev. E} {\\bf 87}, 062801 (2013).\n\n\\bibitem{Gleeson2008Cascades}\nGleeson, J. P.\n\\newblock{Cascades on correlated and modular random networks}.\n\\newblock {\\em Phys. Rev. E} {\\bf 77}, 046117 (2008).\n\n\\bibitem{Brummitt2011}\nBrummitt, C. D., D'Souza, R. M. \\& E. A. Leicht,\n\\newblock{Suppressing cascades of load in interdependent networks}.\n\\newblock {\\em Proc. Natl. Acad. Sci. USA} {\\bf 109}, E680--E689 (2011).\n\n\\bibitem{GhoshCascadesArxiv2010}\nGhosh, R. \\&Lerman, K.\n\\newblock{A framework for quantitative analysis of cascades on networks}, WSDM '11.\n\\newblock (WSDM '11, ACM, New York, NY, USA), pp. 665--674 (2010).\n\n\\bibitem{Hurd2013Watts}\nHurd, T. R. \\& Gleeson, J. P.\n\\newblock{On Watts' cascade model with random link weights}.\n\\newblock {\\em J. Complex Net.} {\\bf 1}, 25-43 (2013).\n\n\\bibitem{Singh2013Thresholdlimited}\nSingh, P., Sreenivasan, S., Szymanski, B. K. \\& Korniss, Gy.\n\\newblock{Threshold-limited spreading in social networks with multiple initiators}.\n\\newblock {\\em Sci. Rep.} {\\bf 3}, 2330 (2013).\n\n\\bibitem{Gleeson2007Seed}\nGleeson, J. P.  \\& Cahalane, D. J.\n\\newblock{Seed size strongly affects cascades on random networks}.\n\\newblock {\\em Phys. Rev. E} {\\bf 75}, 050101(R) (2007).\n\n\\bibitem{SocialMedia}\nWhite, D. S.\n\\newblock {Social Media Growth 2006 to 2012} (2013).\n\\newblock Date of access: 2015.01.29.\n\n\\bibitem{SkypeIPO}\nMorrissey, R. C., Goldman, N. D. \\& Kennedy, K. P.\n\\newblock {Skype S.A. United States Security Registration Statement, Amendment 3, Reg.No. 333-168646} (2011).\n\\newblock Date of access: 2014.10.14.\n\n\\bibitem{porter2014}\nPorter, M. A. \\& Gleeson, J. P. \n\\newblock{Dynamical systems on networks: A tutorial}.\n\\newblock{Eprint arXiv 1403.7663 (2014).}\n\n\\bibitem{gleeson2013binary}\nGleeson, J. P.\n\\newblock{Binary-state dynamics on complex networks: Pair approximation and beyond}.\n\\newblock {\\em Phys. Rev. X} {\\bf 3}, 021004 (2013).\n\n\\bibitem{gleeson2011high}\nGleeson, J. P.\n\\newblock{High-accuracy approximation of binary-state dynamics on networks}.\n\\newblock {\\em Phys. Rev. Lett.} {\\bf 107}, 068701 (2011).\n\n\\bibitem{Bakshy11}\nBakshy, E., Hofman, J. M., Mason, W. A. \\& Watts, D. J.\n\\newblock{Everyone's an influencer: Quantifying influence on Twitter}.\n\\newblock (WSDM '11, ACM, New York, NY, USA), pp. 65--74 (2011).\n\n\\end{thebibliography}\n\n\n\\newpage\n\n\\section*{\\LARGE{Supplementary Information}}\n\n\n\n\n\n\\section{Detailed data description}\n\\label{sec:ddescr}\n\nThis study has been conducted on a dataset of the social network of Skype. The centrepiece of the dataset is the \\emph{contact network}, where nodes represent users and edges between pairs of users exist if they are in each other's contact lists. A user's contact list is composed of \\emph{friends}. If user $u$ wants to add another user $v$ to his/her contact list, $u$ sends $v$ a contact request, and the edge is established at the moment $v$ approves the request (or not, if the contact request is rejected). Each edge is labelled with a time stamp indicating the moment the contact request was approved. As the underpinning social structure we consider the static representation of the Skype social network, aggregated for $99$ months between September 2003 and November 2011. The largest connected component of this structure includes roughly 510 million users and 4.4 billion edges.\n\nAs the chosen service evolving on the Skype network, we follow how users purchase ``credits'' for calling phones. For each user, the dataset includes the date when he/she first adopted the paid product ``buy credit'' (first credit purchase, for all purposes). We select this service since its lifetime of $89$ months is considerably long (it was introduced in 2004), and it can be adopted by registered Skype users only. This way the aggregated Skype network provides a complete description of the mediating social structure, which allows us to calculate the correct degree and adoption threshold for all individuals. To make additional observations and to further test our model, we perform calculations on a second paid service called ``subscription'', which was introduced in April 2008, lasts for over $42$ months, and can also be adopted by registered Skype users only. Results regarding this service are presented in Section \\ref{sec:addserv}.\n\nBy considering the online social structure and the adoption times we identify users as innovator, vulnerable, or stable nodes based on the number $\\Phi_k$ of adopting neighbours at the time of exposure. Thresholds are calculated as $\\phi=\\Phi_k/k$ for users with $k$ contacts. The adoption network is constructed by considering confirmed social links between users who adopted the service earlier than the time of observation $t$. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. Note that for the categorization of nodes we use only the adoption time and the state of their peers, and thus `real' categories may differ slightly. For example, an innovator may appear as a vulnerable or stable node, even if its decision was not driven by social influence but some of its peers adopted earlier. To consider this bias we also measure `effective' rates of adoption for the model process, just like for the empirical case (Fig.1, main text) and section S3.\n\nThe dataset does not include identity information. All usernames are anonymized and there is no way of inferring a user's identity solely from the profile. The dataset does not contain any information about interpersonal interactions, apart from the contact list.\n\n\n\\section{Empirical determination of model parameters}\n\\label{sec:pars}\n\nParameters in the model are the rate of innovators $p_{n}$, the degree distribution $P(k)$, the threshold distribution $P(\\phi)$, and the fraction of immune nodes $r$. Other than $r$, all of them can be estimated from the data as follows.\n\n\\subsection{Rate of innovators}\n\nAs discussed in the main text, the rate of spontaneous adoption saturates approximately to a constant value after an initial transition period, which allows us to determine the rate of innovators by fitting a constant function on the curve after time $2\\tau$. We estimate this rate to be $p_{n} = 0.00019$, as demonstrated in Fig.~S\\ref{fig:NullModelRate}a where the dashed line assigns the fitted constant function.\n\n\\subsection{Degree distribution}\n\\label{sec:degDistrFit}\n\nDegrees in the aggregated Skype network are broadly distributed with a fat tail corresponding to strong degree heterogeneities. To characterize this distribution analytically we select two candidate distribution functions. The first is a shifted power-law distribution function of the form,\n\n", "index": 13, "text": "\\begin{equation}\nP(k)=\\frac{\\gamma-1}{C+k_{min}}\\left( \\frac{C+k}{C+k_{min}} \\right)^{-\\gamma} \\hspace{.2in} \\mbox{for} \\hspace{.2in}\tk_{min}\\leq k,\n\\label{eq:shSF}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"P(k)=\\frac{\\gamma-1}{C+k_{min}}\\left(\\frac{C+k}{C+k_{min}}\\right)^{-\\gamma}%&#10;\\hskip 14.454pt\\mbox{for}\\hskip 14.454ptk_{min}\\leq k,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mrow><mi>γ</mi><mo>-</mo><mn>1</mn></mrow><mrow><mi>C</mi><mo>+</mo><msub><mi>k</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mi>C</mi><mo>+</mo><mi>k</mi></mrow><mrow><mi>C</mi><mo>+</mo><msub><mi>k</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>γ</mi></mrow></msup></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mtext>for</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msub><mi>k</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>≤</mo><mi>k</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere $\\mu_D$ and $\\sigma_D$ are the scaling parameters. After fitting this function by using the non-linear least square method with two free parameters ($\\mu_D$ and $\\sigma_D$), we obtain an excellent fit with the empirical distribution for parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$.\n\nTo select the best candidate function, we calculate the corresponding Jensen-Shannon ($JS$) divergence values \\cite{Lin1991} between the empirical and fitted distributions. As a result we find that for the shifted power-law function the best fit provides $JS=0.0257$, while for the lognormal distribution  we get $JS=0.0051$. Thus we select the lognormal distribution as the best analytical function describing the degree distribution of the empirical network.\n\n\\subsection{Threshold distribution}\n\\label{sec:thrDistr}\n\nThe adoption threshold $\\phi$ of a node is defined as $\\phi = \\Phi_k / k$, i.e. the fraction of adopting neighbours that trigger the adoption of the central node. Therefore it can only take certain fractional values determined by the degree $k$. Although thresholds are defined as a fraction, by considering nodes of the same degree we can focus on the integer threshold $\\Phi_k$, defined as the number of a node's neighbours who have adopted the service earlier.\n\nIn our method we first group nodes of the same degree, record their integer thresholds, and then calculate the threshold distribution for each degree group, as shown in the main text (Fig.~1e, inset). These distributions collapse to a master curve after normalization by using the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$ (Fig.~1e, main panel). Moreover, this master curve can be well approximated by a lognormal distribution of the form,\n\n", "itemtype": "equation", "pos": 59572, "prevtext": "\nwhere $k$ denotes the degree, $\\gamma$ is the power-law exponent scaling the tail of the distribution, and $k_{min}$ is the minimum degree (in our case 1). $C$ is a constant scaling the shift of the distribution, which can be determined as $C=z(\\gamma-2)-k_{min}(\\gamma-1)$ since we know the average degree $z = 8.56$ of the empirical network. This way our only free parameter during the fit is the degree exponent $\\gamma$. After fitting this function by using the non-linear least-square method, we obtain a relatively good match with the empirical distribution (Fig.~S\\ref{fig:degdistr}a) for exponent $\\gamma=3.61$.\n\n\\begin{figure}[t] \\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{DegreeDistr_ww_fit_shpwl}\n}\n\\subfigure[]{\n  \\includegraphics[width=76mm]{DegreeDistr_ww_fit_lognorm}\n} \\\\\n\\caption{\\small{\\bf Fitted degree distribution.} {\\bf (a)} Empirical degree distribution $P(k)$ fitted with a shifted power-law distribution function [Eq.~(\\ref{eq:shSF})] with parameters described in the text. {\\bf (b)} $P(k)$ fitted by a lognormal distribution function [Eq.~(\\ref{eq:logn})] with parameters determined in the text. Grey symbols are the degree distribution, blue symbols the log-binned distribution, and solid lines the fitted analytical distribution.}\n\\label{fig:degdistr}\n\\end{figure}\n\nOur second candidate function is a lognormal distribution function of the form,\n\n", "index": 15, "text": "\\begin{equation}\nP(k)=\\frac{1}{k\\sigma_D\\sqrt{2\\pi}}e^{-\\frac{(\\ln k-\\mu_D)^2}{2\\sigma_D^2}} \\hspace{.2in} \\mbox{for} \\hspace{.2in}\tk_{min}\\leq k,\n\\label{eq:logn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"P(k)=\\frac{1}{k\\sigma_{D}\\sqrt{2\\pi}}e^{-\\frac{(\\ln k-\\mu_{D})^{2}}{2\\sigma_{D%&#10;}^{2}}}\\hskip 14.454pt\\mbox{for}\\hskip 14.454ptk_{min}\\leq k,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mrow><mi>k</mi><mo>⁢</mo><msub><mi>σ</mi><mi>D</mi></msub><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt></mrow></mfrac><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ln</mi><mo>⁡</mo><mi>k</mi></mrow><mo>-</mo><msub><mi>μ</mi><mi>D</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>σ</mi><mi>D</mi><mn>2</mn></msubsup></mrow></mfrac></mrow></msup></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mtext>for</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msub><mi>k</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>≤</mo><mi>k</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere $\\mu_T=-2$ and $\\sigma_T=1$, as determined by the empirical average threshold $w = 0.19$ and standard deviation (STD) $0.233$.\n\nThese findings indicate that although individual thresholds are strongly determined by degree, their distribution is degree-invariant, suggesting that the fraction of adopting friends rather than its absolute number is relevant during the service adoption process. The estimated empirical values of parameters are summarized in Table \\ref{table:pars}. \n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{|c||c|c|c||c|c|c|c|}\n\\hline \n$p_{n}$ & $\\langle k \\rangle$ & $\\mu_D$ & $\\sigma_D$ & $w$ & $STD(\\phi)$ & $\\mu_T$ & $\\sigma_T$  \\\\ \\hline \\hline \n$0.00019$ & $8.56$ & $1.2$  & $1.39$ & $0.19$ & $0.233$ & $-2$ & $1$ \\\\\n\\hline \n\\end{tabular} \n\\caption{\\small Estimated empirical parameters for service ``buy credit''.}\n\\label{table:pars}\n\\end{center}\n\\end{table}\n\n\\section{Social influence - null model study}\n\\label{sec:sinf}\n\nStudies of social contagion phenomena assume that social influence is responsible for the correlated adoption of connected people. However, an alternative explanation for the observed correlated adoption patterns is homophily: a link creation mechanism by which similar egos get connected in a social structure. In the latter case, the correlated adoption of a connected group of people would be explained by their similarity and not necessarily due to social influence. Homophily and influence are two processes that may simultaneously play a role during the adoption process. Nevertheless, distinguishing between them on the individual level is very difficult using our or any similar datasets \\cite{Shalizi2011}. Fortunately, at the system level one may decide which process is dominant in the empirical data. To do that first we need to elaborate on the differences between these two processes.\n\nInfluence-driven adoption of an ego can happen once one or more of its neighbours have adopted, since then their actions may influence the decision of the central ego. Consequently, the time ordering of adoptions of the ego and its neighbours matters in this case. Homophily-driven adoption is, however, different. Homophily drives social tie formation such that similar people tend to be connected in the social structure. In this case connected people may adopt because they have similar interests, but the time ordering of their adoptions would not matter. Therefore, it is valid to assume that adoption could evolve in clusters due to homophily, but these adoptions would appear in a random order.\n\nTo test our hypothesis we define a null model where we take the adoption times of each adopter and shuffle them randomly among all adopting egos. This way a randomly selected time is assigned to each adopter, while the adoption rate and the final set of adopters remain the same. Moreover, this procedure only destroys correlations between adoption events induced by social influence, but keeps the social network structure and node degrees unchanged. In this way, during the null model process the same egos appear as adopters, but the time series of adoption may in principle change (or not), corresponding to social influence (or homophily) as a dominant factor during the adoption process. If adoption is mostly driven by homophily, the rates of adoption would not change considerably beyond statistical fluctuations. On the other hand, if social influence plays a role in the process, rates of adoption in the null model should be very different from the empirical curves, implying that the time ordering of events matters in the adoption process. In this case, the rate of innovators should be higher than in the empirical data, since nodes that are in the adoption cluster originally but not directly connected would have a greater chance to appear as innovators, due to a random adoption time that is not conditional to the time ordering of the adopting neighbours.\n\n\\begin{figure}[t] \\centering\n\\subfigure[Empirical adoption rates]{\n\t\\includegraphics[width=76mm]{AdoptionRates_ww_fit.pdf}\n}\n\\subfigure[Null model adoption rates]{\n\t\\includegraphics[width=76mm]{AdoptionRates_ww_nullodel.pdf}\n}\n\\caption{\\small{\\bf Adoption rates in the original and null model processes.} Adoption rates for innovator (green), vulnerable (red), and stable (blue) nodes as a function of time. {\\bf (a)} Empirical rates where adoptions appear in the original order. The dashed line assigns a fitted constant function to estimate the innovator adoption rate. {\\bf (b)} Null model rates where times of adoption are randomly shuffled. Here $q$ and $\\tau$ are arbitrary constant values.}\n\\label{fig:NullModelRate}\n\\end{figure}\n\nAfter calculating the adoption rates of different user groups in the shuffled null model sequence we observe the latter situation: the rate of innovators becomes dominant, while the rate of stable and vulnerable adoptions drops considerably as they appear only by chance. This suggests that the temporal ordering of adoption events matters a lot in the evolution of the observed adoption patterns, and thus social influence may play a strong role here. Of course one cannot decide whether influence is solely driving the process or homophily has some impact on it; in reality it probably does to some extent. However, we can use this null model measure to demonstrate the presence and importance of the mechanism of influence during the adoption process.\n\n\\section{Threshold model}\n\\label{sec:thresModel}\n\n\\subsection{Model description}\n\\label{ssec:modDesc}\n\nThis model emulates the rise and temporal evolution of system-wide adoption cascades in complex social networks~\\cite{watts2002,singh2013,Ruan2015}. Note that this model has been introduced in \\cite{Ruan2015}, where its general scaling behaviour has been explored. In a system of fixed size, a node has social interactions with $k$ other agents and is characterized by a continuous adoption threshold $\\phi$. When faced with the prospect of adopting a given innovation, product, or fad, susceptible individuals adopt spontaneously with rate ${p_n}$. Otherwise, the node adopts if at least a fraction $\\phi$ of its $k$ neighbours have adopted before (the so-called `threshold rule'). Moreover, a fraction $r$ of the system is `immune' to the innovation, in the sense that these agents never adopt regardless of their values of $k$ and $\\phi$. The distributions of degrees and thresholds, $P(k)$ and $P(\\phi)$ (as well as the values of ${p_n}$ and $r$), thus determine the average topological state and dynamical evolution of the system.\n\nThe model may be implemented numerically via a Monte Carlo simulation of the rules described above in a system of size $N$. Here, the dynamical state of the system is determined by the adoption state (0 or 1) of all nodes, which change in asynchronous random order in a series of time steps. Once an agent adopts and its state changes from 0 to 1, it remains so for the rest of the dynamics, thus ensuring a frozen final state for the finite system where no more adoptions arise. Each time step consists of $N$ node updates: In each node update, a randomly selected node (non-immune and in state 0) adopts spontaneously with probability ${p_r} = {p_n} / (1 - r)$ \\footnote{We define ${p_r} = 1$ for ${p_n} > 1 - r$.}; else it adopts only if the threshold rule is satisfied. The rescaled rate ${p_r}$ is necessary if we wish to obtain a rate ${p_n}$ of innovators in early times of the dynamics, regardless of the value of $r$. Finally, we assume that agents with $k=0$ receive no social influence (for any value of $\\phi$), and therefore can only adopt spontaneously. We will now explore this dynamics with numerical simulations and a rate equation formalism.\n\n\n\\subsection{Stochastic binary-state dynamics}\n\\label{ssec:stocDynam}\n\nHere we extend an approximate master equation (AME) formalism for stochastic binary-state dynamics as developed recently by Gleeson~\\cite{porter2014,gleeson2013,gleeson2008,gleeson2011}. In a stochastic binary-state dynamics, each node in the network can take one of two possible states (susceptible or adopter in the language of innovation adoption) at any point in time, and state-switching happens randomly with probabilities that only depend on the current state of the updating agent and on the states of its neighbours. This general definition includes the threshold model described above as a special case. Such formalism considers configuration-model networks, that is, an ensemble of networks specified by the degree distribution $P(k)$ but otherwise maximally random~\\cite{newman2010}.\n\nAll relevant properties used to describe a node are included in the vector ${\\mathbf{k}} = (k, c)$, where $k = k_0, k_1, \\ldots k_{M-1}$ is the degree of the node and $c = 0, 1, \\ldots, M$ a dummy variable that labels its `type', i.e. any other property that characterizes the node apart from its degree. In the case of our threshold model, $c = 0$ is the type of the fraction $r$ of immune nodes, while $c \\neq 0$ labels the type of all non-immune nodes with given threshold $\\phi_c$. The various values of $c \\neq 0$ correspond then to different adoption thresholds $\\phi_c$. The integer $M$ is the maximum number of degrees/types considered in the AME framework, which can be increased to improve the accuracy of the analytical approximation at the expense of speed in its numerical computation\\footnote{Explicitly, rather than using $k_0 = k_{\\text{min}}$, $k_{M-1} = N - 1$ and $M = N - k_{\\text{min}}$ (i.e, considering all possible degrees in the empirical/simulated network), we take a small $k_0 > k_{\\text{min}}$ and large $k_{M-1} < N - 1$, $M < N - k_{\\text{min}}$, with the other $M - 2$ degree values equidistantly distributed between $k_0$ and $k_{M-1}$, thus disregarding some degrees and gaining speed in the computation of the AMEs. Similarly, the $M$ threshold values corresponding to nonzero types are uniformly distributed in the open interval $(0, 1)$.}. Any pair of nodes with identical values of ${\\mathbf{k}}$ are considered equivalent in this level of description, forming a node class with the same average dynamics. Moreover, $P(k)$ and $P(\\phi)$ can be generalized to the joint distribution ${P({{\\mathbf{k}}})}$ giving the probability that a randomly selected node has property vector ${\\mathbf{k}}$ (i.e. degree $k$ and type $c$). Here it is useful to define $P(c)$ as the distribution of all non-zero types, $c = 1, \\ldots, M$. If degrees and thresholds are chosen independently, like in our model, then ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$. The distribution $P(c)$ is, in other words, a discrete, rescaled version of the continuous threshold distribution $P(\\phi)$.\n\nIn the language of innovation adoption, the dynamics of a node is determined by the number $m = 0, 1, \\ldots k$ of its neighbours that have already adopted when the node is deciding whether to adopt or not. During a small time interval $dt$, a susceptible node (in state 0) adopts with probability ${F_{{\\mathbf{k}}, m}} dt$, while an adopter (in state 1) becomes susceptible with probability $R_{{\\mathbf{k}}, m} dt$. The functions ${F_{{\\mathbf{k}}, m}}$ and $R_{{\\mathbf{k}}, m}$, known as infection and recovery rates, respectively, determine the temporal evolution of the node class ${\\mathbf{k}}$. In the particular case of threshold models, a so-called monotone dynamics, $R_{{\\mathbf{k}}, m} = 0$ $\\forall\\, {\\mathbf{k}}, m$ (since no adopters become susceptible again). As for ${F_{{\\mathbf{k}}, m}}$, the rules of spontaneous and threshold adoption imply,\n\n", "itemtype": "equation", "pos": 61467, "prevtext": "\nwhere $\\mu_D$ and $\\sigma_D$ are the scaling parameters. After fitting this function by using the non-linear least square method with two free parameters ($\\mu_D$ and $\\sigma_D$), we obtain an excellent fit with the empirical distribution for parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$.\n\nTo select the best candidate function, we calculate the corresponding Jensen-Shannon ($JS$) divergence values \\cite{Lin1991} between the empirical and fitted distributions. As a result we find that for the shifted power-law function the best fit provides $JS=0.0257$, while for the lognormal distribution  we get $JS=0.0051$. Thus we select the lognormal distribution as the best analytical function describing the degree distribution of the empirical network.\n\n\\subsection{Threshold distribution}\n\\label{sec:thrDistr}\n\nThe adoption threshold $\\phi$ of a node is defined as $\\phi = \\Phi_k / k$, i.e. the fraction of adopting neighbours that trigger the adoption of the central node. Therefore it can only take certain fractional values determined by the degree $k$. Although thresholds are defined as a fraction, by considering nodes of the same degree we can focus on the integer threshold $\\Phi_k$, defined as the number of a node's neighbours who have adopted the service earlier.\n\nIn our method we first group nodes of the same degree, record their integer thresholds, and then calculate the threshold distribution for each degree group, as shown in the main text (Fig.~1e, inset). These distributions collapse to a master curve after normalization by using the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$ (Fig.~1e, main panel). Moreover, this master curve can be well approximated by a lognormal distribution of the form,\n\n", "index": 17, "text": "\\begin{equation}\nP(\\phi)=\\frac{1}{\\phi \\sigma_T\\sqrt{2\\pi}}e^{-\\frac{(\\ln\\phi-\\mu_T)^2}{2\\sigma_T^2}},\n\\label{eq:thrLogn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"P(\\phi)=\\frac{1}{\\phi\\sigma_{T}\\sqrt{2\\pi}}e^{-\\frac{(\\ln\\phi-\\mu_{T})^{2}}{2%&#10;\\sigma_{T}^{2}}},\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>ϕ</mi><mo>⁢</mo><msub><mi>σ</mi><mi>T</mi></msub><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt></mrow></mfrac><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ln</mi><mo>⁡</mo><mi>ϕ</mi></mrow><mo>-</mo><msub><mi>μ</mi><mi>T</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>σ</mi><mi>T</mi><mn>2</mn></msubsup></mrow></mfrac></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwith $F_{(k,0),m} = 0$ $\\forall k, m$ and $F_{(0,c),0} = {p_r}$ $\\forall c \\neq 0$ (for immune and isolated nodes, respectively). The dynamics of adoption is well described by an AME for the fraction ${s_{{\\mathbf{k}}, m}}(t)$ of ${\\mathbf{k}}$-nodes that are susceptible at time $t$ and have $m=0,\\ldots,k$ adopting neighbours~\\cite{porter2014,gleeson2013binary,gleeson2011high},\n\n", "itemtype": "equation", "pos": 42941, "prevtext": "\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig2.pdf}\n\\caption{{\\bf Threshold model for the adoption of online services.} {\\bf (a-b)} Surface plot of the normalised fraction of adopters $\\rho / (1 - r)$ in $(w, z)$-space, for $r = 0.73$ and $t = 89$. Contour lines signal parameter values for which $20\\%$ of non-immune nodes have adopted, for fixed $r$ and varying time (a), and for fixed time and varying $r$ (b). The continuous contour line and dot indicate parameter values in the last observation of Skype s3. A regime of maximal adoption ($\\rho \\approx 1 - r$) grows as time goes by, and shrinks for larger $r$. {\\bf (c)} Time series of the fraction of adopters $\\rho$ for fixed $p_n = 0.00019$ and varying $r$ (main), and for fixed $r = 0$ and varying $p_n$ (inset). These curves are well approximated by the solution of Eq.~(\\ref{eq:reducedAMEs}) for $k_0 = 3$, $k_{M-1} = 150$ and $M = 25$ (dashed lines). The dynamics is clearly faster for larger $p_n$. As $r$ increases, the system enters a regime where the dynamics is slowed down and adopters are mostly innovators. {\\bf (d)} Final fraction of innovators $\\rho_0(\\infty)$ and time $t_c$ when $50\\%$ of non-immune nodes have adopted as a function of $r$, both simulated and theoretical. The crossover to a regime of slow adoption is characterised by a maximal fraction of innovators and time $t_c$. Unless otherwise stated, $p_n=0.00019$ and we use $N=10^4$, $\\mu_D=1.09$, $\\sigma_D=1.39$, ${k_{\\mathrm{min}}}=1$, $\\mu_T=-2$, and $\\sigma_T=1$ to obtain $z = 8.56$ and $w = 0.19$ as in Skype s3. The difference in $\\mu_D$ between data and model is due to finite-size effects (see Materials and Methods). Numerical results are averages over $10^2$ (a-b) and $10^3$ (c-d) realisations.\n\\label{fig:2}}\n\\end{figure}\n\nWe also implement the threshold model numerically via a Monte Carlo simulation in a network of size $N$, with a lognormal degree distribution and a lognormal threshold distribution as observed empirically. Thus, we can explore the behaviour of $\\rho$ and $\\rho_0$ as a function of $z$, $w$, $p_n$ and $r$, both in the numerical simulation and in the theoretical approximation given by Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}). For $p_n > 0$ some nodes adopt spontaneously as time passes by, leading to a frozen state characterised by a final fraction $\\rho(\\infty) = 1 - r$ of adopters. However, the time needed to reach such state depends heavily on the distribution of degrees and thresholds, as signalled by a region of large adoption ($\\rho \\approx 1 - r$) that grows in $(w, z)$-space with time (contour lines in Fig.~\\ref{fig:2}a). If we fix a time in the dynamics and vary the fraction of immune nodes instead, this region shrinks as $r$ increases (contour lines in Fig.~\\ref{fig:2}b). In other words, the set of networks (defined by their average degree and threshold) that allow the spread of adoption is larger at later times in the dynamics, or when the fraction of immune nodes is small. When both $t$ and $r$ are fixed, the normalised fraction of adopters $\\rho / (1 - r)$ gradually decreases for less connected networks with larger thresholds (surface plot in Fig.~\\ref{fig:2}a and b).\n\nFor $r \\approx 0$ the critical fraction of innovators necessary to trigger a cascade of fast adoption throughout all susceptible nodes may be identified as the inflection point in the time series of $\\rho$ (Fig.~\\ref{fig:2}c, inset). The adoption cascade appears sooner for larger $p_n$, since this parameter regulates how quickly the critical fraction of innovators is reached. Yet as we increase $r$ above a threshold $r_c$, the system enters a regime where rapid cascades disappear and adoption is slowed down. The crossover between these regimes is gradual, as seen in the shape of $\\rho$ for increasing $r$ (Fig.~\\ref{fig:2}c, main panel). We may identify $r_c$ in various ways: by the maximum in both the final fraction of innovators $\\rho_0(\\infty)$ and the critical time $t_c$ when $\\rho = (1-r)/2$ (Fig.~\\ref{fig:2}d), or as the $r$ value where the inflection point in $\\rho$ disappears. These measures indicate $r_c \\approx 0.8$ for the chosen parameters. All global properties of the dynamics (like the functional dependence of $\\rho$ and $\\rho_0$) are very well approximated by the solution of Eqs.~(\\ref{eq:reducedAMEs}) and~(\\ref{eq:innovFrac}) (dashed lines in Fig.~\\ref{fig:2}c and d). Indeed, the AME framework is able to capture the shape of the $\\rho$ time series, the crossover between regimes of fast and slow adoption, as well as the maximum in $\\rho_0(\\infty)$ and $t_c$.\n\n\\subsection*{Validation} \n\nTo better understand how innovation spreads throughout real social networks, we take a closer look at the internal structure of the service adoption process. By taking into account individual adoption times we construct an evolving adoption network with links between users who have adopted the service before time $t$ and are connected in the social structure. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. This way links in the adoption graph indicate ties where social influence among individuals could have existed. The size distribution $P(s_a)$ of connected components in the adoption network shows the emergence of a giant percolating component over time (Fig.~\\ref{fig:3}a), along with several other small clusters. Moreover, after decomposition we observe that the giant cluster does not consist of a single innovator seed and percolating vulnerable tree~\\cite{Watts2002Simple}, but builds up from several innovator seeds that induce small vulnerable trees locally (Fig.~\\ref{fig:3}b), each with small depth (Fig.~\\ref{fig:3}d) \\cite{Bakshy11,Goel2012Structure}. At the same time the stable adoption network (considering connections between all stable adopters at the time) has a giant connected component, indicating the emergence of a percolating stable cluster with size comparable to the largest adoption cluster (Fig.~\\ref{fig:3}a, inset). These observations suggest a scenario for the evolution of the global adoption component different from earlier threshold models ~\\cite{Watts2002Simple}. It appears that here multiple innovators adopt at different times and trigger local vulnerable trees (Fig.\\ref{fig:1}b), which in turn induce a percolating component of connected stable nodes that holds the global adoption cluster together (Fig.\\ref{fig:1}c). Consequently, in the structure of the adoption network primary triggering effects are important only locally, while external and secondary triggering mechanisms seem to be responsible for the emergence of global-scale adoption. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.6\\textwidth,angle=0]{Fig3.pdf}\n\\caption{\\textbf{Empirical cluster statistics and simulation results.} \\textbf{(a)} Empirical connected-component size distribution at different times for the adoption [$P(s_a)$, main panel] and stable adoption [$P(s_s)$, inset] networks, with $s_a$ and $s_s$ relative to system size. \\textbf{(b)} Empirical connected-component size distribution $P(s_v)$ for the relative size of innovator-induced vulnerable trees at different times. \\textbf{(c)} Average size of the largest ($LC$) and 2nd largest ($LC^{2nd}$) components of the model network (`Net'), adoption network (`Casc'), stable network (`Stab'), and induced vulnerable trees (`Vuln') as a function of $r$. Dashed lines show the observed relative size of the real $LC$ of the adopter network in $2011$ [see main panel in (a)] and the predicted $r$ value. \\textbf{(d)} Distribution $P(d)$ of depths of induced vulnerable trees in both data and model for several $r$ values, showing a good fit with the data for $r=0.73$. The difference in the tail is due to finite-size effects. \\textbf{(e)} Correlation $\\langle s_v \\rangle (k)$ between innovator degree and average size of vulnerable trees in both data and model with the same $r$ values as in (e). Model calculations for (d) and (e) correspond to networks of size $N=10^6$ and are averaged over $10^2$ realisations.\n\\label{fig:3}}\n\\end{figure}\n\nTo model the observed dynamics and explore the effect of immune nodes, we perform extensive numerical simulations of the threshold model with parameters determined directly from the data (see MM and SI). We use a network structure with empirical degree and threshold distributions and fix $p_n=0.00019$ as the constant rate of innovators, implying that the time scale of a Monte Carlo iteration in the model is 1 month. We measure the average size of the largest ($LC$) and second largest ($LC^{2nd}$) connected components of the background social network, and of the stable, vulnerable and global adoption networks, as a function of the fraction of immune nodes $r$. After $T=89$ iterations (matching the length of the real observation period) we identify three regimes of the dynamics (Fig.~\\ref{fig:3}c): if $0<r<0.6$ (dark-shaded area) the spreading process is very rapid and evolves in a global cascade, which reaches most of the nodes of the shrinking susceptible network in a few iteration steps. About $10\\%$ of adopters are connected in a percolating stable cluster, while vulnerable components remain very small in accordance with empirical observations. In the crossover regime $0.6<r<0.8$ (light-shaded area), the adoption process slows down considerably (Fig.~\\ref{fig:2}d, lower panel), as stable adoptions become less likely due to the quenching effect of immune nodes. The adoption process becomes the slowest at $r_c=0.8$ (Fig.~\\ref{fig:2}d, lower panel) when the percolating stable cluster falls apart, as demonstrated by a peak in the corresponding $LC^{2nd}$ curve (Fig.~\\ref{fig:3}c, lower panel). Finally, around $r=0.9$ the adoption network becomes fragmented and no global diffusion takes place. We repeat the same calculations for another service and find qualitatively the same picture, but with the crossover regime shifted towards larger $r$ values due to the different parametrisation of the model process. Note that another possible reason for the slow adoption could be the time users wait between their threshold has been reached and actual adoption. We test for the effect of this potential scenario on the empirical curves but find no qualitative change in the dynamics (see SI).\n\n\nWe can use these calculations to estimate the only unknown parameter (the fraction $r$ of immune nodes in Skype) by matching the size of the largest component ($LC_{Net}$) between real and model adoption networks at time $T$. Empirically, this value is the relative size corresponding to the last point on the right-hand side of the distribution for $2011$ (Fig.~\\ref{fig:3}a, main panel). The corresponding value in the model is $r = 0.73$ (dashed lines in Fig.~\\ref{fig:3}c; also Fig.~\\ref{fig:2}a and b), suggesting that the real adoption process lies in the crossover regime. The other analysed service turns out to lie right of the crossover regime, which explains its large innovator adoption rate and reduced size of stable and vulnerable adoption clusters (see SI).\n\nTo test the validity of the prediction of $r$ we perform three different calculations. First we measure the maximum relative growth rate of cumulative adoption and find a good match between model and data (Skype s3 and Model Skype s3 in Fig.~\\ref{fig:1}a). In other words, the model correctly estimates the speed of the adoption process. Second, we measure the distribution $P(d)$ of depths of induced vulnerable trees (Fig.~\\ref{fig:3}d). Finally, in order to verify earlier theoretical suggestions \\cite{Singh2013Thresholdlimited}, we look at the correlation $\\langle s_v \\rangle (k)$ between the degree of innovators and the average size of vulnerable trees induced by them (Fig.~\\ref{fig:3}e). We perform the last two measurements on the real data and in the model process for $r=0.6$ and $0.9$, as  well as for the predicted value $r=0.73$. In the case of $\\langle s_v \\rangle (k)$, we find a strong positive correlation in the data, explained partially by degree heterogeneities in the underlying social network, but surprisingly well emulated by the model. More importantly, although both quantities appear to scale with $r$, measures for the estimated $r$ value fit the empirical data remarkably well, confirming our earlier validation based on the matching of relative component sizes (for further discussion see SI).\n\n\\section*{Discussion}\n\nAlthough some products and innovations diffusing in society may cover a large fraction of the population, their spreading tends to follow slow cascading patterns, the dynamics of which have been modelled before by simple diffusion models like that of Bass \\cite{Bass1969}. However, this approach neglects threshold mechanisms that arguably drive the decision making of single individuals. On the other hand, threshold models study the conditions for cascades in global diffusion but do not address their temporal evolution, which is clearly a relevant factor in real-world adoption processes. These models are commonly used to predict rapid cascading patterns of adoption, which is a more realistic scenario for the spreading of information, opinions, or behavioural patterns but are not observed in the case of product or innovation diffusion where adoption requires additional efforts, e.g., free or paid registration. Here we provide a solution for this conundrum by analysing and modelling the worldwide spread of an online service in the techno-social communication network of Skype. Beyond the novel empirical evidence about heterogeneous adoption thresholds and non-linear dynamics of the adoption process, we identify two additional components necessary to introduce in the modelling of product adoption, namely: (a) a constant flow of innovators, which may induce rapid adoption cascades even if the system is initially out of the cascading regime; and (b) a fraction of immune nodes that forces the system into a quenched state where adoption slows down. These features are responsible for a critical structure of empirical adoption components that radically differs from previous theoretical expectations. We incorporate these mechanisms into a threshold model controlled by the rate of innovators and the fraction of immune nodes. The model is able to reproduce several pathways ranging from cascading behaviour to more realistic dynamics of innovation adoption. By constraining the model with empirically determined parameters, we provide an estimate for the real fraction of susceptible agents in the social network of Skype, and validate this prediction through correlated structural features matching empirical observations.\n\nOur aim in this study was to provide empirical observations as well as methods and tools to model the dynamics of social contagion phenomena with the hope it will foster thoughts for future research. One possible direction would be the observation of the reported structure and evolution of the global adoption cluster in other systems similar to the ones studied in \\cite{BorgeHolthoefer2011Structural,Dow2013Anatomy,Gruhl2004Information,Goel2012Structure,BorgeHolthoefer2013Cascading,Bakshy11}. Other promising directions could be the consideration of homophilic or assortative structural correlations, the evolving nature of the underpinning social structure as studied in \\cite{Karsai2014Complex}, interpersonal influence, or the effects of leader-follower mechanisms on the social contagion process. Finally, we hope that the reported results may improve efficiency in the strategies of enhancing the diffusion of products and innovations, by shifting attention from the creation of short-lived perturbations to the sustenance of external input.\n\n\\subsubsection*{Competing interest statement}\nThe authors have no competing interests.\n\n\\subsubsection*{Authors' contributions statement}\nM.K., G.I., R.K., K.K, and J.K designed the research and participated in writing the manuscript. R.K. and M.K. analysed the empirical data, G.I. made the analytical calculations, and M.K. and G.I. performed the numerical simulations.\n\n\\subsubsection*{Acknowledgements}\nThe authors gratefully acknowledge the support of M. Dumas, A. Saabas, and A. Dumitras from STACC and Microsoft/Skype Labs as well as constructive comments by J. Saram\\\"aki and T. N{\\\"a}si.\n\n\\subsubsection*{Funding statement}\nG.I. acknowledges the Academy of Finland, and J.K. the CIMPLEX FET Open H2020 EU project for support. This research was partly funded by Microsoft/Skype Labs.\n\n\\section*{Material and Methods}\n\n\\section*{Data description}\n\nWe use a static representation of the Skype social network aggregated over 99 months between September 2003 and November 2011. We follow the adoption of the ``buy credit'' paid service for $89$ months starting from 2004, and the paid service ``subscription'' for $42$ months starting from 2008 (for further details about the network and service see SI). By considering the online social structure and adoption times, we identify users as innovator, vulnerable, or stable nodes based on the number $\\Phi_k$ of adopting neighbours at the time of exposure. Thresholds are calculated as $\\phi=\\Phi_k/k$ for users with $k$ contacts. The adoption network is constructed by considering confirmed social links between users who adopted the service earlier than $t$. In order to avoid the effect of instantaneous group adoptions (evidently not driven by social influence), we only consider links between nodes who are neighbours in the underlying social network and whose adoption did not happen at the same time. Note that for the categorisation of nodes we use only the adoption time and the state of their peers, and thus real categories may differ slightly. For example, an innovator may appear as a vulnerable or stable node, even if its decision was not driven by social influence but some of its peers adopted earlier. To consider this bias we measure effective rates of adoption for the model process as well, just like for the empirical case (Fig.\\ref{fig:1}) and section S3.\n\n\\section*{Maximum relative growth rate}\n\nThis measure is obtained by taking the maximum of the yearly adoption rate (yearly count of adoptions) normalised by the final observed adoption number of a given service. It characterises the maximum speed of adoption a service experienced during its history and takes values between 0 (no cascade) and 1 (instantaneous cascade). We repeat this measurement for the estimated number of registered users of Facebook, Twitter, and LinkedIn \\cite{SocialMedia}, as well as for the number of active users of Skype and three paid Skype services. Adoption rates for Facebook, Twitter, and LinkedIn correspond to the period between 2006 and 2012, and for Skype and its services to the interval from release date until 2011.\n\n\\section*{Empirical parameter estimation}\n\nWe use the Skype data to directly determine all model parameters, apart from the fraction $r$ of immune nodes. To best approximate the degree distribution of the real network, after testing different candidate functions (see SI) we select a lognormal function $P(k) = e^{ -(\\ln k-\\mu_D)^2 / (2\\sigma_D^2) } / (k\\sigma_D\\sqrt{2\\pi})$ with parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$ and minimum degree ${k_{\\mathrm{min}}} = 1$, leading to the average degree $z = 8.56$. To account for finite-size effects in the model results for low $N$ (Fig.~\\ref{fig:2}), we decrease $\\mu_D$ slightly to obtain the same value of $z$ as in the real network.\n\nThe threshold distribution of each degree group collapses to a master curve after normalisation by using the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$. This master curve can be well approximated by the lognormal distribution $P(\\phi) = e^{ -(\\ln \\phi-\\mu_T)^2 / (2\\sigma_T^2) } / (\\phi\\sigma_T\\sqrt{2\\pi})$, with parameters $\\mu_T=-2$ and $\\sigma_T=1$ as determined by the empirical average threshold $w = 0.19$ and standard deviation $0.233$ (for further details see SI). We estimate a rate of innovators $p_n = 0.00019$ by fitting a constant function to $R_i(t)$ for $t > 2\\tau$ (Fig.~\\ref{fig:1}f). The fit to ${p_n}$ also matches the time scale of a Monte Carlo iteration in the model to 1 month. Model results (Fig.~\\ref{fig:3}d and e) are calculated with $r = 0.73$ and $p_n = 0.00019$. Simulation results in Fig.~\\ref{fig:3}c (d and e) are averaged over $100$ configuration-model networks of size $N=10^5$ ($10^6$) after $T=89$ iterations, matching the length of the observation period in Skype.\n\n\\section*{Model description}\n\nWe characterise the static social network by the extended distribution ${P({{\\mathbf{k}}})}$, where ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$. Non-immune, susceptible nodes with property vector ${\\mathbf{k}}$ adopt spontaneously at a constant rate ${p_n}$, else they adopt only if a fraction $\\phi_c$ of their $k$ neighbours have adopted before. These rules are condensed in the probability ${F_{{\\mathbf{k}}, m}} dt$ that a node will adopt in a small time interval $dt$, given that $m$ of its neighbours are already adopters,\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:thresRule}\n{F_{{\\mathbf{k}}, m}} =\n\\begin{cases}\n{p_r} & \\text{if} \\quad m < k \\phi_c \\\\\n1 & \\text{if} \\quad m \\geq k \\phi_c\n\\end{cases}, \\quad \\forall m \\; \\text{and} \\; k, c \\neq 0,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"{F_{{\\mathbf{k}},m}}=\\begin{cases}{p_{r}}&amp;\\text{if}\\quad m&lt;k\\phi_{c}\\\\&#10;1&amp;\\text{if}\\quad m\\geq k\\phi_{c}\\end{cases},\\quad\\forall m\\;\\text{and}\\;k,c%&#10;\\neq 0,\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><msub><mi>p</mi><mi>r</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo mathsize=\"70%\" mathvariant=\"italic\" separator=\"true\" stretchy=\"false\"> </mo><mi>m</mi></mrow><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>1</mn></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo mathsize=\"70%\" mathvariant=\"italic\" separator=\"true\" stretchy=\"false\"> </mo><mi>m</mi></mrow><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></mtd></mtr></mtable></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mo>∀</mo><mrow><mpadded width=\"+2.8pt\"><mi>m</mi></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><mi>k</mi></mrow></mrow></mrow></mrow><mo>,</mo><mrow><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere $m = 0, \\ldots, k$, $s_{{\\mathbf{k}}, -1} \\equiv 0$, ${F_{{\\mathbf{k}}, m}}$ follows Eq.~(\\ref{eq:thresRule}), and ${\\beta_s}(t)$ (the rate at which edges between pairs of susceptible nodes transform to edges between a susceptible agent and an adopter) is given by,\n\n", "itemtype": "equation", "pos": 74962, "prevtext": "\nthat is, a node adopts the innovation either spontaneously with rate ${p_r}$, or with probability 1 if its number of adopting neighbours equals or exceeds the integer threshold $\\Phi_k = \\lceil k \\phi_c \\rceil$. Immune nodes ($c = 0$) have an infection rate of $F_{(k,0),m} = 0$ $\\forall k, m$, while for isolated nodes ($k = 0$) $F_{(0,c),0} = {p_r}$ $\\forall c \\neq 0$. In other words, immune nodes never adopt, and isolated nodes can only adopt spontaneously. We note that ${F_{{\\mathbf{k}}, m}}$ is written in terms of ${p_r} = {p_n} / (1 - r)$, not ${p_n}$, in order to counter the trivial decrease in the rate of spontaneous adoption for non-zero $r$.\n\nLet us now turn to the rate equations for our threshold model, called AMEs in the formalism by Gleeson. We denote by ${s_{{\\mathbf{k}}, m}}(t)$ the fraction of ${\\mathbf{k}}$-class nodes that are susceptible at time $t$ and have $m$ adopting neighbours. Therefore, the fraction of agents with property vector ${\\mathbf{k}}$ that are adopters at time $t$ is ${\\rho_{{\\mathbf{k}}}}(t) = 1 - \\sum_{m=0}^k {s_{{\\mathbf{k}}, m}} (t)$, and the fraction of adopters in the system is $\\rho (t) = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\rho_{{\\mathbf{k}}}}(t)$. Here, the sum over classes means a sum over all degrees and types, i.e. ${\\sum_{{\\mathbf{k}}}} \\bullet = \\sum_k \\sum_c \\bullet$. Assuming a monotone dynamics ($R_{{\\mathbf{k}}, m} = 0$), the AMEs for ${s_{{\\mathbf{k}}, m}}$ can be written as~\\cite{porter2014,gleeson2013,gleeson2011},\n\n", "index": 21, "text": "\\begin{equation}\n\\label{eq:AMEsThres}\n\\frac{d {s_{{\\mathbf{k}}, m}}}{dt} = -{F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}} -{\\beta_s} (k - m) {s_{{\\mathbf{k}}, m}} + {\\beta_s} (k - m + 1) {s_{{\\mathbf{k}}, m-1}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\frac{d{s_{{\\mathbf{k}},m}}}{dt}=-{F_{{\\mathbf{k}},m}}{s_{{\\mathbf{k}},m}}-{%&#10;\\beta_{s}}(k-m){s_{{\\mathbf{k}},m}}+{\\beta_{s}}(k-m+1){s_{{\\mathbf{k}},m-1}},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>-</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>+</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": " \nIf at time $t = 0$ we randomly choose a fraction $\\rho (0) = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\rho_{{\\mathbf{k}}}}(0)$ of nodes as seed for the adoption process, the initial conditions for Eq.~(\\ref{eq:AMEsThres}) are ${s_{{\\mathbf{k}}, m}} (0) = [1 - {\\rho_{{\\mathbf{k}}}}(0)] {B_{k, m}} [\\rho(0)]$, with ${\\rho_{{\\mathbf{k}}}}(0)$ the initial fraction of adopters in class ${\\mathbf{k}}$ and ${B_{k, m}}$ a binomial factor,\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $m = 0, \\ldots, k$, $s_{{\\mathbf{k}}, -1} \\equiv 0$, ${F_{{\\mathbf{k}}, m}}$ follows Eq.~(\\ref{eq:thresRule}), and ${\\beta_s}(t)$ (the rate at which edges between pairs of susceptible nodes transform to edges between a susceptible agent and an adopter) is given by,\n\n", "index": 23, "text": "\\begin{equation}\n\\label{eq:rateBs}\n{\\beta_s}(t) = \\frac{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}}(t)}{{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {s_{{\\mathbf{k}}, m}}(t)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"{\\beta_{s}}(t)=\\frac{{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}(k-m){F%&#10;_{{\\mathbf{k}},m}}{s_{{\\mathbf{k}},m}}(t)}{{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k%&#10;}}})}{\\sum_{m}}(k-m){s_{{\\mathbf{k}},m}}(t)}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>𝐤</mi></msub><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>m</mi></msub><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>𝐤</mi></msub><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>m</mi></msub><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\nThe solution ${s_{{\\mathbf{k}}, m}}(t)$ of the AME system in Eq.~(\\ref{eq:AMEsThres}) provides a very accurate description of the dynamics of our model, yet its dimension  (i.e. number of equations to solve) grows quadratically with the number of degrees and linearly with the number of threshold values considered. Fortunately, the AMEs for our model can be mapped to a reduced-dimension system with a derivation similar to the one used by Gleeson in the case of the Watts threshold model~\\cite{watts2002,singh2013}.\n\n\n\\subsection{Reduced-dimension AMEs}\n\\label{ssec:redAMEs}\n\nTo reduce the dimension of Eq.~(\\ref{eq:AMEsThres}), we need to consider system-wide quantities that are more aggregated than ${s_{{\\mathbf{k}}, m}}$. One of them is the probability that a randomly chosen node is an adopter, $\\rho(t) = 1 - {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {s_{{\\mathbf{k}}, m}} (t)$, i.e. the fraction of adopters in the network. The other one is the probability that a randomly chosen neighbour of a susceptible node is an adopter, $\\nu(t) = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} m {s_{{\\mathbf{k}}, m}}(t) / {\\sum_m} k {s_{{\\mathbf{k}}, m}}(t)$.\n\nWe start by proposing an exact solution for the AME system in terms of the following ansatz,\n\n", "itemtype": "equation", "pos": 76160, "prevtext": " \nIf at time $t = 0$ we randomly choose a fraction $\\rho (0) = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\rho_{{\\mathbf{k}}}}(0)$ of nodes as seed for the adoption process, the initial conditions for Eq.~(\\ref{eq:AMEsThres}) are ${s_{{\\mathbf{k}}, m}} (0) = [1 - {\\rho_{{\\mathbf{k}}}}(0)] {B_{k, m}} [\\rho(0)]$, with ${\\rho_{{\\mathbf{k}}}}(0)$ the initial fraction of adopters in class ${\\mathbf{k}}$ and ${B_{k, m}}$ a binomial factor,\n\n", "index": 25, "text": "\\begin{equation}\n\\label{eq:BinomFac}\n{B_{k, m}}(\\rho) = \\binom{k}{m} \\rho^m (1 - \\rho)^{k - m}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"{B_{k,m}}(\\rho)=\\binom{k}{m}\\rho^{m}(1-\\rho)^{k-m}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ρ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mi>k</mi><mi>m</mi></mfrac><mo>)</mo></mrow><mo>⁢</mo><msup><mi>ρ</mi><mi>m</mi></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>ρ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nand $s_{(k,0),m} = {B_{k, m}}(\\nu)$ for $c = 0$, where ${B_{k, m}}$ follows Eq.~(\\ref{eq:BinomFac}). The meaning of the ansatz in Eq.~(\\ref{eq:AMEansatz}) is quite intuitive and considers two processes. First, a susceptible agent with degree $k$ and $m$ adopting neighbours is not selected as part of the initial adoption seed with probability $1 - {\\rho_{{\\mathbf{k}}}}(0)$ and is connected to $m$ adopters with the binomially distributed probability ${B_{k, m}}(\\nu)$. Second, for $m < k\\phi_c$ a susceptible node does not fulfill the threshold rule and can only adopt spontaneously with probability $e^{-{p_r} t}$, since the system is progressively been filled by adopters. Considering these two processes as independent we end up with the product in Eq.~(\\ref{eq:AMEansatz}). Finally, since immune nodes do not adopt and are distributed randomly over the network, $s_{(k,0),m}$ is determined only by a binomial factor.\n\nThe next step is to insert the ansatz~(\\ref{eq:AMEansatz}) into the AME system~(\\ref{eq:AMEsThres}) and derive a set of differential equations for the aggregated quantities $\\rho$ and $\\nu$. Taking the time derivative ${\\dot{s}_{{\\mathbf{k}}, m}}$ of Eq.~(\\ref{eq:AMEansatz}) (i.e. the left-hand side of Eq.~(\\ref{eq:AMEsThres})) we get,\n\n", "itemtype": "equation", "pos": 77540, "prevtext": "\n\nThe solution ${s_{{\\mathbf{k}}, m}}(t)$ of the AME system in Eq.~(\\ref{eq:AMEsThres}) provides a very accurate description of the dynamics of our model, yet its dimension  (i.e. number of equations to solve) grows quadratically with the number of degrees and linearly with the number of threshold values considered. Fortunately, the AMEs for our model can be mapped to a reduced-dimension system with a derivation similar to the one used by Gleeson in the case of the Watts threshold model~\\cite{watts2002,singh2013}.\n\n\n\\subsection{Reduced-dimension AMEs}\n\\label{ssec:redAMEs}\n\nTo reduce the dimension of Eq.~(\\ref{eq:AMEsThres}), we need to consider system-wide quantities that are more aggregated than ${s_{{\\mathbf{k}}, m}}$. One of them is the probability that a randomly chosen node is an adopter, $\\rho(t) = 1 - {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {s_{{\\mathbf{k}}, m}} (t)$, i.e. the fraction of adopters in the network. The other one is the probability that a randomly chosen neighbour of a susceptible node is an adopter, $\\nu(t) = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} m {s_{{\\mathbf{k}}, m}}(t) / {\\sum_m} k {s_{{\\mathbf{k}}, m}}(t)$.\n\nWe start by proposing an exact solution for the AME system in terms of the following ansatz,\n\n", "index": 27, "text": "\\begin{equation}\n\\label{eq:AMEansatz}\n{s_{{\\mathbf{k}}, m}}(t) = [1 - {\\rho_{{\\mathbf{k}}}}(0)] {B_{k, m}} [\\nu(t)] e^{-{p_r} t}\n\\quad \\text{for} \\; m < k\\phi_c  \\; \\text{and} \\; c \\neq 0,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"{s_{{\\mathbf{k}},m}}(t)=[1-{\\rho_{{\\mathbf{k}}}}(0)]{B_{k,m}}[\\nu(t)]e^{-{p_{r%&#10;}}t}\\quad\\text{for}\\;m&lt;k\\phi_{c}\\;\\text{and}\\;c\\neq 0,\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>ν</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><mpadded width=\"+2.8pt\"><mtext>for</mtext></mpadded><mo>⁢</mo><mi>m</mi></mrow><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><msub><mi>ϕ</mi><mi>c</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><mi>c</mi></mrow><mo>≠</mo><mn>0</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nThen, we use the threshold rule~(\\ref{eq:thresRule}) for $m < k\\phi_c$, the ansatz~(\\ref{eq:AMEansatz}) and the binomial identity,\n\n", "itemtype": "equation", "pos": 79006, "prevtext": "\nand $s_{(k,0),m} = {B_{k, m}}(\\nu)$ for $c = 0$, where ${B_{k, m}}$ follows Eq.~(\\ref{eq:BinomFac}). The meaning of the ansatz in Eq.~(\\ref{eq:AMEansatz}) is quite intuitive and considers two processes. First, a susceptible agent with degree $k$ and $m$ adopting neighbours is not selected as part of the initial adoption seed with probability $1 - {\\rho_{{\\mathbf{k}}}}(0)$ and is connected to $m$ adopters with the binomially distributed probability ${B_{k, m}}(\\nu)$. Second, for $m < k\\phi_c$ a susceptible node does not fulfill the threshold rule and can only adopt spontaneously with probability $e^{-{p_r} t}$, since the system is progressively been filled by adopters. Considering these two processes as independent we end up with the product in Eq.~(\\ref{eq:AMEansatz}). Finally, since immune nodes do not adopt and are distributed randomly over the network, $s_{(k,0),m}$ is determined only by a binomial factor.\n\nThe next step is to insert the ansatz~(\\ref{eq:AMEansatz}) into the AME system~(\\ref{eq:AMEsThres}) and derive a set of differential equations for the aggregated quantities $\\rho$ and $\\nu$. Taking the time derivative ${\\dot{s}_{{\\mathbf{k}}, m}}$ of Eq.~(\\ref{eq:AMEansatz}) (i.e. the left-hand side of Eq.~(\\ref{eq:AMEsThres})) we get,\n\n", "index": 29, "text": "\\begin{equation}\n\\label{eq:ansatzINames1}\n{\\dot{s}_{{\\mathbf{k}}, m}} = \\left( \\left[ \\frac{m}{\\nu} - \\frac{k-m}{1-\\nu} \\right] \\dot{\\nu} - {p_r} \\right) {s_{{\\mathbf{k}}, m}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"{\\dot{s}_{{\\mathbf{k}},m}}=\\left(\\left[\\frac{m}{\\nu}-\\frac{k-m}{1-\\nu}\\right]%&#10;\\dot{\\nu}-{p_{r}}\\right){s_{{\\mathbf{k}},m}}.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>s</mi><mo>˙</mo></mover><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>(</mo><mrow><mrow><mrow><mo>[</mo><mrow><mfrac><mi>m</mi><mi>ν</mi></mfrac><mo>-</mo><mfrac><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow></mfrac></mrow><mo>]</mo></mrow><mo>⁢</mo><mover accent=\"true\"><mi>ν</mi><mo>˙</mo></mover></mrow><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nin the right-hand side of Eq.~(\\ref{eq:AMEsThres}) to obtain,\n\n", "itemtype": "equation", "pos": 79329, "prevtext": "\nThen, we use the threshold rule~(\\ref{eq:thresRule}) for $m < k\\phi_c$, the ansatz~(\\ref{eq:AMEansatz}) and the binomial identity,\n\n", "index": 31, "text": "\\begin{equation}\n\\label{eq:binomIdent}\n{B_{k, m-1}}(\\nu) = \\frac{1-\\nu}{\\nu} \\frac{m}{k-m+1} {B_{k, m}}(\\nu),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"{B_{k,m-1}}(\\nu)=\\frac{1-\\nu}{\\nu}\\frac{m}{k-m+1}{B_{k,m}}(\\nu),\" display=\"block\"><mrow><mrow><mrow><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mi>ν</mi></mfrac><mo>⁢</mo><mfrac><mi>m</mi><mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo>+</mo><mn>1</mn></mrow></mfrac><mo>⁢</mo><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nEquating Eqs.~(\\ref{eq:ansatzINames1}) and~(\\ref{eq:ansatzINames2}) as in the AME system~(\\ref{eq:AMEsThres}) leads to,\n\n", "itemtype": "equation", "pos": 79516, "prevtext": "\nin the right-hand side of Eq.~(\\ref{eq:AMEsThres}) to obtain,\n\n", "index": 33, "text": "\\begin{equation}\n\\label{eq:ansatzINames2}\n-{F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}} -{\\beta_s} (k - m) {s_{{\\mathbf{k}}, m}} + {\\beta_s} (k - m + 1) {s_{{\\mathbf{k}}, m-1}} = \\left[ -{p_r} + {\\beta_s} \\left( m - k + \\frac{1-\\nu}{\\nu}m \\right) \\right] {s_{{\\mathbf{k}}, m}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"-{F_{{\\mathbf{k}},m}}{s_{{\\mathbf{k}},m}}-{\\beta_{s}}(k-m){s_{{\\mathbf{k}},m}}%&#10;+{\\beta_{s}}(k-m+1){s_{{\\mathbf{k}},m-1}}=\\left[-{p_{r}}+{\\beta_{s}}\\left(m-k+%&#10;\\frac{1-\\nu}{\\nu}m\\right)\\right]{s_{{\\mathbf{k}},m}}.\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mo>-</mo><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>-</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>+</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow><mo>=</mo><mrow><mrow><mo>[</mo><mrow><mrow><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub></mrow><mo>+</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mi>m</mi><mo>-</mo><mi>k</mi></mrow><mo>+</mo><mrow><mfrac><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mi>ν</mi></mfrac><mo>⁢</mo><mi>m</mi></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\na condition on $\\nu$ so that the ansatz~(\\ref{eq:AMEansatz}) is a solution of Eq.~(\\ref{eq:AMEsThres}). This differential equation has the initial condition $\\nu(0) = \\rho(0)$, obtained by evaluating Eq.~(\\ref{eq:AMEansatz}) at $t = 0$ and comparing with the expression $[1 - {\\rho_{{\\mathbf{k}}}}(0)] {B_{k, m}} [\\rho(0)]$, which corresponds to a random distribution of initial adopters among ${\\mathbf{k}}$ classes. Furthermore, by assuming a (yet to be determined) function $g(\\nu, t)$ such that $\\dot{\\nu} = g(\\nu, t) - \\nu$, Eq.~(\\ref{eq:condNu}) reduces to,\n\n", "itemtype": "equation", "pos": 79928, "prevtext": "\nEquating Eqs.~(\\ref{eq:ansatzINames1}) and~(\\ref{eq:ansatzINames2}) as in the AME system~(\\ref{eq:AMEsThres}) leads to,\n\n", "index": 35, "text": "\\begin{equation}\n\\label{eq:condNu}\n\\dot{\\nu} = {\\beta_s} (1 - \\nu),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\nu}={\\beta_{s}}(1-\\nu),\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>ν</mi><mo>˙</mo></mover><mo>=</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\nNow, we consider the following general result derived by Gleeson in~\\cite{gleeson2013} (Eqs.~(F6)--(F10) therein),\n\n", "itemtype": "equation", "pos": 80575, "prevtext": "\na condition on $\\nu$ so that the ansatz~(\\ref{eq:AMEansatz}) is a solution of Eq.~(\\ref{eq:AMEsThres}). This differential equation has the initial condition $\\nu(0) = \\rho(0)$, obtained by evaluating Eq.~(\\ref{eq:AMEansatz}) at $t = 0$ and comparing with the expression $[1 - {\\rho_{{\\mathbf{k}}}}(0)] {B_{k, m}} [\\rho(0)]$, which corresponds to a random distribution of initial adopters among ${\\mathbf{k}}$ classes. Furthermore, by assuming a (yet to be determined) function $g(\\nu, t)$ such that $\\dot{\\nu} = g(\\nu, t) - \\nu$, Eq.~(\\ref{eq:condNu}) reduces to,\n\n", "index": 37, "text": "\\begin{equation}\n\\label{eq:condBeta}\n{\\beta_s} = \\frac{g(\\nu, t) - \\nu}{1 - \\nu}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"{\\beta_{s}}=\\frac{g(\\nu,t)-\\nu}{1-\\nu}.\" display=\"block\"><mrow><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>=</mo><mfrac><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>ν</mi></mrow><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwith $z = \\sum_k k P(k)$ the average degree in the network. Eq.~(\\ref{eq:GleesonEq}) is valid for functions ${s_{{\\mathbf{k}}, m}}$ and $\\nu$ that satisfy Eqs.~(\\ref{eq:AMEsThres}) and (\\ref{eq:condNu}) respectively, for any ${F_{{\\mathbf{k}}, m}}$ and random initial conditions on ${s_{{\\mathbf{k}}, m}}$ and $\\nu$, and is thus applicable in our case. Our goal here is to use Eq.~(\\ref{eq:GleesonEq}) to find an expression for $g(\\nu)$ and therefore write the differential equation~(\\ref{eq:condNu}) explicitly. Noting that the left-hand side of Eq.~(\\ref{eq:GleesonEq}) is the denominator in the definition~(\\ref{eq:rateBs}) of ${\\beta_s}$ and that $F_{(k,0),m} = 0$ (i.e. immune nodes do not adopt), Eq.~(\\ref{eq:rateBs}) gives,\n\n", "itemtype": "equation", "pos": 80788, "prevtext": "\n\nNow, we consider the following general result derived by Gleeson in~\\cite{gleeson2013} (Eqs.~(F6)--(F10) therein),\n\n", "index": 39, "text": "\\begin{equation}\n\\label{eq:GleesonEq}\n{\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {s_{{\\mathbf{k}}, m}} = z (1 - \\nu)^2,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}(k-m){s_{{\\mathbf{k}},m}}=z(%&#10;1-\\nu)^{2},\" display=\"block\"><mrow><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mi>z</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere we have written ${P({{\\mathbf{k}}})}$ explicitly as ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$, in order to notice the dependence on $r$. Then, we insert the ansatz~(\\ref{eq:AMEansatz}) (with its special case $s_{(k,0),m} = {B_{k, m}}(\\nu)$ for immune nodes), as well as the identities $(k - m) {B_{k, m}}(\\nu) = k (1 - \\nu) {B_{k-1, m}}(\\nu)$ and ${\\sum_{m < k\\phi_c}} {B_{k-1, m}}(\\nu) = 1 - {\\sum_{m \\geq k\\phi_c}} {B_{k-1, m}}(\\nu)$ to obtain,\n\n", "itemtype": "equation", "pos": 81671, "prevtext": "\nwith $z = \\sum_k k P(k)$ the average degree in the network. Eq.~(\\ref{eq:GleesonEq}) is valid for functions ${s_{{\\mathbf{k}}, m}}$ and $\\nu$ that satisfy Eqs.~(\\ref{eq:AMEsThres}) and (\\ref{eq:condNu}) respectively, for any ${F_{{\\mathbf{k}}, m}}$ and random initial conditions on ${s_{{\\mathbf{k}}, m}}$ and $\\nu$, and is thus applicable in our case. Our goal here is to use Eq.~(\\ref{eq:GleesonEq}) to find an expression for $g(\\nu)$ and therefore write the differential equation~(\\ref{eq:condNu}) explicitly. Noting that the left-hand side of Eq.~(\\ref{eq:GleesonEq}) is the denominator in the definition~(\\ref{eq:rateBs}) of ${\\beta_s}$ and that $F_{(k,0),m} = 0$ (i.e. immune nodes do not adopt), Eq.~(\\ref{eq:rateBs}) gives,\n\n", "index": 41, "text": "\\begin{align}\n\\label{eq:betaExpl1}\n{\\beta_s} &= \\frac{1 - r}{z (1 - \\nu)^2} \\left[ {p_r} {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m < k\\phi_c}} (k - m) {s_{{\\mathbf{k}}, m}} + {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m \\geq k\\phi_c}} (k - m) {s_{{\\mathbf{k}}, m}} \\right] \\nonumber\\\\\n&= \\frac{1}{z (1 - \\nu)^2} \\left[ {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} (k - m) {s_{{\\mathbf{k}}, m}} - r \\sum_k P(k) {\\sum_m} (k - m) s_{(k,0),m} \\right. \\nonumber\\\\\n&\\quad \\left. - (1 - r) (1 - {p_r}) {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m < k\\phi_c}} (k - m) {s_{{\\mathbf{k}}, m}} \\right],\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\beta_{s}}\" display=\"inline\"><msub><mi>β</mi><mi>s</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1-r}{z(1-\\nu)^{2}}\\left[{p_{r}}{\\sum_{{\\mathbf{k}}|c\\neq 0%&#10;}}P(k)P(c){\\sum_{m&lt;k\\phi_{c}}}(k-m){s_{{\\mathbf{k}},m}}+{\\sum_{{\\mathbf{k}}|c%&#10;\\neq 0}}P(k)P(c){\\sum_{m\\geq k\\phi_{c}}}(k-m){s_{{\\mathbf{k}},m}}\\right]\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mrow><mi>z</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{z(1-\\nu)^{2}}\\left[{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}%&#10;}})}{\\sum_{m}}(k-m){s_{{\\mathbf{k}},m}}-r\\sum_{k}P(k){\\sum_{m}}(k-m)s_{(k,0),m%&#10;}\\right.\" display=\"inline\"><mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>z</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mstyle><mrow><mo>[</mo><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mstyle><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>-</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>-</mo><mi>r</mi><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder></mstyle><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>-</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><msub><mi>s</mi><mrow><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\quad\\left.-(1-r)(1-{p_{r}}){\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P(c)%&#10;{\\sum_{m&lt;k\\phi_{c}}}(k-m){s_{{\\mathbf{k}},m}}\\right],\" display=\"inline\"><mrow><mi mathvariant=\"normal\"> </mi><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub><mo stretchy=\"false\">)</mo></mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>-</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>]</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\nA comparison of Eqs.~(\\ref{eq:condBeta}) and~(\\ref{eq:betaExpl2}) gives us the following expression for $g(\\nu, t)$,\n\n", "itemtype": "equation", "pos": 82816, "prevtext": "\nwhere we have written ${P({{\\mathbf{k}}})}$ explicitly as ${P({{\\mathbf{k}}})} = r P(k)$ for $c = 0$ and ${P({{\\mathbf{k}}})} = (1 - r) P(k) P(c)$ for $c > 0$, in order to notice the dependence on $r$. Then, we insert the ansatz~(\\ref{eq:AMEansatz}) (with its special case $s_{(k,0),m} = {B_{k, m}}(\\nu)$ for immune nodes), as well as the identities $(k - m) {B_{k, m}}(\\nu) = k (1 - \\nu) {B_{k-1, m}}(\\nu)$ and ${\\sum_{m < k\\phi_c}} {B_{k-1, m}}(\\nu) = 1 - {\\sum_{m \\geq k\\phi_c}} {B_{k-1, m}}(\\nu)$ to obtain,\n\n", "index": 43, "text": "\\begin{align}\n\\label{eq:betaExpl2}\n{\\beta_s} &= \\frac{1}{1 - \\nu} \\Bigg( (1 - r) \\Bigg[ 1 - (1 - {p_r}) e^{-{p_r} t} \\Bigg. \\Bigg. \\nonumber\\\\\n&\\quad \\left. \\left. + (1 - {p_r}) e^{-{p_r} t} {\\sum_{{\\mathbf{k}} | c \\neq 0}} \\frac{k}{z} P(k) P(c) \\left( {\\rho_{{\\mathbf{k}}}}(0) + [1 - {\\rho_{{\\mathbf{k}}}}(0)] {\\sum_{m \\geq k\\phi_c}} {B_{k-1, m}}(\\nu) \\right) \\right] - \\nu \\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\beta_{s}}\" display=\"inline\"><msub><mi>β</mi><mi>s</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{1-\\nu}\\Bigg{(}(1-r)\\Bigg{[}1-(1-{p_{r}})e^{-{p_{r}}t}%&#10;\\Bigg{.}\\Bigg{.}\" display=\"inline\"><mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>1</mn><mo>-</mo><mi>ν</mi></mrow></mfrac></mstyle><mrow><mo maxsize=\"260%\" minsize=\"260%\">(</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mn>1</mn><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub><mo stretchy=\"false\">)</mo></mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo mathsize=\"260%\" stretchy=\"false\">.</mo><mo mathsize=\"260%\" stretchy=\"false\">.</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\quad\\left.\\left.+(1-{p_{r}})e^{-{p_{r}}t}{\\sum_{{\\mathbf{k}}|c%&#10;\\neq 0}}\\frac{k}{z}P(k)P(c)\\left({\\rho_{{\\mathbf{k}}}}(0)+[1-{\\rho_{{\\mathbf{k%&#10;}}}}(0)]{\\sum_{m\\geq k\\phi_{c}}}{B_{k-1,m}}(\\nu)\\right)\\right]-\\nu\\right).\" display=\"inline\"><mrow><mrow><mi mathvariant=\"normal\"> </mi><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub><mo stretchy=\"false\">)</mo></mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mstyle displaystyle=\"true\"><mfrac><mi>k</mi><mi>z</mi></mfrac></mstyle><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo>(</mo><msub><mi>ρ</mi><mi>𝐤</mi></msub><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mrow><mo stretchy=\"false\">[</mo><mn>1</mn><mo>-</mo><msub><mi>ρ</mi><mi>𝐤</mi></msub><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">]</mo></mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><msub><mi>B</mi><mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo>,</mo><mi>m</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mo>)</mo></mrow><mo>]</mo></mrow><mo>-</mo><mi>ν</mi><mo>)</mo><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere we define ${f_t}$ as ${f_t} = 1 - (1 - {p_r}) e^{-{p_r} t}$. Thus, the AME system~(\\ref{eq:AMEsThres}) gets reduced to the differential equation $\\dot{\\nu} = g(\\nu, t) - \\nu$, with $g(\\nu, t)$ given explicitly by Eq.~(\\ref{eq:gFactor}).\n\nEven though the equation $\\dot{\\nu} = g(\\nu, t) - \\nu$ is closed and in this sense equivalent to Eq.~(\\ref{eq:AMEsThres}), we can also derive the corresponding equation for $\\rho$, since we are mainly interested in the temporal evolution of the fraction of adopters in the network. From the definition of $\\rho$ and Eq.~(\\ref{eq:AMEsThres}) we have,\n\n", "itemtype": "equation", "pos": 83330, "prevtext": "\n\nA comparison of Eqs.~(\\ref{eq:condBeta}) and~(\\ref{eq:betaExpl2}) gives us the following expression for $g(\\nu, t)$,\n\n", "index": 45, "text": "\\begin{equation}\n\\label{eq:gFactor}\ng(\\nu, t) = (1 - r) \\left( {f_t} + (1 - {f_t}) {\\sum_{{\\mathbf{k}} | c \\neq 0}} \\frac{k}{z} P(k) P(c) \\left[ {\\rho_{{\\mathbf{k}}}}(0) + [1 - {\\rho_{{\\mathbf{k}}}}(0)] \\sum_{m \\geq k\\phi_c} {B_{k-1, m}}(\\nu) \\right] \\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"g(\\nu,t)=(1-r)\\left({f_{t}}+(1-{f_{t}}){\\sum_{{\\mathbf{k}}|c\\neq 0}}\\frac{k}{z%&#10;}P(k)P(c)\\left[{\\rho_{{\\mathbf{k}}}}(0)+[1-{\\rho_{{\\mathbf{k}}}}(0)]\\sum_{m%&#10;\\geq k\\phi_{c}}{B_{k-1,m}}(\\nu)\\right]\\right),\" display=\"block\"><mrow><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>f</mi><mi>t</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>t</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder><mrow><mfrac><mi>k</mi><mi>z</mi></mfrac><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder><mrow><msub><mi>B</mi><mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhere the second term in the right-hand side telescopes to zero. Then, we use an algebraic manipulation similar to that of Eqs.~(\\ref{eq:betaExpl1}) and~(\\ref{eq:betaExpl2}) to obtain,\n\n", "itemtype": "equation", "pos": 84199, "prevtext": "\nwhere we define ${f_t}$ as ${f_t} = 1 - (1 - {p_r}) e^{-{p_r} t}$. Thus, the AME system~(\\ref{eq:AMEsThres}) gets reduced to the differential equation $\\dot{\\nu} = g(\\nu, t) - \\nu$, with $g(\\nu, t)$ given explicitly by Eq.~(\\ref{eq:gFactor}).\n\nEven though the equation $\\dot{\\nu} = g(\\nu, t) - \\nu$ is closed and in this sense equivalent to Eq.~(\\ref{eq:AMEsThres}), we can also derive the corresponding equation for $\\rho$, since we are mainly interested in the temporal evolution of the fraction of adopters in the network. From the definition of $\\rho$ and Eq.~(\\ref{eq:AMEsThres}) we have,\n\n", "index": 47, "text": "\\begin{align}\n\\label{eq:rhoDeriv1}\n\\dot{\\rho} = - {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {\\dot{s}_{{\\mathbf{k}}, m}} &= {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}} \\nonumber\\\\\n&\\quad + {\\beta_s} {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} \\big[ (k - m) {s_{{\\mathbf{k}}, m}} - (k - m + 1) {s_{{\\mathbf{k}}, m-1}} \\big],\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{\\rho}=-{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}{%&#10;\\dot{s}_{{\\mathbf{k}},m}}\" display=\"inline\"><mrow><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover><mo>=</mo><mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><msub><mover accent=\"true\"><mi>s</mi><mo>˙</mo></mover><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle={\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}{F_{{\\mathbf{k%&#10;}},m}}{s_{{\\mathbf{k}},m}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\quad+{\\beta_{s}}{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m%&#10;}}\\big{[}(k-m){s_{{\\mathbf{k}},m}}-(k-m+1){s_{{\\mathbf{k}},m-1}}\\big{]},\" display=\"inline\"><mrow><mrow><mi mathvariant=\"normal\"> </mi><mo>+</mo><mrow><msub><mi>β</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>k</mi><mo>-</mo><mi>m</mi></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\">]</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nIn this way, Eqs.~(\\ref{eq:rhoDeriv1}) and~(\\ref{eq:rhoDeriv2}) can be rewritten as $\\dot{\\rho} = h(\\nu, t) - \\rho$, where,\n\n", "itemtype": "equation", "pos": 84786, "prevtext": "\nwhere the second term in the right-hand side telescopes to zero. Then, we use an algebraic manipulation similar to that of Eqs.~(\\ref{eq:betaExpl1}) and~(\\ref{eq:betaExpl2}) to obtain,\n\n", "index": 49, "text": "\\begin{align}\n\\label{eq:rhoDeriv2}\n& {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {F_{{\\mathbf{k}}, m}} {s_{{\\mathbf{k}}, m}} = (1 - r) \\left( {p_r} {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m < k\\phi_c}} {s_{{\\mathbf{k}}, m}} + {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m \\geq k\\phi_c}} {s_{{\\mathbf{k}}, m}} \\right) \\nonumber\\\\\n&= (1 - r) \\left( 1 - (1 - r) (1 - {p_r}) {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_{m < k\\phi_c}} {s_{{\\mathbf{k}}, m}} \\right) - \\rho \\nonumber\\\\\n&= (1 - r) \\left( {f_t} + (1 - {f_t}) {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) \\left[ {\\rho_{{\\mathbf{k}}}}(0) + [1 - {\\rho_{{\\mathbf{k}}}}(0)] \\sum_{m \\geq k\\phi_c} {B_{k, m}}(\\nu) \\right] \\right) - \\rho.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}{F_{{\\mathbf{k}%&#10;},m}}{s_{{\\mathbf{k}},m}}=(1-r)\\left({p_{r}}{\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P%&#10;(c){\\sum_{m&lt;k\\phi_{c}}}{s_{{\\mathbf{k}},m}}+{\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P%&#10;(c){\\sum_{m\\geq k\\phi_{c}}}{s_{{\\mathbf{k}},m}}\\right)\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder></mstyle><mrow><msub><mi>F</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=(1-r)\\left(1-(1-r)(1-{p_{r}}){\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P(%&#10;c){\\sum_{m&lt;k\\phi_{c}}}{s_{{\\mathbf{k}},m}}\\right)-\\rho\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>p</mi><mi>r</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>&lt;</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>-</mo><mi>ρ</mi></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=(1-r)\\left({f_{t}}+(1-{f_{t}}){\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P%&#10;(c)\\left[{\\rho_{{\\mathbf{k}}}}(0)+[1-{\\rho_{{\\mathbf{k}}}}(0)]\\sum_{m\\geq k%&#10;\\phi_{c}}{B_{k,m}}(\\nu)\\right]\\right)-\\rho.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>f</mi><mi>t</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>t</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder></mstyle><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder></mstyle><mrow><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>-</mo><mi>ρ</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\nJoining all of these results, the AME system~(\\ref{eq:AMEsThres}) gets reduced to the system of two ordinary differential equations,\n\\begin{subequations}\n\\label{eq:reducedAMEs}\n\n", "itemtype": "equation", "pos": 85637, "prevtext": "\nIn this way, Eqs.~(\\ref{eq:rhoDeriv1}) and~(\\ref{eq:rhoDeriv2}) can be rewritten as $\\dot{\\rho} = h(\\nu, t) - \\rho$, where,\n\n", "index": 51, "text": "\\begin{equation}\n\\label{eq:hFactor}\nh(\\nu, t) = (1 - r) \\left( {f_t} + (1 - {f_t}) {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) \\left[ {\\rho_{{\\mathbf{k}}}}(0) + [1 - {\\rho_{{\\mathbf{k}}}}(0)] \\sum_{m \\geq k\\phi_c} {B_{k, m}}(\\nu) \\right] \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"h(\\nu,t)=(1-r)\\left({f_{t}}+(1-{f_{t}}){\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P(c)%&#10;\\left[{\\rho_{{\\mathbf{k}}}}(0)+[1-{\\rho_{{\\mathbf{k}}}}(0)]\\sum_{m\\geq k\\phi_{%&#10;c}}{B_{k,m}}(\\nu)\\right]\\right).\" display=\"block\"><mrow><mrow><mrow><mi>h</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>f</mi><mi>t</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>t</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>ρ</mi><mi>𝐤</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>≥</mo><mrow><mi>k</mi><mo>⁢</mo><msub><mi>ϕ</mi><mi>c</mi></msub></mrow></mrow></munder><mrow><msub><mi>B</mi><mrow><mi>k</mi><mo>,</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\n\\end{subequations}\nwhere $\\rho(t)$ is the fraction of adopters in the network, $\\nu(t)$ is the probability that a randomly chosen neighbour of a susceptible node is an adopter, and the initial conditions are $\\rho(0) = \\nu(0) = 0$. Here,\n\n", "itemtype": "equation", "pos": 20437, "prevtext": "\n\n\\title{\\textbf{Local cascades induced global contagion: \\\\ How heterogeneous thresholds, exogenous effects, and unconcerned behaviour govern online adoption spreading}}\n\n\\author[1]{M\\'arton Karsai\n\\thanks{Corresponding author: marton.karsai@ens-lyon.fr}}\n\\affil[1]{\\normalsize{Laboratoire de l'Informatique du Parall\\'elisme, INRIA-UMR 5668, IXXI, ENS de Lyon, 69364 Lyon, France}}\n\n\\author[2,3]{Gerardo I\\~niguez}\n\\affil[2]{\\normalsize{Department of Computer Science, School of Science, Aalto University, 00076, Finland}}\n\\affil[3]{\\normalsize{Centro de Investigaci{\\'o}n y Docencia Econ{\\'o}micas, CONACYT, 01210 M{\\'e}xico D.F., Mexico}}\n\n\\author[4,5]{Riivo Kikas}\n\\affil[4]{\\normalsize{Institute of Computer Science, University of Tartu, 50409 Tartu, Estonia}}\n\\affil[5]{\\normalsize{Software Technology and Applications Competence Center (STACC), 51003 Tartu, Estonia}}\n\n\\author[2]{Kimmo Kaski}\n\n\\author[6,7]{J\\'anos Kert\\'esz}\n\\affil[6]{\\normalsize{Center for Network Science, Central European University, 1051 Budapest, Hungary}}\n\\affil[7]{\\normalsize{Institute of Physics, Budapest University of Technology and Economics, 1111 Budapest, Hungary}}\n\n\\date{}\n\n\\maketitle\n\n\\textbf{keywords:} cascading behaviour, social spreading phenomena, complex contagion, adoption thresholds\n\n\n\\begin{abstract}\nAdoption of innovations, products or online services is commonly interpreted as a spreading process driven to large extent by social influence and conditioned by the needs and capacities of individuals. To model this process one usually introduces behavioural threshold mechanisms, which can give rise to the evolution of global cascades if the system satisfies a set of conditions. However, these models do not address temporal aspects of the emerging cascades, which in real systems may evolve through various pathways ranging from slow to rapid patterns. Here we fill this gap through the analysis and modelling of product adoption in the world's largest voice over internet service, the social network of Skype. We provide empirical evidence about the heterogeneous distribution of fractional behavioural thresholds, which appears to be independent of the degree of adopting egos. We show that the structure of real-world adoption clusters is radically different from previous theoretical expectations, since vulnerable adoptions---induced by a single adopting neighbour---appear to be important only locally, while spontaneous adopters arriving at a constant rate and the involvement of unconcerned individuals govern the global emergence of social spreading.\n\\end{abstract}\n\n\\section*{Introduction}\n\nSpreading of opinions, frauds, behavioural patterns, and product adoptions are all examples of social contagion phenomena where collective patterns emerge due to correlated decisions of a large number of individuals. Although these choices are personal, they are not independent but potentially driven by several processes such as social influence \\cite{Centola2010Spread}, homophily \\cite{McPherson2001}, and information arriving from external sources like news or mass media \\cite{Toole2011Modeling}. Social contagion evolves over networks of interconnected individuals, where links associated with social ties transfer influence between peers \\cite{RevModPhys.81.591}. Several earlier studies aimed to identify the dominant mechanisms at play in social contagion processes \\cite{Rogers2003Diffusion, Granovetter1978Threshold,schelling1969models,Axelrod1997Dissemination}. One key element, termed behavioural threshold by Granovetter \\cite{Granovetter1978Threshold}, is defined as \\textit{``the number or proportion of others who must make one decision before a given actor does so''}. Following this idea various network models have been introduced \\cite{Watts2002Simple,Handjani1997Survival,valente-thresholds-1996,Watts2007Influentials,Melnik2013Multistage,Gomez2010Modeling} to understand the threshold-driven spreading, commonly known as \\textit{complex contagion} \\cite{Centola2007Complex}. Although these models are related to a larger set of collective dynamics, they are particularly different from \\textit{simple contagion} where the exposure of nodes is driven by independent contagion stimuli \\cite{Barrat2008Dynamical, Bass1969}. In addition, collective adoption patterns may appear as a consequence of homophilic structural correlations, where connected individuals adopt due to their similar interests and not due to direct social influence. Distinguishing between the effects of social influence and homophily at the individual level remains as a challenge \\cite{Aral2009,Shalizi2011}. Furthermore, in real social spreading phenomena all these mechanisms are arguably present. However, while in the case of homophily the  \nadoption behaviour is only seemingly correlated, and for simple contagion only the number of exposures matters, in complex contagion the fraction of adopting neighbours relative to the total number of partners determines whether a node adopts or not, capturing the natural mechanisms involved in individuals' decision makings \\cite{Holt06,bikhchandani-hirshleifer-welch-92, Karsai2014Complex}. Due to this additional complexity, threshold models are able to emulate system-wide adoption patterns known as global cascades.\n\nBehavioural cascades are rare but potentially stupendous social spreading phenomena, where collective patterns of exposure emerge as a consequence of small initial perturbations. Some examples are the rapid emergence of political and grass-root movements \\cite{GonzalezBailon2011Dynamics,BorgeHolthoefer2011Structural,EllisInformation}, fast spreading of information \\cite{Dow2013Anatomy,Gruhl2004Information,Banos2013Role, Watts2007Influentials,Hale2013Regime,Leskovec2005Patterns,Leskovec2007Dynamics,Goel2012Structure} or behavioural patterns \\cite{Fowler2009Cooperative}, etc. The characterisation \\cite{Goel2012Structure, BorgeHolthoefer2013Cascading,Hackett2013Cascades,Gleeson2008Cascades,Brummitt2011,GhoshCascadesArxiv2010} and modelling \\cite{Watts2002Simple,Hurd2013Watts, Singh2013Thresholdlimited,Gleeson2007Seed} of such processes have received plenty of attention and provide some basic understanding of the conditions and structure of empirical and synthetic cascades. However, these studies commonly fail in addressing the temporal dynamics of the emerging cascades, which may vary considerably between different cases of social contagion. Moreover, they have not answered why real-world cascades can evolve through various dynamic pathways ranging from slow to rapid patterning, especially in systems where the threshold mechanisms play a role and social phenomena spread globally. Besides the case of rapid cascading mentioned above, an example of the other extreme is the propagation of products in social networks \\cite{Bass1969}, where adoption evolves gradually even if it is driven by threshold mechanisms and may cover a large fraction of the total population \\cite{Karsai2014Complex}. This behaviour characterises the adoption of online services such as Facebook, Twitter, LinkedIn and Skype (Fig.\\ref{fig:1}a), since their yearly maximum relative growth of cumulative adoption \\cite{SocialMedia} (for definition see Material and Methods (MM)) is lower than in the case of rapid cascades as suggested e.g. by the Watts threshold (WT) model.\n\nTo fill this gap in the modelling of social diffusion, here we will analyse and model real-world examples of social contagion phenomena. Our aim is to identify the crucial mechanisms necessary to consider in models of complex contagion to match them better with reality, and define a model that incorporates these mechanisms and captures the possible dynamics leading to the emergence of real-world global cascades. We follow the adoption dynamics of the Skype paid service ``buy credit'' for $89$ months since 2004, which evolves over the social network of one of the largest voice over internet providers in the world. Data includes the time of first payment of each user, an individual and conscious action that tracks adoption behaviour. In addition we follow the ``subscription\" service over $42$ months since 2008 (for results see Supplementary Information [SI]). In contrast to other empirical studies where incomplete knowledge about the underlying social network leads to unavoidable bias \\cite{Karsai2014Complex},  we use here the largest connected component of the aggregated free Skype service as the underlying structure, where nodes are Skype users and links confirmed contacts between them. This is a good approximation since it maps all connections in the Skype social network without sampling, and the paid service is only available for individuals already enrolled in the Skype network. The underlying structure is an aggregate from September 2003 to November 2011 (i.e. over $99$ months) and contains roughly 4.4 billion links and 510 million registered users worldwide \\cite{SkypeIPO}. The data is fully anonymised and considers only confirmed connections between users (for more data details see SI).\n\nIn what follows we first provide empirical evidence of the distribution of individual adoption thresholds and other structural and dynamical features of a worldwide adoption cluster. We incorporate the observed structural and threshold heterogeneities into a dynamical threshold model where multiple nodes adopting spontaneously (i.e. firstly among their neighbours) are allowed \\cite{Ruan2015}. We find that if the fraction of users who reject to adopt the product is large, the system enters a quenched state where the evolution and structure of the global adoption cluster is very similar to our empirical observations. Model calculations and the analysis of the real social contagion process suggest that the evolving structure of an adoption cluster differs radically from what has been proposed earlier \\cite{Watts2002Simple}, since it is triggered by several spontaneous adoptions arriving at a constant rate, while stable adopters who are initially resisting exposure, are actually responsible for the emergence of global social adoption (Fig.~\\ref{fig:1}b and c).\n\n\\section*{Results}\n\nSocial contagion phenomena can be modelled as binary-state processes evolving on networks and driven by threshold mechanisms. In these systems individuals are represented by nodes, each being either in a susceptible (0) or adopter (1) state and influencing each other by transferring information via social ties \\cite{Granovetter1978Threshold}. Nodes are connected in a network with degree distribution $P(k)$ and average degree $z = \\langle k \\rangle$. In addition, each node has an individual threshold $\\phi \\in [0, 1]$ drawn from a distribution $P(\\phi)$ with average $w = \\langle \\phi \\rangle$. This threshold determines the minimum fraction of exposed neighbours that triggers adoption and captures the resistance of an individual against engaging in spreading behaviour. Once a node reaches its threshold, it switches state from $0$ to $1$ and keeps it until the end of the dynamics. In his seminal paper about threshold dynamics, Watts \\cite{Watts2002Simple} classified nodes into three categories based on their threshold and degree. He identified {\\it innovator} nodes that spontaneously change state to $1$, thus starting the process. Such nodes have a trivial threshold $\\phi=0$. Then there are nodes with threshold $0 < \\phi \\leq 1/k$, called {\\it vulnerable}, which need one adopting neighbour before their own adoption. Finally, there are more resilient nodes with threshold $\\phi>1/k$, denoted as {\\it stable}, referring to individuals in need of strong social influence to follow the actions of their acquaintances.\n\nIn the WT model \\cite{Watts2002Simple}, small perturbations (like the spontaneous adoption of a single seed node) can trigger global cascading patterns.  However, their emergence is subject to the so-called {\\it cascade condition}: the innovator seed has to be linked to a percolating vulnerable cluster, which adopts immediately afterwards and further triggers a global cascade (i.e. a set of adopters larger than a fixed fraction of the finite network). The cascade condition is satisfied if the network is inside a bounded regime in $(w, z)$-space \\cite{Watts2002Simple}. This regime depends on degree and threshold heterogeneities \\cite{Watts2002Simple} and may change its shape if several innovators start the process \\cite{Singh2013Thresholdlimited}.\n\n\\subsection*{Empirical observations}\n\nDegree and threshold heterogeneities are indeed present in the social network of Skype. The degree distribution $P(k)$ is well approximated by a lognormal function $P(k) \\propto k^{-1} e^{-(\\ln k - \\mu_D)^2/(2\\sigma_D^2)}$ ($k \\geq {k_{\\mathrm{min}}}$) with parameters $\\mu_D=1.2$, $\\sigma_D=1.39$ and ${k_{\\mathrm{min}}}=1$ (Fig.~\\ref{fig:1}d), giving an average degree $z = 8.56$ (for goodness of fit see SI). Moreover, at the time of adoption we can measure the threshold $\\phi=\\Phi_k/k$ of a user by counting the number $\\Phi_k$ of its neighbours who have adopted the service earlier. We then group users by degree and calculate the distribution $P(\\Phi_k)$ of the integer threshold $\\Phi_k$ \\cite{Gleeson2008Cascades} (Fig.~\\ref{fig:1}e). By using the scaling relation $P(\\Phi_k, k) = k P(\\Phi_k/k)$ all distributions collapse to a master curve well approximated by a lognormal function $P(\\phi) \\propto \\phi^{-1} e^{-(\\ln\\phi - \\mu_T)^2/(2\\sigma_T^2)}$, with parameters $\\mu_T=-2$ and $\\sigma_T=1$ as constrained by the average threshold $w = 0.19$ (see MM and SI). Note that we observe qualitatively the same scaling and lognormal shape of the threshold distribution for another service (see SI). These empirical observations, in addition to the broad degree distribution, provide quantitative evidence about the heterogeneous nature of adoption thresholds.\n\n\\begin{figure*}[t]\n\\centering\n\\includegraphics[width=0.9\\textwidth,angle=0]{Fig1.pdf}\n\\caption{\\textbf{Structure and dynamics of online service adoption.} \\textbf{(a)} Yearly maximum relative growth rate (RGR) of cumulative adoption (see MM) for several online social-communication services \\cite{SocialMedia}, including three Skype paid services (s1 - \"subscription\", s2  - \"voicemail\", and s3 - \"buy credit\"). The red bar corresponds to a rapid cascade of adoption suggested by the Watts threshold (WT) model, while the green bar is the model prediction for Skype s3. \\textbf{(b-c)} Snowball sample of the Skype social network (gray links) with nodes and links coloured according to their adoption state: multiple innovators (green nodes), induced small vulnerable trees (red nodes and links), and the triggered connected stable cluster (blue nodes and links). Note that some vulnerable and stable clusters seemingly appear without an innovator seed due to the finite distance used in the snowball sampling method. \\textbf{(d)} Degree distribution $P(k)$ of the Skype network (gray/blue circles for raw/binned data) on double log-scale with arbitrary base $n$. $P(k)$ is fitted by a lognormal distribution (see MM and SI) with parameters $\\mu_D=1.2$ and $\\sigma_D=1.39$, and average $z = 8.56$ (red line). \\textbf{(e)} Distribution $P(\\Phi_k)$ of integer thresholds $\\Phi_k$ for several degree groups in Skype s3 (inset). By using $P(\\Phi_k, k) = k P(\\Phi_k/k)$, these curves collapse to a master curve approximated by a lognormal function (dashed line in main panel) with parameters $\\mu_T=-2$ and $\\sigma_T=1$, as constrained by the average threshold $w = 0.19$ (see MM and SI). \\textbf{(f)} Adoption rate of innovators [$R_i(t)$], vulnerable nodes [$R_v(t)$], and stable nodes [$R_s(t)$], as well as net service adoption rate [$R(t)$]. Rates are measured with a 1-month time window, while $q$ and $\\tau$ are arbitrary constants. The shaded area indicates the regime where innovators adopt approximately with constant rate.\n\\label{fig:1}}\n\\end{figure*}\n\nSince we know the complete structure of the online social network, as well as the first time of service usage for all adopters, we can follow the temporal evolution of the adoption dynamics. By counting the number of adopting neighbours of an ego, we identify innovators ($\\Phi_k=0$), and vulnerable ($\\Phi_k=1$) or stable ($\\Phi_k>1$) nodes. The adoption rates for these categories behave rather differently from previous suggestions \\cite{Watts2002Simple} (Fig.~\\ref{fig:1}f). First, there is not only one seed but an increasing fraction of innovators in the system who, after an initial period, adopt approximately at a constant rate. Second, vulnerable nodes adopt approximately with the same rate as innovators suggesting a strong correlation between these types of adoption. Third, the overall adoption process accelerates due to the increasing rate of stable adoptions induced by social influence. At the same time a giant adoption cluster grows and percolates through the whole network (Fig.~\\ref{fig:3}a, main panel). Despite of this expansion dynamics and connected structure of the service adoption cluster, the service reaches less than $6\\%$ of the total number of active Skype users over a period of $7$ years \\cite{SkypeIPO}. Therefore we ask whether one can refer to these adoption clusters as cascades. They are not triggered by a small perturbation but induced by several innovators; their evolution is not instantaneous but ranges through several years; and although they involve millions of individuals, they reach only a reduced fraction of the whole network. To answer we incorporate the above mentioned features into a dynamical threshold model \\cite{Ruan2015} with a growing group of innovators and investigate their effect on the evolution of global social adoption. Note that we also perform a null model study to demonstrate, on the system level, that social influence dominates the contagion process, but not homophily (see section S3 of the SI, together with another empirical spreading scenario in S7.1).\n\n\\subsection*{Model}\n\nOur modelling framework is an extension to conventional threshold dynamics on networks studied by Watts, Gleeson, Singh, and others, where all nodes are initially susceptible and innovators are only introduced as an initial seed of arbitrary size~\\cite{Watts2002Simple,Gleeson2007Seed,Singh2013Thresholdlimited}. Apart from the threshold rule discussed above, our model considers two additional features: (i) a fraction $r$ of `immune' nodes that never adopt, indicating lack of interest in the service; (ii) due to external influence, susceptible nodes adopt the innovation spontaneously (i.e. become innovators) throughout time with constant rate $p_n$, rather than only at the beginning of the dynamics. In this way, the dynamical evolution of the system is completely defined by the online social network, the distribution $P(\\phi)$ and the parameters $r$, $p_n$. For the sake of simplicity we consider a configuration-model network, i.e., we ignore correlations in the social network and characterise it solely by its degree distribution $P(k)$. Furthermore, node degrees and thresholds are considered to be independent \\cite{Gleeson2008Cascades,gleeson2013binary,gleeson2011high}.\n\nOur threshold model, which has also been introduced in \\cite{Ruan2015}, can be studied analytically by extending the framework of approximate master equations (AMEs) for monotone binary-state dynamics recently developed by Gleeson~\\cite{Gleeson2008Cascades,gleeson2013binary,gleeson2011high}, where the transition rate between susceptible and adoption states only depends on the number $m$ of network neighbours that have already adopted. We describe a node by the property vector ${\\mathbf{k}} = (k, c)$, where $k = k_0, k_1, \\ldots k_{M-1}$ is its degree and $c = 0, 1, \\ldots, M$ its type, i.e. $c = 0$ is the type of the fraction $r$ of immune nodes, while $c \\neq 0$ is the type of all non-immune nodes that have threshold $\\phi_c$. In this way $P(\\phi)$ is substituted by the discrete distribution of types $P(c)$ (for $c > 0$). The integer $M$ is the maximum number of degrees (or non-zero types) considered in the AME framework, which can be increased to improve the accuracy of the analytical approximation at the expense of speed in its numerical computation (see S4.2). Under these conditions, the AME system describing the dynamics of the threshold model is reduced to the pair of ordinary differential equations (see SI),\n\\begin{subequations}\n\\label{eq:reducedAMEs}\n\n", "index": 1, "text": "\\begin{align}\n\\dot{\\rho} &= h(\\nu, t) - \\rho, \\\\\n\\dot{\\nu} &= g(\\nu, t) - \\nu,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{\\rho}\" display=\"inline\"><mover accent=\"true\"><mi>ρ</mi><mo>˙</mo></mover></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=h(\\nu,t)-\\rho,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mi>h</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>ρ</mi></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dot{\\nu}\" display=\"inline\"><mover accent=\"true\"><mi>ν</mi><mo>˙</mo></mover></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=g(\\nu,t)-\\nu,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>ν</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": " \nwhere $\\rho_s(t)$ is the fraction of non-immune, susceptible nodes that can eventually adopt, either spontaneously or not. Since such susceptible nodes adopt spontaneously at a rate ${p_r}$, the rate equation for innovators is $\\dot{\\rho}_0 = {p_r} \\rho_s$. Then, with Eq.~(\\ref{eq:suscepIdent}) we obtain,\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\end{subequations}\nwith the quantities $g(\\nu)$ and $h(\\nu)$ given explicitly by Eqs.~(\\ref{eq:gFactor}) and~(\\ref{eq:hFactor}).\n\nThe system~(\\ref{eq:reducedAMEs}) can be solved numerically to obtain $\\rho(t)$ and thus characterize the temporal evolution of the adoption process. Let us further separate the fraction of adopters as $\\rho(t) = \\rho_0(t) + \\rho_1(t)$, where $\\rho_0$ and $\\rho_1$ are the fractions of innovators and induced adopters (i.e. vulnerable and stable nodes), respectively. Now consider the identity,\n\n", "index": 55, "text": "\\begin{equation}\n\\label{eq:suscepIdent}\n1 - \\rho = {\\sum_{{\\mathbf{k}}}} {P({{\\mathbf{k}}})} {\\sum_m} {s_{{\\mathbf{k}}, m}} = r + (1 - r) {\\sum_{{\\mathbf{k}} | c \\neq 0}} P(k) P(c) {\\sum_m} {s_{{\\mathbf{k}}, m}} = r + \\rho_s,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"1-\\rho={\\sum_{{\\mathbf{k}}}}{P({{\\mathbf{k}}})}{\\sum_{m}}{s_{{\\mathbf{k}},m}}=%&#10;r+(1-r){\\sum_{{\\mathbf{k}}|c\\neq 0}}P(k)P(c){\\sum_{m}}{s_{{\\mathbf{k}},m}}=r+%&#10;\\rho_{s},\" display=\"block\"><mrow><mrow><mrow><mn>1</mn><mo>-</mo><mi>ρ</mi></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow><mo>=</mo><mrow><mi>r</mi><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>𝐤</mi><mo stretchy=\"false\">|</mo><mi>c</mi><mo>≠</mo><mn>0</mn></mrow></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>c</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi></munder><msub><mi>s</mi><mrow><mi>𝐤</mi><mo>,</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mi>r</mi><mo>+</mo><msub><mi>ρ</mi><mi>s</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07995.tex", "nexttext": "\nwhich can be calculated explicitly with the numerical solution of Eq.~(\\ref{eq:reducedAMEs}).\n\n\n\\section{Waiting time of adoption}\n\\label{sec:tw}\n\n\\begin{figure}[!ht] \\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{WaitingTimeDistr.pdf}\n}  \n\\subfigure[]{\n  \\includegraphics[width=76mm]{CumAdRates_ww_noWT.pdf}\n}\\\\  \n\\caption{\\small{\\bf Waiting time distribution and its effect on the adoption process} {\\bf (a)} Distribution $P(\\tau_w)$ of times between the last adoption in the egocentric network of an individual and his/her own adoption. {\\bf (b)} Cumulative adoption rates after waiting time removal [$CR(t)$ and $CR_{\\tau_w}(t)$, respectively]. $n$ and $\\tau$ are arbitrary constant values.}\n\\label{fig:WaitingT}\n\\end{figure}\n\nAnother reason behind the non-rapid evolution of the adoption process could be the time users wait after their personal adoption threshold is reached and before adopting the service. This lag in adoption can be due to individual characteristics, or come from the fact that social influence does not spread instantaneously (as commonly assumed in threshold models, including ours). However, the waiting time $\\tau_w$ can be estimated by measuring the time difference between the last adoption in a user's egocentric network and the time of adoption. We define $\\tau_w=0$ for innovators, but $\\tau_w$ can take any positive value for vulnerable and stable adopters up to the length of the observation period.\n\nWaiting times are broadly distributed for adopters (Fig.~S\\ref{fig:WaitingT}a), meaning that many users adopt the service shortly after their personal threshold is reached, but a considerable fraction waits long before adopting the service. The heterogeneous nature of waiting times may be a key element behind the observed adoption dynamics. One way to figure out the effect of waiting times on the speed of cascade evolution is by removing them. We can extract waiting times from adoption times and thus calculate rescaled adoption times. The rescaled adoption time of a user is the last time when his/her fraction of adopting neighbours changed and the adoption threshold was (hypothetically) reached. After this procedure we can calculate a new adoption rate function by using rescaled adoption times and compare it to the original. From Fig.~S\\ref{fig:WaitingT}b we can conclude that although adoption becomes faster, the rescaled adoption dynamics is still not rapid. On the contrary, it suggests that the rescaled adoption dynamics is still very slow and quite similar to the original. Consequently, waiting times cannot explain the observed dynamics of adoption.\n\nNote that long waiting times can have a further effect on the measured dynamics. After the `real' threshold of a user is reached and he/she waits to adopt, some neighbours may adopt the product. Hence all observed measures are in this sense `effective': observed thresholds are larger or equal than real thresholds; the innovator rate is smaller or equal; the vulnerable and stable rates will be larger or equal; and waiting times will be shorter or equal than the real values. Consequently the process may be actually faster than that we observe in Fig.~S\\ref{fig:WaitingT}b after removing effective waiting times. However, this bias becomes important only after the majority of individuals in the social network has adopted the service and the spontaneous emergence of adopting neighbours becomes more frequent. As the fraction of adopters in our dataset is always less than $6\\%$ \\cite{SkypeIPO}, we expect minor effects of this observational bias on measurements.\n\n\\section{Empirical and model cluster statistics}\n\\label{sec:clustStats}\n\n\\begin{figure}[!ht] \\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{VT_depth_distr_Rvar.pdf}\n}  \n\\subfigure[]{\n  \\includegraphics[width=76mm]{deg_VTS_Rvar.pdf}\n}\\\\  \n\\caption{\\small{\\bf Empirical and model cluster statistics} {\\bf (a)} Distribution $P(d)$ of the depth of induced vulnerable trees in the empirical and model systems. {\\bf (b)} Correlation $\\langle s_v \\rangle (k)$ between the degree of innovators and the average size of vulnerable trees they induce. Empty symbols denote model calculations for $r=0.6$ (blue), $0.73$ (black), and $0.9$ (green), and full red symbols the empirical measurements. Model calculations correspond to networks of size $N=10^6$ and are averaged over $100$ independent realizations.}\n\\label{fig:ClusStat}\n\\end{figure}\n\nAs described in the main text, we perform extensive model calculations using empirically determined parameters to estimate the only unknown parameter, the fraction of immune nodes $r$. We match the relative size of the largest connected component of the real adoption network with its corresponding measure in the model at the end of the observation period, and estimate the fraction of immune nodes in the real system as $r=0.73$. To support our estimation we also measure the distribution $P(d)$ of the depth of induced vulnerable trees and the correlation $\\langle s_v \\rangle (k)$ between the degree of innovator nodes and the average size of induced vulnerable trees in the model, and match them with the equivalent empirical measures. To provide further support for the estimated $r$ value we show the dependence of these quantities of different $r$ values.\n\nWe measure $P(d)$ and $\\langle s_v \\rangle (k)$ for $r=0.6$ and $0.9$, as well as for the predicted value $r=0.73$ (Fig.~S\\ref{fig:ClusStat}). It is clear that both quantities scale with $r$. For smaller $r$ more nodes are susceptible for adoption, allowing deeper and larger vulnerable trees, while for larger $r$ no large induced cluster can emerge as the system is forced into a quenched state. Moreover, measures for the estimated $r$ value fit the empirical data considerably well. This collapse is remarkable, since we neglect any higher-order structural and temporal correlations in the model (like assortative mixing, community structure, bursty adoption patterns, periodic activity fluctuations, etc.), which are present in the empirical system. Differences in the tails of the measures are due to finite-size effects since the modelled network is two orders of magnitude smaller than the empirical social structure. Note that although we can look for an $r$ fraction that produces a better fit between model and data in terms of $P(d)$ and $\\langle s_v \\rangle (k)$, the collapse in Fig.~S\\ref{fig:ClusStat} demonstrates the quality of an independent procedure of estimating $r$ (i.e. by matching the relative size of components). Therefore, these results are intended for validation only and not as a method to estimate the correct value of $r$.\n\n\\section{Calculations for additional service}\n\\label{sec:addserv}\n\n\\begin{figure}[!ht]\n\\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{AdoptionRates_ww_srv4.pdf}\n}  \n\\subfigure[]{\n  \\includegraphics[width=76mm]{ThreshDistr_ww_allscale_srv4.pdf}\n}\\\\  \n\\caption{\\small{\\bf Adoption rates and threshold distributions for service ``subscription''}. {\\bf (a)} Net adoption rate (black), as well as rates for innovator (green), vulnerable (red), and stable (blue) nodes as function of time. The dashed line is a fitted constant function to estimate the innovator adoption rate as $p_n=0.00012$. {\\bf (b)} Distribution of integer thresholds $\\Phi_k$ for several degree groups (inset). By using $P(\\Phi_k,k)=k P (\\Phi_k/k)$ these curves collapse to a master curve well approximated by a lognormal function (dashed line) with average $w=0.063$ and STD $0.153$ (for further details see Section \\ref{sec:thrDistr}).}\n\\label{fig:srv4RateTh}\n\\end{figure}\n\n\\subsection{Empirical observations}\n\nIn order to support our empirical observations and modelling of the social spreading of Skype, we examine the adoption dynamics of an additional paid service called ``subscription'', introduced in April 2008 and with adoption data for over $42$ months until the end of the observation period. This service is only available for registered Skype users, and we can therefore use the accumulated static Skype network as background social structure. In order to investigate the adoption of this service we repeat all calculations described previously. First we measure the decoupled rate of innovator, vulnerable, and stable adopters (Fig.~S\\ref{fig:srv4RateTh}a). We see that after a short initial period innovators adopt approximately with a constant rate, setting the model parameter to $p_n=0.00012$. Moreover, here innovators dominate social spreading since the rate of vulnerable and stable adoptions is relatively low.\n\nWe also measure the integer threshold distribution for different degree groups (Fig.~S\\ref{fig:srv4RateTh}b, inset) just as described in Section \\ref{sec:thrDistr}. These distributions scale together after normalization with the scaling relation $P(\\Phi_k,k)=k P (\\Phi_k/k)$ (Fig.~S\\ref{fig:srv4RateTh}b, main panel) and are well approximated by a lognormal distribution [Eq.~(\\ref{eq:thrLogn})] with parameters $\\mu_T=-3.73$ and $\\sigma_T=1.39$, as determined by the average threshold $w=0.063$ and STD $0.153$. Note that since the adoption dynamics of this service is dominated by innovators, the average threshold $w$ is smaller than in the case of the ``buy credit'' service. All parameters are summarized in Table \\ref{table:parssrv4}. Since the background network is the same for both services, network parameters are those of Table.\\ref{table:pars}.\n\n\\begin{figure}[!ht]\n\\centering\n\\subfigure[]{\n  \\includegraphics[width=76mm]{evolution_wcc_sizescale_srv4.pdf}\n}  \n\\subfigure[]{\n  \\includegraphics[width=76mm]{evolution_vulnerable_srv4.pdf}\n}\\\\  \n\\caption{\\small{\\bf Empirical cluster statistics.} {\\bf (a)} Relative connected-component size distribution $P(s)$ at different times for the empirical adoption network (main panel) and the stable adoption network (inset), with sizes $s_a$ and $s_s$, respectively. {\\bf (b)} Relative connected-component size distribution $P (s_v)$ of the empirical innovator-induced vulnerable trees at different times.}\n\\label{fig:srv4adClust}\n\\end{figure}\n\nAlthough the adoption process is dominated by innovators, a giant connected component evolves in the adoption network (Fig.~S\\ref{fig:srv4RateTh}a, main panel). On the other hand, its relative size is considerable smaller than for the ``buy credit'' service. The stable adoption network is also dominated by a giant component, but its relative size is even smaller when compared to the adoption network (Fig.~S\\ref{fig:srv4RateTh}a, inset). Moreover, the largest vulnerable trees are only two orders of magnitude smaller than the stable giant cluster (Fig.~S\\ref{fig:srv4RateTh}b). For comparison, this difference is five order of magnitude for the ``buy credit'' service.\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{|c||c|c|c|c|}\n\\hline \n$p_{n}$ & $w$ & $STD(\\phi)$ & $\\mu_T$ & $\\sigma_T$  \\\\ \\hline \\hline \n$0.00012$ & $0.063$ & $0.153$ & $-3.73$ & $1.39$ \\\\\n\\hline \n\\end{tabular} \n\\caption{\\small Estimated empirical parameters for service ``subscription''.}\n\\label{table:parssrv4}\n\\end{center}\n\\end{table}\n\n\\subsection{Model and validation}\n\n\\begin{figure}[!ht]\n\\centering\n\\includegraphics[width=110mm]{LC12_R_types_T100_fig_lgn_srv4.pdf}\n\\caption{\\small{\\bf Modeled adoption process of the service ``subscription''} Average size of the largest ($LC$) and 2nd largest ($LC^{2nd}$) components of the model network (`Net'), model adoption network (`Casc'), model stable network (`Stab'), and induced vulnerable trees (`Vuln') as a function of $r$. Dashed lines show the observed relative size of the real $LC$ of the adopter network in 2011 (Fig.~S\\ref{fig:srv4adClust}, main panel) and the predicted $r$ value. The lower panel depicts the time $t_{50\\%}$ when the adoption process has reached $50\\%$ of the susceptible network as a function of $r$. We use $100$ realizations of configuration-model networks with size $N=10^5$ and lognormal degree distribution parametrized as described in Section \\ref{sec:degDistrFit}. Model calculations correspond to the parameters of Table \\ref{table:parssrv4} for $42$ iteration steps (matching the length of the observation period).}\n\\label{fig:srv4model}\n\\end{figure}\n\nWe repeat all model calculations with the parameters of the ``subscription'' service to see whether we can recover its adoption dynamics by using the dynamical threshold model introduced in the main text and in Section \\ref{sec:thresModel}. We check the dependence on $r$ of the average size of the largest connected component of the network ($LC$) of susceptible nodes available for the adoption process, the adoption network, the stable adoption network, and of vulnerable trees (Fig.~S\\ref{fig:srv4model}, upper panel). In addition we record the average size $LC^{2nd}$ of the second largest connected component (Fig.~S\\ref{fig:srv4model}, middle panel). Finally we show the time when the adoption process has reached the $50\\%$ of available susceptible nodes in the adoption network (Fig.~S\\ref{fig:srv4model}, lower panel).\n\nThe $r$ dependence of the adoption process appears to be qualitatively similar to our earlier calculations on the ``buy credit'' service, but there are remarkable differences. Firstly, the crossover regime (depicted by the light grey area in Fig.~S\\ref{fig:srv4model}) is shifted towards larger $r$ values due to the different threshold distribution and innovator adoption rate. Secondly, after matching the relative size of the largest connected component of the empirical adoption network (last point on the right-hand side of Fig.~S\\ref{fig:srv4adClust}, main panel), the predicted $r=0.928$ is out of the crossover regime. At this point the background social network is still not fragmented (as evidenced by the black line in Fig.~S\\ref{fig:srv4model}, which has not reached its maximum yet) and it allows for the emergence of large connected adoption clusters. It is very sparse, however, which explains: (a) the dominating innovator adoption rate observed empirically; (b) the reduced size of the giant component of the adoption and stable adoption networks; and (c) the relatively large innovator trees as compared to the stable adoption network components. We observe that the largest vulnerable trees are smaller than the largest stable clusters in the empirical data, while the opposite is true for the model. A possible explanation of this difference is the assumption in the model that the network is degree-uncorrelated. This is a necessary approximation in order to treat the model analytically, but it might not hold for the empirical network. All in all, this picture suggests that the ``subscription'' service is out of the rapid and even the crossover cascading regimes, and that its dynamics is mostly driven by independent innovators rather than social influence, on a network of which a large majority is not susceptible to innovation.\n\n\\begin{thebibliography}{9}\n\n\\bibitem{SocialMedia} White D. S., {\\it Social Media Growth 2006 to 2012} (2013). Date of access: 2015.01.29.\n\n\\bibitem{Lin1991} Lin J., Divergence measures based on the Shannon entropy. {\\it Trans. Inf. Theory} {\\bf  37}, 145 (2009).\n\n\\bibitem{Shalizi2011} Shalizi C. R. and Thomas A. C., Homophily and Contagion Are Generically Confounded in Observational Social Network Studies. {\\it Sociol. Methods Res.} {\\bf 40}(2), 211--239 (2011).\n\n\\bibitem{watts2002} Watts D. J., A simple model of global cascades on random networks. {\\it Proc. Natl. Acad. Sci. USA} {\\bf 99}, 5766--5771 (2002).\n\n\\bibitem{singh2013} Singh P., Sreenivasan S., Szymanski B. K., Korniss Gy., Threshold-limited spreading in social networks with multiple initiators. {\\it Sci. Rep.} {\\bf 3}, 2330 (2013).\n\n\\bibitem{Ruan2015} Ruan Z., I\\~{n}iguez G., Karsai M., Kert\\'{e}sz J., Kinetics of social contagion. {\\it Phys. Rev. Lett.} {\\bf 115}, 218702 (2015).\n\n\\bibitem{porter2014} Porter M. A., Gleeson J. P., Dynamical systems on networks: A tutorial. Eprint arXiv 1403.7663 (2014).\n\n\\bibitem{gleeson2013} Gleeson J. P., Binary-state dynamics on complex networks: Pair approximation and beyond. {\\it Phys. Rev. X} {\\bf 3}, 021004 (2013).\n\n\\bibitem{gleeson2008} Gleeson J. P., Cascades on correlated and modular random networks. {\\it Phys. Rev. E} {\\bf 77}, 046117 (2008).\n\n\\bibitem{gleeson2011} Gleeson J. P., High-accuracy approximation of binary-state dynamics on networks. {\\it Phys. Rev. Lett.} {\\bf 107}, 068701 (2011).\n\n\\bibitem{newman2010} Newman M. E. J., {\\it Networks: An Introduction}. (Oxford University Press) (2010).\n\n\\bibitem{SkypeIPO}\nMorrissey R. C., Goldman N. D., Kennedy K. P,.\n\\newblock {Skype S.A. United States Security Registration Statement,\n  Amendment 3, Reg.No. 333-168646} (2011).\n\\newblock Date of access: 2014.10.14.\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 87241, "prevtext": " \nwhere $\\rho_s(t)$ is the fraction of non-immune, susceptible nodes that can eventually adopt, either spontaneously or not. Since such susceptible nodes adopt spontaneously at a rate ${p_r}$, the rate equation for innovators is $\\dot{\\rho}_0 = {p_r} \\rho_s$. Then, with Eq.~(\\ref{eq:suscepIdent}) we obtain,\n\n", "index": 57, "text": "\\begin{equation}\n\\label{eq:innovRateEq}\n\\rho_0(t) = {p_r} \\int_0^t [1 - r - \\rho(t)] dt,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\rho_{0}(t)={p_{r}}\\int_{0}^{t}[1-r-\\rho(t)]dt,\" display=\"block\"><mrow><mrow><mrow><msub><mi>ρ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>p</mi><mi>r</mi></msub><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></msubsup><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mi>r</mi><mo>-</mo><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]