[{"file": "1601.02910.tex", "nexttext": "\nwhere $\\sigma( \\log \\frac{dE}{dx})_{{\\rm measured}}$ is the dE/dx resolution of the TPC.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThree methods, straight cut, N-1 iteration and Likelihood Ratio, are utilized in this paper to identify muon candidates. \nThe performance of these three methods is quantified by using a tag-and-prob procedure. \nThe tagged muon is the one with higher $p_T$, while the probed muon is the one with lower $p_T$. \nThe muon identification cuts are applied on the probed muons, and then the efficiency and background rejection power can be obtained by comparing the yield and significance of $J/\\psi$ signal from before and after the selection. \n\\begin{itemize}\n\n\\item {\\bf Straight cut method} \\\\\nOne way to reduce background is to simply apply straight cuts on these four variables independently. \nThe cut values for $|\\Delta z|$, $|\\Delta y \\times q|$ and $n\\sigma_{\\pi}$ are determined through the widths of the signal distributions, and an asymmetric cut is used for $\\Delta{\\rm ToF}$.   \nSpecifically, the selection criteria are $-5 < \\Delta{\\rm ToF} < 0.2$ ns, $|\\Delta z| < 20$ cm, $|\\Delta y \\times q| <20$ cm and $-1 < n\\sigma_{\\pi} < 3$. \n\n\n\n\\item {\\bf N-1 iteration method } \\\\\n    A more sophisticated way to select muon candidates is using $J/\\psi \\to \\mu^+ \\mu^-$ signal and iterating the cut values to obtain the best signal significance ($S/\\sqrt{B}$) until the cuts are stable. \nThe values of the cuts determined using this method are $-4.8 < \\Delta{\\rm ToF} < 0.7$ ns, $-15 < \\Delta z < 19$ cm, $-9 < \\Delta y \\times q < 14$ cm and $-0.5 < n\\sigma_{\\pi} < 3.6$. \n\n\n\n\\item {\\bf Likelihood Rratio method} \\\\\nAn advanced way to reduce the background level and keep high purity simultaneously is using multivariate methods, and the Likelihood Ratio method is one of the most transparent multivariate methods. \nThe basic idea is to create a discriminative variable in a form of a likelihood ratio $R=(1-Y)/(1+Y)$, where $Y = \\prod y_i$ and each $y_i=PDF^{\\rm bkg}_i / PDF^{\\rm sig}_i$ is a ratio between background and signal probability density functions (PDFs).\nIn order to obtain the PDF of each variable for pure muons, events under $J/\\psi \\to \\mu^+\\mu^-$ peak were used as shown in the insert of Fig.~\\ref{fig:dimuon_mass}, where the two vertical black dashed lines indicate the mass window used to select the muon sample.\nThe signal PDFs are extracted using opposite-sign (OS) events subtracted out the same-sign (SS) events, while the PDFs for background are simply using the same-sign events under the same mass region.  \nDue to the limited statistics in data for the signal PDFs which causes large fluctuations, the embedded MC sample is used to construct the signal PDFs.\n\n\nFigure~\\ref{fig:pdf} shows the comparisons for the PDF of each variable between signal (data and MC) and background. \nThe signal distributions in data and MC are in good agreement. \n\\begin{figure}[htbp]\n  \\begin{center}\n      \\includegraphics[width=0.5\\textwidth]{pdf}\n      \\end{center}\n  \\caption{ The probability density function of $\\Delta$z, $\\Delta y \\times q$, $\\Delta$ToF, and $n\\sigma_{\\pi}$ variables. The black points are the signal from data (OS-SS), the blue histograms are the signal from MC, and the black histograms are the background from data (SS). \n  \\label{fig:pdf}}\n\\end{figure}\n\n\nFigure~\\ref{fig:pdf_ratio} shows the PDF ratios ($PDF^{bkgd}/PDF^{sig}$) for $\\Delta$ToF, $\\Delta y \\times q$, $\\Delta z$, and $n\\sigma_{\\pi}$, respectively. \nA linear extrapolation (solid red line) is used to obtain the ratios between points in the middle region while a linear fit (dashed red line) is used for the side regions.\nIn this method, only three variables, $\\Delta y\\times q$, $\\Delta z$ and $n\\sigma_{\\pi}$, are used to calculate the $R$ value for the probed muon. \nThe cut values on $\\Delta$ToF is fixed from the N-1 iteration method due to the mismatch of signal PDF between data and simulation.\nFigure~\\ref{fig:LHratio_muid} shows the discriminating power of the Likelihood Ratio method, and the cut value on $R$ variable, $R > 0.05$, is chosen to maximize the significance of the $J/\\psi$ signal.\n\n\\begin{figure}[htbp]\n  \\begin{center}\n      \\includegraphics[width=0.5\\textwidth]{pdf_ratio}\n      \\end{center}\n      \\caption{ The PDF ratios of $\\Delta$z, $\\Delta y \\times q$, $\\Delta$ToF, and $n\\sigma_{\\pi}$ variables. The solid red line indicates the linear extrapolation and the dashed red line is the linear fit to parameterize the ratio.  \n  \\label{fig:pdf_ratio}}\n\\end{figure}\n\n\\begin{figure}[!htbp]\n  \\begin{center}\n      \\includegraphics[width=0.4\\textwidth]{mu2_Likelihood_ratio}\n  \\end{center}\n  \\caption{ Distributions of the Likelihood Ratio (R) for signal (blue) and background (red). The cut value on R variable is optimized by the signal significance.    \n  \\label{fig:LHratio_muid}}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \\end{itemize}\n\n\n\n\n\\section{Results}\n\\label{results}\n\nThe performances of different muon identification methods are evaluated by using $J/\\psi \\to \\mu^+ \\mu^-$ signal with the selection cuts applied on the probed (subleading) muons as shown in Fig.~\\ref{fig:jpsi_mass_compare}. \nThe results demonstrate that all of them have capability to reduce the background level by more than 70\\% and to keep the $J/\\psi$ signals clean. \nThe muon identification efficiencies are calculated relative to the basic selection described in Section 3.2, and shown as a function of $p_T$ in Fig.~\\ref{fig:eff_vs_pt}.\nThe plateau efficiency ($p_T >$ 3 GeV) is about 90\\% for the Likelihood Ratio method, and about 80\\% for the other methods.  \nEspecially the Likelihood Ratio method provides an overall signal efficiency at 74\\% and the significance of $J/\\psi$ signal is improved by a factor of 1.43. \nThe detailed comparisons between all three methods are summarized in Table~\\ref{table:muid_result}.\n\n\\begin{figure}[!htbp]\n  \\begin{center}\n      \\includegraphics[width=0.4\\textwidth]{Compare_mll_os_fit}\n      \\end{center}\n      \\caption{ The dimuon mass spectra with various muon identification method. The solid curves are combined fits to the mass distribution with a single Guasisan plus a fourth-order polynomial function. The dashed lines show the fitted background. The solid circles are for the basic selection applied to both muons;; the open boxes, open circles and solid triangles are for the cases that the subleading muon is selected using straight cut, N-1 iteration cut and the Likelihood Ratio methods, respectively. \n  \\label{fig:jpsi_mass_compare}}\n\\end{figure}\n\n\\begin{table*}[!htbp]\n  \\begin{center}\n  \\begin{tabular}{lcccc}\n  \\hline\\hline\n  \n                              &    Basic selection   &  Straight cut       &  N-1 iteration   & Likelihood Ratio \\\\ \n  Signal                      &     1579 $\\pm$ 116   &  980 $\\pm$ 63       &   905 $\\pm$ 57         &   1168 $\\pm$ 66         \\\\\n  Background                  &     10568 $\\pm$ 103  &  2628 $\\pm$ 51      &   2128 $\\pm$ 46         &    2820 $\\pm$ 53          \\\\\n  $S/B$                       &     0.15 $\\pm$ 0.01  &  0.37 $\\pm$ 0.03    &   0.43 $\\pm$ 0.03        &    0.41 $\\pm$ 0.03         \\\\\n  $S/\\sqrt{B}$                &     15.36 $\\pm$ 1.14 &  19.11 $\\pm$ 1.24   &   19.61 $\\pm$ 1.25        &    21.99 $\\pm$ 1.26         \\\\\n\n\n  $\\varepsilon_{signal}$      &     ---              &  0.620 $\\pm$ 0.061  &   0.573 $\\pm$ 0.056       &    0.739 $\\pm$ 0.069         \\\\\n  $ 1 - \\varepsilon_{bkgd.}$  &     ---              &  0.751 $\\pm$ 0.014  &   0.799 $\\pm$ 0.014        &    0.733 $\\pm$ 0.016         \\\\\n  \\hline \\hline\n   \\end{tabular}\n  \\end{center}\n  \\caption{\n      Comparison of the performance for three different muon identification methods. $\\varepsilon_{signal}$ and $ 1 - \\varepsilon_{bkgd.}$ are the muon identification efficiency and the background rejection rate relative to the basic selection, respectively.\n\\label{table:muid_result}}\n\\end{table*}\n\n\\begin{figure}[!htbp]\n  \\begin{center}\n      \\includegraphics[width=0.5\\textwidth]{efficiency_vs_finerpt_sameCanvas}\n  \\end{center}\n  \\caption{ The muon identification efficiencies as a function of $p_T$ with straight cuts, N-1 iteration and Likelihood Ratio methods. The blue solid points are from Monte Carlo, while the red open circles are from data (statistical errors only). \n  \\label{fig:eff_vs_pt}}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter applying the muon identification selections determined using Likelihood Ratio method on both muons, not only the $J/\\psi$ signal is enhanced, but also the peaks of the light mesons, such as $\\rho$, $\\omega$ and $\\phi$, become clear as shown in Fig.~\\ref{fig:dimuon_mass_after_cut}. \nThis offers a good opportunity to study light mesons, heavy quarkonium as well as dimuon continuum at the STAR experiment.  \n\n\\begin{figure}[!htbp]\n  \\begin{center}\n      \\includegraphics[width=0.48\\textwidth]{mass_spectrum_compare}\n      \\end{center}\n      \\caption{The dimuon mass spectrum with Likelihood Ratio method selection on both muons compared with the basic selection which is scaled by 0.1. It is obvious that the significance of $J/\\psi$ signal is enhanced and the signal of light mesons are clear. \n  \\label{fig:dimuon_mass_after_cut}}\n\\end{figure}\n\n\n\\section{Conclusion}\n\\label{concl}\n\nThe MTD is a newly installed detector dedicated to study muons in STAR with low kinematic cutoff.\n\nIn this paper, we demonstrated three different methods on muon identification, i.e. straight cut, N-1 iteration and Likelihood Ratio method, each of which can reduce the background level above 70\\% and keep the $J/\\psi$ signals with about 60\\% of efficiency. \n\nWith this muon identification capability, the MTD provides a good opportunity to study heavy-ion physics with muons, especially the quarkonium states, in the STAR experiment. \n\n\n\n\\section{Acknowledgments}\n\\label{ack}\n\nWe thank the STAR Collaboration, the RACF at BNL and National Cheng Kung University (Taiwan) for their support. \nThis work was supported in part by the U.S. DOE Office of Science under the contract No. de-sc0012704 and the Goldhaber Fellowship program at Brookhaven National Laboratory. \nL. Ruan acknowledges a DOE Office of Science Early Career Award.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{\\refname}\n\n\\bibliographystyle{elsarticle-num}\n\\bibliography{STARMuonID}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 8256, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\date{\\today}\n    \n\\title{ {\\bf Muon Identification with Muon Telescope Detector at the STAR Experiment } }\n\n\n\n\n\n\n\\author[ncku]{T.C. Huang}\n\\author[bnl]{R. Ma}\n\\author[uic]{B. Huang}\n\\author[thu]{X. Huang}\n\\author[bnl]{L. Ruan}\n\\author[bnl]{T. Todoroki}\n\\author[bnl]{Z. Xu}\n\\author[ustc]{C. Yang}\n\\author[ustc]{S. Yang}\n\\author[ustc]{Q. Yang}\n\\author[ncku]{Y. Yang \\corref{cor1}}\n\\ead{yiyang@ncku.edu.tw}\n\\author[ustc]{W. Zha}\n\n\\address[ncku]{National Cheng Kung University, Tainan 70101, Taiwan}\n\\address[bnl]{Brookhaven National Laboratory, Upton, New York 11973, USA}\n\\address[thu]{Tsinghua University, Beijing 100084, China}\n\\address[uic]{University of Illinois at Chicago, Chicago, Illinois 60607, USA}\n\\address[ustc]{University of Science and Technology of China, Hefei 230026, China}\n\n\\cortext[cor1]{Corresponding author.}\n\n\n\n\n\\begin{abstract}\n\n    Muon Telescope Detector (MTD) is a newly installed detector in the STAR experiment. \n    It provides an excellent opportunity to study heavy quarkonium physics using the dimuon channel in heavy ion collisions. \n    In this paper, we report the muon identification performance for the MTD using proton-proton collision at $\\sqrt{s}$ = 500 GeV with various methods. \n    The result using the Likelihood Ratio method shows that the muon identification efficiency can reach to $\\sim$90\\% for muons with transverse momentum greater than 3 GeV/c and the significance of $J/\\psi$ signal is improved by $\\sim$40\\% compared to using the basic selection. \n\n\\end{abstract}\n\n\\begin{keyword}\nSTAR  \\sep MTD \\sep muon identification \\sep muon \\sep dimuon \\sep quarkonium\n\n\n\n\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\\label{intro}\n\nThe Solenoid Tracker At RHIC (STAR)~\\cite{star_det} is one of the major high energy nuclear physics experiments in Relativistic Heavy Ion Collider (RHIC) at Brookhaven National Laboratory. \nAfter 15 years of operation, the STAR experiment provided us lots of important physics results in understanding the properties of Quantum Chromodynamics (QCD). \nEspecially the evidence of the existence of Quark-Gluon Plasma opened a new window to get a deeper insight into QCD~\\cite{dis_qgp}. \n\nHeavy quark-antiquark states are perfect probes to study the properties of the QCD matter.\nFor instance, quarkonium suppression in the medium due to the color-screening of the surrounding partons can provide information about the partonic nature of the QGP and its temperature~\\cite{jpsi_supp, pot_mod}. \nTo reconstruct the quarkonium states via the leptonic decay, the dimuon channel suffers less combinatoric background and Bremsstrahlung radiation compared to the dielectron channel.\n\nA new subdetector in STAR, Muon Telescope Detector (MTD), dedicated to measuring muons was proposed in 2009 and was installed from 2012 to 2014~\\cite{mtd, mtd_2}.\n\nIn this paper, we present the muon identification performance of this new detector. \n\nThis paper is arranged as follows. \nIn Section 2, a brief description of the STAR detector is presented. \nThe dateset and event selection are shown in Section 3.\nIn Section 4, three methods used to identify muon candidates are described. \nIn Section 5, we present the efficinecy as well as the resulting signal significance for $J/\\psi$ from these three methods. \nFinally, a summary is given in Section 6. \n\n\\section{The STAR detector}\n\\label{star}\nThe STAR detector is a general purpose particle detector focused on high energy nuclear physics. \n\nThe main subsystems relevant to this analysis include the Time Projection Camber (TPC), the Magnet System and the MTD. \nThe TPC is the major tracking detector for charged particles in STAR and measures the ionization energy loss (dE/dx) which plays an important role in particle identification~\\cite{tpc}. \nIt covers full azimuthal angle ($0 < \\phi < 2 \\pi$) and large pseudorapidity range ($|\\eta| < 1$). \n\n\nThe Magnet System generates 0.5 Tesla of magnetic field to bend the charged particles. \nThere are 30 flux-return bars, known as \"backlegs\", outside the coil to provide the return flux path for the magnet field~\\cite{magnet}. \nThese backlegs play an essential role in enhancing the muon purity by absorbing the background hadrons from collisions.\n\n\nThe MTD is a fast detector based on the Multi-gap Resistive Plate Chamber technology to record signals, also referred to as \"hits\", generated by charged particles traversing it. \nIt covers about 45\\% in azimuth within $|\\eta| <$ 0.5.\n\n\nOut of the full MTD system, 10\\%, 63\\% and 100\\% was installed in 2012, 2013, and 2014, respectively.\nThe timing and spatial resolution of the MTD obtained from cosmic ray data are $\\sim$100 ps and $\\sim$1-2 cm, respectively~\\cite{mtd_3}.  \n\n\n\n\\subsection{Data and Monte Carlo}\nData for this study were collected by the STAR detector during the RHIC proton-proton run at center-of-mass energy of 500 GeV in 2013. \nEvents in the data sample were selected using the MTD triggers. After the basic track selection described in the next section, more than 1500 $J/\\psi \\to\\mu^+\\mu^-$ candidates are used in this study. \n\nIn order to have pure and larger statistics muon sample, the Monte Carlo of the $J/\\psi \\to \\mu^+ \\mu^- $ signal was used in this study.  \nThe sample was generated by a single-particle generator with flat distributions in $J/\\psi$ transverse momentum ($p_T$), $\\phi$ and $\\eta$. These simulated signals were then passed through the full GEANT3 simulation of the STAR detector, and ``embedded'' into real events followed by the standard reconstruction procedure as used for real data.\nFor comparison, the kinematic distributions of the embedded $J/\\psi$ and $\\mu^{\\pm}$ were weighted by the $p_T$ spectrum of $J/\\psi$ in pp collisions at 500 GeV determined via interpolation through a global fit of differential $J/\\psi$ cross section from world-wide measurements~\\cite{jpsi_pt}.\n\n\n\n\n\n\n\n\n\\subsection{Track selection}\nTracks selected for the muon identification study should meet the following requirements: \n$p_T$ is greater than 1 GeV/c; \n\nthe distance of closest approach to the collision vertex should be less than 3 cm to suppress secondary decays; \nnumber of TPC clusters used in reconstruction should be greater than 15 (the maximum possible is 45) to have good momentum resolution; \nnumber of TPC clusters used for the dE/dx measurement is greater than 10 to ensure good dE/dx resolution;\nthe ratio of the number of TPC clusters over the number of possible clusters is not less than 0.52 in order to reject split tracks. \n\nFor muon candidates, tracks are also required to match to the MTD hits that fire the triggers. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFigure~\\ref{fig:dimuon_mass} shows the dimuon mass spectrum with the selection criteria described above on both muons and it is clear to see the $J/\\psi$ signal around 3.1 $GeV/c^2$. However, the light mesons, like $\\omega$, $\\phi$ and $\\eta$ particles, are not obvious due to the huge background. \n\n\n\\begin{figure}[!htbp]\n  \\begin{center}\n      \\includegraphics[width=0.48\\textwidth]{mass_spectrum_mtd}\n      \\end{center}\n  \\caption{  The dimuon mass spectrum with basic selection described in Section 3.2 on both muons. The black solid and red open circles are for the muon pairs with opposite and same sign in charge, respectively. The inset shows the dimuon mass fits for $J/\\psi$ peak. The solid red line is a combined fit to the signal plus background with a single Gaussian plus a fourth-order polynomial.  \n  \\label{fig:dimuon_mass}}\n\\end{figure}\n\n\n\n\\section{Muon identification}\n\\label{muid}\n\n\nTo distinguish muon candidates from the hadron background in the MTD, there are four variables, $\\Delta$ToF, $\\Delta y\\times q$, $\\Delta z$ and $n\\sigma_{\\pi}$ used in this study.  \n$\\Delta$ToF is the difference between the calculated time-of-light value from track extrapolation with a muon particle hypothesis and the measured one from the MTD detector. \n$\\Delta y$ and $\\Delta z$ are the position differences between the MTD hit position and extrapolated track position on the MTD. \n\n\n$\\Delta y$ is multiplied by charge ($\\Delta y\\times q$) to eliminate the charge dependence. \n$n\\sigma_{\\pi}$ is the normalized $dE/dx$ quantity to the theoretical value of pions, defined as \n\n", "index": 1, "text": "\\begin{equation}\n    n\\sigma_{\\pi} = \\frac{ (\\log \\frac{dE}{dx})_{{\\rm measured}} - (\\log \\frac{dE}{dx})_{\\pi, {\\rm theory}} }{\\sigma( \\log \\frac{dE}{dx})_{{\\rm measured}} },\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"n\\sigma_{\\pi}=\\frac{(\\log\\frac{dE}{dx})_{{\\rm measured}}-(\\log\\frac{dE}{dx})_{%&#10;\\pi,{\\rm theory}}}{\\sigma(\\log\\frac{dE}{dx})_{{\\rm measured}}},\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><msub><mi>σ</mi><mi>π</mi></msub></mrow><mo>=</mo><mfrac><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mi>log</mi><mo>⁡</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>E</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac></mrow><mo stretchy=\"false\">)</mo></mrow><mi>measured</mi></msub><mo>-</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mi>log</mi><mo>⁡</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>E</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>π</mi><mo>,</mo><mi>theory</mi></mrow></msub></mrow><mrow><mi>σ</mi><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mi>log</mi><mo>⁡</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>E</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac></mrow><mo stretchy=\"false\">)</mo></mrow><mi>measured</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]