[{"file": "1601.06613.tex", "nexttext": "\nwhere $\\xi_\\text{\\tiny G}$ is a zero-mean Gaussian white noise with correlations $\\avg{\\xi_\\text{\\tiny G}(t)\\xi_\\text{\\tiny G}(t')}=2{D}\\delta(t-t')$. More realistic higher-dimensional generalizations do not induce any physical difference with the one-dimensional modeling we adopt here.\n\n\nOur motivations for the explicit form of the noise ${\\xi_\\text{\\tiny NG}}$ acting on the cage are twofold. One the one hand, we expect the rare intermittent events behind the $\\alpha$ relaxation to be unable to build up uncorrelated Gaussian statistics. On the other hand, we choose a specific form which has the advantage of allowing for a closed form analytic solution that will ease the subsequent analysis. It leads us to consider a zero-mean non-Gaussian white noise with cumulants\n\n", "itemtype": "equation", "pos": 8542, "prevtext": "\n\n\n\n\n\n\\title{Active cage model of glassy dynamics}\n\n\n\\author{\\'{E}tienne Fodor}\n\\affiliation{Laboratoire Mati\\`ere et Syst\\`emes Complexes, UMR  7057 CNRS/P7, Universit\\'e Paris Diderot, 10 rue Alice Domon et L\\'eonie Duquet, 75205 Paris cedex 13, France}\n\n\n\\author{Hisao Hayakawa}\n\\affiliation{Yukawa Institute for Theoretical Physics, Kyoto University, Kitashirakawa-oiwake cho, Sakyo-ku, Kyoto 606-8502, Japan}\n\n\n\\author{Paolo Visco}\n\\affiliation{Laboratoire Mati\\`ere et Syst\\`emes Complexes, UMR  7057 CNRS/P7, Universit\\'e Paris Diderot, 10 rue Alice Domon et L\\'eonie Duquet, 75205 Paris cedex 13, France}\n\n\n\\author{Fr\\'ed\\'eric van Wijland}\n\\affiliation{Laboratoire Mati\\`ere et Syst\\`emes Complexes, UMR  7057 CNRS/P7, Universit\\'e Paris Diderot, 10 rue Alice Domon et L\\'eonie Duquet, 75205 Paris cedex 13, France}\n\\affiliation{Yukawa Institute for Theoretical Physics, Kyoto University, Kitashirakawa-oiwake cho, Sakyo-ku, Kyoto 606-8502, Japan}\n\n\n\n\n\n\\date{\\today} \\pacs{}\n\n\\begin{abstract}\n\nUnderstanding the dynamics of a tracer immersed in a glassy system is one of the major challenges in condensed matter physics. We build up a phenomenological picture in terms of the effective dynamics of a tracer confined in a cage experiencing random hops. This minimal description exhibits scale invariance properties for the small-displacement distribution that echo experimental observations. We predict the existence of exponential tails as a cross-over between two Gaussian regimes. Moreover, we demonstrate that the onset of glassy behavior is controlled only by two dimensionless numbers: the number of hops occurring during the relaxation of the particle within a local cage, and the ratio of the hopping length to the cage size.\n\n\\end{abstract}\n\n\\maketitle \n\n\n\n\n\nTime-dependent density correlations in an atomic or colloidal glass former exhibit, as temperature is decreased (or as density is increased) a two step relaxation. The short time $\\beta$ relaxation is associated with localized motion of the particles while the longer time $\\alpha$ relaxation is associated with cooperatively rearranging regions (CRR). This behavior of the dynamic structure factor is well accounted for~\\cite{Biroli:11}, at sufficiently high temperatures, by the Mode-Coupling Theory (MCT)~\\cite{Gotze}. MCT being an approximate theory it does have its share of pitfalls but these are well-documented, and it is fair to say that they are not fully understood, let alone on intuitive grounds. One such predictions is the existence of a critical temperature below which the $\\alpha$-relaxation stage extends to arbitrary large times. This is often connected to the difficulty of capturing the dynamics of the CRR's, which is built from rare and intermittent events. One recent research direction has been to brute force improve the theoretical basis of the MCT, and recent promising results~\\cite{PhysRevLett.115.205701} seem to indicate that this may pay off to eliminate some of its unpleasant features. Regarding the dynamics (diffusive vs. arrested) of an individual tracer~\\cite{2015arXiv151100254P,2015arXiv151100786B} similar efforts are being made at looking beyond the existing MCT. The most recent experiments, instead of focussing on  the relaxation of collective density modes, are based on the observation of individual tracers. Tracking experiments have been  conducted by many different groups, both in actual colloidal systems~\\cite{Weeks:00,Kegel:00,Weeks:02,Kilfoil:07,Kilfoil:09,Gardel:13} as well as in silico~\\cite{Stariolo:06,Berthier:07}. The increasing accuracy of these methods allows one to measure the probability distribution function of the tracer displacement with unprecedented statistics~\\cite{Gao:09}.\n\n\nTo analyze and interpret tracking experiments, minimal phenomenological models have been developed. By using a continuous time random walk (CTRW) description, glassy systems have been studied numerically~\\cite{Farago:14a,Farago:14b}, and exact analytic results have been obtained for the Van Hove correlation function~\\cite{Berthier:07}. The CTRW considers instantaneous transitions between locally stable positions, thus decoupling the diffusion in a confined environment from the cage jumps~\\cite{Chandler:07}. Some model variations include the existence of a multiplicity of time scales in the cage dynamics~\\cite{Pastore:14,Pastore:14b,Pastore:15,Helfferich}, whereas others which include a single waiting time scale successfully reproduce many features of the dynamics of tracers in glassy systems~\\cite{Berthier:07,Berthier:08}. Despite the success of these minimal models, the existence of a scale invariant regime for the displacement distribution, as observed experimentally~\\cite{Weeks:00,Weeks:02,Kilfoil:09}, is still an open issue. The main purpose of this work is to show that this scale invariance feature can emerge from a phenomenological description.\n\n\nNote that systems other than glasses fall within the scope of our study, such as sheared fluids~\\cite{Berthier:00, Barrat:02, Berthier:02, Berthier:03}, or interacting self-propelled particles~\\cite{Stuart:13, Berthier:14, Levis:14, Rao:14, Gomper:14}. For these systems glassy behavior is generally investigated through the self-intermediate scattering function (sISF). In the case of self-propelled particles it has been observed that the onset of glassy behavior is progressively shifted when self-propulsion increases. Even though a direct extension of MCT is enough to account for this phenomenon~\\cite{Kurchan:13, Szamel:15, Brader:14}, an effective one-body dynamics that clearly determines how self propulsion affects the glassy behavior is still missing. We present here a minimal model that describes such one-body dynamics. By investigating the displacement distribution, we show that it displays scale invariance for small displacement, and we  determine how the onset of glassy behavior is linked to self propulsion. Finally, we introduce an effective mean--field potential to bridge over back to a system of interacting particles.\n\n\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=2\\columnwidth]{plot_c.pdf}\n\\caption{\\label{fig:sum}\nTime-evolution of~(a) the mean-square displacement (MSD), and~(b) the non-Gaussian parameter (NGP). The MSD saturates for a steady cage (solid black line), corresponding to a vanishing NGP.\n(c)~Comparison of the theoretical prediction of the distribution of displacement with that of  colloidal particles at density $\\varphi = 0.429$ taken from \\cite{Kilfoil:09}.\n(d)~Theoretical distribution of displacement scaled by the standard deviation of the central Gaussian part corresponding to a binary Lennard-Jones glass-forming mixture for different temperatures at the $\\alpha$ relaxation time~\\cite{Berthier:07b}.\nSee the details in \\cite{supp}.\n}\n\\end{figure*}\n\n\n\\textit{Model}.---Our model is based on a common picture which has emerged for glassy systems connecting the slowing down of the dynamics to the cage effect~\\cite{Berthier:07,Pastore:14,Pastore:15}. The escape of the particle from the local confinement stems from structural rearrangements of the system. The activation of such sudden and irreversible reorganization can be of three types: spontaneous thermal fluctuations, external shear, or internal self-propulsion. In what follows, we refer to such a process as a directed event, by contrast to the passive diffusion of the particle within the cage.\n\n\nWe consider a particle confined within a harmonic cage of typical size ${\\sigma}$. We introduce the time scale ${\\tau_\\text{\\tiny R}}$ quantifying the time needed by the particle to explore the cage. The fluctuations of the particle in the cage are driven by a noise of amplitude $D={\\sigma}^2/{\\tau_\\text{\\tiny R}}$. To account for structural rearrangements, we assume that the central position of the cage is subjected to random shifts. This is to mimic the modification of the metastable state explored by the particle. The cage hops instantaneously by a random distance, which is exponentially distributed with a characteristic hopping length ${\\varepsilon}$. The time between two consecutive hops is also exponentially distributed, with a mean value $\\tau_0$. After a cage rearrangement, the particle relaxes towards the new cage position. We regard such relaxation as an equilibrium process. The fluctuation-dissipation theorem enforces that the relaxation time should equal the typical time of exploration  ${\\tau_\\text{\\tiny R}}$. We end up describing the one-dimensional dynamics of the particle position $x$ as\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:dyn}\n\\f{{\\text{d}} x}{{\\text{d}} t} = -\\f{x(t)-x_0(t)}{{\\tau_\\text{\\tiny R}}} + \\xi_\\text{\\tiny G}(t), \\quad \\f{{\\text{d}} x_0}{{\\text{d}} t} = {\\xi_\\text{\\tiny NG}}(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\f{{\\text{d}}x}{{\\text{d}}t}=-\\f{x(t)-x_{0}(t)}{{\\tau_{\\text{\\tiny R}}}}+\\xi_{%&#10;\\text{\\tiny G}}(t),\\quad\\f{{\\text{d}}x_{0}}{{\\text{d}}t}={\\xi_{\\text{\\tiny NG}%&#10;}}(t),\" display=\"block\"><mrow><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><mi>t</mi></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><msub><mi>x</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>τ</mi><mtext mathsize=\"71%\">R</mtext></msub></mrow></mrow><mo>+</mo><mrow><msub><mi>ξ</mi><mtext mathsize=\"71%\">G</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><msub><mi>x</mi><mn>0</mn></msub><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><mi>t</mi></mrow><mo>=</mo><mrow><msub><mi>ξ</mi><mtext mathsize=\"71%\">NG</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06613.tex", "nexttext": "\nWe decouple caging and hopping dynamics, so that $\\xi_\\text{\\tiny G}$ and ${\\xi_\\text{\\tiny NG}}$ are uncorrelated processes. For symmetry reasons, only the $2n$-time correlation functions of ${\\xi_\\text{\\tiny NG}}$ are non zero. We will give arguments on the robustness of our results with respect to the noise statistics, as long as the absence of persistence time is conserved. We will explicitly demonstrate that the scale invariance of the small displacement distribution is indeed insensitive to the specifics of the hop distribution, but the exponential crossover regime to a Gaussian rests on a typical exponential distribution of cage hops.\n\n\nWe distinguish the passive and active fluctuations of the particle. The former are associated with the confined motion of the particle in a steady cage, as measured by $D$. The latter are induced by the cage hops, thus describing the motion in a non-confined environment characterized by the diffusion coefficient ${D_\\text{\\tiny A}}={\\varepsilon}^2/\\tau_0$. The coexistence of both Gaussian and non-Gaussian noises is crucially important to enhance non-Gaussian nature~\\cite{Kanazawa:15}.\n\n\n\n\n\n\\textit{Mean-square displacement and non-Gaussianity}.---As a first insight into the dynamics of our model, we study the time evolution of the mean-square displacement (MSD), controlled by three independent parameters $\\{{D},{D_\\text{\\tiny A}},{\\tau_\\text{\\tiny R}}\\}$. It is diffusive at short and long times with diffusion coefficients ${D}$ and ${D_\\text{\\tiny A}}$, respectively [Fig.~\\ref{fig:sum}(a)]. The predictions for a steady and a hopping cage coincide at times shorter than ${t^*}={\\tau_\\text{\\tiny R}}{D}/{D_\\text{\\tiny A}}=\\tau_0({\\sigma}/{\\varepsilon})^2$, referred to as the passive regime. This shows that the effect of the active fluctuations is hidden as long as the typical distance covered by the cage ${\\varepsilon}\\sqrt{t/\\tau_0}$ is smaller than the cage size ${\\sigma}$. Between the two diffusions, a plateau regime appears when ${D_\\text{\\tiny A}}\\ll{D}$, as an evidence of the cage effect, and we observe a transient superdiffusion if ${D_\\text{\\tiny A}}\\gg{D}$. The time when the MSD deviates from the plateau, equal to ${t^*}$, can be shifted to an arbitrary large value. Conversely, the time when superdiffusion arises, also equal to ${t^*}$, can be arbitrarily short~\\cite{supp,Rao:14}. Our model contains the existence of ballistic directed events, as assessed by the superdiffusion, even if there is no persistence time in its formulation. \n\n\nThe deviation of the displacement distribution from Gaussian is quantified by the non-Gaussian parameter (NGP), defined as $\\avg{\\Delta x^4}/3/\\avg{\\Delta x^2}^2 -1$. It characterizes the amount of directed events in the particle trajectory, thus probing the structural rearrangements of the system. Its evolution is determined by $\\{{D_\\text{\\tiny A}}/{D},{\\tau_\\text{\\tiny R}},\\tau_0\\}$, where $\\tau_0$ only affects the amplitude. The NGP vanishes at short and long time, corresponding to the passive and active Gaussian regimes, respectively. It takes positive values in the transient regime, for which the distribution is broader than Gaussian [Fig.~\\ref{fig:sum}(b)]. When ${D_\\text{\\tiny A}}\\ll{D}$, the peak time equals $t^*$, namely the time when the MSD deviates from the transient plateau, as assessed in colloidal systems~\\cite{Weeks:00,Weeks:02,Weeks:07,Weeks:15,Kilfoil:09}, and the peak value reads $({\\varepsilon}/{\\sigma})^2/2$. When ${D_\\text{\\tiny A}}\\gg{D}$, there is a plateau regime around the peak value, equal to $2\\tau_0/{\\tau_\\text{\\tiny R}}$. In both cases, the NGP starts to decrease when the long time diffusive regime sets in.\n\n\n\n\n\n\\textit{Distribution of displacement}.---To characterize the higher order fluctuations of the displacement, we investigate the spatial Fourier transform of the displacement distribution, defined as\n\n", "itemtype": "equation", "pos": 9530, "prevtext": "\nwhere $\\xi_\\text{\\tiny G}$ is a zero-mean Gaussian white noise with correlations $\\avg{\\xi_\\text{\\tiny G}(t)\\xi_\\text{\\tiny G}(t')}=2{D}\\delta(t-t')$. More realistic higher-dimensional generalizations do not induce any physical difference with the one-dimensional modeling we adopt here.\n\n\nOur motivations for the explicit form of the noise ${\\xi_\\text{\\tiny NG}}$ acting on the cage are twofold. One the one hand, we expect the rare intermittent events behind the $\\alpha$ relaxation to be unable to build up uncorrelated Gaussian statistics. On the other hand, we choose a specific form which has the advantage of allowing for a closed form analytic solution that will ease the subsequent analysis. It leads us to consider a zero-mean non-Gaussian white noise with cumulants\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:va}\n\\avgc{{\\xi_\\text{\\tiny NG}}(t_1)\\dots {\\xi_\\text{\\tiny NG}}(t_{2n})}=(2n)!\\f{{\\varepsilon}^{2n}}{\\tau_0}\\delta_{2n}(t_1,\\dots, t_{2n}).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\avgc{{\\xi_{\\text{\\tiny NG}}}(t_{1})\\dots{\\xi_{\\text{\\tiny NG}}}(t_{2n})}=(2n)%&#10;!\\f{{\\varepsilon}^{2n}}{\\tau_{0}}\\delta_{2n}(t_{1},\\dots,t_{2n}).\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\avgc</mtext></merror><mo>⁢</mo><msub><mi>ξ</mi><mtext mathsize=\"71%\">NG</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">…</mi><mo>⁢</mo><msub><mi>ξ</mi><mtext mathsize=\"71%\">NG</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><msup><mi>ε</mi><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow></msup><mo>⁢</mo><msub><mi>τ</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>δ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><msub><mi>t</mi><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06613.tex", "nexttext": "\nWe compute it in terms of the microscopic ingredients\n\\begin{eqnarray}\\label{eq:tP}\n\\tilde P(q,t) &=& \\exp \\cur{ -\\f{ {\\tau_\\text{\\tiny R}} q{\\varepsilon} /\\tau_0 }{1+(q{\\varepsilon})^2} \\brt{ \\f{q{\\varepsilon} t}{{\\tau_\\text{\\tiny R}}}  -\\arctan\\pnt{q{\\varepsilon}{f_t}} } }\n\\nonumber\n\\\\\n& &\\times\\brt{1+(q{\\varepsilon}{f_t})^2}^{-\\f{{\\tau_\\text{\\tiny R}}}{2\\tau_0}\\f{(q{\\varepsilon})^2}{1+(q{\\varepsilon})^2}}{\\text{e}}^{-(q{\\sigma})^2{f_t}},\n\\end{eqnarray}\nwhere ${f_t}=1-{\\text{e}}^{-t/{\\tau_\\text{\\tiny R}}}$~\\cite{supp}. The displacement distribution is Gaussian at short and long times, corresponding respectively to the passive and active diffusions. In the intermediate transient regime, it is Gaussian for small and large displacements, with a non-Gaussian cross-over in between.\n\n\nThe accessible range of displacements for experimental and simulated systems does not always allow one to observe the large Gaussian part of the distribution (they can clearly be seen, though, in \\cite{Kilfoil:09}). The existence of directed events is quantified through the deviation from the central Gaussian, that is \\textit{via} the cross-over between the two Gaussian parts. Within our model, it is given by exponential tails, as commonly reported in glassy systems~\\cite{Berthier:07}, of the form ${\\text{e}}^{ - \\abs{\\Delta x} / \\pnt{ {\\varepsilon} {f_t} } }$. \n\n\nTo demonstrate that our model is sufficient to capture the transition from a central Gaussian part to exponential tails in glassy systems, we compare our results with existing data for a dense suspension of colloidal particles~\\cite{Kilfoil:09} and a binary Lennard-Jones mixture~\\cite{Berthier:07, Berthier:07b}. For the colloidal system, we reproduce the time evolution of the distribution with parameters $\\cur{\\tau_0/{\\tau_\\text{\\tiny R}}, {\\varepsilon}/\\sigma} = \\cur{25, 6}$ [Fig.~\\ref{fig:sum}(c)]. In the Lennard-Jones mixture, the measurements are taken for four temperatures at the $\\alpha$ relaxation time, corresponding to $t^*$ within our model (see below). The central Gaussian part barely varies whereas the tails decrease with temperature. We identify the temperature with the diffusion coefficient $D$ of the confined motion, and we adjust the corresponding exponential tails with ${\\varepsilon} = \\cur{0.2, 0.25, 0.29, 0.33}$ from left to right in Fig.~\\ref{fig:sum}(d). Available data supporting our choice of an exponential cage hop distribution however extend over a single decade, and it is likely that other choices of distribution could fit the data.\n\n\nTo further characterize  the departure from the central Gaussian, we determine the intermediate displacement part of the distribution $P_\\text{int}$ which does not include the exponential tails. We focus on the case $\\tau_0 > {\\tau_\\text{\\tiny R}}$, namely when the time needed for the particle to relax within the cage is shorter than two successive cage hops, yielding\n\n", "itemtype": "equation", "pos": 13594, "prevtext": "\nWe decouple caging and hopping dynamics, so that $\\xi_\\text{\\tiny G}$ and ${\\xi_\\text{\\tiny NG}}$ are uncorrelated processes. For symmetry reasons, only the $2n$-time correlation functions of ${\\xi_\\text{\\tiny NG}}$ are non zero. We will give arguments on the robustness of our results with respect to the noise statistics, as long as the absence of persistence time is conserved. We will explicitly demonstrate that the scale invariance of the small displacement distribution is indeed insensitive to the specifics of the hop distribution, but the exponential crossover regime to a Gaussian rests on a typical exponential distribution of cage hops.\n\n\nWe distinguish the passive and active fluctuations of the particle. The former are associated with the confined motion of the particle in a steady cage, as measured by $D$. The latter are induced by the cage hops, thus describing the motion in a non-confined environment characterized by the diffusion coefficient ${D_\\text{\\tiny A}}={\\varepsilon}^2/\\tau_0$. The coexistence of both Gaussian and non-Gaussian noises is crucially important to enhance non-Gaussian nature~\\cite{Kanazawa:15}.\n\n\n\n\n\n\\textit{Mean-square displacement and non-Gaussianity}.---As a first insight into the dynamics of our model, we study the time evolution of the mean-square displacement (MSD), controlled by three independent parameters $\\{{D},{D_\\text{\\tiny A}},{\\tau_\\text{\\tiny R}}\\}$. It is diffusive at short and long times with diffusion coefficients ${D}$ and ${D_\\text{\\tiny A}}$, respectively [Fig.~\\ref{fig:sum}(a)]. The predictions for a steady and a hopping cage coincide at times shorter than ${t^*}={\\tau_\\text{\\tiny R}}{D}/{D_\\text{\\tiny A}}=\\tau_0({\\sigma}/{\\varepsilon})^2$, referred to as the passive regime. This shows that the effect of the active fluctuations is hidden as long as the typical distance covered by the cage ${\\varepsilon}\\sqrt{t/\\tau_0}$ is smaller than the cage size ${\\sigma}$. Between the two diffusions, a plateau regime appears when ${D_\\text{\\tiny A}}\\ll{D}$, as an evidence of the cage effect, and we observe a transient superdiffusion if ${D_\\text{\\tiny A}}\\gg{D}$. The time when the MSD deviates from the plateau, equal to ${t^*}$, can be shifted to an arbitrary large value. Conversely, the time when superdiffusion arises, also equal to ${t^*}$, can be arbitrarily short~\\cite{supp,Rao:14}. Our model contains the existence of ballistic directed events, as assessed by the superdiffusion, even if there is no persistence time in its formulation. \n\n\nThe deviation of the displacement distribution from Gaussian is quantified by the non-Gaussian parameter (NGP), defined as $\\avg{\\Delta x^4}/3/\\avg{\\Delta x^2}^2 -1$. It characterizes the amount of directed events in the particle trajectory, thus probing the structural rearrangements of the system. Its evolution is determined by $\\{{D_\\text{\\tiny A}}/{D},{\\tau_\\text{\\tiny R}},\\tau_0\\}$, where $\\tau_0$ only affects the amplitude. The NGP vanishes at short and long time, corresponding to the passive and active Gaussian regimes, respectively. It takes positive values in the transient regime, for which the distribution is broader than Gaussian [Fig.~\\ref{fig:sum}(b)]. When ${D_\\text{\\tiny A}}\\ll{D}$, the peak time equals $t^*$, namely the time when the MSD deviates from the transient plateau, as assessed in colloidal systems~\\cite{Weeks:00,Weeks:02,Weeks:07,Weeks:15,Kilfoil:09}, and the peak value reads $({\\varepsilon}/{\\sigma})^2/2$. When ${D_\\text{\\tiny A}}\\gg{D}$, there is a plateau regime around the peak value, equal to $2\\tau_0/{\\tau_\\text{\\tiny R}}$. In both cases, the NGP starts to decrease when the long time diffusive regime sets in.\n\n\n\n\n\n\\textit{Distribution of displacement}.---To characterize the higher order fluctuations of the displacement, we investigate the spatial Fourier transform of the displacement distribution, defined as\n\n", "index": 5, "text": "\\begin{equation}\n\\tilde P(q,t) = \\int {\\text{d}} x {\\text{e}}^{{\\text{i}} q x} P(x,t) = \\underset{{t_\\text{w}}\\to\\infty}{\\lim}\\avg{ {\\text{e}}^{{\\text{i}} q \\brt{ x(t+{t_\\text{w}}) - x(t) }} }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\tilde{P}(q,t)=\\int{\\text{d}}x{\\text{e}}^{{\\text{i}}qx}P(x,t)=\\underset{{t_{%&#10;\\text{w}}}\\to\\infty}{\\lim}\\avg{{\\text{e}}^{{\\text{i}}q\\brt{x(t+{t_{\\text{w}}})%&#10;-x(t)}}}.\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><mi>P</mi><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mtext>d</mtext><mo>⁢</mo><mi>x</mi><mo>⁢</mo><msup><mtext>e</mtext><mrow><mtext>i</mtext><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mi>x</mi></mrow></msup><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><munder accentunder=\"true\"><mo movablelimits=\"false\">lim</mo><mrow><msub><mi>t</mi><mtext>w</mtext></msub><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\avg</mtext></merror><mo>⁢</mo><msup><mtext>e</mtext><mrow><mrow><mtext>i</mtext><mo>⁢</mo><mi>q</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\brt</mtext></merror><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><msub><mi>t</mi><mtext>w</mtext></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06613.tex", "nexttext": "\nwhere ${_1}F_1$ is the confluent hypergeometric function of the first kind~\\cite{supp}. It depends on the hopping statistics only \\textit{via} the typical waiting time $\\tau_0$ between two successive cage hops, thus being independent of the hopping length ${\\varepsilon}$. Besides, this result remains unchanged for any hopping distribution. This suggests that the  intermediate displacement distribution is an appropriate probe to reveal universal behavior in glassy systems.\n\n\nEquation~\\eqref{eq:1F1} reveals that the intermediate displacement distribution is scale invariant. The existence of a master curve for the scaled Van Hove function has already been reported in colloidal systems~\\cite{Weeks:00,Weeks:02}. Within our model, a convenient scaling factor is given by ${\\sigma}\\sqrt{2{f_t}/(1-{\\tau_\\text{\\tiny R}}/\\tau_0)}$, namely the standard deviation of the central Gaussian part. The asymptotic solution for intermediate scaled displacements is entirely determined by $\\tau_0/{\\tau_\\text{\\tiny R}}$, its central part being invariant under modification of this parameter. The deviation from Gaussianity is characterized by power-law tails with the exponent ${\\tau_\\text{\\tiny R}}/\\tau_0-1$. As $\\tau_0/{\\tau_\\text{\\tiny R}}$ increases, the transition from Gaussian to power-law behavior becomes sharper, and the power-law exponent tends to $-1$.\n\n\nAn important quantity of interest is the typical scaled displacement of the cross-over between the central Gaussian part and the tails. We predict that the cross-over value $X$ depends weakly on $\\tau_0/{\\tau_\\text{\\tiny R}}$ for large values of this parameter, $X$ varying approximately between three and five when $\\tau_0/{\\tau_\\text{\\tiny R}}$ spans three decades from $10^2$ to $10^5$ (see Fig.~(S2) in~\\cite{supp}). A cross-over value of order one is consistent with experimental observations~\\cite{Weeks:00,Weeks:02}.\n\n\n\n\n\n\\textit{Scattering function}.---The comparison with glassy dynamics can be extended further by investigating the time evolution of the Fourier displacement distribution $\\tilde P(q,t)$. To this end, we should determine the appropriate value of $q$ to be fixed. We regard $\\tilde P(q,t)$ as the sISF for $N$-body systems\n\n", "itemtype": "equation", "pos": 16714, "prevtext": "\nWe compute it in terms of the microscopic ingredients\n\\begin{eqnarray}\\label{eq:tP}\n\\tilde P(q,t) &=& \\exp \\cur{ -\\f{ {\\tau_\\text{\\tiny R}} q{\\varepsilon} /\\tau_0 }{1+(q{\\varepsilon})^2} \\brt{ \\f{q{\\varepsilon} t}{{\\tau_\\text{\\tiny R}}}  -\\arctan\\pnt{q{\\varepsilon}{f_t}} } }\n\\nonumber\n\\\\\n& &\\times\\brt{1+(q{\\varepsilon}{f_t})^2}^{-\\f{{\\tau_\\text{\\tiny R}}}{2\\tau_0}\\f{(q{\\varepsilon})^2}{1+(q{\\varepsilon})^2}}{\\text{e}}^{-(q{\\sigma})^2{f_t}},\n\\end{eqnarray}\nwhere ${f_t}=1-{\\text{e}}^{-t/{\\tau_\\text{\\tiny R}}}$~\\cite{supp}. The displacement distribution is Gaussian at short and long times, corresponding respectively to the passive and active diffusions. In the intermediate transient regime, it is Gaussian for small and large displacements, with a non-Gaussian cross-over in between.\n\n\nThe accessible range of displacements for experimental and simulated systems does not always allow one to observe the large Gaussian part of the distribution (they can clearly be seen, though, in \\cite{Kilfoil:09}). The existence of directed events is quantified through the deviation from the central Gaussian, that is \\textit{via} the cross-over between the two Gaussian parts. Within our model, it is given by exponential tails, as commonly reported in glassy systems~\\cite{Berthier:07}, of the form ${\\text{e}}^{ - \\abs{\\Delta x} / \\pnt{ {\\varepsilon} {f_t} } }$. \n\n\nTo demonstrate that our model is sufficient to capture the transition from a central Gaussian part to exponential tails in glassy systems, we compare our results with existing data for a dense suspension of colloidal particles~\\cite{Kilfoil:09} and a binary Lennard-Jones mixture~\\cite{Berthier:07, Berthier:07b}. For the colloidal system, we reproduce the time evolution of the distribution with parameters $\\cur{\\tau_0/{\\tau_\\text{\\tiny R}}, {\\varepsilon}/\\sigma} = \\cur{25, 6}$ [Fig.~\\ref{fig:sum}(c)]. In the Lennard-Jones mixture, the measurements are taken for four temperatures at the $\\alpha$ relaxation time, corresponding to $t^*$ within our model (see below). The central Gaussian part barely varies whereas the tails decrease with temperature. We identify the temperature with the diffusion coefficient $D$ of the confined motion, and we adjust the corresponding exponential tails with ${\\varepsilon} = \\cur{0.2, 0.25, 0.29, 0.33}$ from left to right in Fig.~\\ref{fig:sum}(d). Available data supporting our choice of an exponential cage hop distribution however extend over a single decade, and it is likely that other choices of distribution could fit the data.\n\n\nTo further characterize  the departure from the central Gaussian, we determine the intermediate displacement part of the distribution $P_\\text{int}$ which does not include the exponential tails. We focus on the case $\\tau_0 > {\\tau_\\text{\\tiny R}}$, namely when the time needed for the particle to relax within the cage is shorter than two successive cage hops, yielding\n\n", "index": 7, "text": "\\begin{equation}\\label{eq:1F1}\nP_\\text{int}(\\Delta x,t) = {_1}F_1\\brt{\\f{\\tau_0-{\\tau_\\text{\\tiny R}}}{2\\tau_0},\\f{1}{2} ; -\\f{(\\Delta x/{\\sigma})^2}{ 4 {f_t} } },\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P_{\\text{int}}(\\Delta x,t)={{}_{1}}F_{1}\\brt{\\f{\\tau_{0}-{\\tau_{\\text{\\tiny R}%&#10;}}}{2\\tau_{0}},\\f{1}{2};-\\f{(\\Delta x/{\\sigma})^{2}}{4{f_{t}}}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mtext>int</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mmultiscripts><mi>F</mi><mn>1</mn><none/><mprescripts/><mn>1</mn><none/></mmultiscripts><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\brt</mtext></merror><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><msub><mi>τ</mi><mn>0</mn></msub></mrow><mo>-</mo><mrow><msub><mi>τ</mi><mtext mathsize=\"71%\">R</mtext></msub><mo>⁢</mo><mn>2</mn><mo>⁢</mo><msub><mi>τ</mi><mn>0</mn></msub></mrow></mrow><mo>,</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mn>12</mn></mrow><mo>;</mo><mrow><mo>-</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>x</mi></mrow><mo>/</mo><mi>σ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mn>4</mn><mo>⁢</mo><msub><mi>f</mi><mi>t</mi></msub></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06613.tex", "nexttext": "\nIn such systems, the relevant choice for $q$ is the value at the first peak of the structure factor, which corresponds to the inverse of the typical interparticle distance. Provided that caging stems from the steric hindrance, the typical distance between particles should be encoded in the cage size. It leads us to choose $1/{\\sigma}$ as the appropriate wavelength.\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=\\columnwidth]{plot_ISFb.pdf}\n\\caption{\\label{fig:F}\nFlow curves of the Fourier displacement distribution at $q=1/\\sigma$. The transition from a single to a two-step relaxation as ${D_\\text{\\tiny A}}/{D}$ decreases is the hallmark of glassy systems. There is no terminal relaxation for a steady cage (solid black line). (Inset)~We scale the time by the terminal relaxation time to reveal an exponential master curve (dot-dashed line).\n}\n\\end{figure}\n\n\nThere is a transition from a single to a two-step relaxation of the sISF as ${D_\\text{\\tiny A}}/{D}$ decreases [Fig.~\\ref{fig:F}]. This is typical of the behavior observed in glasses, the two-step dynamics being reminiscent of the $\\beta$ and $\\alpha$ relaxations. The sISF for a steady cage relaxes within a time ${\\tau_\\text{\\tiny R}}$ to a nonzero value, equal to the transient plateau value of the sISF for a hopping cage. Such behavior is similar to the kinetic arrest reported in glasses, when the particle evolves in a metastable state for an infinite long time. The plateau value reads ${\\text{e}}^{-(q{\\sigma})^2}$ for an arbitrary wavelength. Cage rearrangements occur in the active case; then the particle overcomes the local confinement. The terminal relaxation for single and two-step dynamics starts at time $t^*$, namely when the passive regime ends. For a two-step dynamics, the terminal relaxation occurs when the NGP reaches its peak value~\\cite{Kob:97,Kilfoil:09,Weeks:11,Weeks:15,Ikeda:12,Vogel}, and it can be shifted to an arbitrary long time~\\cite{Stuart:13}.\n\n\nThe sISF is Gaussian at all times when ${\\varepsilon}\\ll{\\sigma}$, the structural relaxation thus being entirely determined by the MSD. In such a case, the long time behavior is independent of ${D_\\text{\\tiny A}}$ when scaling the time by ${t^*}$. For a two-step relaxation, the corresponding master curve ${\\text{e}}^{- (1+t/t^*)}$ is exponential [Inset of Fig.~\\ref{fig:F}]. A stretched exponential is usually reported, with an exponent close to one~\\cite{Barrat:02,Berthier:02}. Our result suggests that one would clearly observe exponential behavior when the terminal relaxation time $t^*$ is large compared with the time ${\\tau_\\text{\\tiny R}}$ of the first relaxation. The non-Gaussian fluctuations play a role in the dynamics if ${\\varepsilon}\\gtrsim{\\sigma}$, the higher order statistics of the displacement thereby affecting the relaxation of the system~\\cite{supp}.\n\n\n\n\n\n\\textit{Relation with many-body systems}.---To understand how our one-body approach connects with multicomponent systems, we derive the master equation for the displacement distribution. We compare it with the dynamical equation for the Van Hove function of interacting particles subjected to Gaussian fluctuations. It follows that our model can be seen as resulting from a Random Phase Approximation treatment of a system of Langevin particles with a diffusion constant $D{\\text{e}}^{-t/{\\tau_\\text{\\tiny R}}}$ interacting via a two-body potential given by~\\cite{supp}\n\n", "itemtype": "equation", "pos": 19102, "prevtext": "\nwhere ${_1}F_1$ is the confluent hypergeometric function of the first kind~\\cite{supp}. It depends on the hopping statistics only \\textit{via} the typical waiting time $\\tau_0$ between two successive cage hops, thus being independent of the hopping length ${\\varepsilon}$. Besides, this result remains unchanged for any hopping distribution. This suggests that the  intermediate displacement distribution is an appropriate probe to reveal universal behavior in glassy systems.\n\n\nEquation~\\eqref{eq:1F1} reveals that the intermediate displacement distribution is scale invariant. The existence of a master curve for the scaled Van Hove function has already been reported in colloidal systems~\\cite{Weeks:00,Weeks:02}. Within our model, a convenient scaling factor is given by ${\\sigma}\\sqrt{2{f_t}/(1-{\\tau_\\text{\\tiny R}}/\\tau_0)}$, namely the standard deviation of the central Gaussian part. The asymptotic solution for intermediate scaled displacements is entirely determined by $\\tau_0/{\\tau_\\text{\\tiny R}}$, its central part being invariant under modification of this parameter. The deviation from Gaussianity is characterized by power-law tails with the exponent ${\\tau_\\text{\\tiny R}}/\\tau_0-1$. As $\\tau_0/{\\tau_\\text{\\tiny R}}$ increases, the transition from Gaussian to power-law behavior becomes sharper, and the power-law exponent tends to $-1$.\n\n\nAn important quantity of interest is the typical scaled displacement of the cross-over between the central Gaussian part and the tails. We predict that the cross-over value $X$ depends weakly on $\\tau_0/{\\tau_\\text{\\tiny R}}$ for large values of this parameter, $X$ varying approximately between three and five when $\\tau_0/{\\tau_\\text{\\tiny R}}$ spans three decades from $10^2$ to $10^5$ (see Fig.~(S2) in~\\cite{supp}). A cross-over value of order one is consistent with experimental observations~\\cite{Weeks:00,Weeks:02}.\n\n\n\n\n\n\\textit{Scattering function}.---The comparison with glassy dynamics can be extended further by investigating the time evolution of the Fourier displacement distribution $\\tilde P(q,t)$. To this end, we should determine the appropriate value of $q$ to be fixed. We regard $\\tilde P(q,t)$ as the sISF for $N$-body systems\n\n", "index": 9, "text": "\\begin{equation}\nF_\\text{\\tiny S}(q,t) = \\f{1}{N} \\sum_{i=1}^N \\avg{  {\\text{e}}^{{\\text{i}} q \\brt{x_i(t) -x_i(0)}} }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"F_{\\text{\\tiny S}}(q,t)=\\f{1}{N}\\sum_{i=1}^{N}\\avg{{\\text{e}}^{{\\text{i}}q\\brt%&#10;{x_{i}(t)-x_{i}(0)}}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mtext mathsize=\"71%\">S</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\avg</mtext></merror><mo>⁢</mo><msup><mtext>e</mtext><mrow><mrow><mtext>i</mtext><mo>⁢</mo><mi>q</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\brt</mtext></merror><mo>⁢</mo><msub><mi>x</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>x</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06613.tex", "nexttext": "\nwhere $\\rho_0$ is the particle density, and $\\zeta$ is a friction coefficient. Such potential describes repulsive interactions with a very soft core, thus allowing the overlap of the particles with a finite cost of energy~\\cite{Dyre}. The range of interaction increases with time as ${f_t}$, namely it saturates within a time ${\\tau_\\text{\\tiny R}}$ to ${\\varepsilon}$. Therefore, there is a transition between: (i) a diffusive dynamics with very short interaction, (ii) a dynamics with a very small diffusion coefficient and a larger interaction range, corresponding respectively to times shorter and longer than ${\\tau_\\text{\\tiny R}}$. The existence of interactions is a direct consequence of the cage rearrangements within our model. The explicit form of the potential is determined by the statistics of the cage hops, which are exponentially distributed in the present case. This suggests that the non-Gaussian properties of the particle dynamics hold information about the details of interaction between the particles.\n\n\n\n\n\n\\textit{Discussion}.---We have presented a minimal model of a particle immersed in a glassy system, based on an active cage with non-Gaussian dynamics. Despite the simplicity of this model, we have demonstrated that its dynamics encompasses the complex behaviors arising in glassy systems, and that the onset of glassy behavior is shifted by the active component of the dynamics, in line with numerical evidence~\\cite{Stuart:13,Berthier:14,Rao:14,Gomper:14}. Moreover, we have highlighted the scale invariance of the small displacement distribution. The dynamics of tracers in living systems shares common features with the glassy dynamics~\\cite{Bursac,Zhou:09}. The tracers can be either attached or embedded in a network of filaments, whose rearrangement is induced by nonequilibrium processes, thus monitoring transitions between locally stable configurations~\\cite{Weitz:09, Ahmed:15}. The minimal approach of intermittent dynamics that we offer in the present paper should also be relevant for a large variety of biological systems~\\cite{Mizuno:14a, Mizuno:14b, Kanazawa:14, Visco:15, Gov:15, Riveline:15, Ahmed:15b, Ahmed:15c}, as a useful tool to understand the existence of a scale-invariant regime in the tracer displacement~\\cite{Bursac,Weihs,Granick}.\n\n\n\n\n\n\\'EF and FvW acknowledge the support of the YITP and SoftActive program, as well as of the JSPS core-to-core program ``Non-equilibrium dynamics of soft matter and information\". \\'EF also acknowledges useful discussions with Kiyoshi Kanazawa. This work was partially supported by JSPS KAKENHI Grant No. 25287098.\n\n\n\\bibliographystyle{apsrev4-1}\n\\bibliography{draft-ref}\n\n\n", "itemtype": "equation", "pos": 22643, "prevtext": "\nIn such systems, the relevant choice for $q$ is the value at the first peak of the structure factor, which corresponds to the inverse of the typical interparticle distance. Provided that caging stems from the steric hindrance, the typical distance between particles should be encoded in the cage size. It leads us to choose $1/{\\sigma}$ as the appropriate wavelength.\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=\\columnwidth]{plot_ISFb.pdf}\n\\caption{\\label{fig:F}\nFlow curves of the Fourier displacement distribution at $q=1/\\sigma$. The transition from a single to a two-step relaxation as ${D_\\text{\\tiny A}}/{D}$ decreases is the hallmark of glassy systems. There is no terminal relaxation for a steady cage (solid black line). (Inset)~We scale the time by the terminal relaxation time to reveal an exponential master curve (dot-dashed line).\n}\n\\end{figure}\n\n\nThere is a transition from a single to a two-step relaxation of the sISF as ${D_\\text{\\tiny A}}/{D}$ decreases [Fig.~\\ref{fig:F}]. This is typical of the behavior observed in glasses, the two-step dynamics being reminiscent of the $\\beta$ and $\\alpha$ relaxations. The sISF for a steady cage relaxes within a time ${\\tau_\\text{\\tiny R}}$ to a nonzero value, equal to the transient plateau value of the sISF for a hopping cage. Such behavior is similar to the kinetic arrest reported in glasses, when the particle evolves in a metastable state for an infinite long time. The plateau value reads ${\\text{e}}^{-(q{\\sigma})^2}$ for an arbitrary wavelength. Cage rearrangements occur in the active case; then the particle overcomes the local confinement. The terminal relaxation for single and two-step dynamics starts at time $t^*$, namely when the passive regime ends. For a two-step dynamics, the terminal relaxation occurs when the NGP reaches its peak value~\\cite{Kob:97,Kilfoil:09,Weeks:11,Weeks:15,Ikeda:12,Vogel}, and it can be shifted to an arbitrary long time~\\cite{Stuart:13}.\n\n\nThe sISF is Gaussian at all times when ${\\varepsilon}\\ll{\\sigma}$, the structural relaxation thus being entirely determined by the MSD. In such a case, the long time behavior is independent of ${D_\\text{\\tiny A}}$ when scaling the time by ${t^*}$. For a two-step relaxation, the corresponding master curve ${\\text{e}}^{- (1+t/t^*)}$ is exponential [Inset of Fig.~\\ref{fig:F}]. A stretched exponential is usually reported, with an exponent close to one~\\cite{Barrat:02,Berthier:02}. Our result suggests that one would clearly observe exponential behavior when the terminal relaxation time $t^*$ is large compared with the time ${\\tau_\\text{\\tiny R}}$ of the first relaxation. The non-Gaussian fluctuations play a role in the dynamics if ${\\varepsilon}\\gtrsim{\\sigma}$, the higher order statistics of the displacement thereby affecting the relaxation of the system~\\cite{supp}.\n\n\n\n\n\n\\textit{Relation with many-body systems}.---To understand how our one-body approach connects with multicomponent systems, we derive the master equation for the displacement distribution. We compare it with the dynamical equation for the Van Hove function of interacting particles subjected to Gaussian fluctuations. It follows that our model can be seen as resulting from a Random Phase Approximation treatment of a system of Langevin particles with a diffusion constant $D{\\text{e}}^{-t/{\\tau_\\text{\\tiny R}}}$ interacting via a two-body potential given by~\\cite{supp}\n\n", "index": 11, "text": "\\begin{equation}\\label{eq:Veff}\nV_\\text{eff}(x,t) = \\f{\\zeta{\\varepsilon}}{2 \\rho_0 \\tau_0} \\exp \\pnt{-\\f{\\abs{x}}{{\\varepsilon}{f_t}}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"V_{\\text{eff}}(x,t)=\\f{\\zeta{\\varepsilon}}{2\\rho_{0}\\tau_{0}}\\exp\\pnt{-\\f{\\abs%&#10;{x}}{{\\varepsilon}{f_{t}}}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>V</mi><mtext>eff</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><mi>ζ</mi><mo>⁢</mo><mi>ε</mi><mo>⁢</mo><mn>2</mn><mo>⁢</mo><msub><mi>ρ</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>τ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\pnt</mtext></merror></mrow></mrow><mo>-</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\f</mtext></merror><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\abs</mtext></merror><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>ε</mi><mo>⁢</mo><msub><mi>f</mi><mi>t</mi></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]