[{"file": "1601.03140.tex", "nexttext": "\nwhere\n\\begin{subequations}\n\n", "itemtype": "equation", "pos": 6008, "prevtext": "\n\n\\title{Different types of nonlinear localized and periodic waves in an erbium-doped fiber system}\n\\author{Yang Ren$^1$}\n\\author{Zhan-Ying Yang$^1$}\\email{zyyang@nwu.edu.cn (Zhan-Ying Yang);\nnwudavid@163.com (Chong Liu)}\n\\author{Chong Liu$^{1}$}\n\\author{Wen-Li Yang$^2$}\n\\address{$^1$School of Physics, Northwest University, Xi'an\n710069, China}\n\\address{$^2$Institute of Modern Physics, Northwest University, Xi'an\n710069, China}\n \n\\date{August 10, 2015}\n\\begin{abstract}\nWe study nonlinear waves on a plane-wave background in an erbium-doped fiber system, which is governed by the coupled nonlinear Schr\\\"{o}dinger and the Maxwell-Bloch equations. We find that prolific different types of nonlinear localized and periodic waves do exist in the system, including multi-peak soliton, periodic wave, antidark soliton, and W-shaped soliton (as well as the known bright soliton, breather, and rogue wave). In particular, the dynamics of these waves can be extracted from a unified exact solution, and the corresponding existence conditions are presented explicitly. Our results demonstrate the structural diversity of the nonlinear waves in this system.\n\nKeywords: Erbium-doped fiber system; Nonlinear waves; Solitons; Nonlinear superposition.\n\\end{abstract}\n\\pacs{05.45.Yv, 02.30.Ik, 42.81.Dp}\n\n\\maketitle\n\n\\section{INTRODUCTION}\nNonlinear waves propagating in an erbium-doped fiber has attracted special attention, since the resonant absorption of the erbium-doped two levels system is a good solution to the fiber-optic signal attenuation problem \\cite{1}. In general, the dynamic of nonlinear waves in the erbium-doped fibers is described by the coupled nonlinear Schr\\\"{o}dinger and the Maxwell-Bloch (NLS-MB) models \\cite{1,s1,s2}. Like the standard NLS model, the standard bright (i.e., zero background) solitons \\cite{s1,s2}, and the localized waves on a plane-wave background, such as rogue waves \\cite{b1,b2} and breathers \\cite{b2,b3} in the NLS-MB system have been demonstrated.\n\nHowever, in contrast to the scalar NLS system, the coupled NLS-MB system possesses some additional system parameters and allows for interaction between different components, which potentially yields rich and significant localized-wave dynamics. Indeed, recent studies indicate that rich nonlinear localized structures do exist in the coupled NLS systems \\cite{n0,n1,n2,n3,n4,n5,n6,n7,n8}, such as rogue waves with different structures \\cite{n0,n1,n2}, coexistence of different types of localized nonlinear waves \\cite{n3,n4,n5,n6}, and so on \\cite{n7,n8}.\nOn the other hand, due to the breaking of the Galilean transformation for the plane-wave background fields, the background frequency plays a key role in the types of nonlinear waves and cannot be ignored in the coupled NLS-MB system. In fact, it is demonstrated recently that the different values of the background frequency in the higher-order NLS model (where the Galilean transformation is broken) can induce different types of localized waves \\cite{q1,q2}.\nMotivated by these results, we shall study prolific types of nonlinear waves in the NLS-MB system.\n\nIn this letter, we present intriguing different types of nonlinear localized and periodic waves in an erbium-doped fiber system, including multi-peak soliton, periodic wave, antidark soliton, and W-shaped soliton (as well as the known bright soliton, rogue wave, and breather). It is found that these waves can be extracted from a unified exact solution under specific parameter conditions. In particular, the multi-peak soliton could be regarded as a single pulse formed by a nonlinear superposition of a soliton and a periodic wave, where each has the same velocity.\n\n\\section{NLS-MB system and different types of nonlinear waves}\nWe consider a resonant erbium-doped fiber system governed by a coupled system of the NLS-MB equations \\cite{1,s1,s2}\n\\begin{eqnarray}\n\\label{equ:1}\n&&E_z=i(\\frac{1}{2}E_{tt}+|E|^2 E)+2P ,\\nonumber\\\\\n&&P_t=2i\\omega P+2E \\eta,\\nonumber\\\\\n&&\\eta_t=-(EP^*+PE^*),\n\\end{eqnarray}\nwhere $E(z,t)$ is the slowly varying envelope field; $P(z,t)$ is the measure of the polarization of\nthe resonant medium, which is defined by $P=v_1 v_2^*$; $\\eta(z, t)$ denotes the extent of the population inversion, which is given\nby $\\eta=|v_1|^2-|v_2|^2$, $v_1$ and $v_2$ are the wave functions of the two energy levels of the resonant atoms; $\\omega$ is the carrier frequency, and the index $*$ denotes complex conjugate.\nIn order to study abundant types of nonlinear structures in the NLS-MB model in contrast to the previous results \\cite{s1,s2,b1,b2,b3}, we first introduce the following plane-wave background solution with a generalized form\n\\begin{eqnarray}\n&&E_1=ae^{i\\theta},~P_1=i k E_1,~\\eta_1=\\omega k-q k/2,\n\\end{eqnarray}\nwhere $\\theta=q t+\\nu z$, $\\nu=a^2+2k-q^2/2$, $a$ and $q$ represent the amplitude and frequency of background electric field, respectively, and $k$ is a real parameter which is related to the background amplitude of $P$ component. If the background amplitudes vanish, Eq.(2) reduces to the trivial solution, which can be used to generate standard bright soliton solutions \\cite{s1,s2,m1,m2}.\nHere we will pay our attention to different types of nonlinear structures in electric field, i.e., the pulse propagation in the $E$ component.\nWe omit the results in the $P$, $\\eta$ components, since their types of nonlinear waves are similar to the ones in the $E$ component with the same initial physical parameters. We present the first-order exact nonlinear wave on the plane-wave solution (2) to reveal rich different types of nonlinear waves.\nThe construction method is based on the Darboux transformation technique \\cite{m3} applied to the Lax pair associated with the NLS-MB model.\nFor the details, one can construct the solution by solving the partial differential equations (Lax pair) starting from the initial seed solution (2). After that the general first-order exact nonlinear wave solution on the plane-wave background in the $E$ component is given\n\n", "index": 1, "text": "\\begin{equation}\nE=E_1\\left\\{1-\\frac{8bm_1[\\sin{(\\gamma+\\mu_1)}-i\\sinh{(\\beta+i\\mu_1)}]}\n {m_3\\sin{(\\gamma+\\mu_2)}-im_2\\sinh{(\\beta-i\\mu_3)}}\\right\\},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"E=E_{1}\\left\\{1-\\frac{8bm_{1}[\\sin{(\\gamma+\\mu_{1})}-i\\sinh{(\\beta+i\\mu_{1})}]%&#10;}{m_{3}\\sin{(\\gamma+\\mu_{2})}-im_{2}\\sinh{(\\beta-i\\mu_{3})}}\\right\\},\" display=\"block\"><mrow><mrow><mi>E</mi><mo>=</mo><mrow><msub><mi>E</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo>{</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mrow><mn>8</mn><mo>⁢</mo><mi>b</mi><mo>⁢</mo><msub><mi>m</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>γ</mi><mo>+</mo><msub><mi>μ</mi><mn>1</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>β</mi><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>μ</mi><mn>1</mn></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mrow><mrow><msub><mi>m</mi><mn>3</mn></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>γ</mi><mo>+</mo><msub><mi>μ</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>m</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>β</mi><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>μ</mi><mn>3</mn></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mfrac></mrow><mo>}</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03140.tex", "nexttext": "\n\\end{subequations}\n\nThe above expressions depend on the background wave amplitudes $a$, $k$, the background wave frequency $q$, the real parameter $b~(\\neq0)$, and the frequency $\\omega$. Once the structural parameter $\\omega$ is fixed, we are left with four independent parameters $a$, $k$, $q$, $b$.\n\nRemarkably, we find that the unified solution (3) describes abundant different types of nonlinear waves through different choices of the system parameters. For the details, we present a table (Table \\uppercase \\expandafter {\\romannumeral 1}) for the types of nonlinear waves and the corresponding chosen parameter conditions. To our knowledge, some new types of nonlinear waves such as multi-peak soliton, periodic wave, antidark soliton, and W-shaped soliton,\nare found in the system for the first time.\n\nTo reveal the properties of these new types of nonlinear structures in the system, let us pay our attention to the explicit function expression of the solution (3).\nIt depends on the hyperbolic functions ($\\sinh{\\beta}$) and the trigonometric functions ($\\sin{\\gamma}$), where $\\beta$ and $\\gamma$ are real functions of $z$ and $t$, and $V_1$, $V_2$ are the corresponding velocities. In this case, the hyperbolic functions and trigonometric functions describe the localization and the periodicity of the transverse distribution $t$ of the nonlinear waves, respectively. Hence this nonlinear structure could be regarded as a single pulse formed by a nonlinear superposition of a soliton and a periodic wave with velocities $V_1$, $V_2$. One should note that the nonlinear wave solution (3) is different from the two-soliton complex solutions \\cite{t1,t2} which mix hyperbolic functions of two different (spatial) arguments.\nInterestingly, we find that the nonlinear waves described by the unified solution (3) exhibit structural diversity depending on the values of velocity difference, i.e.,  $V_1-V_2$.\n\n\\begin{table}[!hbp]\n\\label{table1}\n  \\begin{tabular}{|c|c|}\n  \\hline\n  Nonlinear wave type  & Existence condition \\\\\n  \\hline\n  Breather & $b^2+\\omega^2\\neq k$, $a\\neq b$\\\\\n  \\hline\n  Rogue wave & $b^2+\\omega^2\\neq k$, $a=b$ \\\\\n  \\hline\n  Multi-peak soliton & $b^2+\\omega^2=k$, $q\\neq0$ \\\\\n  \\hline\n  Periodic wave &  $b^2+\\omega^2=k$, $q=0$, $a^2>b^2$ \\\\\n  \\hline\n  Antidark soliton & $b^2+\\omega^2=k$ , $q=0$, $a^2<b^2$\\\\\n  \\hline\n  W-shaped soliton & $b^2+\\omega^2=k$ , $q=0$, $a=b$\\\\\n  \\hline\n\\end{tabular}\n\\caption{Types of nonlinear waves in NLS-MB system.}\n\\end{table}\n\\begin{figure}[htb]\n\\centering\n\\subfigure[]{\\includegraphics[height=40mm,width=40mm]{fig1a.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=40mm,width=42mm]{fig1b.jpg}}\n\\caption{(a) Intensity distributions ($I=|E|^2$) of multi-peak solitons on a plane-wave background, (b) is the profile of (a) at $z=0$. The parameters are $a=1$, $b=0.5$, $\\omega=2$, and $q=10$.}\n\\end{figure}\n\nIn the case of nonzero velocity difference, i.e., $V_1\\neq V_2$, which implies $\\upsilon_2\\neq0$ (thus $k\\neq b^2+\\omega^2$), the expression (3) describes localized waves with breathing behavior on a plane-wave background (i.e., breathers and rogue waves).\nHere breathers are the localized breathing waves with a periodic profile in a certain direction; rogue waves are rare, short-lived, and localized in both space and time, which are some special cases of breathers. More specifically, if $q=0$, $\\upsilon_2\\neq0$, we obtain the Akhmediev breathers \\cite{AB} with $a>|b|$, the Kuznetsov-Ma breathers \\cite{KMB} with $a<|b|$, and the Peregrine rogue waves \\cite{Peregrine} with $a=b$.\nWe note that the solution (3) includes, as a special case $V_1\\neq V_2$, the breather and rogue wave solutions in the NLS-MB system that was reported\nin \\cite{b1,b2,b3}.\n\nInstead, if $V_1=V_2$, $q\\neq0$ (thus $\\zeta\\neq0$, $\\sigma\\neq0$), the pulse described by solution (3) is formed by a nonlinear superposition of a soliton and a periodic wave, where each has the same velocity $\\upsilon_1$. This result is well depicted in Fig. 1. As expected, in this case, the expression (3) describes a new multi-peak soliton-like pulse propagating along $z$ direction. Namely, the feature of this wave comes from a mixture of a soliton and a periodic wave.\nIt is interesting, as it looks like higher-order solitons but appears on a plane-wave background.\nIt should be pointed out that this wave structure is different from the multi-soliton complex \\cite{s} formed by a nonlinear superposition of fundamental solitons in coupled NLS systems. We also note that similar multi-peak structures has been observed numerically in the AC-driven damped NLS system \\cite{ac1,ac2}. The similarity between the multi-peak NLS-MB solitons reported here, and the AC-driven solitons \\cite{ac1,ac2}, is not coincidental. In the limit $\\eta \\rightarrow 0$, the NLS-MB system (1) reduces to the AC-driven NLS equation.\n\nAdditionally, the plane-wave background frequency $q$ has real effects on the structures of multi-peak localized structures, since the corresponding solutions cannot be correlated though the Galileo transformation.  As shown in Fig. 2, we note that, by decreasing the value $|q|$, the numbers of the peaks and the amplitude of the wave decrease.\nThis implies that one can control the nonlinear excitations via the incident light frequency.\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[height=32mm,width=82mm]{fig2.jpg}\n\\caption{Amplitude profiles ($|E|$) of multi-peak solitons on a plane-wave background as the background frequency $q$ decreases, (a) $q=10$, (b) $q=5$, (c) $q=1$. The parameters are $a=1$, $b=1.2$, and $\\omega=1$.}\n\\end{figure}\n\nIn order to better understand this multi-peak localized structure of the NLS-MB system (f.i., see the wave in Fig. 1), we will extract separately the periodic wave and soliton from the multi-peak soliton. Specifically, the soliton exist on its own when $\\sigma$ vanishes (thus $q=0$, $a^2<b^2$), while the periodic wave exist in isolation when $\\zeta$ vanishes (thus $q=0$, $a^2>b^2$). Correspondingly, the explicit expressions read, for the soliton,\n\\begin{eqnarray}\nE_s=E_1\\left[\\frac{-2s_1^2}{a^2+b^2\\cosh{\\chi_1}-bs_1\\sinh{\\chi_1}}-1\\right],\n\\end{eqnarray}\nwhere $\\chi_1=2s_1(t+\\omega z)$, $s_1=\\sqrt{b^2-a^2}$, and for the periodic wave,\n\\begin{eqnarray}\n\\label{equ:p}\nE_p=E_1\\left[\\frac{2s_2^2}{a^2+b^2\\cos{\\chi_2}+bs_2\\sin{\\chi_2}}-1\\right],\n\\end{eqnarray}\nwhere $\\chi_2=2s_2(t+\\omega z)$, $s_2=\\sqrt{a^2-b^2}$. We then depict the typical intensity distributions\n$|E_s|^2$, $|E_p|^2$ in Figs. 3 and 4.\n\nFigure 3 depicts the solitary wave propagating along $z$ direction. It is shown that this soliton lies on a plane-wave background with a peak $|E_s|_{max}^2=(2b-a)^2$, which is called antidark soliton. As is well-known, the existence of antidark solitons is first demonstrated in the scalar NLS system with the third-order dispersion \\cite{A}. It is interesting that our result shows that antidark solitons can be induced by the multi-component coupling in the NLS-MB system. We also find that, as $a\\rightarrow 0$, this wave will become a standard bright soliton.\n\\begin{figure}[htb]\n\\centering\n\\subfigure[]{\\includegraphics[height=34mm,width=40mm]{fig3a.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=40mm,width=42mm]{fig3b.jpg}}\n\\caption{(a) Intensity distributions ($I=|E|^2$) of anti-dark solitons, (b) the profile of (a) at $z=0$. The parameters are $a=1$, $\\omega=1$, and $b=1.5$.}\n\\end{figure}\n\\begin{figure}[htb]\n\\centering\n\\subfigure[]{\\includegraphics[height=34mm,width=40mm]{fig4a.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=40mm,width=42mm]{fig4b.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=34mm,width=40mm]{fig4c.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=40mm,width=42mm]{fig4d.jpg}}\n\\caption{Intensity distributions ($I=|E|^2$) of periodic waves with different structures as the period increases, (a) a periodic wave on a vanishing background with $b=0.5$, (c) a periodic wave on a plane-wave background with $b=0.9$. (b) and (d) are the profiles of (a) and (c) at $z=0$. Other parameters are $a=1$, and $\\omega=1$.}\n\\end{figure}\n\nFigure 4 shows the periodic waves propagating in $z$ direction with the period $D_t=\\pi/\\sqrt{a^2-b^2}$ along $t$.\nWe note that, these waves can exhibit different structures as the period $D_t$ increases. Specifically, compared to the\nperiodic wave on a vanishing background in Fig. 4(a), Figure 4(c) depicts a periodic wave on a plane-wave background, whose\nfundamental unit shows a W-shaped soliton structure \\cite{w} with two valleys and one peak. It is interesting, as it is a new type of periodic wave\nbut appears from the same solution. In particular, as the period $D_t\\rightarrow\\infty$, i.e., $b\\rightarrow a$, the periodic wave will\nbecome a single pulse with the W-shaped structure, as shown in Fig. 5. In this case, Eq. (\\ref{equ:p}) reduces to the following rational form\n\\begin{eqnarray}\nE_w=E_1\\left[1-\\frac{4a^2(t+\\omega z)^2-4a(t+\\omega z)}{2a^2(t+\\omega z)^2-2a(t+\\omega z)+1}\\right].\n\\end{eqnarray}\nThe maximum height of the W-shaped wave is nine times the background intensity while the minimum is zero.\nAlthough this property is the same as the one of the Peregrine rogue waves, the W-shaped wave features the soliton-like propagation properties.\nIt should be pointed out that W-shaped solitons with rational\nexpressions in scalar NLS systems have been induced by some higher-order effects \\cite{q1,q2}. In contrast, the generation of the W-shaped solitons in this system is associated with the interaction between different components.\n\\begin{figure}[htb]\n\\centering\n\\subfigure[]{\\includegraphics[height=34mm,width=40mm]{fig5a.jpg}}\n\\hfil\n\\subfigure[]{\\includegraphics[height=40mm,width=42mm]{fig5b.jpg}}\n\\caption{(a) Intensity distributions ($I=|E|^2$) of W-shaped solitons, (b) the profile of (a) at $z=0$. The parameters are $a=1$, $\\omega=1$.}\n\\end{figure}\n\n\\section{CONCLUSION}\n\nIn summary, we have investigated nonlinear localized and periodic waves on a plane-wave background in an erbium-doped fibre system. Abundant intriguing different types of nonlinear waves, including multi-peak soliton, periodic wave, antidark soliton, and W-shaped soliton (as well as the well-known bright soliton, breather, and rogue wave), have been extracted from the unified exact solution (3). Additionally, our results have shown that the numbers of the peaks of the multi-peak soliton can be controlled by the background frequency. These results demonstrated the structural diversity of nonlinear waves in this system.\n\nOn the other hand, our results could provide possibilities to study the nonlinear interactions of different types of nonlinear waves in this system. For example, like recent progresses in \\cite{n3,n4,n5,n6,r1,r2,r3}, in which they demonstrated the coexistence and attractive interactions between rogue waves and other types of localized waves,  and the generations of rogue waves from different localized wave backgrounds. Hence it will be interesting to study the nonlinear interactions between rogue waves and other-type waves (such as multi-peak solitons, periodic waves, and anti-dark solitons) by virtue of higher-order solution of the NLS-MB system. Details will be given elsewhere.\n\n\\begin{center}\n\\textbf{ACKNOWLEDGEMENTS}\n\\end{center}\n\nWe are grateful to anonymous reviewers for their valuable comments and Li-Chen Zhao, Ming Zhang, Fa-Kai Wen, Liang Duan for their helpful discussions. This work has been supported by the National Natural Science Foundation of China (NSFC)(Grant No. 11475135), and the ministry of education doctoral program funds (Grant No. 20126101110004).\n\n\\begin{thebibliography}{99}\n\\bibitem{1} A. I. Maimistov and A. M. Basharov, Nonlinear Optical Waves\n(Springer-Verlag, Berlin, 1999).\n\\bibitem{s1} S. Kakei and J. Satsuma, J. Phys. Soc. Jpn. 63 (1994) 885.\n\\bibitem{s2} K. Porsezian and K. Nakkeeran, J. Mod. Opt. 42 (1995) 1953; K. Porsezian and K. Nakkeeran, Phys. Rev. Lett. 74 (1995) 2941; K. Porsezian J. Mod. Opt. 47 (2000) 1635; K. Porsezian, P. Seenuvasakumaran, and R. Ganapathy, Phys.\nLett. A 348 (2006) 233; A. Mahalingam, K. Porsezian, M. S. Mani Rajan, and\nA. Uthayakumar, J. Phys. A: Math. Theor. 42 (2009) 165101.\n\\bibitem{b1} J. S. He, S. W. Xu, and K. Porsezian, J. Phys. Soc. Jpn. 81 (2012) 033002.\n\\bibitem{b2} J. S. He, S. W. Xu, and K. Porsezian, Phys. Rev. E 86 (2012) 066603;\nC. Z. Li, J. S. He, K. Porsezian, Phys. Rev. E 87 (2013) 012913.\n\\bibitem{b3} R. Guo and H. Q. Hao, Commun. Nonlinear Sci.\nNumer. Simulat. 19 (2014) 3529; Ann. Phys. 344 (2014) 10.\n\\bibitem{n0} C. Kalla, J. Phys. A 44 (2011) 335210.\n\\bibitem{n1} L. C. Zhao and J. Liu, J. Opt. Soc. Am. B 29 (2012) 3119; Phys. Rev. E 87 (2013) 013201;\nL. C. Zhao, G. G. Xin, Z. Y. Yang, Phys. Rev. E 90 (2014) 022918.\n\\bibitem{n2} F. Baronio, M. Conforti, A. Degasperis, S. Lombardo, M. Onorato, and S. Wabnitz, Phys. Rev. Lett. 113 (2014) 034101.\n\\bibitem{n3} B. L. Guo and L. M. Ling, Chin. Phys. Lett. 28 (2011) 110202.\n\\bibitem{n4} F. Baronio, A. Degasperis, M. Conforti, and S. Wabnitz, Phys. Rev. Lett. 109 (2012) 044102.\n\\bibitem{n5} A. Degasperis and S. Lombardo, Phys. Rev. E 88 (2013) 052914.\n\\bibitem{n6} C. Liu, Z. Y. Yang, L. C. Zhao, and W. L. Yang, Phys. Rev. A 89 (2014) 055803.\n\\bibitem{n7} L. M. Ling, B. L. Guo, and L. C. Zhao, Phys. Rev. E 89 (2014) 041201(R).\n\\bibitem{n8} J. S. He, L. J. Guo, Y. S. Zhang, and A. Chabchoub, Proc R Soc A 470 (2014) 20140318.\n\\bibitem{q1} C. Liu, Z. Y. Yang, L. C. Zhao, and W. L. Yang, Phys. Rev. E 91 (2015) 022904.\n\\bibitem{q2} L. C. Zhao, S. C. Li, L. M. Ling, Phys. Rev. E 89 (2014) 023210.\n\\bibitem{m1} J. S. He, Y. Cheng, and Y. S. Li, Commun. Theor. Phys. 38 (2002) 493.\n\\bibitem{m2} R. Guo, B. Tian, X. L\\\"{u}, H. Q. Zhang, and W. J. Liu Comput. Math. Phys. 52 (2012) 565.\n\\bibitem{m3} R. Guo, H. Q. Hao and L. L. Zhang, Mod. Phys. Lett. B 27 (2013) 1350130.\n\\bibitem{AB} N. Akhmediev and V. I. Korneev, Theor. Math. Phys. 69 (1986) 1089-1093.\n\\bibitem{KMB} E. Kuznetsov, Sov. Phys. Dokl. 22 (1977) 507; Y. C. Ma, Stud. Appl. Math. 60 (1979) 43-58.\n\\bibitem{Peregrine} D. H. Peregrine, J. Aust. Math. Soc. Ser. B 25 (1983) 16-43.\n\\bibitem{t1} I. V. Barashenkov, E. V. Zemlyanaya, and M. Boar. Phys. Rev. E 64 (2001) 016603.\n\\bibitem{t2} I. V. Barashenkov and S. R. Woodford, Phys. Rev. E 71 (2005) 026613.\n\\bibitem{s} N. Akhmediev and A. Ankiewicz, Chaos 10 (2000) 600.\n\\bibitem{ac1} I. V. Barashenkov and Yu. S. Smirnov, Phys. Rev. E 54 (1996) 5707.\n\\bibitem{ac2} I. V. Barasehnkov and E. V. Zemlyanaya, J. Phys. A: Math. Theor. 44 (2011) 465211.\n\\bibitem{w} Z. H. Li, Lu Li, H. P. Tian, and G. S. Zhou, Phys. Rev. Lett. 84 (2000) 4096.\n\\bibitem{A} Yu. S. Kivshar, Phys. Rev. A 43 (1991) 1677; Yu. S. Kivshar and V. V. Afanasjev, Phys. Rev. A 44 (1991) 1446(R).\n\\bibitem{r3} X. P. Cheng, S. Y. Lou, C. L. Chen, and X. Y. Tang, Phys. Rev. E  89 (2014) 043202.\n\\bibitem{r1} D. J. Kedziora, A. Ankiewicz, N. Akhmediev, Eur. Phys. J. Spec. Top. 223 (2014) 43.\n\\bibitem{r2} C. Liu, Z. Y. Yang, L. C. Zhao, G. G. Xin, and W. L. Yang, Opt. Lett. 39 (2014) 1057.\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 6201, "prevtext": "\nwhere\n\\begin{subequations}\n\n", "index": 3, "text": "\\begin{align}\n&\\beta=\\zeta(t+V_1z),~\\gamma=\\sigma(t+V_2z),\\nonumber\\\\\n&V_1=\\upsilon_1+b\\sigma\\upsilon_2/\\zeta,~V_2=\\upsilon_1-b\\zeta\\upsilon_2/\\sigma,\\nonumber\\\\\n&\\upsilon_1=k\\omega/(b^2+\\omega^2)-q/2,~\\upsilon_2=1-k/(b^2+\\omega^2),\\nonumber\\\\\n&m_1=\\sqrt{(i\\zeta-\\sigma)^2+(2b+iq)^2},\\nonumber\\\\\n&m_2=\\sqrt{(\\alpha_1+\\alpha_2)^2-4(2b\\zeta+\\sigma q)^2},\\nonumber\\\\\n&m_3=\\sqrt{(\\alpha_1-\\alpha_2)^2+4(2b\\sigma-\\zeta q)^2,}\\nonumber\\\\\n&\\alpha_1=4a^2+4b^2+q^2,~\\alpha_2=\\zeta^2+\\sigma^2,\\nonumber\\\\\n&\\zeta=\\left(\\sqrt{\\chi^2+16q^2b^2}+\\chi\\right)^{1/2}/\\sqrt{2},\\nonumber\\\\\n&\\sigma=\\left(\\sqrt{\\chi^2+16q^2b^2}-\\chi\\right)^{1/2}/\\sqrt{2},\\nonumber\\\\\n&\\chi=4b^2-4a^2-q^2,~\\mu_1=\\arctan{\\left(\\frac{2b+iq}{\\sigma-i\\zeta}\\right)},\\nonumber\\\\\n&\\mu_2=\\arctan{\\left(\\frac{\\alpha_1-\\alpha_2}{4b\\sigma-2q\\zeta}\\right)},~\\mu_3=\\arctan{\\left(\\frac{\\alpha_1+\\alpha_2}{2iq\\sigma-4ib\\zeta}\\right)}.\\nonumber\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\beta=\\zeta(t+V_{1}z),~{}\\gamma=\\sigma(t+V_{2}z),\" display=\"inline\"><mrow><mrow><mrow><mi>β</mi><mo>=</mo><mrow><mi>ζ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><msub><mi>V</mi><mn>1</mn></msub><mo>⁢</mo><mi>z</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><mi>γ</mi><mo>=</mo><mrow><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>+</mo><mrow><msub><mi>V</mi><mn>2</mn></msub><mo>⁢</mo><mi>z</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle V_{1}=\\upsilon_{1}+b\\sigma\\upsilon_{2}/\\zeta,~{}V_{2}=\\upsilon_{%&#10;1}-b\\zeta\\upsilon_{2}/\\sigma,\" display=\"inline\"><mrow><mrow><mrow><msub><mi>V</mi><mn>1</mn></msub><mo>=</mo><mrow><msub><mi>υ</mi><mn>1</mn></msub><mo>+</mo><mrow><mrow><mi>b</mi><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><msub><mi>υ</mi><mn>2</mn></msub></mrow><mo>/</mo><mi>ζ</mi></mrow></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><msub><mi>V</mi><mn>2</mn></msub><mo>=</mo><mrow><msub><mi>υ</mi><mn>1</mn></msub><mo>-</mo><mrow><mrow><mi>b</mi><mo>⁢</mo><mi>ζ</mi><mo>⁢</mo><msub><mi>υ</mi><mn>2</mn></msub></mrow><mo>/</mo><mi>σ</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\upsilon_{1}=k\\omega/(b^{2}+\\omega^{2})-q/2,~{}\\upsilon_{2}=1-k/(%&#10;b^{2}+\\omega^{2}),\" display=\"inline\"><mrow><mrow><mrow><msub><mi>υ</mi><mn>1</mn></msub><mo>=</mo><mrow><mrow><mrow><mi>k</mi><mo>⁢</mo><mi>ω</mi></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>+</mo><msup><mi>ω</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>q</mi><mo>/</mo><mn>2</mn></mrow></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><msub><mi>υ</mi><mn>2</mn></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>k</mi><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>+</mo><msup><mi>ω</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle m_{1}=\\sqrt{(i\\zeta-\\sigma)^{2}+(2b+iq)^{2}},\" display=\"inline\"><mrow><mrow><msub><mi>m</mi><mn>1</mn></msub><mo>=</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>ζ</mi></mrow><mo>-</mo><mi>σ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>b</mi></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi>q</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></msqrt></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle m_{2}=\\sqrt{(\\alpha_{1}+\\alpha_{2})^{2}-4(2b\\zeta+\\sigma q)^{2}},\" display=\"inline\"><mrow><mrow><msub><mi>m</mi><mn>2</mn></msub><mo>=</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><msub><mi>α</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>ζ</mi></mrow><mo>+</mo><mrow><mi>σ</mi><mo>⁢</mo><mi>q</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></msqrt></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle m_{3}=\\sqrt{(\\alpha_{1}-\\alpha_{2})^{2}+4(2b\\sigma-\\zeta q)^{2},}\" display=\"inline\"><mrow><msub><mi>m</mi><mn>3</mn></msub><mo>=</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>α</mi><mn>1</mn></msub><mo>-</mo><msub><mi>α</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><mn>4</mn><msup><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mi>b</mi><mi>σ</mi><mo>-</mo><mi>ζ</mi><mi>q</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>,</mo></mrow></msqrt></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\alpha_{1}=4a^{2}+4b^{2}+q^{2},~{}\\alpha_{2}=\\zeta^{2}+\\sigma^{2},\" display=\"inline\"><mrow><mrow><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>=</mo><mrow><mrow><mn>4</mn><mo>⁢</mo><msup><mi>a</mi><mn>2</mn></msup></mrow><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>b</mi><mn>2</mn></msup></mrow><mo>+</mo><msup><mi>q</mi><mn>2</mn></msup></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>=</mo><mrow><msup><mi>ζ</mi><mn>2</mn></msup><mo>+</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\zeta=\\left(\\sqrt{\\chi^{2}+16q^{2}b^{2}}+\\chi\\right)^{1/2}/\\sqrt{%&#10;2},\" display=\"inline\"><mrow><mrow><mi>ζ</mi><mo>=</mo><mrow><msup><mrow><mo>(</mo><mrow><msqrt><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>+</mo><mrow><mn>16</mn><mo>⁢</mo><msup><mi>q</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>b</mi><mn>2</mn></msup></mrow></mrow></msqrt><mo>+</mo><mi>χ</mi></mrow><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>/</mo><msqrt><mn>2</mn></msqrt></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sigma=\\left(\\sqrt{\\chi^{2}+16q^{2}b^{2}}-\\chi\\right)^{1/2}/\\sqrt%&#10;{2},\" display=\"inline\"><mrow><mrow><mi>σ</mi><mo>=</mo><mrow><msup><mrow><mo>(</mo><mrow><msqrt><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>+</mo><mrow><mn>16</mn><mo>⁢</mo><msup><mi>q</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>b</mi><mn>2</mn></msup></mrow></mrow></msqrt><mo>-</mo><mi>χ</mi></mrow><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>/</mo><msqrt><mn>2</mn></msqrt></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\chi=4b^{2}-4a^{2}-q^{2},~{}\\mu_{1}=\\arctan{\\left(\\frac{2b+iq}{%&#10;\\sigma-i\\zeta}\\right)},\" display=\"inline\"><mrow><mrow><mrow><mi>χ</mi><mo>=</mo><mrow><mrow><mn>4</mn><mo>⁢</mo><msup><mi>b</mi><mn>2</mn></msup></mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>a</mi><mn>2</mn></msup></mrow><mo>-</mo><msup><mi>q</mi><mn>2</mn></msup></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><msub><mi>μ</mi><mn>1</mn></msub><mo>=</mo><mrow><mi>arctan</mi><mo>⁡</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>b</mi></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi>q</mi></mrow></mrow><mrow><mi>σ</mi><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>ζ</mi></mrow></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mu_{2}=\\arctan{\\left(\\frac{\\alpha_{1}-\\alpha_{2}}{4b\\sigma-2q%&#10;\\zeta}\\right)},~{}\\mu_{3}=\\arctan{\\left(\\frac{\\alpha_{1}+\\alpha_{2}}{2iq\\sigma%&#10;-4ib\\zeta}\\right)}.\" display=\"inline\"><mrow><mrow><mrow><msub><mi>μ</mi><mn>2</mn></msub><mo>=</mo><mrow><mi>arctan</mi><mo>⁡</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>-</mo><msub><mi>α</mi><mn>2</mn></msub></mrow><mrow><mrow><mn>4</mn><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>σ</mi></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mi>ζ</mi></mrow></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><msub><mi>μ</mi><mn>3</mn></msub><mo>=</mo><mrow><mi>arctan</mi><mo>⁡</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><msub><mi>α</mi><mn>2</mn></msub></mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mi>σ</mi></mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>ζ</mi></mrow></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]