[{"file": "1601.01829.tex", "nexttext": "\n\n\\noindent where $w_{i}$ and $S/R_{i}$ are the weight and S/N of the $i^{th}$ pseudo profile. \n\nWe\nchoose here to keep all profiles in this process, even those with the\nlowest S/N (LSD profiles with S/N lower than 10,000 represent 16\nobservations for $\\beta$ UMa and 2 for $\\theta$ Leo), because this\nsystematic rejection was found to provide us with nothing more than a marginal modification of the\nresult (and no noticeable improvement). The grand average LSD profiles are presented in\nFig.~\\ref{lsd}. With the large number of spectra collected here, the\ncoaddition of all profiles increases the S/N by a factor $\\approx$ 10,\ncompared to individual profiles. The resulting S/N of the grand average\nV profiles is 653,640 for $\\beta$ UMa and 512,370 for $\\theta$ Leo (using the normalization parameters listed in Table \\ref{lsd_parameter}). \n\nOne\nlimitation of this rough co-addition method is that we average together\nobservations taken at different rotational phases. In the absence of any known rotation period, we assume our data are distributed over all rotation phases with the same probability. We therefore lose any phase-resolved\ninformation, and the axisymmetric surface structures (i.e., structures symmetric about the spin axis) are the most likely to survive the coaddition process and actually \ncontribute to the grand average. This strategy is, however, successful\nat reducing the noise level enough to permit the detection of\ncircularly polarized signatures in both stars, while the null profiles\nremain free of any feature above noise level.\n\n \\begin{figure}[H]\n\\centering\n\\includegraphics[scale=0.34]{mean_lsd_betauma.pdf}\n\\includegraphics[scale=0.34]{mean_lsd_thetaleo.pdf}\n\\caption{Coadded LSD profiles in Stokes I (bottom) and V (top). The two available ``null'' control parameters Null1 and Null2 are shown in the middle panel. Top: $\\beta$ UMa observations. Bottom: Same figure for $\\theta$ Leo. All profiles are normalized to the continuum level.}\n\\label{lsd}\n\\end{figure}\n\nReduced spectra are provided by Libre-Esprit with a normalized\ncontinuum, although the actual resulting continuum typically deviates by up to\n15\\% from unity, especially in the bluest orders of the spectra. To\ntest the impact of this imperfect automated processing on the result of our LSD analysis, we\nnormalized each of the 40 echelle orders for each spectrum (see\n\\citealt{neiner14}) with the continuum task of IRAF\\footnote{Image\nReduction and Analysis Facility, http://iraf.noao.edu/}. The new\nnormalization improves the S/N of the individual LSD profiles by about 5\\%. We\nnotice that the upgraded normalization changes the resulting\nLSD profiles slightly, however the improvement is very marginal, even at the\nextremely high S/N of our grand average profiles. In spite of the limited quality of the default continuum normalization, the robustness of\nLSD is mainly due to the\nlarge number of lines taken into account in the LSD process, compared\nto hotter stars for which the improved normalization is more useful. As a consequence, we simply consider here the spectra normalized \nwith Libre-Esprit for consistency with the previous\nstudies on Vega (\\citealt{lignieres09}, \\citealt{petit10}) and Sirius\n\\citep{petit11} in which the default renormalization was used.\n\n\\section{Results}\n\n\\subsection{LSD profiles with complete line mask}\n\\label{sect:complete}\n\nThe Stokes I, V, Null1 and Null2 co-added LSD profiles of $\\beta$ UMa and $\\theta$ Leo are shown in Fig.~\\ref{lsd}. They display clear Stokes V signatures at the radial velocity of the Stokes I line profiles. The circularly polarized signal observed for both stars covers most of the width of the line and is mostly symmetric about the line centroid. In both cases, a positive lobe dominates the signal. No detectable signal is seen in the Null1 and Null2 control profiles. We computed the detection probability of the Stokes V signal by using the $\\chi^2$ test proposed by \\cite{donati92}, getting a detection probability of $\\sim$100~\\% for both stars with a false alarm probability below $10^{-11}$  for $\\beta$ UMa and equal to 6.5$\\times 10^{-6}$ for $\\theta$ Leo. Outside of the stellar lines, we obtained a marginal signal detection for $\\beta$ UMa, due to the negative bump in the Stokes V continuum showing up at a radial velocity of around -200 {km\\,s$^{-1}$}. This continuum feature, not observed for {$\\theta$~Leo}, may be due to residuals of line blends \\citep{kochukhov10b}. \n\nWe note that the Stokes V signatures detected in the co-added LSD profiles probably stem from a significant fraction of the individual LSD profiles, as various subsets from our complete data set (e.g., observations taken during a given year, see Fig. \\ref{year}) display the same signal when co-added separately, although with a higher noise level. The single-epoch subsets are obtained over a timespan that is much longer than the longest possible rotation period of the two targets, so that the co-addition process of many individual rotational phases should result, in all cases, in a filtering of any signatures resulting from nonaxisymmetric magnetic structures.\n\n \n\n\\subsection{Possible instrumental artifacts at high S/N}\n\nThe very high S/N achieved to detect weak polarimetric signatures in intermediate-mass stars raises the question of possible instrumental effects that could contribute to generate spurious signatures in NARVAL Stokes V sequences.  All spectra obtained for our study display a peak S/N below 2,000, and the majority of them are kept below 1,500. At such S/N values, we safely stay away from the saturation regime of the detector (S/N above 2,000 for standard early-type stars). We note that subsets extracted from our complete time-series display consistent signatures, regardless of the S/N of the subset, as highlighted by, e.g., Fig. \\ref{year}. In any case, most spurious signatures generated by nonlinear behavior of the detector are expected to show up in the Null1 and Null2 check profiles (especially if the S/N is fluctuating from one subexposure to the next), which is not seen here. \n\nFrom an empirical point of view, we stress that the signatures recorded so far for Sirius A \\citep{petit11,kochukhov14} display a similar shape using three different instrumental setups (ESPaDOnS, NARVAL, HARPSpol) and three different models of CCD detector and two different reduction pipelines, giving strong confidence in a stellar origin of the polarized signature. We finally emphasize that a number of stars belonging to several classes were previously observed at a comparable S/N, which resulted in no Stokes V detection in two normal B stars \\citep{wade14, neiner14}, in a definite Stokes V detection (with a standard Zeeman shape) for the $\\lambda$~Boo star Vega \\citep{lignieres09}, and in a definite Zeeman detection (again with a standard shape) for the cool giant Pollux \\citep{auriere09}.\n\nAnother potential source of instrumental artifacts, especially for very weak Stokes V signatures, is possible crosstalk from linear to circular polarization. This effect is documented for NARVAL and ESPaDOnS (e.g., \\citealt{silvester12}). Stokes Q and U spectra were obtained for Sirius~A by \\cite{petit11}, featuring no polarimetric signal at a level that could significantly contribute to the Stokes V signal. The same profile shape obtained for Sirius A using three instruments affected by different crosstalk levels is, in itself, an independent evidence that linear polarization did not contaminate the Stokes V signature.  \n\nConsidering this context as a whole, we conclude that a convincing body of evidence now exists to safely conclude that the Stokes V signal observed for {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\   most likely has a stellar origin.\n\n\n\\subsection{Establishing the Zeeman origin of Stokes V signatures}\n\n\\subsubsection{Method outline}\n\nThe shapes of the signatures in the Stokes V profiles (mainly constituted of a positive lobe) are not expected in the standard theory of the Zeeman effect, which predicts that lobes of positive and negative signs should be observed, resulting in a zero-integral Stokes V profile. This surprising observation, and the extremely low amplitude of the recorded signatures, raise natural concerns about possible artifacts that may contribute to the observed polarized signal. Considered all together, the standard series of tests detailed in Sect. \\ref{sect:complete} provides us with strong evidence that the recorded signatures are stellar in origin. Other convincing evidence includes the possibility that crosstalk from linear to circular polarization is not involved \\citep{petit11} and that no similar signatures were observed in other hot or tepid stars studied at a similar level of accuracy \\citep{lignieres09,wade14,neiner14}, in spite of a strictly identical instrumental setup. HARPSpol observations reported by \\cite{kochukhov14} also confirm that the peculiar signature reported for Sirius~A is still obtained when using a completely different instrument and different reduction software.   \n\nEven if instrumental effects can be safely excluded, the physical origin of the signal still requires further investigation. We propose here a series of tests to ascertain the Zeeman origin of the recorded signal. The basic idea is that the amplitude of Zeeman signatures is expected to depend on various line parameters (Land\\'e factor, wavelength, line depth), so that a careful selection of spectral lines for the LSD procedure should confirm or refute this dependence in our data. We therefore run again the LSD process using a number of new line lists, extracted from our original list but featuring a selection of lines where one line parameter has been restricted to a given range. In the weak field approximation, Stokes V signals are related to line parameters according to the following equation:\n\n\n", "itemtype": "equation", "pos": 20200, "prevtext": " \n\n\n   \\title{Detection of ultra-weak magnetic fields in Am stars: \\\\$\\beta$ UMa and $\\theta$ Leo}\n\n\n\n   \\author{A. Blaz\\`ere\\inst{1,2,3}\n\\and P. Petit\\inst{2,3}\n\\and F. Ligni\\`eres\\inst{2,3}\n\\and M. Auri\\`ere\\inst{2,3}\n\\and J. Ballot\\inst{2,3}\n\\and T. B\\\"ohm\\inst{2,3}\n\\and C.P. Folsom\\inst{2,3,4}\n\\and M. Gaurat\\inst{2,3}\n\\and \n\\\\L. Jouve\\inst{2,3}\n\\and A. Lopez Ariste\\inst{2,3}\n\\and C. Neiner\\inst{1}\n\\and G.A .Wade\\inst{5}\n\n\n          }\n\n\\institute{LESIA, Observatoire de Paris, PSL Research University, CNRS, Sorbonne Universit\\'es, UPMC Univ. Paris 06, Univ. Paris Diderot, Sorbonne Paris Cit\\'e, 5 place Jules Janssen, 92195 Meudon, France\\\\\n              \\email{aurore.blazere@obspm.fr}\n\\and\n              Universit\\'e de Toulouse, UPS-OMP, Institut de Recherche en Astrophysique et Plan\\'etologie, Toulouse, France  \n              \\and\n   CNRS, Institut de Recherche en Astrophysique et Plan\\'etologie, 14 Avenue Edouard Belin, F-31400 Toulouse, France\n                \\and\n                IPAG, UJF-Grenoble 1/CNRS-INSU, UMR 5274, 38041 Grenoble, France\n                \\and\nDepartment of Physics, Royal Military College of Canada, PO Box 17000 Station Forces, Kingston, ON K7K 0C6, Canada\n\n\n\n\n             }\n\n\n\n\n\n \n  \\abstract\n  \n  \n   {An extremely weak circularly polarized signature was recently discovered in spectral lines of the chemically peculiar Am star Sirius A. A weak surface magnetic field was proposed to account for the observed polarized signal, but the shape of the phase-averaged signature, dominated by a prominent positive lobe, is not expected in the standard theory of the Zeeman effect.}\n   {We aim at verifying the presence of weak circularly polarized signatures in two other bright Am stars, $\\beta$ UMa and $\\theta$ Leo, and investigating the physical origin of Sirius-like polarized signals\nfurther.}\n    {We present here a set of deep spectropolarimetric observations of $\\beta$ UMa and $\\theta$ Leo, observed with the NARVAL spectropolarimeter. We analyzed all spectra with the Least Squares Deconvolution multiline procedure. To improve the signal-to-noise ratio and detect extremely weak signatures in Stokes V profiles, we co-added all available spectra of each star (around 150 observations each time). Finally, we ran several tests to evaluate whether the detected signatures are consistent with the behavior expected from the Zeeman effect.}\n    {The line profiles of the two stars display circularly polarized signatures similar in shape and amplitude to the observations previously gathered for Sirius A. Our series of tests brings further evidence of a magnetic origin of the recorded signal.}\n    {These new detections suggest that very weak magnetic fields may well be present in the photospheres of a significant fraction of intermediate-mass stars. The strongly asymmetric Zeeman signatures measured so far in Am stars (featuring a dominant single-sign lobe) are not expected in the standard theory of the Zeeman effect and may be linked to sharp vertical gradients in photospheric velocities and magnetic field strengths.}\n   \n   \\keywords{Stars: magnetic field -- Stars: chemically peculiar - Stars: individual: $\\beta$ UMa and $\\theta$ Leo\n               }\n\n   \\maketitle\n\n\n\n\\section{Introduction}\n\nAbout 5\\% to 10\\% of hot stars (stars with O, B, and A spectral types) are found to be strongly magnetic with a longitudinal magnetic field strength in excess of 100 G (e.g., \\citealt{wade13,auriere07}), which is generally associated with a simple and stable field geometry (e.g., \\citealt{lueftinger10,silvester14}). However, the physical origin and even some basic properties of these magnetic fields are still poorly understood. The current paradigm, the fossil field hypothesis, describes this magnetism as the remnant of magnetic field accumulated or produced during an early phase of stellar life. In this conceptual framework, magnetic fields observed in these stars today are proposed to result from a seed field in the molecular cloud from which the star was formed, rather than being currently produced by an active dynamo as in the Sun. This initial field may also have been amplified during the early phases of the evolution of the star, when it was temporarily surrounded by an extended convective envelope hosting a global dynamo. In practice, the fossil field theory leaves many basic questions unanswered, such as the precise origin of this magnetism and its low incidence among intermediate-mass and massive stars. However, it is strongly supported by many of their observational properties (e.g., \\citealt{braithwaite15}).\n\nRecently, a longitudinal magnetic field much weaker than any previous detection in intermediate-mass stars has been discovered in the early A star Vega \\citep{lignieres09}. The spectropolarimetric time series was interpreted in terms of a surface magnetic field distribution using the Zeeman-Doppler Imaging technique (ZDI, \\citealt{petit10}), unveiling a peak local field strength of about 7~G \\citep{petit14b}. The results of that study support the view that Vega is a rapidly rotating star seen nearly pole-on, and the reconstruction of the magnetic topology at two epochs revealed a magnetic region of radial field orientation, closely concentrated around the rotation pole. Vega may well be the first confirmed member of a much larger, as yet unexplored, class of weakly magnetic hot stars. Weak magnetic fields of the same kind were also searched for in two normal B stars, $\\gamma$ Peg \\citep{neiner14b} and $\\iota$ Her \\citep{wade14}, although no magnetic fields were detected in both stars with a precision of 0.3-0.4~G. However, \\cite{wade14} demonstrate that, if a large-scale magnetic field identical to the ZDI magnetic geometry of Vega existed in $\\gamma$ Peg and $\\iota$ Her, no detection would be expected at this level of accuracy given the spectral line properties of both B-type targets. \n\nThe only other example of a weak Stokes V detection in spectral lines of an intermediate-mass star has been reported for the bright Am star Sirius A \\citep{petit11}. For this object, however, the polarized signature observed in circular polarization is not a null integral over the width of the line profile, as expected in the usual descriptions of the Zeeman effect. Instead, the Stokes V line profile exhibits a positive lobe dominating the negative one (in amplitude and integrated flux). The interpretation of a Zeeman origin was favored by Petit et al., in particular after excluding the possibility of an instrumental crosstalk from linear to circular polarization. However, the abnormal shape of the polarized profile remained a puzzle and required further investigation. \n\nThe motivation to progress on this topic is strong because the discovery of a new, potentially widespread class of weakly magnetic A stars offers important new information about the dichotomy between strong and weak magnetic fields in tepid stars. In an attempt to interpret this division, \\cite{auriere07} proposed a scenario based on the stability of a large scale magnetic configuration in a differentially rotating star, leading to estimating a critical field strength above which magnetic fields can remain stable on long time scales, while magnetic fields below this limit would likely be destroyed by the internal shear. More detailed models including 2D and 3D numerical simulations \\citep{jouve15,gaurat15} tend to confirm the existence of a critical field in such configurations, where the pre-main sequence contraction is a possible way to force differential rotation.  On the other hand, the magnetic dichotomy might simply be the result of two different magnetic field generation processes. \\cite{braithwaite13} propose that Vega-like magnetic stars are the result of the slow evolution of magnetic configurations characterized by weak initial magnetic helicity and argue that it should be widespread among most intermediate-mass and massive stars. Meanwhile, \\cite{ferrario09} propose that the small fraction of strong magnetic fields could be produced in early stellar merging events.\n\nIn the rest of this paper, we first present the two bright Am stars selected for this study. We then present the observations and the analysis methods used. A series of tests was performed to constrain the physical origin of the recorded polarimetric signatures further, and finally we discuss our results in the broader context of weakly magnetic star of intermediate mass.\n\n\\section{Selected targets}\n\n\\begin{table}[h]\n\\label{parameter}\n\\caption{Fundamental parameters of $\\beta$ UMa and $\\theta$ Leo}\n\\centering\n\\begin{tabular}{c c c}\n\\hline\n  & $\\beta$ UMa & $\\theta$ Leo\\\\\n\\hline\n\\hline\n   Spectral type & A1V & A2V \\\\\n   $T_{eff}$    & 9480K$\\pm$10K$^{a}$ & 9280$\\pm$10K$^{a}$  \\\\\n   log g   &   3.82$^b$   & 3.65$^c$ \\\\\n   Mass & 2.64$\\pm$0.01$M_{\\odot}^{a}$ & 2.94$\\pm$0.2$M_{\\odot}^{a}$\\\\\n   Radius & 3.021$\\pm$0.038 $R_{\\odot}^{d}$ & 4.03$\\pm$ 0.10 $R_{\\odot}^{e}$\\\\\n   {$v\\sin{i}$} & 46$\\pm$3 km/s$^{f}$ & 23$\\pm$3 km/s$^{f}$\\\\\n   L$_{\\odot}$ & 72$\\pm$11$^{a}$ & 127$\\pm$13$^{a}$\\\\\n   Frac. age & 0.778$^{a}$ & 0.943$^{a}$ \\\\\n   Metallicity & -0.03$^{g}$ & -0.13$^{g}$\\\\\n\\hline\n\n\\multicolumn{2}{l}{$^{a}$ \\cite{zorec12}}&$^{b}$\\cite{allendeprieto99}\\\\\n\\multicolumn{2}{l}{$^{c}$ \\cite{adelman15b} }& $^{d}$ \\cite{boyajian12}\\\\\n\\multicolumn{2}{l}{$^{e}$ \\cite{maestro13}} & $^{f}$ \\cite{royer02}\\\\\n\\multicolumn{2}{l}{$^g$ \\cite{anderson12}} & \\\\\n\n\\end{tabular}\n\\end{table}\n\nHere, we present the results of deep spectropolarimetric campaigns carried out for two bright Am stars in which magnetic fields were previously undetected \\citep{auriere10}. Am stars are chemically peculiar stars exhibiting overabundances of iron-group elements such as zinc, strontium, zirconium, and barium and deficiencies of a few elements, particularly calcium and scandium. Most Am stars also feature low projected rotational velocities, as compared to normal A stars \\citep{abt09}. The targets of this study are $\\beta$ Ursa Majoris (HD 95418) and $\\theta$ Leonis (HD 97633). Abundances measured for $\\beta$ UMa place this star among targets featuring weak Am characterictics with noticeable overabundance in V{\\sc ii}, Mn{\\sc ii}, Ni{\\sc i}, Ni{\\sc ii}, Zn{\\sc i}, Sr{\\sc ii}, Y{\\sc ii}, Zr{\\sc ii}, and Ba{\\sc ii} and underabundances in He{\\sc i}, C{\\sc i}, C{\\sc ii}, and Sc{\\sc ii} (for more details see \\citealt{adelman11}). The source $\\theta$ Leo is also on the weak side of Am abnormality, with large reported overabundance in S{\\sc ii}, V{\\sc ii}, Cr{\\sc ii}, Sr{\\sc ii}, Y{\\sc ii}, and Zr{\\sc ii} and Ba{\\sc ii} and underabundance in A{\\sc ii}, Ca{\\sc ii}, Sc{\\sc ii}, Mn{\\sc ii}, and Ni{\\sc i}, \\citep{adelman15b}. \n\nThe fundamental parameters of both targets are presented in Table~\\ref{parameter}. The two objects are early A-type targets. Both of them benefit from an interferometric estimate of their radius, which is distinctly larger than the radius of main sequence stars of similar spectral types. Accordingly, their surface gravities are found to be below main sequence values. High luminosity values complete this picture, confirming that both targets are already on their way off the main sequence. Using evolutionary models matching the position of both stars in the H-R diagram, \\citet{zorec12} find that the fractional age on the main sequence of {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\ are equal to 0.778  and 0.943, respectively, giving further support to the idea that both stars have completed most of their path on the main sequence. That {$\\beta$~UMa}\\ is reported to belong to the Ursa Majoris association gives another constraint on the age, which is estimated to be around 500~Myr for this group of stars \\citep{monier05}. Based on Spitzer measurements of IR excess, \\cite{ballering13} attribute ages of 310~Myr and 500~Myr to {$\\beta$~UMa}\\ and {$\\theta$~Leo}, respectively, which is too young to be reconciled with other stellar parameters, but may provide an additional hint that {$\\theta$~Leo}\\ is more evolved than {$\\beta$~UMa}. \n\nThe projected rotational velocities estimated for both stars are fairly typical of values reported for Am stars \\citep{abt09}. In the absence of any direct estimate of the rotation period of our targets, it cannot be determined whether the higher {$v\\sin{i}$}\\ value reported for {$\\beta$~UMa}\\ is linked to a faster rotation or higher inclination angle.\n\n\\section{Data analysis}\n\nData were taken with the NARVAL spectropolarimeter (\\citealt{auriere03}, \\citealt{silvester12}) in operation at the two-meter Bernard Lyot\nTelescope (TBL) at the summit of Pic du Midi Observatory in the French\nPyr\\'en\\'ees. This\nhigh resolution spectropolarimeter is specially designed and\noptimized to detect stellar magnetic\nfields through the polarization they generate in photospheric spectral\nlines. The polarimetric unit is mounted at the Cassegrain focus of the\ntelescope and allows two orthogonal states of a given polarization\n(circular or linear) to be recorded throughout the entire optical\ndomain, thanks to the high achromaticity of its polarimetric optics.\nThe upper part of the polarimeter contains the guiding camera, an atmospheric dispersion corrector, and\na calibration wheel.  Following that, the main polarimetric device constitutes three Fresnel rhomb retarders (two half-wave rhombs that can rotate about the optical axis and one fixed quarter-wave rhomb), which are used to perform the polarimetric analysis. The light emerging from the retarders is sent\nto a Wollaston prism, consisting of two orthogonal calcite prisms that\nare cemented together, acting as a polarizing beamsplitter.\n\nThe two beams of light emerging from the beamsplitter are transmitted\nby some 30 m of optical fiber to the bench-mounted spectrograph, where an image slicer converts the circular image of the fiber head into a pseudo-slit shape.. The spectrograph\nprovides complete coverage of the optical spectrum from 3700 to 10500\n$\\AA$ on 40 echelle orders with a spectral resolution of about 65000\nin polarimetric mode. The spectrograph unit contains a double set\nof high-reflectance collimators cut from a single 680 mm parabolic\nmirror with a focal length of 1500 mm. The grating is a 79 gr/mm\nmonolithic grating with dimensions of 200 by 400 mm, and the\ncross-dispersion is achieved by a high dispersion prism. The camera\nlens is a fully dioptric f/2 388 mm focal length lens with a 210 mm\nfree diameter. The spectrograph thermal stability is kept to within\n0.1~K, thanks to the use of a double-layer thermal enclosure.\n\\\\\n\nAll data used in the present paper are collected in the polarimetric\nmode measuring Stokes V (circular polarization).To minimize systematic\nerrors, one complete Stokes V sequence consists of four successive\nsubexposures taken with the half-wave rhombs oriented at different\nazimuths. This follows the method of \\cite{semel93} to reduce the\namplitude of possible spurious signatures of instrumental origin. This strategy also provides a\nstrong test to discard the possibility of a spurious signal by\ncomputing a ``null'' spectrum. This is calculated from a different\ncombination of the four subexposures constituting the polarimetric\nsequence \\citep{donati97}, and it should not display any signal. This ``null'' check parameter is automatically produced for each Stokes V sequence.The\ndata are reduced by Libre-Esprit, a dedicated and fully automated\nsoftware \\citep{donati97} specifically developed for reducing echelle\nspectropolarimetric data and optimized for NARVAL. Libre-Esprit proceeds in three steps: the first\nstage consists of performing a geometrical analysis from a sequence of\ncalibration exposures; the position and shape of orders is derived\nfrom a mean flat field image, while the details of the wavelength to\npixel relation along and across each spectral order is obtained from comparison frames obtained from a ThAr lamp and a Fabry-Perot setup. The second step performs\nspectrum optimal extraction \\citep{horne86,marsh89}, using\nthe geometrical information derived in step 1. A last step consists of\nrefining the wavelength calibration using telluric lines recorded in\nthe reduced spectrum, therefore reaching a radial velocity accuracy\nclose to 30 $m.s^{-1}$ \\citep{moutou07}. Spectra processed with\nLibre-Esprit include the flux and polarization information, as well as\nthe ``null'' spectrum computed from two different combinations (dubbed ``Null1'' and ``Null2'' in our plots) and error bars at each wavelength point in the\nspectrum.\n\nThe source $\\beta$ UMa was observed in March/April 2010 and March/April 2011 for\na total of 149 spectra. For its part, $\\theta$ Leo was observed in\nJanuary/March/April 2012, March/April 2013, and May/June 2014 for a\ntotal of 171 spectra (see Table~\\ref{obs} for the detailed distribution of observations among individual nights). For each star, the exposure time was adjusted to reach a peak S/N throughout the Stokes V spectrum between 1,000 and 2,000 per 1.8 $km.s^{-1}$ bin, depending on weather conditions. These relatively high values are safely away from the saturation level of the EEV detector used in fast readout mode.\n\nIn the absence of any detectable polarized signatures in individual\nspectral lines of $\\beta$ UMa and $\\theta$ Leo, we apply the\nwell-known and commonly used Least Squares Deconvolution (LSD)\nprocedure (\\citealt{donati97}, \\citealt{kochukhov10b}) to each\nspectrum of both stars. This method is a cross-correlation technique\nfor computing average pseudo-line profiles from a list of spectral\nlines in order to get a multiplex increase in the S/N. This powerful technique, based upon several rough approximations (additive line profiles,\nwavelength-independent limb-darkening, self-similar local profile\nshape, weak magnetic fields), makes use of the possibility of describing stellar spectra as a\nline pattern convolved with an average pseudo-line profile. Here, we\nchoose to compute the LSD Stokes I and V pseudo-profiles for all available\nphotospheric lines. Our line lists are taken from the VALD atomic data\nbase \\citep{piskunov95, kupka99} using the respective effective\ntemperature and log g of both stars (Table~\\ref{parameter}). Our line\nlists are extracted using $T_{eff}=9,500K$ and log g=4.0 for $\\beta$\nUMa and $T_{eff}=9,250K$ and log g=3.5 for $\\theta$ Leo. We reject the\nlines whose depth is less than 1\\% of the continuum. By doing so we obtain a mask of 1,173 lines and 1,133 lines for $\\beta$\nUMa and $\\theta$ Leo, respectively. Then, we adjust the depth of the lines in the\nmask to fit the observed line depths. To reduce the noise per spectral bin\nfurther and then reduce the spectral\nresolution of LSD line profiles. Instead of the default spectral bin\nspanning 1.8 {km\\,s$^{-1}$}\\ at a spectral resolution of 65,000, we used 9 {km\\,s$^{-1}$}\\\nfor $\\beta$ UMa and 5.4 {km\\,s$^{-1}$}\\ for $\\theta$ Leo, which leaves us with\nabout ten velocity bins in the pseudo line profile. With this modification of\nthe spectral resolution, the additional gain in the S/N is a factor of 2.1 for\n$\\beta$ UMa and 1.7 for $\\theta$ Leo. The nightly averaged S/Ns of the\nresulting Stokes V LSD profiles (i.e., the average of the S/Ns of individual profiles) are between 45,000 and 77,000\nfor $\\beta$ UMa and between 25,000 and 48,000 for $\\theta$ Leo\n(Table~\\ref{obs}). The dispersion of the S/N between individual Stokes V sequence of a given night is often the lowest during\nnights featuring the highest average S/N, because of the excellent (and stable) sky transparency.\n\nPolarized signals remain undetected in individual LSD Stokes V\npseudo-profiles of our two targets. However, their typical S/N remains far\ntoo low to detect polarized signatures as weak as the one previously\nreported for Sirius A \\citep{petit11}. To further improve the\nS/N, we coadd all available LSD profiles for each\nstar, resulting in one ``grand average'' pseudo-line profile. This method\nwas successfully used for Vega (\\citealt{lignieres09}, \\citealt{petit10}) and Sirius \\citep{petit11} to detect signatures with amplitudes as low as about\n$10^{-5}$ of the continuum level. To coadd the LSD profiles, we weight\neach individual LSD profile proportionally to its squared S/N:\n\n", "index": 1, "text": "\n\\[w_{i}=S/R_{i}^2/\\sum \\limits_{\\underset{}{i=0}}^n S/R_{i}^2\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"w_{i}=S/R_{i}^{2}/\\sum\\limits_{\\underset{}{i=0}}^{n}S/R_{i}^{2}\" display=\"block\"><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>=</mo><mrow><mi>S</mi><mo>/</mo><msubsup><mi>R</mi><mi>i</mi><mn>2</mn></msubsup><mo>/</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\underset</mtext></merror><mo>⁢</mo><mi>i</mi></mrow><mo>=</mo><mn>0</mn></mrow><mi>n</mi></munderover><mrow><mi>S</mi><mo>/</mo><msubsup><mi>R</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01829.tex", "nexttext": " \n\n\\begin{figure}[H]\n\\includegraphics[scale=0.34]{fac_lande_betauma2.pdf}\n\\includegraphics[scale=0.34]{fac_lande_thetaleo2.pdf}\n\\includegraphics[scale=0.34]{fac_lande_alpha2cvn.pdf}\n\\caption{Top: Comparison of the Stokes V profiles obtained by selecting photospheric lines of low (red thin line) and high (green thin line) magnetic sensitivity for $\\beta$ UMa. The thick red and green lines represent a moving average over three spectral bins of the thin lines. Center: same figure for $\\theta$ Leo. Bottom: same for $\\alpha^2$ CVn. All profiles are normalized to the continuum level.}\n\\label{fac_lande}\n\\end{figure}\n\n\\noindent where $\\lambda_0$ represents the wavelength of the line profile, $B_\\parallel$ the line-of-sight projection of the magnetic field vector, and $g$ the effective Land\\'e factor. At a given value of $B_\\parallel$, the amplitude of Stokes V is therefore expected to follow simple variations with $\\lambda_0$, $g$, and with the line depth.\n\nAs a reference, we use here the standard Ap star $\\alpha^2$ CVn and a NARVAL observation downloaded from PolarBase \\citep{petit14} and already used by \\cite{silvester14}. The star  $\\alpha^2$ CVn is bright and variable A0p with {$v\\sin{i}$}=$18\\pm 0.5$ {km\\,s$^{-1}$}, an effective temperature of $11600 \\pm 500$ K, and a logarithmic surface gravity equal to $3.9 \\pm 0.1$ \\citep{silvester14}. Its spectral properties are therefore reasonably similar to $\\beta$ UMa and $\\theta$ Leo, except its slightly higher surface temperature. The interesting characteristic of $\\alpha^2$ CVn is its strong and organized surface magnetic field (locally up to 2 kG), resulting in very large circularly polarized signatures. We applied our series of tests to this reference star to better highlight the expected results in the presence of a strong magnetic field, with negligible noise in the polarized profile. \n\nThe average line parameters for all submasks used to compute the new LSD profiles are listed in Table \\ref{lsd_parameter}. They vary slightly from one star to the next mostly because of the different VALD models employed. The largest star-to-star differences are observed when we define the line sublists according to a wavelength threshold. We also list in Table \\ref{lsd_parameter} the normalization parameters used for the LSD procedure, forcing a normalized wavelength of 500~nm everywhere, except when we set a wavelength threshold, in which case we force a normalized Land\\'e factor equal to 1.2. Finally, we correct for any difference in the depth of Stokes I profiles, except when the submasks are defined with a line depth threshold.\n\n\\subsubsection{Outcome for {$\\beta$~UMa}\\ and {$\\theta$~Leo}}\n\nAs a first test, we ran LSD for two submasks containing lines with an average Land\\'e factor $g$ lower (resp. greater) than the mean Land\\'e factor of the original line list (see Table~\\ref{lsd_parameter}). Hereafter, we consider  the normalizing Land\\'e factors used as part of the LSD procedure, since it is the relevant quantity for direct comparison of different LSD profiles. (The normalizing $g$ values follow the same trend as the average Land\\'e factors of the submasks.) The resulting Stokes V profiles are plotted in Fig. \\ref{fac_lande} for the two Am stars and the control Ap star. The Stokes V profiles are corrected for a $\\sim$10\\% difference in equivalent width observed in their associated Stokes I profile. Because of a higher noise level than obtained with the complete line mask, the high-$g$ and low-$g$ profiles of $\\beta$ UMa and $\\theta$ Leo do not display any statistically conclusive differences. The overplotted running average helps to improve the situation, showing that the high-$g$ signals possess higher amplitudes than their low-$g$ counterparts. We note that their amplitude ratio is roughly consistent with the g ratio, although this point is difficult to establish with high accuracy (even with the running average) because of the level of noise.\n\nAs second test, two sublists were defined from our original list by containing lines with a wavelength lower (resp. greater) than the mean wavelength of the original list (Table~\\ref{lsd_parameter}). For a given star, the Stokes V profiles were corrected for the $\\sim$30\\% difference in equivalent width observed in their associated Stokes I profiles. The outcome of this test is illustrated in Fig.~\\ref{wave}, which illustrates a marginally larger amplitude of the Stokes V signal when the wavelength increases. As for the previous test, we computed a moving average of the signal to confirm the trend that is otherwise completely hidden in the noise and to check that the trend observed in both Am stars is consistent with the outcome obtained for $\\alpha$ 2 CVn.\n \n\\begin{figure}[H]\n\\includegraphics[scale=0.34]{betauma_wave_v2.pdf}\n\\includegraphics[scale=0.34]{thetaleo_wave_v2.pdf}\n\\includegraphics[scale=0.34]{alpha2cvn_wave.pdf}\n\\caption{Same as Fig. \\ref{fac_lande} for photospheric lines of low (thin red line) and high (thin green line) wavelength.}\n\\label{wave}\n\\end{figure}\n\nAs a last test, we define two sublists using spectral lines with an average depth lower (resp. greater) than the mean depth of the original list (Table~\\ref{lsd_parameter}). The Stokes V LSD profiles obtained from the sublists are displayed in Fig.~\\ref{eeq} and, for our two Am stars and our reference star, clearly show a lower amplitude whenever the average line depth is smaller. This outcome is expected in the case of a signature of magnetic origin, but also for most instrumental artifacts. \n\nFrom the series of tests presented here, only the one with low versus high Land\\'e factors was performed by \\cite{petit11} for Sirius~A. For consistency, we used their observing material to reproduce with Sirius~A the three tests applied to $\\beta$ UMa and $\\theta$ Leo. The result, not shown here, is fully consistent with the conclusions reached in the present study. Considered together, this series of tests strongly suggests that the circularly polarized signatures obtained for the three bright Am stars observed so far have a Zeeman origin.\n\nBased on this conclusion, it is tempting to estimate the surface field strength from our set of measurements, using the classical center of gravity (or first moment) method \\citep{rees79}. We must stress, however, that this widely used technique is based on the standard assumption that the Stokes V signature is antisymmetric about the line center, which is very far from the actual shape of our Stokes V signatures. A purely symmetric signature (closer to what is obtained for $\\beta$ UMa and $\\theta$ Leo) will be interpreted as a zero longitudinal field strength, regardless of the amplitude of the Stokes V signal, similarly to dipolar fields observed at the rotational phase of a crossover configuration (e.g., \\citealt{auriere07}). The situation here is obviously different, because the large time span of data collection is very unlikely to be restricted to a crossover phase. Nevertheless, such a measurement (and in particular its error bar) provides us with a quality measure of the sensitivity of the magnetic diagnosis that can be compared to similar studies. The first moment estimate of the magnetic field provides us with a field strength of $-1\\pm0.8$~G for $\\beta$ UMa and $-0.4\\pm0.3$~G for $\\theta$ Leo that is unsurprisingly consistent with zero (as previously reported with Sirius~A). As an attempt to propose a more relevant proxy of the field strength, we calculate the equivalent width (EW) of the Stokes V signature and normalize this EW by the one of the Stokes I profile. By doing so, we obtain a normalized EW equal to $1.96 \\times 10^{-4}$ for $\\beta$ UMa, and $5.44 \\times 10^{-5}$ for $\\theta$ Leo. For Sirius~A, the normalized EW is equal to $6.68\\times 10^{-5}$.   \n\n\\section{Discussion}\n\n\\subsection{Peculiar Stokes V signatures in Am stars}\n\nThe observations presented here provide new clues to the weak polarized signatures produced in the photospheres of intermediate-mass stars. We report the detection of weak Stokes V signatures in two of the brightest Am stars, which complements the previous detection of a similar polarized signal for Sirius~A \\citep{petit11}\\footnote{an observation confirmed by independent HARPSpol observations carried out by \\cite{kochukhov14}.}. Considered together, the three polarimetric detections constitute a 100 percent detection rate so far in our sample of bright Am stars, suggesting widespread similar signatures in this stellar class. \n\n\\begin{figure}[H]\n\\includegraphics[scale=0.34]{eeq_betauma2.pdf}\n\\includegraphics[scale=0.34]{eeq_thetaleo2.pdf}\n\\includegraphics[scale=0.34]{eeq_alpha2cvn.pdf}\n\\caption{Same as Fig. \\ref{fac_lande} for photospheric lines of low (thin red line) and high (thin green line) central depth.}\n\\label{eeq}\n\\end{figure}\n\nAll signals observed to now possess roughly the same shape, with one positive lobe roughly symmetric about the line center and occupying most of the width of the line profile. Negative lobes surrounding the positive one, if they exist, do not exceed the noise level in the data sets available to us. These profile shapes displaying net circular polarization are atypical of Zeeman signatures observed in other classes of magnetic stars, where the integral of the Stokes V profile is generally close to null. This peculiar shape naturally prompts questions about the origin of these polarized spectral features. The tests conducted in our study show that these unexpected signatures depend on spectral line parameters (wavelength, Land\\'e factor, line depth), as expected from a Zeeman signal. \n\nStokes V profiles that are nearly symmetric about the line center are common. These patterns are temporarily observed when two magnetic poles of an inclined dipole are seen on the visible hemisphere of a star, close to the limb, and therefore with different radial velocities (at the so-called crossover rotational phases). This simple interpretation is, however, very unlikely here since our co-added LSD profiles mix data collected over timespans much longer than the typical rotation periods of Am stars, merging a large number of random rotation phases.  A dominant toroidal magnetic field component is also able to generate symmetric Stokes V profiles \\citep{donati05}, although this specific type of magnetic geometry should not produce any net circular polarization, as observed here. In any case, a purely geometric explanation is not able to account for the absence of negative lobes in the Stokes V profiles.    \n\nA number of cool active stars were reported to display weak net circular polarization after integration over LSD line profiles \\citep{petit05, auriere08, morgenthaler12, auriere11, tsvetkova13, lebre14}. However, no similar findings have been reported so far in strongly magnetic massive stars or intermediate-mass stars, and the very subtle effect reported for cool stars is nowhere near the extreme stituation reported here. For cool stars, the proposed interpretation was adapted from solar physics, where abnormal Stokes V are routinely described (e.g., \\citealt{solanki93}) and attributed to simultaneous vertical gradients in velocities and magnetic field strengths (\\citealt{lopez02} and references therein). Single-lobed signatures resembling those recorded for Am stars can be locally observed in solar magnetic elements \\citep{viticchie11,sainz12}, but they are more difficult to justify in the case of disk-integrated measurements (as obtained for unresolved stars) because of the organized flows and magnetic fields invoked to justify their shape. Relatively strong magnetic fields are also involved in asymmetric solar Stokes V profiles, although the very weak disk-integrated signatures reported here do not tell much about local magnetic strengths, which could potentially be rather large in the case of a very tangled field geometry.\n\nThe absence of any similar phenomenon in Ap stars (in spite of masses roughly identical to those of Am stars) may simply be related to the lack of any significant surface turbulence due to the strong magnetic fields permeating their photosphere \\citep{folsom13} and, in the case of Bp stars, to a photospheric temperature too high to allow for a thin convective shell, even in the absence of their magnetic field. The situation is different for Am stars, for which high-resolution spectra have revealed stronger microturbulence than for normal A stars \\citep{landstreet09}, as long as their effective temperature remains below about 10,000~K, a condition fulfilled by our two targets and by Sirius~A. The very shallow convective shell producing this turbulent velocity field may host supersonic convection flows \\citep{kupka09}. This could provide the source of sharp velocity and magnetic gradients needed to produce strongly asymmetric profiles. Shocks traveling in this superficial turbulent zone may also contribute to amplify any existing magnetic field, as previously proposed in the context of the Mira star $\\chi$~Cygni \\citep{lebre14}. \n\nIn any case, a physical model able to produce a convincing reproduction of the peculiar polarized signatures reported for Am stars still needs to be developed. Preliminary simulations of Stokes V profiles with\nvelocity and field gradients show that signatures such as those observed\nin beta UMa, theta Leo, and Sirius A can be reproduced (C. Folsom, priv.\ncomm.). Without such a tool at our disposal, any quantitative description of the associated surface magnetic fields is out of reach, since techniques commonly used to estimate stellar magnetic field strengths (like the center-of-gravity method) are not suited to model Stokes V profiles following such unexpected shape. In practice, magnetic strengths derived for {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\ by applying the usual methods can only provide us with a lower limit of a few tenths of a gauss on the surface axisymmetric field component, which is consistent with the estimate available for on Sirius~A.\n\n\\subsection{Origin of the magnetism of Am stars}\n\n\\begin{figure}\n\\includegraphics[scale=0.34]{mean_lsd_betauma_year.pdf}\nÃ \\includegraphics[scale=0.34]{mean_lsd_thetaleo_year.pdf}\n\\caption{Top: Mean Stokes V profiles for the different years of observation of $\\beta$ UMa. Bottom: same figure for $\\theta$ Leo.}\n\\label{year}\n\\end{figure}\n\nWith only small number of objects observed so far and polarimetric signatures close to the detection limit, our observations only offer a few hints to the physical ingredients involved in the generation of the weak surface magnetic fields observed in Am stars.\n\nAn important clue to distinguishing between a dynamo-generated field and most other scenarios is the long-term evolution of the observed magnetic field, because a dynamo-generated field is likely to experience some temporal variability on a secular timescale. By splitting our data sets into subsets limited to a given year of observation, we are able to get a first glimpse at the stability of the polarimetric signal (Fig.~\\ref{year}). We find that signatures recovered one year apart are consistent with each other, showing that any variability over this timespan remains below the noise level. This outcome is consistent with similar attempts for Sirius~A and Vega.\n\nSurface brightness inhomogeneities are usually associated with the structured magnetic field produced by a global dynamo. The lack of any rotation period estimate available in the literature for {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\ suggests that any such brightness patches must take place on relatively small spatial scales or be limited to a very low contrast. We note that the recent discovery of rotational modulation in Am stars of the Kepler field by \\cite{balona15} was limited to targets that are significantly cooler than the objects of our study. A possibility is that the deeper convective envelope of stars in the Kepler sample may be more favorable to the onset of a large-scale dynamo. A very sensitive method, such as the one employed by \\cite{bohm15} to detect very faint starspots on Vega, may be the key to unveiling surface features on weakly magnetic Am stars like those studied here. We also note the lack of documented flaring events for these bright and well-studied stars, again in contrast to claims for cooler intermediate-mass stars observed with Kepler \\citep{balona13,balona15}.\n\n\\subsection{Toward a systematic exploration of weak magnetic fields in Am stars}\n\nThe ultra-deep polarimetric campaign carried out for three bright Am stars is far from exhausting the exploration of this stellar class. The most noticeable difference between these stars is that {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\ seem to be located near the end of the main sequence, while Sirius~A is a more standard main sequence object. One conclusion of our study is that these differences in the evolutionary status do not affect the recorded polarimetric signatures in any obvious way.\n\nWhile Sirius~A and {$\\theta$~Leo}\\ share a low projected rotational velocity, {$\\beta$~UMa}\\ displays a higher {$v\\sin{i}$}\\ value, although it is not possible to distinguish between the contribution of rotational and inclination effects in this parameter. The larger normalized EW of the polarimetric signal reported for {$\\beta$~UMa}\\ may be a first hint of a rotational dependence of the weak magnetism of Am stars, although a much larger sample is required to seriously test this hypothesis.\n \nFinally, all three objects observed so far were confined to a quite narrow band in effective temperature. The active behavior of cooler Am stars \\citep{balona13,balona15} is a strong motivation to expand the available sample to Am stars of late-A spectral types. Since the peculiar polarized signatures observed up to now are proposed to be indirect tracers of surface convective motions,\ngathering observations in cooler stars is an obvious way to test this hypothesis by considering the effects of varying the surface turbulent flows on the polarized signature.\n\n\\begin{acknowledgements}\nWe acknowledge support from the ANR (Agence Nationale de\nla Recherche) project Imagine. This research has made use of the SIMBAD database\noperated at the CDS, Strasbourg (France) and of NASA's Astrophysics Data System\n(ADS). CPF is supported by the ANR grant \"Toupies: Towards understanding the spin evolution of stars\". GAW acknowledges Discovery Grant support from the Natural Science and Engineering Research Council (NSERC) of Canada. We are grateful to the referee, Iosif Romanyuk, for constructive comments.\n\\end{acknowledgements}\n\n\\bibliographystyle{aa} \n\\bibliography{biblio_v2}\n\n\\Online\n\n\\begin{appendix}\n\n\\section{Journal of observations}\n\n\\begin{table}[h]\n\\label{obs}\n\\caption{Journal of observations. The columns contain the date for\neach Stokes V sequence, the heliocentric Julian date corresponding to\nthe middle of the observation time, the object name, the number of\nsequences, the exposure time per individual subexposure and the\naveraged S/N in the individual LSD Stokes V\npseudo-line profiles ($\\pm$rms).}\n\\centering\n\\tabcolsep=3pt\n\\begin{tabular}{c c c c c}\n\\hline\nDate & Mid-HJD & Star & $T_{exp}$ (s) & S/N\\\\\n\\hline\n\\hline\n17 Mar 2010 & 2455273.520 & $\\beta$ UMa & 16$\\times$4$\\times$107 &\n52707$\\pm$6090\\\\\n06 Apr 2010 & 2455293.412 & $\\beta$ UMa & 17$\\times$4$\\times$107 &\n49436$\\pm$22333\\\\\n10 Apr 2010 & 2455297.444 & $\\beta$ UMa & 19$\\times$4$\\times$107 &\n76493$\\pm$1960\\\\\n11 Apr 2010 & 2455298.397 & $\\beta$ UMa & 19$\\times$4$\\times$107 &\n32500$\\pm$7752\\\\\n25 Mar 2011 & 2455646.426 & $\\beta$ UMa & 25$\\times$4$\\times$107 &\n56378$\\pm$24444\\\\\n31 Mar 2011 & 2455652.504 & $\\beta$ UMa & 25$\\times$4$\\times$107 &\n45963$\\pm$4907\\\\\n02 Apr 2011 & 2455654.379 & $\\beta$ UMa & 03$\\times$4$\\times$107 &\n53964$\\pm$8998\\\\\n04 Apr 2011 & 2455656.462 & $\\beta$ UMa & 24$\\times$4$\\times$107 &\n69029$\\pm$6099\\\\\n22 Jan 2012 & 2455949.644 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n44503$\\pm$1018\\\\\n23 Jan 2012 & 2455950.628 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n39774$\\pm$5090\\\\\n24 Jan 2012 & 2455951.624 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n41547$\\pm$3889\\\\\n25 Jan 2012 & 2455952.640 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n41737$\\pm$3134\\\\\n14 Mar 2012 & 2456001.579 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n43929$\\pm$1810\\\\\n15 Mar 2012 & 2456002.524 & $\\theta$ Leo & 10$\\times$4$\\times$180 &\n47360$\\pm$698\\\\\n24 Mar 2012 & 2456011.526 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n44880$\\pm$1487\\\\\n25 Mar 2012 & 2456012.502 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n47392$\\pm$506\\\\\n27 Mar 2012 & 2456013.400 & $\\theta$ Leo & 10$\\times$4$\\times$180 &\n40883$\\pm$1229\\\\\n21 Mar 2013 & 2456373.488 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n25542$\\pm$4619\\\\\n23 Mar 2013 & 2456375.465 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n29220$\\pm$2557\\\\\n16 Apr 2013 & 2456399.444 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n23751$\\pm$3600\\\\\n17 Apr 2013 & 2456400.492 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n45010$\\pm$1529\\\\\n22 Apr 2013 & 2456405.512 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n42777$\\pm$1707\\\\\n23 Apr 2013 & 2456406.454 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n42064$\\pm$2815\\\\\n24 Apr 2013 & 2456407.502 & $\\theta$ Leo & 09$\\times$4$\\times$180 &\n39578$\\pm$2497\\\\\n14 Apr 2014 & 2456762.445 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n25433$\\pm$8566\\\\\n07 May 2014 & 2456785.408 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n42839$\\pm$3748\\\\\n08 May 2014 & 2456786.411 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n39435$\\pm$2842\\\\\n09 May 2014 & 2456787.416 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n44236$\\pm$617\\\\\n14 May 2014 & 2456792.471 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n42041$\\pm$543\\\\\n15 May 2014 & 2456793.413 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n44653$\\pm$1052\\\\\n07 Jun 2014 & 2456816.408 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n29599$\\pm$1530\\\\\n10 Jun 2014 & 2456819.415 & $\\theta$ Leo & 05$\\times$4$\\times$180 &\n29931$\\pm$3928\\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\n\\section{Parameters of LSD profiles}\n\n\n\\begin{table}[h]\n\\caption{Mean and normalization parameters of the original mean LSD line profiles for $\\beta$ UMa, $\\theta$ Leo, and $\\alpha^2$ CVn.}\n\\label{lsd_parameter}\n\\centering\n\\begin{tabular}{c c c c}\n\\hline\n  & $\\beta$ UMa & $\\theta$ Leo & $\\alpha^2$ CVn\\\\\n\\hline\nOriginal Mask\\\\\n\\hline\nMean Land\\'e factor \\textit{g} & 1.207 & 1.206 & 1.218\\\\\nMean wavelength (nm) & 475.72  & 489.05 & 493.34\\\\\nMean line depth & 0.322 & 0.311 & 0.297 \\\\\nNormalized Land\\'e factor & 1.216 & 1.227 & 1.241\\\\\nNormalized wavelength (nm) & 500.00 &500.00 & 500.00\\\\\nNormalized depth & 0.450 & 0.433 &0.410 \\\\\n\\hline\nLow\\textit{g}LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g}& 0.941 & 0.956 & 0.971\\\\\nMean wavelength (nm) & 472.22  & 488.71 & 494.91\\\\\nMean line depth & 0.311 & 0.317 & 0.308\\\\\nNormalized Land\\'e factor & 0.939 & 0.957 & 0.992\\\\\nNormalized wavelength (nm) & 500.00 &500.00 & 500.00\\\\\nNormalized depth & 0.464 & 0.441 &0.421 \\\\\n\\hline\nHigh\\textit{g}LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g}& 1.529 & 1.516 & 1.533\\\\\nMean wavelength (nm) & 479.95  & 489.48 & 491.27\\\\\nMean line depth & 0.310 & 0.305 & 0.283\\\\\nNormalized Land\\'e factor & 1.469 & 1.463 & 1.489\\\\\nNormalized wavelength (nm) & 500.00 &500.00 & 500.00\\\\\nNormalized depth & 0.436 & 0.4253 &0.397 \\\\\n\\hline\nLow wavelength LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g}& 1.219 & 1.217 & 1.229\\\\\nMean wavelength (nm) & 419.88  & 420.29 & 400.88\\\\\nMean & 0.381 & 0.361 & 0.049\\\\\nNormalized Land\\'e factor & 1.2 & 1.2 & 1.2\\\\\nNormalized wavelength (nm) & 450.03 & 457.57 & 464.26\\\\\nNormalized depth & 0.522 & 0.495 & 0.465 \\\\\n\\hline\nHigh wavelength LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g}& 1.197 & 1.195 & 1.206\\\\\nMean wavelength (nm) & 573.3  & 604.7 & 713.43\\\\\nMean line depth & 0.275 & 0.267 & 0.256\\\\\nNormalized Land\\'e factor & 1.2 & 1.2 & 1.2\\\\\nNormalized wavelength & 593.28 & 606.06 & 623.95\\\\\nNormalized depth & 0.375 & 0.358 &0.333 \\\\\n\\hline\nLow depth LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g} & 1.219 & 1.209 & 1.226\\\\\nMean wavelength (nm) & 505.58  & 507.28 & 512.475\\\\\nMean line depth & 0.214 & 0.212 & 0.203\\\\\nNormalized Land\\'e factor & 1.328 & 1.358 & 1.405\\\\\nNormalized wavelength (nm) & 500.00 &500.00 & 500.00\\\\\nNormalized depth & 0.253 & 0.252 &0.238 \\\\\n\\hline\nHigh depth LSD\\\\\n\\hline\nMean Land\\'e factor\\textit{g}& 1.170 & 1.192 & 1.193\\\\\nMean wavelength (nm) & 480.14  & 481.97 & 480.45\\\\\nMean line depth & 0.628 & 0.643 & 0.588\\\\\nNormalized Land\\'e factor & 1.205 & 1.141 & 1.208\\\\\nNormalized wavelength (nm) & 500.00 &500.00 & 500.00\\\\\nNormalized depth & 0.646 & 0.649 &0.599 \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\\end{appendix}\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\noindent where $w_{i}$ and $S/R_{i}$ are the weight and S/N of the $i^{th}$ pseudo profile. \n\nWe\nchoose here to keep all profiles in this process, even those with the\nlowest S/N (LSD profiles with S/N lower than 10,000 represent 16\nobservations for $\\beta$ UMa and 2 for $\\theta$ Leo), because this\nsystematic rejection was found to provide us with nothing more than a marginal modification of the\nresult (and no noticeable improvement). The grand average LSD profiles are presented in\nFig.~\\ref{lsd}. With the large number of spectra collected here, the\ncoaddition of all profiles increases the S/N by a factor $\\approx$ 10,\ncompared to individual profiles. The resulting S/N of the grand average\nV profiles is 653,640 for $\\beta$ UMa and 512,370 for $\\theta$ Leo (using the normalization parameters listed in Table \\ref{lsd_parameter}). \n\nOne\nlimitation of this rough co-addition method is that we average together\nobservations taken at different rotational phases. In the absence of any known rotation period, we assume our data are distributed over all rotation phases with the same probability. We therefore lose any phase-resolved\ninformation, and the axisymmetric surface structures (i.e., structures symmetric about the spin axis) are the most likely to survive the coaddition process and actually \ncontribute to the grand average. This strategy is, however, successful\nat reducing the noise level enough to permit the detection of\ncircularly polarized signatures in both stars, while the null profiles\nremain free of any feature above noise level.\n\n \\begin{figure}[H]\n\\centering\n\\includegraphics[scale=0.34]{mean_lsd_betauma.pdf}\n\\includegraphics[scale=0.34]{mean_lsd_thetaleo.pdf}\n\\caption{Coadded LSD profiles in Stokes I (bottom) and V (top). The two available ``null'' control parameters Null1 and Null2 are shown in the middle panel. Top: $\\beta$ UMa observations. Bottom: Same figure for $\\theta$ Leo. All profiles are normalized to the continuum level.}\n\\label{lsd}\n\\end{figure}\n\nReduced spectra are provided by Libre-Esprit with a normalized\ncontinuum, although the actual resulting continuum typically deviates by up to\n15\\% from unity, especially in the bluest orders of the spectra. To\ntest the impact of this imperfect automated processing on the result of our LSD analysis, we\nnormalized each of the 40 echelle orders for each spectrum (see\n\\citealt{neiner14}) with the continuum task of IRAF\\footnote{Image\nReduction and Analysis Facility, http://iraf.noao.edu/}. The new\nnormalization improves the S/N of the individual LSD profiles by about 5\\%. We\nnotice that the upgraded normalization changes the resulting\nLSD profiles slightly, however the improvement is very marginal, even at the\nextremely high S/N of our grand average profiles. In spite of the limited quality of the default continuum normalization, the robustness of\nLSD is mainly due to the\nlarge number of lines taken into account in the LSD process, compared\nto hotter stars for which the improved normalization is more useful. As a consequence, we simply consider here the spectra normalized \nwith Libre-Esprit for consistency with the previous\nstudies on Vega (\\citealt{lignieres09}, \\citealt{petit10}) and Sirius\n\\citep{petit11} in which the default renormalization was used.\n\n\\section{Results}\n\n\\subsection{LSD profiles with complete line mask}\n\\label{sect:complete}\n\nThe Stokes I, V, Null1 and Null2 co-added LSD profiles of $\\beta$ UMa and $\\theta$ Leo are shown in Fig.~\\ref{lsd}. They display clear Stokes V signatures at the radial velocity of the Stokes I line profiles. The circularly polarized signal observed for both stars covers most of the width of the line and is mostly symmetric about the line centroid. In both cases, a positive lobe dominates the signal. No detectable signal is seen in the Null1 and Null2 control profiles. We computed the detection probability of the Stokes V signal by using the $\\chi^2$ test proposed by \\cite{donati92}, getting a detection probability of $\\sim$100~\\% for both stars with a false alarm probability below $10^{-11}$  for $\\beta$ UMa and equal to 6.5$\\times 10^{-6}$ for $\\theta$ Leo. Outside of the stellar lines, we obtained a marginal signal detection for $\\beta$ UMa, due to the negative bump in the Stokes V continuum showing up at a radial velocity of around -200 {km\\,s$^{-1}$}. This continuum feature, not observed for {$\\theta$~Leo}, may be due to residuals of line blends \\citep{kochukhov10b}. \n\nWe note that the Stokes V signatures detected in the co-added LSD profiles probably stem from a significant fraction of the individual LSD profiles, as various subsets from our complete data set (e.g., observations taken during a given year, see Fig. \\ref{year}) display the same signal when co-added separately, although with a higher noise level. The single-epoch subsets are obtained over a timespan that is much longer than the longest possible rotation period of the two targets, so that the co-addition process of many individual rotational phases should result, in all cases, in a filtering of any signatures resulting from nonaxisymmetric magnetic structures.\n\n \n\n\\subsection{Possible instrumental artifacts at high S/N}\n\nThe very high S/N achieved to detect weak polarimetric signatures in intermediate-mass stars raises the question of possible instrumental effects that could contribute to generate spurious signatures in NARVAL Stokes V sequences.  All spectra obtained for our study display a peak S/N below 2,000, and the majority of them are kept below 1,500. At such S/N values, we safely stay away from the saturation regime of the detector (S/N above 2,000 for standard early-type stars). We note that subsets extracted from our complete time-series display consistent signatures, regardless of the S/N of the subset, as highlighted by, e.g., Fig. \\ref{year}. In any case, most spurious signatures generated by nonlinear behavior of the detector are expected to show up in the Null1 and Null2 check profiles (especially if the S/N is fluctuating from one subexposure to the next), which is not seen here. \n\nFrom an empirical point of view, we stress that the signatures recorded so far for Sirius A \\citep{petit11,kochukhov14} display a similar shape using three different instrumental setups (ESPaDOnS, NARVAL, HARPSpol) and three different models of CCD detector and two different reduction pipelines, giving strong confidence in a stellar origin of the polarized signature. We finally emphasize that a number of stars belonging to several classes were previously observed at a comparable S/N, which resulted in no Stokes V detection in two normal B stars \\citep{wade14, neiner14}, in a definite Stokes V detection (with a standard Zeeman shape) for the $\\lambda$~Boo star Vega \\citep{lignieres09}, and in a definite Zeeman detection (again with a standard shape) for the cool giant Pollux \\citep{auriere09}.\n\nAnother potential source of instrumental artifacts, especially for very weak Stokes V signatures, is possible crosstalk from linear to circular polarization. This effect is documented for NARVAL and ESPaDOnS (e.g., \\citealt{silvester12}). Stokes Q and U spectra were obtained for Sirius~A by \\cite{petit11}, featuring no polarimetric signal at a level that could significantly contribute to the Stokes V signal. The same profile shape obtained for Sirius A using three instruments affected by different crosstalk levels is, in itself, an independent evidence that linear polarization did not contaminate the Stokes V signature.  \n\nConsidering this context as a whole, we conclude that a convincing body of evidence now exists to safely conclude that the Stokes V signal observed for {$\\beta$~UMa}\\ and {$\\theta$~Leo}\\   most likely has a stellar origin.\n\n\n\\subsection{Establishing the Zeeman origin of Stokes V signatures}\n\n\\subsubsection{Method outline}\n\nThe shapes of the signatures in the Stokes V profiles (mainly constituted of a positive lobe) are not expected in the standard theory of the Zeeman effect, which predicts that lobes of positive and negative signs should be observed, resulting in a zero-integral Stokes V profile. This surprising observation, and the extremely low amplitude of the recorded signatures, raise natural concerns about possible artifacts that may contribute to the observed polarized signal. Considered all together, the standard series of tests detailed in Sect. \\ref{sect:complete} provides us with strong evidence that the recorded signatures are stellar in origin. Other convincing evidence includes the possibility that crosstalk from linear to circular polarization is not involved \\citep{petit11} and that no similar signatures were observed in other hot or tepid stars studied at a similar level of accuracy \\citep{lignieres09,wade14,neiner14}, in spite of a strictly identical instrumental setup. HARPSpol observations reported by \\cite{kochukhov14} also confirm that the peculiar signature reported for Sirius~A is still obtained when using a completely different instrument and different reduction software.   \n\nEven if instrumental effects can be safely excluded, the physical origin of the signal still requires further investigation. We propose here a series of tests to ascertain the Zeeman origin of the recorded signal. The basic idea is that the amplitude of Zeeman signatures is expected to depend on various line parameters (Land\\'e factor, wavelength, line depth), so that a careful selection of spectral lines for the LSD procedure should confirm or refute this dependence in our data. We therefore run again the LSD process using a number of new line lists, extracted from our original list but featuring a selection of lines where one line parameter has been restricted to a given range. In the weak field approximation, Stokes V signals are related to line parameters according to the following equation:\n\n\n", "index": 3, "text": "\\begin{equation}\nV \\propto g.\\lambda_0^2 .B_\\parallel .\\partial I / \\partial \\lambda\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"V\\propto g.\\lambda_{0}^{2}.B_{\\parallel}.\\partial I/\\partial\\lambda\" display=\"block\"><mrow><mrow><mi>V</mi><mo>∝</mo><mi>g</mi></mrow><mo>.</mo><msubsup><mi>λ</mi><mn>0</mn><mn>2</mn></msubsup><mo>.</mo><msub><mi>B</mi><mo>∥</mo></msub><mo>.</mo><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>I</mi></mrow><mo>/</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>λ</mi></mrow></mrow></mrow></math>", "type": "latex"}]