[{"file": "1601.02398.tex", "nexttext": "\n\n\\noindent\nwhere $<i,j>$ indicates the bonded pair of atoms i and j, $t_{ij}$ represents the hopping or transfer \nintegral between bonded pair i and j, $a_{i\\sigma}^\\dagger$ ($a_{i\\sigma}$) is the creation (annihilation) \noperator at site i with spin $\\sigma$ and $n_i$ is the number operator. U is the Hubbard on-site repulsion \nparameter and $V_{ij}$ is the intersite electron-electron repulsion between sites i and j. $V_{ij}$-s are \nparameterized using the Ohno parametrization \\cite{ohno,*klopman}, \n\n\n", "itemtype": "equation", "pos": 10513, "prevtext": "\n\n\\title{Correlated Electronic Properties of Some Graphene Nanoribbons: A DMRG Study}\n\n\\date{\\today}\n\n\\author{V. M. L. Durga Prasad Goli}\n\\email[Electronic mail:]{durgaprasad.vml@gmail.com}\n\\thanks{VMLDPG and SP have contributed equally to this work.}\n\\affiliation{Solid State and Structural Chemistry Unit, Indian Institute of Science, Bangalore-560012, India.}\n\\author{Suryoday Prodhan}\n\\email[Electronic mail: ]{suryodayp@sscu.iisc.ernet.in}\n\\affiliation{Solid State and Structural Chemistry Unit, Indian Institute of Science, Bangalore-560012, India.}\n\\author{Sumit Mazumdar}\n\\email[Electronic mail: ]{sumit@physics.arizona.edu}\n\\affiliation{Department of Physics, University of Arizona, Tucson, Arizona 85721, USA.}\n\\affiliation{College of Optical Sciences, University of Arizona, Tucson, Arizona 85721, USA.}\n\\author{S. Ramasesha}\n\\email[Electronic mail: ]{ramasesh@sscu.iisc.ernet.in}\n\\affiliation{Solid State and Structural Chemistry Unit, Indian Institute of Science, Bangalore-560012, India.}\n\n\n\\begin{abstract}\n\nThe electrons in Graphene Nano Ribbons (GNRs) experience strong electron-electron interactions. \nMost theoretical models developed are based on either single-band tight-binding model or\nrestricted configuration interactions which cannot capture the role of correlations adequately.\nThe GNRs are quasi-one-dimensional systems and narrow GNRs can be studied using the highly\naccurate density matrix renormalization group (DMRG) method. We have employed the symmetrized\nDMRG method to obtain properties such as low-lying one- and two-photon excitations, spin in the\nground state, charge gaps and bond orders. We note that in the zigzag fused naphthalene, the\nground state spin shows a tendency to increase with system size and the system can be expected\nto have bulk magnetization in the thermodynamic limit. The two photon gap vanishes in this system\nin the thermodynamic limit. The armchair fused naphthalene does not show this behavior and neither\ndoes polyperylene. Armchair fused naphthalene shows very small gap between the one- and two-photon\nstates and the ordering of the excited states indicates the possibility of strong fluorescence in\nthis system. Bond order studies show that zigzag fused naphthalene does not have tendency to distort\nwhile armchair fused naphthalene and polyperylene have a tendency to distort along the edges. The\ncharge gaps indicate that all these systems are semiconducting contrary to the tight-binding calculation \npredictions.\n\n\\end{abstract}\n\n\\pacs{71.27.+a,73.22.-f,78.67.-n}\n\n\\keywords{Strongly correlated electronic systems; Symmetrized DMRG calculation; Graphene nanoribbons;\nLow-lying electronic states.}\n\n\\maketitle\n\n\\section{Introduction}\n\nCarbon has come to the fore in the last few decades for many exciting electronic and magnetic \nproperties with the discovery of bucky ball in the eighties to carbon nanotubes in the nineties\nto graphene and graphene nanoribbons in the last decade \\cite{saito, dresselhaus, geim}. In all these\nsystems, we can notionally assume that the carbon atom is in sp$^2$ hybridization. Hence,\nthese systems belong to the class of conjugated carbon systems. In recent years, Graphene nanoribbons \n(GNRs) have attracted huge attention because of their exotic electronic properties and plausible \napplications in nanoelectronics \\cite{neto, allen, sarma, Schwierz, morris}. GNRs are quasi one-dimensional \nforms of graphene, which exhibit exciting electronic properties because of the confinement of electrons \nin low dimension \\cite{neto, fujita, nakada, ezawa, Wakabayashi}. These electronic properties also depend  \ncrucially on the geometry of the edges of the infinite ribbons. The GNRs are classified into two types based \non the edge structures, namely, zigzag and armchair GNRs. Based on the one-band tight-binding approximation, \nit is found that the band gap of zigzag GNRs is zero and the ground state is metallic while the band gap of \narmchair GNRs varies from insulating to semiconducting or metallic as a function of the ribbon width \n\\cite{ezawa, brey, son}. Ribbons with 3p+2 (p is an integer) dimer bonds (bonds between neighboring sites \nalong the ribbon width) in a unit cell are metallic and others are semiconducting \\cite{son}. GNRs with \ndifferent widths have been made using various techniques like mechanical cutting of exfoliated graphenes or by\npatterning epitaxially grown graphenes \\cite{berger, chen, han, tapaszto, datta1, li}.\n\n\\begin{figure}[tbp]\n\\begin{center} \n\\includegraphics[width=8.0cm]{struc_ribbons.eps}\n\\caption{\\label{strucr} Molecular structures of (a) zigzag fused naphthalene (b) armchair \nfused naphthalene and (c) polyperylene. The unit cell for each nanoribbon is shown within \nsquare brackets.}\n\\end{center}\n\\end{figure}\n\nBecause the GNRs are made of sp$^2$ carbon atoms and are quasi one-dimensional,\nthe $\\pi$-electrons in GNRs experience strong electron repulsions. Besides, in these systems,\nit is reasonable to expect long-range electron-electron interactions as the armchair GNRs\nare semiconducting and even in metallic GNRs, the screening length for electron-electron\ninteractions can be expected to be long as these systems are better described as zero\ngap semiconductors. Thus, understanding the electronic properties such as optical gaps, \ntwo-photon gaps, charge gaps and related properties of GNRs requires an accurate study \nof long-range correlated models. For conjugated carbon systems, it has been well established \nthat the excited state properties are well reproduced by the Pariser-Parr-Pople (PPP) model which\nassumes $\\sigma - \\pi$ separability and incorporates long-range electron-electron repulsions \\cite{pppm,*pople}. \nThe GNRs being quasi-one-dimensional, the symmetrized density matrix renormalization group \n(DMRG) method provides highly accurate description of ground and low-lying excited states. \nIn this work, we have studied the electronic properties of a few of the following \nnanoribbons: 1) zigzag fused naphthalene in which naphthalene units are fused to form a zigzag GNR \nstructure, 2) an armchair fused naphthalene and 3) fused perylenes in armchair configuration \nby employing the DMRG method within the PPP model. We have also studied the spin and charge gaps in the \npresence of long-range electron-electron interactions. We have also computed the bond orders \nto examine the tendency of these systems for Peierls type distortion. \n \nThere are some related works on the zigzag and armchair GNRs which we briefly mention here. \nFujita et al. have studied both armchair and zigzag graphene ribbons with tight\nbinding approximation and reported the presence of edge states near the Fermi level for zigzag\nnanoribbons, resulting in high density of states near the Fermi level \\cite{fujita}. The wave vectors of edge state\nwavefunctions, $k$, satisfy $2\\pi/3\\le|k|\\le\\pi$. These states are highly localized at the edge sites and small\npenetration from the edge sites towards inner sites are observed when $|k|<\\pi$ but are completely localized for $k=\\pi$. \nPresence of these almost flat bands is absent in armchair nanoribbons and is a consequence of the topology of the \n$\\pi$-electronic structure. The flattening of these bands increases for wider ribbons although \nthe overall importance of these states in the band structure diminishes. However, even in a general \nnanoribbon which cannot be classified either as perfectly armchair or perfectly zigzag, a few sequentially \nplaced zigzag sites can result in significant density of states at the Fermi level \\cite{nakada}. \nIn the correlated picture, these almost flat bands result in magnetic solutions where spins are arranged \nferromagnetically at the edges \\cite{fujita}. Because of the degeneracy of these half-filled orbitals, \nthe direct exchange interactions between the electrons occupying these orbitals lead to a ferromagnetic state.\nOpposite edges of the ribbon will have opposite alignment of spins making the ribbon non-magnetic in the thermodynamic \nlimit. Ezawa has studied bandgaps in a range of nanoribbons in the H\\\"{u}ckel picture and predicted the width \ndependence of the bandgaps in these systems \\cite{ezawa}. He has also found incorporation of edge effects by \nchanging the transfer term or site energies of the edge sites has little effect on the band structure. \nBrey and Fertig studied electronic structure of zigzag and armchair nanoribbons using massless Dirac \nequation and their results are in agreement with the tight binding results, except for narrow nanoribbons \\cite{brey}.\nThey proposed that the continuum analysis of graphene can quantitatively predict the properties of these systems. \nSon et al. have computed the band gaps for armchair GNRs using the first-principle \napproach \\cite{son}. They have also confirmed that the geometry of edges plays an important role in determining \nif the band gap is vanishing or non-vanishing. The edge magnetism in zigzag nanoribbon has also been \nstudied using mean-field Hubbard model by Jung and coworkers \\cite{jung}, employing quantum Monte Carlo \ntechnique by Golor et al. \\cite{golor} and by renormalization technique by Hikihara et al. \\cite{hikihara} \nand experimentally observed at room temperature by Magda and coworkers \\cite{magda}. Using quantum \nmany-body configuration interaction method, Dutta $et~al.$ have studied low-energy properties \nsuch as the ground state energies as well as the ground state spins, spin and charge densities \nof both zigzag and armchair GNRs within the Hubbard model \\cite{datta2}. They have predicted \nthat the ground state of zigzag GNR is a high-spin state and for armchair GNR the ground \nstate is a singlet. Within the PPP model, the spin and charge gaps of the armchair polyacene \nhave been studied by Das \\cite{das}. She has shown that the ground state of armchair polyacene \nis a singlet and she predicted that this system is an insulator in the ground state. \n \n\nThis paper is organized as follows. In section II, we introduce the model Hamiltonian  \nand briefly describe the numerical technique which we have employed in our study. In section III, \nwe present and discuss the results of zigzag and armchair fused naphthalenes and polyperylene.  \nIn the final section, we present a comparison of these three systems and summarize our results. \n\n\\section{Model Hamiltonian for Graphene Nanoribbons}\n\nWe have employed the PPP Hamiltonian to study the electronic properties of these nanoribbons. \nThe PPP  Hamiltonian \\cite{pppm} can be written as -\n\n\n", "index": 1, "text": "\\begin{equation}\n\\begin{split} \nH = \\sum_{<i,j>, \\sigma}t_{ij}(a_{i\\sigma}^\\dagger a_{j\\sigma}+&\na_{j\\sigma}^\\dagger a_{i\\sigma}) + \\frac{1}{2} \\sum_{i}U_i n_i (n_i-1)\\\\\n&+\\sum_{i>j} V_{ij}(n_i-1)(n_j-1)\n\\label{hamlt}\n\\end{split} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle H=\\sum_{&lt;i,j&gt;,\\sigma}t_{ij}(a_{i\\sigma}^{\\dagger}a_%&#10;{j\\sigma}+&amp;\\displaystyle a_{j\\sigma}^{\\dagger}a_{i\\sigma})+\\frac{1}{2}\\sum_{i}%&#10;U_{i}n_{i}(n_{i}-1)\\\\&#10;&amp;\\displaystyle+\\sum_{i&gt;j}V_{ij}(n_{i}-1)(n_{j}-1)\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mi>H</mi><mo>=</mo><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi/><mo>&lt;</mo><mi>i</mi></mrow><mo>,</mo><mi>j</mi><mo>⁣</mo><mrow><mo>&gt;</mo><mo>,</mo><mi>σ</mi></mrow></mrow></munder><msub><mi>t</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>a</mi><mrow><mi>i</mi><mo>⁢</mo><mi>σ</mi></mrow><mo>†</mo></msubsup><msub><mi>a</mi><mrow><mi>j</mi><mo>⁢</mo><mi>σ</mi></mrow></msub><mo>+</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><msubsup><mi>a</mi><mrow><mi>j</mi><mo>⁢</mo><mi>σ</mi></mrow><mo>†</mo></msubsup><msub><mi>a</mi><mrow><mi>i</mi><mo>⁢</mo><mi>σ</mi></mrow></msub><mo stretchy=\"false\">)</mo><mo>+</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msub><mi/><mi>i</mi></msub><mi>U</mi><msub><mi/><mi>i</mi></msub><mi>n</mi><msub><mi/><mi>i</mi></msub><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>i</mi></msub><mo>-</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>&gt;</mo><mi>j</mi></mrow></munder><mrow><msub><mi>V</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>i</mi></msub><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>j</mi></msub><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.02398.tex", "nexttext": "\n\n\\noindent\nwhere the intersite repulsion integrals, $V_{ij}$-s are interpolated between U at $r_{ij}=0$ {\\AA} and \n$e^2/r_{ij}$ for $r_{ij}\\rightarrow$ $\\infty$. For our study, we have taken the nearest neighbor distance \nbetween the carbon atoms as 1.42 {\\AA} and we fixed parameters, $t_{ij}$ as $-2.40$ eV and U as $11.26$ eV. \n\nWe are interested in the properties of the zigzag and armchair fused naphthalenes and polyperylene systems \n(Fig. \\ref{strucr}) in the thermodynamic limit. Thus, to achieve the thermodynamic limit, we need to resort \nto the finite size scaling technique. Exact studies of the model Hamiltonian is confined, at best, to about \n18 carbon sites and hence cannot be employed for extrapolation to the thermodynamic limit. Restricted configuration \ninteraction approaches are not size consistent and hence cannot be employed with finite size scaling. Quantum Monte \nCarlo approach is also not suitable since we have long-range interactions in the model. However, the systems \nstudied are quasi one-dimensional and DMRG method appears to be best suited for this study. The DMRG method is \nknown to be very accurate for one-dimensional systems far from criticality. The area law guarantees that for \nthe same level of approximation, similar accuracy is retained independent of system size \\cite{scholl,hall}.\nIt has also been shown that for models with diagonal interactions in the real space such as the PPP model, \nthe entanglement entropy is similar to those in the Hubbard and the Heisenberg models in one-dimension \n\\cite{durga}. Thus, we can treat a system described by the PPP model Hamiltonian as a quasi-one-dimensional \nsystem, within a DMRG approach. Hence, we have employed the DMRG method to carry out our studies on these systems.\n\nThe DMRG method invented by White in 1992 divides a system block into two sub-blocks\n\\cite{white,*white-prb}. Density matrix of a chosen sub-block is obtained by treating the other\nblock as an environment block and tracing the density over the states of the environment block.\nThe density matrix eigenvectors (DMEVs) are chosen to span the Fock space of the sub-block. \nThe Fock space is truncated by retaining a subset of the DMEVs which have the highest densities.\nThe next step in the DMRG algorithm involves expanding the system block by adding a few sites (usually two) \nto the previous system block. The Hamiltonian matrix is constructed in the basis of the retained DMEVs\nand Fock states of the newly added sites. From the Hamiltonian matrix, desired eigenstates\nare obtained and the process of constructing the density matrix, truncating the Fock space of\nthe augmented system and expanding the system by adding two additional sites and solving for \nthe desired eigenstate of the system is repeated until we achieve the desired system size.\nThe dimension of the Hamiltonian matrix is independent of the system size as the number of DMEVs \nretained to span the Fock space of the sub-blocks is fixed, independent of the size of the sub-block.\nThe method described above is the infinite DMRG method. \n\n\\begin{figure*}[tbp]\n\\begin{center} \n\\includegraphics[width=15.0cm]{dmrg_zigzag.eps}\n\\caption{\\label{dmrg_zigzag} Construction of zigzag fused naphthalene in the infinite DMRG method. \n$\\blacksquare$  correspond to newly added sites and $\\bullet$ correspond to old sites in left and \nright blocks at a given DMRG step. Sites having unprimed site numbers belong to the left block and sites\nwith primed site numbers belong to the right block. (b) Scheme for finite DMRG sweeps. The corresponding \nfigures for armchair fused naphthalene and polyperylene are shown in Figs. $2$ and $3$ in the \nsupplemental material {\\cite{supple}}.}\n\\end{center}\n\\end{figure*}\n\nTo improve the accuracy for a finite system, White further developed a method called the finite DMRG method. \nIn the infinite DMRG method, the density\nmatrix of a p-site sub block is built from the eigenstates of a 2p site system block. This leads to\nerrors in the target system of 2N sites ($N>>p$). In order to correct this error, the\np-site density matrices are iteratively constructed from the eigenstates of the 2N site\ntarget system block, until convergence is achieved. The finite DMRG procedure for molecular systems is \nnontrivial but essential as the energies improve considerably following the sweeping. We have employed \nthe finite DMRG algorithm with a DMEV cut-off {\\it m}, of 500 and finite DMRG iteration of two sweeps\nto compare the DMRG method results with the exact calculation results for zigzag and armchair \nfused naphthalene structures as well as for the polyperylene within the non-interacting model (Table \\ref{tab_huckel}).\nThe ground state energies compare well with the exact H\\\"uckel energies in all cases for \nthe DMEV cut-off at m=500.  For the interacting models, we expect the DMRG \nmethod to be more accurate for the same cut-off as interacting systems are less entangled. \nThe method of constructing the GNRs in the infinite DMRG procedure as well as \nthe method of finite sweeps is shown in Fig. \\ref{dmrg_zigzag} and Figs. $1$, $2$ and $3$ in the supplemental material \n\\cite{supple}.\n\n\\begin{table}[tbp]\n\\begin{center}\n\\caption{\\label{tab_huckel} Comparison of the exact ground state energies of zigzag and armchair fused naphthalene \nand polyperylene systems in the non-interacting model against DMRG method. The DMRG cut-off employed here is 500.\nAll energies are given in eV units.}\n\\begin{ruledtabular}\n\\begin{tabular}{cc|c} \nSystem type and size &\\multicolumn{2}{c}{Ground state energy} \\\\\n\\cline{2-3}\n& Exact calculation & DMRG method\\\\\n\\colrule \nZigzag and 40 sites & -137.841  & -137.738  \\\\ \nArmchair and 40 sites & -139.503  & -139.312  \\\\  \nPolyperylene and 40 sites & -137.859  & -137.813  \\\\ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table}\n\nThe Hamiltonian has both total spin conservation and electron-hole symmetry. While exploiting\ntotal spin conservation is difficult within the DMRG scheme, we can exploit partial spin\nsymmetry by confining to the $M_S=0$ sector in which the Hamiltonian has spin inversion \nsymmetry. This symmetry corresponds to invariance of the Hamiltonian when all spins of the\nsystem are flipped. This symmetry bifurcates the $M_S=0$ space into a space with even total spin, i.e., \n$S = 0, 2, 4,\\cdot\\cdot\\cdot$ and another with odd total spin, $S=1, 3, 5,\\cdot\\cdot\\cdot$.\nAll these systems also have $C_2$ symmetry along the axis perpendicular to the plane of \nthe molecule. The identity, these three symmetry operators and their products form an Abelian group\nof eight elements. Hence, the $M_S=0$ \nsector gets subdivided into 8 subspaces. In general the ground state and the two-photon states \nof conjugated systems lie in `${}^eA^+$' subspace, while the dipole allowed, one-photon state \n(optical state) lies in the `${}^eB^-$' subspace. In $M_S=1$ sector, spin inversion symmetry cannot be\nemployed and the lowest triplet state remains in `$B^+$' space. The `$+$' and `$-$' superscript on the \nright-hand side denotes the character under electron-hole symmetry operation while `e' and `o' superscripts on the\nleft hand side indicate the character under spin inversion symmetry. Using symmetrized DMRG method \\cite{pati} \nwith a modified algorithm \\cite{suryo}, all of these symmetries have been exploited in these calculations.\nIn symmetrized DMRG calculations, we have kept the DMRG cut-off $m \\sim 750-800$. \n\n\\section{Results and Discussion}\n\n\\subsection*{Ground state energy per unit cell}\n\n\\begin{figure}[tpb]\n\\begin{center} \n\\includegraphics[width=8.5cm,height=7.5cm]{ebyn_1.eps}\n\\caption{\\label{ebyn} Ground state energy per unit cell vs 1/N for (a) zigzag and (b) armchair fused naphthalene \nand (c) polyperylene systems within the PPP model where N is the number of unit cells as depicted in Fig. \\ref{strucr}.} \n\\end{center} \n\\end{figure}\n\nWe have used the unsymmetrized DMRG technique to calculate the ground state energies of these systems within the PPP \nmodel (Fig. \\ref{ebyn}). The excellent linear fit of the energies as a function of system size shows that \nthe procedure is stable and accurate. For comparison, the ground state energy per site in polyacetylene is -2.14 eV, \nwhile the same are -2.556 eV, -2.625 eV and -2.571 eV in case of zigzag and armchair fused naphthalenes and polyperylene \nsystems. This also shows that the aromatic stabilization of armchair fused naphthalene is the highest, followed by \npolyperylene and zigzag fused naphthalene which are all comparable and have greater resonance stabilization than \ncarbon atoms in polyene \\cite{kuwajima}. In the thermodynamic limit, the ground state energies per unit cell of zigzag \nand armchair fused naphthalenes extrapolate to -15.34 eV and -31.50 eV respectively while in polyperylene it extrapolates \nto -25.71 eV per unit cell.\n\n\\begin{figure}[tbp]\n\\begin{center} \n\\includegraphics[width=8.5cm,height=7.5cm]{spingap_1.eps}\n\\caption{\\label{spingap_ribbons} Spin gaps as a function of the inverse of number of unit cells as shown in \nFig. \\ref{strucr} for (a) zigzag and (b) armchair fused naphthalene and (c) polyperylene systems within the \nPPP model. In the figure $\\Delta_1=E(M_S=1)-E(M_S=0)$, $\\Delta_2=E(M_S=2)-E(M_S=0)$ and $\\Delta_3=E(M_S=3)-E(M_S=0)$.}\n\\end{center} \n\\end{figure}\n \n\\subsection*{Spin gaps}\n\nIn the DMRG scheme, it is difficult to exploit total spin invariance. Thus, we can only obtain the total $M_S$ value \nof a state and not the total spin. However, it is possible to determine the spin of a state in the $M_S=0$ sector by \ncomputing the lowest energy states in different $M_S$ sectors. Hence, we have computed the lowest energy states of these \nsystems in different sectors and obtained the energy gaps ($\\Delta_k$) defined as $\\Delta_k=E_0(M_S=k)-E_0(M_S=0)$, where \nthe energy $E_0(M_S=k)$ is the lowest energy in the $M_S=k$ sector. If  $\\Delta_1\\neq 0$, we can conclude that the state \nis a singlet. This is because, if the lowest energy state with $M_S=0$ is nondegenerate and the corresponding energy \neigenvalue does not appear in the lowest state with $M_S=1,$ then the spin degeneracy of the state is 1 or the state is \na singlet. In general if $\\Delta_1=\\Delta_2=\\cdot\\cdot\\cdot=\\Delta_p=0$ and $\\Delta_{p+1}>0$, we can conclude that the \nground state has spin $S=p$. This is because the $S=p$ state will have a presence in the $M_S=0,1,2,...,p$ sectors with \nthe same energy. Fig. \\ref{spingap_ribbons}(a) shows the spin gaps as a function of the inverse of number of naphthalene \nunits (N) for zigzag fused naphthalene. For less than 14 units ($N<14$), we find a finite spin gap between $M_S=1$ and $M_S=0$ \nstates which indicates that the ground state is a singlet. For $N\\geq14$, $M_S=1$ and $M_S=0$ states are degenerate \n(within the DMRG accuracy) which implies that S=1 is the spin of the ground state, as the gap between $M_S=2$ and $M_S=0$ is\nstill finite. However, the gap between $M_S=2$ and $M_S=0$ states becomes smaller as N is further increased. It appears that \nS=2 will become the spin of the ground state for larger N values. Similarly, the gap between $M_S=3$ and $M_S=0$ states also \nreduces with increasing N. From this behavior of the spin gap, we predict that the ground state of this system is a magnetic \nstate in the thermodynamic limit. This is consistent with the earlier studies which reveal ferromagnetic arrangement of spins \nat the edge sites of zigzag nanoribbon \\cite{fujita,son,datta2}.\n\n\\begin{figure}[tbp]\n\\begin{center}\n\\includegraphics[width=8.5cm]{huckel.eps}\n\\caption{\\label{huckel} A few energy levels near the Fermi level for (a) zigzag fused naphthalene, (b) armchair fused naphthalene and \n(c) polyperylene within the tight-binding model are plotted as a function of number of unit cells. The hopping energy \nconsidered is 2.40 eV. The symbol index is same for all the three panels and are as follows: HOMO energy level (solid circle); \nHOMO--1 energy level (solid square); HOMO--2 energy level (solid triangle up); LUMO energy level (open circle); LUMO+1 energy \nlevel (open square) and LUMO+2 energy level (open triangle up).}\n\\end{center}\n\\end{figure}\n\nThe spin gaps for armchair fused naphthalene are shown in Fig. \\ref{spingap_ribbons}(b). In the thermodynamic limit, the spin gap \n($\\Delta_1$) between $M_S=1$ and $M_S=0$ states is non-zero and it has a weak size dependence. The extrapolated value of spin gap \n($\\Delta_1$) in the thermodynamic limit is 1.43 eV which is slightly higher than the spin gap in the non-interacting picture of 1.19 eV.\nThis implies that the ground state of this system is a singlet. Indeed the spin gap is large compared to polyacene which has a spin gap of \n$\\sim$0.5 eV in the thermodynamic limit. The spin gaps between the lowest energy levels in $M_S=2$ and $M_S=3$ sectors and the lowest level \nin $M_S=0$ sector are also large. The lowest energy levels in the $M_S=2$ and $M_S=3$ sectors always lie above the lowest energy level in \n$M_S=1$ sector with increasing number of naphthalene units. This shows that the excitations are of progressively higher energies \nwith increasing spin. \n\nFor polyperylene, the spin gaps between different $M_S$ sectors and $M_S=0$ are shown in Fig. \\ref{spingap_ribbons}(c).\nIn the thermodynamic limit, the spin gap ($\\Delta_1$) between the lowest states of $M_S=1$ and $M_S=0$ sectors extrapolates \nto 0.15 eV. The spin gap is unusually small and the behavior of $\\Delta_2$ and $\\Delta_3$ seems to imply that they come close \nto $\\Delta_1$. Thus, it appears that in this system even though the ground state is a singlet, the lowest excited spin state may have \na higher spin ($S>1$). \n\nWithin the non-interacting one-band tight-binding model, we have computed a few energy levels above and below \nthe Fermi level for systems up to 50 units of zigzag and armchair fused naphthalenes and polyperylene. \nIn the zigzag fused naphthalene and polyperylene systems, the highest occupied molecular orbital (HOMO) and lowest unoccupied molecular \norbital (LUMO) energy levels are nearly degenerate at the Fermi level (Figs. \\ref{huckel}(a) and \\ref{huckel}(c)). Hence, both the systems \nare metallic in the non-interacting picture. Interaction can lead to both insulating behavior and flat-band magnetism in these systems. \nIn armchair fused naphthalene system, the HOMO and LUMO energy levels are well separated at the Fermi level (Fig. \\ref{huckel}(b)). \nHence, this system is not a candidate for exhibiting flat-band magnetism. \n\n\\begin{figure}[tbp]\n\\begin{center} \n\\includegraphics[width=8.5cm]{zigzag.eps}\n\\caption{\\label{zigzag_opg} (Color online) Lowest two-photon and optical gaps in zigzag fused naphthalene systems are plotted as a function of \nthe inverse of number of unit cells as shown in Fig. \\ref{strucr}.  As the ground state spin value changes on increasing the number of \nmonomer units, lowest two-photon gaps and lowest optical gaps in both $S=0$ and $S=1$ sectors are plotted. Symbols represent the\nfollowing: lowest two-photon gap in singlet space ($\\square$); lowest optical gap in singlet space ({\\color{Red}$\\mathbf{\\vartriangle}$}); \nlowest two-photon gap in triplet space ({\\color{ForestGreen}$\\blacksquare$}); lowest optical gap in triplet space ({\\color{Blue}$\\blacktriangle$}). \nInset: Magnified plot of the lowest optical gaps and its extrapolation in zigzag fused naphthalenes, 11-16 monomer units.}\n\\end{center} \n\\end{figure}\n\n\\subsection*{Lowest two-photon gap and optical gap}\n\n\\begin{figure}[btp]\n\\begin{center} \n\\includegraphics[width=8.5cm,height=7.5cm]{tpg_opg.eps}\n\\caption{\\label{tpg_opg} (Color online) Lowest two-photon and optical gaps in (a) armchair fused naphthalene and (b) polyperylene \nare plotted as a function of the inverse of number of unit cells as outlined in Fig. \\ref{strucr}. The ground state remains \nin both the cases in $S=0$ space. Color indices are same in both the figures and are as follows: lowest \ntwo-photon gap ($\\square$); lowest optical gap ({\\color{Red}$\\vartriangle$}). The extrapolated values of the two-\nphoton gaps and optical gaps are also indicated in the figures.}\n\\end{center} \n\\end{figure}\n\nWe have obtained the low-lying excited states, namely, the one-photon and two-photon states for the above mentioned \nnanoribbons within the PPP model. We have done calculations starting from 2 units up to a maximum of 16 units of zigzag \nfused naphthalene, from 2 units up to a maximum of 8 units of armchair fused naphthalene (with an addition of 2 naphthalene \nrings per cycle) and from 1 unit up to 9 units of polyperylene, which is about 100 carbon atoms in all largest systems studied. \nFor zigzag fused naphthalene systems, with size up to three units, lowest two-photon state lies above the lowest optical state, \nbut falls below for larger system sizes (Fig. \\ref{zigzag_opg}). As already pointed out that the spin of the ground state changes \nbeyond a certain size of the nanoribbon, we have plotted in Fig. \\ref{zigzag_opg}, the lowest two-photon gaps and lowest optical \ngaps corresponding for both $S=0$ and $S=1$ ground states. In the thermodynamic limit, the two-photon gaps in both singlet and \ntriplet spaces extrapolate to zero, small deviation in Fig. \\ref{zigzag_opg} corresponding to DMRG and finite size extrapolation \nerror. The extrapolated value of the optical gap in thermodynamic limit is found to be 2.25 eV, irrespective of the ground state \nspin. For systems with triplet ground state, the singlet optical gap increases with system size. In armchair fused naphthalene, \nthe lowest optical state always remains below the lowest two-photon state for all system sizes. Although the separation is very\nsmall in some systems studied, the extrapolated value at the thermodynamic limit are quite distinct (Fig \\ref{tpg_opg}a).\nThe extrapolated value of the two-photon gap is $2.72$ eV while that of the optical gap is $2.45$ eV. In case of polyperylene, \nthe optical state always remains above the lowest two-photon state, although the lowest two-photon gap does not vanish at the \nthermodynamic limit (Fig \\ref{tpg_opg}b) but saturates at a value of $0.60$ eV. The optical gap in polyperylene, on the other hand,\nextrapolates to 1.33 eV at the thermodynamic limit. The position of the optical state in armchair fused naphthalene below the \ntwo-photon state can make the system fluorescent in the thermodynamic limit. \n\n\\subsection*{Charge gap}\n\n\\begin{figure}[tbp]\n\\begin{center} \n\\includegraphics[width=8.5cm,height=7.5cm]{chargegap_1.eps}\n\\caption{\\label{chrgegap} Extrapolation of the charge gaps as a function of 1/N for \n(a) zigzag and (b) armchair fused naphthalene systems and (c) polyperylene within the PPP model\nwhere N is the total number of unit cells as depicted in Fig. \\ref{strucr}.} \n\\end{center} \n\\end{figure}\n\n\\begin{figure}[b]\n\\begin{center} \n\\includegraphics[width=7.5cm]{bndindx.eps}\n\\caption{\\label{bndindx} Bond index of interior bonds for (a) zigzag and (b) armchair fused naphthalenes \nand (c) polyperylene systems.} \n\\end{center} \n\\end{figure}\n\n\\begin{table*}[t]\n\\begin{center}\n\\caption{\\label{tab_bndord1} Bond orders of an interior unit of zigzag fused naphthalene. Bond orders in systems with $\\le 13$ \nmonomer units are given in the first row while that for systems with $>13$ monomer units are given in the second row.} \n\\begin{ruledtabular}\n\\begin{tabular}{cccccccccccc} \nState      &  1   &  2   &   3  &   4  &  5   &  6   &  7   &  8   &  9   &  10  &  11   \\\\ \n\\colrule\nGround state & 0.54 & 0.56 & 0.47 & 0.47 & 0.52 & 0.52 & 0.52 & 0.47 & 0.47 & 0.56 & 0.54  \\\\\n             & 0.56 & 0.54 & 0.47 & 0.47 & 0.52 & 0.53 & 0.52 & 0.47 & 0.47 & 0.54 & 0.56  \\\\ \n\\colrule\nOptical state & 0.54 & 0.57 & 0.46 & 0.46 & 0.54 & 0.50 & 0.54 & 0.46 & 0.46 & 0.57 & 0.54  \\\\\n              & 0.56 & 0.54 & 0.46 & 0.46 & 0.51 & 0.54 & 0.51 & 0.46 & 0.46 & 0.54 & 0.56   \\\\ \n\\colrule\nTwo-photon state & 0.52 & 0.58 & 0.48 & 0.47 & 0.50 & 0.54 & 0.50 & 0.47 & 0.48 & 0.58 & 0.52  \\\\\n                 & 0.54 & 0.56 & 0.47 & 0.47 & 0.51 & 0.52 & 0.51 & 0.47 & 0.47 & 0.56 & 0.55   \\\\ \n\\colrule\nSpin state & 0.56 & 0.53 & 0.47 & 0.47 & 0.52 & 0.53 & 0.52 & 0.47 & 0.47 & 0.53 & 0.57  \\\\\n           & 0.54 & 0.55 & 0.47 & 0.47 & 0.53 & 0.52 & 0.53 & 0.47 & 0.47 & 0.55 & 0.54  \\\\ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table*}[tbp]\n\\begin{center}\n\\caption{\\label{tab_bndord2} Bond orders of an interior unit of armchair fused naphthalene.}\n\\begin{ruledtabular}\n\\begin{tabular}{cccccccccccccc}\nState      &  1   &  2   &   3  &   4  &  5   &  6   &  7   &  8   &  9   &  10  &  11  &  12  &  13  \\\\ \n\\colrule\nGround state & 0.58 & 0.59 & 0.37 & 0.57 & 0.56 & 0.44 & 0.45 & 0.51 & 0.57 & 0.56 & 0.58 & 0.58 & 0.66 \\\\\n\\colrule\nOptical state & 0.49 & 0.50 & 0.48 & 0.53 & 0.50 & 0.48 & 0.50 & 0.51 & 0.53 & 0.50 & 0.49 & 0.50 & 0.72 \\\\\n\\colrule\nTwo-photon state & 0.57 & 0.57 & 0.38 & 0.54 & 0.54 & 0.47 & 0.47 & 0.50 & 0.55 & 0.54 & 0.56 & 0.58 & 0.65 \\\\ \n\\colrule\nTriplet state & 0.48 & 0.48 & 0.50 & 0.52 & 0.48 & 0.48 & 0.51 & 0.51 & 0.52 & 0.48 & 0.47 & 0.48 & 0.73 \\\\ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table*}[!]\n\\begin{center}\n\\caption{\\label{tab_bndord3} Bond orders of an interior unit of fused perylene.}\n\\begin{ruledtabular}\n\\begin{tabular}{cccccccccccccc} \nState      &  1   &  2   &   3  &   4  &  5   &  6   &  7   &  8   &  9   &  10  &  11  &  12  &  13  \\\\ \n\\colrule\nGround state & 0.60 & 0.39 & 0.60 & 0.63 & 0.51 & 0.51 & 0.52 & 0.51 & 0.51 & 0.61 & 0.39 & 0.60 & 0.63 \\\\\n\\colrule\nOptical state & 0.57 & 0.42 & 0.57 & 0.67 & 0.51 & 0.51 & 0.51 & 0.51 & 0.52 & 0.57 & 0.42 & 0.57 & 0.67 \\\\\n\\colrule\nTwo-photon state & 0.50 & 0.48 & 0.51 & 0.72 & 0.52 & 0.52 & 0.49 & 0.52 & 0.52 & 0.51 & 0.48 & 0.50 & 0.71 \\\\ \n\\colrule\nTriplet state & 0.52 & 0.47 & 0.51 & 0.72 & 0.52 & 0.52 & 0.50 & 0.52 & 0.52 & 0.52 & 0.47 & 0.51 & 0.72 \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{center}\n\\end{table*}\n\nWe have calculated the charge gaps in these systems to explore the conducting nature in the \nthermodynamic limit, in the presence of long-range interactions (Fig. \\ref{chrgegap}). \nThe charge gap ($\\Delta_c$) is defined as the energy required to create a well separated \nelectron-hole pair from the ground state of the system:  $\\Delta_c (N) =E^+(N)+E^-(N)-2E^0(N)$, \nwhere $E^+$ and $E^-$ are the ground state energies of the cation and anion respectively and \n$E^0$ is the ground state energy of the neutral system and $N$ is the system size. \nIn the thermodynamic limit, the charge gaps of zigzag and armchair fused naphthalenes and polyperylene \nsystems extrapolate to 3.09 eV, 3.58 eV and 2.46 eV. This clearly shows that interactions lead to \nsemiconducting behavior in these systems. Interestingly, the exciton binding energy ($E_{xb}$) of \nthe optical state ($E_{1ph}$) which is measured as $E_{xb}=E_{cg}-E_{1ph}$ is quite small in \nall the three systems compared to other known organic conjugated systems. The exciton binding energies \nare 0.84 eV in zigzag fused naphthalene, 1.13 eV in armchair fused naphthalene and 1.13 eV in polyperylene \nnanoribbon. Hence, these conjugated systems can have importance in molecular photovoltaics as the \nelectron-hole pair can be relatively easily disassociated.\n\n\\subsection*{Bond order}\n\nWe have calculated bond orders for the ground state and a few low-lying excited states\nof the largest systems we studied. Bond order ($p_{ij}$) for the $<i,j>$ bond is defined as  \n$(-\\frac{1}{2}) \\sum_{\\sigma}(a_{i\\sigma}^\\dagger a_{j\\sigma}+h.c.)$, and their deviation \nfrom an average value shows propensity for the bond to distort. If the bond order is more (less) \nthan the average, we expect the bond to shorten (lengthen) at equilibrium geometry. \nThe numbering of bonds of the interior zigzag and armchair fused naphthalenes and perylene units \nis shown in Fig. \\ref{bndindx}. The bond orders towards the ends of the ribbons are \nnormally different from the bond orders in the interior part because of edge effects. \nIn Table \\ref{tab_bndord1}, the bond orders of the interior unit of zigzag fused naphthalene \nare given. In zigzag fused naphthalene series, we have given bond orders for two systems, \none with 13 monomer units, which has a singlet ground state and another one with 16 monomer units \nwith triplet ground state. In both systems, the bond order difference between edge bonds in the ground \nstate are small, implying almost uniform geometry of the edges. The rung bond orders are bit smaller \nthan the edge bonds, implying longer rung bonds than edge bonds at equilibrium geometry. The ground state,\noptical state and the lowest spin state all have similar geometries. The bond orders in the singlet and\ntriplet two-photon states are similar away from middle of the ribbon. However, in the middle of the ribbon,\nthe triplet two-photon state has marked single and double bond character in the top and bottom edge bonds\n(bonds 1, 2, 10, 11).\n\nThe bond orders in fused armchair naphthalene show somewhat different behavior. In the ground state, bonds on \nthe ring and on the exterior of the edge (bond 13) show propensity to contract, while bond 3 on the edge which \nis on the interior shows a tendency to expand. There appears to be a period of four distortion of the edges \ntypified by {short-short-short-long} on one edge and out of phase by two bonds on the opposite edge. \nIn two-photon state, the bond orders remain almost same as those in the ground state, only the \noverall structure gets a little weaker. In one-photon state, there is considerable deviation in the \nbond orders at the middle part of the nanoribbon, but the effect reduces on moving towards the \nends. However in the triplet state it appears that this distortion is much more pronounced. Thus, \nthe equilibrium geometries of the excited states are quite different from that in the ground state \nand we may expect larger Stokes shifts in the spectra of the armchair fused naphthalene compared to the \nzigzag fused naphthalene. \n\nThe bond orders on the edges of polyperylene are similar to the bond orders in the \narmchair fused naphthalene. Except for the bonds which have rather large and small bond order values, \nall other bonds have nearly the same bond orders. So the distortion is expected more on the edges than \nthe interior. In all excited states, the interior bonds remain almost unperturbed. The edge bond \nstructure at the middle part of the nanoribbon shifts from short-long-short-short type to \nlong-long-long-short type structure, while being unchanged towards the ends of the nanoribbon. \nThe extent of distortion at the middle part is highest in the two-photon and triplet states as compared \nto one-photon state.\n\n\\section{Conclusion}\n\nWe have studied correlated electronic properties of zigzag and armchair fused naphthalenes \nand of polyperylene systems in the presence of long-range electron-electron interactions. \nWe have studied the ground state, the lowest triplet state, the lowest one-photon and two-photon\nstates in members of each series and extrapolated their nature to the thermodynamic limit. The spin gap \nstudies show that the zigzag fused naphthalene, in the thermodynamic limit will have a high spin ground \nstate. The ground state of armchair fused naphthalene is a singlet and variation in the spin gap of \nthis system is independent of the system size. In polyperylene, the spin gap is small in the \nthermodynamic limit. \n\nWe have also computed optical and two-photon gaps of these systems. In the case of zigzag fused naphthalene, \nthe two-photon gap is very small while in armchair fused naphthalene, the two-photon and one-photon gaps \nare comparable. In armchair fused naphthalene in the thermodynamic limit the two-photon state is above the \none-photon state and we expect the system to be fluorescent. Bond order studies of these systems have \nshown that armchair fused naphthalene and polyperylene systems are likely to show Peierls type of instability \nalong the edges, with a periodicity of four bonds. It has also revealed that there is considerable change in \nthe excited state molecular structure from the ground state, though the variation is highest at the middle \npart of the ribbon. We have also calculated charge gaps of these systems where all three systems show \nsimilar charge gaps in the thermodynamic limit. \n\n\\begin{acknowledgements}\n\nWe acknowledge Indo-US Science and Technology Forum for financial assistance through a Joint Center. SR thanks \nDST for providing additional financial assistance. SM acknowledges partial support from NSF grant DMR-1151475 \nand the UA-REN Faculty Exploratory Research Grant. SP acknowledges CSIR India for senior research fellowship. \n\n\\end{acknowledgements}\n\n\\bibliography{manuscript}\n\n\n", "itemtype": "equation", "pos": 11265, "prevtext": "\n\n\\noindent\nwhere $<i,j>$ indicates the bonded pair of atoms i and j, $t_{ij}$ represents the hopping or transfer \nintegral between bonded pair i and j, $a_{i\\sigma}^\\dagger$ ($a_{i\\sigma}$) is the creation (annihilation) \noperator at site i with spin $\\sigma$ and $n_i$ is the number operator. U is the Hubbard on-site repulsion \nparameter and $V_{ij}$ is the intersite electron-electron repulsion between sites i and j. $V_{ij}$-s are \nparameterized using the Ohno parametrization \\cite{ohno,*klopman}, \n\n\n", "index": 3, "text": "\\begin{equation} \nV_{ij}=U_i \\Big(1.0+0.6117~r_{ij}^2 \\Big)^{-1/2} \n\\label{eqohno}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"V_{ij}=U_{i}\\Big{(}1.0+0.6117~{}r_{ij}^{2}\\Big{)}^{-1/2}\" display=\"block\"><mrow><msub><mi>V</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><msub><mi>U</mi><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mrow><mn>1.0</mn><mo>+</mo><mrow><mpadded width=\"+3.3pt\"><mn>0.6117</mn></mpadded><mo>⁢</mo><msubsup><mi>r</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mn>2</mn></msubsup></mrow></mrow><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow></math>", "type": "latex"}]