[{"file": "1601.05375.tex", "nexttext": "\n\nThe procedure outlined above  -- Laurent expansion plus choice of integration measure -- specifies our contributions, but with one exception: due to the divergent nature of phase-space integrals, one-loop amplitudes within the real-virtual contribution are, in principle, multiplied with inverse powers of $\\epsilon$ which, in turn, results in the need to calculate the amplitude to order $\\mathcal{O}(\\epsilon^2)$, i.e. beyond its finite part. A similar problem occurs also in the double-virtual part, where we have to include the square of the one-loop amplitude. In the original calculation of the total cross-section \\cite{Czakon:2013goa}, the contribution proportional to the $\\mathcal{O}(\\epsilon^2)$ part of the one-loop two-to-two amplitude was shifted from the real-virtual contribution to the double-virtual contribution. In the software used to obtain the results of the present publication we shifted there also the terms proportional to $\\mathcal{O}(\\epsilon)$, including those contained in the collinear renormalisation. This allowed us to check explicitly that they cancel from the calculation as first demonstrated in Ref.~\\cite{Weinzierl:2011uz}.\n\nLet us now specify the details of the setup, which is a straightforward extension of Refs.~\\cite{Czakon:2013goa,Czakon:2012pz,Czakon:2012zr,Baernreuther:2012ws}. The two-loop virtual corrections are evaluated as in Refs.~\\cite{Czakon:2008zk,Baernreuther:2013caa}, utilising the analytical form for the poles \\cite{Ferroglia:2009ii}. We evaluate the one-loop squared amplitude afresh although it has been calculated previously \\cite{Anastasiou:2008vd}. The finite part of the one-loop two-to-three amplitude is computed with a code used in the calculation of $pp \\to t{\\bar t} j$ at NLO \\cite{Dittmaier:2007wz}. The main problem we face is the ``de-symmetrisation'' of the contributions, since flavour and parity symmetries were used for the calculation of the total cross-section, while they do not apply here. A second issue is the inclusion of collinear renormalisation contributions at the differential level, which were not needed previously \\footnote{For total cross-sections, one could simply perform convolutions with analytically known total cross-sections at LO and NLO.}. Due to the use of CDR, finite collinear renormalisation contributions are present even in the case of equal renormalisation and factorisation scales, because both the phase space and the matrix elements have a non-trivial expansion in $\\epsilon$. With the complete software we have verified explicitly the numerical cancellation of all poles at the level of distributions. Of course, we also observe complete agreement for the total cross-section computed with the program \\textsc{Top++} \\cite{Czakon:2011xx}. \n\nA final check on our setup comes from a comparison of the top-pair transverse momentum distribution with results obtained independently (see Ref.~\\cite{Czakon:2014xsa} for details). Indeed, once the top-quark pair has non-vanishing transverse momentum, the cross-section does not exhibit NNLO infrared singularities anymore, but rather only NLO ones. Thus, for non-zero values of the pair transverse momentum it is possible to obtain the ${p_{T,t\\bar t}}$ distribution from a NLO calculation of top-quark pair production in association with an additional jet.\n\n\n\n\\section{Differential distributions}\\label{sec:dif-dist}\n\n\\subsection{General comments}\\label{sec:diff-general}\n\n\nIn this section we present NNLO predictions for the $t\\bar t$ invariant mass ${m_{t\\bar t}}$, the transverse momentum ${p_{T,t}}$ of the top quark and the absolute rapidity ${\\vert y_t\\vert}$ of the top quark, and we compare with existing D\\O\\ measurements \\cite{Abazov:2014vga}. We also present the top-quark differential distribution in $\\cos\\theta$ (defined in sec.~\\ref{sec:costheta} below), together with the related Legendre moments, and compare the NNLO QCD predictions with measurements of the CDF Collaboration~\\cite{CDF:2013gna}. \n\nOur calculation is performed with stable top quarks and, apart from explicit binning, no kinematic cuts are imposed. These parton-level results are then compared to experimental measurements that have been unfolded to the level of top quarks. \n\nThe calculation is performed with fixed (i.e. non-running) scales $\\mu_{F,R}=m_t$. Such a scale choice is likely sufficiently appropriate for the limited kinematic range considered by us in this work. The error due to missing higher order effects is estimated from independent variation of the factorisation and renormalisation scales $\\mu_R\\neq\\mu_F\\in (m_t/2,2m_t)$, subject to the restriction $0.5\\leq \\mu_R/\\mu_F\\leq 2$ \\cite{Cacciari:2008zb}, a procedure that has been validated with the NNLO inclusive $t{\\bar t}$ cross-section \\cite{Czakon:2013goa,Czakon:2012pz,Czakon:2012zr,Baernreuther:2012ws}.\n\nWhere applicable we present both absolute and normalised differential distributions. The normalised distributions are defined in such a way that their integral is unity for any value of the $\\mu_{F,R}$ and for any pdf. Scale variation for all differential distributions, irrespective of their normalisation, is performed separately in each bin. As expected, once normalised, differential distributions exhibit much smaller scale variation. It is worth noting that normalised differential distributions have different sensitivity to the value of $m_t$ compared to the ones with absolute normalisation. This different $m_t$-dependence would be relevant, for example, for extracting $m_t$ from differential distributions.\n\nThroughout the paper we use $m_t=173.3{\\, \\rm GeV}$ and, unless explicitly noted, we use the MSTW2008 (68\\% cl) \\cite{Martin:2009iq} pdf set. We always convolute partonic cross-sections with pdf's of matching accuracy (i.e. LO with LO, NLO with NLO, etc). Unless explicitly indicated, no electroweak (EW) corrections are included. \n  \nAt NLO the pdf error is derived as usual, i.e. using the prescription for computing pdf uncertainty specific to each of the four pdf sets we use in this paper (specified below). Due to the large computational cost at NNLO, however, we do not compute the NNLO pdf error directly but follow a different strategy for its estimation. \n\nAs a first handle on the pdf dependence in NNLO QCD we compare predictions derived with the central members of four different pdf sets: {\\tt MSTW2008nnlo68cl}, {\\tt CT10nnlo} \\cite{Gao:2013xoa}, {\\tt NNPDF23\\_nnlo\\_FFN\\_NF5\\_as\\_0118} \\cite{Ball:2012cx} and {\\tt HERAPDF15NNLO\\_EIG} \\cite{CooperSarkar:2011aa}. The results of this comparison can be found in sec.~\\ref{sec:pdf}. Second, for the MSTW2008 pdf set only, we derive an approximate pdf error with the help of the following procedure:\n\n\\footnote{We are grateful to Juan Rojo for bringing this procedure to our attention.}\n\ndenoting by $d\\sigma_p$ any differential partonic cross-section at order $p={\\rm LO,NLO,NNLO}$ and by $f\\!\\! f_{p}^{(i)}$ the order-$p$ partonic fluxes constructed from a pdf member $i,~i\\geq 0$, we {\\it assume} that the ratio:\n\n\n", "itemtype": "equation", "pos": 10161, "prevtext": " \n\\maketitle\n\\flushbottom\n\n\n\\section{Introduction}\n\nTop-quark pair production is one of the cornerstones of the Tevatron physics program. Despite the relatively limited statistics for top events at Tevatron energies, both the CDF and D\\O\\ collaborations have presented a number of measurements of differential distributions \\cite{Aaltonen:2009iz,CDF:2013gna,CDF:public,Abazov:2010js,Abazov:2014vga,D0:public} and differential top-quark forward-backward asymmetry (${\\rm A_{FB}}$) \\cite{Aaltonen:2012it,CDF:NoteAFBslope,Abazov:2014cca}.\n\nBeing a $p\\bar p$ collider, the Tevatron produces top-quark pairs from initial states consisting predominantly of a light quark-antiquark pair. As a result, top-quark pair production at the Tevatron offers direct access to quark parton distribution functions (pdf) and is an order of magnitude more sensitive to charge asymmetries than the LHC. These two considerations are among the main motivation for the current work. \n\nThe current paper extends our previous work \\cite{Czakon:2014xsa} on top-quark ${\\rm A_{FB}}$ by presenting a detailed study of next-to-next-to leading order (NNLO) QCD corrections to differential ${\\rm A_{FB}}$ and related differential distributions in the following variables: $t\\bar t$ rapidity difference ${\\Delta y} \\equiv y_t - y_{\\bar t}$, ${\\Delta y}$ and ${m_{t\\bar t}}$ as well as ${\\Delta y}$ and $t\\bar t$ transverse momentum ${p_{T,t\\bar t}}$. We also present NNLO QCD corrections to the slopes of ${\\rm A_{FB}}$ in the variables ${\\Delta y}$ and ${m_{t\\bar t}}$, as well as to the lowest few Legendre moments that have been measured by CDF \\cite{CDF:2013gna,CDF:public} in the context of ${\\rm A_{FB}}$. We study the ${p_{T,t\\bar t}}$ cumulative asymmetry which, as already indicated in Ref.~\\cite{Czakon:2014xsa}, allows one to better understand the origin of higher-order QCD corrections to ${\\rm A_{FB}}$. Finally, we present the NNLO QCD prediction for the cumulative ${m_{t\\bar t}}$ asymmetry and discuss it in the context of recent predictions \\cite{Wang:2015lna} based on the Principle of Maximum Conformality  (PMC) \\cite{Brodsky:2011ta}.\n\nWe further extend the scope of the current study by presenting NNLO QCD predictions for all major differential distributions for stable top-quark pairs. Specifically, we show predictions for the following one-dimensional differential distributions measured by the D\\O\\ Collaboration~\\cite{Abazov:2014vga}: $t\\bar t$ invariant mass ${m_{t\\bar t}}$, transverse momentum ${p_{T,t}}$ of the top quark (or antiquark) and absolute rapidity ${\\vert y_t\\vert}$ of the top quark (or antiquark). We also present the top-quark differential distribution in $\\cos\\theta$ (defined in sec.~\\ref{sec:costheta} below), together with the related Legendre moments, and compare the NNLO QCD predictions with measurements of the CDF Collaboration~\\cite{CDF:2013gna}. Comparisons at the differential level will be helpful in better understanding Standard Model (SM) top-quark production at hadron colliders and will be useful in, for example, further improving top-quark mass extraction at the Tevatron. We compare the main NNLO kinematic distributions with approximate NNLO predictions that have been used in the past.\n\nAlthough NNLO theoretical predictions for distributions of top-quark decay products are preferred, such a calculation is beyond the scope of the present work given the significant additional effort its implementation would require (despite the fact that differential NNLO top decay is known \\cite{Gao:2012ja,Brucherseifer:2013iv}). We are planning to undertake such a calculation in the future.\n\nFinally, we utilise a number of parton distribution sets to study the effect of different pdf's on the predicted differential cross-sections. \n\nThe paper is organised as follows. In sec.~\\ref{sec:calc} we discuss the calculation from technical perspective. In sec.~\\ref{sec:dif-dist} we present and discuss the NNLO QCD corrections for the ${m_{t\\bar t}},\\, {p_{T,t}}$ and ${\\vert y_t\\vert}$ differential distributions. Sec.~\\ref{sec:AFB} is devoted to the top-quark forward-backward asymmetry. In sec.~\\ref{sec:pdf} we compare differential distributions based on four pdf sets. A summary of our findings can be found in the last section. All predictions can be found in tables in the appendix.\n\n\n\n\\section{Details of the calculation}\\label{sec:calc}\n\n\nNLO corrections to top-quark pair production can nowadays be obtained in a multitude of complete Monte-Carlo frameworks (\\textsc{Mcfm} \\cite{Campbell:2010ff}, \\textsc{Powheg} \\cite{Alioli:2010xd}, \\textsc{aMC@Nlo} \\cite{Alwall:2014hca}, \\textsc{Sherpa}\n\\cite{Gleisberg:2008ta}, \\textsc{Helac-Nlo} \\cite{Bevilacqua:2011xh}), including also the associated production with jets, vector bosons and Higgs. The most advanced calculations at this level of perturbation theory allow for a realistic modelling of the final state. In particular they involve the complete top-quark off-shell effects \\cite{Denner:2010jp,Bevilacqua:2010qb,Denner:2012yc,Frederix:2013gra,Cascioli:2013wga,Heinrich:2013qaa}. We should also mention the most recent calculations of this type, where off-shell effects could even be included in associated production \\cite{Denner:2015yca,Bevilacqua:2015qha}. As far as NNLO corrections are concerned, it should be possible to work in the Narrow Width Approximation as done at NLO in \\cite{Bernreuther:2010ny,Melnikov:2009dn,Campbell:2012uf,Campbell:2014kua}. For now, however, our results are for stable top quarks.\n\nSince our calculation is of NNLO precision, we point out that there has been tremendous progress in this field and many new results appeared \\cite{GehrmannDeRidder:2008ug,GehrmannDeRidder:2007hr,Weinzierl:2008iv,Weinzierl:2009ms,DelDuca:2015zqa,Catani:2007vq,Grazzini:2008tf,Catani:2009sm,Ferrera:2011bk,Catani:2011qz,Grazzini:2013bna,Grazzini:2015nwa,Cascioli:2014yka,Gehrmann:2014fva,Grazzini:2015hta,Boughezal:2015dva,Boughezal:2015aha,Boughezal:2015ded,Campbell:2016jau,Ridder:2013mf,Currie:2013dwa,Chen:2014gva,Ridder:2015dxa,Boughezal:2011jf,Brucherseifer:2013iv,Brucherseifer:2013cu,Boughezal:2013uia,Boughezal:2015dra,Caola:2014daa,Brucherseifer:2014ama,Caola:2015wna}. This has been possible thanks to the development of subtraction schemes \\cite{GehrmannDeRidder:2005cm,Somogyi:2006da,Somogyi:2006db,Somogyi:2008fc,Bolzoni:2010bt,Somogyi:2013yk,Czakon:2010td,Czakon:2011ve,Czakon:2014oma}, slicing methods \\cite{Catani:2007vq,Gaunt:2015pea,Boughezal:2015dva} and the calculation of several two-to-two virtual amplitudes \\cite{Anastasiou:2000kg,Anastasiou:2000ue,Anastasiou:2001sv,Glover:2001af,Bern:2002tk,Bern:2003ck,Czakon:2008zk,Baernreuther:2013caa,Bonciani:2008az,Bonciani:2009nb,Bonciani:2010mn,Bonciani:2013ywa,Gehrmann:2013cxs,Gehrmann:2014bfa,Henn:2014lfa,Caola:2014lpa,Papadopoulos:2014hla,Caola:2014iua,Gehrmann:2015ora,vonManteuffel:2015msa}. As far as top-quark pair production is concerned, besides our own calculation \\cite{Czakon:2014xsa,Czakon:2015owf} only partial results are known at the differential level \\cite{Abelof:2015lna,Abelof:2014fza}; there is also progress at the level of total cross-section \\cite{Bonciani:2015sha} obtained with slicing methods. \n\nWe next describe our tools and methods in more detail.\nIn principle, cross-section contributions in fixed-order perturbation theory can be classified according to the number of additional real emissions with respect to the Born configuration. This is equivalent to the number of virtual loops in the involved amplitudes. At NNLO we would have, according to this classification, three contributions: double-virtual, real-virtual and double-real. Due to the presence of initial state collinear singularities, we must add to this list also the collinear renormalisation contributions, which allow to obtain a finite partonic cross-section. These may be viewed as either convolutions of leading-order splitting functions with the NLO cross-section, or as convolutions of splitting functions (double for leading order, and single for NLO splitting functions) with the Born contribution. \n\nIn order to efficiently deal with infrared singularities, however, this simple picture with a total of five contributions usually needs to be modified. In consequence, a calculation is ultimately organised according to a subtraction scheme, which modifies each one of the five contributions. Our calculation is performed within the framework of the sector-improved residue subtraction scheme \\textsc{Stripper} \\cite{Czakon:2010td,Czakon:2011ve,Czakon:2014oma}. The results of this work, as well as of our previous Tevatron ${\\rm A_{FB}}$ paper \\cite{Czakon:2014xsa}, have been obtained with the original methods described in more detail in Refs.~\\cite{Czakon:2010td,Czakon:2011ve}\n\n\\footnote{A subset of the results has been checked using the most recent complete implementation of the four-dimensional formulation of \\textsc{Stripper} \\cite{Czakon:2014oma}.}.\n\nIn the following we describe the original approach as it has been applied in the current work as well as in Ref.~\\cite{Czakon:2014xsa}. In particular some of the results presented in Ref.~\\cite{Czakon:2014xsa} (see Table I and related discussion) concern partial contributions and thus are dependent on the division into double-virtual, real-virtual and double-real parts.\n\nA specific feature of the original formulation of \\textsc{Stripper} was the uniform reliance on conventional dimensional regularisation (CDR). Thus, both real and virtual particles were in principle defined in $d=4-2\\epsilon, \\epsilon \\neq 0$ dimensions. In practice, this implies that the momenta may involve higher dimensions, as is indeed the case in the double-real contribution, where we have to work in five dimensions. Furthermore, the cross-section contributions are not modified (with one exception described below), but rather a Laurent expansion in the regularisation parameter is obtained. In consequence, when we address the value of a particular contribution, we mean the finite part of the Laurent expansion, which depends on the integration measure chosen. For instance, our virtual integrals are defined with the minimal measure\n\n\n", "index": 1, "text": "\\begin{equation}\ne^{\\epsilon \\gamma_{\\text{E}}} \\mu^{2\\epsilon}\\int \\frac{d^{4-2\\epsilon} k}{i \\pi^{2-\\epsilon}} \\; .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"e^{\\epsilon\\gamma_{\\text{E}}}\\mu^{2\\epsilon}\\int\\frac{d^{4-2\\epsilon}k}{i\\pi^{%&#10;2-\\epsilon}}\\;.\" display=\"block\"><mrow><mrow><msup><mi>e</mi><mrow><mi>ϵ</mi><mo>⁢</mo><msub><mi>γ</mi><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\text</mtext></merror><mo>⁢</mo><mi>E</mi></mrow></msub></mrow></msup><mo>⁢</mo><msup><mi>μ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>ϵ</mi></mrow></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><msup><mi>d</mi><mrow><mn>4</mn><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>ϵ</mi></mrow></mrow></msup><mo>⁢</mo><mi>k</mi></mrow><mrow><mi>i</mi><mo>⁢</mo><msup><mi>π</mi><mrow><mn>2</mn><mo>-</mo><mi>ϵ</mi></mrow></msup></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nWe only calculate $d\\sigma_{\\rm NNLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(0)}$ and $d\\sigma_{\\rm NLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)}$ (the latter is simply an NLO cross-section convoluted with NNLO pdf, whose calculation is inexpensive). Thus, we arrive at the following approximation for an NNLO differential distribution with a pdf member $i\\geq 1$:\n\n\n", "itemtype": "equation", "pos": 17322, "prevtext": "\n\nThe procedure outlined above  -- Laurent expansion plus choice of integration measure -- specifies our contributions, but with one exception: due to the divergent nature of phase-space integrals, one-loop amplitudes within the real-virtual contribution are, in principle, multiplied with inverse powers of $\\epsilon$ which, in turn, results in the need to calculate the amplitude to order $\\mathcal{O}(\\epsilon^2)$, i.e. beyond its finite part. A similar problem occurs also in the double-virtual part, where we have to include the square of the one-loop amplitude. In the original calculation of the total cross-section \\cite{Czakon:2013goa}, the contribution proportional to the $\\mathcal{O}(\\epsilon^2)$ part of the one-loop two-to-two amplitude was shifted from the real-virtual contribution to the double-virtual contribution. In the software used to obtain the results of the present publication we shifted there also the terms proportional to $\\mathcal{O}(\\epsilon)$, including those contained in the collinear renormalisation. This allowed us to check explicitly that they cancel from the calculation as first demonstrated in Ref.~\\cite{Weinzierl:2011uz}.\n\nLet us now specify the details of the setup, which is a straightforward extension of Refs.~\\cite{Czakon:2013goa,Czakon:2012pz,Czakon:2012zr,Baernreuther:2012ws}. The two-loop virtual corrections are evaluated as in Refs.~\\cite{Czakon:2008zk,Baernreuther:2013caa}, utilising the analytical form for the poles \\cite{Ferroglia:2009ii}. We evaluate the one-loop squared amplitude afresh although it has been calculated previously \\cite{Anastasiou:2008vd}. The finite part of the one-loop two-to-three amplitude is computed with a code used in the calculation of $pp \\to t{\\bar t} j$ at NLO \\cite{Dittmaier:2007wz}. The main problem we face is the ``de-symmetrisation'' of the contributions, since flavour and parity symmetries were used for the calculation of the total cross-section, while they do not apply here. A second issue is the inclusion of collinear renormalisation contributions at the differential level, which were not needed previously \\footnote{For total cross-sections, one could simply perform convolutions with analytically known total cross-sections at LO and NLO.}. Due to the use of CDR, finite collinear renormalisation contributions are present even in the case of equal renormalisation and factorisation scales, because both the phase space and the matrix elements have a non-trivial expansion in $\\epsilon$. With the complete software we have verified explicitly the numerical cancellation of all poles at the level of distributions. Of course, we also observe complete agreement for the total cross-section computed with the program \\textsc{Top++} \\cite{Czakon:2011xx}. \n\nA final check on our setup comes from a comparison of the top-pair transverse momentum distribution with results obtained independently (see Ref.~\\cite{Czakon:2014xsa} for details). Indeed, once the top-quark pair has non-vanishing transverse momentum, the cross-section does not exhibit NNLO infrared singularities anymore, but rather only NLO ones. Thus, for non-zero values of the pair transverse momentum it is possible to obtain the ${p_{T,t\\bar t}}$ distribution from a NLO calculation of top-quark pair production in association with an additional jet.\n\n\n\n\\section{Differential distributions}\\label{sec:dif-dist}\n\n\\subsection{General comments}\\label{sec:diff-general}\n\n\nIn this section we present NNLO predictions for the $t\\bar t$ invariant mass ${m_{t\\bar t}}$, the transverse momentum ${p_{T,t}}$ of the top quark and the absolute rapidity ${\\vert y_t\\vert}$ of the top quark, and we compare with existing D\\O\\ measurements \\cite{Abazov:2014vga}. We also present the top-quark differential distribution in $\\cos\\theta$ (defined in sec.~\\ref{sec:costheta} below), together with the related Legendre moments, and compare the NNLO QCD predictions with measurements of the CDF Collaboration~\\cite{CDF:2013gna}. \n\nOur calculation is performed with stable top quarks and, apart from explicit binning, no kinematic cuts are imposed. These parton-level results are then compared to experimental measurements that have been unfolded to the level of top quarks. \n\nThe calculation is performed with fixed (i.e. non-running) scales $\\mu_{F,R}=m_t$. Such a scale choice is likely sufficiently appropriate for the limited kinematic range considered by us in this work. The error due to missing higher order effects is estimated from independent variation of the factorisation and renormalisation scales $\\mu_R\\neq\\mu_F\\in (m_t/2,2m_t)$, subject to the restriction $0.5\\leq \\mu_R/\\mu_F\\leq 2$ \\cite{Cacciari:2008zb}, a procedure that has been validated with the NNLO inclusive $t{\\bar t}$ cross-section \\cite{Czakon:2013goa,Czakon:2012pz,Czakon:2012zr,Baernreuther:2012ws}.\n\nWhere applicable we present both absolute and normalised differential distributions. The normalised distributions are defined in such a way that their integral is unity for any value of the $\\mu_{F,R}$ and for any pdf. Scale variation for all differential distributions, irrespective of their normalisation, is performed separately in each bin. As expected, once normalised, differential distributions exhibit much smaller scale variation. It is worth noting that normalised differential distributions have different sensitivity to the value of $m_t$ compared to the ones with absolute normalisation. This different $m_t$-dependence would be relevant, for example, for extracting $m_t$ from differential distributions.\n\nThroughout the paper we use $m_t=173.3{\\, \\rm GeV}$ and, unless explicitly noted, we use the MSTW2008 (68\\% cl) \\cite{Martin:2009iq} pdf set. We always convolute partonic cross-sections with pdf's of matching accuracy (i.e. LO with LO, NLO with NLO, etc). Unless explicitly indicated, no electroweak (EW) corrections are included. \n  \nAt NLO the pdf error is derived as usual, i.e. using the prescription for computing pdf uncertainty specific to each of the four pdf sets we use in this paper (specified below). Due to the large computational cost at NNLO, however, we do not compute the NNLO pdf error directly but follow a different strategy for its estimation. \n\nAs a first handle on the pdf dependence in NNLO QCD we compare predictions derived with the central members of four different pdf sets: {\\tt MSTW2008nnlo68cl}, {\\tt CT10nnlo} \\cite{Gao:2013xoa}, {\\tt NNPDF23\\_nnlo\\_FFN\\_NF5\\_as\\_0118} \\cite{Ball:2012cx} and {\\tt HERAPDF15NNLO\\_EIG} \\cite{CooperSarkar:2011aa}. The results of this comparison can be found in sec.~\\ref{sec:pdf}. Second, for the MSTW2008 pdf set only, we derive an approximate pdf error with the help of the following procedure:\n\n\\footnote{We are grateful to Juan Rojo for bringing this procedure to our attention.}\n\ndenoting by $d\\sigma_p$ any differential partonic cross-section at order $p={\\rm LO,NLO,NNLO}$ and by $f\\!\\! f_{p}^{(i)}$ the order-$p$ partonic fluxes constructed from a pdf member $i,~i\\geq 0$, we {\\it assume} that the ratio:\n\n\n", "index": 3, "text": "\\begin{equation}\n{d\\sigma_{\\rm NNLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)}\\over d\\sigma_{\\rm NLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)}} \\approx {\\rm independent}~{\\rm of}~i, ~ {\\rm for}~ {\\rm all} ~ i\\geq 0\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{d\\sigma_{\\rm NNLO}\\otimes f\\!\\!f_{\\rm NNLO}^{(i)}\\over d\\sigma_{\\rm NLO}%&#10;\\otimes f\\!\\!f_{\\rm NNLO}^{(i)}}\\approx{\\rm independent}~{}{\\rm of}~{}i,~{}{%&#10;\\rm for}~{}{\\rm all}~{}i\\geq 0\\,.\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NNLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mfrac><mo>≈</mo><mrow><mpadded width=\"+3.3pt\"><mi>independent</mi></mpadded><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>of</mi></mpadded><mo>⁢</mo><mi>i</mi></mrow></mrow><mo rspace=\"5.8pt\">,</mo><mrow><mrow><mpadded width=\"+3.3pt\"><mi>for</mi></mpadded><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>all</mi></mpadded><mo>⁢</mo><mi>i</mi></mrow><mo>≥</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nEq.~(\\ref{eq:pdfapproximation}) above allows us to compute an approximate NNLO prediction for all pdf members and, from there, to derive an approximate pdf error at NNLO following the usual pdf error estimation procedure appropriate for the MST2008 set. {\\it A posteriori} such approximate pdf--error--estimating procedure is also justified by the observation that for the Tevatron kinematic ranges considered in this work the scale error is always dominant over the pdf one and thus the precise value of the pdf error is not very important.\n\nThe Monte-Carlo (MC) integration error of our results is generally small even at the differential level. For inclusive quantities like the total cross-section and the inclusive asymmetry ${\\rm A_{FB}}$, the MC error is typically at the permil-level. In all bins for which data is available, the MC error is around 1\\% or less, i.e. it is negligible. In some bins where the cross-sections are very small, the MC errors could become sizeable. Clearly, to reduce the MC error in such bins special effort has to be made but this is not really necessary for the goals of the present work. In the following we specify the MC error for each individual distribution.\n\n\n\n\\subsection{${m_{t\\bar t}}$ distribution}\\label{sec:Mtt}\n\n\n\\begin{figure}[t]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-M_tT-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-M_tT-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:Mtt} The ${m_{t\\bar t}}$ distribution computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows the absolute normalisation; the one on the right shows the same distribution but normalised to unity. The plots show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO are from adding scales and pdf in quadrature.}\n\\end{figure}\n\nIn fig.~\\ref{fig:Mtt} we show the single-differential distribution $d\\sigma/d{m_{t\\bar t}}$, where ${m_{t\\bar t}}$ is the invariant mass of the $t{\\bar t}$ pair. The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split into five bins of unequal width spanning the interval $240{\\, \\rm GeV} \\leq {m_{t\\bar t}} \\leq 1200{\\, \\rm GeV}$. Events with ${m_{t\\bar t}}>1200{\\, \\rm GeV}$ have been collected in a separate overflow bin; these events are not shown in fig.~\\ref{fig:Mtt} but their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:Mtt}.\n\nIn fig.~\\ref{fig:Mtt}(left) we present the differential distribution (in absolute normalisation) at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD agree in all five bins. The experimental errors are significantly larger than the theory ones. To facilitate possible future more precise measurements, as well as studies of the sensitivity of differential distributions with respect to $m_t$, we present in fig.~\\ref{fig:Mtt}(right) also the corresponding normalised theoretical prediction in LO, NLO and NNLO QCD. \n\nTo better clarify the size of higher order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$ defined, respectively, as the ratios NNLO/NLO and NLO/LO. From the plot of the normalised ${m_{t\\bar t}}$ distribution we conclude that both the NLO and NNLO K-factors have similar behaviours as functions of ${m_{t\\bar t}}$: higher-order effects tend to increase the spectrum close to absolute threshold ${m_{t\\bar t}}\\sim2m_t$ and decrease it past the peak of the distribution. The addition of the NNLO correction has an important stabilising effect on the predicted spectrum: not only the scale error decreases significantly but the size of the K-factor decreases by a factor of ten. This is a very welcoming feature of the NNLO result and it suggests much improved theoretical control over the shape of this distribution at large ${m_{t\\bar t}}$. Similar observation has been made for the LHC in Ref.~\\cite{Czakon:2015owf}.\n\nThe relative MC integration error is estimated to be below 1\\% for all bins shown in fig.~\\ref{fig:Mtt}. The relative MC error for the overflow bin ${m_{t\\bar t}}\\geq 1200{\\, \\rm GeV}$ (shown in appendix~\\ref{sec:appendix} table~\\ref{tab:Mtt}) is estimated to be about 3-4\\%. \n\n\n\n\\subsection{$p_T$ distribution of the top quark}\\label{sec:PTt}\n\n\n\n\n\\begin{figure}[t]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-P_Tt-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-P_Tt-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:PTt} The ${p_{T,t}}$ spectrum computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows its absolute normalisation, while the one on the right the same distribution but normalised to unity. The plots  also show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO is derived by adding in quadrature errors from scales and pdf.}\n\\end{figure}\n\nIn fig.~\\ref{fig:PTt} we show the single inclusive $p_T$ spectrum of the top quark in absolute normalisation (left) and normalised to unity (right). The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split in six unequal-size bins spanning the interval $(0,500){\\, \\rm GeV}$. Computed events with $p_T>500{\\, \\rm GeV}$ have been collected in a separate overflow bin; they are not shown in fig.~\\ref{fig:PTt}; their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:PTt}.\n\nThe D\\O\\ data is for the $p_T$ of average top/antitop while our calculations are for the $p_{T,t}$ (or $p_{T,\\bar t}$). We have checked that the $p_{T,t}$ and $p_{T, \\bar t}$ spectra agree within the MC errors.\n\nThe relative MC integration error is estimated to be below 1\\% for all bins with ${p_{T,t}}\\leq 300{\\, \\rm GeV}$. The highest bin in fig.~\\ref{fig:PTt}, $300\\leq{p_{T,t}}\\leq 500{\\, \\rm GeV}$, has MC error that approaches 2\\%, while the MC error for the overflow bin ${p_{T,t}}\\geq 500{\\, \\rm GeV}$  (shown in appendix~\\ref{sec:appendix} table~\\ref{tab:PTt}) is around 5\\%. \n\nIn fig.~\\ref{fig:PTt}(left) we present the differential distribution, in absolute normalisation, at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD agree in four of the six bins, while in two of the bins data exceeds theory by, roughly, $2\\sigma$. As for the ${m_{t\\bar t}}$ distribution, the experimental errors are significantly larger than the theory ones. A dedicated comparison of the normalised ${p_{T,t}}$ distribution with possible future measurements might be helpful in revealing the interplay between differential distributions and $m_t$.\n\nTo better clarify the importance of higher-order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. From the plot of the normalised ${p_{T,t}}$ distribution we conclude that, as for the ${m_{t\\bar t}}$ distribution, the NLO and NNLO K-factors have similar behaviour as functions of ${p_{T,t}}$: higher order effects tend to increase the spectrum for small ${p_{T,t}}$ and decrease it past the peak of the distribution. The NNLO correction again has sizeable stabilising effect on the predicted spectrum: not only the scale error decreases significantly but the size of the K-factor decreases by a factor of five, or more.\n\n\n\n\n\\subsection{Rapidity distribution of the top quark}\\label{sec:mody}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-moduleY_t-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-moduleY_t-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:mody} The ${\\vert y_t\\vert}$ distribution computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows its absolute normalisation, while the one on the right shows the same distribution but normalised to unity. The plots  also show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO is derived by adding in quadrature errors from scales and pdf.}\n\\end{figure}\n\nIn fig.~\\ref{fig:mody} we show the absolute rapidity ${\\vert y_t\\vert}$ distribution of the top quark. The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split in six equal-width bins spanning the interval $0\\leq{\\vert y_t\\vert}\\leq1.5$. Computed events with ${\\vert y_t\\vert}>1.5$ have been collected in a separate overflow bin; they are not shown in fig.~\\ref{fig:mody}; their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:mody}.\n\nThe D\\O\\ data is for the average top/antitop ${\\vert y\\vert}$ while our calculations are for the top quark's ${\\vert y_t\\vert}$. We have checked that the top and antitop ${\\vert y\\vert}$ distributions agree within the MC error. The relative MC integration error is estimated to be within 1\\% for all bins on fig.~\\ref{fig:mody} as well as for the overflow bin ${\\vert y_t\\vert}>1.5$.\n\nIn fig.~\\ref{fig:mody}(left) we present the differential distribution (in absolute normalisation) at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD marginally agree in five of the six bins, while in one of the bins data exceeds theory by less than $2\\sigma$. As for the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions, the experimental error of the ${\\vert y_t\\vert}$ distribution is significantly larger than the theory one. \n\nTo better clarify the size of higher order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. From the plot of the normalised ${\\vert y_t\\vert}$ distribution we observe that both the NLO and NNLO K-factors tend to increase, almost linearly, with ${\\vert y_t\\vert}$. Unlike the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions, however, the NNLO K-factor increases in size with respect to $K_{\\rm NLO}$ by a factor of, roughly, five. This observation demonstrates the particular significance of the NNLO corrections in this observable. One should also note that the error of the NNLO correction is smaller than the NLO one by about a factor of two and the NNLO result is consistent with the NLO error band in all bins, which confirms that perturbative convergence is firmly present in this observable.  \n\n\n\n\n\\subsection{Top-quark $\\cos\\theta$ distribution and Legendre moments}\\label{sec:costheta}\n\n\nNext we present the NNLO QCD corrections to the differential distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$, where $\\theta$ is the angle between the top quark and the incoming proton in the $t{\\bar t}$ rest frame. This angular distribution was measured by the CDF Collaboration~\\cite{CDF:2013gna}. The data for the normalised distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$ is available from \\cite{CDF:public}; it is split in ten equal-width bins that span the full interval $-1\\leq\\cos\\theta\\leq 1$. The normalisation chosen in Ref.~\\cite{CDF:2013gna} is such that the sum of the values of all bins equals unity, i.e. in effect the values in each bin correspond to the integral of the cross-section over that bin. The theory prediction, through NNLO QCD, is compared with data in fig.~\\ref{fig:costheta}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:costheta}. The effect of the NNLO correction is generally towards decreasing both the discrepancy with data and the scale dependence of the NLO prediction.\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-costheta-norm-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-LegendreMom-eps-converted-to.pdf}\n\\caption{\\label{fig:costheta} The normalised top-quark $\\cos\\theta$ distribution (left) and related Legendre moments (right) through NNLO QCD compared to data from Ref.~\\cite{CDF:2013gna}. Also shown is a naive estimate of the EW corrections (see text) as well as the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions is based on scale variation only.}\n\\end{figure}\n\n\n\nIn fig.~\\ref{fig:costheta}(left) we show the ratio Data/NNLO which is helpful in visualising the significance of the difference between the NNLO QCD prediction and data. We observe that the deviation between the two is never more than approximately $2\\sigma$, while for most of the bins it is less than that or there is agreement between the two. Given the role this distribution plays in the analysis of ${\\rm A_{FB}}$, and the important role of the EW corrections to ${\\rm A_{FB}}$, it is interesting to estimate the effect of the EW corrections when added to the NNLO QCD ones. We do not have EW corrections computed in a form that is readily combinable with our QCD calculation. Therefore, as a rough estimate of the EW corrections, we take the difference between the known NLO+EW result \\cite{Bernreuther:2012sx} and our NLO calculation. We attribute the difference to pure non-QCD corrections and add them to the NNLO QCD ones:\n\n{\\center NNLO QCD + EW(naive) = NNLO QCD + NLO(QCD+EW\\cite{Bernreuther:2012sx}) - NLO QCD (this work).}\n\\newline\n\nThe NLO (QCD+EW) result has been taken from Ref.~\\cite{CDF:public} which, in turn, has been provided by the authors of Ref.~\\cite{Bernreuther:2012sx}. While the setups for the calculation of the $\\cos\\theta$ distribution (as well as the related Legendre moments, see below) in this work and in Ref.~\\cite{Bernreuther:2012sx} differ in several aspects, we have cross-checked the pure NLO QCD results with Ref.~\\cite{Bernreuther:2012sx}\n\n\\footnote{We wish to thank Werner Bernreuther for his help with this comparison.}\n\nand found that they are in reasonable agreement (for the Legendre moments the agreement is only good for the first four moments due to differences in the way the moments are computed). \n\nThe corresponding ratio (NNLO QCD+EW(naive))/NNLO is shown in fig.~\\ref{fig:costheta}(left). While our estimate of the EW corrections is imperfect it should be sufficient to get an idea of the size of the EW corrections. From that figure we conclude that the EW corrections are comparable to the size of the error of the NNLO QCD corrections and are thus not negligible. Furthermore, they tend to decrease the difference between NNLO QCD and data. Still, the EW corrections are not very large and thus their inclusion, or not, is not significantly affecting the comparison of SM theory with data (especially given the sizeable error of the available data).\n\nIn fig.~\\ref{fig:costheta}(left) we also show the NLO and NNLO K-factors. Similarly to the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions discussed above, we find that the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$ have similar shapes, while the NNLO K-factor has significantly smaller size compared to the NLO one. \n\nThe CDF collaboration has also presented \\cite{CDF:2013gna} the results for the first eight Legendre moments of the $\\cos\\theta$ distribution. The relation between moments and the distribution reads\n\n\n", "itemtype": "equation", "pos": 17883, "prevtext": "\n\nWe only calculate $d\\sigma_{\\rm NNLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(0)}$ and $d\\sigma_{\\rm NLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)}$ (the latter is simply an NLO cross-section convoluted with NNLO pdf, whose calculation is inexpensive). Thus, we arrive at the following approximation for an NNLO differential distribution with a pdf member $i\\geq 1$:\n\n\n", "index": 5, "text": "\\begin{equation}\nd\\sigma_{\\rm NNLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)} = d\\sigma_{\\rm NLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(i)} ~\\times~ {d\\sigma_{\\rm NNLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(0)}\\over d\\sigma_{\\rm NLO}\\otimes f\\!\\! f_{\\rm NNLO}^{(0)}} \\, .\n\\label{eq:pdfapproximation}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"d\\sigma_{\\rm NNLO}\\otimes f\\!\\!f_{\\rm NNLO}^{(i)}=d\\sigma_{\\rm NLO}\\otimes f\\!%&#10;\\!f_{\\rm NNLO}^{(i)}~{}\\times~{}{d\\sigma_{\\rm NNLO}\\otimes f\\!\\!f_{\\rm NNLO}^{%&#10;(0)}\\over d\\sigma_{\\rm NLO}\\otimes f\\!\\!f_{\\rm NNLO}^{(0)}}\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NNLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><mpadded width=\"+3.3pt\"><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></msubsup></mpadded></mrow><mo rspace=\"5.8pt\">×</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NNLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>σ</mi><mi>NLO</mi></msub></mrow><mo>⊗</mo><mpadded width=\"-3.4pt\"><mi>f</mi></mpadded></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>NNLO</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nand $P_\\ell(z)$ are the usual Legendre polynomials. \n\nThe Legendre moment analysis of the angular distribution is well-suited for discussing the top-quark ${\\rm A_{FB}}$, see also sec.~\\ref{sec:afb-legmom} below. The normalisation (both for data and our calculation) is such that the zeroth moment is $a_0=1$ (i.e. the moments correspond to the normalised distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$ and are obtained from the ones defined in eq.~(\\ref{eq:Leg-a}) by dividing by $\\sigma/2$).\n\n\\footnote{We wish to thank Jon Wilson for helpful clarifications regarding Ref.~\\cite{CDF:2013gna}.}\n\n\nThe corresponding moments are shown in fig.~\\ref{fig:costheta}(right), see also appendix~\\ref{sec:appendix} table~\\ref{tab:legmom}. Similarly to the $\\cos\\theta$ distribution we also present a naive estimate of the EW corrections for the first four moments only. Given the rapidly increasing size of the errors in the higher moments we feel that restricting the comparison to the first four moments $a_1,\\dots,a_4$ is justified. We observe that the NNLO QCD correction is sizeable, and becomes especially large for the higher moments, as can be seen from the NNLO K-factor. Still it is within the error band of the NLO correction and thus consistent with error estimates based on scale variation. We observe that the EW correction is particularly relevant for the first moment $a_1$ where it exceeds the size of the error estimate of the NNLO QCD. This finding is in line with the well-recognized importance of EW corrections for the inclusive ${\\rm A_{FB}}$.\n\nThe MC error in each bin of the $\\cos\\theta$ distribution (with absolute normalisation) is around few permil in each bin. The MC error of the Legendre moments grows rapidly for higher moments: for $a_{1,2,3}$ it is below 5 permil; for $a_4$ it is around 2\\%, while for $a_8$ it exceeds 30\\%. \n\nFinally, we would like to mention that our calculation of the Legendre moments is not based on summing over the bins in fig.~\\ref{fig:costheta}(left) but, in order to avoid bin-size effects, the moments are computed by summing the contribution from each partonic event, similarly to the way all distributions are computed.\n\n\n\n\\subsection{Comparison with approximate NNLO/resummed NLO QCD results}\\label{sec:approxNNLO}\n\n\nUntil now, differential Tevatron top-quark measurements have been compared to theoretical predictions derived in either approximate NNLO or soft-gluon-resummed NLO. Such predictions are fixed-order NLO accurate and include partial NNLO contributions originating from the expansion of soft-gluon-resummed predictions (or possibly all-order towers if the results are resummed). It will be instructive to compare the presently-derived fully differential exact NNLO results with such ``NLO+\" predictions. To that end in fig.~\\ref{fig:approxNNLO} we show the ratio of various approximate NNLO/resummed NLO predictions to the exact NNLO QCD result.\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.05\\textwidth]{ApproxNNLO-compare-eps-converted-to.pdf}\n\\caption{\\label{fig:approxNNLO} Ratios of various approximate NNLO/resummed NLO predictions and the exact NNLO QCD results for three differential distributions.}\n\\end{figure}\n\n\nFor the ${m_{t\\bar t}}$ distribution we compare with Ref.~\\cite{Ahrens:2010zv} as well as the more recent work \\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}. For the purpose of this comparison the calculation of Refs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv} has been performed with the same parameters as the NNLO calculation ($m_t$, pdf set and binning)\n\n\\footnote{We are grateful to Li Lin Yang for sending us the numbers from Refs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}}.\n\nNo corrections beyond NNLO are included in the prediction of Ref.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}. The ${m_{t\\bar t}}$ prediction from Ref.~\\cite{Ahrens:2010zv} shown in fig.~\\ref{fig:approxNNLO} is adapted from fig.~9 in Ref.~\\cite{Abazov:2014vga}: the results from \\cite{Ahrens:2010zv} are NLO+NNLL (next-to-next-to-leading log); resummation is performed in momentum space with a default scale choice $\\mu = {m_{t\\bar t}}$\\;; however, unlike fig.~9 in \\cite{Abazov:2014vga}, they are shown here with their normalisation not rescaled to exact NNLO. In fig.~\\ref{fig:approxNNLO} we notice that the approximate NNLO result of Ref.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv} agrees with the exact NNLO one within the scale error of the NNLO result.\n\nFor the top-quark ${p_{T,t}}$ distribution we compare with predictions from Refs.~\\cite{Ahrens:2011mw,Kidonakis:2010dk}. The values shown here differ from fig.~11 of Ref.~\\cite{Abazov:2014vga}; they correspond to the original calculations \\cite{Ahrens:2011mw,Kidonakis:2010dk} and have been provided to us by the authors of Refs.~\\cite{Ahrens:2011mw,Kidonakis:2010dk} for the purpose of this comparison. The result of Ref.~\\cite{Ahrens:2011mw} is NLO+NNLL in momentum space, uses default scale $\\mu = 2m_t$ and is shown here with its normalisation not rescaled to exact NNLO. The result of Ref.~\\cite{Kidonakis:2010dk} is for $m_t=173{\\, \\rm GeV}$. In fig.~\\ref{fig:approxNNLO} we notice that the approximate NNLO result of Ref.~\\cite{Kidonakis:2010dk} agrees with the exact NNLO one within the scale error of the NNLO result.\n\nFinally, we compare the ${\\vert y_t\\vert}$ distribution with prediction from Ref.~\\cite{Kidonakis:2011zn} (computed with $m_t=173{\\, \\rm GeV}$; the values shown are adapted from fig.~10 of Ref.~\\cite{Abazov:2014vga}). As can be concluded from fig.~\\ref{fig:approxNNLO}, the approximate result is consistent with the exact one within the scale error of the NNLO result. \n\nIn conclusion, in order to fully document our presentation and avoid possible miscommunications\n\n\\footnote{Unfortunately, such a step is required since these numbers are not explicitly available in any publication. We thank Andreas Jung as well as the authors of references \\cite{Ahrens:2010zv,Ferroglia:2013zwa,Ferroglia:2015ivv,Ahrens:2011mw,Kidonakis:2010dk,Kidonakis:2011zn} for providing us with their numbers and for cross-checking them.},\n\nwe next specify the bin values for all approximate NNLO/resummed NLO differential distributions shown in fig.~\\ref{fig:approxNNLO}:\n\n\\begin{itemize}\n\\item ${m_{t\\bar t}}$ (in units of $[10^{-2}{\\rm pb}/{\\, \\rm GeV}]$):\\\\ \nRef~\\cite{Ahrens:2010zv}:~$(1.7,2.51,0.773,0.181,0.0126)$;\\\\ \nRefs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}: ~$(1.75,2.712,0.8483,0.2008,0.01414)$.\n\n\\item ${p_{T,t}}$ (in units of $[10^{-2}{\\rm pb}/{\\, \\rm GeV}]$):\\\\ \nRef~\\cite{Ahrens:2011mw}:~$(2.748,5.235,3.66,1.485,0.3125)$;\\\\ \nRef.~\\cite{Kidonakis:2010dk}: ~$(2.747,5.522,4.029,1.714,0.3745,0.02075)$.\n\n\\item ${\\vert y_t\\vert}$ (in units of $[{\\rm pb}]$):\\\\\nRef.~\\cite{Kidonakis:2011zn}: ~$(8.276,7.34,5.697,3.773,2.039,0.8356)$.\n\\end{itemize}\n\n\n\n\\section{Top-quark ${\\rm A_{FB}}$ and related differential distributions}\\label{sec:AFB}\n\n\n\\subsection{General Comments}\\label{sec:AFB-general}\n\n\nIn this section we extend the study of Ref.~\\cite{Czakon:2014xsa} and present detailed results for both the differential asymmetry and corresponding (doubly-) differential distributions in the $t\\bar t$ rapidity difference ${\\Delta y} \\equiv y_t - y_{\\bar t}$, in ${\\Delta y}$ and ${m_{t\\bar t}}$ and in ${\\Delta y}$ and ${p_{T,t\\bar t}}$. As in Ref.~\\cite{Czakon:2014xsa} we define the differential asymmetry as the ratio of a numerator and denominator each computed through the NNLO QCD corrections of order ${\\cal O}({\\alpha_S}^4)$. Following \\cite{Aaltonen:2012it}, we define the differential asymmetry as\n\n\n", "itemtype": "equation", "pos": 33297, "prevtext": "\n\nEq.~(\\ref{eq:pdfapproximation}) above allows us to compute an approximate NNLO prediction for all pdf members and, from there, to derive an approximate pdf error at NNLO following the usual pdf error estimation procedure appropriate for the MST2008 set. {\\it A posteriori} such approximate pdf--error--estimating procedure is also justified by the observation that for the Tevatron kinematic ranges considered in this work the scale error is always dominant over the pdf one and thus the precise value of the pdf error is not very important.\n\nThe Monte-Carlo (MC) integration error of our results is generally small even at the differential level. For inclusive quantities like the total cross-section and the inclusive asymmetry ${\\rm A_{FB}}$, the MC error is typically at the permil-level. In all bins for which data is available, the MC error is around 1\\% or less, i.e. it is negligible. In some bins where the cross-sections are very small, the MC errors could become sizeable. Clearly, to reduce the MC error in such bins special effort has to be made but this is not really necessary for the goals of the present work. In the following we specify the MC error for each individual distribution.\n\n\n\n\\subsection{${m_{t\\bar t}}$ distribution}\\label{sec:Mtt}\n\n\n\\begin{figure}[t]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-M_tT-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-M_tT-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:Mtt} The ${m_{t\\bar t}}$ distribution computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows the absolute normalisation; the one on the right shows the same distribution but normalised to unity. The plots show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO are from adding scales and pdf in quadrature.}\n\\end{figure}\n\nIn fig.~\\ref{fig:Mtt} we show the single-differential distribution $d\\sigma/d{m_{t\\bar t}}$, where ${m_{t\\bar t}}$ is the invariant mass of the $t{\\bar t}$ pair. The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split into five bins of unequal width spanning the interval $240{\\, \\rm GeV} \\leq {m_{t\\bar t}} \\leq 1200{\\, \\rm GeV}$. Events with ${m_{t\\bar t}}>1200{\\, \\rm GeV}$ have been collected in a separate overflow bin; these events are not shown in fig.~\\ref{fig:Mtt} but their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:Mtt}.\n\nIn fig.~\\ref{fig:Mtt}(left) we present the differential distribution (in absolute normalisation) at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD agree in all five bins. The experimental errors are significantly larger than the theory ones. To facilitate possible future more precise measurements, as well as studies of the sensitivity of differential distributions with respect to $m_t$, we present in fig.~\\ref{fig:Mtt}(right) also the corresponding normalised theoretical prediction in LO, NLO and NNLO QCD. \n\nTo better clarify the size of higher order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$ defined, respectively, as the ratios NNLO/NLO and NLO/LO. From the plot of the normalised ${m_{t\\bar t}}$ distribution we conclude that both the NLO and NNLO K-factors have similar behaviours as functions of ${m_{t\\bar t}}$: higher-order effects tend to increase the spectrum close to absolute threshold ${m_{t\\bar t}}\\sim2m_t$ and decrease it past the peak of the distribution. The addition of the NNLO correction has an important stabilising effect on the predicted spectrum: not only the scale error decreases significantly but the size of the K-factor decreases by a factor of ten. This is a very welcoming feature of the NNLO result and it suggests much improved theoretical control over the shape of this distribution at large ${m_{t\\bar t}}$. Similar observation has been made for the LHC in Ref.~\\cite{Czakon:2015owf}.\n\nThe relative MC integration error is estimated to be below 1\\% for all bins shown in fig.~\\ref{fig:Mtt}. The relative MC error for the overflow bin ${m_{t\\bar t}}\\geq 1200{\\, \\rm GeV}$ (shown in appendix~\\ref{sec:appendix} table~\\ref{tab:Mtt}) is estimated to be about 3-4\\%. \n\n\n\n\\subsection{$p_T$ distribution of the top quark}\\label{sec:PTt}\n\n\n\n\n\\begin{figure}[t]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-P_Tt-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-P_Tt-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:PTt} The ${p_{T,t}}$ spectrum computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows its absolute normalisation, while the one on the right the same distribution but normalised to unity. The plots  also show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO is derived by adding in quadrature errors from scales and pdf.}\n\\end{figure}\n\nIn fig.~\\ref{fig:PTt} we show the single inclusive $p_T$ spectrum of the top quark in absolute normalisation (left) and normalised to unity (right). The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split in six unequal-size bins spanning the interval $(0,500){\\, \\rm GeV}$. Computed events with $p_T>500{\\, \\rm GeV}$ have been collected in a separate overflow bin; they are not shown in fig.~\\ref{fig:PTt}; their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:PTt}.\n\nThe D\\O\\ data is for the $p_T$ of average top/antitop while our calculations are for the $p_{T,t}$ (or $p_{T,\\bar t}$). We have checked that the $p_{T,t}$ and $p_{T, \\bar t}$ spectra agree within the MC errors.\n\nThe relative MC integration error is estimated to be below 1\\% for all bins with ${p_{T,t}}\\leq 300{\\, \\rm GeV}$. The highest bin in fig.~\\ref{fig:PTt}, $300\\leq{p_{T,t}}\\leq 500{\\, \\rm GeV}$, has MC error that approaches 2\\%, while the MC error for the overflow bin ${p_{T,t}}\\geq 500{\\, \\rm GeV}$  (shown in appendix~\\ref{sec:appendix} table~\\ref{tab:PTt}) is around 5\\%. \n\nIn fig.~\\ref{fig:PTt}(left) we present the differential distribution, in absolute normalisation, at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD agree in four of the six bins, while in two of the bins data exceeds theory by, roughly, $2\\sigma$. As for the ${m_{t\\bar t}}$ distribution, the experimental errors are significantly larger than the theory ones. A dedicated comparison of the normalised ${p_{T,t}}$ distribution with possible future measurements might be helpful in revealing the interplay between differential distributions and $m_t$.\n\nTo better clarify the importance of higher-order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. From the plot of the normalised ${p_{T,t}}$ distribution we conclude that, as for the ${m_{t\\bar t}}$ distribution, the NLO and NNLO K-factors have similar behaviour as functions of ${p_{T,t}}$: higher order effects tend to increase the spectrum for small ${p_{T,t}}$ and decrease it past the peak of the distribution. The NNLO correction again has sizeable stabilising effect on the predicted spectrum: not only the scale error decreases significantly but the size of the K-factor decreases by a factor of five, or more.\n\n\n\n\n\\subsection{Rapidity distribution of the top quark}\\label{sec:mody}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-moduleY_t-abs-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-moduleY_t-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:mody} The ${\\vert y_t\\vert}$ distribution computed through NNLO in QCD and compared to data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}. The plot on the left shows its absolute normalisation, while the one on the right shows the same distribution but normalised to unity. The plots  also show the ratio of data to NNLO QCD as well as the NNLO/NLO and NLO/LO K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions at NLO and NNLO is derived by adding in quadrature errors from scales and pdf.}\n\\end{figure}\n\nIn fig.~\\ref{fig:mody} we show the absolute rapidity ${\\vert y_t\\vert}$ distribution of the top quark. The bins correspond to the ones used in the D\\O\\ analysis~\\cite{Abazov:2014vga}: the data is split in six equal-width bins spanning the interval $0\\leq{\\vert y_t\\vert}\\leq1.5$. Computed events with ${\\vert y_t\\vert}>1.5$ have been collected in a separate overflow bin; they are not shown in fig.~\\ref{fig:mody}; their contribution can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:mody}.\n\nThe D\\O\\ data is for the average top/antitop ${\\vert y\\vert}$ while our calculations are for the top quark's ${\\vert y_t\\vert}$. We have checked that the top and antitop ${\\vert y\\vert}$ distributions agree within the MC error. The relative MC integration error is estimated to be within 1\\% for all bins on fig.~\\ref{fig:mody} as well as for the overflow bin ${\\vert y_t\\vert}>1.5$.\n\nIn fig.~\\ref{fig:mody}(left) we present the differential distribution (in absolute normalisation) at LO, NLO and NNLO QCD and compare it with available D\\O\\ data. Data and NNLO QCD marginally agree in five of the six bins, while in one of the bins data exceeds theory by less than $2\\sigma$. As for the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions, the experimental error of the ${\\vert y_t\\vert}$ distribution is significantly larger than the theory one. \n\nTo better clarify the size of higher order radiative corrections we also show the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. From the plot of the normalised ${\\vert y_t\\vert}$ distribution we observe that both the NLO and NNLO K-factors tend to increase, almost linearly, with ${\\vert y_t\\vert}$. Unlike the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions, however, the NNLO K-factor increases in size with respect to $K_{\\rm NLO}$ by a factor of, roughly, five. This observation demonstrates the particular significance of the NNLO corrections in this observable. One should also note that the error of the NNLO correction is smaller than the NLO one by about a factor of two and the NNLO result is consistent with the NLO error band in all bins, which confirms that perturbative convergence is firmly present in this observable.  \n\n\n\n\n\\subsection{Top-quark $\\cos\\theta$ distribution and Legendre moments}\\label{sec:costheta}\n\n\nNext we present the NNLO QCD corrections to the differential distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$, where $\\theta$ is the angle between the top quark and the incoming proton in the $t{\\bar t}$ rest frame. This angular distribution was measured by the CDF Collaboration~\\cite{CDF:2013gna}. The data for the normalised distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$ is available from \\cite{CDF:public}; it is split in ten equal-width bins that span the full interval $-1\\leq\\cos\\theta\\leq 1$. The normalisation chosen in Ref.~\\cite{CDF:2013gna} is such that the sum of the values of all bins equals unity, i.e. in effect the values in each bin correspond to the integral of the cross-section over that bin. The theory prediction, through NNLO QCD, is compared with data in fig.~\\ref{fig:costheta}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:costheta}. The effect of the NNLO correction is generally towards decreasing both the discrepancy with data and the scale dependence of the NLO prediction.\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-costheta-norm-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-LegendreMom-eps-converted-to.pdf}\n\\caption{\\label{fig:costheta} The normalised top-quark $\\cos\\theta$ distribution (left) and related Legendre moments (right) through NNLO QCD compared to data from Ref.~\\cite{CDF:2013gna}. Also shown is a naive estimate of the EW corrections (see text) as well as the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$. The error of the theory predictions is based on scale variation only.}\n\\end{figure}\n\n\n\nIn fig.~\\ref{fig:costheta}(left) we show the ratio Data/NNLO which is helpful in visualising the significance of the difference between the NNLO QCD prediction and data. We observe that the deviation between the two is never more than approximately $2\\sigma$, while for most of the bins it is less than that or there is agreement between the two. Given the role this distribution plays in the analysis of ${\\rm A_{FB}}$, and the important role of the EW corrections to ${\\rm A_{FB}}$, it is interesting to estimate the effect of the EW corrections when added to the NNLO QCD ones. We do not have EW corrections computed in a form that is readily combinable with our QCD calculation. Therefore, as a rough estimate of the EW corrections, we take the difference between the known NLO+EW result \\cite{Bernreuther:2012sx} and our NLO calculation. We attribute the difference to pure non-QCD corrections and add them to the NNLO QCD ones:\n\n{\\center NNLO QCD + EW(naive) = NNLO QCD + NLO(QCD+EW\\cite{Bernreuther:2012sx}) - NLO QCD (this work).}\n\\newline\n\nThe NLO (QCD+EW) result has been taken from Ref.~\\cite{CDF:public} which, in turn, has been provided by the authors of Ref.~\\cite{Bernreuther:2012sx}. While the setups for the calculation of the $\\cos\\theta$ distribution (as well as the related Legendre moments, see below) in this work and in Ref.~\\cite{Bernreuther:2012sx} differ in several aspects, we have cross-checked the pure NLO QCD results with Ref.~\\cite{Bernreuther:2012sx}\n\n\\footnote{We wish to thank Werner Bernreuther for his help with this comparison.}\n\nand found that they are in reasonable agreement (for the Legendre moments the agreement is only good for the first four moments due to differences in the way the moments are computed). \n\nThe corresponding ratio (NNLO QCD+EW(naive))/NNLO is shown in fig.~\\ref{fig:costheta}(left). While our estimate of the EW corrections is imperfect it should be sufficient to get an idea of the size of the EW corrections. From that figure we conclude that the EW corrections are comparable to the size of the error of the NNLO QCD corrections and are thus not negligible. Furthermore, they tend to decrease the difference between NNLO QCD and data. Still, the EW corrections are not very large and thus their inclusion, or not, is not significantly affecting the comparison of SM theory with data (especially given the sizeable error of the available data).\n\nIn fig.~\\ref{fig:costheta}(left) we also show the NLO and NNLO K-factors. Similarly to the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions discussed above, we find that the K-factors $K_{\\rm NNLO}$ and $K_{\\rm NLO}$ have similar shapes, while the NNLO K-factor has significantly smaller size compared to the NLO one. \n\nThe CDF collaboration has also presented \\cite{CDF:2013gna} the results for the first eight Legendre moments of the $\\cos\\theta$ distribution. The relation between moments and the distribution reads\n\n\n", "index": 7, "text": "\\begin{equation}\n{d\\sigma\\over d\\cos\\theta} = \\sum_{\\ell = 0}^\\infty a_\\ell P_\\ell(\\cos\\theta)\\, ,~~{\\rm where}~~~ a_\\ell = {2\\ell+1\\over 2}\\int_{-1}^1P_\\ell(\\cos\\theta) {d\\sigma\\over d\\cos\\theta} d\\cos\\theta\\, ,\n\\label{eq:Leg-a}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{d\\sigma\\over d\\cos\\theta}=\\sum_{\\ell=0}^{\\infty}a_{\\ell}P_{\\ell}(\\cos\\theta)%&#10;\\,,~{}~{}{\\rm where}~{}~{}~{}a_{\\ell}={2\\ell+1\\over 2}\\int_{-1}^{1}P_{\\ell}(%&#10;\\cos\\theta){d\\sigma\\over d\\cos\\theta}d\\cos\\theta\\,,\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>σ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi mathvariant=\"normal\">ℓ</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>a</mi><mi mathvariant=\"normal\">ℓ</mi></msub><mo>⁢</mo><msub><mi>P</mi><mi mathvariant=\"normal\">ℓ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo rspace=\"9.1pt\">,</mo><mrow><mrow><mpadded width=\"+9.9pt\"><mi>where</mi></mpadded><mo>⁢</mo><msub><mi>a</mi><mi mathvariant=\"normal\">ℓ</mi></msub></mrow><mo>=</mo><mrow><mfrac><mrow><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">ℓ</mi></mrow><mo>+</mo><mn>1</mn></mrow><mn>2</mn></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mn>1</mn></mrow><mn>1</mn></msubsup><mrow><msub><mi>P</mi><mi mathvariant=\"normal\">ℓ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>σ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mpadded width=\"+1.7pt\"><mi>θ</mi></mpadded></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nThe binning function $\\theta_{\\mathrm{bin}}$ takes values zero or unity such that it restricts the kinematics of the $t\\bar t$ pair to the corresponding bins (defined in the following). Setting $\\theta_{\\mathrm{bin}}=1$ in eq.~(\\ref{eq:AFB-diff}) yields the inclusive asymmetry ${\\rm A_{FB}}$. \n\nAn alternative definition for the inclusive ${\\rm A_{FB}}$ was considered in Ref.~\\cite{Czakon:2014xsa} (such that the numerator/denominator ratio is expanded in powers of ${\\alpha_S}$). Since in this work we do not show any new result for the inclusive ${\\rm A_{FB}}$ we do not need to introduce this definition here.\n\nUnlike Ref.~\\cite{Czakon:2014xsa}, in this work we include the pdf error (derived as described in sec.~\\ref{sec:dif-dist}). As anticipated in Ref.~\\cite{Czakon:2014xsa}, the ${\\rm A_{FB}}$ pdf error is negligible when compared to the scale error.\n\n\n\\subsection{${\\Delta y}$ differential distribution and asymmetry}\\label{sec:afb-y}\n\n\nIn fig.~\\ref{fig:afb-y} we show the ${\\vert\\Delta y\\vert}$ dependence of ${\\rm A_{FB}}$ (right; see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-y}) and the corresponding differential distribution $d\\sigma/d{\\Delta y}$ (left; see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-y}). We use the same bins as Ref.~\\cite{Czakon:2014xsa} which, in turn, match the CDF bins in Ref.~\\cite{Aaltonen:2012it}. \n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-y} The differential distribution $d\\sigma/d{\\Delta y}$ (left) and related differential asymmetry ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ (right). Comparison includes SM theory through NNLO QCD and CDF and D\\O\\ data. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\n\nThe differential asymmetry is divided into four equal-width bins. The bin with highest ${\\vert\\Delta y\\vert}$ contains overflow events. The theoretical prediction through NNLO QCD is shown in fig.~\\ref{fig:afb-y}(right), see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-y}, and compared with data from CDF \\cite{Aaltonen:2012it} and D\\O\\ \\cite{Abazov:2014cca,D0:public} collaborations. We also plot the data normalised to the central NNLO QCD prediction as well as the NNLO K-factor (the NLO K-factor is not defined for ${\\rm A_{FB}}$ since the LO result is zero).\n\nWe notice that the K-factor is nearly constant with ${\\vert\\Delta y\\vert}$ and, at around 25\\%, is rather sizeable. Looking at the estimated errors, we notice that the NNLO result has significantly smaller errors than the NLO one (by about a factor of three) and moreover the NNLO error band is fully contained within the NLO one. This feature demonstrates that this observable possesses good perturbative convergence.\n\nThe comparison between NNLO theory predictions for ${\\rm A_{FB}}$ and data has already been discussed in Ref.~\\cite{Czakon:2014xsa}. Its main feature is the agreement of NNLO QCD with the D\\O\\ data while the CDF measurement is higher than theory. The significance of this discrepancy is between $1 \\sigma$ and $2 \\sigma$. With the exception of the bin with highest ${\\vert\\Delta y\\vert}$, the significance of the discrepancy seems to be growing with ${\\vert\\Delta y\\vert}$.\n\nA compact way of presenting the ${\\vert\\Delta y\\vert}$ dependence of ${\\rm A_{FB}}$ is through its slope \\cite{Aaltonen:2012it}. The least-squares linear fit to the NNLO QCD prediction, assuming zero intercept, reads:\n\n\n", "itemtype": "equation", "pos": 41116, "prevtext": "\n\nand $P_\\ell(z)$ are the usual Legendre polynomials. \n\nThe Legendre moment analysis of the angular distribution is well-suited for discussing the top-quark ${\\rm A_{FB}}$, see also sec.~\\ref{sec:afb-legmom} below. The normalisation (both for data and our calculation) is such that the zeroth moment is $a_0=1$ (i.e. the moments correspond to the normalised distribution $(1/\\sigma)d\\sigma/d\\cos\\theta$ and are obtained from the ones defined in eq.~(\\ref{eq:Leg-a}) by dividing by $\\sigma/2$).\n\n\\footnote{We wish to thank Jon Wilson for helpful clarifications regarding Ref.~\\cite{CDF:2013gna}.}\n\n\nThe corresponding moments are shown in fig.~\\ref{fig:costheta}(right), see also appendix~\\ref{sec:appendix} table~\\ref{tab:legmom}. Similarly to the $\\cos\\theta$ distribution we also present a naive estimate of the EW corrections for the first four moments only. Given the rapidly increasing size of the errors in the higher moments we feel that restricting the comparison to the first four moments $a_1,\\dots,a_4$ is justified. We observe that the NNLO QCD correction is sizeable, and becomes especially large for the higher moments, as can be seen from the NNLO K-factor. Still it is within the error band of the NLO correction and thus consistent with error estimates based on scale variation. We observe that the EW correction is particularly relevant for the first moment $a_1$ where it exceeds the size of the error estimate of the NNLO QCD. This finding is in line with the well-recognized importance of EW corrections for the inclusive ${\\rm A_{FB}}$.\n\nThe MC error in each bin of the $\\cos\\theta$ distribution (with absolute normalisation) is around few permil in each bin. The MC error of the Legendre moments grows rapidly for higher moments: for $a_{1,2,3}$ it is below 5 permil; for $a_4$ it is around 2\\%, while for $a_8$ it exceeds 30\\%. \n\nFinally, we would like to mention that our calculation of the Legendre moments is not based on summing over the bins in fig.~\\ref{fig:costheta}(left) but, in order to avoid bin-size effects, the moments are computed by summing the contribution from each partonic event, similarly to the way all distributions are computed.\n\n\n\n\\subsection{Comparison with approximate NNLO/resummed NLO QCD results}\\label{sec:approxNNLO}\n\n\nUntil now, differential Tevatron top-quark measurements have been compared to theoretical predictions derived in either approximate NNLO or soft-gluon-resummed NLO. Such predictions are fixed-order NLO accurate and include partial NNLO contributions originating from the expansion of soft-gluon-resummed predictions (or possibly all-order towers if the results are resummed). It will be instructive to compare the presently-derived fully differential exact NNLO results with such ``NLO+\" predictions. To that end in fig.~\\ref{fig:approxNNLO} we show the ratio of various approximate NNLO/resummed NLO predictions to the exact NNLO QCD result.\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.05\\textwidth]{ApproxNNLO-compare-eps-converted-to.pdf}\n\\caption{\\label{fig:approxNNLO} Ratios of various approximate NNLO/resummed NLO predictions and the exact NNLO QCD results for three differential distributions.}\n\\end{figure}\n\n\nFor the ${m_{t\\bar t}}$ distribution we compare with Ref.~\\cite{Ahrens:2010zv} as well as the more recent work \\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}. For the purpose of this comparison the calculation of Refs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv} has been performed with the same parameters as the NNLO calculation ($m_t$, pdf set and binning)\n\n\\footnote{We are grateful to Li Lin Yang for sending us the numbers from Refs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}}.\n\nNo corrections beyond NNLO are included in the prediction of Ref.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}. The ${m_{t\\bar t}}$ prediction from Ref.~\\cite{Ahrens:2010zv} shown in fig.~\\ref{fig:approxNNLO} is adapted from fig.~9 in Ref.~\\cite{Abazov:2014vga}: the results from \\cite{Ahrens:2010zv} are NLO+NNLL (next-to-next-to-leading log); resummation is performed in momentum space with a default scale choice $\\mu = {m_{t\\bar t}}$\\;; however, unlike fig.~9 in \\cite{Abazov:2014vga}, they are shown here with their normalisation not rescaled to exact NNLO. In fig.~\\ref{fig:approxNNLO} we notice that the approximate NNLO result of Ref.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv} agrees with the exact NNLO one within the scale error of the NNLO result.\n\nFor the top-quark ${p_{T,t}}$ distribution we compare with predictions from Refs.~\\cite{Ahrens:2011mw,Kidonakis:2010dk}. The values shown here differ from fig.~11 of Ref.~\\cite{Abazov:2014vga}; they correspond to the original calculations \\cite{Ahrens:2011mw,Kidonakis:2010dk} and have been provided to us by the authors of Refs.~\\cite{Ahrens:2011mw,Kidonakis:2010dk} for the purpose of this comparison. The result of Ref.~\\cite{Ahrens:2011mw} is NLO+NNLL in momentum space, uses default scale $\\mu = 2m_t$ and is shown here with its normalisation not rescaled to exact NNLO. The result of Ref.~\\cite{Kidonakis:2010dk} is for $m_t=173{\\, \\rm GeV}$. In fig.~\\ref{fig:approxNNLO} we notice that the approximate NNLO result of Ref.~\\cite{Kidonakis:2010dk} agrees with the exact NNLO one within the scale error of the NNLO result.\n\nFinally, we compare the ${\\vert y_t\\vert}$ distribution with prediction from Ref.~\\cite{Kidonakis:2011zn} (computed with $m_t=173{\\, \\rm GeV}$; the values shown are adapted from fig.~10 of Ref.~\\cite{Abazov:2014vga}). As can be concluded from fig.~\\ref{fig:approxNNLO}, the approximate result is consistent with the exact one within the scale error of the NNLO result. \n\nIn conclusion, in order to fully document our presentation and avoid possible miscommunications\n\n\\footnote{Unfortunately, such a step is required since these numbers are not explicitly available in any publication. We thank Andreas Jung as well as the authors of references \\cite{Ahrens:2010zv,Ferroglia:2013zwa,Ferroglia:2015ivv,Ahrens:2011mw,Kidonakis:2010dk,Kidonakis:2011zn} for providing us with their numbers and for cross-checking them.},\n\nwe next specify the bin values for all approximate NNLO/resummed NLO differential distributions shown in fig.~\\ref{fig:approxNNLO}:\n\n\\begin{itemize}\n\\item ${m_{t\\bar t}}$ (in units of $[10^{-2}{\\rm pb}/{\\, \\rm GeV}]$):\\\\ \nRef~\\cite{Ahrens:2010zv}:~$(1.7,2.51,0.773,0.181,0.0126)$;\\\\ \nRefs.~\\cite{Ferroglia:2013zwa,Ferroglia:2015ivv}: ~$(1.75,2.712,0.8483,0.2008,0.01414)$.\n\n\\item ${p_{T,t}}$ (in units of $[10^{-2}{\\rm pb}/{\\, \\rm GeV}]$):\\\\ \nRef~\\cite{Ahrens:2011mw}:~$(2.748,5.235,3.66,1.485,0.3125)$;\\\\ \nRef.~\\cite{Kidonakis:2010dk}: ~$(2.747,5.522,4.029,1.714,0.3745,0.02075)$.\n\n\\item ${\\vert y_t\\vert}$ (in units of $[{\\rm pb}]$):\\\\\nRef.~\\cite{Kidonakis:2011zn}: ~$(8.276,7.34,5.697,3.773,2.039,0.8356)$.\n\\end{itemize}\n\n\n\n\\section{Top-quark ${\\rm A_{FB}}$ and related differential distributions}\\label{sec:AFB}\n\n\n\\subsection{General Comments}\\label{sec:AFB-general}\n\n\nIn this section we extend the study of Ref.~\\cite{Czakon:2014xsa} and present detailed results for both the differential asymmetry and corresponding (doubly-) differential distributions in the $t\\bar t$ rapidity difference ${\\Delta y} \\equiv y_t - y_{\\bar t}$, in ${\\Delta y}$ and ${m_{t\\bar t}}$ and in ${\\Delta y}$ and ${p_{T,t\\bar t}}$. As in Ref.~\\cite{Czakon:2014xsa} we define the differential asymmetry as the ratio of a numerator and denominator each computed through the NNLO QCD corrections of order ${\\cal O}({\\alpha_S}^4)$. Following \\cite{Aaltonen:2012it}, we define the differential asymmetry as\n\n\n", "index": 9, "text": "\\begin{equation}\n{{\\rm A_{FB}}} = {\\sigma^{+}_{\\rm bin} - \\sigma^{-}_{\\rm bin} \\over \\sigma^{+}_{\\rm bin} + \\sigma^{-}_{\\rm bin} }\n~~~,~~~\n\\sigma^\\pm_{\\mathrm{bin}} = \\int \\theta(\\pm \\Delta y) \\theta_{\\mathrm{bin}} \\mathrm{d}\\sigma\\, .\n\\label{eq:AFB-diff}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{{\\rm A_{FB}}}={\\sigma^{+}_{\\rm bin}-\\sigma^{-}_{\\rm bin}\\over\\sigma^{+}_{\\rm&#10;bin%&#10;}+\\sigma^{-}_{\\rm bin}}~{}~{}~{},~{}~{}~{}\\sigma^{\\pm}_{\\mathrm{bin}}=\\int%&#10;\\theta(\\pm\\Delta y)\\theta_{\\mathrm{bin}}\\mathrm{d}\\sigma\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>FB</mi></msub><mo>=</mo><mpadded width=\"+9.9pt\"><mfrac><mrow><msubsup><mi>σ</mi><mi>bin</mi><mo>+</mo></msubsup><mo>-</mo><msubsup><mi>σ</mi><mi>bin</mi><mo>-</mo></msubsup></mrow><mrow><msubsup><mi>σ</mi><mi>bin</mi><mo>+</mo></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>bin</mi><mo>-</mo></msubsup></mrow></mfrac></mpadded></mrow><mo rspace=\"12.4pt\">,</mo><mrow><msubsup><mi>σ</mi><mi>bin</mi><mo>±</mo></msubsup><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>±</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>y</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>θ</mi><mi>bin</mi></msub><mo>⁢</mo><mrow><mo>d</mo><mpadded width=\"+1.7pt\"><mi>σ</mi></mpadded></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nThe error in eq.~(\\ref{eq:beta_y}) includes both scale and pdf variation, although the contribution from the pdf error is marginal (its omission would only change the ``+\"-error in (\\ref{eq:beta_y}) from 0.006 to 0.005). The slope in NLO QCD reads $\\alpha_y^{\\rm NLO} = 0.092^{+0.042}_{-0.022}$.\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-slope-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-slope-eps-converted-to.pdf}\n\\caption{\\label{fig:slope} A least-squares linear fit (see text) to the central values of the NLO and NNLO QCD ${\\vert\\Delta y\\vert}$ (left) and ${m_{t\\bar t}}$ (right) asymmetries versus the exact calculation in all available bins. To better gauge the quality of the fits, the full theory error (scales and pdf added in quadrature) in each bin is also shown.}\n\\end{figure}\n\nIn fig.~\\ref{fig:slope}(left) we compare the linear fits eq.~(\\ref{eq:beta_y}) to the central value of ${\\rm A_{FB}}$, at NLO and NNLO, with the actual calculated ${\\rm A_{FB}}$ bin values. To give a better perspective for the quality of the linear fit we also show the theoretical error in each bin. From this figure we notice that the predicted asymmetry has similar functional behaviour in NLO and NNLO QCD. The ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ functional dependence is likely not linear and the departure from linearity appears to be slowly growing with ${\\vert\\Delta y\\vert}$. Due to the relatively large size of the NLO error the deviation from linearity could be ignored at NLO. At NNLO, however, this deviation is more significant as it appears comparable to the size of the theory error.\n\nThe CDF collaboration has recently measured the slope of ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ in dilepton final states \\cite{CDF:NoteAFBslope}. The measured slope is $\\alpha_y^{\\rm CDF(\\ell\\ell)}=0.14 \\pm 0.15$ which agrees with the NNLO QCD prediction eq.~(\\ref{eq:beta_y}). The latest CDF combination \\cite{CDF:NoteAFBslope} yields $\\alpha_y^{\\rm CDF({\\rm comb})}=0.227 \\pm 0.057$ and is $2\\sigma$ above NNLO QCD (\\ref{eq:beta_y}). The latest D\\O\\ measurement \\cite{Abazov:2014cca} in lepton-plus-jets final state $\\alpha_y^{\\rm D\\O }= 0.154 \\pm 0.043$ is consistent with the NNLO QCD prediction eq.~(\\ref{eq:beta_y}).\n\nThe differential distribution $d\\sigma/d{\\Delta y}$ is divided into eight equal-width bins. The two end-bins with largest ${\\vert\\Delta y\\vert}$ contain overflow events. The theoretical prediction through NNLO QCD is shown in fig.~\\ref{fig:afb-y}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-y}, and compared with available data from the CDF \\cite{Aaltonen:2012it} collaboration. We also plot the data normalised to the central NNLO QCD prediction as well as the NLO and NNLO K-factors.\n\nSimilarly to the ${\\vert\\Delta y\\vert}$ dependent ${\\rm A_{FB}}$, we notice that perturbative convergence is present in this distribution: the NNLO K-factor is much flatter than the NLO one and its size is smaller. Moreover, the NNLO result has significantly smaller errors than the NLO one (by about a factor of two) and the NNLO error band is consistent with the NLO one.\n\nThe level of agreement between NNLO QCD and CDF data appears to be much better than that for the related differential asymmetry. Indeed, in most of the bins data and theory are consistent within errors, and in the bins where discrepancy is present it is below $1.5 \\sigma$. We hope this result may prove useful in future analyses of the asymmetry in this observable. \n\nThe MC error on the differential asymmetry ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ is below 1\\% in each bin. The MC error on the differential distribution $d\\sigma/d{\\Delta y}$ is around couple of permil in each bin. Such high-precision in the calculation of the differential asymmetry could not be achieved by simply subtracting the corresponding bins of the differential distribution. To that end we have performed an independent, high-precision calculation of the asymmetric contributions in each bin of the differential distribution. Only then it is possible to extract an asymmetry with small statistical error. In practise, we do not need to compute only the asymmetric contribution to each bin; we still allow some symmetric contributions as long as they are not numerically dominant over the asymmetric ones. Excluding the main symmetric contributions to the differential distribution like the LO one and the $gg$-initiated partonic channels turns out to be sufficient for this purpose.\n\n\n\n\\subsection{${m_{t\\bar t}}$ distribution and asymmetry}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-mtt} The differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ (left) and related differential asymmetry ${\\rm A_{FB}}({m_{t\\bar t}})$ (right). Comparison includes SM theory through NNLO QCD and CDF and D\\O\\ data. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\nIn fig.~\\ref{fig:afb-mtt}(right) we show the ${m_{t\\bar t}}$ dependence of ${\\rm A_{FB}}$ (see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-mtt}). We use the same bins as in Ref.~\\cite{Czakon:2014xsa} which, in turn, match the bins of the CDF analysis \\cite{Aaltonen:2012it}. \n\nThe differential asymmetry is divided into four equal-width bins. The bins with lowest/largest ${m_{t\\bar t}}$ contain overflow events. The theoretical prediction through NNLO QCD is compared in fig.~\\ref{fig:afb-mtt}(right) with data from CDF \\cite{Aaltonen:2012it} and D\\O\\ \\cite{Abazov:2014cca,D0:public} collaborations. We also present the data normalised to the central NNLO QCD prediction as well as the NNLO K-factor (the NLO K-factor is not defined for ${\\rm A_{FB}}$ since the LO result is zero).\n\nThe K-factor $K_{\\rm NNLO}$ is decreasing with ${m_{t\\bar t}}$: close to threshold it is as large as 30\\% and decreases to around 10\\% in the highest ${m_{t\\bar t}}$ bin. The estimated error of the NNLO result is significantly smaller than the NLO one (by about a factor of three or even more at high ${m_{t\\bar t}}$). We also notice that the NNLO error band is fully contained within the NLO one. We conclude that this observable possesses good perturbative convergence.\n\nThe comparison between the NNLO theory prediction for ${\\rm A_{FB}}$ and data has already been discussed in Ref.~\\cite{Czakon:2014xsa}. Here we will only note the near-perfect agreement of NNLO QCD with the D\\O\\ data (only one of the four bins shows a deviation, which is slightly above $1 \\sigma$) and that the CDF measurement tends to be higher than NNLO QCD: the two agree in the bin with smallest ${m_{t\\bar t}}$ while in the other three bins CDF data is above theory by up to about $2 \\sigma$.\n\nAs was the case for ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$, a compact way for presenting the ${m_{t\\bar t}}$-differential asymmetry is through its slope. The least-squares linear fit to the QCD prediction, without any assumption on its behaviour at absolute threshold ${m_{t\\bar t}}=2m_t$, reads:\n\n\n", "itemtype": "equation", "pos": 44981, "prevtext": "\n\nThe binning function $\\theta_{\\mathrm{bin}}$ takes values zero or unity such that it restricts the kinematics of the $t\\bar t$ pair to the corresponding bins (defined in the following). Setting $\\theta_{\\mathrm{bin}}=1$ in eq.~(\\ref{eq:AFB-diff}) yields the inclusive asymmetry ${\\rm A_{FB}}$. \n\nAn alternative definition for the inclusive ${\\rm A_{FB}}$ was considered in Ref.~\\cite{Czakon:2014xsa} (such that the numerator/denominator ratio is expanded in powers of ${\\alpha_S}$). Since in this work we do not show any new result for the inclusive ${\\rm A_{FB}}$ we do not need to introduce this definition here.\n\nUnlike Ref.~\\cite{Czakon:2014xsa}, in this work we include the pdf error (derived as described in sec.~\\ref{sec:dif-dist}). As anticipated in Ref.~\\cite{Czakon:2014xsa}, the ${\\rm A_{FB}}$ pdf error is negligible when compared to the scale error.\n\n\n\\subsection{${\\Delta y}$ differential distribution and asymmetry}\\label{sec:afb-y}\n\n\nIn fig.~\\ref{fig:afb-y} we show the ${\\vert\\Delta y\\vert}$ dependence of ${\\rm A_{FB}}$ (right; see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-y}) and the corresponding differential distribution $d\\sigma/d{\\Delta y}$ (left; see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-y}). We use the same bins as Ref.~\\cite{Czakon:2014xsa} which, in turn, match the CDF bins in Ref.~\\cite{Aaltonen:2012it}. \n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-y} The differential distribution $d\\sigma/d{\\Delta y}$ (left) and related differential asymmetry ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ (right). Comparison includes SM theory through NNLO QCD and CDF and D\\O\\ data. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\n\nThe differential asymmetry is divided into four equal-width bins. The bin with highest ${\\vert\\Delta y\\vert}$ contains overflow events. The theoretical prediction through NNLO QCD is shown in fig.~\\ref{fig:afb-y}(right), see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-y}, and compared with data from CDF \\cite{Aaltonen:2012it} and D\\O\\ \\cite{Abazov:2014cca,D0:public} collaborations. We also plot the data normalised to the central NNLO QCD prediction as well as the NNLO K-factor (the NLO K-factor is not defined for ${\\rm A_{FB}}$ since the LO result is zero).\n\nWe notice that the K-factor is nearly constant with ${\\vert\\Delta y\\vert}$ and, at around 25\\%, is rather sizeable. Looking at the estimated errors, we notice that the NNLO result has significantly smaller errors than the NLO one (by about a factor of three) and moreover the NNLO error band is fully contained within the NLO one. This feature demonstrates that this observable possesses good perturbative convergence.\n\nThe comparison between NNLO theory predictions for ${\\rm A_{FB}}$ and data has already been discussed in Ref.~\\cite{Czakon:2014xsa}. Its main feature is the agreement of NNLO QCD with the D\\O\\ data while the CDF measurement is higher than theory. The significance of this discrepancy is between $1 \\sigma$ and $2 \\sigma$. With the exception of the bin with highest ${\\vert\\Delta y\\vert}$, the significance of the discrepancy seems to be growing with ${\\vert\\Delta y\\vert}$.\n\nA compact way of presenting the ${\\vert\\Delta y\\vert}$ dependence of ${\\rm A_{FB}}$ is through its slope \\cite{Aaltonen:2012it}. The least-squares linear fit to the NNLO QCD prediction, assuming zero intercept, reads:\n\n\n", "index": 11, "text": "\\begin{equation}\n{\\rm A_{FB}}({\\vert\\Delta y\\vert}) = \\alpha_y{\\vert\\Delta y\\vert}, ~~{\\rm where} ~~ \\alpha_y = 0.114^{+0.006}_{-0.012}\\,.\n\\label{eq:beta_y}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{\\rm A_{FB}}({|\\Delta y|})=\\alpha_{y}{|\\Delta y|},~{}~{}{\\rm where}~{}~{}%&#10;\\alpha_{y}=0.114^{+0.006}_{-0.012}\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>FB</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>y</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>α</mi><mi>y</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>y</mi></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo rspace=\"9.1pt\">,</mo><mrow><mrow><mpadded width=\"+6.6pt\"><mi>where</mi></mpadded><mo>⁢</mo><msub><mi>α</mi><mi>y</mi></msub></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msubsup><mn>0.114</mn><mrow><mo>-</mo><mn>0.012</mn></mrow><mrow><mo>+</mo><mn>0.006</mn></mrow></msubsup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nand the values of the pair of coefficients $\\alpha_M$ and $\\beta_M$ for the central, lowest and highest predicted values are given in table~\\ref{tab:slope}.\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c | c | c | c |}\n\\hline\n & ${\\rm NLO_{cent}}$ & ${\\rm NLO_{min}}$ & ${\\rm NLO_{max}}$  & ${\\rm NNLO_{cent}}$ & ${\\rm NNLO_{min}}$ & ${\\rm NNLO_{max}}$ \\\\ \\hline\n$\\alpha_M \\times 10^{3}{\\, \\rm GeV}$ & 0.377 & 0.255 & 0.709 & 0.404 & 0.364 & 0.405 \\\\ \\hline\n$\\beta_M$ & -0.111 & -0.070 & -0.235 & -0.106 & -0.097 & -0.101 \\\\ \\hline\n\\end{tabular}\n\\caption{\\label{tab:slope} Values of the pairs of coefficients $(\\alpha_M, \\beta_M)$ from eq.~(\\ref{eq:beta_M}) for the central/lowest/maximal computed bin values in NLO and NNLO QCD.}\n\\end{center}\n\\end{table}\n\n\nIn fig.~\\ref{fig:slope}(right) we compare the linear fits eq.~(\\ref{eq:beta_M}) to the central value of ${\\rm A_{FB}}$, at NLO and NNLO, with the calculated central ${\\rm A_{FB}}$ bin values. To give a better perspective for the quality of the linear fit we also show the theoretical error in each bin. We conclude that the ${m_{t\\bar t}}$ functional dependence of ${\\rm A_{FB}}$ is consistent with being linear in this ${m_{t\\bar t}}$ range.\n\n\nThe CDF collaboration has measured \\cite{Aaltonen:2012it} the slope of ${\\rm A_{FB}}({m_{t\\bar t}})$ and found the value $\\alpha_M^{\\rm CDF}=1.55\\pm 0.48 ~[10^{-3}{\\, \\rm GeV}^{-1}]$ which is higher than the NNLO QCD prediction eq.~(\\ref{eq:beta_M}) (a direct comparison between the two should be done with caution, however, because the intercept $\\beta_M$ was not specified in Ref.~\\cite{Aaltonen:2012it}). The corresponding D\\O\\ slope \\cite{Abazov:2014cca} reads $\\alpha_M^{\\rm D\\O }= 0.39~[10^{-3}{\\, \\rm GeV}^{-1}]$ (with $\\beta_M=-0.055$). We do not quote the errors of the measurement; for those we refer the reader to Ref.~\\cite{Abazov:2014cca}. The slope $\\alpha_M^{\\rm D\\O }$ is consistent with the NNLO QCD prediction in eq.~(\\ref{eq:beta_M}).\n\nThe differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ is divided into ten bins as shown in fig.~\\ref{fig:afb-mtt}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-mtt}. The two bins with largest ${m_{t\\bar t}}$ contain overflow events. We note the slight difference in the binning between the differential distribution in fig.~\\ref{fig:afb-mtt}(left) and the differential asymmetry fig.~\\ref{fig:afb-mtt}(right): we make the contribution from the bin $250{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 350{\\, \\rm GeV}$ explicit in fig.~\\ref{fig:afb-mtt}(left) while, in order to match the binning of the CDF ${\\rm A_{FB}}$ analysis, have absorbed it into the $350{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 450{\\, \\rm GeV}$ bin in fig.~\\ref{fig:afb-mtt}(right).\n\nWe observe that the NLO and NNLO K-factors of the differential distribution have reasonably similar shapes and $K_{\\rm NNLO}$ is smaller than $K_{\\rm NLO}$. Similarly to the other differential distributions considered above, the NNLO error band is smaller than the NLO one (by about a factor of two) and the NNLO result is consistent with the error estimate of the NLO QCD prediction. These features indicate good perturbative convergence in this observable.\n\n\nThe MC error on the differential asymmetry ${\\rm A_{FB}}({m_{t\\bar t}})$ is below 1\\% in each bin. The MC error on the differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ is around 1\\% in the two central bins with $250{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 350{\\, \\rm GeV}$ and below 4 permil in the remaining bins. Such high-precision in the calculation of the differential asymmetry is achieved following the strategy for the calculation of ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ described in sec.~\\ref{sec:afb-y}.\n\n\n\n\\subsection{The first Legendre moment of the $\\cos\\theta$ distribution}\\label{sec:afb-legmom}\n\n\nAs an alternative way at looking at the top-quark ${\\rm A_{FB}}$, the CDF collaboration measured \\cite{CDF:2013gna} the Legendre Moments of the differential distribution $d\\sigma/d\\cos\\theta$. The main idea is based on the realisation that the forward-backward asymmetry is almost exclusively confined to the first Legendre moment, thus offering an alternative assessment of this asymmetry. In sec.~\\ref{sec:costheta} we described the calculation of the NNLO QCD correction to these moments. The results can  be found in fig.~\\ref{fig:costheta}(right) as well as appendix~\\ref{sec:appendix} table~\\ref{tab:legmom}. We observe that the CDF measurement of $a_1$ is about $1.7 \\sigma$ above the theory prediction after {\\it naively} accounting for EW corrections. As can be anticipated from the inclusive ${\\rm A_{FB}}$, NNLO QCD and EW corrections each decrease this discrepancy.\n\n\n\n\\subsection{${p_{T,t\\bar t}}$ distribution and differential asymmetry}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-PTT-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-PTT-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-pt} The differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ (left) and related differential asymmetry ${\\rm A_{FB}}({p_{T,t\\bar t}})$ (right). Included is SM theory through NNLO QCD. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\nIn the following we study the ${p_{T,t\\bar t}}$-dependent forward-backward asymmetry which is of special theoretical interest. The NLO and NNLO QCD prediction for the asymmetry is shown in fig.~\\ref{fig:afb-pt}(right) and in appendix~\\ref{sec:appendix} table~\\ref{tab:afb-ptt}. We use the same bins as in Ref.~\\cite{Czakon:2014xsa} that, in turn, match the bins of the CDF analysis \\cite{Aaltonen:2012it} (however no parton-level results for ${\\rm A_{FB}}({p_{T,t\\bar t}})$ that we could compare to have been published). The differential asymmetry is divided into eight equal-width bins. The bin with largest ${p_{T,t\\bar t}}$ contains overflow events. \n\nThe shape of the ${p_{T,t\\bar t}}$-asymmetry for ${p_{T,t\\bar t}}>0$ can be derived with purely NLO calculation in the process ($t\\bar t j$) and that part of the asymmetry has been understood for quite some time \\cite{Dittmaier:2007wz}. We have verified in Ref.~\\cite{Czakon:2014xsa} the consistency of our inclusive $t\\bar t$ NNLO calculation with NLO $t\\bar t j$ predictions from Refs.~\\cite{Melnikov:2010iu,Melnikov:2011qx,Hoeche:2013mua} and found perfect agreement with an independent evaluation performed with the package \\textsc{Helac-Nlo} \\cite{Bevilacqua:2011xh}. The difference between NNLO and NLO corrections to the ${p_{T,t\\bar t}}$ asymmetry for ${p_{T,t\\bar t}}\\geq 10 {\\, \\rm GeV}$ follows the pattern noticed in CDF data \\cite{Aaltonen:2012it} and is, moreover, consistent with the analysis of Ref.~\\cite{Gripaios:2013rda}.\n\nFor reference, the differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ is shown in fig.~\\ref{fig:afb-pt}(left) as well as in appendix~\\ref{sec:appendix} table~\\ref{tab:diff-ptt}. It is divided into sixteen bins of equal width and the two bins with largest ${p_{T,t\\bar t}}$ contain overflow events. As for the differential asymmetry, the behaviour of this distribution away from the point ${p_{T,t\\bar t}}=0$ is well understood and has been extensively studied in the context of $t\\bar t j$ production in NLO QCD \\cite{Dittmaier:2007wz,Melnikov:2010iu,Melnikov:2011qx,Hoeche:2013mua}. In particular, we do not show the LO QCD contribution since it enters only the two central bins containing the point ${p_{T,t\\bar t}}=0$. The corresponding prediction can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:diff-ptt}.\n\nThe relative MC error on the central value of the differential asymmetry ${\\rm A_{FB}}({p_{T,t\\bar t}})$ is below 1\\% in each of the eight bins. In some of the bins,  and for some scale choices, the predicted bin asymmetry becomes very close to zero (see fig.~\\ref{fig:afb-pt}(right)) and, as can be anticipated, in such cases the relative MC error becomes much larger. Such large relative MC errors, however, are harmless and do not adversely impact the error estimate in the corresponding bins. The rather asymmetric error in the first bin $0\\leq{p_{T,t\\bar t}}\\leq 10{\\, \\rm GeV}$ is not due to statistical effects since in this bin the relative MC error is at the sub-permil level for all $\\mu_{F,R}$ values. The relative MC error on the differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ is below 4 permil in all bins. The calculation of the differential asymmetry follows the strategy for minimising the MC error described in sec.~\\ref{sec:afb-y}.\n\n\n\n\\subsection{${p_{T,t\\bar t}}$ cumulative asymmetry}\n\n\nOne of the unexpected findings of Ref.~\\cite{Czakon:2014xsa} was that the NNLO QCD corrections to the inclusive ${\\rm A_{FB}}$ were significant, much larger than what had been anticipated from arguments based on soft-gluon resummation \\cite{Almeida:2008ug,Ahrens:2011uf}. These soft-gluon-based predictions are compatible with the parton shower based analysis of the top-quark ${\\rm A_{FB}}$ performed in Ref.~\\cite{Skands:2012mm} but not with the soft-gluon resummation prediction of Ref.~\\cite{Kidonakis:2011zn}, which are larger (and recently updated in Ref.~\\cite{Kidonakis:2015ona}). We presume the difference in the predictions between Ref.~\\cite{Kidonakis:2011zn} and Refs.~\\cite{Almeida:2008ug,Ahrens:2011uf} is due to different subleading terms. This is an often present ambiguity in resummed calculations matched to fixed order results of lower accuracy (NLO in this case). Our viewpoint on such subtleties has been explained at length in Ref.~\\cite{Cacciari:2011hy}; further discussion of this problem goes beyond the scope of this paper.\n\nA detailed comparison between the NNLO QCD corrections to ${\\rm A_{FB}}$ and the soft-gluon resummation based predictions was performed in Ref.~\\cite{Czakon:2014xsa} and we do not repeat it here. Our goal in the following is to elaborate on an observation made in Ref.~\\cite{Czakon:2014xsa}, namely, that the difference between the NNLO fixed order predictions and the ones based on soft-gluon resummation matched to NLO could potentially be understood by considering the ${p_{T,t\\bar t}}$ differential asymmetry. The physics behind this idea is the following: soft-gluon resummation in $t\\bar t$ production applies to kinematic configurations which are of almost 2-to-2 type, i.e. configurations where the final state consists of a top pair which takes almost all the energy available to the partonic reaction and is, possibly, accompanied by very soft radiation that carries very little energy. Since the initial state has zero transverse momentum, one necessarily arrives at kinematic configurations consisting of $t\\bar t$ pairs with small ${p_{T,t\\bar t}}$. It is hard to quantify on purely theoretical grounds how small that ${p_{T,t\\bar t}}$ would be, but as a guidance one can use the fact that the top pair $p_T$ is peaked below $10{\\, \\rm GeV}$ \\cite{Mrenna:1996cz,Li:2013mia}. Thus we expect that the bulk of the contributions from soft gluon resummation would be at small ${p_{T,t\\bar t}}$ (presumably in the first bin $0\\leq{p_{T,t\\bar t}}\\leq 10{\\, \\rm GeV}$) and will be decreasing fast with ${p_{T,t\\bar t}}$.\n\n\\footnote{One should keep in mind that in practise, implementations of soft gluon resummation typically generate noticeable contributions even in kinematical regions that are far from the relevant partonic threshold. We are not concerned with such effects here.}\n\n\nTo that end we define the {\\it cumulative} forward-backward asymmetry ${\\hat A}_{\\rm FB}({p_{T,t\\bar t}}^{\\rm cut})$. It has a single bin of variable width ${p_{T,t\\bar t}}^{\\rm cut}$, where $0\\leq{p_{T,t\\bar t}}\\leq {p_{T,t\\bar t}}^{\\rm cut}\\,\\,$, and\n\n\n", "itemtype": "equation", "pos": 52352, "prevtext": "\n\nThe error in eq.~(\\ref{eq:beta_y}) includes both scale and pdf variation, although the contribution from the pdf error is marginal (its omission would only change the ``+\"-error in (\\ref{eq:beta_y}) from 0.006 to 0.005). The slope in NLO QCD reads $\\alpha_y^{\\rm NLO} = 0.092^{+0.042}_{-0.022}$.\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-Y-slope-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-slope-eps-converted-to.pdf}\n\\caption{\\label{fig:slope} A least-squares linear fit (see text) to the central values of the NLO and NNLO QCD ${\\vert\\Delta y\\vert}$ (left) and ${m_{t\\bar t}}$ (right) asymmetries versus the exact calculation in all available bins. To better gauge the quality of the fits, the full theory error (scales and pdf added in quadrature) in each bin is also shown.}\n\\end{figure}\n\nIn fig.~\\ref{fig:slope}(left) we compare the linear fits eq.~(\\ref{eq:beta_y}) to the central value of ${\\rm A_{FB}}$, at NLO and NNLO, with the actual calculated ${\\rm A_{FB}}$ bin values. To give a better perspective for the quality of the linear fit we also show the theoretical error in each bin. From this figure we notice that the predicted asymmetry has similar functional behaviour in NLO and NNLO QCD. The ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ functional dependence is likely not linear and the departure from linearity appears to be slowly growing with ${\\vert\\Delta y\\vert}$. Due to the relatively large size of the NLO error the deviation from linearity could be ignored at NLO. At NNLO, however, this deviation is more significant as it appears comparable to the size of the theory error.\n\nThe CDF collaboration has recently measured the slope of ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ in dilepton final states \\cite{CDF:NoteAFBslope}. The measured slope is $\\alpha_y^{\\rm CDF(\\ell\\ell)}=0.14 \\pm 0.15$ which agrees with the NNLO QCD prediction eq.~(\\ref{eq:beta_y}). The latest CDF combination \\cite{CDF:NoteAFBslope} yields $\\alpha_y^{\\rm CDF({\\rm comb})}=0.227 \\pm 0.057$ and is $2\\sigma$ above NNLO QCD (\\ref{eq:beta_y}). The latest D\\O\\ measurement \\cite{Abazov:2014cca} in lepton-plus-jets final state $\\alpha_y^{\\rm D\\O }= 0.154 \\pm 0.043$ is consistent with the NNLO QCD prediction eq.~(\\ref{eq:beta_y}).\n\nThe differential distribution $d\\sigma/d{\\Delta y}$ is divided into eight equal-width bins. The two end-bins with largest ${\\vert\\Delta y\\vert}$ contain overflow events. The theoretical prediction through NNLO QCD is shown in fig.~\\ref{fig:afb-y}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-y}, and compared with available data from the CDF \\cite{Aaltonen:2012it} collaboration. We also plot the data normalised to the central NNLO QCD prediction as well as the NLO and NNLO K-factors.\n\nSimilarly to the ${\\vert\\Delta y\\vert}$ dependent ${\\rm A_{FB}}$, we notice that perturbative convergence is present in this distribution: the NNLO K-factor is much flatter than the NLO one and its size is smaller. Moreover, the NNLO result has significantly smaller errors than the NLO one (by about a factor of two) and the NNLO error band is consistent with the NLO one.\n\nThe level of agreement between NNLO QCD and CDF data appears to be much better than that for the related differential asymmetry. Indeed, in most of the bins data and theory are consistent within errors, and in the bins where discrepancy is present it is below $1.5 \\sigma$. We hope this result may prove useful in future analyses of the asymmetry in this observable. \n\nThe MC error on the differential asymmetry ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ is below 1\\% in each bin. The MC error on the differential distribution $d\\sigma/d{\\Delta y}$ is around couple of permil in each bin. Such high-precision in the calculation of the differential asymmetry could not be achieved by simply subtracting the corresponding bins of the differential distribution. To that end we have performed an independent, high-precision calculation of the asymmetric contributions in each bin of the differential distribution. Only then it is possible to extract an asymmetry with small statistical error. In practise, we do not need to compute only the asymmetric contribution to each bin; we still allow some symmetric contributions as long as they are not numerically dominant over the asymmetric ones. Excluding the main symmetric contributions to the differential distribution like the LO one and the $gg$-initiated partonic channels turns out to be sufficient for this purpose.\n\n\n\n\\subsection{${m_{t\\bar t}}$ distribution and asymmetry}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-MTT-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-mtt} The differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ (left) and related differential asymmetry ${\\rm A_{FB}}({m_{t\\bar t}})$ (right). Comparison includes SM theory through NNLO QCD and CDF and D\\O\\ data. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\nIn fig.~\\ref{fig:afb-mtt}(right) we show the ${m_{t\\bar t}}$ dependence of ${\\rm A_{FB}}$ (see also appendix~\\ref{sec:appendix} table~\\ref{tab:afb-mtt}). We use the same bins as in Ref.~\\cite{Czakon:2014xsa} which, in turn, match the bins of the CDF analysis \\cite{Aaltonen:2012it}. \n\nThe differential asymmetry is divided into four equal-width bins. The bins with lowest/largest ${m_{t\\bar t}}$ contain overflow events. The theoretical prediction through NNLO QCD is compared in fig.~\\ref{fig:afb-mtt}(right) with data from CDF \\cite{Aaltonen:2012it} and D\\O\\ \\cite{Abazov:2014cca,D0:public} collaborations. We also present the data normalised to the central NNLO QCD prediction as well as the NNLO K-factor (the NLO K-factor is not defined for ${\\rm A_{FB}}$ since the LO result is zero).\n\nThe K-factor $K_{\\rm NNLO}$ is decreasing with ${m_{t\\bar t}}$: close to threshold it is as large as 30\\% and decreases to around 10\\% in the highest ${m_{t\\bar t}}$ bin. The estimated error of the NNLO result is significantly smaller than the NLO one (by about a factor of three or even more at high ${m_{t\\bar t}}$). We also notice that the NNLO error band is fully contained within the NLO one. We conclude that this observable possesses good perturbative convergence.\n\nThe comparison between the NNLO theory prediction for ${\\rm A_{FB}}$ and data has already been discussed in Ref.~\\cite{Czakon:2014xsa}. Here we will only note the near-perfect agreement of NNLO QCD with the D\\O\\ data (only one of the four bins shows a deviation, which is slightly above $1 \\sigma$) and that the CDF measurement tends to be higher than NNLO QCD: the two agree in the bin with smallest ${m_{t\\bar t}}$ while in the other three bins CDF data is above theory by up to about $2 \\sigma$.\n\nAs was the case for ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$, a compact way for presenting the ${m_{t\\bar t}}$-differential asymmetry is through its slope. The least-squares linear fit to the QCD prediction, without any assumption on its behaviour at absolute threshold ${m_{t\\bar t}}=2m_t$, reads:\n\n\n", "index": 13, "text": "\\begin{equation}\n{\\rm A_{FB}}({m_{t\\bar t}}) = \\alpha_M{m_{t\\bar t}} + \\beta_M \\,,\n\\label{eq:beta_M}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm A_{FB}}({m_{t\\bar{t}}})=\\alpha_{M}{m_{t\\bar{t}}}+\\beta_{M}\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>FB</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>m</mi><mrow><mi>t</mi><mo>⁢</mo><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">¯</mo></mover></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>α</mi><mi>M</mi></msub><mo>⁢</mo><msub><mi>m</mi><mrow><mi>t</mi><mo>⁢</mo><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">¯</mo></mover></mrow></msub></mrow><mo>+</mo><mpadded width=\"+1.7pt\"><msub><mi>β</mi><mi>M</mi></msub></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05375.tex", "nexttext": "\n\nEq.~(\\ref{eq:AcumulFB-diff}) implicitly defines a cumulative numerator $\\hat N$ and denominator $\\hat D$ (in units of $pb$). For example, ${\\hat A}_{\\rm FB}(10{\\, \\rm GeV})$ corresponds to the first (leftmost) bin of ${\\rm A_{FB}}$ in fig.~\\ref{fig:afb-pt}(right), while ${\\hat A}_{\\rm FB}(80{\\, \\rm GeV})$ corresponds to the inclusive asymmetry (recall that the last bin contains also the overflow events with ${p_{T,t\\bar t}}\\geq 80{\\, \\rm GeV}$). The cumulative asymmetry may be better suited for studying the ${p_{T,t\\bar t}}$ dependence since it is not as singular as the usual ${p_{T,t\\bar t}}$ differential asymmetry (because in any bin corrections from all relevant perturbative orders contribute).\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.0\\textwidth]{Tev-afb-cumul-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-cumul} NLO and NNLO QCD corrections to the cumulative numerator, denominator and asymmetry defined in eq.~(\\ref{eq:AcumulFB-diff}). The visible non-smoothness of the lines reflects the $10{\\, \\rm GeV}$ binning of the underlying calculation. The presence of overflow events in the highest bin is clearly noticeable. The values at ${p_{T,t\\bar t}}=80{\\, \\rm GeV}$ correspond to the inclusive numerator, denominator and asymmetry.}\n\\end{figure}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c || c | c | c | c | c | c | c | c |}\n\\hline\n${p_{T,t\\bar t}}~ [{\\, \\rm GeV}]$ & 10 & 20 & 30 & 40 & 50 & 60 & 70 & $\\geq$ 80 \\\\ \\hline\\hline\n${\\hat N}^{\\rm NLO}$ [pb] & 0.618 &  0.524 &  0.479 &  0.453 &  0.436 &  0.425 &  0.417 &  0.394 \\\\ \\hline\n${\\hat N}^{\\rm NNLO}$ [pb] & 0.623 &  0.610 &  0.588 &  0.571 &  0.559 &  0.550 &  0.544 &  0.526 \\\\ \\hline\n${\\hat D}^{\\rm NLO}$ [pb] & 4.164 &  5.378 &  5.876 &  6.142 &  6.303 &  6.407 &  6.479 &  6.682 \\\\ \\hline\n${\\hat D}^{\\rm NNLO}$ [pb] & 3.793 &  5.276 &  5.932 &  6.290 &  6.508 &  6.649 &  6.745 &  7.005 \\\\ \\hline\n${\\hat A}_{\\rm FB}^{\\rm NLO}$ & 0.148 &  0.097 &  0.082 &  0.074 &  0.069 &  0.066 &  0.064 &  0.059 \\\\ \\hline\n${\\hat A}_{\\rm FB}^{\\rm NNLO}$ & 0.164 &  0.116 &  0.099 &  0.091 &  0.086 &  0.083 &  0.081 &  0.075 \\\\ \\hline\n\\end{tabular}\n\\caption{\\label{tab:afb-cumul} Values for the cumulative numerator, denominator and asymmetry appearing in fig.~\\ref{fig:afb-cumul}.}\n\\end{center}\n\\end{table}\n\nThe results for the cumulative numerator, denominator and asymmetry are shown in fig.~\\ref{fig:afb-cumul} and table~\\ref{tab:afb-cumul}. Fig.~\\ref{fig:afb-cumul} clearly demonstrates the observation made in Ref.~\\cite{Czakon:2014xsa}: the numerator $\\hat N$ receives tiny NNLO correction for small ${p_{T,t\\bar t}}\\,$ (in particular in the first bin ${p_{T,t\\bar t}}\\leq 10{\\, \\rm GeV}$), and the difference in ${\\rm A_{FB}}$ is solely due to the change in the denominator $\\hat D$. Therefore, since the denominator is itself symmetric in ${\\Delta y}$ (see eq.~(\\ref{eq:AcumulFB-diff})), the intrinsic asymmetry in this bin is the same in NLO and NNLO QCD. Once one goes to higher ${p_{T,t\\bar t}}\\,$ the NNLO correction to $\\hat N$ grows fast while the rate of change in the denominator $\\hat D$ is much slower. From this we conclude that the difference between the inclusive ${\\rm A_{FB}}$ computed in NNLO and NLO QCD originates from events that are accompanied by hard radiation, or at least radiation that is harder than what is required for being in the soft-gluon resummation regime. It seems to us that a measurement of the cumulative ${\\rm A_{FB}}$ might be very beneficial also because the difference between NNLO and NLO corrections is very weakly dependent on ${p_{T,t\\bar t}}\\,$ which might allow for more conclusive separation of higher order effects in this observable.\n\n\n\n\\subsection{${m_{t\\bar t}}$ cumulative asymmetry}\\label{sec:Mtt-cumulative}\n\n\nThe ${m_{t\\bar t}}$ cumulative asymmetry ${\\hat A}_{\\rm FB}({m_{t\\bar t}} > {m_{t\\bar t}}^{\\rm cut})$ has recently been discussed in Ref.~\\cite{Wang:2015lna}. In fig.~\\ref{fig:Mtt-cumulative} we present the predictions for this asymmetry in NLO and NNLO QCD (with unexpanded numerator and denominator) as well as two predictions from Ref.~\\cite{Wang:2015lna}. \n\nThe first prediction of Ref.~\\cite{Wang:2015lna} is based on conventional scale-setting; it differs from our NLO calculation in the inclusion of EW corrections, the use of expanded definition for the asymmetry as well as minor differences due to value of $m_t$ and different pdf set. Although our predictions cannot be compared directly, it is clear from fig.~\\ref{fig:Mtt-cumulative} that the predictions are rather similar. A detailed comparison between inclusive ${\\rm A_{FB}}$ predictions based on expanded and unexpanded ${\\rm A_{FB}}$ definition, and with/without EW corrections, can be found in Ref.~\\cite{Czakon:2014xsa}.\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.0\\textwidth]{Tev-Mtt-cumulative-eps-converted-to.pdf}\n\\caption{\\label{fig:Mtt-cumulative} Predictions for the ${m_{t\\bar t}}$ cumulative asymmetry: pure QCD at NLO and NNLO (as derived in this work),  NLO prediction of Ref.~\\cite{Wang:2015lna} including EW corrections, as well as the PMC scale-setting prediction of Ref.~\\cite{Wang:2015lna}.}\n\\end{figure}\n\n\nThe second prediction of Ref.~\\cite{Wang:2015lna} is based on the PMC/BLM scale-setting procedure. As already pointed out in Ref.~\\cite{Wang:2015lna} the conventional and PMC predictions are substantially different from each other. This difference in behaviours is mainly due to the qualitatively different scale at which the renormalised coupling is evaluated in the two approaches. In the conventional scale-setting approach used by us, $\\mu_R$ is set to $m_t$ while in the PMC approach $\\mu_R$ depends strongly on ${m_{t\\bar t}}$ (see table {\\rm III} in Ref.~\\cite{Wang:2015lna}): as ${m_{t\\bar t}}$ increases from threshold to around 800 ${\\, \\rm GeV}$, the renormalisation scale at first strongly decreases and then starts to grow fast again. Its minimum is reached around ${m_{t\\bar t}}\\sim 500{\\, \\rm GeV}$ where it is smaller than the value at threshold by a factor of almost four. The maximal value for $\\mu_R$ is reached at maximal ${m_{t\\bar t}}$ where the scale is larger than its threshold value. Such a behaviour is easily contrasted with the conventional scale-setting approach where, even for dynamic scales, one typically expect a monotonic increase of $\\mu_R$ with increasing ${m_{t\\bar t}}$. Moreover, one expects that in the limited range of ${m_{t\\bar t}}$ used for the calculation of the NNLO result, fixed and dynamic scales would lead to consistent predictions within scale errors (see also recent discussion for the LHC \\cite{Czakon:2015owf}).\n\nWe conclude that the two scale-setting approaches produce very different predictions for the ${m_{t\\bar t}}$ cumulative ${\\hat A}_{\\rm FB}$ and it should be easy to distinguish between the two with data, especially in the region around ${m_{t\\bar t}}\\sim 500{\\, \\rm GeV}$.  We would also like to point out that the NNLO prediction based on conventional scale-setting with $\\mu_R=m_t$ exhibits the ``increasing-decreasing\" behaviour pointed out in Ref.~\\cite{Wang:2015lna}, albeit much less pronounced than in the PMC scale-setting approach.\n\n\n\n\\section{Comparisons between different pdf sets}\\label{sec:pdf}\n\n\nAn alternative way of assessing the pdf dependence in theory predictions is to compare calculations with different pdf sets. In this section we compare NNLO QCD predictions based on four state-of-the-art pdf sets: CT10, HERA 1.5, MSTW2008 and NNPDF 2.3. We compare the central pdf members for central scale choice $\\mu_F=\\mu_R=m_t$.\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.0\\textwidth]{pdf-compare-eps-converted-to.pdf}\n\\caption{\\label{fig:pdf-compare} NNLO QCD prediction for three differential distributions (in ${m_{t\\bar t}},\\,{p_{T,t}}$ and ${\\vert y_t\\vert}$) with four pdf sets. Given are the ratios of the CT10, HERA 1.5 and NNPDF 2.3 based predictions with respect to MSTW2008. For reference also the scale dependence of the MSTW2008 prediction is shown (red band). For improved visibility, in the lower plots we compare the same predictions with the available data from the D\\O\\ Collaboration~\\cite{Abazov:2014vga}.}\n\\end{figure}\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=1.0\\textwidth]{pdf-compare-norm-eps-converted-to.pdf}\n\\caption{\\label{fig:pdf-compare-norm} As in fig.~\\ref{fig:pdf-compare} but for the normalised to unity distributions.}\n\\end{figure}\n\nIn fig.~\\ref{fig:pdf-compare} we present the ratio of CT10, HERA 1.5 and NNPDF 2.3 with respect to MSTW2008 (the predictions for the latter pdf set could be found in the previous sections). We study the following three differential distributions (with absolute normalisation): ${m_{t\\bar t}},\\,{p_{T,t}}$ and ${\\vert y_t\\vert}$. Additionally, in the upper plots we present the scale error of the MSTW2008 result, while in the lower plots we compare with available data from the D\\O\\ collaboration~\\cite{Abazov:2014vga}.\n\nWe observe that the spread among the pdf sets is comparable to the size of the NNLO scale variation and only the HERA 1.5 prediction lies outside the scale error band. Since in the kinematic range considered in this work pdf error is (much) smaller than the one due to scale variation, it seems that the spread in predictions based on different pdf sets may be not fully compatible with the pdf error estimates of the individual pdf sets. We also observe that all pdf sets agree with the available data. Although the spread of theory predictions is much smaller than the size of the experimental error it could nevertheless be interesting to speculate if the currently available data has the power to constrain pdf.\n\n\nIt was pointed out in Ref.~\\cite{Czakon:2015pga} that a separate fit to normalisation and shapes is desired in pdf studies. Indeed, the absolute normalisation could be affected by systematic effects which are harder to control (one of those, as we pointed out in the previous discussions, is the top mass which affects normalisation and shapes rather differently). In fig.~\\ref{fig:pdf-compare-norm} we compare the predictions for the normalised to unity ${m_{t\\bar t}},\\,{p_{T,t}}$ and ${\\vert y_t\\vert}$ distributions. Unlike the case of absolute normalisations, we now observe a remarkable agreement between all pdf sets in the full kinematic ranges. Moreover, the agreement is within the estimated (from scales) theory error of the MSTW2008 prediction. The latter fact is quite remarkable since the scale error of the normalised predictions is much smaller than the error of the predictions with absolute normalisation and, for most of the kinematical range, is in the 1\\% range. The various pdf sets start to diverge from each other only towards the end-bins. As for the distributions with absolute normalisation, the results for the overflow bins in the ${m_{t\\bar t}}$ and ${p_{T,t}}$ distributions should be interpreted with care given the MC error (not shown) is around 4-5\\% for all pdf sets. On the other hand, the estimated MC error in the last bin of the ${\\vert y_t\\vert}$ distribution is only around 1\\% and therefore the spread observed between the various pdf's in that bin is, likely, a significant effect. The above observations are very interesting in the context of the expectation set in Ref.~\\cite{Czakon:2015pga} that a separate fit to normalisation and shapes is needed in pdf studies as well as the well-appreciated fact that the large-$x$ pdf region can effectively be constrained with top-quark data \\cite{Czakon:2013tha}.\n\nComparisons between various pdf sets, in NLO QCD and for LHC 7 TeV, have recently been performed in Ref.~\\cite{Aad:2014zka}. The results we present in this work represent the first comparison between pdf sets  in full NNLO QCD at the differential level (albeit for a different collider). Our findings are in rough agreement with the ones in Ref.~\\cite{Aad:2014zka} but with one exception: in the normalised ${m_{t\\bar t}}$ comparison of Ref.~\\cite{Aad:2014zka} one can clearly notice that the HERA prediction is distinct (on the scale of the theory error) from the other pdf sets, while in our Tevatron calculation we do not observe such trend. It will be very interesting to clarify the origin of this difference (different perturbative orders versus different colliders) by directly comparing LHC predictions based on different pdf sets. \n\n\n\n\\section{Conclusions}\n\n\n\nIn this work we present a complete set of NNLO QCD predictions for stable top-quark production at the Tevatron. The predictions are for the $y_t,~{m_{t\\bar t}},~{p_{T,t}},~{p_{T,t\\bar t}}$ and $\\cos\\theta$ differential distributions measured by the CDF and D\\O\\ collaborations. We present LO, NLO and NNLO predictions, study the convergence of perturbation theory in each distribution and present the relevant $K$-factors. All results are given in tables for convenience and future use. All distributions are computed with the MSTW2008 pdf set. Additionally we compare predictions for three differential distributions, with both absolute and unit normalisation, derived with four different pdf sets. For distributions with absolute normalisation we observe spread among the different pdf sets which is comparable with the size of the scale error. Normalised distributions, however, show remarkable independence of the choice of pdf set. Such stability may be useful in future analyses, for example, in order to disentangle the dependence on $m_t$. \n\nWe have also presented detailed predictions for many ${\\rm A_{FB}}$-related differential observables. In particular we present predictions for the slopes of the ${\\Delta y}$- and ${m_{t\\bar t}}$-dependent asymmetry and Legendre moments. We also present predictions for the cumulative ${p_{T,t\\bar t}}$ asymmetry which we have used to analyse in depth the origin of NNLO QCD correction to ${\\rm A_{FB}}$. We point out that the ${p_{T,t\\bar t}}$ cumulative asymmetry is much better behaving than the usual ${p_{T,t\\bar t}}$-asymmetry and conclude that a future measurement of this cumulative asymmetry would be valuable. We also present a prediction for the ${m_{t\\bar t}}$ cumulative asymmetry which we compare with a prediction based on the PMC scale-setting approach. The predictions in the conventional and PMC scale-setting approach differ significantly, making it possible for a future measurement to easily distinguish between the two. \n\nWe have made significant effort to derive results with very high quality. Typically, the Monte-Carlo integration error in each bin of the differential distributions is at the few-permil level and is thus totally negligible. For the differential asymmetry the relative MC error is up to around one percent per bin. \n\nThroughout the present work we use fixed scales $\\mu_R=\\mu_F=m_t$ despite that, arguably, running scales are better suited in describing differential distributions. We have several reasons for doing so. The first reason is of technical nature. Secondly, and arguably most importantly, in the limited kinematic ranges considered in the present work, the use of dynamic scales is not strictly required. We expect that the use of dynamic scales would not take the predictions outside of the estimated theory error range. Given also that experimental errors are significantly larger than the theory ones, it does not appear that the question of including dynamic scales will be of relevance to top-physics at the Tevatron.\n\nIn conclusion, our hope is that this work offers a complete set of state-of-the-art theory predictions for top-quark production at the Tevatron which should be up-to-date until, at least, theory predictions for NNLO top-quark production with top-quark decay become available.\n\n\n\n\\begin{acknowledgments}\nWe thank Stefan Dittmaier for kindly providing us with his code for the evaluation of the one-loop virtual corrections. M.C. thanks the CERN Theoretical Physics Department and Emmanuel College Cambridge for hospitality during the completion of this work. A.M. thanks the IPPP and Trevelyan College at Durham University for their hospitality through a COFUND Senior Research Fellowship during the completion of this work. The work of M.C. was supported in part by grants of the DFG and BMBF. The work of D.H. and A.M. is supported by the UK Science and Technology Facilities Council [grants ST/L002760/1 and ST/K004883/1]. \n\\end{acknowledgments}\n\n\n\\appendix\n\n\\section{Tables with theory predictions}\\label{sec:appendix}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${m_{t\\bar t}}$ & \\multicolumn{3}{|c|}{$d\\sigma/d{m_{t\\bar t}}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[240\t ; \t412.5]\t&\t$\t2.78\t^{+\t1.16\t}_{-\t0.75\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.96\t^{+\t0.21\t}_{-\t0.34\t}$$^{+\t0.07\t}_{-\t0.06\t}$$^{+\t0.22\t}_{-\t0.35\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t3.13\t^{+\t0.12\t}_{-\t0.17\t}$$^{+\t0.07\t}_{-\t0.05\t}$$^{+\t0.14\t}_{-\t0.18\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[412.5\t ; \t505]\t&\t$\t2.43\t^{+\t1.08\t}_{-\t0.68\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.47\t^{+\t0.14\t}_{-\t0.28\t}$$^{+\t0.07\t}_{-\t0.05\t}$$^{+\t0.16\t}_{-\t0.29\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.59\t^{+\t0.09\t}_{-\t0.14\t}$$^{+\t0.07\t}_{-\t0.05\t}$$^{+\t0.11\t}_{-\t0.14\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t505\t ; \t615\t]\t&\t$\t9.95\t^{+\t4.74\t}_{-\t2.94\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.20\t^{+\t0.31\t}_{-\t0.99\t}$$^{+\t0.28\t}_{-\t0.18\t}$$^{+\t0.42\t}_{-\t1.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.50\t^{+\t0.35\t}_{-\t0.47\t}$$^{+\t0.26\t}_{-\t0.18\t}$$^{+\t0.44\t}_{-\t0.50\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t615\t ; \t750\t]\t&\t$\t3.27\t^{+\t1.68\t}_{-\t1.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.66\t^{+\t0.06\t}_{-\t0.25\t}$$^{+\t0.09\t}_{-\t0.05\t}$$^{+\t0.11\t}_{-\t0.25\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.73\t^{+\t0.14\t}_{-\t0.12\t}$$^{+\t0.08\t}_{-\t0.06\t}$$^{+\t0.16\t}_{-\t0.14\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[750\t ; \t1200]\t&\t$\t9.21\t^{+\t5.26\t}_{-\t3.08\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t6.20\t^{+\t0.00\t}_{-\t0.88\t}$$^{+\t0.23\t}_{-\t0.14\t}$$^{+\t0.23\t}_{-\t0.89\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t6.36\t^{+\t0.58\t}_{-\t0.30\t}$$^{+\t0.20\t}_{-\t0.15\t}$$^{+\t0.61\t}_{-\t0.34\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t1200\t ; \t$\\infty$\t]\t&\t$\t2.82\t^{+\t2.12\t}_{-\t1.12\t} ~ \\times ~ 10^{\t-4\t}$\t&\t$\t1.07\t^{+\t0.10\t}_{-\t0.78\t} ~ \\times ~ 10^{\t-4\t}$\t&\t$\t1.27\t^{+\t0.47\t}_{-\t0.14\t} ~ \\times ~ 10^{\t-4\t}$\t\\\\\t\\hline\n\n\n\n\\hline\n${m_{t\\bar t}}$ & \\multicolumn{3}{|c|}{$(1/\\sigma)d\\sigma/d{m_{t\\bar t}}$ [1/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[240 ; 412.5]\t&\t$\t4.20\t^{+\t0.07\t}_{-\t0.07\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t4.44\t^{+\t0.08\t}_{-\t0.03\t}$$^{+\t0.00\t}_{-\t0.02\t}$$^{+\t0.08\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t4.47\t^{+\t0.01\t}_{-\t0.02\t}$$^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[412.5\t ; \t505]\t&\t$\t3.66\t^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.70\t^{+\t0.02\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.02\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.70\t^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t505\t ; \t615\t]\t&\t$\t1.50\t^{+\t0.03\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.38\t^{+\t0.01\t}_{-\t0.04\t}$$^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.02\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.36\t^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t615\t ; \t750\t]\t&\t$\t4.94\t^{+\t0.24\t}_{-\t0.21\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t3.98\t^{+\t0.11\t}_{-\t0.33\t}$$^{+\t0.04\t}_{-\t0.01\t}$$^{+\t0.12\t}_{-\t0.33\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t3.90\t^{+\t0.05\t}_{-\t0.00\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.06\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[750\t ; \t1200]\t&\t$\t1.39\t^{+\t0.12\t}_{-\t0.10\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.28\t^{+\t0.49\t}_{-\t1.71\t}$$^{+\t0.14\t}_{-\t0.10\t}$$^{+\t0.51\t}_{-\t1.72\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t9.08\t^{+\t0.47\t}_{-\t0.01\t}$$^{+\t0.12\t}_{-\t0.11\t}$$^{+\t0.48\t}_{-\t0.11\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\t[\t1200\t ; \t$\\infty$\t]\t&\t$\t4.25\t^{+\t0.91\t}_{-\t0.68\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t1.61\t^{+\t0.31\t}_{-\t1.19\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t1.82\t^{+\t0.58\t}_{-\t0.11\t} ~ \\times ~ 10^{\t-5\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:Mtt} The ${m_{t\\bar t}}$ differential distribution in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO, as well as for the last bin, only the scale error is given. We stress that the normalisation is {\\it per bin} and thus differs from the one shown in fig.~\\ref{fig:Mtt} (to convert between the two one needs to divide by the bin width). The MC error (not shown) is estimated in sec.~\\ref{sec:Mtt}.}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${p_{T,t}}$ & \\multicolumn{3}{|c|}{$d\\sigma/d{p_{T,t}}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t45\t]\t&\t$\t1.07\t^{+\t0.45\t}_{-\t0.29\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.15\t^{+\t0.09\t}_{-\t0.13\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.09\t}_{-\t0.14\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.23\t^{+\t0.06\t}_{-\t0.08\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.07\t}_{-\t0.08\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t45\t ; \t90\t]\t&\t$\t2.13\t^{+\t0.91\t}_{-\t0.59\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.27\t^{+\t0.17\t}_{-\t0.27\t}$$^{+\t0.05\t}_{-\t0.05\t}$$^{+\t0.18\t}_{-\t0.27\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.39\t^{+\t0.10\t}_{-\t0.13\t}$$^{+\t0.06\t}_{-\t0.04\t}$$^{+\t0.12\t}_{-\t0.14\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t90\t ; \t140]\t&\t$\t1.85\t^{+\t0.82\t}_{-\t0.52\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.88\t^{+\t0.11\t}_{-\t0.21\t}$$^{+\t0.05\t}_{-\t0.04\t}$$^{+\t0.12\t}_{-\t0.22\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.97\t^{+\t0.06\t}_{-\t0.10\t}$$^{+\t0.05\t}_{-\t0.04\t}$$^{+\t0.08\t}_{-\t0.11\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[140\t ; \t200]\t&\t$\t1.05\t^{+\t0.49\t}_{-\t0.31\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t9.81\t^{+\t0.32\t}_{-\t1.02\t}$$^{+\t0.35\t}_{-\t0.14\t}$$^{+\t0.47\t}_{-\t1.03\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.01\t^{+\t0.03\t}_{-\t0.05\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.04\t}_{-\t0.05\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[200\t ; \t300]\t&\t$\t4.51\t^{+\t2.23\t}_{-\t1.37\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.67\t^{+\t0.07\t}_{-\t0.31\t}$$^{+\t0.13\t}_{-\t0.07\t}$$^{+\t0.14\t}_{-\t0.32\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.65\t^{+\t0.08\t}_{-\t0.09\t}$$^{+\t0.11\t}_{-\t0.08\t}$$^{+\t0.14\t}_{-\t0.12\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[300\t ; \t500]\t&\t$\t6.59\t^{+\t3.68\t}_{-\t2.18\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t4.20\t^{+\t0.00\t}_{-\t0.81\t}$$^{+\t0.12\t}_{-\t0.15\t}$$^{+\t0.12\t}_{-\t0.82\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t4.07\t^{+\t0.23\t}_{-\t0.11\t}$$^{+\t0.14\t}_{-\t0.10\t}$$^{+\t0.27\t}_{-\t0.15\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[500\t ; \t$\\infty$ ]\t&\t$\t5.54\t^{+\t3.88\t}_{-\t2.11\t} ~ \\times ~ 10^{\t-4\t}$\t&\t$\t2.21\t^{+\t0.18\t}_{-\t1.51\t} ~ \\times ~ 10^{\t-4\t}$\t&\t$\t2.25\t^{+\t0.54\t}_{-\t0.07\t} ~ \\times ~ 10^{\t-4\t}$\t\\\\\t\\hline \n\n\n\n\\hline\n${p_{T,t}}$ & \\multicolumn{3}{|c|}{$(1/\\sigma)d\\sigma/d{p_{T,t}}$ [1/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t45\t]\t&\t$\t1.62\t^{+\t0.02\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.71\t^{+\t0.03\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.01\t}$$^{+\t0.03\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.76\t^{+\t0.02\t}_{-\t0.02\t}$$^{+\t0.00\t}_{-\t0.01\t}$$^{+\t0.02\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t45\t ; \t90\t]\t&\t$\t3.22\t^{+\t0.03\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.40\t^{+\t0.07\t}_{-\t0.02\t}$$^{+\t0.00\t}_{-\t0.02\t}$$^{+\t0.07\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.41\t^{+\t0.02\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.02\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t90\t ; \t140]\t&\t$\t2.79\t^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.81\t^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.81\t^{+\t0.00\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[140\t ; \t200]\t&\t$\t1.59\t^{+\t0.02\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.47\t^{+\t0.02\t}_{-\t0.04\t}$$^{+\t0.02\t}_{-\t0.00\t}$$^{+\t0.02\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.44\t^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[200\t ; \t300]\t&\t$\t6.81\t^{+\t0.25\t}_{-\t0.22\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t5.49\t^{+\t0.17\t}_{-\t0.50\t}$$^{+\t0.07\t}_{-\t0.03\t}$$^{+\t0.18\t}_{-\t0.50\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t5.20\t^{+\t0.15\t}_{-\t0.08\t}$$^{+\t0.05\t}_{-\t0.04\t}$$^{+\t0.16\t}_{-\t0.09\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[300\t ; \t500]\t&\t$\t9.96\t^{+\t0.79\t}_{-\t0.67\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t6.29\t^{+\t0.47\t}_{-\t1.46\t}$$^{+\t0.06\t}_{-\t0.16\t}$$^{+\t0.48\t}_{-\t1.47\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t5.81\t^{+\t0.16\t}_{-\t0.06\t}$$^{+\t0.09\t}_{-\t0.08\t}$$^{+\t0.18\t}_{-\t0.10\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\t[500\t ; \t$\\infty$ ]\t&\t$\t8.38\t^{+\t1.49\t}_{-\t1.15\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t3.30\t^{+\t0.66\t}_{-\t2.32\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t3.21\t^{+\t0.62\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-5\t}$\t\\\\\t\\hline \n\\end{tabular}\n\\caption{\\label{tab:PTt} The ${p_{T,t}}$ differential distribution in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO, as well as for the last bin, only the scale error is shown. The normalisation is {\\it per bin} and thus differs from the one shown in fig.~\\ref{fig:PTt} (to convert between the two one needs to divide by the bin width). The MC error (not shown) is estimated in sec.~\\ref{sec:PTt}.}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${\\vert y_t\\vert}$ & \\multicolumn{3}{|c|}{$d\\sigma/d{\\vert y_t\\vert}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t0.25\t]\t&\t$\t1.94\t^{+\t0.84\t}_{-\t0.54\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.96\t^{+\t0.09\t}_{-\t0.21\t}$$^{+\t0.06\t}_{-\t0.03\t}$$^{+\t0.11\t}_{-\t0.21\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.04\t^{+\t0.06\t}_{-\t0.10\t}$$^{+\t0.05\t}_{-\t0.04\t}$$^{+\t0.08\t}_{-\t0.10\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[0.25\t ; \t0.5]\t&\t$\t1.72\t^{+\t0.75\t}_{-\t0.48\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.74\t^{+\t0.08\t}_{-\t0.19\t}$$^{+\t0.04\t}_{-\t0.04\t}$$^{+\t0.09\t}_{-\t0.19\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.82\t^{+\t0.06\t}_{-\t0.09\t}$$^{+\t0.05\t}_{-\t0.03\t}$$^{+\t0.08\t}_{-\t0.10\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[0.5\t ; \t0.75]\t&\t$\t1.33\t^{+\t0.59\t}_{-\t0.37\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.35\t^{+\t0.07\t}_{-\t0.15\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.08\t}_{-\t0.15\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.41\t^{+\t0.05\t}_{-\t0.07\t}$$^{+\t0.04\t}_{-\t0.02\t}$$^{+\t0.06\t}_{-\t0.08\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t0.75\t ; \t1\t]\t&\t$\t8.83\t^{+\t4.01\t}_{-\t2.53\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t8.93\t^{+\t0.55\t}_{-\t1.06\t}$$^{+\t0.23\t}_{-\t0.18\t}$$^{+\t0.59\t}_{-\t1.07\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.35\t^{+\t0.37\t}_{-\t0.54\t}$$^{+\t0.23\t}_{-\t0.16\t}$$^{+\t0.44\t}_{-\t0.56\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t1\t ; \t1.25\t]\t&\t$\t4.79\t^{+\t2.25\t}_{-\t1.40\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t4.84\t^{+\t0.35\t}_{-\t0.61\t}$$^{+\t0.16\t}_{-\t0.07\t}$$^{+\t0.39\t}_{-\t0.62\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t5.17\t^{+\t0.25\t}_{-\t0.34\t}$$^{+\t0.12\t}_{-\t0.09\t}$$^{+\t0.28\t}_{-\t0.35\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[1.25\t ; \t1.5]\t&\t$\t1.97\t^{+\t0.97\t}_{-\t0.60\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.99\t^{+\t0.18\t}_{-\t0.28\t}$$^{+\t0.05\t}_{-\t0.05\t}$$^{+\t0.18\t}_{-\t0.28\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.15\t^{+\t0.15\t}_{-\t0.16\t}$$^{+\t0.05\t}_{-\t0.05\t}$$^{+\t0.16\t}_{-\t0.16\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t1.5\t ; \t$\\infty$\t]\t&\t$\t6.18\t^{+\t3.27\t}_{-\t1.96\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t6.22\t^{+\t0.69\t}_{-\t0.96\t}$$^{+\t0.23\t}_{-\t0.16\t}$$^{+\t0.73\t}_{-\t0.98\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t6.67\t^{+\t0.58\t}_{-\t0.60\t}$$^{+\t0.22\t}_{-\t0.19\t}$$^{+\t0.62\t}_{-\t0.63\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\n\n\n\\hline\n${\\vert y_t\\vert}$ & \\multicolumn{3}{|c|}{$(1/\\sigma)d\\sigma/d{\\vert y_t\\vert}$ [1/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t0.25\t]\t&\t$\t2.94\t^{+\t0.02\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.93\t^{+\t0.02\t}_{-\t0.02\t}$$^{+\t0.02\t}_{-\t0.00\t}$$^{+\t0.03\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.91\t^{+\t0.02\t}_{-\t0.02\t}$$^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.02\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[0.25\t ; \t0.5]\t&\t$\t2.60\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.60\t^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.02\t}$$^{+\t0.01\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.61\t^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.00\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[0.5\t ; \t0.75]\t&\t$\t2.01\t^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.02\t^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.01\t^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t0.75\t ; \t1\t]\t&\t$\t1.33\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.34\t^{+\t0.01\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.01\t}$$^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.34\t^{+\t0.00\t}_{-\t0.01\t}$$^{+\t0.00\t}_{-\t0.00\t}$$^{+\t0.00\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t1\t ; \t1.25\t]\t&\t$\t7.24\t^{+\t0.14\t}_{-\t0.12\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t7.25\t^{+\t0.13\t}_{-\t0.11\t}$$^{+\t0.09\t}_{-\t0.02\t}$$^{+\t0.16\t}_{-\t0.11\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t7.38\t^{+\t0.08\t}_{-\t0.10\t}$$^{+\t0.04\t}_{-\t0.06\t}$$^{+\t0.09\t}_{-\t0.11\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[1.25\t ; \t1.5]\t&\t$\t2.98\t^{+\t0.10\t}_{-\t0.09\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.98\t^{+\t0.10\t}_{-\t0.09\t}$$^{+\t0.02\t}_{-\t0.06\t}$$^{+\t0.10\t}_{-\t0.10\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t3.07\t^{+\t0.09\t}_{-\t0.07\t}$$^{+\t0.04\t}_{-\t0.05\t}$$^{+\t0.10\t}_{-\t0.08\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t1.5\t ; \t$\\infty$\t]\t&\t$\t9.33\t^{+\t0.56\t}_{-\t0.47\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t9.31\t^{+\t0.51\t}_{-\t0.44\t}$$^{+\t0.20\t}_{-\t0.23\t}$$^{+\t0.55\t}_{-\t0.50\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t9.52\t^{+\t0.46\t}_{-\t0.37\t}$$^{+\t0.23\t}_{-\t0.27\t}$$^{+\t0.51\t}_{-\t0.45\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:mody} The ${\\vert y_t\\vert}$ differential distribution in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO, as well as for the last bin, only the scale error is given. The normalisation is {\\it per bin} and thus differs from the one shown in fig.~\\ref{fig:mody} (to convert between the two one needs to divide by the bin width). The MC error (not shown) is estimated in sec.~\\ref{sec:mody}.}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n$\\cos\\theta$ & \\multicolumn{3}{|c|}{$(1/\\sigma)d\\sigma/d\\cos\\theta$ [1/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t-1\t ; \t-0.8\t]\t&\t$\t1.13\t^{+\t0.01\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.08\t^{+\t0.01\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.08\t^{+\t0.01\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-0.8\t ; \t-0.6\t]\t&\t$\t1.04\t^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.69\t^{+\t0.16\t}_{-\t0.31\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.57\t^{+\t0.08\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-0.6\t ; \t-0.4\t]\t&\t$\t9.77\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.09\t^{+\t0.17\t}_{-\t0.33\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.84\t^{+\t0.12\t}_{-\t0.11\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-0.4\t ; \t-0.2\t]\t&\t$\t9.38\t^{+\t0.02\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.78\t^{+\t0.16\t}_{-\t0.30\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.55\t^{+\t0.13\t}_{-\t0.08\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-0.2\t ; \t0\t]\t&\t$\t9.18\t^{+\t0.03\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.72\t^{+\t0.13\t}_{-\t0.24\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.49\t^{+\t0.13\t}_{-\t0.13\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t0\t ; \t0.2\t]\t&\t$\t9.18\t^{+\t0.03\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.90\t^{+\t0.09\t}_{-\t0.15\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.75\t^{+\t0.09\t}_{-\t0.10\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t0.2\t ; \t0.4\t]\t&\t$\t9.38\t^{+\t0.02\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.35\t^{+\t0.03\t}_{-\t0.03\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.24\t^{+\t0.05\t}_{-\t0.07\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t0.4\t ; \t0.6\t]\t&\t$\t9.77\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t1.01\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.02\t^{+\t0.00\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t0.6\t ; \t0.8\t]\t&\t$\t1.04\t^{+\t0.00\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.13\t^{+\t0.04\t}_{-\t0.02\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.16\t^{+\t0.01\t}_{-\t0.01\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t0.8\t ; \t1\t]\t&\t$\t1.13\t^{+\t0.01\t}_{-\t0.00\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.33\t^{+\t0.10\t}_{-\t0.05\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.40\t^{+\t0.04\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:costheta} Normalised $\\cos\\theta$ differential distribution in LO, NLO and NNLO QCD shown in fig.~\\ref{fig:costheta}(left) (same normalisation). The format is $central\\pm scales$.}\n\\end{center}\n\\end{table}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n{\\rm Moment} & \\multicolumn{3}{|c|}{Legendre Moment} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t1\t&\t$\t-4.82\t^{+\t0.12\t}_{-\t0.14\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t1.24\t^{+\t0.57\t}_{-\t0.29\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.59\t^{+\t0.11\t}_{-\t0.19\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t2\t&\t$\t1.75\t^{+\t0.08\t}_{-\t0.06\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.68\t^{+\t0.49\t}_{-\t0.28\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.17\t^{+\t0.29\t}_{-\t0.28\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t3\t&\t$\t2.10\t^{+\t0.00\t}_{-\t0.04\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t2.45\t^{+\t1.17\t}_{-\t0.60\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t3.96\t^{+\t0.74\t}_{-\t0.67\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t4\t&\t$\t7.47\t^{+\t1.68\t}_{-\t1.22\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t3.34\t^{+\t1.45\t}_{-\t0.78\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t5.12\t^{+\t1.11\t}_{-\t0.93\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t5\t&\t$\t-1.63\t^{+\t0.39\t}_{-\t0.35\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t3.25\t^{+\t1.58\t}_{-\t0.76\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t6.88\t^{+\t2.14\t}_{-\t1.48\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\t6\t&\t$\t1.27\t^{+\t0.33\t}_{-\t0.23\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t6.35\t^{+\t3.06\t}_{-\t1.67\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t1.08\t^{+\t0.33\t}_{-\t0.26\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t7\t&\t$\t3.70\t^{+\t2.00\t}_{-\t2.37\t} ~ \\times ~ 10^{\t-6\t}$\t&\t$\t9.69\t^{+\t4.17\t}_{-\t2.39\t} ~ \\times ~ 10^{\t-4\t}$\t&\t$\t1.81\t^{+\t0.80\t}_{-\t0.48\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\t8\t&\t$\t5.15\t^{+\t8.31\t}_{-\t5.66\t} ~ \\times ~ 10^{\t-5\t}$\t&\t$\t1.47\t^{+\t0.79\t}_{-\t0.39\t} ~ \\times ~ 10^{\t-3\t}$\t&\t$\t3.87\t^{+\t0.86\t}_{-\t0.76\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:legmom} First eight Legendre moments $a_i$ in LO, NLO and NNLO QCD shown in fig.~\\ref{fig:costheta}(right) (same normalisation). The format is $central\\pm scales$.}\n\\end{center}\n\\end{table}\n\n\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${\\Delta y}$ & \\multicolumn{3}{|c|}{$d\\sigma/d{\\Delta y}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t-2\t ; \t-1.5\t]\t&\t$\t2.26\t^{+\t1.13\t}_{-\t0.69\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.90\t^{+\t0.06\t}_{-\t0.18\t}$$^{+\t0.06\t}_{-\t0.05\t}$$^{+\t0.08\t}_{-\t0.18\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.98\t^{+\t0.13\t}_{-\t0.11\t}$$^{+\t0.05\t}_{-\t0.05\t}$$^{+\t0.14\t}_{-\t0.12\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-1.5\t ; \t-1\t]\t&\t$\t5.21\t^{+\t2.40\t}_{-\t1.51\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t4.74\t^{+\t0.14\t}_{-\t0.46\t}$$^{+\t0.13\t}_{-\t0.10\t}$$^{+\t0.19\t}_{-\t0.47\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t4.87\t^{+\t0.20\t}_{-\t0.22\t}$$^{+\t0.12\t}_{-\t0.08\t}$$^{+\t0.23\t}_{-\t0.24\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-1\t ; \t-0.5\t]\t&\t$\t1.06\t^{+\t0.47\t}_{-\t0.30\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.00\t^{+\t0.03\t}_{-\t0.10\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.04\t}_{-\t0.10\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.03\t^{+\t0.03\t}_{-\t0.04\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.04\t}_{-\t0.05\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t-0.5\t ; \t0\t]\t&\t$\t1.51\t^{+\t0.65\t}_{-\t0.41\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.48\t^{+\t0.06\t}_{-\t0.15\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.07\t}_{-\t0.15\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.52\t^{+\t0.04\t}_{-\t0.07\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.06\t}_{-\t0.07\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t0\t ; \t0.5\t]\t&\t$\t1.51\t^{+\t0.65\t}_{-\t0.41\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.54\t^{+\t0.08\t}_{-\t0.17\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.09\t}_{-\t0.17\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.61\t^{+\t0.05\t}_{-\t0.08\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.06\t}_{-\t0.08\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t0.5\t ; \t1\t]\t&\t$\t1.06\t^{+\t0.47\t}_{-\t0.30\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.14\t^{+\t0.09\t}_{-\t0.14\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.10\t}_{-\t0.14\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.21\t^{+\t0.05\t}_{-\t0.07\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.06\t}_{-\t0.08\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t1\t ; \t1.5\t]\t&\t$\t5.20\t^{+\t2.40\t}_{-\t1.51\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t5.89\t^{+\t0.65\t}_{-\t0.83\t}$$^{+\t0.15\t}_{-\t0.13\t}$$^{+\t0.67\t}_{-\t0.84\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t6.42\t^{+\t0.35\t}_{-\t0.48\t}$$^{+\t0.16\t}_{-\t0.12\t}$$^{+\t0.39\t}_{-\t0.49\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t1.5\t ; \t2\t]\t&\t$\t2.26\t^{+\t1.13\t}_{-\t0.69\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.67\t^{+\t0.40\t}_{-\t0.44\t}$$^{+\t0.08\t}_{-\t0.05\t}$$^{+\t0.41\t}_{-\t0.44\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.01\t^{+\t0.24\t}_{-\t0.29\t}$$^{+\t0.08\t}_{-\t0.06\t}$$^{+\t0.26\t}_{-\t0.30\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:diff-y} Differential distribution in the rapidity difference ${\\Delta y}$ between $t$ and $\\bar t$ in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO only the scale error is given. The end-bins contain overflow events.}\n\\end{center}\n\\end{table}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c |}\n\\hline\n${\\vert\\Delta y\\vert}$ & \\multicolumn{2}{|c|}{${\\rm A_{FB}}({\\vert\\Delta y\\vert})$} \\\\\n\\hline \n & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t0.5\t]\t&\t$\t2.14\t^{+\t0.96\t}_{-\t0.50\t}$$^{+\t0.06\t}_{-\t0.02\t}$$^{+\t0.97\t}_{-\t0.50\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.76\t^{+\t0.19\t}_{-\t0.31\t}$$^{+\t0.09\t}_{-\t0.01\t}$$^{+\t0.21\t}_{-\t0.31\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t0.5\t ; \t1\t]\t&\t$\t6.41\t^{+\t2.84\t}_{-\t1.47\t}$$^{+\t0.07\t}_{-\t0.24\t}$$^{+\t2.84\t}_{-\t1.49\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t8.06\t^{+\t0.59\t}_{-\t0.92\t}$$^{+\t0.10\t}_{-\t0.16\t}$$^{+\t0.59\t}_{-\t0.93\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t1\t ; \t1.5\t]\t&\t$\t1.08\t^{+\t0.48\t}_{-\t0.25\t}$$^{+\t0.03\t}_{-\t0.03\t}$$^{+\t0.48\t}_{-\t0.25\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.37\t^{+\t0.08\t}_{-\t0.15\t}$$^{+\t0.02\t}_{-\t0.03\t}$$^{+\t0.08\t}_{-\t0.15\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t1.5\t ; \t2\t]\t&\t$\t1.69\t^{+\t0.79\t}_{-\t0.40\t}$$^{+\t0.07\t}_{-\t0.04\t}$$^{+\t0.79\t}_{-\t0.40\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.07\t^{+\t0.08\t}_{-\t0.21\t}$$^{+\t0.06\t}_{-\t0.04\t}$$^{+\t0.10\t}_{-\t0.21\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:afb-y} ${\\vert\\Delta y\\vert}$-dependent ${\\rm A_{FB}}$ in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO only the scale error is given. The highest bin contains overflow events.}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${m_{t\\bar t}}{{\\Delta y}\\over {\\vert\\Delta y\\vert}}$[{\\rm GeV}] & \\multicolumn{3}{|c|}{$d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t-$\\infty$\t ; \t-650\t]\t&\t$\t1.42\t^{+\t0.76\t}_{-\t0.46\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.04\t^{+\t0.03\t}_{-\t1.85\t}$$^{+\t0.30\t}_{-\t0.20\t}$$^{+\t0.30\t}_{-\t1.86\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.01\t^{+\t0.71\t}_{-\t0.24\t}$$^{+\t0.24\t}_{-\t0.22\t}$$^{+\t0.75\t}_{-\t0.32\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-650\t ; \t-550\t]\t&\t$\t2.88\t^{+\t1.41\t}_{-\t0.87\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.27\t^{+\t0.03\t}_{-\t0.17\t}$$^{+\t0.06\t}_{-\t0.06\t}$$^{+\t0.07\t}_{-\t0.18\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.27\t^{+\t0.08\t}_{-\t0.07\t}$$^{+\t0.06\t}_{-\t0.05\t}$$^{+\t0.10\t}_{-\t0.09\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-550\t ; \t-450\t]\t&\t$\t8.60\t^{+\t3.93\t}_{-\t2.47\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t7.78\t^{+\t0.22\t}_{-\t0.74\t}$$^{+\t0.22\t}_{-\t0.15\t}$$^{+\t0.31\t}_{-\t0.75\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t7.88\t^{+\t0.21\t}_{-\t0.31\t}$$^{+\t0.21\t}_{-\t0.14\t}$$^{+\t0.30\t}_{-\t0.34\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-450\t ; \t-350\t]\t&\t$\t1.99\t^{+\t0.84\t}_{-\t0.54\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.02\t^{+\t0.10\t}_{-\t0.22\t}$$^{+\t0.05\t}_{-\t0.03\t}$$^{+\t0.12\t}_{-\t0.22\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.10\t^{+\t0.06\t}_{-\t0.10\t}$$^{+\t0.05\t}_{-\t0.04\t}$$^{+\t0.08\t}_{-\t0.11\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t-350\t ; \t-250\t]\t&\t$\t2.93\t^{+\t1.18\t}_{-\t0.77\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.77\t^{+\t0.08\t}_{-\t0.24\t}$$^{+\t0.08\t}_{-\t0.04\t}$$^{+\t0.11\t}_{-\t0.24\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.98\t^{+\t0.18\t}_{-\t0.18\t}$$^{+\t0.07\t}_{-\t0.04\t}$$^{+\t0.19\t}_{-\t0.18\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t250\t ; \t350\t]\t&\t$\t2.93\t^{+\t1.18\t}_{-\t0.77\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.83\t^{+\t0.08\t}_{-\t0.26\t}$$^{+\t0.05\t}_{-\t0.07\t}$$^{+\t0.10\t}_{-\t0.26\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t2.97\t^{+\t0.18\t}_{-\t0.16\t}$$^{+\t0.07\t}_{-\t0.04\t}$$^{+\t0.20\t}_{-\t0.17\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t350\t ; \t450\t]\t&\t$\t1.99\t^{+\t0.84\t}_{-\t0.54\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.20\t^{+\t0.19\t}_{-\t0.27\t}$$^{+\t0.06\t}_{-\t0.04\t}$$^{+\t0.20\t}_{-\t0.27\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.35\t^{+\t0.10\t}_{-\t0.14\t}$$^{+\t0.06\t}_{-\t0.04\t}$$^{+\t0.11\t}_{-\t0.15\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t450\t ; \t550\t]\t&\t$\t8.59\t^{+\t3.93\t}_{-\t2.47\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.08\t^{+\t0.72\t}_{-\t1.16\t}$$^{+\t0.23\t}_{-\t0.22\t}$$^{+\t0.76\t}_{-\t1.18\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t9.62\t^{+\t0.40\t}_{-\t0.60\t}$$^{+\t0.25\t}_{-\t0.18\t}$$^{+\t0.47\t}_{-\t0.63\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t550\t ; \t650\t]\t&\t$\t2.88\t^{+\t1.41\t}_{-\t0.87\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.82\t^{+\t0.17\t}_{-\t0.36\t}$$^{+\t0.10\t}_{-\t0.05\t}$$^{+\t0.20\t}_{-\t0.36\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t2.98\t^{+\t0.13\t}_{-\t0.18\t}$$^{+\t0.08\t}_{-\t0.06\t}$$^{+\t0.15\t}_{-\t0.19\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t650\t ; \t$\\infty$\t]\t&\t$\t1.42\t^{+\t0.76\t}_{-\t0.46\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.24\t^{+\t0.05\t}_{-\t0.15\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.06\t}_{-\t0.15\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.29\t^{+\t0.07\t}_{-\t0.08\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.08\t}_{-\t0.09\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:diff-mtt} ${m_{t\\bar t}}\\times{\\rm sign}({\\Delta y})$ differential distribution in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO only the scale error is given.}\n\\end{center}\n\\end{table}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c |}\n\\hline\n${m_{t\\bar t}}$[{\\rm GeV}] & \\multicolumn{2}{|c|}{${\\rm A_{FB}}({m_{t\\bar t}})$} \\\\\n\\hline \n & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t350\t ; \t450\t]\t&\t$\t4.10\t^{+\t1.66\t}_{-\t0.90\t}$$^{+\t0.07\t}_{-\t0.10\t}$$^{+\t1.66\t}_{-\t0.91\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t5.36\t^{+\t0.49\t}_{-\t0.61\t}$$^{+\t0.09\t}_{-\t0.07\t}$$^{+\t0.50\t}_{-\t0.62\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t450\t ; \t550\t]\t&\t$\t7.71\t^{+\t3.69\t}_{-\t1.85\t}$$^{+\t0.09\t}_{-\t0.34\t}$$^{+\t3.69\t}_{-\t1.88\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t9.98\t^{+\t0.68\t}_{-\t1.23\t}$$^{+\t0.15\t}_{-\t0.17\t}$$^{+\t0.70\t}_{-\t1.24\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t550\t ; \t650\t]\t&\t$\t1.08\t^{+\t0.61\t}_{-\t0.28\t}$$^{+\t0.09\t}_{-\t0.00\t}$$^{+\t0.62\t}_{-\t0.28\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.34\t^{+\t0.06\t}_{-\t0.14\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.06\t}_{-\t0.14\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t650\t ; \t750\t]\t&\t$\t1.56\t^{+\t1.19\t}_{-\t0.46\t}$$^{+\t0.03\t}_{-\t0.03\t}$$^{+\t1.19\t}_{-\t0.47\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.77\t^{+\t0.04\t}_{-\t0.19\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.06\t}_{-\t0.19\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:afb-mtt} ${m_{t\\bar t}}$ dependent ${\\rm A_{FB}}$ in NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. The lowest and highest bins contain spillover events.}\n\\end{center}\n\\end{table}\n\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c |}\n\\hline\n${p_{T,t\\bar t}}$ [{\\rm GeV}] & \\multicolumn{3}{|c|}{$d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ [pb/bin]} \\\\\n\\hline \n & {\\rm LO} & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t-80\t ; \t-70\t]\t&\t$\t0$\t&\t$\t1.13\t^{+\t0.74\t}_{-\t0.41\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.74\t}_{-\t0.41\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.39\t^{+\t0.10\t}_{-\t0.24\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.11\t}_{-\t0.24\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-70\t ; \t-60\t]\t&\t$\t0$\t&\t$\t3.98\t^{+\t2.49\t}_{-\t1.41\t}$$^{+\t0.13\t}_{-\t0.07\t}$$^{+\t2.49\t}_{-\t1.41\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t5.12\t^{+\t0.52\t}_{-\t0.92\t}$$^{+\t0.13\t}_{-\t0.11\t}$$^{+\t0.53\t}_{-\t0.92\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-60\t ; \t-50\t]\t&\t$\t0$\t&\t$\t5.81\t^{+\t3.61\t}_{-\t2.05\t}$$^{+\t0.17\t}_{-\t0.13\t}$$^{+\t3.61\t}_{-\t2.06\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t7.50\t^{+\t0.77\t}_{-\t1.33\t}$$^{+\t0.18\t}_{-\t0.15\t}$$^{+\t0.79\t}_{-\t1.34\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t-50\t ; \t-40\t]\t&\t$\t0$\t&\t$\t8.89\t^{+\t5.47\t}_{-\t3.12\t}$$^{+\t0.28\t}_{-\t0.17\t}$$^{+\t5.47\t}_{-\t3.12\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t1.15\t^{+\t0.12\t}_{-\t0.20\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.12\t}_{-\t0.21\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-40\t ; \t-30\t]\t&\t$\t0$\t&\t$\t1.46\t^{+\t0.89\t}_{-\t0.51\t}$$^{+\t0.05\t}_{-\t0.03\t}$$^{+\t0.89\t}_{-\t0.51\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.88\t^{+\t0.17\t}_{-\t0.32\t}$$^{+\t0.04\t}_{-\t0.04\t}$$^{+\t0.18\t}_{-\t0.33\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-30\t ; \t-20\t]\t&\t$\t0$\t&\t$\t2.71\t^{+\t1.64\t}_{-\t0.94\t}$$^{+\t0.08\t}_{-\t0.05\t}$$^{+\t1.64\t}_{-\t0.94\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.39\t^{+\t0.27\t}_{-\t0.55\t}$$^{+\t0.08\t}_{-\t0.06\t}$$^{+\t0.28\t}_{-\t0.56\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-20\t ; \t-10\t]\t&\t$\t0$\t&\t$\t6.54\t^{+\t3.91\t}_{-\t2.25\t}$$^{+\t0.18\t}_{-\t0.13\t}$$^{+\t3.91\t}_{-\t2.26\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t7.48\t^{+\t0.30\t}_{-\t1.03\t}$$^{+\t0.18\t}_{-\t0.13\t}$$^{+\t0.35\t}_{-\t1.04\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t-10\t ; \t0\t]\t&\t$\t3.31\t^{+\t1.47\t}_{-\t0.93\t} $\t&\t$\t1.77\t^{+\t0.16\t}_{-\t0.76\t}$$^{+\t0.05\t}_{-\t0.03\t}$$^{+\t0.17\t}_{-\t0.76\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t1.59\t^{+\t0.11\t}_{-\t0.03\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.12\t}_{-\t0.04\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t0\t ; \t10\t]\t&\t$\t3.31\t^{+\t1.47\t}_{-\t0.93\t} $\t&\t$\t2.39\t^{+\t0.04\t}_{-\t0.42\t}$$^{+\t0.07\t}_{-\t0.05\t}$$^{+\t0.08\t}_{-\t0.43\t} ~ \\times ~ 10^{\t0\t}$\t&\t$\t2.21\t^{+\t0.06\t}_{-\t0.05\t}$$^{+\t0.06\t}_{-\t0.05\t}$$^{+\t0.09\t}_{-\t0.06\t} ~ \\times ~ 10^{\t0\t}$\t\\\\\t\\hline\n\t[\t10\t ; \t20\t]\t&\t$\t0$\t&\t$\t5.60\t^{+\t3.39\t}_{-\t1.94\t}$$^{+\t0.18\t}_{-\t0.11\t}$$^{+\t3.39\t}_{-\t1.95\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t7.35\t^{+\t0.72\t}_{-\t1.27\t}$$^{+\t0.18\t}_{-\t0.14\t}$$^{+\t0.75\t}_{-\t1.27\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t20\t ; \t30\t]\t&\t$\t0$\t&\t$\t2.26\t^{+\t1.39\t}_{-\t0.79\t}$$^{+\t0.07\t}_{-\t0.05\t}$$^{+\t1.39\t}_{-\t0.79\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t3.17\t^{+\t0.46\t}_{-\t0.61\t}$$^{+\t0.08\t}_{-\t0.06\t}$$^{+\t0.46\t}_{-\t0.61\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t30\t ; \t40\t]\t&\t$\t0$\t&\t$\t1.20\t^{+\t0.74\t}_{-\t0.42\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.74\t}_{-\t0.42\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t1.70\t^{+\t0.27\t}_{-\t0.34\t}$$^{+\t0.05\t}_{-\t0.03\t}$$^{+\t0.27\t}_{-\t0.34\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t40\t ; \t50\t]\t&\t$\t0$\t&\t$\t7.21\t^{+\t4.51\t}_{-\t2.56\t}$$^{+\t0.24\t}_{-\t0.15\t}$$^{+\t4.52\t}_{-\t2.56\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t1.03\t^{+\t0.17\t}_{-\t0.20\t}$$^{+\t0.03\t}_{-\t0.02\t}$$^{+\t0.17\t}_{-\t0.21\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t50\t ; \t60\t]\t&\t$\t0$\t&\t$\t4.68\t^{+\t2.95\t}_{-\t1.67\t}$$^{+\t0.13\t}_{-\t0.15\t}$$^{+\t2.96\t}_{-\t1.67\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t6.62\t^{+\t1.08\t}_{-\t1.33\t}$$^{+\t0.18\t}_{-\t0.13\t}$$^{+\t1.09\t}_{-\t1.33\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t60\t ; \t70\t]\t&\t$\t0$\t&\t$\t3.18\t^{+\t2.03\t}_{-\t1.14\t}$$^{+\t0.11\t}_{-\t0.07\t}$$^{+\t2.03\t}_{-\t1.14\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t4.50\t^{+\t0.74\t}_{-\t0.91\t}$$^{+\t0.11\t}_{-\t0.11\t}$$^{+\t0.74\t}_{-\t0.92\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t70\t ; \t80\t]\t&\t$\t0$\t&\t$\t8.96\t^{+\t5.95\t}_{-\t3.30\t}$$^{+\t0.34\t}_{-\t0.25\t}$$^{+\t5.96\t}_{-\t3.31\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t1.21\t^{+\t0.17\t}_{-\t0.24\t}$$^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.17\t}_{-\t0.24\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\\end{tabular}\n\\caption{\\label{tab:diff-ptt} ${p_{T,t\\bar t}}\\times{\\rm sign}({\\Delta y})$ differential distribution in LO, NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$. At LO only the scale error is given.}\n\\end{center}\n\\end{table}\n\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c |}\n\\hline\n${p_{T,t\\bar t}}$[{\\rm GeV}] & \\multicolumn{2}{|c|}{${\\rm A_{FB}}({p_{T,t\\bar t}})$} \\\\\n\\hline \n & {\\rm NLO} & {\\rm NNLO} \\\\ \\hline\n\t[\t0\t ; \t10\t]\t&\t$\t+1.48\t^{+\t1.72\t}_{-\t0.51\t}$$^{+\t0.02\t}_{-\t0.02\t}$$^{+\t1.72\t}_{-\t0.52\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t+1.64\t^{+\t0.03\t}_{-\t0.21\t}$$^{+\t0.02\t}_{-\t0.02\t}$$^{+\t0.03\t}_{-\t0.21\t} ~ \\times ~ 10^{\t-1\t}$\t\\\\\t\\hline\n\t[\t10\t ; \t20\t]\t&\t$\t-7.71\t^{+\t0.22\t}_{-\t0.19\t}$$^{+\t0.35\t}_{-\t0.18\t}$$^{+\t0.41\t}_{-\t0.26\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t-8.52\t^{+\t44.2\t}_{-\t20.1\t}$$^{+\t0.19\t}_{-\t0.22\t}$$^{+\t44.2\t}_{-\t20.1\t} ~ \\times ~ 10^{\t-3\t}$\t\\\\\t\\hline\n\t[\t20\t ; \t30\t]\t&\t$\t-9.00\t^{+\t0.27\t}_{-\t0.23\t}$$^{+\t0.18\t}_{-\t0.41\t}$$^{+\t0.33\t}_{-\t0.47\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t-3.37\t^{+\t3.19\t}_{-\t1.61\t}$$^{+\t0.11\t}_{-\t0.07\t}$$^{+\t3.19\t}_{-\t1.62\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t30\t ; \t40\t]\t&\t$\t-9.85\t^{+\t0.30\t}_{-\t0.25\t}$$^{+\t0.18\t}_{-\t0.51\t}$$^{+\t0.35\t}_{-\t0.57\t} ~ \\times ~ 10^{\t-2\t}$\t&\t$\t-4.79\t^{+\t2.95\t}_{-\t1.53\t}$$^{+\t0.18\t}_{-\t0.09\t}$$^{+\t2.95\t}_{-\t1.53\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t40\t ; \t50\t]\t&\t$\t-1.04\t^{+\t0.03\t}_{-\t0.03\t}$$^{+\t0.03\t}_{-\t0.04\t}$$^{+\t0.04\t}_{-\t0.05\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t-5.72\t^{+\t2.65\t}_{-\t1.34\t}$$^{+\t0.14\t}_{-\t0.16\t}$$^{+\t2.66\t}_{-\t1.35\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t50\t ; \t60\t]\t&\t$\t-1.08\t^{+\t0.03\t}_{-\t0.03\t}$$^{+\t0.01\t}_{-\t0.07\t}$$^{+\t0.04\t}_{-\t0.08\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t-6.12\t^{+\t2.72\t}_{-\t1.48\t}$$^{+\t0.21\t}_{-\t0.13\t}$$^{+\t2.72\t}_{-\t1.49\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t60\t ; \t70\t]\t&\t$\t-1.12\t^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.03\t}_{-\t0.05\t}$$^{+\t0.04\t}_{-\t0.06\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t-6.41\t^{+\t2.74\t}_{-\t1.43\t}$$^{+\t0.15\t}_{-\t0.21\t}$$^{+\t2.74\t}_{-\t1.45\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\n\t[\t70\t ; \t80\t]\t&\t$\t-1.15\t^{+\t0.04\t}_{-\t0.03\t}$$^{+\t0.04\t}_{-\t0.05\t}$$^{+\t0.06\t}_{-\t0.06\t} ~ \\times ~ 10^{\t-1\t}$\t&\t$\t-7.03\t^{+\t2.95\t}_{-\t1.46\t}$$^{+\t0.24\t}_{-\t0.21\t}$$^{+\t2.96\t}_{-\t1.47\t} ~ \\times ~ 10^{\t-2\t}$\t\\\\\t\\hline\\end{tabular}\n\\caption{\\label{tab:afb-ptt} ${p_{T,t\\bar t}}$ dependent ${\\rm A_{FB}}$ in NLO and NNLO QCD. The format is $central\\pm scales\\pm pdf\\pm total$.}\n\\end{center}\n\\end{table}\n\n\n\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{Aaltonen:2009iz} \n  T.~Aaltonen {\\it et al.} [CDF Collaboration],\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 102}, 222003 (2009)\n  doi:10.1103/PhysRevLett.102.222003\n  [arXiv:0903.2850 [hep-ex]].\n\n\n\\bibitem{CDF:2013gna} \n  T.~Aaltonen {\\it et al.} [CDF Collaboration],\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 111}, no. 18, 182002 (2013)\n  [arXiv:1306.2357 [hep-ex]].\n  \n\n\n\\bibitem{CDF:public} \nSupplemental information from the CDF Collaboration:\\\\ \n\\url{http://www-cdf.fnal.gov/physics/new/top/2013/TopAngularXS/}\n\n\n\\bibitem{Abazov:2010js} \n  V.~M.~Abazov {\\it et al.} [D0 Collaboration],\n  \n  Phys.\\ Lett.\\ B {\\bf 693}, 515 (2010)\n  doi:10.1016/j.physletb.2010.09.011\n  [arXiv:1001.1900 [hep-ex]].\n  \n  \n\n\\bibitem{Abazov:2014vga} \n  V.~M.~Abazov {\\it et al.} [D0 Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 9, 092006 (2014)\n  [arXiv:1401.5785 [hep-ex]].\n  \n\n\n\\bibitem{D0:public} \nSupplemental information from the D\\O\\ Collaboration:\\\\ \n\\url{http://www-d0.fnal.gov/Run2Physics/WWW/results/final/TOP/T14D/}\n\n\n\\bibitem{Aaltonen:2012it} \n  T.~Aaltonen {\\it et al.}  [CDF Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 87}, 092002 (2013)\n  [arXiv:1211.1003 [hep-ex]].\n  \n\n\n\\bibitem{CDF:NoteAFBslope} \n  T.~Aaltonen {\\it et al.}  [CDF Collaboration],\n  \n CDF Public Note 11161.\n\n\n\\bibitem{Abazov:2014cca} \n  V.~M.~Abazov {\\it et al.} [D0 Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 7, 072011 (2014)\n  [arXiv:1405.0421 [hep-ex]].\n  \n\n\n\\bibitem{Czakon:2014xsa} \n  M.~Czakon, P.~Fiedler and A.~Mitov,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 5, 052001 (2015)\n  [arXiv:1411.3007 [hep-ph]].\n  \n\n\n\\bibitem{Wang:2015lna} \n  S.~Q.~Wang, X.~G.~Wu, Z.~G.~Si and S.~J.~Brodsky,\n  \n  Phys.\\ Rev.\\ D {\\bf 93}, 014004 (2016)\n  [arXiv:1508.03739 [hep-ph]].\n  \n\n\n\\bibitem{Brodsky:2011ta} \n  S.~J.~Brodsky and X.~G.~Wu,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 034038 (2012)\n  [Phys.\\ Rev.\\ D {\\bf 86}, 079903 (2012)]\n  doi:10.1103/PhysRevD.85.034038, 10.1103/PhysRevD.86.079903\n  [arXiv:1111.6175 [hep-ph]].\n\n\n\\bibitem{Gao:2012ja} \n  J.~Gao, C.~S.~Li and H.~X.~Zhu,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 4, 042001 (2013)\n  [arXiv:1210.2808 [hep-ph]].\n  \n\n\n\\bibitem{Brucherseifer:2013iv} \n  M.~Brucherseifer, F.~Caola and K.~Melnikov,\n  \n  JHEP {\\bf 1304}, 059 (2013)\n  [arXiv:1301.7133 [hep-ph]].\n  \n\n\\bibitem{Campbell:2010ff}\n  J.~M.~Campbell and R.~K.~Ellis,\n  \n  Nucl.\\ Phys.\\ Proc.\\ Suppl.\\  {\\bf 205-206} (2010) 10\n  [arXiv:1007.3492 [hep-ph]].\n  \n\n\\bibitem{Alioli:2010xd}\n  S.~Alioli, P.~Nason, C.~Oleari and E.~Re,\n  \n  JHEP {\\bf 1006} (2010) 043\n    [arXiv:1002.2581 [hep-ph]].\n  \n\n\\bibitem{Alwall:2014hca}\n  J.~Alwall {\\it et al.},\n  \n  JHEP {\\bf 1407} (2014) 079\n    [arXiv:1405.0301 [hep-ph]].\n  \n\n\\bibitem{Gleisberg:2008ta}\n  T.~Gleisberg, S.~Hoeche, F.~Krauss, M.~Schonherr, S.~Schumann, F.~Siegert and J.~Winter,\n  \n  JHEP {\\bf 0902} (2009) 007\n  [arXiv:0811.4622 [hep-ph]].\n  \n\n\n\\bibitem{Bevilacqua:2011xh}\n  G.~Bevilacqua, M.~Czakon, M.~V.~Garzelli, A.~van Hameren, A.~Kardos, C.~G.~Papadopoulos, R.~Pittau and M.~Worek,\n  \n  Comput.\\ Phys.\\ Commun.\\  {\\bf 184} (2013) 986\n  [arXiv:1110.1499 [hep-ph]].\n  \n\n\\bibitem{Denner:2010jp}\n  A.~Denner, S.~Dittmaier, S.~Kallweit and S.~Pozzorini,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 106} (2011) 052001\n    [arXiv:1012.3975 [hep-ph]].\n  \n\n\\bibitem{Bevilacqua:2010qb}\n  G.~Bevilacqua, M.~Czakon, A.~van Hameren, C.~G.~Papadopoulos and M.~Worek,\n  \n  JHEP {\\bf 1102} (2011) 083\n    [arXiv:1012.4230 [hep-ph]].\n  \n\n\\bibitem{Denner:2012yc}\n  A.~Denner, S.~Dittmaier, S.~Kallweit and S.~Pozzorini,\n  \n  JHEP {\\bf 1210} (2012) 110\n    [arXiv:1207.5018 [hep-ph]].\n  \n\n\\bibitem{Frederix:2013gra}\n  R.~Frederix,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 112} (2014) 8,  082002\n    [arXiv:1311.4893 [hep-ph]].\n  \n\n\\bibitem{Cascioli:2013wga}\n  F.~Cascioli, S.~Kallweit, P.~Maierhoefer and S.~Pozzorini,\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 74} (2014) 3,  2783\n   [arXiv:1312.0546 [hep-ph]].\n  \n\n\\bibitem{Heinrich:2013qaa}\n  G.~Heinrich, A.~Maier, R.~Nisius, J.~Schlenk and J.~Winter,\n  \n  JHEP {\\bf 1406} (2014) 158\n    [arXiv:1312.6659 [hep-ph]].\n  \n\n\\bibitem{Denner:2015yca}\n  A.~Denner and R.~Feger,\n  \n  JHEP {\\bf 1511} (2015) 209\n    [arXiv:1506.07448 [hep-ph]].\n  \n\n\\bibitem{Bevilacqua:2015qha}\n  G.~Bevilacqua, H.~B.~Hartanto, M.~Kraus and M.~Worek,\n  \n  arXiv:1509.09242 [hep-ph].\n  \n\n\\bibitem{Bernreuther:2010ny}\n  W.~Bernreuther and Z.~G.~Si,\n  \n  Nucl.\\ Phys.\\ B {\\bf 837} (2010) 90\n    [arXiv:1003.3926 [hep-ph]].\n  \n\n\\bibitem{Melnikov:2009dn}\n  K.~Melnikov and M.~Schulze,\n  \n  JHEP {\\bf 0908} (2009) 049\n    [arXiv:0907.3090 [hep-ph]].\n  \n\n\\bibitem{Campbell:2012uf}\n  J.~M.~Campbell and R.~K.~Ellis,\n  \n  J.\\ Phys.\\ G {\\bf 42} (2015) 1,  015005\n    [arXiv:1204.1513 [hep-ph]].\n  \n\n\\bibitem{Campbell:2014kua}\n  J.~M.~Campbell, R.~K.~Ellis, P.~Nason and E.~Re,\n  \n  JHEP {\\bf 1504} (2015) 114\n    [arXiv:1412.1828 [hep-ph]].\n  \n\n  \n\\bibitem{GehrmannDeRidder:2008ug} \n  A.~Gehrmann-De Ridder, T.~Gehrmann, E.~W.~N.~Glover and G.~Heinrich,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 100}, 172001 (2008)\n  [arXiv:0802.0813 [hep-ph]].\n  \n  \n\n\\bibitem{GehrmannDeRidder:2007hr} \n  A.~Gehrmann-De Ridder, T.~Gehrmann, E.~W.~N.~Glover and G.~Heinrich,\n  \n  JHEP {\\bf 0712}, 094 (2007)\n  [arXiv:0711.4711 [hep-ph]].\n  \n\n\n\\bibitem{Weinzierl:2008iv} \n  S.~Weinzierl,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 101}, 162001 (2008)\n  [arXiv:0807.3241 [hep-ph]].\n  \n\n\n\\bibitem{Weinzierl:2009ms} \n  S.~Weinzierl,\n  \n  JHEP {\\bf 0906}, 041 (2009)\n  [arXiv:0904.1077 [hep-ph]].\n  \n\n\n\\bibitem{DelDuca:2015zqa} \n  V.~Del Duca, C.~Duhr, G.~Somogyi, F.~Tramontano and Z.~Trocsanyi,\n  \n  JHEP {\\bf 1504}, 036 (2015)\n  [arXiv:1501.07226 [hep-ph]].\n  \n\n\n\\bibitem{Grazzini:2008tf} \n  M.~Grazzini,\n  \n  JHEP {\\bf 0802}, 043 (2008)\n  [arXiv:0801.3232 [hep-ph]].\n  \n\n\n\\bibitem{Catani:2009sm} \n  S.~Catani, L.~Cieri, G.~Ferrera, D.~de Florian and M.~Grazzini,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 103}, 082001 (2009)\n   [arXiv:0903.2120 [hep-ph]].\n  \n  \n\n\\bibitem{Ferrera:2011bk} \n  G.~Ferrera, M.~Grazzini and F.~Tramontano,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 107}, 152003 (2011)\n  [arXiv:1107.1164 [hep-ph]].\n  \n\n\n\\bibitem{Catani:2011qz} \n  S.~Catani, L.~Cieri, D.~de Florian, G.~Ferrera and M.~Grazzini,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 108}, 072001 (2012)\n  [arXiv:1110.2375 [hep-ph]].\n  \n\n\n\\bibitem{Grazzini:2013bna} \n  M.~Grazzini, S.~Kallweit, D.~Rathlev and A.~Torre,\n  \n  Phys.\\ Lett.\\ B {\\bf 731}, 204 (2014)\n  [arXiv:1309.7000 [hep-ph]].\n  \n  \n\n\\bibitem{Grazzini:2015nwa} \n  M.~Grazzini, S.~Kallweit and D.~Rathlev,\n  \n  JHEP {\\bf 1507}, 085 (2015)\n  [arXiv:1504.01330 [hep-ph]].\n  \n\n\n\\bibitem{Cascioli:2014yka} \n  F.~Cascioli {\\it et al.},\n  \n  Phys.\\ Lett.\\ B {\\bf 735}, 311 (2014)\n  [arXiv:1405.2219 [hep-ph]].\n  \n\n\n\\bibitem{Gehrmann:2014fva} \n  T.~Gehrmann, M.~Grazzini, S.~Kallweit, P.~Maierhoefer, A.~von Manteuffel, S.~Pozzorini, D.~Rathlev and L.~Tancredi,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 113}, no. 21, 212001 (2014)\n  [arXiv:1408.5243 [hep-ph]].\n  \n\n  \n\\bibitem{Grazzini:2015hta} \n  M.~Grazzini, S.~Kallweit and D.~Rathlev,\n  \n  Phys.\\ Lett.\\ B {\\bf 750}, 407 (2015)\n  [arXiv:1507.06257 [hep-ph]].\n  \n\n\n\\bibitem{Boughezal:2015aha} \n  R.~Boughezal, C.~Focke, W.~Giele, X.~Liu and F.~Petriello,\n  \n  Phys.\\ Lett.\\ B {\\bf 748}, 5 (2015)\n  [arXiv:1505.03893 [hep-ph]].\n  \n  \n\n\\bibitem{Boughezal:2015ded} \n  R.~Boughezal, J.~M.~Campbell, R.~K.~Ellis, C.~Focke, W.~T.~Giele, X.~Liu and F.~Petriello,\n  \n  arXiv:1512.01291 [hep-ph].\n  \n\n\n\\bibitem{Campbell:2016jau} \n  J.~M.~Campbell, R.~K.~Ellis and C.~Williams,\n  \n  arXiv:1601.00658 [hep-ph].\n  \n\n\n\\bibitem{Ridder:2013mf} \n  A.~Gehrmann-De Ridder, T.~Gehrmann, E.~W.~N.~Glover and J.~Pires,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 16, 162003 (2013)\n  [arXiv:1301.7310 [hep-ph]].\n  \n\n\n\\bibitem{Currie:2013dwa} \n  J.~Currie, A.~Gehrmann-De Ridder, E.~W.~N.~Glover and J.~Pires,\n  \n  JHEP {\\bf 1401}, 110 (2014)\n  [arXiv:1310.3993 [hep-ph]].\n  \n\n\n\\bibitem{Chen:2014gva} \n  X.~Chen, T.~Gehrmann, E.~W.~N.~Glover and M.~Jaquier,\n  \n  Phys.\\ Lett.\\ B {\\bf 740}, 147 (2015)\n  [arXiv:1408.5325 [hep-ph]].\n  \n\n\n\\bibitem{Ridder:2015dxa} \n  A.~Gehrmann-De Ridder, T.~Gehrmann, E.~W.~N.~Glover, A.~Huss and T.~A.~Morgan,\n  \n  arXiv:1507.02850 [hep-ph].\n  \n  \n\n\\bibitem{Boughezal:2011jf} \n  R.~Boughezal, K.~Melnikov and F.~Petriello,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 034025 (2012)\n  [arXiv:1111.7041 [hep-ph]].\n  \n  \n\n\\bibitem{Brucherseifer:2013cu} \n  M.~Brucherseifer, F.~Caola and K.~Melnikov,\n  \n  Phys.\\ Lett.\\ B {\\bf 721}, 107 (2013)\n  [arXiv:1302.0444 [hep-ph]].\n  \n  \n\n\\bibitem{Boughezal:2013uia} \n  R.~Boughezal, F.~Caola, K.~Melnikov, F.~Petriello and M.~Schulze,\n  \n  JHEP {\\bf 1306}, 072 (2013)\n  [arXiv:1302.6216 [hep-ph]].\n  \n\n\n\\bibitem{Boughezal:2015dra} \n  R.~Boughezal, F.~Caola, K.~Melnikov, F.~Petriello and M.~Schulze,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 8, 082003 (2015)\n  [arXiv:1504.07922 [hep-ph]].\n  \n  \n\n\\bibitem{Caola:2014daa} \n  F.~Caola, A.~Czarnecki, Y.~Liang, K.~Melnikov and R.~Szafron,\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 5, 053004 (2014)\n  [arXiv:1403.3386 [hep-ph]].\n  \n\n\n\\bibitem{Brucherseifer:2014ama} \n  M.~Brucherseifer, F.~Caola and K.~Melnikov,\n  \n  Phys.\\ Lett.\\ B {\\bf 736}, 58 (2014)\n  [arXiv:1404.7116 [hep-ph]].\n  \n\n\n\\bibitem{Caola:2015wna} \n  F.~Caola, K.~Melnikov and M.~Schulze,\n  \n  Phys.\\ Rev.\\ D {\\bf 92}, no. 7, 074032 (2015)\n  [arXiv:1508.02684 [hep-ph]].\n  \n\n\n\\bibitem{Catani:2007vq} \n  S.~Catani and M.~Grazzini,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 98}, 222002 (2007)\n  [hep-ph/0703012].\n  \n\n\n\\bibitem{Boughezal:2015dva} \n  R.~Boughezal, C.~Focke, X.~Liu and F.~Petriello,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 6, 062002 (2015)\n  [arXiv:1504.02131 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2014oma} \n  M.~Czakon and D.~Heymes,\n  \n  Nucl.\\ Phys.\\ B {\\bf 890}, 152 (2014)\n  [arXiv:1408.2500 [hep-ph]].\n  \n\n\n\\bibitem{GehrmannDeRidder:2005cm} \n  A.~Gehrmann-De Ridder, T.~Gehrmann and E.~W.~N.~Glover,\n  \n  JHEP {\\bf 0509}, 056 (2005)\n  [hep-ph/0505111].\n  \n\n\n\\bibitem{Somogyi:2006da} \n  G.~Somogyi, Z.~Trocsanyi and V.~Del Duca,\n  \n  JHEP {\\bf 0701}, 070 (2007)\n  [hep-ph/0609042].\n  \n\n\n\\bibitem{Somogyi:2006db} \n  G.~Somogyi and Z.~Trocsanyi,\n  \n  JHEP {\\bf 0701}, 052 (2007)\n  [hep-ph/0609043].\n  \n\n\n\\bibitem{Somogyi:2008fc} \n  G.~Somogyi and Z.~Trocsanyi,\n  \n  JHEP {\\bf 0808}, 042 (2008)\n  [arXiv:0807.0509 [hep-ph]].\n  \n  \n  \n\\bibitem{Bolzoni:2010bt} \n  P.~Bolzoni, G.~Somogyi and Z.~Trocsanyi,\n  \n  JHEP {\\bf 1101}, 059 (2011)\n  [arXiv:1011.1909 [hep-ph]].\n  \n\n\n\\bibitem{Somogyi:2013yk} \n  G.~Somogyi,\n  \n  JHEP {\\bf 1304}, 010 (2013)\n  [arXiv:1301.3919 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2010td} \n  M.~Czakon,\n  \n  Phys.\\ Lett.\\ B {\\bf 693}, 259 (2010)\n  [arXiv:1005.0274 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2011ve} \n  M.~Czakon,\n  \n  Nucl.\\ Phys.\\ B {\\bf 849}, 250 (2011)\n  [arXiv:1101.0642 [hep-ph]].\n  \n\n\n\\bibitem{Gaunt:2015pea} \n  J.~Gaunt, M.~Stahlhofen, F.~J.~Tackmann and J.~R.~Walsh,\n  \n  JHEP {\\bf 1509}, 058 (2015)\n  [arXiv:1505.04794 [hep-ph]].\n  \n  \n\n\\bibitem{Anastasiou:2000kg} \n  C.~Anastasiou, E.~W.~N.~Glover, C.~Oleari and M.~E.~Tejeda-Yeomans,\n  \n  Nucl.\\ Phys.\\ B {\\bf 601}, 318 (2001)\n  [hep-ph/0010212].\n  \n\n\n\\bibitem{Anastasiou:2000ue} \n  C.~Anastasiou, E.~W.~N.~Glover, C.~Oleari and M.~E.~Tejeda-Yeomans,\n  \n  Nucl.\\ Phys.\\ B {\\bf 601}, 341 (2001)\n  [hep-ph/0011094].\n  \n\n\n\\bibitem{Anastasiou:2001sv} \n  C.~Anastasiou, E.~W.~N.~Glover, C.~Oleari and M.~E.~Tejeda-Yeomans,\n  \n  Nucl.\\ Phys.\\ B {\\bf 605}, 486 (2001)\n  [hep-ph/0101304].\n  \n  \n\n\\bibitem{Glover:2001af} \n  E.~W.~N.~Glover, C.~Oleari and M.~E.~Tejeda-Yeomans,\n  \n  Nucl.\\ Phys.\\ B {\\bf 605}, 467 (2001)\n  [hep-ph/0102201].\n  \n  \n\n\\bibitem{Bern:2002tk} \n  Z.~Bern, A.~De Freitas and L.~J.~Dixon,\n  \n  JHEP {\\bf 0203}, 018 (2002)\n  [hep-ph/0201161].\n  \n\n\n\\bibitem{Bern:2003ck} \n  Z.~Bern, A.~De Freitas and L.~J.~Dixon,\n  \n  JHEP {\\bf 0306}, 028 (2003)\n  [JHEP {\\bf 1404}, 112 (2014)]\n  [hep-ph/0304168].\n  \n  \n  \n\n\\bibitem{Czakon:2008zk} \n  M.~Czakon,\n  \n  Phys.\\ Lett.\\ B {\\bf 664}, 307 (2008)\n  [arXiv:0803.1400 [hep-ph]].\n  \n\n\n\\bibitem{Baernreuther:2013caa} \n  P.~Baernreuther, M.~Czakon and P.~Fiedler,\n  \n  JHEP {\\bf 1402}, 078 (2014)\n  [arXiv:1312.6279 [hep-ph]].\n  \n  \n\n\\bibitem{Bonciani:2008az} \n  R.~Bonciani, A.~Ferroglia, T.~Gehrmann, D.~Maitre and C.~Studerus,\n  \n  JHEP {\\bf 0807}, 129 (2008)\n  [arXiv:0806.2301 [hep-ph]].\n  \n  \n\n\\bibitem{Bonciani:2009nb} \n  R.~Bonciani, A.~Ferroglia, T.~Gehrmann and C.~Studerus,\n  \n  JHEP {\\bf 0908}, 067 (2009)\n  [arXiv:0906.3671 [hep-ph]].\n  \n\n\n\\bibitem{Bonciani:2010mn} \n  R.~Bonciani, A.~Ferroglia, T.~Gehrmann, A.~von Manteuffel and C.~Studerus,\n  \n  JHEP {\\bf 1101}, 102 (2011)\n  [arXiv:1011.6661 [hep-ph]].\n  \n\n\n\\bibitem{Bonciani:2013ywa} \n  R.~Bonciani, A.~Ferroglia, T.~Gehrmann, A.~von Manteuffel and C.~Studerus,\n  \n  JHEP {\\bf 1312}, 038 (2013)\n  [arXiv:1309.4450 [hep-ph]].\n  \n\n\n\\bibitem{Gehrmann:2013cxs} \n  T.~Gehrmann, L.~Tancredi and E.~Weihs,\n  \n  JHEP {\\bf 1308}, 070 (2013)\n  [arXiv:1306.6344, arXiv:1306.6344 [hep-ph]].\n  \n\n\n\\bibitem{Gehrmann:2014bfa} \n  T.~Gehrmann, A.~von Manteuffel, L.~Tancredi and E.~Weihs,\n  \n  JHEP {\\bf 1406}, 032 (2014)\n  [arXiv:1404.4853 [hep-ph]].\n  \n  \n\n\\bibitem{Henn:2014lfa} \n  J.~M.~Henn, K.~Melnikov and V.~A.~Smirnov,\n  \n  JHEP {\\bf 1405}, 090 (2014)\n  [arXiv:1402.7078 [hep-ph]].\n  \n  \n\n\n\\bibitem{Caola:2014lpa} \n  F.~Caola, J.~M.~Henn, K.~Melnikov and V.~A.~Smirnov,\n  \n  JHEP {\\bf 1409}, 043 (2014)\n  [arXiv:1404.5590 [hep-ph]].\n  \n\n\n\\bibitem{Papadopoulos:2014hla} \n  C.~G.~Papadopoulos, D.~Tommasini and C.~Wever,\n  \n  JHEP {\\bf 1501}, 072 (2015)\n  [arXiv:1409.6114 [hep-ph]].\n  \n\n\n\\bibitem{Caola:2014iua} \n  F.~Caola, J.~M.~Henn, K.~Melnikov, A.~V.~Smirnov and V.~A.~Smirnov,\n  \n  JHEP {\\bf 1411}, 041 (2014)\n  [arXiv:1408.6409 [hep-ph]].\n  \n\n\n\\bibitem{Gehrmann:2015ora} \n  T.~Gehrmann, A.~von Manteuffel and L.~Tancredi,\n  \n  JHEP {\\bf 1509}, 128 (2015)\n  [arXiv:1503.04812 [hep-ph]].\n  \n\n\n\\bibitem{vonManteuffel:2015msa} \n  A.~von Manteuffel and L.~Tancredi,\n  \n  JHEP {\\bf 1506}, 197 (2015)\n  [arXiv:1503.08835 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2015owf} \n  M.~Czakon, D.~Heymes and A.~Mitov,\n  \n  arXiv:1511.00549 [hep-ph].\n  \n\n\n\\bibitem{Abelof:2015lna} \n  G.~Abelof, A.~Gehrmann-De Ridder and I.~Majer,\n  \n  JHEP {\\bf 1512}, 074 (2015)\n  [arXiv:1506.04037 [hep-ph]].\n  \n  \n\n\\bibitem{Abelof:2014fza} \n  G.~Abelof, A.~Gehrmann-De Ridder, P.~Maierhofer and S.~Pozzorini,\n  \n  JHEP {\\bf 1408}, 035 (2014)\n  [arXiv:1404.6493 [hep-ph]].\n  \n\n\n\\bibitem{Bonciani:2015sha} \n  R.~Bonciani, S.~Catani, M.~Grazzini, H.~Sargsyan and A.~Torre,\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 75}, no. 12, 581 (2015)\n  [arXiv:1508.03585 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2013goa} \n  M.~Czakon, P.~Fiedler and A.~Mitov,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 25, 252004 (2013)\n  [arXiv:1303.6254 [hep-ph]].\n  \n\n  \n\\bibitem{Weinzierl:2011uz} \n  S.~Weinzierl,\n  \n  Phys.\\ Rev.\\ D {\\bf 84}, 074007 (2011)\n  [arXiv:1107.5131 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2012pz} \n  M.~Czakon and A.~Mitov,\n  \n  JHEP {\\bf 1301}, 080 (2013)\n  [arXiv:1210.6832 [hep-ph]].\n  \n\n\n\\bibitem{Czakon:2012zr} \n  M.~Czakon and A.~Mitov,\n  \n  JHEP {\\bf 1212}, 054 (2012)\n  [arXiv:1207.0236 [hep-ph]].\n  \n\n\n\\bibitem{Baernreuther:2012ws} \n  P.~B\\\"arnreuther, M.~Czakon and A.~Mitov,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 109}, 132001 (2012)\n  [arXiv:1204.5201 [hep-ph]].\n  \n  \n  \n\\bibitem{Ferroglia:2009ii} \n  A.~Ferroglia, M.~Neubert, B.~D.~Pecjak and L.~L.~Yang,\n  \n  JHEP {\\bf 0911}, 062 (2009)\n  [arXiv:0908.3676 [hep-ph]].\n  \n\n\n\\bibitem{Anastasiou:2008vd} \n  C.~Anastasiou and S.~M.~Aybat,\n  \n  Phys.\\ Rev.\\ D {\\bf 78}, 114006 (2008)\n  [arXiv:0809.1355 [hep-ph]].\n  \n\n\n\\bibitem{Dittmaier:2007wz}\n S.~Dittmaier, P.~Uwer, S.~Weinzierl,\n \n Phys.\\ Rev.\\ Lett.\\  {\\bf 98}, 262002 (2007)\n [hep-ph/0703120 [hep-ph]];\n\n\n\n \n Eur.\\ Phys.\\ J.\\  {\\bf C59}, 625-646 (2009)\n [arXiv:0810.0452 [hep-ph]].\n  \n\n\\bibitem{Czakon:2011xx} \n  M.~Czakon and A.~Mitov,\n  \n  Comput.\\ Phys.\\ Commun.\\  {\\bf 185}, 2930 (2014)\n  [arXiv:1112.5675 [hep-ph]].\n  \n  \n\n\\bibitem{Cacciari:2008zb} \n  M.~Cacciari, S.~Frixione, M.~L.~Mangano, P.~Nason and G.~Ridolfi,\n  \n  JHEP {\\bf 0809}, 127 (2008)\n  [arXiv:0804.2800 [hep-ph]].\n  \n\n\n\\bibitem{Martin:2009iq} \n  A.~D.~Martin, W.~J.~Stirling, R.~S.~Thorne and G.~Watt,\n  \n  Eur.\\ Phys.\\ J.\\ C {\\bf 63}, 189 (2009)\n  [arXiv:0901.0002 [hep-ph]].\n  \n\n\n\\bibitem{Gao:2013xoa} \n  J.~Gao {\\it et al.},\n  \n  Phys.\\ Rev.\\ D {\\bf 89}, no. 3, 033009 (2014)\n  [arXiv:1302.6246 [hep-ph]].\n  \n\n\n\\bibitem{Ball:2012cx} \n  R.~D.~Ball {\\it et al.},\n  \n  Nucl.\\ Phys.\\ B {\\bf 867}, 244 (2013)\n  [arXiv:1207.1303 [hep-ph]].\n  \n  \n\n\\bibitem{CooperSarkar:2011aa} \n  A.~M.~Cooper-Sarkar [ZEUS and H1 Collaborations],\n  \n  PoS EPS {\\bf -HEP2011}, 320 (2011)\n  [arXiv:1112.2107 [hep-ph]].\n  \n\n\n\\bibitem{Bernreuther:2012sx} \n  W.~Bernreuther and Z.~G.~Si,\n  \n  Phys.\\ Rev.\\ D {\\bf 86}, 034026 (2012)\n  [arXiv:1205.6580 [hep-ph]].\n  \n\n\n\\bibitem{Ahrens:2010zv} \n  V.~Ahrens, A.~Ferroglia, M.~Neubert, B.~D.~Pecjak and L.~L.~Yang,\n  \n  JHEP {\\bf 1009}, 097 (2010)\n  [arXiv:1003.5827 [hep-ph]].\n  \n\n\n\\bibitem{Ferroglia:2015ivv} \n  A.~Ferroglia, B.~D.~Pecjak, D.~J.~Scott and L.~L.~Yang,\n  \n  arXiv:1512.02535 [hep-ph].\n  \n\n\n\\bibitem{Ferroglia:2013zwa} \n  A.~Ferroglia, B.~D.~Pecjak and L.~L.~Yang,\n  \n  JHEP {\\bf 1309}, 032 (2013)\n  [arXiv:1306.1537 [hep-ph]].\n  \n\n\n\\bibitem{Ahrens:2011mw} \n  V.~Ahrens, A.~Ferroglia, M.~Neubert, B.~D.~Pecjak and L.~L.~Yang,\n  \n  JHEP {\\bf 1109}, 070 (2011)\n  [arXiv:1103.0550 [hep-ph]].\n  \n\n\n\\bibitem{Kidonakis:2010dk} \n  N.~Kidonakis,\n  \n  Phys.\\ Rev.\\ D {\\bf 82}, 114030 (2010)\n  [arXiv:1009.4935 [hep-ph]].\n  \n\n\n\\bibitem{Kidonakis:2011zn} \n  N.~Kidonakis,\n  \n  Phys.\\ Rev.\\ D {\\bf 84}, 011504 (2011)\n  [arXiv:1105.5167 [hep-ph]].\n  \n\n\n\\bibitem{Melnikov:2010iu} \n  K.~Melnikov and M.~Schulze,\n  \n  Nucl.\\ Phys.\\ B {\\bf 840}, 129 (2010)\n  [arXiv:1004.3284 [hep-ph]].\n  \n\n\n\\bibitem{Melnikov:2011qx} \n  K.~Melnikov, A.~Scharf and M.~Schulze,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 054002 (2012)\n  [arXiv:1111.4991 [hep-ph]].\n  \n    \n\n\\bibitem{Hoeche:2013mua} \n  S.~Hoeche, J.~Huang, G.~Luisoni, M.~Schoenherr and J.~Winter,\n  \n  Phys.\\ Rev.\\ D {\\bf 88}, no. 1, 014040 (2013)\n  [arXiv:1306.2703 [hep-ph]].\n  \n\n\n\\bibitem{Gripaios:2013rda} \n  B.~Gripaios, A.~Papaefstathiou and B.~Webber,\n  \n  JHEP {\\bf 1311}, 105 (2013)\n  [arXiv:1309.0810 [hep-ph]].\n  \n\n\n\\bibitem{Almeida:2008ug} \n  L.~G.~Almeida, G.~F.~Sterman and W.~Vogelsang,\n  \n  Phys.\\ Rev.\\ D {\\bf 78}, 014008 (2008)\n  [arXiv:0805.1885 [hep-ph]].\n  \n\n\n\\bibitem{Ahrens:2011uf} \n  V.~Ahrens, A.~Ferroglia, M.~Neubert, B.~D.~Pecjak and L.~L.~Yang,\n  \n  Phys.\\ Rev.\\ D {\\bf 84}, 074004 (2011)\n  [arXiv:1106.6051 [hep-ph]].\n  \n\n\n\\bibitem{Skands:2012mm} \n  P.~Skands, B.~Webber and J.~Winter,\n  \n  JHEP {\\bf 1207}, 151 (2012)\n  [arXiv:1205.1466 [hep-ph]].\n  \n\n\n\\bibitem{Kidonakis:2015ona} \n  N.~Kidonakis,\n  \n  Phys.\\ Rev.\\ D {\\bf 91}, no. 7, 071502 (2015)\n  [arXiv:1501.01581 [hep-ph]].\n  \n\n\n\\bibitem{Cacciari:2011hy} \n  M.~Cacciari, M.~Czakon, M.~Mangano, A.~Mitov and P.~Nason,\n  \n  Phys.\\ Lett.\\ B {\\bf 710}, 612 (2012)\n  [arXiv:1111.5869 [hep-ph]].\n  \n\n\n\\bibitem{Mrenna:1996cz} \n  S.~Mrenna and C.~P.~Yuan,\n  \n  Phys.\\ Rev.\\ D {\\bf 55}, 120 (1997)\n  [hep-ph/9606363].\n  \n\n\n\\bibitem{Li:2013mia} \n  H.~T.~Li, C.~S.~Li, D.~Y.~Shao, L.~L.~Yang and H.~X.~Zhu,\n  \n  Phys.\\ Rev.\\ D {\\bf 88}, 074004 (2013)\n  [arXiv:1307.2464].\n  \n\n\n\\bibitem{Czakon:2015pga} \n  M.~Czakon, A.~Mitov and J.~Rojo,\n  \n  arXiv:1501.01112 [hep-ph].\n  \n\n\n\\bibitem{Czakon:2013tha} \n  M.~Czakon, M.~L.~Mangano, A.~Mitov and J.~Rojo,\n  \n  JHEP {\\bf 1307}, 167 (2013)\n  [arXiv:1303.7215 [hep-ph]].\n  \n\n\n\\bibitem{Aad:2014zka} \n  G.~Aad {\\it et al.} [ATLAS Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 7, 072004 (2014)\n  [arXiv:1407.0371 [hep-ex]].\n  \n    \n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 64244, "prevtext": "\n\nand the values of the pair of coefficients $\\alpha_M$ and $\\beta_M$ for the central, lowest and highest predicted values are given in table~\\ref{tab:slope}.\n\n\\begin{table}[h]\n\\begin{center}\n\\begin{tabular}{| c | c | c | c | c | c | c |}\n\\hline\n & ${\\rm NLO_{cent}}$ & ${\\rm NLO_{min}}$ & ${\\rm NLO_{max}}$  & ${\\rm NNLO_{cent}}$ & ${\\rm NNLO_{min}}$ & ${\\rm NNLO_{max}}$ \\\\ \\hline\n$\\alpha_M \\times 10^{3}{\\, \\rm GeV}$ & 0.377 & 0.255 & 0.709 & 0.404 & 0.364 & 0.405 \\\\ \\hline\n$\\beta_M$ & -0.111 & -0.070 & -0.235 & -0.106 & -0.097 & -0.101 \\\\ \\hline\n\\end{tabular}\n\\caption{\\label{tab:slope} Values of the pairs of coefficients $(\\alpha_M, \\beta_M)$ from eq.~(\\ref{eq:beta_M}) for the central/lowest/maximal computed bin values in NLO and NNLO QCD.}\n\\end{center}\n\\end{table}\n\n\nIn fig.~\\ref{fig:slope}(right) we compare the linear fits eq.~(\\ref{eq:beta_M}) to the central value of ${\\rm A_{FB}}$, at NLO and NNLO, with the calculated central ${\\rm A_{FB}}$ bin values. To give a better perspective for the quality of the linear fit we also show the theoretical error in each bin. We conclude that the ${m_{t\\bar t}}$ functional dependence of ${\\rm A_{FB}}$ is consistent with being linear in this ${m_{t\\bar t}}$ range.\n\n\nThe CDF collaboration has measured \\cite{Aaltonen:2012it} the slope of ${\\rm A_{FB}}({m_{t\\bar t}})$ and found the value $\\alpha_M^{\\rm CDF}=1.55\\pm 0.48 ~[10^{-3}{\\, \\rm GeV}^{-1}]$ which is higher than the NNLO QCD prediction eq.~(\\ref{eq:beta_M}) (a direct comparison between the two should be done with caution, however, because the intercept $\\beta_M$ was not specified in Ref.~\\cite{Aaltonen:2012it}). The corresponding D\\O\\ slope \\cite{Abazov:2014cca} reads $\\alpha_M^{\\rm D\\O }= 0.39~[10^{-3}{\\, \\rm GeV}^{-1}]$ (with $\\beta_M=-0.055$). We do not quote the errors of the measurement; for those we refer the reader to Ref.~\\cite{Abazov:2014cca}. The slope $\\alpha_M^{\\rm D\\O }$ is consistent with the NNLO QCD prediction in eq.~(\\ref{eq:beta_M}).\n\nThe differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ is divided into ten bins as shown in fig.~\\ref{fig:afb-mtt}(left), see also appendix~\\ref{sec:appendix} table~\\ref{tab:diff-mtt}. The two bins with largest ${m_{t\\bar t}}$ contain overflow events. We note the slight difference in the binning between the differential distribution in fig.~\\ref{fig:afb-mtt}(left) and the differential asymmetry fig.~\\ref{fig:afb-mtt}(right): we make the contribution from the bin $250{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 350{\\, \\rm GeV}$ explicit in fig.~\\ref{fig:afb-mtt}(left) while, in order to match the binning of the CDF ${\\rm A_{FB}}$ analysis, have absorbed it into the $350{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 450{\\, \\rm GeV}$ bin in fig.~\\ref{fig:afb-mtt}(right).\n\nWe observe that the NLO and NNLO K-factors of the differential distribution have reasonably similar shapes and $K_{\\rm NNLO}$ is smaller than $K_{\\rm NLO}$. Similarly to the other differential distributions considered above, the NNLO error band is smaller than the NLO one (by about a factor of two) and the NNLO result is consistent with the error estimate of the NLO QCD prediction. These features indicate good perturbative convergence in this observable.\n\n\nThe MC error on the differential asymmetry ${\\rm A_{FB}}({m_{t\\bar t}})$ is below 1\\% in each bin. The MC error on the differential distribution $d^2\\sigma/d{\\Delta y} d{m_{t\\bar t}}$ is around 1\\% in the two central bins with $250{\\, \\rm GeV}\\leq{m_{t\\bar t}} \\leq 350{\\, \\rm GeV}$ and below 4 permil in the remaining bins. Such high-precision in the calculation of the differential asymmetry is achieved following the strategy for the calculation of ${\\rm A_{FB}}({\\vert\\Delta y\\vert})$ described in sec.~\\ref{sec:afb-y}.\n\n\n\n\\subsection{The first Legendre moment of the $\\cos\\theta$ distribution}\\label{sec:afb-legmom}\n\n\nAs an alternative way at looking at the top-quark ${\\rm A_{FB}}$, the CDF collaboration measured \\cite{CDF:2013gna} the Legendre Moments of the differential distribution $d\\sigma/d\\cos\\theta$. The main idea is based on the realisation that the forward-backward asymmetry is almost exclusively confined to the first Legendre moment, thus offering an alternative assessment of this asymmetry. In sec.~\\ref{sec:costheta} we described the calculation of the NNLO QCD correction to these moments. The results can  be found in fig.~\\ref{fig:costheta}(right) as well as appendix~\\ref{sec:appendix} table~\\ref{tab:legmom}. We observe that the CDF measurement of $a_1$ is about $1.7 \\sigma$ above the theory prediction after {\\it naively} accounting for EW corrections. As can be anticipated from the inclusive ${\\rm A_{FB}}$, NNLO QCD and EW corrections each decrease this discrepancy.\n\n\n\n\\subsection{${p_{T,t\\bar t}}$ distribution and differential asymmetry}\n\n\n\n\\begin{figure}[h]\n\\hskip -4mm\n\\includegraphics[width=0.52\\textwidth]{Tev-PTT-dist-eps-converted-to.pdf}\n\\includegraphics[width=0.52\\textwidth]{Tev-PTT-asym-eps-converted-to.pdf}\n\\caption{\\label{fig:afb-pt} The differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ (left) and related differential asymmetry ${\\rm A_{FB}}({p_{T,t\\bar t}})$ (right). Included is SM theory through NNLO QCD. The end-bins contain overflow events. The error of the theory prediction is derived from scale and pdf variation.}\n\\end{figure}\n\nIn the following we study the ${p_{T,t\\bar t}}$-dependent forward-backward asymmetry which is of special theoretical interest. The NLO and NNLO QCD prediction for the asymmetry is shown in fig.~\\ref{fig:afb-pt}(right) and in appendix~\\ref{sec:appendix} table~\\ref{tab:afb-ptt}. We use the same bins as in Ref.~\\cite{Czakon:2014xsa} that, in turn, match the bins of the CDF analysis \\cite{Aaltonen:2012it} (however no parton-level results for ${\\rm A_{FB}}({p_{T,t\\bar t}})$ that we could compare to have been published). The differential asymmetry is divided into eight equal-width bins. The bin with largest ${p_{T,t\\bar t}}$ contains overflow events. \n\nThe shape of the ${p_{T,t\\bar t}}$-asymmetry for ${p_{T,t\\bar t}}>0$ can be derived with purely NLO calculation in the process ($t\\bar t j$) and that part of the asymmetry has been understood for quite some time \\cite{Dittmaier:2007wz}. We have verified in Ref.~\\cite{Czakon:2014xsa} the consistency of our inclusive $t\\bar t$ NNLO calculation with NLO $t\\bar t j$ predictions from Refs.~\\cite{Melnikov:2010iu,Melnikov:2011qx,Hoeche:2013mua} and found perfect agreement with an independent evaluation performed with the package \\textsc{Helac-Nlo} \\cite{Bevilacqua:2011xh}. The difference between NNLO and NLO corrections to the ${p_{T,t\\bar t}}$ asymmetry for ${p_{T,t\\bar t}}\\geq 10 {\\, \\rm GeV}$ follows the pattern noticed in CDF data \\cite{Aaltonen:2012it} and is, moreover, consistent with the analysis of Ref.~\\cite{Gripaios:2013rda}.\n\nFor reference, the differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ is shown in fig.~\\ref{fig:afb-pt}(left) as well as in appendix~\\ref{sec:appendix} table~\\ref{tab:diff-ptt}. It is divided into sixteen bins of equal width and the two bins with largest ${p_{T,t\\bar t}}$ contain overflow events. As for the differential asymmetry, the behaviour of this distribution away from the point ${p_{T,t\\bar t}}=0$ is well understood and has been extensively studied in the context of $t\\bar t j$ production in NLO QCD \\cite{Dittmaier:2007wz,Melnikov:2010iu,Melnikov:2011qx,Hoeche:2013mua}. In particular, we do not show the LO QCD contribution since it enters only the two central bins containing the point ${p_{T,t\\bar t}}=0$. The corresponding prediction can be found in appendix~\\ref{sec:appendix} table~\\ref{tab:diff-ptt}.\n\nThe relative MC error on the central value of the differential asymmetry ${\\rm A_{FB}}({p_{T,t\\bar t}})$ is below 1\\% in each of the eight bins. In some of the bins,  and for some scale choices, the predicted bin asymmetry becomes very close to zero (see fig.~\\ref{fig:afb-pt}(right)) and, as can be anticipated, in such cases the relative MC error becomes much larger. Such large relative MC errors, however, are harmless and do not adversely impact the error estimate in the corresponding bins. The rather asymmetric error in the first bin $0\\leq{p_{T,t\\bar t}}\\leq 10{\\, \\rm GeV}$ is not due to statistical effects since in this bin the relative MC error is at the sub-permil level for all $\\mu_{F,R}$ values. The relative MC error on the differential distribution $d^2\\sigma/d{\\Delta y} d{p_{T,t\\bar t}}$ is below 4 permil in all bins. The calculation of the differential asymmetry follows the strategy for minimising the MC error described in sec.~\\ref{sec:afb-y}.\n\n\n\n\\subsection{${p_{T,t\\bar t}}$ cumulative asymmetry}\n\n\nOne of the unexpected findings of Ref.~\\cite{Czakon:2014xsa} was that the NNLO QCD corrections to the inclusive ${\\rm A_{FB}}$ were significant, much larger than what had been anticipated from arguments based on soft-gluon resummation \\cite{Almeida:2008ug,Ahrens:2011uf}. These soft-gluon-based predictions are compatible with the parton shower based analysis of the top-quark ${\\rm A_{FB}}$ performed in Ref.~\\cite{Skands:2012mm} but not with the soft-gluon resummation prediction of Ref.~\\cite{Kidonakis:2011zn}, which are larger (and recently updated in Ref.~\\cite{Kidonakis:2015ona}). We presume the difference in the predictions between Ref.~\\cite{Kidonakis:2011zn} and Refs.~\\cite{Almeida:2008ug,Ahrens:2011uf} is due to different subleading terms. This is an often present ambiguity in resummed calculations matched to fixed order results of lower accuracy (NLO in this case). Our viewpoint on such subtleties has been explained at length in Ref.~\\cite{Cacciari:2011hy}; further discussion of this problem goes beyond the scope of this paper.\n\nA detailed comparison between the NNLO QCD corrections to ${\\rm A_{FB}}$ and the soft-gluon resummation based predictions was performed in Ref.~\\cite{Czakon:2014xsa} and we do not repeat it here. Our goal in the following is to elaborate on an observation made in Ref.~\\cite{Czakon:2014xsa}, namely, that the difference between the NNLO fixed order predictions and the ones based on soft-gluon resummation matched to NLO could potentially be understood by considering the ${p_{T,t\\bar t}}$ differential asymmetry. The physics behind this idea is the following: soft-gluon resummation in $t\\bar t$ production applies to kinematic configurations which are of almost 2-to-2 type, i.e. configurations where the final state consists of a top pair which takes almost all the energy available to the partonic reaction and is, possibly, accompanied by very soft radiation that carries very little energy. Since the initial state has zero transverse momentum, one necessarily arrives at kinematic configurations consisting of $t\\bar t$ pairs with small ${p_{T,t\\bar t}}$. It is hard to quantify on purely theoretical grounds how small that ${p_{T,t\\bar t}}$ would be, but as a guidance one can use the fact that the top pair $p_T$ is peaked below $10{\\, \\rm GeV}$ \\cite{Mrenna:1996cz,Li:2013mia}. Thus we expect that the bulk of the contributions from soft gluon resummation would be at small ${p_{T,t\\bar t}}$ (presumably in the first bin $0\\leq{p_{T,t\\bar t}}\\leq 10{\\, \\rm GeV}$) and will be decreasing fast with ${p_{T,t\\bar t}}$.\n\n\\footnote{One should keep in mind that in practise, implementations of soft gluon resummation typically generate noticeable contributions even in kinematical regions that are far from the relevant partonic threshold. We are not concerned with such effects here.}\n\n\nTo that end we define the {\\it cumulative} forward-backward asymmetry ${\\hat A}_{\\rm FB}({p_{T,t\\bar t}}^{\\rm cut})$. It has a single bin of variable width ${p_{T,t\\bar t}}^{\\rm cut}$, where $0\\leq{p_{T,t\\bar t}}\\leq {p_{T,t\\bar t}}^{\\rm cut}\\,\\,$, and\n\n\n", "index": 15, "text": "\\begin{equation}\n{{\\hat A}_{\\rm FB}}({p_{T,t\\bar t}}^{\\rm cut}) = {\\hat N\\over \\hat D} \\equiv {\\sigma^{+}_{\\rm c} - \\sigma^{-}_{\\rm c} \\over \\sigma^{+}_{\\rm c} + \\sigma^{-}_{\\rm c} }\n~~~,~~~\n\\sigma^\\pm_{\\mathrm{c}} = \\int \\theta(\\pm \\Delta y) \\theta({p_{T,t\\bar t}}^{\\rm cut}-{p_{T,t\\bar t}}) \\mathrm{d}\\sigma\\, ,\n\\label{eq:AcumulFB-diff}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{{\\hat{A}}_{\\rm FB}}({p_{T,t\\bar{t}}}^{\\rm cut})={\\hat{N}\\over\\hat{D}}\\equiv{%&#10;\\sigma^{+}_{\\rm c}-\\sigma^{-}_{\\rm c}\\over\\sigma^{+}_{\\rm c}+\\sigma^{-}_{\\rm c%&#10;}}~{}~{}~{},~{}~{}~{}\\sigma^{\\pm}_{\\mathrm{c}}=\\int\\theta(\\pm\\Delta y)\\theta({%&#10;p_{T,t\\bar{t}}}^{\\rm cut}-{p_{T,t\\bar{t}}})\\mathrm{d}\\sigma\\,,\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">^</mo></mover><mi>FB</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mmultiscripts><mi>p</mi><mrow><mi>T</mi><mo>,</mo><mrow><mi>t</mi><mo>⁢</mo><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">¯</mo></mover></mrow></mrow><none/><none/><mi>cut</mi></mmultiscripts><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mover accent=\"true\"><mi>N</mi><mo stretchy=\"false\">^</mo></mover><mover accent=\"true\"><mi>D</mi><mo stretchy=\"false\">^</mo></mover></mfrac><mo>≡</mo><mpadded width=\"+9.9pt\"><mfrac><mrow><msubsup><mi>σ</mi><mi mathvariant=\"normal\">c</mi><mo>+</mo></msubsup><mo>-</mo><msubsup><mi>σ</mi><mi mathvariant=\"normal\">c</mi><mo>-</mo></msubsup></mrow><mrow><msubsup><mi>σ</mi><mi mathvariant=\"normal\">c</mi><mo>+</mo></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi mathvariant=\"normal\">c</mi><mo>-</mo></msubsup></mrow></mfrac></mpadded></mrow><mo rspace=\"12.4pt\">,</mo><mrow><msubsup><mi>σ</mi><mi mathvariant=\"normal\">c</mi><mo>±</mo></msubsup><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>±</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>y</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>p</mi><mrow><mi>T</mi><mo>,</mo><mrow><mi>t</mi><mo>⁢</mo><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">¯</mo></mover></mrow></mrow><none/><none/><mi>cut</mi></mmultiscripts><mo>-</mo><msub><mi>p</mi><mrow><mi>T</mi><mo>,</mo><mrow><mi>t</mi><mo>⁢</mo><mover accent=\"true\"><mi>t</mi><mo stretchy=\"false\">¯</mo></mover></mrow></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mpadded width=\"+1.7pt\"><mi>σ</mi></mpadded></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]