[{"file": "1601.05816.tex", "nexttext": "\nwhere $r$ is the radial (spherical) coordinate, $\\Omega$ is the angular velocity and $A$ the characteristic radius where\nthe rotational velocity peaks as in \\citet{2013ApJ...776..129C}. \nWe denote models that use this rotation law as ``rot--2''.\nWe carefully selected the values of $A$ and $\\Omega$ in order to\ncapture a few full rotations (4--8) for the convective shell material \nwithin the simulated timescales in {\\it FLASH} and assess the dynamical effects of the centrifugal force.\nFor C \\& O--shell burning we picked $A = 3.46 \\times 10^{8}$~cm and $\\Omega =$~0.1~s$^{-1}$ and for\nSi--shell burning $A = 2.2 \\times 10^{8}$~cm and $\\Omega =$~0.1~s$^{-1}$ respectively. \nFigure~\\ref{Fig:vrotprof} shows the rotational velocity profiles for all models mapped in {\\it FLASH}. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=9cm,trim=0.4in 0.25in 0.5in 0.15in,clip]{vrot_profiles.pdf}\n\\caption{Rotational velocity profiles for the ``rot-ST'' (solid curves) and the ``rot-2'' (dashed\ncurves) models. Black curves denote the C\\&O shell burning phase and red curves the Si shell\nburning phase. The form of the rotational profile for the ``rot-2'' models is given by Equation~\\ref{Eq:rot_profile}.\n\\label{Fig:vrotprof}}\n\\end{center}\n\\end{figure}\n\n\\setcounter{table}{0}\n\\begin{deluxetable*}{lcccccccccc}\n\\tablewidth{0pt}\n\\tablecaption{Properties of MESA models mapped in {\\it FLASH}.}\n\\tablehead{\n\\colhead {Model} &\n\\colhead {$R_{\\rm in,sh}$~($10^{8}$~cm)} &\n\\colhead{$R_{\\rm out,sh}$~($10^{8}$~cm)} &\n\\colhead {$v_{\\rm rot,sh}$~(km~s$^{-1}$)} &\n\\colhead{$v_{\\rm conv}$~(km~s$^{-1}$)} &\n\\colhead{$\\tau_{\\rm rot}$~(s)} &\n\\colhead {$t_{\\rm 1}$~(s)} &\n\\colhead {$t_{\\rm 2}$~(s)} &\n\\colhead {$t_{\\rm 3}$~(s)} &\n\\\\}\n\\startdata\n&&&C\\&O shell burning&&& \\\\\n\\hline\nno--rot      & 3.46  &  36.94\t& 0.\t  & 136 &  - \t&   545    &  749  &  1000    \\\\  \nrot--ST      & 3.46  &  36.94\t& 5.5   & 368\t  &  3957   &\t545    &  749  &  1000    \\\\  \nrot--2\t     & 3.46  &  36.94\t & 185.6 & 142 &  126     &\t545    &  749 &   1000    \\\\   \n\\hline\n&&& Si shell burning&&& \\\\\n\\hline\nno--rot     & 1.64  &  36.00    & 0.\t&  445   &  -\t  &   300    &   400 &   500   \\\\   \nrot--ST     & 1.64  &  36.00    & 7.1  &  362  &  1505   &   300\t &   400 &   500   \\\\\t\t \nrot--2\t    & 1.64  &  36.00\t& 110.0  & 449 &  138     &   300\t &   400 &   500   \\\\\t\n\\enddata \n\\tablecomments{``no-rot'': non-rotating model. ``rot-ST'': rotating model that includes\nthe magnetic field effects of the Spruit-Taylor dynamo. ``rot-2'': rotating model produced\nby introducing a rotational velocity profile to ``no-rot'' upon mapping to {\\it FLASH}.\nThe rotational time-scale, $\\tau_{\\rm rot}$, corresponds to the rotational period (one\nfull revolution around the rotation axis) for the given rotational speeds in the center\nof the convective shell.\n\\label{T1}}\n\\end{deluxetable*}\n\n\\begin{figure*}       \n\\centerline{\n\\hskip -0.2 in\n\\psfig{figure=20sm_norot_oburn_fig0000_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_rotST_oburn_fig0001_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_norot_oburn_ROT_fig0000_annotated.pdf,angle=0,width=2.35in}\n}\n\n\\caption{Velocity magnitude and $^{16}$O mass fraction for the \n``no--rot'' ({\\it left panel}), ``rot--ST'' ({\\it right panel}) and ``rot--2'' ({\\it right panel}) C-- \\& O--shell\nburning models at the end of the simulation ($t = t_{\\rm 3}$).\\label{Fig:coshellsims}}\n\\end{figure*}\n\n\\begin{figure*}       \n\\centerline{\n\\hskip -0.2 in\n\\psfig{figure=20sm_norot_siburn_fig0001_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_rotST_siburn_fig0000_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_norot_siburn_ROT_fig0001_annotated.pdf,angle=0,width=2.35in}\n}\n\n\\caption{Velocity magnitude and $^{28}$Si mass fraction for the \n``no--rot'' ({\\it left panel}), ``rot--ST'' ({\\it right panel}) and ``rot--2'' ({\\it right panel}) Si--shell\nburning models at the end of the simulation ($t = t_{\\rm 3}$).\\label{Fig:sishellsims}}\n\\end{figure*}\n\n\n\\subsection{{\\it 2D FLASH hydrodynamics.}}\\label{Sec:2dFLASH}\n\nThe six 1D {\\it MESA} models imported into {\\it FLASH} are listed in Table~\\ref{T1}. The C \\& O--shell burning {\\it FLASH}\nmodels are run for 1000~sec (simulated time), and the Si--shell burning models for 500~sec.\nThe dynamical effects of rotation and angular\nmomentum conservation are handled by the unsplit piecewise parabolic method (PPM) hydrodynamic solver \nin {\\it FLASH} \\citep{2009ASPC..406..243L}. We note that the newest implementation of the unsplit solver\nin {\\it FLASH} handles species advection in a way that is nearly identical to consistent multifliud advection\nscheme methods \\citep{1999A&A...342..179P}.\nThe 1D rotational velocity profiles were mapped on the 2D grid assuming ``shellular'' rotation as \nvectors with direction perpendicular to the $R$--$z$ plane\nof the simulation and the rotation axis coincident with the polar axis. In this approximation the angular velocity, $\\Omega(r)$,\nis constant for a particular {\\it spherical} shell or on equipotential surfaces \\citep{1992A&A...265..115Z,1997A&A...321..465M}.\nMore specifically, each grid cell was given a rotational velocity \n$v_{\\rm rot} = \\Omega(r) R$ where $\\Omega(r) = v_{\\rm rot}(r)/r$\nwith $v_{\\rm rot}(r)$ being {\\it MESA} 1D rotational velocity and $r$ the spherical radial coordinate ($r = (x^{2}+y^{2})^{0.5}$). \n\nThe transition from 1D {\\it MESA} to 2D {\\it FLASH} was smooth in terms of the important physics involved; a hardcoded\n21--isotope' network identical to the one used in {\\it MESA} was employed \\citep{2015ApJ...808L..21C} \nand the ``Helmholtz'' EOS was used. The main inconsistency is the treatment of convection in transition from 1D to 2D: \nin 1D the convective energy transport and cascade is treated via approximate MLT prescriptions, while in 2D and 3D\nconvective flow naturally develops in the fluid within unstable regions.\nThe mapping from 1D to 2D triggers an initial dynamical transient that lasts for a $\\sim$~100--300~sec before \na quasi-steady state\nis re--established. For our VSH analysis presented in \\S~\\ref{VSHdecomp} we use the {\\it FLASH} output (``snapshots'')\nat three different times, well after ($>$~300~sec for C \\& O--shell burning and $>$~200~sec for Si--shell burning) \nthe initial transient has transversed the computational domain. \nTable~\\ref{T1} also details the properties of the convective shells and simulation output. \n\nAll 2D {\\it FLASH} simulations were run on the Texas Advanced Computing Center {\\it Stampede} supercomputer.\nThe size of all simulation domains was chosen to be $10^{10}$~cm including both the core and the convective shells\nof all models. The maximum resolution chosen was 9~km corresponding\nto convergence in total energy and mass at a $\\sim 10^{-7}$~level over the course of the simulation. \nAt that resolution we are able to resolve Eddy sizes covering a considerable\nrange of the turbulent energy cascade (from $\\sim$~30,000~km down to $\\sim$~10~km). \nWe should caution, however, that the turbulent energy cascade in 2D is inherently inverted \n\\citep{1994ApJS...93..309P,2014ApJ...786...83T,2015ApJ...799....5C} \nand full 3D treatment is required to accuretly reproduce it. \nThe morphology of the flow changes significantly from 2D to 3D, and the velocity scale is moderately higher in 2D \\citep{2007ApJ...667..448M}.\nWe consider our simulations as an initial, exploratory step. Each simulation was\nrun on 128 cores and the wallclock time ranged from 14 to 22 hours for a total of $>$~12,000 core--hours\nused. Figures~\\ref{Fig:coshellsims} and~\\ref{Fig:sishellsims} show the O$^{16}$ or Si$^{28}$ mass fraction and the\n2D ($x$ and $y$) velocity magnitude at the end of each simulation. The prevalence of convection is apparent in all cases with\ncharacteristic velocities reaching $\\sim$~150~km~s$^{-1}$ for C \\& O--shell burning and $\\sim$~450~km~s$^{-1}$ for Si--shell burning in\nthe ``no--rot'' and ``rot--2'' cases. It is noteworthy that by the end of all simulations the velocities in the ``rot--ST'' cases\nwere much higher for C \\& O--shell burning ($\\sim$~370~km~s$^{-1}$) but slightly lower for Si--shell burning ($\\sim$~360~km~s$^{-1}$).\n\nThe convective elements seen in the velocity magnitude panels span a range of sizes, with dominant large--scale motions that cover\nmore than half of the size of the convective shells, as well as smaller scale vortices which are just visible (for example in the ``rot--ST'' C \\& O--burning shell).\nConvection is established $\\sim$~200-300~sec after the start of each simulation, after the initial transient exits the computational domain. The\nevolution past 200~sec shows large scale convective currents that cover the entire shell, breaking down to smaller structures and high velocity\nvortices interacting with each other. Mild mixing is also seen, with instabilities developing at the interfaces of the convective\nshells. This mixing can be due to the process of turbulent entrainment also seen by \\citet{2007ApJ...667..448M}. \nIn all simulations, convective elements interact with the inner (core) boundary and break into smaller structures that then subsequently\nreunite while rising upwards. Artifical flows are seen near the axis of the simulation ($\\sim$~6~deg), \na common issue of 2D cylindrical treatment. \n\n\\section{VSH DECOMPOSITION OF CONVECTIVE SHELLS}\\label{VSHdecomp}\n\nOutput from the {\\it FLASH} simulation is taken at three instances, $t_{\\rm 1}$, $t_{\\rm 2}$ and $t_{\\rm 3}$ (the end of the simulation); all are given in Table~\\ref{T1}. \nA total of 18 snapshots for all 6 cases, are post--processed using the VSH analysis implemented in the code. \nThese time--scales are chosen to represent different evolution\nphases during shell convection, well after the initial dynamic transient and several \nconvective turnover time--scales after that ($\\simeq$~10-100 for C \\& O--shell burning and $\\simeq$~10-50 for Si--shell burning). \n\n\nThe goal of the VSH analysis is to decompose the momentum density field within the selected shell into radial \n($A_{\\rm nlm}$) and solenoidal ($B_{\\rm nlm}$ and $C_{\\rm nlm}$)\nmodes and then calculate the power spectrum for each of the modes to determine the global properties of 2D or 3D fluid motion. In our\ncase we analyze a 2D momentum density field, therefore the solenoidal $B_{\\rm nlm}$ modes are irrelevant because they cancel out\nand will not be discussed further.\nAlso, because our simulations were conducted in a full domain possessing reflection symmetry, we expect the presence of an odd-even effect in the power\nspectra, a feature inherent to the 2D treatment. \nThe first step is to determine the radial limits of the convective regions where VSH is applied. For this,\nvolume--weighted radial momentum density profiles are calculated (Equation 22 of \\citealt{2014ApJ...795...92C}). Locations\nwhere the radial component reaches a minimum are used as our final choice for $R_{\\rm in,sh}$ and $R_{\\rm out,sh}$; these are also presented in Table~\\ref{T1}.\n\nThe next step is to declare the maximum radial and angular\nresolution for the VSH components, both of which can be expressed as a length scale, $\\lambda_{\\rm r}$. \nThe chosen resolution scale then determines the number of radial ($n$) and angular ($l$ and $m$) modes required for the expansion in the VSH components, which\nare given by the following formulae:\n\n\n", "itemtype": "equation", "pos": 15906, "prevtext": "\n\\title\n{Convective Properties of Rotating Two-dimensional Core-collapse Supernova Progenitors}\n\n\\author{E. Chatzopoulos\\textsuperscript{1,}\\altaffilmark{9}}\n\\author{Sean M. Couch\\textsuperscript{2,3,4,5}}\n\\author{W. David  Arnett \\textsuperscript{6,7}}\n\\author{F. X. Timmes \\textsuperscript{8}}\n\\affil{\n  \\altaffilmark{1}{Department of Astronomy \\& Astrophysics, Flash Center for Computational\nScience, University of Chicago, Chicago, IL, 60637, USA} \\\\\n  \\altaffilmark{2}{Department of Physics and Astronomy, Michigan State University, East Lansing, MI 48824, USA}\\\\\n  \\altaffilmark{3}{Department of Computational Mathematics, Science, and Engineering, Michigan State University, East Lansing, MI 48824, USA}\\\\\n  \\altaffilmark{4}{National Superconducting Cyclotron Laboratory, Michigan State University, East Lansing, MI 48824, USA}\\\\\n  \\altaffilmark{5}{Joint Institute for Nuclear Astrophysics, Michigan State University, East Lansing, MI 48824, USA}\\\\\n  \\altaffilmark{6}{Steward Observatory, University of Arizona, Tucson, AZ 85721, USA}\\\\\n  \\altaffilmark{7}{Aspen Center for Physics, Aspen, CO 81611, USA}\\\\\n  \\altaffilmark{8}{School of Earth and Space Exploration, Arizona State University, Tempe, AZ 85287, USA}\n}\n\\altaffiltext{9}{Enrico Fermi Fellow; \\href{mailto:manolis@flash.uchicago.edu}{manolis@flash.uchicago.edu}}\n\n\\begin{abstract}\n\n\n\nWe explore the effects of rotation on convective carbon, oxygen, and silicon \nshell burning during the late stages of evolution in a 20~$M_\\odot$ star.\nUsing the Modules for Experiments in Stellar Astrophysics (MESA) we construct 1D stellar models both with no rotation and with an initial rigid rotation of 50\\% of critical. \nAt different points during the evolution, we map the 1D models into 2D and follow the multidimensional evolution using the FLASH compressible hydrodynamics code for many convective turnover times until a quasi-steady state is reached.\n\n\n\n\nWe characterize the strength and scale of convective motions via decomposition of the momentum density into vector spherical harmonics.\nWe find that rotation influences the \ntotal power in solenoidal modes, with a slightly larger impact for carbon and oxygen shell\nburning than for silicon shell burning. \nIncluding rotation in one-dimensional (1D) stellar evolution models alters the structure of the star in a manner that has a significant impact on the character of multidimensional convection.\nAdding modest amounts of rotation to a stellar model that ignores rotation during the evolutionary stage, however, has little impact on the character of resulting convection.\nSince the spatial scale and strength of convection present at the point of core collapse directly influence the supernova mechanism, our results suggest that rotation could play an important role in setting the stage for massive stellar explosions.\n\n\\end{abstract}\n\n\\keywords{supernovae: general -- hydrodynamics -- convection -- turbulence --stars: interiors -- methods: numerical -- stars: massive -- stars: evolution}\n\\vskip 0.57 in\n\n\\section{INTRODUCTION}\\label{intro}\n\n\nThe final years in the lives of massive stars are characterized by vigorous convective shell burning,\nhydrodynamic and convective instabilities and, in many cases, episodic mass-loss events \n\\citep{2007ApJ...667..448M,2012MNRAS.423L..92Q,2014ApJ...780...96S,2014ApJ...785...82S,2014AIPA....4d1010A} \nthat change their three-dimensional \nstructure and the initial conditions (ICs) for the core--collapse supernova (CCSN) explosion. \nIn addition, rotation and magnetic fields may further complicate the \ncore-collapse process in a non-linear fashion. \n\nThe advanced stages of burning in massive stars have long been studied with 1D approximations \n\\citep{1984psen.book.....C,2002RvMP...74.1015W}. \nFor convection, the mixing-length theory (MLT;\n\\citealt{1958ZA.....46..108B}) remains the\ntechnique used and implemented in stellar evolution codes with options to choose the \nassociated efficiency parameter, $\\alpha_{\\rm MLT}$, and the condition determining where convection \nbecomes active by using the Schwarzchild or the Ledoux criterion accounting for suppression \ndue to compositional gradients. Parametrizations for 1D models of convective overshoot, semiconvection,\nand thermohaline mixing are frequently adopted, as is the 1D shellular approximation to treat\nrotation \\citep{1992A&A...265..115Z, 1997A&A...321..465M}.\n\nAdvances in numerical algorithms, hydrodynamic software instruments, and computing power\nhave allowed multi--dimensional studies of stellar convection that can assess the fidelity of 1D\ntreatments of mixing.\nThe properties of convective oxygen shell--burning in the progenitor of SN~1987A prior to collapse\nwere studied by \\citet{1998ApJ...496..316B} in 2D hydrodynamics simulations. One of the implications\nof this study was the potential for\npost-explosion mixing of radioactive $^{56}$Ni throughout the SN envelope. \nThe first three-dimensional (3D) simulations of massive star oxygen shell convection were \npresented by \\citet{2006PhDT........20M} and \\citet{2007ApJ...667..448M}.\n\nThis work showed that the boundaries between non-convective and convective\nregions are not stationary as standard MLT theory predicted but \ndynamical and \nthe source\nof gravity waves. \\citet{2011ApJ...733...78A}  followed up with 2D simulations of simultaneously active\nC, Ne, O and Si burning shells for a 23~$M_{\\odot}$ progenitor 1~hr prior to core--collapse finding significant\ndepartures from spherical symmetry and strong dynamical interactions between shells. \nThe 3D hydrodynamics simulations together with developments in mathematical methods,\nindicate that MLT needs significant revision especially for late stages of stellar evolution \\citep{2015ApJ...809...30A,2015arXiv150505756G}.\n\nThe apparent departures from spherical symmetry that arise in the velocity fields of convective shells\nprior to iron core--collapse have a qualitative and quantitative impact to the susceptibility to explosion itself \\citep{2013ApJ...778L...7C, 2015ApJ...799....5C, 2015MNRAS.448.2141M}.\n\\citet{2013ApJ...778L...7C, 2015ApJ...799....5C} have shown that successful explosions occur\nfor models whose ICs include velocity field perturbations due to\nconvective burning, \nin contrast to the same models without these asphericities. \nThis is due to\nnon-radial motions \nin the accretion flow exciting stronger post-shock turbulence that aids shock revival.\nFull 3D simulations of the final minutes of\niron core growth and collapse also \n\nsuggest that non-spherical progenitor structure\nshould not be ignored \\citep{2015ApJ...808L..21C}. \n\nOne might\ncharacterize convection seen in 2D or 3D hydrodynamic simulations and then map realizations of \nconvective velocity fields as ICs for simulations of CCSNe. Efforts to \n\ndo so\ninclude the spherical Fourier--Bessel decomposition \\citep{2014MNRAS.440.2763F} \nand nonlocal and time-dependent averaging \\citep{2007ApJ...667..448M,2009ApJ...690.1715A,2013ApJ...769....1V}.\nIn our analysis we use vector spherical harmonic (VSH) decomposition of the momentum density\nfield as presented by \\citet{2014ApJ...795...92C}. \n\n\nThe stochastic nature of 1D convection algorithms\n has a profound impact to the outcome of massive stellar evolution itself.\nFor stars of very similar mass and metallicity the end points can be dramatically different. \nThese give remnant masses and explosion properties which depend strongly on the pre--SN stellar structure and exhibit large\nvariability even in narrow intervals of Zero Age Main Sequence (ZAMS) mass \\citep{2012ApJ...757...69U, 2014ApJ...783...10S}. \n\n\nAdditional uncertainty arises from \nthe dynamical boundaries between convective zones \\citep{2007ApJ...667..448M},\nwhich \nare a source of gravity waves\n\nand might lead to episodic mass-loss events shortly before the SN explosion\n\\citep{2012MNRAS.423L..92Q,2014ApJ...780...96S,2014ApJ...785...82S}. The circumstellar (CS) environment that is formed\naround pre--SN stars due to this mass--loss history can have a significant impact on the radiative properties\nof the resulting explosion. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=6cm,trim=0.1in 0.in 0.1in 0.in,clip]{evolution_stacked.pdf}\n\\caption{From top to bottom: evolution of global parameters for the ``no-rot'' (solid black curves) and the ``rot-ST''\n(solid red curves) models as calculated in {\\it MESA}. Iron core mass ($M_{\\rm Fe}$),\ncentral temperature ($T_{\\rm c}$), central $Y_{\\rm e}$ and\ncentral density ($\\rho_{\\rm c}$). The dashed vertical lines indicate the times\nthat correspond to the Si-shell burning models mapped in {\\it FLASH}.\\label{Fig:evolution}}\n\\end{center}\n\\end{figure}\n\nRapid rotation has been observed for many massive stars \n\\citep{2008ApJ...676L..29H, 2010A&A...512L...7V, 2011ApJ...743L..22D, 2015arXiv150908940A} and can affect their pre--SN internal structure\nand composition via instabilities that alter the efficiency of angular momentum transport and the rate of chemical mixing\n(\\citealt{2011A&A...530A.115B, 2011A&A...530A.116B, 2012A&A...537A.146E}; see \\citealt{2012RvMP...84...25M} for a review).\nThe effects of rotation on convection in the extended envelopes of red giant stars has been studied with 3D simulations by\n\\citet{2009ApJ...702.1078B}, who found the properties of turbulent convection to be sensitive to the rotation rate.\nCurrently, the effects of rotation on the convective properties of massive, pre--SN stars and their implications for CCSNe\nhave not been thoroughly investigated. In this paper we present 2D simulations of rotating pre--SN stars during convective\nC-- and O-- shell burning and Si-- shell burning, and use the VSH method to quantify the behavior of convective velocity flows \nas a function of internal rotation rate. \n\nThe paper is organized as follows. In \\S~\\ref{Stellevol} we present the stellar evolution and 2D hydrodynamics simulations\nof a 20~$M_{\\odot}$ pre--SN star during convective shell burning of C, O and Si. In \\S~\\ref{VSHdecomp} we apply the\nmethod of VSH to decompose the convective velocity fields and obtain power spectra in order to characterize the\nconvective properties of models of different rotation rates. Finally, in \\S~\\ref{Disc} we discuss our conclusions and\nimplications for CCSNe. \n\n\\section{STELLAR EVOLUTION AND HYDRODYNAMICS SIMULATIONS}\\label{Stellevol}\n\nOur analysis of 2D convection in rotation pre--SN progenitors has three distinct steps.\nFirst, we evolve models of a star with ZAMS mass of 20~$M_{\\odot}$, solar metallicity but different rotation rates using\nversion 7503 of the stellar evolution code Modules for Experiments in Stellar Astrophysics \n({\\it MESA}; \\citealt{2011ApJS..192....3P, 2013ApJS..208....4P, 2015ApJS..220...15P}). Subsequently, \n{\\it MESA} 1D profiles are extracted days prior to core--collapse, during core Si-- and shell C-- and O--burning, and\n$\\sim$~1~hr prior to collapse during Si--shell burning.\nThese profiles are then mapped into 2D using the adaptive mesh refinement (AMR) multi-physics hydrodynamics code {\\it FLASH} version 4.3\n\\citep{2000ApJS..131..273F, 2012ApJS..201...27D} including rotation perpendicular to the plane of\nthe simulation (``2.5D'' approach). The 2D simulations are run for $>$~3 convective turn-over timescales, long enough to\ndiminish the effects of the initial dynamical transient resulting from mapping 1D \n\n``convective\" profiles to a multi-dimensional\nhydrodynamic grid. Lastly, {\\it FLASH} simulation output at three different times is extracted and post-processed \nusing the VSH method \\citep{2014ApJ...795...92C} to obtain the power spectra of the convective motions and the energy cascade. \n\n\\subsection{{\\it MESA pre--SN evolution.}}\\label{MESApreSN}\n\nOur {\\it MESA} models use initial rigid rotation rates of zero (``no--rot'') and 50\\% of the critical Keplerial value (``rot--ST''). The initial rotation\nprofiles impose rigid--body rotation when the model first lands on the ZAMS. The rotating model assumes the transport of angular\nmomentum and chemical mixing via the Spruit--Taylor mechanism (ST; \\citealt{1999A&A...349..189S, 2002A&A...381..923S}).\n\nFor MLT convection in {\\it MESA} we adopt the Schwarzchild criterion and $\\alpha_{\\rm MLT}=$~1.6. We use an automatically\nextending nuclear reaction network starting from a basic 8--isotope network and reaching a 21--isotope network \nby the end of the run. We note $\\approx$~100-150 isotopes \n\nare required to accurately represent core neutronization and neutrino\ncooling \\citep{2011ApJ...733...78A, 2015ApJ...809...30A}. \nThe ``Helmholtz'' equation of state (EOS;  \\citealt{2000ApJS..126..501T}) \nis used. Standard mass--loss prescriptions appropriate for massive stars \nare adopted \\citep{2001A&A...369..574V, 2009A&A...497..255G}. \nAfter performing a resolution study, we choose a spatial resolution parameter \n({\\tt mesh\\_delta\\_coeff} in {\\it MESA} terminology) equal to 0.5 and a temporal resolution factor\n({\\tt varcontrol\\_target}) of $10^{-3}$ where good convergence ($\\simeq$~10$^{-2}$ level) in terms\nof final carbon-oxygen core mass and iron core mass is achieved. The chosen\ngrid resolution resulted in final output models with 1200--1600 Lagrangian zones. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=7cm,trim=0.1in 0.in 0.1in 0.in,clip]{mapped_mod_coburn_stacked.pdf}\n\\caption{From top to bottom: radial profiles of nuclear energy generation rate ($\\epsilon_{\\rm nuc}$), composition, \nand temperature ($T$) for the ``no-rot'' (solid black curves) \nand ``rot-ST'' (solid red curves) {\\it MESA} models at the C\\&O shell burning phase prior to mapping to \n{\\it FLASH}. In the composition plot the ``no-rot'' model is represented by solid curves and the ``rot-ST'' model\nby dashed curves. The vertical dashed lines denote the radial limits, $R_{\\rm in,sh}$ and $R_{\\rm out,sh}$ of the convective\nshell that was decomposed with the VSH method.\\label{Fig:CO_characteristics}}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=7cm,trim=0.1in 0.in 0.1in 0.in,clip]{mapped_mod_siburn_stacked.pdf}\n\\caption{Same as Figure~\\ref{Fig:CO_characteristics} but for the Si shell burning phase.\\label{Fig:Si_characteristics}}\n\\end{center}\n\\end{figure}\n\n\nFigure~\\ref{Fig:evolution} shows the evolution of iron core mass ($M_{\\rm Fe}$) and central density ($\\rho_{\\rm c}$),\ntemperature ($T_{\\rm c}$) and average charge per baryon ($Y_{\\rm e}$) for both the ``no--rot'' and ``rot--ST'' models\nfor the last 50,000~sec of evolution and the formation of the iron core. The vertical dashed lines show the stage\nwhere we extracted the {\\it MESA} models corresponding to Si--shell burning, at \n\n$\\sim$~1.3~hours prior to core--collapse, when the peak of $\\epsilon_{\\rm nuc}$\nprofile reached the maximum value ($3-4 \\times 10^{18}$~erg~g$^{-1}$~s$^{-1}$).\nThe build--up of the Fe--core up to\nthe Chandrasekhar mass is smoother for the ``rot--ST'' model predominantly due to the effects of ST and rotational mixing. \n\nFigures~\\ref{Fig:CO_characteristics} and ~\\ref{Fig:Si_characteristics} show the distributions of nuclear energy\ngeneration rate ($\\epsilon_{\\rm nuc}$), composition ($X_{\\rm i}$)  and\ntemperature focused in the convective, shell-burning regions. \nThe {\\it MESA} models we calculate do not exhibit a phase of strongly\nevident shell Ne--burning, in contrast to the the more massive (23~$M_{\\odot}$) model used in \\citet{2011ApJ...733...78A}.\n\n\n\nThe vertical dashed lines indicate the inner and outer radial\nboundaries ($R_{\\rm in,sh}$ and $R_{\\rm out,sh}$) that were chosen for the convective shells to be analyzed with\nthe VSH method (see \\S~\\ref{VSHdecomp} for details on how their values were determined). \nThe effects of enhanced mixing in the ``rot--ST'' model are clearly illustrated in the composition panels. \n\nTo further isolate the effects of rotation, we impose an artifical rotational velocity\nprofile on the ``no--rot'' models:\n\n", "index": 1, "text": "\\begin{equation}\nv_{\\rm rot}(r) = \\frac{r \\Omega}{1 + (r/A)^{2}},\\label{Eq:rot_profile}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S1.E1.m1\" class=\"ltx_Math\" alttext=\"v_{\\rm rot}(r)=\\frac{r\\Omega}{1+(r/A)^{2}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>v</mi><mi>rot</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>r</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>r</mi><mo>/</mo><mi>A</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05816.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 27333, "prevtext": "\nwhere $r$ is the radial (spherical) coordinate, $\\Omega$ is the angular velocity and $A$ the characteristic radius where\nthe rotational velocity peaks as in \\citet{2013ApJ...776..129C}. \nWe denote models that use this rotation law as ``rot--2''.\nWe carefully selected the values of $A$ and $\\Omega$ in order to\ncapture a few full rotations (4--8) for the convective shell material \nwithin the simulated timescales in {\\it FLASH} and assess the dynamical effects of the centrifugal force.\nFor C \\& O--shell burning we picked $A = 3.46 \\times 10^{8}$~cm and $\\Omega =$~0.1~s$^{-1}$ and for\nSi--shell burning $A = 2.2 \\times 10^{8}$~cm and $\\Omega =$~0.1~s$^{-1}$ respectively. \nFigure~\\ref{Fig:vrotprof} shows the rotational velocity profiles for all models mapped in {\\it FLASH}. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=9cm,trim=0.4in 0.25in 0.5in 0.15in,clip]{vrot_profiles.pdf}\n\\caption{Rotational velocity profiles for the ``rot-ST'' (solid curves) and the ``rot-2'' (dashed\ncurves) models. Black curves denote the C\\&O shell burning phase and red curves the Si shell\nburning phase. The form of the rotational profile for the ``rot-2'' models is given by Equation~\\ref{Eq:rot_profile}.\n\\label{Fig:vrotprof}}\n\\end{center}\n\\end{figure}\n\n\\setcounter{table}{0}\n\\begin{deluxetable*}{lcccccccccc}\n\\tablewidth{0pt}\n\\tablecaption{Properties of MESA models mapped in {\\it FLASH}.}\n\\tablehead{\n\\colhead {Model} &\n\\colhead {$R_{\\rm in,sh}$~($10^{8}$~cm)} &\n\\colhead{$R_{\\rm out,sh}$~($10^{8}$~cm)} &\n\\colhead {$v_{\\rm rot,sh}$~(km~s$^{-1}$)} &\n\\colhead{$v_{\\rm conv}$~(km~s$^{-1}$)} &\n\\colhead{$\\tau_{\\rm rot}$~(s)} &\n\\colhead {$t_{\\rm 1}$~(s)} &\n\\colhead {$t_{\\rm 2}$~(s)} &\n\\colhead {$t_{\\rm 3}$~(s)} &\n\\\\}\n\\startdata\n&&&C\\&O shell burning&&& \\\\\n\\hline\nno--rot      & 3.46  &  36.94\t& 0.\t  & 136 &  - \t&   545    &  749  &  1000    \\\\  \nrot--ST      & 3.46  &  36.94\t& 5.5   & 368\t  &  3957   &\t545    &  749  &  1000    \\\\  \nrot--2\t     & 3.46  &  36.94\t & 185.6 & 142 &  126     &\t545    &  749 &   1000    \\\\   \n\\hline\n&&& Si shell burning&&& \\\\\n\\hline\nno--rot     & 1.64  &  36.00    & 0.\t&  445   &  -\t  &   300    &   400 &   500   \\\\   \nrot--ST     & 1.64  &  36.00    & 7.1  &  362  &  1505   &   300\t &   400 &   500   \\\\\t\t \nrot--2\t    & 1.64  &  36.00\t& 110.0  & 449 &  138     &   300\t &   400 &   500   \\\\\t\n\\enddata \n\\tablecomments{``no-rot'': non-rotating model. ``rot-ST'': rotating model that includes\nthe magnetic field effects of the Spruit-Taylor dynamo. ``rot-2'': rotating model produced\nby introducing a rotational velocity profile to ``no-rot'' upon mapping to {\\it FLASH}.\nThe rotational time-scale, $\\tau_{\\rm rot}$, corresponds to the rotational period (one\nfull revolution around the rotation axis) for the given rotational speeds in the center\nof the convective shell.\n\\label{T1}}\n\\end{deluxetable*}\n\n\\begin{figure*}       \n\\centerline{\n\\hskip -0.2 in\n\\psfig{figure=20sm_norot_oburn_fig0000_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_rotST_oburn_fig0001_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_norot_oburn_ROT_fig0000_annotated.pdf,angle=0,width=2.35in}\n}\n\n\\caption{Velocity magnitude and $^{16}$O mass fraction for the \n``no--rot'' ({\\it left panel}), ``rot--ST'' ({\\it right panel}) and ``rot--2'' ({\\it right panel}) C-- \\& O--shell\nburning models at the end of the simulation ($t = t_{\\rm 3}$).\\label{Fig:coshellsims}}\n\\end{figure*}\n\n\\begin{figure*}       \n\\centerline{\n\\hskip -0.2 in\n\\psfig{figure=20sm_norot_siburn_fig0001_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_rotST_siburn_fig0000_annotated.pdf,angle=0,width=2.35in}\n\n\\psfig{figure=20sm_norot_siburn_ROT_fig0001_annotated.pdf,angle=0,width=2.35in}\n}\n\n\\caption{Velocity magnitude and $^{28}$Si mass fraction for the \n``no--rot'' ({\\it left panel}), ``rot--ST'' ({\\it right panel}) and ``rot--2'' ({\\it right panel}) Si--shell\nburning models at the end of the simulation ($t = t_{\\rm 3}$).\\label{Fig:sishellsims}}\n\\end{figure*}\n\n\n\\subsection{{\\it 2D FLASH hydrodynamics.}}\\label{Sec:2dFLASH}\n\nThe six 1D {\\it MESA} models imported into {\\it FLASH} are listed in Table~\\ref{T1}. The C \\& O--shell burning {\\it FLASH}\nmodels are run for 1000~sec (simulated time), and the Si--shell burning models for 500~sec.\nThe dynamical effects of rotation and angular\nmomentum conservation are handled by the unsplit piecewise parabolic method (PPM) hydrodynamic solver \nin {\\it FLASH} \\citep{2009ASPC..406..243L}. We note that the newest implementation of the unsplit solver\nin {\\it FLASH} handles species advection in a way that is nearly identical to consistent multifliud advection\nscheme methods \\citep{1999A&A...342..179P}.\nThe 1D rotational velocity profiles were mapped on the 2D grid assuming ``shellular'' rotation as \nvectors with direction perpendicular to the $R$--$z$ plane\nof the simulation and the rotation axis coincident with the polar axis. In this approximation the angular velocity, $\\Omega(r)$,\nis constant for a particular {\\it spherical} shell or on equipotential surfaces \\citep{1992A&A...265..115Z,1997A&A...321..465M}.\nMore specifically, each grid cell was given a rotational velocity \n$v_{\\rm rot} = \\Omega(r) R$ where $\\Omega(r) = v_{\\rm rot}(r)/r$\nwith $v_{\\rm rot}(r)$ being {\\it MESA} 1D rotational velocity and $r$ the spherical radial coordinate ($r = (x^{2}+y^{2})^{0.5}$). \n\nThe transition from 1D {\\it MESA} to 2D {\\it FLASH} was smooth in terms of the important physics involved; a hardcoded\n21--isotope' network identical to the one used in {\\it MESA} was employed \\citep{2015ApJ...808L..21C} \nand the ``Helmholtz'' EOS was used. The main inconsistency is the treatment of convection in transition from 1D to 2D: \nin 1D the convective energy transport and cascade is treated via approximate MLT prescriptions, while in 2D and 3D\nconvective flow naturally develops in the fluid within unstable regions.\nThe mapping from 1D to 2D triggers an initial dynamical transient that lasts for a $\\sim$~100--300~sec before \na quasi-steady state\nis re--established. For our VSH analysis presented in \\S~\\ref{VSHdecomp} we use the {\\it FLASH} output (``snapshots'')\nat three different times, well after ($>$~300~sec for C \\& O--shell burning and $>$~200~sec for Si--shell burning) \nthe initial transient has transversed the computational domain. \nTable~\\ref{T1} also details the properties of the convective shells and simulation output. \n\nAll 2D {\\it FLASH} simulations were run on the Texas Advanced Computing Center {\\it Stampede} supercomputer.\nThe size of all simulation domains was chosen to be $10^{10}$~cm including both the core and the convective shells\nof all models. The maximum resolution chosen was 9~km corresponding\nto convergence in total energy and mass at a $\\sim 10^{-7}$~level over the course of the simulation. \nAt that resolution we are able to resolve Eddy sizes covering a considerable\nrange of the turbulent energy cascade (from $\\sim$~30,000~km down to $\\sim$~10~km). \nWe should caution, however, that the turbulent energy cascade in 2D is inherently inverted \n\\citep{1994ApJS...93..309P,2014ApJ...786...83T,2015ApJ...799....5C} \nand full 3D treatment is required to accuretly reproduce it. \nThe morphology of the flow changes significantly from 2D to 3D, and the velocity scale is moderately higher in 2D \\citep{2007ApJ...667..448M}.\nWe consider our simulations as an initial, exploratory step. Each simulation was\nrun on 128 cores and the wallclock time ranged from 14 to 22 hours for a total of $>$~12,000 core--hours\nused. Figures~\\ref{Fig:coshellsims} and~\\ref{Fig:sishellsims} show the O$^{16}$ or Si$^{28}$ mass fraction and the\n2D ($x$ and $y$) velocity magnitude at the end of each simulation. The prevalence of convection is apparent in all cases with\ncharacteristic velocities reaching $\\sim$~150~km~s$^{-1}$ for C \\& O--shell burning and $\\sim$~450~km~s$^{-1}$ for Si--shell burning in\nthe ``no--rot'' and ``rot--2'' cases. It is noteworthy that by the end of all simulations the velocities in the ``rot--ST'' cases\nwere much higher for C \\& O--shell burning ($\\sim$~370~km~s$^{-1}$) but slightly lower for Si--shell burning ($\\sim$~360~km~s$^{-1}$).\n\nThe convective elements seen in the velocity magnitude panels span a range of sizes, with dominant large--scale motions that cover\nmore than half of the size of the convective shells, as well as smaller scale vortices which are just visible (for example in the ``rot--ST'' C \\& O--burning shell).\nConvection is established $\\sim$~200-300~sec after the start of each simulation, after the initial transient exits the computational domain. The\nevolution past 200~sec shows large scale convective currents that cover the entire shell, breaking down to smaller structures and high velocity\nvortices interacting with each other. Mild mixing is also seen, with instabilities developing at the interfaces of the convective\nshells. This mixing can be due to the process of turbulent entrainment also seen by \\citet{2007ApJ...667..448M}. \nIn all simulations, convective elements interact with the inner (core) boundary and break into smaller structures that then subsequently\nreunite while rising upwards. Artifical flows are seen near the axis of the simulation ($\\sim$~6~deg), \na common issue of 2D cylindrical treatment. \n\n\\section{VSH DECOMPOSITION OF CONVECTIVE SHELLS}\\label{VSHdecomp}\n\nOutput from the {\\it FLASH} simulation is taken at three instances, $t_{\\rm 1}$, $t_{\\rm 2}$ and $t_{\\rm 3}$ (the end of the simulation); all are given in Table~\\ref{T1}. \nA total of 18 snapshots for all 6 cases, are post--processed using the VSH analysis implemented in the code. \nThese time--scales are chosen to represent different evolution\nphases during shell convection, well after the initial dynamic transient and several \nconvective turnover time--scales after that ($\\simeq$~10-100 for C \\& O--shell burning and $\\simeq$~10-50 for Si--shell burning). \n\n\nThe goal of the VSH analysis is to decompose the momentum density field within the selected shell into radial \n($A_{\\rm nlm}$) and solenoidal ($B_{\\rm nlm}$ and $C_{\\rm nlm}$)\nmodes and then calculate the power spectrum for each of the modes to determine the global properties of 2D or 3D fluid motion. In our\ncase we analyze a 2D momentum density field, therefore the solenoidal $B_{\\rm nlm}$ modes are irrelevant because they cancel out\nand will not be discussed further.\nAlso, because our simulations were conducted in a full domain possessing reflection symmetry, we expect the presence of an odd-even effect in the power\nspectra, a feature inherent to the 2D treatment. \nThe first step is to determine the radial limits of the convective regions where VSH is applied. For this,\nvolume--weighted radial momentum density profiles are calculated (Equation 22 of \\citealt{2014ApJ...795...92C}). Locations\nwhere the radial component reaches a minimum are used as our final choice for $R_{\\rm in,sh}$ and $R_{\\rm out,sh}$; these are also presented in Table~\\ref{T1}.\n\nThe next step is to declare the maximum radial and angular\nresolution for the VSH components, both of which can be expressed as a length scale, $\\lambda_{\\rm r}$. \nThe chosen resolution scale then determines the number of radial ($n$) and angular ($l$ and $m$) modes required for the expansion in the VSH components, which\nare given by the following formulae:\n\n\n", "index": 3, "text": "\\begin{equation}\nn_{\\mathrm{max}} = \\frac{2(R_{2}-R_{1})}{\\lambda_{\\rm r}},\\label{eq:nmax}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S1.E2.m1\" class=\"ltx_Math\" alttext=\"n_{\\mathrm{max}}=\\frac{2(R_{2}-R_{1})}{\\lambda_{\\rm r}},\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mi>max</mi></msub><mo>=</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mn>2</mn></msub><mo>-</mo><msub><mi>R</mi><mn>1</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mi mathvariant=\"normal\">r</mi></msub></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05816.tex", "nexttext": "\nwhere the total number of modes in 2D momentum density field decomposition is\n\n", "itemtype": "equation", "pos": 27443, "prevtext": "\nand\n\n", "index": 5, "text": "\\begin{equation}\nl_{\\mathrm{max}} = \\frac{\\pi(R_{1}+R_{2})}{2 \\lambda_{\\rm r}},\\label{eq:lmax}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S1.E3.m1\" class=\"ltx_Math\" alttext=\"l_{\\mathrm{max}}=\\frac{\\pi(R_{1}+R_{2})}{2\\lambda_{\\rm r}},\" display=\"block\"><mrow><mrow><msub><mi>l</mi><mi>max</mi></msub><mo>=</mo><mfrac><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mn>1</mn></msub><mo>+</mo><msub><mi>R</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>λ</mi><mi mathvariant=\"normal\">r</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05816.tex", "nexttext": "\n\nFor the C \\& O--shell burning models we choose $\\lambda_{\\rm r} = 1.585 \\times 10^{8}$~cm, corresponding to $l_{\\rm max} =$~40 and $n_{\\rm max} =$~42,\nwhile for the Si--shell burning models we choose  $\\lambda_{\\rm r} = 1.495 \\times 10^{8}$~cm, $l_{\\rm max} =$~40 and $n_{\\rm max} =$~46. We choose to truncate\nradial $n>$~20 modes because we find that their contribution to the total power is minimal ($10^{-5} - 10^{-4}$~level) and we can thus reduce computation time.\nWith these choices, a total of 861 modes were caclulated for each of the 18 {\\it FLASH} snapshots. \nFor the purposes of our study, \nwe calculate reduced VSH spectra by firstly summing over all the ``phase'' ($m$) components. Then, we calculate the reduced angular ($l$) and radial $n$ power\nspectra by summing over either $n$ or $l$, respectively, for instance\n$\\alpha_{l}^\\prime\\equiv\\sum_{n} \\alpha_{nl}$, $\\alpha_{n}^{\\prime}\\equiv\\sum_{l} \\alpha_{nl}$, and similarly for the solenoidal modes. In our presentation\nof VSH power spectra later, we will simply refer to the radial and\nsolenoidal modes as $A$ and $C$, respectively (for the exact definitions of $A$ and $C$ consult Equations 6-8 of \\citealt{2014ApJ...795...92C}).\n\n\\begin{figure*}       \n\\hskip -0.03 in\n\\centerline{\\psfig{figure=o_norot_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}} \\\\\n\\hskip 1.0 in\n\\centerline{\\psfig{figure=o_rotST_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}} \\\\\n\\hskip 1.0 in\n\\centerline{\\psfig{figure=o_norotROT_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}}\n\n\\caption{Evolution of reduced VSH power spectra in {\\it l} \nand {\\it n} for the ``no--rot'' ({\\it upper panel}), ``rot--ST'' ({\\it middle panel}) and ``rot--2'' ({\\it lower panel}) \nC \\& O--shell burning models.  \n$A$ (irrotational) and $C$ (solenoidal) modes are shown with black and red curves respectively. Since the $A << C$\nalways, we show the power in the irrotational modes only for the ``no--rot'' case. The cyan curves show time--averaged\n$C$ spectra for the three snapshots.\\label{Fig:o_vshps}}\n\\end{figure*}\n\n\\begin{figure*}       \n\\hskip -0.03 in\n\\centerline{\\psfig{figure=si_norot_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}} \\\\\n\\hskip 1.0 in\n\\centerline{\\psfig{figure=si_rotST_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}} \\\\\n\\hskip 1.0 in\n\\centerline{\\psfig{figure=si_norotROT_ps.pdf,angle=0,width=12cm,height=8cm,trim=0.3in 0.8in 0.5in 0.25in,clip}}\n\n\\caption{Same as Figure~\\ref{Fig:o_vshps} but for the Si--shell burning models.\\label{Fig:si_vshps}}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[angle=0,width=15cm,trim=0.0in 0.25in 0.5in 0.15in,clip]{tot_power.pdf}\n\\caption{Evolution of total VSH power in irrotational modes ($A$; black curves) and solenoidal\nmodes ($C$; red curves) for all the progenitor models of Table~\\ref{T1}. The C\\&O shell\nburning models are shown in the upper panels and the Si shell burning models in the lower\npanels.\n\\label{Fig:total_power_evol}}\n\\end{center}\n\\end{figure*}\n\n\\subsection{{\\it Shell O-- and C--burning.}}\\label{COburnVSH}\n\nFigure~\\ref{Fig:o_vshps} shows the reduced VSH power spectra for all models undergoing C\\&O--shell burning. \nThe evolution of the total power, summed over all components, is shown in the top row of Figure~\\ref{Fig:total_power_evol}. For all cases the bulk of\nconvective power is concentrated in large scales ($l <$~10, $n <$~5), with the peak values implying angular scales of $\\sim$~$1.6 - 3.2 \\times 10^{9}$~cm\nand radial scales of approximately the same range, revealing a nearly circular characteristic shape for the convective eddies. These eddies can be comparable in size to the shell itself. \nFor some spectra, a secondary peak of power is observed at smaller values of $l$ ($\\sim$~15-20), indicating that a small fraction of the total power \nis possessed by smaller scales ($\\sim 4.3 \\times 10^{8}$~cm). \n\nThe overall slope of the spectra remains nearly fixed over time. \nAs expected for a convective velocity field confined in a shell,\nthe power in the solenoidal modes is clearly dominant over that in the radial modes. \n\nRegardless of the degree of rotation, the total power in dominant solenoidal modes \ndeclines over the course of the simulations as the convective energy cascade settles. A comparison between the \n``no--rot'' and ``rot--2'' case shows that the addition of rotation in otherwise equal stellar structure has little effect on the global properties of\nconvection. A small reduction of total power is apparent, possibly related to the effects of centrifugal forces and the existence of an extra degree of freedom\n(movement perpendicular to the simulation domain). On the other hand, the algorithm for\ncalculating the effects of rotation during stellar evolution leads\nto a pre--SN star with clearly stronger convection during the C\\&O--shell burning phase (``rot--ST'' model, upper middle panel in Figure~\\ref{Fig:total_power_evol}).\nIndeed, the final peak 2D-velocity magnitude in the ``rot--ST'' model is more than double those of the ``no--rot'' and ``rot--2'' models. We discuss\nthis in more detail in \\S~\\ref{Disc}.\n\n\\subsection{{\\it Shell Si--burning.}}\\label{SiburnVSH}\n\nThe VSH power spectra for the cases of shell Si--burning are shown in Figure~\\ref{Fig:si_vshps}. The evolution\nof the total power is shown in the bottom row of Figure~\\ref{Fig:total_power_evol}. The reduced spectra reveal that large scales also dominate over smaller\nscales during shell Si--burning, with $l$ peaking in the range 4--6 throughout the evolution. The corresponding angular length scales range from $1.5 \\times 10^{9}$~cm\nto $2.0 \\times 10^{9}$~cm. The radial scales are also in the same range implying nearly circular shape for the convective elements, which \nare at about half\nthe size of the convective shell. Secondary peaks occur at smaller scales throughout the VSH spectral evolution ($\\sim 10^{9}$~cm). As in the case of C\\&O--shell\nburning, the spectral slopes remain consistent over time and solenoidal models dominate radial models by a factor of $\\sim$~10,000 for $l <$~5.\n\n\nThe evolution of the total power in the solenoidal ($C$) modes \nshows that convection during Si--shell burning is about 10 times stronger than convection\nduring C\\&O--shell burning, as expected from the higher rates of local energy generation. \nThe total power does not seem to vary significantly over time for all rotation rates. A small \nreduction of total\npower in the $C$--modes \nis seen by the end of the simulations \nfor the ``rot--ST'' and ``rot--2'' cases. For models initially identical, modulo the inclusion\nof rotation (``no--rot'' versus ``rot--2''), this effect may be due to the dynamical impact of centrifugal forces and the extra degree of freedom, as argued for the case of C\\&O--shell\nconvection. We do, however observe a qualitative difference between the two stages of shell burning: \nduring Si--shell burning, the ``rot--ST'' model exhibits nearly identical and, at late times, somewhat lower\nconvective power as compared to the ``no--rot'' model, while the opposite behavior was observed for C\\&O--shell burning. We return to this issue in the\nfollowing section.\n\n\\section{DISCUSSION AND CONCLUSIONS}\\label{Disc}\n\nIn this paper we explored the effects rotation on the convective properties of a 20~$M_{\\odot}$ pre--SN progenitor star, more specifically during C\\&O--shell burning and Si--shell burning in the hours to months prior to core--collapse. \nWe studied rotation both by including it self--consistently during the evolution of the star but also by imposing it to an othewise identical, non--rotating model in order to better \nisolate its effects. \nWe run 2D {\\it FLASH} simulations with the rotational velocity field mapped and pointing inwards perpendicular to plane of the simulation domain.  \nWe employed vector spherical harmonic decomposition of the momentum density field to characterize convection at different times during the hydrodynamic simulations.\\ Our initial exploration of the influence of rotation on the properties of convection deep in the core of a massive star can (and should) be improved by using 3D simulations, where the turbulent cascade goes from large scales to small scales.\n\nWe find that, regardless of the degree of rotation, the characteristic size of the convective elements is somewhat larger during the C\\&O--shell burning phase compared to the Si--shell burning phase, while the characteristic convective velocities are more than twice as large during Si--shell burning as compared to C\\&O--shell burning.  \nThe dominant scales implied by the resulting VSH power spectra span more than 50\\% of the size of the convective shells, with secondary typical scales as small as $0.5 - 1 \\times 10^{9}$~cm. \nThe slope of the VSH power spectra stays consistent over time regardless of the presence or absence of rotation. \nIn all cases we find nearly circular shapes for the characteristic convective elements. \nIn terms of the 2D convective flow properties, our results are in agreement with those of \\citet{2007ApJ...667..448M} (see also \\citet{2015IAUS..307...20M}; \\citet{2015IAUS..307...98C}).  \nIn particular, we find a highly intermittent flow and mixing due to turbulent entrainment.\n\nIn terms of the effects of rotation on the strength and properties of convection alone we find our 2D simulations suggest minimal impact, and generally lead to an overall small reduction of the total convective power stored in solenoidal motions (``no--rot'' versus ``rot--2'' models) regardless of the nature of convective burning (C, O, or Si shell). \nWe suggest this is due to the effects of the centrifugal forces mildly expanding the star, and thus changing the locations of the convective shells over time, subjecting the shell material to lower temperatures that, in turn, trigger lower nuclear burning rates and weaker convection. \nThat alone may lead to initial velocity perturbations of smaller amplitude than in the case of zero rotation which may have a small impact on the susceptibility to a successful SN explosion following iron core collapse \\citep{2013ApJ...778L...7C}.\n\nWe emphasize that, to answer the question of whether the inclusion of rotation significantly changes the ICs to the core--collapse SN mechanism, self--consistent evolution with the effects of rotation included is the proper approach to take. \nIn our analysis we have followed the evolution of a 20~$M_{\\odot}$ SN progenitor with both the effects of rotation and magnetic fields included in the transport of angular momentum and chemical mixing using the {\\it MESA} code (``rot--ST'' models).\nWe find differences in the sign of the effect depending on the nature of convective shell--burning: during C\\&O--shell burning there is more power\nstored in the solenoidal components than in the case of no rotation while during Si--shell burning the effects are very small with hints of even reduction of\nthe solenoidal mode power by the end of the simulation.\nWe attribute this effect to differences in the initial {\\it MESA} models for the two distinct shell--burning\nstages. \nA careful look in the upper panel of Figure~\\ref{Fig:CO_characteristics} shows that the ``rot--ST'' $\\epsilon_{\\rm nuc}$ profile\nduring C\\&O--shell burning has a secondary peak (due to O--burning) that is nearly an order of magnitude greater than the corresponding one for the ``no--rot'' model. \nOn the contrary, in Figure~\\ref{Fig:Si_characteristics} we see that during Si--shell burning the peaks in the $\\epsilon_{\\rm nuc}$ profile for the ``no--rot'' model in the region $4 - 6 \\times 10^{8}$~cm are greater than the corresponding ones for ``rot--ST''. \nThis is due to the enhanced chemical mixing by\nthe ST mechanism during the C\\&O--shell burning phase that effectively recycles fresh fuel from outer layers to deeper and hotter regions enabling faster specific nuclear energy generation rates. \nIn contrast, during the later and more short--lived Si--shell burning phase the ST mechanism does not have\nthe same radial extent and efficiency to instigate similar effects. \nThis result illustrates that the presence of efficient mixing mechanisms need to be studied self--consistently and in more detail since they can alter the convective properties and structure of massive stars prior to CCSNe quantitatively.\n\n\n\n\nIf the Spruit-Taylor mechanism is even roughly correct, our\nsimulations suggest that the cores of most massive stars do not rotate\nrapidly enough for rotation to be dynamically relevant to the CCSN mechanism (see also \\citealt{2005ApJ...626..350H,2015arXiv151101471G}).  \nThe inclusion of rotation and attendant angular momentum-transporting\ninstabilities in the  stellar evolution calculation, however, does\nsignificantly impact the nature of the convection surrounding the\npre-collapse iron core.  \nThis could have important implications for the CCSN mechanism itself following core collapse.\nRecently, \\citet{2015arXiv151200838M} suggested that above a certain rotational thershold, the magneto-rotational instability (MRI) can drive an inverse cascade of the magnetic energy generating a large--scale magnetic field that can provide the conditions for Gamma-Ray Burst jets and explain the origins of Type Ib/c SNe as well as some superluminous supernovae (SLSN) powered by the spin--down of newly--born magnetars. \nIn the limit of slow and typical rotation rates explored here we do not expect MRI--induced turbulence to have an important effect on the progenitor properties for single--star evolution.  \nBinary evolution seems to offer an alternative channel, with the possibility of rapidly rotating core collapse in which the MRI may be effective as an explosive and jet--forming mechanism.\n\n\n\n\n\n\n\n\n\n\n\\acknowledgments\n\nWe thank J. Craig Wheeler for useful conversations.\nEC thanks the Enrico Fermi Institute for its support via the Enrico\nFermi Fellowship.\nThe authors acknowledge the Texas Advanced Computing Center (TACC) at The University of Texas at Austin for providing HPC, visualization, and storage resources that have contributed to the research results reported within this paper.\nAn award of computer time was provided by the Innovative and Novel Computational Impact on Theory and Experiment (INCITE) program. This research used resources of the Argonne Leadership Computing Facility, which is a DOE Office of Science User Facility supported under Contract DE-AC02-06CH11357.\n\n\n\n\\bibliography{massiverot}\n\n\n", "itemtype": "equation", "pos": 27631, "prevtext": "\nwhere the total number of modes in 2D momentum density field decomposition is\n\n", "index": 7, "text": "\\begin{equation}\nN_{\\mathrm{total}} = (n_{\\mathrm{max}}+1)(l_{\\mathrm{max}}+1).\\label{eq:ntotal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S1.E4.m1\" class=\"ltx_Math\" alttext=\"N_{\\mathrm{total}}=(n_{\\mathrm{max}}+1)(l_{\\mathrm{max}}+1).\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mi>total</mi></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>max</mi></msub><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>l</mi><mi>max</mi></msub><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]