[{"file": "1601.03502.tex", "nexttext": "_{\\rm{c}}$$^{\\rm{onset}}$ $\\sim$ 5.2 K, which is slightly lower than the previous report\\cite{Nagao-jpsj13}.  The thermal conductivity $\\kappa$ was measured along the tetragonal $a$ axis (heat current {\\boldmath $q$}$\\parallel a$) on the sample with a rectangular shape ($\\sim$2.6$\\times$1.16$\\times$0.015 mm$^3$) by the standard steady state method in dilution refrigerator.   \n\nFigure~1(a) shows the temperature dependence of the in-plane electrical resistivity $\\rho (T)$ of  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.  Below 50\\,K , $\\rho (T)$ exhibits Fermi liquid behavior with $T^2$-dependence down to $T_c$.   The residual  resistivity, $\\rho_{0}=137$ $\\mu \\Omega$cm,  is much smaller than the previous reported value~\\cite{Jiao-JPhys15,Liu-EPL14}, indicating the high sample quality.  Figure 1(b) shows the $T$ dependence of $\\kappa/T$ in zero field.  At $T_c$,  $\\kappa/T$ shows no discernible anomaly.   In the superconducting state,  $\\kappa/T$ decreases with decreasing $T$ after showing a broad maximum at around 1.5\\,K. We will discuss this behavior later.  \n\n\n\n\\begin{figure}[t]\n\t\\vspace{12mm}\n\t\\includegraphics[width=\\linewidth,keepaspectratio]{Fig1.eps}\n\t\\caption{(Color online) Temperature dependence of (a) electrical resistivity $\\rho$ and (b) thermal conductivity divided by temperature $\\kappa/T$ã\u0080\u0080 at zero field. Inset of (a) displays the crystal structure of NdO$_{1-x}$F$_x$BiS$_2$. Inset of (b) shows Fermi surface of NdO$_{1-x}$F$_x$BiS$_2$ for $x\\sim 0.3$~\\cite{Usui-prb12,Agatsuma-JMMM16}.}\n\\end{figure}\n\nWe first discuss the low temperature behavior of $\\kappa/T$ in zero field. The thermal conductivity can be written as a sum of the quasiparticle and phonon contributions, $\\kappa=\\kappa_{qp}+\\kappa_{ph}$.   The phonon conductivity in boundary-limited scattering regime at low temperature is expressed as\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\preprint{APS/123-QED}\n\n\\hspace{200mm}\n\\vspace{7mm}\n\\title{Conventional $s$-wave superconductivity in BiS$_2$-based NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ revealed by thermal transport measurements}\n\n\\author{T. Yamashita$^1$}\n\\author{Y. Tokiwa$^2$}\n\\author{D. Terazawa$^1$}\n\\author{M. Nagao$^3$}\n\\author{S. Watauchi$^3$}\n\\author{I. Tanaka$^3$}\n\\author{T. Terashima$^2$}\n\\author{Y. Matsuda$^1$}\n\n\\affiliation{\n$^1$Department of Physics, Graduate School of Science, Kyoto University, Kyoto 606-8502, Japan\\\\\n$^2$Research Center for Low Temperature and Materials Science, Kyoto University, Kyoto 606-8501, Japan\\\\\n$^3$Center for Crystal Science and Technology, University of Yamanashi, Kofu 400-8511, Japan\n}\n\n\n\\date{\\today}\n             \n\n\\begin{abstract}\nTo study the superconducting gap structure of BiS$_2$-based layered compound NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ ($T\n", "index": 1, "text": "$$_{\\rm c}$ = 5 K), we measured the thermal conductivity $\\kappa$,  which is a sensitive probe of the low-energy quasiparticle spectrum.    In the absence of a magnetic field, there is only a very small residual linear term  in the thermal conductivity  $\\kappa_{0}$/$T$ at $T$ $\\rightarrow$ 0,  indicating the absence of a residual normal fluid, expected for nodal superconductors.   Moreover,  the applied magnetic field hardly affects the thermal conductivity in the wide range of the vortex state, indicating the absence of Doppler shifted quasiparticles.  These results provide evidence that NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ is fully gapped superconductor.  The obtained gap structure, along with the robustness of the superconductivity against the impurity, suggest a conventional $s$-wave superconducting state in  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.\n\\end{abstract}\n\\pacs{}\n                             \n\n                              \n\\maketitle\n\nRecently a new family of layered superconductors Bi$_4$O$_4$S$_3$ and $Ln$O$_{1-x}$F$_x$BiS$_2$ ($Ln$ is a lanthanoid)~\\cite{Mizuguchi-prb12,Mizuguchi-jpsj12,Xing-prb12,Demura-jpsj13,Yazici-PM13,Jha-JSNM13} has been reported.  Superconductivity emerges from semiconducting parent compound via electron doping by substituting O with F in the blocking layer.  Up to now the highest  transition temperature $T_c$ of 10.6 \\,K is reported  in LaO$_{0.5}$F$_{0.5}$BiS$_2$~\\cite{Mizuguchi-jpsj12}.  Their crystal structure consists of alternate stacking of BiS$_2$ superconducting double layers and $Ln$O insulating blocking layers (inset of Fig.\\,1(a)). Fermi surfaces consist of two-dimensional (2D) cylindrical sheets. The band structure calculations suggest the presence of strong Fermi surface nesting at the wave vector $(\\pi,\\pi)$~\\cite{Usui-prb12,Wan-prb13,Yildirim-prb13,Agatsuma-JMMM16}.  In particular, in underdoped regime ($x<0.5$), the Fermi surface consists of disconnected small electron pockets at the Brillouin Zone boundary  (inset of Fig.\\,1(b)).  Because of these some common features with Fe-based high temperature superconductors,  BiS$_2$-based superconductors have aroused a great interest.  On the other hand,  the conduction band in the 2D layer of BiS$_2$-based compounds is mainly of 6$p_x$ and 6$p_y$ orbits of Bi~\\cite{Usui-prb12}.  The electron correlation effects, which play an essential role for the superconductivity in Fe-based superconductors, appear not to be important due to the widely spread 6p orbitals.   Thus a major outstanding question is whether the Cooper pairing is mediated by  unconventional (non-phononic)  interactions, such as antiferromagnetic fluctuations.  To elucidate this issue, the identification of  superconducting gap structure  is of primary importance, because it is  intimately related to the pairing interaction.  \n\nSeveral superconducting gap structures, including conventional $s$-wave, sign reversing $s$, spin triplet $p$, and $d$-wave symmetries have been proposed theoretically~\\cite{Usui-prb12,Wan-prb13,Yildirim-prb13,Liang-FP14,Agatsuma-JMMM16,Yang-prb13,Martins-prb13}.  A possible unconventional superconductivity has been reported by an extremely large ratio of  $2\\Delta/k_BT_c\\sim$17 ($\\Delta$ is the superconducting gap), which is nearly five times larger than the BCS value~\\cite{Liu-EPL14}. The fully gapped superconductivity has been reported by $\\mu$SR measurements of polycrystalline Bi$_4$O$_4$S$_3$ and LaO$_{0.5}$F$_{0.5}$BiS$_2$~\\cite{Lamura-prb13}. To look into the superconducting state, the measurements on the single crystals are more desirable. Raman scattering experiments on single crystals of NdO$_{1-x}$F$_x$BiS$_2$ with $x\\sim$0.5 have suggested possible phonon-mediated superconductivity~\\cite{Wu-prb14}. Moreover, recent measurements of $\\lambda(T)$ on single crystals for $x$=0.3 and 0.5 have also reported the fully gapped superconductivity~\\cite{Jiao-JPhys15}. However, the large Curie-Weiss contribution at low temperature arising from localized Nd$^{+3}$ spins  prevents the accurate determination of superfluid density by the observed $\\lambda$.\n\nHere, to provide conclusive information on the superconducting gap structure of BiS$_2$-based superconductors,  we performed the thermal conductivity  measurements on high quality single crystal of NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ down to 100\\,mK. It is well established that the low temperature thermal conductivity is a powerful probe for the superconducting gap structure, detecting low energy quasiparticle excitations sensitively~\\cite{Matsuda-JPhys06}. Advantage of the thermal conductivity is that it is free from the Nd magnetic moment.  We provide evidence that NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ is a fully gapped superconductor.  Based on these results, together with the impurity effect, we discuss the mechanism of superconductivity.\n\n\nNdO$_{0.71}$F$_{0.29}$BiS$_{2}$ single crystals  were grown by the high-temperature flux method with CsCl/KCl as a flux\\cite{Nagao-jpsj13}.  The onset of superconductivity is $T$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"{}_{\\rm{c}}\" display=\"block\"><msub><mi/><mi mathvariant=\"normal\">c</mi></msub></math>", "type": "latex"}, {"file": "1601.03502.tex", "nexttext": "\nwhere $\\beta$ is the phonon specific heat coefficient, $\\langle v_{s} \\rangle$ is the mean acoustic phonon velocity, and $\\ell_{ph}$ is the phonon mean free path.  In this regime,  $\\kappa_{ph}$ shows power law dependence on temperature as $\\kappa_{ph}\\propto T^{\\alpha}$ and $\\alpha$ ranges from 2 to 3, depending on the nature of surface scattering~\\cite{Sutherland-prb03}.  For diffuse scattering limit, $\\ell_{ph}$ becomes $T$-independent, resulting in $\\kappa_{ph}\\propto T^3$.  On the other hand, in case of specular reflection,  $\\ell_{ph}$ depends on $T^{-1}$.  In this limit, $\\kappa_{ph}$ shows $T^2$-dependence.  In real systems, $\\alpha$ often take a value intermediate between 2 and 3.  In fact, $\\alpha=$2.74, 2.4 and 2.77 has been reported in V$_3$Si~\\cite{Sutherland-prb03}, YBa$_2$Cu$_3$O$_{6.99}$~\\cite{Sutherland-prb03} and Al$_2$O$_{3}$~\\cite{Pohl-prb82}, respectively.  \n\n\\begin{figure}[t]\n\t\\vspace{13mm}\n\t\\includegraphics[width=\\linewidth,keepaspectratio]{Fig2.eps}\n\t\\caption{(Color online) Thermal conductivity in several magnetic fields applied parallel to the c-axis. The data are plotted as $\\kappa/T$ vs $T^{1.3}$. Inset: the same plot in zero field. The red line represents a linear extrapolation of the data.}\n\\end{figure}\n\nWe tried to fit the temperature dependence of $\\kappa$ in NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ and found that  $\\kappa$ can be fitted as $\\kappa\\propto T^{2.2-2.5}$ in the widest $T$-range.  In the inset of Fig.\\,2, $\\kappa/T$  is plotted as a function of $T^{1.3}$.  It should be noted that as shown in the red line,  $\\kappa/T$ goes to zero at $T\\rightarrow 0$, i.e.  the absence of a residual term.  The vanishingly small residual term is obtained in the range of $\\alpha$ between 2.2 and 2.5.   The residual term indicates the existence of a residual normal fluid, which is expected for an unconventional superconductor with line nodes in the energy gap.  This residual normal fluid is a consequence of impurity scattering, even for low concentrations of nonmagnetic impurities.  Thus the results suggest that there is no line nodes in NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.  Since the presence of point node is unlikely in the 2D Fermi surface, the zero field thermal conductivity suggest a fully gapped superconductivity.  \n\n\nThis conclusion is strongly supported by the thermal conductivity in magnetic field applied perpendicular to the 2D plane ({\\boldmath $H$}$\\parallel c$).  Figure\\,3 shows the $H$-dependence of $\\kappa_0(H)/T$, which is obtained by the extrapolation to $T\\rightarrow 0$ at each field value shown in Fig.\\,2.  As shown in Fig.\\,3, $\\kappa_0(H)/T$ is field independent at low field up to $\\mu_0H^*\\approx 0.12$\\,T.  Above $H^*$,  $\\kappa_0(H)/T$ increases and becomes field independent in the normal state above $\\mu_0H_{c2}^c\\approx 0.8$\\,T.  In the normal state,  $\\kappa_0(H)/T$ follows the Wiedemann-Franz law, $\\kappa_0/T=L_0/\\rho$, where $L_0=\\frac{\\pi^2}{3}\\left(\\frac{k_B}{e}\\right)^2$ is the Sommerfeld value.  \n\nIt is well established that there is an essential difference in the field dependence of the thermal conductivity between fully gapped and nodal superconductors~\\cite{Matsuda-JPhys06}.   In the former, all the quasiparticles states are bound to vortex cores and, therefore, the applied magnetic field hardly affect the thermal conduction except for the vicinity of upper critical field.  By contrast, in the latter, the heat transport is dominated by the delocalized quasiparticles.  In the presence of a supercurrent with a velocity ${\\bm v}_s$ around the vortices induced by the magnetic field, the energy of a quasiparticle with momentum {\\boldmath $p$} is Doppler shifted relative to the superconducting condensate by  $E({\\bm p})\\rightarrow E({\\bm p})-{\\bm v}_s\\cdot {\\bm p}$.  The Doppler shift gives rise to an initial steep increase of $\\kappa(H)/T\\propto \\sqrt{H}$ for line node and $\\kappa(H)/T\\propto H \\log H$ for point nodes.  \n\n\\begin{figure}[t]\n\t\\vspace{16mm}\n\t\\includegraphics[width=\\linewidth,keepaspectratio]{Fig3.eps}\n\t\\caption{(Color online) Field dependence of the residual linear term $\\kappa_{0}/T$. $\\kappa_{0}/T$ is independent of magnetic field up to $H^*$. The dashed horizontal line indicates $\\kappa_{0}/T$=0. Inset shows $\\kappa_{0}/T$ in an extended field range. $H_{c2}^c$ is the superconducting upper critical field along c-axis.}\n\\end{figure}\n\nSince $H^*$ is much larger than the lower critical field, $H^* \\gg H_{c1}$, which is estimated to be $\\mu_0H_{c1}=\\frac{\\Phi_0}{4\\pi \\lambda(0)^2}\\ln(\\frac{\\lambda(0)}{\\xi_{ab}})\\approx 3$\\,mT, where $\\Phi_0$ is the flux quantum, $\\lambda(0)\\approx447$\\,nm is the zero temperature in-plane penetration length \\cite{Jiao-JPhys15} and $\\xi_{ab}=\\sqrt{\\Phi_0/(2\\pi \\mu_0H_{c2}^c)}=18$\\,nm is the in-plane coherence length, the field independent $\\kappa_0/T$ is not due to the absence of flux penetration.  Therefore the observed field insensitive thermal conductivity at low field indicates that the delocalized quesiparticles are not excited by magnetic field at least up to $H\\approx H^*\\approx 0.2H_{c2}^c$.  These results lead us to conclude the absence of any kind of nodes in the gap function of  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.  In typical $s$-wave superconductors, such as Nb, $\\kappa(H)/T$ increases steeply only in the vicinity of upper critical field~\\cite{Lowell-JLTP70}.   Therefore the increase of $\\kappa_0(H)/T$ above $H^*$  well below $H_{c2}$ may be due to the large modulation of the superconducting gap along the 2D Fermi surface. \n\n\n\nFinally we discuss the mechanism of the superconductivity in NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.   As shown  in Fig.\\,1(b), no discernible anomaly is observed in  $\\kappa/T$ at $T_c$.  In the superconductors with strong electron correlation effect, including cuprates~\\cite{Yu-PRL92}, iron-pnictides~\\cite{Kasahara-PNAS14} and heavy fermions~\\cite{izawa:prl-01,movshovich:prl-01,tanatar-prl05}, the striking enhancement of the thermal conductivity just below $T_c$ is often observed.  This enhancement is caused by the strong suppression of the quasiparticle inelastic scattering rate due to the formation of superconducting gap, which overcomes reduction of the quasiparticle density of states.  Therefore the electron correlation effect in the present compound is not strong.  Moreover, when electron-phonon coupling is strong, the  enhancement of the thermal conductivity below $T_c$ is also often observed by the enhancement of the phonon mean free path due to the gap formation.     Thus electron-phonon coupling is also not strong.   \n\nUntil now,  several superconducting gap structures, including conventional $s$-wave, sign-reversing $s$, spin triplet $p$, and $d$-wave symmetries have been proposed theoretically in BiS$_2$-based superconductors ~\\cite{Usui-prb12,Wan-prb13,Yildirim-prb13,Liang-FP14,Agatsuma-JMMM16,Yang-prb13}.  Since there is no hole pocket around the $\\Gamma$-point as shown in the inset of Fig.\\,1(b),  we do not discuss sign-reversing $s$ symmetry.  Among $d$-wave symmetry, we can rule out $d$-wave with accidental nodes proposed in Ref.[4] and $d_{xy}$ symmetry.  The remaining possibilities of the unconventional symmetries are $p$ and $d_{x^2-y^2}$, which has no node in the present Fermi surface.  However, these unconventional superconductivity is unlikely because of the following reasons.  First, $T_c$ of the present  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ with residual resistivity of 137\\,$\\mu \\Omega$cm is same as that of 800\\,$\\mu \\Omega$cm~\\cite{Jiao-JPhys15}. Second, the in-plane mean free path $\\ell$  is comparable to the in-plane coherence length $\\xi_{ab}=18$\\,nm.  In fact, $\\ell$ is estimated to be $\\sim 20-30$\\,nm by using the relation $\\ell=(\\mu_0\\lambda(0)^2v_{\\rm F})/\\rho_0$, where $v_F$ is the Fermi velocity, which is reported to be  $v_F=0.85-1.1 \\times 10^6$\\,m/s by angle resolved photo emission spectroscopy \\cite{Ye-prb14}.     These robustness of the superconductivity against the impurity appears to be at odds with the unconventional pairing symmetries.     These considerations lead us to conclude that  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ is likely to be a conventional $s$-wave superconductor.\n\n\n\n\nIn summary, to clarify  the superconducting gap structure of  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$,  we performed the thermal conductivity  measurements down to 100\\,mK.   Thermal conductivity shows no discernible anomaly at $T_c$, suggesting that both of the electron correlation and electron-phonon coupling effects are not strong.   The absence of residual  thermal conductivity indicates the absence of a residual normal fluid, expected for nodal superconductors with impurities.   The magnetic field hardly affects the thermal conductivity up to $\\sim 0.2 H_{c2}^c$, indicating the absence of Doppler shifted quasiparticles.  These results provide evidence that NdO$_{0.71}$F$_{0.29}$BiS$_{2}$ is fully gapped superconductor.  The superconductivity is robust against the impurity.  Based on these results, we conclude a conventional $s$-wave superconducting state in  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$. This puts a strong constraint on the theory of the superconductivity of BiS$_2$-based layered compound, whose electronic and crystal structures bear some resemblance to Fe-based superconductors.\n\nWe thank  S. Kasahara, Y. Kasahara, Y. Mizuguchi, Y. Ota, T. Shibauchi and S. Shin for useful discussions.  This work was supported by Grants-in-Aid for Scientific Research (KAKENHI) from Japan Society for the Promotion of Science (JSPS), and by the `Topological Quantum Phenomena' (No. 25103713) Grant-in-Aid for Scientific Research on Innovative Areas from the Ministry of Education, Culture, Sports, Science and Technology (MEXT) of Japan.\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{Mizuguchi-prb12}\nY. Mizuguchi, H. Fujihisa, Y. Gotoh, K. Suzuki, H. Usui, K. Kuroki, S. Demura, Y. Takano, H. Izawa and O. Miura,  Phys. Rev. B {\\bf 86}, 220510 (2012).\n\n\\bibitem{Mizuguchi-jpsj12}\nY. Mizuguchi, S. Demura, K. Deguchi, Y. Takano, H. Fujihisa, Y. Gotoh, H. Izawa and O. Miura, J. Phys. Soc. Jpn. {\\bf 81}, 114725 (2012).\n\n\\bibitem{Xing-prb12}\nJ. Xing, S. Li, X. Ding, H. Yang, and H.-H. Wen, Phys. Rev. B {\\bf 86}, 214518 (2012).\n\n\\bibitem{Yazici-PM13}\nD. Yazici, K. Huang, B. D. White, A. H. Chang, A. J. Friedman, and M. B. Maple, Philos. Mag. {\\bf 93}, 673 (2013).\n\n\\bibitem{Demura-jpsj13}\nS. Demura, Y. Mizuguchi, K. Deguchi, H. Okazaki, H. Hara, T. Watanabe, S.~J. Denholme, M. Fujioka, T. Ozaki, H. Fujihisa, et~al., J. Phys. Soc. Jpn. {\\bf 82}, 033708 (2013).\n\n\\bibitem{Jha-JSNM13}\nR. Jha, A. Kumar, S. Kumar Singh, and V. P. S. Awana, J. Supercond. Nov. Magn. {\\bf 26}, 499 (2013).\n\n\\bibitem{Usui-prb12}\nH. Usui, K. Suzuki and K. Kuroki, Phys. Rev. B {\\bf 86}, 220501 (2012).\n\n\\bibitem{Agatsuma-JMMM16}\nT. Agatsuma and T. Hotta, J. Magn. Magn. Matter. {\\bf 400}, 73 (2016).\n\n\\bibitem{Wan-prb13}\nX. Wan, H.-C. Ding, S.~Y. Savrasov and C.-G. Duan, Phys. Rev. B {\\bf 87}, 115124 (2013).\n\n\\bibitem{Yildirim-prb13}\nT. Yildirim, Phys. Rev. B {\\bf 87}, 020506 (2013).\n\n\\bibitem{Liang-FP14}\nY. Liang, X. Wu, W.-F. Tsai and J. Hu, Front. Phys. {\\bf 9}, 194 (2014).\n\n\\bibitem{Yang-prb13}\nY. Yang, W.-S. Wang, Y.-Y. Xiang, Z.-Z. Li and Q.-H. Wang, Phys. Rev. B {\\bf 88}, 094519 (2013).\n\n\\bibitem{Martins-prb13}\nG. B. Martins, A. Moreo, and E. Dagotto, Phys. Rev. B {\\bf 87}, 081102(R) (2013).\n\n\\bibitem{Liu-EPL14}\nJ. Liu, D. Fang, Z. Wang, J. Xing, Z. Du, S. Li, X. Zhu, H. Yang and H.-H. Wen, Europhys. Lett. {\\bf 106}, 67002 (2014).\n\n\\bibitem{Lamura-prb13}\nG. Lamura, T. Shiroka, P. Bonf\\`a, S. Sanna, R. De~Renzi, C. Baines, H. Luetkens, J. Kajitani, Y. Mizuguchi, O. Miura, et~al., Phys. Rev. B {\\bf 88}, 180509 (2013).\n\n\\bibitem{Wu-prb14}\nS. F. Wu, P. Richard, X. B. Wang, C. S. Lian, S. M. Nie, J. T. Wang, N. L. Wang, and H. Ding, Phys. Rev. B {\\bf 90}, 054519 (2014).\n\n\\bibitem{Jiao-JPhys15}\nL. Jiao, Z. Weng, J. Liu, J. Zhang, G. Pang, C. Guo, F. Gao, X. Zhu, H.-H. Wen and H.~Q. Yuan, J. Phys.: Cond. Mat. {\\bf 27}, 225701 (2015).\n\n\\bibitem{Matsuda-JPhys06}\nY. Matsuda, K. Izawa and I. Vekhter, J. Phys.: Cond. Matt. {\\bf 18}, R705 (2006).\n\n\\bibitem{Nagao-jpsj13}\nM. Nagao, S. Demura, K. Deguchi, A. Miura, S. Watauchi, T. Takei, Y. Takano, N. Kumada and I. Tanaka, J. Phys. Soc. Jpn. {\\bf 82}, 113701 (2013).\n\n\\bibitem{Sutherland-prb03}\nM. Sutherland, D. G. Hawthorn, R. W. Hill, F. Ronning, S. Wakimoto, H. Zhang, C. Proust, E. Boaknin, C. Lupien, L. Taillefer, R. Liang, D. A. Bonn, W. N. Hardy, R. Gagnon, N. E. Hussey, T. Kimura, M. Nohara and H. Takagi, Phys. Rev. B {\\bf 67}, 174520 (2003).\n\n\\bibitem{Pohl-prb82}\nR. O. Pohl and B. Stritzker, Phys. Rev. B {\\bf 25}, 3608 (1982).\n\n\\bibitem{Lowell-JLTP70}\nJ. Lowell and J. B. Sousa, J. Low Temp. Phys. {\\bf 3}, 65 (1970).\n\n\\bibitem{Yu-PRL92}\nR. C. Yu, M. B. Salamon, J. P. Lu, and W. C. Lee, Phys. Rev. Lett. {\\bf 69}, 1431 (1992).\n\n\\bibitem{Kasahara-PNAS14}\nS. Kasahara, T. Watashige, T. Hanaguri, Y. Kohsaka, T. Yamashita, Y. Shimoyama, Y. Mizukami, R. Endo, H. Ikeda, K. Aoyama, T. Terashima, S. Uji, T. Wolf, H. v. Loehneysen, T. Shibauchi, and Y. Matsuda, Proc. Natl. Acad. Sci. USA {\\bf 111}, 16309-16313 (2014).\n\n\\bibitem{izawa:prl-01}\nK. Izawa, H. Yamaguchi, Y. Matsuda, H. Shishido, R. Settai and Y. Onuki, Phys. Rev. Lett. {\\bf 87}, 057002 (2001).\n\n\\bibitem{movshovich:prl-01}\nR. Movshovich, M. Jaime, J.~D. Thompson, C. Petrovic, Z. Fisk, P.~G. Pagliuso and J.~L. Sarrao,  Phys. Rev. Lett. {\\bf 86}, 5152 (2001).\n\n\\bibitem{tanatar-prl05}\nM.~A. Tanatar, J. Paglione, S. Nakatsuji, D.~G. Hawthorn, E. Boaknin, R.~W. Hill, F. Ronning, M. Sutherland, L. Taillefer, C. Petrovic, et~al., Phys. Rev. Lett. {\\bf 95}, 067002 (2005).\n\n\\bibitem{Ye-prb14}\nZ.~R. Ye, H.~F. Yang, D.~W. Shen, J. Jiang, X.~H. Niu, D.~L. Feng, Y.~P. Du, X.~G. Wan, J.~Z. Liu, X.~Y. Zhu, et~al., Phys. Rev. B {\\bf 90}, 045116 (2014).\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 7717, "prevtext": "_{\\rm{c}}$$^{\\rm{onset}}$ $\\sim$ 5.2 K, which is slightly lower than the previous report\\cite{Nagao-jpsj13}.  The thermal conductivity $\\kappa$ was measured along the tetragonal $a$ axis (heat current {\\boldmath $q$}$\\parallel a$) on the sample with a rectangular shape ($\\sim$2.6$\\times$1.16$\\times$0.015 mm$^3$) by the standard steady state method in dilution refrigerator.   \n\nFigure~1(a) shows the temperature dependence of the in-plane electrical resistivity $\\rho (T)$ of  NdO$_{0.71}$F$_{0.29}$BiS$_{2}$.  Below 50\\,K , $\\rho (T)$ exhibits Fermi liquid behavior with $T^2$-dependence down to $T_c$.   The residual  resistivity, $\\rho_{0}=137$ $\\mu \\Omega$cm,  is much smaller than the previous reported value~\\cite{Jiao-JPhys15,Liu-EPL14}, indicating the high sample quality.  Figure 1(b) shows the $T$ dependence of $\\kappa/T$ in zero field.  At $T_c$,  $\\kappa/T$ shows no discernible anomaly.   In the superconducting state,  $\\kappa/T$ decreases with decreasing $T$ after showing a broad maximum at around 1.5\\,K. We will discuss this behavior later.  \n\n\n\n\\begin{figure}[t]\n\t\\vspace{12mm}\n\t\\includegraphics[width=\\linewidth,keepaspectratio]{Fig1.eps}\n\t\\caption{(Color online) Temperature dependence of (a) electrical resistivity $\\rho$ and (b) thermal conductivity divided by temperature $\\kappa/T$ã\u0080\u0080 at zero field. Inset of (a) displays the crystal structure of NdO$_{1-x}$F$_x$BiS$_2$. Inset of (b) shows Fermi surface of NdO$_{1-x}$F$_x$BiS$_2$ for $x\\sim 0.3$~\\cite{Usui-prb12,Agatsuma-JMMM16}.}\n\\end{figure}\n\nWe first discuss the low temperature behavior of $\\kappa/T$ in zero field. The thermal conductivity can be written as a sum of the quasiparticle and phonon contributions, $\\kappa=\\kappa_{qp}+\\kappa_{ph}$.   The phonon conductivity in boundary-limited scattering regime at low temperature is expressed as\n\n", "index": 3, "text": "\\begin{equation}\n\\kappa_{ph} = \\frac{1}{3} \\beta \\langle v_{s} \\rangle \\ell_{ph} T^{3},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\kappa_{ph}=\\frac{1}{3}\\beta\\langle v_{s}\\rangle\\ell_{ph}T^{3},\" display=\"block\"><mrow><mrow><msub><mi>κ</mi><mrow><mi>p</mi><mo>⁢</mo><mi>h</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mn>3</mn></mfrac><mo>⁢</mo><mi>β</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>v</mi><mi>s</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">ℓ</mi><mrow><mi>p</mi><mo>⁢</mo><mi>h</mi></mrow></msub><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]