[{"file": "1601.08153.tex", "nexttext": "\nwhere $n$ is the density, $\\nabla\\cdot \\Gamma$ is the divergence of the radial particle flux and $S$ is the particle source. From now on, we drop the brackets ${\\langle{{...}}\\rangle}$ that denote flux-surface average in order to ease the notation.\n\nBefore pellet injection ($t\\!\\lesssim\\!t_{I}$):\n\n", "itemtype": "equation", "pos": 8953, "prevtext": "\n\n\n\\title{Transient particle transport after pellet injection in the TJ-II stellarator}\n\n\n\\author{J.L. Velasco, K. J. McCarthy, N. Panadero, S. Satake$^2$, D. L\\'opez-Bruna, A. Alonso, I. Calvo, A. Dinklage$^3$, T. Estrada, J. M. Fontdecaba, J. Hern\\'andez, R. Garc\\'ia, F. Medina, M. Ochando, I. Pastor, S. Perfilov$^4$, E. S\\'anchez, A. Soleto, B. Ph. Van Milligen, A. Zhezera$^5$, the TJ-II team}\n\n\\address{$^1$Laboratorio Nacional de Fusi\\'on, CIEMAT, Madrid, Spain}\n\\address{$^2$National Institute for Fusion Science, Toki, Japan}\n\\address{$^3$Max Planck Institute for Plasma Physics, Greifswald, Germany}\n\\address{$^4$RNC Kurchatov Institute, Moscow, Russia}\n\\address{$^5$Institute of Plasma Physics, NSC KIPT, Kharkov, Ukraine}\n\n\n\\begin{abstract}\n\nWe study radial particle transport in stellarator plasmas using cryogenic pellet injection. By means of perturbative experiments, we estimate the experimental particle flux and compare it with neoclassical simulations. Experimental evidence is obtained of the fact that core depletion in helical devices can be slowed-down even by pellets that do not reach the core region. {\\textcolor{black}{{This phenomenon is well captured by neoclassical predictions with DKES and FORTEC-3D.}}}\n\n\\end{abstract}\n\n\\maketitle \n\n\\section{Introduction}\n \nCore plasma fuelling is a critical issue for developing steady-state scenarios in fusion reactors. Gas puffing, the standard tool for creating and sustaining the plasma, will be inefficient in  large-size devices, since the particle source is located at the edge. Moreover, the particle source due to recycling  is expected to be small, since the plasma-wall interaction will be highly localized close to the divertor. Neutral beam injection (NBI)~\\cite{kelley1972nbi} has also become a standard method for plasma fuelling, where the associated source can be located at least partially in the core region. Nevertheless, with NBI, an additional energy source is introduced into the plasma, which may be problematic from the point of view of density control. In stellarators, the reason is that particle and energy transport are coupled in the core region (see e.g. reference~\\cite{beidler2011ICNTS}), as they are dominated by the neoclassical contribution~\\cite{dinklage2013ncval,yokoyama2007cerc}. In particular, in Helias-type stellarators, this coupling could create hollow density profiles~\\cite{maassberg1999densitycontrol} and thus exacerbate the need for fuelling mechanisms that mitigate potential core depletion. \n\nPellet injection systems permit echieving relatively localized plasma fuelling without an associated energy source. For this reason, among others, they are the subject of intense research in tokamaks (see e.g.~\\cite{garzotti2003jet,valovic2008mast,lang2012aug,baylor2007iter,polevoi2005iter}) and in helical devices. For instance, the pellet injection system in the Large Helical Device (LHD)~\\cite{yamada2000pellets} extends its operational regime with good energy confinement~\\cite{sakamoto2006repet}. More recently, a four-barrel compact pellet injector has entered operation in the stellarator TJ-II~\\cite{mccarthy2008pinjector,combs2012pinjector}. In Wendelstein 7-X, in operation since December 2015~\\cite{sunnpedersen2015op11}, a pellet blower gun will be available during the second (OP1.2) phase of operation in order to fuel the core of plasmas heated using Electron Cyclotron Resonance Heating (ECH). As a result of this interest, comparative studies of pellet fuelling in these three devices have started~\\cite{mccarthy2015ishw}. Two are the main subjects of this study: on the one hand, an effort is being made, both from the experimental and theoretical points of view, to describe the phenomena of pellet ablation. In particular, comparison of the penetration depth of the pellet with ablation models~\\cite{panadero2016phd} is expected to provide predictive capability on the possibility of core fuelling in large devices. A general prediction of these models (e.g. the widely-used Neutral Gas Shielding model~\\cite{parks1977ngs}) is that the penetration depth of the pellet may not be large enough to reach the core of dense plasmas. This increases the importance of the second line of research: transient transport of charged particles after the injection of a pellet.\n\nHere, perturbative experiments using hydrogen pellets of small size are performed on the stellarator TJ-II. Small pellets are employed for several reasons: first, it is necessary to tailor the penetration depth so that the majority of particles are deposited at an intermediate radial position. These experiments are then relatively close to reproducing the reactor-relevant situation of difficult central particle fuelling. In this situation, we will see that subsequent particle transport redistributes some of the particles to the core, compensating core depletion. This will provide experimental evidence that core depletion in helical devices can be slowed-down even by pellets that do not reach the core region. We will model this phenomenon using neoclassical theory, which describes the transport of charged particles caused by collisions combined with inhomogeneities of the magnetic field. This is an appropriate approach in plasmas in which turbulent transport is negligible (as it usually is in the core of helical devices, see below) but also, as we will argue in Section~\\ref{SEC_SCOPE}, in a more general situation: when turbulent transport is not negligible but is not affected by injection of a pellet.\n\n\nAccurate comparison of neoclassical predictions with experimental measurements is the second reason for injecting small pellets. The above-mentioned prediction of potential core depletion in stellarators relies on simulations of energy and particle transport based on neoclassical theory in the core and complemented with simplified models of turbulent transport in the edge. This is supported by a previous step-by-step systematic validation of predictions of neoclassical theory with experimental results in a number of medium-sized stellarators (LHD, W7AS, TJ-II...)~\\cite{yokoyama2007cerc,dinklage2013ncval}. Generally speaking, such simulations tend to achieve, with some exceptions, reasonable agreement with the experimental particle and heat fluxes within the core region. In particular, the estimates available suggest that core particle transport is well described by neoclassical theory. Nevertheless, these validation activities have focused so far on electron energy~\\cite{yokoyama2007cerc} and ion energy transport~\\cite{dinklage2013ncval}. The reason is that particle balance studies require, at least for some devices, good knowledge of the particle source, which in turn demands a self-consistent modelling of bulk plasma, edge plasma and plasma-wall interaction, which only now is starting to become available~\\cite{feng2014emc3}.\n\nIn order to overcome this problem, we will discuss perturbative experiments. Here, we describe scenarios in which modifications caused by a pellet in the density and temperature plasma profiles are minimal, and therefore the other plasma-dependent sources in the core (recycling and neutral beam injection) do not change: under these conditions, after a transient phase, the density should tend to relax back to the initial state. Measuring this density evolution with sufficient radial resolution will allow us to estimate the experimental particle fluxes associated with the perturbation without requiring knowledge of the particle sources. We will then compare them to neoclassical predictions. In particular, following recent works~\\cite{satake2014eps,velasco2014eps} we will investigate the differences between the predictions of a local and monoenergetic neoclassical code, DKES~\\cite{hirshman1986dkes}, and a non-local, non-monoenergetic neoclassical code, FORTEC-3D~\\cite{satake2006fortec3d}, which includes higher order terms of the drift-kinetic equation. A preliminary result of previous works is that, for the plasma core, neglecting these terms may lead to overestimating the neoclassical contribution to radial ion energy transport, and therefore to underestimating the turbulent contribution to it (an effect larger for low collisionalities in devices with large ripple)~\\cite{satake2015ishw}. {\\textcolor{black}{{In this work, we will see that the non-local neoclassical calculation is closer to the experimental measurement at outer radial positions.}}}\n\nThe work is organized as follows. Section~\\ref{SEC_SCOPE} describes the studied scenarios, both from theoretical and operational points of view. The results are presented in Section~\\ref{SEC_RES}. Finally, Section~\\ref{SEC_CON} shows the conclusions.\n\n\n\\section{Scope of research}\\label{SEC_SCOPE}\n\n\nIn this work, the evolution of the radial density profile after the injection of a pellet is of prime interest. Hence it is necessary to solve the flux-surface-averaged particle transport balance equation:\n\n", "index": 1, "text": "\\begin{equation}\n\\frac{\\partial {\\langle{{n}}\\rangle}}{\\partial t}+ {\\langle{{\\nabla\\cdot\\Gamma}}\\rangle} = {\\langle{{S}}\\rangle}\\,,\\label{EQ_DNDT}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial{\\langle{{n}}\\rangle}}{\\partial t}+{\\langle{{\\nabla\\cdot\\Gamma}}%&#10;\\rangle}={\\langle{{S}}\\rangle}\\,,\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>n</mi><mo stretchy=\"false\">⟩</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>+</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><mo>∇</mo><mo>⋅</mo><mi mathvariant=\"normal\">Γ</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow></mrow><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>S</mi><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\nwhere the subscript $BI$ denotes that all quantities are evaluated at $t\\!=\\!t_{BI}\\!\\lesssim\\!t_{I}$. Then, immediately after an injection ($t\\!=\\!t_{AI}\\!\\gtrsim\\!t_{I}$), the plasma density has changed and, in principle, fluxes and sources should have changed:\n\n", "itemtype": "equation", "pos": 9414, "prevtext": "\nwhere $n$ is the density, $\\nabla\\cdot \\Gamma$ is the divergence of the radial particle flux and $S$ is the particle source. From now on, we drop the brackets ${\\langle{{...}}\\rangle}$ that denote flux-surface average in order to ease the notation.\n\nBefore pellet injection ($t\\!\\lesssim\\!t_{I}$):\n\n", "index": 3, "text": "\\begin{equation}\n\\frac{\\partial n}{\\partial t}\\bigg|_{BI}+ \\nabla\\cdot\\Gamma_{BI} = S_{BI}\\,.\\label{EQ_DNDT_BI}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial n}{\\partial t}\\bigg{|}_{BI}+\\nabla\\cdot\\Gamma_{BI}=S_{BI}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>n</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi></mrow></msub><mo>+</mo><mrow><mo>∇</mo><mo>⋅</mo><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msub><mi>S</mi><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\nIf the pellet is small enough so that the experiment can be considered perturbative, the particle source (NBI absortion, neutrals from the wall) should remain unchanged. For this, $|S_{AI}-S_{BI}|$ should be much smaller than $\\left|\\frac{\\partial n}{\\partial t}|_{AI} - \\frac{\\partial n}{\\partial t}|_{BI}\\right|$. If this is the case, then assuming that $S_{AI}\\!=\\!S_{BI}$ is a valid approximation, and substracting equation~(\\ref{EQ_DNDT_AI}) and equation~(\\ref{EQ_DNDT_BI}), yields:\n\n", "itemtype": "equation", "pos": 9805, "prevtext": "\nwhere the subscript $BI$ denotes that all quantities are evaluated at $t\\!=\\!t_{BI}\\!\\lesssim\\!t_{I}$. Then, immediately after an injection ($t\\!=\\!t_{AI}\\!\\gtrsim\\!t_{I}$), the plasma density has changed and, in principle, fluxes and sources should have changed:\n\n", "index": 5, "text": "\\begin{equation}\n\\frac{\\partial n}{\\partial t}\\bigg|_{AI}+ \\nabla\\cdot\\Gamma_{AI} = S_{AI}\\,.\\label{EQ_DNDT_AI}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial n}{\\partial t}\\bigg{|}_{AI}+\\nabla\\cdot\\Gamma_{AI}=S_{AI}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>n</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi></mrow></msub><mo>+</mo><mrow><mo>∇</mo><mo>⋅</mo><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msub><mi>S</mi><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\n\nThe left-hand-side of equation~(\\ref{EQ_DNDT_PERT}) can be determined from the experiment  while the right-hand side can be calculated using neoclassical theory. The goal of this work is to measure, calculate and compare particle fluxes in the transient phase after the injection of a pellet. Good agreement is expected if particle transport is dominated by the neoclassical contribution, but note that this is a sufficient but not necessary condition: as long as the turbulent contribution to $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})$ is small enough (i.e., as long as turbulent transport is small or, if it is large, has not changed), neoclassical transport determines the transient core density evolution.\n\nFinally, pellet injection also has the effect of slightly reducing the electron and ion temperatures of the radial positions where ablation occurs, thus allowing similar perturbative studies to be done for energy transport of both species. Such studies are left for future work.\n\n\n\\subsection{Measurement of transient evolution: experimental set-up}\\label{SEC_EXP}\n \nTJ-II is a four-period, low magnetic shear stellarator device with an average minor radius $a$ of approximately 0.2$\\,$m, a major radius of 1.5$\\,$m, plasma volume about 1$\\,$m$^3$, and magnetic field at the axis $B(0)\\!\\approx\\!1\\,$T~\\cite{sanchez2013tj-ii}. For this work, plasmas created with hydrogen in the standard magnetic configuration are heated using two gyrotrons operated at 53.2$\\,$GHz, the 2nd harmonic of the electron cyclotron resonance frequency, with $P_{ECH} \\leq 500\\,$kW. Central electron densities $n_e(0)$ and electron temperatures $T_e(0)$ up to $1.7\\times 10^{19}\\,$m$^{-3}$ and $1\\,$keV, respectively, are achieved. Plasmas last up to 250$\\,$ms. In addition, plasmas have been created and maintained using a neutral beam injector heater that provides up to 520$\\,$kW. As a result, plasmas with $n_e(0)\\le 3\\times 10^{19}\\,$m$^{â\u0080\u00933}$ and $T_e(0)\\le 380\\,$eV were achieved. With a lithium coating on the vacuum vessel wall, these plasmas last up to 120$\\,$ms.\n\nThe pellet formation, acceleration, guide line diagnostics, delivery and control systems were developed, built and tested at the laboratories of the Fusion Energy Division of Oak Ridge National Laboratory, Tennessee, USA~\\cite{combs2012pinjector}. For these experiments, pellets containing between $5\\times 10^{18}$ and $10^{19}$ hydrogen atoms are injected at speeds between 800 and 1200$\\,$m/s, their mass being determined with an in-line microwave cavity diagnostic and their ablation being followed using silicon diodes with Balmer H$_\\alpha$ transmission filters ($\\lambda_0 = 656\\,$nm).\n\n In addition, TJ-II is equipped with numerous diagnostics. For instance, the line-averaged electron density, $\\overline{n_e}$, is obtained with 10~$\\mu$s temporal resolution using a microwave interferometer~\\cite{sanchez2004interferometer}. When the density is low, a Heavy Ion Beam Probe (HIBP)~\\cite{bodarenko2001HIBP} can measure local density temporal evolution at several radii. Furthermore, a Thomson Scattering (TS) system~\\cite{herranz2003TS} provides one set of radial density and temperature profiles per discharge; hence shot-to-shot reconstruction is used to determine their evolution. The total plasma electron content is determined by integrating the measured electron profile over the full plasma volume. In this way, the number of deposited pellet particles, and their temporal evolution, can be determined. Since the interferometer cannot capture the fast rise time in the line-averaged electron density after an injection, it is necessary to correct the jump in density using TS data. \n\nMoreover, core $T_e$ measurements are made along a discharge using a soft X-ray filtered diagnostic (SXR)~\\cite{baiao2010SXR}. Finally, the temporal evolution of the core ion temperature $T_i$ is obtained using a Neutral Particle Analyzer (NPA)~\\cite{fontdecaba2014NPA}. Although not shown in this paper, H$\\alpha$ monitors and a Baratron-type manometer are used for estimating the particle source.\n\n\n\\subsection{Calculation of the flux: codes}\\label{SEC_NC}\n\nIn this subsection, the two codes used in the calculation of the neoclassical contribution to the particle flux are briefly presented.\n\nFORTEC-3D~\\cite{satake2006fortec3d} is a $\\delta f$ radially global Monte Carlo code that solves the drift kinetic equation (DKE) for both electrons and ions including finite-orbit-width effects in three-dimensional configurations. For each species, we have:\n\n\\begin{eqnarray}\n(\\mathbf{v_\\parallel}+{{\\mathbf{v_{M}}}}+{{\\mathbf{v_E}}})\\cdot\\nabla \\delta f+{{\\frac{\\mathrm{d}K}{\\mathrm{d}t}\\frac{\\partial \\delta f}{\\partial K}}}-{{C(\\delta f)}} =\\nonumber\\\\ -\\left(\\mathbf{v_M}\\cdot\\nabla +\\frac{\\mathrm{d}K}{\\mathrm{d}t}\\frac{\\partial}{\\partial K}\\right) f_M+{{\\cal{P}}f_M}\\,,\\label{EQ_DKE}\n\\end{eqnarray}\nwhere $\\delta f(r,\\zeta,\\theta,K,\\mu)$ is the deviation of the distribution function with respect to the Maxwellian, $r$ is the radial coordinate, $\\zeta$ and $\\theta$ are the toroidal and poloidal Boozer angles, $K$ is the kinetic energy normalized to that of the thermal ions and $\\mu$ is the magnetic moment. In the first term of the left-hand-side, $v_\\parallel$ is the parallel velocity and\n\\begin{eqnarray}\n\\mathbf{v_M}&=&\\frac{2K-\\mu B}{Ze}\\frac{\\mathbf{B}\\times\\nabla B}{B^3}\\,,\\nonumber\\\\\n\\mathbf{v_E}&=&\\frac{\\mathbf{E}\\times\\mathbf{B}}{B^2}\\,,\n\\end{eqnarray}\nare the magnetic drfit and the ${\\mathbf{E}}\\times {\\mathbf{B}}$ drift caused by the radial electric field $E_r$ respectively, and $Ze$ the particle charge. $C(\\delta f)+\\cal{P}(f_M)$ is a linearized Fokker-Planck collision operator with pitch-angle as well as energy scattering and momentum conservation (more details can be found in reference~\\cite{satake2006fortec3d}). The particle flux can be calculated by taking moments of the distribution function and flux-surface-averaging:\n\n", "itemtype": "equation", "pos": 10420, "prevtext": "\nIf the pellet is small enough so that the experiment can be considered perturbative, the particle source (NBI absortion, neutrals from the wall) should remain unchanged. For this, $|S_{AI}-S_{BI}|$ should be much smaller than $\\left|\\frac{\\partial n}{\\partial t}|_{AI} - \\frac{\\partial n}{\\partial t}|_{BI}\\right|$. If this is the case, then assuming that $S_{AI}\\!=\\!S_{BI}$ is a valid approximation, and substracting equation~(\\ref{EQ_DNDT_AI}) and equation~(\\ref{EQ_DNDT_BI}), yields:\n\n", "index": 7, "text": "\\begin{equation}\n  \\frac{\\partial n}{\\partial t}\\bigg|_{AI} - \\frac{\\partial n}{\\partial t}\\bigg|_{BI} = \\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})\\,.\\label{EQ_DNDT_PERT}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial n}{\\partial t}\\bigg{|}_{AI}-\\frac{\\partial n}{\\partial t}\\bigg{%&#10;|}_{BI}=\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>n</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi></mrow></msub><mo>-</mo><msub><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>n</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mrow><mo>=</mo><mrow><mo>∇</mo><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi></mrow></msub><mo>-</mo><msub><mi mathvariant=\"normal\">Γ</mi><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi></mrow></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\nThe radial electric field is set by ambipolarity of the neoclassical fluxes, $\\Gamma_e(E_r)=\\Gamma_i(E_r)$ for a pure hydrogen plasma ($n_e\\!=\\!n_i$). Note that only here we use subindexes to make explicit the species-dependence.\n\nDKES~\\cite{hirshman1986dkes} solves the DKE in the local and monoenergetic limit: starting from equation~(\\ref{EQ_DKE}), one neglects the magnetic drift and the variation of the kinetic energy on the left-hand-side of the equation, and takes the so-called incompressible limit of the ${\\mathbf{E}}\\times {\\mathbf{B}}$ drift, $\\mathbf{v_E}=\\frac{\\mathbf{E}\\times\\mathbf{B}}{{\\langle{{B^2}}\\rangle}}$. Neglecting the magnetic drift is generally a good approximation, since the ${\\mathbf{E}}\\times{\\mathbf{B}}$ drift is larger in an inverse-aspect-ratio expansion; nevertheless, when $E_r$ is close to zero, the poloidal component of the magnetic drift becomes important. {\\textcolor{black}{{This effect is more important the closer the radial electric field is to zero, the lower the collisionality and the larger the magnetic ripple, i.e., the larger the $1/\\nu$ flux~\\cite{beidler2011ICNTS}}}}. Finally, the collision operator is simplified to the Lorentz operator (pitch-angle-scattering only), so the kinetic energy becomes a parameter rather than a variable. The particle flux can then be calculated as\n\n", "itemtype": "equation", "pos": 16516, "prevtext": "\n\nThe left-hand-side of equation~(\\ref{EQ_DNDT_PERT}) can be determined from the experiment  while the right-hand side can be calculated using neoclassical theory. The goal of this work is to measure, calculate and compare particle fluxes in the transient phase after the injection of a pellet. Good agreement is expected if particle transport is dominated by the neoclassical contribution, but note that this is a sufficient but not necessary condition: as long as the turbulent contribution to $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})$ is small enough (i.e., as long as turbulent transport is small or, if it is large, has not changed), neoclassical transport determines the transient core density evolution.\n\nFinally, pellet injection also has the effect of slightly reducing the electron and ion temperatures of the radial positions where ablation occurs, thus allowing similar perturbative studies to be done for energy transport of both species. Such studies are left for future work.\n\n\n\\subsection{Measurement of transient evolution: experimental set-up}\\label{SEC_EXP}\n \nTJ-II is a four-period, low magnetic shear stellarator device with an average minor radius $a$ of approximately 0.2$\\,$m, a major radius of 1.5$\\,$m, plasma volume about 1$\\,$m$^3$, and magnetic field at the axis $B(0)\\!\\approx\\!1\\,$T~\\cite{sanchez2013tj-ii}. For this work, plasmas created with hydrogen in the standard magnetic configuration are heated using two gyrotrons operated at 53.2$\\,$GHz, the 2nd harmonic of the electron cyclotron resonance frequency, with $P_{ECH} \\leq 500\\,$kW. Central electron densities $n_e(0)$ and electron temperatures $T_e(0)$ up to $1.7\\times 10^{19}\\,$m$^{-3}$ and $1\\,$keV, respectively, are achieved. Plasmas last up to 250$\\,$ms. In addition, plasmas have been created and maintained using a neutral beam injector heater that provides up to 520$\\,$kW. As a result, plasmas with $n_e(0)\\le 3\\times 10^{19}\\,$m$^{â\u0080\u00933}$ and $T_e(0)\\le 380\\,$eV were achieved. With a lithium coating on the vacuum vessel wall, these plasmas last up to 120$\\,$ms.\n\nThe pellet formation, acceleration, guide line diagnostics, delivery and control systems were developed, built and tested at the laboratories of the Fusion Energy Division of Oak Ridge National Laboratory, Tennessee, USA~\\cite{combs2012pinjector}. For these experiments, pellets containing between $5\\times 10^{18}$ and $10^{19}$ hydrogen atoms are injected at speeds between 800 and 1200$\\,$m/s, their mass being determined with an in-line microwave cavity diagnostic and their ablation being followed using silicon diodes with Balmer H$_\\alpha$ transmission filters ($\\lambda_0 = 656\\,$nm).\n\n In addition, TJ-II is equipped with numerous diagnostics. For instance, the line-averaged electron density, $\\overline{n_e}$, is obtained with 10~$\\mu$s temporal resolution using a microwave interferometer~\\cite{sanchez2004interferometer}. When the density is low, a Heavy Ion Beam Probe (HIBP)~\\cite{bodarenko2001HIBP} can measure local density temporal evolution at several radii. Furthermore, a Thomson Scattering (TS) system~\\cite{herranz2003TS} provides one set of radial density and temperature profiles per discharge; hence shot-to-shot reconstruction is used to determine their evolution. The total plasma electron content is determined by integrating the measured electron profile over the full plasma volume. In this way, the number of deposited pellet particles, and their temporal evolution, can be determined. Since the interferometer cannot capture the fast rise time in the line-averaged electron density after an injection, it is necessary to correct the jump in density using TS data. \n\nMoreover, core $T_e$ measurements are made along a discharge using a soft X-ray filtered diagnostic (SXR)~\\cite{baiao2010SXR}. Finally, the temporal evolution of the core ion temperature $T_i$ is obtained using a Neutral Particle Analyzer (NPA)~\\cite{fontdecaba2014NPA}. Although not shown in this paper, H$\\alpha$ monitors and a Baratron-type manometer are used for estimating the particle source.\n\n\n\\subsection{Calculation of the flux: codes}\\label{SEC_NC}\n\nIn this subsection, the two codes used in the calculation of the neoclassical contribution to the particle flux are briefly presented.\n\nFORTEC-3D~\\cite{satake2006fortec3d} is a $\\delta f$ radially global Monte Carlo code that solves the drift kinetic equation (DKE) for both electrons and ions including finite-orbit-width effects in three-dimensional configurations. For each species, we have:\n\n\\begin{eqnarray}\n(\\mathbf{v_\\parallel}+{{\\mathbf{v_{M}}}}+{{\\mathbf{v_E}}})\\cdot\\nabla \\delta f+{{\\frac{\\mathrm{d}K}{\\mathrm{d}t}\\frac{\\partial \\delta f}{\\partial K}}}-{{C(\\delta f)}} =\\nonumber\\\\ -\\left(\\mathbf{v_M}\\cdot\\nabla +\\frac{\\mathrm{d}K}{\\mathrm{d}t}\\frac{\\partial}{\\partial K}\\right) f_M+{{\\cal{P}}f_M}\\,,\\label{EQ_DKE}\n\\end{eqnarray}\nwhere $\\delta f(r,\\zeta,\\theta,K,\\mu)$ is the deviation of the distribution function with respect to the Maxwellian, $r$ is the radial coordinate, $\\zeta$ and $\\theta$ are the toroidal and poloidal Boozer angles, $K$ is the kinetic energy normalized to that of the thermal ions and $\\mu$ is the magnetic moment. In the first term of the left-hand-side, $v_\\parallel$ is the parallel velocity and\n\\begin{eqnarray}\n\\mathbf{v_M}&=&\\frac{2K-\\mu B}{Ze}\\frac{\\mathbf{B}\\times\\nabla B}{B^3}\\,,\\nonumber\\\\\n\\mathbf{v_E}&=&\\frac{\\mathbf{E}\\times\\mathbf{B}}{B^2}\\,,\n\\end{eqnarray}\nare the magnetic drfit and the ${\\mathbf{E}}\\times {\\mathbf{B}}$ drift caused by the radial electric field $E_r$ respectively, and $Ze$ the particle charge. $C(\\delta f)+\\cal{P}(f_M)$ is a linearized Fokker-Planck collision operator with pitch-angle as well as energy scattering and momentum conservation (more details can be found in reference~\\cite{satake2006fortec3d}). The particle flux can be calculated by taking moments of the distribution function and flux-surface-averaging:\n\n", "index": 9, "text": "\\begin{equation}\n\\Gamma=\\bigg\\langle\\int\\mathrm{d}{\\mathbf{v}} \\delta f {\\mathbf{v}}_M\\cdot\\nabla r\\bigg\\rangle\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\Gamma=\\bigg{\\langle}\\int\\mathrm{d}{\\mathbf{v}}\\delta f{\\mathbf{v}}_{M}\\cdot%&#10;\\nabla r\\bigg{\\rangle}\\,,\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mo>=</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">⟨</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mrow><mo>d</mo><mi>𝐯</mi></mrow><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><msub><mi>𝐯</mi><mi>M</mi></msub></mrow><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>r</mi></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\" rspace=\"4.2pt\">⟩</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\nThe neoclassical thermal transport coefficients $D_1$ and $D_2$, can be calculated by convolution of solutions of the monoenergetic drift-kinetic equation calculated with DKES. More details on this calculation for the specific case of the TJ-II magnetic configuration are found in reference~\\cite{velasco2011bootstrap}.\n\nNote that the flux can be written as in equation~(\\ref{EQ_GAMMANC}), as a linear combination of the gradients of density, temperature and electrostatic potential, provided that the radial magnetic drift term of equation~(\\ref{EQ_DKE}) is small. This is generally true even in cases where $E_r$ is close to zero and the poloidal magnetic drift matters. Therefore we can still discuss neoclassical transport in terms of plasma gradients even if the approximations included in DKES do not hold. Obviously, if we were to calculate the coefficients $D_1$ and $D_2$ with FORTEC-3D, they would differ from those calculated with DKES.\n\nFor some cases included in this study, the particle source is estimated. There are three contributions: gas puffing, particle deposition due to NBI and recycling due to the wall. The second one is estimated using the code FAFNER~\\cite{teubel1994fafner}; the third one, using the neutral transport code EIRENE~\\cite{reiter2001eirene}. The inputs for EIRENE are the plasma profiles, the quantity of gas coming from puffing and NBI systems and a particle confinement time $\\tau$ that reflects the level of flux to the wall, i.e., $S=S(n,T_e,T_i,$ gas input$,\\tau)$. An additional equation for $\\tau$ is thus needed, which can be written as:\n\n", "itemtype": "equation", "pos": 17983, "prevtext": "\nThe radial electric field is set by ambipolarity of the neoclassical fluxes, $\\Gamma_e(E_r)=\\Gamma_i(E_r)$ for a pure hydrogen plasma ($n_e\\!=\\!n_i$). Note that only here we use subindexes to make explicit the species-dependence.\n\nDKES~\\cite{hirshman1986dkes} solves the DKE in the local and monoenergetic limit: starting from equation~(\\ref{EQ_DKE}), one neglects the magnetic drift and the variation of the kinetic energy on the left-hand-side of the equation, and takes the so-called incompressible limit of the ${\\mathbf{E}}\\times {\\mathbf{B}}$ drift, $\\mathbf{v_E}=\\frac{\\mathbf{E}\\times\\mathbf{B}}{{\\langle{{B^2}}\\rangle}}$. Neglecting the magnetic drift is generally a good approximation, since the ${\\mathbf{E}}\\times{\\mathbf{B}}$ drift is larger in an inverse-aspect-ratio expansion; nevertheless, when $E_r$ is close to zero, the poloidal component of the magnetic drift becomes important. {\\textcolor{black}{{This effect is more important the closer the radial electric field is to zero, the lower the collisionality and the larger the magnetic ripple, i.e., the larger the $1/\\nu$ flux~\\cite{beidler2011ICNTS}}}}. Finally, the collision operator is simplified to the Lorentz operator (pitch-angle-scattering only), so the kinetic energy becomes a parameter rather than a variable. The particle flux can then be calculated as\n\n", "index": 11, "text": "\\begin{equation}\n\\Gamma = -n D_1\\left[\\left(\\frac{n'}{n}-\\frac{Ze E_r}{T}\\right)+\\left(\\frac{D_2}{D_1}-\\frac{3}{2}\\right)\\frac{T'}{T}\\right]\\,.\\label{EQ_GAMMANC}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\Gamma=-nD_{1}\\left[\\left(\\frac{n^{\\prime}}{n}-\\frac{ZeE_{r}}{T}\\right)+\\left(%&#10;\\frac{D_{2}}{D_{1}}-\\frac{3}{2}\\right)\\frac{T^{\\prime}}{T}\\right]\\,.\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mo>=</mo><mrow><mo>-</mo><mrow><mi>n</mi><mo>⁢</mo><msub><mi>D</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mo>(</mo><mrow><mfrac><msup><mi>n</mi><mo>′</mo></msup><mi>n</mi></mfrac><mo>-</mo><mfrac><mrow><mi>Z</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><msub><mi>E</mi><mi>r</mi></msub></mrow><mi>T</mi></mfrac></mrow><mo>)</mo></mrow><mo>+</mo><mrow><mrow><mo>(</mo><mrow><mfrac><msub><mi>D</mi><mn>2</mn></msub><msub><mi>D</mi><mn>1</mn></msub></mfrac><mo>-</mo><mfrac><mn>3</mn><mn>2</mn></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mfrac><msup><mi>T</mi><mo>′</mo></msup><mi>T</mi></mfrac></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08153.tex", "nexttext": "\nwhere $\\cal{S}$ and $V$ are the area and volume of the last-closed flux-surface. Note that, once the source has been calculated, equation~(\\ref{EQ_DNDT}) can be used for estimating the experimental flux, if $\\frac{\\partial n}{\\partial t}$ can be measured accurately or if it is negligible compared with the other two terms in the equation.\n\n\n\\subsection{Plasma scenarios}\\label{SEC_SCE}\n\nThe properties of the two scenarios studied in this work are summarized in this subsection. Firstly, scenario I is a situation with core depletion and difficult central fuelling. The target plasma is heated by NBI, has a relatively peaked density profile and the line-averaged density decreases at a constant rate at the time of pellet injection due to reduction of the gas-puffing. Looking at equation~(\\ref{EQ_DNDT_PERT}), we will be in a situation in which $\\frac{\\partial n}{\\partial t}|_{BI}\\!<\\!0$. A small pellet is injected, so that it ablates at an intermediate radial position. Then the fuelled plasmas have flatter core density, hence $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})>0$ due to the change in the thermodynamical force associated with the density gradient (see equation~(\\ref{EQ_GAMMANC})). For a large enough change, there will be indirect core fuelling, indicated experimentally by $\\frac{\\partial n}{\\partial t}|_{AI}>0$.\n\nNext, scenario II is an ECH-heated plasma with a hollow density profile. Density is kept approximately constant in time, i.e. $\\frac{\\partial n}{\\partial t}|_{BI}=0$. The pellet then ablates close to the core, the hollowness is removed, we end up with a peaked density profile; hence $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})<0$, and there will be a fast density evolution with $\\frac{\\partial n}{\\partial t}|_{AI}<0$ back to the initial situation. One has to note that, in this low density plasma, the number of injected particles is not negligible when compared to that in the target plasma, so the assumption of perturbative experiment may be not good enough for a quantitative comparison.\n\n\n\\section{Results}\\label{SEC_RES}\n\n\n\\subsection{Scenario I}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{nline1.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{Te1.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{Ti1.pdf}\n\\end{center}\n\\vskip-1cm\\caption{Time traces of (top) line-averaged density, (center) central electron temperature, and (bottom) central ion temperature in discharges \\#39063 (red), \\#39062 (green) and \\#39065 (blue). Pellet ablation is indicated by the sudden increase of density and a black vertical line; coloured vertical lines show the TS time for each discharge.}\n\\label{FIG_TRACES1}\n\\end{figure}\n\n\n\n\nFigure~\\ref{FIG_TRACES1} shows the temporal evolution of the main plasma parameters along discharges \\#39062, \\#39063 and \\#39065: line-average density, and central electron and ion temperatures. Before injection of the pellet, the temperatures are approximately constant with time, and the density decreases at an approximately constant rate $\\frac{\\partial n}{\\partial t}|_{BI}\\approx - 10^{20}\\,$m$^{-3}$s$^{-1}$. The ablation of the pellet is observed at $t\\!=\\!1095\\,$ms for the three discharges. Both central temperatures show a $\\sim 25\\,$\\% decrease and return to the previous level after $5\\,$ms. On the other hand, the evolution of the density is much slower, denoting that the particle confinement time is larger than the energy confinement time for this scenario. Hence, this (rough) scale separation allow us to focus on particle transport while ignoring energy transport. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{neprof1.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{teprof1.pdf}\\vskip-2.1cm\n\\end{center}\n\\vskip-1.cm\\caption{Electron density and temperature profiles before pellet injection (BI, \\#39063), immediately after pellet injection (AI, \\#39062), and long after pellet injection (LAI, \\#39065).}\n\\label{FIG_TS1}\n\\end{figure}\n\nThe above three discharges are used to reconstruct the evolution of the profiles. Figure~\\ref{FIG_TS1} shows the density and electron temperature profiles immediately before (\\#39063), immediately after (\\#39062) and 20$\\,$ms after (\\#39065) injection of a pellet. The pellet is ablated at $r\\!\\approx\\!0.5a$, as indicated by the change of density profile in figure~\\ref{FIG_TS1} (top). This profile has a distinctive temporal evolution: after an initial increase in density about the ablation radii, the density increases in the core region ($r\\!<\\!0.3a$), while it decreases in outer regions ($0.3a\\!<\\!r\\!<\\!0.7a$). Since the core density remains almost unchanged by the injection, as does the energy source, the core electron temperature returns to previous values, and it does so very quickly, as anticipated by figure~\\ref{FIG_TRACES1}. Altogether, these measurements indicate that the  situation is one of difficult central fuelling, and that the problem is partially mitigated by subsequent particle transport.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{sources1.pdf}\n\\end{center}\n\\vskip-1.cm\\caption{Particle sources for discharges before (BI, \\#39063) and after (AI, \\#39062) pellet ablation.}\n\\label{FIG_SOURCES1}\n\\end{figure}\n\nBefore discussing theoretically this experimental result, it is necessary to confirm that the experiment can be considered to be perturbative. For this, the particle sources $S$ are estimated before injection and immediately after pellet complete ablation (so that there is no source associated to it anymore). This is seen in figure~\\ref{FIG_SOURCES1}, where the contributions of the NBI system and wall recycling are plotted. The difference in the core $|S_{AI}-S_{BI}|$ is between 0 and 10$^{20}\\,$m$^{-3}$s$^{-1}$. This difference, due to changes in recycling, is smaller than $\\left|\\frac{\\partial n}{\\partial t}|_{AI}-\\frac{\\partial n}{\\partial t}|_{BI}\\right|$: inspection of figure~\\ref{FIG_TS1} shows that the core density increases by $\\sim 0.5\\times 10^{19}\\,$m$^{-3}$ in 16$\\,$ms, i.e. $\\left|\\frac{\\partial n}{\\partial t}|_{AI}\\right|\\approx 3\\times 10^{20}\\,$m$^{-3}$s$^{-1}$ and $\\left|\\frac{\\partial n}{\\partial t}|_{AI}-\\frac{\\partial n}{\\partial t}|_{BI}\\right|\\approx 4\\times 10^{20}\\,$m$^{-3}$s$^{-1}$.\n\nWe thus proceed with the neoclassical simulations. As input for the calculations we used smoothed profiles taken from figure~\\ref{FIG_TS1}. For the sake of simplicity, thanks to the above-mentioned different time-scales, the electron and ion temperature profiles are considered to be equal before and after the pellet injection; $T_i(r)$, only measured in the core region, is taken proportional to $T_e(r)$~\\cite{fontdecaba2010pfr}. As discussed in Section~\\ref{SEC_SCE}, after injection, the density profile becomes flatter at the core ($r<0.5a$) and steeper at outer radial positions ($0.5a\\!<\\!r\\!<\\!0.7a$). In order to emphasize that the change in the density gradient is significant, in figure~\\ref{FIG_TF1} we show the thermodynamical forces associated with the density and temperature gradients before and after the injection, as calculated from Thomson Scattering measurements using a Bayesian method~\\cite{milligen2011bayes}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{dneprof1.pdf}\n\\end{center}\n\\vskip-1.cm\\caption{Thermodynamical forces associated to the density and temperature gradients before and after the injection in scenario I.}\n\\label{FIG_TF1}\n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{dndt1b.pdf}\n\\end{center}\n\\vskip-1.cm\\caption{Contribution of neoclassical transport, calculated with DKES, to the particle balance equation in scenario I.}\n\\label{FIG_DNDT1}\n\\end{figure}\n\nThe consequences are seen in figure~\\ref{FIG_DNDT1}, where we show the divergence of the neoclassical flux calculated before and after the injection of the pellet, and the predicted density evolution according to equation~(\\ref{EQ_DNDT_PERT}). We focus on the region $r/a\\!<\\!0.6$, where neoclassical theory generally describes successfully radial transport in helical devices~\\cite{dinklage2013ncval}. As one could expect by inspection of equation~(\\ref{EQ_GAMMANC}), it is positive in the core region ($r\\!<\\!0.4a$) and negative in outer positions, as measured in the experiment. The value of the core density increase is also in rough agreement with measurements, since we predict $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})$ between 0 and $5\\times 10^{20}\\,$m$^{-3}$s$^{-1}$ in the core region, compared with $\\frac{\\partial n}{\\partial t}|_{BI}-\\frac{\\partial n}{\\partial t}|_{AI}$ between 0 and $4\\times 10^{20}\\,$m$^{-3}$s$^{-1}$ measured by Thomson Scattering, and represented by corsses in Fig.~\\ref{FIG_DNDT1}.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{gamma39063.pdf}\n\\end{center}\n\\vskip-1.cm\\caption{Radial fluxes of discharge \\#39063.}\n\\label{FIG_GAMMA1}\n\\end{figure}\n\nIt should be noted that the quantitative agreement reported above allows us to conclude that density evolution after injection of a pellet is dominated by neoclassical transport; however, it provides no information of whether it was also the case before the injection. In order to check that, we have to compare directy the experimental fluxes with the neoclassical predictions. Figure~\\ref{FIG_GAMMA1} shows the experimental flux for discharge \\#39063, before the pellet injection. It is calculated with the transport suite ASTRA~\\cite{pereverzev2002ASTRA}, using equation~(\\ref{EQ_DNDT}) and the source from figure~\\ref{FIG_SOURCES1}. {\\textcolor{black}{{We compare it with the neoclassical fluxes calculated with DKES and FORTEC-3D and achieve a reasonable agreement in the core region $r/a\\!<\\!0.4$ (the error bars in the thermodynamical forces of Fig.~\\ref{FIG_TF1} provide a rough estimate of the precision of the neoclassical calculations). At outer radial positions, $0.4\\!<\\!r/a\\!<\\!0.7$, the radial flux predicted with DKES is above the experimental estimate, which would suggest that DKES overestimates neoclassical transport under these plasma conditions (since otherwise, if the DKES calculation were not an overestimate of neoclassical transport, we would need an additional inward anomalous pinch for the total flux to be in agreement with the experimental estimate). Indeed FORTEC-3D predicts a radial flux about 50\\% smaller than the one calculated with DKES, and below the experimental estimate. The reason behind the difference between the two simulations is sketched in Fig.~\\ref{FIG_AMB1}: the inclusion of the magnetic drift term in the drift kinetic equation removes the peak close to $E_r\\!=\\!0$ in the radial flux of both species. At $r/a\\!=\\!0.6$ (bottom) the peak is relatively large, leading to relevant differences between DKES and FORTEC-3D; at $r/a\\!=\\!0.2$ (top), since the collisionality is larger and the ripple smaller, these differences are smaller.}}}\n\nA more comprehensive comparison between theory and experiment for this discharge can be found in reference~\\cite{satake2015ishw,satake2016ppcf}: there, poor agreement was found between predictions of $E_r$ and measurements of electrostatic potential by means of HIBP. Note nevertheless that, in these NBI ion-root plasmas, the particle flux is basically determined by that of the electrons, which depends weakly on $E_r$~\\cite{satake2015ishw,satake2016ppcf}. Therefore, while this disagreement would cast doubts on predictions of energy transport for discharge \\#39063, it is not the case for particle transport.  Finally, the fact that neoclassical predictions of particle flux agree with two independent estimates of the experimental flux gives confidence for the three of them.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{amb_39063_02.pdf}\\vskip-2.5cm\n\\includegraphics[angle=0,width=\\columnwidth]{amb_39063_06.pdf}\n\\end{center}\n\\vskip-1.3cm\\caption{{\\textcolor{black}{{Neoclassical particle radial fluxes as a function of the radial electric field for discharge \\#39063 at r/a=0.2 (top) and r/a=0.6 (bottom). The crossing between the electron and ion curves gives the neoclassical estimate of the particle flux, which can then be compared to the experimental estimate.}}}}\n\\label{FIG_AMB1}\n\\end{figure}\n\n\n\\subsection{Scenario II}\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{nline2.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{Te2.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{Ti2.pdf}\n\\end{center}\n\\vskip-1cm\\caption{Time traces of (top) line-averaged density, (center) central electron temperature, and (bottom) central ion temperature in discharges \\#39756 (red), \\#39759 (green) and \\#39757 (blue). Pellet ablation is indicated by the sudden increase of density and a black vertical line; coloured vertical lines show the TS time for each discharge.}\n\\label{FIG_TRACES2}\n\\end{figure}\n\nFigure~\\ref{FIG_TRACES2} is the equivalent of figure~\\ref{FIG_TRACES1} for scenario II: it shows the temporal evolution of the line-averaged density, and central electron and ion temperatures along discharges \\#39756, \\#39759 and  \\#39757. The situation is comparable to that of the NBI plasma: before the injection of the pellet, the temperatures are approximately constant with time, and the density decreases at a very small constant rate, $\\frac{\\partial n}{\\partial t}|_{BI}\\approx -10^{19}\\,$m$^{-3}$s$^{-1}$. The ablation of the pellet takes place at $t\\!=\\!1150\\,$ms for the latter two. The electron temperature decreases by about 20 $\\%$, while the ion temperature increases by about 20 $\\%$. The latter may be partially caused by the larger thermal coupling to the electrons, consequence of the increase of $n$, or a small change in ion energy transport. Both temperatures return to the values before injection in some 15$\\,$ms. As in the NBI case, the evolution of the density is slower, although not much slower.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{neprof2.pdf}\\vskip-2.1cm\n\\includegraphics[angle=0,width=\\columnwidth]{teprof2.pdf}\\vskip-2.1cm\n\\end{center}\n\\vskip-1.cm\\caption{Electron density and temperature profiles before pellet injection (BI, \\#39756), immediately after pellet injection (AI, \\#39759), and long after pellet injection (LAI, \\#39757).}\n\\label{FIG_TS2}\n\\end{figure}\n\n\nThe above three discharges are used to reconstruct the evolution of the profiles, as we did for scenario I. Figure~\\ref{FIG_TS2}, comparable to figure~\\ref{FIG_TS1}, shows the density and electron temperature profiles immediately before (\\#39756), 6$\\,$ms after (\\#39759) and 11$\\,$ms after (\\#39757) injection of a pellet (actually discharge \\#39756 has no pellet injection). The pellet is ablated at $r\\!<\\!0.8a$, as indicated by the increase in $n_e$. As shown in figure~\\ref{FIG_TRACES2}, the electron temperature evolution is slower than in the NBI case, and differences between the $T_e$ profiles are not negligible. The density profile behaves in an opposite manner to that of scenario I. After an initial incresase at $r\\!<\\!0.8a$, the density decreases monotonously in all the core region. Note that no change in the profile shape is created by the pellet: it was slightly hollow before injection, and it remains so after it.\n\nIn these low-density plasmas, the change in density is large, and this in turn may modify the electron energy source (as $P_{ECH}/\\overline{n}$ changes), so it is difficult to justify that the experiment is perturbative. Moreover, these ECH plasmas are close to a \\textit{critical} density at which a transport bifurcation takes place at TJ-II, caused by a change of root of the radial electric field (see e.g. reference~\\cite{velasco2012prl} and refereces therein). Nevertheless, the time evolution of discharges \\#39757 and \\#39759 is similar to that of a perturbative experiment: the line-averaged density and the electron temperature show an approximately exponential relaxation back to their initial values. \n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=0,width=\\columnwidth]{dndt2b.pdf}\n\\end{center}\n\\vskip-1.cm\\caption{Transient density evolution calculated with DKES and estimated with Thomson Scattering in scenario II.}\n\\label{FIG_DNDT2}\n\\end{figure}\n\nWith this in mind, we repeat the simulations performed for scenario I, again focusing on $r/a\\!<\\!0.6$. In this case, differences in the $T_e$ profiles before and after injection must be taken into account in the simulations; the ion temperature profile is assumed proportional to the density profile~\\cite{fontdecaba2010pfr}. Since the density profile shape has not fundamentally changed, the main difference between the density before and after ablation is the absolute value, not the gradient. After ablation, density is larger, so is ion collisionality and, for plasmas in electron root with ions in the $\\sqrt{\\nu}$ regime, the particle flux. This is shown in figure~\\ref{FIG_DNDT2}: the divergence of the neoclassical flux calculated before and after the injection of the pellet, and the predicted density evolution according to equation~(\\ref{EQ_DNDT_PERT}) are plotted. We predict a density decrease faster than the initial rate, and in reasonable quantitative agreement with the experiment, also represented in figure~\\ref{FIG_DNDT2}: we obtain $\\nabla\\cdot(\\Gamma_{BI}-\\Gamma_{AI})$ between 0 and $-3\\times 10^{20}\\,$m$^{-3}$s$^{-1}$ in the core region, while TS yields $\\frac{\\partial n}{\\partial t}|_{AI}-\\frac{\\partial n}{\\partial t}|_{BI}\\!=\\!-4\\times 10^{20}\\,$m$^{-3}$s$^{-1}$.\n\n\n\n\\section{Conclusions}\\label{SEC_CON}\n\nIn this paper, it is demonstrated that neoclassical theory can account for the particle evolution after the injection of a cryogenic pellet. {\\textcolor{black}{{In particular, improved neoclassical simulations show better agreement with experiment at outer radial positions}}}. This is relevant due to the foreseeen problem of density control in large helical devices, and the predicted difficulty of core fuelling. \n\nIn TJ-II plasmas, in which a particle source exists ($S\\!\\ne\\!0$) and the density variation is negative but small in absolute value ($\\frac{\\partial n}{\\partial t}|_{BI}\\!\\lesssim\\!0$)  the core density can be made to transiently increase ($\\frac{\\partial n}{\\partial t}|_{AI}\\!>\\!0$) by injection of a pellet at an intermediate radial position. Note that this is independent of whether the gradient density is positive or not. \n\nSince this result can be understood on the grounds of neoclassical theory, one may try to generalize it: in a stellarator reactor, in which the particle source is expected to be negligible ($S\\!=\\!0$) and one could have core depletion ($\\frac{\\partial n}{\\partial t}|_{BI}\\!<\\!0$), the injection of a pellet could mitigate the density loss $\\frac{\\partial n}{\\partial t}|_{AI}> \\frac{\\partial n}{\\partial t}|_{BI}$. Nevertheless, complete density control ($\\frac{\\partial n}{\\partial t}|_{AI}\\!\\ge\\!0$) could require positive density gradients, as measured e.g. in LHD~\\cite{mccarthy2015ishw}. In order to provide more support to these conclusions, further studies of particle transport should be performed in studies closer to reactor-relevant conditions, e.g., in W7-X plasmas.\n\nAs a conclusion, we have obtained experimental evidence of the fact that, in some scenarios, core depletion can be compensated or slowed-down even by pellets that do not reach the core region, a phenomenon that is well captured by neoclassical theory. Future work will include study of energy transport and of particle transport in NBI plasmas in which the pellet produces positive density gradients.\n\n\n\\section*{Acknowledgments}\n\nThe authors are indebted to Dr. Elena de la Luna for valuable discussions on pellet studies in tokamaks. This work has been carried out within the framework of the EUROfusion Consortium and has received funding from the European Unionâ\u0080\u0099s Horizon 2020 research and innovation programme under grant agreement number 633053. The views and opinions expressed herein do not necessarily reflect those of the European Commission. This research was supported in part by grants ENE2012-30832 and ENE2013-48679, Ministerio de Econom\\'ia y Competitividad, Spain. FORTEC-3D simulations were carried out with HELIOS supercomputer system at International Fusion Energy Research Centre, Japan, under the Broader Approach collaboration between Euratom and Japan, and with Plasma Simulator in NIFS, under the NIFS Collaboration Research program (NIFS15KNST079).\n\n\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{kelley1972nbi}\nG~G Kelley, O~B Morgan, L~D Stewart, W~L Stirling, and H~K Forsen.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 12(2):169, 1972.\n\n\\bibitem{beidler2011ICNTS}\nC~D Beidler, K~Allmaier, M~Yu Isaev, S~V Kasilov, W~Kernbichler, G~O Leitold,\n  H~Maa{\\ss}berg, D~R Mikkelsen, S~Murakami, M~Schmidt, D~A Spong, V~Tribaldos,\n  and A~Wakasa.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 51(7):076001, 2011.\n\n\\bibitem{dinklage2013ncval}\nA~Dinklage, M~Yokoyama, K~Tanaka, J~L Velasco, D~L\\'opez-Bruna, C~D Beidler,\n  S~Satake, E~Ascas\\'ibar, J~Ar\\'evalo, J~Baldzuhn, Y~Feng, D~Gates, J~Geiger,\n  K~Ida, M~Jakubowski, A~L\\'opez-Fraguas, H~Maassberg, J~Miyazawa, T~Morisaki,\n  S~Murakami, N~Pablant, S~Kobayashi, R~Seki, C~Suzuki, Y~Suzuki, Yu~Turkin,\n  A~Wakasa, R~Wolf, H~Yamada, M~Yoshinuma, {LHD Exp. Group}, {TJ-II Team}, and\n  {W7-AS Team}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 53(6):063022, 2013.\n\n\\bibitem{yokoyama2007cerc}\nM~Yokoyama, H~Maa{\\ss}berg, C~D Beidler, V~Tribaldos, K~Ida, T~Estrada,\n  F~Castej\\'on, A~Fujisawa, T~Minami, T~Shimozuma, Y~Takeiri, A~Dinklage,\n  S~Murakami, and H~Yamada.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 47(9):1213, 2007.\n\n\\bibitem{maassberg1999densitycontrol}\nH~MaaÃ\u009fberg, C~D Beidler, and E~E Simmet.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma Physics and Controlled Fusion}, 41(9):1135, 1999.\n\n\\bibitem{garzotti2003jet}\nL~Garzotti, X~Garbet, P~Mantica, V~Parail, M~ValoviÄ\u008d, G~Corrigan, D~Heading,\n  T~T~C Jones, P~Lang, H~Nordman, B~P\\'Ã©gouri\\'e, G~Saibene, J~Spence,\n  P~Strand, J~Weiland, and {contributors to the EFDA-JET Workprogramme}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 43(12):1829, 2003.\n\n\\bibitem{valovic2008mast}\nM~ValoviÄ\u008d, K~Axon, L~Garzotti, S~Saarelma, A~Thyagaraja, R~Akers, C~Gurl,\n  A~Kirk, B~Lloyd, G~P Maddison, A~W Morris, A~Patel, S~Shibaev, R~Scannell,\n  D~Taylor, M~Walsh, and the MAST~Team.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 48(7):075006, 2008.\n\n\\bibitem{lang2012aug}\nP~T Lang, W~Suttrop, E~Belonohy, M~Bernert, R~M~Mc Dermott, R~Fischer,\n  J~Hobirk, O~J W~F Kardaun, G~Kocsis, B~Kurzan, M~Maraschek, P~de~Marne,\n  A~Mlynek, P~A Schneider, J~Schweinzer, J~Stober, T~Szepesi, K~Thomsen,\n  W~Treutterer, E~Wolfrum, and {the ASDEX Upgrade Team}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 52(2):023017, 2012.\n\n\\bibitem{baylor2007iter}\nL~R Baylor, P~B Parks, T~C Jernigan, J~B Caughman, S~K Combs, C~R Foust, W~A\n  Houlberg, S~Maruyama, and D~A Rasmussen.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 47(5):443, 2007.\n\n\\bibitem{polevoi2005iter}\nA~R Polevoi, M~Shimada, M~Sugihara, Yu~L Igitkhanov, V~S Mukhovatov, A~S\n  Kukushkin, S~Yu Medvedev, A~V Zvonkov, and A~A Ivanov.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 45(11):1451, 2005.\n\n\\bibitem{yamada2000pellets}\nH~Yamada, R~Sakamoto, Y~Oda, T~Hiramatsu, M~Kinoshita, M~Ogino, R~Matsuda,\n  S~Sudo, S~Kato, P~W Fisher, L~R Baylor, and M~Gouge.\n{\\hskip .11em plus .33em minus .07em} {\\em Fusion Engineering and Design}, 49â\u0080\u009350:915, 2000.\n\n\\bibitem{sakamoto2006repet}\nR~Sakamoto, H~Yamada, Y~Takeiri, K~Narihara, T~Tokuzawa, H~Suzuki, S~Masuzaki,\n  S~Sakakibara, S~Morita, M~Goto, B~J Peterson, K~Matsuoka, N~Ohyabu, A~Komori,\n  O~Motojima, and {the LHD experimental group}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 46(11):884, 2006.\n\n\\bibitem{mccarthy2008pinjector}\nK~J McCarthy, S~K Combs~S K, L~R Baylor, J~B~O Caughman, D~T Fehling, C~R\n  Foust, J~M McGill, J~M Carmona, and D~A Rasmussen.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 79(10), 2008.\n\n\\bibitem{combs2012pinjector}\nS~K Combs, C~R Foust, J~M McGill, J~B~O Caughman, K~J McCarthy, L~R Baylor~M\n  Chamorro, D~T Fehling, R~Garc\\'ia, J~H Harris, J~Hern\\'andez-S\\'anchez,\n  C~Hidalgo, S~J Meitner, D~A Rasmussen, and R~Unamuno.\n{\\hskip .11em plus .33em minus .07em} {\\em Fusion Science and Technology}, 64(3), 2012.\n\n\\bibitem{sunnpedersen2015op11}\nT~Sunn Pedersen, T~Andreeva, H-S Bosch, S~Bozhenkov, F~Effenberg, M~Endler,\n  Y~Feng, D~A Gates, J~Geiger, D~Hartmann, H~H\\\"olbe, M~Jakubowski, R~K\\\"onig,\n  HP~Laqua, S~Lazerson, M~Otte, M~Preynas, O~Schmitz, T~Stange, Y~Turkin, and\n  {the W7-X Team}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 55(12):126001, 2015.\n\n\\bibitem{mccarthy2015ishw}\nK~J McCarthy, J~Baldzuhn, R~Sakamoto, A~Dinklage, S~Cats, G~Motojima,\n  N~Panadero, B~P\\'egouri\\'e, H~Yamada, E~Ascas\\'ibar, {the LHD Team}, {the\n  W7-X Team}, and {the TJ-II Team}.\n{\\hskip .11em plus .33em minus .07em} {Comparative Study of Pellet Fuelling in 3-D Magnetically Confined\n  Plasma Devices}.\n{\\hskip .11em plus .33em minus .07em} In {\\em 20th International Stellarator/Heliotron Workshop,\n  Greifswald, Germany}, 2015.\n\n\\bibitem{panadero2016phd}\nN~Panadero.\n{\\hskip .11em plus .33em minus .07em} {PhD Thesis}.\n{\\hskip .11em plus .33em minus .07em} In preparation.\n\n\\bibitem{parks1977ngs}\nP~B Parks, R~J Turnbull, and C~A Foster.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 17(3):539, 1977.\n\n\\bibitem{feng2014emc3}\nY~Feng, H~Frerichs, M~Kobayashi, A~Bader, F~Effenberg, D~Harting, H~Hoelbe,\n  J~Huang, G~Kawamura, J~D Lore, T~Lunt, D~Reiter, O~Schmitz, and D~Sharma.\n{\\hskip .11em plus .33em minus .07em} {\\em Contributions to Plasma Physics}, 54(4-6):426, 2014.\n\n\\bibitem{satake2014eps}\nS~Satake, {J L Velasco}, A~Dinklage, M~Yokoyama, Y~Suzuki, C~D Beidler,\n  H~Maassberg, J~Geiger, A~Wakasa, S~Matsuoka, S~Murakami, D~L\\'opez-Bruna,\n  N~Pablant, {LHD Exp Group}, {TJ-II Team}, and {W7-AS Team}.\n{\\hskip .11em plus .33em minus .07em} In {\\em 41th European Physical Society Conference on Plasma Physics,\n  Berlin, Germany}, 2014.\n\n\\bibitem{velasco2014eps}\n{J L Velasco}, D~L\\'opez-Bruna, S~Satake, E~Ascas\\'ibar, A~Dinklage, T~Estrada,\n  K~J McCarthy, F~Medina, M~Ochando, and M~Yokoyama.\n{\\hskip .11em plus .33em minus .07em} In {\\em 41th European Physical Society Conference on Plasma Physics,\n  Berlin, Germany}, 2014.\n\n\\bibitem{hirshman1986dkes}\nS~P Hirshman, K~C Shaing, W~I van Rij, C~O Beasley, and E~C Crume.\n{\\hskip .11em plus .33em minus .07em} {\\em Physics of Fluids}, 29(9):2951--2959, 1986.\n\n\\bibitem{satake2006fortec3d}\nS~Satake, M~Okamoto an~N~Nakajima, H~Sugama, and M~Yokoyama.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma and Fusion Research}, 1:002, 2006.\n\n\\bibitem{satake2015ishw}\nS~Satake, J~L Velasco, D~L\\'opez-Bruna, A~Dinklage, J~M Garc\\'ia-Rega{\\~n}a,\n  C~D Beidler, H~Maassberg, J~Geiger, M~Yokoyama, T~Ido, A~Shimizu, K~Tanaka,\n  Y~Suzuki, A~Ishizawa, S~Matsuoka, A~Wakasa, S~Murakami, and N~Pablant.\n{\\hskip .11em plus .33em minus .07em} {Validation and verification of neoclassical transport codes for\n  heliotron/stellarator devices}.\n{\\hskip .11em plus .33em minus .07em} In {\\em 20th International Stellarator-Heliotron Workshop,\n  Greifswald, Germany}, 2015.\n\n\\bibitem{sanchez2013tj-ii}\nJ~S{\\'a}nchez and {TJ-II Team}.\n{\\hskip .11em plus .33em minus .07em} {\\em Nuclear Fusion}, 53(10):104016, 2013.\n\n\\bibitem{sanchez2004interferometer}\nM~S\\'anchez, J~S\\'anchez, T~Estrada, E~S\\'anchez, P~Acedo, and H~Lamela.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 75(10):3414--3416, 2004.\n\n\\bibitem{bodarenko2001HIBP}\nI~S Bondarenko, A~A Chmuga, N~B Dreval, S~M Khrebtov, A~D Komarov, A~S\n  Kozachok, L~I Krupnik, P~Coelho, M.~B~Cunha, GonÃ§alves, A~Malaquias, I~S\n  Nedzelskiy, C~A~F Varandas, C~Hidalgo, I~Garc\\'ia-Cort\\'es, and A~V Melnikov.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 72(1):583--585, 2001.\n\n\\bibitem{herranz2003TS}\nJ~Herranz, F~Castej\\'on, I~Pastor, and K~J McCarthy.\n{\\hskip .11em plus .33em minus .07em} {\\em Fusion Engineering and design}, 65(4):525--536, 2003.\n\n\\bibitem{baiao2010SXR}\nD~Baiao, F~Medina, M~Ochando, I~Pastor, C~Varandas, A~Molinero, and\n  J~Ch\\'ercoles.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 81, 2010.\n\n\\bibitem{fontdecaba2014NPA}\nJ~M Fontdecaba, S~Ya Petrov, V~G Nesenevich, A~Ros, F~V Chernyshev, K~J\n  McCarthy, and J~M Barcala.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 85(11), 2014.\n\n\\bibitem{velasco2011bootstrap}\nJ~L Velasco, K~Allmaier, A~L\\'opez Fraguas, C~D Beidler, H~Maa{\\ss}berg,\n  W~Kernbichler, F~Castej\\'on, and J~A Jim\\'enez.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma Physics and Controlled Fusion}, 53(11):115014, 2011.\n\n\\bibitem{teubel1994fafner}\nA~Teubel and F~P Penningsfeld.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma Physics and Controlled Fusion}, 36(1):143, 1994.\n\n\\bibitem{reiter2001eirene}\nD~Reiter, M~Baelmans, and P~Boerner.\n{\\hskip .11em plus .33em minus .07em} {\\em Fusion Science and Technology}, 47:172, 2001.\n\n\\bibitem{fontdecaba2010pfr}\nJ~M Fontdecaba, I~Pastor, J~Ar\\'evalo, J~Herranz, K~J McCarthy, and\n  G~S\\'anchez-Burillo.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma Fusion Research}, 5:S2085, 2010.\n\n\\bibitem{milligen2011bayes}\nB.~Ph. van Milligen, T.~Estrada, E.~Ascas\\'ibar, D.~Tafalla, D.~L\\'opez-Bruna,\n  A.~L\\'opez Fraguas, J.~A. Jim\\'enez, I.~Garc\\'ia-Cort\\'es, A.~Dinklage, and\n  R.~Fischer.\n{\\hskip .11em plus .33em minus .07em} {\\em Review of Scientific Instruments}, 82(7):073503, 2011.\n\n\\bibitem{pereverzev2002ASTRA}\nG~V Pereverzev and P~Yushmanov.\n{\\hskip .11em plus .33em minus .07em} {ASTRA automated system for transport analysis}.\n{\\hskip .11em plus .33em minus .07em} {\\em IPP Technical Report}, 5/98, 2002.\n\n\\bibitem{satake2016ppcf}\nS~Satake, {J L Velasco}, D~L\\'opez-Bruna, A~Dinklage, J~M Garc\\'ia-Rega{\\~n}a,\n  C~D Beidler, H~Maassberg, J~Geiger, M~Yokoyama, T~Ido, A~Shimizu, K~Tanaka,\n  Y~Suzuki, A~Ishizawa, S~Matsuoka, A~Wakasa, S~Murakami, and N~Pablant.\n{\\hskip .11em plus .33em minus .07em} {\\em Plasma Physics and Controlled Fusion}, 2016, submitted.\n\n\\bibitem{velasco2012prl}\nJ~L Velasco, J~A Alonso, I~Calvo, and J~Ar\\'evalo.\n{\\hskip .11em plus .33em minus .07em} {\\em Physical Review Letters}, 109:135003, 2012.\n\n\\end{thebibliography}\n\n\n \n", "itemtype": "equation", "pos": 19747, "prevtext": "\nThe neoclassical thermal transport coefficients $D_1$ and $D_2$, can be calculated by convolution of solutions of the monoenergetic drift-kinetic equation calculated with DKES. More details on this calculation for the specific case of the TJ-II magnetic configuration are found in reference~\\cite{velasco2011bootstrap}.\n\nNote that the flux can be written as in equation~(\\ref{EQ_GAMMANC}), as a linear combination of the gradients of density, temperature and electrostatic potential, provided that the radial magnetic drift term of equation~(\\ref{EQ_DKE}) is small. This is generally true even in cases where $E_r$ is close to zero and the poloidal magnetic drift matters. Therefore we can still discuss neoclassical transport in terms of plasma gradients even if the approximations included in DKES do not hold. Obviously, if we were to calculate the coefficients $D_1$ and $D_2$ with FORTEC-3D, they would differ from those calculated with DKES.\n\nFor some cases included in this study, the particle source is estimated. There are three contributions: gas puffing, particle deposition due to NBI and recycling due to the wall. The second one is estimated using the code FAFNER~\\cite{teubel1994fafner}; the third one, using the neutral transport code EIRENE~\\cite{reiter2001eirene}. The inputs for EIRENE are the plasma profiles, the quantity of gas coming from puffing and NBI systems and a particle confinement time $\\tau$ that reflects the level of flux to the wall, i.e., $S=S(n,T_e,T_i,$ gas input$,\\tau)$. An additional equation for $\\tau$ is thus needed, which can be written as:\n\n", "index": 13, "text": "\\begin{equation}\n\\tau(n,S)=\\frac{\\int_Vn\\mathrm{d}V}{\\int_\\cal{S}\\Gamma\\mathrm{d}\\cal{S}}\\,,\\label{EQ_TAU}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\tau(n,S)=\\frac{\\int_{V}n\\mathrm{d}V}{\\int_{\\mathcal{S}}\\Gamma\\mathrm{d}%&#10;\\mathcal{S}}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>τ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>S</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>V</mi></msub><mrow><mi>n</mi><mo>⁢</mo><mrow><mo>d</mo><mi>V</mi></mrow></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi></msub><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><mrow><mo>d</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi></mrow></mrow></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}]