[{"file": "1601.01904.tex", "nexttext": "\nwhere $J$ is the total angular momentum of the star, ${\\ensuremath{\\dot{M}}}$ is the mass-loss rate, $\\Omega_\\star$ the average angular velocity, and $r_A$ the average Alfven radius. The most difficult term to constrain in this equation,  which is also the most important one, is the Alfven radius, which depends on several parameters such as the stellar radius, effective temperature, and magnetic field.\\\\\nIn the following, we present the different prescriptions we used to evaluate their impact on the evolution of the surface velocity and internal rotation profile of a single 1{\\ensuremath{M_\\odot}}~star. All the prescriptions detailed below are semi-empirical, based on theoretical and observational properties. Except for the expression from \\cite{RM12} (detailed in part \\ref{RM12}), they all lead to a rotational evolution that follows the empirical relationship\nof \\cite{Skumanich72},   $\\Omega_S \\propto t^{-1/2}$ , beyond the spin-down phase of the model stars (after at least 1 Gyr of evolution). We calibrated the constants of each braking law so that it leads to the solar rotation rate at the age of the Sun for a 1~{\\ensuremath{M_\\odot}}~model with our reference prescription. The constants are summarised in Table~\\ref{tab:brake}. Figure~\\ref{Fig:torqueomega} shows the torque evolution as a function of the surface angular velocity on the main sequence for each of the prescriptions.\n\n\n\\subsubsection{Kawaler (1988) - Chaboyer et al. (1995a)}\\label{K88}\n \\cite{Kawaler88} derived a braking law that takes into account the magnetic field strength and topology and the mass-loss rate. The expression can easily be incorporated in stellar evolutionary codes accounting for rotation \\citep[e.g.][]{Pinsonneaultetal1989}\n \n \n", "itemtype": "equation", "pos": 10800, "prevtext": "\n\n      \\title{Rotating models of young solar-type stars} \n \\subtitle{Exploring braking laws and angular momentum transport processes}\n\n   \\author{L. Amard\\inst{1,2}\n          \\and \n          A. Palacios\\inst{1}\n          \\and \n          C. Charbonnel\\inst{2,3}\n         \\and\n          F. Gallet\\inst{2}\n          \\and \n          J. Bouvier\\inst{4,5}\n          }\n\n   \\offprints{A. Palacios or L. Amard}\n\n   \\institute{LUPM, Universit\\'e de Montpellier, CNRS, Place\n               E. Bataillon - cc 072, F-34095 Montpellier Cedex 05, France\n                \\\\\n                \\email{louis.amard@umontpellier.fr}\n                \\and\n               Department of Astronomy, University of Geneva, Chemin des Maillettes 51, CH-1290 Versoix, Switzerland\n               \\and \n                IRAP, UMR 5277, CNRS and Universit\\'e de Toulouse, 14 Av. E. Belin, F-31400 Toulouse, France\n        \\and \n                Universit\\'e Grenoble Alpes, IPAG, F-38000 Grenoble, France\n                \\and \n                CNRS, IPAG, F-38000 Grenoble, France\\\\\n             }\n\n   \\date{Received; accepted}\n\n\n   \\abstract{Understanding the angular momentum evolution of stars is one of the greatest challenges of modern stellar physics.}\n   {We study the predicted rotational evolution of solar-type stars from the pre-main sequence to the solar age with 1D rotating evolutionary models including physical ingredients.}\n   {We computed rotating evolution models of solar-type stars including an external stellar wind torque and internal transport of angular momentum following the method of   \\textup{Maeder and Zahn} with the code STAREVOL. We explored different formalisms and prescriptions available from the literature. We tested the predictions of the models against recent rotational period data from extensive photometric surveys, lithium abundances of solar-mass stars in young clusters, and the helioseismic rotation profile of the Sun.}\n   {We find a best-matching combination of prescriptions for both internal transport and surface extraction of angular momentum. This combination provides a very good fit to the observed evolution of rotational periods for solar-type stars from early evolution to the age of the Sun. Additionally, we show that fast rotators experience a stronger coupling between their radiative region and the convective envelope. Regardless of the set of prescriptions, however, we cannot simultaneously reproduce\nsurface angular velocity and the internal profile of the Sun or the evolution of lithium abundance. }\n   {We confirm the idea that additional transport mechanisms must occur in solar-type stars until they reach the age of the Sun. Whether these processes are the same as those needed to explain recent asteroseismic data in more advanced evolutionary phases is still an open question.}\n\n\n   \\keywords{hydrodynamics - stars : magnetic field, wind -\n     stars: evolution, rotation, stars : solar-type}\n\n\\maketitle\n\n\n\n\\section{Introduction}\n\nStars are born out of collapsing molecular clouds, which determine their masses, initial chemical composition, and initial angular momentum (hereafter AM) content. It has become clear in the past few decades that rotation can strongly influence the stellar evolution \\citep{ES76,MaederMeynetARAA2000,Maederbook}, which\nmakes understanding the rotational evolution of stars one of the greatest challenges in stellar physics.\\\\\nParticular interest has been given to the rotational evolution of solar-mass stars. Photometric surveys of open clusters and stellar associations \\citep[see e.g.][for a recent review]{BouvierPPVI} provide a wealth of rotation periods from ages of 1 Myr to the age of the Sun. The patterns revealed by the rotational periods indicate that a large dispersion exists among stars in the mass range 0.9-1.1 M$_\\odot$ during the pre-main sequence (PMS) that narrows as they evolve, and converges towards a single peaked distribution by the time they reach an age of about 1 Gyr. The main trends of the rotational evolution of solar-type stars through the PMS, zero-age main sequence (ZAMS), and main sequence (MS) can be described by considering three types of initial rotation, as suggested by statistical analyses of the observed samples \\citep{IrwinBouvier2009,GB13}: fast, medium, and slow rotation. \\\\ Several models have been built to account for the observed evolution of surface velocity \\citep[e.g.][]{ES81,MB1991,KPBS97,MacGregor2000,Denissenkov2010,Spadaetal2011,Charbonnel2013,GB15,LS15}, which all include three fundamental processes: (1) a star-disc interaction phase, often modelled as a constant surface angular velocity phase,\n(2) a coupling mechanism between the radiative interior and the convective envelope that regulates the angular momentum exchange between these two reservoirs during the evolution, and (3) a braking torque expression that is due to the loss of angular momentum extracted by the stellar winds and leads to a decrease of the surface angular velocity mostly during the MS evolution. All these studies have highlighted that the torque and the internal coupling processes are important for reproducing the observations.\n\nIn the present paper, we extensively test the different prescriptions available to date for both stellar wind torque and the turbulence modelling within the self-consistent theoretical framework provided by \\citet{Zahn1992} and \\cite{MaederZahn1998} to treat the internal transport of angular momentum by meridional circulation and shear-induced turbulence in 1.5D \\citep[and reference therein]{DecressinMathis2009}. These later internal processes successfully account in a consistent way for the rotational behaviour and the evolution of the surface abundances of light elements for dwarf and subgiant stars with masses above $\\sim$ 1.4 M$_\\odot$ \\citep[the blue side of the so-called lithium dip;][]{CT99,PTCF2003}. However, their efficiency in transporting AM has been shown to be too low in solar-type stars to reproduce the present-day solar internal rotation as inferred from helioseismic data and the Li abundance in solar type stars \\citep{TalonCharbonnel1998}; for these objects, additional AM transport processes may be required to better fit the data, such as internal gravity waves or magnetic fields \\citep{CharbonnelTalon2005Science,Eggenberger2005}. Despite this assessment concerning lithium and helioseismology, AM extraction and rotation-induced mechanisms have become the basic processes upon which more elaborate models can be built \\citep{TalonCharbonnel2003,Lagarde2012,Charbonnel2013}. It is thus important to clarify their exact efficiency and also, if possible, the more appropriate combination of prescriptions that should be used to model solar-mass stars, in a similar way as \\citet{Meynet2013} did for the case of massive stars.\nUnlike massive stars, AM transport mechanism in solar-like stars are driven by the surface extraction of AM. New magnetic torque prescriptions have recently been developed and have to be accounted for to find a more appropriate combination of prescriptions.\n\nWe present the different formalisms that we test in Sect.~\\ref{sec:formalism} and recall the overall physics of the models in Sect.~\\ref{sec:models}. Next, we describe our reference model in Sect.~\\ref{sec:ref} and then explore the parameter space in Sect.~\\ref{sec:explore}. In Sect.~\\ref{sec:bizone} we compare our results to the recent bi-zone models by \\citet{GB13,GB15}.  Finally, we briefly compare our models to the additional constraints given by helioseismology and the surface abundances of lithium in Sect.~\\ref{sec:other}. A summary of our results and some perspectives are given in Sect.~\\ref{sec:end}.\n\n\n\\section{Formalism}\\label{sec:formalism}\n\n\\subsection{Disc coupling}\nA solar-mass star undergoes a global contraction during the first few million years of its evolution. During this period the star magnetically interacts with its circumstellar accretion disc, and this interaction modifies the stellar angular momentum. \n\nThe final stellar velocity results from the balance between the increase of AM from the accreted matter and the strong loss that can be due either to accretion-powered stellar winds \\citep{MattPudritz2005} or to the so-called disc-locking process\\citep{Koenigl1991,GL79}.\n\nWhile these mechanisms still lack an accepted physical description, it is observationally evident \\citep[e.g.][and references therein]{Rebull2004} that this interaction is very effective during the whole disc lifetime and compensates for the increase of angular velocity that is due to the stellar contraction. \nIn this configuration, the star will, on average, maintain a constant angular velocity as long as it is coupled with the disc. This is confirmed by the analysis of rotation periods in young open clusters and associations \\citep{GB13}.\n\nThe duration of this period of coupling varies with both the mass \\citep{KennedyKenyon2009} and the initial angular momentum of the star.\nTo evaluate the duration of this strong star-disc interaction phase, it is necessary to rely on observations since there is a degeneracy between the initial angular momentum content of the star and the disc-coupling time. A star with a large initial angular momentum content that will maintain a coupling with its circumstellar disc for a relatively long time is expected to undergo the same rotational evolution for the remaining evolution as a star with a smaller initial angular momentum content coupled to a shorter lived disc. \\citet{Edwardsetal1993} showed that the observed rotation periods of stars in very young clusters demand shorter disc lifetimes for fast rotators than for slow rotators. This has been confirmed with more observational evidence by \\citet{Rebull2004} and \\citet{Bouvier2008}.\n\n\nIn the present study, we assume a 2.5 Myr and 5 Myr star-disc interaction for fast and medium or slow rotators, respectively, based on observations \\citep[e.g.][]{Belletal2013}. Throughout this coupling, the surface rotation period is assumed to be constant.\n\n\n\\subsection{Stellar wind torque}\\label{sec:torques}\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure1.eps}\n\\caption{Stellar wind torque as a function of the surface angular velocity for the different prescriptions as labelled in the plot. The parameter values used in each case are given in Table.~\\ref{tab:brake}.}\n\\label{Fig:torqueomega}\n\\end{figure}\n For the past two decades, many different more or less complex\nprescriptions of stellar wind braking have been developed. \nSince \\cite{Schatzman1962} and \\citet{WD67}, all the processes playing a role in the coupling between wind-driven mass-loss and the magnetic field have been extensively studied and improved.\nIn a general manner, the net torque exerted on the star can be written as  \n\n", "index": 1, "text": "\\begin{equation}\n\\frac{{\\rm d}J}{{\\rm d}t} = {\\ensuremath{\\dot{M}}} \\Omega_\\star r_A^2\n,\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{{\\rm d}J}{{\\rm d}t}={\\dot{M}}\\Omega_{\\star}r_{A}^{2},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mo>⋆</mo></msub><mo>⁢</mo><msubsup><mi>r</mi><mi>A</mi><mn>2</mn></msubsup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\n\nHere, the angular momentum loss is directly related to the rotation rate $\\Omega$. It only depends on three parameters: the exponent $a$ that depicts the total magnetic field strength dependence on the rotation rate ($B_0 = K_B\\left(R/{\\ensuremath{R_\\odot}}\\right)^{-2}\\Omega^a$ , with $B_0$ the surface magnetic field strength and $K_B$ constant) fixed equal to $1$; the wind-index factor $n$ that varies with the magnetic field topology and is typically assumed to be equal to $3/2$ to reproduce the Skumanich relationship; and the parameter $K_W$. The latter consists, in the initial paper, of two components linked on one hand to the dependence of the magnetic field generation to the convection zone depth and on the other hand to the structure of the stellar wind. It is here assumed to be a single constant that is calibrated to reproduce the solar surface velocity at the age of the Sun.\nTaking $n = 3/2$ simplifies the problem by suppressing the dependence\non mass loss rate, leading to \n\n", "itemtype": "equation", "pos": 12642, "prevtext": "\nwhere $J$ is the total angular momentum of the star, ${\\ensuremath{\\dot{M}}}$ is the mass-loss rate, $\\Omega_\\star$ the average angular velocity, and $r_A$ the average Alfven radius. The most difficult term to constrain in this equation,  which is also the most important one, is the Alfven radius, which depends on several parameters such as the stellar radius, effective temperature, and magnetic field.\\\\\nIn the following, we present the different prescriptions we used to evaluate their impact on the evolution of the surface velocity and internal rotation profile of a single 1{\\ensuremath{M_\\odot}}~star. All the prescriptions detailed below are semi-empirical, based on theoretical and observational properties. Except for the expression from \\cite{RM12} (detailed in part \\ref{RM12}), they all lead to a rotational evolution that follows the empirical relationship\nof \\cite{Skumanich72},   $\\Omega_S \\propto t^{-1/2}$ , beyond the spin-down phase of the model stars (after at least 1 Gyr of evolution). We calibrated the constants of each braking law so that it leads to the solar rotation rate at the age of the Sun for a 1~{\\ensuremath{M_\\odot}}~model with our reference prescription. The constants are summarised in Table~\\ref{tab:brake}. Figure~\\ref{Fig:torqueomega} shows the torque evolution as a function of the surface angular velocity on the main sequence for each of the prescriptions.\n\n\n\\subsubsection{Kawaler (1988) - Chaboyer et al. (1995a)}\\label{K88}\n \\cite{Kawaler88} derived a braking law that takes into account the magnetic field strength and topology and the mass-loss rate. The expression can easily be incorporated in stellar evolutionary codes accounting for rotation \\citep[e.g.][]{Pinsonneaultetal1989}\n \n \n", "index": 3, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -K_W\\Omega^{1+(4an/3)}\\left(\\frac{R}{{\\ensuremath{R_\\odot}}}\\right)^{2-n}\\left(\\frac{{\\ensuremath{\\dot{M}}}}{-10^{-14}{\\ensuremath{M_\\odot}}/yr^{-1}}\\right)^{1-(2n/3)}\\left(\\frac{M}{{\\ensuremath{M_\\odot}}}\\right)^{-n/3}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-K_{W}\\Omega^{1+(4an/3)}\\left(\\frac{R}{{R_{\\odot}}}\\right)^{2-n}%&#10;\\left(\\frac{{\\dot{M}}}{-10^{-14}{M_{\\odot}}/yr^{-1}}\\right)^{1-(2n/3)}\\left(%&#10;\\frac{M}{{M_{\\odot}}}\\right)^{-n/3}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi>K</mi><mi>W</mi></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mrow><mn>1</mn><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>4</mn><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>n</mi></mrow><mo>/</mo><mn>3</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>2</mn><mo>-</mo><mi>n</mi></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mrow><mo>-</mo><mrow><mrow><mrow><msup><mn>10</mn><mrow><mo>-</mo><mn>14</mn></mrow></msup><mo>⁢</mo><msub><mi>M</mi><mo>⊙</mo></msub></mrow><mo>/</mo><mi>y</mi></mrow><mo>⁢</mo><msup><mi>r</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>n</mi></mrow><mo>/</mo><mn>3</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>M</mi><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mi>n</mi><mo>/</mo><mn>3</mn></mrow></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere $K_W = 2.10^{48}$ is calibrated in cgs units to reproduce the solar case, and $a = 0$ or $1$ for a saturated or unsaturated magnetic field, respectively.\n\nFollowing \\cite{StaufferHartmann87}, \\cite{Chaboyeretal1995a} assumed that the magnetic field reaches saturation above a certain value of the surface angular velocity. As a result, this saturation modifies the braking law and the dependence of the angular momentum loss on the rotation rate.\nIt is not yet clear whether this saturation is due to the saturation of the dynamo itself or to coronal processes \\citep{Wright2011}. However, the magnetic field strength seems to stop increasing even if the star still spins up \\citep{Vilhu84,Odelletal95} and $a = 0$ in the expression of $B_0$.\nEquation \\ref{Eq:K88a} then becomes \n\n", "itemtype": "equation", "pos": 13909, "prevtext": "\n\nHere, the angular momentum loss is directly related to the rotation rate $\\Omega$. It only depends on three parameters: the exponent $a$ that depicts the total magnetic field strength dependence on the rotation rate ($B_0 = K_B\\left(R/{\\ensuremath{R_\\odot}}\\right)^{-2}\\Omega^a$ , with $B_0$ the surface magnetic field strength and $K_B$ constant) fixed equal to $1$; the wind-index factor $n$ that varies with the magnetic field topology and is typically assumed to be equal to $3/2$ to reproduce the Skumanich relationship; and the parameter $K_W$. The latter consists, in the initial paper, of two components linked on one hand to the dependence of the magnetic field generation to the convection zone depth and on the other hand to the structure of the stellar wind. It is here assumed to be a single constant that is calibrated to reproduce the solar surface velocity at the age of the Sun.\nTaking $n = 3/2$ simplifies the problem by suppressing the dependence\non mass loss rate, leading to \n\n", "index": 5, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -K_W\\Omega^{(1+2a)}\\left(\\frac{R}{{\\ensuremath{R_\\odot}}}\\right)^{1/2}\\left(\\frac{M}{{\\ensuremath{M_\\odot}}}\\right)^{-1/2},\n\\label{Eq:K88a}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-K_{W}\\Omega^{(1+2a)}\\left(\\frac{R}{{R_{\\odot}}}\\right)^{1/2}%&#10;\\left(\\frac{M}{{M_{\\odot}}}\\right)^{-1/2},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi>K</mi><mi>W</mi></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>a</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>M</mi><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 14883, "prevtext": "\nwhere $K_W = 2.10^{48}$ is calibrated in cgs units to reproduce the solar case, and $a = 0$ or $1$ for a saturated or unsaturated magnetic field, respectively.\n\nFollowing \\cite{StaufferHartmann87}, \\cite{Chaboyeretal1995a} assumed that the magnetic field reaches saturation above a certain value of the surface angular velocity. As a result, this saturation modifies the braking law and the dependence of the angular momentum loss on the rotation rate.\nIt is not yet clear whether this saturation is due to the saturation of the dynamo itself or to coronal processes \\citep{Wright2011}. However, the magnetic field strength seems to stop increasing even if the star still spins up \\citep{Vilhu84,Odelletal95} and $a = 0$ in the expression of $B_0$.\nEquation \\ref{Eq:K88a} then becomes \n\n", "index": 7, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -K_W\\Omega\\Omega_{sat}^2\\left(\\frac{R}{{\\ensuremath{R_\\odot}}}\\right)^{1/2}\\left(\\frac{M}{{\\ensuremath{M_\\odot}}}\\right)^{-1/2} \\qquad {\\rm for} \\; \\Omega \\geq \\Omega_{sat}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-K_{W}\\Omega\\Omega_{sat}^{2}\\left(\\frac{R}{{R_{\\odot}}}\\right)^{%&#10;1/2}\\left(\\frac{M}{{M_{\\odot}}}\\right)^{-1/2}\\qquad{\\rm for}\\;\\Omega\\geq\\Omega%&#10;_{sat}\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi>K</mi><mi>W</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>M</mi><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+2.8pt\"><mi>for</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>≥</mo><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhich is the formulation that we use in our stellar evolution code.\n\n\\subsubsection{\\cite{Matt2012}}\\label{Matt12}\n\n\\cite{Matt2012} proposed a braking law based on current 2D magnetohydrodynamical (MHD) simulations for stellar winds. \nThey varied the magnetic field strength relative to the mass-loss rate and surface gravity to derive the most complete stellar wind torque formula available at the time for solar-type stars,\n\n\n", "itemtype": "equation", "pos": 15104, "prevtext": "\n\n", "index": 9, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -K_W\\Omega^{3}\\left(\\frac{R}{{\\ensuremath{R_\\odot}}}\\right)^{1/2}\\left(\\frac{M}{{\\ensuremath{M_\\odot}}}\\right)^{-1/2} \\qquad  {\\rm for} \\; \\Omega < \\Omega_{sat}\n,\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-K_{W}\\Omega^{3}\\left(\\frac{R}{{R_{\\odot}}}\\right)^{1/2}\\left(%&#10;\\frac{M}{{M_{\\odot}}}\\right)^{-1/2}\\qquad{\\rm for}\\;\\Omega&lt;\\Omega_{sat},\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi>K</mi><mi>W</mi></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>3</mn></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>M</mi><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+2.8pt\"><mi>for</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>&lt;</mo><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith $u$ being the ratio of the surface velocity to the brake-up velocity, and $K_1$, $K_2$ and $m$ tunable (to a certain point) parameters to fit the observations. The adopted values were taken from \\citet{GB13} and are given in Table~\\ref{tab:brake}. \n\n\n\\begin{table}\n\\caption{Parameters used for the prescriptions from \\cite{Kawaler88} and \\cite{Chaboyeretal1995a} ({\\sf K88}), \\cite{Matt2012} ({\\sf Matt12}), \\cite{Mattetal2015} ({\\sf Matt15}), and \\cite{RM12} ({\\sf RM12}).}\n\\begin{tabular}{ c | c | c | c }\n\\hline\n\\hline\n{\\sf K88}& {\\sf Matt12} & {\\sf Matt15} & {\\sf RM12}\\\\\n\\hline\n$K_W = 2.10^{48} $ & $K_1 =6.7$ & $K = 5.10^{31}$ & $\\mathcal{C} = 10^{39}$ \\\\ \n$n = 3/2$ &  $K_2 = 0.506$ & $m = 0.22$ & $\\Omega_{sat} = 3\\Omega_\\odot$ \\\\ \n$\\Omega_{sat} = 10 \\Omega_\\odot$ & $m = 0.17$ & $p = 1.7$ \\\\ \n& & $\\chi = 10$\\\\ \n\\hline\n\\end{tabular}\n\\label{tab:brake}\n\\end{table}\n\nWe directly included a modified version of the BOREAS subroutine \\citep{CS2011,GB13} in our evolution code STAREVOL (see the Appendix for details concerning the applied modifications to the original distributed version of BOREAS) to obtain the mean magnetic field $\\bar{B} = f_* B_*$ at each time step, $f_*$ being the filling factor expressing the magnetized fraction of the stellar surface \\citep{Saar1996}.\nWe had to recalibrate the expression of $f_*$  to reach the solar mass-loss value at the age of the Sun for solid-body rotating models,\n\n", "itemtype": "equation", "pos": 15741, "prevtext": "\nwhich is the formulation that we use in our stellar evolution code.\n\n\\subsubsection{\\cite{Matt2012}}\\label{Matt12}\n\n\\cite{Matt2012} proposed a braking law based on current 2D magnetohydrodynamical (MHD) simulations for stellar winds. \nThey varied the magnetic field strength relative to the mass-loss rate and surface gravity to derive the most complete stellar wind torque formula available at the time for solar-type stars,\n\n\n", "index": 11, "text": "\\begin{equation}\n\\frac{dJ}{dt} = - \\frac{K_1^2}{\\left(2G\\right)^m}\\bar{B}^{4m}{\\ensuremath{\\dot{M}}}^{1-2m}_W\\frac{R^{5m+2}}{M^m}\\frac{\\Omega}{\\left(K^2_2+0.5u^2\\right)^m},\n\\label{eq:Matt12}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-\\frac{K_{1}^{2}}{\\left(2G\\right)^{m}}\\bar{B}^{4m}{\\dot{M}}^{1-2%&#10;m}_{W}\\frac{R^{5m+2}}{M^{m}}\\frac{\\Omega}{\\left(K^{2}_{2}+0.5u^{2}\\right)^{m}},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><msubsup><mi>K</mi><mn>1</mn><mn>2</mn></msubsup><msup><mrow><mo>(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>G</mi></mrow><mo>)</mo></mrow><mi>m</mi></msup></mfrac><mo>⁢</mo><msup><mover accent=\"true\"><mi>B</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mn>4</mn><mo>⁢</mo><mi>m</mi></mrow></msup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mi>W</mi><mrow><mn>1</mn><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></mrow></msubsup><mo>⁢</mo><mfrac><msup><mi>R</mi><mrow><mrow><mn>5</mn><mo>⁢</mo><mi>m</mi></mrow><mo>+</mo><mn>2</mn></mrow></msup><msup><mi>M</mi><mi>m</mi></msup></mfrac><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">Ω</mi><msup><mrow><mo>(</mo><mrow><msubsup><mi>K</mi><mn>2</mn><mn>2</mn></msubsup><mo>+</mo><mrow><mn>0.5</mn><mo>⁢</mo><msup><mi>u</mi><mn>2</mn></msup></mrow></mrow><mo>)</mo></mrow><mi>m</mi></msup></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith $x$ being the normalised Rossby number\\footnote{$\\tau_{conv}$ and $\\tau_{conv_\\odot}$ are determined as a function of the effective temperature as in \\citet{CS2011}.} $x = \\frac{P_{rot}}{P_{rot_\\odot}}\\frac{\\tau_{conv_\\odot}}{\\tau_{conv}}$.\n\nWith this expression, the magnetic field reaches a saturation threshold for $\\Omega_{sat} \\approx 10 - 15 \\Omega_\\odot$.\\\\ \nWe also used the mass loss accounting for magnetohydrodynamic turbulence and Alfv\\'en waves that is an output of the BOREAS routine. We accounted for mass loss from the end of the disc-coupling phase during the pre-main sequence to the end of the main sequence considering that the mechanisms responsible for mass loss remain the same during these phases. \n\nAs shown by \\cite{GB13}, Eq.~\\ref{eq:Matt12} combined with the prescriptions of \\cite{CS2011} as computed with the modified BOREAS routine allows reproducing the observed rotation periods well in the validity domain of \\citet{CS2011}'s work, which is in particular the case of stars of about 1~{\\ensuremath{M_\\odot}}. \\cite{VSP2013} extended the application to more massive stars (1.1-1.5{\\ensuremath{M_\\odot}}) by combining this prescription with the mass-loss rate of \\citet{Woodetal2005}.\n\n\n\\subsubsection{\\cite{RM12}}\\label{RM12}\n\\citet{RM12} introduced a formalism in which the  magnetic field \\textit{strength} is accounted for as directly depending on the Rossby number in the unsaturated regime (while it is the magnetic \\textit{flux} that depends on the Rossby number in the approach of \\citet{Matt2012}), \n\n", "itemtype": "equation", "pos": 17371, "prevtext": "\nwith $u$ being the ratio of the surface velocity to the brake-up velocity, and $K_1$, $K_2$ and $m$ tunable (to a certain point) parameters to fit the observations. The adopted values were taken from \\citet{GB13} and are given in Table~\\ref{tab:brake}. \n\n\n\\begin{table}\n\\caption{Parameters used for the prescriptions from \\cite{Kawaler88} and \\cite{Chaboyeretal1995a} ({\\sf K88}), \\cite{Matt2012} ({\\sf Matt12}), \\cite{Mattetal2015} ({\\sf Matt15}), and \\cite{RM12} ({\\sf RM12}).}\n\\begin{tabular}{ c | c | c | c }\n\\hline\n\\hline\n{\\sf K88}& {\\sf Matt12} & {\\sf Matt15} & {\\sf RM12}\\\\\n\\hline\n$K_W = 2.10^{48} $ & $K_1 =6.7$ & $K = 5.10^{31}$ & $\\mathcal{C} = 10^{39}$ \\\\ \n$n = 3/2$ &  $K_2 = 0.506$ & $m = 0.22$ & $\\Omega_{sat} = 3\\Omega_\\odot$ \\\\ \n$\\Omega_{sat} = 10 \\Omega_\\odot$ & $m = 0.17$ & $p = 1.7$ \\\\ \n& & $\\chi = 10$\\\\ \n\\hline\n\\end{tabular}\n\\label{tab:brake}\n\\end{table}\n\nWe directly included a modified version of the BOREAS subroutine \\citep{CS2011,GB13} in our evolution code STAREVOL (see the Appendix for details concerning the applied modifications to the original distributed version of BOREAS) to obtain the mean magnetic field $\\bar{B} = f_* B_*$ at each time step, $f_*$ being the filling factor expressing the magnetized fraction of the stellar surface \\citep{Saar1996}.\nWe had to recalibrate the expression of $f_*$  to reach the solar mass-loss value at the age of the Sun for solid-body rotating models,\n\n", "index": 13, "text": "\\begin{equation}\nf_\\star = \\frac{0.4}{[1+\\left(x/0.16\\right)^{2.3}]^{1.22}},\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"f_{\\star}=\\frac{0.4}{[1+\\left(x/0.16\\right)^{2.3}]^{1.22}},\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mo>⋆</mo></msub><mo>=</mo><mfrac><mn>0.4</mn><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>(</mo><mrow><mi>x</mi><mo>/</mo><mn>0.16</mn></mrow><mo>)</mo></mrow><mn>2.3</mn></msup></mrow><mo stretchy=\"false\">]</mo></mrow><mn>1.22</mn></msup></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 19007, "prevtext": "\nwith $x$ being the normalised Rossby number\\footnote{$\\tau_{conv}$ and $\\tau_{conv_\\odot}$ are determined as a function of the effective temperature as in \\citet{CS2011}.} $x = \\frac{P_{rot}}{P_{rot_\\odot}}\\frac{\\tau_{conv_\\odot}}{\\tau_{conv}}$.\n\nWith this expression, the magnetic field reaches a saturation threshold for $\\Omega_{sat} \\approx 10 - 15 \\Omega_\\odot$.\\\\ \nWe also used the mass loss accounting for magnetohydrodynamic turbulence and Alfv\\'en waves that is an output of the BOREAS routine. We accounted for mass loss from the end of the disc-coupling phase during the pre-main sequence to the end of the main sequence considering that the mechanisms responsible for mass loss remain the same during these phases. \n\nAs shown by \\cite{GB13}, Eq.~\\ref{eq:Matt12} combined with the prescriptions of \\cite{CS2011} as computed with the modified BOREAS routine allows reproducing the observed rotation periods well in the validity domain of \\citet{CS2011}'s work, which is in particular the case of stars of about 1~{\\ensuremath{M_\\odot}}. \\cite{VSP2013} extended the application to more massive stars (1.1-1.5{\\ensuremath{M_\\odot}}) by combining this prescription with the mass-loss rate of \\citet{Woodetal2005}.\n\n\n\\subsubsection{\\cite{RM12}}\\label{RM12}\n\\citet{RM12} introduced a formalism in which the  magnetic field \\textit{strength} is accounted for as directly depending on the Rossby number in the unsaturated regime (while it is the magnetic \\textit{flux} that depends on the Rossby number in the approach of \\citet{Matt2012}), \n\n", "index": 15, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -\\mathcal{C} \\left(\\frac{R^{16}}{M^2}\\right)^{1/3} \\Omega \\qquad {\\rm for }\\; \\Omega \\geq \\Omega_{sat}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-\\mathcal{C}\\left(\\frac{R^{16}}{M^{2}}\\right)^{1/3}\\Omega\\qquad{%&#10;\\rm for}\\;\\Omega\\geq\\Omega_{sat},\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msup><mi>R</mi><mn>16</mn></msup><msup><mi>M</mi><mn>2</mn></msup></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+2.8pt\"><mi>for</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>≥</mo><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith\n\n", "itemtype": "equation", "pos": 19160, "prevtext": "\n\n", "index": 17, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -\\mathcal{C}  \\left(\\frac{R^{16}}{M^2}\\right)^{1/3} \\left(\\frac{\\Omega}{\\Omega_{sat}}\\right)^4 \\Omega \\qquad {\\rm for }\\; \\Omega < \\Omega_{sat},\n\\label{eq:RM12}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-\\mathcal{C}\\left(\\frac{R^{16}}{M^{2}}\\right)^{1/3}\\left(\\frac{%&#10;\\Omega}{\\Omega_{sat}}\\right)^{4}\\Omega\\qquad{\\rm for}\\;\\Omega&lt;\\Omega_{sat},\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msup><mi>R</mi><mn>16</mn></msup><msup><mi>M</mi><mn>2</mn></msup></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi mathvariant=\"normal\">Ω</mi><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mfrac><mo>)</mo></mrow><mn>4</mn></msup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+2.8pt\"><mi>for</mi></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>&lt;</mo><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>s</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nbeing a constant because each parameter on the right-hand side is assumed to adjust to keep the overall product constant throughout the evolution.\n\nThe main consequence of this change of paradigm is a torque that strongly depends on the stellar radius (${\\rm d}J/{\\rm d}t\\propto R^{16/3}$!) and hence on the stellar mass and evolutionary stage. As shown in Fig. \\ref{Fig:torqueomega}, the saturation value is reached at a very low rotation rate, which drastically changes the behaviour of surface rotation rate. The extraction of AM can be one order of magnitude higher for rotation rates between 1 and 10 times the solar value with this braking law.\n\nThis prescription shows some important weaknesses in reproducing the rotation rates of stars in open clusters as a function of mass, as shown by \\citet[][their Fig.4]{RM12}. At the age of the Hyades, they obtain in particular a decrease of $P_{rot}$ with decreasing mass for M $\\ge 0.3$ M$_\\odot$, which contradicts observations. Reiners and Mohanty\\textcolor[rgb]{1,0.501961,0}{} interpreted this discrepancy as the result of a possible core-envelope decoupling that would be proportional to the size of the radiative core (which increases with increasing mass at a given age). To test this hypothesis, we used this prescription for the stellar wind torque in our self-consistent differentially rotating 1~{\\ensuremath{M_\\odot}}~models.\n\n\n\\subsubsection{\\cite{Mattetal2015}}\nThe main improvement reached by \\citet{Mattetal2015} over  \\cite{Matt2012} is to highlight the Rossby number as a critical parameter, which was first reported by \\citet{Soderblom85} and \\citet{Vilhu86}. Compared to \\citet{Matt2012}, \\cite{Mattetal2015} expressed the torque as a simple function of mass, radius, angular velocity, and turnover timescale of the convective envelope\\footnote{Determined as a function of T$_{eff}$ as in \\citet{CS2011}.}.\nStarting from a general expression of the torque from \\cite{Matt2012}, \n\n", "itemtype": "equation", "pos": 19374, "prevtext": "\nwith\n\n", "index": 19, "text": "\\begin{equation}\n\\mathcal{C}=\\frac{2}{3}\\left(\\frac{B^8_{crit}}{G^2K_V^4{\\ensuremath{\\dot{M}}}}\\right)^{1/3} \\nonumber\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{C}=\\frac{2}{3}\\left(\\frac{B^{8}_{crit}}{G^{2}K_{V}^{4}{\\dot{M}}}%&#10;\\right)^{1/3}\" display=\"block\"><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒞</mi><mo>=</mo><mrow><mfrac><mn>2</mn><mn>3</mn></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msubsup><mi>B</mi><mrow><mi>c</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow><mn>8</mn></msubsup><mrow><msup><mi>G</mi><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>K</mi><mi>V</mi><mn>4</mn></msubsup><mo>⁢</mo><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover></mrow></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nthey expressed the more uncertain terms, namely ${\\ensuremath{\\dot{M}}}_\\star$ and $B_\\star$, as a function of the Rossby number. This results in some equations according to the regime of the magnetic field (saturated or not),\n\n", "itemtype": "equation", "pos": 21459, "prevtext": "\nbeing a constant because each parameter on the right-hand side is assumed to adjust to keep the overall product constant throughout the evolution.\n\nThe main consequence of this change of paradigm is a torque that strongly depends on the stellar radius (${\\rm d}J/{\\rm d}t\\propto R^{16/3}$!) and hence on the stellar mass and evolutionary stage. As shown in Fig. \\ref{Fig:torqueomega}, the saturation value is reached at a very low rotation rate, which drastically changes the behaviour of surface rotation rate. The extraction of AM can be one order of magnitude higher for rotation rates between 1 and 10 times the solar value with this braking law.\n\nThis prescription shows some important weaknesses in reproducing the rotation rates of stars in open clusters as a function of mass, as shown by \\citet[][their Fig.4]{RM12}. At the age of the Hyades, they obtain in particular a decrease of $P_{rot}$ with decreasing mass for M $\\ge 0.3$ M$_\\odot$, which contradicts observations. Reiners and Mohanty\\textcolor[rgb]{1,0.501961,0}{} interpreted this discrepancy as the result of a possible core-envelope decoupling that would be proportional to the size of the radiative core (which increases with increasing mass at a given age). To test this hypothesis, we used this prescription for the stellar wind torque in our self-consistent differentially rotating 1~{\\ensuremath{M_\\odot}}~models.\n\n\n\\subsubsection{\\cite{Mattetal2015}}\nThe main improvement reached by \\citet{Mattetal2015} over  \\cite{Matt2012} is to highlight the Rossby number as a critical parameter, which was first reported by \\citet{Soderblom85} and \\citet{Vilhu86}. Compared to \\citet{Matt2012}, \\cite{Mattetal2015} expressed the torque as a simple function of mass, radius, angular velocity, and turnover timescale of the convective envelope\\footnote{Determined as a function of T$_{eff}$ as in \\citet{CS2011}.}.\nStarting from a general expression of the torque from \\cite{Matt2012}, \n\n", "index": 21, "text": "\\begin{equation}\n\\frac{dJ}{dt} = \\left(\\frac{dJ}{dt}\\right)_\\odot \\left(\\frac{M_\\star}{M_\\odot}\\right)^{-m} \\left(\\frac{R_\\star}{R_\\odot}\\right)^{5m+2} \\left(\\frac{B_\\star}{B_\\odot}\\right)^{4m} \\left(\\frac{{\\ensuremath{\\dot{M}}}_\\star}{{\\ensuremath{\\dot{M}}}_\\odot}\\right)^{1-2m} \\left(\\frac{\\Omega_\\star}{\\Omega_\\odot}\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=\\left(\\frac{dJ}{dt}\\right)_{\\odot}\\left(\\frac{M_{\\star}}{M_{%&#10;\\odot}}\\right)^{-m}\\left(\\frac{R_{\\star}}{R_{\\odot}}\\right)^{5m+2}\\left(\\frac{%&#10;B_{\\star}}{B_{\\odot}}\\right)^{4m}\\left(\\frac{{\\dot{M}}_{\\star}}{{\\dot{M}}_{%&#10;\\odot}}\\right)^{1-2m}\\left(\\frac{\\Omega_{\\star}}{\\Omega_{\\odot}}\\right),\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><msub><mrow><mo>(</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>)</mo></mrow><mo>⊙</mo></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mo>⋆</mo></msub><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>m</mi></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>R</mi><mo>⋆</mo></msub><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mrow><mn>5</mn><mo>⁢</mo><mi>m</mi></mrow><mo>+</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>B</mi><mo>⋆</mo></msub><msub><mi>B</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>m</mi></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mo>⋆</mo></msub><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mo>⋆</mo></msub><msub><mi mathvariant=\"normal\">Ω</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 22029, "prevtext": "\nthey expressed the more uncertain terms, namely ${\\ensuremath{\\dot{M}}}_\\star$ and $B_\\star$, as a function of the Rossby number. This results in some equations according to the regime of the magnetic field (saturated or not),\n\n", "index": 23, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -\\mathcal{T}_0 \\left(\\frac{\\tau_{CZ}}{\\tau_{CZ\\odot}}\\right)^{p} \\left(\\frac{\\Omega_\\star}{\\Omega_\\odot}\\right)^{p+1}  \\rightarrow {\\rm unsaturated},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-\\mathcal{T}_{0}\\left(\\frac{\\tau_{CZ}}{\\tau_{CZ\\odot}}\\right)^{p%&#10;}\\left(\\frac{\\Omega_{\\star}}{\\Omega_{\\odot}}\\right)^{p+1}\\rightarrow{\\rm&#10;unsaturated},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mn>0</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>τ</mi><mrow><mi>C</mi><mo>⁢</mo><mi>Z</mi></mrow></msub><msub><mi>τ</mi><mrow><mrow><mi>C</mi><mo>⁢</mo><mi>Z</mi></mrow><mo>⁣</mo><mo>⊙</mo></mrow></msub></mfrac><mo>)</mo></mrow><mi>p</mi></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mo>⋆</mo></msub><msub><mi mathvariant=\"normal\">Ω</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mi>p</mi><mo>+</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>→</mo><mi>unsaturated</mi></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith \n\n", "itemtype": "equation", "pos": 22227, "prevtext": "\n\n", "index": 25, "text": "\\begin{equation}\n\\frac{dJ}{dt} = -\\mathcal{T}_0 \\chi^p \\left(\\frac{\\Omega_\\star}{\\Omega_\\odot}\\right)  \\rightarrow  {\\rm saturated},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\frac{dJ}{dt}=-\\mathcal{T}_{0}\\chi^{p}\\left(\\frac{\\Omega_{\\star}}{\\Omega_{%&#10;\\odot}}\\right)\\rightarrow{\\rm saturated},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>J</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mn>0</mn></msub><mo>⁢</mo><msup><mi>χ</mi><mi>p</mi></msup><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mo>⋆</mo></msub><msub><mi mathvariant=\"normal\">Ω</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow></mrow></mrow><mo>→</mo><mi>saturated</mi></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere $\\gamma = \\sqrt{1+(u/0.072)^2}$ comes from Eq. $(8)$ of \\cite{Matt2012}, and $u$ has the same meaning as above. $\\chi = \\frac{Ro_\\odot}{Ro_{\\rm sat}}$ is a constant. Considering that for $Ro \\leq Ro_{\\rm sat}$ the magnetic activity stops increasing and saturates at an approximately constant value. \nThe calibrated values of the parameters $K,p,m$ and $\\chi$ are given in Table~\\ref{tab:brake}.\n\n\\subsection{Transport of angular momentum in the stellar interior}\n\\subsubsection{Global equations}\n\nWe treated the angular momentum evolution from the first model on the PMS following the formalism developed by \\citet{Zahn1992} and \\citet{MaederZahn1998}. This formalism assumes a strong anisotropy in turbulence, the horizontal turbulence (i.e. along isobars) being much stronger than the vertical one (i.e. perpendicular to the isobars), thus enforcing a shellular rotation. The transport of AM in the stellar interior follows the advection/diffusion equation,\n\n", "itemtype": "equation", "pos": 22381, "prevtext": "\nwith \n\n", "index": 27, "text": "\\begin{equation}\n\\mathcal{T}_0 = K \\left(\\frac{R_\\star}{R_\\odot}\\right)^{3.1} \\left(\\frac{M_\\star}{M_\\odot}\\right)^{0.5}\\gamma^{2m}  ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{T}_{0}=K\\left(\\frac{R_{\\star}}{R_{\\odot}}\\right)^{3.1}\\left(\\frac{M_{%&#10;\\star}}{M_{\\odot}}\\right)^{0.5}\\gamma^{2m},\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mn>0</mn></msub><mo>=</mo><mrow><mi>K</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>R</mi><mo>⋆</mo></msub><msub><mi>R</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mn>3.1</mn></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mo>⋆</mo></msub><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mn>0.5</mn></msup><mo>⁢</mo><msup><mi>γ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere $\\rho$, $ r$, $\\nu_v$ and $U_r$ are the density, radius, vertical component of the turbulent viscosity, and the meridional circulation velocity on a given isobar, respectively. \n\nThis equation applies to radiative regions, while convective zones are assumed to rotate as solid bodies. The torque discussed in the previous section is applied at the upper convective boundary \\citep[see][]{PTCF2003},\n\n\\begin{displaymath}\n\\begin{array}{ll}\n{\\displaystyle \\frac{\\partial}{\\partial t}\n \\left[ \\Omega \\int _{r_t}^R  r^4 \\rho \\, {\\rm d} r  \\right] =\n-\\frac{1}{5} r^4 \\rho \\Omega U + {\\cal F}_\\Omega } & ~~~{\\rm for} ~ r=r_t \\vspace{0.2cm}\\\\\n\\end{array}\n\\end{displaymath}\nwhere ${\\cal F}_\\Omega$ is the torque, and $r_t$ is the radius at the lower edge of the convective envelope.\\\\\n\nBy integrating the angular momentum transport Eq. (\\ref{eq:general}) over the surface of radius $r_{cz}$, $r_{cz}$ being the radius of the inner convective zone boundary, we obtain a flux equation,\n\n", "itemtype": "equation", "pos": 23497, "prevtext": "\nwhere $\\gamma = \\sqrt{1+(u/0.072)^2}$ comes from Eq. $(8)$ of \\cite{Matt2012}, and $u$ has the same meaning as above. $\\chi = \\frac{Ro_\\odot}{Ro_{\\rm sat}}$ is a constant. Considering that for $Ro \\leq Ro_{\\rm sat}$ the magnetic activity stops increasing and saturates at an approximately constant value. \nThe calibrated values of the parameters $K,p,m$ and $\\chi$ are given in Table~\\ref{tab:brake}.\n\n\\subsection{Transport of angular momentum in the stellar interior}\n\\subsubsection{Global equations}\n\nWe treated the angular momentum evolution from the first model on the PMS following the formalism developed by \\citet{Zahn1992} and \\citet{MaederZahn1998}. This formalism assumes a strong anisotropy in turbulence, the horizontal turbulence (i.e. along isobars) being much stronger than the vertical one (i.e. perpendicular to the isobars), thus enforcing a shellular rotation. The transport of AM in the stellar interior follows the advection/diffusion equation,\n\n", "index": 29, "text": "\\begin{equation}\n\\rho \\frac{{\\rm d}}{{\\rm d}t}\\left(r^2\\Omega\\right)= \\frac{1}{5r^2}{\\frac{\\partial{}{}}{\\partial{}r}} \\left(\\rho r^4 \\Omega U_r\\right) + \\frac{1}{r} {\\frac{\\partial{}{}}{\\partial{}r}} \\left(r^4\\rho \\nu_v {\\frac{\\partial{}{\\Omega}}{\\partial{}r}}\\right),\n\\label{eq:general}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\rho\\frac{{\\rm d}}{{\\rm d}t}\\left(r^{2}\\Omega\\right)=\\frac{1}{5r^{2}}{\\frac{%&#10;\\partial{}{}}{\\partial{}r}}\\left(\\rho r^{4}\\Omega U_{r}\\right)+\\frac{1}{r}{%&#10;\\frac{\\partial{}{}}{\\partial{}r}}\\left(r^{4}\\rho\\nu_{v}{\\frac{\\partial{}{%&#10;\\Omega}}{\\partial{}r}}\\right),\" display=\"block\"><mrow><mrow><mrow><mi>ρ</mi><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">d</mi><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mrow><mn>5</mn><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>ρ</mi><mo>⁢</mo><msup><mi>r</mi><mn>4</mn></msup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><msub><mi>U</mi><mi>r</mi></msub></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mi>r</mi></mfrac><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>r</mi><mn>4</mn></msup><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><msub><mi>ν</mi><mi>v</mi></msub><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith\n\n", "itemtype": "equation", "pos": 24782, "prevtext": "\nwhere $\\rho$, $ r$, $\\nu_v$ and $U_r$ are the density, radius, vertical component of the turbulent viscosity, and the meridional circulation velocity on a given isobar, respectively. \n\nThis equation applies to radiative regions, while convective zones are assumed to rotate as solid bodies. The torque discussed in the previous section is applied at the upper convective boundary \\citep[see][]{PTCF2003},\n\n\\begin{displaymath}\n\\begin{array}{ll}\n{\\displaystyle \\frac{\\partial}{\\partial t}\n \\left[ \\Omega \\int _{r_t}^R  r^4 \\rho \\, {\\rm d} r  \\right] =\n-\\frac{1}{5} r^4 \\rho \\Omega U + {\\cal F}_\\Omega } & ~~~{\\rm for} ~ r=r_t \\vspace{0.2cm}\\\\\n\\end{array}\n\\end{displaymath}\nwhere ${\\cal F}_\\Omega$ is the torque, and $r_t$ is the radius at the lower edge of the convective envelope.\\\\\n\nBy integrating the angular momentum transport Eq. (\\ref{eq:general}) over the surface of radius $r_{cz}$, $r_{cz}$ being the radius of the inner convective zone boundary, we obtain a flux equation,\n\n", "index": 31, "text": "\\begin{equation}\nF_{\\rm tot} = F_{S}(r_{\\rm cz}) + F_{MC}(r_{\\rm cz})\n\\label{eq:fluxeq}\n,\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"F_{\\rm tot}=F_{S}(r_{\\rm cz})+F_{MC}(r_{\\rm cz}),\" display=\"block\"><mrow><mrow><msub><mi>F</mi><mi>tot</mi></msub><mo>=</mo><mrow><mrow><msub><mi>F</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>cz</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>F</mi><mrow><mi>M</mi><mo>⁢</mo><mi>C</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>cz</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nthe flux carried by shear-induced turbulence from the radiative zone to the convective envelope, and\n\n", "itemtype": "equation", "pos": 24891, "prevtext": "\nwith\n\n", "index": 33, "text": "\\begin{equation}\nF_{S}(r_{\\rm cz}) = \\frac{\\rm{d} J_{S}}{\\rm{d} t} \\bigg|_{r=r_{cz}} = -\\rho r^4 \\nu_v {\\frac{\\partial{}{\\Omega}}{\\partial{}r}}\\bigg|_{r=r_{cz}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"F_{S}(r_{\\rm cz})=\\frac{\\rm{d}J_{S}}{\\rm{d}t}\\bigg{|}_{r=r_{cz}}=-\\rho r^{4}%&#10;\\nu_{v}{\\frac{\\partial{}{\\Omega}}{\\partial{}r}}\\bigg{|}_{r=r_{cz}}\" display=\"block\"><mrow><mrow><msub><mi>F</mi><mi>S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>cz</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msub><mrow><mfrac><msub><mi>dJ</mi><mi mathvariant=\"normal\">S</mi></msub><mi>dt</mi></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>r</mi><mo>=</mo><msub><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow></msub><mo>=</mo><mrow><mo>-</mo><msub><mrow><mrow><mi>ρ</mi><mo>⁢</mo><msup><mi>r</mi><mn>4</mn></msup><mo>⁢</mo><msub><mi>ν</mi><mi>v</mi></msub><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac></mrow><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>r</mi><mo>=</mo><msub><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nthe flux carried by meridional circulation. A detailed derivation of the AM fluxes is given in\n \\cite{DecressinMathis2009} as part of a set of tools for assessing the relative importance of the processes involved in AM transport in stellar radiative interiors.\n\n\n\\begin{table}[h]\n\\caption{Different prescriptions used for the turbulent diffusion coefficients in our models.}\n\\begin{center}\n\\begin{tabular}{| c | c | c }\n\\hline\\hline\n\\rowcolor{Gray}Prescription & $D_h \\equiv \\nu_h$\\\\ \\hline\\hline\n& \\\\\n\\citet{MPZ2004}  & $r\\sqrt{\\left[Cr\\overline\\Omega \\vert 2 V_r-\\alpha U_r\\vert\\right]}$\\\\ \n({\\sf MPZ04})& with $ \\alpha={\\frac{1}{2}}\\,\\frac{{\\partial}\\ln(r^2\\overline\\Omega)}{{\\partial}\\ln r}$ \\\\\n& and $C = 1.6\\times10^{-6}$ \\\\ \n& \\\\\\hline\n& \\\\\n\\citet{Zahn1992}  & $\\frac{r}{C_{h}}\\vert2 V_r-\\alpha U_r\\vert$\\\\ \n({\\sf Zahn92})& with $C_h$ = 1\\\\\n& \\\\\\hline \\hline\n\\rowcolor{Gray}Prescription & $D_v \\equiv \\nu_v$\\\\  \\hline\\hline\n& \\\\\n\\citet{TZ97} & $\\frac{Ri_{\\rm c}}{N^2_{T} /(K_{T} + D_{h}) + N^{2}_{\\mu}/ D_{h}} \\left(r\\frac{\\partial \\overline\\Omega}{\\partial r}\\right)^2\\,$\\\\\n({\\sf TZ97})& with $Ri_c = 0.25$\\\\\n& \\\\ \\hline\n& \\\\\n\\citet{Maeder1997}  & $f_\\text{energ} \\frac{H_P}{g\\delta}\\frac{K}{\\left[\\frac{\\varphi}{\\delta}\\nabla_\\mu \n        + \\left( \\nabla_\\text{ad} - \\nabla_\\text{rad} \\right)\\right]} \n    \\left( \\frac{9\\pi}{32}\\ \\Omega\\ \\frac{\\text{d} \\ln \\Omega}{\\text{d} \\ln r} \\right)^2$\\\\\n({\\sf Maeder97})    & with $K = \\frac{4ac}{3\\kappa}\\frac{T^4\\nabla_\\text{ad}}{ \\rho P \\delta}$\\\\\n    & $f_\\text{energ} = 1$ and $\\varphi = \\left( \\frac{\\text{d}\\ln\\rho}{\\text{d}\\ln\\mu} \\right)_{P,T} = 1$\\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\label{tab:coeffdiff}\n\\end{table}\n\n\n\nEquation~\\ref{eq:general} is complemented by the evolution equation for the relative mean molecular weight variations over an isobar $\\Lambda = \\tilde{\\mu}/\\bar{\\mu}$ ,\n\n\n", "itemtype": "equation", "pos": 25168, "prevtext": "\nthe flux carried by shear-induced turbulence from the radiative zone to the convective envelope, and\n\n", "index": 35, "text": "\\begin{equation}\nF_{MC}(r_{\\rm cz}) = \\frac{\\rm{d} J_{MC}}{\\rm{d} t} \\bigg|_{r=r_{cz}}= -\\frac{1}{5} \\rho r_{cz}^4 \\Omega U_{r_{cz}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"F_{MC}(r_{\\rm cz})=\\frac{\\rm{d}J_{MC}}{\\rm{d}t}\\bigg{|}_{r=r_{cz}}=-\\frac{1}{5%&#10;}\\rho r_{cz}^{4}\\Omega U_{r_{cz}}\" display=\"block\"><mrow><mrow><msub><mi>F</mi><mrow><mi>M</mi><mo>⁢</mo><mi>C</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi>cz</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msub><mrow><mfrac><msub><mi>dJ</mi><mi>MC</mi></msub><mi>dt</mi></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mi>r</mi><mo>=</mo><msub><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow></msub><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>5</mn></mfrac><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><msubsup><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>z</mi></mrow><mn>4</mn></msubsup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><msub><mi>U</mi><msub><mi>r</mi><mrow><mi>c</mi><mo>⁢</mo><mi>z</mi></mrow></msub></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\n where $\\overline \\mu$ is the mean molecular weight over an isobar, $\\nu_h$ is the diffusion coefficient associated with the horizontal shear instability, and $N_{\\mu}$, the chemical part of the  Brunt-V\\\"ais\\\"al\\\"a\n  frequency is given by $N_{\\mu}^2=\\left({\\overline\n      g}\\varphi/H_{P}\\right)\\nabla_{\\mu}$ with $\\nabla_{\\mu}={\\partial \\ln \n    \\overline{\\mu}}/{\\partial \\ln P}$. \\\\\n\n\\subsubsection{Turbulence modelling}\n\nAs in \\citet[e.g.][]{Zahn1992}, the shear turbulence in the horizontal and vertical directions is represented as a diffusive process. We assumed that the diffusion coefficients are well represented by the viscosities, that is, $D_v \\approx \\nu_v$ and $D_h \\approx \\nu_h$.\\\\ Several prescriptions exist for these viscosities, and we explored the effect of four different prescriptions on the angular momentum evolution of a  1{\\ensuremath{M_\\odot}}~model. These prescriptions are summarised in Table~\\ref{tab:coeffdiff}, and we refer to the associated papers for more details on how they were derived.\\\\\nFor the vertical diffusion coefficient, the prescription of \\citet{TZ97} has been used for all the rotating models computed with the STAREVOL code so far \\citep{PTCF2003,PalaciosCharbonnel2006,DecressinMathis2009,Lagarde2012}, while the prescription of \\citet{Maeder1997} has been systematically used for the rotating models computed with the Geneva code \\citep{Eggenbergeretal12,Georgy2013}. \\citet{Meynet2013} have shown that the choice of the turbulent transport prescriptions may dramatically affect predictions for the structural, chemical, and rotational evolution of massive stars, but they were unable to clearly determine a best combination\nfor fitting the observational chemical constraints. In Sect.~\\ref{sec:explore} we discuss this in a similar way within the framework of the rotational evolution of solar-type stars.\n\n\\subsection{Transport of chemicals}\nThe transport of chemical species in radiative region is computed as a purely diffusive process \\citep{ChaboyerZahn92} but accounts for vertical advection and a strong horizontal diffusion. For a chemical species $i$, the concentration $c_i$ follows the equation \n\n", "itemtype": "equation", "pos": 27166, "prevtext": "\nthe flux carried by meridional circulation. A detailed derivation of the AM fluxes is given in\n \\cite{DecressinMathis2009} as part of a set of tools for assessing the relative importance of the processes involved in AM transport in stellar radiative interiors.\n\n\n\\begin{table}[h]\n\\caption{Different prescriptions used for the turbulent diffusion coefficients in our models.}\n\\begin{center}\n\\begin{tabular}{| c | c | c }\n\\hline\\hline\n\\rowcolor{Gray}Prescription & $D_h \\equiv \\nu_h$\\\\ \\hline\\hline\n& \\\\\n\\citet{MPZ2004}  & $r\\sqrt{\\left[Cr\\overline\\Omega \\vert 2 V_r-\\alpha U_r\\vert\\right]}$\\\\ \n({\\sf MPZ04})& with $ \\alpha={\\frac{1}{2}}\\,\\frac{{\\partial}\\ln(r^2\\overline\\Omega)}{{\\partial}\\ln r}$ \\\\\n& and $C = 1.6\\times10^{-6}$ \\\\ \n& \\\\\\hline\n& \\\\\n\\citet{Zahn1992}  & $\\frac{r}{C_{h}}\\vert2 V_r-\\alpha U_r\\vert$\\\\ \n({\\sf Zahn92})& with $C_h$ = 1\\\\\n& \\\\\\hline \\hline\n\\rowcolor{Gray}Prescription & $D_v \\equiv \\nu_v$\\\\  \\hline\\hline\n& \\\\\n\\citet{TZ97} & $\\frac{Ri_{\\rm c}}{N^2_{T} /(K_{T} + D_{h}) + N^{2}_{\\mu}/ D_{h}} \\left(r\\frac{\\partial \\overline\\Omega}{\\partial r}\\right)^2\\,$\\\\\n({\\sf TZ97})& with $Ri_c = 0.25$\\\\\n& \\\\ \\hline\n& \\\\\n\\citet{Maeder1997}  & $f_\\text{energ} \\frac{H_P}{g\\delta}\\frac{K}{\\left[\\frac{\\varphi}{\\delta}\\nabla_\\mu \n        + \\left( \\nabla_\\text{ad} - \\nabla_\\text{rad} \\right)\\right]} \n    \\left( \\frac{9\\pi}{32}\\ \\Omega\\ \\frac{\\text{d} \\ln \\Omega}{\\text{d} \\ln r} \\right)^2$\\\\\n({\\sf Maeder97})    & with $K = \\frac{4ac}{3\\kappa}\\frac{T^4\\nabla_\\text{ad}}{ \\rho P \\delta}$\\\\\n    & $f_\\text{energ} = 1$ and $\\varphi = \\left( \\frac{\\text{d}\\ln\\rho}{\\text{d}\\ln\\mu} \\right)_{P,T} = 1$\\\\\n\\hline\n\\end{tabular}\n\\end{center}\n\\label{tab:coeffdiff}\n\\end{table}\n\n\n\nEquation~\\ref{eq:general} is complemented by the evolution equation for the relative mean molecular weight variations over an isobar $\\Lambda = \\tilde{\\mu}/\\bar{\\mu}$ ,\n\n\n", "index": 37, "text": "\\begin{equation}\n\\frac{{\\rm d}\\Lambda}{{\\rm d}t} - \\frac{{\\rm d} \\ln {\\overline \\mu}}{{\\rm d}t} \\Lambda = \\frac{N_{\\mu}^{2}}{{\\overline g}\\varphi}U_r-\\frac{6}{r^2}\\nu_h\\Lambda\\, , \n\\label{Lambda}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\frac{{\\rm d}\\Lambda}{{\\rm d}t}-\\frac{{\\rm d}\\ln{\\overline{\\mu}}}{{\\rm d}t}%&#10;\\Lambda=\\frac{N_{\\mu}^{2}}{{\\overline{g}}\\varphi}U_{r}-\\frac{6}{r^{2}}\\nu_{h}%&#10;\\Lambda\\,,\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Λ</mi></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>-</mo><mrow><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mover accent=\"true\"><mi>μ</mi><mo>¯</mo></mover></mrow></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mi mathvariant=\"normal\">Λ</mi></mrow></mrow><mo>=</mo><mrow><mrow><mfrac><msubsup><mi>N</mi><mi>μ</mi><mn>2</mn></msubsup><mrow><mover accent=\"true\"><mi>g</mi><mo>¯</mo></mover><mo>⁢</mo><mi>φ</mi></mrow></mfrac><mo>⁢</mo><msub><mi>U</mi><mi>r</mi></msub></mrow><mo>-</mo><mrow><mfrac><mn>6</mn><msup><mi>r</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><msub><mi>ν</mi><mi>h</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">Λ</mi></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith $D_{tot} = D_{eff}+D_v$ the total diffusion coefficient, $D_{eff}$ given by \n\n", "itemtype": "equation", "pos": 29538, "prevtext": "\n where $\\overline \\mu$ is the mean molecular weight over an isobar, $\\nu_h$ is the diffusion coefficient associated with the horizontal shear instability, and $N_{\\mu}$, the chemical part of the  Brunt-V\\\"ais\\\"al\\\"a\n  frequency is given by $N_{\\mu}^2=\\left({\\overline\n      g}\\varphi/H_{P}\\right)\\nabla_{\\mu}$ with $\\nabla_{\\mu}={\\partial \\ln \n    \\overline{\\mu}}/{\\partial \\ln P}$. \\\\\n\n\\subsubsection{Turbulence modelling}\n\nAs in \\citet[e.g.][]{Zahn1992}, the shear turbulence in the horizontal and vertical directions is represented as a diffusive process. We assumed that the diffusion coefficients are well represented by the viscosities, that is, $D_v \\approx \\nu_v$ and $D_h \\approx \\nu_h$.\\\\ Several prescriptions exist for these viscosities, and we explored the effect of four different prescriptions on the angular momentum evolution of a  1{\\ensuremath{M_\\odot}}~model. These prescriptions are summarised in Table~\\ref{tab:coeffdiff}, and we refer to the associated papers for more details on how they were derived.\\\\\nFor the vertical diffusion coefficient, the prescription of \\citet{TZ97} has been used for all the rotating models computed with the STAREVOL code so far \\citep{PTCF2003,PalaciosCharbonnel2006,DecressinMathis2009,Lagarde2012}, while the prescription of \\citet{Maeder1997} has been systematically used for the rotating models computed with the Geneva code \\citep{Eggenbergeretal12,Georgy2013}. \\citet{Meynet2013} have shown that the choice of the turbulent transport prescriptions may dramatically affect predictions for the structural, chemical, and rotational evolution of massive stars, but they were unable to clearly determine a best combination\nfor fitting the observational chemical constraints. In Sect.~\\ref{sec:explore} we discuss this in a similar way within the framework of the rotational evolution of solar-type stars.\n\n\\subsection{Transport of chemicals}\nThe transport of chemical species in radiative region is computed as a purely diffusive process \\citep{ChaboyerZahn92} but accounts for vertical advection and a strong horizontal diffusion. For a chemical species $i$, the concentration $c_i$ follows the equation \n\n", "index": 39, "text": "\\begin{equation}\n\\frac{{\\rm d} c_i}{{\\rm d}t} = \\dot{c}_i + \\frac{1}{\\rho r^2}{\\frac{\\partial{}{}}{\\partial{}r}}\\left(\\rho r^2 D_{tot} {\\frac{\\partial{}{c_i}}{\\partial{}r}}\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\frac{{\\rm d}c_{i}}{{\\rm d}t}=\\dot{c}_{i}+\\frac{1}{\\rho r^{2}}{\\frac{\\partial{%&#10;}{}}{\\partial{}r}}\\left(\\rho r^{2}D_{tot}{\\frac{\\partial{}{c_{i}}}{\\partial{}r%&#10;}}\\right),\" display=\"block\"><mrow><mrow><mfrac><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msub><mi>c</mi><mi>i</mi></msub></mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><msub><mover accent=\"true\"><mi>c</mi><mo>˙</mo></mover><mi>i</mi></msub><mo>+</mo><mrow><mfrac><mn>1</mn><mrow><mi>ρ</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>ρ</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>D</mi><mrow><mi>t</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>c</mi><mi>i</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere $D_v$ and $D_h$ were defined previously (see Table \\ref{tab:coeffdiff}). Finally, the term $\\dot{c}_i$ refers to the temporal evolution of the concentration of chemical species $i$ due to nuclear burning. \n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure2.eps}\n\\caption{Evolution of the angular velocity as a function of time for the reference models. Plotted on the left as the rotational periods in days and during the right as the angular velocity in solar units with $\\Omega_\\odot = 2.86.10^{-6}$s$^{-1}$. Each cross represents a measurement for a star belonging to an open cluster whose age has been taken from the literature. All observational data are taken from \\citet[][and references therein]{GB15}  except the \"OD\" black frame between 8 and 10 Gyr, which corresponds to photometric data for stars observed with the {\\sf KEPLER} satellite that belong to the disc of the Milky Way \\citep{McQuillan2013}.\nSolid lines show the evolution of surface rotation for the slow (magenta), medium (green), and fast (blue) rotating models, while short dashed lines represent the associated averaged angular velocity of the radiative interior.}\n\\label{Fig:refprot}\n\\end{figure}\n\n\\section{Physics of the models}\\label{sec:models}\n\nFor all the models reported in Table~\\ref{tab:mods}, the basic input physics (equation of state, nuclear reaction, opacities) can be found in \\cite{Lagarde2012}. The initial abundances and mixing length parameter are calibrated without microscopic diffusion to reproduce a non-rotating Sun with respect to the \\cite{AsplundGrevesse2009} solar mixture with a $10^{-5}$ precision for luminosity and radius at the age of the Sun. We used a mixing length parameter $\\alpha_c = 1.7020$, an initial helium abundance $ Y = 0.2689 $, and an initial metal abundance $ Z = 0.0134 $. These values differ slightly from \\citet{Lagarde2012} because we included a non-grey atmosphere treatment based on \\cite{KrishnaSwamy}, which better agrees with observations for Sun-like stars \\citep[e.g.][]{Vandenberg2007}.\n\nIn addition to the treatment of transport and loss of angular momentum and mass as described in Sect.~2, we included the modification of the effective gravity by the centrifugal forces and its effect on the stellar structure equations following \\citet{ES76}. This effect is slightly visible on the evolutionary track in the Hertzsprung-Russell diagram when the stars rotate fast. \nRotation can have a non-negligible impact on the effective temperature for the fastest rotators around the ZAMS. \n\n\\begin{figure*}\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure3.eps}\n\\caption{Angular velocity profile of the reference models at different epochs (solid: 10 Myr; dotted: 45 Myr; dashed: 100 Myr; dot-dashed: 250 Myr; long-dashed: 1 Gyr; long-dash-dotted: 4.57 Gyr)  as a function of the relative mass fraction. The left, central, and right plots correspond to cases with slow, medium, and fast rotation (models $1s$, $1m$, and $1f$).}\n\\label{Fig:refprofomega}\n\\end{figure*}\n\n\\section{Reference model}\\label{sec:ref}\n\nThe statistical analysis of the distributions of rotation periods in open clusters and associations from 1 Myr to 2.5 Gyr performed by \\citet{GB13,GB15} focuses on three types of rotators: the slow, medium, and fast rotators, associated to the 25th, 50th,\nand 90th percentiles of the statistical sample in each of the clusters. We focused on the same types of rotators and defined our reference models as those that reproduce their evolutionary paths, as shown in Fig.~\\ref{Fig:refprot}.\nThey are labelled $1s$, $1m,$ and $1f$ in Table~\\ref{tab:mods}. They are characterised by the following set of prescriptions: {\\sf Matt+15} for the stellar wind torque, {\\sf TZ97} for $\\nu_v$ , and {\\sf MPZ04} for $\\nu_h$. We preferred the {\\sf Matt+15} prescription for the torque over the formulation of {\\sf Matt+12} , even though the latter directly takes into account magnetic field and mass-loss rate, precisely for sake of the consistency. Those are multi-dimensional processes that are still implemented in 1D models with many uncertainties. We show in Sect. \\ref{sec:models} that both fit the observed rotation periods, but we prefer a simpler approach that includes fewer uncertain processes to ensure that we will not miss any effects.\n\\begin{table}[h]\n\\caption{Parameters and assumptions of the different models computed in this study: MPZ04 refers to \\cite{MPZ2004}, TZ97 to \\cite{TZ97},  Matt+15 to \\cite{Mattetal2015}, Matt+12 to \\cite{Matt2012}, R\\&M 12 to \\cite{RM12}, and GB13 to \\cite{GB13}. SB is for solid-body rotation.}\n\\begin{center}\n\\begin{tabular}{ c | c | c | c c }\n\\hline\n\\hline\nInitial P$_{rot}$, & $\\nu_h$ & $\\nu_v$&  Braking law & Ref. \\\\\nDL time & prescrip. & prescrip. &  & \\\\\n\\hline\n\\hline\n7 days & MPZ04 & TZ97 & Matt+15 & 1s \\\\ \n5 Myr & MPZ04 & Maeder97 &  Matt+15 & 2s \\\\\n& Zahn92 & TZ97 &  Matt+15 & 3s \\\\\n& Zahn92 & Maeder97 &  Matt+15 & 4s \\\\\n& MPZ04 & TZ97 &  R\\&M 12 & 5s \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6s \\\\\n& MPZ04 & TZ97 &  K88 & 7s \\\\\n& SB & SB &  Matt+15 & 8s \\\\\n& MPZ04 & TZ97 &  GB13 & 9s \\\\\n\\hline\n3.7 days & MPZ04 & TZ97 & Matt+15 & 1m \\\\ \n5 Myr &   MPZ04 & TZ97 &  R\\&M 12 & 5m \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6m \\\\\n& MPZ04 & TZ97 &  K88 & 7m \\\\\n& SB & SB &  Matt+15 & 8m \\\\\n& MPZ04 & TZ97 &  GB13 & 9m \\\\\n\\hline\n1.4 days & MPZ04 & TZ97 & Matt+15 & 1f \\\\ \n3 Myr &  MPZ04 & Maeder97 &  Matt+15 & 2f \\\\\n& Zahn92 & TZ97 &  Matt+15 & 3f \\\\\n& Zahn92 & Maeder97 &  Matt+15 & 4f \\\\\n& MPZ04 & TZ97 &  R\\&M 12 & 5f \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6f \\\\\n& MPZ04 & TZ97 &  K88 & 7f \\\\\n& SB & SB &  Matt+15 & 8f \\\\\n& MPZ04 & TZ97 &  GB13 & 9f \\\\\n\\hline\n\\end{tabular}\n\\label{tab:mods}\n\\end{center}\n\\end{table}\n\n\\subsection{Evolution of surface angular velocities}\n\nFigure~\\ref{Fig:refprot} shows the surface angular velocity evolution (in terms of rotation period) as a function of time for the three reference models ($1s$, $1f,$ and $1m$) as solid lines. \nDepending on their initial velocity, these models present very different behaviours, but they are qualitatively similar to those obtained by \\citet{KPBS97}. The slow and medium rotators (models $1s$ and $1m$) experience a stronger stellar wind braking related to their initial angular momentum during the early evolution than do the fast rotator (model $1f$) towards the age of the present Sun. We also observe a convergence of the averaged rotation rate of the radiative interiors (dashed lines); this result is similar to previous work done with a slightly different treatment of AM transport \\citep[e.g.][]{P90}. Consequently, all the models reach the age of the Sun with the same total amount of angular momentum independently of their initial content. We detail the evolution of the radiative region angular velocity profile to understand which processes are involved.\n\n\n\\begin{figure}[t]\n\\includegraphics[angle=270,width=0.47\\textwidth]{FIGURES/Figure4.eps}\n\\includegraphics[angle=270,width=0.47\\textwidth]{FIGURES/Figure4b.eps}\n\\caption{Angular momentum fluxes carried by meridional circulation (dashed red), shear (dotted blue), and the total flux (solid black) in the fast and slowly rotating models (top and bottom, respectively). Hatched areas in all plots indicate the convective regions.}\n\\label{Fig:reffluxAM}\n\\end{figure}\n\n\n\\subsection{Rotation profile and differential rotation}\nFigure \\ref{Fig:refprofomega} shows the evolution of the internal angular velocity profiles as a function of the mass coordinate for our reference models $1s$ ({\\em left}), $1m$ ({\\em central}), and $1f$ ({\\em right}). We observe that for the special combination of braking and transport prescriptions adopted, all the models end with the same rotation profile (long-dash-dotted cyan profile), regardless of their initial angular momentum content. In all three cases, the differential rotation first increases (the core spins up) during the PMS evolution up to 45 Myr due to the contraction of the stars as they evolve along the Henyey track. Beyond 45 Myr, the core spins down in all models as a result of the meridional circulation that extracts AM from the core to compensate for the loss generated at the surface by the torque (see right panels of Fig.~\\ref{Fig:reffluxAM} and below). The main difference between the three cases is the efficiency of the meridional circulation, which adjusts to the intensity of the torque: the larger the torque (for the fast rotators), the larger the angular velocity gradient and the more efficient the meridional circulation.\nMoreover, since the efficiency of these angular momentum transport processes is proportional to the surface angular velocity, we observe a weak coupling between the radiative core and the envelope in models $1s$ and $1m$ at the same epochs (radiative interior rotating on average much faster than the convective envelope; see solid and dashed lines). Thus, the surface velocity evolution is already shaped by the torque before the stars reach the ZAMS (at $\\approx$ 60 Myr), leading to their early spin down.\\\\\nIn contrast, the fast rotating model strongly couples the radiative and convective zone as long as the star contracts (spins up), and the internal angular momentum is carried outward. During these early phases, model $1f$ is in the saturated dynamo regime. At its arrival on the ZAMS, the star stops spinning up and the surface is strongly braked on a relatively short timescale. The surface velocity is divided by a factor of 10 in 200 Myr, until the star spins down enough to enter the unsaturated-dynamo regime and further decreases by another factor of 10 for the following 4.3 Gyr.\n\nFor clusters older than the Hyades (beyond $\\approx$ 700 Myr), the observed distributions of rotation periods strongly narrow. \n\nBy the time the models reach 1 Gyr, the torque has become much less efficient and the angular velocity profile of the fast rotator is similar to that of the median and slow rotators. The three models later follow the same evolution, which is dictated by the meridional circulation and shear turbulence until the age of the Sun. The surface angular velocity and the total angular momentum content of the slow, medium, and fast rotators are similar beyond 1 Gyr. The angular velocity profiles also share a similar shape and evolution in all three cases.\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure5.eps}\n\\caption{Same as Fig.~\\ref{Fig:refprot} for fast and slow rotator models computed with four different transport prescriptions. Among the slow rotators models $1s$, $2s$, $3s$, and $4s$ correspond to the tracks from top to bottom for an age of 500 Myr. The fast rotating models $1f$, $2f$, $3f$, and $4f$ follow he same order for an age of 60 Myr. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:protmixing}\n\\end{figure}\n\n\\subsection{Transport of AM}\nHere we examine the processes that drive the internal transport of AM in our reference models. To do so, we followed the diagnostic procedure proposed by \\citet{DecressinMathis2009}, which relies on the analysis of the AM fluxes associated with each transport process that is accounted for. The transport of angular momentum is mainly driven by the meridional circulation as long as the star is rotating relatively fast (above the saturation value), as shown in the left panels of Fig. \\ref{Fig:reffluxAM}, and this independently of the initial velocity. After the ZAMS ($\\approx$ 60 Myr), in all cases meridional circulation weakens because the star does not contract any longer and the surface velocity has already decreased. Angular velocity gradient increases at the base of the convective envelope, leading to a predominance of the shear turbulence over the meridional circulation in this region. For the slower rotators, the shear turbulence takes over the transport of AM in the outer radiative zone below the envelope and efficiently extracts (acting along the angular velocity gradient) the angular momentum, \nensuring a continuous decrease of the surface angular velocity from the ZAMS until the age of the Hyades ($\\approx$ 700 Myr) (see lower panel in Fig.~\\ref{Fig:reffluxAM}). On the other hand, in the fast rotator, the meridional circulation is very efficient as long as the star  contracts (2 orders of magnitude larger than in the slow rotator) and efficiently couples the interior to the convective envelope up to the ZAMS. Beyond this age, its efficiency decreases rapidly, and the shear generated by the torque dominates below the convective envelope, although it is not sufficient to maintain an efficient transfer of AM from the core to the envelope.\\\\\nThe overall transport of AM by these processes tends to become less efficient as the star evolves on the main sequence as a\nresult of the decrease of the angular velocity gradient and of the torque.\n\nAround the age of the Sun, some very tight reversals of the circulation that are due to the turbulence at very slow rotation rate appear close to the convective envelope bottom. The earlier evolution is dominated by an outward loop carrying angular momentum from the core to the surface to compensate for the loss that\nis due to stellar wind.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure6.eps}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure6b.eps}\n\\caption{Effect of modelling the vertical turbulent shear diffusion coefficient $D_v$ on the angular velocity profiles. Same as Fig.~\\ref{Fig:refprofomega} for models $2s$ (dashed lines) and $1s$ (solid lines) in the top, and for models $2f$ (dashed lines) and $1f$ (solid lines) in the bottom panels. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:profomegaMaeder}\n\\end{figure}\n\n\\section{Exploring the physical parameter space}\\label{sec:explore}\n\nThe description of our reference models points out the different roles played by the meridional circulation, the shear turbulence, and the torque in shaping the internal angular velocity profiles throughout the evolution. As indicated in Table~\\ref{tab:mods} and Sect.~\\ref{sec:torques}, several prescriptions exist to account for the transport of AM in the radiative interiors and to describe the stellar wind torque exerted at the surface. In this section, we analyse the effect of the prescription choice on the angular velocity and momentum evolution in solar-mass models. To do so, we use the set of diagnostic tools developed by \\cite{DecressinMathis2009}.\\\\\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure7.eps}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure7b.eps}\n\\caption{Effect of the modelling of the horizontal turbulent shear diffusion coefficient $D_h$ on the angular velocity profiles. Same as Fig.~\\ref{Fig:refprofomega} for models $3s$ (dashed lines) and $1s$ (solid lines) in the top, and for models $3f$ (dashed lines) and $1f$ (solid lines) in the bottom panels. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:profomegaZahn}\n\\end{figure}\n\n\\subsection{Transport of angular momentum in the stellar interior}\n\nWithin the paradigm described by \\cite{Zahn1992} for the transport of angular momentum in radiative regions, several prescriptions have been developed to describe the shear turbulent viscosity in both the horizontal and vertical directions. While different groups prefer different combinations according to the type of stars studied, it was not until the study by \\citet{Meynet2013} that the actual impact of choosing a specific combination of prescriptions on the evolution (structural, chemical, and rotational) was explored. These authors modelled massive stars ($9-40$M$_\\odot$) and showed large differences in the HR diagram, the evolution\nof surface chemical abundances, and the rotational evolution. However, the available observational data did not allow them to favour one of the combinations.\n\nHere we analyse the effect of two different prescriptions for both $\\nu_h$ and for $\\nu_v$ on the rotational evolution of a 1 ~{\\ensuremath{M_\\odot}}~ model. The overall effect on the surface and internal averaged angular velocity is shown in Fig.~\\ref{Fig:protmixing}.\\\\\n\n\\subsection{Effect of the prescription for vertical shear}\nWe first compare models with the {\\sf MPZ04} prescription for $D_h$ but with different prescriptions for the vertical shear ({\\sf TZ97} or {\\sf Maeder97}). The use of the {\\sf Maeder97} prescription (given in Table~\\ref{tab:coeffdiff}) for $\\nu_v$ hinders the development of the vertical turbulent shear instability in a larger portion of the radiative interior, and the shear only contributes very little to the transport of AM throughout the evolution. For the slow rotator (model $2s$ in Fig.~\\ref{Fig:protmixing} and top panel in Fig.~\\ref{Fig:profomegaMaeder}), this leads to a sharp decrease of the surface angular velocity from the ZAMS after the contraction of the star has stopped and the meridional circulation is weaker. Between 100 Myr and  1 Gyr, the efficiency of the meridional circulation to transport AM remains almost constant in the inner radiative zone and ensures the transport of AM from the core to the envelope to compensate for the extraction of AM at the surface by the stellar wind torque. Therefore this leads to an almost constant surface angular velocity over this period of time.\n\nFor the fast rotators (model $2f$ in Fig.~\\ref{Fig:protmixing} and lower panel in Fig.~\\ref{Fig:profomegaMaeder}), on the other hand, the prescription of $\\nu_v$ has a very weak influence on the surface velocity because the transport is always dominated by the meridional circulation, which is of similar amplitude as in the reference model. The weak effect of the vertical shear diffusion prescription on the AM evolution also appears when looking at the evolution of the total specific angular momentum as a function of time shown in Fig.~\\ref{Fig:momspec} (dotted line, left panel).\\\\\n\n\\subsection{Effect of the prescription for horizontal turbulence}\nThe effect of the choice of the prescription for the horizontal shear turbulence is much more obvious: in Fig.~\\ref{Fig:protmixing} the two models with $\\nu_h$ from {\\sf Zahn92} (models $3s, 3f, 4s,$ and $4f$\n) present a very high ratio $\\Omega_{interior}/\\Omega_{surface}$ compared to the models $1s$ (resp. $1f$) and $2s$ (resp. $2f$) computed with $\\nu_h$ from {\\sf MPZ04} (see Table~\\ref{tab:mods}). \n\nUsing the expression of {\\sf Zahn92}  for $\\nu_h$ leads to a meridional circulation that is overall slower than for $\\nu_h$ of {\\sf MPZ04}. \n\n The turbulence can develop and disturb the meridional circulation in the radiative interior if the Richardson criterion is fulfilled. In our reference model, the circulation is strong enough to keep its original shape even in presence of shear turbulence, but this is not always the case. Thus, in models $3s$($f$) and $4s$($f$), using $\\nu_{h,Zahn92}$, the angular velocity profiles are much steeper, as shown in Fig.~\\ref{Fig:profomegaZahn}, and trigger a much stronger mean shear-induced turbulence. The loop that was carrying AM outward then breaks into several reverse cells as soon as the Richardson criterion is fulfilled (shown in Fig.~\\ref{Fig:2dcirc_Dh}) and annihilates AM transport locally. Consequently, a break appears in the angular velocity profile that can be seen in Fig.~\\ref{Fig:profomegaZahn} around 0.3 M$_r$ (resp. 0.2 M$_r$) at 1 Gyr and around 0.5 M$_r$ (resp. 0.4 M$_r$) at the solar age for the slow (resp. fast) rotator.\n\nIn addition, the surface velocity at the ZAMS and during the early evolution on the main sequence is lower than in the reference models, leading to a less efficient torque (which is directly proportional to the surface angular velocity) and to a global larger amount of specific angular momentum when the star reaches the age of the Sun (see Fig.~\\ref{Fig:momspec}).\n\n\\begin{figure}\n\\includegraphics[width=0.48\\textwidth]{FIGURES/Figure8.eps}\n\\caption{ Same legend as Fig.~\\ref{Fig:reffluxAM} for two slow rotators at 1 Gyr computed with $\\nu_h$ from {\\sf MPZ04} (left) and {\\sf Zahn92} (right).}\n\\label{Fig:2dcirc_Dh}\n\\end{figure}\n\n\\subsection{Stellar wind torque}\n\nWe now explore the effect of the stellar wind torque prescriptions on the overall angular momentum and angular velocity evolution of solar-mass stars.\\\\ First, we calibrated each of the prescriptions detailed in Sect.~\\ref{sec:torques} to reproduce the surface angular velocity of the present Sun at 4.57 Gyr. To do so, we calibrated one parameter, $\\mathcal{C}, K_1$ and $K_W$ for breaking laws of {\\sf R\\&M12, Matt+12,} and {\\sf K88}, respectively. Second, we adjusted a second parameter\\footnote{$\\Omega_{\\rm sat}$, $m$ and $\\Omega_{\\rm sat}$ for ${\\rm R\\&M12}$, ${\\rm Matt+12,}$ and ${\\rm K88, respectively.}$} to adjust the data in younger clusters, if possible. The obtained values are given in Table~\\ref{tab:brake}, and for every model with a given braking law, the same set of parameters was used, regardless of the initial angular momentum content. \\\\\n\n\n\n\\begin{figure*}[t]\n\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure9.eps}\n\\caption{Same legend as Fig. \\ref{Fig:refprot} with different braking laws than in our reference model. The references of the models are given in Table~\\ref{tab:mods}. The reference model corresponds to the black tracks.}\n\\label{Fig:prot}\n\\end{figure*}\n\nFigure \\ref{Fig:prot} presents the evolution of the surface rotation for slow, medium, and fast rotators  with different torque prescriptions, but with the same internal AM transport description ({\\sf MPZ04, TZ97}). \n\nWe note that in all cases, the mean angular velocity of the radiative core reaches the same rotation period, regardless of the stellar wind torque prescription used, as shown in Fig. \\ref{Fig:momspec}.\n\n\\subsubsection*{\\sf RM12}\nThe surface rotation evolution using this prescription is compared to the reference models in the upper row of Fig. \\ref{Fig:prot}. The strong radius dependency of the breaking law reported in\n\\citet{RM12} explains the very high loss of angular momentum observed in Fig. \\ref{Fig:couple} ($5f$ track in the upper right panel) during the PMS, when the star is still contracting.  The angular velocity increases very slowly during the PMS compared to the reference model, and sharply drops at the ZAMS. As soon as the velocity drops below the saturation value ($\\Omega_{sat,RM12} = 3\\Omega_\\odot$), the extraction of angular momentum almost stops and the surface angular velocity evolution stabilises to converge to $\\Omega(t) \\propto t^{-0.25}$ (see Eq. \\ref{eq:RM12}).\n\n\\subsubsection*{\\sf Matt+12}\nThe surface rotation evolution using this prescription is compared to the reference models in the middle row of Fig. \\ref{Fig:prot}. The angular velocity evolution of fast rotators is the same as in the reference model, despite the absence of explicit saturation value in {\\sf Matt+12} prescription. It appears in the BOREAS routine as an asymptotic regime of the magnetic field filling factor $f_\\star$ that is perfectly mimicked by the saturation coefficient $\\chi$ we took for the reference model using {\\sf Matt+15} prescription. \nA difference appears around the ZAMS for slow rotators, and because of this difference of saturation, models with the torque according\nto {\\sf Matt+12}  reach higher rotation periods. Nevertheless, the discrepancy remains very small and as we lack data for these ages, there is no real constraint to determine which one is better.\n\n\\subsubsection*{\\sf K88}\nThe surface rotation evolution using this prescription is compared to the reference models in the lower row of Fig. \\ref{Fig:prot}. Both slow and medium rotators braked with {\\sf K88} behave as the reference model in the unsaturated regime. Still, to obtain a solar surface angular velocity at the age of the Sun, we need to take a high $K_W$ value. The extraction of angular momentum is therefore three times higher at the ZAMS than for the reference model (see right panel of Fig. \\ref{Fig:couple}).\nThis strong braking prevents the models from achieving rapid rotation at the age of the Pleiades with the {\\sf K88} torque. This result is similar to what was obtained in previous work \\citep[e.g.][]{Pinsonneaultetal1989}.\n\n\n\n\\section{Comparison to bi-zone models}\\label{sec:bizone}\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure10.eps}\n\\caption{Evolution of the total specific angular momentum as a function of time. ({\\em Left}) Effect of the AM transport prescriptions. ({\\em Right}) Effect of the torque prescriptions.}\n\\label{Fig:momspec}\n\\end{figure}\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure11.eps}\n\\caption{Same as Fig.~\\ref{Fig:momspec} for the evolution of the ratio between the total angular momentum and the angular momentum loss due to wind alone (disc-coupling loss not accounted for).}\n\\label{Fig:couple}\n\\end{figure}\n\nIn this section we compare our predictions with those of the bi-zone models of \\citet{GB13}.\nTheir approach splits the star into two regions, each of them rotating as a solid body. The external region corresponds to the convective envelope, the inner region to the inside layers of the star (including the radiative region and, if exists, the convective core).\nExchange of AM between these two zones is assumed to occur at a given rate along the whole evolution.\nThe empirical coupling timescale is constrained to reproduce the observed surface rotation periods.\n\nFor a comparison between the two approaches, we deduced a coupling timescale between the convective envelope and the rest of the star for our full evolutionary models.  This is possible thanks to the determination of the angular momentum flux transferred by meridional circulation and shear turbulence between the external convective region and the radiative part of the star (see Eq. \\ref{eq:fluxeq} in Sect. \\ref{sec:formalism}).\n\nThis flux was then introduced into the formulation of \\cite{MB1991} to determine a timescale,\n\n", "itemtype": "equation", "pos": 29816, "prevtext": "\nwith $D_{tot} = D_{eff}+D_v$ the total diffusion coefficient, $D_{eff}$ given by \n\n", "index": 41, "text": "\\begin{equation}\nD_{eff} = \\frac{\\vert rU(r)\\vert^2}{30D_h},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"D_{eff}=\\frac{|rU(r)|^{2}}{30D_{h}},\" display=\"block\"><mrow><mrow><msub><mi>D</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mfrac><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>r</mi><mo>⁢</mo><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mrow><mn>30</mn><mo>⁢</mo><msub><mi>D</mi><mi>h</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere \n\n", "itemtype": "equation", "pos": 55947, "prevtext": "\nwhere $D_v$ and $D_h$ were defined previously (see Table \\ref{tab:coeffdiff}). Finally, the term $\\dot{c}_i$ refers to the temporal evolution of the concentration of chemical species $i$ due to nuclear burning. \n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure2.eps}\n\\caption{Evolution of the angular velocity as a function of time for the reference models. Plotted on the left as the rotational periods in days and during the right as the angular velocity in solar units with $\\Omega_\\odot = 2.86.10^{-6}$s$^{-1}$. Each cross represents a measurement for a star belonging to an open cluster whose age has been taken from the literature. All observational data are taken from \\citet[][and references therein]{GB15}  except the \"OD\" black frame between 8 and 10 Gyr, which corresponds to photometric data for stars observed with the {\\sf KEPLER} satellite that belong to the disc of the Milky Way \\citep{McQuillan2013}.\nSolid lines show the evolution of surface rotation for the slow (magenta), medium (green), and fast (blue) rotating models, while short dashed lines represent the associated averaged angular velocity of the radiative interior.}\n\\label{Fig:refprot}\n\\end{figure}\n\n\\section{Physics of the models}\\label{sec:models}\n\nFor all the models reported in Table~\\ref{tab:mods}, the basic input physics (equation of state, nuclear reaction, opacities) can be found in \\cite{Lagarde2012}. The initial abundances and mixing length parameter are calibrated without microscopic diffusion to reproduce a non-rotating Sun with respect to the \\cite{AsplundGrevesse2009} solar mixture with a $10^{-5}$ precision for luminosity and radius at the age of the Sun. We used a mixing length parameter $\\alpha_c = 1.7020$, an initial helium abundance $ Y = 0.2689 $, and an initial metal abundance $ Z = 0.0134 $. These values differ slightly from \\citet{Lagarde2012} because we included a non-grey atmosphere treatment based on \\cite{KrishnaSwamy}, which better agrees with observations for Sun-like stars \\citep[e.g.][]{Vandenberg2007}.\n\nIn addition to the treatment of transport and loss of angular momentum and mass as described in Sect.~2, we included the modification of the effective gravity by the centrifugal forces and its effect on the stellar structure equations following \\citet{ES76}. This effect is slightly visible on the evolutionary track in the Hertzsprung-Russell diagram when the stars rotate fast. \nRotation can have a non-negligible impact on the effective temperature for the fastest rotators around the ZAMS. \n\n\\begin{figure*}\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure3.eps}\n\\caption{Angular velocity profile of the reference models at different epochs (solid: 10 Myr; dotted: 45 Myr; dashed: 100 Myr; dot-dashed: 250 Myr; long-dashed: 1 Gyr; long-dash-dotted: 4.57 Gyr)  as a function of the relative mass fraction. The left, central, and right plots correspond to cases with slow, medium, and fast rotation (models $1s$, $1m$, and $1f$).}\n\\label{Fig:refprofomega}\n\\end{figure*}\n\n\\section{Reference model}\\label{sec:ref}\n\nThe statistical analysis of the distributions of rotation periods in open clusters and associations from 1 Myr to 2.5 Gyr performed by \\citet{GB13,GB15} focuses on three types of rotators: the slow, medium, and fast rotators, associated to the 25th, 50th,\nand 90th percentiles of the statistical sample in each of the clusters. We focused on the same types of rotators and defined our reference models as those that reproduce their evolutionary paths, as shown in Fig.~\\ref{Fig:refprot}.\nThey are labelled $1s$, $1m,$ and $1f$ in Table~\\ref{tab:mods}. They are characterised by the following set of prescriptions: {\\sf Matt+15} for the stellar wind torque, {\\sf TZ97} for $\\nu_v$ , and {\\sf MPZ04} for $\\nu_h$. We preferred the {\\sf Matt+15} prescription for the torque over the formulation of {\\sf Matt+12} , even though the latter directly takes into account magnetic field and mass-loss rate, precisely for sake of the consistency. Those are multi-dimensional processes that are still implemented in 1D models with many uncertainties. We show in Sect. \\ref{sec:models} that both fit the observed rotation periods, but we prefer a simpler approach that includes fewer uncertain processes to ensure that we will not miss any effects.\n\\begin{table}[h]\n\\caption{Parameters and assumptions of the different models computed in this study: MPZ04 refers to \\cite{MPZ2004}, TZ97 to \\cite{TZ97},  Matt+15 to \\cite{Mattetal2015}, Matt+12 to \\cite{Matt2012}, R\\&M 12 to \\cite{RM12}, and GB13 to \\cite{GB13}. SB is for solid-body rotation.}\n\\begin{center}\n\\begin{tabular}{ c | c | c | c c }\n\\hline\n\\hline\nInitial P$_{rot}$, & $\\nu_h$ & $\\nu_v$&  Braking law & Ref. \\\\\nDL time & prescrip. & prescrip. &  & \\\\\n\\hline\n\\hline\n7 days & MPZ04 & TZ97 & Matt+15 & 1s \\\\ \n5 Myr & MPZ04 & Maeder97 &  Matt+15 & 2s \\\\\n& Zahn92 & TZ97 &  Matt+15 & 3s \\\\\n& Zahn92 & Maeder97 &  Matt+15 & 4s \\\\\n& MPZ04 & TZ97 &  R\\&M 12 & 5s \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6s \\\\\n& MPZ04 & TZ97 &  K88 & 7s \\\\\n& SB & SB &  Matt+15 & 8s \\\\\n& MPZ04 & TZ97 &  GB13 & 9s \\\\\n\\hline\n3.7 days & MPZ04 & TZ97 & Matt+15 & 1m \\\\ \n5 Myr &   MPZ04 & TZ97 &  R\\&M 12 & 5m \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6m \\\\\n& MPZ04 & TZ97 &  K88 & 7m \\\\\n& SB & SB &  Matt+15 & 8m \\\\\n& MPZ04 & TZ97 &  GB13 & 9m \\\\\n\\hline\n1.4 days & MPZ04 & TZ97 & Matt+15 & 1f \\\\ \n3 Myr &  MPZ04 & Maeder97 &  Matt+15 & 2f \\\\\n& Zahn92 & TZ97 &  Matt+15 & 3f \\\\\n& Zahn92 & Maeder97 &  Matt+15 & 4f \\\\\n& MPZ04 & TZ97 &  R\\&M 12 & 5f \\\\\n& MPZ04 & TZ97 &  Matt+12 & 6f \\\\\n& MPZ04 & TZ97 &  K88 & 7f \\\\\n& SB & SB &  Matt+15 & 8f \\\\\n& MPZ04 & TZ97 &  GB13 & 9f \\\\\n\\hline\n\\end{tabular}\n\\label{tab:mods}\n\\end{center}\n\\end{table}\n\n\\subsection{Evolution of surface angular velocities}\n\nFigure~\\ref{Fig:refprot} shows the surface angular velocity evolution (in terms of rotation period) as a function of time for the three reference models ($1s$, $1f,$ and $1m$) as solid lines. \nDepending on their initial velocity, these models present very different behaviours, but they are qualitatively similar to those obtained by \\citet{KPBS97}. The slow and medium rotators (models $1s$ and $1m$) experience a stronger stellar wind braking related to their initial angular momentum during the early evolution than do the fast rotator (model $1f$) towards the age of the present Sun. We also observe a convergence of the averaged rotation rate of the radiative interiors (dashed lines); this result is similar to previous work done with a slightly different treatment of AM transport \\citep[e.g.][]{P90}. Consequently, all the models reach the age of the Sun with the same total amount of angular momentum independently of their initial content. We detail the evolution of the radiative region angular velocity profile to understand which processes are involved.\n\n\n\\begin{figure}[t]\n\\includegraphics[angle=270,width=0.47\\textwidth]{FIGURES/Figure4.eps}\n\\includegraphics[angle=270,width=0.47\\textwidth]{FIGURES/Figure4b.eps}\n\\caption{Angular momentum fluxes carried by meridional circulation (dashed red), shear (dotted blue), and the total flux (solid black) in the fast and slowly rotating models (top and bottom, respectively). Hatched areas in all plots indicate the convective regions.}\n\\label{Fig:reffluxAM}\n\\end{figure}\n\n\n\\subsection{Rotation profile and differential rotation}\nFigure \\ref{Fig:refprofomega} shows the evolution of the internal angular velocity profiles as a function of the mass coordinate for our reference models $1s$ ({\\em left}), $1m$ ({\\em central}), and $1f$ ({\\em right}). We observe that for the special combination of braking and transport prescriptions adopted, all the models end with the same rotation profile (long-dash-dotted cyan profile), regardless of their initial angular momentum content. In all three cases, the differential rotation first increases (the core spins up) during the PMS evolution up to 45 Myr due to the contraction of the stars as they evolve along the Henyey track. Beyond 45 Myr, the core spins down in all models as a result of the meridional circulation that extracts AM from the core to compensate for the loss generated at the surface by the torque (see right panels of Fig.~\\ref{Fig:reffluxAM} and below). The main difference between the three cases is the efficiency of the meridional circulation, which adjusts to the intensity of the torque: the larger the torque (for the fast rotators), the larger the angular velocity gradient and the more efficient the meridional circulation.\nMoreover, since the efficiency of these angular momentum transport processes is proportional to the surface angular velocity, we observe a weak coupling between the radiative core and the envelope in models $1s$ and $1m$ at the same epochs (radiative interior rotating on average much faster than the convective envelope; see solid and dashed lines). Thus, the surface velocity evolution is already shaped by the torque before the stars reach the ZAMS (at $\\approx$ 60 Myr), leading to their early spin down.\\\\\nIn contrast, the fast rotating model strongly couples the radiative and convective zone as long as the star contracts (spins up), and the internal angular momentum is carried outward. During these early phases, model $1f$ is in the saturated dynamo regime. At its arrival on the ZAMS, the star stops spinning up and the surface is strongly braked on a relatively short timescale. The surface velocity is divided by a factor of 10 in 200 Myr, until the star spins down enough to enter the unsaturated-dynamo regime and further decreases by another factor of 10 for the following 4.3 Gyr.\n\nFor clusters older than the Hyades (beyond $\\approx$ 700 Myr), the observed distributions of rotation periods strongly narrow. \n\nBy the time the models reach 1 Gyr, the torque has become much less efficient and the angular velocity profile of the fast rotator is similar to that of the median and slow rotators. The three models later follow the same evolution, which is dictated by the meridional circulation and shear turbulence until the age of the Sun. The surface angular velocity and the total angular momentum content of the slow, medium, and fast rotators are similar beyond 1 Gyr. The angular velocity profiles also share a similar shape and evolution in all three cases.\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure5.eps}\n\\caption{Same as Fig.~\\ref{Fig:refprot} for fast and slow rotator models computed with four different transport prescriptions. Among the slow rotators models $1s$, $2s$, $3s$, and $4s$ correspond to the tracks from top to bottom for an age of 500 Myr. The fast rotating models $1f$, $2f$, $3f$, and $4f$ follow he same order for an age of 60 Myr. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:protmixing}\n\\end{figure}\n\n\\subsection{Transport of AM}\nHere we examine the processes that drive the internal transport of AM in our reference models. To do so, we followed the diagnostic procedure proposed by \\citet{DecressinMathis2009}, which relies on the analysis of the AM fluxes associated with each transport process that is accounted for. The transport of angular momentum is mainly driven by the meridional circulation as long as the star is rotating relatively fast (above the saturation value), as shown in the left panels of Fig. \\ref{Fig:reffluxAM}, and this independently of the initial velocity. After the ZAMS ($\\approx$ 60 Myr), in all cases meridional circulation weakens because the star does not contract any longer and the surface velocity has already decreased. Angular velocity gradient increases at the base of the convective envelope, leading to a predominance of the shear turbulence over the meridional circulation in this region. For the slower rotators, the shear turbulence takes over the transport of AM in the outer radiative zone below the envelope and efficiently extracts (acting along the angular velocity gradient) the angular momentum, \nensuring a continuous decrease of the surface angular velocity from the ZAMS until the age of the Hyades ($\\approx$ 700 Myr) (see lower panel in Fig.~\\ref{Fig:reffluxAM}). On the other hand, in the fast rotator, the meridional circulation is very efficient as long as the star  contracts (2 orders of magnitude larger than in the slow rotator) and efficiently couples the interior to the convective envelope up to the ZAMS. Beyond this age, its efficiency decreases rapidly, and the shear generated by the torque dominates below the convective envelope, although it is not sufficient to maintain an efficient transfer of AM from the core to the envelope.\\\\\nThe overall transport of AM by these processes tends to become less efficient as the star evolves on the main sequence as a\nresult of the decrease of the angular velocity gradient and of the torque.\n\nAround the age of the Sun, some very tight reversals of the circulation that are due to the turbulence at very slow rotation rate appear close to the convective envelope bottom. The earlier evolution is dominated by an outward loop carrying angular momentum from the core to the surface to compensate for the loss that\nis due to stellar wind.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure6.eps}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure6b.eps}\n\\caption{Effect of modelling the vertical turbulent shear diffusion coefficient $D_v$ on the angular velocity profiles. Same as Fig.~\\ref{Fig:refprofomega} for models $2s$ (dashed lines) and $1s$ (solid lines) in the top, and for models $2f$ (dashed lines) and $1f$ (solid lines) in the bottom panels. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:profomegaMaeder}\n\\end{figure}\n\n\\section{Exploring the physical parameter space}\\label{sec:explore}\n\nThe description of our reference models points out the different roles played by the meridional circulation, the shear turbulence, and the torque in shaping the internal angular velocity profiles throughout the evolution. As indicated in Table~\\ref{tab:mods} and Sect.~\\ref{sec:torques}, several prescriptions exist to account for the transport of AM in the radiative interiors and to describe the stellar wind torque exerted at the surface. In this section, we analyse the effect of the prescription choice on the angular velocity and momentum evolution in solar-mass models. To do so, we use the set of diagnostic tools developed by \\cite{DecressinMathis2009}.\\\\\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure7.eps}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure7b.eps}\n\\caption{Effect of the modelling of the horizontal turbulent shear diffusion coefficient $D_h$ on the angular velocity profiles. Same as Fig.~\\ref{Fig:refprofomega} for models $3s$ (dashed lines) and $1s$ (solid lines) in the top, and for models $3f$ (dashed lines) and $1f$ (solid lines) in the bottom panels. The description of the physics used in each of these models is given in Table~\\ref{tab:mods}.}\n\\label{Fig:profomegaZahn}\n\\end{figure}\n\n\\subsection{Transport of angular momentum in the stellar interior}\n\nWithin the paradigm described by \\cite{Zahn1992} for the transport of angular momentum in radiative regions, several prescriptions have been developed to describe the shear turbulent viscosity in both the horizontal and vertical directions. While different groups prefer different combinations according to the type of stars studied, it was not until the study by \\citet{Meynet2013} that the actual impact of choosing a specific combination of prescriptions on the evolution (structural, chemical, and rotational) was explored. These authors modelled massive stars ($9-40$M$_\\odot$) and showed large differences in the HR diagram, the evolution\nof surface chemical abundances, and the rotational evolution. However, the available observational data did not allow them to favour one of the combinations.\n\nHere we analyse the effect of two different prescriptions for both $\\nu_h$ and for $\\nu_v$ on the rotational evolution of a 1 ~{\\ensuremath{M_\\odot}}~ model. The overall effect on the surface and internal averaged angular velocity is shown in Fig.~\\ref{Fig:protmixing}.\\\\\n\n\\subsection{Effect of the prescription for vertical shear}\nWe first compare models with the {\\sf MPZ04} prescription for $D_h$ but with different prescriptions for the vertical shear ({\\sf TZ97} or {\\sf Maeder97}). The use of the {\\sf Maeder97} prescription (given in Table~\\ref{tab:coeffdiff}) for $\\nu_v$ hinders the development of the vertical turbulent shear instability in a larger portion of the radiative interior, and the shear only contributes very little to the transport of AM throughout the evolution. For the slow rotator (model $2s$ in Fig.~\\ref{Fig:protmixing} and top panel in Fig.~\\ref{Fig:profomegaMaeder}), this leads to a sharp decrease of the surface angular velocity from the ZAMS after the contraction of the star has stopped and the meridional circulation is weaker. Between 100 Myr and  1 Gyr, the efficiency of the meridional circulation to transport AM remains almost constant in the inner radiative zone and ensures the transport of AM from the core to the envelope to compensate for the extraction of AM at the surface by the stellar wind torque. Therefore this leads to an almost constant surface angular velocity over this period of time.\n\nFor the fast rotators (model $2f$ in Fig.~\\ref{Fig:protmixing} and lower panel in Fig.~\\ref{Fig:profomegaMaeder}), on the other hand, the prescription of $\\nu_v$ has a very weak influence on the surface velocity because the transport is always dominated by the meridional circulation, which is of similar amplitude as in the reference model. The weak effect of the vertical shear diffusion prescription on the AM evolution also appears when looking at the evolution of the total specific angular momentum as a function of time shown in Fig.~\\ref{Fig:momspec} (dotted line, left panel).\\\\\n\n\\subsection{Effect of the prescription for horizontal turbulence}\nThe effect of the choice of the prescription for the horizontal shear turbulence is much more obvious: in Fig.~\\ref{Fig:protmixing} the two models with $\\nu_h$ from {\\sf Zahn92} (models $3s, 3f, 4s,$ and $4f$\n) present a very high ratio $\\Omega_{interior}/\\Omega_{surface}$ compared to the models $1s$ (resp. $1f$) and $2s$ (resp. $2f$) computed with $\\nu_h$ from {\\sf MPZ04} (see Table~\\ref{tab:mods}). \n\nUsing the expression of {\\sf Zahn92}  for $\\nu_h$ leads to a meridional circulation that is overall slower than for $\\nu_h$ of {\\sf MPZ04}. \n\n The turbulence can develop and disturb the meridional circulation in the radiative interior if the Richardson criterion is fulfilled. In our reference model, the circulation is strong enough to keep its original shape even in presence of shear turbulence, but this is not always the case. Thus, in models $3s$($f$) and $4s$($f$), using $\\nu_{h,Zahn92}$, the angular velocity profiles are much steeper, as shown in Fig.~\\ref{Fig:profomegaZahn}, and trigger a much stronger mean shear-induced turbulence. The loop that was carrying AM outward then breaks into several reverse cells as soon as the Richardson criterion is fulfilled (shown in Fig.~\\ref{Fig:2dcirc_Dh}) and annihilates AM transport locally. Consequently, a break appears in the angular velocity profile that can be seen in Fig.~\\ref{Fig:profomegaZahn} around 0.3 M$_r$ (resp. 0.2 M$_r$) at 1 Gyr and around 0.5 M$_r$ (resp. 0.4 M$_r$) at the solar age for the slow (resp. fast) rotator.\n\nIn addition, the surface velocity at the ZAMS and during the early evolution on the main sequence is lower than in the reference models, leading to a less efficient torque (which is directly proportional to the surface angular velocity) and to a global larger amount of specific angular momentum when the star reaches the age of the Sun (see Fig.~\\ref{Fig:momspec}).\n\n\\begin{figure}\n\\includegraphics[width=0.48\\textwidth]{FIGURES/Figure8.eps}\n\\caption{ Same legend as Fig.~\\ref{Fig:reffluxAM} for two slow rotators at 1 Gyr computed with $\\nu_h$ from {\\sf MPZ04} (left) and {\\sf Zahn92} (right).}\n\\label{Fig:2dcirc_Dh}\n\\end{figure}\n\n\\subsection{Stellar wind torque}\n\nWe now explore the effect of the stellar wind torque prescriptions on the overall angular momentum and angular velocity evolution of solar-mass stars.\\\\ First, we calibrated each of the prescriptions detailed in Sect.~\\ref{sec:torques} to reproduce the surface angular velocity of the present Sun at 4.57 Gyr. To do so, we calibrated one parameter, $\\mathcal{C}, K_1$ and $K_W$ for breaking laws of {\\sf R\\&M12, Matt+12,} and {\\sf K88}, respectively. Second, we adjusted a second parameter\\footnote{$\\Omega_{\\rm sat}$, $m$ and $\\Omega_{\\rm sat}$ for ${\\rm R\\&M12}$, ${\\rm Matt+12,}$ and ${\\rm K88, respectively.}$} to adjust the data in younger clusters, if possible. The obtained values are given in Table~\\ref{tab:brake}, and for every model with a given braking law, the same set of parameters was used, regardless of the initial angular momentum content. \\\\\n\n\n\n\\begin{figure*}[t]\n\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure9.eps}\n\\caption{Same legend as Fig. \\ref{Fig:refprot} with different braking laws than in our reference model. The references of the models are given in Table~\\ref{tab:mods}. The reference model corresponds to the black tracks.}\n\\label{Fig:prot}\n\\end{figure*}\n\nFigure \\ref{Fig:prot} presents the evolution of the surface rotation for slow, medium, and fast rotators  with different torque prescriptions, but with the same internal AM transport description ({\\sf MPZ04, TZ97}). \n\nWe note that in all cases, the mean angular velocity of the radiative core reaches the same rotation period, regardless of the stellar wind torque prescription used, as shown in Fig. \\ref{Fig:momspec}.\n\n\\subsubsection*{\\sf RM12}\nThe surface rotation evolution using this prescription is compared to the reference models in the upper row of Fig. \\ref{Fig:prot}. The strong radius dependency of the breaking law reported in\n\\citet{RM12} explains the very high loss of angular momentum observed in Fig. \\ref{Fig:couple} ($5f$ track in the upper right panel) during the PMS, when the star is still contracting.  The angular velocity increases very slowly during the PMS compared to the reference model, and sharply drops at the ZAMS. As soon as the velocity drops below the saturation value ($\\Omega_{sat,RM12} = 3\\Omega_\\odot$), the extraction of angular momentum almost stops and the surface angular velocity evolution stabilises to converge to $\\Omega(t) \\propto t^{-0.25}$ (see Eq. \\ref{eq:RM12}).\n\n\\subsubsection*{\\sf Matt+12}\nThe surface rotation evolution using this prescription is compared to the reference models in the middle row of Fig. \\ref{Fig:prot}. The angular velocity evolution of fast rotators is the same as in the reference model, despite the absence of explicit saturation value in {\\sf Matt+12} prescription. It appears in the BOREAS routine as an asymptotic regime of the magnetic field filling factor $f_\\star$ that is perfectly mimicked by the saturation coefficient $\\chi$ we took for the reference model using {\\sf Matt+15} prescription. \nA difference appears around the ZAMS for slow rotators, and because of this difference of saturation, models with the torque according\nto {\\sf Matt+12}  reach higher rotation periods. Nevertheless, the discrepancy remains very small and as we lack data for these ages, there is no real constraint to determine which one is better.\n\n\\subsubsection*{\\sf K88}\nThe surface rotation evolution using this prescription is compared to the reference models in the lower row of Fig. \\ref{Fig:prot}. Both slow and medium rotators braked with {\\sf K88} behave as the reference model in the unsaturated regime. Still, to obtain a solar surface angular velocity at the age of the Sun, we need to take a high $K_W$ value. The extraction of angular momentum is therefore three times higher at the ZAMS than for the reference model (see right panel of Fig. \\ref{Fig:couple}).\nThis strong braking prevents the models from achieving rapid rotation at the age of the Pleiades with the {\\sf K88} torque. This result is similar to what was obtained in previous work \\citep[e.g.][]{Pinsonneaultetal1989}.\n\n\n\n\\section{Comparison to bi-zone models}\\label{sec:bizone}\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure10.eps}\n\\caption{Evolution of the total specific angular momentum as a function of time. ({\\em Left}) Effect of the AM transport prescriptions. ({\\em Right}) Effect of the torque prescriptions.}\n\\label{Fig:momspec}\n\\end{figure}\n\\begin{figure}[t]\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure11.eps}\n\\caption{Same as Fig.~\\ref{Fig:momspec} for the evolution of the ratio between the total angular momentum and the angular momentum loss due to wind alone (disc-coupling loss not accounted for).}\n\\label{Fig:couple}\n\\end{figure}\n\nIn this section we compare our predictions with those of the bi-zone models of \\citet{GB13}.\nTheir approach splits the star into two regions, each of them rotating as a solid body. The external region corresponds to the convective envelope, the inner region to the inside layers of the star (including the radiative region and, if exists, the convective core).\nExchange of AM between these two zones is assumed to occur at a given rate along the whole evolution.\nThe empirical coupling timescale is constrained to reproduce the observed surface rotation periods.\n\nFor a comparison between the two approaches, we deduced a coupling timescale between the convective envelope and the rest of the star for our full evolutionary models.  This is possible thanks to the determination of the angular momentum flux transferred by meridional circulation and shear turbulence between the external convective region and the radiative part of the star (see Eq. \\ref{eq:fluxeq} in Sect. \\ref{sec:formalism}).\n\nThis flux was then introduced into the formulation of \\cite{MB1991} to determine a timescale,\n\n", "index": 43, "text": "\\begin{equation}\n\\tau_c = \\Delta J \\times \\frac{1}{F_{\\rm tot}}\n,\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\tau_{c}=\\Delta J\\times\\frac{1}{F_{\\rm tot}},\" display=\"block\"><mrow><mrow><msub><mi>τ</mi><mi>c</mi></msub><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>J</mi></mrow><mo>×</mo><mfrac><mn>1</mn><msub><mi>F</mi><mi>tot</mi></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwith $I_{\\rm conv}$, $J_{\\rm conv}$ and $I_{\\rm rad}$, $J_{\\rm rad}$ being the inertial and angular momentum of the convective envelope and radiative zone (and if exists, the convective core).\n\nBecause the amount of AM that is transported is mainly dominated by the meridional circulation, its corresponding timescale is two orders of magnitude shorter than the one associated with diffusive turbulence. The timescales associated with both meridional circulation and shear turbulence are much longer than the constant coupling time-scale used in bi-zone models \\citep[e.g.][]{GB13,GB15}.\nThese models are calibrated to reproduce the open cluster observations and the surface velocity, the total angular momentum, and the mass-loss rate of the present Sun. The assumed coupling does not necessarily depend on time, rotation rate, or differential rotation rate.\n\nTo properly compare our models to the bi-zone models of \\citet{GB13,GB15}, we computed a slowly rotating model with exactly the same braking law as described in Table 2 of \\citet{GB13} (model {\\em 9s}), and a bi-zone model with the same parameters for the torque and for the coupling timescale as in \\citet{GB13}, but based on the structural evolution of our STAREVOL models (model {\\em GB13})\\footnote{In \\citet{GB13}, the evolution of the structural quantities, e.g. M, R, inertia momenta, are taken from \\citet{Baraffe98} grid. }. \n\nThus, the only differences between the two models are the transport of angular momentum in the radiative core and the exchange with the convective region. The evolution of the surface velocity of these models as a function of time is shown in Fig.~\\ref{Fig:prot2}.\nModel $9s$ solves a self-consistent time-dependent AM exchange between the radiative interior and the convective envelope, with an evolving associated timescale, while the $GB13$ model assumes a constant transfer of AM between the interior and the convective envelope, leading to a constant timescale throughout the evolution, as shown in Fig. \\ref{Fig:Timescales}. \n\\begin{figure*}[t]\n\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure12.eps}\n\n\\caption{Surface rotation evolution as a function of time in the reference slow ({\\em left}) and fast ({\\em right}) models compared to bi-zone models ({\\sf GB13}). Data points are as described in Fig. \\ref{Fig:refprot}. The references of the models are given in Table~\\ref{tab:mods}.}\n\\label{Fig:prot2}\n\\end{figure*}\nThis can qualitatively be transcribed as a forced transfer of AM from the radiative to the convective region that changes the surface velocity and therefore the angular velocity-dependent AM extraction at the surface, while in our self-consistent model the AM extraction triggers the AM transport below the convective region and thus changes the core-envelope coupling.\n\nAt the very beginning of the evolution, when the star is still coupled to its disc but is already partially radiative, the forcing of the disc on the stellar surface leads to a very strong meridional circulation, and the corresponding AM transport timescale is very short compared to the rest of the evolution.\nAfter the star decouples from the disc, the forcing stops and the AM transfer timescale increases sharply. Beyond this point, the coupling timescale in model $9s$(f) is always much longer than the timescale assumed in the bi-zone model $GB13$ (fast or slow). On the MS the structure of the star stabilizes and the core-envelope coupling follows both the evolution of the surface angular velocity and the differential rotation. \nWe can note that the fast rotators experience a much stronger coupling during the whole evolution. This is especially evident around 200 Myr when the star is still a fast rotator and the differential rotation quickly increases because of the strong braking that slows down the surface. Since both the absolute and the differential rotation rate play a role in the efficiency of AM transport, the coupling timescale reaches a minimum. Even though the convective and radiative regions of the fast rotator are more strongly coupled than for the slow rotator, the coupling timescale remains more than one order of magnitude higher than the constant coupling timescale set for the two-zones model.\n\nFigure \\ref{Fig:TorqueGB13} shows the extraction of angular momentum by magnetized winds in both cases. As expected, the evolution is similar during the PMS because the evolution of angular velocity is driven by structural effects that are identical in both models. After the star stops contracting, the internal angular momentum transport becomes relevant and a difference appears between the two models. As more AM is brought to the surface, the angular velocity is higher with a stronger coupling in model $GB13$. When the angular velocity is higher for the same structure, the extraction by the winds is stronger during this phase and pumps out most of the radiative core AM reservoir. All the AM brought to the convective region is immediately removed by stellar winds\nbecause a certain equilibrium is reached between the core-envelope coupling and the surface extraction.\nAround 1 Gyr, the model with $GB13$ parameters  rotates almost as a solid body, the transfer of AM from the core to the external envelope becomes very weak and causes the radiative core to rotate at the same angular velocity as the convective region. At the same time,  model $9s$ loses AM faster, but the rate is still two orders of magnitude lower than at the ZAMS. All the AM loss that matters for the AM content at the age of the Sun occurs before 1 Gyr.\n\n\\begin{figure}\n\\includegraphics[width=0.42\\textwidth]{FIGURES/Figure13.eps}\n\\caption{Coupling timescale from the AM exchange between the radiative core and the convective envelope.}\n\\label{Fig:Timescales}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=0.42\\textwidth]{FIGURES/Figure14.eps}\n\\caption{Specific angular momentum loss per year as a function of time.}\n\\label{Fig:TorqueGB13}\n\\end{figure}\n\n\n\n\n\\section{Discussion with respect to additional constraints}\\label{sec:other}\n\n\\subsection{Constraint on internal rotation from helioseismology}\nAsteroseismology, and more specifically helioseismology, has\ndelivered very accurate data that allow probing the internal structure of stars. \\citet{ThompsonScience1996} showed that the solar rotation profile can be inverted deep in the radiative zone, down to about 0.2 $R_\\odot$, using the information carried by the rotational splitting of high-order low-degree $p$-modes.\nMore recently, and as shown in Fig. \\ref{Fig:Sunprof}, \\citet{Garcia2011} used rotational splitting of candidate $g$-modes to deduce the rotation profile of the Sun in its very core, below $0.2 R_\\odot$.\nThe $p$-mode analysis shows that the Sun is rotating almost as a solid body in the radiative region down to about $0.2 R_\\odot$, while candidate g-modes seem to indicate an increase of the angular velocity from $\\simeq 430$ nHz to 2 $\\mu$Hz in the innermost regions. This latest result is still debated, however. We here neglect a number of AM transport processes that are expected to modify the angular velocity profile in the radiative interior \\citep{CharbonnelTalon2005Science,Eggenberger2005,Charbonnel2013}, so that we do not expect our models to fit the helioseismic profile.\nWhen plotted against helioseismic data, all the models discussed previously are, as expected, far from observations in the radiative region. Indeed, even the model with the flatter rotation profile that we obtain at the age of the Sun still spins four times faster in the central region and does not reproduce the solid-body region between 0.2 R$_\\odot$ and the bottom of the convective envelope\nat all.\nInternal gravity waves \\citep{CharbonnelTalon2005Science} and magnetic fields \\citep{Eggenberger2005} have shown very promising results in reproducing the solar rotation profile. However, these processes appear to act on very different timescales, and incorporating\nthem is beyond the scope of the present study, where we focus on hydrodynamical processes.\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure15.eps}\n\\caption{Comparison of our models with the rotation profile of the Sun obtained from helioseismology by \\citet{Garcia2011}}\n\\label{Fig:Sunprof}\n\\end{figure}\n\n\\subsection{Constraint from lithium abundances}\nBecause lithium is prone to  destruction by proton captures at temperatures $T \\geq 2.5 \\times 10^6$ K, its abundance at the stellar surface is a good proxy to evaluate the depth and efficiency of mixing processes that may connect the low-temperature convective envelopes of stars to deeper radiative regions where lithium is destroyed \\citep[e.g.][]{Deliyannisetal00}.\nConsidering that meridional circulation and turbulent shear instability not only transport AM but also matter, it is therefore interesting to look at the predictions of our models concerning the evolution of the lithium surface abundance. It worth noting that in our self-consistent approach, the lithium depletion predicted by the models is a direct consequence of the evolution angular rotation profile driven by the extraction and internal transport of AM (i.e. we do not have any adjustable parameter to reduce the efficiency of the mixing to fit the Li data). \\\\ The results are shown in Fig.~\\ref{Fig:Li}, where we compare the predictions of the models to the observed range of Li abundances determined for solar-type stars in different open clusters from 5 Myr to the age of the Sun as compiled by \\citet{SestitoRandich2005}\\footnote{To establish these ranges, we selected the stars in each cluster that have the temperature of a solar-type star of the same age according to stellar evolution models.}. As expected from previous works, our reference models (both the slow and the fast rotators) selected to best reproduce the angular velocity evolution of solar-type stars fail to simultaneously reproduce the observed lithium abundance evolution of solar-type stars on the main sequence (beyond 250 Myr (resp. 100 Myr) for the slow (resp. fast) rotators). This is due to the efficient transport of lithium by the shear turbulent instability in the radiative interior of our models. The lithium destruction occurs earlier in the fast rotators because of the correlation between the shear mixing efficiency and the angular velocity gradient, which is directly related to the torque. \\citet{CharbonnelTalon2005Science} obtained similar results and showed that the introduction of internal gravity waves could reconcile the models predictions with observations by flattening out the angular velocity profile and thus reducing the efficiency of the turbulent shear mixing.\\\\\nWe point out the unexpected behaviour of model {\\em 2s} that is computed using \\citet{Maeder1997} prescription for the vertical turbulent shear diffusivity. In this case, the effective diffusion coefficient representing the transport of nuclides by the meridional circulation is the same as in our reference case {\\em 1s} because we used the same prescription for the $D_h$ expression. However, $D_v$ from {\\sf Maeder97} is significantly lower than that predicted by {\\sf TZ97}, in particular in regions where the mean molecular weight gradients are large. As a result, the transport of nuclides is less efficient in model {\\em 2s} and the surface abundance of lithium decreases much more slowly than in our reference model {\\em 1s}.\n In summary, none of the present models that account for the rotational behaviour of solar-type stars is able to simultaneously account for the lithium evolution and the helioseismic constraints, as already anticipated in previous works of our group.\n\n\\begin{figure*}\n\\includegraphics[width = 0.45\\textwidth]{FIGURES/Figure16.eps}\n\\includegraphics[width = 0.45\\textwidth]{FIGURES/Figure16b.eps}\n\\caption{Evolution of the surface lithium abundances in the slow ({\\em left}) and fast ({\\em right}) rotating models as a function of time. The open boxes represent the ranges of lithium abundances determined by \\citet{SestitoRandich2005} for the following clusters and associations: NGC2264 at 5 Myr, IC2391/IC2602/IC4665 at 30 Myr, Pleiades/Blanco1 at 80 Myr, NGC2516 at 150 Myr, M34/M35/NGC6475 at 250 Myr, Hyades/Praesepe/Coma Ber/NGC6633 at 600 Myr, NGC752/NGC3680/IC4651 at 2 Gyr and M67 at 4.5 Gyr. The Sun is also indicated with the solar symbol $\\odot$.}\n\\label{Fig:Li}\n\\end{figure*}\n\n\\section{Summary and global picture}\\label{sec:end}\nObservations have shown that the AM of solar-mass stars is reduced by two orders of magnitude during the first few Myr of their interaction with their disc. After this phase, they need to decrease it by two more orders of magnitude to reach the solar angular momentum content. This loss of AM is thought to occur through stellar wind coupled with the large-scale stellar magnetic field. However, since young stars are not expected to rotate as solid bodies, the transport of angular momentum in the stellar radiative interiors should modify the evolution of their surface velocity at every age. Hydrodynamical processes transporting AM are driven by the forcing induced by the extraction of AM at the surface by stellar winds. Thus, depending on the wind-braking prescription used in the models, the efficiency of the transport will be different.  \n\nDifferent prescriptions for the AM extraction and transport processes exist in the literature, with different degrees of approximation. \nWe here showed that self-consistent 1 M$_\\odot$ rotating evolutionary models that account for the transport of AM by meridional circulation and shear turbulence alone and that use a realistic AM wind-driven extraction can reproduce the evolution of the surface rotation of open clusters from the disc-coupling phase to the age of the Sun. Using different prescription sets for the horizontal and vertical diffusion coefficients essentially impacts the AM distribution inside the star. \n\nThe surface extraction of AM and the AM transport in the radiative region interact in a complex way, the first triggering the later and the later enforcing the first.\\\\\nWe find that the stellar wind prescriptions from \\citet{Matt2012,Mattetal2015} provide a really good match with observations of rotation periods in open clusters when they are combined with the adapted AM transport, meaning here {\\sf MPZ04} and {\\sf TZ97} for the prescriptions of the horizontal diffusion and vertical diffusion coefficients, respectively. None of the other braking laws lead to as good results, independently of the chosen prescriptions for internal AM transport. \n\nThis led us to select the following combination for our reference model: ($D_v$; $D_h$; $dJ/dt$) $\\equiv$ ({\\sf TZ97, MPZ04, Matt15}). With this set of prescriptions, our models all reached the same internal rotation profile at the age of the Sun, regardless of the assumed initial angular momentum content. \n\nUnlike in bi-zone models, the angular momentum content of the present Sun cannot be retrieved with our models. Even using the most favourable combination of the available prescriptions, meridional circulation and shear-induced turbulence are therefore\njust efficient enough to reproduce the observed $P_{rot}$ data, but additional processes are still needed to reproduce asteroseismic and surface chemical abundances observations. Regardless of the set of AM transport prescriptions we used, we were unable to reproduce these observed data.\n\nIn the recent years, the asteroseismic data mostly gathered by the \\textit{Kepler} mission for subgiant and red giant stars also revealed the need to go beyond the current description of rotational mixing to be able to account for the rotational properties (surface and core rotation) of evolved low-mass stars \\citep{Cellieretal2012,VSP2013,Garciaetal2014,Deheuvelsetal2014,Deheuvelsetal2015}. \nThe dominant processes that shape the AM evolution may differ according to the evolutionary phase. However, observational evidence now exists, for stars ranging from the PMS to the red clump, pointing towards the need of additional AM transport mechanisms that would efficiently couple the core and the envelope of solar-type stars.\n\nAs predicted by \\citet{MacGregor2000} and tested in main-sequence evolutionary models by \\citet{CharbonnelTalon2005Science} and \\citet{Eggenberger2005}, magnetic field and internal gravity waves are very good candidates to provide additional angular momentum transport and should be investigated in a further study.\\\\ It is also important to investigate whether our conclusions also apply to other low-mass stars in the mass range 0.5~{\\ensuremath{M_\\odot}}~ to 2~{\\ensuremath{M_\\odot}}~. The structural and rotational evolution is expected to differ depending on the initial mass in this mass range \\citep[see e.g.][]{GB15}, which may have a significant effect on the efficiency of possible transport processes, as was discussed for instance by \\citet{TalonCharbonnel2003}.\n\n\n\\begin{acknowledgements}\nThis study was supported by the grant ANR\n2011 Blanc SIMI5-6 020 01 â\u0080\u009cToupies: Towards understanding the spin\nevolution of starsâ\u0080\u009d (http:\\/\\/ipag.osug.fr\\/Anr\\_Toupies\\/ ). \nC. Charbonnel and F. Gallet acknowledge support from the European COST Action TD 1308 Origins and the SEFRI project C14.0049 of the Conf\\'ed\\'eration Suisse.\n\\end{acknowledgements}\n\n\\bibliography{BibADS}\n\n\n\n\n\n\n\n\n\n\n\\appendix\n\\section{Magnetic field generation and mass-loss rate}\nMagnetic field and mass loss were computed following \\cite{CS2011}. Nevertheless, to calibrate our model on the Sun, we needed to modify some expression in the BOREAS routine that were rewritten in Fortran. These are set out in this appendix.\n\nThe effective temperature was directly taken from STAREVOL and\nwas not computed from luminosity and radius as in the initial routine.\n\nFollowing \\citet{GB13}, we reduced the kink wave energy flux $F_A$ (Eq. (7) in \\citet{CS2011}) by a factor $2.5$ to obtain a mass-loss rate of $2.9 \\times 10^{-14}  M_\\odot.yr^{-1}$ at the age of the Sun, which is still consistent with the estimated range of the actual solar mass-loss rate ($2 - 3.2\\times 10^{-14} M_\\odot.yr^{-1}$). \n\nSimilarly to \\citet{GB13}, we took the same expression as $f_{min}$ in \\citet{CS2011}, but slightly modified it to reproduce the average filling factor of the present Sun ($f_{*\\odot} = 0.0035 \\in [0.001;0.01]$):\n\n", "itemtype": "equation", "pos": 56034, "prevtext": "\nwhere \n\n", "index": 45, "text": "\\begin{equation}\n\\Delta J = \\frac{I_{\\rm conv}J_{\\rm rad} -I_{\\rm rad}J_{\\rm conv}}{I_{\\rm rad} + I_{\\rm conv}}\n,\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\Delta J=\\frac{I_{\\rm conv}J_{\\rm rad}-I_{\\rm rad}J_{\\rm conv}}{I_{\\rm rad}+I_%&#10;{\\rm conv}},\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>J</mi></mrow><mo>=</mo><mfrac><mrow><mrow><msub><mi>I</mi><mi>conv</mi></msub><mo>⁢</mo><msub><mi>J</mi><mi>rad</mi></msub></mrow><mo>-</mo><mrow><msub><mi>I</mi><mi>rad</mi></msub><mo>⁢</mo><msub><mi>J</mi><mi>conv</mi></msub></mrow></mrow><mrow><msub><mi>I</mi><mi>rad</mi></msub><mo>+</mo><msub><mi>I</mi><mi>conv</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01904.tex", "nexttext": "\nwhere $x$ is the normalized Rossby number. $\\tau_{conv}$ and $\\tau_{conv_\\odot}$ are determined with the expression given in the BOREAS routine. It is a function of the effective temperature, which was fitted to a set of ZAMS models given by \\citet{Gunn98}. \n\n\n", "itemtype": "equation", "pos": 74508, "prevtext": "\nwith $I_{\\rm conv}$, $J_{\\rm conv}$ and $I_{\\rm rad}$, $J_{\\rm rad}$ being the inertial and angular momentum of the convective envelope and radiative zone (and if exists, the convective core).\n\nBecause the amount of AM that is transported is mainly dominated by the meridional circulation, its corresponding timescale is two orders of magnitude shorter than the one associated with diffusive turbulence. The timescales associated with both meridional circulation and shear turbulence are much longer than the constant coupling time-scale used in bi-zone models \\citep[e.g.][]{GB13,GB15}.\nThese models are calibrated to reproduce the open cluster observations and the surface velocity, the total angular momentum, and the mass-loss rate of the present Sun. The assumed coupling does not necessarily depend on time, rotation rate, or differential rotation rate.\n\nTo properly compare our models to the bi-zone models of \\citet{GB13,GB15}, we computed a slowly rotating model with exactly the same braking law as described in Table 2 of \\citet{GB13} (model {\\em 9s}), and a bi-zone model with the same parameters for the torque and for the coupling timescale as in \\citet{GB13}, but based on the structural evolution of our STAREVOL models (model {\\em GB13})\\footnote{In \\citet{GB13}, the evolution of the structural quantities, e.g. M, R, inertia momenta, are taken from \\citet{Baraffe98} grid. }. \n\nThus, the only differences between the two models are the transport of angular momentum in the radiative core and the exchange with the convective region. The evolution of the surface velocity of these models as a function of time is shown in Fig.~\\ref{Fig:prot2}.\nModel $9s$ solves a self-consistent time-dependent AM exchange between the radiative interior and the convective envelope, with an evolving associated timescale, while the $GB13$ model assumes a constant transfer of AM between the interior and the convective envelope, leading to a constant timescale throughout the evolution, as shown in Fig. \\ref{Fig:Timescales}. \n\\begin{figure*}[t]\n\\includegraphics[width=0.95\\textwidth]{FIGURES/Figure12.eps}\n\n\\caption{Surface rotation evolution as a function of time in the reference slow ({\\em left}) and fast ({\\em right}) models compared to bi-zone models ({\\sf GB13}). Data points are as described in Fig. \\ref{Fig:refprot}. The references of the models are given in Table~\\ref{tab:mods}.}\n\\label{Fig:prot2}\n\\end{figure*}\nThis can qualitatively be transcribed as a forced transfer of AM from the radiative to the convective region that changes the surface velocity and therefore the angular velocity-dependent AM extraction at the surface, while in our self-consistent model the AM extraction triggers the AM transport below the convective region and thus changes the core-envelope coupling.\n\nAt the very beginning of the evolution, when the star is still coupled to its disc but is already partially radiative, the forcing of the disc on the stellar surface leads to a very strong meridional circulation, and the corresponding AM transport timescale is very short compared to the rest of the evolution.\nAfter the star decouples from the disc, the forcing stops and the AM transfer timescale increases sharply. Beyond this point, the coupling timescale in model $9s$(f) is always much longer than the timescale assumed in the bi-zone model $GB13$ (fast or slow). On the MS the structure of the star stabilizes and the core-envelope coupling follows both the evolution of the surface angular velocity and the differential rotation. \nWe can note that the fast rotators experience a much stronger coupling during the whole evolution. This is especially evident around 200 Myr when the star is still a fast rotator and the differential rotation quickly increases because of the strong braking that slows down the surface. Since both the absolute and the differential rotation rate play a role in the efficiency of AM transport, the coupling timescale reaches a minimum. Even though the convective and radiative regions of the fast rotator are more strongly coupled than for the slow rotator, the coupling timescale remains more than one order of magnitude higher than the constant coupling timescale set for the two-zones model.\n\nFigure \\ref{Fig:TorqueGB13} shows the extraction of angular momentum by magnetized winds in both cases. As expected, the evolution is similar during the PMS because the evolution of angular velocity is driven by structural effects that are identical in both models. After the star stops contracting, the internal angular momentum transport becomes relevant and a difference appears between the two models. As more AM is brought to the surface, the angular velocity is higher with a stronger coupling in model $GB13$. When the angular velocity is higher for the same structure, the extraction by the winds is stronger during this phase and pumps out most of the radiative core AM reservoir. All the AM brought to the convective region is immediately removed by stellar winds\nbecause a certain equilibrium is reached between the core-envelope coupling and the surface extraction.\nAround 1 Gyr, the model with $GB13$ parameters  rotates almost as a solid body, the transfer of AM from the core to the external envelope becomes very weak and causes the radiative core to rotate at the same angular velocity as the convective region. At the same time,  model $9s$ loses AM faster, but the rate is still two orders of magnitude lower than at the ZAMS. All the AM loss that matters for the AM content at the age of the Sun occurs before 1 Gyr.\n\n\\begin{figure}\n\\includegraphics[width=0.42\\textwidth]{FIGURES/Figure13.eps}\n\\caption{Coupling timescale from the AM exchange between the radiative core and the convective envelope.}\n\\label{Fig:Timescales}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=0.42\\textwidth]{FIGURES/Figure14.eps}\n\\caption{Specific angular momentum loss per year as a function of time.}\n\\label{Fig:TorqueGB13}\n\\end{figure}\n\n\n\n\n\\section{Discussion with respect to additional constraints}\\label{sec:other}\n\n\\subsection{Constraint on internal rotation from helioseismology}\nAsteroseismology, and more specifically helioseismology, has\ndelivered very accurate data that allow probing the internal structure of stars. \\citet{ThompsonScience1996} showed that the solar rotation profile can be inverted deep in the radiative zone, down to about 0.2 $R_\\odot$, using the information carried by the rotational splitting of high-order low-degree $p$-modes.\nMore recently, and as shown in Fig. \\ref{Fig:Sunprof}, \\citet{Garcia2011} used rotational splitting of candidate $g$-modes to deduce the rotation profile of the Sun in its very core, below $0.2 R_\\odot$.\nThe $p$-mode analysis shows that the Sun is rotating almost as a solid body in the radiative region down to about $0.2 R_\\odot$, while candidate g-modes seem to indicate an increase of the angular velocity from $\\simeq 430$ nHz to 2 $\\mu$Hz in the innermost regions. This latest result is still debated, however. We here neglect a number of AM transport processes that are expected to modify the angular velocity profile in the radiative interior \\citep{CharbonnelTalon2005Science,Eggenberger2005,Charbonnel2013}, so that we do not expect our models to fit the helioseismic profile.\nWhen plotted against helioseismic data, all the models discussed previously are, as expected, far from observations in the radiative region. Indeed, even the model with the flatter rotation profile that we obtain at the age of the Sun still spins four times faster in the central region and does not reproduce the solid-body region between 0.2 R$_\\odot$ and the bottom of the convective envelope\nat all.\nInternal gravity waves \\citep{CharbonnelTalon2005Science} and magnetic fields \\citep{Eggenberger2005} have shown very promising results in reproducing the solar rotation profile. However, these processes appear to act on very different timescales, and incorporating\nthem is beyond the scope of the present study, where we focus on hydrodynamical processes.\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{FIGURES/Figure15.eps}\n\\caption{Comparison of our models with the rotation profile of the Sun obtained from helioseismology by \\citet{Garcia2011}}\n\\label{Fig:Sunprof}\n\\end{figure}\n\n\\subsection{Constraint from lithium abundances}\nBecause lithium is prone to  destruction by proton captures at temperatures $T \\geq 2.5 \\times 10^6$ K, its abundance at the stellar surface is a good proxy to evaluate the depth and efficiency of mixing processes that may connect the low-temperature convective envelopes of stars to deeper radiative regions where lithium is destroyed \\citep[e.g.][]{Deliyannisetal00}.\nConsidering that meridional circulation and turbulent shear instability not only transport AM but also matter, it is therefore interesting to look at the predictions of our models concerning the evolution of the lithium surface abundance. It worth noting that in our self-consistent approach, the lithium depletion predicted by the models is a direct consequence of the evolution angular rotation profile driven by the extraction and internal transport of AM (i.e. we do not have any adjustable parameter to reduce the efficiency of the mixing to fit the Li data). \\\\ The results are shown in Fig.~\\ref{Fig:Li}, where we compare the predictions of the models to the observed range of Li abundances determined for solar-type stars in different open clusters from 5 Myr to the age of the Sun as compiled by \\citet{SestitoRandich2005}\\footnote{To establish these ranges, we selected the stars in each cluster that have the temperature of a solar-type star of the same age according to stellar evolution models.}. As expected from previous works, our reference models (both the slow and the fast rotators) selected to best reproduce the angular velocity evolution of solar-type stars fail to simultaneously reproduce the observed lithium abundance evolution of solar-type stars on the main sequence (beyond 250 Myr (resp. 100 Myr) for the slow (resp. fast) rotators). This is due to the efficient transport of lithium by the shear turbulent instability in the radiative interior of our models. The lithium destruction occurs earlier in the fast rotators because of the correlation between the shear mixing efficiency and the angular velocity gradient, which is directly related to the torque. \\citet{CharbonnelTalon2005Science} obtained similar results and showed that the introduction of internal gravity waves could reconcile the models predictions with observations by flattening out the angular velocity profile and thus reducing the efficiency of the turbulent shear mixing.\\\\\nWe point out the unexpected behaviour of model {\\em 2s} that is computed using \\citet{Maeder1997} prescription for the vertical turbulent shear diffusivity. In this case, the effective diffusion coefficient representing the transport of nuclides by the meridional circulation is the same as in our reference case {\\em 1s} because we used the same prescription for the $D_h$ expression. However, $D_v$ from {\\sf Maeder97} is significantly lower than that predicted by {\\sf TZ97}, in particular in regions where the mean molecular weight gradients are large. As a result, the transport of nuclides is less efficient in model {\\em 2s} and the surface abundance of lithium decreases much more slowly than in our reference model {\\em 1s}.\n In summary, none of the present models that account for the rotational behaviour of solar-type stars is able to simultaneously account for the lithium evolution and the helioseismic constraints, as already anticipated in previous works of our group.\n\n\\begin{figure*}\n\\includegraphics[width = 0.45\\textwidth]{FIGURES/Figure16.eps}\n\\includegraphics[width = 0.45\\textwidth]{FIGURES/Figure16b.eps}\n\\caption{Evolution of the surface lithium abundances in the slow ({\\em left}) and fast ({\\em right}) rotating models as a function of time. The open boxes represent the ranges of lithium abundances determined by \\citet{SestitoRandich2005} for the following clusters and associations: NGC2264 at 5 Myr, IC2391/IC2602/IC4665 at 30 Myr, Pleiades/Blanco1 at 80 Myr, NGC2516 at 150 Myr, M34/M35/NGC6475 at 250 Myr, Hyades/Praesepe/Coma Ber/NGC6633 at 600 Myr, NGC752/NGC3680/IC4651 at 2 Gyr and M67 at 4.5 Gyr. The Sun is also indicated with the solar symbol $\\odot$.}\n\\label{Fig:Li}\n\\end{figure*}\n\n\\section{Summary and global picture}\\label{sec:end}\nObservations have shown that the AM of solar-mass stars is reduced by two orders of magnitude during the first few Myr of their interaction with their disc. After this phase, they need to decrease it by two more orders of magnitude to reach the solar angular momentum content. This loss of AM is thought to occur through stellar wind coupled with the large-scale stellar magnetic field. However, since young stars are not expected to rotate as solid bodies, the transport of angular momentum in the stellar radiative interiors should modify the evolution of their surface velocity at every age. Hydrodynamical processes transporting AM are driven by the forcing induced by the extraction of AM at the surface by stellar winds. Thus, depending on the wind-braking prescription used in the models, the efficiency of the transport will be different.  \n\nDifferent prescriptions for the AM extraction and transport processes exist in the literature, with different degrees of approximation. \nWe here showed that self-consistent 1 M$_\\odot$ rotating evolutionary models that account for the transport of AM by meridional circulation and shear turbulence alone and that use a realistic AM wind-driven extraction can reproduce the evolution of the surface rotation of open clusters from the disc-coupling phase to the age of the Sun. Using different prescription sets for the horizontal and vertical diffusion coefficients essentially impacts the AM distribution inside the star. \n\nThe surface extraction of AM and the AM transport in the radiative region interact in a complex way, the first triggering the later and the later enforcing the first.\\\\\nWe find that the stellar wind prescriptions from \\citet{Matt2012,Mattetal2015} provide a really good match with observations of rotation periods in open clusters when they are combined with the adapted AM transport, meaning here {\\sf MPZ04} and {\\sf TZ97} for the prescriptions of the horizontal diffusion and vertical diffusion coefficients, respectively. None of the other braking laws lead to as good results, independently of the chosen prescriptions for internal AM transport. \n\nThis led us to select the following combination for our reference model: ($D_v$; $D_h$; $dJ/dt$) $\\equiv$ ({\\sf TZ97, MPZ04, Matt15}). With this set of prescriptions, our models all reached the same internal rotation profile at the age of the Sun, regardless of the assumed initial angular momentum content. \n\nUnlike in bi-zone models, the angular momentum content of the present Sun cannot be retrieved with our models. Even using the most favourable combination of the available prescriptions, meridional circulation and shear-induced turbulence are therefore\njust efficient enough to reproduce the observed $P_{rot}$ data, but additional processes are still needed to reproduce asteroseismic and surface chemical abundances observations. Regardless of the set of AM transport prescriptions we used, we were unable to reproduce these observed data.\n\nIn the recent years, the asteroseismic data mostly gathered by the \\textit{Kepler} mission for subgiant and red giant stars also revealed the need to go beyond the current description of rotational mixing to be able to account for the rotational properties (surface and core rotation) of evolved low-mass stars \\citep{Cellieretal2012,VSP2013,Garciaetal2014,Deheuvelsetal2014,Deheuvelsetal2015}. \nThe dominant processes that shape the AM evolution may differ according to the evolutionary phase. However, observational evidence now exists, for stars ranging from the PMS to the red clump, pointing towards the need of additional AM transport mechanisms that would efficiently couple the core and the envelope of solar-type stars.\n\nAs predicted by \\citet{MacGregor2000} and tested in main-sequence evolutionary models by \\citet{CharbonnelTalon2005Science} and \\citet{Eggenberger2005}, magnetic field and internal gravity waves are very good candidates to provide additional angular momentum transport and should be investigated in a further study.\\\\ It is also important to investigate whether our conclusions also apply to other low-mass stars in the mass range 0.5~{\\ensuremath{M_\\odot}}~ to 2~{\\ensuremath{M_\\odot}}~. The structural and rotational evolution is expected to differ depending on the initial mass in this mass range \\citep[see e.g.][]{GB15}, which may have a significant effect on the efficiency of possible transport processes, as was discussed for instance by \\citet{TalonCharbonnel2003}.\n\n\n\\begin{acknowledgements}\nThis study was supported by the grant ANR\n2011 Blanc SIMI5-6 020 01 â\u0080\u009cToupies: Towards understanding the spin\nevolution of starsâ\u0080\u009d (http:\\/\\/ipag.osug.fr\\/Anr\\_Toupies\\/ ). \nC. Charbonnel and F. Gallet acknowledge support from the European COST Action TD 1308 Origins and the SEFRI project C14.0049 of the Conf\\'ed\\'eration Suisse.\n\\end{acknowledgements}\n\n\\bibliography{BibADS}\n\n\n\n\n\n\n\n\n\n\n\\appendix\n\\section{Magnetic field generation and mass-loss rate}\nMagnetic field and mass loss were computed following \\cite{CS2011}. Nevertheless, to calibrate our model on the Sun, we needed to modify some expression in the BOREAS routine that were rewritten in Fortran. These are set out in this appendix.\n\nThe effective temperature was directly taken from STAREVOL and\nwas not computed from luminosity and radius as in the initial routine.\n\nFollowing \\citet{GB13}, we reduced the kink wave energy flux $F_A$ (Eq. (7) in \\citet{CS2011}) by a factor $2.5$ to obtain a mass-loss rate of $2.9 \\times 10^{-14}  M_\\odot.yr^{-1}$ at the age of the Sun, which is still consistent with the estimated range of the actual solar mass-loss rate ($2 - 3.2\\times 10^{-14} M_\\odot.yr^{-1}$). \n\nSimilarly to \\citet{GB13}, we took the same expression as $f_{min}$ in \\citet{CS2011}, but slightly modified it to reproduce the average filling factor of the present Sun ($f_{*\\odot} = 0.0035 \\in [0.001;0.01]$):\n\n", "index": 47, "text": "\\begin{equation}\nf_\\star = \\frac{0.4}{[1+\\left(x/0.16\\right)^{2.3}]^{1.22}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"f_{\\star}=\\frac{0.4}{[1+\\left(x/0.16\\right)^{2.3}]^{1.22}},\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mo>⋆</mo></msub><mo>=</mo><mfrac><mn>0.4</mn><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>(</mo><mrow><mi>x</mi><mo>/</mo><mn>0.16</mn></mrow><mo>)</mo></mrow><mn>2.3</mn></msup></mrow><mo stretchy=\"false\">]</mo></mrow><mn>1.22</mn></msup></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]