[{"file": "1601.07960.tex", "nexttext": "\n\nTo estimate $L_s$ for our data, we employed a simplified model to estimate $U(h)$. Using data from the sonic anemometer within the canopy ($z/h=0.72$) and from the nearby meteorological tower ($z/h=2.6$) as reference points, we modeled the mean velocity above the canopy using:\n\n\n", "itemtype": "equation", "pos": 21094, "prevtext": "\n\n\n\n\n\n\n\n\n\\title{Wind--driven water motions in wetlands with emergent vegetation}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\authors{Ian C. Tse, \\altaffilmark{1} \nCristina M. Poindexter, \\altaffilmark{1,2},\nand Evan A. Variano \\altaffilmark{1}}\n\n\\altaffiltext{1}{Department of Civil and Environmental Engineering,\nUniversity of California, Berkeley, Berkeley, California, USA.}\n\n\\altaffiltext{2}{Department of Civil and Environmental Engineering,\nCalifornia State University, Sacramento, Sacramento, California, USA.}\n\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\nWetland biogeochemical transformations are affected by flow and mixing in wetland surface water. We investigate the influence of wind on wetland water flow by simultaneously measuring wind and surface water velocities in an enclosed freshwater wetland during one day of strong-wind conditions.\nWater velocities are measured using a Volumetric Particle Imager while wind velocities are measured via sonic-anemometer. Our measurements indicate that the wind interacting with the vegetation canopy generates coherent billows and that these billows are the dominant source of momentum into the wetland water column. Spectral analysis of velocity timeseries shows that the spectral peak in water velocity is aligned with the spectral peak of in-canopy wind velocity, and that this peak corresponds with the Kelvin-Helmholtz billow frequency predicted by mixing layer theory. We also observe a strong correlation in the temporal pattern of velocity variance in the air and water, with high variance events having similar timing and duration both above and below the air-water interface. Water-side variance appears coupled with air-side variance at least down to 5 cm, while the theoretical Stokes' solution predicts momentum transfer down to only 2 mm assuming transfer via molecular viscosity alone. This suggests that the wind-driven flow contributed to significant mixing in the wetland water column.\n\\end{abstract}\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{article}\n\n\n\n\n\n\n\n\\section{Introduction}\nWetlands are hotspots of biogeochemical transformation, and these transformations can be influenced by the flow of wetland surface waters. For example, flow in wetlands affects the transport of pollen, seeds, and larva \n\\citep{Middleton:2000bt,Ackerman:2002ck,Finelli:2000tm,Fonseca:1996hs}.\nGas transfer at the air--water interface is sensitive to surface flow, and influences both methane and mercury dynamics \\citep{Poindexter:2013kg,Selvendiran:2008wp}.\n\nSeveral wetland-specific transport models have been developed to account for the unique hydrodynamics (including finer features like wake production) brought about by the presence of aquatic vegetation \\citep{WRCR:WRCR8064,White:2003fn,Lightbody:2006vm,WRCR:WRCR11455}. These models describe transport in steady, unidirectional flows driven by gravity or barotropic pressure gradients, e.g., riverine or tidal forcing. There are some wetlands, however, that are isolated from such influences. In those, we expect exchanges with the atmosphere to account for a larger portion of the kinetic energy balance. \nOne important process that can drive surface-water flow in wetlands is thermal convection \\citep{Nepf:1997uo,Jamali:2008cu,Poindexter:2013kg}.  \n\nWind action on uninterrupted water surfaces has been studied to understand waves \\citep{Phillips}, coherent structures \\citep{Shu} and air-water gas exchange \\citep{Chu}.  How these processes change in the presence of vegetation has received little attention to date.  Only \\citep{Bane} has discussed this issue, describing (among other things) the interacting dynamics of waves, turbulence, and water-depth.\n\n\nHere, we investigate the influence of wind on hydrodynamics in wetland field site that is isolated from fluvial and tidal influence.  Previous field studies have shown evidence that wind can penetrate through a canopy to affect wetland surface water: in the Florida Everglades wind was found to correlate with suspended sediment concentrations in sloughs \\citep{Noe:2009kx}; in a Massachusetts salt marsh, where wind caused velocity profiles to deviate from expectations drawn from tidal hydrodynamics \\citep{Lightbody:2006vm}.  \n\nContemporary understanding of the fluid dynamics within vegetation canopies highlights the importance of coherent vortex structures resulting from interactions between canopy elements and the atmospheric boundary layer \\citep{Belcher:2012bw,Nepf:2012ei}. In order to interpret our measurements in the context of these features of canopy turbulence, we make high-temporal-resolution measurements that allow for evaluation of the effects of shear-layer-induced billows and other short-time-scale motions.\n\n\n\\section{Materials and Methods}\n\\subsection{Field Site}\n\nOur study site was a 3-ha marsh located on Twitchell Island in the Sacramento-San Joaquin Delta of Northern California, USA (latitude: 38.1072$^\\circ$ N; longitude: 121.6463$^\\circ$ W), approximately 100 km inland from where the Sacramento-San Joaquin river system terminates in San Francisco Bay. \nLate-nineteenth and early-twentieth century draining of the inland marshes in this region led to oxidation of the peat soil and many areas, including our study site, have subsided meters below sea level \\citep{Rojstaczer:1995cy}. Our study site was used for farming until its restoration by the California Department of Water Resources (CA DWR) and the United States Geological Survey (USGS) in 1997. Small berms were built to isolate the 3-ha parcel and \\textit{Schoenoplectus acutus} (Tule) shoots were planted across approximately 3\\% of the area. \\textit{Typha spp.} (cattail) also colonized significant areas via wind-blown propagules \\citep{Miller:2008th} and by 2006 a canopy of \\textit{Typha spp.} and \\textit{S. acutus} covered 95\\% of the marsh with an average density of 60 stems per square meter \\citep{Miller:2009ju}. This density is on the lower end of naturally-occurring vegetation density, based on a literature survey of wetland plants similar to Tule and Typha \\citep{CPthesis}.  Expressing the density as frontal area per area of wetland footprint, we calculate a nondimensional density of 0.15, which is about half that of the ``sparse'' case studied by \\citep{Bane}.\n\nThe restored marsh is too subsided to receive water directly from the neighboring San Joaquin River, thus the water supply is delivered in a controlled manner by siphoning from the river to inlets located on the southern edge of the marsh. The water depth in the marsh ($h_w=0.25 m$) is maintained by controlling the height of an outflow weir located on the northern edge of the marsh.\n\n\\subsection{Ambient Conditions}\n\nData were recorded between 11:00 and 16:00 on 9 April 2013. The day was selected because of its unusually strong winds, which were consistent over the study period. The atmospheric stability during our experiment was between neutral and slightly unstable (nondimensional atmospheric stability parameter ranged from -0.01 to 0.00, computed from the 5-meter tower discussed below).\n\nDays before the experiment, flow from the two freshwater inlets were shut off, allowing the water level in the marsh to equilibrate with the outlet weir. Thus there should be negligible advection driven by flow into or out of the marsh during our measurement period. \n\nWe deployed measurement equipment at the end of a wooden walkway extending into the interior of the marsh from the southern edge. During the duration of the measurements, the prevailing winds blew from north to south immediately over a 50 m stretch of marsh unobstructed by trees or other landscape features whose wake signatures could interfere with our measurements. \n\nThe plant canopy surrounding our measurement site was comprised primarily of desiccated \\textit{S. acutus} and \\textit{Typha spp.} culms that, on average, reached a height of $h_c=1.75\\pm0.25$ meters above the water surface, making the nondimensional water depth $h_w/h_c=0.125$.  The portions of the culms near the water surface were not observed to move with the wind and direct stirring of the water column by the vegetation was thus unlikely to have contributed significantly to surface water flow.  Similarly, observations by eye indicated no fluctuations in the water surface elevation, suggesting that progressive waves were not present during the study period.\n\nThe surface of the water in the area near the boardwalk was covered with a network of common duckweed (\\textit{Lemna minor}) that was removed prior to our measurements. Surfactants such as biogenic lipids inhibit air-water momentum exchange and were likely present in this highly productive wetland as they are in most biologically active aquatic zones \\citep{Frew:1990jt,McKenna:ul}.\n\n\\subsection{Measurement Equipment}\n\nWe simultaneously measured wind velocity below the top of the canopy and surface water velocity. Wind velocities were measured with a Young Model 81000 triaxial ultrasonic anemometer positioned with its measurement volume $1.35\\pm0.01$ meters above the water surface. The anemometer was fastened atop a frame constructed from t-slotted aluminum extrusions. Water velocity was measured using the Volumetric Particle Imager (VoPI), an optical tool designed in-house to measure fluid velocities outdoor in hard-to-reach environments. Details of the VoPI's inner workings and performance can be found in \\citep{Tse:2013co}, but in brief it is a video recording system designed to record 3D particle tracks within a cubic-centimeter sample volume. The VoPI was fastened to the bottom of the aluminum frame via a 2-axis stage mount that allowed translation along the vertical axis and one horizontal axis. The traversing horizontal axis was defined as the \\textit{x}-axis, which we will refer to as the streamwise direction because it is closely aligned with the mean wind direction. The positive \\textit{x} direction pointed toward $158^\\circ$ magnetic N and the positive \\textit{z}-axis pointed upward. The alignment of the two devices was estimated to have been within $\\pm10$ degrees of one another. A portable marine battery provided power to both the sonic anemometer and the VoPI, with both its camera (Allied Vision Technologies Prosilica GC660) and its light source (Gradient Lens/Ushio Inc. Luxxor 24W LS) receiving 12 volts DC each. Data acquisition and storage for both devices were performed on a single PC, allowing data collection to be synchronized to a single internal clock and providing consistent timestamps for post-processing. For this study, the sonic anemometer collected data at 20 Hz, while the VoPI collected data at 80 Hz. The faster sample rate of the VoPI allowed for improved data resolution by track-smoothing interpolation.\n\nCollaborating scientists from UC Berkeley had previously installed long-term meteorological recording equipment atop a 5-meter tower at the downwind end of the marsh (150 m to the east).  We conducted our within-canopy measurements at the closest accessible location upwind of this tower where the canopy was fully intact.  On the 5-meter tower, a sonic anemometer (Wind Master 1590, Gill Instruments, Lymington, United Kingdom) recorded wind velocity at 10 Hz from a height of 4.7 m. We used this dataset to calculate the statistics of the wind velocity above the vegetation canopy. The canopy structure and other landscape features were qualitatively the same in both wind-measurement locations; thus, we consider it appropriate to use the above-canopy wind measurements to inform our understanding of in-canopy flow behavior.\n\n\\subsection{Data Collection and Processing}\n\nFour 10-minute measurements were collected in total. The first of four measurements, which we call Set A, was made with the distal tip of the VoPI positioned approximately 2 mm below the surface of the water, which was the shallowest depth attainable. The second measurement (Set B) was made with the VoPI positioned 40 mm below the surface at the same horizontal location as Set A. The third measurement (Set C) was made at a depth of 40 mm below the surface, but the VoPI was translated approximately 100 mm north (negative $x$ direction) relative to where the first two measurements were made. The fourth measurement (Set D) was made with the VoPI at the water surface at this new horizontal position. Sets C and D were taken to evaluate horizontal spatial variability.  Given the small size of the VoPI sample volume, there was no blockage by vegetation.\n\nImages recorded by the VoPI were processed using the algorithms and procedures described in Tse and Variano \\citep{Tse:2013co}, giving three-dimensional (3D) positions of suspended particles imaged in each frame. Particle trajectories could then be computed by linking corresponding particles across successive images. Particle-following, or Lagrangian, velocities from each trajectory were computed by numerically differentiating points along particle paths. Lastly, the average of all Lagrangian velocities at each time-step were transformed into the Eulerian velocity time series on which we performed our analysis.  Such averaging is justified by the observation that the variability in velocity across multiple particles at any given time is much less than the variability in velocity at one location over time.  An example movie showing the VoPI images is included as supplementary material.\n\n\\section{Results}\n\nVelocity moment statistics computed from each 10-minute velocity record set are displayed on Tables \\ref{tab:canopy} and \\ref{tab:water}. The steadiness of the wind conditions was evident in the fact that velocity statistics converged well within a 10-minute window. The fourth statistical moment (kurtosis) on the water side has not converged completely, which is to be expected for a distributions with such large kurtosis values. \nFrom Tables \\ref{tab:canopy} and \\ref{tab:water}, we see that while mean in-canopy wind velocities did not change appreciably from set to set, differences in the mean streamwise water velocities between the initial location (Sets A and B) and the second location (Sets C and D) indicate a degree of spatial variability. Although mean water velocities differed between the locations, velocity standard deviations and velocity power spectra (discussed later) remained consistent across all sets. The consistency of the higher moments and the spectral content convinced us that the spatial variability did not affect the fluctuating velocities, which we will later argue are more dynamically important for this system than mean values.\n\nFigure \\ref{fig:pdf} shows the total distribution (with sets A-D combined) of the temporally fluctuating component of air and water velocities measured at each height. The distributions of wind measurements above and within the canopy exhibit noticeable skewness, with the streamwise component skewed positively and vertical component skewed negatively. The water-side velocity, however, was more symmetrically distributed around its mean relative to the air-side velocities. Figure \\ref{fig:quad} shows quandrant plots displaying the density of the combined $u'$-$w'$ correlation measured at the three heights. Streamwise and vertical wind motions were strongly negatively correlated with each other, at locations in and above the canopy. These negative correlations indicate production of turbulent kinetic energy and the vertical transport of horizontal momentum.  Such patterns are typically caused by coherent vortex structures \nthat inject high-momentum fluid downward (``sweeps\") and lift low-momentum fluid upwards (``ejections\") \\citep{pope2000turbulent}. The $u'$-$w'$ correlation was much weaker in the water, suggesting a lack of coherent vortex structures in the vertical-although some of the decorrelation must be attributed to measurement noise inherent to the VoPI itself \\citep{Tse:2013co}. This measurement noise (which is most evident at very low velocities) is random and is strongest in the vertical component due to anisotropy in the stereoscopic reconstruction.\n\nFigure \\ref{fig:rose} shows distributions of horizontal wind and water velocity bearings in polar form. Horizontal water velocities were nearly aligned with the horizontal wind velocities, which was consistent with our assumption that wind was the dominant source of momentum into the wetland waters during the experiment.  The slight offset of approximately 10$^{\\circ}$ between wind and water can be attributed to the instrument misalignment during field deployment discussed in Section 2. Frequent occurrence of flow reversal on the water side was a prominent feature that contrasted with the unidirectional flow observed in the air (in Section 4, we argue that this oscillation is a result of the interaction between the water surface and packets of vortices generated in an upper-canopy shear layer). \n\nWe examined the spectral content of wind and water velocity by computing velocity spectra from the time series data using two different methods. Some VoPI records contained blocks of missing data, so the spectra for the water-side velocity was computed via the Fourier transform of the autocorrelation function. The air-side data did not have gaps and its spectra were directly computed from the time-series. For both methods, we reduce noise by computing spectra over 30, 60 and 90 second subsets of each 10-minute timeseries, and then averaging.  The results were not sensitive to the subset length.  \n\nFigure \\ref{fig:spectra} shows the suite of velocity spectra computed for the three locations.  The spectra typically show peaks, which fall roughly in the range 0.3--0.7 Hz (except for the streamwise velocity peak in figure \\ref{fig:spectra}b).  They are not extremely sharp peaks, and there is noise because of the short velocity timeseries, but the pattern is visible nonetheless.  In section 4 we propose a possible cause of this spectral peak.  It is unlikely that the peak is caused by waves, as no fluctuations in water surface elevation were observed during the measurement period.\n\nCross-correlations between the velocity fluctuations in-canopy and water-side were statistically identical to zero. In fact, no correlation peak emerged even when delays were set between +20 seconds and -20 seconds. This loss of correlation across the air-water interface is in line with the observations of Shaw et al. \\citep{Shaw:1995wd}, who show that velocity correlation between two stationary points within a canopy rapidly decreases with increasing separation distance, especially in the horizontal direction. \n\n\\section{Discussion}\n\\subsection{Canopy Turbulence}\n\nThe flow structure within and just above vegetation canopies is well described using an analytical framework based on the plane mixing-layer, one of the canonical shear flows in turbulence research \\citep{pope2000turbulent}. This ``mixing-layer analogy\" provides an analytical description of velocity measurements and has been corroborated across a large range of canopy species, heights, densities, and even for fully submerged plant canopies \\citep{Raupach:1996cj,Finnigan:2000vi,Ghisalberti:2002do}. The central focus of the mixing-layer framework is its consideration of canopy-scale coherent eddy structures. It states that aerodynamic drag exerted by canopy elements attenuates mean velocities exponentially with depth into the canopy, creating a strong inflection in the velocity profile at the canopy top (see Figure \\ref{fig:profile}). Furthermore, instabilities arising from this profile inflection are mechanistically equivalent to those in classic mixing-layers; thus we expect the wind field around the canopy top to resemble coherent Kelvin-Helmholtz billows. These wind vortices are advected downstream as they form and can penetrate the entire depth of the vegetation canopy, depending on the strength of winds and the density of plant elements \\citep{Finnigan:2000vi}.  These structures also evolve further through inertial instabilities and by interaction with plant stems, leading to a complex set of 3-dimensional coherent structures \\citep{Pancham}. \n\nThe mean streamwise separation between successive eddies ($\\Lambda_{x}$), or streamwise periodicity, represents the length scale of the dominant coherent motions at the canopy scale. Coherent billows can be identified in our velocity measurements by relating $\\Lambda_{x}$ to the peak frequency of the in-canopy velocity spectra seen in Figure \\ref{fig:spectra}. A reasonable prediction for $\\Lambda_{x}$ is made using the relationship: $\\Lambda_{x}/\\delta_{w}\\approx3$--5 (\\citep{Raupach:1996cj}), where $\\delta_{w}$ (the vorticity thickness) can be approximated from $L_{s}$, a characteristic length scale of the velocity profile ($\\delta_{w}\\approx2L_s$). Thus, the following relationship between streamwise periodicity and the shear scale was used, $\\Lambda_{x}\\approx8L_s$ which has performed well across many types of vegetation canopies \\citep{Raupach:1996cj,Finnigan:2000vi}. A basic shear length scale for canopy flows is taken as the time-averaged horizontal velocity at the canopy top ($U(h)$) divided by the shear ($\\partial U/\\partial z$) there:\n\n\n", "index": 1, "text": "\\begin{equation} \\label{eq:Ls}\nL_s=\\frac{U(h)}{\\left.\\frac{\\partial U}{\\partial z}\\right|_{z=h}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{s}=\\frac{U(h)}{\\left.\\frac{\\partial U}{\\partial z}\\right|_{z=h}}\" display=\"block\"><mrow><msub><mi>L</mi><mi>s</mi></msub><mo>=</mo><mfrac><mrow><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>U</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>z</mi></mrow></mfrac><mo fence=\"true\">|</mo></mrow><mrow><mi>z</mi><mo>=</mo><mi>h</mi></mrow></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.07960.tex", "nexttext": "\n\nWhere $\\kappa$ is the von Karman constant ($\\kappa=0.4$). Computed with the fluctuating part of the streamwise ($u'$) and vertical components ($w'$) of wind velocities as $u^\\ast=\\langle u'w'\\rangle ^{\\frac{1}{2}}$, the friction velocity ($u^\\ast=0.9\\pm0.1$ m/s) was measured at the met tower ($z/h=2.6$) because there is less vertical variation in shear stress in a region far removed from the velocity inflection \\citep{Finnigan:2000vi}. The values for the roughness height ($h_0$) and zero-plane displacement ($d$) were fit to the measurement data using $z_0/h\\approx0.1$ and $d/h\\approx0.65$ as initial reference values that were typical for tall crop canopies \\citep{campbell1998introduction}. The best-fit curve in Figure \\ref{fig:profile} was drawn using $z_0/h=0.13$ and $d/h=0.67$ m.  The log-law profile was matched to an exponential profile at an inflection point set exactly at the canopy height.  The exponential profile of mean in-canopy velocity was modeled following \\citep{cionco} as: \n\n\n", "itemtype": "equation", "pos": 21486, "prevtext": "\n\nTo estimate $L_s$ for our data, we employed a simplified model to estimate $U(h)$. Using data from the sonic anemometer within the canopy ($z/h=0.72$) and from the nearby meteorological tower ($z/h=2.6$) as reference points, we modeled the mean velocity above the canopy using:\n\n\n", "index": 3, "text": "\\begin{equation} \\label{eq:Uztop}\nU(z)=\\frac{u^\\ast}{\\kappa}\\ln\\left(\\frac{z-z_0}{d}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"U(z)=\\frac{u^{\\ast}}{\\kappa}\\ln\\left(\\frac{z-z_{0}}{d}\\right)\" display=\"block\"><mrow><mrow><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msup><mi>u</mi><mo>∗</mo></msup><mi>κ</mi></mfrac><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mi>z</mi><mo>-</mo><msub><mi>z</mi><mn>0</mn></msub></mrow><mi>d</mi></mfrac><mo>)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07960.tex", "nexttext": "\n\nWhere $U(h)$ was the mean velocity estimated at $z=h$ using Equation \\ref{eq:Uztop}, and the leaf-area drag ($\\alpha=2.8$) was estimated from previous measurements of crop canopies with similar foliage type and vertical distribution \\citep{campbell1998introduction}. From these curves, we found the shear length scale to be $L_s=0.58$ m, with $U(h)=1.7$ m/s and $\\partial U/\\partial z=2.9$ s$^{-1}$ using Equation \\ref{eq:Ls}. Using the equation $\\Lambda_{x}\\approx8L_s$, we arrived at an estimate of $\\Lambda_{x}\\approx 4.6$ m. The length scale $\\Lambda_{x}$ is related to the peak frequency ($f_p$) on our in-canopy velocity spectra via:\n\n\n", "itemtype": "equation", "pos": 22598, "prevtext": "\n\nWhere $\\kappa$ is the von Karman constant ($\\kappa=0.4$). Computed with the fluctuating part of the streamwise ($u'$) and vertical components ($w'$) of wind velocities as $u^\\ast=\\langle u'w'\\rangle ^{\\frac{1}{2}}$, the friction velocity ($u^\\ast=0.9\\pm0.1$ m/s) was measured at the met tower ($z/h=2.6$) because there is less vertical variation in shear stress in a region far removed from the velocity inflection \\citep{Finnigan:2000vi}. The values for the roughness height ($h_0$) and zero-plane displacement ($d$) were fit to the measurement data using $z_0/h\\approx0.1$ and $d/h\\approx0.65$ as initial reference values that were typical for tall crop canopies \\citep{campbell1998introduction}. The best-fit curve in Figure \\ref{fig:profile} was drawn using $z_0/h=0.13$ and $d/h=0.67$ m.  The log-law profile was matched to an exponential profile at an inflection point set exactly at the canopy height.  The exponential profile of mean in-canopy velocity was modeled following \\citep{cionco} as: \n\n\n", "index": 5, "text": "\\begin{equation} \\label{eq:Uzbot}\nU(z)=U(h)\\exp\\left\\{\\alpha\\left(\\frac{z}{h}-1\\right)\\right\\}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"U(z)=U(h)\\exp\\left\\{\\alpha\\left(\\frac{z}{h}-1\\right)\\right\\}\" display=\"block\"><mrow><mrow><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>{</mo><mrow><mi>α</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mi>z</mi><mi>h</mi></mfrac><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow><mo>}</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07960.tex", "nexttext": "\n\nWhere the expression for advection velocity ($U_{adv}$) was taken from Raupach et al. \\citep{Raupach:1996cj}, who argued that the velocity at which these eddies are traveling through the canopies is underestimated by $U(h)$ and that the true velocity at which billows are advected through a canopy is closer to $U_{adv}\\approx1.8U(h)$. Using Equation \\ref{eq:fp}, we estimated the dominant frequency of the coherent motions to be $f_p\\approx0.7$ Hz, a value consistent with the range of peak frequencies we measured in the canopy and in the water.  \nOne explanation for why the vertical fluctuating in-canopy velocity spectra more closely agrees with predictions from the mixing-layer analogy than the streamwise spectra does is because the length-scales of the vertical motions are more directly linked to the unique dynamics determined by the canopy geometry, while horizontal velocities are heavily influenced by large-scale atmospheric events that may not be involved in canopy-scale transport \\citep{Raupach:1996cj}.\n\n\\subsection{Water-side Motions}\n\nWind-induced momentum flux across an air-water interface under wave-free conditions depends on the shear stress at the interface. In open water environments, i.e., lakes and open seas, where the atmospheric boundary layer above the interface is turbulent and takes on the classic logarithmic profile, scientists typically estimate shear stress using mean wind velocities measured at the height of 10 meters above sea level ($U_{10}$) \\citep{thorpe2005turbulent}. However, given our data and the mixing-layer analogy, in a dense vegetation canopy the average free-stream velocity above the canopy poorly represents the dynamics of the airflow just above the air-water interface. Specifically, the periodic nature of water motions cannot be predicted by above-canopy winds except through the scaling arguments presented earlier in the discussion.\n\nTwo connections between water velocities and in-canopy wind velocities strongly support an interfacial momentum transfer model based on canopy turbulence. First, the spectral peak in the streamwise velocity of the water is aligned with the spectral peaks in the in-canopy spectra (Figure \\ref{fig:spectra} panels a--c). Given the cross-sectional dimension of the aluminum frames and the average in-canopy wind speeds, potentially obscurant velocity perturbations caused by vortex shedding off of the measurement equipment should appear at frequencies of roughly 30 Hz, which is much higher than those seen in Figure \\ref{fig:spectra}. \nAbsent other drivers of momentum exchange, the alignment in the spectral peaks of both air and water suggest Kelvin-Helmholtz billows were directly responsible for the motions measured in the water.  The second connection we observe between water velocities and in-canopy wind is a strong correlation in the temporal pattern of velocity variance. This is related to the observation that water velocities showed episodic bursts of high-amplitude fluctuations. Such behavior is seen in Figure \\ref{fig:var1}, which is a time-series of velocity variance computed over a running 5-second window. The results show several instances of high-energy events (high velocity variance) that appear concurrently in both air and water. The similarities of both the onset and duration of these events suggest they may be triggered by the same billow events. We quantify the co-occurrence of high-variance events in air and water by calculating the cross-correlation of the variance time-series (Figure \\ref{fig:var2}). \nThe velocity variance was well correlated across the air-water interface regardless of the size of the averaging window, which we varied from 1 to 10 seconds. The strength of the correlation is quite remarkable, given that velocity time-series rapidly decorrelate with distance inside a plant canopy. In contrast, we find that the velocity variance remains well correlated across 1.35 m of height and the air-water interface. The difference in these two correlation behaviors suggests that billows transport bursts of high-energy motion through the plant canopy and into the water column, but that the detailed kinematic expression of the billow changes rapidly through space as it interacts with the vegetation canopy.\n\nFrom Figure \\ref{fig:var2}, we can also see that the correlation peaks for Sets A and B occur at bigger lag times than those from Sets C and D, suggesting that lags in response time depend more on horizontal location than on water depth. While we do not have a compelling explanation for this observation, we do observe a similar dichotomy in the mean velocities between the first (A and B) and second (C and D) horizontal locations. This dependence on horizontal position may be a consequence of the interaction of wind with the heterogeneous distribution of plant elements.  The fact that horizontal variation adds nuance to the atmosphere-water coupling, but does not affect the magnitude of velocity variance correlations, lends further support to our hypothesis of billow-driven momentum transport across the air-water interface.\n\n\\subsection{Stirring in the water column}\nPoindexter and Variano's laboratory measurements of interfacial gas transfer velocities showed that under high wind conditions (i.e., in-canopy windspeed of 1 m/s), wind-driven stirring caused air-water exchanges similar in magnitude to typical nighttime thermal convection \\citep{Poindexter:2013kg} . We directly confirmed their result here by showing that the velocity scale (which was most appropriately the velocity variance in our case) in the surface waters of a canopied wetland on a very windy day was similar to convective velocity scales associated with thermal convection driven by a water column heat loss rate of $q=-200$ W/m$^2$. In such a case, the convective velocity scale $w^\\ast=(Bh)^{\\frac{1}{3}}$, where $B$ is the buoyancy production and $h$ the water depth, is on the order of $1\\times10^{-3}$ ms$^{-1}$, the same order of magnitude as the velocity variance observed here (see Table \\ref{tab:water}).  Our data also indicate, however, that the water-column motions responsible for stirring look very different than turbulence.\n\nThe Lagrangian particle trajectories from the VoPI indicate that the water flow did not exhibit any of the characteristic motions of turbulence, such as multiple timescales and curved pathlines. Moreover, the dominant motions were also confined to a narrow frequency range in contrast with the wide range of time scales characteristic of fully developed turbulence.  \n\nThe trajectories also did not show evidence of progressive wave motion, which supports the observed lack of water surface fluctuations.  Interestingly, the video measurements did show particles undergoing back-and-forth motions, but there was usually only one cycle, not a continuous oscillation.  That is, the motions appear more like solitary waves than a wave train. We consider that this motion is a response to billows and related coherent structures, rather than progressive waves.\n\nAlthough the energy flux into the water was insufficient to produce turbulence in this case, the flow patterns we measured were nevertheless capable of mixing and transport. For instance, cyclic water motion will affect the wake region around stems, where high surface divergence causes a local peak in scalar transport across the air-water interface \\citep{Turney:2005tr,Poindexter:2013kg}.\n\nAdditional evidence that the wind-driven velocity fluctuations contributed to mixing in the water column can be seen by considering Stokes' second problem, which analytically describes the steady-state motion of an infinite body of fluid driven solely by an infinitely expansive flat surface at one boundary executing sinusoidal oscillations parallel to that interface. The solution to the governing equation shows that the extent of the momentum transfer is confined within a thin layer of depth $\\delta\\approx4\\sqrt{\\nu/\\omega}$ adjacent to the interface, where $\\nu$ is the kinematic viscosity and $\\omega$ is the oscillation frequency of the interface \\citep{kundu2012fluid}. Given an interfacial forcing frequency of 0.7 Hz (the peak of the in-canopy wind spectrum), Stokes' solution predicts a surface layer penetration depth of only 2 mm. In contrast, water-side variance was coupled with air-side variances at least down to 4 cm. This thicker layer suggests that the water column motion caused by the billows facilitated momentum transport at a rate faster than by viscosity alone.  Using Stokes' solution, we can estimate an Eddy viscosity of 5 cm$^2$/s during the observation period.\n\nConsidering the above, we conclude that stirring near the water surface is (a) strong enough to influence biogeochemical budgets and (b) cause primarily by transfer of momentum from above the canopy, through the air in the canopy, and across the surface via shear.  That is, neither waving plants nor progressive waves on the surface are strong contributors to surface water motion at the study site under the study conditions.\n\n\\section{Conclusion}\n\nHere, we present the first field \n\nmeasurement of wind-driven momentum transfer across the air-water interface within a wetland with emergent vegetation. The study was conducted on a single day with interesting atmospheric conditions, i.e. strong winds and neutral atmospheric stability.  \n\nSimultaneous measurements of in-canopy wind velocities using a sonic anemometer and surface water velocities using a 3D particle-tracking camera revealed that canopy-scale eddies not only dominate the dynamics of airflow within the plant canopy but also the dynamics of the surface water beneath the canopy. The transport of momentum from the atmosphere to the water column was mediated by the dynamics of canopy turbulence, meaning that the conventional relationship relating the interfacial momentum flux to the average free-stream windspeed is an insufficient description when in the presence of a dense vegetation canopy. The mixing-layer analogy, which describes the airflow within and just above a terrestrial plant canopy as being characterized by billow structures borne from instabilities, can be used to predict the dominant scales of motion transferred across the air-water interface. Our measurements showed that under strong, persistent wind forcing, surface waters oscillated at a range of frequencies, but with a distinct peak at the same frequency the streamwise periodicity of the canopy-scale billows. These wind-driven water motions can carry momentum deeper into the water column than viscous transport alone, and augment scalar transport at the air-water interface.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{acknowledgments}\nSupport from the UC Berkeley department of Civil and Environmental Engineering allowed IT and CP to conduct these measurements, thereby overlapping their PhD dissertation projects.  Further analyses by CP were supported by California State University, Sacramento.  Two anonymous reviewers provided comments that improved the manuscript and analysis.  Data is available upon request from variano@berkeley.edu.\n\\end{acknowledgments}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{32}\n\\providecommand{\\natexlab}[1]{#1}\n\\expandafter\\ifx\\csname urlstyle\\endcsname\\relax\n  \\providecommand{\\doi}[1]{doi:\\discretionary{}{}{}#1}\\else\n  \\providecommand{\\doi}{doi:\\discretionary{}{}{}\\begingroup\n  \\urlstyle{rm}\\Url}\\fi\n\n\\bibitem[{\\textit{Ackerman}(2002)}]{Ackerman:2002ck}\nAckerman, J.~D. (2002), {Diffusivity in a marine macrophyte canopy:\n  implications for submarine pollination and dispersal}, \\textit{Am. J. Bot.},\n  \\textit{89}(7), 1119--1127, \\doi{10.3732/ajb.89.7.1119}.\n\n\\bibitem[{\\textit{Banerjee et~al.}(2015)}]{Bane}\nBanerjee, T., Muste, M., and Katul, G. (2015), {Flume experiments on wind induced flow in static water bodies in the presence of protruding vegetation}, \\textit{Advances in Water Resources}, \\textit{76}, 11--28,\n\\doi{10.1016/j.advwatres.2014.11.010}.\n\n\\bibitem[{\\textit{Belcher et~al.}(2012)\\textit{Belcher, Harman, and\n  Finnigan}}]{Belcher:2012bw}\nBelcher, S.~E., I.~N. Harman, and J.~J. Finnigan (2012), {The Wind in the\n  Willows: Flows in Forest Canopies in Complex Terrain}, \\textit{Annu. Rev.\n  Fluid Mech.}, \\textit{44}(1), 479--504,\n  \\doi{10.1146/annurev-fluid-120710-101036}.\n\n\\bibitem[{\\textit{Campbell and Norman}(1998)}]{campbell1998introduction}\nCampbell, G.~S., and J.~M. Norman (1998), \\textit{{An Introduction to\n  Environmental Biophysics}}, Modern Acoustics and Signal, 2nd ed., Springer,\n  New York.\n\n\\bibitem[{\\textit{Chu and Jirka}(2003)}]{Chu}\nChu, C. R. and Jirka, G. H. (2003), {Wind and Stream Flow Induced Reaeration}, \\textit{Journal of Environmental Engineering}, \\textit{129}(12), 1129--1136.\n\n\\bibitem[{\\textit{Cionco}(1972)}]{cionco}\nCionco, R.~M. (1972), {A Wind Profile Index for Canopy Flow}, \\textit{Boundary Layer Meteorology}, \\textit{3}, 255--263.\n\n\\bibitem[{\\textit{Finelli}(2000)}]{Finelli:2000tm}\nFinelli, C.~M. (2000), {Velocity and concentration distributions in turbulent\n  odor plumes in the presence of vegetation mimics: a flume study}, \\textit{Mar\n  Ecol-Prog Ser}, \\textit{207}, 297--309.\n\n\\bibitem[{\\textit{Finnigan}(2000)}]{Finnigan:2000vi}\nFinnigan, J.~J. (2000), {Turbulence in plant canopies}, \\textit{Annu. Rev.\n  Fluid Mech.}, \\textit{32}, 519--571, \\doi{10.1146/annurev.fluid.32.1.519}.\n\n\\bibitem[{\\textit{Fonseca and Hart}(1996)}]{Fonseca:1996hs}\nFonseca, D.~M., and D.~D. Hart (1996), {Density-Dependent Dispersal of Black\n  Fly Neonates Is Mediated by Flow}, \\textit{Oikos}, \\textit{75}(1), 49--58,\n  \\doi{10.2307/3546320}.\n\n\\bibitem[{\\textit{Frew et~al.}(1990)\\textit{Frew, Goldman, Dennett, and\n  Johnson}}]{Frew:1990jt}\nFrew, N.~M., J.~C. Goldman, M.~R. Dennett, and A.~S. Johnson (1990), {Impact of\n  phytoplankton-generated surfactants on air-sea gas exchange}, \\textit{J\n  Geophys Res-Oceans}, \\textit{95}(C3), 3337--3352,\n  \\doi{10.1029/JC095iC03p03337}.\n\n\\bibitem[{\\textit{Ghisalberti and Nepf}(2002)}]{Ghisalberti:2002do}\nGhisalberti, M., and H.~M. Nepf (2002), {Mixing layers and coherent structures\n  in vegetated aquatic flows}, \\textit{J Geophys Res-Oceans}, \\textit{107}(C2),\n  3--1--3--11, \\doi{10.1029/2001JC000871}.\n\n\\bibitem[{\\textit{Huang et~al.}(2008)\\textit{Huang, Saiers, Harvey, Noe, and\n  Mylon}}]{WRCR:WRCR11455}\nHuang, Y.~H., J.~E. Saiers, J.~W. Harvey, G.~B. Noe, and S.~Mylon (2008),\n  {Advection, dispersion, and filtration of fine particles within emergent\n  vegetation of the Florida Everglades}, \\textit{Water Resour Res},\n  \\textit{44}(4), W04,408, \\doi{10.1029/2007WR006290}.\n\n\\bibitem[{\\textit{Jamali et~al.}(2008)\\textit{Jamali, Zhang, and\n  Nepf}}]{Jamali:2008cu}\nJamali, M., X.~Zhang, and H.~M. Nepf (2008), {Exchange flow between a canopy\n  and open water}, \\textit{J Fluid Mech}, \\textit{611}, 237--254,\n  \\doi{10.1017/S0022112008002796}.\n\n\\bibitem[{\\textit{Kundu et~al.}(2012)\\textit{Kundu, Cohen, and\n  Dowling}}]{kundu2012fluid}\nKundu, P.~K., I.~M. Cohen, and D.~R. Dowling (2012), \\textit{{Fluid\n  Mechanics}}, Academic Press, Academic Press.\n\n\\bibitem[{\\textit{Lightbody and Nepf}(2006)}]{Lightbody:2006vm}\nLightbody, A.~F., and H.~M. Nepf (2006), {Prediction of velocity profiles and\n  longitudinal dispersion in emergent salt marsh vegetation}, \\textit{Limnol.\n  Oceanogr.}, \\textit{51}(1), 218--228, \\doi{10.4319/lo.2006.51.1.0218}.\n\n\\bibitem[{\\textit{McKenna and McGillis}(2004)}]{McKenna:ul}\nMcKenna, S.~P., and W.~R. McGillis (2004), {The role of free-surface turbulence\n  and surfactants in air--water gas transfer}, \\textit{Int J Heat Mass Tran},\n  \\textit{47}(3), 539--553, \\doi{10.1016/j.ijheatmasstransfer.2003.06.001}. \n\n\\bibitem[{\\textit{Middleton}(2000)}]{Middleton:2000bt}\nMiddleton, B. (2000), {Hydrochory, Seed Banks, and Regeneration Dynamics along\n  the Landscape Boundaries of a Forested Wetland}, \\textit{Plant Ecol},\n  \\textit{146}(2), 167--181, \\doi{10.1023/A:1009871404477}.\n\n\\bibitem[{\\textit{Miller and Fujii}(2010)}]{Miller:2009ju}\nMiller, R.~L., and R.~Fujii (2010), {Plant community, primary productivity, and\n  environmental conditions following wetland re-establishment in the\n  Sacramento-San Joaquin Delta, California}, \\textit{Wetlands Ecol Manage},\n  \\textit{18}(1), 1--16, \\doi{10.1007/s11273-009-9143-9}.\n\n\\bibitem[{\\textit{Miller et~al.}(2008)\\textit{Miller, Fram, Fujii, and\n  Wheeler}}]{Miller:2008th}\nMiller, R.~L., M.~Fram, R.~Fujii, and G.~Wheeler (2008), {Subsidence Reversal\n  in a Re-established Wetland in the Sacramento-San Joaquin Delta, California,\n  USA}, \\textit{San Franc. Estuary Watershed Sci.}, \\textit{6}(3).\n\n\\bibitem[{\\textit{Nepf}(1999)}]{WRCR:WRCR8064}\nNepf, H.~M. (1999), {Drag, turbulence, and diffusion in flow through emergent\n  vegetation}, \\textit{Water Resour Res}, \\textit{35}(2), 479--489,\n  \\doi{10.1029/1998WR900069}.\n\n\\bibitem[{\\textit{Nepf}(2012)}]{Nepf:2012ei}\nNepf, H.~M. (2012), {Flow and Transport in Regions with Aquatic Vegetation},\n  \\textit{Annu. Rev. Fluid Mech.}, \\textit{44}(1), 123--142,\n  \\doi{10.1146/annurev-fluid-120710-101048}.\n\n\\bibitem[{\\textit{Nepf and Oldham}(1997)}]{Nepf:1997uo}\nNepf, H.~M., and C.~E. Oldham (1997), {Exchange dynamics of a shallow\n  contaminated wetland}, \\textit{Aquat. Sci.}, \\textit{59}(3), 193--213,\n  \\doi{10.1007/BF02523273}.\n\n\\bibitem[{\\textit{Noe et~al.}(2009)\\textit{Noe, Harvey, Schaffranek, and\n  Larsen}}]{Noe:2009kx}\nNoe, G.~B., J.~W. Harvey, R.~W. Schaffranek, and L.~G. Larsen (2009), {Controls\n  of Suspended Sediment Concentration, Nutrient Content, and Transport in a\n  Subtropical Wetland}, \\textit{Wetlands}, \\textit{30}(1), 39--54,\n  \\doi{10.1007/s13157-009-0002-5}.\n\n\\bibitem[{\\textit{Pan et~al.}(2014)}]{Pancham}\nPan, Y. Chamecki, M. and Isard, S. A. (2014), {Large-eddy simulation of turbulence and particle dispersion inside the canopy roughness sublayer.}, \\textit{J Fluid Mech}, \\textit{753},\n  499--534, \\doi{10.1017/jfm.2014.379}.\n\n\n\\bibitem[{\\textit{Phillips}(1966)}]{Phillips}\nPhillips, O.~M. (1966), \\textit{{The Dynamics of the Upper Ocean}}, Cambridge University Press.\n\n\\bibitem[{\\textit{Poindexter and Variano}(2013)}]{Poindexter:2013kg}\nPoindexter, C.~M., and E.~A. Variano (2013), {Gas exchange in wetlands with\n  emergent vegetation: The effects of wind and thermal convection at the\n  air-water interface}, \\textit{J Geophys Res-Bio}, \\textit{118}(3),\n  1297--1306, \\doi{10.1002/jgrg.20099}.\n\n\\bibitem[{\\textit{Poindexter}(2014)}]{CPthesis}\nPoindexter, C.~P. (2014), \\textit{{Wetland water flows and interfacial gas exchange}}, Doctoral Thesis, University of California.  \n\n\\bibitem[{\\textit{Pope}(2000)}]{pope2000turbulent}\nPope, S.~B. (2000), \\textit{{Turbulent Flows}}, Cambridge University Press.\n\n\\bibitem[{\\textit{Raupach et~al.}(1996)\\textit{Raupach, Finnigan, and\n  Brunet}}]{Raupach:1996cj}\nRaupach, M.~R., J.~J. Finnigan, and Y.~Brunet (1996), {Coherent eddies and\n  turbulence in vegetation canopies: The mixing-layer analogy},\n  \\textit{Hydrobiologia}, \\textit{78}(3-4), 351--382, \\doi{10.1007/BF00120941}.\n\n\\bibitem[{\\textit{Rojstaczer and Deverel}(1995)}]{Rojstaczer:1995cy}\nRojstaczer, S., and S.~J. Deverel (1995), {Land Subsidence in Drained Histosols\n  and Highly Organic Mineral Soils of California}, \\textit{Soil Sci. Soc. Am.\n  J.}, \\textit{59}(4), 1162--1167,\n  \\doi{10.2136/sssaj1995.03615995005900040031x}.\n\n\\bibitem[{\\textit{Selvendiran et~al.}(2008)\\textit{Selvendiran, Driscoll,\n  Bushey, and Montesdeoca}}]{Selvendiran:2008wp}\nSelvendiran, P., C.~T. Driscoll, J.~T. Bushey, and M.~R. Montesdeoca (2008),\n  {Wetland influence on mercury fate and transport in a temperate forested\n  watershed}, \\textit{Environ. Pollut.}, \\textit{154}(1), 46--55,\n  \\doi{10.1016/j.envpol.2007.12.005}.\n\n\\bibitem[{\\textit{Shaw et~al.}(1995)\\textit{Shaw, Brunet, Finnigan, and\n  Raupach}}]{Shaw:1995wd}\nShaw, R.~H., Y.~Brunet, J.~J. Finnigan, and M.~R. Raupach (1995), {A wind\n  tunnel study of air flow in waving wheat: two-point velocity statistics},\n  \\textit{Bound-Lay. Meteorol.}, \\textit{76}(4), 349--376,\n  \\doi{10.1007/BF00709238}.\n\n\n\n\\bibitem[{\\textit{Shuangfeng et al.}(1999)}]{Shu}\nShuangfeng, W. Fu, J. Zhennan, N. and Zhangzhi, W. (1999), {An experimental study on turbulent coherent structures near a sheared air-water interface},\n  \\textit{Acta Mechanica Sinica}, \\textit{15}(4), 289--298.\n  \\doi{10.1007/BF02487927}.\n  \n\n\\bibitem[{\\textit{Thorpe}(2005)}]{thorpe2005turbulent}\nThorpe, S.~A. (2005), \\textit{{The Turbulent Ocean}}, Cambridge University\n  Press.\n\n\\bibitem[{\\textit{Tse and Variano}(2013)}]{Tse:2013co}\nTse, I.~C., and E.~A. Variano (2013), {Lagrangian measurement of fluid and\n  particle motion using a field-deployable Volumetric Particle Imager (VoPI)},\n  \\textit{Limnol. Oceanogr.-Meth.}, \\textit{11}, 225--238,\n  \\doi{10.4319/lom.2013.11.225}.\n\n\\bibitem[{\\textit{Turney et~al.}(2005)\\textit{Turney, Smith, and\n  Banerjee}}]{Turney:2005tr}\nTurney, D.~E., W.~C. Smith, and S.~Banerjee (2005), {A measure of\n  nearâ\u0080\u0090surface fluid motions that predicts airâ\u0080\u0090water gas transfer in a wide\n  range of conditions}, \\textit{Geophys Res Lett}, \\textit{32}(4),\n  \\doi{10.1029/2004GL021671}.\n\n\\bibitem[{\\textit{White and Nepf}(2003)}]{White:2003fn}\nWhite, B.~L., and H.~M. Nepf (2003), {Scalar transport in random cylinder\n  arrays at moderate Reynolds number}, \\textit{J Fluid Mech}, \\textit{487},\n  43--79, \\doi{10.1017/S0022112003004579}.\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\\end{article}\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=0.8]{p00}\n\\caption{Schematic diagram of key site features and measurement locations.  Not shown is a second anemometer 4.5 m above the water surface and 150 m downwind.}\n\\label{fig:schematic}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1.5]{p01}\n\\caption{Empirical probability density functions (PDF) of streamwise (\\textit{u}) and vertical (\\textit{w}) velocity fluctuations normalized by corresponding velocity standard deviations ($\\sigma$). (a,b) Above-canopy wind. (c,d) In-canopy wind. (e,f) Surface water.}\n\\label{fig:pdf}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=0.2]{p02}\n\\caption{Quadrant plot of the relative density of the $u'$-$w'$ correlation. (a) Above-canopy wind. (b) In-canopy wind. (c) Surface water. Data for (b,c) are combined from Sets A-D for in-canopy and surface water respectively. Colors correspond to the relative frequency of velocity correlations, where red is frequent occurrence and blue is near zero occurrence.}\n\n\\label{fig:quad}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1]{p03}\n\\caption{Empirical probability density of horizontal velocity headings of both wind and water in polar coordinates. (a) Above-canopy wind. (b) In-canopy wind. (c) Surface water. Data for (b,c) are combined from Sets A-D for in-canopy and surface water respectively. Dashed line indicates the orientation of the streamwise axis-coordinate (\\textit{x}-axis) with respect to the cardinal directions, chosen to maximize U and minimize V.  The total areas of the blue bars are equivalent.}\n\\label{fig:rose}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1.2]{p04}\n\\caption{Velocity spectra for the streamwise ($fS_{uu}$, blue) and vertical ($fS_{ww}$, red) fluctuating velocities, compensated by the frequency so that units are $m^2/s^2$. \n(a) Above-canopy wind. (b) In-canopy wind. (c) Surface water. Data for (b,c) are combined from Sets A-D for in-canopy and surface water respectively. Shaded region on each panel indicates an approximate location of the broad peaks seen in some of these spectra.} \n\\label{fig:spectra}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1.2]{p05}\n\\caption{Vertical profile of streamwise velocity computed from Equations \\ref{eq:Uztop} and \\ref{eq:Uzbot}. (a) Non-normalized profile. (b) Normalized profile: vertical position (\\textit{z}) normalized by canopy height (\\textit{h}) and velocity (\\textit{U}) is normalized by the estimated velocity at canopy height ($U(h)$). Broken lines indicate the top of the canopy ($h=1.75$ m). Blue markers are mean streamwise wind velocities from in-canopy data Sets A-D (Table \\ref{tab:canopy}) and from above-canopy data collected at the 5-meter tower measurements (Table \\ref{tab:water}).}\n\\label{fig:profile}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1.2]{p06}\n\\caption{Velocity variance computed with a 5-second moving window ($N=100$) on a 5-minute segment from measurement Set C. (a) Streamwise ($u'$) and vertical ($w'$) in-canopy wind velocity variances. (b) Streamwise ($u'$) surface water velocity variance. Dotted lines indicate several instances of high correlation between the variance measurements of in-canopy and surface water velocities.}\n\\label{fig:var1}\n\\end{figure}\n\n\\begin{figure}[h] \n\\centering\n\\includegraphics[scale=1]{p07}\n\\caption{Correlation coefficient of running velocity variance values as a function of time lag. Panels (a-d) correspond to the measurement Sets (A-D) respectively. Each curve corresponds to different window sizes: blue corresponds to a 1 second window ($N=20$), cyan to a 2 second window ($N=40$), magenta to a 5 second window ($N=100$), red to a 10 second window ($N=200$).}\n\\label{fig:var2}\n\\end{figure}\n\n\n\\noindent\n\\begin{table}[h]\n\\begin{tabularx}{\\textwidth}{l | X X X | X X X | X X X | X X X }\n\\hline\n\t& \\multicolumn{3}{c}{Mean [m/s]} & \\multicolumn{3}{c}{Std. Dev. [m/s]} & \\multicolumn{3}{c}{Skewness [-]} & \\multicolumn{3}{c}{Kurtosis [-]} \\\\\n\t& U & V & W & U & V & W & U & V & W & U & V & W \\\\\n\\hline\n\tSet A & 0.81 & -0.21 & 0.16 & 0.66 & 0.57 & 0.41 & 0.87 & -0.85 & -0.33 & 4.3 & 6.3 & 4.7 \\\\\n\tSet B & 0.72 & -0.13 & 0.22 & 0.65 & 0.53 & 0.40 & 1.10 & -0.67 & -0.53 & 5.7 & 4.8 & 4.6 \\\\\n\tSet C & 0.80 & -0.21 & 0.18 & 0.66 & 0.57 & 0.41 & 0.83 & -0.72 & -0.22 & 5.2 & 5.6 & 4.5 \\\\\t\t\n\tSet D & 0.73 & -0.14 & 0.20 & 0.64 & 0.56 & 0.40 & 1.10 & -0.73 & -0.38 & 5.2 & 5.4 & 4.4 \\\\ \n\\hline\n\\end{tabularx}\n\\caption{Velocity moments measured by sonic anemometer within vegetation canopy of each orthogonal component of wind velocities for Sets A-D. \\label{tab:canopy}}\n\\end{table}\n\n\\noindent\n\\begin{table}[h]\n\\begin{tabularx}{\\textwidth}{l | X X X | X X X | X X X | X X X }\n\\hline\n\t& \\multicolumn{3}{c}{Mean [$10^{-3}$ m/s]} & \\multicolumn{3}{c}{S.D. [$10^{-3}$ m/s]} & \\multicolumn{3}{c}{Skewness [-]} & \\multicolumn{3}{c}{Kurtosis [-]} \\\\\n\t& U & V & W & U & V & W & U & V & W & U & V & W \\\\\n\\hline\n\tSet A & 3.7 & 0.30 & 3.5 & 0.85 & 0.49 & 0.69 & -0.44 & -0.13 & 0.86 & 5.2 & 5.8 & 32 \\\\\n\tSet B & 1.1 & 0.19 & 4.6 & 0.93 & 0.50 & 1.0 & -0.13 & 0.08 & 2.1 & 4.0 & 10 & 84 \\\\\n\tSet C & -1.5 & -0.70 & 4.0 & 0.92 & 0.75 & 1.3 & -0.63 & 2.4 & 0.63 & 6.8 & 172 & 77 \\\\\n\tSet D & -0.53 & 0.14 & 2.6 & 0.98 & 0.82 & 1.7 & -0.74 & 0.82 & -2.9 & 12 & 16 & 143 \\\\\t \n\\hline\n\\end{tabularx}\n\\caption{Velocity moments measured by the VoPI inside the water column of each orthogonal component of water velocities for Sets A-D.  \\label{tab:water}}\n\\end{table}\n\n\n\n", "itemtype": "equation", "pos": 23350, "prevtext": "\n\nWhere $U(h)$ was the mean velocity estimated at $z=h$ using Equation \\ref{eq:Uztop}, and the leaf-area drag ($\\alpha=2.8$) was estimated from previous measurements of crop canopies with similar foliage type and vertical distribution \\citep{campbell1998introduction}. From these curves, we found the shear length scale to be $L_s=0.58$ m, with $U(h)=1.7$ m/s and $\\partial U/\\partial z=2.9$ s$^{-1}$ using Equation \\ref{eq:Ls}. Using the equation $\\Lambda_{x}\\approx8L_s$, we arrived at an estimate of $\\Lambda_{x}\\approx 4.6$ m. The length scale $\\Lambda_{x}$ is related to the peak frequency ($f_p$) on our in-canopy velocity spectra via:\n\n\n", "index": 7, "text": "\\begin{equation} \\label{eq:fp}\nf_p=\\frac{U_{adv}}{\\Lambda_x}\\approx\\frac{1.8U(h)}{\\Lambda_x}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"f_{p}=\\frac{U_{adv}}{\\Lambda_{x}}\\approx\\frac{1.8U(h)}{\\Lambda_{x}}\" display=\"block\"><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>=</mo><mfrac><msub><mi>U</mi><mrow><mi>a</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>v</mi></mrow></msub><msub><mi mathvariant=\"normal\">Λ</mi><mi>x</mi></msub></mfrac><mo>≈</mo><mfrac><mrow><mn>1.8</mn><mo>⁢</mo><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi mathvariant=\"normal\">Λ</mi><mi>x</mi></msub></mfrac></mrow></math>", "type": "latex"}]