[{"file": "1601.02389.tex", "nexttext": "\nIn the ray-tracing method one takes into account only those photon trajectories \nreaching the observer's sky plane. An observer's sky plane is divided into a \nnumber of small elements (pixels), and for each pixel the photon trajectories \nare traced backward from the observer by following the geodesics in a Kerr \nspace-time, until their intersection with the disk. We assumed  \nan optically thick and geometrically thin disk for which the spectrum of emitted\nradiation  depends on its structure, and therefore on the distance to the \ncentral SMBH \\citep{sha73}. Thus, assuming that disk radiates according to an\nemissivity law $\\varepsilon \\left( {r} \\right)$, for each pixel at observer's \nsky plane it is possible to calculate the flux density and the energy shift $g$ \nof the photons emitted by the disk \\citep[see][for more details]{jov12}. \nUsually, a power law for disk emissivity is assumed: \n$\\varepsilon\\left(r\\right)\\propto r^{-q}$, where $q$ is an emissivity index. In \nthat way, one can obtain a simulated image of a relativistic accretion \ndisk as would be seen by a distant observer using a powerful high resolution \ntelescope. An example of such simulated image of a relativistic accretion disk \nis presented in Fig. \\ref{fig:disk}, where  $R_g=GM/c^2$ is the gravitational \nradius of the central SMBH with mass $M$ ($G$ being gravitational \nconstant and $c$ speed of light), and $R_{ms}$ represents the radius of the \nmarginally stable orbit which depends on spin $a$ of the SMBH.\n\nThe corresponding simulated profile of the line emitted from the simulated \naccretion disk can be calculated by taking into account the total \nobserved flux and observed photon energies of all pixels over the disk image:\n\n", "itemtype": "equation", "pos": 8208, "prevtext": "\n\\title{Line shifts in accretion disks - the case of Fe K$\\alpha$}\n\\shorttitle{Line shifts in accretion disks}\n\\shortauthors{Jovanovi\\'{c} et al.}\n\n\\author{P. Jovanovi\\'{c}} \n\\email{pjovanovic@aob.rs}\n\\affil{Astronomical Observatory, Volgina 7, P.O. Box 74 11060 Belgrade, Serbia}\n\\and \n\\author{V. Borka Jovanovi\\'{c}}\n\\email{vborka@vinca.rs}\n\\and\n\\author{D. Borka}\n\\email{dusborka@vinca.rs@vinca.rs}\n\\affil{Atomic Physics Laboratory (040), Vin\\v{c}a Institute of Nuclear \nSciences, University of Belgrade, P.O. Box 522, 11001 Belgrade, Serbia}\n\\and\n\\author{L. \\v C. Popovi{\\'c}}\n\\email{lpopovic@aob.rs}\n\\affil{Astronomical Observatory, Volgina 7, P.O. Box 74 11060 Belgrade, Serbia}\n\n\\begin{abstract}\nHere we present a short overview and main results of our investigations of \nseveral effects which can induce shifts in the broad Fe K$\\alpha$ line emitted \nfrom relativistic accretion disks around single and binary supermassive black \nholes. We used numerical simulations based on ray-tracing method in the Kerr \nmetric to study the role of classical Doppler shift, special relativistic \ntransverse Doppler shift and Doppler beaming, general relativistic gravitational \nredshift, and perturbations of the disk emissivity in the formation of the \nobserved Fe K$\\alpha$ line profiles. Besides, we also investigated whether the \nobserved line profiles from the binary systems of supermassive black holes could \nbe affected by the Doppler shifts due to dynamics of such systems. \nThe presented results demonstrate that all these effects could have a \nsignificant influence on the observed profiles of the broad Fe K$\\alpha$ line \nemitted from relativistic accretion disks around single and binary supermassive \nblack holes.\n\\end{abstract}\n\n\\keywords{black holes: black-hole binaries; galaxies: active; accretion and \naccretion disks; spectral lines; X-ray emission spectra}\n\n\\section{Introduction}\n\\label{s:intro}\n\nIt is now widely accepted that most galaxies harbor a supermassive black hole \n(SMBH) in their centers and that the formation and evolution of galaxies is \nfundamentally influenced by properties of their central SMBHs \n\\citep[see e.g.][and references therein]{kor13}. Active galaxies \nmost likely represent one phase in galactic evolution, and they derive their \nextraordinary luminosities from energy release by matter accreting towards, and \nfalling into, a central SMBH through a relativistic accretion disk which \nrepresents an efficient mechanism for extracting the gravitational potential \nenergy and converting it into the electromagnetic radiation \\citep[see \ne.g.][and references therein]{jov09,jov12}\n\nSince its discovery in Seyfert 1 galaxy MCG-6-30-15 by \\citet{tan95}, the broad \nFe K$\\alpha$ emission line at 6.4 keV was observed in a number of Active \nGalactic Nuclei (AGNs) \\citep[see e.g.][and reference therein]{nan07}. \nBased on the observations with the X-ray satellites like Ginga, \nASCA, RXTE, BeppoSAX, XMM-Newton, Suzaku and Chandra, the fact that X-ray \nirradiation of the accretion disk surface in a class of AGNs known as Seyfert 1 \ngalaxies gives rise to the fluorescent Fe K$\\alpha$ line emission via the X-ray \nreflection is now well established \\citep[see e.g.][]{fab00}. The broad and \nasymmetric profile of this line with narrow bright ''blue'' and wide faint \n''red'' peak is most commonly attributed to the relativistic effects due to a \nvery fast rotation of the emitting material in the innermost regions of the \naccretion disk \\citep[see e.g.][and references therein]{fab00}, although there \nare some alternative attempts to explain such profile by \nscattering/reflection/absorption by the disk wind and/or ionized outflows which \ncould mimic relativistic effects \\cite[see][and references therein]{tur09}. \nSince this line is emitted from a very compact region in the accretion disk \nnear the central SMBH, it represents a powerful diagnostic tool for studying \nthe effects of strong gravitational field \\citep[see e.g.][]{jov08a}, accretion \nphysics and space-time geometry in the vicinity of SMBHs (see \\citet{jov12} for \nan overview and \\citet{jov11} for a case study).\n\nSo far, the extensive theoretical studies of the line profiles emitted \nfrom relativistic accretion disks around SMBHs have been carried out, in which \nthe line profiles have been modeled using different approaches \\citep[see \ne.g.][for a review]{rey03}. In the weak field limit such line profiles can \nbe evaluated analytically \\citep{chen89a,chen89b}. \\citet{fab89} were the first \nwho calculated the Fe K$\\alpha$ profiles emitted by the accretion disk in the \nSchwarzschild metric. A full general relativistic approach based on ''the \ntransfer-function'' which contains all relativistic effects is also used for \nmodeling relativistically broadened lines \\citep{laor91}. The exact line \nprofiles can be also computed by the direct integration of the photon \ntrajectories in the Kerr metric \\citep{kar92,bro97} which enabled studies of \nthe complex disk models, such as geometrically thick or warped accretion disks \n\\citep{har00} or disks with non-axisymmetric structures in form of spiral arms \n\\citep{kar01}. The standard X-ray spectral fitting code, XSPEC \\citep{arn96} is \noften used for evaluating the general relativistic models of accretion disks \nand simulating the corresponding line profiles \\citep[see e.g.][]{dov04}.\n\nHere we study several phenomena which can induce line shifts, and thus cause \nthe variability of the profile of the Fe K$\\alpha$ line emitted from a \nrelativistic accretion disk around a SMBH, using a code based on\nray-tracing method in the Kerr metric \\citep[see e.g.][and references \ntherein]{cad98,jov12}. This paper is organized as follows: \nin Section \\ref{s:lines} we briefly describe the method used to obtain the \nsimulated line profiles, in Section \\ref{s:shifts} we describe several types of \nline shifts and study different effects which can induce them, and finally in \nSection \\ref{s:conc} we point out our conclusions.\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig1a.eps} \\\\\n\\includegraphics[width=\\columnwidth]{fig1b.eps}\n\\caption{Simulated image of a highly inclined ($i=80^\\circ$) relativistic \naccretion disk in Kerr metric around a SMBH with spin $a=0.5$, colored \naccording to energy shift $g$ (top) and observed flux (bottom). Inner and outer \nradii of the disk are $R_{in}=R_{ms}$ and $R_{out}=20\\ R_g$, respectively and \nits power law emissivity index is $q=-2.5$}\n\\label{fig:disk}\n\\end{figure}\n\n\n\\begin{table*}[ht]\n\\centering\n\\caption{Parameters of the simulated accretion disks, and the intervals \nof energy shift $(g_{min} < g < g_{max})$ over which the corresponding \nsimulated line profiles presented in the Figs. \\ref{fig:out}-\\ref{fig:in} have \nnonzero intensity, as well as the widths of each line bin $\\Delta g$. In all \ncases it is assumed that the disk emissivity follows a power law with \nemissivity index $q=2.5$.}\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\n$R_{in}\\ (R_g)$ &  $R_{out}\\ (R_g)$ &  $i\\ (^\\circ)$ &  $a$ & \n$g_{min}$  & $g_{max}$ & $\\Delta g$ \\\\\n\\hline\n\\hline\n7000 & 8000 & 10 & 0.99 & 0.9985 & 1.0012 & 0.0001 \\\\\n\\hline\n1000 & 2000 & 10 & 0.99 & 0.9935 & 1.0045 & 0.0001 \\\\\n\\hline\n10 & 20 & 35 & 0.01 & 0.72 & 1.10 & 0.01\\\\\n\\hline\n6 & 20 & 35 & 0.01 & 0.60 & 1.10  & 0.01 \\\\\n\\hline\n10 & 20 & 35 & 1 & 0.73 & 1.10 & 0.01 \\\\\n\\hline\n1 & 20 & 35 & 1 & 0.02 & 1.10 & 0.01 \\\\\n\\hline\n\\end{tabular}\n\\label{tab:tab1}\n\\end{table*}\n\n\\section{Simulated line shapes}\n\\label{s:lines}\n\nWe studied the radiation from relativistic accretion disks around SMBHs using \nnumerical simulations based on ray-tracing method in the Kerr metric \n\\citep[see][for more details]{fan97,cad98}, in which we used \nthe pseudo-analytical integration of the geodesic equations describing the \nphoton trajectories in \nthe general case of a rotating SMBH with some angular momentum (spin) $a$.\nDue to several effects which will be discussed below, photons emitted from \na disk at energy $E_{em}$ (or wavelength $\\lambda_{em}$) will be observed at \nenergy $E_{obs}$ (or wavelength $\\lambda_{obs}$) by an observer at infinity, \ncausing the energy shift $g$ or, equivalently, the usual redshift in wavelength \n$z$:\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eqn:shift}\ng=\\dfrac{E_{obs}}{E_{em}}=\\dfrac{\\lambda_{em}}{\\lambda_{obs}}=\\dfrac{1}{1+z}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"g=\\dfrac{E_{obs}}{E_{em}}=\\dfrac{\\lambda_{em}}{\\lambda_{obs}}=\\dfrac{1}{1+z}.\" display=\"block\"><mrow><mrow><mi>g</mi><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><msub><mi>E</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>⁢</mo><msub><mi>E</mi><mrow><mi>e</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msub><mi>λ</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><mn>11</mn></mrow><mo>+</mo><mi>z</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02389.tex", "nexttext": "\nwhere $d\\Xi$ is the solid angle subtended by the disk in the observer's\nsky and $E_{0}$ is the rest energy. Several examples for the simulated line \nprofiles emitted from different regions of the relativistic accretion disks with \ndifferent parameters are given in Figs. \\ref{fig:out}-\\ref{fig:in}.\n\n\\section{Results: Fe K$\\alpha$ line shifts}\n\\label{s:shifts}\n\nIn this section we will discuss several phenomena which can induce shifts in \nthe lines emitted from relativistic accretion disks around SMBHs. \nFor that purpose we simulated the line profiles emitted from different \nregions of accretion disks, which parameters are given in Table \n\\ref{tab:tab1}. In the following paragraphs we describe the obtained results \nin more details. However, one should take into account that some other \nphenomena, such as gravitational microlensing could also induce line shifts \n\\citep[see e.g.][]{pop03a,pop03b,pop06,jov08b,jov09}, but they will not be \ndiscussed here.\n\n\\subsection{Classical Doppler shift due to Keplerian rotation in accretion disk}\n\\label{ss:kepler}\n\nRotation of emitting material in the outermost regions of an accretion disk, \nlocated thousands $R_g$ from the central SMBH, is practically Keplerian since \nthe relativistic effects are negligible at such large distances. Therefore, the \nlines emitted from these regions are broadened depending on Keplerian \nrotational velocity and have two symmetric peaks (see the solid line profile in \nFig. \\ref{fig:out}): the ''blue'' one emitted by the material located on the \nside of the disk which is approaching towards an observer (denoted by blue \nshades in the simulated accretion disk image presented in the top panel of Fig. \n\\ref{fig:disk}), and the ''red'' one, emitted by the material on the receding \nside of the disk with respect to the observer (denoted by red shades in the top \npanel of Fig. \\ref{fig:disk}).\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig2.eps}\n\\caption{Two shapes of the lines emitted from the outer regions of a \nslightly inclined ($i=10^\\circ$) relativistic \naccretion disk around a maximally rotating Kerr SMBH, extending between 7000 \nand \n8000 $R_g$ (solid line) and 1000 and 2000 $R_g$ (dashed line)}\n\\label{fig:out}\n\\end{figure}\n\n\\subsection{Transverse Doppler shift and Doppler beaming due to special \nrelativistic effects}\n\\label{ss:sr}\n\nHowever, in the regions which are located less than a few thousand $R_g$ from\nthe SMBH, the rotational velocities are much higher (on the order of several \nthousand km s$^{-1}$) inducing, not only the wider line shapes, but also the \nspecial relativistic effects which produce an asymmetry in the line shapes by \nshifting the emission from the inner regions of the disk to the ''red'' and \nbeaming its radiation in the direction of motion \\citep[see e.g.][]{fab99}, and \nthus enhancing the ''blue'' peak with respect to the ''red'' one (see the \ndashed line profile in Fig. \\ref{fig:out}). These two special relativistic \neffects are known as transverse Doppler shift and Doppler beaming, respectively.\n\nThe transverse Doppler shift originates when the observer is displaced in a \ndirection perpendicular to the direction of the motion of emitters in \nthe accretion \ndisk, and is a consequence of the relativistic Doppler effect which includes the \ntime dilation. Namely, if in the observer's frame the angle between the \ndirection of the emitter at the time of emission and the observed direction of \nthe light at the time of observation is equal to $\\pi/2$, the relativistic \nDoppler effect reduces to the transverse Doppler shift, due to which the \nobserved radiation from a rapidly rotating accretion disk is redshifted by the \nLorentz factor, as it is the case with the dashed simulated line profile in \nFig. \\ref{fig:out}.\n\nDoppler beaming (boosting) modifies the apparent brightness of the rapidly \nmoving emitting matter in the sense that, if it is moving towards the observer \nthen it will appear brighter than if it is at rest, and vice versa, if it is \nmoving away from the observer it will appear fainter than if it is at rest. \nWhen this is applied to the rapidly rotating emitters in the accretion disk, it \nwill enhance the apparent brightness of the approaching side of the disk with \nrespect to its receding side (see the bottom panel in Fig. \\ref{fig:disk}), and \nthus it will also enhance the ''blue'' peak of the line with respect to its \n''red'' peak, as it can be seen from the dashed simulated line profile in Fig. \n\\ref{fig:out}.\n\nSince the velocities of material, as well as the radii of the emitting region \nof the dashed simulated line profile in Fig. \\ref{fig:out}, correspond to the \nparts of the disk from which the optical spectral lines like $H\\alpha$ and \n$H\\beta$ are observed, one can conclude that the transverse Doppler shift and  \nDoppler beaming significantly affect even the optical lines which originate \nfrom outer regions of the accretion disk. In the case of such lines,  \nas it can be seen from Table \\ref{tab:tab1}, the maximum redshift of the photons\n$(1/g_{min}-1)$ is significantly larger by absolute value than their maximum \nblueshift $(1/g_{max}-1)$, which quantitatively represents the influence of \ntransverse Doppler shift in this case.  \n\nHowever, since the Fe K$\\alpha$ line originates in the innermost regions of an \naccretion disk, its emitting material rotates with the fastest velocities (on \nthe order of tens of thousands of km s$^{-1}$). Therefore, the previously \nmentioned classical and special relativistic effects are even more significant \nin the case of Fe K$\\alpha$ line (see the both panels in Fig. \\ref{fig:in}, \nas well as the corresponding rows in Table \\ref{tab:tab1}). As \nit can be seen from Fig. \\ref{fig:in}, when compared to the simulated profile \nof an optical line (dashed profile from Fig. \\ref{fig:out}), the Fe K$\\alpha$ \nline profile is much wider (due to the larger classical Doppler shift), more \nasymmetric (due to the larger Doppler beaming) and more redshifted (due to the \nlarger transverse Doppler shift, as well as due to the gravitational \nredshift which is discussed in more details in the following paragraph).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig3a.eps} \\\\\n\\includegraphics[width=\\columnwidth]{fig3b.eps}\n\\caption{\\textit{Top:} the shape of the Fe K$\\alpha$ line emitted from the \ninnermost regions of a relativistic accretion disk around a Schwarzschild SMBH \nwith inclination of $i=35^\\circ$, outer radius of $20\\ \nR_g$ and inner radius of $R_{in}=10\\ R_g$ (solid line), as well as \n$R_{in}=R_{ms}=6\\ R_g$ (dashed line). \\textit{Bottom:} the same as above, but in \nthe case of an accretion disk around a maximally rotating Kerr SMBH for which \n$R_{ms}=1\\ R_g$}\n\\label{fig:in}\n\\end{figure}\n\n\\subsection{Gravitational redshift due to general relativistic effects}\n\\label{ss:gr}\n\nAccording to the general relativity, the observed frequency of electromagnetic \nradiation emitted by a source in a strong gravitational field in vicinity of a \nSMBH will be reduced with respect to the emitted frequency, due to \ngravitational time dilation. This effect is called the gravitational redshift \n\\citep{mis73}, and in the Newtonian limit it is approximately \nproportional to the mass of a SMBH and inversely proportional to the distance \nbetween it and a point in the disk at which a photon is emitted.\n\nIn order to study the influence of the gravitational redshift on the Fe \nK$\\alpha$ line profile, we simulated the line profiles originating from \ntwo emitting regions in accretion disk around a non-rotating Schwarzschild SMBH \n(top panel in Fig. \\ref{fig:in}) and a maximally rotating Kerr SMBH (bottom \npanel in Fig. \\ref{fig:in}), having two different inner radii: $R_{in}=10\\ R_g$ \n(denoted by solid lines) and $R_{in}=R_{ms}$ (denoted by dashed lines). The \nouter radii in both cases are $R_{out}=20\\ R_g$. As it can be seen from Fig. \n\\ref{fig:in}, in the case of both metrics the profiles originating from \nemitting regions with smaller inner radii are redshifted with respect to the \nprofiles from emitting regions with larger inner radii, due to the \ngravitational redshift. This is even more obvious if one compare the \ncorresponding maximum redshifts $(1/g_{min}-1)$ and blueshifts $(1/g_{max}-1)$ \npresented in Table \\ref{tab:tab1}, from which it can be seen that the \nmaximum redshifts are much bigger in the cases with the smaller inner radii, \nwhile the blueshifts are the same in both cases. \nTherefore, the gravitational redshift causes the further deformations of the Fe \nK$\\alpha$ line profile by smearing its ''blue'' emission into the ''red'' one.\n\nThis effect is stronger in the case of a maximally rotating Kerr SMBH than in \nthe case of a non-rotating Schwarzschild SMBH due to the fact that the radius of \nthe innermost stable circular orbit (also known as radius of marginally stable \norbit, $R_{ms}$) strongly depends on SMBH spin $a$, so that in the case of a \nnon-rotating Schwarzschild SMBH (i.e. for $a=0$) it is equal to $6\\ R_g$ (top \npanel in Fig. \\ref{fig:in}), and in the case of an extremely rotating Kerr SMBH \n(i.e. for $a=1$) it is equal to $1\\ R_g$ (bottom panel in Fig. \\ref{fig:in}). \nThus, in the case of an extremely rotating SMBH it is possible to detect the \nradiation which originates closer to the SMBH itself, and which is therefore \nmore subjected to the gravitational redshift (see the last row in \nTable \\ref{tab:tab1}), than in the case of a non-rotating Schwarzschild SMBH.\n\nIn that way the SMBH spin $a$ affects the radiation originating from the \ninnermost regions of the disk which are closest to the SMBH \\citep[see \ne.g.][]{jov08a} and, as it can be seen from both panels in Fig. \\ref{fig:in} \nand the corresponding rows of Table \\ref{tab:tab1}, \nit significantly affects the profile of the Fe K$\\alpha$ line, especially its \n''red'' wing by extending it towards the lower energies for the higher values \nof $a$ (see also \\citet{jov11} for a case study and \\citet{jov12} for more \ndetails).\n\n\\subsection{Line shifts due to perturbed disk emissivity}\n\\label{ss:pert}\n\nBeside the previously mentioned classical, special and general \nrelativistic effects, several observational/theo\\-re\\-ti\\-cal studies indicated\nthat the line shapes and shifts could be affected by the perturbations of the \ndisk emissivity in the form of flares or orbiting bright spots, especially in \nthe case of high accretion rate objects, such as Seyfert galaxies and QSOs \n\\citep[see e.g.][]{cze04a,cze04b,jov10}. For instance, appearance of the \nredshifted Fe K$\\alpha$ emission feature due to co-rotating flare above the \naccretion disk which irradiates a spot on its surface was reported in the case \nof the Seyfert galaxies NGC 3516 \\citep{iwa04} and NGC 3783 \\citep{tom07}, \nbased on their observations by XMM-Newton. However, since the sensitivity of \nXMM-Newton was not sufficient to clearly resolve sub-orbital features in the \nobserved X-ray spectra, the azimuthal irradiation structure of the inner \naccretion disk is modeled and simulated by \\citet{cze04a,cze04b,gos07a,gos07b} \nin order to investigate the detectability of orbiting spots in nearby Seyfert \ngalaxies with current and future X-ray observatories, such as X-ray Evolving \nUniverse Spectroscopy (XEUS), a planned successor to XMM-Newton which evolved to \nAdvanced Telescope for High Energy Astrophysics (ATHENA+) that is currently \nunder development, aiming to have several hundred times larger sensitivity than \nChandra X-ray Observatory and XMM-Newton. For that purpose, \n\\citet{gos07a,gos07b} developed a method to compute the local spectra of the \nhot spot emission from the surface of an accretion disk underlying a strong \nco-rotating flare above the disk, and used it to model the X-ray reprocessing \nfrom a persisting flare lasting for a significant fraction of one orbital period \nat the given disk radius in some AGNs such as MCG-6-30-15 and NGC 5548, as well \nas the short-term flares with durations of a few hundreds of seconds. These \nstudies showed that the future high precision observations will allow to \ndisentangle the effects of the flares in the accretion disks of Seyfert galaxies \nfrom the intrinsic variability of the local emission, even at distances which \nare less than $5\\ R_g$ from the central SMBHs \\citep{gos07b}. Also, the spectral \nvariations induced by such flares depend on the viewing direction and are \nstronger for intermediate (edge-on) viewing angles, as supposed for Seyfert-2 \ngalaxies, than for a face-on viewing direction, as assumed in Seyfert-1 \ngalaxies, and thus, they could be used to put observational constraints on the \ndisk inclination \\citep{cze04a,cze04b}. However, indications for the flares in \nthe accretion disks were found not only in the X-ray band, but also in the \noptical spectra of some AGNs. For example, the variability of the observed \n$H\\beta$ line profiles of quasar 3C 390.3 was recently successfully explained by \na perturbation of the power law disk emissivity, revealing the appearance of two \nsuccessive bright spots on the approaching side of the disk which were \ninterpreted as the fragments of spiral arms in the accretion disk of 3C 390.3 \n\\citep{jov10}.\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig4a.eps} \\\\\n\\includegraphics[width=\\columnwidth]{fig4b.eps}\n\\caption{\\textit{Top:} illustration of perturbed emissivity of an accretion\ndisk in Schwarzschild metric with inclination of \n$i=35^\\circ$, extending from $R_{ms}$ up to $30\\ R_g$ for a \nperturbing region located at the receding side of the disk. \\textit{Bottom:} \nthe unperturbed (solid line) and perturbed (dashed lines) shapes of the Fe \nK$\\alpha$ line for a perturbing region located at three different positions \nalong $x$-axis and with three different widths: a) $x_p=10\\ R_g$, $\\sigma_p=2\\ \nR_g$, b) $x_p=16\\ R_g$, $\\sigma_p=5\\ R_g$ and c) $x_p=26\\ R_g$, $\\sigma_p=10\\ \nR_g$}\n\\label{fig:pert}\n\\end{figure}\n\nSuch perturbations of the power law disk emissivity can be modeled as \n\\citep{jov10}:\n\n", "itemtype": "equation", "pos": 10056, "prevtext": "\nIn the ray-tracing method one takes into account only those photon trajectories \nreaching the observer's sky plane. An observer's sky plane is divided into a \nnumber of small elements (pixels), and for each pixel the photon trajectories \nare traced backward from the observer by following the geodesics in a Kerr \nspace-time, until their intersection with the disk. We assumed  \nan optically thick and geometrically thin disk for which the spectrum of emitted\nradiation  depends on its structure, and therefore on the distance to the \ncentral SMBH \\citep{sha73}. Thus, assuming that disk radiates according to an\nemissivity law $\\varepsilon \\left( {r} \\right)$, for each pixel at observer's \nsky plane it is possible to calculate the flux density and the energy shift $g$ \nof the photons emitted by the disk \\citep[see][for more details]{jov12}. \nUsually, a power law for disk emissivity is assumed: \n$\\varepsilon\\left(r\\right)\\propto r^{-q}$, where $q$ is an emissivity index. In \nthat way, one can obtain a simulated image of a relativistic accretion \ndisk as would be seen by a distant observer using a powerful high resolution \ntelescope. An example of such simulated image of a relativistic accretion disk \nis presented in Fig. \\ref{fig:disk}, where  $R_g=GM/c^2$ is the gravitational \nradius of the central SMBH with mass $M$ ($G$ being gravitational \nconstant and $c$ speed of light), and $R_{ms}$ represents the radius of the \nmarginally stable orbit which depends on spin $a$ of the SMBH.\n\nThe corresponding simulated profile of the line emitted from the simulated \naccretion disk can be calculated by taking into account the total \nobserved flux and observed photon energies of all pixels over the disk image:\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eqn:fobs}\nF_{obs} \\left( {E_{obs}}  \\right) = {\\int\\limits_{image} {\\varepsilon\n\\left({r} \\right)}} g^{4}\\delta \\left( {E_{obs} - gE_{0}}  \\right)d\\Xi ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"F_{obs}\\left({E_{obs}}\\right)={\\int\\limits_{image}{\\varepsilon\\left({r}\\right)%&#10;}}g^{4}\\delta\\left({E_{obs}-gE_{0}}\\right)d\\Xi,\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><msub><mi>E</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mrow><mi>i</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mi>e</mi></mrow></munder><mrow><mi>ε</mi><mo>⁢</mo><mrow><mo>(</mo><mi>r</mi><mo>)</mo></mrow><mo>⁢</mo><msup><mi>g</mi><mn>4</mn></msup><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>E</mi><mrow><mi>o</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>-</mo><mrow><mi>g</mi><mo>⁢</mo><msub><mi>E</mi><mn>0</mn></msub></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi mathvariant=\"normal\">Ξ</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02389.tex", "nexttext": "\nwhere $q$ is power law emissivity index, $\\varepsilon_p$ is emissivity of \nperturbing region, and $(x_p,y_p)$ and $\\sigma_p$ are its position and width \n(both in $R_g$), respectively.\nAn illustration of the perturbed disk emissivity is presented in the top panel \nof Fig. \\ref{fig:pert}, and the perturbed and unperturbed Fe K$\\alpha$ line \nprofiles for three different positions and widths of perturbing region are given \nin the bottom panel of the same figure. As one can see from Fig. \\ref{fig:pert}, \na perturbing region on the receding side of accretion disk, affects only the \n''red wing'' of the Fe K$\\alpha$ line, while the ''blue'' one and the line core \nstay nearly unaffected. Moreover, the position of perturbing region is in a\ndirect relation with the position of the ''red peak'' of the line. \nRecently, a model of accretion disk with perturbing region was used for \nfitting the observed spectra of some AGNs, resulting with a non-random \ndistribution of bright spot positions along the receding side of the disk. This \nindicated that the most plausible physical mechanism which can explain such \nbehaviour is a fragmented spiral arm of the accretion disk \\citep[see e.g.][and \nreferences therein]{jov10,lew10}. Perturbing regions could be then explained by \nthe emissivity lumps caused by fragments in spiral arms, such as isolated \nclumps which could pass through the arm and dominate in its emissivity. The \nfragments naturally travel with the arm as it precesses through the disk, but \nsince the outer parts of an accretion disk are self-gravitating, the fragments \nof spiral arms could be also launched from the outer regions of the disk and \npropagate inward \\citep{lew10}. Besides, in the inner regions of the disk, the \ndisk winds and highly ionized fast outflows could play an important role and \ncould also cause the outward propagation of such clumps \\citep[see \ne.g.][]{pop11,sim10}. Since the flux variability caused by a spiral arm is on \ntimescales of a year to several years while its fragments cause shorter \nvariations on timescales of several months, this model is able to explain the \nobserved variability of some AGNs on the timescales ranging from several months \nto several years \\citep{lew10}. As it can be seen from Figure \\ref{fig:pert}, \nwhen a perturbation which originates in the inner regions of the disk and, due \nto some wind or outflow, spirals away along the receding side of the disk \nfurther from the central SMBH and toward the outer parts of the disk, it will \ncause the blueward shift of the ''red peak'' which will therefore move towards \nthe line core. This demonstrates that in some cases, the deformations of the \nline profiles could arise due to shifts of some of their parts, caused by the \nvariability of the disk emissivity \\citep[for more details see][]{jov10}.\n\n\\subsection{Line shifts in the binary systems of SMBHs}\n\\label{ss:smbb}\n\nBinary systems of supermassive black holes are formed in galactic mergers, and\nat some stage when two SMBHs become gravitationally bound and start to orbit \naround their center of mass, accretion of the surrounding matter on both SMBHs \ncould be expected and as a result, a strong line emission could arise (see \n\\citet{pop12} for theoretical aspects and \\citet{bon12,yan15} for observational \nevidences). In such a case, the Fe K$\\alpha$ line might be also observed, and \nit would most likely arise from both accretion disks around primary and \nsecondary SMBHs, located in a central low density cavity of a circumbinary disk \n\\citep{jov14}. Therefore, the Fe K$\\alpha$ line profiles emitted from both \naccretion disks might be affected by the Doppler shifts due to the orbital \nmotion of the SMBH binary, and in that case the corresponding signatures would \nbe imprinted in the observed composite line profile \\citep{jov14}.\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig5.eps}\n\\caption{Composite profiles of the Fe K$\\alpha$ line emitted from the accretion \ndisks around two SMBHs in a binary system during three different phases of its \nKeplerian orbit. The parameters of the SMBH binary system are: mass ratio \n$q=1$, separation between the components of $a=0.01$ pc, inclination \n$i=60^\\circ$, eccentricity $e=0.75$, longitude of pericenter $\\omega=90^\\circ$ \nand systemic velocity $\\gamma=0$. Both accretion disks surround the slowly \nrotating Kerr primary and secondary SMBHs with the same spins $J/(M c)=0.1$ (M \nbeing the mass of a SMBH), and both of them extend from $R_{ms}$ to $30\\ R_g$, \nhave the same inclinations of $60^\\circ$, as well as power law emissivity \nindices of $p=2$}\n\\label{fig:smbb}\n\\end{figure}\n\nAssuming that the radial velocities of the primary and secondary components \nare $V_{1,2}^{rad} \\ll c$ so that the corresponding Doppler shifts due to \ntheir orbital motion are $\\approx V_{1,2}^{rad} / c$, a composite profile \n$F\\left(g\\right)$ of the Fe K$\\alpha$ line emitted from both accretion disks of \na SMBH binary at some orbital phase can be calculated from two constituent \nunshifted line profiles $F_1 \\left(g\\right)$ and $F_2 \\left(g\\right)$ according \nto \\citep{jov14}:\n\n", "itemtype": "equation", "pos": 24305, "prevtext": "\nwhere $d\\Xi$ is the solid angle subtended by the disk in the observer's\nsky and $E_{0}$ is the rest energy. Several examples for the simulated line \nprofiles emitted from different regions of the relativistic accretion disks with \ndifferent parameters are given in Figs. \\ref{fig:out}-\\ref{fig:in}.\n\n\\section{Results: Fe K$\\alpha$ line shifts}\n\\label{s:shifts}\n\nIn this section we will discuss several phenomena which can induce shifts in \nthe lines emitted from relativistic accretion disks around SMBHs. \nFor that purpose we simulated the line profiles emitted from different \nregions of accretion disks, which parameters are given in Table \n\\ref{tab:tab1}. In the following paragraphs we describe the obtained results \nin more details. However, one should take into account that some other \nphenomena, such as gravitational microlensing could also induce line shifts \n\\citep[see e.g.][]{pop03a,pop03b,pop06,jov08b,jov09}, but they will not be \ndiscussed here.\n\n\\subsection{Classical Doppler shift due to Keplerian rotation in accretion disk}\n\\label{ss:kepler}\n\nRotation of emitting material in the outermost regions of an accretion disk, \nlocated thousands $R_g$ from the central SMBH, is practically Keplerian since \nthe relativistic effects are negligible at such large distances. Therefore, the \nlines emitted from these regions are broadened depending on Keplerian \nrotational velocity and have two symmetric peaks (see the solid line profile in \nFig. \\ref{fig:out}): the ''blue'' one emitted by the material located on the \nside of the disk which is approaching towards an observer (denoted by blue \nshades in the simulated accretion disk image presented in the top panel of Fig. \n\\ref{fig:disk}), and the ''red'' one, emitted by the material on the receding \nside of the disk with respect to the observer (denoted by red shades in the top \npanel of Fig. \\ref{fig:disk}).\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig2.eps}\n\\caption{Two shapes of the lines emitted from the outer regions of a \nslightly inclined ($i=10^\\circ$) relativistic \naccretion disk around a maximally rotating Kerr SMBH, extending between 7000 \nand \n8000 $R_g$ (solid line) and 1000 and 2000 $R_g$ (dashed line)}\n\\label{fig:out}\n\\end{figure}\n\n\\subsection{Transverse Doppler shift and Doppler beaming due to special \nrelativistic effects}\n\\label{ss:sr}\n\nHowever, in the regions which are located less than a few thousand $R_g$ from\nthe SMBH, the rotational velocities are much higher (on the order of several \nthousand km s$^{-1}$) inducing, not only the wider line shapes, but also the \nspecial relativistic effects which produce an asymmetry in the line shapes by \nshifting the emission from the inner regions of the disk to the ''red'' and \nbeaming its radiation in the direction of motion \\citep[see e.g.][]{fab99}, and \nthus enhancing the ''blue'' peak with respect to the ''red'' one (see the \ndashed line profile in Fig. \\ref{fig:out}). These two special relativistic \neffects are known as transverse Doppler shift and Doppler beaming, respectively.\n\nThe transverse Doppler shift originates when the observer is displaced in a \ndirection perpendicular to the direction of the motion of emitters in \nthe accretion \ndisk, and is a consequence of the relativistic Doppler effect which includes the \ntime dilation. Namely, if in the observer's frame the angle between the \ndirection of the emitter at the time of emission and the observed direction of \nthe light at the time of observation is equal to $\\pi/2$, the relativistic \nDoppler effect reduces to the transverse Doppler shift, due to which the \nobserved radiation from a rapidly rotating accretion disk is redshifted by the \nLorentz factor, as it is the case with the dashed simulated line profile in \nFig. \\ref{fig:out}.\n\nDoppler beaming (boosting) modifies the apparent brightness of the rapidly \nmoving emitting matter in the sense that, if it is moving towards the observer \nthen it will appear brighter than if it is at rest, and vice versa, if it is \nmoving away from the observer it will appear fainter than if it is at rest. \nWhen this is applied to the rapidly rotating emitters in the accretion disk, it \nwill enhance the apparent brightness of the approaching side of the disk with \nrespect to its receding side (see the bottom panel in Fig. \\ref{fig:disk}), and \nthus it will also enhance the ''blue'' peak of the line with respect to its \n''red'' peak, as it can be seen from the dashed simulated line profile in Fig. \n\\ref{fig:out}.\n\nSince the velocities of material, as well as the radii of the emitting region \nof the dashed simulated line profile in Fig. \\ref{fig:out}, correspond to the \nparts of the disk from which the optical spectral lines like $H\\alpha$ and \n$H\\beta$ are observed, one can conclude that the transverse Doppler shift and  \nDoppler beaming significantly affect even the optical lines which originate \nfrom outer regions of the accretion disk. In the case of such lines,  \nas it can be seen from Table \\ref{tab:tab1}, the maximum redshift of the photons\n$(1/g_{min}-1)$ is significantly larger by absolute value than their maximum \nblueshift $(1/g_{max}-1)$, which quantitatively represents the influence of \ntransverse Doppler shift in this case.  \n\nHowever, since the Fe K$\\alpha$ line originates in the innermost regions of an \naccretion disk, its emitting material rotates with the fastest velocities (on \nthe order of tens of thousands of km s$^{-1}$). Therefore, the previously \nmentioned classical and special relativistic effects are even more significant \nin the case of Fe K$\\alpha$ line (see the both panels in Fig. \\ref{fig:in}, \nas well as the corresponding rows in Table \\ref{tab:tab1}). As \nit can be seen from Fig. \\ref{fig:in}, when compared to the simulated profile \nof an optical line (dashed profile from Fig. \\ref{fig:out}), the Fe K$\\alpha$ \nline profile is much wider (due to the larger classical Doppler shift), more \nasymmetric (due to the larger Doppler beaming) and more redshifted (due to the \nlarger transverse Doppler shift, as well as due to the gravitational \nredshift which is discussed in more details in the following paragraph).\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig3a.eps} \\\\\n\\includegraphics[width=\\columnwidth]{fig3b.eps}\n\\caption{\\textit{Top:} the shape of the Fe K$\\alpha$ line emitted from the \ninnermost regions of a relativistic accretion disk around a Schwarzschild SMBH \nwith inclination of $i=35^\\circ$, outer radius of $20\\ \nR_g$ and inner radius of $R_{in}=10\\ R_g$ (solid line), as well as \n$R_{in}=R_{ms}=6\\ R_g$ (dashed line). \\textit{Bottom:} the same as above, but in \nthe case of an accretion disk around a maximally rotating Kerr SMBH for which \n$R_{ms}=1\\ R_g$}\n\\label{fig:in}\n\\end{figure}\n\n\\subsection{Gravitational redshift due to general relativistic effects}\n\\label{ss:gr}\n\nAccording to the general relativity, the observed frequency of electromagnetic \nradiation emitted by a source in a strong gravitational field in vicinity of a \nSMBH will be reduced with respect to the emitted frequency, due to \ngravitational time dilation. This effect is called the gravitational redshift \n\\citep{mis73}, and in the Newtonian limit it is approximately \nproportional to the mass of a SMBH and inversely proportional to the distance \nbetween it and a point in the disk at which a photon is emitted.\n\nIn order to study the influence of the gravitational redshift on the Fe \nK$\\alpha$ line profile, we simulated the line profiles originating from \ntwo emitting regions in accretion disk around a non-rotating Schwarzschild SMBH \n(top panel in Fig. \\ref{fig:in}) and a maximally rotating Kerr SMBH (bottom \npanel in Fig. \\ref{fig:in}), having two different inner radii: $R_{in}=10\\ R_g$ \n(denoted by solid lines) and $R_{in}=R_{ms}$ (denoted by dashed lines). The \nouter radii in both cases are $R_{out}=20\\ R_g$. As it can be seen from Fig. \n\\ref{fig:in}, in the case of both metrics the profiles originating from \nemitting regions with smaller inner radii are redshifted with respect to the \nprofiles from emitting regions with larger inner radii, due to the \ngravitational redshift. This is even more obvious if one compare the \ncorresponding maximum redshifts $(1/g_{min}-1)$ and blueshifts $(1/g_{max}-1)$ \npresented in Table \\ref{tab:tab1}, from which it can be seen that the \nmaximum redshifts are much bigger in the cases with the smaller inner radii, \nwhile the blueshifts are the same in both cases. \nTherefore, the gravitational redshift causes the further deformations of the Fe \nK$\\alpha$ line profile by smearing its ''blue'' emission into the ''red'' one.\n\nThis effect is stronger in the case of a maximally rotating Kerr SMBH than in \nthe case of a non-rotating Schwarzschild SMBH due to the fact that the radius of \nthe innermost stable circular orbit (also known as radius of marginally stable \norbit, $R_{ms}$) strongly depends on SMBH spin $a$, so that in the case of a \nnon-rotating Schwarzschild SMBH (i.e. for $a=0$) it is equal to $6\\ R_g$ (top \npanel in Fig. \\ref{fig:in}), and in the case of an extremely rotating Kerr SMBH \n(i.e. for $a=1$) it is equal to $1\\ R_g$ (bottom panel in Fig. \\ref{fig:in}). \nThus, in the case of an extremely rotating SMBH it is possible to detect the \nradiation which originates closer to the SMBH itself, and which is therefore \nmore subjected to the gravitational redshift (see the last row in \nTable \\ref{tab:tab1}), than in the case of a non-rotating Schwarzschild SMBH.\n\nIn that way the SMBH spin $a$ affects the radiation originating from the \ninnermost regions of the disk which are closest to the SMBH \\citep[see \ne.g.][]{jov08a} and, as it can be seen from both panels in Fig. \\ref{fig:in} \nand the corresponding rows of Table \\ref{tab:tab1}, \nit significantly affects the profile of the Fe K$\\alpha$ line, especially its \n''red'' wing by extending it towards the lower energies for the higher values \nof $a$ (see also \\citet{jov11} for a case study and \\citet{jov12} for more \ndetails).\n\n\\subsection{Line shifts due to perturbed disk emissivity}\n\\label{ss:pert}\n\nBeside the previously mentioned classical, special and general \nrelativistic effects, several observational/theo\\-re\\-ti\\-cal studies indicated\nthat the line shapes and shifts could be affected by the perturbations of the \ndisk emissivity in the form of flares or orbiting bright spots, especially in \nthe case of high accretion rate objects, such as Seyfert galaxies and QSOs \n\\citep[see e.g.][]{cze04a,cze04b,jov10}. For instance, appearance of the \nredshifted Fe K$\\alpha$ emission feature due to co-rotating flare above the \naccretion disk which irradiates a spot on its surface was reported in the case \nof the Seyfert galaxies NGC 3516 \\citep{iwa04} and NGC 3783 \\citep{tom07}, \nbased on their observations by XMM-Newton. However, since the sensitivity of \nXMM-Newton was not sufficient to clearly resolve sub-orbital features in the \nobserved X-ray spectra, the azimuthal irradiation structure of the inner \naccretion disk is modeled and simulated by \\citet{cze04a,cze04b,gos07a,gos07b} \nin order to investigate the detectability of orbiting spots in nearby Seyfert \ngalaxies with current and future X-ray observatories, such as X-ray Evolving \nUniverse Spectroscopy (XEUS), a planned successor to XMM-Newton which evolved to \nAdvanced Telescope for High Energy Astrophysics (ATHENA+) that is currently \nunder development, aiming to have several hundred times larger sensitivity than \nChandra X-ray Observatory and XMM-Newton. For that purpose, \n\\citet{gos07a,gos07b} developed a method to compute the local spectra of the \nhot spot emission from the surface of an accretion disk underlying a strong \nco-rotating flare above the disk, and used it to model the X-ray reprocessing \nfrom a persisting flare lasting for a significant fraction of one orbital period \nat the given disk radius in some AGNs such as MCG-6-30-15 and NGC 5548, as well \nas the short-term flares with durations of a few hundreds of seconds. These \nstudies showed that the future high precision observations will allow to \ndisentangle the effects of the flares in the accretion disks of Seyfert galaxies \nfrom the intrinsic variability of the local emission, even at distances which \nare less than $5\\ R_g$ from the central SMBHs \\citep{gos07b}. Also, the spectral \nvariations induced by such flares depend on the viewing direction and are \nstronger for intermediate (edge-on) viewing angles, as supposed for Seyfert-2 \ngalaxies, than for a face-on viewing direction, as assumed in Seyfert-1 \ngalaxies, and thus, they could be used to put observational constraints on the \ndisk inclination \\citep{cze04a,cze04b}. However, indications for the flares in \nthe accretion disks were found not only in the X-ray band, but also in the \noptical spectra of some AGNs. For example, the variability of the observed \n$H\\beta$ line profiles of quasar 3C 390.3 was recently successfully explained by \na perturbation of the power law disk emissivity, revealing the appearance of two \nsuccessive bright spots on the approaching side of the disk which were \ninterpreted as the fragments of spiral arms in the accretion disk of 3C 390.3 \n\\citep{jov10}.\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig4a.eps} \\\\\n\\includegraphics[width=\\columnwidth]{fig4b.eps}\n\\caption{\\textit{Top:} illustration of perturbed emissivity of an accretion\ndisk in Schwarzschild metric with inclination of \n$i=35^\\circ$, extending from $R_{ms}$ up to $30\\ R_g$ for a \nperturbing region located at the receding side of the disk. \\textit{Bottom:} \nthe unperturbed (solid line) and perturbed (dashed lines) shapes of the Fe \nK$\\alpha$ line for a perturbing region located at three different positions \nalong $x$-axis and with three different widths: a) $x_p=10\\ R_g$, $\\sigma_p=2\\ \nR_g$, b) $x_p=16\\ R_g$, $\\sigma_p=5\\ R_g$ and c) $x_p=26\\ R_g$, $\\sigma_p=10\\ \nR_g$}\n\\label{fig:pert}\n\\end{figure}\n\nSuch perturbations of the power law disk emissivity can be modeled as \n\\citep{jov10}:\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eqn:pert}\n\\varepsilon\\left(x,y\\right)\\propto\nr\\left(x,y\\right)^{-q}\\cdot\\left(1+\\varepsilon_p\\cdot \ne^{-\\frac{(x-x_p)^2+(y-y_p)^2}{\\sigma_p^2}}\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\varepsilon\\left(x,y\\right)\\propto r\\left(x,y\\right)^{-q}\\cdot\\left(1+%&#10;\\varepsilon_{p}\\cdot e^{-\\frac{(x-x_{p})^{2}+(y-y_{p})^{2}}{\\sigma_{p}^{2}}}%&#10;\\right),\" display=\"block\"><mrow><mrow><mrow><mi>ε</mi><mo>⁢</mo><mrow><mo>(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo>)</mo></mrow></mrow><mo>∝</mo><mrow><mrow><mi>r</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo>)</mo></mrow><mrow><mo>-</mo><mi>q</mi></mrow></msup></mrow><mo>⋅</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>ε</mi><mi>p</mi></msub><mo>⋅</mo><msup><mi>e</mi><mrow><mo>-</mo><mfrac><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><msub><mi>x</mi><mi>p</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>y</mi><mo>-</mo><msub><mi>y</mi><mi>p</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><msubsup><mi>σ</mi><mi>p</mi><mn>2</mn></msubsup></mfrac></mrow></msup></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02389.tex", "nexttext": "\n\nThree such simulated composite Fe K$\\alpha$ line profiles emitted during \nthree different phases along the Keplerian orbit of a SMBH binary with \nsub-parsec separation between the components are presented in Fig. \n\\ref{fig:smbb}. As it can be seen from Fig. \\ref{fig:smbb}, Doppler shifts due \nto the orbital motion of the components in the binary have significant \ninfluence on the observed composite Fe K$\\alpha$ line profiles and induce their \nripple variability, as well as the shifts of their parts, especially of the \nline cores and their ''blue'' wings \\citep[for more details see][]{jov14}. Such \nshifts and ripple variability of the complex Fe K$\\alpha$ line profiles \nstrongly depend on the orbital phase of the binary system, and therefore if \nobserved in the spectra of some AGNs, they could represent the observational \nsignatures of the existence of SMBH binary systems in the cores of these AGNs.\n\n\\section{Conclusions}\n\\label{s:conc}\n\nHere we discussed different types of the Fe K$\\alpha$ line shifts in \nAGNs, as well as several phenomena that can induce them. For that \npurpose, we performed numerical simulations of the X-ray radiation from the \nrelativistic accretion disks around single and binary SMBHs, based on \nray-tracing method in the Kerr metric. The obtained results showed that the \nfollowing effects have a significant influence on the line profiles:\n\\begin{itemize}\n\\item \nclassical Doppler shift which causes double-peaked profiles of the lines \nemitted over a whole relativistic accretion disk, from its innermost \nregions where X-ray radiation originates, to its outermost parts which \nemit in the optical band;\n\\item \nspecial relativistic transverse Doppler shift and relativistic beaming which \ncause the redshift of the line profile, as well as the relative enhancement of \nits ''blue'' peak with respect to the ''red'' one, not only in the case of the \nbroad Fe K$\\alpha$ line which originates from the innermost regions of the disk, \nbut also in the case of the optical lines which originate from its outer parts;\n\\item \ngeneral relativistic gravitational redshift which causes the further \ndeformations of the Fe K$\\alpha$ line profile by smearing its ''blue'' emission \ninto the ''red'' one, as well as the SMBH spin $a$ which affects the ''red'' \nwing of the line by extending it towards the lower energies for the higher \nvalues of $a$;\n\\item\nperturbations of the disk emissivity in form of flares or bright spots moving \nalong the receding side of the disk, which can induce blueward \nshift of the ''red peak'' not only of the Fe K$\\alpha$ line, but also of the \nlines in other spectral bands;  \n\\item\nDoppler shifts due to the orbital motion in the SMBH binaries which could \nproduce the ripple variability of the complex Fe K$\\alpha$ line profiles and \ninduce shifting of their parts. Such variability of the observed Fe K$\\alpha$ \nline profiles strongly depends on the orbital phases of the SMBH binary \nsystems, and could represent their observational signatures.\n\\end{itemize}\n\n\\acknowledgments\nThis research is part of the projects 176003 ''Gravitation and the large scale \nstructure of the Universe'' and 176001 ''Astrophysical Spectroscopy of \nExtragalactic Objects'', supported by the Ministry of Education, Science and \nTechnological Development of the Republic of Serbia. This research is also \npartially supported by the SEENET-MTP - ICTP Program PRJ-09 ''Strings and \nCosmology''.\n\n\\begin{thebibliography}{}\n\n\\bibitem[\\protect\\citeauthoryear{Arnaud}{1996}]{arn96} Arnaud, K.~A.: \nXSPEC: The First Ten Years. Astronomical Data Analysis Software and Systems V \n\\textbf{101}, 17 (1996)\n\n\\bibitem[\\protect\\citeauthoryear{Bon et al.}{2012}]{bon12} \nBon, E., Jovanovi{\\'c}, P., Marziani, P., Shapovalova, A.~I., Bon, N., Borka \nJovanovi{\\'c}, V., Borka, D., Sulentic, J., Popovi{\\'c}, L.~{\\v C}.: The First \nSpectroscopically Resolved Sub-parsec Orbit of a Supermassive Binary Black Hole. \n\\apj\\ \\textbf{759}, 118 (2012) \n\n\\bibitem[\\protect\\citeauthoryear{Bromley et al.}{1997}]{bro97} Bromley, \nB.~C., Chen, K., Miller, W.~A.: Line Emission from an Accretion Disk around a \nRotating Black Hole: Toward a Measurement of Frame Dragging. \\apj\\ \\textbf{475}, \n57 (1997)\n\n\\bibitem[\\protect\\citeauthoryear{{\\v C}ade{\\v z} et al.}{1998}]{cad98} \n{\\v C}ade{\\v z}, A., Fanton, C., Calvani, M.: Line emission from accretion \ndiscs around black holes: the analytic approach.  \\na\\ \\textbf{3}, 647 (1998) \n\n\\bibitem[\\protect\\citeauthoryear{Chen \\& Halpern}{1989}]{chen89a} \nChen, K., Halpern, J.~P.: Structure of line-emitting accretion \ndisks in active galactic nuclei - ARP 102B. \\apj\\ \\textbf{344}, 115 (1989)\n\n\\bibitem[\\protect\\citeauthoryear{Chen et al.}{1989}]{chen89b} Chen, K., \nHalpern, J.~P., Filippenko, A.~V.: Kinematic evidence for a relativistic \nKeplerian disk - ARP 102B. \\apj\\ \\textbf{339}, 742 (1989)\n\n\\bibitem[\\protect\\citeauthoryear{Czerny et al.}{2004}]{cze04a} Czerny, \nB., R{\\'o}{\\.z}a{\\'n}ska, A., Dov{\\v c}iak, M., Karas, V., Dumont, A.-M.: The \nstructure and radiation spectra of illuminated accretion disks in AGN. II. \nFlare/spot model of X-ray variability. \\aap\\ \\textbf{420}, 1 (2004)\n\n\\bibitem[\\protect\\citeauthoryear{Czerny \\& Goosmann}{2004}]{cze04b} \nCzerny, B., Goosmann, R.: Flare-induced fountains and buried flares in \nAGN. \\aap\\ \\textbf{428}, 353 (2004)\n\n\\bibitem[\\protect\\citeauthoryear{Dov{\\v c}iak et al.}{2004}]{dov04} \nDov{\\v c}iak, M., Karas, V., Yaqoob, T.: An Extended Scheme for Fitting \nX-Ray Data with Accretion Disk Spectra in the Strong Gravity Regime. \\apjs\\ \n153, 205 (2004)\n\n\\bibitem[\\protect\\citeauthoryear{Fabian et al.}{1989}]{fab89} Fabian, \nA.~C., Rees, M.~J., Stella, L., White, N.~E.: X-ray fluorescence from the inner \ndisc in Cygnus X-1. \\mnras\\ textbf{238}, 729 (1989)\n\n\\bibitem[\\protect\\citeauthoryear{Fabian}{1999}]{fab99} Fabian, A.~C.: Emission \nlines: signatures of relativistic rotation, chapter in book ''Theory of Black \nHole Accretion Discs'', Edited by M. A. Abramowicz, G. Bj{\\\"o}rnsson and J. \nE. Pringle, ISBN: 0521623626. Cambridge University Press, Cambridge, UK, 123 \n(1999) \n\n\\bibitem[\\protect\\citeauthoryear{Fabian et al.}{2000}]{fab00} \nFabian, A.~C., Iwasawa, K., Reynolds, C.~S., Young, A.~J.: Broad Iron \nLines in Active Galactic Nuclei. \\pasp\\ \\textbf{112}, 1145 (2000)\n\n\\bibitem[\\protect\\citeauthoryear{Fanton et al.}{1997}]{fan97} \nFanton, C., Calvani, M., de Felice, F., Cadez, A.: Detecting Accretion Disks in \nActive Galactic Nuclei. \\pasj\\ \\textbf{49}, 159 (1997) \n\n\\bibitem[\\protect\\citeauthoryear{Goosmann et al.}{2007a}]{gos07a} \nGoosmann, R.~W., Mouchet, M., Czerny, B., Dov{\\v c}iak, M., Karas, V., \nR{\\'o}{\\v z}a{\\'n}ska, A., Dumont, A.-M.: Iron lines from transient and \npersisting hot spots on AGN accretion disks. \\aap\\ \\textbf{475}, 155 (2007)\n\n\\bibitem[\\protect\\citeauthoryear{Goosmann et al.}{2007b}]{gos07b} \nGoosmann, R.~W., Dov{\\v c}iak, M., Karas, V.: Probing the irradiation \npattern of AGN accretion disks with future satellite missions.\\ SF2A-2007: \nProceedings of the Annual meeting of the French Society of Astronomy and \nAstrophysics,\\ \\textbf{186} (2007)\n\n\\bibitem[\\protect\\citeauthoryear{Hartnoll \\& Blackman}{2000}]{har00} \nHartnoll, S.~A., Blackman, E.~G.: Reprocessed emission from warped \naccretion discs with application to X-ray iron line profiles. \\mnras\\ \n\\textbf{317}, 880 (2000)\n\n\\bibitem[\\protect\\citeauthoryear{Iwasawa et al.}{2004}]{iwa04} Iwasawa, \nK., Miniutti, G., Fabian, A.~C.: Flux and energy modulation of redshifted iron \nemission in NGC 3516: implications for the black hole mass. \\mnras\\ \n\\textbf{355}, 1073 (2004)\n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c}}{2012}]{jov12} \nJovanovi{\\'c}, P.: The broad Fe K$\\alpha$ line and supermassive black holes. \n\\nar\\ \\textbf{56}, 37 (2012)\n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} et al.}{2011}]{jov11} \nJovanovi{\\'c}, P., Borka Jovanovi{\\'c}, V., Borka, D.: Influence of Black Hole \nSpin on the Shape of the fe K$\\alpha$ Spectral Line: the Case of 3C 405. Baltic \nAstronomy\\ \\textbf{20}, 468 (2011) \n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} \\& Popovi{\\'c}}{2008}]{jov08a} \nJovanovi{\\'c}, P., Popovi{\\'c}, L.~{\\v C}.: Observational effects of strong \ngravity in vicinity of supermassive black holes. Fortschritte der Physik\\ \n\\textbf{56}, 456 (2008) \n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} et al.}{2008}]{jov08b} \nJovanovi{\\'c}, P., Zakharov, A.~F., Popovi{\\'c}, L.~{\\v C}., Petrovi{\\'c}, T.: \nMicrolensing of the X-ray, UV and optical emission regions of quasars: \nsimulations of the time-scales and amplitude variations of microlensing events. \n\\mnras\\ \\textbf{386}, 397 (2008)\n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} \\& Popovi{\\'c}}{2009}]{jov09}\nJovanovi{\\'c}, P., Popovi{\\'c}, L. \\v{C}.: X-ray Emission From Accretion \nDisks of AGN: Signatures of Supermassive Black Holes, chapter in book ''Black \nHoles and Galaxy Formation'', Eds. A. D. Wachter and R. J. Propst, Nova Science \nPublishers, Inc, Hauppauge NY, USA, ISBN: 978-1-61761-398-2, 249 (2009), \narXiv:0903.0978 \n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} et al.}{2010}]{jov10} \nJovanovi{\\'c}, P., Popovi{\\'c}, L.~{\\v C}., Stalevski, M., Shapovalova, \nA.~I.: Variability of the H$\\beta$ Line Profiles as an Indicator of Orbiting \nBright Spots in Accretion Disks of Quasars: A Case Study of 3C 390.3. \\apj\\ \n\\textbf{718}, 168 (2010)\n\n\\bibitem[\\protect\\citeauthoryear{Jovanovi{\\'c} et al.}{2014}]{jov14}\nJovanovi{\\'c}, P., Borka Jovanovi{\\'c}, V., Borka, D., Bogdanovi{\\'c}, T.:\nComposite profile of the Fe K$\\alpha$ spectral line emitted from a binary \nsystem of supermassive black holes. Advances in Space Research \\textbf{54}, \n1448 (2014)\n\n\\bibitem[\\protect\\citeauthoryear{Karas et al.}{1992}]{kar92} Karas, V., \nVokrouhlicky, D., Polnarev, A.~G.: In the vicinity of a rotating black hole - A \nfast numerical code for computing observational effects. \\mnras \\textbf{259}, \n569 (1992)\n\n\\bibitem[\\protect\\citeauthoryear{Karas et al.}{2001}]{kar01} Karas, V., \nMartocchia, A., Subr, L.: Variable Line Profiles Due to Non-Axisymmetric \nPatterns in an Accretion Disc around a Rotating Black Hole. \\pasj\\ \\textbf{53}, \n189 (2001)\n\n\\bibitem[\\protect\\citeauthoryear{Kormendy \\& Ho}{2013}]{kor13} \nKormendy, J., Ho, L. C.: Coevolution (Or Not) of Supermassive Black \nHoles and Host Galaxies. \\araa\\ \\textbf{51}, 511 (2013)\n\n\\bibitem[\\protect\\citeauthoryear{Laor}{1991}]{laor91} Laor, A.: Line \nprofiles from a disk around a rotating black hole. \\apj \\textbf{376}, 90 (1991)\n\n\\bibitem[\\protect\\citeauthoryear{Lewis et al.}{2010}]{lew10} Lewis, \nK. T., Eracleous, M., Storchi-Bergmann, T.: Long-term Profile Variability in \nActive Galactic Nucleus with Double-peaked Balmer Emission Lines. \\apjs\\ \n\\textbf{187}, 416 (2010)\n\n\\bibitem[Misner et al.(1973)]{mis73} Misner, C. W., Thorne, K. S., \nWheeler, J. A.: Gravitation. W. H. Freeman, San Francisco, ISBN \n978-0-7167-0344-0 (1973)\n\n\\bibitem[\\protect\\citeauthoryear{Nandra et al.}{2007}]{nan07} Nandra, K., \nO'Neill, P.~M., George, I.~M., Reeves, J.~N.: An XMM-Newton survey of \nbroad iron lines in Seyfert galaxies. \\mnras\\ \\textbf{382}, 194 (2007)\n\n\\bibitem[\\protect\\citeauthoryear{Popovi{\\'c}}{2012}]{pop12} \nPopovi{\\'c}, L. {\\v C}.: Super-massive binary black holes and emission lines in \nactive galactic nuclei. \\nar\\ \\textbf{56}, 74 (2012)\n\n\\bibitem[\\protect\\citeauthoryear{Popovi{\\'c} et al.}{2011}]{pop11} \nPopovi{\\'c}, L. {\\v C}., Shapovalova, A. I., Ili{\\'c}, D., Kova{\\v \nc}evi{\\'c}, A., Kollatschny, W., Burenkov, A. N., Chavushyan, V. H., Bochkarev, \nN. G., Le{\\'o}n-Tavares, J.: Spectral optical monitoring of 3C 390.3 in \n1995-2007. II. Variability of the spectral line parameters. \\aap\\ \\textbf{528}, \nA130 (2011)\n\n\\bibitem[\\protect\\citeauthoryear{Popovi{\\'c} et al.}{2003a}]{pop03a} \nPopovi{\\'c}, L. {\\v C}., Jovanovi{\\'c}, P., Mediavilla, E., Munoz, J.~A.: \nInfluence of Microlensing on the Active Galactic Nucleus Fe K$\\alpha$ Line. \nAstronomical and Astrophysical Transactions \\textbf{22}, 719 (2003)\n\n\\bibitem[\\protect\\citeauthoryear{Popovi{\\'c} et al.}{2003b}]{pop03b} \nPopovi{\\'c}, L.~{\\v C}., Mediavilla, E.~G., Jovanovi{\\'c}, P., \\& Mu{\\~n}oz, \nJ.~A.: The influence of microlensing on the shape of the AGN Fe K$\\alpha$ line. \n\\aap\\ \\textbf{398}, 975 (2003) \n\n\\bibitem[\\protect\\citeauthoryear{Popovi{\\'c} et al.}{2006}]{pop06} \nPopovi{\\'c}, L.~{\\v C}., Jovanovi{\\'c}, P., Mediavilla, E., Zakharov, A.~F., \nAbajas, C., Mu{\\~n}oz, J.~A., Chartas, G.: A Study of the Correlation between \nthe Amplification of the Fe K{$\\alpha$} Line and the X-Ray Continuum of Quasars \ndue to Microlensing. \\apj\\ \\textbf{637}, 620 (2006)\n\n\\bibitem[\\protect\\citeauthoryear{Reynolds \\& Nowak}{2003}]{rey03} \nReynolds, C.~S., Nowak, M.~A. : Fluorescent iron lines as a probe of \nastrophysical black hole systems. \\physrep\\ \\textbf{377}, 389 (2003)\n\n\\bibitem[\\protect\\citeauthoryear{Shakura \\& Sunyaev}{1973}]{sha73} \nShakura, N. I., Sunyaev, R. A.: Black holes in binary systems. \nObservational appearance. \\aap\\ \\textbf{24}, 337 (1973)\n\n\\bibitem[\\protect\\citeauthoryear{Sim et al.}{2010}]{sim10} Sim, S. A., \nMiller, L., Long, K. S., Turner, T. J., Reeves, J. N.: Multidimensional \nmodelling of X-ray spectra for AGN accretion disc outflows - II \\mnras\\ \n\\textbf{404}, 1369 (2010)\n\n\\bibitem[\\protect\\citeauthoryear{Tanaka et al.}{1995}]{tan95} \nTanaka, Y., Nandra, K., Fabian, A. C., Inoue, H., Otani, C., Dotani, T., \nHayashida, K., Iwasawa, K., Kii, T., Kunieda, H., Makino, F., Matsuoka, M.: \nGravitationally redshifted emission implying an accretion disk and massive black \nhole in the active galaxy MCG-6-30-15. \\nat\\ \\textbf{375}, 659 (1995)\n\n\\bibitem[\\protect\\citeauthoryear{Tombesi et al.}{2007}]{tom07} Tombesi, \nF., de Marco, B., Iwasawa, K., Cappi, M., Dadina, M., Ponti, G., Miniutti, G., \nPalumbo, G.~G.~C.: Correlated modulation between the redshifted Fe K{$\\alpha$} \nline and the continuum emission in NGC 3783. \\aap\\ \\textbf{467}, 1057 (2007)\n\n\\bibitem[\\protect\\citeauthoryear{Turner \\& Miller}{2009}]{tur09} \nTurner, T.~J., Miller, L.: X-ray absorption and reflection in active \ngalactic nuclei. \\aapr\\ \\textbf{17}, 47 (2009) \n\n\\bibitem[\\protect\\citeauthoryear{Yan et al.}{2015}]{yan15} \nYan, C.-S., Lu, Y., Dai, X., Yu, Q.: A Probable Milli-parsec Supermassive \nBinary Black Hole in the Nearest Quasar Mrk 231. \\apj\\ \\textbf{809}, 117 (2015) \n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 29627, "prevtext": "\nwhere $q$ is power law emissivity index, $\\varepsilon_p$ is emissivity of \nperturbing region, and $(x_p,y_p)$ and $\\sigma_p$ are its position and width \n(both in $R_g$), respectively.\nAn illustration of the perturbed disk emissivity is presented in the top panel \nof Fig. \\ref{fig:pert}, and the perturbed and unperturbed Fe K$\\alpha$ line \nprofiles for three different positions and widths of perturbing region are given \nin the bottom panel of the same figure. As one can see from Fig. \\ref{fig:pert}, \na perturbing region on the receding side of accretion disk, affects only the \n''red wing'' of the Fe K$\\alpha$ line, while the ''blue'' one and the line core \nstay nearly unaffected. Moreover, the position of perturbing region is in a\ndirect relation with the position of the ''red peak'' of the line. \nRecently, a model of accretion disk with perturbing region was used for \nfitting the observed spectra of some AGNs, resulting with a non-random \ndistribution of bright spot positions along the receding side of the disk. This \nindicated that the most plausible physical mechanism which can explain such \nbehaviour is a fragmented spiral arm of the accretion disk \\citep[see e.g.][and \nreferences therein]{jov10,lew10}. Perturbing regions could be then explained by \nthe emissivity lumps caused by fragments in spiral arms, such as isolated \nclumps which could pass through the arm and dominate in its emissivity. The \nfragments naturally travel with the arm as it precesses through the disk, but \nsince the outer parts of an accretion disk are self-gravitating, the fragments \nof spiral arms could be also launched from the outer regions of the disk and \npropagate inward \\citep{lew10}. Besides, in the inner regions of the disk, the \ndisk winds and highly ionized fast outflows could play an important role and \ncould also cause the outward propagation of such clumps \\citep[see \ne.g.][]{pop11,sim10}. Since the flux variability caused by a spiral arm is on \ntimescales of a year to several years while its fragments cause shorter \nvariations on timescales of several months, this model is able to explain the \nobserved variability of some AGNs on the timescales ranging from several months \nto several years \\citep{lew10}. As it can be seen from Figure \\ref{fig:pert}, \nwhen a perturbation which originates in the inner regions of the disk and, due \nto some wind or outflow, spirals away along the receding side of the disk \nfurther from the central SMBH and toward the outer parts of the disk, it will \ncause the blueward shift of the ''red peak'' which will therefore move towards \nthe line core. This demonstrates that in some cases, the deformations of the \nline profiles could arise due to shifts of some of their parts, caused by the \nvariability of the disk emissivity \\citep[for more details see][]{jov10}.\n\n\\subsection{Line shifts in the binary systems of SMBHs}\n\\label{ss:smbb}\n\nBinary systems of supermassive black holes are formed in galactic mergers, and\nat some stage when two SMBHs become gravitationally bound and start to orbit \naround their center of mass, accretion of the surrounding matter on both SMBHs \ncould be expected and as a result, a strong line emission could arise (see \n\\citet{pop12} for theoretical aspects and \\citet{bon12,yan15} for observational \nevidences). In such a case, the Fe K$\\alpha$ line might be also observed, and \nit would most likely arise from both accretion disks around primary and \nsecondary SMBHs, located in a central low density cavity of a circumbinary disk \n\\citep{jov14}. Therefore, the Fe K$\\alpha$ line profiles emitted from both \naccretion disks might be affected by the Doppler shifts due to the orbital \nmotion of the SMBH binary, and in that case the corresponding signatures would \nbe imprinted in the observed composite line profile \\citep{jov14}.\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=\\columnwidth]{fig5.eps}\n\\caption{Composite profiles of the Fe K$\\alpha$ line emitted from the accretion \ndisks around two SMBHs in a binary system during three different phases of its \nKeplerian orbit. The parameters of the SMBH binary system are: mass ratio \n$q=1$, separation between the components of $a=0.01$ pc, inclination \n$i=60^\\circ$, eccentricity $e=0.75$, longitude of pericenter $\\omega=90^\\circ$ \nand systemic velocity $\\gamma=0$. Both accretion disks surround the slowly \nrotating Kerr primary and secondary SMBHs with the same spins $J/(M c)=0.1$ (M \nbeing the mass of a SMBH), and both of them extend from $R_{ms}$ to $30\\ R_g$, \nhave the same inclinations of $60^\\circ$, as well as power law emissivity \nindices of $p=2$}\n\\label{fig:smbb}\n\\end{figure}\n\nAssuming that the radial velocities of the primary and secondary components \nare $V_{1,2}^{rad} \\ll c$ so that the corresponding Doppler shifts due to \ntheir orbital motion are $\\approx V_{1,2}^{rad} / c$, a composite profile \n$F\\left(g\\right)$ of the Fe K$\\alpha$ line emitted from both accretion disks of \na SMBH binary at some orbital phase can be calculated from two constituent \nunshifted line profiles $F_1 \\left(g\\right)$ and $F_2 \\left(g\\right)$ according \nto \\citep{jov14}:\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eqn:smbb}\nF\\left(g\\right)=F_1\\left(\\left[\\frac{1}{g}-\\frac{V_1^{rad}}{c}\\right]^{-1}\n\\right)+F_2\\left(\\left[\\frac{1}{g}-\\frac{V_2^{rad}}{c}\\right]^{-1}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"F\\left(g\\right)=F_{1}\\left(\\left[\\frac{1}{g}-\\frac{V_{1}^{rad}}{c}\\right]^{-1}%&#10;\\right)+F_{2}\\left(\\left[\\frac{1}{g}-\\frac{V_{2}^{rad}}{c}\\right]^{-1}\\right).\" display=\"block\"><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo>(</mo><mi>g</mi><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>F</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo>(</mo><msup><mrow><mo>[</mo><mrow><mfrac><mn>1</mn><mi>g</mi></mfrac><mo>-</mo><mfrac><msubsup><mi>V</mi><mn>1</mn><mrow><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msubsup><mi>c</mi></mfrac></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>F</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo>(</mo><msup><mrow><mo>[</mo><mrow><mfrac><mn>1</mn><mi>g</mi></mfrac><mo>-</mo><mfrac><msubsup><mi>V</mi><mn>2</mn><mrow><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msubsup><mi>c</mi></mfrac></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]