[{"file": "1601.07050.tex", "nexttext": "\nFor medium orbit experiment, the signal has frequency about $0.1mHz$ and its magnitude will reach a few nanometers within $1\\sim 2$ days.\n\n\\begin{figure}[H]\n  \\centering\n  \\includegraphics[scale=0.32]{periodic.pdf}\n  \\caption{The illustration of the GM signal.}\n  \\label{signal}\n\\end{figure}\n\n\n\nTo understand the physical picture underlying the signal readout given in (\\ref{eq:signal}), we note that gravitomagnetic field, apart from generating a Lense-Thirring precession of the orbital plane,\nalso generates a precession of the orthonormal frame $\\bold e^{}_{(a)}$ \\cite{Schiff1960}. In particular, the results in the precession of the plane perpendicular to $\\bold e^{}_{(3)}$\nthat contains the TMs. As a result, the relative displacement of the two TMs is actually generated by the differential precession between the orbital plane and the plane perpendicular to $\\bold e^{}_{(3)}$ (see Fig.\\ref{diff}). If we regard $\\bold e^{}_{(a)}$ as a gyroscope resembling that in the GPB  experiment \\cite{gpb} and the orbit itself is also a gigantic gyroscope, then we may see that a very distinctive feature of the proposed measurement scheme is that, unlike GPB or LAGEOS/LARES \\cite{lageos1,lageos2,lares} which measures precession with respect to an globally defined inertial reference, it measures the differential precession of the two gyroscopes.\n\n\n\nWith the theoretical foundation of the measurement scheme worked out above, there remains many key issues to be resolved or understood in order to implement the measurement scheme in a physically realistic situation (see for instance \\cite{xupengLT2}). The study is still ongoing and we hope to report further progress in the near future.\n\n\n\n\n\n\n\\section{Concluding Remarks}\n\nAn overview is given on the work we have been doing in the past\nfew years in relation to detection of gravitational wave in space.\nNeedless to say there is no end to such study. It is envisaged that\nmore in depth study will be undertaken in the next few years to\ncontribute to the development of gravitational wave detection in\nChina.\n\n\n\n\n\n\n\n\\section*{ Acknowledgements}\nThe work presented here was  supported by the National Space Science Center, Chinese\nAcademy of Sciences (project number XDA04070400 and XDA04077700). Prof. Wenrui Hu¡¯s  effort to promote\ngravitational wave detection in space in China motivated our study in the first place.\nWe are also grateful to Prof. Shuangnan Zhang for his support\n throughout the course of our work.  Professors Shing-Tung Yau and Lo Yang have\nbeen very supportive and the Morningside Center of Mathematics provides a very conductive\nresearch environment to carry out the study. Partial support from the NSFC (contract numbers\n11305255,  11171329 and 41404019).\n\n\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{BenderALIA} Bender P L. Additional astrophysical objectives for LISA follow-on\nmissions. Class Quantum Grav, 2004, 21: S1203\n\n\\bibitem{BenderBegelman} Bender P L and Begelman M C. Trends in Space Science and Cosmic Vision 2020. ESA SP-588 (Noordwijk:ESA Publications Division) pp 33-8, 2005\n\n\\bibitem{8thLISA} Gong X, et al. A scientific case study of the ALIA mission. Class Quantum Grav, 2011, 27: 084010\n\n\\bibitem{LISA_JPCS} Gong X,  et al. Descope of the ALIA mission. To appear in Journal of Physics: Conference Series, 2014.\n\n\\bibitem{Xiandao} Lau Y K, et al. Feasibility study of gravitational wave detection in space. Report submitted to the National Space Science Center,\nChinese Academy of Sciences for the project XDA04070400, 2014\n\n\\bibitem{HilsBender} Bender P L and Hils D. Confusion noise level due to galactic and extragalactic\nbinaries. Class Quantum Grav, 1997, 14: 1439\n\n\\bibitem{FarmerPhinney} Farmer A J and Phinney E S. The gravitational wave background from cosmological compact binaries. Mon Not R Astron Soc, 2003, 346: 1197\n\n\n\n\\bibitem{Sesana2007} Sesana A, Volonteri M and Haardt F. The imprint of massive black hole formation models on the LISA data\nstream. Mon. Not. R. Astro. Soc., 2007, 377: 1711\n\n\\bibitem{Arun} Arun K G, et al. Massive Black Hole Binary Inspirals: Results from\nthe LISA Parameter Estimation Taskforce. Class. Quantum Grav., 2009, 26: 094027\n\n\\bibitem{NGO_1} NGO -- Revealing a hidden Universe: opening a new chapter of discovery£ºAssessment Study Report\" ESA/SRE(2011)19 December 2011\n\n\n\\bibitem{Anselmi}A.Anselmi, et al. Assessment of a Next Generation\nMission for Monitoring the Variations of Earth¡¯s Gravity. Final\nReport, Document SD-RP-AI-0668,Thales Alenia Space,22 (2010).\n\n\\bibitem{Gruber}Gruber Th., et al. Earth\nSystem Mass transport mission: Concept for a Next Generation Gravity\nField Mission, Final Report, NGGM-D (2014).\n\n\\bibitem{sneeuw}Sneeuw, N. J. A Semi-Analytical Approach to Gravity Field\nAnalysis from Satellite Observations. Bayerische Akademie d.\nWissenschaften, Munich (2000).\n\n\\bibitem{Zhengwei}Zheng Wei, et al. Accurate and rapid error estimation on global gravitational field from current GRACE and future GRACE Follow-On missions, Chinese Physics B, 18(08): 3597$\\sim$3604 (2009).\n\n\n\\bibitem{gaowei}Wei Gao, et al. Possible application of future satellite gravity mission to earthquake study in China, a scientific case study of the Wenchuan earthquake. To appear in GRACE Fellow-On in China,A Program of Space Advance Graivty Measurement.\n\n\\bibitem{xupengGRACE} Peng Xu et al, A preliminary study of level 1A data processing of a low-low\nsatellite to satellite tracking mission, accepted to be published in Journal of Geodesy and Geodynamics.\n\n\n\\bibitem{Thorne1988}Thorne K S, Gravitomagnetism, jets in quasars, and\n  the Stanford Gyroscope Experiment, in \\emph{Near Zero: New Frontiers\n  of Physics} edited by Fairbank J D and etc., 1988, pp. 573-586.\n\n\n\\bibitem{Ciufolini1995}Ciufolini I and Wheeler J A, \\emph{Gravitation\n  and Inertia}. 1995, Princeton University Press.\n\n\\bibitem{Braginskii1980}Braginskii V B and Polnarev A G, Relativistic spin-quadrupole gravitational effect,\nZhETF Pis ma Redaktsiiu, 1980, \\textbf{31}, 444.\n\n\n\n\\bibitem{Mashhoon1989}Mashhoon B, Paik H J and Will C M, Detection of the gravitomagnetic field using an orbiting superconducting gravity gradiometer. Theoretical principles, Phys. Rev. D, 1989, \\textbf{39}, 2825.\n\n\n\n\\bibitem{xupengLT1}Peng Xu et al, Precision measurement of planetary\n  gravitomagnetic field in general relativity with laser\n  interferometry in space (I) ¡ª Theoretical foundations. preprint\n\n\n\\bibitem{Clohessy1960}Clohessy W H and Wiltshire R S, Terminal Guidance System for\n  Satellite Rendezvous. Journal of the Aerospace Sciences, 1960,\n  \\textbf{27}, 653.\n\n\n\n\n\\bibitem{Schiff1960}Schiff L I, Motion of a Gyroscope According to\n  Einstein's Theory of Gravitation. Proceedings of the National\n  Academy of Science, 1960, \\textbf{46}, 871-882.\n\n\\bibitem{gpb}Everitt C W F et al, Gravity Probe B: Final Results of a Space Experiment to Test General Relativity, Phys. Rev. Lett., 2011, \\textbf{106}, 221101.\n\n\\bibitem{lageos1}Ciufolini I, A Comprehensive Introduction to the LAGEOS Gravitomagnetic Experiment: From the Importance of the Gravitomagnetic Field in Physics to Preliminary Error Analysis and Error Budget, International Journal of Modern Physics A, 1989, \\textbf{4}, 3083.\n\n\\bibitem{lageos2}Ciufolini I and Pavlis E C, A confirmation of the general relativistic prediction of the Lense-Thirring effect, Nature, 2004, \\textbf{431}£¬958.\n\n\\bibitem{lares}Ciufolini I et al, Testing General Relativity and gravitational physics using the LARES satellite,\nEuropean Physical Journal Plus, 2012, \\textbf{127}, 133.\n\n\\bibitem{xupengLT2}Peng Xu et al, Precision measurement of planetary\n  gravitomagnetic field in general relativity with laser\n  interferometry in space (II) ¡ª Signal to Noise Ratio Analysis. preprint\n\n\n\n\\end{thebibliography}\n\n\n\n\n\n\\end{multicols}\n\n\n\n", "itemtype": "equation", "pos": 18475, "prevtext": "\n\n\n\\pdfoutput=1\n\n\n\\begin{picture}(0,0){\\rm\n\\put(0,-20){\\makebox[160truemm][l]{\\bf {\\sanhao\\raisebox{2pt}{.}}\nInvited Review  {\\sanhao\\raisebox{1.5pt}{.}}}}}\n\\put(0,-34){\\jiuwuhao {\\textcolor[rgb]{0.5,0.5,0.5}{\\sf \n}}}\n\\end{picture}\n\n\n\n\n\n\n\n\n\n\n\n\\Year{2015} \n\\Month{January} \n\\Vol{58} \n\\No{1} \n\\BeginPage{1} \n\\EndPage{11} \n\\AuthorMark{{\\rm Gao W}, et al.}  \n\\AuthorMarkCite{{\\rm }, et al.} \n\\DOI{10.1007/s11433-014-5609-8} \n\\ArtNo{014201}\n\n\n\n\\title{Roadmap for\ngravitational wave detection in space\\\\\n -- a preliminary study$^\\dagger$}\n\n\n\\author[1,2]{GAO Wei}{}\n\\author[1,3]{XU Peng}{}\n\\author[1,2]{BIAN Xing}{}\n\\author[1,4]{CAO Zhoujian}{}\n\\author[5]{CHANG Zijing}{}\n\\author[1,3]{DONG Peng}{}\n\n\\author[1]{\\\\GONG Xuefei}{}\n\\author[6]{HUANG Shuanglin}{}\n\\author[7]{JU Peng}{}\n\\author[8]{LUO Ziren}{}\n\\author[7]{QIANG Li'e }{}\n\\author[9]{TANG Wenlin}{}\n\n\\author[10]{\\\\WAN Xiaoyun}{}\n\\author[5]{WANG Yue}{}\n\\author[1]{XU Shengnian}{}\n\\author[1,2]{ZANG Yunlong}{}\n\\author[6]{ZHANG Haipeng}{}\n\\author[1,3,5*]{LAU Yun-Kau}{}\n\n\n\\address[{\\rm1}]{Institute of Applied Mathematics, Academy of Mathematics and Systems Science, Chinese\nAcademy of Sciences, Beijing 100190, China;}\n\\address[{\\rm2}]{University of Chinese Academy of Sciences, Beijing 100049, China;}\n\\address[{\\rm3}]{Morningside Center of Mathematics, Chinese Academy of Sciences, Beijing 100190, China;}\n\\address[{\\rm4}]{State Key Laboratory of Scientific and Engineering Computing, Academy of Mathematics and Systems Science, Chinese Academy of Sciences, Beijing 100190, China;}\n\n\\address[{\\rm5}]{Department of Mathematics, Henan University, Kaifeng, Henan 475001, China;}\n\\address[{\\rm6}]{Department of Mathematics, Capital Normal University, Beijing 100089, China;}\n\\address[{\\rm7}]{Department of Geophysics, College of the Geology Engineering and Geomatics, Chang'an University, Xi'an 710054, China;}\n\\address[{\\rm8}]{Max-Planck-Institut f\\\"{u}r Gravitationsphysik (Albert Einstein Institut), D-30167 Hannover, Germany;}\n\n\\address[{\\rm9}]{Aerospace Flight Dynamics Laboratory, Beijing Aerospace Control Center, Beijing 100094, China;}\n\\address[{\\rm10}]{Qian Xuesen Laboratory of Launch Vehicle Technology, Beijing 100094, China;}\n\n\\maketitle \\vspace{-3.5mm}{\\footnotesize\\begin{center} Received August 13, 2014; accepted September 1, 2014; published online September 29, 2014\n\\end{center}}\\vspace*{-5mm}\n\n\n\n\\begin{center}\n\\rule{16.5cm}{0.4pt}\n\\parbox{16.5cm}\n{\\begin{abstract}\n\\end{abstract}}\n\\end{center}\\vspace*{-0.6cm}\n\n\\begin{center}\n\\parbox{16.5cm}\n{\\bf\\jiuhao }\n\\end{center}\n\n\\begin{center}\n{\\PACS{\\rm 67.85.Lm, 03.75.Ss, 05.30.Fk}}\n\n\\Cit{GAO W. et al. Roadmap for\ngravitational wave detection in space -- a preliminary study.\nSci China-Phys Mech Astron,\n2015, 58: 014201, doi: 10.1007/s11433-014-5609-8 }\n\\end{center}\n\n\\begin{center}\n\\parbox{16.5cm}\n{\\bf\\jiuhao Gravitational wave detection in space, relativistic experiment, satellite gravity, grace follow-on, gravitomagnetism, post-Newtonian approximation.}\n\\end{center}\n\n\\textwidth=178truemm \\textheight=236truemm\n\n\n\\wuhao\\vspace*{1.5mm}\n\n\\begin{multicols}{2}\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\nIn 2008, under the auspices of the National Microgravity\nlaboratory of the Institute of Mechanics, Chinese Academy of\nSciences (CAS), an (unofficial) gravitational physics  consortium\ncomprising a number of institutes and universities both within and\noutside the CAS was established. The primary objective of the consortium is to\ncoordinate and promote research in the  detection of gravitational\nwave in space in China. A roadmap was soon worked out  in order to\nbuild up  the expertise and required technologies step by step for\nfuture prospective Chinese mission. As\na first step of the roadmap, a geodesy mission to monitor the\ntemporal variation of the Earth gravity field using low-low\nsatellite to satellite tracking by means of laser interferometry\nwill be developed. This will enable us to acquire the key\ntechnologies at a lower level of precision and at the same time\nassemble a core team for further development. As a geodesy mission\nwill only test laser interferometry in space and is less stringent\nin requirement in inertial sensor related technologies, a LISA\nPathfinder (LPF) type mission is also required at some stage to test\nthe inertial sensor and the related dragfree technologies to the\nlevel of precision required by gravitational wave detection. As the\ntwo proof masses in a LPF type mission may be regarded naturally as\na one dimensional gravity gradiometer, in recent years, some work\nhas also been ongoing to explore possible additional scientific\nbenefits of a LPF type mission, apart from testing the key\ntechnologies in space.\n\nSupported by the Xiandao (pioneer explorer) program of the National\nSpace Science Center of the CAS, the general relativity group of the\nMorningside Center of Mathematics and Institute of Applied Maths,\nCAS have been undertaking the task of doing preliminary study on\nthe prospective missions outlined in the roadmap. The purpose of\nthe present article is to present an overview of the work we have\nbeen doing in this area.\n\n\nThe outline of the present article is described as follows. In the\nnext section,  we will outline a feasible design and its primary science driver for a mission to detect gravitational waves in space.\nThis is then followed in Section 3 by a sketch of a geodesy mission study we have been doing. In Section 4, we will discuss the\nprecision measurement of the Earth's gravitomagnetic field  as possible additional science for a LISA Pathfinder type mission.\nSone brief remarks will be made in Section 5 to conclude this paper.\n\n\n\n\n\n\n\\section{Gravitational wave detection in space}\nConcurrent to the mission study in satellite gravity beginning in 2009 which will be described in next section,\na preliminary study was also made on the scientific potential of a spaceborne gravitational detector whose most sensitivity\nfrequency band centers around 0.01 or 0.1 Hz. The main theme of the study was to look at possible gravitational wave sources around 0.01Hz which was\nnot entirely well understood at then. With  ALIA adopted as a representative mission concept around the 0.01Hz band, further analysis revealed that there is a\nrich source of intermediate mass black hole binaries at high redshift and the detection would shed light on the black hole-galaxy coevolution\nduring the structural formation process of the Universe.\n\nDuring 2011-2013,  a subsequent, more indepth study was made.  This time technological constraints were taken into account\nand we strived to obtain a balance between merits in science and viability in technologies. With this guideline in mind, after examining a few mission options,\na mission concept with the\nfollowing  baseline design parameters is favoured as a blueprint for more in depth study in the near future.\n\\vskip 10pt\n\n\n\n\\footnotesize\n\n\n\\begin{table}[H]\n\\footnotesize\n\\begin{tabular}{|l|l|l|l|l|}\n  \\hline\n  \n  L\\,(m) & D\\,(M) & P\\,(W) &     $S_{\\rm posi}\\,(\\frac{\\textrm{pm}}{\\sqrt{\\textrm{Hz}}})$  & $S_{\\rm acc}\\,(\\frac{{\\textrm m}~{\\textrm s}^{-2}}{\\sqrt{\\textrm{Hz}}}) $ \\\\\n\\hline\n $3\\times10^9$ & 0.45-0.6 & 2 & 5-8 & $3\\times10^{-15}\\,(>0.1\\textrm{mHz})$ \\\\\\hline\n\\end{tabular}\\label{parameters}\n\\caption{Baseline design parameters.}\n\\end{table}\n\n\n\n\\begin{figure}[H]\n\\includegraphics[scale=0.38]{Sensitivities3.pdf}\n\\caption{Sensitivity curves of the mission designs, taken into consideration  the confusion\n noise generated by both galactic and extra-galactic compact binaries converted from those by Hils and Bender \\cite{HilsBender} and Farmer and Phinney \\cite{FarmerPhinney}.\n}\n\\label{sensitivity}\n\\end{figure}\n\n\\wuhao\nThe capability of the mission designs to detect lighter seed black holes at high redshifts is illustrated in Figure \\ref{range1} .\n\n\\begin{figure}[H]\n\\includegraphics[scale=0.4]{range1.pdf}\n\\caption{All-angle averaged detection range under a\nsingle Michelson threshold SNR of 7 for 1:4 mass ratio IMBH-IMBH\nbinaries, one year observation prior to merger. For each mission option, both upper and lower confusion noise levels (represented by the dashed curve and dotted dashed curve respectively) due to extragalactic compact binaries are considered.}\\label{range1}\n\\end{figure}\n\nA semi-analytic Monte Carlo simulation was also\ncarried out to understand the cosmic black hole merger histories starting from intermediate\nmass black holes at high redshift as well as the possible scientific merits of the mission design\n in probing the light seed black holes and their coevolution with galaxies in early\nUniverse.\n\n\n\\begin{figure}[H]\n\\includegraphics[scale=0.21]{detectionrate2.pdf}\n\\caption{Event rates given by the area enclosed by the curves.}\n\\label{detectionrate}\n\\end{figure}\n\nMoreover, the mission design is also capable of probing\nIMRI (intermediate mass ratio inspiral)  in dense star\nclusters in the local Universe. Presented in Table 2 is some event rate calculations  for IMRIs in local Universe.\nThe results are given in Table 2. It should be remarked that  estimate is model dependent and subject to many uncertainties and  we should not\nattach too much importance to the precise numbers. Instead, it illustrates  the advantage of shifting slightly the most sensitive region of the measurement band\nto a few hundredth Hz. As far as  IMRIs are concerned, the\n event rate goes up as the cubic of the improvement in sensitivity.\n\n\n\\begin{table}[H]\n\\begin{center}\n\\footnotesize\n\\begin{tabular}{|l|l|l|}\n\\hline\nMission option  &\\ \\ \\ Upper level of   \\ \\ \\ &\\ \\ \\   Lower level of \\ \\    \\\\\n  &\\ \\ \\ \\ \\ confusion   \\ \\ \\ \\ \\ \\ \\ \\ & \\ \\ \\ \\ \\ \\   confusion    \\\\\n \\hline\n\n\n\n\n5pm (D=0.6m) &\\ \\ \\ \\ \\ \\ \\ \\ \\ $\\sim90$ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ &\\ \\ \\ \\ \\ \\ \\ \\ $\\sim130$   \\\\ \\hline\n\n8pm (D=0.45m)&\\ \\ \\ \\ \\ \\ \\ \\ \\ $\\sim26$ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\ &\\ \\ \\ \\ \\ \\ \\ \\ \\ $\\sim32$   \\\\ \\hline\n\n\n\\end{tabular}\n\\caption{Expected globular cluster harbored IMBH-BH final inspirals and mergers detectable for year-long observation, scaled in unit of\n$\\frac{f_{tot}}{0.1}\\frac{\\nu_0}{10^{-10}{\\textrm{yr}}^{-1}}\\frac{10M_{\\odot}}{\\mu}$.}\n\\end{center}\n\\end{table}\n\n\n\n\n\n\n\nThe result of the study suggests that,  by choosing the armlength of the interferometer to be three\nmillion kilometers and shifting the sensitivity\nfloor to around one-hundredth Hz, together with\na very moderate improvement on the position noise budget, there are certain mission options\ncapable of exploring light seed, intermediate mass black hole binaries at high redshift that are\nnot readily accessible to eLISA/LISA, and yet the technological requirements seem to within\nreach in the next few decades for China.\n\n\n\n\n\\section{Low-low satellite to satellite tracking using laser interferometry}\n\nIn 2009, commissioned by the National Space Science  Center, Chinese\nAcademy of Sciences,  a comprehensive study was undertaken in order\nto understand  various aspects of a future low-low satellite to\nsatellite tracking mission with microwave ranging replaced by laser\ninterferometry.\n\n\nDuring the feasibility study, different groups\nundertaking different tasks within the mission study suggested\npossible mission designs for future satellite gravity missions. Due\nto the limitation imposed by aliasing generated by the atmosphere\nand ocean currents, perhaps in a way not too surprising, subject to\nminor variations, all groups came up with very similar mission\ndesign(see for instance Zheng), compare also with that of the NGGM mission (Gruber, Anselmi) whose misson design parameters are given in the following table.\n\n\n\\begin{table}[H]\n\\footnotesize\n\\begin{tabular}{|c|c|c|c|c|c|c|}\n\\hline\n&Mission &  & Accelero- & Laser & Satellite & Inter \\\\\n&duration  & Orbit & meter (mHz & (mHz & altitude & satellite\\\\\n & &  & to 3Hz) & to 3Hz) & & range\\\\\\hline\n1&10-year  & Polar & ${10}^{-10}$ & $10\\sim30$  & $300\\text{km}$ & $50\\sim$\\\\\n & &  & ${\\textrm{ms}}^{-2}{\\textrm{Hz}}^{-1/2}$ & $\\textrm{nm}{\\textrm{Hz}}^{-1/2}$  & & $200\\textrm{km}$\\\\\\hline\n2&10-year  & Polar & ${10}^{-9}$ & $10\\sim30$  & $420\\sim$ & $50\\sim$\\\\\n & &  & ${\\textrm{ms}}^{-2}{\\textrm{Hz}}^{-1/2}$ & $\\textrm{nm}{\\textrm{Hz}}^{-1/2}$  & $450\\textrm{km}$ & $200\\textrm{km}$\\\\\\hline\n\\end{tabular}\n\\begin{center}\n\\caption{Baseline design parameters for two representative mission options.}\n\\end{center}\n\\end{table}\n\\vskip 10pt\n\n\n\n\n\n\n\n\n\n\n\n\nThe critical difference between the two mission designs is the attitude of the orbit. For option 1 in Table 3, thruster (dragfree) technology is required\nto maintain the orbit at such a low attitude.\n\n\n\nBy means of the semi-analytic method (Sneeuw), the capability of static gravity field recovery of\nthe mission designs is illustrated in Fig.\\ref{alti}$\\sim$Fig.\\ref{accu}.\n\n\\begin{figure}[H]\n\\centering\n \\includegraphics[scale=0.46]{var1.pdf}\n \\caption{Static gravity field recovery in terms of spherical harmonic degree variance for different altitudes (range: 100km, laser metrology: $10nm/\\sqrt{Hz}$).}\n \\label{alti}\n\\end{figure}\n\\begin{figure}[H]\n\\centering\n \\includegraphics[scale=0.46]{var2.pdf}\n \\caption{Static gravity field recovery in terms of spherical harmonic degree variance for different laser accuracy (altitude: 300km, range: 100km).}\n \\label{accu}\n\\end{figure}\n\n\n\nFor the capability to track temporal variation of the Earth gravity field, using the GLDAS model and taking into account of AOD aliasing,\nthe hydrological signal recovery is displayed in the following figures for the two mission design considered.\n\n\\begin{figure}[H]\n \\includegraphics[scale=0.32]{truth.pdf}\n \\caption{GLDAS anomaly for October, 2009, up to degree and order 90.Unites of ugal gravity anomaly.}\n\\end{figure}\n\n\\begin{figure}[H]\n \\includegraphics[scale=0.32]{hydro_300km.pdf}\n \\caption{Recovered GLDAS anomaly for October, 2009, up to harmonic degree 90.(Altitude at 300km with 400km Gauss filter).}\n \\label{fig:amss1}\n\\end{figure}\n\n\\begin{figure}[H]\n  \\includegraphics[scale=0.32]{hydro_450km.pdf}\n \\caption{Recovered GLDAS anomaly for October, 2009, up to harmonic degree 90.(Altitude at 450km with 400km Gauss filter).}\n \\label{fig:amss1}\n\\end{figure}\n\nWork is still ongoing to understand the various aspects of the mission concepts (see for instance Gaowei, Xupeng).\n\n\\section{Precision measurement of gravitomagnetic field in terms of gradiometry}\\label{}\n\n\n\nApart from detection of gravitational waves, another outstanding\nproblem in experimental relativity is the detection of gravitomagnetic\nfield \\cite{Thorne1988,Ciufolini1995} of a rotating body which may be regarded as a test of general relativity\nat the planetary scale.\n As the GM field is part of the spacetime curvature,\nit will contribute to the tidal forces acting on a family of nearby free falling particles.\nIt is  natural to contemplate to detect its presence through the measurement of  the tidal force gradient\ngenerated by the GM field \\cite{Braginskii1980,Mashhoon1989}.\nAs the two free falling test masses (TMs) in the LISA Pathfinder type mission naturally constitute\na one dimensional gravity gradiometer, apart from testing the technologies\nfor gravitational wave detection, we also try to look at whether\nsuch mission is also capable of measuring GM field around a planet.\n\n\n\\begin{figure}[H]\n\\centering\n\\includegraphics[scale=0.30]{sc_frame-2.pdf}\n\\caption{Two TMs are housed in the along track direction following a nearly circular orbit. The spacecraft may be viewed as a gyroscope rolling about the transverse direction $\\bold e^{}_{(3)}$.}\n\\label{sc-frame}\n\\end{figure}\n\nConsider an ideal case in which the Earth is modelled as a uniform rotating\nspherical body. Let $(t, x_i), i=1,2,3$ be the Earth centered coordinates and $\\bold e^{}_{(a)}$, $a=1,2,3$ be the Earth pointing orthonormal three frame attached to the\ncenter of mass of the spacecraft. Units in which $c = G = 1$ will be adopted.\n\n\n\nGiven an Earth pointing, drag-free spacecraft orbiting the Earth in a nearly circular orbit (radius $a\\approx 1000km$) with constant inclination $i$. Two TMs are housed in the along track direction separated by a distance $d\\approx 50cm$. (see Fig.\\ref{sc-frame}). Let $\\delta^i$ be the relative displacement of the two TMs.\nIn a time scale short compared with the Lense-Thirring precession of the orbital plane and subject to $\\delta^i\\ll d  $, at the 1PN level, the geodesic deviation (Jacobi) equation\ndescribing the relative displacement $\\delta^i$ may be simplified to become (see\n\\cite{xupengLT1} for details)\n\\begin{eqnarray}\n\\ddot{\\delta}^{1}(t)&=&-2\\omega\\text{\\ensuremath{\\dot{\\delta}^{2}}(\\ensuremath{t})}+\\frac{6J\\omega d\\cos i}{a^{3}},\\nonumber\\\\\n\\ddot{\\delta}^{2}(t)&=&2\\omega\\dot{\\delta}^{1}(t)+3\\omega^{2}\\text{\\ensuremath{\\delta^{2}}}(t)-\\frac{9dJ\n  t \\omega^{2}\\cos i}{a^{3}},\\nonumber\\\\\n\\ddot{\\delta}^{3}(t)&=&-\\omega^{2}\\text{\\ensuremath{\\delta^{3}}}(t)+\\frac{3dJ\\omega\\sin\n    i\\cos(\\omega t)}{a^{3}}.\\label{d3}\n\\end{eqnarray}\nAt the Newtonian level, we recover the  well known  Clohessy Wiltshire \\cite{Clohessy1960} (Hill) equation from (\\ref{d3}).\n\n\n\n\n\n\\begin{figure}[H]\n  \\centering\n  \\includegraphics[scale=0.28]{tidal.pdf}\n  \\caption{For a circular orbit, take one TM as reference, the motion of the second TM in the transverse direction is equivalent to that of a forced harmonic oscillator with natural frequency which matches that of the orbital frequency.}\n  \\label{tidal}\n\\end{figure}\n\nIn the direction transverse to the orbit plane, at the Newtonian level, it is known that the relative motion of the two TMs resembles that of a simple\nharmonic oscillator (see Fig.\\ref{tidal}). The presence of a gravitomagnetic field serves to generate a Lorentz type force\nacting on the TMs and results in a forced harmonic motion. Up to a constant, the frequency of the force matches the frequency $\\omega=\\sqrt{\\frac{M}{a^3}}$ determined by the central\ngravitational potential and this gives rise to  a resonant forced harmonic oscillation. Further numerical simulations indicate that the resonant\noscillation prevails for more general elliptic orbits and with Earth gravity field multiples taken into account. The amplitude of the oscillation will\nnot grow unbounded when nonlinearity of the Lense-Thirring precession of the orbit plane takes effect, but this will occur in a time scale much longer than the mission lifetime  of around\none year. By integrating the PN generalization of the CW equations in (\\ref{d3}), we further find that the growing oscillation amplitude of the TMs in the transversal direction is given by (see Fig.\\ref{signal})\n\n", "index": 1, "text": "\\begin{equation}\ns_{GM}(t)=\\frac{3GdJ\\sin i\\sin(\\omega t)}{2c^{2}a^{3}}t,\\label{eq:signal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"s_{GM}(t)=\\frac{3GdJ\\sin i\\sin(\\omega t)}{2c^{2}a^{3}}t,\" display=\"block\"><mrow><mrow><mrow><msub><mi>s</mi><mrow><mi>G</mi><mo>⁢</mo><mi>M</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>3</mn><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>J</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>i</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ω</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>c</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>a</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]