[{"file": "1601.04863.tex", "nexttext": "\nwhere $k=\\omega/c$ is the wave-number. Since this work considers an\nunbounded exterior domain, then $p$ must also satisfy the Sommerfeld\nradiation condition. \n\n\n\nThe superposition method approximates $p$ at some point\n$\\mathbf{x}\\in\\bar{\\Omega}_+$ using a basis expansion of the form\n\n", "itemtype": "equation", "pos": 11278, "prevtext": "\n\n\\markboth{Nadia M. Abusag and David J. Chappell} {On sparse\nreconstructions in near-field acoustic holography using the method\nof superposition}\n\n\n\n\n\n\n\n\\title{ON SPARSE RECONSTRUCTIONS IN NEAR-FIELD ACOUSTIC HOLOGRAPHY USING THE METHOD OF SUPERPOSITION}\n\n\\author{NADIA M. ABUSAG and DAVID J. CHAPPELL\\\\ School of Science and Technology,\\\\ Nottingham Trent University,\\\\\nNottingham, UK}\n\n\\maketitle\n\n\n\n\n\n\n\\begin{abstract}\nThe method of superposition is proposed in combination with a sparse\n$\\ell_1$ optimisation algorithm with the aim of finding a sparse\nbasis to accurately reconstruct the structural vibrations of a\nradiating object from a set of acoustic pressure values on a\nconformal surface in the near-field. The nature of the\nreconstructions generated by the method differs fundamentally from\nthose generated via standard Tikhonov regularisation in terms of the\nlevel of sparsity in the distribution of charge strengths specifying the basis. In many cases, \nthe $\\ell_1$ optimisation leads to a solution basis whose size is\nonly a small fraction of the total number of measured data points.\nThe effects of changing the wavenumber, the internal source surface\nand the (noisy) acoustic pressure data in general will all be\nstudied with reference to a numerical study on a cuboid of similar\ndimensions to a typical loudspeaker cabinet. The development of\nsparse and accurate reconstructions has a number of advantageous\nconsequences including improved reconstructions from reduced data\nsets, the enhancement of numerical solution methods and wider\napplications in source identification problems.\n\\end{abstract}\n\n\n\n\n\\section{Introduction}\n\nNear-field acoustic holography (NAH) was first documented in $1980$\n\\cite{EW80a,EW80b} as a method for reconstructing acoustic radiation\nfrom vibrating structures based on acoustic pressures measured in a\nhologram plane. This was originally carried out using Fourier\nacoustics and so was only suitable for geometries corresponding to\nthe separable geometries of the acoustic wave equation such as an\ninfinite plane, an infinite cylinder or a sphere in a free field.\nRecent progress \\cite{GC12} has seen ideas from signal processing\nand imaging, and in particular the much celebrated compressive\nsampling (or compressed sensing) \\cite{EC08}, adopted to reduce\nmeasurement requirements and reconstruct acoustic fields above the\nNyquist frequency. In this paper we develop a method based on an\ninverse formulation of the superposition method proposed by Koopman\n\\emph{et al.} \\cite{GK89} that can reconstruct acoustic fields from\narbitrary shaped radiating objects and make use of sparse\nreconstruction principles as proposed in Ref. \\cite{GC12}.\n\nNear-field acoustic holography for arbitrary geometries was first\nperformed using the inverse boundary element method (IBEM)\n\\cite{BG88}. A large number of publications on IBEM have since\nemerged, and more recently with the IBEM combined in hybrid methods\nwhich employ expansions of particular solutions of the Helmholtz\nequation to enrich the measured pressure data \\cite{SW02,SW04}. One\ndrawback of the IBEM is that it suffers from the same irregular\nfrequency problem (at the resonances of the associated interior\ndomain) as the forward boundary element method (BEM) \\cite{DC09}.\nWhilst this problem can be treated using the same methods as for the\nforward problem (for example, using the Burton and Miller method\n\\cite{AB71} as in Ref. \\cite{DC09}, or the so-called combined\nHelmholtz integral equation formulation (CHIEF) \\cite{HS68}), such\nmethods complicate the implementation and reduce the computational\nefficiency to some degree.\n\nIn addition to the irregular frequency problem, boundary element\napproaches also require very fine meshes to accurately represent\nsolutions at high frequencies, and to give good representations of\nthe acoustic field in the immediate vicinity of the radiating\nobject. A number of methods have been suggested to resolve the\nshortcomings of IBEM in a manner that is both computationally\nefficient and relatively straightforward to implement. These methods\neffectively fit the measured pressure data to a linear combination\nof basis functions, and then use the coefficients determined through\nthis approximation to determine the normal velocity of the vibrating\nobject. The most well-known of these methods with respect to NAH are\nthe Helmholtz equation least squares (HELS) method proposed by Sean\nWu and co-workers \\cite{ZW97,SW00} and the method of superposition,\nwhich was applied to NAH in Refs. \\cite{AS05,NV06}, including a\ncomparison against boundary element approaches in the latter case.\nFor HELS, the basis functions are chosen as particular solutions to\nthe Helmholtz equation on an idealised domain, typically a sphere.\nIn the case of the superposition method then it is the free space\nGreen's functions that are employed for the basis.\n\nIt is shown in Ref. \\cite{GK89} that the superposition method for an\nexterior acoustic problem is equivalent to the Helmholtz integral\nequation. This is one reason for favoring the superposition approach\nto HELS, where the chosen basis is typically only complete outside\nthe minimum sphere enclosing the radiating object \\cite{SW00}. This\nwould be a drawback for approximating radiation from objects that\nare far from spherical in the region inside this minimum sphere.\nKoopman \\emph{et al.} \\cite{GK89} also argue that the superposition\nmethod will not suffer from the same irregular frequency problem as\nthe boundary element method since the set of source points chosen\nfor the superposition (after truncating the superposition integral\nto a finite sum) will not form a unique boundary surface inside the\ninterior volume. However, the computations in Ref. \\cite{GK89} were\nonly performed with small numbers of source points, and irregular\nfrequency problems may arise should the source points more closely\nrepresent an interior boundary surface \\cite{WB97,AL10}.\n\nOne of the main challenges involved in the superposition method is\nobtaining an optimal choice of source (or charge) points over which\nto compute the superposition. In particular, research on (forward)\ninterior Helmholtz problems \\cite{AB08} suggests that the source\npoints should be chosen close to the radiating surface so that no\nsingularities of the analytically continued solution lie between the\ncharge points and the radiating surface. However, for the exterior\nproblem, Koopman \\emph{et al.} \\cite{GK89} report that choosing the\ncharge points too close to the radiating surface degrades the\naccuracy of the method, whilst choosing charge points too far from\nthe surface leads to very poor conditioning. Applying the\nsuperposition method together with a nonlinear optimisation\nalgorithm to optimise the accuracy of the solution over both the\ncharge point strengths and locations is known as the method of\nfundamental solutions, see for example Refs. \\cite{GF98,GF03}. We\nwill show that in combination with sparse optimisation methods, a\nrelatively small number of charge points can be chosen to accurately\nreconstruct the surface velocity, particularly in the sub-Nyquist\nfrequency regime.\n\nRegularisation schemes for NAH are typically based on standard\nTikhonov methods, an excellent overview is presented in Ref.\n\\cite{EW01}. The most favorable method for selecting the\nregularisation parameter in NAH applications is reported as a\nmodified generalised cross validation (GCV) method, although many\nother possibilities are discussed in Ref. \\cite{EW01}. Recent work\n\\cite{GC12} has suggested the possibility of using $\\ell_1$\noptimisation algorithms to instead in cases when a suitable\ndictionary of basis functions can be defined. Whilst this leads to a\nloss of efficiency in the optimisation process, it also promotes\nsparsity of the solution, and the convexity of the $\\ell_1$ norm\nmeans that convex optimisation toolboxes such as SPGL1 \\cite{EB15}\nor CVX \\cite{MG15} can be applied. Chardon \\emph{et al.} \\cite{GC12}\ncombine sparse optimisation techniques with a Fourier basis / plane\nwave approximation of the solution on flat star-like plates and\nreport accurate reconstructions with sparse basis expansions. In\ncombination with randomised measurement data, these methods gave\nfaithful reconstructions, even above the Nyquist frequency. More\nrecently, sparse $\\ell_1$ optimisation with a plane wave basis has\nbeen proposed as a means of source identification from spherical\nacoustic radiators \\cite{AX15a}.\n\nIn this paper we discuss the possibility of a sparse solution\nrepresentation using $\\ell_1$ optimisation techniques based on the\nsuperposition method for application to general three dimensional\nproblems. A study of this combination of methods for reconstructing\nvibration of flat plates has recently been presented in Ref.\n\\cite{AX15b}. The method of superposition appears to be the most\npromising approach since there are close links between plane wave\nmethod and the method of superposition for bounded domains as\ndescribed in Ref. \\cite{CA05}. In addition, the superposition method\nis typically accurate for frequencies above the six degrees of\nfreedom per wavelength rule of thumb for boundary element methods\n\\cite{AB08} and can handle internal resonance frequencies in a\nrelatively simple manner \\cite{WB97,AL10}. The application and\nsuitability of these methods will also be considered for the\nreconstruction of the Neumann boundary data on a cuboid of similar\ndimensions to a typical loudspeaker cabinet over a range of\nfrequencies.\n\nInitially we will study test problems where the exterior acoustic\nfield is generated by a monopole point source inside the structure.\nIn this case the solution could be represented exactly for\narbitrarily high frequencies using the method of superposition if\none of the points on the surface of interior charge points coincides\nwith the monopole generating the acoustic field. However, in general\nsuch information would not be known \\emph{a-priori} when sampling an\nacoustic field in NAH. We will therefore examine the dependence of\nthe reconstruction on the locations of the charge points and the\nmonopole generating the acoustic field. Finally, we will consider a\ncase where the acoustic field is not generated by an interior\nmonopole, but rather by a relatively small vibrating patch on an\notherwise rigid structure. This leads to a problem where the method\nof superposition should return a sparse expansion for interior\ncharge point surfaces very close to the physical boundary, since the\nweighting of sources close to the vibrating region will be dominant\ncompared to those close to the rigid part of the structure. The\nlatter (locally radiating) case also has parallels with the\nsituation that arises when modelling acoustic radiation from\nloudspeakers.\n\n\\section{Method of Superposition for Near-field Acoustic Holography}\n\nLet $\\Omega\\subset\\mathbb{R}^{3}$ be a finite domain with boundary\nsurface $\\Gamma$. Let\n$\\Omega_{+}=\\mathbb{R}^{3}\\setminus\\bar{\\Omega}$ denote the\nunbounded exterior domain, which is assumed to be filled with a\nhomogeneous compressible acoustic medium with density $\\rho$ and\nspeed of sound $c$. For a time-harmonic disturbance of frequency\n$\\omega$, the sound pressure $p$ satisfies the homogeneous Helmholtz\nequation in $\\Omega_{+}$\n\n", "index": 1, "text": "\\begin{equation} \\label{HE1}\n\\Delta p+k^{2}p=0,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Delta p+k^{2}p=0,\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>p</mi></mrow><mo>+</mo><mrow><msup><mi>k</mi><mn>2</mn></msup><mo>⁢</mo><mi>p</mi></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nwhere $G_{k}$ is the free space Green's function for Helmholtz\nequation in three dimensions given by\n\n", "itemtype": "equation", "pos": 11625, "prevtext": "\nwhere $k=\\omega/c$ is the wave-number. Since this work considers an\nunbounded exterior domain, then $p$ must also satisfy the Sommerfeld\nradiation condition. \n\n\n\nThe superposition method approximates $p$ at some point\n$\\mathbf{x}\\in\\bar{\\Omega}_+$ using a basis expansion of the form\n\n", "index": 3, "text": "\\begin{equation}\\label{MFS1}\np(\\mathbf{x})\\approx\\sum_{j=1}^{n} \\sigma_j\nG_{k}(\\mathbf{x},\\mathbf{y}_j),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"p(\\mathbf{x})\\approx\\sum_{j=1}^{n}\\sigma_{j}G_{k}(\\mathbf{x},\\mathbf{y}_{j}),\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>σ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>G</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo>,</mo><msub><mi>𝐲</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nHere $\\mathbf{y}_i\\in\\Omega$, $i=1,...,n$ are the source locations\nand $\\sigma_i$ are the source strengths, which are determined by\napplication of the method.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the NAH problem we are given values of the acoustic pressure $p$\nat a discrete set of points the acoustic near field within\n$\\Omega_{+}$. We will assume that the data points $\\mathbf{x}_i$,\n$i=1,...,m$ lie on a surface $\\Gamma^{*}\\subset\\Omega_{+}$. Note\nthat the pressure data is usually obtained from measurements using a\nmicrophone array. However, in this work we only generate the\npressure data numerically as described in Section \\ref{sec:num}. The\nNAH problem is to use the given pressure data to recover the Neumann\nboundary data on $\\Gamma$. Solving this problem via the method of\nsuperposition is then a matter of finding the set of source\nstrengths $\\sigma_j$, $j=1,...,n$, that reproduce the acoustic\npressure data to some desired accuracy in the least squares sense.\nThat is, $\\sigma_j$ are chosen so that the $\\ell_2$ norm of the\nresidual vector $\\mathbf{r}$, with entries given by\n\n", "itemtype": "equation", "pos": 11846, "prevtext": "\nwhere $G_{k}$ is the free space Green's function for Helmholtz\nequation in three dimensions given by\n\n", "index": 5, "text": "\\begin{equation}\\label{GF1}\nG_{k}(\\mathbf{x},\\mathbf{y})=\\frac{e^{ik|\\mathbf{x}-\\mathbf{y}|}}{4\\pi\n|\\mathbf{x}-\\mathbf{y}|}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"G_{k}(\\mathbf{x},\\mathbf{y})=\\frac{e^{ik|\\mathbf{x}-\\mathbf{y}|}}{4\\pi|\\mathbf%&#10;{x}-\\mathbf{y}|}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>G</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo>,</mo><mi>𝐲</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝐱</mi><mo>-</mo><mi>𝐲</mi></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></msup><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝐱</mi><mo>-</mo><mi>𝐲</mi></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nfor $i=1,..,m$, is smaller than a desired error tolerance. Once the\nsource strengths have been obtained then the Neumann boundary data\ncan be recovered from\n\n", "itemtype": "equation", "pos": 13077, "prevtext": "\nHere $\\mathbf{y}_i\\in\\Omega$, $i=1,...,n$ are the source locations\nand $\\sigma_i$ are the source strengths, which are determined by\napplication of the method.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the NAH problem we are given values of the acoustic pressure $p$\nat a discrete set of points the acoustic near field within\n$\\Omega_{+}$. We will assume that the data points $\\mathbf{x}_i$,\n$i=1,...,m$ lie on a surface $\\Gamma^{*}\\subset\\Omega_{+}$. Note\nthat the pressure data is usually obtained from measurements using a\nmicrophone array. However, in this work we only generate the\npressure data numerically as described in Section \\ref{sec:num}. The\nNAH problem is to use the given pressure data to recover the Neumann\nboundary data on $\\Gamma$. Solving this problem via the method of\nsuperposition is then a matter of finding the set of source\nstrengths $\\sigma_j$, $j=1,...,n$, that reproduce the acoustic\npressure data to some desired accuracy in the least squares sense.\nThat is, $\\sigma_j$ are chosen so that the $\\ell_2$ norm of the\nresidual vector $\\mathbf{r}$, with entries given by\n\n", "index": 7, "text": "\\begin{equation}\\label{MFSmin}\nr_i=p(\\mathbf{x}_i)-\\sum_{j=1}^{n} \\sigma_j\nG_{k}(\\mathbf{x}_i,\\mathbf{y}_j)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"r_{i}=p(\\mathbf{x}_{i})-\\sum_{j=1}^{n}\\sigma_{j}G_{k}(\\mathbf{x}_{i},\\mathbf{y%&#10;}_{j})\" display=\"block\"><mrow><msub><mi>r</mi><mi>i</mi></msub><mo>=</mo><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐱</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>σ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>G</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐱</mi><mi>i</mi></msub><mo>,</mo><msub><mi>𝐲</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nwhere $\\mathbf{n}$ is the outward unit normal to $\\Gamma$. Note that\nthe linearised Euler equation for time harmonic waves leads to the\nfollowing simple relationship between the Neumann boundary data\ncomputed here, and the normal velocity $v$ of the radiating object\n\n", "itemtype": "equation", "pos": 13357, "prevtext": "\nfor $i=1,..,m$, is smaller than a desired error tolerance. Once the\nsource strengths have been obtained then the Neumann boundary data\ncan be recovered from\n\n", "index": 9, "text": "\\begin{equation}\\label{MFS2}\n\\frac{\\partial\np}{\\partial\\mathbf{n}}(\\mathbf{x})\\approx\\sum_{j=1}^{n} \\sigma_j\n\\frac{\\partial G_{k}}{\\partial\\mathbf{n}}(\\mathbf{x},\\mathbf{y}_j),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial p}{\\partial\\mathbf{n}}(\\mathbf{x})\\approx\\sum_{j=1}^{n}\\sigma_{%&#10;j}\\frac{\\partial G_{k}}{\\partial\\mathbf{n}}(\\mathbf{x},\\mathbf{y}_{j}),\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>p</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐧</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>σ</mi><mi>j</mi></msub><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>G</mi><mi>k</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐧</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo>,</mo><msub><mi>𝐲</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nRegularisation is always required in general, even for $n=m$, since\nNAH is an ill-posed inverse problem (see for example \\cite{DC09}).\nFor experimental problems, the pressure measurements will contain\nerrors and the ill-posedness of the problem means that these errors\nare amplified in the (unregularised) solutions, often rendering them\nmeaningless. Most previous work on NAH has concentrated on using\nTikhonov regularisation, together with generalised cross validation\n(GCV). In the next section we describe a scheme designed to promote\nsparsity in the solution as suggested in Ref. \\cite{GC12} for\ntwo-dimensional planar problems.\n\n\\section{Regularisation and Sparse Reconstruction}\n\nOne of the oldest and most widely used regularisation methods is\nTikhonov regularisation, which applied to equation (\\ref{MFSmin})\nleads to the following minimisation problem\n\n", "itemtype": "equation", "pos": 13816, "prevtext": "\nwhere $\\mathbf{n}$ is the outward unit normal to $\\Gamma$. Note that\nthe linearised Euler equation for time harmonic waves leads to the\nfollowing simple relationship between the Neumann boundary data\ncomputed here, and the normal velocity $v$ of the radiating object\n\n", "index": 11, "text": "\\begin{equation}\\label{nv}\n\\frac{\\partial p}{\\partial\\mathbf{n}}=i\\omega\\rho v.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial p}{\\partial\\mathbf{n}}=i\\omega\\rho v.\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>p</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐧</mi></mrow></mfrac><mo>=</mo><mrow><mi>i</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mi>v</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nwhere $L$ is the Tikhonov matrix (most simply chosen as the identity\nmatrix) and $\\lambda>0$ is a regularisation parameter to be\ndetermined. We have also introduced the notation\n$\\boldsymbol{\\sigma}=[\\sigma_1\\:\\:\\sigma_2\\:\\ldots\\:\\sigma_n\\:]^T$\nfor the vector containing the source strengths, and likewise\n$\\hat{\\boldsymbol{\\sigma}}$ is the vector containing the regularised\nand reconstructed source strengths at the $n$ interior source\npoints.\n\nIn this work we adopt the alternative regularisation approach of\nChardon \\emph{et al.} \\cite{GC12}, which favors sparse\nrepresentations of the solution. In other words, it (approximately)\nminimises $|\\boldsymbol{\\sigma}|_0$, the number of non-zero entries\nof $\\boldsymbol{\\sigma}$. As noted by Chardon \\emph{et al.}\n\\cite{GC12}, the possibility of a sparse reconstruction is highly\ndependent on the basis functions used to represent the solution. In\nthe superposition method, these basis functions are the fundamental\nsolution of the Helmholtz equation at a set of distinct interior\ncharge points. The results in Koopman \\emph{et al.} \\cite{GK89}\nsuggest the feasibility of sparse solution representations for a\nlarge range of wavenumbers using the superposition method. The\nresults presented in the next section will investigate the\nconditions whereby high quality sparse representations are indeed\npossible. For the examples considered here we expect that the\nquality of the solutions attainable will be highly dependent on the\nlocation of the interior charge points used for the superposition.\nThe acoustic pressure data is created by either a single interior\nmonopole, or by applying the BEM to give the acoustic field radiated\nfrom a relatively small vibrating patch. We will investigate whether\nthe sparse reconstruction approach can pick out solutions\n$\\boldsymbol{\\sigma}$ that make use of the underlying sparsity in\nthese examples, where this sparsity arises either due to the low\nnumber of monopoles needed to generate the field in the former case,\nor due to the relatively small region over which the reconstructed\nfield is dominant in the latter case.\n\nDirectly minimising  $|\\boldsymbol{\\sigma}|_0$ is often intractable\ndue to non-convexity \\cite{GC12}. We therefore instead seek to\nminimise the $\\ell_1$ norm\n\n", "itemtype": "equation", "pos": 14773, "prevtext": "\nRegularisation is always required in general, even for $n=m$, since\nNAH is an ill-posed inverse problem (see for example \\cite{DC09}).\nFor experimental problems, the pressure measurements will contain\nerrors and the ill-posedness of the problem means that these errors\nare amplified in the (unregularised) solutions, often rendering them\nmeaningless. Most previous work on NAH has concentrated on using\nTikhonov regularisation, together with generalised cross validation\n(GCV). In the next section we describe a scheme designed to promote\nsparsity in the solution as suggested in Ref. \\cite{GC12} for\ntwo-dimensional planar problems.\n\n\\section{Regularisation and Sparse Reconstruction}\n\nOne of the oldest and most widely used regularisation methods is\nTikhonov regularisation, which applied to equation (\\ref{MFSmin})\nleads to the following minimisation problem\n\n", "index": 13, "text": "\\begin{equation}\\label{HE4reg}\n\\hat{\\boldsymbol{\\sigma}}=\\mathrm{arg}\\min_{\\boldsymbol{\\sigma}}\\left\\{\\|\\mathbf{r}\\|_2^2+\\lambda\\|L\\boldsymbol{\\sigma}\\|_2^2\\right\\},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\bm{\\sigma}}=\\mathrm{arg}\\min_{\\bm{\\sigma}}\\left\\{\\|\\mathbf{r}\\|_{2}^{2}+%&#10;\\lambda\\|L\\bm{\\sigma}\\|_{2}^{2}\\right\\},\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>𝝈</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mi>arg</mi><mo>⁢</mo><mrow><munder><mi>min</mi><mi>𝝈</mi></munder><mo>⁡</mo><mrow><mo>{</mo><mrow><msubsup><mrow><mo>∥</mo><mi>𝐫</mi><mo>∥</mo></mrow><mn>2</mn><mn>2</mn></msubsup><mo>+</mo><mrow><mi>λ</mi><mo>⁢</mo><msubsup><mrow><mo>∥</mo><mrow><mi>L</mi><mo>⁢</mo><mi>𝝈</mi></mrow><mo>∥</mo></mrow><mn>2</mn><mn>2</mn></msubsup></mrow></mrow><mo>}</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nThe use of the $\\ell_1$ norm allows one to apply powerful convex\noptimisation algorithms and still promotes sparsity by making many\nof the components of $\\boldsymbol{\\sigma}$ negligibly small, meaning\nthat they can be well approximated by zero without degrading the\nreconstructed solution.  The following procedure will be applied to\nfind a sparse representation $\\hat{\\boldsymbol{\\sigma}}$ of the\nsource strengths $\\boldsymbol{\\sigma}$\n\n", "itemtype": "equation", "pos": 17223, "prevtext": "\nwhere $L$ is the Tikhonov matrix (most simply chosen as the identity\nmatrix) and $\\lambda>0$ is a regularisation parameter to be\ndetermined. We have also introduced the notation\n$\\boldsymbol{\\sigma}=[\\sigma_1\\:\\:\\sigma_2\\:\\ldots\\:\\sigma_n\\:]^T$\nfor the vector containing the source strengths, and likewise\n$\\hat{\\boldsymbol{\\sigma}}$ is the vector containing the regularised\nand reconstructed source strengths at the $n$ interior source\npoints.\n\nIn this work we adopt the alternative regularisation approach of\nChardon \\emph{et al.} \\cite{GC12}, which favors sparse\nrepresentations of the solution. In other words, it (approximately)\nminimises $|\\boldsymbol{\\sigma}|_0$, the number of non-zero entries\nof $\\boldsymbol{\\sigma}$. As noted by Chardon \\emph{et al.}\n\\cite{GC12}, the possibility of a sparse reconstruction is highly\ndependent on the basis functions used to represent the solution. In\nthe superposition method, these basis functions are the fundamental\nsolution of the Helmholtz equation at a set of distinct interior\ncharge points. The results in Koopman \\emph{et al.} \\cite{GK89}\nsuggest the feasibility of sparse solution representations for a\nlarge range of wavenumbers using the superposition method. The\nresults presented in the next section will investigate the\nconditions whereby high quality sparse representations are indeed\npossible. For the examples considered here we expect that the\nquality of the solutions attainable will be highly dependent on the\nlocation of the interior charge points used for the superposition.\nThe acoustic pressure data is created by either a single interior\nmonopole, or by applying the BEM to give the acoustic field radiated\nfrom a relatively small vibrating patch. We will investigate whether\nthe sparse reconstruction approach can pick out solutions\n$\\boldsymbol{\\sigma}$ that make use of the underlying sparsity in\nthese examples, where this sparsity arises either due to the low\nnumber of monopoles needed to generate the field in the former case,\nor due to the relatively small region over which the reconstructed\nfield is dominant in the latter case.\n\nDirectly minimising  $|\\boldsymbol{\\sigma}|_0$ is often intractable\ndue to non-convexity \\cite{GC12}. We therefore instead seek to\nminimise the $\\ell_1$ norm\n\n", "index": 15, "text": "\\begin{equation}\n\\|\\boldsymbol{\\sigma}\\|_1=\\sum_{j}|\\sigma_j|.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\|\\bm{\\sigma}\\|_{1}=\\sum_{j}|\\sigma_{j}|.\" display=\"block\"><mrow><mrow><msub><mrow><mo>∥</mo><mi>𝝈</mi><mo>∥</mo></mrow><mn>1</mn></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi></munder><mrow><mo stretchy=\"false\">|</mo><msub><mi>σ</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nThis procedure will be implemented using the convex optimisation\ntoolbox CVX \\cite{MG15}. This procedure requires a data fidelity\nconstraint $\\epsilon$ to be specified. Choosing this parameter\ninvolves a trade off between allowing sparser solutions with larger\nvalues of $\\epsilon$ and achieving more accurately reconstructed\nsolutions with smaller values of $\\epsilon$. Chardon \\emph{et al.}\n\\cite{GC12} recommend a choice of $\\epsilon$ of the order $20\\%$ to\n$30\\%$ of the $\\ell_2$ norm of the measured pressure data. However,\na good choice of $\\epsilon$ is likely to depend on how noisy the\npressure data is and hence will be problem dependent.\n\nFor completeness, and to emphasise the links between the $\\ell_1$\nregularisation approach and Tikhonov regularisation we note that\n(\\ref{L1reg1}) may be expressed in the form \\cite{GC12,SC99}\n\n", "itemtype": "equation", "pos": 17738, "prevtext": "\nThe use of the $\\ell_1$ norm allows one to apply powerful convex\noptimisation algorithms and still promotes sparsity by making many\nof the components of $\\boldsymbol{\\sigma}$ negligibly small, meaning\nthat they can be well approximated by zero without degrading the\nreconstructed solution.  The following procedure will be applied to\nfind a sparse representation $\\hat{\\boldsymbol{\\sigma}}$ of the\nsource strengths $\\boldsymbol{\\sigma}$\n\n", "index": 17, "text": "\\begin{equation}\\label{L1reg1}\n\\hat{\\boldsymbol{\\sigma}}=\\mathrm{arg}\\min_{\\boldsymbol{\\sigma}}\\|\\boldsymbol{\\sigma}\\|_1\\:\\:\\:\\mathrm{subject}\\:\\:\\mathrm{to}\\:\\:\\:\\|\\mathbf{r}\\|_{2}^2\\leq\\epsilon.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\bm{\\sigma}}=\\mathrm{arg}\\min_{\\bm{\\sigma}}\\|\\bm{\\sigma}\\|_{1}\\&gt;\\&gt;\\&gt;%&#10;\\mathrm{subject}\\&gt;\\&gt;\\mathrm{to}\\&gt;\\&gt;\\&gt;\\|\\mathbf{r}\\|_{2}^{2}\\leq\\epsilon.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>𝝈</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mi>arg</mi><mo>⁢</mo><munder><mi>min</mi><mi>𝝈</mi></munder><mo>⁢</mo><mpadded width=\"+6.6pt\"><msub><mrow><mo>∥</mo><mi>𝝈</mi><mo>∥</mo></mrow><mn>1</mn></msub></mpadded><mo>⁢</mo><mpadded width=\"+4.4pt\"><mi>subject</mi></mpadded><mo>⁢</mo><mpadded width=\"+6.6pt\"><mi>to</mi></mpadded><mo>⁢</mo><msubsup><mrow><mo>∥</mo><mi>𝐫</mi><mo>∥</mo></mrow><mn>2</mn><mn>2</mn></msubsup></mrow><mo>≤</mo><mi>ϵ</mi></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nThis procedure is known as the Basis Pursuit Denoising (BPDN) and is\nintroduced in Sect. 5.1 of Ref. \\cite{SC99}, where the interested\nreader can find further details, including a discussion of suitable\nchoices of $\\lambda$ in the presence of standard Gaussian noise.\nHere we simply note the parallels between the expression\n(\\ref{L1reg2}) and equation (\\ref{HE4reg}), and in particular that\none of the main differences is the norm employed in the final term.\nIn particular, the $\\ell_1$ norm replaces the square of the $\\ell_2$\nnorm in the Tikhonov case, and it is this difference that promotes\nsparsity in the $\\ell_1$ approach. The differences between these two\napproaches will be investigated numerically in the next section.\n\n\\section{Numerical Results}\\label{sec:num}\n\nNumerical results will be computed for acoustic radiation from a\ncuboid of similar dimensions to a typical loudspeaker cabinet\n($0.28\\mathrm{m}\\times0.28\\mathrm{m}\\times0.42\\mathrm{m}$). Although\nthe method of superposition is a mesh free method, we will use a\ntriangulation of the cuboid to generate the points at which the\npressure data is computed, as well as the internal charge points and\nthe points at which we reconstruct the solution on $\\Gamma$. In\nparticular, for a given triangulation of $\\Gamma$ we reconstruct the\nNeumann boundary data at the centroid of each triangle and project\n(from each centroid) a distance $\\delta$ along the normal vector to\n$\\Gamma$ into $\\Omega_+$ to obtain the points where the exterior\npressure data is recorded. The internal charge points are positioned\non a cuboid inside $\\Omega$, which is just a scaled down version of\n$\\Gamma$ with scaling factor $\\alpha\\in(0,1)$. For example, a value\nof $\\alpha=0.5$ corresponds to a cuboid surface of internal charge\npoints whose dimensions are exactly half those of $\\Gamma$. Assuming\nthat $\\Omega$ is centred at the origin, we simply take a point\n$\\mathbf{x}\\in\\Gamma$ and multiply by $\\alpha$ to obtain the\ncorresponding point $\\mathbf{y}$ on the internal surface of charge\npoints thus\n\n", "itemtype": "equation", "pos": 18791, "prevtext": "\nThis procedure will be implemented using the convex optimisation\ntoolbox CVX \\cite{MG15}. This procedure requires a data fidelity\nconstraint $\\epsilon$ to be specified. Choosing this parameter\ninvolves a trade off between allowing sparser solutions with larger\nvalues of $\\epsilon$ and achieving more accurately reconstructed\nsolutions with smaller values of $\\epsilon$. Chardon \\emph{et al.}\n\\cite{GC12} recommend a choice of $\\epsilon$ of the order $20\\%$ to\n$30\\%$ of the $\\ell_2$ norm of the measured pressure data. However,\na good choice of $\\epsilon$ is likely to depend on how noisy the\npressure data is and hence will be problem dependent.\n\nFor completeness, and to emphasise the links between the $\\ell_1$\nregularisation approach and Tikhonov regularisation we note that\n(\\ref{L1reg1}) may be expressed in the form \\cite{GC12,SC99}\n\n", "index": 19, "text": "\\begin{equation}\\label{L1reg2}\n\\hat{\\boldsymbol{\\sigma}}=\\mathrm{arg}\\min_{\\boldsymbol{\\sigma}}\\left\\{\\|\\mathbf{r}\\|_2^2+\\lambda\\|\\boldsymbol{\\sigma}\\|_1\\right\\}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\bm{\\sigma}}=\\mathrm{arg}\\min_{\\bm{\\sigma}}\\left\\{\\|\\mathbf{r}\\|_{2}^{2}+%&#10;\\lambda\\|\\bm{\\sigma}\\|_{1}\\right\\}.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>𝝈</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mi>arg</mi><mo>⁢</mo><mrow><munder><mi>min</mi><mi>𝝈</mi></munder><mo>⁡</mo><mrow><mo>{</mo><mrow><msubsup><mrow><mo>∥</mo><mi>𝐫</mi><mo>∥</mo></mrow><mn>2</mn><mn>2</mn></msubsup><mo>+</mo><mrow><mi>λ</mi><mo>⁢</mo><msub><mrow><mo>∥</mo><mi>𝝈</mi><mo>∥</mo></mrow><mn>1</mn></msub></mrow></mrow><mo>}</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\n\nInitially we reconstruct the boundary data generated by a point\nsource at $\\mathbf{x}_{0}=(0,\\:0,\\:z_{0})\\in\\Omega$, where $\\Omega$\nis centred at the origin. The pressure data is therefore of the form\n\n", "itemtype": "equation", "pos": 21015, "prevtext": "\nThis procedure is known as the Basis Pursuit Denoising (BPDN) and is\nintroduced in Sect. 5.1 of Ref. \\cite{SC99}, where the interested\nreader can find further details, including a discussion of suitable\nchoices of $\\lambda$ in the presence of standard Gaussian noise.\nHere we simply note the parallels between the expression\n(\\ref{L1reg2}) and equation (\\ref{HE4reg}), and in particular that\none of the main differences is the norm employed in the final term.\nIn particular, the $\\ell_1$ norm replaces the square of the $\\ell_2$\nnorm in the Tikhonov case, and it is this difference that promotes\nsparsity in the $\\ell_1$ approach. The differences between these two\napproaches will be investigated numerically in the next section.\n\n\\section{Numerical Results}\\label{sec:num}\n\nNumerical results will be computed for acoustic radiation from a\ncuboid of similar dimensions to a typical loudspeaker cabinet\n($0.28\\mathrm{m}\\times0.28\\mathrm{m}\\times0.42\\mathrm{m}$). Although\nthe method of superposition is a mesh free method, we will use a\ntriangulation of the cuboid to generate the points at which the\npressure data is computed, as well as the internal charge points and\nthe points at which we reconstruct the solution on $\\Gamma$. In\nparticular, for a given triangulation of $\\Gamma$ we reconstruct the\nNeumann boundary data at the centroid of each triangle and project\n(from each centroid) a distance $\\delta$ along the normal vector to\n$\\Gamma$ into $\\Omega_+$ to obtain the points where the exterior\npressure data is recorded. The internal charge points are positioned\non a cuboid inside $\\Omega$, which is just a scaled down version of\n$\\Gamma$ with scaling factor $\\alpha\\in(0,1)$. For example, a value\nof $\\alpha=0.5$ corresponds to a cuboid surface of internal charge\npoints whose dimensions are exactly half those of $\\Gamma$. Assuming\nthat $\\Omega$ is centred at the origin, we simply take a point\n$\\mathbf{x}\\in\\Gamma$ and multiply by $\\alpha$ to obtain the\ncorresponding point $\\mathbf{y}$ on the internal surface of charge\npoints thus\n\n", "index": 21, "text": "\\begin{equation}\\label{alpha}\n\\mathbf{y}=\\alpha\\mathbf{x}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{y}=\\alpha\\mathbf{x}.\" display=\"block\"><mrow><mrow><mi>𝐲</mi><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><mi>𝐱</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nwhere $a\\in\\mathbb{C}$ is the strength of the source, which in these\nexamples is arbitrarily taken to be $a=3-i$. The boundary data\ngenerated at $\\mathbf{y}\\in\\Gamma$ may also be obtained for the case\nof a point source at $\\mathbf{x}_{0}=(0,\\:0,\\:z_{0})$ by replacing\n$\\mathbf{x}_{j}$ in (\\ref{ps1}) by $\\mathbf{y}\\in\\Gamma$,\ndifferentiating in the direction of $\\mathbf{n}_{y}$ and evaluating\nat the centroids of the triangulation $\\mathbf{y}=\\mathbf{y}_{j}$\nfor $j=1,...,m$ to give\n\n", "itemtype": "equation", "pos": 21291, "prevtext": "\n\nInitially we reconstruct the boundary data generated by a point\nsource at $\\mathbf{x}_{0}=(0,\\:0,\\:z_{0})\\in\\Omega$, where $\\Omega$\nis centred at the origin. The pressure data is therefore of the form\n\n", "index": 23, "text": "\\begin{equation}\\label{ps1}\n(\\mathbf{p}_{0})_{j}=a\\frac{e^{ik|\\mathbf{x}_{0}-\\mathbf{x}_{j}|}}{|\\mathbf{x}_{0}-\\mathbf{x}_{j}|},\\hspace{1cm}j=1,...,m,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{p}_{0})_{j}=a\\frac{e^{ik|\\mathbf{x}_{0}-\\mathbf{x}_{j}|}}{|\\mathbf{x}%&#10;_{0}-\\mathbf{x}_{j}|},\\hskip 28.452756ptj=1,...,m,\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐩</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mi>j</mi></msub><mo>=</mo><mrow><mi>a</mi><mo>⁢</mo><mfrac><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐱</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐱</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mfrac></mrow></mrow><mo rspace=\"31pt\">,</mo><mrow><mi>j</mi><mo>=</mo><mrow><mn>1</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mi>m</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nUsing this calculation it is possible to verify the accuracy of the\n(Tikhonov or $\\ell_1$) regularised approximate solutions with\ndifferent wavenumbers and singularity point positions $z_{0}$. We\nwill also investigate the behavior of the method at irregular\nfrequencies of the volume enclosed by the interior charge points,\nand the dependence on the dimensions / location of the interior\ncharge point surface controlled by the parameter $\\alpha$.\n\nUniformly distributed and additive white noise will be applied to\n$\\mathbf{p}_{0}$ in order to more closely replicate experimental\nobservations. The use of Gaussian noise was also considered and, in\ngeneral, led to slightly more accurate reconstructions than\nuniformly distributed noise. However, the quality of the\nreconstructions also fluctuated more widely when using different\nGaussian noise vectors (of the same norm) than for uniformly\ndistributed noise, and so we present the results for uniformly\ndistributed noise since we believe they give a more indicative and\nrepeatable measure of the performance of our reconstruction methods.\nWe denote the added noise vector as $\\mathbf{w}$ and specify the\nratio\n\n", "itemtype": "equation", "pos": 21941, "prevtext": "\nwhere $a\\in\\mathbb{C}$ is the strength of the source, which in these\nexamples is arbitrarily taken to be $a=3-i$. The boundary data\ngenerated at $\\mathbf{y}\\in\\Gamma$ may also be obtained for the case\nof a point source at $\\mathbf{x}_{0}=(0,\\:0,\\:z_{0})$ by replacing\n$\\mathbf{x}_{j}$ in (\\ref{ps1}) by $\\mathbf{y}\\in\\Gamma$,\ndifferentiating in the direction of $\\mathbf{n}_{y}$ and evaluating\nat the centroids of the triangulation $\\mathbf{y}=\\mathbf{y}_{j}$\nfor $j=1,...,m$ to give\n\n", "index": 25, "text": "\\begin{equation}\\label{ps2}\n(\\mathbf{v})_{j}=a\\left(\\frac{\\mathbf{n}_{y_{j}}\\cdot(\\mathbf{x}_{0}-\\mathbf{y}_{j})}{|\\mathbf{x}_{0}-\\mathbf{y}_{j}|^{3}}(1-ik|\\mathbf{x}_{0}-\\mathbf{y}_{j}|)e^{ik|\\mathbf{x}_{0}-\\mathbf{y}_{j}|}\\right),\\hspace{1cm}j=1,...,m.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"(\\mathbf{v})_{j}=a\\left(\\frac{\\mathbf{n}_{y_{j}}\\cdot(\\mathbf{x}_{0}-\\mathbf{y%&#10;}_{j})}{|\\mathbf{x}_{0}-\\mathbf{y}_{j}|^{3}}(1-ik|\\mathbf{x}_{0}-\\mathbf{y}_{j%&#10;}|)e^{ik|\\mathbf{x}_{0}-\\mathbf{y}_{j}|}\\right),\\hskip 28.452756ptj=1,...,m.\" display=\"block\"><mrow><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">)</mo></mrow><mi>j</mi></msub><mo>=</mo><mrow><mi>a</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mrow><msub><mi>𝐧</mi><msub><mi>y</mi><mi>j</mi></msub></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐲</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐲</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow><mn>3</mn></msup></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐲</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>𝐱</mi><mn>0</mn></msub><mo>-</mo><msub><mi>𝐲</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></msup></mrow><mo>)</mo></mrow></mrow></mrow><mo rspace=\"31pt\">,</mo><mrow><mi>j</mi><mo>=</mo><mrow><mn>1</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mi>m</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nreferring to $w$ as the level of added noise in the sequel. Note\nthat $w$ is related to the standard signal to noise ratio (SNR) via\n$\\mathrm{SNR}=w^{-2}$, or in decibels,\n$\\mathrm{SNR}_{\\mathrm{dB}}=10\\log_{10}\\left(w^{-2}\\right)$.\n\nFinally, we consider the case of reconstructing a locally vibrating\nstructure, where only a small region of the structure is vibrating.\nSuch an assumption is typical for the case of a loudspeaker and also\nallows us to study a case where the locations of any singularities\nof the continuation of the acoustic field into $\\Omega$ are unknown,\nas is usually the case in practice. Here the acoustic pressure data\nwill be generated using the boundary element method applied to the\nforward Neumann problem described earlier. Through this example we\ndemonstrate the broader applicability of the sparse reconstruction\nalgorithm, where the structure of the measured signal should have a\nsparse structure, but not necessarily the basis for the\nsuperposition method.\n\n\\subsection{Comparison with Tikhonov regularisation}\n\nFirst consider the case $k=1$ and $z_{0}=0.05$, where the frequency\nis relatively low, is not close to an irregular frequency and\n$\\mathbf{x}_{0}$ is relatively close to the origin and will lie\ninside the surface on which the interior charge points are located.\nUnder such conditions the superposition method is expected to work\nwell. Table \\ref{T1} shows the $\\ell_2$ percentage errors in the\nreconstructed Neumann boundary data for three different\nregularisation strategies and differing noise levels. The three\nsolution strategies to be compared are (i) $\\ell_1$ regularisation\nand taking the sum over all interior charge points, (ii) sparse\n$\\ell_1$ regularisation where only contributions from dominant\ncharge points are considered, and (iii) standard Tikhonov\nregularisation using Generalised Cross Validation (GCV) to determine\nthe regularisation parameter. In the latter case the computations\nhave been performed using Hansen's extensive regularisation toolbox\nfor Matlab \\cite{PH07}. In the case of the sparse reconstruction,\nthe criteria used to determine whether the $j$th charge point is\ndominant is if\n\n", "itemtype": "equation", "pos": 23371, "prevtext": "\nUsing this calculation it is possible to verify the accuracy of the\n(Tikhonov or $\\ell_1$) regularised approximate solutions with\ndifferent wavenumbers and singularity point positions $z_{0}$. We\nwill also investigate the behavior of the method at irregular\nfrequencies of the volume enclosed by the interior charge points,\nand the dependence on the dimensions / location of the interior\ncharge point surface controlled by the parameter $\\alpha$.\n\nUniformly distributed and additive white noise will be applied to\n$\\mathbf{p}_{0}$ in order to more closely replicate experimental\nobservations. The use of Gaussian noise was also considered and, in\ngeneral, led to slightly more accurate reconstructions than\nuniformly distributed noise. However, the quality of the\nreconstructions also fluctuated more widely when using different\nGaussian noise vectors (of the same norm) than for uniformly\ndistributed noise, and so we present the results for uniformly\ndistributed noise since we believe they give a more indicative and\nrepeatable measure of the performance of our reconstruction methods.\nWe denote the added noise vector as $\\mathbf{w}$ and specify the\nratio\n\n", "index": 27, "text": "\\begin{equation}\\label{SNR}\nw=\\frac{\\|\\mathbf{w}\\|_2}{\\|\\mathbf{p}_{0}\\|_2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"w=\\frac{\\|\\mathbf{w}\\|_{2}}{\\|\\mathbf{p}_{0}\\|_{2}},\" display=\"block\"><mrow><mrow><mi>w</mi><mo>=</mo><mfrac><msub><mrow><mo>∥</mo><mi>𝐰</mi><mo>∥</mo></mrow><mn>2</mn></msub><msub><mrow><mo>∥</mo><msub><mi>𝐩</mi><mn>0</mn></msub><mo>∥</mo></mrow><mn>2</mn></msub></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nWe will use the notation $N^*(\\beta)$ for the number of dominant\ncharge points satisfying this condition, taking $\\beta=0.5$ by\ndefault and so we denote $N^*=N^*(0.5)$. The $\\ell_2$ percentage\nerror in the reconstructed solution $\\hat{\\mathbf{v}}$ is calculated\nusing\n\n", "itemtype": "equation", "pos": 25623, "prevtext": "\nreferring to $w$ as the level of added noise in the sequel. Note\nthat $w$ is related to the standard signal to noise ratio (SNR) via\n$\\mathrm{SNR}=w^{-2}$, or in decibels,\n$\\mathrm{SNR}_{\\mathrm{dB}}=10\\log_{10}\\left(w^{-2}\\right)$.\n\nFinally, we consider the case of reconstructing a locally vibrating\nstructure, where only a small region of the structure is vibrating.\nSuch an assumption is typical for the case of a loudspeaker and also\nallows us to study a case where the locations of any singularities\nof the continuation of the acoustic field into $\\Omega$ are unknown,\nas is usually the case in practice. Here the acoustic pressure data\nwill be generated using the boundary element method applied to the\nforward Neumann problem described earlier. Through this example we\ndemonstrate the broader applicability of the sparse reconstruction\nalgorithm, where the structure of the measured signal should have a\nsparse structure, but not necessarily the basis for the\nsuperposition method.\n\n\\subsection{Comparison with Tikhonov regularisation}\n\nFirst consider the case $k=1$ and $z_{0}=0.05$, where the frequency\nis relatively low, is not close to an irregular frequency and\n$\\mathbf{x}_{0}$ is relatively close to the origin and will lie\ninside the surface on which the interior charge points are located.\nUnder such conditions the superposition method is expected to work\nwell. Table \\ref{T1} shows the $\\ell_2$ percentage errors in the\nreconstructed Neumann boundary data for three different\nregularisation strategies and differing noise levels. The three\nsolution strategies to be compared are (i) $\\ell_1$ regularisation\nand taking the sum over all interior charge points, (ii) sparse\n$\\ell_1$ regularisation where only contributions from dominant\ncharge points are considered, and (iii) standard Tikhonov\nregularisation using Generalised Cross Validation (GCV) to determine\nthe regularisation parameter. In the latter case the computations\nhave been performed using Hansen's extensive regularisation toolbox\nfor Matlab \\cite{PH07}. In the case of the sparse reconstruction,\nthe criteria used to determine whether the $j$th charge point is\ndominant is if\n\n", "index": 29, "text": "$$\\log\\left(\\frac{|\\sigma_j|}{\\min_i|\\sigma_i|}\\right)>\\beta\\log\\left(\\frac{\\max_i|\\sigma_i|}{\\min_i|\\sigma_i|}\\right).$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\log\\left(\\frac{|\\sigma_{j}|}{\\min_{i}|\\sigma_{i}|}\\right)&gt;\\beta\\log\\left(%&#10;\\frac{\\max_{i}|\\sigma_{i}|}{\\min_{i}|\\sigma_{i}|}\\right).\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mo stretchy=\"false\">|</mo><msub><mi>σ</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo></mrow><mrow><msub><mi>min</mi><mi>i</mi></msub><mo>⁡</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>σ</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow></mrow></mfrac><mo>)</mo></mrow></mrow><mo>&gt;</mo><mrow><mi>β</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><msub><mi>max</mi><mi>i</mi></msub><mo>⁡</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>σ</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow></mrow><mrow><msub><mi>min</mi><mi>i</mi></msub><mo>⁡</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>σ</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo></mrow></mrow></mfrac><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\n\nThe pressure data are specified at a distance $\\delta=0.035$m from\n$\\Gamma$ and the internal source surface is scaled down to have\ndimensions $\\alpha=1/3$ the size of $\\Gamma$. We note that these\nchoices should lead to good results based on the fact that $\\delta$\nshould be chosen small enough to capture evanescent contributions to\nthe pressure field, but still large enough to be a practical\ndistance for taking experimental measurements. For a further\ndiscussion on the role of evanescent wave contributions in\nsuperposition methods for NAH problems, the interested reader is\nreferred to Sect. 5 of Ref. \\cite{NV06}. For the choice of the\nparameter $\\alpha$ (\\ref{alpha}), Koopman \\emph{et al.} \\cite{GK89}\nsuggest that too small a value will lead to severe ill conditioning\nas the charge points become very close together, but choosing too\nlarge a value of $\\alpha$ will also give poor results. A choice in\nthe range $\\alpha\\in(0.1,0.6)$ is advised in Ref. \\cite{GK89}. It is\nalso beneficial for the charge point surface to enclose any\nsingularities of the associated interior problem \\cite{AB08}. For\nthese experiments the number of charge points, the number of\nmeasurement points and the number of points at which we reconstruct\nthe solution are all equal to 576. This is achieved by triangulating\nthe internal source surface in an identical way to $\\Gamma$ and\ntaking the charge points at the triangle centroids.\n\nThe results in Table \\ref{T1} show that in the noise free case, the\nreconstruction errors for both the full $\\ell_1$ method and Tikhonov\nregularisation are very small with Tikhonov reconstruction\nperforming better. A sparse representation of the solution is not\nfeasible here in general unless one of the charge points coincides\nwith the monopole generating the acoustic field; the $\\ell_1$\noptimisation identifies a relatively large number $N^*=98$ of\ndominant sources and the error of the `sparse' reconstruction\nincreases significantly compared with the reconstruction using all\n$576$ source points. However, once noise is present in the pressure\ndata then sparse representations of the solution can be obtained\nwith a similar level of accuracy to the Tikhonov approach. The\nreason for this can be explained by considering how the data\nfidelity parameter $\\epsilon$ is chosen in (\\ref{L1reg1}). In\nparticular we take\n\n", "itemtype": "equation", "pos": 26013, "prevtext": "\nWe will use the notation $N^*(\\beta)$ for the number of dominant\ncharge points satisfying this condition, taking $\\beta=0.5$ by\ndefault and so we denote $N^*=N^*(0.5)$. The $\\ell_2$ percentage\nerror in the reconstructed solution $\\hat{\\mathbf{v}}$ is calculated\nusing\n\n", "index": 31, "text": "\\begin{equation}\\label{l2err}\n\\frac{\\|\\hat{\\mathbf{v}}-\\mathbf{v}\\|_2}{\\|\\mathbf{v}\\|_{2}}\\times100\\%.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\|\\hat{\\mathbf{v}}-\\mathbf{v}\\|_{2}}{\\|\\mathbf{v}\\|_{2}}\\times 100\\%.\" display=\"block\"><mrow><mrow><mfrac><msub><mrow><mo>∥</mo><mrow><mover accent=\"true\"><mi>𝐯</mi><mo stretchy=\"false\">^</mo></mover><mo>-</mo><mi>𝐯</mi></mrow><mo>∥</mo></mrow><mn>2</mn></msub><msub><mrow><mo>∥</mo><mi>𝐯</mi><mo>∥</mo></mrow><mn>2</mn></msub></mfrac><mo>×</mo><mrow><mn>100</mn><mo lspace=\"0pt\" rspace=\"3.5pt\">%</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\nwhere $w$ is the level of noise added to the pressure data as\nbefore. Recall that larger choices of $\\epsilon$ permit sparser\nsolution representations. However, it only makes sense to choose a\nlarger $\\epsilon$ for noisy data, otherwise it leads to less\naccurate reconstructions. The parameter $\\epsilon_{\\text{min}}\\geq0$\nis included as a tolerance level that is used for the low or zero\nnoise case. A relatively large choice of $\\epsilon_{\\text{min}}$\nwill lead to sparser reconstructions at the expense of accuracy, and\nthe converse is true for small $\\epsilon_{\\text{min}}$. The results\nin this work have been obtained with\n$\\epsilon_{\\text{min}}=\\textsc{1e-6}$.\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=k1R3sparsityjn981510, width=\\textwidth}\n        \\caption{\\label{azzplot} Left and centre columns: A comparison of the charge point strengths using both the Tikhonov and $\\ell_1$ approaches for wavenumber $k=1$ and exterior pressure data generated by a point source at $(0,0,0.05)$. Right column: the locations of the dominant charge points for the $\\ell_1$ approach. The top row shows the case of clean pressure data and the other rows show the results for differing levels of added noise $w$.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=ReconstructedCompN15, width=\\textwidth}\n        \\caption{\\label{fourplot} Neumann boundary data on a cuboid generated by a point source at $(0,0,0.05)$ with wavenumber $k=1$ and $15\\%$ added noise. The plots compare the exact solution against those reconstructed using Tikhonov regularisation, the $\\ell_1$ approach with all charge points and the sparse $\\ell_1$ approach using only dominant charge points.}\n\\end{center}\n\\end{figure}\nFigure \\ref{azzplot} highlights the differing nature of the\nsolutions reconstructed using the Tikhonov and $\\ell_1$ approaches.\nThe plots show that $\\ell_1$ regularisation is more effective at\npromoting sparsity in the case of noisy data, and hence larger\nvalues of the data fidelity constraint $\\epsilon$. In particular,\nwhen noise is added the solutions can be accurately reconstructed\nusing only 10 to 15 of the 576 source points. This is further\nillustrated in Figure \\ref{fourplot} which shows the reconstructed\nsolution with noise level $w=0.15$ (or equivalently\n$\\mathrm{SNR}_{\\mathrm{dB}}=16.48\\mathrm{dB}$) using each of the\nthree solution strategies described above. The exact solution is\nalso shown for reference.\n\nIn all three cases we achieve a faithful reconstruction of the\nNeumann data on the cuboid since the match to the exact solution is\nvery good. Plots of the cases $w=0$ and $w=0.05$ are omitted for\nbrevity, since as shown in Table \\ref{T1}, the reconstruction errors\nin these cases are even smaller and the likeness to the exact\nsolution shown in Figure \\ref{fourplot} would be even stronger.\n\\emph{The main result of this section is that $\\ell_1$ sparse\nregularisation can give similar accuracy to Tikhonov regularisation\nfor noisy data, but with a small fraction of the number of charge\npoints required to produce the reconstruction.}\n\n\n\\subsection{Higher and irregular frequencies}\n\nWe now investigate the behavior of the method for some potentially\nproblematic choices of the wavenumber $k$. First we look at the case\nwhen the frequency is increased, including when the Nyquist\nfrequency is exceeded. Since our measurements are taken at triangle\ncentroids then the resulting measurement grid is irregular and so\nthe Nyquist frequency is not well-defined. We therefore choose the\nNyquist frequency associated with the regular grid given by the\ntriangle vertices, as a value approximately representative of the\nNyquist frequency. For the discretisation considered in the previous\nsection with $576$ triangles, the grid spacing is $\\Delta x =\n0.04667$, meaning that the wavenumber corresponding to the Nyquist\nfrequency is $k_{\\mathrm{nyq}}=\\pi/\\Delta x= 67.32$. We also\ninvestigate the performance of the method close to other typical\nthreshold frequencies for numerical solution approaches, such as the\nsix grid points per wavelength rule of thumb for finite and boundary\nelement methods, which gives a maximum wavenumber of $k=22.44$ for\nthe grid described above. The performance of the method at irregular\nfrequencies will also be investigated. For the method of\nsuperposition these irregular frequencies are the resonances of the\nregion enclosed by the interior source surface \\cite{GK89}.\nNumerical studies indicate that one such frequency is close to\n$k^*=17.54/\\alpha$, which here is $k=52.62$.\n\nTable \\ref{T2} gives the reconstruction error for a range of\nwavenumbers $k$ using $\\ell_1$ reconstruction techniques and\ncompares the accuracy of the reconstruction using all 576 charge\npoints, and using two different values of the sparsity parameter\n$\\beta$. In particular, we compare the default choice used in the\nlast section of $\\beta=0.5$ with the choice $\\beta=0.9$, which uses\nfewer charge points but at the potential cost of poorer accuracy.\nThe maximum wavenumber studied corresponds to the wavelength being\nclose to (but still greater than) the exterior measurement distance\n$\\delta$. The results show that both irregular and high frequencies\nlead to a degradation in the accuracy of the reconstruction, and\nlead to a loss of sparsity in the reconstructions. Accurate and\nreasonably sparse reconstructions can be generated provided there\nare at least 3 data points per wavelength since for up to $k=44.88$\nwe can reconstruct the solution with a smaller error than the level\nof added noise ($15\\%$) and with at least an order of magnitude\nreduction from the total number of charge points (576). These\nresults are consistent with the findings of Ref. \\cite{AB08}, where\nit is also suggested that a superposition method will give accurate\nresults provided there are at least 3 degrees of freedom per\nwavelength. We note that if the surface of interior charge points\nincludes the monopole generating the acoustic field then one would\nobtain exact representations for arbitrarily high frequencies.\n\nIn addition to the general trend of increased errors for higher\nfrequencies, one also observes a local peak in the error at the\ncharacteristic wavenumber $k=52.62$. Here we see that the error is\nparticularly poor for the sparse reconstruction with $\\beta=0.9$,\nand that there is also a local peak in the number of dominant charge\npoints. This suggests that sparse reconstructions are not feasible\nat higher frequencies or at irregular frequencies. However, the\nreconstruction error is lower than the noise level for the schemes\nusing all charge points or with $\\beta=0.5$ for all frequencies\ntested up to twice the Nyquist frequency. The results of this\nsection therefore suggest that the method of superposition with\n$\\ell_1$ regularisation can provide excellent reconstructions for\nfrequencies up to around twice the Nyquist frequency, and that\nsparse reconstructions are feasible provided we have at least three\ndata points per wavelength. Irregular frequencies degrade both\naccuracy and sparsity. However, if a more accurate and sparsely\nreconstructed solution was required at $k=52.62$, then we could\nchange the scaling of the internal source surface (i.e. change\n$\\alpha$) which would move the location of the irregular frequency.\nChanging $\\alpha$ from $1/3$ to $0.4$ leads to a percentage error of\n\\textsc{6.131\\%} for both the full reconstruction and the sparse\nscheme with $\\beta=0.5$, which identifies $N^*(0.5)=102$ dominant\ncharge points. For $\\beta=0.9$, the error increases to\n$\\textsc{16.00\\%}$ with $N^*(0.9)=63$. Note that these results are\nfar more consistent with the other results shown in Table \\ref{T2}\nand the removal of the local error peaks is shown more clearly in\nFig. \\ref{kchange}, where the diamond symbols show the values\ncomputed with $\\alpha=0.4$.\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=kchange, width=\\textwidth}\n        \\caption{\\label{kchange} The accuracy and sparsity of the reconstructed solutions with $15\\%$ added noise, $\\alpha=1/3$ and $z_{0}=0.05$. The plots show the effect of changing the wavenumber $k$, including the effect of irregular frequencies and values above the Nyquist frequency.}\n\\end{center}\n\\end{figure}\n\nThe results presented by Chardon \\emph{et. al.} \\cite{GC12} using\nsparse plane wave reconstructions indicate that randomising the\nexterior data point locations (measurement locations) within the\nhologram plane facilitates sparse reconstructions above the Nyquist\nlimit. Unfortunately, the reconstructed solutions using the method\nof superposition lose their sparsity at frequencies around and above\nthe Nyquist limit and randomising the data point locations has been\nobserved to degrade the accuracy of the reconstructed solution in\ngeneral across the range of wavenumbers studied in Fig.\n\\ref{kchange}. These observations are consistent with the findings\nin Ref. \\cite{MB10}. \\emph{The main result of this section is that\nalthough in certain special cases  $\\ell_1$ sparse regularisation\ncould give exact representations up to arbitrarily high frequencies,\nin general the reconstruction accuracy will decrease at higher\nfrequencies. Irregular frequencies can also be treated simply by\nperturbing the surface of interior charge points.}\n\n\n\\subsection{Dependance on the singularity and charge point locations}\n\nThe results in the previous sections all reconstructed the Neumann\ndata generated from a point source located on the $z-$axis at\n$z_{0}=0.05$. This ensured that the singularity in the solution of\nthe related interior problem was located within the interior charge\npoint surface for $\\alpha=1/3$. We now consider how the accuracy and\nsparsity of our reconstructed solutions depends on both the position\nof an interior source point generating the exterior pressure data,\nand the relative size/ position of the internal charge point surface\ncontrolled by the parameter $\\alpha$ as described in Eq.\n(\\ref{alpha}).\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=zchange, width=\\textwidth}\n        \\caption{\\label{zchange} The accuracy and sparsity of the reconstructed solutions with $k=1$ and $15\\%$ added noise. The plots show the effect of using a range of different sized interior charge point surfaces and different positions for the source point generating the boundary data.}\n\\end{center}\n\\end{figure}\n\nFig. \\ref{zchange} shows both the percentage errors for the sparse\nreconstructions and the value of the sparsity parameter $N^*(0.5)$\nfor different sized interior charge point surfaces and for different\npositions of the point source generating the exterior data. These\nquantities have been computed for values of $\\alpha$ between $0.1$\nand $0.8$, and for $z_{0}$ between $z_{0}=0$ and $z_{0}=0.15$.\nInstead of showing values of the parameter $\\alpha$, Fig.\n\\ref{zchange} shows the corresponding $z-$coordinate where the\ninterior charge point surface intersects the positive $z-$axis. In\nthis way we are able to indicate the size of the interior charge\npoint surface relative to the location of $z_{0}$ on the same axes.\nNote that since $\\Gamma$ intersects the positive $z$-axis at\n$z=0.21$ (it is centred at the origin with total height $0.42$m),\nthen the internal source surface with, for example, $\\alpha=0.5$\nwill intersect the positive $z$-axis at $z=0.105$, and this is the\nvalue used along the horizontal axis in Fig. \\ref{zchange}. In all\ncases the added noise level is $15\\%$. Note that the relative errors\nobtained when reconstructing the solution using all charge points\ndiffers from that given by the sparse reconstruction by less than\n$1\\%$.\n\n\nEach subplot of Fig. \\ref{zchange} shows four curves, corresponding\nto each of four choices of $z_{0}$, and four vertical lines\nindicating the positions of the corresponding point $z_{0}$. The\nleft subplot shows the percentage errors for different choices of\ninterior source surface. We notice that the errors are minimised\nwhen the size of the interior source surface is such that it\nintersects the positive $z-$axis close to $z=z_{0}$, where the curve\ncrosses its corresponding vertical line. Likewise, this right\nsubplot shows that the number of charge points $N^*$ needed to\nobtain a sparse reconstruction is also minimal when the size of the\ninterior source surface is such that it intersects the positive\n$z-$axis close to $z=z_{0}$. In general, the solutions are\nreasonably accurate for source surfaces intersecting the positive\n$z-$axis between $z=0.05$ and $z=0.1$, corresponding to choosing\n$\\alpha=0.3$ or $\\alpha=0.4$. Choosing $\\alpha=0.8$ so that the\nsource surface intersects the positive $z-$axis at $z=0.168$ gave\nthe worst results in general. Interestingly, the results of this\nsection suggest that it doesn't seem to be critical whether or not\nthe surface of interior charge points encloses any singularities in\nthe modelled wave field. Furthermore, the results also point to\nimportant potential applications of the sparse superposition method\ndeveloped in this work for source identification problems in\ngeneral.\n\n\\emph{The main result of this section is that both the accuracy and\nsparsity of the reconstructed solution is enhanced when the surface\nof interior charge points includes points close to the location of\nthe interior monopole generating the acoustic field. A major\nstrength of the sparse reconstruction approach described here will\ntherefore be in its application to source identification problems.}\n\n\\subsection{Example of a locally radiating structure}\n\nIn this section we consider the problem of reconstructing the\nvibrations of a structure which is rigid, except over a relatively\nsmall region. This is both a typical assumption for applications to\nloudspeakers, and is also typical of problems commonly modelled\nusing the method of patch NAH, whereby measurements and\nreconstructions only take place in the vicinity of the vibrating\nregion (see for example Refs. \\cite{AS05,EW03}). In the present\nstudy we use such an example for verification of the sparse\nsuperposition method for a problem where the pressure data is not\ngenerated by a monopole point source, and hence an optimal choice\nfor the surface of internal charge points would not be related to\nthe location of such a monopole.\n\nWe consider reconstructing Neumann boundary data given by a raised\ncosine function\n\n", "itemtype": "equation", "pos": 28473, "prevtext": "\n\nThe pressure data are specified at a distance $\\delta=0.035$m from\n$\\Gamma$ and the internal source surface is scaled down to have\ndimensions $\\alpha=1/3$ the size of $\\Gamma$. We note that these\nchoices should lead to good results based on the fact that $\\delta$\nshould be chosen small enough to capture evanescent contributions to\nthe pressure field, but still large enough to be a practical\ndistance for taking experimental measurements. For a further\ndiscussion on the role of evanescent wave contributions in\nsuperposition methods for NAH problems, the interested reader is\nreferred to Sect. 5 of Ref. \\cite{NV06}. For the choice of the\nparameter $\\alpha$ (\\ref{alpha}), Koopman \\emph{et al.} \\cite{GK89}\nsuggest that too small a value will lead to severe ill conditioning\nas the charge points become very close together, but choosing too\nlarge a value of $\\alpha$ will also give poor results. A choice in\nthe range $\\alpha\\in(0.1,0.6)$ is advised in Ref. \\cite{GK89}. It is\nalso beneficial for the charge point surface to enclose any\nsingularities of the associated interior problem \\cite{AB08}. For\nthese experiments the number of charge points, the number of\nmeasurement points and the number of points at which we reconstruct\nthe solution are all equal to 576. This is achieved by triangulating\nthe internal source surface in an identical way to $\\Gamma$ and\ntaking the charge points at the triangle centroids.\n\nThe results in Table \\ref{T1} show that in the noise free case, the\nreconstruction errors for both the full $\\ell_1$ method and Tikhonov\nregularisation are very small with Tikhonov reconstruction\nperforming better. A sparse representation of the solution is not\nfeasible here in general unless one of the charge points coincides\nwith the monopole generating the acoustic field; the $\\ell_1$\noptimisation identifies a relatively large number $N^*=98$ of\ndominant sources and the error of the `sparse' reconstruction\nincreases significantly compared with the reconstruction using all\n$576$ source points. However, once noise is present in the pressure\ndata then sparse representations of the solution can be obtained\nwith a similar level of accuracy to the Tikhonov approach. The\nreason for this can be explained by considering how the data\nfidelity parameter $\\epsilon$ is chosen in (\\ref{L1reg1}). In\nparticular we take\n\n", "index": 33, "text": "\\begin{equation}\\label{datfid}\n\\epsilon=(\\max\\{\\epsilon_{\\text{min}},w\\})^2\\|\\mathbf{p}_{0}\\|_2^2,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\epsilon=(\\max\\{\\epsilon_{\\text{min}},w\\})^{2}\\|\\mathbf{p}_{0}\\|_{2}^{2},\" display=\"block\"><mrow><mrow><mi>ϵ</mi><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>max</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">{</mo><msub><mi>ϵ</mi><mtext>min</mtext></msub><mo>,</mo><mi>w</mi><mo stretchy=\"false\">}</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msubsup><mrow><mo>∥</mo><msub><mi>𝐩</mi><mn>0</mn></msub><mo>∥</mo></mrow><mn>2</mn><mn>2</mn></msubsup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04863.tex", "nexttext": "\ninside the circle defined by\n$\\Gamma\\cap\\{\\mathbf{x}:10|\\mathbf{x}-\\mathbf{x}_0|<1\\}$, with\n$\\mathbf{x}_0=(0.14,0,-0.0525)$. Outside of this circle we let the\nNeumann boundary data be zero. The exterior pressure data at a\ndistance $\\delta=0.035$m from $\\Gamma$ are generated using a\nBurton-Miller based BEM as described in Ref. \\cite{SA92} for\nexample. The triangulation has been refined compared to the results\nin previous sections and now has $1024$ triangles / interior source\npoints and $1024$ exterior data points. This has been done to\nimprove the resolution of both the boundary data representation and\nthe BEM approximation of the exterior pressure data. Note that here\nthere is an extra source of noise (in addition to the $15\\%$ added\nnoise) in the acoustic pressure data due to the numerical error in\nthe BEM approximation. The results of the sparse reconstruction\ntechnique for wavenumber $k=1$ are shown in Fig. \\ref{twoplot}. We\nfound that a value of $\\alpha$ between $0.3$ and $0.4$ gave the best\nresults, which is consistent with the previous section, and hence we\nhave taken $\\alpha=1/3$.\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=ReconstructedCompLocalNew, width=\\textwidth}\n        \\caption{\\label{twoplot} The Neumann boundary data for a locally radiating structure with $1024$ charge points, $1024$ data points, $k=1$ and $\\alpha=1/3$. Comparison of the exact solution (upper left) with the sparsely reconstructed boundary data (upper right), the sparsely reconstructed boundary data after post-processing (lower left) and a reconstruction using only 28 charge points and a reduced data set with 800 values (lower right).}\n\\end{center}\n\\end{figure}\n\nThe upper subplots of Fig. \\ref{twoplot} show that the sparse\nsuperposition method produces a good reconstruction of the vibrating\nregion for the prescribed locally vibrating boundary data. The\ncomputations shown use $\\beta=0.5$ to generate the sparse scheme\nleading to $N^*=30$ dominant charge points (of $1024$ in total). The\npercentage error in the sparse reconstruction is \\textsc{21.19\\%},\nwhich is the same (up to the quoted level of accuracy) as the error\nusing all $1024$ charge points for the reconstruction. We note that\nthe boundary data to be reconstructed has $52$ out of $1024$ entries\nthat are non-zero. Relatively significant errors arise in the quiet\nregions of the locally vibrating object, close to the edges of the\ncuboid that are nearest the vibrating region. If we assume prior\nknowledge of the non-vibrating regions and consider only the\naccuracy of the reconstruction over the vibrating region, then the\nerror reduces to \\textsc{9.843\\%} for both the sparse and full data\nreconstructions. A plot of this post-processed result is shown in\nthe lower left subplot of Fig. \\ref{twoplot}.\n\nThe lower right subplot of Fig. \\ref{twoplot} shows the result of\nreconstructing the Neumann boundary data starting only with the $30$\ndominant source points identified by the sparse reconstruction\nmethod and using a reduced data set sampled from the full data set\nat $800$ randomly selected points. The same post-processing\nprocedure as described above has been applied to fix the solution in\nthe non-vibrating regions to zero. The results shown are computed\nusing Tikhonov regularisation (with only the 30 charge points\nidentified by the initial sparse reconstruction), which gave\nslightly better accuracy than using the sparse reconstruction\nalgorithm for a second time. The percentage error in the plotted\nreconstruction is \\textsc{18.89\\%}, compared with \\textsc{26.36\\%}\nfor the reconstruction without post-processing. Using the sparse\nalgorithm to reconstruct the solution instead gave errors around\n$3\\%$ higher in each case. Note that these results all show an\nimprovement on the reconstruction obtained from the same reduced\nacoustic data set, but using a basis with all $1024$ charge points.\nIn this case the percentage error was more than doubled to\n\\textsc{58.87\\%}, and improved to \\textsc{46.52\\%} after\npost-processing. We remark that the reconstruction using the full\nbasis with reduced data is an under-determined problem (the acoustic\ndata are fewer than the number of unknowns), whereas the\nreconstruction from the sparse basis is over-determined. This\nsuggests that reducing the number of charge points and changing the\nunder-determined problem into an over-determined one is an important\nstep for the efficient implementation of NAH with reduced data using\nthe method of superposition. \\emph{The main result of this section\nis that sparse reconstruction methods can still be applied when a\nsuitable choice of dictionary of basis functions for the sparse\nreconstruction is not obvious, provided there is some inherent\nsparsity that can be exploited. Sparse reconstructions can also be\nused in conjunction with reduced acoustic field data sets giving\nreasonable results. In particular, the sparse basis representation\nleads to better accuracy and more efficient calculations than using\nthe full basis with the reduced data set.}\n\n\\section{Conclusions}\n\nThe method of superposition has been combined with a sparse $\\ell_1$\nreconstruction algorithm and applied to the problem of near-field\nacoustic holography. The developed sparse superposition method is\nable to reconstruct the normal velocity of a vibrating object using\nonly a very small number of charge points in many cases, in contrast\nwith a standard Tikhonov reconstruction. In particular, it appears\nthat competitive sparse reconstructions can be generated provided\nthe wavenumber is not too large and that the data can be assumed to\nbe sufficiently noisy to permit a data fidelity parameter of at\nleast $5\\%$ of the size of the $\\ell_2$ norm of the exterior\npressure data. Sparsity also appears to be an important factor when\nconsidering reduced acoustic field data sets, where reconstructions\nusing a sparse basis gave a considerable improvement in accuracy\nover using the full basis with all charge points. The results of the\nsimulations point to a number of important future developments. The\nsparse superposition method could be used to generate initial\nconditions for the method of fundamental solutions, whereby the\naccuracy of the reconstruction is optimised over both the charge\npoint strengths and locations using a non-linear optimisation\nalgorithm. This technique could also be applied more widely to\nsource identification problems, as the results have shown that when\nthe charge points are close to point sources generating the exterior\npressure data then the reconstruction becomes very sparse, and the\ncharge points close to the generating point source are highly\ndominant.\n\n\\section*{Acknowledgement}\nN.M. Abusag gratefully acknowledges financial support from the\nLibyan Ministry of Higher Education and Scientific Research. D.J.\nChappell gratefully acknowledges financial support from the European\nUnion (FP7-PEOPLE-2013-IAPP grant no. 612237 (MHiVec)). We also\nthank Prof. Carl Brown for carefully reading the manuscript.\n\n\\begin{thebibliography}{99}\n\\bibitem{EW80a}\nE.G. Williams and J.D. Maynard, Holographic imaging without the\nwavelength resolution limit, Phys. Rev. Lett. {\\bf 45} (1980) 554.\n\\bibitem{EW80b}\nE.G. Williams, J.D. Maynard and E. Skudrzky, Sound source\nreconstructions using a microphone array, {\\it J. Acoust. Soc.\nAmer.} {\\bf 68} (1980) 340.\n\\bibitem{GC12}\nG. Chardon, L. Daudet, A. Peillot, F. Ollivier, N. Bertin and R.\nGribonval, Nearfield acoustic holography using sparsity and\ncompressive sampling principles, {\\it J. Acoust. Soc. Amer.} {\\bf\n132}(2) (2012) 1521.\n\\bibitem{EC08}\nE.J. Cand\\`{e}s and M.B. Wakin, An introduction to compressive\nsampling, \\textit{IEEE Sig. Proc. Mag.} \\textbf{25}(2) (2008) 21.\n\\bibitem{GK89}\nG.H. Koopmann, L. Song, J. B. Fahnline, A method for computing\nacoustic fields based on the principle of wave superposition, {\\it\nJ. Acoust. Soc. Amer.} \\textbf{86}(6) (1989) 2433.\n\\bibitem{BG88}\nB.K. Gardner and R.J. Bernhard, A noise source identification\ntechnique using an inverse Helmholtz integral equation method,\n\\textit{ASME J. Vib., Acoust., Stress, Reliab. Des.} \\textbf{110},\n(1988) 84.\n\\bibitem{SW02}\nS.F. Wu and X.Zhao, Combined Helmholtz equation-least squares method\nfor reconstructing acoustic radiation from arbitrary shaped objects,\n{\\it J. Acoust. Soc. Amer.} \\textbf{112}(1) (2002) 179.\n\\bibitem{SW04}\nS.F. Wu, Hybrid near-field acoustic holography, {\\it J. Acoust. Soc. Amer.} \\textbf{115}(1) (2004) 207.\n\\bibitem{DC09}\nD.J. Chappell and P.J. Harris, A Burton-Miller inverse boundary element method for nearfield acoustic\nholography, {\\it J. Acoust. Soc. Amer.} \\textbf{126}(1), (2009) 149.\n\\bibitem{AB71}\nA.J. Burton and G.F. Miller, The application of integral equation\nmethods to the numerical solution of some exterior boundary-value\nproblems, \\textit{~Proc. ~Roy. ~Soc. ~London, Ser. ~A.} \\textbf{323}\n(1971) 201.\n\\bibitem{HS68}\nH.A. Schenck, Improved integral equation formulations for acoustic\nradiation problems, {\\it J. Acoust. Soc. Amer.} \\textbf{44}(1)\n(1968) 41.\n\\bibitem{ZW97}\nZ. Wang and S.F. Wu, Helmholtz Equation-Least Squares (HELS) method\nfor reconstructing the acoustic pressure field, {\\it J. Acoust. Soc.\nAmer.} \\textbf{102}(4) (1997) 2020.\n\\bibitem{SW00}\nS.F. Wu, On the reconstruction of acoustic pressure fields usingthe\nHelmholtz equation least squares method, {\\it J. Acoust. Soc. Amer.}\n\\textbf{107}(5) (2000) 2511).\n\\bibitem{AS05}\nA. Sarkissian, Method of superposition applied to patch near-field\nacoustic holography, {\\it J. Acoust. Soc. Amer.} \\textbf{118}(2)\n(2005) 671.\n\\bibitem{NV06}\nN.P. Valdivia and E.G. Williams, Study of the comparison of the methods of equivalent sources and boundary element methods for near-field acoustic holography,   {\\it J. Acoust. Soc. Amer.}\n\\textbf{120}(6) (2006) 3694.\n\\bibitem{WB97}\nW. Benthien, and A. Schenck, Nonexistence and nonuniqueness problems\nassociated with integral equation methods in acoustics,\n\\textit{Computers and Structures}, \\textbf{65}(3) (1997) 295.\n\\bibitem{AL10}\nA. Leblanc, R.K. Ing and A. Lavie, A wave superposition method based\non monopole sources with unique solution for all wave numbers,\n\\textit{Acta Acustica united with Acustica}, \\textbf{96}(1), (2010)\n125.\n\\bibitem{AB08}\nA.H. Barnett and T. Betcke, Stability and convergence of the Method\nof Fundamental Solutions for Helmholtz problems on analytic domains,\n\\textit{J. Comput. Phys.} \\textbf{227}(14) (2008) 7003.\n\\bibitem{GF98}\nG. Fairweather and A. Karageorghis, The method of fundamental\nsolutions for elliptic boundary value problems, \\textit{Adv.Comp.\nMath.} \\textbf{9}(1-2) (1998) 69.\n\\bibitem{GF03}\nG. Fairweather, A. Karageorghis and P.A. Martin, The method of\nfundamental solutions for scattering and radiation problems,\n\\textit{Eng. Anal. Boundary Elem.} \\textbf{27}(7) (2003) 759.\n\\bibitem{EW01}\nE.G. Williams, Regularization methods for near-field acoustical\nholography, {\\it J. Acoust. Soc. Amer.} \\textbf{110}(4), (2001)\n1976.\n\\bibitem{EB15}\nE. van den Berg and M. P. Friedlander, SPGL1:  A solver  for\nlarge-scale sparse reconstruction version 1.9, (2015),\n\\verb\"https://www.math.ucdavis.edu/~mpf/spgl1/\", last visited\n06/02/2015.\n\\bibitem{MG15}\nM. Grant and S. Boyd, CVX: Matlab software for disciplined convex\nprogramming, version 2.1, (2015), \\verb\"http://cvxr.com/cvx\", last\nvisited 06/02/2015.\n\\bibitem{AX15a} E. Fernandez-Grande and A.\nXenaki, Sparse acoustic imaging with a spherical array. In\n\\textit{Proc. Euronoise 2015}, Maastricht, Netherlands,\n(2015).\n\\bibitem{AX15b} E. Fernandez-Grande and A. Xenaki, The\nequivalent source method as a sparse signal reconstruction. In\n\\textit{Proc. Internoise 2015}, San Francisco, USA, (2015).\n\\bibitem{CA05}\nC.J.S. Alves and S.S. Valtchev, Numerical comparison of two meshfree\nmethods for acoustic wave scattering, \\textit{Eng. Anal. Boundary\nElem.} \\textbf{29}(4) (2005) 371.\n\\bibitem{SC99} S.S. Chen, D.L.\nDonoho, and M.A. Saunders, Atomic Decomposition by Basis Pursuit,\n\\textit{SIAM J. Sci. Comp.} \\textbf{20}, (1999) 33.\n\\bibitem{PH07}\nP.C. Hansen, Regularization Tools Version 4.0 for Matlab 7.3,\n\\textit{Numerical Algorithms}, \\textbf{46} (2007) 189.\n\\bibitem{MB10}\nM. R. Bai, J.-H. Lin, and K.-L. Liu, Optimized microphone deployment\nfor near-field acoustic holography: To be, or not to be random, that\nis the question, \\textit{J. Sound Vib.} \\textbf{329}(14) (2010)\n2809.\n\\bibitem{EW03}\nE.G. Williams, Continuation of acoustic\nnear-fields, {\\it J. Acoust. Soc. Amer.} \\textbf{113}(3) (2003)\n1273.\n\\bibitem{SA92}\nS. Amini, P.J. Harris and D.T. Wilton, \\emph{Coupled Boundary and\nFinite Element Methods for the Solution of the Dynamic\nFluid-Structure Interaction Problem}, (Lecture Notes in Engineering\nVol. 77, Springer-Verlag, Berlin, 1992).\n\\end{thebibliography}\n\n\\begin{table}[th]\n\\caption{\\label{T1} The $\\ell_2$ percentage error in the\nreconstructed Neumann boundary data generated from a source point on\nthe $z-$axis at $z_{0}=0.05$ with added noise and $k=1$.}\n{\\begin{tabular}{@{}cccc@{}} \\hline\\\\ {Noise level $(\\%)$} & {\\%\nerror for $\\ell_1$ full } & {\\% error for $\\ell_1$ sparse } & {\\%\nerror for Tikhonov}\n\\\\\n\\hline\\\\\n0  & \\textsc{6.2091e-3}   & \\textsc{0.1097}  & \\textsc{1.009e-7}  \\\\\n  5  & \\textsc{3.850}   & \\textsc{3.850} & \\textsc{3.549} \\\\\n  15 & \\textsc{6.428}   & \\textsc{6.429}  & \\textsc{6.017}  \\\\\n\\hline\n\\end{tabular}}\n\\end{table}\n\n\\begin{table}[th]\n\\caption{\\label{T2} The $\\ell_2$ percentage error in the\nreconstructed Neumann boundary data generated from a source point on\nthe $z-$axis at $z_{0}=0.05$, with internal source surface at\n$\\alpha=1/3$ and $15\\%$ added noise over a range of wavenumbers\n$k$.} {\\begin{tabular}{@{}cccccc@{}} \\hline\\\\\n{$k$} & {\\% error: full} & {\\% error: $\\beta=0.5$ } & {$N^*(0.5)$} & {\\% error: $\\beta=0.9$ } & {$N^*(0.9)$}\\\\\n\\hline\\\\\n1  &     \\textsc{6.428}   & \\textsc{6.429}  & 10 & \\textsc{12.27}  & 6  \\\\\n  22.44  & \\textsc{2.369}   & \\textsc{2.369}  & 11 & \\textsc{4.752}  & 9  \\\\\n  44.88  & \\textsc{4.358}   & \\textsc{4.358}  & 37 & \\textsc{6.904}  & 25 \\\\\n  52.62  & \\textsc{9.458}   & \\textsc{9.462}  & 162 & \\textsc{4797}  & 74 \\\\\n  67.32     & \\textsc{6.937}   & \\textsc{6.937} & 108 & \\textsc{17.18}  & 67  \\\\\n  134.6     & \\textsc{11.15}   & \\textsc{11.15} & 189 & \\textsc{17.86}  & 128 \\\\\n  179    & \\textsc{18.89}   & \\textsc{18.89} & 324 & \\textsc{26.87}  & 212 \\\\\n\\hline\n\\end{tabular}}\n\\end{table}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 42933, "prevtext": "\nwhere $w$ is the level of noise added to the pressure data as\nbefore. Recall that larger choices of $\\epsilon$ permit sparser\nsolution representations. However, it only makes sense to choose a\nlarger $\\epsilon$ for noisy data, otherwise it leads to less\naccurate reconstructions. The parameter $\\epsilon_{\\text{min}}\\geq0$\nis included as a tolerance level that is used for the low or zero\nnoise case. A relatively large choice of $\\epsilon_{\\text{min}}$\nwill lead to sparser reconstructions at the expense of accuracy, and\nthe converse is true for small $\\epsilon_{\\text{min}}$. The results\nin this work have been obtained with\n$\\epsilon_{\\text{min}}=\\textsc{1e-6}$.\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=k1R3sparsityjn981510, width=\\textwidth}\n        \\caption{\\label{azzplot} Left and centre columns: A comparison of the charge point strengths using both the Tikhonov and $\\ell_1$ approaches for wavenumber $k=1$ and exterior pressure data generated by a point source at $(0,0,0.05)$. Right column: the locations of the dominant charge points for the $\\ell_1$ approach. The top row shows the case of clean pressure data and the other rows show the results for differing levels of added noise $w$.}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=ReconstructedCompN15, width=\\textwidth}\n        \\caption{\\label{fourplot} Neumann boundary data on a cuboid generated by a point source at $(0,0,0.05)$ with wavenumber $k=1$ and $15\\%$ added noise. The plots compare the exact solution against those reconstructed using Tikhonov regularisation, the $\\ell_1$ approach with all charge points and the sparse $\\ell_1$ approach using only dominant charge points.}\n\\end{center}\n\\end{figure}\nFigure \\ref{azzplot} highlights the differing nature of the\nsolutions reconstructed using the Tikhonov and $\\ell_1$ approaches.\nThe plots show that $\\ell_1$ regularisation is more effective at\npromoting sparsity in the case of noisy data, and hence larger\nvalues of the data fidelity constraint $\\epsilon$. In particular,\nwhen noise is added the solutions can be accurately reconstructed\nusing only 10 to 15 of the 576 source points. This is further\nillustrated in Figure \\ref{fourplot} which shows the reconstructed\nsolution with noise level $w=0.15$ (or equivalently\n$\\mathrm{SNR}_{\\mathrm{dB}}=16.48\\mathrm{dB}$) using each of the\nthree solution strategies described above. The exact solution is\nalso shown for reference.\n\nIn all three cases we achieve a faithful reconstruction of the\nNeumann data on the cuboid since the match to the exact solution is\nvery good. Plots of the cases $w=0$ and $w=0.05$ are omitted for\nbrevity, since as shown in Table \\ref{T1}, the reconstruction errors\nin these cases are even smaller and the likeness to the exact\nsolution shown in Figure \\ref{fourplot} would be even stronger.\n\\emph{The main result of this section is that $\\ell_1$ sparse\nregularisation can give similar accuracy to Tikhonov regularisation\nfor noisy data, but with a small fraction of the number of charge\npoints required to produce the reconstruction.}\n\n\n\\subsection{Higher and irregular frequencies}\n\nWe now investigate the behavior of the method for some potentially\nproblematic choices of the wavenumber $k$. First we look at the case\nwhen the frequency is increased, including when the Nyquist\nfrequency is exceeded. Since our measurements are taken at triangle\ncentroids then the resulting measurement grid is irregular and so\nthe Nyquist frequency is not well-defined. We therefore choose the\nNyquist frequency associated with the regular grid given by the\ntriangle vertices, as a value approximately representative of the\nNyquist frequency. For the discretisation considered in the previous\nsection with $576$ triangles, the grid spacing is $\\Delta x =\n0.04667$, meaning that the wavenumber corresponding to the Nyquist\nfrequency is $k_{\\mathrm{nyq}}=\\pi/\\Delta x= 67.32$. We also\ninvestigate the performance of the method close to other typical\nthreshold frequencies for numerical solution approaches, such as the\nsix grid points per wavelength rule of thumb for finite and boundary\nelement methods, which gives a maximum wavenumber of $k=22.44$ for\nthe grid described above. The performance of the method at irregular\nfrequencies will also be investigated. For the method of\nsuperposition these irregular frequencies are the resonances of the\nregion enclosed by the interior source surface \\cite{GK89}.\nNumerical studies indicate that one such frequency is close to\n$k^*=17.54/\\alpha$, which here is $k=52.62$.\n\nTable \\ref{T2} gives the reconstruction error for a range of\nwavenumbers $k$ using $\\ell_1$ reconstruction techniques and\ncompares the accuracy of the reconstruction using all 576 charge\npoints, and using two different values of the sparsity parameter\n$\\beta$. In particular, we compare the default choice used in the\nlast section of $\\beta=0.5$ with the choice $\\beta=0.9$, which uses\nfewer charge points but at the potential cost of poorer accuracy.\nThe maximum wavenumber studied corresponds to the wavelength being\nclose to (but still greater than) the exterior measurement distance\n$\\delta$. The results show that both irregular and high frequencies\nlead to a degradation in the accuracy of the reconstruction, and\nlead to a loss of sparsity in the reconstructions. Accurate and\nreasonably sparse reconstructions can be generated provided there\nare at least 3 data points per wavelength since for up to $k=44.88$\nwe can reconstruct the solution with a smaller error than the level\nof added noise ($15\\%$) and with at least an order of magnitude\nreduction from the total number of charge points (576). These\nresults are consistent with the findings of Ref. \\cite{AB08}, where\nit is also suggested that a superposition method will give accurate\nresults provided there are at least 3 degrees of freedom per\nwavelength. We note that if the surface of interior charge points\nincludes the monopole generating the acoustic field then one would\nobtain exact representations for arbitrarily high frequencies.\n\nIn addition to the general trend of increased errors for higher\nfrequencies, one also observes a local peak in the error at the\ncharacteristic wavenumber $k=52.62$. Here we see that the error is\nparticularly poor for the sparse reconstruction with $\\beta=0.9$,\nand that there is also a local peak in the number of dominant charge\npoints. This suggests that sparse reconstructions are not feasible\nat higher frequencies or at irregular frequencies. However, the\nreconstruction error is lower than the noise level for the schemes\nusing all charge points or with $\\beta=0.5$ for all frequencies\ntested up to twice the Nyquist frequency. The results of this\nsection therefore suggest that the method of superposition with\n$\\ell_1$ regularisation can provide excellent reconstructions for\nfrequencies up to around twice the Nyquist frequency, and that\nsparse reconstructions are feasible provided we have at least three\ndata points per wavelength. Irregular frequencies degrade both\naccuracy and sparsity. However, if a more accurate and sparsely\nreconstructed solution was required at $k=52.62$, then we could\nchange the scaling of the internal source surface (i.e. change\n$\\alpha$) which would move the location of the irregular frequency.\nChanging $\\alpha$ from $1/3$ to $0.4$ leads to a percentage error of\n\\textsc{6.131\\%} for both the full reconstruction and the sparse\nscheme with $\\beta=0.5$, which identifies $N^*(0.5)=102$ dominant\ncharge points. For $\\beta=0.9$, the error increases to\n$\\textsc{16.00\\%}$ with $N^*(0.9)=63$. Note that these results are\nfar more consistent with the other results shown in Table \\ref{T2}\nand the removal of the local error peaks is shown more clearly in\nFig. \\ref{kchange}, where the diamond symbols show the values\ncomputed with $\\alpha=0.4$.\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=kchange, width=\\textwidth}\n        \\caption{\\label{kchange} The accuracy and sparsity of the reconstructed solutions with $15\\%$ added noise, $\\alpha=1/3$ and $z_{0}=0.05$. The plots show the effect of changing the wavenumber $k$, including the effect of irregular frequencies and values above the Nyquist frequency.}\n\\end{center}\n\\end{figure}\n\nThe results presented by Chardon \\emph{et. al.} \\cite{GC12} using\nsparse plane wave reconstructions indicate that randomising the\nexterior data point locations (measurement locations) within the\nhologram plane facilitates sparse reconstructions above the Nyquist\nlimit. Unfortunately, the reconstructed solutions using the method\nof superposition lose their sparsity at frequencies around and above\nthe Nyquist limit and randomising the data point locations has been\nobserved to degrade the accuracy of the reconstructed solution in\ngeneral across the range of wavenumbers studied in Fig.\n\\ref{kchange}. These observations are consistent with the findings\nin Ref. \\cite{MB10}. \\emph{The main result of this section is that\nalthough in certain special cases  $\\ell_1$ sparse regularisation\ncould give exact representations up to arbitrarily high frequencies,\nin general the reconstruction accuracy will decrease at higher\nfrequencies. Irregular frequencies can also be treated simply by\nperturbing the surface of interior charge points.}\n\n\n\\subsection{Dependance on the singularity and charge point locations}\n\nThe results in the previous sections all reconstructed the Neumann\ndata generated from a point source located on the $z-$axis at\n$z_{0}=0.05$. This ensured that the singularity in the solution of\nthe related interior problem was located within the interior charge\npoint surface for $\\alpha=1/3$. We now consider how the accuracy and\nsparsity of our reconstructed solutions depends on both the position\nof an interior source point generating the exterior pressure data,\nand the relative size/ position of the internal charge point surface\ncontrolled by the parameter $\\alpha$ as described in Eq.\n(\\ref{alpha}).\n\n\\begin{figure}[h]\n\\begin{center}\n          \\epsfig{file=zchange, width=\\textwidth}\n        \\caption{\\label{zchange} The accuracy and sparsity of the reconstructed solutions with $k=1$ and $15\\%$ added noise. The plots show the effect of using a range of different sized interior charge point surfaces and different positions for the source point generating the boundary data.}\n\\end{center}\n\\end{figure}\n\nFig. \\ref{zchange} shows both the percentage errors for the sparse\nreconstructions and the value of the sparsity parameter $N^*(0.5)$\nfor different sized interior charge point surfaces and for different\npositions of the point source generating the exterior data. These\nquantities have been computed for values of $\\alpha$ between $0.1$\nand $0.8$, and for $z_{0}$ between $z_{0}=0$ and $z_{0}=0.15$.\nInstead of showing values of the parameter $\\alpha$, Fig.\n\\ref{zchange} shows the corresponding $z-$coordinate where the\ninterior charge point surface intersects the positive $z-$axis. In\nthis way we are able to indicate the size of the interior charge\npoint surface relative to the location of $z_{0}$ on the same axes.\nNote that since $\\Gamma$ intersects the positive $z$-axis at\n$z=0.21$ (it is centred at the origin with total height $0.42$m),\nthen the internal source surface with, for example, $\\alpha=0.5$\nwill intersect the positive $z$-axis at $z=0.105$, and this is the\nvalue used along the horizontal axis in Fig. \\ref{zchange}. In all\ncases the added noise level is $15\\%$. Note that the relative errors\nobtained when reconstructing the solution using all charge points\ndiffers from that given by the sparse reconstruction by less than\n$1\\%$.\n\n\nEach subplot of Fig. \\ref{zchange} shows four curves, corresponding\nto each of four choices of $z_{0}$, and four vertical lines\nindicating the positions of the corresponding point $z_{0}$. The\nleft subplot shows the percentage errors for different choices of\ninterior source surface. We notice that the errors are minimised\nwhen the size of the interior source surface is such that it\nintersects the positive $z-$axis close to $z=z_{0}$, where the curve\ncrosses its corresponding vertical line. Likewise, this right\nsubplot shows that the number of charge points $N^*$ needed to\nobtain a sparse reconstruction is also minimal when the size of the\ninterior source surface is such that it intersects the positive\n$z-$axis close to $z=z_{0}$. In general, the solutions are\nreasonably accurate for source surfaces intersecting the positive\n$z-$axis between $z=0.05$ and $z=0.1$, corresponding to choosing\n$\\alpha=0.3$ or $\\alpha=0.4$. Choosing $\\alpha=0.8$ so that the\nsource surface intersects the positive $z-$axis at $z=0.168$ gave\nthe worst results in general. Interestingly, the results of this\nsection suggest that it doesn't seem to be critical whether or not\nthe surface of interior charge points encloses any singularities in\nthe modelled wave field. Furthermore, the results also point to\nimportant potential applications of the sparse superposition method\ndeveloped in this work for source identification problems in\ngeneral.\n\n\\emph{The main result of this section is that both the accuracy and\nsparsity of the reconstructed solution is enhanced when the surface\nof interior charge points includes points close to the location of\nthe interior monopole generating the acoustic field. A major\nstrength of the sparse reconstruction approach described here will\ntherefore be in its application to source identification problems.}\n\n\\subsection{Example of a locally radiating structure}\n\nIn this section we consider the problem of reconstructing the\nvibrations of a structure which is rigid, except over a relatively\nsmall region. This is both a typical assumption for applications to\nloudspeakers, and is also typical of problems commonly modelled\nusing the method of patch NAH, whereby measurements and\nreconstructions only take place in the vicinity of the vibrating\nregion (see for example Refs. \\cite{AS05,EW03}). In the present\nstudy we use such an example for verification of the sparse\nsuperposition method for a problem where the pressure data is not\ngenerated by a monopole point source, and hence an optimal choice\nfor the surface of internal charge points would not be related to\nthe location of such a monopole.\n\nWe consider reconstructing Neumann boundary data given by a raised\ncosine function\n\n", "index": 35, "text": "\\begin{equation}\\label{bcloc}\n\\frac{\\partial\np}{\\partial\\mathbf{n}_{x}}(\\mathbf{x})=\\frac{1}{2}\\left(1+\\cos(10\\pi\n|\\mathbf{x}-\\mathbf{x}_0|))\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\partial p}{\\partial\\mathbf{n}_{x}}(\\mathbf{x})=\\frac{1}{2}\\left(1+\\cos(%&#10;10\\pi|\\mathbf{x}-\\mathbf{x}_{0}|))\\right),\" display=\"block\"><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>p</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>𝐧</mi><mi>x</mi></msub></mrow></mfrac><mrow><mo stretchy=\"false\">(</mo><mi>𝐱</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><mrow><mo>(</mo><mn>1</mn><mo>+</mo><mi>cos</mi><mrow><mo stretchy=\"false\">(</mo><mn>10</mn><mi>π</mi><mo stretchy=\"false\">|</mo><mi>𝐱</mi><mo>-</mo><msub><mi>𝐱</mi><mn>0</mn></msub><mo stretchy=\"false\">|</mo><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>)</mo><mo>,</mo></mrow></math>", "type": "latex"}]