[{"file": "1601.04470.tex", "nexttext": "\n\nwith the bath frequencies $\\omega_{i}$, bath masses set to unity and the coupling strengths\n$g_{i}$~\\cite{Caldeira-PRL-1981,Caldeira-AP-1983,grabert88_115}.\n\nFor the sake of presentation we assume the system to be one-dimensional.\n\nOne might complete the square for the bath coordinates, resulting in\n\n\n", "itemtype": "equation", "pos": 10082, "prevtext": "\n\n\n\n\n\\title{Vibrational spectroscopy via the Caldeira-Leggett model with anharmonic system potentials}\n\n\\author{Fabian Gottwald, Sergei D Ivanov$^*$, Oliver K\\\"uhn}\n\n\\ead{sergei.ivanov@uni-rostock.de}\n\n\n\\address{Institute of Physics, Rostock University, Albert Einstein Stra{\\ss}e 23-24, 18059 Rostock, Germany}\n\n\\begin{abstract}\n\nThe Caldeira-Leggett (CL) model, which describes a system bi-linearly coupled to a harmonic bath, has enjoyed popularity in condensed phase spectroscopy owing to its utmost simplicity.\n\nHowever, the applicability of the model to cases with anharmonic system potentials, as it is required for the description of realistic systems in solution,\nis questionable due to the presence of the invertibility problem \n[\\href{http://pubs.acs.org/doi/abs/10.1021/acs.jpclett.5b00718}{J.\\ Phys.\\ Chem.\\ Lett., \\textbf{6}, 2722 (2015)}]\nunless the system itself resembles the CL model form.\n\nThis might well be the case at surfaces or in the solid regime, which we here confirm for a particular example of an iodine molecule in the atomic argon environment under high pressure.\n\nFor this purpose we extend the recently proposed Fourier method for parameterizing linear generalized Langevin dynamics\n[\\href{http://scitation.aip.org/content/aip/journal/jcp/142/24/10.1063/1.4922941}{J.\\ Chem.\\ Phys., \\textbf{142}, 244110 (2015)}] to the non-linear case based on the CL model and perform an extensive error analysis.\n\nIn order to judge on the applicability of this model in advance, we give handy empirical criteria and discuss the effect of the potential renormalization term.\n\nThe obtained results provide evidence that the CL model can be used for describing a potentially broad class of systems.\n\\end{abstract}\n\n\n\\date{\\today}\n\\submitto{\\NJP}\n\n\\maketitle\n\n\\section{Introduction}\n\nThe analysis of complex dynamical processes in many-particle systems is\none of the main goals in modern physics and requires sophisticated experimental setups and reliable theoretical models.\n\nAlthough to date computer facilities allow one\nto treat an increasingly large amount of coupled degrees of freedom (DOFs),\n\na reduction of the description to few variables is convenient in many cases, \nsince this can not only ease the interpretation, but enable the identification of key properties~\\cite{Kuehn2011}.\n\nSuch a reduced description can formally be obtained from a so-called system-bath partitioning, where only a small subset of DOFs, referred to as system, is considered as important for describing a physical process under study.\n\nAll other DOFs, referred to as bath, are regarded as irrelevant in the sense that they might influence the time evolution of the system but do not \n\\textit{explicitly} enter any dynamical variable of interest. \n\nConveniently, reduced equations of motion (EOMs) for the system DOFs are derived, in which the influence of the bath\nis limited to dissipation and fluctuations only.\n\nTo obtain a reduced description, different strategies can be employed. \n\nA very popular approach is to assume a simple form of the bath such that its DOFs can be easily integrated out from the system's EOMs.\n\nParticularly, in the Caldeira-Leggett (CL) model, the environment is assumed to be a collection of independent harmonic oscillators, bi-linearly coupled to the system~\\cite{Caldeira-PRL-1981,Caldeira-AP-1983,Zwanzig1973,ZwanzigBook2001}.\n\nThis model has been widely used in analyzing and interpreting (non-)linear spectroscopic experiments on systems in condensed phase, termed multi-mode Brownian oscillator (MBO) model in this context~\\cite{Mukamel1995,Palese1996,Okumura1997,Woutersen1999,Toutounji2002,Tanimura2009,Joutsuka2011}.\n\nThe resulting reduced EOM is known as the generalized Langevin equation (GLE),\nwhere the bath's influence is described by a frequency-dependent friction and a stochastic force with a finite correlation time.\n\nDepending on the type of the CL model, the system potential is (or is not)\nmodified by a harmonic renormalization term, see {Sec.~\\ref{{sec:CL model}}} for a discussion.\n\n\nAnother approach to reduced EOMs is to employ formal projection operator techniques to project out the bath from the system's EOM resulting in linear or non-linear GLE forms~\\cite{Mori1965,Kawasaki1973,Kawai2011,ZwanzigBook2001}. \n\nIn the former, the resulting system potential is effectively harmonic, whereas in the latter the system potential is formed by a (non-linear) mean-field potential.\n\nIn both cases, noise and dissipation can be mathematically defined as (non-)linearly projected quantities.\n\nIndependently on the derivation, the general advantage of the GLE\n\nis that the dissipation and the statistical properties of the noise are entirely described by the so-called memory kernel being simply a function of time or, equivalently, by the spectral density as its frequency domain counterpart.\n\n\nDue to this simplicity, the GLE has been applied in many fields as, for instance, in the theory of vibrational relaxation for estimating characteristic relaxation times~\\cite{Whitnell1990,Benjamin1993,Tuckerman1993a,Gnanakaran1996a},\nreaction rates~\\cite{Grote-JCP-1980} and for thermostatting purposes~\\cite{Ceriotti2009,Ceriotti2009a, Ceriotti2010};\nsee, e.g., Refs.~\\cite{Abe-PR-1996,Tanimura2006,Snook-Book} for review.\n\n\nDespite its popularity, establishing a connection between the CL model (or the respective GLE) and a real many-particle system is not straightforward.\n\nIn Ref.~\\cite{Gottwald-JPCL-2015} we have shown that it is generally not possible to establish an invertible mapping between the two due to the so-called invertibility problem.\n\nIn a nutshell,\nthe memory kernel is unambiguously determined by momentum--momentum and momentum--system force correlation functions that are available,\ne.g.\\ directly from molecular dynamics (MD) simulations.\n\nIt turned out that there exist infinitely many pairs of such correlation functions that correspond to the same memory kernel\n\nand, hence, the corresponding GLE cannot mimic the true system dynamics.\n\nThere are two important exceptions, however: i) the CL model's system potential is taken effectively harmonic; ii) the real system is (approximately) of the CL form, that is the bath is (almost) harmonic and the coupling to the system is (almost) bi-linear.\n\nThe former is not satisfactory if we are interested in non-linear spectroscopy, though can be well applied to study dissipation dynamics as well as linear response properties.\n\nAlso the price to pay is that any connection to atomistic description is sacrificed, since all the anharmonicity in the \nsystem is projected onto the bath.\n\nThe second exception, however, suggests that there might exist a broad class of systems which satisfy these criteria.\n\nUnfortunately, we have shown that this is not the case for typical molecular systems in solution, such as\naqueous systems and the ionic liquid [C$_2$mim][NTf$_2$]~\\cite{Gottwald-JPCL-2015}.\n\nStill, considering the somewhat  artificial A$_2$ in A system adopted from Ref.~\\cite{Berne1990} showed that it can be\nsatisfactorily mapped onto the model~\\cite{Gottwald-JCP-2015}.\n\nImportantly, if such a mapping can be established, then the full quantum-mechanical treatment of the bath can be performed analytically via the Feynman-Vernon influence functional~\\cite{Feynman-AP-1963,Caldeira-PhysicaA-1983} without any further approximations.\n\nMoreover, numerically exact hierarchy type equation of motion approaches\n\nare essentially based on the CL model~\\cite{Dijkstra-PRL-2010,Suess:2014gz}.\n\nFurther, it is ideally suited for numerical methods that solve the Schr\\\"odinger equation in many dimensions~\\cite{giese06_211}.\n\nThe CL model can also be taken as a starting point for quantum-classical hybrid simulations, that is by treating only the usually\nlow-dimensional system part quantum-mechanically and the bath (semi)classically~\\cite{egorov99_5238}.\n\nFinally, the machinery for a purely classical treatment by means of a GLE is provided by the method of colored noise thermostats~\\cite{Ceriotti2009,Ceriotti2009a,Ceriotti2010}.\n\nThis means that if the mapping were established then the CL model would provide a unified framework for reduced dynamics as well as for the quantum-classical comparison of dynamical properties of real molecular systems.\n\nIn this paper, we aim at finding cases when the anharmonic CL model,\nthat is the CL model with the anharmonic system potential resulting in the corresponding non-linear GLE,\nis successful in describing a many-particle system and formulating the criteria when one can expect such a success.\n\n\nFurther, we extend our recently suggested Fourier-based scheme for calculating memory kernels from explicit MD\nsimulations for the harmonic cases~\\cite{Gottwald-JCP-2015} to the anharmonic ones.\n\nSince the resulting protocol is much more sensitive to the numerical accuracy of the input data than the one for the linear GLE, a comprehensive error analysis is provided as well.\n\nThe paper is organized as follows.\n\nIn {Sec.~\\ref{{sec:CL model}}} we review the basic theory underlying the CL model.\n\nSection \\ref{sec:method} contains the detailed description of the proposed numerical scheme for computing the spectral density including the error analysis.\n\nAfter giving the computational details in {Sec.~\\ref{{sec:comp_det}}} we \napply the developed scheme to a specific system where the mapping onto the CL model with an anharmonic system potential is satisfactory in {Sec.~\\ref{{sec:applications}}}.\n\nFurther we discuss the possibility to formulate the criteria for an existence of a mapping between the CL model and the real molecular system followed by a general conclusion in {Sec.~\\ref{{sec:conclusion}}}.\n\n\\section{The Caldeira-Leggett Model\\label{sec:CL model}}\n\n\nThe CL model has enjoyed great popularity in condensed phase spectroscopy~\\cite{Palese1996,Okumura1997,Woutersen1999,Toutounji2002,Tanimura2009,Kleinekathoefer-JPCD-2010,Joutsuka2011}.\n\nIt assumes that the bath consists of independent harmonic oscillators\nbi-linearly coupled to the system.\n\nThe total potential energy for the model reads\n\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:CL Hamiltonian}\n{V_{\\mathrm{CL}}}(x,\\{Q_i\\})={V_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}\\omega_{i}^{2}Q^2_{i}-\\sum_{i}g_{i} Q_i x \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{V_{\\mathrm{CL}}}(x,\\{Q_{i}\\})={V_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}\\omega_{%&#10;i}^{2}Q^{2}_{i}-\\sum_{i}g_{i}Q_{i}x\" display=\"block\"><mrow><mrow><msub><mi>V</mi><mi>CL</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mrow><mo stretchy=\"false\">{</mo><msub><mi>Q</mi><mi>i</mi></msub><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>V</mi><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>Q</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mrow></mrow><mo>-</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>g</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>Q</mi><mi>i</mi></msub><mo>⁢</mo><mi>x</mi></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwith the renormalized system potential\n\n\n", "itemtype": "equation", "pos": 10554, "prevtext": "\n\nwith the bath frequencies $\\omega_{i}$, bath masses set to unity and the coupling strengths\n$g_{i}$~\\cite{Caldeira-PRL-1981,Caldeira-AP-1983,grabert88_115}.\n\nFor the sake of presentation we assume the system to be one-dimensional.\n\nOne might complete the square for the bath coordinates, resulting in\n\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq:CL Hamiltonian renormalized}\n{V_{\\mathrm{CL}}}(x,\\{Q_i\\})={\\tilde{V}_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}\\omega_{i}^{2}\\left (Q_{i} - \\frac{g_i}{\\omega_i^2} x\\right )^2\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{V_{\\mathrm{CL}}}(x,\\{Q_{i}\\})={\\tilde{V}_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}%&#10;\\omega_{i}^{2}\\left(Q_{i}-\\frac{g_{i}}{\\omega_{i}^{2}}x\\right)^{2}\" display=\"block\"><mrow><mrow><msub><mi>V</mi><mi>CL</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mrow><mo stretchy=\"false\">{</mo><msub><mi>Q</mi><mi>i</mi></msub><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mover accent=\"true\"><mi>V</mi><mo stretchy=\"false\">~</mo></mover><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msub><mi>Q</mi><mi>i</mi></msub><mo>-</mo><mrow><mfrac><msub><mi>g</mi><mi>i</mi></msub><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup></mfrac><mo>⁢</mo><mi>x</mi></mrow></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nnote that this renormalization emerges in the EOMs irrespectively whether {Eq.~(\\ref{{eq:CL Hamiltonian}})} or {Eq.~(\\ref{{eq:CL Hamiltonian renormalized}})} is used as a starting point~\\cite{Cortes1985a}.\n\n\nThe two potentials, {Eqs.~({\\ref{eq:CL Hamiltonian},\\ref{eq:CL Hamiltonian renormalized}})}, are mathematically equal, and differ exclusively by the way of partitioning into the system and the bath,\n\nwhich may become important if the two are treated differently.\n\n\n\n\n\nThe physical consequences of such a renormalization of the system potential have been addressed at different places in the literature. \n\n\nPetruccione and Vacchini considered the necessity of the counter term from the standpoint of obtaining a translationally invariant reduced dynamics for the Brownian particle in a homogeneous fluid~\\cite{Vacchini-PRE-2005}.\n\nWisdom and Clark have discussed the renormalization effect in the context of enhancing tunneling probabilities through a barrier~\\cite{Widom-1982-63,Widom-1982-1572}.\n\n\nThe quasi-adiabatic propagator for path integral methods (QUAPI) developed by Makri and coworkers profited from the presence of the renormalization term for the description of reaction dynamics~\\cite{Makri-CPL-1993, Makri-JCP-1994}.\n\nCaldeira and Leggett have given insight into when and when not to expect a renormalization effect~\\cite{Caldeira-AP-1983}.\n\nAccording to them, one can expect it in nuclear dynamics, for instance, when a collective DOF is coupled to many single particle modes.\n\nIn contrast, no renormalization should be expected if the system-bath coupling is adiabatic. \n\nAdditionally, the authors have shown that a rigorous treatment of systems in an electromagnetic field can be described by a CL Hamiltonian with a counter term that cancels the renormalization of the potential~\\cite{Caldeira-AP-1983}.\n\nRemoving the renormalization term from the potential amounts to\n\n\n", "itemtype": "equation", "pos": 10806, "prevtext": "\n\nwith the renormalized system potential\n\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq: corrected potential}\n{\\tilde{V}_{\\mathrm{S}}}(x) \\equiv {V_{\\mathrm{S}}}(x) - \\frac{1}{2} \\sum_i \\frac{g_i^2}{ \\omega_i^2} x^2\n\\enspace ;\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\tilde{V}_{\\mathrm{S}}}(x)\\equiv{V_{\\mathrm{S}}}(x)-\\frac{1}{2}\\sum_{i}\\frac{%&#10;g_{i}^{2}}{\\omega_{i}^{2}}x^{2}\\@math@espace;\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>V</mi><mo stretchy=\"false\">~</mo></mover><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mrow><msub><mi>V</mi><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><msubsup><mi>g</mi><mi>i</mi><mn>2</mn></msubsup><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup></mfrac><mo>⁢</mo><msup><mi>x</mi><mn>2</mn></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nThis form of the CL model is often termed multi-mode Brownian oscillator (MBO) model~\\cite{Mukamel1995}.\n\n\n\nHere we will adopt this terminology and refer to {Eq.~(\\ref{{eq:CL Hamiltonian renormalized}})} and to {Eq.~(\\ref{{eq:MBO Hamiltonian}})} as to the CL and the MBO model, respectively.\n\nNote that there are no differences between the models, apart from the presence/absence of the\naforementioned renormalization term.\n\n\n\nGiven the similarity of the models, a GLE can be derived from either of them both in the classical~\\cite{Zwanzig1973,Cortes1985a,ZwanzigBook2001} and \nquantum~\\cite{Ford-JSP-1987,Ford-PRA-1988} domains; the respective subscripts (CL or MBO) will be omitted from now on unless there would be a need for explicit distinction.\n\nLimiting ourselves to the classical description, the derivation can be straightforwardly performed\nwithout any further approximations by integrating the EOMs for the bath, yielding\n\n\n", "itemtype": "equation", "pos": 12885, "prevtext": "\n\nnote that this renormalization emerges in the EOMs irrespectively whether {Eq.~(\\ref{{eq:CL Hamiltonian}})} or {Eq.~(\\ref{{eq:CL Hamiltonian renormalized}})} is used as a starting point~\\cite{Cortes1985a}.\n\n\nThe two potentials, {Eqs.~({\\ref{eq:CL Hamiltonian},\\ref{eq:CL Hamiltonian renormalized}})}, are mathematically equal, and differ exclusively by the way of partitioning into the system and the bath,\n\nwhich may become important if the two are treated differently.\n\n\n\n\n\nThe physical consequences of such a renormalization of the system potential have been addressed at different places in the literature. \n\n\nPetruccione and Vacchini considered the necessity of the counter term from the standpoint of obtaining a translationally invariant reduced dynamics for the Brownian particle in a homogeneous fluid~\\cite{Vacchini-PRE-2005}.\n\nWisdom and Clark have discussed the renormalization effect in the context of enhancing tunneling probabilities through a barrier~\\cite{Widom-1982-63,Widom-1982-1572}.\n\n\nThe quasi-adiabatic propagator for path integral methods (QUAPI) developed by Makri and coworkers profited from the presence of the renormalization term for the description of reaction dynamics~\\cite{Makri-CPL-1993, Makri-JCP-1994}.\n\nCaldeira and Leggett have given insight into when and when not to expect a renormalization effect~\\cite{Caldeira-AP-1983}.\n\nAccording to them, one can expect it in nuclear dynamics, for instance, when a collective DOF is coupled to many single particle modes.\n\nIn contrast, no renormalization should be expected if the system-bath coupling is adiabatic. \n\nAdditionally, the authors have shown that a rigorous treatment of systems in an electromagnetic field can be described by a CL Hamiltonian with a counter term that cancels the renormalization of the potential~\\cite{Caldeira-AP-1983}.\n\nRemoving the renormalization term from the potential amounts to\n\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eq:MBO Hamiltonian}\n{V_{\\mathrm{MBO}}}(x,\\{Q_i\\})={V_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}\\omega_{i}^{2}\\left (Q_{i} - \\frac{g_i}{\\omega_i^2} x\\right )^2\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{V_{\\mathrm{MBO}}}(x,\\{Q_{i}\\})={V_{\\mathrm{S}}}(x)+\\sum_{i}\\frac{1}{2}\\omega_%&#10;{i}^{2}\\left(Q_{i}-\\frac{g_{i}}{\\omega_{i}^{2}}x\\right)^{2}\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><msub><mi>V</mi><mi>MBO</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mrow><mo stretchy=\"false\">{</mo><msub><mi>Q</mi><mi>i</mi></msub><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>V</mi><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msub><mi>Q</mi><mi>i</mi></msub><mo>-</mo><mrow><mfrac><msub><mi>g</mi><mi>i</mi></msub><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup></mfrac><mo>⁢</mo><mi>x</mi></mrow></mrow><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere the system force $F[x(t)]\\equiv-\\partial_x {\\tilde{V}_{\\mathrm{S}}}[x(t)]$ for the CL model or\n$F[x(t)]\\equiv-\\partial_x {V_{\\mathrm{S}}}[x(t)]$ for the MBO model.\n\nIn the GLE the bath is reduced to non-Markovian dissipation and fluctuations,\nrepresented by the memory kernel, $\\xi(t)$, and the so-called noise term or fluctuating term, $R(t)$, respectively.\n\nThe memory kernel can be written down explicitly as \n\n\n", "itemtype": "equation", "pos": 14023, "prevtext": "\n\nThis form of the CL model is often termed multi-mode Brownian oscillator (MBO) model~\\cite{Mukamel1995}.\n\n\n\nHere we will adopt this terminology and refer to {Eq.~(\\ref{{eq:CL Hamiltonian renormalized}})} and to {Eq.~(\\ref{{eq:MBO Hamiltonian}})} as to the CL and the MBO model, respectively.\n\nNote that there are no differences between the models, apart from the presence/absence of the\naforementioned renormalization term.\n\n\n\nGiven the similarity of the models, a GLE can be derived from either of them both in the classical~\\cite{Zwanzig1973,Cortes1985a,ZwanzigBook2001} and \nquantum~\\cite{Ford-JSP-1987,Ford-PRA-1988} domains; the respective subscripts (CL or MBO) will be omitted from now on unless there would be a need for explicit distinction.\n\nLimiting ourselves to the classical description, the derivation can be straightforwardly performed\nwithout any further approximations by integrating the EOMs for the bath, yielding\n\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:CL-GLE}\n\\dot{p}(t) = \n\nF[x(t)]-\n\n\\intop_{0}^{t}\\xi(t-\\tau)p(\\tau){\\mathrm{d}} \\tau+R(t)\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\dot{p}(t)=\\par&#10; F[x(t)]-\\par&#10;\\intop_{0}^{t}\\xi(t-\\tau)p(\\tau){\\mathrm{d}}\\tau%&#10;+R(t)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><mi>p</mi><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></munderover><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>-</mo><mi>τ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>τ</mi></mrow></mrow></mrow></mrow><mo>+</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere $m$ is the mass of the system DOF.\n\nAlthough it is possible to write down a cumbersome explicit expression for $R(t)$,\nit is usually employed via a stochastic model~\\cite{ZwanzigBook2001}.\n\nThe form of this explicit expression dictates that the fluctuating force is gaussian-distributed and has zero mean.\n\nIts time correlations are described by means of the fluctuation-dissipation theorem (FDT) that connects the fluctuating force with the memory kernel, that is with dissipation\n\n\n", "itemtype": "equation", "pos": 14585, "prevtext": "\n\nwhere the system force $F[x(t)]\\equiv-\\partial_x {\\tilde{V}_{\\mathrm{S}}}[x(t)]$ for the CL model or\n$F[x(t)]\\equiv-\\partial_x {V_{\\mathrm{S}}}[x(t)]$ for the MBO model.\n\nIn the GLE the bath is reduced to non-Markovian dissipation and fluctuations,\nrepresented by the memory kernel, $\\xi(t)$, and the so-called noise term or fluctuating term, $R(t)$, respectively.\n\nThe memory kernel can be written down explicitly as \n\n\n", "index": 11, "text": "\\begin{equation}\n\\xi(t)  = \\sum_{i}\\frac{g_{i}^{2}}{m\\omega_{i}^{2}}\\cos(\\omega_{i}t)\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\xi(t)=\\sum_{i}\\frac{g_{i}^{2}}{m\\omega_{i}^{2}}\\cos(\\omega_{i}t)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><mfrac><msubsup><mi>g</mi><mi>i</mi><mn>2</mn></msubsup><mrow><mi>m</mi><mo>⁢</mo><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ω</mi><mi>i</mi></msub><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nthereby establishing the canonical ensemble with the temperature $T$.\n\nDefining the spectral density as the one-sided Fourier transform (denoted with a hat)\nfrom the memory kernel yields\n\n\n", "itemtype": "equation", "pos": 15187, "prevtext": "\n\nwhere $m$ is the mass of the system DOF.\n\nAlthough it is possible to write down a cumbersome explicit expression for $R(t)$,\nit is usually employed via a stochastic model~\\cite{ZwanzigBook2001}.\n\nThe form of this explicit expression dictates that the fluctuating force is gaussian-distributed and has zero mean.\n\nIts time correlations are described by means of the fluctuation-dissipation theorem (FDT) that connects the fluctuating force with the memory kernel, that is with dissipation\n\n\n", "index": 13, "text": "\\begin{equation}\n\\label{eq:FDT}\n\\left\\langle R(0)R(t)\\right\\rangle =mkT\\xi(t)\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\left\\langle R(0)R(t)\\right\\rangle=mkT\\xi(t)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mo>⟨</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>=</mo><mrow><mi>m</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nComparing this to {Eq.~(\\ref{{eq: corrected potential}})} immediately gives\n\n\n", "itemtype": "equation", "pos": 15480, "prevtext": "\n\nthereby establishing the canonical ensemble with the temperature $T$.\n\nDefining the spectral density as the one-sided Fourier transform (denoted with a hat)\nfrom the memory kernel yields\n\n\n", "index": 15, "text": "\\begin{equation}\n\\label{eq:MemoryKernel}\n\\Re \\hat{\\xi}(\\omega) \\equiv \\Re \\int\\limits_0^\\infty {\\mathrm{d}} t \\, \\e^{-{\\mathrm{i}} \\omega t}\\xi(t)=\n\\sum\\limits_i^\\infty \\frac{g_i^2}{m \\omega_i^2} \\delta(\\omega - \\omega_i)\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\Re\\hat{\\xi}(\\omega)\\equiv\\Re\\int\\limits_{0}^{\\infty}{\\mathrm{d}}t\\,\\e^{-{%&#10;\\mathrm{i}}\\omega t}\\xi(t)=\\sum\\limits_{i}^{\\infty}\\frac{g_{i}^{2}}{m\\omega_{i%&#10;}^{2}}\\delta(\\omega-\\omega_{i})\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">ℜ</mi><mo>⁡</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mi mathvariant=\"normal\">ℜ</mi><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mrow><mo>d</mo><mpadded width=\"+1.7pt\"><mi>t</mi></mpadded></mrow><mo>⁢</mo><msup><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\e</mtext></merror><mrow><mo>-</mo><mrow><mi mathvariant=\"normal\">i</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo>⁢</mo><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mfrac><msubsup><mi>g</mi><mi>i</mi><mn>2</mn></msubsup><mrow><mi>m</mi><mo>⁢</mo><msubsup><mi>ω</mi><mi>i</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ω</mi><mo>-</mo><msub><mi>ω</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nIt is worth mentioning again that the definitions of the spectral density, the memory kernel and the FDT, coincide for the GLEs resulting from the CL and MBO models.\n\nNevertheless, the system dynamics is different and the choice of the model is system-dependent.\n\nTherefore, we employ both models and compare their performance against each other in the following.\n\n\\section{Calculating the spectral density \\label{sec:method}}\n\n\n\\subsection{Fourier method}\n\\label{sec:Fourier}\n\nRecently, we argued that the problem of parameterizing the memory kernel naturally poses itself in the \nfrequency domain and proposed a method for parameterizing linear (Mori-Zwanzig) GLEs, i.e.~for harmonic system potentials~\\cite{Gottwald-JCP-2015};\n\n\nnote that a similar in spirit but technically different method for linear GLEs was developed independently~\\cite{Bonfanti-AdP-2015}\nand applied to quantum dynamics of hydrogen atoms on graphene~\\cite{Bonfanti-JCP-2015,Bonfanti-JCP-2015-2}.\n\nIn the following, we extend the method to the non-linear GLEs, {Eq.~(\\ref{{eq:CL-GLE}})}, based on the CL (or MBO) model with an anharmonic system potential.\n\nThe starting point is the integro-differential equation for the momentum autocorrelation function (MAF), $C_{pp}(t)\\equiv \\langle p(t)p(0) \\rangle$ and the correlation function of momentum and system force (MFC), $C_{pF}(t)\\equiv \\langle F(t)p(0) \\rangle$,\n\n\n", "itemtype": "equation", "pos": 15806, "prevtext": "\n\nComparing this to {Eq.~(\\ref{{eq: corrected potential}})} immediately gives\n\n\n", "index": 17, "text": "\\begin{equation}\n\\label{eq:renormalized Potential}\n{\\tilde{V}_{\\mathrm{S}}}(x)={V_{\\mathrm{S}}}(x) - \\frac{1}{2}m x^2 \\int\\limits_0^\\infty \\Re \\hat \\xi (\\omega){\\mathrm{d}} \\omega \n\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"{\\tilde{V}_{\\mathrm{S}}}(x)={V_{\\mathrm{S}}}(x)-\\frac{1}{2}mx^{2}\\int\\limits_{%&#10;0}^{\\infty}\\Re\\hat{\\xi}(\\omega){\\mathrm{d}}\\omega\\par&#10;\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>V</mi><mo stretchy=\"false\">~</mo></mover><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>V</mi><mi mathvariant=\"normal\">S</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>m</mi><mo>⁢</mo><msup><mi>x</mi><mn>2</mn></msup><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mrow><mi mathvariant=\"normal\">ℜ</mi><mo>⁡</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>ω</mi></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": " \n\nwhere the system force, $F(t)$, is defined with respect to the underlying model, see above.\n\nThis equation can be derived by multiplying the GLE, {Eq.~(\\ref{{eq:CL-GLE}})}, with $p(0)$ followed by a canonical average over initial conditions; note that the initial momenta are uncorrelated with the noise.\n\nTo obtain the memory kernel one can invert {Eq.~(\\ref{{eq:Volterraequation-CL}})} taking the MAF and the MFC, computed from explicit MD simulations, as an input.\n\nFollowing the derivation of the Fourier method for linear GLEs, we perform\na half-sided Fourier transform of {Eq.~(\\ref{{eq:Volterraequation-CL}})} resulting in\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nIt is worth mentioning again that the definitions of the spectral density, the memory kernel and the FDT, coincide for the GLEs resulting from the CL and MBO models.\n\nNevertheless, the system dynamics is different and the choice of the model is system-dependent.\n\nTherefore, we employ both models and compare their performance against each other in the following.\n\n\\section{Calculating the spectral density \\label{sec:method}}\n\n\n\\subsection{Fourier method}\n\\label{sec:Fourier}\n\nRecently, we argued that the problem of parameterizing the memory kernel naturally poses itself in the \nfrequency domain and proposed a method for parameterizing linear (Mori-Zwanzig) GLEs, i.e.~for harmonic system potentials~\\cite{Gottwald-JCP-2015};\n\n\nnote that a similar in spirit but technically different method for linear GLEs was developed independently~\\cite{Bonfanti-AdP-2015}\nand applied to quantum dynamics of hydrogen atoms on graphene~\\cite{Bonfanti-JCP-2015,Bonfanti-JCP-2015-2}.\n\nIn the following, we extend the method to the non-linear GLEs, {Eq.~(\\ref{{eq:CL-GLE}})}, based on the CL (or MBO) model with an anharmonic system potential.\n\nThe starting point is the integro-differential equation for the momentum autocorrelation function (MAF), $C_{pp}(t)\\equiv \\langle p(t)p(0) \\rangle$ and the correlation function of momentum and system force (MFC), $C_{pF}(t)\\equiv \\langle F(t)p(0) \\rangle$,\n\n\n", "index": 19, "text": "\\begin{equation}\n\\label{eq:Volterraequation-CL}\n\\dot{C}_{pp}(t)= C_{pF}(t) - \\intop_0^t\\xi(t-\\tau)C_{pp}(\\tau) {\\mathrm{d}} \\tau\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\dot{C}_{pp}(t)=C_{pF}(t)-\\intop_{0}^{t}\\xi(t-\\tau)C_{pp}(\\tau){\\mathrm{d}}%&#10;\\tau\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo>˙</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></munderover><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>-</mo><mi>τ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>τ</mi></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nNote that the term $C_{pp}(t=0)$ stems from the half-sided transform and would vanish if a full-sided Fourier transform were taken.\n\nThis algebraic equation can be directly solved for the spectral density,\n\n\n", "itemtype": "equation", "pos": 18193, "prevtext": " \n\nwhere the system force, $F(t)$, is defined with respect to the underlying model, see above.\n\nThis equation can be derived by multiplying the GLE, {Eq.~(\\ref{{eq:CL-GLE}})}, with $p(0)$ followed by a canonical average over initial conditions; note that the initial momenta are uncorrelated with the noise.\n\nTo obtain the memory kernel one can invert {Eq.~(\\ref{{eq:Volterraequation-CL}})} taking the MAF and the MFC, computed from explicit MD simulations, as an input.\n\nFollowing the derivation of the Fourier method for linear GLEs, we perform\na half-sided Fourier transform of {Eq.~(\\ref{{eq:Volterraequation-CL}})} resulting in\n\n\n", "index": 21, "text": "\\begin{equation}\ni\\omega \\hat{C}_{pp}(\\omega)-C_{pp}(t=0)=\\hat{C}_{pF}(\\omega)-\\hat{\\xi}(\\omega)\\hat{C}_{pp}(\\omega)\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"i\\omega\\hat{C}_{pp}(\\omega)-C_{pp}(t=0)=\\hat{C}_{pF}(\\omega)-\\hat{\\xi}(\\omega)%&#10;\\hat{C}_{pp}(\\omega)\\@math@espace.\" display=\"block\"><mrow><mi>i</mi><mi>ω</mi><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>=</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere it has been assumed that both, the MAF and the MFC, are normalized to $C_{pp}(t=0)$.\n\nCalculating the spectral density for the MBO model according to {Eq.~(\\ref{{eq:ComputingKernel}})} is straightforward as all the required ingredients, the MAF and the MFC, are available from MD simulations directly.\n\nIn contrast, for the CL model one has to compute an MFC with a renormalized system force, where the renormalization is not known a priori.\n\nNonetheless, since the spectral density is exactly the same in both models, one can always compute it for the MBO model and use it within both models.\n\nThe renormalization term can be then computed from the obtained spectral density according to {Eq.~(\\ref{{eq: corrected potential}})}.\n\nNote that the Fourier method for linear GLEs \n\nrequires just \nthe MAF from which the true kernel, $\\xi(t)$, and the effective system frequency can be fitted, see Eqs.~(3.2) -- (3.4) in Ref.~\\cite{Gottwald-JCP-2015}.\n\nIt becomes apparent at this point that for anharmonic systems this procedure cannot be exploited anymore and one has to use both, the MAF and the MFC, to obtain the spectral density $\\hat{\\xi}(\\omega)$ directly via {Eq.~(\\ref{{eq:ComputingKernel}})}. \n\nThis equation, thus, constitutes the generalization of the Fourier method for anharmonic systems.\n\n\n\\subsection{Error Analysis}\n\\label{sec:Error_analys}\nPractical use of {Eq.~(\\ref{{eq:ComputingKernel}})} comes along with two numerical issues that have been already encountered in the Fourier method for linear GLEs~\\cite{Gottwald-JCP-2015}.\n\nFirst, the Fourier transforms of the MAF and MFC should be calculated very accurately.\n\nIn this respect an integration scheme according to the Simpson 3/8 rule has proven itself reliable. \n\nSecond, the numerical noise in the correlation functions involved should be suppressed for which purpose Gaussian filtering was suggested as the method of choice.\n\nPractically, the correlation functions are multiplied by a Gaussian window function $G(t)=\\exp(-t^2/2T)$, where the window width, $T$, might be set to the correlation time of the system\n\n as a rule of thumb. \n\nIn frequency domain this would lead to a convolution of the signals with a Gaussian of the width $\\Delta \\omega =1/T$ thereby averaging out the noise.\n\n\nIn what follows, we demonstrate that the resulting numerical errors are very sensitive to the strategy chosen for tackling them.\n\nIn principle, one could opt for a noise reduction scheme alternative to the Gaussian filtering presented above.\n\nAs the noise is usually caused by the non-converged tails of the correlation functions, one could fit the MAF and MFC to  damped sine or cosine functions, which suite the natural shape of a typical time correlation function.\n\nThis sounds generally appealing as, once the fit is established, no additional numerical errors are introduced and the spectral density can be expressed via {Eq.~(\\ref{{eq:ComputingKernel}})} analytically due to the known Fourier transforms of the fit functions, see {Eq.~(\\ref{{eq:fit function}})}.\n\nTo test the applicability of such an alternative fitting procedure we compare the corresponding memory kernels against the ones obtained from the Gaussian filtering technique in {Fig.~\\ref{{fig:error-spectra}}}.\n\nAs an example, a harmonic oscillator with unit mass and $\\bar{\\omega}=0.4$ in a bath described by a memory kernel $\\xi(t)=2a^2\\exp[-bt]\\cos(ct)$ with $a=0.03$, $b=0.03$ and $c=0.4$ has been used.\n\nThe MAF and MFC were calculated from GLE trajectories performed via the Colored Noise thermostat protocol~\\cite{Ceriotti2010}.\n\nNote that although the Fourier method developed here is generally designed for anharmonic systems, {Eq.~(\\ref{{eq:ComputingKernel}})} remains still valid for harmonic ones.\n\nChoosing a harmonic test system is advantageous because the Fourier-transformed MAFs and MFCs can be computed analytically, see \\ref{app:HO_tcfs},\n\nwhich allows one to calculate numerical errors exactly.\n\nIn the fitting procedure the MAF and MFC are fitted to superpositions of\n\n", "itemtype": "equation", "pos": 18544, "prevtext": "\n\nNote that the term $C_{pp}(t=0)$ stems from the half-sided transform and would vanish if a full-sided Fourier transform were taken.\n\nThis algebraic equation can be directly solved for the spectral density,\n\n\n", "index": 23, "text": "\\begin{equation}\n\\label{eq:ComputingKernel}\n\\hat{\\xi}(\\omega) = \\frac{1+\\hat{C}_{pF}(\\omega)}{\\hat{C}_{pp}(\\omega)} -i\\omega\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\xi}(\\omega)=\\frac{1+\\hat{C}_{pF}(\\omega)}{\\hat{C}_{pp}(\\omega)}-i\\omega\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mn>1</mn><mo>+</mo><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nSurprisingly, the fitting procedure turns out to produce very bad spectral densities,\n\npanel a)\n\nin {Fig.~\\ref{{fig:error-spectra}}}, although the noise reduction in the MAF and MFC is equally successful, see panels b) and f) therein,\n\nand the relative fit errors, panels c) and g), are similarly small as those in the Gaussian filtering scheme.\n\nIn contrast, the spectral densities provided by the Gaussian filtering scheme turn out to be very accurate, see panel e).\n\nThe reason for these discrepancies becomes evident upon performing a comprehensive error analysis presented in the remainder of this section.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\textwidth]{./error-spectra}\n\\caption{\n\\label{fig:error-spectra}\n\nNumerical results of the fitting procedure (left column) and the Gaussian filtering scheme (right column).\n\nPanels\n\na,e): Real parts of $\\hat{\\xi}(\\omega)$ with black denoting the true spectral density and red the numerical one,\n\nb, f): real parts of numerical $\\hat{C}_{pp}(\\omega)$ (red) and $\\hat{C}_{pF}(\\omega)$ (green) together with exact curves (black), \n\nc, g):\nrelative errors $r_{pp}$ (red) and $r_{pF}$ (green),\n\nd, h):\nPhase difference $\\Delta \\phi = \\phi_{pF}-\\phi_{pp}$. \n}\n\\end{figure}\n\n\nHere we only sketch the derivation for the error of the spectral density, whereas it is detailed in \\ref{app:error}.\n\nThe error analysis starts with partitioning exact MAF and MFC in {Eq.~(\\ref{{eq:ComputingKernel}})} into\n\n\n", "itemtype": "equation", "pos": 22723, "prevtext": "\n\nwhere it has been assumed that both, the MAF and the MFC, are normalized to $C_{pp}(t=0)$.\n\nCalculating the spectral density for the MBO model according to {Eq.~(\\ref{{eq:ComputingKernel}})} is straightforward as all the required ingredients, the MAF and the MFC, are available from MD simulations directly.\n\nIn contrast, for the CL model one has to compute an MFC with a renormalized system force, where the renormalization is not known a priori.\n\nNonetheless, since the spectral density is exactly the same in both models, one can always compute it for the MBO model and use it within both models.\n\nThe renormalization term can be then computed from the obtained spectral density according to {Eq.~(\\ref{{eq: corrected potential}})}.\n\nNote that the Fourier method for linear GLEs \n\nrequires just \nthe MAF from which the true kernel, $\\xi(t)$, and the effective system frequency can be fitted, see Eqs.~(3.2) -- (3.4) in Ref.~\\cite{Gottwald-JCP-2015}.\n\nIt becomes apparent at this point that for anharmonic systems this procedure cannot be exploited anymore and one has to use both, the MAF and the MFC, to obtain the spectral density $\\hat{\\xi}(\\omega)$ directly via {Eq.~(\\ref{{eq:ComputingKernel}})}. \n\nThis equation, thus, constitutes the generalization of the Fourier method for anharmonic systems.\n\n\n\\subsection{Error Analysis}\n\\label{sec:Error_analys}\nPractical use of {Eq.~(\\ref{{eq:ComputingKernel}})} comes along with two numerical issues that have been already encountered in the Fourier method for linear GLEs~\\cite{Gottwald-JCP-2015}.\n\nFirst, the Fourier transforms of the MAF and MFC should be calculated very accurately.\n\nIn this respect an integration scheme according to the Simpson 3/8 rule has proven itself reliable. \n\nSecond, the numerical noise in the correlation functions involved should be suppressed for which purpose Gaussian filtering was suggested as the method of choice.\n\nPractically, the correlation functions are multiplied by a Gaussian window function $G(t)=\\exp(-t^2/2T)$, where the window width, $T$, might be set to the correlation time of the system\n\n as a rule of thumb. \n\nIn frequency domain this would lead to a convolution of the signals with a Gaussian of the width $\\Delta \\omega =1/T$ thereby averaging out the noise.\n\n\nIn what follows, we demonstrate that the resulting numerical errors are very sensitive to the strategy chosen for tackling them.\n\nIn principle, one could opt for a noise reduction scheme alternative to the Gaussian filtering presented above.\n\nAs the noise is usually caused by the non-converged tails of the correlation functions, one could fit the MAF and MFC to  damped sine or cosine functions, which suite the natural shape of a typical time correlation function.\n\nThis sounds generally appealing as, once the fit is established, no additional numerical errors are introduced and the spectral density can be expressed via {Eq.~(\\ref{{eq:ComputingKernel}})} analytically due to the known Fourier transforms of the fit functions, see {Eq.~(\\ref{{eq:fit function}})}.\n\nTo test the applicability of such an alternative fitting procedure we compare the corresponding memory kernels against the ones obtained from the Gaussian filtering technique in {Fig.~\\ref{{fig:error-spectra}}}.\n\nAs an example, a harmonic oscillator with unit mass and $\\bar{\\omega}=0.4$ in a bath described by a memory kernel $\\xi(t)=2a^2\\exp[-bt]\\cos(ct)$ with $a=0.03$, $b=0.03$ and $c=0.4$ has been used.\n\nThe MAF and MFC were calculated from GLE trajectories performed via the Colored Noise thermostat protocol~\\cite{Ceriotti2010}.\n\nNote that although the Fourier method developed here is generally designed for anharmonic systems, {Eq.~(\\ref{{eq:ComputingKernel}})} remains still valid for harmonic ones.\n\nChoosing a harmonic test system is advantageous because the Fourier-transformed MAFs and MFCs can be computed analytically, see \\ref{app:HO_tcfs},\n\nwhich allows one to calculate numerical errors exactly.\n\nIn the fitting procedure the MAF and MFC are fitted to superpositions of\n\n", "index": 25, "text": "\\begin{equation}\n\\label{eq:fit_f_t}\nf(t)=a_1 \\exp[-b_1t]\\cos(c_1t) + a_2 \\exp[-b_2t] \\sin(c_2t)\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"f(t)=a_{1}\\exp[-b_{1}t]\\cos(c_{1}t)+a_{2}\\exp[-b_{2}t]\\sin(c_{2}t)\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>a</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><msub><mi>b</mi><mn>1</mn></msub><mo>⁢</mo><mi>t</mi></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>c</mi><mn>1</mn></msub><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><msub><mi>a</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><msub><mi>b</mi><mn>2</mn></msub><mo>⁢</mo><mi>t</mi></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>c</mi><mn>2</mn></msub><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere $\\hat{C}_{pp/pF}^{\\mathrm{(num)}}(\\omega)$ denotes the numerically obtained function and $\\epsilon_{pp/pF}(\\omega)$ stands for its numerical error that is for the deviation from the exact one.\n\nThen a first-order Taylor expansion with respect to $\\epsilon_{pp/pF}(\\omega)$ in {Eq.~(\\ref{{eq:ComputingKernel}})} is performed\n\nand the relative errors, {Eq.~(\\ref{{eq:rel_err}})}, represented in Euler form, \n$r_{pp/pF}(\\omega) \\e^{i\\phi_{pp/pF}(\\omega)} \\equiv \\epsilon_{pp/pF}(\\omega) / \\hat{C}^{\\mathrm{(num)}}_{pp/pF}(\\omega)$ are introduced.\n\nAfter performing some algebra, the error of the memory kernel can be written down as\n\n\n", "itemtype": "equation", "pos": 24297, "prevtext": "\n\nSurprisingly, the fitting procedure turns out to produce very bad spectral densities,\n\npanel a)\n\nin {Fig.~\\ref{{fig:error-spectra}}}, although the noise reduction in the MAF and MFC is equally successful, see panels b) and f) therein,\n\nand the relative fit errors, panels c) and g), are similarly small as those in the Gaussian filtering scheme.\n\nIn contrast, the spectral densities provided by the Gaussian filtering scheme turn out to be very accurate, see panel e).\n\nThe reason for these discrepancies becomes evident upon performing a comprehensive error analysis presented in the remainder of this section.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\textwidth]{./error-spectra}\n\\caption{\n\\label{fig:error-spectra}\n\nNumerical results of the fitting procedure (left column) and the Gaussian filtering scheme (right column).\n\nPanels\n\na,e): Real parts of $\\hat{\\xi}(\\omega)$ with black denoting the true spectral density and red the numerical one,\n\nb, f): real parts of numerical $\\hat{C}_{pp}(\\omega)$ (red) and $\\hat{C}_{pF}(\\omega)$ (green) together with exact curves (black), \n\nc, g):\nrelative errors $r_{pp}$ (red) and $r_{pF}$ (green),\n\nd, h):\nPhase difference $\\Delta \\phi = \\phi_{pF}-\\phi_{pp}$. \n}\n\\end{figure}\n\n\nHere we only sketch the derivation for the error of the spectral density, whereas it is detailed in \\ref{app:error}.\n\nThe error analysis starts with partitioning exact MAF and MFC in {Eq.~(\\ref{{eq:ComputingKernel}})} into\n\n\n", "index": 27, "text": "\\begin{equation}\n\\hat{C}_{pp/pF}^\\mathrm{(exact)}(\\omega)=\\hat{C}_{pp/pF}^{\\mathrm{(num)}}(\\omega) + \\epsilon_{pp/pF}(\\omega)\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\hat{C}_{pp/pF}^{\\mathrm{(exact)}}(\\omega)=\\hat{C}_{pp/pF}^{\\mathrm{(num)}}(%&#10;\\omega)+\\epsilon_{pp/pF}(\\omega)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>exact</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>ϵ</mi><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere $\\Delta \\phi(\\omega) = \\phi_{pp}(\\omega)-\\phi_{pF}(\\omega)$ is the phase difference of the relative errors.\n\n\nEquation (\\ref{eq:KernelError}) shows that the error in the spectral density\n\ncan cancel or accumulate depending on the phase difference $\\Delta \\phi (\\omega)$.\n\nLet us assume that the error magnitudes, $r_{pp}(\\omega)$ and $r_{pF}(\\omega)$ are similar.\n\nThen the error cancellation is supported if the phase difference comes close to a multiple of $2\\pi$ whereas the error accumulates if the phase difference is close to an odd multiple of $\\pi$.\n\nOne can see from {Fig.~\\ref{{fig:error-spectra}}} that the error magnitudes for Gaussian filtering are almost identical (panel g), whereas the phase differences are strictly $0$ or $-2\\pi$ (panel h) thereby leading to an almost perfect error cancellation.\n\nIn contrast, the phases provided by the fit procedure, panel d), \noften lie close to $\\pm\\pi$\n\nthereby leading to strong error accumulation.\n\nSince this is not the case everywhere in the resonant region, one can conclude that there is no indication of a systematic error cancellation, in fact, the error rather accumulates.\n\nIt is worth noting that since the Fourier method for \\textit{linear} GLEs operates exclusively with the MAF, there is no error accumulation from the outset.\n\nHence, the fit procedure would be equally applicable for this particular case.\n\nAll in all, it turns out that controlling the phases is important for a frequency domain procedure to yield accurate spectral densities. \n\nThe Gaussian filtering technique constitutes the method of choice as it seems to offer a phase control that supports error cancellation.\n\nAlthough it is not possible to perform such an analysis for an arbitrary system due to the absence of exact solutions, the general success of this Gaussian filtering technique for other systems is manifested below, see {Sec.~\\ref{{sec:applications}}}, as well as in our  recent publication, where this method has been applied to solute dynamics in liquid solvent environments~\\cite{Gottwald-JPCL-2015}.\n\nThe developed method can be summed up by the following steps\n\n\\begin{enumerate}\n\\item{Calculate the MAF and MFC (using the bare system force $F(x)=-\\partial_x {V_{\\mathrm{S}}}(x)$) from explicit MD simulations with sufficient convergence (system-dependent)}\n\\item{Transform the MAF and MFC into frequency domain using a sufficiently accurate integrator, e.g.\\ Simpson 3/8 rule, and performing Gaussian filtering, see {Sec.~\\ref{{sec:Error_analys}}}.\n\n\nFor the Gaussian window width take the correlation time (estimated from the MAF) as a starting guess}\n\\item{Calculate the spectral density $\\hat{\\xi}(\\omega)$ according to {Eq.~(\\ref{{eq:ComputingKernel}})}}\n\\item{If the CL model is employed, the renormalization term is accessible from the real part of $\\hat{\\xi}(\\omega)$ according to {Eq.~(\\ref{{eq:renormalized Potential}})}}\n\\end{enumerate}\n\n\n\\section{Simulation Details}\n\\label{sec:comp_det}\n\nThe proposed Fourier method has been applied to the (anharmonic) vibrational dynamics of an I$_2$ molecule in an atomic argon environment. \n\nThe I$-$I interaction is described by a Morse potential whereas the Ar$-$I and Ar$-$Ar interactions are given by Lennard-Jones potentials.\n\nThe corresponding parameters, developed for the electronic ground state, have been adopted from Ref.~\\cite{Potter1992}.\n\nThe system has been investigated at a temperature of $300\\,$K in two highly compressed states corresponding to a liquid and solid regime at densities 1592.7 and $2888.6\\,$kg$\\cdot$m$^{-3}$.\n\nThese rather unusual conditions have been chosen for two basic reasons.\n\nOn one hand, the investigated vibrational dynamics should be sufficiently anharmonic in order to demonstrate the success of our parametrization method constructed for anharmonic dynamics.\n\nFor I$_2$ this implies a sufficiently high temperature, here set to $300\\,$K.\n\nOn the other hand, we expect the CL model to be a successful description if the real environment is sufficiently harmonic,\nwhich is likely the case in the solid regime.\n\nAt a temperature of $300\\,$K this amounts to a very high compression.\n\nNote that the \n\nreliability of the parameters in Ref.~\\cite{Potter1992}, that have been optimized for ambient conditions, might be  questionable at such a high compression. \n\nNonetheless, the aim of this paper is to demonstrate the success of the proposed method rather than\nto investigate the physical properties of a real system at extreme conditions.\n\nThus,  for the present purpose,  we have employed these parameters without questioning their applicability.\n\nThe investigated system has been comprised of a single I$_2$ molecule and 862 Ar atoms in a cubic periodic box of $3.3\\,$nm length for the liquid phase and of $2.706\\,$nm length for the solid phase.\n\nAs an initial configuration, an fcc-lattice of Ar atoms has been prepared.\n\nTwo Ar atoms have been replaced by the I$_2$ molecule with the\nequilibrium bond length thereby producing a lattice defect.\n\nA $100\\,$ps equilibration run with the \ntime step of $1\\,$fs has been performed to prepare the entire system at a temperature of $300\\,$K. \n\nAll explicit MD simulations have been executed\nwith the GROMACS program package (Version~5.0.1 (double precision))~\\cite{GROMACS}.\n\nFor calculating vibrational spectra, a set of\n$NVE$ trajectories, each $6\\,$ps long (time step $1\\,$fs), has been started from\nuncorrelated initial conditions sampled from an $NVT$ ensemble. \n\nFor controlling the temperature in the equilibration and $NVT$ runs we have used a Langevin thermostat.\n\nMAFs and MFCs\nconjugate to the I$-$I bond length have been Fourier-transformed to yield the spectra\naccording to the procedure described in {Sec.~\\ref{{sec:Fourier}}}. \n\nIn order to achieve convergence, 1000 trajectories have been employed.\n\nNote that although the I$_2$ molecule is IR-inactive the spectra calculated this way can still be interpreted as Raman spectra, if the polarizability is approximated as being proportional to the bond length.\n\n\nFor GLE simulations we have adopted the method of Colored Noise thermostats~\\cite{Ceriotti2009a,Ceriotti2010,Morrone2011}.\n\nSince this method can only deal with memory kernels given as a superposition of functions\n\n\n", "itemtype": "equation", "pos": 25087, "prevtext": "\n\nwhere $\\hat{C}_{pp/pF}^{\\mathrm{(num)}}(\\omega)$ denotes the numerically obtained function and $\\epsilon_{pp/pF}(\\omega)$ stands for its numerical error that is for the deviation from the exact one.\n\nThen a first-order Taylor expansion with respect to $\\epsilon_{pp/pF}(\\omega)$ in {Eq.~(\\ref{{eq:ComputingKernel}})} is performed\n\nand the relative errors, {Eq.~(\\ref{{eq:rel_err}})}, represented in Euler form, \n$r_{pp/pF}(\\omega) \\e^{i\\phi_{pp/pF}(\\omega)} \\equiv \\epsilon_{pp/pF}(\\omega) / \\hat{C}^{\\mathrm{(num)}}_{pp/pF}(\\omega)$ are introduced.\n\nAfter performing some algebra, the error of the memory kernel can be written down as\n\n\n", "index": 29, "text": "\\begin{equation}\n\\label{eq:KernelError}\n\\epsilon_{\\xi}(\\omega)  \\equiv  \\left | \\hat \\xi ^{\\mathrm{(exact)}} (\\omega)-\\hat \\xi^{\\mathrm{(num)}}(\\omega) \\right| \n =  \\left | \\frac{\\hat{C}^{\\mathrm{(num)}}_{pF}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} \\right |\n    \\left | r_{pF}(\\omega) - r_{pp}(\\omega)\\e^{i\\Delta \\phi(\\omega)} \\right |\n\\enspace,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\epsilon_{\\xi}(\\omega)\\equiv\\left|\\hat{\\xi}^{\\mathrm{(exact)}}(\\omega)-\\hat{%&#10;\\xi}^{\\mathrm{(num)}}(\\omega)\\right|=\\left|\\frac{\\hat{C}^{\\mathrm{(num)}}_{pF}%&#10;(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)}\\right|\\left|r_{pF}(\\omega)-r_%&#10;{pp}(\\omega)\\e^{i\\Delta\\phi(\\omega)}\\right|\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><msub><mi>ϵ</mi><mi>ξ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mo>|</mo><mrow><mrow><msup><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>exact</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msup><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>|</mo></mrow><mo>=</mo><mrow><mrow><mo>|</mo><mfrac><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>|</mo></mrow><mo>⁢</mo><mrow><mo>|</mo><mrow><mrow><msub><mi>r</mi><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>r</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\e</mtext></merror><mrow><mi>i</mi><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msup></mrow></mrow><mo>|</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nthe spectral densities have been fitted to superpositions of \n\n\n", "itemtype": "equation", "pos": 31701, "prevtext": "\n\nwhere $\\Delta \\phi(\\omega) = \\phi_{pp}(\\omega)-\\phi_{pF}(\\omega)$ is the phase difference of the relative errors.\n\n\nEquation (\\ref{eq:KernelError}) shows that the error in the spectral density\n\ncan cancel or accumulate depending on the phase difference $\\Delta \\phi (\\omega)$.\n\nLet us assume that the error magnitudes, $r_{pp}(\\omega)$ and $r_{pF}(\\omega)$ are similar.\n\nThen the error cancellation is supported if the phase difference comes close to a multiple of $2\\pi$ whereas the error accumulates if the phase difference is close to an odd multiple of $\\pi$.\n\nOne can see from {Fig.~\\ref{{fig:error-spectra}}} that the error magnitudes for Gaussian filtering are almost identical (panel g), whereas the phase differences are strictly $0$ or $-2\\pi$ (panel h) thereby leading to an almost perfect error cancellation.\n\nIn contrast, the phases provided by the fit procedure, panel d), \noften lie close to $\\pm\\pi$\n\nthereby leading to strong error accumulation.\n\nSince this is not the case everywhere in the resonant region, one can conclude that there is no indication of a systematic error cancellation, in fact, the error rather accumulates.\n\nIt is worth noting that since the Fourier method for \\textit{linear} GLEs operates exclusively with the MAF, there is no error accumulation from the outset.\n\nHence, the fit procedure would be equally applicable for this particular case.\n\nAll in all, it turns out that controlling the phases is important for a frequency domain procedure to yield accurate spectral densities. \n\nThe Gaussian filtering technique constitutes the method of choice as it seems to offer a phase control that supports error cancellation.\n\nAlthough it is not possible to perform such an analysis for an arbitrary system due to the absence of exact solutions, the general success of this Gaussian filtering technique for other systems is manifested below, see {Sec.~\\ref{{sec:applications}}}, as well as in our  recent publication, where this method has been applied to solute dynamics in liquid solvent environments~\\cite{Gottwald-JPCL-2015}.\n\nThe developed method can be summed up by the following steps\n\n\\begin{enumerate}\n\\item{Calculate the MAF and MFC (using the bare system force $F(x)=-\\partial_x {V_{\\mathrm{S}}}(x)$) from explicit MD simulations with sufficient convergence (system-dependent)}\n\\item{Transform the MAF and MFC into frequency domain using a sufficiently accurate integrator, e.g.\\ Simpson 3/8 rule, and performing Gaussian filtering, see {Sec.~\\ref{{sec:Error_analys}}}.\n\n\nFor the Gaussian window width take the correlation time (estimated from the MAF) as a starting guess}\n\\item{Calculate the spectral density $\\hat{\\xi}(\\omega)$ according to {Eq.~(\\ref{{eq:ComputingKernel}})}}\n\\item{If the CL model is employed, the renormalization term is accessible from the real part of $\\hat{\\xi}(\\omega)$ according to {Eq.~(\\ref{{eq:renormalized Potential}})}}\n\\end{enumerate}\n\n\n\\section{Simulation Details}\n\\label{sec:comp_det}\n\nThe proposed Fourier method has been applied to the (anharmonic) vibrational dynamics of an I$_2$ molecule in an atomic argon environment. \n\nThe I$-$I interaction is described by a Morse potential whereas the Ar$-$I and Ar$-$Ar interactions are given by Lennard-Jones potentials.\n\nThe corresponding parameters, developed for the electronic ground state, have been adopted from Ref.~\\cite{Potter1992}.\n\nThe system has been investigated at a temperature of $300\\,$K in two highly compressed states corresponding to a liquid and solid regime at densities 1592.7 and $2888.6\\,$kg$\\cdot$m$^{-3}$.\n\nThese rather unusual conditions have been chosen for two basic reasons.\n\nOn one hand, the investigated vibrational dynamics should be sufficiently anharmonic in order to demonstrate the success of our parametrization method constructed for anharmonic dynamics.\n\nFor I$_2$ this implies a sufficiently high temperature, here set to $300\\,$K.\n\nOn the other hand, we expect the CL model to be a successful description if the real environment is sufficiently harmonic,\nwhich is likely the case in the solid regime.\n\nAt a temperature of $300\\,$K this amounts to a very high compression.\n\nNote that the \n\nreliability of the parameters in Ref.~\\cite{Potter1992}, that have been optimized for ambient conditions, might be  questionable at such a high compression. \n\nNonetheless, the aim of this paper is to demonstrate the success of the proposed method rather than\nto investigate the physical properties of a real system at extreme conditions.\n\nThus,  for the present purpose,  we have employed these parameters without questioning their applicability.\n\nThe investigated system has been comprised of a single I$_2$ molecule and 862 Ar atoms in a cubic periodic box of $3.3\\,$nm length for the liquid phase and of $2.706\\,$nm length for the solid phase.\n\nAs an initial configuration, an fcc-lattice of Ar atoms has been prepared.\n\nTwo Ar atoms have been replaced by the I$_2$ molecule with the\nequilibrium bond length thereby producing a lattice defect.\n\nA $100\\,$ps equilibration run with the \ntime step of $1\\,$fs has been performed to prepare the entire system at a temperature of $300\\,$K. \n\nAll explicit MD simulations have been executed\nwith the GROMACS program package (Version~5.0.1 (double precision))~\\cite{GROMACS}.\n\nFor calculating vibrational spectra, a set of\n$NVE$ trajectories, each $6\\,$ps long (time step $1\\,$fs), has been started from\nuncorrelated initial conditions sampled from an $NVT$ ensemble. \n\nFor controlling the temperature in the equilibration and $NVT$ runs we have used a Langevin thermostat.\n\nMAFs and MFCs\nconjugate to the I$-$I bond length have been Fourier-transformed to yield the spectra\naccording to the procedure described in {Sec.~\\ref{{sec:Fourier}}}. \n\nIn order to achieve convergence, 1000 trajectories have been employed.\n\nNote that although the I$_2$ molecule is IR-inactive the spectra calculated this way can still be interpreted as Raman spectra, if the polarizability is approximated as being proportional to the bond length.\n\n\nFor GLE simulations we have adopted the method of Colored Noise thermostats~\\cite{Ceriotti2009a,Ceriotti2010,Morrone2011}.\n\nSince this method can only deal with memory kernels given as a superposition of functions\n\n\n", "index": 31, "text": "\\begin{equation}\ng(t)\\equiv2a^2 e^{-bt}\\cos(ct) \\enspace,\n\\label{eq: colored noise kernel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"g(t)\\equiv 2a^{2}e^{-bt}\\cos(ct)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mn>2</mn><mo>⁢</mo><msup><mi>a</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>b</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>c</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\nbeing the half-sided Fourier transforms of that in {Eq.~(\\ref{{eq: colored noise kernel}})}. Usually, 10-20 fit functions are necessary to obtain a good fit.\n\nAll numerical parameters for the time step, length, number of trajectories,\netc.\\ have been the same as in the explicit MD simulations.\n\n\nOn top, we have performed the same checks of the model assumptions as in our previous publications~\\cite{Gottwald-JPCL-2015,Gottwald-JCP-2015}.\n\nThe assumptions to be checked are the linearity of the system-bath coupling on the system side, see {Eq.~(\\ref{{eq:CL Hamiltonian}})}, the Gaussian statistics of the noise, and the independence of the computed spectral density on the system potential ${V_{\\mathrm{S}}}(x)$.\n\nThe linearity of the coupling on the system side can be verified via explicit MD simulations in a straightforward manner.\n\nHere, we sampled $5000$\n\nuncorrelated configurations and varied the system coordinate, $x$,\n within the range accessible due to its thermal fluctuations\nkeeping all bath coordinates fixed.\n\nThe system-bath coupling $V_{\\mathrm{S-B}}(x)$ probed this way was least-squares fitted to linear functions $\\phi(x)=ax+b$, and quadratic functions $\\phi(x)=ax^2+bx+c$ for comparison.\n\nIn order to quantify the fit error $r$ with respect to a reasonable scale, we considered the relative deviation \n\n", "itemtype": "equation", "pos": 31871, "prevtext": "\n\nthe spectral densities have been fitted to superpositions of \n\n\n", "index": 33, "text": "\\begin{equation}\n\\label{eq:fit function}\n\\Re \\hat{g}(\\omega)=a^2b\\cdot \\left [ \\frac{1}{b^2 + (c-\\omega)^2} + \\frac{1}{b^2 + (c+\\omega)^2} \\right ]\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\Re\\hat{g}(\\omega)=a^{2}b\\cdot\\left[\\frac{1}{b^{2}+(c-\\omega)^{2}}+\\frac{1}{b^%&#10;{2}+(c+\\omega)^{2}}\\right]\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">ℜ</mi><mo>⁡</mo><mover accent=\"true\"><mi>g</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msup><mi>a</mi><mn>2</mn></msup><mo>⁢</mo><mi>b</mi></mrow><mo>⋅</mo><mrow><mo>[</mo><mrow><mfrac><mn>1</mn><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>c</mi><mo>-</mo><mi>ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>+</mo><mfrac><mn>1</mn><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>c</mi><mo>+</mo><mi>ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow><mo>]</mo></mrow></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwith $x_i^{}/x_f^{}$ being the initial/final values of the probed range, respectively.\n\nThe \n\nGaussianity\n\nof the noise, $R(t)$, can be checked by fixing the system's bond length, $x$, to the equilibrium distance of the potential and calculating the distribution function, $f(R)$, of the environmental forces acting on the bond.\n\nFor a homonuclear diatomic, the noise is calculated as\n\n", "itemtype": "equation", "pos": 33373, "prevtext": "\nbeing the half-sided Fourier transforms of that in {Eq.~(\\ref{{eq: colored noise kernel}})}. Usually, 10-20 fit functions are necessary to obtain a good fit.\n\nAll numerical parameters for the time step, length, number of trajectories,\netc.\\ have been the same as in the explicit MD simulations.\n\n\nOn top, we have performed the same checks of the model assumptions as in our previous publications~\\cite{Gottwald-JPCL-2015,Gottwald-JCP-2015}.\n\nThe assumptions to be checked are the linearity of the system-bath coupling on the system side, see {Eq.~(\\ref{{eq:CL Hamiltonian}})}, the Gaussian statistics of the noise, and the independence of the computed spectral density on the system potential ${V_{\\mathrm{S}}}(x)$.\n\nThe linearity of the coupling on the system side can be verified via explicit MD simulations in a straightforward manner.\n\nHere, we sampled $5000$\n\nuncorrelated configurations and varied the system coordinate, $x$,\n within the range accessible due to its thermal fluctuations\nkeeping all bath coordinates fixed.\n\nThe system-bath coupling $V_{\\mathrm{S-B}}(x)$ probed this way was least-squares fitted to linear functions $\\phi(x)=ax+b$, and quadratic functions $\\phi(x)=ax^2+bx+c$ for comparison.\n\nIn order to quantify the fit error $r$ with respect to a reasonable scale, we considered the relative deviation \n\n", "index": 35, "text": "\\begin{equation}\n\\label{eq:lin-fit-dev}\nr(x)=\\frac{\\phi(x)-V_{\\mathrm{S-B}}(x)}{ |V_{\\mathrm{S-B}}(x_i)-V_{\\mathrm{S-B}}(x_f)|}\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"r(x)=\\frac{\\phi(x)-V_{\\mathrm{S-B}}(x)}{|V_{\\mathrm{S-B}}(x_{i})-V_{\\mathrm{S-%&#10;B}}(x_{f})|}\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mi>r</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>V</mi><mrow><mi mathvariant=\"normal\">S</mi><mo>-</mo><mi mathvariant=\"normal\">B</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mrow><msub><mi>V</mi><mrow><mi mathvariant=\"normal\">S</mi><mo>-</mo><mi mathvariant=\"normal\">B</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>V</mi><mrow><mi mathvariant=\"normal\">S</mi><mo>-</mo><mi mathvariant=\"normal\">B</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>f</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">|</mo></mrow></mfrac><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\nwhere $\\vec{F}_{1/2}$ are the forces acting on the individual iodine atoms and $\\vec{n}$ is the bond vector.\n\nHere, 500 trajectories of 6ps length have been used to bin the noise. The I$-$I bond length has been fixed using the LINCS algorithm implemented in GROMACS.\n\nThe independence of the spectral density on the system potential is checked by substituting the Morse potential by its harmonic approximation and comparing the resulting spectral densities.\n\nFor the harmonic system dynamics the same numerical setup has been employed as for the anharmonic case.\n\n\n\\section{Results \\label{sec:applications}}\n\n\nAs it was discussed in the Introduction, it is desirable to find systems that are fairly similar to the CL model, \nsuch that they could be mapped onto it.\n\nOne such example is the A$_2$ in A model~\\cite{Berne1990,Gottwald-JCP-2015}, which can hardly be connected to a realistic setup.\n\nThe intrinsically harmonic structure of the MBO/CL model suggests that its realistic analogues can be found among solids or on surfaces.\n\nThus, we here employ an I$_2$ in atomic argon in the solid regime.\n\nThe liquid regime has been also studied for comparison.\n\nTo check the applicability of the mapping onto the CL/MBO models we have compared the vibrational spectra, i.e.\\ the Fourier transform of the MAFs, obtained from explicit MD simulations with the ones resulting from the GLE simulations.\n\nFor the latter, the spectral densities computed from the MD data according to the scheme proposed in {Sec.~\\ref{{sec:method}}} have been used.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\columnwidth]{./applications}\n\\caption{\n\\label{fig:results}\n\nSpectra (left column) and spectral densities (right column) for the liquid (upper row) and for the solid (lower row) I$_2$ in argon at 300K. The spectra are given in black (explicit MD result), yellow (MBO model) and green (CL model).\n}\n\\end{figure}\n\nTo reiterate, we are not aiming at reproducing the physical properties of an iodine molecule, but rather at reproducing the explicit MD results for a model system.\n\n\nIn {Fig.~\\ref{{fig:results}}} the spectra (left column) and the corresponding spectral densities (right column) of the investigated system are shown  for the liquid (upper row) and the solid (lower row) regimes.\n\nStarting the discussion with the liquid case, we obtain an unstructured, slightly asymmetric spectral line that is centered at $221\\,${cm$^{-1}$}\\ from the explicit MD simulations (black curve, panel a).\n\nThe full width at half maximum (FWHM) is  $5.6\\,${cm$^{-1}$}; thus, the line broadening is rather small.\n\nLooking at the spectral density (panel b) one observes a broad, \n\nDebye-type profile\n\nwith a maximum at zero-frequency.\n\nIn the frequency region that is resonant with the system frequency, the coupling is rather small which implies a large dephasing time and hence explains the small spectral width observed.\n\nThis qualitative behavior is reproduced via the corresponding GLE simulations for the CL (green curve) and the MBO (yellow curve) models.\n\nHowever, one observes that the explicit MD result is blue-shifted for about $10\\,${cm$^{-1}$}\\ compared to the CL result and $6\\,${cm$^{-1}$}\\ compared to the MBO result.\n\nWe assign these blue-shifts to the high pressure that is present in the explicit MD simulations. \n\nThis pressure compresses the I$-$I interaction potential thereby yielding a higher frequency compared to the unperturbed case.\n\nThis net compression is not accounted for in the CL/MBO models as the average of the noise term is zero by construction.\n\nHowever, it seems to have only minor influence on the spectra as these shifts can be rated as rather small.\n\nIn order to compare to other systems,\n\nthe  GLE spectra of the ionic liquid investigated in Ref.~\\cite{Gottwald-JPCL-2015} were red-shifted by about $10\\,${cm$^{-1}$}\\ (CL) and blue-shifted by $32\\,${cm$^{-1}$}\\ (MBO) from the explicit MD results.\n\nFor the aqueous systems studied therein, the CL/MBO model description failed most significantly and the shifts were $97\\,${cm$^{-1}$}\\ (CL) and $254\\,${cm$^{-1}$}\\ (MBO) to the blue.\n\n\nIn the solid regime, the MD spectrum is very broad and shows two characteristic peaks at 284 and $260\\,${cm$^{-1}$}\\ (black curve, panel c). \n\nThe corresponding spectral density (panel d) is covering a frequency range from $80 \\,${cm$^{-1}$}\\ to $300\\,${cm$^{-1}$}\\ and constitutes a peaked pattern that can be assigned to lattice vibrations of the Ar crystal.\n\nThe peak around $280\\,${cm$^{-1}$}\\ implies a strong resonant coupling of the I$-$I vibration to the phonon bath which causes the characteristic peak splitting in the spectrum.\n\nThese features are well-reproduced in the GLE simulations corresponding to the CL (green curve) and MBO (yellow curve) models.\n\nAs in the liquid regime, a blue-shift of the same order of magnitude of the explicit MD spectra is observed and can, again, be explained by the high pressure.\n\nInterestingly, the deviations between the MBO and CL models themselves are negligible in the case of a solid.\n\nOverall, the GLE simulations according to the CL and MBO models lead to satisfactory vibrational spectra. \n\nEspecially in the solid regime, where the spectrum shows a more complicated structure, the MBO/CL models cover the main effects with good accuracy.\n\nAlthough the MBO results are closer to the explicit MD results than the CL ones, especially in the liquid regime, we explicitly have to warn the reader about concluding that the MBO model is generally to be preferred to the CL model.\n\nThis conclusion would not be correct as there exist systems where the CL results are closer to the MD ones, see~\\cite{Gottwald-JPCL-2015}.\n\nIn general, the renormalization term in the CL model shifts the system frequency to the red, thereby making a description of systems,\nwhere a bath causes a blue shift with respect to gas phase, worse.\n\nThus, we doubt that a rule on whether to choose the MBO or CL model, i.e.\\ to keep or not to keep the frequency renormalization term in the GLE, can be given in general.\n\n\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\columnwidth]{./CL-check}\n\\caption{\n\\label{fig:CL-check}\nThe checks of the CL/MBO model assumptions for I$_2$ in Argon at $300\\,$K is shown for the liquid regime (upper row) and the solid regime (lower row).\n\nThe fit errors (left panels) are displayed in error bars for the linear (red) and quadratic (blue) fits.\n\nThe noise distribution functions (middle panels) from MD simulations (red curves) are compared against a fit to Gaussian functions (black dashed curves) $f(R)=A \\exp(-B\\cdot (R-C)^2)$. \n\nThe spectral densities (right panels) obtained from an anharmonic system potential (red curves) are plotted together with the ones obtained for a harmonic potential (black dashed curves). \n}\n\\end{figure}\n\n\nOne may ask, if it is possible to formulate criteria stating whether the system would or would not be mapped onto the\nCL/MBO model successfully. \n\n\n\nAlthough we think that performing the direct comparison of GLE and MD results on the basis of observables, like vibrational spectra, is the most straightforward way to check the applicability, it might still be desirable to have such \\textit{a priori} criteria which can be applied based exclusively on the MD data.\n\nThis is particularly convenient, when the machinery to perform GLE simulations is not available or when no further investigations on the basis of classical GLE dynamics are intended.\n\nPossible candidates for such criteria are the linearity of the system-bath coupling on the system side, the Gaussianity of the random force, $R(t)$, and the independence of the spectral density on the system potential~\\cite{Gottwald-JPCL-2015, Gottwald-JCP-2015}.\n\nOur previous analysis yielded that the aqueous systems considered in \\cite{Gottwald-JPCL-2015} exhibited almost linear coupling on the system side (the deviations were smaller that 2\\%), whereas for the ionic liquid considered therein it was completely non-linear (the deviations were up to $\\approx 40\\%$).\n\nThe Gaussianity of the noise revealed the opposite trend, that is the noise was not centered at zero and fairly asymmetric for aqueous systems, whereas it was almost Gaussian and zero-centered for the ionic liquid considered.\n\nSince the GLE spectrum for the ionic liquid was closer to the MD results compared to those of the aqueous systems, which were miserably wrong in shape and peak position,\n\nwe concluded that Gaussianity might be more important than the linearity of the coupling on the system side~\\cite{Gottwald-JPCL-2015}.\n\nThis trend was fully confirmed by considering the A$_2$ in A model system in Ref.~\\cite{Gottwald-JCP-2015}.\n\nAdditionally, the independence of the spectral density on the system potential turned out to be a reliable criterion for the applicability of the mapping onto the CL/MBO models. \n\nWhereas the spectral density for A$_2$ in A  was nearly potential-independent a significant dependence on the system potential has been observed for the aqueous systems~\\cite{Gottwald-JCP-2015}, which is an indication that these are not of the CL form correlating nicely to the bad quality of the corresponding GLE spectra.\n\nThe same analysis is presented in {Fig.~\\ref{{fig:CL-check}}} for the I$_2$ in argon investigated here.\n\nStarting the discussion with the linearity of the coupling on the system side (panels a) and d) therein), one notices rather large fit errors of about 25\\% in the liquid regime and about 10\\% in the solid regime.\n\nPerforming a quadratic fit shows an improvement in both cases, which underlines that the linearity assumption of the coupling does not hold for the investigated system.\n\nIn general, having a higher non-linearity in the liquid regime is expected as the motions are of larger amplitude than in the solid regime.\n\n\nOne might wonder, whether a quadratic dependence of the system-bath coupling on the bond length indicates that the MBO model is to be preferred to the CL model, as, in the MBO model, the quadratic counter-term is viewed as a part of the system-bath coupling, see {Eq.~(\\ref{{eq:MBO Hamiltonian}})}.\n\nThen, this quadratic term should coincide with the renormalization term, {Eq.~(\\ref{{eq:renormalized Potential}})}.\n\nHowever, the renormalization term could not be  responsible for this quadratic behaviour as it turned out to be orders of magnitude different.\n\nFurthermore, the renormalization term does not depend on the particular bath configuration, whereas the quadratic fit coefficient exhibits strong dependence on bath coordinates.\n\n\n\nThe assumption of a Gaussian distributed noise (panels b and e) is sufficiently verified for the solid regime.\n\nIn the liquid regime one observes a slightly asymmetric profile that still fits well a Gaussian shape.\n\n\nIn both cases the mean of the noise is not centered at zero but at negative values.\n\nThis can again be attributed to the high pressure which, on average, produces environmental forces that shrink the I$-$I bond.\n\n\nThis, however, results only in small shifts in the spectra, see {Fig.~\\ref{{fig:results}}}, \n\nimplying that the relation between the induced pressure and the spectral shifts is far from trivial.\n\nFinally, the spectral densities (panels c and f) obtained for the harmonic (black dashed curves) and for the anharmonic (red curves) potentials do not deviate remarkably in both the liquid and solid regimes.\n\nIt can be stated that the trends observed in our earlier publications are confirmed here as well. \n\nIn particular, the success of the MBO/CL model to mimic vibrational spectra does not seem to be sensitive to the linearity of the system-bath coupling on the system side. \n\nIn turn, the Gaussian shape of the noise distribution as well as the independence of the spectral density on the system potential seem to offer reliable criteria to predict the applicability of the mapping onto the MBO/CL models.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Conclusion \\label{sec:conclusion}}\n\n\n\nIn this paper, we have extended the Fourier-based scheme suggested in~\\cite{Gottwald-JCP-2015}\nto parameterizing a non-linear GLE according to the CL/MBO model with anharmonic system potentials from explicit MD simulations.\n\nThe accuracy of the resulting procedure turned out to be very sensitive to numerical errors of the input data.\n\nBased on the detailed error analysis we have found that a Gaussian filtering scheme is preferable for a numerical noise reduction as it could limit the error accumulation in an efficient way.\n\nFurther, we have shown that, despite the possible inapplicability of the models to the spectroscopy of arbitrary systems in solution due to the invertibility problem~\\cite{Gottwald-JPCL-2015},\nthe mapping of a real system onto the CL and/or the MBO model with \\textit{anharmonic} system potentials is possible for a potentially broad class of systems.\n\nImportantly, the successful example shown in this paper demonstrates that the invertibility problem can have exceptional cases where it does not surface and, hence, it does not disqualify using the CL/MBO model as such.\n\nThe models should be rather used with caution and a critical assessment of their applicability should be performed before trusting in the results.\n\nTo our understanding the ultimate way is to check the occurrence of the invertibility by comparing GLE and MD data. This would also clarify whether the renormalization term should be incorporated or not.\n\nHowever, the assessment of the applicability can also be based on \\textit{a priori} criteria that have been identified to be the Gaussianity of the noise distribution function and the independence of the spectral density on the system potential employed.\n\nThese empirical criteria may serve as a handy tool to judge on the applicability, employing exclusively the explicit MD simulation data.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\n\nWe would like to thank Sven Karsten for fruitful discussions.\n\nThe authors gratefully acknowledge financial support by the Deutsche\nForschungsgemeinschaft (Sfb~652 (O.K.) and IV~171/2-1 (S.D.I.)).\n\n\n\\appendix\n\\setcounter{section}{0} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Correlation functions for a harmonic oscillator}\n\\label{app:HO_tcfs}\n\nFor a harmonic oscillator with a frequency $\\omega_0$, the MAF, $C_{pp}(t)$, and the MFC, $C_{pF}(t)$, (with $F=-m\\omega_0^2x$) can be analytically expressed in terms of the spectral density $\\hat{\\xi}(\\omega)$. \n\nStarting from the Volterra-type integro-differential equation connecting the MAF and MFC, {Eq.~(\\ref{{eq:Volterraequation-CL}})},\nthat reads\n\n\n", "itemtype": "equation", "pos": 33913, "prevtext": "\n\nwith $x_i^{}/x_f^{}$ being the initial/final values of the probed range, respectively.\n\nThe \n\nGaussianity\n\nof the noise, $R(t)$, can be checked by fixing the system's bond length, $x$, to the equilibrium distance of the potential and calculating the distribution function, $f(R)$, of the environmental forces acting on the bond.\n\nFor a homonuclear diatomic, the noise is calculated as\n\n", "index": 37, "text": "\\begin{equation}\nR=\\frac{1}{2} \\vec{n} \\left [ \\vec{F}_1 -\\vec{F}_2 \\right ] \\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"R=\\frac{1}{2}\\vec{n}\\left[\\vec{F}_{1}-\\vec{F}_{2}\\right]\\@math@espace,\" display=\"block\"><mrow><mrow><mi>R</mi><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">→</mo></mover><mo>⁢</mo><mrow><mo>[</mo><mrow><msub><mover accent=\"true\"><mi>F</mi><mo stretchy=\"false\">→</mo></mover><mn>1</mn></msub><mo>-</mo><msub><mover accent=\"true\"><mi>F</mi><mo stretchy=\"false\">→</mo></mover><mn>2</mn></msub></mrow><mo>]</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nand applying the half-sided Fourier transform for both sides yields\n\n\n", "itemtype": "equation", "pos": 48670, "prevtext": "\nwhere $\\vec{F}_{1/2}$ are the forces acting on the individual iodine atoms and $\\vec{n}$ is the bond vector.\n\nHere, 500 trajectories of 6ps length have been used to bin the noise. The I$-$I bond length has been fixed using the LINCS algorithm implemented in GROMACS.\n\nThe independence of the spectral density on the system potential is checked by substituting the Morse potential by its harmonic approximation and comparing the resulting spectral densities.\n\nFor the harmonic system dynamics the same numerical setup has been employed as for the anharmonic case.\n\n\n\\section{Results \\label{sec:applications}}\n\n\nAs it was discussed in the Introduction, it is desirable to find systems that are fairly similar to the CL model, \nsuch that they could be mapped onto it.\n\nOne such example is the A$_2$ in A model~\\cite{Berne1990,Gottwald-JCP-2015}, which can hardly be connected to a realistic setup.\n\nThe intrinsically harmonic structure of the MBO/CL model suggests that its realistic analogues can be found among solids or on surfaces.\n\nThus, we here employ an I$_2$ in atomic argon in the solid regime.\n\nThe liquid regime has been also studied for comparison.\n\nTo check the applicability of the mapping onto the CL/MBO models we have compared the vibrational spectra, i.e.\\ the Fourier transform of the MAFs, obtained from explicit MD simulations with the ones resulting from the GLE simulations.\n\nFor the latter, the spectral densities computed from the MD data according to the scheme proposed in {Sec.~\\ref{{sec:method}}} have been used.\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\columnwidth]{./applications}\n\\caption{\n\\label{fig:results}\n\nSpectra (left column) and spectral densities (right column) for the liquid (upper row) and for the solid (lower row) I$_2$ in argon at 300K. The spectra are given in black (explicit MD result), yellow (MBO model) and green (CL model).\n}\n\\end{figure}\n\nTo reiterate, we are not aiming at reproducing the physical properties of an iodine molecule, but rather at reproducing the explicit MD results for a model system.\n\n\nIn {Fig.~\\ref{{fig:results}}} the spectra (left column) and the corresponding spectral densities (right column) of the investigated system are shown  for the liquid (upper row) and the solid (lower row) regimes.\n\nStarting the discussion with the liquid case, we obtain an unstructured, slightly asymmetric spectral line that is centered at $221\\,${cm$^{-1}$}\\ from the explicit MD simulations (black curve, panel a).\n\nThe full width at half maximum (FWHM) is  $5.6\\,${cm$^{-1}$}; thus, the line broadening is rather small.\n\nLooking at the spectral density (panel b) one observes a broad, \n\nDebye-type profile\n\nwith a maximum at zero-frequency.\n\nIn the frequency region that is resonant with the system frequency, the coupling is rather small which implies a large dephasing time and hence explains the small spectral width observed.\n\nThis qualitative behavior is reproduced via the corresponding GLE simulations for the CL (green curve) and the MBO (yellow curve) models.\n\nHowever, one observes that the explicit MD result is blue-shifted for about $10\\,${cm$^{-1}$}\\ compared to the CL result and $6\\,${cm$^{-1}$}\\ compared to the MBO result.\n\nWe assign these blue-shifts to the high pressure that is present in the explicit MD simulations. \n\nThis pressure compresses the I$-$I interaction potential thereby yielding a higher frequency compared to the unperturbed case.\n\nThis net compression is not accounted for in the CL/MBO models as the average of the noise term is zero by construction.\n\nHowever, it seems to have only minor influence on the spectra as these shifts can be rated as rather small.\n\nIn order to compare to other systems,\n\nthe  GLE spectra of the ionic liquid investigated in Ref.~\\cite{Gottwald-JPCL-2015} were red-shifted by about $10\\,${cm$^{-1}$}\\ (CL) and blue-shifted by $32\\,${cm$^{-1}$}\\ (MBO) from the explicit MD results.\n\nFor the aqueous systems studied therein, the CL/MBO model description failed most significantly and the shifts were $97\\,${cm$^{-1}$}\\ (CL) and $254\\,${cm$^{-1}$}\\ (MBO) to the blue.\n\n\nIn the solid regime, the MD spectrum is very broad and shows two characteristic peaks at 284 and $260\\,${cm$^{-1}$}\\ (black curve, panel c). \n\nThe corresponding spectral density (panel d) is covering a frequency range from $80 \\,${cm$^{-1}$}\\ to $300\\,${cm$^{-1}$}\\ and constitutes a peaked pattern that can be assigned to lattice vibrations of the Ar crystal.\n\nThe peak around $280\\,${cm$^{-1}$}\\ implies a strong resonant coupling of the I$-$I vibration to the phonon bath which causes the characteristic peak splitting in the spectrum.\n\nThese features are well-reproduced in the GLE simulations corresponding to the CL (green curve) and MBO (yellow curve) models.\n\nAs in the liquid regime, a blue-shift of the same order of magnitude of the explicit MD spectra is observed and can, again, be explained by the high pressure.\n\nInterestingly, the deviations between the MBO and CL models themselves are negligible in the case of a solid.\n\nOverall, the GLE simulations according to the CL and MBO models lead to satisfactory vibrational spectra. \n\nEspecially in the solid regime, where the spectrum shows a more complicated structure, the MBO/CL models cover the main effects with good accuracy.\n\nAlthough the MBO results are closer to the explicit MD results than the CL ones, especially in the liquid regime, we explicitly have to warn the reader about concluding that the MBO model is generally to be preferred to the CL model.\n\nThis conclusion would not be correct as there exist systems where the CL results are closer to the MD ones, see~\\cite{Gottwald-JPCL-2015}.\n\nIn general, the renormalization term in the CL model shifts the system frequency to the red, thereby making a description of systems,\nwhere a bath causes a blue shift with respect to gas phase, worse.\n\nThus, we doubt that a rule on whether to choose the MBO or CL model, i.e.\\ to keep or not to keep the frequency renormalization term in the GLE, can be given in general.\n\n\n\n\n\\begin{figure}[t]\n\\includegraphics[width=0.99\\columnwidth]{./CL-check}\n\\caption{\n\\label{fig:CL-check}\nThe checks of the CL/MBO model assumptions for I$_2$ in Argon at $300\\,$K is shown for the liquid regime (upper row) and the solid regime (lower row).\n\nThe fit errors (left panels) are displayed in error bars for the linear (red) and quadratic (blue) fits.\n\nThe noise distribution functions (middle panels) from MD simulations (red curves) are compared against a fit to Gaussian functions (black dashed curves) $f(R)=A \\exp(-B\\cdot (R-C)^2)$. \n\nThe spectral densities (right panels) obtained from an anharmonic system potential (red curves) are plotted together with the ones obtained for a harmonic potential (black dashed curves). \n}\n\\end{figure}\n\n\nOne may ask, if it is possible to formulate criteria stating whether the system would or would not be mapped onto the\nCL/MBO model successfully. \n\n\n\nAlthough we think that performing the direct comparison of GLE and MD results on the basis of observables, like vibrational spectra, is the most straightforward way to check the applicability, it might still be desirable to have such \\textit{a priori} criteria which can be applied based exclusively on the MD data.\n\nThis is particularly convenient, when the machinery to perform GLE simulations is not available or when no further investigations on the basis of classical GLE dynamics are intended.\n\nPossible candidates for such criteria are the linearity of the system-bath coupling on the system side, the Gaussianity of the random force, $R(t)$, and the independence of the spectral density on the system potential~\\cite{Gottwald-JPCL-2015, Gottwald-JCP-2015}.\n\nOur previous analysis yielded that the aqueous systems considered in \\cite{Gottwald-JPCL-2015} exhibited almost linear coupling on the system side (the deviations were smaller that 2\\%), whereas for the ionic liquid considered therein it was completely non-linear (the deviations were up to $\\approx 40\\%$).\n\nThe Gaussianity of the noise revealed the opposite trend, that is the noise was not centered at zero and fairly asymmetric for aqueous systems, whereas it was almost Gaussian and zero-centered for the ionic liquid considered.\n\nSince the GLE spectrum for the ionic liquid was closer to the MD results compared to those of the aqueous systems, which were miserably wrong in shape and peak position,\n\nwe concluded that Gaussianity might be more important than the linearity of the coupling on the system side~\\cite{Gottwald-JPCL-2015}.\n\nThis trend was fully confirmed by considering the A$_2$ in A model system in Ref.~\\cite{Gottwald-JCP-2015}.\n\nAdditionally, the independence of the spectral density on the system potential turned out to be a reliable criterion for the applicability of the mapping onto the CL/MBO models. \n\nWhereas the spectral density for A$_2$ in A  was nearly potential-independent a significant dependence on the system potential has been observed for the aqueous systems~\\cite{Gottwald-JCP-2015}, which is an indication that these are not of the CL form correlating nicely to the bad quality of the corresponding GLE spectra.\n\nThe same analysis is presented in {Fig.~\\ref{{fig:CL-check}}} for the I$_2$ in argon investigated here.\n\nStarting the discussion with the linearity of the coupling on the system side (panels a) and d) therein), one notices rather large fit errors of about 25\\% in the liquid regime and about 10\\% in the solid regime.\n\nPerforming a quadratic fit shows an improvement in both cases, which underlines that the linearity assumption of the coupling does not hold for the investigated system.\n\nIn general, having a higher non-linearity in the liquid regime is expected as the motions are of larger amplitude than in the solid regime.\n\n\nOne might wonder, whether a quadratic dependence of the system-bath coupling on the bond length indicates that the MBO model is to be preferred to the CL model, as, in the MBO model, the quadratic counter-term is viewed as a part of the system-bath coupling, see {Eq.~(\\ref{{eq:MBO Hamiltonian}})}.\n\nThen, this quadratic term should coincide with the renormalization term, {Eq.~(\\ref{{eq:renormalized Potential}})}.\n\nHowever, the renormalization term could not be  responsible for this quadratic behaviour as it turned out to be orders of magnitude different.\n\nFurthermore, the renormalization term does not depend on the particular bath configuration, whereas the quadratic fit coefficient exhibits strong dependence on bath coordinates.\n\n\n\nThe assumption of a Gaussian distributed noise (panels b and e) is sufficiently verified for the solid regime.\n\nIn the liquid regime one observes a slightly asymmetric profile that still fits well a Gaussian shape.\n\n\nIn both cases the mean of the noise is not centered at zero but at negative values.\n\nThis can again be attributed to the high pressure which, on average, produces environmental forces that shrink the I$-$I bond.\n\n\nThis, however, results only in small shifts in the spectra, see {Fig.~\\ref{{fig:results}}}, \n\nimplying that the relation between the induced pressure and the spectral shifts is far from trivial.\n\nFinally, the spectral densities (panels c and f) obtained for the harmonic (black dashed curves) and for the anharmonic (red curves) potentials do not deviate remarkably in both the liquid and solid regimes.\n\nIt can be stated that the trends observed in our earlier publications are confirmed here as well. \n\nIn particular, the success of the MBO/CL model to mimic vibrational spectra does not seem to be sensitive to the linearity of the system-bath coupling on the system side. \n\nIn turn, the Gaussian shape of the noise distribution as well as the independence of the spectral density on the system potential seem to offer reliable criteria to predict the applicability of the mapping onto the MBO/CL models.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Conclusion \\label{sec:conclusion}}\n\n\n\nIn this paper, we have extended the Fourier-based scheme suggested in~\\cite{Gottwald-JCP-2015}\nto parameterizing a non-linear GLE according to the CL/MBO model with anharmonic system potentials from explicit MD simulations.\n\nThe accuracy of the resulting procedure turned out to be very sensitive to numerical errors of the input data.\n\nBased on the detailed error analysis we have found that a Gaussian filtering scheme is preferable for a numerical noise reduction as it could limit the error accumulation in an efficient way.\n\nFurther, we have shown that, despite the possible inapplicability of the models to the spectroscopy of arbitrary systems in solution due to the invertibility problem~\\cite{Gottwald-JPCL-2015},\nthe mapping of a real system onto the CL and/or the MBO model with \\textit{anharmonic} system potentials is possible for a potentially broad class of systems.\n\nImportantly, the successful example shown in this paper demonstrates that the invertibility problem can have exceptional cases where it does not surface and, hence, it does not disqualify using the CL/MBO model as such.\n\nThe models should be rather used with caution and a critical assessment of their applicability should be performed before trusting in the results.\n\nTo our understanding the ultimate way is to check the occurrence of the invertibility by comparing GLE and MD data. This would also clarify whether the renormalization term should be incorporated or not.\n\nHowever, the assessment of the applicability can also be based on \\textit{a priori} criteria that have been identified to be the Gaussianity of the noise distribution function and the independence of the spectral density on the system potential employed.\n\nThese empirical criteria may serve as a handy tool to judge on the applicability, employing exclusively the explicit MD simulation data.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\n\nWe would like to thank Sven Karsten for fruitful discussions.\n\nThe authors gratefully acknowledge financial support by the Deutsche\nForschungsgemeinschaft (Sfb~652 (O.K.) and IV~171/2-1 (S.D.I.)).\n\n\n\\appendix\n\\setcounter{section}{0} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Correlation functions for a harmonic oscillator}\n\\label{app:HO_tcfs}\n\nFor a harmonic oscillator with a frequency $\\omega_0$, the MAF, $C_{pp}(t)$, and the MFC, $C_{pF}(t)$, (with $F=-m\\omega_0^2x$) can be analytically expressed in terms of the spectral density $\\hat{\\xi}(\\omega)$. \n\nStarting from the Volterra-type integro-differential equation connecting the MAF and MFC, {Eq.~(\\ref{{eq:Volterraequation-CL}})},\nthat reads\n\n\n", "index": 39, "text": "\\begin{equation}\n\\dot{C}_{pp}(t)=-m\\omega_0^2C_{xp}(t) - \\intop_0^{\\infty} \\xi(t-\\tau)C_{pp}(\\tau) {\\mathrm{d}} \\tau\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\dot{C}_{pp}(t)=-m\\omega_{0}^{2}C_{xp}(t)-\\intop_{0}^{\\infty}\\xi(t-\\tau)C_{pp}%&#10;(\\tau){\\mathrm{d}}\\tau\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo>˙</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mi>m</mi><mo>⁢</mo><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>C</mi><mrow><mi>x</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mi>ξ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>-</mo><mi>τ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>τ</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nUsing the relation\n\n\n", "itemtype": "equation", "pos": 48872, "prevtext": "\n\nand applying the half-sided Fourier transform for both sides yields\n\n\n", "index": 41, "text": "\\begin{equation}\ni\\omega \\hat{C}_{pp}(\\omega)-C_{pp}(t=0)=-m\\omega_0^2\\hat{C}_{px}(\\omega)-\\hat{\\xi}(\\omega)\\hat{C}_{pp}(\\omega) \\enspace.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"i\\omega\\hat{C}_{pp}(\\omega)-C_{pp}(t=0)=-m\\omega_{0}^{2}\\hat{C}_{px}(\\omega)-%&#10;\\hat{\\xi}(\\omega)\\hat{C}_{pp}(\\omega)\\@math@espace.\" display=\"block\"><mrow><mi>i</mi><mi>ω</mi><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>=</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mo>-</mo><mi>m</mi><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhich in Fourier space translates into\n\n\n", "itemtype": "equation", "pos": 49047, "prevtext": "\n\nUsing the relation\n\n\n", "index": 43, "text": "\\begin{equation}\n\\dot{C}_{px}(t)=\\frac{C_{pp}(t)}{m} \\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\dot{C}_{px}(t)=\\frac{C_{pp}(t)}{m}\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo>˙</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>m</mi></mfrac><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nresults in\n\n\n", "itemtype": "equation", "pos": 49167, "prevtext": "\n\nwhich in Fourier space translates into\n\n\n", "index": 45, "text": "\\begin{equation}\n\\label{eq:Cpx_Cpp}\ni\\omega\\hat{C}_{px}(\\omega)-C_{px}(t=0)=\\frac{\\hat{C}_{pp}(\\omega)}{m} \\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"i\\omega\\hat{C}_{px}(\\omega)-C_{px}(t=0)=\\frac{\\hat{C}_{pp}(\\omega)}{m}\\@math@espace,\" display=\"block\"><mrow><mi>i</mi><mi>ω</mi><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><msub><mi>C</mi><mrow><mi>p</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>=</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>m</mi></mfrac><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere it has been used that $C_{px}(0)=\\langle p x \\rangle =0$ for the canonical ensemble and it has been assumed that\nthe MAF is normalized to unity, that is $C_{pp}(t=0)=1$.\n\nFinally one obtains for the MAF\n\n\n", "itemtype": "equation", "pos": 49313, "prevtext": "\n\nresults in\n\n\n", "index": 47, "text": "\\begin{equation}\ni\\omega \\hat{C}_{pp}(\\omega)-1=i\\frac{\\omega_0^2}{\\omega}\\hat{C}_{pp}(\\omega)-\\hat{\\xi}(\\omega)\\hat{C}_{pp}(\\omega) \\enspace,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"i\\omega\\hat{C}_{pp}(\\omega)-1=i\\frac{\\omega_{0}^{2}}{\\omega}\\hat{C}_{pp}(%&#10;\\omega)-\\hat{\\xi}(\\omega)\\hat{C}_{pp}(\\omega)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo>=</mo><mrow><mrow><mi>i</mi><mo>⁢</mo><mfrac><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup><mi>ω</mi></mfrac><mo>⁢</mo><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nThe MFC can be obtained from the MAF with the help of {Eq.~(\\ref{{eq:Cpx_Cpp}})}, since\n$\\hat{C}_{pF}(\\omega)=-m\\omega_0^2\\hat{C}_{px}(\\omega)$.\n\nThe resulting expression for the MFC reads\n\n", "itemtype": "equation", "pos": 49682, "prevtext": "\n\nwhere it has been used that $C_{px}(0)=\\langle p x \\rangle =0$ for the canonical ensemble and it has been assumed that\nthe MAF is normalized to unity, that is $C_{pp}(t=0)=1$.\n\nFinally one obtains for the MAF\n\n\n", "index": 49, "text": "\\begin{equation}\n\\hat{C}_{pp}(\\omega)=\\frac{\\omega}{\\omega \\hat{\\xi}(\\omega) +i(\\omega^2-\\omega_0^2)}\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\hat{C}_{pp}(\\omega)=\\frac{\\omega}{\\omega\\hat{\\xi}(\\omega)+i(\\omega^{2}-\\omega%&#10;_{0}^{2})}\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mi>ω</mi><mrow><mrow><mi>ω</mi><mo>⁢</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ω</mi><mn>2</mn></msup><mo>-</mo><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\n\\section{Detailed derivation of numerical error formula}\n\\label{app:error}\n\nA numerically computed correlation function in the frequency domain can be related to the exact one as \n\n\n\n", "itemtype": "equation", "pos": 50000, "prevtext": "\n\nThe MFC can be obtained from the MAF with the help of {Eq.~(\\ref{{eq:Cpx_Cpp}})}, since\n$\\hat{C}_{pF}(\\omega)=-m\\omega_0^2\\hat{C}_{px}(\\omega)$.\n\nThe resulting expression for the MFC reads\n\n", "index": 51, "text": "\\begin{equation}\n\\hat{C}_{pF} (\\omega)=\\frac{i\\omega_0^2}{\\omega \\hat{\\xi}(\\omega) +i(\\omega^2-\\omega_0^2)}\n\\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\hat{C}_{pF}(\\omega)=\\frac{i\\omega_{0}^{2}}{\\omega\\hat{\\xi}(\\omega)+i(\\omega^{%&#10;2}-\\omega_{0}^{2})}\\@math@espace.\" display=\"block\"><mrow><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mi>i</mi><mo>⁢</mo><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mrow><mrow><mi>ω</mi><mo>⁢</mo><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ω</mi><mn>2</mn></msup><mo>-</mo><msubsup><mi>ω</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nwhere $\\hat{C}^{\\mathrm{(num)}}(\\omega)$ denotes the numerically obtained function and $\\hat{\\epsilon}(\\omega)$ the numerical error.\n\nWith the help of {Eq.~(\\ref{{eq:ComputingKernel}})}, the exact spectral density becomes\n\n\n", "itemtype": "equation", "pos": 50317, "prevtext": "\n\n\\section{Detailed derivation of numerical error formula}\n\\label{app:error}\n\nA numerically computed correlation function in the frequency domain can be related to the exact one as \n\n\n\n", "index": 53, "text": "\\begin{equation}\n\\hat{C}^{\\mathrm{(exact)}}(\\omega)=\\hat{C}^{\\mathrm{(num)}}(\\omega) + \\hat\\epsilon(\\omega)\n\\enspace ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\hat{C}^{\\mathrm{(exact)}}(\\omega)=\\hat{C}^{\\mathrm{(num)}}(\\omega)+\\hat{%&#10;\\epsilon}(\\omega)\\@math@espace,\" display=\"block\"><mrow><mrow><mrow><msup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>exact</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>ϵ</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\n\nDefining the relative errors as\n\n\n", "itemtype": "equation", "pos": 50675, "prevtext": "\n\nwhere $\\hat{C}^{\\mathrm{(num)}}(\\omega)$ denotes the numerically obtained function and $\\hat{\\epsilon}(\\omega)$ the numerical error.\n\nWith the help of {Eq.~(\\ref{{eq:ComputingKernel}})}, the exact spectral density becomes\n\n\n", "index": 55, "text": "\\begin{equation}\n\\hat{\\xi} ^{\\mathrm{(exact)}}= \\frac{1+\\hat{C}^{\\mathrm{(num)}}_{pF}+\\hat \\epsilon_{pF}}{\\hat{C}^{\\mathrm{(num)}}_{pp}+\\hat \\epsilon_{pp}} -i\\omega \\enspace .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\xi}^{\\mathrm{(exact)}}=\\frac{1+\\hat{C}^{\\mathrm{(num)}}_{pF}+\\hat{%&#10;\\epsilon}_{pF}}{\\hat{C}^{\\mathrm{(num)}}_{pp}+\\hat{\\epsilon}_{pp}}-i\\omega\\@math@espace.\" display=\"block\"><mrow><mrow><msup><mover accent=\"true\"><mi>ξ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>exact</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mfrac><mrow><mn>1</mn><mo>+</mo><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>+</mo><msub><mover accent=\"true\"><mi>ϵ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>F</mi></mrow></msub></mrow><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>+</mo><msub><mover accent=\"true\"><mi>ϵ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mrow></mfrac><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>ω</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\@math@espace</mtext></merror></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04470.tex", "nexttext": "\n\nand performing a first order Taylor expansion with respect to the errors yields\n\n\\begin{eqnarray}\n\\hat{\\xi}^{\\mathrm{(exact)}}(\\omega) & = &\n  \\frac{1+\\hat{C}^{\\mathrm{(num)}}_{pF}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} -i\\omega +\n  \\frac{\\hat{\\epsilon}_{pF}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} - \\frac{1+\\hat{C}^{\\mathrm{(num)}}_{pF}(\\omega)}{[\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)]^2} \\hat{\\epsilon}_{pp}(\\omega) \\nonumber \\\\ \n & = & \\hat{\\xi}^{\\mathrm{(num)}}(\\omega) + \\frac{\\hat{C}^{\\mathrm{(num)}}_{pF}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} (\\hat r_{pF}(\\omega) - \\hat r_{pp}(\\omega)) - \\frac{\\hat r_{pp}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} \n\\enspace .\n\\end{eqnarray}\n\nAssuming that the relative errors are small, one can take $\\frac{\\hat r_{pp}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp}(\\omega)} \\approx 0$ thereby neglecting the last term.\n\nFurther, writing the relative errors in Euler form $\\hat r_{pp/pF}=r_{pp/pF} \\e^{i\\phi_{pp/pF}}$, one arrives at \nthe error formula used in the main text, {Eq.~(\\ref{{eq:KernelError}})}.\n\n\\begin{eqnarray}\n\\hat \\epsilon_{\\xi} & \\equiv & \\left | \\hat \\xi ^{\\mathrm{(exact)}}-\\hat \\xi^{\\mathrm{(num)}} \\right| \\nonumber \\\\ \n& = & \\left | \\frac{\\hat{C}^{\\mathrm{(num)}}_{pF}}{\\hat{C}^{\\mathrm{(num)}}_{pp}} \\right | \\left | r_{pF} - r_{pp} \\e^{i\\Delta \\phi} \\right | \\enspace,\n\\end{eqnarray}\n\nwith the phase difference $\\Delta \\phi = \\phi_{pp}-\\phi_{pF}$.\n\n\n\\bibliographystyle{iopart-num}\n\\bibliography{./GLE}\n\n", "itemtype": "equation", "pos": 50901, "prevtext": "\n\n\nDefining the relative errors as\n\n\n", "index": 57, "text": "\\begin{equation}\n\\label{eq:rel_err}\n\\hat{r}_{pp/pF}(\\omega) \\equiv \\frac{\\hat{\\epsilon}_{pp/pF}(\\omega)}{\\hat{C}^{\\mathrm{(num)}}_{pp/pF}(\\omega)}\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"\\hat{r}_{pp/pF}(\\omega)\\equiv\\frac{\\hat{\\epsilon}_{pp/pF}(\\omega)}{\\hat{C}^{%&#10;\\mathrm{(num)}}_{pp/pF}(\\omega)}\\par&#10;\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>ϵ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msubsup><mover accent=\"true\"><mi>C</mi><mo stretchy=\"false\">^</mo></mover><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow><mo>/</mo><mi>p</mi></mrow><mo>⁢</mo><mi>F</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mi>num</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></math>", "type": "latex"}]