[{"file": "1601.00911.tex", "nexttext": "\n\nWe will assume a constant proton temperature and fix the optical depth at\n$\\tau=1.45$.  We also assume as before: $T_e/m_e > T_p/m_p$ which, for\nelectron temperatures of $\\sim 30$ keV gives $T_p \\lesssim 60$  MeV. The\napproximate proton temperature can be estimated from the release of\ngravitational potential energy ($G M /R =k T_p/m_p$). We get consistently $\nT_p\\approx 46 (R/10~R_S)^{-1} (M/10M_\\sun) {\\rm MeV} $\n \n\nFrom Equation \\ref{eq:eq}, using the expression for $t_{\\rm pe}$, we find\n$T_e\\propto L^{-2/5}$, which is in remarkable agreement with both the time\nresolved spectra (Figure \\ref{fig:tres}) and  considering all the bursts (see\nFigure \\ref{fig:int}). \n\nThis observed relation between the electron temperature and luminosity suggests that\nduring an outburst the electrons and protons are in thermal equilibrium and the\nelectrons are cooled by the Compton scattering of thermal photons from the\ndisk. V404 Cyg is yet another example among accreting black hole systems (both\nblack hole binaries and AGN) where the collisional heating of electrons by\nprotons is a dominant process.\n\n\n\n\n\\begin{figure}[!htbp]\n\\begin{center}\n\n\\includegraphics[width=4.0in,angle=0]{CompTT_TimeIntegrated.eps}\n\\caption{Luminosity and electron temperature for all the triggered intervals.\nGray points mark all the intervals, black points indicate bright ($L>0.15L_{\\rm\nEDD}$) and reliable fits ($\\chi^{2}_{\\mu}<2$).}\n\\label{fig:int}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}[!htbp]\n\\begin{center}\n\\includegraphics[width=4.0in,angle=0]{CompTT_TimeRESOLVEDbn150625400.eps}\\\\\n\\caption{Luminosity and electron temperature for an individual trigger.\nGray points mark all the intervals, black points indicate bright ($L>0.5L_{\\rm\nEDD}$) and reliable fits ($\\chi^{2}{_\\mu}<2$).}\\label{fig:tres}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\\begin{figure}[!htbp]\n\\begin{center}\n\\includegraphics[width=4.0in,angle=0]{CompTT_TimeRESOLVEDbn150626685.eps}\\\\\n\\caption{A further example of a time resolved fit.  The anti-correlation exists for the entire flare because it remained above $0.45L_{Edd}$.}\\label{fig:tres3}\n\\end{center}\n\\end{figure}\n\\begin{figure}[!htbp]\n\\begin{center}\n\\includegraphics[width=4.0in,angle=0]{CompTT_TimeRESOLVEDbn150626751.eps}\n\\caption{Luminosity and electron temperature for individual triggers.\nGray points mark all the intervals, black points indicate bright ($L>0.5L_{\\rm\nEDD}$) and reliable fits ($\\chi^{2}_{\\mu}<2$).}\\label{fig:tres4}\n\\end{center}\n\\end{figure}\n\nSimilarly to \\citet{Roques+15integral}, the seed photon temperature obtained\nfrom the CompTT model is unusually high.  The highest temperature from a\nthermally radiating  disk is $kT_{\\rm photon}\\lesssim 1$ keV, while we have an\napproximately constant $kT_{\\rm photon} = 5.9\\pm1.3$ keV.  This suggests the\nseed photons might not originate solely from the disk, but from another\nsource as well (e.g. synchroton photons from the jet \\citep{Markoff+05syn}).    \nA high seed photon temperature (7 keV) was also measured  using INTEGRAL data \\citep{Roques_2015}.\n\nWe note that for the time resolved spectra the onset of the correlation appears\nto start at higher luminosities ($0.35-0.5 L_{\\rm EDD}$, (see Figures\n\\ref{fig:tres}, \\ref{fig:tres3}, \\ref{fig:tres4}) while the time integrated correlation is valid for\n$L>0.15 L_{\\rm EDD}$. This can be explained by the longer integration times for\nthe data points ($\\sim$500s as apposed to 10s), resulting in more\naccurate spectral parameters for $L/L_{\\rm EDD}$ in the range of 0.15-0.35. For\nthe time resolved cases the error on the parameters increases for this range\nof luminosities, suppressing the correlation.\n\n\n\n\\subsection{Temporal Analysis}\n\nThe GBM power spectra of V404 Cyg show a strong similarity to those obtained with {\\it Ginga} during the source's 1989 outburst. They are also similar in shape and strength to those of black hole X-ry binaries, such as Cyg X-1 and GX 339--4, in their hard states \\citep{Nowak_2000}. The power spectra of these sources are  dominated by broad Lorentzians as well, in the frequency range that we analyzed for V404 Cyg (0.01--500 Hz). In Figure \\ref{fig:compare} we show a comparison between an averaged power spectrum from GX 339--4 in its hard state (from {\\it RXTE} data) and one from V404 Cyg (June 26.71, see middle panel in Figure \\ref{fig:pds}). The shapes of these power spectra are very similar, especially at the high-frequency end. We suspect that relatively stronger variability at the low-frequency end in V404 Cyg may be the result of the strong flaring activity of V404 Cyg seen on the corresponding time scales. Overall, the shape and strength of the power spectra supports the occultation hardness ratio analysis conclusion that V404 Cyg was observed in the hard state. \n\\begin{figure}[!h]\n\\centerline{\\includegraphics[width=3.0in]{compare.pdf}}\n\\caption{A comparison of an averaged {\\it RXTE} power spectrum from the hard state of GX 339--4 (black) with a GBM power spectrum of V404 Cyg from June 26.751 (red).}\\label{fig:compare}\n\\end{figure}\n\\section{Conclusion}\nThere is no evidence in the spectral analysis for an onset of a state change during the observed time interval.  Spectral analysis indicates that the collisional heating of electrons by protons is the dominant process resulting in the observed Comptonized spectrum.  The seed photon temperature exceeds what is expected from an accretion disk and may be due to synchrotron photons from the base of the jet or perhaps there is some other method of energizing the photons of the inner disk.  In all, this outburst is very similar to the one that occurred in 1989 but remains remarkable among black hole outburst for its intrinsic high luminosity and high photon seed temperature.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{astron}\n\n\n\\bibliography{v404_Cyg}\n\n\n\n\n\n\\IfFileExists{\\jobname.bbl}{}\n {\\typeout{}\n  \\typeout{******************************************}\n  \\typeout{** Please run \"bibtex \\jobname\" to optain}\n  \\typeout{** the bibliography and then re-run LaTeX}\n  \\typeout{** twice to fix the references!}\n  \\typeout{******************************************}\n  \\typeout{}\n }\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 26097, "prevtext": "\n\n\n\n\n\n\\title{\\emph{Fermi} GBM Observations of V404 Cyg During its 2015 Outburst}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\author{P. A. Jenke\\altaffilmark{1}, C. A. Wilson-Hodge\\altaffilmark{3}, Jeroen Homan\\altaffilmark{4,5}, P. Veres\\altaffilmark{1}, M. S. Briggs\\altaffilmark{1}, E. Burns\\altaffilmark{1}, V. Connaughton\\altaffilmark{2}, M. H. Finger\\altaffilmark{2}, M. Hui\\altaffilmark{3}}\n\n\\altaffiltext{1}{University of Alabama in Huntsville, Huntsville, AL 35805, USA}\n\n\\altaffiltext{2}{Universities Space Research Association, Huntsville, AL 35805, USA.}\n\n\\altaffiltext{3}{Marshall Space Flight Center, Huntsville, AL 35812, USA}\n\\altaffiltext{4}{MIT Kavli Institute for Astrophysics and Space Research, 77 Massachusetts Avenue 37-582D, Cambridge, MA 02139, USA}\n\\altaffiltext{5}{SRON, Netherlands Institute for Space Research, Sorbonnelaan 2, 3584 CA Utrecht, The Netherlands}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\nV404 Cygni was discovered in 1989 by the \\emph{Ginga} X-ray satellite during its only previously observed X-ray outburst and soon after confirmed as a black hole binary.  On June 15, 2015, the Gamma Ray Burst Monitor (GBM) triggered on a new outburst of V404 Cygni.  We present 13 days of GBM observations of this latest outburst including Earth occultation flux measurements, spectral and temporal analysis. The Earth occultation fluxes reached 30 Crab with detected emission to 100 keV and determined, via hardness ratios, that the source was in a hard state.  At high luminosity, spectral analysis between 8 and 300 keV showed that the electron temperature decreased with increasing luminosity.  This is expected if the protons and electrons are in thermal equilibrium during an outburst with the electrons cooled by the Compton scattering of softer seed photons from the disk.  However, the implied seed photon temperatures are unusually high, suggesting a contribution from another source, such as the jet.  No evidence of state transitions is seen during this time period.  Temporal analysis reveals the rich harmonic content of the outburst and confirmed that the source was in a hard state.   \n\\\\\n\\\\\n\n\\end{abstract}\n\n\n\n\n\n\n\\keywords{V404 Cyg,black holes,LMXB}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\nV404 Cygni, hereafter V404 Cyg, was first identified as an X-ray transient with the \\emph{Ginga} satellite during the 1989 flaring event \\citep{Makino_1989}.  Using archival optical data, V404 Cyg was associated with what was thought to be a nova in two previous outbursts in 1938 and 1956.   Optical observations after the 1989 flaring event revealed an orbital ephemeris with an orbital period of 6.5 days, an inclination of 67 degrees, and most importantly a mass function of $6.08\\pm0.16$ \\citep{CasaresandCharles_1994} making the source one of the first confirmed black hole systems with a black hole mass $\\sim$ 10 M$_{\\odot}$.  A radio parallax distance of $2.39\\pm0.14$  kpc \\citep{Miller-Jones_2009}  allows precise monitoring of the intrinsic luminosity and makes this one of the closest known black hole systems.  V404 Cyg's large separation from its companion along with optical H$\\alpha$ observations indicate that the system develops a very large accretion disk which contains an inordinate amount of material ensuring dramatic flares when the inner region of the accretion disk breaks down \\citep{Remillard06}.\n\nAt 18:31:38 UT on 2015, June 15, the \\emph{Swift} Burst Alert Telescope (BAT) triggered and located V404 Cyg \\citep{Barthelmy_2015}.  Twenty eight minutes later, the \\emph{Fermi} Gamma Ray Burst Monitor (GBM) triggered on an X-ray source with a subsequent ground localization consistent with V404 Cyg.  \n\n\\section{Gamma Ray Burst Monitor}\n\t GBM is an all sky monitor whose primary objective is to extend the energy range over which gamma-ray bursts are observed in the Large Area Telescope (LAT) on \\emph{Fermi} \\citep{Meegan_2009}.  GBM consists of 12 NaI detectors with a diameter of 12.7 cm and a thickness of 1.27 cm and two BGO detectors with a diameter and thickness of 12.7 cm.  The NaI detectors have an energy range from 8 keV to 1 MeV while the BGOs extend the energy range to 40 MeV.  GBM has three continuous data types: CTIME data with nominal 0.256-second time resolution and 8-channel spectral resolution used for event detection and localization, CSPEC data with nominal 4.096-second time resolution  and 128-channel spectral resolution which is used for spectral modeling, and Continuous Time Tagged Event (CTTE) data which has a timing precision of $2\\mu$s.  All three data types are utilized in the following analysis. \n\t \n\n\n\n\n\\section{Observations}\nGBM triggered on V404 Cyg 169 times between June 15-27.  The source reached a brightness of 30 Crab with emission to 300 keV.  With an 8 sr field of view, GBM was able to observe the entire outburst with a duty cycle of 57\\%.   GBM is not an imaging instrument but uses the differential response of its 12 NaI detectors to locate sources to a few degrees \\citep{Connaughton_2015}.  Even though localization is possible, GBM's high background rates can make analysis challenging.   To mitigate this limitation, three techniques are employed  to analyze this source: the Earth occultation technique, choosing times of high signal to noise such as GBM triggered events, and using GBM's 2$\\mu$s timing precision to extract temporal information from the data.  These techniques and their results are detailed below.\n\n\\subsection{Earth Occultation Observations}\nThe Earth Occultation software, described in detail in \\cite{WilsonHodge2012}, fits the GBM CTIME data with a quadratic background plus models of occultation steps for the source of interest and any other bright sources occulting during the 4-minute fit window. The occultation step models incorporate atmospheric transmission and an assumed source flux model for each source in the fit. Independent fits are performed for each detector and each energy channel. For V404 Cyg, the assumed flux model was based on INTEGRAL SPI measurements \\citep{Rodriguez15}. Steps during solar flares, and when the constant background term was more than 3$\\sigma$ away from its Gaussian mean from pre-outburst data 2008 August to 2015 June 16 were removed from the analysis. High values of the constant term correlate with periods of high KP index (high particle activity). Figure~\\ref{fig:occ_lc} shows the light curve based on single occultation steps for V404 Cyg in the 8-300 keV band (GBM CTIME channels 0-4). V404 Cyg flux measurements in each energy channel were normalized to the average flux for the Crab nebula and pulsar for the time period 2015 June 17-July 2.  Significant detections of a source within a single occultation step with GBM is unusual and is an indication of how bright V404 Cyg's flares were.\n\n\\begin{figure}[h!]\n\\begin{centering}\n\\includegraphics[width=0.99\\columnwidth]{V404_cyg_8-300keV_lc_cropped.pdf}\n\\caption{V404 Cyg light curve measured with Fermi GBM in the 8-300 keV band. Fluxes are normalized to GBM measurements of the Crab in the same band. Red circles indicate 3 $\\sigma$ or better detections in a single occupation step.}\n\\label{fig:occ_lc}\n\\end{centering}\n\\end{figure}\n\n \\citet{Remillard06} described ways of defining black hole states, including a method based on radio properties, X-ray power density spectra, and hardness intensity diagrams. Hardness ratios were defined as 8.6-18.0 keV counts/5.0-8.6 keV counts measured with the {\\it Rossi X-ray Timing Explorer (RXTE)} Proportional Counter Array, for which the Crab nebula yielded HR=0.68. \\citet{Remillard06} found that sources with HR$>$0.68, harder than the Crab Nebula, corresponded to the hard state in both \\citet{McClintock06} model and in the unified jet model \\citep{Fender04} and HR$<$0.2 corresponded to the steep power law state. Further discussion in \\citet{Remillard06}, and references therein, points out that in the hard state, an exponential cutoff near 100 keV is often found, while QPOs may or may not be present. \\citet{Remillard06} emphasize that luminosity is not a criterion for identifying X-ray states in either prescription. \n\nTo compare GBM measurements of V404 Cyg to these studies, hardness ratios were generated by dividing the single step flux measured in the 12-25 keV band by the flux in the 8-12 keV band, the lowest two bands available in GBM data and closest to the canonical {\\it RXTE} bands, shown in Figure~\\ref{fig:occ_hid}. The majority of the GBM hardness ratios (blue diamonds in Figure~\\ref{fig:occ_hid}) are harder than the Crab, suggesting that V404 Cyg spent the majority of its outburst in the hard state even though it was emitting at a large fraction of its Eddington luminosity. \n \n\\begin{figure}[h!]\n\\begin{centering}\n\\includegraphics[width=3.0in]{V404_CYG_hid_for_petes_talk_cropped.pdf}\n\\caption{V404 Cyg hardness ratio (12-25 keV flux/8-12 keV flux) vs total flux in the 12-300 keV range. The dashed vertical line indicates the Crab hardness ratio for these bands. It is at 1.0 because the fluxes are normalized to the Crab. Blue diamonds indicate where V404 Cyg is harder than the Crab and green diamonds indicate where V404 Cyg is softer than the Crab.}\n\\label{fig:occ_hid}\n\\end{centering}\n\\end{figure}\n\n\n\n\n\\subsection{Spectral Analysis}\n\nWe performed spectral analysis of the hard X-ray emission between 8 and 1000 keV in order to better understand the hot Comptonized corona surrounding the black hole.\n\\subsubsection{Data Selection}\nGBM CSPEC data for the 169 V404 Cyg triggers were used for spectral analysis.  Detectors with angles between the source and detector bore sight greater than 60 degrees were excluded.  Using RMFIT, a forward-folding spectral analysis software often used in GBM gamma ray burst studies\\footnote{http://fermi.gsfc.nasa.gov/ssc/data/analysis/rmfit/}, a polynomial background was fit to each detector in each energy channel between 8 and 1000 keV using times before and after the flare.  Times around the trigger times, when a flare was evident, were chosen and response matrices were created from a response model constructed from simulations incorporating the Fermi spacecraft mass model into GEANT4 \\citep{GEANT4}.  Data selection was limited to 100 seconds before the trigger and 400 seconds after the trigger in order to ensure that an adequate background model could be fit and that the spacecraft response would not significantly change during the times of data selection.  The background subtracted data was fit using RMFIT to the CompST model \\citep{Sunyaev_Titarchuk_1980} and the residuals in each detector were compared for consistency.  Consistent residuals across detectors are an indication that the background selection is reasonable.  Triggered events in which a good background model could not be constructed were rejected.  For the remaining 155 events in which an acceptable spectral fit was possible,  the background and the total spectrum were exported for analysis in XSPEC \\citep{xspec_1996}.\n\n\n\n\\subsubsection{Integrated Spectral Analysis Results}\nWe chose spectral models to model the hot comptonized corona surrounding the black hole.\n The CompTT model \\citep{Titarchuk_1994} and the power law with high energy cut-off (POWER* HIGHECUT in XSPEC) were successful in representing the data although the cut-off energy could not always be well constrained.  The results of the spectral fits to the CompTT and power law models are listed in Table \\ref{tbl:spec}.  The burst number column (bn) is the date and fraction of the day at trigger time, YYMMDDFFF where YY is the two digit year, MM is the month, DD is the day, and FFF is the fraction of the day.\n\nThe CompTT model seed photon temperature, $kT_{\\rm photon}$, is a free parameter and allows us to probe emission from the up-scattering of hot seed photons as apposed to the CompST model which assumes a cold distribution of seed photons.  The CompTT model fits resulted in an average seed photon temperature of 5.9$\\pm$1.3 keV.  This is inconsistent with photons from an accretion disk ($kT_{\\rm photon} < 1$ keV) and the cold photons assumed in the CompST model.  The average optical depth, $\\tau$, is 1.45 $\\pm$ 1.0 ($\\bar{\\sigma_{\\tau}} = 0.56$) (see Figure \\ref{fig:comptt}) which is consistent with what is expected from the optically thick corona around a typical black hole binary \\citep{Malzac_2012}.  In the subsequent analysis, the optical depth is fixed to 1.45 in order to better constrain the electron and seed photon temperatures.\n\nThe POWER* HIGHECUT is useful for tracing the spectral variability between triggered flares.   Figure \\ref{fig:power_law} shows the evolution of the power law index throughout the outburst.  In red are the weighted mean spectral indexes on half day time intervals.  Although there is significant spectral evolution throughout the outburst period, there is no evidence for systematic softening or hardening of the spectrum during this period.  The high energy cut-off, at times, was much lower (see Figure \\ref{fig:power_cut}) than the 100 keV often observed for stellar mass black hole systems in the hard state \\citep{Malzac_2012,Remillard06}.\n\n\n\\begin{figure}[h!]\n\\begin{centering}\n\\includegraphics[width=4.0in]{powerlaw_index_half_day_over.eps}\n\\caption{Evolution of the power law index for the high-E cutoff model throughout the outburst.  The horizontal axis is the days in June while the vertical axis is the power law index from the power law with a high energy cut-off model fit to the data.  In red are the weighted mean indexes on half day time intervals.}\n\\label{fig:power_law}\n\\end{centering}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\begin{centering}\n\\includegraphics[width=4.0in]{powerlaw_cutoff.eps}\n\\caption{Evolution of the power law cut-off energy for the high-E cutoff model throughout the outburst.  The horizontal axis is the days in June while the vertical axis is the power law index from the power law with a high energy cut-off model fit to the data.}\n\\label{fig:power_cut}\n\\end{centering}\n\\end{figure}\n\nInitially a comptonized model  by \\cite{Sunyaev_Titarchuk_1980} (CompST in XSPEC) was chosen to model the emission from hot coronal electrons up-scattering the cold accretion disk photons.  This model was chosen for its small number of parameters and its physical description of the emission region.  The model was often a poor description of the GBM data, especially during bright flares, and resulted in a large optical depth, tau (see Figure \\ref{fig:comptt}).   Two absorption models, PHABS and PCFABS in XSPEC, were used to improve the model fit.  Both absorption models predicted extremely high absorption ($(100 - 1000)$ $ \\times 10^{22} $ cm$^2$) that is unsupported by soft X-ray observations \\citep{Motta_2015}.  A reflection model (REFLECT in XSPEC) was also used to attempt to improve the CompST fit.  The inclination of the the accretion disc was fixed to 67 degrees \\citep{Khargharia_2010} and the redshift fixed to zero reflecting our proximity to the source.  The new model was again preferred over just the CompST model but resulted in an unphysical reflection component that accounted for more than 400\\% of the emission.  Other issues with the REFLECT*CompST model was, again, an excessively large optical depth that was often greater than 10.  At this point the CompST model was abandoned in favor of the CompTT model.   \n\n\n\n\n\n\\begin{figure}[h!]\n\\begin{centering}\n \n\\includegraphics[width=3.0in]{Spectral_fits.pdf}\n\\caption{Time integrated spectral model fitting to the triggered event bn150626171.  The figure on the top is the spectral fit using the CompST model with residuals below.  The red and black points are the normalized counts from two of the NaI detectors while the red and black curves are the best fit model.   The figure on the bottom is the spectral fit using the CompTT model with residuals below.  The best fit parameters are given in the figures.  The fit for the CompTT model is a significant improvement over the CompST model.}\n\\label{fig:comptt}\n\\end{centering}\n\\end{figure}\n\n\n\n\n\\subsubsection{Time Resolved Spectral Analysis Results}\nTime resolved spectral analysis was performed on a few bright triggered flares to examine spectral variation within a flare.\nTen second intervals were used for the time resolved analysis and an instrument response matrix was created for the center of each time interval.  Only the CompTT model was used to fit the time resolved data.  The trigger bn150625400 was chosen because it spanned a wide range of luminosities.  The triggers bn150626685 and bn150626751 were chosen for their high luminosity while bn150626156 was chosen for its moderate luminosity.  The optical depth was frozen at $\\tau=1.45$.  Figure \\ref{fig:k0}  shows how the electron and photon temperature evolve during the bright flare,  bn150625400.  \n\n\\begin{figure}[h!]\n\\begin{centering}\n\\includegraphics[width=3.0in]{bn150625400.pdf}\n\\caption{The top figure shows the evolution of the photon seed temperature during the GBM triggered flare, bn150625400, while the bottom figure shows the evolution of the electron temperature.  The horizontal axis is time in seconds with T0 =  456917626.6 MET. }\n\\label{fig:k0}\n\\end{centering}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\\subsection{Temporal Data Analysis}\n\n\n\\subsubsection{Data Selection}\nGBM CTTE NaI data between 8 and 100 keV were selected between 2015 June 15--27.  Times during SAA passage, times when V404 Cyg was occulted by the Earth  and times during high particle activity were excluded from the analysis.  The data selection resulted in good time intervals (GTIs) that were a few$\\times$1000 seconds long.  On a 100 second cadence, the selected CTTE data were combined for all the detectors which had a source to detector bore sight angle of less than 60 degrees, and binned to 1 ms, to produce 100 second long light curves.  The light curves were Fourier transformed producing power spectra with a frequency range of 0.01--500 Hz.  The power spectra for each GTI were averaged to reduce the variance resulting in 214 power spectra. \n\nAlthough source and background count rates were not available for all observations, the power spectra that were studied in detail (see below), were all rms normalized \\citep{Belloni_1990, Miyamoto_1991}. We note, however,  that the source and background rates used for the rms normalization are estimates based on the spectral analysis.\n\n\\subsubsection{Temporal Analysis Results}\n\nAll 214 power spectra were visually inspected. For the ones from low-count-rate observations no significant power is seen. However, the power spectra from observations during bright flares are of high quality and show significant power. In Figure \\ref{fig:pds} we show five normalized power spectra from the period of June 26--27, during which the source reached its peak brightness. They are representative of the power spectra during other flares. The power spectra are dominated by strong broad features, similar to  {\\it Ginga} power spectra of V404 Cyg during its 1989 outburst \\citep{Oosterbroek_1997}. No narrow QPO features were seen. The integrated fractional rms in the 0.01--100 Hz band ranged from $\\sim$35\\% to $\\sim$50\\%. \n\n Like the {\\it Ginga} power spectra, we find that the GBM power spectra of V404 Cyg can be fitted well with two or three broad Lorentzians, where we define the Lorentzians as ($P(\\nu)=(r^2\\Delta/\\pi)[\\Delta^2 +\n(\\nu-\\nu_0)^2]^{-1}$). Here $\\nu_0$ is the centroid\nfrequency, $\\Delta$ the half-width-at-half-maximum, and $r$ the\nintegrated fractional rms (from $-\\infty$ to $\\infty$). Instead of\n$\\nu_0$ and $\\Delta$ we will quote the frequency $\\nu_{max}$ at which\nthe Lorentzian attains its maximum in $\\nu P(\\nu)$ and the quality\nfactor, $Q$, where $\\nu_{max}=\\nu_0 (1 + 1/4Q^2)^{1/2}$ and\n$Q=\\nu_0/2\\Delta$. \n\nThe Lorentzian fits to the power spectra are shown in Figure \\ref{fig:pds}. As can be seen, the Lorentzians are well-separated in frequency. Small shifts in the frequencies of the Lorentzians are seen, but the overall shape of the power spectra remained the same, with perhaps an exception in the bottom panel of Figure \\ref{fig:pds}. This was also mostly the case for the {\\it Ginga} power spectra reported by \\cite{Oosterbroek_1997}, who only observed one clear exception from the usual shape in their set of power spectra.  The $\\nu_{max}$ ranges for the three Lorentzians are:  $\\sim$0.015--0.04 Hz, $\\sim$0.17--0.82 Hz, and $\\sim$1.7--4.8 Hz. The $Q$-values of the broad noise features were less than 0.75 and in most cases were fixed at 0. The fractional rms amplitudes of the low-, mid-, and high-frequency Lorentzians were $\\sim$30--35\\%, $\\sim$15--30\\%, and $\\sim$15--23\\%, respectively. The quality of the June 27 power spectrum in Figure \\ref{fig:pds} was not high enough to separately fit the two highest-frequency components, and only two Lorentzians were used to fit this power spectrum.  \n\n\\begin{figure}\n\\centerline{\\includegraphics[width=7cm]{pds.pdf}}\n\\caption{A sequence of power spectra of V404 Cyg from June 26--27. Models fits with two or three Lorentzian are shown in red; individual Lorentzians are plotted in gray. Corresponding dates are shown in the upper right corners. }\\label{fig:pds}\n\\end{figure}\n\n\n\n\\section{Discussion}\nFor a $10 M_\\sun$ black hole the Schwarzschild radius is $R_S=3\\times 10^{6}\n$ cm and the Eddington luminosity is $L_{\\rm EDD}=1.26\\times 10^{39}\n~{\\rm erg~ s}^{-1}$.  The luminosities calculated for GBM data are from 10-1000 keV.  Significant flux is expected below 10 keV therefore our luminosities represent lower limits to the bolometric luminosity.  It is probable that V404 Cyg reached or exceeded the Eddington luminosity during the 2015 outburst.\n\n\\subsection{Physical Model for the Hard X-ray Emission}\nWe find a clear anti-correlation between the GBM flux and the electron\ntemperature of the CompTT model.  We present this behavior in the equivalent \n$L/L_{\\rm EDD}-kT_e$ diagram (see Figure \\ref{fig:int}).  This correlation is\npresent both in the brighter flares  and when considering the entire duration of\nthe current V404 Cyg flaring activity.  \n\nOverall, the electron temperature values show large variations and no obvious\ncorrelation  up to $L \\lesssim 0.15 L_{\\rm EDD}$. For $L >0.15 L_{\\rm EDD}$ a\nclear anti-correlation emerges, and the scatter in $T_e$ decreases visibly (see\nFigure \\ref{fig:int}).  Individual outbursts' show a\nsimilar behavior, when well sampled (trigger bn150625400 in Figure\n\\ref{fig:tres}). \n\n\nThe correlation between the electron temperature and luminosity has already\nbeen noted in the case of GX 339-4 by \\citet{Miyakawa+08lum}.  Using GBM\nobservations of V404 Cyg, we can populate a larger swath of the $L-kT_e$\ndiagram and find their interpretation valid here as well with minor\nmodifications.  We envision a population of protons in thermal equilibrium with\nhot electrons which are in turn responsible for the inverse Compton\nup-scattering of the soft thermal photons from the disk or base of the jet, resulting in the\ngamma-ray photons.\n\nIn order to determine which processes drive the bursting activity, we calculate\nrelevant timescales.  The electron-proton relaxation timescale can be\ncalculated as \\citep{Spitzer62}: \n\n\\begin{eqnarray}\nt_{pe}&=& \\frac{3 m_p (kT_p/m_p + kT_e/m_e)^{3/2} }{4 \\pi^{1/2} m_e^{1/2} q_e^4\nn_e\n \\ln \\Lambda}\\\\\n\\nonumber   &=&5.3 \\times 10^{-3} \\left(\\frac{R}{10~R_S}\\right)  \\left(\\frac{kT_e}{30~ {\\rm keV}}\\right)^{3/2} \\left(\\frac{\\tau}{1.45}\\right)^{-1} {\\rm s} \n\\end{eqnarray}\n\nwhere $n_e$ is the particle number density, $\\ln \\Lambda = 16.1 + \\ln [(k\nT_e/~30 {\\rm keV}) (n_e/10^{17}{\\rm cm}^{-3})^{-1/2}]$ is the Coulomb\nlogarithm, $T_e$ and $T_p$ are the electron and proton temperatures\nrespectively. Electrons and protons establish a Maxwellian distribution on this\ntimescale. For the numerical value, we have assumed $T_e>\\frac{m_e}{m_p}T_p$\nand $\\tau\\approx R n_e \\sigma_T$. Henceforth, we use $10R_S$ for the size of\nthe emission region.\n\nElectrons will lose energy to soft photons through inverse Compton scattering\non a timescale\n\\begin{eqnarray}\nt_{\\rm IC}&=&\\frac{ 3 m_e c^2}{8 \\sigma_T L \\tau / (\\pi R^2)} \\\\\n\\nonumber \t&=& 3.6 \\times 10^{-6} \\left(\\frac{L/L_{\\rm EDD}}{0.2} \\right)^{-1}   \\left(\\frac{R}{10~R_S} \n\\right)^{2} \\left(\\frac{\\tau}{1.45}\\right)^{-1} {\\rm s}\n\\end{eqnarray}\n\nThe advection timescale, or the time in which electrons are swallowed by the\nblack hole \\citep{Mahadevan+97adaf} can be calculated e.g. in the advection\ndominated accretion flow model \\citep{Narayan+94adaf}:\n\\begin{footnotesize}\n\\begin{eqnarray}\nt_{\\rm adv} &\\approx& \\frac{R^2}{\\alpha H^2 \\sqrt{G M/R^3}}\\\\\n\t&=& 0.4 \\left(\\frac{R/H}{0.2}\\right)^2 \\left(\\frac{R}{10~R_S}\\right)^{3/2}\n\t\\left(\\frac{\\alpha}{0.3}\\right)^{-1} {\\rm s},\n\\end{eqnarray}\n\\end{footnotesize}\nwhere $H$ is the height of the disk, assumed to be a fraction 0.2 of the radius,\nand $\\alpha$ is the viscosity parameter scaled to 0.3. \n\n\nOut of these three timescales, the Compton cooling is the shortest. Based on\nthe above equations the proton-electron equilibrium timescale is shorter than\nthe advection timescale indicating the former is the more efficient process.\nHowever the value of $H$, $\\alpha$ and the emission region size assumed here,\n$10 R_S$ have large uncertainties allowing $t_{\\rm adv}$ to be of the same\norder as $t_{\\rm pe}$ (e.g. for $H/R\\approx\\alpha \\approx1$, and $R \\approx 3\nR_S$).  If this is the case, about an equal fraction of electrons will be\navailable for IC up scattering and for advection. As the luminosity increases,\nIC cooling becomes more effective, decreasing the temperature of the electrons.\nColder electrons result in more effective proton-electron collisional\nrelaxation, while the advection efficiency does not vary with electron\ntemperature. Thus eventually the two main processes will be the electron proton\ninteraction and the IC cooling of the electrons.\n\nIf we assume a steady state, the energy transferred per unit volume and unit\ntime from protons to electrons will equal the energy lost by electrons through\nCompton cooling, following \\citet{Inoue94ginga,Miyakawa+08lum}, yields:\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:eq}\n\\frac{3/2 n k T_p}{t_{\\rm pe}} = \\frac{4kT_e L n_e \\sigma_T}{\\pi R^2 m_e c^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{3/2nkT_{p}}{t_{\\rm pe}}=\\frac{4kT_{e}Ln_{e}\\sigma_{T}}{\\pi R^{2}m_{e}c^{%&#10;2}}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><msub><mi>T</mi><mi>p</mi></msub></mrow><msub><mi>t</mi><mi>pe</mi></msub></mfrac><mo>=</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><msub><mi>T</mi><mi>e</mi></msub><mo>⁢</mo><mi>L</mi><mo>⁢</mo><msub><mi>n</mi><mi>e</mi></msub><mo>⁢</mo><msub><mi>σ</mi><mi>T</mi></msub></mrow><mrow><mi>π</mi><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>m</mi><mi>e</mi></msub><mo>⁢</mo><msup><mi>c</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]