[{"file": "1601.00654.tex", "nexttext": "\nwhere $A$ is taken as the average value of $A_k$. Note that since the $g^{(2)}(0)$ values are intrinsic to the source, and hence affect any process in which we wish to use it, we do not correct for non-zero $g^{(2)}(0)$ in Eq.~(\\ref{eq:1}). The deduced $V$ therefore corresponds to the raw two-photon interference visibility, and quantifies the degree of photon indistinguishability.\n\nFigure~\\ref{fig:2}b shows histograms for the indistinguishability of orthogonal- and parallel-polarised photons at $\\Delta\\tau_e{=}50$~ns and $P{=}P_0$. In virtue of Eq.~(\\ref{eq:1}), and measured $\\mathcal{R}{=}0.471$, we obtain $V^{P_0}_{50\\text{ns}}{=}(0.71{\\pm}0.01)\\%$ in orthogonal configuration (red histogram), and $V^{P_0}_{50\\text{ns}}{=}(60.31{\\pm}0.60)\\%$ for parallel-polarised photons (blue histogram), where $V^{P}_{\\Delta\\tau_e}$ denotes visibility taken at a power $P$ and temporal delay $\\Delta\\tau_e$. We observe higher visibilities at lower powers and shorter delays. For instance, the measurements in Fig.~\\ref{fig:2}c were taken at $P{=}0.5P_0$, and reveal $V^{0.5P_0}_{12.5\\text{ns}}{=}(67.52{\\pm}0.78)\\%$ at a temporal delay (blue histogram) of $\\Delta\\tau_e{=}12.5$~ns. Remarkably, we find that indistinguishability is robust in the temporal domain. Even after $33$ consecutive emitted photons (orange histogram), at $\\Delta\\tau_e{=}400$~ns, it only decreases to $V^{0.5P_0}_{400\\text{ns}}{=}(59.97{\\pm}0.76)\\%$. That is, less than $8\\%$ visibility decrease in $\\sim400$~ns.\n\nTo thoroughly examine the indistinguishability properties of \\emph{Device~$1$}, we carried out power- and temporal-dependent measurements, see Fig.~\\ref{fig:3}a. All these measured $V$ are within the $50\\%{-}70\\%$ range, thus showing conclusive quantum interference at all measured powers and timescales. The large available photon flux allows us to gather more than $100$ visibility values with measurement errors sufficiently small to identify an interesting behaviour in this narrow visibility range. At any given $\\Delta\\tau_e$, $V$ is linear in $P$, see Supplementary Material, and we simply use $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$ to characterise the $P$-dependence of $V$ at fixed $\\Delta\\tau_e$. Conversely, at fixed $P$, $V$ decreases monotonically and asymptotically in $\\Delta\\tau_e$, flattening to fixed values at longer timescales.\n\nWe model this behaviour by considering a time-dependent wandering of the spectral line as the origin of the temporal modulation. That is, the frequency of every emitted photon $\\omega(t){=}\\omega_0{+}\\delta\\omega(t)$ varies in time according to some wandering function $\\delta\\omega(t)$ occurring in timescales much larger than the photon lifetime. Our problem is then equivalent to finding the mutual interference visibility between independent sources with finite frequency detuning~\\cite{cavEnhTPI:Giesz}, which is given by $V(0)/\\left( 1+ \\delta\\omega_r^2 \\right)$ in the case where $V(0)$ is the degree of indistinguishability for each source alone (equal value for both), and $\\delta\\omega_r$ is the ratio of the frequency detuning to the spectral linewidth of the sources (equal linewidth for both). If this mismatch arises due to spectral wandering within the same source, then the time-averaged relative detuning squared is given by $2\\delta\\omega_r^2\\left(1{-}\\exp\\left({{-}\\Delta\\tau_e/\\tau_c}\\right)\\right)$, with $\\tau_c$ a characteristic wandering timescale, see Supplementary Material for more details. We thus derive the visibility of temporally-distant photons:\t\n\t\n", "itemtype": "equation", "pos": 18801, "prevtext": "\n\\title{Scalable performance in solid-state single-photon sources}\n\n\\author{J.~C.~Loredo}\\email{juan.loredo1@gmail.com}\n\\affiliation{Centre for Engineered Quantum Systems, Centre for Quantum Computation and Communication Technology, School of Mathematics and Physics, University of Queensland, Brisbane, Queensland 4072, Australia}\n\\author{N.~A.~Zakaria}\n\\affiliation{Centre for Engineered Quantum Systems, Centre for Quantum Computation and Communication Technology, School of Mathematics and Physics, University of Queensland, Brisbane, Queensland 4072, Australia}\n\\author{N.~Somaschi}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{C.~Anton}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{L.~De~Santis}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\affiliation{Universit\\'e Paris-Sud, Universit\\'e Paris-Saclay, F-91405 Orsay, France}\n\\author{V.~Giesz}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{T.~Grange}\n\\affiliation{Universit\\'e Grenoble-Alpes, CNRS, Institut N\\'{e}el, \"Nanophysique et semiconducteurs\" group, F-38000 Grenoble, France}\n\\author{M.~A.~Broome}\n\\affiliation{Centre for Engineered Quantum Systems, Centre for Quantum Computation and Communication Technology, School of Mathematics and Physics, University of Queensland, Brisbane, Queensland 4072, Australia}\n\\affiliation{Present address: Centre of Excellence for Quantum Computation and Communication Technology, School of Physics, University of New South Wales, Sydney, New South Wales 2052, Australia}\n\\author{O.~Gazzano}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\affiliation{Present address: Joint Quantum Institute, National Institute of Standards and Technology, University of Maryland, Gaithersburg, MD, USA}\n\\author{G.~Coppola}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{I.~Sagnes}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{A.~Lemaitre}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\author{A.~Auffeves}\n\\affiliation{Universit\\'e Grenoble-Alpes, CNRS, Institut N\\'{e}el, \"Nanophysique et semiconducteurs\" group, F-38000 Grenoble, France}\n\\author{P.~Senellart}\n\\affiliation{CNRS-LPN Laboratoire de Photonique et de Nanostructures, Universit\\'e Paris-Saclay, Route de Nozay, 91460 Marcoussis, France}\n\\affiliation{D\\'epartment de Physique, Ecole Polytechnique, Universit\\'e Paris-Saclay, F-91128 Palaiseau, France}\n\\author{M.~P.~Almeida}\n\\affiliation{Centre for Engineered Quantum Systems, Centre for Quantum Computation and Communication Technology, School of Mathematics and Physics, University of Queensland, Brisbane, Queensland 4072, Australia}\n\\author{A.~G.~White}\n\\affiliation{Centre for Engineered Quantum Systems, Centre for Quantum Computation and Communication Technology, School of Mathematics and Physics, University of Queensland, Brisbane, Queensland 4072, Australia}\n\n\\begin{abstract}\nThe desiderata for an ideal photon source are high brightness, high single-photon purity, and high indistinguishability. Defining brightness at the first collection lens, these properties have been simultaneously demonstrated with solid-state sources, however absolute source efficiencies remain close to the $1\\%$ level, and indistinguishability only demonstrated for photons emitted consecutively on the few nanosecond scale. Here we demonstrate solid-state photon sources with an absolute brightness at the output of a single-mode fibre of $14\\%$ and purities of $97.1$--$99.0\\%$. Our sources are quantum dots deterministically coupled to micropillar cavities with emission lifetimes of a few hundred picoseconds. When quasi-resontantly excited, they emit long streams of photons that exhibit an indistinguishability up to $70\\%$---above the classical limit of $50\\%$---even after 33 consecutively emitted photons, a $400$~ns separation between them. When resonantly excited we observe near-optimal indistinguishability values: $95\\%$ at short timescales, remaining above $90\\%$ at timescales as large as $160$~ns. Our devices bring solid-state emitters into a regime suitable for scalable implementations.\n\\end{abstract}\n\n\\maketitle\n\n\\noindent Photon indistinguishability---responsible for unique quantum phenomena with no classical counterpart, notably photon bunching via interference~\\cite{HOM:Mandel}---has been demonstrated in various physical systems~\\cite{indAtom:Kuhn,indIonR:Monroe,indNV:Hanson,indMol:Zumbusch,indSCirc:Wallraff,indSPDC:Franson,indQD:Yamamoto,indQD:Senellart}, resulting in a broad range of applications in photonic quantum technologies~\\cite{QuantTech:Obrien}, including quantum teleportation~\\cite{qtel:Zeilinger,qtelM:Pan}, generation of entangled photon sources~\\cite{entSource:Kwiat,entSource:Wong,entSource:Senellart}, and linear-optics quantum computation~\\cite{KLM:KLM,LOQC:Milburn}. However, achieving conclusive indistinguishability, i..e. above $50\\%$ (the classical limit), while simultaneously displaying high single-photon purity and high absolute brightness is experimentally challenging.\n\nSemiconductor quantum dots (QDs) inserted in photonic structures~\\cite{spDevice:Imamoglu,spEnhEmis:Yamamoto,spQDEff:Yamamoto,spQDPhCr:Lodahl,spQDEffOut:Lodahl} are a rapidly improving technology for generating bright sources of indistinguishable single-photons. Addressing the excited states of the quantum dot using a quasi-resonant scheme early showed two-photon interference visibilities in the $70\\%{-}80\\%$ range~\\cite{indQD:Yamamoto}, yet with limited collection efficiencies. Improvements in the efficiency have been made by deterministically placing the quantum dot in the centre of a photonic micro-cavity. Here the acceleration of photon emission into well defined cavity modes~\\cite{enhancedEm:JMGerard}, due to Purcell enhancement, has enabled two-photon interference visibilities in the same range, with simultaneous efficiencies at the first collection lens around $80\\%$~\\cite{indQD:Senellart}. Near-unity indistinguishability, in turn, has been achieved in recent years under strictly-resonant excitation of the quantum dot~\\cite{indQDUnity:Pan,indQD995:Pan}, whereas the recent development of electric control on deterministically coupled devices~\\cite{spDetElecCont:Senellart}---thus with scalable fabrication---has now enabled strictly-resonant excitation in combination with Purcell enhancement, resulting in near-optimal single-photon sources~\\cite{nearOpt:Senellart} with visibilities reaching the $99\\%$ mark, simultaneous state-of-the-art extraction efficiency of $65\\%$ and polarised brightness at the first lens around~$16\\%$.\n\nAlbeit impressive, the reported efficiencies in these demonstrations are defined at the first lens, and poor optical collection results in low photon count rates available in practice. Consequently, absolute brightnesses remain around the $1\\%$ mark, too low for practical scalable applications~\\cite{QuantTech:Obrien}. In addition, direct measurements of indistinguishability via two-photon interference, so far, only employed photons consecutively emitted with a few nanosecond separation, while a key question regarding the scalable potential of these sources is to determine how many consecutive photons exhibit conclusive quantum interference.\n\nWe address these issues in this work. Here we employ a deterministically coupled quantum dot-micropillar device~\\cite{indQD:Senellart} (\\emph{Device~$1$}) to demonstrate a high-purity single-photon source with an absolute brightness of $14\\%$. That is, about one in seven laser pulses creates a high-purity single-photon at the output of a single-mode fibre. We also demonstrate robust and conclusive quantum interference between consecutively emitted photon pulses up to a first and thirty-third, separated by $400$~ns. Interference visibilities, under quasi-resonant excitation, reach maximum values of $70\\%$ in short timescales, decreasing to plateaus above $60\\%$ at longer temporal separations, and remain above the classical limit of $50\\%$ even at high pump-powers. Furthermore, we also employed a recently developed device~\\cite{nearOpt:Senellart} with deterministic---thus scalable---fabrication and electric control (\\emph{Device~$2$}) to demonstrate, under strictly resonant-excitation, indistinguishability reaching near-optimal values: $95\\%$ at short timescales, remaining above $90\\%$ at $160$~ns separation.\n\n\\emph{Device~$1$} contains self-assembled InGaAs QDs grown by molecular beam epitaxy, positioned in between two layers of GaAs/AlAs distributed Bragg reflectors, consisting of $16$ ($36$) pairs acting as a top (bottom) mirror. Note that \\emph{Device~$1$} is a pillar from the same batch as in Ref.~\\cite{indQD:Senellart}.~Low-temperature \\emph{in situ} lithography~\\cite{inSituLith:Senellart} was employed to fabricate micropillars centred around a single QD with $50$~nm accuracy. The sample is mounted on a closed-cycle cryostat and is optically pumped by $5$~ps laser pulses at $80$~MHz repetition rate with wavelength tuned to $905.3$~nm, corresponding to one of the quantum dot excited states in its p-shell. We optimised our collection efficiency by judicious choice of optical elements, achieving an efficiency budget as follows. After emission from the micropillar, single-photons travel across the following elements, with measured transmittances $\\eta_{elem}$, before reaching detectors: two cryostat windows with $\\eta_{cryo}{=}(96\\pm1)\\%$; a microscope objective (Olympus LMPLN$10$XIR) with N.A.${=}0.3$ and $\\eta_{obj}{=}(91\\pm1)\\%$; a dichroic mirror (Alluxa filters) used to separate single-photons from the laser path, with a measured attenuation at $905$~nm bounded to $>60$~dB extinction, while no appreciable loss is recorded at wavelengths corresponding to single-photon emission, we thus consider $\\eta_{dich}{=}1$; $6$ mirrors and $2$ lenses, with an overall transmission of $\\eta_{ml}{=}(95\\pm1)\\%$; and a $0.85$~nm FWHM band-pass filter (Alluxa filters) with $\\eta_{bp}{=}(91\\pm1)\\%$ used to ensure that any residual scattered laser light is filtered out. Remaining losses are due to coupling to a single-mode fibre, where we estimate a fibre-coupling efficiency of $\\eta_{fc}{=}(65\\pm4)\\%$, by comparing collection with a multimode fibre assumed to have a unity coupling efficiency. This results in an overall transmission of our optical setup of $\\eta_{setup}{=}(49\\pm3)\\%$.\n\n\\begin{figure}[h]\n\\centering\n\n\\includegraphics[width=.85\\linewidth]{fig1.pdf}\n\\caption{Absolute brightness and purity of \\emph{Device~$1$}.  a) Detected count rates at $T{=}15$~K (red), with the QD in resonance with the cavity mode, and $13$~K (blue), with the QD slightly detuned from the cavity. Solid curves represent fits to $R_0\\left(1-\\exp{(-P{/}P_0)}\\right)$, with $P_0{=}197$~$\\mu$W, and $R_0{=}3.8$~MHz for $T{=}15$~K, and $R_0{=}3.4$~MHz for $T{=}13$~K. Inset: QD spectra with varying temperature. b) Power-dependent $g^{(2)}(0)$ at T{=}$15$~K. Note that even three times above the saturation pump power the photon purity remians $>97$\\%. Top inset shows the autocorrelation measurement for $P{=}1P_0$, and bottom inset zooms into the zero delay resolving the non-zero $g^{(2)}(0)$ from experimental noise.}\n\\label{fig:1}\n\\end{figure}\n\nWe characterise this device in terms of absolute brightness and purity, see Fig.~\\ref{fig:1}. We detect large count-rates in a silicon avalanche photodiode (APD), as shown in the saturation measurements in Fig.~\\ref{fig:1}a. The saturation curves are fitted to $R_0\\left(1-\\exp{(-P{/}P_0)}\\right)$, where $R_0$ is an asymptotic rate value, and $P_0$ is the saturation power. The inset figure shows \\emph{Device~1} spectra with varying temperature. We observe three emission lines arising from the same QD corresponding to the neutral and charged excitons that are successively brought in resonance with the cavity mode when increasing temperature $T$. The instability of the QD charge state results in a reduced brightness at the resonance condition for $T{=}15$~K. Despite this, we measure count-rates in pulsed configuration as high as $3.6$~MHz. In fact, for this measurement a known loss must be introduced in the optical path in order to properly quantify the available count-rates, as they are beyond the APD's (Perkin-Elmer SPCM{-}AQR{-}$14${-}FC) linear regime. This allows us to accumulate a high amount of statistics with notably short integration times. For instance, the inset in Fig.~\\ref{fig:1}b shows a $g^{(2)}(\\Delta t)$ measurement---second-order autocorrelation function with $g^{(2)}(0){=}0$ corresponding to an ideal single-photon state---at $P{=}P_0$, yielding a value of $g^{(2)}(0){=}0.0130\\pm0.0002$, where the small error is reached with an integration time of only $29$ seconds. We in fact used about half the available counts after selecting one linear polarisation emitted by our device. Thus, in our setup, the same amount of statistics is achieved four times faster when the polariser is removed. Remarkably, we observe low multi-photon emission at all pump-powers, with a measured maximum value of $g^{(2)}(0){=}0.0288\\pm0.0002$ at $P{=}3P_{0}$. We thus observe a single-photon purity $1{-}g^{(2)}(0)$ above $97\\%$ even at maximum brightness. These values were extracted from integrating raw counts in a $2$~ns window---sufficiently larger than the $<0.5$~ns lifetime~\\cite{indQD:Senellart}---around the peak at zero delay compared to the average of the 10 adjacent lateral peaks. Error bars in this work are deduced from assuming poissonian statistics in detected events.\n\nOur APD efficiency of $32\\%$---measured using the approach of Ref.~\\cite{detEff:Hadfield}---$80$~MHz pump rate, and $3.6$~MHz detected count rate corresponds to an absolute brightness---the probability-per-laser-pulse of finding a spectrally-isolated high-purity single-photon at the output of a single-mode fibre---of $14\\%$, the highest reported to date.\n\nWe now explore the indistinguishability of photons emitted by \\emph{Device~$1$} with various temporal distances. We perform our measurements at $T{=}13$~K to reduce phonon-induced dephasing~\\cite{TPIDephasing:Kamp}, which is sufficiently close to the quantum dot cavity resonance at $T{=}15$~K. Note that contrary to most reports, the phonon sideband here is not filtered out by the $0.85$~nm bandpass filter used to further suppress the laser light. Figure~\\ref{fig:2}a depicts our experimental setup. Single-photons are injected into an unbalanced Mach-Zehnder interferometer with a variable fibre-based path-length difference designed to match---by using multiple fibres of distinct lengths---an integer multiple of $12.5$~ns up to $400$~ns. Polarisation control---polariser (Pol) and a half-wave plate (HWP)---and a polarising beamsplitter (PBS) behave as a beamsplitter with tuneable reflectivity, thus balancing the photon-flux entering the interference point inside a fibre-beamsplitter (FBS) closing the Mach-Zehnder configuration. Quarter-wave plates (QWPs) and HWPs are used to tune the polarisation of interfering photons in parallel or orthogonal configuration.\n\nTime-correlation histograms from the output of this interferometer reveal the indistinguishability of photons emitted with a temporal distance $\\Delta\\tau_e$. Fully distinguishable photons---e.g., with orthogonal polarisation---meeting at a $50{:}50$ beamsplitter result in a $50$~\\% probability of being detected simultaneously at the output of the beamsplitter. This results in the peak around $\\Delta t{=}0$ of the time-correlation measurement being about half of those at $\\Delta t${\\textgreater}$0$, with the exception of peaks at $\\Delta t{=}\\Delta\\tau_e$, which larger suppression indicates that the interfering photons were emitted with a temporal distance $\\Delta\\tau_e$. In general it can be shown for a pure single-photon source, see Supplementary Material, that the areas $A_{\\Delta t}$ centered around $\\Delta t$ are given by $A_{k}{=}N$, $A_{-\\Delta\\tau_e}{=}N(1{-}\\mathcal{R}^2)$, $A_{\\Delta\\tau_e}{=}N(1{-}\\mathcal{T}^2)$, and $A_0{=}N\\left(\\left(\\mathcal{R}^2+\\mathcal{T}^2\\right)-2\\mathcal{R}\\mathcal{T}V\\right)$, where $k{=}\\pm12.5\\text{~ns},\\pm25\\text{~ns},...$, and excludes peaks at $\\pm\\Delta\\tau_e$, $N$ is an integration constant.\n\n\\begin{figure}[h!]\n\\begin{center}\n\\includegraphics[width=.85\\linewidth]{fig2.pdf}\n\n\\caption{Two-photon interference between temporally-distant photons. a) A simple unbalanced Mach-Zehnder interferometer with a path-length difference of $\\Delta\\tau_e$ probes the indistinguishability of two photons emitted with the same $\\Delta\\tau_e$ temporal separation. b) Interference histograms of orthogonal- (red) and parallel-polarised (blue) photons with $\\Delta\\tau_e{=}50$~ns, at saturation of the quantum dot. (Note the suppression at $\\Delta\\tau_e$, see text for details). c) Interference of parallel-polarised photons with $\\Delta\\tau_e{=}12.5$~ns (blue) and $\\Delta\\tau_e{=}400$~ns (orange), taken at $P{=}0.5P_0$. A temporal offset of $3.5$~ns has been introduced between histograms for clarity.}\n\n\\label{fig:2}\n\\end{center}\n\\end{figure}\n\n\\begin{figure*}[htpb]\n\\begin{center}\n\\includegraphics[width=.85\\linewidth]{fig3.pdf}\n\\caption{Power- and temporal-dependent two-photon interference. a) Over ${>}100$ measured visibilities (red points) showing conclusive quantum interference, i.e. $V{>}0.5$, at all measured powers and timescales. Coloured surface is an interpolation to the data. b) Fitted values of $\\overline{V}$ at different $\\Delta\\tau_e$ (bottom axis), for $P{=}0$ (red), $P{=}P_0$ (green), and $P{=}2P_0$ (blue), showing interference between a first and $n$-th consecutive emitted photon (top axis). Curves are fits to our model in Eq.~(\\ref{eq:2}).}\n\n\\label{fig:3}\n\\end{center}\n\\end{figure*}\nWe use the visibility $V$ to quantify the degree of indistinguishability of the source. Since the measured visibility depends both on the photon source and on the apparatus used to characterise it the latter must be accounted for. Ideally the apparatus is a beamsplitter of reflectivity $\\mathcal{R}$=0.5; in our experiment $\\mathcal{R}{=}0.471$, $\\mathcal{T}{=}1{-}\\mathcal{R}$, and the visibility $V$ is thus, \n\t\n", "index": 1, "text": "\\begin{equation}\\label{eq:1}\n\t\tV=\\frac{\\mathcal{R}^2+\\mathcal{T}^2-A_0{/}A}{2\\mathcal{R}\\mathcal{T}},\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"V=\\frac{\\mathcal{R}^{2}+\\mathcal{T}^{2}-A_{0}{/}A}{2\\mathcal{R}\\mathcal{T}},\" display=\"block\"><mrow><mrow><mi>V</mi><mo>=</mo><mfrac><mrow><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mn>2</mn></msup><mo>+</mo><msup><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mn>2</mn></msup></mrow><mo>-</mo><mrow><msub><mi>A</mi><mn>0</mn></msub><mo>/</mo><mi>A</mi></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00654.tex", "nexttext": "\n\\begin{figure*}[ht]\n\\begin{center}\n\\includegraphics[width=.8\\linewidth]{fig4.pdf}\n\\caption{Temporal-dependent indistinguishability under strictly resonant excitation. Two-photon interference histograms of parallel-polarised photons at a) $\\Delta\\tau_e{=}12.2$~ns, and b) $\\Delta\\tau_e{=}158.5$~ns, under a $\\pi$-pulse preparation. c) Second-order autocorrelation measurement at $\\pi$-pulse. d) Indistinguishability between a first and $n$-th consecutive emitted photon remains almost flat in the temporal domain. Measured values (black) and estimated values (blue) saturate respectively at ${>}85\\%$ and ${>}90\\%$. Curves are fits to Eq.~(\\ref{eq:2}).}\n\n\\label{fig:4}\n\\end{center}\n\\end{figure*}\nTo obtain a statistically meaningful temporal behaviour, we used the fitted values of $\\overline{V}$ at different $\\Delta\\tau_e$, for powers $P{=}0$, $P{=}P_0$, and $P{=}2P_0$. These values are plotted in Fig.~\\ref{fig:3}b and are in good agreement with our model in Eq.~(\\ref{eq:2}). In the limit of low powers, we obtain $V(0){=}(72.8\\pm2.4)\\%$, $\\tau_c{=}(45.5\\pm19.1)$~ns, and $\\delta\\omega_r{=}(29.4\\pm3.1)\\%$; whereas at high powers, at $P{=}2P_0$, these parameters are $V(0){=}(59.0\\pm2.0)\\%$, and $\\delta\\omega_r{=}(19.3\\pm4.5)\\%$. The considerably large relative error in $\\tau_c$ is due to a small relative decay in $V$, and it loses significance with smaller decays, as observed at higher powers. Thus---although it is reasonable to assume that $\\tau_c$ itself is power-dependent---we extracted $\\tau_c$ only at $P{=}0$ and used it as a fixed parameter for the fits at higher powers.\n\nWe now use \\emph{Device~$2$} to explore the indistinguishability of temporally-distant photons under strictly resonant excitation. This sample contains quantum dots deterministically coupled to micropillars embedded in cylindrical gated structures with $p$- and $n$-contacts respectively defined on the top and bottom sides of the device, resulting in an effective $p${-}$i${-}$n$ diode structure onto which an electric field can be applied. (See Ref.~\\cite{nearOpt:Senellart} for a detailed description of the device). We perform our measurements at $T{=}9$~K and tune the emission into cavity-resonance via an applied bias voltage of ${-}0.3$~V. We deterministically prepare the exciton state via a $\\pi$-pulse. This sample is cooled by gas exchange in a closed-cycle cryostat, and is pumped by shaped $15$~ps laser pulses at $82$~MHz repetition rate. The experimental setup used for photon collection is reported in Ref.~\\cite{nearOpt:Senellart}, and the appartus used for the temporal-dependent measurements is conceptually identical to that in Fig.~\\ref{fig:2}a.\n\n\\emph{Device~$2$} allows us to probe two-photon interference in a regime excelling in indistinguishability performance. Indeed, we obtain $V^{\\pi}_{12.2\\text{ns}}{=}(95.0{\\pm}1.0)\\%$ at a short temporal separation, decreasing only to $V^{\\pi}_{158.5\\text{ns}}{=}(90.6{\\pm}1.7)\\%$ asymptotically at long timescales, see Figs.~\\ref{fig:4}a, and \\ref{fig:4}b. We observe a high single-photon purity quantified by $g^{(2)}(0){=}0.015\\pm0.007$ at $\\pi$-pulse, see Fig.~\\ref{fig:4}c. The remaining non-vanishing $g^{(2)}(0)$ primarily consists of background noise and thus a purity $1{-}g^{(2)}(0)$ of $98.5\\%$ represents a lower bound on the intrinsic single-photon purity of the device. The values of indistinguishability are estimated in the absence of background noise arising from detector dark counts, see Supplementary Material. This estimation is relevant to accurately determine the intrinsic degree of indistinguishability since the experimental setup used for resonant excitation presents a low collection efficiency, see Ref.~\\cite{nearOpt:Senellart}. Including experimental noise results in $V^{\\pi}_{12.2\\text{ns}}{=}(89.0{\\pm}1.5)\\%$ and $V^{\\pi}_{158.5\\text{ns}}{=}(86.2{\\pm}2.1)\\%$.\n\nFigure~\\ref{fig:4}d shows the measured (including noise) and estimated (subtracting noise) indistinguishability of temporally-distant photons under strictly resonant excitation. Indistinguishability reaches plateaus at high values: the first and fourteenth photons, separated by $\\sim150$~ns, exhibit an estimated indistinguishability $>90\\%$. Curves are fits to the data, with a maximum indistinguishability of $V(0){=}96.6\\%$ ($V(0){=}90.5\\%$) in the estimated (measured) case. $\\tau_c{=}54.4$~ns, and $\\delta\\omega_r{=}17.8\\%$ are extracted from the estimated data and used as fixed values for the measured one.\n\nNote that a high absolute brightness with this recently developed technology is yet to be achieved. However, since a photon extraction efficiency at the first lens of $65\\%$ has been reported on this sample~\\cite{nearOpt:Senellart}, we anticipate that higher absolute efficiencies than the $14\\%$ here presented are within reach.\n\nWe have shown a single-photon source with a record absolute brightness of $14\\%$, a clear improvement over what has been previously achieved with quantum-dot-based photon sources. For instance, a drastic contrast between performance at the first lens and actual detected count rates has been common until now, e.g., reporting a brightness as high as $72\\%$ while detecting $65$~kHz~\\cite{spQDHighEff:JMGerard}, or $143$~MHz collected on the first lens but only $72$~kHz available on detection~\\cite{143MHz:Reitzenstein}. Detected rates of $4.0$~MHz at the single-photon level have been reported~\\cite{spQDHighFreq:Bouwm}, however without coupling into a single-mode fibre and at the cost of high multi-photon contribution with $g^{(2)}(0){=}0.4$. In fact, our source greatly exceeds, in terms of absolute brightness, the performance of any other single-photon source from any physical system, including the well established Parametric Down-Conversion source---so far considered as the premier photon source---where the equivalent (triggered) absolute brightnesses are well below $1\\%$. We note that, given our setup collection efficiency of $\\eta_{setup}{=}49\\%$, \\emph{Device~$1$} exhibits---for the neutral exciton state---a brightness at the first lens of $29\\%$, a reduced value compared to those reported in Ref.~\\cite{indQD:Senellart} on the same sample. This reduced brightness originates from the appearance of previously absent emission lines (charged states), now observed after sample relocation and accidental freezing. Higher brightnesses at the first lens are frequently reported in the literature, we believe the solid-state single-photon source community will benefit from the collection efficiency budget we describe here.\n\nWe furthermore showed that our sources emit long streams of indistinguishable photons, and even a first and a thirty-third photon, separated by $\\sim400$~ns, display conclusive quantum interference. Moreover, under strictly-resonant excitation, photon indistinguishability between a first and fourteenth consecutive photon remained above $90\\%$. These numbers correspond to the longest temporal delays here studied, and at a particular pump repetition rate of $80$~MHz, thus it only represents a lower bound on the number of photons we can generate---limited by radiative lifetimes in the order of a few hundred picoseconds---that can be further used in quantum information processing protocols with solid-state sources~\\cite{entGate:Senellart}. Previous works investigating noise spectra in resonance fluorescence have shown evidence of long streams of near transform-limited photons~\\cite{indNoise:Warburton} in timescales potentially reaching seconds~\\cite{transLimitedQD:Warburton}. In fact, \\emph{Device~$2$} has recently been shown to emit photons with near transform-limited linewidth in a millisecond timescale~\\cite{fewPhoton:Giesz}. We thus expect that our devices are indeed producing highly indistinguishable photons at further longer timescales than the ones here explored.\n\nOur findings are especially relevant in implementations with time-bin encoded degrees of freedom, such as some recently proposed schemes of linear-optics quantum computing with time-bin encoding~\\cite{LOQCSPM:Walmsley,LOQCTLoop:Rohde}, where the indistinguishability of temporally-distant photons will directly determine quantum fidelities of the implemented protocols.\n\nScaling solid-state multi-photon sources by combining multiple independent emitters remains challenging, as atomic growth accuracy or complex individual electric control over multiple devices is needed. These requirements can be circumvented by making use of a single photon source emitting a long temporal stream of highly indistinguishable photons that can be demultiplexed by fast active optics. To that end, high absolute source efficiency is a mandatory requirement for the scaling of these sources to significant photon numbers, which becomes feasible due to Purcell-enhancement of \\emph{deterministically}-coupled quantum dot-micropillar devices. The necessary conditions are unlikely to be found by chance with non-deterministic approaches, with reported~\\cite{detPillar75:Hofling} device yields of $\\sim$0.01\\%~\\cite{10000:JWP}. Thus, the deterministic fabrication, high absolute brightness, and long timescale indistinguishability of our devices will enable large-scale applications that have been heretofore impossible.\n\n\\subsection*{Funding Information}\n\nThis work was partially supported by the Centre for Engineered Quantum Systems (Grant No. CE$110001013$), the Centre for Quantum Computation and Communication Technology (Grant No. CE$110001027$), by the ERC Starting Grant No. $277885$ QD-CQED, the French Agence Nationale pour la Recherche (ANR DELIGHT, ANR USSEPP), the French RENATECH network, the Labex NanoSaclay, and by the EU FP7 Grant No. 618078 (WASPS). AGW acknowledges support from a UQ Vice-Chancellor's Research and Teaching Fellowship.\n\n\\subsection*{Acknowledgments}\n\nJCL and AGW thank the team from the Austrian Institute of Technology for kindly providing time-tagging modules. MPA thanks Halina Rubinsztein-Dunlop for generous loan of equipment. The CNRS-LPN authors are very thankful to Anna Nowak for her help on the technology.\n\n\n\\bibliography{refV2.bib} \n\n\\newpage\n\\section{Supplementary Material}\n\n\\subsection{Areas in time-correlation histograms}\n\nHere we deduce the area distribution of the time-correlation measurements described in the main text. For simplicity, we first consider two (fully-distinguishable) single-photons distributed in time-bins $\\{t_1,t_2\\}$, entering an unbalanced Mach-Zehnder interferometer composed of a first $50{:}50$ beamsplitter and a second beamsplitter with reflectance $\\mathcal{R}$ (transmittance $\\mathcal{T}{=}1{-}\\mathcal{R}$). Our task is to find all possible output distributions leading to a coincidence detection between events separated in time by $\\Delta t$. There are two timescales relevant in such coincidence measurements: the difference in occupied time-bins $\\delta t{=}|t_2{-}t_1|$, and the temporal delay inside the unbalanced interferometer $\\Delta$. By inspecting this reduced scenario, we can find that there are $8$ events leading to a coincidence detection, as depicted in Fig.~\\ref{fig:s1}. This results in local patterns of peak areas $A_{\\Delta t}$ given by: $A_{{-}\\delta t{-}\\Delta}{=}\\mathcal{R}^2$, $A_{{-}\\delta t}{=}2\\mathcal{R}\\mathcal{T}$, and $A_{{-}\\delta t{+}\\Delta}{=}\\mathcal{T}^2$, the local pattern around ${-}\\delta t$; and $A_{\\delta t{-}\\Delta}{=}\\mathcal{R}^2$, $A_{\\delta t}{=}2\\mathcal{R}\\mathcal{T}$, and $A_{\\delta t{+}\\Delta}{=}\\mathcal{T}^2$, the local pattern around $\\delta t$. From this, we find simple rules for the time-correlation measurement of an array of single-photons distributed in arbitrary time-bins $\\{t_i\\}$ passing through a $\\Delta$-unbalanced Mach-Zehnder:\n\n\\emph{rule~1}:~Find all possible temporal delays $\\delta t$ relating each pair of photons within the given time-bin distribution.\n\n\\emph{rule~2}:~Around each $\\pm\\delta t$, assign the relative frequency of events $\\{\\mathcal{R}^2,2\\mathcal{R}\\mathcal{T},\\mathcal{T}^2\\}$ at temporal delays $\\Delta t{=}\\{\\pm\\delta t{-}\\Delta,\\pm\\delta t,\\pm\\delta t{+}\\Delta\\}$.\n\nWe note that these two simple rules describe different interesting histograms relevant in the literature. For instance, by simply identifying the involved parameters, one can find histograms of $g^{(2)}(\\Delta t)$ measurements of arbitrary $|n\\rangle$ Fock states by considering $n$ single-photons occupying the same time-bin, resulting in distributions agreeing with $g^{(2)}(0){=}1{-}1{/}n$, or the well known $5$-peak structures in two-photon interference experiments involving pairs of photons separated by $\\Delta\\tau_e<12.5$~ns repeated every $12.5$~ns.\n\n\\begin{figure*}[htpb]\n\\centering\n\n\\includegraphics[width=.95\\linewidth]{figS1.pdf}\n\\caption{Two consecutive single-photons separated by $\\delta t$ passing through a $\\Delta$-unbalanced Mach-Zehnder interferometer. $8$ outcome distributions, occurring with a given relative frequency, lead to a coincidence signal between events separated in time by $\\Delta t$. The relative delay $\\Delta t$ is positive if a detector in the upper output fires first, and it is negative in the opposite case.}\n\\label{fig:s1}\n\\end{figure*}\nNow, the experiment described in the main text is the particular case of an infinitely long stream of single-photons separated by a fixed $\\delta t{=}12.5$~ns, and passing through an unbalanced interferometer with $\\Delta{=}\\Delta\\tau_e$. Under this consideration, and following \\emph{rule~1} and \\emph{rule~2}, we derive the distribution of areas $A_{\\Delta t}$, given by: $A_{k}{=}N$, $A_{-\\Delta\\tau_e}{=}N(1{-}\\mathcal{R}^2)$, $A_{\\Delta\\tau_e}{=}N(1{-}\\mathcal{T}^2)$, and $A_0{=}N\\left(\\left(\\mathcal{R}^2+\\mathcal{T}^2\\right)-2\\mathcal{R}\\mathcal{T}V\\right)$, with $k{=}\\pm12.5\\text{~ns},\\pm25\\text{~ns},...$, excluding peaks at $\\pm\\Delta\\tau_e$, and $N$ an integration constant. The visibility term $V$ in $A_0$ appears from noticing (in virtue of \\emph{rule~1} and \\emph{rule~2}) that the area at $\\Delta t{=}0$ for fully-distinguishable photons is $A_0^{V{=}0}{=}N(\\mathcal{R}^2+\\mathcal{T}^2)$, and then one simply uses the well-known relation $V{=}\\left( 1{-} A_0{/}A_0^{V{=}0}\\right)\\left( \\mathcal{R}^2{+}\\mathcal{T}^2 \\right){/}\\left( 2\\mathcal{R}\\mathcal{T} \\right)$, with $A_0$ relating the coincidence rate at zero delay of photons with non-zero $V$ indistinguishability. \n\n\n\\subsection{Visibility power-dependence}\n\nFollowing the main text, the interference visibility $V$ of two photons separated in time by $\\Delta\\tau_e$ exhibits a linear-dependence in the pump power $P$. For a given $\\Delta\\tau_e$, we measure $V$ at various values of $P$, up to three saturation powers $P{=}3P_0$, and fit the data to $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$. Figure~{\\ref{fig:s2}} shows the power-dependence of $V$ for $\\Delta\\tau_e{=}12.5$~ns, $\\Delta\\tau_e{=}50$~ns, and $\\Delta\\tau_e{=}400$~ns. The fitted parameters are $V_{12.5\\text{ns}}^{max}{=}(70.3{\\pm}0.3)\\%$, $m_{12.5\\text{ns}}{=}{-}(6.1{\\pm}0.2)\\%$ at short timescales; $V_{50\\text{ns}}^{max}{=}(65.0{\\pm}0.3)\\%$, $m_{50\\text{ns}}{=}{-}(4.4{\\pm}0.2)\\%$ at moderate timescales; and $V_{400\\text{ns}}^{max}{=}(60.8{\\pm}0.3)\\%$, $m_{400\\text{ns}}{=}{-}(3.6{\\pm}0.2)\\%$ at the longest timescales explored in this work.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=.85\\linewidth]{figS2.pdf}\n\\caption{Power-dependence of $V$ for $\\Delta\\tau_e{=}12.5$~ns (orange), $\\Delta\\tau_e{=}50$~ns (purple), and $\\Delta\\tau_e{=}400$~ns (brown). Curves are fits to $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$. $V$ is above $50\\%$ (the classical limit) at all powers and timescales here explored.}\n\\label{fig:s2}\n\\end{figure}\n\n\\subsection{Visibilities of temporally-distant photons}\n\nThe interference visibility of two photons from two sources $a$ and $b$ reads~\\cite{cavEnhTPI:Giesz}:\n\t\n", "itemtype": "equation", "pos": 22456, "prevtext": "\nwhere $A$ is taken as the average value of $A_k$. Note that since the $g^{(2)}(0)$ values are intrinsic to the source, and hence affect any process in which we wish to use it, we do not correct for non-zero $g^{(2)}(0)$ in Eq.~(\\ref{eq:1}). The deduced $V$ therefore corresponds to the raw two-photon interference visibility, and quantifies the degree of photon indistinguishability.\n\nFigure~\\ref{fig:2}b shows histograms for the indistinguishability of orthogonal- and parallel-polarised photons at $\\Delta\\tau_e{=}50$~ns and $P{=}P_0$. In virtue of Eq.~(\\ref{eq:1}), and measured $\\mathcal{R}{=}0.471$, we obtain $V^{P_0}_{50\\text{ns}}{=}(0.71{\\pm}0.01)\\%$ in orthogonal configuration (red histogram), and $V^{P_0}_{50\\text{ns}}{=}(60.31{\\pm}0.60)\\%$ for parallel-polarised photons (blue histogram), where $V^{P}_{\\Delta\\tau_e}$ denotes visibility taken at a power $P$ and temporal delay $\\Delta\\tau_e$. We observe higher visibilities at lower powers and shorter delays. For instance, the measurements in Fig.~\\ref{fig:2}c were taken at $P{=}0.5P_0$, and reveal $V^{0.5P_0}_{12.5\\text{ns}}{=}(67.52{\\pm}0.78)\\%$ at a temporal delay (blue histogram) of $\\Delta\\tau_e{=}12.5$~ns. Remarkably, we find that indistinguishability is robust in the temporal domain. Even after $33$ consecutive emitted photons (orange histogram), at $\\Delta\\tau_e{=}400$~ns, it only decreases to $V^{0.5P_0}_{400\\text{ns}}{=}(59.97{\\pm}0.76)\\%$. That is, less than $8\\%$ visibility decrease in $\\sim400$~ns.\n\nTo thoroughly examine the indistinguishability properties of \\emph{Device~$1$}, we carried out power- and temporal-dependent measurements, see Fig.~\\ref{fig:3}a. All these measured $V$ are within the $50\\%{-}70\\%$ range, thus showing conclusive quantum interference at all measured powers and timescales. The large available photon flux allows us to gather more than $100$ visibility values with measurement errors sufficiently small to identify an interesting behaviour in this narrow visibility range. At any given $\\Delta\\tau_e$, $V$ is linear in $P$, see Supplementary Material, and we simply use $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$ to characterise the $P$-dependence of $V$ at fixed $\\Delta\\tau_e$. Conversely, at fixed $P$, $V$ decreases monotonically and asymptotically in $\\Delta\\tau_e$, flattening to fixed values at longer timescales.\n\nWe model this behaviour by considering a time-dependent wandering of the spectral line as the origin of the temporal modulation. That is, the frequency of every emitted photon $\\omega(t){=}\\omega_0{+}\\delta\\omega(t)$ varies in time according to some wandering function $\\delta\\omega(t)$ occurring in timescales much larger than the photon lifetime. Our problem is then equivalent to finding the mutual interference visibility between independent sources with finite frequency detuning~\\cite{cavEnhTPI:Giesz}, which is given by $V(0)/\\left( 1+ \\delta\\omega_r^2 \\right)$ in the case where $V(0)$ is the degree of indistinguishability for each source alone (equal value for both), and $\\delta\\omega_r$ is the ratio of the frequency detuning to the spectral linewidth of the sources (equal linewidth for both). If this mismatch arises due to spectral wandering within the same source, then the time-averaged relative detuning squared is given by $2\\delta\\omega_r^2\\left(1{-}\\exp\\left({{-}\\Delta\\tau_e/\\tau_c}\\right)\\right)$, with $\\tau_c$ a characteristic wandering timescale, see Supplementary Material for more details. We thus derive the visibility of temporally-distant photons:\t\n\t\n", "index": 3, "text": "\\begin{equation}\\label{eq:2}\n\t\tV\\left(\\Delta\\tau_e\\right)=\\frac{V(0)}{1+{2\\delta\\omega_r}^2\\left(1-e^{-\\Delta\\tau_e/\\tau_c}\\right)}.\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"V\\left(\\Delta\\tau_{e}\\right)=\\frac{V(0)}{1+{2\\delta\\omega_{r}}^{2}\\left(1-e^{-%&#10;\\Delta\\tau_{e}/\\tau_{c}}\\right)}.\" display=\"block\"><mrow><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>τ</mi><mi>e</mi></msub></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mmultiscripts><mi>ω</mi><mi>r</mi><none/><none/><mn>2</mn></mmultiscripts><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>τ</mi><mi>e</mi></msub></mrow><mo>/</mo><msub><mi>τ</mi><mi>c</mi></msub></mrow></mrow></msup></mrow><mo>)</mo></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00654.tex", "nexttext": "\nwhere the $\\gamma_i$ are the radiative rates, $\\gamma^*_i$ the pure dephasing rates, and $\\delta \\omega$ the frequency detuning between the two sources. If the interfering photons are emitted by the same quantum dot, we assume that $\\gamma_a{=}\\gamma_b{=}\\gamma$ and $\\gamma^*_a{=}\\gamma^*_b{=}\\gamma^*$ are constant, but only the frequency $\\omega{=}\\omega_0+\\delta\\omega(t)$ varies over time (i.e. spectral wandering) around a central value $\\omega_0$. This model makes sense here as the timescale over which $\\omega$ varies is much larger than the radiative lifetime. Then Eq.~(\\ref{eq:s1}) reduces to:\n\t\n", "itemtype": "equation", "pos": 38438, "prevtext": "\n\\begin{figure*}[ht]\n\\begin{center}\n\\includegraphics[width=.8\\linewidth]{fig4.pdf}\n\\caption{Temporal-dependent indistinguishability under strictly resonant excitation. Two-photon interference histograms of parallel-polarised photons at a) $\\Delta\\tau_e{=}12.2$~ns, and b) $\\Delta\\tau_e{=}158.5$~ns, under a $\\pi$-pulse preparation. c) Second-order autocorrelation measurement at $\\pi$-pulse. d) Indistinguishability between a first and $n$-th consecutive emitted photon remains almost flat in the temporal domain. Measured values (black) and estimated values (blue) saturate respectively at ${>}85\\%$ and ${>}90\\%$. Curves are fits to Eq.~(\\ref{eq:2}).}\n\n\\label{fig:4}\n\\end{center}\n\\end{figure*}\nTo obtain a statistically meaningful temporal behaviour, we used the fitted values of $\\overline{V}$ at different $\\Delta\\tau_e$, for powers $P{=}0$, $P{=}P_0$, and $P{=}2P_0$. These values are plotted in Fig.~\\ref{fig:3}b and are in good agreement with our model in Eq.~(\\ref{eq:2}). In the limit of low powers, we obtain $V(0){=}(72.8\\pm2.4)\\%$, $\\tau_c{=}(45.5\\pm19.1)$~ns, and $\\delta\\omega_r{=}(29.4\\pm3.1)\\%$; whereas at high powers, at $P{=}2P_0$, these parameters are $V(0){=}(59.0\\pm2.0)\\%$, and $\\delta\\omega_r{=}(19.3\\pm4.5)\\%$. The considerably large relative error in $\\tau_c$ is due to a small relative decay in $V$, and it loses significance with smaller decays, as observed at higher powers. Thus---although it is reasonable to assume that $\\tau_c$ itself is power-dependent---we extracted $\\tau_c$ only at $P{=}0$ and used it as a fixed parameter for the fits at higher powers.\n\nWe now use \\emph{Device~$2$} to explore the indistinguishability of temporally-distant photons under strictly resonant excitation. This sample contains quantum dots deterministically coupled to micropillars embedded in cylindrical gated structures with $p$- and $n$-contacts respectively defined on the top and bottom sides of the device, resulting in an effective $p${-}$i${-}$n$ diode structure onto which an electric field can be applied. (See Ref.~\\cite{nearOpt:Senellart} for a detailed description of the device). We perform our measurements at $T{=}9$~K and tune the emission into cavity-resonance via an applied bias voltage of ${-}0.3$~V. We deterministically prepare the exciton state via a $\\pi$-pulse. This sample is cooled by gas exchange in a closed-cycle cryostat, and is pumped by shaped $15$~ps laser pulses at $82$~MHz repetition rate. The experimental setup used for photon collection is reported in Ref.~\\cite{nearOpt:Senellart}, and the appartus used for the temporal-dependent measurements is conceptually identical to that in Fig.~\\ref{fig:2}a.\n\n\\emph{Device~$2$} allows us to probe two-photon interference in a regime excelling in indistinguishability performance. Indeed, we obtain $V^{\\pi}_{12.2\\text{ns}}{=}(95.0{\\pm}1.0)\\%$ at a short temporal separation, decreasing only to $V^{\\pi}_{158.5\\text{ns}}{=}(90.6{\\pm}1.7)\\%$ asymptotically at long timescales, see Figs.~\\ref{fig:4}a, and \\ref{fig:4}b. We observe a high single-photon purity quantified by $g^{(2)}(0){=}0.015\\pm0.007$ at $\\pi$-pulse, see Fig.~\\ref{fig:4}c. The remaining non-vanishing $g^{(2)}(0)$ primarily consists of background noise and thus a purity $1{-}g^{(2)}(0)$ of $98.5\\%$ represents a lower bound on the intrinsic single-photon purity of the device. The values of indistinguishability are estimated in the absence of background noise arising from detector dark counts, see Supplementary Material. This estimation is relevant to accurately determine the intrinsic degree of indistinguishability since the experimental setup used for resonant excitation presents a low collection efficiency, see Ref.~\\cite{nearOpt:Senellart}. Including experimental noise results in $V^{\\pi}_{12.2\\text{ns}}{=}(89.0{\\pm}1.5)\\%$ and $V^{\\pi}_{158.5\\text{ns}}{=}(86.2{\\pm}2.1)\\%$.\n\nFigure~\\ref{fig:4}d shows the measured (including noise) and estimated (subtracting noise) indistinguishability of temporally-distant photons under strictly resonant excitation. Indistinguishability reaches plateaus at high values: the first and fourteenth photons, separated by $\\sim150$~ns, exhibit an estimated indistinguishability $>90\\%$. Curves are fits to the data, with a maximum indistinguishability of $V(0){=}96.6\\%$ ($V(0){=}90.5\\%$) in the estimated (measured) case. $\\tau_c{=}54.4$~ns, and $\\delta\\omega_r{=}17.8\\%$ are extracted from the estimated data and used as fixed values for the measured one.\n\nNote that a high absolute brightness with this recently developed technology is yet to be achieved. However, since a photon extraction efficiency at the first lens of $65\\%$ has been reported on this sample~\\cite{nearOpt:Senellart}, we anticipate that higher absolute efficiencies than the $14\\%$ here presented are within reach.\n\nWe have shown a single-photon source with a record absolute brightness of $14\\%$, a clear improvement over what has been previously achieved with quantum-dot-based photon sources. For instance, a drastic contrast between performance at the first lens and actual detected count rates has been common until now, e.g., reporting a brightness as high as $72\\%$ while detecting $65$~kHz~\\cite{spQDHighEff:JMGerard}, or $143$~MHz collected on the first lens but only $72$~kHz available on detection~\\cite{143MHz:Reitzenstein}. Detected rates of $4.0$~MHz at the single-photon level have been reported~\\cite{spQDHighFreq:Bouwm}, however without coupling into a single-mode fibre and at the cost of high multi-photon contribution with $g^{(2)}(0){=}0.4$. In fact, our source greatly exceeds, in terms of absolute brightness, the performance of any other single-photon source from any physical system, including the well established Parametric Down-Conversion source---so far considered as the premier photon source---where the equivalent (triggered) absolute brightnesses are well below $1\\%$. We note that, given our setup collection efficiency of $\\eta_{setup}{=}49\\%$, \\emph{Device~$1$} exhibits---for the neutral exciton state---a brightness at the first lens of $29\\%$, a reduced value compared to those reported in Ref.~\\cite{indQD:Senellart} on the same sample. This reduced brightness originates from the appearance of previously absent emission lines (charged states), now observed after sample relocation and accidental freezing. Higher brightnesses at the first lens are frequently reported in the literature, we believe the solid-state single-photon source community will benefit from the collection efficiency budget we describe here.\n\nWe furthermore showed that our sources emit long streams of indistinguishable photons, and even a first and a thirty-third photon, separated by $\\sim400$~ns, display conclusive quantum interference. Moreover, under strictly-resonant excitation, photon indistinguishability between a first and fourteenth consecutive photon remained above $90\\%$. These numbers correspond to the longest temporal delays here studied, and at a particular pump repetition rate of $80$~MHz, thus it only represents a lower bound on the number of photons we can generate---limited by radiative lifetimes in the order of a few hundred picoseconds---that can be further used in quantum information processing protocols with solid-state sources~\\cite{entGate:Senellart}. Previous works investigating noise spectra in resonance fluorescence have shown evidence of long streams of near transform-limited photons~\\cite{indNoise:Warburton} in timescales potentially reaching seconds~\\cite{transLimitedQD:Warburton}. In fact, \\emph{Device~$2$} has recently been shown to emit photons with near transform-limited linewidth in a millisecond timescale~\\cite{fewPhoton:Giesz}. We thus expect that our devices are indeed producing highly indistinguishable photons at further longer timescales than the ones here explored.\n\nOur findings are especially relevant in implementations with time-bin encoded degrees of freedom, such as some recently proposed schemes of linear-optics quantum computing with time-bin encoding~\\cite{LOQCSPM:Walmsley,LOQCTLoop:Rohde}, where the indistinguishability of temporally-distant photons will directly determine quantum fidelities of the implemented protocols.\n\nScaling solid-state multi-photon sources by combining multiple independent emitters remains challenging, as atomic growth accuracy or complex individual electric control over multiple devices is needed. These requirements can be circumvented by making use of a single photon source emitting a long temporal stream of highly indistinguishable photons that can be demultiplexed by fast active optics. To that end, high absolute source efficiency is a mandatory requirement for the scaling of these sources to significant photon numbers, which becomes feasible due to Purcell-enhancement of \\emph{deterministically}-coupled quantum dot-micropillar devices. The necessary conditions are unlikely to be found by chance with non-deterministic approaches, with reported~\\cite{detPillar75:Hofling} device yields of $\\sim$0.01\\%~\\cite{10000:JWP}. Thus, the deterministic fabrication, high absolute brightness, and long timescale indistinguishability of our devices will enable large-scale applications that have been heretofore impossible.\n\n\\subsection*{Funding Information}\n\nThis work was partially supported by the Centre for Engineered Quantum Systems (Grant No. CE$110001013$), the Centre for Quantum Computation and Communication Technology (Grant No. CE$110001027$), by the ERC Starting Grant No. $277885$ QD-CQED, the French Agence Nationale pour la Recherche (ANR DELIGHT, ANR USSEPP), the French RENATECH network, the Labex NanoSaclay, and by the EU FP7 Grant No. 618078 (WASPS). AGW acknowledges support from a UQ Vice-Chancellor's Research and Teaching Fellowship.\n\n\\subsection*{Acknowledgments}\n\nJCL and AGW thank the team from the Austrian Institute of Technology for kindly providing time-tagging modules. MPA thanks Halina Rubinsztein-Dunlop for generous loan of equipment. The CNRS-LPN authors are very thankful to Anna Nowak for her help on the technology.\n\n\n\\bibliography{refV2.bib} \n\n\\newpage\n\\section{Supplementary Material}\n\n\\subsection{Areas in time-correlation histograms}\n\nHere we deduce the area distribution of the time-correlation measurements described in the main text. For simplicity, we first consider two (fully-distinguishable) single-photons distributed in time-bins $\\{t_1,t_2\\}$, entering an unbalanced Mach-Zehnder interferometer composed of a first $50{:}50$ beamsplitter and a second beamsplitter with reflectance $\\mathcal{R}$ (transmittance $\\mathcal{T}{=}1{-}\\mathcal{R}$). Our task is to find all possible output distributions leading to a coincidence detection between events separated in time by $\\Delta t$. There are two timescales relevant in such coincidence measurements: the difference in occupied time-bins $\\delta t{=}|t_2{-}t_1|$, and the temporal delay inside the unbalanced interferometer $\\Delta$. By inspecting this reduced scenario, we can find that there are $8$ events leading to a coincidence detection, as depicted in Fig.~\\ref{fig:s1}. This results in local patterns of peak areas $A_{\\Delta t}$ given by: $A_{{-}\\delta t{-}\\Delta}{=}\\mathcal{R}^2$, $A_{{-}\\delta t}{=}2\\mathcal{R}\\mathcal{T}$, and $A_{{-}\\delta t{+}\\Delta}{=}\\mathcal{T}^2$, the local pattern around ${-}\\delta t$; and $A_{\\delta t{-}\\Delta}{=}\\mathcal{R}^2$, $A_{\\delta t}{=}2\\mathcal{R}\\mathcal{T}$, and $A_{\\delta t{+}\\Delta}{=}\\mathcal{T}^2$, the local pattern around $\\delta t$. From this, we find simple rules for the time-correlation measurement of an array of single-photons distributed in arbitrary time-bins $\\{t_i\\}$ passing through a $\\Delta$-unbalanced Mach-Zehnder:\n\n\\emph{rule~1}:~Find all possible temporal delays $\\delta t$ relating each pair of photons within the given time-bin distribution.\n\n\\emph{rule~2}:~Around each $\\pm\\delta t$, assign the relative frequency of events $\\{\\mathcal{R}^2,2\\mathcal{R}\\mathcal{T},\\mathcal{T}^2\\}$ at temporal delays $\\Delta t{=}\\{\\pm\\delta t{-}\\Delta,\\pm\\delta t,\\pm\\delta t{+}\\Delta\\}$.\n\nWe note that these two simple rules describe different interesting histograms relevant in the literature. For instance, by simply identifying the involved parameters, one can find histograms of $g^{(2)}(\\Delta t)$ measurements of arbitrary $|n\\rangle$ Fock states by considering $n$ single-photons occupying the same time-bin, resulting in distributions agreeing with $g^{(2)}(0){=}1{-}1{/}n$, or the well known $5$-peak structures in two-photon interference experiments involving pairs of photons separated by $\\Delta\\tau_e<12.5$~ns repeated every $12.5$~ns.\n\n\\begin{figure*}[htpb]\n\\centering\n\n\\includegraphics[width=.95\\linewidth]{figS1.pdf}\n\\caption{Two consecutive single-photons separated by $\\delta t$ passing through a $\\Delta$-unbalanced Mach-Zehnder interferometer. $8$ outcome distributions, occurring with a given relative frequency, lead to a coincidence signal between events separated in time by $\\Delta t$. The relative delay $\\Delta t$ is positive if a detector in the upper output fires first, and it is negative in the opposite case.}\n\\label{fig:s1}\n\\end{figure*}\nNow, the experiment described in the main text is the particular case of an infinitely long stream of single-photons separated by a fixed $\\delta t{=}12.5$~ns, and passing through an unbalanced interferometer with $\\Delta{=}\\Delta\\tau_e$. Under this consideration, and following \\emph{rule~1} and \\emph{rule~2}, we derive the distribution of areas $A_{\\Delta t}$, given by: $A_{k}{=}N$, $A_{-\\Delta\\tau_e}{=}N(1{-}\\mathcal{R}^2)$, $A_{\\Delta\\tau_e}{=}N(1{-}\\mathcal{T}^2)$, and $A_0{=}N\\left(\\left(\\mathcal{R}^2+\\mathcal{T}^2\\right)-2\\mathcal{R}\\mathcal{T}V\\right)$, with $k{=}\\pm12.5\\text{~ns},\\pm25\\text{~ns},...$, excluding peaks at $\\pm\\Delta\\tau_e$, and $N$ an integration constant. The visibility term $V$ in $A_0$ appears from noticing (in virtue of \\emph{rule~1} and \\emph{rule~2}) that the area at $\\Delta t{=}0$ for fully-distinguishable photons is $A_0^{V{=}0}{=}N(\\mathcal{R}^2+\\mathcal{T}^2)$, and then one simply uses the well-known relation $V{=}\\left( 1{-} A_0{/}A_0^{V{=}0}\\right)\\left( \\mathcal{R}^2{+}\\mathcal{T}^2 \\right){/}\\left( 2\\mathcal{R}\\mathcal{T} \\right)$, with $A_0$ relating the coincidence rate at zero delay of photons with non-zero $V$ indistinguishability. \n\n\n\\subsection{Visibility power-dependence}\n\nFollowing the main text, the interference visibility $V$ of two photons separated in time by $\\Delta\\tau_e$ exhibits a linear-dependence in the pump power $P$. For a given $\\Delta\\tau_e$, we measure $V$ at various values of $P$, up to three saturation powers $P{=}3P_0$, and fit the data to $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$. Figure~{\\ref{fig:s2}} shows the power-dependence of $V$ for $\\Delta\\tau_e{=}12.5$~ns, $\\Delta\\tau_e{=}50$~ns, and $\\Delta\\tau_e{=}400$~ns. The fitted parameters are $V_{12.5\\text{ns}}^{max}{=}(70.3{\\pm}0.3)\\%$, $m_{12.5\\text{ns}}{=}{-}(6.1{\\pm}0.2)\\%$ at short timescales; $V_{50\\text{ns}}^{max}{=}(65.0{\\pm}0.3)\\%$, $m_{50\\text{ns}}{=}{-}(4.4{\\pm}0.2)\\%$ at moderate timescales; and $V_{400\\text{ns}}^{max}{=}(60.8{\\pm}0.3)\\%$, $m_{400\\text{ns}}{=}{-}(3.6{\\pm}0.2)\\%$ at the longest timescales explored in this work.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=.85\\linewidth]{figS2.pdf}\n\\caption{Power-dependence of $V$ for $\\Delta\\tau_e{=}12.5$~ns (orange), $\\Delta\\tau_e{=}50$~ns (purple), and $\\Delta\\tau_e{=}400$~ns (brown). Curves are fits to $\\overline{V}{=}V_{\\Delta\\tau_e}^{max}{+}m_{\\Delta\\tau_e}P$. $V$ is above $50\\%$ (the classical limit) at all powers and timescales here explored.}\n\\label{fig:s2}\n\\end{figure}\n\n\\subsection{Visibilities of temporally-distant photons}\n\nThe interference visibility of two photons from two sources $a$ and $b$ reads~\\cite{cavEnhTPI:Giesz}:\n\t\n", "index": 5, "text": "\\begin{equation}\\label{eq:s1}\n\t\tV= \\left(\\frac{\\gamma_a \\gamma_b}{\\gamma_a+\\gamma_b}\\right) \\frac{ (\\gamma_a+\\gamma_b+\\gamma^*_a+\\gamma^*_b) } {\\left[(\\gamma_a+\\gamma_b+\\gamma^*_a+\\gamma^*_b)/2\\right]^2+\\delta \\omega^2},\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"V=\\left(\\frac{\\gamma_{a}\\gamma_{b}}{\\gamma_{a}+\\gamma_{b}}\\right)\\frac{(\\gamma%&#10;_{a}+\\gamma_{b}+\\gamma^{*}_{a}+\\gamma^{*}_{b})}{\\left[(\\gamma_{a}+\\gamma_{b}+%&#10;\\gamma^{*}_{a}+\\gamma^{*}_{b})/2\\right]^{2}+\\delta\\omega^{2}},\" display=\"block\"><mrow><mrow><mi>V</mi><mo>=</mo><mrow><mrow><mo>(</mo><mfrac><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>⁢</mo><msub><mi>γ</mi><mi>b</mi></msub></mrow><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>+</mo><msub><mi>γ</mi><mi>b</mi></msub></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>+</mo><msub><mi>γ</mi><mi>b</mi></msub><mo>+</mo><msubsup><mi>γ</mi><mi>a</mi><mo>*</mo></msubsup><mo>+</mo><msubsup><mi>γ</mi><mi>b</mi><mo>*</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><msup><mrow><mo>[</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>+</mo><msub><mi>γ</mi><mi>b</mi></msub><mo>+</mo><msubsup><mi>γ</mi><mi>a</mi><mo>*</mo></msubsup><mo>+</mo><msubsup><mi>γ</mi><mi>b</mi><mo>*</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mn>2</mn></mrow><mo>]</mo></mrow><mn>2</mn></msup><mo>+</mo><mrow><mi>δ</mi><mo>⁢</mo><msup><mi>ω</mi><mn>2</mn></msup></mrow></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00654.tex", "nexttext": "\nwhere we have used $V(0){=}\\gamma{/}(\\gamma+\\gamma^*)$ the \"intrinsic\" degree of indistinguishability, and $\\delta\\omega_r{=}\\delta\\omega{/}(\\gamma+\\gamma^*)$ the ratio between the frequency detuning and the spectral linewidth $\\gamma+\\gamma^*$.\n\n\\begin{figure*}[t]\n\\centering\n\n\\includegraphics[width=.85\\linewidth]{figS3.pdf}\n\\caption{Method to extract the \\emph{measured} and \\emph{estimated} interference visibilities. a) Interference histogram of two photons separated by $\\Delta\\tau_e{=}12.2$~ns. b) Subset of data involved in the evaluation of $V$. c) Integrated counts from data in b). d) Measured background in between peaks.}\n\\label{fig:s3}\n\\end{figure*}\nOne can define a time correlation function for the frequency fluctuations as\n\t\n", "itemtype": "equation", "pos": 39282, "prevtext": "\nwhere the $\\gamma_i$ are the radiative rates, $\\gamma^*_i$ the pure dephasing rates, and $\\delta \\omega$ the frequency detuning between the two sources. If the interfering photons are emitted by the same quantum dot, we assume that $\\gamma_a{=}\\gamma_b{=}\\gamma$ and $\\gamma^*_a{=}\\gamma^*_b{=}\\gamma^*$ are constant, but only the frequency $\\omega{=}\\omega_0+\\delta\\omega(t)$ varies over time (i.e. spectral wandering) around a central value $\\omega_0$. This model makes sense here as the timescale over which $\\omega$ varies is much larger than the radiative lifetime. Then Eq.~(\\ref{eq:s1}) reduces to:\n\t\n", "index": 7, "text": "\\begin{equation}\\label{eq:s2}\n\n\n\t\tV=\\left<\\frac{V(0)}{1+\\delta\\omega_r^2}\\right>,\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;\\par&#10; V=\\left&lt;\\frac{V(0)}{1+\\delta\\omega_{r}^{2}}\\right&gt;,\" display=\"block\"><mrow><mrow><mi>V</mi><mo>=</mo><mrow><mo>⟨</mo><mfrac><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>δ</mi><mo>⁢</mo><msubsup><mi>ω</mi><mi>r</mi><mn>2</mn></msubsup></mrow></mrow></mfrac><mo>⟩</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00654.tex", "nexttext": "\nthen, the frequency difference as a function of the delay $\\Delta\\tau_e$ can be expressed as\n\t\\begin{eqnarray}\\nonumber\n\t\t<\\delta \\omega^2(\\Delta\\tau_e)>&=& <(\\delta\\omega(t+\\Delta\\tau_e)-\\delta\\omega(t))^2>\\\\\n\t\t&=& 2 <\\delta \\omega^2> (1-f(\\Delta\\tau_e)).\n\t\\end{eqnarray}\nA common assumption is to assume an exponential correlation function\n\n", "itemtype": "equation", "pos": 40122, "prevtext": "\nwhere we have used $V(0){=}\\gamma{/}(\\gamma+\\gamma^*)$ the \"intrinsic\" degree of indistinguishability, and $\\delta\\omega_r{=}\\delta\\omega{/}(\\gamma+\\gamma^*)$ the ratio between the frequency detuning and the spectral linewidth $\\gamma+\\gamma^*$.\n\n\\begin{figure*}[t]\n\\centering\n\n\\includegraphics[width=.85\\linewidth]{figS3.pdf}\n\\caption{Method to extract the \\emph{measured} and \\emph{estimated} interference visibilities. a) Interference histogram of two photons separated by $\\Delta\\tau_e{=}12.2$~ns. b) Subset of data involved in the evaluation of $V$. c) Integrated counts from data in b). d) Measured background in between peaks.}\n\\label{fig:s3}\n\\end{figure*}\nOne can define a time correlation function for the frequency fluctuations as\n\t\n", "index": 9, "text": "\\begin{equation}\n\t\tF(\\Delta\\tau_e) = <\\delta\\omega(t)\\delta\\omega(t+\\Delta\\tau_e)> = <\\delta \\omega^2> f(\\Delta\\tau_e),\n\t\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"F(\\Delta\\tau_{e})=&lt;\\delta\\omega(t)\\delta\\omega(t+\\Delta\\tau_{e})&gt;=&lt;\\delta%&#10;\\omega^{2}&gt;f(\\Delta\\tau_{e}),\" display=\"block\"><mrow><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Δ</mi><msub><mi>τ</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mo>&lt;</mo><mi>δ</mi><mi>ω</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mi>δ</mi><mi>ω</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>+</mo><mi mathvariant=\"normal\">Δ</mi><msub><mi>τ</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>≥</mo><mo>&lt;</mo><mi>δ</mi><msup><mi>ω</mi><mn>2</mn></msup><mo>&gt;</mo><mi>f</mi><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Δ</mi><msub><mi>τ</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00654.tex", "nexttext": "\nwith $\\tau_c$ a characteristic wandering timescale. Which is expected for a Markovian dynamics of the environnement. An additional input which is required is the distribution for $\\delta\\omega$. Generally one assumes a Gaussian distribution, but for simplicity, and without loss of generality, we take a two-value distribution $\\delta\\omega = \\pm \\sqrt{ <\\delta \\omega^2>} $, so that: \n\t\\begin{eqnarray}\\nonumber\n\t\tV(\\Delta\\tau_e) &=&\\left<\\frac{V(0)}{1+\\delta\\omega_r^2(\\Delta\\tau_e)}\\right>\\\\ \\nonumber\n&=& \\frac{V(0)}{1+\\left<\\delta\\omega_r^2(\\Delta\\tau_e)\\right>} \\\\\n&=& \\frac{V(0)}{1+2\\delta\\omega_r^2\\left(1-e^{-\\Delta\\tau_e/\\tau_c}\\right)}\n\t\\end{eqnarray}\n\n\\subsection{Extraction of visibility under resonant excitation}\n\nHere we describe the methods to extract the \\emph{measured} and \\emph{estimated} two-photon interference visibilities under strictly-resonant excitation and $\\pi$-pulse preparation, see Fig.~\\ref{fig:s3}. Figure~\\ref{fig:s3}a shows the interference histogram of two photons separated by $\\Delta\\tau_e{=}12.2$~ns, from which a visibility is extracted via $V{=}\\left(\\mathcal{R}^2+\\mathcal{T}^2{-}A_0{/}A\\right)/\\left(2\\mathcal{R}\\mathcal{T}\\right)$, where $A_0$ is the area of the peak around $\\Delta t{=}0$, and $A$ is taken as the average area of $14$ adjacent peaks (excluding the peak at $\\Delta\\tau_e$). These areas are taken as the integrated counts within a temporal window of $2$~ns (considerably longer than the subnanosecond lifetimes) around $\\Delta t{=}k\\times12.2$~ns, with $k{=}0,2,3,...,15$, see Fig.~\\ref{fig:s3}b. The resulting integrated areas are shown in Fig.~\\ref{fig:s3}c, from which we extract a \\emph{measured} $V^{\\pi}_{12.2\\text{ns}}{=}(89.0\\pm1.5)\\%$. As described in the main text, the remaining non-vanishing area at $\\Delta t{=}0$ is indeed quite small and it is on the order of experimental noise. We take into account this noise by integrating coincidence counts within a $2$~ns window but now located in between peaks, that is at $\\Delta t{=}(m+1/2)\\times12.2$~ns, with $m{=}1,2,...,14$, see Fig.\\ref{fig:s3}d. After subtracting the average of these background counts to the areas in Fig.\\ref{fig:s3}c, we obtained the \\emph{estimated} visibility $V^{\\pi}_{12.2\\text{ns}}{=}(95.0\\pm1.0)\\%$. These same methods were employed for all measurements under strictly-resonant excitation.\n\nMeasurements under quasi-resonant excitation, as described in the main text, exhibit a noise level $<1\\%$, and therefore no noise-correction was employed.\n\n\n", "itemtype": "equation", "pos": 40600, "prevtext": "\nthen, the frequency difference as a function of the delay $\\Delta\\tau_e$ can be expressed as\n\t\\begin{eqnarray}\\nonumber\n\t\t<\\delta \\omega^2(\\Delta\\tau_e)>&=& <(\\delta\\omega(t+\\Delta\\tau_e)-\\delta\\omega(t))^2>\\\\\n\t\t&=& 2 <\\delta \\omega^2> (1-f(\\Delta\\tau_e)).\n\t\\end{eqnarray}\nA common assumption is to assume an exponential correlation function\n\n", "index": 11, "text": "\\begin{equation}\n f(\\Delta\\tau_e) = e^{-\\Delta\\tau_e / \\tau_c},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"f(\\Delta\\tau_{e})=e^{-\\Delta\\tau_{e}/\\tau_{c}},\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>τ</mi><mi>e</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>τ</mi><mi>e</mi></msub></mrow><mo>/</mo><msub><mi>τ</mi><mi>c</mi></msub></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}]