[{"file": "1601.05807.tex", "nexttext": "\nwhere $E_{\\alpha} $ are the eigenvalues of the Hamiltonian $H$ that dictates the system evolution and $C_{\\alpha}^{(0)}=\\langle \\psi_{\\alpha} | \\Psi(0) \\rangle$ are the overlaps of the initial state with the eigenstates $|\\psi_{\\alpha} \\rangle $ of $H$. As evident from Eq.~(\\ref{eq:fidelity}), $F(t)$ is the discrete Fourier transform of the energy distribution weighted by the components  $|C_{\\alpha}^{(0)} |^2$, the so-called local density of states (LDOS), $\\rho_0(E) = \\sum_\\alpha |C_{\\alpha}^{(0)}|^2\\delta(E-E_\\alpha)$. Essential information about the system dynamics is thus contained in $\\rho_0(E)$.\n\nFor unstable systems, such as unstable nuclei, $F(t)$ decays exponentially, as observed experimentally. However, deviations from this behavior do exist~\\cite{Raizen}. For very short times, the decay is quadratic, as derived from the expansion $F(t \\ll \\sigma_{0}^{-1})  \\approx 1-\\sigma_{0}^2 t^2$, where $\\sigma_0^2=\\sum_{\\alpha} |C_{\\alpha}^{(0)} |^2 (E_{\\alpha} - E_0)^2$ is the energy variance of the initial state and $E_0= \\sum_{\\alpha} |C_{\\alpha}^{(0)}|^2 E_{\\alpha} $ its energy. It is within this time scale that the quantum Zeno effect may be induced.\n\nAfter the inevitable quadratic behavior, whether $F(t)$ switches or not to an exponential decay depends on the strength of the perturbation that takes the many-body system out of equilibrium. The system may be viewed as initially in an eigenstate of a certain initial Hamiltonian $H_0$, which is abruptly perturbed (quenched), starting the dynamics. The new final Hamiltonian is $H=H_0 + g V$, where $g$ is the strength of the perturbation $V$. The exponential decay is valid in the Fermi golden rule regime, where the typical matrix elements of $gV$ are larger than the mean level spacing but $g<1$, which leads to a Lorentzian LDOS. Perturbations yet stronger, $g\\rightarrow 1$, lead to a Gaussian-shaped LDOS resulting in the Gaussian decay $F(t)= \\exp(-\\sigma_0^2 t^2)$ \\cite{TorresAll2014site,Torres2014PRAb,Torres2014PRE} (see also \\cite{Izrailev2006} and references therein). A Gaussian-enveloped LDOS reflects the density of states of many-body quantum systems with two-body interactions, which is also Gaussian~\\cite{Brody1981,Kota2001,Santos2012PRE,Zangara2013}. The larger concentration of states in the middle of the spectrum results in the dependence of the speed of the evolution on the energy of the initial state. As $E_0$ approaches the middle of the spectrum, the LDOS becomes broader (larger $\\sigma_0$) and better filled, so the dynamics becomes faster~\\cite{Torres2014PRAb, noteFast}.\n\nThe short-time dynamics, already beyond the quadratic decay, does not depend on the regime of the final Hamiltonian, but on the strength of the perturbation. Exponential and Gaussian decays occur in both integrable and chaotic models~\\cite{TorresAll2014site,Torres2014PRAb,Torres2014PRE}. The picture becomes more subtle at long times, where the filling of the LDOS plays a key role. The description of the long-time dynamics and its connection with the viability of thermalization are the main concerns of this work.\n\nAt long times, regardless of how fast the initial evolution is, the dynamics necessarily slows down and a powerlaw behavior $\\propto t^{-\\gamma}$ emerges. We discuss two distinctive causes for this algebraic decay:  \n\n{\\em Case 1} is related to the unavoidable presence of a lower bound in the spectrum, $E_{low}$, even if the system decays into the continuum.  This point was put forward already in 1957 \\cite{Khalfin1958} and in several early works~\\cite{Nussenzweig1961,Ersak1969,Fleming1973,Knight1977,Fonda1978,Sluis1991}. At long-times, the energy bounds lead to the initial state partial reconstruction~\\cite{Campo2011,DelCampoARXIV,MugaBook}. For continuous many-particle models, the dependence of $\\gamma$ on quantum statistics, interaction strength, and number of particles was studied in~\\cite{Campo2011,DelCampoARXIV}. \n\n{\\em Case 2} refers to the onset of correlations in the eigenstates. They appear in disordered systems undergoing localization~\\cite{Chalker1988,Chalker1990,Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011} and, as argued here, are present also in clean systems.\n\nMost studies of Case 1 assume that the spectrum and therefore $\\rho_0(E)$ are continuous, so an integral substitutes the sum  in Eq.~(\\ref{eq:fidelity}). In this case, it follows from the Riemann-Lebesgue lemma~\\cite{Fock1947,Khalfin1958} that a necessary and sufficient condition for the survival probability to go to zero at $t\\rightarrow \\infty$ is that the LDOS be absolutely integrable, that is, for any energy interval $\\Delta E$ within the spectrum, $\\int_{\\Delta E} {\\rho_0 (E)dE\\mathop  \\to \\limits^{\\Delta E \\to 0} 0} \\Leftrightarrow F(t\\rightarrow \\infty) \\rightarrow 0$.\n\n The exponents of the algebraic decays in Case 1 are derived from asymptotic expansions of the integral form of Eq.~(\\ref{eq:fidelity}), assuming that $\\rho_0(E)$ is absolutely integrable and that its derivatives exist and are continuous in $[E_{low}, \\infty]$. Two scenarios are identified~\\cite{Urbanowski2009}:\n(i) If $\\lim _{E\\rightarrow E_{low}} \\rho_0(E)>0$, then for long times $F(t) \\propto t^{-2}$. (ii) If $\\rho_0(E)$ decays abruptly close to the lower bound, such that $\\rho_0(E) = (E-E_{low})^{\\xi} \\eta(E)$,  $0<\\xi<1$, and $\\lim _{E\\rightarrow E_{low}} \\eta(E)>0$, then $F(t) \\propto t^{-2(\\xi+1)}$. \n\n\nIn Case 2, the powerlaw exponent of the survival probability is obtained from the correlation function $C(\\omega ) \\equiv  \\sum_{\\alpha ,\\beta } | C_{\\beta}^{(0)} |^2 | C_{\\alpha}^{(0)} |^2 \\delta (E_{\\alpha } - E_{\\beta } - \\omega )  $ contained in $F(t)  = \\int_{ - \\infty }^\\infty  d\\omega e^{i\\omega t} C(\\omega ) $. A powerlaw decay $C(\\omega \\rightarrow 0 ) \\propto \\omega^{\\gamma -1} $, with $\\gamma<1$, leads to $F(t) \\propto t^{-\\gamma}$ \\cite{Chalker1988,Chalker1990,Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011}. The exponent $\\gamma$ measures how much correlated the components of the initial state are. Equivalently, $\\gamma$ can be obtained from the scaling analysis of the inverse participation ratio of the initial state projected on the energy eigenbasis, $\\text{IPR}_{0}\\equiv \\sum_{\\alpha} |C_{\\alpha}^{(0)}|^4$. The relationship between $\\text{IPR}_{0}$ and $\\gamma$ has been extensively investigated in the context of  Anderson localization~\\cite{Ketzmerick1992,Huckestein1994,Huckestein1999} and, more recently, many-body localization~\\cite{Torres2015,Torres2015BJP}. \n\nHere, we analyze how $\\gamma$ depends on the shape and filling of the LDOS for finite many-body quantum systems described by clean lattice models. The determining factors are the properties of the spectrum, structure of the initial state, and number of particles that interact simultaneously. We show that when $\\rho_0(E)$ is ergodically filled, which is equivalent to becoming absolutely integrable as the system size increases, Case 1 above holds. Case 1(i) emerges for realistic systems with few-body interactions and Case 1(ii) is illustrated for full random matrices (FRM), which, despite unphysical, provide an upper bound for $\\gamma$. Case 2 is associated with fragmented LDOS. We show that the analysis developed for disordered systems undergoing localization can be extended to integrable noninteracting models, where the LDOS is typically sparse. \n\nWe argue that the value of the powerlaw exponent is an indicator of the viability of thermalization, since it reflects how well filled $\\rho_0(E)$ is. Thermalization stems from the ergodic filling of the LDOS~\\cite{Santos2011PRL,Santos2012PRL,Santos2012PRE,Torres2013,He2013,RigolARXIV}. When the LDOS is a smooth function of energy, the diagonal entropy, which is the entropy of a quenched system~\\cite{Polkovnikov}, coincides with the thermodynamic entropy~\\cite{Santos2011PRL,RigolARXIV}.\n\n\n\n{\\em System Model and Initial States.--} We consider one-dimensional (1D) spin-1/2 models with $L$ sites. They contain nearest-neighbor (NN) and possibly also next-nearest-neighbor (NNN) couplings. The Hamiltonian is\n\n\\begin{eqnarray}\n&&H = H_{NN} + \\lambda \\; H_{NNN}  ,\n\\label{ham} \\\\\n&& H_{NN} = \\sum_{n} J \\left(S_n^x S_{n+1}^x + S_n^y S_{n+1}^y +\\Delta S_n^z S_{n+1}^z \\right) \\;,\n\\nonumber \\\\\n&& H_{NNN} = \\sum_{n} J \\left(S_n^x S_{n+2}^x + S_n^y S_{n+2}^y +\\Delta S_n^z S_{n+2}^z \\right) \\;.\n\\nonumber \n\\end{eqnarray}\nAbove,  $\\hbar=1$ and $S^{x,y,z}_n$ are the spin operators on site $n$. The coupling strength $J$, the anisotropy parameter $\\Delta$, and the ratio $\\lambda$ between NNN and NN couplings are positive. $J=1$ sets the energy scale. The Hamiltonian conserves total spin in the $z$-direction ${\\cal S}^z$; we work with the largest subspace  ${\\cal S}^z=0$ with dimension ${\\cal D}=L!/(L/2)!^2$.\n\nThe integrable limits of $H$ include the noninteracting XX ($\\Delta = \\lambda = 0$) and the interacting XXZ ($\\Delta \\neq 0$, $\\lambda =0$) models. The system becomes chaotic as $\\lambda $ increases~\\cite{Kudo2005,Santos2009JMP,Gubin2012} and the level spacing distribution changes from a Shnirelman peak or Poisson shape~\\cite{noteXX} to a Wigner-Dyson form~\\cite{Guhr1998}.\n\nThe initial states that are mainly considered here are site-basis vectors, where the spin on each site either points up or down in the $z$-direction. They include the experimentally accessible N\\'eel state, $|\\text{NS} \\rangle = |\\uparrow \\downarrow \\uparrow \\downarrow \\uparrow \\downarrow \\uparrow \\downarrow   \\ldots \\rangle $, and the domain wall state,  $|\\text{DW} \\rangle = |\\uparrow \\uparrow \\uparrow \\ldots \\downarrow \\downarrow  \\downarrow  \\ldots \\rangle $, both extensively used in studies of the dynamics of integrable spin models. \n\n\n\n\n{\\em Case 1: Powerlaw decay caused by spectrum bounds.--} The scenario of site-basis vectors evolving under Hamiltonian (\\ref{ham}) corresponds to a strong perturbation, where the anisotropy parameter is quenched from $\\Delta \\rightarrow \\infty$ to a finite value. The LDOS is therefore expected to have a Gaussian shape, as indeed shown in Fig.~\\ref{fig:chaos}  (a) for the N\\'eel state under the chaotic Hamiltonian with $\\lambda=1$.  The consequent Gaussian decay of $F(t)$ is seen in Fig.~\\ref{fig:chaos}  (b) up to $t\\sim 2$. It agrees extremely well with the analytical expression $F(t)= \\exp(-\\sigma_0^2 t^2)$ \\cite{TorresAll2014site}. \n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=3.3in]{Fig01new.eps}\n\\caption{(Color online) LDOS (a), $F(t)$ (b) and $f(t)$ (c) for the N\\'eel state evolving under the chaotic $H$ (\\ref{ham}) with $\\lambda=1$, $\\Delta=1/2$, open boundaries. \nIn  (a): numerical LDOS (shaded area) and Gaussian envelope (solid line) with $\\sigma_0=\\sqrt{L-1}/2$ and $E_0=\\Delta[-(L-1)+(L-2)\\lambda]/4$; $L=16$ \\cite{TorresAll2014site}. In (b): log-log plot for the numerical $F(t)$ (solid), its time average  (dashed), analytical Gaussian decay (dotted), and $\\bar{F}=\\text{IPR}_{0}$ (horizontal line); $L=24$. In (c): $f(t)$ for $L=22$ (light), $L=24$ (dark), and $-(1/L)\\ln (t^{-2})$ (dashed).}\n\\label{fig:chaos}  \n\\end{figure}\n\nThe minimum value reached by $F(t)$ during the Gaussian decay is significantly below the infinite time average $\\bar{F}=\\text{IPR}_{0}$. This is caused by destructive interferences between the pure Gaussian decay of an unbounded LDOS and the probability for the initial state reconstruction due to the energy bounds. The point in time where this so-called survival collapse~\\cite{Fiori2006,Fiori2009}  occurs increases monotonically with the largest ratio $(E_{low,up}-E_0)/\\sigma_0$, where $E_{up}$ is the LDOS upper bound~\\cite{Jittoh2005}.\n\nThe Fourier transform of a Gaussian LDOS with lower and upper bounds leads at long times to $F(t) \\propto t^{-2}$ \n(see the exact expression in \\cite{noteSUPPL}). In Fig.~\\ref{fig:chaos}  (b), despite fluctuations caused by finite-size effects, we indeed observe a powerlaw decay $\\propto t^{-2}$ until equilibration.\nThis behavior is supported by the time average $\\frac{1}{t} \\int_{t_0}^t  F(\\tau) d\\tau $ shown with the dashed line in the figure. The exponent $\\gamma=2$ indicates that the LDOS is ergodically filled, as corroborated also by computing the inverse participation ratio of the initial state. We have found that $\\text{IPR}_{0} \\propto {\\cal D}^{-1}$, as  in full random matrices.\n\nTo compare different system sizes, we show in Fig.~\\ref{fig:chaos} (c), the rescaled survival probability $f(t) = - (1/L) \\ln F(t)$ \\cite{Andraschko2014}. For $L\\gg 1$, this quantity is independent of $L$ \\cite{Touchette2009}. The $t^{-2}$ behavior is once again evident. We found $\\gamma=2$ also for periodic boundary conditions, chaotic models with different values of $\\lambda$ and $\\Delta$, including $\\Delta=0$, other initial states, and for the XXZ model with small random magnetic fields (see figures in \\cite{noteSUPPL}).  A $t^{-2}$ decay has also been speculated for the chaotic Ising model with longitudinal and transverse fields~\\cite{Monnai2014}. \n\nOur results for the long-time decay of $F(t)$ fall within Case 1(i). From the analytical expression $F(t \\gg \\sigma_0^{-1}) \\simeq {\\cal A} t^{-2} $ \\cite{noteSUPPL}, where ${\\cal A}$ depends on $L$, $E_0$, and the energy bounds, it is clear that for the largest system size, the survival probability goes to zero as $t\\rightarrow \\infty$, indicating that the LDOS is absolutely integrable.\nThe exponent $\\gamma=2$ is therefore an indicator of the ergodic filling of the energy distribution of the initial state and consequently of the viability of thermalization. \n\nAlgebraic decays faster than $t^{-2}$ also signal the ergodic filling of the LDOS. They are possible if instead of two-body interactions, many-body random interactions are included. As the number of particles that interact simultaneously grows, increasing the number of uncorrelated nonzero elements in the Hamiltonian matrix, the density of states transitions from Gaussian to semicircle~\\cite{Brody1981}. This transition is reflected also in the shape of the LDOS \\cite{TorresAll2014site,Wigner1955,Casati1996,Fyodorov1996}. The Fourier transform of a semicircle leads to $F(t) =[{\\cal J}_1( 2 \\sigma_{0} t)]^2/(\\sigma_{0}^2 t^2)$, where ${\\cal J}_1$ is the Bessel function of the first kind~\\cite{TorresAll2014site}. The decay at short times is faster than Gaussian and the asymptotic expansion for long times reveals a powerlaw decay with $\\gamma =3$, $F(t\\gg \\sigma_{0}^{-1}) \\simeq [1 - \\sin(4 \\sigma_{0} t)]/(2 \\pi \\sigma_{0}^3 t^3)$. This scenario coincides with Case 1(ii), where for the semicircle, $\\xi=1/2$, $\\eta(E) = (2\\pi \\sigma_0^2)^{-1} (2\\sigma_0 - E)^{1/2}$, and $E_{low}=-2\\sigma_0$.\nTo illustrate the increase of the value of the powerlaw exponent from 2 to 3, we consider a powerlaw band random matrix (PBRM) \\cite{Mirlin1996,Mirlin2000,Evers2008}. PBRMs have being extensively used in studies of the metal-insulator transition.\n\nDespite the success of FRM in the statistical analysis of complex systems spectra, they imply the unphysical scenario of all particles interacting simultaneously. Band random matrices were introduced~\\cite{Wigner1955} in an effort to better approach random matrices to real systems, for which the Hamiltonians written in a mean field basis are indeed banded. In the PBRMs that we consider~\\cite{Varga2002},  time reversal symmetry is preserved and the elements are real random numbers from a Gaussian distribution, so that $\\langle H_{nn}\\rangle = 0 $, $\\langle H_{nn}^2 \\rangle =2 $, $\\langle H_{nm}^2 \\rangle = 1/ [1+|(n-m)/b|^2] $ for $n\\neq m$, and $b>1$. The value of $b$ determines how fast the elements decrease as they move away from the diagonal. For $b\\rightarrow \\infty$, we recover a FRM from a Gaussian orthogonal ensemble~\\cite{Guhr1998}. \n\nIn Fig.~\\ref{fig:pbrm} (a), we show the survival probability for PBRMs with different values of $b$. As $b$ grows from $50$ to ${\\cal D}$ and the LDOS transitions from Case 1(i) to Case 1(ii), the exponent $\\gamma$ increases from $\\sim 2$ to $3$. In contrast, as $b$ decreases below $50$, the eigenstates become less spread out, the LDOS more sparse, and $\\gamma$ decreases below $2$.  PBRMs therefore provide a general picture of the behavior of the survival probability, covering all values of $\\gamma$, without restriction to a specific model.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=2.7in]{Fig02new.eps}\n\\caption{(Color online) $F(t)$ for basis vectors evolving under PBRMs with $b=0.1,0.5,1,2,5,10,20,50,100,3000 $ (solid lines) from top to bottom. They correspond respectively to the fitted $\\gamma =0.14, 0.50, 0.63, 0.71, 1.15, 1.46, 1.79, 2.15, 2.40, 2.90$ (dashed lines). $F(t) =[{\\cal J}_1( 2 \\sigma_{0} t)]^2/(\\sigma_{0}^2 t^2)$ (dotted line); ${\\cal D}=3432$; 100 realizations and 10\\% of initial states with $E_0 \\sim 0$.\n}\n\\label{fig:pbrm}  \n\\end{figure}\n\n\n\n{\\em Case 2: Powerlaw decay caused by correlations.--}\nPowerlaw exponents smaller than 1 have been verified in disordered systems undergoing localization. Such small powerlaw exponents reflect the onset of multifractal eigenstates and of correlations of eigenstates of different energies~\\cite{Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011,Torres2015,Torres2015BJP} and are thus associated with lack of ergodicity.\n\nHere, we show that  $\\gamma<1$ appears also for high energy states projected onto clean noninteracting integrable models. This is the case of site-basis vectors evolving under the XX model, for which $E_0=0$.\n\nLet us start with the N\\'eel state evolving under a closed XX chain, where $F(t) = \\exp \\sum _{n=1}^{L/2} \\ln \\cos^2 \\{  t \\cos[(2 n+1)\\pi/L]\\}$~\\cite{Andraschko2014,MazzaARXIV}.  For the largest system size and long times, we find that $F(t)\\simeq \\exp[-L (\\ln2 - t^{-1/2}/2)] $. The $t^{-1/2}$ behavior for $L/\\sqrt{t} \\rightarrow 0$ is shown with a dashed line in Fig.~\\ref{fig:XX}(a). \n\nNotice from the expression above that $F(t)$ does not go to zero for $t\\rightarrow \\infty$. This implies that $\\rho_0(E)$ is not absolutely integrable and therefore thermalization should not occur. This is corroborated by the direct analysis of the LDOS. Among the total $L!/(L/2!)^2$ components of the N\\'eel state in the XX model, only $2^{L/2}$ are nonzero and they are all equal,  $|C_{\\alpha}^{(0)}|^2 = 2^{-L/2} $ \\cite{MazzaARXIV}. The nonzero components are spread out in energy, resulting in a very sparse LDOS, although the envelope is still Gaussian. Moreover, the percentage of $|C_{\\alpha}^{(0)}|^2\\neq 0$ for large $L$ is $2^{ - (L + 1)/2}\\sqrt {\\pi L}$, which decreases with system size. These results demonstrate the lack of ergodicity of the LDOS.\n\nSimilarly to what is done in disordered systems~\\cite{Torres2015,Torres2015BJP}, the exponent $\\gamma=1/2$ can also be obtained from the scaling analysis of the $\\text{IPR}_0$. Since $\\text{IPR}_0=2^{-L/2}$, from the Stirling approximation, $\\ln \\text{IPR}_0 = \\ln[L!/(L/2)!^2]^{-\\gamma} \\Rightarrow \\gamma=1/2$. \n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=3.3in]{Fig03new.eps}\n\\caption{(Color online) Analytical $f(t)$ (solid line) and $f(t) \\propto \\gamma \\ln t$ (dashed) for three initial states evolving under the closed XX model: $|\\text{NS}\\rangle$, $\\gamma=0.5$,  $L=150$ (a); $|\\text{DW}\\rangle$, $\\gamma=0.8$, $L=30$ (b); and random vector, $\\gamma=2$, average over $L=26, 28, 30, 32$  (c). \n}\n\\label{fig:XX}  \n\\end{figure}\n\nFor the domain wall state, we obtained \n\\begin{eqnarray}\n&&F(t)=\\frac{2^{2+(L-2)L/2}}{L^{L/2}} \\left| \\sum_{\\{ n_l \\}'}  \\left\\{ \n\\cos \\left[ t \\sum_{i=1}^{L/2} \\cos \\left( \\frac{\\pi n_i}{L} \\right) \\right]  \\right. \\right.\n\\nonumber \\\\\n&&\\left. \\left. \\prod_{i=1}^{L/2} \\prod_{j=i+1}^{L/2}  \\sin^2 \\left( \\frac{\\pi (n_i - n_j)}{2L}  \\right)\n\\right\\} \\right|^2 \\nonumber ,\n\\end{eqnarray}\nwhere the set $\\{ n_l \\}'$ has $L/2$ elements and consists of all combinations of the first $L$ odd numbers in $\\{1, 3, \\ldots, 2L-1\\}$. This result is shown in Fig.~\\ref{fig:XX} (b) together with the long-time behavior $F(t) \\propto t^{-0.8}$. The exponent $\\gamma=0.8$ is also obtained from the scaling analysis of $\\text{IPR}_0$ and our studies of the components $|C_{\\alpha}^{(0)}|^2$ confirm the expected sparsity of the LDOS. Thus, $|\\text{DW}\\rangle$ in the XX model should not thermalize.\n\nIn Fig.~\\ref{fig:XX} (c), we consider an unpolarized random initial state with $C_{\\alpha}^{(0)}=e^{2\\pi i \\phi}/\\sqrt{{\\cal D}}$, where $\\phi$ is a uniformly distributed random variable. This is equivalent to a mixed state of infinite temperature~\\cite{Zangara2013,ZangaraAll}. While such states are not realistic for experiments with cold atoms, they are relevant for NMR experiments done at room temperature. By choice, the LDOS is ergodically filled, which anticipates the observed $t^{-2}$ decay. Thermalization is thus expected, despite the fact that the model is integrable. This example serves as an illustration of the crucial role of the interplay between initial state and Hamiltonian in studies of nonequilibrium dynamics and thermalization.\n\nThere also exists  analytical expressions for $F(t)$ for ground states evolving under the Ising model in a transverse field~\\cite{Venuti2010} and the XY model~\\cite{Venuti2011,Happola2012}. For both integrable models, we found $\\gamma=3/2$, which does not belong to the two Cases investigated in this work. Nevertheless, the results for $F(t)$ also indicate lack of ergodicity. In these two examples, as for the N\\'eel state in the XX model, the survival probability for the largest system size at long times is $\\propto  \\exp(L t^{-\\gamma})$, which does not go to zero for $t\\rightarrow \\infty$, implying that $\\rho_0(E)$ is not absolutely integrable. \n\nFor the interacting XXZ model,  a $t^{-2}$ decay was observed for $\\Delta=1$ and initial states corresponding to superpositions of equally weighted Bethe-ansatz eigenstates in a window of energy~\\cite{DeguchiARXIV}. It is likely, however, that $\\gamma<2$ will emerge for initial states leading to sparse LDOS. This must be the case of the quenches into the XXZ model studied in~\\cite{RigolARXIV}, where thermalization did not occur.\n\n\n\n\n{\\em Conclusions.--} We have shown that for isolated lattice many-body quantum systems, integrable or chaotic, the long-time decay of the survival probability is algebraic, $F(t)\\propto t^{-\\gamma}$. From the value of $\\gamma$, we infer how well filled the energy distribution of the initial state is.  Exponents $\\gamma \\geq 2$  imply ergodicity and therefore the viability of thermalization.\n\n\n\n\n\\begin{acknowledgments}\nThis work was supported by the NSF grant No.~DMR-1147430 and funding from Yeshiva University. EJTH acknowledges funding from CONACYT and PRODEP-SEP, Mexico. We thank Adolfo del Campo and Yevgeny Bar Lev for very useful discussions and Marcos Rigol for valuable suggestions.\n\\end{acknowledgments}\n\n\n\n\n\\begin{thebibliography}{65}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname bibnamefont\\endcsname\\relax\n  \\def\\bibnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname bibfnamefont\\endcsname\\relax\n  \\def\\bibfnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname citenamefont\\endcsname\\relax\n  \\def\\citenamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem[{\\citenamefont{Trotzky et~al.}(2012)\\citenamefont{Trotzky, Chen,\n  Flesch, McCulloch, Schollw\\\"ock, Eisert, and Bloch}}]{Trotzky2012}\n\\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Trotzky}},\n  \\bibinfo{author}{\\bibfnamefont{Y.-A.} \\bibnamefont{Chen}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Flesch}},\n  \\bibinfo{author}{\\bibfnamefont{I.~P.} \\bibnamefont{McCulloch}},\n  \\bibinfo{author}{\\bibfnamefont{U.}~\\bibnamefont{Schollw\\\"ock}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Eisert}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Bloch}},\n  \\bibinfo{journal}{Nature Phys.} \\textbf{\\bibinfo{volume}{8}},\n  \\bibinfo{pages}{325} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Fukuhara et~al.}(2013)\\citenamefont{Fukuhara, Kantian,\n  Endres, Cheneau, Schausz, Hild, Bellem, Schollw\\\"ock, Giamarchi, Gross\n  et~al.}}]{Fukuhara2013}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Fukuhara}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Kantian}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Endres}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Cheneau}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Schausz}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Hild}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Bellem}},\n  \\bibinfo{author}{\\bibfnamefont{U.}~\\bibnamefont{Schollw\\\"ock}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Giamarchi}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Gross}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Nat. Phys.}\n  \\textbf{\\bibinfo{volume}{9}}, \\bibinfo{pages}{235} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Jurcevic et~al.}(2014)\\citenamefont{Jurcevic, Lanyon,\n  Hauke, Hempel, Zoller, Blatt, and Roos}}]{Jurcevic2014}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Jurcevic}},\n  \\bibinfo{author}{\\bibfnamefont{B.~P.} \\bibnamefont{Lanyon}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Hauke}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Hempel}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Zoller}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Blatt}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{C.~F.} \\bibnamefont{Roos}},\n  \\bibinfo{journal}{Nature} \\textbf{\\bibinfo{volume}{511}},\n  \\bibinfo{pages}{202} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Richerme et~al.}(2014)\\citenamefont{Richerme, Gong,\n  Lee, Senko, Smith, Foss-Feig, Michalakis, Gorshkov, and\n  Monroe}}]{Richerme2014}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Richerme}},\n  \\bibinfo{author}{\\bibfnamefont{Z.-X.} \\bibnamefont{Gong}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Lee}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Senko}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Smith}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Foss-Feig}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Michalakis}},\n  \\bibinfo{author}{\\bibfnamefont{A.~V.} \\bibnamefont{Gorshkov}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Monroe}},\n  \\bibinfo{journal}{Nature} \\textbf{\\bibinfo{volume}{511}},\n  \\bibinfo{pages}{198} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Cappellaro et~al.}(2007)\\citenamefont{Cappellaro,\n  Ramanathan, and Cory}}]{Cappellaro2007}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Cappellaro}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Ramanathan}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{D.~G.} \\bibnamefont{Cory}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{99}},\n  \\bibinfo{pages}{250506} (\\bibinfo{year}{2007}).\n\n\\bibitem[{\\citenamefont{Kaur et~al.}(2013)\\citenamefont{Kaur, Ajoy, and\n  Cappellaro}}]{Kaur2013}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Kaur}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ajoy}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Cappellaro}},\n  \\bibinfo{journal}{New J. Phys.} \\textbf{\\bibinfo{volume}{15}},\n  \\bibinfo{pages}{093035} (\\bibinfo{year}{2013}).\n\n\\bibitem[{not({\\natexlab{a}})}]{noteFid}\n\\bibinfo{note}{$F(t)$ is also called return probability or nondecay\n  probability. The term Loschmidt echo is not appropriate, since no time\n  reversal is involved.}\n\n\\bibitem{Raizen}  S. R. Wilkinson, C. F. Bharucha, M. C. Fischer, K. W. Madison, P. R. Morrow, Q. Niu, B. Sundaram and M. G. Raizen, Nature {\\bf 387}, 575 (1997).\n\n\\bibitem[{Tor()}]{TorresAll2014site}\n\\bibinfo{note}{E. J. Torres-Herrera and L. F. Santos, Phys. Rev. A {\\bf 89},\n  043620 (2014);  AIP Conf. Proc. {\\bf 1619}, 171 (2014); E. J. Torres-Herrera, M. Vyas, and L. F. Santos, New J. Phys.\n  {\\bf 16}, 063010 (2014), E. J. Torres-Herrera, D. Kollmar, and L. F. Santos,\n  Phys. Scr. T {\\bf 165}, 014018 (2015).}\n\n\\bibitem[{\\citenamefont{Torres-Herrera and\n  Santos}(2014{\\natexlab{a}})}]{Torres2014PRAb}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. A}\n  \\textbf{\\bibinfo{volume}{90}}, \\bibinfo{pages}{033623}\n  (\\bibinfo{year}{2014}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and\n  Santos}(2014{\\natexlab{b}})}]{Torres2014PRE}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{89}}, \\bibinfo{pages}{062110}\n  (\\bibinfo{year}{2014}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Izrailev and\n  Casta{\\~{n}}eda-Mendoza}(2006)}]{Izrailev2006}\n\\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Casta{\\~{n}}eda-Mendoza}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{350}},\n  \\bibinfo{pages}{355} (\\bibinfo{year}{2006}).\n\n\\bibitem[{\\citenamefont{Brody et~al.}(1981)\\citenamefont{Brody, Flores, French,\n  Mello, Pandey, and Wong}}]{Brody1981}\n\\bibinfo{author}{\\bibfnamefont{T.~A.} \\bibnamefont{Brody}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Flores}},\n  \\bibinfo{author}{\\bibfnamefont{J.~B.} \\bibnamefont{French}},\n  \\bibinfo{author}{\\bibfnamefont{P.~A.} \\bibnamefont{Mello}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Pandey}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{S.~S.~M.} \\bibnamefont{Wong}},\n  \\bibinfo{journal}{Rev. Mod. Phys} \\textbf{\\bibinfo{volume}{53}},\n  \\bibinfo{pages}{385} (\\bibinfo{year}{1981}).\n\n\\bibitem[{\\citenamefont{Kota}(2001)}]{Kota2001}\n\\bibinfo{author}{\\bibfnamefont{V.~K.~B.} \\bibnamefont{Kota}},\n  \\bibinfo{journal}{Phys. Rep.} \\textbf{\\bibinfo{volume}{347}},\n  \\bibinfo{pages}{223} (\\bibinfo{year}{2001}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2012{\\natexlab{a}})\\citenamefont{Santos,\n  Borgonovi, and Izrailev}}]{Santos2012PRE}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Borgonovi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{F.~M.}\n  \\bibnamefont{Izrailev}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{85}}, \\bibinfo{pages}{036209}\n  (\\bibinfo{year}{2012}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Zangara et~al.}(2013)\\citenamefont{Zangara, Dente,\n  Torres-Herrera, Pastawski, Iucci, and Santos}}]{Zangara2013}\n\\bibinfo{author}{\\bibfnamefont{P.~R.} \\bibnamefont{Zangara}},\n  \\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Dente}},\n  \\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}},\n  \\bibinfo{author}{\\bibfnamefont{H.~M.} \\bibnamefont{Pastawski}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Iucci}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{88}},\n  \\bibinfo{pages}{032913} (\\bibinfo{year}{2013}).\n\n\\bibitem[{not({\\natexlab{b}})}]{noteFast}\n\\bibinfo{note}{Faster than Gaussian decays emerge in full random\n  matrices~\\cite{TorresAll2014site,Torres2014PRAb} and real systems with\n  bimodal density of states~\\cite{Torres2014PRAb}.}\n\n\\bibitem[{\\citenamefont{Khalfin}(1958)}]{Khalfin1958}\n\\bibinfo{author}{\\bibfnamefont{L.~A.} \\bibnamefont{Khalfin}},\n  \\bibinfo{journal}{Sov. Phys. JETP} \\textbf{\\bibinfo{volume}{6}},\n  \\bibinfo{pages}{1053} (\\bibinfo{year}{1958}).\n\n\\bibitem[{\\citenamefont{Nussenzweig}(1961)}]{Nussenzweig1961}\n\\bibinfo{author}{\\bibfnamefont{H.~M.} \\bibnamefont{Nussenzweig}},\n  \\bibinfo{journal}{Nuovo Cim. X} \\textbf{\\bibinfo{volume}{20}},\n  \\bibinfo{pages}{694} (\\bibinfo{year}{1961}).\n\n\\bibitem[{\\citenamefont{Ersak}(1969)}]{Ersak1969}\n\\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Ersak}}, \\bibinfo{journal}{Sov.\n  J. Nucl. Phys.} \\textbf{\\bibinfo{volume}{9}}, \\bibinfo{pages}{263}\n  (\\bibinfo{year}{1969}).\n\n\\bibitem[{\\citenamefont{Fleming}(1973)}]{Fleming1973}\n\\bibinfo{author}{\\bibfnamefont{G.~N.} \\bibnamefont{Fleming}},\n  \\bibinfo{journal}{Il Nuovo Cimento} \\textbf{\\bibinfo{volume}{16}},\n  \\bibinfo{pages}{232} (\\bibinfo{year}{1973}).\n\n\\bibitem[{\\citenamefont{Knight}(1977)}]{Knight1977}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Knight}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{61}},\n  \\bibinfo{pages}{25 } (\\bibinfo{year}{1977}).\n\n\\bibitem[{\\citenamefont{Fonda et~al.}(1978)\\citenamefont{Fonda, Ghirardi, and\n  Rimini}}]{Fonda1978}\n\\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Fonda}},\n  \\bibinfo{author}{\\bibfnamefont{G.~C.} \\bibnamefont{Ghirardi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Rimini}},\n  \\bibinfo{journal}{Rep. Prog. Phys.,} \\textbf{\\bibinfo{volume}{41}},\n  \\bibinfo{pages}{587} (\\bibinfo{year}{1978}).\n\n\\bibitem[{\\citenamefont{Sluis and Gislason}(1991)}]{Sluis1991}\n\\bibinfo{author}{\\bibfnamefont{K.~M.} \\bibnamefont{Sluis}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{E.~A.} \\bibnamefont{Gislason}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{43}},\n  \\bibinfo{pages}{4581} (\\bibinfo{year}{1991}).\n\n\\bibitem[{\\citenamefont{del Campo}(2011)}]{Campo2011}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{del Campo}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{84}},\n  \\bibinfo{pages}{012113} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{del Campo}()}]{DelCampoARXIV}\nA. del Campo,  New J. Phys. {\\bf 18}, 015014 (2016).\n\n\\bibitem[{\\citenamefont{Muga et~al.}(2009)\\citenamefont{Muga, Ruschhaupt, and\n  del Campo}}]{MugaBook}\n\\bibinfo{author}{\\bibfnamefont{J.~G.} \\bibnamefont{Muga}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ruschhaupt}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{del\n  Campo}}, \\emph{\\bibinfo{title}{Time in Quantum Mechanics, vol. 2}}\n  (\\bibinfo{publisher}{Springer}, \\bibinfo{address}{London},\n  \\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Chalker and Daniell}(1988)}]{Chalker1988}\n\\bibinfo{author}{\\bibfnamefont{J.~T.} \\bibnamefont{Chalker}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{G.~J.} \\bibnamefont{Daniell}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{61}},\n  \\bibinfo{pages}{593} (\\bibinfo{year}{1988}).\n\n\\bibitem[{\\citenamefont{Chalker}(1990)}]{Chalker1990}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Chalker}},\n  \\bibinfo{journal}{Physica A} \\textbf{\\bibinfo{volume}{167}},\n  \\bibinfo{pages}{253 } (\\bibinfo{year}{1990}).\n\n\\bibitem[{\\citenamefont{Ketzmerick et~al.}(1992)\\citenamefont{Ketzmerick,\n  Petschel, and Geisel}}]{Ketzmerick1992}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Ketzmerick}},\n  \\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Petschel}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Geisel}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{69}},\n  \\bibinfo{pages}{695} (\\bibinfo{year}{1992}).\n\n\\bibitem[{\\citenamefont{Huckestein and Schweitzer}(1994)}]{Huckestein1994}\n\\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Huckestein}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Schweitzer}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{72}},\n  \\bibinfo{pages}{713} (\\bibinfo{year}{1994}).\n\n\\bibitem[{\\citenamefont{Huckestein and Klesse}(1999)}]{Huckestein1999}\n\\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Huckestein}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Klesse}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{59}},\n  \\bibinfo{pages}{9714} (\\bibinfo{year}{1999}).\n\n\\bibitem[{\\citenamefont{Kravtsov et~al.}(2011)\\citenamefont{Kravtsov, Ossipov,\n  and Yevtushenko}}]{Kravtsov2011}\n\\bibinfo{author}{\\bibfnamefont{V.~E.} \\bibnamefont{Kravtsov}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ossipov}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{O.~M.} \\bibnamefont{Yevtushenko}},\n  \\bibinfo{journal}{J. Phys. A} \\textbf{\\bibinfo{volume}{44}},\n  \\bibinfo{pages}{305003} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Fock and Krylov}(1947)}]{Fock1947}\n\\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Fock}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{N.}~\\bibnamefont{Krylov}},\n  \\bibinfo{journal}{J. Phys. USSR} \\textbf{\\bibinfo{volume}{11}},\n  \\bibinfo{pages}{112 } (\\bibinfo{year}{1947}).\n\n\\bibitem[{\\citenamefont{Urbanowski}(2009)}]{Urbanowski2009}\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Urbanowski}},\n  \\bibinfo{journal}{Eur. Phys. J. D} \\textbf{\\bibinfo{volume}{54}},\n  \\bibinfo{pages}{25} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and Santos}(2015)}]{Torres2015}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. B}\n  \\textbf{\\bibinfo{volume}{92}}, \\bibinfo{pages}{014208}\n  (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera\n  et~al.}(2015)\\citenamefont{Torres-Herrera, T\\'avora, and\n  Santos}}]{Torres2015BJP}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{T\\'avora}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Braz. J. Phys.} \\textbf{\\bibinfo{volume}{1}},\n  \\bibinfo{pages}{1} (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2011)\\citenamefont{Santos, Polkovnikov,\n  and Rigol}}]{Santos2011PRL}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Polkovnikov}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{107}},\n  \\bibinfo{pages}{040601} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2012{\\natexlab{b}})\\citenamefont{Santos,\n  Borgonovi, and Izrailev}}]{Santos2012PRL}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Borgonovi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{F.~M.}\n  \\bibnamefont{Izrailev}}, \\bibinfo{journal}{Phys. Rev. Lett.}\n  \\textbf{\\bibinfo{volume}{108}}, \\bibinfo{pages}{094102}\n  (\\bibinfo{year}{2012}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and Santos}(2013)}]{Torres2013}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{88}}, \\bibinfo{pages}{042121}\n  (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{He and Rigol}(2013)}]{He2013} M. Rigol and M. Srednicki, Phys. Rev. Lett. {\\bf 108}, 110601 (2012);\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{He}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{87}},\n  \\bibinfo{pages}{043615} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Rigol}()}]{RigolARXIV}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{note}{arXiv:1511.04447}.\n\n\\bibitem{Polkovnikov} A. Polkovnikov, Ann. Phys. {\\bf 326}, 486 499 (2011). \n\n\\bibitem[{\\citenamefont{Kudo and Deguchi}(2005)}]{Kudo2005}\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Kudo}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Deguchi}},\n  \\bibinfo{journal}{J. Phys. Soc. Jpn.} \\textbf{\\bibinfo{volume}{74}},\n  \\bibinfo{pages}{1992} (\\bibinfo{year}{2005}).\n\n\\bibitem[{\\citenamefont{Santos}(2009)}]{Santos2009JMP}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{J. Math. Phys} \\textbf{\\bibinfo{volume}{50}},\n  \\bibinfo{pages}{095211} (\\bibinfo{year}{2009}); L. F. Santos and M. Rigol, Phys. Rev E {\\bf 81}, 036206 (2010); L. F. Santos and M. Rigol, Phys. Rev E {\\bf 82}, 031130 (2010).\n\n\\bibitem[{\\citenamefont{Gubin and Santos}(2012)}]{Gubin2012}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Gubin}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Am. J. Phys.} \\textbf{\\bibinfo{volume}{80}},\n  \\bibinfo{pages}{246} (\\bibinfo{year}{2012}).\n\n\\bibitem[{not({\\natexlab{c}})}]{noteXX}\n\\bibinfo{note}{Due to degeneracies, a large peak at $s=0$ appears for the {XX}\n  model and the {XXZ} model at the root of unit $\\Delta=1/2$\n  \\cite{Zangara2013}.}\n\n\\bibitem[{\\citenamefont{Guhr et~al.}(1998)\\citenamefont{Guhr,\n  Mueller-Gr\\\"oeling, and Weidenm\\\"uller}}]{Guhr1998}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Guhr}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Mueller-Gr\\\"oeling}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{H.~A.}\n  \\bibnamefont{Weidenm\\\"uller}}, \\bibinfo{journal}{Phys. Rep.}\n  \\textbf{\\bibinfo{volume}{299}}, \\bibinfo{pages}{189} (\\bibinfo{year}{1998}).\n\n\\bibitem[{\\citenamefont{Rufeil-Fiori and Pastawski}(2006)}]{Fiori2006}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Rufeil-Fiori}}\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Pastawski}},\n  \\bibinfo{journal}{Chem. Phys. Lett.} \\textbf{\\bibinfo{volume}{420}},\n  \\bibinfo{pages}{35} (\\bibinfo{year}{2006}).\n\n\\bibitem[{\\citenamefont{Rufeil-Fiori and Pastawski}(2009)}]{Fiori2009}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Rufeil-Fiori}}\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Pastawski}},\n  \\bibinfo{journal}{Physica B} \\textbf{\\bibinfo{volume}{404}},\n  \\bibinfo{pages}{2812 } (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Jittoh et~al.}(2005)\\citenamefont{Jittoh, Shigeki,\n  Sato, Sato, and Takeda}}]{Jittoh2005}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Jittoh}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Shigeki}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Sato}},\n  \\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Sato}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Takeda}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{71}},\n  \\bibinfo{pages}{012109} (\\bibinfo{year}{2005}).\n\n\\bibitem[{not({\\natexlab{d}})}]{noteSUPPL}\n\\bibinfo{note}{See Supplemental Material.}\n\n\\bibitem[{\\citenamefont{Andraschko and Sirker}(2014)}]{Andraschko2014}\n\\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Andraschko}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Sirker}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{89}},\n  \\bibinfo{pages}{125120} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Touchette}(2009)}]{Touchette2009}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Touchette}},\n  \\bibinfo{journal}{Phys. Rep.} \\textbf{\\bibinfo{volume}{478}},\n  \\bibinfo{pages}{1} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Monnai}(2014)}]{Monnai2014}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Monnai}}, \\bibinfo{journal}{J.\n  Phys. Soc. Jpn.} \\textbf{\\bibinfo{volume}{83}}, \\bibinfo{pages}{064001}\n  (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Wigner}(1955)}]{Wigner1955}\n\\bibinfo{author}{\\bibfnamefont{E.~P.} \\bibnamefont{Wigner}},\n  \\bibinfo{journal}{Ann. Math.} \\textbf{\\bibinfo{volume}{62}},\n  \\bibinfo{pages}{548} (\\bibinfo{year}{1955}).\n\n\\bibitem[{\\citenamefont{Casati et~al.}(1996)\\citenamefont{Casati, Chirikov,\n  Guarneri, and Izrailev}}]{Casati1996}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Casati}},\n  \\bibinfo{author}{\\bibfnamefont{B.~V.} \\bibnamefont{Chirikov}},\n  \\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Guarneri}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{223}},\n  \\bibinfo{pages}{430} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Fyodorov et~al.}(1996)\\citenamefont{Fyodorov,\n  Chubykalo, Izrailev, and Casati}}]{Fyodorov1996}\n\\bibinfo{author}{\\bibfnamefont{Y.~V.} \\bibnamefont{Fyodorov}},\n  \\bibinfo{author}{\\bibfnamefont{O.~A.} \\bibnamefont{Chubykalo}},\n  \\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Casati}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{76}},\n  \\bibinfo{pages}{1603} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Mirlin et~al.}(1996)\\citenamefont{Mirlin, Fyodorov,\n  Dittes, Quezada, and Seligman}}]{Mirlin1996}\n\\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}},\n  \\bibinfo{author}{\\bibfnamefont{Y.~V.} \\bibnamefont{Fyodorov}},\n  \\bibinfo{author}{\\bibfnamefont{F.-M.} \\bibnamefont{Dittes}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Quezada}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.~H.} \\bibnamefont{Seligman}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{54}},\n  \\bibinfo{pages}{3221} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Mirlin and Evers}(2000)}]{Mirlin2000}\n\\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Evers}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{62}},\n  \\bibinfo{pages}{7920} (\\bibinfo{year}{2000}).\n\n\\bibitem[{\\citenamefont{Evers and Mirlin}(2008)}]{Evers2008}\n\\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Evers}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}},\n  \\bibinfo{journal}{Rev. Mod. Phys.} \\textbf{\\bibinfo{volume}{80}},\n  \\bibinfo{pages}{1355} (\\bibinfo{year}{2008}).\n\n\\bibitem[{\\citenamefont{Varga}(2002)}]{Varga2002}\n\\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Varga}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{66}},\n  \\bibinfo{pages}{094201} (\\bibinfo{year}{2002}).\n\n\\bibitem[{\\citenamefont{Mazza et~al.}()\\citenamefont{Mazza, Stephan, Canovi,\n  Alba, Brockmann, and Haque}}]{MazzaARXIV}\n\\bibinfo{author}{\\bibfnamefont{P.~P.} \\bibnamefont{Mazza}},\n  \\bibinfo{author}{\\bibfnamefont{J.-M.} \\bibnamefont{Stephan}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Canovi}},\n  \\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Alba}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Brockmann}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Haque}},\n  \\bibinfo{note}{arXiv:1509.04666}.\n\n\\bibitem[{Zan()}]{ZangaraAll}\n\\bibinfo{note}{G. A. \\'Alvarez {\\em et al}, Phys. Rev. Lett. {\\bf 101}, 120503\n  (2008); P. R. Zangara {\\em et al}, Phys. Rev. A {\\bf 86}, 012322 (2012); P.\n  R. Zangara {\\em et al}, Phys. Rev. A {\\bf 88} ,195106 (2013).}\n\n\\bibitem[{\\citenamefont{Campos~Venuti and Zanardi}(2010)}]{Venuti2010}\n\\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Campos~Venuti}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Zanardi}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{81}},\n  \\bibinfo{pages}{022113} (\\bibinfo{year}{2010}).\n  \n\\bibitem{Venuti2011}  L. Campos Venuti, N. T. Jacobson, S. Santra, P. and Zanardi, Phys. Rev. Lett. {\\bf 107}, 010403 (2011).\n\n\\bibitem[{\\citenamefont{H\\\"app\\\"ol\\\"a et~al.}(2012)\\citenamefont{H\\\"app\\\"ol\\\"a,\n  Hal\\'asz, and Hamma}}]{Happola2012}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{H\\\"app\\\"ol\\\"a}},\n  \\bibinfo{author}{\\bibfnamefont{G.~B.} \\bibnamefont{Hal\\'asz}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Hamma}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{85}},\n  \\bibinfo{pages}{032114} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Deguchi et~al.}()\\citenamefont{Deguchi, Giri, and\n  Hatakeyama}}]{DeguchiARXIV}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Deguchi}},\n  \\bibinfo{author}{\\bibfnamefont{P.~R.} \\bibnamefont{Giri}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Hatakeyama}},\n  \\bibinfo{note}{arXiv:1507.07470}.\n\n\\end{thebibliography}\n\n\n\n\\onecolumngrid\n\\vspace*{0.9cm}\n\\begin{center}\n{\\large \\bf Supplemental material for EPAPS} \n\\vskip 0.2 cm\n{\\large \\bf Powerlaw Decays and Thermalization in Isolated Many-Body Quantum Systems} \\\\\n\\vspace{0.7cm}\nMarco T\\'avora$^1$, E. J. Torres-Herrera$^2$, and Lea F. Santos$^1$\\\\\n$^1${\\it Department of Physics, Yeshiva University, New York, New York 10016, USA} \\\\\n$^2${\\it Instituto de F{\\'i}sica, Universidad Aut\\'onoma de Puebla, Apt. Postal J-48, Puebla, Puebla, 72570, Mexico}\n\n\n\n\\end{center}\n\n\n\n\\section{Powerlaw decay caused by spectrum bounds}\n\nThe local density of states (LDOS) for the finite spin-1/2 lattice models that we considered in the main text [Eq.~(2)] \nhas lower, $E_{low}$, and upper, $E_{up}$, energy bounds. The survival probability for a Gaussian LDOS with both bounds is given by\n\n\\newpage\n\\twocolumngrid\n\\begin{eqnarray}\n&&F(t) = \\left| \\frac{e^{ - \\sigma _0^2 t^2/2 + i E_0 t} }{2N}  \\left[    \\text{erf} \\left( \\frac{E_0 - E_{low} + i\\sigma _0^2t}{\\sqrt{2} \\sigma _0 } \\right)   \n\\right. \\right.  \\nonumber \\\\\n&& \\hspace{3.3 cm} \\left. \\left. -  \\text{erf} \\left( \\frac{E_0 - E_{up} + i\\sigma _0^2t}{\\sqrt{2} \\sigma _0 } \\right)  \\right] \\right|^2 , \\nonumber\n\\end{eqnarray}\nwhere $\\text{erf}$ is the error function and ${\\cal N}$ is the normalization constant. At long times, after dropping the oscillations from the sinusoidal term $\\cos [t (E_{up}+E_{low})]$,  the expression becomes\n", "itemtype": "equation", "pos": 2015, "prevtext": "\n\\title{Powerlaw Decays and Thermalization in Isolated Many-Body Quantum Systems}\n\n\\author{Marco T\\'avora$^1$, E. J. Torres-Herrera$^2$, and Lea F. Santos$^1$}\n\\affiliation{$^1$Department of Physics, Yeshiva University, New York, New York 10016, USA}\n\\affiliation{$^2$Instituto de F{\\'i}sica, Universidad Aut\\'onoma de Puebla, Apt. Postal J-48, Puebla, Puebla, 72570, Mexico}\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe provide a general picture of the relaxation process of isolated many-body quantum systems and propose a new indicator of thermalization. The decay of the survival probability of the initial state at short times is faster than exponential when the system is strongly perturbed out of equilibrium. At long times, the evolution necessarily slows down and shows a powerlaw behavior $\\propto t^{-\\gamma}$. \nThe exponent $\\gamma$ depends on the shape and filling of the energy distribution of the initial state; $\\gamma \\geq 2$ indicates ergodic filling and the consequent viability of thermalization. We analyze how the properties of the spectrum, structure of the initial state, and number of particles that interact simultaneously affect the value of $\\gamma$.\n\\end{abstract}\n\n\\pacs{05.70.Ln, 05.45.Mt, 03.65.-w, 02.30.Ik}\n\n\n\n\n\n\\maketitle\n\n\n\nDespite ubiquitous, quantum systems out of equilibrium are much less understood than systems at equilibrium. Advances in this field have benefitted from a symbiotic relationship between theoretical studies and recent experiments on long-time coherent dynamics realized with ultracold atoms~\\cite{Trotzky2012,Fukuhara2013}, trapped ions~\\cite{Jurcevic2014,Richerme2014}, and nuclear magnetic resonance (NMR)~\\cite{Cappellaro2007,Kaur2013}. The present work provides new insights into nonequilibrium quantum dynamics by characterizing the different time scales of the evolution of experimentally accessible integrable and chaotic many-body quantum systems. \n\nOur main quantity of interest is the survival probability (fidelity) of the initial state~\\cite{noteFid},\n\n", "index": 1, "text": "\\begin{equation}\nF(t) \\equiv \\left| \\langle \\Psi(0) | e^{-i H t} | \\Psi(0) \\rangle \\right|^2  \n= \\left|\\sum_{\\alpha} |C_{\\alpha}^{(0)} |^2 e^{-i E_{\\alpha} t}  \\right|^2, \n\\label{eq:fidelity}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"F(t)\\equiv\\left|\\langle\\Psi(0)|e^{-iHt}|\\Psi(0)\\rangle\\right|^{2}=\\left|\\sum_{%&#10;\\alpha}|C_{\\alpha}^{(0)}|^{2}e^{-iE_{\\alpha}t}\\right|^{2},\" display=\"block\"><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><msup><mrow><mo>|</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">Ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></msup><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>|</mo></mrow><mn>2</mn></msup><mo>=</mo><msup><mrow><mo>|</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>α</mi></munder><mrow><msup><mrow><mo stretchy=\"false\">|</mo><msubsup><mi>C</mi><mi>α</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>E</mi><mi>α</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup></mrow></mrow><mo>|</mo></mrow><mn>2</mn></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05807.tex", "nexttext": "\n\nfrom where the $t^{-2}$ powerlaw decay discussed in the Fig.~1 of the main text is evident.\n\n\\subsection{Disordered Spin-1/2 Model}\n\nIn the Fig.~\\ref{fig:supp01} of this supplemental material, we study the decay of the survival probability for the one-dimensional isotropic Heisenberg spin-1/2 system with two-body nearest-neighbor interaction, $L$ sites, and periodic boundary conditions. The Hamiltonian is given by\n\n", "itemtype": "equation", "pos": 51421, "prevtext": "\nwhere $E_{\\alpha} $ are the eigenvalues of the Hamiltonian $H$ that dictates the system evolution and $C_{\\alpha}^{(0)}=\\langle \\psi_{\\alpha} | \\Psi(0) \\rangle$ are the overlaps of the initial state with the eigenstates $|\\psi_{\\alpha} \\rangle $ of $H$. As evident from Eq.~(\\ref{eq:fidelity}), $F(t)$ is the discrete Fourier transform of the energy distribution weighted by the components  $|C_{\\alpha}^{(0)} |^2$, the so-called local density of states (LDOS), $\\rho_0(E) = \\sum_\\alpha |C_{\\alpha}^{(0)}|^2\\delta(E-E_\\alpha)$. Essential information about the system dynamics is thus contained in $\\rho_0(E)$.\n\nFor unstable systems, such as unstable nuclei, $F(t)$ decays exponentially, as observed experimentally. However, deviations from this behavior do exist~\\cite{Raizen}. For very short times, the decay is quadratic, as derived from the expansion $F(t \\ll \\sigma_{0}^{-1})  \\approx 1-\\sigma_{0}^2 t^2$, where $\\sigma_0^2=\\sum_{\\alpha} |C_{\\alpha}^{(0)} |^2 (E_{\\alpha} - E_0)^2$ is the energy variance of the initial state and $E_0= \\sum_{\\alpha} |C_{\\alpha}^{(0)}|^2 E_{\\alpha} $ its energy. It is within this time scale that the quantum Zeno effect may be induced.\n\nAfter the inevitable quadratic behavior, whether $F(t)$ switches or not to an exponential decay depends on the strength of the perturbation that takes the many-body system out of equilibrium. The system may be viewed as initially in an eigenstate of a certain initial Hamiltonian $H_0$, which is abruptly perturbed (quenched), starting the dynamics. The new final Hamiltonian is $H=H_0 + g V$, where $g$ is the strength of the perturbation $V$. The exponential decay is valid in the Fermi golden rule regime, where the typical matrix elements of $gV$ are larger than the mean level spacing but $g<1$, which leads to a Lorentzian LDOS. Perturbations yet stronger, $g\\rightarrow 1$, lead to a Gaussian-shaped LDOS resulting in the Gaussian decay $F(t)= \\exp(-\\sigma_0^2 t^2)$ \\cite{TorresAll2014site,Torres2014PRAb,Torres2014PRE} (see also \\cite{Izrailev2006} and references therein). A Gaussian-enveloped LDOS reflects the density of states of many-body quantum systems with two-body interactions, which is also Gaussian~\\cite{Brody1981,Kota2001,Santos2012PRE,Zangara2013}. The larger concentration of states in the middle of the spectrum results in the dependence of the speed of the evolution on the energy of the initial state. As $E_0$ approaches the middle of the spectrum, the LDOS becomes broader (larger $\\sigma_0$) and better filled, so the dynamics becomes faster~\\cite{Torres2014PRAb, noteFast}.\n\nThe short-time dynamics, already beyond the quadratic decay, does not depend on the regime of the final Hamiltonian, but on the strength of the perturbation. Exponential and Gaussian decays occur in both integrable and chaotic models~\\cite{TorresAll2014site,Torres2014PRAb,Torres2014PRE}. The picture becomes more subtle at long times, where the filling of the LDOS plays a key role. The description of the long-time dynamics and its connection with the viability of thermalization are the main concerns of this work.\n\nAt long times, regardless of how fast the initial evolution is, the dynamics necessarily slows down and a powerlaw behavior $\\propto t^{-\\gamma}$ emerges. We discuss two distinctive causes for this algebraic decay:  \n\n{\\em Case 1} is related to the unavoidable presence of a lower bound in the spectrum, $E_{low}$, even if the system decays into the continuum.  This point was put forward already in 1957 \\cite{Khalfin1958} and in several early works~\\cite{Nussenzweig1961,Ersak1969,Fleming1973,Knight1977,Fonda1978,Sluis1991}. At long-times, the energy bounds lead to the initial state partial reconstruction~\\cite{Campo2011,DelCampoARXIV,MugaBook}. For continuous many-particle models, the dependence of $\\gamma$ on quantum statistics, interaction strength, and number of particles was studied in~\\cite{Campo2011,DelCampoARXIV}. \n\n{\\em Case 2} refers to the onset of correlations in the eigenstates. They appear in disordered systems undergoing localization~\\cite{Chalker1988,Chalker1990,Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011} and, as argued here, are present also in clean systems.\n\nMost studies of Case 1 assume that the spectrum and therefore $\\rho_0(E)$ are continuous, so an integral substitutes the sum  in Eq.~(\\ref{eq:fidelity}). In this case, it follows from the Riemann-Lebesgue lemma~\\cite{Fock1947,Khalfin1958} that a necessary and sufficient condition for the survival probability to go to zero at $t\\rightarrow \\infty$ is that the LDOS be absolutely integrable, that is, for any energy interval $\\Delta E$ within the spectrum, $\\int_{\\Delta E} {\\rho_0 (E)dE\\mathop  \\to \\limits^{\\Delta E \\to 0} 0} \\Leftrightarrow F(t\\rightarrow \\infty) \\rightarrow 0$.\n\n The exponents of the algebraic decays in Case 1 are derived from asymptotic expansions of the integral form of Eq.~(\\ref{eq:fidelity}), assuming that $\\rho_0(E)$ is absolutely integrable and that its derivatives exist and are continuous in $[E_{low}, \\infty]$. Two scenarios are identified~\\cite{Urbanowski2009}:\n(i) If $\\lim _{E\\rightarrow E_{low}} \\rho_0(E)>0$, then for long times $F(t) \\propto t^{-2}$. (ii) If $\\rho_0(E)$ decays abruptly close to the lower bound, such that $\\rho_0(E) = (E-E_{low})^{\\xi} \\eta(E)$,  $0<\\xi<1$, and $\\lim _{E\\rightarrow E_{low}} \\eta(E)>0$, then $F(t) \\propto t^{-2(\\xi+1)}$. \n\n\nIn Case 2, the powerlaw exponent of the survival probability is obtained from the correlation function $C(\\omega ) \\equiv  \\sum_{\\alpha ,\\beta } | C_{\\beta}^{(0)} |^2 | C_{\\alpha}^{(0)} |^2 \\delta (E_{\\alpha } - E_{\\beta } - \\omega )  $ contained in $F(t)  = \\int_{ - \\infty }^\\infty  d\\omega e^{i\\omega t} C(\\omega ) $. A powerlaw decay $C(\\omega \\rightarrow 0 ) \\propto \\omega^{\\gamma -1} $, with $\\gamma<1$, leads to $F(t) \\propto t^{-\\gamma}$ \\cite{Chalker1988,Chalker1990,Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011}. The exponent $\\gamma$ measures how much correlated the components of the initial state are. Equivalently, $\\gamma$ can be obtained from the scaling analysis of the inverse participation ratio of the initial state projected on the energy eigenbasis, $\\text{IPR}_{0}\\equiv \\sum_{\\alpha} |C_{\\alpha}^{(0)}|^4$. The relationship between $\\text{IPR}_{0}$ and $\\gamma$ has been extensively investigated in the context of  Anderson localization~\\cite{Ketzmerick1992,Huckestein1994,Huckestein1999} and, more recently, many-body localization~\\cite{Torres2015,Torres2015BJP}. \n\nHere, we analyze how $\\gamma$ depends on the shape and filling of the LDOS for finite many-body quantum systems described by clean lattice models. The determining factors are the properties of the spectrum, structure of the initial state, and number of particles that interact simultaneously. We show that when $\\rho_0(E)$ is ergodically filled, which is equivalent to becoming absolutely integrable as the system size increases, Case 1 above holds. Case 1(i) emerges for realistic systems with few-body interactions and Case 1(ii) is illustrated for full random matrices (FRM), which, despite unphysical, provide an upper bound for $\\gamma$. Case 2 is associated with fragmented LDOS. We show that the analysis developed for disordered systems undergoing localization can be extended to integrable noninteracting models, where the LDOS is typically sparse. \n\nWe argue that the value of the powerlaw exponent is an indicator of the viability of thermalization, since it reflects how well filled $\\rho_0(E)$ is. Thermalization stems from the ergodic filling of the LDOS~\\cite{Santos2011PRL,Santos2012PRL,Santos2012PRE,Torres2013,He2013,RigolARXIV}. When the LDOS is a smooth function of energy, the diagonal entropy, which is the entropy of a quenched system~\\cite{Polkovnikov}, coincides with the thermodynamic entropy~\\cite{Santos2011PRL,RigolARXIV}.\n\n\n\n{\\em System Model and Initial States.--} We consider one-dimensional (1D) spin-1/2 models with $L$ sites. They contain nearest-neighbor (NN) and possibly also next-nearest-neighbor (NNN) couplings. The Hamiltonian is\n\n\\begin{eqnarray}\n&&H = H_{NN} + \\lambda \\; H_{NNN}  ,\n\\label{ham} \\\\\n&& H_{NN} = \\sum_{n} J \\left(S_n^x S_{n+1}^x + S_n^y S_{n+1}^y +\\Delta S_n^z S_{n+1}^z \\right) \\;,\n\\nonumber \\\\\n&& H_{NNN} = \\sum_{n} J \\left(S_n^x S_{n+2}^x + S_n^y S_{n+2}^y +\\Delta S_n^z S_{n+2}^z \\right) \\;.\n\\nonumber \n\\end{eqnarray}\nAbove,  $\\hbar=1$ and $S^{x,y,z}_n$ are the spin operators on site $n$. The coupling strength $J$, the anisotropy parameter $\\Delta$, and the ratio $\\lambda$ between NNN and NN couplings are positive. $J=1$ sets the energy scale. The Hamiltonian conserves total spin in the $z$-direction ${\\cal S}^z$; we work with the largest subspace  ${\\cal S}^z=0$ with dimension ${\\cal D}=L!/(L/2)!^2$.\n\nThe integrable limits of $H$ include the noninteracting XX ($\\Delta = \\lambda = 0$) and the interacting XXZ ($\\Delta \\neq 0$, $\\lambda =0$) models. The system becomes chaotic as $\\lambda $ increases~\\cite{Kudo2005,Santos2009JMP,Gubin2012} and the level spacing distribution changes from a Shnirelman peak or Poisson shape~\\cite{noteXX} to a Wigner-Dyson form~\\cite{Guhr1998}.\n\nThe initial states that are mainly considered here are site-basis vectors, where the spin on each site either points up or down in the $z$-direction. They include the experimentally accessible N\\'eel state, $|\\text{NS} \\rangle = |\\uparrow \\downarrow \\uparrow \\downarrow \\uparrow \\downarrow \\uparrow \\downarrow   \\ldots \\rangle $, and the domain wall state,  $|\\text{DW} \\rangle = |\\uparrow \\uparrow \\uparrow \\ldots \\downarrow \\downarrow  \\downarrow  \\ldots \\rangle $, both extensively used in studies of the dynamics of integrable spin models. \n\n\n\n\n{\\em Case 1: Powerlaw decay caused by spectrum bounds.--} The scenario of site-basis vectors evolving under Hamiltonian (\\ref{ham}) corresponds to a strong perturbation, where the anisotropy parameter is quenched from $\\Delta \\rightarrow \\infty$ to a finite value. The LDOS is therefore expected to have a Gaussian shape, as indeed shown in Fig.~\\ref{fig:chaos}  (a) for the N\\'eel state under the chaotic Hamiltonian with $\\lambda=1$.  The consequent Gaussian decay of $F(t)$ is seen in Fig.~\\ref{fig:chaos}  (b) up to $t\\sim 2$. It agrees extremely well with the analytical expression $F(t)= \\exp(-\\sigma_0^2 t^2)$ \\cite{TorresAll2014site}. \n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=3.3in]{Fig01new.eps}\n\\caption{(Color online) LDOS (a), $F(t)$ (b) and $f(t)$ (c) for the N\\'eel state evolving under the chaotic $H$ (\\ref{ham}) with $\\lambda=1$, $\\Delta=1/2$, open boundaries. \nIn  (a): numerical LDOS (shaded area) and Gaussian envelope (solid line) with $\\sigma_0=\\sqrt{L-1}/2$ and $E_0=\\Delta[-(L-1)+(L-2)\\lambda]/4$; $L=16$ \\cite{TorresAll2014site}. In (b): log-log plot for the numerical $F(t)$ (solid), its time average  (dashed), analytical Gaussian decay (dotted), and $\\bar{F}=\\text{IPR}_{0}$ (horizontal line); $L=24$. In (c): $f(t)$ for $L=22$ (light), $L=24$ (dark), and $-(1/L)\\ln (t^{-2})$ (dashed).}\n\\label{fig:chaos}  \n\\end{figure}\n\nThe minimum value reached by $F(t)$ during the Gaussian decay is significantly below the infinite time average $\\bar{F}=\\text{IPR}_{0}$. This is caused by destructive interferences between the pure Gaussian decay of an unbounded LDOS and the probability for the initial state reconstruction due to the energy bounds. The point in time where this so-called survival collapse~\\cite{Fiori2006,Fiori2009}  occurs increases monotonically with the largest ratio $(E_{low,up}-E_0)/\\sigma_0$, where $E_{up}$ is the LDOS upper bound~\\cite{Jittoh2005}.\n\nThe Fourier transform of a Gaussian LDOS with lower and upper bounds leads at long times to $F(t) \\propto t^{-2}$ \n(see the exact expression in \\cite{noteSUPPL}). In Fig.~\\ref{fig:chaos}  (b), despite fluctuations caused by finite-size effects, we indeed observe a powerlaw decay $\\propto t^{-2}$ until equilibration.\nThis behavior is supported by the time average $\\frac{1}{t} \\int_{t_0}^t  F(\\tau) d\\tau $ shown with the dashed line in the figure. The exponent $\\gamma=2$ indicates that the LDOS is ergodically filled, as corroborated also by computing the inverse participation ratio of the initial state. We have found that $\\text{IPR}_{0} \\propto {\\cal D}^{-1}$, as  in full random matrices.\n\nTo compare different system sizes, we show in Fig.~\\ref{fig:chaos} (c), the rescaled survival probability $f(t) = - (1/L) \\ln F(t)$ \\cite{Andraschko2014}. For $L\\gg 1$, this quantity is independent of $L$ \\cite{Touchette2009}. The $t^{-2}$ behavior is once again evident. We found $\\gamma=2$ also for periodic boundary conditions, chaotic models with different values of $\\lambda$ and $\\Delta$, including $\\Delta=0$, other initial states, and for the XXZ model with small random magnetic fields (see figures in \\cite{noteSUPPL}).  A $t^{-2}$ decay has also been speculated for the chaotic Ising model with longitudinal and transverse fields~\\cite{Monnai2014}. \n\nOur results for the long-time decay of $F(t)$ fall within Case 1(i). From the analytical expression $F(t \\gg \\sigma_0^{-1}) \\simeq {\\cal A} t^{-2} $ \\cite{noteSUPPL}, where ${\\cal A}$ depends on $L$, $E_0$, and the energy bounds, it is clear that for the largest system size, the survival probability goes to zero as $t\\rightarrow \\infty$, indicating that the LDOS is absolutely integrable.\nThe exponent $\\gamma=2$ is therefore an indicator of the ergodic filling of the energy distribution of the initial state and consequently of the viability of thermalization. \n\nAlgebraic decays faster than $t^{-2}$ also signal the ergodic filling of the LDOS. They are possible if instead of two-body interactions, many-body random interactions are included. As the number of particles that interact simultaneously grows, increasing the number of uncorrelated nonzero elements in the Hamiltonian matrix, the density of states transitions from Gaussian to semicircle~\\cite{Brody1981}. This transition is reflected also in the shape of the LDOS \\cite{TorresAll2014site,Wigner1955,Casati1996,Fyodorov1996}. The Fourier transform of a semicircle leads to $F(t) =[{\\cal J}_1( 2 \\sigma_{0} t)]^2/(\\sigma_{0}^2 t^2)$, where ${\\cal J}_1$ is the Bessel function of the first kind~\\cite{TorresAll2014site}. The decay at short times is faster than Gaussian and the asymptotic expansion for long times reveals a powerlaw decay with $\\gamma =3$, $F(t\\gg \\sigma_{0}^{-1}) \\simeq [1 - \\sin(4 \\sigma_{0} t)]/(2 \\pi \\sigma_{0}^3 t^3)$. This scenario coincides with Case 1(ii), where for the semicircle, $\\xi=1/2$, $\\eta(E) = (2\\pi \\sigma_0^2)^{-1} (2\\sigma_0 - E)^{1/2}$, and $E_{low}=-2\\sigma_0$.\nTo illustrate the increase of the value of the powerlaw exponent from 2 to 3, we consider a powerlaw band random matrix (PBRM) \\cite{Mirlin1996,Mirlin2000,Evers2008}. PBRMs have being extensively used in studies of the metal-insulator transition.\n\nDespite the success of FRM in the statistical analysis of complex systems spectra, they imply the unphysical scenario of all particles interacting simultaneously. Band random matrices were introduced~\\cite{Wigner1955} in an effort to better approach random matrices to real systems, for which the Hamiltonians written in a mean field basis are indeed banded. In the PBRMs that we consider~\\cite{Varga2002},  time reversal symmetry is preserved and the elements are real random numbers from a Gaussian distribution, so that $\\langle H_{nn}\\rangle = 0 $, $\\langle H_{nn}^2 \\rangle =2 $, $\\langle H_{nm}^2 \\rangle = 1/ [1+|(n-m)/b|^2] $ for $n\\neq m$, and $b>1$. The value of $b$ determines how fast the elements decrease as they move away from the diagonal. For $b\\rightarrow \\infty$, we recover a FRM from a Gaussian orthogonal ensemble~\\cite{Guhr1998}. \n\nIn Fig.~\\ref{fig:pbrm} (a), we show the survival probability for PBRMs with different values of $b$. As $b$ grows from $50$ to ${\\cal D}$ and the LDOS transitions from Case 1(i) to Case 1(ii), the exponent $\\gamma$ increases from $\\sim 2$ to $3$. In contrast, as $b$ decreases below $50$, the eigenstates become less spread out, the LDOS more sparse, and $\\gamma$ decreases below $2$.  PBRMs therefore provide a general picture of the behavior of the survival probability, covering all values of $\\gamma$, without restriction to a specific model.\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=2.7in]{Fig02new.eps}\n\\caption{(Color online) $F(t)$ for basis vectors evolving under PBRMs with $b=0.1,0.5,1,2,5,10,20,50,100,3000 $ (solid lines) from top to bottom. They correspond respectively to the fitted $\\gamma =0.14, 0.50, 0.63, 0.71, 1.15, 1.46, 1.79, 2.15, 2.40, 2.90$ (dashed lines). $F(t) =[{\\cal J}_1( 2 \\sigma_{0} t)]^2/(\\sigma_{0}^2 t^2)$ (dotted line); ${\\cal D}=3432$; 100 realizations and 10\\% of initial states with $E_0 \\sim 0$.\n}\n\\label{fig:pbrm}  \n\\end{figure}\n\n\n\n{\\em Case 2: Powerlaw decay caused by correlations.--}\nPowerlaw exponents smaller than 1 have been verified in disordered systems undergoing localization. Such small powerlaw exponents reflect the onset of multifractal eigenstates and of correlations of eigenstates of different energies~\\cite{Ketzmerick1992,Huckestein1994,Huckestein1999,Kravtsov2011,Torres2015,Torres2015BJP} and are thus associated with lack of ergodicity.\n\nHere, we show that  $\\gamma<1$ appears also for high energy states projected onto clean noninteracting integrable models. This is the case of site-basis vectors evolving under the XX model, for which $E_0=0$.\n\nLet us start with the N\\'eel state evolving under a closed XX chain, where $F(t) = \\exp \\sum _{n=1}^{L/2} \\ln \\cos^2 \\{  t \\cos[(2 n+1)\\pi/L]\\}$~\\cite{Andraschko2014,MazzaARXIV}.  For the largest system size and long times, we find that $F(t)\\simeq \\exp[-L (\\ln2 - t^{-1/2}/2)] $. The $t^{-1/2}$ behavior for $L/\\sqrt{t} \\rightarrow 0$ is shown with a dashed line in Fig.~\\ref{fig:XX}(a). \n\nNotice from the expression above that $F(t)$ does not go to zero for $t\\rightarrow \\infty$. This implies that $\\rho_0(E)$ is not absolutely integrable and therefore thermalization should not occur. This is corroborated by the direct analysis of the LDOS. Among the total $L!/(L/2!)^2$ components of the N\\'eel state in the XX model, only $2^{L/2}$ are nonzero and they are all equal,  $|C_{\\alpha}^{(0)}|^2 = 2^{-L/2} $ \\cite{MazzaARXIV}. The nonzero components are spread out in energy, resulting in a very sparse LDOS, although the envelope is still Gaussian. Moreover, the percentage of $|C_{\\alpha}^{(0)}|^2\\neq 0$ for large $L$ is $2^{ - (L + 1)/2}\\sqrt {\\pi L}$, which decreases with system size. These results demonstrate the lack of ergodicity of the LDOS.\n\nSimilarly to what is done in disordered systems~\\cite{Torres2015,Torres2015BJP}, the exponent $\\gamma=1/2$ can also be obtained from the scaling analysis of the $\\text{IPR}_0$. Since $\\text{IPR}_0=2^{-L/2}$, from the Stirling approximation, $\\ln \\text{IPR}_0 = \\ln[L!/(L/2)!^2]^{-\\gamma} \\Rightarrow \\gamma=1/2$. \n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics*[width=3.3in]{Fig03new.eps}\n\\caption{(Color online) Analytical $f(t)$ (solid line) and $f(t) \\propto \\gamma \\ln t$ (dashed) for three initial states evolving under the closed XX model: $|\\text{NS}\\rangle$, $\\gamma=0.5$,  $L=150$ (a); $|\\text{DW}\\rangle$, $\\gamma=0.8$, $L=30$ (b); and random vector, $\\gamma=2$, average over $L=26, 28, 30, 32$  (c). \n}\n\\label{fig:XX}  \n\\end{figure}\n\nFor the domain wall state, we obtained \n\\begin{eqnarray}\n&&F(t)=\\frac{2^{2+(L-2)L/2}}{L^{L/2}} \\left| \\sum_{\\{ n_l \\}'}  \\left\\{ \n\\cos \\left[ t \\sum_{i=1}^{L/2} \\cos \\left( \\frac{\\pi n_i}{L} \\right) \\right]  \\right. \\right.\n\\nonumber \\\\\n&&\\left. \\left. \\prod_{i=1}^{L/2} \\prod_{j=i+1}^{L/2}  \\sin^2 \\left( \\frac{\\pi (n_i - n_j)}{2L}  \\right)\n\\right\\} \\right|^2 \\nonumber ,\n\\end{eqnarray}\nwhere the set $\\{ n_l \\}'$ has $L/2$ elements and consists of all combinations of the first $L$ odd numbers in $\\{1, 3, \\ldots, 2L-1\\}$. This result is shown in Fig.~\\ref{fig:XX} (b) together with the long-time behavior $F(t) \\propto t^{-0.8}$. The exponent $\\gamma=0.8$ is also obtained from the scaling analysis of $\\text{IPR}_0$ and our studies of the components $|C_{\\alpha}^{(0)}|^2$ confirm the expected sparsity of the LDOS. Thus, $|\\text{DW}\\rangle$ in the XX model should not thermalize.\n\nIn Fig.~\\ref{fig:XX} (c), we consider an unpolarized random initial state with $C_{\\alpha}^{(0)}=e^{2\\pi i \\phi}/\\sqrt{{\\cal D}}$, where $\\phi$ is a uniformly distributed random variable. This is equivalent to a mixed state of infinite temperature~\\cite{Zangara2013,ZangaraAll}. While such states are not realistic for experiments with cold atoms, they are relevant for NMR experiments done at room temperature. By choice, the LDOS is ergodically filled, which anticipates the observed $t^{-2}$ decay. Thermalization is thus expected, despite the fact that the model is integrable. This example serves as an illustration of the crucial role of the interplay between initial state and Hamiltonian in studies of nonequilibrium dynamics and thermalization.\n\nThere also exists  analytical expressions for $F(t)$ for ground states evolving under the Ising model in a transverse field~\\cite{Venuti2010} and the XY model~\\cite{Venuti2011,Happola2012}. For both integrable models, we found $\\gamma=3/2$, which does not belong to the two Cases investigated in this work. Nevertheless, the results for $F(t)$ also indicate lack of ergodicity. In these two examples, as for the N\\'eel state in the XX model, the survival probability for the largest system size at long times is $\\propto  \\exp(L t^{-\\gamma})$, which does not go to zero for $t\\rightarrow \\infty$, implying that $\\rho_0(E)$ is not absolutely integrable. \n\nFor the interacting XXZ model,  a $t^{-2}$ decay was observed for $\\Delta=1$ and initial states corresponding to superpositions of equally weighted Bethe-ansatz eigenstates in a window of energy~\\cite{DeguchiARXIV}. It is likely, however, that $\\gamma<2$ will emerge for initial states leading to sparse LDOS. This must be the case of the quenches into the XXZ model studied in~\\cite{RigolARXIV}, where thermalization did not occur.\n\n\n\n\n{\\em Conclusions.--} We have shown that for isolated lattice many-body quantum systems, integrable or chaotic, the long-time decay of the survival probability is algebraic, $F(t)\\propto t^{-\\gamma}$. From the value of $\\gamma$, we infer how well filled the energy distribution of the initial state is.  Exponents $\\gamma \\geq 2$  imply ergodicity and therefore the viability of thermalization.\n\n\n\n\n\\begin{acknowledgments}\nThis work was supported by the NSF grant No.~DMR-1147430 and funding from Yeshiva University. EJTH acknowledges funding from CONACYT and PRODEP-SEP, Mexico. We thank Adolfo del Campo and Yevgeny Bar Lev for very useful discussions and Marcos Rigol for valuable suggestions.\n\\end{acknowledgments}\n\n\n\n\n\\begin{thebibliography}{65}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname bibnamefont\\endcsname\\relax\n  \\def\\bibnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname bibfnamefont\\endcsname\\relax\n  \\def\\bibfnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname citenamefont\\endcsname\\relax\n  \\def\\citenamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem[{\\citenamefont{Trotzky et~al.}(2012)\\citenamefont{Trotzky, Chen,\n  Flesch, McCulloch, Schollw\\\"ock, Eisert, and Bloch}}]{Trotzky2012}\n\\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Trotzky}},\n  \\bibinfo{author}{\\bibfnamefont{Y.-A.} \\bibnamefont{Chen}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Flesch}},\n  \\bibinfo{author}{\\bibfnamefont{I.~P.} \\bibnamefont{McCulloch}},\n  \\bibinfo{author}{\\bibfnamefont{U.}~\\bibnamefont{Schollw\\\"ock}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Eisert}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Bloch}},\n  \\bibinfo{journal}{Nature Phys.} \\textbf{\\bibinfo{volume}{8}},\n  \\bibinfo{pages}{325} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Fukuhara et~al.}(2013)\\citenamefont{Fukuhara, Kantian,\n  Endres, Cheneau, Schausz, Hild, Bellem, Schollw\\\"ock, Giamarchi, Gross\n  et~al.}}]{Fukuhara2013}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Fukuhara}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Kantian}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Endres}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Cheneau}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Schausz}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Hild}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Bellem}},\n  \\bibinfo{author}{\\bibfnamefont{U.}~\\bibnamefont{Schollw\\\"ock}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Giamarchi}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Gross}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Nat. Phys.}\n  \\textbf{\\bibinfo{volume}{9}}, \\bibinfo{pages}{235} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Jurcevic et~al.}(2014)\\citenamefont{Jurcevic, Lanyon,\n  Hauke, Hempel, Zoller, Blatt, and Roos}}]{Jurcevic2014}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Jurcevic}},\n  \\bibinfo{author}{\\bibfnamefont{B.~P.} \\bibnamefont{Lanyon}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Hauke}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Hempel}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Zoller}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Blatt}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{C.~F.} \\bibnamefont{Roos}},\n  \\bibinfo{journal}{Nature} \\textbf{\\bibinfo{volume}{511}},\n  \\bibinfo{pages}{202} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Richerme et~al.}(2014)\\citenamefont{Richerme, Gong,\n  Lee, Senko, Smith, Foss-Feig, Michalakis, Gorshkov, and\n  Monroe}}]{Richerme2014}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Richerme}},\n  \\bibinfo{author}{\\bibfnamefont{Z.-X.} \\bibnamefont{Gong}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Lee}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Senko}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Smith}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Foss-Feig}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Michalakis}},\n  \\bibinfo{author}{\\bibfnamefont{A.~V.} \\bibnamefont{Gorshkov}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Monroe}},\n  \\bibinfo{journal}{Nature} \\textbf{\\bibinfo{volume}{511}},\n  \\bibinfo{pages}{198} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Cappellaro et~al.}(2007)\\citenamefont{Cappellaro,\n  Ramanathan, and Cory}}]{Cappellaro2007}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Cappellaro}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Ramanathan}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{D.~G.} \\bibnamefont{Cory}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{99}},\n  \\bibinfo{pages}{250506} (\\bibinfo{year}{2007}).\n\n\\bibitem[{\\citenamefont{Kaur et~al.}(2013)\\citenamefont{Kaur, Ajoy, and\n  Cappellaro}}]{Kaur2013}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Kaur}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ajoy}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Cappellaro}},\n  \\bibinfo{journal}{New J. Phys.} \\textbf{\\bibinfo{volume}{15}},\n  \\bibinfo{pages}{093035} (\\bibinfo{year}{2013}).\n\n\\bibitem[{not({\\natexlab{a}})}]{noteFid}\n\\bibinfo{note}{$F(t)$ is also called return probability or nondecay\n  probability. The term Loschmidt echo is not appropriate, since no time\n  reversal is involved.}\n\n\\bibitem{Raizen}  S. R. Wilkinson, C. F. Bharucha, M. C. Fischer, K. W. Madison, P. R. Morrow, Q. Niu, B. Sundaram and M. G. Raizen, Nature {\\bf 387}, 575 (1997).\n\n\\bibitem[{Tor()}]{TorresAll2014site}\n\\bibinfo{note}{E. J. Torres-Herrera and L. F. Santos, Phys. Rev. A {\\bf 89},\n  043620 (2014);  AIP Conf. Proc. {\\bf 1619}, 171 (2014); E. J. Torres-Herrera, M. Vyas, and L. F. Santos, New J. Phys.\n  {\\bf 16}, 063010 (2014), E. J. Torres-Herrera, D. Kollmar, and L. F. Santos,\n  Phys. Scr. T {\\bf 165}, 014018 (2015).}\n\n\\bibitem[{\\citenamefont{Torres-Herrera and\n  Santos}(2014{\\natexlab{a}})}]{Torres2014PRAb}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. A}\n  \\textbf{\\bibinfo{volume}{90}}, \\bibinfo{pages}{033623}\n  (\\bibinfo{year}{2014}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and\n  Santos}(2014{\\natexlab{b}})}]{Torres2014PRE}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{89}}, \\bibinfo{pages}{062110}\n  (\\bibinfo{year}{2014}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Izrailev and\n  Casta{\\~{n}}eda-Mendoza}(2006)}]{Izrailev2006}\n\\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Casta{\\~{n}}eda-Mendoza}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{350}},\n  \\bibinfo{pages}{355} (\\bibinfo{year}{2006}).\n\n\\bibitem[{\\citenamefont{Brody et~al.}(1981)\\citenamefont{Brody, Flores, French,\n  Mello, Pandey, and Wong}}]{Brody1981}\n\\bibinfo{author}{\\bibfnamefont{T.~A.} \\bibnamefont{Brody}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Flores}},\n  \\bibinfo{author}{\\bibfnamefont{J.~B.} \\bibnamefont{French}},\n  \\bibinfo{author}{\\bibfnamefont{P.~A.} \\bibnamefont{Mello}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Pandey}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{S.~S.~M.} \\bibnamefont{Wong}},\n  \\bibinfo{journal}{Rev. Mod. Phys} \\textbf{\\bibinfo{volume}{53}},\n  \\bibinfo{pages}{385} (\\bibinfo{year}{1981}).\n\n\\bibitem[{\\citenamefont{Kota}(2001)}]{Kota2001}\n\\bibinfo{author}{\\bibfnamefont{V.~K.~B.} \\bibnamefont{Kota}},\n  \\bibinfo{journal}{Phys. Rep.} \\textbf{\\bibinfo{volume}{347}},\n  \\bibinfo{pages}{223} (\\bibinfo{year}{2001}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2012{\\natexlab{a}})\\citenamefont{Santos,\n  Borgonovi, and Izrailev}}]{Santos2012PRE}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Borgonovi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{F.~M.}\n  \\bibnamefont{Izrailev}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{85}}, \\bibinfo{pages}{036209}\n  (\\bibinfo{year}{2012}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Zangara et~al.}(2013)\\citenamefont{Zangara, Dente,\n  Torres-Herrera, Pastawski, Iucci, and Santos}}]{Zangara2013}\n\\bibinfo{author}{\\bibfnamefont{P.~R.} \\bibnamefont{Zangara}},\n  \\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Dente}},\n  \\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}},\n  \\bibinfo{author}{\\bibfnamefont{H.~M.} \\bibnamefont{Pastawski}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Iucci}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{88}},\n  \\bibinfo{pages}{032913} (\\bibinfo{year}{2013}).\n\n\\bibitem[{not({\\natexlab{b}})}]{noteFast}\n\\bibinfo{note}{Faster than Gaussian decays emerge in full random\n  matrices~\\cite{TorresAll2014site,Torres2014PRAb} and real systems with\n  bimodal density of states~\\cite{Torres2014PRAb}.}\n\n\\bibitem[{\\citenamefont{Khalfin}(1958)}]{Khalfin1958}\n\\bibinfo{author}{\\bibfnamefont{L.~A.} \\bibnamefont{Khalfin}},\n  \\bibinfo{journal}{Sov. Phys. JETP} \\textbf{\\bibinfo{volume}{6}},\n  \\bibinfo{pages}{1053} (\\bibinfo{year}{1958}).\n\n\\bibitem[{\\citenamefont{Nussenzweig}(1961)}]{Nussenzweig1961}\n\\bibinfo{author}{\\bibfnamefont{H.~M.} \\bibnamefont{Nussenzweig}},\n  \\bibinfo{journal}{Nuovo Cim. X} \\textbf{\\bibinfo{volume}{20}},\n  \\bibinfo{pages}{694} (\\bibinfo{year}{1961}).\n\n\\bibitem[{\\citenamefont{Ersak}(1969)}]{Ersak1969}\n\\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Ersak}}, \\bibinfo{journal}{Sov.\n  J. Nucl. Phys.} \\textbf{\\bibinfo{volume}{9}}, \\bibinfo{pages}{263}\n  (\\bibinfo{year}{1969}).\n\n\\bibitem[{\\citenamefont{Fleming}(1973)}]{Fleming1973}\n\\bibinfo{author}{\\bibfnamefont{G.~N.} \\bibnamefont{Fleming}},\n  \\bibinfo{journal}{Il Nuovo Cimento} \\textbf{\\bibinfo{volume}{16}},\n  \\bibinfo{pages}{232} (\\bibinfo{year}{1973}).\n\n\\bibitem[{\\citenamefont{Knight}(1977)}]{Knight1977}\n\\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Knight}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{61}},\n  \\bibinfo{pages}{25 } (\\bibinfo{year}{1977}).\n\n\\bibitem[{\\citenamefont{Fonda et~al.}(1978)\\citenamefont{Fonda, Ghirardi, and\n  Rimini}}]{Fonda1978}\n\\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Fonda}},\n  \\bibinfo{author}{\\bibfnamefont{G.~C.} \\bibnamefont{Ghirardi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Rimini}},\n  \\bibinfo{journal}{Rep. Prog. Phys.,} \\textbf{\\bibinfo{volume}{41}},\n  \\bibinfo{pages}{587} (\\bibinfo{year}{1978}).\n\n\\bibitem[{\\citenamefont{Sluis and Gislason}(1991)}]{Sluis1991}\n\\bibinfo{author}{\\bibfnamefont{K.~M.} \\bibnamefont{Sluis}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{E.~A.} \\bibnamefont{Gislason}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{43}},\n  \\bibinfo{pages}{4581} (\\bibinfo{year}{1991}).\n\n\\bibitem[{\\citenamefont{del Campo}(2011)}]{Campo2011}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{del Campo}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{84}},\n  \\bibinfo{pages}{012113} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{del Campo}()}]{DelCampoARXIV}\nA. del Campo,  New J. Phys. {\\bf 18}, 015014 (2016).\n\n\\bibitem[{\\citenamefont{Muga et~al.}(2009)\\citenamefont{Muga, Ruschhaupt, and\n  del Campo}}]{MugaBook}\n\\bibinfo{author}{\\bibfnamefont{J.~G.} \\bibnamefont{Muga}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ruschhaupt}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{del\n  Campo}}, \\emph{\\bibinfo{title}{Time in Quantum Mechanics, vol. 2}}\n  (\\bibinfo{publisher}{Springer}, \\bibinfo{address}{London},\n  \\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Chalker and Daniell}(1988)}]{Chalker1988}\n\\bibinfo{author}{\\bibfnamefont{J.~T.} \\bibnamefont{Chalker}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{G.~J.} \\bibnamefont{Daniell}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{61}},\n  \\bibinfo{pages}{593} (\\bibinfo{year}{1988}).\n\n\\bibitem[{\\citenamefont{Chalker}(1990)}]{Chalker1990}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Chalker}},\n  \\bibinfo{journal}{Physica A} \\textbf{\\bibinfo{volume}{167}},\n  \\bibinfo{pages}{253 } (\\bibinfo{year}{1990}).\n\n\\bibitem[{\\citenamefont{Ketzmerick et~al.}(1992)\\citenamefont{Ketzmerick,\n  Petschel, and Geisel}}]{Ketzmerick1992}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Ketzmerick}},\n  \\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Petschel}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Geisel}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{69}},\n  \\bibinfo{pages}{695} (\\bibinfo{year}{1992}).\n\n\\bibitem[{\\citenamefont{Huckestein and Schweitzer}(1994)}]{Huckestein1994}\n\\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Huckestein}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Schweitzer}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{72}},\n  \\bibinfo{pages}{713} (\\bibinfo{year}{1994}).\n\n\\bibitem[{\\citenamefont{Huckestein and Klesse}(1999)}]{Huckestein1999}\n\\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Huckestein}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Klesse}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{59}},\n  \\bibinfo{pages}{9714} (\\bibinfo{year}{1999}).\n\n\\bibitem[{\\citenamefont{Kravtsov et~al.}(2011)\\citenamefont{Kravtsov, Ossipov,\n  and Yevtushenko}}]{Kravtsov2011}\n\\bibinfo{author}{\\bibfnamefont{V.~E.} \\bibnamefont{Kravtsov}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ossipov}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{O.~M.} \\bibnamefont{Yevtushenko}},\n  \\bibinfo{journal}{J. Phys. A} \\textbf{\\bibinfo{volume}{44}},\n  \\bibinfo{pages}{305003} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Fock and Krylov}(1947)}]{Fock1947}\n\\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Fock}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{N.}~\\bibnamefont{Krylov}},\n  \\bibinfo{journal}{J. Phys. USSR} \\textbf{\\bibinfo{volume}{11}},\n  \\bibinfo{pages}{112 } (\\bibinfo{year}{1947}).\n\n\\bibitem[{\\citenamefont{Urbanowski}(2009)}]{Urbanowski2009}\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Urbanowski}},\n  \\bibinfo{journal}{Eur. Phys. J. D} \\textbf{\\bibinfo{volume}{54}},\n  \\bibinfo{pages}{25} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and Santos}(2015)}]{Torres2015}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. B}\n  \\textbf{\\bibinfo{volume}{92}}, \\bibinfo{pages}{014208}\n  (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera\n  et~al.}(2015)\\citenamefont{Torres-Herrera, T\\'avora, and\n  Santos}}]{Torres2015BJP}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{T\\'avora}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Braz. J. Phys.} \\textbf{\\bibinfo{volume}{1}},\n  \\bibinfo{pages}{1} (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2011)\\citenamefont{Santos, Polkovnikov,\n  and Rigol}}]{Santos2011PRL}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Polkovnikov}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{107}},\n  \\bibinfo{pages}{040601} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Santos et~al.}(2012{\\natexlab{b}})\\citenamefont{Santos,\n  Borgonovi, and Izrailev}}]{Santos2012PRL}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Borgonovi}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{F.~M.}\n  \\bibnamefont{Izrailev}}, \\bibinfo{journal}{Phys. Rev. Lett.}\n  \\textbf{\\bibinfo{volume}{108}}, \\bibinfo{pages}{094102}\n  (\\bibinfo{year}{2012}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Torres-Herrera and Santos}(2013)}]{Torres2013}\n\\bibinfo{author}{\\bibfnamefont{E.~J.} \\bibnamefont{Torres-Herrera}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{L.~F.}\n  \\bibnamefont{Santos}}, \\bibinfo{journal}{Phys. Rev. E}\n  \\textbf{\\bibinfo{volume}{88}}, \\bibinfo{pages}{042121}\n  (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{He and Rigol}(2013)}]{He2013} M. Rigol and M. Srednicki, Phys. Rev. Lett. {\\bf 108}, 110601 (2012);\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{He}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{87}},\n  \\bibinfo{pages}{043615} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Rigol}()}]{RigolARXIV}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Rigol}},\n  \\bibinfo{note}{arXiv:1511.04447}.\n\n\\bibitem{Polkovnikov} A. Polkovnikov, Ann. Phys. {\\bf 326}, 486 499 (2011). \n\n\\bibitem[{\\citenamefont{Kudo and Deguchi}(2005)}]{Kudo2005}\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Kudo}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Deguchi}},\n  \\bibinfo{journal}{J. Phys. Soc. Jpn.} \\textbf{\\bibinfo{volume}{74}},\n  \\bibinfo{pages}{1992} (\\bibinfo{year}{2005}).\n\n\\bibitem[{\\citenamefont{Santos}(2009)}]{Santos2009JMP}\n\\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{J. Math. Phys} \\textbf{\\bibinfo{volume}{50}},\n  \\bibinfo{pages}{095211} (\\bibinfo{year}{2009}); L. F. Santos and M. Rigol, Phys. Rev E {\\bf 81}, 036206 (2010); L. F. Santos and M. Rigol, Phys. Rev E {\\bf 82}, 031130 (2010).\n\n\\bibitem[{\\citenamefont{Gubin and Santos}(2012)}]{Gubin2012}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Gubin}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.~F.} \\bibnamefont{Santos}},\n  \\bibinfo{journal}{Am. J. Phys.} \\textbf{\\bibinfo{volume}{80}},\n  \\bibinfo{pages}{246} (\\bibinfo{year}{2012}).\n\n\\bibitem[{not({\\natexlab{c}})}]{noteXX}\n\\bibinfo{note}{Due to degeneracies, a large peak at $s=0$ appears for the {XX}\n  model and the {XXZ} model at the root of unit $\\Delta=1/2$\n  \\cite{Zangara2013}.}\n\n\\bibitem[{\\citenamefont{Guhr et~al.}(1998)\\citenamefont{Guhr,\n  Mueller-Gr\\\"oeling, and Weidenm\\\"uller}}]{Guhr1998}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Guhr}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Mueller-Gr\\\"oeling}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{H.~A.}\n  \\bibnamefont{Weidenm\\\"uller}}, \\bibinfo{journal}{Phys. Rep.}\n  \\textbf{\\bibinfo{volume}{299}}, \\bibinfo{pages}{189} (\\bibinfo{year}{1998}).\n\n\\bibitem[{\\citenamefont{Rufeil-Fiori and Pastawski}(2006)}]{Fiori2006}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Rufeil-Fiori}}\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Pastawski}},\n  \\bibinfo{journal}{Chem. Phys. Lett.} \\textbf{\\bibinfo{volume}{420}},\n  \\bibinfo{pages}{35} (\\bibinfo{year}{2006}).\n\n\\bibitem[{\\citenamefont{Rufeil-Fiori and Pastawski}(2009)}]{Fiori2009}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Rufeil-Fiori}}\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Pastawski}},\n  \\bibinfo{journal}{Physica B} \\textbf{\\bibinfo{volume}{404}},\n  \\bibinfo{pages}{2812 } (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Jittoh et~al.}(2005)\\citenamefont{Jittoh, Shigeki,\n  Sato, Sato, and Takeda}}]{Jittoh2005}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Jittoh}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Shigeki}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Sato}},\n  \\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Sato}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Takeda}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{71}},\n  \\bibinfo{pages}{012109} (\\bibinfo{year}{2005}).\n\n\\bibitem[{not({\\natexlab{d}})}]{noteSUPPL}\n\\bibinfo{note}{See Supplemental Material.}\n\n\\bibitem[{\\citenamefont{Andraschko and Sirker}(2014)}]{Andraschko2014}\n\\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Andraschko}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Sirker}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{89}},\n  \\bibinfo{pages}{125120} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Touchette}(2009)}]{Touchette2009}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Touchette}},\n  \\bibinfo{journal}{Phys. Rep.} \\textbf{\\bibinfo{volume}{478}},\n  \\bibinfo{pages}{1} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Monnai}(2014)}]{Monnai2014}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Monnai}}, \\bibinfo{journal}{J.\n  Phys. Soc. Jpn.} \\textbf{\\bibinfo{volume}{83}}, \\bibinfo{pages}{064001}\n  (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Wigner}(1955)}]{Wigner1955}\n\\bibinfo{author}{\\bibfnamefont{E.~P.} \\bibnamefont{Wigner}},\n  \\bibinfo{journal}{Ann. Math.} \\textbf{\\bibinfo{volume}{62}},\n  \\bibinfo{pages}{548} (\\bibinfo{year}{1955}).\n\n\\bibitem[{\\citenamefont{Casati et~al.}(1996)\\citenamefont{Casati, Chirikov,\n  Guarneri, and Izrailev}}]{Casati1996}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Casati}},\n  \\bibinfo{author}{\\bibfnamefont{B.~V.} \\bibnamefont{Chirikov}},\n  \\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Guarneri}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}},\n  \\bibinfo{journal}{Phys. Lett. A} \\textbf{\\bibinfo{volume}{223}},\n  \\bibinfo{pages}{430} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Fyodorov et~al.}(1996)\\citenamefont{Fyodorov,\n  Chubykalo, Izrailev, and Casati}}]{Fyodorov1996}\n\\bibinfo{author}{\\bibfnamefont{Y.~V.} \\bibnamefont{Fyodorov}},\n  \\bibinfo{author}{\\bibfnamefont{O.~A.} \\bibnamefont{Chubykalo}},\n  \\bibinfo{author}{\\bibfnamefont{F.~M.} \\bibnamefont{Izrailev}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Casati}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{76}},\n  \\bibinfo{pages}{1603} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Mirlin et~al.}(1996)\\citenamefont{Mirlin, Fyodorov,\n  Dittes, Quezada, and Seligman}}]{Mirlin1996}\n\\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}},\n  \\bibinfo{author}{\\bibfnamefont{Y.~V.} \\bibnamefont{Fyodorov}},\n  \\bibinfo{author}{\\bibfnamefont{F.-M.} \\bibnamefont{Dittes}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Quezada}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.~H.} \\bibnamefont{Seligman}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{54}},\n  \\bibinfo{pages}{3221} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Mirlin and Evers}(2000)}]{Mirlin2000}\n\\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Evers}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{62}},\n  \\bibinfo{pages}{7920} (\\bibinfo{year}{2000}).\n\n\\bibitem[{\\citenamefont{Evers and Mirlin}(2008)}]{Evers2008}\n\\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Evers}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.~D.} \\bibnamefont{Mirlin}},\n  \\bibinfo{journal}{Rev. Mod. Phys.} \\textbf{\\bibinfo{volume}{80}},\n  \\bibinfo{pages}{1355} (\\bibinfo{year}{2008}).\n\n\\bibitem[{\\citenamefont{Varga}(2002)}]{Varga2002}\n\\bibinfo{author}{\\bibfnamefont{I.}~\\bibnamefont{Varga}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{66}},\n  \\bibinfo{pages}{094201} (\\bibinfo{year}{2002}).\n\n\\bibitem[{\\citenamefont{Mazza et~al.}()\\citenamefont{Mazza, Stephan, Canovi,\n  Alba, Brockmann, and Haque}}]{MazzaARXIV}\n\\bibinfo{author}{\\bibfnamefont{P.~P.} \\bibnamefont{Mazza}},\n  \\bibinfo{author}{\\bibfnamefont{J.-M.} \\bibnamefont{Stephan}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Canovi}},\n  \\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Alba}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Brockmann}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Haque}},\n  \\bibinfo{note}{arXiv:1509.04666}.\n\n\\bibitem[{Zan()}]{ZangaraAll}\n\\bibinfo{note}{G. A. \\'Alvarez {\\em et al}, Phys. Rev. Lett. {\\bf 101}, 120503\n  (2008); P. R. Zangara {\\em et al}, Phys. Rev. A {\\bf 86}, 012322 (2012); P.\n  R. Zangara {\\em et al}, Phys. Rev. A {\\bf 88} ,195106 (2013).}\n\n\\bibitem[{\\citenamefont{Campos~Venuti and Zanardi}(2010)}]{Venuti2010}\n\\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Campos~Venuti}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Zanardi}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{81}},\n  \\bibinfo{pages}{022113} (\\bibinfo{year}{2010}).\n  \n\\bibitem{Venuti2011}  L. Campos Venuti, N. T. Jacobson, S. Santra, P. and Zanardi, Phys. Rev. Lett. {\\bf 107}, 010403 (2011).\n\n\\bibitem[{\\citenamefont{H\\\"app\\\"ol\\\"a et~al.}(2012)\\citenamefont{H\\\"app\\\"ol\\\"a,\n  Hal\\'asz, and Hamma}}]{Happola2012}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{H\\\"app\\\"ol\\\"a}},\n  \\bibinfo{author}{\\bibfnamefont{G.~B.} \\bibnamefont{Hal\\'asz}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Hamma}},\n  \\bibinfo{journal}{Phys. Rev. A} \\textbf{\\bibinfo{volume}{85}},\n  \\bibinfo{pages}{032114} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Deguchi et~al.}()\\citenamefont{Deguchi, Giri, and\n  Hatakeyama}}]{DeguchiARXIV}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Deguchi}},\n  \\bibinfo{author}{\\bibfnamefont{P.~R.} \\bibnamefont{Giri}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Hatakeyama}},\n  \\bibinfo{note}{arXiv:1507.07470}.\n\n\\end{thebibliography}\n\n\n\n\\onecolumngrid\n\\vspace*{0.9cm}\n\\begin{center}\n{\\large \\bf Supplemental material for EPAPS} \n\\vskip 0.2 cm\n{\\large \\bf Powerlaw Decays and Thermalization in Isolated Many-Body Quantum Systems} \\\\\n\\vspace{0.7cm}\nMarco T\\'avora$^1$, E. J. Torres-Herrera$^2$, and Lea F. Santos$^1$\\\\\n$^1${\\it Department of Physics, Yeshiva University, New York, New York 10016, USA} \\\\\n$^2${\\it Instituto de F{\\'i}sica, Universidad Aut\\'onoma de Puebla, Apt. Postal J-48, Puebla, Puebla, 72570, Mexico}\n\n\n\n\\end{center}\n\n\n\n\\section{Powerlaw decay caused by spectrum bounds}\n\nThe local density of states (LDOS) for the finite spin-1/2 lattice models that we considered in the main text [Eq.~(2)] \nhas lower, $E_{low}$, and upper, $E_{up}$, energy bounds. The survival probability for a Gaussian LDOS with both bounds is given by\n\n\\newpage\n\\twocolumngrid\n\\begin{eqnarray}\n&&F(t) = \\left| \\frac{e^{ - \\sigma _0^2 t^2/2 + i E_0 t} }{2N}  \\left[    \\text{erf} \\left( \\frac{E_0 - E_{low} + i\\sigma _0^2t}{\\sqrt{2} \\sigma _0 } \\right)   \n\\right. \\right.  \\nonumber \\\\\n&& \\hspace{3.3 cm} \\left. \\left. -  \\text{erf} \\left( \\frac{E_0 - E_{up} + i\\sigma _0^2t}{\\sqrt{2} \\sigma _0 } \\right)  \\right] \\right|^2 , \\nonumber\n\\end{eqnarray}\nwhere $\\text{erf}$ is the error function and ${\\cal N}$ is the normalization constant. At long times, after dropping the oscillations from the sinusoidal term $\\cos [t (E_{up}+E_{low})]$,  the expression becomes\n", "index": 3, "text": "\n\\[F(t \\gg \\sigma _0^{ - 1}) \\simeq \\frac{ e^{ - (E_{up} - E_0)^2/\\sigma _0^2 } + e^{ - (E_{low} - E_0)^2/\\sigma _0^2 } }{{2\\pi \\sigma _{{\\rm{ini}}}^2{t^{\\rm{2}}}{{\\cal N}^{\\rm{2}}}}} ,\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"F(t\\gg\\sigma_{0}^{-1})\\simeq\\frac{e^{-(E_{up}-E_{0})^{2}/\\sigma_{0}^{2}}+e^{-(%&#10;E_{low}-E_{0})^{2}/\\sigma_{0}^{2}}}{{2\\pi\\sigma_{{\\rm{ini}}}^{2}{t^{\\rm{2}}}{{%&#10;\\cal N}^{\\rm{2}}}}},\" display=\"block\"><mrow><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo>≫</mo><msubsup><mi>σ</mi><mn>0</mn><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>≃</mo><mfrac><mrow><msup><mi>e</mi><mrow><mo>-</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mrow><mi>u</mi><mo>⁢</mo><mi>p</mi></mrow></msub><mo>-</mo><msub><mi>E</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><msubsup><mi>σ</mi><mn>0</mn><mn>2</mn></msubsup></mrow></mrow></msup><mo>+</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>w</mi></mrow></msub><mo>-</mo><msub><mi>E</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><msubsup><mi>σ</mi><mn>0</mn><mn>2</mn></msubsup></mrow></mrow></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>σ</mi><mi>ini</mi><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>t</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mn>2</mn></msup></mrow></mfrac><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05807.tex", "nexttext": "\n\nIn comparison with the Eq.~(2) of the main text, we now exclude NNN couplings and add random static magnetic fields acting on each site $n$, the amplitudes $h_n$ being random numbers from a uniform distribution $[-h,h]$. As $h$ increases from zero, the level spacing distribution changes from Poisson to Wigner-Dyson. Level repulsion and chaotic eigenstates occur for $0<h\\lesssim 1$. As $h$ is further increased beyond the coupling strength, $h>1$, level crossing is not prohibited anymore and the eigenstates become more localized in real space. \n\n\nThe cases where $h>1$ were studied in Refs.~[35,36]. Here, we focus on the small values of $h$.\nIn the figure below we show the average of $F(t)$ over different disorder realizations and different initial states. The average is denoted by $\\langle F(t) \\rangle$. For each realization, we choose as initial states, 10\\% of all ${\\cal D}$ site-basis vectors whose energy $E_0 $ are closest to the middle of the spectrum of the disordered Hamiltonian. The total number of data for the average, including initial states and realizations, is $10^5$.\n\nWe see that for small disorder, $h=0.1$ [Fig.~\\ref{fig:supp01} (a)] and $h=0.2$ [Fig.~\\ref{fig:supp01} (b)], the initial Gaussian decay is followed by a powerlaw behavior $\\propto t^{-2}$, as indicated by the dashed line. In contrast with the Fig.~1 of the main text, since several realizations are now taken into account, the fluctuations are averaged out and the $t^{-2}$ is very clear. As $h$ increases, the powerlaw exponent decreases, as visible in Fig.~\\ref{fig:supp01} (c) (see also Refs.~[35,36] ).\n\n\\vskip 0.4 cm\n\\onecolumngrid\n\n\\begin{figure}[htb]\n\\vskip 0.5 cm\n\\includegraphics[width=0.7\\textwidth]{FigSupp01.eps}\n\\caption{(Color online) Survival probability averaged over $10^5$ data for the disorder strength $h$ given in the panels. Circles indicate numerical data and the dashed line gives the fitted powerlaw decay $t^{-\\gamma}$.}\n\\label{fig:supp01}  \n\\end{figure}\n\n\n\n\n\n", "itemtype": "equation", "pos": 52029, "prevtext": "\n\nfrom where the $t^{-2}$ powerlaw decay discussed in the Fig.~1 of the main text is evident.\n\n\\subsection{Disordered Spin-1/2 Model}\n\nIn the Fig.~\\ref{fig:supp01} of this supplemental material, we study the decay of the survival probability for the one-dimensional isotropic Heisenberg spin-1/2 system with two-body nearest-neighbor interaction, $L$ sites, and periodic boundary conditions. The Hamiltonian is given by\n\n", "index": 5, "text": "\n\\[\nH= \\sum_{n=1}^L \\left[ h_n  S_n^z  + J \\left(\nS_n^x S_{n+1}^x + S_n^y S_{n+1}^y +S_n^z S_{n+1}^z \\right) \\right] .\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"H=\\sum_{n=1}^{L}\\left[h_{n}S_{n}^{z}+J\\left(S_{n}^{x}S_{n+1}^{x}+S_{n}^{y}S_{n%&#10;+1}^{y}+S_{n}^{z}S_{n+1}^{z}\\right)\\right].\" display=\"block\"><mrow><mrow><mi>H</mi><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>L</mi></munderover><mrow><mo>[</mo><mrow><mrow><msub><mi>h</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>S</mi><mi>n</mi><mi>z</mi></msubsup></mrow><mo>+</mo><mrow><mi>J</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msubsup><mi>S</mi><mi>n</mi><mi>x</mi></msubsup><mo>⁢</mo><msubsup><mi>S</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mi>x</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>S</mi><mi>n</mi><mi>y</mi></msubsup><mo>⁢</mo><msubsup><mi>S</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mi>y</mi></msubsup></mrow><mo>+</mo><mrow><msubsup><mi>S</mi><mi>n</mi><mi>z</mi></msubsup><mo>⁢</mo><msubsup><mi>S</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mi>z</mi></msubsup></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]