[{"file": "1601.06323.tex", "nexttext": "\nwhere we look for a mixing matrix ${\\boldsymbol{{{A}}}}$ between several unknown emitting sources ${\\boldsymbol{{{s}}}}$. Originally motivated by the denoising of all-sky CMB maps, a number of component separation algorithms have been proposed for solving Equ.(\\ref{equ:component_separation}): \n\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item Parametric methods where the spectral energy distributions (SEDs) of all components are used as a priori knowledge to maximize their spatial distribution entropy or likelihood \\citep{Hobson_98,Stolyarov_05,Eriksen_08,Khatri_15};\n\\item Internal linear combination methods that map a specific component as a linear combination of the observed maps with the constraint of minimizing its variance \\citep{Eriksen_04,Remazeilles_11,Hurier_13}; and\n\\item Blind or semi-blind source separation methods that rely on spatial source independence or sparsity priors \\citep{Delabrouille_03,Cardoso_08,Bobin_13}. \n\\end{enumerate}\n\nUnlike the image of the last scattering surface, some of the foreground sources are localized objects that may not be uniformly modeled by Gaussian random fields. Therefore, one of the challenges of the component separation algorithms is to avoid any unreal amplification of the very low or null amplitude elements of the source vector, ${\\boldsymbol{{{s}}}}$. In this context, parametric methods have shown their robustness for mapping the brightest extended foregrounds \\citep[see, e.g.][]{Planck_2013_XI_tdustmodel}, while sparsity-regularized reconstruction approaches have proven their ability to spatially separate the CMB anisotropies from fainter and more localized objects \\citep{Bobin_14}. \n\nAmong sparse representations, wavelet transforms have long been successfully used to denoise X-ray images of galaxy clusters \\citep{Slezak_94,Vikhlinin_97,Starck_98}, and thus have naturally been proposed for SZ imaging \\citep{Pierpaoli_05,Pires_06}. The isotropy of 2D wavelet functions, however, is unsuitable for detecting and preserving the filamentary structures that are likely to populate the  cluster outskirts as well as the the Galactic dust. A solution can be represented by curvelets that are especially designed to perform a sparse representation of linear and curved edges in the images \\citep{Candes_00}. To combine the local robustness of parametric methods to the imaging capabilities offered by sparse representations, we propose demixing the SZ signal with respect to the CMB and thermal dust via a set of kernel-weighted likelihood maximisations that are directly related to the wavelet transform of the CMB map and to the curvelet transforms of the foreground maps.\n\n\n\\subsection{Component estimate}\n\nThe {\\textit{Planck}{}}~HFI is composed of bolometer arrays whose frequency channels cover the most prominent part of the thermal SZ (tSZ) energy spectrum. In the HFI frequency range (100--857 GHz), the tSZ component is locally contaminated by radio and infrared point sources, and is mostly mixed up with the CMB temperature anisotropies and with the Galactic extended emissions from the thermal dust and CO lines \\citep{Planck_2015_X_foregrounds}. Moreover, most of the time the latter component is negligible at high Galactic latitude, as it is a tracer of Galactic molecular clouds. For these reasons, we reduce the specific intensity expected for each pixel ($k$,$l$) of the HFI frequency maps to the sum of three SEDs associated with the tSZ, thermal dust, and CMB components respectively,\n\n\n", "itemtype": "equation", "pos": 8191, "prevtext": "\n\n\\title{Spectral imaging of galaxy clusters with \\textit{Planck}}\n\\author{H. Bourdin\\altaffilmark{1}, P. Mazzotta \\altaffilmark{1,2}, E. Rasia\\altaffilmark{3,4}}\n\\journalinfo{The Astrophysical Journal, 815:92 (11pp), 2015 December 20}\n\\submitted{Received 2015 August 3; accepted 2015 October 30; published 2015 December 14}\n\n\\affil{{$^1$}{Dipartimento di Fisica, Universit\\`a degli Studi di Roma `Tor\n  Vergata', via della Ricerca Scientifica, 1, I-00133 Roma, Italy; \\myemail}}\n\\affil{{$^2$}{Harvard Smithsonian Centre for Astrophysics, 60 Garden Street, \nCambridge, MA 02138, USA}}\n\\affil{{$^3$}{INAF-Osservatorio Astronomico of Trieste, via Tiepolo 11, I-34121 Trieste, Italy}}\n\\affil{{$^4$}{Department of Physics, University of Michigan, Ann Arbor, MI 48109, USA}}\n\n\n\\begin{abstract}\n\nThe Sunyaev-Zeldovich (SZ) effect is a promising tool for detecting the presence of hot gas out to the galaxy cluster peripheries. We developed a spectral imaging algorithm dedicated to the SZ observations of nearby galaxy clusters with {\\textit{Planck}{}}, with the aim of revealing gas density anisotropies related to the filamentary accretion of materials, or pressure discontinuities induced by the propagation of shock fronts. To optimize an unavoidable trade-off between angular resolution and precision of the SZ flux measurements, the algorithm performs a multiscale analysis of the SZ maps as well as of other extended components, such as the cosmic microwave background (CMB) anisotropies and the Galactic thermal dust. The demixing of the SZ signal is tackled through kernel weighted likelihood maximizations. The CMB anisotropies are further analyzed through a wavelet analysis, while the Galactic foregrounds and SZ maps are analyzed via a curvelet analysis that best preserves their anisotropic details. The algorithm performance has been tested against mock observations of galaxy clusters obtained by simulating the {\\textit{Planck}{}}~ High Frequency Instrument and by pointing a few characteristic positions in the sky. These tests suggest that {\\textit{Planck}{}}~  should easily allow us to detect filaments in the cluster peripheries and detect large-scale shocks in colliding galaxy clusters that feature favorable geometry.\n\n\\end{abstract}\n\n\\keywords{Galaxy: clusters: general --- Galaxies: clusters: intracluster medium --- Shock waves}\n\n\\section{Introduction}\n\nMost of the baryonic content of galaxy clusters is in the form of a hot ionized gas that is in pressure equilibrium with gravity. This intracluster medium (ICM) is detectable in X-rays via its bremsstrahlung emission, as well as in the millimetric band via the inverse Compton diffusion of the cosmic microwave background (CMB) radiation, or the so-called Sunyaev-Zeldovich (hereafter SZ) effect. The excellent agreement between X-ray and SZ measurements of the central region of galaxy clusters, $r \\leq r_{500}$ \\footnote{$r_{\\Delta}$ is the radius of a ball whose density is $\\Delta$ times the critical density of the universe}, suggests that both observables accurately probe the integrated ICM thermal pressure \\citep[see, e.g.][]{Planck_early_XI_SZscaling}. Due to the quadratic dependence of the X-ray emission measure on the ICM density, X-ray observations mostly enlighten the physics of the innermost cluster regions ($r < r_{2500}$), while X-ray spectroscopy poorly constrains the outer regions. By contrast, the SZ Compton parameter is proportional to the integrated ICM pressure along the line of sight. Therefore, the SZ signal extends further out and enables us to explore the complex baryonic physics at play in the cluster outskirts.\n\n{\\textit{Planck}{}}~ is the third space satellite that has mapped the CMB over the full-sky. Its high sensitivity and unprecedented angular resolution allowed the detection of more than 1000 galaxy clusters classified in the Second {\\textit{Planck}{}}~ Catalogue SZ sources \\citep{Planck_2015_szcatalogue}. Releases of {\\textit{Planck}{}}~ data proved the strength of the SZ effect in detecting the ICM out to the cluster peripheries.  In particular, radially averaged measurements of the Compton parameter of 60 nearby massive clusters showed that their averaged pressure profile is similar to X-ray derived profiles below $r_{500}$, but slightly exceeds the theoretical predictions from cosmological simulations of cluster formation at $r \\ge r_{500}$ \\citep{Planck_2013_V_pressure}. A subsequent combination of  {\\textit{Planck}{}}~ and ROSAT data toward 18 of these clusters revealed the different natures of the hot gas entropy profiles of the cool core and non-cool core clusters at $r_{200}$ \\citep{Eckert_13a}, and also managed to discriminate between averaged gas fractions in the outer regions of the two cluster classes \\citep{Eckert_13b}. Complementary to radial profiles, maps of the Compton parameter provide us with a precious information that helps with the interpretation of these results.  Indeed, SZ maps allow us to identify merger shocks that locally raise the ICM entropy and accretion filaments that affect the ICM hydrostatic equilibrium via the anisotropic injection of turbulence. From an observational point of view, fine two-dimensional (2D) information helps with the identification of some sources of bias of the radially averaged SZ and X-ray flux measurements generated by structures projected along the line of sight. Furthermore, the detection of accretion filaments also identifies ICM regions that are likely inhomogeneous \\citep[e.g.][]{Vazza_13}, yielding nonlinear biases when assuming spherical symmetry in the inversion of the gas density from X-ray surface brightness profiles \\citep{Nagai_11}. The first analyses of Planck data have already allowed us to detect highly significant anisotropies in the cluster atmospheres, in particular two shock fronts in the Coma cluster \\citep{Planck_intermediate_X_coma} and a Mpc-scale filament connecting both components of the cluster pair A399-A401 \\citep{Planck_intermediate_VIII_filaments}. These results encourage us to develop an image restoration algorithm that could reveal SZ anisotropies down to a lower signal-to-noise ratio.\n\nThe SZ signal from galaxy clusters is a mixture of up to several extended emissions of Galactic and extragalactic origin that can be demixed through local likelihood maximizations. By taking advantage of kernel-weighted $\\chi^2$ minimisations, we propose to optimize the bias-variance trade-off of these estimates via a multi-scale analysis. Including a wavelet analysis of the CMB map and a curvelet analysis of the foreground maps, the proposed algorithm has been adapted to match the spectral responses and beams of the Planck High Frequency Instrument (HFI), and includes, in particular, an iterative deconvolution of the frequency maps. After having detailed our algorithm in Section 2, we present mock HFI observations of galaxy clusters and discuss the algorithm performance in mapping the SZ signal from these simulations in Section 3. In the following analysis, intracluster distances are computed as angular diameter distances, assuming a $\\Lambda$-CDM cosmology with ${H}_\\mathrm{0} =70~\\mathrm{km}~\\mathrm{s}^{-1}\\mathrm{Mpc}^{-1}$, $\\Omega_{\\mathrm{M}} = 0.3$, $\\Omega_{\\Lambda} = 0.7$. \n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics{planck_gadget_f1.eps}}\n  \\caption{Left: Isotropic {$\\mathrm{{B}_{3}}$-spline{~}} wavelet function $\\psi$. Middle and right: negative and positive parts of the wavelet function, $\\psi_{-}$ and $\\psi_{+}$ \\label{fig:bspline_kernel}}\n   \\end{center}\n\\end{figure*}\n\n\\section{Spectral imaging of the thermal SZ signal\\label{sect:spectral-imaging}}\n\n\\subsection{Toward spectral imaging}\n\n\nAcross the radio electromagnetic spectrum, the SZ signal is a mixture of CMB radiation, and several extended emissions of Galactic (free-free, synchrotron and thermal dust continua, CO lines) and extragalactic origin (Cosmic Infrared Background). When looking at all-sky gigahertzian frequency maps ${\\boldsymbol{{{f}}}}$ that are contaminated by their instrumental noise ${\\boldsymbol{{{N}}}}$, separating these components is an inverse problem that is traditionally stated as:\n\n", "index": 1, "text": "\\begin{equation}\n{\\boldsymbol{{{f}}}} = {\\boldsymbol{{{As}}}} + {\\boldsymbol{{{N}}}},\n\\label{equ:component_separation}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\bm{{{f}}}}={\\bm{{{As}}}}+{\\bm{{{N}}}},\" display=\"block\"><mrow><mrow><mi>𝒇</mi><mo>=</mo><mrow><mrow><mi>𝑨</mi><mo>⁢</mo><mi>𝒔</mi></mrow><mo>+</mo><mi>𝑵</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nwhere:\\\\\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item the Galactic dust spectrum is idealized as a uniform modified blackbody with shape ${f_{\\mathrm{dust}}}(\\nu)  \\propto \\nu^{\\beta} B_{\\nu}(\\nu,T)$ ;\\\\\n\\item the tSZ distortion of the CMB spectrum is modeled following the Kompaneets non-relativistic approximation: \n\n", "itemtype": "equation", "pos": 11811, "prevtext": "\nwhere we look for a mixing matrix ${\\boldsymbol{{{A}}}}$ between several unknown emitting sources ${\\boldsymbol{{{s}}}}$. Originally motivated by the denoising of all-sky CMB maps, a number of component separation algorithms have been proposed for solving Equ.(\\ref{equ:component_separation}): \n\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item Parametric methods where the spectral energy distributions (SEDs) of all components are used as a priori knowledge to maximize their spatial distribution entropy or likelihood \\citep{Hobson_98,Stolyarov_05,Eriksen_08,Khatri_15};\n\\item Internal linear combination methods that map a specific component as a linear combination of the observed maps with the constraint of minimizing its variance \\citep{Eriksen_04,Remazeilles_11,Hurier_13}; and\n\\item Blind or semi-blind source separation methods that rely on spatial source independence or sparsity priors \\citep{Delabrouille_03,Cardoso_08,Bobin_13}. \n\\end{enumerate}\n\nUnlike the image of the last scattering surface, some of the foreground sources are localized objects that may not be uniformly modeled by Gaussian random fields. Therefore, one of the challenges of the component separation algorithms is to avoid any unreal amplification of the very low or null amplitude elements of the source vector, ${\\boldsymbol{{{s}}}}$. In this context, parametric methods have shown their robustness for mapping the brightest extended foregrounds \\citep[see, e.g.][]{Planck_2013_XI_tdustmodel}, while sparsity-regularized reconstruction approaches have proven their ability to spatially separate the CMB anisotropies from fainter and more localized objects \\citep{Bobin_14}. \n\nAmong sparse representations, wavelet transforms have long been successfully used to denoise X-ray images of galaxy clusters \\citep{Slezak_94,Vikhlinin_97,Starck_98}, and thus have naturally been proposed for SZ imaging \\citep{Pierpaoli_05,Pires_06}. The isotropy of 2D wavelet functions, however, is unsuitable for detecting and preserving the filamentary structures that are likely to populate the  cluster outskirts as well as the the Galactic dust. A solution can be represented by curvelets that are especially designed to perform a sparse representation of linear and curved edges in the images \\citep{Candes_00}. To combine the local robustness of parametric methods to the imaging capabilities offered by sparse representations, we propose demixing the SZ signal with respect to the CMB and thermal dust via a set of kernel-weighted likelihood maximisations that are directly related to the wavelet transform of the CMB map and to the curvelet transforms of the foreground maps.\n\n\n\\subsection{Component estimate}\n\nThe {\\textit{Planck}{}}~HFI is composed of bolometer arrays whose frequency channels cover the most prominent part of the thermal SZ (tSZ) energy spectrum. In the HFI frequency range (100--857 GHz), the tSZ component is locally contaminated by radio and infrared point sources, and is mostly mixed up with the CMB temperature anisotropies and with the Galactic extended emissions from the thermal dust and CO lines \\citep{Planck_2015_X_foregrounds}. Moreover, most of the time the latter component is negligible at high Galactic latitude, as it is a tracer of Galactic molecular clouds. For these reasons, we reduce the specific intensity expected for each pixel ($k$,$l$) of the HFI frequency maps to the sum of three SEDs associated with the tSZ, thermal dust, and CMB components respectively,\n\n\n", "index": 3, "text": "\\begin{equation}\n\t\\begin{split}\n\t\tI(k,l,\\nu) =  R(\\nu) \\times   & \\left[ {\\mathrm{A_{\\mathrm{SZ}}}}(k,l)~{f_{\\mathrm{SZ}}}(\\nu)   \\right. \\\\\n\t\t & + {\\mathrm{A_{\\mathrm{dust}}}}(k,l)~{f_{\\mathrm{dust}}}(\\nu)  \\\\\n\t\t & +  \\left. {\\mathrm{A_{\\mathrm{CMB}}}}(k,l) \\right], \n\t\t \\label{equ:freq_maps}\n\t\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle I(k,l,\\nu)=R(\\nu)\\times&amp;\\displaystyle\\left[{\\mathrm%&#10;{A_{\\mathrm{SZ}}}}(k,l)~{}{f_{\\mathrm{SZ}}}(\\nu)\\right.\\\\&#10;&amp;\\displaystyle+{\\mathrm{A_{\\mathrm{dust}}}}(k,l)~{}{f_{\\mathrm{dust}}}(\\nu)\\\\&#10;&amp;\\displaystyle+\\left.{\\mathrm{A_{\\mathrm{CMB}}}}(k,l)\\right],\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mi>I</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo>,</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>R</mi><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mo>×</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mo>[</mo><msub><mi mathvariant=\"normal\">A</mi><mi>SZ</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow><msub><mi>f</mi><mi>SZ</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>dust</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>f</mi><mi>dust</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mo>+</mo><msub><mi mathvariant=\"normal\">A</mi><mi>CMB</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow><mo>]</mo><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\\item each SED is  corrected  for the HFI spectral response $R(\\nu)$.\n\\end{enumerate}\n\nNote that the correction of each SED for the HFI spectral response includes a unit conversion factor between the HFI 100-353 GHz channels and the 545 and 857 GHz channels, that are calibrated in units of CMB temperature and intensities of a power-law SED, respectively \\citep[see details in][]{Planck_2013_VIII_hfimaps,Planck_2013_IX_hfiresp}. A color correction is further applied to adapt the Galactic dust SED to the power law used to calibrate the high-energy channels. These corrections are calculated using the Unit conversion and Color Correction package that is provided with the current {\\textit{Planck}{}}~data release.\n\nTo perform a local regression of each component amplitude, we minimize a kernel-Weighted Least-Square (WLS) distance separating the total SED of all components, $I (k, l, n)$, from the energy distribution registered in the vicinity of each pixel of the HFI frequency maps, $y(k, l)$. Derived from the weighted likelihood formalism (see the appendix), the minimized quantity $w\\chi^2(k,l)$ is weighted by the variance of the frequency maps, $\\sigma(k,l,\\nu)$, and spatially smoothed by a positive kernel with norm 1, $w(i,j)$:\n\n\n", "itemtype": "equation", "pos": 12459, "prevtext": "\n\nwhere:\\\\\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item the Galactic dust spectrum is idealized as a uniform modified blackbody with shape ${f_{\\mathrm{dust}}}(\\nu)  \\propto \\nu^{\\beta} B_{\\nu}(\\nu,T)$ ;\\\\\n\\item the tSZ distortion of the CMB spectrum is modeled following the Kompaneets non-relativistic approximation: \n\n", "index": 5, "text": "\\begin{equation}\n{f_{\\mathrm{SZ}}}(\\nu)  = \\left[\\left(\\frac{h\\nu}{kT}\\right)\\frac{exp(h\\nu/{kT} + 1)}{exp(h\\nu/{kT} - 1)} - 4 \\right];\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{f_{\\mathrm{SZ}}}(\\nu)=\\left[\\left(\\frac{h\\nu}{kT}\\right)\\frac{exp(h\\nu/{kT}+1%&#10;)}{exp(h\\nu/{kT}-1)}-4\\right];\" display=\"block\"><mrow><mrow><mrow><msub><mi>f</mi><mi>SZ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>[</mo><mrow><mrow><mrow><mo>(</mo><mfrac><mrow><mi>h</mi><mo>⁢</mo><mi>ν</mi></mrow><mrow><mi>k</mi><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>e</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mrow><mi>h</mi><mo>⁢</mo><mi>ν</mi></mrow><mo>/</mo><mi>k</mi></mrow><mo>⁢</mo><mi>T</mi></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>e</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mrow><mi>h</mi><mo>⁢</mo><mi>ν</mi></mrow><mo>/</mo><mi>k</mi></mrow><mo>⁢</mo><mi>T</mi></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>-</mo><mn>4</mn></mrow><mo>]</mo></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\nThe minimization of $w\\chi^2(k,l)$ provides us with an estimate of the searched parameter parameter vector, as follows:\n\n", "itemtype": "equation", "pos": 13855, "prevtext": "\n\\item each SED is  corrected  for the HFI spectral response $R(\\nu)$.\n\\end{enumerate}\n\nNote that the correction of each SED for the HFI spectral response includes a unit conversion factor between the HFI 100-353 GHz channels and the 545 and 857 GHz channels, that are calibrated in units of CMB temperature and intensities of a power-law SED, respectively \\citep[see details in][]{Planck_2013_VIII_hfimaps,Planck_2013_IX_hfiresp}. A color correction is further applied to adapt the Galactic dust SED to the power law used to calibrate the high-energy channels. These corrections are calculated using the Unit conversion and Color Correction package that is provided with the current {\\textit{Planck}{}}~data release.\n\nTo perform a local regression of each component amplitude, we minimize a kernel-Weighted Least-Square (WLS) distance separating the total SED of all components, $I (k, l, n)$, from the energy distribution registered in the vicinity of each pixel of the HFI frequency maps, $y(k, l)$. Derived from the weighted likelihood formalism (see the appendix), the minimized quantity $w\\chi^2(k,l)$ is weighted by the variance of the frequency maps, $\\sigma(k,l,\\nu)$, and spatially smoothed by a positive kernel with norm 1, $w(i,j)$:\n\n\n", "index": 7, "text": "\\begin{equation}\n\tw\\chi^2(k,l) = \\sum_{i,j,\\nu} {w(i,j) \\frac{\\left[I(i-k,j-l,\\nu) -  y(i-k,j-l,\\nu)\\right]^2}{ \\sigma(i-k,j-l,\\nu)^2} } .\n\t\\label{equ:wchi2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"w\\chi^{2}(k,l)=\\sum_{i,j,\\nu}{w(i,j)\\frac{\\left[I(i-k,j-l,\\nu)-y(i-k,j-l,\\nu)%&#10;\\right]^{2}}{\\sigma(i-k,j-l,\\nu)^{2}}}.\" display=\"block\"><mrow><mrow><mrow><mi>w</mi><mo>⁢</mo><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi><mo>,</mo><mi>ν</mi></mrow></munder><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><msup><mrow><mo>[</mo><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>i</mi><mo>-</mo><mi>k</mi></mrow><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mi>l</mi></mrow><mo>,</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>i</mi><mo>-</mo><mi>k</mi></mrow><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mi>l</mi></mrow><mo>,</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup><mrow><mi>σ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>i</mi><mo>-</mo><mi>k</mi></mrow><mo>,</mo><mrow><mi>j</mi><mo>-</mo><mi>l</mi></mrow><mo>,</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\nIt is undertaken for each pixel of the component maps, ${\\boldsymbol{{{\\widehat{A_{w}}}}}}(k,l)$, by means of a Levenberg--Marquardt algorithm \\citep{Markwardt_09}.\n\n\\subsection{Component Imaging}\n\\subsubsection{Image denoising}\n\nMultiscale transforms perform a sparse representation of the 2d discontinuities present in the images, thus enhancing their signal-to-noise ratio. The efficiency of the process, however,\ndepends on the level of correlation of the transform basis\nfunctions to the shape of the discontinuities. For instance,\nwavelet transforms best represent isotropic details, while,\ncompared to wavelets, curvelets are better for revealing linear\nand curved edges. Because CMB features are believed to be\nnearly isotropic, we chose to analyze the CMB map via its\nwavelet transform. To analyze the Galactic dust and tSZ images\nthat plausibly hold filaments and edges, we adopted a curvelet\ntransform.\n\nThe WLS minimization provides us with a mechanism for extracting the undecimated {$\\mathrm{{B}_{3}}$-spline{~}} wavelet transform \\citep[][]{Starck_07} of all component maps, ${\\boldsymbol{{{{A}}}}}(k,l)$. For each wavelet scale $a$, we split the {$\\mathrm{{B}_{3}}$-spline{~}} wavelet function $\\psi(a)$ as the sum of its negative and positive parts, $\\psi_{+}(a)$ and $\\psi_{-}(a)$ (see also {Figure~}\\ref{fig:bspline_kernel}) and introduce the appropriate weighting kernels in {Equation~}(\\ref{equ:wchi2}). Minimizing $\\psi_{+}\\chi^2(k,l) $ and $\\psi_{-}\\chi^2(k,l) $ provides us with an estimate of the component maps convolved with $\\psi_{+}(a)$ and $\\psi_{-}(a)$, and allows us to derive their wavelet transform, following:\n\n\n", "itemtype": "equation", "pos": 14148, "prevtext": "\nThe minimization of $w\\chi^2(k,l)$ provides us with an estimate of the searched parameter parameter vector, as follows:\n\n", "index": 9, "text": "\\begin{equation}\n\t{\\boldsymbol{{{\\widehat{A_{w}}}}}}(k,l) = \\left[ \\begin{array}{c} \\widehat{{\\mathrm{A_{\\mathrm{CMB}}}}_{,w}}(k,l) \\\\ \\widehat{{\\mathrm{A_{\\mathrm{dust}}}}_{,w}}(k,l) \\\\   \\widehat{{\\mathrm{A_{\\mathrm{SZ}}}}_{,w}}(k,l)  \\end{array} \\right] = \\underset{{\\boldsymbol{{{A}}}}}{\\arg\\min} \\left(w\\chi^2(k,l)\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{\\bm{{{\\widehat{A_{w}}}}}}(k,l)=\\left[\\begin{array}[]{c}\\widehat{{\\mathrm{A_{%&#10;\\mathrm{CMB}}}}_{,w}}(k,l)\\\\&#10;\\widehat{{\\mathrm{A_{\\mathrm{dust}}}}_{,w}}(k,l)\\\\&#10;\\widehat{{\\mathrm{A_{\\mathrm{SZ}}}}_{,w}}(k,l)\\end{array}\\right]=\\underset{{%&#10;\\bm{{{A}}}}}{\\arg\\min}\\left(w\\chi^{2}(k,l)\\right).\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><msub><mi>𝑨</mi><mi>𝒘</mi></msub><mo mathvariant=\"bold\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>[</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mover accent=\"true\"><mmultiscripts><mi mathvariant=\"normal\">A</mi><mi>CMB</mi><none/><mrow><mo>,</mo><mi>w</mi></mrow><none/></mmultiscripts><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mover accent=\"true\"><mmultiscripts><mi mathvariant=\"normal\">A</mi><mi>dust</mi><none/><mrow><mo>,</mo><mi>w</mi></mrow><none/></mmultiscripts><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mover accent=\"true\"><mmultiscripts><mi mathvariant=\"normal\">A</mi><mi>SZ</mi><none/><mrow><mo>,</mo><mi>w</mi></mrow><none/></mmultiscripts><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>]</mo></mrow><mo>=</mo><mrow><munder accentunder=\"true\"><mrow><mi>arg</mi><mo>⁡</mo><mi>min</mi></mrow><mo>𝑨</mo></munder><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>w</mi><mo>⁢</mo><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nIn the same way, the variance of the wavelet coefficients can be derived from:\n\n\n", "itemtype": "equation", "pos": 16137, "prevtext": "\nIt is undertaken for each pixel of the component maps, ${\\boldsymbol{{{\\widehat{A_{w}}}}}}(k,l)$, by means of a Levenberg--Marquardt algorithm \\citep{Markwardt_09}.\n\n\\subsection{Component Imaging}\n\\subsubsection{Image denoising}\n\nMultiscale transforms perform a sparse representation of the 2d discontinuities present in the images, thus enhancing their signal-to-noise ratio. The efficiency of the process, however,\ndepends on the level of correlation of the transform basis\nfunctions to the shape of the discontinuities. For instance,\nwavelet transforms best represent isotropic details, while,\ncompared to wavelets, curvelets are better for revealing linear\nand curved edges. Because CMB features are believed to be\nnearly isotropic, we chose to analyze the CMB map via its\nwavelet transform. To analyze the Galactic dust and tSZ images\nthat plausibly hold filaments and edges, we adopted a curvelet\ntransform.\n\nThe WLS minimization provides us with a mechanism for extracting the undecimated {$\\mathrm{{B}_{3}}$-spline{~}} wavelet transform \\citep[][]{Starck_07} of all component maps, ${\\boldsymbol{{{{A}}}}}(k,l)$. For each wavelet scale $a$, we split the {$\\mathrm{{B}_{3}}$-spline{~}} wavelet function $\\psi(a)$ as the sum of its negative and positive parts, $\\psi_{+}(a)$ and $\\psi_{-}(a)$ (see also {Figure~}\\ref{fig:bspline_kernel}) and introduce the appropriate weighting kernels in {Equation~}(\\ref{equ:wchi2}). Minimizing $\\psi_{+}\\chi^2(k,l) $ and $\\psi_{-}\\chi^2(k,l) $ provides us with an estimate of the component maps convolved with $\\psi_{+}(a)$ and $\\psi_{-}(a)$, and allows us to derive their wavelet transform, following:\n\n\n", "index": 11, "text": "\\begin{equation}\n\t{\\mathscr{Wt}}(k,l,a) = \\frac{1}{2} \\times \\left[{\\boldsymbol{{{\\widehat{A_{\\psi_{+}}}}}}}(k,l)  + {\\boldsymbol{{{\\widehat{A_{\\psi_{-}}}}}}}(k,l) \\right].\n\t\\label{equ:wt}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{\\mathscr{Wt}}(k,l,a)=\\frac{1}{2}\\times\\left[{\\bm{{{\\widehat{A_{\\psi_{+}}}}}}}%&#10;(k,l)+{\\bm{{{\\widehat{A_{\\psi_{-}}}}}}}(k,l)\\right].\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo>,</mo><mi>a</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>×</mo><mrow><mo>[</mo><mrow><mrow><mover accent=\"true\"><msub><mi>𝑨</mi><msub><mi>𝝍</mi><mo mathvariant=\"bold\">+</mo></msub></msub><mo mathvariant=\"bold\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mover accent=\"true\"><msub><mi>𝑨</mi><msub><mi>𝝍</mi><mo mathvariant=\"bold\">-</mo></msub></msub><mo mathvariant=\"bold\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nTo further extract the curvelet coefficients of the component maps, we normalize wavelet coefficients to their standard deviation, ${\\mathscr{Wt}}' = {\\mathscr{Wt}}/d{\\mathscr{Wt}}$. Subsequently, we compute a so-called curvelet transform of the first generation \\citep[][]{Starck_03a} that combines a 2D {$\\mathrm{{B}_{3}}$-spline{~}} wavelet transform with a set of ridgelet transforms that are performed within binning blocks of the wavelet detail images. Finally, the denoising of wavelet and curvelet transforms is performed via a thresholding of the coefficients whose absolute value does not exceed a few standard deviations. In the case of the CMB wavelet transform, this standard deviation is straightforwardly defined in {Equation~}(\\ref{equ:dwt}). On the other hand for the Galactic dust and the tSZ curvelet transforms, the coefficient variance depends on the orientation and it has been preliminarily estimated and tabulated by Monte-Carlo simulations of a Gaussian white noise.  In order to work with positive component maps, lower the dynamics of the reconstructed tSZ images, and reduce the relative amplitude of the thresholding artifacts, the quantities that have been effectively denoised and mapped are\n\n\n", "itemtype": "equation", "pos": 16422, "prevtext": "\n\nIn the same way, the variance of the wavelet coefficients can be derived from:\n\n\n", "index": 13, "text": "\\begin{equation}\n\td{\\mathscr{Wt}}(k,l,a)= \\frac{1}{2}  \\times \\sqrt {{\\boldsymbol{{{\\widehat{ {\\sigma^2_{A,\\psi_{+}}}}}}}}(k,l)^2  + {\\boldsymbol{{{\\widehat{ {\\sigma^2_{A,\\psi_{-}}}}}}}}(k,l)^2}.\n\t\\label{equ:dwt}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"d{\\mathscr{Wt}}(k,l,a)=\\frac{1}{2}\\times\\sqrt{{\\bm{{{\\widehat{{\\sigma^{2}_{A,%&#10;\\psi_{+}}}}}}}}(k,l)^{2}+{\\bm{{{\\widehat{{\\sigma^{2}_{A,\\psi_{-}}}}}}}}(k,l)^{%&#10;2}}.\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo>,</mo><mi>a</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>×</mo><msqrt><mrow><mrow><mover accent=\"true\"><msubsup><mi>𝝈</mi><mrow><mi>𝑨</mi><mo mathvariant=\"bold\">,</mo><msub><mi>𝝍</mi><mo mathvariant=\"bold\">+</mo></msub></mrow><mn>𝟐</mn></msubsup><mo mathvariant=\"bold\">^</mo></mover><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><mover accent=\"true\"><msubsup><mi>𝝈</mi><mrow><mi>𝑨</mi><mo mathvariant=\"bold\">,</mo><msub><mi>𝝍</mi><mo mathvariant=\"bold\">-</mo></msub></mrow><mn>𝟐</mn></msubsup><mo mathvariant=\"bold\">^</mo></mover><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nwhere $ \\bar{\\mathscr{Wt}}$ and $ \\bar{\\mathscr{Cur}}$ denote the thresholded wavelet and curvelet transforms, respectively, and ${\\mathcal{R}}_{{\\mathscr{Wt}}}$ and ${\\mathcal{R}}_{{\\mathscr{Cur}}}$ denote the relative reconstruction operators.\n\n\\subsubsection{Image restoration}\n\nBecause the denoised component maps ${\\boldsymbol{{{{A_{o}}}}}}(k,l) $ have been\nestimated from the mixing of frequency maps that were\nregistered at various angular resolutions, they might be altered\nby aliasing artifacts. In order to take advantage of the angular\nresolution available at each frequency, we iteratively deconvolve\nall component maps from the HFI beams by means of a\nVan Cittert algorithm \\citep{VanCittert_1931}. More precisely, at each iteration $i$ we associate a set of denoised frequency maps with the component maps ${\\boldsymbol{{{A_{i}}}}}$ following {Equation~}(\\ref{equ:freq_maps}). We convolve these frequency maps with their specific beams and restore a new set of point-spread function (PSF)-convolved component maps $P*{\\boldsymbol{{{A_{n}}}}}$ via a new combination of WLS estimate and multi-scale denoising. Starting from a first guess ${\\boldsymbol{{{{A_{o}}}}}}(k,l) $, the Van Cittert iteration yields: \n\n\\begin{eqnarray}\n\t{\\boldsymbol{{{R_{n}(k, l)}}}} &=& {\\boldsymbol{{{{A_{o}}}}}}(k, l) - [P * {\\boldsymbol{{{{A_{n}}}}}} ](k, l) \\nonumber \\\\\n\t{\\boldsymbol{{{{A_{n+1}}}}}} &=& {\\boldsymbol{{{{A_{n}}}}}}+\\alpha {\\boldsymbol{{{R_{n}}}}}(k, l)\n\t\\label{equ:Van_cittert}\n\\end{eqnarray}\n\nAs proposed in \\citet{Murtagh_95}, the locus of the significant (i.e. nonzero) wavelet and curvelet coefficients of ${\\boldsymbol{{{{A_{o}}}}}}$ defines a `multiresolution support' that regularizes the algorithm. By reconstructing the residual ${\\boldsymbol{{{R_{n}(k, l)}}}}$ from the wavelet and curvelet coefficients located within this multiresolution support \\citep[see also][]{Starck_02}, we prevent any noise amplification during the Van Cittert iteration.\n\n\\begin{figure*}[h]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f3.eps}}\n  \\caption{Compton parameter of two SPH simulated clusters presented in this work compared with real {\\textit{Planck}{}}~ measurements. {{Left panel: }} $y$ parameter obtained along an image cut intercepting both maxima of the \\textit{connected cluster} map displaced at $z=0.04$. The dashed line (gray area) represents a cut of the thermal SZ signal (variance), reconstructed via the MILCA algorithm toward the cluster pair A399-A401. {{Right panel: }} Same as the left panel but for the \\textit{colliding cluster} displaced at $z=0.01$ and the Coma cluster.\\label{Fig:a399_coma_vs_gadget}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[h]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f2.eps}}\n  \\caption{Mock HFI frequency maps of the $z=0.015$ \\textit{accreting cluster} positioned at $l=270^\\circ$ and $b=-30^\\circ$.\\label{Fig:HFI_freqmaps}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f4.eps}}\n  \\caption{{{Top panels: }} thermal SZ map of the \\textit{accreting, connected, and colliding} clusters displaced at $z=0.015$, $z=0.015$ and $z=0.01$, respectively. The white isocontours are logarithmically equispaced by a factor of $2^{1/4}$. The faintest isocontour corresponds to a Compton parameter of y=$7.5 \\times 10^{-6}$, except for the \\textit{connected} cluster whose faintest isocontour corresponds to  $y=10^{-5}$. {{Middle and bottom panels: }} restored maps of the SZ signal for two positions in the sky characterized by a low and a high instrumental noise variance.\\label{Fig:clusters_vs_snr}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f5.eps}}\n  \\caption{Restored thermal SZ maps of the \\textit{connected} cluster displaced at $z=0.05$ and positioned at various characteristic locations in the sky. The white isocontours are logarithmically equispaced by a factor of $2^{1/4}$, the faintest isocontour corresponding to a Compton parameter of $y=10^{-5}$.\\label{Fig:connected_vs_position}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f6.eps}}\n  \\caption{{{Top panels: } Restored thermal SZ maps of the \\textit{connected, accreting and colliding} clusters displaced at $z=0.02$ and positioned in the sky at ($l=270^\\circ$, $b=-30^\\circ$). {{Middle and bottom panels: } Same as top panels as for $z=0.04$ and $z=0.07$, respectively. White isocontours are logarithmically equispaced by a factor of $2^{1/4}$, the faintest isocontour corresponding to a Compton parameter of $y=7.5\\times10^{-6}$. \\label{Fig:clusters_vs_redshift}}}}\n   \\end{center}\n\\end{figure*}\n\n\n\n\\section{Mock observations of galaxy clusters\\label{sect:mock_observations}}\n\n\n\\subsection{The thermal SZ signal as seen from SPH simulations}\n\nIn order to test the restoration algorithm detailed in the previous section, we extracted thermal SZ maps of simulated galaxy clusters. The hydro-simulations employed are carried out by the Smoothed-Particle-Hydrodynamic  code GADGET \\citep{springel05}.  The details of the simulations and the physics adopted are presented in \\cite{planelles.etal.14} and \\cite{rasia.etal.14}. Here, we briefly list the essential points and address the\nmentioned papers for a more exhaustive description. The\nclusters used in the present work come from two Lagrangian\nregions that were selected from a parent dark matter\ncosmological box. The regions are re-simulated at a higher-mass\nresolution, adding baryons either in gaseous or stellar\nform. The re-simulations treat processes such as radiative\ncooling; star formation and evolution; kinetic feedback by type\nIa and type II supernovae and from asymptotic Giant Branch\nstars; thermal feedback from active galactic nuclei resulting\nfrom gas accretion onto supermassive black holes \\citep[see also][]{ragone.etal.13}. Masses of dark matter and gas particles are equal to $m_{\\mathrm{dm}} = 8.47 \\times 10^8 h^{-1} \\mathrm{M}_{\\odot}$ and $m_{\\mathrm{gas}}=1.53 \\times 10^8 h^{-1} \\mathrm{M}_{\\odot}$, respectively. The adopted Plummer-equivalent softening length for computing the gravitational force is set to $\\epsilon = 5 h^{-1}$ kpc in comoving units up to $z=2$ then it is switched to the same value but in physical units. The minimum SPH smoothing length is $0.5 \\times \\epsilon$.\n\nTo prepare a few test cases that are representative of nearby clusters observed by {\\textit{Planck}{}}, we select three situations occuring in a rich and dense environment and displaced them at various distances from the observer. The first and second situations are two different time snapshots of the same Lagrangian region, referring to $z=0.25$ and $z=0$, respectively. The third case corresponds to a different region.\n\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item A \\textit{massive accreting} cluster. \nWith a binding mass of $M_{200}= 7 \\times 10^{14} h^{-1} \\mathrm{M}_{\\odot}$, this cluster exhibits a rather regular morphology in the innermost regions. However, the cluster periphery is more disturbed. In particular, the object has recently accreted a satellite that is currently lying at a projected distance of 2 Mpc. \nThe smaller object has a temperature of about $2$--$3$ keV, corresponding to a mass of a few $10^{14}  h^{-1}\\mathrm{M}_{\\odot}$. Following its cosmic evolution, we see that it will orbit on the south to the main halo with a projected impact parameter of about $500$ kpc, and will lose most of its gas content. In the cosmic time selected, the satellite and main cluster are connected by a tenuous and irregular filament with Compton parameter of $y \\sim 10^{-5}$.\n\\item A \\textit{connected} cluster pair. \nAfter the merger described above and after having stripped most of the gas of the subclump, the main halo is approached by another massive object of comparable mass. At redshift zero the two systems lie on the same plane of the sky and are about $1.5$ Mpc apart. By studying their evolutions, we observed that they are moving toward each other and in the future they will merge. At the current epoch, they are connected by a bright filament with a Compton parameter of $y \\sim 3 \\times 10^{-5}$.\n\\item A \\textit{colliding} cluster system. \nThis system is composed of multiple objects that are all located in the plane of the sky along a large-scale filamentary structure. The main cluster is at the center of the image and has a mass of $\\mathrm{M}_{500}\\sim 10^{15} \\mathrm{M}_{\\odot}$. It shows a prominent substructure at $\\sim$ 50 arcmin. This is the residual of a merger with two smaller groups. The violent merger with the main halo had an impact parameter of almost zero and the gas of one of the smallest systems has been completely stripped away.   The collision direction is witnessed by a prominent bow shock that is visible as a sharp SZ edge immediately to the west of the merged objects. A third cluster, connected by a filament, is located ahead of the shock outside the field of view. The snapshot shown corresponds to $z \\sim 0$, thus we cannot clearly see the future of this object. However, by looking at its past motion we presume that it will most likely produce a second major merger.\n\n\\end{enumerate}\n\n\\begin{table}\n\\caption{Galactic Dust and Instrumental Noise Properties Assumed at 350 GHz in the Mock HFI Frequency Maps. \\label{tab:bck_par}}\n\\begin{center}\n\\begin{tabular}{cccccc}\n\\tableline\\tableline\n \\multicolumn{2}{c}{Galactic}    &  Noise      & Median    &   Dust       & Median   \\\\\n \\multicolumn{2}{c}{coordinates} &  Standard   & Dust      &   Standard   & Dust to SZ   \\\\\n   $l$          &  $b$           &  Deviation  & Intensity &   Deviation & Intensity  \\\\\n   (deg)        &  (deg)         &  ($\\mu$K)   & ($\\mu$K)  &   ($\\mu$K)  & Ratio \\tablenotemark{a}  \\\\\n\\tableline\n   0& -15&   99.3&  923.6&  254.6&  8.6 \\\\\n   0& -30&   88.5&  591.8&  147.9&  5.8 \\\\\n  90& -60&   78.8&  397.0&   74.6&  3.5 \\\\\n   0& -60&   74.9&  104.8&   42.4&  1.0 \\\\\n  90& -30&   72.8&  612.1&  502.6&  6.7 \\\\\n  90& -15&   66.1& 1560.2&  422.3& 13.2 \\\\\n 270& -60&   64.3&  257.7&   70.2&  2.5 \\\\\n 270& -15&   60.8& 2229.5&  566.3& 22.4 \\\\\n 270& -30&   28.2&  550.5&  135.4&  4.7 \\\\\n\\tableline\n\\tableline\n\\end{tabular}\n\\tablecomments{Pixel areas are 1 square arcminute. Sky regions have been sorted by decreasing noise variances.}\n\\tablenotetext{a}{This ratio has been measured in a region of the field of view where the Compton parameter exceeds $10^{-5}$. }\n\\end{center}\n\\end{table}\n\n\n\n\nTo show that these test cases may be representative of real cluster configurations, in Fig. \\ref{Fig:a399_coma_vs_gadget} we compare the $y$ parameter of two of the simulations with actual {\\textit{Planck}{}}~measurements derived from a Modified Inter Linear Combination Algorithm \\citep[MILCA; ][]{Hurier_13,Planck_2015_szmap}. The SZ map of each cluster is also visible on the top panel of Fig. \\ref{Fig:clusters_vs_snr}. Fig. \\ref{Fig:a399_coma_vs_gadget} demonstrates, in particular, that displacing the \\textit{connected cluster} at $z=0.04$ yields an angular separation between the two cluster peaks that is comparable to the separation of both components of the cluster pair A399-A401. Moreover, displacing the  \\textit{colliding cluster} at $z=0.01$ leads to a Compton parameter decrement that matches its true analog that is measured across the most prominent shock front in Coma \\citep[see also][]{Planck_intermediate_X_coma}.\n\n\n\n\n\n\\subsection{Mock HFI frequency maps}\n\n\nTo emulate HFI observations of our simulated clusters, we choose a few characteristic regions of the sky in terms of thermal SZ signal-to-noise ratio and predict the 2D signal to be registered in each HFI channel by adding our tSZ maps to the expected specific intensities of the CMB and Galactic dust components. For each HFI channel and sky region, frequency maps $I(k, l, \\nu)$ are convolved with the HFI beam and added to a noise realization that matches the noise variance and power spectrum registered to the cluster scales in the raw data. The amplitude of the CMB SED is extracted from the Planck CMB map that is\nreconstructed using the Spectral Matching Independent Component Analysis (SMICA) component separation algorithm \\citep{Planck_2013_XII_components}, while the amplitude of the Galactic dust SED accommodates the dust optical depth mapped at 353 GHz as a result of the {\\textit{Planck}{}}~ all-sky model of thermal dust  \\citep{Planck_2013_XI_tdustmodel}. For simplicity, a constant spectral index, $\\beta$ = 1.8, is assumed for the dust SED, consistent with the first all-sky modeling from {\\textit{Planck}{}}~ and IRAS data \\citep{Planck_early_XIX_tdustmodel}. An example of mock HFI frequency maps of the \\textit{colliding} cluster system is shown for ($l=270^\\circ$, $b=-30^\\circ$) in Fig. \\ref{Fig:HFI_freqmaps}, while a few properties of the Galactic dust and instrumental noise included in the 350 GHz maps are summarized in Tab.\\ref{tab:bck_par} for each simulated sky position. The dust intensity in particular mostly depends on the Galactic latitude, and is shown to dominate the positive side of the thermal SZ signal ($f_{\\nu} > $ 217 GHz). \n\n\n\n\\subsection{SZ Map restoration}\n\n Figures \\ref{Fig:clusters_vs_snr}--\\ref{Fig:clusters_vs_redshift} present the restoration of simulated SZ maps for a soft thresholding, \n\n\n", "itemtype": "equation", "pos": 17875, "prevtext": "\n\nTo further extract the curvelet coefficients of the component maps, we normalize wavelet coefficients to their standard deviation, ${\\mathscr{Wt}}' = {\\mathscr{Wt}}/d{\\mathscr{Wt}}$. Subsequently, we compute a so-called curvelet transform of the first generation \\citep[][]{Starck_03a} that combines a 2D {$\\mathrm{{B}_{3}}$-spline{~}} wavelet transform with a set of ridgelet transforms that are performed within binning blocks of the wavelet detail images. Finally, the denoising of wavelet and curvelet transforms is performed via a thresholding of the coefficients whose absolute value does not exceed a few standard deviations. In the case of the CMB wavelet transform, this standard deviation is straightforwardly defined in {Equation~}(\\ref{equ:dwt}). On the other hand for the Galactic dust and the tSZ curvelet transforms, the coefficient variance depends on the orientation and it has been preliminarily estimated and tabulated by Monte-Carlo simulations of a Gaussian white noise.  In order to work with positive component maps, lower the dynamics of the reconstructed tSZ images, and reduce the relative amplitude of the thresholding artifacts, the quantities that have been effectively denoised and mapped are\n\n\n", "index": 15, "text": "\\begin{equation}\t\n\t\t{\\boldsymbol{{{{A_{o}}}}}}(k,l) =  \\left[ \\begin{array}{c} {{\\mathcal{R}}_{ {\\mathscr{Wt}}}  \\bar{\\mathscr{Wt}}[ 1 + {\\mathrm{A_{\\mathrm{CMB}}}}(k,l)]}  \\\\ {\\mathcal{R}}_{ {\\mathscr{Cur}}}  \\bar{\\mathscr{Cur}}[{{\\mathrm{A_{\\mathrm{dust}}}}}(k,l)] \\\\  {\\mathcal{R}}_{ {\\mathscr{Cur}}}  \\bar{\\mathscr{Cur}}[{\\ln(1+{\\mathrm{A_{\\mathrm{SZ}}}})}(k,l)] \\end{array} \\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{\\bm{{{{A_{o}}}}}}(k,l)=\\left[\\begin{array}[]{c}{{\\mathcal{R}}_{{\\mathscr{Wt}}%&#10;}\\bar{\\mathscr{Wt}}[1+{\\mathrm{A_{\\mathrm{CMB}}}}(k,l)]}\\\\&#10;{\\mathcal{R}}_{{\\mathscr{Cur}}}\\bar{\\mathscr{Cur}}[{{\\mathrm{A_{\\mathrm{dust}}%&#10;}}}(k,l)]\\\\&#10;{\\mathcal{R}}_{{\\mathscr{Cur}}}\\bar{\\mathscr{Cur}}[{\\ln(1+{\\mathrm{A_{\\mathrm{%&#10;SZ}}}})}(k,l)]\\end{array}\\right],\" display=\"block\"><mrow><mrow><mrow><msub><mi>𝑨</mi><mi>𝒐</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>[</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi></mrow></msub><mo>⁢</mo><mover accent=\"true\"><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi></mrow><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>CMB</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mrow><mi class=\"ltx_font_mathscript\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓊</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓇</mi></mrow></msub><mo>⁢</mo><mover accent=\"true\"><mrow><mi class=\"ltx_font_mathscript\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓊</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓇</mi></mrow><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>dust</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mrow><mi class=\"ltx_font_mathscript\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓊</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓇</mi></mrow></msub><mo>⁢</mo><mover accent=\"true\"><mrow><mi class=\"ltx_font_mathscript\">𝒞</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓊</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓇</mi></mrow><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi mathvariant=\"normal\">A</mi><mi>SZ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr></mtable><mo>]</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\nof the wavelet and curvelet coefficients at $\\lambda = 1.5~\\sigma$, after 3 Van Cittert iterations performed with $\\alpha=0.25$ (see Equ. \\ref{equ:Van_cittert}). For each map, the restored signal, ${\\mathrm{A_{\\mathrm{SZ}}}}$, is shown together with the signal-to-noise ratio:\n \n \n", "itemtype": "equation", "pos": 31753, "prevtext": "\n\nwhere $ \\bar{\\mathscr{Wt}}$ and $ \\bar{\\mathscr{Cur}}$ denote the thresholded wavelet and curvelet transforms, respectively, and ${\\mathcal{R}}_{{\\mathscr{Wt}}}$ and ${\\mathcal{R}}_{{\\mathscr{Cur}}}$ denote the relative reconstruction operators.\n\n\\subsubsection{Image restoration}\n\nBecause the denoised component maps ${\\boldsymbol{{{{A_{o}}}}}}(k,l) $ have been\nestimated from the mixing of frequency maps that were\nregistered at various angular resolutions, they might be altered\nby aliasing artifacts. In order to take advantage of the angular\nresolution available at each frequency, we iteratively deconvolve\nall component maps from the HFI beams by means of a\nVan Cittert algorithm \\citep{VanCittert_1931}. More precisely, at each iteration $i$ we associate a set of denoised frequency maps with the component maps ${\\boldsymbol{{{A_{i}}}}}$ following {Equation~}(\\ref{equ:freq_maps}). We convolve these frequency maps with their specific beams and restore a new set of point-spread function (PSF)-convolved component maps $P*{\\boldsymbol{{{A_{n}}}}}$ via a new combination of WLS estimate and multi-scale denoising. Starting from a first guess ${\\boldsymbol{{{{A_{o}}}}}}(k,l) $, the Van Cittert iteration yields: \n\n\\begin{eqnarray}\n\t{\\boldsymbol{{{R_{n}(k, l)}}}} &=& {\\boldsymbol{{{{A_{o}}}}}}(k, l) - [P * {\\boldsymbol{{{{A_{n}}}}}} ](k, l) \\nonumber \\\\\n\t{\\boldsymbol{{{{A_{n+1}}}}}} &=& {\\boldsymbol{{{{A_{n}}}}}}+\\alpha {\\boldsymbol{{{R_{n}}}}}(k, l)\n\t\\label{equ:Van_cittert}\n\\end{eqnarray}\n\nAs proposed in \\citet{Murtagh_95}, the locus of the significant (i.e. nonzero) wavelet and curvelet coefficients of ${\\boldsymbol{{{{A_{o}}}}}}$ defines a `multiresolution support' that regularizes the algorithm. By reconstructing the residual ${\\boldsymbol{{{R_{n}(k, l)}}}}$ from the wavelet and curvelet coefficients located within this multiresolution support \\citep[see also][]{Starck_02}, we prevent any noise amplification during the Van Cittert iteration.\n\n\\begin{figure*}[h]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f3.eps}}\n  \\caption{Compton parameter of two SPH simulated clusters presented in this work compared with real {\\textit{Planck}{}}~ measurements. {{Left panel: }} $y$ parameter obtained along an image cut intercepting both maxima of the \\textit{connected cluster} map displaced at $z=0.04$. The dashed line (gray area) represents a cut of the thermal SZ signal (variance), reconstructed via the MILCA algorithm toward the cluster pair A399-A401. {{Right panel: }} Same as the left panel but for the \\textit{colliding cluster} displaced at $z=0.01$ and the Coma cluster.\\label{Fig:a399_coma_vs_gadget}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[h]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f2.eps}}\n  \\caption{Mock HFI frequency maps of the $z=0.015$ \\textit{accreting cluster} positioned at $l=270^\\circ$ and $b=-30^\\circ$.\\label{Fig:HFI_freqmaps}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f4.eps}}\n  \\caption{{{Top panels: }} thermal SZ map of the \\textit{accreting, connected, and colliding} clusters displaced at $z=0.015$, $z=0.015$ and $z=0.01$, respectively. The white isocontours are logarithmically equispaced by a factor of $2^{1/4}$. The faintest isocontour corresponds to a Compton parameter of y=$7.5 \\times 10^{-6}$, except for the \\textit{connected} cluster whose faintest isocontour corresponds to  $y=10^{-5}$. {{Middle and bottom panels: }} restored maps of the SZ signal for two positions in the sky characterized by a low and a high instrumental noise variance.\\label{Fig:clusters_vs_snr}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f5.eps}}\n  \\caption{Restored thermal SZ maps of the \\textit{connected} cluster displaced at $z=0.05$ and positioned at various characteristic locations in the sky. The white isocontours are logarithmically equispaced by a factor of $2^{1/4}$, the faintest isocontour corresponding to a Compton parameter of $y=10^{-5}$.\\label{Fig:connected_vs_position}}\n   \\end{center}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n   \\begin{center}\n  \\resizebox{\\hsize}{!}{\\includegraphics[]{planck_gadget_f6.eps}}\n  \\caption{{{Top panels: } Restored thermal SZ maps of the \\textit{connected, accreting and colliding} clusters displaced at $z=0.02$ and positioned in the sky at ($l=270^\\circ$, $b=-30^\\circ$). {{Middle and bottom panels: } Same as top panels as for $z=0.04$ and $z=0.07$, respectively. White isocontours are logarithmically equispaced by a factor of $2^{1/4}$, the faintest isocontour corresponding to a Compton parameter of $y=7.5\\times10^{-6}$. \\label{Fig:clusters_vs_redshift}}}}\n   \\end{center}\n\\end{figure*}\n\n\n\n\\section{Mock observations of galaxy clusters\\label{sect:mock_observations}}\n\n\n\\subsection{The thermal SZ signal as seen from SPH simulations}\n\nIn order to test the restoration algorithm detailed in the previous section, we extracted thermal SZ maps of simulated galaxy clusters. The hydro-simulations employed are carried out by the Smoothed-Particle-Hydrodynamic  code GADGET \\citep{springel05}.  The details of the simulations and the physics adopted are presented in \\cite{planelles.etal.14} and \\cite{rasia.etal.14}. Here, we briefly list the essential points and address the\nmentioned papers for a more exhaustive description. The\nclusters used in the present work come from two Lagrangian\nregions that were selected from a parent dark matter\ncosmological box. The regions are re-simulated at a higher-mass\nresolution, adding baryons either in gaseous or stellar\nform. The re-simulations treat processes such as radiative\ncooling; star formation and evolution; kinetic feedback by type\nIa and type II supernovae and from asymptotic Giant Branch\nstars; thermal feedback from active galactic nuclei resulting\nfrom gas accretion onto supermassive black holes \\citep[see also][]{ragone.etal.13}. Masses of dark matter and gas particles are equal to $m_{\\mathrm{dm}} = 8.47 \\times 10^8 h^{-1} \\mathrm{M}_{\\odot}$ and $m_{\\mathrm{gas}}=1.53 \\times 10^8 h^{-1} \\mathrm{M}_{\\odot}$, respectively. The adopted Plummer-equivalent softening length for computing the gravitational force is set to $\\epsilon = 5 h^{-1}$ kpc in comoving units up to $z=2$ then it is switched to the same value but in physical units. The minimum SPH smoothing length is $0.5 \\times \\epsilon$.\n\nTo prepare a few test cases that are representative of nearby clusters observed by {\\textit{Planck}{}}, we select three situations occuring in a rich and dense environment and displaced them at various distances from the observer. The first and second situations are two different time snapshots of the same Lagrangian region, referring to $z=0.25$ and $z=0$, respectively. The third case corresponds to a different region.\n\n\\begin{enumerate}[leftmargin=.75cm,noitemsep]\n\\item A \\textit{massive accreting} cluster. \nWith a binding mass of $M_{200}= 7 \\times 10^{14} h^{-1} \\mathrm{M}_{\\odot}$, this cluster exhibits a rather regular morphology in the innermost regions. However, the cluster periphery is more disturbed. In particular, the object has recently accreted a satellite that is currently lying at a projected distance of 2 Mpc. \nThe smaller object has a temperature of about $2$--$3$ keV, corresponding to a mass of a few $10^{14}  h^{-1}\\mathrm{M}_{\\odot}$. Following its cosmic evolution, we see that it will orbit on the south to the main halo with a projected impact parameter of about $500$ kpc, and will lose most of its gas content. In the cosmic time selected, the satellite and main cluster are connected by a tenuous and irregular filament with Compton parameter of $y \\sim 10^{-5}$.\n\\item A \\textit{connected} cluster pair. \nAfter the merger described above and after having stripped most of the gas of the subclump, the main halo is approached by another massive object of comparable mass. At redshift zero the two systems lie on the same plane of the sky and are about $1.5$ Mpc apart. By studying their evolutions, we observed that they are moving toward each other and in the future they will merge. At the current epoch, they are connected by a bright filament with a Compton parameter of $y \\sim 3 \\times 10^{-5}$.\n\\item A \\textit{colliding} cluster system. \nThis system is composed of multiple objects that are all located in the plane of the sky along a large-scale filamentary structure. The main cluster is at the center of the image and has a mass of $\\mathrm{M}_{500}\\sim 10^{15} \\mathrm{M}_{\\odot}$. It shows a prominent substructure at $\\sim$ 50 arcmin. This is the residual of a merger with two smaller groups. The violent merger with the main halo had an impact parameter of almost zero and the gas of one of the smallest systems has been completely stripped away.   The collision direction is witnessed by a prominent bow shock that is visible as a sharp SZ edge immediately to the west of the merged objects. A third cluster, connected by a filament, is located ahead of the shock outside the field of view. The snapshot shown corresponds to $z \\sim 0$, thus we cannot clearly see the future of this object. However, by looking at its past motion we presume that it will most likely produce a second major merger.\n\n\\end{enumerate}\n\n\\begin{table}\n\\caption{Galactic Dust and Instrumental Noise Properties Assumed at 350 GHz in the Mock HFI Frequency Maps. \\label{tab:bck_par}}\n\\begin{center}\n\\begin{tabular}{cccccc}\n\\tableline\\tableline\n \\multicolumn{2}{c}{Galactic}    &  Noise      & Median    &   Dust       & Median   \\\\\n \\multicolumn{2}{c}{coordinates} &  Standard   & Dust      &   Standard   & Dust to SZ   \\\\\n   $l$          &  $b$           &  Deviation  & Intensity &   Deviation & Intensity  \\\\\n   (deg)        &  (deg)         &  ($\\mu$K)   & ($\\mu$K)  &   ($\\mu$K)  & Ratio \\tablenotemark{a}  \\\\\n\\tableline\n   0& -15&   99.3&  923.6&  254.6&  8.6 \\\\\n   0& -30&   88.5&  591.8&  147.9&  5.8 \\\\\n  90& -60&   78.8&  397.0&   74.6&  3.5 \\\\\n   0& -60&   74.9&  104.8&   42.4&  1.0 \\\\\n  90& -30&   72.8&  612.1&  502.6&  6.7 \\\\\n  90& -15&   66.1& 1560.2&  422.3& 13.2 \\\\\n 270& -60&   64.3&  257.7&   70.2&  2.5 \\\\\n 270& -15&   60.8& 2229.5&  566.3& 22.4 \\\\\n 270& -30&   28.2&  550.5&  135.4&  4.7 \\\\\n\\tableline\n\\tableline\n\\end{tabular}\n\\tablecomments{Pixel areas are 1 square arcminute. Sky regions have been sorted by decreasing noise variances.}\n\\tablenotetext{a}{This ratio has been measured in a region of the field of view where the Compton parameter exceeds $10^{-5}$. }\n\\end{center}\n\\end{table}\n\n\n\n\nTo show that these test cases may be representative of real cluster configurations, in Fig. \\ref{Fig:a399_coma_vs_gadget} we compare the $y$ parameter of two of the simulations with actual {\\textit{Planck}{}}~measurements derived from a Modified Inter Linear Combination Algorithm \\citep[MILCA; ][]{Hurier_13,Planck_2015_szmap}. The SZ map of each cluster is also visible on the top panel of Fig. \\ref{Fig:clusters_vs_snr}. Fig. \\ref{Fig:a399_coma_vs_gadget} demonstrates, in particular, that displacing the \\textit{connected cluster} at $z=0.04$ yields an angular separation between the two cluster peaks that is comparable to the separation of both components of the cluster pair A399-A401. Moreover, displacing the  \\textit{colliding cluster} at $z=0.01$ leads to a Compton parameter decrement that matches its true analog that is measured across the most prominent shock front in Coma \\citep[see also][]{Planck_intermediate_X_coma}.\n\n\n\n\n\n\\subsection{Mock HFI frequency maps}\n\n\nTo emulate HFI observations of our simulated clusters, we choose a few characteristic regions of the sky in terms of thermal SZ signal-to-noise ratio and predict the 2D signal to be registered in each HFI channel by adding our tSZ maps to the expected specific intensities of the CMB and Galactic dust components. For each HFI channel and sky region, frequency maps $I(k, l, \\nu)$ are convolved with the HFI beam and added to a noise realization that matches the noise variance and power spectrum registered to the cluster scales in the raw data. The amplitude of the CMB SED is extracted from the Planck CMB map that is\nreconstructed using the Spectral Matching Independent Component Analysis (SMICA) component separation algorithm \\citep{Planck_2013_XII_components}, while the amplitude of the Galactic dust SED accommodates the dust optical depth mapped at 353 GHz as a result of the {\\textit{Planck}{}}~ all-sky model of thermal dust  \\citep{Planck_2013_XI_tdustmodel}. For simplicity, a constant spectral index, $\\beta$ = 1.8, is assumed for the dust SED, consistent with the first all-sky modeling from {\\textit{Planck}{}}~ and IRAS data \\citep{Planck_early_XIX_tdustmodel}. An example of mock HFI frequency maps of the \\textit{colliding} cluster system is shown for ($l=270^\\circ$, $b=-30^\\circ$) in Fig. \\ref{Fig:HFI_freqmaps}, while a few properties of the Galactic dust and instrumental noise included in the 350 GHz maps are summarized in Tab.\\ref{tab:bck_par} for each simulated sky position. The dust intensity in particular mostly depends on the Galactic latitude, and is shown to dominate the positive side of the thermal SZ signal ($f_{\\nu} > $ 217 GHz). \n\n\n\n\\subsection{SZ Map restoration}\n\n Figures \\ref{Fig:clusters_vs_snr}--\\ref{Fig:clusters_vs_redshift} present the restoration of simulated SZ maps for a soft thresholding, \n\n\n", "index": 17, "text": "\\begin{equation}\n\\bar{\\mathscr{Wt}} = \\text{sgn}({\\mathscr{Wt}}) \\left(|{\\mathscr{Wt}}| - \\lambda\\right)_{+}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\bar{\\mathscr{Wt}}=\\text{sgn}({\\mathscr{Wt}})\\left(|{\\mathscr{Wt}}|-\\lambda%&#10;\\right)_{+}\" display=\"block\"><mrow><mover accent=\"true\"><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi></mrow><mo stretchy=\"false\">¯</mo></mover><mo>=</mo><mrow><mtext>sgn</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mrow><mo>(</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi class=\"ltx_font_mathscript\">𝒲</mi><mo>⁢</mo><mi class=\"ltx_font_mathscript\">𝓉</mi></mrow><mo stretchy=\"false\">|</mo></mrow><mo>-</mo><mi>λ</mi></mrow><mo>)</mo></mrow><mo>+</mo></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\n{\\textit{Effect of the instrumental noise variance.\\\\ }}\nFig. 4 shows the tSZ maps of our test clusters positioned at low redshift, in a couple of sky regions corresponding to the lowest and highest variance of the instrumental noise in Tab. 1. In this figure, all characteristic features with a typical Compton parameter of $y \\ge10^{-5}$ are bright enough to be restored. More specifically, both components of the \\textit{accreting} cluster are recovered for each sky region, though the SNR decrement makes it difficult to recover the true shape of the tenuous filament connecting the two clusters at ($l=0^{\\circ}$, $b=-15^{\\circ}$). The extended bow shock escaping from the \\textit{colliding} clusters is also detectable for each sky region, together with the filament connecting these clusters to their third companion. \\\\\n\n{\\textit{Effect of the instrumental noise variance and dust intensity.\\\\ }}\nIn Fig. 5, the tSZ signal of the \\textit{connected cluster} displaced at $z=0.04$ is mapped for the sky positions detailed in Tab. 1. The cluster system is restored with an SNR larger than 14 for each sky region. In particular, the position of the cluster peaks and the orientation of the connecting filament are preserved in any case. The image SNR turns out to be roughly correlated with the instrumental noise variance regardless of the Galactic latitude, which suggests that it essentially depends on statistics. \\\\\n\n{\\textit{Effect of the angular distance\\\\ }}\nA few tSZ maps of our test clusters that were displaced at higher redshifts are finally shown on Fig. 6. The redshift values of 0.02, 0.04 and 0.07 correspond to two successive decrements of the angular distances by a factor of two. Separated by two PSF radii, both components of the \\textit{connected} and \\textit{accreting} clusters are well-resolved even at these redshifts. The shock front is also clearly visible at $z=0.02$, while its companion filament is detected up to $z=0.04$.\n\n\\begin{figure}[t]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f7.eps}}\n  \\caption{Radially averaged Compton parameter of a nearby sample of galaxy clusters detected with a threshold higher than $S/N=5$ in the  {\\textit{Planck}{}}~ catalog.  Apparent Clusters radii, $r_{500}$, have been selected to exceed the PSF width for each HFI frequency map. This modeling assumes the radial pressure structure proposed by \\citet{Arnaud_10}, and a 2D convolution by a mixture of the Gaussian Planck beams weighted by the expected SZ fluxes at each frequency. {Horizontal lines}: faintest isocontour levels in Fig. \\ref{Fig:clusters_vs_snr} to \\ref{Fig:clusters_vs_redshift}. {Vertical lines}: PSF widths expected in the four HFI frequency maps characterized by a significant thermal SZ signal. \n \\label{Fig:yszcat_profiles}}\n   \\end{center}\n\\end{figure}\n\n\n\\subsection{Perspectives on real observations}\n\n\n\n\n\n\n\n\n\nIn the previous section we showed that ICM anisotropies are accurately restored by our algorithm, provided that they are spatially resolved in each HFI frequency map and located in cluster regions where the Compton parameter, $y$, exceeds $10^{-5}$. As shown in Fig. \\ref{Fig:clusters_vs_snr}, the situation is more critical for $y$ values that are lower than $10^{-5}$, since the restoration depends on statistics and dust emissivity for a given region of the sky. In practice, a severe detection threshold (3$\\sigma$ or more) would allow us to isolate ICM features down to $y$ values of  $5\\times10^{-6}$ in most of the sky regions, in particular when they are extended enough to be analyzed and averaged out on several PSF sizes.\n\nThough not intended to be considered as absolute limits for each specific target, these values provide us with a coarse assessment of the potential of the presented algorithm in the 2015 release of {\\textit{Planck}{}}~ data. To predict a number of appropriate targets,  we selected a sample of galaxy clusters in the {\\textit{Planck}{}}~ catalog of SZ sources whose $r_{500}$ radii exceed the PSF size of each HFI frequency map, and whose detection thresholds, S/N, are higher than 5 in the sense of the Multifrequency Matched Filter detection algorithm detailed in \\citet{Melin_06}. Fig. \\ref{Fig:yszcat_profiles} exhibits the radial profiles of the $y$ parameter expected toward these clusters if one assumes a pressure structure that follows the average profile measured for a representative sample of the X-ray cluster population \\citep{Arnaud_10}. The cluster radii, $r_{500}$, and integrated-pressure, $\\mathrm{Y}_{5r_{500}}$, follow the scaling relation proposed by the Planck collaboration to constrain cluster masses from SZ measurements \\citep{Planck_2013_XX_cosmo}. The radially averaged Compton parameter exceeds $10^{-5}$ for 57 clusters at a distance from the center that exceeds the PSF size of each HFI frequency map. Lowering our selection criterion, at variance, to a $y$ parameter of $7.5\\times10^{-6}$ would yield 81 clusters for which ICM anisotropies would be detectable beyond the PSF size of each HFI frequency map. \n\nBeyond the brightest central regions of clusters, matter filaments also connect the component of cluster systems, and might become detectable at a larger radii than expected within isolated, spherically symmetric clusters. A typical sample of targets for such studies is composed of 18 pairs of clusters from the {\\textit{Planck}{}}~ catalog, detected with an S/N threshold that is higher 5, showing an angular separation that is lower than $1^{\\circ}$ and a redshift interval that is lower than 0.01. \n\n\n\\section*{Conclusion}\n\n\tWe presented a multi-scale algorithm aimed at restoring the thermal SZ maps of extended galaxy clusters observed with the {\\textit{Planck}{}}~ HFI bolometer arrays. The demixing of the thermal SZ\nsignal with respect to the CMB and thermal dust is tackled\nthrough locally weighted likelihood maximizations, which can\nbe seen as a generalization of kernel smoothing to the\nmultivariate case. The restoration of the component maps is performed via a Van Cittert deconvolution that is restricted to the most significant wavelet and curvelet coefficients of these components. \n\t\n\tThe algorithm performance has been tested against mock observations of galaxy clusters positioned at various characteristic positions in the sky. Though unavoidably idealized\\footnote{Typical real restoration of the SZ signal might also include a modelling of the expected spatial variation of the dust spectral index, and a masking of known point-like sources that hold a specific SED.}, these observations mimic the noise variance and power spectrum of the full {\\textit{Planck}{}}~ mission, and also hold CMB or dust SED and anisotropies that are representative of the extended sky emissions at high Galactic latitudes \\citep[$|b| > 20$; see, e.g.][]{Boulanger_96,Planck_2013_XI_tdustmodel}. They show us, in particular, that {\\textit{Planck}{}}~ should allow us to detect filaments in the cluster peripheries and large-scale shocks in colliding galaxy clusters that feature a favorable geometry. The {\\textit{Planck}{}}~ catalog of SZ sources includes about 60 bright and well-resolved galaxy clusters for which such features might be detected. It also holds a number of spatially resolved cluster systems, which are appealing candidates for searching for connecting filaments. The unique algorithm input being a set of radio frequency maps with their characteristic variances and beams, other space or ground based observations might be added to the HFI data in order to further improve the angular resolution and SNR of the restored SZ maps. \n\t\n\\acknowledgments\n\nWe wish to thank Giancarlo De Gasperis, Guillaume Hurier, and Juan Macias-Perez for fruitful discussion about the {\\textit{Planck}{}}~data analysis. We also thank the referee for her/his constructive comments which helped us to improve our manuscript. We acknowledge the use of image analysis routines of the Interactive Sparse astronomical data Analysis Package (ISAP) that was developed in the CosmoStat laboratory at CEA Saclay. We are greatly indebted to the whole Dianoga team, who produced the simulations used in this work (PIs. Stefano Borgani, Giuseppe Murante, Klaus Dolag). The mock observations presented in this work mimick real observations that were obtained with {\\textit{Planck}{}}, an ESA science mission with instruments and contributions that are directly funded by ESA Member States, NASA, and Canada. H.B. thanks the University of Michigan, where this work was initiated, for its hospitality. P.M. acknowledges support by grant NASA NNX14AC22G. E.R. acknowledges support by FP7-PEOPLE-2013-IIF (Grant Agreement PIIF-GA-2013-627474) and NSF AST-1210973.\n\n\\appendix\n\n\\section{Spatially weighted likelihood and $\\chi^2$ estimates.}\n\nLet us assume that a spatially variable data set, $x_t$, sampled along coordinate $t$, is the realization of the probability density function $p(x_t | {\\boldsymbol{\\theta}}(t))$. An asymptotically unbiased and efficient estimate of the underlying parameter vector ${\\boldsymbol{\\theta}}(t_o)$ might be provided by the maximization of its log-likelihood function within some coherence region ${\\mathcal{S}}$, perhaps adjacent to $t_o$:\n\n\n", "itemtype": "equation", "pos": 32157, "prevtext": "\nof the wavelet and curvelet coefficients at $\\lambda = 1.5~\\sigma$, after 3 Van Cittert iterations performed with $\\alpha=0.25$ (see Equ. \\ref{equ:Van_cittert}). For each map, the restored signal, ${\\mathrm{A_{\\mathrm{SZ}}}}$, is shown together with the signal-to-noise ratio:\n \n \n", "index": 19, "text": "\\begin{equation}\nSNR =10 \\log \\frac {\\| {\\mathrm{A_{\\mathrm{SZ}}}} \\|}{\\| {\\mathrm{A_{\\mathrm{SZ}}}} - \\widehat{{\\mathrm{A_{\\mathrm{SZ}}}}}\\|}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"SNR=10\\log\\frac{\\|{\\mathrm{A_{\\mathrm{SZ}}}}\\|}{\\|{\\mathrm{A_{\\mathrm{SZ}}}}-%&#10;\\widehat{{\\mathrm{A_{\\mathrm{SZ}}}}}\\|}.\" display=\"block\"><mrow><mrow><mrow><mi>S</mi><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mi>R</mi></mrow><mo>=</mo><mrow><mn>10</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mfrac><mrow><mo>∥</mo><msub><mi mathvariant=\"normal\">A</mi><mi>SZ</mi></msub><mo>∥</mo></mrow><mrow><mo>∥</mo><mrow><msub><mi mathvariant=\"normal\">A</mi><mi>SZ</mi></msub><mo>-</mo><mover accent=\"true\"><msub><mi mathvariant=\"normal\">A</mi><mi>SZ</mi></msub><mo>^</mo></mover></mrow><mo>∥</mo></mrow></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nThis estimate, however, relies on the assumption that ${\\boldsymbol{\\theta}}(t_o)$ is locally stationary within ${\\mathcal{S}}$, whose morphology and extension may be unknown a priori. Adopting a Bayesian point-of-view, the weighted log-likelihood approach \\citep[e.g.][]{Hastie_86, Fan_98} introduces a spatially variable penalization $w(t)$ that aims to lower any relative entropy loss associated with spatial variations of ${\\boldsymbol{\\theta}}(t)$, and thus reduce the risk of the maximum likelihood estimate \\citep{Wang_06}:\n\n \n", "itemtype": "equation", "pos": 41547, "prevtext": "\n\n{\\textit{Effect of the instrumental noise variance.\\\\ }}\nFig. 4 shows the tSZ maps of our test clusters positioned at low redshift, in a couple of sky regions corresponding to the lowest and highest variance of the instrumental noise in Tab. 1. In this figure, all characteristic features with a typical Compton parameter of $y \\ge10^{-5}$ are bright enough to be restored. More specifically, both components of the \\textit{accreting} cluster are recovered for each sky region, though the SNR decrement makes it difficult to recover the true shape of the tenuous filament connecting the two clusters at ($l=0^{\\circ}$, $b=-15^{\\circ}$). The extended bow shock escaping from the \\textit{colliding} clusters is also detectable for each sky region, together with the filament connecting these clusters to their third companion. \\\\\n\n{\\textit{Effect of the instrumental noise variance and dust intensity.\\\\ }}\nIn Fig. 5, the tSZ signal of the \\textit{connected cluster} displaced at $z=0.04$ is mapped for the sky positions detailed in Tab. 1. The cluster system is restored with an SNR larger than 14 for each sky region. In particular, the position of the cluster peaks and the orientation of the connecting filament are preserved in any case. The image SNR turns out to be roughly correlated with the instrumental noise variance regardless of the Galactic latitude, which suggests that it essentially depends on statistics. \\\\\n\n{\\textit{Effect of the angular distance\\\\ }}\nA few tSZ maps of our test clusters that were displaced at higher redshifts are finally shown on Fig. 6. The redshift values of 0.02, 0.04 and 0.07 correspond to two successive decrements of the angular distances by a factor of two. Separated by two PSF radii, both components of the \\textit{connected} and \\textit{accreting} clusters are well-resolved even at these redshifts. The shock front is also clearly visible at $z=0.02$, while its companion filament is detected up to $z=0.04$.\n\n\\begin{figure}[t]\n   \\begin{center}\n  \\resizebox{.95\\hsize}{!}{\\includegraphics{planck_gadget_f7.eps}}\n  \\caption{Radially averaged Compton parameter of a nearby sample of galaxy clusters detected with a threshold higher than $S/N=5$ in the  {\\textit{Planck}{}}~ catalog.  Apparent Clusters radii, $r_{500}$, have been selected to exceed the PSF width for each HFI frequency map. This modeling assumes the radial pressure structure proposed by \\citet{Arnaud_10}, and a 2D convolution by a mixture of the Gaussian Planck beams weighted by the expected SZ fluxes at each frequency. {Horizontal lines}: faintest isocontour levels in Fig. \\ref{Fig:clusters_vs_snr} to \\ref{Fig:clusters_vs_redshift}. {Vertical lines}: PSF widths expected in the four HFI frequency maps characterized by a significant thermal SZ signal. \n \\label{Fig:yszcat_profiles}}\n   \\end{center}\n\\end{figure}\n\n\n\\subsection{Perspectives on real observations}\n\n\n\n\n\n\n\n\n\nIn the previous section we showed that ICM anisotropies are accurately restored by our algorithm, provided that they are spatially resolved in each HFI frequency map and located in cluster regions where the Compton parameter, $y$, exceeds $10^{-5}$. As shown in Fig. \\ref{Fig:clusters_vs_snr}, the situation is more critical for $y$ values that are lower than $10^{-5}$, since the restoration depends on statistics and dust emissivity for a given region of the sky. In practice, a severe detection threshold (3$\\sigma$ or more) would allow us to isolate ICM features down to $y$ values of  $5\\times10^{-6}$ in most of the sky regions, in particular when they are extended enough to be analyzed and averaged out on several PSF sizes.\n\nThough not intended to be considered as absolute limits for each specific target, these values provide us with a coarse assessment of the potential of the presented algorithm in the 2015 release of {\\textit{Planck}{}}~ data. To predict a number of appropriate targets,  we selected a sample of galaxy clusters in the {\\textit{Planck}{}}~ catalog of SZ sources whose $r_{500}$ radii exceed the PSF size of each HFI frequency map, and whose detection thresholds, S/N, are higher than 5 in the sense of the Multifrequency Matched Filter detection algorithm detailed in \\citet{Melin_06}. Fig. \\ref{Fig:yszcat_profiles} exhibits the radial profiles of the $y$ parameter expected toward these clusters if one assumes a pressure structure that follows the average profile measured for a representative sample of the X-ray cluster population \\citep{Arnaud_10}. The cluster radii, $r_{500}$, and integrated-pressure, $\\mathrm{Y}_{5r_{500}}$, follow the scaling relation proposed by the Planck collaboration to constrain cluster masses from SZ measurements \\citep{Planck_2013_XX_cosmo}. The radially averaged Compton parameter exceeds $10^{-5}$ for 57 clusters at a distance from the center that exceeds the PSF size of each HFI frequency map. Lowering our selection criterion, at variance, to a $y$ parameter of $7.5\\times10^{-6}$ would yield 81 clusters for which ICM anisotropies would be detectable beyond the PSF size of each HFI frequency map. \n\nBeyond the brightest central regions of clusters, matter filaments also connect the component of cluster systems, and might become detectable at a larger radii than expected within isolated, spherically symmetric clusters. A typical sample of targets for such studies is composed of 18 pairs of clusters from the {\\textit{Planck}{}}~ catalog, detected with an S/N threshold that is higher 5, showing an angular separation that is lower than $1^{\\circ}$ and a redshift interval that is lower than 0.01. \n\n\n\\section*{Conclusion}\n\n\tWe presented a multi-scale algorithm aimed at restoring the thermal SZ maps of extended galaxy clusters observed with the {\\textit{Planck}{}}~ HFI bolometer arrays. The demixing of the thermal SZ\nsignal with respect to the CMB and thermal dust is tackled\nthrough locally weighted likelihood maximizations, which can\nbe seen as a generalization of kernel smoothing to the\nmultivariate case. The restoration of the component maps is performed via a Van Cittert deconvolution that is restricted to the most significant wavelet and curvelet coefficients of these components. \n\t\n\tThe algorithm performance has been tested against mock observations of galaxy clusters positioned at various characteristic positions in the sky. Though unavoidably idealized\\footnote{Typical real restoration of the SZ signal might also include a modelling of the expected spatial variation of the dust spectral index, and a masking of known point-like sources that hold a specific SED.}, these observations mimic the noise variance and power spectrum of the full {\\textit{Planck}{}}~ mission, and also hold CMB or dust SED and anisotropies that are representative of the extended sky emissions at high Galactic latitudes \\citep[$|b| > 20$; see, e.g.][]{Boulanger_96,Planck_2013_XI_tdustmodel}. They show us, in particular, that {\\textit{Planck}{}}~ should allow us to detect filaments in the cluster peripheries and large-scale shocks in colliding galaxy clusters that feature a favorable geometry. The {\\textit{Planck}{}}~ catalog of SZ sources includes about 60 bright and well-resolved galaxy clusters for which such features might be detected. It also holds a number of spatially resolved cluster systems, which are appealing candidates for searching for connecting filaments. The unique algorithm input being a set of radio frequency maps with their characteristic variances and beams, other space or ground based observations might be added to the HFI data in order to further improve the angular resolution and SNR of the restored SZ maps. \n\t\n\\acknowledgments\n\nWe wish to thank Giancarlo De Gasperis, Guillaume Hurier, and Juan Macias-Perez for fruitful discussion about the {\\textit{Planck}{}}~data analysis. We also thank the referee for her/his constructive comments which helped us to improve our manuscript. We acknowledge the use of image analysis routines of the Interactive Sparse astronomical data Analysis Package (ISAP) that was developed in the CosmoStat laboratory at CEA Saclay. We are greatly indebted to the whole Dianoga team, who produced the simulations used in this work (PIs. Stefano Borgani, Giuseppe Murante, Klaus Dolag). The mock observations presented in this work mimick real observations that were obtained with {\\textit{Planck}{}}, an ESA science mission with instruments and contributions that are directly funded by ESA Member States, NASA, and Canada. H.B. thanks the University of Michigan, where this work was initiated, for its hospitality. P.M. acknowledges support by grant NASA NNX14AC22G. E.R. acknowledges support by FP7-PEOPLE-2013-IIF (Grant Agreement PIIF-GA-2013-627474) and NSF AST-1210973.\n\n\\appendix\n\n\\section{Spatially weighted likelihood and $\\chi^2$ estimates.}\n\nLet us assume that a spatially variable data set, $x_t$, sampled along coordinate $t$, is the realization of the probability density function $p(x_t | {\\boldsymbol{\\theta}}(t))$. An asymptotically unbiased and efficient estimate of the underlying parameter vector ${\\boldsymbol{\\theta}}(t_o)$ might be provided by the maximization of its log-likelihood function within some coherence region ${\\mathcal{S}}$, perhaps adjacent to $t_o$:\n\n\n", "index": 21, "text": "\\begin{equation}\n\\widehat{{\\boldsymbol{\\theta}}_{L}}(t_o) = \\underset{{\\boldsymbol{\\theta}}}{\\arg\\max} \\sum_{t \\in {\\mathcal{S}}} log\\left[p(x_t | {\\boldsymbol{\\theta}})\\right]\n\\label{equ:L}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\widehat{{\\bm{\\theta}}_{L}}(t_{o})=\\underset{{\\bm{\\theta}}}{\\arg\\max}\\sum_{t%&#10;\\in{\\mathcal{S}}}log\\left[p(x_{t}|{\\bm{\\theta}})\\right]\" display=\"block\"><mrow><mover accent=\"true\"><msub><mi>𝜽</mi><mi>L</mi></msub><mo>^</mo></mover><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>o</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munder accentunder=\"true\"><mrow><mi>arg</mi><mo>⁡</mo><mi>max</mi></mrow><mo>𝜽</mo></munder><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi></mrow></munder><mi>l</mi><mi>o</mi><mi>g</mi><mrow><mo>[</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>t</mi></msub><mo stretchy=\"false\">|</mo><mi>𝜽</mi><mo stretchy=\"false\">)</mo></mrow><mo>]</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\nWeighted likelihood estimates have already been proposed to denoise images that were altered by various kinds of parametric noise models, yielding specific local or non-local smoothing kernels \\citep{Polzehl_06,Deledalle_09}. They typically reduce the variance of the likelihood estimates, at the potential cost of introducing a bias related to the spatial variations of ${\\boldsymbol{\\theta}}(t)$ relative to $w(t)$ \\citep[][]{Fan_98,Eguchi_98}. In the present work, this scheme is applied in order to spatially smooth the local estimates of three extended component maps, ${\\boldsymbol{\\theta}}(t)$, which combine linearly with each other to provide us with {\\textit{Planck}{}}~HFI frequency maps. To lower the weighted likelihood bias, a key issue is to choose appropriate weights that tend to gather regions where the underlying parameters ${\\boldsymbol{\\theta}}(t)$ are likely to be uniform. It is the thresholding of wavelet and curvelet coefficients that are derived from convolutions of $\\widehat{{\\boldsymbol{\\theta}}_{wL}(t_o)}$ with a the positive and negative part of wavelet function, that allow us to achieve this goal a posteriori. \n\nTo adapt the weighted likelihood estimate to the {\\textit{Planck}{}}~HFI measurement of slowly variable flux, $\\mu({\\boldsymbol{\\theta}}(t))$, we may assume an additive gaussian noise with variance $\\sigma_t$. Introducing  $p(x_t | {\\boldsymbol{\\theta}})=N(x_t-\\mu({\\boldsymbol{\\theta}}), \\sigma_t)$ in Equ. (\\ref{equ:weighted_L}) leads to a weighted least squares minimization, as follows:\n  \n \n", "itemtype": "equation", "pos": 42287, "prevtext": "\n\nThis estimate, however, relies on the assumption that ${\\boldsymbol{\\theta}}(t_o)$ is locally stationary within ${\\mathcal{S}}$, whose morphology and extension may be unknown a priori. Adopting a Bayesian point-of-view, the weighted log-likelihood approach \\citep[e.g.][]{Hastie_86, Fan_98} introduces a spatially variable penalization $w(t)$ that aims to lower any relative entropy loss associated with spatial variations of ${\\boldsymbol{\\theta}}(t)$, and thus reduce the risk of the maximum likelihood estimate \\citep{Wang_06}:\n\n \n", "index": 23, "text": "\\begin{equation}\n \t\\widehat{{\\boldsymbol{\\theta}}_{wL}}(t_o) =  \\underset{{\\boldsymbol{\\theta}}}{\\arg\\max} \\sum_{t \\in {\\mathcal{S}}} w(t)~log\\left[p(x_t | {\\boldsymbol{\\theta}})\\right] \\label{equ:weighted_L}\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\widehat{{\\bm{\\theta}}_{wL}}(t_{o})=\\underset{{\\bm{\\theta}}}{\\arg\\max}\\sum_{t%&#10;\\in{\\mathcal{S}}}w(t)~{}log\\left[p(x_{t}|{\\bm{\\theta}})\\right]\" display=\"block\"><mrow><mover accent=\"true\"><msub><mi>𝜽</mi><mrow><mi>w</mi><mo>⁢</mo><mi>L</mi></mrow></msub><mo>^</mo></mover><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>o</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munder accentunder=\"true\"><mrow><mi>arg</mi><mo>⁡</mo><mi>max</mi></mrow><mo>𝜽</mo></munder><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi></mrow></munder><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow><mi>l</mi><mi>o</mi><mi>g</mi><mrow><mo>[</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>t</mi></msub><mo stretchy=\"false\">|</mo><mi>𝜽</mi><mo stretchy=\"false\">)</mo></mrow><mo>]</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06323.tex", "nexttext": "\n\n\\hspace{1cm}\n\nIn this way and provided that $\\mu({\\boldsymbol{\\theta}})$ is monotonous, deriving the above summation with respect to ${\\boldsymbol{\\theta}}$ yields $\\mu (\\hat{\\boldsymbol{\\theta}}) = \\frac{\\sum{w(t)  / {\\sigma_t}^2} x_t}{\\sum{{w(t)/ {\\sigma_t}^2}}}$. $\\mu (\\hat{\\boldsymbol{\\theta}})$ and $\\hat{\\boldsymbol{\\theta}}$ are thus reached via a smoothing of the data set $x_t$ with kernel $w(t)$, revealing us in turn any local linear perturbations of $\\mu ({\\boldsymbol{\\theta}}(t)) - \\mu (\\hat{\\boldsymbol{\\theta}}(t_o))$ as a function of the spatial variations of the underlying component maps. Moreover, introducing the change of variables $\\sigma_t^{\\prime} = \\sqrt{w(t)} \\sigma_t$, Equ. (\\ref{equ:HFI_wls}) is formally equivalent to an unweighted $\\chi^2$ estimate of ${\\boldsymbol{\\theta}}$, now assuming that $p(x_t | {\\boldsymbol{\\theta}})=N(x_t-\\mu({\\boldsymbol{\\theta}}), \\sigma_t^{\\prime})$, which allows us to derive $\\widehat{{\\boldsymbol{\\theta}}_{w\\chi^2}(t_o)}$ and its variance from any $\\chi^2$ minimization algorithm. In our work, this minimization is extended to the six {\\textit{Planck}{}}~HFI frequency maps, yielding Equ. (\\ref{equ:wchi2}). Given the specific models and smoothing kernels applied, a Levenberg--Marquardt algorithm ought to be more robust than a linear regression, especially considering the possibility of adding physical priors such as the positivity of two of the searched parameters. \n       \t\n\\bibliography{planck_gadget_apj}\n\n\n\n", "itemtype": "equation", "pos": 44057, "prevtext": "\n\nWeighted likelihood estimates have already been proposed to denoise images that were altered by various kinds of parametric noise models, yielding specific local or non-local smoothing kernels \\citep{Polzehl_06,Deledalle_09}. They typically reduce the variance of the likelihood estimates, at the potential cost of introducing a bias related to the spatial variations of ${\\boldsymbol{\\theta}}(t)$ relative to $w(t)$ \\citep[][]{Fan_98,Eguchi_98}. In the present work, this scheme is applied in order to spatially smooth the local estimates of three extended component maps, ${\\boldsymbol{\\theta}}(t)$, which combine linearly with each other to provide us with {\\textit{Planck}{}}~HFI frequency maps. To lower the weighted likelihood bias, a key issue is to choose appropriate weights that tend to gather regions where the underlying parameters ${\\boldsymbol{\\theta}}(t)$ are likely to be uniform. It is the thresholding of wavelet and curvelet coefficients that are derived from convolutions of $\\widehat{{\\boldsymbol{\\theta}}_{wL}(t_o)}$ with a the positive and negative part of wavelet function, that allow us to achieve this goal a posteriori. \n\nTo adapt the weighted likelihood estimate to the {\\textit{Planck}{}}~HFI measurement of slowly variable flux, $\\mu({\\boldsymbol{\\theta}}(t))$, we may assume an additive gaussian noise with variance $\\sigma_t$. Introducing  $p(x_t | {\\boldsymbol{\\theta}})=N(x_t-\\mu({\\boldsymbol{\\theta}}), \\sigma_t)$ in Equ. (\\ref{equ:weighted_L}) leads to a weighted least squares minimization, as follows:\n  \n \n", "index": 25, "text": "\\begin{equation}\n \t\\widehat{{\\boldsymbol{\\theta}}_{w\\chi^2}}(t_o) =  \\underset{{\\boldsymbol{\\theta}}}{\\arg\\min} \\sum_{t \\in {\\mathcal{S}}} w(t) \\left[ {\\frac{[x_t-\\mu({\\boldsymbol{\\theta}})]^2}{{\\sigma_t^2}}} \\right] \\label{equ:HFI_wls} \n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\widehat{{\\bm{\\theta}}_{w\\chi^{2}}}(t_{o})=\\underset{{\\bm{\\theta}}}{\\arg\\min}%&#10;\\sum_{t\\in{\\mathcal{S}}}w(t)\\left[{\\frac{[x_{t}-\\mu({\\bm{\\theta}})]^{2}}{{%&#10;\\sigma_{t}^{2}}}}\\right]\" display=\"block\"><mrow><mrow><mover accent=\"true\"><msub><mi>𝜽</mi><mrow><mi>w</mi><mo>⁢</mo><msup><mi>χ</mi><mn>2</mn></msup></mrow></msub><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>o</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder accentunder=\"true\"><mrow><mi>arg</mi><mo>⁡</mo><mi>min</mi></mrow><mo>𝜽</mo></munder><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>t</mi><mo>∈</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi></mrow></munder><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mfrac><msup><mrow><mo stretchy=\"false\">[</mo><mrow><msub><mi>x</mi><mi>t</mi></msub><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝜽</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><msubsup><mi>σ</mi><mi>t</mi><mn>2</mn></msubsup></mfrac><mo>]</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}]