[{"file": "1601.07177.tex", "nexttext": "\nwhere $\\dot{\\mathcal{M}}$ is the dimensionless accretion rate defined as $\\dot{m}=\\eta \\dot{\\mathcal{M}}$ and $\\dot{\\mathcal{M}}_{crit}\\approx20$ \\citep{DuPu2015}.\nSuch theoretical approximations are yet to be confirmed\nby numerical simulations. For example, the recent numerical simulations of such objects by\n\\citet{Sadowski2015} suggest a relatively\nsmall drop in efficiency up to extremely high accretion rates.\nFinally, all AGN are known to be powerful X-ray sources with $L_{2-10\\,\\text{keV}}$ luminosity that, in most observed\ncases, is considerably below the integrated optical-UV luminosity \\citep[e.g.][]{Marconi2004,Steffen2006,Vasudevan2007,\nVasudevan2009,Grupe2010,Marchese2012}.\nThe dimension and variability of the X-ray source suggest that it is intimately related to the accretion process,\nthus the emitted X-ray radiation is most probably drawn from the accretion process itself. This must be taken into account\nwhen comparing the radiation efficiencies of thin and slim ADs.\n\nThe observed optical-UV SEDs of some AGN resemble the prediction of the thin AD model. In particular, they show a prominent\nbump in the optical-ultraviolet, the \\emph{Big Blue Bump} (BBB), which peaks at a BH-mass dependent frequency\nand declines at higher energies.\nUnfortunately, the comparison with theoretical AD SEDs has been hampered by the lack of simultaneous observations of these highly variable\nsources, and the limited wavelength range of most observations. Another source of uncertainty is intrinsic reddening\ndue to dust in the host galaxy of the AGN. Because of this, many earlier studies failed to reach a  conclusion regarding the\norigin of the observed SED with only marginal indications for a disc-like spectrum \\citep[see][]{Koratkar1999,Davis2007}.\nMoreover, an empirical SED made of a broken power-law with slopes $-0.5<\\alpha<1.5$, where $F_{\\nu} \\propto \\nu^{-\\alpha}$,\nhave been shown to give better fits to many observed, limited wavelength spectra \\citep{Zheng1997}.\n\nThe recent work of \\citet{Capellupo2015} shed new light on this issue. The work is based on VLT/Xshooter observations of\n39 type-I AGN with $z\\approx 1.55$ and a large range of $L_{\\text{AGN}}$ and {$\\dot{m}$}. They provide simultaneous information on the\nrest-frame wavelength range of 1100-9200\\AA{} which is large enough to test the AD model predictions.\nMore than 90\\% of the sources in this sample are well fitted with a thin AD model. The fitting requires moderate intrinsic reddening in\n$\\sim$30\\% of the sources with extinction in the range $0.1<A_{V}<0.5\\,$mag. This indicates that many earlier attempts to\ndiscover the unique spectral signature of thin ADs failed as a result of AGN variability and non-simultaneous data that cover\nonly a limited wavelength range. All the sources in the \\citet{Capellupo2015} sample are relatively low accretion\nrate systems with 90\\% of the sources in the range $10^{-2}<\\dot{m}<0.3$ and not a single source\nwith $\\dot{m}>1$.\n\n\nThe most accurate information about {$\\dot{m}$}{} in type-I AGN is obtained for sources with directly measured  BH mass through\nreverberation mapping (RM). Such information is now available for about 40 objects with $\\dot{m}<0.1$ \\citep[see][]{Bentz2013} and\nfor 15 objects with $\\dot{m}>0.1$ \\citep[][the objects we refer to as SEAMBHs]{DuPu2015}. The comparison of the two groups suggests\nthat for a given optical\nluminosity, the emissivity weighted radius of the broad line region (BLR) is considerably smaller in SEAMBHs with differences that\ncan amount\nto a factor of $\\approx 3$. As explained in \\cite{Wang2014b} and \\cite{DuPu2015}, this can be interpreted as a change in the nature\nof the power-house\nwhere the lower {$\\dot{m}$}{} systems are powered by thin ADs and the higher {$\\dot{m}$}{} objects by slim ADs.\n\nThere are several other well known difference between high and low {$\\dot{m}$}{} systems.\nThe first  is the nature of their X-ray continuum manifested by higher variability amplitude, steeper\nsoft X-ray slope and larger $\\alpha_{OX}$ (the slope connecting the flux at 2500\\AA{} and 2 keV) for\nthe higher {$\\dot{m}$}{} objects. These differences have been studied, extensively, in numerous\npapers \\citep{Pogge2000,Steffen2006,Gallo2006}, especially among lower luminosity\nAGN. Clear spectroscopic differences are also found at optical-UV wavelengths where the\nhigher {$\\dot{m}$}{} sources show narrower broad emission lines\nand much stronger Fe{\\sc ii} lines for a given optical luminosity. Such objects\nhave been named ``narrow line Seyfert 1 galaxies'' (NLS1s).\nTheir spectral differences are well characterized in the ``eigen-vector 1''\nscheme \\citep{Sulentic2000}.\n\nThe goal of the present work is to make a detailed comparison of the optical-UV SEDs\nof sub-Eddington and super-Eddington AGN. The number of accurately measured BH mass in SEAMBHs\nhas reached a stage where such a comparison is feasible and can be used to test various models\nand scenarios related to the AGN power-house and the accretion process itself. In particular,\nwe want to test whether thin and slim AD models reliably explain the observed\noptical-UV SED of such objects and the properties of their dusty tori, and test the\ndifferences, if any, between the two groups. An important aim of the present work is to\nimprove the X-ray-to-optical SED measurements and hence the\nestimates of the bolometric luminosity of AGN in sources powered by thin or slim ADs.\nThe pioneering study of \\citet{Elvis1994} presented radio-to-X-ray SEDs for quasar, is restricted to\nbright X-ray sources and cover both the intrinsic AGN continuum and the processed torus emission.\nUnfortunately, the processed radiation is added to the intrinsic emission which results in double\ncounting and too large bolometric correction factors. In later works, double counting was avoided,\nbut intrinsic reddening and host galaxy contribution was not taken into account\n\\citep[see e.g.][]{Marconi2004,Hopkins2004,Richards2006,Vasudevan2007}. This affects the bolometric\nluminosity measurements, underestimating its value. More recent works\n\\citep[][\\citealt{Vasudevan2009b} hereafter V09, \\citealt{Jin2012}, among others]{Brocksopp2006,Vasudevan2009},\npresented optical-to-X-ray SED emphasizing interesting trends between SED signature and Eddington ratio.\nHowever, most samples were restricted to low accretion rate AGN. In particular, there was a lack\nof super-Eddington sources with reliable, RM-based BH mass estimates since such objects were not known\nat the time.\n\n\nThe sample of AGN presented here is restricted to those AGN which are bright\nenough in the optical/UV and all have direct mass measurements. There are 29 objects selected\nby their spectroscopic properties with 16 of those showing extremely high accretion rates\n(refered to as super-Eddington AGN). This makes our approach different than all previous studies.\nFrom all previous studies, the work of V09 is the one most similar to ours.\nIt takes into account reddening and host galaxy corrections in the optical/UV,\nbut focus on low accretion rate sources and does not discuss the torus properties. Below we show\nthe similarity between V09 and our study regarding sub-Eddington AGN, and the missing information\nabout the torus, and make detailed comparison with the new group of super-Eddington sources.\nThe most recent works of \\citet{Marchese2012} and \\citet{Fanali2013} are other attempts\nto correlate accretion disc and X-ray properties of luminous AGN. There are several fundamental\ndifferences between these papers and the present work. First, the BH mass estimate is based on single-epoch\n(virial) method. Second, the accretion disc model is not a fit to individual SEDs but rather the same\nmodel for all sources with an assumed stationary BH but an efficiency $\\eta$ of 0.1 which is more\nappropriate to rotating BH. Third, and most important, the three bands used for the estimate bolometric\nluminosity (X-ray XMM-Newton, UV GALEX and optical SDSS) are not obtained simultaneously which,\nas we show below, introduces an uncertainty which is impossible to estimate. Because of these differences\nwe do not attempt to compare the results obtained in these papers to the one presented below.\n\nRecently, \\citet{Jin2016} presented a new result for a super-Eddington source\nRX~J1140.1+0307, where upper limit on the BH mass was obtained through RM (the upper limit\nis on the $H\\beta$ time lag). \\citet{Jin2016} present several SED fits based on\naccretion disc models using non-simultaneous data. There are also difficulties in host\ngalaxy subtraction and reddening correction. \\citet{Jin2016} found that\nthe best-fit SED overestimate the mass of the black hole by an order of magnitude\nrelative to the RM results. Because of these and the fact that the source is in the\nlowest black hole mass regime we do not attempt to compare their results to the ones\npresented here.\n\n\n\nThe structure of the paper is as follows. In Section~\\ref{SampleSelection} we describe the sample selection and the observational data.\nIn section~\\ref{intrinsicSEDs} we describe the intrinsic disc SED that we use and the fitting procedure is presented in\nsection~\\ref{SEDmodelling}. The principal results of the thin AD modelling and some additional spectral properties are\npresented in Section~\\ref{Results}. Finally, in Section~\\ref{Conclusions}, we summarize our main conclusions from this work.\nThroughout this paper we assume a $\\Lambda$CDM cosmology with $\\Omega_{\\Lambda}=0.7$, $\\Omega_{m}=0.3$, and\n$H_0=70$ km/s/Mpc.\n\n\n\n\n\n\n\\section{Sample Selection}\n\\label{SampleSelection}\n\nThe goal of this work is to compare various properties of high Eddington ratio AGN\nwith RM-measured BH mass with a similar group of low Eddington ratio AGN.\nOur high Eddington ratio sample consists of 16 radio-quiet AGN\nthat are basically all the potential SEAMBH candidates listed in the \\cite{DuPu2015} sample. The BLR sizes of 13\nof the sources were measured in a two-year RM-campaign on the Lijiang 2.4m telescope by the ``SEAMBH Collaboration''.\nThe objects were selected by their spectroscopic properties. They are all NLS1s with suspected high\nEddington ratio, $\\dot{m}$. The selection assumes a conservative method to estimate the\nnormalized accretion rate $\\dot{\\mathcal{M}}\\geq3$.\nThe value was chosen to make sure that $\\dot{m}$ for the lowest efficiency discs (those with spin -1 and $\\eta=0.038$) exceeds 0.1\n\\citep{DuPu2014,Wang2014b,DuPu2015}. Three additional SEAMBHs candidates, PG~2130+099, PG~0844+349 and Mrk~110, with similar\nproperties, were selected from the general catalogue of $\\sim 50$ RM-AGN. As of early 2015, these are the best candidates\nfor being super-Eddington accretors. We coin this sample the ``super-Eddington group''.\n\nWe have also selected a control sample of 13 type-I AGN from the general group of $\\sim$50 RM objects with a much\nsmaller Eddington ratio (defined in the same way) and $\\dot{\\mathcal{M}}<3$. This group, named as super-Eddington,\nwas selected to overlap in optical luminosity, defined as $\\lambda L_{\\lambda}$ at the rest-frame wavelength 5100\\AA,\nthe luminosity of the super-Eddington group. The luminosity distributions of the two groups\nare compared in Figure~\\ref{figure.L5100A}. Although the Kolmogorov-Smirnov test can\nnot reject the hypothesis that both luminosity distributions are drawn from the same distribution,\nthere is a factor two on its average rest-frame 5100\\AA{} luminosity which can not be improved due to the\nlimited RM-AGN sample ($10^{44}$ erg/s and 4.8$\\times10^{44}$ erg/s for super-Eddington and\nsub-Eddington groups, respectively). The redshift distribution of the sub-Eddington group is\nquite similar to the range covered by our super-Eddington objects. The median redshifts are\n0.054 and 0.031 for the super-Eddington and the sub-Eddington samples, respectively.\nFigure~\\ref{figure.L5100A} also shows the distribution of the virial BH mass in the two\nsamples. Due to the selection method which is based on source luminosity, the typical BH mass in\nthe control sample is much larger.\n\n\\begin{figure*}\n    \\centering\n    \\includegraphics[width=0.33\\linewidth]{fig1_logL5100A.pdf}\n    \\includegraphics[width=0.33\\linewidth]{fig1_logMbh.pdf}\n    \\includegraphics[width=0.33\\linewidth]{fig1_redshift.pdf}\n    \\caption{\\emph{From left to right}: Distributions of $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$,\n    virial black hole mass, and redshift for both samples. Filled (blue) histogram represents super-Eddington\n    AGN and hatched (grey) histogram sub-Eddington AGN. The point with error bars on the top of each panel is\n    the median and the 16$^{th}$ and 84$^{th}$ percentiles for each group.}\\label{figure.L5100A}\n\\end{figure*}\n\n\n\\subsection{Photometric and Spectroscopic Data}\n\\label{ObservationalData}\n\nWe have collected  optical-UV photometric and spectroscopic data from various surveys and data bases. The data are used\nto define and separate stellar from non-stellar sources of continuum radiation and to constrain the properties of the SEDs\nof all sources. The optical spectrum of 17 RM objects were taken from the Sloan Digital Sky Survey (SDSS) DR10.\nFor the remaining 12 sources, we used a mean optical spectrum from previous reverberation mapping campaigns. From\nthe AGN Watch database\\footnote{The AGN Watch is a consortium of astronomers who have studied the inner structure of\nAGN through continuum and emission-line variability. See http://www.astronomy.ohio-state.edu/$\\sim$agnwatch/} we selected\nthe mean spectrum of Mrk~279, Mrk~509, NGC~7469 and Fairall 9. The mean optical spectrum of Mrk~79 and  Mrk~817 were\ngiven by Peterson M.B. (private communication, \\citealt{Peterson1998}). The mean optical spectrum of the Palomar Green (PG)\nquasars (PG~2130+099, PG~0844+349, and PG~1617+175) were taken from \\citet{Kaspi2000}. Finally, the mean optical spectrum of Mrk~486,\nMrk~335 and Mrk~1044 are those published by the\n``SEAMBH Collaboration'' \\citep{DuPu2014}. All objects in our sample, except for Mrk~79 and PG~1617+175, have high quality\noptical spectra with broad optical wavelength range.\n\nAll objects in this work, except for Mrk~486, PG~0844+349 and SDSS~J080101.14+184840.7, have NUV and FUV\nphotometry (2306\\AA{} and 1551\\AA{},\nrespectively) obtained by the NASA Galaxy Evolution Explorer (GALEX). The GALEX fluxes were collected from the online\ndatabase and all image were inspected visually. We found  23 objects with observations in the all-sky imaging survey (AIS).\nIn addition, three objects (Mrk~1044, IRAS~04416+1215, Mrk~590) are also included in the medium imaging survey (MIS). No discrepancy\nwas found between both observations (a difference between AIS and MIS photometry less than 0.15 magnitudes in both GALEX bands).\nThree out of these 23 objects have been detected in different surveys: PG~2130+099 was found in the MIS, while NGC~5548\nand PG~1229+204 were selected from the Guest Investigator (GI) program. For 17 objects we also assembled optical/UV\nphotometry from the {\\it XMM-Newton} Optical Monitor (OM): V~5430\\AA{}, B~4500\\AA{}, U~3440\\AA{}, UVW1~2910\\AA{},\nUVM2~2310\\AA{} and UVW2~2120\\AA{}. From visually inspection of the available Hubble Space Telescope (HST) data\nwe cannot extend our dataset into the extreme UV because of variability, i.e. there is at least a factor 2 on flux between\nthe HST spectrum and the selected optical/UV dataset.\n\nSummarizing, of our 29 sources we have optical spectra in conjunction with GALEX photometry for 26 sources and 16 sources\nwhich, in addition to these data, also have XMM-OM photometry, and in 8 cases simultaneous optical/UV photometry.\nA detailed list of all the observations is given in Table~\\ref{table.Observations}.\n\n\\begin{table*}\n  {\\renewcommand{\\arraystretch}{1.19}\n  \\caption{Optical and UV observations used to model the SED of super-Eddington (upper block) and\n  sub-Eddington AGN (lower block).}\\label{table.Observations}\n  \\hspace*{-0.7cm}\n  \\resizebox{1.05\\linewidth}{!}{\n\\begin{tabular}{lccccccc}\\toprule\n  & & \\multicolumn{2}{c}{Optical Spectrum} & \\multicolumn{2}{c}{GALEX} & \\multicolumn{2}{c}{{\\it XMM-Newton} OM} \\\\\\cmidrule(r{.75em}l){3-4}\\cmidrule(r{.75em}l){5-6}\\cmidrule(r{0.75em}l){7-8}\n    Object & $E(B-V)_{\\text{Gal}}$ & survey & date & survey & date & XMMOM & date \\\\ \\midrule\n    \n    \n    Mrk~142  &  0.016  &  SDSS DR10 & 2003-03-09   & AIS  &  2004-01-22 \\\\\n    Mrk~335  &  0.035  &  SEAMBH Collaboration & 2012 Oct -- 2013 Feb & AIS  &  2007-04-02 & J000619.5+201211 & 2007-07-10 \\\\\n    Mrk~382  &  0.048  &  SDSS DR10 & 2001-10-19 & AIS  &  2007-01-21 & J075525.3+391110 & 2011-11-02 \\\\\n    Mrk~486  &  0.015  &  SEAMBH Collaboration & 2013 Mar -- 2013 Jul & &  \\\\\n    Mrk~493  &  0.025  &  SDSS DR10 & 2004-05-16 & AIS  &  2007-05-26 & &  \\\\\n    Mrk~1044 &  0.033  &  SEAMBH Collaboration & 2012 Oct -- 2013 Feb & MIS & 2008-10-11 \\\\\n    IRAS~04416+1215  & 0.436  &  SDSS DR10 & 2006-12-17 & MIS  &  2008-12-17 & &  \\\\\n    IRAS~F12397+3333 & 0.019  &  SDSS DR10 & 2005-03-02 & AIS  &  2004-04-15 & J124210.6+331702 & 2005-06-20 \\\\\n    SDSS~J075101.42+291419.1 & 0.042  &  SDSS DR10 & 2002-12-28 & AIS  &  2007-01-18 & &  \\\\\n    SDSS~J080101.41+184840.7 & 0.032  &  SDSS DR10 & 2004-11-10 & &   & &  \\\\\n    SDSS~J081441.91+212918.5 & 0.039  &  SDSS DR10 & 2004-11-18 & AIS  &  2006-01-27 & &  \\\\\n    SDSS~J081456.10+532533.5 & 0.032  &  SDSS DR10 & 2004-10-19 & AIS  &  2004-01-13 & &  \\\\\n    SDSS~J093922.89+370943.9 & 0.014  &  SDSS DR10 & 2003-12-23 & AIS  &  2005-08-12 & J093922.9+370945 & 2006-11-01 \\\\\n    PG2130+099  &  0.044  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & MIS  &  2009-08-22 & J213227.8+100819 & 2003-05-16 \\\\\n    PG0844+349  &  0.037  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & &  & J084742.4+344504 & 2009-05-03 \\\\\n    Mrk110  &  0.012  &  SDSS DR10 & 2001-12-09 & AIS  &  2007-01-23 & J092512.9+521711 & 2004-11-15  \\\\\n    \n    \n    \n    \\addlinespace\\\\\n    Mrk~79   &  0.071  &  \\citet{Peterson1998} &  1983 -- 1985  & AIS  &  2007-01-20 & J074232.8+494835 & 2008-04-26 \\\\\n    Mrk~279  &  0.016  &  AGN Watch & 1996 Dec -- 1997 Jan & AIS  &  2004-01-25 & J135303.5+691830 & 2005-11-19 \\\\\n    Mrk~290  &  0.014  &  SDSS DR10 & 2002-03-14 & AIS  & 2005-10-22  & J153552.3+575409 & 2006-05-04 \\\\\n    Mrk~509  &  0.057  &  AGN Watch & 1988 Sep -- 1993 Dec & AIS  &  2007-02-09 & J204409.7-104324 & 2009-11-14 \\\\\n    Mrk~590  &  0.037  &  SDSS DR10 & 2003-01-08 & MIS  &  2008-10-23 & & \\\\\n    Mrk~817  &  0.007  &  \\citet{Peterson1998} & 1983 -- 1985 & AIS &  2007-02-21 & & \\\\\n    Mrk~1511 &  0.041  &  SDSS DR10 & 2007-04-17 & AIS  &  2007-04-17 & J153118.1+072729 & 2012-02-23 \\\\\n    NGC~5548 &  0.020  &  SDSS DR10 & 2006-05-04 & GII  &  2006-10-30 & J141759.5+250813 & 2013-07-29 \\\\\n    NGC~7469 &  0.068  &  AGN Watch & 1996 Jun -- 1996 Jul &  AIS  &  2007-03-22 & J230315.6+085226 & 2004-11-30 \\\\\n    PG~1229+204 &  0.027  & SDSS DR10 & 2008-01-16 & GII  &  2007-05-22 & J123203.7+200929 & 2005-07-09 \\\\\n    PG~1617+175  &  0.042  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & AIS  &  2006-06-14 & & \\\\\n    Fairall9 &  0.025  &  AGN Watch & 1994 May -- 1995 Jan & AIS  &  2007-08-17 & J012345.7-584820 & 2013-12-19 \\\\\n    MCG+06-26-012 &  0.019  &  SDSS DR10 & 2005-03-31 & AIS  &  2007-03-22 & & \\\\\n\\bottomrule\n\\end{tabular}\n}}\n\\end{table*}\n\n\n\n\n\n\n\\section{Observed and Intrinsic SEDs}\n\\label{intrinsicSEDs}\n\nA central goal of the present work is to compare the multi-wavelength SEDs of super-Eddington\nand sub-Eddington AGN. For this we need to correct for non-simultaneous observations,\nto subtract the stellar and emission line contributions, and to consider the possibility of\nintrinsic reddening of the sources. As for  Galactic interstellar reddening, this is done\nassuming the \\citet{Cardelli1989} extinction law using the Galactic extinction colour excess\n{$E(B-V)$}{} obtained from the NASA/IPAC Infrared Science Archive\\footnote{http://irsa.ipac.caltech.edu/applications/DUST/}.\n\n\\subsection{Long term optical-UV variability}\n\\label{OC.Variability}\n\nThe presence of variability in the optical/UV continuum of all the sources in our sample is well documented.\nWhilst we can expect variability of order  a few per cent in the optical-UV continuum on short-time of days to a week,\nmuch larger factors are expected on time scales of months and years. For example, \\citet{SantosLleo1997}\nfound a factor of $\\sim$2 for Fairall 9 in the optical continuum flux over a three month period and even larger factors\nhave been found for NGC~5548 \\citep[a factor of $\\sim$7 over a seven years period, ][]{Peterson1999}. Therefore\nvariability is the main challenge for the work presented here.\n\nThe information that is available for most sources is a combination of optical spectroscopy and GALEX photometry. Most\nof these data are not simultaneous. In order to avoid as much as possible the non-simultaneity, and to complete the UV\nGALEX information, we used data obtained by the {\\it XMM-Newton} Optical Monitor (OM). OM photometry\nwas available for 17 out of 29 objects and contemporaneous optical/UV observations (at least 5 simultaneous OM points) for\nonly 6 sources (see Table~\\ref{table.Observations}). These contemporaneous optical/UV observations provide reliable\nconstraints on the source SEDs and help to reduce the fitting uncertainty (see Appendix~\\ref{IndividualNotes}).\n\nThe heterogeneity of our optical/UV datasets dictate a somewhat different procedure for each of the fitted sources.\nThree different procedures were used: {\\sc i)} a simultaneous and non-simultaneous SED were fitted in order to quantify\nthe non-contemporaneous SED shape; {\\sc ii)} when simultaneous dataset was not possible, both GALEX and OM photometry\nin conjunction with the optical spectrum were fitted as long as there is no signs of variability, i.e. all segments of the\nfitted continuum join smoothly; {\\sc iii)} for those sources without {\\it XMM-Newton} OM observations we fitted\nthe non-simultaneous optical-GALEX SED assuming  they were observed at a similar flux epoch. Comments on individual sources\nare given in Appendix~\\ref{IndividualNotes}. This general procedure works well in all the objects discussed in the present\npaper although non-simultaneity is still the main limiting factor.\n\n\\subsection{Host Galaxy Contribution}\n\\label{OC.HG}\nThe optical/UV emission may be contaminated by starlight from the host galaxy. The relative contribution depends on\nthe aperture size, AGN luminosity, and the stellar population in the host. Thus careful galaxy subtraction\nis necessary if we are to determine the SED shape. Such corrections are often made by subtracting galaxy\nbulge template spectra. Star formation in the central part must also be considered since the host of many AGN\nare star formation galaxies \\citep[e.g. ][]{Sani2010}.\n\nThere are three methods that can be used to correct the observed spectra for host-galaxy contamination. The first\nis a direct subtraction of the stellar light measured from HST images. Such data are available for 25 of the sources\n\\citep[][]{Peterson1998,Bentz2009,DuPu2014,Wang2014b}. Published galaxy light profiles were used\nin these cases and normalized to the aperture in question. This correction is normally small (20-70\\%) for the\n3\\arcsec{} SDSS fiber and considerably larger for the 6\\arcsec{} aperture of the optical OM filter. The second method\nmakes use of empirical expressions derived by \\citet{Shen2011} and \\citet{Elvis2012}. The uncertainty here is much\nlarger because of the considerable range in host properties. Finally, one can use the fact that the broad {H$\\beta$}{} lines\nshow no Baldwin effect \\citep{Dietrich2002}. This means that the observed equivalent width of the line, EW({H$\\beta$}{}),\ncan be used to derive the fraction of the non-AGN light entering the aperture at 4861\\AA{}. \\citet{DuPu2015}\nshow the distributions of EW({H$\\beta$}{}) in low Eddington ratio AGN and in SEAMBHs. The two differ by a considerable amount\nwith medians that are $(122\\pm44){\\textup{\\AA}}$ and $(89\\pm31){\\textup{\\AA}}$, respectively.\n\nFor those sources without HST observations,\nwe prefer the use of this method over the expressions given by \\citet{Shen2011}. The main concern is how to treat\nthe five objects without HST observations.\n\nThe subtraction procedure starts with an estimate of the non-AGN flux at 4861\\AA{} followed by a subtraction of a single\nsimple stellar model spectrum which is scaled to this flux. A nominal 20\\% uncertainty on this flux was adopted due to a combination\nof the host-galaxy modelling and the uncertainties on the emission line fluxes. The SDSS fibers include only the innermost few\nkpc of the host, hence we chose a quiescent galaxy model from the evolutionary spectral library of \\citet{Charlot1991}. For 15\nout of 29 objects, the instantaneous-burst model with an age of 11 Gyr and solar metallicity (Z=0.02) provided sufficiently good fit\nto the stellar spectrum. For the remaining 14 objects, this template gives a ``flux excess'' at the longest observed wavelengths.\nA template with 11 Gyr and Z=0.05 provides better fit to such spectra and was adopted in these cases. We also experimented with\nadding younger stellar population components but did not find significant improvements over the old population templates.\n\nThe difference on aperture between the SDSS fibres (3\\arcsec) and the OM broadband filters (12\\arcsec{} and 35\\arcsec{}\ndiameter for the optical and UV filter, respectively) prevent us from using the estimated host-galaxy contribution to the optical\nspectrum to subtract the star-light from the OM photometric data. For the OM photometric dataset, the host galaxy emission was\nmodeled by adopting the published galaxy-light radial profiles \\citep[][]{Bentz2009} which were integrated over the specific OM\naperture to estimate the host-galaxy contribution to the total observed flux.\n\n\\subsection{Emission line Contributions}\n\\label{OC.PhotometricCorrections}\nThe wavelength range for the photometry are wide enough that the underlying nuclear continuum might be contaminated\nby broad and narrow emission lines, i.e. Balmer lines, C$\\,${\\sc iv}, Mg$\\,${\\sc ii}, Fe$\\,${\\sc ii},\nas well as the Balmer continuum.\n\nIn order to exclude the underlying continuum, we used the composite quasar spectrum of \\citet{VandenBerk2001}\nto estimate the emission line fraction for each photometric waveband. We assumed only the emitted flux in the spectral\nwindow over which the effective transmission is greater than 10\\% of the peak effective transmission: FUV~1343--1786\\AA{},\nNUV~1771--2831\\AA{}, UVW2~1805--2454\\AA{}, UVM2~1970--2675\\AA{}, UVW1~2410--3565\\AA{}, U~3030--3890\\AA{},\nB~3815--4910\\AA{} and V~5020--5870\\AA{}. For comparison, at redshift $z=0.06$, which is the mean of our\nsample, the contributions from the emission line regions at each photometric window are 5\\%, 11.9\\%, 9.4\\%, 13.0\\%, 23.4\\%, 24.6\\%,\n15.9\\% and 24.9\\% for FUV, NUV, UVW2, UVM2, UVW1, U, B  and V, respectively. Since line variations follow continuum\nvariations (albeit with somewhat different lags), we do not expect large fluctuations in these fractions.\n\n\\subsection{Intrinsic reddening}\n\\label{OC.IR}\n\nIntrinsic extinction in AGN can be significant which can make it an important factor when determining the SED of the\noptical/UV continuum. Previous studies \\citep[][Mejia-Restrepo et al. 2015 (submitted), and references\ntherein]{Lusso2013,Capellupo2015,Collinson2015} found a range of properties with most AGN showing little\ndust attenuation, i.e. {$E(B-V)$}<0.1, independent of the reddening law. Such reddening does not affect much the optical fluxes, but its\neffect on the UV part of the spectrum is significantly larger. Not accounting for this effect will result in fitting the wrong accretion\ndisc models and the miss-calculation of source luminosity and accretion rate.\n\nExtinction curves which are commonly used in AGN studies include: Milky Way-like extinction with its known broad\nbump at $\\sim$2175\\AA{}, Small Magellanic Cloud-type (SMC) curves, a simple power-law extinction, or a combination of a\npower law with a flatter curve in the far-UV \\citep{Gaskell2004}. Several earlier\nworks \\citep{Hopkins2004,Glikman2012} claimed that the typical bump at 2175\\AA{} of the MW-like extinction curve is not\nobserved in AGN spectra. Recent, higher quality spectra and more carefully fitted SEDs by \\citet{Capellupo2015} clearly show\nthis bump in some of the spectra.\n\nSince the wavelength dependence of the extinction is unknown, a priori, we experimented with three possibilities: {\\sc i)}\nthe \\citet{Cardelli1989} as a MW-like curve with $R_V=3.1$, {\\sc ii)} a simple power-law $A(\\lambda)=A_{0} \\lambda^{-1}$,\nand {\\sc iii)} the SMC extinction curve as given in \\citet{Gordon2003}. According to the wavelength dependence of the extinction\ncurve, the intrinsic reddening will be larger for the SMC curve than for the MW. The most consistent approach is to add this extinction\nas an additional parameter in the SED modelling analysis. Clearly, if extinction is important, the intrinsic underlying continuum\nshape will depend significantly on the form of the reddening curve.\n\nAs a practical point we note that the extremely broad GALEX\nbands do not allow us to take into account spectral features like the 2175\\AA{} absorption and weaker ISM lines and we only treat\nthe total observed flux in these bands.\n\n\n\n\n\n\\section{SED model fitting}\n\\label{SEDmodelling}\n\n\\subsection{Accretion disc models}\n\nIn this work, we use the numerical code described in \\citet{Slone2012} to calculate thin AD spectra. The calculations assume a\n\\citet{Shakura1973} disc with a variable viscosity parameter (chosen in this paper to be $\\alpha = 0.1$). As in all models of this type\n(see Sec.~\\ref{Introduction}), the spin-dependent ISCO determines the mass-to-energy conversion efficiency, $\\eta$.\n\nThe focus of the \\citet{Slone2012} work is the effect of disc winds on the emitted SEDs. Here we do not consider\ndisc winds because of the lack of far UV spectroscopy required to deduce their presence and because we focus on\nslim disc where there are additional large uncertainties (see below). As in \\citet{Slone2012}, our calculations\ninclude Comptonization of the emitted radiation at every point in the disc atmosphere and,\nfor BH spin values of $a_{\\star}>0$, full General\nRelativistic corrections. For retrograde discs with $a_{\\star}<0$, the general relativity effects are not\nincluded, which is a fair approximation given the large size of the ISCO ($>6r_{g}$, where $r_{g}=GM_{BH}/c^2$ is the gravitational\nradius of the black hole).\n\nApart from Comptonization, the calculations do not include any other radiative transfer\nin the disc atmosphere that can make significant changes to the far UV SED \\citep[e.g.][Fig. 2]{Davis2011}.\n\nStandard, \\citet{Shakura1973} thin accretion disc models are limited to $\\dot{m} \\le 0.3$. Beyond this accretion rate, the disc geometry\nbecomes thick and many of the approximation used in the  model no-longer hold \\citep[see][and references therein]{Laor1989}.\nAs explained in Section~\\ref{Introduction}, the main differences between thin and slim discs are the thicker geometry,\ndue to the much larger radiation pressure in the disc, and the way the radiation escapes the system. This includes radial advection\nand perhaps saturation of the emitted luminosity. Unfortunately, detailed SED calculations of slim discs are highly simplified and\nhardly available. A recent detailed model of this type is discussed in \\citet{Wang2014b}. According to this and earlier models, the\nlong wavelength part of the SED originates outside of the thick part of the disc and is, therefore, very similar in its shape to the\nthin AD SED. For small BH mass systems, significant differences between the two appear only at very short wavelengths, beyond the\nLyman limit. The special geometry dictates strong anisotropy in such systems, much beyond the standard AD anisotropy due to inclination.\nThis, again, is most noticeable at short wavelengths \\citep[see Fig. 4 in][]{Wang2014a}.\nThe observations discussed here do not include the wavelength range below $\\lambda$=1000\\AA{} and hence we use the thin\nAD model for the fitting of the SED over this range. Later on, when we discuss the Lyman continuum emission, we\nconsider the various possibilities regarding slim discs.\n\nAs explained earlier, theoretical slim disc models are still highly simplistic and are not in very good agreement with state-of-the-art\nnumerical calculations like those of \\citet{Sadowski2015}. Given this fundamental uncertainty, we treat all derived quantities that\ndepend on the short wavelength part of the model, e.g. the bolometric luminosity and Eddington ratio, as the most uncertain parameters\nfor the sub-sample of 16 SEAMBHs described in this work.\n\n\n\\subsection{Fitting procedure}\n\nWe used the \\citet{Slone2012} code described earlier to calculate a large number of thin disc spectra that include the entire range\nof BH mass, accretion rate and spin expected in our sample. The input for the fit include, for each source,  the black hole mass\n({$M_{BH}$}{} in units of $M_{\\odot}$), and the mass accretion rate ({$\\dot{M}$}{} in units of $M_{\\odot}$/yr). We used the RM-based masses\nand the measured (from the 5100\\AA{} continuum) accretion rates listed in \\citet[see Table 7]{DuPu2015}. The uncertainty on the mass\nis estimated to be a factor of $\\sim$3 due to the the uncertainties on the measured time lags, the measured FWHM(H$\\beta$), and the\nuncertainties in the conversion of observed broad line profiles to a ``mean gas velocity'' (the $f_{_{BLR}}$ term in\n$M_{BH}=f_{_{BLR}}\\,c\\,\\tau\\,FWHM(H\\beta)^{2}/G$).\nThe accretion rate is obtained from the luminosity at rest-wavelength 5100\\AA{} using the method described in \\citet{Davis2011} as\ndetailed in \\citet[][see Eqn. 1 there]{Netzer2014}. We assumed a factor three uncertainty on the accretion rate derived in this way which\nis a combination of flux uncertainty (mostly stellar light subtraction), the unknown inclination, and the fact that the chosen wavelength\n(5100\\AA{}) is not on the $L_{\\nu} \\propto \\nu^{1/3}$ part of the SED.\n\nAll sources fitted in this work are type-I AGN which are assumed to be observed close to face-on. The range of inclination\nis roughly 0--60 degree and the range in $\\cos{(\\theta)}$ 0.5--1. We assumed the anisotropy function proposed by\n\\citet{Netzer2014},\n\n", "itemtype": "equation", "pos": 4403, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\n\\begin{abstract}\nWe employ optical and UV observations to present SEDs for two reverberation-mapped\nsamples of super-Eddington and sub-Eddington AGN with similar luminosity\ndistributions. The samples are fitted with accretion disc models in order to look\nfor SED differences that depend on the Eddington ratio. The fitting takes into\naccount measured BH mass and accretion rates, BH spin and intrinsic reddening of\nthe sources. All objects in both groups can be fitted by thin AD models over the\nrange 0.2-1$\\,\\mu$m with reddening as a free parameter. The intrinsic reddening\nrequired to fit the data are relatively small, $E(B-V)\\leq0.2$~mag, except for one\nsource. Super-Eddington AGN seem to require more reddening. The distribution of\n$E(B-V)$ is similar to what is observed in larger AGN samples. The best fit disc\nmodels for the two groups are very different, with super-Eddington sources require\nmuch more luminous far-UV continuum. The exact amount depends on the possible\nsaturation of the UV radiation in slim discs. In particular, we derive for the\nsuper-Eddington sources a typical bolometric correction at 5100\\AA{} of 60--150\ncompared with a median of $\\sim$20 for the sub-Eddington AGN. The measured torus\nluminosity relative to $\\lambda L_{\\lambda}(5100{\\textup{\\AA}}{}$) are similar in both\ngroups. The $\\alpha_{OX}$ distribution is similar too. However, we find extremely\nsmall torus covering factors for super-Eddington sources, an order of magnitude\nsmaller than those of sub-Eddington AGN. The small differences between the groups\nregarding the spectral range 0.2-22$\\,\\mu$m, and the significant differences related\nto the part of the SED that we cannot observed may be consistent with some slim disc\nmodels. An alternative explanation is that present day slim-disc models over-estimate\nthe far UV luminosity of such objects.\n\\end{abstract}\n\n\n\n\\begin{keywords}\naccretion,accretion discs -- galaxies: nuclei -- galaxies: Seyfert -- galaxies: active\n\\end{keywords}\n\n\n\n\n\\section{Introduction}\n\\label{Introduction}\n\nOptically thick accretion flows in the vicinity of the central black hole (BH) are believed to be the main\npower-house of active galactic nuclei (AGN). The emitted radiation from such systems is determined by\nthe BH mass ($M_{BH}$),\nBH spin ($a_{\\star}$), and the mass accretion rate, {$\\dot{M}$}. The accretion\nrate can be expressed in normalized units, or Eddington ratio, $\\dot{m}=${$L_{\\text{AGN}}/L_{\\text{Edd}}$}, where $L_{\\text{AGN}}$ is the bolometric\nluminosity of the system. Optically thick geometrically thin accretion discs (ADs) have been proposed to explain\nthe observed spectral energy distribution (SED) of many AGN with low Eddington ratios\n\\citep[{$L_{\\text{AGN}}/L_{\\text{Edd}}$}$\\le 0.3$,][]{Koratkar1999,Blaes2001,Shang2005,Davis2007,Davis2011,Laor2011,Jin2012,Slone2012,Netzer2014,Capellupo2015}.\nAt higher accretion rates, the disc becomes ``thick'' or ``slim'' and\nthe nature of the accretion changes dramatically with processes like photon trapping and advection becoming important\n\\cite[][see review by \\citealt{Wang2014a}]{Abramowicz1988,Sadowski2014}.  Slim ADs are thought to have  SEDs that are\ndifferent from thin ADs, with an energy cut-off that extends to higher energies and a strong anisotropy of the emitted\nradiation. We follow \\citet{Wang2014b} and coin such objects ``Super-Eddington Accreting Massive Black Holes''\n(SEAMBHs).\n\nThe radiation efficiency of thin ADs around BHs, $\\eta$, defined by  $L_{\\text{AGN}}=\\eta\\dot{M}_{BH}c^2$, is\nobtained from  the standard AD theory \\citep[e.g.][]{Shakura1973,Thorne1974}. $\\eta$ depends on the location of the innermost\nstable circular orbit (ISCO) which in turn depends on the BH spin. For maximally rotating BHs, with spin parameter\n$a_{\\star}=0.998$, $\\eta=0.32$ and for retrograde discs, with $a_{\\star}=-1$, $\\eta=0.038$.  This is not the case for slim ADs that\nare not well understood. In such cases, there is an\nill-defined radiation efficiency that may not depend on the BH spin and is suggested to be considerably smaller than the\ncorresponding thin AD efficiency due to the so-called ``photon trapping''. The issue is particularly important for very high accretion rates where the\ntheoretical models suggest that the emitted radiation follows an expression of the type \\citep{Mineshige2000}\n\n", "index": 1, "text": "\\begin{equation}\n    L_{\\text{AGN}}\\approx 3 \\times 10^{38}  \\left[1+\\ln{\\dot{\\mathcal{M}}/\\dot{\\mathcal{M}}_{crit}}\\right]\\, M_{BH}\n\\label{eq.saturation}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{\\text{AGN}}\\approx 3\\times 10^{38}\\left[1+\\ln{\\dot{\\mathcal{M}}/\\dot{%&#10;\\mathcal{M}}_{crit}}\\right]\\,M_{BH}\" display=\"block\"><mrow><msub><mi>L</mi><mtext>AGN</mtext></msub><mo>≈</mo><mrow><mrow><mn>3</mn><mo>×</mo><msup><mn>10</mn><mn>38</mn></msup></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mo>˙</mo></mover><mo>/</mo><msub><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mo>˙</mo></mover><mrow><mi>c</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow></mrow></mrow><mo rspace=\"4.2pt\">]</mo></mrow><mo>⁢</mo><msub><mi>M</mi><mrow><mi>B</mi><mo>⁢</mo><mi>H</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07177.tex", "nexttext": "\nwith $b(\\nu)=2$, $f_0 = 1.2\\times10^{30}$~erg/s/Hz, and $\\cos{\\theta}=0.75$ for all sources. The remaining parameters are the BH spin\nand intrinsic reddening. We experimented with the full range of spin parameters, from -1 to 0.998. Because of the fitted range of wavelengths,\nwhich is far from the frequency of maximum disc temperature, there is very little difference between different spin value. We therefore show, for\neach source only two values, $a_{\\star}=-1$ and $a_{\\star}=0.998$.\n\n\nThe fitting procedure includes the comparison of the observed SED with various combinations of disc SEDs covering the range of mass,\naccretion rate, and the two chosen spins and assumed reddening. The reddening is taken into account by changing $E(B-V)$ in steps\nof 0.004 mag, calculating, for each value, a new mass accretion rate and its range of uncertainty. A simple $\\chi^{2}$ procedure was used\nto find the best-fit combination of reddening and thin AD models. We use at least three line-free windows covering the optical\nspectroscopic data, and all the available photometric data. The line-free windows are centred on 4205\\AA{}, 5100\\AA{} and 6855\\AA{},\nwith widths\nranging from 10 to 30\\AA{}. For those objects with no photometric data, three additional line-free continuum windows were used: 5620\\AA{}, 6205\\AA{}\nand 6860\\AA{}. For the error on each continuum point, we combine the standard error from the Poison noise, an assumed 5\\% error on the flux calibration,\nand the relative error of 20\\%  on the combination of the uncertainties on the host-galaxy contribution and the unknown stellar population.\nTo allow for the large elapsed time between the GALEX and the optical observations, which increases the uncertainty due to source variability,\nwe added an uncertainty of 20\\% to the GALEX fluxes. Note that this is not meant to take into account the real variations between epoch since this is\ndealt with, in our special method described in Section~\\ref{OC.Variability} where we provide more information about the way we used\nthe best SED that avoids, as much as possible, the variability issue. We refer the reader to Appendix~\\ref{IndividualNotes} for a detailed\ndescription of the fitting results for individual sources.\n\n\n\\section{Results}\n\\label{Results}\n\nThe samples described here were selected from the RM AGN sample with high accretion rate,\n$\\mathcal{\\dot{M}}\\geq3$ (super-Eddington) and with sub-Eddington accretion rate\n$\\mathcal{\\dot{M}}<3$. In the following we use the normalized Eddington ratio,\n$\\dot{m}=\\eta\\dot{\\mathcal{M}}$, which allow an easy comparison with previous works.\nWhile not all data are of the same quality, we were able to secure photometric and spectroscopic\ndata that cover the 0.2-20$\\,\\mu$m range for all sources. For 8 sources\n(4 sub-Eddington and 4 super-Eddington) we have both simultaneous and non-simultaneous\noptical/UV photometry. In the following discussions we do not distinguish between simultaneous\nand non-simultaneous SEDs.\n\nOur best fitted disc SEDs are shown in Figure~\\ref{figure.bfSED} and all the model parameters,\nincluding the virialized {$M_{BH}$}{} and {$\\dot{M}$}{}, are listed in Table~\\ref{table.bfSED}.\nTwo models are listed per source, corresponding to the minimum and maximum\nspin parameter. The error bars on the intrinsic reddening enclose the 68\\% confidence range.\nFinally, the average spectral properties for both groups and for the entire sample are summarized\nin Table~\\ref{table.statisitcs}. In the following plots, for every derived thin AD model\nparameter we display the mean between the higher and lower values corresponding to the minimum\nand maximum spin, and the uncertainly which represents the range of possible values.\n\n\n\n\\begin{table*}\n{\\renewcommand{\\arraystretch}{1.3}\n\\caption{Median Parameters for super-Eddington (13), sub-Eddington (16) AGN and the entire sample (29).\n The uncertainties reflect the 16$^{th}$ and 84$^{th}$ percentiles.\n When saturation (Eqn.~\\ref{eq.saturation}) is taken into account the parameter is tagged with the term $_{sat}$.\n Two numbers are listed for each thin AD model corresponding to the minimum and the\n maximum spin. The unabsorbed luminosity at 2$\\,$keV is given by the best-fit\n power law over the hard X-ray band (2-10$\\,$keV).\\label{table.statisitcs}}\n\\begin{tabular}{lrrrrrr}\\toprule\n        {\\sc parameter} & \\multicolumn{2}{c}{super-Eddington} &  \\multicolumn{2}{c}{sub-Eddington} & \\multicolumn{2}{c}{all} \\\\\n        & $a_{\\star}=0.998$ & $a_{\\star}=-1$ & $a_{\\star}=0.998$ & $a_{\\star}=-1$ & $a_{\\star}=0.998$ & $a_{\\star}=-1$ \\\\\n    \\midrule\n    \\multicolumn{7}{l}{reverberation-mapped resutls}\\\\\n    $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$  & $44.00^{+0.23}_{-0.69}$  & $44.00^{+0.23}_{-0.69}$  & $43.68^{+0.32}_{-0.51}$  & $43.68^{+0.32}_{-0.51}$  & $43.71^{+0.50}_{-0.55}$  & $43.71^{+0.50}_{-0.55}$ \\\\\n    $z$  & $0.054^{+0.078}_{-0.022}$ & $0.054^{+0.078}_{-0.022}$ & $0.031^{+0.017}_{-0.009}$ & $0.031^{+0.017}_{-0.009}$ & $0.035^{+0.081}_{-0.009}$ & $0.035^{+0.081}_{-0.009}$\\\\\n    $\\log M_{BH}$  & $6.86^{+0.35}_{-0.38}$  & $6.86^{+0.35}_{-0.38}$  & $7.97^{+0.13}_{-0.71}$  & $7.97^{+0.13}_{-0.71}$  & $7.16^{+0.85}_{-0.51}$  & $7.16^{+0.85}_{-0.51}$ \\\\\n    $\\log\\dot{\\mathcal{M}}$  & $1.61^{+0.98}_{-0.77}$  & $1.60^{+0.98}_{-0.77}$  & $-0.70^{+0.35}_{-0.38}$  & $-0.72^{+0.37}_{-0.36}$  & $0.84^{+1.24}_{-1.68}$  & $0.83^{+1.23}_{-1.69}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{power-law modelling}\\\\\n    $\\beta_{UV}$  & $2.13^{+0.37}_{-0.36}$  & $2.13^{+0.37}_{-0.36}$  & $2.12^{+0.36}_{-0.30}$  & $2.12^{+0.36}_{-0.30}$  & $2.12^{+0.39}_{-0.34}$  & $2.12^{+0.39}_{-0.34}$ \\\\\n    $E(B-V)$ /PL/  & $0.00^{+0.06}_{-0.00}$  & $0.00^{+0.06}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{thin AD modelling}\\\\\n    $E(B-V)$  & $0.07^{+0.06}_{-0.03}$  & $0.06^{+0.06}_{-0.02}$  & $0.01^{+0.03}_{-0.01}$  & $0.00^{+0.00}_{-0.00}$  & $0.05^{+0.04}_{-0.05}$  & $0.04^{+0.06}_{-0.04}$ \\\\\n    $\\log M_{BH}$  & $7.25^{+0.28}_{-0.46}$  & $7.26^{+0.26}_{-0.46}$  & $7.88^{+0.13}_{-0.60}$  & $7.80^{+0.44}_{-0.52}$  & $7.32^{+0.65}_{-0.52}$  & $7.36^{+0.59}_{-0.56}$ \\\\\n    $\\log\\dot{\\mathcal{M}}$  & $1.81^{+0.46}_{-1.43}$  & $1.80^{+0.58}_{-1.22}$  & $-0.62^{+0.98}_{-0.44}$  & $-0.32^{+0.66}_{-0.58}$  & $0.36^{+1.72}_{-1.07}$  & $0.50^{+1.62}_{-1.03}$ \\\\\n    $\\log L_{\\text{Lyman}}$  & $46.55^{+0.46}_{-0.92}$  & $45.57^{+0.62}_{-0.96}$  & $44.96^{+0.45}_{-0.50}$  & $43.70^{+0.32}_{-0.96}$  & $45.59^{+1.29}_{-0.81}$  & $44.48^{+1.40}_{-1.11}$ \\\\\n    $\\log L_{\\text{Lyman,sat}}$  & $45.84^{+0.19}_{-0.39}$  & $45.78^{+0.29}_{-1.17}$  & $44.96^{+0.45}_{-0.50}$  & $43.70^{+0.32}_{-0.96}$  & $45.52^{+0.37}_{-0.74}$  & $44.48^{+1.43}_{-1.11}$ \\\\\n    $\\langle h\\nu \\rangle$  & $11.8^{+2.7}_{-7.0}$  & $3.2^{+1.0}_{-1.5}$  & $2.4^{+2.7}_{-0.3}$  & $1.3^{+0.5}_{-0.1}$  & $5.3^{+8.5}_{-3.0}$  & $1.8^{+2.3}_{-0.5}$ \\\\\n    $\\kappa_{5100{\\textup{\\AA}}{}}$  & $208^{+475}_{-171}$  & $61^{+71}_{-53}$  & $17^{+45}_{-5}$  & $3^{+7}_{-1}$  & $62^{+373}_{-46}$  & $10^{+90}_{-7}$ \\\\\n    $\\kappa_{5100{\\textup{\\AA}}{},sat}$  & $53^{+51}_{-32}$  & $65^{+61}_{-57}$  & $18^{+46}_{-5}$  & $3^{+7}_{-1}$  & $32^{+51}_{-19}$  & $10^{+95}_{-7}$ \\\\\n    $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ (erg/s)  & $44.23^{+0.37}_{-0.52}$  & $43.93^{+0.44}_{-0.47}$  & $43.64^{+0.63}_{-0.33}$  & $43.63^{+0.64}_{-0.41}$  & $43.90^{+0.59}_{-0.51}$  & $43.83^{+0.51}_{-0.55}$ \\\\\n    $\\log \\lambda L_{\\lambda}(2500{\\textup{\\AA}}{})$  (erg/s)  & $44.51^{+0.24}_{-0.25}$  & $44.48^{+0.28}_{-0.25}$  & $43.95^{+0.24}_{-0.25}$  & $43.89^{+0.29}_{-0.27}$  & $44.15^{+0.46}_{-0.43}$  & $44.12^{+0.44}_{-0.49}$ \\\\\n    $L_{AGN}$ (erg/s)  & $46.56^{+0.46}_{-0.90}$  & $45.65^{+0.57}_{-0.79}$  & $45.07^{+0.49}_{-0.44}$  & $44.28^{+0.35}_{-0.44}$  & $45.65^{+1.23}_{-0.78}$  & $44.84^{+1.10}_{-0.72}$ \\\\\n    $L_{AGN,sat}$ (erg/s)  & $45.89^{+0.19}_{-0.42}$  & $45.82^{+0.29}_{-0.95}$  & $45.07^{+0.49}_{-0.44}$  & $44.28^{+0.35}_{-0.44}$  & $45.56^{+0.38}_{-0.69}$  & $44.84^{+1.11}_{-0.72}$ \\\\\n    ${\\Delta\\log M_{BH}}^{\\dagger}$  & $0.31^{+0.19}_{-0.24}$  & $0.31^{+0.19}_{-0.22}$  & $-0.11^{+0.37}_{-0.19}$  & $-0.04^{+0.29}_{-0.14}$  & $0.15^{+0.34}_{-0.36}$  & $0.19^{+0.28}_{-0.31}$ \\\\\n    ${\\Delta\\log\\dot{\\mathcal{M}}}^{\\ddagger}$  & $-0.24^{+0.58}_{-0.33}$  & $-0.13^{+0.47}_{-0.32}$  & $0.59^{+0.23}_{-1.06}$  & $0.54^{+0.15}_{-0.62}$  & $-0.01^{+0.68}_{-0.55}$  & $0.13^{+0.49}_{-0.46}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{Luminosities}\\\\\n    $L_{\\text{trous}}$ (erg/s)  & $44.52^{+0.50}_{-0.36}$  & $44.52^{+0.50}_{-0.36}$  & $44.53^{+0.37}_{-0.47}$  & $44.53^{+0.37}_{-0.47}$  & $44.53^{+0.48}_{-0.44}$  & $44.53^{+0.48}_{-0.44}$ \\\\\n    $\\log L_{\\nu}(5\\mu m)$ (erg/s)  & $43.99^{+0.50}_{-0.38}$  & $43.99^{+0.50}_{-0.38}$  & $43.86^{+0.52}_{-0.39}$  & $43.86^{+0.52}_{-0.39}$  & $43.86^{+0.62}_{-0.35}$  & $43.86^{+0.62}_{-0.35}$ \\\\\n    $\\log L_{\\nu}(2keV)$ (erg/s)  & $43.23^{+0.10}_{-0.40}$  & $43.23^{+0.10}_{-0.40}$  & $42.85^{+0.57}_{-0.40}$  & $42.85^{+0.57}_{-0.40}$  & $43.19^{+0.22}_{-0.64}$  & $43.19^{+0.22}_{-0.64}$ \\\\\n\\bottomrule\n\\addlinespace[0.8em]\n\\multicolumn{7}{l}{$^{\\dagger}$ Defined as  $\\Delta \\log{M_{BH}}\\equiv (\\log{M_{BH}})^{\\text{fit}}-(\\log{M_{BH}})^{\\text{virial}} $}\\\\\n\\multicolumn{7}{l}{$^{\\ddagger}$ Defined as  $\\Delta \\log{\\dot{\\mathcal{M}}}\\equiv (\\log{\\dot{\\mathcal{M}}})^{\\text{fit}}-(\\log{\\dot{\\mathcal{M}}})^{\\text{virial}}$}\n\\end{tabular}}\n\\end{table*}\n\n\n\n\\subsection{Accretion Disc SED}\n\\label{section.thinAD}\nA major goal of this project is to determine what fraction of sub-Eddington and super-Eddington\naccretors in our sample can be fit by the simple optically thick, geometrically thin AD model\nbased on their long wavelength SEDs. By allowing intrinsic reddening as a free parameter of the\nthin AD model, we can fit all the 29 sources of our sample. For 23 sources, our modelling requires\nsome reddening and for 6 sources, which are all sub-Eddington AGN, the amount of reddening\nis consistent with zero. We found that 14\\% of the RM-selected AGN are consistent with\n{$E(B-V)$}$>0.1$ in good agreement with the work of \\citet{Krawczyk2015} where the SED was modelled\nby a single power law. Indeed, the reddening distribution of our entire sample is also consistent\nwith that presented by \\citet[][Figure~\\ref{figure.Av}]{Lusso2013}.\nSeveral of the declared good fits still include small deviations of the model from the local\ncontinuum at some wavelengths. This is not surprising given the uncertainties on AD models,\nespecially the radiative transfer in the disc atmosphere that was not treated here,\nas well as on the choice of the host galaxy template. In general, the simple $\\chi^2$-fitting\nprocedure cannot distinguish between $a_{\\star}=-1$ and $a_{\\star}=0.998$, given the assumed\nuncertainties on BH mass, BH accretion rate, reddening and the long wavelengths used for the fitting.\nObservations at shorter wavelengths (i.e. extreme-UV $\\lambda<2000{\\textup{\\AA}}{}$) are clearly\nrequired to make such a distinction.\n\n\nFor consistency with previous works, the 0.2-1$\\,\\mu$m SED was also fitted using a single reddened\npower-law model ($L_{\\nu}\\propto \\nu^{-\\alpha_{UV}}$).\nA satisfactory fit ($\\chi^2_{\\nu}<2$) with $A_{V}=0$ is found for 86\\% (25/29) of the sources.\nThe remaining four objects (which are super-Eddington) were successfully fitted with $A_{V}>0$.\nThe reddening distribution of the entire sample is quite consistent, as in the case of the thin\nAD modelling, with that presented in various earlier studies, e.g. \\citet{Lusso2013}. The range\nof slopes is large, from $\\alpha_{UV}=0.55$ to $\\alpha_{UV}=-0.98$.\nThe Kolmogorov-Smirnov test shows that the optical to UV spectral index corrected for intrinsic\nreddening for SEAMBHs and sub-Eddington\naccretors are fully consistent (see Figure~\\ref{fig.PLresults}), with means $\\langle\\alpha_{UV}\\rangle=-0.14$ and $-0.10$ and a standard deviations of\n$\\sigma=0.40$ and $0.33$, respectively. A comparison with earlier works on much larger samples\n\\citep{VandenBerk2001,Grupe2010} shows that our sample has bluer optical/UV continua.\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.9\\linewidth]{fig3_betaUV.pdf}\n    \\caption{The distribution of optical to UV spectral indices in the\n    super-Eddington and sub-Eddington objects. The spectral\n\tindices are defined such that $L_{\\lambda}\\propto \\lambda^{-\\beta_{UV}}$\n\tand $\\beta_{UV}=2-\\alpha_{UV}$. Colour code as Figure~\\ref{figure.L5100A}.}\n\t\\label{fig.PLresults}\n\\end{figure}\n\n\\begin{figure*}\n    \\centering\n    \\includegraphics[width=0.45\\linewidth]{fig4_EBmV_PL.pdf}\n    \\includegraphics[width=0.45\\linewidth]{fig4_EBmV_thinAD.pdf}\\\\\n    \\caption{Intrinsic reddening E(B-V) distribution modelled by a classical SMC-like extinction curve with $R_{V}=2.74$. The\n\tamount of reddening was derived from model fittings assuming a single power law (\\emph{left}) and a\n\tthin AD model (\\emph{right}). The red crosses with error bars represent the reddening distribution for\n\tthe entire sample (29 objects) and the green circles with error bars show the distribution of {$E(B-V)$}{} presented by \\citet{Lusso2013}.\n\tHistogram colour code as in Fig.~\\ref{figure.L5100A}.}\n    \\label{figure.Av}\n\\end{figure*}\n\n\\subsection{Properties of the obscuring dust}\n\\label{SED.IR}\n\nIf the adopted thin AD model does indeed explain the emitted SED of AGN in our sample,\nthen dust in the host galaxies of approximately 50\\% of the AGN in our sample is\ncontributing to the reddening of the optical-UV spectrum. It is therefore interesting\nto test the nature of the dust which is causing the extinction. Several earlier studies\n\\citep{Hopkins2004,Glikman2012} claimed that an SMC-type extinction curve best accounts\nfor the reddening, in preference to MW-type or \\citet{Gaskell2004} reddening,\n\\citet{Capellupo2015} find that in their sample of 39 z=1.5 AGN, there were no cases\nwhere the SMC-type curve allowed for a better fit than either the MW or simple power-law\nextinction curve. Our observations indicate that for those AGN that require intrinsic\nreddening, there is no preference for one particular extinction curve. This is probably\nbecause the UV observations are based on photometry instead of spectroscopy and may also\nbe the result of the limited wavelength range which is essential to differentiate between\nthe various extinction laws.\n\nAs noted above, the amount of extinction seems to be more significant in super-Eddington\nAGN. Figure~\\ref{figure.Av} compares the reddening distribution of the super-Eddington\nand the sub-Eddington groups assuming a SMC extinction curve. The median reddening for\nthe super-Eddington sources is $\\langle E(B-V)\\rangle=0.07$~mag with a scatter of\n$\\sigma=0.08$, while the sub-Eddington AGN sample shows $\\langle E(B-V)\\rangle\n\\approx0.01$~mag with $\\sigma=0.01$. A Kolmogorov-Smirnov test rules out the hypothesis\nthat both groups are drawn from the same distribution of {$E(B-V)$}{} with a probability\nof $>99.9$\\%. Experimenting with other extinction curves give basically the same\ndistribution shown in Figure~\\ref{figure.Av}.\n\n\n\\subsection{Uncertainties in black hole mass}\n\nIn order to evaluate the goodness of our fit, we have analysed the black hole properties recovered by the thin AD fit.\nWe find that the measured ``virialized'' mass black hole and mass accretion rate, within the allowed uncertainties,\nlead to a suitable disc model for all the 29 AGN. The comparisons are shown in Figure~\\ref{figure.Mbh}. While it is not\nsurprising that the overall agreement is good (the initial choice of the model parameters is based on the measured values),\nthere is a tendency for the best fit SEDs to over-predict the black hole mass for the super-Eddington AGN.\nThe median deviation of the black hole mass\n($\\Delta \\log{M_{BH}}\\equiv \\log{M_{BH,\\text{fit}}}-\\log{M_{BH,\\text{virial}}}$) for the super-Eddington\nsources is 0.305 with a 16$^{th}$ and 84$^{th}$ percentile of 0.07 and 0.5, while the median for the sub-Eddington sources\nis -0.07 with its percentiles at -0.23 and 0.25. There is no systematic shift on the mass accretion rate which is uniformly\ndistributed. This is because the accretion rate in the disc model is directly related to the observed luminosity and the best\nmass estimate. Note also that the assumed inclination of $\\cos(\\theta)=0.75$ only introduce an additional uncertainty on the fitting\nresults and can not explain the black hole mass discrepancy observed in the super-Eddington population.\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.8\\linewidth]{fig5_Mbh.pdf}\\\\\n    \\includegraphics[width=0.8\\linewidth]{fig5_logMdot.pdf}\\\\\n    \\caption{Comparison of the virialized black hole mass (\\emph{top}) and the dimensionless mass\n        accretion rate (\\emph{bottom}) against those given by our best-fit thin AD model.\n        The straight lines indicate the 1:1 ratios. Gray-blue circles represent super-Eddington\n        AGN and gray-empty squares sub-Eddington AGN.}\\label{figure.Mbh}\n\\end{figure}\n\n\\subsection{Ionizing Continuum}\n\nAn additional consistency check of the fitted SEDs can be obtained by studying the disc ionizing\ncontinuum which is directly related to the observed emission lines. The relative intensity of the lines, as well\nas their equivalent widths are related to the mean energy of the ionizing photons, the ionization parameter and\nthe covering factor by gas near the BH. The hydrogen Lyman continuum as the part of the SED responsible for most\nof the heating and ionization of the broad emission-line gas can be derived from our disc SEDs. In\nparticular, we can calculate both Lyman continuum, $L_{Lyman}$, and the mean energy of an ionizing photon,\n$\\langle h\\nu\\rangle$, and compare the distribution of these numbers in the two groups.\n\nA comparison of the Lyman continuum properties of the two groups is shown in\nFigure~\\ref{figure.Llyman} where both parameters are plotted against the normalized Eddington ratio.\nFor comparison, the mean energy of an ionizing photon with an optical/UV power-law SED of slope\n$\\alpha_{\\nu}=1.5$ is 2.31 Ryd.\nAs expected, the super-Eddington group, with its higher accretion rate and smaller BH mass,\nare predicted to have larger $L_{\\text{Lyman}}$/$L_{\\text{AGN}}$ and higher $\\langle h\\nu\\rangle$.\nThe diagrams show a very strong trends with the mass accretion rate. This is in line with the results of\nV09, although their sample is in the lower-Eddington ratio regime. The average ionization fraction\nis $\\sim$0.5 for the lowest Eddington ratio $\\dot{\\mathcal{M}}\\leq3$ (similar with V09) and rise to $\\sim$0.9\nfor the highest $\\dot{\\mathcal{M}}>3$.\n\nHere, and in all other results related to the Lyman continuum, the soft X-ray emission, and the bolometric correction factors and torus covering factors discussed below, we must\ntake into account two important factors related to the highly simplified assumption of the high energy\npart of the SED in super-Eddington sources. First, the entire disc structure can change at high accretion rate,\nleading to two-component disc like the one proposed by \\citet{Done2012}. This possibility is not investigated\nhere, partly because of the large uncertainties on such models and mostly because of the lack of short wavelength observations.\nSecond, saturation, if exists, affects the far-UV SED much more than the near-UV and optical\ncontinuum \\citep[][and references therein]{DuPu2015}. In this scenario the bolometric luminosity for sources with\n$\\dot{\\mathcal{M}}>20$ has only a weak logarithmic dependency on the mass accretion rate (Eqn.~\\ref{eq.saturation}).\nSuch values of $\\dot{\\mathcal{M}}$ are found in most of the super-Eddington sources in our sample (11/16, see Table~\\ref{table.bfSED}).\nThe case of saturation is compared with the thin AD predictions in Figure~\\ref{figure.Llyman}, and comparison with the other relevant quantities are shown in Figs.~\\ref{figure.b5100A} and \\ref{figure.Ltorus}. Indeed it results in lower Lyman continuum bolometric\ncorrection factors and torus covering factors (see below). However,\nall these are still considerably higher than the values estimated for\nthe sub-Eddington sources. Note that we do not have a simple way of\nestimating the changes in the mean energy of the ionizing photons in\ncases of saturation and hence do no comment of this additional effects.\n\nIn principle, the higher expected $L_{\\text{Lyman}}/L_{\\text{AGN}}$ and $\\langle h\\nu\\rangle$ for super-Eddington sources could be\ninvestigated by comparing line intensities and EWs between the two groups. One prediction is that, given similar BLR covering factors, super-Eddington sources will show larger line EWs and stronger lines of highly ionized species. While this\ngeneral issue is beyond the scope of the present work, we note that such differences in EWs have never been reported.\nIn fact, several studies show tends in the opposite directions \\citep[see e.g. ][]{DuPu2014}.\\\\\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics{fig6_LlymanLtot.pdf}\\\\\n    \\includegraphics{fig6_LlymanLtot_sat.pdf}\\\\\n    \\includegraphics{fig6_Emean.pdf}\n    \\caption{Lyman continuum luminosity fraction for cases of no saturation (\\emph{top}) and saturation according to Eqn.~\\ref{eq.saturation} (\\emph{midle}). The mean energy of an ionizing photon\n    as a function of the normalized Eddington ratio for the cases of the no saturation is shown at the bottom. The red diamond represents\n    the median parameter for each group and the error bars correspond to the 16$^{th}$ and 84$^{th}$ percentile.\n    Gray-blue circles represent super-Eddington AGN and grey-empty squares sub-Eddington AGN.\n    }\\label{figure.Llyman}\n\\end{figure}\n\n\\subsection{Bolometric Correction factors}\nOur disc models can also be used to determine the bolometric correction factors for the objects in question. Such factors are used\nin many AGN studies \\citep{Marconi2004,Netzer2014} as a way to deduce the bolometric luminosity, $L_{\\text{AGN}}$, in those\ncases (basically\nall cases) where much of the SED is not directly observed. Bolometric corrections are frequently given as\n\n", "itemtype": "equation", "pos": 38913, "prevtext": "\nwhere $\\dot{\\mathcal{M}}$ is the dimensionless accretion rate defined as $\\dot{m}=\\eta \\dot{\\mathcal{M}}$ and $\\dot{\\mathcal{M}}_{crit}\\approx20$ \\citep{DuPu2015}.\nSuch theoretical approximations are yet to be confirmed\nby numerical simulations. For example, the recent numerical simulations of such objects by\n\\citet{Sadowski2015} suggest a relatively\nsmall drop in efficiency up to extremely high accretion rates.\nFinally, all AGN are known to be powerful X-ray sources with $L_{2-10\\,\\text{keV}}$ luminosity that, in most observed\ncases, is considerably below the integrated optical-UV luminosity \\citep[e.g.][]{Marconi2004,Steffen2006,Vasudevan2007,\nVasudevan2009,Grupe2010,Marchese2012}.\nThe dimension and variability of the X-ray source suggest that it is intimately related to the accretion process,\nthus the emitted X-ray radiation is most probably drawn from the accretion process itself. This must be taken into account\nwhen comparing the radiation efficiencies of thin and slim ADs.\n\nThe observed optical-UV SEDs of some AGN resemble the prediction of the thin AD model. In particular, they show a prominent\nbump in the optical-ultraviolet, the \\emph{Big Blue Bump} (BBB), which peaks at a BH-mass dependent frequency\nand declines at higher energies.\nUnfortunately, the comparison with theoretical AD SEDs has been hampered by the lack of simultaneous observations of these highly variable\nsources, and the limited wavelength range of most observations. Another source of uncertainty is intrinsic reddening\ndue to dust in the host galaxy of the AGN. Because of this, many earlier studies failed to reach a  conclusion regarding the\norigin of the observed SED with only marginal indications for a disc-like spectrum \\citep[see][]{Koratkar1999,Davis2007}.\nMoreover, an empirical SED made of a broken power-law with slopes $-0.5<\\alpha<1.5$, where $F_{\\nu} \\propto \\nu^{-\\alpha}$,\nhave been shown to give better fits to many observed, limited wavelength spectra \\citep{Zheng1997}.\n\nThe recent work of \\citet{Capellupo2015} shed new light on this issue. The work is based on VLT/Xshooter observations of\n39 type-I AGN with $z\\approx 1.55$ and a large range of $L_{\\text{AGN}}$ and {$\\dot{m}$}. They provide simultaneous information on the\nrest-frame wavelength range of 1100-9200\\AA{} which is large enough to test the AD model predictions.\nMore than 90\\% of the sources in this sample are well fitted with a thin AD model. The fitting requires moderate intrinsic reddening in\n$\\sim$30\\% of the sources with extinction in the range $0.1<A_{V}<0.5\\,$mag. This indicates that many earlier attempts to\ndiscover the unique spectral signature of thin ADs failed as a result of AGN variability and non-simultaneous data that cover\nonly a limited wavelength range. All the sources in the \\citet{Capellupo2015} sample are relatively low accretion\nrate systems with 90\\% of the sources in the range $10^{-2}<\\dot{m}<0.3$ and not a single source\nwith $\\dot{m}>1$.\n\n\nThe most accurate information about {$\\dot{m}$}{} in type-I AGN is obtained for sources with directly measured  BH mass through\nreverberation mapping (RM). Such information is now available for about 40 objects with $\\dot{m}<0.1$ \\citep[see][]{Bentz2013} and\nfor 15 objects with $\\dot{m}>0.1$ \\citep[][the objects we refer to as SEAMBHs]{DuPu2015}. The comparison of the two groups suggests\nthat for a given optical\nluminosity, the emissivity weighted radius of the broad line region (BLR) is considerably smaller in SEAMBHs with differences that\ncan amount\nto a factor of $\\approx 3$. As explained in \\cite{Wang2014b} and \\cite{DuPu2015}, this can be interpreted as a change in the nature\nof the power-house\nwhere the lower {$\\dot{m}$}{} systems are powered by thin ADs and the higher {$\\dot{m}$}{} objects by slim ADs.\n\nThere are several other well known difference between high and low {$\\dot{m}$}{} systems.\nThe first  is the nature of their X-ray continuum manifested by higher variability amplitude, steeper\nsoft X-ray slope and larger $\\alpha_{OX}$ (the slope connecting the flux at 2500\\AA{} and 2 keV) for\nthe higher {$\\dot{m}$}{} objects. These differences have been studied, extensively, in numerous\npapers \\citep{Pogge2000,Steffen2006,Gallo2006}, especially among lower luminosity\nAGN. Clear spectroscopic differences are also found at optical-UV wavelengths where the\nhigher {$\\dot{m}$}{} sources show narrower broad emission lines\nand much stronger Fe{\\sc ii} lines for a given optical luminosity. Such objects\nhave been named ``narrow line Seyfert 1 galaxies'' (NLS1s).\nTheir spectral differences are well characterized in the ``eigen-vector 1''\nscheme \\citep{Sulentic2000}.\n\nThe goal of the present work is to make a detailed comparison of the optical-UV SEDs\nof sub-Eddington and super-Eddington AGN. The number of accurately measured BH mass in SEAMBHs\nhas reached a stage where such a comparison is feasible and can be used to test various models\nand scenarios related to the AGN power-house and the accretion process itself. In particular,\nwe want to test whether thin and slim AD models reliably explain the observed\noptical-UV SED of such objects and the properties of their dusty tori, and test the\ndifferences, if any, between the two groups. An important aim of the present work is to\nimprove the X-ray-to-optical SED measurements and hence the\nestimates of the bolometric luminosity of AGN in sources powered by thin or slim ADs.\nThe pioneering study of \\citet{Elvis1994} presented radio-to-X-ray SEDs for quasar, is restricted to\nbright X-ray sources and cover both the intrinsic AGN continuum and the processed torus emission.\nUnfortunately, the processed radiation is added to the intrinsic emission which results in double\ncounting and too large bolometric correction factors. In later works, double counting was avoided,\nbut intrinsic reddening and host galaxy contribution was not taken into account\n\\citep[see e.g.][]{Marconi2004,Hopkins2004,Richards2006,Vasudevan2007}. This affects the bolometric\nluminosity measurements, underestimating its value. More recent works\n\\citep[][\\citealt{Vasudevan2009b} hereafter V09, \\citealt{Jin2012}, among others]{Brocksopp2006,Vasudevan2009},\npresented optical-to-X-ray SED emphasizing interesting trends between SED signature and Eddington ratio.\nHowever, most samples were restricted to low accretion rate AGN. In particular, there was a lack\nof super-Eddington sources with reliable, RM-based BH mass estimates since such objects were not known\nat the time.\n\n\nThe sample of AGN presented here is restricted to those AGN which are bright\nenough in the optical/UV and all have direct mass measurements. There are 29 objects selected\nby their spectroscopic properties with 16 of those showing extremely high accretion rates\n(refered to as super-Eddington AGN). This makes our approach different than all previous studies.\nFrom all previous studies, the work of V09 is the one most similar to ours.\nIt takes into account reddening and host galaxy corrections in the optical/UV,\nbut focus on low accretion rate sources and does not discuss the torus properties. Below we show\nthe similarity between V09 and our study regarding sub-Eddington AGN, and the missing information\nabout the torus, and make detailed comparison with the new group of super-Eddington sources.\nThe most recent works of \\citet{Marchese2012} and \\citet{Fanali2013} are other attempts\nto correlate accretion disc and X-ray properties of luminous AGN. There are several fundamental\ndifferences between these papers and the present work. First, the BH mass estimate is based on single-epoch\n(virial) method. Second, the accretion disc model is not a fit to individual SEDs but rather the same\nmodel for all sources with an assumed stationary BH but an efficiency $\\eta$ of 0.1 which is more\nappropriate to rotating BH. Third, and most important, the three bands used for the estimate bolometric\nluminosity (X-ray XMM-Newton, UV GALEX and optical SDSS) are not obtained simultaneously which,\nas we show below, introduces an uncertainty which is impossible to estimate. Because of these differences\nwe do not attempt to compare the results obtained in these papers to the one presented below.\n\nRecently, \\citet{Jin2016} presented a new result for a super-Eddington source\nRX~J1140.1+0307, where upper limit on the BH mass was obtained through RM (the upper limit\nis on the $H\\beta$ time lag). \\citet{Jin2016} present several SED fits based on\naccretion disc models using non-simultaneous data. There are also difficulties in host\ngalaxy subtraction and reddening correction. \\citet{Jin2016} found that\nthe best-fit SED overestimate the mass of the black hole by an order of magnitude\nrelative to the RM results. Because of these and the fact that the source is in the\nlowest black hole mass regime we do not attempt to compare their results to the ones\npresented here.\n\n\n\nThe structure of the paper is as follows. In Section~\\ref{SampleSelection} we describe the sample selection and the observational data.\nIn section~\\ref{intrinsicSEDs} we describe the intrinsic disc SED that we use and the fitting procedure is presented in\nsection~\\ref{SEDmodelling}. The principal results of the thin AD modelling and some additional spectral properties are\npresented in Section~\\ref{Results}. Finally, in Section~\\ref{Conclusions}, we summarize our main conclusions from this work.\nThroughout this paper we assume a $\\Lambda$CDM cosmology with $\\Omega_{\\Lambda}=0.7$, $\\Omega_{m}=0.3$, and\n$H_0=70$ km/s/Mpc.\n\n\n\n\n\n\n\\section{Sample Selection}\n\\label{SampleSelection}\n\nThe goal of this work is to compare various properties of high Eddington ratio AGN\nwith RM-measured BH mass with a similar group of low Eddington ratio AGN.\nOur high Eddington ratio sample consists of 16 radio-quiet AGN\nthat are basically all the potential SEAMBH candidates listed in the \\cite{DuPu2015} sample. The BLR sizes of 13\nof the sources were measured in a two-year RM-campaign on the Lijiang 2.4m telescope by the ``SEAMBH Collaboration''.\nThe objects were selected by their spectroscopic properties. They are all NLS1s with suspected high\nEddington ratio, $\\dot{m}$. The selection assumes a conservative method to estimate the\nnormalized accretion rate $\\dot{\\mathcal{M}}\\geq3$.\nThe value was chosen to make sure that $\\dot{m}$ for the lowest efficiency discs (those with spin -1 and $\\eta=0.038$) exceeds 0.1\n\\citep{DuPu2014,Wang2014b,DuPu2015}. Three additional SEAMBHs candidates, PG~2130+099, PG~0844+349 and Mrk~110, with similar\nproperties, were selected from the general catalogue of $\\sim 50$ RM-AGN. As of early 2015, these are the best candidates\nfor being super-Eddington accretors. We coin this sample the ``super-Eddington group''.\n\nWe have also selected a control sample of 13 type-I AGN from the general group of $\\sim$50 RM objects with a much\nsmaller Eddington ratio (defined in the same way) and $\\dot{\\mathcal{M}}<3$. This group, named as super-Eddington,\nwas selected to overlap in optical luminosity, defined as $\\lambda L_{\\lambda}$ at the rest-frame wavelength 5100\\AA,\nthe luminosity of the super-Eddington group. The luminosity distributions of the two groups\nare compared in Figure~\\ref{figure.L5100A}. Although the Kolmogorov-Smirnov test can\nnot reject the hypothesis that both luminosity distributions are drawn from the same distribution,\nthere is a factor two on its average rest-frame 5100\\AA{} luminosity which can not be improved due to the\nlimited RM-AGN sample ($10^{44}$ erg/s and 4.8$\\times10^{44}$ erg/s for super-Eddington and\nsub-Eddington groups, respectively). The redshift distribution of the sub-Eddington group is\nquite similar to the range covered by our super-Eddington objects. The median redshifts are\n0.054 and 0.031 for the super-Eddington and the sub-Eddington samples, respectively.\nFigure~\\ref{figure.L5100A} also shows the distribution of the virial BH mass in the two\nsamples. Due to the selection method which is based on source luminosity, the typical BH mass in\nthe control sample is much larger.\n\n\\begin{figure*}\n    \\centering\n    \\includegraphics[width=0.33\\linewidth]{fig1_logL5100A.pdf}\n    \\includegraphics[width=0.33\\linewidth]{fig1_logMbh.pdf}\n    \\includegraphics[width=0.33\\linewidth]{fig1_redshift.pdf}\n    \\caption{\\emph{From left to right}: Distributions of $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$,\n    virial black hole mass, and redshift for both samples. Filled (blue) histogram represents super-Eddington\n    AGN and hatched (grey) histogram sub-Eddington AGN. The point with error bars on the top of each panel is\n    the median and the 16$^{th}$ and 84$^{th}$ percentiles for each group.}\\label{figure.L5100A}\n\\end{figure*}\n\n\n\\subsection{Photometric and Spectroscopic Data}\n\\label{ObservationalData}\n\nWe have collected  optical-UV photometric and spectroscopic data from various surveys and data bases. The data are used\nto define and separate stellar from non-stellar sources of continuum radiation and to constrain the properties of the SEDs\nof all sources. The optical spectrum of 17 RM objects were taken from the Sloan Digital Sky Survey (SDSS) DR10.\nFor the remaining 12 sources, we used a mean optical spectrum from previous reverberation mapping campaigns. From\nthe AGN Watch database\\footnote{The AGN Watch is a consortium of astronomers who have studied the inner structure of\nAGN through continuum and emission-line variability. See http://www.astronomy.ohio-state.edu/$\\sim$agnwatch/} we selected\nthe mean spectrum of Mrk~279, Mrk~509, NGC~7469 and Fairall 9. The mean optical spectrum of Mrk~79 and  Mrk~817 were\ngiven by Peterson M.B. (private communication, \\citealt{Peterson1998}). The mean optical spectrum of the Palomar Green (PG)\nquasars (PG~2130+099, PG~0844+349, and PG~1617+175) were taken from \\citet{Kaspi2000}. Finally, the mean optical spectrum of Mrk~486,\nMrk~335 and Mrk~1044 are those published by the\n``SEAMBH Collaboration'' \\citep{DuPu2014}. All objects in our sample, except for Mrk~79 and PG~1617+175, have high quality\noptical spectra with broad optical wavelength range.\n\nAll objects in this work, except for Mrk~486, PG~0844+349 and SDSS~J080101.14+184840.7, have NUV and FUV\nphotometry (2306\\AA{} and 1551\\AA{},\nrespectively) obtained by the NASA Galaxy Evolution Explorer (GALEX). The GALEX fluxes were collected from the online\ndatabase and all image were inspected visually. We found  23 objects with observations in the all-sky imaging survey (AIS).\nIn addition, three objects (Mrk~1044, IRAS~04416+1215, Mrk~590) are also included in the medium imaging survey (MIS). No discrepancy\nwas found between both observations (a difference between AIS and MIS photometry less than 0.15 magnitudes in both GALEX bands).\nThree out of these 23 objects have been detected in different surveys: PG~2130+099 was found in the MIS, while NGC~5548\nand PG~1229+204 were selected from the Guest Investigator (GI) program. For 17 objects we also assembled optical/UV\nphotometry from the {\\it XMM-Newton} Optical Monitor (OM): V~5430\\AA{}, B~4500\\AA{}, U~3440\\AA{}, UVW1~2910\\AA{},\nUVM2~2310\\AA{} and UVW2~2120\\AA{}. From visually inspection of the available Hubble Space Telescope (HST) data\nwe cannot extend our dataset into the extreme UV because of variability, i.e. there is at least a factor 2 on flux between\nthe HST spectrum and the selected optical/UV dataset.\n\nSummarizing, of our 29 sources we have optical spectra in conjunction with GALEX photometry for 26 sources and 16 sources\nwhich, in addition to these data, also have XMM-OM photometry, and in 8 cases simultaneous optical/UV photometry.\nA detailed list of all the observations is given in Table~\\ref{table.Observations}.\n\n\\begin{table*}\n  {\\renewcommand{\\arraystretch}{1.19}\n  \\caption{Optical and UV observations used to model the SED of super-Eddington (upper block) and\n  sub-Eddington AGN (lower block).}\\label{table.Observations}\n  \\hspace*{-0.7cm}\n  \\resizebox{1.05\\linewidth}{!}{\n\\begin{tabular}{lccccccc}\\toprule\n  & & \\multicolumn{2}{c}{Optical Spectrum} & \\multicolumn{2}{c}{GALEX} & \\multicolumn{2}{c}{{\\it XMM-Newton} OM} \\\\\\cmidrule(r{.75em}l){3-4}\\cmidrule(r{.75em}l){5-6}\\cmidrule(r{0.75em}l){7-8}\n    Object & $E(B-V)_{\\text{Gal}}$ & survey & date & survey & date & XMMOM & date \\\\ \\midrule\n    \n    \n    Mrk~142  &  0.016  &  SDSS DR10 & 2003-03-09   & AIS  &  2004-01-22 \\\\\n    Mrk~335  &  0.035  &  SEAMBH Collaboration & 2012 Oct -- 2013 Feb & AIS  &  2007-04-02 & J000619.5+201211 & 2007-07-10 \\\\\n    Mrk~382  &  0.048  &  SDSS DR10 & 2001-10-19 & AIS  &  2007-01-21 & J075525.3+391110 & 2011-11-02 \\\\\n    Mrk~486  &  0.015  &  SEAMBH Collaboration & 2013 Mar -- 2013 Jul & &  \\\\\n    Mrk~493  &  0.025  &  SDSS DR10 & 2004-05-16 & AIS  &  2007-05-26 & &  \\\\\n    Mrk~1044 &  0.033  &  SEAMBH Collaboration & 2012 Oct -- 2013 Feb & MIS & 2008-10-11 \\\\\n    IRAS~04416+1215  & 0.436  &  SDSS DR10 & 2006-12-17 & MIS  &  2008-12-17 & &  \\\\\n    IRAS~F12397+3333 & 0.019  &  SDSS DR10 & 2005-03-02 & AIS  &  2004-04-15 & J124210.6+331702 & 2005-06-20 \\\\\n    SDSS~J075101.42+291419.1 & 0.042  &  SDSS DR10 & 2002-12-28 & AIS  &  2007-01-18 & &  \\\\\n    SDSS~J080101.41+184840.7 & 0.032  &  SDSS DR10 & 2004-11-10 & &   & &  \\\\\n    SDSS~J081441.91+212918.5 & 0.039  &  SDSS DR10 & 2004-11-18 & AIS  &  2006-01-27 & &  \\\\\n    SDSS~J081456.10+532533.5 & 0.032  &  SDSS DR10 & 2004-10-19 & AIS  &  2004-01-13 & &  \\\\\n    SDSS~J093922.89+370943.9 & 0.014  &  SDSS DR10 & 2003-12-23 & AIS  &  2005-08-12 & J093922.9+370945 & 2006-11-01 \\\\\n    PG2130+099  &  0.044  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & MIS  &  2009-08-22 & J213227.8+100819 & 2003-05-16 \\\\\n    PG0844+349  &  0.037  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & &  & J084742.4+344504 & 2009-05-03 \\\\\n    Mrk110  &  0.012  &  SDSS DR10 & 2001-12-09 & AIS  &  2007-01-23 & J092512.9+521711 & 2004-11-15  \\\\\n    \n    \n    \n    \\addlinespace\\\\\n    Mrk~79   &  0.071  &  \\citet{Peterson1998} &  1983 -- 1985  & AIS  &  2007-01-20 & J074232.8+494835 & 2008-04-26 \\\\\n    Mrk~279  &  0.016  &  AGN Watch & 1996 Dec -- 1997 Jan & AIS  &  2004-01-25 & J135303.5+691830 & 2005-11-19 \\\\\n    Mrk~290  &  0.014  &  SDSS DR10 & 2002-03-14 & AIS  & 2005-10-22  & J153552.3+575409 & 2006-05-04 \\\\\n    Mrk~509  &  0.057  &  AGN Watch & 1988 Sep -- 1993 Dec & AIS  &  2007-02-09 & J204409.7-104324 & 2009-11-14 \\\\\n    Mrk~590  &  0.037  &  SDSS DR10 & 2003-01-08 & MIS  &  2008-10-23 & & \\\\\n    Mrk~817  &  0.007  &  \\citet{Peterson1998} & 1983 -- 1985 & AIS &  2007-02-21 & & \\\\\n    Mrk~1511 &  0.041  &  SDSS DR10 & 2007-04-17 & AIS  &  2007-04-17 & J153118.1+072729 & 2012-02-23 \\\\\n    NGC~5548 &  0.020  &  SDSS DR10 & 2006-05-04 & GII  &  2006-10-30 & J141759.5+250813 & 2013-07-29 \\\\\n    NGC~7469 &  0.068  &  AGN Watch & 1996 Jun -- 1996 Jul &  AIS  &  2007-03-22 & J230315.6+085226 & 2004-11-30 \\\\\n    PG~1229+204 &  0.027  & SDSS DR10 & 2008-01-16 & GII  &  2007-05-22 & J123203.7+200929 & 2005-07-09 \\\\\n    PG~1617+175  &  0.042  &  \\citet{Kaspi2000} & 1991 Aug -- 1997 Oct & AIS  &  2006-06-14 & & \\\\\n    Fairall9 &  0.025  &  AGN Watch & 1994 May -- 1995 Jan & AIS  &  2007-08-17 & J012345.7-584820 & 2013-12-19 \\\\\n    MCG+06-26-012 &  0.019  &  SDSS DR10 & 2005-03-31 & AIS  &  2007-03-22 & & \\\\\n\\bottomrule\n\\end{tabular}\n}}\n\\end{table*}\n\n\n\n\n\n\n\\section{Observed and Intrinsic SEDs}\n\\label{intrinsicSEDs}\n\nA central goal of the present work is to compare the multi-wavelength SEDs of super-Eddington\nand sub-Eddington AGN. For this we need to correct for non-simultaneous observations,\nto subtract the stellar and emission line contributions, and to consider the possibility of\nintrinsic reddening of the sources. As for  Galactic interstellar reddening, this is done\nassuming the \\citet{Cardelli1989} extinction law using the Galactic extinction colour excess\n{$E(B-V)$}{} obtained from the NASA/IPAC Infrared Science Archive\\footnote{http://irsa.ipac.caltech.edu/applications/DUST/}.\n\n\\subsection{Long term optical-UV variability}\n\\label{OC.Variability}\n\nThe presence of variability in the optical/UV continuum of all the sources in our sample is well documented.\nWhilst we can expect variability of order  a few per cent in the optical-UV continuum on short-time of days to a week,\nmuch larger factors are expected on time scales of months and years. For example, \\citet{SantosLleo1997}\nfound a factor of $\\sim$2 for Fairall 9 in the optical continuum flux over a three month period and even larger factors\nhave been found for NGC~5548 \\citep[a factor of $\\sim$7 over a seven years period, ][]{Peterson1999}. Therefore\nvariability is the main challenge for the work presented here.\n\nThe information that is available for most sources is a combination of optical spectroscopy and GALEX photometry. Most\nof these data are not simultaneous. In order to avoid as much as possible the non-simultaneity, and to complete the UV\nGALEX information, we used data obtained by the {\\it XMM-Newton} Optical Monitor (OM). OM photometry\nwas available for 17 out of 29 objects and contemporaneous optical/UV observations (at least 5 simultaneous OM points) for\nonly 6 sources (see Table~\\ref{table.Observations}). These contemporaneous optical/UV observations provide reliable\nconstraints on the source SEDs and help to reduce the fitting uncertainty (see Appendix~\\ref{IndividualNotes}).\n\nThe heterogeneity of our optical/UV datasets dictate a somewhat different procedure for each of the fitted sources.\nThree different procedures were used: {\\sc i)} a simultaneous and non-simultaneous SED were fitted in order to quantify\nthe non-contemporaneous SED shape; {\\sc ii)} when simultaneous dataset was not possible, both GALEX and OM photometry\nin conjunction with the optical spectrum were fitted as long as there is no signs of variability, i.e. all segments of the\nfitted continuum join smoothly; {\\sc iii)} for those sources without {\\it XMM-Newton} OM observations we fitted\nthe non-simultaneous optical-GALEX SED assuming  they were observed at a similar flux epoch. Comments on individual sources\nare given in Appendix~\\ref{IndividualNotes}. This general procedure works well in all the objects discussed in the present\npaper although non-simultaneity is still the main limiting factor.\n\n\\subsection{Host Galaxy Contribution}\n\\label{OC.HG}\nThe optical/UV emission may be contaminated by starlight from the host galaxy. The relative contribution depends on\nthe aperture size, AGN luminosity, and the stellar population in the host. Thus careful galaxy subtraction\nis necessary if we are to determine the SED shape. Such corrections are often made by subtracting galaxy\nbulge template spectra. Star formation in the central part must also be considered since the host of many AGN\nare star formation galaxies \\citep[e.g. ][]{Sani2010}.\n\nThere are three methods that can be used to correct the observed spectra for host-galaxy contamination. The first\nis a direct subtraction of the stellar light measured from HST images. Such data are available for 25 of the sources\n\\citep[][]{Peterson1998,Bentz2009,DuPu2014,Wang2014b}. Published galaxy light profiles were used\nin these cases and normalized to the aperture in question. This correction is normally small (20-70\\%) for the\n3\\arcsec{} SDSS fiber and considerably larger for the 6\\arcsec{} aperture of the optical OM filter. The second method\nmakes use of empirical expressions derived by \\citet{Shen2011} and \\citet{Elvis2012}. The uncertainty here is much\nlarger because of the considerable range in host properties. Finally, one can use the fact that the broad {H$\\beta$}{} lines\nshow no Baldwin effect \\citep{Dietrich2002}. This means that the observed equivalent width of the line, EW({H$\\beta$}{}),\ncan be used to derive the fraction of the non-AGN light entering the aperture at 4861\\AA{}. \\citet{DuPu2015}\nshow the distributions of EW({H$\\beta$}{}) in low Eddington ratio AGN and in SEAMBHs. The two differ by a considerable amount\nwith medians that are $(122\\pm44){\\textup{\\AA}}$ and $(89\\pm31){\\textup{\\AA}}$, respectively.\n\nFor those sources without HST observations,\nwe prefer the use of this method over the expressions given by \\citet{Shen2011}. The main concern is how to treat\nthe five objects without HST observations.\n\nThe subtraction procedure starts with an estimate of the non-AGN flux at 4861\\AA{} followed by a subtraction of a single\nsimple stellar model spectrum which is scaled to this flux. A nominal 20\\% uncertainty on this flux was adopted due to a combination\nof the host-galaxy modelling and the uncertainties on the emission line fluxes. The SDSS fibers include only the innermost few\nkpc of the host, hence we chose a quiescent galaxy model from the evolutionary spectral library of \\citet{Charlot1991}. For 15\nout of 29 objects, the instantaneous-burst model with an age of 11 Gyr and solar metallicity (Z=0.02) provided sufficiently good fit\nto the stellar spectrum. For the remaining 14 objects, this template gives a ``flux excess'' at the longest observed wavelengths.\nA template with 11 Gyr and Z=0.05 provides better fit to such spectra and was adopted in these cases. We also experimented with\nadding younger stellar population components but did not find significant improvements over the old population templates.\n\nThe difference on aperture between the SDSS fibres (3\\arcsec) and the OM broadband filters (12\\arcsec{} and 35\\arcsec{}\ndiameter for the optical and UV filter, respectively) prevent us from using the estimated host-galaxy contribution to the optical\nspectrum to subtract the star-light from the OM photometric data. For the OM photometric dataset, the host galaxy emission was\nmodeled by adopting the published galaxy-light radial profiles \\citep[][]{Bentz2009} which were integrated over the specific OM\naperture to estimate the host-galaxy contribution to the total observed flux.\n\n\\subsection{Emission line Contributions}\n\\label{OC.PhotometricCorrections}\nThe wavelength range for the photometry are wide enough that the underlying nuclear continuum might be contaminated\nby broad and narrow emission lines, i.e. Balmer lines, C$\\,${\\sc iv}, Mg$\\,${\\sc ii}, Fe$\\,${\\sc ii},\nas well as the Balmer continuum.\n\nIn order to exclude the underlying continuum, we used the composite quasar spectrum of \\citet{VandenBerk2001}\nto estimate the emission line fraction for each photometric waveband. We assumed only the emitted flux in the spectral\nwindow over which the effective transmission is greater than 10\\% of the peak effective transmission: FUV~1343--1786\\AA{},\nNUV~1771--2831\\AA{}, UVW2~1805--2454\\AA{}, UVM2~1970--2675\\AA{}, UVW1~2410--3565\\AA{}, U~3030--3890\\AA{},\nB~3815--4910\\AA{} and V~5020--5870\\AA{}. For comparison, at redshift $z=0.06$, which is the mean of our\nsample, the contributions from the emission line regions at each photometric window are 5\\%, 11.9\\%, 9.4\\%, 13.0\\%, 23.4\\%, 24.6\\%,\n15.9\\% and 24.9\\% for FUV, NUV, UVW2, UVM2, UVW1, U, B  and V, respectively. Since line variations follow continuum\nvariations (albeit with somewhat different lags), we do not expect large fluctuations in these fractions.\n\n\\subsection{Intrinsic reddening}\n\\label{OC.IR}\n\nIntrinsic extinction in AGN can be significant which can make it an important factor when determining the SED of the\noptical/UV continuum. Previous studies \\citep[][Mejia-Restrepo et al. 2015 (submitted), and references\ntherein]{Lusso2013,Capellupo2015,Collinson2015} found a range of properties with most AGN showing little\ndust attenuation, i.e. {$E(B-V)$}<0.1, independent of the reddening law. Such reddening does not affect much the optical fluxes, but its\neffect on the UV part of the spectrum is significantly larger. Not accounting for this effect will result in fitting the wrong accretion\ndisc models and the miss-calculation of source luminosity and accretion rate.\n\nExtinction curves which are commonly used in AGN studies include: Milky Way-like extinction with its known broad\nbump at $\\sim$2175\\AA{}, Small Magellanic Cloud-type (SMC) curves, a simple power-law extinction, or a combination of a\npower law with a flatter curve in the far-UV \\citep{Gaskell2004}. Several earlier\nworks \\citep{Hopkins2004,Glikman2012} claimed that the typical bump at 2175\\AA{} of the MW-like extinction curve is not\nobserved in AGN spectra. Recent, higher quality spectra and more carefully fitted SEDs by \\citet{Capellupo2015} clearly show\nthis bump in some of the spectra.\n\nSince the wavelength dependence of the extinction is unknown, a priori, we experimented with three possibilities: {\\sc i)}\nthe \\citet{Cardelli1989} as a MW-like curve with $R_V=3.1$, {\\sc ii)} a simple power-law $A(\\lambda)=A_{0} \\lambda^{-1}$,\nand {\\sc iii)} the SMC extinction curve as given in \\citet{Gordon2003}. According to the wavelength dependence of the extinction\ncurve, the intrinsic reddening will be larger for the SMC curve than for the MW. The most consistent approach is to add this extinction\nas an additional parameter in the SED modelling analysis. Clearly, if extinction is important, the intrinsic underlying continuum\nshape will depend significantly on the form of the reddening curve.\n\nAs a practical point we note that the extremely broad GALEX\nbands do not allow us to take into account spectral features like the 2175\\AA{} absorption and weaker ISM lines and we only treat\nthe total observed flux in these bands.\n\n\n\n\n\n\\section{SED model fitting}\n\\label{SEDmodelling}\n\n\\subsection{Accretion disc models}\n\nIn this work, we use the numerical code described in \\citet{Slone2012} to calculate thin AD spectra. The calculations assume a\n\\citet{Shakura1973} disc with a variable viscosity parameter (chosen in this paper to be $\\alpha = 0.1$). As in all models of this type\n(see Sec.~\\ref{Introduction}), the spin-dependent ISCO determines the mass-to-energy conversion efficiency, $\\eta$.\n\nThe focus of the \\citet{Slone2012} work is the effect of disc winds on the emitted SEDs. Here we do not consider\ndisc winds because of the lack of far UV spectroscopy required to deduce their presence and because we focus on\nslim disc where there are additional large uncertainties (see below). As in \\citet{Slone2012}, our calculations\ninclude Comptonization of the emitted radiation at every point in the disc atmosphere and,\nfor BH spin values of $a_{\\star}>0$, full General\nRelativistic corrections. For retrograde discs with $a_{\\star}<0$, the general relativity effects are not\nincluded, which is a fair approximation given the large size of the ISCO ($>6r_{g}$, where $r_{g}=GM_{BH}/c^2$ is the gravitational\nradius of the black hole).\n\nApart from Comptonization, the calculations do not include any other radiative transfer\nin the disc atmosphere that can make significant changes to the far UV SED \\citep[e.g.][Fig. 2]{Davis2011}.\n\nStandard, \\citet{Shakura1973} thin accretion disc models are limited to $\\dot{m} \\le 0.3$. Beyond this accretion rate, the disc geometry\nbecomes thick and many of the approximation used in the  model no-longer hold \\citep[see][and references therein]{Laor1989}.\nAs explained in Section~\\ref{Introduction}, the main differences between thin and slim discs are the thicker geometry,\ndue to the much larger radiation pressure in the disc, and the way the radiation escapes the system. This includes radial advection\nand perhaps saturation of the emitted luminosity. Unfortunately, detailed SED calculations of slim discs are highly simplified and\nhardly available. A recent detailed model of this type is discussed in \\citet{Wang2014b}. According to this and earlier models, the\nlong wavelength part of the SED originates outside of the thick part of the disc and is, therefore, very similar in its shape to the\nthin AD SED. For small BH mass systems, significant differences between the two appear only at very short wavelengths, beyond the\nLyman limit. The special geometry dictates strong anisotropy in such systems, much beyond the standard AD anisotropy due to inclination.\nThis, again, is most noticeable at short wavelengths \\citep[see Fig. 4 in][]{Wang2014a}.\nThe observations discussed here do not include the wavelength range below $\\lambda$=1000\\AA{} and hence we use the thin\nAD model for the fitting of the SED over this range. Later on, when we discuss the Lyman continuum emission, we\nconsider the various possibilities regarding slim discs.\n\nAs explained earlier, theoretical slim disc models are still highly simplistic and are not in very good agreement with state-of-the-art\nnumerical calculations like those of \\citet{Sadowski2015}. Given this fundamental uncertainty, we treat all derived quantities that\ndepend on the short wavelength part of the model, e.g. the bolometric luminosity and Eddington ratio, as the most uncertain parameters\nfor the sub-sample of 16 SEAMBHs described in this work.\n\n\n\\subsection{Fitting procedure}\n\nWe used the \\citet{Slone2012} code described earlier to calculate a large number of thin disc spectra that include the entire range\nof BH mass, accretion rate and spin expected in our sample. The input for the fit include, for each source,  the black hole mass\n({$M_{BH}$}{} in units of $M_{\\odot}$), and the mass accretion rate ({$\\dot{M}$}{} in units of $M_{\\odot}$/yr). We used the RM-based masses\nand the measured (from the 5100\\AA{} continuum) accretion rates listed in \\citet[see Table 7]{DuPu2015}. The uncertainty on the mass\nis estimated to be a factor of $\\sim$3 due to the the uncertainties on the measured time lags, the measured FWHM(H$\\beta$), and the\nuncertainties in the conversion of observed broad line profiles to a ``mean gas velocity'' (the $f_{_{BLR}}$ term in\n$M_{BH}=f_{_{BLR}}\\,c\\,\\tau\\,FWHM(H\\beta)^{2}/G$).\nThe accretion rate is obtained from the luminosity at rest-wavelength 5100\\AA{} using the method described in \\citet{Davis2011} as\ndetailed in \\citet[][see Eqn. 1 there]{Netzer2014}. We assumed a factor three uncertainty on the accretion rate derived in this way which\nis a combination of flux uncertainty (mostly stellar light subtraction), the unknown inclination, and the fact that the chosen wavelength\n(5100\\AA{}) is not on the $L_{\\nu} \\propto \\nu^{1/3}$ part of the SED.\n\nAll sources fitted in this work are type-I AGN which are assumed to be observed close to face-on. The range of inclination\nis roughly 0--60 degree and the range in $\\cos{(\\theta)}$ 0.5--1. We assumed the anisotropy function proposed by\n\\citet{Netzer2014},\n\n", "index": 3, "text": "\\begin{equation}\n    f(\\theta) = \\frac{f_0F_{\\nu}}{F_\\nu{}\\text{(face-on)}} = f_{0}\\;\\frac{\\cos{\\theta}\\left(1+b(\\nu)\\cos{\\theta}\\right)}{1+b(\\nu)}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"f(\\theta)=\\frac{f_{0}F_{\\nu}}{F_{\\nu}{}\\text{(face-on)}}=f_{0}\\;\\frac{\\cos{%&#10;\\theta}\\left(1+b(\\nu)\\cos{\\theta}\\right)}{1+b(\\nu)}\" display=\"block\"><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mi>f</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>F</mi><mi>ν</mi></msub></mrow><mrow><msub><mi>F</mi><mi>ν</mi></msub><mo>⁢</mo><mtext>(face-on)</mtext></mrow></mfrac><mo>=</mo><mrow><mpadded width=\"+2.8pt\"><msub><mi>f</mi><mn>0</mn></msub></mpadded><mo>⁢</mo><mfrac><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>b</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>b</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07177.tex", "nexttext": "\nwhere $L_{\\text{AGN}}$ is the intrinsic bolometric luminosity obtained from the best-fit thin AD model. Here we report\n$\\kappa_{\\nu}$ relative to\n5100\\AA{}, 3000\\AA{} and 1400\\AA{} (see Table~\\ref{table.bfSED}). Unfortunately, our limited wavelength coverage does not allow us to\ndistinguish between the spins which is the main uncertainty on the bolometric correction factors. The difference in efficiency between the\ntwo extreme spin values amount to about a factor 8.4.\n\nFigure~\\ref{figure.b5100A} shows the distribution of the bolometric correction factor as a function of mass\naccretion rate. In general, $\\kappa_{5100\\AA{}}$ has a very wide distribution where, for the sub-Eddington group, the values\nare distributed around the ``standard'' value of about 10 used in many earlier studies like \\citet{Kaspi2000,Marconi2004,Trakhtenbrot2012}.\nThere is a clear tendency for a larger $\\kappa_{5100\\AA{}}$ in the group of super-Eddington sources due to the significantly higher accretion\nrate for a given BH mass. This results in a shift of the SED to shorter wavelength and a considerable increase in $\\kappa_{5100\\AA{}}$.\nFor this group, a more typical value is about 150. As explained, there are large uncertainties in calculated disc SEDs for such sources\nsince their large $L_{\\text{AGN}}/L_{Edd}$\nsuggests they contain slim rather than thin ADs.\nIn particular, we must consider the possibility of saturation for $\\dot{\\mathcal{M}}>20$.\nIn this case the bolometric correction factor at 5100\\AA{} is considerably smaller, about 60 instead of 150 (see bottom panel of\nFig.~\\ref{figure.b5100A}).\n\n\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.95\\linewidth]{fig7_b5100.pdf}\\\\\n    \\includegraphics[width=0.95\\linewidth]{fig7_b5100_sat.pdf}\n    \\caption{Bolometric correction at 5100\\AA{} as a function of the Eddington ratio for the best-fit thin AD models on the top panel and the case of saturation at the bottom. Colour code as in Fig.~\\ref{figure.Llyman}.}\n    \\label{figure.b5100A}\n\\end{figure}\n\n\n\\subsection{Torus emission and SED}\n\\label{section.torus.SED}\n\nWe also tested the possible differences between sub-Eddington and super-Eddington sources by investigating their torus emission.\nThis is done by using the most recent available WISE All-Sky Data Release that covers $>$99\\% of the sky. The torus SED\nwas constructed from the four WISE bands, at 3.6, 4.5, 12 and 22$\\,\\mu$m, using only data with a signal-to-noise ratio SNR>20. The observed\nIR SED were modelled by the torus template of \\citet{Mor2012} which is made of three components: a clumpy torus, a dusty narrow line region,\nand a hot pure-graphite dust component which represent the innermost part of the torus. In general, this SED is similar to other\ntorus SEDs, e.g. those used by \\citet{Mullaney2011} and \\citet{Lira2013} except that none of these models include the\nhot graphite dust and hence cannot provide\na proper fit to the short wavelength part at around 1-3$\\,\\mu$m. Given the lack of adequate spectral resolution, there is no way to take into account\nthe contribution of star-formation emission in the host galaxy. In addition, we do not have good enough\nspatial information to isolate the nuclear AGN emission from star formation in the host galaxies. These points were\ndiscussed in detail in \\citet{Sani2011} and \\citet{Mor2012} where a much larger number of\nlow and high Eddington ratio (NLS1s) AGN are considered.\n\nThe fitting procedure is based on the use of three templates, the mean torus SED and its 25$^{th}$ and\n75$^{th}$ percentiles. In this procedure, the normalization is the only additional free parameter and its value\nis determined by a $\\chi^{2}$ analysis. This procedure has been recently discussed in great detail\nby Nezer et al. (2015). Earlier attempts are described in\n\\citet{Mullaney2011,Lusso2013,Roseboom2013,Tsai2015} and others.\n\nWe find that in all 29 cases, one of the three templates gave a satisfactory fit to the observed\nnear- and mid-IR. Figure~\\ref{figure.medianSED} shows the median torus AGN for both groups which was\nconstructed from the best-fit templates. In general, the observed SEDs are very similar but the mid-IR\nspectrum of SEAMBHs is somewhat bluer.\n\nGiven the torus SED we can compare the torus covering factor of super-Eddington and sub-Eddington sources.\nIn general, this depends on the emission pattern of the torus and hence on deviations from isotropy\n\\citep[][and references therein]{Netzer2015}. For the purpose of the present paper we assume complete\nisotropy and compare the integrated 1-200$\\,\\mu$m emission of the torus, $L_{\\text{torus}}$, with\n$\\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ and $L_{\\text{AGN}}$ of each source. For the torus model used here\n$L_{torus}/L_{5\\mu m}=3.58$ for the median composite, 3.18 for the bluer composite and 4.27 for the redder\ncomposite. The comparison of $L_{torus}/\\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ in the two groups suggest\nvery similar distribution (see Table~\\ref{table.statisitcs}). On the other hand\n$L_{\\text{torus}}/L_{\\text{AGN}}$, which is related to the torus covering factor, show lower fractions\nfor super-Eddington AGN (see Figure~\\ref{figure.Ltorus}) because of their larger $\\kappa_{5100\\AA{}}$.\nAs discussed below, this difference suggest either saturation (Eqn.~\\ref{eq.saturation}) or\nthat the far-UV luminosity of the super-Eddington is\nover-estimated by a large factor.\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.95\\linewidth]{fig8_LtorusLtot.pdf}\\\\\n    \\includegraphics[width=0.95\\linewidth]{fig8_LtorusLsat.pdf}\\\\\n    \\caption{The torus luminosity fraction, defined as $L_{torus}/L_{\\text{AGN}}$ and assuming\n    complete isotropy for the dust emission, as a function of the normalized Eddington ratio (top no saturation, bottom saturation according to Eqn.~\\ref{eq.saturation}).\n    Colour code as in Fig.~\\ref{figure.Llyman}.}\n    \\label{figure.Ltorus}\n\\end{figure}\n\n\\begin{figure}\n   \\includegraphics[width=\\linewidth]{fig2_medianSED_m1p000.pdf}\n   \\caption{Median AGN SEDs for the two groups: blue, dashed line represents\n   super-Eddington and black, solid line sub-Eddington. The shaded areas show\n   the 25$^{th}$ and 75$^{th}$ percentiles. The circle (super-Eddington) and square (sub-Eddington)\n   points represent the median luminosity at 2$\\,$keV, 5100\\AA{}, 3.6$\\,\\mu$m, 4.5$\\,\\mu$m, 12$\\,\\mu$m and 22$\\,\\mu$m.\n   The X-ray luminosity at 2$\\,$keV was computed assuming a single power-law between 2-10$\\,$keV\n   corrected for galactic absorption. The horizontal line displays the spectral window used to\n   fit both thin AD model and the torus templates. The displayed median disc SED\n   is assuming the minimum spin ($a_{\\star}=-1$).}\\label{figure.medianSED}\n\\end{figure}\n\n\n\\subsection{Simultaneous Optical/UV and X-ray Observations}\nThe AGN paradigm includes a thermal accretion disc emitting in the optical-UV and a corona which\nup-scatters the emitted disc photons to X-ray energies resulting in a power-law X-ray emission.\nStudies of large AGN samples show a clear dependence of $\\alpha_{OX}$ (the spectral index connecting\nthe 2500\\AA{} and 2$\\,$keV emission) on the UV luminosity such that higher $L_{\\nu}(2500\\AA{})$ corresponds to weaker\n2~keV emission \\citep[see][and references therein]{Steffen2006,Grupe2010}.\n\nIn this paper we treat\nthe 2-10~keV emission in a simplistic way and focus on $\\alpha_{OX}$. In a forthcoming publication\nwe provide more information about the X-ray spectral shape including new XMM-Newton observations for\nsome of the sources.\n\nWe calculate the optical-to-X-ray spectral slope $\\alpha_{OX}$ for 17 sources that have simultaneous\nX-ray spectrum and OM photometry and show them in Figure~\\ref{figure.alphaOX} against the rest-frame\nluminosity at 2500\\AA{}, the normalized Eddington ratio and the black hole mass. The X-ray luminosities\nwere derived from the absorption-corrected rest-frame 2-10~keV fluxes which was modelled with a single\npower law accounting for Galactic absorption. Except for two sources (NGC~7469, and PG~0844+349),\nthe values of $\\alpha_{OX}$ corrected for intrinsic reddening lie within the scatter expected from\n\\citet{Steffen2006} which reinforce the importance of accounting for dust extinction\n\\citep[V09,][]{Grupe2010}. There are reasons to suspect the reliability of $\\alpha_{OX}$ for\nthe two outliers. The X-ray spectrum of NGC~7469 shows sign of high absorption which could\nexplain their lower optical-to-X-ray spectral slope. For PG~0844 there is an inconsistency between\nthe optical spectrum and the OM photometry that suggest a large uncertainty due to\nSED variations. We point the reader to Appendix~\\ref{appendix.Notes} for a more detailed explanation.\nInterestingly, the distribution of $\\alpha_{OX}$ shows no large differences between sub-Eddington\nand super-Eddington sources with an average $\\alpha_{OX}$ of -1.36 and -1.48, respectively.\nIn contrast with V09, we do not find any correlation between $\\alpha_{OX}$ and the black hole mass.\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.8\\linewidth]{fig9_alphaOX_l2500A.pdf}\\\\\n    \\includegraphics[width=0.8\\linewidth]{fig9_alphaOX_mdot.pdf}\\\\\n    \\includegraphics[width=0.8\\linewidth]{fig9_alphaOX_logMbh.pdf}\n    \\caption{$\\alpha_{OX}$ as a function of the rest-frame luminosity at 2500\\AA{}\n    (\\emph{top}), the normalized Eddington ratio (\\emph{middle}) and the black hole mass\n    (\\emph{bottom}). The solid line and shaded area in the top panel show the best fit\n    and spread obtained by \\citet{Steffen2006} for a sample of optically selected AGN.\n    Colour code as in Fig.~\\ref{figure.L5100A}. The two outliers with the smallest\n    $\\alpha_{OX}$ are NGC~7469 and PG~0844.}\n    \\label{figure.alphaOX}\n\\end{figure}\n\n\n\n\n\n\n\n\\section{Discussion and Conclusions}\n\\label{Conclusions}\n\nWe have presented SEDs for a sample of AGN selected for their accretion rate from a variety\nof reverberation mapping campaigns. We define a group of super-Eddington AGN thought to be powered\nby slim accretion discs because of their extremely high Eddington ratio, and compared them to\nsub-Eddington AGN thought to be powered by thin accretion discs. The unique aspect of the work\nis the detailed comparison with high accretion rate AGN with BH mass measured from direct RM. We have 16 objects\nof this group which triples the number of such objects known in previous studies.\nThe 5~keV to 10000\\AA{} spectral energy distribution modelled here is, in our opinion, the best way to compare\nthin and slim disc models and to test the various suggestions for the extreme properties of slim\ndiscs at the far-UV. A very detailed study of the intrinsic SED of very high accretion rate AGN, like those studied here,\nhas never been done before. We are able to improve the SED modelling by employing the most\naccurate measurements of mass accretion rate and black hole mass, as well as simultaneous\noptical-to-UV photometry in conjunction with high resolution optical spectra. These are useful\nfor determining the degree of host-galaxy contamination and for constrain better the intrinsic\nreddening of the sources.\n\nIn general we find that the host galaxy contribution spans a fairly wide range of values, but the\noptical/UV emission lines are unlikely to contaminate the underlying disc continuum. The\nsimultaneous and non-simultaneous optical-to-UV (0.2-1$\\,\\mu$m)\ndata, allowed us to fit thin AD models, including both Galactic and intrinsic extinction, to all\n29 RM-selected AGN: 13 sub-Eddington sources and 16 super-Eddington sources.\n\nWe find that in the lower-Eddington ratio regime ($\\dot{m}<0.3$) the estimated intrinsic dust\nextinction is consistent with zero in approximately 46\\% of the sources. The fractional\nnumber, and the median $E(B-V)$ are similar to those obtained in earlier and larger samples of AGN\nthat used different types of SEDs. For the high accretion rate AGN ($\\dot{m}\\ge0.3$) we find that\nat least 75\\% (12/16) of these require significant optical-UV dust reddening. On average, the\nlevel of dust extinction in the super-Eddington group is higher than that of the slow accreting AGN.\n\nAs in earlier studies that combine accretion disc and corona models, we confirm that those AGN with higher\naccretion rate and smaller BH mass present larger reddening-corrected ionizing fractions,\n$L_{\\text{Lyman}}/L_{\\text{AGN}}$. The actual number depends on the importance of saturation in the super-Eddington sources.\nAnother related conclusion is that super-Eddington sources show higher\nmean energy of the ionizing photons and larger bolometric correction factors. In this fast accreting\nAGN sample, the 5100\\AA{} bolometric corrections is\nan order of magnitude larger than the factors found for sub-Eddington sources, depending on the importance of saturation. This correlation\nfactor is considerably larger than the ``standard'' value used in many earlier studies based on low Eddington ratio sample. Note that our approach does not take into account\nthe contribution of the X-ray emission and extrapolate the thin AD models to far-UV energies.\nA useful extension of this work would be to acquire simultaneous HST observations\nat shorter wavelengths, potentially improving the extreme-UV SED shape and reveal clues about the nature\nof slim accretion disc.\n\nOur study shows that for 15/17 objects with simultaneous UV-X-ray observations, there is no correlation\nbetween $\\alpha_{OX}$ with accretion rate or black hole mass. Part of this may be related to the reddening\ncorrection used in this work mostly for large $\\dot{m}$ AGN. In particular, our study does not confirm the\ncorrelation of $\\alpha_{OX}$ with black hole mass suggested in V09.\n\nWe find no statistical evidence that the torus SED in super-Eddington AGN\nis different from the one in sub-Eddington AGN, although the median torus SED is marginally bluer\n(see Figure~\\ref{figure.medianSED}). Moreover, the medians $L_{5\\mu m}/L_{5100{\\textup{\\AA}}}$ of the two groups\nare very similar. However, there is a very significant difference in the derived tours covering factors,\nwith super-Eddington sources showing much smaller $L_{\\text{torus}}/L_{\\text{AGN}}$ by as much as an\norder of magnitude even when considering saturation. This is basically\nthe same result obtained for the $L_{5100{\\textup{\\AA}}}$ bolometric correction factor and is directly related\nto the predicted, but so far unobserved far-UV emission of super-Eddington objects.\n\n\nThere are two major conclusions to the present study. First, thin AD models can be used to obtain\nsatisfactory fits to the 0.2-1$\\,\\mu$m SEDs of all AGN, whether sub-Eddington or super-Eddington accretors.\nThis is generally consistent with the few available, albeit not very accurate calculated slim accretion\ndisc 0.2-1$\\,\\mu$m SEDs that show them to be generally similar to SEDs of thin ADs\n\\citep[][and references therein]{Wang2014a}. Second, several\nof the important results obtained here, that are related to the high energy (Lyman continuum) part of the\nSED, including $L_{\\text{Lyman}}/L_{\\text{AGN}}$, the mean energy of the ionizing photons, and the\nbolometric correction factors, all suggest large differences between the two groups. However, these are not\ndirect observations but rather inferences from model assumptions about the part of the continuum, below\nabout 0.2-1$\\,\\mu$m, which is not accessible to us. It is quite likely that\nthe total emitted high frequency radiation in super-Eddington AGN is smaller than assumed here, and its angular dependence\nmay be different too.\n\nWe find two indications that the above differences between the groups found here may be related\nto wrong or uncertain model assumptions. The emission line intensities, or line EWs of super-Eddington\nsources are not significantly different from those of sub-Eddington sources. This point was not\naddressed in detail in the present work, but is well known in earlier studies of large samples of NLS1,\nlike \\citet{Grupe2010}. In fact, various studies \\citep[e.g.][]{DuPu2015} show that the EW(H$\\beta$)\nin super-Eddington sources is somewhat smaller than in sub-Eddington AGN. Strong angular dependence of\nthe SED in a system with a flat BLR whose covering factor is small is one possible explanation.\nThe second is the finding that $L_{\\text{torus}}/L_{\\text{AGN}}$ (or, equivalently the torus covering\nfactor) is smaller in super-Eddington sources. However,\n$L_{\\text{torus}}/\\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ of the two groups is very similar. We find it hard\nto believe that the increase in $L_{\\text{AGN}}$ is exactly compensated for by a decrease in the\n(geometrical) covering factor of the torus. A more likely explanation is that the emitted\n$L_{\\text{Lyman}}$ radiation in SEAMBHs is either much weaker than\nassumed here, due to saturation, or strongly angle dependent -two possibilities that have been raised in earlier studies\n\\citep[e.g.][]{Wang2014a}. While we prefer the latter explanation, the very good agreement of\n$L_{\\text{torus}}/\\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ between the two groups suggest fine tuning that is hard to accept.\n\n\n\\section*{Acknowledgements}\n\n\n\nWe thank the anonymous referee for providing a positive and useful report which\nhas clarified our discussion and improved this paper.\nFunding for this work has been provided by a joint ISF-NSFC grant number 83/13. We are grateful to Du Pu for help with\nthe Lijiang data and to Brad Peterson for help with the AGN Watch data.\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{mnras}\n\\bibliography{references} \n\n\n\n\\appendix\n\n\\section{Thin AD Results}\nIn this Appendix, we present the results of our fitting thin AD models to all sources.\nTwo numbers are listed per source and parameter, corresponding\nto minimum ($a_{\\star}=-1.0$) and maximum ($a_{\\star}=0.998$) spin parameters.\nThe difference in efficiency between the two amount to about a factor $8.4$.\nFor each source, the best-fit SED is also shown in Figure~\\ref{figure.bfSED}.\n\n\\begin{landscape}\n\\begin{table}\n{\\renewcommand{\\arraystretch}{1.55}\n\\caption{{\\bf super-Eddington group:} Measured and deduced physical parameters modelling the intrinsic reddening {$E(B-V)$}{}\n    with a classical SMC extinction curve.  Two thin AD models are listed for each sources corresponding to maximum\n    ($a_{\\star}=0.998$) and minimum ($a_{\\star}$=-1) spin; the later correspond to the second row.}\\label{table.bfSED}\n\\vspace*{0.3cm}\n\\hspace*{-0.5cm}\n\\resizebox{1.05\\linewidth}{!}{\n\\begin{tabular}{l cr cc ccc ccrc cccccccccc}\\toprule\n & \\multicolumn{2}{c}{RM results} & \\multicolumn{2}{c}{Host Galaxy} & \\multicolumn{3}{c}{Power-Law model} & \\multicolumn{12}{c}{thin AD model} \\\\ \\cmidrule(r{.75em}l){2-3}\\cmidrule(r{.75em}l){4-5}\\cmidrule(r{.75em}l){6-8}\\cmidrule(r{.75em}l){9-20}\n    Object  &  $\\log M_{BH}$  &  $\\log \\dot{\\mathcal{M}}$  &  template  &  f$^{\\dagger}$  &  E(B-V)  &  ${\\beta_{UV}}^{\\ddagger}$  &  $\\chi^{2}_{\\nu}$  &  E(B-V)  &  $\\log M_{BH}$  &  $\\log \\dot{\\mathcal{M}}$  &  $\\chi^{2}_{\\nu}$  &  $\\log L_{\\text{AGN}}$  &  $L_{\\text{Lyman}}/L_{\\text{AGN}}$  &  $\\kappa_{5100{\\textup{\\AA}}{}}$  &  $\\kappa_{3000{\\textup{\\AA}}{}}$  &  $\\kappa_{1400{\\textup{\\AA}}{}}$  &  $\\langle h\\nu\\rangle$  &  $\\log L_{5100{\\textup{\\AA}}{}}$  &  $\\log L_{2500{\\textup{\\AA}}{}}$  &  $\\log L_{2keV}$  &  $\\log L_{5\\mu m}$  \\\\\n    & [{$M_{\\odot}$}] & & & & & & & & [{$M_{\\odot}$}] & & & [erg/s] & & & & & Ryd & erg/s & erg/s & erg/s & erg/s\n\\\\ \\midrule\n      Mrk142    & $6.47\\pm^{0.38}_{0.38}$& $2.10\\pm^{0.59}_{0.59}$ &  ssp\\_11Gyr\\_z05& $0.30$& $0.00$& $2.07\\pm0.19$& $0.998$& $0.09\\pm^{0.02}_{0.02}$& $6.78$& $2.10$& $0.174$& $46.60$& $0.99$& $907.54$& $259.02$& $63.26$& $14.30$& $43.64$& $44.31$&  & 43.61 \\\\\n      &&&&&&&&  $0.09\\pm^{0.01}_{0.02}$& $6.80$& $2.16$& $0.167$& $45.74$& $0.93$& $126.18$& $36.88$& $9.42$& $4.24$& $43.64$& $44.30$&  & 43.61 \\\\\n      Mrk335    & $6.93\\pm^{0.10}_{0.11}$& $1.39\\pm^{0.18}_{0.17}$ &  ssp\\_11Gyr\\_z05& $0.24$& $0.00$& $1.58\\pm0.34$& $0.050$& $0.07\\pm^{0.07}_{0.03}$& $7.42$& $0.52$& $0.054$& $45.71$& $0.93$& $64.26$& $30.54$& $12.30$& $5.34$& $43.90$& $44.29$& $43.31$& 43.96 \\\\\n      &&&&&&&&  $0.06\\pm^{0.07}_{0.03}$& $7.42$& $0.70$& $0.056$& $44.90$& $0.62$& $10.12$& $4.94$& $2.20$& $1.85$& $43.89$& $44.26$& $43.31$& 43.96 \\\\\n      Mrk382    & $6.50\\pm^{0.19}_{0.29}$& $1.20\\pm^{0.69}_{0.53}$ &  ssp\\_11Gyr\\_z02& $0.52$& $0.00$& $2.43\\pm0.20$& $0.979$& $0.01\\pm^{0.04}_{0.01}$& $6.80$& $0.84$& $0.794$& $45.41$& $0.97$& $174.46$& $66.43$& $23.83$& $8.04$& $43.17$& $43.65$& $42.84$& 43.22 \\\\\n      &&&&&&&&  $0.01\\pm^{0.04}_{0.01}$& $6.80$& $1.00$& $0.795$& $44.58$& $0.80$& $26.47$& $10.19$& $3.78$& $2.40$& $43.16$& $43.63$& $42.84$& 43.22 \\\\\n      Mrk486    & $7.24\\pm^{0.12}_{0.06}$& $0.67\\pm^{0.20}_{0.32}$ &  ssp\\_11Gyr\\_z05& $0.31$& $0.00$& $1.84\\pm0.42$& $0.246$& $0.07\\pm^{0.16}_{0.05}$& $7.74$& $-0.28$& $0.245$& $45.23$& $0.85$& $25.86$& $13.55$& $5.62$& $3.08$& $43.82$& $44.16$&  & 43.84 \\\\\n      &&&&&&&&  $0.04\\pm^{0.16}_{0.04}$& $7.74$& $-0.10$& $0.251$& $44.42$& $0.32$& $4.28$& $2.44$& $1.36$& $1.45$& $43.79$& $47.07$&  & 43.84 \\\\\n      Mrk493    & $6.14\\pm^{0.04}_{0.11}$& $2.06\\pm^{0.33}_{0.21}$ &  ssp\\_11Gyr\\_z05& $0.38$& $0.00$& $1.96\\pm0.12$& $1.946$& $0.10\\pm^{0.01}_{0.01}$& $6.64$& $2.06$& $0.191$& $46.41$& $0.99$& $24.49$& $287.00$& $67.10$& $14.64$& $45.02$& $44.09$&  & 43.61 \\\\\n      &&&&&&&&  $0.08\\pm^{0.01}_{0.01}$& $6.64$& $2.06$& $0.871$& $45.48$& $0.93$& $137.15$& $39.58$& $9.81$& $4.25$& $43.34$& $44.01$&  & 43.61 \\\\\n      Mrk1044   & $6.45\\pm^{0.12}_{0.13}$& $1.37\\pm^{0.40}_{0.41}$ &  ssp\\_11Gyr\\_z05& $0.43$& $0.00$& $2.14\\pm0.22$& $0.982$& $0.08\\pm^{0.02}_{0.06}$& $6.60$& $1.70$& $0.109$& $46.04$& $0.99$& $676.15$& $200.50$& $52.41$& $13.04$& $43.21$& $43.86$&  & 43.34 \\\\\n      &&&&&&&&  $0.07\\pm^{0.02}_{0.05}$& $6.64$& $1.66$& $0.118$& $45.08$& $0.90$& $76.80$& $24.01$& $6.87$& $3.35$& $43.19$& $43.81$&  & 43.34 \\\\\n      IRAS04416 & $6.78\\pm^{0.31}_{0.06}$& $2.76\\pm^{0.16}_{0.67}$ &  ssp\\_11Gyr\\_z02& $0.38$& $0.05$& $2.98\\pm0.09$& $1.946$& $0.07\\pm^{0.01}_{0.02}$& $7.28$& $2.54$& $1.331$& $47.55$& $0.99$& $872.42$& $254.02$& $66.27$& $14.39$& $44.61$& $45.27$&  & 44.74 \\\\\n      &&&&&&&&  $0.05\\pm^{0.01}_{0.01}$& $7.28$& $2.54$& $1.721$& $46.60$& $0.92$& $111.48$& $33.44$& $9.16$& $4.33$& $44.55$& $45.20$&  & 44.74 \\\\\n      IRASF12397& $6.79\\pm^{0.27}_{0.45}$& $2.94\\pm^{0.98}_{0.62}$ &  ssp\\_11Gyr\\_z05& $0.52$& $0.27$& $2.54\\pm0.35$& $1.020$& $0.35\\pm^{0.05}_{0.03}$& $6.84$& $2.38$& $0.139$& $46.92$& $0.99$& $211.56$& $333.89$& $75.88$& $15.37$& $44.59$& $44.51$& $43.23$& 43.82 \\\\\n      &&&&&&&&  $0.35\\pm^{0.06}_{0.03}$& $6.86$& $2.40$& $0.135$& $46.04$& $0.94$& $165.90$& $46.98$& $11.29$& $4.69$& $43.82$& $44.48$& $43.23$& 43.82 \\\\\n      J075101   & $7.16\\pm^{0.17}_{0.09}$& $1.57\\pm^{0.25}_{0.41}$ &  ssp\\_11Gyr\\_z02& $0.35$& $0.08$& $2.39\\pm0.19$& $1.990$& $0.12\\pm^{0.01}_{0.04}$& $7.24$& $1.92$& $0.118$& $46.92$& $0.98$& $399.02$& $130.52$& $41.19$& $11.50$& $44.32$& $44.87$&  & 44.29 \\\\\n      &&&&&&&&  $0.12\\pm^{0.01}_{0.03}$& $7.28$& $1.92$& $0.134$& $45.98$& $0.86$& $46.42$& $15.98$& $5.36$& $3.17$& $44.31$& $44.51$&  & 44.29 \\\\\n      J080101   & $6.78\\pm^{0.34}_{0.17}$& $2.51\\pm^{0.39}_{0.72}$ &  ssp\\_11Gyr\\_z05& $0.27$& $0.00$& $2.74\\pm0.43$& $0.131$& $0.10\\pm^{0.08}_{0.09}$& $7.26$& $2.06$& $0.152$& $47.08$& $0.98$& $468.74$& $149.35$& $45.45$& $12.11$& $44.40$& $45.01$&  & 44.51 \\\\\n      &&&&&&&&  $0.11\\pm^{0.06}_{0.09}$& $7.24$& $2.34$& $0.152$& $46.36$& $0.91$& $87.91$& $27.22$& $7.86$& $3.99$& $44.41$& $45.04$&  & 44.51 \\\\\n      J081441   & $6.97\\pm^{0.23}_{0.27}$& $1.66\\pm^{0.63}_{0.57}$ &  ssp\\_11Gyr\\_z02& $0.56$& $0.00$& $2.28\\pm0.24$& $1.331$& $0.05\\pm^{0.02}_{0.05}$& $7.00$& $2.10$& $0.159$& $46.84$& $0.99$& $688.69$& $205.30$& $55.06$& $13.42$& $44.00$& $44.65$&  & 44.02 \\\\\n      &&&&&&&&  $0.05\\pm^{0.02}_{0.05}$& $7.04$& $2.08$& $0.171$& $45.90$& $0.90$& $79.94$& $24.99$& $7.25$& $3.74$& $44.00$& $44.62$&  & 44.02 \\\\\n      J081456   & $7.44\\pm^{0.12}_{0.49}$& $0.85\\pm^{1.03}_{0.30}$ &  ssp\\_11Gyr\\_z02& $0.49$& $0.07$& $1.74\\pm0.26$& $1.977$& $0.14\\pm^{0.02}_{0.03}$& $7.28$& $1.50$& $0.196$& $46.55$& $0.97$& $220.18$& $80.63$& $28.91$& $9.34$& $44.20$& $44.73$&  & 44.06 \\\\\n      &&&&&&&&  $0.13\\pm^{0.01}_{0.03}$& $7.36$& $1.42$& $0.248$& $45.56$& $0.77$& $22.51$& $9.01$& $3.45$& $2.29$& $44.21$& $44.68$&  & 44.06 \\\\\n      J093922   & $6.53\\pm^{0.07}_{0.33}$& $2.65\\pm^{0.71}_{0.20}$ &  ssp\\_11Gyr\\_z02& $0.50$& $0.00$& $2.12\\pm0.20$& $0.414$& $0.06\\pm^{0.01}_{0.01}$& $6.80$& $2.76$& $1.843$& $47.19$& $0.99$& $67.99$& $537.70$& $106.64$& $17.04$& $45.36$& $44.63$& $43.28$& 44.47 \\\\\n      &&&&&&&&  $0.05\\pm^{0.01}_{0.00}$& $6.80$& $2.76$& $2.259$& $46.34$& $0.96$& $319.34$& $84.76$& $17.58$& $5.75$& $43.83$& $44.58$& $43.28$& 44.47 \\\\\n      PG0844    & $7.66\\pm^{0.15}_{0.23}$& $0.82\\pm^{0.57}_{0.42}$ &  ssp\\_11Gyr\\_z02& $0.22$& $0.00$& $1.45\\pm0.36$& $0.494$& $0.17\\pm^{0.15}_{0.08}$& $8.00$& $0.28$& $0.362$& $46.05$& $0.88$& $32.48$& $16.90$& $7.09$& $3.85$& $44.54$& $44.93$& $42.56$& 44.17 \\\\\n      &&&&&&&&  $0.16\\pm^{0.14}_{0.07}$& $7.98$& $0.50$& $0.365$& $45.26$& $0.42$& $5.49$& $3.01$& $1.54$& $1.55$& $44.52$& $44.88$& $42.56$& 44.17 \\\\\n      PG2130    & $7.05\\pm^{0.08}_{0.10}$& $1.75\\pm^{0.23}_{0.20}$ &  ssp\\_11Gyr\\_z02& $0.54$& $0.00$& $2.22\\pm0.26$& $0.715$& $0.03\\pm^{0.04}_{0.03}$& $7.32$& $1.48$& $0.237$& $46.57$& $0.97$& $204.56$& $76.13$& $27.75$& $9.11$& $44.26$& $44.75$& $43.23$& 44.62 \\\\\n      &&&&&&&&  $0.04\\pm^{0.03}_{0.04}$& $7.32$& $1.68$& $0.237$& $45.78$& $0.82$& $32.33$& $11.96$& $4.31$& $2.71$& $44.27$& $44.76$& $43.23$& 44.62 \\\\\n      Mrk110    & $7.10\\pm^{0.13}_{0.14}$& $0.85\\pm^{0.26}_{0.25}$ &  ssp\\_11Gyr\\_z05& $0.50$& $0.00$& $1.82\\pm0.25$& $0.048$& $0.04\\pm^{0.05}_{0.03}$& $7.60$& $0.26$& $0.039$& $45.63$& $0.91$& $43.75$& $22.07$& $9.03$& $4.36$& $43.99$& $44.35$& $43.63$& 43.76 \\\\\n      &&&&&&&&  $0.03\\pm^{0.04}_{0.03}$& $7.58$& $0.48$& $0.038$& $44.84$& $0.53$& $7.33$& $3.83$& $1.81$& $1.69$& $43.97$& $44.31$& $43.63$& 43.76 \\\\\n\\bottomrule\n\\addlinespace\n\\multicolumn{20}{l}{\\large $^{\\dagger}$ Host galaxy contribution to the observed flux at 5100\\AA{}.}\\\\\n\\multicolumn{20}{l}{\\large $^{\\ddagger}$ Optical to UV spectral slope defined such that $L_{\\lambda}\\propto \\lambda^{-\\beta_{UV}}$, $\\beta_{UV}=2-\\alpha_{UV}$\nand $L_{\\nu}\\propto \\nu^{-\\alpha_{UV}}$.}\\\\\n\\end{tabular}\n}}\n\\end{table}\n\\end{landscape}\n\n\n\\setcounter{table}{0}\n\\begin{landscape}\n\\begin{table}\n{\\renewcommand{\\arraystretch}{1.55}\n\\caption{{\\bf sub-Eddington group:} Measured and deduced physical parameters modelling the intrinsic reddening {$E(B-V)$}{}\n    with a classical SMC extinction curve.  Two thin AD models are listed for each sources corresponding to maximum ($a_{\\star}=0.998$)\n    and minimum ($a_{\\star}$=-1) spin; the later correspond to the second row. }\n\\vspace*{0.3cm}\n\\hspace*{-0.5cm}\n\\resizebox{1.05\\linewidth}{!}{\n\\begin{tabular}{l cr cc ccc ccrc cccccccccc}\\toprule\n & \\multicolumn{2}{c}{RM results} & \\multicolumn{2}{c}{Host Galaxy} & \\multicolumn{3}{c}{Power-Law model} & \\multicolumn{12}{c}{thin AD model} \\\\ \\cmidrule(r{.75em}l){2-3}\\cmidrule(r{.75em}l){4-5}\\cmidrule(r{.75em}l){6-8}\\cmidrule(r{.75em}l){9-20}\n    Object  &  $\\log M_{BH}$  &  $\\log \\dot{\\mathcal{M}}$  &  template  &  f$^{\\dagger}$  &  E(B-V)  &  ${\\beta_{UV}}^{\\ddagger}$  &  $\\chi^{2}_{\\nu}$  &  E(B-V)  &  $\\log M_{BH}$  &  $\\log \\dot{\\mathcal{M}}$  &  $\\chi^{2}_{\\nu}$  &  $\\log L_{\\text{AGN}}$  &  $L_{\\text{Lyman}}/L_{\\text{AGN}}$  &  $\\kappa_{5100{\\textup{\\AA}}{}}$  &  $\\kappa_{3000{\\textup{\\AA}}{}}$  &  $\\kappa_{1400{\\textup{\\AA}}{}}$  &  $\\langle h\\nu\\rangle$  &  $\\log L_{5100{\\textup{\\AA}}{}}$  &  $\\log L_{2500{\\textup{\\AA}}{}}$  &  $\\log L_{2keV}$  &  $\\log L_{5\\mu m}$  \\\\\n    & [{$M_{\\odot}$}] &  & & & & & & & [{$M_{\\odot}$}] &  & & [erg/s] & & & & & Ryd & erg/s & erg/s & erg/s & erg/s\n\\\\ \\midrule\n      Mrk79     & $7.84\\pm^{0.12}_{0.16}$& $-0.60\\pm^{0.25}_{0.21}$ &  ssp\\_11Gyr\\_z05& $0.24$& $0.00$& $1.56\\pm0.28$& $0.507$& $0.04\\pm^{0.03}_{0.02}$& $7.88$& $-1.06$& $0.549$& $44.59$& $0.72$& $13.42$& $7.20$& $3.15$& $2.20$& $43.46$& $43.79$& $42.39$& 43.86 \\\\\n      &&&&&&&&  $0.00\\pm^{0.03}_{0.00}$& $7.80$& $-0.74$& $0.612$& $43.84$& $0.14$& $2.75$& $1.70$& $1.26$& $1.29$& $43.40$& $43.62$& $42.39$& 43.86 \\\\\n      Mrk279    & $7.97\\pm^{0.09}_{0.12}$& $-0.86\\pm^{0.33}_{0.30}$ &  ssp\\_11Gyr\\_z02& $0.33$& $0.00$& $1.84\\pm0.37$& $0.324$& $0.02\\pm^{0.03}_{0.02}$& $7.92$& $-0.62$& $0.268$& $45.07$& $0.79$& $17.77$& $9.43$& $3.99$& $2.46$& $43.82$& $44.15$& $43.40$& 43.69 \\\\\n      &&&&&&&&  $0.00\\pm^{0.01}_{0.00}$& $7.80$& $-0.20$& $0.303$& $44.38$& $0.28$& $3.85$& $2.23$& $1.31$& $1.41$& $43.79$& $44.06$& $43.40$& 43.69 \\\\\n      Mrk290    & $7.55\\pm^{0.07}_{0.07}$& $-0.82\\pm^{0.23}_{0.23}$ &  ssp\\_11Gyr\\_z02& $0.28$& $0.00$& $1.94\\pm0.20$& $0.189$& $0.02\\pm^{0.02}_{0.02}$& $8.00$& $-1.14$& $0.079$& $44.63$& $0.69$& $11.68$& $6.31$& $2.81$& $2.08$& $43.56$& $43.89$& $42.85$& 43.58 \\\\\n      &&&&&&&&  $0.00\\pm^{0.01}_{0.00}$& $7.80$& $-0.56$& $0.146$& $44.02$& $0.18$& $3.07$& $1.85$& $1.26$& $1.33$& $43.53$& $43.79$& $42.85$& 43.58 \\\\\n      Mrk509    & $8.15\\pm^{0.03}_{0.03}$& $-0.50\\pm^{0.13}_{0.14}$ &  ssp\\_11Gyr\\_z02& $0.35$& $0.00$& $2.12\\pm0.26$& $0.350$& $0.01\\pm^{0.02}_{0.01}$& $7.96$& $0.20$& $0.200$& $45.93$& $0.88$& $31.49$& $16.39$& $6.86$& $3.74$& $44.43$& $44.77$&  & 44.36 \\\\\n      &&&&&&&&  $0.00\\pm^{0.01}_{0.00}$& $8.24$& $-0.08$& $0.383$& $44.94$& $0.19$& $3.14$& $1.89$& $1.26$& $1.33$& $44.44$& $44.69$&  & 44.36 \\\\\n      Mrk590    & $7.55\\pm^{0.07}_{0.08}$& $-0.28\\pm^{0.36}_{0.36}$ &  ssp\\_11Gyr\\_z05& $0.62$& $0.00$& $2.02\\pm4.65$& $1.452$& $0.07\\pm^{0.01}_{0.01}$& $7.80$& $-1.12$& $4.553$& $44.45$& $0.73$& $13.61$& $7.30$& $3.19$& $2.22$& $43.32$& $43.59$& $42.65$& 43.39 \\\\\n      &&&&&&&&  $0.00\\pm^{0.00}_{0.00}$& $7.80$& $-1.12$& $2.445$& $43.46$& $0.07$& $2.22$& $1.46$& $1.37$& $1.23$& $43.11$& $43.27$& $42.65$& 43.39 \\\\\n      Mrk817    & $7.99\\pm^{0.14}_{0.14}$& $-0.88\\pm^{0.22}_{0.22}$ &  ssp\\_11Gyr\\_z05& $0.41$& $0.00$& $2.16\\pm0.22$& $0.757$& $0.00\\pm^{0.02}_{0.00}$& $8.10$& $-0.98$& $0.452$& $44.89$& $0.70$& $12.17$& $6.55$& $2.90$& $2.11$& $43.80$& $44.12$& $43.19$& 44.14 \\\\\n      &&&&&&&&  $0.00\\pm^{0.00}_{0.00}$& $7.84$& $-0.22$& $2.192$& $44.40$& $0.26$& $3.70$& $2.16$& $1.30$& $1.39$& $43.83$& $44.12$& $43.19$& 44.14 \\\\\n      Mrk1511   & $7.29\\pm^{0.07}_{0.07}$& $-0.35\\pm^{0.24}_{0.24}$ &  ssp\\_11Gyr\\_z05& $0.44$& $0.00$& $2.48\\pm0.19$& $1.832$& $0.00\\pm^{0.01}_{0.00}$& $7.00$& $0.36$& $1.544$& $45.13$& $0.94$& $82.35$& $37.08$& $14.51$& $5.72$& $43.21$& $43.64$& $42.84$& 43.48 \\\\\n      &&&&&&&&  $0.00\\pm^{0.00}_{0.00}$& $7.10$& $0.34$& $1.855$& $44.22$& $0.61$& $9.77$& $4.80$& $2.15$& $1.83$& $43.23$& $43.64$& $42.84$& 43.48 \\\\\n      NGC5548   & $8.10\\pm^{0.16}_{0.16}$& $-1.66\\pm^{0.33}_{0.33}$ &  ssp\\_11Gyr\\_z05& $0.34$& $0.00$& $1.57\\pm0.47$& $0.057$& $0.08\\pm^{0.04}_{0.02}$& $7.80$& $-0.80$& $0.030$& $44.77$& $0.78$& $17.03$& $9.05$& $3.84$& $2.41$& $43.54$& $43.88$& $42.53$& 43.55 \\\\\n      &&&&&&&&  $0.01\\pm^{0.07}_{0.01}$& $7.92$& $-0.90$& $0.014$& $43.80$& $0.09$& $2.34$& $1.52$& $1.32$& $1.25$& $43.43$& $43.62$& $42.53$& 43.55 \\\\\n      NGC7469   & $6.92\\pm^{0.84}_{0.84}$& $0.84\\pm^{1.31}_{1.35}$ &  ssp\\_11Gyr\\_z02& $0.70$& $0.00$& $1.90\\pm0.28$& $0.167$& $0.05\\pm^{0.11}_{0.04}$& $7.30$& $0.36$& $0.025$& $45.43$& $0.93$& $61.84$& $29.54$& $11.84$& $5.11$& $43.64$& $44.02$& $40.64$& 43.86 \\\\\n      &&&&&&&&  $0.04\\pm^{0.10}_{0.04}$& $7.30$& $0.54$& $0.024$& $44.62$& $0.61$& $9.77$& $4.80$& $2.15$& $1.83$& $43.63$& $43.99$& $40.64$& 43.86 \\\\\n      PG1229    & $8.03\\pm^{0.24}_{0.23}$& $-1.04\\pm^{0.52}_{0.55}$ &  ssp\\_11Gyr\\_z02& $0.40$& $0.00$& $2.60\\pm0.16$& $0.710$& $0.00\\pm^{0.00}_{0.00}$& $7.80$& $-0.38$& $1.815$& $45.19$& $0.83$& $23.01$& $12.11$& $5.05$& $2.86$& $43.83$& $44.23$& $43.43$& 44.09 \\\\\n      &&&&&&&&  $0.00\\pm^{0.00}_{0.00}$& $8.00$& $-0.50$& $5.231$& $44.28$& $0.15$& $2.82$& $1.73$& $1.26$& $1.30$& $43.83$& $44.23$& $43.43$& 44.09 \\\\\n      PG1617    & $8.79\\pm^{0.15}_{0.28}$& $-1.51\\pm^{0.58}_{0.33}$ &  ssp\\_11Gyr\\_z02& $0.33$& $0.00$& $2.41\\pm0.17$& $1.236$& $0.00\\pm^{0.00}_{0.00}$& $8.40$& $-0.62$& $1.588$& $45.55$& $0.71$& $12.68$& $6.81$& $2.98$& $2.12$& $44.45$& $44.77$&  & 44.63 \\\\\n      &&&&&&&&  $0.00\\pm^{0.00}_{0.00}$& $8.70$& $-0.92$& $17.081$& $44.56$& $0.01$& $1.58$& $1.26$& $2.28$& $1.15$& $44.36$& $44.42$&  & 44.63 \\\\\n      Fairall9  & $8.09\\pm^{0.07}_{0.12}$& $-0.70\\pm^{0.31}_{0.21}$ &  ssp\\_11Gyr\\_z02& $0.32$& $0.00$& $2.14\\pm0.43$& $0.020$& $0.01\\pm^{0.05}_{0.01}$& $7.98$& $-0.10$& $0.006$& $45.65$& $0.84$& $24.79$& $13.03$& $5.46$& $3.16$& $44.25$& $44.60$& $43.63$& 44.57 \\\\\n      &&&&&&&&  $0.00\\pm^{0.02}_{0.00}$& $8.24$& $-0.32$& $0.161$& $44.70$& $0.14$& $2.72$& $1.69$& $1.26$& $1.29$& $44.26$& $44.56$& $43.63$& 44.57 \\\\\n      MCG+06    & $6.92\\pm^{0.14}_{0.12}$& $-0.35\\pm^{0.37}_{0.45}$ &  ssp\\_11Gyr\\_z05& $0.51$& $0.00$& $2.54\\pm0.24$& $1.676$& $0.00\\pm^{0.01}_{0.00}$& $6.60$& $0.48$& $0.899$& $44.85$& $0.96$& $144.10$& $57.10$& $20.89$& $7.13$& $42.69$& $43.13$&  & 43.12 \\\\\n      &&&&&&&&  $0.00\\pm^{0.01}_{0.00}$& $6.74$& $0.34$& $1.306$& $43.86$& $0.69$& $13.74$& $6.23$& $2.63$& $2.02$& $42.72$& $43.13$&  & 43.12 \\\\\n\\bottomrule\n\n\\addlinespace\n\\multicolumn{20}{l}{\\large $^{\\dagger}$ Host galaxy contribution to the observed flux at 5100\\AA{}.}\\\\\n\\multicolumn{20}{l}{\\large $^{\\ddagger}$ Optical to UV spectral slope defined such that $L_{\\lambda}\\propto \\lambda^{-\\beta_{UV}}$,  $\\beta_{UV}=2-\\alpha_{UV}$\nand $L_{\\nu}\\propto \\nu^{-\\alpha_{UV}}$.}\\\\\n\\end{tabular}\n}}\n\\end{table}\n\\end{landscape}\n\n\n\n\\setcounter{figure}{0}\n\\begin{figure*}\n    \\centering\n\\includegraphics[width=0.33\\linewidth]{Mrk142_ssp_11Gyr_z05_spin0p998_EBmV_0p091.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk335_ssp_11Gyr_z05_spin0p998_EBmV_0p066.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk382_ssp_11Gyr_z02_spin0p998_EBmV_0p015.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{Mrk486_ssp_11Gyr_z05_spin0p998_EBmV_0p066.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk493_ssp_11Gyr_z05_spin0p998_EBmV_0p099.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk1044_ssp_11Gyr_z05_spin0p998_EBmV_0p080.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{IRAS04416_ssp_11Gyr_z02_spin0p998_EBmV_0p069.pdf}\n\\includegraphics[width=0.33\\linewidth]{IRASF12397_ssp_11Gyr_z05_spin0p998_EBmV_0p354.pdf}\n\\includegraphics[width=0.33\\linewidth]{J075101_ssp_11Gyr_z02_spin0p998_EBmV_0p124.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{J080101_ssp_11Gyr_z05_spin0p998_EBmV_0p099.pdf}\n\\includegraphics[width=0.33\\linewidth]{J081441_ssp_11Gyr_z02_spin0p998_EBmV_0p055.pdf}\n\\includegraphics[width=0.33\\linewidth]{J081456_ssp_11Gyr_z02_spin0p998_EBmV_0p139.pdf}\\\\\n\\caption{Intrinsic optical-to-UV SED with the best-fit thin AD model over-plotted assuming\n$a_{\\star}=0.998$ (red-dotted curves). The SED is corrected for Galactic\nextinction, host-galaxy emission and corrected for intrinsic reddening which\nwas modelled with a classical SMC extinction curve. The order of the objects is the same as in\nTable~\\ref{table.bfSED}. Red empty circles represent the continuum regions used for fitting\nthe models to the spectra, and the full points show the available photometric data points:\nGALEX FUV 1551\\AA{}, OM UVW2 2120\\AA{}, GALEX NUV 2306\\AA{}, OM UVM2 2310\\AA{}, OM UVW1 2910\\AA{},\nOM U 3440\\AA{}, OM B 4500\\AA{},  OM V 5430\\AA{}. }\\label{figure.bfSED}\n\\end{figure*}\n\n\\begin{figure*}\n\\includegraphics[width=0.33\\linewidth]{J093922_ssp_11Gyr_z02_spin0p998_EBmV_0p058.pdf}\n\\includegraphics[width=0.33\\linewidth]{PG0844_ssp_11Gyr_z02_spin0p998_EBmV_0p172.pdf}\n\\includegraphics[width=0.33\\linewidth]{PG2130_ssp_11Gyr_z02_spin0p998_EBmV_0p033.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{Mrk110_ssp_11Gyr_z05_spin0p998_EBmV_0p044.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk79_ssp_11Gyr_z05_spin0p998_EBmV_0p044.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk279_ssp_11Gyr_z02_spin0p998_EBmV_0p022.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{Mrk290_ssp_11Gyr_z02_spin0p998_EBmV_0p022.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk509_ssp_11Gyr_z02_spin0p998_EBmV_0p015.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk590_ssp_11Gyr_z05_spin0p998_EBmV_0p069.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{Mrk817_ssp_11Gyr_z05_spin0p998_EBmV_0p000.pdf}\n\\includegraphics[width=0.33\\linewidth]{Mrk1511_ssp_11Gyr_z05_spin0p998_EBmV_0p000.pdf}\n\\includegraphics[width=0.33\\linewidth]{NGC5548_ssp_11Gyr_z05_spin0p998_EBmV_0p077.pdf}\\\\\n\\includegraphics[width=0.33\\linewidth]{NGC7469_ssp_11Gyr_z02_spin0p998_EBmV_0p047.pdf}\n\\includegraphics[width=0.33\\linewidth]{PG1229_ssp_11Gyr_z02_spin0p998_EBmV_0p000.pdf}\n\\includegraphics[width=0.33\\linewidth]{PG1617_ssp_11Gyr_z02_spin0p998_EBmV_0p000.pdf}\\\\\n\\caption*{continue \\dots}\n\\end{figure*}\n\n\\begin{figure*}\n\\includegraphics[width=0.33\\linewidth]{Fairall9_ssp_11Gyr_z02_spin0p998_EBmV_0p011.pdf}\n\\includegraphics[width=0.33\\linewidth]{MCG+06_ssp_11Gyr_z05_spin0p998_EBmV_0p000.pdf}\n\\caption*{continue}\n\\end{figure*}\n\n\n\n\\section{Notes on individual objects}\n\\label{appendix.Notes}\nAdditional information regarding available data. Table~\\ref{table.bfSEDcomparison} show the best-fit thin\nAD model for those sources with more than one possible dataset.\n\n\n\\begin{table*}\n\\caption{Measured and deduced physical parameters}\\label{table.bfSEDcomparison}\n\\label{table.bfSED2}\n\\resizebox{1.0\\textwidth}{!}{\n\\begin{tabular}{llccccccccccl}\\toprule\n& \\multicolumn{2}{c}{Host Galaxy} && \\multicolumn{9}{c}{\\sc thin AD model} \\\\ \\cmidrule(r{.75em}l){2-3}\\cmidrule(r{.75em}l){5-12}\nObject & template & f && $A_{V}$ & $\\log{M_{BH}}$ & $\\log{\\dot{M}}$ & spin & $\\eta$ & $L_{\\text{AGN}}$ &  $\\dot{m}$ & $\\chi^{2}_{\\nu}$ & Dataset \\\\\n    &    &   &&     &$[M_{\\odot}]$& [$M_{\\odot}$/yr] & &   & $10^{44}$erg/s &\\\\ \\midrule\n    Mrk335  & ssp\\_11Gyr\\_z05 & 0.24 &  & $0.15^{+0.07}_{-0.02}$ & 7.30 & -0.85 & -1.000 & 0.038 & 3.04  & 0.27 & 0.556 & GALEX+spec \\\\\n            & ssp\\_11Gyr\\_z05 & 0.24 &  & $0.22^{+0.45}_{-0.22}$ & 7.40 & -0.80 &  0.600 & 0.091 & 8.17  & 0.24 & 0.044 & OM (2000)  \\\\\n            & ssp\\_11Gyr\\_z05 & 0.24 &  & $0.34^{+0.41}_{-0.20}$ & 7.40 & -0.65 & -0.200 & 0.052 & 6.59  & 0.34 & 0.014 & OM (2007)  \\\\\n            & ssp\\_11Gyr\\_z05 & 0.24 &  & $0.37^{+0.28}_{-0.14}$ & 7.40 & -0.75 & -0.200 & 0.052 & 5.24  & 0.27 & 0.121 & OM (2009)  \\\\\n IRASF12397 & ssp\\_11Gyr\\_z05 & 0.52 &  & $1.63^{+0.26}_{-0.13}$ & 7.11 &  0.04 & -0.200 & 0.052 & 32.37 & 3.25 & 0.189 & GALEX+spec \\\\\n            & ssp\\_11Gyr\\_z05 & 0.52 &  & $1.89^{+0.00}_{-0.12}$ & 7.28 &  0.04 &  0.000 & 0.057 & 35.49 & 2.22 & 1.698 & OM (2005)  \\\\\n    Mrk279  & ssp\\_11Gyr\\_z02 & 0.33 &  & $0.06^{+0.17}_{-0.06}$ & 7.90 & -1.60 &  0.998 & 0.321 & 4.57  & 0.01 & 0.337 & GALEX+OM   \\\\\n            & ssp\\_11Gyr\\_z02 & 0.33 &  & $0.00^{+0.33}_{-0.00}$ & 8.40 & -1.65 &  0.998 & 0.321 & 4.07  & 0.00 & 0.277 & spec       \\\\\n    Mrk509  & ssp\\_11Gyr\\_z02 & 0.35 &  & $0.03^{+0.06}_{-0.03}$ & 7.70 & -0.85 &  0.998 & 0.321 & 25.69 & 0.11 & 0.123 & GALEX+spec \\\\\n            & ssp\\_11Gyr\\_z02 & 0.35 &  & $0.21^{+0.11}_{-0.21}$ & 7.90 & -0.45 &  0.998 & 0.321 & 64.52 & 0.17 & 0.035 & OM (2009)  \\\\\n    NGC5548 & ssp\\_11Gyr\\_z05 & 0.34 &  & $0.25^{+0.12}_{-0.25}$ & 8.00 & -2.70 &  0.998 & 0.321 & 0.36  & 0.00 & 1.324 & GALEX+spec \\\\\n            & ssp\\_11Gyr\\_z05 & 0.34 &  & $0.44^{+0.34}_{-0.44}$ & 8.50 & -2.20 &  0.998 & 0.321 & 1.15  & 0.00 & 0.070 & OM (2013)  \\\\\n    NGC7469 & ssp\\_11Gyr\\_z02 & 0.70 &  & $0.14^{+0.43}_{-0.14}$ & 7.10 & -1.05 &  0.600 & 0.091 & 4.59  & 0.27 & 0.389 & GALEX+spec \\\\\n            & ssp\\_11Gyr\\_z02 & 0.70 &  & $0.34^{+0.28}_{-0.25}$ & 7.70 & -1.30 &  0.600 & 0.091 & 2.58  & 0.04 & 0.092 & OM (2009)  \\\\\n\\bottomrule\n\\end{tabular}\n}\n\\end{table*}\n\n\n\n\\label{IndividualNotes}\n\\subsubsection*{Mrk~335}\nMrk~335 was observed three times by the OM aboard of the {\\it XMM-Newton} which allow us to fit three independent and simultaneous datasets\nand compare it with the non-simultaneous SED form by the mean optical spectrum and the GALEX photometry. The simultaneous datasets show\nvariability at a level of 20\\% over a 9 year period. The best-fit thin AD model results achieved with the non-simultaneous SED are firmly\nconsistent with the shapes of the simultaneous SED and both contemporaneous and non-contemporaneous SED shapes claim for\na considerable amount of intrinsic extinction in order to ensure satisfactory fit ($A_V=0.37-0.15$).\nThe contemporaneous SED datasets show larger $A_V$ values.\n\n\\subsubsection*{IRAS~F12397+3333}\nIRAS~F12397+3333 is an IR luminous source and as such shows \\emph{redder} optical SED compared with most AGN, including those in the sample.\nBoth simultaneous and non-simultaneous SED fit results show that a satisfactory fit will not be reached unless a significant dust attenuation is assumed.\nThe hypothesis of notable intrinsic reddening is supported by polarization measurements, as well as by a steep Balmer Decrement \\citep{Grupe1998,DuPu2015}.\n\n\\subsubsection*{J093922}\nThe good agreement between the near-UV GALEX flux with the OM photometric point (temporally separated by $\\sim$1 year) allow us to use both in\nconjunction with the optical spectrum and assume that it is the most convenient approach to model the optical/UV underlying continuum.\n\n\\subsubsection*{PG~2130}\nThe good agreement between the near-UV GALEX flux with the two OM photometric points (UVW2, UVM2) and the low statistics of the simultaneous dataset\nlead us to believe that a non-simultaneous dataset is the best procedure to study the optical/UV emission. The simultaneous SED shape, which consist of only four\nphotometric points, is consistent to that found by fitting this non-contemporaneous dataset.\n\n\\subsubsection*{PG~0844}\nPG~0844 is the only source where the optical/UV broadband SED could not be modelled by thin AD spectrum.\nThe inconsistent on the time-lag measurements from line-to-line \\citep[see][]{Peterson1999} as well as the residuals on the\nBalmer narrow-emission lines in this object turns the reverberation mapping results to be of rather low quality. Thus, the\n{H$\\beta$}{} BLR size measurement is considered unreliable and does not enable us to find a satisfactory fit to the optical/UV\nOM photometric points. We believe that the unreliable time-lag measurements enable to find an accurate black hole mass measurements.\n\n\n\\subsubsection*{Mrk~110}\nThe optical spectrum was taken in the lowest flux state, whilst both GALEX and XMM-Newton observed Mrk~110\nin higher flux states. The optical observations show variability of a factor $\\sim$10 over\na 3 year period. Therefore the simultaneous SED composed by six OM photometric points is the only possible dataset.\nAlthough the GALEX photometry was not fitted they are in good agreement with the contemporaneous\noptical/UV SED shape.\n\n\\subsubsection*{Mrk~79}\nThe optical spectrum was taken in the lowest flux state, whilst both GALEX and XMM-Newton observed Mrk~79\nin a higher flux states. The narrower spectral window of Mrk~79 and the large observed variability between the mean optical\nspectrum and the photometry rules out the spectrum.\nTaking advantage of the good agreement between the near-UV GALEX flux and the OM photometry, a non-simultaneous dataset\nis probably the best SED to study the accretion disc emission. Indeed, the low number of simultaneous photometric points\ndoes not allow to construct a contemporaneous dataset.\n\n\\subsubsection*{Mrk~279}\nThe OM photometric flux at the effective wavelength 3444\\AA{} seems to be in a lower flux state when it is compared with the\noptical spectrum. This 20\\% of variability between both spectrum and OM photometry prevent to join both datasets. Two non-simultaneous\nSED were constructed: on the one hand, GALEX in conjunction with the simultaneous OM photometric band; on the other, a fit over the\nsingle optical spectrum adding another two line-free points. The fitting results of both datasets are in good agreement and no intrinsic\nreddening was necessary to get a satisfactory thin AD fit.\n\n\\subsubsection*{Mrk~509}\nThere is a variability of a factor $\\sim$2 between simultaneous OM observations over a 9 year period. From the OM observations, we can see\nhow both optical spectrum and GALEX photometry seem to follow the lowest flux state rather than a higher one. In addition to the\ncontemporaneous data set given by the OM observation in the 2009, we also fitted a non-simultaneous dataset which consists of the\nGALEX photometric data in conjunction with the optical spectrum. The fitting results show that for the simultaneous SED fit the intrinsic\nreddening is higher than that claimed for the non-simultaneous fit.\n\n\\subsubsection*{NGC~5548}\nThere is a variability of a factor $\\sim$4 between the OM photometric point at the effective wavelength 5430\\AA{} and the optical spectrum.\nThe non-simultaneous dataset (GALEX plus the optical spectrum) was also fitted in order to be compared with the contemporaneous SED given\nby the OM dataset. Both constructed SED are in good agreement and the best fit in both demand for some dust attenuation.\n\n\\subsubsection*{Fairall 9}\nAs has been seen in previous works, the OM observations manifest variability of a factor $\\sim$2.5 at the effective wavelength 2910\\AA{}.\nWe decline to the simultaneous SED due to the poor statistic of the contemporaneous OM dataset. The good agreement between the\nhighest OM flux state with the GALEX data makes the non-simultaneous SED the best data to perform our study.\n\n\\subsubsection*{NGC~7469}\nThe contemporaneous photometric points are in good agreement with both the GALEX data and the optical spectrum. The simultaneous SED fit is\nin good agreement with the non-simultaneous dataset and also require a similar dust extinction correction, being both fits highly\nconsistent.\n\n\\subsubsection*{Mrk~382, J093922, Mrk~290, Mrk~1511, PG~1229}\nThe good agreement between the near-UV GALEX flux with the OM photometric point allow us to use both in\nconjunction with the optical spectrum as the most convenient approach to model the optical/UV underlying continuum.\n\n\\subsubsection*{Mrk~590}\nNote that there is a real disagreement between the OM photometry and the optical spectrum. We decide\nnot to use the OM photometry.\n\n\n\\bsp    \n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 61262, "prevtext": "\nwith $b(\\nu)=2$, $f_0 = 1.2\\times10^{30}$~erg/s/Hz, and $\\cos{\\theta}=0.75$ for all sources. The remaining parameters are the BH spin\nand intrinsic reddening. We experimented with the full range of spin parameters, from -1 to 0.998. Because of the fitted range of wavelengths,\nwhich is far from the frequency of maximum disc temperature, there is very little difference between different spin value. We therefore show, for\neach source only two values, $a_{\\star}=-1$ and $a_{\\star}=0.998$.\n\n\nThe fitting procedure includes the comparison of the observed SED with various combinations of disc SEDs covering the range of mass,\naccretion rate, and the two chosen spins and assumed reddening. The reddening is taken into account by changing $E(B-V)$ in steps\nof 0.004 mag, calculating, for each value, a new mass accretion rate and its range of uncertainty. A simple $\\chi^{2}$ procedure was used\nto find the best-fit combination of reddening and thin AD models. We use at least three line-free windows covering the optical\nspectroscopic data, and all the available photometric data. The line-free windows are centred on 4205\\AA{}, 5100\\AA{} and 6855\\AA{},\nwith widths\nranging from 10 to 30\\AA{}. For those objects with no photometric data, three additional line-free continuum windows were used: 5620\\AA{}, 6205\\AA{}\nand 6860\\AA{}. For the error on each continuum point, we combine the standard error from the Poison noise, an assumed 5\\% error on the flux calibration,\nand the relative error of 20\\%  on the combination of the uncertainties on the host-galaxy contribution and the unknown stellar population.\nTo allow for the large elapsed time between the GALEX and the optical observations, which increases the uncertainty due to source variability,\nwe added an uncertainty of 20\\% to the GALEX fluxes. Note that this is not meant to take into account the real variations between epoch since this is\ndealt with, in our special method described in Section~\\ref{OC.Variability} where we provide more information about the way we used\nthe best SED that avoids, as much as possible, the variability issue. We refer the reader to Appendix~\\ref{IndividualNotes} for a detailed\ndescription of the fitting results for individual sources.\n\n\n\\section{Results}\n\\label{Results}\n\nThe samples described here were selected from the RM AGN sample with high accretion rate,\n$\\mathcal{\\dot{M}}\\geq3$ (super-Eddington) and with sub-Eddington accretion rate\n$\\mathcal{\\dot{M}}<3$. In the following we use the normalized Eddington ratio,\n$\\dot{m}=\\eta\\dot{\\mathcal{M}}$, which allow an easy comparison with previous works.\nWhile not all data are of the same quality, we were able to secure photometric and spectroscopic\ndata that cover the 0.2-20$\\,\\mu$m range for all sources. For 8 sources\n(4 sub-Eddington and 4 super-Eddington) we have both simultaneous and non-simultaneous\noptical/UV photometry. In the following discussions we do not distinguish between simultaneous\nand non-simultaneous SEDs.\n\nOur best fitted disc SEDs are shown in Figure~\\ref{figure.bfSED} and all the model parameters,\nincluding the virialized {$M_{BH}$}{} and {$\\dot{M}$}{}, are listed in Table~\\ref{table.bfSED}.\nTwo models are listed per source, corresponding to the minimum and maximum\nspin parameter. The error bars on the intrinsic reddening enclose the 68\\% confidence range.\nFinally, the average spectral properties for both groups and for the entire sample are summarized\nin Table~\\ref{table.statisitcs}. In the following plots, for every derived thin AD model\nparameter we display the mean between the higher and lower values corresponding to the minimum\nand maximum spin, and the uncertainly which represents the range of possible values.\n\n\n\n\\begin{table*}\n{\\renewcommand{\\arraystretch}{1.3}\n\\caption{Median Parameters for super-Eddington (13), sub-Eddington (16) AGN and the entire sample (29).\n The uncertainties reflect the 16$^{th}$ and 84$^{th}$ percentiles.\n When saturation (Eqn.~\\ref{eq.saturation}) is taken into account the parameter is tagged with the term $_{sat}$.\n Two numbers are listed for each thin AD model corresponding to the minimum and the\n maximum spin. The unabsorbed luminosity at 2$\\,$keV is given by the best-fit\n power law over the hard X-ray band (2-10$\\,$keV).\\label{table.statisitcs}}\n\\begin{tabular}{lrrrrrr}\\toprule\n        {\\sc parameter} & \\multicolumn{2}{c}{super-Eddington} &  \\multicolumn{2}{c}{sub-Eddington} & \\multicolumn{2}{c}{all} \\\\\n        & $a_{\\star}=0.998$ & $a_{\\star}=-1$ & $a_{\\star}=0.998$ & $a_{\\star}=-1$ & $a_{\\star}=0.998$ & $a_{\\star}=-1$ \\\\\n    \\midrule\n    \\multicolumn{7}{l}{reverberation-mapped resutls}\\\\\n    $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$  & $44.00^{+0.23}_{-0.69}$  & $44.00^{+0.23}_{-0.69}$  & $43.68^{+0.32}_{-0.51}$  & $43.68^{+0.32}_{-0.51}$  & $43.71^{+0.50}_{-0.55}$  & $43.71^{+0.50}_{-0.55}$ \\\\\n    $z$  & $0.054^{+0.078}_{-0.022}$ & $0.054^{+0.078}_{-0.022}$ & $0.031^{+0.017}_{-0.009}$ & $0.031^{+0.017}_{-0.009}$ & $0.035^{+0.081}_{-0.009}$ & $0.035^{+0.081}_{-0.009}$\\\\\n    $\\log M_{BH}$  & $6.86^{+0.35}_{-0.38}$  & $6.86^{+0.35}_{-0.38}$  & $7.97^{+0.13}_{-0.71}$  & $7.97^{+0.13}_{-0.71}$  & $7.16^{+0.85}_{-0.51}$  & $7.16^{+0.85}_{-0.51}$ \\\\\n    $\\log\\dot{\\mathcal{M}}$  & $1.61^{+0.98}_{-0.77}$  & $1.60^{+0.98}_{-0.77}$  & $-0.70^{+0.35}_{-0.38}$  & $-0.72^{+0.37}_{-0.36}$  & $0.84^{+1.24}_{-1.68}$  & $0.83^{+1.23}_{-1.69}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{power-law modelling}\\\\\n    $\\beta_{UV}$  & $2.13^{+0.37}_{-0.36}$  & $2.13^{+0.37}_{-0.36}$  & $2.12^{+0.36}_{-0.30}$  & $2.12^{+0.36}_{-0.30}$  & $2.12^{+0.39}_{-0.34}$  & $2.12^{+0.39}_{-0.34}$ \\\\\n    $E(B-V)$ /PL/  & $0.00^{+0.06}_{-0.00}$  & $0.00^{+0.06}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$  & $0.00^{+0.00}_{-0.00}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{thin AD modelling}\\\\\n    $E(B-V)$  & $0.07^{+0.06}_{-0.03}$  & $0.06^{+0.06}_{-0.02}$  & $0.01^{+0.03}_{-0.01}$  & $0.00^{+0.00}_{-0.00}$  & $0.05^{+0.04}_{-0.05}$  & $0.04^{+0.06}_{-0.04}$ \\\\\n    $\\log M_{BH}$  & $7.25^{+0.28}_{-0.46}$  & $7.26^{+0.26}_{-0.46}$  & $7.88^{+0.13}_{-0.60}$  & $7.80^{+0.44}_{-0.52}$  & $7.32^{+0.65}_{-0.52}$  & $7.36^{+0.59}_{-0.56}$ \\\\\n    $\\log\\dot{\\mathcal{M}}$  & $1.81^{+0.46}_{-1.43}$  & $1.80^{+0.58}_{-1.22}$  & $-0.62^{+0.98}_{-0.44}$  & $-0.32^{+0.66}_{-0.58}$  & $0.36^{+1.72}_{-1.07}$  & $0.50^{+1.62}_{-1.03}$ \\\\\n    $\\log L_{\\text{Lyman}}$  & $46.55^{+0.46}_{-0.92}$  & $45.57^{+0.62}_{-0.96}$  & $44.96^{+0.45}_{-0.50}$  & $43.70^{+0.32}_{-0.96}$  & $45.59^{+1.29}_{-0.81}$  & $44.48^{+1.40}_{-1.11}$ \\\\\n    $\\log L_{\\text{Lyman,sat}}$  & $45.84^{+0.19}_{-0.39}$  & $45.78^{+0.29}_{-1.17}$  & $44.96^{+0.45}_{-0.50}$  & $43.70^{+0.32}_{-0.96}$  & $45.52^{+0.37}_{-0.74}$  & $44.48^{+1.43}_{-1.11}$ \\\\\n    $\\langle h\\nu \\rangle$  & $11.8^{+2.7}_{-7.0}$  & $3.2^{+1.0}_{-1.5}$  & $2.4^{+2.7}_{-0.3}$  & $1.3^{+0.5}_{-0.1}$  & $5.3^{+8.5}_{-3.0}$  & $1.8^{+2.3}_{-0.5}$ \\\\\n    $\\kappa_{5100{\\textup{\\AA}}{}}$  & $208^{+475}_{-171}$  & $61^{+71}_{-53}$  & $17^{+45}_{-5}$  & $3^{+7}_{-1}$  & $62^{+373}_{-46}$  & $10^{+90}_{-7}$ \\\\\n    $\\kappa_{5100{\\textup{\\AA}}{},sat}$  & $53^{+51}_{-32}$  & $65^{+61}_{-57}$  & $18^{+46}_{-5}$  & $3^{+7}_{-1}$  & $32^{+51}_{-19}$  & $10^{+95}_{-7}$ \\\\\n    $\\log \\lambda L_{\\lambda}(5100{\\textup{\\AA}}{})$ (erg/s)  & $44.23^{+0.37}_{-0.52}$  & $43.93^{+0.44}_{-0.47}$  & $43.64^{+0.63}_{-0.33}$  & $43.63^{+0.64}_{-0.41}$  & $43.90^{+0.59}_{-0.51}$  & $43.83^{+0.51}_{-0.55}$ \\\\\n    $\\log \\lambda L_{\\lambda}(2500{\\textup{\\AA}}{})$  (erg/s)  & $44.51^{+0.24}_{-0.25}$  & $44.48^{+0.28}_{-0.25}$  & $43.95^{+0.24}_{-0.25}$  & $43.89^{+0.29}_{-0.27}$  & $44.15^{+0.46}_{-0.43}$  & $44.12^{+0.44}_{-0.49}$ \\\\\n    $L_{AGN}$ (erg/s)  & $46.56^{+0.46}_{-0.90}$  & $45.65^{+0.57}_{-0.79}$  & $45.07^{+0.49}_{-0.44}$  & $44.28^{+0.35}_{-0.44}$  & $45.65^{+1.23}_{-0.78}$  & $44.84^{+1.10}_{-0.72}$ \\\\\n    $L_{AGN,sat}$ (erg/s)  & $45.89^{+0.19}_{-0.42}$  & $45.82^{+0.29}_{-0.95}$  & $45.07^{+0.49}_{-0.44}$  & $44.28^{+0.35}_{-0.44}$  & $45.56^{+0.38}_{-0.69}$  & $44.84^{+1.11}_{-0.72}$ \\\\\n    ${\\Delta\\log M_{BH}}^{\\dagger}$  & $0.31^{+0.19}_{-0.24}$  & $0.31^{+0.19}_{-0.22}$  & $-0.11^{+0.37}_{-0.19}$  & $-0.04^{+0.29}_{-0.14}$  & $0.15^{+0.34}_{-0.36}$  & $0.19^{+0.28}_{-0.31}$ \\\\\n    ${\\Delta\\log\\dot{\\mathcal{M}}}^{\\ddagger}$  & $-0.24^{+0.58}_{-0.33}$  & $-0.13^{+0.47}_{-0.32}$  & $0.59^{+0.23}_{-1.06}$  & $0.54^{+0.15}_{-0.62}$  & $-0.01^{+0.68}_{-0.55}$  & $0.13^{+0.49}_{-0.46}$ \\\\\n    \\addlinespace[0.7em]\n    \\multicolumn{7}{l}{Luminosities}\\\\\n    $L_{\\text{trous}}$ (erg/s)  & $44.52^{+0.50}_{-0.36}$  & $44.52^{+0.50}_{-0.36}$  & $44.53^{+0.37}_{-0.47}$  & $44.53^{+0.37}_{-0.47}$  & $44.53^{+0.48}_{-0.44}$  & $44.53^{+0.48}_{-0.44}$ \\\\\n    $\\log L_{\\nu}(5\\mu m)$ (erg/s)  & $43.99^{+0.50}_{-0.38}$  & $43.99^{+0.50}_{-0.38}$  & $43.86^{+0.52}_{-0.39}$  & $43.86^{+0.52}_{-0.39}$  & $43.86^{+0.62}_{-0.35}$  & $43.86^{+0.62}_{-0.35}$ \\\\\n    $\\log L_{\\nu}(2keV)$ (erg/s)  & $43.23^{+0.10}_{-0.40}$  & $43.23^{+0.10}_{-0.40}$  & $42.85^{+0.57}_{-0.40}$  & $42.85^{+0.57}_{-0.40}$  & $43.19^{+0.22}_{-0.64}$  & $43.19^{+0.22}_{-0.64}$ \\\\\n\\bottomrule\n\\addlinespace[0.8em]\n\\multicolumn{7}{l}{$^{\\dagger}$ Defined as  $\\Delta \\log{M_{BH}}\\equiv (\\log{M_{BH}})^{\\text{fit}}-(\\log{M_{BH}})^{\\text{virial}} $}\\\\\n\\multicolumn{7}{l}{$^{\\ddagger}$ Defined as  $\\Delta \\log{\\dot{\\mathcal{M}}}\\equiv (\\log{\\dot{\\mathcal{M}}})^{\\text{fit}}-(\\log{\\dot{\\mathcal{M}}})^{\\text{virial}}$}\n\\end{tabular}}\n\\end{table*}\n\n\n\n\\subsection{Accretion Disc SED}\n\\label{section.thinAD}\nA major goal of this project is to determine what fraction of sub-Eddington and super-Eddington\naccretors in our sample can be fit by the simple optically thick, geometrically thin AD model\nbased on their long wavelength SEDs. By allowing intrinsic reddening as a free parameter of the\nthin AD model, we can fit all the 29 sources of our sample. For 23 sources, our modelling requires\nsome reddening and for 6 sources, which are all sub-Eddington AGN, the amount of reddening\nis consistent with zero. We found that 14\\% of the RM-selected AGN are consistent with\n{$E(B-V)$}$>0.1$ in good agreement with the work of \\citet{Krawczyk2015} where the SED was modelled\nby a single power law. Indeed, the reddening distribution of our entire sample is also consistent\nwith that presented by \\citet[][Figure~\\ref{figure.Av}]{Lusso2013}.\nSeveral of the declared good fits still include small deviations of the model from the local\ncontinuum at some wavelengths. This is not surprising given the uncertainties on AD models,\nespecially the radiative transfer in the disc atmosphere that was not treated here,\nas well as on the choice of the host galaxy template. In general, the simple $\\chi^2$-fitting\nprocedure cannot distinguish between $a_{\\star}=-1$ and $a_{\\star}=0.998$, given the assumed\nuncertainties on BH mass, BH accretion rate, reddening and the long wavelengths used for the fitting.\nObservations at shorter wavelengths (i.e. extreme-UV $\\lambda<2000{\\textup{\\AA}}{}$) are clearly\nrequired to make such a distinction.\n\n\nFor consistency with previous works, the 0.2-1$\\,\\mu$m SED was also fitted using a single reddened\npower-law model ($L_{\\nu}\\propto \\nu^{-\\alpha_{UV}}$).\nA satisfactory fit ($\\chi^2_{\\nu}<2$) with $A_{V}=0$ is found for 86\\% (25/29) of the sources.\nThe remaining four objects (which are super-Eddington) were successfully fitted with $A_{V}>0$.\nThe reddening distribution of the entire sample is quite consistent, as in the case of the thin\nAD modelling, with that presented in various earlier studies, e.g. \\citet{Lusso2013}. The range\nof slopes is large, from $\\alpha_{UV}=0.55$ to $\\alpha_{UV}=-0.98$.\nThe Kolmogorov-Smirnov test shows that the optical to UV spectral index corrected for intrinsic\nreddening for SEAMBHs and sub-Eddington\naccretors are fully consistent (see Figure~\\ref{fig.PLresults}), with means $\\langle\\alpha_{UV}\\rangle=-0.14$ and $-0.10$ and a standard deviations of\n$\\sigma=0.40$ and $0.33$, respectively. A comparison with earlier works on much larger samples\n\\citep{VandenBerk2001,Grupe2010} shows that our sample has bluer optical/UV continua.\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.9\\linewidth]{fig3_betaUV.pdf}\n    \\caption{The distribution of optical to UV spectral indices in the\n    super-Eddington and sub-Eddington objects. The spectral\n\tindices are defined such that $L_{\\lambda}\\propto \\lambda^{-\\beta_{UV}}$\n\tand $\\beta_{UV}=2-\\alpha_{UV}$. Colour code as Figure~\\ref{figure.L5100A}.}\n\t\\label{fig.PLresults}\n\\end{figure}\n\n\\begin{figure*}\n    \\centering\n    \\includegraphics[width=0.45\\linewidth]{fig4_EBmV_PL.pdf}\n    \\includegraphics[width=0.45\\linewidth]{fig4_EBmV_thinAD.pdf}\\\\\n    \\caption{Intrinsic reddening E(B-V) distribution modelled by a classical SMC-like extinction curve with $R_{V}=2.74$. The\n\tamount of reddening was derived from model fittings assuming a single power law (\\emph{left}) and a\n\tthin AD model (\\emph{right}). The red crosses with error bars represent the reddening distribution for\n\tthe entire sample (29 objects) and the green circles with error bars show the distribution of {$E(B-V)$}{} presented by \\citet{Lusso2013}.\n\tHistogram colour code as in Fig.~\\ref{figure.L5100A}.}\n    \\label{figure.Av}\n\\end{figure*}\n\n\\subsection{Properties of the obscuring dust}\n\\label{SED.IR}\n\nIf the adopted thin AD model does indeed explain the emitted SED of AGN in our sample,\nthen dust in the host galaxies of approximately 50\\% of the AGN in our sample is\ncontributing to the reddening of the optical-UV spectrum. It is therefore interesting\nto test the nature of the dust which is causing the extinction. Several earlier studies\n\\citep{Hopkins2004,Glikman2012} claimed that an SMC-type extinction curve best accounts\nfor the reddening, in preference to MW-type or \\citet{Gaskell2004} reddening,\n\\citet{Capellupo2015} find that in their sample of 39 z=1.5 AGN, there were no cases\nwhere the SMC-type curve allowed for a better fit than either the MW or simple power-law\nextinction curve. Our observations indicate that for those AGN that require intrinsic\nreddening, there is no preference for one particular extinction curve. This is probably\nbecause the UV observations are based on photometry instead of spectroscopy and may also\nbe the result of the limited wavelength range which is essential to differentiate between\nthe various extinction laws.\n\nAs noted above, the amount of extinction seems to be more significant in super-Eddington\nAGN. Figure~\\ref{figure.Av} compares the reddening distribution of the super-Eddington\nand the sub-Eddington groups assuming a SMC extinction curve. The median reddening for\nthe super-Eddington sources is $\\langle E(B-V)\\rangle=0.07$~mag with a scatter of\n$\\sigma=0.08$, while the sub-Eddington AGN sample shows $\\langle E(B-V)\\rangle\n\\approx0.01$~mag with $\\sigma=0.01$. A Kolmogorov-Smirnov test rules out the hypothesis\nthat both groups are drawn from the same distribution of {$E(B-V)$}{} with a probability\nof $>99.9$\\%. Experimenting with other extinction curves give basically the same\ndistribution shown in Figure~\\ref{figure.Av}.\n\n\n\\subsection{Uncertainties in black hole mass}\n\nIn order to evaluate the goodness of our fit, we have analysed the black hole properties recovered by the thin AD fit.\nWe find that the measured ``virialized'' mass black hole and mass accretion rate, within the allowed uncertainties,\nlead to a suitable disc model for all the 29 AGN. The comparisons are shown in Figure~\\ref{figure.Mbh}. While it is not\nsurprising that the overall agreement is good (the initial choice of the model parameters is based on the measured values),\nthere is a tendency for the best fit SEDs to over-predict the black hole mass for the super-Eddington AGN.\nThe median deviation of the black hole mass\n($\\Delta \\log{M_{BH}}\\equiv \\log{M_{BH,\\text{fit}}}-\\log{M_{BH,\\text{virial}}}$) for the super-Eddington\nsources is 0.305 with a 16$^{th}$ and 84$^{th}$ percentile of 0.07 and 0.5, while the median for the sub-Eddington sources\nis -0.07 with its percentiles at -0.23 and 0.25. There is no systematic shift on the mass accretion rate which is uniformly\ndistributed. This is because the accretion rate in the disc model is directly related to the observed luminosity and the best\nmass estimate. Note also that the assumed inclination of $\\cos(\\theta)=0.75$ only introduce an additional uncertainty on the fitting\nresults and can not explain the black hole mass discrepancy observed in the super-Eddington population.\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.8\\linewidth]{fig5_Mbh.pdf}\\\\\n    \\includegraphics[width=0.8\\linewidth]{fig5_logMdot.pdf}\\\\\n    \\caption{Comparison of the virialized black hole mass (\\emph{top}) and the dimensionless mass\n        accretion rate (\\emph{bottom}) against those given by our best-fit thin AD model.\n        The straight lines indicate the 1:1 ratios. Gray-blue circles represent super-Eddington\n        AGN and gray-empty squares sub-Eddington AGN.}\\label{figure.Mbh}\n\\end{figure}\n\n\\subsection{Ionizing Continuum}\n\nAn additional consistency check of the fitted SEDs can be obtained by studying the disc ionizing\ncontinuum which is directly related to the observed emission lines. The relative intensity of the lines, as well\nas their equivalent widths are related to the mean energy of the ionizing photons, the ionization parameter and\nthe covering factor by gas near the BH. The hydrogen Lyman continuum as the part of the SED responsible for most\nof the heating and ionization of the broad emission-line gas can be derived from our disc SEDs. In\nparticular, we can calculate both Lyman continuum, $L_{Lyman}$, and the mean energy of an ionizing photon,\n$\\langle h\\nu\\rangle$, and compare the distribution of these numbers in the two groups.\n\nA comparison of the Lyman continuum properties of the two groups is shown in\nFigure~\\ref{figure.Llyman} where both parameters are plotted against the normalized Eddington ratio.\nFor comparison, the mean energy of an ionizing photon with an optical/UV power-law SED of slope\n$\\alpha_{\\nu}=1.5$ is 2.31 Ryd.\nAs expected, the super-Eddington group, with its higher accretion rate and smaller BH mass,\nare predicted to have larger $L_{\\text{Lyman}}$/$L_{\\text{AGN}}$ and higher $\\langle h\\nu\\rangle$.\nThe diagrams show a very strong trends with the mass accretion rate. This is in line with the results of\nV09, although their sample is in the lower-Eddington ratio regime. The average ionization fraction\nis $\\sim$0.5 for the lowest Eddington ratio $\\dot{\\mathcal{M}}\\leq3$ (similar with V09) and rise to $\\sim$0.9\nfor the highest $\\dot{\\mathcal{M}}>3$.\n\nHere, and in all other results related to the Lyman continuum, the soft X-ray emission, and the bolometric correction factors and torus covering factors discussed below, we must\ntake into account two important factors related to the highly simplified assumption of the high energy\npart of the SED in super-Eddington sources. First, the entire disc structure can change at high accretion rate,\nleading to two-component disc like the one proposed by \\citet{Done2012}. This possibility is not investigated\nhere, partly because of the large uncertainties on such models and mostly because of the lack of short wavelength observations.\nSecond, saturation, if exists, affects the far-UV SED much more than the near-UV and optical\ncontinuum \\citep[][and references therein]{DuPu2015}. In this scenario the bolometric luminosity for sources with\n$\\dot{\\mathcal{M}}>20$ has only a weak logarithmic dependency on the mass accretion rate (Eqn.~\\ref{eq.saturation}).\nSuch values of $\\dot{\\mathcal{M}}$ are found in most of the super-Eddington sources in our sample (11/16, see Table~\\ref{table.bfSED}).\nThe case of saturation is compared with the thin AD predictions in Figure~\\ref{figure.Llyman}, and comparison with the other relevant quantities are shown in Figs.~\\ref{figure.b5100A} and \\ref{figure.Ltorus}. Indeed it results in lower Lyman continuum bolometric\ncorrection factors and torus covering factors (see below). However,\nall these are still considerably higher than the values estimated for\nthe sub-Eddington sources. Note that we do not have a simple way of\nestimating the changes in the mean energy of the ionizing photons in\ncases of saturation and hence do no comment of this additional effects.\n\nIn principle, the higher expected $L_{\\text{Lyman}}/L_{\\text{AGN}}$ and $\\langle h\\nu\\rangle$ for super-Eddington sources could be\ninvestigated by comparing line intensities and EWs between the two groups. One prediction is that, given similar BLR covering factors, super-Eddington sources will show larger line EWs and stronger lines of highly ionized species. While this\ngeneral issue is beyond the scope of the present work, we note that such differences in EWs have never been reported.\nIn fact, several studies show tends in the opposite directions \\citep[see e.g. ][]{DuPu2014}.\\\\\n\n\n\\begin{figure}\n    \\centering\n    \\includegraphics{fig6_LlymanLtot.pdf}\\\\\n    \\includegraphics{fig6_LlymanLtot_sat.pdf}\\\\\n    \\includegraphics{fig6_Emean.pdf}\n    \\caption{Lyman continuum luminosity fraction for cases of no saturation (\\emph{top}) and saturation according to Eqn.~\\ref{eq.saturation} (\\emph{midle}). The mean energy of an ionizing photon\n    as a function of the normalized Eddington ratio for the cases of the no saturation is shown at the bottom. The red diamond represents\n    the median parameter for each group and the error bars correspond to the 16$^{th}$ and 84$^{th}$ percentile.\n    Gray-blue circles represent super-Eddington AGN and grey-empty squares sub-Eddington AGN.\n    }\\label{figure.Llyman}\n\\end{figure}\n\n\\subsection{Bolometric Correction factors}\nOur disc models can also be used to determine the bolometric correction factors for the objects in question. Such factors are used\nin many AGN studies \\citep{Marconi2004,Netzer2014} as a way to deduce the bolometric luminosity, $L_{\\text{AGN}}$, in those\ncases (basically\nall cases) where much of the SED is not directly observed. Bolometric corrections are frequently given as\n\n", "index": 5, "text": "\\begin{equation}\n    \\kappa_{\\nu} = \\frac{L_{\\text{AGN}}}{\\nu L_{\\nu}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\kappa_{\\nu}=\\frac{L_{\\text{AGN}}}{\\nu L_{\\nu}}\" display=\"block\"><mrow><msub><mi>κ</mi><mi>ν</mi></msub><mo>=</mo><mfrac><msub><mi>L</mi><mtext>AGN</mtext></msub><mrow><mi>ν</mi><mo>⁢</mo><msub><mi>L</mi><mi>ν</mi></msub></mrow></mfrac></mrow></math>", "type": "latex"}]