[{"file": "1601.04728.tex", "nexttext": "\nwhere $J_{nm}$ refers to the excitonic coupling among different sites via dipole-dipole interaction, being\n$J_{nn} = \\epsilon_n$ the monomer excitation energy of a single site. The operators $a^{\\dagger}_n$ ($a^{\\phantom{\\dagger}}_n$) create (destroy)\na molecular excitation at site $n$. { As is often the case within the literature of photosynthetic excitons, we will remain in the one-exciton manifold, assuming that at every time there is only one exciton in the system.} Due to the high density of pigments within the chlorosome complex, the often used point dipole approximation is not valid in the present regime where the dipole moment lengths are comparable to the distance between {different} chromophores. A better approximation is given by the extended dipole-dipole interaction \\cite{Czikklely70}. A point dipole is substituted by opposite charges $+\\delta$ and $-\\delta$ at a finite distance $l$:\n\n\n", "itemtype": "equation", "pos": 11662, "prevtext": "\n\n\\title{Superradiance at the localization-delocalization crossover in tubular chlorosomes}\n\n\\author{Rafael A. Molina}\n\n\\author{Enrique Benito-Mat\\'{\\i}as}\n\n\\affiliation{Instituto de Estructura de la Materia, IEM-CSIC, Serrano 123, Madrid 28006, Spain}\n\n\\author{Alejandro Somoza}\n\n\\author{Lipeng Chen}\n\n\\author{Yang Zhao}\n\n\\affiliation{Division of Materials Science, Nanyang Technological University, 50 Nanyang Avenue, Singapore 639798}\n\n\\begin{abstract}\nWe study the effect of disorder on spectral properties of tubular chlorosomes\nin green sulfur bacteria {\\em Cf.~aurantiacus}. Employing a Frenkel-exciton Hamiltonian with diagonal and off-diagonal disorder consistent\nwith spectral and structural studies, we analyze excitonic localization and spectral statistics of\nthe chlorosomes. A size-dependent localization-delocalization crossover is found to occur as a function of the excitonic energy. The crossover energy region coincides with the more optically active states with maximized superradiance, and is, consequently, more conducive for energy transfer.\n\\end{abstract}\n\n\\pacs{87.15.M-,73.20.Fz}\n\n\\maketitle\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:intro}\nChlorosomes are the main light-harvesting structures of green sulfur bacteria, some green filamentous\nanoxygenic phototrophs \\cite{Frigaard06}, and the recently discovered aerobic anoxygenic phototroph {\\em Candidatus\nChloroacidobacterium thermophilum} \\cite{Bryant07}. The chlorosomes are self-assembled structures of hundreds of thousands bacteriochlorophyll (BChl) molecules. They differ from other light-harvesting complexes by the {absence} of a\nprotein matrix {which} supports the {photosynthetic} pigments and their very large size with lengths up to 200 nm \\cite{Holzwarth90}.\nChlorosomes usually function in extremely low light conditions and are thus probably the most efficient light-harvesting\nantenna complexes in nature \\cite{Blankenship_book}.\nThese special properties {makes the chlorosome} a potential candidate for use in biomimetic light-harvesting devices \\cite{Modesto10,Sridharan09}.\nDue to the heterogeneity of chlorosomes their structure cannot be determined by crystallographic methods and structural information is scarce. However, thanks to recent advances in different areas, a structural model has been put forward for cholorosomes of the green sulfur bacterium {\\em Chlorobaculum tepidum} \\cite{Ganapathy09}. This model is based\non a {\\em syn-anti} array of BChl c pigments in tubular shape. One of the methods that were used to determine\nthe structure of the chlorosome was to study mutant bacteria with three genes whose expression was prevented. The mutant bacteria have a more ordered structure of BChls which allowed X-ray crystallographic studies and showed the presence of an helical structure. Interestingly enough, the mutant bacteria growth was much slower than the wild type bacteria. This observation together with the fact that the function of three genes was suppressed in order to make the structure less disordered hints to the possibility that disorder plays a biological function in chlorosomes and\na disordered structure is favored by evolution. The obvious role for disorder is the broadening of the optical spectra that in an ordered structure would be too narrow as observed in similar artificial supramolecular structures \\cite{Ganapathy09}.\n\n\n\nHowever, these results are paradoxical since disorder is also expected to localize the excitonic wave functions and inhibit energy diffusion according to the theory of Anderson localization. Since the seminal paper of Anderson on the absence of diffusion for disordered quantum lattices \\cite{Anderson58}, wave localization due to interference has been a central theme in condensed matter physics. One of the main tools\nfor studying localization phenomena and, in general, disordered quantum systems has been Random Matrix Theory (RMT)\n\\cite{Mehta_Book}. The RMT approach has also been applied to probe thermodynamic properties of closed systems as well as transport properties of open systems. One of the important results in the field is the statistical relationship between the spectral repulsion\nparameter $\\beta$ and the wave function localization. The $\\beta$ parameter can be used to locate the metal-insulator transtion in three dimensions \\cite{Evers08} and it has been shown that there are specific scaling laws between localization and the repulsion parameter in finite, disordered one-dimensional systems \\cite{Izrailev89,Izrailev90,Casati93,Sorathia12}. Localization in systems with dipolar interactions like the natural light-harvesting complexes have been shown to be much weaker than for the Anderson model with only nearest neighbor coupling \\cite{Rodriguez03}. Quantum transport in disordered networks has been extensively studied in connection with its relevance for efficient energy transfer in light-harvesting systems. Centrosymmetry and a dominant doublet spectral structure has been stablished as a general mechanism for highly efficient quantum transport even in the presence of disorder and the natural implementation of this mechanism in the Fenna-Matthews-Olson (FMO) { complex} of green sulfur \nbacteria has also been explored \\cite{Walschaers13}.  \n\nThe extraordinary energy transfer properties of chlorosomes are attributed to cooperative phenomena in the BChl aggregates, which are known otherwise as superradiance and supertransfer. Superradiance occurs when a group of emitters, situated at a distance from each other shorter than the wave length of the light, emits coherently with a very high intensity, and was discovered by Dicke in the context of radiating atoms \\cite{Dicke54}. It has\nbeen studied for supramolecular complexes and in the light-harvesting apparatus of bacterial photosynthesis \\cite{Meier97,Zhao99}.\nIn the presence of disorder, static or dynamic,\nsuperradiance is quenched, although, \nin a tight-binding model in a ring superradiance persists for disorder strengths below a critical value even in a regime with strong coupling to the external environment {\\cite{Celardo14}}.  The optical properties of\none-dimensional disordered excitonic systems have been studied extensively, specially in the context of applications to J-aggregates {\\cite{Knapp84,aggregates_book}}. The localization length of the system has been shown to limit the number of monomers contributing to the superradiance {\\cite{Fidder91}}. These results should also apply to\nsupertransfer, a coined term describing non-radiative excitonic transfer of a superradiant patch {\\cite{Strek77,Lloyd2010, Abasto12}}. {Supertransfer has been ascribed to play a crucial role in the efficiency enhancement of light-harvesting systems, and in the chlorosome in particular \\cite{Kassal2013, Huh2014}. Photosynthetic systems are arranged in hierarchical structures where energy funnelling from the chlorosome antenna towards the reaction center proceeds throughout a network of superradiant units. Supertransfer refers to the excitation energy transfer (EET) between these superradiant patches}. The properties of cylindrical chlorosomes have been studied before in the homogeneous case \\cite{Didraga02} and in the disordered case \\cite{Didraga04}. Attempts have also been made at describing the excitonic dynamics in the presence of a bath using a high-temperature, stochastic treatment attributed to Haken and Strobl \\cite{Fujita12,Yejun12,Moix13}.\n\nIn this paper, we study the effects of disorder on the localization properties, the spectral statistics and the optical properties, in particular, superradiance, of chlorosomes. We try to give an answer to the previously\nmentioned paradox. The long range properties of the dipolar interaction between chromophores make the excitonic\nwave functions more robust against localization. { However}, for realistic values of disorder and size, there appears a localization-delocalization crossover as a function of the excitonic energy as monitored by the inverse participation ratio and the spectral statistics. Precisely in the low-energy region where\nthere { appears} more collectiveness in the optical behavior of the states for the clean system, {the exciton is} more localized when disorder is included. { In the presence of static disorder, there} is {thus a} compromise between {the collective but localized }low energy {states} ({with }less nodes in the wave function) and delocalization which happens at\nhigh energy. { We find that the} maximum of superradiance appears at the localization-delocalization crossover\nand moves to the high energy side of the spectrum as disorder increases. An optimal value of disorder depending on the environmental conditions exists between sufficient superradiance and a wide spectrum that could help explain the energy transfer properties\nof chlorosomes. The plan of the paper is the following: we present the realistic model for a single rod in Sec. \\ref{sec:model}, the results for the spectral statistics, wave function localization and optical properties are shown in Sec. \\ref{sec:results} and, finally, some conclusions are drawn in Sec. \\ref{sec:conclusions} with some comments on the possibility of probing experimentally these theoretical results.\n\n\n\n\\section{Model for a single rod}\n\\label{sec:model}\n\n\\begin{figure}\n\n\\includegraphics[width=\\linewidth]{fig1.eps}\n\\caption{\\label{fig:structure} Sketch of the arrangement of pigments in the chlorosome complex of {\\em Cf. aurantiacus}. The structure is { formed} by a series of $L$ concentric rings separated by 6.25 \\AA. A stack is defined as a vertical group of sites, which share the same dipole orientation. The structure has { 18 stacks} so the total number of sites in the full structure is {$N=18L$}. Additionally, there is a vertical shift of 2.08 {\\AA~} in between adjacent stacks inducing helicoidal pathways in the structure. Each BChl c presents a transition dipole moment (green arrows) which approximately connects two nitrogens (red dots) situated diagonally to the magnesium atom (blue dots) of the chromophore at the center of the pigment.}\n\n\\end{figure}\n\n\nWe make use of a single rod aggregate structure consisting of a series of $L$ concentric rings in conformance with the model introduced in \\cite{Prokhorenko00,Holzdata}, as shown in Fig.~\\ref{fig:structure}. The distance between consecutive rings is 6.25 \\AA. The structure has {18} different stacks. A stack is defined as a vertical group of sites sharing the same dipole orientation, { or equally, the number of sites in one ring}. Each ring {contains therefore} {18 sites} and the total number of molecules of the full structure is {$N=18L$}. For a certain pigment, the neighbouring sites in the same ring belonging to neighboring stacks present relative heights of -2.08 {\\AA} and 2.08 {\\AA} with respect {to the} cylinder symmetry axis. Every pigment in the same stack { has} the same dipole orientation, forming an angle of 100$^\\circ$ with the radius vector connecting the magnesium atom and the symmetry axis and an angle of 36.5$^\\circ$ with this axis. Regarding the dipole moments of the pigments belonging to the same ring, neighboring dipole moments are rotated with each other 20$^\\circ$ \nalong the symmetry axis. { The radius of the cylinder is 21.13 \\AA~ (the distance from the magnesium atoms to the symmetry axis).} This structure results\nin helical pathways of the excitons for energy transfer from the center of the structure to {the} top or bottom \\cite{Ganapathy09,Prokhorenko03,Oostergetel10}.\n\nThe excitonic model we use to treat optical properties and localization is based on a model of Frenkel excitons delocalized over a molecular lattice.\n\n", "index": 1, "text": "\\begin{equation}\n H=\\sum_{n,m} J_{nm} a^{\\dagger}_n a^{\\phantom{\\dagger}}_m,\n \\label{eq:Frenkel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H=\\sum_{n,m}J_{nm}a^{\\dagger}_{n}a_{m},\" display=\"block\"><mrow><mrow><mi>H</mi><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></munder><mrow><msub><mi>J</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><msubsup><mi>a</mi><mi>n</mi><mo>†</mo></msubsup><mo>⁢</mo><msub><mi>a</mi><mi>m</mi></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04728.tex", "nexttext": "\n\n\\noindent where $r_{\\pm \\pm}$ represent the distance between the positive (negative) charge of the point dipole associated with the first molecule to\nthe positive (negative) charge of the point dipole associated with the second molecule. In the case of BChl c pigments the dipole length $l$ is taken to be 8 \\AA~ and the\nsquared dipole strength $D$ as 25 $\\mathrm{Debye}^2$.\nThe values for the disorder are taken from Ref.~\\cite{Prokhorenko03} and are quoted on Table \\ref{table:dis}.\nFor understanding how disordered the system really {is} we can compare {these values to} the parameters of the system. The value for the nearest-neighbor coupling in the system {(between adjacent pigments in the same stack)} is\n{$-282.39$} cm$^{-1}$, the FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$. In the case of the Anderson model with only nearest-neighbor coupling {we have verified that} the system is fully localized and superradiance is quenched for these values of disorder and for the realistic typical sizes of the chlorosomes. The situation is quite different for the full dipole-dipole interaction as is presented in the next section. {For the nearest-neighbors model we have retained the coupling between  adjacent sites in the same stack and ring, being the latter $~10$ times smaller and of opposite sign than the former, due to their relative dipole orientation.}\n\n\\begin{table}\n\\begin{tabular}{cc}\n \\hline\n Disorder & value of FWHM \\\\\n \\hline\n Exciton diagonal energy  & 210 cm$^{-1}$ \\\\\n Position along symmetry axis &  0.24 \\AA \\\\\n Position along x-axis        &  0.3  \\AA \\\\\n Position along y-axis        &  0.3  \\AA \\\\\n angle between dipole and symmetry axis &  10$^{\\circ}$ \\\\\n angle between dipole and radius-vector &  20.6$^{\\circ}$ \\\\\n\\end{tabular}\n \\caption{\\label{table:dis} Parameters for the disorder used in our work, taken from ~\\cite{Prokhorenko03}.}\n\n\\end{table}\n\n\n\n\\section{Results: Localization, spectral statistics and optical properties}\n\\label{sec:results}\n\nIn the absence of disorder, an infinite, pristine system can be diagonalized analytically in the momentum representation, and eigenstates can be labeled with\ntwo momenta, the longitudinal one on the symmetry axis of the cylinder with continuous values and the transverse\none with discrete values that depend on the number of molecules in each ring. Following Didraga {\\em et al.} \\cite{Didraga02}, it is possible to calculate the absorption spectra from the Bloch states that diagonalize the Hamiltonian\nin momentum state. There are two peaks that concentrate all the {oscillator} strength. Most of the oscillator {strength} is concentrated at the excitonic lower state at energy $E_0=\\omega_0+\\Sigma'_n J(n)$, where $\\omega_0$ is the energy of one exciton of an isolated BChl c molecule and $\\Sigma'_n J(n)$ represents the sum of all the couplings in site space. The wave function of\nthis state is just { a} coherent superposition of all { dipoles} with the same coefficient, it has zero transverse momentum {$k_{\\bot}=0$}. The other peak is related to the helical structure of the system, the {corresponding} states have transverse momentum {$k_{\\bot}=\\pm 1$}. The amplitude in this state is such that the components of the {dipoles} parallel to the {z-axis} interfere destructively while the {ones} perpendicular to the z-axis add constructively (the opposite as in the other case). In the case of a finite system without disorder the helical peak is more fragmented due to the effect of the ending points of the cylinder. Although, the monomers are\nplaced in a three-dimensional cylindrical structure wrapped in itself, the properties of the model are more similar to the properties of a quasi one-dimensional system with dipolar interactions \\cite{Didraga02,Didraga04}. It is interesting to notice that the clean model {of the} chlorosome has a centrosymmetric structure that has been argued to be an important ingredient for efficient transport in {quantum} networks {\\cite{Christandl05,Kay06,Zech13}}. A dominant doublet structure is the other critical ingredient needed for optimal quantum  {transport \\cite{Walschaers13}}. Although, outside the model we are using in this work, it is easy to picture a\ndominant doublet structure as being also important for the behavior of chlorosomes once the full modelling of the coupling to the reaction center is taking into account.\n\nDidraga and Knoester also studied a case of strong disorder with\nwith $\\sigma=800$ {cm$^{-1}$} in addition to a weak-disorder case where disorder can be seen\nas a perturbation mixing helical states with the low energy peak and fragmenting slightly the {oscillator} strength.\nThey showed that the excitons dominating the optical properties have anisotropic localization along the helices and\nthat the localization length increased with energy from the bottom to the center of the band. In their case, however\nthe localization length was always smaller {than} the typical system size.\n\nIn order to study the localization properties of the excitonic system we calculate the inverse participation ratio (IPR) \\cite{Bell70} defined by\n\n", "itemtype": "equation", "pos": 12685, "prevtext": "\nwhere $J_{nm}$ refers to the excitonic coupling among different sites via dipole-dipole interaction, being\n$J_{nn} = \\epsilon_n$ the monomer excitation energy of a single site. The operators $a^{\\dagger}_n$ ($a^{\\phantom{\\dagger}}_n$) create (destroy)\na molecular excitation at site $n$. { As is often the case within the literature of photosynthetic excitons, we will remain in the one-exciton manifold, assuming that at every time there is only one exciton in the system.} Due to the high density of pigments within the chlorosome complex, the often used point dipole approximation is not valid in the present regime where the dipole moment lengths are comparable to the distance between {different} chromophores. A better approximation is given by the extended dipole-dipole interaction \\cite{Czikklely70}. A point dipole is substituted by opposite charges $+\\delta$ and $-\\delta$ at a finite distance $l$:\n\n\n", "index": 3, "text": "\\begin{equation}\n J_{nm}=\\frac{D^2}{4 \\pi \\epsilon \\epsilon_0 l^2} \\left( \\frac{1}{r_{++}} + \\frac{1}{r_{--}}-\\frac{1}{r_{+-}}-\\frac{1}{r_{-+}} \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"J_{nm}=\\frac{D^{2}}{4\\pi\\epsilon\\epsilon_{0}l^{2}}\\left(\\frac{1}{r_{++}}+\\frac%&#10;{1}{r_{--}}-\\frac{1}{r_{+-}}-\\frac{1}{r_{-+}}\\right).\" display=\"block\"><mrow><mrow><msub><mi>J</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><mfrac><msup><mi>D</mi><mn>2</mn></msup><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>ϵ</mi><mo>⁢</mo><msub><mi>ϵ</mi><mn>0</mn></msub><mo>⁢</mo><msup><mi>l</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mfrac><mn>1</mn><msub><mi>r</mi><mrow><mi/><mo>+</mo><mo>+</mo></mrow></msub></mfrac><mo>+</mo><mfrac><mn>1</mn><msub><mi>r</mi><mrow><mi/><mo>-</mo><mo>-</mo></mrow></msub></mfrac></mrow><mo>-</mo><mfrac><mn>1</mn><msub><mi>r</mi><mrow><mi/><mo>+</mo><mo>-</mo></mrow></msub></mfrac><mo>-</mo><mfrac><mn>1</mn><msub><mi>r</mi><mrow><mi/><mo>-</mo><mo>+</mo></mrow></msub></mfrac></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04728.tex", "nexttext": "\nwhere $\\Psi_i^{\\alpha}$ is the amplitude of the excitonic eigenstate with energy $E_{\\alpha}$ on site $i$. ${\\rm IPR}=1$ if the state is localized on only one site, and ${\\rm IPR}=N$ if the wave function is equally distributed among all sites in an $N$ site system.\nFig.~\\ref{fig:ipr} displays the ${\\rm IPR}$ as a function of the normalized state number $k/N$ for cylinders of different lengths. We notice that for realistic values of disorder the IPR is independent of the aggregate length at the edges of the spectrum  and thus, wavefunctions present a localized nature. Therefore, the IPR reveals  a localized to delocalized crossover which is also signalled by the spectrum statistics as shown below.\n\n\\begin{figure}\n \\includegraphics[width=0.45\\textwidth]{Fig2a.png}\n \\includegraphics[width=0.45\\textwidth]{Fig2b.png}\n \\caption{\\label{fig:ipr} IPR as a function of the normalized state number $k/N$ for different sizes. The lower panel shows a zoom on the region close to the ground state.\n We can see how IPR saturates as a function of size for the region close to the ground state up to $k/N \\approx 0.005$. Parameters for the disorder are quoted in Table \\ref{table:dis}.\n The FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$.}\n\\end{figure}\n\n\n\nThe repulsion parameter is defined by the behaviour of the nearest neighbour spacing distribution near degeneracy: $P(s)\\sim s^\\beta \\; (s\\rightarrow0)$, where $s_{\\alpha}=(E_{\\alpha +1}-E_{\\alpha})$. Integrable systems present a Poissonian profile of the spacing {distribution} with $\\beta=0$ while chaotic systems show level repulsion, avoiding degeneracies with $\\beta \\sim 1$. The origin of level repulsion comes from the presence of avoided crossings in systems with symmetry-breaking perturbations. Recently, level repulsion has been experimentally verified in disordered cyanine-dye-based molecular nanoaggregates \\cite{Augulis10}.\nIn order to study the repulsion parameter $\\beta$ of spectral statistics, we fit the nearest neighbor spacing distribution to the phenomenological Brody distribution \\cite{Brody73} which has been used succesfully for similar purposes in many areas related to localization in disordered systems or quantum chaos \\cite{Wilkinson91,Molina01,Flores13,Frisch14,Mur15}:\n\n\n", "itemtype": "equation", "pos": 18056, "prevtext": "\n\n\\noindent where $r_{\\pm \\pm}$ represent the distance between the positive (negative) charge of the point dipole associated with the first molecule to\nthe positive (negative) charge of the point dipole associated with the second molecule. In the case of BChl c pigments the dipole length $l$ is taken to be 8 \\AA~ and the\nsquared dipole strength $D$ as 25 $\\mathrm{Debye}^2$.\nThe values for the disorder are taken from Ref.~\\cite{Prokhorenko03} and are quoted on Table \\ref{table:dis}.\nFor understanding how disordered the system really {is} we can compare {these values to} the parameters of the system. The value for the nearest-neighbor coupling in the system {(between adjacent pigments in the same stack)} is\n{$-282.39$} cm$^{-1}$, the FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$. In the case of the Anderson model with only nearest-neighbor coupling {we have verified that} the system is fully localized and superradiance is quenched for these values of disorder and for the realistic typical sizes of the chlorosomes. The situation is quite different for the full dipole-dipole interaction as is presented in the next section. {For the nearest-neighbors model we have retained the coupling between  adjacent sites in the same stack and ring, being the latter $~10$ times smaller and of opposite sign than the former, due to their relative dipole orientation.}\n\n\\begin{table}\n\\begin{tabular}{cc}\n \\hline\n Disorder & value of FWHM \\\\\n \\hline\n Exciton diagonal energy  & 210 cm$^{-1}$ \\\\\n Position along symmetry axis &  0.24 \\AA \\\\\n Position along x-axis        &  0.3  \\AA \\\\\n Position along y-axis        &  0.3  \\AA \\\\\n angle between dipole and symmetry axis &  10$^{\\circ}$ \\\\\n angle between dipole and radius-vector &  20.6$^{\\circ}$ \\\\\n\\end{tabular}\n \\caption{\\label{table:dis} Parameters for the disorder used in our work, taken from ~\\cite{Prokhorenko03}.}\n\n\\end{table}\n\n\n\n\\section{Results: Localization, spectral statistics and optical properties}\n\\label{sec:results}\n\nIn the absence of disorder, an infinite, pristine system can be diagonalized analytically in the momentum representation, and eigenstates can be labeled with\ntwo momenta, the longitudinal one on the symmetry axis of the cylinder with continuous values and the transverse\none with discrete values that depend on the number of molecules in each ring. Following Didraga {\\em et al.} \\cite{Didraga02}, it is possible to calculate the absorption spectra from the Bloch states that diagonalize the Hamiltonian\nin momentum state. There are two peaks that concentrate all the {oscillator} strength. Most of the oscillator {strength} is concentrated at the excitonic lower state at energy $E_0=\\omega_0+\\Sigma'_n J(n)$, where $\\omega_0$ is the energy of one exciton of an isolated BChl c molecule and $\\Sigma'_n J(n)$ represents the sum of all the couplings in site space. The wave function of\nthis state is just { a} coherent superposition of all { dipoles} with the same coefficient, it has zero transverse momentum {$k_{\\bot}=0$}. The other peak is related to the helical structure of the system, the {corresponding} states have transverse momentum {$k_{\\bot}=\\pm 1$}. The amplitude in this state is such that the components of the {dipoles} parallel to the {z-axis} interfere destructively while the {ones} perpendicular to the z-axis add constructively (the opposite as in the other case). In the case of a finite system without disorder the helical peak is more fragmented due to the effect of the ending points of the cylinder. Although, the monomers are\nplaced in a three-dimensional cylindrical structure wrapped in itself, the properties of the model are more similar to the properties of a quasi one-dimensional system with dipolar interactions \\cite{Didraga02,Didraga04}. It is interesting to notice that the clean model {of the} chlorosome has a centrosymmetric structure that has been argued to be an important ingredient for efficient transport in {quantum} networks {\\cite{Christandl05,Kay06,Zech13}}. A dominant doublet structure is the other critical ingredient needed for optimal quantum  {transport \\cite{Walschaers13}}. Although, outside the model we are using in this work, it is easy to picture a\ndominant doublet structure as being also important for the behavior of chlorosomes once the full modelling of the coupling to the reaction center is taking into account.\n\nDidraga and Knoester also studied a case of strong disorder with\nwith $\\sigma=800$ {cm$^{-1}$} in addition to a weak-disorder case where disorder can be seen\nas a perturbation mixing helical states with the low energy peak and fragmenting slightly the {oscillator} strength.\nThey showed that the excitons dominating the optical properties have anisotropic localization along the helices and\nthat the localization length increased with energy from the bottom to the center of the band. In their case, however\nthe localization length was always smaller {than} the typical system size.\n\nIn order to study the localization properties of the excitonic system we calculate the inverse participation ratio (IPR) \\cite{Bell70} defined by\n\n", "index": 5, "text": "\\begin{equation}\n {\\rm IPR}(E_{\\alpha})=\\frac{1}{\\sum_{i} |\\Psi_i^{\\alpha}|^4},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\rm IPR}(E_{\\alpha})=\\frac{1}{\\sum_{i}|\\Psi_{i}^{\\alpha}|^{4}},\" display=\"block\"><mrow><mrow><mrow><mi>IPR</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>α</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><msup><mrow><mo stretchy=\"false\">|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mi>i</mi><mi>α</mi></msubsup><mo stretchy=\"false\">|</mo></mrow><mn>4</mn></msup></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04728.tex", "nexttext": "\nwhere the constant $A$ is needed for proper normalization {and $\\Gamma$ is the Gamma function}. For localized systems, level repulsion is diminished as neighboring levels tend to localize in non-overlapping spatial regions, $\\beta=0$ and the nearest neighbor spacing distribution is equal to the Poisson distribution $P(s)=\\exp{(-s)}$. In systems of disordered but extended states the form of $P(s)$ can be obtained from RMT and can be approximated by the Wigner-Dyson distribution which is equal to the Brody distribution with $\\beta=1$, $P(s)=(\\pi/2)\\exp{(-\\pi s^2/4)}$ \\cite{Mehta_Book}. The Brody distribution interpolates smoothly between these two limits.\nPreviously to the computation of the $P(s)$, the unfolding of the spectra to unit spacing is needed. The unfolding procedure filters the smooth part of the spectrum by performing a local average on the nearest neighbour distances. We have used a local unfolding\nprocedure with a window of $5$ levels as described in \\cite{Haake_book}. This procedure describes perfectly well the short\nrange spectral correlations described by the $P(s)$ although it cannot be used to study long range correlations in the spectra \\cite{Gomez02}.\n\nThe results are shown in Fig.~\\ref{fig:brody}. We show some examples of the fit to the Brody distribution. We have analyzed the data moving a window of $100$ levels around some particular level number and analyzing the results every $10$ levels (the windows are overlapping). In that way, we can study the repulsion parameter as a function of the exciton energy. The quality of the fit is impressive. \nThe parameter $\\beta$ behaves as a function of the energy in a complementary way to the ${\\rm IPR}$. {This complementarity is tightly related to the sensitivity of the $\\beta$ parameter to the ratio between the localization length and the total length of the system \\cite{Casati93,Sorathia12}}. {In the localized region, the IPR saturates for sufficiently large tubes, indicative of the finite localization length of these states. At higher energies, far from the ground state, the localization length is much longer than the realistic system sizes that we have used (300 rings). For this reason the IPR of Figure \\ref{fig:ipr}  increases with larger aggregates in the delocalized region. }\n In contrast, the repulsion parameter decreases as a function of the system size in the localized region, as in that regime $\\beta$ is very sensitive to the ratio between the localization length {(which saturates)} and the total length of the system. In the delocalized region, $\\beta$ varies very little with the system size although it {continues} to decrease, albeit slowly. The fact that the repulsion parameter decreases (although very slightly in the middle of the band) as a function of the total length of the chlorosome for all energies is an indication of the localization of the wave functions in the thermodynamic limit,  as expected from theoretical considerations \\cite{Rodriguez03,Evers08}.\n \n{ In other words, while the localization length increases with the system size, the ratio localization length / system size tends to zero.} For the largest aggregate size we have calculated, the values we find numerically are $\\beta \\gtrsim 0.6$ in the delocalized region, $\\beta \\approx 0.5$ in the crossover region and $\\beta \\lesssim 0.4$ in the localized region of the spectra. { The value $\\beta\\approx 0.5$ corresponds to the energy region where the saturation of the IPR with the system size ceases, giving rise to extended states as shown in the bottom panel of Figure \\ref{fig:ipr}}. Due to the finite nature of the system, the crossover region is slightly extended around this value.  \n\n\n\n\n\\begin{figure}\n \\includegraphics[width=0.45\\textwidth]{Fig3a.png}\n \\includegraphics[width=0.45\\textwidth]{Fig3b.png}\n \\caption{\\label{fig:brody} Top panel: Fit of the $P(s)$ to the Brody distribution in the case of $L=40,80,150,300$ rings for different values\n of the central energy of the level window. Bottom panel: Value of $\\beta$ as a function of the renormalized state number $k/N$ for\n different lengths of cylinder. Parameters for the disorder are the same as in Fig. \\ref{fig:ipr} and are quoted in Table \\ref{table:dis}.\n The FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$.}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn general, the excitonic superradiance depends on a variety of controlling parameters, such as temperature, inter-chromophore coupling, static disorder, and various forms of exciton-phonon interactions. For example, the superradiance size is quickly reduced to one with rising temperature. It was also shown that the effect of exciton-phonon coupling on the superradiance size closely resembles that of the static disorder \\cite{Meier97}.\nHere, considering only static disorder, the superradiance size is limited by two factors: 1) it cannot be larger than the localization length; and 2)\nit cannot be larger than the typical size of the nodal structure (the inverse of the absolute value of the momentum for systems with translational symmetry). In the pristine system when the states are delocalized over the entire system, the localization length is\nnot a limiting factor, and most of the {oscillator} strength is concentrated in the state with zero momentum. In the disordered\ncase as the localization length increases with energy while the nodal size decreases with energy there will be a maximum of {superradiance} when the localization length is approximately equal to the nodal size and there is a state\nwith coherence along the whole localization region. As disorder is increased the region with maximum superradiant\nsize moves to higher values of energy up to the point where disorder is so large {that} superradiance is destroyed and the oscillator strength becomes uniform in energy. In order to study superradiance we {concentrate} on the linear absorption spectrum that can be computed in the dipolar approximation through:\n{\n\n", "itemtype": "equation", "pos": 20511, "prevtext": "\nwhere $\\Psi_i^{\\alpha}$ is the amplitude of the excitonic eigenstate with energy $E_{\\alpha}$ on site $i$. ${\\rm IPR}=1$ if the state is localized on only one site, and ${\\rm IPR}=N$ if the wave function is equally distributed among all sites in an $N$ site system.\nFig.~\\ref{fig:ipr} displays the ${\\rm IPR}$ as a function of the normalized state number $k/N$ for cylinders of different lengths. We notice that for realistic values of disorder the IPR is independent of the aggregate length at the edges of the spectrum  and thus, wavefunctions present a localized nature. Therefore, the IPR reveals  a localized to delocalized crossover which is also signalled by the spectrum statistics as shown below.\n\n\\begin{figure}\n \\includegraphics[width=0.45\\textwidth]{Fig2a.png}\n \\includegraphics[width=0.45\\textwidth]{Fig2b.png}\n \\caption{\\label{fig:ipr} IPR as a function of the normalized state number $k/N$ for different sizes. The lower panel shows a zoom on the region close to the ground state.\n We can see how IPR saturates as a function of size for the region close to the ground state up to $k/N \\approx 0.005$. Parameters for the disorder are quoted in Table \\ref{table:dis}.\n The FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$.}\n\\end{figure}\n\n\n\nThe repulsion parameter is defined by the behaviour of the nearest neighbour spacing distribution near degeneracy: $P(s)\\sim s^\\beta \\; (s\\rightarrow0)$, where $s_{\\alpha}=(E_{\\alpha +1}-E_{\\alpha})$. Integrable systems present a Poissonian profile of the spacing {distribution} with $\\beta=0$ while chaotic systems show level repulsion, avoiding degeneracies with $\\beta \\sim 1$. The origin of level repulsion comes from the presence of avoided crossings in systems with symmetry-breaking perturbations. Recently, level repulsion has been experimentally verified in disordered cyanine-dye-based molecular nanoaggregates \\cite{Augulis10}.\nIn order to study the repulsion parameter $\\beta$ of spectral statistics, we fit the nearest neighbor spacing distribution to the phenomenological Brody distribution \\cite{Brody73} which has been used succesfully for similar purposes in many areas related to localization in disordered systems or quantum chaos \\cite{Wilkinson91,Molina01,Flores13,Frisch14,Mur15}:\n\n\n", "index": 7, "text": "\\begin{equation}\n P(s)= A(\\beta+1)s^{\\beta} \\exp({-As^{\\beta+1}}). \\,\\,A=\\Gamma\\left[\\frac{\\beta+2}{\\beta+1}\\right]^{\\beta+1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P(s)=A(\\beta+1)s^{\\beta}\\exp({-As^{\\beta+1}}).\\,\\,A=\\Gamma\\left[\\frac{\\beta+2}%&#10;{\\beta+1}\\right]^{\\beta+1}\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>β</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>s</mi><mi>β</mi></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><mi>A</mi><mo>⁢</mo><msup><mi>s</mi><mrow><mi>β</mi><mo>+</mo><mn>1</mn></mrow></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo rspace=\"5.9pt\">.</mo><mrow><mi>A</mi><mo>=</mo><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><msup><mrow><mo>[</mo><mfrac><mrow><mi>β</mi><mo>+</mo><mn>2</mn></mrow><mrow><mi>β</mi><mo>+</mo><mn>1</mn></mrow></mfrac><mo>]</mo></mrow><mrow><mi>β</mi><mo>+</mo><mn>1</mn></mrow></msup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04728.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 26707, "prevtext": "\nwhere the constant $A$ is needed for proper normalization {and $\\Gamma$ is the Gamma function}. For localized systems, level repulsion is diminished as neighboring levels tend to localize in non-overlapping spatial regions, $\\beta=0$ and the nearest neighbor spacing distribution is equal to the Poisson distribution $P(s)=\\exp{(-s)}$. In systems of disordered but extended states the form of $P(s)$ can be obtained from RMT and can be approximated by the Wigner-Dyson distribution which is equal to the Brody distribution with $\\beta=1$, $P(s)=(\\pi/2)\\exp{(-\\pi s^2/4)}$ \\cite{Mehta_Book}. The Brody distribution interpolates smoothly between these two limits.\nPreviously to the computation of the $P(s)$, the unfolding of the spectra to unit spacing is needed. The unfolding procedure filters the smooth part of the spectrum by performing a local average on the nearest neighbour distances. We have used a local unfolding\nprocedure with a window of $5$ levels as described in \\cite{Haake_book}. This procedure describes perfectly well the short\nrange spectral correlations described by the $P(s)$ although it cannot be used to study long range correlations in the spectra \\cite{Gomez02}.\n\nThe results are shown in Fig.~\\ref{fig:brody}. We show some examples of the fit to the Brody distribution. We have analyzed the data moving a window of $100$ levels around some particular level number and analyzing the results every $10$ levels (the windows are overlapping). In that way, we can study the repulsion parameter as a function of the exciton energy. The quality of the fit is impressive. \nThe parameter $\\beta$ behaves as a function of the energy in a complementary way to the ${\\rm IPR}$. {This complementarity is tightly related to the sensitivity of the $\\beta$ parameter to the ratio between the localization length and the total length of the system \\cite{Casati93,Sorathia12}}. {In the localized region, the IPR saturates for sufficiently large tubes, indicative of the finite localization length of these states. At higher energies, far from the ground state, the localization length is much longer than the realistic system sizes that we have used (300 rings). For this reason the IPR of Figure \\ref{fig:ipr}  increases with larger aggregates in the delocalized region. }\n In contrast, the repulsion parameter decreases as a function of the system size in the localized region, as in that regime $\\beta$ is very sensitive to the ratio between the localization length {(which saturates)} and the total length of the system. In the delocalized region, $\\beta$ varies very little with the system size although it {continues} to decrease, albeit slowly. The fact that the repulsion parameter decreases (although very slightly in the middle of the band) as a function of the total length of the chlorosome for all energies is an indication of the localization of the wave functions in the thermodynamic limit,  as expected from theoretical considerations \\cite{Rodriguez03,Evers08}.\n \n{ In other words, while the localization length increases with the system size, the ratio localization length / system size tends to zero.} For the largest aggregate size we have calculated, the values we find numerically are $\\beta \\gtrsim 0.6$ in the delocalized region, $\\beta \\approx 0.5$ in the crossover region and $\\beta \\lesssim 0.4$ in the localized region of the spectra. { The value $\\beta\\approx 0.5$ corresponds to the energy region where the saturation of the IPR with the system size ceases, giving rise to extended states as shown in the bottom panel of Figure \\ref{fig:ipr}}. Due to the finite nature of the system, the crossover region is slightly extended around this value.  \n\n\n\n\n\\begin{figure}\n \\includegraphics[width=0.45\\textwidth]{Fig3a.png}\n \\includegraphics[width=0.45\\textwidth]{Fig3b.png}\n \\caption{\\label{fig:brody} Top panel: Fit of the $P(s)$ to the Brody distribution in the case of $L=40,80,150,300$ rings for different values\n of the central energy of the level window. Bottom panel: Value of $\\beta$ as a function of the renormalized state number $k/N$ for\n different lengths of cylinder. Parameters for the disorder are the same as in Fig. \\ref{fig:ipr} and are quoted in Table \\ref{table:dis}.\n The FWHM of the diagonal disorder is 210 cm$^{-1}$ while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162.22 cm$^{-1}$.}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn general, the excitonic superradiance depends on a variety of controlling parameters, such as temperature, inter-chromophore coupling, static disorder, and various forms of exciton-phonon interactions. For example, the superradiance size is quickly reduced to one with rising temperature. It was also shown that the effect of exciton-phonon coupling on the superradiance size closely resembles that of the static disorder \\cite{Meier97}.\nHere, considering only static disorder, the superradiance size is limited by two factors: 1) it cannot be larger than the localization length; and 2)\nit cannot be larger than the typical size of the nodal structure (the inverse of the absolute value of the momentum for systems with translational symmetry). In the pristine system when the states are delocalized over the entire system, the localization length is\nnot a limiting factor, and most of the {oscillator} strength is concentrated in the state with zero momentum. In the disordered\ncase as the localization length increases with energy while the nodal size decreases with energy there will be a maximum of {superradiance} when the localization length is approximately equal to the nodal size and there is a state\nwith coherence along the whole localization region. As disorder is increased the region with maximum superradiant\nsize moves to higher values of energy up to the point where disorder is so large {that} superradiance is destroyed and the oscillator strength becomes uniform in energy. In order to study superradiance we {concentrate} on the linear absorption spectrum that can be computed in the dipolar approximation through:\n{\n\n", "index": 9, "text": "\\begin{equation}\n A(\\omega)=\\sum_k d_k  \\delta(\\omega-E_k) ,\n \\label{eq:absorption}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"A(\\omega)=\\sum_{k}d_{k}\\delta(\\omega-E_{k}),\" display=\"block\"><mrow><mrow><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder><mrow><msub><mi>d</mi><mi>k</mi></msub><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ω</mi><mo>-</mo><msub><mi>E</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04728.tex", "nexttext": "\nwhere $d_k$ is the oscillator strength of excitonic state $k$}, $\\psi_k$ is the $k$ excitonic wave function, $E_k$ is the corresponding energy, { $\\ket{n}$ represents a local excitation at site $n$, $c_n^k$ is the $n$-th component of the $k$ excitonic wave function} and $\\boldsymbol{\\mu}_{n}$ is the dipole vector corresponding to the $n$ molecular dipole in the structure. We assume an isotropic distribution of chlorosomes and average over the direction of the polarization vector.\nWe show some examples of the linear absorption stick spectrum as a function of the level number for typical realizations with different disorder strengths\nin Fig. \\ref{fig:abs}.\n\n\n\n\n\n\\begin{figure}\n \\includegraphics[width=0.5\\textwidth]{Fig4.png}\n \n \n \n \\caption{\\label{fig:abs} Stick spectrum for the absorption (normalized to the maximum peak in each case) for four different values of disorder $W$, a factor multiplying the disorder parameters of Table \\ref{table:dis} (From top to bottom, $W=0$, $W=1$, $W=4$, and $W=8$). The maximum of the spectrum is moving right\n with increasing disorder. In the case of $W=8$ superradiance has been destroyed and the {oscillator} strength is distributed along all the spectrum, in this particular realization the maximum happens to be by chance closer to the top end of the spectrum.\n The FWHM of the diagonal disorder is 0 cm$^{-1}$ ($W=0$), 210 cm$^{-1}$ ($W=1$), 840 cm$^{-1}$ ($W=4$), and 1680 cm$^{-1}$ ($W=8$) while the FWHM of the nearest-neighbor coupling induced by the non-diagonal disorder is 162 cm$^{-1}$ ($W=1$), 272 cm$^{-1}$ ($W=4$), and 359 cm$^{-1}$ ($W=8$). Note that the parameter $W$ multiplies the values of the FWHM for the geometric parameters of the model which does not translate directly in the same scaling of the FWHM of the nearest-neighbor coupling.}\n\\end{figure}\n\nWe have examined how {absorption} spectra of the system and spectral statistics are related to superradiance and localization\nof the wave function.\nAs a measure of the superradiance length as a function of disorder, we have calculated the oscillator strength of\nthe highest peak. In order to measure the fragmentation, we have also calculated the minimum number of states that have a combined {oscillator} strength equal to $90\\%$ of the sum rule (we first order the states in augmenting oscillator strength and sum up to the $90\\%$ of the sum rule).\nIn Fig. \\ref{fig:superradiance} we show both these measures as a function of the strength of disorder $W$ in units of\nthe parameters of table \\ref{table:dis}. The FWHM of diagonal disorder is then $210~ W$ cm$^{-1}$ while the behavior of the non-diagonal disorder is more complicated as the FWHM of the geometric parameters of the model does not translate directly into a FWHM of the non-diagonal couplings which depend on this geometry (see caption of Fig. \\ref{fig:abs}). We can see that superradiance is important up to a disorder strength of\n$W \\sim 4$ corresponding to a FWHM of the diagonal disorder of 840 cm$^{-1}$ and to a FWHM of the nearest-neighbor coupling of 272 cm$^{-1}$. Although we have examined only a single rod model for numerical convenience, we expect the results to hold for realistic cholorosomes with many concentric rods.\n\n\n\\begin{figure}\n \\includegraphics[width=0.45\\textwidth]{Fig5.png}\n \\caption{\\label{fig:superradiance} {Oscillator} strength of the highest peak in the stick absorption spectrum in units of the sum rule and\n number of states with a combined {oscillator} strength of $90\\%$ in units of the total number of states as a function\n of disorder (defined as in the previous figure) for the case of $L=150$ rings. The result shown is the ensemble average with $1000$ realizations of\n the disorder.}\n\\end{figure}\n\n\n\n\n\n\\section{Conclusions}\n\\label{sec:conclusions}\n\nSuperradiance and supertransfer are two sides of the same coin and key to understand the fast energy transfer in chlorosomes of green sulfur bacteria. We have studied the effect of disorder in superradiance of chlorosomes of {\\em Cf.~aurantiacus} using the excitonic model developed recently by Ganapathy {\\em {et} al.} \\cite{Ganapathy09}. The dipolar long-range interaction makes disorder not very effective for localizing the excitonic states for cylindrical chlorosomes. However, using tools of Anderson localization theory and spectral statistics such as the IPR and the repulsion parameter $\\beta$ we have shown that there is a localization-delocalization crossover as a function of the excitonic energy that is seen both in the wave function statistics and in the spectral statistics. This kind of supramolecular aggregates concentrate the optical active energy region at low energies were the collective effects of the coupled molecular dipoles are most important. There is, then, a\ncompetition between localization and collectiveness (or state coherence) and the more optical active region where superradiance occurs coincides with the crossover region between localization and delocalization. The results found in this work should be applicable to other different supramolecular aggregates \\cite{Zhao00,Hu07}. These states where the absorption is largest are also the ones expected to dominate the energy transfer. The collective supertransfer effect is still important in spite of disorder and should increase dramatically the single dipole transfer rates. There has been experiments that have shown level repulsion via analysis of\nthe fluoresence spectra in J-aggregates \\cite{Malyshev07,Augulis10}. Similar experiments as a function of the size could be performed for chlorosomes to probe the level repulsion\nin the optically active region and as a consequence the localization of the wave functions with respect to the total size of the chloromeses. The results should be different in the wild type case, more disordered, than for less disordered mutants. \n\nIt would also be very interesting to extend the results obtained to the case of coupling to a thermal environment. Studying the transport and absorption properties of the one-dimensional Anderson model coupled to a bath, it has been shown that the maximal diffusion rate occurs at intermediate coupling strength \\cite{Moix13}. These results are reminiscent of our results as a function of the energy. These theoretical observations have been linked to the phenomenom of {\\em momentum rejuventation} apart from the role of dephasing in the destruction of destructive interference leading to Anderson localization \\cite{Li15}. The momentum rejuvenation occurs when classical noise counteracts the depletion of high momentum components of the wave-packet suistaining a broad momentum distribution. Realistic models, such as the one explored in this work, in the presence of a thermal bath should be explored in order to understand better the role of these general design principles \\cite{Walschaers13} in the actual behavior \nof chlorosomes as light-harvesting complexes.    \n\n\n\nThis work was supported in part by Spanish MINECO project FIS2012-34479, CSIC project I-Link0938, CAM research consortium QUITEMAD+ S2013/ICE-2801, and the Singapore National Research Foundation through the Competitive Research Programme under Project No.~NRF-CRP5-2009-04.\n\n\n\n\n\n\n\n\\begin{thebibliography}{xx}\n\n\n\\bibitem{Frigaard06} Frigaard, N.U. Bryant, D.A. in {\\it Microbiology Monographs}, ed. by J.M. Shively\n(Springer, Berlin, 2006), pp. 79-114.\n\n\\bibitem{Bryant07} Bryant, D.A. {\\em et al.} Candidatus Chloracidobacterium thermophilum: An aerobic phototrophic acidobacterium. {\\em Science} {\\bf 317}, 523-526 (2007).\n\n\\bibitem{Holzwarth90} Holzwarth, A.R., Griebenow, K., Shaffner, K. A photosynthetic antenna system which contains a protein-free chromophore aggregate. {\\em Z Naturforsch C} {\\bf 45}, 203-206 (1990).\n\n\\bibitem{Blankenship_book} R.E. Blankenship, {\\it Molecular mechanisms of photosynthesis} (Wiley-Blackwell, New York, 2002).\n\n\\bibitem{Modesto10} Modesto-Lopez, L.B., Thimsen, E.J., Collins, A.M., Blankenship, R.E., Biswas, P. Electrospray-assisted characterization and deposition of chlorosomes to fabricate a biomimetic light-harvesting device. {\\em Energy Env. Sci.} {\\bf 3} 216-222 (2010).\n\n\\bibitem{Sridharan09} Sridharan, A., Muthuswamy, J., Pizzicone, V.B. Optoelectronic energy transfer at novel biohybrid interfaces using light harvesting complexes from {\\em Chloroflexus aurantiacus}. {\\em Langmuir} {\\bf 25} 6508-6516 (2009).\n\n\\bibitem{Ganapathy09} Ganapathy, S. {\\em et al.} Alternating {\\em syn-anti} bacteriochlorophylls form concentric helical nanotubes in chlorosomes. {\\em Proc. Nac. Acad. Sci.}\n{\\bf 106} 8525-8530 (2009).\n\n\n\\bibitem{Anderson58} P.W. Anderson, Phys. Rev. Absence of Diffusion in Certain Random Latticces {\\bf 109}, 1492 (1958).\n\n\\bibitem{Mehta_Book} M.L. Mehta {\\it Random Matrices} (Academic Press, Amsterdam, 2004).\n\n\n\\bibitem{Evers08} Ferdinand Evers and Alexander D. Mirlin, Rev. Mod. Phys. {\\bf 80}, 1355 (2008).\n\n\\bibitem{Izrailev89} F. M. Izrailev, J. Phys. A 22, 865 (1989)\n\\bibitem{Izrailev90} F. M. Izrailev, Phys. Rep. 196, 299 (1990).\n\\bibitem{Casati93}  G. Casati, B. V. Chirikov, I. Guarneri, and F. M. Izrailev, Phys.\nRev. E 48, R1613 (1993).\n\\bibitem{Sorathia12} S. Sorathia, F.M. Izrailev, V.G. Zelevinsky, G.L. Celardo, Phys. Rev. E {\\bf 86}, 011142 (2012).\n\n\\bibitem{Rodriguez03} A. Rodr\\'{\\i}guez, V. A. Malyshev, G. Sierra, M. A. Mart\\'{\\i}n-Delgado, J. Rodr\\'{\\i}guez-Laguna, and F. Dom\\'{\\i}nguez-Adame, Phys. Rev. Lett. {\\bf 90}, 027404 (2003).\n\n\\bibitem{Walschaers13} M. Walschaers, J. Fernandez-de-Cossio Diaz, R. Mulet, A. Buchleitner, Phys. Rev. Lett. {\\bf 111}, 180601 (2013).\n\n\\bibitem{Dicke54} R.H. Dicke, Phys. Rev. {\\bf 93} 99 (1954).\n\n\n\\bibitem{Meier97} T. Meier, Y. Zhao, V. Chernyak, S. Mukamel, J. Chem. Phys. {\\bf 107}, 3876 (1997).\n\n\\bibitem{Zhao99} Y. Zhao, T. Meier, W.M. Zhang, V. Chernyak, S. Mukamel, J. Phys. Chem. B {\\bf 103}, 3954 (1999).\n\n\\bibitem{Celardo14} G.L. Celardo, G.G Giusteri, F. Borgonovi, Phys. Rev. B {\\bf 90}, 075113 (2014). \n\n\\bibitem{Knapp84} E. W. Knapp, Chem. Phys. {\\bf 85}, 73 (1984).\n\n\\bibitem{aggregates_book}  {\\it J Aggregates}, edited by T. Kobayashi (World Scientific, Singapore, 1996).\n\n\\bibitem{Fidder91} H. Fidder, J. Knoester, and D. A. Wiersma, J. Chem. Phys. {\\bf 95}, 7880 (1991).\n\n\\bibitem{Strek77} W. Strek, Phys. Lett. A {\\bf 62}, 315 (1977).\n\n\n\n\\bibitem{Lloyd2010} S. Lloyd, M. Mohseni, New. J. Phys. {\\bf 12}, 075020 (2010).\n\n\\bibitem{Abasto12} D.F. Abasto, M. Mohseni, S. Lloyd, P. Zanardi, Phil. Trans. R. Soc. A {\\bf 370}, 3570 (2012).\n\n\\bibitem{Huh2014} Joonsuk Huh, S. K. Saikin, J. C. Brookes, S. Valleau, T. Fujita, A. Aspuru-Guzik, J. Am. Chem. Soc. {\\bf 136}, 2048-2057 (2014). \n\n\\bibitem{Kassal2013} I. Kassal, J. Yuen-Zhou, S. Rahimi-Keshari, J. Phys. Chem. Lett, {\\bf 4}, 362 (2013).\n\n\\bibitem{Didraga02} C. Didraga, J.A. Klugkist, J. Knoester, J. Phys. Chem. B {\\bf 106}, 11474 (2002).\n\n\\bibitem{Didraga04} C. Didraga, J. Knoester, J. Chem. Phys. {\\bf 121}, 10687 (2004).\n\n\\bibitem{Fujita12} T. Fujita, J. C. Brookes, S.K. Saikin, A. Aspuru-Guzik, J. Phys. Chem. Lett. {\\bf 3}, 2357 (2012).\n\n\\bibitem{Yejun12} J.~Ye {\\it et al.}, J.~Chem.~Phys.~{\\bf 136}, 245104 (2012).\n\n\\bibitem{Moix13} J.M. Moix, M. Khasin, J. Cao, New. J. Phys. {\\bf 15}, 085010 (2013).\n\n\\bibitem{Prokhorenko00} V.I.~Prokhorenko, D.B.~Steensgaard, and A.R.~Holzwarth {\\em Biophys. J.} {\\bf 79}, 2105 (2000).\n\n\\bibitem{Holzdata} The structural parameters are slightly updated. Data provided by Holzwarth A.R. in private communication.\n\n\\bibitem{Prokhorenko03} Prokhorenko, V.I., Steensgaard, D.B., and Holzwarth A.R. .  {\\em Biophys. J.} {\\bf 85}, 3173 (2003).\n\n\\bibitem{Oostergetel10} Oostergetel, G. T., van Amerongen, H., Boekema, E.J. The chlorosome: a prototype for efficient light harvesting in photosynthesis {\\em Photosynthesis Research} (2010).\n\n\\bibitem{Czikklely70} Czikklely V., Forsterling, H., Kuhn, H. {\\em Chem. Phys. Lett.} {\\bf 6}, 207 (1970).\n\n\\bibitem{Christandl05} M. Christandl, N. Datta, T.C. Dorlas, A. Ekert, A. Kay, A.J. Landahl, Phys. Rev. A {\\bf 71}, 032312 (2005).\n\n\\bibitem{Kay06} A. Kay, Phys. Rev. A {\\bf 73}, 032306 (2006).\n\n\\bibitem{Zech13} T. Zech, M. Waschaers, T. Scholak, R. Mulet, T. Wellens, A. Buchleitner, Fluct. Noise Lett. {\\bf 12}, 1340007 (2013).\n\n\\bibitem{Bell70} R.J. Bell, P. Dean, Discuss. Farady Soc. {\\bf 50}, 55 (1970).\n\n\\bibitem{Augulis10} R. Augulis, A.V. Malyshev, V.A. Malyshev, A. Pug\\v{z}lys, J. Knoester, P.H.M. van Loosdrecht, J. Phys. Chem. Lett. {\\bf 1}, 2911 (2010).\n\n\\bibitem{Brody73} T.A. Brody, Lett. Nuovo Cimento {\\bf 7}, 482 (1973).\n\n\\bibitem{Wilkinson91} M. Wilkinson, M. Feingold, L.T. Leitner J. Phys. A: Math. Gen. {\\bf 14}, 175 (1991).\n\n\\bibitem{Molina01} R.A. Molina, J.M.G. G\\'omez, J. Retamosa, Phys. Rev. C {\\bf 63}, 014311 (2000).\n\n\\bibitem{Flores13} J. Flores et al. EPL {\\bf 101} 67002 (2013).\n\n\\bibitem{Frisch14} Frisch {\\em et al.}, Nature (London) {\\bf 507}, 475 (2014).\n\n\\bibitem{Mur15} J. Mur-Petit, R.A. Molina, Phys. Rev. E {\\bf 92}, 042906 (2015).\n\n\\bibitem{Haake_book} F. Haake {\\it Quantum signatures of chaos} (Springer, Berlin, 2001).\n\n\\bibitem{Gomez02} J.M.G. G\\'omez, R.A. Molina, A. Rela\\~no, J. Retamosa, Phys. Rev. E {\\bf 66}, 036209 (2002).\n\n\\bibitem{Zhao00} Y. Zhao, G. Chen, and L. Yu, J. Chem. Phys. {\\bf 113}, 6502 (2000).\n\n\\bibitem{Hu07} L. Hu, Y. Zhao, F. Wang,  G. Chen, C. Ma, W. Kwok, D. Philips, J. Phys. Chem.~B {\\bf 111}, 11812 (2007).\n\n\\bibitem{Malyshev07} A.V. Malyshev, V.A. Malyshev, J. Knoester, Phys. Rev. Lett. {\\bf 98}, 087401 (2007).\n\n\\bibitem{Li15} Y. Li, F. Carusso, E. Gauger, S.C. Benjamin, New. J. Phys. {\\bf 17}, 013057 (2015).\n\n\n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 26806, "prevtext": "\n\n", "index": 11, "text": "\\begin{equation}\nd_k=\\left| \\sum_n \\braket{n|\\psi_k} \\boldsymbol{\\mu}_{n}  \\right|^2=\\sum_{n,m} (c^{k}_n)^* c^k_m  ~\\boldsymbol{\\mu}_{n}  \\cdot \\boldsymbol{\\mu}_{m}\n \\label{eq:osc}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"d_{k}=\\left|\\sum_{n}\\lx@braket@V{n}{\\psi_{k}}\\bm{\\mu}_{n}\\right|^{2}=\\sum_{n,m%&#10;}(c^{k}_{n})^{*}c^{k}_{m}~{}\\bm{\\mu}_{n}\\cdot\\bm{\\mu}_{m}\" display=\"block\"><mrow><msub><mi>d</mi><mi>k</mi></msub><mo>=</mo><msup><mrow><mo>|</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><mrow><mo stretchy=\"false\">⟨</mo><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><msub><mi>ψ</mi><mi>k</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><msub><mi>𝝁</mi><mi>n</mi></msub></mrow></mrow><mo>|</mo></mrow><mn>2</mn></msup><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></munder><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>c</mi><mi>n</mi><mi>k</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>*</mo></msup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msubsup><mi>c</mi><mi>m</mi><mi>k</mi></msubsup></mpadded><mo>⁢</mo><msub><mi>𝝁</mi><mi>n</mi></msub></mrow><mo>⋅</mo><msub><mi>𝝁</mi><mi>m</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}]