[{"file": "1601.08235.tex", "nexttext": "\n\nThe spin-2 and spin-0 pieces here are antisymmetric in at least\ntwo indices. Requiring overall symmetrization will reduce the\nexpansion to a fully symmetric spin-3 part $T_{(ijk)}$ and a\nsymmetric spin-1 part $T^{\\prime}_{ijk} = \\delta_{(ij}T_{k)}$.\nThus, we can understand connection between the allowed constraints\nand how they will involve traces of the curls of $A$ by\nconsidering which parts of the tensor representation are\nsymmetric.\n\nHowever, as was noted previously, gauge structure is not enough to\nguarantee the gaplessness of the photon.  In 2+1d this manifests\nas the so-called ``instanton effect'', which is to say that the\nmagnetic flux insertion operator is always relevant at the\nGaussian fixed point. Thus, the instantons proliferate and open a\ngap for the photons. Thus in general in our $(3+1)d$ ABLs, we need\nto argue that all of the vertex operators that generically take\nthe form $\\cos\\left(2\\pi N h_{\\alpha\\beta...}\\right)$ for the dual\ngauge field $h$ are irrelevant.\n\n\\section{Examples}\n\nIn this section we will discuss a few examples of new ABL phases.\nThe first example is similar to the graviton theories detailed in\nthe previous section, except that it has a different local\nconstraint. This is an interesting property of rank-$n$ theories\nfor $n \\geq 2$ which greatly enhances the variety of gapless gauge\ntheories. There are roughly $n$ different constraints involving\nonly derivatives for a given rank-$n$ theory in addition to the\nvarious types of traceless conditions.\n\nThe original graviton model had as its local constraint\nEq.~\\ref{lc2}.  We can instead contract another derivative on\n$E_{ij}$ to get a different theory: \\begin{eqnarray} \\label{lc4}\n\\partial_i \\partial_j E_{ij} = 0\n\\end{eqnarray} Compared to the theory governed by Eq.~\\ref{lc2}, this\ntheory has a scalar (as opposed to vector) charge and has five\ntotal degrees of freedom (up from three).  Even before determining\nthe simplest possible Hamiltonian, we see that the gapless\nexcitations are distinct in character from the original gravitons:\n\\begin{eqnarray} A_{ij} \\rightarrow A_{ij} + \\partial_i\\partial_j \\lambda\n\\end{eqnarray}\n\n\n\n\n\n\n\n\n\n\nWe can construct the Hamiltonian of this ABL state using the\nfollowing symmetrized gauge invariant tensor field $B$: \\begin{eqnarray}\n\\label{b3} B_{ij} = \\frac{1}{2}\\left(\\epsilon_{iab}\\partial_a\nA_{bj} + \\epsilon_{jcd}\\partial_c A_{id}\\right). \\end{eqnarray} The\ncorresponding low energy Hamiltonian again takes the schematic\nform of $E^2 + B^2$, as before, and this theory is again\nself-dual, but it now has a linear dispersion $\\omega \\sim k$.\n\nWe can also consider enforcing the constraint Eq. (\\ref{lc3}) in\naddition to Eq. (\\ref{lc4}).  However, in this case, $B_{ij}$\ngiven by Eq. (\\ref{b3}) is already invariant under both gauge\ntransformations.  In fact, in conjunction with the graviton theory\ndiscussed previously, we have now characterized \\textit{all}\nrank-2 symmetric gauge theories whose gauge transformations\nsatisfy our criteria above.\n\n\n\n\n\n\n\n\n\n\n\nWhile the rank-1 and rank-2 systems have nice interpretations as\n``photons\" and ``gravitons\" due to the familiarity with known\nsystems, there is no such nice identification for the rank-3 case.\nWe cannot leverage any analogy to linearized gravity nor\nelectromagnetism, and instead we will proceed using our general\nmethod.\n\n\n\n\n\n\n\n\nTo illustrate this case, we consider two canonically conjugate\nsymmetric rank-3 tensor fields $A_{ijk}$ and $E_{ijk}$ where $A$\nis defined modulo $2\\pi$.  We then impose the local constraint\n\\begin{eqnarray} \\label{lc5}\n\\partial_i E_{ijk} = 0\n\\end{eqnarray} which generates the gauge transformation \\begin{eqnarray} \\label{gt3} A_{ijk}\n\\rightarrow A_{ijk} + \\partial_{(i}\\lambda_{jk)} \\end{eqnarray} The\ncorresponding lattice system is given in the appendix.  As before,\nwe seek a ``magnetic'' field that is gauge-invariant and of lowest\nnumber of derivatives of $A$.  Additionally, it should be\nsymmetric.  We see that \\begin{eqnarray} B_{ijk} =\n\\epsilon_{iab}\\epsilon_{jcd}\\epsilon_{kef}\\partial_a\\partial_c\\partial_e\nA_{bdf} \\label{B-rank3}\\end{eqnarray} is the simplest tensor that fits the\nrequirements. From this tensor we can construct a state with the\nfollowing low energy effective Hamiltonian \\begin{eqnarray} H = U\\sum_r E^2 +\nK\\sum_r B^2, \\end{eqnarray} where the coefficients of the $\\sum X_{iii}^2$,\n$\\sum X_{iij}^2$, and $\\sum X_{ijk}^2$ terms may in general be\ndifferent.  This system is self-dual in the same way as before, by\ndefining the dual variable $h_{ijk}$ as \\begin{eqnarray} E_{ijk} =\n\\epsilon_{iab}\\epsilon_{jcd}\\epsilon_{kef}\\partial_a\\partial_c\\partial_e\nh_{bdf} \\end{eqnarray} and requiring that $h_{ijk}$ transform in the same\nway as $A_{ijk}$ under a change of gauge.  The vertex operators of\nthe dual variables $\\cos\\left(2\\pi N h_{ijk}\\right)$ are easily\nseen to be gauge dependent, and thus irrelevant in the same way as\nbefore.  This is a new gapless Bose liquid with $\\omega \\sim k^3$\nwith four independent modes for each momentum $\\vec{k}$.\n\nWe can then ask what happens when another local constraint is\nimposed.\n\n", "itemtype": "equation", "pos": 22440, "prevtext": "\n\n\\title{Stable Gapless Bose Liquid Phases without Any Symmetry}\n\n\\date{\\today}\n\n\\author{Alex Rasmussen}\n\n\\author{Yi-Zhuang You}\n\n\\author{Cenke Xu}\n\n\\affiliation{Department of physics, University of California,\nSanta Barbara, CA 93106, USA}\n\n\\begin{abstract}\n\nIt is well-known that a stable algebraic spin liquid state (or\nequivalently an algebraic Bose liquid (ABL) state) with emergent\ngapless photon excitations can exist in quantum spin ice\nsystems~\\cite{PhysRevB.69.064404,wen2003,spinice1,spinice6,slbalents,spinice2,spinice3,spinice4,spinice5},\nor in a quantum dimer model on a bipartite $3d$\nlattice~\\cite{sondhiphoton}. This photon phase is stable against\nany weak perturbation without assuming any symmetry. Further works\nconcluded that certain lattice models give rise to more exotic\nstable algebraic Bose liquid phases with graviton-like\nexcitations~\\cite{2006cond.mat..2443X,guwen1,PhysRevB.74.224433,guwen2,PhysRevD.81.104033}.\nIn this paper we will show how these algebraic Bose liquid states\ncan be generalized to stable phases with even more exotic types of\ngapless excitations and then argue that these new phases are\nstable against weak perturbations. We also explicitly show that\nthese theories have an (algebraic) topological ground state\ndegeneracy on a torus, and construct the corresponding topological\ninvariants.\n\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\nIt is now well-known that quantum disordered states of many-body\nsystems can be fundamentally different from classical disordered\nstates. Without assuming any symmetry, there is simply one type of\ntrivial classical state, but there can be many stable quantum\ndisordered states. Many of these nontrivial quantum disordered\nphases have a gapped spectrum and topological degeneracy on a\nmanifold with nontrivial\ntopology~\\cite{wentopo1,wentopo2,wentopo3}, such as fractional\nquantum Hall states. In this paper we consider another kind of\nstable quantum disordered phases without assuming any symmetry.\nThese states are characterized by their bulk gapless bosonic modes\nthat {\\it cannot} be interpreted as Goldstone modes. Furthermore,\nphysical quantities have power-law (or algebraic) correlations\ninstead of short-range correlations found in gapped systems.\n\n\n\n\n\n\n\n\n\n\nAlthough such gapless states are not rare at all in condensed\nmatter systems, they usually occur at quantum critical points and\nare protected by certain symmetries. Generically, we would expect\nthere to be relevant perturbations that will open the gap in these\ncritical states. But the examples we will discuss in this paper\nall have very stable gapless bosonic modes, which are invulnerable\nto any weak perturbations.\n\n\n\n\n\nThus, to establish that an algebraic Bose liquid (ABL) phase is\nstable, we must show that \\textit{all} potential gap-opening\nperturbations are irrelevant at the IR fixed point of the ABL\nphase. Drawing intuition from the $(2+1)d$ compact lattice U(1)\ngauge field, we must demonstrate not only a direct mass term of\nthese gapless modes are forbidden, but also that the space-time\ntopological defects in the dual picture must also be suppressed\n(or irrelevant).\n\n\n\n\n\n\n\n\n\n\n\n\n\nA few examples of this type of states are already known. In\nRef~\\onlinecite{PhysRevB.69.064404,wen2003,sondhiphoton} a stable\nABL phase with photon like excitations were proposed, and it has\nattracted great interests~\\cite{spinice1,spinice6,slbalents}. So\nfar compelling experimental evidences for such liquid states have\nbeen found~\\cite{spinice2,spinice3,spinice4,spinice5}. Later, a\ndifferent type of ABL phase with graviton like excitation was\nstudied in\nRef.~\\onlinecite{2006cond.mat..2443X,guwen1,PhysRevB.74.224433}.\nIt turns out that the graviton-ABL state has a close cousin with a\ndifferent dispersion\nrelation~\\onlinecite{guwen2,PhysRevD.81.104033}. So far these are\nthe only three types of known stable ABL states with emergent\ngapless bosonic excitations without assuming any symmetry. The\nBose metal phase proposed in\nRef.~\\onlinecite{balentsfisher,xufisher} rely on a special quasi\none dimensional conservation, which is different from the\nscenarios we will focus on.\n\nIn this work, we expand these ideas even further, demonstrating\nthat there are an infinite number of gapless phases that fit into\nthis class of states. We provide several examples of these\nso-called ``higher-rank\" ABL theories. We also investigate the\ntopological properties of these models, showing that they are\n``topologically ordered\" in the same sense as the photon and\ngraviton theories, even though they are gapless in the bulk. At\nfinite system size $L$, the emergent gauge bosons will lead to an\nenergy splitting between different sectors that scales as a power\nlaw of $1/L$.\n\n\n\n\n\\section{Review of Rank-1 and -2 Theories}\n\n\\subsection{The Rank-1 Case}\n\nWe first review the essential facts about the well-known $U(1)$\nphoton ABL phase in $3+1d$. In order to connect to the more\ngeneral construction, we will address the problem from a somewhat\ndifferent (but physically equivalent) viewpoint than the original\nworks~\\cite{PhysRevB.69.064404,wen2003,sondhiphoton}. The gauge\nstructure (and its duality) is of paramount importance, so we will\nomit some details in favor of a more easily generalizable\nprocedure. For simplicity, we will consider the cubic lattice,\nwhere spins are defined on the links, i.e. the corner-sharing\noctahedra. The most important term of the Hamiltonian is simply an\nIsing antiferromagnetic interaction on each octahedron: \\begin{eqnarray} H =\n\\frac{J}{2}\\sum_{oct} (S^z_{oct})^2, \\label{J}\\end{eqnarray} With a very\nlarge $J$, this term will give rise to a locally conserved\n$z$-component of spin, which we will enforce as a constraint on\nthe low energy Hilbert space: \\begin{eqnarray} \\sum_{i \\in oct}S^z_i = 0.\n\\label{constraint}\\end{eqnarray} There are certainly other terms on the\nlattice that involve $S^{\\pm}$, but their specific forms are not\nimportant, as long as they are all dominated by the $J$ term.\nUnder the standard change of variables $S^z \\sim n - 1/2$ and\n$S^\\pm \\sim e^{\\pm i\\theta}$, this model becomes a boson rotor\nmodel on the links of a cubic lattice. Noting that the locally\nconserved integer $S_{oct}^z$ generates a $U(1)$ gauge symmetry,\nafter we change variables again to $E_{rr'}\\sim (-1)^r n_{rr'}$\nand $A_{rr'} \\sim (-1)^r \\theta_{rr'}$. Note that $A_{rr'}$ is\nonly defined modulo $2\\pi$.\n\nThe operators $E$ and $A$ are defined on the links of the lattice,\nand this endows them with a vector structure.  We can thus\nidentify a vector of operators $\\textbf{E}(\\vec{x})$ and\n$\\textbf{A}(\\vec{x})$ at each site of the cubic lattice, along\nwith lattice derivatives $\\partial_i E_j(\\vec{x}) =\nE_j(\\vec{x}+\\hat{i}) - E_j(\\vec{x})$. They satisfy the normal\ncommutation relations $[A_j(\\vec{x}), \\ E_k(\\vec{y})] =\ni\\delta_{jk}\\delta^3(\\vec{x} - \\vec{y})$.  When phrased in terms\nof these new variables, the low energy effective Hamiltonian is\nbound to take the following form: \\begin{eqnarray} H =\nU\\sum_{r}\\textbf{E}(r)^2 -\nK\\sum_{\\Box}\\cos[\\text{curl}(\\textbf{A})_{\\Box}] \\end{eqnarray} Once we\nproject all the physics down to the low energy subspace of the\nHilbert space that obeys the constraint imposed by the $J$ term,\nthe low energy effective Hamiltonian must have the gauge symmetry\n$\\textbf{A} \\rightarrow \\textbf{A} + \\mathbf{\\nabla} f$, which is\ngenerated by the local constraint which can now be written as\n\\begin{eqnarray} \\label{lc1}\n\\partial_i E_i = 0. \\end{eqnarray}\n\nTentatively ignoring the fact that $\\textbf{A}$ is compactly\ndefined, we can expand the low energy effective Hamiltonian at the\nminimum of the cosine function (spin wave expansion): \\begin{eqnarray}\n\\label{h1} H = U\\sum_r E_i^2 + \\frac{K}{2} \\sum_r\n(\\epsilon_{ijk}\\partial_j A_k)^2 \\end{eqnarray} Equation (\\ref{h1}) is the\neffective low energy Hamiltonian for $(3+1)d$ quantum\nelectrodynamics (QED) in its deconfined phase. Solving the\nequation of motion of Eq.~\\ref{h1} from the Heisenberg equation\ndirectly, we will obtain a gapless photon excitation with linear\ndispersion relation $\\omega \\sim c |\\vec{k}|$, where the speed of\nlight $c \\sim \\sqrt{UK}$. However, we know that in $2+1d$, the\ncompact QED suffers from the instanton effect: proliferation of\nmagnetic monopoles in the space time opens up the photon gap, but\nthat effect is only made clear in terms of the dual variables.\nThus, we will also consider the dual theory to ascertain if there\nis a similar gap-opening effect.\n\nWe see that the solution of $E_i$ to the local constraint\nEq.~\\ref{lc1} can be written as the curl of another vector field\n$h_i$, $E_i = \\epsilon_{ijk}\\partial_j h_k$. This new field $h_i$\nis defined on each plaquette center and it is canonically\nconjugate to the magnetic field $B_i$. We can now rewrite the\nHamiltonian Eq.~\\ref{h1} as \\begin{eqnarray} \\label{dh1} H = U\\sum_r\n(\\epsilon_{ijk}\\partial_j h_k)^2 + \\frac{K}{2} \\sum_r B_i^2 \\end{eqnarray}\n\nIn contrast to the $2+1d$ case, this new Hamiltonian has the same\nform as the original Eq. (\\ref{h1}), and formally $h_i$ has the\nsame gauge symmetry as $A_i$: \\begin{eqnarray} h_i \\rightarrow h_i + \\nabla_i\nf. \\label{dualgauge} \\end{eqnarray} We thus say that the system (at least\nin the photon phase) is \\textit{self-dual}. This is an emergent\nfeature in the infrared.\n\nIn the dual theory, we might expect relevant ``vertex operators\"\n$\\alpha \\cos(2\\pi N h_i)$, whose analogue in $(2+1)d$ plays the\nrole of the flux creation. In $(3+1)d$, this vertex operator\ncorresponds to hopping of the magnetic monopole of the compact\nU(1) gauge field. Whether this vertex operator is important or\nnot, can be determined by evaluating its correlation function in\nthe limit where $\\alpha = 0$. However, in $(3+1)d$, the\ncorrelation function between two such terms in the limit $\\alpha =\n0$ is \\begin{eqnarray} \\langle \\cos(2\\pi N h_i(\\vec{x})) \\ \\cos(2\\pi N\nh_j(\\vec{y}))\\rangle_0 \\sim \\delta_{ij}\\delta^3(\\vec{x} -\n\\vec{y}), \\end{eqnarray} because this is not a gauge invariant correlation\nfunction under gauge transformation Eq.~\\ref{dualgauge}. Thus at\nthe Gaussian fixed point, the vertex operators cos$(2\\pi N h_i)$\nare irrelevant - at least perturbatively. When the vertex operator\nis strong enough, it will induce magnetic monopole condensation\nand drive the system into the confined phase. Thus, the gapless\nphoton is perturbatively protected by the gauge symmetry of both\nthe original and the dual theory, i.e. the self-duality protects\nthe stability of the photon phase.\n\nOur review in this subsection is no more than restating the known\nfact that the $(3+1)d$ compact U(1) gauge field has a deconfined\nphase, which corresponds to the phase where neither the charge nor\nthe magnetic monopole condenses. In this subsection, we identified\nthe photon phase where the magnetic monopole is gapped as the\nphase where the vertex operator is irrelevant. The language and\nlogic used in this subsection can be conveniently generalized to\nother ABL phases.\n\n\n\\subsection{The Rank-2 Case}\n\nIn this section we will review the construction of another ABL\nphase with rank-2 tensor gapless bosonic excitations that are\nanalogous to gravitons. We will omit the exact details of the\nmicroscopic derivation; interested readers are referred to the\noriginal papers\nRef.~\\onlinecite{2006cond.mat..2443X,PhysRevB.74.224433}.\n\nThe $3+1d$ microscopics in this system give rise to a symmetric\nrank-2 tensor field, in contrast to the rank-1 tensor field in the\nprevious example.  Once again, the system can be simply phrased in\nterms of the boson number $n_{ij}$ and its canonical conjugate\nphase variables $\\theta_{ij}$. We can again define gauge field\nvariables $E_{ij} \\sim n_{ij}$ ($i \\neq j$), $E_{ii} \\sim\n2n_{ii}$, and $A_{ij} \\sim \\theta_{ij}$, noting that $A_{ij}$ is\ncompactly defined with modulo $2\\pi$.\n\nThe low-energy subspace has the local constraint\\begin{eqnarray} \\label{lc2}\n\\partial_i E_{ij} = 0, \\end{eqnarray} which is imposed by a large local\nterm similar to Eq.~\\ref{J}. This constraint generates the gauge\ntransformation \\begin{eqnarray} A_{ij} \\rightarrow A_{ij} +\n\\frac{1}{2}\\left(\\partial_i \\lambda_j + \\partial_j\n\\lambda_i\\right) \\end{eqnarray} This gauge transformation is the same as\nthat of linearized gravity, if we were to treat $A_{ij}$ as the\nfluctuation of a background metric $\\eta_{ij}$.  Hence, we term\nthe gauge boson a ``graviton\". The original\nworks~\\cite{2006cond.mat..2443X,PhysRevB.74.224433} use the\nlanguage of general relativity to write the Hamiltonian in terms\nof the curvature tensor for $A_{ij}$.  We will avoid that notation\nhere while noting that it has very nice connections to the\nLifshitz gravity proposed independently in\nRef.~\\onlinecite{horava2008,horava2009,horava2009a}.\n\nWe want to establish the simplest Hamiltonian possible that is\ngauge-invariant.  To do this, we will again write down a\ngauge-invariant quantity $B_{ij}$ which should be thought of as\nthe ``2-curl\" of $A_{ij}$: \\begin{eqnarray} \\label{b2} B_{ij} =\n\\epsilon_{iab}\\epsilon_{jcd}\\partial_a\\partial_c A_{bd}\\end{eqnarray}\n\nThe low energy effective Hamiltonian, or the Hamiltonian after the\n``spin-wave expansion\", then takes the simple form \\begin{eqnarray} H =\nU\\sum_r E_{ij}^2 + K\\sum_r B_{ij}^2,\\end{eqnarray} where $U$ and $K$ may,\nin general, take different values for the $\\sum_{ij}X_{ij}^2$ and\n$\\sum_i X_{ii}^2$ terms, if an ordinary cubic lattice symmetry is\nassumed; however, lattice symmetry is not essential to our work\nhere.\n\nThe spin-wave expanded Hamiltonian above already gave us a gapless\n``graviton-like\" bosonic mode with a quadratic dispersion. In\norder to guarantee that this gapless mode is not ruined by the\ncompactness of the gauge field, we must once again consider the\ndual theory. The dual variables solve the constraint equation\n(\\ref{lc2}), and we can write $E$ as the 2-curl of a new field\n$h$: \\begin{eqnarray} E_{ij} =\n\\epsilon_{iab}\\epsilon_{jcd}\\partial_a\\partial_c h_{bd}. \\end{eqnarray} We\nsee that $h$ transforms under the same gauge transformation as\ntensor $A$ and is canonically conjugate to the tensor field\n$B$~\\cite{2006cond.mat..2443X,PhysRevB.74.224433}. The vertex\noperators will take the form $\\cos(2\\pi N h_{ij})$, and just as\nbefore the gauge-dependence makes them irrelevant at the infrared\nGaussian fixed point because it violates the gauge symmetry of the\nGaussian fixed point field theory. This will once again guarantee\nthe gaplessness of the graviton mode, and we see from the above\nHamiltonian that $\\omega \\sim k^2$.\n\n\\subsection{Additional constraints}\n\nFor $n \\geq 2$, the rank-$n$ theories have additional structure\nbecause they can accommodate several types of local constraints.\nInterestingly, we can also enforce more than one local constraint\nsimultaneously.  For example, we can take the above theory and\nadditionally require that \\begin{eqnarray} \\label{lc3} E = \\sum_i E_{ii} = 0\n\\end{eqnarray} This generates the gauge transformation \\begin{eqnarray} A_{ij}\n\\rightarrow A_{ij} + \\delta_{ij}\\lambda \\end{eqnarray} We now ask a\nmodified question - what is the simplest theory that is invariant\nunder the gauge transformations generated by constraints\n(\\ref{lc2}) and (\\ref{lc3}) simultaneously?  We see that our\ndefinition of $B_{ij}$ in Eq. (\\ref{b2}) is not good enough.\nHowever, we can use the quantity $B = \\sum_i B_{ii}$ to define a\nnew tensor: \\begin{eqnarray} \\label{q2} Q_{ij} = \\epsilon_{ikl}\\left(B_{jl} -\n\\frac{1}{2}\\delta_{jl}B\\right), \\end{eqnarray} which is invariant under\nboth gauge transformations.  The new effective low energy\nHamiltonian is now~\\cite{PhysRevD.81.104033}: \\begin{eqnarray} H = U\\sum_r\nE_{ij}^2 + K\\sum_r Q_{ij}^2. \\label{z3}\\end{eqnarray} The new dual fields\nare defined in the same way, where $E$ and $h$ have the same\nfunctional relation as $Q$ and $A$~\\cite{PhysRevD.81.104033}. Thus\nthis theory is again ``self-dual\" with identical gauge symmetries\non the two sides of the duality. This theory (Eq.~\\ref{z3}) is\nagain gapless, though it has a different dispersion: because there\nare now three spatial derivatives of $A$ in the $Q$ tensor\nEq.~\\ref{q2}, the dispersion of the low energy excitation is\n$\\omega \\sim k^3$.\n\n\\section{General Procedure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo generalize these arguments to higher rank tensor fields, we\nneed to first establish which types of gauge transformations will\nbe allowed. To simplify our discussion, we want the field theory\nto be rotationally symmetric, though it is possible that the\nlattice regularization may possess irrelevant rotation-breaking\nterms. Additionally, the gauge constraint should depend only on\n$E_{ijk...}$ and no other locally defined tensor fields.\n\nThese two requirements restrict the constraints that we will\nconsider to higher-dimensional versions of the Gauss law and\ntraceless conditions.  These constraints are ``rotationally\"\nsymmetric in the correct way to respect lattice symmetries (again,\nwe stress that the states we construct should be insensitive to\nweak lattice symmetry breaking). We enumerate the allowed gauge\ntransformations in Table 1 for rank one through three.  To\nsimplify notation, we denote the symmetrizing operation\n\n\\begin{eqnarray}\nT_{(ijk)} = \\frac{1}{3!}\\left(T_{ijk} + T_{jik} + sym\\right)\n\\end{eqnarray}\n\n\\begin{center}\n\\begin{table}\n\\begin{tabular}{| l | l | l |}\n\\hline\nRank of theory & Local constraint & Gauge transformation \\\\ \\hline\n\\multirow{1}{*}{$n=1$} & $\\partial_i E_i = 0$ & $A_i \\rightarrow A_i + \\partial_i \\lambda$ \\\\ \\hline\n\n\\multirow{3}{*}{$n=2$} & $\\partial_i E_{ij} = 0$ & $A_{ij} \\rightarrow A_{ij} + \\partial_{(i}\\lambda_{j)}$ \\\\\n& $\\partial_i \\partial_j E_{ij} = 0$ & $A_{ij} \\rightarrow A_{ij} + \\partial_i \\partial_j \\lambda$ \\\\\n& $E_{ii} = 0$ & $A_{ij} \\rightarrow A_{ij} + \\delta_{ij}\\lambda$ \\\\ \\hline\n\n\\multirow{5}{*}{$n=3$} & $\\partial_i E_{ijk} = 0$ & $A_{ijk} \\rightarrow A_{ijk} + \\partial_{(i}\\lambda_{jk)}$* \\\\\n& $\\partial_i \\partial_j E_{ijk} = 0$ & $A_{ijk} \\rightarrow A_{ijk} + \\partial_{(i}\\partial_j\\lambda_{k)}$ \\\\\n& $\\partial_i \\partial_j \\partial_k E_{ijk} = 0$ & $A_{ijk} \\rightarrow A_{ijk} + \\partial_i\\partial_j\\partial_k\\lambda$ \\\\\n& $\\delta_{ij} E_{ijk} = 0$ & $A_{ijk} \\rightarrow A_{ijk} + \\delta_{(ij}\\lambda_{k)}$* \\\\\n& $\\delta_{ij}\\partial_k E_{ijk} = 0$ & $A_{ijk} \\rightarrow A_{ijk} + \\delta_{(ij}\\partial_{k)}\\lambda$ \\\\ \\hline\n\n\\end{tabular}\n\\caption{Allowed gauge transformations which are rotationally invariant and do not depend on an auxiliary tensor field.\\\\\n* These gauge transformations are not totally independent - $\\lambda_{jk}$ should be made traceless.}\n\\end{table}\n\\end{center}\n\nAn important generic question is the number of gapless modes in\nthe system. This is determined by switching to a Lagrangian\nformulation and thinking of the $\\lambda$ tensor as a Lagrange\nmultiplier. Each degree of freedom of $\\lambda$ will reduce the\nnumber of gapless modes by one (though there is a subtlety to this\ncounting, which is detailed in the appendix). For example, for the\nfamiliar photon phase, \\begin{eqnarray} L_1 = E^2 - B^2 + \\lambda(\\partial_i\nE_i). \\end{eqnarray} $E_i$ has three components initially, so the one free\ncomponent of a scalar $\\lambda$ reduces the number of gapless\nmodes to the familiar two of the photon. For higher rank cases,\nthough it quickly becomes tedious to count the number of free\ncomponents of an arbitrary rank symmetric tensor, the idea is\nstraightforward. Indeed, it is also possible to diagonalize the\nHamiltonian directly, and this reproduces the previous results.\n\nThe essential component of many ABL theories is the process by\nwhich gap-opening perturbations are prohibited.  Generically, any\nrelevant term in the Lagrangian should open a gap, and so to\neliminate \\textit{all} such terms places strict requirements on\nthe theory. In the theories we consider in this paper, we use\ngauge-invariance and self-duality to protect the photon gap from\nperturbations at a Gaussian IR fixed point, just like the examples\nreviewed in the previous section.\n\nThe gauge structure in all of the theories we consider is emergent\nin the IR. Indeed, it is due to a constraint on the low-energy\nHilbert space of the microscopic model. This means that the\ngapless phase is not stable to arbitrarily strong perturbations,\nsince moving out of the constrained subspace generically destroys\nthe gauge structure. As an example, consider the gauge charge\nexcitation in the rank-1 theory. The low-energy subspace is that\nof the charge vacuum, but if we tune the charge gap to zero, the\ngauge charges condense and gap out the gauge boson through the\nHiggs mechanism.\n\nAdditionally, the gauge structure will constrain the form of the\nHamiltonian. As we have seen above, we want to use $A$ to\nconstruct two gauge-invariant tensors $E$ and $B$ which play the\nusual roles in electromagnetism. Given that there is a direct\nrelation between the gauge transformations on $A$ and the\nconstraints on $E$, it is a straightforward task to build the most\nrelevant terms. In this case, ``most relevant'' means that $B$ has\nthe fewest number of spatial derivatives of $A$, but it must be\ngauge invariant still.\n\n\n\n\nJust to limit the variety of states, we require rotational\ninvariance in this paper, which also constrains the form of the\nHamiltonian (as does gauge invariance). But we want to stress that\nweakly breaking the rotational invariance will not destroy the\nstates we construct, namely it will not gap out the bosonic modes\nof the ABL phase. For example, the low energy photon excitations\nof the ABL phase studied in\n~\\onlinecite{PhysRevB.69.064404,wen2003,sondhiphoton} have a\nrotational invariant dispersion at low energy, but we know that\nbreaking the rotational invariance will not destroy the photon\nexcitations. The local gauge constraints are similarly influenced\nby the requirement of rotational invariance, as was noted above.\nWe can then consider tensor representations of rotational group\n$SO(3)$, and it turns out that we will only be interested in the\nsymmetric pieces.\n\nFor example, to construct the gauge invariant rank-3 magnetic\nfield $Q_{ijk}$ with both a derivative constraint and a trace\nconstraint on $E_{ijk}$, the resulting theories will involve\n$B_{ijk}$ which is a 3-curl of $A$ and $B_k = B_{iik}$. Because\n$Q_{ijk}$ carries three vector indices, it can be constructed with\nthree vector representation of $SO(3)$. The standard expansion of\na tensor defined over three copies of the fundamental\nrepresentation of $SO(3)$ is\n\n\n", "index": 1, "text": "$$1 \\otimes 1 \\otimes 1 = 3 \\oplus 2 \\oplus 2 \\oplus 1 \\oplus 1 \\oplus 1 \\oplus 0$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"1\\otimes 1\\otimes 1=3\\oplus 2\\oplus 2\\oplus 1\\oplus 1\\oplus 1\\oplus 0\" display=\"block\"><mrow><mrow><mn>1</mn><mo>⊗</mo><mn>1</mn><mo>⊗</mo><mn>1</mn></mrow><mo>=</mo><mrow><mn>3</mn><mo>⊕</mo><mn>2</mn><mo>⊕</mo><mn>2</mn><mo>⊕</mo><mn>1</mn><mo>⊕</mo><mn>1</mn><mo>⊕</mo><mn>1</mn><mo>⊕</mo><mn>0</mn></mrow></mrow></math>", "type": "latex"}, {"file": "1601.08235.tex", "nexttext": "\nThis constraint gives rise to the gauge transformation \\begin{eqnarray}\nA_{ijk} \\rightarrow A_{ijk} + \\delta_{(ij}\\lambda_{k)}, \\end{eqnarray}\nwhich provides a nice example of the ``mode overcounting''\ndiscussed in the appendix.  In particular, the above constraint\ngives rise to new physics only when the 1-form field $\\lambda_k$\nis not exact, $i.e.$ $\\lambda_k \\neq\n\\partial_k \\Gamma$. If $\\lambda_k$ is a total derivative of some\nscalar function, then this constraint Eq.~\\ref{lc6} is not\nindependent of the transformation Eq.~\\ref{gt3} and the system as described by $B_{ijk}$ given before\nin Eq.~\\ref{B-rank3} is invariant under both.\n\nIf $\\lambda_k \\neq \\partial_k \\Gamma$, then we have to construct a\nnew ``magnetic field\" that is invariant under both gauge\ntransformations.  To do so, we need to define two quantities:\n\\begin{eqnarray}\nD_{ij} = \\delta_{ij}\\partial^2 - \\partial_i\\partial_j \\\\\nB_k = B_{iik}. \\end{eqnarray} Using these quantities, the new low energy\neffective Hamiltonian is schematically $E^2 + Q^2$ where we have\ndefined \\begin{eqnarray} Q_{ijk} = \\partial^2 B_{ijk} -\n\\frac{3}{4}D_{(ij}B_{k)}. \\end{eqnarray} This theory has a rather soft\ndispersion $\\omega \\sim k^5$, and only one single mode at each\nmomentum $\\vec{k}$. And just like all the examples before, this\ntheory is also self-dual.\n\nContinuing this procedure to higher rank theories generates an\nentire infinite family of ABL phases.  The procedure is exactly\nthe same, though the precise enumeration of possible gauge\ntransformations (and, indeed, even the number of degrees of\nfreedom) becomes tedious quickly.  However, by leveraging the\ngauge structure in addition to the self-duality at the IR fixed\npoint, we are able to in all cases derive the appropriate\nlow-energy effective Hamiltonian for a given local constraint.\n\n\\section{Topological Order}\n\nThe $U(1)$ spin liquid in $3+1d$, in addition to its stability,\nalso possesses a curious type of topological order, which was\ndiscussed in detail in Ref.~\\onlinecite{PhysRevB.69.064404}. When\nthe system is put on a three dimensional torus $T^3$ with size\n$L^3$, it is possible to thread electric flux around each of the\nnoncontractible loops. The flux integrals each commute with the\nlow-energy Hamiltonian and each other, so they constitute\nconstants of motion. When the flux spreads out over the whole\nthermodynamically large system, the energy cost goes to zero as\n$1/L$.  An identical picture holds for the magnetic flux, so\ntopological order is characterized by six integers. The system is\nstable due to the gap in both electric and magnetic charges,\nwhich makes it exponentially unlikely for a ``particle-hole''\npair to be created and propagate all the way around the torus to\nchange the flux.\n\nThere is a similar construction for the graviton ABL discussed in\nRef.~\\onlinecite{2006cond.mat..2443X,PhysRevB.74.224433}. However,\none must be more careful in the selection of which fluxes of\n$E_{ij}$ are used.  In principle, there are twenty seven different\nfluxes - three orientations of the flux surface and nine\ncomponents of $E_{ij}$.  Upon calculation, one can show that\nfifteen of these are zero, and of the remaining twelve only nine\nare independent.  The same result holds for the magnetic fluxes,\nmeaning that the graviton ABL has topological order characterized\nby eighteen integers.  It is similar to the $U(1)$ case in that\nthe ground states are split by $1/L$ and are exponentially\nunlikely to mix.\n\nWe claim that similar arguments hold for the whole infinite family\nof theories constructed in the previous sections with only\nderivative constraints.  The topological order is characterized by\n$6k$ integers corresponding to the electric and magnetic fluxes,\nwhere $k$ the number of independent components of the charge\ntensor.  Since the Hamiltonian densities for these theories are\ngenerically $E^2 + B^2$, we expect that in all cases the ground\nstate degeneracy closes as $1/L$ in the thermodynamic limit.\n\n\n\n\n\n\nTo understand the origin of the $6k$, we consider a generic local\nconstraint written as \\begin{eqnarray} (\\partial_i \\hat{E}_{ijk...} -\n\\hat{\\rho}_{jk...})|Phys\\rangle = 0 \\end{eqnarray} It is natural to\ninterpret the violations of the local constraints as ``charges.''\nThe particular choice of contraint endows the charges with a\ntensor structure, and the underlying symmetry of $E_{ijk...}$ is\nreflected in that structure.  Going back to the lattice model,\nthese charges can also be thought of as the open ends of strings.\nThe constraint is then interpreted as the condition that strings\ndo not end on sites.  Due to the all-important electromagnetic\nduality protecting these phases, there is a corresponding magnetic\ncharge tensor with exactly the same structure as the electric\ncharge.\n\nUsing these charge tensors, we can then create ``particle-hole\"\npairs of a given type of charge and wind them around a\nnoncontractible loop of $T^3$. Three dimensions times two species\nof charge gives the factor of six, and there are $k$ independent\ncharges depending on the particular constraint. We see that $k=1$\nfor the ordinary QED, while $k=3$ for the graviton ABL which has a\nvector charge.\n\nTo extend these ideas to constraints with more derivatives, we see\nthat the constraint $\\partial_i \\partial_j E_{ij} = 0$ can be\nrewritten as $\\partial_i F_i = 0$ for a vector field $F_i =\n\\partial_j E_{ij}$.  This constraint has a scalar charge, and it\ncan be shown easily that the fluxes of $F_i$ commute with each\nother and the Hamiltonian.  This extra step is needed to invoke\nthe divergence theorem, since we need to work with the divergence\nof a vector field.  Importantly, the characterization is still the\nsame - since the underlying charge is a scalar, this theory is\ncharacterized by six winding numbers.\n\nFinally, we consider the second type of constraint detailed above,\nsuch as $\\delta_{ij} E_{ij} = 0$. In the rank-2 case, we imagine\nthreading a flux of $E_{xx}$ around the noncontractible loop in\nthe $x$-direction while simultaneously threading a flux of\n$E_{yy}$ in the $y$-direction.  The two ``strings'' involved in\nthis threading process need not intersect, but in the ground state\nthe fluxes spread out over the whole system.  Once this occurs, we\nsee that the traceless constraint fixes the flux of $E_{zz}$\nthrough the $z$-direction so that the three integers sum to zero.\nThis new phase is characterized by 16 integers.  Extending these\nconstraints to higher-rank theories is straightforward but\ntedious, and simply removes topological degrees of freedom from\nthe diagonal fluxes.\n\n\\section{Summary and Discussion}\n\n\n\n\n\n\n\n\n\n\nIn this work we have demonstrated that there is an infinite family\nof strongly-correlated gapless boson systems whose low-energy\nHilbert space does not break any symmetries with gapless\nexcitations stable with respect to small arbitrary perturbations.\nThe gaplessness is protected by a combination of emergent gauge\ninvariance (enforced by a local constraint on the low-energy\nHilbert space) and a generalized electromagnetic duality.  Within\nsome limitations, the dispersion and representation of the\nemergent gauge boson can be tuned. Additionally, these theories\nhave an interesting type of topological order characterized by\n$6k$ integers, depending on the exact underlying local constraint.\n\nAlthough we have made heavy use of the gauge structure in\nconstructing these ABL phases, we have not made a careful analysis\nof the associated gauge groups.  Apart from the simplest $U(1)$\nspin liquid, the higher-rank gauge fields are not algebra-valued\n1-forms, and therefore do not fit into the standard Yang-Mills\narchitecture.\n\nOur rank-2 model with constraint $\\partial_i E_{ij} = 0$ can\npotentially be thought of as $U(1) \\times U(1) \\times U(1)$ gauge\ntheory after an (unusual) symmetrization between the space index and\nthe flavor index; this provides a possible realization of our\nrank-2 theory starting with three copies of the photon phase. We also\nnote that this connection between linearized gravity and the Yang-Mills\ngauge theory was already observed in the loop quantum gravity\nliterature~\\cite{PhysRevD.66.024017,Contreras:2013qua}.  Further study of\nthese models will hopefully elucidate these connections.\n\n\\section*{Acknowledgments}\n\nThe authors are supported by the David and Lucile Packard Foundation and NSF Grant No. DMR-1151208.\nThe authors thank Xiao-Gang Wen for helpful online discussions.  AR\nwould like to thank Zhen Bi and Dominic Else for helping sharpen several arguments. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Appendix A - Rank-3 Lattice Hamiltonian}\n\nFor concreteness, we will present a lattice Hamiltonian for one of\nthe rank-3 cases.  In line with the previous work by Xu, this\nHamiltonian has two pieces: a generic boson hopping term and a\ndensity-density repulsion term.\n\n\n\n\n\nThe unit cell for this lattice consists of a face-centered cubic\nlattice that also has a site at the center (see Figure 1).  The boson occupation\nat the corners of the fcc unit cell are three-fold degenerate,\nlabeled $n_{xxx,\\vec{r}}$, $n_{yyy,\\vec{r}}$, and\n$n_{zzz,\\vec{r}}$.  The faces are two-fold degenerate with labels\n$n_{xxy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}$,\n$n_{xyy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}$, and so on, and the center\nis labeled $n_{xyz,\\vec{r}+\\hat{x}/2+\\hat{y}/2+\\hat{z}/2}$.\n\n\\begin{figure}[!htb]\n\\centering\n\\includegraphics[scale=0.8]{fig1.pdf}\n\\caption{The unit cell for the simplest rank-3 model.  The red site is three-fold degenerate ($n_{xxx}$), the green sites are two-fold degenerate ($n_{xxy}$) and the blue site is nondegenerate ($n_{xyz}$).}\n\\end{figure}\n\n\nThe hopping term of the Hamiltonian $H = H_t + H_v$ is generic,\nand in principle contains all 45 exchanges.  The potential takes\nthe form for average boson density $\\bar{n}$\n\n\\begin{eqnarray}\nH_v = H_{xx} + H_{yy} + H_{zz} + H_{xy} + H_{yz} + H_{xz}\n\\end{eqnarray}\n\n\n", "itemtype": "equation", "pos": 27617, "prevtext": "\n\nThe spin-2 and spin-0 pieces here are antisymmetric in at least\ntwo indices. Requiring overall symmetrization will reduce the\nexpansion to a fully symmetric spin-3 part $T_{(ijk)}$ and a\nsymmetric spin-1 part $T^{\\prime}_{ijk} = \\delta_{(ij}T_{k)}$.\nThus, we can understand connection between the allowed constraints\nand how they will involve traces of the curls of $A$ by\nconsidering which parts of the tensor representation are\nsymmetric.\n\nHowever, as was noted previously, gauge structure is not enough to\nguarantee the gaplessness of the photon.  In 2+1d this manifests\nas the so-called ``instanton effect'', which is to say that the\nmagnetic flux insertion operator is always relevant at the\nGaussian fixed point. Thus, the instantons proliferate and open a\ngap for the photons. Thus in general in our $(3+1)d$ ABLs, we need\nto argue that all of the vertex operators that generically take\nthe form $\\cos\\left(2\\pi N h_{\\alpha\\beta...}\\right)$ for the dual\ngauge field $h$ are irrelevant.\n\n\\section{Examples}\n\nIn this section we will discuss a few examples of new ABL phases.\nThe first example is similar to the graviton theories detailed in\nthe previous section, except that it has a different local\nconstraint. This is an interesting property of rank-$n$ theories\nfor $n \\geq 2$ which greatly enhances the variety of gapless gauge\ntheories. There are roughly $n$ different constraints involving\nonly derivatives for a given rank-$n$ theory in addition to the\nvarious types of traceless conditions.\n\nThe original graviton model had as its local constraint\nEq.~\\ref{lc2}.  We can instead contract another derivative on\n$E_{ij}$ to get a different theory: \\begin{eqnarray} \\label{lc4}\n\\partial_i \\partial_j E_{ij} = 0\n\\end{eqnarray} Compared to the theory governed by Eq.~\\ref{lc2}, this\ntheory has a scalar (as opposed to vector) charge and has five\ntotal degrees of freedom (up from three).  Even before determining\nthe simplest possible Hamiltonian, we see that the gapless\nexcitations are distinct in character from the original gravitons:\n\\begin{eqnarray} A_{ij} \\rightarrow A_{ij} + \\partial_i\\partial_j \\lambda\n\\end{eqnarray}\n\n\n\n\n\n\n\n\n\n\nWe can construct the Hamiltonian of this ABL state using the\nfollowing symmetrized gauge invariant tensor field $B$: \\begin{eqnarray}\n\\label{b3} B_{ij} = \\frac{1}{2}\\left(\\epsilon_{iab}\\partial_a\nA_{bj} + \\epsilon_{jcd}\\partial_c A_{id}\\right). \\end{eqnarray} The\ncorresponding low energy Hamiltonian again takes the schematic\nform of $E^2 + B^2$, as before, and this theory is again\nself-dual, but it now has a linear dispersion $\\omega \\sim k$.\n\nWe can also consider enforcing the constraint Eq. (\\ref{lc3}) in\naddition to Eq. (\\ref{lc4}).  However, in this case, $B_{ij}$\ngiven by Eq. (\\ref{b3}) is already invariant under both gauge\ntransformations.  In fact, in conjunction with the graviton theory\ndiscussed previously, we have now characterized \\textit{all}\nrank-2 symmetric gauge theories whose gauge transformations\nsatisfy our criteria above.\n\n\n\n\n\n\n\n\n\n\n\nWhile the rank-1 and rank-2 systems have nice interpretations as\n``photons\" and ``gravitons\" due to the familiarity with known\nsystems, there is no such nice identification for the rank-3 case.\nWe cannot leverage any analogy to linearized gravity nor\nelectromagnetism, and instead we will proceed using our general\nmethod.\n\n\n\n\n\n\n\n\nTo illustrate this case, we consider two canonically conjugate\nsymmetric rank-3 tensor fields $A_{ijk}$ and $E_{ijk}$ where $A$\nis defined modulo $2\\pi$.  We then impose the local constraint\n\\begin{eqnarray} \\label{lc5}\n\\partial_i E_{ijk} = 0\n\\end{eqnarray} which generates the gauge transformation \\begin{eqnarray} \\label{gt3} A_{ijk}\n\\rightarrow A_{ijk} + \\partial_{(i}\\lambda_{jk)} \\end{eqnarray} The\ncorresponding lattice system is given in the appendix.  As before,\nwe seek a ``magnetic'' field that is gauge-invariant and of lowest\nnumber of derivatives of $A$.  Additionally, it should be\nsymmetric.  We see that \\begin{eqnarray} B_{ijk} =\n\\epsilon_{iab}\\epsilon_{jcd}\\epsilon_{kef}\\partial_a\\partial_c\\partial_e\nA_{bdf} \\label{B-rank3}\\end{eqnarray} is the simplest tensor that fits the\nrequirements. From this tensor we can construct a state with the\nfollowing low energy effective Hamiltonian \\begin{eqnarray} H = U\\sum_r E^2 +\nK\\sum_r B^2, \\end{eqnarray} where the coefficients of the $\\sum X_{iii}^2$,\n$\\sum X_{iij}^2$, and $\\sum X_{ijk}^2$ terms may in general be\ndifferent.  This system is self-dual in the same way as before, by\ndefining the dual variable $h_{ijk}$ as \\begin{eqnarray} E_{ijk} =\n\\epsilon_{iab}\\epsilon_{jcd}\\epsilon_{kef}\\partial_a\\partial_c\\partial_e\nh_{bdf} \\end{eqnarray} and requiring that $h_{ijk}$ transform in the same\nway as $A_{ijk}$ under a change of gauge.  The vertex operators of\nthe dual variables $\\cos\\left(2\\pi N h_{ijk}\\right)$ are easily\nseen to be gauge dependent, and thus irrelevant in the same way as\nbefore.  This is a new gapless Bose liquid with $\\omega \\sim k^3$\nwith four independent modes for each momentum $\\vec{k}$.\n\nWe can then ask what happens when another local constraint is\nimposed.\n\n", "index": 3, "text": "\\begin{equation}\\label{lc6}\n\\delta_{ij} E_{ijk} = 0.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\delta_{ij}E_{ijk}=0.\" display=\"block\"><mrow><mrow><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>E</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub></mrow><mo>=</mo><mn>0</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08235.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 37598, "prevtext": "\nThis constraint gives rise to the gauge transformation \\begin{eqnarray}\nA_{ijk} \\rightarrow A_{ijk} + \\delta_{(ij}\\lambda_{k)}, \\end{eqnarray}\nwhich provides a nice example of the ``mode overcounting''\ndiscussed in the appendix.  In particular, the above constraint\ngives rise to new physics only when the 1-form field $\\lambda_k$\nis not exact, $i.e.$ $\\lambda_k \\neq\n\\partial_k \\Gamma$. If $\\lambda_k$ is a total derivative of some\nscalar function, then this constraint Eq.~\\ref{lc6} is not\nindependent of the transformation Eq.~\\ref{gt3} and the system as described by $B_{ijk}$ given before\nin Eq.~\\ref{B-rank3} is invariant under both.\n\nIf $\\lambda_k \\neq \\partial_k \\Gamma$, then we have to construct a\nnew ``magnetic field\" that is invariant under both gauge\ntransformations.  To do so, we need to define two quantities:\n\\begin{eqnarray}\nD_{ij} = \\delta_{ij}\\partial^2 - \\partial_i\\partial_j \\\\\nB_k = B_{iik}. \\end{eqnarray} Using these quantities, the new low energy\neffective Hamiltonian is schematically $E^2 + Q^2$ where we have\ndefined \\begin{eqnarray} Q_{ijk} = \\partial^2 B_{ijk} -\n\\frac{3}{4}D_{(ij}B_{k)}. \\end{eqnarray} This theory has a rather soft\ndispersion $\\omega \\sim k^5$, and only one single mode at each\nmomentum $\\vec{k}$. And just like all the examples before, this\ntheory is also self-dual.\n\nContinuing this procedure to higher rank theories generates an\nentire infinite family of ABL phases.  The procedure is exactly\nthe same, though the precise enumeration of possible gauge\ntransformations (and, indeed, even the number of degrees of\nfreedom) becomes tedious quickly.  However, by leveraging the\ngauge structure in addition to the self-duality at the IR fixed\npoint, we are able to in all cases derive the appropriate\nlow-energy effective Hamiltonian for a given local constraint.\n\n\\section{Topological Order}\n\nThe $U(1)$ spin liquid in $3+1d$, in addition to its stability,\nalso possesses a curious type of topological order, which was\ndiscussed in detail in Ref.~\\onlinecite{PhysRevB.69.064404}. When\nthe system is put on a three dimensional torus $T^3$ with size\n$L^3$, it is possible to thread electric flux around each of the\nnoncontractible loops. The flux integrals each commute with the\nlow-energy Hamiltonian and each other, so they constitute\nconstants of motion. When the flux spreads out over the whole\nthermodynamically large system, the energy cost goes to zero as\n$1/L$.  An identical picture holds for the magnetic flux, so\ntopological order is characterized by six integers. The system is\nstable due to the gap in both electric and magnetic charges,\nwhich makes it exponentially unlikely for a ``particle-hole''\npair to be created and propagate all the way around the torus to\nchange the flux.\n\nThere is a similar construction for the graviton ABL discussed in\nRef.~\\onlinecite{2006cond.mat..2443X,PhysRevB.74.224433}. However,\none must be more careful in the selection of which fluxes of\n$E_{ij}$ are used.  In principle, there are twenty seven different\nfluxes - three orientations of the flux surface and nine\ncomponents of $E_{ij}$.  Upon calculation, one can show that\nfifteen of these are zero, and of the remaining twelve only nine\nare independent.  The same result holds for the magnetic fluxes,\nmeaning that the graviton ABL has topological order characterized\nby eighteen integers.  It is similar to the $U(1)$ case in that\nthe ground states are split by $1/L$ and are exponentially\nunlikely to mix.\n\nWe claim that similar arguments hold for the whole infinite family\nof theories constructed in the previous sections with only\nderivative constraints.  The topological order is characterized by\n$6k$ integers corresponding to the electric and magnetic fluxes,\nwhere $k$ the number of independent components of the charge\ntensor.  Since the Hamiltonian densities for these theories are\ngenerically $E^2 + B^2$, we expect that in all cases the ground\nstate degeneracy closes as $1/L$ in the thermodynamic limit.\n\n\n\n\n\n\nTo understand the origin of the $6k$, we consider a generic local\nconstraint written as \\begin{eqnarray} (\\partial_i \\hat{E}_{ijk...} -\n\\hat{\\rho}_{jk...})|Phys\\rangle = 0 \\end{eqnarray} It is natural to\ninterpret the violations of the local constraints as ``charges.''\nThe particular choice of contraint endows the charges with a\ntensor structure, and the underlying symmetry of $E_{ijk...}$ is\nreflected in that structure.  Going back to the lattice model,\nthese charges can also be thought of as the open ends of strings.\nThe constraint is then interpreted as the condition that strings\ndo not end on sites.  Due to the all-important electromagnetic\nduality protecting these phases, there is a corresponding magnetic\ncharge tensor with exactly the same structure as the electric\ncharge.\n\nUsing these charge tensors, we can then create ``particle-hole\"\npairs of a given type of charge and wind them around a\nnoncontractible loop of $T^3$. Three dimensions times two species\nof charge gives the factor of six, and there are $k$ independent\ncharges depending on the particular constraint. We see that $k=1$\nfor the ordinary QED, while $k=3$ for the graviton ABL which has a\nvector charge.\n\nTo extend these ideas to constraints with more derivatives, we see\nthat the constraint $\\partial_i \\partial_j E_{ij} = 0$ can be\nrewritten as $\\partial_i F_i = 0$ for a vector field $F_i =\n\\partial_j E_{ij}$.  This constraint has a scalar charge, and it\ncan be shown easily that the fluxes of $F_i$ commute with each\nother and the Hamiltonian.  This extra step is needed to invoke\nthe divergence theorem, since we need to work with the divergence\nof a vector field.  Importantly, the characterization is still the\nsame - since the underlying charge is a scalar, this theory is\ncharacterized by six winding numbers.\n\nFinally, we consider the second type of constraint detailed above,\nsuch as $\\delta_{ij} E_{ij} = 0$. In the rank-2 case, we imagine\nthreading a flux of $E_{xx}$ around the noncontractible loop in\nthe $x$-direction while simultaneously threading a flux of\n$E_{yy}$ in the $y$-direction.  The two ``strings'' involved in\nthis threading process need not intersect, but in the ground state\nthe fluxes spread out over the whole system.  Once this occurs, we\nsee that the traceless constraint fixes the flux of $E_{zz}$\nthrough the $z$-direction so that the three integers sum to zero.\nThis new phase is characterized by 16 integers.  Extending these\nconstraints to higher-rank theories is straightforward but\ntedious, and simply removes topological degrees of freedom from\nthe diagonal fluxes.\n\n\\section{Summary and Discussion}\n\n\n\n\n\n\n\n\n\n\nIn this work we have demonstrated that there is an infinite family\nof strongly-correlated gapless boson systems whose low-energy\nHilbert space does not break any symmetries with gapless\nexcitations stable with respect to small arbitrary perturbations.\nThe gaplessness is protected by a combination of emergent gauge\ninvariance (enforced by a local constraint on the low-energy\nHilbert space) and a generalized electromagnetic duality.  Within\nsome limitations, the dispersion and representation of the\nemergent gauge boson can be tuned. Additionally, these theories\nhave an interesting type of topological order characterized by\n$6k$ integers, depending on the exact underlying local constraint.\n\nAlthough we have made heavy use of the gauge structure in\nconstructing these ABL phases, we have not made a careful analysis\nof the associated gauge groups.  Apart from the simplest $U(1)$\nspin liquid, the higher-rank gauge fields are not algebra-valued\n1-forms, and therefore do not fit into the standard Yang-Mills\narchitecture.\n\nOur rank-2 model with constraint $\\partial_i E_{ij} = 0$ can\npotentially be thought of as $U(1) \\times U(1) \\times U(1)$ gauge\ntheory after an (unusual) symmetrization between the space index and\nthe flavor index; this provides a possible realization of our\nrank-2 theory starting with three copies of the photon phase. We also\nnote that this connection between linearized gravity and the Yang-Mills\ngauge theory was already observed in the loop quantum gravity\nliterature~\\cite{PhysRevD.66.024017,Contreras:2013qua}.  Further study of\nthese models will hopefully elucidate these connections.\n\n\\section*{Acknowledgments}\n\nThe authors are supported by the David and Lucile Packard Foundation and NSF Grant No. DMR-1151208.\nThe authors thank Xiao-Gang Wen for helpful online discussions.  AR\nwould like to thank Zhen Bi and Dominic Else for helping sharpen several arguments. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Appendix A - Rank-3 Lattice Hamiltonian}\n\nFor concreteness, we will present a lattice Hamiltonian for one of\nthe rank-3 cases.  In line with the previous work by Xu, this\nHamiltonian has two pieces: a generic boson hopping term and a\ndensity-density repulsion term.\n\n\n\n\n\nThe unit cell for this lattice consists of a face-centered cubic\nlattice that also has a site at the center (see Figure 1).  The boson occupation\nat the corners of the fcc unit cell are three-fold degenerate,\nlabeled $n_{xxx,\\vec{r}}$, $n_{yyy,\\vec{r}}$, and\n$n_{zzz,\\vec{r}}$.  The faces are two-fold degenerate with labels\n$n_{xxy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}$,\n$n_{xyy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}$, and so on, and the center\nis labeled $n_{xyz,\\vec{r}+\\hat{x}/2+\\hat{y}/2+\\hat{z}/2}$.\n\n\\begin{figure}[!htb]\n\\centering\n\\includegraphics[scale=0.8]{fig1.pdf}\n\\caption{The unit cell for the simplest rank-3 model.  The red site is three-fold degenerate ($n_{xxx}$), the green sites are two-fold degenerate ($n_{xxy}$) and the blue site is nondegenerate ($n_{xyz}$).}\n\\end{figure}\n\n\nThe hopping term of the Hamiltonian $H = H_t + H_v$ is generic,\nand in principle contains all 45 exchanges.  The potential takes\nthe form for average boson density $\\bar{n}$\n\n\\begin{eqnarray}\nH_v = H_{xx} + H_{yy} + H_{zz} + H_{xy} + H_{yz} + H_{xz}\n\\end{eqnarray}\n\n\n", "index": 5, "text": "\\begin{multline}\nH_{xx} = V(n_{xxx,\\vec{r}}+n_{xxx,\\vec{r}+\\hat{x}}+n_{xyx,,\\vec{r}+\\hat{x}/2+\\hat{y}/2}+\\\\\nn_{xyx,\\vec{r}+\\hat{x}/2-\\hat{y}/2}+n_{xzx,\\vec{r}+\\hat{x}/2+\\hat{z}/2}+\\\\\n+n_{xzx,,\\vec{r}+\\hat{x}/2-\\hat{z}/2} - 6\\bar{n})^2\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle H_{xx}=V(n_{xxx,\\vec{r}}+n_{xxx,\\vec{r}+\\hat{x}}+n_{xyx,,\\vec{r}%&#10;+\\hat{x}/2+\\hat{y}/2}+\\\\&#10;\\displaystyle n_{xyx,\\vec{r}+\\hat{x}/2-\\hat{y}/2}+n_{xzx,\\vec{r}+\\hat{x}/2+%&#10;\\hat{z}/2}+\\\\&#10;\\displaystyle+n_{xzx,,\\vec{r}+\\hat{x}/2-\\hat{z}/2}-6\\bar{n})^{2}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><msub><mi>H</mi><mrow><mi>x</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>=</mo><mi>V</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mi>x</mi><mi>y</mi><mi>x</mi><mo>,</mo><mo>,</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn><mo>+</mo><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></msub><mo>+</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mrow><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow><mo>-</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo><mrow><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>z</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mo>+</mo><msub><mi>n</mi><mrow><mi>x</mi><mi>z</mi><mi>x</mi><mo>,</mo><mo>,</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn><mo>-</mo><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></msub><mo>-</mo><mn>6</mn><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo><msup><mi/><mn>2</mn></msup></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.08235.tex", "nexttext": "\n\nwith similar expressions for the other four terms.  We define\n$E_{ijk} = (-1)^{\\vec{r}}(n_{ijk} - \\bar{n})$ and use the usual\nlattice derivative to see that the low-energy subspace of this\nHamiltonian has the local constraint $\\partial_i E_{ijk} = 0$.\n\n\\section*{Appendix B - Mode Overcounting}\n\nThere is a subtle point that needs to be addressed about the\ndefinitions of the above gauge transformations for rank greater\nthan or equal to three.  In particular, the two gauge\ntransformations below are not totally independent:\n\n\\begin{eqnarray}\nA_{ijk} \\rightarrow A_{ijk} + \\partial_{(i}\\lambda_{jk)}\n\\\\\nA_{ijk} \\rightarrow A_{ijk} + \\delta_{(ij}\\partial_{k)}\\lambda\n\\end{eqnarray}\n\nThe first contains the second as a special case.  This is\nunderstood in terms of tensor representations of $SO(3)$ by noting\nthat a symmetric rank-2 tensor (six degrees of freedom) has a\nsingle scalar trace mode in addition to the five spin-2 modes.  As\nsuch, a more correct accounting would require tracelessness of\n$\\lambda_{ij}$, which is achieved via\n\n\\begin{eqnarray}\n\\tilde{\\lambda}_{ij} = \\lambda_{ij} - \\frac{1}{3}\\delta_{ij}\\lambda_{kk}\n\\end{eqnarray}\n\nThis type of overcounting of trace modes persists into higher\nrank, and becomes increasingly complicated as the number of trace\nmodes increases.\n\n\\bibliography{ref}\n\n\n", "itemtype": "equation", "pos": 37849, "prevtext": "\n\n\n", "index": 7, "text": "\\begin{multline}\nH_{xy} = V(n_{xyx,\\vec{r}+\\hat{x}/2+\\hat{y}/2}+n_{xyx,\\vec{r}+3\\hat{x}/2+\\hat{y}/2}+ \\\\\n+n_{xyy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}+n_{xyy,\\vec{r}+\\hat{x}/2+3\\hat{y}/2}+ \\\\\n+n_{xyz,\\vec{r}+\\hat{x}/2+\\hat{y}/2+\\hat{z}/2}+n_{xyz,\\vec{r}+\\hat{x}/2+\\hat{y}/2+3\\hat{z}/2} - 6\\bar{n})^2\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle H_{xy}=V(n_{xyx,\\vec{r}+\\hat{x}/2+\\hat{y}/2}+n_{xyx,\\vec{r}+3%&#10;\\hat{x}/2+\\hat{y}/2}+\\\\&#10;\\displaystyle+n_{xyy,\\vec{r}+\\hat{x}/2+\\hat{y}/2}+n_{xyy,\\vec{r}+\\hat{x}/2+3%&#10;\\hat{y}/2}+\\\\&#10;\\displaystyle+n_{xyz,\\vec{r}+\\hat{x}/2+\\hat{y}/2+\\hat{z}/2}+n_{xyz,\\vec{r}+%&#10;\\hat{x}/2+\\hat{y}/2+3\\hat{z}/2}-6\\bar{n})^{2}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><msub><mi>H</mi><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi></mrow></msub><mo>=</mo><mi>V</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>x</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>+</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>y</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub></mrow><mo>+</mo><mrow><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>y</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mo>+</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>z</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>+</mo><msub><mi>n</mi><mrow><mrow><mi>x</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>z</mi></mrow><mo>,</mo><mrow><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>y</mi><mo stretchy=\"false\">^</mo></mover><mo>/</mo><mn>2</mn></mrow><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>/</mo><mn>2</mn></mrow></mrow></mrow></msub><mo>-</mo><mn>6</mn><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo><msup><mi/><mn>2</mn></msup></mrow></mtd></mtr></mtable></math>", "type": "latex"}]