[{"file": "1601.08232.tex", "nexttext": "\nwhere $K$ is the Frank elastic constant, $q$ is the chirality, $\\theta$ is the tilt angle of the director\nwith respect to the membrane normal and $C$ is the tilt energy modulus.\nDirector twist is expelled from the interior of the membrane, but can penetrate near the edges over a distance $\\lambda = \\sqrt{K/C}$, the twist penetration depth \\cite{deGennesSmectic}. To model virus mixtures we will allow $q$ and $C$ to depend on position, taking on values ${q_\\text{r}}$ and ${C_\\text{r}}$ in the rafts and ${q_\\text{b}}$ and ${C_\\text{b}}$ in the background membrane.\nThe three dimensional molecular director field $\\hat{\\mathbf n}$ can be expressed in terms of $\\theta$ and $\\varphi$ (the azimuthal angle in the plane of the membrane) by:\n\n", "itemtype": "equation", "pos": 8200, "prevtext": "\n\n\\title{Interaction of chiral rafts in self-assembled colloidal membranes }\n\n\\author{Sheng Xie}\n\\affiliation{Department of Physics, Brown University, Providence RI, 02912, U.S.A}\n\\author{Michael F. Hagan}\\email{hagan@brandeis.edu}\n\\affiliation{Department of Physics, Brandeis University, Waltham MA, 02454, U.S.A.}\n \\author{Robert A. Pelcovits}\\email{pelcovits@brown.edu}\n \\affiliation{Department of Physics, Brown University, Providence RI, 02912, U.S.A}\n\n\n\\date{\\today}\n\n\\begin{abstract}\nColloidal membranes are monolayer assemblies of rodlike particles that capture the long-wavelength properties of lipid bilayer membranes on the colloidal scale. Recent experiments on colloidal membranes formed by chiral rodlike viruses showed that introducing a second species of virus with different length and opposite chirality leads to the formation of rafts --- micron-sized domains of one virus species floating in a background of the other viruses [Sharma et al., Nature 513, 77 (2014)].\nIn this article we study the interaction of such rafts using liquid crystal elasticity theory. By numerically minimizing the director elastic free energy, we predict the tilt angle profile for both a single raft and two rafts in a background membrane, and the interaction between two rafts as a function of their separation. We find that the chiral penetration depth in the background membrane sets the scale for the range of the interaction.  We compare our results with the experimental data and find good agreement for the strength and range of the interaction. Unlike the experiments, however, we do not observe a complete collapse of the data when rescaled by the tilt angle at the raft edge.\n\\end{abstract}\n\n\\pacs{82.70.Dd, 61.30.Cz, 64.75.Yz}\n\\maketitle\n\n\\section{INTRODUCTION}\n\\label{intro}\n\n\nPlacing a system of monodisperse rodlike viruses ({\\textit{e.g.}\\xspace} filamentous bacteriophages) in the presence of a non-adsorbing polymer leads to effective depletion attractions that drive lateral association of rods. When the rodlike particles are chiral, their lateral interactions have a preferred twist, causing them to form a variety of fascinating one-rod-length thick assemblies, including one-dimensional twisted ribbons, braided ribbons, starfish shapes and membranes with twist domain walls \\cite{Dogic2014, Barry2010, Gibaud2012,Yang2012,Yang2011, Barry2009a, Barry2009, Zakhary2014, Kang2015,Dogic2014,Kaplan2014,Kaplan2013}.  Considerable theoretical effort has been devoted to modeling and understanding the properties of these self-assemblies (e.g., \\cite{Yang2012, Yang2011, Barry2009, Kang2015, Kaplan2014, Kaplan2013, Savenko2006,Patti2009,Cuetos2010,Cuetos2008,Pelcovits2009,Kang2015, Kaplan2010,Tu2013,Tu2013a}).\n\nMixing rods of two different lengths yields yet more interesting structures. Sharma et al. \\cite{key-41} recently studied mixtures of the filamentous bacteriophages \\textit{fd}-Y21M and M13KO7.  The two viruses have the same diameter, but \\textit{fd}-Y21M virus has a contour length of 880 nm and has right-handed chirality, while M13KO7 has a contour length of 1,200 nm and exhibits left-handed chirality \\cite{Barry2009a, Tombolato}. Over a broad range of polymer depletant concentrations, the two rod species co-assemble to form bidisperse membranes (still one-rod-length thick), but the distributions of the rods within the membrane depend sensitively on polymer concentration. At low polymer concentrations rods mix homogeneously, while at high concentrations they undergo macrophase separation. At intermediate polymer concentrations, Sharma et al. observed equilibrium microphase separation of the two viruses into highly monodisperse micron-sized colloidal rafts composed of the shorter \\textit{fd}-Y21M virus, floating in a background membrane composed primarily of the longer M13KO7 viruses.\n\nBy manipulating the positions and sizes of rafts with optical tweezers, Sharma et al. \\cite{key-41} measured the interaction potential between pairs of rafts, which they found to be repulsive and exponentially decaying with raft edge-edge separation.\nThey suggested a physical mechanism for this repulsion, noting that the formation of right-handed rafts in a background of left-handed rods helps alleviate the frustration that arises from the incompatibility of chiral twist and membrane layer formation. They provided evidence for this explanation by measuring the rod tilt angle at the edge of the rafts, and found that the raft interaction potential for rafts of different sizes collapses on top of each other when rescaled by the tilt angle at the edge. Furthermore, they found that the range of the interaction is independent of raft size, while the strength grows linearly with increasing raft size.\n\nIn this paper we present quantitative modeling of the physical mechanism suggested by Sharma et al., focusing on the role of liquid crystal director elasticity in the interaction of chiral rafts. We do not address the formation or optimal size of the rafts. We assume that rafts of a particular size have formed (either naturally or via manipulation by optical tweezers), and determine the tilt angle in their interiors and the intervening background membrane, by numerically minimizing the Frank elastic energy. We then compute the interaction between the rafts by comparing the free energy of the system (rafts plus background membrane) with a reference system in which the rafts are far apart and noninteracting. Our tilt angle profiles support the physical mechanism for the repulsive raft interaction suggested by Sharma et al. \\cite{key-41}. The theory allows prediction of how the strength of the raft interaction potential depends on a number of experimentally controllable parameters, such as raft size, the magnitude of chiral twist and elastic moduli for raft or background rods. We find that the twist penetration depth in the background membrane sets the characteristic decay length of the the raft interaction. Thus, as observed in the experiments, we find that the decay length is independent of raft diameter. Also in agreement with experiment, we find that the strength of the raft interaction increases with increasing raft diameter.  One discrepancy between theory and  experiments is that experimentally measured interaction potentials for different-sized rafts collapse into a single curve when  rescaled by the tilt angle at the raft edge \\cite{key-41}; our theoretical curves come closer together upon rescaling but do not fully collapse.\n\nThe mediation of the raft interaction by the background director field is an example of a more general phenomenon of membrane-mediated interactions between membrane inclusions, of which there are examples in liquid crystal systems \\cite{Poulin, Pettey, Dolganov, Bohley}, models of embedded proteins in biological  membranes \\cite{Dan, Goulian} and lipid rafts in cell membranes \\cite{Dietrich, Lingwood}. The bidisperse filamentous bacteriophage experiments established a highly controllable experimental platform with which to measure such membrane-mediated interactions. Our theory provides a means to probe the physical mechanisms underlying these measurements.\n\nThis paper is organized as follows. In the next section we describe the director free energy model used in our analysis, and our numerical method for its minimization.  In  Sec.~\\ref{results} we first present the predicted tilt angle profile of a single raft in a background membrane of opposite chirality, followed by the tilt angle profiles and interaction potential for two such rafts. We compare our results with the experimental data of Ref.~\\cite{key-41}.  Sec.~\\ref{conclusions} offers concluding remarks. The appendices contain technical details of the discretization of the free energy and a calculation of the tilt angle at the interface between two semi-infinite membranes of different chirality.\n\n\n\\section{Free energy and its minimization}\n\nWe consider a single, flat smectic layer of chiral $fd$ viruses whose long axes are specified by a director field $\\hat{\\mathbf n}$. The de Gennes free energy density for this system in the single Frank constant approximation is given by \\cite{deGennesSmectic,PelcovitsMeyer}:\n\n", "index": 1, "text": "\\begin{equation}\nf_\\text{n}=\\frac{1}{2}K[(\\nabla\\cdot\\hat{\\mathbf n})^{2}-2q\\hat{\\mathbf n}\\cdot(\\nabla\\times\\hat{\\mathbf n})+(\\nabla\\times\\hat{\\mathbf n})^{2}+q^{2}]+\\frac{1}{2}C\\sin^{2}\\theta\\label{eq:4.3}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"f_{\\text{n}}=\\frac{1}{2}K[(\\nabla\\cdot\\hat{\\mathbf{n}})^{2}-2q\\hat{\\mathbf{n}}%&#10;\\cdot(\\nabla\\times\\hat{\\mathbf{n}})+(\\nabla\\times\\hat{\\mathbf{n}})^{2}+q^{2}]+%&#10;\\frac{1}{2}C\\sin^{2}\\theta.\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mtext>n</mtext></msub><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>∇</mo><mo>⋅</mo><mover accent=\"true\"><mi>𝐧</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>-</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>q</mi><mo>⁢</mo><mover accent=\"true\"><mi>𝐧</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>∇</mo><mo>×</mo><mover accent=\"true\"><mi>𝐧</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>∇</mo><mo>×</mo><mover accent=\"true\"><mi>𝐧</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>q</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>C</mi><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\n\nWith the membrane normal chosen along the \\textit{z} axis,  $f_{n}$ is given by:\n\\begin{eqnarray}\nf_\\text{n}=\\frac{K}{2}&\\Biggl\\lbrack&\\biggl(\\frac{\\partial\\theta}{\\partial x}\\biggr)^2+\\biggl(\\frac{\\partial\\theta}{\\partial y}\\biggr)^{2}+\\sin^{2}\\theta\\biggl(\\biggl(\\frac{\\partial\\varphi}{\\partial x}\\biggr)^{2}+\\biggl(\\frac{\\partial\\varphi}{\\partial y}\\biggr)^2\\biggr)+2\\cos\\theta \\sin\\theta\\biggl(\\frac{\\partial\\theta}{\\partial x}\\frac{\\partial\\varphi}{\\partial y}-\\frac{\\partial\\theta}{\\partial y}\\frac{\\partial\\varphi}{\\partial x}\\biggr)+q^{2}\\Biggr\\rbrack\\nonumber\\\\\n&&{}-Kq\\biggl\\lbrack \\sin\\varphi\\frac{\\partial\\theta}{\\partial x}-\\cos\\varphi\\frac{\\partial\\theta}{\\partial y}+\\sin\\theta \\cos\\theta\\biggl(\\cos\\varphi\\frac{\\partial\\varphi}{\\partial x}+\\sin\\varphi\\frac{\\partial\\varphi}{\\partial y}\\biggr)\\biggr\\rbrack+\\frac{C}{2}\\sin^{2}\\theta\\label{fn}\n\\end{eqnarray}\n\n\n\nWe discretize the free energy density (see Appendix A for details) and then use the Newton-Gauss-Seidel method \\citep{key-76} to minimize its value. The Newton-Gauss-Seidel method is specified by \\cite{Stark}:\n\n", "itemtype": "equation", "pos": 9164, "prevtext": "\nwhere $K$ is the Frank elastic constant, $q$ is the chirality, $\\theta$ is the tilt angle of the director\nwith respect to the membrane normal and $C$ is the tilt energy modulus.\nDirector twist is expelled from the interior of the membrane, but can penetrate near the edges over a distance $\\lambda = \\sqrt{K/C}$, the twist penetration depth \\cite{deGennesSmectic}. To model virus mixtures we will allow $q$ and $C$ to depend on position, taking on values ${q_\\text{r}}$ and ${C_\\text{r}}$ in the rafts and ${q_\\text{b}}$ and ${C_\\text{b}}$ in the background membrane.\nThe three dimensional molecular director field $\\hat{\\mathbf n}$ can be expressed in terms of $\\theta$ and $\\varphi$ (the azimuthal angle in the plane of the membrane) by:\n\n", "index": 3, "text": "\\begin{equation}\n\\hat{\\mathbf n}=(n_{x},n_{y},n_{z})=(\\sin\\theta \\cos\\varphi,\\sin\\theta \\sin\\varphi,\\cos\\theta)\\label{eq:4.4}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\hat{\\mathbf{n}}=(n_{x},n_{y},n_{z})=(\\sin\\theta\\cos\\varphi,\\sin\\theta\\sin%&#10;\\varphi,\\cos\\theta).\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>𝐧</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>x</mi></msub><mo>,</mo><msub><mi>n</mi><mi>y</mi></msub><mo>,</mo><msub><mi>n</mi><mi>z</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>φ</mi></mrow></mrow><mo>,</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>φ</mi></mrow></mrow><mo>,</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nwhere ``ï¿½ï¿½$\\delta^{2}f_\\text{n}/\\delta^{2}\\theta(x,y)$'' is calculated as the derivative of $\\delta f_\\text{n}/\\delta\\theta(x,y)$\nwith respect to $\\theta(x,y)$ at a grid point $(x,y)$ and similarly for $\\varphi$. The quotation marks indicate that these derivatives are not the discretized form of a real second-order functional derivative, which would involve a delta function \\cite{Stark}. The iteration is repeated until the change in the total free energy of the system is less than one part in $10^7$.\n\nWe consider a grid of points in a square box of side $L=60$ (measured in units of the twist penetration\ndepth $\\lambda$) with periodic boundary conditions. The box is meant to represent a small portion of the membrane far from its edge. The initial spacing between neighboring grid points is 0.5, yielding a grid of $120\\times120$ points. Within this box we place two rafts, defined as discrete circular areas of radius $R$. For grid points lying inside the rafts $q={q_\\text{r}}$, while for points outside $q= {q_\\text{b}}$, where ${q_\\text{r}}$ and ${q_\\text{b}}$ have opposite signs and possibly different magnitudes. We initialize the director at each grid point in the box as a small random fluctuation about the $z$ axis and relax the system using Eq.~(\\ref{eq:4.8b}). After a few thousand steps (each step being a loop over all grid points), the grid close to the edges\nof the rafts is refined by adaptive mesh refinement \\citep{key-67}. Figure \\ref{fig:A-simple-grid} shows a simple example of mesh refinement applied to a single raft. After the system equilibrates, the interaction potential (measured in units of $K$) between the two rafts is extracted by comparing\nthe total free energy of the system with that of a reference system where the two rafts are far enough apart that no significant interaction exists.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure1}\n\\protect\\caption{Illustration of mesh refinement for a single raft of radius 4 centered at (10,10). A much finer grid was utilized in obtaining our results. \\label{fig:A-simple-grid}}\n\\end{figure}\n\n\\section{Results}\n\\label{results}\n\n\n\\subsection{Single raft\\label{sub:Single-raft}}\n\nWe first investigate a single raft of radius $R$ with chirality equal in magnitude and opposite in sign to the surrounding background, i.e., ${q_\\text{b}}=-{q_\\text{r}}=q$. We assume that the tilt modulus $C$ has the same value within the raft and the background membrane, i.e., ${C_\\text{r}}={C_\\text{b}}$; thus, the penetration depth $\\lambda=\\sqrt{K/C}$ has a common value as well.  For simplicity we assume that the sign of the chirality changes abruptly at the edge of the raft; we consider other chirality  profiles when we study two rafts. Figure \\ref{fig:a)-Plot-of} shows the tilt angle $\\theta_{0}$ at the raft boundary as a function of $R$ (measured in units of $\\lambda$). We have chosen $q=0.71$, the value used in Ref.~\\cite{PelcovitsMeyer}, where circular membranes bounded by the polymer depletant solution were studied by numerically solving the Euler-Lagrange equation for $f_\\text{n}$. In that case the relevant boundary conditions were zero tilt at the center of the membrane and zero director torque at the edge. From the figure we see that, in the case of the raft surrounded by a chiral membrane of opposite chirality, the value of $\\theta_0$ is larger than in similarly sized circular membranes surrounded by depletant \\cite{PelcovitsMeyer}, although this difference decreases as $R$ increases. This decrease at large $R$ is consistent with an analytic calculation (see Appendix B) of $\\theta_0$ at the interface between two \\textit{semi-infinite} membranes of equal and opposite chirality. This calculation yields the same value for $\\theta_0$ as found in Ref.~\\cite{Barry2009} for a semi-infinite membrane bounded by a polymer depletant with zero director torque at the boundary.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Raft_Figure_2}\n\\protect\\caption{Tilt angle $\\theta_{0}$ (stars) at the edge of a single raft as a function of\nthe raft radius $R$ (measured in units of  $\\lambda$) with $q=0.71$ in a background membrane with chirality equal in magnitude and opposite in sign. The solid circles are the corresponding tilt angle values from Ref. \\cite{PelcovitsMeyer} for circular membranes surrounded by depletant. \\label{fig:a)-Plot-of}}\n\\end{figure}\n\n\n\nFigure \\ref{fig:Plots-of-tilt} shows the tilt angle $\\theta$\nthrough a cross section of the raft and background membrane.  In the figure we compare our results to those obtained in Ref.~\\cite{PelcovitsMeyer}  for  circular membranes surrounded by depletant.  From the figure we see that as  $R$ increases, the $\\theta$ profile for the raft becomes more symmetric about the edge of the raft and is almost perfectly symmetric once $R\\gtrsim 5$ and  $\\theta$ decays nearly to zero at the center of the raft. This approximate critical value of $R$ was also noted in Ref.~\\cite{PelcovitsMeyer} for the tilt profile in isolated circular membranes. From the figure we also see how the system accommodates the opposite chiralities of the raft and background.  Starting from the center of the raft and moving outward, the tilt angle grows, following the twist preferred by the raft rods, until reaching the edge of the raft. As one moves into the background membrane where the viruses have opposite chirality, the rods twist in the opposite sense and the tilt angle decreases.\n\n\n\\begin{figure}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R10}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R5}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R25}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R125}\n\\protect\\caption{ Tilt angle $\\theta$ (solid line) in a single raft surrounded by a background membrane of equal and opposite chirality ($q=0.71$) as a function of the $x$ coordinate (units of $\\lambda$) measured from the center of the raft. The values of $\\theta$ are compared with the results (dashed curve) found in Ref.~\\cite{PelcovitsMeyer} for circular membranes surrounded by depletant.  The centers of the raft and the circular membrane are both located at the origin. The vertical dashed-dotted line denotes the edge of the raft and circular membrane. \\label{fig:Plots-of-tilt}}\n\\end{figure}\n\n\nTo check the accuracy of our model, we computed $\\theta_0$, the tilt angle at the edge of the raft, for different mesh sizes. Our results are shown in Figure\n\\ref{fig:raft mesh sensitivity}, where the horizontal axis shows the smallest mesh size at each\nrefinement level, and the value of $\\theta_{0}$ is taken as an indicator of the influence of refinement levels. The\ninitial coarse mesh size is 0.5. Three different raft sizes were tested,\nand the result shows that $\\theta_{0}$ converges at the same rate\nfor all three raft sizes as the mesh size is decreased, which indicates that\nour method is numerically consistent.\n\n\\begin{figure}\n\\includegraphics[scale=0.45]{meshsize}\n\\protect\\caption{ Dependence of  $\\theta_{0}$, the tilt angle at the raft edge, on mesh\nrefinement $h$ with $q=0.71$ for four different values of raft radius (measured in units of $\\lambda$). The horizontal axis is the finest mesh\nsize level (i.e., near the raft edge), measured in units of $\\lambda$.   \\label{fig:raft mesh sensitivity}}\n\\end{figure}\n\n\n\n\\subsection{Two rafts\\label{sub:Two-rafts}}\n\nWe now consider the more complex and interesting situation of two rafts composed of molecules of the same chirality fixed in a background membrane of opposite (but not necessarily equal) chirality. We relax the constraints ${\\lambda_\\text{b}}={\\lambda_\\text{r}}$ (i.e., ${C_\\text{b}}={C_\\text{r}}$) and $|{q_\\text{b}}|=|{q_\\text{r}}|$ so that we can explore the parameter space more fully, and compare our results with data from the experiments \\cite{key-41}.  As in the case of a single raft, we use adaptive mesh refinement near the edges of the rafts, and compute the tilt angle and raft interaction potential as functions of the edge-to-edge separation $D$ of the rafts measured in units of ${\\lambda_\\text{b}}$ (we explain below why we choose to measure lengths in units of ${\\lambda_\\text{b}}$ rather than ${\\lambda_\\text{r}}$). Figure \\ref{fig:tilt-angle-} shows grayscale plots for the tilt angle computed by minimizing $f_\\text{n}$ for two rafts of radius $R=4$ at several values of $D$  for the case  ${\\lambda_\\text{b}}={\\lambda_\\text{r}}$. The lightest rings in the figure (corresponding to the maximum value of $\\theta$) occur near the edges of the rafts. The figure illustrates the origin of the repulsive force between rafts already discussed in Ref.~\\cite{key-41}. When the rafts are far apart (Figs.~\\ref{fig:tilt-angle-}~c, d), the regions of maximum $\\theta$ are full circles centered on the raft centers. As in the case of a single raft (see Fig.~\\ref{fig:Plots-of-tilt}), starting from the center of one of the rafts and moving radially outward, the tilt angle grows until reaching the edge of the raft, then decreases as one moves into the background membrane where the viruses have opposite chirality. As the second raft is approached, the tilt angle begins to grow again until it reaches the edge of the raft, subsequently decreasing as one enters the raft interior. Thus, the preferred chiral twist in both the rafts and the background near their interfaces is satisfied. However, when the edges of the rafts are separated by a distance less than $2{\\lambda_\\text{b}}$ the preferred twist is no longer fully satisfied, as indicated in Figs.~\\ref{fig:tilt-angle-}a, b.\n\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure_5a}\n\\includegraphics[scale=0.5]{Figure_5b}\n\\includegraphics[scale=0.5]{Figure_5c}\n\\includegraphics[scale=0.5]{Figure_5d}\n\\raggedleft{}\\protect\\caption{ Tilt angle $\\theta$ profile for a system of two rafts with radius $R=5$ and\n${q_\\text{b}}=-{q_\\text{r}}=0.71$, for four values of the edge-to-edge separation $D$ of the rafts (which is given by their center-to-center separation minus the raft diameter). The value of $\\theta$ is indicated by the grayscale bar to the right of each figure. Here we choose ${\\lambda_\\text{r}}={\\lambda_\\text{b}}=\\lambda$ and measure lengths in units of $\\lambda$.  The figure shows a portion of the total system, which is a square of side $L=60$. The maximum tilt angle $\\theta_{0}$ occurs at the edge of the rafts. (a) $D=0$, (b) $D=1$, (c) $D=2$,\n(d) $D=4$. \\label{fig:tilt-angle-}}\n\\end{figure}\n\n\\subsubsection{ Dependence of the interaction strength on control parameters} The above discussion suggests that the characteristic length scale of the raft interaction is ${\\lambda_\\text{b}}$, the twist penetration depth in the background membrane. We confirm this assertion by comparing the interaction as a function of the raft separation in units of ${\\lambda_\\text{r}}$ and in units of ${\\lambda_\\text{b}}$ .  Figures \\ref{fig:Rafts-proof-lambda_b}a and \\ref{fig:Rafts-proof-lambda_b}c show the raft interaction measured in units of ${\\lambda_\\text{r}}$.  In Fig. \\ref{fig:Rafts-proof-lambda_b}a the values of ${\\lambda_\\text{r}}$ and $R$ are held fixed while ${\\lambda_\\text{b}}$ is varied; in Fig.~\\ref{fig:Rafts-proof-lambda_b}c the value of ${\\lambda_\\text{b}}$ is held fixed while ${\\lambda_\\text{r}}$ and $R$ are varied (such that ${\\lambda_\\text{r}} R$ is held fixed). Figures \\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d show the raft interaction measured in units of ${\\lambda_\\text{b}}$ . In Fig. \\ref{fig:Rafts-proof-lambda_b}b the value of ${\\lambda_\\text{r}}$ is held fixed while ${\\lambda_\\text{b}}$ and $R$ are varied (such that ${\\lambda_\\text{b}} R$ is held fixed); in Fig. \\ref{fig:Rafts-proof-lambda_b}d  the values of ${\\lambda_\\text{b}}$ and $R$ are held fixed while ${\\lambda_\\text{r}}$ is varied. All other parameters are kept fixed. From Figs.~\\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d we can see clearly that the interaction curves for rafts of different radii and values of ${\\lambda_\\text{r}}$ collapse when we measure lengths in units of ${\\lambda_\\text{b}}$.\n\nGiven that the raft interaction is mediated by the twist in the intervening background, we expect the range of the interaction to be determined by the distance over which the tilt angle in the background is appreciably larger than zero. As we saw in Fig. \\ref{fig:Plots-of-tilt} this distance is approximately 5 (in units of ${\\lambda_\\text{b}}$), and we see from Figs. \\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d that the interaction potential $\\phi$ has dropped by an order of magnitude when $D\\approx 5 {\\lambda_\\text{b}}$.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure6a}\n\\includegraphics[scale=0.5]{Figure6b}\n\\includegraphics[scale=0.5]{Figure6c}\n\\includegraphics[scale=0.5]{Figure6d}\n\\protect\\caption{ Raft interaction potential $\\phi$ (units of $k_B T$) as a function of edge-to-edge separation. (a) and\n(b):  ${\\lambda_\\text{r}}=0.5$,  $R=3{\\lambda_\\text{r}}$; in (a) all lengths\nare in units of ${\\lambda_\\text{r}}$, in (b) all lengths are in units of ${\\lambda_\\text{b}}$; (c) and (d): ${\\lambda_\\text{b}}=0.5$, $R=3{\\lambda_\\text{b}}$; in (c) all lengths are in units of ${\\lambda_\\text{r}}$; in (d) all lengths are in units of ${\\lambda_\\text{b}}$. Note the collapse of the curves in (b) and (d) where the unit of length is ${\\lambda_\\text{b}}$.   \\label{fig:Rafts-proof-lambda_b}}\n\\end{figure}\n\nSince the interaction range is determined by ${\\lambda_\\text{b}}$, we keep ${\\lambda_\\text{b}}=1$ throughout the following analysis and consider  the dependence of the interaction strength on ${q_\\text{b}}$, ${q_\\text{r}}$, ${C_\\text{r}}$ and $R$.  Figure \\ref{fig:Rafts-interaction-strength} shows the effects of these\nparameters on the raft interaction, by plotting on a semi-log scale the raft interaction as a function of $D$. In each case, the data is fit to an exponential form with decay length 1 (in units of ${\\lambda_\\text{b}}$).  We see that all of these parameters have very little effect on the decay length,  supporting the assertion made above that ${\\lambda_\\text{b}}$ determines the range of the interaction.\n From the figure we see that increasing the values of ${q_\\text{b}}$, $|{q_\\text{r}}|$ or $R$ increases the strength of the interaction, while increasing the value of  ${C_\\text{r}}$ decreases the strength. This result is readily understood in physical terms: increasing ${q_\\text{b}}$ or $|{q_\\text{r}}|$ leads to a larger value of the tilt angle at the raft edge, increasing  $R$ leads to a greater area of overlapped twisted domains for a given edge-to-edge distance, while increasing ${C_\\text{r}}$ leads to a smaller value of the tilt angle at the raft edge.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure7_a}\n\\includegraphics[scale=0.5]{Figure7_b}\n\\includegraphics[scale=0.5]{Figure7_c}\n\\includegraphics[scale=0.5]{Figure7_d}\n\\protect\\caption{ Dependence of raft interaction $\\phi$ (units of $k_B T$) on ${q_\\text{b}}$, ${q_\\text{r}}$, ${C_\\text{r}}$ and $R$. All lengths are measured in units of ${\\lambda_\\text{b}}$ and ${C_\\text{b}}=4$. The exponential expressions in the legend are fits to the data.  (a) ${q_\\text{r}}=-0.355$, ${\\lambda_\\text{r}}=1.333$, $R=2.231$. b) ${q_\\text{b}}=2$, ${\\lambda_\\text{r}}=1.333$, $R=2.231$. c) ${q_\\text{r}}=-1.42$, ${q_\\text{b}}=1.42$, $R=2.231$. d) ${q_\\text{r}}=-1.42$, ${q_\\text{b}}=1.42$, ${\\lambda_\\text{r}}=1.333$.   \\label{fig:Rafts-interaction-strength}}\n\\end{figure}\n\nIn Sec. \\ref{sub:Single-raft} we  assumed that the chirality jumped discontinuously  from ${q_\\text{r}}$ to ${q_\\text{b}}$  at the raft edge. In studying the interaction between two rafts, we have also considered a linear chirality profile of width $2{L_\\text{tran}}$ centered on the edge of the raft, exploring five values of ${L_\\text{tran}}/R$ (Fig.~\\ref{interaction-chirality}). We find that the interaction is insensitive to the value of ${L_\\text{tran}}/R$ except at large raft separations, $D\\gtrsim 7$. In figs.~\\ref{fig:Rafts-proof-lambda_b}, \\ref{fig:Rafts-interaction-strength} and \\ref {fig:Chirality-boundary-conditions-1} we have set ${L_\\text{tran}}/R=0.045$.   We have also considered the effect of the chirality profile on the tilt angle. Figure \\ref{fig:tilt-chirality-profile} shows that the tilt angle at the edge of the raft changes by more than 15\\% as ${L_\\text{tran}}$ is varied, a surprising result given the insensitivity of the raft interaction potential to the width of the chirality transition.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{interaction-chirality}\n\\caption{Raft interaction potential $\\phi$ (units of ${k_\\text{B}T}$) of two rafts of radius $R=2.231$ (units of ${\\lambda_\\text{b}}$) for five different linear chirality profiles where the chirality varies linearly from ${q_\\text{r}}=1.42$ to ${q_\\text{b}}=-1.42$ over a distance $2 {L_\\text{tran}}$ centered on the edge of the raft. Here ${C_\\text{r}}=2.25$ and ${C_\\text{b}}=4.0$. \\label{interaction-chirality}}.\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{tilt_chirality_profile}\n\\caption{ Tilt angle $\\theta$ in a single raft of radius $R=2.231$ (in units of ${\\lambda_\\text{b}}$) as a function of the radial coordinate (units of ${\\lambda_\\text{b}}$) measured from the center of the raft for five different chirality profiles at the raft edge. The chirality profile is assumed to be linear with a width $2{L_\\text{tran}}$ centered at $x=R$. In each case ${q_\\text{r}}=1.42, {q_\\text{b}}=-1.42, {C_\\text{r}}=2.25$ and ${C_\\text{b}}=4.0$.\n\\label{fig:tilt-chirality-profile}}\n\\end{figure}\n\n\n\n\n\\subsubsection{ Comparison with experiments} To compare our theoretical results with the experimental data of Ref.~\\cite{key-41}, we convert our units to physical units using ${\\lambda_\\text{b}}=0.65\\mu$m and $K=125{k_\\text{B}T}$ \\citep{key-41}. The comparison is shown in Fig. \\ref{fig:Chirality-boundary-conditions-1}, where we plot the potential $\\phi$ as a function of $D$.\nSince in the experiments the background rods show stronger chirality\nand a shorter penetration depth than raft rods, we set $|{q_\\text{b}}|>|{q_\\text{r}}|$\nand ${\\lambda_\\text{r}}>{\\lambda_\\text{b}}$, and chose values by eye that provided the best fit. The theoretical results show reasonable agreement with the data. While there is at present not sufficient data to stringently test the validity of a fit with three parameters, the ability of the theory to predict the functional form of the interaction profile and the trend of the interaction strength with varying $R$ is insensitive to the adjustable parameter values.\n\n\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure8}\n\\protect\\caption{ Comparison of theoretical results for the raft interaction potential $\\phi$ (symbols) with experimental data (lines) \\cite{key-41}. Here, ${q_\\text{r}}=-1.42$,\n${q_\\text{b}}=2$, ${\\lambda_\\text{r}}=1.33{\\lambda_\\text{b}}$, chosen by eye to provide the best fit. Theoretical units were converted to physical units using ${\\lambda_\\text{b}}=0.65\\mu m$, $K=125 k_BT$.  \\label{fig:Chirality-boundary-conditions-1}}\n\\end{figure}\n\n\nA discrepancy between theory and experiment is that rescaling the experimentally measured interaction potentials by the maximum tilt angle $\\theta_{0}$ collapses the results onto a single curve \\citep{key-41}, whereas rescaling the theoretical interaction potentials in this manner brings the curves closer together but does not result in collapse. However, we note that the theoretical prediction of the boundary tilt angle is sensitive to the imposed chirality profile (Fig.~\\ref{fig:tilt-chirality-profile}). Moreover, since the experimental twist penetration length (over which most of the twist variation occurs) is on the order of the diffraction limit, it is not clear whether the theoretical value of $\\theta_0$ can be directly mapped onto the experimental value. Thus, more information about the structure of the experimental raft edges may be required to address this discrepancy.\n\n\n\\section{Conclusions}\n\\label{conclusions}\n\nMotivated by experiments \\cite{key-41} on colloidal membranes exhibiting chiral rafts floating in a background membrane, we have theoretically studied the director-mediated interaction between two such rafts. We numerically minimized the Frank free energy in the single elastic constant approximation on a two-dimensional mesh using the Newton-Gauss-Seidel method with adaptive mesh refinement near the raft edges. We computed the interaction between the rafts by comparing the free energy of the system (rafts plus background membrane) with a reference system in which the rafts are far apart and noninteracting. In agreement with the interpretation suggested in  Ref.~\\cite{key-41}, we found that the characteristic length scale of the interaction is the chiral penetration depth of the background membrane.  In particular, an isolated chiral raft in a background of rods with opposite chirality is stabilized by twisting of the background rods. The decay of this twist with distance from the raft is set by the membrane chiral penetration depth. Juxtaposing two rafts with an edge-to-edge separation less than twice the background penetration depth perturbs the preferred chiral twist in the background membrane between them, leading to a repulsive interaction.\nAs in the experiments, we found that the strength of the raft interaction increases with increasing raft diameter.   One discrepancy between our theory and the experiments is that Sharma et al. \\cite{key-41} found that rescaling the interaction by the tilt angle at the edge of a raft collapses the results for different sized rafts on to a single curve. Our theoretical curves come closer together upon rescaling, but do not fully collapse.\n\n\n\\appendix\n\n\\section{\\label{appendix} Discretizing the free energy}\nWe discretize $f_{n}$, Eq. (\\ref{fn}),  on a square grid using the finite difference method for first and second order partial derivatives of $\\theta$ and $\\varphi$ with respect to $x$ and  $y$. We consider three neighboring points along a coordinate direction to evaluate derivatives at the central point. We use the symmetric derivative approximation to the first derivative and the central difference approximation to the second derivative. However, because of the periodicity of $\\theta$  and $\\varphi$ and the equivalence of  $\\hat{\\mathbf n}$ and $-\\hat{\\mathbf n}$, some care is required as we now discuss.\n\nLet $\\hat{\\mathbf n}_{1}$, $\\hat{\\mathbf n}$ and $\\hat{\\mathbf n}_{2}$ be directors at\nthree neighboring grid points $A$, $B$ and $C$ located from left\nto right on the $x$ axis and we wish to evaluate the derivatives at the central point $B$.  For a fixed value of the central director $\\hat{\\mathbf n}$,\nfour possible rotations may occur for the three points: (1) $\\hat{\\mathbf n}_{1}$\nto $\\hat{\\mathbf n}$ to $\\hat{\\mathbf n}_{2}$, (2) $-\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$\nto $\\hat{\\mathbf n}_{2}$, (3) $\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$ to $-\\hat{\\mathbf n}_{2}$,\n(4) $-\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$ to $-\\hat{\\mathbf n}_{2}$. Among the four,\nwe select the one that minimizes the total rotation angle per unit distance and thus the Frank energy.\nFor example, for candidate (1), we compute the angle $\\alpha$ between\n$\\hat{\\mathbf n}_{1}$ and $\\hat{\\mathbf n}$, and the angle $\\beta$ between $\\hat{\\mathbf n}$\nand $\\hat{\\mathbf n}_{2}$. Then the total rotation angle per unit distance equals $\\alpha/\\overline{AB}+\\beta/\\overline{BC}$,\nwhere $\\overline{AB}$, $\\overline{BC}$ are the distances between the neighboring grid points  (these distances may not be equal due to mesh refinement).\nThe director  $-\\hat{\\mathbf n}$ corresponds to  $\\theta\\rightarrow \\pi-\\theta, \\varphi \\rightarrow\\varphi+\\pi$. Then we get the\nderivatives for $\\theta$ directly by finite difference method. For\n$\\varphi$, we need to consider $\\varphi+2\\pi$ and $\\varphi-2\\pi$\nas well, and we select the candidate which minimizes the sum of the\nfirst and second order derivatives.\n\n\\section{Tilt angle at interface between two semi-infinite membranes of different chiraility}\n\nIn this appendix we calculate exactly the value of the director tilt angle at the interface between two semi-infinite membranes of different chirality. If the membranes have equal and opposite chirality we find that the tilt angle has the same value as when a single semi-infinite membrane is bounded by a polymer depletant and zero director torque is assumed at the interface \\cite{Barry2009}.\n\nWe consider two semi-infinite membranes lying in the $x-y$ plane and in contact along the $y$ axis. The membrane in the $x>0$ half-plane has chirality $q_1>0$, while the one in the $x<0$ half-plane has chirality $q_2<0$. The symmetry of the semi-infinite geometry dictates that the director tilts by an angle $\\theta$ in the $y$ direction only and the free energy density $f_\\text{n}$ (Eq. (\\ref{fn})) simplifies to:\n\n", "itemtype": "equation", "pos": 10393, "prevtext": "\n\nWith the membrane normal chosen along the \\textit{z} axis,  $f_{n}$ is given by:\n\\begin{eqnarray}\nf_\\text{n}=\\frac{K}{2}&\\Biggl\\lbrack&\\biggl(\\frac{\\partial\\theta}{\\partial x}\\biggr)^2+\\biggl(\\frac{\\partial\\theta}{\\partial y}\\biggr)^{2}+\\sin^{2}\\theta\\biggl(\\biggl(\\frac{\\partial\\varphi}{\\partial x}\\biggr)^{2}+\\biggl(\\frac{\\partial\\varphi}{\\partial y}\\biggr)^2\\biggr)+2\\cos\\theta \\sin\\theta\\biggl(\\frac{\\partial\\theta}{\\partial x}\\frac{\\partial\\varphi}{\\partial y}-\\frac{\\partial\\theta}{\\partial y}\\frac{\\partial\\varphi}{\\partial x}\\biggr)+q^{2}\\Biggr\\rbrack\\nonumber\\\\\n&&{}-Kq\\biggl\\lbrack \\sin\\varphi\\frac{\\partial\\theta}{\\partial x}-\\cos\\varphi\\frac{\\partial\\theta}{\\partial y}+\\sin\\theta \\cos\\theta\\biggl(\\cos\\varphi\\frac{\\partial\\varphi}{\\partial x}+\\sin\\varphi\\frac{\\partial\\varphi}{\\partial y}\\biggr)\\biggr\\rbrack+\\frac{C}{2}\\sin^{2}\\theta\\label{fn}\n\\end{eqnarray}\n\n\n\nWe discretize the free energy density (see Appendix A for details) and then use the Newton-Gauss-Seidel method \\citep{key-76} to minimize its value. The Newton-Gauss-Seidel method is specified by \\cite{Stark}:\n\n", "index": 5, "text": "\\begin{align}\n\\theta^\\text{new}(x,y)&=\\theta^\\text{old}(x,y)-\\frac{\\delta f_\\text{n}/\\delta\\theta(x,y)}{`` \\delta^2 f_\\text{n}/\\delta^2 \\theta(x,y)\"} \\\\\n\\varphi^\\text{new}(x,y)&=\\varphi^\\text{old}(x,y)-\\frac{\\delta f_\\text{n}/\\delta\\varphi(x,y)}{`` \\delta^2 f_\\text{n}/\\delta^2 \\varphi(x,y)\" }\\label{eq:4.8b}\n \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\theta^{\\text{new}}(x,y)\" display=\"inline\"><mrow><msup><mi>θ</mi><mtext>new</mtext></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\theta^{\\text{old}}(x,y)-\\frac{\\delta f_{\\text{n}}/\\delta\\theta(%&#10;x,y)}{``\\delta^{2}f_{\\text{n}}/\\delta^{2}\\theta(x,y)&quot;}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msup><mi>θ</mi><mtext>old</mtext></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mrow><mi>δ</mi><mo>⁢</mo><msub><mi>f</mi><mtext>n</mtext></msub></mrow><mo>/</mo><mi>δ</mi></mrow><mo>⁢</mo><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">`</mi><mo>⁢</mo><mi mathvariant=\"normal\">`</mi><mo>⁢</mo><msup><mi>δ</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>f</mi><mtext>n</mtext></msub></mrow><mo>/</mo><msup><mi>δ</mi><mn>2</mn></msup></mrow><mo>⁢</mo><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">\"</mi></mrow></mfrac></mstyle></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\varphi^{\\text{new}}(x,y)\" display=\"inline\"><mrow><msup><mi>φ</mi><mtext>new</mtext></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\varphi^{\\text{old}}(x,y)-\\frac{\\delta f_{\\text{n}}/\\delta%&#10;\\varphi(x,y)}{``\\delta^{2}f_{\\text{n}}/\\delta^{2}\\varphi(x,y)&quot;}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msup><mi>φ</mi><mtext>old</mtext></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mrow><mi>δ</mi><mo>⁢</mo><msub><mi>f</mi><mtext>n</mtext></msub></mrow><mo>/</mo><mi>δ</mi></mrow><mo>⁢</mo><mi>φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">`</mi><mo>⁢</mo><mi mathvariant=\"normal\">`</mi><mo>⁢</mo><msup><mi>δ</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>f</mi><mtext>n</mtext></msub></mrow><mo>/</mo><msup><mi>δ</mi><mn>2</mn></msup></mrow><mo>⁢</mo><mi>φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">\"</mi></mrow></mfrac></mstyle></mrow></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nwhere the local chirality $q(x)$ is specified above.\nThe corresponding Euler-Lagrange equation is given by:\n\n", "itemtype": "equation", "pos": 35559, "prevtext": "\nwhere ``ï¿½ï¿½$\\delta^{2}f_\\text{n}/\\delta^{2}\\theta(x,y)$'' is calculated as the derivative of $\\delta f_\\text{n}/\\delta\\theta(x,y)$\nwith respect to $\\theta(x,y)$ at a grid point $(x,y)$ and similarly for $\\varphi$. The quotation marks indicate that these derivatives are not the discretized form of a real second-order functional derivative, which would involve a delta function \\cite{Stark}. The iteration is repeated until the change in the total free energy of the system is less than one part in $10^7$.\n\nWe consider a grid of points in a square box of side $L=60$ (measured in units of the twist penetration\ndepth $\\lambda$) with periodic boundary conditions. The box is meant to represent a small portion of the membrane far from its edge. The initial spacing between neighboring grid points is 0.5, yielding a grid of $120\\times120$ points. Within this box we place two rafts, defined as discrete circular areas of radius $R$. For grid points lying inside the rafts $q={q_\\text{r}}$, while for points outside $q= {q_\\text{b}}$, where ${q_\\text{r}}$ and ${q_\\text{b}}$ have opposite signs and possibly different magnitudes. We initialize the director at each grid point in the box as a small random fluctuation about the $z$ axis and relax the system using Eq.~(\\ref{eq:4.8b}). After a few thousand steps (each step being a loop over all grid points), the grid close to the edges\nof the rafts is refined by adaptive mesh refinement \\citep{key-67}. Figure \\ref{fig:A-simple-grid} shows a simple example of mesh refinement applied to a single raft. After the system equilibrates, the interaction potential (measured in units of $K$) between the two rafts is extracted by comparing\nthe total free energy of the system with that of a reference system where the two rafts are far enough apart that no significant interaction exists.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure1}\n\\protect\\caption{Illustration of mesh refinement for a single raft of radius 4 centered at (10,10). A much finer grid was utilized in obtaining our results. \\label{fig:A-simple-grid}}\n\\end{figure}\n\n\\section{Results}\n\\label{results}\n\n\n\\subsection{Single raft\\label{sub:Single-raft}}\n\nWe first investigate a single raft of radius $R$ with chirality equal in magnitude and opposite in sign to the surrounding background, i.e., ${q_\\text{b}}=-{q_\\text{r}}=q$. We assume that the tilt modulus $C$ has the same value within the raft and the background membrane, i.e., ${C_\\text{r}}={C_\\text{b}}$; thus, the penetration depth $\\lambda=\\sqrt{K/C}$ has a common value as well.  For simplicity we assume that the sign of the chirality changes abruptly at the edge of the raft; we consider other chirality  profiles when we study two rafts. Figure \\ref{fig:a)-Plot-of} shows the tilt angle $\\theta_{0}$ at the raft boundary as a function of $R$ (measured in units of $\\lambda$). We have chosen $q=0.71$, the value used in Ref.~\\cite{PelcovitsMeyer}, where circular membranes bounded by the polymer depletant solution were studied by numerically solving the Euler-Lagrange equation for $f_\\text{n}$. In that case the relevant boundary conditions were zero tilt at the center of the membrane and zero director torque at the edge. From the figure we see that, in the case of the raft surrounded by a chiral membrane of opposite chirality, the value of $\\theta_0$ is larger than in similarly sized circular membranes surrounded by depletant \\cite{PelcovitsMeyer}, although this difference decreases as $R$ increases. This decrease at large $R$ is consistent with an analytic calculation (see Appendix B) of $\\theta_0$ at the interface between two \\textit{semi-infinite} membranes of equal and opposite chirality. This calculation yields the same value for $\\theta_0$ as found in Ref.~\\cite{Barry2009} for a semi-infinite membrane bounded by a polymer depletant with zero director torque at the boundary.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Raft_Figure_2}\n\\protect\\caption{Tilt angle $\\theta_{0}$ (stars) at the edge of a single raft as a function of\nthe raft radius $R$ (measured in units of  $\\lambda$) with $q=0.71$ in a background membrane with chirality equal in magnitude and opposite in sign. The solid circles are the corresponding tilt angle values from Ref. \\cite{PelcovitsMeyer} for circular membranes surrounded by depletant. \\label{fig:a)-Plot-of}}\n\\end{figure}\n\n\n\nFigure \\ref{fig:Plots-of-tilt} shows the tilt angle $\\theta$\nthrough a cross section of the raft and background membrane.  In the figure we compare our results to those obtained in Ref.~\\cite{PelcovitsMeyer}  for  circular membranes surrounded by depletant.  From the figure we see that as  $R$ increases, the $\\theta$ profile for the raft becomes more symmetric about the edge of the raft and is almost perfectly symmetric once $R\\gtrsim 5$ and  $\\theta$ decays nearly to zero at the center of the raft. This approximate critical value of $R$ was also noted in Ref.~\\cite{PelcovitsMeyer} for the tilt profile in isolated circular membranes. From the figure we also see how the system accommodates the opposite chiralities of the raft and background.  Starting from the center of the raft and moving outward, the tilt angle grows, following the twist preferred by the raft rods, until reaching the edge of the raft. As one moves into the background membrane where the viruses have opposite chirality, the rods twist in the opposite sense and the tilt angle decreases.\n\n\n\\begin{figure}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R10}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R5}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R25}\n\\includegraphics[scale=0.4]{Raft_Figure_3_R125}\n\\protect\\caption{ Tilt angle $\\theta$ (solid line) in a single raft surrounded by a background membrane of equal and opposite chirality ($q=0.71$) as a function of the $x$ coordinate (units of $\\lambda$) measured from the center of the raft. The values of $\\theta$ are compared with the results (dashed curve) found in Ref.~\\cite{PelcovitsMeyer} for circular membranes surrounded by depletant.  The centers of the raft and the circular membrane are both located at the origin. The vertical dashed-dotted line denotes the edge of the raft and circular membrane. \\label{fig:Plots-of-tilt}}\n\\end{figure}\n\n\nTo check the accuracy of our model, we computed $\\theta_0$, the tilt angle at the edge of the raft, for different mesh sizes. Our results are shown in Figure\n\\ref{fig:raft mesh sensitivity}, where the horizontal axis shows the smallest mesh size at each\nrefinement level, and the value of $\\theta_{0}$ is taken as an indicator of the influence of refinement levels. The\ninitial coarse mesh size is 0.5. Three different raft sizes were tested,\nand the result shows that $\\theta_{0}$ converges at the same rate\nfor all three raft sizes as the mesh size is decreased, which indicates that\nour method is numerically consistent.\n\n\\begin{figure}\n\\includegraphics[scale=0.45]{meshsize}\n\\protect\\caption{ Dependence of  $\\theta_{0}$, the tilt angle at the raft edge, on mesh\nrefinement $h$ with $q=0.71$ for four different values of raft radius (measured in units of $\\lambda$). The horizontal axis is the finest mesh\nsize level (i.e., near the raft edge), measured in units of $\\lambda$.   \\label{fig:raft mesh sensitivity}}\n\\end{figure}\n\n\n\n\\subsection{Two rafts\\label{sub:Two-rafts}}\n\nWe now consider the more complex and interesting situation of two rafts composed of molecules of the same chirality fixed in a background membrane of opposite (but not necessarily equal) chirality. We relax the constraints ${\\lambda_\\text{b}}={\\lambda_\\text{r}}$ (i.e., ${C_\\text{b}}={C_\\text{r}}$) and $|{q_\\text{b}}|=|{q_\\text{r}}|$ so that we can explore the parameter space more fully, and compare our results with data from the experiments \\cite{key-41}.  As in the case of a single raft, we use adaptive mesh refinement near the edges of the rafts, and compute the tilt angle and raft interaction potential as functions of the edge-to-edge separation $D$ of the rafts measured in units of ${\\lambda_\\text{b}}$ (we explain below why we choose to measure lengths in units of ${\\lambda_\\text{b}}$ rather than ${\\lambda_\\text{r}}$). Figure \\ref{fig:tilt-angle-} shows grayscale plots for the tilt angle computed by minimizing $f_\\text{n}$ for two rafts of radius $R=4$ at several values of $D$  for the case  ${\\lambda_\\text{b}}={\\lambda_\\text{r}}$. The lightest rings in the figure (corresponding to the maximum value of $\\theta$) occur near the edges of the rafts. The figure illustrates the origin of the repulsive force between rafts already discussed in Ref.~\\cite{key-41}. When the rafts are far apart (Figs.~\\ref{fig:tilt-angle-}~c, d), the regions of maximum $\\theta$ are full circles centered on the raft centers. As in the case of a single raft (see Fig.~\\ref{fig:Plots-of-tilt}), starting from the center of one of the rafts and moving radially outward, the tilt angle grows until reaching the edge of the raft, then decreases as one moves into the background membrane where the viruses have opposite chirality. As the second raft is approached, the tilt angle begins to grow again until it reaches the edge of the raft, subsequently decreasing as one enters the raft interior. Thus, the preferred chiral twist in both the rafts and the background near their interfaces is satisfied. However, when the edges of the rafts are separated by a distance less than $2{\\lambda_\\text{b}}$ the preferred twist is no longer fully satisfied, as indicated in Figs.~\\ref{fig:tilt-angle-}a, b.\n\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure_5a}\n\\includegraphics[scale=0.5]{Figure_5b}\n\\includegraphics[scale=0.5]{Figure_5c}\n\\includegraphics[scale=0.5]{Figure_5d}\n\\raggedleft{}\\protect\\caption{ Tilt angle $\\theta$ profile for a system of two rafts with radius $R=5$ and\n${q_\\text{b}}=-{q_\\text{r}}=0.71$, for four values of the edge-to-edge separation $D$ of the rafts (which is given by their center-to-center separation minus the raft diameter). The value of $\\theta$ is indicated by the grayscale bar to the right of each figure. Here we choose ${\\lambda_\\text{r}}={\\lambda_\\text{b}}=\\lambda$ and measure lengths in units of $\\lambda$.  The figure shows a portion of the total system, which is a square of side $L=60$. The maximum tilt angle $\\theta_{0}$ occurs at the edge of the rafts. (a) $D=0$, (b) $D=1$, (c) $D=2$,\n(d) $D=4$. \\label{fig:tilt-angle-}}\n\\end{figure}\n\n\\subsubsection{ Dependence of the interaction strength on control parameters} The above discussion suggests that the characteristic length scale of the raft interaction is ${\\lambda_\\text{b}}$, the twist penetration depth in the background membrane. We confirm this assertion by comparing the interaction as a function of the raft separation in units of ${\\lambda_\\text{r}}$ and in units of ${\\lambda_\\text{b}}$ .  Figures \\ref{fig:Rafts-proof-lambda_b}a and \\ref{fig:Rafts-proof-lambda_b}c show the raft interaction measured in units of ${\\lambda_\\text{r}}$.  In Fig. \\ref{fig:Rafts-proof-lambda_b}a the values of ${\\lambda_\\text{r}}$ and $R$ are held fixed while ${\\lambda_\\text{b}}$ is varied; in Fig.~\\ref{fig:Rafts-proof-lambda_b}c the value of ${\\lambda_\\text{b}}$ is held fixed while ${\\lambda_\\text{r}}$ and $R$ are varied (such that ${\\lambda_\\text{r}} R$ is held fixed). Figures \\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d show the raft interaction measured in units of ${\\lambda_\\text{b}}$ . In Fig. \\ref{fig:Rafts-proof-lambda_b}b the value of ${\\lambda_\\text{r}}$ is held fixed while ${\\lambda_\\text{b}}$ and $R$ are varied (such that ${\\lambda_\\text{b}} R$ is held fixed); in Fig. \\ref{fig:Rafts-proof-lambda_b}d  the values of ${\\lambda_\\text{b}}$ and $R$ are held fixed while ${\\lambda_\\text{r}}$ is varied. All other parameters are kept fixed. From Figs.~\\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d we can see clearly that the interaction curves for rafts of different radii and values of ${\\lambda_\\text{r}}$ collapse when we measure lengths in units of ${\\lambda_\\text{b}}$.\n\nGiven that the raft interaction is mediated by the twist in the intervening background, we expect the range of the interaction to be determined by the distance over which the tilt angle in the background is appreciably larger than zero. As we saw in Fig. \\ref{fig:Plots-of-tilt} this distance is approximately 5 (in units of ${\\lambda_\\text{b}}$), and we see from Figs. \\ref{fig:Rafts-proof-lambda_b}b and \\ref{fig:Rafts-proof-lambda_b}d that the interaction potential $\\phi$ has dropped by an order of magnitude when $D\\approx 5 {\\lambda_\\text{b}}$.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure6a}\n\\includegraphics[scale=0.5]{Figure6b}\n\\includegraphics[scale=0.5]{Figure6c}\n\\includegraphics[scale=0.5]{Figure6d}\n\\protect\\caption{ Raft interaction potential $\\phi$ (units of $k_B T$) as a function of edge-to-edge separation. (a) and\n(b):  ${\\lambda_\\text{r}}=0.5$,  $R=3{\\lambda_\\text{r}}$; in (a) all lengths\nare in units of ${\\lambda_\\text{r}}$, in (b) all lengths are in units of ${\\lambda_\\text{b}}$; (c) and (d): ${\\lambda_\\text{b}}=0.5$, $R=3{\\lambda_\\text{b}}$; in (c) all lengths are in units of ${\\lambda_\\text{r}}$; in (d) all lengths are in units of ${\\lambda_\\text{b}}$. Note the collapse of the curves in (b) and (d) where the unit of length is ${\\lambda_\\text{b}}$.   \\label{fig:Rafts-proof-lambda_b}}\n\\end{figure}\n\nSince the interaction range is determined by ${\\lambda_\\text{b}}$, we keep ${\\lambda_\\text{b}}=1$ throughout the following analysis and consider  the dependence of the interaction strength on ${q_\\text{b}}$, ${q_\\text{r}}$, ${C_\\text{r}}$ and $R$.  Figure \\ref{fig:Rafts-interaction-strength} shows the effects of these\nparameters on the raft interaction, by plotting on a semi-log scale the raft interaction as a function of $D$. In each case, the data is fit to an exponential form with decay length 1 (in units of ${\\lambda_\\text{b}}$).  We see that all of these parameters have very little effect on the decay length,  supporting the assertion made above that ${\\lambda_\\text{b}}$ determines the range of the interaction.\n From the figure we see that increasing the values of ${q_\\text{b}}$, $|{q_\\text{r}}|$ or $R$ increases the strength of the interaction, while increasing the value of  ${C_\\text{r}}$ decreases the strength. This result is readily understood in physical terms: increasing ${q_\\text{b}}$ or $|{q_\\text{r}}|$ leads to a larger value of the tilt angle at the raft edge, increasing  $R$ leads to a greater area of overlapped twisted domains for a given edge-to-edge distance, while increasing ${C_\\text{r}}$ leads to a smaller value of the tilt angle at the raft edge.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure7_a}\n\\includegraphics[scale=0.5]{Figure7_b}\n\\includegraphics[scale=0.5]{Figure7_c}\n\\includegraphics[scale=0.5]{Figure7_d}\n\\protect\\caption{ Dependence of raft interaction $\\phi$ (units of $k_B T$) on ${q_\\text{b}}$, ${q_\\text{r}}$, ${C_\\text{r}}$ and $R$. All lengths are measured in units of ${\\lambda_\\text{b}}$ and ${C_\\text{b}}=4$. The exponential expressions in the legend are fits to the data.  (a) ${q_\\text{r}}=-0.355$, ${\\lambda_\\text{r}}=1.333$, $R=2.231$. b) ${q_\\text{b}}=2$, ${\\lambda_\\text{r}}=1.333$, $R=2.231$. c) ${q_\\text{r}}=-1.42$, ${q_\\text{b}}=1.42$, $R=2.231$. d) ${q_\\text{r}}=-1.42$, ${q_\\text{b}}=1.42$, ${\\lambda_\\text{r}}=1.333$.   \\label{fig:Rafts-interaction-strength}}\n\\end{figure}\n\nIn Sec. \\ref{sub:Single-raft} we  assumed that the chirality jumped discontinuously  from ${q_\\text{r}}$ to ${q_\\text{b}}$  at the raft edge. In studying the interaction between two rafts, we have also considered a linear chirality profile of width $2{L_\\text{tran}}$ centered on the edge of the raft, exploring five values of ${L_\\text{tran}}/R$ (Fig.~\\ref{interaction-chirality}). We find that the interaction is insensitive to the value of ${L_\\text{tran}}/R$ except at large raft separations, $D\\gtrsim 7$. In figs.~\\ref{fig:Rafts-proof-lambda_b}, \\ref{fig:Rafts-interaction-strength} and \\ref {fig:Chirality-boundary-conditions-1} we have set ${L_\\text{tran}}/R=0.045$.   We have also considered the effect of the chirality profile on the tilt angle. Figure \\ref{fig:tilt-chirality-profile} shows that the tilt angle at the edge of the raft changes by more than 15\\% as ${L_\\text{tran}}$ is varied, a surprising result given the insensitivity of the raft interaction potential to the width of the chirality transition.\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{interaction-chirality}\n\\caption{Raft interaction potential $\\phi$ (units of ${k_\\text{B}T}$) of two rafts of radius $R=2.231$ (units of ${\\lambda_\\text{b}}$) for five different linear chirality profiles where the chirality varies linearly from ${q_\\text{r}}=1.42$ to ${q_\\text{b}}=-1.42$ over a distance $2 {L_\\text{tran}}$ centered on the edge of the raft. Here ${C_\\text{r}}=2.25$ and ${C_\\text{b}}=4.0$. \\label{interaction-chirality}}.\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{tilt_chirality_profile}\n\\caption{ Tilt angle $\\theta$ in a single raft of radius $R=2.231$ (in units of ${\\lambda_\\text{b}}$) as a function of the radial coordinate (units of ${\\lambda_\\text{b}}$) measured from the center of the raft for five different chirality profiles at the raft edge. The chirality profile is assumed to be linear with a width $2{L_\\text{tran}}$ centered at $x=R$. In each case ${q_\\text{r}}=1.42, {q_\\text{b}}=-1.42, {C_\\text{r}}=2.25$ and ${C_\\text{b}}=4.0$.\n\\label{fig:tilt-chirality-profile}}\n\\end{figure}\n\n\n\n\n\\subsubsection{ Comparison with experiments} To compare our theoretical results with the experimental data of Ref.~\\cite{key-41}, we convert our units to physical units using ${\\lambda_\\text{b}}=0.65\\mu$m and $K=125{k_\\text{B}T}$ \\citep{key-41}. The comparison is shown in Fig. \\ref{fig:Chirality-boundary-conditions-1}, where we plot the potential $\\phi$ as a function of $D$.\nSince in the experiments the background rods show stronger chirality\nand a shorter penetration depth than raft rods, we set $|{q_\\text{b}}|>|{q_\\text{r}}|$\nand ${\\lambda_\\text{r}}>{\\lambda_\\text{b}}$, and chose values by eye that provided the best fit. The theoretical results show reasonable agreement with the data. While there is at present not sufficient data to stringently test the validity of a fit with three parameters, the ability of the theory to predict the functional form of the interaction profile and the trend of the interaction strength with varying $R$ is insensitive to the adjustable parameter values.\n\n\n\n\\begin{figure}\n\\includegraphics[scale=0.5]{Figure8}\n\\protect\\caption{ Comparison of theoretical results for the raft interaction potential $\\phi$ (symbols) with experimental data (lines) \\cite{key-41}. Here, ${q_\\text{r}}=-1.42$,\n${q_\\text{b}}=2$, ${\\lambda_\\text{r}}=1.33{\\lambda_\\text{b}}$, chosen by eye to provide the best fit. Theoretical units were converted to physical units using ${\\lambda_\\text{b}}=0.65\\mu m$, $K=125 k_BT$.  \\label{fig:Chirality-boundary-conditions-1}}\n\\end{figure}\n\n\nA discrepancy between theory and experiment is that rescaling the experimentally measured interaction potentials by the maximum tilt angle $\\theta_{0}$ collapses the results onto a single curve \\citep{key-41}, whereas rescaling the theoretical interaction potentials in this manner brings the curves closer together but does not result in collapse. However, we note that the theoretical prediction of the boundary tilt angle is sensitive to the imposed chirality profile (Fig.~\\ref{fig:tilt-chirality-profile}). Moreover, since the experimental twist penetration length (over which most of the twist variation occurs) is on the order of the diffraction limit, it is not clear whether the theoretical value of $\\theta_0$ can be directly mapped onto the experimental value. Thus, more information about the structure of the experimental raft edges may be required to address this discrepancy.\n\n\n\\section{Conclusions}\n\\label{conclusions}\n\nMotivated by experiments \\cite{key-41} on colloidal membranes exhibiting chiral rafts floating in a background membrane, we have theoretically studied the director-mediated interaction between two such rafts. We numerically minimized the Frank free energy in the single elastic constant approximation on a two-dimensional mesh using the Newton-Gauss-Seidel method with adaptive mesh refinement near the raft edges. We computed the interaction between the rafts by comparing the free energy of the system (rafts plus background membrane) with a reference system in which the rafts are far apart and noninteracting. In agreement with the interpretation suggested in  Ref.~\\cite{key-41}, we found that the characteristic length scale of the interaction is the chiral penetration depth of the background membrane.  In particular, an isolated chiral raft in a background of rods with opposite chirality is stabilized by twisting of the background rods. The decay of this twist with distance from the raft is set by the membrane chiral penetration depth. Juxtaposing two rafts with an edge-to-edge separation less than twice the background penetration depth perturbs the preferred chiral twist in the background membrane between them, leading to a repulsive interaction.\nAs in the experiments, we found that the strength of the raft interaction increases with increasing raft diameter.   One discrepancy between our theory and the experiments is that Sharma et al. \\cite{key-41} found that rescaling the interaction by the tilt angle at the edge of a raft collapses the results for different sized rafts on to a single curve. Our theoretical curves come closer together upon rescaling, but do not fully collapse.\n\n\n\\appendix\n\n\\section{\\label{appendix} Discretizing the free energy}\nWe discretize $f_{n}$, Eq. (\\ref{fn}),  on a square grid using the finite difference method for first and second order partial derivatives of $\\theta$ and $\\varphi$ with respect to $x$ and  $y$. We consider three neighboring points along a coordinate direction to evaluate derivatives at the central point. We use the symmetric derivative approximation to the first derivative and the central difference approximation to the second derivative. However, because of the periodicity of $\\theta$  and $\\varphi$ and the equivalence of  $\\hat{\\mathbf n}$ and $-\\hat{\\mathbf n}$, some care is required as we now discuss.\n\nLet $\\hat{\\mathbf n}_{1}$, $\\hat{\\mathbf n}$ and $\\hat{\\mathbf n}_{2}$ be directors at\nthree neighboring grid points $A$, $B$ and $C$ located from left\nto right on the $x$ axis and we wish to evaluate the derivatives at the central point $B$.  For a fixed value of the central director $\\hat{\\mathbf n}$,\nfour possible rotations may occur for the three points: (1) $\\hat{\\mathbf n}_{1}$\nto $\\hat{\\mathbf n}$ to $\\hat{\\mathbf n}_{2}$, (2) $-\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$\nto $\\hat{\\mathbf n}_{2}$, (3) $\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$ to $-\\hat{\\mathbf n}_{2}$,\n(4) $-\\hat{\\mathbf n}_{1}$ to $\\hat{\\mathbf n}$ to $-\\hat{\\mathbf n}_{2}$. Among the four,\nwe select the one that minimizes the total rotation angle per unit distance and thus the Frank energy.\nFor example, for candidate (1), we compute the angle $\\alpha$ between\n$\\hat{\\mathbf n}_{1}$ and $\\hat{\\mathbf n}$, and the angle $\\beta$ between $\\hat{\\mathbf n}$\nand $\\hat{\\mathbf n}_{2}$. Then the total rotation angle per unit distance equals $\\alpha/\\overline{AB}+\\beta/\\overline{BC}$,\nwhere $\\overline{AB}$, $\\overline{BC}$ are the distances between the neighboring grid points  (these distances may not be equal due to mesh refinement).\nThe director  $-\\hat{\\mathbf n}$ corresponds to  $\\theta\\rightarrow \\pi-\\theta, \\varphi \\rightarrow\\varphi+\\pi$. Then we get the\nderivatives for $\\theta$ directly by finite difference method. For\n$\\varphi$, we need to consider $\\varphi+2\\pi$ and $\\varphi-2\\pi$\nas well, and we select the candidate which minimizes the sum of the\nfirst and second order derivatives.\n\n\\section{Tilt angle at interface between two semi-infinite membranes of different chiraility}\n\nIn this appendix we calculate exactly the value of the director tilt angle at the interface between two semi-infinite membranes of different chirality. If the membranes have equal and opposite chirality we find that the tilt angle has the same value as when a single semi-infinite membrane is bounded by a polymer depletant and zero director torque is assumed at the interface \\cite{Barry2009}.\n\nWe consider two semi-infinite membranes lying in the $x-y$ plane and in contact along the $y$ axis. The membrane in the $x>0$ half-plane has chirality $q_1>0$, while the one in the $x<0$ half-plane has chirality $q_2<0$. The symmetry of the semi-infinite geometry dictates that the director tilts by an angle $\\theta$ in the $y$ direction only and the free energy density $f_\\text{n}$ (Eq. (\\ref{fn})) simplifies to:\n\n", "index": 7, "text": "\\begin{equation}\nf_\\text{n}=\\frac{K}{2}\\biggl(\\frac{d\\theta}{dx}-q(x) \\biggr)^2+\\frac{C}{2}\\sin^{2}\\theta\\label{fnB},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"f_{\\text{n}}=\\frac{K}{2}\\biggl{(}\\frac{d\\theta}{dx}-q(x)\\biggr{)}^{2}+\\frac{C}%&#10;{2}\\sin^{2}\\theta,\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mtext>n</mtext></msub><mo>=</mo><mrow><mrow><mfrac><mi>K</mi><mn>2</mn></mfrac><mo>⁢</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac><mo>-</mo><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><mrow><mfrac><mi>C</mi><mn>2</mn></mfrac><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nwith $\\lambda=\\sqrt{K/C}$.  For the assumed discontinuous jump in the chirality we have:\n\n", "itemtype": "equation", "pos": 35800, "prevtext": "\nwhere the local chirality $q(x)$ is specified above.\nThe corresponding Euler-Lagrange equation is given by:\n\n", "index": 9, "text": "\\begin{equation}\n\\lambda^2\\frac{d^2\\theta}{dx^2} -\\lambda^2\\frac{dq}{dx}- \\sin2\\theta=0,\n\\label{EL}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\lambda^{2}\\frac{d^{2}\\theta}{dx^{2}}-\\lambda^{2}\\frac{dq}{dx}-\\sin 2\\theta=0,\" display=\"block\"><mrow><mrow><mrow><mrow><msup><mi>λ</mi><mn>2</mn></msup><mo>⁢</mo><mfrac><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mi>θ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>x</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>-</mo><mrow><msup><mi>λ</mi><mn>2</mn></msup><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>q</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac></mrow><mo>-</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mn>2</mn><mo>⁢</mo><mi>θ</mi></mrow></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nIntegrating Eq.~(\\ref{EL}) from $x=-\\epsilon$ to $x=\\epsilon$ we find in the limit $\\epsilon\\rightarrow0$:\n\n", "itemtype": "equation", "pos": 36004, "prevtext": "\nwith $\\lambda=\\sqrt{K/C}$.  For the assumed discontinuous jump in the chirality we have:\n\n", "index": 11, "text": "\\begin{equation}\n\\frac{dq}{dx} = (q_1 + |q_2|)\\delta(x).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\frac{dq}{dx}=(q_{1}+|q_{2}|)\\delta(x).\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>q</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>q</mi><mn>1</mn></msub><mo>+</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>q</mi><mn>2</mn></msub><mo stretchy=\"false\">|</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nThe first integral of the Euler-Lagrange equation is given by:\n\n", "itemtype": "equation", "pos": 36183, "prevtext": "\nIntegrating Eq.~(\\ref{EL}) from $x=-\\epsilon$ to $x=\\epsilon$ we find in the limit $\\epsilon\\rightarrow0$:\n\n", "index": 13, "text": "\\begin{equation}\n\\frac{d\\theta}{dx}\\biggr\\vert^{\\epsilon}_{-\\epsilon}=q_1+|q_2|.\n\\label{eq1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\frac{d\\theta}{dx}\\biggr{|}^{\\epsilon}_{-\\epsilon}=q_{1}+|q_{2}|.\" display=\"block\"><mrow><mrow><msubsup><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac><mo fence=\"true\" maxsize=\"210%\" minsize=\"210%\">|</mo></mrow><mrow><mo>-</mo><mi>ϵ</mi></mrow><mi>ϵ</mi></msubsup><mo>=</mo><mrow><msub><mi>q</mi><mn>1</mn></msub><mo>+</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>q</mi><mn>2</mn></msub><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nwhere the upper and lower signs correspond to $x>0$ and $x<0$, respectively.\nCombining Eqs.(\\ref{eq1}) and (\\ref{eq2}) we obtain in the limit $\\epsilon\\rightarrow0$:\n\n", "itemtype": "equation", "pos": 36354, "prevtext": "\nThe first integral of the Euler-Lagrange equation is given by:\n\n", "index": 15, "text": "\\begin{equation}\n\\lambda\\frac{d\\theta}{dx}=\\pm \\sin\\theta,\n\\label{eq2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\lambda\\frac{d\\theta}{dx}=\\pm\\sin\\theta,\" display=\"block\"><mrow><mrow><mrow><mi>λ</mi><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>θ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>x</mi></mrow></mfrac></mrow><mo>=</mo><mrow><mo>±</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08232.tex", "nexttext": "\nwhere we have assumed that $\\theta$ is continuous at the interface, $x=0$.\nFrom Eq. (\\ref{eq3}) we see that if $q_1=-q_2=q$ then $\\sin \\theta(0) = \\lambda q$ which is identical to the result found in Ref.~\\cite{Barry2009} for a semi-infinite membrane bounded by a polymer depletant imposing zero director torque at the interface.\n\n\n\n\n\\begin{acknowledgments}\n\nWe thank Z. Dogic, R. Sakhardande and P. Sharma for helpful discussions.  This work was supported by the NSF through MRSEC Grant No. 1420382.\n\n\\end{acknowledgments}\n\n\n\n\\begin{thebibliography}{53}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname bibnamefont\\endcsname\\relax\n  \\def\\bibnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname bibfnamefont\\endcsname\\relax\n  \\def\\bibfnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname citenamefont\\endcsname\\relax\n  \\def\\citenamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem[{\\citenamefont{Dogic et~al.}(2014)\\citenamefont{Dogic, Sharma, and\n  Zakhary}}]{Dogic2014}\n\\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{Sharma}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.~J.} \\bibnamefont{Zakhary}},\n  \\bibinfo{journal}{Ann. Rev. Cond. Matt. Phys.}\n  \\textbf{\\bibinfo{volume}{5}}, \\bibinfo{pages}{137} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Barry and Dogic}(2010)}]{Barry2010}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}},\n  \\bibinfo{journal}{Proc. Nat. Acad. Sci.} \\textbf{\\bibinfo{volume}{107}},\n  \\bibinfo{pages}{10348} (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Gibaud et~al.}(2012)\\citenamefont{Gibaud, Barry,\n  Zakhary, Henglin, Ward, Yang, Berciu, Oldenbourg, Hagan, Nicastro\n  et~al.}}]{Gibaud2012}\n\\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Gibaud}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}},\n  \\bibinfo{author}{\\bibfnamefont{M.~J.} \\bibnamefont{Zakhary}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Henglin}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Ward}},\n  \\bibinfo{author}{\\bibfnamefont{Y.~S.} \\bibnamefont{Yang}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Berciu}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Oldenbourg}},\n  \\bibinfo{author}{\\bibfnamefont{M.~F.} \\bibnamefont{Hagan}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Nicastro}},\n  \\bibinfo{author}{\\bibfnamefont{R.~B.}~\\bibnamefont{Meyer}}  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}}, \\bibinfo{journal}{Nature}\n  \\textbf{\\bibinfo{volume}{481}}, \\bibinfo{pages}{348} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Yang et~al.}(2012)\\citenamefont{Yang, Barry, Dogic, and\n  Hagan}}]{Yang2012}\n\\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Yang}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}},\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.~F.} \\bibnamefont{Hagan}},\n  \\bibinfo{journal}{Soft Matter} \\textbf{\\bibinfo{volume}{8}},\n  \\bibinfo{pages}{707} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Yang and Hagan}(2011)}]{Yang2011}\n\\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Yang}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.~F.} \\bibnamefont{Hagan}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{84}},\n  \\bibinfo{pages}{051402} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Barry et~al.}(2009{\\natexlab{a}})\\citenamefont{Barry,\n  Beller, and Dogic}}]{Barry2009a}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Beller}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}},\n  \\bibinfo{journal}{Soft Matter} \\textbf{\\bibinfo{volume}{5}},\n  \\bibinfo{pages}{2563} (\\bibinfo{year}{2009}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Barry et~al.}(2009{\\natexlab{b}})\\citenamefont{Barry,\n  Dogic, Meyer, Pelcovits, and Oldenbourg}}]{Barry2009}\n\\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}},\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}},\n  \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}},\n  \\bibinfo{author}{\\bibfnamefont{R.~A.} \\bibnamefont{Pelcovits}}\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Oldenbourg}},\n  \\bibinfo{journal}{J. Phys. Chem. B} \\textbf{\\bibinfo{volume}{113}},\n  \\bibinfo{pages}{3910} (\\bibinfo{year}{2009}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Zakhary et~al.}(2014)\\citenamefont{Zakhary, Gibaud,\n  Nadir~Kaplan, Barry, Oldenbourg, Meyer, and Dogic}}]{Zakhary2014}\n\\bibinfo{author}{\\bibfnamefont{M.~J.} \\bibnamefont{Zakhary}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Gibaud}},\n  \\bibinfo{author}{\\bibfnamefont{C.~N.}~\\bibnamefont{Kaplan}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Barry}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Oldenbourg}},\n  \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}},\n  \\bibinfo{journal}{Nat. Commun.} \\textbf{\\bibinfo{volume}{5}}, \\bibinfo{pages}{3063}\n  (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Kang et~al.}(2015)\\citenamefont{Kang, Gibaud, Dogic,\n  and Lubensky}}]{Kang2015}\n\\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Kang}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Gibaud}},\n  \\bibinfo{author}{\\bibfnamefont{Z.}~\\bibnamefont{Dogic}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.~C.} \\bibnamefont{Lubensky}},\n  \\bibinfo{journal}{arXiv:1507.00746}  (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Kaplan and Meyer}(2014)}]{Kaplan2014}\n\\bibinfo{author}{\\bibfnamefont{C.~N.} \\bibnamefont{Kaplan}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}},\n  \\bibinfo{journal}{Soft Matter} \\textbf{\\bibinfo{volume}{10}},\n  \\bibinfo{pages}{4700} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Kaplan et~al.}(2013)\\citenamefont{Kaplan, Gibaud, and\n  Meyer}}]{Kaplan2013}\n\\bibinfo{author}{\\bibfnamefont{C.~N.} \\bibnamefont{Kaplan}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Gibaud}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}},\n  \\bibinfo{journal}{Soft Matter} \\textbf{\\bibinfo{volume}{9}},\n  \\bibinfo{pages}{8210} (\\bibinfo{year}{2013}).\n\n\n\n\n\n\n\n\\bibitem[{\\citenamefont{Savenko and Dijkstra}(2006)}]{Savenko2006}\n\\bibinfo{author}{\\bibfnamefont{S.~V.} \\bibnamefont{Savenko}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Dijkstra}},\n  \\bibinfo{journal}{J. Chem. Phys.} \\textbf{\\bibinfo{volume}{124}},\n  \\bibinfo{pages}{8} (\\bibinfo{year}{2006}).\n\n\\bibitem[{\\citenamefont{Patti and Dijkstra}(2009)}]{Patti2009}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Patti}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Dijkstra}},\n  \\bibinfo{journal}{Phys. Rev. Lett.} \\textbf{\\bibinfo{volume}{102}},\n  \\bibinfo{pages}{128301} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Cuetos et~al.}(2010)\\citenamefont{Cuetos, Sanz, and\n  Dijkstra}}]{Cuetos2010}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Cuetos}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Sanz}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Dijkstra}},\n  \\bibinfo{journal}{Faraday Discuss.} \\textbf{\\bibinfo{volume}{144}},\n  \\bibinfo{pages}{253} (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Cuetos et~al.}(2008)\\citenamefont{Cuetos, van Roij, and\n  Dijkstra}}]{Cuetos2008}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Cuetos}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{van Roij}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Dijkstra}},\n  \\bibinfo{journal}{Soft Matter} \\textbf{\\bibinfo{volume}{4}},\n  \\bibinfo{pages}{757} (\\bibinfo{year}{2008}).\n\n\\bibitem[{\\citenamefont{Pelcovits and Meyer}(2009)}]{Pelcovits2009}\n\\bibinfo{author}{\\bibfnamefont{R.~A.} \\bibnamefont{Pelcovits}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}},\n  \\bibinfo{journal}{Liq. Cryst.} \\textbf{\\bibinfo{volume}{36}},\n  \\bibinfo{pages}{1157} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Kaplan et~al.}(2010)\\citenamefont{Kaplan, Tu,\n  Pelcovits, and Meyer}}]{Kaplan2010}\n\\bibinfo{author}{\\bibfnamefont{C.~N.} \\bibnamefont{Kaplan}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Tu}},\n  \\bibinfo{author}{\\bibfnamefont{R.~A.} \\bibnamefont{Pelcovits}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.~B.} \\bibnamefont{Meyer}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{82}}, \\bibinfo{pages}{021701}\n  (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Tu and Pelcovits}(2013{\\natexlab{a}})}]{Tu2013}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Tu}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~A.} \\bibnamefont{Pelcovits}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{87}}, \\bibinfo{pages}{032504}\n  (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Tu and Pelcovits}(2013{\\natexlab{b}})}]{Tu2013a}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Tu}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~A.} \\bibnamefont{Pelcovits}},\n  \\bibinfo{journal}{Phys. Rev. E} \\textbf{\\bibinfo{volume}{87}}, \\bibinfo{pages}{042505}\n  (\\bibinfo{year}{2013}).\n\n\\bibitem{key-41} P. Sharma, A. Ward, T. Gibaud, M. F. Hagan and Z. Dogic, Nature {\\bfseries 513,} 77 (2014).\n\n\n\n\\bibitem{Tombolato} F. Tombolato, A. Ferrarini and E. Grelet, Phys. Rev. Lett. {\\bfseries 96,} 258302 (2006).\n\n\n\\bibitem{Poulin} P. Poulin, H. Stark, T. C. Lubensky and D. A. Weitz, Science {\\bfseries 275,} 1770 (1997).\n\n\\bibitem{Pettey} D. Pettey, T. C. Lubensky and D. R. Link, Liq. Cryst. {\\bfseries 25,} 579 (1998).\n\n\\bibitem{Dolganov} P. V. Dolganov, V. K. Dolganov and P. Cluzeau, J.E.T.P. {\\bfseries 109,} 169 (2009).\n\n\\bibitem{Bohley} C. Bohley and R. Stannarius, Eur. Phys. J. E {\\bfseries 23, } 25 (2007).\n\n\\bibitem{Dan} N. Dan, A. Berman, P. Pincus and S. A. Safran, J. Phys. II {\\bfseries 4,} 1713 (1994).\n\n\\bibitem{Goulian} M. Goulian, R. Bruinsma and P. Pincus, Europhys. Lett. {\\bfseries 22,} 145 (1993).\n\n\\bibitem{Dietrich} C. Dietrich, L. A. Bagatolli, Z. N. Volovyk, N. L. Thompson, M. Levi, K. Jacobson and E. Gratton, Biophys. J. {\\bfseries 80,} 1417 (2001).\n\n\\bibitem{Lingwood} D. Lingwood and K. Simons, Science {\\bfseries 327,} 46 (2010).\n\n\n\n\\bibitem{deGennesSmectic} P. G. de Gennes, Solid State Commun. {\\bfseries 10,} 753 (1972).\n\n\\bibitem{PelcovitsMeyer} R. A. Pelcovits and R.B. Meyer, Liq. Cryst. {\\bfseries 36,} 1157 (2009).\n\n\\bibitem{Kaplan}  C. N. Kaplan, H. Tu, R. A. Pelcovits, and R. B. Meyer, Phys. Rev. E {\\bfseries 82.} 021701 (2010).\n\n\\bibitem{key-76} W.H. Press, S.A. Teukolsky, W.T. Vetterling, B.P. Flannery, \\textsl{Numerical Recipes in Fortran: The Art of Scientific Computing},\n(Cambridge University Press, 1992).\n\n\\bibitem{Stark} H. Stark, Phys. Rep. {\\bfseries 351,} 387 (2001).\n\n\\bibitem{key-67} See, e.g.,  J. Fukuda, M. Yoneya, and H. Yokoyama, Eur. Phys. J. E {\\bfseries 13,} 87 (2004)\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 36606, "prevtext": "\nwhere the upper and lower signs correspond to $x>0$ and $x<0$, respectively.\nCombining Eqs.(\\ref{eq1}) and (\\ref{eq2}) we obtain in the limit $\\epsilon\\rightarrow0$:\n\n", "index": 17, "text": "\\begin{equation}\n\\sin\\theta(0)=\\frac{\\lambda}{2} (q_1 + |q_2|),\n\\label{eq3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\sin\\theta(0)=\\frac{\\lambda}{2}(q_{1}+|q_{2}|),\" display=\"block\"><mrow><mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mi>λ</mi><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>q</mi><mn>1</mn></msub><mo>+</mo><mrow><mo stretchy=\"false\">|</mo><msub><mi>q</mi><mn>2</mn></msub><mo stretchy=\"false\">|</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]