[{"file": "1601.04685.tex", "nexttext": "\nwhere $Z$ is the normalization factor, and $P(I)$ is the prior\ndistribution of stimuli.  When we characterize the velocity profiles\nof the noxious response of {\\em C.\\ elegans}, we notice that the worm\ncan react to the stimulus in two different ways. Some worms pause\nafter the thermal stimulus, even at large laser currents (see\nFig.~\\ref{fig:P and A state demo} (B)). These worms remains largely\nimmobile for a few seconds, sometimes as long as the recording\nduration.  Other worms actively reverse and follow the classic escape\nbehavior as shown in Fig.~\\ref{fig:CM_velocity}. We choose to separate\nthe active vs.\\ the paused worms with a cutoff of 10 pixels/s, where\n50 pixels is about one body length of the worm. To account for this\nheterogeneity in the behavior, we introduce the state variable $s$,\nwhich can take one of two values, $a$ or $p$, for each individual\nworm. Then\n\n", "itemtype": "equation", "pos": 15878, "prevtext": "\n\\title{Stereotypical escape behavior in {\\em Caenorhabditis elegans}\n  allows quantification of nociceptive stimuli levels}\n\n\n\\author{Kawai Leung$^1$, Aylia Mohammadi$^2$, William S.\\ Ryu$^{2,3,\\ast}$,\\\\\n  and   Ilya Nemenman$^{1,4,\\ast}$\\\\\n  $^1$ Department of Physics, Emory University, Atlanta, GA 30322, USA\\\\\n  $^2$ Department of Physics, University of Toronto, Toronto, ON, M5S1A7, Canada\\\\\n  $^3$ Donnelly Centre, University of Toronto, Toronto, ON, M5S3E1 Canada\\\\\n  $^4$ Department of Biology, Emory University, Atlanta, GA 30322, USA\\\\\n  $^\\ast$ Email: wryu@physics.utoronto.ca, ilya.nemenman@emory.edu}\n\\maketitle\n\n\\begin{abstract}\n  Experiments of pain with human subjects are difficult, subjective,\n  and ethically constrained. Since the molecular mechanisms of pain\n  transduction are reasonably conserved among different species, these\n  problems are partially solved by the use of animal models.  However,\n  animals cannot easily communicate to us their own pain levels. Thus\n  progress depends crucially on our ability to quantitatively and\n  objectively infer the perceived level of noxious stimuli from the\n  behavior of animals. Here we develop a quantitative model to infer\n  the perceived level of thermal nociception from the stereotyped\n  nociceptive response of individual nematodes {\\em Caenorhabditis\n    elegans} stimulated by an IR laser. The model provides a method\n  for quantification of analgesic effects of chemical stimuli or\n  genetic mutations in {\\em C.\\ elegans}. We test the nociception of\n  ibuprofen-treated worms and a TRPV (transient receptor potential)\n  mutant, and we show that the perception of thermal nociception for\n  the ibuprofen treated worms is lower than the wild-type. At the same\n  time, our model shows that the mutant changes the worm's behavior\n  beyond affecting nociception. Finally, we determine the stimulus\n  level that best distinguishes the analgesic effects and the minimum\n  number of worms that allow for a statistically significant\n  identification of these effects.\n\\end{abstract}\n\n\\section*{Introduction}\n\nPain is a common health problem that causes over \\$60 billion a year\nin productivity losses in the United States\n\\cite{Stewart2003}. Research on pain sensing (also known as\nnociception) with human subjects is difficult for a number of\nreasons including ethical constraints, difficulties in quantifying a\npsychophysical response, and subjectivity in self-reporting\n\\cite{Mogil2009}. Since the molecular mechanisms of pain transduction\nare believed to be partially conserved among many different species\n\\cite{Tobin2002,Tobin2004, Smith2009gw}, some of\nthese problems are solved by using animal models in nociception\nresearch. However, animal subjects cannot communicate their perceived\npain levels to us in an obvious fashion.  Thus progress in using\nanimal models depends crucially on our ability to quantitatively and\nobjectively infer the perceived level of noxious stimuli from animal\nbehavior.\n\nHistorically, studies of pain primarily used mammalian models\n\\cite{Barrot2012,LeBars2001}. For rodents, the tail flick test\n\\cite{DAmour1941}, the hot-plate test \\cite{OCallaghan1975,WOOLFE1943}\nand the Hargreaves' method \\cite{Hargreaves1988} correlate pain\nperception with the reaction latency of different body parts to\nnoxious stimuli. For larger animals such as canines \\cite{Wegner2008}\nand primates \\cite{Alreja1984,Dykstra1986}, similar nociceptive assays\nhave also been developed. In recent years, new approaches started\nincorporating facial expressions in nociception quantification\n\\cite{Langford2010cm, Keating:2012hq, Gleerup2015ii}. Although these mammalian models\nare extensively studied, several drawbacks hinder their use. First,\nethical issues and risks arise for certain experiments. Second,\ncompared to lower-level organisms, mammalian subjects require more\ntime and resources to maintain. Therefore, much effort has been\ndevoted to investigations of the possibility of using invertebrate\nmodels in nociception research \\cite{Tobin2004, Im:2012gx}. In\nexperiments involving $Drosophila$ larva, measures such as the\nresponse percentage of the total population\n\\cite{Sokabe2008,Zhong2010} and the time to response \\cite{Tracey2003}\nhave been used to investigate changes in the ability of the animals to\nsense noxious stimuli. In experiments on {\\em Caenorhabditis elegans},\nbehavioral features such as the turning rate \\cite{Tobin2002} and the\npercentage of escape response \\cite{Liedtke2003} have been used to\ncharacterize nociception.\n\nAll of these models share some common problems. First, the\nnociceptive assays focus on one particular coarse behavioral feature\nof the subject, such as avoidance behavior, orientation, or turning\nrate. Such features are selected in an ad hoc fashion, subject to a\nparticular design of an experiment. This makes it difficult to compare\nresults across different labs and experiments. Further, the behavior\nmay be providing additional information about the perceived pain that\nis not being captured by the coarse measures.  Second, some assays\nreport measurements as a percentage of a population, so that these\nmeasurements cannot be made for individuals. To overcome these\nproblems, an ideal assay would infer a perceived pain level of an\nindividual animal on a continuous scale, using comprehensive,\nobjective measurements of its behavioral profile.\n\nAn even more important problem is that one would like to use the\nassays to calibrate the perceived pain level, and maybe even\nreductions in such levels due to effects of analgesic drugs, or\nmutations in the nociceptive pathways. At the same time, drugs or\nmutations can affect the motor response, rather than the nociception\nper se. Thus traditional pain assays mentioned above may convolve the\nperceived pain reduction, if any, with behavioral changes. For\nexample, a mutant defective for turning behavior will register a\nstrong reduction in the turning rate, but it would be a mistake to\ninterprete this as a reduction in the pain perception. Such concerns\nare very real, as is illustrated by a known fact that opiods can cause\nlarge behavioral changes, and thus they have effects beyond analgesic\nones \\cite{Roughan2000bm}. To attribute a behavioral response\ndifference to reduced nociception and not to motor changes, the\nresponse must be stereotyped and reflexive, which is often the case\n\\cite{LeBars2001}. Further, only the response amplitude or frequency,\nbut not the detailed temporal structure, should change in response to\na drug or a mutation. Establishing the stability of the stereotypic\nresponse pattern requires analysis of the {\\em entire response\n  behavior}, rather than of its few selected features, as is done by\nmost behavioral assays.\n\nIn this work, we address these issues in the context of the nematode\n{\\em C.~elegans}, developing it further as an animal model system for\nnociception research. The worm is a great model organism for such\nstudies for a number of reasons. First, the behavioral dynamics of\nfreely moving {\\em C.~elegans} is intrinsically low dimensional\n\\cite{Stephens2008}. This makes quantification of its behavioral\nresponse relatively straightforward, providing an opportunity to use\nthe entire motile behavior as a basis for assays. Second, the worms\nshow a noxious response to a wide range of sensations including\ncertain types of chemical \\cite{Culotti1978ul,Hilliard2004ig},\nmechanical \\cite{Kaplan1993jz,Chalfie1985vl}, and thermal\n\\cite{Wittenburg1999, Mohammadi:2013ku} stimuli, and such nociceptive\nresponse is different from and is transduced independently of the\nrelated taxis behaviors \\cite{Bargmann1991, Troemel1997, Huang1994,\n  Mori1995bp}.  Third, at the molecular level, many details of thermal\nnociception in the worm may be similar to vertebrate animals\n\\cite{Tobin2004}. Fourth, there are powerful genetic and optical tools\nto reveal mechanisms of nociception in {\\em C.\\ elegans}. Finally, the\nlow cost, small size, and absence of ethical constraints make the\nanimal amenable to large scale pharmacological screens for new\nanalgesics \\cite{Kwok2006fl}.\n\nWe present combined experimental and modeling studies that show that\nthe entire temporal behavioral profile during the thermal nociceptive\nresponse in {\\em C.\\ elegans} is highly stereotypical, with the\nfrequency of the escape response and the amplitude of the escape\nvelocity profile scaling with the stimulus level. By verifying the\nability of the behavioral template to capture the response following a\nnociceptive stimulus, the model we develop distinguishes changes in\nnociception from changes to the motor program.  When a change is\nattributed to nociception, the model can infer the reduction in the\nperceived thermal nociception level following pharmacological or genetic\ntreatments from the behavior of an individual worm. This\nquantification requires only a handful of worms (about 60) to show\nstatistically significant nociception reduction for a common\nanalgesic, and its statistical power quickly improves with an\nincreasing number of subjects.\n\nThe paper is organized as follows. First we discuss the structure of\nthe dataset and the model. Then we evaluate the performance of the\nmodel and discuss the stereotypical behavior we discovered.  Further,\nwe use the model to infer the nociceptive stimulus level of worms in\nthree different conditions: wild-type untreated, wild-type treated\nwith ibuprofen, and a mutant with defects in thermal nociception. We\nargue that, while effects of the ibuprofen treatment can be attributed\nlargely to a reduced nociception, the mutant's response shows changes\nto the behavior beyond nociceptive effects.  Finally, we use the\nstatistical model to discuss how the nociception experiments should be\ndesigned to achieve the highest statistical power to quantify\nanalgesic effects.\n\n\\section*{Results}\n\nWe aim to infer the perceived worm nociception level from the temporal\ndynamics of the worm response. The noxious signal is administered by thermal\nstimulation using an infrared laser while the worm crawls on an agar\nplate. The worm motion is captured by video microscopy and analyzed\nusing custom image analysis software. The worm postures are very\nstereotypical, adding up to simple sinusoidal motions forwards or\nbackwards, and to turns \\cite{Stephens2008}. Thus without much loss to\nthe statistical power, we characterize the entire nociceptive behavior\nof the animal by a time series of its center of mass velocity (see\n{\\em Materials and Methods}). Our task is then to verify if such\nresponses are stereotypical, scaling in frequency and amplitude with\nthe applied laser current. If they are stereotypical and thus can be\nused to characterize the perceived nociception, the next task is to infer the\napplied laser current from the velocity data.\n\nFor each noxious stimulus trial a random worm is selected on the plate\nand its motion is sampled at 60 Hz for 15 s. An infrared laser pulse\nwith a randomly chosen current between 0 to 200 mA and a duration of\n0.1 s is then directed to the head of the worm 1 s after the start of\nthe video recording. The worm's center of mass motion in a typical\ntrial consists of a forward motion before the stimulus, a stop and/or\nbackwards motion after the stimulus, then followed by an ``omega''\nturn, after which the worm emerges with a forward motion in a\ndifferent direction, cf.~Fig.~\\ref{fig:CM_velocity}. This is a typical\nresponse to many noxious stimuli in {\\em C.\\ elegans}, and not just to\nthermal noxious stimulus \\cite{Mohammadi:2013ku}.  Such nociceptive\nresponse, at least at large stimuli levels, is different from the more\ncommonly studied thermotactic behavior, and is mediated by different\nneural and genetic pathways \\cite{Wittenburg1999, Mohammadi:2013ku}.\n\n\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=.75\\columnwidth]{fig/CM_velocity}}\n\\caption{{\\bf Typical center-of-mass thermal nociception responses in {\\em\n      C.~elegans}.} (A) Typical center-of-mass trajectory of two\n  wild-type worms in a paused and an active state (see below for the\n  detailed discussion of the two states). The infrared laser was\n  directed at each worm at $t=1$ s. The paused state is characterized\n  by the near zero velocity after the laser stimulus. (B) Actual\n  trajectories of these two worms. Worm changes its direction of\n  motion in two ways: in a ``reversal'', it stops and backtracks along\n  its previous path; in an ``omega'' turn the worm's head curls back\n  and crosses the tail, setting then a new direction of forward\n  motion. \\label{fig:CM_velocity}}\n\\end{figure}\nTo understand the effects of pharmacological and genetic interventions\non nociception transduction, we collected three distinct datasets. In\nthe first, the stimulus was applied to wild-type worms (N2). In the\nsecond, the wild-type worms were pre-treated with an ibuprofen\nsolution (see {\\em Materials and Methods}). In the third, we applied\nthe stimulus to an untreated triple mutant (ocr-2(ak47) osm-9(ky10)\nIV; ocr-1(ak46)). Hereafter we refer to these datasets as ``control'',\n``ibuprofen'', and ``mutant'', respectively.  We collectively refer to\nibuprofen and mutant worms as ``treated'' worms. Forward motion in all\nthree data sets was similar (typical forward velocity of $13\\pm 9$,\n$9\\pm 7$, $13 \\pm 10$ pixel/s respectively, where the error denoted\nthe standard deviation of the velocity distribution), so that there\nare no drastic defects in motility.\n\n\\subsection*{Statistical model of the nociception}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\columnwidth]{fig/P_and_A_state_demo}\n\\caption{{\\bf Global characteristics of the nociceptive\n    escape.} (A) The mean ($\\pm$ s.\\ e.\\ m.) of the maximum\n  reverse speed for the three worm types \n  is plotted against the stimulus laser current, partitioned into five\n  bins.   Negative values correspond\n  to backward motion. (B) Maximum reverse speeds for individual\n  control worms. We define an active worm (dot) as having the maximum\n  reverse speed of over 10 pixels/s (about 0.2 body length per second);\n  otherwise the worm is paused (plus sign). (C) Probability of the paused state\n  vs.\\ the laser current. Dots represent the\n  actual data ($\\pm$ s.\\ e.\\ m.), and lines are the fitted\n  model. The datasets are divided into equally sampled bins for each\n  worm type. \n  \\label{fig:P and A state demo} }\n\\end{figure}\n\nWe bin the laser current of the nociceptive stimulus into five\ndistinct levels (bins), defined to have an equal number of control\nworms in each bin (40 per bin). The maximum reverse escape velocity is\nindistinguishable among all three worm types for the largest stimulus\nlevel, indicating again no gross defects to motility or noxious\nresponse. At the same time, the velocity at smaller stimuli levels\nshows substantial differences ($Z$ scores of up to 3.8) between the\ncontrol and the treated worms, especially in the vicinity of $\\sim100$\nmA laser stimulation, see Fig.~\\ref{fig:P and A state demo}(A). Mutant\nworms are especially different from the control over a wider stimulus\nrange.  However, as discussed above, it is unclear if such simple\nobserved behavioral differences are indicative of the reduction of the\nperceived nociception level or of other changes to the motor response.\n\nTo address this, instead of subjectively segmenting the complex escape\nbehavior or choosing {\\em ad hoc} metrics of the worm's movement, we\nchoose to infer the applied stimulus strength from a comprehensive\nmodel of the entire worm's response velocity profile.  Due to the\nconsiderable randomness and individual variability of responses, we\nchoose to model them probabilistically. Thus we are interested in\nestimating $P(I|{\\bf v})$, the probability distribution of the applied\nlaser current $I$ conditional on the observed velocity of the escape\nresponse ${\\bf v}\\equiv\\{v(t)\\}$.  Using Bayes' theorem, we write \n\n", "index": 1, "text": "\\begin{equation}\nP(I|{\\bf v})=\\frac{P({\\bf v}|I)P(I)}{P({\\bf v})}=\\frac{1}{Z}P({\\bf v}|I)P(I),\n\\label{eq:bayes}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"P(I|{\\bf v})=\\frac{P({\\bf v}|I)P(I)}{P({\\bf v})}=\\frac{1}{Z}P({\\bf v}|I)P(I),\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">|</mo><mi>𝐯</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mfrac><mn>1</mn><mi>Z</mi></mfrac><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\n\n\nWe model the probability of the paused state $P(p|I)$ by a sigmoid\nfunction, cf.~Fig.~\\ref{fig:P and A state demo}(C),\n\n", "itemtype": "equation", "pos": 16889, "prevtext": "\nwhere $Z$ is the normalization factor, and $P(I)$ is the prior\ndistribution of stimuli.  When we characterize the velocity profiles\nof the noxious response of {\\em C.\\ elegans}, we notice that the worm\ncan react to the stimulus in two different ways. Some worms pause\nafter the thermal stimulus, even at large laser currents (see\nFig.~\\ref{fig:P and A state demo} (B)). These worms remains largely\nimmobile for a few seconds, sometimes as long as the recording\nduration.  Other worms actively reverse and follow the classic escape\nbehavior as shown in Fig.~\\ref{fig:CM_velocity}. We choose to separate\nthe active vs.\\ the paused worms with a cutoff of 10 pixels/s, where\n50 pixels is about one body length of the worm. To account for this\nheterogeneity in the behavior, we introduce the state variable $s$,\nwhich can take one of two values, $a$ or $p$, for each individual\nworm. Then\n\n", "index": 3, "text": "\\begin{equation}\nP({\\bf v}|I)=P({\\bf v}|s=p,I) P(s=p|I)+P({\\bf v}|s=a,I)\nP(s=a|I).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P({\\bf v}|I)=P({\\bf v}|s=p,I)P(s=p|I)+P({\\bf v}|s=a,I)P(s=a|I).\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>s</mi><mo>=</mo><mi>p</mi><mo>,</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mi>p</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>s</mi><mo>=</mo><mi>a</mi><mo>,</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mi>a</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere ${\\mathcal I}_0$ is the {\\em pause current} threshold. Then the\nprobability of the active state is\n\n", "itemtype": "equation", "pos": 17108, "prevtext": "\n\n\nWe model the probability of the paused state $P(p|I)$ by a sigmoid\nfunction, cf.~Fig.~\\ref{fig:P and A state demo}(C),\n\n", "index": 5, "text": "\\begin{equation}\nP(s=p|I,{\\mathcal I}_0)=\\frac{1}{1+(I/{\\mathcal I}_0)^{2}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P(s=p|I,{\\mathcal{I}}_{0})=\\frac{1}{1+(I/{\\mathcal{I}}_{0})^{2}},\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mi>p</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nWe infer ${\\mathcal I}_0$ from data by maximizing\n$\\prod_{i=1}^{N_{\\rm type}}P(s_i|I_i,{\\mathcal I}_0)$, where $N_{\\rm type}$ is\nthe number of trials with worms of the analyzed type, and $I_i$ is the\nactual laser current for a particular trial. Note that each of the\nthree data sets has its own pause current ($25.9\\pm2.8$, $26.6\\pm1.9$,\nand $51.6\\pm6.3$ mA for the control, ibuprofen, and mutant worms,\nrespectively). Changes in this threshold, like that for the mutant,\nwill result in different numbers of worms responding to the same\nstimulus, which can be consistent with the changes in the nociception\nlevel, depending on whether the response profiles themselves stay\nstable. This is what we investigate next. Parenthetically, we note\nthat the fraction of active worms is essentially the same as the\npercentage of the escape response, which has been used previously to\nquantify worm nociception \\cite{Liedtke2003}. Here we go further and\nadditionally analyze the behavioral profiles of the responding worms.\n\n{\\em C.\\ elegans} locomotion consists of a series of stereotyped\npostures and behavioral states\n\\cite{Stephens2011,Stephens2010}. Further, in other animals,\nnociceptive responses are stereotyped as well\n\\cite{LeBars2001}. Therefore, it is natural to explore if the\nnociceptive response of {\\em C.\\ elegans} is also stereotyped,\nseparately for the paused and the active states. For paused worms, the\nescape velocity is small and independent of the laser current, and we\nmodel it as a multivariate normal variable,\n\n", "itemtype": "equation", "pos": 17305, "prevtext": "\nwhere ${\\mathcal I}_0$ is the {\\em pause current} threshold. Then the\nprobability of the active state is\n\n", "index": 7, "text": "\\begin{equation}\nP(s=a|I,{\\mathcal I}_0)=1-P(s=p|I,{\\mathcal I}_0) = \\frac{(I/{\\mathcal I}_0)^{2}}{1+(I/{\\mathcal I}_0)^{2}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P(s=a|I,{\\mathcal{I}}_{0})=1-P(s=p|I,{\\mathcal{I}}_{0})=\\frac{(I/{\\mathcal{I}}%&#10;_{0})^{2}}{1+(I/{\\mathcal{I}}_{0})^{2}},\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mi>a</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mn>1</mn><mo>-</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mi>p</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere ${\\bf u}_{p}$ is the mean velocity profile of the paused worms\nmeasured from data, which we call the {\\em paused template}\nvelocity. $\\Sigma_{p}$ is the empirical covariance of the paused\nvelocity, and $T$ is the total number of effectively independent time\npoints in the velocity profile time series, determined using the\nautocorrelation structure of the profile (see {\\em Materials and\n  Methods}).\n\nWe expect that, in the active state, the worm escape is laser current\ndependent. Specifically, we seek to represent it by a\ncurrent-dependent rescaling of a stereotypical escape velocity,\n${\\bf v} \\sim f(I){\\bf u}_a$, where $f$ is the scaling function, and ${\\bf u}_a$\nis the {\\em active template} velocity.  Since various features of the\nworm escapes (the maximum reverse speed, the maximum reverse\nacceleration, and the time to the omega turn), scale non-linearly and\nsaturate with the laser current (cf.~Fig.~\\ref{fig:P and A state\n  demo}(A)), the rescaling, $f(I)$, must be sigmoidal. Further, some\nworms have nonzero velocities even at zero laser current, so that\n$f(0)$ may be nonzero. Finally, the overall scale of the template can\nbe absorbed in the definition of ${\\bf u}_a$. The simplest scaling\nfunction obeying these constraints has only two parameters\n\n", "itemtype": "equation", "pos": 18973, "prevtext": "\nWe infer ${\\mathcal I}_0$ from data by maximizing\n$\\prod_{i=1}^{N_{\\rm type}}P(s_i|I_i,{\\mathcal I}_0)$, where $N_{\\rm type}$ is\nthe number of trials with worms of the analyzed type, and $I_i$ is the\nactual laser current for a particular trial. Note that each of the\nthree data sets has its own pause current ($25.9\\pm2.8$, $26.6\\pm1.9$,\nand $51.6\\pm6.3$ mA for the control, ibuprofen, and mutant worms,\nrespectively). Changes in this threshold, like that for the mutant,\nwill result in different numbers of worms responding to the same\nstimulus, which can be consistent with the changes in the nociception\nlevel, depending on whether the response profiles themselves stay\nstable. This is what we investigate next. Parenthetically, we note\nthat the fraction of active worms is essentially the same as the\npercentage of the escape response, which has been used previously to\nquantify worm nociception \\cite{Liedtke2003}. Here we go further and\nadditionally analyze the behavioral profiles of the responding worms.\n\n{\\em C.\\ elegans} locomotion consists of a series of stereotyped\npostures and behavioral states\n\\cite{Stephens2011,Stephens2010}. Further, in other animals,\nnociceptive responses are stereotyped as well\n\\cite{LeBars2001}. Therefore, it is natural to explore if the\nnociceptive response of {\\em C.\\ elegans} is also stereotyped,\nseparately for the paused and the active states. For paused worms, the\nescape velocity is small and independent of the laser current, and we\nmodel it as a multivariate normal variable,\n\n", "index": 9, "text": "\\begin{equation}\nP({\\bf v}|p,I)=\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{p}|^{\\frac{1}{2}}}\\exp\\left[-\\frac{1}{2}({\\bf v}-{\\bf u}_{p})^{\\rm\n    T}\\Sigma_{p}^{-1}({\\bf v}-{\\bf u}_{p})\\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"P({\\bf v}|p,I)=\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{p}|^{\\frac{1}{2}}}\\exp%&#10;\\left[-\\frac{1}{2}({\\bf v}-{\\bf u}_{p})^{\\rm T}\\Sigma_{p}^{-1}({\\bf v}-{\\bf u}%&#10;_{p})\\right],\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>p</mi><mo>,</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mfrac><mi>T</mi><mn>2</mn></mfrac></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>p</mi></msub><mo stretchy=\"false\">|</mo></mrow><mfrac><mn>1</mn><mn>2</mn></mfrac></msup></mrow></mfrac><mi>exp</mi><mrow><mo>[</mo><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>𝐮</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">T</mi></msup><msubsup><mi mathvariant=\"normal\">Σ</mi><mi>p</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>𝐮</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>]</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere ${\\mathcal I}_1$ and ${\\mathcal I}_{2}$ are again constants, different for the three\ndifferent worm types. With this, we write the probability of a\nvelocity profile given the laser current $I$ for the worm in an active\nstate as a multivariate normal distribution\n\n", "itemtype": "equation", "pos": 20450, "prevtext": "\nwhere ${\\bf u}_{p}$ is the mean velocity profile of the paused worms\nmeasured from data, which we call the {\\em paused template}\nvelocity. $\\Sigma_{p}$ is the empirical covariance of the paused\nvelocity, and $T$ is the total number of effectively independent time\npoints in the velocity profile time series, determined using the\nautocorrelation structure of the profile (see {\\em Materials and\n  Methods}).\n\nWe expect that, in the active state, the worm escape is laser current\ndependent. Specifically, we seek to represent it by a\ncurrent-dependent rescaling of a stereotypical escape velocity,\n${\\bf v} \\sim f(I){\\bf u}_a$, where $f$ is the scaling function, and ${\\bf u}_a$\nis the {\\em active template} velocity.  Since various features of the\nworm escapes (the maximum reverse speed, the maximum reverse\nacceleration, and the time to the omega turn), scale non-linearly and\nsaturate with the laser current (cf.~Fig.~\\ref{fig:P and A state\n  demo}(A)), the rescaling, $f(I)$, must be sigmoidal. Further, some\nworms have nonzero velocities even at zero laser current, so that\n$f(0)$ may be nonzero. Finally, the overall scale of the template can\nbe absorbed in the definition of ${\\bf u}_a$. The simplest scaling\nfunction obeying these constraints has only two parameters\n\n", "index": 11, "text": "\\begin{equation}\nf(I)\\equiv f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I)={\\mathcal I}_1+\\frac{I}{1+I/{\\mathcal I}_{2}},\\label{eq:nonlinerfunction}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"f(I)\\equiv f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I)={\\mathcal{I}}_{1}+\\frac{%&#10;I}{1+I/{\\mathcal{I}}_{2}},\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>+</mo><mfrac><mi>I</mi><mrow><mn>1</mn><mo>+</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere $\\Sigma_{a}$ is the covariance of the average velocity profile.\nWe find the constants ${\\mathcal I}_1$ and ${\\mathcal I}_{2}$, ${\\bf u}_a$ and $\\Sigma_{a}$\nby maximizing the likelihood of the observed data (see {\\em Materials\n  and Methods}).\n\nIn summary, the probability of a velocity profile given the laser\ncurrent in a certain trial is\n\n", "itemtype": "equation", "pos": 20875, "prevtext": "\nwhere ${\\mathcal I}_1$ and ${\\mathcal I}_{2}$ are again constants, different for the three\ndifferent worm types. With this, we write the probability of a\nvelocity profile given the laser current $I$ for the worm in an active\nstate as a multivariate normal distribution\n\n", "index": 13, "text": "\\begin{equation}\n  P({\\bf v}|a,I)=\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{a}|^{\\frac{1}{2}}}\n  \\times\\exp\\left[-\\frac{1}{2}({\\bf v}-f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I){\\bf u}_{a})^{\\rm\n      T}\\Sigma_{a}^{-1}({\\bf v}-f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I){\\bf u}_{a})\\right],\n\\label{Pva}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"P({\\bf v}|a,I)=\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{a}|^{\\frac{1}{2}}}\\times%&#10;\\exp\\left[-\\frac{1}{2}({\\bf v}-f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I){\\bf u%&#10;}_{a})^{\\rm T}\\Sigma_{a}^{-1}({\\bf v}-f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(%&#10;I){\\bf u}_{a})\\right],\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>a</mi><mo>,</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mn>1</mn><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mfrac><mi>T</mi><mn>2</mn></mfrac></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>a</mi></msub><mo stretchy=\"false\">|</mo></mrow><mfrac><mn>1</mn><mn>2</mn></mfrac></msup></mrow></mfrac><mo>×</mo><mi>exp</mi><mrow><mo>[</mo><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">T</mi></msup><msubsup><mi mathvariant=\"normal\">Σ</mi><mi>a</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>]</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nThe overall model of the experiment, Eq.~(\\ref{eq:bayes}), also\nincludes $P(I)$. To a large extent, this is controlled by the\nexperimentalist, and details are described in {\\em Materials and Methods}.\n\n\\subsection*{Is the nociceptive escape stereotyped?}\n\nThe model we built assumes a stereotypical nociceptive response.  Is\nthis assumption justified? Velocities in the paused state are very\nsmall (worms barely move). Thus whether the stereotypy assumption\nprovides a good model of the data is determined largely by the\nstereotypy of the active worms.  If the active stereotypical response\ntemplate exists, then it should be possible to collapse the average\nvelocity profiles onto a single curve by the following transformation\n\n", "itemtype": "equation", "pos": 21525, "prevtext": "\nwhere $\\Sigma_{a}$ is the covariance of the average velocity profile.\nWe find the constants ${\\mathcal I}_1$ and ${\\mathcal I}_{2}$, ${\\bf u}_a$ and $\\Sigma_{a}$\nby maximizing the likelihood of the observed data (see {\\em Materials\n  and Methods}).\n\nIn summary, the probability of a velocity profile given the laser\ncurrent in a certain trial is\n\n", "index": 15, "text": "\\begin{multline}\n  P({\\bf v}|I) =\n  \\left\\{\\frac{1}{1+(I/{\\mathcal I}_0)^{2}}\\times\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{p}|^{\\frac{1}{2}}}\n    \\exp\\left[-\\frac{1}{2}({\\bf v}-{\\bf u}_{p})^{T}\\Sigma_{p}^{-1}({\\bf v}-{\\bf u}_{p})\\right]\\right\\}\\\\\n  +\\left\\{\\frac{(I/{\\mathcal I}_0)^{2}}{1+(I/{\\mathcal I}_0)^{2}}\\times\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{a}|^{\\frac{1}{2}}}\n  \\exp\\left[-\\frac{1}{2}({\\bf v}-f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I){\\bf u}_{a})^{T}\\Sigma_{a}^{-1}({\\bf v}-f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I){\\bf u}_{a})\\right]\\right\\}.\n\\label{eq:fullmodel}\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle P({\\bf v}|I)=\\left\\{\\frac{1}{1+(I/{\\mathcal{I}}_{0})^{2}}\\times%&#10;\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{p}|^{\\frac{1}{2}}}\\exp\\left[-\\frac{1}{2}%&#10;({\\bf v}-{\\bf u}_{p})^{T}\\Sigma_{p}^{-1}({\\bf v}-{\\bf u}_{p})\\right]\\right\\}\\\\&#10;\\displaystyle+\\left\\{\\frac{(I/{\\mathcal{I}}_{0})^{2}}{1+(I/{\\mathcal{I}}_{0})^%&#10;{2}}\\times\\frac{1}{(2\\pi)^{\\frac{T}{2}}|\\Sigma_{a}|^{\\frac{1}{2}}}\\exp\\left[-%&#10;\\frac{1}{2}({\\bf v}-f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I){\\bf u}_{a})^{T}%&#10;\\Sigma_{a}^{-1}({\\bf v}-f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I){\\bf u}_{a})%&#10;\\right]\\right\\}.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo stretchy=\"false\">|</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><mo>{</mo><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>×</mo><mfrac><mn>1</mn><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mfrac><mi>T</mi><mn>2</mn></mfrac></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>p</mi></msub><mo stretchy=\"false\">|</mo></mrow><mfrac><mn>1</mn><mn>2</mn></mfrac></msup></mrow></mfrac><mi>exp</mi><mrow><mo>[</mo><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>𝐮</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi>T</mi></msup><msubsup><mi mathvariant=\"normal\">Σ</mi><mi>p</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mrow><mo stretchy=\"false\">(</mo><mi>𝐯</mi><mo>-</mo><msub><mi>𝐮</mi><mi>p</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>]</mo></mrow><mo>}</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>+</mo><mrow><mo>{</mo><mrow><mrow><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>I</mi><mo>/</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>×</mo><mfrac><mn>1</mn><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mfrac><mi>T</mi><mn>2</mn></mfrac></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>a</mi></msub><mo stretchy=\"false\">|</mo></mrow><mfrac><mn>1</mn><mn>2</mn></mfrac></msup></mrow></mfrac></mrow><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐯</mi><mo>-</mo><mrow><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝐮</mi><mi>a</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mi>T</mi></msup><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Σ</mi><mi>a</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐯</mi><mo>-</mo><mrow><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>𝐮</mi><mi>a</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>}</mo></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nFigure~\\ref{fig:collapse} confirms this: the means of different bins\ncollapse relatively compactly, providing evidence for the existence of\nthe stereotypy in active nociceptive responses. We illustrate the\ntemplate velocities and the non-linear scaling function $f$ inferred\nfrom the control, ibuprofen, and mutant in\nFig.~\\ref{fig:The-normalized-active}.\n\n\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=.75\\textwidth]{fig/Collaspe_v}}\n\\caption{{\\bf Collapse of the nociceptive response.} (A) The mean and\n  standard deviation of velocities of active control worms, binned for\n  presentation purposes into five different groups of $40$ worms each,\n  based on the stimulus current. (B) The mean and standard deviation\n  of velocities in the same time period rescaled by\n  $f^{-1}_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)$. Rescaled mean velocities nearly\n  collapse. Note that the parameters ${\\mathcal I}_1$ and ${\\mathcal I}_2$ are optimized as\n  in {\\em Materials and methods} to collapse individual profiles, and\n  not the five mean profiles illustrated here.  \\label{fig:collapse}}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/Template_rescale_func}\n\\caption{{\\bf Stereotypical active nociceptive response. } (A) Paused\n  template velocities. Error bars show the standard deviation of the\n  template.  Models are estimated separately for the three different\n  worm types, indicated by different colors.  Time $t=1$ s corresponds\n  to the moment of the stimulus application. (B) Normalized active\n  template velocity.  Each template velocity is normalized by the\n  absolute value of its minimum $|\\min_{t} {\\bf v}_{a}|$. The error bars\n  represent the model standard deviation, estimated by bootstrapping\n  (see {\\em Materials and Methods}). The subfigure shows the template\n  velocities adjusted by the time of maximum reverse velocity,\n  illustrating that the three templates nearly match. (C) The\n  rescaling function $f_{{\\mathcal I}_1,{\\mathcal I}_2}(I)$ for the three different worm\n  types, normalized by multiplying by the absolute value of the\n  minimum of the active template velocity $|\\min_{t}{\\bf v}_{a}|$. The\n  optimized parameter values are ${\\mathcal I}_1= -4.5, -4.5, 66.5$ and\n  ${\\mathcal I}_2=45.0, 12.0, \\infty$ for the control, ibuprofen, and mutant\n  worms, respectively. We deliberately do not report error bars on\n  individual parameters, but rather show the one standard deviation\n  confidence intervals for the entire rescaling curve as shaded\n  regions on the figure. The confidence region was again estimated\n  using bootstrapping.\\label{fig:The-normalized-active}}\n\\end{figure}\n\nNote that the three active template velocity profiles in\nFig.~\\ref{fig:The-normalized-active}(A) are very similar, but the\nmutant template velocity profile shows a response lag of $83$ ms (one\ntime frame at 12 Hz) compared to the control or ibuprofen data set. In\nother words, the pharmacological treatments and the mutations weakly\naffect the templated response, save for possibly delaying it. This\nbodes well for the assumption of the stereotypical response,\ndefinitely for ibuprofen and, to a somewhat lesser extent, for the\nmutant.\n\nWhile the existence of the stereotypical patterns and their similarity\nacross treatments is encouraging, we still need to quantify how good\nthe statistical models are. In the ideal case, the variance\n${\\boldsymbol{\\sigma}}^2_{\\rm collapse}$ of the collapsed velocities,\nEq.~(\\ref{eq:collapse}), calculated over individual trials, would be\nzero. However, there are a number of expected sources of variance in\nthe velocity, such as the individual variability and the model\ninaccuracies. To establish how good the stereotypical model fits are,\nwe need to disambiguate these contributions.  For this, we again\npartition all velocity profiles into five current bins.  We then write\nthe total variance of all responses as\n\n", "itemtype": "equation", "pos": 22841, "prevtext": "\nThe overall model of the experiment, Eq.~(\\ref{eq:bayes}), also\nincludes $P(I)$. To a large extent, this is controlled by the\nexperimentalist, and details are described in {\\em Materials and Methods}.\n\n\\subsection*{Is the nociceptive escape stereotyped?}\n\nThe model we built assumes a stereotypical nociceptive response.  Is\nthis assumption justified? Velocities in the paused state are very\nsmall (worms barely move). Thus whether the stereotypy assumption\nprovides a good model of the data is determined largely by the\nstereotypy of the active worms.  If the active stereotypical response\ntemplate exists, then it should be possible to collapse the average\nvelocity profiles onto a single curve by the following transformation\n\n", "index": 17, "text": "\\begin{equation}\n{\\bf v}_{\\rm collapse}=\\frac{{\\bf v}_{a}}{f_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I)}.\n\\label{eq:collapse}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"{\\bf v}_{\\rm collapse}=\\frac{{\\bf v}_{a}}{f_{{\\mathcal{I}}_{1},{\\mathcal{I}}_{%&#10;2}}(I)}.\" display=\"block\"><mrow><mrow><msub><mi>𝐯</mi><mi>collapse</mi></msub><mo>=</mo><mfrac><msub><mi>𝐯</mi><mi>a</mi></msub><mrow><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere ${\\boldsymbol{\\sigma}}_{\\rm ind}^{2}$ is the variance due to individual responses\nwithin each bin, and ${\\boldsymbol{\\sigma}}_{I}^{2}$ is the current-driven variance of\nthe mean responses across the bins.  Since the individuality of the\nworms is not accounted for in our model, ${\\boldsymbol{\\sigma}}_{I}^{2}$ represents the\nmaximum potentially explainable variance in the data. The\nstereotypy-based model would be nearly perfect if ${\\boldsymbol{\\sigma}}_{I}^2$ were to\ndrop to zero after the $f^{-1}$ rescaling. To explore this, in\nFig.~\\ref{fig:var}, we plot the total variance of the active response\n${\\boldsymbol{\\sigma}}_{\\rm total}^{2}$, panel (A), and the fraction of the potentially\nexplainable variance, ${\\boldsymbol{\\sigma}}^2_I/{\\boldsymbol{\\sigma}}^2_{\\rm total}$, panel (B). The\nlatter varies from 20\\% to 40\\% of the total variance, depending on\nthe time post-stimulus and on the treatment. In both panels, the\nmutant and the control dataset are nearly indistinguishable, while the\nibuprofen worms show a smaller variance, and a smaller fraction of the\nexplainable variance. This is consistent with a smaller\nstimulus-driven nociceptive response for this analgesic treatment. At\nthe same time, these figures suggest that the decrease in the maximum\nreverse speed in the mutant worm, Fig.~\\ref{fig:P and A state demo}\n(A), should not be attributed entirely to the reduced\nnociception. Indeed, the similarity of the variance and the\nexplainable variance in the control and the mutant worms, which have\nvery different mean maximum reverse velocities, suggests existence of\nan additional (explainable, non-templated) component in the\nnociceptive response of the mutant, which is not present in the\ncontrol.\n\n\\begin{figure}\n\\includegraphics[width=1\\textwidth]{fig/var_ratio}\n\\caption{{Variability of the active nociceptive response.} For the\n  three worm types, in (A) we plot the total variance of velocity\n  profiles ${\\boldsymbol{\\sigma}}^2_{\\rm total}$. Note that these numbers depend\n  strongly on the preprocessing of the data -- in particular,\n  smoothing of the velocity (with the 500 ms filter, see {\\em\n    Materials and Methods}) decreases the total variance.  In (B) we\n  show the fraction of potentially explainable variance\n  ${\\boldsymbol{\\sigma}}_{I}^{2}/{\\boldsymbol{\\sigma}}_{\\rm total}^{2}$. Finally, (C) shows the part of\n  the explainable variance that was not explained by our statistical\n  model ${\\boldsymbol{\\sigma}}_{\\rm res}^{2}/{\\boldsymbol{\\sigma}}_{I}^{2}$. See the main text for the\n  discussion of the differences between the three worm types on this\n  plot. \\label{fig:var}}\n\\end{figure}\n\n\nThe explainable variance ${\\boldsymbol{\\sigma}}_{I}^{2}$ is further split into the\nvariance explained by the model, ${\\boldsymbol{\\sigma}}_{\\rm m}^2$, and the residual\nvariance, ${\\boldsymbol{\\sigma}}^2_{\\rm res}$, which the model fails to explain:\n\n", "itemtype": "equation", "pos": 26873, "prevtext": "\nFigure~\\ref{fig:collapse} confirms this: the means of different bins\ncollapse relatively compactly, providing evidence for the existence of\nthe stereotypy in active nociceptive responses. We illustrate the\ntemplate velocities and the non-linear scaling function $f$ inferred\nfrom the control, ibuprofen, and mutant in\nFig.~\\ref{fig:The-normalized-active}.\n\n\n\\begin{figure}[t]\n\\centerline{\\includegraphics[width=.75\\textwidth]{fig/Collaspe_v}}\n\\caption{{\\bf Collapse of the nociceptive response.} (A) The mean and\n  standard deviation of velocities of active control worms, binned for\n  presentation purposes into five different groups of $40$ worms each,\n  based on the stimulus current. (B) The mean and standard deviation\n  of velocities in the same time period rescaled by\n  $f^{-1}_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)$. Rescaled mean velocities nearly\n  collapse. Note that the parameters ${\\mathcal I}_1$ and ${\\mathcal I}_2$ are optimized as\n  in {\\em Materials and methods} to collapse individual profiles, and\n  not the five mean profiles illustrated here.  \\label{fig:collapse}}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/Template_rescale_func}\n\\caption{{\\bf Stereotypical active nociceptive response. } (A) Paused\n  template velocities. Error bars show the standard deviation of the\n  template.  Models are estimated separately for the three different\n  worm types, indicated by different colors.  Time $t=1$ s corresponds\n  to the moment of the stimulus application. (B) Normalized active\n  template velocity.  Each template velocity is normalized by the\n  absolute value of its minimum $|\\min_{t} {\\bf v}_{a}|$. The error bars\n  represent the model standard deviation, estimated by bootstrapping\n  (see {\\em Materials and Methods}). The subfigure shows the template\n  velocities adjusted by the time of maximum reverse velocity,\n  illustrating that the three templates nearly match. (C) The\n  rescaling function $f_{{\\mathcal I}_1,{\\mathcal I}_2}(I)$ for the three different worm\n  types, normalized by multiplying by the absolute value of the\n  minimum of the active template velocity $|\\min_{t}{\\bf v}_{a}|$. The\n  optimized parameter values are ${\\mathcal I}_1= -4.5, -4.5, 66.5$ and\n  ${\\mathcal I}_2=45.0, 12.0, \\infty$ for the control, ibuprofen, and mutant\n  worms, respectively. We deliberately do not report error bars on\n  individual parameters, but rather show the one standard deviation\n  confidence intervals for the entire rescaling curve as shaded\n  regions on the figure. The confidence region was again estimated\n  using bootstrapping.\\label{fig:The-normalized-active}}\n\\end{figure}\n\nNote that the three active template velocity profiles in\nFig.~\\ref{fig:The-normalized-active}(A) are very similar, but the\nmutant template velocity profile shows a response lag of $83$ ms (one\ntime frame at 12 Hz) compared to the control or ibuprofen data set. In\nother words, the pharmacological treatments and the mutations weakly\naffect the templated response, save for possibly delaying it. This\nbodes well for the assumption of the stereotypical response,\ndefinitely for ibuprofen and, to a somewhat lesser extent, for the\nmutant.\n\nWhile the existence of the stereotypical patterns and their similarity\nacross treatments is encouraging, we still need to quantify how good\nthe statistical models are. In the ideal case, the variance\n${\\boldsymbol{\\sigma}}^2_{\\rm collapse}$ of the collapsed velocities,\nEq.~(\\ref{eq:collapse}), calculated over individual trials, would be\nzero. However, there are a number of expected sources of variance in\nthe velocity, such as the individual variability and the model\ninaccuracies. To establish how good the stereotypical model fits are,\nwe need to disambiguate these contributions.  For this, we again\npartition all velocity profiles into five current bins.  We then write\nthe total variance of all responses as\n\n", "index": 19, "text": "\\begin{equation}\n{\\boldsymbol{\\sigma}}_{\\rm total}^{2}={\\boldsymbol{\\sigma}}_{I}^{2}+{\\boldsymbol{\\sigma}}_{\\rm ind}^{2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"{\\boldsymbol{\\sigma}}_{\\rm total}^{2}={\\boldsymbol{\\sigma}}_{I}^{2}+{%&#10;\\boldsymbol{\\sigma}}_{\\rm ind}^{2},\" display=\"block\"><mrow><mrow><msubsup><mi>𝝈</mi><mi>total</mi><mn>2</mn></msubsup><mo>=</mo><mrow><msubsup><mi>𝝈</mi><mi>I</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>𝝈</mi><mi>ind</mi><mn>2</mn></msubsup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nIn Fig.~\\ref{fig:var} (C), we plot ${\\boldsymbol{\\sigma}}_{\\rm res}^{2} / {\\boldsymbol{\\sigma}}_{I}^{2}$,\nwhich is the fraction of the variance not captured by our model. Of\nthe explainable variance, about 80\\% is captured by our model for the\ncontrol and the ibuprofen worms in the window between 1 s and 3.3 s\nsince the start of the trial, on average. This is a relatively large\nfraction for behavioral data, and provides an additional validation\nfor our choice of a stereotypy-based model for representing\nnociceptive escape behavior in these worms. Stability of the template\nitself between these two conditions, and the stability of the fraction\nof the explained variance suggest that much of the effect of ibuprofen\ncan be attributed to scaling of the templated response (and also the\nfraction of active worms). In other words, ibuprofen decreases the\nsensed nociception.\n\nIn contrast, the unexplained variance for the mutant is about twice as\nlarge as that for the control, and approaches 100\\% at $t>2.7$ s. This\nagain illustrates that the templated response model is not very good\nfor this treatment. Thus the mutations introduce changes in the\nbehavior that are not consistent with a simple rescaling -- mutations\naffect the fine motor behavior in addition to nociception per se.\n\n\\subsection*{Using the statistical model}\n\nOne of the goals of our study is to develop methods for quantitative\nassessment of the efficacy of pharmacological interventions to\ndecreases sensed nociception, at least in those cases where their action can\nbe specifically interpreted as a change in nociception transduction. We can use the developed statistical\nmodel for this. Specifically, taking the model derived from the\ncontrol worms, we can infer the laser current from behavior of all\nthree different worm types. To the extent that the current inferred\nfor the treated worms is smaller than that for the control worms at\nthe same applied current, the nociception level perceived by the\ntreated worms is smaller.\n\nFigure \\ref{fig:PvsA prob map =000026 exp value} shows the overall\nstructure of the inference done with the model. In the first row, we\nplot the conditional distribution of the inferred laser current given\nthe actual applied current $I$ for the three worm types,\n$P(I_{\\rm inf}|I,{\\rm type})$. For presentation purposes, we again bin\nthe trials using $I_i$ into five bins $I_\\mu$, $\\mu=1,\\dots,5$ as\nbefore, and plot\n\n", "itemtype": "equation", "pos": 29899, "prevtext": "\nwhere ${\\boldsymbol{\\sigma}}_{\\rm ind}^{2}$ is the variance due to individual responses\nwithin each bin, and ${\\boldsymbol{\\sigma}}_{I}^{2}$ is the current-driven variance of\nthe mean responses across the bins.  Since the individuality of the\nworms is not accounted for in our model, ${\\boldsymbol{\\sigma}}_{I}^{2}$ represents the\nmaximum potentially explainable variance in the data. The\nstereotypy-based model would be nearly perfect if ${\\boldsymbol{\\sigma}}_{I}^2$ were to\ndrop to zero after the $f^{-1}$ rescaling. To explore this, in\nFig.~\\ref{fig:var}, we plot the total variance of the active response\n${\\boldsymbol{\\sigma}}_{\\rm total}^{2}$, panel (A), and the fraction of the potentially\nexplainable variance, ${\\boldsymbol{\\sigma}}^2_I/{\\boldsymbol{\\sigma}}^2_{\\rm total}$, panel (B). The\nlatter varies from 20\\% to 40\\% of the total variance, depending on\nthe time post-stimulus and on the treatment. In both panels, the\nmutant and the control dataset are nearly indistinguishable, while the\nibuprofen worms show a smaller variance, and a smaller fraction of the\nexplainable variance. This is consistent with a smaller\nstimulus-driven nociceptive response for this analgesic treatment. At\nthe same time, these figures suggest that the decrease in the maximum\nreverse speed in the mutant worm, Fig.~\\ref{fig:P and A state demo}\n(A), should not be attributed entirely to the reduced\nnociception. Indeed, the similarity of the variance and the\nexplainable variance in the control and the mutant worms, which have\nvery different mean maximum reverse velocities, suggests existence of\nan additional (explainable, non-templated) component in the\nnociceptive response of the mutant, which is not present in the\ncontrol.\n\n\\begin{figure}\n\\includegraphics[width=1\\textwidth]{fig/var_ratio}\n\\caption{{Variability of the active nociceptive response.} For the\n  three worm types, in (A) we plot the total variance of velocity\n  profiles ${\\boldsymbol{\\sigma}}^2_{\\rm total}$. Note that these numbers depend\n  strongly on the preprocessing of the data -- in particular,\n  smoothing of the velocity (with the 500 ms filter, see {\\em\n    Materials and Methods}) decreases the total variance.  In (B) we\n  show the fraction of potentially explainable variance\n  ${\\boldsymbol{\\sigma}}_{I}^{2}/{\\boldsymbol{\\sigma}}_{\\rm total}^{2}$. Finally, (C) shows the part of\n  the explainable variance that was not explained by our statistical\n  model ${\\boldsymbol{\\sigma}}_{\\rm res}^{2}/{\\boldsymbol{\\sigma}}_{I}^{2}$. See the main text for the\n  discussion of the differences between the three worm types on this\n  plot. \\label{fig:var}}\n\\end{figure}\n\n\nThe explainable variance ${\\boldsymbol{\\sigma}}_{I}^{2}$ is further split into the\nvariance explained by the model, ${\\boldsymbol{\\sigma}}_{\\rm m}^2$, and the residual\nvariance, ${\\boldsymbol{\\sigma}}^2_{\\rm res}$, which the model fails to explain:\n\n", "index": 21, "text": "\\begin{equation}\n{\\boldsymbol{\\sigma}}_{I}^{2} = {\\boldsymbol{\\sigma}}_{m}^{2} + {\\boldsymbol{\\sigma}}_{\\rm res}^{2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"{\\boldsymbol{\\sigma}}_{I}^{2}={\\boldsymbol{\\sigma}}_{m}^{2}+{\\boldsymbol{%&#10;\\sigma}}_{\\rm res}^{2}.\" display=\"block\"><mrow><mrow><msubsup><mi>𝝈</mi><mi>I</mi><mn>2</mn></msubsup><mo>=</mo><mrow><msubsup><mi>𝝈</mi><mi>m</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>𝝈</mi><mi>res</mi><mn>2</mn></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nHere $P_{\\rm type}({\\bf v}_i|I_\\mu)$ is 1 if the stimulus on the $i$'th\ntrial for this worm type was in the $I_\\mu$ bin, and zero\notherwise. Further, $P_{\\rm control}(I_{\\rm inf}|{\\bf v}_i)$ is given by\nthe full model, Eq.~(\\ref{eq:fullmodel}), with the parameters inferred\nfor the control worm, and with the empirically observed velocities\n${\\bf v}$ in trial $i$ for each worm type. We see that there is more\nprobability concentrated at small $I_{\\rm inf}$ for the ibuprofen and\nthe mutant worms, suggesting a reduction in the perceived stimulus\nlevel.  Similarly, in the second row in Fig.~\\ref{fig:PvsA prob map\n  =000026 exp value}, we plot the expected value, $\\bar{I}_i$, of the\ndistribution of the current inferred using the control model,\n$P_{\\rm control}(I_{\\rm inf}|{\\bf v}_i)$, for each of the individual\ntrials in each of the three worm types. To the extent that the dots\nfor the ibuprofen and the mutant worms are again somewhat lower than\nfor the control worms, there is some reduction in the perceived\ncurrent by this measure as well.\n\nHowever, these population averaged results wash out important\ndifferences in the structure of the nociception response.  To quantify these\nsmall effects more accurately, we now look at the perceived stimulus\nchanges for individual worms in the datasets. Specifically, for each\ntrial $i$ in the control dataset, a trial $j(i)$ with the closest\nvalue of the applied laser current is found in the ibuprofen / mutant\ndataset (the mean magnitude of the current mismatch is $<1$ mA for\nboth the ibuprofen and the mutant worms). We then use the control\nmodel to calculate the expected value of the inferred current for the\n$j$th trial in the ibuprofen / mutant datasets. This expectation is\nsubtracted from the expectation value of the inferred current for the\nmatched trial $i$ for the control dataset. The difference of the\nexpectation values, averaged over all control worms, is our measure of\nthe reduction in the perceived nociception level\n\n", "itemtype": "equation", "pos": 32456, "prevtext": "\nIn Fig.~\\ref{fig:var} (C), we plot ${\\boldsymbol{\\sigma}}_{\\rm res}^{2} / {\\boldsymbol{\\sigma}}_{I}^{2}$,\nwhich is the fraction of the variance not captured by our model. Of\nthe explainable variance, about 80\\% is captured by our model for the\ncontrol and the ibuprofen worms in the window between 1 s and 3.3 s\nsince the start of the trial, on average. This is a relatively large\nfraction for behavioral data, and provides an additional validation\nfor our choice of a stereotypy-based model for representing\nnociceptive escape behavior in these worms. Stability of the template\nitself between these two conditions, and the stability of the fraction\nof the explained variance suggest that much of the effect of ibuprofen\ncan be attributed to scaling of the templated response (and also the\nfraction of active worms). In other words, ibuprofen decreases the\nsensed nociception.\n\nIn contrast, the unexplained variance for the mutant is about twice as\nlarge as that for the control, and approaches 100\\% at $t>2.7$ s. This\nagain illustrates that the templated response model is not very good\nfor this treatment. Thus the mutations introduce changes in the\nbehavior that are not consistent with a simple rescaling -- mutations\naffect the fine motor behavior in addition to nociception per se.\n\n\\subsection*{Using the statistical model}\n\nOne of the goals of our study is to develop methods for quantitative\nassessment of the efficacy of pharmacological interventions to\ndecreases sensed nociception, at least in those cases where their action can\nbe specifically interpreted as a change in nociception transduction. We can use the developed statistical\nmodel for this. Specifically, taking the model derived from the\ncontrol worms, we can infer the laser current from behavior of all\nthree different worm types. To the extent that the current inferred\nfor the treated worms is smaller than that for the control worms at\nthe same applied current, the nociception level perceived by the\ntreated worms is smaller.\n\nFigure \\ref{fig:PvsA prob map =000026 exp value} shows the overall\nstructure of the inference done with the model. In the first row, we\nplot the conditional distribution of the inferred laser current given\nthe actual applied current $I$ for the three worm types,\n$P(I_{\\rm inf}|I,{\\rm type})$. For presentation purposes, we again bin\nthe trials using $I_i$ into five bins $I_\\mu$, $\\mu=1,\\dots,5$ as\nbefore, and plot\n\n", "index": 23, "text": "\\begin{equation}\n  P(I_{\\rm inf}|I_\\mu,{\\rm type})= \\sum_i^{N_{\\rm type}} P_{\\rm\n    control}(I_{\\rm inf}|{\\bf v}_i)P_{\\rm type}({\\bf v}_i|I_\\mu).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"P(I_{\\rm inf}|I_{\\mu},{\\rm type})=\\sum_{i}^{N_{\\rm type}}P_{\\rm control}(I_{%&#10;\\rm inf}|{\\bf v}_{i})P_{\\rm type}({\\bf v}_{i}|I_{\\mu}).\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>inf</mi></msub><mo stretchy=\"false\">|</mo><msub><mi>I</mi><mi>μ</mi></msub><mo>,</mo><mi>type</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mi>type</mi></msub></munderover><msub><mi>P</mi><mi>control</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>inf</mi></msub><mo stretchy=\"false\">|</mo><msub><mi>𝐯</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><msub><mi>P</mi><mi>type</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐯</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><msub><mi>I</mi><mi>μ</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nWe evaluate $\\Delta I_{\\rm type}$ for different worm types and for\ncontrols worms binned into the five usual current bins, and show the\nresults in Fig.~\\ref{fig:Delta_Ipred}. To estimate the error of\n$\\Delta I_{\\rm type}$, we bootstrap the whole analysis pipeline, see\n{\\em Materials and Methods}. There is a statistically significant\ndifference in nociception perception between the ibuprofen and the control\nworms.  The difference is most significant when the actual laser\ncurrent is around 100-110 mA. This coincide with our observation from\nFig.~\\ref{fig:P and A state demo} (A) that the most sensitive region\nof maximum reverse speed is around 100mA. Indeed, at smaller currents,\nthe nociception level is small, many worms pause, and the behavior\ncannot be used to reliably estimate the stimulus level. At high\ncurrent, the noxious stimulus perception saturates, and all worms\nbehave similarly, again reducing the ability to disambiguate the\napplied current level.\n\nThis analysis of ibuprofen worms achieves one of our main goals. It\nproves our ability to reconstruct stimulus from the behavior, and\nshows that analgesic effects of pharmacological perturbations can be\nquantified from the behavior. At the same time,\n$\\Delta I_{\\rm mutant}$ turns out to be insignificant in\nFig.~\\ref{fig:Delta_Ipred} (B), even though Fig.~\\ref{fig:P and A\n  state demo} (A) suggest that a large statistically significant\ndifference exists between the mutant and the control behaviors. This\nfailure to detect a significant nociception reduction is because the\ntemplated response model is not very good for the mutant worm; thus\nour analysis cannot reliably assign a mutant trajectory on a given\ntrial to a specific nociception level. In other words, the large error bars\nin Fig.~\\ref{fig:Delta_Ipred} (B) serve as yet another check for self\nconsistency: effects of the mutations cannot be attributed just to\nchanges in nociception perception.\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/PvsA_prob_map}\n\\caption{{\\bf Inferring the perceived nociception level from {\\em C.~elegans}\n    nociceptive behavior.} The first row shows the heat maps of the\n  conditional distributions of the inferred current vs.\\ the actual\n  applied current, partitioned into five bins,\n  $P_{\\rm control}(I_{\\rm inf}|I_\\mu)$. Inference is done with the\n  model of the control worm behavior. Panels (A), (B), (C) show the\n  results for the control, ibuprofen, and mutant worms,\n  respectively. The second row shows the expected inferred laser\n  current for each trial, $\\bar{I}_{{\\rm inf},i}$ vs.\\ the applied\n  current $I_i$. The inference is again done using the control model,\n  and panels (D), (E), (F) show the three worm types. \\label{fig:PvsA\n    prob map =000026 exp value}}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/Delta_Ipred_zscore}\n\n\\protect\\caption{{\\bf Sensed nociception decrease due to treatments.}  (A)\n  Differences of the inferred laser current between the control and\n  the ibuprofen datasets, $\\Delta I_{\\rm ibuprofen}$. Errors represent\n  standard deviations, estimated with bootstrapping. (B) Similar\n  differences for the mutant worm, $\\Delta I_{\\rm mutant}$.  Error\n  bars are estimated by bootstrapping. (C) Dependence of the statistical\n  significance of the nociception level reduction (measured by the $Z$ score)\n  for ibuprofen at 110 mA on the number of ibuprofen trials.  \n  \\label{fig:Delta_Ipred}}\n\\end{figure}\n\n\n\\section*{Designing experiments: how many worms?}\n\nWe expect our analysis to be useable for screening large numbers of\nchemicals for analgesic action. Since our approach targets one\nindividual worm at a time, we need to estimate the number of worms\nneeded to achieve statistical significance in such screening\nexperiments. For this, we fix the number of control worms, arguing\nthat these must be only analyzed once, and hence a relatively large\nnumber of them can be tested. We then focus on ibuprofen, whose action\nis analgesic in our experiments, and on the bin at 110 mA, where the\nworms experience the most significant nociception reduction. There are\n$N_{{\\rm ibuprofen},110}=94$ worms in this bin. We randomly sample\nwith replacements $n<N_{{\\rm ibuprofen},110}$ worms from among these\nibuprofen-treated worms and repeat our analysis pipeline, estimating\nthe $\\Delta I_{\\rm ibuprofen}(n)$. Resampling 1000 times (both the\nibuprofen and the control datasets), we also estimate the variance of\n$\\Delta I_{\\rm ibuprofen}(n)$, and hence the $Z$ score as a function of\n$n$, which is plotted in Fig.~\\ref{fig:Delta_Ipred} (C). The plot here\nis an {\\em underestimate} of the true $Z$ score since resampling with\nreplacements removes some stimulus values from the dataset, hence\nincreasing the mismatch between control worms and the paired treated\nworms. Even with this, $Z\\approx2$ is achieved at $n\\approx 60$\nibuprofen worms. In other words, in a typical screening experiment,\none would need to test $200$ or more worms to build the control model,\nand then at least $\\sim 60$ worms additionally for each treatment\ncondition.\n\n\\section*{Discussion}\n\nTypically the goal of sensory-response experiments is to develop a\nmodel that can predict the behavior in response to the stimuli. Here\nwe wanted to do this in reverse. Our goal was to build a statistical\nmodel of the thermal stimulus from careful measurements of the\nnociceptive behavior of {\\em C.\\ elegans}, and to use this model to\ninfer the changes in the perceived level of ``pain'' felt by the\norganism due to perturbation in the nociception transduction\npathway. Given this model, we could then measure changes in\nnociception perception due to effects of analgesics and mutations, and\nuse this as a basis to study the mechanism of nociception transduction in a\ngenetically tractable organism amenable to high-throughput screens. As\na representative data set, we choose to study the standard laboratory\n{\\em C.\\ elegans} strain N2, N2 treated with ibuprofen, and a mutant\nwith defects in TRPV function.\n\nFor the model to be successful, we had to meet a number of challenges.\nSince the worm could not communicate its nociception level to us directly we\nhad to infer this level by reading the ``body language'' of the worm's\n``pain'' response. The difficulty with quantifying a behavioral response\nas a measure of nociception level is that drugs or mutations can\naffect locomotory behavior in addition to perturbing sensory\ntransduction. So in an attempt to deconvolve these effects, we used\nthe entire behavioral profile instead of making ad hoc measurements\nand leveraged the fact that nociception responses are typically highly\nstereotyped. This resulted in the discovery that the response can be\nmodeled with a velocity profile template that scales non-linearly in\nresponse to an applied laser current. The success of the template in\nmodeling the stereotyped wild-type nociception response was confirmed\nby a functional collapse of the velocity profiles across different\nnociception levels. This discovery of invariance is important since it\nnot only allowed us to effectively correlate nociceptive behavior to\nthe stimulus level, but it also allowed us to determine if the\nlocomotory changes in our thermal nociception assay was due to changes\nspecifically in the sensory transduction pathway or due to other\ngeneral locomotory factors. By carefully accounting for the variation\nin our data and quantifying how much of this variation is captured by\nthe model, we showed that the stereotypical behavior is unaffected by\nibuprofen, save for changing the amplitude of the response. Thus this\ndrug application likely reduced the perceived nociception level in the\nworm. In contrast, a TRPV mutation changes locomotion in a way that is\nnot as well captured by the template model. Thus we can be objectively\ncritical about any nociception inference made with this strain.\n\nThe model was also useful in determining key experimental parameters\nfor future measurements. After verification that the model works well\nwith the native and ibuprofen treated stimulus-response data, we\nquantified the changes in thermal nociception perception due to\nibuprofen treatment.  Our modeling and experimental assessment of\nthermal nociception identified the optimal stimulus range and required\nnumber of trials to determine statistically significant differences\nbetween the inferred current of N2 in the untreated and treated\nconditions.\n\nIn conclusion, we have built a general model that connects stereotyped\nbehavior to stimulus. With a language to describe this relationship,\nit is now possible to study quantitatively the effects of genetics and\nchemicals on this sensorimotor behavior. We believe that the utility\nof the model is quite general and could be applied to different model\nsystem. However, we particularly hope that this work helps further\nestablish {\\em C.\\ elegans} as a model for nociceptive research.\n\n\n\n\n\\section*{Materials and Methods}\n\n\\subsection*{Worm preparation and experiment design}\n\nAll worms were grown and maintained under standard conditions\n\\cite{Brenner1974wn}, incubated with food at 20 $^\\circ$C. Well fed worms were\nwashed twice then gently spun down for 1 minute and the supernatant\ndiscarded by aspiration. For the drug application, 100 $\\mu$L of\nibuprofen in M9 at 100 $\\mu$M was added to the eppendorf tube. For\nthe wild-type and mutant data set, M9 was used instead of the drug\nsolution. Worms were then placed in an incubator for 30 minutes at\n20$^\\circ$C. After that worms were poured onto a seeded agar plate and\ntransferred to agar assay plates by a platinum wire pick. These assay\nplates were incubated at 20$^\\circ$C for 30 minutes, and then the experimental\ntrials were done within the next 30 minutes. In total $N=201$ worms\nfor the control group, $N=441$ worms for the ibuprofen group, and\n$N=100$ worms for the mutant group (ocr-2(ak47) osm-9(ky10) IV;\nocr-1(ak46)) group were tested. The mutant strain was obtained from\nthe Caenorhabditis Genetics Center.\n\nThe thermal nociceptive stimulation instrument has been described\npreviously \\cite{Mohammadi:2013ku}. In summary, an infrared laser is\ndirected to heat the head of a freely crawling worm ($\\sim0.5$mm FWHM)\non an agar plate. The laser pulse is generated with a randomly chosen\nlaser current between 0 to 200 mA, with a duration of 0.1 s. The\nheating of the worm is nearly instantaneous, and it is directly\nproportional to the current, between 0 and 2 $^\\circ$C for the\nthe current range used in our experiments. Worms were stimulated only once and not reused.\nThe movements of the worms are imaged using a standard\nstereomicroscope with video capture and laser control software written\nin LabVIEW. For each nociception stimulus trial, a random worm is selected on\nthe plate and its motion is sampled at 60 Hz for 15 s, and the laser\nis engaged 1~s after the start of the video recording.\n \n\\subsection*{Data Analysis}\n\nThe recorded nociceptive response videos were then processed with\nMatlab to calculate the time series of the worm centroid motion as\ndescribed previously \\cite{Mohammadi:2013ku}. All the worms that were\nnot stimulated near the head or were not moving forward in the\nbeginning of the video were discarded. Numerical derivatives of the\ncentroid times series were then taken and filtered with a custom 500\nms Gaussian filter, which was a one-sided Gaussian at the edges of the\nrecorded time period, becoming a symmetric Gaussian away from the\nedges. This removed the noise due to numerical differentiation and\nalso averaged out the spurious fluctuations in the forward velocity\ndue to the imperfect sinusoidal shapes of the moving worm. We verified\nthat different choices of the filter duration had little effect on the\nsubsequent analysis pipeline. The direction of the velocity was\ndetermined by projecting the derivative of the centroid time series\nonto the head-to-tail vector for each worm, with the positive and\nnegative velocity values denoting forward / backward motion,\nrespectively.\n\n\nThe filtered velocity profiles needed to be subsampled\nadditionally. This was because the statistical model of the data,\nEq.~(\\ref{eq:fullmodel}), involved covariance matrices of the active\nand paused velocity profiles, $\\Sigma_p$ and $\\Sigma_a$ (note that\nvelocity profiles are not temporally translationally invariant due to\nthe presence of the stimulus, thus the full covariance matrix is\nneeded, and not a simpler correlation function). To have a full rank\ncovariance matrix, the number of trials must be larger than the number\nof time points. Alternatively, regularization is needed for covariance\ncalculation. The autocorrelation function for all three worm types\nshowed a natural correlation time scale of $\\gtrsim 0.2$ s, whether\nthe data was pre-filtered or not. Thus subsampling at frequency $>5$\nHz would not result in data loss. Therefore, instead of an arbitrary\nregularization, we chose to subsample the data at 12 Hz, leaving us\nwith 37 data points to characterize the first 3 s of the worm velocity\ntrace after the stimulus application, $1\\le t\\le 4$ s since the start\nof the trial. Equation~(\\ref{eq:fullmodel}) additionally needs\nknowledge of $T$, the number of effectively independent velocity\nmeasurements in the profile. This is obtained by dividing the duration\nof the profile by the velocity correlation time. An uncertainty of\nsuch procedure has a minimal effect on the model of the experiment\nsince it simply changes log likelihoods of models by the same factor,\nnot changing which model has the maximum likelihood.\n\nWe then considered limiting the duration of the velocity profile used\nin model building: if velocities at certain time points do not\ncontribute to identification of $I$, they should be removed to\ndecrease the number of unknowns in the model that must be determined\nfrom data (values of the templates at different time points). The\nfirst candidate for removal was the period of about 10 frames (0.16 s)\nafter the laser stimulation since worms do not respond to the stimulus\nso quickly. However, removal of this time period had a negligible\neffect on the model performance, and we chose to leave it\nintact. In contrast, starting from 3.3 s (2.3 s after the stimulus) the\nfraction of explainable variance drops to nearly zero\n(cf.~Fig.~\\ref{fig:var}) since many worms already had turned by this\ntime and resumed forward motion. Therefore, we eventually settled on\nthe time in the $1.0\\dots3.3$ s range for building the model.\n\nWhenever needed, we estimated variance of our predictions by\nbootstrapping the whole analysis pipeline \\cite{bootstrap}.  For this,\nwe created 1000 different datasets by resampling with replacement from\nthe original control dataset and the mutant / ibuprofen\ndatasets. Control statistical models (the scaling function $f$ and the\nvelocity templates) were estimated for each resampled control\ndataset. Standard deviations of these models were used as estimates of\nerror bars in Fig.~\\ref{fig:The-normalized-active}. For\nFig.~\\ref{fig:Delta_Ipred}, we additionally needed to form the closest\ncontrol / treatment worm pairs. These were formed between the {\\em\n  resampled} data sets for all worm types as well. Standard deviations\nof $\\Delta I_{\\rm type}$ evaluated by such resampling were then\nplotted in Fig.~\\ref{fig:Delta_Ipred} and used to estimate $Z$\nscores. Note that such resampling produces data were control /\ntreatment paired worms have slightly larger current differences than\nin the actual data; this leads to our error bars being {\\em\n  overestimates}.\n\nModel in Eq.~(\\ref{eq:bayes}) requires knowing $P(I)$. In principle,\nthis is controlled by the experimentalist, and thus should be\nknown. In our experiments, $P(I)$ was set to be uniform. However, as\ndescribed above, some of the worms were discarded in preprocessing,\nand this resulted in non-uniformly distributed current samples. To\naccount for this, we used the empirical $P_{\\rm emp}(I)$ in our\nanalysis instead of $P(I)={\\rm const}$. In turn, $P_{\\rm emp}(I)$ was\ninferred using a well-established algorithm for estimation of\none-dimensional continuous probability distributions from data\n\\cite{Nemenman:2002gl}.\n\n\n\\subsection*{Calculating the template velocities, the covariances, and\n  the scaling function }\n\nThe template for the paused state ${\\bf u}_{p}$ is calculated by taking\nthe average of all paused velocity profiles for each of the three worm\ndatasets.  The covariance $\\Sigma_{p}$ is then the covariance of the\nset of the paused velocity profiles. \n\nFor active worms, we start with fixed putative parameter values\n${\\mathcal I}_1$ and ${\\mathcal I}_2$. We then calculate the active template ${\\bf u}_{a}$ and\nthe covariance matrix $\\sum_a$ by maximizing the\nlikelihood in Eq.~(\\ref{Pva})\n\n", "itemtype": "equation", "pos": 34608, "prevtext": "\nHere $P_{\\rm type}({\\bf v}_i|I_\\mu)$ is 1 if the stimulus on the $i$'th\ntrial for this worm type was in the $I_\\mu$ bin, and zero\notherwise. Further, $P_{\\rm control}(I_{\\rm inf}|{\\bf v}_i)$ is given by\nthe full model, Eq.~(\\ref{eq:fullmodel}), with the parameters inferred\nfor the control worm, and with the empirically observed velocities\n${\\bf v}$ in trial $i$ for each worm type. We see that there is more\nprobability concentrated at small $I_{\\rm inf}$ for the ibuprofen and\nthe mutant worms, suggesting a reduction in the perceived stimulus\nlevel.  Similarly, in the second row in Fig.~\\ref{fig:PvsA prob map\n  =000026 exp value}, we plot the expected value, $\\bar{I}_i$, of the\ndistribution of the current inferred using the control model,\n$P_{\\rm control}(I_{\\rm inf}|{\\bf v}_i)$, for each of the individual\ntrials in each of the three worm types. To the extent that the dots\nfor the ibuprofen and the mutant worms are again somewhat lower than\nfor the control worms, there is some reduction in the perceived\ncurrent by this measure as well.\n\nHowever, these population averaged results wash out important\ndifferences in the structure of the nociception response.  To quantify these\nsmall effects more accurately, we now look at the perceived stimulus\nchanges for individual worms in the datasets. Specifically, for each\ntrial $i$ in the control dataset, a trial $j(i)$ with the closest\nvalue of the applied laser current is found in the ibuprofen / mutant\ndataset (the mean magnitude of the current mismatch is $<1$ mA for\nboth the ibuprofen and the mutant worms). We then use the control\nmodel to calculate the expected value of the inferred current for the\n$j$th trial in the ibuprofen / mutant datasets. This expectation is\nsubtracted from the expectation value of the inferred current for the\nmatched trial $i$ for the control dataset. The difference of the\nexpectation values, averaged over all control worms, is our measure of\nthe reduction in the perceived nociception level\n\n", "index": 25, "text": "\\begin{equation}\n\\Delta I_{\\rm type}=\\frac{1}{N_{\\rm control}}\\sum_i^{N_{\\rm control}}\\left(I_{i,{\\rm control}} - I_{j(i),{\\rm type}} \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\Delta I_{\\rm type}=\\frac{1}{N_{\\rm control}}\\sum_{i}^{N_{\\rm control}}\\left(I%&#10;_{i,{\\rm control}}-I_{j(i),{\\rm type}}\\right).\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>I</mi><mi>type</mi></msub></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>N</mi><mi>control</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mi>control</mi></msub></munderover><mrow><mo>(</mo><mrow><msub><mi>I</mi><mrow><mi>i</mi><mo>,</mo><mi>control</mi></mrow></msub><mo>-</mo><msub><mi>I</mi><mrow><mrow><mi>j</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mi>type</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nwhere $N_{{\\rm type},a}$ is the number of active worms of the analyzed\ntype. This gives:\n\n", "itemtype": "equation", "pos": 51521, "prevtext": "\nWe evaluate $\\Delta I_{\\rm type}$ for different worm types and for\ncontrols worms binned into the five usual current bins, and show the\nresults in Fig.~\\ref{fig:Delta_Ipred}. To estimate the error of\n$\\Delta I_{\\rm type}$, we bootstrap the whole analysis pipeline, see\n{\\em Materials and Methods}. There is a statistically significant\ndifference in nociception perception between the ibuprofen and the control\nworms.  The difference is most significant when the actual laser\ncurrent is around 100-110 mA. This coincide with our observation from\nFig.~\\ref{fig:P and A state demo} (A) that the most sensitive region\nof maximum reverse speed is around 100mA. Indeed, at smaller currents,\nthe nociception level is small, many worms pause, and the behavior\ncannot be used to reliably estimate the stimulus level. At high\ncurrent, the noxious stimulus perception saturates, and all worms\nbehave similarly, again reducing the ability to disambiguate the\napplied current level.\n\nThis analysis of ibuprofen worms achieves one of our main goals. It\nproves our ability to reconstruct stimulus from the behavior, and\nshows that analgesic effects of pharmacological perturbations can be\nquantified from the behavior. At the same time,\n$\\Delta I_{\\rm mutant}$ turns out to be insignificant in\nFig.~\\ref{fig:Delta_Ipred} (B), even though Fig.~\\ref{fig:P and A\n  state demo} (A) suggest that a large statistically significant\ndifference exists between the mutant and the control behaviors. This\nfailure to detect a significant nociception reduction is because the\ntemplated response model is not very good for the mutant worm; thus\nour analysis cannot reliably assign a mutant trajectory on a given\ntrial to a specific nociception level. In other words, the large error bars\nin Fig.~\\ref{fig:Delta_Ipred} (B) serve as yet another check for self\nconsistency: effects of the mutations cannot be attributed just to\nchanges in nociception perception.\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/PvsA_prob_map}\n\\caption{{\\bf Inferring the perceived nociception level from {\\em C.~elegans}\n    nociceptive behavior.} The first row shows the heat maps of the\n  conditional distributions of the inferred current vs.\\ the actual\n  applied current, partitioned into five bins,\n  $P_{\\rm control}(I_{\\rm inf}|I_\\mu)$. Inference is done with the\n  model of the control worm behavior. Panels (A), (B), (C) show the\n  results for the control, ibuprofen, and mutant worms,\n  respectively. The second row shows the expected inferred laser\n  current for each trial, $\\bar{I}_{{\\rm inf},i}$ vs.\\ the applied\n  current $I_i$. The inference is again done using the control model,\n  and panels (D), (E), (F) show the three worm types. \\label{fig:PvsA\n    prob map =000026 exp value}}\n\\end{figure}\n\n\n\\begin{figure}[t]\n\\includegraphics[width=1\\textwidth]{fig/Delta_Ipred_zscore}\n\n\\protect\\caption{{\\bf Sensed nociception decrease due to treatments.}  (A)\n  Differences of the inferred laser current between the control and\n  the ibuprofen datasets, $\\Delta I_{\\rm ibuprofen}$. Errors represent\n  standard deviations, estimated with bootstrapping. (B) Similar\n  differences for the mutant worm, $\\Delta I_{\\rm mutant}$.  Error\n  bars are estimated by bootstrapping. (C) Dependence of the statistical\n  significance of the nociception level reduction (measured by the $Z$ score)\n  for ibuprofen at 110 mA on the number of ibuprofen trials.  \n  \\label{fig:Delta_Ipred}}\n\\end{figure}\n\n\n\\section*{Designing experiments: how many worms?}\n\nWe expect our analysis to be useable for screening large numbers of\nchemicals for analgesic action. Since our approach targets one\nindividual worm at a time, we need to estimate the number of worms\nneeded to achieve statistical significance in such screening\nexperiments. For this, we fix the number of control worms, arguing\nthat these must be only analyzed once, and hence a relatively large\nnumber of them can be tested. We then focus on ibuprofen, whose action\nis analgesic in our experiments, and on the bin at 110 mA, where the\nworms experience the most significant nociception reduction. There are\n$N_{{\\rm ibuprofen},110}=94$ worms in this bin. We randomly sample\nwith replacements $n<N_{{\\rm ibuprofen},110}$ worms from among these\nibuprofen-treated worms and repeat our analysis pipeline, estimating\nthe $\\Delta I_{\\rm ibuprofen}(n)$. Resampling 1000 times (both the\nibuprofen and the control datasets), we also estimate the variance of\n$\\Delta I_{\\rm ibuprofen}(n)$, and hence the $Z$ score as a function of\n$n$, which is plotted in Fig.~\\ref{fig:Delta_Ipred} (C). The plot here\nis an {\\em underestimate} of the true $Z$ score since resampling with\nreplacements removes some stimulus values from the dataset, hence\nincreasing the mismatch between control worms and the paired treated\nworms. Even with this, $Z\\approx2$ is achieved at $n\\approx 60$\nibuprofen worms. In other words, in a typical screening experiment,\none would need to test $200$ or more worms to build the control model,\nand then at least $\\sim 60$ worms additionally for each treatment\ncondition.\n\n\\section*{Discussion}\n\nTypically the goal of sensory-response experiments is to develop a\nmodel that can predict the behavior in response to the stimuli. Here\nwe wanted to do this in reverse. Our goal was to build a statistical\nmodel of the thermal stimulus from careful measurements of the\nnociceptive behavior of {\\em C.\\ elegans}, and to use this model to\ninfer the changes in the perceived level of ``pain'' felt by the\norganism due to perturbation in the nociception transduction\npathway. Given this model, we could then measure changes in\nnociception perception due to effects of analgesics and mutations, and\nuse this as a basis to study the mechanism of nociception transduction in a\ngenetically tractable organism amenable to high-throughput screens. As\na representative data set, we choose to study the standard laboratory\n{\\em C.\\ elegans} strain N2, N2 treated with ibuprofen, and a mutant\nwith defects in TRPV function.\n\nFor the model to be successful, we had to meet a number of challenges.\nSince the worm could not communicate its nociception level to us directly we\nhad to infer this level by reading the ``body language'' of the worm's\n``pain'' response. The difficulty with quantifying a behavioral response\nas a measure of nociception level is that drugs or mutations can\naffect locomotory behavior in addition to perturbing sensory\ntransduction. So in an attempt to deconvolve these effects, we used\nthe entire behavioral profile instead of making ad hoc measurements\nand leveraged the fact that nociception responses are typically highly\nstereotyped. This resulted in the discovery that the response can be\nmodeled with a velocity profile template that scales non-linearly in\nresponse to an applied laser current. The success of the template in\nmodeling the stereotyped wild-type nociception response was confirmed\nby a functional collapse of the velocity profiles across different\nnociception levels. This discovery of invariance is important since it\nnot only allowed us to effectively correlate nociceptive behavior to\nthe stimulus level, but it also allowed us to determine if the\nlocomotory changes in our thermal nociception assay was due to changes\nspecifically in the sensory transduction pathway or due to other\ngeneral locomotory factors. By carefully accounting for the variation\nin our data and quantifying how much of this variation is captured by\nthe model, we showed that the stereotypical behavior is unaffected by\nibuprofen, save for changing the amplitude of the response. Thus this\ndrug application likely reduced the perceived nociception level in the\nworm. In contrast, a TRPV mutation changes locomotion in a way that is\nnot as well captured by the template model. Thus we can be objectively\ncritical about any nociception inference made with this strain.\n\nThe model was also useful in determining key experimental parameters\nfor future measurements. After verification that the model works well\nwith the native and ibuprofen treated stimulus-response data, we\nquantified the changes in thermal nociception perception due to\nibuprofen treatment.  Our modeling and experimental assessment of\nthermal nociception identified the optimal stimulus range and required\nnumber of trials to determine statistically significant differences\nbetween the inferred current of N2 in the untreated and treated\nconditions.\n\nIn conclusion, we have built a general model that connects stereotyped\nbehavior to stimulus. With a language to describe this relationship,\nit is now possible to study quantitatively the effects of genetics and\nchemicals on this sensorimotor behavior. We believe that the utility\nof the model is quite general and could be applied to different model\nsystem. However, we particularly hope that this work helps further\nestablish {\\em C.\\ elegans} as a model for nociceptive research.\n\n\n\n\n\\section*{Materials and Methods}\n\n\\subsection*{Worm preparation and experiment design}\n\nAll worms were grown and maintained under standard conditions\n\\cite{Brenner1974wn}, incubated with food at 20 $^\\circ$C. Well fed worms were\nwashed twice then gently spun down for 1 minute and the supernatant\ndiscarded by aspiration. For the drug application, 100 $\\mu$L of\nibuprofen in M9 at 100 $\\mu$M was added to the eppendorf tube. For\nthe wild-type and mutant data set, M9 was used instead of the drug\nsolution. Worms were then placed in an incubator for 30 minutes at\n20$^\\circ$C. After that worms were poured onto a seeded agar plate and\ntransferred to agar assay plates by a platinum wire pick. These assay\nplates were incubated at 20$^\\circ$C for 30 minutes, and then the experimental\ntrials were done within the next 30 minutes. In total $N=201$ worms\nfor the control group, $N=441$ worms for the ibuprofen group, and\n$N=100$ worms for the mutant group (ocr-2(ak47) osm-9(ky10) IV;\nocr-1(ak46)) group were tested. The mutant strain was obtained from\nthe Caenorhabditis Genetics Center.\n\nThe thermal nociceptive stimulation instrument has been described\npreviously \\cite{Mohammadi:2013ku}. In summary, an infrared laser is\ndirected to heat the head of a freely crawling worm ($\\sim0.5$mm FWHM)\non an agar plate. The laser pulse is generated with a randomly chosen\nlaser current between 0 to 200 mA, with a duration of 0.1 s. The\nheating of the worm is nearly instantaneous, and it is directly\nproportional to the current, between 0 and 2 $^\\circ$C for the\nthe current range used in our experiments. Worms were stimulated only once and not reused.\nThe movements of the worms are imaged using a standard\nstereomicroscope with video capture and laser control software written\nin LabVIEW. For each nociception stimulus trial, a random worm is selected on\nthe plate and its motion is sampled at 60 Hz for 15 s, and the laser\nis engaged 1~s after the start of the video recording.\n \n\\subsection*{Data Analysis}\n\nThe recorded nociceptive response videos were then processed with\nMatlab to calculate the time series of the worm centroid motion as\ndescribed previously \\cite{Mohammadi:2013ku}. All the worms that were\nnot stimulated near the head or were not moving forward in the\nbeginning of the video were discarded. Numerical derivatives of the\ncentroid times series were then taken and filtered with a custom 500\nms Gaussian filter, which was a one-sided Gaussian at the edges of the\nrecorded time period, becoming a symmetric Gaussian away from the\nedges. This removed the noise due to numerical differentiation and\nalso averaged out the spurious fluctuations in the forward velocity\ndue to the imperfect sinusoidal shapes of the moving worm. We verified\nthat different choices of the filter duration had little effect on the\nsubsequent analysis pipeline. The direction of the velocity was\ndetermined by projecting the derivative of the centroid time series\nonto the head-to-tail vector for each worm, with the positive and\nnegative velocity values denoting forward / backward motion,\nrespectively.\n\n\nThe filtered velocity profiles needed to be subsampled\nadditionally. This was because the statistical model of the data,\nEq.~(\\ref{eq:fullmodel}), involved covariance matrices of the active\nand paused velocity profiles, $\\Sigma_p$ and $\\Sigma_a$ (note that\nvelocity profiles are not temporally translationally invariant due to\nthe presence of the stimulus, thus the full covariance matrix is\nneeded, and not a simpler correlation function). To have a full rank\ncovariance matrix, the number of trials must be larger than the number\nof time points. Alternatively, regularization is needed for covariance\ncalculation. The autocorrelation function for all three worm types\nshowed a natural correlation time scale of $\\gtrsim 0.2$ s, whether\nthe data was pre-filtered or not. Thus subsampling at frequency $>5$\nHz would not result in data loss. Therefore, instead of an arbitrary\nregularization, we chose to subsample the data at 12 Hz, leaving us\nwith 37 data points to characterize the first 3 s of the worm velocity\ntrace after the stimulus application, $1\\le t\\le 4$ s since the start\nof the trial. Equation~(\\ref{eq:fullmodel}) additionally needs\nknowledge of $T$, the number of effectively independent velocity\nmeasurements in the profile. This is obtained by dividing the duration\nof the profile by the velocity correlation time. An uncertainty of\nsuch procedure has a minimal effect on the model of the experiment\nsince it simply changes log likelihoods of models by the same factor,\nnot changing which model has the maximum likelihood.\n\nWe then considered limiting the duration of the velocity profile used\nin model building: if velocities at certain time points do not\ncontribute to identification of $I$, they should be removed to\ndecrease the number of unknowns in the model that must be determined\nfrom data (values of the templates at different time points). The\nfirst candidate for removal was the period of about 10 frames (0.16 s)\nafter the laser stimulation since worms do not respond to the stimulus\nso quickly. However, removal of this time period had a negligible\neffect on the model performance, and we chose to leave it\nintact. In contrast, starting from 3.3 s (2.3 s after the stimulus) the\nfraction of explainable variance drops to nearly zero\n(cf.~Fig.~\\ref{fig:var}) since many worms already had turned by this\ntime and resumed forward motion. Therefore, we eventually settled on\nthe time in the $1.0\\dots3.3$ s range for building the model.\n\nWhenever needed, we estimated variance of our predictions by\nbootstrapping the whole analysis pipeline \\cite{bootstrap}.  For this,\nwe created 1000 different datasets by resampling with replacement from\nthe original control dataset and the mutant / ibuprofen\ndatasets. Control statistical models (the scaling function $f$ and the\nvelocity templates) were estimated for each resampled control\ndataset. Standard deviations of these models were used as estimates of\nerror bars in Fig.~\\ref{fig:The-normalized-active}. For\nFig.~\\ref{fig:Delta_Ipred}, we additionally needed to form the closest\ncontrol / treatment worm pairs. These were formed between the {\\em\n  resampled} data sets for all worm types as well. Standard deviations\nof $\\Delta I_{\\rm type}$ evaluated by such resampling were then\nplotted in Fig.~\\ref{fig:Delta_Ipred} and used to estimate $Z$\nscores. Note that such resampling produces data were control /\ntreatment paired worms have slightly larger current differences than\nin the actual data; this leads to our error bars being {\\em\n  overestimates}.\n\nModel in Eq.~(\\ref{eq:bayes}) requires knowing $P(I)$. In principle,\nthis is controlled by the experimentalist, and thus should be\nknown. In our experiments, $P(I)$ was set to be uniform. However, as\ndescribed above, some of the worms were discarded in preprocessing,\nand this resulted in non-uniformly distributed current samples. To\naccount for this, we used the empirical $P_{\\rm emp}(I)$ in our\nanalysis instead of $P(I)={\\rm const}$. In turn, $P_{\\rm emp}(I)$ was\ninferred using a well-established algorithm for estimation of\none-dimensional continuous probability distributions from data\n\\cite{Nemenman:2002gl}.\n\n\n\\subsection*{Calculating the template velocities, the covariances, and\n  the scaling function }\n\nThe template for the paused state ${\\bf u}_{p}$ is calculated by taking\nthe average of all paused velocity profiles for each of the three worm\ndatasets.  The covariance $\\Sigma_{p}$ is then the covariance of the\nset of the paused velocity profiles. \n\nFor active worms, we start with fixed putative parameter values\n${\\mathcal I}_1$ and ${\\mathcal I}_2$. We then calculate the active template ${\\bf u}_{a}$ and\nthe covariance matrix $\\sum_a$ by maximizing the\nlikelihood in Eq.~(\\ref{Pva})\n\n", "index": 27, "text": "\\begin{align}\n\\frac{\\partial \\sum_{i}^{N_{{\\rm type},a}}\\log P({\\bf v}_i|a,I_i)}\n{\\partial  {\\bf u}_{a}}&\\propto\\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_i\n               f_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)-{\\bf u}_{a}f^2_{{\\mathcal I}_1\\,{\\mathcal I}_2}(I_i)\\right]=0,\n\\\\\n\\frac{\\partial \\sum_{i}^{N_{{\\rm type},a}} \\log  P({\\bf v}_i|a,I_i)}\n{\\partial\n  \\Sigma_a}&\\propto \\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_i-{\\bf u}_{a}f_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)\\right]^2-(\\Sigma_a)^{-1}=0,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{\\partial\\sum_{i}^{N_{{\\rm type},a}}\\log P({\\bf v}_{i}|a,I_{%&#10;i})}{\\partial{\\bf u}_{a}}\" display=\"inline\"><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></msubsup><mi>log</mi><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐯</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>a</mi><mo>,</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>𝐮</mi><mi>a</mi></msub></mrow></mfrac></mstyle></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\propto\\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_{i}f_{{\\mathcal{I%&#10;}}_{1},{\\mathcal{I}}_{2}}(I_{i})-{\\bf u}_{a}f^{2}_{{\\mathcal{I}}_{1}\\,{%&#10;\\mathcal{I}}_{2}}(I_{i})\\right]=0,\" display=\"inline\"><mrow><mrow><mi/><mo>∝</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></munderover></mstyle><mrow><mo>[</mo><mrow><mrow><msub><mi>𝐯</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo>⁢</mo><msubsup><mi>f</mi><mrow><mpadded width=\"+1.7pt\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub></mpadded><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{\\partial\\sum_{i}^{N_{{\\rm type},a}}\\log P({\\bf v}_{i}|a,I_{%&#10;i})}{\\partial\\Sigma_{a}}\" display=\"inline\"><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></msubsup><mi>log</mi><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝐯</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>a</mi><mo>,</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>a</mi></msub></mrow></mfrac></mstyle></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\propto\\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_{i}-{\\bf u}_{a}f_%&#10;{{\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I_{i})\\right]^{2}-(\\Sigma_{a})^{-1}=0,\" display=\"inline\"><mrow><mrow><mi/><mo>∝</mo><mrow><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></munderover></mstyle><msup><mrow><mo>[</mo><mrow><msub><mi>𝐯</mi><mi>i</mi></msub><mo>-</mo><mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo>⁢</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup></mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>a</mi></msub><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04685.tex", "nexttext": "\nHaving thus estimated ${\\bf u}_a$ and $\\Sigma_a$ at fixed parameter values\n${\\mathcal I}_1$, ${\\mathcal I}_2$, we maximize $\\prod_iP({\\bf v}_i|a,I_i)$ over the\nparameters using standard optimization algorithms provided by\nMATLAB. We perform optimization from ten different initial conditions\nto increase the possibility that we find a global, rather than the\nlocal maximum.\n\n\\subsection*{Acknowledgements}\n\nWe thank the granting agencies NSF, HFSP (Human Frontier Science\nProgram), and NSERC (Natural Sciences and Engineering Council of\nCanada) for funding, and the Aspen Center for Physics for hosting the\nprogram on ``Physics of Behavior'', where some of this work was done.\n\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{Stewart2003}\nStewart WF, Ricci JA, Chee E, Morganstein D, Lipton R.\n\\newblock {Lost productive time and cost due to common pain conditions in the\n  US workforce.}\n\\newblock JAMA. 2003;290(18):2443--54.\n\n\\bibitem{Mogil2009}\nMogil JS.\n\\newblock {Animal models of pain: progress and challenges.}\n\\newblock Nat Rev Neurosci. 2009;10(4):283--94.\n\n\\bibitem{Tobin2002}\nTobin DM, Madsen DM, Kahn-Kirby A, Peckol EL, Moulder G, Barstead R, et~al.\n\\newblock Combinatorial expression of {TRPV} channel proteins defines their\n  sensory functions and subcellular localization in {\\em C.~elegans} neurons.\n\\newblock Neuron. 2002;35(2):307--318.\n\n\\bibitem{Tobin2004}\nTobin DM, Bargmann CI.\n\\newblock {Invertebrate nociception: Behaviors, neurons and molecules}.\n\\newblock J Neurobiol. 2004;61(1):161--174.\n\n\\bibitem{Smith2009gw}\nSmith ESJ, Lewin GR.\n\\newblock {Nociceptors: a phylogenetic view.}\n\\newblock J Compar Physiol A, Neuroethology, sensory, neural, and behavioral\n  physiology. 2009;195(12):1089--1106.\n\n\\bibitem{Barrot2012}\nBarrot M.\n\\newblock {Tests and models of nociception and pain in rodents}.\n\\newblock Neuroscience. 2012;211:39--50.\n\n\\bibitem{LeBars2001}\n{Le Bars} D, Gozariu M, Cadden SW.\n\\newblock {Animal models of nociception.}\n\\newblock Pharmacological reviews. 2001;53(4):597--652.\n\n\\bibitem{DAmour1941}\nD'Amour FE, Smith DL.\n\\newblock {A method for determining loss of pain sensation.}\n\\newblock J Pharmacol Exp Ther. 1941;72:74--79.\n\n\\bibitem{OCallaghan1975}\nO'Callaghan JP, Holtzman SG.\n\\newblock {Quantification of the analgesic activity of narcotic antagonists by\n  a modified hot-plate procedure.}\n\\newblock J Pharmacol Exp Ther. 1975;192:497--505.\n\n\\bibitem{WOOLFE1943}\nWoolfe G, Macdonald AD.\n\\newblock {The evaluation of the analgesic action of pethidine hydrochloride\n  (Demerol)}.\n\\newblock J Pharmacol Exp Ther. 1944;80(3):300--307.\n\n\\bibitem{Hargreaves1988}\nHargreaves K, Hargreaves K, Dubner R, Dubner R, Brown F, Brown F, et~al.\n\\newblock {A new and sensitive method for measuring thermal nociception in\n  cutaneous hyperalgesia.}\n\\newblock Pain. 1988;32(1):11.\n\n\\bibitem{Wegner2008}\nWegner K, Horais Ka, Tozier Na, Rathbun ML, Shtaerman Y, Yaksh TL.\n\\newblock {Development of a canine nociceptive thermal escape model}.\n\\newblock Journal of Neuroscience Methods. 2008;168(1):88--97.\n\n\\bibitem{Alreja1984}\nAlreja M, Mutalik P, Nayar U, Manchanda SK.\n\\newblock {The formalin test: a tonic pain model in the primate.}\n\\newblock Pain. 1984;20(1):97--105.\n\n\\bibitem{Dykstra1986}\nDykstra La, Woods JH.\n\\newblock {A tail withdrawal procedure for assessing analgesic activity in\n  rhesus monkeys.}\n\\newblock Journal of pharmacological methods. 1986;15(3):263--269.\n\n\\bibitem{Langford2010cm}\nLangford DJ, Bailey AL, Chanda ML, Clarke SE, Drummond TE, Echols S, et~al.\n\\newblock {Coding of facial expressions of pain in the laboratory mouse.}\n\\newblock Nature methods. 2010;7(6):447--449.\n\n\\bibitem{Keating:2012hq}\nKeating SCJ, Thomas AA, Flecknell PA, Leach MC.\n\\newblock {Evaluation of EMLA cream for preventing pain during tattooing of\n  rabbits: changes in physiological, behavioural and facial expression\n  responses.}\n\\newblock PloS ONE. 2012;7(9):e44437.\n\n\\bibitem{Gleerup2015ii}\nGleerup KB, Forkman B, Lindegaard C, Andersen PH.\n\\newblock {An equine pain face.}\n\\newblock Veterinary anaesthesia and analgesia. 2015;42(1):103--114.\n\n\\bibitem{Im:2012gx}\nIm SH, Galko MJ.\n\\newblock {Pokes, sunburn, and hot sauce: Drosophila as an emerging model for\n  the biology of nociception.}\n\\newblock Developmental dynamics: an official publication of the American\n  Association of Anatomists. 2012;241(1):16--26.\n\n\\bibitem{Sokabe2008}\nSokabe T, Tsujiuchi S, Kadowaki T, Tominaga M.\n\\newblock {Drosophila painless is a Ca2+-requiring channel activated by noxious\n  heat.}\n\\newblock J Neurosci. 2008;28(40):9929--9938.\n\n\\bibitem{Zhong2010}\nZhong L, Hwang RY, Tracey WD.\n\\newblock {Pickpocket Is a DEG/ENaC Protein Required for Mechanical Nociception\n  in Drosophila Larvae}.\n\\newblock Current Biology. 2010;20(5):429--434.\n\n\\bibitem{Tracey2003}\nTracey WD, Tracey WD, Wilson RI, Wilson RI, Laurent G, Laurent G, et~al.\n\\newblock {Painless, a Gene Essential for Nociception}.\n\\newblock Cell. 2003;113:261--273.\n\n\\bibitem{Liedtke2003}\nLiedtke W, Tobin DM, Bargmann CI, Friedman JM.\n\\newblock {Mammalian TRPV4 (VR-OAC) directs behavioral responses to osmotic and\n  mechanical stimuli in Caenorhabditis elegans.}\n\\newblock Proc Natl Acad Sci USA. 2003;100 Suppl:14531--14536.\n\n\\bibitem{Roughan2000bm}\nRoughan JV, Flecknell PA.\n\\newblock {Effects of surgery and analgesic administration on spontaneous\n  behaviour in singly housed rats.}\n\\newblock Research in veterinary science. 2000;69(3):283--288.\n\n\\bibitem{Stephens2008}\nStephens G, Johnson-Kerner B, Bialek W, Ryu W.\n\\newblock {Dimensionality and dynamics in the behavior of {\\em {C.}~elegans}}.\n\\newblock PLoS Comp Biol. 2008;4(4):e1000028.\n\n\\bibitem{Culotti1978ul}\nCulotti JG, Russell RL.\n\\newblock {Osmotic avoidance defective mutants of the nematode Caenorhabditis\n  elegans.}\n\\newblock Genetics. 1978;90(2):243--256.\n\n\\bibitem{Hilliard2004ig}\nHilliard MA, Bergamasco C, Arbucci S, Plasterk RH, Bazzicalupo P.\n\\newblock {Worms taste bitter: ASH neurons, QUI-1, GPA-3 and ODR-3 mediate\n  quinine avoidance in Caenorhabditis elegans}.\n\\newblock EMBO J. 2004;23(5):1101--1111.\n\n\\bibitem{Kaplan1993jz}\nKaplan JM, Horvitz HR.\n\\newblock {A dual mechanosensory and chemosensory neuron in Caenorhabditis\n  elegans.}\n\\newblock Proc Natl Acad Sci USA. 1993 Mar;90(6):2227--2231.\n\n\\bibitem{Chalfie1985vl}\nChalfie M, Sulston JE, White JG, Southgate E, Thomson JN, Brenner S.\n\\newblock {The neural circuit for touch sensitivity in Caenorhabditis elegans.}\n\\newblock J Neurosci. 1985 Apr;5(4):956--964.\n\n\\bibitem{Wittenburg1999}\nWittenburg N, Baumeister R.\n\\newblock {Thermal avoidance in Caenorhabditis elegans: an approach to the\n  study of nociception.}\n\\newblock Proc Natl Acad Sci USA. 1999;96(18):10477--10482.\n\n\\bibitem{Mohammadi:2013ku}\nMohammadi A, Byrne~Rodgers J, Kotera I, Ryu W.\n\\newblock {Behavioral response of Caenorhabditis elegans to localized thermal\n  stimuli.}\n\\newblock BMC Neuroscience. 2013;14(1):66.\n\n\\bibitem{Bargmann1991}\nBargmann CI, Horvitz HR.\n\\newblock {Chemosensory neurons with overlapping functions direct chemotaxis to\n  multiple chemicals in C. elegans.}\n\\newblock Neuron. 1991;7(5):729--742.\n\n\\bibitem{Troemel1997}\nTroemel ER, Kimmel BE, Bargmann CI.\n\\newblock {Reprogramming chemotaxis responses: Sensory neurons define olfactory\n  preferences in {\\em C.~elegans}}.\n\\newblock Cell. 1997;91(2):161--169.\n\n\\bibitem{Huang1994}\nHuang M, Chalfie M.\n\\newblock {Gene interactions affecting mechanosensory transduction in\n  Caenorhabditis elegans.}\n\\newblock Nature. 1994;367(6462):467--470.\n\n\\bibitem{Mori1995bp}\nMori I, Ohshima Y.\n\\newblock {Neural regulation of thermotaxis in {\\em Caenorhabditis elegans}}.\n\\newblock Nature. 1995;376(6538):344--348.\n\n\\bibitem{Kwok2006fl}\nKwok TCY, Ricker N, Fraser R, Chan AW, Burns A, Stanley EF, et~al.\n\\newblock {A small-molecule screen in {\\em C.~elegans} yields a new calcium\n  channel antagonist.}\n\\newblock Nature. 2006;441(7089):91--95.\n\n\\bibitem{Stephens2011}\nStephens GJ, {Bueno de Mesquita} M, Ryu WS, Bialek W.\n\\newblock {Emergence of long timescales and stereotyped behaviors in\n  Caenorhabditis elegans.}\n\\newblock Proc Natl Acad Sci USA. 2011;108(18):7286--7289.\n\n\\bibitem{Stephens2010}\nStephens GJ, Johnson-Kerner B, Bialek W, Ryu WS.\n\\newblock {From modes to movement in the behavior of {\\em Caenorhabditis\n  elegans}.}\n\\newblock PloS ONE. 2010;5(11):e13914.\n\n\\bibitem{Brenner1974wn}\nBrenner S.\n\\newblock {The genetics of {\\em Caenorhabditis elegans}.}\n\\newblock Genetics. 1974;77(1):71--94.\n\n\\bibitem{bootstrap}\nEfron B, Tibshirani R.\n\\newblock An introduction to the bootstrap.\n\\newblock Boca Raton, FL: Chapman \\& Hall/CRC; 1994.\n\n\\bibitem{Nemenman:2002gl}\nNemenman I, Bialek W.\n\\newblock Occam factors and model independent {B}ayesian learning of continuous\n  distributions.\n\\newblock Phys Rev E. 2002;65:026137.\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 52117, "prevtext": "\nwhere $N_{{\\rm type},a}$ is the number of active worms of the analyzed\ntype. This gives:\n\n", "index": 29, "text": "\\begin{align}\n  {\\bf u}_{a}({\\mathcal I}_1,{\\mathcal I}_{2})&=\\frac{\\sum_{i=1}^{N_{{\\rm\n                          type},a}}{\\bf v}_if_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)}{\\sum_{i=1}^{N_{{\\rm\n                          type},a}}f^2_{{\\mathcal I}_1,{\\mathcal I}_{2}}(I_i)},\\\\\n  \\Sigma_a &=\\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_i-{\\bf u}_{a}f_{{\\mathcal I}_1,{\\mathcal I}_2}(I_i)\\right]^2.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\bf u}_{a}({\\mathcal{I}}_{1},{\\mathcal{I}}_{2})\" display=\"inline\"><mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{\\sum_{i=1}^{N_{{\\rm type},a}}{\\bf v}_{i}f_{{\\mathcal{I}}_{%&#10;1},{\\mathcal{I}}_{2}}(I_{i})}{\\sum_{i=1}^{N_{{\\rm type},a}}f^{2}_{{\\mathcal{I}%&#10;}_{1},{\\mathcal{I}}_{2}}(I_{i})},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></msubsup><mrow><msub><mi>𝐯</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></msubsup><mrow><msubsup><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mstyle></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Sigma_{a}\" display=\"inline\"><msub><mi mathvariant=\"normal\">Σ</mi><mi>a</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{i}^{N_{{\\rm type},a}}\\left[{\\bf v}_{i}-{\\bf u}_{a}f_{{%&#10;\\mathcal{I}}_{1},{\\mathcal{I}}_{2}}(I_{i})\\right]^{2}.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mrow><mi>type</mi><mo>,</mo><mi>a</mi></mrow></msub></munderover></mstyle><msup><mrow><mo>[</mo><mrow><msub><mi>𝐯</mi><mi>i</mi></msub><mo>-</mo><mrow><msub><mi>𝐮</mi><mi>a</mi></msub><mo>⁢</mo><msub><mi>f</mi><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>1</mn></msub><mo>,</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mn>2</mn></msub></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>I</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]