[{"file": "1601.05396.tex", "nexttext": "\n\nwhere $\\tilde{h}(f)$ represents the Fourier transform of $h$, ${}^*$ in  \nsuperscript represents complex conjugation, $\\mathrm{S}_n(|f|)$ is the power \nspectral density of detector noise. We integrate the inner product over the \nfrequency interval $[f_\\mathrm{low}, f_\\mathrm{high}]$, which spans the \nsensitive band of GW detector. In this paper we use $f_\\mathrm{low}=15$~Hz,\n$f_\\mathrm{high}=4096$~Hz, and the zero-detuning high-power noise \ncurve~\\cite{Shoemaker2009} to model aLIGO at design sensitivity.\nThis inner product is sensitive to an arbitrary\nphase and time shift between the two waveforms. Since both of these are extrinsic\nparameters and of little astrophysical interest, we maximize the inner product \nover them to define the maximized overlap ${\\mathcal{O}}$, \n\n\n", "itemtype": "equation", "pos": 20917, "prevtext": "\n\n\\title{\nAccuracy of binary black hole waveform models for aligned-spin binaries\n}\n\n\\author{Prayush Kumar}{\\affiliation{Canadian Institute for Theoretical     Astrophysics, 60 St.~George Street, University of Toronto,     Toronto, ON M5S 3H8, Canada}}\n\\author{Tony Chu}{\\affiliation{Department of Physics,  \tPrinceton University, Jadwin Hall, Princeton, NJ 08544, USA}}\n\\author{Heather Fong}{\\affiliation{Canadian Institute for Theoretical     Astrophysics, 60 St.~George Street, University of Toronto,     Toronto, ON M5S 3H8, Canada}}{\\affiliation{Department of Physics, University of Toronto, 60 St.~George Street, Toronto, ON M5S 3H8, Canada}}\n\\author{Harald P. Pfeiffer}{\\affiliation{Canadian Institute for Theoretical     Astrophysics, 60 St.~George Street, University of Toronto,     Toronto, ON M5S 3H8, Canada}}{\\affiliation{Max Planck Institute for Gravitational Physics (Albert Einstein Institute), Am M{\\\"u}hlenberg~1, 14476 Potsdam-Golm, Germany}}{\\affiliation{Canadian Institute for Advanced Research,      180 Dundas St.~West, Toronto, ON M5G 1Z8, Canada}}\n\\author{Michael Boyle}{\\affiliation{Cornell Center for Astrophysics and Planetary Science, Cornell University, Ithaca, New York 14853, USA}}\n\\author{Daniel A. Hemberger}{\\affiliation{Theoretical Astrophysics 350-17,     California Institute of Technology, Pasadena, CA 91125, USA}}\n\\author{Lawrence E.~Kidder}{\\affiliation{Cornell Center for Astrophysics and Planetary Science, Cornell University, Ithaca, New York 14853, USA}}\n\\author{Mark A.~Scheel}{\\affiliation{Theoretical Astrophysics 350-17,     California Institute of Technology, Pasadena, CA 91125, USA}}\n\\author{Bela~Szilagyi}{\\affiliation{Theoretical Astrophysics 350-17,     California Institute of Technology, Pasadena, CA 91125, USA}}{\\affiliation{Jet Propulsion Laboratory, California Institute of Technology, 4800 Oak Grove Drive, Pasadena, CA 91109, USA}}\n\n\\date{\\today}\n\n\\begin{abstract}\n  Coalescing binary black holes are among the primary science targets\n  for second generation ground-based gravitational wave detectors.\n  Reliable gravitational waveform models are central to detection of\n  such systems and subsequent parameter estimation.  This paper\n  performs a comprehensive analysis of the accuracy of four waveform\n  models for binary black holes with aligned spins, utilizing a new\n  set of $84$ high-accuracy numerical relativity simulations. \n  Our analysis covers comparable mass binaries (mass-ratio $1\\le q\\le 3$),\n  and samples independently both black hole spins up to dimensionless\n  spin-magnitude of $0.9$ for equal-mass binaries and $0.85$ for\n  unequal mass binaries.  Furthermore, we focus on the high-mass\n  regime (total mass $\\gtrsim 50M_\\odot$).\n  We find that the PhenomD and SEOBNRv2 models perform very\n  well for signal detection, losing less than $0.5\\%$ of the\n  recoverable signal-to-noise ratio, except that\n  SEOBNRv2's\n  efficiency drops slightly for both black holes spins aligned at\n  large magnitude. For parameter estimation, PhenomD and SEOBNRv2 are \n  satisfactory for moderately strong signals, although accuracy deteriorates with\n  increased mass-ratio, and when at least one black hole spin is large\n  and aligned.\n  PhenomD agrees generally even better with the NR simulations than SEOBNRv2, \n  with the latter deviating with the NR merger phase at $q=2,3$ and \n  the highest aligned spins. The PhenomC and SEOBNRv1 models are\n  found to be distinctly less accurate than their more recent \n  counterparts.  \n  Finally, we quantify the systematic bias expected from all\n  four waveform models during parameter estimation for several\n  recovered binary parameters: chirp mass, mass-ratio, and effective spin.\n\\end{abstract}\n\n\\pacs{}\n\n\n\n\n\n\n\n\\maketitle\n\n\n\\section{Introduction}\n\n\nGravitational-wave (GW) astronomy enters an exiting time \nwith a global concerted effort going online to detect gravitational waves\nwith ground-based facilities.  In North America, the\nAdvanced Laser Interferometer Gravitational-wave Observatory\n(aLIGO) operates two $4-$km scale GW detectors\\cite{Harry:2010zz,aLIGO2},\nlocated in Hanford, Washington and Livingston, Louisiana. Both of\nthese instruments began their first observation run ``O1'' in\nSeptember 2015, which is scheduled to last for four \nmonths~\\cite{Aasi:2013wya}, operating at more than three times the strain \nsensitivity of the initial LIGO detectors~\\cite{Aasi:2014mqd}.\nIn addition, the upgrades to the Virgo\ndetector~\\cite{TheVirgo:2014hva}, construction of the KAGRA\ndetector~\\cite{Somiya:2012,kagra}, and planning of LIGO-India\ndetector~\\cite{2013IJMPD..2241010U} are underway.\n\n\nBinary black holes (BBHs) are among the most promising GW sources\nfor detection with aLIGO. Compact binary merger rate estimates suggest\na GW detection rate of approximately a few tens of binary black holes\n(BBH) every year~\\cite{Abadie:2010cfa}. The actual masses of\nastrophysical black holes are uncertain, but observations and\npopulation synthesis studies suggest that BHs formed from stellar\ncore-collapse can have masses up to and higher than\n$34M_\\odot$~\\cite{2008ApJ...678L..17S,2010ApJ...714.1217B}.  Also,\nrecent measurements using continuum fitting and X-ray reflection\nfitting suggest that black holes can have high spin, with the BH\nangular momentum in dimensionless units exceeding\n$0.8$~\\cite{2011ApJ...742...85G,2012MNRAS.424..217F,Gou:2013dna,\n  2009ApJ...697..900M,McClintock:2006xd,Miller:2009cw,McClintock:2013vwa}.\nTherefore the observations of GWs emitted by spinning BBHs will allow us to\nunderstand the spin-spin and spin-orbit dynamics of the two-body\nsystem, apart from allowing us to test strong-field dynamics of\nGeneral Relativity.\n\nUnlocking the full scientific potential of BBH GW observations, however,\nwill require us to detect as many such GWs as possible, and to\naccurately characterize and classify the BBH systems that emitted them.\n\n\nOptimal GW searches for stellar-mass BBH signals are based on\nmatched-filtering the detector data with modeled waveforms. Past\nLIGO-Virgo searches for compact binaries used models of non-spinning\nBBH inspirals as filtering templates,\ne.g.~\\cite{Colaboration:2011nz,Abadie:2010yb,\n  Abbott:2009qj,Abbott:2009tt} (with the exception\nof~\\cite{Abbott:2007ai}).  Recent progress has moved the collaboration\ntowards using inspiral-merger-ringdown models of aligned-spin BBHs as\nfilters. It has been shown that doing so will significantly increase\nsearch efficiency against generically oriented\nbinaries~\\cite{Harry:2013tca}.\n\nFurthermore, it has been shown that complete inspiral-merger-ringdown\n(IMR) waveforms are needed for the observation of BBHs with\n$M\\gtrsim 12M_\\odot$~\\cite{Brown:2012nn}.  It is therefore important\nfor the aligned-spin candidate waveform models to be carefully\nexamined for accuracy in capturing the entire coalescence process,\nincluding merger-ringdown.\n\nEarly work on assessing the accuracy of different waveform models has\nfocused on model-model comparisons~\\cite{Damour:2000zb,\n  Damour2001,Damour:2002kr,Damour02,Gopakumar:2007vh,Buonanno:2009}. In\nabsence of more accurate reference waveforms, such studies have been\nlimited by the most accurate model they consider, and have used\nmodel-model agreement to make statements about model accuracy.\n\nMore recently, there have been extensive studies of waveform models\ninvolving high-accuracy numerical relativity (NR)\nsimulations~\\cite{Boyle2007,\n  Boyle2008b,Boyle:2008,Pan2007,Hannam2007c,Hannam:2010ec,HannamEtAl:2010,\n  MacDonald:2012mp,Hinder:2013oqa,Kumar:2015tha}.  However, most of\nthese investigations have focused on binaries with zero spins or\nmodest spin magnitudes. Furthermore, while recently published\nmodels~\\cite{Taracchini:2013rva,Khan:2015jqa,Damour:2014sva} have used an \nunprecedented amount of information from NR to increase the accuracy of\ntheir merger description~\\cite{Husa:2015,Mroue:2013PRL,Hinder:2013oqa,Damour:2013tla},\ntheir accuracy has not been investigated in a systematic manner over the BBH \nparameter space.\n\n\nIn this paper, we explore the accuracy of currently available\nBBH waveform models using new high-accuracy NR simulations, \nfrom the perspective of their application to GW astronomy. \nThe $84$ numerical waveforms were computed with the Spectral Einstein Code\n(SpEC)~\\cite{SpECwebsite} and are presented in detail in a companion \npaper~\\cite{Chu:2015kft}.\nThis catalog covers non-precessing configurations, i.e. BBHs\nwith spin-vectors parallel or anti-parallel to the orbital \nangular momentum.\nMore specifically, it spans mass-ratios $q\\equiv m_1/m_2\\in[1,3]$, and and spin-projection $\\chi_i\\equiv \\vec{\\chi}_i\\cdot\\hat L\\in [-0.9,+0.9]$, where $i=1,2$ labels the two black holes, with mass $m_i$ and dimensionless angular momentum\n$\\vec\\chi_i\\equiv \\vec S_i/m_i^2$, and where $\\hat L$ denotes the\nunit vector along the direction of the orbital angular momentum.\nThe median length of these simulations is 24 orbits, allowing us to\nextend our comparisons down to binary masses as low as $40-70M_\\odot$\n(depending on configuration,\nc.f. Fig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}) while still covering\naLIGO's frequency band above $15$~Hz.  We restrict probed total masses\nbelow $150M_\\odot$.\n\n\nThe waveform models we investigate include two NR-calibrated\nEffective-One-Body (EOB) models (namely, SEOBNRv1 and\nSEOBNRv2)~\\cite{Taracchini:2012,Taracchini:2013rva}, and two recent\nphenomenological models (namely IMRPhenomC and\nIMRPhenomD)~\\cite{Santamaria:2010yb,Khan:2015jqa}.\n\nBoth EOB and IMRPhenom models are constructed using (different)\nextensions of Post-Newtonian (PN) dynamics of compact binaries, with free parameters\nthat are calibrated to NR simulations. We probe their accuracy in\ndifferent corners of the component spin space in this work.\nThe four waveform models were published over the period from 2010 to 2015. \nGiven the rapid progress in waveform modeling and numerical relativity, we\nexpect newer models to be superior to older ones.\n\nWe model detector sensitivity using the zero-detuning high-power noise\npower spectral density for aLIGO~\\cite{Shoemaker2009}, and use\n$f_\\mathrm{low}=15$~Hz as the lower frequency cutoff for filtering.\n\n\nWe perform the following studies. First, we measure the faithfulness\nof different waveform models by calculating their noise-weighted\noverlaps against the new NR waveforms.  We find that (i) both SEOBNRv2\nand IMRPhenomD are faithful to our NR simulations over most of the\nspin and mass-ratio parameter space (overlaps $>99\\%$), with overlaps\nfalling to $97-98\\%$ when component spins are anti-parallel to each\nother. However, when both BHs have large positive-aligned spins,\nIMRPhenomD fares significantly better, while the overlaps\nbetween SEOBNRv2 and NR fall to $80\\%$; (ii) both SEOBNRv1 and\nIMRPhenomC show larger disagreement with NR, and we clearly show that\nthey have been superseded by their respective recent versions in\naccuracy. Specifically, we find that SEOBNRv1 deteriorates when the\nspin on the \\textit{larger} BH is $\\gtrsim+0.5$ (with overlaps falling\nto $80\\%$), while IMRPhenomC performs poorly when the spin magnitude\non the \\textit{smaller} BH exceeds $\\approx 0.5$, with overlaps\nfalling below $80\\%$.  While we do not find a strong correlation\nbetween model accuracy and mass-ratio for the SEOBNRv2 and\nIMRPhenomD models, we do find that both SEOBNRv1 and IMRPhenomC\ndeteriorate in accuracy with increasing binary mass-ratio.\n\nIn addition, we also show that the IMRPhenomD and SEOBNRv2 models are\nindistinguishable from NR simulations in large regions of the considered \nparameter space up an effective signal-to-noise\n(SNR) of $20$ and $15$, respectively, albeit with significant dependence\non the mass-ratio and spins.\n\n\nIn our second study, we assess the viability of waveform\nwaveform models for aLIGO \\textit{detection} searches\nfor high-mass BBHs.  We compute the overlaps between each\nrescaled NR waveform and a large set of model waveforms that sample\nthe binary mass and spin parameter space densely. From this, we\nrecover the maximum fraction of the optimal signal SNR that any\nwaveform model can recover -- with the only loss being caused by\nintrinsic inaccuracies of the model itself.\n\nWe find that (i) both SEOBNRv2 and IMRPhenomD recover more than\n$99.5\\%$ of the optimal SNR over most of the mass and spin parameter\nspace, except when both BHs have large aligned spins, where the\ninaccuracies of SEOBNRv2 lead to a drop in SNR recovery to $97\\%$ of\nits optimal value; and (ii) both IMRPhenomC and SEOBNRv1 compensate\nfor their intrinsic inaccuracy with maximization of SNR over waveform\nparameters, recovering $>98\\%$ of the optimal SNR over most of the\nparameter space considered within their domain of applicability. This\nis a manifestation of the efficient utilization of the intrinsic mass\nand spin degeneracy of gravitational waveforms~\\cite{Baird:2012cu,\nPurrer:2015nkh}, allowing IMRPhenomC to\nbe a fairly \\textit{effectual} model despite being unable to reproduce\nNR waveforms with identical masses and spins.\n\nOverall, we conclude that both SEOBNRv2 and IMRPhenomD are viable\nfor modeling waveforms in aLIGO searches aimed at comparable\nmass-ratio high-mass BBHs. This validates the use of SEOBNRv2 by\ncurrent and future aLIGO searches.\n\nWe note that due to high computational cost of evaluating the \nSEOBNRv2 model, aLIGO data analyses use its reduced-order\nmodel~\\cite{Purrer:2015tud} which mitigates this drawback.\n\n\n\nOur third study concerns BBH parameter estimation from GW signals,\nwhich, when accurately done, will provide unique insight into\nastrophysical processes involving stellar-evolution, compact binary\nformation and evolution~\\cite{Read2009b,\n  Kreidberg:2012,Fairhurst:2009tc,2011ApJ...739...99N,\n  2012A&A...539A.124L,2012A&A...541A.155A,2012ApJS..203...28E,\n  2013ApJ...767..124N,metzger:11,2012IAUS..285..358M,Li:2011cg,Li:2011vx,\n  Littenberg:2015tpa,Mandel:2015spa}. Full Bayesian analyses of GW\nsignals require models that faithfully reproduce real GWs in order to\nmap them back to the properties of their source binaries. Model\ninaccuracies manifest themselves as biases in the recovered values of\nthe mass and spin parameters of BBHs. Therefore, we investigate the\nlevel of systematic biases that using different (aforementioned)\ninspiral-merger-ringdown (IMR) waveform models will incur.\n\nWe find that: \n(i) binary chirp-mass is best recovered by IMRPhenomD\n(within $\\pm 2-5\\%$), especially for spin-aligned systems. For systems\nwith anti-aligned spins, the systematic bias in chirp-mass is similar\nfor both IMRPhenomD and SEOBNRv2, rising above $5\\%$ at the higher end\nof the sampled binary mass range. \n\n(ii) total mass is recovered with similar accuracy ($2-5\\%$) by both\nSEOBNRv2 and IMRPhenomD, while not as well as both recover ${\\mathcal{M}_c}$. The\nolder SEOBNRv1 and IMRPhenomC models, while furnishing larger biases overall,\nrecover $M$ better than ${\\mathcal{M}_c}$.\n\n(iii) Binary mass-ratio is also best\nrecovered by IMRPhenomD (within $10-15\\%$), with SEOBNRv2\nsystematically \\textit{under}-estimating mass-ratios for binaries with\nanti-aligned spins, and \\textit{over}-estimating for positive-aligned\nspins (by up to $\\pm 20\\%$).\n\n(iv) We test the recovery of the PN effective-spin combination\n$\\chi_\\mathrm{eff}$ that appears at leading-order in inspiral phasing.\nAs with the mass parameters, we find that IMRPhenomD recovers\n$\\chi_\\mathrm{eff}$ best (within $\\pm 0.1$), especially for strongly\nspin-aligned binaries. While SEOBNRv2 shows marginally higher spin\nbiases (up to $\\pm 0.15$) for\nhigh-mass binaries with $M\\gtrsim 100M_\\odot$, both SEOBNRv1 and\nIMRPhenomC models incur higher biases in spin recovery (up to\n$\\pm 0.25$) over different regions of the parameter space.\n\nOverall, we find that both SEOBNRv2 and IMRPhenomD have comparable\naccuracy in terms of parameter recovery, with IMRPhenomD performing\nbetter of the two for binaries with large aligned $\\chi_\\mathrm{eff}$\nand/or high masses.\n\n\nWe note that a recent study~\\cite{Purrer:2015nkh} shows that the biases we\nfind for SEOBNRv2 will become comparable to statistical uncertainty in \nspin recovery only at SNRs $\\approx 20-30$.\nHowever, a more detailed MCMC analysis will be needed to (i) determine\nthe same for highly spinning binaries, where SEOBNRv2 deviates \nsignificantly from NR, and (ii) to understand the impact of the systematic\nbiases for the IMRPhenomD model that we report here, by comparing them\nwith the associated statistical uncertainty in parameter recovery.\n\nWe also recall that the present study applies to high-mass BBHs, with\ntotal-masses $\\gtrsim 50M_\\odot$.  At lower binary masses, the NR\nwaveforms do no longer cover the entire aLIGO frequency band, and one\nneeds either longer NR simulations or one needs to hybridize the\nexisting simulations with PN inspiral waveforms. We also note that we\nplan to follow-up the interesting patterns seen in the\nhigh-spin/high-spin corner of the BBH parameter space in the future in\norder to better understand the accuracy of analytical models there.\n\n\nThe remainder of the paper is organized as follows.\nSec.~\\ref{s1:Methodology} summarizes the salient features of the new\ncatalog of NR simulations used in this analysis, describes different\nmeasures of waveform-model accuracy, and summarizes the different\nwaveform models analyzed in this paper. In Sec.~\\ref{s1:faithfulness}\nwe present overlap comparisons of different waveform models with our\nNR waveforms. In Sec.~\\ref{s1:effectualness} we measure the efficacy\nof different waveform models as detection filters. In\nSec.~\\ref{s1:param_bias} we analyze the systematic biases in the\nrecovery of binary mass and spin parameters, associated with the\ndifferent waveform models we consider in this paper.  Finally, in\nSec.~\\ref{s1:conclusions} we summarize and discuss our results.\n\n\n\n \n\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=\\textwidth,trim=15 17 15 17]{LowestTotalMassOverParameterSpace.pdf}\n\\caption{Parameter space coverage of the simulations considered here. For\nmass-ratio $q=\\{1,2,3\\}$ we indicate the spin-components \n$(\\chi_{1}, \\chi_{2})$\nprojected onto the orbital angular momentum. Each point is color-coded by the \nlowest total mass to which the waveform can be scaled, such that the initial GW\nfrequency remains $\\gtrsim 15$~Hz. In the $q=1$ panel, each simulation is \nplotted twice at $(\\chi_{1}, \\chi_{2})\\rightarrow (\\chi_{2}, \\chi_{1})$ to\nrepresent the symmetry under exchange of the two objects.\n}\n\\label{fig:Min_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\n\n\n\n\\section{Methodology}\\label{s1:Methodology}\n\n\n\n\n\\subsection{Numerical Relativity Simulations}\\label{s2:numrel_simulations}\n\nThe BBH simulations considered here were performed with the Spectral Einstein \nCode (\\texttt{SpEC})~\\cite{SpECwebsite}, and were presented \nin~\\cite{Chu:2015kft}. Initial data is constructed with the pseudo-spectral \nelliptic solver described in~\\cite{Pfeiffer2003}, using the extended conformal \nthin-sandwich method~\\cite{Yo2004} with quasi-equilibrium boundary \nconditions~\\cite{Cook2004}.\nEvolutions use a first-order representation of the generalized harmonic \nsystem~\\cite{Friedrich1985,Garfinkle2002,Pretorius2005c,Lindblom:2007} with \na damped-harmonic gauge~\\cite{Szilagyi:2009qz}. The computational grid is \nadaptively refined~\\cite{Szilagyi:2014fna}, and the excision boundaries \nare dynamically adjusted to follow \nthe apparent horizons~\\cite{Scheel2009,Szilagyi:2009qz,Hemberger:2012jz}. \nInterdomain boundary conditions are enforced with \na penalty method~\\cite{Gottlieb2001,Hesthaven2000}, \nand constraint-preserving outgoing-wave \nconditions~\\cite{Lindblom2006,Rinne2006,Rinne2007} are imposed at the \nouter boundary. \n\n\nOur simulations consist of 84 configurations at mass-ratios \n$q=m_1/m_2=\\{1,2,3\\}$. All simulations are non-precessing, i.e.\nthe dimensionless spin $\\vec\\chi_{1,2}$ of each hole is either aligned or \nanti-aligned with the direction of the orbital angular momentum $\\hat{L}$.\nThe parameters of all simulations are plotted in \nFig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}.\n 22 simulations have only one hole spinning, 32 have both \nholes spinning with equal spin-magnitudes, and the remaining 30 have \nboth holes spinning with unequal spin-magnitudes.\nThe spin components along $\\hat{L}$ range over\n$-0.9 \\leq \\chi_{1,2} \\leq 0.9$. All evolutions have initial orbital \neccentricity $e<10^{-4}$. The evolutions include an average of 24 orbits, \nwith the shortest having 21.5 orbits and the longest having 32 orbits.\nBBH waveforms can be rescaled to any total mass $M=m_1+m_2$.\nFig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z} also indicates the lowest \ntotal mass $M_\\mathrm{low}$ for each configuration, such that the rescaled\nwaveform covers the aLIGO frequency range for $f\\geq f_\\mathrm{low}=15$~Hz.\n\n\n\n\\subsection{Accuracy measures}\\label{s2:accuracy_measures}\n\n\nWe can define an inner product between two waveforms $h_1$ and $h_2$ as\n\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:innerproduct}\n\\langle h_1, h_2\\rangle\\equiv \\int_{f_\\mathrm{low}}^{f_\\mathrm{high}} \\dfrac{\\tilde{h_1}(f)\\,\\tilde{h^*_2}(f)}{\\mathrm{S}_n(|f|)}{\\mathrm{d}} f,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\langle h_{1},h_{2}\\rangle\\equiv\\int_{f_{\\mathrm{low}}}^{f_{\\mathrm{high}}}%&#10;\\dfrac{\\tilde{h_{1}}(f)\\,\\tilde{h^{*}_{2}}(f)}{\\mathrm{S}_{n}(|f|)}{\\mathrm{d}%&#10;}f,\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>h</mi><mn>1</mn></msub><mo>,</mo><msub><mi>h</mi><mn>2</mn></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>≡</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>f</mi><mi>low</mi></msub><msub><mi>f</mi><mi>high</mi></msub></msubsup><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><mover accent=\"true\"><msub><mi>h</mi><mn>1</mn></msub><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>f</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mover accent=\"true\"><msubsup><mi>h</mi><mn>2</mn><mo>*</mo></msubsup><mo stretchy=\"false\">~</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>f</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">S</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mi>f</mi><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>f</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05396.tex", "nexttext": "\nThis overlap measures the correlation between any two given\nwaveforms. We use the overlap to measure the accuracy of analytical\nwaveform families by comparing to NR waveforms with identical physical\nparameters. This assumes that the latter closely reproduce\n\\textit{true} waveforms in nature. The error analysis\nin~\\cite{Chu:2015kft} shows that numerical errors of the NR\nwaveforms cause mismatches $1-{\\cal O}<5\\times 10^{-4}$, with a median\nvalue of $1-{\\cal O}\\sim 3\\times 10^{-4}$.  Therefore, we expect that\noverlaps computed here to be influenced by NR errors only for\n$\\mathcal{O}>0.9995$.\n\n\nGW detection searches use a discrete set of waveforms, called a \n``template bank'', to filter detector data with. This bank spans the range of\nmass and spin parameters considered in the search, and can be visualized as a \nmulti-dimensional lattice. There are two sources of SNR loss from using \ntemplate banks. First, the density of templates in the parameter space. This\nis a free parameter which trades loss of SNR with the number of templates to\nbe searched with. Customarily, a $3\\%$ loss in SNR is viewed as acceptable.\nThe second source of error -- the focus of this paper -- is the accuracy of\nthe underlying analytical waveform family that is used to generate the \ntemplates. The second source is somewhat compensated for by the freedom of \nmaximizing the recovered SNR over intrinsic binary parameters, i.e., it \ndoes not matter \\textit{which} template waveform fits a given signal in a detection\nsearch. To investigate the SNR loss due to the\nsecond factor alone, we compute the \\textit{fitting factors} of different \nwaveform models as follows.\n\nFor each combination $p$ of $(M=m_1+m_2, q=m_1/m_2, \\chi_1, \\chi_2)$ that we\nrescale our NR waveforms to, we sample a set $\\mathcal{S}_p$ of \n$8,000,000$\npoints in the vicinity of the true parameters ($p$) and compute the overlaps\nbetween the NR waveform $h^\\mathrm{NR}(p)$ and $M$odel waveforms \n$h^\\mathrm{M}(i)$ for all points $i\\in\\mathcal{S}_p$. Finally, the \nfitting factor ${\\mathrm{FF}}$ of model $M$ for signal parameters $p$ is given by\n\n\n", "itemtype": "equation", "pos": 21899, "prevtext": "\n\nwhere $\\tilde{h}(f)$ represents the Fourier transform of $h$, ${}^*$ in  \nsuperscript represents complex conjugation, $\\mathrm{S}_n(|f|)$ is the power \nspectral density of detector noise. We integrate the inner product over the \nfrequency interval $[f_\\mathrm{low}, f_\\mathrm{high}]$, which spans the \nsensitive band of GW detector. In this paper we use $f_\\mathrm{low}=15$~Hz,\n$f_\\mathrm{high}=4096$~Hz, and the zero-detuning high-power noise \ncurve~\\cite{Shoemaker2009} to model aLIGO at design sensitivity.\nThis inner product is sensitive to an arbitrary\nphase and time shift between the two waveforms. Since both of these are extrinsic\nparameters and of little astrophysical interest, we maximize the inner product \nover them to define the maximized overlap ${\\mathcal{O}}$, \n\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:overlap}\n{\\mathcal{O}}\\left(h_1,h_2\\right) = \\underset{\\phi_0, t_0}{\\mathrm{max}}\\dfrac{\\langle h_1, h_2\\rangle}{\\sqrt{\\langle h_1, h_1\\rangle\\,\\langle h_2, h_2\\rangle}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\mathcal{O}}\\left(h_{1},h_{2}\\right)=\\underset{\\phi_{0},t_{0}}{\\mathrm{max}}%&#10;\\dfrac{\\langle h_{1},h_{2}\\rangle}{\\sqrt{\\langle h_{1},h_{1}\\rangle\\,\\langle h%&#10;_{2},h_{2}\\rangle}}.\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mo>⁢</mo><mrow><mo>(</mo><msub><mi>h</mi><mn>1</mn></msub><mo>,</mo><msub><mi>h</mi><mn>2</mn></msub><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\underset</mtext></merror><mo>⁢</mo><msub><mi>ϕ</mi><mn>0</mn></msub></mrow><mo>,</mo><mrow><msub><mi>t</mi><mn>0</mn></msub><mo>⁢</mo><mi>max</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>h</mi><mn>1</mn></msub><mo>,</mo><msub><mi>h</mi><mn>2</mn></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><msqrt><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>h</mi><mn>1</mn></msub><mo>,</mo><msub><mi>h</mi><mn>1</mn></msub><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>h</mi><mn>2</mn></msub><mo>,</mo><msub><mi>h</mi><mn>2</mn></msub><mo stretchy=\"false\">⟩</mo></mrow></mrow></msqrt></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05396.tex", "nexttext": "\n\n${\\mathrm{FF}}$ is therefore the maximum fraction of the optimal SNR that a waveform model\ncan recover for a GW signal with parameters $p$. The deviation of fitting factor\nfrom unity quantifies loss in SNR due model inaccuracy alone, and is in \naddition to any loss incurred due to the discreteness of the actual template \nbank used in a GW search.\n\n\n\n\\subsection{Waveform Models}\\label{s2:waveform_models}\n\n\n\\begin{figure*}\n\\includegraphics[width=.5\\columnwidth]{SEOBNRv1_FittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{SEOBNRv2_DynamicsFittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{IMRPhenomC_FittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{IMRPhenomD_FittingParams.pdf}\\\\\n\\caption{Parameters of numerical-relativity simulations used to calibrate\nthe various inspiral-merger-ringdown models that we investigate in this \npaper, i.e. (left to right) SEOBNRv1, SEOBNRv2, IMRPhenomC and IMRPhenomD.\n\\label{fig:NRParams_IMR}\n}\n\\end{figure*}\n\nIn this paper we investigate the following waveform models for aligned-spin\nbinary black holes.\n\n\n\\subsubsection{Effective-One-Body}\n\n\n\nBuonanno and Damour~\\cite{Buonanno99} developed an effective-one-body (EOB)\napproach to the two-body problem in general relativity. Over the past decade\nparameterized EOB models capable of describing the complete binary coalescence\nprocess have been developed and calibrated using information \nfrom NR simulations~\\cite{Buonanno99,Damour03,Damour2007,Damour2007a,DN2007b,\nDamour:2007cb,Buonanno2007,DN2008,Buonanno:2009qa,Pan:2009wj,Buonanno:2009qa,\nBarausse:2011dq,PanEtAl:2011,Taracchini:2012,Taracchini:2013rva,Damour:2013tla,\nDamour:2014sva,Damour:2014sva}.\nIn the spin EOB framework, the dynamics of two compact objects of masses $m_1$\nand $m_2$ and spins $\\vec{\\chi}_1$ and $\\vec{\\chi}_2$ is mapped onto the\ndynamics of an effective particle of mass $\\mu=m_1m_2/(m_1+m_2)$ and spin\n$\\vec{\\chi}_*$ moving in a deformed-Kerr background with mass $M=m_1+m_2$\nand spin $\\vec{\\chi}_\\mathrm{Kerr}$. The parameterized spin mapping \n$\\{\\vec{\\chi}_1,\\vec{\\chi}_2\\}\\rightarrow \\vec{\\chi}_*$ and the deformation of \nthe background from Kerr is chosen to ensure that the inspiral dynamics of the \ntest particle reproduce the PN-expanded dynamics of the original two-body\nsystem. Free parameters are introduced into the models that represent unknown,\nhigher-order PN terms, or additional physical effects like corrections due to\nnon-circularity. Such free parameters are calibrated with NR simulations.\nWith the EOB system specified, a Hamiltonian $H_\\mathrm{EOB}$\nto describe its conservative dynamics can be written~\\cite{Taracchini:2012,\nTaracchini:2013rva}. The non-conservative dynamics is contained in a \nparameterized radiation-reaction term that is inserted in the equations of \nmotion. This term sums over the outgoing GW modes and is\ncalibrated to reproduce NR simulations. The combination of these two \npieces describe the binary inspiral through to merger, at which point \na ringdown waveform is stitched on to the inspiral-merger \nwaveform. This BH ringdown waveform is constructed as a linear superposition \nof the dominant quasi-normal modes (QNMs) of the Kerr BH formed at\nmerger~\\cite{Berti2009,Buonanno:2009qa}, with amplitude and phase of each\nQNM mode determined by the stitching process.\n\nIn this paper we focus on two aligned-spin EOB models which are \ncalibrated to NR and used in contemporary LIGO data analyses: SEOBNRv1 and \nSEOBNRv2~\\citep{Taracchini:2012,Taracchini:2013rva}. The SEOBNRv1 model has\nbeen calibrated to five non-spinning simulations with $q=m_1/m_2=\\{1,2,3,4,6\\}$\nand two equal-mass equal-spin simulations~\\cite{Taracchini:2012}. It models binaries\nwith non-precessing BH spins in the range $-1\\leq\\chi_{1,2}\\leq +0.6$.\nThe improved SEOBNRv2 model has been calibrated to\na significantly larger set of NR simulations, including eight non-spinning\nsimulations with $q\\leq 8$ and $30$ spinning, non-precessing \nsimulations~\\cite{Taracchini:2013rva}. This model is capable of modeling\nbinaries with non-precessing component spins over the range \n$-1\\leq\\chi_{1,2}\\leq +1$.\n\nWe refer the reader to~\\citep{Taracchini:2012,Taracchini:2013rva} for a \ncomprehensive summary of the technical details of these two models. \nWe note that due to the high computational cost of evaluating these models,\nboth current LIGO searches and we use a reduced-order model of\nSEOBNRv2~\\cite{Purrer:2015tud} for search templates.\n\n\n\n\\subsubsection{Phenomenological}\n\nOffline GW searches and parameter estimation efforts aimed at \nbinary black holes involve filtering the detector data with modeled waveforms\nin the \\textit{frequency} domain. One way to minimize their computational \ncost is to use frequency-domain closed-form\nGW models as search filters. Past LIGO-Virgo searches\nused the TaylorF2 model (see, e.g.~\\cite{Colaboration:2011np}), although\nwith the significant limitation that TaylorF2 describes only the inspiral\nphase.\n\nA phenomenological model (IMRPhenomC) based on it has been developed to also\ncapture the plunge and \nmerger phase waveforms~\\cite{Santamaria:2010yb}. This model uses TaylorF2\nphasing and amplitude prescriptions during the early inspiral, and stitches\non an analytic ansatz for GW phasing and amplitude during \nthe late-inspiral, plunge and merger phases. These ans\\\"{a}tze are written as\npolynomials in $f^{1/3}$, where $f$ is the instantaneous gravitational-wave\nfrequency, and the associated coefficients are treated as free parameters.\n\nIn the ringdown regime, IMRPhenomC models binary phasing as a linear function\nin $f$, capturing the effect of the leading QNM with a Lorentzian.\n\nThe model is calibrated to reproduce accurate NR waveforms\nfor non-precessing binaries with mass-ratios $q\\leq 4$ and BH spins\nbetween $[-0.75, +0.83]$, produced by different groups~\\cite{Bruegmann2006,\nHusa-Hannam-etal:2007,Pollney-Reisswig:2007,Pollney:2009yz,Scheel2006}.\n\nThe free parameters are interpolated over the binary mass and spin \nparameter space as polynomials in the symmetric mass-ratio $\\eta$ and\nmass-weighted spin $\\chi_\\mathrm{mw}$,\n\n", "itemtype": "equation", "pos": 24215, "prevtext": "\nThis overlap measures the correlation between any two given\nwaveforms. We use the overlap to measure the accuracy of analytical\nwaveform families by comparing to NR waveforms with identical physical\nparameters. This assumes that the latter closely reproduce\n\\textit{true} waveforms in nature. The error analysis\nin~\\cite{Chu:2015kft} shows that numerical errors of the NR\nwaveforms cause mismatches $1-{\\cal O}<5\\times 10^{-4}$, with a median\nvalue of $1-{\\cal O}\\sim 3\\times 10^{-4}$.  Therefore, we expect that\noverlaps computed here to be influenced by NR errors only for\n$\\mathcal{O}>0.9995$.\n\n\nGW detection searches use a discrete set of waveforms, called a \n``template bank'', to filter detector data with. This bank spans the range of\nmass and spin parameters considered in the search, and can be visualized as a \nmulti-dimensional lattice. There are two sources of SNR loss from using \ntemplate banks. First, the density of templates in the parameter space. This\nis a free parameter which trades loss of SNR with the number of templates to\nbe searched with. Customarily, a $3\\%$ loss in SNR is viewed as acceptable.\nThe second source of error -- the focus of this paper -- is the accuracy of\nthe underlying analytical waveform family that is used to generate the \ntemplates. The second source is somewhat compensated for by the freedom of \nmaximizing the recovered SNR over intrinsic binary parameters, i.e., it \ndoes not matter \\textit{which} template waveform fits a given signal in a detection\nsearch. To investigate the SNR loss due to the\nsecond factor alone, we compute the \\textit{fitting factors} of different \nwaveform models as follows.\n\nFor each combination $p$ of $(M=m_1+m_2, q=m_1/m_2, \\chi_1, \\chi_2)$ that we\nrescale our NR waveforms to, we sample a set $\\mathcal{S}_p$ of \n$8,000,000$\npoints in the vicinity of the true parameters ($p$) and compute the overlaps\nbetween the NR waveform $h^\\mathrm{NR}(p)$ and $M$odel waveforms \n$h^\\mathrm{M}(i)$ for all points $i\\in\\mathcal{S}_p$. Finally, the \nfitting factor ${\\mathrm{FF}}$ of model $M$ for signal parameters $p$ is given by\n\n\n", "index": 5, "text": "\\begin{equation}\\label{eq:fittingfactor}\n{\\mathrm{FF}}^\\mathrm{M}(p)=\\underset{i\\,\\in\\,\\mathcal{S}_p}{\\mathrm{max}}\\,{\\mathcal{O}}\\left(h^\\mathrm{NR}(p), h^\\mathrm{M}(i)\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\mathrm{FF}}^{\\mathrm{M}}(p)=\\underset{i\\,\\in\\,\\mathcal{S}_{p}}{\\mathrm{max}}%&#10;\\,{\\mathcal{O}}\\left(h^{\\mathrm{NR}}(p),h^{\\mathrm{M}}(i)\\right).\" display=\"block\"><mrow><mrow><mrow><msup><mi>FF</mi><mi mathvariant=\"normal\">M</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\underset</mtext></merror><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>i</mi></mpadded></mrow><mo rspace=\"4.2pt\">∈</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mi>p</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>max</mi></mpadded><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>h</mi><mi>NR</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mrow><msup><mi>h</mi><mi mathvariant=\"normal\">M</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05396.tex", "nexttext": "\nto obtain IMRPhenomC inspiral-merger-ringdown waveforms at arbitrary binary \nmasses and spins.\n\nWe refer the reader to Ref.~\\cite{Santamaria:2010yb} for a complete \ndescription of this model.\n\nThe very recent IMRPhenomD model~\\cite{Khan:2015jqa} improves upon IMRPhenomC in\nseveral crucial aspects: (i) use of both \ncomponent spins to model the inspiral phasing, (ii) use of the \nspin parameter $\\chi_\\mathrm{eff}$~\\cite{Ajith:2011ec},\n\n", "itemtype": "equation", "pos": 30501, "prevtext": "\n\n${\\mathrm{FF}}$ is therefore the maximum fraction of the optimal SNR that a waveform model\ncan recover for a GW signal with parameters $p$. The deviation of fitting factor\nfrom unity quantifies loss in SNR due model inaccuracy alone, and is in \naddition to any loss incurred due to the discreteness of the actual template \nbank used in a GW search.\n\n\n\n\\subsection{Waveform Models}\\label{s2:waveform_models}\n\n\n\\begin{figure*}\n\\includegraphics[width=.5\\columnwidth]{SEOBNRv1_FittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{SEOBNRv2_DynamicsFittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{IMRPhenomC_FittingParams.pdf}\n\\includegraphics[width=.5\\columnwidth]{IMRPhenomD_FittingParams.pdf}\\\\\n\\caption{Parameters of numerical-relativity simulations used to calibrate\nthe various inspiral-merger-ringdown models that we investigate in this \npaper, i.e. (left to right) SEOBNRv1, SEOBNRv2, IMRPhenomC and IMRPhenomD.\n\\label{fig:NRParams_IMR}\n}\n\\end{figure*}\n\nIn this paper we investigate the following waveform models for aligned-spin\nbinary black holes.\n\n\n\\subsubsection{Effective-One-Body}\n\n\n\nBuonanno and Damour~\\cite{Buonanno99} developed an effective-one-body (EOB)\napproach to the two-body problem in general relativity. Over the past decade\nparameterized EOB models capable of describing the complete binary coalescence\nprocess have been developed and calibrated using information \nfrom NR simulations~\\cite{Buonanno99,Damour03,Damour2007,Damour2007a,DN2007b,\nDamour:2007cb,Buonanno2007,DN2008,Buonanno:2009qa,Pan:2009wj,Buonanno:2009qa,\nBarausse:2011dq,PanEtAl:2011,Taracchini:2012,Taracchini:2013rva,Damour:2013tla,\nDamour:2014sva,Damour:2014sva}.\nIn the spin EOB framework, the dynamics of two compact objects of masses $m_1$\nand $m_2$ and spins $\\vec{\\chi}_1$ and $\\vec{\\chi}_2$ is mapped onto the\ndynamics of an effective particle of mass $\\mu=m_1m_2/(m_1+m_2)$ and spin\n$\\vec{\\chi}_*$ moving in a deformed-Kerr background with mass $M=m_1+m_2$\nand spin $\\vec{\\chi}_\\mathrm{Kerr}$. The parameterized spin mapping \n$\\{\\vec{\\chi}_1,\\vec{\\chi}_2\\}\\rightarrow \\vec{\\chi}_*$ and the deformation of \nthe background from Kerr is chosen to ensure that the inspiral dynamics of the \ntest particle reproduce the PN-expanded dynamics of the original two-body\nsystem. Free parameters are introduced into the models that represent unknown,\nhigher-order PN terms, or additional physical effects like corrections due to\nnon-circularity. Such free parameters are calibrated with NR simulations.\nWith the EOB system specified, a Hamiltonian $H_\\mathrm{EOB}$\nto describe its conservative dynamics can be written~\\cite{Taracchini:2012,\nTaracchini:2013rva}. The non-conservative dynamics is contained in a \nparameterized radiation-reaction term that is inserted in the equations of \nmotion. This term sums over the outgoing GW modes and is\ncalibrated to reproduce NR simulations. The combination of these two \npieces describe the binary inspiral through to merger, at which point \na ringdown waveform is stitched on to the inspiral-merger \nwaveform. This BH ringdown waveform is constructed as a linear superposition \nof the dominant quasi-normal modes (QNMs) of the Kerr BH formed at\nmerger~\\cite{Berti2009,Buonanno:2009qa}, with amplitude and phase of each\nQNM mode determined by the stitching process.\n\nIn this paper we focus on two aligned-spin EOB models which are \ncalibrated to NR and used in contemporary LIGO data analyses: SEOBNRv1 and \nSEOBNRv2~\\citep{Taracchini:2012,Taracchini:2013rva}. The SEOBNRv1 model has\nbeen calibrated to five non-spinning simulations with $q=m_1/m_2=\\{1,2,3,4,6\\}$\nand two equal-mass equal-spin simulations~\\cite{Taracchini:2012}. It models binaries\nwith non-precessing BH spins in the range $-1\\leq\\chi_{1,2}\\leq +0.6$.\nThe improved SEOBNRv2 model has been calibrated to\na significantly larger set of NR simulations, including eight non-spinning\nsimulations with $q\\leq 8$ and $30$ spinning, non-precessing \nsimulations~\\cite{Taracchini:2013rva}. This model is capable of modeling\nbinaries with non-precessing component spins over the range \n$-1\\leq\\chi_{1,2}\\leq +1$.\n\nWe refer the reader to~\\citep{Taracchini:2012,Taracchini:2013rva} for a \ncomprehensive summary of the technical details of these two models. \nWe note that due to the high computational cost of evaluating these models,\nboth current LIGO searches and we use a reduced-order model of\nSEOBNRv2~\\cite{Purrer:2015tud} for search templates.\n\n\n\n\\subsubsection{Phenomenological}\n\nOffline GW searches and parameter estimation efforts aimed at \nbinary black holes involve filtering the detector data with modeled waveforms\nin the \\textit{frequency} domain. One way to minimize their computational \ncost is to use frequency-domain closed-form\nGW models as search filters. Past LIGO-Virgo searches\nused the TaylorF2 model (see, e.g.~\\cite{Colaboration:2011np}), although\nwith the significant limitation that TaylorF2 describes only the inspiral\nphase.\n\nA phenomenological model (IMRPhenomC) based on it has been developed to also\ncapture the plunge and \nmerger phase waveforms~\\cite{Santamaria:2010yb}. This model uses TaylorF2\nphasing and amplitude prescriptions during the early inspiral, and stitches\non an analytic ansatz for GW phasing and amplitude during \nthe late-inspiral, plunge and merger phases. These ans\\\"{a}tze are written as\npolynomials in $f^{1/3}$, where $f$ is the instantaneous gravitational-wave\nfrequency, and the associated coefficients are treated as free parameters.\n\nIn the ringdown regime, IMRPhenomC models binary phasing as a linear function\nin $f$, capturing the effect of the leading QNM with a Lorentzian.\n\nThe model is calibrated to reproduce accurate NR waveforms\nfor non-precessing binaries with mass-ratios $q\\leq 4$ and BH spins\nbetween $[-0.75, +0.83]$, produced by different groups~\\cite{Bruegmann2006,\nHusa-Hannam-etal:2007,Pollney-Reisswig:2007,Pollney:2009yz,Scheel2006}.\n\nThe free parameters are interpolated over the binary mass and spin \nparameter space as polynomials in the symmetric mass-ratio $\\eta$ and\nmass-weighted spin $\\chi_\\mathrm{mw}$,\n\n", "index": 7, "text": "\\begin{equation}\\label{eq:chimw}\n\\chi_\\mathrm{mw} {\\mathrel{\\vcenter{\\baselineskip0.5ex \\lineskiplimit0pt                      \\hbox{\\scriptsize.}\\hbox{\\scriptsize.}}}                      =} \\frac{m_1}{m_1+m_2}\\chi_{1} + \\frac{m_2}{m_1+m_2}\\chi_{2}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\chi_{\\mathrm{mw}}{\\mathrel{\\vbox{\\hbox{\\scriptsize.}\\hbox{\\scriptsize.}}}=}%&#10;\\frac{m_{1}}{m_{1}+m_{2}}\\chi_{1}+\\frac{m_{2}}{m_{1}+m_{2}}\\chi_{2},\" display=\"block\"><mrow><msub><mi>χ</mi><mi>mw</mi></msub><mtext>\n<span xmlns=\"http://www.w3.org/1999/xhtml\" class=\"ltx_inline-block ltx_align_bottom\">\n<span class=\"ltx_p\"><span class=\"ltx_text\" style=\"font-size:70%;\">.</span></span>\n<span class=\"ltx_p\"><span class=\"ltx_text\" style=\"font-size:70%;\">.</span></span>\n</span></mtext><mo>=</mo><mfrac><msub><mi>m</mi><mn>1</mn></msub><mrow><msub><mi>m</mi><mn>1</mn></msub><mo>+</mo><msub><mi>m</mi><mn>2</mn></msub></mrow></mfrac><msub><mi>χ</mi><mn>1</mn></msub><mo>+</mo><mfrac><msub><mi>m</mi><mn>2</mn></msub><mrow><msub><mi>m</mi><mn>1</mn></msub><mo>+</mo><msub><mi>m</mi><mn>2</mn></msub></mrow></mfrac><msub><mi>χ</mi><mn>2</mn></msub><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05396.tex", "nexttext": "\n(with symmetric mass-ratio $\\eta=m_1 m_2/(m_1+m_2)^2$), to capture the late-inspiral/plunge\nphase, (iii) use of (uncalibrated) EOB+NR hybrid waveforms to constrain \nfree parameters, and (iv) use of several high mass-ratio NR simulations to extend \nthe range of validity of the model. The simulations used to calibrate \nIMRPhenomD sample component spins more densely than the set used for \nIMRPhenomC, and cover mass-ratios up to $q=18$. We refer the reader to\nRef.~\\cite{Khan:2015jqa,Husa:2015iqa} for further details of IMRPhenomD.\n\n\n\n\n\n\n\n\\section{Faithfulness Analysis}\\label{s1:faithfulness}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=2\\columnwidth]{Faithfulness_TotalMass_Spin1z_Spin2z_SEOBNR_q123.pdf}\n\\caption{Unfaithfulness between SEOBNR and NR waveforms as a \nfunction of mass-ratio $q=m_1/m_2$, component spins $\\chi_{1}, \\chi_{2}$, and\ntotal mass $M$. SEOBNRv1 (top panel) reproduces NR well when the spin on the \nbigger BH does not exceed $+0.5$, with inaccuracies increasing with mass-ratio.\nSEOBNRv2 (bottom panel) significantly improves over SEOBNRv1 with overlaps \nagainst NR higher than $98\\%$ over most of the parameter space considered. \nHowever, when spins on both component BHs are large and positive-aligned, \nSEOBNRv2 fails to produce accurate waveforms ($\\mathcal{O}\\simeq 0.80$). We \nnote that both models are accurate within their respective calibration range, \nbut become inaccurate outside this range. Therefore it is crucial to test \nwaveform models before using them in aLIGO analyses.\n}\n\\label{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=1.05\\columnwidth, trim={{0.05\\columnwidth} 0 0 0}]{ExactParameters_LFAligned_q2-0_sA0-85_sB0-85.pdf}\\\\\n\\includegraphics[width=1.05\\columnwidth, trim={{0.05\\columnwidth} 0 0 0}]{ExactParameters_LFAligned_q3-0_S0-85_S0-85.pdf}\n\\caption{SEOBNRv2 and NR waveforms for the problematic cases identified in the\nhigh spin corner of Fig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z}.\nTop: $q=2,\\,\\chi_1=\\chi_2=+0.85$. Bottom: $q=3,\\,\\chi_1=\\chi_2=+0.85$. \nWaveforms are aligned during their first few inspiral cycles.\n}\n\\label{fig:SEOBv2_unfaith_q23s85s85cases}\n\\end{figure}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=2\\columnwidth]{Faithfulness_TotalMass_Spin1z_Spin2z_IMRPhenomCD_q123.pdf}\n\\caption{This figure is similar to\nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} with the difference\nthat the models considered here are IMRPhenomC and IMRPhenomD (top and\nbottom panels, respectively). We note that both of the phenomenological\nmodels have been calibrated over most of the mass-ratio and spin range probed here.\nWhile IMRPhenomC shows significant deviation from NR as soon as we increase\nthe mass-ratio above $q=1$, and/or spin magnitudes above $\\approx 0.5$,\nwe find that IMRPhenomD reproduces NR remarkably well with\noverlaps above $99\\%$ everywhere (above $99.5\\%$ over most of the space).\n}\n\\label{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure*}[h]\n\\centering\n\\includegraphics[width=2\\columnwidth]{snrEffective_TotalMass_Spin1z_Spin2z_IMR_q123.pdf}\n\\caption{We show the effective SNR level at which the SEOBNRv2 and IMRPhenomD\nmodels become distinguishable from NR waveforms with the Advanced LIGO\ninstruments. Here we use the indistinguishability criterion proposed in \nRef.~\\cite{Lindblom2008}.\n}\n\\label{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\n\nWe now proceed to a comparison of the NR waveforms introduced in \nSec.~\\ref{s2:numrel_simulations} with the analytical waveform models introduced\nin Sec.~\\ref{s2:waveform_models}, beginning with an analysis of their\nfaithfulness (c.f. Eq.~\\ref{eq:overlap}).\nWe rescale the NR waveforms to\na range of total masses, and compute overlaps with model waveforms with \nidentical BH parameters. These overlaps are maximized over \nthe extrinsic parameters however, i.e. over the time and phase at coalescence.\nThey measure the accuracy of the models\nat specific points in the parameter space $(m_1,m_2,\\chi_{1},\\chi_{2})$.\n\nIn Fig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} we show the \nunfaithfulness (i.e. $1-\\mathcal{O}$) of the two EOB models, SEOBNRv1 and\nSEOBNRv2. In each row, the three\npanels correspond to mass ratios $q=\\{1,2,3\\}$. In each panel, the three axes \ncorrespond to component spins and total mass with the color showing the \nunfaithfulness. \n\nNote that the total-masses probed are restricted to $M\\gtrsim 50M_\\odot$\n(c.f. Fig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}).\n\nFor SEOBNRv1, we find that its unfaithfulness increases with binary mass-ratio as\nwell as with the more massive component's spin, with little dependence on\nthe binary's total mass. From the top left panel in \nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} we note that for the \nsmallest mass-ratio, $q=1$, SEOBNRv1 reproduces the NR waveforms well with \nunfaithfulness below $0.5\\%$ over most of the spin parameter space, except\nwhen the spins on both holes are close to the maximum value that the model\nsupports (i.e. $+0.6$), where its unfaithfulness rises above $2\\%$. As we increase \nthe mass-ratio to $q=2$ (top middle panel of the same figure) SEOBNRv1's \nfaithfulness further drops below $95\\%$ in the high-aligned-spin region. \nFurthermore, we also find that the unfaithfulness of the model reaches $1-2\\%$ \nwhen the smaller hole carries large anti-aligned spin. Further increasing the \nmass-ratio to $q=3$ increases the differences of the model with NR further,\nwith overlaps\nfalling below $90\\%$ when the larger black hole's spin $\\rightarrow +0.6$.\nOverall, we find that the model performs better when the more massive hole\nhas anti-aligned spins rather than aligned.\n\nTurning to the SEOBNRv2 model, we find that it significantly improves over\nSEOBNRv1: for equal-mass binaries, we find from the bottom left panel of\nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} that the unfaithfulness of\nSEOBNRv2 is generally better than $1\\%$ except for mixed aligned/anti-aligned\nspin directions of large spin-magnitudes, where its unfaithfulness reaches $3\\%$.\nFor higher mass-ratios $q=\\{2,3\\}$, the slight increase of unfaithfulness \ntowards the aligned/anti-aligned spin corner persists. For instance, \n$1-\\mathcal{O}\\simeq 0.97$ for $q=2, \\chi_{1}=-0.85, \\chi_{2}=+0.85$.\nHowever, the most significant deviation between SEOBNRv2 and NR occurs for both\nspins aligned with large magnitudes. For $\\chi_{1}=\\chi_{2}=+0.85$, the\nunfaithfulness rises above $10\\%$ for mass-ratios $q=\\{2,3\\}$.\n\nWe explore these differences between SEOBNRv2 and NR further.\nIn Fig.~\\ref{fig:SEOBv2_unfaith_q23s85s85cases}, we compare the model and NR \nwaveforms for $q=\\{2,3\\},\\,\\chi_1=\\chi_2=+0.85$. In both panels, the waveform\npairs are aligned near the start of the NR waveform. We find that \nthe SEOBNRv2 phase evolution agrees with NR during most of the inspiral phase, \nbut its frequency rises faster during the plunge phase than found with NR,\nresulting in an artificially accelerated merger. This evidence hints that the\ncalibration of \nthe merger portion and ringdown attachment of SEOBNRv2 will need further tuning.\n\n\nWe now turn our attention to the phenomenological models IMRPhenomC/D. \nThe unfaithfulness of IMRPhenomC and IMRPhenomD with respect to NR, shown in\nFig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}, displays patterns\ndistinct from the SEOBNR models. \n\nWe find that IMRPhenomC shows poorer agreement with NR than either of the\nSEOBNR models, with unfaithfulness \\textit{increasing} rapidly with \n\\textit{mass-ratio}, \\textit{spin magnitudes}, and with \n\\textit{decreasing binary masses}.\n\nThe top panels of Fig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}\nshow that this disagreement rises to $10-15\\%$ unfaithfulness, especially\nas the spin magnitude of the smaller BH grows.\nwe notice disagreement between PhenomC and NR for large anti-aligned spins, \nwhich increases to $10-15\\%$ unfaithfulness over most of the spin parameter \nspace as we go from $q=1$ to $q=\\{2,3\\}$. This disagreement increases, also,\nas more of the NR waveform is integrated over, i.e. at lower masses.\n\nIn stark contrast, the newest model considered, IMRPhenomD, shows better \nagreement with NR than either of the SEOBNR models, with faithfulness above\n$99\\%$ over most of the analyzed parameter space, as seen in the bottom \npanels of Fig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}. The only \nregion where we see somewhat smaller overlaps is for $q\\ne 1$ mixed-aligned \nspins with large positive spin on the larger hole.\n\nWe conclude that both SEOBNRv2 and IMRPhenomD models describe well binaries \nwith \\textit{low to moderate spins}, and even \\textit{high anti-aligned spins},\nwith the latter also representing well \\textit{high aligned spins} binaries.\nThe accuracy of both degrades somewhat with increasing mass-ratio in the  \nhigh aligned/aligned spin and high aligned/anti-aligned spin corners of the \nparameter space respectively. We also find that both of\nthese models outperform their earlier counterparts significantly.\n\n\nFurther, we ask the question: how loud does a GW signal have to be for modeling\nerrors to degrade scientific conclusions derived from it.\nTo answer that, we use the \nsufficient criterion $(\\delta h|\\delta h)< 1$, where \n$\\delta h=h^\\mathrm{true}-h^\\mathrm{modeled}$, to calculate the SNR threshold\n$\\rho_\\mathrm{eff}$\nbelow which the true and modeled waveforms will not be distinguishable by \naLIGO~\\cite{Lindblom2008}, i.e.\n\n\n", "itemtype": "equation", "pos": 31204, "prevtext": "\nto obtain IMRPhenomC inspiral-merger-ringdown waveforms at arbitrary binary \nmasses and spins.\n\nWe refer the reader to Ref.~\\cite{Santamaria:2010yb} for a complete \ndescription of this model.\n\nThe very recent IMRPhenomD model~\\cite{Khan:2015jqa} improves upon IMRPhenomC in\nseveral crucial aspects: (i) use of both \ncomponent spins to model the inspiral phasing, (ii) use of the \nspin parameter $\\chi_\\mathrm{eff}$~\\cite{Ajith:2011ec},\n\n", "index": 9, "text": "\\begin{equation}\\label{eq:chieff}\n \\chi_\\mathrm{eff}{\\mathrel{\\vcenter{\\baselineskip0.5ex \\lineskiplimit0pt                      \\hbox{\\scriptsize.}\\hbox{\\scriptsize.}}}                      =} \\chi_\\mathrm{mw} - \\frac{38\\eta}{113}(\\chi_{1}+\\chi_{2})\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\chi_{\\mathrm{eff}}{\\mathrel{\\vbox{\\hbox{\\scriptsize.}\\hbox{\\scriptsize.}}}=}%&#10;\\chi_{\\mathrm{mw}}-\\frac{38\\eta}{113}(\\chi_{1}+\\chi_{2})\" display=\"block\"><mrow><msub><mi>χ</mi><mi>eff</mi></msub><mtext>\n<span xmlns=\"http://www.w3.org/1999/xhtml\" class=\"ltx_inline-block ltx_align_bottom\">\n<span class=\"ltx_p\"><span class=\"ltx_text\" style=\"font-size:70%;\">.</span></span>\n<span class=\"ltx_p\"><span class=\"ltx_text\" style=\"font-size:70%;\">.</span></span>\n</span></mtext><mo>=</mo><msub><mi>χ</mi><mi>mw</mi></msub><mo>-</mo><mfrac><mrow><mn>38</mn><mo>⁢</mo><mi>η</mi></mrow><mn>113</mn></mfrac><mrow><mo stretchy=\"false\">(</mo><msub><mi>χ</mi><mn>1</mn></msub><mo>+</mo><msub><mi>χ</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05396.tex", "nexttext": "\n\n$\\rho_\\mathrm{eff}$ is the threshold value of the GW SNR, such that for \n$\\rho\\leq\\rho_\\mathrm{eff}$ the statistical errors in mass and spin estimation\nwill\ndominate over any systematic biases due to model inaccuracies, and therefore\nour scientific conclusions will not be degraded by model choice. \nThe condition $\\rho\\leq \\rho_\\mathrm{eff}$ is necessary, but not sufficient, i.e.  it is not necessarily true that\nfor all $\\rho\\ge\\rho_\\mathrm{eff}$ modeling inaccuracies will actually \ndominate~\\cite{Lindblom2008}. With this caveat, we show in \nFig.~\\ref{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z} the SNR threshold \n$\\rho_\\mathrm{eff}$\nfor the SEOBNRv2 and IMRPhenomD models, as a \nfunction of binary mass-ratio, total mass, and component spins.\n\nFrom the top row of the figure, we find that SEOBNRv2 is sufficiently \naccurate for all aLIGO measurement purposes when concerned with moderately\nspinning binaries at SNRs up to $\\approx 15-20$. However, (i) for \nequal-mass binaries with \\textit{large mixed-aligned} spins, and (ii) for \nunequal-mass binaries with \\textit{large aligned} spins, using SEOBNRv2 \nwaveforms may lead to loss in information at fairly low aLIGO SNRs.\n\nTurning to IMRPhenomD (lower panels of\n  Fig.~\\ref{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z}), we observe that\n  this model is particularly accurate for equal-mass and/or equal-spin\n  binaries and will be indistinguishable from NR for SNRs\n  up to $\\approx 30$, possibly even higher\\footnote{ The agreement between IMRPhenomD and the NR waveforms is so good, that NR error estimates are of comparable order.}. The SNR-threshold falls to $\\approx 15$ for\n  unequal-mass unequal-spin systems. Overall, we find that IMRPhenomD\n  is best suited for aLIGO parameter estimation efforts aimed at\n  comparable mass-ratio aligned-spin binaries of high total mass\n  ($M\\geq M_\\mathrm{min}\\gtrsim 50M_\\odot$).\n\n\n\n\n\n\n\n\\section{Effectualness}\\label{s1:effectualness}\n\n\n\n\\begin{figure*}\n\\centering    \n\\includegraphics[width=1.9\\columnwidth]{FF_TotalMass_Spin1z_Spin2z_q123_IMR.pdf}\n\\caption{\nEffectualness of the four waveform models considered. Plotted is the \nfractional loss in recovered SNR. Rows correspond to different models,\nand within each row, the data is plotting as a function of mass-ratio $q$,\nBH spins $\\chi_1, \\chi_2$, and total-mass $M$.\nThe black crosses denote the values of component spins in the $x-y$ plane.\nWe note that SEOBNRv1 does not model binaries with component spins higher \nthan $+0.6$. We find that the SEOBNRv2 and IMRPhenomD models \nsupersede their earlier counterparts, SEOBNRv1 and IMRPhenomC, respectively,\nwith FFs over $99.5\\%$ over most of the spin and mass parameter space \nprobed. However, we do find that for binaries high spins on both BHs, \nIMRPhenomD clearly out-performs all others with FFs $>99.5\\%$, while\nSEOBNRv2's FFs against NR deteriorate to $97\\%$.\n}\n\\label{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}\n\\end{figure*}\n\n\n\nMatched-filtering based GW searches use modeled waveforms as waveforms to \nfilter detector data and recover signals that are otherwise buried in instrument\nnoise. In such a search, the recovered SNR for a given signal is optimized over a discrete grid\nof binary mass and spin parameters that describe the waveforms, and is \nthe highest when the filter waveform matches the signal exactly.\nIn any real search, some fraction of the optimal SNR\nis lost due to two reasons: (i) the discreteness of the set of filter waveforms, \nand (ii) inaccuracies in the modeled waveforms.\n\nIn this section we investigate the second factor for different waveform models\nfrom the perspective of aLIGO detection searches, focusing on non-precessing \nBBHs. We use an over-dense sampling of the waveform parameter space \nto mitigate any SNR losses due to reason (i). \nFor each analytical waveform family, we compute\noverlaps between waveforms at all of the sampled points and with\neach of our NR waveforms. For each NR waveform, the highest overlap \nyields the fraction of optimal SNR recoverable by each waveform models.\n\n\nThis calculation involves a maximization over physical parameters of the \nmodel waveforms, and is therefore computationally more expensive than the \nfaithfulness comparisons, of Sec.~\\ref{s1:faithfulness}.\nThe results of this effectualness study are summarized in \nFig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}. This figure\nshows the ineffectualness\n$\\mathcal{M}\\defeq1-{\\mathrm{FF}}$ (c.f. Eq.~\\ref{eq:fittingfactor}) of all IMR\nmodels considered here. From top to bottom, \ndifferent rows correspond to SEOBNRv1, SEOBNRv2, IMRPhenomC and \nIMRPhenomD, respectively. In each row, different panels correspond\nto different mass-ratios, and each panel spans the $3-$D subspace of binary\ntotal mass + component spins.\n\nFrom the top row, we immediately notice that even though SEOBNRv1 has support \nonly for binaries with $\\chi_{1,2}\\leq +0.6$, it recovers $\\geq 99.5\\%$\nof the optimal SNR for most of the parameter space where \\textit{either}\n$\\chi_1\\geq +0.6$ \\textit{or} $\\chi_2\\geq +0.6$. However, when both spins are large\nand aligned, its SNR recovery deteriorate to $93-95\\%$.\n\nFrom the second row we notice that SEOBNRv2 performs significantly better with\n$\\mathcal{E}^\\mathrm{SEOBNRv2}\\geq 99.5\\%$\nover most of the parameter space for\nall mass-ratios considered. The recovered SNR by SEOBNRv2 drops, however, \nwhen both holes have large aligned spins. For $\\chi_1=\\chi_2=+0.85$, only \n$97\\%$\nof optimal SNR are recovered, with worse performance at higher mass-ratios.\n\nFrom the third row, we observe that IMRPhenomC achieves better than $98\\%$ SNR\nrecovery over the parameter space considered. When the magnitude of the spins\non \\textit{both} BHs is large and they are parallel\n(i.e. either both spins aligned, or both anti-aligned), the SNR loss increases\n$2\\%$ with increasing mass-ratio. \nBy comparing with the top row of\nFig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z} we see a clear \ndemonstration of how well IMRPhenomC exploits the degeneracies of the binary \nparameter space through its use of an effective spin parameter.\nThese results are consistent with the understanding that it was constructed \nwith the aim of being an \\textit{effectual} model, and calibrated in the region of the\nparameter space which we probe here~\\cite{Santamaria:2010yb}.\n\nThe bottom row of Fig.\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR},\nfinally, shows results for IMRPhenomD.\nAs expected from its faithfulness measurements stated in the previous\nsection, this model recovers $\\geq 99.5\\%$ of the optimal SNR in all of the \nparameter space which we probe here. Note that this includes all high-spin/high-spin\ncorners, which were problematic with the other IMR waveform models. \n\n\nTo summarize, we find here that IMRPhenomD is the most effectual for\nBH binaries with $1\\leq q\\leq 3$, $-0.85\\leq\\chi_{1,2}\\leq +0.85$ and \ntotal masses greater than those shown in Fig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}. \nSEOBNRv2 also shows comparable fitting factor, except for a slight drop in \nSNR recovery in the high-spin/high-spin corner of the non-precessing BBH space.\n\n\n\n\n\n\n\\section{Systematic Parameter Biases}\\label{s1:param_bias}\n\n\n\n\\begin{figure*}\n\\centering    \n\\includegraphics[width=\\columnwidth]{ChirpMassBias_vsChiEff_SEOBNRv1.pdf}\n\\includegraphics[width=\\columnwidth]{TotalMassBias_vsChiEff_SEOBNRv1.pdf}\\\\\n\n\\includegraphics[width=\\columnwidth]{ChirpMassBias_vsChiEff_SEOBNRv2.pdf}\n\\includegraphics[width=\\columnwidth]{TotalMassBias_vsChiEff_SEOBNRv2.pdf}\\\\\n\n\\includegraphics[width=\\columnwidth]{ChirpMassBias_vsChiEff_IMRPhenomC.pdf}\n\\includegraphics[width=\\columnwidth]{TotalMassBias_vsChiEff_IMRPhenomC.pdf}\\\\\n\n\\includegraphics[width=\\columnwidth]{ChirpMassBias_vsChiEff_IMRPhenomD.pdf}\n\\includegraphics[width=\\columnwidth]{TotalMassBias_vsChiEff_IMRPhenomD.pdf}\n\\caption{\nSystematic bias in the recovery of chirp mass ${\\mathcal{M}_c}$ (left column), and\ntotal mass $M$ (right column) for different waveform models (rows). In each\npanel, the respective bias is shown as a function of the normalized \neffective spin of the NR waveforms. The plot-markers show the bias\nfor a binary with total mass fixed at $M=80M_\\odot$. The plot-markers\nshow the bias for a binary with total mass fixed at $80M_\\odot$. The ``error-bars''\nshow the range of biases for total masses between the minimum allowed\nmass and $150M_\\odot$.\n}\n\\label{fig:IMR_ChirpMassError_vs_ChiEff}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering    \n\\includegraphics[width=\\columnwidth]{EtaRec_vsChiEff_SEOBNRv1.pdf}\n\\includegraphics[width=\\columnwidth]{EtaRec_vsChiEff_SEOBNRv2.pdf}\\\\\n\\includegraphics[width=\\columnwidth]{EtaRec_vsChiEff_IMRPhenomC.pdf}\n\\includegraphics[width=\\columnwidth]{EtaRec_vsChiEff_IMRPhenomD.pdf}\n\\caption{Systematic bias in the recovery of the binary mass-ratio \n$q{\\mathrel{\\vcenter{\\baselineskip0.5ex \\lineskiplimit0pt                      \\hbox{\\scriptsize.}\\hbox{\\scriptsize.}}}                      =} m_1/m_2$, as a function of the normalized effective spin of the NR\nwaveforms. Different mass-ratios are shown with different color, with \nhorizontal dashed lines of the same color drawn to guide the eye. The plot-markers\nshow the recovered $q$ for a binary with total mass fixed at $80M_\\odot$, while\nthe ``error-bars'' show the range spanned by the recovered $q$ as the \ninjected binary mass is varied between its lowest allowed value and \n$150M_\\odot$.\n}\n\\label{fig:IMR_EtaRec_vs_ChiEff}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering    \n\\includegraphics[width=\\columnwidth]{ChiEffBias_vsChiEff_SEOBNRv1.pdf}\n\\includegraphics[width=\\columnwidth]{ChiEffBias_vsChiEff_SEOBNRv2.pdf}\\\\\n\\includegraphics[width=\\columnwidth]{ChiEffBias_vsChiEff_IMRPhenomC.pdf}\n\\includegraphics[width=\\columnwidth]{ChiEffBias_vsChiEff_IMRPhenomD.pdf}\n\\caption{Systematic bias in the recovery of the effective spin parameter\n$\\chi_\\mathrm{eff}$, as a function of the normalized effective spin of the NR\nwaveforms. The plot-markers\nshow the recovered $\\chi_\\mathrm{eff}$ for a binary with total mass fixed at $80M_\\odot$, while\nthe ``error-bars'' show the range spanned by the recovered $q$ as the \ninjected binary mass is varied between its lowest allowed value and \n$150M_\\odot$.\n}\n\\label{fig:IMR_ChiEffError_vs_ChiEff}\n\\end{figure*}\n\n\n\nBayesian parameter estimation of BH masses and spins uses (semi-)analytical waveform\nmodels. Its efficacy, therefore, depends critically on the \naccuracy of the waveform model used~\\cite{Aasi:2013kqa}. Modeling inaccuracies\nintroduce systematic biases in the inferred parameter values. In this section,\nwe quantify these systematic parameter biases for the four waveform models considered\nin this work.\n\nTo avoid the complete Markov-Chain Monte-Carlo (MCMC) procedure, we shall \napproximate the parameter bias of a waveform model as the difference in \nparameters between those parameters that maximize overlap with an NR waveform,\nand the parameters of the NR waveform. We repeat this calculation for every NR\nwaveform. The broad features of the resulting parameter bias data are\ndependent most strongly on the effective spin parameter $\\chi_\\mathrm{eff}$, \nand therefore, we will present results as a function of it. \nBecause we project two spins $\\chi_1, \\chi_2$ onto the one effective spin, the\nplotted data will not be single-valued. Configurations with different\n$\\chi_1,\\chi_2$, but the same $\\chi_\\mathrm{eff}$ yield in general different\nbiases, which are plotted at their $\\chi_\\mathrm{eff}$ values.\n\n\nFirst, in the left column of Fig.~\\ref{fig:IMR_ChirpMassError_vs_ChiEff} we\nshow the fractional systematic bias in the recovery of binary chirp mass \n$\\mathcal{M}_c = \\frac{(m_1m_2)^{3/5}}{(m_1+m_2)^{1/5}}$ that is\nintrinsic to different waveform models, as a function of the effective spin \n$\\chi_\\mathrm{eff}$ of the NR waveforms. In the right column of the same figure\nwe show the fractional biases in the recovery of binary total mass $M$.\n\nIn the top row, we show results for SEOBNRv1. The \nmagnitude of the systematic biases for this model increases rapidly with \n(i) increasing magnitude of $\\chi_\\mathrm{eff}$, and \n(ii) increasing mass-ratio. For e.g., we see that\nthe recovered chirp mass can be biased by up to $15\\%$ when the effective\nspin is anti-aligned, while the total mass bias does not exceed $5\\%$.\n\nOn the other hand, the increasing trend of systematic biases at high $\\chi_\\mathrm{eff}$\nis to be expected since SEOBNRv1 does not support spins \n$\\chi_{1,2}\\geq +0.6$~\\cite{Taracchini:2012}.\n\nIn the third row, we show the intrinsic bias of IMRPhenomC in recovering\nbinary's chirp and total masses. Focusing at the plot-markers in both panels, we \nobserve that the systematic biases stay below $\\sim 3\\%$ for binaries with\nmasses at\nthe lower end of the mass-range probed here. However at higher masses, as with\nSEOBNRv1, both the recovered chirp mass and total mass can be shifted by\n$15\\%$ if the binary's ${\\chi_\\mathrm{eff}} \\leq 0$. Relatively, the\ntotal mass is recovered better by this model.\nIn comparison with SEOBNRv1, IMRPhenomC allows for less\naccurate parameter recovery. \n\nNext, we consider the more recent SEOBNRv2 model (second row). This \nwaveform model is of interest, in part, because its reduced-order \nmodel~\\cite{Purrer:2015tud} is being used in\nBBH searches being run for the presently ongoing aLIGO observing run ``O1''.\nFocusing on the plot-markers we find that the systematic biases in ${\\mathcal{M}_c}$ \nrecovery stay below $\\sim 1-2\\%$ of the true ${\\mathcal{M}_c}$ value, \nfor binaries with masses $\\lesssim 80M_\\odot$. For higher masses ($100-150M_\\odot$),\nbiases go up to $5\\%$, but is still smaller than the statistical\nuncertainty in ${\\mathcal{M}_c}$ measurement at high masses~\\cite{Veitch:2015ela,Haster:2015cnn}.\nThe bias in $M$ has the same sign as the ${\\chi_\\mathrm{eff}}$ of the binary.\n\nFinally, in the bottom right panel, we show the results for the most recently\npublished IMRPhenomD model. Performing better than SEOBNRv2, IMRPhenomD furnishes\nbiases in the recovery of ${\\mathcal{M}_c}$ which rarely exceed $2\\%$. For \n${\\chi_\\mathrm{eff}}\\in[-0.6,+0.6]$ the total mass recovery does rise to $5\\%$, which is\nworse than the model's ${\\mathcal{M}_c}$ bias for the same signals.\nWe also highlight the aligned-/aligned- spin corner, where SEOBNRv2's \nmass-recovery biases rise up to $5-10\\%$, while they stay \nwithin $2-5\\%$ for IMRPhenomD. This is \nto be expected given the disagreement between SEOBNRv2 and NR in the same\nregion of parameter space, as shown in Sec.~\\ref{s1:faithfulness}.\n\nFor all models, as illustrated in\nFig.~\\ref{fig:IMR_ChirpMassError_TotalMass_Spin1z_Spin2z},\nwe note that the highest parameter biases for chirp mass \ncorrespond to the upper edge of the total-mass range probed\nhere, i.e. the edge of the 'error-bars' correspond to $M\\sim 150M_\\odot$.\n\nIn summary, for $M\\leq 100M_\\odot$, both SEOBNRv2 and IMRPhenomD are likely\nto yield similarly accurate estimates of chirp-mass, while for higher\nmasses we find IMRPhenomD to be relatively more suited to parameter\nestimation studies.\n\n\nFurther, Figure~\\ref{fig:IMR_EtaRec_vs_ChiEff} shows the recovered value\nof binary mass-ratio $q=m_1/m_2$, for different waveform models, as a function\nof the mass-ratio and effective spin $\\chi_\\mathrm{eff}$ of the NR \nwaveforms. As before, the plot-markers correspond to a fixed total-mass\n$M=80M_\\odot$, while the ``error-bars'' show the entire range of y-values\nfor the mass-range that we probe here (i.e. $M\\in[M_\\mathrm{min}, 150M_\\odot]$).\n\nIn the spin-range supported by SEOBNRv1, we find that it\nexhibits up to $15\\%$ systematic bias in the recovery \nof $q$, with biases increasing as $|{\\chi_\\mathrm{eff}}|\\rightarrow 1$, i.e. for \nhighly spinning binaries, including at the lower-end of the mass-range probed here. \nSEOBNRv2, on the other hand, shows a systematic trend with $\\chi_\\mathrm{eff}$. We \nfind that the difference between the recovered and true mass-ratios increases with\n${\\chi_\\mathrm{eff}}$. For negative ${\\chi_\\mathrm{eff}}$, $q$ tends to be underestimated, whereas for \npositive ${\\chi_\\mathrm{eff}}$, $q$ tends to be overestimated. At the high-aligned-spin end,\nthe mass-ratio can be over-estimated by more than $15\\%$ by SEOBNRv2.\n\nTurning to IMRPhenomC, we find that its associated $q$ bias stays within $20\\%$ at \nthe lower mass end, and is much larger for high binary masses. This is\nparticularly true for large anti-aligned ${\\chi_\\mathrm{eff}}$.\n\nIMRPhenomD, on the other hand, shows little dependency of its intrinsic\nmass-ratio bias on effective spin, except that it gives slightly elevated \n$q$-bias close to $\\chi_\\mathrm{eff}=0$, i.e. for mixed-aligned binaries. \nOverall, we note that all models recover $q$ worse as the total-mass\nof the system increases. IMRPhenomD gives relatively a better estimate\nof the mass-ratio than the other models considered here.\n\n\nFinally, in Fig.~\\ref{fig:IMR_ChiEffError_vs_ChiEff} we show the \nbias in the recovery of the effective-spin combination, $\\chi_\\mathrm{eff}$,\nas a function of the $\\chi_\\mathrm{eff}$ of the NR waveforms. \n$\\chi_\\mathrm{eff}$ is the leading order spin combination that enters\nthe binary's inspiral phasing, and therefore the matched-filter is \nexpected to be most sensitive to this combination of the component\nspins~\\cite{Ajith:2011ec}.\n\nOverall, we find that $\\chi_\\mathrm{eff}$ is well constrained,\nwithin $\\pm 0.2$ of its true value, by all the waveform models\nconsidered. From the left column, we can compare the spin recovery of the\ntwo older models, SEOBNRv1 and IMRPhenomC. Both of these models exhibit\nstrong dependence of the accuracy of spin recovery on $\\chi_\\mathrm{eff}$.\nFor SEOBNRv1, we find that its associated $\\chi_\\mathrm{eff}$ bias\nis constrained within $\\pm 0.1$ of the true value, when the source\nbinary's $\\chi_\\mathrm{eff}\\leq +0.4$. When the binary's \n$\\chi_\\mathrm{eff}$ exceeds $+0.4$, the model gives rapidly increasing\nsystematic biases in its spin recovery, with $\\chi_\\mathrm{eff}$ being\nunderestimated by up to $0.25$. This trend arises because SEOBNRv1 is\nrestricted to component spins $\\chi_{1,2}\\leq +0.6$, so higher NR spin\nmust -- by construction -- be recovered by $\\chi_{1,2}$ within SEOBNRv1's\nrange. IMRPhenomC exhibits a similar trend at the negative side of the \nspin range: it recovers $\\chi_\\mathrm{eff}$\nwithin $\\pm 0.1$ when the source's $\\chi_\\mathrm{eff} >-0.5$, with the\nbias increasing sharply for more anti-aligned spins. \n\nIn the top-right panel of Fig.~\\ref{fig:IMR_ChiEffError_vs_ChiEff}, we\nshow the spin recovery by the SEOBNRv2 model. Primarily, we note that\nSEOBNRv2 recovers ${\\chi_\\mathrm{eff}}$ very well, with a systematic bias that stays\nbelow $\\pm 0.1$ in dimensionless spin magnitude (with rare excursions\nup to $\\pm 0.2$ for large aligned spins).\nIn addition, we note a (minor, but) interesting pattern: the bias in\nspin recovery increases almost linearly with ${\\chi_\\mathrm{eff}}$ between \n$-0.5\\leq{\\chi_\\mathrm{eff}}\\leq+0.6$, \ngoing from $-0.1$ for ${\\chi_\\mathrm{eff}}=-0.5$ to $+0.1$ for ${\\chi_\\mathrm{eff}}=+0.6$.\n\nFinally, the bottom-right panel of Fig.~\\ref{fig:IMR_ChiEffError_vs_ChiEff}\nshows the ${\\chi_\\mathrm{eff}}$ bias for IMRPhenomD.\nWe find the systematic bias in $\\chi_\\mathrm{eff}$ associated with this \nwaveform model stays between $\\pm 0.1$ (as for SEOBNRv2), with best recovery\nfor aligned-spins and low total-masses. We also note that this bias shows\nlittle dependence on $\\chi_\\mathrm{eff}$ itself, however it does increase\nsystematically with mass-ratio $q$ for the higher binary masses.\n\nOverall, we find that of all the waveform models considered, both SEOBNRv2\nand IMRPhenomD recover $\\chi_\\mathrm{eff}$ within $\\pm 0.1$, with \nIMRPhenomD performing markedly more consistent for binaries with large\naligned spins.\n\nFor all models, we note that the highest parameter biases for mass and \nspin parameters correspond to the upper edge of the total-mass range probed, \ni.e. the edge of the 'errorbars' correspond to $M\\sim 150M_\\odot$.\n\nWe present detailed results showing the dependence of systematic parameter\nbiases on signal parameters in \nAppendices~\\ref{as1:bias_masses},\\ref{as1:bias_spins}.\n\n\nFrom the results presented in this and previous section, we find that both\nIMRPhenomD and SEOBNRv2 outperform their earlier \nincarnations in the recovery of various mass- and spin-combinations probed\nhere, with IMRPhenomD performing systematically better (i) at recovering\nbinary's chirp mass, and (ii) for parameter recovery, in general, for\nsystems with high aligned-spins. \n\nA more detailed MCMC analysis is necessary to measure the statistical\nuncertainties in parameter recovery from different models in order to determine\nthe GW SNRs at which modeling inaccuracies will \\textit{actually} begin to\ndominate. Fig.~\\ref{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z} only gives a lower\nlimit on this SNR, and we may well find that statistical uncertainties\nremain dominant for even louder signals. We do, however, recommend\nbased on this study that\naLIGO parameter estimation efforts use either of the two waveform models\nto model filters.\n\n\n\n\\section{Conclusions}\\label{s1:conclusions}\n\n\nLIGO and other ground-based gravitational-wave detectors rely on waveform\nmodels for detection of compact object binaries as well as for parameter\nestimation of the candidate events. Accurate waveform models are therefore\nnecessary to ensure high detection efficiency and to avoid systematic biases in\nparameter estimation. \n\nPast studies focused at evaluating the accuracy of waveform models have\neither used model precision as a proxy for accuracy (i.e. used model/model\ndiscrepancy as proxy for model/true-signal discrepancy)~\\cite{Damour:2000zb,\nDamour2001,Damour:2002kr,Damour02,Gopakumar:2007vh,Buonanno:2009},\nor have used NR simulations with zero/low-to-moderate component spins as \nbenchmarks~\\cite{Boyle2007,Boyle2008b,Boyle:2008,Pan2007,Hannam2007c,\nHannam:2010ec,HannamEtAl:2010,MacDonald:2012mp,Littenberg:2012uj,\nPurrer:2013xma,Hinder:2013oqa,Kumar:2015tha}.\n\nIn this paper we investigate the accuracy of four\ninspiral-merger-ringdown waveform models for binary black holes. Our analysis\nimproved in several ways over earlier work: First, we compare with numerical\nrelativity waveforms, rather than using the difference between analytical \nmodels as a proxy for their error~\\cite{Damour:2000zb,\nDamour2001,Damour:2002kr,Damour02,Gopakumar:2007vh,Buonanno:2009}. \nSecond, the NR waveforms are independent of the investigated waveform models,\nin the sense that \\textit{none} of them were used in calibrating these waveform\nmodels. Furthermore, a companion paper~\\cite{Chu:2015kft} establishes\nthe accuracy of the NR waveforms. \n\nThird, we consider two recently published models, \nIMRPhenomD~\\cite{Khan:2015jqa} and SEOBNRv2~\\cite{Taracchini:2013rva},\nthe accuracy of which have not been investigated independently\n(except for neutron-star black-hole binaries~\\cite{Kumar:2015tha}).\n\nFinally, our set of reference waveforms\ncomprehensively samples the component-spin parameter space up to\n$\\chi_1,\\chi_2=0.9$ for $q=m_1/m_2=1$ and $0.85$ for $q=\\{2,3\\}$, extending\nthe spin coverage beyond the spins used in calibrating the waveform models.\n\n\n\nFirst, we investigate the modeling accuracy of different waveform\nmodels by computing their overlaps against our NR reference\nwaveforms. We rescale the NR waveforms to a range of total mass\nvalues, from the lowest permissible (and still ensuring that it starts\nat $15$~Hz, see Fig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}) up to\n$m_1+m_2=150M_\\odot$. From\nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z}, we find that (i)\nSEOBNRv1 has overlaps above $99\\%$ against NR waveforms for binaries\nwhere the more massive black hole has spin $\\chi_1 < 0.5$, which drop\nto $80\\%$ for larger $\\chi_1$, and SEOBNRv2 performs better with\noverlaps above $98\\%$ across the parameter space except when both\n$\\chi_{1,2}$ are large and aligned. From\nFig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}, we find (iii)\nIMRPhenomC is faithful \\textit{only} to NR for very mildly spinning\nbinaries, with overlaps falling below $90\\%$ when $|\\chi_2|\\geq+0.3$,\nand (iv) IMRPhenomD is superior to other waveform models with overlaps\n(against our reference NR waveforms) above $99\\%$ over the entire spin\nand mass parameter space considered.  For the two most faithful models\n(SEOBNRv2 and IMRPhenomD), we evaluate the indistinguishability\ncriterion, to find the SNR below which modeling errors do \\textit{not}\nsignificantly bias parameter estimation. From\nFig.~\\ref{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z}, we find that,\nexcept for binaries with large aligned spins on \\textit{at least one\n  BH}, SEOBNRv2 remains indistinguishable from real GW signals with\nSNRs up to $15$ or higher.  IMRPhenomD will be indistinguishable from\nreal GW signals with SNRs of $30$ and above for equal-mass, equal-spin\nbinaries, and for SNRs $\\gtrsim 15$ over most of the remaining\nparameter space.  These SNR ranges are very likely to be conservative,\ndue to the overly strict nature of the distinguishability criterion\nused~\\cite{Lindblom2008}.\n\n\nSecond, we investigate the effectualness of different waveform models (including\ntwo additional PN-based ones) for use as aLIGO BBH detection filters. \nDetection searches have an additional degree of freedom: the recovered SNR is\nmaximized over the mass and spin parameters that characterize model \nwaveforms. We compute the fitting factors~\\cite{FittingFactorApostolatos} of \ndifferent waveform models against our NR waveforms, to measure the SNR loss\ndue to modeling inaccuracies in isolation. As shown in \nFig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}, we find that\n(i) SEOBNRv1 is effectual over the entire parameter range it supports, i.e. for\n$\\chi_{1,2}\\leq +0.6$, with fitting factors higher than $99.5\\%$; (ii) SEOBNRv2;\nhas fitting factors above $99.5\\%$ across the considered region of the parameter\nspace, except for the \nhigh-spin/high-spin corner, where its fitting factors fall to 97\\%;\n(iii) IMRPhenomC recovers $99+\\%$ of the SNR over most of the parameter space, \nexcept when both holes have either large aligned or large anti-aligned spins, \nin which cases it still recovers $98+\\%$ of the optimal SNR; and (iv) \nIMRPhenomD out-performs all other waveform models with fitting factors\nabove $99.5\\%$ over the \\textit{entire} parameter range probed. \n\nWe note that the\nfrequency domain IMRPhenomC model makes good use of the intrinsic degeneracy\nin the waveform parameter space, and is therefore well suited to detection\nsearches. SEOBNRv2, on the other hand, does not compensate for its inaccuracy\nin the high-spin/high-spin corner of the parameter space with modified \nintrinsic parameters, and will likely need to be re-calibrated there.\n\n\n\nThird, we investigate the systematic biases in parameter recovery caused by\nintrinsic model inaccuracies. We find that \n(i) both IMRPhenomD and SEOBNRv2 recover\nbinary \\textit{chirp-mass} to within $\\pm 2\\%$ for $M\\gtrsim 70M_\\odot$,\nand $\\pm 5-7\\%$ for $M\\gtrsim 110M_\\odot$, with IMRPhenomD systematically\nmore accurate for aligned spins. \n\n(ii) Binary total mass is recovered with somewhat larger systematic\nbiases across the mass range, spanning $\\pm 5\\%$ for binaries for which the \nchirp mass is recovered within $\\pm 2\\%$.\n\n(iii) SEOBNRv2 and IMRPhenomD recover the binary \\textit{mass-ratio} with \ncomparable accuracy (within $\\pm 10-15\\%$), with IMRPhenomD showing smallest\nbiases for aligned spin binaries.\n\nFinally, (iv) the leading order PN spin combination ${\\chi_\\mathrm{eff}}$ is the best\nrecovered with IMRPhenomD (within $\\pm 0.1$), followed closely by SEOBNRv2.\n\nThe remaining two models show larger biases for all intrinsic parameters\n(see Fig.~\\ref{fig:IMR_ChiEffPNError_TotalMass_Spin1z_Spin2z})\n\n\nIn summary, we find that the more recently published SEOBNRv2 and\nIMRPhenomD models reproduce NR waveforms with identical parameters\nmore accurately than their earlier counterparts, and have very good\nSNR recovery.  We also find that the frequency-domain IMRPhenomC model\nis effectual enough for aLIGO detection searches aimed at\ncomparable-mass aligned spin high-mass BBHs. We recommend that aLIGO\nparameter estimation efforts prefer IMRPhenomD or SEOBNRv2 as the\nwaveform model of choice, in favor other currently available frequency\nand time domain waveform models.\n\nAs noted previously, the parameter biases estimated here need to be \ncomprehensively compared\nwith the statistical errors in parameter recovery from detailed MCMC \nanalyses, in order to determine the actual GW SNRs where modeling errors\nbegin to dominate over other error sources of uncertainty. A recent\nstudy~\\cite{Purrer:2015nkh} indicates that such might be the case for \nSNRs $\\approx 20-30$ and higher (for SEOBNRv2).\n\nWe also note\nthat in order to thoroughly sample the spin parameter space, we have\nrestricted ourselves to small mass-ratios, i.e. $q=\\{1,2,3\\}$. The results\npresented here are therefore applicable to comparable-mass BBHs with total\nmasses $M\\gtrsim 50M_\\odot$, and will\nbe extended to higher mass-ratios and lower total-masses in the future,\nas longer and higher $q$ simulations become less computationally \nexpensive with advances in NR technology~\\cite{Szilagyi:2015rwa}.\nFinally, we use the dominant quadrupolar multipoles here of the reference\nNR waveforms, and leave a study of the sub-dominant modes for future\nwork. We expect their effect to be limited to the highest masses and \nmass-ratios considered here~\\cite{Graff:2015bba}, although a more rigorous\ntreatment is needed to re-affirm this conclusion.\n\nThe relative performance of the four models considered very\n  closely matches their relative age, with the newest model (PhenomD)\n  performing best.  This is expected, given the rapid progress in\n  numerical relativity and waveform modeling.  We also expect the\n  trend towards higher accuracy to continue with future models (e.g.,\n  an EOB model calibrated to new NR simulations).  However, our tests\n  show that for the comparatively simple part of parameter space\n  considered here, recent models are already very good.  Even the\n  older models considered here (SEOBNRv1 and PhenomC) are remarkably\n  good, with very small loss of SNR for event detection\n  (cf. Fig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}).\n  This is a remarkable success, given the sparse parameter space\n  coverage, cf. Fig.~\\ref{fig:NRParams_IMR}.  Future work should be\n  directed toward expanding parameter space coverage (higher\n  mass-ratios, precessing spins), and to include subdominant modes.\n  \n\n\n\n\n\n\n\\begin{acknowledgments}\nWe thank Kipp Cannon, Adam Lewis, Eric Poisson and Aaron\n    Zimmerman for helpful discussions.  We are grateful to Ofek\n    Birnholtz, Sebastian Khan, Lionel London, Frank Ohme and Michael\n    P{\\\"u}rrer, for providing access to the IMRPhenomD code. \n  Simulations used in this work were performed with\n  \\texttt{SpEC}~\\cite{SpECwebsite}.  We gratefully acknowledge support\n  for this research at CITA from NSERC of Canada, the Ontario Early Researcher Awards Program, the Canada Research\n  Chairs Program, and the Canadian Institute for Advanced Research; at\n  Caltech from the Sherman Fairchild Foundation and NSF grants\n  PHY-1404569 and AST-1333520; at Cornell from the\n  Sherman Fairchild Foundation and NSF grants PHY-1306125 and\n  AST-1333129; and at Princeton from NSF grant PHY-1305682 and the\n  Simons Foundation.  Calculations were performed at the GPC\n  supercomputer at the SciNet HPC Consortium~\\cite{scinet}; SciNet is\n  funded by: the Canada Foundation for Innovation (CFI) under the\n  auspices of Compute Canada; the Government of Ontario; Ontario\n  Research Fund (ORF) -- Research Excellence; and the University of\n  Toronto. Further calculations were performed on the Briar\\'ee\n  cluster at Sherbrooke University, managed by Calcul Qu\\'ebec and\n  Compute Canada and with operation funded by the Canada Foundation\n  for Innovation (CFI), Minist\\'ere de l'\\'Economie, de l'Innovation\n  et des Exportations du Quebec (MEIE), RMGA and the Fonds de\n  recherche du Qu\\'ebec - Nature et Technologies (FRQ-NT); on the\n  Zwicky cluster at Caltech, which is supported by the Sherman\n  Fairchild Foundation and by NSF award PHY-0960291; on the NSF XSEDE\n  network under grant TG-PHY990007N; on the NSF/NCSA Blue Waters at\n  the University of Illinois with allocation jr6 under NSF PRAC Award\n  ACI-1440083.  H.P. and P.K. thank the Albert-Einstein Institute,\n  Potsdam, for hospitality during part of the time where this research\n  was completed.\n\n\\end{acknowledgments}\n\n\n\n\n\\begin{appendix}\\label{as:appendix}\n\n\\section{Bias in mass combinations}\\label{as1:bias_masses}\n\\begin{figure*}\n\\centering\n    \n\\includegraphics[width=1.8\\columnwidth]{ChirpMassError_TotalMass_Spin1z_Spin2z_q123.pdf}\\\\%\\quad    \n\\caption{Systematic bias in the recovered chirp mass \n$\\mathcal{M}_c$ for each waveform model, compare to\nFig.~\\ref{fig:IMR_ChirpMassError_vs_ChiEff}. As in Fig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}, \nthe black crosses denote the values of component spins in the $x-y$ plane.\nBiases below $2\\%$ are shown nearly transparently, to emphasize regions \nwith larger biases.\n}\n\\label{fig:IMR_ChirpMassError_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n    \n\\includegraphics[width=1.8\\columnwidth]{TotalMassError_TotalMass_Spin1z_Spin2z_q123.pdf}\\\\%\\quad    \n\\caption{Systematic bias in the recovered total mass \n$M$ for each waveform model, compare to\nFig.~\\ref{fig:IMR_ChirpMassError_vs_ChiEff}. As in Fig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}, \nthe black crosses denote the values of component spins in the $x-y$ plane.\nBiases below $2\\%$ are shown nearly transparently, to emphasize regions \nwith larger biases.\n}\n\\label{fig:IMR_TotalMassError_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure*}\n\\centering\n    \n\\includegraphics[width=1.8\\columnwidth]{EtaError_TotalMass_Spin1z_Spin2z_q123.pdf}\n\\caption{Systematic bias in the recovered symmetric mass-ratio $\\eta$\nfor the considered waveform models. As in Fig.~\\ref{fig:combined_mismatches_TotalMass_Spin1z_Spin2z_IMR}, \nthe black crosses denote the values of component spins in the $x-y$ plane.\n}\n\\label{fig:IMR_EtaError_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\nIn this appendix, we present additional information about the parameter\nestimation mass recovery.\nFig.~\\ref{fig:IMR_ChirpMassError_TotalMass_Spin1z_Spin2z} shows the \nchirp-mass recovery as a function of both component spins, expanding on \nthe left column of\nFig.~\\ref{fig:IMR_ChirpMassError_vs_ChiEff} in the main text.\nFig.~\\ref{fig:IMR_TotalMassError_TotalMass_Spin1z_Spin2z} shows the \ntotal-mass recovery, similarly expanding on the right column of\nFig.~\\ref{fig:IMR_ChirpMassError_vs_ChiEff}.\nFig.~\\ref{fig:IMR_EtaError_TotalMass_Spin1z_Spin2z} plots the recovery of\nsymmetric mass-ratio $\\eta$ (c.f. Fig.~\\ref{fig:IMR_EtaRec_vs_ChiEff}).\n\n\nFrom Fig.~\\ref{fig:IMR_ChirpMassError_TotalMass_Spin1z_Spin2z}, we find \nthat (i) for the \\textit{least} massive binaries considered, both SEOBNRv2 and\nIMRPhenomD introduce less than $2\\%$ systematic biases in the recovery\nof binary chirp mass; with the same rising to $10\\%$ for the \\textit{most}\nmassive binaries. (ii) The chirp-mass bias measured for SEOBNRv1 closely\nfollows that of SEOBNRv2, except when both black holes carry large spins\n(both aligned and anti-aligned) -- where the bias exceeds $10\\%$.\n(iii) IMRPhenomC, on the other hand, has intrinsic chirp-mass biases\nthat remain below $5\\%$ over the considered parameter space, except when\nthe more massive hole has large anti-aligned spin -- for which the biases\nexceed $10\\%$ for binary mass $M\\gtrsim 100M_\\odot$.\n\nFrom Fig.~\\ref{fig:IMR_TotalMassError_TotalMass_Spin1z_Spin2z}, we find that\n(i) both SEOBNRv1 and IMRPhenomC incur smaller systematic biases in $M$\nrecovery than they do for ${\\mathcal{M}_c}$ recovery, especially for large \nanti-aligned and aligned spins.\n(ii) SEOBNRv2 shows the opposite pattern, i.e. it recovers $M$ with \\textit{more}\naccuracy than ${\\mathcal{M}_c}$, especially for larger mass-ratios and larger\nspins on the bigger black hole. Finally, (iii) IMRPhenomD recovers both mass \ncombinations with relatively the highest accuracy.\n\nFurther onto $\\eta$ recovery, the first thing we note from\nFig.~\\ref{fig:IMR_EtaError_TotalMass_Spin1z_Spin2z}, is that all four models\nrecover $\\eta$ well (within $2\\%$) for equal-mass binaries, and this fidelity\ndecreases as we go from $q=1\\rightarrow 3$. The only exception is SEOBNRv1 at\nspins outside the range of the model (i.e. $\\chi_{1,2}>+0.6$).\n\nFor $q=2$, we find that (i) the biases intrinsic to SEOBNRv2 are higher than \nSEOBNRv1, reaching $15-20\\%$ and $10-15\\%$, respectively, for both. SEOBNRv2\nalso gives a \nsystematic under-estimation of $\\eta$ by $-15\\%$ when both holes have large\npositive-aligned spins. (ii) IMRPhenomC, in contrast, performs better with \nbiases staying below $10\\%$, even at the highest binary masses. And, (iii)\nIMRPhenomD shows the highest fidelity (with $\\eta$ biases below $5\\%$).\n\nIncreasing the mass-ratio to $q=3$, we find that (i) all three models other than\nIMRPhenomD manifest larger than $10\\%$ systematic biases in $\\eta$ recovery.\n(ii) For SEOBNRv1 the $\\eta$ bias increases as the spin on the smaller hole\nbecomes increasingly anti-aligned, while SEOBNRv2 over-estimates $\\eta$ by \n$5-10\\%$ for aligned BH spins (this trend was already apparent in\nFig.~\\ref{fig:IMR_EtaRec_vs_ChiEff}). (iii) IMRPhenomC shows relatively the\nworst $\\eta$ recovery of the four with biases ranging from $-15\\%$ to $20\\%$.\nIMRPhenomD confirms our earlier results and is found to perform best\nat $\\eta$ recovery, significantly improving upon its predecessor IMRPhenomC.\n\n\n\n\\section{Biases in recovered spins}\\label{as1:bias_spins}\n\\begin{figure*}[ht]\n\\centering    \n\\includegraphics[width=1.8\\columnwidth]{ChiEffectivePNError_TotalMass_Spin1z_Spin2z_q123.pdf}    \n\\caption{Systematic bias in the recovered values of the 1.5PN effective spin\n$\\chi_\\mathrm{eff}$, for the SEOBNRv1, SEOBNRv2, IMRPhenomC, and IMRPhenomD\nmodels (from top to bottom).\n}\n\\label{fig:IMR_ChiEffPNError_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n\\centering    \n\\includegraphics[width=1.8\\columnwidth]{ChiMassWeightedError_TotalMass_Spin1z_Spin2z_q123.pdf}\n\\caption{Systematic bias in the recovered values of the mass-weighted \neffective spin $\\chi_\\mathrm{mw}$, for the SEOBNRv1, SEOBNRv2, IMRPhenomC,\nand IMRPhenomD models (from top to bottom).\n}\n\\label{fig:IMR_ChiMWError_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\nIn this appendix, we present additional information about the parameter\nestimation spin recovery.\nFig.~\\ref{fig:IMR_ChiEffPNError_TotalMass_Spin1z_Spin2z} \nand~\\ref{fig:IMR_ChiMWError_TotalMass_Spin1z_Spin2z} show the bias in the\nrecovery of two different spin parameters, the effective spin ${\\chi_\\mathrm{eff}}$\n(c.f. Eq.~\\ref{eq:chieff}) and the mass-weighted spin $\\chi_\\mathrm{mw}$\n(c.f. Eq.~\\ref{eq:chimw}). \n\nThe overall trends are similar for ${\\chi_\\mathrm{eff}}$ and $\\chi_\\mathrm{mw}$ :\n\nAll four models recover ${\\chi_\\mathrm{eff}}$ well, with absolute systematic biases\nbetween $\\pm 0.2$. Of the four, IMRPhenomD stands out by recovering \n${\\chi_\\mathrm{eff}}$ to within $\\pm 0.1$ of the true value. SEOBNRv2\nfollows very closely, with ${\\chi_\\mathrm{eff}}$ biases rising higher than\n$0.1$ only for very massive binaries (with $M\\gtrsim 100M_\\odot$) with\nlarge spins (magnitude) on at least one hole. Both of the two remaining\nmodels show a strong correlation between the ${\\chi_\\mathrm{eff}}$ bias and the \n${\\chi_\\mathrm{eff}}$ of the binary itself. While SEOBNRv1 \\textit{under-}estimates \n${\\chi_\\mathrm{eff}}$ by up to $0.25$ when both holes have large \\textit{aligned} spins, \nIMRPhenomC \\textit{over-}estimates ${\\chi_\\mathrm{eff}}$ when both holes have large\n\\textit{anti-aligned} spins. \n\nNext, we focus on $\\chi_\\mathrm{mw}$. As for ${\\chi_\\mathrm{eff}}$, IMRPhenomD was found to\nrecover ${\\chi_\\mathrm{mw}}$ with the smallest biases, which only exceed $\\pm 0.1$ for\nunequal-mass binaries with aligned (anti-aligned) spin on the larger (smaller)\nhole. As this is the spin mapping used by IMRPhenomC to capture component spin\neffects on phasing, we notice from\nFig.~\\ref{fig:IMR_ChiEffPNError_TotalMass_Spin1z_Spin2z} that it also recovers\n$\\chi_\\mathrm{mw}$ very well -- except when both components have large\nanti-aligned spins, in which case it overestimates ${\\chi_\\mathrm{mw}}$ by up to $0.3$\ndimensionless units.\nOf the two EOB models, SEOBNRv2 recovers ${\\chi_\\mathrm{mw}}$ better with systematic\nbiases increasing with mass-ratio $q$, but not exceeding $\\pm 0.2$.\nSEOBNRv1, on the other hand, shows the inverse pattern of IMRPhenomC, giving\nlarge systematic biases in ${\\chi_\\mathrm{mw}}$ for binaries with $\\chi_{1,2}\\geq 0.6$ --\nwhich is expected by construction from the model as it does not support these \ncomponent spins.\n\n\nOverall, we find both IMRPhenomD and SEOBNRv2 models viable for aLIGO parameter\nestimation studies aimed at high-mass binary black holes with non-precessing\nspins\n\n\n\n\\end{appendix}\n\n\n\n\\section*{References}\n\n\\bibliography{References-prd}\n\n\n", "itemtype": "equation", "pos": 40987, "prevtext": "\n(with symmetric mass-ratio $\\eta=m_1 m_2/(m_1+m_2)^2$), to capture the late-inspiral/plunge\nphase, (iii) use of (uncalibrated) EOB+NR hybrid waveforms to constrain \nfree parameters, and (iv) use of several high mass-ratio NR simulations to extend \nthe range of validity of the model. The simulations used to calibrate \nIMRPhenomD sample component spins more densely than the set used for \nIMRPhenomC, and cover mass-ratios up to $q=18$. We refer the reader to\nRef.~\\cite{Khan:2015jqa,Husa:2015iqa} for further details of IMRPhenomD.\n\n\n\n\n\n\n\n\\section{Faithfulness Analysis}\\label{s1:faithfulness}\n\n\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=2\\columnwidth]{Faithfulness_TotalMass_Spin1z_Spin2z_SEOBNR_q123.pdf}\n\\caption{Unfaithfulness between SEOBNR and NR waveforms as a \nfunction of mass-ratio $q=m_1/m_2$, component spins $\\chi_{1}, \\chi_{2}$, and\ntotal mass $M$. SEOBNRv1 (top panel) reproduces NR well when the spin on the \nbigger BH does not exceed $+0.5$, with inaccuracies increasing with mass-ratio.\nSEOBNRv2 (bottom panel) significantly improves over SEOBNRv1 with overlaps \nagainst NR higher than $98\\%$ over most of the parameter space considered. \nHowever, when spins on both component BHs are large and positive-aligned, \nSEOBNRv2 fails to produce accurate waveforms ($\\mathcal{O}\\simeq 0.80$). We \nnote that both models are accurate within their respective calibration range, \nbut become inaccurate outside this range. Therefore it is crucial to test \nwaveform models before using them in aLIGO analyses.\n}\n\\label{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=1.05\\columnwidth, trim={{0.05\\columnwidth} 0 0 0}]{ExactParameters_LFAligned_q2-0_sA0-85_sB0-85.pdf}\\\\\n\\includegraphics[width=1.05\\columnwidth, trim={{0.05\\columnwidth} 0 0 0}]{ExactParameters_LFAligned_q3-0_S0-85_S0-85.pdf}\n\\caption{SEOBNRv2 and NR waveforms for the problematic cases identified in the\nhigh spin corner of Fig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z}.\nTop: $q=2,\\,\\chi_1=\\chi_2=+0.85$. Bottom: $q=3,\\,\\chi_1=\\chi_2=+0.85$. \nWaveforms are aligned during their first few inspiral cycles.\n}\n\\label{fig:SEOBv2_unfaith_q23s85s85cases}\n\\end{figure}\n\n\\begin{figure*}\n\\centering\n\\includegraphics[width=2\\columnwidth]{Faithfulness_TotalMass_Spin1z_Spin2z_IMRPhenomCD_q123.pdf}\n\\caption{This figure is similar to\nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} with the difference\nthat the models considered here are IMRPhenomC and IMRPhenomD (top and\nbottom panels, respectively). We note that both of the phenomenological\nmodels have been calibrated over most of the mass-ratio and spin range probed here.\nWhile IMRPhenomC shows significant deviation from NR as soon as we increase\nthe mass-ratio above $q=1$, and/or spin magnitudes above $\\approx 0.5$,\nwe find that IMRPhenomD reproduces NR remarkably well with\noverlaps above $99\\%$ everywhere (above $99.5\\%$ over most of the space).\n}\n\\label{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\\begin{figure*}[h]\n\\centering\n\\includegraphics[width=2\\columnwidth]{snrEffective_TotalMass_Spin1z_Spin2z_IMR_q123.pdf}\n\\caption{We show the effective SNR level at which the SEOBNRv2 and IMRPhenomD\nmodels become distinguishable from NR waveforms with the Advanced LIGO\ninstruments. Here we use the indistinguishability criterion proposed in \nRef.~\\cite{Lindblom2008}.\n}\n\\label{fig:SEOB_snrEff_TotalMass_Spin1z_Spin2z}\n\\end{figure*}\n\n\n\nWe now proceed to a comparison of the NR waveforms introduced in \nSec.~\\ref{s2:numrel_simulations} with the analytical waveform models introduced\nin Sec.~\\ref{s2:waveform_models}, beginning with an analysis of their\nfaithfulness (c.f. Eq.~\\ref{eq:overlap}).\nWe rescale the NR waveforms to\na range of total masses, and compute overlaps with model waveforms with \nidentical BH parameters. These overlaps are maximized over \nthe extrinsic parameters however, i.e. over the time and phase at coalescence.\nThey measure the accuracy of the models\nat specific points in the parameter space $(m_1,m_2,\\chi_{1},\\chi_{2})$.\n\nIn Fig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} we show the \nunfaithfulness (i.e. $1-\\mathcal{O}$) of the two EOB models, SEOBNRv1 and\nSEOBNRv2. In each row, the three\npanels correspond to mass ratios $q=\\{1,2,3\\}$. In each panel, the three axes \ncorrespond to component spins and total mass with the color showing the \nunfaithfulness. \n\nNote that the total-masses probed are restricted to $M\\gtrsim 50M_\\odot$\n(c.f. Fig.~\\ref{fig:Min_TotalMass_Spin1z_Spin2z}).\n\nFor SEOBNRv1, we find that its unfaithfulness increases with binary mass-ratio as\nwell as with the more massive component's spin, with little dependence on\nthe binary's total mass. From the top left panel in \nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} we note that for the \nsmallest mass-ratio, $q=1$, SEOBNRv1 reproduces the NR waveforms well with \nunfaithfulness below $0.5\\%$ over most of the spin parameter space, except\nwhen the spins on both holes are close to the maximum value that the model\nsupports (i.e. $+0.6$), where its unfaithfulness rises above $2\\%$. As we increase \nthe mass-ratio to $q=2$ (top middle panel of the same figure) SEOBNRv1's \nfaithfulness further drops below $95\\%$ in the high-aligned-spin region. \nFurthermore, we also find that the unfaithfulness of the model reaches $1-2\\%$ \nwhen the smaller hole carries large anti-aligned spin. Further increasing the \nmass-ratio to $q=3$ increases the differences of the model with NR further,\nwith overlaps\nfalling below $90\\%$ when the larger black hole's spin $\\rightarrow +0.6$.\nOverall, we find that the model performs better when the more massive hole\nhas anti-aligned spins rather than aligned.\n\nTurning to the SEOBNRv2 model, we find that it significantly improves over\nSEOBNRv1: for equal-mass binaries, we find from the bottom left panel of\nFig.~\\ref{fig:SEOB_unfaith_TotalMass_Spin1z_Spin2z} that the unfaithfulness of\nSEOBNRv2 is generally better than $1\\%$ except for mixed aligned/anti-aligned\nspin directions of large spin-magnitudes, where its unfaithfulness reaches $3\\%$.\nFor higher mass-ratios $q=\\{2,3\\}$, the slight increase of unfaithfulness \ntowards the aligned/anti-aligned spin corner persists. For instance, \n$1-\\mathcal{O}\\simeq 0.97$ for $q=2, \\chi_{1}=-0.85, \\chi_{2}=+0.85$.\nHowever, the most significant deviation between SEOBNRv2 and NR occurs for both\nspins aligned with large magnitudes. For $\\chi_{1}=\\chi_{2}=+0.85$, the\nunfaithfulness rises above $10\\%$ for mass-ratios $q=\\{2,3\\}$.\n\nWe explore these differences between SEOBNRv2 and NR further.\nIn Fig.~\\ref{fig:SEOBv2_unfaith_q23s85s85cases}, we compare the model and NR \nwaveforms for $q=\\{2,3\\},\\,\\chi_1=\\chi_2=+0.85$. In both panels, the waveform\npairs are aligned near the start of the NR waveform. We find that \nthe SEOBNRv2 phase evolution agrees with NR during most of the inspiral phase, \nbut its frequency rises faster during the plunge phase than found with NR,\nresulting in an artificially accelerated merger. This evidence hints that the\ncalibration of \nthe merger portion and ringdown attachment of SEOBNRv2 will need further tuning.\n\n\nWe now turn our attention to the phenomenological models IMRPhenomC/D. \nThe unfaithfulness of IMRPhenomC and IMRPhenomD with respect to NR, shown in\nFig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}, displays patterns\ndistinct from the SEOBNR models. \n\nWe find that IMRPhenomC shows poorer agreement with NR than either of the\nSEOBNR models, with unfaithfulness \\textit{increasing} rapidly with \n\\textit{mass-ratio}, \\textit{spin magnitudes}, and with \n\\textit{decreasing binary masses}.\n\nThe top panels of Fig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}\nshow that this disagreement rises to $10-15\\%$ unfaithfulness, especially\nas the spin magnitude of the smaller BH grows.\nwe notice disagreement between PhenomC and NR for large anti-aligned spins, \nwhich increases to $10-15\\%$ unfaithfulness over most of the spin parameter \nspace as we go from $q=1$ to $q=\\{2,3\\}$. This disagreement increases, also,\nas more of the NR waveform is integrated over, i.e. at lower masses.\n\nIn stark contrast, the newest model considered, IMRPhenomD, shows better \nagreement with NR than either of the SEOBNR models, with faithfulness above\n$99\\%$ over most of the analyzed parameter space, as seen in the bottom \npanels of Fig.~\\ref{fig:PhenomCD_unfaith_TotalMass_Spin1z_Spin2z}. The only \nregion where we see somewhat smaller overlaps is for $q\\ne 1$ mixed-aligned \nspins with large positive spin on the larger hole.\n\nWe conclude that both SEOBNRv2 and IMRPhenomD models describe well binaries \nwith \\textit{low to moderate spins}, and even \\textit{high anti-aligned spins},\nwith the latter also representing well \\textit{high aligned spins} binaries.\nThe accuracy of both degrades somewhat with increasing mass-ratio in the  \nhigh aligned/aligned spin and high aligned/anti-aligned spin corners of the \nparameter space respectively. We also find that both of\nthese models outperform their earlier counterparts significantly.\n\n\nFurther, we ask the question: how loud does a GW signal have to be for modeling\nerrors to degrade scientific conclusions derived from it.\nTo answer that, we use the \nsufficient criterion $(\\delta h|\\delta h)< 1$, where \n$\\delta h=h^\\mathrm{true}-h^\\mathrm{modeled}$, to calculate the SNR threshold\n$\\rho_\\mathrm{eff}$\nbelow which the true and modeled waveforms will not be distinguishable by \naLIGO~\\cite{Lindblom2008}, i.e.\n\n\n", "index": 11, "text": "\\begin{equation}\\label{eq:LindbloomOwenBrownCriterion}\n \\rho_\\mathrm{eff} = \\dfrac{1}{\\sqrt{2(1-\\mathcal{O}(h^\\mathrm{NR}, h^\\mathrm{modeled}))}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\rho_{\\mathrm{eff}}=\\dfrac{1}{\\sqrt{2(1-\\mathcal{O}(h^{\\mathrm{NR}},h^{\\mathrm%&#10;{modeled}}))}}.\" display=\"block\"><mrow><mrow><msub><mi>ρ</mi><mi>eff</mi></msub><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\dfrac</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒪</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>h</mi><mi>NR</mi></msup><mo>,</mo><msup><mi>h</mi><mi>modeled</mi></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]