[{"file": "1601.06205.tex", "nexttext": "\n\nwhere N is the number of LO/TO modes, $\\omega_{L \\nu}$ are LO mode frequencies,\n$\\omega_{T \\nu}$ are TO mode frequencies, V$_{\\rm cell}$ is the unit cell volume,\nand $\\epsilon_{\\infty}$ is the electronic dielectric constant. \nThis equation is obtained using the electron-phonon Hamiltonian \nin Ref.~\\onlinecite{toyozawa} and the Lyddane-Sachs-Teller (LST) relation\n$\\epsilon(\\omega) = \\epsilon_{\\infty}\\, \\prod_{j=1}^{N}\\, (\\omega^2-\\omega_{L,j}^2)/(\\omega^2-\\omega_{T,j}^2)$.\n\nIn this expression,\nthe dispersion of the optical phonon frequencies are ignored and in our calculations,\nwe use their value at the zone center. Alternative formulations of \nthe LO phonon coupling based on Born effective charges, which take into account their full dispersion,\nhave also been discussed in the literature~\\cite{calandra-ep,giustino-ep}.  \n\n\n The calculated electron-phonon coupling elements are listed in Table~\\ref{tab:Cnu}.  Here, we define \n\n\n", "itemtype": "equation", "pos": 13663, "prevtext": "\n\n\n\n\n\n\n\n\n\n\\title{Transport properties of KTaO$_3$ from first-principles}\n\n\n\\author{Burak Himmetoglu}\n\\affiliation{Enterprise Technology Services, University of California, Santa Barbara, CA 93106}\n\\author{Anderson Janotti}\n\\affiliation{Materials Science and Engineering, University of Delaware, Newark, DE 19716}\n\n\\date{\\today}\n\n\\begin{abstract}\n\nThe transport properties of the perovskites KTaO$_3$ are calculated using first-principles methods. \nOur study is based on Boltzmann transport theory and the relaxation time approximation,\nwhere the scattering rate is calculated using an analytical model describing \nthe interactions of electrons and longitudinal optical phonons. We compute the \nroom-temperature electron mobility and Seebeck coefficients of KTaO$_3$, and SrTiO$_3$ for comparison, \nfor a range of electron concentrations.\nThe comparison between the two materials provides insight into the mechanisms that determine\nroom-temperature electron mobility, such as the effect of band-width and spin-orbit \nsplitting. The results, combined  with the efficiency of the computational scheme developed in this study, provide \na path to investigate and discover materials with targeted transport properties.\n\\end{abstract}\n\n\n\n\n\n\n\n\n\\maketitle\n\n\\section{Introduction}\n\nKTaO$_3$ (KTO) is a member of a class of materials with the perovskite crystal structure which are being explored \nin the emerging area of oxide electronics. \n\n\n\nThese materials display an array of interesting physical phenomena, that includes ferroelectricity, magnetism, metal-insulator transition \nand superconductivity~\\cite{hwang-emergent}.\nSuch remarkable properties are largely related to the strongly localized $d$ orbitals that dominate the electronic structure of these\nmaterials.  An immediate drawback for electronic applications is the limitation in electron mobility, \nwhich is often attributed to the heavy band masses resulting from $d$-orbital derived\nconduction bands and enhanced electron-phonon interactions.  \nLow-temperature electron mobilities exceeding 20,000 cm$^2$/Vs in KTO have been reported, \nwhile the observed room-temperature mobilities are limited to 30 cm$^2$/Vs~\\cite{kto-mobility}.\nIn the related and more widely studied material SrTiO$_3$ (STO), low-temperature mobilities exceeding 50,000 cm$^2$/Vs \nhave been reported, while mobilities at room temperature\nare less than 10 cm$^2$/Vs~\\cite{stemmer-new,stemmer-sto-mobility}.\n\nThe realization of rather high density two-dimensional electron gas at the interface\nof perovskite materials~\\cite{ohtomo-2deg,moetakef-2deg} has led to an increased\ninterest in these systems for device applications. However, limits in room-temperature \nelectron mobility constitute a major hurdle. On the other hand, these materials\ndisplay notably large Seebeck coefficients~\\cite{sto-seebeck-kuomoto,sto-seebeck,kto-S,kto-mobility,stemmer-seebck}, \nwhich makes them promising for thermoelectric applications.  \nIn this context, a first-principles approach to the transport properties in these materials is crucial\nto uncover the fundamental microscopic mechanisms behind the experimental observations,\nand pave the way to improved device performance.\n\n\nAt very low temperatures (below 10 K), the electron mobility is limited by ionized \nimpurity scattering~\\cite{Jena-STO,Spinelli-STO}.  At intermediate to low temperatures, \nrecent studies have indicated that the mobility is determined by a combination of several mechanisms, such as \ntransverse optical (TO) phonon scattering~\\cite{Jena-STO} and electron-electron scattering~\\cite{stemmer-sto-T2}.\nHowever, the rather low mobility at room temperature is generally believed to originate from \nstrong scattering of electrons by polar longitudinal optical (LO) phonons~\\cite{frederikse-sto,tufte-sto}. \nIn general, studies of electron mobility are based on experimental analysis of transport data using phenomenological models,\nwhereas investigations using first-principles methods have been scarce. \n\n\nRecent theoretical studies indicate that LO phonons are the main source of \nscattering which leads to the observed low mobilities at room temperature~\\cite{sto-us,polaron-devreese}.\nInvestigations of other mechanisms, such as TO phonon scattering, have been limited \ndue to difficulties arising from strong anharmonic effects at the temperature range (around 100K) where\nthey become effective~\\cite{sto-ph3,siemons-kto}. There are some\nlimited studies on the effect of electron-electron scattering in STO~\\cite{Mazin-T2,sto-ee},\nhowever, a study based on a fully first-principles band structure is still not yet available.\nIn the case of thermal transport, few groups have investigated \nthe Seebeck coefficient of STO and KTO~\\cite{seebeck-sto,seebeck-stokto}, \nusing calculated effective masses and density of states.\nAlthough the results are in reasonable agreement with experiments, the effect of electron-phonon scattering\non the thermal transport properties has not been explicitly included in these studies.\n\nIn this work, we investigate the transport properties of KTO and STO, and \nanalyze the underlying mechanisms that determine the room-temperature\ntransport coefficients. Our calculations are based on a fully first-principles\ndescription of the electronic band structure of both materials, and a solution\nof the Boltzmann transport equation (BTE) within the relaxation time approximation.\nThe relaxation time, i.e., inverse scattering rate, is calculated by an analytical model for the electron-(LO)phonon scattering,\nproviding an efficient computational approach compared to calculations of electron-phonon \nscattering matrix elements using density functional perturbation theory~\\cite{restrepo,kaasbjerg-mos2,mbn-1,mbn-2,wuli}. \nThe comparison of the results for STO and KTO show that the band-widths of the conduction bands as well as the spin-orbit splitting play\nan important role in determining the room-temperature transport properties.\n\n\n\n\n\nOur results show that the superior room-temperature mobility in KTO, compared to STO, arises not only from \nthe larger conduction band-width, but also from the stronger spin-orbit coupling which lifts the degeneracy of the lowest-energy conduction bands, \nthus reducing the effective number of conduction bands to which electrons can scatter. \nTherefore, the lower effective number of conduction bands mitigates the strength of electron-phonon scattering, leading \nto a significant enhancement of carrier mobility at room temperature. On the other hand, it also\nyields a smaller Seebeck coefficient.  Such insights, combined with the efficiency of computational approach described here, opens up the possibility to\nscreen a large number of perovskite oxides aiming at the discovery of new materials with targeted transport properties. \n\nThe paper is organized as follows: In Section~\\ref{sec:methods}, we describe the details of the computational approach. \nIn Section~\\ref{sec:bandsph}, we report the calculated electronic band structure and\noptical phonon frequencies of both KTO and STO. In Section~\\ref{sec:eph}, we discuss details on the calculation \nof electron-phonon scattering rates, and in Section~\\ref{sec:tr}, we present the calculations of transport \nintegrals and discuss the behavior of mobility and Seebeck coefficient as a \nfunction of electron concentration in KTO and STO. In Section~\\ref{sec:tauk}, we provide \na detailed discussion of the differences in transport coefficients arising from \nusing a constant scattering time {\\em vs.} the full ${\\bf k}$-dependent scattering time obtained\nfrom electron-phonon scattering rates. In Section~\\ref{sec:disc} we present our\nconcluding remarks.\n\n\\section{\\label{sec:methods} Computational Methods}\n\nStructural optimizations and electronic band structure calculations presented in this\npaper are performed using density functional theory (DFT) and the plane-waves pseudopotential method\nas implemented in the PWSCF code of the {\\it Quantum ESPRESSO} package~\\cite{QE}.\nThe exchange-correlation energy is approximated using the local density approximation (LDA)\nwith the Perdew-Zunger parametrization~\\cite{pz}.  K, Sr, Ta, Ti and O atoms are represented by \nultrasoft pseudopotentials~\\cite{uspp}.  Fully relativistic pseudopotentials are employed with non-collinear \nspins~\\cite{dalcorso} in the calculations including spin-orbit coupling.\nThe electronic wavefunctions and charge density are\nexpanded in plane-wave basis sets with energy cutoffs of 50 Ry and 600 Ry, respectively. \nBrillouin-zone (BZ) integrations are performed on a 8$\\times$8$\\times$8 grid of special $k$-points\\cite{mp}. \nThe phonon frequencies at the zone center ($\\Gamma$) are calculated using \ndensity functional perturbation theory (DFPT) as implemented in {\\it Quantum ESPRESSO}~\\cite{dfpt}.\nThe splitting of longitudinal and transverse optical modes at $\\Gamma$ is taken into account \nvia the method of Born and Huang~\\cite{born-huang}.\nFor the calculation of the electron-phonon scattering rates and transport integrals, a 60$\\times$60$\\times$60\ngrid is used to sample the BZ. The Dirac-delta functions appearing in the calculation of scattering\nrates is approximated by a Gaussian smearing function with a width of 0.2 eV. \n\n\\section{\\label{sec:bandsph}Electronic and Vibrational Spectrum}\n\nWe consider the cubic phase of KTaO$_3$, which is the stable phase at room temperature. The optimized lattice parameter\nis $a_0 = 3.94$ \\AA, which is about $1\\%$ smaller than the experimental value~\\cite{kto-lattice}, as expected from the LDA functional.\nLDA calculations yield an indirect band gap of 2.13 eV for the collinear spin, and\n2.00 eV for the non-collinear spin calculations, respectively. As expected,\nLDA underestimates the band gap of KTO, which is 3.64 eV (indirect)~\\cite{kto-gap}. \n\nWe note that the band gap does not enter explicitly in the transport calculations, \nand only the conduction band structure is relevant, as discussed previously in Ref.(\\onlinecite{sto-us}).\nTherefore, we limit our study to the LDA results in this work.\n\n\nThe conduction band structure of KTO is shown in Fig.~\\ref{fig:bands}, where\nresults are presented for both collinear and non-collinear calculations. \nAlso shown is the band structure of STO (from Ref.(\\onlinecite{sto-us})) for comparison.\n\nThe conduction bands are derived mainly from the Ta 5$d$ orbitals. Due to cubic symmetry,\nthe 5$d$ states are split into e$_g$ and t$_{2g}$ states, with the lowest lying conduction bands being t$_{2g}$ states.\n\nIn case of collinear spin calculation, spin-orbit interactions are not present,\nand therefore the three conduction bands are degenerate at $\\Gamma$. In non-collinear spin\ncalculations, spin-orbit coupling is included, the threefold degeneracy at $\\Gamma$ is lifted,\nand one of the bands is split by $\\Delta_{\\rm SO} \\simeq 0.4 {\\rm eV}$ to higher energy (see Fig.~\\ref{fig:bands}(b)).  \n\nThe phonon frequencies at $\\Gamma$ and the electronic dielectric\nconstant were obtained by DFPT calculations. The calculated electronic dielectric constant \nis $\\epsilon_{\\infty} = $ 5.4, which is in reasonable agreement with the\nexperimental value of approximately 4.6~\\cite{kto-dielectric}. \nThe calculated phonon frequencies at $\\Gamma$ are listed in Table~\\ref{tab:optph}, \nwhich are also in good agreement with the experimental measurements and\nwith previous calculations~\\cite{kto-singh}.\n\nFor STO, we use the phonon frequencies and the electronic structure reported in Ref.~\\onlinecite{sto-us}, \nwhich were also calculated using LDA. \nUnlike KTO, there is negligible difference between collinear and non-collinear calculations in STO, \ndue to Ti having a much smaller atomic mass than Ta, which leads to\na relatively small spin-orbit splitting of 28 meV~\\cite{sto-hse-bs}.\nTherefore, only collinear calculations for STO are used as a basis of comparison. \n\n\n\n\n\n\n\n\n\n\n\n\\begin{table}[!ht]\n\\caption{\\label{tab:optph} Calculated and experimental longitudinal optical (LO)\nand transverse optical (TO) phonon frequencies at the $\\Gamma$ point,\nin units of cm$^{-1}$.}\n\\begin{ruledtabular}\n\\begin{tabular}{cccc}\n\n   \\multicolumn{2}{c}{ LO} & \\multicolumn{2}{c}{TO} \\\\\n  LDA & Exp. & LDA & Exp. \\\\\\hline\n 176 & 188$^a$, 184-185$^{b,c}$ & 105  &  88$^a$, 81-85$^b$, 88$^c$ \\\\\n 253 & 290$^a$, 279$^b$, 255$^c$ & 186 & 199$^a$, 198-199$^{b,c}$ \\\\\n 403 & 423$^a$, 421-422$^{b,c}$ & 253 & 290$^a$, 279$^b$, 255$^c$ \\\\\n 820 & 833$^a$, 826-838$^{b,c}$ & 561 & 549$^a$, 546-556$^b$, 574$^c$ \n\\end{tabular}\n\\end{ruledtabular}\n\\begin{flushleft}\n$^a$ Ref.~\\onlinecite{kto-phon-1}, \n$^b$ Ref.~\\onlinecite{kto-phon-2}, \n$^c$ Ref.~\\onlinecite{kto-phon-3}.\n\\end{flushleft}\\end{table}\n\n\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.35\\textwidth]{KTO.eps}\n\\includegraphics[width=0.35\\textwidth]{KTOnc.eps}\n\\hspace{0.5cm}\n\\includegraphics[width=0.35\\textwidth]{STO.eps}\n\\caption{\\label{fig:bands} Conduction band structure for KTO, (a) in collinear calculation,\nand (b) in  noncollinear calculation. Band structure of STO is shown in (c) for comparison.}\n\\end{figure}\n\n\n\\section{\\label{sec:eph}Electron-phonon coupling}\n\nIn this work, we consider electron-phonon interactions only due to polar longitudinal optical (LO) phonons.\n\nThe interactions of electrons with the macroscopic electric field due to a LO mode can be analytically \ndescribed by the Fr\\\"ohlich model~\\cite{mahan}, where the electron-phonon coupling depends on \nthe dielectric constants and the LO phonon frequency. In STO and KTO, there are multiple LO modes\nthat contribute to the macroscopic electric field.  \n\nIn this case, the electron-phonon coupling matrix element squared is given by~\\cite{polaron-devreese,toyozawa,eagles}\n\n\n", "index": 1, "text": "\\begin{equation}\n\\left\\vert g_{{\\bf q}\\, \\nu} \\right\\vert^2 = \\frac{1}{q^2}\\, \n  \\left( \\frac{e^2\\, \\hbar\\, \\omega_{L\\nu}}{2 \\epsilon_0\\, V_{\\rm cell}\\, \\epsilon_{\\infty}} \\right)\\,\n  \\frac{\\prod_{j=1}^{N} \\left(1-\\frac{\\omega_{T j}^2}{\\omega_{L \\nu}^2}\\right)}\n       {\\prod_{j \\neq \\nu} \\left( 1 - \\frac{\\omega_{L j}^2}{\\omega_{L \\nu}^2} \\right)},\n\\label{eqn:gnu2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\left|g_{{\\bf q}\\,\\nu}\\right|^{2}=\\frac{1}{q^{2}}\\,\\left(\\frac{e^{2}\\,\\hbar\\,%&#10;\\omega_{L\\nu}}{2\\epsilon_{0}\\,V_{\\rm cell}\\,\\epsilon_{\\infty}}\\right)\\,\\frac{%&#10;\\prod_{j=1}^{N}\\left(1-\\frac{\\omega_{Tj}^{2}}{\\omega_{L\\nu}^{2}}\\right)}{\\prod%&#10;_{j\\neq\\nu}\\left(1-\\frac{\\omega_{Lj}^{2}}{\\omega_{L\\nu}^{2}}\\right)},\" display=\"block\"><mrow><mrow><msup><mrow><mo>|</mo><msub><mi>g</mi><mrow><mpadded width=\"+1.7pt\"><mi>𝐪</mi></mpadded><mo>⁢</mo><mi>ν</mi></mrow></msub><mo>|</mo></mrow><mn>2</mn></msup><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><msup><mi>q</mi><mn>2</mn></msup></mfrac></mpadded><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">ℏ</mi></mpadded><mo>⁢</mo><msub><mi>ω</mi><mrow><mi>L</mi><mo>⁢</mo><mi>ν</mi></mrow></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>ϵ</mi><mn>0</mn></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>V</mi><mi>cell</mi></msub></mpadded><mo>⁢</mo><msub><mi>ϵ</mi><mi mathvariant=\"normal\">∞</mi></msub></mrow></mfrac><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∏</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msubsup><mi>ω</mi><mrow><mi>T</mi><mo>⁢</mo><mi>j</mi></mrow><mn>2</mn></msubsup><msubsup><mi>ω</mi><mrow><mi>L</mi><mo>⁢</mo><mi>ν</mi></mrow><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∏</mo><mrow><mi>j</mi><mo>≠</mo><mi>ν</mi></mrow></msub><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msubsup><mi>ω</mi><mrow><mi>L</mi><mo>⁢</mo><mi>j</mi></mrow><mn>2</mn></msubsup><msubsup><mi>ω</mi><mrow><mi>L</mi><mo>⁢</mo><mi>ν</mi></mrow><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nwhere $a_0$ is the cubic lattice parameter.\n\n\\begin{table}[!ht]\n\\caption{\\label{tab:Cnu} Calculated electron-phonon couplings in $eV^2$ \nbased on Eqns.(\\ref{eqn:gnu2}) and (\\ref{eqn:Cnu}).}\n\\begin{ruledtabular}\n\\begin{tabular}{ccc}\n        & STO                   & KTO \\\\\n\\hline\n  $C_1$ & $1.43 \\times 10^{-5}$ & $1.82 \\times 10^{-5}$ \\\\ \n  $C_2$ & $1.33 \\times 10^{-3}$ & $1.46 \\times 10^{-3}$ \\\\\n  $C_3$ & $6.77 \\times 10^{-3}$ & $7.50 \\times 10^{-3}$ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{table}\n\nNote that there are only three coupling constants listed in Table~\\ref{tab:Cnu}.\nOne of the LO modes in Table~\\ref{tab:optph} is not polar-- the mode with frequency 253 cm$^{-1}$\nappears both in the LO and TO sectors, and since it is nonpolar, it \ndoes not split up. The constants $C_{\\nu}$ are enumerated in order of increasing \nLO mode frequency. The electron-phonon couplings reported here for \nSTO are lower than those reported in Ref~\\onlinecite{sto-us}. This is due to the fact \nthat the electron-phonon coupling constant used in Ref~\\onlinecite{sto-us} was\nonly valid for the case of one LO mode, overestimating their strength \nwhen three modes were present.  \n\n\nThe coupling constants listed in Table~\\ref{tab:Cnu} are also\nin agreement with previous results in literature available for STO~\\cite{polaron-devreese}. \nFor comparison, we computed values of $C_{\\nu}$ resulting from\nthe parameters reported in Ref~\\onlinecite{polaron-devreese}. Using the \ndimensionless constants $\\alpha_{\\nu}$, experimental phonon frequencies,\nand the band mass of $0.81\\, m_e$, from Ref~\\onlinecite{polaron-devreese},\none obtains:\n$C_1 = 1.26 \\times 10^{-5}\\, eV^2$, $C_2 = 1.25 \\times 10^{-3}\\, eV^2$ and\n$C_3 = 9.50 \\times 10^{-3}\\, eV^2$. \nThe first two coupling constants are in good agreement with our \nresults for STO in Table~\\ref{tab:Cnu}. Our constant $C_3$\nis slightly lower than that of  Ref~\\onlinecite{polaron-devreese}. \nThe effective mass\nenters into the definition of the dimensionless constants $\\alpha_{\\nu}$\ndefined in Ref~\\onlinecite{polaron-devreese}, \nbut cancels out when $C_{\\nu}$ are calculated, so its value does not have any effect.\nThe differences between our results and that of Ref~\\onlinecite{polaron-devreese} come from the fact that we use calculated phonon\nfrequencies and dielectric constants instead of experimental values. \n\n\nUsing Fermi's golden rule, one can write the scattering rate of electrons \nin the state $\\psi_{n {\\bf k}}$ as~\\cite{mahan}\n\n\\begin{eqnarray}\n&& \\tau_{n {\\bf k}}^{-1} = \\frac{2\\pi}{\\hbar}\\, \\sum_{{\\bf q} \\nu, m}\\, \\vert g_{{\\bf q} \\nu} \\vert^2\\, \\times\n    \\nonumber\\\\\n&& \\quad \\Big\\{ \\left( n_{{\\bf q} \\nu} + f_{m, {\\bf k+q}} \\right)\\, \\delta\\left( \\epsilon_{m, {\\bf k+q}} - \\epsilon_{n {\\bf k}} - \\hbar \\omega_{L \\nu} \\right)\n  \\nonumber\\\\\n&& \\quad + \\left( 1 + n_{{\\bf q} \\nu} - f_{m, {\\bf k+q}} \\right)\\, \\delta\\left( \\epsilon_{m, {\\bf k+q}} - \\epsilon_{n {\\bf k}} + \\hbar \\omega_{L \\nu} \\right)\n\\Big\\}, \\label{eqn:tau}\n\\end{eqnarray}\n\nwhere $\\epsilon_{n {\\bf k}}$ are electron energies, $\\hbar \\omega_{L \\nu}$ are LO phonon energies,\n$n_{{\\bf q} \\nu}$ and $f_{m, {\\bf k+q}}$ are phonon and electron occupation factors described by Bose-Einstein and Fermi-Dirac\ndistributions, respectively. More precisely, the rate in Eqn. (\\ref{eqn:tau}) corresponds to the quasiparticle relaxation rate for electrons\ninteracting with LO phonons, and the transport rate contains extra band-velocity factors~\\cite{mahan}. However, recent studies\n have shown that these factors do not lead to significant changes in the calculated transport properties~\\cite{wuli,sto-us},\ntherefore we use the form in Eqn.(\\ref{eqn:tau}) for brevity.\n\nIn Fig.~\\ref{fig:tauBZ} we show the scattering rates $\\tau_{n {\\bf k}}^{-1}$ along $\\Gamma$-X and $\\Gamma$-M. \nThe rates for the three t$_{2g}$-derived conduction bands in KTO are shown.\n\nEach of the three conduction bands depicted represents a doubly degenerate state. \nFor all the conduction bands, the rate initially decreases away from $\\Gamma$, and then \nraises again towards the middle of the zone. \n\n\n\n\n\n\n\n\n\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{tauBZ-spc.eps}\n\\caption{\\label{fig:tauBZ} Electron-phonon scattering rate $\\tau^{-1}_{n {\\bf k}}$ calculated \nalong $\\Gamma$-X and $\\Gamma$-M for the three conduction bands at 300 K and $n=10^{20} \\rm{cm}^{-3}$.}\n\\end{figure}\n\n\nThe dependence of the scattering rates on electron density can be obtained by defining the following quantity\n\n\n", "itemtype": "equation", "pos": 14984, "prevtext": "\n\nwhere N is the number of LO/TO modes, $\\omega_{L \\nu}$ are LO mode frequencies,\n$\\omega_{T \\nu}$ are TO mode frequencies, V$_{\\rm cell}$ is the unit cell volume,\nand $\\epsilon_{\\infty}$ is the electronic dielectric constant. \nThis equation is obtained using the electron-phonon Hamiltonian \nin Ref.~\\onlinecite{toyozawa} and the Lyddane-Sachs-Teller (LST) relation\n$\\epsilon(\\omega) = \\epsilon_{\\infty}\\, \\prod_{j=1}^{N}\\, (\\omega^2-\\omega_{L,j}^2)/(\\omega^2-\\omega_{T,j}^2)$.\n\nIn this expression,\nthe dispersion of the optical phonon frequencies are ignored and in our calculations,\nwe use their value at the zone center. Alternative formulations of \nthe LO phonon coupling based on Born effective charges, which take into account their full dispersion,\nhave also been discussed in the literature~\\cite{calandra-ep,giustino-ep}.  \n\n\n The calculated electron-phonon coupling elements are listed in Table~\\ref{tab:Cnu}.  Here, we define \n\n\n", "index": 3, "text": "\\begin{equation}\nC_{\\nu} = \\left(\\frac{a_0}{2\\pi}\\right)^2\\, q^2\\, \\vert g_{{\\bf q} \\nu} \\vert^2,  \\label{eqn:Cnu}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"C_{\\nu}=\\left(\\frac{a_{0}}{2\\pi}\\right)^{2}\\,q^{2}\\,|g_{{\\bf q}\\nu}|^{2},\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mi>ν</mi></msub><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><msub><mi>a</mi><mn>0</mn></msub><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>q</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><msub><mi>g</mi><mrow><mi>𝐪</mi><mo>⁢</mo><mi>ν</mi></mrow></msub><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nwhere $D_n(E_F) = \\sum_{\\bf k}  \\delta( E_f - \\epsilon_{n {\\bf k}} )$ is the density of states\nat the Fermi level. $D_n \\tau^{-1}_n(E_F)$ represent the scattering rate for each band weighted \nby the density of states (it is dimensionless when $\\tau^{-1}$ is represented in units of energy). \nSince the scattering rate near Fermi level \ndetermines the transport properties, (see Eqns. (\\ref{eqn:int})), $D_n \\tau^{-1}_n(E_F)$ represents a measure \nof the strength of electron-phonon scattering for each band. \n\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.4\\textwidth]{tauEf-KTOc.eps}\n\\includegraphics[width=0.4\\textwidth]{tauEf-KTOnc.eps}\n\\caption{\\label{fig:tauEf} Electron-phonon scattering rates in KTO weighted by the density of states\nat the Fermi level for (a) collinear and (b) noncollinear calculation as a function of\nelectron density at 300 K.}\n\\end{figure}\n\n\nThe weighted scattering rates at the Fermi level for each of the conduction bands are shown in Fig.~\\ref{fig:tauEf}.\nThe lowest lying band (i.e. band 1) always has the highest rate, as a result of the enhancement \nin the density of states, since this band is the less dispersive among the three. Comparing the collinear and noncollinear\ncalculations, we observe that inclusion of spin-orbit coupling reduces the effective rate at E$_F$ significantly. \nThis is due to two factors: \n\ni) Since the highest lying band is pushed up in energy by 0.4 eV, electrons residing in the two lower lying \nbands cannot scatter via LO phonons to this band (and vice versa), reducing the available scattering channels. The spin-orbit \nsplitting is much larger than the maximum LO phonon energy (around 0.1 eV), and as a result the energy conserving delta\nfunctions in Eq.(\\ref{eqn:tau}) vanish for inter-band transitions involving the split-off band. \n\nii) Collinear spin calculations result in less dispersive bands resulting in higher density of states,\nas can be seen in Fig.~\\ref{fig:nef}.\nThis effect has also been observed for effective band masses near the zone center~\\cite{sto-hse-bs}. \n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{nef_all-n.eps}\n\\caption{\\label{fig:nef} Densities of states at the Fermi level. For KTO,\nboth collinear and noncollinear calculations are displayed.}\n\\end{figure}\n\nThe inset in Fig.~\\ref{fig:tauEf}(b) shows that the split-off band (band 3) has significantly smaller effective scattering\nrate at E$_F$ compared to the collinear case in Fig.~\\ref{fig:tauEf}(a). This is due to the fact that the Fermi energies for the\nconsidered electron densities are much lower than the split-off band energies, leading to a reduction of its density of states. \nThe overall reduction of scattering rates when spin-orbit coupling is strong has in fact been proposed before~\\cite{sto-us} and\nKTO serves as an example for this behavior.\n\n\\section{\\label{sec:tr}Transport Integrals}\n\nFor calculation of transport coefficients, we compute the following two integrals:\n\n\n\\begin{eqnarray}\n&& I^{(1)}_{\\alpha\\, \\beta} = \\frac{1}{V_{\\rm cell}}\\, \\sum_{n, {\\bf k}}\\,\n  \\tau_{n {\\bf k}}\\, \\left( - \\frac{\\partial f_{n {\\bf k}}}{\\partial \\epsilon_{n {\\bf k}}} \\right)\\,\n  v_{n {\\bf k}, \\alpha}\\, v_{n {\\bf k}, \\beta} \\nonumber\\\\\n\n&& I^{(2)}_{\\alpha\\, \\beta} = \\frac{1}{V_{\\rm cell}}\\, \\sum_{n, {\\bf k}}\\,\n  \\tau_{n {\\bf k}}\\, \\left( - \\frac{\\partial f_{n {\\bf k}}}{\\partial \\epsilon_{n {\\bf k}}} \\right)\\,\n  \\left( \\epsilon_{n {\\bf k}} - E_F \\right) \\, v_{n {\\bf k}, \\alpha}\\, v_{n {\\bf k}, \\beta}. \\nonumber\\\\\n\\label{eqn:int}\n\\end{eqnarray}\n\nIn terms of these integrals, the conductivity ($\\sigma$) and Seebeck ($S$) tensors are given by\n\n\n", "itemtype": "equation", "pos": 19606, "prevtext": "\n\nwhere $a_0$ is the cubic lattice parameter.\n\n\\begin{table}[!ht]\n\\caption{\\label{tab:Cnu} Calculated electron-phonon couplings in $eV^2$ \nbased on Eqns.(\\ref{eqn:gnu2}) and (\\ref{eqn:Cnu}).}\n\\begin{ruledtabular}\n\\begin{tabular}{ccc}\n        & STO                   & KTO \\\\\n\\hline\n  $C_1$ & $1.43 \\times 10^{-5}$ & $1.82 \\times 10^{-5}$ \\\\ \n  $C_2$ & $1.33 \\times 10^{-3}$ & $1.46 \\times 10^{-3}$ \\\\\n  $C_3$ & $6.77 \\times 10^{-3}$ & $7.50 \\times 10^{-3}$ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{table}\n\nNote that there are only three coupling constants listed in Table~\\ref{tab:Cnu}.\nOne of the LO modes in Table~\\ref{tab:optph} is not polar-- the mode with frequency 253 cm$^{-1}$\nappears both in the LO and TO sectors, and since it is nonpolar, it \ndoes not split up. The constants $C_{\\nu}$ are enumerated in order of increasing \nLO mode frequency. The electron-phonon couplings reported here for \nSTO are lower than those reported in Ref~\\onlinecite{sto-us}. This is due to the fact \nthat the electron-phonon coupling constant used in Ref~\\onlinecite{sto-us} was\nonly valid for the case of one LO mode, overestimating their strength \nwhen three modes were present.  \n\n\nThe coupling constants listed in Table~\\ref{tab:Cnu} are also\nin agreement with previous results in literature available for STO~\\cite{polaron-devreese}. \nFor comparison, we computed values of $C_{\\nu}$ resulting from\nthe parameters reported in Ref~\\onlinecite{polaron-devreese}. Using the \ndimensionless constants $\\alpha_{\\nu}$, experimental phonon frequencies,\nand the band mass of $0.81\\, m_e$, from Ref~\\onlinecite{polaron-devreese},\none obtains:\n$C_1 = 1.26 \\times 10^{-5}\\, eV^2$, $C_2 = 1.25 \\times 10^{-3}\\, eV^2$ and\n$C_3 = 9.50 \\times 10^{-3}\\, eV^2$. \nThe first two coupling constants are in good agreement with our \nresults for STO in Table~\\ref{tab:Cnu}. Our constant $C_3$\nis slightly lower than that of  Ref~\\onlinecite{polaron-devreese}. \nThe effective mass\nenters into the definition of the dimensionless constants $\\alpha_{\\nu}$\ndefined in Ref~\\onlinecite{polaron-devreese}, \nbut cancels out when $C_{\\nu}$ are calculated, so its value does not have any effect.\nThe differences between our results and that of Ref~\\onlinecite{polaron-devreese} come from the fact that we use calculated phonon\nfrequencies and dielectric constants instead of experimental values. \n\n\nUsing Fermi's golden rule, one can write the scattering rate of electrons \nin the state $\\psi_{n {\\bf k}}$ as~\\cite{mahan}\n\n\\begin{eqnarray}\n&& \\tau_{n {\\bf k}}^{-1} = \\frac{2\\pi}{\\hbar}\\, \\sum_{{\\bf q} \\nu, m}\\, \\vert g_{{\\bf q} \\nu} \\vert^2\\, \\times\n    \\nonumber\\\\\n&& \\quad \\Big\\{ \\left( n_{{\\bf q} \\nu} + f_{m, {\\bf k+q}} \\right)\\, \\delta\\left( \\epsilon_{m, {\\bf k+q}} - \\epsilon_{n {\\bf k}} - \\hbar \\omega_{L \\nu} \\right)\n  \\nonumber\\\\\n&& \\quad + \\left( 1 + n_{{\\bf q} \\nu} - f_{m, {\\bf k+q}} \\right)\\, \\delta\\left( \\epsilon_{m, {\\bf k+q}} - \\epsilon_{n {\\bf k}} + \\hbar \\omega_{L \\nu} \\right)\n\\Big\\}, \\label{eqn:tau}\n\\end{eqnarray}\n\nwhere $\\epsilon_{n {\\bf k}}$ are electron energies, $\\hbar \\omega_{L \\nu}$ are LO phonon energies,\n$n_{{\\bf q} \\nu}$ and $f_{m, {\\bf k+q}}$ are phonon and electron occupation factors described by Bose-Einstein and Fermi-Dirac\ndistributions, respectively. More precisely, the rate in Eqn. (\\ref{eqn:tau}) corresponds to the quasiparticle relaxation rate for electrons\ninteracting with LO phonons, and the transport rate contains extra band-velocity factors~\\cite{mahan}. However, recent studies\n have shown that these factors do not lead to significant changes in the calculated transport properties~\\cite{wuli,sto-us},\ntherefore we use the form in Eqn.(\\ref{eqn:tau}) for brevity.\n\nIn Fig.~\\ref{fig:tauBZ} we show the scattering rates $\\tau_{n {\\bf k}}^{-1}$ along $\\Gamma$-X and $\\Gamma$-M. \nThe rates for the three t$_{2g}$-derived conduction bands in KTO are shown.\n\nEach of the three conduction bands depicted represents a doubly degenerate state. \nFor all the conduction bands, the rate initially decreases away from $\\Gamma$, and then \nraises again towards the middle of the zone. \n\n\n\n\n\n\n\n\n\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{tauBZ-spc.eps}\n\\caption{\\label{fig:tauBZ} Electron-phonon scattering rate $\\tau^{-1}_{n {\\bf k}}$ calculated \nalong $\\Gamma$-X and $\\Gamma$-M for the three conduction bands at 300 K and $n=10^{20} \\rm{cm}^{-3}$.}\n\\end{figure}\n\n\nThe dependence of the scattering rates on electron density can be obtained by defining the following quantity\n\n\n", "index": 5, "text": "\\begin{equation}\nD_n\\, \\tau_n^{-1}(E_F) \\equiv \\sum_{\\bf k}\\, \\delta( E_f - \\epsilon_{n {\\bf k}} )\\, \\tau_{n {\\bf k}}^{-1}\n\\label{eqn:Dtau}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"D_{n}\\,\\tau_{n}^{-1}(E_{F})\\equiv\\sum_{\\bf k}\\,\\delta(E_{f}-\\epsilon_{n{\\bf k}%&#10;})\\,\\tau_{n{\\bf k}}^{-1}\" display=\"block\"><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>D</mi><mi>n</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>τ</mi><mi>n</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mpadded width=\"+1.7pt\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>𝐤</mi></munder></mpadded><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>f</mi></msub><mo>-</mo><msub><mi>ϵ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>τ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nwhere E$_F$ is the Fermi energy, $\\alpha, \\beta, \\nu$ are cartesian indices (repeated indices are summed over), and\nthe factor 2 accounts for the spin (in case of the noncollinear calculation, the factor 2 is not included\nand the band indices $n$ also contain the total angular momentum quantum number $j=l \\pm 1/2$). \nThe band velocities $v_{n {\\bf k}}$ are defined as\n\n\n", "itemtype": "equation", "pos": 23383, "prevtext": "\n\nwhere $D_n(E_F) = \\sum_{\\bf k}  \\delta( E_f - \\epsilon_{n {\\bf k}} )$ is the density of states\nat the Fermi level. $D_n \\tau^{-1}_n(E_F)$ represent the scattering rate for each band weighted \nby the density of states (it is dimensionless when $\\tau^{-1}$ is represented in units of energy). \nSince the scattering rate near Fermi level \ndetermines the transport properties, (see Eqns. (\\ref{eqn:int})), $D_n \\tau^{-1}_n(E_F)$ represents a measure \nof the strength of electron-phonon scattering for each band. \n\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.4\\textwidth]{tauEf-KTOc.eps}\n\\includegraphics[width=0.4\\textwidth]{tauEf-KTOnc.eps}\n\\caption{\\label{fig:tauEf} Electron-phonon scattering rates in KTO weighted by the density of states\nat the Fermi level for (a) collinear and (b) noncollinear calculation as a function of\nelectron density at 300 K.}\n\\end{figure}\n\n\nThe weighted scattering rates at the Fermi level for each of the conduction bands are shown in Fig.~\\ref{fig:tauEf}.\nThe lowest lying band (i.e. band 1) always has the highest rate, as a result of the enhancement \nin the density of states, since this band is the less dispersive among the three. Comparing the collinear and noncollinear\ncalculations, we observe that inclusion of spin-orbit coupling reduces the effective rate at E$_F$ significantly. \nThis is due to two factors: \n\ni) Since the highest lying band is pushed up in energy by 0.4 eV, electrons residing in the two lower lying \nbands cannot scatter via LO phonons to this band (and vice versa), reducing the available scattering channels. The spin-orbit \nsplitting is much larger than the maximum LO phonon energy (around 0.1 eV), and as a result the energy conserving delta\nfunctions in Eq.(\\ref{eqn:tau}) vanish for inter-band transitions involving the split-off band. \n\nii) Collinear spin calculations result in less dispersive bands resulting in higher density of states,\nas can be seen in Fig.~\\ref{fig:nef}.\nThis effect has also been observed for effective band masses near the zone center~\\cite{sto-hse-bs}. \n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{nef_all-n.eps}\n\\caption{\\label{fig:nef} Densities of states at the Fermi level. For KTO,\nboth collinear and noncollinear calculations are displayed.}\n\\end{figure}\n\nThe inset in Fig.~\\ref{fig:tauEf}(b) shows that the split-off band (band 3) has significantly smaller effective scattering\nrate at E$_F$ compared to the collinear case in Fig.~\\ref{fig:tauEf}(a). This is due to the fact that the Fermi energies for the\nconsidered electron densities are much lower than the split-off band energies, leading to a reduction of its density of states. \nThe overall reduction of scattering rates when spin-orbit coupling is strong has in fact been proposed before~\\cite{sto-us} and\nKTO serves as an example for this behavior.\n\n\\section{\\label{sec:tr}Transport Integrals}\n\nFor calculation of transport coefficients, we compute the following two integrals:\n\n\n\\begin{eqnarray}\n&& I^{(1)}_{\\alpha\\, \\beta} = \\frac{1}{V_{\\rm cell}}\\, \\sum_{n, {\\bf k}}\\,\n  \\tau_{n {\\bf k}}\\, \\left( - \\frac{\\partial f_{n {\\bf k}}}{\\partial \\epsilon_{n {\\bf k}}} \\right)\\,\n  v_{n {\\bf k}, \\alpha}\\, v_{n {\\bf k}, \\beta} \\nonumber\\\\\n\n&& I^{(2)}_{\\alpha\\, \\beta} = \\frac{1}{V_{\\rm cell}}\\, \\sum_{n, {\\bf k}}\\,\n  \\tau_{n {\\bf k}}\\, \\left( - \\frac{\\partial f_{n {\\bf k}}}{\\partial \\epsilon_{n {\\bf k}}} \\right)\\,\n  \\left( \\epsilon_{n {\\bf k}} - E_F \\right) \\, v_{n {\\bf k}, \\alpha}\\, v_{n {\\bf k}, \\beta}. \\nonumber\\\\\n\\label{eqn:int}\n\\end{eqnarray}\n\nIn terms of these integrals, the conductivity ($\\sigma$) and Seebeck ($S$) tensors are given by\n\n\n", "index": 7, "text": "\\begin{equation}\n\\sigma_{\\alpha \\beta} = 2\\, e^2\\, I^{(1)}_{\\alpha \\beta} \\,\\,\\, , \\,\\,\\,\nS_{\\alpha \\beta} = -\\frac{1}{e T}\\, I^{(1) -1}_{\\alpha \\nu}\\, I^{(2)}_{\\nu \\beta}, \\label{eqn:tr}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\alpha\\beta}=2\\,e^{2}\\,I^{(1)}_{\\alpha\\beta}\\,\\,\\,,\\,\\,\\,S_{\\alpha%&#10;\\beta}=-\\frac{1}{eT}\\,I^{(1)-1}_{\\alpha\\nu}\\,I^{(2)}_{\\nu\\beta},\" display=\"block\"><mrow><mrow><mrow><msub><mi>σ</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msub><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+5.1pt\"><msubsup><mi>I</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mpadded></mrow></mrow><mo rspace=\"7.6pt\">,</mo><mrow><msub><mi>S</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msub><mo>=</mo><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><mrow><mi>e</mi><mo>⁢</mo><mi>T</mi></mrow></mfrac></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msubsup><mi>I</mi><mrow><mi>α</mi><mo>⁢</mo><mi>ν</mi></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mpadded><mo>⁢</mo><msubsup><mi>I</mi><mrow><mi>ν</mi><mo>⁢</mo><mi>β</mi></mrow><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nIn this study, we compute band velocities in a very dense grid (60$\\times$60$\\times$60) using finite differences. \nFor the cases of KTO and STO, the conduction band structure is rather simple (i.e. no band crossings), therefore\nthis approach leads to accurate band velocities. In more complex band structures, it is necessary to use\ninterpolation techniques for accurate calculations~\\cite{boltztrap,boltzwann}.\nSince KTO and STO are cubic, the conductivity and the Seebeck tensors are\ndiagonal with equal entries. Therefore, we will refer to the scalar quantities of conductivity ($\\sigma$) and Seebeck coefficient (S)\nfrom now on. The mobility is defined through the ratio of the conductivity to the electron density as \n\n", "itemtype": "equation", "pos": 23958, "prevtext": "\n\nwhere E$_F$ is the Fermi energy, $\\alpha, \\beta, \\nu$ are cartesian indices (repeated indices are summed over), and\nthe factor 2 accounts for the spin (in case of the noncollinear calculation, the factor 2 is not included\nand the band indices $n$ also contain the total angular momentum quantum number $j=l \\pm 1/2$). \nThe band velocities $v_{n {\\bf k}}$ are defined as\n\n\n", "index": 9, "text": "\\begin{equation}\nv_{n {\\bf k}, \\alpha} \\equiv \\frac{1}{\\hbar}\\, \\frac{\\partial \\epsilon_{n {\\bf k}}}{\\partial k_{\\alpha}}.\n\\label{eqn:v}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"v_{n{\\bf k},\\alpha}\\equiv\\frac{1}{\\hbar}\\,\\frac{\\partial\\epsilon_{n{\\bf k}}}{%&#10;\\partial k_{\\alpha}}.\" display=\"block\"><mrow><mrow><msub><mi>v</mi><mrow><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow><mo>,</mo><mi>α</mi></mrow></msub><mo>≡</mo><mrow><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><mi mathvariant=\"normal\">ℏ</mi></mfrac></mpadded><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>ϵ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>k</mi><mi>α</mi></msub></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nUsing the scattering rates computed from Eqn.(\\ref{eqn:tau}), based on the electron-phonon couplings\nof Eqn.(\\ref{eqn:gnu2}), we calculate the transport integrals in Eqn.(\\ref{eqn:int}) for KTO and STO. For KTO,\nwe perform the integration both for collinear and noncollinear band structures while for STO we only use the\ncollinear band structure.  We have explicitly checked that the noncollinear calculations in STO lead to\nonly negligible changes in the transport integrals. In the following two subsections, we report the the room-temperature \nmobility and Seebeck coefficients.\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{Mu_all-n.eps}\n\\caption{\\label{fig:muall} Calculated mobilities of STO and KTO at 300K. For KTO,\nboth collinear and noncollinear calculations are displayed. } \n\\end{figure}\n\n\n\\subsection{Electron mobilities}\n\nFig.~\\ref{fig:muall} shows the calculated mobilities as a function of electron concentration at 300 K. \nKTO with spin-orbit interactions taken into account (i.e. noncollinear) displays the highest mobility\nacross the range of electron densities we have considered, whereas the mobilities in STO are significantly lower\n~\\footnote{ In a previous work~\\cite{sto-us}, the mobilities calculated at room temperature for \nSTO are much smaller than the ones reported here. There are two reasons for this difference: 1)\nIn Ref.~\\onlinecite{sto-us}, scattering rates are approximated with their values at the zone center,\n2) The electron-phonon coupling was described by a different formula, which was only \nvalid only for the case of a single LO mode. Instead, the correct formula is used in this paper.}.\nAs discussed previously, inclusion of spin-orbit splitting reduces the effective scattering rate, \nleading to an increase in the mobilities, which is the reason for higher values in the noncollinear calculation.\n\nIn the case of the collinear calculations, where the bands are not split due to spin-orbit coupling, \nthe mobilities are higher in KTO than in STO because the higher band velocities.\nSince Ta 5$d$ orbitals lead to wider conduction bands compared to\nthose of Ti 3$d$, such an increase is expected. These findings are in agreement with the experimental\nobservation of higher room-temperature mobilities in KTO compared to STO~\\cite{kto-mobility,kto-S}.\n\n\nWe note that our calculations overestimate the observed room temperature mobilities of both STO, which is less than 10 cm$^2$/Vs \n~\\cite{frederikse-sto,tufte-sto,stemmer-sto-mobility}, and KTO, which is around 30 cm$^2$/Vs~\\cite{kto-mobility},\nfor a range of electron concentrations.\nThis is due to the fact that our calculations contain only LO phonon scattering mechanism, \nand ignores others such as impurities~\\cite{Spinelli-STO}, TO-phonon~\\cite{Jena-STO} and electron-electron scattering~\\cite{stemmer-sto-T2}.\n\nFurther insight into the behavior of mobility shown in Fig.(\\ref{fig:muall}) can be gained\nby calculating the average values of the Fermi velocities, which we define as\n\n\n", "itemtype": "equation", "pos": 24834, "prevtext": "\n\nIn this study, we compute band velocities in a very dense grid (60$\\times$60$\\times$60) using finite differences. \nFor the cases of KTO and STO, the conduction band structure is rather simple (i.e. no band crossings), therefore\nthis approach leads to accurate band velocities. In more complex band structures, it is necessary to use\ninterpolation techniques for accurate calculations~\\cite{boltztrap,boltzwann}.\nSince KTO and STO are cubic, the conductivity and the Seebeck tensors are\ndiagonal with equal entries. Therefore, we will refer to the scalar quantities of conductivity ($\\sigma$) and Seebeck coefficient (S)\nfrom now on. The mobility is defined through the ratio of the conductivity to the electron density as \n\n", "index": 11, "text": "\\begin{equation}\n\\mu = \\frac{\\sigma}{n e}. \\label{eqn:mob}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\mu=\\frac{\\sigma}{ne}.\" display=\"block\"><mrow><mrow><mi>μ</mi><mo>=</mo><mfrac><mi>σ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>e</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06205.tex", "nexttext": "\n\nwhere the index $n$ runs over the conduction bands.\nShown in Fig.~\\ref{fig:v2f} are $v_F$, which have higher values in KTO compared to STO.\nWhile KTO in the noncollinear calculation has a higher band-width (as can seen in Figs.~\\ref{fig:bands} and ~\\ref{fig:nef}),\nthe averaged values of the Fermi velocities are slightly lower than that of KTO in the collinear calculation.\nThis is most probably due to the highly non-parabolic Fermi surface of KTO, which has high and low \nvelocity regions, averaging out to a similar numerical value for both collinear and non-collinear calculations. \nInstead, lower scattering rates in the noncollinear calculations lead to the \nenhancement of mobilities as seen in Fig.~\\ref{fig:muall}. \n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{v2_all-n.eps}\n\\caption{\\label{fig:v2f} Averaged Fermi velocities (rescaled with the lattice parameter $a_0$). For KTO,\nboth collinear and noncollinear calculations are displayed. }\n\\end{figure}\n\n\nAn additional feature which deserves attention is the increase in mobility with increasing electron density $n$\nas seen in Fig.~\\ref{fig:muall}. This may seem counterintuitive,\nsince the effective scattering rates at E$_F$ also increases with $n$ (see Fig.~\\ref{fig:tauEf}). However, band velocities $v_{n {\\bf k}}$\nincrease as a function of electron energy in the conduction band.  \nThe increase in $v_{n {\\bf k}}^2$ dominates over the increase in $\\tau^{-1}_{n {\\bf k}}$\nleading to an overall increase of the mobility as a function of $n$.\n\n\\subsection{Seebeck coefficients}\n\nFig.~\\ref{fig:Sall} shows the calculated Seebeck coefficients as a function of electron concentration at 300 K.\nThe noncollinear calculation for KTO displays the lowest Seebeck (absolute value) coefficients across the range\nof electron densities we have considered. STO on the other hand displays the highest Seebeck coefficients, with\ncollinear KTO displaying slightly lower values. This behavior can be understood through the dependence of the Seebeck coefficient on\nE$_F$. The Seebeck coefficient is inversely proportional to E$_F$~\\cite{mahan,seebeck-sto,seebeck-stokto} (for a parabolic band approximation in a \nmetal, it is inversely proportional to E$_F$). For a given electron concentration $n$, E$_F$ is lowest for STO, \nsince its conduction band width is smaller than KTO, which in turn leads to a higher Seebeck coefficient $|S|$.\nThe difference between collinear and noncollinear calculations in KTO mainly results from the effective number\nof conduction bands. For the noncollinear calculation, the split-up band is higher in energy, leading to an effective\n2-conduction-band system (see Fig.~\\ref{fig:bands}(b)). For a given $n$, E$_F$ increases when the number of conduction bands decrease; when there are \nless bands which are close in energy, electrons occupy higher lying bands. Thus, $|S|$ in the noncollinear\ncase is lower than that of the collinear one, due to the reduction of the number of conduction bands~\\cite{seebeck-stokto}.\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{S_all-n.eps}\n\\caption{\\label{fig:Sall} Calculated Seebeck coefficients of STO and KTO at 300K. For KTO,\nboth collinear and noncollinear calculations are displayed. }\n\\end{figure}\n\nCompared to experimental results, our calculations slightly underestimate the Seebeck coefficients.\nFor STO, experiments~\\cite{seebeck-sto} yield $147\\, < |S| < 380$ $\\mu V/K$ in the range $10^{21} > n > 8.8 \\times 10^{19}$ cm$^3$,\nwhile our calculations yield $80\\, < |S| < 220$ $\\mu V/K$ in the range  $10^{21} > n >  10^{20}$ cm$^3$.\n\nSimilarly for KTO, experiments~\\cite{kto-S} yield $200\\, < |S| < 460$ $\\mu V/K$ in the range\n$5.4 \\times 10^{18} > n > 1.4 \\times 10^{19}$ cm$^3$, while\nour calculations yield $138\\, < |S| < 489$ $\\mu V/K$ in the range $10^{20} > n > 10^{18}$ cm$^3$.\n\nThe underestimation of the Seebeck coefficient is most probably related to the overestimation of the \nconduction band-widths in LDA, thus leading to higher E$_F$ which reduces $|S|$~\\cite{seebeck-stokto}. In addition, there may be\nsecond order contributions to the Seebeck coefficient from coupling to phonons (i.e. phonon drag effect) missing in our calculations,\nalthough these are most significant at lower temperatures~\\cite{sto-ph-drag,stemmer-new}.\n\nThe changes in the electron-phonon scattering rates do not lead to a significant change in the calculated\nSeebeck coefficients, as we will discuss in the next section. This is in contrast with the calculations\nof mobility presented in the previous subsection, which display a strong dependence on the \nvalues of the scattering rates. The Seebeck coefficient is a ratio\nof two transport integrals (see Eqns. (\\ref{eqn:tr})). This leads to an exact cancellation \nof the scattering rate when it is taken as a constant. For the case of the scattering rate which is\nnot constant, this cancellation is not valid. However, our calculations show that the \ndifference between the calculations taking into account the full scattering rate $\\tau_{n {\\bf k}}^{-1}$\nand a constant rate is very small for case of room temperature Seebeck coefficients. \n\n\\section{\\label{sec:tauk}Constant $\\tau$ vs. $\\tau_{n {\\bf k}}$}\n\nOne of the most common approximations in transport calculations is to assume that the scattering rate \nappearing in Eqns.(\\ref{eqn:int}) is constant~\\cite{boltztrap,boltztrap}. \nFor transport coefficients which are ratios of two transport integrals (such as the Seebeck coefficient) \nthe dependence on the constant scattering rate disappears.\n\nHowever, for transport coefficients such as mobility,\nthe scattering rate is usually fitted to an experimental value. Here, we demonstrate that while a constant scattering rate\nprovides reasonable Seebeck coefficients, mobilities are not predicted accurately across a range of \nelectron densities at 300 K.  \n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.4\\textwidth]{Mu_KTO-nc-n.eps}\n\\includegraphics[width=0.4\\textwidth]{S_KTO-nc-n.eps}\n\\caption{\\label{fig:MuSKTO} Calculated mobilities (a) and Seebeck coefficients (b) of KTO at 300K as a \nfunction of $n$ for a constant scattering time $\\tau_{\\Gamma}$\nand the full scattering time $\\tau_{n {\\bf k}}$. For comparison, mobilities calculated with $4 \\times \\tau_{\\Gamma}$ \nare also shown. }\n\\end{figure}\n\nIn order to compare constant scattering rate with full $k$-dependent scattering rate calculations\npresented in the previous section, we choose the constant scattering rate to be the band averaged \nvalue at the zone center ($\\tau_{\\Gamma}^{-1}$). The resulting mobilities using a constant scattering rate \nin comparison with the $k$-dependent scattering rate are shown in Fig.(\\ref{fig:MuSKTO} a) for \nthe noncollinear spin calculation at 300 K (for collinear KTO and STO, similar \nresults are obtained, which are not shown here). Also shown in Fig.(\\ref{fig:MuSKTO} a) are the\nmobilities calculated with constant $0.25\\, \\tau_{\\Gamma}^{-1}$ for comparison. As can be seen,\ncalculations with constant scattering rate have various problems: \n1)  The average value of the rate at the zone center underestimates the mobility and a larger value \nshould be used. \n2) While it is possible to obtain the mobility that results from $k$-dependent scattering rate using just a \nconstant rate, this constant number has to be chosen for each given electron density $n$. \n3) The dependence of mobility on $n$ is incorrectly predicted when a constant rate is \nused, since it results in decreasing mobility as a function of $n$, opposite to what \n$k$-dependent scattering rate yields. As a result, a constant rate not only leads to \na loss of predictability for mobilities (due to not being able to fix a single value for the rate), \nit also leads to incorrect qualitative behavior. \n\nOn the other hand, the Seebeck coefficients computed with a constant rate (which cancels out)\nare very close to ones that are computed with full $k$-dependent scattering rate as \ncan be seen in Fig.(\\ref{fig:MuSKTO} b). This is rather a nontrivial result, since the two transport integrals\nin Eqns.(\\ref{eqn:int}) are peaked at different regions in the Brillouin zone, where $\\tau_{n {\\bf k}}$ \nattains different values. In other words, even if we have approximated the integrals $I^{(n)}_{\\alpha \\beta}$\n(n=1,2) with a constant value where the integrands are peaked, the \nscattering times appearing in the numerator and denominator of $S$ will be different and there will be\nno cancellation. It is therefore interesting that a constant scattering rate works remarkably well\nfor predicting room-temperature Seebeck coefficients (assuming all the scattering being due to \nLO phonons) for KTO (and STO). One would expect a similar behavior in other perovskite oxides as well,\nthus justifying the use of constant scattering rates for the study of thermoelectric properties.\n\n\\section{\\label{sec:disc} Conclusion}\n\nIn this work, we have studied room-temperature transport properties of the cubic perovskites\nKTO and STO. The calculations for the transport properties were based on \nBoltzmann transport theory with relaxation time approximation. The relaxation times were\ncalculated using an analytical model for scattering of electrons and LO phonons. Our results\nhave shown that the superior mobility of KTO with respect to STO results from two main reasons:\n1) The larger band-width of Ta 5$d$-derived conduction bands in KTO than the Ti 3$d$ derived conduction\nbands in STO;\n2) Strong spin-orbit coupling in KTO leading to an effective 2-conduction-band system,\ncompared to the 3-conduction-band system in STO. Despite its larger mobility, KTO has lower Seebeck coefficients, \ndue to the fact that the effective number of conduction bands are smaller than in STO. \nWe have also compared calculations with constant scattering rate with calculations using\nthe full $k$-dependent scattering rate. While using a constant scattering rate is a widely\nused approximation in the literature, our results have shown that it results in loss of predictability\nfor calculations of mobility. Instead, for calculations of the Seebeck coefficient, a constant \nscattering rate gives almost the same results with full $k$-dependent scattering rate, \njustifying its use for thermal transport calculations in the literature. \nThe computational approach we have presented is rather efficient (compared to those\nbased on full electron-phonon coupling matrices obtained from DFPT), and results in good agreement\nwith experiments in predicting the relative transport coefficients of KTO and STO. Using\nour approach  to calculate transport coefficients on a large set of perovskite oxides can \nbe a basis to search materials with targeted properties for device applications.\n\n\\section{Acknowledgements}\n\nWe acknowledge support from the Center for Scientific Computing from the CNSI, MRL: an NSF MRSEC (DMR-1121053) and NSF CNS-0960316.\nThis work used the Extreme Science and Engineering Discovery Environment (XSEDE), which is supported by National Science Foundation grant number ACI-1053575. \nWe also thank D. M. Eagles for very useful discussions. \n\n\n\n\\bibliography{hj}\n\n\n", "itemtype": "equation", "pos": 27911, "prevtext": "\n\nUsing the scattering rates computed from Eqn.(\\ref{eqn:tau}), based on the electron-phonon couplings\nof Eqn.(\\ref{eqn:gnu2}), we calculate the transport integrals in Eqn.(\\ref{eqn:int}) for KTO and STO. For KTO,\nwe perform the integration both for collinear and noncollinear band structures while for STO we only use the\ncollinear band structure.  We have explicitly checked that the noncollinear calculations in STO lead to\nonly negligible changes in the transport integrals. In the following two subsections, we report the the room-temperature \nmobility and Seebeck coefficients.\n\n\\begin{figure}[!ht]\n\\includegraphics[width=0.45\\textwidth]{Mu_all-n.eps}\n\\caption{\\label{fig:muall} Calculated mobilities of STO and KTO at 300K. For KTO,\nboth collinear and noncollinear calculations are displayed. } \n\\end{figure}\n\n\n\\subsection{Electron mobilities}\n\nFig.~\\ref{fig:muall} shows the calculated mobilities as a function of electron concentration at 300 K. \nKTO with spin-orbit interactions taken into account (i.e. noncollinear) displays the highest mobility\nacross the range of electron densities we have considered, whereas the mobilities in STO are significantly lower\n~\\footnote{ In a previous work~\\cite{sto-us}, the mobilities calculated at room temperature for \nSTO are much smaller than the ones reported here. There are two reasons for this difference: 1)\nIn Ref.~\\onlinecite{sto-us}, scattering rates are approximated with their values at the zone center,\n2) The electron-phonon coupling was described by a different formula, which was only \nvalid only for the case of a single LO mode. Instead, the correct formula is used in this paper.}.\nAs discussed previously, inclusion of spin-orbit splitting reduces the effective scattering rate, \nleading to an increase in the mobilities, which is the reason for higher values in the noncollinear calculation.\n\nIn the case of the collinear calculations, where the bands are not split due to spin-orbit coupling, \nthe mobilities are higher in KTO than in STO because the higher band velocities.\nSince Ta 5$d$ orbitals lead to wider conduction bands compared to\nthose of Ti 3$d$, such an increase is expected. These findings are in agreement with the experimental\nobservation of higher room-temperature mobilities in KTO compared to STO~\\cite{kto-mobility,kto-S}.\n\n\nWe note that our calculations overestimate the observed room temperature mobilities of both STO, which is less than 10 cm$^2$/Vs \n~\\cite{frederikse-sto,tufte-sto,stemmer-sto-mobility}, and KTO, which is around 30 cm$^2$/Vs~\\cite{kto-mobility},\nfor a range of electron concentrations.\nThis is due to the fact that our calculations contain only LO phonon scattering mechanism, \nand ignores others such as impurities~\\cite{Spinelli-STO}, TO-phonon~\\cite{Jena-STO} and electron-electron scattering~\\cite{stemmer-sto-T2}.\n\nFurther insight into the behavior of mobility shown in Fig.(\\ref{fig:muall}) can be gained\nby calculating the average values of the Fermi velocities, which we define as\n\n\n", "index": 13, "text": "\\begin{equation}\nv^2_F \\equiv \\frac{\\sum_{n, {\\bf k}} \\delta (E_F - \\epsilon_{n {\\bf k}})\\, v_{n {\\bf k}}^2 }\n                     {\\sum_{n, {\\bf k}} \\delta (E_F - \\epsilon_{n {\\bf k}})},\n\\label{eqn:v2e}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"v^{2}_{F}\\equiv\\frac{\\sum_{n,{\\bf k}}\\delta(E_{F}-\\epsilon_{n{\\bf k}})\\,v_{n{%&#10;\\bf k}}^{2}}{\\sum_{n,{\\bf k}}\\delta(E_{F}-\\epsilon_{n{\\bf k}})},\" display=\"block\"><mrow><mrow><msubsup><mi>v</mi><mi>F</mi><mn>2</mn></msubsup><mo>≡</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>𝐤</mi></mrow></msub><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>F</mi></msub><mo>-</mo><msub><mi>ϵ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>v</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow><mn>2</mn></msubsup></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>𝐤</mi></mrow></msub><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>E</mi><mi>F</mi></msub><mo>-</mo><msub><mi>ϵ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]