[{"file": "1601.01250.tex", "nexttext": "\nwhere\n$m_c$ and $m_q$ are masses of the charm quark and the light quark, respectively.\n$p$ denotes a typical relative momentum between the two quarks, $r$ stands for the typical size of the hadron, and $\\sigma$ is the string tension of the potential between the two quarks. \nNote that we omit the Coulomb part of the potential since it will not change the following naive analysis, \nas can be seen in the explicit quark model computation of the next section. $C$ is a constant which is used to fit the total energy to the physical mass spectrum. \nFurthermore, we use $m_q$ as the reduced mass in the kinetic energy term, since $m_c$ is much larger than $m_q$.\n\n\nFor a rough estimation of the mass of the heavy-light meson, we first replace $r$ in Eq.~(\\ref{energy}) with $1/p$, and minimize the energy with respect to the typical moment $p$. \nThe minimization condition provides\n\n", "itemtype": "equation", "pos": 4531, "prevtext": "\n\n\\title{The mass of heavy-light mesons in a constituent quark picture with partially restored chiral symmetry }\n\n\\author{Aaron Park}\n\\email{aaron.park@yonsei.ac.kr}\n\\affiliation{Department of Physics and Institute of Physics and Applied Physics,\nYonsei University, Seoul 120-749, Korea}\n\n\\author{Philipp Gubler}\n\\email{pgubler@riken.jp}\n\\affiliation{ECT{$^\\ast$}, Villa Tambosi, 38123 Villazzano (Trento), Italy}\n\n\\author{Masayasu Harada}\n\\email{harada@hken.phys.nagoya-u.ac.jp}\n\\affiliation{Department of Physics,  Nagoya University, Nagoya, 464-8602, Japan}\n\n\\author{Su Houng Lee}\n\\email{suhoung@yonsei.ac.kr}\n\\affiliation{Department of Physics and Institute of Physics and Applied Physics,\nYonsei University, Seoul 120-749, Korea}\n\n\\author{Chiho Nonaka}\n\\email{nonaka@hken.phys.nagoya-u.ac.jp}\n\\affiliation{Kobayashi-Maskawa Institute for the Origin of Particles and the Universe,  Nagoya University, Nagoya, 464-8602, Japan}\n\\affiliation{Department of Physics,  Nagoya University, Nagoya, 464-8602, Japan}\n\n\\author{Woosung Park}\n\\email{diracdelta@hanmail.net}\n\\affiliation{Department of Physics and Institute of Physics and Applied Physics,\nYonsei University, Seoul 120-749, Korea}\n\n\n\\date{\\today}\n\n\n\\begin{abstract}\nWe probe effects of the partial chiral symmetry restoration to the mass of heavy-light mesons in a constituent quark model by changing the constituent quark mass of the light quark. \nDue to the competing effect between the quark mass and the linearly rising potential, whose contribution to the energy increases as the quark mass decreases, the heavy-light meson \nmass has a minimum value near the constituent quark mass typically used in the vacuum.  \nHence, the meson mass increases as one decreases the constituent quark mass consistent with recent QCD sum rule analyses, which show an increasing $D$ meson mass as the \nchiral order parameter decreases.  \n\\end{abstract}\n\\maketitle\n\n\n\\section{Introduction}\n\n\nInvestigating the relation between chiral symmetry breaking and physical observables has been the subject of great interest up to this date \nas these effects can be probed in \nheavy ion collisions and/or nuclear target experiments. \nThe restoration of chiral symmetry has been linked to vector meson masses, $\\sigma$ meson masses, the quenching of $f_\\pi$ and even to the $\\eta'$ \nmass  (see, e.g. Refs.~\\cite{Hatsuda:1986gu,Hatsuda:1991ez,Brown:1991kk,\nRapp:1999ej,Harada:2000kb,Hayano:2008vn,Leupold:2009kz,Lee:2013es,GublerOhtani:2014}). \n\n\nOf particular interest is the heavy-light quark meson  as it embodies both chiral symmetry breaking and heavy quark symmetry.  Recently, one of us in collaboration with other authors \nemployed QCD sum rules to show that the $D$ meson mass increases as the chiral symmetry is partially restored \\cite{Suzuki:2015est}. \nA qualitatively similar conclusion was obtained in Ref.~\\cite{Hilger} (see however Refs.~\\cite{Hayashigaki,Azizi,Wang} for other views). \nThese results from QCD sum rules are consistent with the results obtained in analyses using effective chiral models in \nRefs.~\\cite{Sasaki:2014asa,Suenaga2} which are based on the chiral partner structure proposed in Ref.~\\cite{heavy-partner}. \nAt a first glance, an increasing $D$ meson mass with a decreasing chiral parameter however \nseems counterintuitive. Within the naive heavy quark limit, the $D$ meson can be thought of as a heavy quark playing the role of a color source, \nwith a constituent quark around it, so that when chiral symmetry is partially restored, the light quark would become lighter making the $D$ meson also light.  \n\nHowever, as we will see, if confinement persists, the decreasing light quark will allow the light quark to probe larger distances and hence a higher confining energy inducing a \ncompetition between the kinetic term and the confinement term.   \nThe combined effect produces a minimum energy value for a certain constituent quark mass so that when the quark mass decreases below the minimum point, \nthe mass of the $D$ meson will increase.  In this note, we would like to highlight this effect and discuss why partial chiral symmetry restoration will not necessarily decrease the mass of the heavy-light system. \nWe will first try to understand this effect with the help of a simple argument and then confirm the validity of our claim in a realistic and more quantitative constituent quark model calculation. \n  \nIn the constituent quark model, the energy, or the mass, of a meson made of an anti-charm quark and a light quark can be roughly expressed as\n\n", "index": 1, "text": "\\begin{equation}\nE = m_c + m_q + \\frac{p^2}{2 m_q} + \\sigma r + C \\ ,\n\\label{energy}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"E=m_{c}+m_{q}+\\frac{p^{2}}{2m_{q}}+\\sigma r+C\\ ,\" display=\"block\"><mrow><mrow><mi>E</mi><mo>=</mo><mrow><msub><mi>m</mi><mi>c</mi></msub><mo>+</mo><msub><mi>m</mi><mi>q</mi></msub><mo>+</mo><mfrac><msup><mi>p</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msub><mi>m</mi><mi>q</mi></msub></mrow></mfrac><mo>+</mo><mrow><mi>σ</mi><mo>⁢</mo><mi>r</mi></mrow><mo>+</mo><mpadded width=\"+5pt\"><mi>C</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01250.tex", "nexttext": "\nwhich leads to the minimum energy as\n\n", "itemtype": "equation", "pos": 5510, "prevtext": "\nwhere\n$m_c$ and $m_q$ are masses of the charm quark and the light quark, respectively.\n$p$ denotes a typical relative momentum between the two quarks, $r$ stands for the typical size of the hadron, and $\\sigma$ is the string tension of the potential between the two quarks. \nNote that we omit the Coulomb part of the potential since it will not change the following naive analysis, \nas can be seen in the explicit quark model computation of the next section. $C$ is a constant which is used to fit the total energy to the physical mass spectrum. \nFurthermore, we use $m_q$ as the reduced mass in the kinetic energy term, since $m_c$ is much larger than $m_q$.\n\n\nFor a rough estimation of the mass of the heavy-light meson, we first replace $r$ in Eq.~(\\ref{energy}) with $1/p$, and minimize the energy with respect to the typical moment $p$. \nThe minimization condition provides\n\n", "index": 3, "text": "\\begin{equation}\np = \\left( \\sigma m_q \\right)^{1/3} \\ , \\label{rel-p}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"p=\\left(\\sigma m_{q}\\right)^{1/3}\\ ,\" display=\"block\"><mrow><mrow><mi>p</mi><mo>=</mo><mpadded width=\"+5pt\"><msup><mrow><mo>(</mo><mrow><mi>σ</mi><mo>⁢</mo><msub><mi>m</mi><mi>q</mi></msub></mrow><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01250.tex", "nexttext": "\nUsing a conventional value of $\\sigma = 0.2\\,(\\mbox{GeV})^2$, we plot the $m_q$-dependence of $E_{\\rm min}$ as a solid curve \nin Fig.~\\ref{fig1}. \nAs can be observed in the figure, $E_{\\rm min}$ takes a minimum value around $m_q \\simeq 0.3$\\,\\mbox{GeV}. \n \n\\begin{figure}[t!]\n  \\begin{center}\n         \\includegraphics[scale=0.8]{Fig1.eps}\n\\caption[]{The solid curve shows the $m_q$-dependence of $E_{\\rm min}$ according to Eq.\\,(\\ref{eq:Emin}) with $m_c+C=0.8$ GeV. \nThe red dots represent the $m_q$-dependence of the $D$ meson mass in the full constituent quark model.}\n\\label{fig1}\n  \\end{center}\n\\end{figure}\n\nSuppose that $m_q \\simeq 0.3$\\,\\mbox{GeV} in the  vacuum and that it reduces when the chiral symmetry is partially restored.\nIt is natural to assume that $\\sigma$ and $C$ does not change  its value so much as it is related to the confinement effect and changes \nat most by less than 5\\% at normal nuclear matter density \\cite{Hatsuda:1991ez} or at finite temperatures around $T_c$ \\cite{Lee:1989qj}. \nAs can be seen in Fig.~\\ref{fig1}, the mass of the heavy-light meson hence increases with a decreasing chiral condensate. \nThe increase of the mass  for smaller quark masses originates from the increase in the relative separation between the quark, as seen \nin Eq.~(\\ref{rel-p}), that leads to a larger contribution to the confining potential in Eq.~(\\ref{energy}). This result is consistent with that from \nQCD sum rules \\cite{Suzuki:2015est,Hilger}, and from effective chiral models \\cite{Sasaki:2014asa,Suenaga2}. \n\n\n\n\\section{Constituent quark model calculation}\n\nLet us next perform a more detailed analysis using a non-relativistic constituent quark model.\nWe start from  the following nonrelativistic Hamiltonian.\n\n\\begin{eqnarray}\nH=\\sum_{i=1}^{n}(m_{i}+\\frac{\\textbf{p}^2_i}{2m_i})-\\frac{3}{4}\\sum_{i<j}^{n}\\frac{\\lambda^c_i}{2}\\frac{\\lambda^c_j}{2}(V^{C}_{ij}+V^{SS}_{ij}),\n\\end{eqnarray}\n\nwhere $m_i$ and $\\lambda^c_i/2$ are the quark masses and  the color operators of the $i$'th quark, and  $V^{C}_{ij}$ and $V^{SS}_{ij}$ are \nthe confinement and the  hyperfine potential between quark $i$ and $j$, respectively.   We adopt the following form for the confinement and \nhyperfine potential~\\cite{Bhaduri:1981pn},\n\n\\begin{eqnarray}\nV^{C}_{ij}=-\\frac{\\kappa}{r_{ij}}+\\frac{r_{ij}}{a_0}-D, \\label{vc_ij-01}\n\\end{eqnarray}\n\n\\begin{eqnarray}\nV^{SS}_{ij}=\\frac{\\hbar^2c^2{\\kappa}}{m_im_jc^4}\\frac{1}{(r_{0ij})^2r_{ij}}e^{-(r_{ij}/r_{0ij})^2}\n{\\sigma}_i\\cdot{\\sigma}_j. \\label{v-ss}\n\\end{eqnarray}\n\nHere, $r_{ij} = |\\textbf{r}_i-\\textbf{r}_j|$ is the distance between quark $i$ and $j$, and $(r_{0ij})$ is chosen to depend on\nthe respective masses as follows:\n\n\\begin{eqnarray}\nr_{0ij}=1/(\\alpha+\\beta \\frac{m_im_j}{m_i+m_j}).\n\\end{eqnarray}\n\nThe parameters are determined to give an overall fit to the meson systems in the light and heavy quark sector \\cite{Park:2015nha}. \nIt should be noted that including the  pion and sigma exchange potentials is important for a consistent description of three-quark and six-quark states as \ndiscussed in Refs. \\cite{Huang:2013nba,Buchmann:1998mi}. We use the variational method with a single Gaussian trial wave function and determine \nthe parameters to reproduce the light-light and light-heavy meson masses.  Using multiple Gaussian functions for the trial wave function leads to negligible \nchange to the fitted masses \\cite{Park:2013fda}. The resulting parameter values are shown in Table \\ref{normalmeson_mass-01}. \n\n\\begin{table}[t!]\n\\caption{Parameters fitted to the experimental  meson masses using the variational method with a single Gaussian.\nThe respective units are given in the third row.}\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|c|c|c|c}\n\\hline \\hline\n  $\\kappa$  & $a_0$  & $D$ & $\\alpha$ &$\\beta$ & $m_q$  & $m_c$  & $m_b$   \\\\\n\\hline\n  0.48  & 5.43  & 0.911  &  2.2    & 0.277        & 0.324  & 1.83 & 5.21 \\\\\n  & $ \\mbox{GeV}^{-2}$ & $\\mbox{GeV}$   & $(\\mbox{fm})^{-1}$  &     & $\\mbox{GeV}$   & $\\mbox{GeV}$ & $\\mbox{GeV}$  \\\\\n\\hline \\hline\n\\end{tabular}\n\\end{center}\n\\label{normalmeson_mass-01}\n\\end{table}\n\nThe $D$ meson mass results of the full quark model calculation with a changing constituent quark mass are shown in Fig.\\,\\ref{fig1} as \nred dots. It can be observed in this figure that the behavior of the naive formula of Eq.\\,(\\ref{eq:Emin}) is qualitatively reproduced by our \nmore accurate calculation. \nIn Fig.\\,\\ref{D-meson}, the $D$ meson (blue circles) and $D^*$ mesons (red triangles) masses are given as a function \nof the constituent quark mass, while Fig.\\,\\ref{B-meson} shows the same for $B$ and $B^*$ mesons. \n\n\\begin{figure}[t!]\n  \\begin{center}\n         \\includegraphics[scale=0.8]{Fig2.eps}\n\\caption[]{$m_q$-dependence of $D$ meson (blue circles) and $D^*$ meson (red triangles) masses in the constituent quark model. }\n\\label{D-meson}\n  \\end{center}\n\\end{figure}\n\n\\begin{figure}[t!]\n  \\begin{center}\n         \\includegraphics[scale=0.8]{Fig3.eps}\n\\caption[]{$m_q$-dependence of $B$ meson (blue circles) and $B^*$ meson (red triangles) masses in the constituent quark model. }\n\\label{B-meson}\n  \\end{center}\n\\end{figure}\n\n\n\nAs can be seen in Figs.\\,\\ref{D-meson} and \\ref{B-meson}, the full constituent quark model calculation shows that starting \nfrom the fitted constituent quark mass of 324 MeV for \nthe light quark, one finds that for both the $D$ and $B$ mesons, the meson masses increase when the constituent quark mass decreases.  \nThe main reason for this effect is that with a decreasing constituent quark mass, the kinetic term forces the relative momentum to become smaller and \nhence the light quark to probe larger distances.  This will thus lead to a larger potential energy coming from the string tension.  \n\nThis effect is well reflected in the wave function obtained for different constituent quark masses.  The blue solid  curve  in Fig.\\,\\ref{D-meson2} shows the wave \nfunction obtained with the vacuum constituent mass of 324 MeV, while the red dashed curve  represents that with a mass of 160 MeV; the \nblack dot-dashed curve shows the Coulomb and confining part of the potential.  As can be seen in the figure, the wave function for the smaller mass \nspreads out more and thus probes higher values of the potential energy.\nTherefore, while a smaller quark mass will decrease the heavy-light meson mass, the contribution from probing larger confinement properties \nwill increase its total mass.  \n\n\\begin{figure}[t!]\n  \\begin{center}\n         \\includegraphics[scale=0.8]{wave_function.eps}\n\\caption[]{\n $r$-dependence of the $D$ meson radial wave function \nwith $m_q=324$ MeV (blue solid line) and with $m_q=160$ MeV (red dashed line).  \nThe black dot-dashed line represents the sum of the Coulomb and confining potential. \n}\n\\label{D-meson2}\n  \\end{center}\n\\end{figure}\n\nA few comments are in order here.\nFirst, in this simple model we did not introduce any modification of the string tension \nin relation to the (partial) restoration of chiral symmetry.   \nThis is so because in nuclear matter, while the chiral order parameter is expected to be reduced by more than 20\\% at \nnormal nuclear matter density, \nthe gluon condensate is expected to change by less than 5\\%. \nWhile there is no direct relation between confinement and gluon condensate, some connection can be made between the Wilson loop and gluon condensate \nvia the operator product expansion (OPE) \\cite{Shifman:1980ui}. Moreover the abrupt (slow)  change of the electric (magnetic) condensate across \nthe phase transition can be associated with the critical (soft) change of the space-time (space-space) Wilson loop across the same phase transition temperature \\cite{Lee:2008xp}. \nSecond, we did not consider any potential $D/ \\bar{D}$ splitting in medium. Such an effect could be introduced by including a vector meson exchange type \ninteraction of the $D$ mesons with the surrounding medium. Hence, the present mass change \nshould be understood as the average mass shift of these mesons. \nThird, we expect that the present framework will break down for too small quark masses as \nthe non-relativistic approximation will become invalid.  \nFourth, the present argument will not be reliable for light-light meson systems as the hyperfine potential $V^{SS}$ in \nEq.~(\\ref{v-ss}) will become unrealistically large as the light quark masses decrease. \n$V^{SS}$ in fact will increase at a $1/m_q^2$ rate with a decreasing constituent quark mass, eventually leading to a negative pion mass, which \ndoes not seem to be realistic.\n\nAs a last point, let us discuss the results of the $D^*$ and $B^*$ mesons, shown as red triangles in \nFigs.\\,\\ref{D-meson} and \\ref{B-meson}. It is seen in these figures that these mesons within our model \nbehave almost exactly in the same way as their pseudoscalar counterparts. This means that our model predicts \nthe $D^*$ and $B^*$ meson masses to increase as chiral symmetry is restored and the constituent \nquark mass decreases. \nThe existence of the heavy quark symmetry implies the degeneracy between  pseudscalar and vector heavy-light mesons in the vacuum, \nwhich is expected to be intact in the dense matter.\\footnote{Although two mesons with different spins mix with each other when the spin symmetry \nof light quark sector is broken, the degeneracy between heavy-quark partners persists~\\cite{Suenaga1}.} \nThen, the analysis here is consistent with the heavy quark symmetry similarly to the result obtained in Ref.~\\cite{Suenaga2}. \nIt is not yet clear whether this behavior will be consistent with the predictions of QCD sum rules, \nin which the operator product expansion (OPE) relates various order parameters of chiral symmetry \nto certain properties of the spectral function.   \nIn the $D^*$ (or $B^*$) channel sum rules, the OPE term involving the quark condensate has the same \nsign as in the $D$ (or $B$) case \\cite{Dominguez,Gelhausen,Wang}, which could indicate an increasing mass as chiral \nsymmetry is restored, consistent with our model. There are, however, more terms present in the OPE, which could modify \nthis naive expectation. \nTherefore, only a full QCD sum rule analysis done in the same way as in Refs.\\,\\cite{Suzuki:2015est,Hilger} will make a \nconsistency check with our model possible. We leave this topic for future work. \n\n\n\n\n\n\\section{Summary}\n\nIn this work, we have studied masses of heavy-light meson in a dense environment such as nuclear matter, in which chiral symmetry is partially \nrestored. For this purpose, we have made use of a simple quark model with one heavy and one constituent light quark. This constituent quark \nbecomes lighter as chiral symmetry is restored and therefore likely changes the mass of the whole heavy-light meson. \nNaively, one would expect the heavy-light meson to decrease its mass as one of its constituents becomes lighter. \nWe have however shown in this note that this is not necessarily the case. \nAssuming that the confining potential remains approximately constant at normal nuclear matter density, \nwe have demonstrated that the wave function spreads out as the constituent quark mass decreases and therefore \nreceives a larger potential energy due to the linearly rising confining potential. \nFor constituent quark masses below about $0.3$ GeV, this effect leads to an increase of the heavy-light meson, \nas shown for instance in Fig.\\,\\ref{fig1}. \nIn our quark model calculations, we have examined states containing both a charm and bottom quarks and found \nthe same behavior for both cases (see Figs.\\,\\ref{D-meson} and \\ref{B-meson}). \nOur results for $D$ and $B$ mesons are consistent with recent sum rule analyses which obtain increasing masses with \nincreasing density \\cite{Suzuki:2015est,Hilger} and with calculations based on the Skyrme crystal model \\cite{Suenaga2}.  \nFor the future, it will be interesting to check whether the predictions of our model for the $D^*$ and $B^*$ mesons \ncan be confirmed and reproduced by these more QCD-related  approaches. \n\n\n\\textit{Acknowledgements} \nSHL AP and WP were supported by the Korea\nNational Research Foundation under the grant number\nKRF-2011-0020333 and KRF-2011-0030621. \nThe work of MH was \nsupported in part by the JSPS Grant-in-\nAid for Scientific Research (C) No. 24540266. \nThe work of CN is supported in part by the JSPS Grant-in-\nAid for Scientific Research (S) No. 26220707. \nMH  and CN are grateful for the hospitality of the members of the Institute of Physics and Applied Physics during their stay in \nYonsei University where the main part of this work was done. \n\n\\begin{thebibliography}{50}\n\n\n\n\n\\bibitem{Hatsuda:1986gu} \n  T.~Hatsuda and T.~Kunihiro,\n  \n  Phys.\\ Lett.\\ B {\\bf 185}, 304 (1987).\n\n  \n  \n\n\n\n\n\n\\bibitem{Hatsuda:1991ez} \n  T.~Hatsuda and S.~H.~Lee,\n  \n  Phys.\\ Rev.\\ C {\\bf 46}, 34 (1992).\n\n  \n  \n\n\n\n\\bibitem{Brown:1991kk} \n  G.~E.~Brown and M.~Rho,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 66}, 2720 (1991);\n\n  \n  \n\n\n  \n  Phys.\\ Rept.\\  {\\bf 269}, 333 (1996);\n\n\n  \n  \n\n\n\n  \n  Phys.\\ Rept.\\  {\\bf 363}, 85 (2002).\n\n\n  \n  \n\n\n\n\\bibitem{Rapp:1999ej} \n  R.~Rapp and J.~Wambach,\n  \n  Adv.\\ Nucl.\\ Phys.\\  {\\bf 25}, 1 (2000).\n\n\n  \n  \n\n\n\n  \n\n\\bibitem{Harada:2000kb} \n  M.~Harada and K.~Yamawaki,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 86}, 757 (2001);\n\n\n  \n  \n\n\n  M.~Harada and C.~Sasaki,\n  \n  Phys.\\ Lett.\\ B {\\bf 537}, 280 (2002);\n\n\n  \n  \n\n\n  M.~Harada, Y.~Kim and M.~Rho,\n  \n  Phys.\\ Rev.\\ D {\\bf 66}, 016003 (2002);\n\n\n  \n  \n\n\n  M.~Harada and K.~Yamawaki,\n  \n  Phys.\\ Rept.\\  {\\bf 381}, 1 (2003);\n\n\n  \n  \n\n\n  M.~Harada and C.~Sasaki,\n  \n  Phys.\\ Rev.\\ D {\\bf 73}, 036001 (2006).\n\n\n  \n  \n\n\n\\bibitem{Hayano:2008vn} \n  R.~S.~Hayano and T.~Hatsuda,\n  \n  Rev.\\ Mod.\\ Phys.\\  {\\bf 82}, 2949 (2010).\n\n \n  \n  \n  \n\\bibitem{Leupold:2009kz} \n  S.~Leupold, V.~Metag and U.~Mosel,\n  \n  Int.\\ J.\\ Mod.\\ Phys.\\ E {\\bf 19}, 147 (2010).\n\n \n  \n  \n\n\n\\bibitem{Lee:2013es} \n  S.~H.~Lee and S.~Cho,\n  \n  Int.\\ J.\\ Mod.\\ Phys.\\ E {\\bf 22}, 1330008 (2013).\n\n\n  \n  \n  \n\\bibitem{GublerOhtani:2014}\nP. Gubler and K. Ohtani, \nPhys. Rev. D \\textbf{90}, 094002 (2014). \n\n\n\\bibitem{Suzuki:2015est} \n  K.~Suzuki, P.~Gubler and M.~Oka,\n  \n  arXiv:1511.04513 [hep-ph].\n  \n  \n  \n\\bibitem{Hilger}\n  T.~Hilger, R.~Thomas, and B.~K$\\mathrm{\\ddot{a}}$mpfer, \nPhys.\\ Rev.\\ C {\\bf 79}, 025202 (2009).  \n\n\\bibitem{Hayashigaki}\nA. Hayashigaki, \nPhys.\\ Lett.\\ {\\bf B487}, 96 (2000). \n\n\\bibitem{Azizi}\nK. Azizi, N. Er, and H. Sundu, \nEur.\\ Phys.\\ J.\\ C {\\bf 74}, 3021 (2014). \n\n\\bibitem{Wang}\nZ.-G. Wang, \narXiv:1501.05093 [hep-ph]. \n\n\n\\bibitem{Sasaki:2014asa} \n  C.~Sasaki,\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 11, 114007 (2014).\n\n\n  \n\n\\bibitem{Suenaga2}\nD. Suenaga, B.-R. He, Y.-L. Ma and M. Harada, \nPhys.\\ Rev.\\ D {\\bf 91}, 036001 (2015). \n\n\n\n\\bibitem{heavy-partner}\n  M.~A.~Nowak, M.~Rho, and I.~Zahed,\n  \n  Phys.\\ Rev.\\  D {\\bf 48}, 4370 (1993);\n  \n    \n\n  W.~A.~Bardeen and C.~T.~Hill,\n  \n  \n  Phys.\\ Rev.\\  D {\\bf 49}, 409 (1994).\n  \n\n\n\n\\bibitem{Lee:1989qj} \n  S.~H.~Lee,\n  \n  Phys.\\ Rev.\\ D {\\bf 40}, 2484 (1989).\n  \n  \n  \n  \n\n\n\\bibitem{Bhaduri:1981pn}\n  R.~K.~Bhaduri, L.~E.~Cohler and Y.~Nogami,\n  \n   Nuovo Cim.\\ A {\\bf 65}, 376 (1981).  \n\n\n\n\\bibitem{Park:2015nha}\n  W.~Park, A.~Park and S.~H.~Lee,\n  \n  Phys.\\ Rev.\\ D {\\bf 92}, 014037 (2015).\n \n  \n  \n  \n\n\\bibitem{Huang:2013nba}\n  H.~Huang, J.~Ping and F.~Wang,\n  \n  Phys.\\ Rev.\\ C {\\bf 89},  034001 (2014).\n\n  \n  \n\n\\bibitem{Buchmann:1998mi}\n  A.~J.~Buchmann, G.~Wagner and A.~Faessler,\n  \n  Phys.\\ Rev.\\ C {\\bf 57}, 3340 (1998).\n\n  \n  \n\n\n\\bibitem{Park:2013fda} \n  W.~Park and S.~H.~Lee,\n  \n  Nucl.\\ Phys.\\ A {\\bf 925}, 161 (2014).\n\n \n  \n  \n  \n\n\n\\bibitem{Shifman:1980ui} \n  M.~A.~Shifman,\n  \n  Nucl.\\ Phys.\\ B {\\bf 173}, 13 (1980).\n \n  \n  \n  \n\n\\bibitem{Lee:2008xp} \n  S.~H.~Lee and K.~Morita,\n  \n  Phys.\\ Rev.\\ D {\\bf 79}, 011501 (2009).\n\n \n  \n  \n\n\\bibitem{Suenaga1}\nD. Suenaga, B.-R. He, Y.-L. Ma and M. Harada, \nPhys.\\ Rev.\\ C {\\bf 89}, 068201 (2014). \n\n\n\n\n\\bibitem{Dominguez}\nC. A. Dominguez and N. Paver, \nPhys.\\ Lett.\\ B {\\bf 246}, 493 (1990). \n\n\\bibitem{Gelhausen}\nP. Gelhausen, A. Khodjamirian, A. A. Pivovarov, and D. Rosenthal, \nPhys.\\ Rev.\\ D {\\bf 88}, 014015 (2013). \n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 5633, "prevtext": "\nwhich leads to the minimum energy as\n\n", "index": 5, "text": "\\begin{equation}\nE_{\\rm min} = m_c + m_q + \\frac{3}{2} \\left( \\frac{\\sigma^2}{m_q} \\right)^{1/3} + C \\ . \n\\label{eq:Emin}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"E_{\\rm min}=m_{c}+m_{q}+\\frac{3}{2}\\left(\\frac{\\sigma^{2}}{m_{q}}\\right)^{1/3}%&#10;+C\\ .\" display=\"block\"><mrow><mrow><msub><mi>E</mi><mi>min</mi></msub><mo>=</mo><mrow><msub><mi>m</mi><mi>c</mi></msub><mo>+</mo><msub><mi>m</mi><mi>q</mi></msub><mo>+</mo><mrow><mfrac><mn>3</mn><mn>2</mn></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msup><mi>σ</mi><mn>2</mn></msup><msub><mi>m</mi><mi>q</mi></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup></mrow><mo>+</mo><mpadded width=\"+5pt\"><mi>C</mi></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]