[{"file": "1601.06052.tex", "nexttext": "\n\\end{subequations}\nEquation \\eqref{eq:geom2} is of particular interest, as it allows determination of the spin-orbit angle $\\psi$ provided that measurements of $i_{\\rm o}$, $i_{\\rm s}$, and $\\lambda$ are available. A joint analysis of asteroseismology, the transit light curve, and the RM effect made it possible to determine $\\psi$ for the hot-Jupiter system HAT-P-7 \\citep[Kepler-2;][]{Benomar14,Lund14} and the multi-transiting system Kepler-25 \\citep{Benomar14}. Both these systems are revisited in this work. \n\nFor an individual transiting system, we would still expect to place mild constraints on $\\psi$ even when lacking a measurement of $\\lambda$. In Fig.~\\ref{fig:analyticalpost} we show the posterior probability distribution (after normalization) for $\\psi$ conditioned on $i_{\\rm s}$ and $i_{\\rm o}$, $p(\\psi|i_{\\rm s},i_{\\rm o})$ (see Appendix \\ref{append:psipost} for a derivation of the analytical expression). We have assumed an edge-on orbit (i.e., $i_{\\rm o}\\!=\\!90\\degr$), having selected three error-free values for the stellar inclination angle ($i_{\\rm s}\\!=\\!30\\degr$, $i_{\\rm s}\\!=\\!60\\degr$, and $i_{\\rm s}\\!=\\!85\\degr$). The main conclusions to be drawn from this simple exercise follow immediately from an inspection of Fig.~\\ref{fig:analyticalpost}: For a transiting system, a small value of $i_{\\rm s}$ implies a spin-orbit misalignment. The converse is not true, since a large value of $i_{\\rm s}$ is consistent with, but does not necessarily imply, a spin-orbit alignment. The interpretation of the spin-orbit alignment in terms of the measured $i_{\\rm s}$ can thus be ambiguous. This provides one of the main motivations for this work, namely that, in order to draw general inferences about spin-orbit alignment, a statistical analysis of an ensemble of such measurements is needed.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.80\\linewidth]{analyticalpost.pdf}\n\\caption{\\small Posterior probability distribution for the spin-orbit angle $\\psi$ conditioned on $i_{\\rm s}$ and $i_{\\rm o}$, $p(\\psi|i_{\\rm s},i_{\\rm o})$. We have assumed an edge-on orbit (i.e., $i_{\\rm o}\\!=\\!90\\degr$), having selected three error-free values for $i_{\\rm s}$ ($i_{\\rm s}\\!=\\!30\\degr$, $i_{\\rm s}\\!=\\!60\\degr$, and $i_{\\rm s}\\!=\\!85\\degr$). The vertical dashed lines are placed at the asymptotes $\\psi\\!=\\!|i_{\\rm o}-i_{\\rm s}|$ and $\\psi\\!=\\!i_{\\rm o}+i_{\\rm s}$. The vertical dotted line at $\\psi\\!=\\!\\pi/2$ marks the transition between a prograde and a retrograde orbit.\\label{fig:analyticalpost}}\n\\end{figure}\n\n\n\\section{Asteroseismic analysis}\\label{sec:astero}\n\n\\subsection{Sample characterization}\\label{sec:sample}\nOur asteroseismic sample consists of 25 solar-type KOIs, of which 20 are confirmed hosts and thus have been assigned a Kepler ID (see Table \\ref{tb:sample} for a complete list). At the time of writing, all planets in the systems awaiting confirmation have been designated as `CANDIDATE' in the cumulative table of the NASA Exoplanet Archive\\footnote{\\url{http://exoplanetarchive.ipac.caltech.edu/}} \\citep{Akeson13}. Fundamental properties (e.g., surface gravity, radius, mass, and age) from a detailed asteroseismic analysis are available for all the KOIs in the sample \\citep{VSA15}.\n\nA systematic study of {\\it Kepler} planet-candidate hosts using asteroseismology was presented by \\citet{HuberKOIs}, in which fundamental properties were determined for 66 host stars based on their average asteroseismic parameters. This raised the number of {\\it Kepler} hosts with asteroseismic solutions to nearly 80 stars. Whether or not a given host star is included in the present sample was determined by our ability to resolve and extract signatures of rotation in the oscillation spectrum, which required relatively bright targets ({\\it Kepler}-band magnitude $m_{\\rm Kep}\\!\\la\\!12$) and multi-quarter observations. The intrinsic stellar properties have also played a crucial role in this regard, since it is well known that the signatures of rotation tend to be substantially blended in the power spectra of main-sequence solar-like oscillators hotter than about $6400\\:{\\rm K}$ \\citep[e.g.,][]{Appourchaux12}. Figure \\ref{fig:HR} displays the sample on a $\\log g$ vs.~$T_{\\rm eff}$ diagram. They are predominantly positioned along the main sequence and range in spectral type from early K to late F (i.e., $5000\\:{\\rm K}\\!\\la\\!T_{\\rm eff}\\!\\la\\!6500\\:{\\rm K}$). A number of stars in the sample seem to have evolved slightly beyond the main-sequence phase, one example being the bright subgiant Kepler-21 \\citep{Kepler-21}. There is also varying level of evidence of mixed \\citep[e.g.,][]{Osaki,Aizenman} quadrupole modes in the power spectra of Kepler-36, Kepler-100, Kepler-128, and Kepler-129, an indication that these stars may have already left the main sequence. The fact that central hydrogen has been depleted in models of these stars \\citep[][]{VSA15} supports this scenario.\n\nThe sample contains 16 multiple-planet systems, of which all except Kepler-93 \\citep[][]{Kepler-93} and Kepler-410 A \\citep[][]{VanEylen14} are also multi-transiting systems\\footnote{Although being a single-transiting system, transit-timing variations (TTVs) suggest the presence of at least one additional (non-transiting) planet in the Kepler-410 A system.}. Moreover, a non-transiting planet was revealed by RV measurements orbiting beyond the two transiting planets in the Kepler-25 \\citep{Marcy14} and Kepler-68 \\citep{Kepler-68} systems. Most of the multi-transiting systems in our sample have had the eccentricities of their planets measured from transit photometry \\citep{EylenAlbrecht}, which revealed a tendency toward low eccentricities that are consistent with nearly circular orbits. Of the remaining 9 single-planet systems, only one \\citep[HAT-P-7;][]{HAT-P-7b} is a hot-Jupiter system. From Table \\ref{tb:sample}, we also see a clear prevalence of systems that contain small planets (i.e., $R_{\\rm p}\\!\\leq\\!4\\,R_\\earth$) and long-period planets (i.e., $P_{\\rm o}\\!>\\!10\\:{\\rm d}$).\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.70\\linewidth]{HR.pdf}\n\\caption{\\small Surface gravity vs.~effective temperature for the KOIs in the asteroseismic sample. Filled blue circles represent multiple-planet systems, while open red circles represent single-planet systems. Symbol size scales linearly with planetary size (for multiple-planet systems, the smallest planet is considered). For reference, a hypothetical solar twin harboring an Earth-size planet is represented by `$\\earth$'. Solar-calibrated evolutionary tracks spanning the mass range $0.8$--$1.6\\,{\\rm M}_\\sun$ (in steps of $0.2\\,{\\rm M}_\\sun$) are shown as continuous lines. These tracks have been computed using the Modules for Experiments in Stellar Astrophysics \\citep[MESA;][]{Paxton11,Paxton13} evolution code.\\label{fig:HR}}\n\\end{figure}\n\n\n\\subsection{Data preparation}\\label{sec:data}\nRaw pixel data \\citep{Jenkins10} were downloaded from the {\\it Kepler} Asteroseismic Science Operations Center\\footnote{\\url{http://kasoc.phys.au.dk}} (KASOC) database and subsequently run through the homonymous filter \\citep[][]{KASOCfilter}. The KASOC filter has been specifically designed to automatically carry out the preparation of {\\it Kepler} photometric time series of planet-candidate hosts for asteroseismic analysis. The time series used in this work were acquired in short-cadence mode ($\\Delta t\\!\\sim\\!58.85\\:{\\rm s}$) to allow investigation of solar-like oscillations in main-sequence stars, whose dominant periods are typically several minutes. A weighted least-squares sine-wave-fitting method was then used to compute rms-scaled power spectra of the time series for further analysis \\citep[][]{Kjeldsen92,Frandsen95}.\n\n\\subsection{Estimation of the stellar inclination angle}\\label{sec:incl}\n\n\\subsubsection{Principle}\\label{sec:inclsub1}\nSolar-like oscillations are predominantly acoustic global standing waves. Commonly called p modes, owing to the fact that pressure plays the role of the restoring force, these modes are intrinsically damped and stochastically excited by near-surface convection \\citep[for a review see, e.g.,][]{JCDReview,CunhaReview,ChaplinReview}. The oscillation modes are characterized by the radial order $n$, the spherical degree $l$, and the azimuthal order $m$. Radial modes have $l\\!=\\!0$, whereas non-radial modes have $l\\!>\\!0$. Values of $m$ range from $-l$ to $l$, meaning that there are $2l+1$ azimuthal components for a given multiplet of degree $l$. Observed oscillation modes are typically high-order modes of low spherical degree, with the associated power spectrum showing a pattern of peaks with near-regular frequency separations \\citep{Vandakurov,Tassoul}.\n\nThe asteroseismic estimation of $i_{\\rm s}$ rests on our ability to resolve and extract signatures of rotation in the power spectra of non-radial modes of oscillation. Rotation lifts the degeneracy in the frequencies, $\\nu_{nl}$, of non-radial modes and introduces a dependence of the oscillation frequencies on $m$, with prograde (retrograde) modes (with $m\\!>\\!0$ and $m\\!<\\!0$, respectively) having frequencies slightly higher (lower) than the axisymmetric mode ($m\\!=\\!0$) in the observer's frame of reference. For the fairly modest values of the stellar angular velocity $\\Omega$ that are typical of solar-like oscillators, the effect of rotation can be treated following a perturbative analysis \\citep[e.g.,][]{Reese06} and the star is generally assumed to rotate as a solid body (i.e., $\\Omega\\!=\\!{\\rm const.}$). In the limit of solid-body rotation, the frequency $\\nu_{nlm}$ of a mode, as observed in an inertial frame, can be expressed to first order as \\citep{Ledoux51}:\n\n", "itemtype": "equation", "pos": 15312, "prevtext": "\n\n\n\n\\title{Spin-orbit alignment of exoplanet systems: ensemble analysis using asteroseismology}\n\n\n\n\\author{T.~L.~Campante\\altaffilmark{1,2}}\n\\email{campante@bison.ph.bham.ac.uk}\n\\and\n\\author{\nM.~N.~Lund\\altaffilmark{1,2},\nJ.~S.~Kuszlewicz\\altaffilmark{1,2},\nG.~R.~Davies\\altaffilmark{1,2},\nW.~J.~Chaplin\\altaffilmark{1,2},\nS.~Albrecht\\altaffilmark{2},\nJ.~N.~Winn\\altaffilmark{3,4},\nT.~R.~Bedding\\altaffilmark{5,2},\nO.~Benomar\\altaffilmark{6,7},\nD.~Bossini\\altaffilmark{1,2},\nR.~Handberg\\altaffilmark{2,1},\nA.~R.~G.~Santos\\altaffilmark{8,1},\nV.~Van Eylen\\altaffilmark{2,4},\nS.~Basu\\altaffilmark{9},\nJ.~Christensen-Dalsgaard\\altaffilmark{2},\nY.~P.~Elsworth\\altaffilmark{1,2},\nS.~Hekker\\altaffilmark{10,2},\nT.~Hirano\\altaffilmark{11},\nD.~Huber\\altaffilmark{5,12},\nC.~Karoff\\altaffilmark{13,2},\nH.~Kjeldsen\\altaffilmark{2},\nM.~S.~Lundkvist\\altaffilmark{2},\nT.~S.~H.~North\\altaffilmark{1,2},\nV.~Silva Aguirre\\altaffilmark{2},\nD.~Stello\\altaffilmark{5,2},\nT.~R.~White\\altaffilmark{2,14}\n}\n\n\\altaffiltext{1}{School of Physics and Astronomy, University of Birmingham, Edgbaston, Birmingham, B15 2TT, UK}\n   \n\\altaffiltext{2}{Stellar Astrophysics Centre (SAC), Department of Physics and Astronomy, Aarhus University, Ny Munkegade 120, DK-8000 Aarhus C, Denmark}\n\n\\altaffiltext{3}{Physics Department, Massachusetts Institute of Technology, 77 Massachusetts Avenue, Cambridge, MA 02139, USA}\n\n\\altaffiltext{4}{MIT Kavli Institute for Astrophysics \\& Space Research, 70 Vassar Street, Cambridge, MA 02139, USA}   \n\n\\altaffiltext{5}{Sydney Institute for Astronomy, School of Physics, University of Sydney, Sydney, Australia}\n\n\\altaffiltext{6}{Department of Astronomy, The University of Tokyo, School of Science, 7-3-1 Hongo, Bunkyo-ku, Tokyo 113-0033, Japan}\n\n\\altaffiltext{7}{NYUAD Institute, Center for Space Science, New York University Abu Dhabi, PO Box 129188, Abu Dhabi, UAE}\n\n\\altaffiltext{8}{Instituto de Astrof\\'isica e Ci\\^encias do Espa\\c co, Universidade do Porto, Rua das Estrelas, 4150-762 Porto, Portugal}\n\n\\altaffiltext{9}{Department of Astronomy, Yale University, New Haven, CT 06520, USA}\n\n\\altaffiltext{10}{Max Planck Institute for Solar System Research, Justus-von-Liebig-Weg 3, 37077 G\\\"ottingen, Germany}\n\n\\altaffiltext{11}{Department of Earth and Planetary Sciences, Tokyo Institute of Technology, 2-12-1 Ookayama, Meguro-ku, Tokyo 152-8551, Japan}\n\n\\altaffiltext{12}{SETI Institute, 189 Bernardo Avenue \\#100, Mountain View, CA 94043, USA}\n\n\\altaffiltext{13}{Department of Geoscience, Aarhus University, H{\\o}egh-Guldbergs Gade 2, DK-8000 Aarhus C, Denmark}\n\n\\altaffiltext{14}{Institut fur Astrophysik, Georg-August-Universit\\\"at G\\\"ottingen, Friedrich-Hund-Platz 1, 37077 G\\\"ottingen, Germany}\n\n\n\n\\begin{abstract}\nThe angle $\\psi$ between a planet's orbital axis and the spin axis of its parent star is an important diagnostic of planet formation, migration, and tidal evolution. We seek empirical constraints on $\\psi$ by measuring the stellar inclination $i_{\\rm s}$ via asteroseismology for an ensemble of 25 solar-type hosts observed with NASA's {\\it Kepler} satellite. Our results for $i_{\\rm s}$ are consistent with alignment at the 2-$\\sigma$ level for all stars in the sample, meaning that the system surrounding the red-giant star Kepler-56 remains as the only unambiguous misaligned multiple-planet system detected to date. The availability of a measurement of the projected spin-orbit angle $\\lambda$ for two of the systems allows us to estimate $\\psi$. We find that the orbit of the hot-Jupiter HAT-P-7b is likely to be retrograde ($\\psi\\!=\\!116.4\\degr^{+30.2}_{-14.7}$), whereas that of Kepler-25c seems to be well aligned with the stellar spin axis ($\\psi\\!=\\!12.6\\degr^{+6.7}_{-11.0}$). While the latter result is in apparent contradiction with a statement made previously in the literature that the multi-transiting system Kepler-25 is misaligned, we show that the results are consistent, given the large associated uncertainties. Finally, we perform a hierarchical Bayesian analysis based on the asteroseismic sample in order to recover the underlying distribution of $\\psi$. The ensemble analysis suggests that the directions of the stellar spin and planetary orbital axes are correlated, as conveyed by a tendency of the host stars to display large inclination values.\n\\end{abstract}\n\n\\keywords{asteroseismology --- methods: statistical --- planetary systems --- planets and satellites: general --- stars: solar-type --- techniques: photometric}\n\n\n\n\\section{Introduction}\\label{sec:intro}\nThe angle $\\psi$ between the planetary orbital axis and the stellar spin axis (the true obliquity or spin-orbit angle) is a fundamental geometric property of planetary systems. Furthermore, it has been recognized as an important diagnostic of theories of planet formation, migration, and tidal evolution. For all these reasons, seeking empirical constraints on $\\psi$ is a matter of the utmost importance.\n\nIn the case of an exoplanet found through the radial-velocity (RV) method, no information is available about the degree of spin-orbit alignment. For transiting exoplanets, on the other hand, the Rossiter--McLaughlin (RM) effect has now been widely exploited \\citep[e.g.,][]{Queloz00,Winn05,Winn09,HAT-P-11b,WinnCircumbinary,XO3,Triaud10,Hirano11,Albrecht12,Albrecht13}. This technique is sensitive to the angle $\\lambda$ between the sky-projected orbital and spin axes (the projected spin-orbit angle). At the time of writing there are 87 planets with published measurements of the RM effect (see the online compilation\\footnote{\\url{http://www.physics.mcmaster.ca/~rheller/}} by R.~Heller), of which 36 ($\\sim\\!40\\,\\%$) show substantial misalignments according to at least one publication \\citep[see also fig.~7 of][]{Xue14}. Other techniques that allow obliquity measurements of transiting systems include the analysis of planetary transits over starspots \\citep[e.g.,][]{Kepler17b,Nutzman11,WASP4,SONature}, Doppler tomography \\citep[e.g.,][]{Cameron10,Gandolfi12,Albrecht13,Johnson14}, the analysis of the effect of gravity darkening on the transit light curve \\citep[e.g.,][]{Barnes09,Barnes11,Ahlers14}, and the analysis of the photometric amplitude distribution of stellar rotation \\citep{Mazeh15}.\n\nMost obliquity measurements to date have been for systems harboring hot Jupiters, owing to the fact that the RM effect scales as the planet-to-star area ratio and to the increased opportunities for obtaining follow-up spectroscopic observations due to the frequent transit events. Empirical evidence has been found that the obliquities of hot-Jupiter systems are affected by tidal evolution (\\citealt{Schlaufman,Winn10,Morton11,Triaud11,Albrecht12}; although see \\citealt{Mazeh15} for evidence against this theory): systems expected to undergo strong planet-star tidal interactions are preferentially found to have low obliquities, while systems with weaker tidal interactions display a wide range of obliquities that, besides well-aligned planets, also include planets in polar or even retrograde orbits. This suggests that the orbital plane has changed relative to the plane of the protoplanetary disk by the time hot Jupiters are formed and before tides have had any impact on shaping the system, which presumably happens due to the same mechanism responsible for their migration.\n\nThe above discussion assumes that the protoplanetary disk is coplanar with the stellar equator. The possibility remains, however, that primordial star-disk misalignments are ubiquitous, meaning that large obliquities could be a generic feature of planetary systems and not specific to hot-Jupiter formation. This hypothesis may in principle be tested by measuring the obliquities of systems with multiple transiting planets, since the planetary orbits in these systems are nearly coplanar and presumably trace the plane of the protoplanetary disk \\citep{Lissauer11,Fabrycky14}. Accordingly, if multi-transiting systems tend to have low obliquities, then the high obliquities observed for hot-Jupiter systems are likely to be associated with planet migration. If, instead, the obliquity distribution of multi-transiting systems is similar to that of hot-Jupiter systems, then this would indicate more general processes of stellar and planet formation: processes such as chaotic star formation \\citep[e.g.,][]{Bate10,Thies11,Fielding15}, magnetic star-disk interactions \\citep[e.g.,][]{Lai11}, torques due to internal gravity waves \\citep[e.g.,][]{Rogers12}, or torques due to neighboring stars \\citep[e.g.,][]{Batygin12}.\n\nIn order to study the dynamical histories of planetary systems across a comprehensive range of architectures and in a variety of environments, it is imperative to extend obliquity measurements to systems with smaller planets, longer-period planets, and multiple planets \\citep[note that, according to the current state of knowledge, hot Jupiters rarely have nearby planetary companions and may thus occur preferentially as single planets;][]{Steffen12}. For long-period planets, however, the opportunities to observe transits occur less frequently, which limits the possibility of obtaining follow-up observations or identifying the transit geometry from starspot crossings. Furthermore, application of the RM technique becomes increasingly more challenging when dealing with multiple-planet systems, since these systems also tend to involve smaller planets \\citep[e.g.,][]{Latham11}.\n\nAn alternative technique for measuring the obliquities of planetary systems, one that does not depend on the signal-to-noise ratio (S/N) of the transit data and hence on planet size, makes use of a combination of the photometric stellar rotation period, $P_{\\rm rot}$, and the spectroscopically-determined projected rotational velocity, $v\\sin i_{\\rm s}$, and stellar radius, $R_{\\rm s}$, to determine the sine of the angle $i_{\\rm s}$ between the stellar spin axis and the line of sight (the stellar inclination angle). This technique evolved from the technique originally developed by \\citet{Herbst86} and \\citet{Hendry93}, having been revisited more recently by a number of authors \\citep{JJ10,Schlaufman}, including a series of applications \\citep[e.g.,][]{Hirano12,Hirano14,Walkowicz13,Morton14} to transiting systems observed with the NASA {\\it Kepler} mission \\citep{Kepler,Koch10}.\n\nFinally, asteroseismology provides an independent means of directly determining $i_{\\rm s}$. The asteroseismic estimation of $i_{\\rm s}$ rests on our ability to resolve and extract signatures of rotation in the power spectra of non-radial modes of oscillation \\citep[e.g.,][]{Gizon03,Ballot06,Ballot08,Benomar09,Campante11}. The asteroseismic technique requires bright targets and long-duration time series to attain the desired S/N and frequency resolution. The applicability of this technique depends entirely on the stellar properties and not on the planetary or orbital parameters, which is an advantage when measuring obliquities of systems with small and/or long-period planets. Following its application to host stars with single, non-transiting large planets discovered using the RV method \\citep{Wright11,Gizon13}, the asteroseismic technique has been applied to several {\\it Kepler} Sun-like hosts \\citep{Chaplin13,Benomar14,Lund14,VanEylen14}. In addition, \\citet{Huber13} used asteroseismology to measure a large obliquity for Kepler-56, a red giant hosting two transiting coplanar planets, thus showing that spin-orbit misalignments are not confined to hot-Jupiter systems. Another instance of an asteroseismic obliquity measurement of an evolved host is that of Kepler-432 \\citep{KOI-1299}. Recently, the stellar inclination angles of the solar analogs 16 Cyg A and B (the B component hosts a Jovian planet) were determined using asteroseismology \\citep{Davies16Cyg}.\n\nHere we present the first analysis of an ensemble of asteroseismic obliquity measurements obtained for solar-type stars with transiting planets. The asteroseismic sample consists of 25 {\\it Kepler} planet-candidate host stars (also designated as {\\it Kepler} Objects of Interest or KOIs), of which 20 are confirmed hosts. The host stars are distributed along the main sequence and subgiant branch, and all exhibit solar-like oscillations. The rest of the paper is organized as follows. In Sect.~\\ref{sec:geometry} we present a recap of the spin-orbit geometry. A detailed asteroseismic analysis of the individual planetary-system hosts follows in Sect.~\\ref{sec:astero}. In Sect.~\\ref{sec:stat} we place statistical constraints on the spin-orbit alignment. Finally, a discussion of the results and conclusions make up Sect.~\\ref{sec:conclusions}.\n\n\\section{Spin-orbit geometry}\\label{sec:geometry}\nFigure \\ref{fig:geometry} shows an observer-oriented coordinate system (left panel) and an orbit-oriented coordinate system (right panel). In the former, the orbital angular momentum unit vector, $\\mathbf{n}_{\\rm o}$, lies on the $yz$ plane and is solely determined by the angle $i_{\\rm o}$ between the planetary orbital axis and the line of sight (the orbital inclination angle). The angle $i_{\\rm o}$ can be measured for a transiting planet via transit photometry \\citep[e.g.,][]{Charbonneau00,Henry00}, in which case one necessarily has $\\sin i_{\\rm o}\\!\\approx\\!1$ (i.e., an edge-on orbit). Determination of the stellar rotation angular momentum unit vector, $\\mathbf{n}_{\\rm s}$, requires a polar and an azimuthal angle, respectively $i_{\\rm s}$ and $\\lambda$. To avoid degeneracies, we restrict $i_{\\rm o}$ and $i_{\\rm s}$ to the interval $[0,\\pi/2]$, while $\\lambda$ is allowed to vary in the interval $[-\\pi,\\pi]$. In the orbit-oriented coordinate system, $\\mathbf{n}_{\\rm s}$ is determined by the polar and azimuthal angles $\\psi$ and $\\phi$. The spin-orbit angle $\\psi$ is the angle between $\\mathbf{n}_{\\rm o}$ and $\\mathbf{n}_{\\rm s}$, taking values in the interval $[0,\\pi]$. Values of $\\psi$ lower (greater) than $\\pi/2$ correspond to prograde (retrograde) orbits. The specific cases of a parallel, an antiparallel, and a polar orbit then correspond to $\\psi\\!=\\!0$, $\\psi\\!=\\!\\pi$, and $\\psi\\!=\\!\\pi/2$, respectively. The azimuthal angle $\\phi$ is allowed to vary in the range $[-\\pi,\\pi]$ and takes the value $\\pi$ along the line of sight.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics*[scale=0.8]{fig_geometry/fig_geometry.pdf}\n\\includegraphics*[scale=0.8]{fig_geometry/fig_geometry2.pdf}\n\\caption{\\small Spin-orbit geometry. Left panel: Observer-oriented coordinate system. Here the $z$ axis points toward the observer, the $x$ axis points along the line of nodes, the $y$ axis completes a right-handed triad, and the $xy$ plane is the plane of the sky. Right panel: Orbit-oriented coordinate system (obtained from the observer-oriented system by a counterclockwise rotation of $\\pi/2-i_{\\rm o}$ about the $x'\\!\\equiv\\!x$ axis). Here the $y'$ axis is the planetary orbital axis and the $x'z'$ plane is the orbital plane. The unit vectors $\\mathbf{n}_{\\rm o}$ and $\\mathbf{n}_{\\rm s}$ respectively denote the orbital and stellar rotation angular momentum unit vectors. All depicted angles are introduced in the text.\\label{fig:geometry}}\n\\end{figure}\n\n\nThe various angles are related according to the following equations \\citep[for a derivation see, e.g.,][]{Fabrycky09}:\n\\begin{subequations}\n\n", "index": 1, "text": "\\begin{gather}\n\\sin i_{\\rm s}\\sin\\lambda = \\sin\\psi\\sin\\phi \\, , \\label{eq:geom1}\\\\ \n\\cos\\psi = \\sin i_{\\rm s}\\cos\\lambda\\sin i_{\\rm o} + \\cos i_{\\rm s}\\cos i_{\\rm o} \\, , \\label{eq:geom2}\\\\\n\\sin\\psi\\cos\\phi = \\sin i_{\\rm s}\\cos\\lambda\\cos i_{\\rm o} - \\cos i_{\\rm s}\\sin i_{\\rm o} \\, . \\label{eq:geom3}\n\\end{gather}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sin i_{\\rm s}\\sin\\lambda=\\sin\\psi\\sin\\phi\\,,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>λ</mi></mrow></mrow><mo>=</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mpadded width=\"+1.7pt\"><mi>ϕ</mi></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\cos\\psi=\\sin i_{\\rm s}\\cos\\lambda\\sin i_{\\rm o}+\\cos i_{\\rm s}%&#10;\\cos i_{\\rm o}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>=</mo><mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>λ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>+</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mpadded width=\"+1.7pt\"><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mpadded></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sin\\psi\\cos\\phi=\\sin i_{\\rm s}\\cos\\lambda\\cos i_{\\rm o}-\\cos i_{%&#10;\\rm s}\\sin i_{\\rm o}\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>λ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mpadded width=\"+1.7pt\"><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mpadded></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nThe kinematic splitting $m\\Omega/(2\\pi)$ is corrected for the effect of the Coriolis force through the dimensionless Ledoux constant, $C_{nl}$. For high-order p modes, $C_{nl}\\!\\ll\\!1$, with the rotational splitting being dominated by advection and given approximately by the angular velocity, i.e., $\\nu_{\\rm s}\\!\\approx\\!\\Omega/(2\\pi)$ \\citep[e.g.,][]{LundDiff,Davies16Cyg}. \n\nTo a second order of approximation, centrifugal effects that disrupt the equilibrium structure of the star can be taken into account through an additional frequency perturbation \\citep[e.g.,][]{Ballot10}. This perturbation scales as the ratio of the centrifugal to the gravitational forces at the stellar surface, i.e., $\\Omega_{\\rm surf}^2R_{\\rm s}^3/(GM_{\\rm s})$, where $G$ is the gravitational constant. We made use of the available values of $P_{\\rm rot}$ in Table \\ref{tb:sample} to compute the ratios of the surface angular velocity to the Keplerian break-up rotation rate, i.e., $\\Omega_{\\rm surf}/\\Omega_{\\rm K}\\equiv2\\pi/(P_{\\rm rot}\\sqrt{GM_{\\rm s}/R_{\\rm s}^3})$. We obtained $(\\Omega_{\\rm surf}/\\Omega_{\\rm K})^2\\!\\la\\!9\\!\\times\\!10^{-4}$ for the stars in the asteroseismic sample and have thus decided to neglect second-order effects in the present analysis.\n\nAssuming energy equipartition between multiplet components with different azimuthal order\\footnote{The predicted power asymmetries for stars in the asteroseismic sample are of the order of $1\\,\\%$ \\citep[for an $l\\!=\\!1$ mode at the frequency of maximum oscillation amplitude $\\nu_{\\rm max}$;][]{Belkacem09}, which are negligible for our analysis.}, the dependence of mode power on $m$ is given by \\citep{Dziembowski77,Dziembowski85,Gizon03}:\n\n", "itemtype": "equation", "pos": 25338, "prevtext": "\n\\end{subequations}\nEquation \\eqref{eq:geom2} is of particular interest, as it allows determination of the spin-orbit angle $\\psi$ provided that measurements of $i_{\\rm o}$, $i_{\\rm s}$, and $\\lambda$ are available. A joint analysis of asteroseismology, the transit light curve, and the RM effect made it possible to determine $\\psi$ for the hot-Jupiter system HAT-P-7 \\citep[Kepler-2;][]{Benomar14,Lund14} and the multi-transiting system Kepler-25 \\citep{Benomar14}. Both these systems are revisited in this work. \n\nFor an individual transiting system, we would still expect to place mild constraints on $\\psi$ even when lacking a measurement of $\\lambda$. In Fig.~\\ref{fig:analyticalpost} we show the posterior probability distribution (after normalization) for $\\psi$ conditioned on $i_{\\rm s}$ and $i_{\\rm o}$, $p(\\psi|i_{\\rm s},i_{\\rm o})$ (see Appendix \\ref{append:psipost} for a derivation of the analytical expression). We have assumed an edge-on orbit (i.e., $i_{\\rm o}\\!=\\!90\\degr$), having selected three error-free values for the stellar inclination angle ($i_{\\rm s}\\!=\\!30\\degr$, $i_{\\rm s}\\!=\\!60\\degr$, and $i_{\\rm s}\\!=\\!85\\degr$). The main conclusions to be drawn from this simple exercise follow immediately from an inspection of Fig.~\\ref{fig:analyticalpost}: For a transiting system, a small value of $i_{\\rm s}$ implies a spin-orbit misalignment. The converse is not true, since a large value of $i_{\\rm s}$ is consistent with, but does not necessarily imply, a spin-orbit alignment. The interpretation of the spin-orbit alignment in terms of the measured $i_{\\rm s}$ can thus be ambiguous. This provides one of the main motivations for this work, namely that, in order to draw general inferences about spin-orbit alignment, a statistical analysis of an ensemble of such measurements is needed.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.80\\linewidth]{analyticalpost.pdf}\n\\caption{\\small Posterior probability distribution for the spin-orbit angle $\\psi$ conditioned on $i_{\\rm s}$ and $i_{\\rm o}$, $p(\\psi|i_{\\rm s},i_{\\rm o})$. We have assumed an edge-on orbit (i.e., $i_{\\rm o}\\!=\\!90\\degr$), having selected three error-free values for $i_{\\rm s}$ ($i_{\\rm s}\\!=\\!30\\degr$, $i_{\\rm s}\\!=\\!60\\degr$, and $i_{\\rm s}\\!=\\!85\\degr$). The vertical dashed lines are placed at the asymptotes $\\psi\\!=\\!|i_{\\rm o}-i_{\\rm s}|$ and $\\psi\\!=\\!i_{\\rm o}+i_{\\rm s}$. The vertical dotted line at $\\psi\\!=\\!\\pi/2$ marks the transition between a prograde and a retrograde orbit.\\label{fig:analyticalpost}}\n\\end{figure}\n\n\n\\section{Asteroseismic analysis}\\label{sec:astero}\n\n\\subsection{Sample characterization}\\label{sec:sample}\nOur asteroseismic sample consists of 25 solar-type KOIs, of which 20 are confirmed hosts and thus have been assigned a Kepler ID (see Table \\ref{tb:sample} for a complete list). At the time of writing, all planets in the systems awaiting confirmation have been designated as `CANDIDATE' in the cumulative table of the NASA Exoplanet Archive\\footnote{\\url{http://exoplanetarchive.ipac.caltech.edu/}} \\citep{Akeson13}. Fundamental properties (e.g., surface gravity, radius, mass, and age) from a detailed asteroseismic analysis are available for all the KOIs in the sample \\citep{VSA15}.\n\nA systematic study of {\\it Kepler} planet-candidate hosts using asteroseismology was presented by \\citet{HuberKOIs}, in which fundamental properties were determined for 66 host stars based on their average asteroseismic parameters. This raised the number of {\\it Kepler} hosts with asteroseismic solutions to nearly 80 stars. Whether or not a given host star is included in the present sample was determined by our ability to resolve and extract signatures of rotation in the oscillation spectrum, which required relatively bright targets ({\\it Kepler}-band magnitude $m_{\\rm Kep}\\!\\la\\!12$) and multi-quarter observations. The intrinsic stellar properties have also played a crucial role in this regard, since it is well known that the signatures of rotation tend to be substantially blended in the power spectra of main-sequence solar-like oscillators hotter than about $6400\\:{\\rm K}$ \\citep[e.g.,][]{Appourchaux12}. Figure \\ref{fig:HR} displays the sample on a $\\log g$ vs.~$T_{\\rm eff}$ diagram. They are predominantly positioned along the main sequence and range in spectral type from early K to late F (i.e., $5000\\:{\\rm K}\\!\\la\\!T_{\\rm eff}\\!\\la\\!6500\\:{\\rm K}$). A number of stars in the sample seem to have evolved slightly beyond the main-sequence phase, one example being the bright subgiant Kepler-21 \\citep{Kepler-21}. There is also varying level of evidence of mixed \\citep[e.g.,][]{Osaki,Aizenman} quadrupole modes in the power spectra of Kepler-36, Kepler-100, Kepler-128, and Kepler-129, an indication that these stars may have already left the main sequence. The fact that central hydrogen has been depleted in models of these stars \\citep[][]{VSA15} supports this scenario.\n\nThe sample contains 16 multiple-planet systems, of which all except Kepler-93 \\citep[][]{Kepler-93} and Kepler-410 A \\citep[][]{VanEylen14} are also multi-transiting systems\\footnote{Although being a single-transiting system, transit-timing variations (TTVs) suggest the presence of at least one additional (non-transiting) planet in the Kepler-410 A system.}. Moreover, a non-transiting planet was revealed by RV measurements orbiting beyond the two transiting planets in the Kepler-25 \\citep{Marcy14} and Kepler-68 \\citep{Kepler-68} systems. Most of the multi-transiting systems in our sample have had the eccentricities of their planets measured from transit photometry \\citep{EylenAlbrecht}, which revealed a tendency toward low eccentricities that are consistent with nearly circular orbits. Of the remaining 9 single-planet systems, only one \\citep[HAT-P-7;][]{HAT-P-7b} is a hot-Jupiter system. From Table \\ref{tb:sample}, we also see a clear prevalence of systems that contain small planets (i.e., $R_{\\rm p}\\!\\leq\\!4\\,R_\\earth$) and long-period planets (i.e., $P_{\\rm o}\\!>\\!10\\:{\\rm d}$).\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.70\\linewidth]{HR.pdf}\n\\caption{\\small Surface gravity vs.~effective temperature for the KOIs in the asteroseismic sample. Filled blue circles represent multiple-planet systems, while open red circles represent single-planet systems. Symbol size scales linearly with planetary size (for multiple-planet systems, the smallest planet is considered). For reference, a hypothetical solar twin harboring an Earth-size planet is represented by `$\\earth$'. Solar-calibrated evolutionary tracks spanning the mass range $0.8$--$1.6\\,{\\rm M}_\\sun$ (in steps of $0.2\\,{\\rm M}_\\sun$) are shown as continuous lines. These tracks have been computed using the Modules for Experiments in Stellar Astrophysics \\citep[MESA;][]{Paxton11,Paxton13} evolution code.\\label{fig:HR}}\n\\end{figure}\n\n\n\\subsection{Data preparation}\\label{sec:data}\nRaw pixel data \\citep{Jenkins10} were downloaded from the {\\it Kepler} Asteroseismic Science Operations Center\\footnote{\\url{http://kasoc.phys.au.dk}} (KASOC) database and subsequently run through the homonymous filter \\citep[][]{KASOCfilter}. The KASOC filter has been specifically designed to automatically carry out the preparation of {\\it Kepler} photometric time series of planet-candidate hosts for asteroseismic analysis. The time series used in this work were acquired in short-cadence mode ($\\Delta t\\!\\sim\\!58.85\\:{\\rm s}$) to allow investigation of solar-like oscillations in main-sequence stars, whose dominant periods are typically several minutes. A weighted least-squares sine-wave-fitting method was then used to compute rms-scaled power spectra of the time series for further analysis \\citep[][]{Kjeldsen92,Frandsen95}.\n\n\\subsection{Estimation of the stellar inclination angle}\\label{sec:incl}\n\n\\subsubsection{Principle}\\label{sec:inclsub1}\nSolar-like oscillations are predominantly acoustic global standing waves. Commonly called p modes, owing to the fact that pressure plays the role of the restoring force, these modes are intrinsically damped and stochastically excited by near-surface convection \\citep[for a review see, e.g.,][]{JCDReview,CunhaReview,ChaplinReview}. The oscillation modes are characterized by the radial order $n$, the spherical degree $l$, and the azimuthal order $m$. Radial modes have $l\\!=\\!0$, whereas non-radial modes have $l\\!>\\!0$. Values of $m$ range from $-l$ to $l$, meaning that there are $2l+1$ azimuthal components for a given multiplet of degree $l$. Observed oscillation modes are typically high-order modes of low spherical degree, with the associated power spectrum showing a pattern of peaks with near-regular frequency separations \\citep{Vandakurov,Tassoul}.\n\nThe asteroseismic estimation of $i_{\\rm s}$ rests on our ability to resolve and extract signatures of rotation in the power spectra of non-radial modes of oscillation. Rotation lifts the degeneracy in the frequencies, $\\nu_{nl}$, of non-radial modes and introduces a dependence of the oscillation frequencies on $m$, with prograde (retrograde) modes (with $m\\!>\\!0$ and $m\\!<\\!0$, respectively) having frequencies slightly higher (lower) than the axisymmetric mode ($m\\!=\\!0$) in the observer's frame of reference. For the fairly modest values of the stellar angular velocity $\\Omega$ that are typical of solar-like oscillators, the effect of rotation can be treated following a perturbative analysis \\citep[e.g.,][]{Reese06} and the star is generally assumed to rotate as a solid body (i.e., $\\Omega\\!=\\!{\\rm const.}$). In the limit of solid-body rotation, the frequency $\\nu_{nlm}$ of a mode, as observed in an inertial frame, can be expressed to first order as \\citep{Ledoux51}:\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq:Ledoux}\n\\nu_{nlm}=\\nu_{nl0} + m\\frac{\\Omega}{2\\pi} (1-C_{nl}) \\approx \\nu_{nl0} + m\\nu_{\\rm s} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\nu_{nlm}=\\nu_{nl0}+m\\frac{\\Omega}{2\\pi}(1-C_{nl})\\approx\\nu_{nl0}+m\\nu_{\\rm s%&#10;}\\,.\" display=\"block\"><mrow><mrow><msub><mi>ν</mi><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>=</mo><mrow><msub><mi>ν</mi><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>+</mo><mrow><mi>m</mi><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">Ω</mi><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>C</mi><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>≈</mo><mrow><msub><mi>ν</mi><mrow><mi>n</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>+</mo><mrow><mi>m</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>ν</mi><mi mathvariant=\"normal\">s</mi></msub></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere $P_l^m(x)$ are the associated Legendre functions and the sum over $m$ of $\\mathscr{E}_{l m}(i_{\\rm s})$ has been normalized to unity. Measurement of the relative power of the azimuthal components in a non-radial multiplet thus provides a direct estimate of the stellar inclination angle. The above formalism further relies on the assumption that contributions to the observed intensity across the visible stellar disk depend only on the angular distance from the disk center, which is valid for photometric observations. According to Eq.~(\\ref{eq:relpower}), when the stellar spin axis points toward the observer (pole-on configuration), only the axisymmetric mode is visible and no inference can thus be made about rotation. When the spin axis lies on the plane of the sky (edge-on configuration), as is approximately the case of the Sun, observations are essentially sensitive only to modes with even $|l-m|$. Given sufficient frequency resolution and S/N, it will be the intrinsic ratio $\\nu_{\\rm s}/\\Gamma$ (where $\\Gamma$ is the full width at half maximum, or linewidth, of the mode profile of each azimuthal component; see Eq.~\\ref{eq:specmodel}) which determines whether it is possible to resolve the azimuthal components \\citep{Ballot06,Procyon}. Moreover, dipole ($l\\!=\\!1$) modes are approximately three times more prominent in the power spectra of intensity observations than quadrupole ($l\\!=\\!2$) modes of similar frequency, and consequently it is the former modes that ultimately determine our ability to constrain $i_{\\rm s}$.\n\n\\subsubsection{Results}\\label{sec:inclsub2}\n\nA detailed fitting of the modes of oscillation was conducted to extract signatures of rotation from the power spectra of stars in the asteroseismic sample (see Appendix \\ref{append:specfit} for a description of the method; in Appendix \\ref{append:artificial} we test the robustness of the returned uncertainties on $i_{\\rm s}$). This allowed us to map the joint posterior probability distribution (PPD) of $i_{\\rm s}$ and $\\nu_{\\rm s}$. An example is shown in Fig.~\\ref{fig:ppd008866102} (bottom left panel) for Kepler-410 A, together with the corresponding marginalized PPDs (top left and bottom right panels). Also shown in the bottom left panel is an estimate of the projected splitting (black solid line), given by\\footnote{$v\\sin i_{\\rm s}$ values (and their literature sources) are listed in Table \\ref{tb:sample} for all stars in the asteroseismic sample.} $\\nu_{\\rm s}\\sin i_{\\rm s}\\!\\approx\\!v\\sin i_{\\rm s}/(2\\pi R_{\\rm s})$. This assumes that the internal rotation rates probed by the asteroseismic splitting are similar to the surface rate of rotation. For a typical $1.2$-${\\rm M}_\\sun$ star in our sample (such as Kepler-410 A), however, the asteroseismic splitting is nearly equally sensitive to rotation in the radiative and convective zones \\citep{LundDiff,Benomar15}, and the assumption that the surface and asteroseismic rotation periods are similar should thus be regarded as approximate. We also note that different authors very often disagree on the value of the measured $v\\sin i_{\\rm s}$. The bottom left panel of Fig.~\\ref{fig:ppd008866102} displays such an example, where besides the projected splitting based on the $v\\sin i_{\\rm s}$ value from \\citet{HuberKOIs} given in Table \\ref{tb:sample} (black solid line), we also use the other available $v\\sin i_{\\rm s}$ value for this star from \\citet{Molenda13} (gray solid line). Accurate and precise $v\\sin i_{\\rm s}$ measurements from spectroscopy are difficult to obtain for solar-type stars, since the rotational line broadening is often comparable to the effects of instrumental broadening and macroturbulence ($v_{\\rm mac}$). In a recent work, \\citet{Doyle14} used accurate $v\\sin i_{\\rm s}$ values from asteroseismology to break the degeneracy between the spectroscopic $v\\sin i_{\\rm s}$ and $v_{\\rm mac}$ in spectral line profiles, thus obtaining a calibration for stellar macroturbulence. The marginalized PPDs are presented as histograms, with dotted and dot-dashed lines respectively enclosing the $68.3\\,\\%$ and $95.4\\,\\%$ highest posterior density (HPD) credible regions. Our results for the stellar inclination angle of Kepler-410 A are in very good agreement with those obtained by \\citet{VanEylen14}. The stellar inclination is tightly constrained and its posterior distribution indicates an edge-on configuration. This was to be expected from inspection of the $l\\!=\\!1$ mode profiles in Fig.~\\ref{fig:peakbag}.\n\n\\clearpage\n\n\n\\begin{figure}[!ht]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008866102_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8866102 (Kepler-410 A, KOI-42). Bottom left panel: Joint PPD of $i_{\\rm s}$ and $\\nu_{\\rm s}$ based on $80{,}000$ MCMC thinned (uniformly subsampled) samples. Also shown are two different estimates of the projected splitting (solid lines) with their associated 1-$\\sigma$ envelopes (dashed lines): the black lines are based on the $v\\sin i_{\\rm s}$ from \\citet{HuberKOIs} given in Table \\ref{tb:sample}, whereas the gray lines are based on the value provided in \\citet{Molenda13}. $v\\sin i_{\\rm s}$ values (and their literature sources) are listed in Table \\ref{tb:sample} for all stars in the asteroseismic sample. Top left and bottom right panels: Marginalized PPDs. These are shown as histograms, with the number of bins defined according to Scott's normal reference rule \\citep[][]{ScottBook}. Dotted and dot-dashed lines respectively enclose the $68.3\\,\\%$ and $95.4\\,\\%$ HPD credible regions \\citep[e.g.,][chap.~3]{GregoryBook}. For reference, the dashed curve in the bottom right panel represents the (uninformative) isotropic prior on $i_{\\rm s}$ adopted in the asteroseismic analysis.\\label{fig:ppd008866102}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010666592_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10666592 (HAT-P-7, Kepler-2, KOI-2). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010666592}}\n\\end{figure}\n\n\n\n\\begin{figure}[!b]\n\\centering\n\\includegraphics[width=0.6\\linewidth]{fig_ppds/obliquity_010666592_thin10.pdf}\n\\caption{\\small Posterior probability distribution of the spin-orbit angle $\\psi$ of KIC~10666592 (HAT-P-7, Kepler-2, KOI-2). The black histogram was obtained by means of Monte Carlo simulations using the PPD of $i_{\\rm s}$ from our analysis, and assuming normal and uniform distributions, respectively, for $\\lambda$ and $i_{\\rm o}$ around their adopted literature values. Dotted lines enclose its associated $68.3\\,\\%$ HPD credible region. The gray histogram was obtained by assuming an isotropic distribution in $\\lambda$.\\label{fig:obl010666592}}\n\\end{figure}\n\n\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004349452_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4349452 (Kepler-25, KOI-244). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004349452}}\n\\end{figure}\n\n\n\n\\begin{figure}[!b]\n\\centering\n\\includegraphics[width=0.6\\linewidth]{fig_ppds/obliquity_004349452_thin10.pdf}\n\\caption{\\small Posterior probability distribution of the spin-orbit angle $\\psi$ of KIC~4349452 (Kepler-25, KOI-244). Similar to Fig.~\\ref{fig:obl010666592}.\\label{fig:obl004349452}}\n\\end{figure}\n\n\n\\clearpage\n\nNext, we present the results for the two targets in the asteroseismic sample that have an available $\\lambda$ measurement in the literature, namely, HAT-P-7 and Kepler-25 (see Figs.~\\ref{fig:ppd010666592}--\\ref{fig:obl004349452}; see also Table \\ref{tb:obliquities}). Of particular interest are Figs.~\\ref{fig:obl010666592} and \\ref{fig:obl004349452}, showing the derived PPDs of the spin-orbit angle $\\psi$ (black histograms). These were sampled by means of Monte Carlo simulations (via Eq.~\\ref{eq:geom2}) using the PPD of $i_{\\rm s}$ from our analysis, and assuming normal and uniform distributions, respectively, for $\\lambda$ and $i_{\\rm o}$ around their adopted literature values (see Table \\ref{tb:obliquities}). Also shown are the PPDs obtained by instead assuming an isotropic distribution in $\\lambda$ (gray histograms). We find that the orbit of the hot-Jupiter HAT-P-7b is likely to be retrograde, while that of Kepler-25c is well aligned with the stellar spin axis. Our findings for Kepler-25 are not in agreement with the statement made by \\citet{Benomar14} that this system is mildly misaligned and this point will be further discussed in Sect.~\\ref{sec:conclusions}.\n\nAsteroseismic results for the remainder of the stars in the sample are shown in Figs.~\\ref{fig:ppd003425851}--\\ref{fig:ppd011904151}. Even though $i_{\\rm s}$ is independent of the rotational splitting $\\nu_{\\rm s}$, their measured values are highly correlated, as can be seen from the joint PPDs. Consequently, even when a constrained solution for $i_{\\rm s}$ and $\\nu_{\\rm s}$ cannot be obtained, as is often the case in the present analysis, it is still possible to estimate the projected splitting $\\nu_{\\rm s}\\sin i_{\\rm s}$. Table \\ref{tb:results} reports the $68.3\\,\\%$ and $95.4\\,\\%$ HPD credible regions for the stellar inclination angle $i_{\\rm s}$ for all the stars in the asteroseismic sample. Note that the PPD of $i_{\\rm s}$ is often too asymmetric to be adequately summarized by a single estimate and we have thus refrained from tabulating any measures of central tendency, such as the median or the mode of the distributions. We stress that Bayesian inference does not provide point estimates of parameters. Instead the Bayesian solution to the problem of parameter estimation is the full posterior probability distribution\\footnote{Full posterior probability distributions are made available upon request.}. The several statistical analyses conducted in the next section are based on the full posteriors. Our results for $i_{\\rm s}$ suggest that there are five other systems in the asteroseismic sample besides HAT-P-7 that could potentially be misaligned, namely, Kepler-50, Kepler-93, Kepler-145, Kepler-409, and KOI-280. And while this interpretation is certainly valid when considering the $68.3\\,\\%$ HPD credible regions, we note that our results are consistent with alignment at the 2-$\\sigma$ level for all systems in the sample.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{averageposterior.pdf}\n\\caption{\\small Concatenated posterior probability distributions of $\\cos i_{\\rm s}$ (kernel density estimates) for stars in the asteroseismic sample. The overall concatenated posterior is depicted in black, whereas the concatenated posteriors for single- and multi-transiting systems are depicted in blue and red, respectively. For reference, the horizontal dashed line represents the (uninformative) isotropic prior on $i_{\\rm s}$ (or, equivalently, the uniform prior on $\\cos i_{\\rm s}$) adopted in the asteroseismic analysis.\n\\label{fig:averageposterior}}\n\\end{figure}\n\n\n\\section{Statistical constraints on spin-orbit alignment}\\label{sec:stat}\n\\subsection{Asteroseismic sample}\\label{sec:statastero}\nFigure \\ref{fig:averageposterior} shows the concatenated posterior probability distributions of $\\cos i_{\\rm s}$, made by concatenating the individual posteriors and normalizing. This is shown for all stars in the asteroseismic sample (25 systems), as well as for the subsamples of single- (11) and multi-transiting (14) systems. The isotropic distribution is represented by a horizontal dashed line. We may have naively expected the concatenated posterior(s) not to exhibit the amount of structure seen in Fig.~\\ref{fig:averageposterior}. This is a consequence of the small size of the asteroseismic sample, with a few individual posteriors eventually dominating at specific $i_{\\rm s}$ ranges.\n\nThe stars in the asteroseismic sample appear to preferentially display large values of $i_{\\rm s}$ (or, equivalently, small values of $\\cos i_{\\rm s}$), this being more accentuated than if the $i_{\\rm s}$ had been drawn from an isotropic distribution. This departure from isotropy suggests that the directions of the stellar spin ($\\mathbf{n}_{\\rm s}$) and planetary orbital ($\\mathbf{n}_{\\rm o}$) axes are correlated. Given samplings of the posterior probability distributions of $\\cos i_{\\rm s}$ for the $N\\!=\\!25$ stars in the asteroseismic sample, $\\{\\cos i_{\\rm s}\\}_{n=1}^N$, we would like to infer the distribution of the spin-orbit angle $\\psi$. As a first step, we need to devise a parameterized model for the distribution function of $\\psi$, $f_{\\boldsymbol{\\alpha}}(\\psi)$, as well as a prior on the model parameters $\\boldsymbol{\\alpha}$. We could then, in principle, use the observed data to constrain these parameters by means of a hierarchical Bayesian analysis (see Appendix \\ref{append:hierarchical} for details). We note that the concatenated posteriors in Fig.~\\ref{fig:averageposterior} are only shown here for comparison to fig.~9 of \\citet{Hirano14} and fig.~5 of \\citet{Morton14}. We do not use these concatenated posteriors directly for inference. Instead, we conduct a forward modeling of the observed data by defining a model distribution $f_{\\boldsymbol{\\alpha}}(\\psi)$ and finding the model parameters $\\alpha$ that best explain those data. Since we are modeling the distribution prior to observation, we are effectively performing a deconvolution that works on heteroscedastic data (i.e., with changing variance).\n\n{\\it A Fisher distribution.} An isotropic distribution for $\\psi$ is known to be inadequate \\citep[e.g.,][]{Winn06}, which also follows from our realization above that $\\mathbf{n}_{\\rm s}$ and $\\mathbf{n}_{\\rm o}$ are apparently correlated. We choose to model the distribution function of $\\psi$ as a Fisher distribution \\citep{Fisher}, the analog of a zero-mean Gaussian distribution on a sphere. The Fisher distribution has been previously proposed by \\citet{Fabrycky09} to model $f_{\\boldsymbol{\\alpha}}(\\psi)$. Its probability density function is given by  \n\n", "itemtype": "equation", "pos": 27176, "prevtext": "\nThe kinematic splitting $m\\Omega/(2\\pi)$ is corrected for the effect of the Coriolis force through the dimensionless Ledoux constant, $C_{nl}$. For high-order p modes, $C_{nl}\\!\\ll\\!1$, with the rotational splitting being dominated by advection and given approximately by the angular velocity, i.e., $\\nu_{\\rm s}\\!\\approx\\!\\Omega/(2\\pi)$ \\citep[e.g.,][]{LundDiff,Davies16Cyg}. \n\nTo a second order of approximation, centrifugal effects that disrupt the equilibrium structure of the star can be taken into account through an additional frequency perturbation \\citep[e.g.,][]{Ballot10}. This perturbation scales as the ratio of the centrifugal to the gravitational forces at the stellar surface, i.e., $\\Omega_{\\rm surf}^2R_{\\rm s}^3/(GM_{\\rm s})$, where $G$ is the gravitational constant. We made use of the available values of $P_{\\rm rot}$ in Table \\ref{tb:sample} to compute the ratios of the surface angular velocity to the Keplerian break-up rotation rate, i.e., $\\Omega_{\\rm surf}/\\Omega_{\\rm K}\\equiv2\\pi/(P_{\\rm rot}\\sqrt{GM_{\\rm s}/R_{\\rm s}^3})$. We obtained $(\\Omega_{\\rm surf}/\\Omega_{\\rm K})^2\\!\\la\\!9\\!\\times\\!10^{-4}$ for the stars in the asteroseismic sample and have thus decided to neglect second-order effects in the present analysis.\n\nAssuming energy equipartition between multiplet components with different azimuthal order\\footnote{The predicted power asymmetries for stars in the asteroseismic sample are of the order of $1\\,\\%$ \\citep[for an $l\\!=\\!1$ mode at the frequency of maximum oscillation amplitude $\\nu_{\\rm max}$;][]{Belkacem09}, which are negligible for our analysis.}, the dependence of mode power on $m$ is given by \\citep{Dziembowski77,Dziembowski85,Gizon03}:\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:relpower}\n\\mathscr{E}_{l m}(i_{\\rm s}) = \\frac{(l-|m|)!}{(l+|m|)!} \\left[P_l^{|m|}(\\cos i_{\\rm s})\\right]^2 \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\mathscr{E}_{lm}(i_{\\rm s})=\\frac{(l-|m|)!}{(l+|m|)!}\\left[P_{l}^{|m|}(\\cos i_%&#10;{\\rm s})\\right]^{2}\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathscript\">ℰ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>-</mo><mrow><mo stretchy=\"false\">|</mo><mi>m</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mrow><mo stretchy=\"false\">|</mo><mi>m</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>[</mo><mrow><msubsup><mi>P</mi><mi>l</mi><mrow><mo stretchy=\"false\">|</mo><mi>m</mi><mo stretchy=\"false\">|</mo></mrow></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>]</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere $\\kappa$ measures the probability concentration around $\\psi\\!=\\!0$. As $\\kappa\\!\\rightarrow\\!0$, the distribution becomes the isotropic distribution, whereas for $\\kappa\\!\\rightarrow\\!\\infty$ it becomes a Rayleigh distribution of width $\\sigma\\!=\\!\\kappa^{-1/2}$. However, our observable is $\\cos i_{\\rm s}$ and not $\\psi$, and so we instead use the probability distribution for $\\cos i_{\\rm s}$ given $\\kappa$ as derived by \\citet{Morton14} (hereafter MW14):\n\n", "itemtype": "equation", "pos": 41310, "prevtext": "\nwhere $P_l^m(x)$ are the associated Legendre functions and the sum over $m$ of $\\mathscr{E}_{l m}(i_{\\rm s})$ has been normalized to unity. Measurement of the relative power of the azimuthal components in a non-radial multiplet thus provides a direct estimate of the stellar inclination angle. The above formalism further relies on the assumption that contributions to the observed intensity across the visible stellar disk depend only on the angular distance from the disk center, which is valid for photometric observations. According to Eq.~(\\ref{eq:relpower}), when the stellar spin axis points toward the observer (pole-on configuration), only the axisymmetric mode is visible and no inference can thus be made about rotation. When the spin axis lies on the plane of the sky (edge-on configuration), as is approximately the case of the Sun, observations are essentially sensitive only to modes with even $|l-m|$. Given sufficient frequency resolution and S/N, it will be the intrinsic ratio $\\nu_{\\rm s}/\\Gamma$ (where $\\Gamma$ is the full width at half maximum, or linewidth, of the mode profile of each azimuthal component; see Eq.~\\ref{eq:specmodel}) which determines whether it is possible to resolve the azimuthal components \\citep{Ballot06,Procyon}. Moreover, dipole ($l\\!=\\!1$) modes are approximately three times more prominent in the power spectra of intensity observations than quadrupole ($l\\!=\\!2$) modes of similar frequency, and consequently it is the former modes that ultimately determine our ability to constrain $i_{\\rm s}$.\n\n\\subsubsection{Results}\\label{sec:inclsub2}\n\nA detailed fitting of the modes of oscillation was conducted to extract signatures of rotation from the power spectra of stars in the asteroseismic sample (see Appendix \\ref{append:specfit} for a description of the method; in Appendix \\ref{append:artificial} we test the robustness of the returned uncertainties on $i_{\\rm s}$). This allowed us to map the joint posterior probability distribution (PPD) of $i_{\\rm s}$ and $\\nu_{\\rm s}$. An example is shown in Fig.~\\ref{fig:ppd008866102} (bottom left panel) for Kepler-410 A, together with the corresponding marginalized PPDs (top left and bottom right panels). Also shown in the bottom left panel is an estimate of the projected splitting (black solid line), given by\\footnote{$v\\sin i_{\\rm s}$ values (and their literature sources) are listed in Table \\ref{tb:sample} for all stars in the asteroseismic sample.} $\\nu_{\\rm s}\\sin i_{\\rm s}\\!\\approx\\!v\\sin i_{\\rm s}/(2\\pi R_{\\rm s})$. This assumes that the internal rotation rates probed by the asteroseismic splitting are similar to the surface rate of rotation. For a typical $1.2$-${\\rm M}_\\sun$ star in our sample (such as Kepler-410 A), however, the asteroseismic splitting is nearly equally sensitive to rotation in the radiative and convective zones \\citep{LundDiff,Benomar15}, and the assumption that the surface and asteroseismic rotation periods are similar should thus be regarded as approximate. We also note that different authors very often disagree on the value of the measured $v\\sin i_{\\rm s}$. The bottom left panel of Fig.~\\ref{fig:ppd008866102} displays such an example, where besides the projected splitting based on the $v\\sin i_{\\rm s}$ value from \\citet{HuberKOIs} given in Table \\ref{tb:sample} (black solid line), we also use the other available $v\\sin i_{\\rm s}$ value for this star from \\citet{Molenda13} (gray solid line). Accurate and precise $v\\sin i_{\\rm s}$ measurements from spectroscopy are difficult to obtain for solar-type stars, since the rotational line broadening is often comparable to the effects of instrumental broadening and macroturbulence ($v_{\\rm mac}$). In a recent work, \\citet{Doyle14} used accurate $v\\sin i_{\\rm s}$ values from asteroseismology to break the degeneracy between the spectroscopic $v\\sin i_{\\rm s}$ and $v_{\\rm mac}$ in spectral line profiles, thus obtaining a calibration for stellar macroturbulence. The marginalized PPDs are presented as histograms, with dotted and dot-dashed lines respectively enclosing the $68.3\\,\\%$ and $95.4\\,\\%$ highest posterior density (HPD) credible regions. Our results for the stellar inclination angle of Kepler-410 A are in very good agreement with those obtained by \\citet{VanEylen14}. The stellar inclination is tightly constrained and its posterior distribution indicates an edge-on configuration. This was to be expected from inspection of the $l\\!=\\!1$ mode profiles in Fig.~\\ref{fig:peakbag}.\n\n\\clearpage\n\n\n\\begin{figure}[!ht]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008866102_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8866102 (Kepler-410 A, KOI-42). Bottom left panel: Joint PPD of $i_{\\rm s}$ and $\\nu_{\\rm s}$ based on $80{,}000$ MCMC thinned (uniformly subsampled) samples. Also shown are two different estimates of the projected splitting (solid lines) with their associated 1-$\\sigma$ envelopes (dashed lines): the black lines are based on the $v\\sin i_{\\rm s}$ from \\citet{HuberKOIs} given in Table \\ref{tb:sample}, whereas the gray lines are based on the value provided in \\citet{Molenda13}. $v\\sin i_{\\rm s}$ values (and their literature sources) are listed in Table \\ref{tb:sample} for all stars in the asteroseismic sample. Top left and bottom right panels: Marginalized PPDs. These are shown as histograms, with the number of bins defined according to Scott's normal reference rule \\citep[][]{ScottBook}. Dotted and dot-dashed lines respectively enclose the $68.3\\,\\%$ and $95.4\\,\\%$ HPD credible regions \\citep[e.g.,][chap.~3]{GregoryBook}. For reference, the dashed curve in the bottom right panel represents the (uninformative) isotropic prior on $i_{\\rm s}$ adopted in the asteroseismic analysis.\\label{fig:ppd008866102}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010666592_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10666592 (HAT-P-7, Kepler-2, KOI-2). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010666592}}\n\\end{figure}\n\n\n\n\\begin{figure}[!b]\n\\centering\n\\includegraphics[width=0.6\\linewidth]{fig_ppds/obliquity_010666592_thin10.pdf}\n\\caption{\\small Posterior probability distribution of the spin-orbit angle $\\psi$ of KIC~10666592 (HAT-P-7, Kepler-2, KOI-2). The black histogram was obtained by means of Monte Carlo simulations using the PPD of $i_{\\rm s}$ from our analysis, and assuming normal and uniform distributions, respectively, for $\\lambda$ and $i_{\\rm o}$ around their adopted literature values. Dotted lines enclose its associated $68.3\\,\\%$ HPD credible region. The gray histogram was obtained by assuming an isotropic distribution in $\\lambda$.\\label{fig:obl010666592}}\n\\end{figure}\n\n\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004349452_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4349452 (Kepler-25, KOI-244). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004349452}}\n\\end{figure}\n\n\n\n\\begin{figure}[!b]\n\\centering\n\\includegraphics[width=0.6\\linewidth]{fig_ppds/obliquity_004349452_thin10.pdf}\n\\caption{\\small Posterior probability distribution of the spin-orbit angle $\\psi$ of KIC~4349452 (Kepler-25, KOI-244). Similar to Fig.~\\ref{fig:obl010666592}.\\label{fig:obl004349452}}\n\\end{figure}\n\n\n\\clearpage\n\nNext, we present the results for the two targets in the asteroseismic sample that have an available $\\lambda$ measurement in the literature, namely, HAT-P-7 and Kepler-25 (see Figs.~\\ref{fig:ppd010666592}--\\ref{fig:obl004349452}; see also Table \\ref{tb:obliquities}). Of particular interest are Figs.~\\ref{fig:obl010666592} and \\ref{fig:obl004349452}, showing the derived PPDs of the spin-orbit angle $\\psi$ (black histograms). These were sampled by means of Monte Carlo simulations (via Eq.~\\ref{eq:geom2}) using the PPD of $i_{\\rm s}$ from our analysis, and assuming normal and uniform distributions, respectively, for $\\lambda$ and $i_{\\rm o}$ around their adopted literature values (see Table \\ref{tb:obliquities}). Also shown are the PPDs obtained by instead assuming an isotropic distribution in $\\lambda$ (gray histograms). We find that the orbit of the hot-Jupiter HAT-P-7b is likely to be retrograde, while that of Kepler-25c is well aligned with the stellar spin axis. Our findings for Kepler-25 are not in agreement with the statement made by \\citet{Benomar14} that this system is mildly misaligned and this point will be further discussed in Sect.~\\ref{sec:conclusions}.\n\nAsteroseismic results for the remainder of the stars in the sample are shown in Figs.~\\ref{fig:ppd003425851}--\\ref{fig:ppd011904151}. Even though $i_{\\rm s}$ is independent of the rotational splitting $\\nu_{\\rm s}$, their measured values are highly correlated, as can be seen from the joint PPDs. Consequently, even when a constrained solution for $i_{\\rm s}$ and $\\nu_{\\rm s}$ cannot be obtained, as is often the case in the present analysis, it is still possible to estimate the projected splitting $\\nu_{\\rm s}\\sin i_{\\rm s}$. Table \\ref{tb:results} reports the $68.3\\,\\%$ and $95.4\\,\\%$ HPD credible regions for the stellar inclination angle $i_{\\rm s}$ for all the stars in the asteroseismic sample. Note that the PPD of $i_{\\rm s}$ is often too asymmetric to be adequately summarized by a single estimate and we have thus refrained from tabulating any measures of central tendency, such as the median or the mode of the distributions. We stress that Bayesian inference does not provide point estimates of parameters. Instead the Bayesian solution to the problem of parameter estimation is the full posterior probability distribution\\footnote{Full posterior probability distributions are made available upon request.}. The several statistical analyses conducted in the next section are based on the full posteriors. Our results for $i_{\\rm s}$ suggest that there are five other systems in the asteroseismic sample besides HAT-P-7 that could potentially be misaligned, namely, Kepler-50, Kepler-93, Kepler-145, Kepler-409, and KOI-280. And while this interpretation is certainly valid when considering the $68.3\\,\\%$ HPD credible regions, we note that our results are consistent with alignment at the 2-$\\sigma$ level for all systems in the sample.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{averageposterior.pdf}\n\\caption{\\small Concatenated posterior probability distributions of $\\cos i_{\\rm s}$ (kernel density estimates) for stars in the asteroseismic sample. The overall concatenated posterior is depicted in black, whereas the concatenated posteriors for single- and multi-transiting systems are depicted in blue and red, respectively. For reference, the horizontal dashed line represents the (uninformative) isotropic prior on $i_{\\rm s}$ (or, equivalently, the uniform prior on $\\cos i_{\\rm s}$) adopted in the asteroseismic analysis.\n\\label{fig:averageposterior}}\n\\end{figure}\n\n\n\\section{Statistical constraints on spin-orbit alignment}\\label{sec:stat}\n\\subsection{Asteroseismic sample}\\label{sec:statastero}\nFigure \\ref{fig:averageposterior} shows the concatenated posterior probability distributions of $\\cos i_{\\rm s}$, made by concatenating the individual posteriors and normalizing. This is shown for all stars in the asteroseismic sample (25 systems), as well as for the subsamples of single- (11) and multi-transiting (14) systems. The isotropic distribution is represented by a horizontal dashed line. We may have naively expected the concatenated posterior(s) not to exhibit the amount of structure seen in Fig.~\\ref{fig:averageposterior}. This is a consequence of the small size of the asteroseismic sample, with a few individual posteriors eventually dominating at specific $i_{\\rm s}$ ranges.\n\nThe stars in the asteroseismic sample appear to preferentially display large values of $i_{\\rm s}$ (or, equivalently, small values of $\\cos i_{\\rm s}$), this being more accentuated than if the $i_{\\rm s}$ had been drawn from an isotropic distribution. This departure from isotropy suggests that the directions of the stellar spin ($\\mathbf{n}_{\\rm s}$) and planetary orbital ($\\mathbf{n}_{\\rm o}$) axes are correlated. Given samplings of the posterior probability distributions of $\\cos i_{\\rm s}$ for the $N\\!=\\!25$ stars in the asteroseismic sample, $\\{\\cos i_{\\rm s}\\}_{n=1}^N$, we would like to infer the distribution of the spin-orbit angle $\\psi$. As a first step, we need to devise a parameterized model for the distribution function of $\\psi$, $f_{\\boldsymbol{\\alpha}}(\\psi)$, as well as a prior on the model parameters $\\boldsymbol{\\alpha}$. We could then, in principle, use the observed data to constrain these parameters by means of a hierarchical Bayesian analysis (see Appendix \\ref{append:hierarchical} for details). We note that the concatenated posteriors in Fig.~\\ref{fig:averageposterior} are only shown here for comparison to fig.~9 of \\citet{Hirano14} and fig.~5 of \\citet{Morton14}. We do not use these concatenated posteriors directly for inference. Instead, we conduct a forward modeling of the observed data by defining a model distribution $f_{\\boldsymbol{\\alpha}}(\\psi)$ and finding the model parameters $\\alpha$ that best explain those data. Since we are modeling the distribution prior to observation, we are effectively performing a deconvolution that works on heteroscedastic data (i.e., with changing variance).\n\n{\\it A Fisher distribution.} An isotropic distribution for $\\psi$ is known to be inadequate \\citep[e.g.,][]{Winn06}, which also follows from our realization above that $\\mathbf{n}_{\\rm s}$ and $\\mathbf{n}_{\\rm o}$ are apparently correlated. We choose to model the distribution function of $\\psi$ as a Fisher distribution \\citep{Fisher}, the analog of a zero-mean Gaussian distribution on a sphere. The Fisher distribution has been previously proposed by \\citet{Fabrycky09} to model $f_{\\boldsymbol{\\alpha}}(\\psi)$. Its probability density function is given by  \n\n", "index": 7, "text": "\\begin{equation}\n\\label{eq:Fisher}\nf_{\\boldsymbol{\\alpha}}(\\psi) \\equiv p_{\\rm F}(\\psi|\\kappa) = \\frac{\\kappa}{2\\sinh \\kappa} \\exp(\\kappa \\cos\\psi) \\sin\\psi \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"f_{\\boldsymbol{\\alpha}}(\\psi)\\equiv p_{\\rm F}(\\psi|\\kappa)=\\frac{\\kappa}{2%&#10;\\sinh\\kappa}\\exp(\\kappa\\cos\\psi)\\sin\\psi\\,,\" display=\"block\"><mrow><msub><mi>f</mi><mi>𝜶</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">)</mo></mrow><mo>≡</mo><msub><mi>p</mi><mi mathvariant=\"normal\">F</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">|</mo><mi>κ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mi>κ</mi><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mi>κ</mi></mrow></mrow></mfrac><mi>exp</mi><mrow><mo stretchy=\"false\">(</mo><mi>κ</mi><mi>cos</mi><mi>ψ</mi><mo stretchy=\"false\">)</mo></mrow><mi>sin</mi><mpadded width=\"+1.7pt\"><mi>ψ</mi></mpadded><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nWe refer to this parameterized model as the `single-Fisher model' and adopt a uniform prior for $\\kappa$ in the range [0,200]. Figure \\ref{fig:Fisher} shows $p_{\\rm F}(\\psi|\\kappa)$ and $p_{\\rm F}(\\cos i_{\\rm s}|\\kappa)$ for a set of concentration parameters $\\kappa$. Finally, we sample the joint PPD of the model parameters $\\boldsymbol{\\alpha}$ (or simply $\\kappa$ in the present case) following a hierarchical Bayesian scheme.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics*[scale=0.68]{Fisher.pdf}\n\\includegraphics*[scale=0.68]{Fisher2.pdf}\n\\caption{\\small Fisher probability distribution. Top panel: The individual Fisher distributions are characterized by different concentration parameters $\\kappa$, namely, $\\kappa\\!=\\!2,10,50$, and 100. The solar value $\\psi_\\sun\\!=\\!7.155\\degr$ is shown for reference \\citep{BeckGiles}. Bottom panel: The distribution $p_{\\rm F}(\\cos i_{\\rm s}|\\kappa)$ is shown for $\\kappa\\!=\\!2,10,50$, and 100. The isotropic distribution is depicted by a dashed curve in both panels.\\label{fig:Fisher}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{post_singleF_kappa_astero.pdf}\n\\caption{\\small Posterior probability distribution of the concentration parameter $\\kappa$ in the single-Fisher model (asteroseismic sample). Distributions for the different cohorts of systems are color-coded. A logarithmic scale is used along the horizontal axis to emphasize the sharp fall-off at low $\\kappa$.\\label{fig:post_singleF_kappa_astero}}\n\\end{figure}\n\n\nThe PPD of the concentration parameter $\\kappa$ is shown in Fig.~\\ref{fig:post_singleF_kappa_astero}. Distributions for the different cohorts of systems are color-coded. Table \\ref{tb:reshierarchical} presents a summary of the results. The posterior of $\\kappa$ is dominated by the (uniform) prior over most of the range [0,200], the exception being at small $\\kappa$, where the posterior falls sharply at $\\kappa\\!\\approx\\!10$ (the logarithmic scale along the horizontal axis in Fig.~\\ref{fig:post_singleF_kappa_astero} emphasizes this point). Based on the lower bounds of the $95.4\\,\\%$ HPD credible regions (see Table \\ref{tb:reshierarchical}), it can be stated that the concentration parameter $\\kappa$ is significantly different from zero, thus ruling out isotropy.\n\nThe constraints on spin-orbit alignment made possible by an analysis of the asteroseismic sample are in qualitative agreement with the outcome of the analysis presented in \\citet[][]{Hirano14}, who have estimated $i_{\\rm s}$ for a sample of 25 (coincidentally) KOIs based on measurements of their rotation period, rotational line broadening, and stellar radius. Furthermore, our results cannot be used to support the recent finding by MW14 that the obliquities of systems with a single transiting planet are systematically larger than those with multiple transiting planets. MW14 have, however, considered a substantially larger sample, having performed an ensemble analysis of a compilation of 70 KOIs whose obliquity measurements had previously been published \\citep[these included most of the KOIs analyzed by][]{Hirano14}.\n\nThe small size of the asteroseismic sample prevents us from placing more stringent constraints on spin-orbit alignment and more systems would be needed to draw firmer conclusions. In the next section we explore the possibility of extending the MW14 sample by combining it with our asteroseismic sample, thus forming the largest ensemble to date of measured $i_{\\rm s}$ for exoplanet-host stars. We will be particularly interested in assessing the impact of adding our asteroseismic sample (representing just over $1/4$ of the combined sample) to the ensemble analysis.  \n\n\\subsection{Combined sample}\\label{sec:comb}\nWe combined the asteroseismic sample with the compilation by MW14 in order to place statistical constraints on the spin-orbit alignment of exoplanet systems. There are 62 additional (non-overlapping) systems in the sample of MW14, of which 23 are multi-transiting and 39 are single-transiting (we note that KOI-2636 has in the meantime been reclassified as multi-transiting). We thus obtain a combined sample of 87 systems, of which 37 are multi-transiting and 50 are single-transiting. There are at least three reasons for considering an analysis that uses the combined sample: \\begin{inparaenum}[(i)] \\item as already mentioned, the combined sample is, to date, the largest ensemble of measured $i_{\\rm s}$ for exoplanet-host stars; \\item the two samples being combined are complementary in terms of $T_{\\rm eff}$ coverage (see Fig.~\\ref{fig:HR2}); \\item the hierarchical Bayesian approach adopted in this work (cf.~Sect.~\\ref{sec:statastero}) is able to handle the inhomogeneous nature of the combined sample in a straightforward manner\\end{inparaenum}.\n\nFigure \\ref{fig:HR2} displays the stars in the combined sample in a $\\log g$ vs.~$T_{\\rm eff}$ diagram. Multi- and single-transiting systems are seen to span similar ranges of effective temperature ($4500\\!\\la\\!T_{\\rm eff}\\!\\la\\!6500\\:{\\rm K}$) and surface gravity ($3.9\\!\\la\\!\\log g\\!\\la\\!4.6\\:{\\rm dex}$). Stars belonging to the asteroseismic sample are responsible for populating the hot (and hence massive) end of the parameter space, where flux modulations due to starspots are hardly detectable and a measurement of the photometric $P_{\\rm rot}$ is thus made difficult \\citep[e.g.,][]{Radick82}. Conversely, the cool end of the parameter space is mainly populated by stars belonging to the MW14 sample, since their oscillation amplitudes are too small, and the stars in general too faint, to allow detecting the oscillations \\cite[e.g.,][]{CampanteSurfGrav}. Furthermore, planets in multi-transiting systems tend to be systematically smaller than planets in single-transiting systems \\citep[cf.][]{Latham11}, a tendency made clearer in Fig.~\\ref{fig:rad_hist}. We also note that the fraction of multi-transiting systems is higher than in the full {\\it Kepler} sample of planet-candidate host stars, where multi-transiting systems account for only $23\\,\\%$ of the total \\citep{Burke14}. The fact that stars in the combined sample are relatively bright may partly explain the high observed fraction of multi-transiting systems, since the smaller planets in these systems would be preferentially detected around bright stars.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.7\\linewidth]{HR2.pdf}\n\\caption{\\small Surface gravity vs.~effective temperature for the KOIs in the combined sample. Symbol size scales linearly with planetary size (for multiple-planet systems, the smallest planet is considered). For reference, a hypothetical solar twin harboring an Earth-size planet is represented by `$\\earth$'. Solar-calibrated evolutionary tracks spanning the mass range $0.8$--$1.6\\,{\\rm M}_\\sun$ (in steps of $0.2\\,{\\rm M}_\\sun$) are shown as continuous lines.\\label{fig:HR2}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{rad_hist.pdf}\n\\caption{\\small Histogram of planetary radius for planets in the combined sample. For multiple-planet systems, we consider the radius of the smallest planet.\\label{fig:rad_hist}}\n\\end{figure}\n\n\nGiven samplings of the posterior probability distributions of $\\cos i_{\\rm s}$ for the $N\\!=\\!87$ stars in the combined sample, we once more try to infer the distribution of the spin-orbit angle $\\psi$ following a hierarchical Bayesian scheme (cf.~Sect.~\\ref{sec:statastero}). Having now access to a larger sample, we decided to also employ a slightly more complex model to represent the distribution function of $\\psi$ in addition to the single-Fisher model.\n\n{\\it A sum of an isotropic and a Fisher distribution.} An alternative to modeling the distribution function of $\\psi$ is by assuming that all spin-orbit angles are drawn either from an isotropic distribution (with probability $f$) or from a Fisher distribution (with probability $1-f$). This so-called `mixture model' can be used to describe a scenario where two different channels exist by which planets migrate, ultimately giving rise to two different obliquity populations. One of these channels produces an isotropic distribution of spin-orbit angles and $f$ can then be interpreted as the fraction of systems that follow such a migration route. We thus have:\n\n", "itemtype": "equation", "pos": 41955, "prevtext": "\nwhere $\\kappa$ measures the probability concentration around $\\psi\\!=\\!0$. As $\\kappa\\!\\rightarrow\\!0$, the distribution becomes the isotropic distribution, whereas for $\\kappa\\!\\rightarrow\\!\\infty$ it becomes a Rayleigh distribution of width $\\sigma\\!=\\!\\kappa^{-1/2}$. However, our observable is $\\cos i_{\\rm s}$ and not $\\psi$, and so we instead use the probability distribution for $\\cos i_{\\rm s}$ given $\\kappa$ as derived by \\citet{Morton14} (hereafter MW14):\n\n", "index": 9, "text": "\\begin{equation}\n\\label{eq:Fisher2}\nf_{\\boldsymbol{\\alpha}}(\\cos i_{\\rm s}) \\equiv p_{\\rm F}(\\cos i_{\\rm s}|\\kappa) = \\frac{2\\kappa}{\\pi \\sinh \\kappa} \\int_{\\cos i_{\\rm s}}^1 \\frac{\\cosh(\\kappa\\sqrt{1-y^2})}{\\sqrt{1-y^2}} \\frac{1}{\\sqrt{1-(\\cos i_{\\rm s}/y)^2}} \\, {\\rm d}y \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"f_{\\boldsymbol{\\alpha}}(\\cos i_{\\rm s})\\equiv p_{\\rm F}(\\cos i_{\\rm s}|\\kappa)%&#10;=\\frac{2\\kappa}{\\pi\\sinh\\kappa}\\int_{\\cos i_{\\rm s}}^{1}\\frac{\\cosh(\\kappa%&#10;\\sqrt{1-y^{2}})}{\\sqrt{1-y^{2}}}\\frac{1}{\\sqrt{1-(\\cos i_{\\rm s}/y)^{2}}}\\,{%&#10;\\rm d}y\\,.\" display=\"block\"><mrow><msub><mi>f</mi><mi>𝜶</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>cos</mi><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>≡</mo><msub><mi>p</mi><mi mathvariant=\"normal\">F</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>cos</mi><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">|</mo><mi>κ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>κ</mi></mrow><mrow><mi>π</mi><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mi>κ</mi></mrow></mrow></mfrac><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mn>1</mn></msubsup><mfrac><mrow><mi>cosh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>κ</mi><mo>⁢</mo><msqrt><mrow><mn>1</mn><mo>-</mo><msup><mi>y</mi><mn>2</mn></msup></mrow></msqrt></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msqrt><mrow><mn>1</mn><mo>-</mo><msup><mi>y</mi><mn>2</mn></msup></mrow></msqrt></mfrac><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><msqrt><mrow><mn>1</mn><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo>/</mo><mi>y</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></msqrt></mfrac></mpadded><mi mathvariant=\"normal\">d</mi><mpadded width=\"+1.7pt\"><mi>y</mi></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": " \nor, in terms of the observable $\\cos i_{\\rm s}$,\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nWe refer to this parameterized model as the `single-Fisher model' and adopt a uniform prior for $\\kappa$ in the range [0,200]. Figure \\ref{fig:Fisher} shows $p_{\\rm F}(\\psi|\\kappa)$ and $p_{\\rm F}(\\cos i_{\\rm s}|\\kappa)$ for a set of concentration parameters $\\kappa$. Finally, we sample the joint PPD of the model parameters $\\boldsymbol{\\alpha}$ (or simply $\\kappa$ in the present case) following a hierarchical Bayesian scheme.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics*[scale=0.68]{Fisher.pdf}\n\\includegraphics*[scale=0.68]{Fisher2.pdf}\n\\caption{\\small Fisher probability distribution. Top panel: The individual Fisher distributions are characterized by different concentration parameters $\\kappa$, namely, $\\kappa\\!=\\!2,10,50$, and 100. The solar value $\\psi_\\sun\\!=\\!7.155\\degr$ is shown for reference \\citep{BeckGiles}. Bottom panel: The distribution $p_{\\rm F}(\\cos i_{\\rm s}|\\kappa)$ is shown for $\\kappa\\!=\\!2,10,50$, and 100. The isotropic distribution is depicted by a dashed curve in both panels.\\label{fig:Fisher}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{post_singleF_kappa_astero.pdf}\n\\caption{\\small Posterior probability distribution of the concentration parameter $\\kappa$ in the single-Fisher model (asteroseismic sample). Distributions for the different cohorts of systems are color-coded. A logarithmic scale is used along the horizontal axis to emphasize the sharp fall-off at low $\\kappa$.\\label{fig:post_singleF_kappa_astero}}\n\\end{figure}\n\n\nThe PPD of the concentration parameter $\\kappa$ is shown in Fig.~\\ref{fig:post_singleF_kappa_astero}. Distributions for the different cohorts of systems are color-coded. Table \\ref{tb:reshierarchical} presents a summary of the results. The posterior of $\\kappa$ is dominated by the (uniform) prior over most of the range [0,200], the exception being at small $\\kappa$, where the posterior falls sharply at $\\kappa\\!\\approx\\!10$ (the logarithmic scale along the horizontal axis in Fig.~\\ref{fig:post_singleF_kappa_astero} emphasizes this point). Based on the lower bounds of the $95.4\\,\\%$ HPD credible regions (see Table \\ref{tb:reshierarchical}), it can be stated that the concentration parameter $\\kappa$ is significantly different from zero, thus ruling out isotropy.\n\nThe constraints on spin-orbit alignment made possible by an analysis of the asteroseismic sample are in qualitative agreement with the outcome of the analysis presented in \\citet[][]{Hirano14}, who have estimated $i_{\\rm s}$ for a sample of 25 (coincidentally) KOIs based on measurements of their rotation period, rotational line broadening, and stellar radius. Furthermore, our results cannot be used to support the recent finding by MW14 that the obliquities of systems with a single transiting planet are systematically larger than those with multiple transiting planets. MW14 have, however, considered a substantially larger sample, having performed an ensemble analysis of a compilation of 70 KOIs whose obliquity measurements had previously been published \\citep[these included most of the KOIs analyzed by][]{Hirano14}.\n\nThe small size of the asteroseismic sample prevents us from placing more stringent constraints on spin-orbit alignment and more systems would be needed to draw firmer conclusions. In the next section we explore the possibility of extending the MW14 sample by combining it with our asteroseismic sample, thus forming the largest ensemble to date of measured $i_{\\rm s}$ for exoplanet-host stars. We will be particularly interested in assessing the impact of adding our asteroseismic sample (representing just over $1/4$ of the combined sample) to the ensemble analysis.  \n\n\\subsection{Combined sample}\\label{sec:comb}\nWe combined the asteroseismic sample with the compilation by MW14 in order to place statistical constraints on the spin-orbit alignment of exoplanet systems. There are 62 additional (non-overlapping) systems in the sample of MW14, of which 23 are multi-transiting and 39 are single-transiting (we note that KOI-2636 has in the meantime been reclassified as multi-transiting). We thus obtain a combined sample of 87 systems, of which 37 are multi-transiting and 50 are single-transiting. There are at least three reasons for considering an analysis that uses the combined sample: \\begin{inparaenum}[(i)] \\item as already mentioned, the combined sample is, to date, the largest ensemble of measured $i_{\\rm s}$ for exoplanet-host stars; \\item the two samples being combined are complementary in terms of $T_{\\rm eff}$ coverage (see Fig.~\\ref{fig:HR2}); \\item the hierarchical Bayesian approach adopted in this work (cf.~Sect.~\\ref{sec:statastero}) is able to handle the inhomogeneous nature of the combined sample in a straightforward manner\\end{inparaenum}.\n\nFigure \\ref{fig:HR2} displays the stars in the combined sample in a $\\log g$ vs.~$T_{\\rm eff}$ diagram. Multi- and single-transiting systems are seen to span similar ranges of effective temperature ($4500\\!\\la\\!T_{\\rm eff}\\!\\la\\!6500\\:{\\rm K}$) and surface gravity ($3.9\\!\\la\\!\\log g\\!\\la\\!4.6\\:{\\rm dex}$). Stars belonging to the asteroseismic sample are responsible for populating the hot (and hence massive) end of the parameter space, where flux modulations due to starspots are hardly detectable and a measurement of the photometric $P_{\\rm rot}$ is thus made difficult \\citep[e.g.,][]{Radick82}. Conversely, the cool end of the parameter space is mainly populated by stars belonging to the MW14 sample, since their oscillation amplitudes are too small, and the stars in general too faint, to allow detecting the oscillations \\cite[e.g.,][]{CampanteSurfGrav}. Furthermore, planets in multi-transiting systems tend to be systematically smaller than planets in single-transiting systems \\citep[cf.][]{Latham11}, a tendency made clearer in Fig.~\\ref{fig:rad_hist}. We also note that the fraction of multi-transiting systems is higher than in the full {\\it Kepler} sample of planet-candidate host stars, where multi-transiting systems account for only $23\\,\\%$ of the total \\citep{Burke14}. The fact that stars in the combined sample are relatively bright may partly explain the high observed fraction of multi-transiting systems, since the smaller planets in these systems would be preferentially detected around bright stars.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.7\\linewidth]{HR2.pdf}\n\\caption{\\small Surface gravity vs.~effective temperature for the KOIs in the combined sample. Symbol size scales linearly with planetary size (for multiple-planet systems, the smallest planet is considered). For reference, a hypothetical solar twin harboring an Earth-size planet is represented by `$\\earth$'. Solar-calibrated evolutionary tracks spanning the mass range $0.8$--$1.6\\,{\\rm M}_\\sun$ (in steps of $0.2\\,{\\rm M}_\\sun$) are shown as continuous lines.\\label{fig:HR2}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.8\\linewidth]{rad_hist.pdf}\n\\caption{\\small Histogram of planetary radius for planets in the combined sample. For multiple-planet systems, we consider the radius of the smallest planet.\\label{fig:rad_hist}}\n\\end{figure}\n\n\nGiven samplings of the posterior probability distributions of $\\cos i_{\\rm s}$ for the $N\\!=\\!87$ stars in the combined sample, we once more try to infer the distribution of the spin-orbit angle $\\psi$ following a hierarchical Bayesian scheme (cf.~Sect.~\\ref{sec:statastero}). Having now access to a larger sample, we decided to also employ a slightly more complex model to represent the distribution function of $\\psi$ in addition to the single-Fisher model.\n\n{\\it A sum of an isotropic and a Fisher distribution.} An alternative to modeling the distribution function of $\\psi$ is by assuming that all spin-orbit angles are drawn either from an isotropic distribution (with probability $f$) or from a Fisher distribution (with probability $1-f$). This so-called `mixture model' can be used to describe a scenario where two different channels exist by which planets migrate, ultimately giving rise to two different obliquity populations. One of these channels produces an isotropic distribution of spin-orbit angles and $f$ can then be interpreted as the fraction of systems that follow such a migration route. We thus have:\n\n", "index": 11, "text": "\\begin{equation}\n\\label{eq:mixture}\nf_{\\boldsymbol{\\alpha}}(\\psi) \\equiv \\frac{f}{2}\\sin\\psi + (1-f)\\,p_{\\rm F}(\\psi|\\kappa) \\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"f_{\\boldsymbol{\\alpha}}(\\psi)\\equiv\\frac{f}{2}\\sin\\psi+(1-f)\\,p_{\\rm F}(\\psi|%&#10;\\kappa)\\,,\" display=\"block\"><mrow><msub><mi>f</mi><mi>𝜶</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">)</mo></mrow><mo>≡</mo><mfrac><mi>f</mi><mn>2</mn></mfrac><mi>sin</mi><mi>ψ</mi><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>f</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><msub><mi>p</mi><mi mathvariant=\"normal\">F</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">|</mo><mi>κ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nThe mixture model has two free parameters, namely, $f$ and $\\kappa$. We assign uniform priors to both parameters.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{post_singleF_kappa.pdf}\n\\caption{\\small Posterior probability distribution of the concentration parameter $\\kappa$ in the single-Fisher model (combined sample). Distributions for the different cohorts of systems are color-coded. The dashed black line depicts the posterior obtained basing the analysis on the asteroseismic sample alone.\\label{fig:post_singleF_kappa}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics*[scale=0.56]{post_mixture_f.pdf}\n\\includegraphics*[scale=0.56]{post_mixture_kappa.pdf}\n\\caption{\\small Posterior probability distributions of the fraction $f$ of isotropic systems (top panel) and the concentration parameter $\\kappa$ (bottom panel) in the mixture model. Distributions for the different cohorts of systems are color-coded. The dashed black line in the bottom panel depicts the posterior obtained basing the analysis on the asteroseismic sample alone (where the single-Fisher model has been used).\\label{fig:post_mixture}}\n\\end{figure}\n\n\nThe PPD of the concentration parameter $\\kappa$ in the single-Fisher model is shown in Fig.~\\ref{fig:post_singleF_kappa}. Figure \\ref{fig:post_mixture} shows the PPDs of the fraction $f$ of isotropic systems (top panel) and the concentration parameter $\\kappa$ (bottom panel) in the mixture model. Distributions for the different cohorts of systems are color-coded in each panel. Table \\ref{tb:reshierarchical} presents a summary of the results, where we also report the Bayesian model evidence, $E$, for each cohort of systems. The Bayesian evidence is computed by taking the integral of Eq.~(\\ref{eq:postalpha}) over the parameter space spanned by the model parameters $\\boldsymbol{\\alpha}$.\n\nMW14 have also considered the single-Fisher model, and the addition of the asteroseismic sample in the present analysis leads to consistent results within the quoted credible regions. For multi-transiting systems, however, the posteriors of $\\kappa$ in both works differ in shape and appear to be dominated at large $\\kappa$ by their respective priors. Our choice of a uniform prior on $\\kappa$, as opposed to $p(\\kappa)\\!\\propto\\!(1+\\kappa^2)^{-3/4}$ in MW14, was made to prevent the underestimation of $\\kappa$ when $\\kappa$ is large. We confirmed our suspicion that the prior may be dominating at large $\\kappa$ by repeating the analysis having used the latter prior on $\\kappa$ instead. We take this as an indication that the available data may not be able to fully constrain the posterior of $\\kappa$ for multi-transiting systems, in particular at large $\\kappa$.\n\nFigures \\ref{fig:post_singleF_kappa} and \\ref{fig:post_mixture} possess a number of other interesting features: \\begin{inparaenum}[(i)] \\item the posteriors of $\\kappa$ (in both models) and $f$ are not compatible with an isotropic distribution for $\\psi$; \\item multi-transiting systems tend to be characterized by a large $\\kappa$ or, equivalently, by low obliquities; \\item the posterior of $\\kappa$ is similar for multi-transiting systems irrespective of the model being considered, but a difference exists in the case of single-transiting systems\\end{inparaenum}. These points will be used in support of the discussion presented in the next section.\n\n\\section{Discussion and conclusions}\\label{sec:conclusions}\nThe main outputs of this work are twofold, namely, the presentation of individual asteroseismic results on the stellar inclination angle for a sample of {\\it Kepler} host stars (Sect.~\\ref{sec:astero}) and the placement of statistical constraints on the spin-orbit alignment of exoplanet systems (Sect.~\\ref{sec:stat}).\n\n\\subsection{Asteroseismic analysis}\\label{sec:conclusions_asteroseismic}\nThe asteroseismic sample considered herein consists of 25 {\\it Kepler} solar-type host stars. Two of the systems, HAT-P-7 and Kepler-25, are of particular interest, since the available measurements of $i_{\\rm o}$, $i_{\\rm s}$, and $\\lambda$ allow constraining the spin-orbit angle $\\psi$. We find that the orbit of the hot-Jupiter HAT-P-7b (Kepler-2b) is likely to be retrograde ($93.5\\degr\\!<\\!\\psi\\!<\\!138.4\\degr$, as given by the $68.3\\,\\%$ HPD credible region), in good agreement with previous works by \\citet{Benomar14} and \\citet{Lund14}. The orbit of Kepler-25c, on the other hand, seems to be well aligned with the stellar spin axis ($1.6\\degr\\!<\\!\\psi\\!<\\!19.3\\degr$, as given by the $68.3\\,\\%$ HPD credible region). Our results thus do not support the statement made by \\citet{Benomar14} that this system is (mildly) misaligned. The $68.3\\,\\%$ credible regions for $\\psi$ in both works overlap. This is the case despite the differences in the adopted data preparation and data analysis methodologies. Moreover, the $95.4\\,\\%$ credible region found by \\citet{Benomar14} contains a nonnegligible probability of alignment. Hence, one cannot talk of a significant discrepancy between the results, i.e., the statement made by \\citet{Benomar14} claiming misalignment may be regarded as an over-interpretation not strongly supported by their results.\n\nWe note that Kepler-25 is a late F-type star ($T_{\\rm eff}\\!\\approx\\!6270\\:{\\rm K}$), and consequently it exhibits broad mode profiles that hinder our ability to resolve and extract signatures of rotation in the power spectrum ($\\nu_{\\rm s}/\\Gamma\\!=\\!0.46$; see Table \\ref{tb:results}). Coupled to a low S/N in the p modes (${\\rm S/N}\\!=\\!1.0$; see Table \\ref{tb:results}), this means that the effect of the correlated background noise on the mode profiles may bias the outcome of the peak-bagging analysis. A reduced visibility of the multiplet components is an issue common to a substantial fraction of the stars in the asteroseismic sample (see Table \\ref{tb:results}). To test our asteroseismic method, and in particular the robustness of the returned uncertainties on $i_{\\rm s}$, we have produced artificial power spectra with varying input $i_{\\rm s}$ for a representative set of stars in the asteroseismic sample (see Appendix \\ref{append:artificial}). We managed to retrieve the input $i_{\\rm s}$ at the 1-$\\sigma$ level in $75\\,\\%$ of the simulated cases (21/28), and at the 2-$\\sigma$ level in $\\sim\\!96\\,\\%$ of the cases (27/28), leading us to conclude that the returned uncertainties are robust.\n\nAs a further sanity check, detailed peak-bagging was conducted for all stars using an affine-invariant ensemble MCMC algorithm \\citep{emcee,Lund14}. The main purpose of this exercise was to both investigate the impact of the sampling algorithm on the resulting joint PPD and the impact of using a different frequency range (or number of observed modes) in the peak-bagging analysis. The overall agreement between the Metropolis--Hastings (on which our results are based; see Appendix \\ref{append:specfit}) and affine-invariant implementations is excellent.\n\nBesides HAT-P-7, there are five other systems in the asteroseismic sample that could potentially be misaligned, namely, Kepler-50, Kepler-93, Kepler-145, Kepler-409, and KOI-280. Interestingly, Kepler-50, Kepler-93, and Kepler-145 are all multiple-planet systems (but see discussion on Kepler-93 below). This interpretation is based on the $68.3\\,\\%$ HPD credible regions. However, inclination angles close to $90\\degr$ have nonnegligible probability, and so our results are consistent with alignment at the $95.4\\,\\%$ (or 2-$\\sigma$) level. In light of these results, the system surrounding the red-giant star Kepler-56 \\citep{Huber13} remains as the only unambiguous detection to date of a misaligned multiple-planet system \\citep[we note that the reported misalignment of the super-Earth 55 Cnc e is controversial;][]{Bourrier,LopezMorales}.\n\nKepler-50 was found by \\citet{Chaplin13} to have its spin axis nearly perpendicular to the line of sight, which matches our current findings only at the 2-$\\sigma$ level. We have ruled out the effect of a different peak-bagging prescription as the cause of this discrepancy by analyzing the power spectrum in that work with our current approach. This discrepancy is then likely due to the different temporal coverages: in the present work we used an additional six quarters of {\\it Kepler} observations compared to the 18 months of data already used by \\citet{Chaplin13}. An increased temporal coverage is known to reduce existing biases on the fitted $i_{\\rm s}$ \\citep{Ballot08}. We demonstrate the importance of this effect in Appendix \\ref{append:artificial} by performing tests with degraded Sun-as-a-star data with white noise added to levels comparable with Kepler-50. Kepler-93 is a single-transiting system with a long-period, non-transiting object (Kepler-93c) that was detected using the RV method, although its planetary nature is yet to be confirmed \\citep{Marcy14,Dressing15}. It remains to be tested whether Kepler-93c may have been responsible for scattering Kepler-93b inward onto a short-period orbit. In an attempt to explain the potential misalignments for these multiple-planet systems by the presence of a bound stellar companion, we searched the high-resolution imaging surveys of \\citet{Howell11}, \\citet{Adams12}, \\citet{Law14}, and \\citet{LilloBox14}, as well as the high-resolution spectroscopy survey of \\citet{Kolbl15}. Within the detectability limits of these surveys no companions have been detected for the three multiple-planet systems in question. A recent work combining broadband adaptive optics and non-redundant aperture masking \\citetext{A.~L.~Kraus et al., submitted} has, however, led to the detection of companions in the Kepler-93 and Kepler-145 systems which, if gravitationally bound, must be late-type dwarfs at large ($\\ga\\!100\\:{\\rm AU}$) separations.\n\n\\subsection{Statistical analysis}\\label{sec:conclusions_statistical}\nFigure \\ref{fig:averageposterior} and the analysis performed in Sect.~\\ref{sec:statastero} based on the asteroseismic sample suggest that the directions of the stellar spin and planetary orbital axes are correlated. This was confirmed by the analysis performed in Sect.~\\ref{sec:comb} based on the combined sample. But do the measured spin-orbit orientations reflect primordial conditions? The degree of spin-orbit alignment is correlated with the planet-to-star mass ratio, the orbital distance, and the stellar effective temperature \\citep{Albrecht12}. Tidal effects are not expected to be significant for small planets and planets in long orbits \\citep{Albrecht13}, but could play an important role in systems with close-in giants (i.e., $P_{\\rm o}\\!\\leq\\!10\\:{\\rm d}$ and $R_{\\rm p}\\!>\\!6\\,R_\\earth$). For these systems, we calculated the alignment timescale $\\tau_{\\rm CE}$ presented by \\citet{Albrecht12}, which is calibrated using binary-star data (see their eq.~2). The estimated value of $\\tau_{\\rm CE}\\!\\sim\\!9.8\\:{\\rm Gyr}$ for the hot-Jupiter system HAT-P-7 far exceeds the age of the star as derived from asteroseismology, $t\\!=\\!2.12^{+0.27}_{-0.24}\\:{\\rm Gyr}$ \\citep{VSA15}. The single-transiting systems Kepler-17, Kepler-43, and Kepler-63 also host a close-in giant, and all have $\\tau_{\\rm CE}$ exceeding the estimated age of the Universe ($16$, $49$, and $\\sim\\!10^5\\:{\\rm Gyr}$, respectively). Therefore, the planetary systems considered in this work should not have had their obliquities damped by tides, meaning that the spin-orbit orientations should in principle reflect nearly primordial conditions.\n\nA related aspect that is of particular relevance in explaining the formation of hot-Jupiter systems has to do with the observation that multi-transiting systems tend to be characterized by a large concentration (i.e., around $\\psi\\!=\\!0$) parameter $\\kappa$ or, equivalently, by low obliquities (e.g., $\\kappa\\!>\\!13$ based on the asteroseismic sample). A tendency for low obliquities in multi-transiting systems was first reported by \\citet{Albrecht13}. Under the assumption that the planetary orbits in multi-transiting systems are nearly coplanar and trace the plane of the protoplanetary disk, this would imply that the high obliquities observed for hot-Jupiter systems are associated with planet migration. Our analysis thus favors migration mechanisms capable of exciting large obliquities in explaining hot-Jupiter formation --- planet-planet scattering \\citep[e.g.,][]{RasioFord,Nagasawa08}, Kozai cycles \\cite[e.g.,][]{Holman97,Kozai,FabryckyTremaine}, or secular chaos \\citep[e.g.,][]{WuLithwick} --- over the paradigm of inward spiraling along the protoplanetary disk --- as in the case of Type II migration \\citep[e.g.,][]{TypeII,LinPapaloizou}.\n\nThe results from the analysis of the asteroseismic sample cannot be used to support the finding by MW14 that the obliquities of systems with a single transiting planet are systematically larger than those with multiple transiting planets, which has been taken as evidence that a substantial fraction of {\\it Kepler}'s single-transiting systems are in fact a separate population of compact multiple-planet systems characterized by large mutual inclinations. We should note, however, that the sensitivity of the statistical analysis performed on the asteroseismic sample is limited by the small number of systems (11 single- and 14 multi-transiting systems).\n\nFinally, based on the analysis of the combined sample, we looked into the statistical merits of the two models for the distribution of $\\psi$, namely, the single-Fisher model and the mixture model. This was done by computing the so-called Bayes' factor, $F_{\\rm B}$, given by the ratio of the Bayesian evidences $E$ (see Table \\ref{tb:reshierarchical}). The Bayes' factor is a summary of the evidence provided by the data in favor of one statistical model as opposed to a competing model. A scale for the interpretation of $F_{\\rm B}$ was given by \\citet{Jeffreys61} \\citep[see also][]{KassRaftery}. For multi-transiting systems, there is `substantial' evidence (i.e., $0.5\\!<\\!\\log_{10}F_{\\rm B}\\!=\\!0.92\\!<\\!1$) favoring the single-Fisher model over the mixture model. The converse is true for single-transiting systems, with the mixture model being `decisively' favored (i.e., $\\log_{10}F_{\\rm B}\\!=\\!2.05\\!>\\!2$). This explains why the posterior of $\\kappa$ is similar for multi-transiting systems irrespective of the model being considered, since the inclusion of an isotropic component via the mixture model is not supported by the data. It also suggests that the obliquity distribution of single-transiting systems may be multimodal and therefore better explained by the mixture model, pointing to two distinct channels by which planets migrate (with $\\sim\\!20\\,\\%$ of these systems belonging to a `dynamically hot' category). In both cases, however, the (statistically favored) posterior of $\\kappa$ still appears to be dominated at large $\\kappa$ by the prior.\n\n\\subsection{Outlook}\\label{sec:conclusions_outlook}\nThroughout the duration of the {\\it Kepler} mission, asteroseismology has played an important role in the characterization of host stars and their planetary systems. This work presents the first analysis of an ensemble of asteroseismic obliquity measurements made for transiting systems, being another example of the enduring synergy between asteroseismology and exoplanetary science. The prospect of using asteroseismology to measure the obliquities of systems with evolved hosts will be addressed when data from the {\\it TESS} mission \\citep[Transiting Exoplanet Survey Satellite;][]{TESS} become available. The planned {\\it PLATO} mission \\citep[PLAnetary Transits and Oscillations of stars;][]{PLATO} will further offer the possibility of extending these asteroseismic measurements to bright solar-type hosts in wide fields with a coverage of 2--3 years.\n\n\n\n\\appendix\n\\section{An analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$}\\label{append:psipost}\nSuppose an observer has measured $i_{\\rm s}$ and $i_{\\rm o}$ for a particular transiting system. What can then be inferred about $\\psi$? Here we derive an analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$, the posterior probability distribution for the spin-orbit angle $\\psi$ conditioned on the stellar inclination angle $i_{\\rm s}$ and on the orbital inclination angle $i_{\\rm o}$. As far as the authors are aware, such derivation has not been presented in the literature.\n\nWe start by deriving an expression for $p(i_{\\rm s}|\\psi,i_{\\rm o})$, i.e., the posterior probability distribution for $i_{\\rm s}$ conditioned on $\\psi$ and $i_{\\rm o}$. We assume that for a given $\\psi$, the probability distribution of the azimuthal angle $\\phi$ is uniformly distributed between $-\\pi$ and $+\\pi$ \\citep[see][]{Fabrycky09}. We then express $i_{\\rm s}$ in terms of $\\psi$, $i_{\\rm o}$, and $\\phi$ by eliminating $\\lambda$ from Eqs.~(\\ref{eq:geom1})--(\\ref{eq:geom3}):\n\n", "itemtype": "equation", "pos": 50743, "prevtext": " \nor, in terms of the observable $\\cos i_{\\rm s}$,\n\n", "index": 13, "text": "\\begin{equation}\n\\label{eq:mixture2}\nf_{\\boldsymbol{\\alpha}}(\\cos i_{\\rm s}) \\equiv f + (1-f)\\,p_{\\rm F}(\\cos i_{\\rm s}|\\kappa) \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"f_{\\boldsymbol{\\alpha}}(\\cos i_{\\rm s})\\equiv f+(1-f)\\,p_{\\rm F}(\\cos i_{\\rm s%&#10;}|\\kappa)\\,.\" display=\"block\"><mrow><msub><mi>f</mi><mi>𝜶</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>cos</mi><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>≡</mo><mi>f</mi><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>f</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><msub><mi>p</mi><mi mathvariant=\"normal\">F</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>cos</mi><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">|</mo><mi>κ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nSince $i_{\\rm s}(\\psi,i_{\\rm o},-\\phi)=i_{\\rm s}(\\psi,i_{\\rm o},\\phi)$, we need only consider $\\phi$ in the interval $[0,\\pi]$. Next, we transform variables \\citep[e.g.,][chap.~5]{Meyer70} from $\\phi$ to $i_{\\rm s}$ in order to arrive at an expression for $p(i_{\\rm s}|\\psi,i_{\\rm o})$:\n\n", "itemtype": "equation", "pos": 67770, "prevtext": "\nThe mixture model has two free parameters, namely, $f$ and $\\kappa$. We assign uniform priors to both parameters.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.75\\linewidth]{post_singleF_kappa.pdf}\n\\caption{\\small Posterior probability distribution of the concentration parameter $\\kappa$ in the single-Fisher model (combined sample). Distributions for the different cohorts of systems are color-coded. The dashed black line depicts the posterior obtained basing the analysis on the asteroseismic sample alone.\\label{fig:post_singleF_kappa}}\n\\end{figure}\n\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics*[scale=0.56]{post_mixture_f.pdf}\n\\includegraphics*[scale=0.56]{post_mixture_kappa.pdf}\n\\caption{\\small Posterior probability distributions of the fraction $f$ of isotropic systems (top panel) and the concentration parameter $\\kappa$ (bottom panel) in the mixture model. Distributions for the different cohorts of systems are color-coded. The dashed black line in the bottom panel depicts the posterior obtained basing the analysis on the asteroseismic sample alone (where the single-Fisher model has been used).\\label{fig:post_mixture}}\n\\end{figure}\n\n\nThe PPD of the concentration parameter $\\kappa$ in the single-Fisher model is shown in Fig.~\\ref{fig:post_singleF_kappa}. Figure \\ref{fig:post_mixture} shows the PPDs of the fraction $f$ of isotropic systems (top panel) and the concentration parameter $\\kappa$ (bottom panel) in the mixture model. Distributions for the different cohorts of systems are color-coded in each panel. Table \\ref{tb:reshierarchical} presents a summary of the results, where we also report the Bayesian model evidence, $E$, for each cohort of systems. The Bayesian evidence is computed by taking the integral of Eq.~(\\ref{eq:postalpha}) over the parameter space spanned by the model parameters $\\boldsymbol{\\alpha}$.\n\nMW14 have also considered the single-Fisher model, and the addition of the asteroseismic sample in the present analysis leads to consistent results within the quoted credible regions. For multi-transiting systems, however, the posteriors of $\\kappa$ in both works differ in shape and appear to be dominated at large $\\kappa$ by their respective priors. Our choice of a uniform prior on $\\kappa$, as opposed to $p(\\kappa)\\!\\propto\\!(1+\\kappa^2)^{-3/4}$ in MW14, was made to prevent the underestimation of $\\kappa$ when $\\kappa$ is large. We confirmed our suspicion that the prior may be dominating at large $\\kappa$ by repeating the analysis having used the latter prior on $\\kappa$ instead. We take this as an indication that the available data may not be able to fully constrain the posterior of $\\kappa$ for multi-transiting systems, in particular at large $\\kappa$.\n\nFigures \\ref{fig:post_singleF_kappa} and \\ref{fig:post_mixture} possess a number of other interesting features: \\begin{inparaenum}[(i)] \\item the posteriors of $\\kappa$ (in both models) and $f$ are not compatible with an isotropic distribution for $\\psi$; \\item multi-transiting systems tend to be characterized by a large $\\kappa$ or, equivalently, by low obliquities; \\item the posterior of $\\kappa$ is similar for multi-transiting systems irrespective of the model being considered, but a difference exists in the case of single-transiting systems\\end{inparaenum}. These points will be used in support of the discussion presented in the next section.\n\n\\section{Discussion and conclusions}\\label{sec:conclusions}\nThe main outputs of this work are twofold, namely, the presentation of individual asteroseismic results on the stellar inclination angle for a sample of {\\it Kepler} host stars (Sect.~\\ref{sec:astero}) and the placement of statistical constraints on the spin-orbit alignment of exoplanet systems (Sect.~\\ref{sec:stat}).\n\n\\subsection{Asteroseismic analysis}\\label{sec:conclusions_asteroseismic}\nThe asteroseismic sample considered herein consists of 25 {\\it Kepler} solar-type host stars. Two of the systems, HAT-P-7 and Kepler-25, are of particular interest, since the available measurements of $i_{\\rm o}$, $i_{\\rm s}$, and $\\lambda$ allow constraining the spin-orbit angle $\\psi$. We find that the orbit of the hot-Jupiter HAT-P-7b (Kepler-2b) is likely to be retrograde ($93.5\\degr\\!<\\!\\psi\\!<\\!138.4\\degr$, as given by the $68.3\\,\\%$ HPD credible region), in good agreement with previous works by \\citet{Benomar14} and \\citet{Lund14}. The orbit of Kepler-25c, on the other hand, seems to be well aligned with the stellar spin axis ($1.6\\degr\\!<\\!\\psi\\!<\\!19.3\\degr$, as given by the $68.3\\,\\%$ HPD credible region). Our results thus do not support the statement made by \\citet{Benomar14} that this system is (mildly) misaligned. The $68.3\\,\\%$ credible regions for $\\psi$ in both works overlap. This is the case despite the differences in the adopted data preparation and data analysis methodologies. Moreover, the $95.4\\,\\%$ credible region found by \\citet{Benomar14} contains a nonnegligible probability of alignment. Hence, one cannot talk of a significant discrepancy between the results, i.e., the statement made by \\citet{Benomar14} claiming misalignment may be regarded as an over-interpretation not strongly supported by their results.\n\nWe note that Kepler-25 is a late F-type star ($T_{\\rm eff}\\!\\approx\\!6270\\:{\\rm K}$), and consequently it exhibits broad mode profiles that hinder our ability to resolve and extract signatures of rotation in the power spectrum ($\\nu_{\\rm s}/\\Gamma\\!=\\!0.46$; see Table \\ref{tb:results}). Coupled to a low S/N in the p modes (${\\rm S/N}\\!=\\!1.0$; see Table \\ref{tb:results}), this means that the effect of the correlated background noise on the mode profiles may bias the outcome of the peak-bagging analysis. A reduced visibility of the multiplet components is an issue common to a substantial fraction of the stars in the asteroseismic sample (see Table \\ref{tb:results}). To test our asteroseismic method, and in particular the robustness of the returned uncertainties on $i_{\\rm s}$, we have produced artificial power spectra with varying input $i_{\\rm s}$ for a representative set of stars in the asteroseismic sample (see Appendix \\ref{append:artificial}). We managed to retrieve the input $i_{\\rm s}$ at the 1-$\\sigma$ level in $75\\,\\%$ of the simulated cases (21/28), and at the 2-$\\sigma$ level in $\\sim\\!96\\,\\%$ of the cases (27/28), leading us to conclude that the returned uncertainties are robust.\n\nAs a further sanity check, detailed peak-bagging was conducted for all stars using an affine-invariant ensemble MCMC algorithm \\citep{emcee,Lund14}. The main purpose of this exercise was to both investigate the impact of the sampling algorithm on the resulting joint PPD and the impact of using a different frequency range (or number of observed modes) in the peak-bagging analysis. The overall agreement between the Metropolis--Hastings (on which our results are based; see Appendix \\ref{append:specfit}) and affine-invariant implementations is excellent.\n\nBesides HAT-P-7, there are five other systems in the asteroseismic sample that could potentially be misaligned, namely, Kepler-50, Kepler-93, Kepler-145, Kepler-409, and KOI-280. Interestingly, Kepler-50, Kepler-93, and Kepler-145 are all multiple-planet systems (but see discussion on Kepler-93 below). This interpretation is based on the $68.3\\,\\%$ HPD credible regions. However, inclination angles close to $90\\degr$ have nonnegligible probability, and so our results are consistent with alignment at the $95.4\\,\\%$ (or 2-$\\sigma$) level. In light of these results, the system surrounding the red-giant star Kepler-56 \\citep{Huber13} remains as the only unambiguous detection to date of a misaligned multiple-planet system \\citep[we note that the reported misalignment of the super-Earth 55 Cnc e is controversial;][]{Bourrier,LopezMorales}.\n\nKepler-50 was found by \\citet{Chaplin13} to have its spin axis nearly perpendicular to the line of sight, which matches our current findings only at the 2-$\\sigma$ level. We have ruled out the effect of a different peak-bagging prescription as the cause of this discrepancy by analyzing the power spectrum in that work with our current approach. This discrepancy is then likely due to the different temporal coverages: in the present work we used an additional six quarters of {\\it Kepler} observations compared to the 18 months of data already used by \\citet{Chaplin13}. An increased temporal coverage is known to reduce existing biases on the fitted $i_{\\rm s}$ \\citep{Ballot08}. We demonstrate the importance of this effect in Appendix \\ref{append:artificial} by performing tests with degraded Sun-as-a-star data with white noise added to levels comparable with Kepler-50. Kepler-93 is a single-transiting system with a long-period, non-transiting object (Kepler-93c) that was detected using the RV method, although its planetary nature is yet to be confirmed \\citep{Marcy14,Dressing15}. It remains to be tested whether Kepler-93c may have been responsible for scattering Kepler-93b inward onto a short-period orbit. In an attempt to explain the potential misalignments for these multiple-planet systems by the presence of a bound stellar companion, we searched the high-resolution imaging surveys of \\citet{Howell11}, \\citet{Adams12}, \\citet{Law14}, and \\citet{LilloBox14}, as well as the high-resolution spectroscopy survey of \\citet{Kolbl15}. Within the detectability limits of these surveys no companions have been detected for the three multiple-planet systems in question. A recent work combining broadband adaptive optics and non-redundant aperture masking \\citetext{A.~L.~Kraus et al., submitted} has, however, led to the detection of companions in the Kepler-93 and Kepler-145 systems which, if gravitationally bound, must be late-type dwarfs at large ($\\ga\\!100\\:{\\rm AU}$) separations.\n\n\\subsection{Statistical analysis}\\label{sec:conclusions_statistical}\nFigure \\ref{fig:averageposterior} and the analysis performed in Sect.~\\ref{sec:statastero} based on the asteroseismic sample suggest that the directions of the stellar spin and planetary orbital axes are correlated. This was confirmed by the analysis performed in Sect.~\\ref{sec:comb} based on the combined sample. But do the measured spin-orbit orientations reflect primordial conditions? The degree of spin-orbit alignment is correlated with the planet-to-star mass ratio, the orbital distance, and the stellar effective temperature \\citep{Albrecht12}. Tidal effects are not expected to be significant for small planets and planets in long orbits \\citep{Albrecht13}, but could play an important role in systems with close-in giants (i.e., $P_{\\rm o}\\!\\leq\\!10\\:{\\rm d}$ and $R_{\\rm p}\\!>\\!6\\,R_\\earth$). For these systems, we calculated the alignment timescale $\\tau_{\\rm CE}$ presented by \\citet{Albrecht12}, which is calibrated using binary-star data (see their eq.~2). The estimated value of $\\tau_{\\rm CE}\\!\\sim\\!9.8\\:{\\rm Gyr}$ for the hot-Jupiter system HAT-P-7 far exceeds the age of the star as derived from asteroseismology, $t\\!=\\!2.12^{+0.27}_{-0.24}\\:{\\rm Gyr}$ \\citep{VSA15}. The single-transiting systems Kepler-17, Kepler-43, and Kepler-63 also host a close-in giant, and all have $\\tau_{\\rm CE}$ exceeding the estimated age of the Universe ($16$, $49$, and $\\sim\\!10^5\\:{\\rm Gyr}$, respectively). Therefore, the planetary systems considered in this work should not have had their obliquities damped by tides, meaning that the spin-orbit orientations should in principle reflect nearly primordial conditions.\n\nA related aspect that is of particular relevance in explaining the formation of hot-Jupiter systems has to do with the observation that multi-transiting systems tend to be characterized by a large concentration (i.e., around $\\psi\\!=\\!0$) parameter $\\kappa$ or, equivalently, by low obliquities (e.g., $\\kappa\\!>\\!13$ based on the asteroseismic sample). A tendency for low obliquities in multi-transiting systems was first reported by \\citet{Albrecht13}. Under the assumption that the planetary orbits in multi-transiting systems are nearly coplanar and trace the plane of the protoplanetary disk, this would imply that the high obliquities observed for hot-Jupiter systems are associated with planet migration. Our analysis thus favors migration mechanisms capable of exciting large obliquities in explaining hot-Jupiter formation --- planet-planet scattering \\citep[e.g.,][]{RasioFord,Nagasawa08}, Kozai cycles \\cite[e.g.,][]{Holman97,Kozai,FabryckyTremaine}, or secular chaos \\citep[e.g.,][]{WuLithwick} --- over the paradigm of inward spiraling along the protoplanetary disk --- as in the case of Type II migration \\citep[e.g.,][]{TypeII,LinPapaloizou}.\n\nThe results from the analysis of the asteroseismic sample cannot be used to support the finding by MW14 that the obliquities of systems with a single transiting planet are systematically larger than those with multiple transiting planets, which has been taken as evidence that a substantial fraction of {\\it Kepler}'s single-transiting systems are in fact a separate population of compact multiple-planet systems characterized by large mutual inclinations. We should note, however, that the sensitivity of the statistical analysis performed on the asteroseismic sample is limited by the small number of systems (11 single- and 14 multi-transiting systems).\n\nFinally, based on the analysis of the combined sample, we looked into the statistical merits of the two models for the distribution of $\\psi$, namely, the single-Fisher model and the mixture model. This was done by computing the so-called Bayes' factor, $F_{\\rm B}$, given by the ratio of the Bayesian evidences $E$ (see Table \\ref{tb:reshierarchical}). The Bayes' factor is a summary of the evidence provided by the data in favor of one statistical model as opposed to a competing model. A scale for the interpretation of $F_{\\rm B}$ was given by \\citet{Jeffreys61} \\citep[see also][]{KassRaftery}. For multi-transiting systems, there is `substantial' evidence (i.e., $0.5\\!<\\!\\log_{10}F_{\\rm B}\\!=\\!0.92\\!<\\!1$) favoring the single-Fisher model over the mixture model. The converse is true for single-transiting systems, with the mixture model being `decisively' favored (i.e., $\\log_{10}F_{\\rm B}\\!=\\!2.05\\!>\\!2$). This explains why the posterior of $\\kappa$ is similar for multi-transiting systems irrespective of the model being considered, since the inclusion of an isotropic component via the mixture model is not supported by the data. It also suggests that the obliquity distribution of single-transiting systems may be multimodal and therefore better explained by the mixture model, pointing to two distinct channels by which planets migrate (with $\\sim\\!20\\,\\%$ of these systems belonging to a `dynamically hot' category). In both cases, however, the (statistically favored) posterior of $\\kappa$ still appears to be dominated at large $\\kappa$ by the prior.\n\n\\subsection{Outlook}\\label{sec:conclusions_outlook}\nThroughout the duration of the {\\it Kepler} mission, asteroseismology has played an important role in the characterization of host stars and their planetary systems. This work presents the first analysis of an ensemble of asteroseismic obliquity measurements made for transiting systems, being another example of the enduring synergy between asteroseismology and exoplanetary science. The prospect of using asteroseismology to measure the obliquities of systems with evolved hosts will be addressed when data from the {\\it TESS} mission \\citep[Transiting Exoplanet Survey Satellite;][]{TESS} become available. The planned {\\it PLATO} mission \\citep[PLAnetary Transits and Oscillations of stars;][]{PLATO} will further offer the possibility of extending these asteroseismic measurements to bright solar-type hosts in wide fields with a coverage of 2--3 years.\n\n\n\n\\appendix\n\\section{An analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$}\\label{append:psipost}\nSuppose an observer has measured $i_{\\rm s}$ and $i_{\\rm o}$ for a particular transiting system. What can then be inferred about $\\psi$? Here we derive an analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$, the posterior probability distribution for the spin-orbit angle $\\psi$ conditioned on the stellar inclination angle $i_{\\rm s}$ and on the orbital inclination angle $i_{\\rm o}$. As far as the authors are aware, such derivation has not been presented in the literature.\n\nWe start by deriving an expression for $p(i_{\\rm s}|\\psi,i_{\\rm o})$, i.e., the posterior probability distribution for $i_{\\rm s}$ conditioned on $\\psi$ and $i_{\\rm o}$. We assume that for a given $\\psi$, the probability distribution of the azimuthal angle $\\phi$ is uniformly distributed between $-\\pi$ and $+\\pi$ \\citep[see][]{Fabrycky09}. We then express $i_{\\rm s}$ in terms of $\\psi$, $i_{\\rm o}$, and $\\phi$ by eliminating $\\lambda$ from Eqs.~(\\ref{eq:geom1})--(\\ref{eq:geom3}):\n\n", "index": 15, "text": "\\begin{equation}\n\\label{eq:append1}\ni_{\\rm s}(\\psi,i_{\\rm o},\\phi) = \\arccos(\\cos\\psi\\cos i_{\\rm o} - \\sin\\psi\\sin i_{\\rm o}\\cos\\phi) \\, . \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"i_{\\rm s}(\\psi,i_{\\rm o},\\phi)=\\arccos(\\cos\\psi\\cos i_{\\rm o}-\\sin\\psi\\sin i_{%&#10;\\rm o}\\cos\\phi)\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo>,</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>arccos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nNote that the angles $i_{\\rm s}$ and $\\psi$ are allowed to vary in the interval $[0,\\pi]$ in the previous equation, whereas we restrict $i_{\\rm o}$ to the interval $[0,\\pi/2]$.\n\nWe now resort to Bayes' theorem to derive an analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$:\n\n", "itemtype": "equation", "pos": 68212, "prevtext": "\nSince $i_{\\rm s}(\\psi,i_{\\rm o},-\\phi)=i_{\\rm s}(\\psi,i_{\\rm o},\\phi)$, we need only consider $\\phi$ in the interval $[0,\\pi]$. Next, we transform variables \\citep[e.g.,][chap.~5]{Meyer70} from $\\phi$ to $i_{\\rm s}$ in order to arrive at an expression for $p(i_{\\rm s}|\\psi,i_{\\rm o})$:\n\n", "index": 17, "text": "\\begin{align}\n\\label{eq:append2}\np(i_{\\rm s}|\\psi,i_{\\rm o}) = p(\\phi|\\psi,i_{\\rm o})&\\left|\\frac{\\partial\\phi}{\\partial i_{\\rm s}}\\right| = \\frac{1}{\\pi}\\left|\\frac{\\partial\\phi}{\\partial i_{\\rm s}}\\right| \\nonumber \\\\\n= \\frac{1}{\\pi} \\frac{\\sin i_{\\rm s}}{\\sqrt{\\sin^2\\psi\\sin^2i_{\\rm o}-(\\cos\\psi\\cos i_{\\rm o}-\\cos i_{\\rm s})^2}} \\, &, \\quad \\text{for all } |i_{\\rm o}-\\psi| < i_{\\rm s} < \\pi-|\\pi-i_{\\rm o}-\\psi| \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle p(i_{\\rm s}|\\psi,i_{\\rm o})=p(\\phi|\\psi,i_{\\rm o})\" display=\"inline\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">|</mo><mi>ψ</mi><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>ϕ</mi><mo stretchy=\"false\">|</mo><mi>ψ</mi><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\left|\\frac{\\partial\\phi}{\\partial i_{\\rm s}}\\right|=\\frac{1}{\\pi%&#10;}\\left|\\frac{\\partial\\phi}{\\partial i_{\\rm s}}\\right|\" display=\"inline\"><mrow><mrow><mo>|</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac></mstyle><mo>|</mo></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>π</mi></mfrac></mstyle><mo>⁢</mo><mrow><mo>|</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac></mstyle><mo>|</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{\\pi}\\frac{\\sin i_{\\rm s}}{\\sqrt{\\sin^{2}\\psi\\sin^{2}i_{%&#10;\\rm o}-(\\cos\\psi\\cos i_{\\rm o}-\\cos i_{\\rm s})^{2}}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>π</mi></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><msqrt><mrow><mrow><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></msqrt></mfrac></mstyle></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle,\\quad\\text{for all }|i_{\\rm o}-\\psi|&lt;i_{\\rm s}&lt;\\pi-|\\pi-i_{\\rm o%&#10;}-\\psi|\\,.\" display=\"inline\"><mrow><mo rspace=\"12.5pt\">,</mo><mtext>for all </mtext><mo stretchy=\"false\">|</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><mi>ψ</mi><mo stretchy=\"false\">|</mo><mo>&lt;</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo>&lt;</mo><mi>π</mi><mo>-</mo><mo stretchy=\"false\">|</mo><mi>π</mi><mo>-</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><mi>ψ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere the prior probability $p(\\psi)$ quantifies our assumptions on $\\psi$. We will be adopting the uninformative prior probability $p(\\psi)\\!\\propto\\!\\sin\\psi$, which implies that $\\mathbf{n}_{\\rm s}$ and $\\mathbf{n}_{\\rm o}$ (see Fig.~\\ref{fig:geometry}) are uncorrelated. Finally, by multiplying Eq.~(\\ref{eq:append2}) by $\\sin\\psi$ we arrive at an (unnormalized) expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$:\n\n", "itemtype": "equation", "pos": 68927, "prevtext": "\nNote that the angles $i_{\\rm s}$ and $\\psi$ are allowed to vary in the interval $[0,\\pi]$ in the previous equation, whereas we restrict $i_{\\rm o}$ to the interval $[0,\\pi/2]$.\n\nWe now resort to Bayes' theorem to derive an analytical expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$:\n\n", "index": 19, "text": "\\begin{equation}\n\\label{eq:append3}\np(\\psi|i_{\\rm s},i_{\\rm o}) \\propto p(i_{\\rm s}|\\psi,i_{\\rm o})\\,p(\\psi) \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"p(\\psi|i_{\\rm s},i_{\\rm o})\\propto p(i_{\\rm s}|\\psi,i_{\\rm o})\\,p(\\psi)\\,,\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">|</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">|</mo><mi>ψ</mi><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nNote that the angle $\\psi$ is allowed to vary in the interval $[0,\\pi]$ in the previous equation, whereas we restrict $i_{\\rm s}$ and $i_{\\rm o}$ to the interval $[0,\\pi/2]$.\n\n\\section{Modeling and fitting the power spectrum}\\label{append:specfit}\nExtracting signatures of rotation from the power spectrum is accomplished by a detailed fitting of the observed modes of oscillation, a procedure often referred to as peak-bagging. We are primarily interested in performing a global fit to the power spectrum \\cite[e.g.,][]{Appourchaux08,Campante11,Appourchaux12}, whereby a selection of the observed modes are fitted simultaneously over a broad frequency range. We modeled the limit (noise-free) oscillation spectrum as a series of standard Lorentzian profiles, $\\mathscr{O}(\\nu;\\mathbf{\\Theta}_{\\rm osc})$, which sit atop a background signal described by $\\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg})$:\n\n", "itemtype": "equation", "pos": 69469, "prevtext": "\nwhere the prior probability $p(\\psi)$ quantifies our assumptions on $\\psi$. We will be adopting the uninformative prior probability $p(\\psi)\\!\\propto\\!\\sin\\psi$, which implies that $\\mathbf{n}_{\\rm s}$ and $\\mathbf{n}_{\\rm o}$ (see Fig.~\\ref{fig:geometry}) are uncorrelated. Finally, by multiplying Eq.~(\\ref{eq:append2}) by $\\sin\\psi$ we arrive at an (unnormalized) expression for $p(\\psi|i_{\\rm s},i_{\\rm o})$:\n\n", "index": 21, "text": "\\begin{equation}\n\\label{eq:append4}\np(\\psi|i_{\\rm s},i_{\\rm o}) \\propto \\frac{\\sin i_{\\rm s}\\sin\\psi}{\\sqrt{\\sin^2\\psi\\sin^2i_{\\rm o}-(\\cos\\psi\\cos i_{\\rm o}-\\cos i_{\\rm s})^2}} \\, , \\quad \\text{for all } |i_{\\rm o}-i_{\\rm s}| < \\psi < i_{\\rm o}+i_{\\rm s} \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"p(\\psi|i_{\\rm s},i_{\\rm o})\\propto\\frac{\\sin i_{\\rm s}\\sin\\psi}{\\sqrt{\\sin^{2}%&#10;\\psi\\sin^{2}i_{\\rm o}-(\\cos\\psi\\cos i_{\\rm o}-\\cos i_{\\rm s})^{2}}}\\,,\\quad%&#10;\\text{for all }|i_{\\rm o}-i_{\\rm s}|&lt;\\psi&lt;i_{\\rm o}+i_{\\rm s}\\,.\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>ψ</mi><mo stretchy=\"false\">|</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo>,</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>ψ</mi></mrow></mrow><msqrt><mrow><mrow><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>ψ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></msqrt></mfrac></mpadded><mo rspace=\"12.5pt\">,</mo><mtext>for all </mtext><mo stretchy=\"false\">|</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">|</mo><mo>&lt;</mo><mi>ψ</mi><mo>&lt;</mo><msub><mi>i</mi><mi mathvariant=\"normal\">o</mi></msub><mo>+</mo><mpadded width=\"+1.7pt\"><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nThe sets of mode and background model parameters are denoted by $\\mathbf{\\Theta}_{\\rm osc}$ and $\\mathbf{\\Theta}_{\\rm bg}$. \n\nThe inner sum in Eq.~(\\ref{eq:specmodel}) runs over the azimuthal components of each multiplet, while the outer sum runs over the selection of observed modes. The dummy variable $n'$, which tags the observed order, takes values $n'\\!=\\!n$ for $l\\!=\\!1,2$ modes, $n'\\!=\\!n+1$ for $l\\!=\\!0$ modes, and $n'\\!=\\!n-1$ for $l\\!=\\!3$ modes. To reduce the number of parameters entering our model, the heights and linewidths of non-radial modes are defined based on the heights and linewidths of the neighboring radial mode(s), the latter being allowed to vary with frequency. The set of mode parameters is ultimately given by $\\mathbf{\\Theta}_{\\rm osc}\\!=\\!\\{\\nu_{n'l0},H_{n'0},\\Gamma_{n'0},i_{\\rm s},\\nu_{\\rm s}\\}$.\n\nThe parameter $H_{n'l}$ describes the height of a given mode of degree $l$, with the height of a multiplet component, $H_{n'lm}$, given by $\\mathscr{E}_{l m}(i_{\\rm s}) H_{n'l}$. $H_{n'l}$ is defined relative to the height of the neighboring radial mode(s) according to $H_{n'l}\\!=\\!V_l^2 H_{n'0}$ for $l\\!=\\!2$ modes or $H_{n'l}\\!=\\!V_l^2 [H_{n'0}+H_{(n'-1) 0}]/2$ for $l\\!=\\!1,3$ modes, where the $V_l^2$ describe the visibilities (in power) of modes of different $l$ relative to those with $l\\!=\\!0$ \\citep[we adopted fixed values of $V_1\\!=\\!1.22$, $V_2\\!=\\!0.71$, and $V_3\\!=\\!0.14$, obtained taking into account the {\\it Kepler} bandpass and the effect of limb darkening;][]{HandCamp}. The parameter $\\Gamma_{n'lm}$ describes the mode linewidth, taken to be the same regardless of $m$ for a given mode of degree $l$, i.e., $\\Gamma_{n'lm}\\!\\equiv\\!\\Gamma_{n'l}$. $\\Gamma_{n'l}$ is defined relative to the linewidth of the neighboring radial mode(s) according to $\\Gamma_{n'l}\\!=\\!\\Gamma_{n'0}$ for $l\\!=\\!2$ modes or $\\Gamma_{n'l}\\!=\\![\\Gamma_{n'0}+\\Gamma_{(n'-1) 0}]/2$ for $l\\!=\\!1,3$ modes.\n\nThe background signal was modeled as the superposition of three components:\n\n", "itemtype": "equation", "pos": 70644, "prevtext": "\nNote that the angle $\\psi$ is allowed to vary in the interval $[0,\\pi]$ in the previous equation, whereas we restrict $i_{\\rm s}$ and $i_{\\rm o}$ to the interval $[0,\\pi/2]$.\n\n\\section{Modeling and fitting the power spectrum}\\label{append:specfit}\nExtracting signatures of rotation from the power spectrum is accomplished by a detailed fitting of the observed modes of oscillation, a procedure often referred to as peak-bagging. We are primarily interested in performing a global fit to the power spectrum \\cite[e.g.,][]{Appourchaux08,Campante11,Appourchaux12}, whereby a selection of the observed modes are fitted simultaneously over a broad frequency range. We modeled the limit (noise-free) oscillation spectrum as a series of standard Lorentzian profiles, $\\mathscr{O}(\\nu;\\mathbf{\\Theta}_{\\rm osc})$, which sit atop a background signal described by $\\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg})$:\n\n", "index": 23, "text": "\\begin{align}\n\\label{eq:specmodel}\n\\mathscr{P}(\\nu;\\mathbf{\\Theta}) &= \\mathscr{O}(\\nu;\\mathbf{\\Theta}_{\\rm osc}) + \\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg}) \\nonumber \\\\ \n&= \\sum_{n',l} \\sum_{m=-l}^{l} \\frac{\\mathscr{E}_{l m}(i_{\\rm s}) H_{n'l}}{1+\\left[\\frac{2(\\nu - \\nu_{n'l0} - m\\nu_{\\rm s})}{\\Gamma_{n'lm}}\\right]^2} + \\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg}) \\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathscr{P}(\\nu;\\mathbf{\\Theta})\" display=\"inline\"><mrow><mi class=\"ltx_font_mathscript\">𝒫</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>;</mo><mi>𝚯</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\mathscr{O}(\\nu;\\mathbf{\\Theta}_{\\rm osc})+\\mathscr{B}(\\nu;%&#10;\\mathbf{\\Theta}_{\\rm bg})\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mi class=\"ltx_font_mathscript\">𝒪</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>;</mo><msub><mi>𝚯</mi><mi>osc</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi class=\"ltx_font_mathscript\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>;</mo><msub><mi>𝚯</mi><mi>bg</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{n^{\\prime},l}\\sum_{m=-l}^{l}\\frac{\\mathscr{E}_{lm}(i_{\\rm s%&#10;})H_{n^{\\prime}l}}{1+\\left[\\frac{2(\\nu-\\nu_{n^{\\prime}l0}-m\\nu_{\\rm s})}{%&#10;\\Gamma_{n^{\\prime}lm}}\\right]^{2}}+\\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg})\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><msup><mi>n</mi><mo>′</mo></msup><mo>,</mo><mi>l</mi></mrow></munder></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mrow><mo>-</mo><mi>l</mi></mrow></mrow><mi>l</mi></munderover></mstyle><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi class=\"ltx_font_mathscript\">ℰ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>H</mi><mrow><msup><mi>n</mi><mo>′</mo></msup><mo>⁢</mo><mi>l</mi></mrow></msub></mrow><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo>[</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ν</mi><mo>-</mo><msub><mi>ν</mi><mrow><msup><mi>n</mi><mo>′</mo></msup><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>-</mo><mrow><mi>m</mi><mo>⁢</mo><msub><mi>ν</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi mathvariant=\"normal\">Γ</mi><mrow><msup><mi>n</mi><mo>′</mo></msup><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mfrac><mo>]</mo></mrow><mn>2</mn></msup></mrow></mfrac></mstyle></mrow></mrow><mo>+</mo><mrow><mi class=\"ltx_font_mathscript\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>;</mo><msub><mi>𝚯</mi><mi>bg</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nA flat component $B_0$ is used to model photon shot-noise. The contribution from granulation is described by a Harvey-like profile \\citep{Harvey85,Harvey93}, where $B_{\\rm gran}$ is the height at $\\nu\\!=\\!0$ of the granulation component, $\\tau_{\\rm gran}$ is the characteristic turnover timescale for granulation, and $a$ calibrates the amount of memory in the process. Finally, a power-law component describes the contribution from activity (characterized by the scale factor $B_{\\rm act}$). This functional form results from considering a Harvey-like profile in the limit $2\\pi\\nu\\,\\tau_{\\rm act}\\!\\gg\\!1$ with the exponent set to 2 as in the original work by \\citet{Harvey85}. Such a power law is well-suited to describe the decaying slope of the activity component. The attenuation factor $\\eta^2$ is given by ${\\rm sinc}^2\\left[\\pi/2\\left(\\frac{\\nu}{\\nu_{\\rm Nyq}}\\right)\\right]$ for an integration duty cycle of $100\\,\\%$ \\citep[e.g.,][]{Kallinger14}, where $\\nu_{\\rm Nyq}$ is the Nyquist frequency.\n\n\n\\begin{figure}[!t]\n\\figurenum{B1}\n\\centering\n\\includegraphics*[scale=0.65]{bgfit.pdf}\n\\includegraphics*[scale=0.65]{oscfit.pdf}\n\\caption{\\small Fit to the power spectrum of KIC~8866102 (Kepler-410 A, KOI-42). Top panel: Fit (solid red line) to the background signal using a maximum likelihood estimator. The background signal is modeled as the superposition of three components (dashed curves). The power law describing the contribution from activity dominates at low frequencies, whereas shot noise is the only nonnegligible component at high frequencies. The Harvey-like profile describing the contribution from granulation is conspicuous at intermediate frequencies. Shaded areas indicate the frequency ranges excluded from the fit, including the oscillation power envelope at $\\nu_{\\rm max}\\!\\sim\\!2000\\:{\\rm \\mu Hz}$ ($\\nu_{\\rm max}$ represents the frequency of maximum oscillation amplitude). Bottom panels: Fit (solid red line) to the oscillation spectrum across two contiguous orders located around $\\nu_{\\rm max}$. The best-fitting model is the output of an MCMC analysis. Modes are tagged according to their angular degree.\\label{fig:peakbag}}\n\\end{figure}\n\n\nWe started by fitting the background signal using a maximum likelihood estimator prior to the extraction of the mode parameters \\citep[e.g.,][and references therein]{Karoff13}. The spectral range considered in this preliminary fit excluded the oscillation modes and the very low frequencies (Fig.~\\ref{fig:peakbag}, top panel). Exclusion of the very low frequencies results from the power law being only able to describe the decaying slope of the activity component. The background model parameters, i.e., $\\mathbf{\\Theta}_{\\rm bg}\\!=\\!\\{B_0,B_{\\rm act},B_{\\rm gran},\\tau_{\\rm gran},a\\}$, determined in this way are subsequently held fixed in Eq.~(\\ref{eq:specmodel}) at their maximum likelihood estimates. \n\nMode parameters were then optimized in a Bayesian manner using an MCMC (Markov chain Monte Carlo) sampler that employs the Metropolis--Hastings algorithm \\citep[Fig.~\\ref{fig:peakbag}, bottom panels;][]{HandCamp,CampantePhD}. In this way, we were able to map the joint posterior probability distribution (PPD) of $\\mathbf{\\Theta}_{\\rm osc}$:\n\n", "itemtype": "equation", "pos": 73039, "prevtext": "\nThe sets of mode and background model parameters are denoted by $\\mathbf{\\Theta}_{\\rm osc}$ and $\\mathbf{\\Theta}_{\\rm bg}$. \n\nThe inner sum in Eq.~(\\ref{eq:specmodel}) runs over the azimuthal components of each multiplet, while the outer sum runs over the selection of observed modes. The dummy variable $n'$, which tags the observed order, takes values $n'\\!=\\!n$ for $l\\!=\\!1,2$ modes, $n'\\!=\\!n+1$ for $l\\!=\\!0$ modes, and $n'\\!=\\!n-1$ for $l\\!=\\!3$ modes. To reduce the number of parameters entering our model, the heights and linewidths of non-radial modes are defined based on the heights and linewidths of the neighboring radial mode(s), the latter being allowed to vary with frequency. The set of mode parameters is ultimately given by $\\mathbf{\\Theta}_{\\rm osc}\\!=\\!\\{\\nu_{n'l0},H_{n'0},\\Gamma_{n'0},i_{\\rm s},\\nu_{\\rm s}\\}$.\n\nThe parameter $H_{n'l}$ describes the height of a given mode of degree $l$, with the height of a multiplet component, $H_{n'lm}$, given by $\\mathscr{E}_{l m}(i_{\\rm s}) H_{n'l}$. $H_{n'l}$ is defined relative to the height of the neighboring radial mode(s) according to $H_{n'l}\\!=\\!V_l^2 H_{n'0}$ for $l\\!=\\!2$ modes or $H_{n'l}\\!=\\!V_l^2 [H_{n'0}+H_{(n'-1) 0}]/2$ for $l\\!=\\!1,3$ modes, where the $V_l^2$ describe the visibilities (in power) of modes of different $l$ relative to those with $l\\!=\\!0$ \\citep[we adopted fixed values of $V_1\\!=\\!1.22$, $V_2\\!=\\!0.71$, and $V_3\\!=\\!0.14$, obtained taking into account the {\\it Kepler} bandpass and the effect of limb darkening;][]{HandCamp}. The parameter $\\Gamma_{n'lm}$ describes the mode linewidth, taken to be the same regardless of $m$ for a given mode of degree $l$, i.e., $\\Gamma_{n'lm}\\!\\equiv\\!\\Gamma_{n'l}$. $\\Gamma_{n'l}$ is defined relative to the linewidth of the neighboring radial mode(s) according to $\\Gamma_{n'l}\\!=\\!\\Gamma_{n'0}$ for $l\\!=\\!2$ modes or $\\Gamma_{n'l}\\!=\\![\\Gamma_{n'0}+\\Gamma_{(n'-1) 0}]/2$ for $l\\!=\\!1,3$ modes.\n\nThe background signal was modeled as the superposition of three components:\n\n", "index": 25, "text": "\\begin{equation}\n\\label{eq:backmodel}\n\\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg}) = B_0 + \\eta^2(\\nu) \\left[\\frac{B_{\\rm gran}}{1+(2\\pi\\nu\\,\\tau_{\\rm gran})^a} + \\frac{B_{\\rm act}}{\\nu^2}\\right] \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\mathscr{B}(\\nu;\\mathbf{\\Theta}_{\\rm bg})=B_{0}+\\eta^{2}(\\nu)\\left[\\frac{B_{%&#10;\\rm gran}}{1+(2\\pi\\nu\\,\\tau_{\\rm gran})^{a}}+\\frac{B_{\\rm act}}{\\nu^{2}}\\right%&#10;]\\,.\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathscript\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo>;</mo><msub><mi>𝚯</mi><mi>bg</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>B</mi><mn>0</mn></msub><mo>+</mo><mrow><msup><mi>η</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ν</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><msub><mi>B</mi><mi>gran</mi></msub><mrow><mn>1</mn><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>ν</mi></mpadded><mo>⁢</mo><msub><mi>τ</mi><mi>gran</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mi>a</mi></msup></mrow></mfrac><mo>+</mo><mfrac><msub><mi>B</mi><mi>act</mi></msub><msup><mi>ν</mi><mn>2</mn></msup></mfrac></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere $p(\\mathbf{\\Theta}_{\\rm osc}|I)$ is the prior probability of $\\mathbf{\\Theta}_{\\rm osc}$ based on any relevant prior information $I$ and $p(D|\\mathbf{\\Theta}_{\\rm osc},I)$ is the likelihood of the observed data $D$ \\citep[a description of the likelihood function can be found in, e.g.,][]{Toutain94}. The PPD of a given mode parameter can then be simply arrived at through marginalization of the joint PPD. \n\nA series of comprehensive fits to the power spectra of the stars in our sample have been conducted in a separate work \\citep{DaviesKages}. These fits considered the frequency range containing all observed modes and their output is used in the present analysis to define initial guesses for the mode parameters. Since we are mainly interested in estimating the stellar inclination angle, we focus here not on the full set of observed modes but instead on a selection of those modes, which necessarily span a somewhat narrower frequency range. The selection of the (continuous) frequency range used in the present analysis was done on a star-by-star basis, having taken into account the linewidths of the modes and their S/N as obtained from the above preliminary fits. This meant selecting those observed orders (a minimum of five) whose modes have the highest S/N and for which the intrinsic $\\nu_{\\rm s}/\\Gamma$ ratio is more favorable when it comes to resolving the azimuthal components \\citep[cf.][]{Ballot06}. It should be noted that choosing the number of observed orders is a trade-off. The inclusion of more radial orders improves the precision in the final estimates. However, if orders are included where the modes show only modest or low S/N, improved precision may come at the cost of reduced accuracy (increased bias), rendering the outputs less robust. A measure of the S/N and $\\nu_{\\rm s}/\\Gamma$ at the frequency of maximum oscillation amplitude $\\nu_{\\rm max}$, as obtained from the present analysis, is given for each star in Table \\ref{tb:results}.\n\nThe main advantage of a Bayesian approach when compared to a frequentist approach is the ability to incorporate relevant prior information through Bayes' theorem (Eq.~\\ref{eq:ppd}). We imposed uniform priors on all mode parameters with the exception of $i_{\\rm s}$, for which we assumed an isotropic orientation in the sphere \\citep{Abt01}, i.e., $p(i_{\\rm s}|I)\\!=\\!\\sin i_{\\rm s}$ or, equivalently, a uniform prior on $\\cos i_{\\rm s}$. The stellar inclination angle was allowed to vary between $-\\pi/2$ and $\\pi$ and all samples lying outside the interval $[0,\\pi/2]$ were then reflected about the $i_{\\rm s}\\!=\\!0$ and $\\pi/2$ boundaries. This was done to avoid potential boundary effects in the MCMC sampling.\n\n\\section{Tests with artificial data}\\label{append:artificial}\nTo validate our asteroseismic method, we have performed a series of tests with artificial data. The reduced visibility of the multiplet components in many of the stars in the asteroseismic sample (see Table \\ref{tb:results}) may raise concerns as to how robust the returned uncertainties on $i_{\\rm s}$ are and how prone the MCMC fitting is to biases caused by the moderate-to-low S/N in the p modes. Fits to the power spectrum as described in Appendix \\ref{append:specfit} are computationally expensive. We have thus produced artificial power spectra for a representative set of stars in the asteroseismic sample, which include all six potentially misaligned systems (based on our results for $i_{\\rm s}$) plus Kepler-25. For each star, we have considered two input $i_{\\rm s}$ with two noise realizations per input $i_{\\rm s}$, thus leading to a total of 28 fitted artificial spectra. For HAT-P-7 and Kepler-145 the input $i_{\\rm s}$ was taken to be either $90\\degr$ or $30\\degr$, whereas for the remainder of the stars we considered either $90\\degr$ or $60\\degr$. Having fixed the input $i_{\\rm s}$, we then used the tabulated $v\\sin i_{\\rm s}$ and asteroseismic radius to determine the input $\\nu_{\\rm s}$. The power spectra were directly generated in the frequency domain, having preserved the same frequency resolution as in the real data and properly modeled the correlation between the background noise and the excitation function \\citep[cf.][]{Chaplin08}. The adopted mode linewidths and S/N were based on the observed linewidths and S/N of radial modes (not split by rotation). We managed to retrieve the input $i_{\\rm s}$ at the 1-$\\sigma$ level in 21 of the fits ($75\\,\\%$), at the 1.5-$\\sigma$ level in 26 fits ($\\sim\\!93\\,\\%$), and at the 2-$\\sigma$ level in 27 fits ($\\sim\\!96\\,\\%$). The returned uncertainties are based on the Bayesian HPD credible regions. Drawing a parallel between Bayesian credible regions and the more familiar frequentist confidence intervals, we are led to conclude that the returned uncertainties are robust.\n\nWe have also validated our asteroseismic method by performing a series of tests with degraded Sun-as-a-star data. Here, we are mostly interested in showing the effect of an increased temporal coverage in reducing the bias affecting the retrieved $i_{\\rm s}$. Using data provided by the green channel of the triple Sun PhotoMeter/Variability of solar IRradiance and Gravity Oscillations (SPM/VIRGO) instrument \\citep{VIRGO} on board the {\\it SoHO} spacecraft, with white noise added to levels comparable with Kepler-50, we have performed our asteroseismic analysis. This was done by treating the Sun as a {\\it Kepler} target of magnitude $m_{\\rm Kep}\\!=\\!10$ (and 10.5) observed during 270, 540, and 1080 days (the equivalent to 3, 6, and 12 {\\it Kepler} quarters). The pristine time series were taken from around solar minimum and share the same starting time stamp. Figure \\ref{fig:Sun_anglepost} shows the output from the fits to the case with $m_{\\rm Kep}\\!=\\!10$. The solar spin axis is inclined with respect to the normal of the ecliptic by $\\sim\\!7\\degr$. The actual inclination for a particular block of SPM/VIRGO data will depend on the ephemerides of the Sun and is assumed to lie in the reference interval $[83\\degr,90\\degr]$. For reference, $\\nu_{\\rm s}/\\Gamma\\!\\approx\\!0.4$ at $\\nu_{\\rm max}$ for the Sun. The bias affecting the retrieved $i_{\\rm s}$ is reduced as we increase the temporal coverage \\citep[cf.][]{Ballot08}. The solar inclination is retrieved at the 1-$\\sigma$ level for the longest of the time series (or the equivalent to 12 {\\it Kepler} quarters). We note that there are only three stars in the asteroseismic sample with a temporal coverage shorter than ten quarters (see Table \\ref{tb:sample}): the posteriors of $i_{\\rm s}$ for KOI-268 (Q6.1--Q8.3; Fig.~\\ref{fig:ppd003425851}) and Kepler-129 (Q6.1--Q7.3; Fig.~\\ref{fig:ppd010586004}) are dominated by the prior, whereas that of the bright ($m_{\\rm Kep}\\!=\\!8.72$) star Kepler-444 (Q15.1--Q17.2; Fig.~\\ref{fig:ppd006278762}) shows signs of bimodality.\n\n\n\\begin{figure}[!t]\n\\figurenum{C1}\n\\centering\n\\includegraphics[width=0.9\\linewidth]{Sun_anglepost_kp10.pdf}\n\\caption{\\small Output of tests with degraded Sun-as-a-star data. We used data provided by the green channel of the SPM/VIRGO instrument on board {\\it SoHO} with white noise added to levels comparable with Kepler-50. The temporal coverage of the time series increases from left to right: 270 days (left-hand panel), 540 days (middle panel), and 1080 days (right-hand panel). Marginalized PPDs of $i_{\\rm s}$ are shown as histograms. Dotted lines enclose the $68.3\\,\\%$ HPD credible regions. For reference, the dashed curves represent the (uninformative) isotropic prior on $i_{\\rm s}$ adopted in the asteroseismic analysis.\\label{fig:Sun_anglepost}}\n\\end{figure}\n\n\n\\section{Additional asteroseismic results}\\label{append:seismicres}\nThe joint PPD of $i_{\\rm s}$ and $\\nu_{\\rm s}$, as well as the corresponding marginalized PPDs are shown below for the remainder of the stars in the asteroseismic sample.\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D1}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003425851_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3425851 (KOI-268). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003425851}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D2}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003544595_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3544595 (Kepler-93, KOI-69). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003544595}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D3}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003632418_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3632418 (Kepler-21, KOI-975). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003632418}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D4}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004141376_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4141376 (KOI-280). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004141376}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D5}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004914423_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4914423 (Kepler-103, KOI-108). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004914423}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D6}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_005866724_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~5866724 (Kepler-65, KOI-85). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd005866724}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D7}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_006278762_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~6278762 (Kepler-444, KOI-3158). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd006278762}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D8}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_006521045_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~6521045 (Kepler-100, KOI-41). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd006521045}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D9}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_007670943_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~7670943 (KOI-269). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd007670943}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D10}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008077137_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8077137 (Kepler-128, KOI-274). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008077137}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D11}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008292840_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8292840 (Kepler-126, KOI-260). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008292840}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D12}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008478994_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8478994 (Kepler-37, KOI-245). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008478994}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D13}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008494142_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8494142 (Kepler-145, KOI-370). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008494142}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D14}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009414417_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9414417 (KOI-974). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009414417}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D15}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009592705_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9592705 (KOI-288). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009592705}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D16}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009955598_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9955598 (Kepler-409, KOI-1925). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009955598}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D17}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010586004_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10586004 (Kepler-129, KOI-275). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010586004}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D18}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010963065_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10963065 (Kepler-408, KOI-1612). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010963065}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D19}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011295426_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11295426 (Kepler-68, KOI-246). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011295426}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D20}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011401755_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11401755 (Kepler-36, KOI-277). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011401755}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D21}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011807274_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11807274 (Kepler-50, KOI-262). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011807274}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D22}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011904151_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11904151 (Kepler-10, KOI-72). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011904151}}\n\\end{figure}\n\n\n\\clearpage\n\n\\section{Hierarchical Bayesian analysis}\\label{append:hierarchical}\nWe wish to sample the joint PPD of the model parameters $\\boldsymbol{\\alpha}$,\n\n", "itemtype": "equation", "pos": 76480, "prevtext": "\nA flat component $B_0$ is used to model photon shot-noise. The contribution from granulation is described by a Harvey-like profile \\citep{Harvey85,Harvey93}, where $B_{\\rm gran}$ is the height at $\\nu\\!=\\!0$ of the granulation component, $\\tau_{\\rm gran}$ is the characteristic turnover timescale for granulation, and $a$ calibrates the amount of memory in the process. Finally, a power-law component describes the contribution from activity (characterized by the scale factor $B_{\\rm act}$). This functional form results from considering a Harvey-like profile in the limit $2\\pi\\nu\\,\\tau_{\\rm act}\\!\\gg\\!1$ with the exponent set to 2 as in the original work by \\citet{Harvey85}. Such a power law is well-suited to describe the decaying slope of the activity component. The attenuation factor $\\eta^2$ is given by ${\\rm sinc}^2\\left[\\pi/2\\left(\\frac{\\nu}{\\nu_{\\rm Nyq}}\\right)\\right]$ for an integration duty cycle of $100\\,\\%$ \\citep[e.g.,][]{Kallinger14}, where $\\nu_{\\rm Nyq}$ is the Nyquist frequency.\n\n\n\\begin{figure}[!t]\n\\figurenum{B1}\n\\centering\n\\includegraphics*[scale=0.65]{bgfit.pdf}\n\\includegraphics*[scale=0.65]{oscfit.pdf}\n\\caption{\\small Fit to the power spectrum of KIC~8866102 (Kepler-410 A, KOI-42). Top panel: Fit (solid red line) to the background signal using a maximum likelihood estimator. The background signal is modeled as the superposition of three components (dashed curves). The power law describing the contribution from activity dominates at low frequencies, whereas shot noise is the only nonnegligible component at high frequencies. The Harvey-like profile describing the contribution from granulation is conspicuous at intermediate frequencies. Shaded areas indicate the frequency ranges excluded from the fit, including the oscillation power envelope at $\\nu_{\\rm max}\\!\\sim\\!2000\\:{\\rm \\mu Hz}$ ($\\nu_{\\rm max}$ represents the frequency of maximum oscillation amplitude). Bottom panels: Fit (solid red line) to the oscillation spectrum across two contiguous orders located around $\\nu_{\\rm max}$. The best-fitting model is the output of an MCMC analysis. Modes are tagged according to their angular degree.\\label{fig:peakbag}}\n\\end{figure}\n\n\nWe started by fitting the background signal using a maximum likelihood estimator prior to the extraction of the mode parameters \\citep[e.g.,][and references therein]{Karoff13}. The spectral range considered in this preliminary fit excluded the oscillation modes and the very low frequencies (Fig.~\\ref{fig:peakbag}, top panel). Exclusion of the very low frequencies results from the power law being only able to describe the decaying slope of the activity component. The background model parameters, i.e., $\\mathbf{\\Theta}_{\\rm bg}\\!=\\!\\{B_0,B_{\\rm act},B_{\\rm gran},\\tau_{\\rm gran},a\\}$, determined in this way are subsequently held fixed in Eq.~(\\ref{eq:specmodel}) at their maximum likelihood estimates. \n\nMode parameters were then optimized in a Bayesian manner using an MCMC (Markov chain Monte Carlo) sampler that employs the Metropolis--Hastings algorithm \\citep[Fig.~\\ref{fig:peakbag}, bottom panels;][]{HandCamp,CampantePhD}. In this way, we were able to map the joint posterior probability distribution (PPD) of $\\mathbf{\\Theta}_{\\rm osc}$:\n\n", "index": 27, "text": "\\begin{equation}\n\\label{eq:ppd}\np(\\mathbf{\\Theta}_{\\rm osc}|D,I) \\propto p(\\mathbf{\\Theta}_{\\rm osc}|I)\\,p(D|\\mathbf{\\Theta}_{\\rm osc},I) \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"p(\\mathbf{\\Theta}_{\\rm osc}|D,I)\\propto p(\\mathbf{\\Theta}_{\\rm osc}|I)\\,p(D|%&#10;\\mathbf{\\Theta}_{\\rm osc},I)\\,,\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝚯</mi><mi>osc</mi></msub><mo stretchy=\"false\">|</mo><mi>D</mi><mo>,</mo><mi>I</mi><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝚯</mi><mi>osc</mi></msub><mo stretchy=\"false\">|</mo><mi>I</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo stretchy=\"false\">|</mo><msub><mi>𝚯</mi><mi>osc</mi></msub><mo>,</mo><mi>I</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere $p(\\boldsymbol{\\alpha})$ is the prior on $\\boldsymbol{\\alpha}$ and $\\mathcal{L}_{\\boldsymbol{\\alpha}}$ is the marginalized likelihood for the model parameters. Here, we employ the hierarchical probabilistic method developed by \\citet{Hogg10}, whereby the true distribution of a given quantity is inferred by taking as input a set of posterior samplings of that same quantity (obtained using an uninformative prior). According to this formalism, a sampling approximation to the marginalized likelihood for $\\boldsymbol{\\alpha}$ is given by\n\n", "itemtype": "equation", "pos": 90879, "prevtext": "\nwhere $p(\\mathbf{\\Theta}_{\\rm osc}|I)$ is the prior probability of $\\mathbf{\\Theta}_{\\rm osc}$ based on any relevant prior information $I$ and $p(D|\\mathbf{\\Theta}_{\\rm osc},I)$ is the likelihood of the observed data $D$ \\citep[a description of the likelihood function can be found in, e.g.,][]{Toutain94}. The PPD of a given mode parameter can then be simply arrived at through marginalization of the joint PPD. \n\nA series of comprehensive fits to the power spectra of the stars in our sample have been conducted in a separate work \\citep{DaviesKages}. These fits considered the frequency range containing all observed modes and their output is used in the present analysis to define initial guesses for the mode parameters. Since we are mainly interested in estimating the stellar inclination angle, we focus here not on the full set of observed modes but instead on a selection of those modes, which necessarily span a somewhat narrower frequency range. The selection of the (continuous) frequency range used in the present analysis was done on a star-by-star basis, having taken into account the linewidths of the modes and their S/N as obtained from the above preliminary fits. This meant selecting those observed orders (a minimum of five) whose modes have the highest S/N and for which the intrinsic $\\nu_{\\rm s}/\\Gamma$ ratio is more favorable when it comes to resolving the azimuthal components \\citep[cf.][]{Ballot06}. It should be noted that choosing the number of observed orders is a trade-off. The inclusion of more radial orders improves the precision in the final estimates. However, if orders are included where the modes show only modest or low S/N, improved precision may come at the cost of reduced accuracy (increased bias), rendering the outputs less robust. A measure of the S/N and $\\nu_{\\rm s}/\\Gamma$ at the frequency of maximum oscillation amplitude $\\nu_{\\rm max}$, as obtained from the present analysis, is given for each star in Table \\ref{tb:results}.\n\nThe main advantage of a Bayesian approach when compared to a frequentist approach is the ability to incorporate relevant prior information through Bayes' theorem (Eq.~\\ref{eq:ppd}). We imposed uniform priors on all mode parameters with the exception of $i_{\\rm s}$, for which we assumed an isotropic orientation in the sphere \\citep{Abt01}, i.e., $p(i_{\\rm s}|I)\\!=\\!\\sin i_{\\rm s}$ or, equivalently, a uniform prior on $\\cos i_{\\rm s}$. The stellar inclination angle was allowed to vary between $-\\pi/2$ and $\\pi$ and all samples lying outside the interval $[0,\\pi/2]$ were then reflected about the $i_{\\rm s}\\!=\\!0$ and $\\pi/2$ boundaries. This was done to avoid potential boundary effects in the MCMC sampling.\n\n\\section{Tests with artificial data}\\label{append:artificial}\nTo validate our asteroseismic method, we have performed a series of tests with artificial data. The reduced visibility of the multiplet components in many of the stars in the asteroseismic sample (see Table \\ref{tb:results}) may raise concerns as to how robust the returned uncertainties on $i_{\\rm s}$ are and how prone the MCMC fitting is to biases caused by the moderate-to-low S/N in the p modes. Fits to the power spectrum as described in Appendix \\ref{append:specfit} are computationally expensive. We have thus produced artificial power spectra for a representative set of stars in the asteroseismic sample, which include all six potentially misaligned systems (based on our results for $i_{\\rm s}$) plus Kepler-25. For each star, we have considered two input $i_{\\rm s}$ with two noise realizations per input $i_{\\rm s}$, thus leading to a total of 28 fitted artificial spectra. For HAT-P-7 and Kepler-145 the input $i_{\\rm s}$ was taken to be either $90\\degr$ or $30\\degr$, whereas for the remainder of the stars we considered either $90\\degr$ or $60\\degr$. Having fixed the input $i_{\\rm s}$, we then used the tabulated $v\\sin i_{\\rm s}$ and asteroseismic radius to determine the input $\\nu_{\\rm s}$. The power spectra were directly generated in the frequency domain, having preserved the same frequency resolution as in the real data and properly modeled the correlation between the background noise and the excitation function \\citep[cf.][]{Chaplin08}. The adopted mode linewidths and S/N were based on the observed linewidths and S/N of radial modes (not split by rotation). We managed to retrieve the input $i_{\\rm s}$ at the 1-$\\sigma$ level in 21 of the fits ($75\\,\\%$), at the 1.5-$\\sigma$ level in 26 fits ($\\sim\\!93\\,\\%$), and at the 2-$\\sigma$ level in 27 fits ($\\sim\\!96\\,\\%$). The returned uncertainties are based on the Bayesian HPD credible regions. Drawing a parallel between Bayesian credible regions and the more familiar frequentist confidence intervals, we are led to conclude that the returned uncertainties are robust.\n\nWe have also validated our asteroseismic method by performing a series of tests with degraded Sun-as-a-star data. Here, we are mostly interested in showing the effect of an increased temporal coverage in reducing the bias affecting the retrieved $i_{\\rm s}$. Using data provided by the green channel of the triple Sun PhotoMeter/Variability of solar IRradiance and Gravity Oscillations (SPM/VIRGO) instrument \\citep{VIRGO} on board the {\\it SoHO} spacecraft, with white noise added to levels comparable with Kepler-50, we have performed our asteroseismic analysis. This was done by treating the Sun as a {\\it Kepler} target of magnitude $m_{\\rm Kep}\\!=\\!10$ (and 10.5) observed during 270, 540, and 1080 days (the equivalent to 3, 6, and 12 {\\it Kepler} quarters). The pristine time series were taken from around solar minimum and share the same starting time stamp. Figure \\ref{fig:Sun_anglepost} shows the output from the fits to the case with $m_{\\rm Kep}\\!=\\!10$. The solar spin axis is inclined with respect to the normal of the ecliptic by $\\sim\\!7\\degr$. The actual inclination for a particular block of SPM/VIRGO data will depend on the ephemerides of the Sun and is assumed to lie in the reference interval $[83\\degr,90\\degr]$. For reference, $\\nu_{\\rm s}/\\Gamma\\!\\approx\\!0.4$ at $\\nu_{\\rm max}$ for the Sun. The bias affecting the retrieved $i_{\\rm s}$ is reduced as we increase the temporal coverage \\citep[cf.][]{Ballot08}. The solar inclination is retrieved at the 1-$\\sigma$ level for the longest of the time series (or the equivalent to 12 {\\it Kepler} quarters). We note that there are only three stars in the asteroseismic sample with a temporal coverage shorter than ten quarters (see Table \\ref{tb:sample}): the posteriors of $i_{\\rm s}$ for KOI-268 (Q6.1--Q8.3; Fig.~\\ref{fig:ppd003425851}) and Kepler-129 (Q6.1--Q7.3; Fig.~\\ref{fig:ppd010586004}) are dominated by the prior, whereas that of the bright ($m_{\\rm Kep}\\!=\\!8.72$) star Kepler-444 (Q15.1--Q17.2; Fig.~\\ref{fig:ppd006278762}) shows signs of bimodality.\n\n\n\\begin{figure}[!t]\n\\figurenum{C1}\n\\centering\n\\includegraphics[width=0.9\\linewidth]{Sun_anglepost_kp10.pdf}\n\\caption{\\small Output of tests with degraded Sun-as-a-star data. We used data provided by the green channel of the SPM/VIRGO instrument on board {\\it SoHO} with white noise added to levels comparable with Kepler-50. The temporal coverage of the time series increases from left to right: 270 days (left-hand panel), 540 days (middle panel), and 1080 days (right-hand panel). Marginalized PPDs of $i_{\\rm s}$ are shown as histograms. Dotted lines enclose the $68.3\\,\\%$ HPD credible regions. For reference, the dashed curves represent the (uninformative) isotropic prior on $i_{\\rm s}$ adopted in the asteroseismic analysis.\\label{fig:Sun_anglepost}}\n\\end{figure}\n\n\n\\section{Additional asteroseismic results}\\label{append:seismicres}\nThe joint PPD of $i_{\\rm s}$ and $\\nu_{\\rm s}$, as well as the corresponding marginalized PPDs are shown below for the remainder of the stars in the asteroseismic sample.\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D1}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003425851_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3425851 (KOI-268). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003425851}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D2}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003544595_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3544595 (Kepler-93, KOI-69). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003544595}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D3}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_003632418_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~3632418 (Kepler-21, KOI-975). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd003632418}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D4}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004141376_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4141376 (KOI-280). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004141376}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D5}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_004914423_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~4914423 (Kepler-103, KOI-108). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd004914423}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D6}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_005866724_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~5866724 (Kepler-65, KOI-85). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd005866724}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D7}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_006278762_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~6278762 (Kepler-444, KOI-3158). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd006278762}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D8}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_006521045_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~6521045 (Kepler-100, KOI-41). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd006521045}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D9}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_007670943_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~7670943 (KOI-269). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd007670943}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D10}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008077137_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8077137 (Kepler-128, KOI-274). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008077137}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D11}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008292840_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8292840 (Kepler-126, KOI-260). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008292840}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D12}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008478994_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8478994 (Kepler-37, KOI-245). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008478994}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D13}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_008494142_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~8494142 (Kepler-145, KOI-370). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd008494142}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D14}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009414417_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9414417 (KOI-974). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009414417}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D15}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009592705_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9592705 (KOI-288). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009592705}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D16}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_009955598_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~9955598 (Kepler-409, KOI-1925). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd009955598}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D17}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010586004_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10586004 (Kepler-129, KOI-275). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010586004}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D18}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_010963065_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~10963065 (Kepler-408, KOI-1612). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd010963065}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D19}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011295426_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11295426 (Kepler-68, KOI-246). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011295426}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D20}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011401755_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11401755 (Kepler-36, KOI-277). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011401755}}\n\\end{figure}\n\n\n\\clearpage\n\n\n\\begin{figure}[!p]\n\\figurenum{D21}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011807274_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11807274 (Kepler-50, KOI-262). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011807274}}\n\\end{figure}\n\n\n\n\\begin{figure}[!p]\n\\figurenum{D22}\n\\centering\n\\includegraphics[width=0.8\\linewidth]{fig_ppds/corrmap_011904151_thin10.pdf}\n\\caption{\\small Asteroseismic results on KIC~11904151 (Kepler-10, KOI-72). Similar to Fig.~\\ref{fig:ppd008866102}.\\label{fig:ppd011904151}}\n\\end{figure}\n\n\n\\clearpage\n\n\\section{Hierarchical Bayesian analysis}\\label{append:hierarchical}\nWe wish to sample the joint PPD of the model parameters $\\boldsymbol{\\alpha}$,\n\n", "index": 29, "text": "\\begin{equation}\n\\label{eq:postalpha}\np(\\boldsymbol{\\alpha}|\\{\\cos i_{\\rm s}\\}_{n=1}^N) \\propto p(\\boldsymbol{\\alpha}) \\, \\mathcal{L}_{\\boldsymbol{\\alpha}} \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"p(\\boldsymbol{\\alpha}|\\{\\cos i_{\\rm s}\\}_{n=1}^{N})\\propto p(\\boldsymbol{%&#10;\\alpha})\\,\\mathcal{L}_{\\boldsymbol{\\alpha}}\\,,\" display=\"block\"><mrow><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝜶</mi><mo stretchy=\"false\">|</mo><msubsup><mrow><mo stretchy=\"false\">{</mo><mi>cos</mi><msub><mi>i</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">}</mo></mrow><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝜶</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mpadded width=\"+1.7pt\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>𝜶</mi></msub></mpadded><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06052.tex", "nexttext": "\nwhere $\\cos i_{{\\rm s}\\,(nk)}$ is the $k$th sample of the $n$th posterior of $\\cos i_{\\rm s}$. The sum is over $K\\!=\\!1000$ posterior samples of each individual system, a number of samples large enough to guarantee that our analysis is not prone to sampling variance. The ratio inside the sum is between the model distribution and the uninformative prior on which the sampling was based (i.e., a uniform prior on $\\cos i_{\\rm s}$). Simply put, we are conducting a forward modeling of the observed data by defining a model distribution $f_{\\boldsymbol{\\alpha}}(\\psi)$ for the true $\\psi$ and finding the model parameters $\\boldsymbol{\\alpha}$ that best explain those data. The use of input from several different observers/fitters, each of whom may have sampled their posteriors with different uninformative priors $p_0$, does not constitute a problem and can be straightforwardly accounted for in Eq.~(\\ref{eq:marlike}).\n\n\n\n\n\n\\acknowledgments\nThis paper includes data collected by the {\\it Kepler} mission. Funding for the {\\it Kepler} mission is provided by the NASA Science Mission Directorate. Some of the data presented in this paper were obtained from the {\\it Kepler} Asteroseismic Science Operations Center (KASOC) database. T.L.C., J.S.K., G.R.D., W.J.C., D.B., Y.P.E., and T.S.H.N.~acknowledge the support of the UK Science and Technology Facilities Council (STFC). Funding for the Stellar Astrophysics Centre is provided by The Danish National Research Foundation (Grant DNRF106). The research is supported by the ASTERISK project (ASTERoseismic Investigations with SONG and {\\it Kepler}) funded by the European Research Council (Grant agreement no.: 267864). The research leading to the presented results has received funding from the European Research Council under the European Community's Seventh Framework Programme (FP7/2007-2013) / ERC grant agreement no.~338251 (StellarAges). Work by J.N.W.~was supported by the NASA Origins program (NNX11AG85G). S.B.~acknowledges support from NASA grant NNX13AE70G. C.K.~and V.S.A.~acknowledge the support of the Villum Foundation. This research has made use of the NASA Exoplanet Archive, which is operated by the California Institute of Technology, under contract with the National Aeronautics and Space Administration under the Exoplanet Exploration Program. This study has made use of Ren\\'e Heller's Holt--Rossiter--McLaughlin Encyclopaedia. This research made use of the \\texttt{Python} package \\texttt{obliquity} developed by Timothy Morton and made available at \\url{https://github.com/timothydmorton/obliquity}.\n\n\n\n{\\it Facilities:} \\facility{{\\it Kepler}}\n\n\n\n\\bibliographystyle{apj}\n\\bibliography{biblio}\n\n\n\n\n\\begin{deluxetable}{rlccccccccc}\n\\tablecolumns{11}\n\\tabletypesize{\\scriptsize}\n\n\\tablewidth{0pc}\n\\tablecaption{Asteroseismic sample of {\\it Kepler} Objects of Interest.\\label{tb:sample}}\n\\tablehead{\n\\colhead{KIC} & \\colhead{KOI} & \\colhead{Kepler ID} & \\colhead{$m_{\\rm Kep}$} & \\colhead{Quarters} & \\colhead{No.~of} & \\colhead{$R_{\\rm p}$} & \\colhead{$P_{\\rm o}$} & \\colhead{$v\\sin i_{\\rm s}$} & \\colhead{$P_{\\rm rot}$} & \\colhead{Refs.} \\\\\n\\colhead{} & \\colhead{} & \\colhead{} & \\colhead{} & \\colhead{} & \\colhead{Planets} & \\colhead{($R_\\earth$)} & \\colhead{(d)} & \\colhead{(${\\rm km\\,s^{-1}}$)} & \\colhead{(d)} & \\colhead{}\n}\n\\startdata\n3425851 & 268 & \\nodata & 10.56 & Q6.1--Q8.3 & 1 & 3.03 & 110.4 & $9.5\\pm0.5$ & $7.873\\pm0.001$ & 1,9 \\\\\n3544595 & 69 & Kepler-93 & 9.93 & Q2.3--Q17.2 & 2 & 1.48 & $>$3650 & $2.0\\pm0.5$ & \\nodata & 1 \\\\\n3632418 & 975 & Kepler-21 & 8.22 & Q5.1--Q17.2 & 1 & 1.64 & 2.8 & $7.75\\pm1.0$ & $12.591\\pm0.036$ & 2,9 \\\\\n4141376 & 280 & \\nodata & 11.07 & Q6.1--Q17.2 & 1 & 1.94 & 11.9 & $3.5\\pm0.5$ & $15.78\\pm2.12$ & 1,9 \\\\\n4349452 & 244 & Kepler-25 & 10.73 & Q5.1--Q17.2 & 3 & 2.60 & 123 & $8.2\\pm0.2$ & $23.147\\pm0.039$ & 3,9 \\\\\n4914423 & 108 & Kepler-103 & 12.29 & Q3.1--Q12.3 & 2 & 3.37 & 179.6 & $3.8\\pm0.7$ & \\nodata & 1 \\\\\n5866724 & 85 & Kepler-65 & 11.02 & Q3.1--Q17.2 & 3 & 1.42 & 8.1 & $10.4\\pm0.5$ & $7.911\\pm0.155$ & 1,10 \\\\\n6278762\\tablenotemark{a} & 3158 & Kepler-444 & 8.72 & Q15.1--Q17.2 & 5 & 0.40 & 9.7 & $\\sim\\!2.2$ & \\nodata & 4 \\\\\n6521045 & 41 & Kepler-100 & 11.20 & Q3.1--Q17.2 & 3 & 1.32 & 35.3 & $2.9\\pm0.5$ & $24.988\\pm2.192$ & 1,9 \\\\\n7670943 & 269 & \\nodata & 10.93 & Q6.1--Q17.2 & 1 & 1.75 & 18.0 & $13.5\\pm0.6$ & $5.274\\pm0.033$ & 1,9 \\\\\n8077137 & 274 & Kepler-128 & 11.39 & Q6.1--Q17.2 & 2 & 1.13 & 22.8 & $7.7\\pm0.5$ & \\nodata & 1 \\\\\n8292840 & 260 & Kepler-126 & 10.50 & Q5.1--Q17.2 & 3 & 1.52 & 100.3 & $10.4\\pm0.5$ & \\nodata & 1 \\\\\n8478994 & 245 & Kepler-37 & 9.71 & Q5.1--Q17.2 & 4 & 0.30 & 51.2 & $1.1\\pm1.1$ & $28.79\\pm3.29$ & 5,11 \\\\\n8494142 & 370 & Kepler-145 & 11.93 & Q7.1--Q17.2 & 2 & 2.65 & 42.9 & $8.9\\pm0.5$ & \\nodata & 1 \\\\\n8866102\\tablenotemark{b} & 42 & Kepler-410 A & 9.36 & Q3.1--Q17.2 & $>$1 & 2.84 & 17.8 & $15.0\\pm0.5$ & $20.850\\pm0.007$ & 1,9 \\\\\n9414417 & 974 & \\nodata & 9.58 & Q6.1--Q17.2 & 1 & 2.49 & 53.5 & $9.3\\pm0.5$ & $10.847\\pm0.002$ & 1,9 \\\\\n9592705 & 288 & \\nodata & 11.02 & Q6.1--Q17.2 & 1 & 3.17 & 10.3 & $9.4\\pm0.5$ & $13.380\\pm0.099$ & 1,9 \\\\\n9955598 & 1925 & Kepler-409 & 9.44 & Q5.1--Q17.2 & 1 & 1.19 & 69.0 & $1.6\\pm0.5$ & \\nodata & 1 \\\\\n10586004 & 275 & Kepler-129 & 11.70 & Q6.1--Q7.3 & 2 & 2.37 & 82.2 & $3.4\\pm0.5$ & \\nodata & 1 \\\\\n10666592 & 2 & Kepler-2 & 10.46 & Q0--Q17.2 & 1 & 15.04 & 2.2 & $3.8\\pm0.5$ & \\nodata & 6 \\\\\n10963065 & 1612 & Kepler-408 & 8.77 & Q2.3--Q17.2 & 1 & 0.82 & 2.5 & $3.4\\pm0.5$ & $12.444\\pm0.172$ & 1,9 \\\\\n11295426 & 246 & Kepler-68 & 10.00 & Q5.1--Q17.2 & 3 & 0.95 & 580 & $0.5\\pm0.5$ & \\nodata & 7 \\\\\n11401755 & 277 & Kepler-36 & 11.87 & Q6.1--Q17.2 & 2 & 1.49 & 16.2 & $4.9\\pm1.0$ & \\nodata & 8 \\\\\n11807274 & 262 & Kepler-50 & 10.42 & Q6.1--Q17.2 & 2 & 1.71 & 9.4 & $11.7\\pm0.6$ & $7.553\\pm0.755$ & 1,9 \\\\\n11904151 & 72 & Kepler-10 & 10.96 & Q2.2--Q17.2 & 2 & 1.47 & 45.3 & $1.9\\pm0.5$ & \\nodata & 1 \\\\\n\\enddata\n\\tablecomments{\\scriptsize The number of planets refers to the total number of confirmed or else candidate transiting planets. $R_{\\rm p}$ is the planetary radius (source: NASA Exoplanet Archive). For multiple-planet systems, the smallest planet in the system is considered. $P_{\\rm o}$ is the orbital period (source: NASA Exoplanet Archive). For multiple-planet systems, the longest-period planet in the system is considered. See references below for sources of $v\\sin i_{\\rm s}$ and $P_{\\rm rot}$.}\n\\tablenotetext{a}{\\scriptsize A recent spectroscopic follow-up of this star with the Subaru High Dispersion Spectrograph (HDS) returned an upper limit for $v\\sin i_{\\rm s}$ (at the 2-$\\sigma$ level) of $0.56\\:{\\rm km\\,s^{-1}}$ \\citetext{T.~Hirano, private communication}.}\n\\tablenotetext{b}{\\scriptsize The $P_{\\rm o}$ value is for the transiting planet (the TTV signal has a period of 957 days). The $P_{\\rm rot}$ value is associated with a blended star \\citep[][]{VanEylen14}.}\n\\tablerefs{\\scriptsize (1) \\citet{HuberKOIs}, (2) \\citet{Kepler-21}, (3) \\citet{Albrecht13}, (4) \\citet{Kepler-444}, (5) \\citet{Kepler-37}, (6) \\citet{HAT-P-7b}, (7) \\citet{Kepler-68}, (8) \\citet{Kepler-36}, (9) \\citet{McQuillan}, (10) \\citet{Hirano12,Hirano14}, (11) \\citet{Walkowicz13}.}\n\\end{deluxetable}\n\n\n\n\\begin{deluxetable}{ccccccc}\n\\tablecolumns{7}\n\\tabletypesize{\\scriptsize}\n\\tablewidth{0pc}\n\\rotate\n\\tablecaption{Results on the spin-orbit angle $\\psi$ for HAT-P-7 and Kepler-25.\\label{tb:obliquities}}\n\\tablehead{\n\\colhead{} & \\colhead{} & \\colhead{} & \\multicolumn{3}{c}{$\\psi$} & \\colhead{} \\\\\n\\cline{4-6} \\\\\n\\colhead{Kepler ID} & \\colhead{$\\lambda$} & \\colhead{$i_{\\rm o}$} & \\colhead{Median} & \\colhead{$68.3\\,\\%$ HPD Lower Bound} & \\colhead{$68.3\\,\\%$ HPD Upper Bound} & \\colhead{Refs.} \\\\\n\\colhead{} & \\colhead{(deg)} & \\colhead{(deg)} & \\colhead{(deg)} & \\colhead{(deg)} & \\colhead{(deg)}\n}\n\\startdata\nHAT-P-7b & $182.5\\pm9.4$\\tablenotemark{a}/$-132.6^{+10.5}_{-16.3}$/$\\mathbf{155\\pm37}$ & $80.8^{+2.8}_{-1.2}$/$\\mathbf{83.111\\pm0.030}$ & $116.4$ & $93.5$ & $138.4$ & 1,2,3,4 \\\\\nKepler-25c & $-0.5\\pm5.7$ & $87.27\\pm0.05$ & $12.6$ & $1.6$ & $19.3$ & 5 \\\\\n\\enddata\n\\tablecomments{\\scriptsize When several measurements of $\\lambda$ or $i_{\\rm o}$ are available (see references below), the adopted value is given in boldface. Values for $\\lambda$ all come from measurements of the RM effect.}\n\\tablenotetext{a}{\\scriptsize Equivalent to $\\lambda\\!=\\!-177.5\\degr\\pm9.4\\degr$ if brought into the $[-\\pi,\\pi]$ interval.}\n\\tablerefs{\\scriptsize (1) \\citet{Winn09}, (2) \\citet{Narita09}, (3) \\citet{Albrecht12}, (4) \\citet{Morris13}, (5) \\citet{Albrecht13}.}\n\\end{deluxetable}\n\n\n\n\\begin{deluxetable}{lcccccccc}\n\\tablecolumns{9}\n\\tabletypesize{\\scriptsize}\n\\rotate\n\\tablewidth{0pc}\n\\tablecaption{Results on the stellar inclination angle $i_{\\rm s}$ for the stars in the asteroseismic sample.\\label{tb:results}}\n\\tablehead{\n\\colhead{} & \\colhead{} & \\colhead{} & \\colhead{} & \\colhead{} & \\colhead{} & \\multicolumn{3}{c}{$i_{\\rm s}$} \\\\\n\\cline{7-9} \\\\\n\\colhead{KOI} & \\colhead{Kepler ID} & \\colhead{No.~of} & \\colhead{Frequency Range} & \\colhead{S/N} & \\colhead{$\\nu_{\\rm s}/\\Gamma$} & \\colhead{$68.3\\,\\%$ HPD Credible Region} & \\colhead{$95.4\\,\\%$ HPD Credible Region} & \\colhead{MW14 Upper Bound} \\\\\n\\colhead{} & \\colhead{} & \\colhead{Orders} & \\colhead{(${\\rm \\mu Hz}$)} & \\colhead{} & \\colhead{} & \\colhead{(deg)} & \\colhead{(deg)} & \\colhead{(deg)}\n}\n\\startdata\n268 & \\nodata & 6 & 1615--2170 & 0.30 & 0.21 & [38.5,85.0] & [18.6,90.0] & \\nodata \\\\\n69 & Kepler-93 & 6 & 2735--3610 & 2.7 & 0.49 & [48.6,69.8] & [45.1,87.4] & \\nodata \\\\\n975 & Kepler-21 & 8 & 810--1300 & 12.4 & 0.31 & [70.0,90.0] & [53.4,90.0] & 89.4 \\\\\n280 & \\nodata & 5 & 2520--3160 & 1.3 & 0.73 & [41.9,74.8] & [38.4,90.0] & 88.8 \\\\\n244 & Kepler-25 & 6 & 1715--2300 & 1.0 & 0.46 & [68.7,90.0] & [54.3,90.0] & \\nodata \\\\\n108 & Kepler-103 & 5 & 1355--1765 & 1.0 & 0.28 & [41.7,90.0] & [17.6,90.0] & \\nodata \\\\\n85 & Kepler-65 & 6 & 1475--2010 & 1.4 & 0.56 & [74.3,90.0] & [60.8,90.0] & 90.0 \\\\\n3158 & Kepler-444 & 6 & 3730--4800 & 2.2 & 0.31 & [31.3,90.0] & [22.7,90.0] & \\nodata \\\\\n41 & Kepler-100 & 7 & 1120--1660 & 4.3 & 0.32 & [65.0,90.0] & [46.2,90.0] & 89.4 \\\\\n269 & \\nodata & 6 & 1540--2075 & 1.0 & 0.54 & [58.5,90.0] & [39.1,90.0] & 63.6 \\\\\n274 & Kepler-128 & 6 & 1065--1480 & 1.4 & 0.27 & [56.9,90.0] & [36.5,90.0] & \\nodata \\\\\n260 & Kepler-126 & 6 & 1615--2175 & 1.9 & 0.44 & [71.8,90.0] & [59.5,90.0] & \\nodata \\\\\n245 & Kepler-37 & 6 & 3710--4780 & 1.0 & 0.35 & [52.0,90.0] & [27.1,90.0] & \\nodata \\\\\n370 & Kepler-145 & 5 & 960--1270 & 1.3 & 0.36 & [17.6,65.9] & [14.1,90.0] & \\nodata \\\\\n42 & Kepler-410 A & 8 & 1550--2305 & 3.3 & 0.55 & [82.8,90.0] & [76.8,90.0] & \\nodata \\\\\n974 & \\nodata & 8 & 800--1280 & 5.2 & 0.27 & [55.4,90.0] & [34.1,90.0] & 68.1 \\\\\n288 & \\nodata & 7 & 770--1150 & 1.8 & 0.27 & [51.2,90.0] & [25.9,90.0] & 90.0 \\\\\n1925 & Kepler-409 & 7 & 2880--3950 & 5.1 & 0.42 & [39.7,78.4] & [33.2,90.0] & \\nodata \\\\\n275 & Kepler-129 & 5 & 1150--1505 & 2.1 & 0.40 & [32.4,86.6] & [15.5,90.0] & \\nodata \\\\\n2 & Kepler-2 & 7 & 840--1255 & 2.2 & 0.17 & [19.1,69.8] & [15.8,90.0] & \\nodata \\\\\n1612 & Kepler-408 & 8 & 1705--2530 & 10.1 & 0.28 & [53.5,90.0] & [36.5,90.0] & \\nodata \\\\\n246 & Kepler-68 & 8 & 1690--2500 & 10.0 & 0.21 & [36.9,90.0] & [18.7,90.0] & \\nodata \\\\\n277 & Kepler-36 & 6 & 980--1390 & 1.8 & 0.38 & [53.6,90.0] & [24.8,90.0] & \\nodata \\\\\n262 & Kepler-50 & 7 & 1170--1700 & 2.7 & 0.53 & [50.7,73.9] & [48.9,90.0] & 89.4 \\\\\n72 & Kepler-10 & 5 & 2200--2790 & 1.9 & 0.37 & [39.7,90.0] & [12.7,90.0] & \\nodata \\\\\n\\enddata\n\\tablecomments{\\scriptsize The number of orders refers to the number of observed orders entering the fit (cf.~Appendix \\ref{append:specfit}). Frequency ranges are approximate. The height-to-background ratio of the dipole mode in the vicinity of the frequency of maximum oscillation amplitude ($\\nu_{\\rm max}$) is taken as a measure of the S/N in the p modes. The ratio $\\nu_{\\rm s}/\\Gamma$ refers to the order around $\\nu_{\\rm max}$ (for reference, $\\Gamma\\!\\approx\\!1.0\\:{\\rm \\mu Hz}$ and $\\nu_{\\rm s}/\\Gamma\\!\\approx\\!0.4$ for the Sun). The rightmost column gives the $95\\,\\%$ confidence upper bound on $i_{\\rm s}$ obtained by \\citet{Morton14}.}\n\\end{deluxetable}\n\n\n\n\\begin{deluxetable}{cccccccccccc}\n\\tablecolumns{12}\n\\tabletypesize{\\small}\n\\tablewidth{0pc}\n\\rotate\n\\tablecaption{Results from the hierarchical Bayesian analysis.\\label{tb:reshierarchical}}\n\\tablehead{\n\\colhead{Model} & \\multicolumn{3}{c}{Single-transiting} & & \\multicolumn{3}{c}{Multi-transiting} & & \\multicolumn{3}{c}{All} \\\\\n\\cline{2-4} \\cline{6-8} \\cline{10-12} \\\\\n\\colhead{} & \\colhead{$\\kappa$} & \\colhead{$f$} & \\colhead{$E$} & \\colhead{} & \\colhead{$\\kappa$} & \\colhead{$f$} & \\colhead{$E$} & \\colhead{} & \\colhead{$\\kappa$} & \\colhead{$f$} & \\colhead{$E$}\n}\n\\startdata\n\\tableline\n\\multicolumn{12}{c}{Asteroseismic Sample} \\\\\n\\tableline\nSingle-Fisher & $106^{+92}_{-94}$ & \\nodata & \\nodata & & $101^{+96}_{-88}$ & \\nodata & \\nodata & & $107^{+93}_{-89}$ & \\nodata & \\nodata \\[0.2in]\n\\tableline\n\\multicolumn{12}{c}{Combined Sample} \\\\\n\\tableline\nSingle-Fisher & $8.7^{+6.7}_{-5.4}$ & \\nodata & $1.10\\times10^5$ & & $118^{+82}_{-83}$ & \\nodata & $5.11\\times10^7$ & & $11.5^{+7.5}_{-5.7}$ & \\nodata & $1.61\\times10^9$ \\[0.1in]\nMixture & $126^{+74}_{-86}$ & $0.21^{+0.24}_{-0.18}$ & $1.24\\times10^7$ & & $116^{+84}_{-82}$ & $0.08^{+0.24}_{-0.08}$ & $6.16\\times10^6$ & & $129^{+71}_{-80}$ & $0.13^{+0.16}_{-0.12}$ & $7.97\\times10^{11}$ \\\\\n\\enddata\n\\tablecomments{\\footnotesize We quote the median and $95.4\\,\\%$ HPD credible region for both $\\kappa$ and $f$. The Bayesian model evidence, $E$, is reported for each cohort of systems in the combined sample.}\n\\end{deluxetable}\n\n\n\n\n\n", "itemtype": "equation", "pos": 91600, "prevtext": "\nwhere $p(\\boldsymbol{\\alpha})$ is the prior on $\\boldsymbol{\\alpha}$ and $\\mathcal{L}_{\\boldsymbol{\\alpha}}$ is the marginalized likelihood for the model parameters. Here, we employ the hierarchical probabilistic method developed by \\citet{Hogg10}, whereby the true distribution of a given quantity is inferred by taking as input a set of posterior samplings of that same quantity (obtained using an uninformative prior). According to this formalism, a sampling approximation to the marginalized likelihood for $\\boldsymbol{\\alpha}$ is given by\n\n", "index": 31, "text": "\\begin{equation}\n\\label{eq:marlike}\n\\mathcal{L}_{\\boldsymbol{\\alpha}} \\approx \\prod_{n=1}^N \\frac{1}{K} \\sum_{k=1}^K \\frac{f_{\\boldsymbol{\\alpha}}(\\cos i_{{\\rm s}\\,(nk)})}{p_0(\\cos i_{{\\rm s}\\,(nk)})} \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}_{\\boldsymbol{\\alpha}}\\approx\\prod_{n=1}^{N}\\frac{1}{K}\\sum_{k=1}^{%&#10;K}\\frac{f_{\\boldsymbol{\\alpha}}(\\cos i_{{\\rm s}\\,(nk)})}{p_{0}(\\cos i_{{\\rm s}%&#10;\\,(nk)})}\\,,\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>𝜶</mi></msub><mo>≈</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mfrac><mn>1</mn><mi>K</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>K</mi></munderover><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>f</mi><mi>𝜶</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mrow><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">s</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>p</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>i</mi><mrow><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">s</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]